{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:6:3", "titles": {"ar": "كتاب الْعِتْقِ وَ التَّدْبِيرِ وَ الْكِتَابَةِ", "en": "THE BOOK OF EMANCIPATION (LIBERATION), AND THE ARRANGEMENT, AND THE CONTRACT (OF SLAVES)"}}, {"indexed_titles": {"en": "Chapter 10"}, "path": "/books/al-kafi:6:3:10", "titles": {"ar": "باب الْمُدَبَّرِ", "en": "Chapter 10 – The arranged (emancipation)"}}], "index": 1685, "local_index": 10, "part_type": "Chapter", "path": "/books/al-kafi:6:3:10", "titles": {"ar": "باب الْمُدَبَّرِ", "en": "Chapter 10 – The arranged (emancipation)"}, "verse_count": 9, "verse_start_index": 11047, "verses": [{"index": 11048, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:3:10:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ قَالَ سَأَلْتُ أَبَا الْحَسَنِ الرِّضَا ( عليه السلام ) عَنِ الرَّجُلِ يُدَبِّرُ الْمَمْلُوكَ وَ هُوَ حَسَنُ الْحَالِ ثُمَّ يَحْتَاجُ هَلْ يَجُوزُ لَهُ أَنْ يَبِيعَهُ قَالَ نَعَمْ إِذَا احْتَاجَ إِلَى ذَلِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Al Washa whom said, \n‘I asked Abu Al-Hassan Al-Reza<sup>asws</sup> the man who arranged (the emancipation of) the owned slave and he was of good (financial) condition. Then he became needy. Is it allowed for him to sell him?’ He<sup>asws</sup> said: ‘Yes, when he is need for that’."}]}, {"index": 11049, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:3:10:2", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْمُدَبَّرِ فَقَالَ هُوَ بِمَنْزِلَةِ الْوَصِيَّةِ يَرْجِعُ فِيهَا وَ فِيمَا شَاءَ مِنْهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, form his father, from Ibn Abu Umeyr, from Muawiya Bin Ammar who said, \n‘I asked Abu Abdullah<sup>asws</sup> about the (slave of) arranged (emancipation), so he<sup>asws</sup> said: ‘He is at the status of the bequest. There is retraction in it, and whatever he so desires from it’."}]}, {"index": 11050, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:6:3:10:3", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الْمُدَبَّرِ أَ هُوَ مِنَ الثُّلُثِ فَقَالَ نَعَمْ وَ لِلْمُوصِي أَنْ يَرْجِعَ فِي صِحَّةٍ كَانَتْ وَصِيَّتُهُ أَوْ مَرَضٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr, from Zurara, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the (slave of) arranged (emancipation), is he from the third (of the bequest)?’ So he<sup>asws</sup> said: ‘Yes, and it is for the bequeather that he retracts during good health or illness, if it was his bequest’."}]}, {"index": 11051, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:6:3:10:4", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ دَبَّرَ جَارِيَتَهُ وَ هِيَ حُبْلَى فَقَالَ إِنْ كَانَ عَلِمَ بِحَبَلِهَا فَمَا فِي بَطْنِهَا بِمَنْزِلَتِهَا وَ إِنْ كَانَ لَمْ يَعْلَمْ فَمَا فِي بَطْنِهَا رِقٌّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Al Hassan Bin Ali Al Washa, \n(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who arranged (the emancipation of) his slave girl, and she was pregnant. So he<sup>asws</sup> said: ‘If he knew of her pregnancy, so whatever is in her belly would be of her status, and if he did not know, so whatever is in her belly, is a slave’."}]}, {"index": 11052, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:6:3:10:5", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى الْكِلَابِيِّ عَنْ أَبِي الْحَسَنِ الْأَوَّلِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ امْرَأَةٍ دَبَّرَتْ جَارِيَةً لَهَا فَوَلَدَتِ الْجَارِيَةُ جَارِيَةً نَفِيسَةً فَلَمْ تَعْلَمِ الْمَرْأَةُ حَالَ الْمَوْلُودَةِ مُدَبَّرَةٌ هِيَ أَوْ غَيْرُ مُدَبَّرَةٍ فَقَالَ لِي مَتَى كَانَ الْحَمْلُ بِالْمُدَبَّرَةِ أَ قَبْلَ أَنْ دَبَّرَتْ أَوْ بَعْدَ مَا دَبَّرَتْ فَقُلْتُ لَسْتُ أَدْرِي وَ لَكِنْ أَجِبْنِي فِيهِمَا جَمِيعاً \nفَقَالَ إِنْ كَانَتِ الْمَرْأَةُ دَبَّرَتْ وَ بِهَا حَبَلٌ وَ لَمْ تَذْكُرْ مَا فِي بَطْنِهَا فَإِنَّ الْجَارِيَةَ مُدَبَّرَةٌ وَ الْوَلَدَ رِقٌّ وَ إِنْ كَانَ إِنَّمَا حَدَثَ الْحَمْلُ بَعْدَ التَّدْبِيرِ فَالْوَلَدُ مُدَبَّرٌ فِي تَدْبِيرِ أُمِّهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Usman Bin Isa Al Kilaby, \n(It has been narrated) from Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup>, said, ‘I asked him<sup>asws</sup> about a woman who arranged (the emancipation of) her slave girl of hers. So, the slave girl have birth to a gem of a girl. So the woman does not know the state of the new-born whether she is of arranged (emancipation) or without an arranged (emancipation). So he<sup>asws</sup> said to me: ‘When was the pregnancy, with the arrangement of before she had the arranged (emancipation)?’ So I said, ‘I do not know, but answer me with regards to both (situations) together’.\nSo he<sup>asws</sup> said: ‘If it was such that the woman had an arrangement (of the emancipation) and with her was a pregnancy, and she had not mentioned what was in her belly, so the slave girl is with the arrangement and the child is a slave; and if it was rather a new pregnancy after the arrangement (of the emancipation), so the child is also with the arrangement (included) in the arrangement of its mother’."}]}, {"index": 11053, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:6:3:10:6", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ أَبَانِ بْنِ تَغْلِبَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ دَبَّرَ مَمْلُوكَتَهُ ثُمَّ زَوَّجَهَا مِنْ رَجُلٍ آخَرَ فَوَلَدَتْ مِنْهُ أَوْلَاداً ثُمَّ مَاتَ زَوْجُهَا وَ تَرَكَ أَوْلَادَهُ مِنْهَا فَقَالَ أَوْلَادُهُ مِنْهَا كَهَيْئَتِهَا فَإِذَا مَاتَ الَّذِي دَبَّرَ أُمَّهُمْ فَهُمْ أَحْرَارٌ\nقُلْتُ لَهُ أَ يَجُوزُ لِلَّذِي دَبَّرَ أُمَّهُمْ أَنْ يَرُدَّ فِي تَدْبِيرِهِ إِذَا احْتَاجَ قَالَ نَعَمْ قُلْتُ أَ رَأَيْتَ إِنْ مَاتَتْ أُمُّهُمْ بَعْدَ مَا مَاتَ الزَّوْجُ وَ بَقِيَ أَوْلَادُهَا مِنَ الزَّوْجِ الْحُرِّ أَ يَجُوزُ لِسَيِّدِهَا أَنْ يَبِيعَ أَوْلَادَهَا وَ أَنْ يَرْجِعَ عَلَيْهِمْ فِي التَّدْبِيرِ قَالَ لَا إِنَّمَا كَانَ لَهُ أَنْ يَرْجِعَ فِي تَدْبِيرِ أُمِّهِمْ إِذَا احْتَاجَ وَ رَضِيَتْ هِيَ بِذَلِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Abu Ayoub, from Aban Bin Taghlub who said, \n‘I asked Abu Abdullah<sup>asws</sup> about a man who arranged (the emancipation of) his slave girl. Then he got her married to another man. So she gave birth to children from him. Then her husband died, and left the children from her. So he<sup>asws</sup> said: ‘The children from her, are like her. So when the one who arranged (the emancipation of) her mother were to die, so they are free’. \nI said to him<sup>asws</sup>, ‘Is it allowed for the one who arranged (the emancipation) of their mother, that he retracts in his arrangement, when he is needy?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘What is your<sup>asws</sup> view if their mother were to die after the death of the husband, and her children from the free husband remain, is it allowed for her master that he sells her children, and if he retracts upon them regarding the arrangement?’ He<sup>asws</sup> said: ‘No. But rather, for him would be that he retracts regarding the arrangement of their mother when he is needy, and she is pleased with that’."}]}, {"index": 11054, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:6:3:10:7", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْمُدَبَّرُ مَمْلُوكٌ وَ لِمَوْلَاهُ أَنْ يَرْجِعَ فِي تَدْبِيرِهِ إِنْ شَاءَ بَاعَهُ وَ إِنْ شَاءَ وَهَبَهُ وَ إِنْ شَاءَ أَمْهَرَهُ \nقَالَ وَ إِنْ تَرَكَهُ سَيِّدُهُ عَلَى التَّدْبِيرِ وَ لَمْ يُحْدِثْ فِيهِ حَدَثاً حَتَّى يَمُوتَ سَيِّدُهُ فَإِنَّ الْمُدَبَّرَ حُرٌّ إِذَا مَاتَ سَيِّدُهُ وَ هُوَ مِنَ الثُّلُثِ إِنَّمَا هُوَ بِمَنْزِلَةِ رَجُلٍ أَوْصَى بِوَصِيَّةٍ ثُمَّ بَدَا لَهُ بَعْدُ فَغَيَّرَهَا مِنْ قَبْلِ مَوْتِهِ وَ إِنْ هُوَ تَرَكَهَا وَ لَمْ يُغَيِّرْهَا حَتَّى يَمُوتَ أُخِذَ بِهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad, from Ibn Mahboub, from Ali Bin Abu Hamza, from Abu Baseer, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The owned slave with the arranged (emancipation), and for his master is that he retracts regarding his arrangement, if he so desires to he sells him, and if he so desires to he gifts him, and if he so desires to he makes him as a dower’. \nHe<sup>asws</sup> said: ‘And if his master were to leave him upon the arrangement, and an event (of death) does not occur again until his master dies, so the arranged slave is free when his master dies, and he is from the third (of the bequest). But rather, he is at the status of a man who bequeaths with a bequest, then changes his mind for it, so he alters it from before his death; and if he were to leave him and does not change it until he dies, he would be seized by it’."}]}, {"index": 11055, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:6:3:10:8", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ بُرَيْدِ بْنِ مُعَاوِيَةَ الْعِجْلِيِّ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ رَجُلٍ دَبَّرَ مَمْلُوكاً لَهُ تَاجِراً مُوسِراً فَاشْتَرَى الْمُدَبَّرُ جَارِيَةً بِأَمْرِ مَوْلَاهُ فَوَلَدَتْ مِنْهُ أَوْلَاداً ثُمَّ إِنَّ الْمُدَبَّرَ مَاتَ قَبْلَ سَيِّدِهِ قَالَ فَقَالَ أَرَى أَنَّ جَمِيعَ مَا تَرَكَ الْمُدَبَّرُ مِنْ مَالٍ أَوْ مَتَاعٍ فَهُوَ لِلَّذِي دَبَّرَهُ وَ أَرَى أَنَّ أُمَّ وَلَدِهِ لِلَّذِي دَبَّرَهُ وَ أَرَى أَنَّ وُلْدَهَا مُدَبَّرُونَ كَهَيْئَةِ أَبِيهِمْ فَإِذَا مَاتَ الَّذِي دَبَّرَ أَبَاهُمْ فَهُمْ أَحْرَارٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Ali Bin Raib, from Bureyd Bin Muawiya Al Ajaly who said, \n‘I asked Abu Ja’far<sup>asws</sup> about a man who arranged (the emancipation) of an owned slave of his, a businessman, financially affluent. So the arranged slave buys a slave girl by the order of his master. So she gives birth to children from him. Then the arranged slave dies before his master. So he<sup>asws</sup> said: ‘I<sup>asws</sup> view that the entirety of what the arranged slave has left, from wealth or provisions, so it is for the one who had the arrangement for him, and I<sup>asws</sup> view that the mother of his children is for the one who had the arrangement, and I<sup>asws</sup> view that her children are (all) with the arrangement just like their father. So when the one who arranged for their father were to die, so they are free’."}]}, {"index": 11056, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:6:3:10:9", "text": "وَ بِإِسْنَادِهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ رَجُلٍ دَبَّرَ مَمْلُوكاً لَهُ ثُمَّ احْتَاجَ إِلَى ثَمَنِهِ فَقَالَ هُوَ مَمْلُوكُهُ إِنْ شَاءَ بَاعَهُ وَ إِنْ شَاءَ أَعْتَقَهُ وَ إِنْ شَاءَ أَمْسَكَهُ حَتَّى يَمُوتَ فَإِذَا مَاتَ السَّيِّدُ فَهُوَ حُرٌّ مِنْ ثُلُثِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "And by his chain, from Ibn Mahboub, from Abu Ayoub Al Khazzaz, from Muhammad Bin Muslim who said, \n‘I asked Abu Ja’far<sup>asws</sup> about a man who arranged (the emancipation of) an owned slave of his. Then he became needy to his price. So he<sup>asws</sup> said: ‘He is his slave, if he so desires to he sells him, and if he so desires to he emancipates him, and if he so desire to he keeps him until he dies. So when the master dies, so he is free, from his third (of the deceased)’."}]}]}, "index": "al-kafi:6:3:10", "kind": "verse_list"}