{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:6:3",
        "titles": {
          "ar": "كتاب الْعِتْقِ وَ التَّدْبِيرِ وَ الْكِتَابَةِ",
          "en": "THE BOOK OF EMANCIPATION (LIBERATION), AND THE ARRANGEMENT, AND THE CONTRACT (OF SLAVES)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 16"
        },
        "path": "/books/al-kafi:6:3:16",
        "titles": {
          "ar": "باب نَوَادِرَ",
          "en": "Chapter 16 - Miscellaneous"
        }
      }
    ],
    "index": 1699,
    "local_index": 16,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 17"
        },
        "path": "/books/al-kafi:6:3:17",
        "titles": {
          "ar": "باب الْوَلَاءِ لِمَنْ أَعْتَقَ",
          "en": "Chapter 17 – The guardianship is for the one who emancipates"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 15"
        },
        "path": "/books/al-kafi:6:3:15",
        "titles": {
          "ar": "باب أُمَّهَاتِ الْأَوْلَادِ",
          "en": "Chapter 15 – Mothers of the children"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:6:3",
        "titles": {
          "ar": "كتاب الْعِتْقِ وَ التَّدْبِيرِ وَ الْكِتَابَةِ",
          "en": "THE BOOK OF EMANCIPATION (LIBERATION), AND THE ARRANGEMENT, AND THE CONTRACT (OF SLAVES)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:3:16",
    "titles": {
      "ar": "باب نَوَادِرَ",
      "en": "Chapter 16 - Miscellaneous"
    },
    "verse_count": 15,
    "verse_start_index": 11102,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      }
    ],
    "verses": [
      {
        "index": 11103,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/111",
              "text": "هِشَامِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:3:16:1",
        "text": [
          " سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا حَاضِرٌ عَنْ رَجُلٍ بَاعَ مِنْ رَجُلٍ جَارِيَةً بِكَذَا إِلَى سَنَةٍ فَلَمَّا قَبَضَهَا الْمُشْتَرِي أَعْتَقَهَا مِنَ الْغَدِ وَ تَزَوَّجَهَا وَ جَعَلَ مَهْرَهَا عِتْقَهَا ثُمَّ مَاتَ بَعْدَ ذَلِكَ بِشَهْرٍ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنْ كَانَ لِلَّذِي اشْتَرَاهَا إِلَى سَنَةٍ مَالٌ أَوْ عُقْدَةٌ تُحِيطُ بِقَضَاءِ مَا عَلَيْهِ مِنَ الدَّيْنِ فِي رَقَبَتِهَا فَإِنَّ عِتْقَهُ وَ نِكَاحَهُ جَائِزَانِ ",
          "قَالَ وَ إِنْ لَمْ يَكُنْ لِلَّذِي اشْتَرَاهَا فَأَعْتَقَهَا وَ تَزَوَّجَهَا مَالٌ وَ لَا عُقْدَةٌ يَوْمَ مَاتَ تُحِيطُ بِقَضَاءِ مَا عَلَيْهِ مِنَ الدَّيْنِ بِرَقَبَتِهَا فَإِنَّ عِتْقَهُ وَ نِكَاحَهُ بَاطِلَانِ لِأَنَّهُ أَعْتَقَ مَا لَا يَمْلِكُ وَ أَرَى أَنَّهَا رِقٌّ لِمَوْلَاهَا الْأَوَّلِ ",
          "قِيلَ لَهُ فَإِنْ كَانَتْ عَلِقَتْ أَعْنِي مِنَ الْمُعْتِقِ لَهَا الْمُتَزَوِّجِ بِهَا مَا حَالُ الَّذِي فِي بَطْنِهَا فَقَالَ الَّذِي فِي بَطْنِهَا مَعَ أُمِّهِ كَهَيْئَتِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad, and Ali Bin Ibrahim, from his father, altogether, from Ibn Mahboub, from Hisham Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Abu Abdullah<sup>asws</sup> was asked and I was present, about a man who sold a slave girl to a man with such (and such a price) for up to a year. So when the buyer took possession of her, he emancipated her from the morning, and married her, and made her dower to be her emancipation. Then, a month later, he died. So Abu Abdullah<sup>asws</sup> said: ‘If there was wealth for the one who bought her, for up to a year, or a contract which overcomes the fulfillment of what is upon him from the debt with regards to her slavery, so his emancipation and his marriage are both allowed’.",
            "He<sup>asws</sup> said: ‘And if there does not happen to be any wealth for the one who bought her, so he emancipated her and married her, and there is no contract on the day he died which overcomes the fulfillment of what is upon him from the debts by her emancipation, so his emancipation and his marriage are both invalid, because he emancipated with what he did not own, and I<sup>asws</sup> view her as being a slave of her former master’. ",
            "It was said to him<sup>asws</sup>, ‘If it was such that she conceived, meaning from the emancipator of her, the one who married her, what is the state of that which is in her belly?’ So he<sup>asws</sup> said: ‘That which is in her belly is with its mother, like her’."
          ]
        }
      },
      {
        "index": 11104,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1349",
              "text": "ابْنُ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/6",
              "text": "الْعَلَاءِ بْنِ رَزِينٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4887",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام ) فِي الْمَمْلُوكِ يُعْطِي الرَّجُلَ مَالًا لِيَشْتَرِيَهُ فَيُعْتِقَهُ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "ابْنُ مَحْبُوبٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي الْمَمْلُوكِ يُعْطِي الرَّجُلَ مَالًا لِيَشْتَرِيَهُ فَيُعْتِقَهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:3:16:2",
        "text": [
          " لَا يَصْلُحُ لَهُ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Mahboub, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the slave who gives wealth to the man in order to buy him, so he would emancipate him. He<sup>asws</sup> said: ‘That is not correct for him’."
          ]
        }
      },
      {
        "index": 11105,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1349",
              "text": "ابْنُ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2103",
              "text": "إِبْرَاهِيمَ الْكَرْخِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "ابْنُ مَحْبُوبٍ عَنْ إِبْرَاهِيمَ الْكَرْخِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:3:16:3",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ هِشَامَ بْنَ أُدَيْنٍ سَأَلَنِي أَنْ أَسْأَلَكَ عَنْ رَجُلٍ جَعَلَ لِعَبْدِهِ الْعِتْقَ إِنْ حَدَثَ بِسَيِّدِهِ حَدَثُ الْمَوْتِ فَمَاتَ السَّيِّدُ وَ عَلَيْهِ تَحْرِيرُ رَقَبَةٍ وَاجِبَةٍ فِي كَفَّارَةٍ أَ يُجْزِئُ عَنِ الْمَيِّتِ عِتْقُ الْعَبْدِ الَّذِي كَانَ السَّيِّدُ جَعَلَ لَهُ الْعِتْقَ بَعْدَ مَوْتِهِ فِي تَحْرِيرِ الرَّقَبَةِ الَّتِي كَانَتْ عَلَى الْمَيِّتِ فَقَالَ لَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Mahboub, from Ibrahim Al Karkhy who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup> that Hisham Bin Adeyn asked me to ask you<sup>asws</sup> about a man who made the emancipation of his slave if there were to occur the event of death with his master. So the master died, and upon him was an Obligatory emancipation of a neck with regards to an expiation. Is it allowed, on behalf of the deceased, an emancipation of the slave for whom the master had made the emancipation to be for him, after his death, in the freeing of the neck which was upon the deceased?’ He<sup>asws</sup> said: ‘No’."
          ]
        }
      },
      {
        "index": 11106,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/61",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/141",
              "text": "أَحْمَدَ بْنِ إِسْحَاقَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1892",
              "text": "بَكْرِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ بَكْرِ بْنِ مُحَمَّدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:3:16:4",
        "text": [
          " سَأَلَهُ رَجُلٌ وَ أَنَا حَاضِرٌ فَقَالَ يَكُونُ لِيَ الْغُلَامُ فَيَشْرَبُ الْخَمْرَ وَ يَدْخُلُ فِي هَذِهِ الْأُمُورِ الْمَكْرُوهَةِ فَأُرِيدُ عِتْقَهُ فَهَلْ عِتْقُهُ أَحَبُّ إِلَيْكَ أَوْ أَبِيعُهُ وَ أَتَصَدَّقُ بِثَمَنِهِ فَقَالَ إِنَّ الْعِتْقَ فِي بَعْضِ الزَّمَانِ أَفْضَلُ وَ فِي بَعْضِ الزَّمَانِ الصَّدَقَةُ أَفْضَلُ فَإِذَا كَانَ النَّاسُ حَسَنَةً حَالُهُمْ فَالْعِتْقُ أَفْضَلُ فَإِذَا كَانُوا شَدِيدَةً حَالُهُمْ فَالصَّدَقَةُ أَفْضَلُ وَ بَيْعُ هَذَا أَحَبُّ إِلَيَّ إِذَا كَانَ بِهَذِهِ الْحَالِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Ahmad Bin Is’haq, from Bakr Bin Muhammad, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘A man asked him<sup>asws</sup> and I was present, so he said, ‘There happens to be a slave for me, so he drank the wine, and he entered into this matter (Al-Wilayah) unwillingly. So I intend to emancipate him. So is his emancipation more beloved to you<sup>asws</sup>, or I sell him, and I give in charity with his price?’ So he<sup>asws</sup> said: ‘The emancipation is better in certain times, and in certain times the charity is better. So when the state of the people was good, so the emancipation is better. So when they state was difficult (committing sins), so the charity is preferable; and selling this one is more beloved to me<sup>asws</sup>, when he was in this state’."
          ]
        }
      },
      {
        "index": 11107,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:3:16:5",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) يَقُولُ إِنَّ النَّاسَ كُلَّهُمْ أَحْرَارٌ إِلَّا مَنْ أَقَرَّ عَلَى نَفْسِهِ بِالْعُبُودِيَّةِ وَ هُوَ مُدْرِكٌ مِنْ عَبْدٍ أَوْ أَمَةٍ وَ مَنْ شُهِدَ عَلَيْهِ بِالرِّقِّ صَغِيراً كَانَ أَوْ كَبِيراً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Abdullah Bin Sinan who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Amir Al-Momineen<sup>asws</sup> was saying that the people, all of them are free, except for the one who confesses upon himself with the slavery, and he was an adult from a slave, or a slave girl; and the one against who is testified with the slavery, whether he was young or old’."
          ]
        }
      },
      {
        "index": 11108,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/57",
              "text": "عَلِيٌّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/853",
              "text": "دَاوُدَ النَّهْدِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/50",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيٌّ عَنْ أَبِيهِ عَنْ دَاوُدَ النَّهْدِيِّ عَنْ بَعْضِ أَصْحَابِنَا قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:3:16:6",
        "relations": {
          "Mentions": [
            "/books/quran:36:39"
          ]
        },
        "text": [
          " دَخَلَ ابْنُ أَبِي سَعِيدٍ الْمُكَارِي عَلَى أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) فَقَالَ لَهُ أَبْلَغَ اللَّهُ مِنْ قَدْرِكَ أَنْ تَدَّعِيَ مَا ادَّعَى أَبُوكَ فَقَالَ لَهُ مَا لَكَ أَطْفَأَ اللَّهُ نُورَكَ وَ أَدْخَلَ الْفَقْرَ بَيْتَكَ أَ مَا عَلِمْتَ أَنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى أَوْحَى إِلَى عِمْرَانَ أَنِّي وَاهِبٌ لَكَ ذَكَراً فَوَهَبَ لَهُ مَرْيَمَ وَ وَهَبَ لِمَرْيَمَ عِيسَى ( عليه السلام ) فَعِيسَى مِنْ مَرْيَمَ وَ مَرْيَمُ مِنْ عِيسَى وَ مَرْيَمُ وَ عِيسَى شَيْ‏ءٌ وَاحِدٌ وَ أَنَا مِنْ أَبِي وَ أَبِي مِنِّي وَ أَنَا وَ أَبِي شَيْ‏ءٌ وَاحِدٌ ",
          "قَالَ فَخَرَجَ مِنْ عِنْدِهِ وَ افْتَقَرَ حَتَّى مَاتَ وَ لَمْ يَكُنْ عِنْدَهُ مَبِيتُ لَيْلَةٍ لَعَنَهُ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Dawood Al Nahdy, from one of our companions who said, ",
            "‘Ibn Abu Saeed came over to Abu Al-Hassan Al-Reza<sup>asws</sup>, so he said to him<sup>asws</sup>, ‘May Allah<sup>azwj</sup> Denounce your<sup>asws</sup> abilities if you<sup>asws</sup> were to claim what your<sup>asws</sup> father<sup>asws</sup> claimed’. So he<sup>asws</sup> said to him: ‘What is the matter with you? May Allah<sup>azwj</sup> Extinguish your light, and enter the poverty into your house. Do you not know that Allah<sup>azwj</sup> Blessed and High Revealed unto Imran<sup>sa</sup> that I<sup>azwj</sup> shall Endow a male to you<sup>sa</sup>, so He<sup>azwj</sup> Endowed to him<sup>sa</sup> Maryam<sup>sa</sup>, and Endowed unto Maryam<sup>sa</sup>, Isa<sup>sa</sup>. Thus Isa<sup>sa</sup> is from Maryam<sup>sa</sup>, and Maryam<sup>sa</sup> is from Isa<sup>sa</sup>, and Maryam<sup>sa</sup> & Isa<sup>sa</sup> are one thing; and I<sup>asws</sup> am from my<sup>asws</sup> father<sup>asws</sup>, and my<sup>asws</sup> father<sup>asws</sup> is from me<sup>asws</sup>, and I<sup>asws</sup> & my<sup>asws</sup> father<sup>asws</sup> are one thing’.",
            "فَقَالَ لَهُ ابْنُ أَبِي سَعِيدٍ وَ أَسْأَلُكَ عَنْ مَسْأَلَةٍ فَقَالَ لَا إِخَالُكَ تَقْبَلُ مِنِّي وَ لَسْتَ مِنْ غَنَمِي وَ لَكِنْ هَلُمَّهَا فَقَالَ رَجُلٌ قَالَ عِنْدَ مَوْتِهِ كُلُّ مَمْلُوكٍ لِي قَدِيمٍ فَهُوَ حُرٌّ لِوَجْهِ اللَّهِ قَالَ نَعَمْ إِنَّ اللَّهَ عَزَّ ذِكْرُهُ يَقُولُ فِي كِتَابِهِ حَتَّى عادَ كَالْعُرْجُونِ الْقَدِيمِ فَمَا كَانَ مِنْ مَمَالِيكِهِ أَتَى عَلَيْهِ سِتَّةُ أَشْهُرٍ فَهُوَ قَدِيمٌ وَ هُوَ حُرٌّ",
            "So Ibn Abu Saeed said to him<sup>asws</sup>, ‘And I ask you<sup>asws</sup> a question’. So he said, ‘I am not contravening you<sup>asws</sup>. Accept from me, and there is none from my efforts but I bring it forward’. So he said: ‘A man said during his death, ‘Every owned slave of mine from old, so he is free for the Face of Allah<sup>azwj</sup>’. He<sup>asws</sup> said: ‘Yes. Allah<sup>azwj</sup> Mighty is His<sup>azwj</sup> Mention is saying in His<sup>azwj</sup> Book <span class=\"ibTxt\"><a href=\"/#/books/quran:36#h39\">[36:39]</a> till it becomes again as an old dry palm branch</span>. Thus whatever was from his owned slave, whom six months have come upon, so he is from old, and he is free’. ",
            "He (the narrator) said, ‘So he went out from his<sup>asws</sup> presence, and contemplated until he died, and there did not happen to be an overnight stay. May Allah<sup>azwj</sup> Curse him’."
          ]
        }
      },
      {
        "index": 11109,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/460",
              "text": "أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4498",
              "text": "عَبْدِ اللَّهِ بْنِ الْفَضْلِ الْهَاشِمِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/235",
              "text": "أَبِيهِ رَفَعَهُ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ الْهَاشِمِيِّ عَنْ أَبِيهِ رَفَعَهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:3:16:7",
        "text": [
          " قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي رَجُلٍ نَكَحَ وَلِيدَةَ رَجُلٍ أَعْتَقَ رَبُّهَا أَوَّلَ وَلَدٍ تَلِدُهُ فَوَلَدَتْ تَوْأَماً فَقَالَ أُعْتِقَ كِلَاهُمَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from his father, from Abdullah Bin Al Fazl Al Hashimy, from his father, raising it, ",
            "‘He<sup>asws</sup> said: ‘Amir Al-Momineen<sup>asws</sup> judged regarding a man who married a child of a man whose lord had emancipated the first child she gave birth to. So she gave birth to twins. So he<sup>asws</sup> said: ‘Both of them are emancipated’."
          ]
        }
      },
      {
        "index": 11110,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/976",
              "text": "عَلِيِّ بْنِ مَهْزِيَارَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:3:16:8",
        "text": [
          " كَتَبْتُ إِلَيْهِ أَسْأَلُهُ عَنِ الْمَمْلُوكِ يَحْضُرُهُ الْمَوْتُ فَيُعْتِقُهُ الْمَوْلَى فِي تِلْكَ السَّاعَةِ فَيَخْرُجُ مِنَ الدُّنْيَا حُرّاً فَهَلْ لِمَوْلَاهُ فِي ذَلِكَ أَجْرٌ أَوْ يَتْرُكُهُ فَيَكُونُ لَهُ أَجْرُهُ إِذَا مَاتَ وَ هُوَ مَمْلُوكٌ فَكَتَبَ إِلَيْهِ يَتْرُكُ الْعَبْدَ مَمْلُوكاً فِي حَالِ مَوْتِهِ فَهُوَ أَجْرٌ لِمَوْلَاهُ وَ هَذَا عِتْقٌ فِي هَذِهِ السَّاعَةِ لَيْسَ بِنَافِعٍ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, ",
            "(It has been narrated) from Ali Bin Mahziyar who wrote to him<sup>asws</sup> asking him<sup>asws</sup> about the owned slave to whom death presented itself. So the master emancipates him during that moment. So he exited from the world a free man. So, is it for his master with regards to that, a recompense, or he leaves him so there would happen to be a recompense for him when he dies and he is an owned slave?’ So he<sup>asws</sup> wrote to him: ‘He should leave the slave as owned during the state of his death, so it is a recompense for his master, and this emancipation during these times, is not beneficial for him’."
          ]
        }
      },
      {
        "index": 11111,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/345",
              "text": "سَلَمَةَ بْنِ الْخَطَّابِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4888",
              "text": "عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ نَهِيكٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4889",
              "text": "عَلِيِّ بْنِ الْحَارِثِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1156",
              "text": "صَبَّاحٍ الْمُزَنِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2034",
              "text": "نَاجِيَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ نَهِيكٍ عَنْ عَلِيِّ بْنِ الْحَارِثِ عَنْ صَبَّاحٍ الْمُزَنِيِّ عَنْ نَاجِيَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:3:16:9",
        "text": [
          " رَأَيْتُ رَجُلًا عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لَهُ جُعِلْتُ فِدَاكَ إِنِّي أَعْتَقْتُ خَادِماً لِي وَ هُوَ ذَا أَطْلُبُ شِرَاءَ خَادِمٍ مُنْذُ سِنِينَ فَمَا أَقْدِرُ عَلَيْهَا فَقَالَ مَا فَعَلَتِ الْخَادِمُ قَالَ حَيَّةٌ قَالَ رُدَّهَا فِي مَمْلُوكَتِهَا مَا أَغْنَى اللَّهَ مِنْ عِتْقِ أَحَدِكُمْ تُعْتِقُونَ الْيَوْمَ وَ يَكُونُ عَلَيْنَا غَداً لَا يَجُوزُ لَكُمْ أَنْ تُعْتِقُوا إِلَّا عَارِفاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from salma Bin Al Khattab, from Abdullah Bin Muhammad Bin Naheyk, from Ali Bin Al Haris, from Sabbah Al Muzny, from Najiya who said, ",
            "‘I saw a man in the presence of Abu Abdullah<sup>asws</sup>, so he said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! I emancipated a female servant of mine and she was a sought after attendant for years. So what do I value upon her?’ So he<sup>asws</sup> said: ‘What does the attendant do?’ He<sup>asws</sup> said: ‘She is a snake (hypocrite)’. He<sup>asws</sup> said: ‘Return her in her slavery. Whatever Allah<sup>azwj</sup> has Made one of you to be self-sufficient from emancipation, you are emancipating today, and it would happen upon us<sup>asws</sup> tomorrow. It is not allowed for you that you emancipate except one whom you recognise’."
          ]
        }
      },
      {
        "index": 11112,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/642",
              "text": "الْعَمْرَكِيِّ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/643",
              "text": "عَلِيِّ بْنِ جَعْفَرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4890",
              "text": "أَخِيهِ أَبِي الْحَسَنِ مُوسَى ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنِ الْعَمْرَكِيِّ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَخِيهِ أَبِي الْحَسَنِ مُوسَى ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:3:16:10",
        "text": [
          " سَأَلْتُهُ عَنْ رَجُلٍ عَلَيْهِ عِتْقُ رَقَبَةٍ وَ أَرَادَ أَنْ يُعْتِقَ نَسَمَةً أَيُّهُمَا أَفْضَلُ أَنْ يُعْتِقَ شَيْخاً كَبِيراً أَوْ شَابّاً أَجْرَدَ قَالَ أَعْتَقَ مَنْ أَغْنَى نَفْسَهُ الشَّيْخُ الْكَبِيرُ الضَّعِيفُ أَفْضَلُ مِنَ الشَّابِّ الْأَجْرَدِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Al Amraky Bin Ali, ",
            "(It has been narrated) from Ali son of Ja’far<sup>asws</sup>, from his brother<sup>asws</sup> Abu Al-Hassan Musa<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man upon whom is the emancipation of a neck, and he intended to emancipate a person. Which of these two is better, if he emancipates an old man, or a beardless youth?’ He<sup>asws</sup> said: ‘Emancipate the one who can be self-sufficient himself. The old weak sheikh is better than the beardless youth’."
          ]
        }
      },
      {
        "index": 11113,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/460",
              "text": "أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/131",
              "text": "أَبِي الْبَخْتَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ أَبِي الْبَخْتَرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:3:16:11",
        "text": [
          " إِنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ لَا يَجُوزُ فِي الْعَتَاقِ الْأَعْمَى وَ الْمُقْعَدُ وَ يَجُوزُ الْأَشَلُّ وَ الْأَعْرَجُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from his father, from Abu Al Bakhtary, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said that Amir Al-Momineen<sup>asws</sup> said: ‘It is not allowed in the emancipations – the blind, and the seated cripple, and it is allowed – the paralysed and the lame’."
          ]
        }
      },
      {
        "index": 11114,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/857",
              "text": "أَحْمَدُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1497",
              "text": "عِدَّةٍ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/92",
              "text": "عَلِيِّ بْنِ أَسْبَاطٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2021",
              "text": "مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4891",
              "text": "بَعْضِ آلِ أَعْيَنَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ عَنْ عِدَّةٍ مِنْ أَصْحَابِنَا عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ زُرَارَةَ عَنْ بَعْضِ آلِ أَعْيَنَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:3:16:12",
        "text": [
          " مَنْ كَانَ مُؤْمِناً فَقَدْ عَتَقَ بَعْدَ سَبْعِ سِنِينَ أَعْتَقَهُ صَاحِبُهُ أَمْ لَمْ يُعْتِقْهُ وَ لَا تَحِلُّ خِدْمَةُ مَنْ كَانَ مُؤْمِناً بَعْدَ سَبْعِ سِنِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad, from a number of our companions, from Ali Bin Asbaat, from Muhammad Bin Abdullah Bin Zurara, from one of the progeny of A’ayn, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who was a Believer, so he is emancipated after seven years, whether his master emancipates him or does not emancipate him, and it is not Permissible to have the services of the one who was a Believer after seven years’."
          ]
        }
      },
      {
        "index": 11115,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/576",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1260",
              "text": "إِسْمَاعِيلَ بْنِ سَهْلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4177",
              "text": "مُعَاوِيَةَ بْنِ مَيْسَرَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ إِسْمَاعِيلَ بْنِ سَهْلٍ عَنْ مُعَاوِيَةَ بْنِ مَيْسَرَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:3:16:13",
        "text": [
          " سَأَلْتُهُ عَنْ رَجُلٍ يَبِيعُ عَبْدَهُ بِنُقْصَانٍ مِنْ ثَمَنِهِ لِيُعْتَقَ فَقَالَ لَهُ الْعَبْدُ فِيمَا بَيْنَهُمَا إِنَّ لَكَ عَلَيَّ كَذَا وَ كَذَا أَ يَأْخُذُهُ مِنْهُ فَقَالَ يَأْخُذُهُ مِنْهُ عَفْواً وَ يَسْأَلُهُ إِيَّاهُ فِي عَفْوِهِ فَإِنْ أَبَى فَلْيَدَعْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Al Ashary, from Muhammad Bin Abdul Jabbar, from Ismail Bin Sahl, from Muawiya Bin Maysara, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who sold his slave at a loss from his price in order to emancipate. So the slave said to him, ‘With regards to what is between the two (prices), for you, upon me is such and such’. Can he take it from him?’ So he<sup>asws</sup> said: ‘He takes it from him as a pardon, and he asks him for it to be excused. So if he (master) refuses, so let him (the slave) pay it’."
          ]
        }
      },
      {
        "index": 11116,
        "local_index": 14,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/330",
              "text": "إِسْمَاعِيلَ بْنِ مَرَّارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/152",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:3:16:14",
        "text": [
          " فِي رَجُلٍ كَانَ لَهُ عِدَّةُ مَمَالِيكَ فَقَالَ أَيُّكُمْ عَلَّمَنِي آيَةً مِنْ كِتَابِ اللَّهِ عَزَّ وَ جَلَّ فَهُوَ حُرٌّ فَعَلَّمَهُ وَاحِدٌ مِنْهُمْ ثُمَّ مَاتَ الْمَوْلَى وَ لَمْ يُدْرَ أَيُّهُمُ الَّذِي عَلَّمَهُ الْآيَةَ هَلْ يُسْتَخْرَجُ بِالْقُرْعَةِ قَالَ نَعَمْ وَ لَا يَجُوزُ أَنْ يَسْتَخْرِجَهُ أَحَدٌ إِلَّا الْإِمَامُ فَإِنَّ لَهُ كَلَاماً وَقْتَ الْقُرْعَةِ يَقُولُهُ وَ دُعَاءً لَا يَعْلَمُهُ سِوَاهُ وَ لَا يَقْتَدِرُ عَلَيْهِ غَيْرُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus, ",
            "‘He<sup>asws</sup> said regarding a man who had a number of owned slaves. So he said, ‘Whichever of you teaches me a Verse from the Book of Allah<sup>azwj</sup> Mighty and Majestic, so he is free’. So one of them taught him. Then the master died, and it was not known which of them was the one who taught him the Verse. Can a lot be drawn?’ He<sup>asws</sup> said: ‘Yes, and it is not allowed for anyone to extract him except for the Imam<sup>asws</sup>, as for it is speech (to be recited), and a time for the drawing of lots, and a supplication which no one knows besides him<sup>asws</sup>, nor is anyone able over it apart from him<sup>asws</sup>’."
          ]
        }
      },
      {
        "index": 11117,
        "local_index": 15,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/173",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2172",
              "text": "أَبِي مَخْلَدٍ السَّرَّاجِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ أَبِي مَخْلَدٍ السَّرَّاجِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:3:16:15",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لِإِسْمَاعِيلَ حَقِيبَةَ وَ الْحَارِثِ النَّصْرِيِّ اطْلُبُوا لِي جَارِيَةً مِنْ هَذَا الَّذِي يُسَمُّونَهُ كَدْبَانُوجَةَ تَكُونُ مَعَ أُمِّ فَرْوَةَ فَدَلُّونَا عَلَى جَارِيَةٍ لِرَجُلٍ مِنَ السَّرَّاجِينَ قَدْ وَلَدَتْ لَهُ ابْناً وَ مَاتَ وَلَدُهَا فَأَخْبَرُوهُ بِخَبَرِهَا فَأَمَرَهُمْ فَاشْتَرَوْهَا وَ كَانَ اسْمُهَا رِسَالَةَ فَغَيَّرَ اسْمَهَا وَ سَمَّاهَا سَلْمَى وَ زَوَّجَهَا سَالِماً مَوْلَاهُ وَ هِيَ أُمُّ الْحُسَيْنِ بْنِ سَالِمٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Safwan Bin Yahya, from Abu Makhlad Al Sarraj who said, ",
            "‘Abu Abdullah<sup>asws</sup> said to Ismail Haqeeba and Al-Haris Al-nasry: ‘Seek out a slave girl for me from this which they call ‘Kadabanouj’, she can be with Umm Farwa<sup>as</sup>’. So they pointed us to a slave girl of a man from Al-Sarrajeen who had given birth to a son for him, and her son had died. So they informed him with her news. So, he ordered them, and they bought her, and her name was Rasala, so he<sup>asws</sup> changed her name and called her Salma, and Salim, her master, married her, and she is a mother of Al-Husayn Bin Saalim’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:3:16",
  "kind": "verse_list"
}