{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:6:4", "titles": {"ar": "كتاب الصَّيْدِ", "en": "THE BOOK OF HUNTING"}}, {"indexed_titles": {"en": "Chapter 15"}, "path": "/books/al-kafi:6:4:15", "titles": {"ar": "باب الْخُطَّافِ", "en": "Chapter 15 – The swallow"}}], "index": 1709, "local_index": 15, "part_type": "Chapter", "path": "/books/al-kafi:6:4:15", "titles": {"ar": "باب الْخُطَّافِ", "en": "Chapter 15 – The swallow"}, "verse_count": 3, "verse_start_index": 11235, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 11236, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:4:15:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ مُحَمَّدِ</span> بْنِ بُنْدَارَ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ عَنْ عَلِيِّ بْنِ مُحَمَّدٍ رَفَعَهُ إِلَى دَاوُدَ الرَّقِّيِّ أَوْ غَيْرِهِ قَالَ بَيْنَا نَحْنُ قُعُودٌ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِذْ مَرَّ رَجُلٌ بِيَدِهِ خُطَّافٌ مَذْبُوحٌ فَوَثَبَ إِلَيْهِ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) حَتَّى أَخَذَهُ مِنْ يَدِهِ ثُمَّ دَحَا بِهِ الْأَرْضَ فَقَالَ ( عليه السلام ) أَ عَالِمُكُمْ أَمَرَكُمْ بِهَذَا أَمْ فَقِيهُكُمْ أَخْبَرَنِي أَبِي عَنْ جَدِّي أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) نَهَى عَنْ قَتْلِ السِّتَّةِ مِنْهَا الْخُطَّافُ ", "وَ قَالَ إِنَّ دَوَرَانَهُ فِي السَّمَاءِ أَسَفاً لِمَا فُعِلَ بِأَهْلِ بَيْتِ مُحَمَّدٍ ( صلى الله عليه وآله ) وَ تَسْبِيحَهُ قِرَاءَةُ الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ أَ لَا تَرَوْنَهُ يَقُولُ وَ لَا الضَّالِّينَ ."], "translations": {"en.hubeali": ["Ali Bin Muhammad Bin Bundar, from Ibrahim Bin Is’haq, from Ali Bin Muhammad, raising it to Dawood Al Raqqy, or someone else who said, ", "‘While we were seated in the presence of Abu Abdullah<sup>asws</sup>, when a man passed by in whose hand was a slaughtered swallow. So Abu Abdullah<sup>asws</sup> leapt over to him until he<sup>asws</sup> seized it from his hand, then levelled the ground with it, so he<sup>asws</sup> said: ‘Has your scholar or your jurist ordered you with this? My<sup>asws</sup> father<sup>asws</sup> informed me<sup>asws</sup> that my<sup>asws</sup> grandfather<sup>saww</sup> Rasool-Allah<sup>saww</sup> forbade from killing the six, from these was the swallow’. ", "And he<sup>asws</sup> said: ‘It encircling in the sky is (its expression of) regret at what was done with the People<sup>asws</sup> of the Household of Muhammad<sup>saww</sup>, and its Glorification is its recitation of ‘The Praise is for Allah<sup>azwj</sup> the Lord<sup>azwj</sup> of the Worlds’. Are you not seeing it saying (chirping) ‘<span class=\"iTxt\">Wa la Zalleeen</span> (and not those who go astray)’?’"]}}, {"index": 11237, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:4:15:2", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ جَمِيعاً عَنِ الْجَامُورَانِيِّ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ مُحَمَّدِ بْنِ يُوسُفَ التَّمِيمِيِّ عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) اسْتَوْصُوا بِالصِّنِينَاتِ خَيْراً يَعْنِي الْخُطَّافَ فَإِنَّهُنَّ آنَسُ طَيْرِ النَّاسِ بِالنَّاسِ ", "ثُمَّ قَالَ وَ تَدْرُونَ مَا تَقُولُ الصِّنِينَةُ إِذَا مَرَّتْ وَ تَرَنَّمَتْ تَقُولُ بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ حَتَّى قَرَأَ أُمَّ الْكِتَابِ فَإِذَا كَانَ آخِرُ تَرَنُّمِهَا قَالَتْ وَ لَا الضَّالِّينَ مَدَّ بِهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) صَوْتَهُ وَ لَا الضَّالِّينَ ."], "translations": {"en.hubeali": ["A number of our companions, from sahl Bin Ziyad, and Ahmad Bin Abu Abdullah, altogether from Al Jamourany, from Al Hassan Bin Ali Bin Abu Hamza, from Muhammad Bin Yusuf Al Tameemy, ", "(It has been narrated) from Muhammad son of Ja’far<sup>asws</sup>, from his father<sup>asws</sup> who said, ‘Rasool-Allah<sup>saww</sup> said: ‘Treat the wagtails with goodness, meaning the swallows, for these are the friendliest of the birds of the people with the people’. ", "Then he<sup>saww</sup> said: ‘And are you knowing what the wagtail (swallow) is saying when it passes by and sings? She is saying, ‘In the Name of Allah<sup>azwj</sup> the Beneficent, the Merciful. The Praise is for Allah<sup>azwj</sup> Lord<sup>azwj</sup> of the Worlds’ – until he<sup>saww</sup> recited the ‘Mother of the Book’ (<span class=\"iTxt\">Surah Al-Fatiha</span>, Chapter 1). So when it comes the end of its singing, so she says, ‘<span class=\"iTxt\">Wa La Zalleeen</span>’ (last Words of <span class=\"iTxt\">Surah al-Fatiha</span>). Rasool-Allah<sup>saww</sup> extended his<sup>saww</sup> voice with it, ‘<span class=\"iTxt\">Wa La Zalleen</span>’."]}}, {"index": 11238, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:6:4:15:3", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَتْلِ الْخُطَّافِ أَوْ إِيذَائِهِنَّ فِي الْحَرَمِ فَقَالَ لَا يُقْتَلْنَ فَإِنِّي كُنْتُ مَعَ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) فَرَآنِي وَ أَنَا أُوذِيهِنَّ فَقَالَ لِي يَا بُنَيَّ لَا تَقْتُلْهُنَّ وَ لَا تُؤْذِهِنَّ فَإِنَّهُنَّ لَا يُؤْذِينَ شَيْئاً ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel Bin Darraj who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about killing the swallows, or hurting them in the Sanctuary. So he<sup>asws</sup> said: ‘Do not kill them, for I<sup>asws</sup> was in the presence of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, so he<sup>asws</sup> saw me<sup>asws</sup> troubling them. So he<sup>asws</sup> said: ‘O my<sup>asws</sup> son<sup>asws</sup>! Do not kill them and do not harm them, for they are not harming anything’."]}}]}, "index": "al-kafi:6:4:15", "kind": "verse_list"}