{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:6:4",
        "titles": {
          "ar": "كتاب الصَّيْدِ",
          "en": "THE BOOK OF HUNTING"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 17"
        },
        "path": "/books/al-kafi:6:4:17",
        "titles": {
          "ar": "باب الْقُنْبُرَةِ",
          "en": "Chapter 17 – The Grouse"
        }
      }
    ],
    "index": 1719,
    "local_index": 17,
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:4:17",
    "titles": {
      "ar": "باب الْقُنْبُرَةِ",
      "en": "Chapter 17 – The Grouse"
    },
    "verse_count": 4,
    "verse_start_index": 11251,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/372)"
        ],
        "index": 11252,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:4:17:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ عَلِيِّ بْنِ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ أَبِي أَيُّوبَ الْمَدِينِيِّ عَنْ سُلَيْمَانَ الْجَعْفَرِيِّ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) عَنْ أَبِيهِ عَنْ جَدِّهِ ( عليهم السلام ) قَالَ لَا تَأْكُلُوا الْقُنْبُرَةَ وَ لَا تَسُبُّوهَا وَ لَا تُعْطُوهَا الصِّبْيَانَ يَلْعَبُونَ بِهَا فَإِنَّهَا كَثِيرَةُ التَّسْبِيحِ لِلَّهِ تَعَالَى وَ تَسْبِيحُهَا لَعَنَ اللَّهُ مُبْغِضِي آلِ مُحَمَّدٍ ( عليهم السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Ali Bin Muhammad Bin Suleyman, from Abu Ayoub Al Madainy, from Suleyman Al Ja’fary, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup>, from his<sup>asws</sup> father<sup>asws</sup>, from his<sup>asws</sup> grandfather<sup>asws</sup> having said: ‘Do not eat the grouse, nor insult it, nor give it to the children to play with it, for it frequents the Glorification of Allah<sup>azwj</sup>, and its Glorification is, ‘May Allah<sup>azwj</sup> Curse those who hate the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from Ali ibn Muhammad ibn Sulayman from abu Ayyub al- Madiniy from Sulayman al-Ja‘fariy who has said the following: “Abu al-Hassan, al-Rida’, ‘Alayhi al-Salam, has narrated from his father this Hadith. ’Do not use lark for food, do not abuse it and do not give it to children to play with; it says Tasbih a great deal and it is, ‘O Allah, condemn those who hate Muhammad and his family, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/372)"
        ],
        "index": 11253,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:4:17:2",
        "text": [
          "وَ بِإِسْنَادِهِ قَالَ كَانَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) يَقُولُ مَا أَزْرَعُ الزَّرْعَ لِطَلَبِ الْفَضْلِ فِيهِ وَ مَا أَزْرَعُهُ إِلَّا لِيَنَالَهُ الْمُعْتَرُّ وَ ذُو الْحَاجَةِ وَ تَنَالَهُ الْقُنْبُرَةُ مِنْهُ خَاصَّةً مِنَ الطَّيْرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by his chain, said, ",
            "‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> was saying: ‘I do not farm the plantation in order to seek the Grace in it, and I<sup>asws</sup> do not farm except for the beggar to take from it, and the one with the need, and what the grouse takes from it, particularly from the birds’."
          ],
          "en.sarwar": [
            "2. Through the same chain of narrators as that of the previous Hadith the following is narrated: “Ali ibn al-Husayn, ‘Alayhi al-Salam, has said, ‘I do not work in plantation for gains except that I want this gain for the destitute, the needy and especially for the lark among birds/” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/372)"
        ],
        "index": 11254,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:4:17:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَبِي عَبْدِ اللَّهِ الْجَامُورَانِيِّ عَنْ سُلَيْمَانَ الْجَعْفَرِيِّ قَالَ سَمِعْتُ أَبَا الْحَسَنِ الرِّضَا ( عليه السلام ) يَقُولُ لَا تَقْتُلُوا الْقُنْبُرَةَ وَ لَا تَأْكُلُوا لَحْمَهَا فَإِنَّهَا كَثِيرَةُ التَّسْبِيحِ تَقُولُ فِي آخِرِ تَسْبِيحِهَا لَعَنَ اللَّهُ مُبْغِضِي آلِ مُحَمَّدٍ ( عليهم السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Abu Abdullah Al Jamourany, from Suleyman Al Ja’fary who said, ",
            "‘I heard Abu Al-Hassan Al-Reza<sup>asws</sup> saying:’ Do not kill the grouse, and do not eat its flesh, for it is frequent in the Glorification. She is saying at the end of its Glorification. ‘May Allah<sup>azwj</sup> Curse those who hate the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from abu ‘Abd Allah, al-Jamuraniy from Sulayman al-Ja‘fariy who has said the following: “I once heard abu al-Hassan, al-Rida’, ‘Alayhi al-Salam, saying, ’Do not kill the lark and do not use its flesh for food, because it says a great deal of Tasbih (Allah is free of all defects) and at the end it says, ‘May Allah condemn those who hate the family of Muhammad, ‘Alayhim al-Salam.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/372)"
        ],
        "index": 11255,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:4:17:4",
        "text": [
          "مُحَمَّدُ بْنُ الْحَسَنِ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ الْهَاشِمِيُّ عَنْ بَعْضِ أَصْحَابِنَا عَنْ سُلَيْمَانَ بْنِ جَعْفَرٍ الْجَعْفَرِيِّ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ قَالَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) الْقُنْزُعَةُ الَّتِي عَلَى رَأْسِ الْقُنْبُرَةِ مِنْ مَسْحَةِ سُلَيْمَانَ بْنِ دَاوُدَ وَ ذَلِكَ أَنَّ الذَّكَرَ أَرَادَ أَنْ يَسْفَدَ أُنْثَاهُ فَامْتَنَعَتْ عَلَيْهِ فَقَالَ لَهَا لَا تَمْتَنِعِي فَمَا أُرِيدُ إِلَّا أَنْ يُخْرِجَ اللَّهُ عَزَّ وَ جَلَّ مِنِّي نَسَمَةً تُذَكَّرُ بِهِ فَأَجَابَتْهُ إِلَى مَا طَلَبَ",
          "فَلَمَّا أَرَادَتْ أَنْ تَبِيضَ قَالَ لَهَا أَيْنَ تُرِيدِينَ أَنْ تَبِيضِي فَقَالَتْ لَهُ لَا أَدْرِي أُنَحِّيهِ عَنِ الطَّرِيقِ قَالَ لَهَا إِنِّي خَائِفٌ أَنْ يَمُرَّ بِكِ مَارُّ الطَّرِيقِ وَ لَكِنِّي أَرَى لَكِ أَنْ تَبِيضِي قُرْبَ الطَّرِيقِ فَمَنْ يَرَاكِ قُرْبَهُ تَوَهَّمَ أَنَّكِ تَعْرِضِينَ لِلَقْطِ الْحَبِّ مِنَ الطَّرِيقِ فَأَجَابَتْهُ إِلَى ذَلِكَ وَ بَاضَتْ وَ حَضَنَتْ حَتَّى أَشْرَفَتْ عَلَى النِّقَابِ",
          "فَبَيْنَا هُمَا كَذَلِكَ إِذْ طَلَعَ سُلَيْمَانُ بْنُ دَاوُدَ ( عليه السلام ) فِي جُنُودِهِ وَ الطَّيْرُ تُظِلُّهُ فَقَالَتْ لَهُ هَذَا سُلَيْمَانُ قَدْ طَلَعَ عَلَيْنَا فِي جُنُودِهِ وَ لَا آمَنُ أَنْ يَحْطِمَنَا وَ يَحْطِمَ بَيْضَنَا فَقَالَ لَهَا إِنَّ سُلَيْمَانَ ( عليه السلام ) لَرَجُلٌ رَحِيمٌ بِنَا فَهَلْ عِنْدَكِ شَيْ‏ءٌ هَيَّئْتِهِ لِفِرَاخِكِ إِذَا نَقَبْنَ قَالَتْ نَعَمْ جَرَادَةٌ خَبَّأْتُهَا مِنْكَ أَنْتَظِرُ بِهَا فِرَاخِي إِذَا نَقَبْنَ فَهَلْ عِنْدَ أَنْتَ شَيْ‏ءٌ قَالَ نَعَمْ عِنْدِي تَمْرَةٌ خَبَّأْتُهَا مِنْكِ لِفِرَاخِي",
          "قَالَتْ فَخُذْ أَنْتَ تَمْرَتَكَ وَ آخُذُ أَنَا جَرَادَتِي وَ نَعْرِضُ لِسُلَيْمَانَ ( عليه السلام ) فَنُهْدِيهِمَا لَهُ فَإِنَّهُ رَجُلٌ يُحِبُّ الْهَدِيَّةَ فَأَخَذَ التَّمْرَةَ فِي مِنْقَارِهِ وَ أَخَذَتْ هِيَ الْجَرَادَةَ فِي رِجْلَيْهَا ثُمَّ تَعَرَّضَا لِسُلَيْمَانَ ( عليه السلام ) فَلَمَّا رَآهُمَا وَ هُوَ عَلَى عَرْشِهِ بَسَطَ يَدَيْهِ لَهُمَا فَأَقْبَلَا فَوَقَعَ الذَّكَرُ عَلَى الْيَمِينِ وَ وَقَعَتِ الْأُنْثَى عَلَى الْيَسَارِ وَ سَأَلَهُمَا عَنْ حَالِهِمَا فَأَخْبَرَاهُ ",
          "فَقَبِلَ هَدِيَّتَهُمَا وَ جَنَّبَ جُنْدَهُ عَنْهُمَا وَ عَنْ بَيْضِهِمَا وَ مَسَحَ عَلَى رَأْسِهِمَا وَ دَعَا لَهُمَا بِالْبَرَكَةِ فَحَدَثَتِ الْقُنْزُعَةُ عَلَى رَأْسِهِمَا مِنْ مَسْحَةِ سُلَيْمَانَ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Hassan, and Ali Bin Ibrahim Al Hashimy, from one of our companions, from Suleyman Bin Ja’far Al Ja’fary, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup> having said: ‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said: ‘The topknot on top of the heat of the grouse is from the wiping (by the hand of) Suleyman<sup>as</sup> Bin Dawood<sup>as</sup>, and that is the male grouse intended to copulate with its female, but she prevented unto him. So he said to her, ‘Do not prevent me, for I do not intend except that Allah<sup>azwj</sup> Mighty and Majestic would Extract from me a person you would be remembered by’. So she answered him to what he sought. ",
            "So when it wanted to lay eggs, he said to her, ‘Where do you want to lay eggs’. So she said to him, ‘I do not know, near to the road?’ He said to her, ‘I am afraid that the passers-by would pass by you, but I see for you that you should lay eggs near the road, so the one who sees you near it would think that you are picking seeds from the road’. So she answered him to that and laid eggs, and incubated them until she oversaw the births. ",
            "So while the two of them were involved in that, when there noticed Suleyman<sup>as</sup> Bin Dawood<sup>as</sup> in his<sup>as</sup> army, and the birds were shading him<sup>as</sup>. So she said to him, ‘This is Suleyman<sup>as</sup> who is coming over to us in his army, and there is no safety if he<sup>as</sup> were to trample us, and trample our eggs’. So he said to her, ‘Suleyman<sup>as</sup> would be a merciful man with us, so is there anything with you to gift to him<sup>as</sup> for (the safety of) your chicks when they are born’. She said, ‘Yes, a grass-hopper which I hid from you, awaiting for my chicks for it when they are born. So is there anything with you?’ He said, ‘Yes, I have a date with me, which I hid from you for my chicks’. ",
            "She said, ‘So you take your date, and I take my grass-hopper, and we go to Suleyman<sup>as</sup>and we present these to him<sup>as</sup>, for he<sup>as</sup> is a man who loves the gifts’. So he took the date in his beak, and she took the grass-hopper in her claws, then they went to Suleyman<sup>as</sup>. So when he<sup>as</sup> saw them both, and he was upon his<sup>as</sup> throne, he<sup>as</sup> extended his<sup>as</sup> hands for them. So they went over and the male sat upon the right hand and the female sat upon the left hand, and he asked them both of their state. So they informed him<sup>as</sup>. ",
            "So he<sup>as</sup> accepted both their gifts, and diverted his<sup>as</sup> army away from them and their eggs, and he<sup>as</sup> wiped (by his<sup>as</sup> hand) upon their heads, and supplicated for them both with the Blessings. So the topknot appeared on top of both their heads from the wiping of Suleyman<sup>as</sup>’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn al-Hassan and Ali ibn Ibrahim al-Hashimiy have narrated from certain persons of our people from Sulayman al- Ja‘fariy who has said the following: “Abu al-Hassan, al-Rida’, ‘Alayhi al-Salam, has said that Ali ibn al-Husayn, has said, ‘The crest on the head of lark is because of wiping of Solomon ibn David, ‘Alayhi al-Salam. It happened when the male lark wanted to mount the female (and) she refused. The male said, ‘Do not refuse because I want that Allah, most Majestic, most Glorious, to give us the offspring because of which you will be remembered.’ The female then agreed. When it was to lay eggs the male asked, ‘Where do you want to lay eggs?’ The female replied, ‘I do not know. Can I lay the eggs away from the road?’ The male said, ‘I am afraid of bypassers, however, I think you should lay eggs near the road and those who see you may think that you are picking grains from the road.’ The female agreed and laid the eggs; then sat on them to hatch until they were about to hatch that Solomon son of David, ‘Alayhi al-Salam, with his army, while birds forming shadow on him, appeared. The female said, ‘This is Solomon coming to us with his army and I do not feel safe for my eggs being crushed under their feet.’ The male said, ‘Solomon is a kind man. Do you have anything which you may have saved for your baby larks when they are hatched to offer him as present?’ The female replied, ‘Yes, it is a locust that I had hidden from you for the baby larks when they are hatched; but do you have anything for a present?’ The male replied, ‘Yes, it is a date that I had hidden from you for the bay larks.’ The female said, ‘You take your date and I take my locust to present them to Solomon ‘Alayhi al-Salam, he is a man who loves presents. The male took the date in its beak and the female took the locust in its paws and appeared before Solomon. When he saw them he was on his throne. He extended his hands for them. The male sat on his right hand and the female on his left hand. He asked how they were doing and they informed him. He accepted their gift and asked his army to be careful about their eggs. He wiped their heads and prayed for them for blessing. The crest on their head is because of the wiping of Solomon, ‘Alayhi al- Salam.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:4:17",
  "kind": "verse_list"
}