{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:7:5",
        "titles": {
          "ar": "كِتَابُ الشَّهَادَاتِ",
          "en": "THE BOOK OF TESTIMONIES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 1"
        },
        "path": "/books/al-kafi:7:5:1",
        "titles": {
          "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>اب أَوَّلِ صَكٍّ كُتِبَ</span> فِي الْأَرْضِ",
          "en": "Chapter 1 – The first promissory note written in the earth"
        }
      }
    ],
    "index": 2212,
    "local_index": 1,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 2"
        },
        "path": "/books/al-kafi:7:5:2",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الرَّجُلُ يُدْعَى</span> إِلَى الشَّهَادَةِ",
          "en": "Chapter 2 – The man summoned to the testimony"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:7:5",
        "titles": {
          "ar": "كِتَابُ الشَّهَادَاتِ",
          "en": "THE BOOK OF TESTIMONIES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:5:1",
    "titles": {
      "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>اب أَوَّلِ صَكٍّ كُتِبَ</span> فِي الْأَرْضِ",
      "en": "Chapter 1 – The first promissory note written in the earth"
    },
    "verse_count": 2,
    "verse_start_index": 14341,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/217)"
        ],
        "index": 14342,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/527",
              "text": "خَلَفِ بْنِ حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ خَلَفِ بْنِ حَمَّادٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:1:1",
        "text": [
          " لَمَّا قَدِمَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَلَى أَبِي الْعَبَّاسِ وَ هُوَ بِالْحِيرَةِ خَرَجَ يَوْماً يُرِيدُ عِيسَى بْنَ مُوسَى فَاسْتَقْبَلَهُ بَيْنَ الْحِيرَةِ وَ الْكُوفَةِ وَ مَعَهُ ابْنُ شُبْرُمَةَ الْقَاضِي فَقَالَ لَهُ إِلَى أَيْنَ يَا أَبَا عَبْدِ اللَّهِ فَقَالَ أَرَدْتُكَ فَقَالَ قَدْ قَصَّرَ اللَّهُ خَطْوَكَ",
          "قَالَ فَمَضَى مَعَهُ فَقَالَ لَهُ ابْنُ شُبْرُمَةَ مَا تَقُولُ يَا أَبَا عَبْدِ اللَّهِ فِي شَيْ<span class=\"bTxt\">‏</span>ءٍ سَأَلَنِي عَنْهُ الْأَمِيرُ فَلَمْ يَكُنْ عِنْدِي فِيهِ شَيْ<span class=\"bTxt\">‏</span>ءٌ فَقَالَ وَ مَا هُوَ قَالَ سَأَلَنِي عَنْ أَوَّلِ كِتَابٍ كُتِبَ فِي الْأَرْضِ قَالَ نَعَمْ إِنَّ اللَّهَ عَزَّ وَ جَلَّ عَرَضَ عَلَى آدَمَ ( عليه السلام ) ذُرِّيَّتَهُ عَرْضَ الْعَيْنِ فِي صُوَرِ الذَّرِّ نَبِيّاً فَنَبِيّاً وَ مَلِكاً فَمَلِكاً وَ مُؤْمِناً فَمُؤْمِناً وَ كَافِراً فَكَافِراً",
          "فَلَمَّا انْتَهَى إِلَى دَاوُدَ ( عليه السلام ) قَالَ مَنْ هَذَا الَّذِي نَبَّأْتَهُ وَ كَرَّمْتَهُ وَ قَصَّرْتَ عُمُرَهُ قَالَ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ هَذَا ابْنُكَ دَاوُدُ عُمُرُهُ أَرْبَعُونَ سَنَةً وَ إِنِّي قَدْ كَتَبْتُ الْآجَالَ وَ قَسَمْتُ الْأَرْزَاقَ وَ أَنَا أَمْحُو مَا أَشَاءُ وَ أُثْبِتُ وَ عِنْدِي أُمُّ الْكِتَابِ فَإِنْ جَعَلْتَ لَهُ شَيْئاً مِنْ عُمُرِكَ أَلْحَقْتُ لَهُ قَالَ يَا رَبِّ قَدْ جَعَلْتُ لَهُ مِنْ عُمُرِي سِتِّينَ سَنَةً تَمَامَ الْمِائَةِ",
          "قَالَ فَقَالَ اللَّهُ عَزَّ وَ جَلَّ لِجَبْرَئِيلَ وَ مِيكَائِيلَ وَ مَلَكِ الْمَوْتِ اكْتُبُوا عَلَيْهِ كِتَاباً فَإِنَّهُ سَيَنْسَى قَالَ فَكَتَبُوا عَلَيْهِ كِتَاباً وَ خَتَمُوهُ بِأَجْنِحَتِهِمْ مِنْ طِينَةِ عِلِّيِّينَ ",
          "قَالَ فَلَمَّا حَضَرَتْ آدَمَ الْوَفَاةُ أَتَاهُ مَلَكُ الْمَوْتِ فَقَالَ آدَمُ يَا مَلَكَ الْمَوْتِ مَا جَاءَ بِكَ قَالَ جِئْتُ لِأَقْبِضَ رُوحَكَ قَالَ قَدْ بَقِيَ مِنْ عُمُرِي سِتُّونَ سَنَةً فَقَالَ إِنَّكَ جَعَلْتَهَا لِابْنِكَ دَاوُدَ قَالَ وَ نَزَلَ عَلَيْهِ جَبْرَئِيلُ وَ أَخْرَجَ لَهُ الْكِتَابَ ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَمِنْ أَجْلِ ذَلِكَ إِذَا خَرَجَ الصَّكُّ عَلَى الْمَدْيُونِ ذَلَّ الْمَدْيُونُ فَقَبَضَ رُوحَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Khalaf Bin Hammad, from Abdullah Bin Sinan who said, ",
            "‘One day when Abu Abdullah<sup>asws</sup> proceeded to Abu Al-Abbas, and he was at Al-Hira having come out intending (to meet) Isa Bin Musa, so he<sup>asws</sup> met him between Al-Hira and Al-Kufa, and with him was Ibn Shubruma, the judge. So he said to him<sup>asws</sup>, ‘Where are you (going) to, O Abu Abdullah<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘I intended (meeting) you’. So he said, ‘Allah<sup>azwj</sup> has Shortened your steps (Reduced your<sup>asws</sup> journey)’. ",
            "He (the narrator) said, ‘So he went with him<sup>asws</sup>’. So Ibn Shubruma said to him<sup>asws</sup>, ‘What are you<sup>asws</sup> saying, O Abu Abdullah<sup>asws</sup>, regarding something which the Emir has asked about from me, so there did not happen to be anything with me with regards to it?’ So he<sup>asws</sup> said: ‘And what is it?’ He said, ‘He asked me about the first letter written in the earth’. He<sup>asws</sup> said: ‘Yes. Allah<sup>azwj</sup> Mighty and Majestic Presented to Adam<sup>as</sup>, his<sup>as</sup> offspring to his<sup>as</sup> eyes, in the form of particles, a Prophet<sup>as</sup> (after) a Prophet<sup>as</sup>, a king (after) a king, a Believer (after) a Believer, and an Infidel (after) an Infidel. ",
            "So when He<sup>azwj</sup> Ended up at Dawood<sup>as</sup>, he (Adam<sup>as</sup>) said, ‘Who is this whom You<sup>azwj</sup> have Granted Prophet-hood, and Honoured him<sup>as</sup>, and Shortened his<sup>as</sup> age?’ So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>as</sup>: “This is your<sup>as</sup> son<sup>as</sup> Dawood<sup>as</sup>. His<sup>as</sup> age is forty years, and I<sup>azwj</sup> had Ordained the terms, Divided the sustenances, and I<sup>azwj</sup> Obliterate whatever I<sup>azwj</sup> so Desire to, and Affirm, and with Me<sup>azwj</sup> is the Mother of the Book. So if you<sup>asws</sup> want to make something for him from your<sup>as</sup> age, I<sup>azwj</sup> shall Attach it to him<sup>as</sup>! He<sup>as</sup> said: ‘O Lord<sup>azwj</sup>! I<sup>as</sup> have made it for him<sup>as</sup>, from my<sup>as</sup> age, sixty years, to complete one hundred (for him<sup>as</sup>)’. ",
            "He<sup>asws</sup> said: ‘So Allah<sup>azwj</sup> Mighty and Majestic Said to Jibraeel<sup>as</sup> and Mikaeel<sup>as</sup>, and the Angel of Death: “Write upon him (Adam<sup>as</sup>) a letter, for he<sup>as</sup> would be forgetting”. He<sup>asws</sup> said: ‘So they wrote a letter upon him<sup>as</sup>, and sealed it with their seals from the clay of Illiyeen’. ",
            "He<sup>asws</sup> said: ‘So when death presented itself to Adam<sup>as</sup>, the Angel of Death came over to him<sup>as</sup>, so Adam<sup>as</sup> said: ‘O Angel of Death! What have you come for?’ He said: ‘To capture your soul’. He<sup>as</sup> said: ‘But there still remain sixty years from my<sup>as</sup> age’. So he said: ‘You<sup>as</sup> had made it for your<sup>as</sup> son<sup>as</sup> Dawood<sup>as</sup>’. He<sup>asws</sup> said: ‘And Jibraeel<sup>as</sup> descended unto him<sup>as</sup> and brought out for him<sup>as</sup> the letter’. ",
            "So Abu Abdullah<sup>asws</sup> said: ‘So for that reason, when the promissory note is brought out upon the debtor, the debtor is humbled’. Thus he captured his<sup>as</sup> soul’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father from Khalaf ibn Hammad from ‘Abd Allah ibn Sinan who has narrated the following: “When abu ‘Abd Allah, ‘Alayhi al-Salam, went to meet abu al- ‘Abbas who was in al-Hirah (a place in Iraq), one day he came out for ‘Isa ibn Musa. They came face to face between al-Hirah and al-Kufah when ibn Shubramah, the judge, was also with him and he asked, ‘Where do you want to go, O abu ‘Abd Allah ? 5 He (the Imam) said, ‘I wanted to meet you . 5 He then said, ‘Allah has shortened the distance of the journey for you because we are here . 5 He (the Imam) then went along with him. Ibn Shubramah asked, ‘What do you say, O abu ‘Abd Allah, concerning something about which the Amir (the ruler) asked me but I had nothing about it ? 5 He (the Imam) asked, ‘What is it ? 5 He said, ‘He asked me about the first document that was written on earth . 5 He (the Imam) said, ‘Yes, Allah, most Majestic, most Glorious, showed to Adam, ‘Alayhi al-Salam, his offspring before his eyes in the form of particles, one Prophet after the other Prophet, king after king, believers after believers and unbelievers after unbelievers. When he reached Dawud ‘Alayhi al-Salam, he asked, “Who is this one whom You have granted Prophet-hood and honor but his life is very short ? 55 He (the Imam) said that Allah, most Majestic, most Glorious, sent him revelation that said, “This is your son Dawud and his life is for forty years, I have written the duration of lives, distributed sustenance and I can delete or write down whatever I want, as I want, because the mother of the book is with Me. If you want to donate something from your life to him, you can do so and I implement it.” He then said, “O Lord, I donate sixty years of my life to him so that he will live for one hundred years.” Allah, most Majestic, most Glorious, said to Jibril, Michael and the angel of death to write down a document about it because he will forget. He (the Imam) said that they wrote the document for it and sealed it with their wings which were from the Tinah (seed) of the ones high above . 5 He (the Imam) said, ‘When it was the time for the death of Adam, ‘Alayhi al-Salam, the angel of death came to him and Adam, ‘Alayhi al-Salam, asked, “O angel of death, what brings you here?” The angel of death said, “I have come to take your soul.” He said, “I have another sixty years to live.” The angel said, “That much you donated to your son Dawud .” 5 He (the Imam) said that Jibril then came and showed him the document. Abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘For that reason when a certificate is brought out to show the indebted he is humbled. Then he took away his soul. 5 ” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/219)"
        ],
        "index": 14343,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/576",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1663",
              "text": "عِيسَى بْنِ أَيُّوبَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/976",
              "text": "عَلِيِّ بْنِ مَهْزِيَارَ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/177",
              "text": "ذَكَرَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ عِيسَى بْنِ أَيُّوبَ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:1:2",
        "text": [
          " لَمَّا عُرِضَ عَلَى آدَمَ وُلْدُهُ نَظَرَ إِلَى دَاوُدَ فَأَعْجَبَهُ فَزَادَهُ خَمْسِينَ سَنَةً مِنْ عُمُرِهِ قَالَ وَ نَزَلَ عَلَيْهِ جَبْرَئِيلُ وَ مِيكَائِيلُ فَكَتَبَ عَلَيْهِ مَلَكُ الْمَوْتِ صَكّاً بِالْخَمْسِينَ سَنَةً فَلَمَّا حَضَرَتْهُ الْوَفَاةُ أُنْزِلَ عَلَيْهِ مَلَكُ الْمَوْتِ فَقَالَ آدَمُ قَدْ بَقِيَ مِنْ عُمُرِي خَمْسُونَ سَنَةً قَالَ فَأَيْنَ الْخَمْسُونَ الَّتِي جَعَلْتَهَا لِابْنِكَ دَاوُدَ",
          "قَالَ فَإِمَّا أَنْ يَكُونَ نَسِيَهَا أَوْ أَنْكَرَهَا فَنَزَلَ عَلَيْهِ جَبْرَئِيلُ وَ مِيكَائِيلُ ( عليهما السلام ) فَشَهِدَا عَلَيْهِ وَ قَبَضَهُ مَلَكُ الْمَوْتِ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كَانَ أَوَّلَ صَكٍّ كُتِبَ فِي الدُّنْيَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Isa Bin Ayoub, from Ali Bin Mahziyar, from the one who mentioned it, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘When there were presented to Adam<sup>as</sup>, his<sup>as</sup> children, he<sup>as</sup> looked at Dawood. So he<sup>as</sup> marvelled at him<sup>as</sup>. So he<sup>as</sup> increased fifty years for him<sup>as</sup>, from his<sup>as</sup> own age. And Jibraeel<sup>as</sup> and Mikaeel<sup>as</sup> descended unto him, so the Angel of Death wrote a promissory note upon him, with fifty years. So when the death presented itself to him<sup>as</sup>, the Angel of Death descended unto him<sup>as</sup>. So Adam<sup>as</sup> said: ‘(But) there remain fifty years from my<sup>as</sup> age’. He said, ‘So what about the fifty (years) you<sup>as</sup> had made it to be for your<sup>as</sup> son<sup>as</sup> Dawood<sup>as</sup>?’ ",
            "He<sup>asws</sup> said: ‘But, he<sup>as</sup> had forgotten it, or denied it. So Jibraeel<sup>as</sup> and Mikaeel<sup>as</sup> descended, so they both testified against him, and the Angel of death captured him<sup>as</sup>’. ",
            "So Abu Abdullah<sup>asws</sup> said: ‘It was the first promissory note written in the world’."
          ],
          "en.sarwar": [
            "2. Abu Ali al-Ash‘ariy has narrated from ‘Isa ibn Ayyub from Afi ibn Mahziyar from those whom he has mentioned who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that when Adam, ‘Alayhi al-Salam, was shown his offspring, he looked at Dawud, he liked him and donated fifty years of his life to him. He (the Imam) said that Jibril and Michael came to him and the angel of death wrote a document about fifty years of his life being donated. When the time of his death came the angel of death came and Adam, ‘Alayhi al-Salam, said that fifty years of his life still has remained, and he said, ‘What about fifty years that you donated to your son Dawud ? 5 He (the Imam) said, ‘It was because that he had forgotten or denied it. Jibril and Michael came and testified about the matter, then the angel of death took away his soul . 5 Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘It was the first check (certificate or deed) that was ever written on earth. 5 ” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:5:1",
  "kind": "verse_list"
}