{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:7:5",
        "titles": {
          "ar": "كِتَابُ الشَّهَادَاتِ",
          "en": "THE BOOK OF TESTIMONIES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 23"
        },
        "path": "/books/al-kafi:7:5:23",
        "titles": {
          "ar": "باب النَّوَادِرِ",
          "en": "Chapter 23 – The miscellaneous"
        }
      }
    ],
    "index": 2234,
    "local_index": 23,
    "nav": {
      "prev": {
        "indexed_titles": {
          "en": "Chapter 22"
        },
        "path": "/books/al-kafi:7:5:22",
        "titles": {
          "ar": "باب الرَّجُلِ يَشْهَدُ عَلَى الْمَرْأَةِ وَ لَا يَنْظُرُ وَجْهَهَا",
          "en": "Chapter 22 – The man testifies upon the woman and does not look at her face"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:7:5",
        "titles": {
          "ar": "كِتَابُ الشَّهَادَاتِ",
          "en": "THE BOOK OF TESTIMONIES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:5:23",
    "titles": {
      "ar": "باب النَّوَادِرِ",
      "en": "Chapter 23 – The miscellaneous"
    },
    "verse_count": 10,
    "verse_start_index": 14453,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/258)"
        ],
        "index": 14454,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/108",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/152",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/166",
              "text": "مُعَاوِيَةَ بْنِ وَهْبٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:23:1",
        "text": [
          " كَانَ الْبَلَاطُ حَيْثُ يُصَلَّى عَلَى الْجَنَائِزِ سُوقاً عَلَى عَهْدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) يُسَمَّى الْبَطْحَاءَ يُبَاعُ فِيهَا الْحَلِيبُ وَ السَّمْنُ وَ الْأَقِطُ وَ إِنَّ أَعْرَابِيّاً أَتَى بِفَرَسٍ لَهُ فَأَوْثَقَهُ فَاشْتَرَاهُ مِنْهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) ثُمَّ دَخَلَ لِيَأْتِيَهُ بِالثَّمَنِ فَقَامَ نَاسٌ مِنَ الْمُنَافِقِينَ فَقَالُوا بِكَمْ بِعْتَ فَرَسَكَ قَالَ بِكَذَا وَ كَذَا قَالُوا بِئْسَ مَا بِعْتَ فَرَسُكَ خَيْرٌ مِنْ ذَلِكَ وَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) خَرَجَ إِلَيْهِ بِالثَّمَنِ وَافِياً طَيِّباً ",
          "فَقَالَ الْأَعْرَابِيُّ مَا بِعْتُكَ وَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) سُبْحَانَ اللَّهِ بَلَى وَ اللَّهِ لَقَدْ بِعْتَنِي وَ ارْتَفَعَتِ الْأَصْوَاتُ فَقَالَ النَّاسُ رَسُولُ اللَّهِ يُقَاوِلُ الْأَعْرَابِيَّ فَاجْتَمَعَ نَاسٌ كَثِيرٌ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ مَعَ النَّبِيِّ ( صلى الله عليه وآله ) أَصْحَابُهُ إِذْ أَقْبَلَ خُزَيْمَةُ بْنُ ثَابِتٍ الْأَنْصَارِيُّ فَفَرَّجَ النَّاسَ بِيَدِهِ حَتَّى انْتَهَى إِلَى النَّبِيِّ ( صلى الله عليه وآله ) فَقَالَ أَشْهَدُ يَا رَسُولَ اللَّهِ لَقَدِ اشْتَرَيْتَهُ مِنْهُ فَقَالَ الْأَعْرَابِيُّ أَ تَشْهَدُ وَ لَمْ تَحْضُرْنَا وَ قَالَ لَهُ النَّبِيُّ ( صلى الله عليه وآله ) أَ شَهِدْتَنَا فَقَالَ لَهُ لَا يَا رَسُولَ اللَّهِ وَ لَكِنِّي عَلِمْتُ أَنَّكَ قَدِ اشْتَرَيْتَ أَ فَأُصَدِّقُكَ بِمَا جِئْتَ بِهِ مِنْ عِنْدِ اللَّهِ وَ لَا أُصَدِّقُكَ عَلَى هَذَا الْأَعْرَابِيِّ الْخَبِيثِ ",
          "قَالَ فَعَجِبَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ قَالَ يَا خُزَيْمَةُ شَهَادَتُكَ شَهَادَةُ رَجُلَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Muawiya Bin Wahab who said, ",
            "‘The courtyard where the marketers used to Pray over the funerals in the era of Rasool-Allah<sup>saww</sup> was called Al-Bat’ha. There used to be sold therein, the milk, and the butter, and the cheese; and a Bedouin came over with a horse of his, so he fastened it. So Rasool-Allah<sup>saww</sup> bought it from him. Then he<sup>saww</sup> entered (went home) in order to fetch the price of it. So the hypocritical people arose and said to him, ‘For how much did you sell your horse?’ He said, ‘For such and such’. They said, ‘Bad (price) is what you sold it. Your horse is better than that, and Rasool-Allah<sup>saww</sup> came out to him with the price, loyally, in a goodly manner.",
            "So the Bedouin said, ‘I did not sell it, by Allah<sup>azwj</sup>!’ So Rasool-Allah<sup>saww</sup> said: ‘Glory be to Allah<sup>azwj</sup>! But, by Allah<sup>azwj</sup>, you have sold it to me<sup>saww</sup>’; and the voices got raised. So the people said, ‘Rasool-Allah<sup>saww</sup> is bargaining with the Bedouin’. So a lot of people gathered around.  ",
            "So Abu Abdullah<sup>asws</sup> said: ‘And with the Prophet<sup>saww</sup> were his<sup>saww</sup> companions, when Khuzayma Bin Sabit Al-Ansary came over, and he cleared the people by his hands until he ended up to the Prophet<sup>saww</sup>. So he said, ‘I hereby testify, O Rasool-Allah<sup>saww</sup>, that you have bought it from him’. So the Bedouin said, ‘You are testifying and were not present with us?’ And the Prophet<sup>saww</sup> said to him: ‘Did you witness us?’ So he said, ‘No, O Rasool-Allah<sup>saww</sup>! But, I know that you<sup>saww</sup> have bought it. I have ratified you<sup>saww</sup> with what you have come with from the Presence of Allah<sup>saww</sup>, and I should not ratify you<sup>saww</sup> against this wicked Bedouin?’ ",
            "He<sup>asws</sup> said: ‘So Rasool-Allah<sup>saww</sup> was amazed at him and said: ‘O Khuzeyma! Your testimony is the testimony of two men’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from Mu’awiyah ibn Wahab who has narrated the following: “The paved area where Salat (prayer) for the dead had been performed in the time of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, was called al-Batha’ where people sold milk, ghee and cheese. A desert dwelling Arab once came with his horse and tied it there. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, bought it from him. He (the Messenger of Allah) went inside to bring the price. Certain hypocrites asked the man, Tor how much did you sell your horse?’ He replied, T have sold it for such and such amount.’ They said, ‘This is a bad deal. Your horse is better than this.’ The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, then came out with the complete and nice price. The Arab man said, ‘By Allah I did not sell it.’ The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, said, ‘Allah is free of all defects, yes, by Allah, you sold it to me.’ Voices rose and certain people said, ‘The Messenger of Allah is bargaining with a desert Arab man.’ Many people gathered around. Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘With the Holy Prophet, there his companions were also present when Khudhaymah ibn Thabit Ansari came and moved people with his hand until he reached the Holy Prophet, and said, ‘O Messenger of Allah, I testify that you bought from him.’ The Arab man said, ‘How can you testify, when you were not here present with us?’ The Messenger of Allah asked, ‘Did you see us concluding the sale?’ Khudhaymah said, ‘No, I was not here, but I know that you have bought it. I have believed in what you have brought from Allah and acknowledged your truthfulness; how can I not believe you against this filthy Arab? How that can happen?’ He (the Imam) said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, liked his standpoint and said, ‘O Khudhaymah, your testimony equals to two testimonies.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على الظاهر    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/258)"
        ],
        "index": 14455,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1027",
              "text": "مُحَمَّدِ بْنِ أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/780",
              "text": "مُوسَى بْنِ جَعْفَرٍ الْبَغْدَادِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/957",
              "text": "جَعْفَرِ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/611",
              "text": "عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/569",
              "text": "الْحُسَيْنِ بْنِ زَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/52",
              "text": "أَبِيهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُوسَى بْنِ جَعْفَرٍ الْبَغْدَادِيِّ عَنْ جَعْفَرِ بْنِ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنِ الْحُسَيْنِ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) عَنْ أَبِيهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:23:2",
        "text": [
          " أُتِيَ عُمَرُ بْنُ الْخَطَّابِ بِقُدَامَةَ بْنِ مَظْعُونٍ وَ قَدْ شَرِبَ الْخَمْرَ فَشَهِدَ عَلَيْهِ رَجُلَانِ أَحَدُهُمَا خَصِيٌّ وَ هُوَ عَمْرٌو التَّمِيمِيُّ وَ الْآخَرُ الْمُعَلَّى بْنُ الْجَارُودِ فَشَهِدَ أَحَدُهُمَا أَنَّهُ رَآهُ يَشْرَبُ وَ شَهِدَ الْآخَرُ أَنَّهُ رَآهُ يَقِي‏ءُ الْخَمْرَ ",
          "فَأَرْسَلَ عُمَرُ إِلَى أُنَاسٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ فِيهِمْ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) مَا تَقُولُ يَا أَبَا الْحَسَنِ فَإِنَّكَ الَّذِي قَالَ فِيكَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَنْتَ أَعْلَمُ هَذِهِ الْأُمَّةِ وَ أَقْضَاهَا بِالْحَقِّ فَإِنَّ هَذَيْنِ قَدِ اخْتَلَفَا فِي شَهَادَتِهِمَا قَالَ مَا اخْتَلَفَ فِي شَهَادَتِهِمَا وَ مَا قَاءَهَا حَتَّى شَرِبَهَا فَقَالَ هَلْ تَجُوزُ شَهَادَةُ الْخَصِيِّ قَالَ مَا ذَهَابُ لِحْيَتِهِ إِلَّا كَذَهَابِ بَعْضِ أَعْضَائِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Musa Bin Ja’far Al Baghdady, from Ja’far Bin Yahya, from Abdullah Bin Abdul Rahman, from Al Husayn Bin Zayd, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, from his<sup>asws</sup> father<sup>asws</sup> having said: ‘They came to Umar Bin Al-Khattab with Qudama Bin Maz’oun, and he had drunk the wine. So two men testified against him, one of them was a eunuch (castrated) and he was Amro Al-Tameemy, and the one one was Al-Moalla Bin Al-Jaroud. So, one of them testified that he had seen him drinking, and the other one testified that he had seen him throwing out the wine. ",
            "So Umar sent for some people from the companions of Rasool-Allah<sup>saww</sup> among them was Amir Al-Momineen<sup>asws</sup>. So he said to Amir Al-Momineen<sup>asws</sup>, ‘What are you<sup>asws</sup> saying, O Abu Al-Hassan<sup>asws</sup>, for you<sup>asws</sup> are the one regarding whom Rasool-Allah<sup>saww</sup> said: ‘You<sup>asws</sup> are the knowledgeable one of this community, and its judge, with the truth’. So these two have differed in their testimonies’. He<sup>asws</sup> said: ‘There is no differing in both their testimonies, and he could not have chucked it until he had drunk it (first)’. So he said, ‘Is the testimony of the eunuch (castrated) is allowed?’ He<sup>asws</sup> said: ‘His losing his beard is just like the loss of certain parts of his body’"
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Musa ibn Ja‘far af-Baghdadiy from Ja‘far ibn Yahya fn ‘Abd Allah ibn ‘Abd al-Rahman fn af-Husayn ibn Zayd who has narrated the following: “Abu ‘Abd Allah, has narrated from his father, ‘Alayhim al-Salam, who has said that once Qudamah ibn Maz‘un was brought before ‘Umar ibn al-Khattab because of drinking wine and two men testified against him. One, called ‘Amr al- Tamimiy, was castrated and the other one was Mu‘alla’ ibn al- Jarud. One of them testified that he saw him drinking wine and the other said that he saw him throwing out wine. ‘Umar then sent for several people of the companions of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, among whom one was ’Amir al-Mu’minin, Ali, ‘Alayhi al-Salam. ‘Umar then asked, ‘What do you say, O abu al-Hassan? You are the one about whom the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “He is the most knowledgeable one in the nation and the one who judges with the truth all the time.” These have presented different testimonies.’ He (the Imam) said there is no difference in their testimonies, he could not have thrown out wine without drinking it.’ ‘Umar then asked about the testimony of a castrated man. He (the Imam) said, ‘His losing his beard is just like the loss of a certain part of his body.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/259)"
        ],
        "index": 14456,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/359",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/273",
              "text": "مَنْصُورِ بْنِ يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/346",
              "text": "مُوسَى بْنِ بَكْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5829",
              "text": "الْحَكَمِ بْنِ أَبِي عَقِيلٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ مُوسَى بْنِ بَكْرٍ عَنِ الْحَكَمِ بْنِ أَبِي عَقِيلٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:23:3",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ لِي خَصْماً يَتَكَثَّرُ عَلَيَّ بِالشُّهُودِ الزُّورِ وَ قَدْ كَرِهْتُ مُكَافَأَتَهُ مَعَ أَنِّي لَا أَدْرِي أَ يَصْلُحُ لِي ذَلِكَ أَمْ لَا قَالَ فَقَالَ لِي أَ مَا بَلَغَكَ عَنْ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) أَنَّهُ كَانَ يَقُولُ لَا تُؤْسِرُوا أَنْفُسَكُمْ وَ أَمْوَالَكُمْ بِشَهَادَاتِ الزُّورِ فَمَا عَلَى امْرِئٍ مِنْ وَكَفٍ فِي دِينِهِ وَ لَا مَأْثَمٍ مِنْ رَبِّهِ أَنْ يَدْفَعَ ذَلِكَ عَنْهُ كَمَا أَنَّهُ لَوْ دَفَعَ بِشَهَادَتِهِ عَنْ فَرْجٍ حَرَامٍ وَ سَفْكِ دَمٍ حَرَامٍ كَانَ ذَلِكَ خَيْراً لَهُ وَ كَذَلِكَ مَالُ الْمَرْءِ الْمُسْلِمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Mansour Bin Yunus, from Musa Bin Bakr, from Al Hakam Bin Abu Aqeel who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘For me there is an adversary (enemy) who frequently bears false testimony upon me, and I do not like to fight him, along with that I do not know whether that is correct for me or not?’ So he<sup>asws</sup> said to me: ‘But has it not reached you that Amir Al-Momineen<sup>asws</sup> was saying: ‘Do not imprison yourselves and your wealth by the false testimonies, for it is not upon a person to restrain himself in his Religion, nor a sin from his Lord<sup>azwj</sup> that he should defend that from him, just as if he were to defend by the testimony about unlawful relationships, and shedding of the unlawful blood, if that was good for him, and similar to that is the wealth of the Muslim person’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad from Muhammad ibn ’Isma‘il from Mansur from Yunus from Musa ibn Bakr from al-Hakam ibn abu ‘Aqil who has narrated the following: “I once said to abu ‘ Abd Allah, ‘Alayhi al-Salam, that my opponent brings a great deal of false testimony against me and I dislike to fight back. I do not know if it is the right thing that I do. He (the Imam) said to me, ’Have you not noticed that ’ Amir al-Mu’minin, Ali, Alayhi al-Salam, would say, “Do not leave yourselves and assets hostage to the false testimonies.” If it is not an offense in religion and a sin against his Lord, then there is nothing wrong for a man to defend himself. It is like preventing unlawful sexual relations and unlawful bloodshed by one’s testimony which is good, so also is the case with defending one’s assets.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/260)"
        ],
        "index": 14457,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5830",
              "text": "مُحَمَّدِ بْنِ الْحَسَنِ أَنَّهُ كَتَبَ"
            },
            {
              "kind": "plain",
              "text": " إِلَى "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5831",
              "text": "أَبِي مُحَمَّدٍ ( عليه السلام ) فِي رَجُلٍ بَاعَ ضَيْعَتَهُ مِنْ رَجُلٍ آخَرَ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5832",
              "text": "هِيَ قِطَاعُ أَرَضِينَ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5833",
              "text": "لَمْ يُعَرِّفِ الْحُدُودَ فِي وَقْتِ مَا أَشْهَدَهُ وَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحَسَنِ أَنَّهُ كَتَبَ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) فِي رَجُلٍ بَاعَ ضَيْعَتَهُ مِنْ رَجُلٍ آخَرَ وَ هِيَ قِطَاعُ أَرَضِينَ وَ لَمْ يُعَرِّفِ الْحُدُودَ فِي وَقْتِ مَا أَشْهَدَهُ وَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:23:4",
        "text": [
          " إِذَا مَا أَتَوْكَ بِالْحُدُودِ فَاشْهَدْ بِهَا هَلْ يَجُوزُ لَهُ ذَلِكَ أَوْ لَا يَجُوزُ لَهُ أَنْ يَشْهَدَ فَوَقَّعَ ( عليه السلام ) نَعَمْ يَجُوزُ وَ الْحَمْدُ لِلَّهِ",
          "وَ كَتَبَ إِلَيْهِ رَجُلٌ كَانَ لَهُ قِطَاعُ أَرَضِينَ فَحَضَرَهُ الْخُرُوجُ إِلَى مَكَّةَ وَ الْقَرْيَةُ عَلَى مَرَاحِلَ مِنْ مَنْزِلِهِ وَ لَمْ يُؤْتِ بِحُدُودِ أَرْضِهِ وَ عَرَّفَ حُدُودَ الْقَرْيَةِ الْأَرْبَعَةَ فَقَالَ لِلشُّهُودِ اشْهَدُوا أَنِّي قَدْ بِعْتُ مِنْ فُلَانٍ جَمِيعَ الْقَرْيَةِ الَّتِي حَدٌّ مِنْهَا كَذَا وَ الثَّانِي وَ الثَّالِثُ وَ الرَّابِعُ وَ إِنَّمَا لَهُ فِي هَذِهِ الْقَرْيَةِ قِطَاعُ أَرَضِينَ فَهَلْ يَصْلُحُ لِلْمُشْتَرِي ذَلِكَ وَ إِنَّمَا لَهُ بَعْضُ هَذِهِ الْقَرْيَةِ وَ قَدْ أَقَرَّ لَهُ بِكُلِّهَا فَوَقَّعَ ( عليه السلام ) لَا يَجُوزُ بَيْعُ مَا لَيْسَ يَمْلِكُ وَ قَدْ وَجَبَ الشِّرَاءُ عَلَى الْبَائِعِ عَلَى مَا يَمْلِكُ",
          "وَ كَتَبَ هَلْ يَجُوزُ لِلشَّاهِدِ الَّذِي أَشْهَدَهُ بِجَمِيعِ هَذِهِ الْقَرْيَةِ أَنْ يَشْهَدَ بِحُدُودِ قِطَاعِ الْأَرْضِ الَّتِي لَهُ فِيهَا إِذَا تَعَرَّفَ حُدُودَ هَذِهِ الْقِطَاعِ بِقَوْمٍ مِنْ أَهْلِ هَذِهِ الْقَرْيَةِ إِذَا كَانُوا عُدُولًا فَوَقَّعَ ( عليه السلام ) نَعَمْ يَشْهَدُونَ عَلَى شَيْ‏ءٍ مَفْهُومٍ مَعْرُوفٍ ",
          "وَ كَتَبَ رَجُلٌ قَالَ لِرَجُلٍ اشْهَدْ أَنَّ جَمِيعَ الدَّارِ الَّتِي لَهُ فِي مَوْضِعِ كَذَا وَ كَذَا بِحُدُودِهَا كُلِّهَا لِفُلَانِ بْنِ فُلَانٍ وَ جَمِيعَ مَا لَهُ فِي الدَّارِ مِنَ الْمَتَاعِ هَلْ يَصْلُحُ لِلْمُشْتَرِي مَا فِي الدَّارِ مِنَ الْمَتَاعِ أَيُّ شَيْ‏ءٍ هُوَ فَوَقَّعَ ( عليه السلام ) يَصْلُحُ لَهُ مَا أَحَاطَ الشِّرَاءُ بِجَمِيعِ ذَلِكَ إِنْ شَاءَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, ",
            "(It has been narrated) from Muhammad Bin Al-Hassan that he wrote to Abu Muhammad<sup>asws</sup>, regarding a man who sold his estate to another man, and it was a piece of land, and its boundaries were unknown in a time, and did not have it witnessed, and he said, ‘When I come to you with the boundaries, so bear witness with it’. Is that allowed for him, or it is not allowed for him that he should testify?’ So he<sup>asws</sup> wrote: ‘Yes, he is allowed, and the Praise is for Allah<sup>azwj</sup>’. ",
            "And a man wrote to him who had two (pieces) of land for him. So he had to go out to Al-Makkah, and the town was on the way from his house, and he did not come with the boundaries of his land, and the four boundaries of the town were known. So he said to the witnesses, ‘Bear witness that I have sold to so and so the entirety of the town which had such and such a boundary, and the second, and the third, and the fourth (boundary)’. But rather, for him in this town were two pieces of land. So is the (buying of) that correct for the buyer, rather for him was part of this town, and he has accepted for him, the whole of it?’ So he<sup>asws</sup> wrote: ‘He is not allowed to sell what he does not own, and it obligates upon the buyer (to buy) and upon the seller (to sell) what he owns’.",
            "And he wrote, ‘Is it allowed for the witness whom he has called to witness with the entirety of this town that he testified with the boundaries of the piece of land which is for him in it, when the boundaries of this piece are recognised by a people from the inhabitants of this town, when they are just?’ So he<sup>asws</sup> wrote: ‘Yes, they can bear witness upon something which is understood, recognised’.  ",
            "And he wrote, ‘A man says to a man to bear witness that the entire of the house which was for him in such a such a place, with all of its boundaries is for so and so, son of so and so, and the entire of what is for him in the house from the chattels. Would it be correct for the buyer whatever was in the house from the chattels, which things would these be?’ So he<sup>asws</sup> wrote: ‘It is correct for him whatever the buying has encompassed, with the entirety of that, Allah<sup>azwj</sup> Willing’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Muhammad ibn al-Hassan who has narrated the following: “I once wrote to abu Muhammad, Alayhi al-Salam, and asked about the case of a man who sells a piece of land to another man. He does not know its limits, and so he does not appoint any witness to the deal, saying that when the limits are defined then witnesses are appointed; if it is permissible to bear witness or not. He (the Imam), Alayhi al-Salam, signed the answer that said, ‘Yes, it is permissible, all praise belongs to Allah.’ A man wanted to leave for Makkah. He had certain pieces of land in a town, which was a certain distance away from his home. He did not define the limits of the land. He only knew the limits of the town, all of its four sides. He said to the witnesses to bear witness that he has sold the whole town of such and such limits of all four sides one, two, three and four, to so and so. In fact, he only owned a piece of land in the town; if buying as such is permissible, when he has confirmed for him the selling of the whole town. He (the Imam) signed the answer that said, ‘It is not permissible to sell what does not belong to him, however, the purchase of what he owns has become binding in favor of the buyer.’ A man wrote to him (the Imam) asking if it is permissible for the witnesses whom he had appointed to bear testimony for the selling of the whole town to testify about the limits of the land that he owns in the town. He may have come to know such limits of such land through the people of the town if they are just people. He (the Imam) signed the answer that said, ‘Yes, it is permissible about something which is known and understood.’ A man wrote saying that a man says to another man to bear witness that the whole of the house that he owns in such and such place with its limits, all of it is for so and so with all that is in the house of assets; if the buyer can have all that is in the house. He (the Imam), Alayhi al-Salam, signed the answer that said, ‘It is permissible for all that the buying has covered, by the will of Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/261)"
        ],
        "index": 14458,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:23:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ حَرِيزٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي أَرْبَعَةٍ شَهِدُوا عَلَى رَجُلٍ مُحْصَنٍ بِالزِّنَى فَعُدِّلَ مِنْهُمُ اثْنَانِ وَ لَمْ يُعَدَّلِ الْآخَرَانِ فَقَالَ إِذَا كَانُوا أَرْبَعَةً مِنَ الْمُسْلِمِينَ لَيْسَ يُعْرَفُونَ بِشَهَادَةِ الزُّورِ أُجِيزَتْ شَهَادَتُهُمْ جَمِيعاً وَ أُقِيمَ الْحَدُّ عَلَى الَّذِي شَهِدُوا عَلَيْهِ إِنَّمَا عَلَيْهِمْ أَنْ يَشْهَدُوا بِمَا أَبْصَرُوا وَ عَلِمُوا وَ عَلَى الْوَالِي أَنْ يُجِيزَ شَهَادَتَهُمْ إِلَّا أَنْ يَكُونُوا مَعْرُوفِينَ بِالْفِسْقِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Abu Ayoub, from Hareyz, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding four who testified against a married man with the adultery. So two of them altered it, and the other two did not alter it (their testimonies). So he<sup>asws</sup> said: ‘When there were four from the Muslim, not known for their false testimonies, all their testimonies would be allowed, and the legal penalty (<span class=\"iTxt\">Hadd</span>) would be established upon the one whom they had testified against. But rather, it is upon them that they should be testifying with what they had seen and known, and it is upon the ruler that he should allow their testimonies except if they happen to be well known with the mischief’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hassan ibn Mahbub from Ayyub from Hariz who has narrated the following: “This is about the case of four men who testified against an al-Muhsin (married man) due to fornication of whom two retracted their testimony and not the other two. Abu ‘Abd Allah, Alayhi al- Salam, has said, ‘If the four are Muslims who are not known as falsely testifying people, the testimony of all four is admissible, and penalty must be applied on the one against whom they have testified, however, they must testify only to what they have seen and have the knowledge thereof. The person in authority must accept their testimony unless they are known to be sinful people.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/261)"
        ],
        "index": 14459,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2884",
              "text": "الْحُسَيْنِ بْنِ سَيْفٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/70",
              "text": "مُحَمَّدِ بْنِ سُلَيْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/796",
              "text": "أَبِي جَعْفَرٍ الثَّانِي ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْحُسَيْنِ بْنِ سَيْفٍ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ أَبِي جَعْفَرٍ الثَّانِي ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:23:6",
        "text": [
          " قُلْتُ لَهُ كَيْفَ صَارَ الزَّوْجُ إِذَا قَذَفَ امْرَأَتَهُ كَانَتْ شَهَادَتُهُ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ وَ كَيْفَ لَا يَجُوزُ ذَلِكَ لِغَيْرِهِ وَ صَارَ إِذَا قَذَفَهَا غَيْرُ الزَّوْجِ جُلِدَ الْحَدَّ وَ لَوْ كَانَ وَلَداً أَوْ أَخاً",
          "فَقَالَ قَدْ سُئِلَ [أَبُو] جَعْفَرٍ ( عليه السلام ) عَنْ هَذَا فَقَالَ أَ لَا تَرَى أَنَّهُ إِذَا قَذَفَ الزَّوْجُ امْرَأَتَهُ قِيلَ لَهُ وَ كَيْفَ عَلِمْتَ أَنَّهَا فَاعِلَةٌ فَإِنْ قَالَ رَأَيْتُ ذَلِكَ مِنْهَا بِعَيْنِي كَانَتْ شَهَادَتُهُ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ وَ ذَلِكَ أَنَّهُ قَدْ يَجُوزُ لِلرَّجُلِ أَنْ يَدْخُلَ الْمَدْخَلَ فِي الْخَلْوَةِ الَّتِي لَا تَصْلُحُ لِغَيْرِهِ أَنْ يَدْخُلَهَا وَ لَا يَشْهَدُهَا وَلَدٌ وَ لَا وَالِدٌ فِي اللَّيْلِ وَ النَّهَارِ فَلِذَلِكَ صَارَتْ شَهَادَتُهُ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِذَا قَالَ رَأَيْتُ ذَلِكَ بِعَيْنِي وَ إِذَا قَالَ إِنِّي لَمْ أُعَايِنْ صَارَ قَاذِفاً فِي حَدِّ غَيْرِهِ وَ ضُرِبَ الْحَدَّ إِلَّا أَنْ يُقِيمَ عَلَيْهَا الْبَيِّنَةَ",
          "وَ إِنْ زَعَمَ غَيْرُ الزَّوْجِ إِذَا قَذَفَ وَ ادَّعَى أَنَّهُ رَآهُ بِعَيْنِهِ قِيلَ لَهُ وَ كَيْفَ رَأَيْتَ ذَلِكَ وَ مَا أَدْخَلَكَ ذَلِكَ الْمَدْخَلَ الَّذِي رَأَيْتَ فِيهِ هَذَا وَحْدَكَ أَنْتَ مُتَّهَمٌ فِي دَعْوَاكَ وَ إِنْ كُنْتَ صَادِقاً فَأَنْتَ فِي حَدِّ التُّهَمَةِ فَلَا بُدَّ مِنْ أَدَبِكَ بِالْحَدِّ الَّذِي أَوْجَبَهُ اللَّهُ عَلَيْكَ ",
          "قَالَ وَ إِنَّمَا صَارَتْ شَهَادَةُ الزَّوْجِ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ لِمَكَانِ الْأَرْبَعَةِ شُهَدَاءَ مَكَانَ كُلِّ شَاهِدٍ يَمِينٌ "
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Husayn Bin Sayf, from Muhammad Bin Suleyman, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup>, said, ‘I said to him<sup>asws</sup>, ‘How did it come to be that when the husband accuses his wife, his testimony would be four testimonies with Allah<sup>azwj</sup>, and how come that is not allowed for other, and became that is someone other than the husband were to accuse her, he would be whipped the legal penalty (<span class=\"iTxt\">Hadd</span>), even if it was a son, or a brother’.",
            "So he<sup>asws</sup> said: ‘Abu Ja’far<sup>asws</sup> was asked about this, so he<sup>asws</sup> said: ‘Do you not see that when the husband accuses his wife, it is said to him, ‘And how did you know that she has done it?’ So if he says, ‘I saw that from her with my own eyes’, his testimony would be four testimonies with Allah<sup>azwj</sup>, and that is because it is allowed for him that he should enter the entrance in private which is not correct for the others to enter into, and neither a son nor a parent would witness it during the night and the day. Therefore, it is due to that, his testimony came to be four testimonies with Allah<sup>azwj</sup>, when he says, ‘I saw that with my own eyes’. And when he says, ‘I did not see it, he would become an accuser, with regards to a legal penalty (<span class=\"iTxt\">Hadd</span>) like the others, and he would be whipped the legal penalty (<span class=\"iTxt\">Hadd</span>) except if he were to establish the proof against her. ",
            "And if someone other than the husband alleges, when he accuses, and claim that he saw it with his own eyes, it would be said to him, ‘And how did you (manage to) see that? And what made you to enter into that entrance where you saw this alone? You are an accused in your claim even if you were truthful, for you are in a legal penalty (<span class=\"iTxt\">Hadd</span>) of the slander. Thus, it is inevitable that you be disciplined with the legal penalty (<span class=\"iTxt\">Hadd</span>) which Allah<sup>azwj</sup> has Obligated to be upon you’. ",
            "He<sup>asws</sup> said: ‘But rather, the testimony of the husband came to be four testimonies with Allah<sup>azwj</sup> in place of the four witnessed, in place of each of the witnesses being an oath’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from al-Husayn ibn Sayf from Muhammad ibn Sulayman who has narrated the following: “I once asked abu Ja‘far, al-Thaniy, Alayhi al-Salam, ‘How is it that when a man accuses his wife of committing fornication his testimony is four testimonies by Allah? Why is it not permissible for those other than him, if someone other than husband accuses her, he is subjected to penalty even if he is a son or brother?’ He (the Imam) said, ‘Abu Ja‘far, ‘Alayhi al-Salam, was asked about it and he (the Imam) replied that suppose if a man accuses his wife he can be asked about how he has learned that his wife has behaved as such, his eyes have seen her doing it then his testimony is four testimonies by Allah. It is because of the possibility for a man to go in privacy where others cannot do so. A son or father cannot see as such in the night or day. For this reason, his testimony has become four testimonies by Allah if he says, “I have seen it with my eyes.” If he says, “I have not seen with my eyes” he is an accuser like other people and he is subjected to penalty unless he establishes testimony. If people other than the husband thinks, accuses and claims seeing it with his eyes he is then asked, “How did you see and who made it possible for you to be in such place where you alone saw it? You stand accused about your claim even if you speak truth, you are in the position of one being accused; and it is necessary to discipline you by penalty which Allah has made obligatory upon you.”’ He (the Imam) said, ‘The testimony of a husband has become four testimonies by Allah, in place of every witness one oath.’” A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Muhammad ibn Aslam from certain ones of the people of Qum from abu al-Hassan al-Rida’, ‘Alayhi al-Salam, a similar Hadith. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/262)"
        ],
        "index": 14460,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:23:7",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ أَسْلَمَ عَنْ بَعْضِ الْقُمِّيِّينَ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) مِثْلَهُ .",
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ إِسْمَاعِيلَ بْنِ أَبِي حَنِيفَةَ عَنْ أَبِي حَنِيفَةَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) كَيْفَ صَارَ الْقَتْلُ يَجُوزُ فِيهِ شَاهِدَانِ وَ الزِّنَى لَا يَجُوزُ فِيهِ إِلَّا أَرْبَعَةُ شُهُودٍ وَ الْقَتْلُ أَشَدُّ مِنَ الزِّنَى فَقَالَ لِأَنَّ الْقَتْلَ فِعْلٌ وَاحِدٌ وَ الزِّنَى فِعْلَانِ فَمِنْ ثَمَّ لَا يَجُوزُ إِلَّا أَرْبَعَةُ شُهُودٍ عَلَى الرَّجُلِ شَاهِدَانِ وَ عَلَى الْمَرْأَةِ شَاهِدَانِ",
          "وَ رَوَاهُ بَعْضُ أَصْحَابِنَا عَنْهُ قَالَ فَقَالَ لِي مَا عِنْدَكُمْ يَا أَبَا حَنِيفَةَ قَالَ قُلْتُ مَا عِنْدَنَا فِيهِ إِلَّا حَدِيثُ عُمَرَ أَنَّ اللَّهَ أَخَذَ فِي الشَّهَادَةِ كَلِمَتَيْنِ عَلَى الْعِبَادِ قَالَ فَقَالَ لِي لَيْسَ كَذَلِكَ يَا أَبَا حَنِيفَةَ وَ لَكِنَّ الزِّنَى فِيهِ حَدَّانِ وَ لَا يَجُوزُ إِلَّا أَنْ يَشْهَدَ كُلُّ اثْنَيْنِ عَلَى وَاحِدٍ لِأَنَّ الرَّجُلَ وَ الْمَرْأَةَ جَمِيعاً عَلَيْهِمَا الْحَدُّ وَ الْقَتْلُ إِنَّمَا يُقَامُ عَلَى الْقَاتِلِ وَ يُدْفَعُ عَنِ الْمَقْتُولِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Aslam, from one of the (people of Qum), ",
            "(It has been narrated) from Abu Al Hassan Al-Reza<sup>asws</sup> – similar to it’. ",
            "Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Ismail Bin Abu Haneefa, from Abu Haneefa who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘How did it come to be that regarding the killing two witnesses are allowed in it, and regarding the adultery, there are not allowed in it except for four witnesses, and the killing is more harsher than the adultery?’ So he<sup>asws</sup> said: ‘Because the killed is one act, but the adultery are two acts, thus it is not allowed except for four witnesses, upon the man being two witnesses, and upon the woman being two witnesses’. ",
            "And it is reported from one of our companions, from him (Abu Haneefa), who said, ",
            "‘So he<sup>asws</sup> said to me: ‘So what is with you, O Abu Haneefa?’ I said, ‘There is nothing with me with regards to it except a Hadeeth of Umar, that Allah<sup>azwj</sup> would Seize, regarding the testimony, two words upon the servants’. So he<sup>asws</sup> said to me: ‘It is not like that, O Abu Haneefa! But, the adultery, in it are two legal penalties, and it is not allowed except that two should testify upon (each) one, because the man and the woman both together, upon them both is the legal penalty, while the killing, rather is established upon the killer, and averted from the killer’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from Ahmad ibn Muhammad from ibn abu Nasr from ’Isma‘il ibn abu Hanifah from abu Hanifah who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘Why in a murder case only two witnesses are required, and in the case of fornication four witnesses are required when murder is more serious than fornication?’ He (the Imam) said, ‘It is because murder is one act and fornication is two acts, for this reason less than four witnesses is not admissible; two against man and two against the woman.’” Certain one of our people have narrated from him (abu Hanifah) that then he (the Imam) asked, ‘What is with you, O abu Hanifah?’ I replied, ‘We have nothing about it except the Hadith of ‘Umar that says, ‘Allah has taken two words in the testimony against the people.’ He (the Imam) then said, ‘It is not as such, O abu Hanifah, in fornication there are two penalties. It is not permissible for less than two to testify against one, two against the man and two against the woman; penalty is obligatory on both man and woman, when in murder it is applied to the killer only and the one murdered is defended.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/262)"
        ],
        "index": 14461,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/61",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1078",
              "text": "السَّيَّارِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/255",
              "text": "مُحَمَّدِ بْنِ جُمْهُورٍ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/114",
              "text": "حَدَّثَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/68",
              "text": "ابْنِ أَبِي يَعْفُورٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنِ السَّيَّارِيِّ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَمَّنْ حَدَّثَهُ عَنِ ابْنِ أَبِي يَعْفُورٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:23:8",
        "text": [
          " لَزِمَتْهُ شَهَادَةٌ فَشَهِدَ بِهَا عِنْدَ أَبِي يُوسُفَ الْقَاضِي فَقَالَ أَبُو يُوسُفَ مَا عَسَيْتُ أَنْ أَقُولَ فِيكَ يَا ابْنَ أَبِي يَعْفُورٍ وَ أَنْتَ جَارِي مَا عَلِمْتُكَ إِلَّا صَدُوقاً طَوِيلَ اللَّيْلِ وَ لَكِنْ تِلْكَ الْخَصْلَةُ قَالَ وَ مَا هِيَ قَالَ مَيْلُكَ إِلَى التَّرَفُّضِ فَبَكَى ابْنُ أَبِي يَعْفُورٍ حَتَّى سَالَتْ دُمُوعُهُ ثُمَّ قَالَ يَا أَبَا يُوسُفَ تَنْسِبُنِي إِلَى قَوْمٍ أَخَافُ أَنْ لَا أَكُونَ مِنْهُمْ قَالَ فَأَجَازَ شَهَادَتَهُ .",
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ مِسْمَعِ بْنِ عَبْدِ الْمَلِكِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( صلوات الله عليه ) كَانَ يَحْكُمُ فِي زِنْدِيقٍ إِذَا شَهِدَ عَلَيْهِ رَجُلَانِ عَدْلَانِ مَرْضِيَّانِ وَ شَهِدَ لَهُ أَلْفٌ بِالْبَرَاءَةِ يُجِيزُ شَهَادَةَ الرَّجُلَيْنِ وَ يُبْطِلُ شَهَادَةَ الْأَلْفِ لِأَنَّهُ دِينٌ مَكْتُومٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Al Sayyari, from Muhammad Bin Jamhour, from the one who narrated it, from Ibn Abu Yafour who said, ",
            "‘The testimony was necessitated, so I testified by it in the presence of Abu Yusuf, the judge. So Abu Yusuf said, ‘What is there for me so be saying with regards to you, O Ibn Abu Yafour, and you are my neighbour. I do not know you except as truthful, of lengthy nights (in Prayer), but for that characteristic’. (Abu Yafour) said, ‘And what is it’. He said, ‘Your tendency towards the rejecters (Shiah)’. So Ibn Abu Yafour wept until his tears flowed, then said, ‘O Abu Yusuf! You are linking me to a people, I fear that I might not be one of them’. He (the narrator) said, ‘So he allowed his testimony’.<a id=\"_ftnref1481\"></a><sup>[1481]</sup> (P.s. – This is not a Hadeeth)",
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al Hassan Bin Shamoun, from Abdullah Bin Abdul Rahman, from Misma’a Bin Abdul Malik, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that Amir Al-Momineen<sup>asws</sup> had judged regarding an Atheist when two just men had testified against him of their own free will, and a thousand had testified for him with the disavowing, he<sup>asws</sup> allowed the testimony of the two men and invalidated the testimony of the thousand, because it (Atheism) is a concealed religion’."
          ],
          "en.sarwar": [
            "8. AI-Husayn from Muhammad has narrated from af-Sayyariy from Muhammad ibn Jumhur from those who narrated to him from ibn abu Ya’fur who has narrated the following: “I had to testify in a case before abu Yusuf, the judge, who said, ‘O ibn abu Ya’fur I still say about you, when you are my neighbor, that I know you only as a truthful person of long nights (for worshipping Allah) except “that thing”.’ He then asked, ‘What is “that thing”?’ He (the judge) said, ‘It is your tendency to the al-Rafidah (rejectionists).’ Ibn abu Ya’fur then wept until his tears flowed down and said, ‘O abu Yusuf, you are ascribing me to a community of people. I am afraid of not being of them.’ The judge then admitted his testimony.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/263)"
        ],
        "index": 14462,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/38",
              "text": "النَّوْفَلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/39",
              "text": "السَّكُونِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:23:9",
        "text": [
          " أُتِيَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) بِامْرَأَةٍ بِكْرٍ زَعَمُوا أَنَّهَا زَنَتْ فَأَمَرَ النِّسَاءَ فَنَظَرْنَ إِلَيْهَا فَقُلْنَ هِيَ عَذْرَاءُ فَقَالَ مَا كُنْتُ لِأَضْرِبَ مَنْ عَلَيْهَا خَاتَمٌ مِنَ اللَّهِ عَزَّ وَ جَلَّ وَ كَانَ يُجِيزُ ( عليه السلام ) شَهَادَةَ النِّسَاءِ فِي مِثْلِ هَذَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘They came to Amir Al-Momineen<sup>asws</sup> with an unmarried woman alleging that she had committed adultery. So he<sup>asws</sup> ordered the women to look at her, so they said, ‘She is a virgin’. So he<sup>asws</sup> said: ‘I<sup>asws</sup> would not be the one to whip one upon whom is a seal from Allah<sup>azwj</sup> Mighty and Majestic’. And he<sup>asws</sup> used to allow the testimony of the women in (cases) similar to this’."
          ],
          "en.sarwar": [
            "9. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn al-Hassan Shammun from ‘Abd Allah ibn ‘Abd al- Rahman from Misma‘ ibn ‘ Abd al-Malik who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin, Ali, Alayhi al-Salam, in the case of an atheist would issue a judgment. If two just and acceptable people testified against him and one thousand in his favor, he (the Imam) would accept the testimony of two people. He (the Imam) would reject the testimony of one thousand because it is a hidden religion.” (It is considered applicable when the testimonies are presented in different times.) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/263)"
        ],
        "index": 14463,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/241",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/900",
              "text": "إِبْرَاهِيمَ بْنِ أَبِي الْبِلَادِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/722",
              "text": "سَعْدٍ الْإِسْكَافِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ إِبْرَاهِيمَ بْنِ أَبِي الْبِلَادِ عَنْ سَعْدٍ الْإِسْكَافِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:23:10",
        "text": [
          " لَا أَعْلَمُهُ إِلَّا قَالَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَدْ كَانَ فِي بَنِي إِسْرَائِيلَ عَابِدٌ فَأُعْجِبَ لَهُ دَاوُدُ ( عليه السلام ) فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ لَا يُعْجِبْكَ شَيْ‏ءٌ مِنْ أَمْرِهِ فَإِنَّهُ مُرَاءٍ ",
          "قَالَ فَمَاتَ الرَّجُلُ فَأُتِيَ دَاوُدُ ( عليه السلام ) وَ قِيلَ لَهُ مَاتَ الرَّجُلُ فَقَالَ دَاوُدُ ( عليه السلام ) ادْفِنُوا صَاحِبَكُمْ قَالَ فَأَنْكَرَتْ بَنُو إِسْرَائِيلَ وَ قَالُوا كَيْفَ لَمْ يَحْضُرْهُ",
          "قَالَ فَلَمَّا غُسِّلَ قَامَ خَمْسُونَ رَجُلًا فَشَهِدُوا بِاللَّهِ مَا يَعْلَمُونَ مِنْهُ إِلَّا خَيْراً قَالَ فَلَمَّا صَلَّوْا عَلَيْهِ قَامَ خَمْسُونَ آخَرُونَ فَشَهِدُوا بِاللَّهِ مَا يَعْلَمُونَ إِلَّا خَيْراً فَلَمَّا دَفَنُوهُ قَامَ خَمْسُونَ فَشَهِدُوا بِاللَّهِ مَا يَعْلَمُونَ مِنْهُ إِلَّا خَيْراً ",
          "فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى دَاوُدَ ( عليه السلام ) مَا مَنَعَكَ أَنْ تَشْهَدَ فُلَاناً فَقَالَ دَاوُدُ ( عليه السلام ) يَا رَبِّ لِلَّذِي أَطْلَعْتَنِي عَلَيْهِ مِنْ أَمْرِهِ قَالَ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ أَنَّ ذَلِكَ كَذَلِكَ وَ لَكِنَّهُ قَدْ شَهِدَ قَوْمٌ مِنَ الْأَحْبَارِ وَ الرُّهْبَانِ مَا يَعْلَمُونَ مِنْهُ إِلَّا خَيْراً فَأَجَزْتُ شَهَادَتَهُمْ عَلَيْهِ وَ غَفَرْتُ لَهُ عِلْمِي فِيهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Ibrahim, Bin Abu Al Balaad, from Sa’ad Al Askaaf who said, ",
            "‘I have no knowledge of it except that Abu Ja’far<sup>asws</sup> said: ‘There used to be a worshipper among the Children of Israel to whom Dawood<sup>as</sup> used to marvel (be amazed) at. So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>as</sup>: “Do not marvel at anything from his affairs, for he is a show-off”.",
            "He<sup>asws</sup> said: ‘So the man died, so they came to Dawood<sup>as</sup> and said to him<sup>as</sup>, ‘The man died’. So Dawood<sup>as</sup> said: ‘Bury your companion’. But, the Children of Israel refused and they said, ‘How come you<sup>as</sup> are not attending it (funeral)?’ ",
            "He<sup>asws</sup> said: ‘So when he had been washed, fifty men arose and testified with Allah<sup>azwj</sup> that they did not know from him except for goodness. So when they had Prayed over him, fifty other men arose, so they testified with Allah<sup>azwj</sup> that they did not know from his except for the goodness. So when they had buried him, fifty testified with Allah<sup>azwj</sup> that they did not know from him except for the goodness’. ",
            "So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto Dawood<sup>as</sup>: “What prevented you<sup>as</sup> to testify for so and so?” So Dawood<sup>as</sup> said: ‘O Lord<sup>azwj</sup>! That which You<sup>azwj</sup> Notified me<sup>as</sup> of, from his affairs’. So Allah <sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>as</sup>: “That is like that, but a group of Rabbis and Monks have testified that they do not know from him except for the goodness, so I<sup>azwj</sup> Allowed their testimonies over him, and Forgave for him (whatever was) in My<sup>azwj</sup> Knowledge regarding him”."
          ],
          "en.sarwar": [
            "10. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy from al-Sakuniy who has narrated the following: “Abu ‘Abd Allah, Alayhi al-Salam, has said that ’Amir al-Mu’minin, Ali, Alayhi al-Salam, issued a judgment. It was in the case of a virgin woman who was accused of fornication. He (the Imam) commanded certain women to examine her. They reported about her to be a virgin. He (the Imam) issued a judgment that said, ‘I am not to penalize one on whom Allah, most Majestic, most Glorious, has placed a seal. 5 He (the Imam) accepted the testimony of women in such cases.” "
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "هَذَا آخِرُ كِتَابِ الشَّهَادَاتِ مِنَ الْكَافِي تَأْلِيفِ أَبِي جَعْفَرٍ مُحَمَّدِ بْنِ يَعْقُوبَ الْكُلَيْنِيِّ رَحِمَهُ اللَّهُ وَ يَتْلُوهُ كِتَابُ الْقَضَاءِ وَ الْأَحْكَامِ إِنْ شَاءَ اللَّهُ تَعَالَى ."
        ],
        "translations": {
          "en.hubeali": [
            "This is the end of the Book of the Testimonies from Al-Kafi, a compilation of Abu Ja’far Muhammad Bin Yaqoub Al-Kulayni, may Allah<sup>azwj</sup> have Mercy on him, and it would be followed by the Book of the adjudication and the rulings, Allah<sup>azwj</sup> Willing."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/263)"
        ],
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "11- "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/241",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5834",
              "text": "إِبْرَاهِيمَ بْنِ أَبِي الْبِلادِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5835",
              "text": "سَعْدٍ الإسْكَافِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "11- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ إِبْرَاهِيمَ بْنِ أَبِي الْبِلادِ عَنْ سَعْدٍ الإسْكَافِ قَالَ"
        },
        "part_type": "Hadith",
        "text": [
          " لا أَعْلَمُهُ إِلا قَالَ عَنْ أَبِي جَعْفَرٍ (عَلَيْهِ السَّلام) قَالَ قَدْ كَانَ فِي بَنِي إِسْرَائِيلَ عَابِدٌ فَأُعْجِبَ لَهُ دَاوُدُ (عَلَيْهِ السَّلام) فَأَوْحَى اللهُ عَزَّ وَجَلَّ إِلَيْهِ لا يُعْجِبْكَ شَيْ‏ءٌ مِنْ أَمْرِهِ فَإِنَّهُ مُرَاءٍ قَالَ فَمَاتَ الرَّجُلُ فَأُتِيَ دَاوُدُ (عَلَيْهِ السَّلام) وَقِيلَ لَهُ مَاتَ الرَّجُلُ فَقَالَ دَاوُدُ (عَلَيْهِ السَّلام) ادْفِنُوا صَاحِبَكُمْ قَالَ فَأَنْكَرَتْ بَنُو إِسْرَائِيلَ وَقَالُوا كَيْفَ لَمْ يَحْضُرْهُ قَالَ فَلَمَّا غُسِّلَ قَامَ خَمْسُونَ رَجُلا فَشَهِدُوا بِاللهِ مَا يَعْلَمُونَ مِنْهُ إِلا خَيْراً قَالَ فَلَمَّا صَلَّوْا عَلَيْهِ قَامَ خَمْسُونَ آخَرُونَ فَشَهِدُوا بِاللهِ مَا يَعْلَمُونَ إِلا خَيْراً فَلَمَّا دَفَنُوهُ قَامَ خَمْسُونَ فَشَهِدُوا بِاللهِ مَا يَعْلَمُونَ مِنْهُ إِلا خَيْراً فَأَوْحَى اللهُ عَزَّ وَجَلَّ إِلَى دَاوُدَ (عَلَيْهِ السَّلام) مَا مَنَعَكَ أَنْ تَشْهَدَ فُلاناً فَقَالَ دَاوُدُ (عَلَيْهِ السَّلام) يَا رَبِّ لِلَّذِي أَطْلَعْتَنِي عَلَيْهِ مِنْ أَمْرِهِ قَالَ فَأَوْحَى اللهُ عَزَّ وَجَلَّ إِلَيْهِ أَنَّ ذَلِكَ كَذَلِكَ وَلَكِنَّهُ قَدْ شَهِدَ قَوْمٌ مِنَ الأحْبَارِ وَالرُّهْبَانِ مَا يَعْلَمُونَ مِنْهُ إِلا خَيْراً فَأَجَزْتُ شَهَادَتَهُمْ عَلَيْهِ وَغَفَرْتُ لَهُ عِلْمِي فِيهِ. هَذَا آخِرُ كِتَابِ الشَّهَادَاتِ مِنَ الْكَافِي تَأْلِيفِ أَبِي جَعْفَرٍ مُحَمَّدِ بْنِ يَعْقُوبَ الْكُلَيْنِيِّ رَحِمَهُ اللهُ وَيَتْلُوهُ كِتَابُ الْقَضَاءِ وَالأحْكَامِ إِنْ شَاءَ اللهُ تَعَالَى. "
        ],
        "translations": {
          "en.sarwar": [
            "11. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Ibrahim ibn abu al-Balad from Sa‘d al-Iskaf who has said that I know the following to be from abu Ja‘far, ‘Alayhi al-Salam, only: “Abu Ja’far, Alayhi al-Salam, has said that among the Israelites there was a worshipper. Dawud Alayhi al-Salam, liked him for his worship. Allah, most Majestic, most Glorious, sent revelation to him and informed him that the worshipper is only a showoff person. The man died and Dawud Alayhi al-Salam, was informed about his death. He told them to bury him. The Israelites disliked it and said, ‘Why did you not attend his funeral?’ He (the Imam) said, ‘When Ghusl (bath) was complete fifty people testified by Allah that they did not know of him except good.’ He (the Imam) said, ‘When they performed Salat (prayer) for him then fifty people stood up and testified that they did not know anything about him except good.’ Allah, most Majestic, most Glorious, then sent revelation to Dawud, Alayhi al-Salam. It said, ‘What has stopped you from attending the funeral of so and so?’ He replied, ‘It is because of the information You gave me about him.’ He (the Imam) said, ‘Allah, most Majestic, most Glorious, sent him revelation saying that it was true but a people of learned men and monks testified that they did not know about him anything except good, so I admitted their testimony about him and forgave (overlooked, covered) My knowledge about him.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:5:23",
  "kind": "verse_list"
}