{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:7:5",
        "titles": {
          "ar": "كِتَابُ الشَّهَادَاتِ",
          "en": "THE BOOK OF TESTIMONIES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:7:5:3",
        "titles": {
          "ar": "باب كِتْمَانِ الشَّهَادَةِ",
          "en": "Chapter 3 – Concealing the testimony"
        }
      }
    ],
    "index": 2214,
    "local_index": 3,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 4"
        },
        "path": "/books/al-kafi:7:5:4",
        "titles": {
          "ar": "باب الرَّجُلُ يَسْمَعُ الشَّهَادَةَ وَ لَمْ يُشْهَدْ عَلَيْهَا",
          "en": "Chapter 4 – The man who heard the testimony and did not witness upon it"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 2"
        },
        "path": "/books/al-kafi:7:5:2",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الرَّجُلُ يُدْعَى</span> إِلَى الشَّهَادَةِ",
          "en": "Chapter 2 – The man summoned to the testimony"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:7:5",
        "titles": {
          "ar": "كِتَابُ الشَّهَادَاتِ",
          "en": "THE BOOK OF TESTIMONIES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:5:3",
    "titles": {
      "ar": "باب كِتْمَانِ الشَّهَادَةِ",
      "en": "Chapter 3 – Concealing the testimony"
    },
    "verse_count": 4,
    "verse_start_index": 14349,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/220)"
        ],
        "index": 14350,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:3:1",
        "relations": {
          "Mentions": [
            "/books/quran:65:2"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نَجْرَانَ وَ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ أَبِي جَمِيلَةَ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ كَتَمَ شَهَادَةً أَوْ شَهِدَ بِهَا لِيُهْدِرَ لَهَا بِهَا دَمَ امْرِئٍ مُسْلِمٍ أَوْ لِيَزْوِيَ مَالَ امْرِئٍ مُسْلِمٍ أَتَى يَوْمَ الْقِيَامَةِ وَ لِوَجْهِهِ ظُلْمَةٌ مَدَّ الْبَصَرِ وَ فِي وَجْهِهِ كُدُوحٌ تَعْرِفُهُ الْخَلَائِقُ بِاسْمِهِ وَ نَسَبِهِ ",
          "وَمَنْ شَهِدَ شَهَادَةَ حَقٍّ لِيُحْيِيَ بِهَا حَقَّ امْرِئٍ مُسْلِمٍ أَتَى يَوْمَ الْقِيَامَةِ وَ لِوَجْهِهِ نُورٌ مَدَّ الْبَصَرِ تَعْرِفُهُ الْخَلَائِقُ بِاسْمِهِ وَ نَسَبِهِ ",
          "ثُمَّ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) أَ لَا تَرَى أَنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى يَقُولُ وَ أَقِيمُوا الشَّهادَةَ لِلَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Abdul Rahman Bin Abu Najran, and Muhammad Bin Ali, from Abu Jameela, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The one who conceals a testimony, or testifies with it in order to waste by it the blood of a Muslim person, or to block the wealth of a Muslim person, would come on the Day of Judgement, and for his face would be darkness to the extent of the vision, and in his face would (signs of) toil (labour). The creatures would recognise him by his name and his lineage.",
            "And the one who testified with a true testimony, reviving by it a right of a Muslim person, would come on the Day of Judgement, and for his face would be light to the extent of the vision. The creatures would recognise him by his name and his lineage. ",
            "Then Abu Ja’far<sup>asws</sup> said: ‘Do you not see that Allah<sup>azwj</sup> Blessed and High is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:65#h2\">[65:2]</a> and establish the testimony for the Sake of Allah</span>’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn ‘Abd Allah from ‘Abd al-Rahman ibn abu Najran and Muhammad ibn Ali from abu Jamilah from Jabir who has narrated the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said this. ‘One may hide a testimony, or testify to invalidate the case of the murder of a Muslim, or to turn away from its rightful course the assets of a Muslim. He on the Day of Judgment will be brought with darkness before him as far as eyes can see, with bruises on his face whom all creatures will know by his name and genealogy. One who presents the right testimony to revive a right of a Muslim, he on the Day of Judgment will be brought with light before him as far as the eye can see, and all creatures will know him by his name and genealogy.’ Abu Ja‘far, Alayhi al-Salam, then said, ‘Have you not seen that Allah, the most Blessed, the most High, says, ‘. . . you must present the testimony for Allah.’ <a href=\"/#/books/quran:65#h2\">[65:2]</a>” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/221)"
        ],
        "index": 14351,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:3:2",
        "relations": {
          "Mentions": [
            "/books/quran:2:283"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ يَكْتُمْها فَإِنَّهُ آثِمٌ قَلْبُهُ قَالَ بَعْدَ الشَّهَادَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h283\">[2:283]</a> and whoever conceals it, so he has a sinful heart</span>. He<sup>asws</sup> said: ‘After the witnessing’."
          ],
          "en.sarwar": [
            "2. Afi ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hisham ibn Salim who has narrated the following: “About the meaning of the words of Allah, most Majestic, most Glorious, ‘. . . one who hides a testimony his heart is sinful,’ (2: 283) abu ‘Abd Allah, Alayhi al-Salam, has said, ‘It is after having witnessed a case.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/221)"
        ],
        "index": 14352,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:3:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ مَنْصُورٍ الْخُزَاعِيِّ عَنْ عَلِيِّ بْنِ سُوَيْدٍ السَّائِيِّ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ كَتَبَ أَبِي فِي رِسَالَتِهِ إِلَيَّ وَ سَأَلْتُهُ عَنِ الشَّهَادَةِ لَهُمْ فَأَقِمِ الشَّهَادَةَ لِلَّهِ وَ لَوْ عَلَى نَفْسِكَ أَوِ الْوَالِدَيْنِ وَ الْأَقْرَبِينَ فِيمَا بَيْنَكَ وَ بَيْنَهُمْ فَإِنْ خِفْتَ عَلَى أَخِيكَ ضَيْماً فَلَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ismail Biin Mihran, from Muhammad Bin Mansour Al Khazaie, from Ali Bin Suweyd Al Saie, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said: ‘My father wrote in his letter to me<sup>asws</sup>, and I asked him<sup>asws</sup> about the testimony for them: ‘So establish the testimony for the Sake of Allah<sup>azwj</sup> even though it be against yourself, or the parents, and the near-relatives, with regards to what is between you and them. So if you fear injustice against your brother, so no (don’t come forward)’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from ’Isma‘il ibn Mehran from Muhammad ibn Mansur al-Khuza‘iy from Ali ibn Suwayd al-Sa’iy who has narrated the following: “My father wrote to me in his letter and I asked abu al-Hassan, Alayhi al-Salam, about testimony for them. He (the Imam) said, ‘You must present a testimony for Allah, even if it is against your own soul or parents or relatives between you and them, but if you fear injustice to your brother then do not do so.’” Al-Husayn from Muhammad has narrated from Muhammad ibn Ahmad al-Nahdiy from ’Isma‘il ibn Mehran a similar Hadith. "
          ]
        }
      },
      {
        "index": 14353,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:3:4",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ النَّهْدِيِّ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "<span style=\"font-size: small\">Al Husayn Bin Muhammad, from Muhammad Bin Ahmad Al Nahdy, from Ismail Bin Mihran</span> – similar to it’. "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:5:3",
  "kind": "verse_list"
}