{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 5"}, "path": "/books/al-kafi:7:5", "titles": {"ar": "كِتَابُ الشَّهَادَاتِ", "en": "THE BOOK OF TESTIMONIES"}}, {"indexed_titles": {"en": "Chapter 7"}, "path": "/books/al-kafi:7:5:7", "titles": {"ar": "باب مَنْ شَهِدَ ثُمَّ رَجَعَ عَنْ شَهَادَتِهِ", "en": "Chapter 7 – The one who testifies, then retract from his testimony"}}], "index": 2208, "local_index": 7, "part_type": "Chapter", "path": "/books/al-kafi:7:5:7", "titles": {"ar": "باب مَنْ شَهِدَ ثُمَّ رَجَعَ عَنْ شَهَادَتِهِ", "en": "Chapter 7 – The one who testifies, then retract from his testimony"}, "verse_count": 8, "verse_start_index": 14355, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 14356, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:5:7:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَمَّنْ أَخْبَرَهُ عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي الشُّهُودِ إِذَا شَهِدُوا عَلَى رَجُلٍ ثُمَّ رَجَعُوا عَنْ شَهَادَتِهِمْ وَ قَدْ قُضِيَ عَلَى الرَّجُلِ ضُمِّنُوا مَا شَهِدُوا بِهِ وَ غُرِّمُوا وَ إِنْ لَمْ يَكُنْ قُضِيَ طُرِحَتْ شَهَادَتُهُمْ وَ لَمْ يُغَرَّمِ الشُّهُودُ شَيْئاً ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel Bin Darraj, from the one who informed him, ", "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) regarding the witnesses when they testify upon a man, then they retract from their testimonies, and the judgement has been passed upon the man, they would be responsible for what they had testified with, and be fined. However, if the judgement has not been passed, their testimonies would be dropped, and the witnesses would not be fined anything’."]}}, {"index": 14357, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:5:7:2", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي شَاهِدِ الزُّورِ مَا تَوْبَتُهُ قَالَ يُؤَدِّي مِنَ الْمَالِ الَّذِي شَهِدَ عَلَيْهِ بِقَدْرِ مَا ذَهَبَ مِنْ مَالِهِ إِنْ كَانَ النِّصْفَ أَوِ الثُّلُثَ إِنْ كَانَ شَهِدَ هَذَا وَ آخَرُ مَعَهُ ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the false testifier, what is his repentance?’ He<sup>asws</sup> said: ‘He would pay from his wealth to the one whom he had testified against by the measurement of what had gone from his wealth, whether it was the half, or the third, if this one had testified and another one was with him’."]}}, {"index": 14358, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:7:5:7:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ جَمِيلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي شَاهِدِ الزُّورِ قَالَ إِنْ كَانَ الشَّيْ‏ءُ قَائِماً بِعَيْنِهِ رُدَّ عَلَى صَاحِبِهِ وَ إِنْ لَمْ يَكُنْ قَائِماً ضَمِنَ بِقَدْرِ مَا أُتْلِفَ مِنْ مَالِ الرَّجُلِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Jameel, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the false testifier. He<sup>asws</sup> said: ‘If the thing remains exactly as it was, it would be returned to its owner, and if it has not remains as such, he would be responsible by the measurement of what had deteriorated from the wealth of the man’."]}}, {"index": 14359, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:7:5:7:4", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي أَرْبَعَةٍ شَهِدُوا عَلَى رَجُلٍ مُحْصَنٍ بِالزِّنَى ثُمَّ رَجَعَ أَحَدُهُمْ بَعْدَ مَا قُتِلَ الرَّجُلُ قَالَ إِنْ قَالَ الرَّابِعُ أَوْهَمْتُ ضُرِبَ الْحَدَّ وَ غُرِّمَ الدِّيَةَ وَ إِنْ قَالَ تَعَمَّدْتُ قُتِلَ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Mahboub, from one of his companions, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding four witnesses upon a married man with the adultery. Then one of them retracts after the man had been killed. He<sup>asws</sup> said: ‘If the fourth was deluded, he would be whipped by the legal penalty (<span class=\"iTxt\">Hadd</span>), and fined the wergild; but if he were to say it was deliberate, he would be killed’."]}}, {"index": 14360, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:7:5:7:5", "text": ["ابْنُ مَحْبُوبٍ عَنْ إِبْرَاهِيمَ بْنِ نُعَيْمٍ الْأَزْدِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ<span class=\"bTxt\"> ( عليه السلام )</span> عَنْ أَرْبَعَةٍ شَهِدُوا عَلَى رَجُلٍ بِالزِّنَى فَلَمَّا قُتِلَ رَجَعَ أَحَدُهُمْ عَنْ شَهَادَتِهِ قَالَ فَقَالَ يُقْتَلُ الرَّابِعُ وَ يُؤَدِّي الثَّلَاثَةُ إِلَى أَهْلِهِ ثَلَاثَةَ أَرْبَاعِ الدِّيَةِ ."], "translations": {"en.hubeali": ["Ibn Mahboub, from Ibrahim Bin Nuaym Al Azdy, who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about four witnesses upon a man with the adultery. So when he was killed, one of them retracted from his testimony. So he<sup>asws</sup> said: ‘The fourth would be killed, and the three would pay to his family three-quarters of the wergild’."]}}, {"index": 14361, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:7:5:7:6", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي شَهَادَةِ الزُّورِ إِنْ كَانَ الشَّيْ‏ءُ قَائِماً بِعَيْنِهِ رُدَّ عَلَى صَاحِبِهِ وَ إِلَّا ضَمِنَ بِقَدْرِ مَا أُتْلِفَ مِنْ مَالِ الرَّجُلِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the false testimony: ‘If it was something which remains exactly (as it used to be), it would be returned to its owner, or else he would be responsible by the measurement of what had deteriorated from the wealth of the man’."]}}, {"index": 14362, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:7:5:7:7", "text": ["ابْنُ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي شَاهِدَيْنِ شَهِدَا عَلَى امْرَأَةٍ بِأَنَّ زَوْجَهَا طَلَّقَهَا فَتَزَوَّجَتْ ثُمَّ جَاءَ زَوْجُهَا فَأَنْكَرَ الطَّلَاقَ قَالَ يُضْرَبَانِ الْحَدَّ وَ يُضَمَّنَانِ الصَّدَاقَ لِلزَّوْجِ ثُمَّ تَعْتَدُّ ثُمَّ تَرْجِعُ إِلَى زَوْجِهَا الْأَوَّلِ ."], "translations": {"en.hubeali": ["Ibn Abu Umeyr, from Ibrahim Bin Abdul Hameed, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding two witnesses testifying upon a woman that her husband has divorced her. So she re-married. Then her husband came and denied the divorce. He<sup>asws</sup> said: ‘They would both be whipped the legal penalty (<span class=\"iTxt\">Hadd</span>), and would both be responsible for the dowry to the husband. Then she would observe the waiting period, then return to her first husband’."]}}, {"index": 14363, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:7:5:7:8", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي رَجُلٍ شَهِدَ عَلَيْهِ رَجُلَانِ بِأَنَّهُ سَرَقَ فَقَطَعَ يَدَهُ حَتَّى إِذَا كَانَ بَعْدَ ذَلِكَ جَاءَ الشَّاهِدَانِ بِرَجُلٍ آخَرَ فَقَالَا هَذَا السَّارِقُ وَ لَيْسَ الَّذِي قَطَعْتَ يَدَهُ إِنَّمَا شَبَّهْنَا ذَلِكَ بِهَذَا فَقَضَى عَلَيْهِمَا أَنْ غَرَّمَهُمَا نِصْفَ الدِّيَةِ وَ لَمْ يُجِزْ شَهَادَتَهُمَا عَلَى الْآخَرِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Aasim Bin Humeyd, from Muhammad Bin Qays, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> judged regarding a man upon whom two witnesses testified for theft. So his hand was cut until when it was after that, the two witnesses came over with another man, so they both said, ‘This is the thief, and it is not the one who hand has been cut. But rather, that one resembled with this one. So he<sup>asws</sup> judged upon them both, that they would both be fined half the wergild, and both their testimonies would not be allowed upon the other one’."]}}]}, "index": "al-kafi:7:5:7", "kind": "verse_list"}