{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:7:5",
        "titles": {
          "ar": "كِتَابُ الشَّهَادَاتِ",
          "en": "THE BOOK OF TESTIMONIES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 8"
        },
        "path": "/books/al-kafi:7:5:8",
        "titles": {
          "ar": "باب شَهَادَةِ الْوَاحِدِ وَ يَمِينِ الْمُدَّعِي",
          "en": "Chapter 8 – The one testimony and the oath of the claimant"
        }
      }
    ],
    "index": 2219,
    "local_index": 8,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 9"
        },
        "path": "/books/al-kafi:7:5:9",
        "titles": {
          "ar": "باب",
          "en": "Chapter 9 – A chapter"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 7"
        },
        "path": "/books/al-kafi:7:5:7",
        "titles": {
          "ar": "باب مَنْ شَهِدَ ثُمَّ رَجَعَ عَنْ شَهَادَتِهِ",
          "en": "Chapter 7 – The one who testifies, then retract from his testimony"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:7:5",
        "titles": {
          "ar": "كِتَابُ الشَّهَادَاتِ",
          "en": "THE BOOK OF TESTIMONIES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:5:8",
    "titles": {
      "ar": "باب شَهَادَةِ الْوَاحِدِ وَ يَمِينِ الْمُدَّعِي",
      "en": "Chapter 8 – The one testimony and the oath of the claimant"
    },
    "verse_count": 8,
    "verse_start_index": 14374,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/229)"
        ],
        "index": 14375,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:8:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ حَمَّادِ بْنِ عُثْمَانَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ كَانَ عَلِيٌّ ( عليه السلام ) يُجِيزُ فِي الدَّيْنِ شَهَادَةَ رَجُلٍ وَ يَمِينَ الْمُدَّعِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Al Hassan Bin Ali Al Washa, from Hammad Bin Usman who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> Saying; ‘Ali<sup>asws</sup> used to allow, with regards to the debt, the testimony of a man and an oath of the claimant’."
          ],
          "en.sarwar": [
            "1. Al-Husayn Muhammad has narrated from Mu‘alla’ ibn Muhammad from al-Hassan ibn Ali al-Washsha’ from Hammad ibn ‘Uthaman who has narrated the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, saying that in the case of a loan ’ Amir al-Mu’minin, Ali, Alayhi al-Salam, would accept the testimony of one person with the oath of the plaintiff.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/229)"
        ],
        "index": 14376,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:8:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ حَدَّثَنِي أَبِي أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَضَى بِشَاهِدٍ وَ يَمِينٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘My<sup>asws</sup> father<sup>asws</sup> narrated to me<sup>asws</sup> that Rasool-Allah<sup>saww</sup> judged with a witness and an oath’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa who has narrated the following: “I once heard abu ‘Abd Allah, Alayhi al-Salam, saying, ‘My father has narrated to me that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, issued judgment on the basis of one witness and an oath.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/229)"
        ],
        "index": 14377,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:8:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ زُرْعَةَ عَنْ سَمَاعَةَ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَكُونُ لَهُ عِنْدَ الرَّجُلِ الْحَقُّ وَ لَهُ شَاهِدٌ وَاحِدٌ قَالَ فَقَالَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَقْضِي بِشَاهِدٍ وَاحِدٍ وَ يَمِينَ صَاحِبِ الْحَقِّ وَ ذَلِكَ فِي الدَّيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from zur’at, from Sama’at, from Abu Baseer who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man who happened to have a right for him, with a man, and for him was one witness’. So he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> used to judge with one witness and an oath of the owner of the right, and that is regarding the debt’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from Zur’ah from Sama‘ah from abu Basir who has narrated the following: “I once asked abu ‘Abd Allah, Alayhi al-Salam, about the case of a man who has a certain claim on a man about which he has only one witness. He (the Imam) said, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, would issue judgment on the basis of one witness and an oath by the claimant in the issue of loan.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/229)"
        ],
        "index": 14378,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:8:4",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مَنْصُورِ بْنِ حَازِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَقْضِي بِشَاهِدٍ وَاحِدٍ مَعَ يَمِينِ صَاحِبِ الْحَقِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Mansour Bin Hazim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> judged with one witness along with an oath from the owner of the right’."
          ],
          "en.sarwar": [
            "4. Abu Ali al-Ash ‘ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from Mansur ibn Hazim who has narrated the following: “Abu ‘Abd Allah, Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, would issue judgment on the basis of one witness and an oath by the claimant.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/230)"
        ],
        "index": 14379,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:8:5",
        "relations": {
          "Mentions": [
            "/books/quran:65:2"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ دَخَلَ الْحَكَمُ بْنُ عُتَيْبَةَ وَ سَلَمَةُ بْنُ كُهَيْلٍ عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) فَسَأَلَاهُ عَنْ شَاهِدٍ وَ يَمِينٍ فَقَالَ قَضَى بِهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ قَضَى بِهِ عَلِيٌّ ( عليه السلام ) عِنْدَكُمْ بِالْكُوفَةِ فَقَالَا هَذَا خِلَافُ الْقُرْآنِ فَقَالَ وَ أَيْنَ وَجَدْتُمُوهُ خِلَافَ الْقُرْآنِ فَقَالَا إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى يَقُولُ وَ أَشْهِدُوا ذَوَيْ عَدْلٍ مِنْكُمْ فَقَالَ لَهُمَا أَبُو جَعْفَرٍ ( عليه السلام ) فَقَوْلُهُ وَ أَشْهِدُوا ذَوَيْ عَدْلٍ مِنْكُمْ هُوَ أَنْ لَا تَقْبَلُوا شَهَادَةَ وَاحِدٍ وَ يَمِيناً",
          "ثُمَّ قَالَ إِنَّ عَلِيّاً ( عليه السلام ) كَانَ قَاعِداً فِي مَسْجِدِ الْكُوفَةِ فَمَرَّ بِهِ عَبْدُ اللَّهِ بْنُ قُفْلٍ التَّمِيمِيُّ وَ مَعَهُ دِرْعُ طَلْحَةَ فَقَالَ عَلِيٌّ ( عليه السلام ) هَذِهِ دِرْعُ طَلْحَةَ أُخِذَتْ غُلُولًا يَوْمَ الْبَصْرَةِ فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ قُفْلٍ فَاجْعَلْ بَيْنِي وَ بَيْنَكَ قَاضِيَكَ الَّذِي رَضِيتَهُ لِلْمُسْلِمِينَ فَجَعَلَ بَيْنَهُ وَ بَيْنَهُ شُرَيْحاً",
          "فَقَالَ عَلِيٌّ ( عليه السلام ) هَذِهِ دِرْعُ طَلْحَةَ أُخِذَتْ غُلُولًا يَوْمَ الْبَصْرَةِ فَقَالَ لَهُ شُرَيْحٌ هَاتِ عَلَى مَا تَقُولُ بَيِّنَةً فَأَتَاهُ بِالْحَسَنِ ( عليه السلام ) فَشَهِدَ أَنَّهَا دِرْعُ طَلْحَةَ أُخِذَتْ غُلُولًا يَوْمَ الْبَصْرَةِ فَقَالَ شُرَيْحٌ هَذَا شَاهِدٌ وَاحِدٌ فَلَا أَقْضِي بِشَهَادَةِ شَاهِدٍ حَتَّى يَكُونَ مَعَهُ آخَرُ فَدَعَا قَنْبَراً فَشَهِدَ أَنَّهَا دِرْعُ طَلْحَةَ أُخِذَتْ غُلُولًا يَوْمَ الْبَصْرَةِ فَقَالَ شُرَيْحٌ هَذَا مَمْلُوكٌ وَ لَا أَقْضِي بِشَهَادَةِ مَمْلُوكٍ",
          "قَالَ فَغَضِبَ عَلِيٌّ ( عليه السلام ) فَقَالَ خُذُوهَا فَإِنَّ هَذَا قَضَى بِجَوْرٍ ثَلَاثَ مَرَّاتٍ قَالَ فَتَحَوَّلَ شُرَيْحٌ ثُمَّ قَالَ لَا أَقْضِي بَيْنَ اثْنَيْنِ حَتَّى تُخْبِرَنِي مِنْ أَيْنَ قَضَيْتُ بِجَوْرٍ ثَلَاثَ مَرَّاتٍ فَقَالَ لَهُ وَيْلَكَ أَوْ وَيْحَكَ إِنِّي لَمَّا أَخْبَرْتُكَ أَنَّهَا دِرْعُ طَلْحَةَ أُخِذَتْ غُلُولًا يَوْمَ الْبَصْرَةِ فَقُلْتَ هَاتِ عَلَى مَا تَقُولُ بَيِّنَةً وَ قَدْ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) حَيْثُمَا وُجِدَ غُلُولٌ أُخِذَ بِغَيْرِ بَيِّنَةٍ فَقُلْتُ رَجُلٌ لَمْ يَسْمَعِ الْحَدِيثَ فَهَذِهِ وَاحِدَةٌ ",
          "ثُمَّ أَتَيْتُكَ بِالْحَسَنِ فَشَهِدَ فَقُلْتَ هَذَا وَاحِدٌ وَ لَا أَقْضِي بِشَهَادَةِ وَاحِدٍ حَتَّى يَكُونَ مَعَهُ آخَرُ وَ قَدْ قَضَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِشَهَادَةِ وَاحِدٍ وَ يَمِينٍ فَهَذِهِ ثِنْتَانِ",
          "ثُمَّ أَتَيْتُكَ بِقَنْبَرٍ فَشَهِدَ أَنَّهَا دِرْعُ طَلْحَةَ أُخِذَتْ غُلُولًا يَوْمَ الْبَصْرَةِ فَقُلْتَ هَذَا مَمْلُوكٌ وَ لَا أَقْضِي بِشَهَادَةِ مَمْلُوكٍ وَ مَا بَأْسٌ بِشَهَادَةِ الْمَمْلُوكِ إِذَا كَانَ عَدْلًا ",
          "ثُمَّ قَالَ وَيْلَكَ أَوْ وَيْحَكَ إِمَامُ الْمُسْلِمِينَ يُؤْمَنُ مِنْ أُمُورِهِمْ عَلَى مَا هُوَ أَعْظَمُ مِنْ هَذَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajjaj who said, ",
            "‘Al-Hakm Bin Uteyba and Salmat Bin Kuheyl came over to Abu Ja’far<sup>asws</sup>. So they both asked him about a witness and an oath. So he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> had judged by it, and Ali<sup>asws</sup> had judged by it in your presence at Al-Kufa’. So they both said, ‘This is opposing the Quran!’ So he<sup>asws</sup> said: ‘And where did you find it to be opposing the Quran?’ So they both said, ‘Allah<sup>azwj</sup> Blessed and High is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:65#h2\">[65:2]</a> and call to witness two (men) of justice from among you</span>’. So Abu Ja’far said to both of them: ‘So His<sup>azwj</sup> Words  <span class=\"ibTxt\">two (men) of justice from among you</span>, it is that you should accept the testimony of one and an oath’. ",
            "Then he<sup>asws</sup> said: ‘Ali<sup>asws</sup> was seated in Masjid of Al-Kufa, so there passed by him<sup>asws</sup> Abdullah Bin Fuql Al-Tameemy, and with him was a shield of Talha. So Ali<sup>asws</sup> said to him: ‘This a shield of Talha. It was taken deceptively (from war booty) on the day of Al-Basra (Battle of the camel)’. So Abdullah Bin Fuql said to him<sup>asws</sup>, ‘So make a judge to be in between me and you<sup>asws</sup>, one whom you<sup>asws</sup> are pleased with for the Muslims’. So he<sup>asws</sup> made Shurayh to be between himself<sup>asws</sup> and him.",
            "So Ali<sup>asws</sup> said: ‘This is a shield of Talha. I<sup>asws</sup> had seized it on the day of Al-Basra’. So Shurayh said to him<sup>asws</sup>, ‘Come with a proof upon what you<sup>asws</sup> are saying’. So he<sup>asws</sup> came with Al-Hassan<sup>asws</sup>. So he<sup>asws</sup> testified that this is a shield of Talha taken deceptively (from war booty) on the day of Al-Basra’. So Shurayh said, ‘This is one witness, so I shall not judge with the testimony of one witness until there happens to be another one with him’. So he<sup>asws</sup> called Qanbar. So he testified that it was a shield of Talha taken deceptively (from war booty) on the day of Al-Basra. So Shurayh said, ‘This is an owned slave, and I will not judge with a testimony of an owned slave’. ",
            "He (the narrator) said, ‘So Ali<sup>asws</sup> was furious, so he<sup>asws</sup> said: ‘Take it, for this one had judged with inequity’, three times. So Shurayh turned around, then said, ‘I will not judge between two until you<sup>asws</sup> inform me from where I have judged with inequity, three times’. So he<sup>asws</sup> said to him: ‘Woe be unto you!, or ‘Fie be on you!, When I<sup>asws</sup> informed you that it was a shield of Talha taken deceptively (from war booty) on the day of Al-Basra, so you said, ‘Come with proof upon what you<sup>asws</sup> are saying’, and Rasool-Allah<sup>saww</sup> had said: ‘Wherever a stolen (war booty) is found, it would be retrieved without proof’. So I<sup>asws</sup> said: ‘A man has not heard the Hadeeth’. So this is once. ",
            "Then I<sup>asws</sup> came to you with Al-Hassan<sup>asws</sup>, so he<sup>asws</sup> testified, so you said, ‘This is one, and I will not judge with the testimony of one until there happens to be another one with him<sup>asws</sup>’, and Rasool-Allah<sup>saww</sup> had judged with the testimony of one and an oath. So this is twice’. ",
            "Then I<sup>asws</sup> came over with Qanbar, so he testified that it was a shield of Talha taken by deception (from war booty) on the day of Al-Basra, so you said, ‘This is an owned slave, and I will not judge with the testimony of an owned slave; and what is wrong with the testimony of the owned slave when it was just?’. ",
            "Then he<sup>asws</sup> said: ‘Woe be unto you!’, or ‘Fie be upon you! An Imam<sup>asws</sup> of the Muslims is trusted upon their affairs upon what is greater than this’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Abd al- Rahman ibn al-Hajjaj who has narrated the following: “Once al-Hakam ibn ‘Utaybah and Salmah ibn Kuhayl visited abu Ja‘far, Alayhi al-Salam, and asked about the testimony of one witness and a oath. He (the Imam) said, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, issued judgment on such basis as well as Ali, Alayhi al-Salam, before you in al-Kufah.’ They said, ‘This is against al-Quran because Allah, the most Blessed, the most High, says, “. . . two just people must testify.” <a href=\"/#/books/quran:65#h2\">[65:2]</a> Abu Ja‘far, Alayhi al-Salam, then said to them, does, “. . . two just people must testify” <a href=\"/#/books/quran:65#h2\">[65:2]</a> mean, do not accept the testimony of one witness with one oath? Besides, once Ali, Alayhi al-Salam, was sitting in the Masjid of al-Kufah that ‘Abd Allah ibn Qufl al-Tamimiy carrying the shield of Talhah passed by, and Ali, Alayhi al-Salam, said, “This is the shield of Talhah which you have stolen from the items captured in the war on the day of Basrah.” ‘Abd Allah ibn Qufl said, “Find a judge to decide for us and he can be the judge whom you have appointed for the Muslims.” He (the Imam) then found Shurayh to judge for them. Ali, Alayhi al-Salam, stated that this shield belonged to Talhah. He (Qufl) had stolen it on the day of al-Basrah. Shurayh asked for proof and he (the Imam) brought al-Hassan, Alayhi al-Salam, as witness who testified that it was the shield of Talhah which Qufl had stolen on the day of al-Basrah. Shurayh said, “This is one witness and I do not issue a judgment with one witness unless there is another one.” He (the Imam) called Qanbar who testified saying, “This was the shield of Talhah which he had stolen on the day of al-Basrah.” Shurayh said, “He is a slave and I do not issue judgment on the basis of the testimony of a slave.” ’Amir al- Mu’minin, Ali, ‘Alayhi al-Salam, became angry and said, “You take it and it is an unjust judgment.” He (the Imam) said it three times. Shurayh then turned around and said, “I will not work as a judge between two people until you tell me on what basis you said three times that my judgment is unjust.” He (the Imam) said to him, “Woe is upon you”, or he (the Imam) said, “Fie up on you. When I said, ‘This is the shield of Talhah which he had stolen on the day of al-Basrah’, you said that I must present proof. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘If items stolen from assets captured in a war are found, they can be taken back without testimony.’ I said, ‘The man has not heard the Hadith of the Messenger of Allah.’ This is one. Then I brought al-Hassan before you who testified and you said, ‘This is one and I do not issue judgment on the basis of one witness until there is another one.’ The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, issued judgment based on one witness and an oath. This is two. I then brought Qanbar before you who testified that it is the shield of Talhah, which he had stolen on the day of al-Basrah. You said that he is a slave and that you do not issue judgment on the basis of the testimony of a slave. In fact it is not harmful to accept the testimony of a slave if he is a just person.’” He (the Imam) then said, ‘Woe is upon you’ or he (the Imam) said, ‘Fie upon you. Imam of the Muslims is trusted for issues much more important than this.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/231)"
        ],
        "index": 14380,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:8:6",
        "text": [
          "بَعْضُ أَصْحَابِنَا عَنْ مُحَمَّدِ بْنِ عَبْدِ الْحَمِيدِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ مَنْصُورِ بْنِ حَازِمٍ قَالَ حَدَّثَنِي الثِّقَةُ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ إِذَا شَهِدَ لِصَاحِبِ الْحَقِّ امْرَأَتَانِ وَ يَمِينَهُ فَهُوَ جَائِزٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "One of our companions, from Muhammad Bin Abdul Hameed, from Sayf Bin Umeyra, from Mansour Bin Hazim who said, ",
            "‘The reliable one narrated to me from Abu Al-Hassan<sup>asws</sup> having said: ‘When two women testify for the owner of the right, and he swears an oath, so it is allowed’."
          ],
          "en.sarwar": [
            "6. Certain persons of our people have narrated from Muhammad ibn ‘Abd al-Hamid from Sayf ibn ’Am/rah from Mansur ibn Hazim who has narrated the following: “A trustworthy man narrated to me from abu al-Hassan, Alayhi al-Salam, who has said that if two women testify for the right of someone with his (plaintiff’s) oath, it is an accepted proof.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/231)"
        ],
        "index": 14381,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:8:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) أَجَازَ شَهَادَةَ النِّسَاءِ مَعَ يَمِينِ الطَّالِبِ فِي الدَّيْنِ يَحْلِفُ بِاللَّهِ إِنَّ حَقَّهُ لَحَقٌّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that Rasool-Allah<sup>saww</sup> allowed the testimony of the women with an oath of the seeker regarding the debt, swearing by Allah<sup>azwj</sup> that he is rightful for the right’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from ibn abu ‘ Urn ay r from Hammad from al-Halabiy who has narrated the following: “Abu ‘Abd Allah, Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, accepted the testimony of women with the oath by the plaintiff in matters of loan. He swears by Allah that it is his right.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/231)"
        ],
        "index": 14382,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:8:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يُجِيزُ فِي الدَّيْنِ شَهَادَةَ رَجُلٍ وَاحِدٍ وَ يَمِينَ صَاحِبِ الدِّينِ وَ لَمْ يَكُنْ يُجِيزُ فِي الْهِلَالِ إِلَّا شَاهِدَيْ عَدْلٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Abu Ayoub Al Khazzaz, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> had allowed regarding the debt, a testimony of one man and an oath of the owner of the debt, and it does not happen to be permissible regarding the (sighting of) the new moon except for two just witnesses’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from abu Ayyub al-Khazzaz from Muhammad ibn Muslim who has narrated the following: “Abu ‘Abd Allah, Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, in the matter of loan accepted the testimony of one man and the oath of the creditor. However, in the case of the sighting of new moon he would only accept two witnesses.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:5:8",
  "kind": "verse_list"
}