{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:7:5",
        "titles": {
          "ar": "كِتَابُ الشَّهَادَاتِ",
          "en": "THE BOOK OF TESTIMONIES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 9"
        },
        "path": "/books/al-kafi:7:5:9",
        "titles": {
          "ar": "باب",
          "en": "Chapter 9 – A chapter"
        }
      }
    ],
    "index": 2220,
    "local_index": 9,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 10"
        },
        "path": "/books/al-kafi:7:5:10",
        "titles": {
          "ar": "باب فِي الشَّهَادَةِ لِأَهْلِ الدَّيْنِ",
          "en": "Chapter 10 – Regarding the testimony of the owners of the debts"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 8"
        },
        "path": "/books/al-kafi:7:5:8",
        "titles": {
          "ar": "باب شَهَادَةِ الْوَاحِدِ وَ يَمِينِ الْمُدَّعِي",
          "en": "Chapter 8 – The one testimony and the oath of the claimant"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:7:5",
        "titles": {
          "ar": "كِتَابُ الشَّهَادَاتِ",
          "en": "THE BOOK OF TESTIMONIES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:5:9",
    "titles": {
      "ar": "باب",
      "en": "Chapter 9 – A chapter"
    },
    "verse_count": 4,
    "verse_start_index": 14382,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/232)"
        ],
        "index": 14383,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/222",
              "text": "عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/416",
              "text": "الْقَاسِمِ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1542",
              "text": "سُلَيْمَانَ بْنِ دَاوُدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/164",
              "text": "حَفْصِ بْنِ غِيَاثٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ جَمِيعاً عَنِ الْقَاسِمِ بْنِ يَحْيَى عَنْ سُلَيْمَانَ بْنِ دَاوُدَ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:9:1",
        "text": [
          " قَالَ لَهُ رَجُلٌ أَ رَأَيْتَ إِذَا رَأَيْتُ شَيْئاً فِي يَدَيْ رَجُلٍ أَ يَجُوزُ لِي أَنْ أَشْهَدَ أَنَّهُ لَهُ قَالَ نَعَمْ قَالَ الرَّجُلُ أَشْهَدُ أَنَّهُ فِي يَدِهِ وَ لَا أَشْهَدُ أَنَّهُ لَهُ فَلَعَلَّهُ لِغَيْرِهِ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَ فَيَحِلُّ الشِّرَاءُ مِنْهُ قَالَ نَعَمْ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَلَعَلَّهُ لِغَيْرِهِ فَمِنْ أَيْنَ جَازَ لَكَ أَنْ تَشْتَرِيَهُ وَ يَصِيرَ مِلْكاً لَكَ ثُمَّ تَقُولَ بَعْدَ الْمِلْكِ هُوَ لِي وَ تَحْلِفَ عَلَيْهِ وَ لَا يَجُوزُ أَنْ تَنْسِبَهُ إِلَى مَنْ صَارَ مِلْكُهُ مِنْ قِبَلِهِ إِلَيْكَ ثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَوْ لَمْ يَجُزْ هَذَا لَمْ يَقُمْ لِلْمُسْلِمِينَ سُوقٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Ali Bin Muhammad Al Qasany, both together from Al Qasim Bin Yahya, from Suleyman Bin Dawood, from Hafs Bin Giyas, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘A man said to him<sup>asws</sup>, ‘What is your<sup>asws</sup> view if I were to see something in the hands of a man, is it allowable for me that I should testify that it is for him?’ He<sup>asws</sup> said: ‘Yes’. The man said, ‘I can testify that it is in his hand, and I cannot testify that it is for him, for perhaps it is for someone else?’ So Abu Abdullah<sup>asws</sup> said to him: ‘Is it permissible to buy it from him?’ He said, ‘Yes’. So Abu Abdullah<sup>asws</sup> said: ‘So, perhaps it is for someone else, so from where it is allowed for you that you buy it and the ownership comes to you? Then you would be saying after the ownership, ‘It is for me’, and whereas you have (taken the) oath over it, and it would not be permissible for you to link it to the one from whom the ownership came to be, from before him’. Then he<sup>asws</sup> said: ‘If this was not allowed, a market would not be established for the Muslims’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from and Ali ibn Muhammad al-Qasaniy all have narrated from al-Qasim ibn Yahya from Sulayman ibn Dawud from Hafs ibn Ghiyath who has narrated the following: “Once a man asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘If I see something in the hand of a man can I testify that it belongs to him?’ He (the Imam) said, ‘Yes, you can do so.’ The man then said, ‘I can testify that it is in his hand but how can I testify that it belongs to him, perhaps it belongs to someone else ? 5 He (the Imam) asked, ‘Is it lawful to buy it from him?’ The man replied, ‘Yes, it is lawful to buy it from him.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, then said, ‘It perhaps belongs to someone else; then how it becomes lawful for you to buy it from him and how can it become of your belongings? How after taking possession can you say that it belongs to you, you can swear and it would be unlawful to ascribe its ownership to one from whose possession its ownership is transferred to you?’ He (the Imam) said, ‘Had it been as you said, the Muslims could never establish a market.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/232)"
        ],
        "index": 14384,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/165",
              "text": "مُعَاوِيَةَ بْنِ وَهْبٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:9:2",
        "text": [
          " قُلْتُ لَهُ إِنَّ ابْنَ أَبِي لَيْلَى يَسْأَلُنِي الشَّهَادَةَ عَلَى أَنَّ هَذِهِ الدَّارَ مَاتَ فُلَانٌ وَ تَرَكَهَا مِيرَاثَهُ وَ أَنَّهُ لَيْسَ لَهُ وَارِثٌ غَيْرُ الَّذِي شَهِدْنَا لَهُ فَقَالَ اشْهَدْ بِمَا هُوَ عِلْمُكَ قُلْتُ إِنَّ ابْنَ أَبِي لَيْلَى يُحْلِفُنَا الْغَمُوسَ قَالَ احْلِفْ إِنَّمَا هُوَ عَلَى عِلْمِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muawiya Bin Wahab who said, ",
            "‘I said to him<sup>asws</sup>, ‘Ibn Abu Layli asked me to testify upon that this is the house in which a man died and left his inheritance, and that there not inheritors for him other than those we have testified for’. So he<sup>asws</sup> said: ‘Testify with what is in your knowledge’. I said, ‘Ibn Abu Layli made us swear a false oath’. He<sup>asws</sup> said: ‘Swear upon what is in your knowledge’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘ Umayr from Mu‘awiyah ibn Wahab who has narrated the following: “I once said to him (the Imam), ‘Alayhi al-Salam, that ibn abu Layla’ asks me to testify that this is a house and so and so has died and has left it behind as his legacy and that there is no other heir for him except the ones in whose favor we have testified. He (the Imam) said, ‘You can testify about what you have knowledge thereof.’ I then said that ibn abu Layla’ makes us to swear falsely. He (the Imam) said, ‘You can swear about what you know.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/233)"
        ],
        "index": 14385,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/117",
              "text": "عُثْمَانَ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/42",
              "text": "بَعْضِ أَصْحَابِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:9:3",
        "text": [
          " قُلْتُ يَكُونُ لِلرَّجُلِ مِنْ إِخْوَانِي عِنْدِي شَهَادَةٌ وَ لَيْسَ كُلُّهَا يُجِيزُهَا الْقُضَاةُ عِنْدَنَا قَالَ فَإِذَا عَلِمْتَ أَنَّهَا حَقٌّ فَصَحِّحْهَا بِكُلِّ وَجْهٍ حَتَّى يَصِحَّ لَهُ حَقُّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from one of his companions, ",
            "(The narrator) says, Abu Abdullah<sup>asws</sup>, said, ‘I said, ‘There happened to be for the man from my brethren, a testimony with me, and the judges among us did not allow all of it’. He<sup>asws</sup> said: ‘So when you know that it is true, so correct it with each aspect of it, to achieve his right for him’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ‘Uthman ibn ‘Isa from certain persons of his people who has narrated the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, that I bear a testimony for one of our brothers but all of the judges around us do not grant it. He (the Imam) said, ‘If you know that it is right then you can correct it as such that can prove his right.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/233)"
        ],
        "index": 14386,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/313",
              "text": "إِسْمَاعِيلَ بْنِ مَرَّارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/165",
              "text": "مُعَاوِيَةَ بْنِ وَهْبٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:5:9:4",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الرَّجُلُ يَكُونُ فِي دَارِهِ ثُمَّ يَغِيبُ عَنْهَا ثَلَاثِينَ سَنَةً وَ يَدَعُ فِيهَا عِيَالَهُ ثُمَّ يَأْتِينَا هَلَاكُهُ وَ نَحْنُ لَا نَدْرِي مَا أَحْدَثَ فِي دَارِهِ وَ لَا نَدْرِي مَا حَدَثَ لَهُ مِنَ الْوَلَدِ إِلَّا أَنَّا لَا نَعْلَمُ نَحْنُ أَنَّهُ أَحْدَثَ فِي دَارِهِ شَيْئاً وَ لَا حَدَثَ لَهُ وَلَدٌ وَ لَا يُقْسَمُ هَذِهِ الدَّارُ بَيْنَ وَرَثَتِهِ الَّذِينَ تَرَكَ فِي الدَّارِ حَتَّى يَشْهَدَ شَاهِدَا عَدْلٍ أَنَّ هَذِهِ الدَّارَ دَارُ فُلَانِ بْنِ فُلَانٍ مَاتَ وَ تَرَكَهَا مِيرَاثاً بَيْنَ فُلَانٍ وَ فُلَانٍ أَ فَنَشْهَدُ عَلَى هَذَا قَالَ نَعَمْ ",
          "قُلْتُ الرَّجُلُ يَكُونُ لَهُ الْعَبْدُ وَ الْأَمَةُ فَيَقُولُ أَبَقَ غُلَامِي وَ أَبَقَتْ أَمَتِي فَيُوجَدُ فِي الْبَلَدِ فَيُكَلِّفُهُ الْقَاضِي الْبَيِّنَةَ أَنَّ هَذَا غُلَامُ فُلَانٍ لَمْ يَبِعْهُ وَ لَمْ يَهَبْهُ أَ فَنَشْهَدُ عَلَى هَذَا إِذَا كُلِّفْنَاهُ وَ نَحْنُ لَمْ نَعْلَمْ أَحْدَثَ شَيْئاً قَالَ فَكُلَّمَا غَابَ مِنْ يَدِ الْمَرْءِ الْمُسْلِمِ غُلَامُهُ أَوْ أَمَتُهُ أَوْ غَابَ عَنْكَ لَمْ تَشْهَدْ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus, from Muawiya Bin Wahab who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘A man happened to be in his house, then he was absent from it for thirty years, and left his family in it. Then came to us (news of) his death, and we do not know what occurred in his house, nor do we know what occurred for him from the children except that we know that we do not know something was in his house nor some birth occurred for him, nor had this house been divided between his inheritors whom he had left in the house, until there testified two just witnesses that this is the house of so and so, son of so and so, who died and left it as an inheritance between so and so, and so and so. Should we testify upon this?’ He<sup>asws</sup> said: ‘Yes’. ",
            "I said, ‘The man happened to have the slave and the slave girl for him. So he is saying, ‘My slave absconded, and my slave girl absconded’. So they were found in the city. So the judge assigned for it the production of the proof that this is a slave of so and so, not being sold nor being gifted. Should we testify upon this, when he assigns us and we do not know anything of the event?’ He<sup>asws</sup> said: ‘For everything which is absent from the hand of the Muslim person, his slave or slave girl, or absent from you, do not testify upon it’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ’Isma‘il ibn Marrar from Yunus from Mu‘awiyah ibn Wahab who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who has a house and he remains absent from it for thirty years; but he leaves his family there, then news of his death comes. We do not know what may have happened in his house as well as to his children. We however, do not know of anything happening to his house and no birth of children has happened to him. This house is not divided among his heirs whom he had left in his house so that two just witnesses can testify that this house is the house of so and so son of so and so who has died and has left behind as legacy for so and so. Can we testify about it? He (the Imam) said, ‘Yes, you can do so.’ I then said that a man has a slave and slave woman. He says that his slave has run away, his slave woman has run away and they are found in the town. The judge asks for proof that this is the slave of so and so whom he has not sold or gifted; if we can testify about it if we are asked and we do not know if anything has happened or not. He (the Imam) said, ‘Whatever goes out of the hands of a Muslim man, slave or slave woman or is absent from you, do not testify about it.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:5:9",
  "kind": "verse_list"
}