{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 6"
        },
        "path": "/books/al-kafi:7:6",
        "titles": {
          "ar": "كِتَابُ الْقَضَاءِ وَ الْأَحْكَامِ",
          "en": "THE BOOK OF JUDGEMENTS AND THE RULINGS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 10"
        },
        "path": "/books/al-kafi:7:6:10",
        "titles": {
          "ar": "باب أَنَّ الْقَضَاءَ بِالْبَيِّنَاتِ وَ الْأَيْمَانِ",
          "en": "Chapter 10 – The judgements are by the proofs and the oaths"
        }
      }
    ],
    "index": 2244,
    "local_index": 10,
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:6:10",
    "titles": {
      "ar": "باب أَنَّ الْقَضَاءَ بِالْبَيِّنَاتِ وَ الْأَيْمَانِ",
      "en": "Chapter 10 – The judgements are by the proofs and the oaths"
    },
    "verse_count": 4,
    "verse_start_index": 14492,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/279)"
        ],
        "index": 14493,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:10:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ سَعْدِ بْنِ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ اللَّهِ <span class=\"bTxt\">( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّمَا أَقْضِي بَيْنَكُمْ بِالْبَيِّنَاتِ وَ الْأَيْمَانِ وَ بَعْضُكُمْ أَلْحَنُ بِحُجَّتِهِ مِنْ بَعْضٍ فَأَيُّمَا رَجُلٍ قَطَعْتُ لَهُ مِنْ مَالِ أَخِيهِ شَيْئاً فَإِنَّمَا قَطَعْتُ لَهُ بِهِ قِطْعَةً مِنَ النَّارِ .</span>"
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, both together from Ibn Abu Umeyr, from Sa’ad Bin Hisham Bin Al Hakam, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘But rather I<sup>saww</sup> judge among you with the proofs and the oath, and some of you are more mistaken in their arguments than the others. So whichever man I<sup>saww</sup> cut off for him, anything from the wealth of his brother, so rather I<sup>asws</sup> have cut-off for him, by it, a piece from the Fire’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father and Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from all from ibn abu ‘Umayr from Sa‘d ibn Hisham ibn al-Hakam who has narrated the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘I must judge among you on the basis of evidence and oath. Certain ones among you make more mistakes in their argument than others. For whomever I cut off (takes away) from the assets of his brother, I only cut off for him thereby a piece of the fire.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/279)"
        ],
        "index": 14494,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:10:2",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِهِ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ نَبِيّاً مِنَ الْأَنْبِيَاءِ شَكَا إِلَى رَبِّهِ كَيْفَ أَقْضِي فِي أُمُورٍ لَمْ أُخْبَرْ بِبَيَانِهَا قَالَ فَقَالَ لَهُ رُدَّهُمْ إِلَيَّ وَ أَضِفْهُمْ إِلَى اسْمِي يَحْلِفُونَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from one of his companions, from Asim Bin Humey, from Muhammad Bin Qays, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘A Prophet<sup>as</sup> from the Prophets<sup>as</sup> complained to his<sup>as</sup> Lord<sup>azwj</sup>: ‘How can I<sup>as</sup> judge in the matters and I<sup>as</sup> am not informed of its proofs?’ So He<sup>azwj</sup> Said to him<sup>as</sup>: “Refer them to Me<sup>azwj</sup>, and add them to My<sup>azwj</sup> Name to swear by”."
          ],
          "en.sarwar": [
            "2. Ali has narrated from his father from certain persons of his people from ‘Asem ibn Humayd from Muhammad ibn Qays who has narrated the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said that once one of the prophets complained before his Lord saying, ‘How can I judge in matters about which I am not informed how to deal with/ He said, ‘Leave them for Me and add them to My name by which they must swear and take an oath.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/279)"
        ],
        "index": 14495,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:10:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ أَبَانِ بْنِ عُثْمَانَ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي كِتَابِ عَلِيٍّ ( صلوات الله عليه ) أَنَّ نَبِيّاً مِنَ الْأَنْبِيَاءِ شَكَا إِلَى رَبِّهِ الْقَضَاءَ فَقَالَ كَيْفَ أَقْضِي بِمَا لَمْ تَرَ عَيْنِي وَ لَمْ تَسْمَعْ أُذُنِي فَقَالَ اقْضِ بَيْنَهُمْ بِالْبَيِّنَاتِ وَ أَضِفْهُمْ إِلَى اسْمِي يَحْلِفُونَ بِهِ ",
          "وَ قَالَ إِنَّ دَاوُدَ ( عليه السلام ) قَالَ يَا رَبِّ أَرِنِي الْحَقَّ كَمَا هُوَ عِنْدَكَ حَتَّى أَقْضِيَ بِهِ فَقَالَ إِنَّكَ لَا تُطِيقُ ذَلِكَ فَأَلَحَّ عَلَى رَبِّهِ حَتَّى فَعَلَ ",
          "فَجَاءَهُ رَجُلٌ يَسْتَعْدِي عَلَى رَجُلٍ فَقَالَ إِنَّ هَذَا أَخَذَ مَالِي فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى دَاوُدَ ( عليه السلام ) أَنَّ هَذَا الْمُسْتَعْدِيَ قَتَلَ أَبَا هَذَا وَ أَخَذَ مَالَهُ فَأَمَرَ دَاوُدُ ( عليه السلام ) بِالْمُسْتَعْدِي فَقُتِلَ وَ أَخَذَ مَالَهُ فَدَفَعَهُ إِلَى الْمُسْتَعْدَى عَلَيْهِ ",
          "قَالَ فَعَجِبَ النَّاسُ وَ تَحَدَّثُوا حَتَّى بَلَغَ دَاوُدَ ( عليه السلام ) وَ دَخَلَ عَلَيْهِ مِنْ ذَلِكَ مَا كَرِهَ فَدَعَا رَبَّهُ أَنْ يَرْفَعَ ذَلِكَ فَفَعَلَ ثُمَّ أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ أَنِ احْكُمْ بَيْنَهُمْ بِالْبَيِّنَاتِ وَ أَضِفْهُمْ إِلَى اسْمِي يَحْلِفُونَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Aban Bin Usman, from the one who informed him, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘In the book of Ali<sup>asws</sup>, a Prophet<sup>as</sup> from the Prophets<sup>as</sup> complained to his<sup>as</sup> Lord<sup>azwj</sup> about the adjudication. So he<sup>as</sup> said: ‘How can I<sup>as</sup> judge with I<sup>as</sup> did not see with my<sup>as</sup> own eyes, and did not hear with my<sup>as</sup> own ears?’ So He<sup>azwj</sup> Said: “Judge between them by the proofs, and add them to My<sup>azwj</sup> Name to swear by”.",
            "And he<sup>asws</sup> said: ‘Dawood<sup>as</sup> said: ‘O Lord<sup>azwj</sup>! Show me<sup>as</sup> the truth, just as it is with You<sup>azwj</sup>, until I<sup>as</sup> judge by it’. So He<sup>azwj</sup> Said: “You<sup>as</sup> will not be able to tolerate that”. But he<sup>as</sup> kept insisting to his<sup>as</sup> Lord<sup>azwj</sup> until He<sup>azwj</sup> did it. ",
            "So a man came claiming upon a man, and he said, ‘This one took my wealth’. So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto Dawood<sup>as</sup> that this one, the claimant, killed the father of this one and took his wealth”. So Dawood<sup>as</sup> ordered for the claimant to be killed, and he<sup>as</sup> took his wealth and handed it over to the defendant. ",
            "He<sup>asws</sup> said: ‘So the people wondered and they discussed it until (their discussion) reached Dawood<sup>as</sup>, and there entered into him<sup>as</sup> what he<sup>as</sup> disliked. So he<sup>as</sup> supplicated to his<sup>as</sup> Lord<sup>azwj</sup> that He<sup>azwj</sup> should Lift that (from him<sup>as</sup>). So He<sup>azwj</sup> did it. Then Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>as</sup> that “Judge between them by the proofs, and add them to My<sup>azwj</sup> Name to swear by”."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from ibn Faddal ibn Ayyub from Aban ibn ‘Uthman from those who narrated to him who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that it is in the book of Ali, ‘Alayhi al-Salam, that one of the Prophets complained before his Lord about adjudication saying, ‘How can I judge about what my eyes have not seen and my ears have not heard?’ He told him to judge among them by means of evidence and testimony and make them to swear by His name. He (the Imam) then said that Dawud ‘Alayhi al-Salam, once said, ‘O Lord, show me the reality as it is so I can judge accordingly.’ The Lord said, ‘You will not be able to bear it.’ He insisted that the reality be shown to him. A man then came with a complaint against another man for taking his assets. Allah, most Majestic, most Glorious, revealed to Dawud ‘Alayhi al-Salam, that the plaintiff has killed the father of the defendant and has taken his assets. He then issued a judgment that required the plaintiff to be executed and his assets must be given to the defendant. He (the Imam) said, ‘People were confused and they spoke about it until it reached Dawud ‘Alayhi al-Salam. He felt uncomfortable about it so he prayed before the Lord to remove what he had asked for (showing the reality). Allah, most Majestic, most Glorious, then commanded him to judge on the basis of evidence and asking them to swear by His name.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/280)"
        ],
        "index": 14496,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:10:4",
        "text": [
          "وَ عَنْهُ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي كِتَابِ عَلِيٍّ ( عليه السلام ) أَنَّ نَبِيّاً مِنَ الْأَنْبِيَاءِ شَكَا إِلَى رَبِّهِ فَقَالَ يَا رَبِّ كَيْفَ أَقْضِي فِيمَا لَمْ أَشْهَدْ وَ لَمْ أَرَ قَالَ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ أَنِ احْكُمْ بَيْنَهُمْ بِكِتَابِي وَ أَضِفْهُمْ إِلَى اسْمِي فَحَلِّفْهُمْ بِهِ ",
          "وَ قَالَ هَذَا لِمَنْ لَمْ تَقُمْ لَهُ بَيِّنَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Al Nazar Bin Suweyd, from Hisham Bin Salim, from Suleyman, Bin Khalid, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘In the Book of Ali<sup>asws</sup>, a Prophet<sup>as</sup> from the Prophets<sup>as</sup> complained to his<sup>as</sup> Lord<sup>azwj</sup>, so he<sup>as</sup> said: ‘O Lord<sup>azwj</sup>! How can I<sup>as</sup> judge with regards to what I<sup>as</sup> did not witness and did not see?’ So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>as</sup>: “Judge between them by My<sup>azwj</sup> Book, and add them to My<sup>azwj</sup> Name, so get them to swear by it’. ",
            "And he<sup>asws</sup> said: ‘This is for the one for him the proof cannot be established’."
          ],
          "en.sarwar": [
            "4. It is narrated from the narrator of the previous Hadith from al-Nadr ibn Suwayd from Hisham ibn Salim from Sulayman ibn Khalid who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that it is in the book of Ali, ‘Alayhi al-Salam, that one of the Prophets complained before his Lord saying, ‘O Lord, how can I judge among people what I have not witnessed?’ Allah, most Majestic, most Glorious, then sent him revelation that said, ‘Judge among them by means of my book and making them to swear by My name.’ He (the Imam) said, ‘This is in the case of those who cannot establish evidence and testimony.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:6:10",
  "kind": "verse_list"
}