{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 6"
        },
        "path": "/books/al-kafi:7:6",
        "titles": {
          "ar": "كِتَابُ الْقَضَاءِ وَ الْأَحْكَامِ",
          "en": "THE BOOK OF JUDGEMENTS AND THE RULINGS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:7:6:12",
        "titles": {
          "ar": "باب مَنِ ادَّعَى عَلَى مَيِّتٍ",
          "en": "Chapter 12 – The one who claims upon a deceased"
        }
      }
    ],
    "index": 2246,
    "local_index": 12,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:7:6:13",
        "titles": {
          "ar": "باب مَنْ لَمْ تَكُنْ لَهُ بَيِّنَةٌ فَيُرَدُّ عَلَيْهِ الْيَمِينُ",
          "en": "Chapter 13 – The one who does not happen to have a proof for himself, so the (swearing of) the oath is turned upon him"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 11"
        },
        "path": "/books/al-kafi:7:6:11",
        "titles": {
          "ar": "باب أَنَّ الْبَيِّنَةَ عَلَى الْمُدَّعِي وَ الْيَمِينَ عَلَى الْمُدَّعَى عَلَيْهِ",
          "en": "Chapter 11 – The (burden of) the proof is upon the claimant, and (swearing of) the oath is upon the defendant"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 6"
        },
        "path": "/books/al-kafi:7:6",
        "titles": {
          "ar": "كِتَابُ الْقَضَاءِ وَ الْأَحْكَامِ",
          "en": "THE BOOK OF JUDGEMENTS AND THE RULINGS"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:6:12",
    "titles": {
      "ar": "باب مَنِ ادَّعَى عَلَى مَيِّتٍ",
      "en": "Chapter 12 – The one who claims upon a deceased"
    },
    "verse_count": 1,
    "verse_start_index": 14498,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/281)"
        ],
        "index": 14499,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1027",
              "text": "مُحَمَّدِ بْنِ أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/198",
              "text": "مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2522",
              "text": "يَاسِينَ الضَّرِيرِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ حَدَّثَنِي "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5843",
              "text": "عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ يَاسِينَ الضَّرِيرِ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَبْدِ اللَّهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:12:1",
        "text": [
          " قُلْتُ لِلشَّيْخِ ( عليه السلام ) خَبِّرْنِي عَنِ الرَّجُلِ يَدَّعِي قِبَلَ الرَّجُلِ الْحَقَّ فَلَا يَكُونُ لَهُ بَيِّنَةٌ بِمَا لَهُ قَالَ فَيَمِينُ الْمُدَّعَى عَلَيْهِ فَإِنْ حَلَفَ فَلَا حَقَّ لَهُ وَ إِنْ لَمْ يَحْلِفْ فَعَلَيْهِ ",
          "وَ إِنْ كَانَ الْمَطْلُوبُ بِالْحَقِّ قَدْ مَاتَ فَأُقِيمَتْ عَلَيْهِ الْبَيِّنَةُ فَعَلَى الْمُدَّعِي الْيَمِينُ بِاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ لَقَدْ مَاتَ فُلَانٌ وَ إِنَّ حَقَّهُ لَعَلَيْهِ فَإِنْ حَلَفَ وَ إِلَّا فَلَا حَقَّ لَهُ لِأَنَّا لَا نَدْرِي لَعَلَّهُ قَدْ أَوْفَاهُ بِبَيِّنَةٍ لَا نَعْلَمُ مَوْضِعَهَا أَوْ بِغَيْرِ بَيِّنَةٍ قَبْلَ الْمَوْتِ ",
          "فَمِنْ ثَمَّ صَارَتْ عَلَيْهِ الْيَمِينُ مَعَ الْبَيِّنَةِ فَإِنِ ادَّعَى بِلَا بَيِّنَةٍ فَلَا حَقَّ لَهُ لِأَنَّ الْمُدَّعَى عَلَيْهِ لَيْسَ بِحَيٍّ وَ لَوْ كَانَ حَيّاً لَأُلْزِمَ الْيَمِينَ أَوِ الْحَقَّ أَوْ يَرُدُّ الْيَمِينَ عَلَيْهِ فَمِنْ ثَمَّ لَمْ يَثْبُتْ لَهُ الْحَقُّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Muhammad Bin Isa Bin Ubeyd, from Yaseen Al Zareyr, from Abdul Rahman Bin Abu Abdullah who said, ",
            "‘I said to the Sheykh<sup>asws</sup>, ‘Inform me about the man who claims upon a man for the right, but there does not happen to a proof for him with what is for him’. He<sup>asws</sup> said: ‘The defendant would swear an oath. So if he were to swear then there is no right for him (the claimant), and if he does not swear, so it is upon him (to pay).  ",
            "And if the one sought with the right (defendant) had died, so the proof would be established against him, therefore it would be upon the claimant to swear an oath by Allah<sup>azwj</sup>, the One, besides Whom there is no god except for Him<sup>azwj</sup>, that so and so has died and that the right is for him (his right is due on him). So if he were to swear, (fine) or else there is no right for him, because we do not know that perhaps he (the deceased) has fulfilled it (the debt) with the proof which is not known, nor do we know its place, or with other proof before the (occurrence) death. ",
            "Thus, from then the (swearing of) the oath came to be upon him (the claimant), along with the (burden of) the proof. So if he were to claim without proof, so there is no right for him, because the defendant is not alive, and had he been alive, the (swearing of) the oath would be necessitated, or the (payment of the) right, or turning of the (swearing of the) oath upon him (the claimant). Thus, from then, his right is not proved’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ‘Isa ibn ‘Ubayd from Yasin who has said that narrated to him ‘ Abd al-Rahman ibn abu ‘ Abd Allah who has narrated the following: “I once said to the Shaykh, ‘Alayhi al-Salam, to instruct me about the case of a man who claims against another for owing him a certain right but has no testimony to prove it. He (the Imam) said, ‘The defendant then must take an oath; and if he did so then he does not have any right, if he did not take an oath his right is established. If the defendant has died and testimony is established against him, then the plaintiff must take an oath by Allah, besides whom no one deserves to be worshipped, that so and so has died and that his right is on him. If he takes such an oath, otherwise, he has no right; we do not know, perhaps the deceased may have paid him in the presence of witnesses that we do not know their place or without testimony, before his death. For this reason oath is on the plaintiff with testimony, but if he claims without testimony he has no right because the defendant is not living; had he been living he had to take an oath or pay the right or turn the oath on the plaintiff in which case the right would not have been proved against him.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:6:12",
  "kind": "verse_list"
}