{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 6"
        },
        "path": "/books/al-kafi:7:6",
        "titles": {
          "ar": "كِتَابُ الْقَضَاءِ وَ الْأَحْكَامِ",
          "en": "THE BOOK OF JUDGEMENTS AND THE RULINGS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:7:6:13",
        "titles": {
          "ar": "باب مَنْ لَمْ تَكُنْ لَهُ بَيِّنَةٌ فَيُرَدُّ عَلَيْهِ الْيَمِينُ",
          "en": "Chapter 13 – The one who does not happen to have a proof for himself, so the (swearing of) the oath is turned upon him"
        }
      }
    ],
    "index": 2247,
    "local_index": 13,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:7:6:14",
        "titles": {
          "ar": "باب أَنَّ مَنْ كَانَتْ لَهُ بَيِّنَةٌ فَلَا يَمِينَ عَلَيْهِ إِذَا أَقَامَهَا",
          "en": "Chapter 14 – The one who has a proof for himself, so there is no swearing upon him when he establishes it"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:7:6:12",
        "titles": {
          "ar": "باب مَنِ ادَّعَى عَلَى مَيِّتٍ",
          "en": "Chapter 12 – The one who claims upon a deceased"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 6"
        },
        "path": "/books/al-kafi:7:6",
        "titles": {
          "ar": "كِتَابُ الْقَضَاءِ وَ الْأَحْكَامِ",
          "en": "THE BOOK OF JUDGEMENTS AND THE RULINGS"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:6:13",
    "titles": {
      "ar": "باب مَنْ لَمْ تَكُنْ لَهُ بَيِّنَةٌ فَيُرَدُّ عَلَيْهِ الْيَمِينُ",
      "en": "Chapter 13 – The one who does not happen to have a proof for himself, so the (swearing of) the oath is turned upon him"
    },
    "verse_count": 5,
    "verse_start_index": 14499,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/282)"
        ],
        "index": 14500,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:13:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َبُو عَلِيٍّ الْأَشْعَرِيُّ</span> عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنِ الْعَلَاءِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي الرَّجُلِ يَدَّعِي وَ لَا بَيِّنَةَ لَهُ قَالَ يَسْتَحْلِفُهُ فَإِنْ رَدَّ الْيَمِينَ عَلَى صَاحِبِ الْحَقِّ فَلَمْ يَحْلِفْ فَلَا حَقَّ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Al A’ala, from Muhammad Bin Muslim, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) regarding the man who claimed and there was no proof for him. He<sup>asws</sup> said: ‘He (defendant) would have to swear an oath, so if he were to turn the oath upon the owner of the right, and he does not swear, so there is no right for him’."
          ],
          "en.sarwar": [
            "1. Abu Ali al-Ash‘ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan from al-‘Ala’ from Muhammad ibn Muslim who has narrated the following: “This is about the case of a man who brings a complaint against another but does not have testimony. One of the two Imam, (abu Ja‘far or abu ‘Abd Allah), ‘Alayhim al-Salam, has said, ‘He must ask him (defendant) to take an oath; and if he turns the oath on the plaintiff who does not take oath, then he has no right.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/283)"
        ],
        "index": 14501,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:13:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنِ الْقَاسِمِ بْنِ سُلَيْمَانَ عَنْ عُبَيْدِ بْنِ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الرَّجُلِ يُدَّعَى عَلَيْهِ الْحَقُّ وَ لَا بَيِّنَةَ لِلْمُدَّعِي قَالَ يُسْتَحْلَفُ أَوْ يَرُدَّ الْيَمِينَ عَلَى صَاحِبِ الْحَقِّ فَإِنْ لَمْ يَفْعَلْ فَلَا حَقَّ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Al Qasim Bin Suleyman, from Ubeyd Bin Zurara, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the man who is claimed against (defendant), and there is no proof for the claimant. He<sup>asws</sup> said: ‘Either he swears an oath or he turns the oath to be upon the owner of the right. So if he does not do it, so there is no right for him’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from al-Qasim ibn Sulayman from ‘Ubayd ibn Zurarah who has narrated the following: “About the case of a man who brings a complaint against another but does not have testimony, abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘He must ask him (defendant) to take an oath, and if he turns the oath on the plaintiff who does not take the oath, then he has no right.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/283)"
        ],
        "index": 14502,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:13:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَمَّنْ رَوَاهُ قَالَ اسْتِخْرَاجُ الْحُقُوقِ بِأَرْبَعَةِ وُجُوهٍ بِشَهَادَةِ رَجُلَيْنِ عَدْلَيْنِ فَإِنْ لَمْ يَكُنْ رَجُلَيْنِ عَدْلَيْنِ فَرَجُلٌ وَ امْرَأَتَانِ فَإِنْ لَمْ تَكُنِ امْرَأَتَانِ فَرَجُلٌ وَ يَمِينُ الْمُدَّعِي فَإِنْ لَمْ يَكُنْ شَاهِدٌ فَالْيَمِينُ عَلَى الْمُدَّعَى عَلَيْهِ فَإِنْ لَمْ يَحْلِفْ [وَ] رَدَّ الْيَمِينَ عَلَى الْمُدَّعِي فَهُوَ وَاجِبٌ عَلَيْهِ أَنْ يَحْلِفَ وَ يَأْخُذَ حَقَّهُ فَإِنْ أَبَى أَنْ يَحْلِفَ فَلَا شَيْ‏ءَ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from the one who reported it, ",
            "He<sup>asws</sup> said, ‘The extraction of the rights is by four ways – by the testimony of two just men; so if there do not happen to be two just men, so one man and two women. So if there do not happen to be two women, so a man and an oath of the claimant. So if there does not happen to be a witness, so the swearing of the oath is upon the defendant. So if he were not to swear, and return the oath upon the claimant, so it is obligatory upon him that he swears, and takes his right. But if he refuses to swear, so there is nothing for him’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from the one who narrated to him who has narrated the following: “He (the Imam), ‘Alayhi al-Salam, has said, ‘There are four ways to prove a case. One way to prove it is the testimony of two just men, if this is not available, then one man and two women, if this is not available, then it is the testimony of one man and the oath of the plaintiff; if there is no witness then the oath is on the defendant. If the defendant does not take the oath and turns it to plaintiff then it is obligatory on him to take the oath to receive his right, and if he declines, there is nothing for him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/284)"
        ],
        "index": 14503,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:13:4",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبَانٍ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الرَّجُلِ يُدَّعَى عَلَيْهِ الْحَقُّ وَ لَيْسَ لِصَاحِبِ الْحَقِّ بَيِّنَةٌ قَالَ يُسْتَحْلَفُ الْمُدَّعَى عَلَيْهِ فَإِنْ أَبَى أَنْ يَحْلِفَ وَ قَالَ أَنَا أَرُدُّ الْيَمِينَ عَلَيْكَ لِصَاحِبِ الْحَقِّ فَإِنَّ ذَلِكَ وَاجِبٌ عَلَى صَاحِبِ الْحَقِّ أَنْ يَحْلِفَ وَ يَأْخُذَ مَالَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from one of his companions, from Aban, from a man, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the man who is claimed against (defendant) for the right, and there is no proof for the owner of the right. He<sup>asws</sup> said: ‘The defendant would swear an oath. So if he refuses to swear and says, ‘I turn the swearing of the oath upon you’, to the owner of the right, so that would be obligatory upon the owner of the right that he swears, and takes his wealth’."
          ],
          "en.sarwar": [
            "4. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad ibn Sama‘ah, from certain persons of his people from Aban from a man who has narrated the following: “This is about the case of a man who claims to have a right on another man but does not have any testimony. Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘He can ask the defendant to take an oath, but if he declines and asks the plaintiff to take an oath, then it is obligatory on him to take an oath to receive his right.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/284)"
        ],
        "index": 14504,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:13:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ يُرَدُّ الْيَمِينُ عَلَى الْمُدَّعِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The swearing would be turned upon the claimant’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ibn abu ‘ Umayr from Hisham ibn Salim who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the oath can be turned to the plaintiff.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:6:13",
  "kind": "verse_list"
}