{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 6"
        },
        "path": "/books/al-kafi:7:6",
        "titles": {
          "ar": "كِتَابُ الْقَضَاءِ وَ الْأَحْكَامِ",
          "en": "THE BOOK OF JUDGEMENTS AND THE RULINGS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 16"
        },
        "path": "/books/al-kafi:7:6:16",
        "titles": {
          "ar": "باب الرَّجُلَيْنِ يَدَّعِيَانِ فَيُقِيمُ كُلُّ وَاحِدٍ مِنْهُمَا الْبَيِّنَةَ",
          "en": "Chapter 16 – Two men both claiming, so each one of the two establishes the proof"
        }
      }
    ],
    "index": 2250,
    "local_index": 16,
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:6:16",
    "titles": {
      "ar": "باب الرَّجُلَيْنِ يَدَّعِيَانِ فَيُقِيمُ كُلُّ وَاحِدٍ مِنْهُمَا الْبَيِّنَةَ",
      "en": "Chapter 16 – Two men both claiming, so each one of the two establishes the proof"
    },
    "verse_count": 6,
    "verse_start_index": 14509,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/286)"
        ],
        "index": 14510,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:16:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ عَنْ شُعَيْبٍ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَأْتِي الْقَوْمَ فَيَدَّعِي دَاراً فِي أَيْدِيهِمْ وَ يُقِيمُ الَّذِي فِي يَدِهِ الدَّارُ الْبَيِّنَةَ أَنَّهُ وَرِثَهَا عَنْ أَبِيهِ وَ لَا يَدْرِي كَيْفَ كَانَ أَمْرُهَا فَقَالَ أَكْثَرُهُمْ بَيِّنَةً يُسْتَحْلَفُ وَ يُدْفَعُ إِلَيْهِ ",
          "وَ ذَكَرَ أَنَّ عَلِيّاً ( عليه السلام ) أَتَاهُ قَوْمٌ يَخْتَصِمُونَ فِي بَغْلَةٍ فَقَامَتِ الْبَيِّنَةُ لِهَؤُلَاءِ أَنَّهُمْ أَنْتَجُوهَا عَلَى مِذْوَدِهِمْ وَ لَمْ يَبِيعُوا وَ لَمْ يَهَبُوا وَ أَقَامَ هَؤُلَاءِ الْبَيِّنَةَ أَنَّهُمْ أَنْتَجُوهَا عَلَى مِذْوَدِهِمْ لَمْ يَبِيعُوا وَ لَمْ يَهَبُوا فَقَضَى بِهَا لِأَكْثَرِهِمْ بَيِّنَةً وَ اسْتَحْلَفَهُمْ ",
          "قَالَ فَسَأَلْتُهُ حِينَئِذٍ فَقُلْتُ أَ رَأَيْتَ إِنْ كَانَ الَّذِي ادَّعَى الدَّارَ فَقَالَ إِنَّ أَبَا هَذَا الَّذِي هُوَ فِيهَا أَخَذَهَا بِغَيْرِ ثَمَنٍ وَ لَمْ يُقِمِ الَّذِي هُوَ فِيهَا بَيِّنَةً إِلَّا أَنَّهُ وَرِثَهَا عَنْ أَبِيهِ قَالَ إِذَا كَانَ أَمْرُهَا هَكَذَا فَهِيَ لِلَّذِي ادَّعَاهَا وَ أَقَامَ الْبَيِّنَةَ عَلَيْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan, from Shuayb, from Abu Baseer who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man who came to a group of people and claimed for a house which was in their hands, and the one in whose hand was the house established the proof and he had inherited it from his father, and it is not known how was his matter’. So he<sup>asws</sup> said: ‘The one with the most proof would have to swear an oath, and it would be handed over to him’. ",
            "And he<sup>asws</sup> mentioned that they came to Ali<sup>asws</sup> with a group of people disputing regarding a mule. So the proof was established for these ones that they had bred it in their stable, and neither had they sold it nor had they gifted it; and those ones established the proof that they had bred it in their stable, and neither had they sold it nor gifted it. So he<sup>asws</sup> judged by it based upon the one with the most proof, and made them swear an oath’. ",
            "He (the narrator) said, ‘So I asked him<sup>asws</sup> at that time, ‘What is your view that there was one who claimed for the house?’ So he<sup>asws</sup> said: ‘If the father of the one who was (living) in it acquired it without a price and the one who was in it cannot establish (proof) except that he had inherited it from his father?’ He<sup>asws</sup> said: ‘If it was like that, so it is for the one who claims it and establishes the proof for it’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Safwan from Shu’ayb from abu Basir who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who comes to a certain people and claims the house. It is in their possession but he claims to be his house. The one who has the house in his possession presents testimony that he has inherited it from his father but does not know more about it. He (the Imam) said, The party that has the greater degree of testimony is asked to take an oath and it then is given to him.’ He (the Imam) then mentioned that once a certain people came before Ali, ‘Alayhi al-Salam. They had a dispute over a mule. There was testimony that this party had bred it in their barn, which they did not sell, or gift; and the other party presented testimony that they had bred it in their barn and had not sold or gifted. He (the Imam) issued a judgment in favor of the party with a greater degree of testimony and asked him to take an oath. I then asked about the one who claims a house to be his house. He (the Imam) said, Tf the father of the one who lives there had taken it without price and the one living in it did not present testimony but that he has inherited it from his father’, he (the Imam) said, Tf this is the case it then belongs to the one who has claimed it and has presented testimony.’” (In al-Masalik it is said that when testimonies contradict and the asset is in their hand they each receive one-half) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/287)"
        ],
        "index": 14511,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:16:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنِ الْخَشَّابِ عَنْ غِيَاثِ بْنِ كَلُّوبٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ رَجُلَيْنِ اخْتَصَمَا إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فِي دَابَّةٍ فِي أَيْدِيهِمَا وَ أَقَامَ كُلُّ وَاحِدٍ مِنْهُمَا الْبَيِّنَةَ أَنَّهَا نُتِجَتْ عِنْدَهُ فَأَحْلَفَهُمَا عَلِيٌّ ( عليه السلام ) فَحَلَفَ أَحَدُهُمَا وَ أَبَى الْآخَرُ أَنْ يَحْلِفَ فَقَضَى بِهَا لِلْحَالِفِ ",
          "فَقِيلَ لَهُ فَلَوْ لَمْ تَكُنْ فِي يَدِ وَاحِدٍ مِنْهُمَا وَ أَقَامَا الْبَيِّنَةَ قَالَ أُحْلِفُهُمَا فَأَيُّهُمَا حَلَفَ وَ نَكَلَ الْآخَرُ جَعَلْتُهَا لِلْحَالِفِ فَإِنْ حَلَفَا جَمِيعاً جَعَلْتُهَا بَيْنَهُمَا نِصْفَيْنِ قِيلَ فَإِنْ كَانَتْ فِي يَدِ أَحَدِهِمَا وَ أَقَامَا جَمِيعاً الْبَيِّنَةَ قَالَ أَقْضِي بِهَا لِلْحَالِفِ الَّذِي هِيَ فِي يَدِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Al Khashab, from Gayas Bin Kuleyb, from Is’haq Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that two men disputed to Amir Al-Momineen<sup>asws</sup> regarding an animal which was in both their hands, and each one of them established the proof that he had bred it in his presence. So Ali<sup>azwj</sup> made both of them to swear an oath. So one of them swore and the other one refuse to swear. So due to it he<sup>asws</sup> judged for the one who swore the oath.",
            "So it was said to him<sup>asws</sup>, ‘Supposing it was not in the hand of any one of them and they both established the proof?’ He<sup>asws</sup> said: ‘They would both have to swear an oath. So whichever of the two swear, and the other one shirks from it, it would be made to be for the one who swore. So if both of them were to swear, it would be made to be for both of them together, (its price) in two halves’. So if it was in the hands of one of the two and they both establish the proof?’ He<sup>asws</sup> said: ‘I<sup>asws</sup> would judge by it to be for the one who swears in whose hand it is’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Khashshab from Ghiyath ibn Kallub from Ishaq ibn ‘Ammar who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that once two men presented their case before Amir al- Mu’minin, Ali, ‘Alayhi al-Salam, about a stumper in their hand and each presented testimony that it was bred in his facilities. He (the Imam) then asked them to take an oath. One party did not take oath, then he (the Imam) issued a judgment in favor of the one who had taken the oath. It then was asked, ‘What would have happened if it was not in the hand of anyone of them and both presented testimony?’ He (the Imam) said, ‘I would ask them to take an oath. If one party took the oath and the other refused, the one who took the oath wins the case. If both of them took oath I will make it for them half and half.’ It then was asked, ‘What happens if it is in the hand of one of them and they both present testimony?’ He (the Imam) said, ‘I would issue a judgment in favor of the one who has it in his hand and takes an oath.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/288)"
        ],
        "index": 14512,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:16:3",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَبَانٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ عَلِيٌّ ( عليه السلام ) إِذَا أَتَاهُ رَجُلَانِ بِشُهُودٍ عَدْلُهُمْ سَوَاءٌ وَ عَدَدُهُمْ أَقْرَعَ بَيْنَهُمْ عَلَى أَيِّهِمْ تَصِيرُ الْيَمِينُ قَالَ وَ كَانَ يَقُولُ اللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ أَيُّهُمْ كَانَ لَهُ الْحَقُّ فَأَدِّهِ إِلَيْهِ ثُمَّ يَجْعَلُ الْحَقَّ لِلَّذِي تَصِيرُ إِلَيْهِ الْيَمِينُ إِذَا حَلَفَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Al Washa, from Aban, from Abdul Rahman Bin Abu Abdullah, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whenever they came to Ali<sup>asws</sup> with two men with witnesses equal in being just and in number, he<sup>asws</sup> would draw a lot upon whichever the oath would come to be. And he<sup>asws</sup> would be saying: ‘O Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the seven skies! For whomever the right was, so Make it to be for him’. Then he<sup>asws</sup> would make the right to be for the one to whom it (the lot) came to be, when he swore an oath’."
          ],
          "en.sarwar": [
            "3. Al-Husayn Muhammad has narrated from Mu‘alla’ ibn Muhammad from al-Washsha’ from Aban from ‘Abd al-Rahman ibn abu ‘Abd Allah who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ’ Amir al-Mu’minin, Ali, ‘Alayhi al-Salam, whenever two people came before him with just witnesses in equal numbers, would cast a raffle about who must take the oath.’ He (the Imam) said that he (the Imam) would say, ‘O Lord of the seven heavens, whoever is right then make it available for him’ and he would decide in favor of the one whose raffle came out for taking the oath; if he took the oath.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/288)"
        ],
        "index": 14513,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:16:4",
        "text": [
          "عَنْهُ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ دَاوُدَ بْنِ سِرْحَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي شَاهِدَيْنِ شَهِدَا عَلَى أَمْرٍ وَاحِدٍ وَ جَاءَ آخَرَانِ فَشَهِدَا عَلَى غَيْرِ الَّذِي شَهِدَا وَ اخْتَلَفُوا قَالَ يُقْرَعُ بَيْنَهُمْ فَأَيُّهُمْ قُرِعَ عَلَيْهِ الْيَمِينُ فَهُوَ أَوْلَى بِالْقَضَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Moala Bin Muhammad, from Al Washa, from Dawood Bin Sirham, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding two witnesses who testified upon one matter and two others came over, so they testified upon other than which they had testified, and they differed. He<sup>asws</sup> said: ‘Lots would be drawn between them, so whoever the lot comes out to for the swearing of the oath, so he would be the first to be judged for’."
          ],
          "en.sarwar": [
            "4. It is narrated from the narrator of the previous Hadith from Mu‘alla’ ibn Muhammad ibn Muhammad from al-Washsha’ from Dawud ibn Sarhan who has narrated the following: “About the case of two witnesses who testify about one thing and two others testify differently, abu ‘Abd Allah, ‘Alayhi al-Salam, has said that a raffle must be arranged and whoever ’s name comes out to take an oath then judgment must be issued in his favor.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/288)"
        ],
        "index": 14514,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:16:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ أَبِي جَمِيلَةَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ تَمِيمِ بْنِ طَرَفَةَ أَنَّ رَجُلَيْنِ عَرَفَا بَعِيراً فَأَقَامَ كُلُّ وَاحِدٍ مِنْهُمَا بَيِّنَةً فَجَعَلَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) بَيْنَهُمَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Abu Jameela, from Simak Bin Harb, from Tameem Bin Tarafa, ",
            "‘Two men recognised a camel, so each one of the two established the proof. So Amir Al-Momineen<sup>asws</sup> made it to be between both of them (equally)’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from abu Jamilah from Sammak ibn Harb from Tamim ibn Tarafah who has narrated the following: “Once, two men recognized a camel and each one presented testimony. ’ Amir al-Mu’minin, Ali, ‘Alayhi al-Salam, made it half and half for them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/288)"
        ],
        "index": 14515,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:16:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ غِيَاثِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) اخْتَصَمَ إِلَيْهِ رَجُلَانِ فِي دَابَّةٍ وَ كِلَاهُمَا أَقَامَ الْبَيِّنَةَ أَنَّهُ أَنْتَجَهَا فَقَضَى بِهَا لِلَّذِي هِيَ فِي يَدِهِ وَ قَالَ لَوْ لَمْ تَكُنْ فِي يَدِهِ جَعَلْتُهَا بَيْنَهُمَا نِصْفَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Yahya, from Giyas Bin Ibrahim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that Amir Al-Momineen<sup>asws</sup> (judged between) two men disputed to him regarding an animal, and each of the two established the proof that he had bred it. So he<sup>asws</sup> judged by it to be for the one in whose hand it was, and said, ‘And had it not been in his hand, I<sup>asws</sup> would have made it (price) to be between both of them in two halves’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Yahya from Ghiyath ibn Ibrahim who has narrated the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that once two men presented their case before Amir al- Mu’minin, Ali, ‘Alayhi al-Salam, about a stumper and both presented testimony that he has bred it in his facilities. He (the Imam) issued a judgment in favor of the one who had it in his possession saying, ‘Had it not been in his possession I would make it one-half for each one of them.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:6:16",
  "kind": "verse_list"
}