{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 6"}, "path": "/books/al-kafi:7:6", "titles": {"ar": "كِتَابُ الْقَضَاءِ وَ الْأَحْكَامِ", "en": "THE BOOK OF JUDGEMENTS AND THE RULINGS"}}, {"indexed_titles": {"en": "Chapter 18"}, "path": "/books/al-kafi:7:6:18", "titles": {"ar": "باب آخَرُ مِنْهُ", "en": "Chapter 18 – Another chapter from it"}}], "index": 2242, "local_index": 18, "part_type": "Chapter", "path": "/books/al-kafi:7:6:18", "titles": {"ar": "باب آخَرُ مِنْهُ", "en": "Chapter 18 – Another chapter from it"}, "verse_count": 1, "verse_start_index": 14506, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 14507, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:6:18:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ حُمْرَانَ بْنِ أَعْيَنَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ جَارِيَةٍ لَمْ تُدْرِكْ بِنْتِ سَبْعِ سِنِينَ مَعَ رَجُلٍ وَ امْرَأَةٍ ادَّعَى الرَّجُلُ أَنَّهَا مَمْلُوكَةٌ لَهُ وَ ادَّعَتِ الْمَرْأَةُ أَنَّهَا ابْنَتُهَا فَقَالَ قَدْ قَضَى فِي هَذَا عَلِيٌّ ( عليه السلام ) قُلْتُ وَ مَا قَضَى فِي هَذَا عَلِيٌّ ( عليه السلام ) قَالَ كَانَ يَقُولُ النَّاسُ كُلُّهُمْ أَحْرَارٌ إِلَّا مَنْ أَقَرَّ عَلَى نَفْسِهِ بِالرِّقِّ وَ هُوَ مُدْرِكٌ وَ مَنْ أَقَامَ بَيِّنَةً عَلَى مَنِ ادَّعَى مِنْ عَبْدٍ أَوْ أَمَةٍ فَإِنَّهُ يُدْفَعُ إِلَيْهِ يَكُونُ لَهُ رِقّاً قُلْتُ فَمَا تَرَى أَنْتَ قَالَ أَرَى أَنْ أَسْأَلَ الَّذِي ادَّعَى أَنَّهَا مَمْلُوكَةٌ لَهُ عَلَى مَا ادَّعَى ", "فَإِنْ أَحْضَرَ شُهُوداً يَشْهَدُونَ أَنَّهَا مَمْلُوكَةٌ لَهُ لَا يَعْلَمُونَهُ بَاعَ وَ لَا وَهَبَ دَفَعْتُ الْجَارِيَةَ إِلَيْهِ حَتَّى تُقِيمَ الْمَرْأَةُ مَنْ يَشْهَدُ لَهَا أَنَّ الْجَارِيَةَ ابْنَتُهَا حُرَّةٌ مِثْلُهَا فَلْتُدْفَعْ إِلَيْهَا وَ تُخْرَجُ مِنْ يَدِ الرَّجُلِ ", "قُلْتُ فَإِنْ لَمْ يُقِمِ الرَّجُلُ شُهُوداً أَنَّهَا مَمْلُوكَةٌ لَهُ قَالَ تُخْرَجُ مِنْ يَدِهِ فَإِنْ أَقَامَتِ الْمَرْأَةُ الْبَيِّنَةَ عَلَى أَنَّهَا ابْنَتُهَا دُفِعَتْ إِلَيْهَا وَ إِنْ لَمْ يُقِمِ الرَّجُلُ الْبَيِّنَةَ عَلَى مَا ادَّعَاهُ وَ لَمْ تُقِمِ الْمَرْأَةُ الْبَيِّنَةَ عَلَى مَا ادَّعَتْ خُلِّيَ سَبِيلُ الْجَارِيَةِ تَذْهَبُ حَيْثُ شَاءَتْ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, and Ali Bin Ibrahim, form his father, both together from Ibn Mahboub, from Ibn Ra’ib, from Humran Bin Ayn who said, ", "‘I asked Abu Ja’far<sup>asws</sup> about a slave girl who has yet to become aware (attain adulthood), being a girl seven years of age who was with a man and a woman. The man claimed that she was his owned slave girl, and the woman claimed that she was her daughter. So he<sup>asws</sup> said: ‘Ali<sup>asws</sup> had judged with regard to this’. I said, ‘And what did Ali<sup>asws</sup> judge regarding this?’ He<sup>asws</sup> said: ‘He<sup>asws</sup> was saying: ‘All the people are free, except for the one who confesses upon himself with the slavery, and he is an adult, and the one upon whom the proof is established by the one who claims.", "So if witnesses are testifying that she is an owned slave girl of his, and it is not know her being sold or gifted, so I<sup>asws</sup> would hand over the slave girl to him, until the woman establishes one who testifies for her that the slave girl is her daughter, free like her. So she should be handed over to her, and be taken out from the hand of the man’. ", "I said, ‘So if the man does not establish witness that she is an owned slave girls of his?’ He<sup>asws</sup> said: ‘She would be taken out from his hand. So if the woman establishes the proof upon that she is her daughter, she would be handed over to her. And if the man does not establish the proof upon what he claims, and the woman does not establish the proof upon what she claims, the way of the slave girl would be left open. She can go wherever she so desires to’."]}}]}, "index": "al-kafi:7:6:18", "kind": "verse_list"}