{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 6"}, "path": "/books/al-kafi:7:6", "titles": {"ar": "كِتَابُ الْقَضَاءِ وَ الْأَحْكَامِ", "en": "THE BOOK OF JUDGEMENTS AND THE RULINGS"}}, {"indexed_titles": {"en": "Chapter 19"}, "path": "/books/al-kafi:7:6:19", "titles": {"ar": "باب النَّوَادِرِ", "en": "Chapter 19 – The Miscellaneous"}}], "index": 2243, "local_index": 19, "part_type": "Chapter", "path": "/books/al-kafi:7:6:19", "titles": {"ar": "باب النَّوَادِرِ", "en": "Chapter 19 – The Miscellaneous"}, "verse_count": 22, "verse_start_index": 14507, "verses": [{"index": 14508, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:6:19:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ دَاوُدَ ( عليه السلام ) سَأَلَ رَبَّهُ أَنْ يُرِيَهُ قَضِيَّةً مِنْ قَضَايَا الْآخِرَةِ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ يَا دَاوُدُ أَنَّ الَّذِي سَأَلْتَنِي لَمْ أُطْلِعْ عَلَيْهِ أَحَداً مِنْ خَلْقِي وَ لَا يَنْبَغِي لِأَحَدٍ أَنْ يَقْضِيَ بِهِ غَيْرِي\nقَالَ فَلَمْ يَمْنَعْهُ ذَلِكَ أَنْ عَادَ فَسَأَلَ اللَّهَ أَنْ يُرِيَهُ قَضِيَّةً مِنْ قَضَايَا الْآخِرَةِ قَالَ فَأَتَاهُ جَبْرَئِيلُ ( عليه السلام ) فَقَالَ لَهُ يَا دَاوُدُ لَقَدْ سَأَلْتَ رَبَّكَ شَيْئاً لَمْ يَسْأَلْهُ قَبْلَكَ نَبِيٌّ يَا دَاوُدُ إِنَّ الَّذِي سَأَلْتَ لَمْ يُطْلِعْ عَلَيْهِ أَحَداً مِنْ خَلْقِهِ وَ لَا يَنْبَغِي لِأَحَدٍ أَنْ يَقْضِيَ بِهِ غَيْرَهُ قَدْ أَجَابَ اللَّهُ دَعْوَتَكَ وَ أَعْطَاكَ مَا سَأَلْتَ يَا دَاوُدُ إِنَّ أَوَّلَ خَصْمَيْنِ يَرِدَانِ عَلَيْكَ غَداً الْقَضِيَّةُ فِيهِمَا مِنْ قَضَايَا الْآخِرَةِ\nقَالَ فَلَمَّا أَصْبَحَ دَاوُدُ ( عليه السلام ) جَلَسَ فِي مَجْلِسِ الْقَضَاءِ أَتَاهُ شَيْخٌ مُتَعَلِّقٌ بِشَابٍّ وَ مَعَ الشَّابِّ عُنْقُودٌ مِنْ عِنَبٍ فَقَالَ لَهُ الشَّيْخُ يَا نَبِيَّ اللَّهِ إِنَّ هَذَا الشَّابَّ دَخَلَ بُسْتَانِي وَ خَرَّبَ كَرْمِي وَ أَكَلَ مِنْهُ بِغَيْرِ إِذْنِي وَ هَذَا الْعُنْقُودُ أَخَذَهُ بِغَيْرِ إِذْنِي \nفَقَالَ دَاوُدُ لِلشَّابِّ مَا تَقُولُ فَأَقَرَّ الشَّابُّ أَنَّهُ قَدْ فَعَلَ ذَلِكَ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ يَا دَاوُدُ إِنِّي إِنْ كَشَفْتُ لَكَ عَنْ قَضَايَا الْآخِرَةِ فَقَضَيْتَ بِهَا بَيْنَ الشَّيْخِ وَ الْغُلَامِ \nلَمْ يَحْتَمِلْهَا قَلْبُكَ وَ لَمْ يَرْضَ بِهَا قَوْمُكَ يَا دَاوُدُ إِنَّ هَذَا الشَّيْخَ اقْتَحَمَ عَلَى أَبِي هَذَا الْغُلَامِ فِي بُسْتَانِهِ فَقَتَلَهُ وَ غَصَبَ بُسْتَانَهُ وَ أَخَذَ مِنْهُ أَرْبَعِينَ أَلْفَ دِرْهَمٍ فَدَفَنَهَا فِي جَانِبِ بُسْتَانِهِ فَادْفَعْ إِلَى الشَّابِّ سَيْفاً وَ مُرْهُ أَنْ يَضْرِبَ عُنُقَ الشَّيْخِ وَ ادْفَعْ إِلَيْهِ الْبُسْتَانَ وَ مُرْهُ أَنْ يَحْفِرَ فِي مَوْضِعِ كَذَا وَ كَذَا وَ يَأْخُذَ مَالَهُ \nقَالَ فَفَزِعَ مِنْ ذَلِكَ دَاوُدُ ( عليه السلام ) وَ جَمَعَ إِلَيْهِ عُلَمَاءَ أَصْحَابِهِ وَ أَخْبَرَهُمُ الْخَبَرَ وَ أَمْضَى الْقَضِيَّةَ عَلَى مَا أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, and a number of our companions, from Sahl Bin Ziyad, from Ibn Mahboub, from Abu Hamza, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Dawood<sup>as</sup> asked his<sup>as</sup> Lord<sup>azwj</sup> that He<sup>azwj</sup> Show him<sup>as</sup> a Judgement from the Judgements of the Hereafter. So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>as</sup>: “O Dawood<sup>as</sup>! That which you<sup>as</sup> have asked Me<sup>azwj</sup>, no one from My<sup>azwj</sup> creatures has been notified of it, nor is it befitting for anyone that he judges by it, apart from Me<sup>azwj</sup>”.\nHe<sup>asws</sup> said: ‘So that did not prevent him<sup>as</sup> to repeat, so he<sup>as</sup> asked Allah<sup>azwj</sup> that He<sup>azwj</sup> Shows him<sup>as</sup> a Judgement from the Judgements of the Hereafter. So Jibraeel<sup>as</sup> came over to him<sup>as</sup> and said to him<sup>as</sup>: ‘O Dawood<sup>as</sup>! You<sup>as</sup> have asked your<sup>as</sup> Lord<sup>azwj</sup> something which no Prophet<sup>as</sup> before you<sup>as</sup> has asked. O Dawood<sup>as</sup>! That which you asked, none from His<sup>azwj</sup> creatures has been notified with, nor is it befitting for anyone that he<sup>as</sup> judged by it, apart from Him<sup>azwj</sup>. However, Allah<sup>azwj</sup> has Answered your<sup>as</sup> supplication, and has Granted you<sup>as</sup> what you<sup>as</sup> asked for. O Dawood<sup>as</sup>! The first two litigants who would intend to you tomorrow, judge regarding both of them from the Judgements of the Hereafter’. \nHe<sup>asws</sup> said: ‘So when it was the morning, Dawood<sup>as</sup> sat is his<sup>as</sup> judicial council. An old man came over to him concerning a youth, and with him was the youth with a bunch of grapes. So the old man said to him<sup>as</sup>, ‘O Prophet<sup>as</sup> of Allah<sup>azwj</sup>! This youth entered my garden and spoilt my vineyard, and ate from it without my permission. And this is the bunch which he took without my permission’. \nSo Dawood<sup>as</sup> said to the youth: ‘What are you saying?’ So the youth confessed that he had done that. So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>as</sup>: “O Dawood<sup>as</sup>! I<sup>azwj</sup> hereby Uncover for you<sup>as</sup> from the Judgements of the Hereafter. Therefore, judge by it between the old man and the boy. \nYour<sup>as</sup> heart, (however) would not be able to bear it, and your<sup>as</sup> people would not be pleased with it. O Dawood<sup>as</sup>! This old man stormed upon the father of this boy in his garden, so he killed him, and usurped his garden, and seized forty thousand Dirhams from it. So he buried it by the side of his garden. So hand a sword to the youth and order him that he should strike the neck of the old man, and hand over the garden to him, and order him that he should dig in such and such a place and take his wealth”.\nHe<sup>asws</sup> said: ‘So Dawood<sup>as</sup> panicked from that and gathered to himself<sup>as</sup>, his<sup>as</sup> scholars, and his<sup>as</sup> companions, and informed them of the news, and passed the Judgement upon what Allah<sup>azwj</sup> Mighty and Majestic had Revealed unto him<sup>as</sup>’."}]}, {"index": 14509, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:6:19:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُوسَى بْنِ سَعْدَانَ عَنِ الْحُسَيْنِ بْنِ أَبِي الْعَلَاءِ عَنْ إِسْحَاقَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي الرَّجُلِ يُبْضِعُهُ الرَّجُلُ ثَلَاثِينَ دِرْهَماً فِي ثَوْبٍ وَ آخَرُ عِشْرِينَ دِرْهَماً فِي ثَوْبٍ فَبَعَثَ بِالثَّوْبَيْنِ فَلَمْ يَعْرِفْ هَذَا ثَوْبَهُ وَ لَا هَذَا ثَوْبَهُ قَالَ يُبَاعُ الثَّوْبَانِ فَيُعْطَى صَاحِبُ الثَّلَاثِينَ ثَلَاثَةَ أَخْمَاسٍ الثَّمَنِ وَ الْآخَرُ خُمُسَيِ الثَّمَنِ قُلْتُ فَإِنَّ صَاحِبَ الْعِشْرِينَ قَالَ لِصَاحِبِ الثَّلَاثِينَ اخْتَرْ أَيَّهُمَا شِئْتَ قَالَ قَدْ أَنْصَفَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Musa Bin Sa’dan, from Al Husayn Bin Abu Al A’la, from Is’haq, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said regarding the man who merged a thirty Dirham piece of cloth, with another man with twenty Dirhams piece of cloth. So the two parcels were sent, and it was not recognised whether this was his cloth, or this was not his cloth. He<sup>asws</sup> said: ‘So the two pieces of cloth would be sold, so the owner of the thirty would be given three-fifths of the price, and the other one would be given two-fifths of the price’. I said, ‘So if the owner of the twenty said to the owner of the thirty, ‘Choose whichever of the two you so desire to?’ He<sup>asws</sup> said: ‘He has been fair’."}]}, {"index": 14510, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:7:6:19:3", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنِ الْعَبَّاسِ بْنِ مَعْرُوفٍ عَنْ أَبِي شُعَيْبٍ الْمَحَامِلِيِّ الرِّفَاعِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ قَبَّلَ رَجُلًا عَنْ حَفْرِ بِئْرٍ عَشْرَ قَامَاتٍ بِعَشَرَةِ دَرَاهِمَ فَحَفَرَ قَامَةً ثُمَّ عَجَزَ عَنْهَا فَقَالَ لَهُ جُزْءٌ مِنْ خَمْسَةٍ وَ خَمْسِينَ جُزْءاً مِنَ الْعَشَرَةِ دَرَاهِمَ .\nعَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ يَزِيدَ عَنْ أَبِي الْمُعَلَّى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أُتِيَ عُمَرُ بْنُ الْخَطَّابِ بِامْرَأَةٍ قَدْ تَعَلَّقَتْ بِرَجُلٍ مِنَ الْأَنْصَارِ وَ كَانَتْ تَهْوَاهُ وَ لَمْ تَقْدِرْ لَهُ عَلَى حِيلَةٍ فَذَهَبَتْ فَأَخَذَتْ بَيْضَةً فَأَخْرَجَتْ مِنْهَا الصُّفْرَةَ وَ صَبَّتِ الْبَيَاضَ عَلَى ثِيَابِهَا بَيْنَ فَخِذَيْهَا ثُمَّ جَاءَتْ إِلَى عُمَرَ فَقَالَتْ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّ هَذَا الرَّجُلَ أَخَذَنِي فِي مَوْضِعِ كَذَا وَ كَذَا فَفَضَحَنِي \nقَالَ فَهَمَّ عُمَرُ أَنْ يُعَاقِبَ الْأَنْصَارِيَّ فَجَعَلَ الْأَنْصَارِيُّ يَحْلِفُ وَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) جَالِسٌ وَ يَقُولُ يَا أَمِيرَ الْمُؤْمِنِينَ تَثَبَّتْ فِي أَمْرِي فَلَمَّا أَكْثَرَ الْفَتَى قَالَ عُمَرُ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) يَا أَبَا الْحَسَنِ مَا تَرَى فَنَظَرَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِلَى بَيَاضٍ عَلَى ثَوْبِ الْمَرْأَةِ وَ بَيْنَ فَخِذَيْهَا فَاتَّهَمَهَا أَنْ تَكُونَ احْتَالَتْ لِذَلِكَ فَقَالَ ائْتُونِي بِمَاءٍ حَارٍّ قَدْ أُغْلِيَ غَلَيَاناً شَدِيداً فَفَعَلُوا \nفَلَمَّا أُتِيَ بِالْمَاءِ أَمَرَهُمْ فَصَبُّوا عَلَى مَوْضِعِ الْبَيَاضِ فَاشْتَوَى ذَلِكَ الْبَيَاضُ فَأَخَذَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَأَلْقَاهُ فِي فِيهِ فَلَمَّا عَرَفَ طَعْمَهُ أَلْقَاهُ مِنْ فِيهِ ثُمَّ أَقْبَلَ عَلَى الْمَرْأَةِ حَتَّى أَقَرَّتْ بِذَلِكَ وَ دَفَعَ اللَّهُ عَزَّ وَ جَلَّ عَنِ الْأَنْصَارِيِّ عُقُوبَةَ عُمَرَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Al Abbas Bin Marouf, from Abu Shuayb Al Mahamily Al Rafaiy who said, \n‘I asked Abu Abdullah<sup>asws</sup> about a man who accepted a man about digging of a well of a depth of ten statures for ten Dirhams. So he dug up to one stature then was frustrated from it (refused to dig further). So he<sup>asws</sup> said: ‘For him would be one part out of fifty-five parts from ten Dirhams’.<a id=\"_ftnref1542\"></a><sup>[1542]</sup> (See Hadeeth below - <span style=\"font-size: small\">Ch 17 H 22 </span>for calculation)\nAli Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Yazeed, from Abu Al Moala, \nAbu Abdullah<sup>asws</sup> has said: ‘They came to Umar Bin Al-Khattab with a woman who had attached (her heart) to a man from the ‘الْأَنْصَارِيَّ’ (a local man of Medina), and had desired him, but she was not able to have a way to him. So she went (to him) and took and egg and extracted the yolk from it, and applied the albumen upon her clothes in between her thighs. Then she came over to Umar and said, ‘O commander of the faithful! This man has disgraced me in such and such a place, so he shamed (raped) me’. \nSo Umar understood that he should punish the ‘الْأَنْصَارِيَّ’ (a local man of Medina) Helper, so he made the Helper to swear an oath, and Amir Al-Momineen<sup>asws</sup> was seated, and he was saying, ‘O commander of the faithful, prove my matter’. So when the youth frequented it, Umar said to Amir Al-Momineen<sup>asws</sup>, ‘O Abu Al-Hassan<sup>asws</sup>! What is your<sup>asws</sup> view’. So Amir Al-Momineen<sup>asws</sup> looked at the whiteness upon the clothes of the woman and between her thighs, so he<sup>asws</sup> accused her that she was defrauding with that. So he<sup>asws</sup> said: ‘Come to me with hot water which has boiled with intense boiling’. So they did it.\nSo when they came up with the water, he<sup>asws</sup> ordered them, so they splashed it upon the place of the whiteness. So that whiteness solidified. So Amir Al-Momineen<sup>asws</sup> took it and cast it in his<sup>asws</sup> mouth. So when he<sup>asws</sup> recognised its taste, he<sup>asws</sup> threw it out from his<sup>asws</sup> mouth. Then he<sup>asws</sup> faced towards the woman until she confessed with that, and Allah<sup>azwj</sup> Mighty and Majestic Defended the ‘الْأَنْصَارِيَّ’ (local resident of Medina) from the punishment of Umar’."}]}, {"index": 14511, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:7:6:19:4", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِهِ عَنْ مَنْصُورِ بْنِ حَازِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ عَشَرَةٌ كَانُوا جُلُوساً وَ وَسْطَهُمْ كِيسٌ فِيهِ أَلْفُ دِرْهَمٍ فَسَأَلَ بَعْضُهُمْ بَعْضاً أَ لَكُمْ هَذَا الْكِيسُ فَقَالُوا كُلُّهُمْ لَا وَ قَالَ وَاحِدٌ مِنْهُمْ هُوَ لِي فَلِمَنْ هُوَ قَالَ لِلَّذِي ادَّعَاهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from one of his companions, from Mansour Bin Hazim, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said, ‘Ten (people) were seated, and in the middle of them was a bag in which were a thousand Dirhams. So they asked each other, ‘Is this bag yours?’ So all of them said, ‘No’, and one of them said it is for him. So for whom is it?’ He<sup>asws</sup> said: ‘For the one who claimed it’."}]}, {"index": 14512, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:7:6:19:5", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ الْأَحْمَرِ قَالَ حَدَّثَنِي أَبُو عِيسَى يُوسُفُ بْنُ مُحَمَّدٍ قَرَابَةً لِسُوَيْدِ بْنِ سَعِيدٍ الْأَمْرَانِيِّ قَالَ حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَحْمَدَ الْفَارِسِيِّ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ أَبِي لَيْلَى عَنِ الْهَيْثَمِ بْنِ جَمِيلٍ عَنْ زُهَيْرٍ عَنْ أَبِي إِسْحَاقَ السَّبِيعِيِّ عَنْ عَاصِمِ بْنِ حَمْزَةَ السَّلُولِيِّ قَالَ سَمِعْتُ غُلَاماً بِالْمَدِينَةِ وَ هُوَ يَقُولُ يَا أَحْكَمَ الْحَاكِمِينَ احْكُمْ بَيْنِي وَ بَيْنَ أُمِّي فَقَالَ لَهُ عُمَرُ بْنُ الْخَطَّابِ يَا غُلَامُ لِمَ تَدْعُو عَلَى أُمِّكَ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّهَا حَمَلَتْنِي فِي بَطْنِهَا تِسْعَةَ أَشْهُرٍ وَ أَرْضَعَتْنِي حَوْلَيْنِ فَلَمَّا تَرَعْرَعْتُ وَ عَرَفْتُ الْخَيْرَ مِنَ الشَّرِّ وَ يَمِينِي عَنْ شِمَالِي طَرَدَتْنِي وَ انْتَفَتْ مِنِّي وَ زَعَمَتْ أَنَّهَا لَا تَعْرِفُنِي\nفَقَالَ عُمَرُ أَيْنَ تَكُونُ الْوَالِدَةُ قَالَ فِي سَقِيفَةِ بَنِي فُلَانٍ فَقَالَ عُمَرُ عَلَيَّ بِأُمِّ الْغُلَامِ قَالَ فَأَتَوْا بِهَا مَعَ أَرْبَعَةِ إِخْوَةٍ لَهَا وَ أَرْبَعِينَ قَسَامَةً يَشْهَدُونَ لَهَا أَنَّهَا لَا تَعْرِفُ الصَّبِيَّ وَ أَنَّ هَذَا الْغُلَامَ غُلَامٌ مُدَّعٍ ظَلُومٌ غَشُومٌ يُرِيدُ أَنْ يَفْضَحَهَا فِي عَشِيرَتِهَا وَ أَنَّ هَذِهِ جَارِيَةٌ مِنْ قُرَيْشٍ لَمْ تَتَزَوَّجْ قَطُّ وَ أَنَّهَا بِخَاتَمِ رَبِّهَا \nفَقَالَ عُمَرُ يَا غُلَامُ مَا تَقُولُ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ هَذِهِ وَ اللَّهِ أُمِّي حَمَلَتْنِي فِي بَطْنِهَا تِسْعَةَ أَشْهُرٍ وَ أَرْضَعَتْنِي حَوْلَيْنِ فَلَمَّا تَرَعْرَعْتُ وَ عَرَفْتُ الْخَيْرَ مِنَ الشَّرِّ وَ يَمِينِي مِنْ شِمَالِي طَرَدَتْنِي وَ انْتَفَتْ مِنِّي وَ زَعَمَتْ أَنَّهَا لَا تَعْرِفُنِي \nفَقَالَ عُمَرُ يَا هَذِهِ مَا يَقُولُ الْغُلَامُ فَقَالَتْ يَا أَمِيرَ الْمُؤْمِنِينَ وَ الَّذِي احْتَجَبَ بِالنُّورِ فَلَا عَيْنَ تَرَاهُ وَ حَقِّ مُحَمَّدٍ وَ مَا وَلَدَ مَا أَعْرِفُهُ وَ لَا أَدْرِي مِنْ أَيِّ النَّاسِ هُوَ وَ إِنَّهُ غُلَامٌ مُدَّعٍ يُرِيدُ أَنْ يَفْضَحَنِي فِي عَشِيرَتِي وَ إِنِّي جَارِيَةٌ مِنْ قُرَيْشٍ لَمْ أَتَزَوَّجْ قَطُّ وَ إِنِّي بِخَاتَمِ رَبِّي فَقَالَ عُمَرُ أَ لَكِ شُهُودٌ فَقَالَتْ نَعَمْ هَؤُلَاءِ فَتَقَدَّمَ الْأَرْبَعُونَ الْقَسَامَةَ فَشَهِدُوا عِنْدَ عُمَرَ أَنَّ الْغُلَامَ مُدَّعٍ يُرِيدُ أَنْ يَفْضَحَهَا فِي عَشِيرَتِهَا وَ أَنَّ هَذِهِ جَارِيَةٌ مِنْ قُرَيْشٍ لَمْ تَتَزَوَّجْ قَطُّ وَ أَنَّهَا بِخَاتَمِ رَبِّهَا\nفَقَالَ عُمَرُ خُذُوا هَذَا الْغُلَامَ وَ انْطَلِقُوا بِهِ إِلَى السِّجْنِ حَتَّى نَسْأَلَ عَنِ الشُّهُودِ فَإِنْ عُدِّلَتْ شَهَادَتُهُمْ جَلَدْتُهُ حَدَّ الْمُفْتَرِي فَأَخَذُوا الْغُلَامَ يُنْطَلَقُ بِهِ إِلَى السِّجْنِ فَتَلَقَّاهُمْ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي بَعْضِ الطَّرِيقِ فَنَادَى الْغُلَامُ يَا ابْنَ عَمِّ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) إِنَّنِي غُلَامٌ مَظْلُومٌ وَ أَعَادَ عَلَيْهِ الْكَلَامَ الَّذِي كَلَّمَ بِهِ عُمَرَ ثُمَّ قَالَ وَ هَذَا عُمَرُ قَدْ أَمَرَ بِي إِلَى الْحَبْسِ فَقَالَ عَلِيٌّ ( عليه السلام ) رُدُّوهُ إِلَى عُمَرَ\nفَلَمَّا رَدُّوهُ قَالَ لَهُمْ عُمَرُ أَمَرْتُ بِهِ إِلَى السِّجْنِ فَرَدَدْتُمُوهُ إِلَيَّ فَقَالُوا يَا أَمِيرَ الْمُؤْمِنِينَ أَمَرَنَا عَلِيُّ بْنُ أَبِي طَالِبٍ ( عليه السلام ) أَنْ نَرُدَّهُ إِلَيْكَ وَ سَمِعْنَاكَ وَ أَنْتَ تَقُولُ لَا تَعْصُوا لِعَلِيٍّ ( عليه السلام ) أَمْراً\nفَبَيْنَا هُمْ كَذَلِكَ إِذْ أَقْبَلَ عَلِيٌّ ( عليه السلام ) فَقَالَ عَلَيَّ بِأُمِّ الْغُلَامِ فَأَتَوْا بِهَا فَقَالَ عَلِيٌّ ( عليه السلام ) يَا غُلَامُ مَا تَقُولُ فَأَعَادَ الْكَلَامَ فَقَالَ عَلِيٌّ ( عليه السلام ) لِعُمَرَ أَ تَأْذَنُ لِي أَنْ أَقْضِيَ بَيْنَهُمْ فَقَالَ عُمَرُ سُبْحَانَ اللَّهِ وَ كَيْفَ لَا وَ قَدْ سَمِعْتُ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) يَقُولُ أَعْلَمُكُمْ عَلِيُّ بْنُ أَبِي طَالِبٍ\nثُمَّ قَالَ لِلْمَرْأَةِ يَا هَذِهِ أَ لَكِ شُهُودٌ قَالَتْ نَعَمْ فَتَقَدَّمَ الْأَرْبَعُونَ قَسَامَةً فَشَهِدُوا بِالشَّهَادَةِ الْأُولَى فَقَالَ عَلِيٌّ ( عليه السلام ) لَأَقْضِيَنَّ الْيَوْمَ بِقَضِيَّةٍ بَيْنَكُمَا هِيَ مَرْضَاةُ الرَّبِّ مِنْ فَوْقِ عَرْشِهِ عَلَّمَنِيهَا حَبِيبِي رَسُولُ اللَّهِ ( صلى الله عليه وآله )\nثُمَّ قَالَ لَهَا أَ لَكِ وَلِيٌّ قَالَتْ نَعَمْ هَؤُلَاءِ إِخْوَتِي فَقَالَ لِإِخْوَتِهَا أَمْرِي فِيكُمْ وَ فِي أُخْتِكُمْ جَائِزٌ فَقَالُوا نَعَمْ يَا ابْنَ عَمِّ مُحَمَّدٍ ( صلى الله عليه وآله ) أَمْرُكَ فِينَا وَ فِي أُخْتِنَا جَائِزٌ فَقَالَ عَلِيٌّ ( عليه السلام ) أُشْهِدُ اللَّهَ وَ أُشْهِدُ مَنْ حَضَرَ مِنَ الْمُسْلِمِينَ أَنِّي قَدْ زَوَّجْتُ هَذَا الْغُلَامَ مِنْ هَذِهِ الْجَارِيَةِ بِأَرْبَعِمِائَةِ دِرْهَمٍ وَ النَّقْدُ مِنْ مَالِي يَا قَنْبَرُ عَلَيَّ بِالدَّرَاهِمِ فَأَتَاهُ قَنْبَرٌ بِهَا فَصَبَّهَا فِي يَدِ الْغُلَامِ قَالَ خُذْهَا فَصُبَّهَا فِي حَجْرِ امْرَأَتِكَ وَ لَا تَأْتِنَا إِلَّا وَ بِكَ أَثَرُ الْعُرْسِ يَعْنِي الْغُسْلَ\nفَقَامَ الْغُلَامُ فَصَبَّ الدَّرَاهِمَ فِي حَجْرِ الْمَرْأَةِ ثُمَّ تَلَبَّبَهَا فَقَالَ لَهَا قُومِي فَنَادَتِ الْمَرْأَةُ النَّارَ النَّارَ يَا ابْنَ عَمِّ مُحَمَّدٍ تُرِيدُ أَنْ تُزَوِّجَنِي مِنْ وَلَدِي هَذَا وَ اللَّهِ وَلَدِي زَوَّجَنِي إِخْوَتِي هَجِيناً فَوَلَدْتُ مِنْهُ هَذَا الْغُلَامَ فَلَمَّا تَرَعْرَعَ وَ شَبَّ أَمَرُونِي أَنْ أَنْتَفِيَ مِنْهُ وَ أَطْرُدَهُ وَ هَذَا وَ اللَّهِ وَلَدِي وَ فُؤَادِي يَتَقَلَّى أَسَفاً عَلَى وَلَدِي \nقَالَ ثُمَّ أَخَذَتْ بِيَدِ الْغُلَامِ وَ انْطَلَقَتْ وَ نَادَى عُمَرُ وَا عُمَرَاهْ لَوْ لَا عَلِيٌّ لَهَلَكَ عُمَرُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Ibrahim Bin Is’haq Al Ahmar, from Isa Yusuf Bin Muhammad, a relative of Suweyd Bin saeed Al Amrany, from Suweyd Bin saeed, from Abdul Rahman Bin Ahmad Al Farsy, from Muhammad Bin Ibrahim Bin Abu Layli, from Al Haysam Bin Jameel, from zuheyr, from Abu Is’haq Al Sabi’e, from Aasim Bin Hamza Al Saluly who said, \n‘I heard a boy at Al-Medina and he was saying, ‘O Judge of the Judges! Judge between me and my mother!’ So Umar Bin Al-Khattab said to him, ‘O boy! Why are you supplicating against your mother?’ So he said, ‘O commander of the faithful! She bore me in her belly for nine months, and weaned me for two years. So when I grew up and recognised the good from the evil, and my right from my left, she expelled me and negated me and alleged that she did not recognise me’. \nSo Umar said, ‘Where does your mother happen to be?’ He said, ‘In a tent of the clan of so and so’. So Umar said, ‘(Come) to me with the mother of the boy!’ So they came over with her, and with four brothers of hers, and forty (men) swearing on oath testifying for her, that she does not recognise the child, and that the boy is a claimant who is unjust and lewd (immoral), intending to shame her in her clan, and that this is a slave girl who is from Qureysh who had not married at all, and that she is with a seal of her Lord<sup>azwj</sup> (a virgin)’. \nSo Umar said, ‘O boy! What are you saying?’ So he said, ‘O commander of the faithful! By Allah<sup>azwj</sup>! This is my mother who bore me in her belly for nine months, and weaned me for two years. So when I grew up and recognised the good from the evil, and my right from my left, she expelled me and negated me, and she claims that she does not recognise me’. \nSo Umar said, ‘O you (woman)! What is this boy saying?’ So she said, ‘O commander of the faithful! By the One<sup>azwj</sup> Who is Veiled by the Light, so no eye has seen Him<sup>azwj</sup>, and right was Muhammad<sup>saww</sup>, I do not recognise him nor do I know from which people he is, and he is a boy who is a claimant intending to shame me in my clam, and I am a slave girl from Qureysh, not being married at all, and I am with a seal from my Lord<sup>azwj</sup>’. So Umar said, ‘Are there witnesses for you?’ So she said, ‘Yes, they are’. So the forty (men) swearing on oath, so they testified in the presence of Umar that the boy is a claimant intending to shame her in her clan, and there this is a slave girl from Qureysh, not having been married at all, and she is with a seal from her Lord<sup>azwj</sup>’. \nSo Umar said, ‘Seize this boy, and go with him to the prison until we ask about the witnesses. So if their testimonies was just, I will whip him with a legal penalty (<span class=\"iTxt\">Hadd</span>) of the slanderer’. So they seized the boy went with him towards the prison. So they came across Amir Al-Momineen<sup>asws</sup> in one of the roads. So the boy called out, ‘O cousin of Rasool-Allah<sup>saww</sup>! I am an oppressed boy’, and he repeated the speech to him<sup>asws</sup> which he had spoken with to Umar. Then he said, ‘And this Umar has ordered regarding me (to be sent) to the prison’. So Ali<sup>asws</sup> said: ‘Return him to Umar’. \nSo when they returned him, Umar said to them, ‘I ordered with him to the prison, and you have returned him to me?’ So they said, ‘O commander of the faithful! Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> ordered us that the be returned to you, and we heard you, and you were saying, ‘Do not disobey to Ali<sup>asws</sup> in any matter’. \nSo whilst they were in that, Ali<sup>asws</sup> came over. So he<sup>asws</sup> said: ‘(send to) me with the mother of the boy’. So they came over with her. So Ali<sup>asws</sup> said: ‘O boy, what are you saying?’ So he repeated the speech. So Ali<sup>asws</sup> said to Umar: ‘Do you permit me<sup>asws</sup> that I<sup>asws</sup> judge between them?’ So Umar said, ‘Glory be to Allah<sup>azwj</sup>! And how (can it be) no, and I have heard Rasool-Allah<sup>saww</sup> saying: ‘The most knowledgeable of you all is Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>’. \nThen he<sup>asws</sup> said to the woman: ‘O you (woman)! Are there witnesses for you?’ She said, ‘Yes’. So the forty (men) swearing on oath testified with the first testimony. So Ali<sup>asws</sup> said: ‘I<sup>asws</sup> shall judge today with a judgement between you two, being the Pleasure of the Lord<sup>azwj</sup> from above His<sup>azwj</sup> Throne, which my<sup>asws</sup> beloved Rasool-Allah<sup>saww</sup> had taught me<sup>asws</sup>’. \nThen he<sup>asws</sup> said to her: ‘Is there a guardian for you?’ She said, ‘Yes, they are, my brothers’. So he<sup>asws</sup> said to her brothers: ‘My<sup>asws</sup> order regarding you and regarding your sister is allowed?’ So they said, ‘Yes, O cousin of Muhammad<sup>saww</sup>, your<sup>asws</sup> order regarding us and regarding our sister is allowed’. So Ali<sup>asws</sup> said: ‘I<sup>asws</sup> am keeping Allah<sup>azwj</sup> as a Witness, and the ones who are present from the Muslims, that I<sup>asws</sup> hereby marry this boy to this slave girl, with (a dower of) four hundred Dirhams, and the cash is from my<sup>asws</sup> wealth. O Qanbar! To me<sup>asws</sup> with the Dirhams!’ So Qanbar came over with it. So He<sup>asws</sup> placed it in the hands of the boy, and said: ‘Take it, and place it in the lap of your wife, and do not come to us except with you are the effects of the marriage, meaning the washing’.\nSo the boy stood up and placed the Dirhams in the lap of the woman, then addressed her, so he said to her, ‘Stand up’. So the woman called out, ‘The Fire! The Fire! O cousin of Muhammad<sup>saww</sup>, are you<sup>asws</sup> intending to marry me to this son of mine? By Allah<sup>azwj</sup> this is my son. My brothers married me off to a half-caste, so I gave birth to this boy from him. So when he grew up and became a youth, they ordered me that I should deny him and expel him, this, by Allah<sup>azwj</sup>, (he) is my son, and my heart regrets over my son’. \nHe (the narrator) said: ‘Then she grabbed the hand of the boy and went with him, and Umar called out: ‘Woe unto Umar! Had it not been for Ali<sup>asws</sup>, Umar would be destroyed!’"}]}, {"index": 14513, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:7:6:19:6", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أُتِيَ عُمَرُ بِامْرَأَةٍ تَزَوَّجَهَا شَيْخٌ فَلَمَّا أَنْ وَاقَعَهَا مَاتَ عَلَى بَطْنِهَا فَجَاءَتْ بِوَلَدٍ فَادَّعَى بَنُوهُ أَنَّهَا فَجَرَتْ وَ تَشَاهَدُوا عَلَيْهَا فَأَمَرَ بِهَا عُمَرُ أَنْ تُرْجَمَ \nفَمَرَّ بِهَا عَلِيٌّ ( عليه السلام ) فَقَالَتْ يَا ابْنَ عَمِّ رَسُولِ اللَّهِ إِنَّ لِي حُجَّةً قَالَ هَاتِي حُجَّتَكِ فَدَفَعَتْ إِلَيْهِ كِتَاباً فَقَرَأَهُ فَقَالَ هَذِهِ الْمَرْأَةُ تُعْلِمُكُمْ بِيَوْمَ تَزَوَّجَهَا وَ يَوْمَ وَاقَعَهَا وَ كَيْفَ كَانَ جِمَاعُهُ لَهَا رُدُّوا الْمَرْأَةَ \nفَلَمَّا أَنْ كَانَ مِنَ الْغَدِ دَعَا بِصِبْيَانٍ أَتْرَابٍ وَ دَعَا بِالصَّبِيِّ مَعَهُمْ فَقَالَ لَهُمُ الْعَبُوا حَتَّى إِذَا أَلْهَاهُمُ اللَّعِبُ قَالَ لَهُمُ اجْلِسُوا حَتَّى إِذَا تَمَكَّنُوا صَاحَ بِهِمْ فَقَامَ الصِّبْيَانُ وَ قَامَ الْغُلَامُ فَاتَّكَأَ عَلَى رَاحَتَيْهِ فَدَعَا بِهِ عَلِيٌّ ( عليه السلام ) وَ وَرَّثَهُ مِنْ أَبِيهِ وَ جَلَدَ إِخْوَتَهُ الْمُفْتَرِينَ حَدّاً حَدّاً فَقَالَ لَهُ عُمَرُ كَيْفَ صَنَعْتَ قَالَ ( عليه السلام ) عَرَفْتُ ضَعْفَ الشَّيْخِ فِي اتِّكَاءِ الْغُلَامِ عَلَى رَاحَتَيْهِ.", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Ali, from Muhammad Bin Al Fuzayl, from Abu Al Sabbah Al Kinany, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘They came to Umar with a woman who had been married to an old man. So when he had copulated with her, fell dead upon her belly. So she came up with a child, but his sons claimed that she had been immoral and testified against her. So Umar order with her to be stoned.\nSo Ali<sup>asws</sup> passed by her, so she said, ‘O cousin of Rasool-Allah<sup>saww</sup>! There is a proof for me’. He<sup>asws</sup> said: ‘Bring me<sup>asws</sup> your proof’. So she handed over a letter to him<sup>asws</sup>. So he<sup>asws</sup> read it. So he<sup>asws</sup> said: ‘This woman is letting you know of the day she was married, and the day she was copulated with and how her copulation was. Return the woman!’ \nSo when it was the morning, he<sup>asws</sup> called over some children of equal ages, and called the child (of the woman) along with them. So he<sup>asws</sup> said to them: ‘Play’, until the playing was exhausting for them, he<sup>asws</sup> said: ‘Sit down’. When they had taken their places, he<sup>asws</sup> shouted at them. So the children stood up, and the boy (of the woman) leaned upon his hands (in order to stand up). So Ali<sup>asws</sup> called him over and made him inherit him from his father, and whipped his brothers for the false accusation by a legal penalty (<span class=\"iTxt\">Hadd</span>) each. So Umar said to him<sup>asws</sup>, ‘How did you<sup>asws</sup> do this?’ He<sup>asws</sup> said: ‘I<sup>asws</sup> recognised the weakness of the old man in the leaning of the boy upon his hands (when he tried to get up)’."}]}, {"index": 14514, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:7:6:19:7", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ رَجُلًا أَقْبَلَ عَلَى عَهْدِ عَلِيٍّ ( عليه السلام ) مِنَ الْجَبَلِ حَاجّاً وَ مَعَهُ غُلَامٌ لَهُ فَأَذْنَبَ فَضَرَبَهُ مَوْلَاهُ فَقَالَ مَا أَنْتَ مَوْلَايَ بَلْ أَنَا مَوْلَاكَ قَالَ فَمَا زَالَ ذَا يَتَوَعَّدُ ذَا وَ ذَا يَتَوَعَّدُ ذَا وَ يَقُولُ كَمَا أَنْتَ حَتَّى نَأْتِيَ الْكُوفَةَ يَا عَدُوَّ اللَّهِ فَأَذْهَبَ بِكَ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )\nفَلَمَّا أَتَيَا الْكُوفَةَ أَتَيَا أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ الَّذِي ضَرَبَ الْغُلَامَ أَصْلَحَكَ اللَّهُ هَذَا غُلَامٌ لِي وَ إِنَّهُ أَذْنَبَ فَضَرَبْتُهُ فَوَثَبَ عَلَيَّ وَ قَالَ الْآخَرُ هُوَ وَ اللَّهِ غُلَامٌ لِي إِنَّ أَبِي أَرْسَلَنِي مَعَهُ لِيُعَلِّمَنِي وَ إِنَّهُ وَثَبَ عَلَيَّ يَدَّعِينِي لِيَذْهَبَ بِمَالِي\nقَالَ فَأَخَذَ هَذَا يَحْلِفُ وَ هَذَا يَحْلِفُ وَ هَذَا يُكَذِّبُ هَذَا وَ هَذَا يُكَذِّبُ هَذَا قَالَ فَقَالَ انْطَلِقَا فَتَصَادَقَا فِي لَيْلَتِكُمَا هَذِهِ وَ لَا تَجِيئَانِي إِلَّا بِحَقٍّ \nقَالَ فَلَمَّا أَصْبَحَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ لِقَنْبَرٍ اثْقُبْ فِي الْحَائِطِ ثَقْبَيْنِ قَالَ وَ كَانَ إِذَا أَصْبَحَ عَقَّبَ حَتَّى تَصِيرَ الشَّمْسُ عَلَى رُمْحٍ يُسَبِّحُ فَجَاءَ الرَّجُلَانِ وَ اجْتَمَعَ النَّاسُ فَقَالُوا لَقَدْ وَرَدَتْ عَلَيْهِ قَضِيَّةٌ مَا وَرَدَ عَلَيْهِ مِثْلُهَا لَا يَخْرُجُ مِنْهَا فَقَالَ لَهُمَا مَا تَقُولَانِ فَحَلَفَ هَذَا أَنَّ هَذَا عَبْدُهُ وَ حَلَفَ هَذَا أَنَّ هَذَا عَبْدُهُ\nفَقَالَ لَهُمَا قُومَا فَإِنِّي لَسْتُ أَرَاكُمَا تَصْدُقَانِ ثُمَّ قَالَ لِأَحَدِهِمَا أَدْخِلْ رَأْسَكَ فِي هَذَا الثَّقْبِ ثُمَّ قَالَ لِلْآخَرِ أَدْخِلْ رَأْسَكَ فِي هَذَا الثَّقْبِ ثُمَّ قَالَ يَا قَنْبَرُ عَلَيَّ بِسَيْفِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) عَجِّلِ اضْرِبْ رَقَبَةَ الْعَبْدِ مِنْهُمَا قَالَ فَأَخْرَجَ الْغُلَامُ رَأْسَهُ مُبَادِراً فَقَالَ عَلِيٌّ ( عليه السلام ) لِلْغُلَامِ أَ لَسْتَ تَزْعُمُ أَنَّكَ لَسْتَ بِعَبْدٍ وَ مَكَثَ الْآخَرُ فِي الثَّقْبِ فَقَالَ بَلَى وَ لَكِنَّهُ ضَرَبَنِي وَ تَعَدَّى عَلَيَّ قَالَ فَتَوَثَّقَ لَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) وَ دَفَعَهُ إِلَيْهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Abdullah Bin Usman, from a man, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> that a man came down from the mountain for Hajj and with him was a slave of his. So he sinned, so his master struck him. So he said, ‘You are not my master, but I am your master’. So this one did not cease to threaten that one, and that one did not cease to threaten this one, and he was saying, ‘You wait until we come to Al-Kufa, O enemy of Allah<sup>azwj</sup>, so I shall go with you to Amir Al-Momineen<sup>asws</sup>’. \nSo when they both came to Al-Kufa, they both came to Amir Al-Momineen<sup>asws</sup>. So the one who struck the slave said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! This is a slave of mine, and he sinned, so I struck him, but he leapt upon me’. And the other one said, ‘By Allah<sup>azwj</sup>, he is a slave of mine, My father had sent me with him for him to teach me, and he leapt upon me to claim and go away with my wealth’. \nHe<sup>asws</sup> said: ‘So this one swore an oath, and this one to swear an oath, and this one to belied this one, and this one to belied this one’. So he<sup>asws</sup> said: ‘Go away both of you, so be truthful in this night of your, and do not come to me except with the truth’. \nHe<sup>asws</sup> said: ‘So when it was the morning, Amir Al-Momineen<sup>asws</sup> said to Qanbar: ‘Pierce two holes in the wall’. So when it was morning he<sup>asws</sup> Prayed and Glorified until the sun came out to (the length of a) spear. So the two men came over, and the people gathered, saying, ‘A judgement has been referred to him<sup>asws</sup> the like of which has not been referred to (before). He<sup>asws</sup> would not be able to come out from it’. So he<sup>asws</sup> said to both of them: ‘What are you both saying?’ So this one swore on oath that this one was his slave, and this one swore that this one was his slave.\nSo he<sup>asws</sup> said to both of them: ‘Arise, both of you, for I do not see both of you speaking the truth’. Then he<sup>asws</sup> said to one of the two: ‘Enter your head in the hole (in the wall)’. Then he<sup>asws</sup> said to the other one: ‘Enter your head in this hole (in the wall)’. Then he<sup>asws</sup> said: ‘O Qanbar! (Bring) to me<sup>asws</sup> the sword of Rasool-Allah<sup>saww</sup> quickly, I<sup>asws</sup> want to strike off the neck of the slave from these two’. So the slave brought out his head first. So Ali<sup>asws</sup> said to the slave: ‘Are you not alleging that you are not a slave?’ And the other one remained in the hole. So he said, ‘Yes, but he struck me and exceeded upon me’. So Amir Al-Momineen<sup>asws</sup> authenticated (a document) for him and handed it over to him (the master)’."}]}, {"index": 14515, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:7:6:19:8", "text": "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أُتِيَ عُمَرُ بْنُ الْخَطَّابِ بِجَارِيَةٍ قَدْ شَهِدُوا عَلَيْهَا أَنَّهَا بَغَتْ وَ كَانَ مِنْ قِصَّتِهَا أَنَّهَا كَانَتْ يَتِيمَةً عِنْدَ رَجُلٍ وَ كَانَ الرَّجُلُ كَثِيراً مَا يَغِيبُ عَنْ أَهْلِهِ فَشَبَّتِ الْيَتِيمَةُ فَتَخَوَّفَتِ الْمَرْأَةُ أَنْ يَتَزَوَّجَهَا زَوْجُهَا فَدَعَتْ بِنِسْوَةٍ حَتَّى أَمْسَكْنَهَا فَأَخَذَتْ عُذْرَتَهَا بِإِصْبَعِهَا فَلَمَّا قَدِمَ زَوْجُهَا مِنْ غَيْبَتِهِ رَمَتِ الْمَرْأَةُ الْيَتِيمَةَ بِالْفَاحِشَةِ وَ أَقَامَتِ الْبَيِّنَةَ مِنْ جَارَاتِهَا اللَّائِي سَاعَدَتْهَا عَلَى ذَلِكَ\nفَرُفِعَ ذَلِكَ إِلَى عُمَرَ فَلَمْ يَدْرِ كَيْفَ يَقْضِي فِيهَا ثُمَّ قَالَ لِلرَّجُلِ ائْتِ عَلِيَّ بْنَ أَبِي طَالِبٍ ( عليه السلام ) وَ اذْهَبْ بِنَا إِلَيْهِ فَأَتَوْا عَلِيّاً ( عليه السلام ) وَ قَصُّوا عَلَيْهِ الْقِصَّةَ فَقَالَ لِامْرَأَةِ الرَّجُلِ أَ لَكِ بَيِّنَةٌ أَوْ بُرْهَانٌ قَالَتْ لِي شُهُودٌ هَؤُلَاءِ جَارَاتِي يَشْهَدْنَ عَلَيْهَا بِمَا أَقُولُ فَأَحْضَرَتْهُنَّ\nفَأَخْرَجَ عَلِيُّ بْنُ أَبِي طَالِبٍ ( عليه السلام ) السَّيْفَ مِنْ غِمْدِهِ فَطَرَحَ بَيْنَ يَدَيْهِ وَ أَمَرَ بِكُلِّ وَاحِدَةٍ مِنْهُنَّ فَأُدْخِلَتْ بَيْتاً ثُمَّ دَعَا بِامْرَأَةِ الرَّجُلِ فَأَدَارَهَا بِكُلِّ وَجْهٍ فَأَبَتْ أَنْ تَزُولَ عَنْ قَوْلِهَا فَرَدَّهَا إِلَى الْبَيْتِ الَّذِي كَانَتْ فِيهِ وَ دَعَا إِحْدَى الشُّهُودِ وَ جَثَا عَلَى رُكْبَتَيْهِ ثُمَّ قَالَ تَعْرِفِينِي أَنَا عَلِيُّ بْنُ أَبِي طَالِبٍ وَ هَذَا سَيْفِي وَ قَدْ قَالَتِ امْرَأَةُ الرَّجُلِ مَا قَالَتْ وَ رَجَعَتْ إِلَى الْحَقِّ وَ أَعْطَيْتُهَا الْأَمَانَ وَ إِنْ لَمْ تَصْدُقِينِي لَأَمْلَأَنَّ السَّيْفَ مِنْكِ فَالْتَفَتَتْ إِلَى عُمَرَ فَقَالَتْ يَا أَمِيرَ الْمُؤْمِنِينَ الْأَمَانَ عَلَيَّ فَقَالَ لَهَا أَمِيرُ الْمُؤْمِنِينَ فَاصْدُقِي\nفَقَالَتْ لَا وَ اللَّهِ إِلَّا أَنَّهَا رَأَتْ جَمَالًا وَ هَيْئَةً فَخَافَتْ فَسَادَ زَوْجِهَا عَلَيْهَا فَسَقَتْهَا الْمُسْكِرَ وَ دَعَتْنَا فَأَمْسَكْنَاهَا فَافْتَضَّتْهَا بِإِصْبَعِهَا فَقَالَ عَلِيٌّ ( عليه السلام ) اللَّهُ أَكْبَرُ أَنَا أَوَّلُ مَنْ فَرَّقَ بَيْنَ الشَّاهِدَيْنِ إِلَّا دَانِيَالَ النَّبِيَّ \nفَأَلْزَمَ عَلِيٌّ الْمَرْأَةَ حَدَّ الْقَاذِفِ وَ أَلْزَمَهُنَّ جَمِيعاً الْعُقْرَ وَ جَعَلَ عُقْرَهَا أَرْبَعَمِائَةِ دِرْهَمٍ وَ أَمَرَ الْمَرْأَةَ أَنْ تُنْفَى مِنَ الرَّجُلِ وَ يُطَلِّقَهَا زَوْجُهَا وَ زَوَّجَهُ الْجَارِيَةَ وَ سَاقَ عَنْهُ عَلِيٌّ ( عليه السلام ) الْمَهْرَ \nفَقَالَ عُمَرُ يَا أَبَا الْحَسَنِ فَحَدِّثْنَا بِحَدِيثِ دَانِيَالَ فَقَالَ عَلِيٌّ ( عليه السلام ) إِنَّ دَانِيَالَ كَانَ يَتِيماً لَا أُمَّ لَهُ وَ لَا أَبَ وَ إِنَّ امْرَأَةً مِنْ بَنِي إِسْرَائِيلَ عَجُوزاً كَبِيرَةً ضَمَّتْهُ فَرَبَّتْهُ وَ إِنَّ مَلِكاً مِنْ مُلُوكِ بَنِي إِسْرَائِيلَ كَانَ لَهُ قَاضِيَانِ وَ كَانَ لَهُمَا صَدِيقٌ وَ كَانَ رَجُلًا صَالِحاً وَ كَانَتْ لَهُ امْرَأَةٌ بَهِيَّةٌ جَمِيلَةٌ وَ كَانَ يَأْتِي الْمَلِكَ فَيُحَدِّثُهُ\nوَ احْتَاجَ الْمَلِكُ إِلَى رَجُلٍ يَبْعَثُهُ فِي بَعْضِ أُمُورِهِ فَقَالَ لِلْقَاضِيَيْنِ اخْتَارَا رَجُلًا أُرْسِلْهُ فِي بَعْضِ أُمُورِي فَقَالَا فُلَانٌ فَوَجَّهَهُ الْمَلِكُ فَقَالَ الرَّجُلُ لِلْقَاضِيَيْنِ أُوصِيكُمَا بِامْرَأَتِي خَيْراً فَقَالَا نَعَمْ فَخَرَجَ الرَّجُلُ \nفَكَانَ الْقَاضِيَانِ يَأْتِيَانِ بَابَ الصَّدِيقِ فَعَشِقَا امْرَأَتَهُ فَرَاوَدَاهَا عَنْ نَفْسِهَا فَأَبَتْ فَقَالَا لَهَا وَ اللَّهِ لَئِنْ لَمْ تَفْعَلِي لَنَشْهَدَنَّ عَلَيْكِ عِنْدَ الْمَلِكِ بِالزِّنَى ثُمَّ لَنَرْجُمَنَّكِ فَقَالَتِ افْعَلَا مَا أَحْبَبْتُمَا فَأَتَيَا الْمَلِكَ فَأَخْبَرَاهُ وَ شَهِدَا عِنْدَهُ أَنَّهَا بَغَتْ فَدَخَلَ الْمَلِكَ مِنْ ذَلِكَ أَمْرٌ عَظِيمٌ وَ اشْتَدَّ بِهَا غَمُّهُ وَ كَانَ بِهَا مُعْجَباً\nفَقَالَ لَهُمَا إِنَّ قَوْلَكُمَا مَقْبُولٌ وَ لَكِنِ ارْجُمُوهَا بَعْدَ ثَلَاثَةِ أَيَّامٍ وَ نَادَى فِي الْبَلَدِ الَّذِي هُوَ فِيهِ احْضُرُوا قَتْلَ فُلَانَةَ الْعَابِدَةِ فَإِنَّهَا قَدْ بَغَتْ فَإِنَّ الْقَاضِيَيْنِ قَدْ شَهِدَا عَلَيْهَا بِذَلِكَ فَأَكْثَرَ النَّاسُ فِي ذَلِكَ وَ قَالَ الْمَلِكُ لِوَزِيرِهِ مَا عِنْدَكَ فِي هَذَا مِنْ حِيلَةٍ فَقَالَ مَا عِنْدِي فِي ذَلِكَ مِنْ شَيْ‏ءٍ\nفَخَرَجَ الْوَزِيرُ يَوْمَ الثَّالِثِ وَ هُوَ آخِرُ أَيَّامِهَا فَإِذَا هُوَ بِغِلْمَانٍ عُرَاةٍ يَلْعَبُونَ وَ فِيهِمْ دَانِيَالُ وَ هُوَ لَا يَعْرِفُهُ فَقَالَ دَانِيَالُ يَا مَعْشَرَ الصِّبْيَانِ تَعَالَوْا حَتَّى أَكُونَ أَنَا الْمَلِكَ وَ تَكُونَ أَنْتَ يَا فُلَانُ الْعَابِدَةَ وَ يَكُونَ فُلَانٌ وَ فُلَانٌ الْقَاضِيَيْنِ الشَّاهِدَيْنِ عَلَيْهَا ثُمَّ جَمَعَ تُرَاباً وَ جَعَلَ سَيْفاً مِنْ قَصَبٍ وَ قَالَ لِلصِّبْيَانِ خُذُوا بِيَدِ هَذَا فَنَحُّوهُ إِلَى مَكَانِ كَذَا وَ كَذَا وَ خُذُوا بِيَدِ هَذَا فَنَحُّوهُ إِلَى مَكَانِ كَذَا وَ كَذَا\nثُمَّ دَعَا بِأَحَدِهِمَا وَ قَالَ لَهُ قُلْ حَقّاً فَإِنَّكَ إِنْ لَمْ تَقُلْ حَقّاً قَتَلْتُكَ وَ الْوَزِيرُ قَائِمٌ يَنْظُرُ وَ يَسْمَعُ فَقَالَ أَشْهَدُ أَنَّهَا بَغَتْ فَقَالَ مَتَى قَالَ يَوْمَ كَذَا وَ كَذَا فَقَالَ رُدُّوهُ إِلَى مَكَانِهِ وَ هَاتُوا الْآخَرَ فَرَدُّوهُ إِلَى مَكَانِهِ وَ جَاءُوا بِالْآخَرِ فَقَالَ لَهُ بِمَا تَشْهَدُ فَقَالَ أَشْهَدُ أَنَّهَا بَغَتْ قَالَ مَتَى قَالَ يَوْمَ كَذَا وَ كَذَا قَالَ مَعَ مَنْ قَالَ مَعَ فُلَانِ بْنِ فُلَانٍ قَالَ وَ أَيْنَ قَالَ بِمَوْضِعِ كَذَا وَ كَذَا \nفَخَالَفَ أَحَدُهُمَا صَاحِبَهُ فَقَالَ دَانِيَالُ اللَّهُ أَكْبَرُ شَهِدَا بِزُورٍ يَا فُلَانُ نَادِ فِي النَّاسِ أَنَّهُمَا شَهِدَا عَلَى فُلَانَةَ بِزُورٍ فَاحْضُرُوا قَتْلَهُمَا فَذَهَبَ الْوَزِيرُ إِلَى الْمَلِكِ مُبَادِراً فَأَخْبَرَهُ الْخَبَرَ فَبَعَثَ الْمَلِكُ إِلَى الْقَاضِيَيْنِ فَاخْتَلَفَا كَمَا اخْتَلَفَ الْغُلَامَانِ فَنَادَى الْمَلِكُ فِي النَّاسِ وَ أَمَرَ بِقَتْلِهِمَا.", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali, from his father, from Ibn Abu Umeyr, from Muawiya Bin Wahab, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘They came to Umar Bin Al-Khattab with a slave girl who had been testified against that she had committed adultery, and from her story was that she was an orphan (in the custody of) a man, and the man used to be frequently absent from his family. So the orphan girl matured, so the wife (of that man) feared that her husband may marry her. So she called women (friends) until they restrained her. So she took away her virginity by her fingers. So when the husband returned from his absence, the wife accused the orphan girl with the immorality, and established the proof from her neighbours who had aided her upon that. \nSo that was raised to Umar, but he did not know how to judge with regards to it. Then he said to the man, ‘Go to Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, and we will go with you to him<sup>asws</sup>’. So they came over to Ali<sup>asws</sup> and related to him<sup>asws</sup> the story. So he<sup>asws</sup> said to the wife of the man, ‘Is there any proof for you, or evidence?’ She said, ‘There are witnesses for me, these neighbours of mine who are testifying against her with what I am saying, so I am presenting them.  \nSo Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> brought out the sword from its sheath, so he<sup>asws</sup> placed it in front of him, and ordered for each one of them (women witnesses) to enter into a room. Then he called the wife of the man, so he<sup>asws</sup> interrogated her with every aspect, but she refused to waver from her words. So he returned her to the room in which she was, and called for one of the witnesses, and sat upon his<sup>asws</sup> knees. Then he<sup>asws</sup> said: ‘Do you recognise me<sup>asws</sup>? I<sup>asws</sup> am Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, and this is my<sup>asws</sup> sword, and the wife of the man has said what she said, and returned to the truth, and I<sup>asws</sup> gave her amnesty, and if you are not truthful to me, I<sup>asws</sup> will fill the sword from you (your blood)’. So she turned around to Umar and said, ‘O commander of the faithful! The amnesty for me’. So Amir Al-Momineen<sup>asws</sup> said to her: ‘So speak the truth to me<sup>asws</sup>’. \nSo she said, ‘No, by Allah<sup>azwj</sup>, except that she saw the (in the orphan girl) beauty and body, so she feared mischief of her husband upon her, so she gave her an intoxicating drink, and called us over, so we restrained her, and she deflowered her with her fingers’. So Ali<sup>asws</sup> said: ‘Allah<sup>azwj </sup>is the Greatest! I<sup>asws</sup> am the first one to differentiate between two witnesses, except for Dainel<sup>as</sup>, the Prophet<sup>asws</sup>. \nSo Ali<sup>asws</sup> necessitated upon the woman the legal penalty (<span class=\"iTxt\">Hadd</span>) of the slanderer, and necessitated upon all the women together, the dower, and made her dower to be four hundred Dirhams, and ordered the woman that be denied from the man and divorced her, and married the girl to him, and Ali<sup>asws</sup> paid (contributed) the dower from himself<sup>asws</sup>’. \nSo Umar said, ‘O Abu Al Hassan<sup>asws</sup>! So narrate to us with a Hadeeth of Daniel<sup>as</sup>’. So Ali<sup>asws</sup> said: ‘Dainel<sup>as</sup> was an orphan, not having a mother for him<sup>as</sup> nor a father, and a woman from the Children of Israel, very old, cared for him<sup>asws</sup> and loved him<sup>as</sup>. And (there was a) a king from the kings of the Children of Israel who had two judges for him who had a friend who was a righteous man, for whom was a woman with a beautiful body, and he used to come to the king and discuss with him. \nAnd the king had a need from that man, to send him regarding one of his matters. So he said to the two judges, ‘Both of you choose a man to send him in one of my matters’. So they both said, ‘So and so’. So the king diverted himself to him. So the man said to the two judges, ‘I bequeath to both of you with my wife for her safety’. So they both said, ‘Yes’. So the man went out. \nSo the judges used to come to the door of the friend, so they both desired his wife, but she repulsed them both from herself and refused. So they both said to her, ‘By Allah<sup>azwj</sup>! If you were not to do it, we would testify against you in the presence of the king with the adultery, then we would have you stoned’. So she said, ‘So do whatever you both like to’. So they both went over to the king and informed him, and testified in his presence that she is an adulteress. So there entered a grievous matter into the king due to that, and his grief got aggravated by it, and he had also admired her. \nSo he said to them both, ‘Both your words are accepted, but, stone her after three days’. He called out in the city in which he (her husband) was, for (the people) to be present for the killing of so and so woman worshipper, for she had committed adultery, for the two judges has testified against her’. So there were a lot of people with regards to that, and the king said to his Vizier, ‘What is with you with regards to this from an excuse?’ So he said, ‘There is nothing with me regarding that anything’. \nSo the Vizier went out on the third day, and it was the last of her days, and there were (some) little boys playing, and among them was Dainel<sup>as</sup>, and he did not know him<sup>as</sup>. So Daniel<sup>as</sup> said: ‘O group of children! Come, until I<sup>as</sup> become (pretend) I<sup>as</sup> am the king, and you become the so and so worshipper woman, and so and so, and so and so become the two judges testifying against her. Then he<sup>as</sup> gathered dust and made a sword from a stick, and said to the children: ‘Take this (pretend judge) by your hand and go to this such and such a place, and take the hand of this (the other pretend judge) and go to this such and such a place. \nThen he<sup>as</sup> called one of the two and said to him: ‘Speak the truth. If you do not speak the truth, I<sup>as</sup> will kill you’. And the Vizier was standing and listening’. So he (one pretend judge said) said, ‘I testify that she has committed adultery’. So he<sup>as</sup> said: ‘When?’ He said, ‘On such and such a day’. He<sup>as</sup> said: ‘Return him to his place and bring the other one’. So he returned him to his place, and came with the other one. So he<sup>as</sup> said to him: ‘With what do you testify?’ So he said, ‘I testify that she has committed adultery’. He<sup>as</sup> said: ‘When?’ He said, ‘On such and such a day’. He<sup>as</sup> said: ‘With whom?’ He said, ‘With so and so, son of so and so’. He<sup>as</sup> said: ‘And where?’ He said, ‘At such and such a place’. \nSo one of the two contradicted his companions. So Daniel<sup>as</sup> said: ‘Allah<sup>azwj</sup> is the Greatest! A false testimony. O so and so, call out among the people that these two have testified against so and so woman with falsity, therefore present them and kill both of them’. So the Vizier went to the king quickly and informed him of the news. So the king sent for the two judges, and they both differed just as the two boys had differed. So the king called out among the people, and ordered with the killing of them both’."}]}, {"index": 14516, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:7:6:19:9", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ سَمِعْتُ ابْنَ أَبِي لَيْلَى يُحَدِّثُ أَصْحَابَهُ فَقَالَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) بَيْنَ رَجُلَيْنِ اصْطَحَبَا فِي سَفَرٍ فَلَمَّا أَرَادَا الْغَدَاءَ أَخْرَجَ أَحَدَهُمَا مِنْ زَادِهِ خَمْسَةَ أَرْغِفَةٍ وَ أَخْرَجَ الْآخَرُ ثَلَاثَةَ أَرْغِفَةٍ فَمَرَّ بِهِمَا عَابِرُ سَبِيلٍ فَدَعَوَاهُ إِلَى طَعَامِهِمَا فَأَكَلَ الرَّجُلُ مَعَهُمَا حَتَّى لَمْ يَبْقَ شَيْ‏ءٌ فَلَمَّا فَرَغُوا أَعْطَاهُمَا الْعَابِرُ بِهِمَا ثَمَانِيَةَ دَرَاهِمَ ثَوَابَ مَا أَكَلَهُ مِنْ طَعَامِهِمَا فَقَالَ صَاحِبُ الثَّلَاثَةِ أَرْغِفَةٍ لِصَاحِبِ الْخَمْسَةِ أَرْغِفَةٍ اقْسِمْهَا نِصْفَيْنِ بَيْنِي وَ بَيْنَكَ وَ قَالَ صَاحِبُ الْخَمْسَةِ لَا بَلْ يَأْخُذُ كُلُّ وَاحِدٍ مِنَّا مِنَ الدَّرَاهِمِ عَلَى عَدَدِ مَا أَخْرَجَ مِنَ الزَّادِ\nقَالَ فَأَتَيَا أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فِي ذَلِكَ فَلَمَّا سَمِعَ مَقَالَتَهُمَا قَالَ لَهُمَا اصْطَلِحَا فَإِنَّ قَضِيَّتَكُمَا دَنِيَّةٌ فَقَالَا اقْضِ بَيْنَنَا بِالْحَقِّ \nقَالَ فَأَعْطَى صَاحِبَ الْخَمْسَةِ أَرْغِفَةٍ سَبْعَةَ دَرَاهِمَ وَ أَعْطَى صَاحِبَ الثَّلَاثَةِ أَرْغِفَةٍ دِرْهَماً وَ قَالَ أَ لَيْسَ أَخْرَجَ أَحَدُكُمَا مِنْ زَادِهِ خَمْسَةَ أَرْغِفَةٍ وَ أَخْرَجَ الْآخَرُ ثَلَاثَةَ أَرْغِفَةٍ قَالَا نَعَمْ قَالَ أَ لَيْسَ أَكَلَ مَعَكُمَا ضَيْفُكُمَا مِثْلَ مَا أَكَلْتُمَا قَالَا نَعَمْ قَالَ أَ لَيْسَ أَكَلَ كُلُّ وَاحِدٍ مِنْكُمَا ثَلَاثَةَ أَرْغِفَةٍ غَيْرَ ثُلُثِهَا قَالَا نَعَمْ قَالَ أَ لَيْسَ أَكَلْتَ أَنْتَ يَا صَاحِبَ الثَّلَاثَةِ ثَلَاثَةَ أَرْغِفَةٍ إِلَّا ثُلُثاً وَ أَكَلْتَ أَنْتَ يَا صَاحِبَ الْخَمْسَةِ ثَلَاثَةَ أَرْغِفَةٍ غَيْرَ ثُلُثٍ وَ أَكَلَ الضَّيْفُ ثَلَاثَةَ أَرْغِفَةٍ غَيْرَ ثُلُثٍ أَ لَيْسَ بَقِيَ لَكَ يَا صَاحِبَ الثَّلَاثَةِ ثُلُثُ رَغِيفٍ مِنْ زَادِكَ وَ بَقِيَ لَكَ يَا صَاحِبَ الْخَمْسَةِ رَغِيفَانِ وَ ثُلُثٌ وَ أَكَلْتَ ثَلَاثَةَ أَرْغِفَةٍ غَيْرَ ثُلُثٍ \nفَأَعْطَاهُمَا لِكُلِّ ثُلُثِ رَغِيفٍ دِرْهَماً فَأَعْطَى صَاحِبَ الرَّغِيفَيْنِ وَ ثُلُثٍ سَبْعَةَ دَرَاهِمَ وَ أَعْطَى صَاحِبَ ثُلُثِ رَغِيفٍ دِرْهَماً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, and Ali Bin Ibrahim, from his father, both together from Ibn Mahboub, from Abdul Rahman Bin Al Hajjaj who said, \n‘I heard Ibn Abu Layli discussing with his companions, so he said, ‘Amir Al-Momineen<sup>asws</sup> judged between two men who had accompanied each other in a journey. So when they intended breakfast, one of them brought out from his provision, five loaves, and the other one brought out three loaves. So there passed by them a traveller. So they called him over to both their food. So the man was with them both until there did not remain anything (from the loaves). So when they were free, the traveller gave them both eight Dirhams as a reward of what he had eaten from both their food. So the owner of the three loaves said to the owner of the five loaves, ‘Divide it in two halves between me and you’, and the owner of the five (loaves) said, ‘No, but each one of us should take from the Dirhams upon the number of whatever was brought out from the provisions.  \nSo they both came to Amir Al-Momineen<sup>asws</sup> regarding that. So when he<sup>asws</sup> heard both their speeches, said to them both: ‘Settle with each other, for if I<sup>asws</sup> were to judge between the two of you, it would be closer’. So they both said, ‘Judge between us with the truth’. \nHe (the narrator) said, ‘So he<sup>asws</sup> gave the owner of the five loaves seven Dirhams, and gave the owner of the three loaves one Dirham, and said: ‘Did not one of you bring out five loaves from his provisions and the other one brought out three loaves?’ So they both said: ‘Yes’. He<sup>asws</sup> said: ‘Did not a guest eat with you both similar to what you both ate?’ They both said, ‘Yes’. He<sup>asws</sup> said: ‘Did not each one of you two each three loaves less a third of it (two and two-thirds of a loaf each)?’ They both said: ‘Yes’. Is it not that you, owner of the three (loaves) ate three less a third, and you O owner of the five (loaves) three loaves less a third, and the guest ate three loaves less a third. Is it not that there remains for you, O owner of the three (loaves), a third of a loaf from your provision, and there remains for you, O owner of the five (loaves) two loaves and a third, and you ate three loaves less a third?’ \nThus, he<sup>asws</sup> gave them both, for every third of a loaf, one Dirham. So he gave the owner of the two loaves and a third, seven Dirhams, and gave the owner of a third of a loaf, one Dirham’."}]}, {"index": 14517, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:7:6:19:10", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُوسُفَ بْنِ عَقِيلٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي رَجُلٍ أَكَلَ وَ أَصْحَابٌ لَهُ شَاةً فَقَالَ إِنْ أَكَلْتُمُوهَا فَهِيَ لَكُمْ وَ إِنْ لَمْ تَأْكُلُوهَا فَعَلَيْكُمْ كَذَا وَ كَذَا فَقَضَى فِيهِ أَنَّ ذَلِكَ بَاطِلٌ لَا شَيْ‏ءَ فِي الْمُؤَاكَلَةِ مِنَ الطَّعَامِ مَا قَلَّ مِنْهُ وَ مَا كَثُرَ وَ مَنَعَ غَرَامَتَهُ فِيهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Isa, from Yusuf Bin Aqeel, from Muhammad Bin Qays, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> judged regarding a man who ate, and his companion had a sheep. So he said, ‘Eat it all, so it is for you, and if you do not eat it, so upon you would be such and such (an amount to pay). So he<sup>asws</sup> judged with regards to it that, that is invalid. There is nothing in the eating from the good, what is less from it, and what is more, and prevented the fine from him’."}]}, {"index": 14518, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:7:6:19:11", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ عَلِيٍّ الْكَاتِبِ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الثَّقَفِيِّ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي شَيْبَةَ عَنْ حَرِيزٍ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ زَاذَانَ قَالَ اسْتَوْدَعَ رَجُلَانِ امْرَأَةً وَدِيعَةً وَ قَالَا لَهَا لَا تَدْفَعِيهَا إِلَى وَاحِدٍ مِنَّا حَتَّى نَجْتَمِعَ عِنْدَكِ ثُمَّ انْطَلَقَا فَغَابَا فَجَاءَ أَحَدُهُمَا إِلَيْهَا فَقَالَ أَعْطِينِي وَدِيعَتِي فَإِنَّ صَاحِبِي قَدْ مَاتَ فَأَبَتْ حَتَّى كَثُرَ اخْتِلَافُهُ ثُمَّ أَعْطَتْهُ ثُمَّ جَاءَ الْآخَرُ فَقَالَ هَاتِي وَدِيعَتِي فَقَالَتْ أَخَذَهَا صَاحِبُكَ وَ ذَكَرَ أَنَّكَ قَدْ مِتَّ \nفَارْتَفَعَا إِلَى عُمَرَ فَقَالَ لَهَا عُمَرُ مَا أَرَاكِ إِلَّا وَ قَدْ ضَمِنْتِ فَقَالَتِ الْمَرْأَةُ اجْعَلْ عَلِيّاً ( عليه السلام ) بَيْنِي وَ بَيْنَهُ فَقَالَ عُمَرُ اقْضِ بَيْنَهُمَا فَقَالَ عَلِيٌّ ( عليه السلام ) هَذِهِ الْوَدِيعَةُ عِنْدِي وَ قَدْ أَمَرْتُمَاهَا أَنْ لَا تَدْفَعَهَا إِلَى وَاحِدٍ مِنْكُمَا حَتَّى تَجْتَمِعَا عِنْدَهَا فَائْتِنِي بِصَاحِبِكَ فَلَمْ يُضَمِّنْهَا وَ قَالَ ( عليه السلام ) إِنَّمَا أَرَادَا أَنْ يَذْهَبَا بِمَالِ الْمَرْأَةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Ahmad Bin Ali, the scribe, from Ibrahim Bin Muhammad Al Saqafy, from Abdullah Bin Abu Shayba, from Hareyz, from Atiya Bin Al Saib, from Zadan who said, \n‘Two men entrusted a woman with an entrustment and both said to her, ‘Do not hand it over to anyone one from us until we are gathered in your presence’. Then they both left. So they were both absent (for a time), and then one of the two came to her, so he said, ‘Give me my entrustment, for my companions has died’. But she refused, to the extent that their differing were numerous, then she gave it to him. Then the other one came over, so he said, ‘Give me my entrustment’. So she said, ‘You companions has taken it, and mentioned that you had died’. \nSo the matter was raised to Umar. So Umar said to her, ‘I do not see you except as one who is responsible’. So the woman said, ‘I make Ali<sup>asws</sup> between me and him’. So Umar said, ‘Judge between the two’. So Ali<sup>asws</sup> said: ‘This (woman) is the entrustment in my<sup>asws</sup> presence, and you had both instructed her that she should not hand it over to any one of you until you are both gathered in her presence. So come to me<sup>asws</sup> with your companion (the other man who took the money)’. Thus he<sup>asws</sup> did not hold her to be responsible, and Ali<sup>asws</sup> said: ‘But rather, they had both intended to go away with the wealth of the woman’."}]}, {"index": 14519, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:7:6:19:12", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ عِمْرَانَ بْنِ مُوسَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ هِلَالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ أَبِيهِ عُقْبَةَ بْنِ خَالِدٍ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَوْ رَأَيْتَ غَيْلَانَ بْنَ جَامِعٍ وَ اسْتَأْذَنَ عَلَيَّ فَأَذِنْتُ لَهُ وَ قَدْ بَلَغَنِي أَنَّهُ كَانَ يَدْخُلُ إِلَى بَنِي هَاشِمٍ\nفَلَمَّا جَلَسَ قَالَ أَصْلَحَكَ اللَّهُ أَنَا غَيْلَانُ بْنُ جَامِعٍ الْمُحَارِبِيُّ قَاضِي ابْنِ هُبَيْرَةَ قَالَ قُلْتُ يَا غَيْلَانُ مَا أَظُنُّ ابْنَ هُبَيْرَةَ وَضَعَ عَلَى قَضَائِهِ إِلَّا فَقِيهاً قَالَ أَجَلْ قُلْتُ يَا غَيْلَانُ تَجْمَعُ بَيْنَ الْمَرْءِ وَ زَوْجِهِ قَالَ نَعَمْ قُلْتُ وَ تُفَرِّقُ بَيْنَ الْمَرْءِ وَ زَوْجِهِ قَالَ نَعَمْ قُلْتُ وَ تَقْتُلُ قَالَ نَعَمْ قُلْتُ وَ تَضْرِبُ الْحُدُودَ قَالَ نَعَمْ قُلْتُ وَ تَحْكُمُ فِي أَمْوَالِ الْيَتَامَى قَالَ نَعَمْ قُلْتُ وَ بِقَضَاءِ مَنْ تَقْضِي قَالَ بِقَضَاءِ عُمَرَ وَ بِقَضَاءِ ابْنِ مَسْعُودٍ وَ بِقَضَاءِ ابْنِ عَبَّاسٍ وَ أَقْضِي مِنْ قَضَاءِ أَمِيرِ الْمُؤْمِنِينَ بِالشَّيْ‏ءِ \nقَالَ قُلْتُ يَا غَيْلَانُ أَ لَسْتُمْ تَزْعُمُونَ يَا أَهْلَ الْعِرَاقِ وَ تَرْوُونَ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ عَلِيٌّ أَقْضَاكُمْ فَقَالَ نَعَمْ قَالَ قُلْتُ وَ كَيْفَ تَقْضِي مِنْ قَضَاءِ عَلِيٍّ ( عليه السلام ) زَعَمْتَ بِالشَّيْ‏ءِ وَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَالَ عَلِيٌّ أَقْضَاكُمْ قَالَ وَ قُلْتُ كَيْفَ تَقْضِي يَا غَيْلَانُ قَالَ أَكْتُبُ هَذَا مَا قَضَى بِهِ فُلَانُ بْنُ فُلَانٍ لِفُلَانِ بْنِ فُلَانٍ يَوْمَ كَذَا وَ كَذَا مِنْ شَهْرِ كَذَا وَ كَذَا مِنْ سَنَةِ كَذَا ثُمَّ أَطْرَحُهُ فِي الدَّوَاوِينِ\nقَالَ قُلْتُ يَا غَيْلَانُ هَذَا الْحَتْمُ مِنَ الْقَضَاءِ فَكَيْفَ تَقُولُ إِذَا جَمَعَ اللَّهُ الْأَوَّلِينَ وَ الْآخِرِينَ فِي صَعِيدٍ ثُمَّ وَجَدَكَ قَدْ خَالَفْتَ قَضَاءَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ عَلِيٍّ ( عليه السلام ) قَالَ فَأُقْسِمُ بِاللَّهِ لَجَعَلَ يَنْتَحِبُ قُلْتُ أَيُّهَا الرَّجُلُ اقْصِدْ لِسَانَكَ\nقَالَ ثُمَّ قَدِمْتُ الْكُوفَةَ فَمَكَثْتُ مَا شَاءَ اللَّهُ ثُمَّ إِنِّي سَمِعْتُ رَجُلًا مِنَ الْحَيِّ يُحَدِّثُ وَ كَانَ فِي سَمْرِ ابْنِ هُبَيْرَةَ قَالَ وَ اللَّهِ إِنِّي لَعِنْدَهُ لَيْلَةً إِذْ جَاءَهُ الْحَاجِبُ فَقَالَ هَذَا غَيْلَانُ بْنُ جَامِعٍ فَقَالَ أَدْخِلْهُ قَالَ فَدَخَلَ فَسَأَلَهُ ثُمَّ قَالَ لَهُ مَا حَالُ النَّاسِ أَخْبِرْنِي لَوِ اضْطَرَبَ حَبْلٌ مَنْ كَانَ لَهَا قَالَ مَا رَأَيْتُ ثَمَّ أَحَداً إِلَّا جَعْفَرَ بْنَ مُحَمَّدٍ ( عليه السلام )\nقَالَ أَخْبِرْنِي مَا صَنَعْتَ بِالْمَالِ الَّذِي كَانَ مَعَكَ فَإِنَّهُ بَلَغَنِي أَنَّهُ طَلَبَهُ مِنْكَ فَأَبَيْتَ قَالَ قَسَمْتُهُ قَالَ أَ فَلَا أَعْطَيْتَهُ مَا طَلَبَ مِنْكَ قَالَ كَرِهْتُ أَنْ أُخَالِفَكَ قَالَ فَسَأَلْتُكَ بِاللَّهِ أَمَرْتُكَ أَنْ تَجْعَلَهُ أَوَّلَهُمْ قَالَ نَعَمْ قَالَ فَفَعَلْتَ قَالَ لَا قَالَ فَهَلَّا خَالَفْتَنِي وَ أَعْطَيْتَهُ الْمَالَ كَمَا خَالَفْتَنِي فَجَعَلْتَهُ آخِرَهُمْ أَمَا وَ اللَّهِ لَوْ فَعَلْتَ مَا زِلْتَ مِنْهَا سَيِّداً ضَخْماً حَاجَتُكَ قَالَ تُخَلِّينِي قَالَ تَكَلَّمْ بِحَاجَتِكَ قَالَ تُعْفِينِي مِنَ الْقَضَاءِ\nقَالَ فَحَسَرَ عَنْ ذِرَاعَيْهِ ثُمَّ قَالَ أَنَا أَبُو خَالِدٍ لَقِيتُهُ وَ اللَّهِ عِلْباً مُلَفِّقاً نَعَمْ قَدْ أَعْفَيْنَاكَ وَ اسْتَعْمَلْنَا عَلَيْهِ الْحَجَّاجَ بْنَ عَاصِمٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Imran Bin Musa, from Muhammad Bin Al Husayn Bin Al Husayn, from Muhammad Bin Abdullah Bin Hilal, from Ali Bin Uqba, from his father Uqba Bin Khalid who said, \n‘Abu Abdullah<sup>asws</sup> said to me: ‘If you were Gaylan Bin Jamie and he seeks permission to see me<sup>asws</sup>, so give permission to him, and it has reached me<sup>asws</sup> that he used to go over to the Clan of Hashim’. \nSo when he was seated, he said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! I am Gaylan Bin Jamie Al Muharby, a judge of Ibn Hubeyra. He (the narrator) said, ‘I said, ‘O Gaylan! I did not think that Ibn Hubeyra would place upon his judgement, except for a jurist’. He said, ‘Yes’. I said, ‘O Gaylan! Do you bring togetherness between the man and his spouse?’ He said, ‘Yes’. I said, ‘And separation between the man and his spouse?’ He said, ‘Yes’. I said, ‘And you kill?’ He said, ‘Yes’. I said, ‘And you whip the legal penalties (<span class=\"iTxt\">Hadd</span>)?’ He said, ‘Yes’. I said, ‘And you issue orders regarding the wealth of the orphans?’ He said, ‘Yes’. I said, ‘By the judgement of whom do you judge?’ He said, ‘By the judgement of Umar, and by the judgement of Ibn Masoud, and by judgement of Ibn Abbas, and I (also) judge from the judgements of Amir Al-Momineen<sup>asws</sup> with (some) things’. \nHe (the narrator) said, ‘I said, ‘O Gaylan! Are you all not thinking, O people of Iraq, and viewing that Rasool-Allah<sup>saww</sup> said: ‘Ali<sup>asws</sup> is your judge’?’ So he said, ‘Yes’. I said, ‘And how can you judge from the Judgements of Ali<sup>asws</sup> with some things, and Rasool-Allah<sup>saww</sup> has said; ‘Ali<sup>asws</sup> is your judge?’ He (the narrator) said, ‘And I said, ‘How come you are judging, O Gaylan?’ He said, ‘I write this down, whatever I have judged with, ‘So and so, son of so and so, for so and so, son of so and so, on such and such a day, from such a such a month, from such a such a year, then I place it in the registers’. \nHe (the narrator) said, ‘I said, ‘O Gaylan! This is the requirement from the judges, so how would you be saying when Allah<sup>azwj</sup> Gathers the formers ones and the later ones in one plain, then Finds you to have opposed the judgements of Rasool-Allah<sup>saww</sup> and Ali<sup>asws</sup>?’ So he swore by Allah<sup>azwj</sup> and sobbed loudly. I said, ‘O you man, economise with your tongue!\nHe (the narrator) said, ‘Then I proceeded to Al-Kufa. So I remained there for as long as Allah<sup>azwj</sup> so Desired to, then I heard a man from Al-Hayy discussing, and he was a friend of Ibn Hubeyra. He said, ‘BY Allah<sup>azwj</sup>! I was in his Ibn Hubeyra) presence one night when a guard came over, so he said, ‘This is Gaylan Bin Jamie. So he said, ‘Enter him’. He said, ‘So he entered. So he asked him, then said to him, ‘What is the state of the people. Inform me if the rope is turbulent for the one who has it’. He said, ‘I did not see anyone except for Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>’. \nHe said, ‘Inform me, what did you do with the wealth of the one who was with you, for it has reached me that he had sought it from you, but you refused?’ He said, ‘I swore an oath for him’. He said, ‘So you did not give it to him what he sought from you?’ He said, ‘I disliked that I should oppose you’. He said, ‘So I had asked you by Allah<sup>azwj</sup>, ordering you that you should make him to be the first one’. He said, ‘Yes’. He said, ‘So did you do it?’ He said, ‘No’. He said, ‘So is this not opposing me in giving him the wealth, just as you opposed me so you made him to be the last of them? But, by Allah<sup>azwj</sup>, had you done it, your mastership would not have moved away from you due to it, and a great need for you’. He said, ‘Free me’. He said, ‘Speak with your need’. He said, ‘Excuse me from being the judge’. \nHe (the narrator) said, ‘So he rolled up his sleeves, then said, ‘I am Abu Khalid. By Allah<sup>azwj</sup> you have met him as a concocter. Yes, we have excused you, and we have appointed over you, Al-Hajjaj Bin Aasim’."}]}, {"index": 14520, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:7:6:19:13", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ أَبِي عَبْدِ اللَّهِ الْجَامُورَانِيِّ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ عَبْدِ اللَّهِ بْنِ وَضَّاحٍ قَالَ كَانَتْ بَيْنِي وَ بَيْنَ رَجُلٍ مِنَ الْيَهُودِ مُعَامَلَةٌ فَخَانَنِي بِأَلْفِ دِرْهَمٍ فَقَدَّمْتُهُ إِلَى الْوَالِي فَأَحْلَفْتُهُ فَحَلَفَ وَ قَدْ عَلِمْتُ أَنَّهُ حَلَفَ يَمِيناً فَاجِرَةً فَوَقَعَ لَهُ بَعْدَ ذَلِكَ عِنْدِي أَرْبَاحٌ وَ دَرَاهِمُ كَثِيرَةٌ فَأَرَدْتُ أَنْ أَقْتَصَّ الْأَلْفَ دِرْهَمٍ الَّتِي كَانَتْ لِي عِنْدَهُ وَ حَلَفَ عَلَيْهَا \nفَكَتَبْتُ إِلَى أَبِي الْحَسَنِ ( عليه السلام ) وَ أَخْبَرْتُهُ أَنِّي قَدْ أَحْلَفْتُهُ فَحَلَفَ وَ قَدْ وَقَعَ لَهُ عِنْدِي مَالٌ فَإِنْ أَمَرْتَنِي أَنْ آخُذَ مِنْهُ الْأَلْفَ دِرْهَمٍ الَّتِي حَلَفَ عَلَيْهَا فَعَلْتُ فَكَتَبَ ( عليه السلام ) لَا تَأْخُذْ مِنْهُ شَيْئاً إِنْ كَانَ قَدْ ظَلَمَكَ فَلَا تَظْلِمْهُ وَ لَوْ لَا أَنَّكَ رَضِيتَ بِيَمِينِهِ فَحَلَّفْتَهُ لَأَمَرْتُكَ أَنْ تَأْخُذَهَا مِنْ تَحْتِ يَدِكَ وَ لَكِنَّكَ رَضِيتَ بِيَمِينِهِ فَقَدْ مَضَتِ الْيَمِينُ بِمَا فِيهَا فَلَمْ آخُذْ مِنْهُ شَيْئاً وَ انْتَهَيْتُ إِلَى كِتَابِ أَبِي الْحَسَنِ ( عليه السلام ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Abu Abdullah Al Jamourany, from Al Hassan Bin Ali Bin Abu Hamza, from Abdullah Bin Wazzah who said, \n‘There was a deal between me and a man from the Jews, so he betrayed me by a thousand Dirhams. So I brought him to the governor, and he made him swear an oath, and I knew he had sworn a false oath. Then there occurred, after that, profits and many Dirhams. So I intended that I should avenge by a thousand Dirhams which were for me with him, and he had sworn over it. \nSo I wrote to Abu Al-Hassan<sup>asws</sup> and informed him<sup>asws</sup> that I have made him swear an oath, so he had sword, and there had occurred some wealth for him, with me. So If you<sup>asws</sup> were to order me that I should take a thousand Dirhams from it which he had sworn upon, so I would do it’. So he<sup>asws</sup> wrote: ‘Do not take anything from it. If he has been unjust to you, so you do not be unjust to him. And had it not been that you were pleased with him taking the oath, so he took it, I<sup>asws</sup> would have ordered you that you can take it from (what is) under your hand (control), but you were pleased with his oath. Thus the oath has gone with what was in it, therefore do not take anything from it’. And I was prevented by the letter of Abu Al-Hassan<sup>asws</sup>’."}]}, {"index": 14521, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:7:6:19:14", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ بَعْضِ رِجَالِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الْبَيِّنَةِ إِذَا أُقِيمَتْ عَلَى الْحَقِّ أَ يَحِلُّ لِلْقَاضِي أَنْ يَقْضِيَ بِقَوْلِ الْبَيِّنَةِ إِذَا لَمْ يَعْرِفْهُمْ مِنْ غَيْرِ مَسْأَلَةٍ قَالَ فَقَالَ خَمْسَةُ أَشْيَاءَ يَجِبُ عَلَى النَّاسِ أَنْ يَأْخُذُوا بِهَا ظَاهِرَ الْحُكْمِ الْوِلَايَاتُ وَ التَّنَاكُحُ وَ الْمَوَارِيثُ وَ الذَّبَائِحُ وَ الشَّهَادَاتُ فَإِذَا كَانَ ظَاهِرُهُ ظَاهِراً مَأْمُوناً جَازَتْ شَهَادَتُهُ وَ لَا يُسْأَلُ عَنْ بَاطِنِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from one of his men, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the proof when it is established upon the truth, is it permissible for the judges to issue judgements by the proofs when they are not recognising without questioning it?’ So he<sup>asws</sup> said: ‘There are five things which are obligated upon the people that these can be taken by the apparent for the decision – the guardianship, and the marriage, and the inheritors, and the slaughtered animals, and the testimonies. So when its apparent appears to be reliable, his testimony is allowed, and its esoteric (Batin) would not be questioned’."}]}, {"index": 14522, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:7:6:19:15", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَلِيِّ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ عَلِيِّ بْنِ الْحَسَنِ عَنْ حَرِيزٍ عَنْ أَبِي عُبَيْدَةَ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) رَجُلٌ دَفَعَ إِلَى رَجُلٍ أَلْفَ دِرْهَمٍ يَخْلِطُهَا بِمَالِهِ وَ يَتَّجِرُ بِهَا فَلَمَّا طَلَبَهَا مِنْهُ قَالَ ذَهَبَ الْمَالُ وَ كَانَ لِغَيْرِهِ مَعَهُ مِثْلُهَا وَ مَالٌ كَثِيرٌ لِغَيْرِ وَاحِدٍ فَقَالَ لَهُ كَيْفَ صَنَعَ أُولَئِكَ قَالَ أَخَذُوا أَمْوَالَهُمْ نَفَقَاتٍ فَقَالَ أَبُو جَعْفَرٍ وَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) جَمِيعاً يَرْجِعُ إِلَيْهِ بِمَالِهِ وَ يَرْجِعُ هُوَ عَلَى أُولَئِكَ بِمَا أَخَذُوا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ali Bin Ismail, from Muhammad Bin Amro, from Ali Bin Al Hassan, from Hareyz, from Abu Ubeyda who said, \n‘I said to Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup>, ‘A man handed over a thousand Dirhams to a man who mixed it with his own wealth and did some business with it. So when he sought it from him, he said, ‘The wealth is gone, and there was for others (as well) with him, similar to it, and a lot of wealth for someone else’. So he said to him, ‘What did they do?’ So he said, ‘They took their wealth, expenses’. So Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup> both said: ‘He has to return his wealth to him, and he has recourse to those with what they have taken’."}]}, {"index": 14523, "local_index": 16, "part_type": "Hadith", "path": "/books/al-kafi:7:6:19:16", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ يَزِيدَ بْنِ إِسْحَاقَ عَنْ هَارُونَ بْنِ حَمْزَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ اسْتَأْجَرَ أَجِيراً فَلَمْ يَأْمَنْ أَحَدُهُمَا صَاحِبَهُ فَوَضَعَ الْأَجْرَ عَلَى يَدِ رَجُلٍ فَهَلَكَ ذَلِكَ الرَّجُلُ وَ لَمْ يَدَعْ وَفَاءً فَاسْتَهْلَكَ الْأَجْرُ فَقَالَ الْمُسْتَأْجِرُ ضَامِنٌ لِأَجْرِ الْأَجِيرِ حَتَّى يَقْضِيَ إِلَّا أَنْ يَكُونَ الْأَجِيرُ دَعَاهُ إِلَى ذَلِكَ فَرَضِيَ بِالرَّجُلِ فَإِنْ فَعَلَ فَحَقُّهُ حَيْثُ وَضَعَهُ وَ رَضِيَ بِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Yazeed Bin Si’haq, from Haroun Bin Hamza who said, \n‘I asked Abu Abdullah<sup>asws</sup> about a man who employed an employee. But, one of the two does not trust his companion, so the wages were placed upon a (third) man. So that man died, and did not get the wages paid. Thus the wages were destroyed. So he<sup>asws</sup> said: ‘The employer is responsible of the wages to the employee until it is paid, except if it so happened that the employee called for it to be that, so he was pleased with the (third) man (holding it). So if he did it, so his right would be wherever he placed it and was pleased with it’."}]}, {"index": 14524, "local_index": 17, "part_type": "Hadith", "path": "/books/al-kafi:7:6:19:17", "text": "مُحَمَّدُ بْنُ جَعْفَرٍ الْكُوفِيُّ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ جَعْفَرِ بْنِ عِيسَى قَالَ كَتَبْتُ إِلَى أَبِي الْحَسَنِ ( عليه السلام ) جُعِلْتُ فِدَاكَ الْمَرْأَةُ تَمُوتُ فَيَدَّعِي أَبُوهَا أَنَّهُ كَانَ أَعَارَهَا بَعْضَ مَا كَانَ عِنْدَهَا مِنْ مَتَاعٍ وَ خَدَمٍ أَ تُقْبَلُ دَعْوَاهُ بِلَا بَيِّنَةٍ أَمْ لَا تُقْبَلُ دَعْوَاهُ إِلَّا بِبَيِّنَةٍ فَكَتَبَ إِلَيْهِ يَجُوزُ بِلَا بَيِّنَةٍ \nقَالَ وَ كَتَبْتُ إِلَيْهِ إِنِ ادَّعَى زَوْجُ الْمَرْأَةِ الْمَيِّتَةِ أَوْ أَبُو زَوْجِهَا أَوْ أُمُّ زَوْجِهَا فِي مَتَاعِهَا أَوْ [فِي] خَدَمِهَا مِثْلَ الَّذِي ادَّعَى أَبُوهَا مِنْ عَارِيَّةِ بَعْضِ الْمَتَاعِ أَوِ الْخَدَمِ أَ تَكُونُ فِي ذَلِكَ بِمَنْزِلَةِ الْأَبِ فِي الدَّعْوَى فَكَتَبَ ( عليه السلام ) لَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Ja’far Al Kufy, from Muhammad Bin Al Ismail, from Ja’far Bin Isa who said, \n‘I wrote to Abu Al-Hassan<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! The woman dies, so her father claims that he had lent to her what was with her, from the possessions, and a servant. Would his testimony be accepted for his claim without a proof, or his claim would not be acceptable except with the proof?’ So he<sup>asws</sup> wrote to him: ‘It is allowed without proof’. \nHe<sup>asws</sup> said: ‘And I wrote to him<sup>asws</sup> that if a husband of the deceased woman were to claim, or father of her husband, or mother of her husband, with regards to possessions, or regarding a servant, similar to what her father had claimed from having lent some of the possessions, or the servant. Would they be with regards to that, at the status of the father?’ So he<sup>asws</sup> wrote: ‘No’."}]}, {"index": 14525, "local_index": 18, "part_type": "Hadith", "path": "/books/al-kafi:7:6:19:18", "text": "مُحَمَّدُ بْنُ يَحْيَى رَفَعَهُ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) أُتِيَ بِعَبْدٍ لِذِمِّيٍّ قَدْ أَسْلَمَ فَقَالَ اذْهَبُوا فَبِيعُوهُ مِنَ الْمُسْلِمِينَ وَ ادْفَعُوا ثَمَنَهُ إِلَى صَاحِبِهِ وَ لَا تُقِرُّوهُ عِنْدَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, raising it from Hammad Bin Isa, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> that they came to Amir Al-Momineen<sup>asws</sup> with a slave of a <span class=\"iTxt\">Zimmy</span> (under the responsibility) who had become a Muslim. So he said: ‘Go and sell him to the Muslims and hand over his price to his owner, and do not leave him with him’."}]}, {"index": 14526, "local_index": 19, "part_type": "Hadith", "path": "/books/al-kafi:7:6:19:19", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي جَمِيلَةَ عَنْ إِسْمَاعِيلَ بْنِ أَبِي إِدْرِيسَ عَنِ الْحُسَيْنِ بْنِ ضَمْرَةَ بْنِ أَبِي ضَمْرَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَحْكَامُ الْمُسْلِمِينَ عَلَى ثَلَاثَةٍ شَهَادَةٍ عَادِلَةٍ أَوْ يَمِينٍ قَاطِعَةٍ أَوْ سُنَّةٍ مَاضِيَةٍ مِنْ أَئِمَّةِ الْهُدَى .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Ahmad Bin Muhammad Bin Abdullah, from Abu Jameela, from Ismail Bin Abu Idrees, from Al Husayn Bin Zamara Bin Abu Zamara, from his father, from his grandfather who said, \n‘Amir Al-Momineen<sup>asws</sup> said: ‘The rulings of the Muslims are upon three – Just testimony, or a conclusive oath, or a past Sunnah of the Imams<sup>asws</sup> of the Guidance’."}]}, {"index": 14527, "local_index": 20, "part_type": "Hadith", "path": "/books/al-kafi:7:6:19:20", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ دَاوُدَ بْنِ فَرْقَدٍ عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ قَالَ اخْتَصَمَ رَجُلَانِ إِلَى دَاوُدَ ( عليه السلام ) فِي بَقَرَةٍ فَجَاءَ هَذَا بِبَيِّنَةٍ عَلَى أَنَّهَا لَهُ وَ جَاءَ هَذَا بِبَيِّنَةٍ عَلَى أَنَّهَا لَهُ قَالَ فَدَخَلَ دَاوُدُ ( عليه السلام ) الْمِحْرَابَ فَقَالَ يَا رَبِّ إِنَّهُ قَدْ أَعْيَانِي أَنْ أَحْكُمَ بَيْنَ هَذَيْنِ فَكُنْ أَنْتَ الَّذِي تَحْكُمُ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ اخْرُجْ فَخُذِ الْبَقَرَةَ مِنْ الَّذِي فِي يَدِهِ فَادْفَعْهَا إِلَى الْآخَرِ وَ اضْرِبْ عُنُقَهُ \nقَالَ فَضَجَّتْ بَنُو إِسْرَائِيلَ مِنْ ذَلِكَ وَ قَالُوا جَاءَ هَذَا بِبَيِّنَةٍ وَ جَاءَ هَذَا بِبَيِّنَةٍ وَ كَانَ أَحَقُّهُمْ بِإِعْطَائِهَا الَّذِي هِيَ فِي يَدِهِ فَأَخَذَهَا مِنْهُ وَ ضَرَبَ عُنُقَهُ وَ أَعْطَاهَا هَذَا \nقَالَ فَدَخَلَ دَاوُدُ الْمِحْرَابَ فَقَالَ يَا رَبِّ قَدْ ضَجَّتْ بَنُو إِسْرَائِيلَ مِمَّا حَكَمْتَ بِهِ فَأَوْحَى إِلَيْهِ رَبُّهُ أَنَّ الَّذِي كَانَتِ الْبَقَرَةُ فِي يَدِهِ لَقِيَ أَبَا الْآخَرِ فَقَتَلَهُ وَ أَخَذَ الْبَقَرَةَ مِنْهُ فَإِذَا جَاءَكَ مِثْلُ هَذَا فَاحْكُمْ بَيْنَهُمْ بِمَا تَرَى وَ لَا تَسْأَلْنِي أَنْ أَحْكُمَ حَتَّى الْحِسَابِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Dawood Bin Farqad, \n(It has been narrated) from Ismail son of Ja’far<sup>asws</sup> who said, ‘Two men disputed to Dawood<sup>as</sup> regarding a cow. So this one came with a proof upon that it belonged to him, and this one came with a proof that it belonged to him. So Dawood<sup>as</sup> entered into the Prayer niche, so he<sup>as</sup> said :’O Lord<sup>azwj</sup>! It has tired me<sup>as</sup> to judge between these two, so You<sup>azwj</sup> be the One Who Judged’. So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>as</sup>: “Take the cow from the one in whose hand it is and hand it over to the other one, and strike off his neck”.\nHe (the narrator) said: ‘So the Children of Israel made a lot of noise from that, and they said: ‘This one came with the proof, and this one came with the proof, and it would have been more rightful of giving it to the one in whose hand it was, but he took it from him and struck off his neck, and gave it to this one’. \nHe (the narrator) said, ‘So Dawood<sup>as</sup> entered into the Prayer niche, so he<sup>as</sup> said: ‘O Lord<sup>azwj</sup>! The Children of Israel made a lot of noise from what I<sup>as</sup> judged with’. So his<sup>as</sup> Lord<sup>azwj</sup> Revealed unto him: “The one in whose hand was the cow met the father of the other one, so he killed him and seized the cow from him. So (from now on) when they come to you<sup>as</sup> with the likes of this, so judge between them with what you<sup>as</sup> see, and do not ask Me<sup>azwj</sup> that I<sup>azwj</sup> should Judge, until the Reckoning (Day of Judgement)’."}]}, {"index": 14528, "local_index": 21, "part_type": "Hadith", "path": "/books/al-kafi:7:6:19:21", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُعَاوِيَةَ بْنِ حُكَيْمٍ عَنْ أَبِي شُعَيْبٍ الْمَحَامِلِيِّ الرِّفَاعِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ قَبَّلَ رَجُلًا أَنْ يَحْفِرَ لَهُ بِئْراً عَشْرَ قَامَاتٍ بِعَشَرَةِ دَرَاهِمَ فَحَفَرَ لَهُ قَامَةً ثُمَّ عَجَزَ قَالَ يُقْسَمُ عَشَرَةٌ عَلَى خَمْسَةٍ وَ خَمْسِينَ جُزْءاً فَمَا أَصَابَ وَاحِداً فَهُوَ لِلْقَامَةِ الْأُولَى وَ الِاثْنَانِ لِلثَّانِيَةِ وَ الثَّلَاثَةُ لِلثَّالِثَةِ عَلَى هَذَا الْحِسَابِ إِلَى عَشَرَةٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Muawiya Bin Hukeym, from Abu Shuayb Al Mahamily Al Rafaiy who said, \n‘I asked Abu Abdullah<sup>asws</sup> about a man who agreed with a man to dig a well for him ten statures deep for ten Dirhams. So he dug one stature for him, then was frustrated. He<sup>asws</sup> said: ‘The ten (Dirhams) would be divided upon fifty five parts. So whatever he does one so it is for the first stature, and two for the second, and three for the third, upon this accounting up to the ten’. (1+2+3+4+5+6+7+8+9+10 = 55)."}]}, {"index": 14529, "local_index": 22, "part_type": "Hadith", "path": "/books/al-kafi:7:6:19:22", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي رَجُلَيْنِ ادَّعَيَا بَغْلَةً فَأَقَامَ أَحَدُهُمَا عَلَى صَاحِبِهِ شَاهِدَيْنِ وَ الْآخَرُ خَمْسَةً فَقَضَى لِصَاحِبِ الشُّهُودِ الْخَمْسَةِ خَمْسَةَ أَسْهُمٍ وَ لِصَاحِبِ الشَّاهِدَيْنِ سَهْمَيْنِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said regarding two men who claimed a mule. So one of the two established two witnesses over his companion, and the other one, five. So he<sup>asws</sup> judged for the one with the five witnesses, five portions, and for the one with two witnesses, two portions’."}]}, {"part_type": "Heading", "text": "هَذَا آخِرُ كِتَابِ الْقَضَايَا وَ الْأَحْكَامِ مِنْ كِتَابِ الْكَافِي وَ يَتْلُوهُ كِتَابُ الْأَيْمَانِ وَ النُّذُورِ وَ الْكَفَّارَاتِ إِنْ شَاءَ اللَّهُ تَعَالَى", "translations": [{"lang": "en", "name": "hubeali", "text": "This is the end of the Book of the judgement and the ruling from the book Al Kafi, and it would be followed by the book of oaths, and the vows, and the expiations, Allah<sup>azwj</sup> the Exalted Willing."}]}]}, "index": "al-kafi:7:6:19", "kind": "verse_list"}