{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 6"}, "path": "/books/al-kafi:7:6", "titles": {"ar": "كِتَابُ الْقَضَاءِ وَ الْأَحْكَامِ", "en": "THE BOOK OF JUDGEMENTS AND THE RULINGS"}}, {"indexed_titles": {"en": "Chapter 4"}, "path": "/books/al-kafi:7:6:4", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب أَنَّ الْمُفْتِيَ</span> ضَامِنٌ", "en": "Chapter 4 – The Mufti (Fatwa issuer) is responsible"}}], "index": 2228, "local_index": 4, "part_type": "Chapter", "path": "/books/al-kafi:7:6:4", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب أَنَّ الْمُفْتِيَ</span> ضَامِنٌ", "en": "Chapter 4 – The Mufti (Fatwa issuer) is responsible"}, "verse_count": 2, "verse_start_index": 14462, "verses": [{"index": 14463, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:6:4:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ كَانَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَاعِداً فِي حَلْقَةِ رَبِيعَةِ الرَّأْيِ فَجَاءَ أَعْرَابِيٌّ فَسَأَلَ رَبِيعَةَ الرَّأْيِ عَنْ مَسْأَلَةٍ فَأَجَابَهُ فَلَمَّا سَكَتَ قَالَ لَهُ الْأَعْرَابِيُّ أَ هُوَ فِي عُنُقِكَ فَسَكَتَ عَنْهُ رَبِيعَةُ وَ لَمْ يَرُدَّ عَلَيْهِ شَيْئاً فَأَعَادَ عَلَيْهِ الْمَسْأَلَةَ فَأَجَابَهُ بِمِثْلِ ذَلِكَ فَقَالَ لَهُ الْأَعْرَابِيُّ أَ هُوَ فِي عُنُقِكَ فَسَكَتَ رَبِيعَةُ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) هُوَ فِي عُنُقِهِ قَالَ أَوْ لَمْ يَقُلْ وَ كُلُّ مُفْتٍ ضَامِنٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajjaj who said, \n‘Abu Abdullah<sup>asws</sup> was seated in a circle of Rabi’e Al-Raie, so a Bedouin came over. So he asked Rabi’e Al-Raie a question. So he answered him. So when he was silent, the Bedouin said to him, ‘It is upon your neck’. So Rabi’e was silent from it and did not respond anything over it. So he repeated the question to him. So he answered with similar to that (previously). So the Bedouin said to him, ‘Is it upon your neck?’ So Rabi’e was silent. So Abu Abdullah<sup>asws</sup> said to him: ‘It is upon his neck, or he should not be saying it; and every Mufti (Fatwa issuer) is responsible’."}]}, {"index": 14464, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:6:4:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ أَبِي عُبَيْدَةَ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) مَنْ أَفْتَى النَّاسَ بِغَيْرِ عِلْمٍ وَ لَا هُدًى مِنَ اللَّهِ لَعَنَتْهُ مَلَائِكَةُ الرَّحْمَةِ وَ مَلَائِكَةُ الْعَذَابِ وَ لَحِقَهُ وِزْرُ مَنْ عَمِلَ بِفُتْيَاهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Ibn Raib, from Abu Ubeyda who said, \n‘Abu Ja’far<sup>asws</sup> said: ‘The one who issues Fatwas to the people without knowledge, and without Guidance from Allah<sup>azwj</sup>, the Angels of the Mercy, and the Angels of the Punishment curse him, and attach the burden to him of the ones who acted by his Fatwa’."}]}]}, "index": "al-kafi:7:6:4", "kind": "verse_list"}