{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 6"
        },
        "path": "/books/al-kafi:7:6",
        "titles": {
          "ar": "كِتَابُ الْقَضَاءِ وَ الْأَحْكَامِ",
          "en": "THE BOOK OF JUDGEMENTS AND THE RULINGS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 7"
        },
        "path": "/books/al-kafi:7:6:7",
        "titles": {
          "ar": "باب كَرَاهِيَةِ الْجُلُوسِ إِلَى قُضَاةِ الْجَوْرِ",
          "en": "Chapter 7 – Abhorrence of sitting by the inequitable judges"
        }
      }
    ],
    "index": 2241,
    "local_index": 7,
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:6:7",
    "titles": {
      "ar": "باب كَرَاهِيَةِ الْجُلُوسِ إِلَى قُضَاةِ الْجَوْرِ",
      "en": "Chapter 7 – Abhorrence of sitting by the inequitable judges"
    },
    "verse_count": 1,
    "verse_start_index": 14480,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/272)"
        ],
        "index": 14481,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:7:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِنَا عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ مَرَّ بِي أَبُو جَعْفَرٍ وَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا جَالِسٌ عِنْدَ قَاضٍ بِالْمَدِينَةِ فَدَخَلْتُ عَلَيْهِ مِنَ الْغَدِ فَقَالَ لِي مَا مَجْلِسٌ رَأَيْتُكَ فِيهِ أَمْسِ قَالَ قُلْتُ لَهُ جُعِلْتُ فِدَاكَ إِنَّ هَذَا الْقَاضِيَ لِي مُكْرِمٌ فَرُبَّمَا جَلَسْتُ إِلَيْهِ فَقَالَ لِي وَ مَا يُؤْمِنُكَ أَنْ تَنْزِلَ اللَّعْنَةُ فَتَعُمَّ مَنْ فِي الْمَجْلِسِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from one of our companions, from Muhammad Bin Muslim who said, ",
            "‘Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup> passed by me, and I was seated in the presence of the judge of Al-Medina. So I went over to him<sup>asws</sup> in the morning, so he<sup>asws</sup> said to me: ‘What sitting did I<sup>asws</sup> see you to be in, yesterday?’ I said, ‘May I be sacrificed for you<sup>asws</sup>! This judge is honourable to me, so sometimes I sit with him’. So he<sup>asws</sup> said to me: ‘And what would secure you if the Curse were to descend, so it would embrace (grip all) the ones in the gathering’"
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from certain persons of our people from Muhammad ibn Muslim who has narrated the following: “Once, in al-Madinah I was sitting before a judge, when abu Ja‘far and abu ‘ Abd Allah, ‘Alayhim al- Salam, passed by. The next day I went to visit him (the Imam), he asked, ‘What was the gathering where I saw you?’ I said, ‘I pray to Allah to keep my soul in service for your cause, this judge honors me and sometimes I sit with him.’ He (the Imam) said, ‘What will protect you if condemnation falls up on such gathering to encompass you also?’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:6:7",
  "kind": "verse_list"
}