{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 6"
        },
        "path": "/books/al-kafi:7:6",
        "titles": {
          "ar": "كِتَابُ الْقَضَاءِ وَ الْأَحْكَامِ",
          "en": "THE BOOK OF JUDGEMENTS AND THE RULINGS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 9"
        },
        "path": "/books/al-kafi:7:6:9",
        "titles": {
          "ar": "باب أَدَبِ الْحُكْمِ",
          "en": "Chapter 9 – Disciplines of the adjudication"
        }
      }
    ],
    "index": 2243,
    "local_index": 9,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 10"
        },
        "path": "/books/al-kafi:7:6:10",
        "titles": {
          "ar": "باب أَنَّ الْقَضَاءَ بِالْبَيِّنَاتِ وَ الْأَيْمَانِ",
          "en": "Chapter 10 – The judgements are by the proofs and the oaths"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 8"
        },
        "path": "/books/al-kafi:7:6:8",
        "titles": {
          "ar": "باب كَرَاهِيَةِ الِارْتِفَاعِ إِلَى قُضَاةِ الْجَوْرِ",
          "en": "Chapter 8 – Abhorrence of raising (the matters) to the inequitable judges"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 6"
        },
        "path": "/books/al-kafi:7:6",
        "titles": {
          "ar": "كِتَابُ الْقَضَاءِ وَ الْأَحْكَامِ",
          "en": "THE BOOK OF JUDGEMENTS AND THE RULINGS"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:6:9",
    "titles": {
      "ar": "باب أَدَبِ الْحُكْمِ",
      "en": "Chapter 9 – Disciplines of the adjudication"
    },
    "verse_count": 6,
    "verse_start_index": 14486,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/275)"
        ],
        "index": 14487,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/608",
              "text": "عَمْرِو بْنِ أَبِي الْمِقْدَامِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5809",
              "text": "سَلَمَةَ بْنِ كُهَيْلٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَمْرِو بْنِ أَبِي الْمِقْدَامِ عَنْ أَبِيهِ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:9:1",
        "text": [
          " سَمِعْتُ عَلِيّاً ( صلوات الله عليه ) يَقُولُ لِشُرَيْحٍ انْظُرْ إِلَى أَهْلِ الْمَعْكِ وَ الْمَطْلِ وَ دَفْعِ حُقُوقِ النَّاسِ مِنْ أَهْلِ الْمَقْدُرَةِ وَ الْيَسَارِ مِمَّنْ يُدْلِي بِأَمْوَالِ الْمُسْلِمِينَ إِلَى الْحُكَّامِ فَخُذْ لِلنَّاسِ بِحُقُوقِهِمْ مِنْهُمْ وَ بِعْ فِيهَا الْعَقَارَ وَ الدِّيَارَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) يَقُولُ مَطْلُ الْمُسْلِمِ الْمُوسِرِ ظُلْمٌ لِلْمُسْلِمِ وَ مَنْ لَمْ يَكُنْ لَهُ عَقَارٌ وَ لَا دَارٌ وَ لَا مَالٌ فَلَا سَبِيلَ عَلَيْهِ وَ اعْلَمْ أَنَّهُ لَا يَحْمِلُ النَّاسَ عَلَى الْحَقِّ إِلَّا مَنْ وَرَّعَهُمْ عَنِ الْبَاطِلِ",
          "ثُمَّ وَاسِ بَيْنَ الْمُسْلِمِينَ بِوَجْهِكَ وَ مَنْطِقِكَ وَ مَجْلِسِكَ حَتَّى لَا يَطْمَعَ قَرِيبُكَ فِي حَيْفِكَ وَ لَا يَيْأَسَ عَدُوُّكَ مِنْ عَدْلِكَ وَ رُدَّ الْيَمِينَ عَلَى الْمُدَّعِي مَعَ بَيِّنَةٍ فَإِنَّ ذَلِكَ أَجْلَى لِلْعَمَى وَ أَثْبَتُ فِي الْقَضَاءِ وَ اعْلَمْ أَنَّ الْمُسْلِمِينَ عُدُولٌ بَعْضُهُمْ عَلَى بَعْضٍ إِلَّا مَجْلُوداً فِي حَدٍّ لَمْ يَتُبْ مِنْهُ أَوْ مَعْرُوفٌ بِشَهَادَةِ زُورٍ أَوْ ظَنِينٌ ",
          "وَ إِيَّاكَ وَ التَّضَجُّرَ وَ التَّأَذِّيَ فِي مَجْلِسِ الْقَضَاءِ الَّذِي أَوْجَبَ اللَّهُ فِيهِ الْأَجْرَ وَ يُحْسِنُ فِيهِ الذُّخْرَ لِمَنْ قَضَى بِالْحَقِّ وَ اعْلَمْ أَنَّ الصُّلْحَ جَائِزٌ بَيْنَ الْمُسْلِمِينَ إِلَّا صُلْحاً حَرَّمَ حَلَالًا أَوْ أَحَلَّ حَرَاماً ",
          "وَ اجْعَلْ لِمَنِ ادَّعَى شُهُوداً غُيَّباً أَمَداً بَيْنَهُمَا فَإِنْ أَحْضَرَهُمْ أَخَذْتَ لَهُ بِحَقِّهِ وَ إِنْ لَمْ يُحْضِرْهُمْ أَوْجَبْتَ عَلَيْهِ الْقَضِيَّةَ ",
          "فَإِيَّاكَ أَنْ تُنَفِّذَ فِيهِ قَضِيَّةً فِي قِصَاصٍ أَوْ حَدٍّ مِنْ حُدُودِ اللَّهِ أَوْ حَقٍّ مِنْ حُقُوقِ الْمُسْلِمِينَ حَتَّى تَعْرِضَ ذَلِكَ عَلَيَّ إِنْ شَاءَ اللَّهُ وَ لَا تَقْعُدَنَّ فِي مَجْلِسِ الْقَضَاءِ حَتَّى تَطْعَمَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Hassan Bin Mahboub, from Amro Bin Abu Al Miqdam, from his father, from Salma Bin Kuheyl who said, ",
            "‘I heard Ali<sup>asws</sup> saying to Shurayh (the judge): ‘Look at the people of the spaciousness and delayers (of payments), and hand over the rights of the people from the able ones and the affluent, from the ones who are delaying the (payment) of the Muslims to the judges, so seize for the people with their rights from them, and sell with regards to it, the real estates and the houses, for I<sup>asws</sup> heard Rasool-Allah<sup>saww</sup> saying: ‘The delayer affluent Muslim is unjust to the Muslim’. And the one who does not have any real estate for him, nor a house, nor wealth, so there is no way upon him. And know that he does not carry the people upon the truth, the one who scares them from the falsehood. ",
            "Then be comforting with your face and your talk, and your seating, until the one close to you does not covet (desire) your injustice, and your enemy does not despair from your justice. And return the oath to be upon the claimant along with his proof, for in that is the expulsion of the blindness and affirmation in the judgement. And know that the Muslims are equal to each other, except for the whipped-one in a legal penalty (<span class=\"iTxt\">Hadd</span>) which he has not repented upon, or one well-known for bearing false testimonies, or is a suspicious (character). ",
            "And beware of being angry and hurting in the judicial council in which Allah<sup>azwj</sup> has Obligated the Recompense with regards to it and good treasures for the one who judges with the truth. And know that the reconciliation is allowed between the Muslims, except for a reconciliation which prohibits a Permissible, or permits a Prohibition. ",
            "And make a time limit upon the claimant to present absent witnesses between the two, so if he presents them, take his right for him, and if he does not present them, obligate the judgement against him. ",
            "Therefore, beware of implementing a judgement regarding retaliation, or a legal penalty (<span class=\"iTxt\">Hadd</span>) from the Limits of Allah<sup>azwj</sup>, or a right from the rights of the Muslims, until you present that to me<sup>asws</sup>, Allah<sup>azwj</sup> Willing. And do not sit in the judicial council until you feed (serve food for everyone present)’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn Mahbub from ‘Amr ibn abu af-Miqdam from his father Safmah ibn Kuhayf who has narrated the following: “I heard ’ Amir al-Mu’minin, Ali, ‘Alayhi al-Salam, saying to Shurayh, ’Keep an eye on those who delay payment of debts on them and on the procrastinators and on defending the rights of people against the capable and the affluent ones who throw the wealth of the Muslims to the ruling parties. Take the rights of people from them and sell for this purpose real properties and buildings; I heard the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, saying, “The procrastination of an affluent Muslim is injustice to the Muslim.” Those who do not own real properties and homes or other assets, there is no way against them. You must take notice that people cannot be made to do the right thing except by stopping them from falsehood. Be comforting for the Muslims by the appearance of your face, words and sitting manners so that people with nearness to you cannot expect you to be unjust and your adversary loses hope of your justice. Make a plaintiff to take an oath along with testimony; it clears up the blindness and confusion and solidifies the judgment. You must take notice that Muslims are all just people toward each other except those whipped for penalty who have not repented, those well- known for presenting false testimony and a doubting pessimist. You must always stay away from censuring and hurting people in an adjudicating session, for conducting of which Allah has made the recompense obligatory with good rewards for those who render the right judgment. You must keep in mind that arranging a settlement is permissible among the Muslims, except a settlement that makes the lawful as unlawful and the unlawful as lawful. You must set a time limit for those who claim to have absent witnesses. If they present such witnesses then restore their rights; but if they did not present such witnesses, then you must issue judgment against them. You must never issue a judgment in equitable retaliation or a penalty of the penalties, which Allah has sanctioned for the rights of the Muslims without first showing it to me, by the will of Allah. Do not sit (to eat) in the adjudicating session until you complete eating.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/277)"
        ],
        "index": 14488,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/38",
              "text": "النَّوْفَلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/39",
              "text": "السَّكُونِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:9:2",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنِ ابْتُلِيَ بِالْقَضَاءِ فَلَا يَقْضِي وَ هُوَ غَضْبَانُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The one who is involved with the judging, so he should not judge while he is angry’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy from al-Sakuniy who has narrated the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘One whose task is adjudication he must not take his seat to adjudicate when angry.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/277)"
        ],
        "index": 14489,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/158",
              "text": "وَ بِهَذَا الْإِسْنَادِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِهَذَا الْإِسْنَادِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:9:3",
        "text": [
          " قَالَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) مَنِ ابْتُلِيَ بِالْقَضَاءِ فَلْيُوَاسِ بَيْنَهُمْ فِي الْإِشَارَةِ وَ فِي النَّظَرِ وَ فِي الْمَجْلِسِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, ",
            "He<sup>asws</sup> (The Imam<sup>asws</sup>) said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘The one who is involved with the judging, so let him be comforting between them in his gestures, and in the looking, and in the sitting’."
          ],
          "en.sarwar": [
            "3. Through the same chain of narrators as that of the previous Hadith, the following is narrated: “’Amir al-Mu’minin, Ali, ‘Alayhi al-Salam, has said, ‘One who has the task of adjudication must comfort people by means of his gestures, look and seating positions.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/278)"
        ],
        "index": 14490,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/5840",
              "text": "وَ بِهَذَا الْإِسْنَادِ أَنَّ رَجُلًا نَزَلَ بِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَمَكَثَ عِنْدَهُ أَيَّاماً ثُمَّ تَقَدَّمَ إِلَيْهِ فِي خُصُومَةٍ لَمْ يَذْكُرْهَا لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ لَهُ أَ خَصْمٌ أَنْتَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِهَذَا الْإِسْنَادِ أَنَّ رَجُلًا نَزَلَ بِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَمَكَثَ عِنْدَهُ أَيَّاماً ثُمَّ تَقَدَّمَ إِلَيْهِ فِي خُصُومَةٍ لَمْ يَذْكُرْهَا لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ لَهُ أَ خَصْمٌ أَنْتَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:9:4",
        "text": [
          " نَعَمْ قَالَ تَحَوَّلْ عَنَّا إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) نَهَى أَنْ يُضَافَ الْخَصْمُ إِلَّا وَ مَعَهُ خَصْمُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain that, ",
            "‘A man lodged with Amir Al-Momineen<sup>asws</sup>, so he remained with him<sup>asws</sup> for days. Then he came to him<sup>asws</sup> with a dispute which he had not mentioned it to Amir Al-Momineen<sup>asws</sup> beforehand. So he<sup>asws</sup> said to him: ‘Are you the claimant?’ He said, ‘Yes’. He<sup>asws</sup> said: ‘You should transfer out (move out) from us<sup>asws</sup>, as Rasool-Allah<sup>saww</sup> has forbidden to entertain the claimant as a guest, unless the defendant is with him’."
          ],
          "en.sarwar": [
            "4. Through the same chain of narrators as that of the previous Hadith, the following is narrated: “A man once became a guest of ’Amir al-Mu’minin, Ali, ‘Alayhi al-Salam, and stayed with him for several days. He then presented a case before him (the Imam) for adjudication, which he had not mentioned to him (the Imam) before. He (the Imam) asked, ‘Are you the plaintiff?’ The man replied, ‘Yes, I am the plaintiff.’ He (the Imam) said, ‘You must move in another place for lodging; the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has prohibited entertaining a plaintiff as a guest without the presence of the defendant.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/278)"
        ],
        "index": 14491,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3078",
              "text": "أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ رَفَعَهُ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ رَفَعَهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:9:5",
        "text": [
          " قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) لِشُرَيْحٍ لَا تُسَارَّ أَحَداً فِي مَجْلِسِكَ وَ إِنْ غَضِبْتَ فَقُمْ فَلَا تَقْضِيَنَّ فَأَنْتَ غَضْبَانُ ",
          "قَالَ وَ قَالَ أَبُو عَبْدِ اللَّهِ ( صلوات الله عليه ) لِسَانُ الْقَاضِي وَرَاءَ قَلْبِهِ فَإِنْ كَانَ لَهُ قَالَ وَ إِنْ كَانَ عَلَيْهِ أَمْسَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, raising it, said, ",
            "‘Amir Al-Momineen<sup>asws</sup> said to Shurayh (the judge): ‘Do not whisper to anyone in your gathering, and if you are angry, so arise and do not issue a judgement while you are angry’. ",
            "He (the narrator) said, ‘And Abu Abdullah<sup>asws</sup> said: ‘The tongue of a judge is behind his heart. So if it was for him he speaks, and if it was against him, he remains silent’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah in a marfu‘ manner who has narrated the following: “’Amir al-Mu’minin, Ali, ‘Alayhi al-Salam, once said to Shurayh, ’You must not please anyone in your adjudicating session, and if you become angry, you must stand up and must not issue a judgment when you are angry.’ Abu ’Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘The tongue of a judge is behind his heart. If it is for him, he speaks; and if it is against him, he remains quiet.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/278)"
        ],
        "index": 14492,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/479",
              "text": "الْحَجَّالِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2028",
              "text": "دَاوُدَ بْنِ أَبِي يَزِيدَ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5841",
              "text": "سَمِعَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَجَّالِ عَنْ دَاوُدَ بْنِ أَبِي يَزِيدَ عَمَّنْ سَمِعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:6:9:6",
        "text": [
          " إِذَا كَانَ الْحَاكِمُ يَقُولُ لِمَنْ عَنْ يَمِينِهِ وَ لِمَنْ عَنْ يَسَارِهِ مَا تَرَى مَا تَقُولُ فَعَلَى ذَلِكَ لَعْنَةُ اللَّهِ وَ الْمَلَائِكَةِ وَ النَّاسِ أَجْمَعِينَ أَلَّا يَقُومُ مِنْ مَجْلِسِهِ وَ تُجْلِسُهُمْ مَكَانَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hajjal, from Dawood Bin Abu Yazeed, from the one who heard it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the judge is saying to the one on his right, and to the one on his left, ‘What is your view, what are you saying?’, so upon that is the Curse of Allah<sup>azwj</sup>, and the Angels, and the people altogether. Indeed, why does he not arise from his seat and makes them to sit in his own seat?’"
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hajjal from Dawud ibn abu Yazid from the one who had heard from him (the Imam) who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If a judge, to those on his right or left side, says, “What do you think, what do you say?” He is condemned by Allah, the angels and all people. Why must he not move away and make them sit in his place?”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:6:9",
  "kind": "verse_list"
}