{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:4:1:12",
        "titles": {
          "ar": "بَابُ قَدْرِ مَا يُعْطَى السَّائِلَ",
          "en": "Chapter 59 – A measurement of what one should give to the beggar"
        }
      }
    ],
    "index": 829,
    "local_index": 12,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:4:1:13",
        "titles": {
          "ar": "بَابُ دُعَاءِ السَّائِلِ",
          "en": "Chapter 60 – Supplication of the beggar"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 11"
        },
        "path": "/books/al-kafi:4:1:11",
        "titles": {
          "ar": "بَابُ كَرَاهِيَةِ رَدِّ السَّائِلِ",
          "en": "Chapter 58 – Abhorrence of repelling the beggar"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:1:12",
    "titles": {
      "ar": "بَابُ قَدْرِ مَا يُعْطَى السَّائِلَ",
      "en": "Chapter 59 – A measurement of what one should give to the beggar"
    },
    "verse_count": 2,
    "verse_start_index": 6029,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/143)"
        ],
        "index": 6030,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:12:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنِ الْوَلِيدِ بْنِ صَبِيحٍ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَجَاءَهُ سَائِلٌ فَأَعْطَاهُ ثُمَّ جَاءَهُ آخَرُ فَأَعْطَاهُ ثُمَّ جَاءَهُ آخَرُ فَأَعْطَاهُ ثُمَّ جَاءَهُ آخَرُ فَقَالَ يَسَعُ اللَّهُ عَلَيْكَ ",
          "ثُمَّ قَالَ إِنَّ رَجُلًا لَوْ كَانَ لَهُ مَالٌ يَبْلُغُ ثَلَاثِينَ أَوْ أَرْبَعِينَ أَلْفَ دِرْهَمٍ ثُمَّ شَاءَ أَنْ لَا يَبْقَى مِنْهَا إِلَّا وَضَعَهَا فِي حَقٍّ لَفَعَلَ فَيَبْقَى لَا مَالَ لَهُ فَيَكُونُ مِنَ الثَّلَاثَةِ الَّذِينَ يُرَدُّ دُعَاؤُهُمْ قُلْتُ مَنْ هُمْ قَالَ أَحَدُهُمْ رَجُلٌ كَانَ لَهُ مَالٌ فَأَنْفَقَهُ فِي غَيْرِ وَجْهِهِ ثُمَّ قَالَ يَا رَبِّ ارْزُقْنِي فَقَالَ لَهُ أَ لَمْ أَجْعَلْ لَكَ سَبِيلًا إِلَى طَلَبِ الرِّزْقِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Mahboub, from Abdullah Bin Sinan, from Al Waleed Bin sabeeh who said, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup>, so a beggar came over. So he<sup>asws</sup> gave him. Then another one came over, so he<sup>asws</sup> gave him. Then another one came over, so he<sup>asws</sup> gave him. Then another one came over, so he<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> Extend upon you’. ",
            "Then he<sup>asws</sup> said: ‘If a man, even if he had wealth reaching up to thirty or forty thousand Dirhams, then he so desires that there should not remain anything from it except that he should place it in a rightful way. So he does it, and there does not remain any wealth for himself, so he would happen to be from the three (kinds of people) whose supplications would be returned (unanswered)’. I said, ‘Who are they?’ He<sup>asws</sup> said: ‘One of them is a man who had wealth for him, so he spent it in other than its (rightful) way, then said, ‘O Lord<sup>azwj</sup>! Grace me’. So He<sup>azwj</sup> Would Say to him: “Did I not Make a way for you to seeking the livelihood?’"
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Mahbub from ‘Abd Allah ibn Sinan from al-Walid ibn Sabih who has said the following: “Once I was in the presence of abu ‘Abd Allah, ‘Alayhi al-Salam, when someone came asking for help. He gave him charity, then another one came, he gave him charity, yet another came for help, and he gave him charity. Then one more came for help and he said, ‘Allah will provide you.’ The Imam then said, ‘One may possess thirty or forty thousand dirham and then decide to spend it for a true cause until nothing is left with him. So he becomes one of the three kinds of people whose prayers are not heard.’ I then asked, ‘Who are such people?’ He replied, ‘One of them is a man who has a certain amount of wealth that he spends improperly and then prays to Allah for more wealth. He is then asked, “Have We not created ways and means to accumulate wealth?”’ (There is a mention of the other two kinds of people in al-Kafi, vol. 2, part 2, book of prayer Chapter 32 Hadith 1). "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/144)"
        ],
        "index": 6031,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:12:2",
        "text": [
          "وَ عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ فِي السُّؤَّالِ أَطْعِمُوا ثَلَاثَةً إِنْ شِئْتُمْ أَنْ تَزْدَادُوا فَازْدَادُوا وَ إِلَّا فَقَدْ أَدَّيْتُمْ حَقَّ يَوْمِكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ahmad Bin Muhammad, from Usman Bin Isa, from Ali Bin Abu Hamza who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying regarding the question: ‘Feed three (people). If you so desire to increase, so increase, or else you would have fulfilled a right of your day’."
          ],
          "en.sarwar": [
            "2. It is narrated from the narrator of the above Hadith from Ahmad ibn Muhammad from ‘Uthman ibn ‘Isa from Ali ibn abu Hamzah who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, say in answer to a question, ‘Feed three people or more if you like; however, you have already fulfilled what you should have done for the day.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:1:12",
  "kind": "verse_list"
}