{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:4:1:14",
        "titles": {
          "ar": "بَابُ أَنَّ الَّذِي يَقْسِمُ الصَّدَقَةَ شَرِيكُ صَاحِبِهِا فِي الْأَجْرِ",
          "en": "Chapter 61 – Those who distribute the charity are participants with its (original) donor in the Recompense"
        }
      }
    ],
    "index": 831,
    "local_index": 14,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 15"
        },
        "path": "/books/al-kafi:4:1:15",
        "titles": {
          "ar": "بَابُ الْإِيثَارِ",
          "en": "Chapter 62 – The Preferring (of others over oneself)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:4:1:13",
        "titles": {
          "ar": "بَابُ دُعَاءِ السَّائِلِ",
          "en": "Chapter 60 – Supplication of the beggar"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:1:14",
    "titles": {
      "ar": "بَابُ أَنَّ الَّذِي يَقْسِمُ الصَّدَقَةَ شَرِيكُ صَاحِبِهِا فِي الْأَجْرِ",
      "en": "Chapter 61 – Those who distribute the charity are participants with its (original) donor in the Recompense"
    },
    "verse_count": 3,
    "verse_start_index": 6033,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/144)"
        ],
        "index": 6034,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:14:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ صَالِحِ بْنِ رَزِينٍ قَالَ دَفَعَ إِلَيَّ شِهَابُ بْنُ عَبْدِ رَبِّهِ دَرَاهِمَ مِنَ الزَّكَاةِ أَقْسِمُهَا فَأَتَيْتُهُ يَوْماً فَسَأَلَنِي هَلْ قَسَمْتَهَا فَقُلْتُ لَا فَأَسْمَعَنِي كَلَاماً فِيهِ بَعْضُ الْغِلْظَةِ فَطَرَحْتُ مَا كَانَ بَقِيَ مَعِي مِنَ الدَّرَاهِمِ وَ قُمْتُ مُغْضَباً فَقَالَ لِيَ ارْجِعْ حَتَّى أُحَدِّثَكَ بِشَيْ‏ءٍ سَمِعْتُهُ مِنْ جَعْفَرِ بْنِ مُحَمَّدٍ ( عليه السلام ) فَرَجَعْتُ فَقَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي إِذَا وَجَدْتُ زَكَاتِي أَخْرَجْتُهَا فَأَدْفَعُ مِنْهَا إِلَى مَنْ أَثِقُ بِهِ يَقْسِمُهَا قَالَ نَعَمْ لَا بَأْسَ بِذَلِكَ أَمَا إِنَّهُ أَحَدُ الْمُعْطِينَ ",
          "قَالَ صَالِحٌ فَأَخَذْتُ الدَّرَاهِمَ حَيْثُ سَمِعْتُ الْحَدِيثَ فَقَسَمْتُهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Al Hassan Bin Mahboub, from Salih Bin Razeyn who said, ",
            "‘Shahab Bin Abd Rabbih handed over some Dirhams from the Zakat to me to distribute them. So I came over to him one day, and he asked me, ‘Did you distribute them?’ So I said, ‘No’. So he made me listen to words wherein was harshness. So I dropped what had remained with me from the Dirhams, and I arose in anger. So he said to me, ‘Return, until I narrate to you with something which I heard from Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>’. So I returned. So he said, ‘I said to Abu Abdullah<sup>asws</sup>, ‘When I find my Zakat, so can I take it out and hand it over to one who is reliable with it to distribute it?’. He<sup>asws</sup> said: ‘Yes, there is no problem with that. But, he would be one of the givers’.",
            "Salih said, ‘So I took the Dirhams when I heard the Hadeeth, and I distribute them’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad from al-Hassan ibn Mahbub from Salih ibn Razin who has said the following: “Shihab ibn ‘ Abd Rabbihi gave to me a certain amount of dirhams of zakat to distribute among the needy. One day I visited him, and he asked, ‘Did you distribute them?’ I said, ‘No, I have not done so.’ He said something that I did not like. I then threw to him what still was not distributed and got up to leave. He said, ‘Come back and allow me to tell you about something that I heard from Ja’far ibn Muhammad, ‘Alayhi al-Salam.’ I returned and he said to me, ‘I asked abu ‘Abd Allah, ‘Alayhi al- Salam, “Can I give the amount of zakat I owe to someone I trust so he can distribute among the needy?” He (the Imam) replied, ‘It is just fine. He receives a reward like the donors of charity. Salih has said, “I then took the dirhams back after hearing the Hadith, and distributed them (among the needy).”’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/145)"
        ],
        "index": 6035,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:14:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ أَبِي نَهْشَلٍ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَوْ جَرَى الْمَعْرُوفُ عَلَى ثَمَانِينَ كَفّاً لَأُجِرُوا كُلُّهُمْ فِيهِ مِنْ غَيْرِ أَنْ يُنْقَصَ صَاحِبُهُ مِنْ أَجْرِهِ شَيْئاً ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from his father, from Abu Nahash, from the one who mentioned it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘If the goodness were to flow upon eighty palms (via 80 people), all of them would be Recompensed with regards to it, from without there being any deficiency being in the Recompense of its (original) donor’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from his father from abu Nahshal from those whom he has mentioned who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that even if a virtuous matter passes through eighty hands, all of them earn a reward without any reduction in the reward of the initiator of such a virtuous matter.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالحسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/145)"
        ],
        "index": 6036,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:14:3",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الرَّجُلِ يُعْطَى الدَّرَاهِمَ يَقْسِمُهَا قَالَ يَجْرِي لَهُ مَا يَجْرِي لِلْمُعْطِي وَ لَا يُنْقَصُ الْمُعْطِي مِنْ أَجْرِهِ شَيْئاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Ibn Abu Umeyr, from Jameel Bin Darraj, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the man who gives the Dirhams himself. He<sup>asws</sup> said: ‘There would flow for him whatever would flow for the (original) giver, and the (original) given would not been reduced by anything from his Recompense’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Isma‘il has narrated from al-Fadl ibn Shadan ibn abu ‘Umayr from Jamil ibn Darraj who has said the following: “About a man who gives a certain amount of dirhams to someone to distribute among the needy, abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘What applies to the donor also applies to him without any reduction in the reward of the donor.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:1:14",
  "kind": "verse_list"
}