{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 15"
        },
        "path": "/books/al-kafi:4:1:15",
        "titles": {
          "ar": "بَابُ الْإِيثَارِ",
          "en": "Chapter 62 – The Preferring (of others over oneself)"
        }
      }
    ],
    "index": 832,
    "local_index": 15,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 16"
        },
        "path": "/books/al-kafi:4:1:16",
        "titles": {
          "ar": "بَابُ مَنْ سَأَلَ مِنْ غَيْرِ حَاجَةٍ ",
          "en": "Chapter 63 – One who asks without having a need"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:4:1:14",
        "titles": {
          "ar": "بَابُ أَنَّ الَّذِي يَقْسِمُ الصَّدَقَةَ شَرِيكُ صَاحِبِهِا فِي الْأَجْرِ",
          "en": "Chapter 61 – Those who distribute the charity are participants with its (original) donor in the Recompense"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:1:15",
    "titles": {
      "ar": "بَابُ الْإِيثَارِ",
      "en": "Chapter 62 – The Preferring (of others over oneself)"
    },
    "verse_count": 3,
    "verse_start_index": 6036,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/145)"
        ],
        "index": 6037,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/117",
              "text": "عُثْمَانَ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/305",
              "text": "سَمَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:15:1",
        "relations": {
          "Mentions": [
            "/books/quran:59:9"
          ]
        },
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ لَيْسَ عِنْدَهُ إِلَّا قُوتُ يَوْمِهِ أَ يَعْطِفُ مَنْ عِنْدَهُ قُوتُ يَوْمِهِ عَلَى مَنْ لَيْسَ عِنْدَهُ شَيْ‏ءٌ وَ يَعْطِفُ مَنْ عِنْدَهُ قُوتُ شَهْرٍ عَلَى مَنْ دُونَهُ وَ السَّنَةُ عَلَى نَحْوِ ذَلِكَ أَمْ ذَلِكَ كُلُّهُ الْكَفَافُ الَّذِي لَا يُلَامُ عَلَيْهِ ",
          "فَقَالَ هُوَ أَمْرٌ إِنَّ أَفْضَلَكُمْ فِيهِ أَحْرَصُكُمْ عَلَى الرَّغْبَةِ وَ الْأَثَرَةِ عَلَى نَفْسِهِ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ وَ يُؤْثِرُونَ عَلى أَنْفُسِهِمْ وَ لَوْ كانَ بِهِمْ خَصاصَةٌ وَ الْأَمْرُ الْآخَرُ لَا يُلَامُ عَلَى الْكَفَافِ وَ الْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى وَ ابْدَأْ بِمَنْ تَعُولُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from Sama’at who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man who does not have with him except for his provision for his day. Can the one who has his provision for his day with him be sympathetic towards the one who does not have anything, and can the one who has provisions for a month be sympathetic upon the one who has less than it, and the year is upon approximate to that, or is all of that the subsistence which he cannot be blamed over it?’ ",
            "So he<sup>asws</sup> said: ‘It is such a matter that the most superior of you in it is the one most desirous upon the preferring (others) upon himself, for Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:59#h9\">[59:9]</a> and prefer (them) before themselves though poverty may afflict them</span>. And the other matter is that he cannot be blamed upon the subsistence, and the higher (providing) hand is better than the lower (receiving) hand, and begin with the ones dependant (upon you)’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad, from ibn Khalid from ‘Uthman from ibn ‘Isa from Sama‘ah, who has said the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, this question: ‘There is one who has sustenance for only one day, or for only one month or one year. Should he give preference to another person who does not have sustenance even for one day, or one month or one year, or in all cases, is there no blame in not giving preference because of sustenance being barely enough for himself? 5 He (the Imam) said, ‘There are two issues. Those of you who are more inclined to giving preference to others over themselves are excellent. Allah, the Most Majestic, the Most Glorious, has said, “They give preference to others over themselves even though they themselves are in dire need.” <a href=\"/#/books/quran:59#h9\">[59:9]</a> The other issue is that in not giving preference to others over themselves, they are not blamed; however, a providing hand has the upper hand over a non-providing hand, but you must begin with your dependents.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/146)"
        ],
        "index": 6038,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2019",
              "text": "قَالَ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2834",
              "text": "حَدَّثَنَا بَكْرُ بْنُ صَالِحٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2835",
              "text": "بُنْدَارَ بْنِ مُحَمَّدٍ الطَّبَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2836",
              "text": "عَلِيِّ بْنِ سُوَيْدٍ السَّائِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/351",
              "text": "أَبِي الْحَسَنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "قَالَ وَ حَدَّثَنَا بَكْرُ بْنُ صَالِحٍ عَنْ بُنْدَارَ بْنِ مُحَمَّدٍ الطَّبَرِيِّ عَنْ عَلِيِّ بْنِ سُوَيْدٍ السَّائِيِّ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:15:2",
        "text": [
          " قُلْتُ لَهُ أَوْصِنِي فَقَالَ آمُرُكَ بِتَقْوَى اللَّهِ ثُمَّ سَكَتَ فَشَكَوْتُ إِلَيْهِ قِلَّةَ ذَاتِ يَدِي وَ قُلْتُ وَ اللَّهِ لَقَدْ عَرِيتُ حَتَّى بَلَغَ مِنْ عُرْيَتِي أَنَّ أَبَا فُلَانٍ نَزَعَ ثَوْبَيْنِ كَانَا عَلَيْهِ وَ كَسَانِيهِمَا فَقَالَ صُمْ وَ تَصَدَّقْ قُلْتُ أَتَصَدَّقُ مِمَّا وَصَلَنِي بِهِ إِخْوَانِي وَ إِنْ كَانَ قَلِيلًا قَالَ تَصَدَّقْ بِمَا رَزَقَكَ اللَّهُ وَ لَوْ آثَرْتَ عَلَى نَفْسِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "He said, ‘And Bakr Bin Salih narrated to us, from Bundar Bin Muhammad Al Tabary, from Ali Bin Suweyd Al Sa’aiy, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘Advise me’. So he<sup>asws</sup> said: ‘I<sup>asws</sup> order you with the fear of Allah<sup>azwj</sup>’. Then he<sup>asws</sup> was silent, so I complained to him<sup>asws</sup> of the scarcity of what was in my hands, and I said, ‘By Allah<sup>azwj</sup>! I have become naked, and my nakedness reached to such an extent that Abu so and so removed two clothes which were upon him, and clothed me with these two’. So he<sup>asws</sup> said: ‘Fast and give charity’. I said, ‘Can I give in charity from what has arrived to me from my brethren, and even if it was little?’ He<sup>asws</sup> said: ‘Give charity from what Allah<sup>azwj</sup> has Graced you with, even though you have to prefer (others) over yourself’."
          ],
          "en.sarwar": [
            "2. The narrator of the above Hadith has said that narrated to us Bakr ibn Salih from Bandar ibn Muhammad al-Tabariy from Ali ibn Suwayd al-Sa’iy who has said the following: “I once said to abu al-Hassan, ‘Alayhi al-Salam, ‘Please instruct me with good advice.’ He said, ‘I advise you to observe piety before Allah.’ He was silent for a while. I then complained to him about my poverty, saying, ‘By Allah, I do not have any clothes, and it is so much that abu so and so took off two pieces of his clothes so I can wear them.’ He said, ‘Fast and give charity.’ I then asked, ‘Should I give charity from what my friends have given to me, even if it is so little?’ He replied, ‘Give charity from what Allah has provided you, even if you have to give preference to others over yourself.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/146)"
        ],
        "index": 6039,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/239",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/359",
              "text": "مُحَمَّدِ بْنِ سَمَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/497",
              "text": "أَحَدِهِمَا ( عليهما السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:15:3",
        "relations": {
          "Mentions": [
            "/books/quran:59:9"
          ]
        },
        "text": [
          " قُلْتُ لَهُ أَيُّ الصَّدَقَةِ أَفْضَلُ قَالَ جُهْدُ الْمُقِلِّ أَ مَا سَمِعْتَ قَوْلَ اللَّهِ عَزَّ وَ جَلَّ وَ يُؤْثِرُونَ عَلى أَنْفُسِهِمْ وَ لَوْ كانَ بِهِمْ خَصاصَةٌ تَرَى هَاهُنَا فَضْلًا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Muhammad Bin Sama’at, from Abu Baseer, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>), said, ‘I said to him<sup>asws</sup>, ‘Which is the most superior charity?’ He<sup>asws</sup> said: ‘The smallest amount (for which one had to) struggled with. But, have you not heard the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:59#h9\">[59:9]</a> and prefer (them) before themselves though poverty may afflict them</span>? Over here is the superiority’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad ibn abu Nasr from Muhammad ibn Sama‘ah from abu Basir from one of the two Imam abu Ja’far or abu ‘Abd Allah, recipients of divine supreme covenant who has said the following: “I asked him (the Imam), ‘What kind of charity is more excellent?’ He said, ‘It is the kind of charity that one provides after doing his utmost. Have you heard the words of Allah, the Most Majestic, “They give preference to others over themselves even though they are in dire need?” <a href=\"/#/books/quran:59#h9\">[59:9]</a> It is this kind of charity giving in which you can see excellence.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:1:15",
  "kind": "verse_list"
}