{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:4:1", "titles": {"ar": "كِتَابُ الزَّكَاةِ", "en": "THE BOOK OF ZAKAAT"}}, {"indexed_titles": {"en": "Chapter 17"}, "path": "/books/al-kafi:4:1:17", "titles": {"ar": "بَابُ كَرَاهِيَةِ الْمَسْأَلَةِ", "en": "Chapter 64 – Abhorrence of the begging"}}], "index": 834, "local_index": 17, "part_type": "Chapter", "path": "/books/al-kafi:4:1:17", "titles": {"ar": "بَابُ كَرَاهِيَةِ الْمَسْأَلَةِ", "en": "Chapter 64 – Abhorrence of the begging"}, "verse_count": 8, "verse_start_index": 6042, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 6043, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:1:17:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ الْحُسَيْنِ بْنِ حَمَّادٍ عَمَّنْ سَمِعَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِيَّاكُمْ وَ سُؤَالَ النَّاسِ فَإِنَّهُ ذُلٌّ فِي الدُّنْيَا وَ فَقْرٌ تُعَجِّلُونَهُ وَ حِسَابٌ طَوِيلٌ يَوْمَ الْقِيَامَةِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Al Husayn Bin Hammad, ", "(It has been narrated) from the one who heard Abu Abdullah<sup>asws</sup> saying: ‘Beware of begging the people, for it is a humiliation in the world and poverty which you are hastening, and a lengthy Reckoning on the Day of Judgement’."]}}, {"index": 6044, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:1:17:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) يَا مُحَمَّدُ لَوْ يَعْلَمُ السَّائِلُ مَا فِي الْمَسْأَلَةِ مَا سَأَلَ أَحَدٌ أَحَداً وَ لَوْ يَعْلَمُ الْمُعْطِي مَا فِي الْعَطِيَّةِ مَا رَدَّ أَحَدٌ أَحَداً ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, from Muhammad Bin Muslim who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘O Muhamad! Had the beggar known what is in the begging, no one would beg from anyone; and had the giver known what is in the giving, no one would have repelled anyone’."]}}, {"index": 6045, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:4:1:17:3", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ النَّضْرِ رَفَعَهُ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْأَيْدِي ثَلَاثٌ يَدُ اللَّهِ الْعُلْيَا وَ يَدُ الْمُعْطِي الَّتِي تَلِيهَا وَ يَدُ الْمُعْطَى أَسْفَلُ الْأَيْدِي فَاسْتَعِفُّوا عَنِ السُّؤَالِ مَا اسْتَطَعْتُمْ إِنَّ الْأَرْزَاقَ دُونَهَا حُجُبٌ فَمَنْ شَاءَ قَنَى حَيَاءَهُ وَ أَخَذَ رِزْقَهُ وَ مَنْ شَاءَ هَتَكَ الْحِجَابَ وَ أَخَذَ رِزْقَهُ وَ الَّذِي نَفْسِي بِيَدِهِ لَأَنْ يَأْخُذَ أَحَدُكُمْ حَبْلًا ثُمَّ يَدْخُلَ عَرْضَ هَذَا الْوَادِي فَيَحْتَطِبَ حَتَّى لَا يَلْتَقِيَ طَرَفَاهُ ثُمَّ يَدْخُلَ بِهِ السُّوقَ فَيَبِيعَهُ بِمُدٍّ مِنْ تَمْرٍ وَ يَأْخُذَ ثُلُثَهُ وَ يَتَصَدَّقَ بِثُلُثَيْهِ خَيْرٌ لَهُ مِنْ أَنْ يَسْأَلَ النَّاسَ أَعْطَوْهُ أَوْ حَرَمُوهُ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Ahmad Bin Al Nazar, raising it, said, ", "‘Rasool-Allah<sup>saww</sup> said: ‘The hands are three – The Hand of Allah<sup>azwj</sup> being the upper one, and the hand of the giver is what follows it, and the hand of the recipient being the lowest of the hands. Therefore, refrain from the begging to the extent of your ability. The sustenance are behind a veil, so the one who so desires to would veil his shame and take his sustenance, and the one who so desires to would tear down the veil and take his sustenance. ", "By the One in Whose Hand is my<sup>saww</sup> soul, if one of you were to take a rope, then enters a land of this valley, so he would collect firewood until its (rope’s) ends do not meet, then he enters the market with it, so he sells it for a handful of dates, and he takes a third of it, and gives in charity with two thirds of it, it would be better for him, than if he were to ask the people who would either give him or prevent him’."]}}, {"index": 6046, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:4:1:17:4", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ دَاوُدَ بْنِ النُّعْمَانِ عَنْ إِبْرَاهِيمَ بْنِ عُثْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى أَحَبَّ شَيْئاً لِنَفْسِهِ وَ أَبْغَضَهُ لِخَلْقِهِ أَبْغَضَ لِخَلْقِهِ الْمَسْأَلَةَ وَ أَحَبَّ لِنَفْسِهِ أَنْ يُسْأَلَ وَ لَيْسَ شَيْ‏ءٌ أَحَبَّ إِلَى اللَّهِ عَزَّ وَ جَلَّ مِنْ أَنْ يُسْأَلَ فَلَا يَسْتَحْيِي أَحَدُكُمْ أَنْ يَسْأَلَ اللَّهَ مِنْ فَضْلِهِ وَ لَوْ بِشِسْعِ نَعْلٍ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al hakam, from Dawood Bin Al Noman, from Ibrahim Bin Usman, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Allah<sup>azwj</sup> Blessed and High Loves something for Himself<sup>azwj</sup>, and Hates it for His<sup>azwj</sup> creatures. He<sup>azwj</sup> Hates it for His<sup>azwj</sup> creatures, the begging, and Loves for Himself<sup>azwj</sup> that one should ask Him<sup>azwj</sup>; and there is nothing more Beloved to Allah<sup>azwj</sup> Mighty and Majestic than for one to ask. So not one of you should be embarrassed that he asks Allah<sup>azwj</sup> from His<sup>azwj</sup> Grace, and even though it may be a strap of a slipper’."]}}, {"index": 6047, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:4:1:17:5", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ جَاءَتْ فَخِذٌ مِنَ الْأَنْصَارِ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَسَلَّمُوا عَلَيْهِ فَرَدَّ عَلَيْهِمُ السَّلَامَ فَقَالُوا يَا رَسُولَ اللَّهِ لَنَا إِلَيْكَ حَاجَةٌ فَقَالَ هَاتُوا حَاجَتَكُمْ قَالُوا إِنَّهَا حَاجَةٌ عَظِيمَةٌ فَقَالَ هَاتُوهَا مَا هِيَ قَالُوا تَضْمَنُ لَنَا عَلَى رَبِّكَ الْجَنَّةَ ", "قَالَ فَنَكَسَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) رَأْسَهُ ثُمَّ نَكَتَ فِي الْأَرْضِ ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ أَفْعَلُ ذَلِكَ بِكُمْ عَلَى أَنْ لَا تَسْأَلُوا أَحَداً شَيْئاً ", "قَالَ فَكَانَ الرَّجُلُ مِنْهُمْ يَكُونُ فِي السَّفَرِ فَيَسْقُطُ سَوْطُهُ فَيَكْرَهُ أَنْ يَقُولَ لِإِنْسَانٍ نَاوِلْنِيهِ فِرَاراً مِنَ الْمَسْأَلَةِ فَيَنْزِلُ فَيَأْخُذُهُ وَ يَكُونُ عَلَى الْمَائِدَةِ فَيَكُونُ بَعْضُ الْجُلَسَاءِ أَقْرَبَ إِلَى الْمَاءِ مِنْهُ فَلَا يَقُولُ نَاوِلْنِي حَتَّى يَقُومُ فَيَشْرَبُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, from Abu Baseer, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A branch of a tribe of the Helpers came over to Rasool-Allah<sup>saww</sup> and they greeted him<sup>saww</sup>. So he<sup>saww</sup> returned (greeting) to them. So they said, ‘O Rasool-Allah<sup>azwj</sup>! For us there is a need to you<sup>saww</sup>’. So he<sup>asws</sup> said: ‘Come with your need’. So they said, ‘It is a great need’. So he<sup>saww</sup> said: ‘Say it, what is it?’ They said, ‘Guarantee for us the Paradise upon your<sup>saww</sup> Lord<sup>azwj</sup>’. ", "He<sup>asws</sup> said: ‘So Rasool-Allah<sup>saww</sup> lowered his<sup>saww</sup> head, then made marks in the ground, then raised his<sup>saww</sup> head, so he<sup>saww</sup> said: ‘I<sup>saww</sup> will do that with you upon a stipulation that not one of you would ask anyone for anything’. ", "He<sup>asws</sup> said: ‘So it was such that the man from them happened to be in the journey, and his whip would fall down, so he would dislike to ask a person, ‘Can you give it to me’, (so they were) fleeing from the asking. So he would (rather) descend and take it himself; and he would happen to be upon the table, and one of the seated ones would be closer to the water than himself, but he would not say, ‘Can you give me (the water)’, until he would arise himself, so he would drink’."]}}, {"index": 6048, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:4:1:17:6", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ عَمَّنْ ذَكَرَهُ عَنِ الْحُسَيْنِ بْنِ أَبِي الْعَلَاءِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) رَحِمَ اللَّهُ عَبْداً عَفَّ وَ تَعَفَّفَ وَ كَفَّ عَنِ الْمَسْأَلَةِ فَإِنَّهُ يَتَعَجَّلُ الدَّنِيَّةَ فِي الدُّنْيَا وَ لَا يُغْنِي النَّاسُ عَنْهُ شَيْئاً", "قَالَ ثُمَّ تَمَثَّلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) بِبَيْتِ حَاتِمٍ : إِذَا مَا عَرَفْتُ الْيَأْسَ أَلْفَيْتُهُ الْغِنَى * إِذَا عَرَفَتْهُ النَّفْسُ وَ الطَّمَعُ الْفَقْرُ"], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Abu Abdullah, from his father, from the one who mentioned it, from Al Husayn Bin Abu Al A’ala who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Shows Mercy on a self-restraining chaste person who restrains from the begging, for it hastens the disgrace in the world and the people do not make him self-sufficient in anything from him.", "He (the narrator) said, ‘Then Abu Abdullah<sup>asws</sup> gave an example of a poem of Hatim: ‘When I recognised the despair I realised the riches; when the soul recognised it, the greed was the poverty’."]}}, {"index": 6049, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:4:1:17:7", "text": ["عَلِيُّ بْنُ مُحَمَّدٍ وَ أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَسَنِ عَنِ الْعَبَّاسِ بْنِ عَامِرٍ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ الصَّيْرَفِيِّ عَنْ مُفَضَّلِ بْنِ قَيْسِ بْنِ رُمَّانَةَ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَذَكَرْتُ لَهُ بَعْضَ حَالِي فَقَالَ يَا جَارِيَةُ هَاتِ ذَلِكَ الْكِيسَ هَذِهِ أَرْبَعُمِائَةِ دِينَارٍ وَصَلَنِي بِهَا أَبُو جَعْفَرٍ فَخُذْهَا وَ تَفَرَّجْ بِهَا ", "قَالَ فَقُلْتُ لَا وَ اللَّهِ جُعِلْتُ فِدَاكَ مَا هَذَا دَهْرِي وَ لَكِنْ أَحْبَبْتُ أَنْ تَدْعُوَ اللَّهَ عَزَّ وَ جَلَّ لِي قَالَ فَقَالَ إِنِّي سَأَفْعَلُ وَ لَكِنْ إِيَّاكَ أَنْ تُخْبِرَ النَّاسَ بِكُلِّ حَالِكَ فَتَهُونَ عَلَيْهِمْ ."], "translations": {"en.hubeali": ["Ali Bin Muhammad, and Ahmad Bin Muhammad, from Ali Bin Al Hassan, from Al Abbas Bin Aamir, from Muhammad Bin Ibrahim Al Sayrafi, from Mufazzal Bin Qays Bin Rummana who said, ", "‘I came over to Abu Abdullah<sup>asws</sup>, and I mentioned to him some of my state. So he<sup>asws</sup> said: ‘O maid! Bring me<sup>asws</sup> that bag!’ These are the four hundred Dinars which were sent to me by Abu Ja’far (Al-Mansour the Caliph), so take these and ease (your financial problems) with these’. ", "He (the narrator) said, ‘So I said, ‘No, by Allah<sup>azwj</sup>! May I be sacrificed for you<sup>asws</sup>! This is not my purpose, but I would love it if you<sup>asws</sup> could supplicate to Allah<sup>azwj</sup> Mighty and Majestic for me’. So he<sup>asws</sup> said: ‘I<sup>asws</sup> shall be doing it, but beware of informing the people with all of your state, for you would be belittled by them’."]}}, {"index": 6050, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:4:1:17:8", "text": ["وَ رُوِيَ عَنْ لُقْمَانَ أَنَّهُ قَالَ لِابْنِهِ يَا بُنَيَّ ذُقْتُ الصَّبْرَ وَ أَكَلْتُ لِحَاءَ الشَّجَرِ فَلَمْ أَجِدْ شَيْئاً هُوَ أَمَرُّ مِنَ الْفَقْرِ فَإِنْ بُلِيتَ بِهِ يَوْماً وَ لَا تُظْهِرِ النَّاسَ عَلَيْهِ فَيَسْتَهِينُوكَ وَ لَا يَنْفَعُوكَ بِشَيْ‏ءٍ ارْجِعْ إِلَى الَّذِي ابْتَلَاكَ بِهِ فَهُوَ أَقْدَرُ عَلَى فَرَجِكَ وَ سَلْهُ مَنْ ذَا الَّذِي سَأَلَهُ فَلَمْ يُعْطِهِ أَوْ وَثِقَ بِهِ فَلَمْ يُنْجِهِ ."], "translations": {"en.hubeali": ["And it is reported from Luqman<sup>as</sup> who<sup>as</sup> said to his<sup>as</sup> son: ‘O my<sup>as</sup> son! I<sup>as</sup> tasted the patience and ate the bark of the tree, but I<sup>as</sup> did not find anything which more bitter than the poverty. So if you are tried by it one day, do not manifest it to the people, for they would be belittling you, and they will not be benefitting you with anything. Place your hope to the One<sup>azwj</sup> Who Tried you with it, for He<sup>azwj</sup> is more Able upon your relief, and ask Him<sup>azwj</sup>. The one who asked Him<sup>azwj</sup> and was not Given it, or relied upon Him<sup>azwj</sup> but was not rescued (How come)?’"]}}]}, "index": "al-kafi:4:1:17", "kind": "verse_list"}