{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 19"
        },
        "path": "/books/al-kafi:4:1:19",
        "titles": {
          "ar": "بَابُ مَنْ أَعْطَى بَعْدَ الْمَسْأَلَةِ",
          "en": "Chapter 66 – The one who gives after the asking"
        }
      }
    ],
    "index": 836,
    "local_index": 19,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 20"
        },
        "path": "/books/al-kafi:4:1:20",
        "titles": {
          "ar": "بَابُ الْمَعْرُوفِ",
          "en": "Chapter 67 – The act of kindness"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:4:1:18",
        "titles": {
          "ar": "بَابُ الْمَنِّ",
          "en": "Chapter 65 – The Reproach"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:1:19",
    "titles": {
      "ar": "بَابُ مَنْ أَعْطَى بَعْدَ الْمَسْأَلَةِ",
      "en": "Chapter 66 – The one who gives after the asking"
    },
    "verse_count": 5,
    "verse_start_index": 6052,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/150)"
        ],
        "index": 6053,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:19:1",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ أَمِيرَ الْمُؤْمِنِينَ صَلَوَاتُ اللَّهِ عَلَيْهِ بَعَثَ إِلَى رَجُلٍ بِخَمْسَةِ أَوْسَاقٍ مِنْ تَمْرِ الْبُغَيْبِغَةِ وَ كَانَ الرَّجُلُ مِمَّنْ يَرْجُو نَوَافِلَهُ وَ يُؤَمِّلُ نَائِلَهُ وَ رِفْدَهُ وَ كَانَ لَا يَسْأَلُ عَلِيّاً ( عليه السلام ) وَ لَا غَيْرَهُ شَيْئاً فَقَالَ رَجُلٌ  لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) وَ اللَّهِ مَا سَأَلَكَ فُلَانٌ وَ لَقَدْ كَانَ يُجْزِئُهُ مِنَ الْخَمْسَةِ الْأَوْسَاقِ وَسْقٌ وَاحِدٌ",
          "فَقَالَ لَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) لَا كَثَّرَ اللَّهُ فِي الْمُؤْمِنِينَ ضَرْبَكَ أُعْطِي أَنَا وَ تَبْخَلُ أَنْتَ لِلَّهِ أَنْتَ إِذَا أَنَا لَمْ أُعْطِ الَّذِي يَرْجُونِي إِلَّا مِنْ بَعْدِ الْمَسْأَلَةِ ثُمَّ أُعْطِيهِ بَعْدَ الْمَسْأَلَةِ فَلَمْ أُعْطِهِ ثَمَنَ مَا أَخَذْتُ مِنْهُ وَ ذَلِكَ لِأَنِّي عَرَّضْتُهُ أَنْ يَبْذُلَ لِي وَجْهَهُ الَّذِي يُعَفِّرُهُ فِي التُّرَابِ لِرَبِّي وَ رَبِّهِ عِنْدَ تَعَبُّدِهِ لَهُ وَ طَلَبِ حَوَائِجِهِ إِلَيْهِ",
          "فَمَنْ فَعَلَ هَذَا بِأَخِيهِ الْمُسْلِمِ وَ قَدْ عَرَفَ أَنَّهُ مَوْضِعٌ لِصِلَتِهِ وَ مَعْرُوفِهِ فَلَمْ يُصَدِّقِ اللَّهَ عَزَّ وَ جَلَّ فِي دُعَائِهِ لَهُ حَيْثُ يَتَمَنَّى لَهُ الْجَنَّةَ بِلِسَانِهِ وَ يَبْخَلُ عَلَيْهِ بِالْحُطَامِ مِنْ مَالِهِ وَ ذَلِكَ أَنَّ الْعَبْدَ قَدْ يَقُولُ فِي دُعَائِهِ اللَّهُمَّ اغْفِرْ لِلْمُؤْمِنِينَ وَ الْمُؤْمِنَاتِ فَإِذَا دَعَا لَهُمْ بِالْمَغْفِرَةِ فَقَدْ طَلَبَ لَهُمُ الْجَنَّةَ فَمَا أَنْصَفَ مَنْ فَعَلَ هَذَا بِالْقَوْلِ وَ لَمْ يُحَقِّقْهُ بِالْفِعْلِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Haroun Bin Muslim, from Mas’ada Bin sadaqa, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that Amir Al-Momineen<sup>asws</sup> sent five baskets of Al-Bagheyba dates to a man, and the man was from the ones who hoped for his<sup>saww</sup> voluntary gifts and hoped for attaining these, and his<sup>asws</sup> support, and he did not used to ask Ali<sup>asws</sup> for something nor anyone else. A man said to Amir Al-Momineen<sup>asws</sup>, ‘By Allah<sup>azwj</sup>! So and so has not (even) asked you<sup>asws</sup>, and it would have sufficed him had it been one basket rather than the five (you<sup>asws</sup> have given to him)’. ",
            "So Amir Al-Momineen<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> not Make the likes of you to be among the Believers! Why are you exercising the stinginess while I<sup>asws</sup> am the (one<sup>asws</sup> who is) giving it? ",
            "For the Sake of Allah<sup>azwj</sup>! You, (listen)!  If I give charity to a person who expects to receive charity from me only after his request, I, in fact, have not given him the cost of what I have already taken from him.  Such cost is my compelling him to risk the dignity of his face, which he places on the ground before my Lord<sup>azwj</sup> and his Lord<sup>azwj</sup> during his worship and his appeal before Him<sup>azwj</sup> for his needs. ",
            "With this kind of dealing with a Muslim whom one knows as deserving of one’s charity and gifs, one has not proved oneself as truthful before Allah<sup>azwj</sup>, in one’s prayer when one appeals verbally before Allah to admit one’s Muslim brother into Paradise.  On the other hand, one exercises stinginess in matters of worthless belongings.  This happens when a servant of Allah says in his prayer: O Allah, Grant forgiveness to male and female believers.  Appealing for forgiveness is asking Paradise for male and female believers.  It is unjust not to support one’s words with one’s deeds."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from Harun ibn Muslim from Mas’adah ibn Sadaqah who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that once, ’Amir al-Mu’minin, ‘Alayhi al-Salam, decided to give five Awsaq (a certain amount of) dates from al-Bughaybighah (a place in al-Madinah) to a man who had hoped to benefit from the generosity of the Imam and his gifts. However, he would not appeal before the Imam or other people for any help. A man said to ’Amir al-Mu’minin, ‘Alayhi al- Salam, ‘This man has not appealed before you. One is enough for him instead of five Awsaq.’ ’Amir al-Mu’minin then said, ‘I wish Allah will not create more people like you among the believers. Why do you exercise stinginess about the charity that I have decided to give to a needy person? You must take notice, for the sake of Allah! If I give charity to a person who expects to receive charity from me only after his appeal, I, in fact, have not given him the cost of what I have already taken from him. Such cost is my causing him to risk the dignity of his face, which he places on the ground before my Lord and his Lord during his worship and his appeal before Him for his needs. With this kind of dealing with a Muslim whom one knows as deserving of one’s charity and gifts, one has not proved oneself as truthful before Allah, the Most Majestic, the Most Glorious, in one’s prayer when one appeals verbally before Allah to admit one’s Muslim brother into Paradise. On the other hand, one exercises stinginess in matters of worthless worldly belongings. This happens when a servant of Allah says in his prayer, ‘O Allah, grant forgiveness to male and female believers.’ Appealing for forgiveness is asking Paradise for male and female believers. It is unjust not to support one’s words with one’s deeds.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/150)"
        ],
        "index": 6054,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/16",
              "text": "أَحْمَدُ بْنُ إِدْرِيسَ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/110",
              "text": "غَيْرُهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1027",
              "text": "مُحَمَّدِ بْنِ أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3277",
              "text": "أَحْمَدَ بْنِ نُوحِ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3278",
              "text": "الذُّهْلِيِّ رَفَعَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ إِدْرِيسَ وَ غَيْرُهُ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ أَحْمَدَ بْنِ نُوحِ بْنِ عَبْدِ اللَّهِ عَنِ الذُّهْلِيِّ رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:19:2",
        "text": [
          " الْمَعْرُوفُ ابْتِدَاءٌ وَ أَمَّا مَنْ أَعْطَيْتَهُ بَعْدَ الْمَسْأَلَةِ فَإِنَّمَا كَافَيْتَهُ بِمَا بَذَلَ لَكَ مِنْ وَجْهِهِ يَبِيتُ لَيْلَتَهُ أَرِقاً مُتَمَلْمِلًا يَمْثُلُ بَيْنَ الرَّجَاءِ وَ الْيَأْسِ لَا يَدْرِي أَيْنَ يَتَوَجَّهُ لِحَاجَتِهِ ثُمَّ يَعْزِمُ بِالْقَصْدِ لَهَا فَيَأْتِيكَ وَ قَلْبُهُ يَرْجُفُ وَ فَرَائِصُهُ تَرْعُدُ قَدْ تَرَى دَمَهُ فِي وَجْهِهِ لَا يَدْرِي أَ يَرْجِعُ بِكَأْبَةٍ أَمْ بِفَرَحٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, and someone else, from Muhammad Bin Ahmad, from Ahmad Bin Nuh Bin Abdullah, from Al Zahly, raising it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The goodness, initiate it, and as for the one who gives it after the asking, so rather he has sufficed him after him having sacrificed his face for you, having spent his night swearing, restless, staying between the hope and the despair, not knowing where to face for his needs. Then he determined to go for it, so he came to you and his heart was quivering and his body was shaking, and you would have seen his blood in his face, not knowing whether he would be returning with gloom or with happiness’."
          ],
          "en.sarwar": [
            "2. Ahmad ibn Idris and others have narrated from Muhammad ibn Ahmad from Ahmad ibn Nuh ibn ‘Abd Allah from al-Dhuhliy in a marfu‘ who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that charity is that which is given before an appeal by the recipient. Giving charity after an appeal by the recipient is compensation for using the dignity of his face when he appealed and his passing the night worried and anxious in hope and despair without knowing which direction to go for his needs. He then decides to come before you with his heart beating fast and his muscles shaking. You can see (the color of) his blood on his face. He does not know whether he will turn back sadly or with happiness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/151)"
        ],
        "index": 6055,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2274",
              "text": "مُحَمَّدِ بْنِ صَنْدَلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1435",
              "text": "يَاسِرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2275",
              "text": "الْيَسَعِ بْنِ حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ صَنْدَلٍ عَنْ يَاسِرٍ عَنِ الْيَسَعِ بْنِ حَمْزَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:19:3",
        "text": [
          " كُنْتُ فِي مَجْلِسِ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) أُحَدِّثُهُ وَ قَدِ اجْتَمَعَ إِلَيْهِ خَلْقٌ كَثِيرٌ يَسْأَلُونَهُ عَنِ الْحَلَالِ وَ الْحَرَامِ إِذْ دَخَلَ عَلَيْهِ رَجُلٌ طُوَالٌ آدَمُ فَقَالَ السَّلَامُ عَلَيْكَ يَا ابْنَ رَسُولِ اللَّهِ رَجُلٌ مِنْ مُحِبِّيكَ وَ مُحِبِّي آبَائِكَ وَ أَجْدَادِكَ ( عليهم السلام ) مَصْدَرِي مِنَ الْحَجِّ وَ قَدِ افْتَقَدْتُ نَفَقَتِي وَ مَا مَعِي مَا أَبْلُغُ مَرْحَلَةً فَإِنْ رَأَيْتَ أَنْ تُنْهِضَنِي إِلَى بَلَدِي وَ لِلَّهِ عَلَيَّ نِعْمَةٌ فَإِذَا بَلَغْتُ بَلَدِي تَصَدَّقْتُ بِالَّذِي تُوَلِّينِي عَنْكَ فَلَسْتُ مَوْضِعَ صَدَقَةٍ ",
          "فَقَالَ لَهُ اجْلِسْ رَحِمَكَ اللَّهُ وَ أَقْبَلَ عَلَى النَّاسِ يُحَدِّثُهُمْ حَتَّى تَفَرَّقُوا وَ بَقِيَ هُوَ وَ سُلَيْمَانُ الْجَعْفَرِيُّ وَ خَيْثَمَةُ وَ أَنَا فَقَالَ أَ تَأْذَنُونَ لِي فِي الدُّخُولِ فَقَالَ لَهُ سُلَيْمَانُ قَدَّمَ اللَّهُ أَمْرَكَ فَقَامَ فَدَخَلَ الْحُجْرَةَ وَ بَقِيَ سَاعَةً ثُمَّ خَرَجَ وَ رَدَّ الْبَابَ وَ أَخْرَجَ يَدَهُ مِنْ أَعْلَى الْبَابِ وَ قَالَ أَيْنَ الْخُرَاسَانِيُّ فَقَالَ هَا أَنَا ذَا فَقَالَ خُذْ هَذِهِ الْمِائَتَيْ دِينَارٍ وَ اسْتَعِنْ بِهَا فِي مَئُونَتِكَ وَ نَفَقَتِكَ وَ تَبَرَّكْ بِهَا وَ لَا تَصَدَّقْ بِهَا عَنِّي وَ اخْرُجْ فَلَا أَرَاكَ وَ لَا تَرَانِي",
          "ثُمَّ خَرَجَ فَقَالَ لَهُ سُلَيْمَانُ جُعِلْتُ فِدَاكَ لَقَدْ أَجْزَلْتَ وَ رَحِمْتَ فَلِمَا ذَا سَتَرْتَ وَجْهَكَ عَنْهُ فَقَالَ مَخَافَةَ أَنْ أَرَى ذُلَّ السُّؤَالِ فِي وَجْهِهِ لِقَضَائِي حَاجَتَهُ أَ مَا سَمِعْتَ حَدِيثَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) الْمُسْتَتِرُ بِالْحَسَنَةِ يَعْدِلُ سَبْعِينَ حَجَّةً وَ الْمُذِيعُ بِالسَّيِّئَةِ مَخْذُولٌ وَ الْمُسْتَتِرُ بِهَا مَغْفُورٌ لَهُ أَ مَا سَمِعْتَ قَوْلَ الْأُوَلِ : مَتَى آتِهِ يَوْماً لِأَطْلُبَ حَاجَةً * رَجَعْتُ إِلَى أَهْلِي وَ وَجْهِي بِمَائِهِ"
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Sandal, from Yasser, from Al Yas’a Bin Hamza who said, ",
            "‘I was in a gathering of Abu Al-Hassan Al-Reza<sup>asws</sup>, discussing with him<sup>asws</sup>, and there had gathered a lot of people to him<sup>asws</sup>, asking him<sup>asws</sup> about the Permissible and the Prohibitions, when a tall, fair man entered and said, ‘Greetings be unto you<sup>asws</sup>, O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! I am a man from those that love you<sup>asws</sup>, and love your<sup>asws</sup> forefathers<sup>asws</sup>, coming back from the Hajj, and my expenses are lost and there is nothing with me to be able to reach my destination. ",
            "So if you<sup>asws</sup> see fit, advance me to my city. By Allah<sup>azwj</sup>, it would be a favour upon me. So when I reach my city, I would give in charity with that which you<sup>asws</sup> ask me for, on your<sup>asws</sup> behalf, for I am not a (deserving) recipient of charity’.",
            "So he<sup>asws</sup> said to him: ‘Be seated, may Allah<sup>azwj</sup> have Mercy on you!’, and he<sup>asws</sup> turned towards the people, narrating to them, until they dispersed, and there remained him, and Suleman Al-Ja’fary, and Khaysama, and myself. So he<sup>asws</sup> said: ‘Are you all allowing me<sup>asws</sup> to go inside?’ So Suleyman said to him<sup>asws</sup>, ‘Allah<sup>azwj</sup> has given priority to your<sup>asws</sup> matters’. So he<sup>asws</sup> arose and entered the chamber and remained there for a while. Then he<sup>asws</sup> came out and kept the door closed, and brought out his<sup>asws</sup> hand from the top of the door and said: ‘Where is the Khurasany man?’ So he said, ‘Here I am that one’. So he<sup>asws</sup> said: ‘Take these two hundred Dinars and be assisted by it in your provisions and your expenses and be Blessed by it, and do not give charity with it on my<sup>asws</sup> behalf, and go, so that I<sup>asws</sup> do not see you and nor do you look at me<sup>asws</sup>’. ",
            "Then he<sup>asws</sup> came out. So Suleyman said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! You<sup>asws</sup> have been generous and merciful, so what was that you<sup>asws</sup> veiling your<sup>asws</sup> face from him?’ So he<sup>asws</sup> said: ‘Out of fear that I<sup>asws</sup> might see the disgrace of asking in his face to fulfil his need. Have you not heard a Hadeeth of Rasool-Allah<sup>saww</sup>: ‘The veiled one with the good deeds would be equated with seventy Hajj, and the broadcaster with the sins would be forsaken, and the veiler with it is Forgiven for it? Have you not heard the former words, ‘Whenever I go to Him<sup>azwj</sup> to seek a need, I return home without any damage to the dignity of my face’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Muhammad ibn Sandal from Yasir from al-Yasa’ ibn Hamzah who has said the following: “Once I was in the presence of abu al-Hassan al-Rida, ‘Alayhi al-Salam, and I was speaking to him before a large gathering that wanted to ask him about lawful and unlawful matters. At such time, a tall man of fair complexion came in and offered his greetings of peace, addressing the Imam as ‘O child of the Messenger of Allah, I am from those who love you and your ancestors. I am coming from Hajj. I have lost my supplies as well as whatever was with me. I cannot reach my destination. If you consider it proper, help me so I can go home. It will be a great favor to me. When I arrive home, I will give as charity whatever amount you ask me to give; I am an undeserving recipient of charity.’ The Imam said, ‘Sit down. May Allah grant you blessing.’ He then spoke to people until they left. Only he (the Imam), Sulayman al-Ja’fariy, Khaythamah and I remained. The Imam then asked, ‘Can I go inside?’ Sulayman said, ‘Allah has already given priority to your affairs.’ He went inside where he remained for a while before he came out and closed the door. He then stretched his hand from the top of the door and said, ‘Where is the man from Khuransan?’ The man replied, ‘Here I am.’ The Imam said, ‘Get this two hundred dinar, use it for expenses and enjoy its blessings. You must not give any charity on my behalf. You may leave before I see you or you see me.’ Then the Imam came out, and Sulayman said, ‘I pray to Allah to keep my soul in service for your cause, you have been generous and kind to him. Why did you hide your face from him?’ The Imam replied, ‘I was afraid to see the effect of humiliation on his face due to appealing for help. Consider the words of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, that say, “Giving charity out of public sight is equal in reward to seventy times performing Hajj. One who publicizes sins is disgraced, and those who do not do so are granted forgiveness.” Consider the words of the people who lived long before: “Whenever during a day I come to him to appeal for help, I return home without any damage to the dignity of my face.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/151)"
        ],
        "index": 6056,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/3279",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ بِإِسْنَادٍ ذَكَرَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3280",
              "text": "الْحَارِثِ الْهَمْدَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ بِإِسْنَادٍ ذَكَرَهُ عَنِ الْحَارِثِ الْهَمْدَانِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:19:4",
        "text": [
          " سَامَرْتُ أَمِيرَ الْمُؤْمِنِينَ صَلَوَاتُ اللَّهِ عَلَيْهِ فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ عَرَضَتْ لِي حَاجَةٌ قَالَ فَرَأَيْتَنِي لَهَا أَهْلًا قُلْتُ نَعَمْ يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ جَزَاكَ اللَّهُ عَنِّي خَيْراً ثُمَّ قَامَ إِلَى السِّرَاجِ فَأَغْشَاهَا وَ جَلَسَ ثُمَّ قَالَ إِنَّمَا أَغْشَيْتُ السِّرَاجَ لِئَلَّا أَرَى ذُلَّ حَاجَتِكَ فِي وَجْهِكِ فَتَكَلَّمْ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) يَقُولُ الْحَوَائِجُ أَمَانَةٌ مِنَ اللَّهِ فِي صُدُورِ الْعِبَادِ فَمَنْ كَتَمَهَا كُتِبَتْ لَهُ عِبَادَةٌ وَ مَنْ أَفْشَاهَا كَانَ حَقّاً عَلَى مَنْ سَمِعَهَا أَنْ يَعْنِيَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, by a chain mentioning from Al Haaris Al Hamadany who said, ",
            "‘I was talking to Amir Al-Momineen<sup>asws</sup>, so I said, ‘O Amir Al-Momineen<sup>asws</sup>! A need has presented itself to me’. He<sup>asws</sup> said: ‘So you view me<sup>asws</sup> as a rightful one for it?’ I said, ‘Yes, O Amir Al-Momineen<sup>asws</sup>!’. He<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> Recompense you goodly from me<sup>asws</sup>’. Then he<sup>asws</sup> arose to the lantern, so he<sup>asws</sup> extinguished it and sat down, then said: ‘But rather, I<sup>asws</sup> extinguished the lantern perhaps I<sup>asws</sup> would see the humiliation of your need in your face, so speak, for I<sup>asws</sup> heard Rasool-Allah<sup>saww</sup> saying: ‘The needs are an entrustment from Allah<sup>azwj</sup> in the chests of the servants, so the one who conceals it, a worship would be Written for him, and the one who exposes it, it would be a right upon the one who hears it that he assists him’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from his sources, which he has mentioned, from af-Hur af-Hamadaniy who has said the following: “Once, I was speaking to ’Amir al-Mu’minin, ‘Alayhi al-Salam, and said, ‘O ’Amir al-Mu’minin, I need something.’ He said, ‘Do you think I can help you?’ I replied, ‘Yes, O ’Amir al-Mu’minin.’ He said, ‘May Allah grant you good reward on my behalf.’ He then went to the lantern and turned it off, sat down and said, ‘I turned the lantern off so I cannot see the effect of humiliation due to your appeal for help on your face as you speak. I have heard the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, say, “Needs are trust of Allah in His servants’ chests. For those who keep such trust out of public sight, the reward for worship is written for them; for those who make such trust public, it then becomes necessary for those who come to know it to help.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/152)"
        ],
        "index": 6057,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3281",
              "text": "مُحَمَّدِ بْنِ أَبِي الْأَصْبَغِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3282",
              "text": "بُنْدَارَ بْنِ عَاصِمٍ رَفَعَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ أَبِي الْأَصْبَغِ عَنْ بُنْدَارَ بْنِ عَاصِمٍ رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:19:5",
        "text": [
          " قَالَ مَا تَوَسَّلَ إِلَيَّ أَحَدٌ بِوَسِيلَةٍ وَ لَا تَذَرَّعَ بِذَرِيعَةٍ أَقْرَبَ لَهُ إِلَى مَا يُرِيدُهُ مِنِّي مِنْ رَجُلٍ سَلَفَ إِلَيْهِ مِنِّي يَدٌ أَتْبَعْتُهَا أُخْتَهَا وَ أَحْسَنْتُ رَبَّهَا فَإِنِّي رَأَيْتُ مَنْعَ الْأَوَاخِرِ يَقْطَعُ لِسَانَ شُكْرِ الْأَوَائِلِ وَ لَا سَخَتْ نَفْسِي بِرَدِّ بِكْرِ الْحَوَائِجِ وَ قَدْ قَالَ الشَّاعِرُ : ",
          "وَ إِذَا بُلِيتَ بِبَذْلِ وَجْهِكَ سَائِلًا * فَابْذُلْهُ لِلْمُتَكَرِّمِ الْمِفْضَالِ‏  -إِنَّ الْجَوَادَ إِذَا حَبَاكَ بِمَوْعِدٍ * أَعْطَاكَهُ سَلِساً بِغَيْرِ مِطَالٍ‏ - وَ إِذَا السُّؤَالُ مَعَ النَّوَالِ قَرَنْتَهُ * رَجَحَ السُّؤَالُ وَ خَفَّ كُلُّ نَوَالٍ"
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Abu Al Asbagh, from Bundar Bin Aasim, raising it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> has said: ‘the best means and recourse of approaching me for help is the appeal of a man who has received help from me once, then asks for help again. My hands have done a good deed for him before the Lord<sup>azwj</sup>.  I have found denying a later appeal for help cuts off the appreciation for the favour already received.  I dislike for my soul to deny help for the second time, which may cause to discontinue the appreciation for the earlier help and favour. It is just like a poet has said:  If you face to risk the dignity of your face, you should face such risk before a king and generous person.  If a generous person promises to do a favour to you and he does it in time without any delays; and if he favour come as soon as an appeal is made, the appeal become more preferable than the favour.‘",
            "And when your face is afflicted with the humiliation of asking, so humiliate it for the generous one, the graceful – the benevolent one, when he gifts to you with a promise, he would give it to you smoothly, without delay – and when asking is with the attaining, paired up, the asking overweighs and everything attained becomes lighter’’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn abu al-Asbagh from Bandar ibn ‘Asem in a marfu‘ manner who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the best means and recourse of approaching me for help is the appeal of a man who has received help from me once, then asks for help again. My hands have done a good deed for him before the Lord. I have found denying a later appeal for help cuts off the appreciation for the favor already received. I dislike for my soul to deny help for the second time, which may cause to discontinue the appreciation for the earlier help and favor. It is just as the poet has said: “If you face to risk the dignity of your face, you should face such risk before a kind and generous person. If a generous person promises to do a favor for you and he does it in time without any delays; and if the favor comes as soon as an appeal is made, the appeal becomes more preferable than the favor.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:1:19",
  "kind": "verse_list"
}