{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:4:1", "titles": {"ar": "كِتَابُ الزَّكَاةِ", "en": "THE BOOK OF ZAKAAT"}}, {"indexed_titles": {"en": "Chapter 22"}, "path": "/books/al-kafi:4:1:22", "titles": {"ar": "بَابٌ مِنْهُ", "en": "Chapter 69 – A chapter from it"}}], "index": 839, "local_index": 22, "part_type": "Chapter", "path": "/books/al-kafi:4:1:22", "titles": {"ar": "بَابٌ مِنْهُ", "en": "Chapter 69 – A chapter from it"}, "verse_count": 1, "verse_start_index": 6072, "verses": [{"index": 6073, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:1:22:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَبْدِ اللَّهِ بْنِ الدِّهْقَانِ عَنْ دُرُسْتَ بْنِ أَبِي مَنْصُورٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ صَلَوَاتُ اللَّهِ عَلَيْهِ يَقُولُ مَنْ صَنَعَ بِمِثْلِ مَا صُنِعَ إِلَيْهِ فَإِنَّمَا كَافَأَهُ وَ مَنْ أَضْعَفَهُ كَانَ شَكُوراً وَ مَنْ شَكَرَ كَانَ كَرِيماً \nوَ مَنْ عَلِمَ أَنَّ مَا صَنَعَ إِنَّمَا صَنَعَ إِلَى نَفْسِهِ لَمْ يَسْتَبْطِ النَّاسَ فِي شُكْرِهِمْ وَ لَمْ يَسْتَزِدْهُمْ فِي مَوَدَّتِهِمْ فَلَا تَلْتَمِسْ مِنْ غَيْرِكَ شُكْرَ مَا أَتَيْتَ إِلَى نَفْسِكَ وَ وَقَيْتَ بِهِ عِرْضَكَ وَ اعْلَمْ أَنَّ الطَّالِبَ إِلَيْكَ الْحَاجَةَ لَمْ يُكْرِمْ وَجْهَهُ عَنْ وَجْهِكَ فَأَكْرِمْ وَجْهَكَ عَنْ رَدِّهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Abdullah Bin Al Dahqaan, from Dorost Bin Abu Mansour, from Umar Bin Azina, from Zurara, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> was saying: ‘The one who does (a favour) similar to what is done to him, so rather he has sufficed it; and the one who increases it would be grateful, and the one who is grateful would be benevolent. \nAnd the one who knows that the favour the has does is for his own sake will have people than him immediately, but it does not increase their love for him.  One should not expect thanks from others for what one has does for his own sake to protect one’s dignity.  You should note that one seeking help from you has not spared the dignity of his face, thus you should spare the dignity of your face by not turning him away empty handed."}]}]}, "index": "al-kafi:4:1:22", "kind": "verse_list"}