{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 26"
        },
        "path": "/books/al-kafi:4:1:26",
        "titles": {
          "ar": "بَابُ وَضْعِ الْمَعْرُوفِ مَوْضِعَهُ",
          "en": "Chapter 73 – Placing the act of kindness it its (appropriate) place"
        }
      }
    ],
    "index": 843,
    "local_index": 26,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 27"
        },
        "path": "/books/al-kafi:4:1:27",
        "titles": {
          "ar": "بَابٌ فِي آدَابِ الْمَعْرُوفِ",
          "en": "Chapter 74 – Ettiquettes of the acts of kindness"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 25"
        },
        "path": "/books/al-kafi:4:1:25",
        "titles": {
          "ar": "بَابُ تَمَامِ الْمَعْرُوفِ",
          "en": "Chapter 72 – Completion of the act of kindness"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:1:26",
    "titles": {
      "ar": "بَابُ وَضْعِ الْمَعْرُوفِ مَوْضِعَهُ",
      "en": "Chapter 73 – Placing the act of kindness it its (appropriate) place"
    },
    "verse_count": 5,
    "verse_start_index": 6082,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/158)"
        ],
        "index": 6083,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/27",
              "text": "سَيْفِ بْنِ عَمِيرَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ سَيْفِ بْنِ عَمِيرَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:26:1",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لِمُفَضَّلِ بْنِ عُمَرَ يَا مُفَضَّلُ إِذَا أَرَدْتَ أَنْ تَعْلَمَ أَ شَقِيٌّ الرَّجُلُ أَمْ سَعِيدٌ فَانْظُرْ سَيْبَهُ وَ مَعْرُوفَهُ إِلَى مَنْ يَصْنَعُهُ فَإِنْ كَانَ يَصْنَعُهُ إِلَى مَنْ هُوَ أَهْلُهُ فَاعْلَمْ أَنَّهُ إِلَى خَيْرٍ وَ إِنْ كَانَ يَصْنَعُهُ إِلَى غَيْرِ أَهْلِهِ فَاعْلَمْ أَنَّهُ لَيْسَ لَهُ عِنْدَ اللَّهِ خَيْرٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Sayf Bin Ameyra who said, ",
            "‘Abu Abdullah<sup>asws</sup> said to Mufazal Bin Umar: ‘O Mufazzal! Whenever you want to know whether the man is a wretch or a fortunate one, so look at his abandoning and his kindness, to whom he is doing it to. So if he was offering it to the one who was deserving it, so know that he is upon goodness; but if he was extending it to other than its deserving one, so know that there is no goodness for him in the Presence of Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Sayf ibn ‘Ami rah who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, once said to Mufaddal ibn ’Umar, ’O Mufaddal, if you want to know whether a man is the most wicked or most fortunate, find out to whom he provides Benevolent Assistance. If he finds a properly deserving recipient, it is information for you that good consequences await him; if he provides Benevolent Assistance to those who do not deserve it, notice that there is not anything good for him before Allah.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/159)"
        ],
        "index": 6084,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/31",
              "text": "مُحَمَّدِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/81",
              "text": "مُفَضَّلِ بْنِ عُمَرَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ مُفَضَّلِ بْنِ عُمَرَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:26:2",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا مُفَضَّلُ إِذَا أَرَدْتَ أَنْ تَعْلَمَ إِلَى خَيْرٍ يَصِيرُ الرَّجُلُ أَمْ إِلَى شَرٍّ انْظُرْ أَيْنَ يَضَعُ مَعْرُوفَهُ فَإِنْ كَانَ يَضَعُ مَعْرُوفَهُ عِنْدَ أَهْلِهِ فَاعْلَمْ أَنَّهُ يَصِيرُ إِلَى خَيْرٍ وَ إِنْ كَانَ يَضَعُ مَعْرُوفَهُ عِنْدَ غَيْرِ أَهْلِهِ فَاعْلَمْ أَنَّهُ لَيْسَ لَهُ فِي الْآخِرَةِ مِنْ خَلَاقٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Sinan, from Mufazzal Bin Umar who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘O Mufazzal! Whenever you want to know whether the man is going towards the goodness or towards the evil, look at where he places his act of kindness. So if he was doing his act of kindness with the one who was deserving of it, so know that he is going towards the goodness, but if he were to extend his act of kindness with other than its deserving one, so know that there is nothing for him in the Hereafter from the Creator’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from Mufaddal ibn ‘Umar who has said the following: “Abu ’Abd Allah, ‘Alayhi al-Salam, once said to me, ‘O Mufaddal, if you want to know whether a man ends up as good or wicked, consider where he places his Benevolent Assistance. If he provides such assistance for a properly deserving recipient, he is headed toward a good direction; if he provides it for an undeserving recipient, then that is proof that there is not anything for him on the Day of Judgment.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/159)"
        ],
        "index": 6085,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/434",
              "text": "أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/180",
              "text": "مُحَمَّدِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2853",
              "text": "أَحْمَدَ بْنِ عَمْرِو بْنِ سُلَيْمَانَ الْبَجَلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2854",
              "text": "إِسْمَاعِيلَ بْنِ الْحَسَنِ بْنِ إِسْمَاعِيلَ بْنِ شُعَيْبِ بْنِ مِيثَمٍ التَّمَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2855",
              "text": "إِبْرَاهِيمَ بْنِ إِسْحَاقَ الْمَدَائِنِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/134",
              "text": "رَجُلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2856",
              "text": "أَبِي مِخْنَفٍ الْأَزْدِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ أَحْمَدَ بْنِ عَمْرِو بْنِ سُلَيْمَانَ الْبَجَلِيِّ عَنْ إِسْمَاعِيلَ بْنِ الْحَسَنِ بْنِ إِسْمَاعِيلَ بْنِ شُعَيْبِ بْنِ مِيثَمٍ التَّمَّارِ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ الْمَدَائِنِيِّ عَنْ رَجُلٍ عَنْ أَبِي مِخْنَفٍ الْأَزْدِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:26:3",
        "text": [
          " أَتَى أَمِيرَ الْمُؤْمِنِينَ صَلَوَاتُ اللَّهِ عَلَيْهِ رَهْطٌ مِنَ الشِّيعَةِ فَقَالُوا يَا أَمِيرَ الْمُؤْمِنِينَ لَوْ أَخْرَجْتَ هَذِهِ الْأَمْوَالَ فَفَرَّقْتَهَا فِي هَؤُلَاءِ الرُّؤَسَاءِ وَ الْأَشْرَافِ وَ فَضَّلْتَهُمْ عَلَيْنَا حَتَّى إِذَا اسْتَوْسَقَتِ الْأُمُورُ عُدْتَ إِلَى أَفْضَلِ مَا عَوَّدَكَ اللَّهُ مِنَ الْقَسْمِ بِالسَّوِيَّةِ وَ الْعَدْلِ فِي الرَّعِيَّةِ ",
          "فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَ تَأْمُرُونِّي وَيْحَكُمْ أَنْ أَطْلُبَ النَّصْرَ بِالظُّلْمِ وَ الْجَوْرِ فِيمَنْ وُلِّيتُ عَلَيْهِ مِنْ أَهْلِ الْإِسْلَامِ لَا وَ اللَّهِ لَا يَكُونُ ذَلِكَ مَا سَمَرَ السَّمِيرُ وَ مَا رَأَيْتُ فِي السَّمَاءِ نَجْماً وَ اللَّهِ لَوْ كَانَتْ أَمْوَالُهُمْ مَالِي لَسَاوَيْتُ بَيْنَهُمْ فَكَيْفَ وَ إِنَّمَا هِيَ أَمْوَالُهُمْ",
          "قَالَ ثُمَّ أَزَمَ سَاكِتاً طَوِيلًا ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ مَنْ كَانَ فِيكُمْ لَهُ مَالٌ فَإِيَّاهُ وَ الْفَسَادَ فَإِنَّ إِعْطَاءَهُ فِي غَيْرِ حَقِّهِ تَبْذِيرٌ وَ إِسْرَافٌ وَ هُوَ يَرْفَعُ ذِكْرَ صَاحِبِهِ فِي النَّاسِ وَ يَضَعُهُ عِنْدَ اللَّهِ وَ لَمْ يَضَعِ امْرُؤٌ مَالَهُ فِي غَيْرِ حَقِّهِ وَ عِنْدَ غَيْرِ أَهْلِهِ إِلَّا حَرَمَهُ اللَّهُ شُكْرَهُمْ وَ كَانَ لِغَيْرِهِ وُدُّهُمْ فَإِنْ بَقِيَ مَعَهُ مِنْهُمْ بَقِيَّةٌ مِمَّنْ يُظْهِرُ الشُّكْرَ لَهُ وَ يُرِيهِ النُّصْحَ فَإِنَّمَا ذَلِكَ مَلَقٌ مِنْهُ وَ كَذِبٌ فَإِنْ زَلَّتْ بِصَاحِبِهِمُ النَّعْلُ ثُمَّ احْتَاجَ إِلَى مَعُونَتِهِمْ وَ مُكَافَأَتِهِمْ فَأَلْأَمُ خَلِيلٍ وَ شَرُّ خَدِينٍ",
          "وَ لَمْ يَضَعِ امْرُؤٌ مَالَهُ فِي غَيْرِ حَقِّهِ وَ عِنْدَ غَيْرِ أَهْلِهِ إِلَّا لَمْ يَكُنْ لَهُ مِنَ الْحَظِّ فِيمَا أُتِيَ إِلَّا مَحْمَدَةُ اللِّئَامِ وَ ثَنَاءُ الْأَشْرَارِ مَا دَامَ عَلَيْهِ مُنْعِماً مُفْضِلًا وَ مَقَالَةُ الْجَاهِلِ مَا أَجْوَدَهُ وَ هُوَ عِنْدَ اللَّهِ بَخِيلٌ ",
          "فَأَيُّ حَظٍّ أَبْوَرُ وَ أَخْسَرُ مِنْ هَذَا الْحَظِّ وَ أَيُّ فَائِدَةِ مَعْرُوفٍ أَقَلُّ مِنْ هَذَا الْمَعْرُوفِ فَمَنْ كَانَ مِنْكُمْ لَهُ مَالٌ فَلْيَصِلْ بِهِ الْقَرَابَةَ وَ لْيُحْسِنْ مِنْهُ الضِّيَافَةَ وَ لْيَفُكَّ بِهِ الْعَانِيَ وَ الْأَسِيرَ وَ ابْنَ السَّبِيلِ فَإِنَّ الْفَوْزَ بِهَذِهِ الْخِصَالِ مَكَارِمُ الدُّنْيَا وَ شَرَفُ الْآخِرَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Muhammad Bin Ali, from Ahmad Bin Amro Bin Suleyman Al bajaly, from Ismail Bin Al Hassan Bin Ismail Bin Shuayb Bin Maysam Al Tammar, from Ibrahim Bin Is’haq Al Madainy, form a man, from Abu Mikhnaf Al Azdy who said, ",
            "‘A group of Shias came to Amir Al-Momineen<sup>asws</sup>, so they said, ‘O Amir Al-Momineen<sup>asws</sup>! We request you to distribute the wealth at your disposal (public treasury) among the chiefs and elite people. In so doing, they will receive preference, which will strengthen your affairs (government).  Thereafter, you can reassume your rule of equal distribution of the treasury among people as Allah<sup>azwj</sup> has Commanded you to do’.  ",
            "So Amir Al-Momineen<sup>asws</sup> said: ‘Are you instructing me<sup>asws</sup>, woe be unto you all, that I<sup>asws</sup> should seek the victory by the injustices and the tyranny among the ones whom I<sup>asws</sup> rule upon, from the people of Al-Islam? No, by Allah<sup>azwj</sup>! That will not happen for as long as the night-talker converses and a star is not seen in the sky. By Alah<sup>azwj</sup>! If their wealth was my<sup>asws</sup> wealth, I<sup>asws</sup> would have equalised between them, so how can I<sup>asws</sup> (do what you are asking me to do) and rather it is their wealth? ",
            "He (the narrator) said, ‘Then he<sup>asws</sup> was silent for a long while, then raised his<sup>asws</sup> head, so he<sup>asws</sup> said: ‘The one among you for whom there is wealth, so he should beware of the corruption. So if he were to give it in other than its rightful management, and extravagance, and its doer would raise his mention among the people and he would waste it in the Presence of Allah<sup>azwj</sup>, and he would not place the matter of his wealth in other than its rightful place and with other than its deserving one except that Allah<sup>azwj</sup> would Prohibit their gratefulness, and their cordiality would be for other than him. So, even if there were to remain with him from the ones who manifest the gratefulness for him and show him good advice, so rather that would be flattery from him and a lie. So if his slipper breaks, then he is needy to their assistance and their return of favour, so he would be an accused friend and a evil companion. ",
            "And he would not place the matter of his wealth in other than its rightful place and with other than its deserving ones except that there would not happen to be a share for him regarding what comes except for the praise of the villains and praise of the evil ones for as long as he is bountiful upon them with grace, and the speech of the ignorant makes him to be a benevolent one and in the Presence of Allah<sup>azwj</sup> he is a stingy one. ",
            "So which share is more wicked and loss-making than this share, and which benefit is less in goodness than this goodness. So the one among you who has wealth for him, so let him give it to his relatives, and let him do good from it with the guests, and let him relieve the suffering with it and the captives, and the traveller. Thus, the success with these characteristics is benevolence in the world and nobility in the Hereafter’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from Muhammad ibn Ali from Ahmad ibn ‘Amr ibn Sulayman al-Bajaliy from Isma‘il ibn al-Hassan ibn Isma‘il ibn Shu’ayb ibn Mitham al-Tammar from Ibrahim ibn Ishaq al-Mada’iniy from a man from abu Mikhnaf al-Azdiy who has said the following: “Once a group of Shi`a people came to ’Amir al-Mu’minin, ‘Alayhi al-Salam, with the following request: ‘O ’Amir al-Mu’minin, we request you to distribute the wealth at your disposal (public treasury) among the chiefs and elite people. In so doing, they will receive preference, which will strengthen your affairs. Thereafter, you can reassume your program of equal distribution of the treasury among people as Allah has commanded you to do.’ ’Amir al-Mu’minin, ‘Alayhi al-Salam, then said, ‘Do you, fie upon you, make me to achieve victory through doing injustice to Muslim people, whose ruler and high authority I have become? By Allah, I will not do so as long as there is day and night and one star in the sky (is left). By Allah, even if their wealth (public treasury) was my personal wealth, I still would distribute it among them by equal measures; in fact, it (public treasury) is their wealth.’ He (the Imam) remained silent for a long time. He then raised his head and said, ‘Whoever of you is wealthy must avoid spending in a wasteful, wrongful, extravagant manner and for causes of falsehood. In so doing, one enhances the name of his friend among people, but brings it low before Allah. Whoever spends his wealth for the causes of falsehood or undeserving recipients, Allah deprives him of the blessings of their thanks and appreciation. They will love people other than such a benevolent person. Even if certain ones among them express their appreciation, thanks and good advice, it is no more than meaningless flattery and false expressions. If the shoes of their companion slip and he becomes needy of their support and returning the favor, he receives blames as a wicked friend. One of you must not spend his property for the causes of falsehood and for the undeserving recipients; otherwise, he receives no more than lip service from those who want all powers for themselves. Only wicked people may applaud him as long as he provides them favors. Only ignorant people may offer him meaningless praise. They may call him the most generous person, while in fact, in the sight of Allah he is a stingy one. No share, in fact, is more wicked and of greater loss than this share. What meaningful gain can I make through this kind of Benevolent Assistance? Whoever among you is wealthy should therefore maintain good relations with his relatives, serve his guests, provide relief to the suffering people, the captives and those who have lost their supply while on a journey; success in such matters is a noble achievement in this world and an honor in the next life.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/160)"
        ],
        "index": 6086,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/31",
              "text": "مُحَمَّدِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/135",
              "text": "إِسْمَاعِيلَ بْنِ جَابِرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ إِسْمَاعِيلَ بْنِ جَابِرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:26:4",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ لَوْ أَنَّ النَّاسَ أَخَذُوا مَا أَمَرَهُمُ اللَّهُ عَزَّ وَ جَلَّ بِهِ فَأَنْفَقُوهُ فِيمَا نَهَاهُمُ اللَّهُ عَنْهُ مَا قَبِلَهُ مِنْهُمْ وَ لَوْ أَخَذُوا مَا نَهَاهُمُ اللَّهُ عَنْهُ فَأَنْفَقُوهُ فِيمَا أَمَرَهُمُ اللَّهُ بِهِ مَا قَبِلَهُ مِنْهُمْ حَتَّى يَأْخُذُوهُ مِنْ حَقٍّ وَ يُنْفِقُوهُ فِي حَقٍّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Sinan, from Ismail Bin Jabir who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘If the people were to take (earn by) what Allah<sup>azwj</sup> Mighty and Majestic has Commanded them with, and they spend in what Allah<sup>azwj</sup> has Forbidden them from, it would not be Accepted from them; and if they were to take (earn by) what Allah<sup>azwj</sup> has Forbidden them from, and they spend in what Allah<sup>azwj</sup> has Commanded them with, it would not be Accepted from them until they take it from its rightful way and spend it in a rightful manner’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from Isma‘il ibn Jabir who has said the following: “I heard Abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘If people achieve what Allah, the Most Majestic, the Most Glorious, has commanded them to achieve, but spend where Allah has prohibited such spending, it is not accepted. If people achieve what Allah has prohibited and spend on matters that Allah has commanded them to spend on, this also is not accepted. He accepts only what they earn in a rightful manner and spend on a rightful recipient.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/160)"
        ],
        "index": 6087,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/434",
              "text": "أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1715",
              "text": "مُوسَى بْنِ الْقَاسِمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/762",
              "text": "أَبِي جَمِيلَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/745",
              "text": "ضُرَيْسٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ مُوسَى بْنِ الْقَاسِمِ عَنْ أَبِي جَمِيلَةَ عَنْ ضُرَيْسٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:26:5",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّمَا أَعْطَاكُمُ اللَّهُ هَذِهِ الْفُضُولَ مِنَ الْأَمْوَالِ لِتُوَجِّهُوهَا حَيْثُ وَجَّهَهَا اللَّهُ وَ لَمْ يُعْطِكُمُوهَا لِتَكْنِزُوهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Ahmad Bin Abu Abdullah, from Musa Bin Al Qasim, from Abu Jameela, from Zureys who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘But rather, Allah<sup>azwj</sup> has Given you this extra from the wealth in order for you to divert it where Allah<sup>azwj</sup> Wants it to be diverted to, and He<sup>azwj</sup> did not Give these to you in order for you to be hoarding it’."
          ],
          "en.sarwar": [
            "5. Ali ibn Muhammad has narrated from Ahmad ibn abu ‘Abd Allah from Musa ibn al-Qasim from abu Jamilah from Durays who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘Allah has granted you the extra wealth so that you spend it the way Allah wants you to spend. He has not given you this to keep for safe keeping.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:1:26",
  "kind": "verse_list"
}