{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 29"
        },
        "path": "/books/al-kafi:4:1:29",
        "titles": {
          "ar": "بَابُ الْقَرْضِ",
          "en": "Chapter 76 – The loan"
        }
      }
    ],
    "index": 846,
    "local_index": 29,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 30"
        },
        "path": "/books/al-kafi:4:1:30",
        "titles": {
          "ar": "بَابُ إِنْظَارِ الْمُعْسِرِ",
          "en": "Chapter 77 – Respiting the insolvent"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 28"
        },
        "path": "/books/al-kafi:4:1:28",
        "titles": {
          "ar": "بَابُ مَنْ كَفَرَ الْمَعْرُوفَ",
          "en": "Chapter 75 – The one who rejects the acts of kindness"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:1:29",
    "titles": {
      "ar": "بَابُ الْقَرْضِ",
      "en": "Chapter 76 – The loan"
    },
    "verse_count": 5,
    "verse_start_index": 6093,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق وآخره مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/162)"
        ],
        "index": 6094,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:29:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَكْتُوبٌ عَلَى بَابِ الْجَنَّةِ الصَّدَقَةُ بِعَشَرَةٍ وَ الْقَرْضُ بِثَمَانِيَةَ عَشَرَ وَ فِي رِوَايَةٍ أُخْرَى بِخَمْسَةَ عَشَرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Mansour Bin Yunus, from Is’haq Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It is inscribed upon a door of the Paradise: “The charity is with ten (Rewards), and the loan is with eighteen”’. And in another report, ‘Fifteen’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Mansur ibn Yunus from Ishaq ibn ‘Ammar who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said, ‘There is a writing on the door of Paradise that says: ‘Charity for ten “rewards” and loan for eighteen “rewards.”’ In another Hadith it is said, ‘Loan for fifteen “rewards.”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/162)"
        ],
        "index": 6095,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:29:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنْ رِبْعِيِّ بْنِ عَبْدِ اللَّهِ عَنْ فُضَيْلِ بْنِ يَسَارٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَا مِنْ مُؤْمِنٍ أَقْرَضَ مُؤْمِناً يَلْتَمِسُ بِهِ وَجْهَ اللَّهِ إِلَّا حَسَبَ اللَّهُ لَهُ أَجْرَهُ بِحِسَابِ الصَّدَقَةِ حَتَّى يَرْجِعَ إِلَيْهِ مَالُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Ibn Abu Umeyr, from Hammad, from Rabie Bin Abdullah, from Fuzayl Bin Yasaar who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘There is none from a Believer who lends to a Believer, seeking by it the Face of Allah<sup>azwj</sup>, except that Allah<sup>azwj</sup> would Reckon for him his Recompense by accounting it as a charity (on his behalf) until his wealth returns to him’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Isma‘il from al-Fadl ibn Shadhan, all from ibn abu ‘Umayr from Hammad from Rib’iy ibn ‘Abd Allah from Fudayl ibn Yasar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘For every believing person who provides a loan for another believing person, for the sake of Allah, Allah counts its reward as that of giving charity until the time the loan is paid back.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/162)"
        ],
        "index": 6096,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:29:3",
        "relations": {
          "Mentions": [
            "/books/quran:4:114"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى لا خَيْرَ فِي كَثِيرٍ مِنْ نَجْواهُمْ إِلَّا مَنْ أَمَرَ بِصَدَقَةٍ أَوْ مَعْرُوفٍ قَالَ يَعْنِي بِالْمَعْرُوفِ الْقَرْضَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibrahim Bin Abdul Hameed, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h114\">[4:114]</a> There is no good in most of their secret counsels except (in his) who enjoins charity or goodness</span>. He<sup>asws</sup> said: ‘(Allah<sup>azwj</sup>) Means by the ‘goodness’, the loan’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Ibrahim ibn ‘Abd al-Hamid who has said the following: “This is about the words of Allah, ‘There is not much good in many of their secret talks except that which commands to give charity or Benevolent Assistance.’ <a href=\"/#/books/quran:4#h114\">[4:114]</a> Abu ‘Abd Allah, has said, “Benevolent Assistance is a reference to providing loans for needy people.’”” "
          ]
        }
      },
      {
        "index": 6097,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:29:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ أَبِيهِ عَنْ عُقْبَةَ بْنِ خَالِدٍ قَالَ دَخَلْتُ أَنَا وَ الْمُعَلَّى وَ عُثْمَانُ بْنُ عِمْرَانَ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَلَمَّا رَآنَا قَالَ مَرْحَباً مَرْحَباً بِكُمْ وُجُوهٌ تُحِبُّنَا وَ نُحِبُّهَا جَعَلَكُمُ اللَّهُ مَعَنَا فِي الدُّنْيَا وَ الْآخِرَةِ فَقَالَ لَهُ عُثْمَانُ جُعِلْتُ فِدَاكَ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) نَعَمْ مَهْ قَالَ إِنِّي رَجُلٌ مُوسِرٌ فَقَالَ لَهُ بَارَكَ اللَّهُ لَكَ فِي يَسَارِكَ قَالَ وَ يَجِي‏ءُ الرَّجُلُ فَيَسْأَلُنِي الشَّيْ‏ءَ وَ لَيْسَ هُوَ إِبَّانُ زَكَاتِي ",
          "فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) الْقَرْضُ عِنْدَنَا بِثَمَانِيَةَ عَشَرَ وَ الصَّدَقَةُ بِعَشَرَةٍ وَ مَا ذَا عَلَيْكَ إِذَا كُنْتَ كَمَا تَقُولُ مُوسِراً أَعْطَيْتَهُ فَإِذَا كَانَ إِبَّانُ زَكَاتِكَ احْتَسَبْتَ بِهَا مِنَ الزَّكَاةِ يَا عُثْمَانُ لَا تَرُدَّهُ فَإِنَّ رَدَّهُ عِنْدَ اللَّهِ عَظِيمٌ يَا عُثْمَانُ إِنَّكَ لَوْ عَلِمْتَ مَا مَنْزِلَةُ الْمُؤْمِنِ مِنْ رَبِّهِ مَا تَوَانَيْتَ فِي حَاجَتِهِ وَ مَنْ أَدْخَلَ عَلَى مُؤْمِنٍ سُرُوراً فَقَدْ أَدْخَلَ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ قَضَاءُ حَاجَةِ الْمُؤْمِنِ يَدْفَعُ الْجُنُونَ وَ الْجُذَامَ وَ الْبَرَصَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Al Hassan Bin Ali, from his father, from Uqba Bin Khalid who said, ",
            "‘I and Al-Moalla, and Usman Bin Imran went over to Abu Abdullah<sup>asws</sup>. So when he<sup>asws</sup> saw us, said: ‘Welcome! Welcome with you all; faces that love us<sup>asws</sup> and we<sup>asws</sup> love them. May Allah<sup>azwj</sup> Cause you all to be with us<sup>asws</sup> in the world and the Hereafter’. So Usman said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>’. So Abu Abdullah<sup>asws</sup> said to him: ‘Yes, what is it (that you have come for)?’ I am an affluent man’. So he<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> Bless you in your affluence’. He said, ‘The man comes to me, so he asks me for something, and it is not the time for my Zakat?’ ",
            "So Abu Abdullah<sup>asws</sup> said to him: ‘The loan, with us<sup>asws</sup> is with eighteen (Rewards) and the charity is with ten, and what is that upon you when you are as you are saying, ‘affluent’? Give it to him. So when it would be the time of your Zakat, count it to be from the Zakat. O Usman! Do not repel him, for the repelling is grievous in the Presence of Allah<sup>azwj</sup>. O Usman! You, if you were to know what is the status of the Believer from his Lord<sup>azwj</sup>, you will not slacken with regards to his need; and the one who enters the joy upon a Believer, so he has entered it upon Rasool-Allah<sup>saww</sup>; and the fulfillment of a need of the Believer repels the insanity, and the leprosy, and the vitiligo’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn al-Hassan ibn Ali from his father from ‘Uqbah ibn Khalid who has said the following: “I went to visit abu ‘Abd Allah, ‘Alayhi al-Salam. Two other people, al-Mu‘alla’ and ‘Uthman ibn ‘Umar, also were present with me. On seeing us, he welcomed us and offered greetings of peace, saying, ‘I welcome the faces that love us and we love them. May Allah keep you with us in this world and in the next life.’ Uthman then said, ‘I pray to Allah to keep my soul in service for your cause.’ The Imam acknowledged his expression and asked, ‘What can I do for you?’ Uthman then said, ‘I am an affluent man.’ The Imam said, ‘May Allah make your wealth a blessing for you.’ He then said, ‘A man comes to me for (financial) help. Such time is not the time for me to pay zakat.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, then said, ‘Providing a loan, before us, has eighteen rewards, and for charity it is ten rewards. You have no difficulty, being an affluent man as you just said. You can provide him help and when the time for paying zakat comes, count it as your zakat paid to him. O ‘Uthman, do not turn him away empty-handed; it is a great and serious matter in the sight of Allah. O ‘Uthman, if you had known how important a believer is in the sight of Allah, you would not hesitate to respond positively to his appeal. Whoever provides happiness for a believing person has done so for the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. Providing help for a believing person repels illnesses like insanity, leprosy and albino (leprosy).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/163)"
        ],
        "index": 6098,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:29:5",
        "text": [
          "سَهْلُ بْنُ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْحَمِيدِ عَنْ إِبْرَاهِيمَ بْنِ السِّنْدِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَرْضُ الْمُؤْمِنِ غَنِيمَةٌ وَ تَعْجِيلُ خَيْرٍ إِنْ أَيْسَرَ أَدَّاهُ وَ إِنْ مَاتَ احْتُسِبَ مِنَ الزَّكَاةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl Bin Ziyad, from Muhammad Bin Abdul Hameed, from Ibrahim Bin Al Sandy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A loan to the Believer is a booty, and haste is better. If he is affluent, he would pay it back, but if he were to die, you can count it as being from the Zakat’."
          ],
          "en.sarwar": [
            "5. Sahl ibn Ziyad has narrated from Muhammad ibn ‘Abd al-FIamid from Ibrahim al-Sindiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that providing a loan for a believing person is an (important) gain and a good deed if done quickly. If he becomes financially capable, he repays, but if he dies, the provider of loan can count it as payment for zakat.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:1:29",
  "kind": "verse_list"
}