{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 30"
        },
        "path": "/books/al-kafi:4:1:30",
        "titles": {
          "ar": "بَابُ إِنْظَارِ الْمُعْسِرِ",
          "en": "Chapter 77 – Respiting the insolvent"
        }
      }
    ],
    "index": 847,
    "local_index": 30,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 31"
        },
        "path": "/books/al-kafi:4:1:31",
        "titles": {
          "ar": "بَابُ تَحْلِيلِ الْمَيِّتِ",
          "en": "Chapter 78 – Freeing the deceased (from paying back)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 29"
        },
        "path": "/books/al-kafi:4:1:29",
        "titles": {
          "ar": "بَابُ الْقَرْضِ",
          "en": "Chapter 76 – The loan"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:1:30",
    "titles": {
      "ar": "بَابُ إِنْظَارِ الْمُعْسِرِ",
      "en": "Chapter 77 – Respiting the insolvent"
    },
    "verse_count": 4,
    "verse_start_index": 6098,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/163)"
        ],
        "index": 6099,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/142",
              "text": "مُعَاوِيَةَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:30:1",
        "text": [
          " مَنْ أَرَادَ أَنْ يُظِلَّهُ اللَّهُ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّهُ قَالَهَا ثَلَاثاً فَهَابَهُ النَّاسُ أَنْ يَسْأَلُوهُ فَقَالَ فَلْيُنْظِرْ مُعْسِراً أَوْ لِيَدَعْ لَهُ مِنْ حَقِّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Mahboub, from Muawiya Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who wants that Allah<sup>azwj</sup> should Shade him on the Day when there will be no shade except for His<sup>azwj</sup> Shade’ – saying it three times and the people did not have the courage to ask him<sup>asws</sup>, so he<sup>asws</sup> said: ‘So let him respite the insolvent (give relaxation to that who owes you), or waive (something) for him from your rights’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Mahbub from Mu‘awiyah ibn ‘Ammar who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, once, spoke to us and repeated the following phrase three times. ‘If one wishes that Allah provide him shadow on the Day when there will be no shadow except His shadow,’ and no one had the courage to ask him to explain, he (Imam) then said, ‘He should extend the due date of repayment of a loan for a borrower who has difficulty to pay back, or partially waive it in his (debtor’s) favor.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/163)"
        ],
        "index": 6100,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/148",
              "text": "عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/257",
              "text": "أَبَانِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/785",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:30:2",
        "text": [
          " إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ فِي يَوْمٍ حَارٍّ وَ حَنَّى كَفَّهُ مَنْ أَحَبَّ أَنْ يَسْتَظِلَّ مِنْ فَوْرِ جَهَنَّمَ قَالَهَا ثَلَاثَ مَرَّاتٍ فَقَالَ النَّاسُ فِي كُلِّ مَرَّةٍ نَحْنُ يَا رَسُولَ اللَّهِ فَقَالَ مَنْ أَنْظَرَ غَرِيماً أَوْ تَرَكَ الْمُعْسِرَ ",
          "ثُمَّ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لِي عَبْدُ اللَّهِ بْنُ كَعْبِ بْنِ مَالِكٍ إِنَّ أَبِي أَخْبَرَنِي أَنَّهُ لَزِمَ غَرِيماً لَهُ فِي الْمَسْجِدِ فَأَقْبَلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَدَخَلَ بَيْتَهُ وَ نَحْنُ جَالِسَانِ ثُمَّ خَرَجَ فِي الْهَاجِرَةِ فَكَشَفَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) سِتْرَهُ وَ قَالَ يَا كَعْبُ مَا زِلْتُمَا جَالِسَيْنِ قَالَ نَعَمْ بِأَبِي وَ أُمِّي قَالَ فَأَشَارَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِكَفِّهِ خُذِ النِّصْفَ قَالَ فَقُلْتُ بِأَبِي وَ أُمِّي ثُمَّ قَالَ أَتْبِعْهُ بِبَقِيَّةِ حَقِّكَ قَالَ فَأَخَذْتُ النِّصْفَ وَ وَضَعْتُ لَهُ النِّصْفَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Abdullah Bin Muhammad, from Ali Bin Al Hakam, from Aban Bin Usman, from Abdul Rahman Bin Abu Abdullah, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said that Rasool-Allah<sup>saww</sup> said during a hot day, and he<sup>saww</sup> bent his<sup>saww</sup> palm: ‘Who would like to be shaded from the outburst of the flames of Hell?’ – saying it three times, and the people said during each time, ‘Us, O Rasool-Allah<sup>saww</sup>!’ So he<sup>saww</sup> said: ‘The one who respites a debtor or leaves the insolvent’.",
            "Then Abu Abdullah<sup>asws</sup> said to me: ‘Abdullah Bin Ka’ab Bin Malik said to me<sup>asws</sup>, ‘My father informed me that he necessitated a debtor of his in the Masjid (to pay him back). So Rasool-Allah<sup>saww</sup> went back and entered his<sup>saww</sup> house, and we were seated. Then he<sup>saww</sup> came out in the midday heat. So Rasool-Allah<sup>saww</sup> uncovered his<sup>saww</sup> veil and said: ‘O Ka’ab! You two have not ceased to be seated?’ He said, ‘Yes, may my father and my mother be sacrificed for you<sup>saww</sup>’. So Rasool-Allah<sup>saww</sup> gestured by his<sup>saww</sup> palm: ‘Take the half’. He said, ‘So I said, ‘May my father and my mother be sacrificed for you<sup>saww</sup>’. Then he<sup>saww</sup> said: ‘Pursue him for the remainder of your right’. He said, ‘So I took the half and dropped for him the (other) half’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from ‘Abd Allah ibn Muhammad from Ali ibn al-Hakam from Aban ibn ‘Uthman from ‘Abd al- Rahman ibn abu ‘Abd Allah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, bending his palm on a hot day, said, ‘Who wants to provide a shadow for himself against the heat of the blaze of hell fire?’ He repeated the sentence three times, and every time people said, ‘We want such a shadow, O Messenger of Allah.’ He then said, ‘He is the one who extends the due date of loan repayment or waives it altogether in favor of a borrower who has difficulty paying.’” “Abu ‘Abd Allah, ‘Alayhi al-Salam, then said to me, “Abd Allah ibn Ka‘b ibn Malik has said to me that his father told him, “Once, in the Masjid I got hold of a person who had borrowed from me. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, came and (seeing us) he went inside his house, while we were sitting in the Masjid. He then came out in the heat of the sun and began to speak, saying, ‘O Ka‘b, are you both still sitting there?’ I, Ka‘b then replied, ‘Yes, I pray to Allah to keep the souls of my father and mother in the service of your cause.’ The Messenger of Allah then pointed to his palm and said, ‘Take this half.’ I, Ka‘b, then said, ‘Yes, I pray to Allah to keep the souls of my father and mother in service for your cause.’ He (the Messenger of Allah) said, ‘Waive the other half in his favor.’ I took the half and waived the other half in favor of the borrower.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/164)"
        ],
        "index": 6101,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/89",
              "text": "عَلِيِّ بْنِ أَسْبَاطٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1186",
              "text": "يَعْقُوبَ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ يَعْقُوبَ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:30:3",
        "relations": {
          "Mentions": [
            "/books/quran:2:280"
          ]
        },
        "text": [
          " خَلُّوا سَبِيلَ الْمُعْسِرِ كَمَا خَلَّاهُ اللَّهُ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Asbaat, from Yaqoub Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>: ‘Free the way of the insolvent just as Allah<sup>azwj</sup> Mighty and Majestic Frees it’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Asbat from Ya’qub ibn Salim who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that you must leave alone a borrower who has difficulty repaying a loan, just as Allah does (extend the due time for payment of loan if the borrower has difficulty repaying. . . ” (see <a href=\"/#/books/quran:2#h280\">[2:280]</a>). "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/164)"
        ],
        "index": 6102,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2861",
              "text": "يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ الْحَسَنِ بْنِ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ الْحَسَنِ بْنِ الْحَسَنِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:30:4",
        "text": [
          " صَعِدَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْمِنْبَرَ ذَاتَ يَوْمٍ فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ وَ صَلَّى عَلَى أَنْبِيَائِهِ صَلَّى اللَّهُ عَلَيْهِمْ ثُمَّ قَالَ أَيُّهَا النَّاسُ لِيُبَلِّغِ الشَّاهِدُ مِنْكُمُ الْغَائِبَ أَلَا وَ مَنْ أَنْظَرَ مُعْسِراً كَانَ لَهُ عَلَى اللَّهِ عَزَّ وَ جَلَّ فِي كُلِّ يَوْمٍ صَدَقَةٌ بِمِثْلِ مَالِهِ حَتَّى يَسْتَوْفِيَهُ ",
          "ثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ إِنْ كانَ ذُو عُسْرَةٍ فَنَظِرَةٌ إِلى مَيْسَرَةٍ وَ أَنْ تَصَدَّقُوا خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ أَنَّهُ مُعْسِرٌ فَتَصَدَّقُوا عَلَيْهِ بِمَالِكُمْ فَهُوَ خَيْرٌ لَكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Al Hassan Bin Mahboub, from Yahya Bin Abdullah Bin Al Hassan Bin Al Hassan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> ascended the Pulpit one day, so he<sup>saww</sup> Praised Allah<sup>azwj</sup> and Extolled upon Him<sup>azwj</sup> and sent Blessings upon His<sup>azwj</sup> Prophets<sup>as</sup>, then said: ‘O you people! Let the ones present make it to reach the ones who are absent. Indeed! And the one who respites an insolvent one would have a charity for him upon Allah<sup>azwj</sup> Mighty and Majestic with similar to his wealth until he pays it back’. ",
            "Then, Abu Abdullah<sup>asws</sup> said: ‘And if he was with insolvency, so respite to his solvency, and if you were to give it as charity, it would be better for you if you are knowing that he is insolvent. So your giving in charity upon him with your wealth is better for you’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Sahl ibn Ziyad from al-Hassan ibn Mahbub from Yahya ibn ‘Abd Allah ibn al-Hassan ibn al-Hassan who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that one day the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, sat on the pulpit. He praised Allah, spoke of His glory, prayed for His prophets, and then said the following: ‘O people, those of you present must inform those who are absent. Whoever extends the due date for repayment in favor of a borrower who has difficulty to pay back, for such a person with Allah, the Most Majestic, the Most Glorious, for every day a reward of charity equal to the amount of loan is recorded, until the loan is repaid.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, then said, ‘If a borrower has difficulty repaying the loan, he should be given time until his difficulty is no more, but it is better for you if you count it as is charity if he has difficulty to pay. You should provide him charity from your property; it is better for you.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:1:30",
  "kind": "verse_list"
}