{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 31"
        },
        "path": "/books/al-kafi:4:1:31",
        "titles": {
          "ar": "بَابُ تَحْلِيلِ الْمَيِّتِ",
          "en": "Chapter 78 – Freeing the deceased (from paying back)"
        }
      }
    ],
    "index": 848,
    "local_index": 31,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 32"
        },
        "path": "/books/al-kafi:4:1:32",
        "titles": {
          "ar": "بَابُ مَئُونَةِ النِّعَمِ",
          "en": "Chapter 79 – Provision for the Bounties"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 30"
        },
        "path": "/books/al-kafi:4:1:30",
        "titles": {
          "ar": "بَابُ إِنْظَارِ الْمُعْسِرِ",
          "en": "Chapter 77 – Respiting the insolvent"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:1:31",
    "titles": {
      "ar": "بَابُ تَحْلِيلِ الْمَيِّتِ",
      "en": "Chapter 78 – Freeing the deceased (from paying back)"
    },
    "verse_count": 2,
    "verse_start_index": 6102,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/165)"
        ],
        "index": 6103,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/121",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/54",
              "text": "إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2862",
              "text": "الْحَسَنِ بْنِ خُنَيْسٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنِ الْحَسَنِ بْنِ خُنَيْسٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:31:1",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ لِعَبْدِ الرَّحْمَنِ بْنِ سَيَابَةَ دَيْناً عَلَى رَجُلٍ قَدْ مَاتَ وَ قَدْ كَلَّمْنَاهُ أَنْ يُحَلِّلَهُ فَأَبَى فَقَالَ وَيْحَهُ أَ مَا يَعْلَمُ أَنَّ لَهُ بِكُلِّ دِرْهَمٍ عَشَرَةً إِذَا حَلَّلَهُ فَإِذَا لَمْ يُحَلِّلْهُ فَإِنَّمَا لَهُ دِرْهَمٌ بَدَلَ دِرْهَمٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and Muhammad Bin Ismail, from Al fazl Bin Shazaan, altogether from Ibn Abu Umeyr, from Ibrahim Bin Abdul Hameed, from Al Hassan Bin Khunays who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘There is a debt due for Abdul Rahman Bin Sayaba upon a man who has died, and he had spoken to him that he should free him, but he refused’. So he<sup>asws</sup> said: ‘Woe be unto him! Does he not know that for him would be ten for each Dirham when he frees him. So when he does not free him, rather there would be one Dirham for him in exchange for one Dirham’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Isma‘il from af-Fadf ibn Shadhan all from ibn abu ‘Umayr from Ibrahim ibn ‘Abd al-Hamid from al-Hassan ibn Khunays who has said the following: “Once I said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘A man who died had borrowed (money) from ‘Abd al-Rahman ibn Sayabah, whom we asked to waive the loan in favor of the dead person, but he refused. He (the Imam) said, “Woe is upon him! Why does he not realize that for every dirham, he can receive the reward for ten dirhams, were he to waive it in favor of the dead person? In not waiving the loan in favor of the dead person, he can only receive the reward of one dirham for every dirham.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/165)"
        ],
        "index": 6104,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/33",
              "text": "عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/173",
              "text": "ذَكَرَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2863",
              "text": "الْوَلِيدِ بْنِ أَبِي الْعَلَاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1587",
              "text": "مُعَتِّبٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَمَّنْ ذَكَرَهُ عَنِ الْوَلِيدِ بْنِ أَبِي الْعَلَاءِ عَنْ مُعَتِّبٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:31:2",
        "text": [
          " دَخَلَ مُحَمَّدُ بْنُ بِشْرٍ الْوَشَّاءُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) يَسْأَلُهُ أَنْ يُكَلِّمَ شِهَاباً أَنْ يُخَفِّفَ عَنْهُ حَتَّى يَنْقَضِيَ الْمَوْسِمُ وَ كَانَ لَهُ عَلَيْهِ أَلْفُ دِينَارٍ فَأَرْسَلَ إِلَيْهِ فَأَتَاهُ فَقَالَ لَهُ قَدْ عَرَفْتَ حَالَ مُحَمَّدٍ وَ انْقِطَاعَهُ إِلَيْنَا وَ قَدْ ذَكَرَ أَنَّ لَكَ عَلَيْهِ أَلْفَ دِينَارٍ لَمْ تَذْهَبْ فِي بَطْنٍ وَ لَا فَرْجٍ وَ إِنَّمَا ذَهَبَتْ دَيْناً عَلَى الرِّجَالِ وَ وَضَائِعَ وَضَعَهَا وَ أَنَا أُحِبُّ أَنْ تَجْعَلَهُ فِي حِلٍّ ",
          "فَقَالَ لَعَلَّكَ مِمَّنْ يَزْعُمُ أَنَّهُ يُقْبَضُ مِنْ حَسَنَاتِهِ فَتُعْطَاهَا فَقَالَ كَذَلِكَ فِي أَيْدِينَا فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) اللَّهُ أَكْرَمُ وَ أَعْدَلُ مِنْ أَنْ يَتَقَرَّبَ إِلَيْهِ عَبْدُهُ فَيَقُومَ فِي اللَّيْلَةِ الْقَرَّةِ أَوْ يَصُومَ فِي الْيَوْمِ الْحَارِّ أَوْ يَطُوفَ بِهَذَا الْبَيْتِ ثُمَّ يَسْلُبُهُ ذَلِكَ فَيُعْطَاهُ وَ لَكِنْ لِلَّهِ فَضْلٌ كَثِيرٌ يُكَافِي الْمُؤْمِنَ فَقَالَ فَهُوَ فِي حِلٍّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad Bin Abdullah, from Ahmad Bin Muhammad Bin Khalid, from the one who mentioned it, from Al Waleed Bin Abu Al A’ala, from Mo’tab who said, ",
            "‘Muhammad Bin Bishr Al-Washa’a went over to Abu Abdullah<sup>asws</sup> asking him<sup>asws</sup> if he<sup>asws</sup> could speak to Shihaab that he lightens from him (the debt) until the season (of Hajj) expires, and there used to be for him, upon him, a thousand Dinars (as debt owing). So he<sup>asws</sup> sent a message to him, so he came over to him<sup>asws</sup>, and he<sup>asws</sup> said to him: ‘You know the state of Muhammad, and his cutting off (from the people) to be with us<sup>asws</sup>, and he has mentioned that for you, upon him, are a thousand Dinars (owing), which have neither gone into a belly nor a private part (marriage). But it has gone upon the man as a debt, and is placed in its (appropriate) place, and I<sup>asws</sup> would love it if you could make him to be free from it’.",
            "Then he<sup>asws</sup> said: ‘Perhaps you are from the ones who think that He<sup>azwj</sup> would Capture from his Rewards, so you would be Given it’. So he said, ‘It is like that in our hands (Ahadeeth reported)’. So Abu Abdullah<sup>asws</sup> said: ‘Allah<sup>azwj</sup> is more Benevolent and more Just that if His<sup>azwj</sup> servant comes closer to Him<sup>saww</sup>, so he stands during the cold night (in Prayer), or Fasts during the hot day, or circumambulates with this House (Kabah), then He<sup>azwj</sup> would Confiscate that, so He<sup>azwj</sup> would Give it (to others), but Allah<sup>azwj</sup> has a lot of extras which would suffice the Believer’. So he said, ‘So he is in freedom (from my debt)’."
          ],
          "en.sarwar": [
            "2. Ali ibn Muhammad ibn ‘Abd Allah has narrated from Ahmad ibn Muhammad ibn Khalid from those whom he his mentioned (in his book) from al-Walid ibn abu a I - ‘ A I a ’ from Mu’attib who has said the following: “Once Muhammad ibn Bishr al-Washsha’ came to visit abu ‘Abd Allah, ‘Alayhi al-Salam, asking the Imam to speak to Shihab to relieve him of repayment of a loan until the end of the time for Hajj. He owed him one thousand dinars. The Imam sent someone to call him. He (Shihab) came and the Imam said to him, ‘As you know Muhammad’s condition, he has cut off his association with others to keep himself close to us. He has mentioned he owes you one thousand dinars. These (dinars) are not consumed or spent on marriage. They are payable as loan to men. I wish you to waive it in his favor.’ He (Imam) then said, ‘You perhaps think that He will take from his (borrower’s) good deeds and give it to you.’ He (Shihab) said, ‘That is what we are told would happen.’ Abu ‘Abd Allah, ‘Alayhi al- Salam, then said, ‘Allah is most Honorable and Just. How would He take away the good deeds of one of His servants who stands up for worship on cold nights, fasts on hot days, and walks seven times around the house (Ka‘bah), and give it away to another? In fact, Allah has a great deal of extra blessings to compensate a believing person.’ He (Shihab) said, ‘He is free (I waive the loan in his favor).”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:1:31",
  "kind": "verse_list"
}