{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 35"
        },
        "path": "/books/al-kafi:4:1:35",
        "titles": {
          "ar": "بَابُ الْإِنْفَاقِ",
          "en": "Chapter 82 – The Expenditure"
        }
      }
    ],
    "index": 852,
    "local_index": 35,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 36"
        },
        "path": "/books/al-kafi:4:1:36",
        "titles": {
          "ar": "بَابُ الْبُخْلِ وَ الشُّحِّ",
          "en": "Chapter 83 – ‘بُخْلٌ’The stinginess  and ‘الشُّحِّ’ the greed"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 34"
        },
        "path": "/books/al-kafi:4:1:34",
        "titles": {
          "ar": "بَابُ مَعْرِفَةِ الْجُودِ وَ السَّخَاءِ",
          "en": "Chapter 81 – Understanding the ‘الْجَوَادِ’ benevolence and ‘السَّخَاءِ’ the generousity"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:1:35",
    "titles": {
      "ar": "بَابُ الْإِنْفَاقِ",
      "en": "Chapter 82 – The Expenditure"
    },
    "verse_count": 9,
    "verse_start_index": 6126,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/171)"
        ],
        "index": 6127,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:35:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ جَمِيعاً عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ إِبْرَاهِيمَ بْنِ مِهْزَمٍ عَنْ رَجُلٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ الشَّمْسَ لَتَطْلُعُ وَ مَعَهَا أَرْبَعَةُ أَمْلَاكٍ مَلَكٌ يُنَادِي يَا صَاحِبَ الْخَيْرِ أَتِمَّ وَ أَبْشِرْ وَ مَلَكٌ يُنَادِي يَا صَاحِبَ الشَّرِّ انْزِعْ وَ أَقْصِرْ وَ مَلَكٌ يُنَادِي أَعْطِ مُنْفِقاً خَلَفاً وَ آتِ مُمْسِكاً تَلَفاً وَ مَلَكٌ يَنْضَحُهَا بِالْمَاءِ وَ لَوْ لَا ذَلِكَ اشْتَعَلَتِ الْأَرْضُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa and Ahmad Bin Muhammad Bin Khalid, altogether from Al Hassan Bin Mahboub, from Ibrahim Bin Mihzam, from a man, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The sun emerges and with it are four Angels. One Angel calls out: ‘O performer of the goodness, complete (it) and receive glad tidings!’ And an Angel calls out: ‘O performer of the evil, remove (it) and shorten (it)!’ And an Angel calls out: ‘Giving the expenses remains behind and withholding is damaging!’ And an Angel sprinkles it (the earth) with the water, and had it not been for that, the ground would burst’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa and Ahmad ibn Muhammad ibn Khalid all from al- Hassan ibn Mahbub from Ibrahim ibn Mehzam from a man from Jabir who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said that when the sun rises, there are four angels with it. One angel calls, ‘O people of good deeds, complete your good deeds and for you there is glad news.’ Another angel calls, ‘O people of evil deeds, you must stop and stay away from evil deeds.’ The other angel says, To spend for deserving causes is a saving, and to withhold such spending is a sure loss.’ One angel keeps throwing water on it; otherwise, the earth catches fire.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/171)"
        ],
        "index": 6128,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:35:2",
        "refs": {
          "Quran": [
            "/books/quran:2:162",
            "/books/quran:2:167"
          ]
        },
        "text": [
          "أَحْمَدُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ عُثْمَانَ بْنِ عِيسَى عَمَّنْ حَدَّثَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ كَذلِكَ يُرِيهِمُ اللَّهُ أَعْمالَهُمْ حَسَراتٍ عَلَيْهِمْ قَالَ هُوَ الرَّجُلُ يَدَعُ مَالَهُ لَا يُنْفِقُهُ فِي طَاعَةِ اللَّهِ بُخْلًا ثُمَّ يَمُوتُ فَيَدَعُهُ لِمَنْ يَعْمَلُ فِيهِ بِطَاعَةِ اللَّهِ أَوْ فِي مَعْصِيَةِ اللَّهِ فَإِنْ عَمِلَ بِهِ فِي طَاعَةِ اللَّهِ رَآهُ فِي مِيزَانِ غَيْرِهِ فَرَآهُ حَسْرَةً وَ قَدْ كَانَ الْمَالُ لَهُ وَ إِنْ كَانَ عَمِلَ بِهِ فِي مَعْصِيَةِ اللَّهِ قَوَّاهُ بِذَلِكَ الْمَالِ حَتَّى عَمِلَ بِهِ فِي مَعْصِيَةِ اللَّهِ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Abu Abdullah, from Usman Bin Isa, from the one who narrated it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h167\">[2:167]</a> Thus will Allah Show them their deeds to be intense regret to them</span>. He<sup>asws</sup> said: ‘He is the man who keeps his wealth and does not spend it in obedience to Allah<sup>azwj</sup> out of stinginess, then he dies leaving it for the one who works with it either in obedience to Allah<sup>azwj</sup> or in disobedience to Allah<sup>azwj</sup>. So if he were to work with it in obedience to Allah<sup>azwj</sup>, he would see it to be in the Scale of someone else, so he would experience regret, and the wealth was once his; but if he (the inheritor) If it is spent in disobedience of Allah, he is the one who enabled the spender through that property to disobey Allah, the Most Majestic, the Most Glorious.’."
          ],
          "en.sarwar": [
            "2. Ahmad ibn abu ‘Abd Allah has narrated from ‘Uthman ibn ‘Isa from those whom he has mentioned who has said the following: “This is about the meaning of the words of Allah, the Most Majestic, the Most Glorious, Thus Allah shows them their deeds that will make them regretful. <a href=\"/#/books/quran:2#h162\">[2:162]</a>’ Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, This is a man who keeps his property without spending in obedience to Allah due to his stinginess. He then dies and leaves it (the property) for one who spends it in obedience to Allah or in disobedience of Allah. If it is spent in obedience of Allah and finds it in the balance of the other person, he then becomes regretful; it was his property. If it is spent in disobedience of Allah, he is the one who enabled the spender through that property to disobey Allah, the Most Majestic, the Most Glorious.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/172)"
        ],
        "index": 6129,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:35:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُوسَى بْنِ رَاشِدٍ عَنْ سَمَاعَةَ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ أَيْقَنَ بِالْخَلَفِ سَخَتْ نَفْسُهُ بِالنَّفَقَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al hakam, from Musa Bin Rashid, from Sama’at, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The one is certain of the Replacement (by Allah<sup>azwj</sup>), would be strict with himself (and monitor) where he spends’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa, from Ali ibn al-Hakam, from Musa ibn Rashid, from Sama‘ah who has said the following: “Abu al-Hassan, ‘Alayhi al-Salam, has said, The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “When one who believes with certainty in receiving reward (from Allah), his soul allows him to spend generously.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/172)"
        ],
        "index": 6130,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:35:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ بَعْضِ مَنْ حَدَّثَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ صَلَوَاتُ اللَّهِ عَلَيْهِ فِي كَلَامٍ لَهُ وَ مَنْ يَبْسُطْ يَدَهُ بِالْمَعْرُوفِ إِذَا وَجَدَهُ يُخْلِفِ اللَّهُ لَهُ مَا أَنْفَقَ فِي دُنْيَاهُ وَ يُضَاعِفْ لَهُ فِي آخِرَتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Ahmad Bin Muhammad, from Usman Bin Isa, from someone who narrated it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said in a speech of his<sup>asws</sup>: ‘The one who extends his (helping) hand with the act of kindness and when he bears it (the expenditure), Allah<sup>azwj</sup> would Replace for him what he had spent in his world, and would Double it, for him, in his Hereafter’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ‘Uthaman ibn ‘Isa from certain individuals who narrated to him who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin, ‘Alayhi al-Salam, has said, in one of his speeches, ‘If one extends his hand to provide Benevolent Assistance when he is able to do so, Allah replaces, in this world, what he has spent and will grant them double reward in the next life.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/172)"
        ],
        "index": 6131,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:35:5",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدِ بْنِ خَالِدٍ عَنْ جَهْمِ بْنِ الْحَكَمِ الْمَدَائِنِيِّ عَنْ إِسْمَاعِيلَ بْنِ أَبِي زِيَادٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْأَيْدِي ثَلَاثَةٌ سَائِلَةٌ وَ مُنْفِقَةٌ وَ مُمْسِكَةٌ وَ خَيْرُ الْأَيْدِي الْمُنْفِقَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad Bin Khalid, from Jahm Bin Al hakam Al Madainy, from Ismail Bin Abu Ziyad, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The hands are three – an asking (hand), and a spending (hand), and a withholding (hand); and the best of the hands is the spending (hand)’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid and Muhammad ibn Yahya from Ahmad ibn Muhammad ibn ‘Isa all from ibn abu Nasr who has said the following: “I have read in a letter of abu al-Hassan, al-Rida, to abu Ja‘far, ‘Alayhi al-Salam. It is said, ‘O abu Ja’far, I am told that the servants lead you out of the house through the small door so that no one receives any assistance from you and it is due to their stinginess. I ask you through my rights upon you; you must not use any other door for your exit or entrance besides the main door. When you want to ride, you must have gold or silver with you. Whoever asks you for help, you must not turn him away empty-handed. If any of your uncles asks you for help, you must not give him less than fifty dinars; but it is up to you if you want to give more. If any of your aunts asks you for help, you must not give her less than twenty-five dinars, but it is up to you if you want to give more. I want Allah to grant you higher position. Spend on deserving causes, and do not be afraid of the owner of the Throne’s making you poor.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/172)"
        ],
        "index": 6132,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:35:6",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ سَعْدَانَ عَنِ الْحُسَيْنِ بْنِ أَيْمَنَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ يَا حُسَيْنُ أَنْفِقْ وَ أَيْقِنْ بِالْخَلَفِ مِنَ اللَّهِ فَإِنَّهُ لَمْ يَبْخَلْ عَبْدٌ وَ لَا أَمَةٌ بِنَفَقَةٍ فِيمَا يُرْضِي اللَّهَ عَزَّ وَ جَلَّ إِلَّا أَنْفَقَ أَضْعَافَهَا فِيمَا يُسْخِطُ اللَّهَ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from his father, from Sa’dan, from Al Husayn Bin Ayman, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘O Husayn! Spend and have certainty in the Replacement from Allah<sup>azwj</sup>, for neither will a slave nor a maid be stingy with expenditure regarding what Pleases Allah<sup>azwj</sup> Mighty and Majestic, except that they would end up spending in what Angers Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "6. Ahmad ibn Muhammad ibn Khalid has narrated from Jahm ibn al-Hakam al-Mad’iniy from Isma‘il ibn abu Ziyad who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, There are three kinds of hands: the asking hand, the withholding hand, and the spending hand, of which the best hand is the spending hand.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/173)"
        ],
        "index": 6133,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:35:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ عُمَرَ بْنِ أُذَيْنَةَ رَفَعَهُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَوْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ يُنْزِلُ اللَّهُ الْمَعُونَةَ مِنَ السَّمَاءِ إِلَى الْعَبْدِ بِقَدْرِ الْمَئُونَةِ فَمَنْ أَيْقَنَ بِالْخَلَفِ سَخَتْ نَفْسُهُ بِالنَّفَقَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Umar Bin Azina, ",
            "(It has been narrated) raising it to Abu Abdullah<sup>asws</sup>, or Abu Ja’far<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Sends down Aid from the sky to the servant by a measurement of the expenditure. So the one who is certain of the Replacement would overcome his soul and (continue to) spend for the essentials (for his family)’."
          ],
          "en.sarwar": [
            "7. Ahmad ibn Muhammad ibn has narrated from his father from Sa‘dan from al-Husayn ibn Ayman who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘O Husayn, you must spend (for deserving causes) and be certain about Allah’s replacing what you have spent. Any male or female servant (of Allah) who withholds spending for deserving causes that please Allah, the Most Majestic, the Most Glorious, ends up spending a double amount on such things that displeases Allah, the Most Majestic, the Most Glorious.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/173)"
        ],
        "index": 6134,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:35:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ دَخَلَ عَلَيْهِ مَوْلًى لَهُ فَقَالَ لَهُ هَلْ أَنْفَقْتَ الْيَوْمَ شَيْئاً قَالَ لَا وَ اللَّهِ فَقَالَ أَبُو الْحَسَنِ ( عليه السلام ) فَمِنْ أَيْنَ يُخْلِفُ اللَّهُ عَلَيْنَا أَنْفِقْ وَ لَوْ دِرْهَماً وَاحِداً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan Bin Yahya, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup>, said, ‘A slave of his<sup>asws</sup> came over to him<sup>asws</sup>, so he<sup>asws</sup> said to him: ‘Have you spent anything today?’ He said, ‘No, by Allah<sup>azwj</sup>’. So Abu Al-Hassan<sup>asws</sup> said: ‘So from where will Allah<sup>azwj</sup> Replace upon us? Spend, and even though it is one Dirham’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from ‘Umar ibn ‘Udhaynah in a marfu‘ manner from who has said the following: “Abu ‘Abd Allah or abu Ja‘far, ‘Alayhim al-Salam, has said, ‘Allah sends help from Heaven equal to the amount of expenditure. When one is certain about (Allah’s) replacing what is spent, his soul allows him to spend generously.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/173)"
        ],
        "index": 6135,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:35:9",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ يَضْمَنُ أَرْبَعَةً بِأَرْبَعَةِ أَبْيَاتٍ فِي الْجَنَّةِ أَنْفِقْ وَ لَا تَخَفْ فَقْراً وَ أَنْصِفِ النَّاسَ مِنْ نَفْسِكَ وَ أَفْشِ السَّلَامَ فِي الْعَالَمِ وَ اتْرُكِ الْمِرَاءَ وَ إِنْ كُنْتَ مُحِقّاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Muawiya Bin Wahab, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who guarantees four, would be with four houses in the Paradise – Spend (on the acts of kindness) and do not fear poverty, and do justice to the people from yourself (even if it is against you), and offer the greetings in the world (initiate loudly), and leave the (unnecessary) arguments even if you are rightful’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Safwan ibn Yahya from abu al-Hassan al-Rida, ‘Alayhi al- Salam, who has said the following: “The narrator has said, ‘Once, one of the servants of abu al-Hassan al-Rida, ‘Alayhi al-Salam, came in and the Imam asked, “Have you spent (for deserving causes) anything today?” He (the servant) replied, “No, I have not done so.” Abu al-Hassan, ‘Alayhi al-Salam, then said, “Wherefrom will Allah then grant us replacement? You must spend (for deserving causes), even if it would be one dirham only.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/173)"
        ],
        "part_type": "Hadith",
        "text": [
          "10ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ مَنْ يَضْمَنُ أَرْبَعَةً بِأَرْبَعَةِ أَبْيَاتٍ فِي الْجَنَّةِ أَنْفِقْ وَلا تَخَفْ فَقْراً وَأَنْصِفِ النَّاسَ مِنْ نَفْسِكَ وَأَفْشِ السَّلامَ فِي الْعَالَمِ وَاتْرُكِ الْمِرَاءَ وَإِنْ كُنْتَ مُحِقّاً. "
        ],
        "translations": {
          "en.sarwar": [
            "10. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from Mu‘awiyah ibn Wahab who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that one who is ready to guarantee to do four things will get four guaranteed homes in Paradise. They are: spending (for deserving causes) without fear from poverty, yielding to justice for people even against one’s own-self, offering greetings of peace loud and clearly in the world, and avoiding unneeded arguments, even if one is on the right side.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:1:35",
  "kind": "verse_list"
}