{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 37"
        },
        "path": "/books/al-kafi:4:1:37",
        "titles": {
          "ar": "بَابُ النَّوَادِرِ",
          "en": "Chapter 84 – The Miscellaneous"
        }
      }
    ],
    "index": 854,
    "local_index": 37,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 38"
        },
        "path": "/books/al-kafi:4:1:38",
        "titles": {
          "ar": "بَابُ فَضْلِ إِطْعَامِ الطَّعَامِ",
          "en": "Chapter 85 – Merits of feeding the food"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 36"
        },
        "path": "/books/al-kafi:4:1:36",
        "titles": {
          "ar": "بَابُ الْبُخْلِ وَ الشُّحِّ",
          "en": "Chapter 83 – ‘بُخْلٌ’The stinginess  and ‘الشُّحِّ’ the greed"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:1:37",
    "titles": {
      "ar": "بَابُ النَّوَادِرِ",
      "en": "Chapter 84 – The Miscellaneous"
    },
    "verse_count": 16,
    "verse_start_index": 6143,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/175)"
        ],
        "index": 6144,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:37:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ بْنِ سُفْيَانَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ يَأْتِي عَلَى النَّاسِ زَمَانٌ مَنْ سَأَلَ النَّاسَ عَاشَ وَ مَنْ سَكَتَ مَاتَ قُلْتُ فَمَا أَصْنَعُ إِنْ أَدْرَكْتُ ذَلِكَ الزَّمَانَ قَالَ تُعِينُهُمْ بِمَا عِنْدَكَ فَإِنْ لَمْ تَجِدْ فَتُجَاهِدُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Suleyman Bin Sufyan, from Is’haq Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There would come a time period upon the people, the one who asks the people would live and the one who remains silent would die’. I said, ‘So what should I do if I were to see that time period?’ He<sup>asws</sup> said: ‘Assist them (the poor) with what is with you. But if you do not find (them), then strive (for it)’."
          ],
          "en.sarwar": [
            "1. Al-Husayn ibn Muhammad has narrated from Mu’alla’ ibn Muhammad from Sulayman ibn Sufyan from Ishaq ibn ‘Ammar who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that a time will come when people who ask for help will survive, and those who do not ask for help will die. I then asked, ‘What shall I do if I find myself in such a time?’ He (the Imam) replied, ‘Help people by means of what you have and strive hard if you do not have anything.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/175)"
        ],
        "index": 6145,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:37:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ عَنْ عَبْدِ الْأَعْلَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَفْضَلُ الصَّدَقَةِ صَدَقَةٌ عَنْ ظَهْرِ غِنًى ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Muawiya Bin Wahab, from Abdul A’ala, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The most virtuous charity is that which is given without any interest in receiving anything in return."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from Mu‘awiyah ibn Wahab from ‘Abd al-‘A’la’ who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘The most virtuous charity is that which is given without any interest in receiving anything in return.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/175)"
        ],
        "index": 6146,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:37:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَفْضَلُ الصَّدَقَةِ صَدَقَةٌ تَكُونُ عَنْ فَضْلِ الْكَفِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The most superior of the charities is a charity which occurs from the excess of the palm’ (by stretching one’s means - when an extra effort is made)."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father, from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘The best charity is that which is out of surplus in (one’s) hands.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/176)"
        ],
        "index": 6147,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:37:4",
        "refs": {
          "Mentions": [
            "/books/quran:22:29",
            "/books/quran:22:28"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ أَطْعِمُوا الْبائِسَ الْفَقِيرَ قَالَ هُوَ الزَّمِنُ الَّذِي لَا يَسْتَطِيعُ أَنْ يَخْرُجَ لِزَمَانَتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:22#h28\">[22:28]</a> and feed the desperate one, the poor</span>. He<sup>asws</sup> said: ‘He is the one who is seriously ill, not being able that he could go out due to his chronic illness’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father, from al-Nawfaliy from al-Sakuniy who has said the following: “This is about the words of Allah, the Most Majestic, the Most Glorious, ‘feed the despondent poor one . . .’ <a href=\"/#/books/quran:22#h29\">[22:29]</a> Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Such a time is when he is unable to go out for help due to his illness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/176)"
        ],
        "index": 6148,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:37:5",
        "refs": {
          "Mentions": [
            "/books/quran:92:8",
            "/books/quran:92:6",
            "/books/quran:92:11",
            "/books/quran:92:5",
            "/books/quran:92:7"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مِهْرَانَ بْنِ مُحَمَّدٍ عَنْ سَعْدِ بْنِ طَرِيفٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَأَمَّا مَنْ أَعْطى وَ اتَّقى وَ صَدَّقَ بِالْحُسْنى بِأَنَّ اللَّهَ تَعَالَى يُعْطِي بِالْوَاحِدَةِ عَشَرَةً إِلَى مِائَةِ أَلْفٍ فَمَا زَادَ فَسَنُيَسِّرُهُ لِلْيُسْرى قَالَ لَا يُرِيدُ شَيْئاً مِنَ الْخَيْرِ إِلَّا يَسَّرَهُ اللَّهُ لَهُ",
          "وَ أَمَّا مَنْ بَخِلَ وَ اسْتَغْنى قَالَ بَخِلَ بِمَا آتَاهُ اللَّهُ عَزَّ وَ جَلَّ وَ كَذَّبَ بِالْحُسْنى بِأَنَّ اللَّهَ يُعْطِي بِالْوَاحِدَةِ عَشَرَةً إِلَى مِائَةِ أَلْفٍ فَمَا زَادَ فَسَنُيَسِّرُهُ لِلْعُسْرى قَالَ لَا يُرِيدُ شَيْئاً مِنَ الشَّرِّ إِلَّا يَسَّرَهُ لَهُ وَ ما يُغْنِي عَنْهُ مالُهُ إِذا تَرَدَّى قَالَ أَمَا وَ اللَّهِ مَا هُوَ تَرَدَّى فِي بِئْرٍ وَ لَا مِنْ جَبَلٍ وَ لَا مِنْ حَائِطٍ وَ لَكِنْ تَرَدَّى فِي نَارِ جَهَنَّمَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Mihran Bin Muhammad, from Sa’ad Bin Tareyf, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"> <a href=\"/#/books/quran:92#h5\">[92:5]</a> Then as for him who gives away and guards (against evil), <a href=\"/#/books/quran:92#h6\">[92:6]</a> And accepts the best</span> are the ones to whom Allah<sup>azwj</sup> the Exalted would Give for one (good deed), ten times or up to a hundred thousand times. So what is more <span class=\"ibTxt\"><a href=\"/#/books/quran:92#h7\">[92:7]</a> We will facilitate for him the easy end</span>’. He<sup>asws</sup> said: ‘He would not want anything from the goodness, except that Allah<sup>azwj</sup> would Make it easier for him.",
            "<span class=\"ibTxt\"><a href=\"/#/books/quran:92#h8\">[92:8]</a> And rejects the good words</span> (receiving Rewards from Allah), he<sup>asws</sup> said: ‘It is Allah’s Promise of tenfold reward for giving charity up to one hundred thousand or even more. We will soon make it difficult for him . . .’ The Imam<sup>asws</sup> said, ‘Whatever evil things he wants is made easy for him.’ ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:92#h11\">[92:11]</a> His wealth does not help him when he falls</span>, the Imam said, ‘This is not a fall into a well, from the top of a mountain, or from a wall, but it is a fall into Hell."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Mehran ibn Muhammad from Sa‘d ibn Tarif who has said the following: “This is about the words of Allah, the Most Majestic, the Most Glorious, ‘. . . As far as the one who gives (charity), observes piety and believes in good words (receiving good rewards from Allah). . . .’, Abu Ja’far, ‘Alayhi al-Salam, has said, ‘To such people Allah gives a tenfold reward or up to one hundred and even more.’ ‘. . . We make it easy for his comfort . . .’ the Imam said, ‘He does not do anything but that Allah makes it easy for him to achieve.’ ‘. . . As far the one who is stingy and rich . . .’ the Imam said, ‘He is stingy in what Allah, the Most Majestic, the Most Glorious, has granted him.’ ‘. . . and rejects the good words (receiving rewards from Allah) . . . ’ the Imam said, ‘It is Allah’s promise of tenfold reward for giving charity up to one hundred thousand or even more.’ ‘. . . We will soon make it difficult for him . . .’ the Imam said, ‘Whatever evil things he wants is made easy for him.’ ‘. . . His wealth does not help him when he falls . . .’ (92:4-11), the Imam said, ‘This is not a fall into a well, from the top of a mountain, or from a wall. It is a fall into hellfire.”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/177)"
        ],
        "index": 6149,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:37:6",
        "text": [
          "وَ عَنْهُ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ زُرَارَةَ عَنْ سَالِمِ بْنِ أَبِي حَفْصَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى يَقُولُ مَا مِنْ شَيْ‏ءٍ إِلَّا وَ قَدْ وَكَّلْتُ بِهِ مَنْ يَقْبِضَهُ غَيْرِي إِلَّا الصَّدَقَةَ فَإِنِّي أَتَلَقَّفُهَا بِيَدِي تَلَقُّفاً حَتَّى إِنَّ الرَّجُلَ لَيَتَصَدَّقُ بِالتَّمْرَةِ أَوْ بِشِقِّ تَمْرَةٍ فَأُرَبِّيهَا لَهُ كَمَا يُرَبِّي الرَّجُلُ فَلُوَّهُ وَ فَصِيلَهُ فَيَأْتِي يَوْمَ الْقِيَامَةِ وَ هُوَ مِثْلُ أُحُدٍ وَ أَعْظَمُ مِنْ أُحُدٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from his father, from Ibn Abu Umeyr, from hisham Bin Salim, from Zurara, from Salim Bin Abu Hafs, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said that: ‘Allah<sup>azwj</sup> Blessed and High is Saying: “There is none from the things except that I<sup>azwj</sup> have Allocated with it the one who takes possession of it apart from Me<sup>azwj</sup>, except for the charity, for I<sup>azwj</sup> Receive it in My<sup>azwj</sup> Hands with a Reception, to the extent that the man gives charity with the date, or with part of a date, so I<sup>azwj</sup> Nourish it for him just as the man nourishes his foal and his family. So he would come on the Day of Judgement and it would be like (the mount) Ohad, but rather greater than (the mount) Ohad’."
          ],
          "en.sarwar": [
            "6. It is narrated from the narrator of previous Hadith from his father from ibn abu ‘Umayr from Hisham ibn Salim from Zurarah from Salim ibn abu Hafsah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Allah, the most Blessed, the most High, has said, "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/177)"
        ],
        "index": 6150,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:37:7",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَمَّنْ حَدَّثَهُ عَنْ عَبْدِ الرَّحْمَنِ الْعَزْرَمِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ جَاءَ رَجُلٌ إِلَى الْحَسَنِ وَ الْحُسَيْنِ ( عليه السلام ) وَ هُمَا جَالِسَانِ عَلَى الصَّفَا فَسَأَلَهُمَا فَقَالَا إِنَّ الصَّدَقَةَ لَا تَحِلُّ إِلَّا فِي دَيْنٍ مُوجِعٍ أَوْ غُرْمٍ مُفْظِعٍ أَوْ فَقْرٍ مُدْقِعٍ فَفِيكَ شَيْ‏ءٌ مِنْ هَذَا قَالَ نَعَمْ فَأَعْطَيَاهُ وَ قَدْ كَانَ الرَّجُلُ سَأَلَ عَبْدَ اللَّهِ بْنَ عُمَرَ وَ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ فَأَعْطَيَاهُ وَ لَمْ يَسْأَلَاهُ عَنْ شَيْ‏ءٍ فَرَجَعَ إِلَيْهِمَا فَقَالَ لَهُمَا مَا لَكُمَا لَمْ تَسْأَلَانِي عَمَّا سَأَلَنِي عَنْهُ الْحَسَنُ وَ الْحُسَيْنُ ( عليه السلام ) وَ أَخْبَرَهُمَا بِمَا قَالَا فَقَالَا إِنَّهُمَا غُذِّيَا بِالْعِلْمِ غِذَاءً ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from the one who narrated it, from Abdul Rahman Al Azramy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A man came over to Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup>, and they<sup>asws</sup> were both seated upon Al-Safa (a mat made with dried leafs or jute). So he begged from them<sup>asws</sup> both, so they<sup>asws</sup> said: ‘The charity is not Permissible except regarding a painful debt, or a repulsive loss, or abject poverty. So, is there anything from this in you?’ He said, ‘Yes’. So they<sup>asws</sup> gave him, and the man had begged from Abdullah Bin Umar, and Abdul Rahman Bin Abu Bakr, but they had given him and had not asked him about anything. So he returned to both of them, so he said to them, ‘What is the matter with the two of you? You two did not ask me about what Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup> asked me?’ And he informed them with what they<sup>asws</sup> had said. So they said, ‘Those two<sup>asws</sup> have been fed with the food of knowledge’."
          ],
          "en.sarwar": [
            "7. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father from those who narrated to him from ‘Abd al-Rahman al-‘Arzamiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that a man once came to al-Hassan and al-Husayn, ‘Alayhim al-Salam, when the two of them were sitting on al-Safa’ (the small hill in Makkah). He asked them for charity and they said, ‘Charity can only be paid to one who suffers from a troubling debt, a disgracing loss or severe poverty. Do you have any one of such conditions?’ He replied, ‘Yes, I do.’ They then gave him something. He had asked ‘Abd Allah ibn ‘Umar and ‘Abd al-Rahman ibn abu Bakr for charity, and they had given him something without asking him any questions. He then went back to them and asked, ‘Why did you not ask me any questions as al-Hassan and al-Husayn, ‘Alayhim al-Salam, have done?’ He informed them about what al-Hassan and al-Husayn had asked. They replied, ‘They (al-Hassan and al-Husayn) are being fed with a great deal of knowledge.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/177)"
        ],
        "index": 6151,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:37:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَمَّنْ حَدَّثَهُ عَنْ مِسْمَعٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَا تَسْأَلُوا أُمَّتِي فِي مَجَالِسِهَا فَتُبَخِّلُوهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from the one who narrated it, from Misma’a, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Do not beg from my<sup>saww</sup> community in their gatherings, so you would make them to be miserly’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hassan ibn Mahbub from those who narrated to him from Misma’ who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘Do not ask my followers for charity in their gatherings, because you may make them seem stingy.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/178)"
        ],
        "index": 6152,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:37:9",
        "refs": {
          "Mentions": [
            "/books/quran:2:264",
            "/books/quran:2:267"
          ]
        },
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ أَبَانٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ يا أَيُّهَا الَّذِينَ آمَنُوا أَنْفِقُوا مِنْ طَيِّباتِ ما كَسَبْتُمْ وَ مِمَّا أَخْرَجْنا لَكُمْ مِنَ الْأَرْضِ وَ لا تَيَمَّمُوا الْخَبِيثَ مِنْهُ تُنْفِقُونَ قَالَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِذَا أَمَرَ بِالنَّخْلِ أَنْ يُزَكَّى يَجِي‏ءُ قَوْمٌ بِأَلْوَانٍ مِنْ تَمْرٍ وَ هُوَ مِنْ أَرْدَى التَّمْرِ يُؤَدُّونَهُ مِنْ زَكَاتِهِمْ تَمْراً يُقَالُ لَهُ الْجُعْرُورُ وَ الْمِعَى‏ فَأْرَةُ قَلِيلَةَ اللِّحَاءِ عَظِيمَةَ النَّوَى وَ كَانَ بَعْضُهُمْ يَجِي‏ءُ بِهَا عَنِ التَّمْرِ الْجَيِّدِ ",
          "فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَا تَخْرُصُوا هَاتَيْنِ التَّمْرَتَيْنِ وَ لَا تَجِيئُوا مِنْهَا بِشَيْ‏ءٍ وَ فِي ذَلِكَ نَزَلَ وَ لا تَيَمَّمُوا الْخَبِيثَ مِنْهُ تُنْفِقُونَ وَ لَسْتُمْ بِآخِذِيهِ إِلَّا أَنْ تُغْمِضُوا فِيهِ وَ الْإِغْمَاضُ أَنْ تَأْخُذَ هَاتَيْنِ التَّمْرَتَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan Bin Ali Al Washa, from Aban, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h267\">[2:267]</a> O you who believe! Spend (benevolently) from the good things that you earn and from what We have Extracted for you out from the earth, but do not aim at what is bad that you may spend from of it</span>. He<sup>asws</sup> said: ‘When Rasool-Allah<sup>saww</sup> wanted people to pay Zakaat of dates (Zakaat to be given from fruits), a group of people came with types of dates, and these were from the ruined dates, paying is as their Zakaat, dates called Al <span class=\"iTxt\">Ju’rour</span>, and <span class=\"iTxt\">Al Mi’ay</span>, with little fruit and large cores; and some of them came over with it instead of the good quality dates.",
            "So Rasool-Allah<sup>saww</sup> said: ‘Do not bring these two dates, and do not come with anything from these’. And it was regarding that, it was Revealed <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h267\">[2:267]</a> and do not aim at what is bad that you may spend from of it, while you would not take it yourselves unless you close your eyes (with disdain)</span>, and the closing of the eyes is that you take these two dates (and give it as Zakaat)’."
          ],
          "en.sarwar": [
            "9. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ ibn Muhammad from al-Hassan ibn Ali al-Washsha’ from Aban from abu Basir who has said the following: “This is about the words of Allah, the Most Majestic, the Most Glorious, ‘Believers, give charity of good quality things that you have earned and of what We make to grow for you from the land. You must not aim at less valuable things to give for charity. . . .’<a href=\"/#/books/quran:2#h267\">[2:267]</a> Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘When the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, wanted people to pay zakat of dates, they would bring all kinds of dates, including undesirable quality dates to pay for zakat. Of such dates was a kind called al-Ju‘rur and al-Mi‘afarah, which has very little fruit, but has a large stone inside. Certain people would bring this kind of date to give for zakat instead of a good quality date. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, asked them not to bring such dates to give for zakat, and the above-mentioned verse of the Holy Quran was revealed about this case. “Believers, give charity of good quality things that you have earned and of what We make to grow for you from the land. You must not aim at less valuable things which even you do not accept, unless you overlook to give for charity.” <a href=\"/#/books/quran:2#h264\">[2:264]</a> “Overlook” means giving in charity of very inferior quality goods like the two kinds of dates just mentioned.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/178)"
        ],
        "index": 6153,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:37:10",
        "refs": {
          "Mentions": [
            "/books/quran:2:264",
            "/books/quran:2:267"
          ]
        },
        "text": [
          "وَ فِي رِوَايَةٍ أُخْرَى عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ أَنْفِقُوا مِنْ طَيِّباتِ ما كَسَبْتُمْ فَقَالَ كَانَ الْقَوْمُ قَدْ كَسَبُوا مَكَاسِبَ سَوْءٍ فِي الْجَاهِلِيَّةِ فَلَمَّا أَسْلَمُوا أَرَادُوا أَنْ يُخْرِجُوهَا مِنْ أَمْوَالِهِمْ لِيَتَصَدَّقُوا بِهَا فَأَبَى اللَّهُ تَبَارَكَ وَ تَعَالَى إِلَّا أَنْ يُخْرِجُوا مِنْ أَطْيَبِ مَا كَسَبُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "And in another report, from Abu Baseer, from Abu Abdullah<sup>asws</sup> regarding the Word of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h267\">[2:267]</a> Spend (benevolently) from the good things that you earn</span>, so he<sup>asws</sup> said: ‘The people had earned evil earning during the Pre-Islamic period. So when they became Muslims, they wanted that they take these (evil earnings) from their wealth in order to give charity with it. So, Allah<sup>azwj</sup> Blessed and High Refused except that they should take out from the good of what they had been earning’."
          ],
          "en.sarwar": [
            "10. In another Hadith, it is narrated from abu Basir who has said the following: “This is about the words of Allah, the Most Majestic, the Most Glorious, ‘Pay charity out of good things you have earned. . . .’ <a href=\"/#/books/quran:2#h264\">[2:264]</a> Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ‘people before Islam had made loathsome earnings. After accepting Islam they wanted to pay such earnings for zakat, but Allah, the most Blessed, the most High, refused to accept such payments instead of payment out of their good quality earnings.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/178)"
        ],
        "index": 6154,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:37:11",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) فَقَالَ إِنِّي شَيْخٌ كَثِيرُ الْعِيَالِ ضَعِيفُ الرُّكْنِ قَلِيلُ الشَّيْ‏ءِ فَهَلْ مِنْ مَعُونَةٍ عَلَى زَمَانِي فَنَظَرَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِلَى أَصْحَابِهِ وَ نَظَرَ إِلَيْهِ أَصْحَابُهُ وَ قَالَ قَدْ أَسْمَعَنَا الْقَوْلَ وَ أَسْمَعَكُمْ فَقَامَ إِلَيْهِ رَجُلٌ فَقَالَ كُنْتُ مِثْلَكَ بِالْأَمْسِ فَذَهَبَ بِهِ إِلَى مَنْزِلِهِ فَأَعْطَاهُ مِرْوَداً مِنْ تِبْرٍ وَ كَانُوا يَتَبَايَعُونَ بِالتِّبْرِ وَ هُوَ الذَّهَبُ وَ الْفِضَّةُ فَقَالَ الشَّيْخُ هَذَا كُلُّهُ قَالَ نَعَمْ فَقَالَ الشَّيْخُ أَقْبَلُ تِبْرَكَ فَإِنِّي لَسْتُ بِجِنِّيٍّ وَ لَا إِنْسِيٍّ وَ لَكِنِّي رَسُولٌ مِنَ اللَّهِ لِأَبْلُوَكَ فَوَجَدْتُكَ شَاكِراً فَجَزَاكَ اللَّهُ خَيْراً ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from a man, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A man came over to the Prophet<sup>saww</sup>, so he said: ‘I am an old man with a lot of dependants, weak of health, with few things. So, is there an assistance upon my time?’ So Rasool-Allah<sup>saww</sup> looked at his<sup>saww</sup> companions, and his<sup>saww</sup> companions looked at him<sup>saww</sup> and he<sup>saww</sup> said, ‘He made us<sup>saww</sup> to hear the speech, and made you all to hear it’. So a man stood up and he said, ‘I was like you yesterday’. So he went away with him to his house and gave him an ingot, and they used to be trading with the ingot, and it was the gold and the silver. So the old man said, ‘This is all of it (for me)?’ He said, ‘Yes’. So the old man said, ‘I accept your ingot, and I am neither a jinn nor a human, but I am a Messenger from Allah<sup>azwj</sup> to test you, so you have been found to be grateful. May Allah<sup>azwj</sup> Recompense you goodly’."
          ],
          "en.sarwar": [
            "11. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ‘Uthman ibn ‘Isa from a man who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that once a man came to the Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and said, ‘I am an old man with a large family to feed, of weak health and poor. Is there any help to overcome my difficulties?’ The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, looked to his companions and his companions looked at him. He said, ‘He made us and you to hear his words.’ A man then stood up and said, ‘Yesterday I was like you.’ He then took him to his house and gave him a bar of gold that they used instead of currency for buying and selling. The old man then asked, ‘Is all this for me?’ He said, ‘Yes, all of it is for you.’ The old man said, ‘I accept your bar of gold, but I am not a Jinny or a human being. I am a messenger of Allah to test you. I have found you a thankful person. May Allah grant you good reward.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/179)"
        ],
        "index": 6155,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:37:12",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ مِسْمَعِ بْنِ عَبْدِ الْمَلِكِ قَالَ كُنَّا عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) بِمِنًى وَ بَيْنَ أَيْدِينَا عِنَبٌ نَأْكُلُهُ فَجَاءَ سَائِلٌ فَسَأَلَهُ فَأَمَرَ بِعُنْقُودٍ فَأَعْطَاهُ فَقَالَ السَّائِلُ لَا حَاجَةَ لِي فِي هَذَا إِنْ كَانَ دِرْهَمٌ قَالَ يَسَعُ اللَّهُ عَلَيْكَ فَذَهَبَ ثُمَّ رَجَعَ فَقَالَ رُدُّوا الْعُنْقُودَ فَقَالَ يَسَعُ اللَّهُ لَكَ وَ لَمْ يُعْطِهِ شَيْئاً ",
          "ثُمَّ جَاءَ سَائِلٌ آخَرُ فَأَخَذَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) ثَلَاثَ حَبَّاتِ عِنَبٍ فَنَاوَلَهَا إِيَّاهُ فَأَخَذَ السَّائِلُ مِنْ يَدِهِ ثُمَّ قَالَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ الَّذِي رَزَقَنِي فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَكَانَكَ فَحَشَا مِلْ‏ءَ كَفَّيْهِ عِنَباً فَنَاوَلَهَا إِيَّاهُ فَأَخَذَهَا السَّائِلُ مِنْ يَدِهِ ثُمَّ قَالَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَكَانَكَ يَا غُلَامُ أَيُّ شَيْ‏ءٍ مَعَكَ مِنَ الدَّرَاهِمِ فَإِذَا مَعَهُ نَحْوٌ مِنْ عِشْرِينَ دِرْهَماً فِيمَا حَزَرْنَاهُ أَوْ نَحْوِهَا فَنَاوَلَهَا إِيَّاهُ فَأَخَذَهَا ثُمَّ قَالَ الْحَمْدُ لِلَّهِ هَذَا مِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَكَانَكَ فَخَلَعَ قَمِيصاً كَانَ عَلَيْهِ فَقَالَ الْبَسْ هَذَا فَلَبِسَهُ ثُمَّ قَالَ الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي وَ سَتَرَنِي يَا أَبَا عَبْدِ اللَّهِ أَوْ قَالَ جَزَاكَ اللَّهُ خَيْراً لَمْ يَدْعُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِلَّا بِذَا ثُمَّ انْصَرَفَ فَذَهَبَ ",
          "قَالَ فَظَنَنَّا أَنَّهُ لَوْ لَمْ يَدْعُ لَهُ لَمْ يَزَلْ يُعْطِيهِ لِأَنَّهُ كُلَّمَا كَانَ يُعْطِيهِ حَمِدَ اللَّهَ أَعْطَاهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Usman Bin Isa, from Misma’a Bin Abdul Malik who said, ",
            "‘We were in the presence of Abu Abdullah<sup>asws</sup> at Mina, and in front of us were grapes we were eating from. So a beggar came over and begged from him<sup>asws</sup>. So he<sup>asws</sup> ordered from some grapes to be given to him. So the beggar said, ‘There is no need for me regarding this, if it was Dirham?’ He<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> Extend upon you’. So he went away, then returned, so he said, ‘Give me back the grapes’. So he<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> Extend upon you’, and did not give him anything.",
            "Then another beggar came over, so Abu Abdullah<sup>asws</sup> grabbed three seeds of grapes and gave it to him. So the beggar took it from his<sup>asws</sup> hand, then said, ‘The Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds Who Graced me’. So Abu Abdullah<sup>asws</sup> said: ‘Stay in your place’. So he<sup>asws</sup> scooped and filled his<sup>asws</sup> palms with grapes and gave these to him. So the beggar took them from his<sup>asws</sup> hand, then said, ‘The Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds’. ",
            "So Abu Abdullah<sup>asws</sup> said: ‘Stay in your place! O slave, which thing is with you from the Dirhams?’ So there were approximately twenty Dirhams with him regarding what he witnessed, or approximate to it. So he<sup>asws</sup> gave these to him. So he took them, then said, ‘The Praise is for Allah<sup>azwj</sup>. This is from You<sup>azwj</sup>, there being no associates for You<sup>azwj</sup>’. ",
            "So Abu Abdullah<sup>asws</sup> said: ‘Stay in your place’. So he<sup>asws</sup> took off his<sup>asws</sup> shirt which was upon him<sup>asws</sup> and he<sup>asws</sup> said; ‘Wear this’. So he wore it, then said, ‘The Praise is for Allah<sup>azwj</sup> Who Clothed me and veiled me, O Abu Abdullah<sup>asws</sup>!’ Or he said, ‘May Allah<sup>azwj</sup> Recompense you<sup>asws</sup> goodly’, not supplicating for Abu Abdullah<sup>asws</sup> except with that. Then he left and went away. ",
            "He (the narrator) said, ‘We thought that he, if he had not supplicated for him<sup>asws</sup>, he<sup>asws</sup> would not have ceased to keep giving him, because every time he<sup>asws</sup> gave him, he kept on Praising Allah<sup>azwj</sup>, (and) he<sup>asws</sup> kept on giving him’."
          ],
          "en.sarwar": [
            "12. Ahmad ibn Muhammad has narrated from ‘Uthman ibn ‘Isa from Misma’ ibn ‘Abd al-Malik who has said the following: “Once we were in the presence of abu ‘Abd Allah, ‘Alayhi al-Salam, in Mina (a place in Makkah). We were eating grapes when a man came asking for help. Imam told someone to give him a bunch. The man said, ‘I do not need this. I need dirhams.’ The Imam said, ‘May Allah grant you a great deal.’ The man went away and then came back saying, ‘Give me that bunch of grapes.’ The Imam said, ‘May Allah give you a great deal and did not give him anything.’ Soon, another man came and asked for help. The Imam offered him just three pieces of grape that he accepted and said, ‘All praise belongs to Allah, the Lord of the worlds who has granted me sustenance.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘Wait,’ filled up both of his hands with grapes and gave it to him. The man took the grapes from the Imam and said, ‘All praise belongs to Allah, the Lord of the worlds.’ He (the Imam) then said, ‘Wait,’ and he (the Imam) asked his servant, saying, ‘How many dirhams do you have with you?’ We estimated there were about twenty dirhams with the servant. He gave them to the man, who took them and said, ‘All praise belongs to Allah. This is from You alone and You have no partners.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, then said, ‘Wait,’ and he (the Imam) took off his shirt and said, ‘Wear this.’ The man took the shirt and said, ‘O abu ‘Abd Allah, all praise belongs to Allah who has granted me clothes and covering.’ Or he said, ‘O abu ‘Abd Allah, may Allah grant you good rewards. Nothing except this is left with abu ‘Abd Allah.’ He then left. We thought had he not prayed for ‘Abd Allah, he would keep giving him something as long as he kept praising Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/179)"
        ],
        "index": 6156,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:37:13",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا ضَاقَ أَحَدُكُمْ فَلْيُعْلِمْ أَخَاهُ وَ لَا يُعِينُ عَلَى نَفْسِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When one of you is (financially) constrained, so let him inform him brother, when he cannot support himself’."
          ],
          "en.sarwar": [
            "13. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that if it becomes difficult for one of you, you should inform your brother (in belief) while you are unable to help yourself.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/179)"
        ],
        "index": 6157,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:37:14",
        "text": [
          "مُحَمَّدُ بْنُ عَلِيٍّ عَنْ مَعْمَرٍ رَفَعَهُ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ صَلَوَاتُ اللَّهِ عَلَيْهِ فِي بَعْضِ خُطَبِهِ إِنَّ أَفْضَلَ الْفِعَالِ صِيَانَةُ الْعِرْضِ بِالْمَالِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ali, from Moama, raising it, said, ",
            "‘Amir Al-Momineen<sup>asws</sup> said in one of his<sup>asws</sup> sermons: ‘The most superior deed is maintaining the dignity with the wealth’."
          ],
          "en.sarwar": [
            "14. Muhammad ibn Ali has narrated from Mu’ammar in a marfu‘ manner from ’Amir al-Mu’minin, ‘Alayhi al-Salam, who has said the following: “In one of his speeches, ’Amir al-Mu’minin, ‘Alayhi al-Salam, has said, ‘The best deed is protecting one’s dignity by means of wealth.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/180)"
        ],
        "index": 6158,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:37:15",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ زُرَارَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ ثَلَاثَةٌ إِنْ يَعْلَمْهُنَّ الْمُؤْمِنُ كَانَتْ زِيَادَةً فِي عُمُرِهِ وَ بَقَاءَ النِّعْمَةِ عَلَيْهِ فَقُلْتُ وَ مَا هُنَّ قَالَ تَطْوِيلُهُ فِي رُكُوعِهِ وَ سُجُودِهِ فِي صَلَاتِهِ وَ تَطْوِيلُهُ لِجُلُوسِهِ عَلَى طَعَامِهِ إِذَا أَطْعَمَ عَلَى مَائِدَتِهِ وَ اصْطِنَاعُهُ الْمَعْرُوفَ إِلَى أَهْلِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel Bin Darraj, from Zurara who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘There are three things, if the Believer were to know these, it would result in an increase in his life span, and a lasting for the Bounties upon him’. So I said, ‘And what are these?’ He<sup>asws</sup> said: ‘His prolongation in his Bowings and his Prostrations in his Prayer, and his prolongation in his sitting upon his meal when he is feeding (others) upon his table spread, and his performing of the act of kindness upon his family’."
          ],
          "en.sarwar": [
            "15. Ali ibn Ibrahim has narrated from his father from ibn abu ‘ Umayr from Jamil ibn Darraj from Zurarah who has said the following: “I heard abu ‘ Abd Allah, ‘Alayhi al-Salam, say, ‘There are three things which would help lengthen his life if a believing person comes to know them and make his wealth more durable.’ I then asked, ‘What are those things?’ The Imam replied, ‘They are remaining in Ruku’ for a long time, as well as in his Sajdah during prayer (Salat), his sitting for a long time on the table when feeding people, and those providing Benevolent Assistance to properly deserving people.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/180)"
        ],
        "index": 6159,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:37:16",
        "refs": {
          "Mentions": [
            "/books/quran:48:29"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) قُلْتُ قَوْمٌ عِنْدَهُمْ فُضُولٌ وَ بِإِخْوَانِهِمْ حَاجَةٌ شَدِيدَةٌ وَ لَيْسَ تَسَعُهُمُ الزَّكَاةُ أَ يَسَعُهُمْ أَنْ يَشْبَعُوا وَ يَجُوعَ إِخْوَانُهُمْ فَإِنَّ الزَّمَانَ شَدِيدٌ فَقَالَ الْمُسْلِمُ أَخُو الْمُسْلِمِ لَا يَظْلِمُهُ وَ لَا يَخْذُلُهُ وَ لَا يَحْرِمُهُ فَيَحِقُّ عَلَى الْمُسْلِمِينَ الِاجْتِهَادُ فِيهِ وَ التَّوَاصُلُ وَ التَّعَاوُنُ عَلَيْهِ وَ الْمُوَاسَاةُ لِأَهْلِ الْحَاجَةِ وَ الْعَطْفُ مِنْكُمْ يَكُونُونَ عَلَى مَا أَمَرَ اللَّهُ فِيهِمْ رُحَماءُ بَيْنَهُمْ مُتَرَاحِمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Usman Bin Isa, from Sama’at who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup>, ‘I said, ‘A group of people have excess with them, and with their brethren there is an intense need, and the Zakat is not sufficient for them. Do they have the leeway that they should be satiated and their brethren are hungry, during the difficult times?’ So he<sup>asws</sup> said: ‘The Muslim is a brother of the Muslim, not being unjust to him, not abandoning him, nor depriving him. So there is an entitlement upon the Muslim of the striving regarding him, and the maintenance of goodly relations, and the assistance upon him, and the sympathy for the needy ones, and the kindness from them happens to be upon what Allah<sup>azwj</sup> has Commanded regarding them<span class=\"ibTxt\"> <a href=\"/#/books/quran:48#h29\">[48:29]</a> compassionate among themselves</span>, being merciful to each other’."
          ],
          "en.sarwar": [
            "16. A number of our people have narrated from Ahmad ibn Muhammad from ‘Uthman ibn ‘Isa from Sama‘ah who has said the following: “Once I explained before abu ‘Abd Allah, ‘Alayhi al-Salam, about a people who are affluent, but have certain ones among them who are extremely needy. Zakat is not enough for them. ‘Can these affluent people live satisfied while their people suffer from hunger in such a difficult time?’ The Imam said, ‘The Muslims are each other’s brothers (in belief). It is not permissible for them to do injustice to each other, betray or deprive one another. It is necessary for a Muslim to strive hard and maintain good relations, cooperation and sympathy with the needy ones. It is showing kindness to each other about which Allah has issued His commanded on you to follow, ‘. . . They are kind to each other. . . ( 48 : 29 )’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:1:37",
  "kind": "verse_list"
}