{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 4"
        },
        "path": "/books/al-kafi:4:1:4",
        "titles": {
          "ar": "بَابُ صَدَقَةِ اللَّيْلِ ",
          "en": "Chapter 51 – Charity during the night"
        }
      }
    ],
    "index": 821,
    "local_index": 4,
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:1:4",
    "titles": {
      "ar": "بَابُ صَدَقَةِ اللَّيْلِ ",
      "en": "Chapter 51 – Charity during the night"
    },
    "verse_count": 3,
    "verse_start_index": 5990,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/132)"
        ],
        "index": 5991,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:4:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ قَالَ كَانَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا أَعْتَمَ وَ ذَهَبَ مِنَ اللَّيْلِ شَطْرُهُ أَخَذَ جِرَاباً فِيهِ خُبْزٌ وَ لَحْمٌ وَ الدَّرَاهِمُ فَحَمَلَهُ عَلَى عُنُقِهِ ثُمَّ ذَهَبَ بِهِ إِلَى أَهْلِ الْحَاجَةِ مِنْ أَهْلِ الْمَدِينَةِ فَقَسَمَهُ فِيهِمْ وَ لَا يَعْرِفُونَهُ فَلَمَّا مَضَى أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَقَدُوا ذَلِكَ فَعَلِمُوا أَنَّهُ كَانَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Hisham Bin Salim who said, ",
            "‘When darkness used to fall and half the night passed, Abu Abdullah<sup>asws</sup> would take a basket wherein would be bread, and meat, and the Dirhams. So he<sup>asws</sup> would carry it upon his<sup>asws</sup> neck, then go with it to the needy people from the inhabitants of Al-Medina, and distribute it among them, and they would not recognise him<sup>asws</sup>. So when Abu Abdullah<sup>asws</sup> passed away, they missed that, then they came to know it was Abu Abdullah<sup>asws</sup> (doing that)’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn abu ‘Umayr from Hisham ibn Salim who has said the following: “When it became dark and a part of the night had passed, abu ‘ Abd Allah, ‘Alayhi al-Salam, would pick up on his shoulder a sack of bread, meat and money and go to the needy people of al-Madinah, distribute it among them, and no one knew who he was. When abu ‘Abd Allah, ‘Alayhi al-Salam, passed away, they missed him and realized that he (the helping person) was abu ‘Abd Allah, ‘Alayhi al-Salam.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/132)"
        ],
        "index": 5992,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:4:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ عَنْ آبَائِهِ ( عليهم السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِذَا طَرَقَكُمْ سَائِلٌ ذَكَرٌ بِلَيْلٍ فَلَا تَرُدُّوهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, from his<sup>asws</sup> forefathers<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘When a beggar comes your way mentioning (seeking help) at night, so do not return him (empty handed)’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy from al-Sakuniy, who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘If a needy person comes to you during the night asking for help, you must not turn him away (without giving any charity).’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/133)"
        ],
        "index": 5993,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:4:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ سَعْدَانَ بْنِ مُسْلِمٍ عَنْ مُعَلَّى بْنِ خُنَيْسٍ قَالَ خَرَجَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فِي لَيْلَةٍ قَدْ رُشَّتْ وَ هُوَ يُرِيدُ ظُلَّةَ بَنِي سَاعِدَةَ فَاتَّبَعْتُهُ فَإِذَا هُوَ قَدْ سَقَطَ مِنْهُ شَيْ‏ءٌ فَقَالَ بِسْمِ اللَّهِ اللَّهُمَّ رُدَّ عَلَيْنَا",
          "قَالَ فَأَتَيْتُهُ فَسَلَّمْتُ عَلَيْهِ قَالَ فَقَالَ مُعَلًّى قُلْتُ نَعَمْ جُعِلْتُ فِدَاكَ فَقَالَ لِي الْتَمِسْ بِيَدِكَ فَمَا وَجَدْتَ مِنْ شَيْ‏ءٍ فَادْفَعْهُ إِلَيَّ فَإِذَا أَنَا بِخُبْزٍ مُنْتَشِرٍ كَثِيرٍ فَجَعَلْتُ أَدْفَعُ إِلَيْهِ مَا وَجَدْتُ فَإِذَا أَنَا بِجِرَابٍ أَعْجِزُ عَنْ حَمْلِهِ مِنْ خُبْزٍ فَقُلْتُ جُعِلْتُ فِدَاكَ أَحْمِلُهُ عَلَى رَأْسِي فَقَالَ لَا أَنَا أَوْلَى بِهِ مِنْكَ وَ لَكِنِ امْضِ مَعِي ",
          "قَالَ فَأَتَيْنَا ظُلَّةَ بَنِي سَاعِدَةَ فَإِذَا نَحْنُ بِقَوْمٍ نِيَامٍ فَجَعَلَ يَدُسُّ الرَّغِيفَ وَ الرَّغِيفَيْنِ حَتَّى أَتَى عَلَى آخِرِهِمْ ثُمَّ انْصَرَفْنَا فَقُلْتُ جُعِلْتُ فِدَاكَ يَعْرِفُ هَؤُلَاءِ الْحَقَّ فَقَالَ لَوْ عَرَفُوهُ لَوَاسَيْنَاهُمْ بِالدُّقَّةِ وَ الدُّقَّةُ هِيَ الْمِلْحُ ",
          "إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى لَمْ يَخْلُقْ شَيْئاً إِلَّا وَ لَهُ خَازِنٌ يَخْزُنُهُ إِلَّا الصَّدَقَةَ فَإِنَّ الرَّبَّ يَلِيهَا بِنَفْسِهِ وَ كَانَ أَبِي إِذَا تَصَدَّقَ بِشَيْ‏ءٍ وَضَعَهُ فِي يَدِ السَّائِلِ ثُمَّ ارْتَدَّهُ مِنْهُ فَقَبَّلَهُ وَ شَمَّهُ ثُمَّ رَدَّهُ فِي يَدِ السَّائِلِ إِنَّ صَدَقَةَ اللَّيْلِ تُطْفِئُ غَضَبَ الرَّبِّ وَ تَمْحُو الذَّنْبَ الْعَظِيمَ وَ تُهَوِّنُ الْحِسَابَ وَ صَدَقَةَ النَّهَارِ تُثْمِرُ الْمَالَ وَ تَزِيدُ فِي الْعُمُرِ ",
          "إِنَّ عِيسَى ابْنَ مَرْيَمَ ( عليها السلام ) لَمَّا أَنْ مَرَّ عَلَى شَاطِئِ الْبَحْرِ رَمَى بِقُرْصٍ مِنْ قُوتِهِ فِي الْمَاءِ فَقَالَ لَهُ بَعْضُ الْحَوَارِيِّينَ يَا رُوحَ اللَّهِ وَ كَلِمَتَهُ لِمَ فَعَلْتَ هَذَا وَ إِنَّمَا هُوَ مِنْ قُوتِكَ قَالَ فَقَالَ فَعَلْتُ هَذَا لِدَابَّةٍ تَأْكُلُهُ مِنْ دَوَابِّ الْمَاءِ وَ ثَوَابُهُ عِنْدَ اللَّهِ عَظِيمٌ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Khalid, from Sa’dan Bin Muslim, from Moalla Bin Khunays who said, ",
            "‘Abu Abdullah<sup>asws</sup> went out during a night and it had drizzled, and he<sup>asws</sup> was intending (to go to) a canopy of the Clan of Saeeda, so I followed him<sup>asws</sup>, and there was something which had dropped off from him<sup>asws</sup>. So he<sup>asws</sup> said: ‘O Allah<sup>azwj</sup>, Return it to us<sup>asws</sup>’. ",
            "He (the narrator) said, ‘So I followed him<sup>asws</sup> and greeted him<sup>asws</sup>. So he<sup>asws</sup> said: ‘Moalla?’ I said, ‘Yes, may I be sacrificed for you<sup>asws</sup>’. So he<sup>asws</sup> said to me: ‘Seek with your hands, so whatever you find from anything, hand it over to me<sup>asws</sup>’. I found a lot of pieces of bread, and I went on handing these over to him<sup>asws</sup>, whatever I found. So then I was with a basket of bread which I was frustrated from carrying it, so I said, ‘May I be sacrificed for you<sup>asws</sup>! Carry it upon my head’. So he<sup>asws</sup> said: ‘No, I<sup>asws</sup> am first with it than you are, but come with me<sup>asws</sup>’. ",
            "He (the narrator) said, ‘So we came over to a canopy of the Clan of Saeeda, and we were with a group of people sleeping. So he<sup>asws</sup> went on to tuck the bread, and two breads until he<sup>asws</sup> came to the last of them. Then we left, so I said, ‘May I be sacrificed for you<sup>asws</sup>! Do they recognise the Truth?’ So he<sup>asws</sup> said, ‘If they had recognised it, I<sup>asws</sup> would have consoled them with the delicacy, and the delicacy, it is the salt. ",
            "Allah<sup>azwj</sup> Blessed and High did not Create anything except there is a treasurer for it treasuring it, except for the charity, for the Lord<sup>azwj</sup> Pursues it by Himself<sup>saww</sup>, and my<sup>asws</sup> father<sup>asws</sup>, when he<sup>asws</sup> gave something in charity, would place it in the hand of the beggar, then retract from it, so he<sup>asws</sup> would kiss it, and smell it, then return it in the hand of the beggar. A charity at night extinguishes the Anger of the Lord<sup>azwj</sup>, and obliterates the major sins, and makes the Reckoning easier; and the charity by the day yields the wealth and increases in the life span. ",
            "Isa Bin Maryam<sup>as</sup>, when he<sup>as</sup> passed upon the coast of the sea, threw a bite from his<sup>as</sup> provision into the water. So one of the disciples said to him<sup>as</sup>, ‘O Spirit of Allah<sup>azwj</sup> and His<sup>azwj</sup> Speech! Why did you<sup>as</sup> do this, and rather it is your<sup>as</sup> provision?’ So he<sup>as</sup> said: ‘I<sup>as</sup> did this for an animal from animals of the water to eat from it, and its Reward in the Presence of Allah<sup>azwj</sup>, is great’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad from Muhammad ibn Khalid from Sa‘dan ibn Muslim from Mu ’alia ibn Khunays who has said the following: “One rainy night, abu ‘Abd Allah, ‘Alayhi al-Salam, went out to Zullah of banu Sa‘idah. I followed him and saw that some of his things fell down. He said, ‘Bismi Allah (by the name of Allah). O Lord, please return it back to us.’ I went to him and greeted him with the greetings of peace. He said, ‘Is it you, Mu‘alla’?’ I replied, ‘Yes, may Allah keep my soul in the service of your cause.’ He said. ‘Search with your hands and give us whatever you find.’ I found a great deal of bread spread around and kept giving whatever bread I found to him. I found a sack full of bread so heavy that I could not lift it up. I then said, ‘May Allah keep my soul in the service of your cause; allow me to pick it up on my head.’ He said, ‘No, I am more proper for this than you are, but come along with me.’ We then reached Zullah of banu Sa‘idah and found a whole company of people sleeping. He then began to make one or two breads available to each one to the last of them, in a way that no one else could see. We then returned and I asked, ‘May Allah keep my soul in the service of your cause, do these people know the truth (are they Shi‘a)?’ He replied, ‘Were they of those who know the truth, we would have joined them for bread with salt. Allah, the most Blessed, the most High, has made a treasurer for everything He has created, except charity. The Lord Himself is the treasurer thereof. When my father would give charity, he would place it in the hand of the person asking for help, then take it back from him, kiss and smell it, and then give it back to him. Giving charity during the night extinguishes the anger of the Lord, deletes the great sin and makes presentation of one’s accounts easier. Giving charity during the day increases one’s wealth and longevity of life. Jesus, son of Mary, when passing by the coastline of the ocean, threw a loaf of bread in the water. Someone among his disciples said, ‘O the Spirit and Word of Allah, why did you throw your bread in the water, it was your food for the day?’ Jesus replied, ‘I did it for the living things in the ocean that may eat it and the reward for it with Allah is great.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:1:4",
  "kind": "verse_list"
}