{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 40"
        },
        "path": "/books/al-kafi:4:1:40",
        "titles": {
          "ar": "بَابُ كَرَاهِيَةِ السَّرَفِ وَ التَّقْتِيرِ",
          "en": "Chapter 87 Abhorrence of the extravagance and the miserliness"
        }
      }
    ],
    "index": 857,
    "local_index": 40,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 41"
        },
        "path": "/books/al-kafi:4:1:41",
        "titles": {
          "ar": "بَابُ سَقْيِ الْمَاءِ",
          "en": "Chapter 88 – Quenching with the water"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 39"
        },
        "path": "/books/al-kafi:4:1:39",
        "titles": {
          "ar": "بَابُ فَضْلِ الْقَصْدِ",
          "en": "Chapter 86 – Merits of the moderation"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:1:40",
    "titles": {
      "ar": "بَابُ كَرَاهِيَةِ السَّرَفِ وَ التَّقْتِيرِ",
      "en": "Chapter 87 Abhorrence of the extravagance and the miserliness"
    },
    "verse_count": 11,
    "verse_start_index": 6184,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/185)"
        ],
        "index": 6185,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:40:1",
        "refs": {
          "Quran": [
            "/books/quran:25:67"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ الْجَوْهَرِيِّ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ عَبْدِ الْمَلِكِ بْنِ عَمْرٍو الْأَحْوَلِ قَالَ تَلَا أَبُو عَبْدِ اللَّهِ ( عليه السلام ) هَذِهِ الْآيَةَ وَ الَّذِينَ إِذا أَنْفَقُوا لَمْ يُسْرِفُوا وَ لَمْ يَقْتُرُوا وَ كانَ بَيْنَ ذلِكَ قَواماً قَالَ فَأَخَذَ قَبْضَةً مِنْ حَصًى وَ قَبَضَهَا بِيَدِهِ فَقَالَ هَذَا الْإِقْتَارُ الَّذِي ذَكَرَهُ اللَّهُ فِي كِتَابِهِ ثُمَّ قَبَضَ قَبْضَةً أُخْرَى فَأَرْخَى كَفَّهُ كُلَّهَا ثُمَّ قَالَ هَذَا الْإِسْرَافُ ثُمَّ أَخَذَ قَبْضَةً أُخْرَى فَأَرْخَى بَعْضَهَا وَ أَمْسَكَ بَعْضَهَا وَ قَالَ هَذَا الْقَوَامُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from his father, from Al Qasim Bin Muhammad Al Jowhary, from jameel Bin Salih, fom Abdul Malik Bin Amro Al Ahowl who said, ",
            "‘Abu Abdullah<sup>asws</sup> recited this verse <span class=\"ibTxt\"><a href=\"/#/books/quran:25#h67\">[25:67]</a> And they who when they spend, are neither extravagant nor stingy, but with moderation</span>. So he<sup>asws</sup> grabbed a handful of pebbles and captured these in his<sup>asws</sup> hand, and he<sup>asws</sup> said: ‘This is the miserliness which Allah<sup>azwj</sup> Mentions in His<sup>azwj</sup> book’. Then he<sup>asws</sup> grabbed another handful, so he<sup>asws</sup> opened his<sup>asws</sup> palm, all of it, then said: ‘This is the extravagance’. Then he<sup>asws</sup> grabbed another handful, so he<sup>asws</sup> opened part of it and withheld part of it and said, ‘This is the moderation’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from his father from al-Qasim ibn Muhammad al-Jawhariy from Jamil ibn Salih from ‘Abd al-Malik ibn ‘Amr al-Ahwal who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, once, read this verse from the Holy Quran. . those who do not spend excessively or with severe austerity, but with moderation,’ (25: 67) he (the Imam) then picked up a handful of pebbles and kept them firmly in his hand, saying, ‘This is severe austerity that Allah has mentioned in His book.’ He then picked up another handful of pebbles and then opened his hand altogether saying, ‘This is excessive spending.’ He then picked up a handful of pebbles, opened his hand half-way, and held some of the pebbles in his hand, saying, ‘This is moderation.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/186)"
        ],
        "index": 6186,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:40:2",
        "text": [
          "وَ عَنْهُ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ عَبْدِ اللَّهِ بْنِ أَبَانٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ الْأَوَّلَ ( عليه السلام ) عَنِ النَّفَقَةِ عَلَى الْعِيَالِ فَقَالَ مَا بَيْنَ الْمَكْرُوهَيْنِ الْإِسْرَافِ وَ الْإِقْتَارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from his father, from Muhammad Bin Amro, from Abdullah Bin Aban who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup>, about the spending upon the dependants. So he<sup>asws</sup> said: ‘What is between the two (limits of) abhorrence – the extravagance and the miserliness’."
          ],
          "en.sarwar": [
            "2. It is narrated from him (narrator of previous Hadith) from his father from Muhammad ibn ‘Ammar from ‘Abd Allah ibn Aban who has said the following: “Once I asked abu al-Hassan, the 1st, ‘Alayhi al-Salam, about the expenses of one’s dependents. He (the Imam) replied, ‘It is between the two detestable limits: namely, excessive spending and severe austerity.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/186)"
        ],
        "index": 6187,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:40:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنِ ابْنِ أَبِي يَعْفُورٍ وَ يُوسُفَ بْنِ عُمَارَةَ قَالَا قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ مَعَ الْإِسْرَافِ قِلَّةَ الْبَرَكَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Ali Bin Raib, from Ibn Abu Yafour and Yusuf Bin Umara who both said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Along with the extravagance is the scarcity of the Blessings’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad from al-Hassan ibn Mahbub from Ali ibn Ri’ab from ibn abu Ya’qub and Yusuf ibn ‘Ammar who have said the following: “Abu ‘Abd Allah ‘Alayhi al-Salam, has said, ‘There is very little blessing with excessive spending.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/186)"
        ],
        "index": 6188,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:40:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ سَمَاعَةَ بْنِ مِهْرَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ رُبَّ فَقِيرٍ هُوَ أَسْرَفُ مِنَ الْغَنِيِّ إِنَّ الْغَنِيَّ يُنْفِقُ مِمَّا أُوتِيَ وَ الْفَقِيرَ يُنْفِقُ مِنْ غَيْرِ مَا أُوتِيَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad and Ahmad Bin Muhammad, from Ahmad Bin Muhammad Bin Abu Nasr, from Sama’at Bin Mihran, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Sometimes the poor one is more extravagant than the rich one. The rich one spends from what he has been given, and the poor one spends from that which does not belong to him’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Sahl ibn Ziyad and Ahmad ibn Muhammad from Ahmad ibn Muhammad ibn abu Nasr from Sanaa ‘ah ibn Mehran from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that certain ones of the poor people may spend more excessively than a wealthy one. A wealthy person spends from what he has received, but a poor person spends from that which does not belong to him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/186)"
        ],
        "index": 6189,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:40:5",
        "refs": {
          "Quran": [
            "/books/quran:6:141"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ الْمُثَنَّى قَالَ سَأَلَ رَجُلٌ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ آتُوا حَقَّهُ يَوْمَ حَصادِهِ وَ لا تُسْرِفُوا إِنَّهُ لا يُحِبُّ الْمُسْرِفِينَ فَقَالَ كَانَ فُلَانُ بْنُ فُلَانٍ الْأَنْصَارِيُّ سَمَّاهُ وَ كَانَ لَهُ حَرْثٌ وَ كَانَ إِذَا أَخَذَ يَتَصَدَّقُ بِهِ وَ يَبْقَى هُوَ وَ عِيَالُهُ بِغَيْرِ شَيْ‏ءٍ فَجَعَلَ اللَّهُ عَزَّ وَ جَلَّ ذَلِكَ سَرَفاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Al Musna who said, ",
            "‘A man asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h141\">[6:141]</a> and give the due of it on the day of its reaping, and do not act extravagantly; surely He does not Love the extravagant</span>. So he<sup>asws</sup> said: ‘So and so, son of so and so the Helper (he<sup>asws</sup> mentioned his name), had a farm for him, and when he took (the harvest), he gave in charity (all of) it, and there remained himself and his dependants without anything. So Allah<sup>azwj</sup> Mighty and Majestic Made that to be an extravagance’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hisham ibn Muthanna who has said the following: “A man once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the words of Allah, the Most Majestic, the Most Glorious, ‘Give His right on the day of its harvest and do not spend excessively; He does not love excessive spenders.’ <a href=\"/#/books/quran:6#h141\">[6:141]</a> He (the Imam) said, ‘So and so, he mentioned his name, Ansariy (people of al-Madinah) had a farm. After harvest, he would give all of it in charity. He and his dependents would remain without anything. Thus, Allah, the Most Majestic, the Most Glorious, called such spending excessive.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/186)"
        ],
        "index": 6190,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:40:6",
        "refs": {
          "Quran": [
            "/books/quran:17:29"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ يَزِيدَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ لا تَجْعَلْ يَدَكَ مَغْلُولَةً إِلى عُنُقِكَ وَ لا تَبْسُطْها كُلَّ الْبَسْطِ فَتَقْعُدَ مَلُوماً مَحْسُوراً قَالَ الْإِحْسَارُ الْفَاقَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Yazeed, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:17#h29\">[17:29]</a> And do not make your hand to be shackled to your neck nor extend it to its limit, lest you should become blameworthy, tied up</span>. He<sup>asws</sup> said: ‘The ‘tied up’ is the destitution’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn Yazid who has said the following: “This is about the words of Allah, the Most Majestic, the Most Glorious, ‘You must not make your hands tied up to your neck nor open it excessively so you remain blame-worth and tied up.’ <a href=\"/#/books/quran:17#h29\">[17:29]</a> Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ‘Mahsur (tied up) means severe austerity.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/186)"
        ],
        "index": 6191,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:40:7",
        "refs": {
          "Quran": [
            "/books/quran:17:29"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ مُوسَى بْنِ بَكْرٍ عَنْ عَجْلَانَ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَجَاءَ سَائِلٌ فَقَامَ إِلَى مِكْتَلٍ فِيهِ تَمْرٌ فَمَلَأَ يَدَهُ فَنَاوَلَهُ ثُمَّ جَاءَ آخَرُ فَسَأَلَهُ فَقَامَ فَأَخَذَ بِيَدِهِ فَنَاوَلَهُ ثُمَّ جَاءَ آخَرُ فَسَأَلَهُ فَقَامَ فَأَخَذَ بِيَدِهِ فَنَاوَلَهُ ثُمَّ جَاءَ آخَرُ فَسَأَلَهُ فَقَامَ فَأَخَذَ بِيَدِهِ فَنَاوَلَهُ ",
          "ثُمَّ جَاءَ آخَرُ فَقَالَ اللَّهُ رَازِقُنَا وَ إِيَّاكَ ثُمَّ قَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ لَا يَسْأَلُهُ أَحَدٌ مِنَ الدُّنْيَا شَيْئاً إِلَّا أَعْطَاهُ فَأَرْسَلَتْ إِلَيْهِ امْرَأَةٌ ابْناً لَهَا فَقَالَتِ انْطَلِقْ إِلَيْهِ فَاسْأَلْهُ فَإِنْ قَالَ لَكَ لَيْسَ عِنْدَنَا شَيْ‏ءٌ فَقُلْ أَعْطِنِي قَمِيصَكَ قَالَ فَأَخَذَ قَمِيصَهُ فَرَمَى بِهِ إِلَيْهِ",
          "وَ فِي نُسْخَةٍ أُخْرَى فَأَعْطَاهُ فَأَدَّبَهُ اللَّهُ تَبَارَكَ وَ تَعَالَى عَلَى الْقَصْدِ فَقَالَ وَ لا تَجْعَلْ يَدَكَ مَغْلُولَةً إِلى عُنُقِكَ وَ لا تَبْسُطْها كُلَّ الْبَسْطِ فَتَقْعُدَ مَلُوماً مَحْسُوراً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Ahmad Bin Abu Abdullah, from his father, from Al Nazar Bin Suweyd, from Musa Bakr, from Ajlan who said, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup>, when a beggar came over. So he<sup>asws</sup> reached to a basket in which were some dates, filled his<sup>asws</sup> hand and gave it to him. Then another came over and begged him<sup>asws</sup>. So he<sup>asws</sup> stood, grabbed a handful and gave it to him. Then another came over and begged him<sup>asws</sup>, so he<sup>asws</sup> stood, grabbed a handful and gave it to him. Then another came over and begged him<sup>asws</sup>. So he<sup>asws</sup> stood, grabbed a handful and gave it to him. ",
            "Then another one came over, so he<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> Grace us<sup>asws</sup> and you’. Then he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> was such that no one asked him<sup>saww</sup> from something of the world except that he<sup>saww</sup> gave it to him. So a woman sent her son over to him<sup>asws</sup> saying, ‘Go to him<sup>saww</sup> and ask him. So if he<sup>saww</sup> says: ‘There is nothing with us<sup>saww</sup>’, so he said, ‘Give me your<sup>saww</sup> shirt’. He<sup>asws</sup> said: ‘So he<sup>saww</sup> took off his shirt and threw it at him’. ",
            "And in another copy, ‘So he<sup>saww</sup> gave him (his<sup>saww</sup> shirt) and Allah<sup>azwj</sup> Blessed and High Educated him<sup>saww</sup> upon the moderation, so He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:17#h29\">[17:29]</a> And do not make your hand to be shackled to your neck nor extend it to its limit, lest you should become blameworthy, tied up</span>’."
          ],
          "en.sarwar": [
            "7. Ali ibn Muhammad has narrated from Ahmad ibn abu ‘Abd Allah from his father from al-Nadr ibn Suwayd from Musa ibn Bakr from ‘Ajlan who has said the following: “Once, I was in the presence of abu ‘Abd Allah, ‘Alayhi al-Salam, when a man came asking for help. He (the Imam) gave him a handful of dates from a basket. Then another one came also asking for help. He (the Imam) also gave him a handful of dates. Then another one came asking for help, and he gave him a handful as well. Yet another one came asking for help. He (the Imam) stood up and gave him a handful. Thereafter another one came asking for help. He (the Imam) said, ’Allah is our provider as well as yours.’ He then said, ‘Whoever would come to the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, asking for worldly help, he would give it to him. Once a women sent her son telling him, “Go and ask him for help and if he says, ‘I do not have anything to give,’ say, ‘give me your shirt.’” He (the Imam) said that he (the Messenger of Allah) took his shirt off and threw it to him. Another Hadith stated that the Messenger of Allah gave his shirt, but Allah, the most Blessed, the most High, instructed him with the discipline of moderation, saying, ‘Do not keep your hands tied up to your neck nor open them excessively to remain thereafter tied down and blame-worthy.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/187)"
        ],
        "index": 6192,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:40:8",
        "refs": {
          "Quran": [
            "/books/quran:25:67"
          ]
        },
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ كانَ بَيْنَ ذلِكَ قَواماً قَالَ الْقَوَامُ هُوَ الْمَعْرُوفُ عَلَى الْمُوسِعِ قَدَرُهُ وَ عَلَى الْمُقْتِرِ قَدَرُهُ مَتاعاً بِالْمَعْرُوفِ حَقًّا عَلَى الْمُحْسِنِينَ عَلَى قَدْرِ عِيَالِهِ وَ مَئُونَتِهِمُ الَّتِي هِيَ صَلَاحٌ لَهُ وَ لَهُمْ وَ لا يُكَلِّفُ اللَّهُ نَفْساً إِلَّا ما آتاها ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Muhammad Bin Ali, from Muhammad Bin Sinan, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:25#h67\">[25:67]</a> but with moderation</span>. He<sup>asws</sup> said: ‘The moderation, it is the act of kindness; upon the affluent being his measurement, and upon the poor being his measurement, chattels with the kindness, being a right upon the do-gooders, upon a measurement of his dependants and their expenditure which is correct for him and for them; and Allah<sup>azwj</sup> does not Encumber (Burden) a soul except what He<sup>azwj</sup> Gave it’."
          ],
          "en.sarwar": [
            "8. Ahmad ibn Muhammad has narrated from Muhammad ibn Ali from Muhammad ibn Sinan from abu af-Hassan, ‘Alayhi al-Salam, who has said the folio wing: “This is about the words of Allah, the Most Majestic, the Most Glorious, ‘It (moderation) was in between . . .’ <a href=\"/#/books/quran:25#h67\">[25:67]</a>, the Imam said, ‘Al-Qawam (moderation) is a Benevolent Assistance,’ ‘. . . proportionate to the abilities of a wealthy and poor person is a right upon the people of good deeds.’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/187)"
        ],
        "index": 6193,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:40:9",
        "refs": {
          "Quran": [
            "/books/quran:25:67",
            "/books/quran:17:29"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ فِي قَوْلِهِ تَعَالَى وَ الَّذِينَ إِذا أَنْفَقُوا لَمْ يُسْرِفُوا وَ لَمْ يَقْتُرُوا وَ كانَ بَيْنَ ذلِكَ قَواماً فَبَسَطَ كَفَّهُ وَ فَرَّقَ أَصَابِعَهُ وَ حَنَاهَا شَيْئاً وَ عَنْ قَوْلِهِ تَعَالَى وَ لا تَبْسُطْها كُلَّ الْبَسْطِ فَبَسَطَ رَاحَتَهُ وَ قَالَ هَكَذَا وَ قَالَ الْقَوَامُ مَا يَخْرُجُ مِنْ بَيْنِ الْأَصَابِعِ وَ يَبْقَى فِي الرَّاحَةِ مِنْهُ شَيْ‏ءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, and Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Abdullah Bin Sinan, ",
            "‘Regarding the Words of the Exalted <span class=\"ibTxt\"><a href=\"/#/books/quran:25#h67\">[25:67]</a> And they who when they spend, are neither extravagant nor stingy, but with moderation</span>, so he<sup>asws</sup> extended his<sup>asws</sup> palm and separated his<sup>asws</sup> fingers and tilted it a bit. And about the Words of the Exalted <span class=\"ibTxt\"><a href=\"/#/books/quran:17#h29\">[17:29]</a> nor extend it to its limit</span>, so he<sup>asws</sup> extended his<sup>asws</sup> palm and said: ‘Like this’. And he<sup>asws</sup> said: ‘The <span class=\"ibTxt\">moderation</span> is what comes out from between the fingers, and something from it remains in the palm’."
          ],
          "en.sarwar": [
            "9. A number of our people have narrated from Sahl ibn Ziyad and Ahmad ibn Muhammad from al-Hassan ibn Mahbub from ‘Abd Allah ibn Sinan who has said the following: “This is about the words of Allah, most High, ‘Those who, when spending, do not do it excessively or with severe austerity, but with moderation.’ He opened his palm and tilted it a little to one side. About the words of Allah, most High, ‘Do not open your hand excessively . . .’ <a href=\"/#/books/quran:25#h67\">[25:67]</a> he opened up his palm all the way saying, ‘Like this.’ He said, ‘Al-Qawam is when something is left in your palm and something is allowed to leave your palm.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/187)"
        ],
        "index": 6194,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:40:10",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ سُلَيْمَانَ بْنِ صَالِحٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَدْنَى مَا يَجِي‏ءُ مِنْ حَدِّ الْإِسْرَافِ فَقَالَ ابْتِذَالُكَ ثَوْبَ صَوْنِكَ وَ إِهْرَاقُكَ فَضْلَ إِنَائِكَ وَ أَكْلُكَ التَّمْرَ وَ رَمْيَكَ النَّوَى هَاهُنَا وَ هَاهُنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail Bin Bazie, from Salih Bin Uqba, from Suleyman Bin Salih who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The lowest of what comes from a limit of the extravagance?’ So he<sup>asws</sup> said: ‘Your abuse of your worn out clothes, and your burning of the excess in your utensils, and your eating the dates and throwing the cores over here and over here’."
          ],
          "en.sarwar": [
            "10. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn Isma‘il ibn Bazi’ from Salih ibn ‘Uqbah from Sulayman ibn Salih who has said the following: “Once, I asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘What is the minimum limit of excessive spending?’ The Imam replied, ‘It is when you give away your clothes that you need for protection, burning the leftovers in your cooking utensils, and eating dates and scattering the stones inside them here and there.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/188)"
        ],
        "index": 6195,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:40:11",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَمَّارٍ أَبِي عَاصِمٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَرْبَعَةٌ لَا يُسْتَجَابُ لَهُمْ أَحَدُهُمْ كَانَ لَهُ مَالٌ فَأَفْسَدَهُ فَيَقُولُ يَا رَبِّ ارْزُقْنِي فَيَقُولُ اللَّهُ عَزَّ وَ جَلَّ أَ لَمْ آمُرْكَ بِالِاقْتِصَادِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Ahmad Bin Muhammad, from Ali Bin Al hakam, from Ammar Abu Aasim who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘There are four for whom (supplications) would not be Answered – One of them is the one for whom is wealth, so he spoils it, then he is saying, ‘O Lord<sup>azwj</sup>, Grace me!’ So Allah<sup>azwj</sup> Mighty and Majestic is Saying: “Did I<sup>azwj</sup> not Command you with the moderation?’"
          ],
          "en.sarwar": [
            "11. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from ‘Ammar abu ‘Asem who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Four people’s prayers are not accepted. One is he who destroys his wealth and appeals, “Lord, grant me sustenance.’” Allah, the Most Majestic, the Most Glorious, then says, “Did I not command you to observe moderation?””’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:1:40",
  "kind": "verse_list"
}