{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 42"
        },
        "path": "/books/al-kafi:4:1:42",
        "titles": {
          "ar": "بَابُ الصَّدَقَةِ لِبَنِي هَاشِمٍ وَ مَوَالِيهِمْ وَ صِلَتِهِمْ",
          "en": "Chapter 89 – The charity to the Clan of Hashim and their slaves and their connected ones"
        }
      }
    ],
    "index": 859,
    "local_index": 42,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 43"
        },
        "path": "/books/al-kafi:4:1:43",
        "titles": {
          "ar": "بَابُ النَّوَادِرِ",
          "en": "Chapter 90 – The Miscellaneous"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 41"
        },
        "path": "/books/al-kafi:4:1:41",
        "titles": {
          "ar": "بَابُ سَقْيِ الْمَاءِ",
          "en": "Chapter 88 – Quenching with the water"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:1:42",
    "titles": {
      "ar": "بَابُ الصَّدَقَةِ لِبَنِي هَاشِمٍ وَ مَوَالِيهِمْ وَ صِلَتِهِمْ",
      "en": "Chapter 89 – The charity to the Clan of Hashim and their slaves and their connected ones"
    },
    "verse_count": 10,
    "verse_start_index": 6201,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/190)"
        ],
        "index": 6202,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:42:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َحْمَدُ بْنُ إِدْرِيسَ</span> عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عِيصِ بْنِ الْقَاسِمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ أُنَاساً مِنْ بَنِي هَاشِمٍ أَتَوْا رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَسَأَلُوهُ أَنْ يَسْتَعْمِلَهُمْ عَلَى صَدَقَاتِ الْمَوَاشِي وَ قَالُوا يَكُونُ لَنَا هَذَا السَّهْمُ الَّذِي جَعَلَهُ اللَّهُ لِلْعَامِلِينَ عَلَيْهَا فَنَحْنُ أَوْلَى بِهِ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَا بَنِي عَبْدِ الْمُطَّلِبِ إِنَّ الصَّدَقَةَ لَا تَحِلُّ لِي وَ لَا لَكُمْ وَ لَكِنِّي قَدْ وُعِدْتُ الشَّفَاعَةَ ",
          "ثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ اللَّهِ لَقَدْ وُعِدَهَا ( صلى الله عليه وآله ) فَمَا ظَنُّكُمْ يَا بَنِي عَبْدِ الْمُطَّلِبِ إِذَا أَخَذْتُ بِحَلْقَةِ بَابِ الْجَنَّةِ أَ تَرَوْنِي مُؤْثِراً عَلَيْكُمْ غَيْرَكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Safwan Bin Yahya, from Ays Bin Al Qasim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A group of people from the Clan of Hashim came over to Rasool-Allah<sup>saww</sup>. So they asked him<sup>saww</sup> that he<sup>saww</sup> should utilise them upon the (collection of the) charities of the livestock, and they said, ‘Can there happen to be for us this portion which Allah<sup>azwj</sup> has Made it to be for the workers over it, so we are the closes with it’. So Rasool-Allah<sup>saww</sup> said: ‘O sons of Abdul Muttalib<sup>as</sup>! The charity is neither Permissible for me, nor for you all, but I<sup>saww</sup> have been Promised the intercession’.",
            "Then Abu Abdullah<sup>asws</sup> said: ‘By Allah<sup>azwj</sup> has been Promised it. So what is your thinking, O sons of Abdul Muttalib<sup>asws</sup>! When I<sup>asws</sup> grab the ring of the door of the Paradise, do you see me<sup>asws</sup> giving preference to others over you all?’"
          ],
          "en.sarwar": [
            "1. Ahmad ibn Idris has narrated from Muhammad ibn ‘Abd al-Jabbar and Muhammad ibn Isma‘il from al-Fadl ibn Shadhan all from Safwan ibn Yahya from ‘Iys ibn al-Qasim who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that once certain people of Banu Hashim came to the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and asked him to appoint them for collecting zakat on cattle. Therefore, the share of zakat collectors should be given to them. The Messenger of Allah said, ‘O children of ‘Abd al-Muttalib, receiving zakat is not lawful for me or for you. However, it is promised that I will have the privilege to intercede before the Lord to save from the fire whomever I will choose.’ -Abu ‘Abd Allah, ‘Alayhi al-Salam, then said that ‘by Allah, He (Allah) has promised His Messenger to have such a privilege,’- ‘What do you then think, children of ‘Abd al-Muttalib, when I have my hands on the doorknob of Paradise, will I give preference to others beside you?’ he (the Messenger of Allah) explained.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/190)"
        ],
        "index": 6203,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:42:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ وَ أَبِي بَصِيرٍ وَ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَا قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ الصَّدَقَةَ أَوْسَاخُ أَيْدِي النَّاسِ وَ إِنَّ اللَّهَ قَدْ حَرَّمَ عَلَيَّ مِنْهَا وَ مِنْ غَيْرِهَا مَا قَدْ حَرَّمَهُ وَ إِنَّ الصَّدَقَةَ لَا تَحِلُّ لِبَنِي عَبْدِ الْمُطَّلِبِ ",
          "ثُمَّ قَالَ أَمَا وَ اللَّهِ لَوْ قَدْ قُمْتُ عَلَى بَابِ الْجَنَّةِ ثُمَّ أَخَذْتُ بِحَلْقَتِهِ لَقَدْ عَلِمْتُمْ أَنِّي لَا أُوثِرُ عَلَيْكُمْ فَارْضَوْا لِأَنْفُسِكُمْ بِمَا رَضِيَ اللَّهُ وَ رَسُولُهُ لَكُمْ قَالُوا قَدْ رَضِينَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad, from Hareyz, from Muhammad Bin Muslim and Abu Baseer and Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup> both having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The charity is the dirt of the hands of the people, and Allah<sup>azwj</sup> has Prohibited upon me<sup>saww</sup> from it, and from other that which what has been Prohibited; and the charity is not Permissible for the Clan of Abdul Muttalib’. ",
            "Then he<sup>saww</sup> said: ‘By Allah<sup>azwj</sup>! If I<sup>saww</sup> were to stand at the Door of the Paradise, then grab its ring, you would come to know that I<sup>saww</sup> would not prefer (anyone else) over you. Therefore, be pleased with what Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup> are pleased with’. They said, ‘We are pleased’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father, from Hammad, from Hariz, from Muhammad ibn Muslim, abu Basir and Zurarah who have said the following: “Abu Ja’far and abu ‘Abd Allah, ‘Alayhim al-Salam, have said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘Charity is filth of the hands of people. Allah has prohibited me to accept it and certain other things for my own use. Charity is not lawful for the children of ‘Abd al-Muttalib.’ He then said, ‘By Allah, when I will stand at the door of Paradise and get hold of its handle, you must know that I will not give preference to others before you. Thus, you should be happy with what Allah and His Messenger have decided for you.’ They (children of ‘Abd al-Muttalib) then said, ‘We are happy with your decision.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/190)"
        ],
        "index": 6204,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:42:3",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ جَعْفَرِ بْنِ إِبْرَاهِيمَ الْهَاشِمِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ أَ تَحِلُّ الصَّدَقَةُ لِبَنِي هَاشِمٍ فَقَالَ إِنَّمَا تِلْكَ الصَّدَقَةُ الْوَاجِبَةُ عَلَى النَّاسِ لَا تَحِلُّ لَنَا فَأَمَّا غَيْرُ ذَلِكَ فَلَيْسَ بِهِ بَأْسٌ وَ لَوْ كَانَ كَذَلِكَ مَا اسْتَطَاعُوا أَنْ يَخْرُجُوا إِلَى مَكَّةَ هَذِهِ الْمِيَاهُ عَامَّتُهَا صَدَقَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Safwan Bin Yahya, from Abdul Rahman Bin Al Hajjaj, from Ja’far Bin Ibrahim Al Hashimy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘Is the charity Permissible for the Clan of Hashim<sup>as</sup>?’ So he<sup>asws</sup> said: ‘But rather, that is the charity Obligated upon the people, it is not Permissible for us<sup>asws</sup>. So as for the other than that, so there is no problem with it. And had it been like that, they would not have the leeway that they go out to Makkah. These waters, the generality of it is charity’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya from ‘Abd al-Rahman ibn al-Hajjaj from Ja’far ibn Ibrahim al-FIashimiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘Is receiving charity lawful for the children of al- Hashim?’ He replied, ‘What is not lawful for us to receive of the people’s charity is obligatory charity. One is harmless when receiving charities other than obligatory. Had it been otherwise, they could not even go to Makkah; these waters are all charities.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/191)"
        ],
        "index": 6205,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:42:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنِ سَعِيدِ بْنِ عَبْدِ اللَّهِ الْأَعْرَجِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَ تَحِلُّ الصَّدَقَةُ لِمَوَالِي بَنِي هَاشِمٍ قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Ali Bin Al Noman, from Saeed Bin Abdullah Al A’araj who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Is the charity Permissible for the slave of the Clan of Hashim<sup>as</sup>?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa‘id from Ali ibn al-Nu’man from Sa‘id ibn ‘Abd Allah al-A‘raj who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘Is charity lawful for Mawali (servants) of children of al-Hashim?’ The Imam said, ‘Yes, it is lawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالموثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/191)"
        ],
        "index": 6206,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:42:5",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ إِسْمَاعِيلَ بْنِ الْفَضْلِ الْهَاشِمِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الصَّدَقَةِ الَّتِي حُرِّمَتْ عَلَى بَنِي هَاشِمٍ مَا هِيَ قَالَ هِيَ الزَّكَاةُ قُلْتُ فَتَحِلُّ صَدَقَةُ بَعْضِهِمْ عَلَى بَعْضٍ قَالَ نَعَمْ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Ibn Sama’at, from someone else, from Aban Bin Usman, from Ismail Bin Al Fazl Al Hashimy who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the charity which is prohibited unto the Clan of Hashim<sup>as</sup>, what is it?’ He<sup>asws</sup> said: ‘It is the Zakat’. I said, ‘So is the charity Permissible upon each other?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            "5. Hamid ibn Ziyad has narrated from (ibn) Sama‘ah, from more than one person from Aban ibn ‘Uthman from Isma‘il ibn al-Fadl al- Hashimiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about charity which it is not lawful for children of al- Hashim to receive. The Imam replied, ‘It is zakat.’ I then asked, ‘Can they receive zakat from each other?’ He replied, ‘Yes, they can do so. ’’’(This Hadith is best explained by Fatwa). "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/191)"
        ],
        "index": 6207,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:42:6",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ أَحْمَدَ بْنِ عَائِذٍ عَنْ أَبِي خَدِيجَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَعْطُوا الزَّكَاةَ مَنْ أَرَادَهَا مِنْ بَنِي هَاشِمٍ فَإِنَّهَا تَحِلُّ لَهُمْ وَ إِنَّمَا تَحْرُمُ عَلَى النَّبِيِّ ( صلى الله عليه وآله ) وَ الْإِمَامِ الَّذِي مِنْ بَعْدِهِ وَ الْأَئِمَّةِ صَلَوَاتُ اللَّهِ عَلَيْهِمْ أَجْمَعِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Al Hassan Bin Ali Al Washa, from Ahmad Bin A’iz, from Abu Khadeeja, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Give the Zakaat to the ones you need it from the Clan of Hashim<sup>as</sup>, for it is Permissible for them (from each other as per the above Hadith), and rather it is Prohibited upon the Prophet<sup>saww</sup>, and the Imam<sup>asws</sup> from after him<sup>saww</sup>, and the Imams<sup>asws</sup>, all of them’."
          ],
          "en.sarwar": [
            "6. Al-Husayn ibn Muhammad has narrated from Mu’alla’ ibn Muhammad and Muhammad ibn Yahya from Ahmad ibn Muhammad aff from Afi ibn al-Washsha’ from Ahmad ibn ‘ A”Iddah (waiting period) from abu Khadijah who has narrated the foiiowing: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said, ‘You can pay Zakat to banu Hashim who want it because it is lawful for them. It is unlawful only for the Holy prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to your cause and for the Imam after him and to ’A’immah ‘Alayhim al-Salam.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/191)"
        ],
        "index": 6208,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:42:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ يَزِيدَ عَنْ أَبِي الْحَسَنِ الْأَوَّلِ ( عليه السلام ) قَالَ مَنْ لَمْ يَسْتَطِعْ أَنْ يَصِلَنَا فَلْيَصِلْ فُقَرَاءَ شِيعَتِنَا وَ مَنْ لَمْ يَسْتَطِعْ أَنْ يَزُورَ قُبُورَنَا فَلْيَزُرْ قُبُورَ صُلَحَاءِ إِخْوَانِنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from one of our companions, from Muhammad Bin Abdullah, from Muhammad Bin Yazeed, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup> having said: ‘The one who is not able that he maintains good relations with us<sup>asws</sup>, so let him maintain good relations with the poor ones of our<sup>asws</sup> Shias; and the one who is not able to visit our<sup>asws</sup> graves, so let him visit the graves of righteous ones of our<sup>asws</sup> brethren’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from certain individuais of our people from Muhammad ibn ‘Abd Aiiah from Muhammad ibn Yazid who has said the folio wing: “Abu al-Hassan al-Awwal, the 1st, ‘Alayhi al-Salam, has said, ‘Whoever is unable to keep good relations with us (by presenting gifts) should maintain good relations with poor people of our followers, and those who cannot visit our graves should visit the graves of our virtuous brothers (in belief).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/191)"
        ],
        "index": 6209,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:42:8",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنِ النَّوْفَلِيِّ عَنْ عِيسَى بْنِ عَبْدِ اللَّهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ صَنَعَ إِلَى أَحَدٍ مِنْ أَهْلِ بَيْتِي يَداً كَافَيْتُهُ يَوْمَ الْقِيَامَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Al Nowfaly, from Isa Bin Abdullah, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The one who extends a hand to one of my<sup>asws</sup> family members, I<sup>asws</sup> shall suffice him on the Day of Judgement’."
          ],
          "en.sarwar": [
            "8. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from al-Nawfaliy from ‘Isa ibn ‘Abd Allah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/191)"
        ],
        "index": 6210,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:42:9",
        "text": [
          "وَ عَنْهُ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنِّي شَافِعٌ يَوْمَ الْقِيَامَةِ لِأَرْبَعَةِ أَصْنَافٍ وَ لَوْ جَاءُوا بِذُنُوبِ أَهْلِ الدُّنْيَا رَجُلٌ نَصَرَ ذُرِّيَّتِي وَ رَجُلٌ بَذَلَ مَالَهُ لِذُرِّيَّتِي عِنْدَ الْمَضِيقِ وَ رَجُلٌ أَحَبَّ ذُرِّيَّتِي بِاللِّسَانِ وَ بِالْقَلْبِ وَ رَجُلٌ يَسْعَى فِي حَوَائِجِ ذُرِّيَّتِي إِذَا طُرِدُوا أَوْ شُرِّدُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from his father, from one of our companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘I<sup>saww</sup> would be an intercessor on the Day of Judgement for four types (of people) and even though they may have come with the sins of the people of the world – a man who helped my<sup>saww</sup> children; and a man who spent his wealth for my<sup>saww</sup> descendants during constraints; and a man who loved my<sup>saww</sup> children by the tongue, and by the heart; and a man who strived regarding the needs of my<sup>saww</sup> children when they were either expelled or displaced’."
          ],
          "en.sarwar": [
            "9. It is narrated from him (narrator of previous Hadith) from his father from certain individuals of our people who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has narrated this Hadith. ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “On the Day of Judgment I will intercede on behalf of four kinds of people, even though they may come with the sins of the people of the world. Of such people is a man who has supported my children, one who has spent his property for my children in difficult times, a man who loves my children by his tongue and heart, and a man who strives hard to meet the needs of my children when they are driven away or expelled.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/192)"
        ],
        "index": 6211,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:42:10",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ قَالَ كَانَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَسْأَلُ شِهَاباً مِنْ زَكَاتِهِ لِمَوَالِيهِ وَ إِنَّمَا حُرِّمَتِ الزَّكَاةُ عَلَيْهِمْ دُونَ مَوَالِيهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail, from Sa’alba Bin Maymoun who said, ",
            "‘Abu Abdullah<sup>asws</sup> used to ask Shihaab (to give) his<sup>asws</sup> Zakat to his<sup>asws</sup> slaves, and rather the Zakat is Probibited unto them<sup>asws</sup> but (it is permissible for our<sup>asws</sup>) slaves’."
          ],
          "en.sarwar": [
            "10. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn Isma‘il from Tha’labah ibn Maymun who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, would ask Shihab (ibn ‘Abd Rabbihi) to pay zakat due from him to his (Imam’s) servants. It is not permissible for them (’A’immah) to receive zakat, but it is permissible for their servants.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:1:42",
  "kind": "verse_list"
}