{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 4"
        },
        "path": "/books/al-kafi:4",
        "titles": {
          "ar": "الجزء الرابع‏",
          "en": "Volume Four"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 43"
        },
        "path": "/books/al-kafi:4:1:43",
        "titles": {
          "ar": "بَابُ النَّوَادِرِ",
          "en": "Chapter 90 – The Miscellaneous"
        }
      }
    ],
    "index": 860,
    "local_index": 43,
    "nav": {
      "prev": {
        "indexed_titles": {
          "en": "Chapter 42"
        },
        "path": "/books/al-kafi:4:1:42",
        "titles": {
          "ar": "بَابُ الصَّدَقَةِ لِبَنِي هَاشِمٍ وَ مَوَالِيهِمْ وَ صِلَتِهِمْ",
          "en": "Chapter 89 – The charity to the Clan of Hashim and their slaves and their connected ones"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:4:1",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "THE BOOK OF ZAKAAT"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:4:1:43",
    "titles": {
      "ar": "بَابُ النَّوَادِرِ",
      "en": "Chapter 90 – The Miscellaneous"
    },
    "verse_count": 5,
    "verse_start_index": 6211,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/192)"
        ],
        "index": 6212,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:43:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ رَجُلٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِهِ عَزَّ وَ جَلَّ إِنْ تُبْدُوا الصَّدَقاتِ فَنِعِمَّا هِيَ قَالَ يَعْنِي الزَّكَاةَ الْمَفْرُوضَةَ قَالَ قُلْتُ وَ إِنْ تُخْفُوها وَ تُؤْتُوهَا الْفُقَراءَ قَالَ يَعْنِي النَّافِلَةَ إِنَّهُمْ كَانُوا يَسْتَحِبُّونَ إِظْهَارَ الْفَرَائِضِ وَ كِتْمَانَ النَّوَافِلِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Fazzal, from Ibn Bukeyr, ",
            "(It has been narrated) from a man, from Abu Ja’far<sup>asws</sup> regarding the Words of the Mighty and Majestic <span class=\"ibTxt\">[2:271] If you give alms openly, it is good</span>. He<sup>asws</sup> said: ‘It Means the Obligatory Zakat’. I said, ‘<span class=\"ibTxt\">[2:271] and if you hide it and give it to the poor</span>?’ He<sup>asws</sup> said: ‘It Means the voluntary (charity). They used to love the manifestation of the Obligatory and concealing the voluntary’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn Faddal from ibn Bukayr from a man who has said the following: “This is about the words of Allah, the Most Majestic, the Most Glorious, ‘If you pay charity in public, it still is fine. . (2:270) Abu Ja’far, ‘Alayhi al-Salam, has said, Tt is about obligatory zakat.’ I (the narrator) then mentioned Allah’s words that say, ‘If they hide it and give to the poor. . . .’ (2:270) The Imam said, ‘This is about optional charity. They liked to pay obligatory zakat publicly and the optional zakat out of public sight.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/192)"
        ],
        "index": 6213,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:43:2",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَمَّنْ حَدَّثَهُ عَنْ مُعَلَّى بْنِ عُبَيْدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِيهِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الزَّكَاةِ تَجِبُ عَلَيَّ فِي مَوْضِعٍ لَا يُمْكِنُنِي أَنْ أُؤَدِّيَهَا قَالَ اعْزِلْهَا فَإِنِ اتَّجَرْتَ بِهَا فَأَنْتَ ضَامِنٌ لَهَا وَ لَهَا الرِّبْحُ وَ إِنْ تَوِيَتْ فِي حَالِ مَا عَزَلْتَهَا مِنْ غَيْرِ أَنْ تَشْغَلَهَا فِي تِجَارَةٍ فَلَيْسَ عَلَيْكَ وَ إِنْ لَمْ تَعْزِلْهَا وَ اتَّجَرْتَ بِهَا فِي جُمْلَةِ مَالِكَ فَلَهَا بِقِسْطِهَا مِنَ الرِّبْحِ وَ لَا وَضِيعَةَ عَلَيْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from the one who narrated it, from Moalla Bin Ubeyd, from Ali Bin Abu Hamza, from his father, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the Zakat Obligated upon me in a place it is not possible for me that I pay it. He<sup>asws</sup> said: ‘Isolate it, for if you were to trade with it, so you would be responsible for it, and for it is the profit, and if you were to die in a state after having isolated it from that which was involved in business, so there is nothing upon you, but if you isolate it and trade with it in the entirety of your wealth, so for it is its equitable distribution from the profits, and there is no expenses (deductible) upon it’."
          ],
          "en.sarwar": [
            "2. Ali ibn Muhammad has narrated from those who narrated to him from Mu‘alla’ ibn ‘Ubayd, from Ali ibn abu Hamzah, from his father who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about an amount of zakat which has become obligatory for me to pay in a place where I cannot pay. He said, ‘Keep the amount on one side. If you do business with it, you are responsible for it and for its profit. If you die after keeping the amount on the side and without doing any business with it, you are not liable for anything. If you do business with it along with the rest of your other properties, then the profit is proportionately divided and there is no deduction (for expenses) from that amount (of zakat).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/193)"
        ],
        "index": 6214,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:43:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ شُعَيْبٍ عَنِ الْحُسَيْنِ بْنِ الْحَسَنِ عَنْ عَاصِمٍ عَنْ يُونُسَ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ كَانَ يَتَصَدَّقُ بِالسُّكَّرِ فَقِيلَ لَهُ أَ تَتَصَدَّقُ بِالسُّكَّرِ فَقَالَ نَعَمْ إِنَّهُ لَيْسَ شَيْ‏ءٌ أَحَبَّ إِلَيَّ مِنْهُ فَأَنَا أُحِبُّ أَنْ أَتَصَدَّقَ بِأَحَبِّ الْأَشْيَاءِ إِلَيَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Muhammad Bin Shuayb, from Al Husayn Bin Al Hassan, from Aasim, from Yunus, from the one who mentioned it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that he<sup>asws</sup> used to give charity with the sugar, so it was said to him<sup>asws</sup>, ‘You<sup>asws</sup> are giving charity with the sugar?’ So he<sup>asws</sup> said: ‘Yes, there is nothing more beloved to me<sup>asws</sup> than it, therefore I<sup>asws</sup> loved it that I<sup>asws</sup> should give charity with the thing most beloved to me<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from Muhammad ibn Shu’ayb from al-Husayn ibn al-Hassan from ‘Asem from Yunus from those whom he has mentioned who has said the following: ”Abu ‘Abd Allah, ‘Alayhi al-Salam, was seen giving sugar for charity. Someone asked, ‘Do you give sugar for charity?’ He (Imam) replied, ‘Yes, there is not anything more beloved to me than sugar, so I love to give for charity what is most beloved to me.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/193)"
        ],
        "index": 6215,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:43:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ مُعَاذِ بْنِ كَثِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ مُوَسَّعٌ عَلَى شِيعَتِنَا أَنْ يُنْفِقُوا مِمَّا فِي أَيْدِيهِمْ بِالْمَعْرُوفِ فَإِذَا قَامَ قَائِمُنَا حَرَّمَ عَلَى كُلِّ ذِي كَنْزٍ كَنْزَهُ حَتَّى يَأْتِيَهُ بِهِ فَيَسْتَعِينَ بِهِ عَلَى عَدُوِّهِ وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ الَّذِينَ يَكْنِزُونَ الذَّهَبَ وَ الْفِضَّةَ وَ لا يُنْفِقُونَها فِي سَبِيلِ اللَّهِ فَبَشِّرْهُمْ بِعَذابٍ أَلِيمٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Muaz Bin Kaseer who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘There is leeway upon our<sup>asws</sup> Shias that they can spend from what is in their hands with the acts of kindness. So when our<sup>asws</sup> Qaim<sup>asws</sup> rises, it would be Prohibited unto every one with a treasure to hoard it until he comes with it, so he assists with it against his<sup>asws</sup> enemies, and these are the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[9:34] and (as for) those who hoard up the gold and the silver and do not spend it in Allah's Way, announce to them a painful Punishment</span>’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from Mu’adh ibn Kathir who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, Tt is permissible for our followers to spend as Benevolent Assistance from whatever they possess. When the one with Divine Authority will rise, it will then become unlawful for all possessors of treasure not to bring it to him so he can use it to overcome his enemies. This is stated in the words of Allah, the Most Majestic, the Most Glorious, ‘Those who treasure gold and silver and do not spend them for the cause of Allah, inform them of the painful torment that awaits them.’” "
          ]
        }
      },
      {
        "index": 6216,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:4:1:43:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ مُوسَى بْنِ بَكْرٍ عَنْ أَبِي الْحَسَنِ مُوسَى ( عليه السلام ) قَالَ حَصِّنُوا أَمْوَالَكُمْ بِالزَّكَاةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Hassan, from Musa Bin Bakr, ",
            "(It has been narrated) from Abu Al-Hassan Musa<sup>asws</sup> having said: ‘Fortify you wealth with the Zakat’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Hassan from Musa ibn Bakr who has said the following: “Abu al-Hassan, Musa, ‘Alayhi al-Salam, has said, ‘Fortify your belongings by paying zakat.’” "
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "هَذَا آخِرُ كِتَابِ الزَّكَاةِ وَ الصَّدَقَةِ مِنْ كِتَابِ الْكَافِي لِلشَّيْخِ الْأَجَلِّ أَبِي جَعْفَرٍ مُحَمَّدِ بْنِ يَعْقُوبَ الْكُلَيْنِيِّ رَحِمَهُ اللَّهُ وَ يَتْلُوهُ كِتَابُ الصِّيَامِ وَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ وَ صَلَّى اللَّهُ عَلَى سَيِّدِنَا مُحَمَّدٍ النَّبِيِّ وَ آلِهِ الْأَئِمَّةِ الطَّاهِرِينَ الْمَعْصُومِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "This is the end of the Book of Zakat and the Charity from the Book Al Kafi of the majestic Sheykh Abu Ja’far Muhammad Bin Yaqoub Al Kulayni, may Allah<sup>azwj</sup> have Mercy on him, and it would be followed by the Book of the Fasts; and the Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds, and Blessings be upon our Master Muhammad<sup>saww</sup>, the Prophet<sup>saww</sup>, and his<sup>saww</sup> Purified Progeny<sup>asws</sup>, the Infallibles."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:4:1:43",
  "kind": "verse_list"
}