{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 8"}, "path": "/books/al-kafi:8", "titles": {"ar": "الجزء الثامن‏", "en": "Volume Eight"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:8:1", "titles": {"ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;", "en": "The Book - Garden (of Flowers)"}}, {"indexed_titles": {"en": "Chapter 1"}, "path": "/books/al-kafi:8:1:1", "titles": {"ar": "&#1576;&#1616;&#1587;&#1618;&#1605;&#1616; &#1575;&#1604;&#1604;&#1617;&#1614;&#1607;&#1616; &#1575;&#1604;&#1585;&#1617;&#1614;&#1581;&#1618;&#1605;&#1614;&#1606;&#1616; &#1575;&#1604;&#1585;&#1617;&#1614;&#1581;&#1616;&#1610;&#1605;&#1616;", "en": "<a id=\"_Toc492473087\">H 14449</a> - Muhammad Ibn Yaqub Al-Kulayni has narrated that, ‘Narrated to me Ali Ibn Ibrahim from his father from Ibn FaddAl-from Hafs al-Mu'Adhdhin from Abu Abdullah<sup>asws </sup>as well as Muhammad Ibn 'Ismail Ibn Bazi' from Muhammad Ibn Sinan from 'Ismail Ibn Jabir that -  "}}], "index": 2262, "local_index": 1, "part_type": "Chapter", "path": "/books/al-kafi:8:1:1", "titles": {"ar": "&#1576;&#1616;&#1587;&#1618;&#1605;&#1616; &#1575;&#1604;&#1604;&#1617;&#1614;&#1607;&#1616; &#1575;&#1604;&#1585;&#1617;&#1614;&#1581;&#1618;&#1605;&#1614;&#1606;&#1616; &#1575;&#1604;&#1585;&#1617;&#1614;&#1581;&#1616;&#1610;&#1605;&#1616;", "en": "<a id=\"_Toc492473087\">H 14449</a> - Muhammad Ibn Yaqub Al-Kulayni has narrated that, ‘Narrated to me Ali Ibn Ibrahim from his father from Ibn FaddAl-from Hafs al-Mu'Adhdhin from Abu Abdullah<sup>asws </sup>as well as Muhammad Ibn 'Ismail Ibn Bazi' from Muhammad Ibn Sinan from 'Ismail Ibn Jabir that -  "}, "verse_count": 1, "verse_start_index": 14673, "verses": [{"index": 14674, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:8:1:1:1", "text": "- 14449مُحَمَّدُ بْنُ يَعْقُوبَ الْكُلَيْنِيُّ قَالَ حَدَّثَنِي عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ فَضَّالٍ عَنْ حَفْصٍ الْمُؤَذِّنِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ إِسْمَاعِيلَ بْنِ جَابِرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ كَتَبَ بِهَذِهِ الرِّسَالَةِ إِلَى أَصْحَابِهِ وَ أَمَرَهُمْ بِمُدَارَسَتِهَا وَ النَّظَرِ فِيهَا وَ تَعَاهُدِهَا وَ الْعَمَلِ بِهَا فَكَانُوا يَضَعُونَهَا فِي مَسَاجِدِ بُيُوتِهِمْ فَإِذَا فَرَغُوا مِنَ الصَّلَاةِ نَظَرُوا فِيهَا \nقَالَ وَ حَدَّثَنِي الْحَسَنُ بْنُ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدِ بْنِ مَالِكٍ الْكُوفِيِّ عَنِ الْقَاسِمِ بْنِ الرَّبِيعِ الصَّحَّافِ عَنْ إِسْمَاعِيلَ بْنِ مَخْلَدٍ السَّرَّاجِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ خَرَجَتْ هَذِهِ الرِّسَالَةُ مِنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) إِلَى أَصْحَابِهِ\nبِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ أَمَّا بَعْدُ فَاسْأَلُوا رَبَّكُمُ الْعَافِيَةَ وَ عَلَيْكُمْ بِالدَّعَةِ وَ الْوَقَارِ وَ السَّكِينَةِ وَ عَلَيْكُمْ بِالْحَيَاءِ وَ التَّنَزُّهِ عَمَّا تَنَزَّهَ عَنْهُ الصَّالِحُونَ قَبْلَكُمْ وَ عَلَيْكُمْ بِمُجَامَلَةِ أَهْلِ الْبَاطِلِ تَحَمَّلُوا الضَّيْمَ مِنْهُمْ وَ إِيَّاكُمْ وَ مُمَاظَّتَهُمْ دِينُوا فِيمَا بَيْنَكُمْ وَ بَيْنَهُمْ إِذَا أَنْتُمْ جَالَسْتُمُوهُمْ وَ خَالَطْتُمُوهُمْ وَ نَازَعْتُمُوهُمُ الْكَلَامَ فَإِنَّهُ لَا بُدَّ لَكُمْ مِنْ مُجَالَسَتِهِمْ وَ مُخَالَطَتِهِمْ وَ مُنَازَعَتِهِمُ الْكَلَامَ بِالتَّقِيَّةِ الَّتِي أَمَرَكُمُ اللَّهُ أَنْ تَأْخُذُوا بِهَا فِيمَا بَيْنَكُمْ وَ بَيْنَهُمْ \nفَإِذَا ابْتُلِيتُمْ بِذَلِكَ مِنْهُمْ فَإِنَّهُمْ سَيُؤْذُونَكُمْ وَ تَعْرِفُونَ فِي وُجُوهِهِمُ الْمُنْكَرَ وَ لَوْ لَا أَنَّ اللَّهَ تَعَالَى يَدْفَعُهُمْ عَنْكُمْ لَسَطَوْا بِكُمْ وَ مَا فِي صُدُورِهِمْ مِنَ الْعَدَاوَةِ وَ الْبَغْضَاءِ أَكْثَرُ مِمَّا يُبْدُونَ لَكُمْ مَجَالِسُكُمْ وَ مَجَالِسُهُمْ وَاحِدَةٌ وَ أَرْوَاحُكُمْ وَ أَرْوَاحُهُمْ مُخْتَلِفَةٌ لَا تَأْتَلِفُ لَا تُحِبُّونَهُمْ أَبَداً وَ لَا يُحِبُّونَكُمْ غَيْرَ أَنَّ اللَّهَ تَعَالَى أَكْرَمَكُمْ بِالْحَقِّ وَ بَصَّرَكُمُوهُ وَ لَمْ يَجْعَلْهُمْ مِنْ أَهْلِهِ \nفَتُجَامِلُونَهُمْ وَ تَصْبِرُونَ عَلَيْهِمْ وَ هُمْ لَا مُجَامَلَةَ لَهُمْ وَ لَا صَبْرَ لَهُمْ عَلَى شَيْ‏ءٍ وَ حِيَلُهُمْ وَسْوَاسُ بَعْضِهِمْ إِلَى بَعْضٍ فَإِنَّ أَعْدَاءَ اللَّهِ إِنِ اسْتَطَاعُوا صَدُّوكُمْ عَنِ الْحَقِّ فَيَعْصِمُكُمْ اللَّهُ مِنْ ذَلِكَ فَاتَّقُوا اللَّهَ وَ كُفُّوا أَلْسِنَتَكُمْ إِلَّا مِنْ خَيْرٍ وَ إِيَّاكُمْ أَنْ تُزْلِقُوا أَلْسِنَتَكُمْ بِقَوْلِ الزُّورِ وَ الْبُهْتَانِ وَ الْإِثْمِ وَ الْعُدْوَانِ فَإِنَّكُمْ إِنْ كَفَفْتُمْ أَلْسِنَتَكُمْ عَمَّا يَكْرَهُهُ اللَّهُ مِمَّا نَهَاكُمْ عَنْهُ كَانَ خَيْراً لَكُمْ عِنْدَ رَبِّكُمْ مِنْ أَنْ تُزْلِقُوا أَلْسِنَتَكُمْ بِهِ فَإِنَّ زَلَقَ اللِّسَانِ فِيمَا يَكْرَهُ اللَّهُ وَ مَا يَنْهَى عَنْهُ \nمَرْدَاةٌ لِلْعَبْدِ عِنْدَ اللَّهِ وَ مَقْتٌ مِنَ اللَّهِ وَ صَمٌّ وَ عَمًى وَ بَكَمٌ يُورِثُهُ اللَّهُ إِيَّاهُ يَوْمَ الْقِيَامَةِ فَتَصِيرُوا كَمَا قَالَ اللَّهُ صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لا يَرْجِعُونَ يَعْنِي لَا يَنْطِقُونَ وَ لا يُؤْذَنُ لَهُمْ فَيَعْتَذِرُونَ وَ إِيَّاكُمْ وَ مَا نَهَاكُمُ اللَّهُ عَنْهُ أَنْ تَرْكَبُوهُ وَ عَلَيْكُمْ بِالصَّمْتِ إِلَّا فِيمَا يَنْفَعُكُمُ اللَّهُ بِهِ مِنْ أَمْرِ آخِرَتِكُمْ وَ يَأْجُرُكُمْ عَلَيْهِ \nوَ أَكْثِرُوا مِنَ التَّهْلِيلِ وَ التَّقْدِيسِ وَ التَّسْبِيحِ وَ الثَّنَاءِ عَلَى اللَّهِ وَ التَّضَرُّعِ إِلَيْهِ وَ الرَّغْبَةِ فِيمَا عِنْدَهُ مِنَ الْخَيْرِ الَّذِي لَا يَقْدِرُ قَدْرَهُ وَ لَا يَبْلُغُ كُنْهَهُ أَحَدٌ فَاشْغَلُوا أَلْسِنَتَكُمْ بِذَلِكَ عَمَّا نَهَى اللَّهُ عَنْهُ مِنْ أَقَاوِيلِ الْبَاطِلِ الَّتِي تُعْقِبُ أَهْلَهَا خُلُوداً فِي النَّارِ مَنْ مَاتَ عَلَيْهَا وَ لَمْ يَتُبْ إِلَى اللَّهِ وَ لَمْ يَنْزِعْ عَنْهَا \nوَ عَلَيْكُمْ بِالدُّعَاءِ فَإِنَّ الْمُسْلِمِينَ لَمْ يُدْرِكُوا نَجَاحَ الْحَوَائِجِ عِنْدَ رَبِّهِمْ بِأَفْضَلَ مِنَ الدُّعَاءِ وَ الرَّغْبَةِ إِلَيْهِ وَ التَّضَرُّعِ إِلَى اللَّهِ وَ الْمَسْأَلَةِ لَهُ فَارْغَبُوا فِيمَا رَغَّبَكُمُ اللَّهُ فِيهِ وَ أَجِيبُوا اللَّهَ إِلَى مَا دَعَاكُمْ إِلَيْهِ لِتُفْلِحُوا وَ تَنْجُوا مِنْ عَذَابِ اللَّهِ\nوَ إِيَّاكُمْ أَنْ تَشْرَهَ أَنْفُسُكُمْ إِلَى شَيْ‏ءٍ مِمَّا حَرَّمَ اللَّهُ عَلَيْكُمْ فَإِنَّهُ مَنِ انْتَهَكَ مَا حَرَّمَ اللَّهُ عَلَيْهِ هَاهُنَا فِي الدُّنْيَا حَالَ اللَّهُ بَيْنَهُ وَ بَيْنَ الْجَنَّةِ وَ نَعِيمِهَا وَ لَذَّتِهَا وَ كَرَامَتِهَا الْقَائِمَةِ الدَّائِمَةِ لِأَهْلِ الْجَنَّةِ أَبَدَ الْآبِدِينَ \nوَ اعْلَمُوا أَنَّهُ بِئْسَ الْحَظُّ الْخَطَرُ لِمَنْ خَاطَرَ اللَّهَ بِتَرْكِ طَاعَةِ اللَّهِ وَ رُكُوبِ مَعْصِيَتِهِ فَاخْتَارَ أَنْ يَنْتَهِكَ مَحَارِمَ اللَّهِ فِي لَذَّاتِ دُنْيَا مُنْقَطِعَةٍ زَائِلَةٍ عَنْ أَهْلِهَا عَلَى خُلُودِ نَعِيمٍ فِي الْجَنَّةِ وَ لَذَّاتِهَا وَ كَرَامَةِ أَهْلِهَا\nوَيْلٌ لِأُولَئِكَ مَا أَخْيَبَ حَظَّهُمْ وَ أَخْسَرَ كَرَّتَهُمْ وَ أَسْوَأَ حَالَهُمْ عِنْدَ رَبِّهِمْ يَوْمَ الْقِيَامَةِ اسْتَجِيرُوا اللَّهَ أَنْ يُجِيرَكُمْ فِي مِثَالِهِمْ أَبَداً وَ أَنْ يَبْتَلِيَكُمْ بِمَا ابْتَلَاهُمْ بِهِ وَ لَا قُوَّةَ لَنَا وَ لَكُمْ إِلَّا بِهِ فَاتَّقُوا اللَّهَ أَيَّتُهَا الْعِصَابَةُ النَّاجِيَةُ إِنْ أَتَمَّ اللَّهُ لَكُمْ مَا أَعْطَاكُمْ بِهِ فَإِنَّهُ لَا يَتِمُّ الْأَمْرُ حَتَّى يَدْخُلَ عَلَيْكُمْ مِثْلُ الَّذِي دَخَلَ عَلَى الصَّالِحِينَ قَبْلَكُمْ وَ حَتَّى تُبْتَلَوْا فِي أَنْفُسِكُمْ وَ أَمْوَالِكُمْ وَ حَتَّى تَسْمَعُوا مِنْ أَعْدَاءِ اللَّهِ أَذًى كَثِيراً\nفَتَصْبِرُوا وَ تَعْرُكُوا بِجُنُوبِكُمْ وَ حَتَّى يَسْتَذِلُّوكُمْ وَ يُبْغِضُوكُمْ وَ حَتَّى يُحَمِّلُوا عَلَيْكُمُ الضَّيْمَ فَتَحَمَّلُوا مِنْهُمْ تَلْتَمِسُونَ بِذَلِكَ وَجْهَ اللَّهِ وَ الدَّارَ الْآخِرَةَ وَ حَتَّى تَكْظِمُوا الْغَيْظَ الشَّدِيدَ فِي الْأَذَى فِي اللَّهِ عَزَّ وَ جَلَّ يَجْتَرِمُونَهُ إِلَيْكُمْ وَ حَتَّى يُكَذِّبُوكُمْ بِالْحَقِّ وَ يُعَادُوكُمْ فِيهِ وَ يُبْغِضُوكُمْ عَلَيْهِ\nفَتَصْبِرُوا عَلَى ذَلِكَ مِنْهُمْ وَ مِصْدَاقُ ذَلِكَ كُلِّهِ فِي كِتَابِ اللَّهِ الَّذِي أَنْزَلَهُ جَبْرَئِيلُ ( عليه السلام ) عَلَى نَبِيِّكُمْ ( صلى الله عليه وآله ) سَمِعْتُمْ قَوْلَ اللَّهِ عَزَّ وَ جَلَّ لِنَبِيِّكُمْ ( صلى الله عليه وآله ) فَاصْبِرْ كَما صَبَرَ أُولُوا الْعَزْمِ مِنَ الرُّسُلِ وَ لا تَسْتَعْجِلْ لَهُمْ ثُمَّ قَالَ وَ إِنْ يُكَذِّبُوكَ فَقَدْ كُذِّبَتْ رُسُلٌ مِنْ قَبْلِكَ\nفَصَبَرُوا عَلى ما كُذِّبُوا وَ أُوذُوا فَقَدْ كُذِّبَ نَبِيُّ اللَّهِ وَ الرُّسُلُ مِنْ قَبْلِهِ وَ أُوذُوا مَعَ التَّكْذِيبِ بِالْحَقِّ فَإِنْ سَرَّكُمْ أَمْرُ اللَّهِ فِيهِمُ الَّذِي خَلَقَهُمْ لَهُ فِي الْأَصْلِ [أَصْلِ الْخَلْقِ] مِنَ الْكُفْرِ الَّذِي سَبَقَ فِي عِلْمِ اللَّهِ أَنْ يَخْلُقَهُمْ لَهُ فِي الْأَصْلِ وَ مِنَ الَّذِينَ سَمَّاهُمُ اللَّهُ فِي كِتَابِهِ فِي قَوْلِهِ وَ جَعَلْنَا مِنْهُمْ أَئِمَّةً يَدْعُونَ إِلَى النَّارِ\nفَتَدَبَّرُوا هَذَا وَ اعْقِلُوهُ وَ لَا تَجْهَلُوهُ فَإِنَّهُ مَنْ يَجْهَلْ هَذَا وَ أَشْبَاهَهُ مِمَّا افْتَرَضَ اللَّهُ عَلَيْهِ فِي كِتَابِهِ مِمَّا أَمَرَ اللَّهُ بِهِ وَ نَهَى عَنْهُ تَرَكَ دِينَ اللَّهِ وَ رَكِبَ مَعَاصِيَهُ فَاسْتَوْجَبَ سَخَطَ اللَّهِ فَأَكَبَّهُ اللَّهُ عَلَى وَجْهِهِ فِي النَّارِ\n<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">و</span>َ قَالَ أَيَّتُهَا</span> الْعِصَابَةُ الْمَرْحُومَةُ الْمُفْلِحَةُ إِنَّ اللَّهَ أَتَمَّ لَكُمْ مَا آتَاكُمْ مِنَ الْخَيْرِ وَ اعْلَمُوا أَنَّهُ لَيْسَ مِنْ عِلْمِ اللَّهِ وَ لَا مِنْ أَمْرِهِ أَنْ يَأْخُذَ أَحَدٌ مِنْ خَلْقِ اللَّهِ فِي دِينِهِ بِهَوًى وَ لَا رَأْيٍ وَ لَا مَقَايِيسَ قَدْ أَنْزَلَ اللَّهُ الْقُرْآنَ وَ جَعَلَ فِيهِ تِبْيَانَ كُلِّ شَيْ‏ءٍ وَ جَعَلَ لِلْقُرْآنِ وَ لِتَعَلُّمِ الْقُرْآنِ أَهْلًا لَا يَسَعُ أَهْلَ عِلْمِ الْقُرْآنِ الَّذِينَ آتَاهُمُ اللَّهُ عِلْمَهُ أَنْ يَأْخُذُوا فِيهِ بِهَوًى وَ لَا رَأْيٍ وَ لَا مَقَايِيسَ أَغْنَاهُمُ اللَّهُ عَنْ ذَلِكَ بِمَا آتَاهُمْ مِنْ عِلْمِهِ وَ خَصَّهُمْ بِهِ وَ وَضَعَهُ عِنْدَهُمْ كَرَامَةً مِنَ اللَّهِ أَكْرَمَهُمْ بِهَا\nوَ هُمْ أَهْلُ الذِّكْرِ الَّذِينَ أَمَرَ اللَّهُ هَذِهِ الْأُمَّةَ بِسُؤَالِهِمْ وَ هُمُ الَّذِينَ مَنْ سَأَلَهُمْ وَ قَدْ سَبَقَ فِي عِلْمِ اللَّهِ أَنْ يُصَدِّقَهُمْ وَ يَتَّبِعَ أَثَرَهُمْ أَرْشَدُوهُ وَ أَعْطَوْهُ مِنْ عِلْمِ الْقُرْآنِ مَا يَهْتَدِي بِهِ إِلَى اللَّهِ بِإِذْنِهِ وَ إِلَى جَمِيعِ سُبُلِ الْحَقِّ \nوَ هُمُ الَّذِينَ لَا يَرْغَبُ عَنْهُمْ وَ عَنْ مَسْأَلَتِهِمْ وَ عَنْ عِلْمِهِمُ الَّذِي أَكْرَمَهُمُ اللَّهُ بِهِ وَ جَعَلَهُ عِنْدَهُمْ إِلَّا مَنْ سَبَقَ عَلَيْهِ فِي عِلْمِ اللَّهِ الشَّقَاءُ فِي أَصْلِ الْخَلْقِ تَحْتَ الْأَظِلَّةِ\n<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ف</span>َأُولَئِكَ الَّذِينَ</span> يَرْغَبُونَ عَنْ سُؤَالِ أَهْلِ الذِّكْرِ وَ الَّذِينَ آتَاهُمُ اللَّهُ عِلْمَ الْقُرْآنِ وَ وَضَعَهُ عِنْدَهُمْ وَ أَمَرَ بِسُؤَالِهِمْ وَ أُولَئِكَ الَّذِينَ يَأْخُذُونَ بِأَهْوَائِهِمْ وَ آرَائِهِمْ وَ مَقَايِيسِهِمْ حَتَّى دَخَلَهُمُ الشَّيْطَانُ لِأَنَّهُمْ جَعَلُوا أَهْلَ الْإِيمَانِ فِي عِلْمِ الْقُرْآنِ عِنْدَ اللَّهِ كَافِرِينَ وَ جَعَلُوا أَهْلَ الضَّلَالَةِ فِي عِلْمِ الْقُرْآنِ عِنْدَ اللَّهِ مُؤْمِنِينَ وَ حَتَّى جَعَلُوا مَا أَحَلَّ اللَّهُ فِي كَثِيرٍ مِنَ الْأَمْرِ حَرَاماً وَ جَعَلُوا مَا حَرَّمَ اللَّهُ فِي كَثِيرٍ مِنَ الْأَمْرِ حَلَالًا\nفَذَلِكَ أَصْلُ ثَمَرَةِ أَهْوَائِهِمْ وَ قَدْ عَهِدَ إِلَيْهِمْ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَبْلَ مَوْتِهِ فَقَالُوا نَحْنُ بَعْدَ مَا قَبَضَ اللَّهُ عَزَّ وَ جَلَّ رَسُولَهُ يَسَعُنَا أَنْ نَأْخُذَ بِمَا اجْتَمَعَ عَلَيْهِ رَأْيُ النَّاسِ بَعْدَ مَا قَبَضَ اللَّهُ عَزَّ وَ جَلَّ رَسُولَهُ ( صلى الله عليه وآله ) وَ بَعْدَ عَهْدِهِ الَّذِي عَهِدَهُ إِلَيْنَا وَ أَمَرَنَا بِهِ مُخَالِفاً لِلَّهِ وَ لِرَسُولِهِ ( صلى الله عليه وآله)\nفَمَا أَحَدٌ أَجْرَأَ عَلَى اللَّهِ وَ لَا أَبْيَنَ ضَلَالَةً مِمَّنْ أَخَذَ بِذَلِكَ وَ زَعَمَ أَنَّ ذَلِكَ يَسَعُهُ وَ اللَّهِ إِنَّ لِلَّهِ عَلَى خَلْقِهِ أَنْ يُطِيعُوهُ وَ يَتَّبِعُوا أَمْرَهُ فِي حَيَاةِ مُحَمَّدٍ ( صلى الله عليه وآله ) وَ بَعْدَ مَوْتِهِ هَلْ يَسْتَطِيعُ أُولَئِكَ أَعْدَاءُ اللَّهِ أَنْ يَزْعُمُوا أَنَّ أَحَداً مِمَّنْ أَسْلَمَ مَعَ مُحَمَّدٍ ( صلى الله عليه وآله ) أَخَذَ بِقَوْلِهِ وَ رَأْيِهِ وَ مَقَايِيسِهِ فَإِنْ قَالَ نَعَمْ فَقَدْ كَذَبَ عَلَى اللَّهِ وَ ضَلَّ ضَلَالًا بَعِيداً وَ إِنْ قَالَ لَا لَمْ يَكُنْ لِأَحَدٍ أَنْ يَأْخُذَ بِرَأْيِهِ وَ هَوَاهُ وَ مَقَايِيسِهِ فَقَدْ أَقَرَّ بِالْحُجَّةِ عَلَى نَفْسِهِ وَ هُوَ مِمَّنْ يَزْعُمُ أَنَّ اللَّهَ يُطَاعُ وَ يُتَّبَعُ أَمْرُهُ بَعْدَ قَبْضِ رَسُولِ اللَّهِ (صلى الله عليه وآله)\nوَ قَدْ قَالَ اللَّهُ وَ قَوْلُهُ الْحَقُّ وَ ما مُحَمَّدٌ إِلَّا رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ أَ فَإِنْ ماتَ أَوْ قُتِلَ انْقَلَبْتُمْ عَلى أَعْقابِكُمْ وَ مَنْ يَنْقَلِبْ عَلى عَقِبَيْهِ فَلَنْ يَضُرَّ اللَّهَ شَيْئاً وَ سَيَجْزِي اللَّهُ الشَّاكِرِينَ وَ ذَلِكَ لِتَعْلَمُوا أَنَّ اللَّهَ يُطَاعُ وَ يُتَّبَعُ أَمْرُهُ فِي حَيَاةِ مُحَمَّدٍ ( صلى الله عليه وآله ) وَ بَعْدَ قَبْضِ اللَّهِ مُحَمَّداً ( صلى الله عليه وآله ) وَ كَمَا لَمْ يَكُنْ لِأَحَدٍ مِنَ النَّاسِ مَعَ مُحَمَّدٍ ( صلى الله عليه وآله ) أَنْ يَأْخُذَ بِهَوَاهُ وَ لَا رَأْيِهِ وَ لَا مَقَايِيسِهِ خِلَافاً لِأَمْرِ مُحَمَّدٍ ( صلى الله عليه وآله ) فَكَذَلِكَ لَمْ يَكُنْ لِأَحَدٍ مِنَ النَّاسِ بَعْدَ مُحَمَّدٍ ( صلى الله عليه وآله ) أَنْ يَأْخُذَ بِهَوَاهُ وَ لَا رَأْيِهِ وَ لَا مَقَايِيسِهِ \nوَ قَالَ دَعُوا رَفْعَ أَيْدِيكُمْ فِي الصَّلَاةِ إِلَّا مَرَّةً وَاحِدَةً حِينَ تُفْتَتَحُ الصَّلَاةُ فَإِنَّ النَّاسَ قَدْ شَهَرُوكُمْ بِذَلِكَ وَ اللَّهُ الْمُسْتَعَانُ وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ \nوَ قَالَ أَكْثِرُوا مِنْ أَنْ تَدْعُوا اللَّهَ فَإِنَّ اللَّهَ يُحِبُّ مِنْ عِبَادِهِ الْمُؤْمِنِينَ أَنْ يَدْعُوهُ وَ قَدْ وَعَدَ اللَّهُ عِبَادَهُ الْمُؤْمِنِينَ بِالِاسْتِجَابَةِ وَ اللَّهُ مُصَيِّرٌ دُعَاءَ الْمُؤْمِنِينَ يَوْمَ الْقِيَامَةِ لَهُمْ عَمَلًا يَزِيدُهُمْ بِهِ فِي الْجَنَّةِ فَأَكْثِرُوا ذِكْرَ اللَّهِ مَا اسْتَطَعْتُمْ فِي كُلِّ سَاعَةٍ مِنْ سَاعَاتِ اللَّيْلِ وَ النَّهَارِ فَإِنَّ اللَّهَ أَمَرَ بِكَثْرَةِ الذِّكْرِ لَهُ وَ اللَّهُ ذَاكِرٌ لِمَنْ ذَكَرَهُ مِنَ الْمُؤْمِنِينَ وَ اعْلَمُوا أَنَّ اللَّهَ لَمْ يَذْكُرْهُ أَحَدٌ مِنْ عِبَادِهِ الْمُؤْمِنِينَ إِلَّا ذَكَرَهُ بِخَيْرٍ\nفَأَعْطُوا اللَّهَ مِنْ أَنْفُسِكُمُ الِاجْتِهَادَ فِي طَاعَتِهِ فَإِنَّ اللَّهَ لَا يُدْرَكُ شَيْ‏ءٌ مِنَ الْخَيْرِ عِنْدَهُ إِلَّا بِطَاعَتِهِ وَ اجْتِنَابِ مَحَارِمِهِ الَّتِي حَرَّمَ اللَّهُ فِي ظَاهِرِ الْقُرْآنِ وَ بَاطِنِهِ فَإِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى قَالَ فِي كِتَابِهِ وَ قَوْلُهُ الْحَقُّ وَ ذَرُوا ظاهِرَ الْإِثْمِ وَ باطِنَهُ \nوَ اعْلَمُوا أَنَّ مَا أَمَرَ اللَّهُ بِهِ أَنْ تَجْتَنِبُوهُ فَقَدْ حَرَّمَهُ وَ اتَّبِعُوا آثَارَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ سُنَّتَهُ فَخُذُوا بِهَا وَ لَا تَتَّبِعُوا أَهْوَاءَكُمْ وَ آرَاءَكُمْ فَتَضِلُّوا فَإِنَّ أَضَلَّ النَّاسِ عِنْدَ اللَّهِ مَنِ اتَّبَعَ هَوَاهُ وَ رَأْيَهُ بِغَيْرِ هُدًى مِنَ اللَّهِ \nوَ أَحْسِنُوا إِلَى أَنْفُسِكُمْ مَا اسْتَطَعْتُمْ فَ إِنْ أَحْسَنْتُمْ أَحْسَنْتُمْ لِأَنْفُسِكُمْ وَ إِنْ أَسَأْتُمْ فَلَها وَ جَامِلُوا النَّاسَ وَ لَا تَحْمِلُوهُمْ عَلَى رِقَابِكُمْ تَجْمَعُوا مَعَ ذَلِكَ طَاعَةَ رَبِّكُمْ وَ إِيَّاكُمْ وَ سَبَّ أَعْدَاءِ اللَّهِ حَيْثُ يَسْمَعُونَكُمْ فَيَسُبُّوا اللَّهَ عَدْواً بِغَيْرِ عِلْمٍ وَ قَدْ يَنْبَغِي لَكُمْ أَنْ تَعْلَمُوا حَدَّ سَبِّهِمْ لِلَّهِ كَيْفَ هُوَ إِنَّهُ مَنْ سَبَّ أَوْلِيَاءَ اللَّهِ فَقَدِ انْتَهَكَ سَبَّ اللَّهِ وَ مَنْ أَظْلَمُ عِنْدَ اللَّهِ مِمَّنِ اسْتَسَبَّ لِلَّهِ وَ لِأَوْلِيَاءِ اللَّهِ فَمَهْلًا مَهْلًا فَاتَّبِعُوا أَمْرَ اللَّهِ وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ\nوَ قَالَ أَيَّتُهَا الْعِصَابَةُ الْحَافِظُ اللَّهُ لَهُمْ أَمْرَهُمْ عَلَيْكُمْ بِآثَارِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ سُنَّتِهِ وَ آثَارِ الْأَئِمَّةِ الْهُدَاةِ مِنْ أَهْلِ بَيْتِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مِنْ بَعْدِهِ وَ سُنَّتِهِمْ فَإِنَّهُ مَنْ أَخَذَ بِذَلِكَ فَقَدِ اهْتَدَى وَ مَنْ تَرَكَ ذَلِكَ وَ رَغِبَ عَنْهُ ضَلَّ لِأَنَّهُمْ هُمُ الَّذِينَ أَمَرَ اللَّهُ بِطَاعَتِهِمْ وَ وَلَايَتِهِمْ \nوَ قَدْ قَالَ أَبُونَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْمُدَاوَمَةُ عَلَى الْعَمَلِ فِي اتِّبَاعِ الْآثَارِ وَ السُّنَنِ وَ إِنْ قَلَّ أَرْضَى لِلَّهِ وَ أَنْفَعُ عِنْدَهُ فِي الْعَاقِبَةِ مِنَ الِاجْتِهَادِ فِي الْبِدَعِ وَ اتِّبَاعِ الْأَهْوَاءِ أَلَا إِنَّ اتِّبَاعَ الْأَهْوَاءِ وَ اتِّبَاعَ الْبِدَعِ بِغَيْرِ هُدًى مِنَ اللَّهِ ضَلَالٌ وَ كُلُّ ضَلَالَةٍ بِدْعَةٌ وَ كُلُّ بِدْعَةٍ فِي النَّارِ وَ لَنْ يُنَالَ شَيْ‏ءٌ مِنَ الْخَيْرِ عِنْدَ اللَّهِ إِلَّا بِطَاعَتِهِ وَ الصَّبْرِ وَ الرِّضَا لِأَنَّ الصَّبْرَ وَ الرِّضَا مِنْ طَاعَةِ اللَّهِ\nوَ اعْلَمُوا أَنَّهُ لَنْ يُؤْمِنَ عَبْدٌ مِنْ عَبِيدِهِ حَتَّى يَرْضَى عَنِ اللَّهِ فِيمَا صَنَعَ اللَّهُ إِلَيْهِ وَ صَنَعَ بِهِ عَلَى مَا أَحَبَّ وَ كَرِهَ وَ لَنْ يَصْنَعَ اللَّهُ بِمَنْ صَبَرَ وَ رَضِيَ عَنِ اللَّهِ إِلَّا مَا هُوَ أَهْلُهُ وَ هُوَ خَيْرٌ لَهُ مِمَّا أَحَبَّ وَ كَرِهَ \nوَ عَلَيْكُمْ بِالْمُحَافَظَةِ عَلَى الصَّلَوَاتِ وَ الصَّلَاةِ الْوُسْطَى وَ قُومُوا لِلَّهِ قانِتِينَ كَمَا أَمَرَ اللَّهُ بِهِ الْمُؤْمِنِينَ فِي كِتَابِهِ مِنْ قَبْلِكُمْ \nوَ إِيَّاكُمْ وَ عَلَيْكُمْ بِحُبِّ الْمَسَاكِينِ الْمُسْلِمِينَ فَإِنَّهُ مَنْ حَقَّرَهُمْ وَ تَكَبَّرَ عَلَيْهِمْ فَقَدْ زَلَّ عَنْ دِينِ اللَّهِ وَ اللَّهُ لَهُ حَاقِرٌ مَاقِتٌ وَ قَدْ قَالَ أَبُونَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَمَرَنِي رَبِّي بِحُبِّ الْمَسَاكِينِ الْمُسْلِمِينَ مِنْهُمْ وَ اعْلَمُوا أَنَّ مَنْ حَقَّرَ أَحَداً مِنَ الْمُسْلِمِينَ أَلْقَى اللَّهُ عَلَيْهِ الْمَقْتَ مِنْهُ وَ الْمَحْقَرَةَ حَتَّى يَمْقُتَهُ النَّاسُ وَ اللَّهُ لَهُ أَشَدُّ مَقْتاً\nفَاتَّقُوا اللَّهَ فِي إِخْوَانِكُمُ الْمُسْلِمِينَ الْمَسَاكِينِ فَإِنَّ لَهُمْ عَلَيْكُمْ حَقّاً أَنْ تُحِبُّوهُمْ فَإِنَّ اللَّهَ أَمَرَ رَسُولَهُ ( صلى الله عليه وآله ) بِحُبِّهِمْ فَمَنْ لَمْ يُحِبَّ مَنْ أَمَرَ اللَّهُ بِحُبِّهِ فَقَدْ عَصَى اللَّهَ وَ رَسُولَهُ وَ مَنْ عَصَى اللَّهَ وَ رَسُولَهُ وَ مَاتَ عَلَى ذَلِكَ مَاتَ وَ هُوَ مِنَ الْغَاوِينَ\nوَ إِيَّاكُمْ وَ الْعَظَمَةَ وَ الْكِبْرَ فَإِنَّ الْكِبْرَ رِدَاءُ اللَّهِ عَزَّ وَ جَلَّ فَمَنْ نَازَعَ اللَّهَ رِدَاءَهُ خَصَمَهُ اللَّهُ وَ أَذَلَّهُ يَوْمَ الْقِيَامَةِ \nوَ إِيَّاكُمْ أَنْ يَبْغِيَ بَعْضُكُمْ عَلَى بَعْضٍ فَإِنَّهَا لَيْسَتْ مِنْ خِصَالِ الصَّالِحِينَ فَإِنَّهُ مَنْ بَغَى صَيَّرَ اللَّهُ بَغْيَهُ عَلَى نَفْسِهِ وَ صَارَتْ نُصْرَةُ اللَّهِ لِمَنْ بُغِيَ عَلَيْهِ وَ مَنْ نَصَرَهُ اللَّهُ غَلَبَ وَ أَصَابَ الظَّفَرَ مِنَ اللَّهِ \nوَ إِيَّاكُمْ أَنْ يَحْسُدَ بَعْضُكُمْ بَعْضاً فَإِنَّ الْكُفْرَ أَصْلُهُ الْحَسَدُ \nوَ إِيَّاكُمْ أَنْ تُعِينُوا عَلَى مُسْلِمٍ مَظْلُومٍ فَيَدْعُوَ اللَّهَ عَلَيْكُمْ وَ يُسْتَجَابَ لَهُ فِيكُمْ فَإِنَّ أَبَانَا رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ يَقُولُ إِنَّ دَعْوَةَ الْمُسْلِمِ الْمَظْلُومِ مُسْتَجَابَةٌ وَ لْيُعِنْ بَعْضُكُمْ بَعْضاً فَإِنَّ أَبَانَا رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ يَقُولُ إِنَّ مَعُونَةَ الْمُسْلِمِ خَيْرٌ وَ أَعْظَمُ أَجْراً مِنْ صِيَامِ شَهْرٍ وَ اعْتِكَافِهِ فِي الْمَسْجِدِ الْحَرَامِ\nوَ إِيَّاكُمْ وَ إِعْسَارَ أَحَدٍ مِنْ إِخْوَانِكُمُ الْمُسْلِمِينَ أَنْ تُعْسِرُوهُ بِالشَّيْ‏ءِ يَكُونُ لَكُمْ قِبَلَهُ وَ هُوَ مُعْسِرٌ فَإِنَّ أَبَانَا رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ يَقُولُ لَيْسَ لِمُسْلِمٍ أَنْ يُعْسِرَ مُسْلِماً وَ مَنْ أَنْظَرَ مُعْسِراً أَظَلَّهُ اللَّهُ بِظِلِّهِ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّهُ\nوَ إِيَّاكُمْ أَيَّتُهَا الْعِصَابَةُ الْمَرْحُومَةُ الْمُفَضَّلَةُ عَلَى مَنْ سِوَاهَا وَ حَبْسَ حُقُوقِ اللَّهِ قِبَلَكُمْ يَوْماً بَعْدَ يَوْمٍ وَ سَاعَةً بَعْدَ سَاعَةٍ فَإِنَّهُ مَنْ عَجَّلَ حُقُوقَ اللَّهِ قِبَلَهُ كَانَ اللَّهُ أَقْدَرَ عَلَى التَّعْجِيلِ لَهُ إِلَى مُضَاعَفَةِ الْخَيْرِ فِي الْعَاجِلِ وَ الْآجِلِ وَ إِنَّهُ مَنْ أَخَّرَ حُقُوقَ اللَّهِ قِبَلَهُ كَانَ اللَّهُ أَقْدَرَ عَلَى تَأْخِيرِ رِزْقِهِ وَ مَنْ حَبَسَ اللَّهُ رِزْقَهُ لَمْ يَقْدِرْ أَنْ يَرْزُقَ نَفْسَهُ فَأَدُّوا إِلَى اللَّهِ حَقَّ مَا رَزَقَكُمْ يُطَيِّبِ اللَّهُ لَكُمْ بَقِيَّتَهُ وَ يُنْجِزْ لَكُمْ مَا وَعَدَكُمْ مِنْ مُضَاعَفَتِهِ لَكُمُ الْأَضْعَافَ الْكَثِيرَةَ الَّتِي لَا يَعْلَمُ عَدَدَهَا وَ لَا كُنْهَ فَضْلِهَا إِلَّا اللَّهُ رَبُّ الْعَالَمِينَ\nوَ قَالَ اتَّقُوا اللَّهَ أَيَّتُهَا الْعِصَابَةُ وَ إِنِ اسْتَطَعْتُمْ أَنْ لَا يَكُونَ مِنْكُمْ مُحْرِجُ الْإِمَامِ فَإِنَّ مُحْرِجَ الْإِمَامِ هُوَ الَّذِي يَسْعَى بِأَهْلِ الصَّلَاحِ مِنْ أَتْبَاعِ الْإِمَامِ الْمُسَلِّمِينَ لِفَضْلِهِ الصَّابِرِينَ عَلَى أَدَاءِ حَقِّهِ الْعَارِفِينَ لِحُرْمَتِهِ \nوَ اعْلَمُوا أَنَّهُ مَنْ نَزَلَ بِذَلِكَ الْمَنْزِلِ عِنْدَ الْإِمَامِ فَهُوَ مُحْرِجُ الْإِمَامِ فَإِذَا فَعَلَ ذَلِكَ عِنْدَ الْإِمَامِ أَحْرَجَ الْإِمَامَ إِلَى أَنْ يَلْعَنَ أَهْلَ الصَّلَاحِ مِنْ أَتْبَاعِهِ الْمُسَلِّمِينَ لِفَضْلِهِ الصَّابِرِينَ عَلَى أَدَاءِ حَقِّهِ الْعَارِفِينَ بِحُرْمَتِهِ فَإِذَا لَعَنَهُمْ لِإِحْرَاجِ أَعْدَاءِ اللَّهِ الْإِمَامَ صَارَتْ لَعْنَتُهُ رَحْمَةً مِنَ اللَّهِ عَلَيْهِمْ وَ صَارَتِ اللَّعْنَةُ مِنَ اللَّهِ وَ مِنَ الْمَلَائِكَةِ وَ رُسُلِهِ عَلَى أُولَئِكَ وَ اعْلَمُوا أَيَّتُهَا الْعِصَابَةُ أَنَّ السُّنَّةَ مِنَ اللَّهِ قَدْ جَرَتْ فِي الصَّالِحِينَ قَبْلُ\nوَ قَالَ مَنْ سَرَّهُ أَنْ يَلْقَى اللَّهَ وَ هُوَ مُؤْمِنٌ حَقّاً حَقّاً فَلْيَتَوَلَّ اللَّهَ وَ رَسُولَهُ وَ الَّذِينَ آمَنُوا وَ لْيَبْرَأْ إِلَى اللَّهِ مِنْ عَدُوِّهِمْ وَ يُسَلِّمُ لِمَا انْتَهَى إِلَيْهِ مِنْ فَضْلِهِمْ لِأَنَّ فَضْلَهُمْ لَا يَبْلُغُهُ مَلَكٌ مُقَرَّبٌ وَ لَا نَبِيٌّ مُرْسَلٌ وَ لَا مَنْ دُونَ ذَلِكَ أَ لَمْ تَسْمَعُوا مَا ذَكَرَ اللَّهُ مِنْ فَضْلِ أَتْبَاعِ الْأَئِمَّةِ الْهُدَاةِ وَ هُمُ الْمُؤْمِنُونَ قَالَ فَأُولئِكَ مَعَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِمْ مِنَ النَّبِيِّينَ وَ الصِّدِّيقِينَ وَ الشُّهَداءِ وَ الصَّالِحِينَ وَ حَسُنَ أُولئِكَ رَفِيقاً\nفَهَذَا وَجْهٌ مِنْ وُجُوهِ فَضْلِ أَتْبَاعِ الْأَئِمَّةِ فَكَيْفَ بِهِمْ وَ فَضْلِهِمْ وَ مَنْ سَرَّهُ أَنْ يُتِمَّ اللَّهُ لَهُ إِيمَانَهُ حَتَّى يَكُونَ مُؤْمِناً حَقّاً حَقّاً فَلْيَفِ لِلَّهِ بِشُرُوطِهِ الَّتِي اشْتَرَطَهَا عَلَى الْمُؤْمِنِينَ فَإِنَّهُ قَدِ اشْتَرَطَ مَعَ وَلَايَتِهِ وَ وَلَايَةِ رَسُولِهِ وَ وَلَايَةِ أَئِمَّةِ الْمُؤْمِنِينَ إِقَامَ الصَّلَاةِ وَ إِيتَاءَ الزَّكَاةِ وَ إِقْرَاضَ اللَّهِ قَرْضاً حَسَناً وَ اجْتِنَابَ الْفَوَاحِشِ مَا ظَهَرَ مِنْهَا وَ مَا بَطَنَ \nفَلَمْ يَبْقَ شَيْ‏ءٌ مِمَّا فُسِّرَ مِمَّا حَرَّمَ اللَّهُ إِلَّا وَ قَدْ دَخَلَ فِي جُمْلَةِ قَوْلِهِ فَمَنْ دَانَ اللَّهَ فِيمَا بَيْنَهُ وَ بَيْنَ اللَّهِ مُخْلِصاً لِلَّهِ وَ لَمْ يُرَخِّصْ لِنَفْسِهِ فِي تَرْكِ شَيْ‏ءٍ مِنْ هَذَا فَهُوَ عِنْدَ اللَّهِ فِي حِزْبِهِ الْغَالِبِينَ وَ هُوَ مِنَ الْمُؤْمِنِينَ حَقّاً \nوَ إِيَّاكُمْ وَ الْإِصْرَارَ عَلَى شَيْ‏ءٍ مِمَّا حَرَّمَ اللَّهُ فِي ظَهْرِ الْقُرْآنِ وَ بَطْنِهِ وَ قَدْ قَالَ اللَّهُ تَعَالَى وَ لَمْ يُصِرُّوا عَلى ما فَعَلُوا وَ هُمْ يَعْلَمُونَ إِلَى هَاهُنَا رِوَايَةُ الْقَاسِمِ بْنِ رَبِيعٍ يَعْنِي الْمُؤْمِنِينَ قَبْلَكُمْ إِذَا نَسُوا شَيْئاً مِمَّا اشْتَرَطَ اللَّهُ فِي كِتَابِهِ عَرَفُوا أَنَّهُمْ قَدْ عَصَوُا اللَّهَ فِي تَرْكِهِمْ ذَلِكَ الشَّيْ‏ءَ فَاسْتَغْفَرُوا وَ لَمْ يَعُودُوا إِلَى تَرْكِهِ فَذَلِكَ مَعْنَى قَوْلِ اللَّهِ وَ لَمْ يُصِرُّوا عَلى ما فَعَلُوا وَ هُمْ يَعْلَمُونَ \nوَ اعْلَمُوا أَنَّهُ إِنَّمَا أَمَرَ وَ نَهَى لِيُطَاعَ فِيمَا أَمَرَ بِهِ وَ لِيُنْتَهَى عَمَّا نَهَى عَنْهُ فَمَنِ اتَّبَعَ أَمْرَهُ فَقَدْ أَطَاعَهُ وَ قَدْ أَدْرَكَ كُلَّ شَيْ‏ءٍ مِنَ الْخَيْرِ عِنْدَهُ وَ مَنْ لَمْ يَنْتَهِ عَمَّا نَهَى اللَّهُ عَنْهُ فَقَدْ عَصَاهُ فَإِنْ مَاتَ عَلَى مَعْصِيَتِهِ أَكَبَّهُ اللَّهُ عَلَى وَجْهِهِ فِي النَّارِ \nوَ اعْلَمُوا أَنَّهُ لَيْسَ بَيْنَ اللَّهِ وَ بَيْنَ أَحَدٍ مِنْ خَلْقِهِ مَلَكٌ مُقَرَّبٌ وَ لَا نَبِيٌّ مُرْسَلٌ وَ لَا مَنْ دُونَ ذَلِكَ مِنْ خَلْقِهِ كُلِّهِمْ إِلَّا طَاعَتُهُمْ لَهُ فَاجْتَهِدُوا فِي طَاعَةِ اللَّهِ إِنْ سَرَّكُمْ أَنْ تَكُونُوا مُؤْمِنِينَ حَقّاً حَقّاً وَ لَا قُوَّةَ إِلَّا بِاللَّهِ\nوَ قَالَ وَ عَلَيْكُمْ بِطَاعَةِ رَبِّكُمْ مَا اسْتَطَعْتُمْ فَإِنَّ اللَّهَ رَبُّكُمْ وَ اعْلَمُوا أَنَّ الْإِسْلَامَ هُوَ التَّسْلِيمُ وَ التَّسْلِيمَ هُوَ الْإِسْلَامُ فَمَنْ سَلَّمَ فَقَدْ أَسْلَمَ وَ مَنْ لَمْ يُسَلِّمْ فَلَا إِسْلَامَ لَهُ وَ مَنْ سَرَّهُ أَنْ يُبْلِغَ إِلَى نَفْسِهِ فِي الْإِحْسَانِ فَلْيُطِعِ اللَّهَ فَإِنَّهُ مَنْ أَطَاعَ اللَّهَ فَقَدْ أَبْلَغَ إِلَى نَفْسِهِ فِي الْإِحْسَانِ\nوَ إِيَّاكُمْ وَ مَعَاصِيَ اللَّهِ أَنْ تَرْكَبُوهَا فَإِنَّهُ مَنِ انْتَهَكَ مَعَاصِيَ اللَّهِ فَرَكِبَهَا فَقَدْ أَبْلَغَ فِي الْإِسَاءَةِ إِلَى نَفْسِهِ وَ لَيْسَ بَيْنَ الْإِحْسَانِ وَ الْإِسَاءَةِ مَنْزِلَةٌ فَلِأَهْلِ الْإِحْسَانِ عِنْدَ رَبِّهِمُ الْجَنَّةُ وَ لِأَهْلِ الْإِسَاءَةِ عِنْدَ رَبِّهِمُ النَّارُ فَاعْمَلُوا بِطَاعَةِ اللَّهِ وَ اجْتَنِبُوا مَعَاصِيَهُ وَ اعْلَمُوا أَنَّهُ لَيْسَ يُغْنِي عَنْكُمْ مِنَ اللَّهِ أَحَدٌ مِنْ خَلْقِهِ شَيْئاً لَا مَلَكٌ مُقَرَّبٌ وَ لَا نَبِيٌّ مُرْسَلٌ وَ لَا مَنْ دُونَ ذَلِكَ فَمَنْ سَرَّهُ أَنْ تَنْفَعَهُ شَفَاعَةُ الشَّافِعِينَ عِنْدَ اللَّهِ فَلْيَطْلُبْ إِلَى اللَّهِ أَنْ يَرْضَى عَنْهُ\nوَ اعْلَمُوا أَنَّ أَحَداً مِنْ خَلْقِ اللَّهِ لَمْ يُصِبْ رِضَا اللَّهِ إِلَّا بِطَاعَتِهِ وَ طَاعَةِ رَسُولِهِ وَ طَاعَةِ وُلَاةِ أَمْرِهِ مِنْ آلِ مُحَمَّدٍ ( صلى الله عليه وآله ) وَ مَعْصِيَتُهُمْ مِنْ مَعْصِيَةِ اللَّهِ وَ لَمْ يُنْكِرْ لَهُمْ فَضْلًا عَظُمَ أَوْ صَغُرَ وَ اعْلَمُوا أَنَّ الْمُنْكِرِينَ هُمُ الْمُكَذِّبُونَ وَ أَنَّ الْمُكَذِّبِينَ هُمُ الْمُنَافِقُونَ وَ أَنَّ اللَّهَ عَزَّ وَ جَلَّ قَالَ لِلْمُنَافِقِينَ وَ قَوْلُهُ الْحَقُّ إِنَّ الْمُنافِقِينَ فِي الدَّرْكِ الْأَسْفَلِ مِنَ النَّارِ وَ لَنْ تَجِدَ لَهُمْ نَصِيراً \nوَ لَا يَفْرَقَنَّ أَحَدٌ مِنْكُمْ أَلْزَمَ اللَّهُ قَلْبَهُ طَاعَتَهُ وَ خَشْيَتَهُ مِنْ أَحَدٍ مِنَ النَّاسِ مِمَّنْ أَخْرَجَهُ اللَّهُ مِنْ صِفَةِ الْحَقِّ وَ لَمْ يَجْعَلْهُ مِنْ أَهْلِهَا فَإِنَّ مَنْ لَمْ يَجْعَلِ اللَّهُ مِنْ أَهْلِ صِفَةِ الْحَقِّ فَأُولَئِكَ هُمْ شَيَاطِينُ الْإِنْسِ وَ الْجِنِّ وَ إِنَّ لِشَيَاطِينِ الْإِنْسِ حِيلَةً وَ مَكْراً وَ خَدَائِعَ وَ وَسْوَسَةً بَعْضِهِمْ إِلَى بَعْضٍ يُرِيدُونَ إِنِ اسْتَطَاعُوا أَنْ يَرُدُّوا أَهْلَ الْحَقِّ عَمَّا أَكْرَمَهُمُ اللَّهُ بِهِ مِنَ النَّظَرِ فِي دِينِ اللَّهِ الَّذِي لَمْ يَجْعَلِ اللَّهُ شَيَاطِينَ الْإِنْسِ مِنْ أَهْلِهِ إِرَادَةَ أَنْ يَسْتَوِيَ أَعْدَاءُ اللَّهِ وَ أَهْلُ الْحَقِّ فِي الشَّكِّ وَ الْإِنْكَارِ وَ التَّكْذِيبِ فَيَكُونُونَ سَوَاءً كَمَا وَصَفَ اللَّهُ تَعَالَى فِي كِتَابِهِ مِنْ قَوْلِهِ وَدُّوا لَوْ تَكْفُرُونَ كَما كَفَرُوا فَتَكُونُونَ سَواءً ثُمَّ نَهَى اللَّهُ أَهْلَ النَّصْرِ بِالْحَقِّ أَنْ يَتَّخِذُوا مِنْ أَعْدَاءِ اللَّهِ وَلِيّاً وَ لَا نَصِيراً \nفَلَا يُهَوِّلَنَّكُمْ وَ لَا يَرُدَّنَّكُمْ عَنِ النَّصْرِ بِالْحَقِّ الَّذِي خَصَّكُمُ اللَّهُ بِهِ مِنْ حِيلَةِ شَيَاطِينِ الْإِنْسِ وَ مَكْرِهِمْ مِنْ أُمُورِكُمْ تَدْفَعُونَ أَنْتُمُ السَّيِّئَةَ بِالَّتِي هِيَ أَحْسَنُ فِيمَا بَيْنَكُمْ وَ بَيْنَهُمْ تَلْتَمِسُونَ بِذَلِكَ وَجْهَ رَبِّكُمْ بِطَاعَتِهِ وَ هُمْ لَا خَيْرَ عِنْدَهُمْ لَا يَحِلُّ لَكُمْ أَنْ تُظْهِرُوهُمْ عَلَى أُصُولِ دِينِ اللَّهِ فَإِنَّهُمْ إِنْ سَمِعُوا مِنْكُمْ فِيهِ شَيْئاً عَادَوْكُمْ عَلَيْهِ وَ رَفَعُوهُ عَلَيْكُمْ وَ جَهَدُوا عَلَى هَلَاكِكُمْ وَ اسْتَقْبَلُوكُمْ بِمَا تَكْرَهُونَ\nوَ لَمْ يَكُنْ لَكُمُ النَّصَفَةُ مِنْهُمْ فِي دُوَلِ الْفُجَّارِ فَاعْرِفُوا مَنْزِلَتَكُمْ فِيمَا بَيْنَكُمْ وَ بَيْنَ أَهْلِ الْبَاطِلِ فَإِنَّهُ لَا يَنْبَغِي لِأَهْلِ الْحَقِّ أَنْ يُنْزِلُوا أَنْفُسَهُمْ مَنْزِلَةَ أَهْلِ الْبَاطِلِ لِأَنَّ اللَّهَ لَمْ يَجْعَلْ أَهْلَ الْحَقِّ عِنْدَهُ بِمَنْزِلَةِ أَهْلِ الْبَاطِلِ أَ لَمْ يَعْرِفُوا وَجْهَ قَوْلِ اللَّهِ فِي كِتَابِهِ إِذْ يَقُولُ أَمْ نَجْعَلُ الَّذِينَ آمَنُوا وَ عَمِلُوا الصَّالِحاتِ كَالْمُفْسِدِينَ فِي الْأَرْضِ أَمْ نَجْعَلُ الْمُتَّقِينَ كَالْفُجَّارِ أَكْرِمُوا أَنْفُسَكُمْ عَنْ أَهْلِ الْبَاطِلِ وَ لَا تَجْعَلُوا اللَّهَ تَبَارَكَ وَ تَعَالَى وَ لَهُ الْمَثَلُ الْأَعْلَى وَ إِمَامَكُمْ وَ دِينَكُمُ الَّذِي تَدِينُونَ بِهِ عُرْضَةً لِأَهْلِ الْبَاطِلِ فَتُغْضِبُوا اللَّهَ عَلَيْكُمْ فَتَهْلِكُوا فَمَهْلًا مَهْلًا\nيَا أَهْلَ الصَّلَاحِ لَا تَتْرُكُوا أَمْرَ اللَّهِ وَ أَمْرَ مَنْ أَمَرَكُمْ بِطَاعَتِهِ فَيُغَيِّرَ اللَّهُ مَا بِكُمْ مِنْ نِعْمَةٍ أَحِبُّوا فِي اللَّهِ مَنْ وَصَفَ صِفَتَكُمْ وَ أَبْغِضُوا فِي اللَّهِ مَنْ خَالَفَكُمْ وَ ابْذُلُوا مَوَدَّتَكُمْ وَ نَصِيحَتَكُمْ [لِمَنْ وَصَفَ صِفَتَكُمْ] وَ لَا تَبْتَذِلُوهَا لِمَنْ رَغِبَ عَنْ صِفَتِكُمْ وَ عَادَاكُمْ عَلَيْهَا وَ بَغَى لَكُمُ الْغَوَائِلَ هَذَا أَدَبُنَا أَدَبُ اللَّهِ فَخُذُوا بِهِ وَ تَفَهَّمُوهُ وَ اعْقِلُوهُ وَ لَا تَنْبِذُوهُ وَرَاءَ ظُهُورِكُمْ مَا وَافَقَ هُدَاكُمْ أَخَذْتُمْ بِهِ وَ مَا وَافَقَ هَوَاكُمْ طَرَحْتُمُوهُ وَ لَمْ تَأْخُذُوا بِهِ\nوَ إِيَّاكُمْ وَ التَّجَبُّرَ عَلَى اللَّهِ وَ اعْلَمُوا أَنَّ عَبْداً لَمْ يُبْتَلَ بِالتَّجَبُّرِ عَلَى اللَّهِ إِلَّا تَجَبَّرَ عَلَى دِينِ اللَّهِ فَاسْتَقِيمُوا لِلَّهِ وَ لَا تَرْتَدُّوا عَلَى أَعْقَابِكُمْ فَتَنْقَلِبُوا خَاسِرِينَ أَجَارَنَا اللَّهُ وَ إِيَّاكُمْ مِنَ التَّجَبُّرِ عَلَى اللَّهِ وَ لَا قُوَّةَ لَنَا وَ لَكُمْ إِلَّا بِاللَّهِ \nوَ قَالَ ( عليه السلام ) إِنَّ الْعَبْدَ إِذَا كَانَ خَلَقَهُ اللَّهُ فِي الْأَصْلِ أَصْلِ الْخَلْقِ مُؤْمِناً لَمْ يَمُتْ حَتَّى يُكَرِّهَ اللَّهُ إِلَيْهِ الشَّرَّ وَ يُبَاعِدَهُ عَنْهُ وَ مَنْ كَرَّهَ اللَّهُ إِلَيْهِ الشَّرَّ وَ بَاعَدَهُ عَنْهُ عَافَاهُ اللَّهُ مِنَ الْكِبْرِ أَنْ يَدْخُلَهُ وَ الْجَبْرِيَّةِ فَلَانَتْ عَرِيكَتُهُ وَ حَسُنَ خُلُقُهُ وَ طَلُقَ وَجْهُهُ وَ صَارَ عَلَيْهِ وَقَارُ الْإِسْلَامِ وَ سَكِينَتُهُ وَ تَخَشُّعُهُ وَ وَرِعَ عَنْ مَحَارِمِ اللَّهِ وَ اجْتَنَبَ مَسَاخِطَهُ وَ رَزَقَهُ اللَّهُ مَوَدَّةَ النَّاسِ وَ مُجَامَلَتَهُمْ وَ تَرْكَ مُقَاطَعَةِ النَّاسِ وَ الْخُصُومَاتِ وَ لَمْ يَكُنْ مِنْهَا وَ لَا مِنْ أَهْلِهَا فِي شَيْ‏ءٍ\nوَ إِنَّ الْعَبْدَ إِذَا كَانَ اللَّهُ خَلَقَهُ فِي الْأَصْلِ [أَصْلِ الْخَلْقِ] كَافِراً لَمْ يَمُتْ حَتَّى يُحَبِّبَ إِلَيْهِ الشَّرَّ وَ يُقَرِّبَهُ مِنْهُ فَإِذَا حَبَّبَ إِلَيْهِ الشَّرَّ وَ قَرَّبَهُ مِنْهُ ابْتُلِيَ بِالْكِبْرِ وَ الْجَبْرِيَّةِ فَقَسَا قَلْبُهُ وَ سَاءَ خُلُقُهُ وَ غَلُظَ وَجْهُهُ وَ ظَهَرَ فُحْشُهُ وَ قَلَّ حَيَاؤُهُ وَ كَشَفَ اللَّهُ سِتْرَهُ وَ رَكِبَ الْمَحَارِمَ فَلَمْ يَنْزِعْ عَنْهَا وَ رَكِبَ مَعَاصِيَ اللَّهِ وَ أَبْغَضَ طَاعَتَهُ وَ أَهْلَهَا فَبُعْدٌ مَا بَيْنَ حَالِ الْمُؤْمِنِ وَ حَالِ الْكَافِرِ سَلُوا اللَّهَ الْعَافِيَةَ وَ اطْلُبُوهَا إِلَيْهِ وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ\nصَبِّرُوا النَّفْسَ عَلَى الْبَلَاءِ فِي الدُّنْيَا فَإِنَّ تَتَابُعَ الْبَلَاءِ فِيهَا وَ الشِّدَّةَ فِي طَاعَةِ اللَّهِ وَ وَلَايَتِهِ وَ وَلَايَةِ مَنْ أَمَرَ بِوَلَايَتِهِ خَيْرٌ عَاقِبَةً عِنْدَ اللَّهِ فِي الْآخِرَةِ مِنْ مُلْكِ الدُّنْيَا وَ إِنْ طَالَ تَتَابُعُ نَعِيمِهَا وَ زَهْرَتِهَا وَ غَضَارَةُ عَيْشِهَا فِي مَعْصِيَةِ اللَّهِ وَ وَلَايَةِ مَنْ نَهَى اللَّهُ عَنْ وَلَايَتِهِ وَ طَاعَتِهِ فَإِنَّ اللَّهَ أَمَرَ بِوَلَايَةِ الْأَئِمَّةِ الَّذِينَ سَمَّاهُمُ اللَّهُ فِي كِتَابِهِ فِي قَوْلِهِ وَ جَعَلْناهُمْ أَئِمَّةً يَهْدُونَ بِأَمْرِنا وَ هُمُ الَّذِينَ أَمَرَ اللَّهُ بِوَلَايَتِهِمْ وَ طَاعَتِهِمْ وَ الَّذِينَ نَهَى اللَّهُ عَنْ وَلَايَتِهِمْ وَ طَاعَتِهِمْ وَ هُمْ أَئِمَّةُ الضَّلَالَةِ الَّذِينَ قَضَى اللَّهُ أَنْ يَكُونَ لَهُمْ دُوَلٌ فِي الدُّنْيَا عَلَى أَوْلِيَاءِ اللَّهِ الْأَئِمَّةِ مِنْ آلِ مُحَمَّدٍ يَعْمَلُونَ فِي دُولَتِهِمْ بِمَعْصِيَةِ اللَّهِ وَ مَعْصِيَةِ رَسُولِهِ ( صلى الله عليه وآله ) لِيَحِقَّ عَلَيْهِمْ كَلِمَةُ الْعَذَابِ وَ لِيَتِمَّ أَنْ تَكُونُوا مَعَ نَبِيِّ اللَّهِ مُحَمَّدٍ ( صلى الله عليه وآله ) وَ الرُّسُلِ مِنْ قَبْلِهِ\nفَتَدَبَّرُوا مَا قَصَّ اللَّهُ عَلَيْكُمْ فِي كِتَابِهِ مِمَّا ابْتَلَى بِهِ أَنْبِيَاءَهُ وَ أَتْبَاعَهُمُ الْمُؤْمِنِينَ ثُمَّ سَلُوا اللَّهَ أَنْ يُعْطِيَكُمُ الصَّبْرَ عَلَى الْبَلَاءِ فِي السَّرَّاءِ وَ الضَّرَّاءِ وَ الشِّدَّةِ وَ الرَّخَاءِ مِثْلَ الَّذِي أَعْطَاهُمْ \nوَ إِيَّاكُمْ وَ مُمَاظَّةَ أَهْلِ الْبَاطِلِ وَ عَلَيْكُمْ بِهُدَى الصَّالِحِينَ وَ وَقَارِهِمْ وَ سَكِينَتِهِمْ وَ حِلْمِهِمْ وَ تَخَشُّعِهِمْ وَ وَرَعِهِمْ عَنْ مَحَارِمِ اللَّهِ وَ صِدْقِهِمْ وَ وَفَائِهِمْ وَ اجْتِهَادِهِمْ لِلَّهِ فِي الْعَمَلِ بِطَاعَتِهِ فَإِنَّكُمْ إِنْ لَمْ تَفْعَلُوا ذَلِكَ لَمْ تُنْزَلُوا عِنْدَ رَبِّكُمْ مَنْزِلَةَ الصَّالِحِينَ قَبْلَكُمْ \nوَ اعْلَمُوا أَنَّ اللَّهَ إِذَا أَرَادَ بِعَبْدٍ خَيْراً شَرَحَ صَدْرَهُ لِلْإِسْلَامِ فَإِذَا أَعْطَاهُ ذَلِكَ أَنْطَقَ لِسَانَهُ بِالْحَقِّ وَ عَقَدَ قَلْبَهُ عَلَيْهِ فَعَمِلَ بِهِ فَإِذَا جَمَعَ اللَّهُ لَهُ ذَلِكَ تَمَّ لَهُ إِسْلَامُهُ وَ كَانَ عِنْدَ اللَّهِ إِنْ مَاتَ عَلَى ذَلِكَ الْحَالِ مِنَ الْمُسْلِمِينَ حَقّاً \nوَ إِذَا لَمْ يُرِدِ اللَّهُ بِعَبْدٍ خَيْراً وَكَلَهُ إِلَى نَفْسِهِ وَ كَانَ صَدْرُهُ ضَيِّقاً حَرَجاً فَإِنْ جَرَى عَلَى لِسَانِهِ حَقٌّ لَمْ يُعْقَدْ قَلْبُهُ عَلَيْهِ وَ إِذَا لَمْ يُعْقَدْ قَلْبُهُ عَلَيْهِ لَمْ يُعْطِهِ اللَّهُ الْعَمَلَ بِهِ فَإِذَا اجْتَمَعَ ذَلِكَ عَلَيْهِ حَتَّى يَمُوتَ وَ هُوَ عَلَى تِلْكَ الْحَالِ كَانَ عِنْدَ اللَّهِ مِنَ الْمُنَافِقِينَ وَ صَارَ مَا جَرَى عَلَى لِسَانِهِ مِنَ الْحَقِّ الَّذِي لَمْ يُعْطِهِ اللَّهُ أَنْ يُعْقَدَ قَلْبُهُ عَلَيْهِ وَ لَمْ يُعْطِهِ الْعَمَلَ بِهِ حُجَّةً عَلَيْهِ يَوْمَ الْقِيَامَةِ\nفَاتَّقُوا اللَّهَ وَ سَلُوهُ أَنْ يَشْرَحَ صُدُورَكُمْ لِلْإِسْلَامِ وَ أَنْ يَجْعَلَ أَلْسِنَتَكُمْ تَنْطِقُ بِالْحَقِّ حَتَّى يَتَوَفَّيكُمْ وَ أَنْتُمْ عَلَى ذَلِكَ وَ أَنْ يَجْعَلَ مُنْقَلَبَكُمْ مُنْقَلَبَ الصَّالِحِينَ قَبْلَكُمْ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ وَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ\nوَ مَنْ سَرَّهُ أَنْ يَعْلَمَ أَنَّ اللَّهَ يُحِبُّهُ فَلْيَعْمَلْ بِطَاعَةِ اللَّهِ وَ لْيَتَّبِعْنَا أَ لَمْ يَسْمَعْ قَوْلَ اللَّهِ عَزَّ وَ جَلَّ لِنَبِيِّهِ ( صلى الله عليه وآله ) قُلْ إِنْ كُنْتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ وَ يَغْفِرْ لَكُمْ ذُنُوبَكُمْ \nوَ اللَّهِ لَا يُطِيعُ اللَّهَ عَبْدٌ أَبَداً إِلَّا أَدْخَلَ اللَّهُ عَلَيْهِ فِي طَاعَتِهِ اتِّبَاعَنَا وَ لَا وَ اللَّهِ لَا يَتَّبِعُنَا عَبْدٌ أَبَداً إِلَّا أَحَبَّهُ اللَّهُ وَ لَا وَ اللَّهِ لَا يَدَعُ أَحَدٌ اتِّبَاعَنَا أَبَداً إِلَّا أَبْغَضَنَا وَ لَا وَ اللَّهِ لَا يُبْغِضُنَا أَحَدٌ أَبَداً إِلَّا عَصَى اللَّهَ وَ مَنْ مَاتَ عَاصِياً لِلَّهِ أَخْزَاهُ اللَّهُ وَ أَكَبَّهُ عَلَى وَجْهِهِ فِي النَّارِ وَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>bu Abdullah</span><sup>asws</sup>, wrote this letter to his<sup>asws</sup> companions and commanded them to study it, ponder over it, and make a pact by it, and act in accordance with. They used to keep it in their places of Prayer in their homes. So when they were free from their Prayers, they would look into it’. \n<span style=\"font-size: small\">He said, ‘Narrated to me A-Hassan Ibn Muhammad, from Ja'far Ibn Muhammad Ibn Malik al-Kufiy from al-Qasim Ibn Al-Rabi' Al-Sahhaf from 'Ismail Ibn Mukhallad Al-Sarraj from Abu Abd Allah</span><sup>asws</sup><span style=\"font-size: small\">. </span>\nHe said that, ‘I brought out this letter of Abu Abdullah<sup>asws</sup> to his<sup>asws</sup> companions – \n‘In the Name of Allah<sup>azwj</sup>, the Beneficent, the Merciful. Having said that, I<sup>asws</sup> ask your Lord<sup>azwj</sup> to grant you all good health. It is for you all to have tenderness, dignity and tranquility, and it is for you to be bashful and keep yourselves clear, just as the righteous people before you have done. It is for you to be courteous with the people of falsehood. You will bear injustices from them, and beware of disputing with them in what is between you and them. When you sit with them, and are alone with them and argue your differences with them, there is no way out for you but to sit with them and be alone with them, and argue with them by the dissimulation which Allah<sup>azwj</sup> has Ordered you for, that you should take to it regarding what is between you and them. \nSo if you are tested with that from them, that they wish to harm you and you can recognise abhorrence in their faces, and if Allah<sup>azwj</sup>, the High does not Dispel them away from you, they would rob you. And what is in their chests of enmity and hatred is much more than what they display to you. Your gatherings and their gatherings are one and the same, but your spirits and their spirits are different. You will not reconcile with them and you will never lover them, ever, and they will never love you as well. Surely Allah<sup>azwj</sup> the High has Honoured you all with the truth and Made you to visualise it, and did not Make them to be deserving of it. \nBe courteous to them and be patient with them, for they have no courtesy to you nor do they have patience over anything, and some of them are obsessed with tricking the others, for the enemies of Allah<sup>azwj</sup> have the ability to keep you from the truth. Allah<sup>azwj</sup> Protects you from that, so fear Allah<sup>azwj</sup> and hold back your tongues except from the good, and beware of letting your tongues to slip into speaking that which is false, and the slanderous, and the sinful, and the violation. So if you were to hold back your tongues from what is disliked by Allah<sup>azwj</sup>, from what He<sup>azwj</sup> has Forbidden you from, it would be better for you with your Lord<sup>azwj</sup> than letting your tongues slip into what is disliked by Him<sup>azwj</sup> and what He<sup>azwj</sup> has Prohibited you from.  \nThere is destruction for the servant, with Allah<sup>azwj</sup>, and Repugnance from Allah<sup>azwj</sup>, and there will be deafness, and blindness, and muteness which Allah<sup>azwj</sup> will Make him to inherit on the Day of Judgement. So they will become just as Allah<sup>azwj</sup> has said: <span class=\"ibTxt\">“[2:18] Deaf, dumb (and) blind, so they will not turn back”</span>, it means that they will not be speaking and will not have the Permission to present their excuses. And beware from what Allah<sup>azwj</sup> has Prohibited you from doing, and it is for you to remain silent except with regards to what Allah<sup>azwj</sup> has Benefited you by from the matters of your Hereafter and be Rewarded by Him<sup>azwj</sup>.\nAnd be frequent in Extolling His<sup>azwj</sup> Holiness, and Glorification, and the Praising to Allah<sup>azwj</sup>, and the desires for what is with Him<sup>azwj</sup> from the Good which cannot be estimated, nor can anyone reach it (imagine), so occupy your tongues with that in order to avoid the false speech which would lead its owners to an eternity in the Fire for the one who dies upon it and does not repent to Allah<sup>azwj</sup>, and does not keep away from it.  \nAnd it is for you to supplicate, for the Muslims cannot be successful in the fulfilment of their wishes with their Lord<sup>azwj</sup> by any means higher than supplication and desiring from Him<sup>azwj</sup>, and appealing to Allah<sup>azwj</sup>, and the asking from Him<sup>azwj</sup>. So be desirous in what you request to Allah<sup>azwj</sup> so that He<sup>azwj</sup> would Answer you to what you have supplicated to Him<sup>azwj</sup> in order to be successful and be saved from the Punishment of Allah<sup>azwj</sup>.\nAnd beware of being greedy for yourselves to something from what Allah<sup>azwj</sup> has Prohibited to you. For the one who violates what Allah<sup>azwj</sup> has Prohibited to him here in the world, Allah<sup>azwj</sup> would Place a block between him and the Paradise, and its Bounties, and its enjoyments, and its Prestige which will stand for all eternity for the inhabitants of the Paradise, for ever and ever. \nAnd know that it is an evil misfortune for the one who takes the risk of endangering the obedience to Allah<sup>azwj</sup> the Blessed, and to be disobedient to Him<sup>azwj</sup>. So the choosing to violate what Allah<sup>azwj</sup> has Prohibited from the pleasures of the world would cut its people off from the eternal-Bliss in the Paradise, and its pleasures, and the prestige of its inhabitants.\nWoe be unto those! What a frustration they will face when they lose, and evil would be their condition with their Lord<sup>azwj</sup> on the Day of Judgement. Seek Refuge with Allah<sup>azwj</sup> that He<sup>azwj</sup> would Protect you from being in a situation similar to theirs forever, and be in afflictions like their afflictions. \nAnd there is no Might with us<sup>asws</sup> or with you except by Him<sup>azwj</sup>. So, fear Allah<sup>azwj</sup>, O group of saved people, that Allah<sup>azwj</sup> will Complete for you what He<sup>azwj</sup> has Granted you with, for the matter will not be complete until He<sup>azwj</sup> Makes you to enter into similar of what came upon the righteous ones before you, and until you face tribulation with regards to yourselves and your wealth, and until you hear from the enemies of Allah<sup>azwj</sup>, a lot of painful words.\nSo, observe patience and take it in your stride, and even if they humiliate you, and hate you, and even if they burden you with injustices. So bear these from them, seeking by that the Face of Allah<sup>azwj</sup> and the House of the Hereafter, and until you control your intense anger in the suffering for the sake of Allah<sup>azwj</sup> Mighty and Majestic. They will incriminate you, and even belie you about the truth, and be inimical towards you with regards to it, and be hateful towards you.\nSo, observe patience on that from them, and all that has been Ratified in the Book of Allah<sup style=\"font-weight: normal\">azwj</sup> which Jibraeel<sup style=\"font-weight: normal\">a</sup><sup style=\"font-weight: normal\">s</sup> Descended with upon your Prophet<sup style=\"font-weight: normal\">saww</sup>, getting your Prophet<sup style=\"font-weight: normal\">saww</sup> to hear the Words of Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[46:35] Therefore bear up patiently as did the messengers endowed with constancy bear up with patience and do not seek to hasten for them (their doom).”</span> Then He<sup style=\"font-weight: normal\">azwj</sup> Said: <span class=\"ibTxt\">“[35:4] And if they call you a liar, truly messengers before you were called liars”.</span>\nSo observe patience on what they lie about and hurt you with, for they had belied the Prophet<sup>saww</sup> of Allah<sup>azwj</sup>, and the Messengers<sup>as</sup> from before him<sup>saww</sup>, and hurt them along with the denial of the truth. And if you are happy with the Commands of Allah<sup>azwj</sup> regarding them<sup>asws</sup> whom Allah<sup>azwj</sup> Created for Himself<sup>zwj</sup> in the Beginning (beginning of the creation), from the infidelity which has preceded in the Knowledge of Allah<sup>azwj</sup> that He<sup>azwj</sup> Created them in the origin and the ones whom Allah<sup>azwj</sup> has Named in His<sup>azwj</sup> book in His<sup>azwj</sup> Words: <span class=\"ibTxt\">“[28:41] And We made them Imams who call to the fire”</span>.\nSo, ponder over this and hold on to it, and do not be ignorant of it, for the one who is ignorant of this and the like of this which Allah<sup>azwj</sup> has Made to be Obligatory in His<sup>azwj</sup> Book from what Allah<sup>azwj</sup> has Ordered for and Prohibited from, has disregarded the Religion of Allah<sup>azwj</sup> and became disobedient to Him<sup>azwj</sup>. Therefore he has necessitated (upon himself) the Outrage of Allah<sup>azwj</sup>, and Allah<sup>azwj</sup> will Fling him into the Fire upon his face’.\nAnd he<sup>asws</sup> said: ‘O you group of Blessed ones, the victorious ones! Surely, Allah<sup>azwj</sup> Completed for you what He<sup>azwj</sup> Granted you all from the good, and know that it is not from the Knowledge of Allah<sup>azwj</sup>, nor from His<sup>azwj</sup> Commands that any one from the creatures of Allah<sup>azwj</sup>, should take to opinions or analogies regarding his Religion. Allah<sup>azwj</sup> Has Sent down the Quran and Made to be in it an explanation of all things, and Assigned for the Quran and the teaching of the Quran, its People<sup>asws</sup>. \nThere is no leeway for the People<sup>asws</sup> of knowledge of the Quran whom<sup>asws</sup> Allah<sup>azwj</sup> had Given to them of its Knowledge, that they<sup>asws</sup> should take to desires, or opinions, or analogies with regards to it. Allah<sup>azwj</sup> has Made them<sup>asws</sup> to be needless from that by what He<sup>azwj</sup> has Given them<sup>asws</sup> from His<sup>azwj</sup> Knowledge, and Specialised them<sup>asws</sup> by it, and Placed in it Prestige from Allah<sup>azwj</sup> to Honour them<sup>asws</sup> by.\nAnd they<sup>asws</sup> are the People<sup>asws</sup> of the Remembrance (<span class=\"iTxt\">Ahl Al-Zikr</span>) whom Allah<sup>azwj</sup> has Ordered the people to ask them<sup>asws</sup>, and they<sup>asws</sup> are the ones<sup>asws</sup> to be asked. And it has preceded in the Knowledge of Allah<sup>azwj</sup> that they should ratify them<sup>asws</sup>, and follow their<sup>asws</sup> footsteps. He<sup>azwj</sup> Guided them<sup>asws</sup>, and Gave them<sup>asws</sup> from the Knowledge of the Quran with which they<sup>asws</sup> guide (others) to Allah<sup>azwj</sup> by His<sup>azwj</sup> Permission, and to all the ways of the truth. \nAnd they<sup>asws</sup> are the ones<sup>asws</sup> that He<sup>azwj</sup> does not Want them to be released from, and from asking them<sup>asws</sup>, and from being taught by them<sup>asws</sup> which Allah<sup>azwj</sup> has Honoured them<sup>asws</sup> with and Made it to be with them<sup>asws</sup>, except for the one who has preceded in the Knowledge of Allah<sup>azwj</sup>, as being the miserable one in the origin of the creation underneath the shadow.\nSo these are the ones who turn away from asking the People<sup>asws</sup> of the Remembrance (Ahl Al-Zikr) and the ones<sup>asws</sup> to whom Allah<sup>azwj</sup> has Granted the Knowledge of the Quran and Placed it in their<sup>asws</sup> possession, and Ordered for asking them<sup>asws</sup>. \nThese are the ones who act on their desires, and their opinions, and their analogies to the extent that Satan<sup>la</sup> enters them<a id=\"_ftnref1\"></a><sup>[1]</sup>, (as a result) they (try) to revert the believing people, in the Knowledge of the Quran with Allah<sup>azwj</sup>, as disbelievers, and try to make the misguided people, in the Knowledge of the Quran with Allah<sup>azwj</sup>, as believer, but to the extent that they declare what Allah<sup>azwj</sup> has Made Permissible, in many matters as being prohibited, and pronounce what Allah<sup>azwj</sup> has Prohibited, in many matters as being permissible.\nSo this is the origin of the fruit of their desires. And the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> had taken an oath from them before his<sup>saww</sup> passing away. So they said, ‘After Allah<sup>azwj</sup> Captures His<sup>azwj</sup> Messenger<sup>saww</sup>, we have the leeway of taking to the consensus of the opinions of the people. After Allah<sup>azwj</sup> Mighty and Majestic Captured His<sup>azwj</sup> Messenger<sup>saww</sup>, and after his<sup>saww</sup> oath which he<sup>saww</sup> took from us<sup>asws</sup>, and ordered us<sup>asws</sup> by, they opposed Allah<sup>azwj</sup> and His<sup>azwj</sup> Messenger<sup>saww</sup>. \nSo what is more audacious to Allah<sup>azwj</sup>, nor any clear misguidance from the one who takes to that, and alleges that it gives him the leeway to do it? By Allah<sup>azwj</sup>, surely Allah<sup>azwj</sup> has Obligated His<sup>azwj</sup> creatures that they should obey Him<sup>azwj</sup>, and follow His<sup>azwj</sup> Commands during the lifetime of Muhammad<sup>saww</sup>, and after his<sup>saww</sup> passing away. \nCan those enemies of Allah<sup>azwj</sup> who are alleging that anyone who became a Muslim with Muhammad<sup>saww</sup>, can take to his own words, and his own opinions, and his own analogies? But if he says, ‘Yes, then, surely, he has lied to Allah<sup>azwj</sup> and has strayed a far straying, and if he says, ‘No, it is not for anyone that he should take to his opinions, and his desires, and his analogies’, so he has argued against himself, and he is from the ones who allege that Allah<sup>azwj</sup> has to be Obeyed, and His<sup>azwj</sup> Orders to be followed after the passing away of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>.\nAllah<sup>azwj</sup> has said, and His<sup>azwj</sup> words are true: <span class=\"ibTxt\">“[3:144] And Muhammad is no more than a messenger; the messengers have already passed away before him; if then he dies or is killed will you turn back upon your heels? And whoever turns back upon his heels, he will by no means do harm to Allah in the least and Allah will reward the grateful”</span>, and that is something which they knew that Allah<sup>azwj</sup> is to be obeyed and His<sup>azwj</sup> Commands are to be followed during the lifetime of Muhammad<sup>saww</sup>, and (as well as) after Allah<sup>azwj</sup> had Made Muhammad<sup>saww</sup> to pass away. And if it was not for anyone from the people who were with Muhammad<sup>saww</sup> that they would take to their own desires, and their opinions, and their analogies in opposition to the orders of Muhammad<sup>saww</sup>, so similarly it is not for anyone from the people after Muhammad<sup>saww</sup> that they would take to their own desires, and their opinions, and their analogies’.\nAnd he<sup>asws</sup> said: ‘Leave the raising of your hands in the Prayer except for the one time when you open the Prayer, for the people have publicised you all by that<a id=\"_ftnref2\"></a><sup>[2]</sup>, and Allah<sup>azwj</sup> is the Helper, and there is no Might and there is no Power except by Allah<sup>azwj</sup>’.\nAnd he<sup>asws</sup> said: ‘Supplicate frequently to Allah<sup>azwj</sup> for Allah<sup>azwj</sup> Loves the ones from the believing servants that they should supplicate to Him<sup>azwj</sup>, and Allah<sup>azwj</sup> has Promised the believing servants for the Answering, and Allah<sup>azwj</sup> has Destined the supplications of the Believers, on the Day of Judgement, to increase their deeds by it in the Paradise. So, frequently remember Allah<sup>azwj</sup> in accordance with your abilities in every hour of the hours of the night and the day, for Allah<sup>azwj</sup> has Ordered for frequent Remembrance (Al-Zikr) to Him<sup>azwj</sup>, and Allah<sup>azwj</sup> Remembers the one who remembers Him<sup>azwj</sup> from the Believers. And know, that Allah<sup>azwj</sup> never Remembers anyone from His<sup>azwj</sup> believing servant except Remembering him with Goodness.\nSo give Allah<sup>azwj</sup> from yourselves, the struggle in obedience to Him<sup>azwj</sup>, for Allah<sup>azwj</sup> does not Accept anything from the good with Him<sup>azwj</sup> except by obedience to Him<sup>azwj</sup>, and the avoidance of His<sup>azwj</sup> Prohibitions which Allah<sup>azwj</sup> has Prohibited in the apparent of the Quran and in its hidden. Allah<sup>azwj</sup> Blessed and High has Said in His<sup>azwj</sup> Book, and His<sup>azwj</sup> Words are True: <span class=\"ibTxt\">“[6:120] And abandon open and secret sin”</span>.  \nAnd know that whatever Allah<sup>azwj</sup> has Ordered you to avoid, so He<sup>azwj</sup> has Prohibited it, and follow the footsteps of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>, and his<sup>saww</sup> Sunnah, so adhere to it and do not follow your own desires, and your opinions, for you will go astray. The most misguided of the people with Allah<sup>azwj</sup> is the one who follows his own desires and his opinion without (following the) Guidance from Allah<sup>azwj</sup>. \nAnd do good for yourselves in accordance with your abilities, for if you do good, it would be for your own selves, and if you violate, it would be against your own selves. And intermingle with the people and do not burden them upon your necks, including along with that the obedience to your Lord<sup>azwj</sup>. And beware of insulting the enemies of Allah<sup>azwj</sup> when they are listening to you, for the enemies will insult Allah<sup>azwj</sup> without awareness, and it is better that you should know the penalty of insulting Allah<sup>azwj</sup> and what it is. \nHe who has insulted the friends of Allah<sup>azwj</sup> is like he has insulted Allah<sup>azwj</sup>. And the one who is the most unjust with Allah<sup>azwj</sup> is the one who insults Allah<sup>azwj</sup> and the friends of Allah<sup>azwj</sup>, so don’t do it, don’t do it. Follow the Commands of Allah<sup>azwj</sup>. There is no Might, and no Power except by Allah<sup>azwj</sup>’.\nAnd he<sup>asws</sup> said: ‘O you group for whom Allah<sup>azwj</sup> has Protected for them their affairs! It is for you to follow the footsteps of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> and his<sup>saww</sup> Sunnah, and the footsteps of the Imams<sup>a</sup><sup>sws</sup> of Guidance from the People<sup>asws</sup> of the Household of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> from after him<sup>saww</sup> and their<sup>asws</sup> Sunnah. So the one who takes to that has been guided, and the one who avoided that and abandoned it, went astray, because they<sup>asws</sup> are the ones<sup>asws</sup> for whom Allah<sup>azwj</sup> Commanded (the people) to be obedient to, and for their<sup>asws</sup> Wilayah. \nAnd our<sup>asws</sup> father<sup>asws</sup> the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> has said: ‘The continuation upon the deeds in the following of the footsteps and the Sunnah, even though they may be little, is more Pleasing to Allah<sup>azwj</sup> and beneficial with Him<sup>azwj</sup> in the Rewards, than the struggle in the ‘Bittah) heresy, and the desires. Indeed, the following of the desires, and the following of the heresies (innovations) without Guidance from Allah<sup>azwj</sup> is misguidance, and every misguidance is heresy, and every heretic will be in the Fire. And nothing can be achieved from the good with Allah<sup>azwj</sup> except by being obedient to Him<sup>azwj</sup>, and the patience and being agreeable, because the patience and being agreeable is from the obedience to Allah<sup>azwj</sup>.\nAnd know, that a servant from the servants has not believed until he is happy with Allah<sup>azwj</sup> with regards to whatever Allah<sup>azwj</sup> has Done for him, and what he has done for Him<sup>azwj</sup> in accordance with what He<sup>azwj</sup> Likes and Dislikes. And Allah<sup>azwj</sup> does not Do with the one who is patient and happy with Allah<sup>azwj</sup> except that which he is deserving of, and that which is better for him, from what he likes or dislikes.\nAnd it is for you to <span class=\"ibTxt\">“[2:238] Attend constantly to prayers and to the middle prayer and stand up truly obedient to Allah”, </span>just as Allah<sup>azwj</sup> has Commanded the Believers in His<sup>azwj</sup> Book which is in front of you. \nAnd beware, and it is for you to love the poor Muslims, for the one who considers them to be lowly due to his own arrogance, so he has slipped from the Religion of Allah<sup>azwj</sup>, and Allah<sup>azwj</sup> has for him (a situation of) lowliness and hate. And the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> has said: ‘My<sup>saww</sup> Lord<sup>azwj</sup> has Commanded me<sup>saww</sup> to love the poor among the Muslims’. And know, that the one who belittles anyone from the Muslims will meet Allah<sup>azwj</sup> having Hatred towards him and lowliness from Him<sup>azwj</sup> to the extent that the people will hate him and Allah<sup>azwj</sup> will have intense Hatred towards him. \nFear Allah<sup>azwj</sup> with regards to your brothers who are poor Muslims, for they have a right over you that you should love them. Allah<sup>azwj</sup> Commanded His<sup>azwj</sup> Messenger<sup>saww</sup> to love them, so the one who does not love the one whom Allah<sup>azwj</sup> has Commanded to love, so he has disobeyed Allah<sup>azwj</sup> and His<sup>azwj</sup> Messenger<sup>saww</sup>, and the one who disobeys Allah<sup>azwj</sup> and His<sup>azwj</sup> Messenger<sup>saww</sup> and dies upon that, would have died whilst being from the misguided ones. \nAnd beware of (considering for yourself) greatness and arrogance, for the Arrogance is the Robe of Allah<sup>azwj</sup> Mighty and Majestic, so the one who disputed with Allah<sup>azwj</sup> for His<sup>azwj</sup> Robe, Allah<sup>azwj</sup> will Reduce him and Disgrace him on the Day of Judgement.\nAnd beware of injustices of some of you against the others, for it is not from the characteristics of the righteous. The one who is unjust, Allah<sup>azwj</sup> will Turn his injustice against his own self, and Make His<sup>azwj</sup> Help to be for the one who he was unjust to, and the one whom Allah<sup>azwj</sup> Helps will overcome and be of the group of winners from Allah<sup>azwj</sup>. \nAnd beware of the envying of some of you against the others, for the disbelief is the origin of the envy. \nAnd beware of helping against an oppressed Muslim, for he would supplicate to Allah<sup>azwj</sup> against you and He<sup>azwj</sup> would Answer him regarding you. Our<sup>asws</sup> forefather<sup>saww</sup> the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> used to say that: ‘The supplication of an oppressed Muslims gets Answered’.  And help each other, for our<sup>asws</sup> forefather<sup>saww</sup>, the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> used to say that: ‘Helping a Muslim is better and greater in Reward than the Fasting for a month, and seclusion (Al-I’tikaaf) in the Masjid Al-Haraam (The Sacred Masjid).\nAnd beware of creating difficulties for anyone from your Muslim brothers if he owes you anything from before and he is insolvent, for our<sup>asws</sup> forefather the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> used to say: ‘It is not for a Muslim to make difficulties for a Muslim, and the one who is considerate to the insolvent will be Shaded by Allah<sup>azwj</sup> by a shade on the Day in which there will no shade except for His<sup>azwj</sup> Shade’.\nAnd beware, O group under the Mercy and preferred ones over the others, of withholding the Rights of Allah<sup>azwj</sup> before you, day after day and hour after hour, for the one who makes haste in (giving) the Rights of Allah<sup>azwj</sup> which are in front of him, then Allah<sup>azwj</sup> has the Power over the Hastening to him for the multiplication of the good, either immediately or later on.  And the one who delays the Rights of Allah<sup>azwj</sup>, then Allah<sup>azwj</sup> has the Power over Delaying his sustenance, and the one from whom Allah<sup>azwj</sup> Withholds his sustenance, he would not have the ability to sustain himself. So give to Allah<sup>azwj</sup> the Right from what He<sup>azwj</sup> has Granted you so that He<sup>azwj</sup> would Purify for you the remainder of it, and Complete for you from the Multiplication for you, the excessive Multiplication, the count of which is not known to any but Him<sup>azwj</sup>, or its virtues, the Lord<sup>azwj</sup> of the Worlds’. \nAnd he<sup>asws</sup> said: ‘Fear Allah<sup>azwj</sup>, O group, if you could, and dont be an embarrassment for the Imam<sup>asws</sup>, for the one who causes embarrassment for the Imam<sup>asws</sup>, he is the one who discredits the righteous people, the ones who follow the Imam<sup>asws</sup> of the Muslims for his<sup>asws</sup> virtues, the patient ones upon the payment of his<sup>asws</sup> rights, the ones who understand his<sup>asws</sup> sanctity.\nAnd know, that the one who descends to that level with (respect) the Imam<sup>asws</sup>, so he has embarrassed the Imam<sup>asws</sup> (by associating himself with him<sup>asws</sup>) He would do that by cursing the righteous people the ones who (strictly) follow him<sup>asws</sup> from the Muslims for their virtues, the patient ones upon the paying of his<sup>asws</sup> rights, the ones who have recognised his<sup>asws</sup> sanctity, so his curse against (the pious ones) is for the enemies of Allah<sup>azwj</sup>, as the Imam<sup>asws</sup> converts that curse into Mercy from Allah<sup>azwj</sup> upon them (the pious ones), and turns the Curse from Allah<sup>azwj</sup> and from the Angels, and from His<sup>azwj</sup> Messenger<sup>saww</sup> upon them (the deniers). And know, O group, that the Sunnah from Allah<sup>azwj</sup> has flowed within the righteous ones before’.\nAnd he<sup style=\"font-weight: normal\">asws</sup> said: ‘The one who wishes to meet Allah<sup style=\"font-weight: normal\">azwj</sup> as a Believer, ‘Haqqan’ Haqqan’ (surely and truly), so he should befriend Allah<sup style=\"font-weight: normal\">azwj</sup>, and His<sup style=\"font-weight: normal\">azwj</sup> Messenger, and those who believed<sup style=\"font-weight: normal\">asws</sup>, and should distance himself from their<sup style=\"font-weight: normal\">asws</sup> enemies, and accept whatever that has ended up with him from their<sup style=\"font-weight: normal\">asws</sup> virtues, because their<sup style=\"font-weight: normal\">asws</sup> virtues cannot be comprehended by the ‘مَلَكٌ مُقَرَّبٌ’ Angels of Proximity, or ‘نَبِيٌّ مُرْسَلٌ’<a id=\"_ftnref3\"></a><sup>[3]</sup> the Messenger Prophets<sup style=\"font-weight: normal\">as</sup>, but some among them. Have you not heard what Allah<sup style=\"font-weight: normal\">azwj</sup> has Mentioned from the virtues of following the Imams<sup style=\"font-weight: normal\">asws</sup> of Guidance, and they are the Believers? He<sup style=\"font-weight: normal\">azwj</sup> Said: <span class=\"ibTxt\">“[4:69] And whoever obeys Allah and the Messenger, these are with those upon whom Allah has bestowed favors from among the prophets and the truthful and the martyrs and the good, and a goodly company are they!”</span>\nThis is just one perspective from the perspectives of the virtues of following the Imams<sup>asws</sup>, so how can others (comprehend) them<sup>asws</sup> and their<sup>asws</sup> virtues? And the one who wishes that Allah<sup>azwj</sup> should Complete for him his faith and he becomes a devout and true Believer, he should fulfill to Allah<sup>azwj</sup> His<sup>azwj</sup> Conditions which He<sup>azwj</sup> has Placed upon the Believers. He<sup>azwj</sup> has Placed the conditions of His<sup>azwj</sup> Wilayah along with the Wilayah of His<sup>azwj</sup> Messenger<sup>saww</sup>, and the Wilayah of the Imams<sup>asws</sup> of the Believers. He should establish the Prayer, and give the Zakaat, and give to Allah<sup>azwj</sup> goodly loans (Karza e Hasana), and avoid the immoralities, both openly as well as discreetly.  \nThere does not remain anything from the detail of what Allah<sup>azwj</sup> has Prohibited, except that it is included in its entirety in His<sup>azwj</sup> Statement. So the one who makes it to be his Religion in what is between himself and Allah<sup>azwj</sup>, being sincere to Allah<sup>azwj</sup>, and does not authorise for himself to ignore anything from this, so he is, in the Sight of Allah<sup>azwj</sup>, in His<sup>azwj</sup> Triumphant Party, and he is from the true Believers. \nAnd beware of insisting upon something from what Allah<sup style=\"font-weight: normal\">azwj</sup> has Prohibited in the Apparent of the Quran and its Hidden. And Allah<sup style=\"font-weight: normal\">azwj</sup> the High has Said: <span class=\"ibTxt\">“[3:135] and (who) do not knowingly persist in what they have done”</span> (Up to this point it is the narration of Al-Qasim Bin Rabi’e). It means that the Believers before them, when they forgot something from what Conditions Allah<sup style=\"font-weight: normal\">azwj</sup> had Placed upon them in His<sup style=\"font-weight: normal\">azwj</sup> Book, would come to the realisation that they had disobeyed Allah<sup style=\"font-weight: normal\">azwj</sup> in their avoidance of that thing. So they would seek Forgiveness and would not repeat it. So that is the meaning of the Statement of Allah<sup style=\"font-weight: normal\">azwj</sup>: <span class=\"ibTxt\">“[3:135] and (who) do not knowingly persist in what they have done”.</span>\nAnd know that He<sup>azwj</sup> has Commanded and Prohibited, so that there should be obedience in what He<sup>azwj</sup> has Commanded for, and avoidance in what He<sup>azwj</sup> has Prohibited from. So the one who has followed His<sup>azwj</sup> Commands has obeyed Him<sup>azwj</sup>, and has realised everything from the good, which is with Him<sup>azwj</sup>, and the one who did not avoid what Allah<sup>azwj</sup> has Prohibited from, so he has disobeyed Him<sup>azwj</sup>. So if he were to die upon being disobedient to Him<sup>azwj</sup>, Allah<sup>azwj</sup> will Fling him upon his face in the Fire. \nAnd know, that there is nothing else between Allah<sup>azwj</sup> and anyone from His<sup>azwj</sup> creatures, Angels of Proximity, or Messenger Prophets<sup>as</sup>, or all others apart from that, except for their obedience to Him<sup>az</sup><sup>wj</sup>. So strive in being obedient to Allah<sup>azwj</sup>, if you wish to become true Believers, truly, and there is not Strength except by Allah<sup>azwj</sup>’. \nAnd he<sup>asws</sup> said: ‘And it is for you to obey your Lord<sup>azwj</sup> in accordance with your abilities, for Allah<sup>azwj</sup> is your Lord<sup>azwj</sup>. And know that the Islam is the submission, and the submission is the Islam. So the one who submits, so he has Islam, and the one who does not submit, there is no Islam to him. And the one wishes to do himself a favour, so he should obey Allah<sup>azwj</sup>, for the one who has obeyed Allah<sup>azwj</sup> has indeed done himself a favour. \nAnd beware of being disobedient to Allah<sup>azwj</sup> if you were to do it. The one who violated by being disobedient to Allah<sup>azwj</sup>, so he has disfavoured himself, and there is no station between favour and disfavour. For the ones who have done a favour in the Sight of their Lord<sup>azwj</sup>, is Paradise, and for the ones who have violated in the Sight of their Lord<sup>azwj</sup>, is the Fire. So, know that you have to be obedient to Allah<sup>azwj</sup> and avoid being disobedient to Him<sup>azwj</sup>. And know, that there is none who is needless of Allah<sup>azwj</sup> from His<sup>azwj</sup> creatures, neither the Angels of Proximity, nor the Messenger Prophets<sup>as</sup>, nor anyone other than that. So the one who wishes that he should benefit from the intercession of the intercessors in the Presence of Allah<sup>azwj</sup>, so he should seek to Please Allah<sup>azwj</sup>. \nAnd know that no one from the creatures of Allah<sup>azwj</sup> can achieve the Pleasure of Allah<sup>azwj</sup> except by being obedient to Him<sup>azwj</sup>, and being obedient to His<sup>azwj</sup> Messenger<sup>saww</sup>, and being obedient to the Masters of the Command<sup>asws</sup> (Wali Al-Amr<sup>asws</sup>) from the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and that the disobedience to them<sup>asws</sup> is disobedient to Allah<sup>azwj</sup>. And do not deny their<sup>asws</sup> virtues, be they great or small. And know, that the deniers are the liars, they are the hypocrites, and that Allah<sup>azwj</sup> Mighty and Majestic Said for the hypocrites, and His<sup>azwj</sup> Words are true, that: <span class=\"ibTxt\">“[4:145] Surely the hypocrites are in the lowest stage of the fire and you shall not find a helper for them”</span>.\nAnd let no one from among you, whom Allah<sup>azwj</sup> has Necessitated upon his heart, obedience to Him<sup>azwj</sup> and being humble to Him<sup>azwj</sup>, should fear any one from the people from whom Allah<sup>azwj</sup> has Removed the qualities of the truth and did not Make him to be deserving of it. So the one whom Allah<sup>azwj</sup> has not Made to be deserving of the qualities of the truth, so these are the hypocrites, these are the Satans<sup>la</sup> among the Humans and the Jinn. And it is the Satans<sup>la</sup> among the Humans that trick, and plot, and deceive, and whisper (cast doubts) from some of them to the others, attempting to divert the people of the truth, whom Allah<sup>azwj</sup> has Honoured by Granting them the insight into the Religion of Allah<sup>azwj</sup>, and insight which Allah<sup>azwj</sup> has not Considered the Satans<sup>la</sup> among the Humans to be deserving of it, Intending thereby not to equalise the enemies of Allah<sup>azwj</sup> to the people of the truth, with regards to the doubt, and the denial, and the belying to end up being equal as Allah<sup>azwj</sup> the High has Described in His<sup>azwj</sup> Book: <span class=\"ibTxt\">“[4:89] They desire that you should disbelieve as they have disbelieved, so that you might be (all) alike”</span>. Then Allah<sup>azwj</sup> prohibited the people of the truth that they should take the enemies of Allah<sup>azwj</sup> as guardians or as helpers. \nSo do not let them scare you, and do not let them repulse you all from the consideration by the truth which Allah<sup>azwj</sup> has Specialised you with from the tricks of the Satans<sup>la</sup> from the Humans, and their plots in your affairs. You should repel the bad by that which is good in what is between you and them, seeking by that the Pleasure of your Lord<sup>azwj</sup> by being obedient to Him<sup>azwj</sup>. And they are such that there is no good with them. \nIt is not permissible for you to display to them the Principles of the Religion of Allah<sup>azwj</sup> (Usool Al-Deen<a id=\"_ftnref4\"></a><sup>[4]</sup>) for they are such that they would hear something from you, be inimical against you, and raise (the issue) against you, and strive for destroying you, and place in front of you that which you dislike.\nAnd there is no remedy for you from them in the government of the corrupts. So understand your status in what is between you and the people of the falsehood, for it does not befit the people of the truth to descend to the level of the people of the falsehood. (This is due to the fact) that Allah<sup>azwj</sup> did not Make for the people of the falsehood who does not understand His<sup>azwj</sup> Perspective, the status which is with Him<sup>azwj</sup> for the people of the truth. \nThe Statement of Allah<sup>azwj</sup> in His<sup>azwj</sup> Book where He<sup>azwj</sup> Said: <span class=\"ibTxt\">“[38:28] Shall We treat those who believe and work deeds of righteousness, the same as those who do mischief on earth? Shall We treat those who guard against evil, the same as those who turn aside from the right?”</span> He<sup>azwj</sup> has Honoured yourselves rather than the people of the falsehood. And do not make Allah<sup>azwj</sup> Blessed and High, and for Him<sup>azwj</sup> is the Highest Example, and your Imams<sup>asws</sup>, and the Religion which you have made it to be for yourselves, to be exposed (vulnerable) to the people of the falsehood. Allah<sup>azwj</sup> would be Angered against you, so you will perish. So, do not do it, do not do it (strictly observe Taqeeya). \nO righteous people! Do not abandon the Commands of Allah<sup>azwj</sup>, and the Command from your affairs for the obedience to Him<sup>azwj</sup>, lest Allah<sup>azwj</sup> Alters the Blessings for you. Love for the sake of Allah<sup>azwj</sup> (the ones of similar qualities to yourselves), and hate for the Sake of Allah<sup>azwj</sup> the ones who oppose you. And extend your cordiality and your advice to the ones who possess your qualities, and do not extend it to the ones who have abandoned your qualities, and are inimical towards you, and rebel against you, and wish for calamities to befall upon you. This is our<sup>asws</sup> education which Allah<sup>azwj</sup> Has Educated us<sup>asws</sup> with. So take to it, and understand it and fetter it (to yourselves), and do not throw it behind your backs, whatever is compatible with your guidance and take to it, and whatever is along the lines of your own desires, discard it and do not follow it. \nAnd beware of the arrogance against Allah<sup>azwj</sup>, and know that a servant is not afflicted by the arrogance against Allah<sup>azwj</sup> except that he is arrogant against the Religion of Allah<sup>azwj</sup>. Be upright for the Sake of Allah<sup>azwj</sup> and do not turn back upon your heels, for your will have turn back as losers. May Allah<sup>azwj</sup> Protect us. And beware from the arrogance against Allah<sup>azwj</sup>, and there is not strength for us<sup>asws</sup> or for you except by Allah<sup>azwj</sup>’.\nAnd he<sup>asws</sup> said: ‘If Allah<sup>azwj</sup> had Created a servant originally, in the original creation as a Believer, he will never die until Allah<sup>azwj</sup> Makes him to detest the evil and he distances himself from it, and the one whom Allah<sup>azwj</sup> has Made to detest the evil and he distances himself from it, Allah<sup>azwj</sup> will Cure him from the arrogance and the forcefulness which has entered into him. So his nature becomes soft, and his morals beautiful, and his face bright, and the reverence of Islam comes to him, and tranquility, and the humbleness, and he restrains himself from the Prohibitions of Allah<sup>azwj</sup> and avoids His<sup>azwj</sup> Harshness. And Allah<sup>azwj</sup> Grants to him the sustenance of the cordiality of the people, and intermingling with them, and avoidance of the cutting off from the people, and the rivalries, and does not get involved with anything from it or the likes of it in anything. \nHowever, if Allah<sup>azwj</sup> had Created a servant originally, in the original creation as an infidel, he will never die until he loves the evil and goes near to it. So if the evil becomes beloved to him and he goes near to it, he gets involved in the infidelity, and the forcefulness. So his heart hardens, and his morals deteriorate, and his face darkens, his immorality gets displayed, and his shame becomes little, and Allah<sup>azwj</sup> Uncovers his veil, and he rides upon the Prohibitions. So he never ceases from these tendencies and rides upon the disobedience to Allah<sup>azwj</sup>, and hates to obey Him<sup>azwj</sup>, and the obedient ones. So the condition of the Believers and the condition of the infidel are in contradiction. Ask Allah<sup>azwj</sup> for health, and seek it from Him<sup>azwj</sup>, and there is not Might nor Strength except by Allah<sup>azwj</sup>. \nObserve patience upon the afflictions in the world if you are followed by the afflictions, and intensify the obedience to Allah<sup>azwj</sup>, and His<sup>azwj</sup> Wilayah, and the Wilayah of the ones<sup>asws</sup> He<sup>azwj</sup> has Commanded for, it is the better result with Allah<sup>azwj</sup> in the Hereafter, than the kingdom of the world, even though its bounties, and its flowers, and its affluence may be prolonged in the disobedience to Allah<sup>azwj</sup>, and in the Wilayah of the one<sup>asws</sup> whom Allah<sup>azwj</sup> has Forbidden from being in his Wilayah, and in his obedience. \nAllah<sup>azwj</sup> has Commanded for the Wilayah of the Imams<sup>asws</sup> whom Allah<sup>azwj</sup> has Names in His<sup>azwj</sup> Book in His<sup>azwj</sup> Statement: <span class=\"ibTxt\">“[21:73] And We made them Imams who guided (people) by Our command”</span> and they<sup>asws</sup> are the ones<sup>asws</sup> for whom<sup>asws</sup> Allah<sup>azwj</sup> has Commanded the Wilayah for, and to be in their<sup>asws</sup> obedience. And the ones whom Allah<sup>azwj</sup> has Forbidden to be in their wilayah, these are the imams of misguidance, for whom Allah<sup>azwj</sup> has Decreed for them the governance in the world over the friends of Allah<sup>azwj</sup> and the Imams<sup>asws</sup> from the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>. \nThey act in disobedience to Allah<sup>azwj</sup> in their governments, and in disobedience to His<sup>azwj</sup> Messenger<sup>saww</sup> so that the Words of the Punishment become reality against them, and that you can end up being with the Prophet<sup>saww</sup> of Allah<sup>azwj</sup> Muhammad<sup>saww</sup> and the Messengers<sup>as</sup> before him<sup>saww</sup>. \nSo ponder over what stories Allah<sup>azwj</sup> has Related to you in His<sup>azwj</sup> Book of the trials which the His<sup>azwj</sup> Prophets<sup>as</sup> were Tested by, and the Believers followed them<sup>sa</sup>. Then ask Allah<sup>azwj</sup> to Grant you patience upon the affliction in the thick and thin, and the difficulties, and the prosperity, similar to which was Given to them.  \nAnd beware of debating with the people of the falsehood. And it is for you to follow the guidance of the righteous ones, and their dignified (manners), and their tranquility, and their forbearance, and their humbleness, and their distancing themselves from the Prohibitions of Allah<sup>azwj</sup>, and their truthfulness, and their loyalty, and their struggle for the Sake of Allah<sup>azwj</sup> in the deeds by being obedient to Him<sup>azwj</sup>. So if you were not to do that, then you will never rise to the status of the righteous ones from before you have with your Lord<sup>azwj</sup>. \nAnd know that if Allah<sup>azwj</sup> Intends good for a servant, He<sup>azwj</sup> opens his chest for the Islam. So He<sup>azwj</sup> Grants him that he will speak the truth by his tongue, and bind his heart to him so that he will act in accordance with it. So if Allah<sup>azwj</sup> Gathers that to him, He<sup>azwj</sup> Completes for him, his Islam, and if he were to die whilst being upon that, he would have died as being one of the true Muslims.\nAnd if Allah<sup>azwj</sup> does not Intend good for a servant, He<sup>azwj</sup> Leaves him to his own self, and his chest becomes constricted and an embarrassment for him. If a true (word) flows from his tongue, his heart does not accept it from him, and if his heart does not accept it from him, he does not follow Allah<sup>azwj</sup> and acts in accordance with it. So if that is gathered to him until he dies whilst being upon that condition, he, then, will be of the hypocrites with Allah<sup>azwj</sup>. And all that flowed upon his tongues from the truth which he did not follow Allah<sup>azwj</sup> and his heart did not accept it from him, and he did not act in accordance with it, would be a proof against him on the Day of Judgement. \nSo fear Allah<sup>azwj</sup> and ask Him<sup>azwj</sup> that He<sup>azwj</sup> should Open your chests for the Islam, and that He<sup>azwj</sup> should Make your tongues to speak with the truth until you die whilst being upon that, and that He<sup>azw</sup><sup>j</sup> should Make your return (to the Hereafter to be like the) returning of the righteous ones before you. And there is not Strength except by Allah<sup>azwj</sup>, and Praise is due to Allah<sup>azwj</sup> the Lord<sup>azwj</sup> of the worlds. \nAnd the one who wishes that he should know whether Allah<sup style=\"font-weight: normal\">azwj</sup> Loves him, so he should act in obedience to Allah<sup style=\"font-weight: normal\">azwj</sup> and follow us<sup style=\"font-weight: normal\">asws</sup>. Have you not heard the Words of Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic to His<sup style=\"font-weight: normal\">azwj</sup> Prophet<sup style=\"font-weight: normal\">saww</sup>: <span class=\"ibTxt\">“[3:31] Say: If you love Allah, then follow me, Allah will love you and forgive you your faults, and Allah is Forgiving, Merciful”</span>\nBy Allah<sup>azwj</sup>, no servant will be in obedience to Allah<sup>azwj</sup> ever until Allah<sup>azwj</sup> Makes him to be included along with obedience to Him<sup>azwj</sup>, obedience to us<sup>asws</sup>. And, by Allah<sup>azwj</sup>, no servant will be following us<sup>asws</sup> ever until Allah<sup>azwj</sup> Loves him. And, by Allah<sup>azwj</sup>, no servant leaves following us<sup>asws</sup> ever except that he hates us<sup>asws</sup>. And, by Allah<sup>azwj</sup>, no one ever hates us<sup>asws</sup> except that he disobeys Allah<sup>azwj</sup>. And the one who dies whilst being in disobedience to Allah<sup>azwj</sup>, Allah<sup>azwj</sup> will Disgrace him and Fling him upon his face in the Fire. And Praise is due to Allah<sup>azwj</sup>, the Lord<sup>azwj</sup> of the worlds’. \nout of 567"}]}]}, "index": "al-kafi:8:1:1", "kind": "verse_list"}