{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 10"
        },
        "path": "/books/al-kafi:8:1:10",
        "titles": {
          "ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )",
          "en": "A SERMON OF AMIR-UL-MOMINEEN<sup>asws</sup>"
        }
      }
    ],
    "index": 2281,
    "local_index": 10,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 11"
        },
        "path": "/books/al-kafi:8:1:11",
        "titles": {
          "ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )",
          "en": "SERMON OF AMIR-UL-MOMINEEN<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 9"
        },
        "path": "/books/al-kafi:8:1:9",
        "titles": {
          "ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )",
          "en": "SERMON OF AMIR-UL-MOMINEEN<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:10",
    "titles": {
      "ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )",
      "en": "A SERMON OF AMIR-UL-MOMINEEN<sup>asws</sup>"
    },
    "verse_count": 1,
    "verse_start_index": 14705,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 138)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14706,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:10:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14470</span>- أَحْمَدُ بْنُ مُحَمَّدٍ</span> الْكُوفِيُّ عَنْ جَعْفَرِ بْنِ عَبْدِ اللَّهِ الْمُحَمَّدِيِّ عَنْ أَبِي رَوْحٍ فَرَجِ بْنِ قُرَّةَ عَنْ جَعْفَرِ بْنِ عَبْدِ اللَّهِ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ خَطَبَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) بِالْمَدِينَةِ فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ وَ صَلَّى عَلَى النَّبِيِّ وَ آلِهِ ثُمَّ قَالَ أَمَّا بَعْدُ فَإِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى لَمْ يَقْصِمْ جَبَّارِي دَهْرٍ إِلَّا مِنْ بَعْدِ تَمْهِيلٍ وَ رَخَاءٍ وَ لَمْ يَجْبُرْ كَسْرَ عَظْمٍ مِنَ الْأُمَمِ إِلَّا بَعْدَ أَزْلٍ وَ بَلَاءٍ ",
          "أَيُّهَا النَّاسُ فِي دُونِ مَا اسْتَقْبَلْتُمْ مِنْ عَطَبٍ وَ اسْتَدْبَرْتُمْ مِنْ خَطْبٍ مُعْتَبَرٌ وَ مَا كُلُّ ذِي قَلْبٍ بِلَبِيبٍ وَ لَا كُلُّ ذِي سَمْعٍ بِسَمِيعٍ وَ لَا كُلُّ ذِي نَاظِرِ عَيْنٍ بِبَصِيرٍ ",
          "عِبَادَ اللَّهِ أَحْسِنُوا فِيمَا يَعْنِيكُمُ النَّظَرُ فِيهِ ثُمَّ انْظُرُوا إِلَى عَرَصَاتِ مَنْ قَدْ أَقَادَهُ اللَّهُ بِعِلْمِهِ كَانُوا عَلَى سُنَّةٍ مِنْ آلِ فِرْعَوْنَ أَهْلَ جَنَّاتٍ وَ عُيُونٍ وَ زُرُوعٍ وَ مَقَامٍ كَرِيمٍ ثُمَّ انْظُرُوا بِمَا خَتَمَ اللَّهُ لَهُمْ بَعْدَ النَّضْرَةِ وَ السُّرُورِ وَ الْأَمْرِ وَ النَّهْيِ وَ لِمَنْ صَبَرَ مِنْكُمُ الْعَاقِبَةُ فِي الْجِنَانِ وَ اللَّهِ مُخَلَّدُونَ وَ لِلَّهِ عَاقِبَةُ الْأُمُورِ",
          "فَيَا عَجَباً وَ مَا لِي لَا أَعْجَبُ مِنْ خَطَإِ هَذِهِ الْفِرَقِ عَلَى اخْتِلَافِ حُجَجِهَا فِي دِينِهَا لَا يَقْتَصُّونَ أَثَرَ نَبِيٍّ وَ لَا يَقْتَدُونَ بِعَمَلِ وَصِيٍّ وَ لَا يُؤْمِنُونَ بِغَيْبٍ وَ لَا يَعْفُونَ عَنْ عَيْبٍ الْمَعْرُوفُ فِيهِمْ مَا عَرَفُوا وَ الْمُنْكَرُ عِنْدَهُمْ مَا أَنْكَرُوا وَ كُلُّ امْرِئٍ مِنْهُمْ إِمَامُ نَفْسِهِ آخِذٌ مِنْهَا فِيمَا يَرَى بِعُرًى وَثِيقَاتٍ وَ أَسْبَابٍ مُحْكَمَاتٍ فَلَا يَزَالُونَ بِجَوْرٍ وَ لَنْ يَزْدَادُوا إِلَّا خَطَأً لَا يَنَالُونَ تَقَرُّباً وَ لَنْ يَزْدَادُوا إِلَّا بُعْداً مِنَ اللَّهِ عَزَّ وَ جَلَّ أُنْسُ بَعْضِهِمْ بِبَعْضٍ وَ تَصْدِيقُ بَعْضِهِمْ لِبَعْضٍ ",
          "كُلُّ ذَلِكَ وَحْشَةً مِمَّا وَرَّثَ النَّبِيُّ الْأُمِّيُّ ( صلى الله عليه وآله ) وَ نُفُوراً مِمَّا أَدَّى إِلَيْهِمْ مِنْ أَخْبَارِ فَاطِرِ السَّمَاوَاتِ وَ الْأَرْضِ أَهْلُ حَسَرَاتٍ وَ كُهُوفُ شُبُهَاتٍ وَ أَهْلُ عَشَوَاتٍ وَ ضَلَالَةٍ وَ رِيبَةٍ مَنْ وَكَلَهُ اللَّهُ إِلَى نَفْسِهِ وَ رَأْيِهِ فَهُوَ مَأْمُونٌ عِنْدَ مَنْ يَجْهَلُهُ غَيْرُ الْمُتَّهَمِ عِنْدَ مَنْ لَا يَعْرِفُهُ ",
          "فَمَا أَشْبَهَ هَؤُلَاءِ بِأَنْعَامٍ قَدْ غَابَ عَنْهَا رِعَاؤُهَا وَ وَا أَسَفَى مِنْ فَعَلَاتِ شِيعَتِي مِنْ بَعْدِ قُرْبِ مَوَدَّتِهَا الْيَوْمَ كَيْفَ يَسْتَذِلُّ بَعْدِي بَعْضُهَا بَعْضاً وَ كَيْفَ يَقْتُلُ بَعْضُهَا بَعْضاً الْمُتَشَتِّتَةِ غَداً عَنِ الْأَصْلِ النَّازِلَةِ بِالْفَرْعِ الْمُؤَمِّلَةِ الْفَتْحَ مِنْ غَيْرِ جِهَتِهِ كُلُّ حِزْبٍ مِنْهُمْ آخِذٌ مِنْهُ بِغُصْنٍ أَيْنَمَا مَالَ الْغُصْنُ مَالَ مَعَهُ مَعَ ",
          "أَنَّ اللَّهَ وَ لَهُ الْحَمْدُ سَيَجْمَعُ هَؤُلَاءِ لِشَرِّ يَوْمٍ لِبَنِي أُمَيَّةَ كَمَا يَجْمَعُ قَزَعَ الْخَرِيفِ يُؤَلِّفُ اللَّهُ بَيْنَهُمْ ثُمَّ يَثْبُتْ عَلَيْهِ أَكَمَةٌ وَ لَمْ يَرُدَّ سَنَنَهُ رَصُّ طَوْدٍ يُذَعْذِعُهُمُ اللَّهُ فِي بُطُونِ أَوْدِيَةٍ ثُمَّ يَسْلُكُهُمْ يَنَابِيعَ فِي الْأَرْضِ يَأْخُذُ بِهِمْ مِنْ قَوْمٍ حُقُوقَ قَوْمٍ وَ يُمَكِّنُ بِهِمْ قَوْماً فِي دِيَارِ قَوْمٍ تَشْرِيداً لِبَنِي أُمَيَّةَ وَ لِكَيْلَا يَغْتَصِبُوا مَا غَصَبُوا يُضَعْضِعُ اللَّهُ بِهِمْ رُكْناً وَ يَنْقُضُ بِهِمْ طَيَّ الْجَنَادِلِ مِنْ إِرَمَ وَ يَمْلَأُ مِنْهُمْ بُطْنَانَ الزَّيْتُونِ ",
          "فَوَ الَّذِي فَلَقَ الْحَبَّةَ وَ بَرَأَ النَّسَمَةَ لَيَكُونَنَّ ذَلِكَ وَ كَأَنِّي أَسْمَعُ صَهِيلَ خَيْلِهِمْ وَ طَمْطَمَةَ رِجَالِهِمْ وَ ايْمُ اللَّهِ لَيَذُوبَنَّ مَا فِي أَيْدِيهِمْ بَعْدَ الْعُلُوِّ وَ التَّمْكِينِ فِي الْبِلَادِ كَمَا تَذُوبُ الْأَلْيَةُ عَلَى النَّارِ مَنْ مَاتَ مِنْهُمْ مَاتَ ضَالًّا وَ إِلَى اللَّهِ عَزَّ وَ جَلَّ يُفْضِي مِنْهُمْ مَنْ دَرَجَ وَ يَتُوبُ اللَّهُ عَزَّ وَ جَلَّ عَلَى مَنْ تَابَ وَ لَعَلَّ اللَّهَ يَجْمَعُ شِيعَتِي بَعْدَ التَّشَتُّتِ لِشَرِّ يَوْمٍ لِهَؤُلَاءِ وَ لَيْسَ لِأَحَدٍ عَلَى اللَّهِ عَزَّ ذِكْرُهُ الْخِيَرَةُ بَلْ لِلَّهِ الْخِيَرَةُ وَ الْأَمْرُ جَمِيعاً",
          "أَيُّهَا النَّاسُ إِنَّ الْمُنْتَحِلِينَ لِلْإِمَامَةِ مِنْ غَيْرِ أَهْلِهَا كَثِيرٌ وَ لَوْ لَمْ تَتَخَاذَلُوا عَنْ مُرِّ الْحَقِّ وَ لَمْ تَهِنُوا عَنْ تَوْهِينِ الْبَاطِلِ لَمْ يَتَشَجَّعْ عَلَيْكُمْ مَنْ لَيْسَ مِثْلَكُمْ وَ لَمْ يَقْوَ مَنْ قَوِيَ عَلَيْكُمْ وَ عَلَى هَضْمِ الطَّاعَةِ وَ إِزْوَائِهَا عَنْ أَهْلِهَا لَكِنْ تِهْتُمْ كَمَا تَاهَتْ بَنُو إِسْرَائِيلَ عَلَى عَهْدِ مُوسَى بْنِ عِمْرَانَ ( عليه السلام ) ",
          "وَ لَعَمْرِي لَيُضَاعَفَنَّ عَلَيْكُمُ التَّيْهُ مِنْ بَعْدِي أَضْعَافَ مَا تَاهَتْ بَنُو إِسْرَائِيلَ وَ لَعَمْرِي أَنْ لَوْ قَدِ اسْتَكْمَلْتُمْ مِنْ بَعْدِي مُدَّةَ سُلْطَانِ بَنِي أُمَيَّةَ لَقَدِ اجْتَمَعْتُمْ عَلَى السُّلْطَانِ الدَّاعِي إِلَى الضَّلَالَةِ وَ أَحْيَيْتُمُ الْبَاطِلَ وَ خَلَّفْتُمُ الْحَقَّ وَرَاءَ ظُهُورِكُمْ وَ قَطَعْتُمُ الْأَدْنَى مِنْ أَهْلِ بَدْرٍ وَ وَصَلْتُمُ الْأَبْعَدَ مِنْ أَبْنَاءِ الْحَرْبِ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) ",
          "وَ لَعَمْرِي أَنْ لَوْ قَدْ ذَابَ مَا فِي أَيْدِيهِمْ لَدَنَا التَّمْحِيصُ لِلْجَزَاءِ وَ قَرُبَ الْوَعْدُ وَ انْقَضَتِ الْمُدَّةُ وَ بَدَا لَكُمُ النَّجْمُ ذُو الذَّنَبِ مِنْ قِبَلِ الْمَشْرِقِ وَ لَاحَ لَكُمُ الْقَمَرُ الْمُنِيرُ فَإِذَا كَانَ ذَلِكَ فَرَاجِعُوا التَّوْبَةَ وَ اعْلَمُوا أَنَّكُمْ إِنِ اتَّبَعْتُمْ طَالِعَ الْمَشْرِقِ سَلَكَ بِكُمْ مَنَاهِجَ الرَّسُولِ (صلى الله عليه وآله) ",
          "فَتَدَاوَيْتُمْ مِنَ الْعَمَى وَ الصَّمَمِ وَ الْبَكَمِ وَ كُفِيتُمْ مَئُونَةَ الطَّلَبِ وَ التَّعَسُّفِ وَ نَبَذْتُمُ الثِّقْلَ الْفَادِحَ عَنِ الْأَعْنَاقِ وَ لَا يُبَعِّدُ اللَّهُ إِلَّا مَنْ أَبَى وَ ظَلَمَ وَ اعْتَسَفَ وَ أَخَذَ مَا لَيْسَ لَهُ وَ سَيَعْلَمُ الَّذِينَ ظَلَمُوا أَيَّ مُنْقَلَبٍ يَنْقَلِبُونَ "
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473117\">H 14470</a> – Ahmad Bin Muhammad Al-Kufy, from Ja’far Bin Abdullah Al-Muhammady, from Abu Rawh Faraj Bin Qurrat, from Ja’far Bin Abdullah, from Mas’adat Bin Sadaqa who has narrated:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘Amir-ul-Momineen<sup>asws</sup> gave a sermon at Al-Medina. So he<sup>asws</sup> Praised Allah<sup>azwj</sup> and Extolled Him<sup>azwj</sup> and sent greetings of peace (Salam) upon the Prophet<sup>saww</sup>. Then he<sup>asws</sup> said: ‘Having said that, Allah<sup>azwj</sup> Blessed and High does not Break the backs of the tyrants except after giving them respite and (Giving them) Ease, and does not mend the broken bones of the nations except after Removing the affliction from them. ",
            "O you people! With every corruption that you come across, and setback endured from every mishap is a lesson for you, and not every heart is intelligence nor is every with an ear a listener, nor is every one with a looking eye has vision.",
            "Servants of Allah<sup>azwj</sup>! Do good deeds in what your eyes can see, then look at the Plains (Day of Judgement) to which Allah<sup>azwj</sup> will Drive those who in His<sup>azwj</sup> Knowledge were upon the Sunnah of the Children of the Pharaoh<sup>la</sup>, the ones who possessed the gardens, and fountains, and plantations, and spacious places. Then look at what was the end Allah<sup>azwj</sup> had for them after the pleasure and enjoyment, and what they used to order for and prevent from. And for the one who is patient from among you will end up in the Gardens (of the Paradise), and Allah<sup>azwj</sup> will Make them live for all eternity, and to Allah<sup>azwj</sup> is the end of all affairs.",
            "Oh how astonishing! And why should I<sup>asws</sup> not be astonished at the mistakes of these sects over the different arguments in their Religion whilst not maintaining the effects of the Prophet<sup>saww</sup> and not following the successors<sup>asws</sup> in their actions, and not believing in the unseen, and not excusing the faults. Goodness among them is what they understand it to be and the evil within them is what they dislike. And each one of them is an imam to himself, taking from it what he sees with a firm and strong grip and decisive reasons. So they do not cease in these inequities and it does not increase them in anything except for errors (sins), not achieving nearness (to Allah<sup>azwj</sup>) and it does not increase them in anything except for the distance from Allah<sup>azwj</sup> Mighty and Majestic. They are well pleased with each other and ratify each other (to be correct). ",
            "All that is the fear of the legacy of the ‘Ummy’<a id=\"_ftnref9\"></a><sup>[9]</sup> Prophet<sup>saww</sup> and their aversion from what came to them from the News of the Originator of the Heavens and the earth. Thus they are the people of regret, and the caves of suspicion, and the people of desires and misguidance and doubts, the ones whom Allah<sup>azwj</sup> has Left them to their own selves and their opinions. So he is a trustworthy one with those who is ignorant of him, not being accused by the one who does not know him. ",
            "So how similar they are with the animals from whom their shepherd is absent, and how regrettable are the deeds of my<sup>asws</sup> Shiites after the nearness of their cordiality today. How they will humiliate each other after me<sup>asws</sup>, and how they will kill each other and be all scattered tomorrow despite having originated from one branch, trying to find victory from a direction which is not for it. Each party from among them would grab hold of one branch from it. Whichever way the branch leans to, they will lean along with it. ",
            "Allah<sup>azwj</sup> for Whom<sup>azwj</sup> is the Praise, will gather those for the evil of the day of the Clan of Umayya just like He<sup>azwj</sup> Gathers the clouds in the autumn. Allah<sup>azwj</sup> will Bring them together, then He<sup>azwj</sup> will Make them as debris like the debris of the clouds. Then He<sup>azwj</sup> will Open for them the doors and they will spill out from their source like the torrent of the two gardens, the flood of Al-Aram, when He<sup>azwj</sup> sent to them a يَجْعَلُهُمْ رُكَاماً كَرُكَامِ السَّحَابِ ثُمَّ يَفْتَحُ لَهُمْ أَبْوَاباً يَسِيلُونَ مِنْ مُسْتَثَارِهِمْ كَسَيْلِ الْجَنَّتَيْنِ سَيْلَ الْعَرِمِ حَيْثُ بَعَثَ عَلَيْهِ قَارَةً فَلَمْ mouse and the hill could not withstand against it (the flood) and its rocks came tumbling down when Allah<sup>azwj</sup> Shook the womb of the valleys with a severe Shaking.",
            "Then He<sup>azwj</sup> Transformed them into fountains in the earth restoring thereby the rights of the people and Making them to dwell in the houses of the people being a displacement of the Clan of Umayya so that they would not usurp what they usurped. Allah<sup>azwj</sup> will Undermine them and displace them by the boulders of Al-Aram and fill the valley of the olives by them.",
            "By the One<sup>azwj</sup> Who Split the seed and Brings life from it, that is going to happen. It is as if I<sup>asws</sup> can hear the whinnying of their horses and the humming of their men. I<sup>asws</sup> swear by Allah<sup>azwj</sup>, that which is in their hands will melt, after the rise and domination in the country, like the melting of the fat over the fire. The one who dies among them would have died as a misguided one, and to Allah<sup>azwj</sup> Mighty and Majestic would lead the one among them and Allah<sup>azwj</sup> Mighty and Majestic would Accept the repentance of the one who repents. And it is to Allah<sup>azwj</sup> that my<sup>asws</sup> Shiites will gather after the fragmentation of the evil day of theirs, and there is no good for anyone to Allah<sup>azwj</sup> Mighty is His<sup>azwj</sup> Remembrance, but to Allah<sup>azwj</sup> is the good and all of the affairs.",
            "O you people! There are many who are falsifiers for the Imamate whilst not being deserving of it. And had you not procrastinated about the bitter truth, and had not weakened from the weakening of the falsehood, the ones who are not like you would have become daring against you, nor would he have become stronger the one who became stronger against you in digesting the obedience and the removal from it of its deserving ones<sup>asws</sup>. But you are all lost just as the Children of Israel were lost in the era of Musa ibn Imran<sup>as</sup>.",
            "By my<sup>asws</sup> life, your being lost will increase from after me<sup>asws</sup> more than Children of Israel being lost. And by my<sup>asws</sup> life, you will be completing, from after me<sup>asws</sup>, the allocated time of the Sultanate of the Clan of Umayya, having gathered to the Sultan who called to the misguidance, and you will be reviving the falsehood and will be placing the truth behind your backs, and will be cutting off the relations with the people of Badr and be very remote from the sons of those who fought for the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>.",
            "And by my<sup>asws</sup> life, that which in their hands will melt away upon the approach of the test for the Reward and the Promise, and the allocated times passes by. And the two-tailed star will make its appearance for you from the East, and the luminous moon will make its appearance for you. So if that were to happen, return to the repentance, and know that you all follow what you see from the East on the Path of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>. ",
            "So it will cure you from the blindness, and the deafness, and the dumbness, and suffice you for the justice and you would be able to discard the gross weight which is upon the necks. And Allah<sup>azwj</sup> is not remote except from the one who refuses, and is unjust and unfair, and take that which is not for him. <span class=\"ibTxt\">“[26:227] Those who do wrong will come to know by what a (great) reverse they will be overturned!” </span>"
          ],
          "en.sarwar": [
            "22. Ahmad Bin Muhammad Al-Kufy, from Ja’far Bin Abdullah Al-Muhammady, from Abu Rawh Faraj Bin Qurrat, from Ja’far Bin Abdullah, from Mas’adat Bin Sadaqa who has narrated: Abu Abdullah (a.s.) having said: ‘Amir-ul-Momineen (a.s.) gave a sermon at Al-Medina. So he (a.s.) Praised Allah (azwj) and Extolled Him (azwj) and sent greetings of peace (Salam) upon the Prophet (saww). Then he (a.s.) said: ‘Having said that, Allah (azwj) Blessed and High does not Break the backs of the tyrants except after giving them respite and (Giving them) Ease, and does not mend the broken bones of the nations except after Removing the affliction from them. O you people! With every corruption that you come across, and setback endured from every mishap is a lesson for you, and not every heart is intelligence nor is every with an ear a listener, nor is every one with a looking eye has vision. Servants of Allah (azwj)! Do good deeds in what your eyes can see, then look at the Plains (Day of Judgement) to which Allah (azwj) will Drive those who in His (azwj) Knowledge were upon the Sunnah of the Children of the Pharaoh (la), the ones who possessed the gardens, and fountains, and plantations, and spacious places. Then look at what was the end Allah (azwj) had for them after the pleasure and enjoyment, and what they used to order for and prevent from. And for the one who is patient from among you will end up in the Gardens (of the Paradise), and Allah (azwj) will Make them live for all eternity, and to Allah (azwj) is the end of all affairs. Oh how astonishing! And why should I (a.s.) not be astonished at the mistakes of these sects over the different arguments in their Religion whilst not maintaining the effects of the Prophet (saww) and not following the successors (a.s.) in their actions, and not believing in the unseen, and not excusing the faults. Goodness among them is what they understand it to be and the evil within them is what they dislike. And each one of them is an imam to himself, taking from it what he sees with a firm and strong grip and decisive reasons. So they do not cease in these inequities and it does not increase them in anything except for errors (sins), not achieving nearness (to Allah (azwj)) and it does not increase them in anything except for the distance from Allah (azwj) Mighty and Majestic. They are well pleased with each other and ratify each other (to be correct). All that is the fear of the legacy of the ‘Ummy’ Prophet (saww) and their aversion from what came to them from the News of the Originator of the Heavens and the earth. Thus they are the people of regret, and the caves of suspicion, and the people of desires and misguidance and doubts, the ones whom Allah (azwj) has Left them to their own selves and their opinions. So he is a trustworthy one with those who is ignorant of him, not being accused by the one who does not know him. So how similar they are with the animals from whom their shepherd is absent, and how regrettable are the deeds of my (a.s.) Shiites after the nearness of their cordiality today. How they will humiliate each other after me (a.s.), and how they will kill each other and be all scattered tomorrow despite having originated from one branch, trying to find victory from a direction which is not for it. Each party from among them would grab hold of one branch from it. Whichever way the branch leans to, they will lean along with it. Allah (azwj) for Whom (azwj) is the Praise, will gather those for the evil of the day of the Clan of Umayya just like He (azwj) Gathers the clouds in the autumn. Allah (azwj) will Bring them together, then He (azwj) will Make them as debris like the debris of the clouds. Then He (azwj) will Open for them the doors and they will spill out from their source like the torrent of the two gardens, the flood of Al-Aram, when He (azwj) sent to them a يَجْعَلُهُمْ رُكَاماً كَرُكَامِ السَّحَابِ ثُمَّ يَفْتَحُ لَهُمْ أَبْوَاباً يَسِيلُونَ مِنْ مُسْتَثَارِهِمْ كَسَيْلِ الْجَنَّتَيْنِ سَيْلَ الْعَرِمِ حَيْثُ بَعَثَ عَلَيْهِ قَارَةً فَلَمْ mouse and the hill could not withstand against it (the flood) and its rocks came tumbling down when Allah (azwj) Shook the womb of the valleys with a severe Shaking. Then He (azwj) Transformed them into fountains in the earth restoring thereby the rights of the people and Making them to dwell in the houses of the people being a displacement of the Clan of Umayya so that they would not usurp what they usurped. Allah (azwj) will Undermine them and displace them by the boulders of Al-Aram and fill the valley of the olives by them. By the One (azwj) Who Split the seed and Brings life from it, that is going to happen. It is as if I (a.s.) can hear the whinnying of their horses and the humming of their men. I (a.s.) swear by Allah (azwj), that which is in their hands will melt, after the rise and domination in the country, like the melting of the fat over the fire. The one who dies among them would have died as a misguided one, and to Allah (azwj) Mighty and Majestic would lead the one among them and Allah (azwj) Mighty and Majestic would Accept the repentance of the one who repents. And it is to Allah (azwj) that my (a.s.) Shiites will gather after the fragmentation of the evil day of theirs, and there is no good for anyone to Allah (azwj) Mighty is His (azwj) Remembrance, but to Allah (azwj) is the good and all of the affairs. O you people! There are many who are falsifiers for the Imamate whilst not being deserving of it. And had you not procrastinated about the bitter truth, and had not weakened from the weakening of the falsehood, the ones who are not like you would have become daring against you, nor would he have become stronger the one who became stronger against you in digesting the obedience and the removal from it of its deserving ones (a.s.). But you are all lost just as the Children of Israel were lost in the era of Musa ibn Imran (as). By my (a.s.) life, your being lost will increase from after me (a.s.) more than Children of Israel being lost. And by my (a.s.) life, you will be completing, from after me (a.s.), the allocated time of the Sultanate of the Clan of Umayya, having gathered to the Sultan who called to the misguidance, and you will be reviving the falsehood and will be placing the truth behind your backs, and will be cutting off the relations with the people of Badr and be very remote from the sons of those who fought for the Messenger (saww) of Allah (azwj). And by my (a.s.) life, that which in their hands will melt away upon the approach of the test for the Reward and the Promise, and the allocated times passes by. And the two-tailed star will make its appearance for you from the East, and the luminous moon will make its appearance for you. So if that were to happen, return to the repentance, and know that you all follow what you see from the East on the Path of the Messenger (saww) of Allah (azwj). So it will cure you from the blindness, and the deafness, and the dumbness, and suffice you for the justice and you would be able to discard the gross weight which is upon the necks. And Allah (azwj) is not remote except from the one who refuses, and is unjust and unfair, and take that which is not for him. “[26:227] Those who do wrong will come to know by what a (great) reverse they will be overturned!”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:10",
  "kind": "verse_list"
}