{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 11"
        },
        "path": "/books/al-kafi:8:1:11",
        "titles": {
          "ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )",
          "en": "SERMON OF AMIR-UL-MOMINEEN<sup>asws</sup>"
        }
      }
    ],
    "index": 2282,
    "local_index": 11,
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:11",
    "titles": {
      "ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )",
      "en": "SERMON OF AMIR-UL-MOMINEEN<sup>asws</sup>"
    },
    "verse_count": 1,
    "verse_start_index": 14706,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 151)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14707,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:11:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14471</span>-  عَلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ وَ يَعْقُوبَ السَّرَّاجِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) لَمَّا بُويِعَ بَعْدَ مَقْتَلِ عُثْمَانَ صَعِدَ الْمِنْبَرَ فَقَالَ الْحَمْدُ لِلَّهِ الَّذِي عَلَا فَاسْتَعْلَى وَ دَنَا فَتَعَالَى وَ ارْتَفَعَ فَوْقَ كُلِّ مَنْظَرٍ وَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ خَاتَمُ النَّبِيِّينَ وَ حُجَّةُ اللَّهِ عَلَى الْعَالَمِينَ مُصَدِّقاً لِلرُّسُلِ الْأَوَّلِينَ وَ كَانَ بِالْمُؤْمِنِينَ رَءُوفاً رَحِيماً فَصَلَّى اللَّهُ وَ مَلَائِكَتُهُ عَلَيْهِ وَ عَلَى آلِهِ",
          "أَمَّا بَعْدُ أَيُّهَا النَّاسُ فَإِنَّ الْبَغْيَ يَقُودُ أَصْحَابَهُ إِلَى النَّارِ وَ إِنَّ أَوَّلَ مَنْ بَغَى عَلَى اللَّهِ جَلَّ ذِكْرُهُ عَنَاقُ بِنْتُ آدَمَ وَ أَوَّلَ قَتِيلٍ قَتَلَهُ اللَّهُ عَنَاقُ وَ كَانَ مَجْلِسُهَا جَرِيباً [مِنَ الْأَرْضِ] فِي جَرِيبٍ وَ كَانَ لَهَا عِشْرُونَ إِصْبَعاً فِي كُلِّ إِصْبَعٍ ظُفُرَانِ مِثْلُ الْمِنْجَلَيْنِ فَسَلَّطَ اللَّهُ عَزَّ وَ جَلَّ عَلَيْهَا أَسَداً كَالْفِيلِ وَ ذِئْباً كَالْبَعِيرِ وَ نَسْراً مِثْلَ الْبَغْلِ فَقَتَلُوهَا",
          "وَ قَدْ قَتَلَ اللَّهُ الْجَبَابِرَةَ عَلَى أَفْضَلِ أَحْوَالِهِمْ وَ آمَنِ مَا كَانُوا وَ أَمَاتَ هَامَانَ وَ أَهْلَكَ فِرْعَوْنَ وَ قَدْ قُتِلَ عُثْمَانُ أَلَا وَ إِنَّ بَلِيَّتَكُمْ قَدْ عَادَتْ كَهَيْئَتِهَا يَوْمَ بَعَثَ اللَّهُ نَبِيَّهُ ( صلى الله عليه وآله ) وَ الَّذِي بَعَثَهُ بِالْحَقِّ لَتُبَلْبَلُنَّ بَلْبَلَةً وَ لَتُغَرْبَلُنَّ غَرْبَلَةً وَ لَتُسَاطُنَّ سَوْطَةَ الْقِدْرِ حَتَّى يَعُودَ أَسْفَلُكُمْ أَعْلَاكُمْ وَ أَعْلَاكُمْ أَسْفَلَكُمْ وَ لَيَسْبِقَنَّ سَابِقُونَ كَانُوا قَصَّرُ ا وَ لَيُقَصِّرَنَّ و سَبِقاُونَ كَانُوا سَبَقُوا ",
          "وَ اللَّهِ مَا كَتَمْتُ وَشْمَةً وَ لَا كَذَبْتُ كَذِبَةً وَ لَقَدْ نُبِّئْتُ بِهَذَا الْمَقَامِ وَ هَذَا الْيَوْمِ أَلَا وَ إِنَّ الْخَطَايَا خَيْلٌ شُمُسٌ حُمِلَ عَلَيْهَا أَهْلُهَا وَ خُلِعَتْ لُجُمُهَا فَتَقَحَّمَتْ بِهِمْ فِي النَّارِ أَلَا وَ إِنَّ التَّقْوَى مَطَايَا ذُلُلٌ حُمِلَ عَلَيْهَا أَهْلُهَا وَ أُعْطُوا أَزِمَّتَهَا فَأَوْرَدَتْهُمُ الْجَنَّةَ وَ فُتِحَتْ لَهُمْ أَبْوَابُهَا وَ وَجَدُوا رِيحَهَا وَ طِيبَهَا وَ قِيلَ لَهُمْ ادْخُلُوها بِسَلامٍ آمِنِينَ ",
          "أَلَا وَ قَدْ سَبَقَنِي إِلَى هَذَا الْأَمْرِ مَنْ لَمْ أُشْرِكْهُ فِيهِ وَ مَنْ لَمْ أَهَبْهُ لَهُ وَ مَنْ لَيْسَتْ لَهُ مِنْهُ نَوْبَةٌ إِلَّا بِنَبِيٍّ يُبْعَثُ أَلَا وَ لَا نَبِيَّ بَعْدَ مُحَمَّدٍ ( صلى الله عليه وآله ) أَشْرَفَ مِنْهُ عَلَى شَفَا جُرُفٍ هَارٍ فَانْهَارَ بِهِ فِي نَارِ جَهَنَّمَ ",
          "حَقٌّ وَ بَاطِلٌ وَ لِكُلٍّ أَهْلٌ فَلَئِنْ أَمِرَ الْبَاطِلُ لَقَدِيماً فَعَلَ وَ لَئِنْ قَلَّ الْحَقُّ فَلَرُبَّمَا وَ لَعَلَّ وَ لَقَلَّمَا أَدْبَرَ شَيْ‏ءٌ فَأَقْبَلَ وَ لَئِنْ رُدَّ عَلَيْكُمْ أَمْرُكُمْ أَنَّكُمْ سُعَدَاءُ وَ مَا عَلَيَّ إِلَّا الْجُهْدُ وَ إِنِّي لَأَخْشَى أَنْ تَكُونُوا عَلَى فَتْرَةٍ مِلْتُمْ عَنِّي مَيْلَةً كُنْتُمْ فِيهَا عِنْدِي غَيْرَ مَحْمُودِي الرَّأْيِ وَ لَوْ أَشَاءُ لَقُلْتُ عَفَا اللَّهُ عَمَّا سَلَفَ",
          "سَبَقَ فِيهِ الرَّجُلَانِ وَ قَامَ الثَّالِثُ كَالْغُرَابِ هَمُّهُ بَطْنُهُ وَيْلَهُ لَوْ قُصَّ جَنَاحَاهُ وَ قُطِعَ رَأْسُهُ كَانَ خَيْراً لَهُ شُغِلَ عَنِ الْجَنَّةِ وَ النَّارُ أَمَامَهُ ",
          "ثَلَاثَةٌ وَ اثْنَانِ خَمْسَةٌ لَيْسَ لَهُمْ سَادِسٌ مَلَكٌ يَطِيرُ بِجَنَاحَيْهِ وَ نَبِيٌّ أَخَذَ اللَّهُ بِضَبْعَيْهِ وَ سَاعٍ مُجْتَهِدٌ وَ طَالِبٌ يَرْجُو وَ مُقَصِّرٌ فِي النَّارِ ",
          "الْيَمِينُ وَ الشِّمَالُ مَضَلَّةٌ وَ الطَّرِيقُ الْوُسْطَى هِيَ الْجَادَّةُ عَلَيْهَا يَأْتِي الْكِتَابُ وَ آثَارُ النُّبُوَّةِ هَلَكَ مَنِ ادَّعَى وَ خَابَ مَنِ افْتَرَى إِنَّ اللَّهَ أَدَّبَ هَذِهِ الْأُمَّةَ بِالسَّيْفِ وَ السَّوْطِ وَ لَيْسَ لِأَحَدٍ عِنْدَ الْإِمَامِ فِيهِمَا هَوَادَةٌ فَاسْتَتِرُوا فِي بُيُوتِكُمْ وَ أَصْلِحُوا ذَاتَ بَيْنِكُمْ وَ التَّوْبَةُ مِنْ وَرَائِكُمْ مَنْ أَبْدَى صَفْحَتَهُ لِلْحَقِّ هَلَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473119\">H 14471</a> – Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Ali Bin Ra’ab abd Yaqoub Al-Sarraaj who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has narrated that: ‘Amir-ul-Momineen<sup>asws</sup>, when they had pledged allegiance to him<sup>asws</sup> after the killing of Usman, ascended the Pulpit, so he<sup>asws</sup> said: ‘Praise be to Allah<sup>azwj</sup> Who is High and thus all is in His<sup>azwj</sup> possession and He<sup>azwj</sup> is Closer than any in the view.  And I<sup>asws</sup> hereby testify that there is no god but Allah<sup>azwj</sup>, One with no associates to Him<sup>azwj</sup>, and I<sup>asws</sup> testify that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Messenger<sup>saww</sup>, the last of the Prophets<sup>as</sup> and a Proof over the worlds, a ratification for the former Prophets<sup>as</sup> and was kind and merciful to the Believers. The Angels sent ‘salam’ greetings of peace upon him<sup>saww</sup> and upon his<sup>saww</sup> Progeny<sup>asws</sup>. ",
            "Having said that, O you people! The transgression (indecency) places its owner into the Fire, and the first one to transgression (commit indecency) against Allah<sup>azwj</sup> Majestic is His<sup>azwj</sup> Remembrance was Onaq the daughter of Adam<sup>as</sup>, and the first one who was killed, whom Allah<sup>azwj</sup> Killed was Onaq. And the area that she occupied when seated upon the ground measured one square acre (Jarib) of the land, and she had twenty fingers and on each of her fingers were two nails like two sickles. So Allah<sup>azwj</sup> Mighty and Majestic Made her to be overcome by a lion which was like an elephant (in size), and a wolf which was like a camel (in size), and an eagle like a mule (in size). So they killed her. ",
            "And Allah<sup>azwj</sup> had Killed the tyrants in their best conditions, and gave Safety to those who used to be (oppressed). And He<sup>azwj</sup> Made Hannaan to die, and destroyed the Pharaoh<sup>la</sup>, and He<sup>azwj</sup> has Killed Usman. Indeed! Your misfortunes have returned to what they were on the day Allah<sup>azwj</sup> Sent His<sup>azwj</sup> Prophet<sup>saww</sup>. By the One<sup>azwj</sup> Who Sent him<sup>saww</sup> by the truth, you will be confused with a (severe) confusion and be sifted with a (severe) sifting, and stirred and turned like the contents of a frying pan until your underside becomes your upper side and your upper side becomes your underside. The ones who used to be with the shortcomings will become the foremost ones, and those who used to be the foremost ones would become the people with shortcomings.",
            "By Allah<sup>azwj</sup>! I<sup>asws</sup> have neither concealed, nor blocked, nor lied a lie, and I<sup>asws</sup> have been foretold about this place and this day. Indeed! And the sins are like uncontrollable horses which carry its riders, with its harnesses removed, plunging into the Fire.  Indeed! And the piety is like a humble ride which takes its rider, along with its rein, to the Paradise, and its Doors will be opened up for them, and they will find its aroma and goodness. And it will be said to them: ‘Enter it in peace and security’.",
            "Indeed! The ones who had no association with it has preceded me<sup>asws</sup> to this command (Caliphate), and the ones to whom it had not been Granted to, and the ones for whom there was no chance from it except if they were to be Prophets<sup>as</sup> who had been Sent. And indeed! There is no Prophet <sup>as</sup> to be after Muhammad<sup>saww</sup> who is more noble than him<sup>as</sup> over the intercession on the brink of the Fire. So they will fall with by it (their lies) in the Fire of Hell. ",
            "Truth as well as falsehood, for each of them are its people. The matter of falsehood is a very old one and has been active. And if the truth is less (in practice) it is because of ‘if’ and ‘maybe’. And it is rare that if a thing gone away comes back, and if your command (Caliphate) returns to you, you would be pleased, and it is not on me<sup>asws</sup> except for the striving, and I<sup>asws</sup> am afraid that you all will end up being on the nature of your nation (away) from me<sup>asws</sup>, the nation that you were in beforehand and would not have a praiseworthy opinion in my<sup>asws</sup> sight, and if I<sup>asws</sup> so desire to I<sup>asws</sup> would say: ‘May Allah<sup>azwj</sup> Forgive what was in the past’. ",
            "Two men preceded me<sup>asws</sup> with regards to it (Caliphate), and the third one stood up like the Raven. His main concern was his stomach. Woe be unto him! Had his wings been clipped and his head cut-off, it would have been better for him. He was distracted from the Paradise and the Hell was in front of him.",
            "Three and two make five, there is no sixth of them – An Angel who files by his wings, and a Prophet<sup>as</sup> whom Allah<sup>azwj</sup> has Grabbed by his<sup>as</sup> shoulders (Given him Divine Status), and a diligent seeker (momin), and a hopeful student, and a reducer (Muqassir) are in the Fire.",
            "The right and the left are misleading, whereas the middle path is the street on which you will come across the Book and the effects of the Prophet-hood. Destroyed is the one who makes a claim, and disillusioned is the one who fabricates that Allah<sup>azwj</sup> Disciplined this community by the sword and the whip, and there is no leniency for either of them with the Imam<sup>asws</sup>. So, hide in your homes and mend your relationships in between yourselves and the repentance is behind you all. The one who turned his cheek (opposed the Imam<sup>asws</sup>) to the truth is destroyed. ",
            "out of 567"
          ],
          "en.sarwar": [
            "23. Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Ali Bin Ra’ab abd Yaqoub Al-Sarraaj who has said: Abu Abdullah (a.s.) has narrated that: ‘Amir-ul-Momineen (a.s.), when they had pledged allegiance to him (a.s.) after the killing of Usman, ascended the Pulpit, so he (a.s.) said: ‘Praise be to Allah (azwj) Who is High and thus all is in His (azwj) possession and He (azwj) is Closer than any in the view. And I (a.s.) hereby testify that there is no god but Allah (azwj), One with no associates to Him (azwj), and I (a.s.) testify that Muhammad (saww) is His (azwj) servant and His (azwj) Messenger (saww), the last of the Prophets (as) and a Proof over the worlds, a ratification for the former Prophets (as) and was kind and merciful to the Believers. The Angels sent ‘salam’ greetings of peace upon him (saww) and upon his (saww) Progeny (a.s.). Having said that, O you people! The transgression (indecency) places its owner into the Fire, and the first one to transgression (commit indecency) against Allah (azwj) Majestic is His (azwj) Remembrance was Onaq the daughter of Adam (as), and the first one who was killed, whom Allah (azwj) Killed was Onaq. And the area that she occupied when seated upon the ground measured one square acre (Jarib) of the land, and she had twenty fingers and on each of her fingers were two nails like two sickles. So Allah (azwj) Mighty and Majestic Made her to be overcome by a lion which was like an elephant (in size), and a wolf which was like a camel (in size), and an eagle like a mule (in size). So they killed her. And Allah (azwj) had Killed the tyrants in their best conditions, and gave Safety to those who used to be (oppressed). And He (azwj) Made Hannaan to die, and destroyed the Pharaoh (la), and He (azwj) has Killed Usman. Indeed! Your misfortunes have returned to what they were on the day Allah (azwj) Sent His (azwj) Prophet (saww). By the One (azwj) Who Sent him (saww) by the truth, you will be confused with a (severe) confusion and be sifted with a (severe) sifting, and stirred and turned like the contents of a frying pan until your underside becomes your upper side and your upper side becomes your underside. The ones who used to be with the shortcomings will become the foremost ones, and those who used to be the foremost ones would become the people with shortcomings. By Allah (azwj)! I (a.s.) have neither concealed, nor blocked, nor lied a lie, and I (a.s.) have been foretold about this place and this day. Indeed! And the sins are like uncontrollable horses which carry its riders, with its harnesses removed, plunging into the Fire. Indeed! And the piety is like a humble ride which takes its rider, along with its rein, to the Paradise, and its Doors will be opened up for them, and they will find its aroma and goodness. And it will be said to them: ‘Enter it in peace and security’. Indeed! The ones who had no association with it has preceded me (a.s.) to this command (Caliphate), and the ones to whom it had not been Granted to, and the ones for whom there was no chance from it except if they were to be Prophets (as) who had been Sent. And indeed! There is no Prophet (as) to be after Muhammad (saww) who is more noble than him (as) over the intercession on the brink of the Fire. So they will fall with by it (their lies) in the Fire of Hell. Truth as well as falsehood, for each of them are its people. The matter of falsehood is a very old one and has been active. And if the truth is less (in practice) it is because of ‘if’ and ‘maybe’. And it is rare that if a thing gone away comes back, and if your command (Caliphate) returns to you, you would be pleased, and it is not on me (a.s.) except for the striving, and I (a.s.) am afraid that you all will end up being on the nature of your nation (away) from me (a.s.), the nation that you were in beforehand and would not have a praiseworthy opinion in my (a.s.) sight, and if I (a.s.) so desire to I (a.s.) would say: ‘May Allah (azwj) Forgive what was in the past’. Two men preceded me (a.s.) with regards to it (Caliphate), and the third one stood up like the Raven. His main concern was his stomach. Woe be unto him! Had his wings been clipped and his head cut-off, it would have been better for him. He was distracted from the Paradise and the Hell was in front of him. Three and two make five, there is no sixth of them – An Angel who files by his wings, and a Prophet (as) whom Allah (azwj) has Grabbed by his (as) shoulders (Given him Divine Status), and a diligent seeker (momin), and a hopeful student, and a reducer (Muqassir) are in the Fire. The right and the left are misleading, whereas the middle path is the street on which you will come across the Book and the effects of the Prophet-hood. Destroyed is the one who makes a claim, and disillusioned is the one who fabricates that Allah (azwj) Disciplined this community by the sword and the whip, and there is no leniency for either of them with the Imam (a.s.). So, hide in your homes and mend your relationships in between yourselves and the repentance is behind you all. The one who turned his cheek (opposed the Imam (a.s.)) to the truth is destroyed."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:11",
  "kind": "verse_list"
}