{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 8"}, "path": "/books/al-kafi:8", "titles": {"ar": "الجزء الثامن‏", "en": "Volume Eight"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:8:1", "titles": {"ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;", "en": "The Book - Garden (of Flowers)"}}, {"indexed_titles": {"en": "Chapter 13"}, "path": "/books/al-kafi:8:1:13", "titles": {"ar": "حَدِيثُ النَّبِيِّ ( صلى الله عليه وآله ) حِينَ عُرِضَتْ عَلَيْهِ الْخَيْلُ", "en": "HADEETH OF THE PROPHET<sup>saww</sup> WHEN THE HORSES WERE PRESENTED TO HIM <sup>saww</sup>"}}], "index": 2274, "local_index": 13, "part_type": "Chapter", "path": "/books/al-kafi:8:1:13", "titles": {"ar": "حَدِيثُ النَّبِيِّ ( صلى الله عليه وآله ) حِينَ عُرِضَتْ عَلَيْهِ الْخَيْلُ", "en": "HADEETH OF THE PROPHET<sup>saww</sup> WHEN THE HORSES WERE PRESENTED TO HIM <sup>saww</sup>"}, "verse_count": 2, "verse_start_index": 14699, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 14700, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:8:1:13:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14475</span>-  أَبُو عَلِيٍّ الْأَشْعَرِيُّ</span> عَنْ مُحَمَّدِ بْنِ سَالِمٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنْ أَحْمَدَ بْنِ النَّضْرِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَبِي الْقَاسِمِ عَنِ الْحُسَيْنِ بْنِ أَبِي قَتَادَةَ جَمِيعاً عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ خَرَجَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِعَرْضِ الْخَيْلِ فَمَرَّ بِقَبْرِ أَبِي أُحَيْحَةَ فَقَالَ أَبُو بَكْرٍ لَعَنَ اللَّهُ صَاحِبَ هَذَا الْقَبْرِ فَوَ اللَّهِ إِنْ كَانَ لَيَصُدُّ عَنْ سَبِيلِ اللَّهِ وَ يُكَذِّبُ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ خَالِدٌ ابْنُهُ بَلْ لَعَنَ اللَّهُ أَبَا قُحَافَةَ فَوَ اللَّهِ مَا كَانَ يُقْرِي الضَّيْفَ وَ لَا يُقَاتِلُ الْعَدُوَّ فَلَعَنَ اللَّهُ أَهْوَنَهُمَا عَلَى الْعَشِيرَةِ فَقْداً فَأَلْقَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) خِطَامَ رَاحِلَتِهِ عَلَى غَارِبِهَا ثُمَّ قَالَ إِذَا أَنْتُمْ تَنَاوَلْتُمُ الْمُشْرِكِينَ فَعُمُّوا وَ لَا تَخُصُّوا فَيَغْضَبَ وُلْدُهُ", "ثُمَّ وَقَفَ فَعُرِضَتْ عَلَيْهِ الْخَيْلُ فَمَرَّ بِهِ فَرَسٌ فَقَالَ عُيَيْنَةُ بْنُ حِصْنٍ إِنَّ مِنْ أَمْرِ هَذَا الْفَرَسِ كَيْتَ وَ كَيْتَ فَقَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله ) ذَرْنَا فَأَنَا أَعْلَمُ بِالْخَيْلِ مِنْكَ فَقَالَ عُيَيْنَةُ وَ أَنَا أَعْلَمُ بِالرِّجَالِ مِنْكَ ", "فَغَضِبَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) حَتَّى ظَهَرَ الدَّمُ فِي وَجْهِهِ فَقَالَ لَهُ فَأَيُّ الرِّجَالِ أَفْضَلُ فَقَالَ عُيَيْنَةُ بْنُ حِصْنٍ رِجَالٌ يَكُونُونَ بِنَجْدٍ يَضَعُونَ سُيُوفَهُمْ عَلَى عَوَاتِقِهِمْ وَ رِمَاحَهُمْ عَلَى كَوَاثِبِ خَيْلِهِمْ ثُمَّ يَضْرِبُونَ بِهَا قُدُماً قُدُماً فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كَذَبْتَ بَلْ رِجَالُ أَهْلِ الْيَمَنِ أَفْضَلُ الْإِيمَانُ يَمَانِيٌّ وَ الْحِكْمَةُ يَمَانِيَّةٌ وَ لَوْ لَا الْهِجْرَةُ لَكُنْتُ امْرَأً مِنْ أَهْلِ الْيَمَنِ", "الْجَفَاءُ وَ الْقَسْوَةُ فِي الْفَدَّادِينَ أَصْحَابِ الْوَبَرِ رَبِيعَةَ وَ مُضَرَ مِنْ حَيْثُ يَطْلُعُ قَرْنُ الشَّمْسِ وَ مَذْحِجُ أَكْثَرُ قَبِيلٍ يَدْخُلُونَ الْجَنَّةَ وَ حَضْرَمَوْتُ خَيْرٌ مِنْ عَامِرِ بْنِ صَعْصَعَةَ وَ رَوَى بَعْضُهُمْ خَيْرٌ مِنَ الْحَارِثِ بْنِ مُعَاوِيَةَ وَ بَجِيلَةُ خَيْرٌ مِنْ رِعْلٍ وَ ذَكْوَانَ وَ إِنْ يَهْلِكْ لِحْيَانُ فَلَا أُبَالِي ", "ثُمَّ قَالَ لَعَنَ اللَّهُ الْمُلُوكَ الْأَرْبَعَةَ جَمَداً وَ مَخْوَساً وَ مَشْرَحاً وَ أَبْضَعَةَ وَ أُخْتَهُمُ الْعَمَّرَدَةَ لَعَنَ اللَّهُ الْمُحَلِّلَ وَ الْمُحَلَّلَ لَهُ وَ مَنْ يُوَالِي غَيْرَ مَوَالِيهِ وَ مَنِ ادَّعَى نَسَباً لَا يُعْرَفُ وَ الْمُتَشَبِّهِينَ مِنَ الرِّجَالِ بِالنِّسَاءِ وَ الْمُتَشَبِّهَاتِ مِنَ النِّسَاءِ بِالرِّجَالِ وَ مَنْ أَحْدَثَ حَدَثاً فِي الْإِسْلَامِ أَوْ آوَى مُحْدِثاً وَ مَنْ قَتَلَ غَيْرَ قَاتِلِهِ أَوْ ضَرَبَ غَيْرَ ضَارِبِهِ وَ مَنْ لَعَنَ أَبَوَيْهِ ", "فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَ يُوجَدُ رَجُلٌ يَلْعَنُ أَبَوَيْهِ فَقَالَ نَعَمْ يَلْعَنُ آبَاءَ الرِّجَالِ وَ أُمَّهَاتِهِمْ فَيَلْعَنُونَ أَبَوَيْهِ لَعَنَ اللَّهُ رِعْلًا وَ ذَكْوَانَ وَ عَضَلًا وَ لِحْيَانَ وَ الْمُجْذَمِينَ مِنْ أَسَدٍ وَ غَطَفَانَ وَ أَبَا سُفْيَانَ بْنَ حَرْبٍ وَ شَهْبَلًا ذَا الْأَسْنَانِ وَ ابْنَيْ مَلِيكَةَ بْنِ جَزِيمٍ وَ مَرْوَانَ وَ هَوْذَةَ وَ هَوْنَةَ ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473125\">H 14475</a> – Abu Ali Al-Ashary, from Muhammad Bin Saalim and Ali Bin Ibrahim, from his father altogether, from Ahmad Bin Al-Nazar, and Muhammad Bin Yahya, from Muhammad Bin Abu Al-Qasim, from Al-Husayn Bin Abu Qatada altogether, from Amro Bin Shimr, from Jabir, who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> having said: ‘The Messenger<sup>as</sup> of Allah<sup>azwj</sup> came out for the display of the horses. He<sup>saww</sup> passed by the grave of Abu Ahayhat. So Abu Bakr said, ‘Curse be upon the occupant of this grave, for by Allah<sup>azwj</sup>, he used to divert people away from the Way of Allah<sup>azwj</sup> and belied the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>’. So Khalid, his (Ahayhat’s) son said, ‘But curse of Allah<sup>azwj</sup> be upon Abu Qohafa (Abu Bakr’s father), for by Allah<sup>azwj</sup>, he neither served a guest nor did he kill (fight) the enemy. So Allah<sup>azwj</sup> has Cursed the worthless one of the two of his clan’. ", "So the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> placed the bridle of the horse upon his (Abu Bakr’s) neck and said: ‘Whenever you speak about the ‘Mushraqeen’ Polytheists speak in general terms and not particular, for you have anger his son’.", "Then he<sup>saww</sup> paused. The horses were displayed to him<sup>asws</sup>. So he<sup>saww</sup> passed by a horse. Uyayna Bin Hisan said, ‘The matter of this horse is such and such’. The Messenger<sup>saww</sup> of Allah<sup>azwj</sup> said: ‘Leave us, for I<sup>saww</sup> am more knowledgeable of the horses than you are’. Uyayna said, ‘And I am more knowledgeable of the men than you<sup>saww</sup> are’ (Nouzobillah).", "So the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> got angry to the extent that blood appeared in his<sup>saww</sup> face. He<sup>saww</sup> said to him: ‘So which of the men are the best?’ Uyayna Bin Hisan said, ‘The men who are in Najd place their swords upon their shoulders and their spears upon the saddles of their horses, then march with them step by step’. The Messenger<sup>saww</sup> of Allah<sup>azwj</sup> said: ‘You are lying. But, the men of Yemen are better. The faith is in Yemen and the wisdom is in Yemen, and had it not been for the Emigration (Hijrat), I<sup>saww</sup> would have been of the people of Yemen. ", "The alienation and the cruelty is in the acreages<a id=\"_ftnref10\"></a><sup>[10]</sup> of the owners of the cotton yarn, Rabi’ah and Muzar from where the rays of the sun appear, and (as for) Muzhaj most of the tribe will enter the Paradise, and Hazramaut is better than Aamir Bin Sa’sa (and some have reported ‘better than Haaris Bin Muawiya’) and Bajeela is better than Ra’al and Zakwaan, and if Lihyaan were to perish I<sup>asws</sup> would not care’. ", "Then he<sup>saww</sup> said: ‘Allah<sup>azwj</sup> has Cursed four kings – Jamada, and Makhwasa, and Mashraha, and Abza’a, as well as Akhtam Al-Ammaradat. Allah<sup>azwj</sup> has Cursed Al-Muhallal (One who legalises a woman for her previous husband after three divorces from him) and the one to whom she has been made legal for, and the slave who does not obey his master, and the one who makes a claim for lineage, and the man who is effeminate (has feminine traits) and the woman who has masculine traits, and the one who innovates something new in Al-Islam or helps an innovator, and the one who kills someone other than the one who wants to kill him, or strike against someone other than the one who wants to strike him, and the one who curses his father’. ", "So a man said, ‘O Messenger<sup>saww</sup> of Allah<sup>azwj</sup>, is there a man who curses his own father?’ He<sup>saww</sup> said: ‘Yes, he who curses the fathers and the mothers of the men, so he has cursed his own father. Allah<sup>azwj</sup> has Cursed Ra’la, and Zakwaan, and Azla, and Lahyaan, and the criminals of Asad, and Ghatfaan, and Abu Sufyan Bin Harb, and Shahbala of two teeth, and the two sons of Malikat Bin Jazeem, and Marwaan, and Howzat and Hownat’."]}}, {"index": 14701, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:8:1:13:2", "text": ["14476-  عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ مَوْلًى لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) سَأَلَهُ مَالًا فَقَالَ يَخْرُجُ عَطَائِي فَأُقَاسِمُكَ هُوَ فَقَالَ لَا أَكْتَفِي وَ خَرَجَ إِلَى مُعَاوِيَةَ فَوَصَلَهُ فَكَتَبَ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) يُخْبِرُهُ بِمَا أَصَابَ مِنَ الْمَالِ ", "فَكَتَبَ إِلَيْهِ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَمَّا بَعْدُ فَإِنَّ مَا فِي يَدِكَ مِنَ الْمَالِ قَدْ كَانَ لَهُ أَهْلٌ قَبْلَكَ وَ هُوَ صَائِرٌ إِلَى أَهْلِهِ بَعْدَكَ وَ إِنَّمَا لَكَ مِنْهُ مَا مَهَّدْتَ لِنَفْسِكَ فَآثِرْ نَفْسَكَ عَلَى صَلَاحِ وُلْدِكَ فَإِنَّمَا أَنْتَ جَامِعٌ لِأَحَدِ رَجُلَيْنِ إِمَّا رَجُلٌ عَمِلَ فِيهِ بِطَاعَةِ اللَّهِ فَسَعِدَ بِمَا شَقِيتَ وَ إِمَّا رَجُلٌ عَمِلَ فِيهِ بِمَعْصِيَةِ اللَّهِ فَشَقِيَ بِمَا جَمَعْتَ لَهُ وَ لَيْسَ مِنْ هَذَيْنِ أَحَدٌ بِأَهْلٍ أَنْ تُؤْثِرَهُ عَلَى نَفْسِكَ وَ لَا تُبَرِّدَ لَهُ عَلَى ظَهْرِكَ فَارْجُ لِمَنْ مَضَى رَحْمَةَ اللَّهِ وَ ثِقْ لِمَنْ بَقِيَ بِرِزْقِ اللَّهِ ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473126\">H 14476</a> – Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from one of his companions, who has said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has reported that ‘A slave of Amir-ul-Momineen<sup>asws</sup> asked him<sup>asws</sup> for some wealth, so he<sup>asws</sup> said: ‘When my<sup>asws</sup> share comes to me<sup>asws</sup> I<sup>asws</sup> will distribute it to you’. He said, ‘I am not content’, and he went to Muawiya who gave it to him. So he wrote to Amir-ul-Momineen<sup>asws</sup> informing him<sup>asws</sup> of what he had received from the wealth. ", "So Amir-ul-Momineen<sup>asws</sup> wrote to him: ‘Thereafter, that which is in your hand from the wealth, there used to be an owner for it before you, and it will get transferred to its (next) owner after you, but what is for you from it is what you pave the way for yourself (for the Hereafter). So prefer yourself over the correction of your children, for what you have gathered is for one of the two men - for a man who works in it by the obedience to Allah<sup>azwj</sup> so he is fortunate with what he receives from you, and as for a man who works in it by the disobedience to Allah<sup>azwj</sup> so he is unfortunate by what you have gathered for him, and there is none from these two who is deserving of being preferred over yourself, and do not place a burden upon your back. So be hopeful of the Mercy of Allah<sup>azwj</sup> for what has past, and place your trust in the sustenance from Allah<sup>azwj</sup> for what remains (of your life)’.", "out of 567"]}}]}, "index": "al-kafi:8:1:13", "kind": "verse_list"}