{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:8:1:14",
        "titles": {
          "ar": "كَلَامُ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام )",
          "en": "SPEECH OF ALI BIN AL-HUSAYN <sup>asws</sup>"
        }
      }
    ],
    "index": 2285,
    "local_index": 14,
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:14",
    "titles": {
      "ar": "كَلَامُ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام )",
      "en": "SPEECH OF ALI BIN AL-HUSAYN <sup>asws</sup>"
    },
    "verse_count": 1,
    "verse_start_index": 14712,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14713,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:14:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14477</span>-  حَدَّثَنِي مُحَمَّدُ</span> بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ غَالِبٍ الْأَسَدِيِّ عَنْ أَبِيهِ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَ كَانَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) يَعِظُ النَّاسَ وَ يُزَهِّدُهُمْ فِي الدُّنْيَا وَ يُرَغِّبُهُمْ فِي أَعْمَالِ الْآخِرَةِ بِهَذَا الْكَلَامِ فِي كُلِّ جُمُعَةٍ فِي مَسْجِدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ حُفِظَ عَنْهُ وَ كُتِبَ ",
          "كَانَ يَقُولُ أَيُّهَا النَّاسُ اتَّقُوا اللَّهَ وَ اعْلَمُوا أَنَّكُمْ إِلَيْهِ تُرْجَعُونَ فَتَجِدُ كُلُّ نَفْسٍ مَا عَمِلَتْ فِي هَذِهِ الدُّنْيَا مِنْ خَيْرٍ مُحْضَراً وَ مَا عَمِلَتْ مِنْ سُوءٍ تَوَدُّ لَوْ أَنَّ بَيْنَهَا وَ بَيْنَهُ أَمَداً بَعِيداً وَ يُحَذِّرُكُمُ اللَّهُ نَفْسَهُ وَيْحَكَ يَا ابْنَ آدَمَ الْغَافِلَ وَ لَيْسَ بِمَغْفُولٍ عَنْهُ",
          "يَا ابْنَ آدَمَ إِنَّ أَجَلَكَ أَسْرَعُ شَيْ‏ءٍ إِلَيْكَ قَدْ أَقْبَلَ نَحْوَكَ حَثِيثاً يَطْلُبُكَ وَ يُوشِكُ أَنْ يُدْرِكَكَ وَ كَأَنْ قَدْ أَوْفَيْتَ أَجَلَكَ وَ قَبَضَ الْمَلَكُ رُوحَكَ وَ صِرْتَ إِلَى قَبْرِكَ وَحِيداً فَرَدَّ إِلَيْكَ فِيهِ رُوحَكَ وَ اقْتَحَمَ عَلَيْكَ فِيهِ مَلَكَانِ نَاكِرٌ وَ نَكِيرٌ لِمُسَاءَلَتِكَ وَ شَدِيدِ امْتِحَانِكَ ",
          "أَلَا وَ إِنَّ أَوَّلَ مَا يَسْأَلَانِكَ عَنْ رَبِّكَ الَّذِي كُنْتَ تَعْبُدُهُ وَ عَنْ نَبِيِّكَ الَّذِي أُرْسِلَ إِلَيْكَ و عَنْ دِينِكَ الَّذِي كُنْتَ تَدِينُ بِهِ وَ عَنْ كِتَابِكَ الَّذِي كُنْتَ تَتْلُوهُ وَ عَنْ إِمَامِكَ الَّذِي كُنْتَ تَتَوَلَّاهُ ثُمَّ عَنْ عُمُرِكَ فِيمَا كُنْتَ أَفْنَيْتَهُ وَ مَالِكَ مِنْ أَيْنَ اكْتَسَبْتَهُ وَ فِيمَا أَنْتَ أَنْفَقْتَهُ ",
          "فَخُذْ حِذْرَكَ وَ انْظُرْ لِنَفْسِكَ وَ أَعِدَّ الْجَوَابَ قَبْلَ الِامْتِحَانِ وَ الْمُسَائَلَةِ وَ الِاخْتِبَارِ فَإِنْ تَكُ مُؤْمِناً عَارِفاً بِدِينِكَ مُتَّبِعاً لِلصَّادِقِينَ مُوَالِياً لِأَوْلِيَاءِ اللَّهِ لَقَّاكَ اللَّهُ حُجَّتَكَ وَ أَنْطَقَ لِسَانَكَ بِالصَّوَابِ وَ أَحْسَنْتَ الْجَوَابَ وَ بُشِّرْتَ بِالرِّضْوَانِ وَ الْجَنَّةِ مِنَ اللَّهِ عَزَّ وَ جَلَّ وَ اسْتَقْبَلَتْكَ الْمَلَائِكَةُ بِالرَّوْحِ وَ الرَّيْحَانِ وَ إِنْ لَمْ تَكُنْ كَذَلِكَ تَلَجْلَجَ لِسَانُكَ وَ دُحِضَتْ حُجَّتُكَ وَ عَيِيتَ عَنِ الْجَوَابِ وَ بُشِّرْتَ بِالنَّارِ وَ اسْتَقْبَلَتْكَ مَلَائِكَةُ الْعَذَابِ بِنُزُلٍ مِنْ حَمِيمٍ وَ تَصْلِيَةِ جَحِيمٍ",
          "وَ اعْلَمْ يَا ابْنَ آدَمَ أَنَّ مِنْ وَرَاءِ هَذَا أَعْظَمَ وَ أَفْظَعَ وَ أَوْجَعَ لِلْقُلُوبِ يَوْمَ الْقِيَامَةِ ذلِكَ يَوْمٌ مَجْمُوعٌ لَهُ النَّاسُ وَ ذلِكَ يَوْمٌ مَشْهُودٌ يَجْمَعُ اللَّهُ عَزَّ وَ جَلَّ فِيهِ الْأَوَّلِينَ وَ الْآخِرِينَ ذَلِكَ يَوْمٌ يُنْفَخُ فِي الصُّورِ وَ تُبَعْثَرُ فِيهِ الْقُبُورُ وَ ذَلِكَ يَوْمُ الْآزِفَةِ إِذِ الْقُلُوبُ لَدَى الْحَناجِرِ كاظِمِينَ وَ ذَلِكَ يَوْمٌ لَا تُقَالُ فِيهِ عَثْرَةٌ وَ لَا يُؤْخَذُ مِنْ أَحَدٍ فِدْيَةٌ وَ لَا تُقْبَلُ مِنْ أَحَدٍ مَعْذِرَةٌ وَ لَا لِأَحَدٍ فِيهِ مُسْتَقْبَلُ تَوْبَةٍ لَيْسَ إِلَّا الْجَزَاءُ بِالْحَسَنَاتِ وَ الْجَزَاءُ بِالسَّيِّئَاتِ فَمَنْ كَانَ مِنَ الْمُؤْمِنِينَ عَمِلَ فِي هَذِهِ الدُّنْيَا مِثْقَالَ ذَرَّةٍ مِنْ خَيْرٍ وَجَدَهُ وَ مَنْ كَانَ مِنَ الْمُؤْمِنِينَ عَمِلَ فِي هَذِهِ الدُّنْيَا مِثْقَالَ ذَرَّةٍ مِنْ شَرٍّ وَجَدَهُ",
          "فَاحْذَرُوا أَيُّهَا النَّاسُ مِنَ الذُّنُوبِ وَ الْمَعَاصِي مَا قَدْ نَهَاكُمُ اللَّهُ عَنْهَا وَ حَذَّرَكُمُوهَا فِي كِتَابِهِ الصَّادِقِ وَ الْبَيَانِ النَّاطِقِ وَ لَا تَأْمَنُوا مَكْرَ اللَّهِ وَ تَحْذِيرَهُ وَ تَهْدِيدَهُ عِنْدَ مَا يَدْعُوكُمُ الشَّيْطَانُ اللَّعِينُ إِلَيْهِ مِنْ عَاجِلِ الشَّهَوَاتِ وَ اللَّذَّاتِ فِي هَذِهِ الدُّنْيَا فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ إِنَّ الَّذِينَ اتَّقَوْا إِذا مَسَّهُمْ طائِفٌ مِنَ الشَّيْطانِ تَذَكَّرُوا فَإِذا هُمْ مُبْصِرُونَ ",
          "وَ أَشْعِرُوا قُلُوبَكُمْ خَوْفَ اللَّهِ وَ تَذَكَّرُوا مَا قَدْ وَعَدَكُمُ اللَّهُ فِي مَرْجِعُكُمْ إِلَيْهِ مِنْ حُسْنِ ثَوَابِهِ كَمَا قَدْ خَوَّفَكُمْ مِنْ شَدِيدِ الْعِقَابِ فَإِنَّهُ مَنْ خَافَ شَيْئاً حَذِرَهُ وَ مَنْ حَذِرَ شَيْئاً تَرَكَهُ وَ لَا تَكُونُوا مِنَ الْغَافِلِينَ الْمَائِلِينَ إِلَى زَهْرَةِ الدُّنْيَا الَّذِينَ مَكَرُوا السَّيِّئَاتِ فَإِنَّ اللَّهَ يَقُولُ فِي مُحْكَمِ كِتَابِهِ أَ فَأَمِنَ الَّذِينَ مَكَرُوا السَّيِّئاتِ أَنْ يَخْسِفَ اللَّهُ بِهِمُ الْأَرْضَ أَوْ يَأْتِيَهُمُ الْعَذابُ مِنْ حَيْثُ لا يَشْعُرُونَ أَوْ يَأْخُذَهُمْ فِي تَقَلُّبِهِمْ فَما هُمْ بِمُعْجِزِينَ أَوْ يَأْخُذَهُمْ عَلى تَخَوُّفٍ",
          "فَاحْذَرُوا مَا حَذَّرَكُمُ اللَّهُ بِمَا فَعَلَ بِالظَّلَمَةِ فِي كِتَابِهِ وَ لَا تَأْمَنُوا أَنْ يُنْزِلَ بِكُمْ بَعْضَ مَا تَوَاعَدَ بِهِ الْقَوْمَ الظَّالِمِينَ فِي الْكِتَابِ وَ اللَّهِ لَقَدْ وَعَظَكُمُ اللَّهُ فِي كِتَابِهِ بِغَيْرِكُمْ فَإِنَّ السَّعِيدَ مَنْ وُعِظَ بِغَيْرِهِ وَ لَقَدْ أَسْمَعَكُمُ اللَّهُ فِي كِتَابِهِ مَا قَدْ فَعَلَ بِالْقَوْمِ الظَّالِمِينَ مِنْ أَهْلِ الْقُرَى قَبْلَكُمْ حَيْثُ قَالَ وَ كَمْ قَصَمْنا مِنْ قَرْيَةٍ كانَتْ ظالِمَةً وَ إِنَّمَا عَنَى بِالْقَرْيَةِ أَهْلَهَا حَيْثُ يَقُولُ وَ أَنْشَأْنا بَعْدَها قَوْماً آخَرِينَ فَقَالَ عَزَّ وَ جَلَّ فَلَمَّا أَحَسُّوا بَأْسَنا إِذا هُمْ مِنْها يَرْكُضُونَ يَعْنِي يَهْرُبُونَ قَالَ لا تَرْكُضُوا وَ ارْجِعُوا إِلى ما أُتْرِفْتُمْ فِيهِ وَ مَساكِنِكُمْ لَعَلَّكُمْ تُسْئَلُونَ فَلَمَّا أَتَاهُمُ الْعَذَابُ قالُوا يا وَيْلَنا إِنَّا كُنَّا ظالِمِينَ فَما زاَلَتْ تِلْكَ دَعْواهُمْ حَتَّى جَعَلْناهُمْ حَصِيداً خامِدِينَ ",
          "وَ ايْمُ اللَّهِ إِنَّ هَذِهِ عِظَةٌ لَكُمْ وَ تَخْوِيفٌ إِنِ اتَّعَظْتُمْ وَ خِفْتُمْ ثُمَّ رَجَعَ الْقَوْلُ مِنَ اللَّهِ فِي الْكِتَابِ عَلَى أَهْلِ الْمَعَاصِي وَ الذُّنُوبِ فَقَالَ عَزَّ وَ جَلَّ وَ لَئِنْ مَسَّتْهُمْ نَفْحَةٌ مِنْ عَذابِ رَبِّكَ لَيَقُولُنَّ يا وَيْلَنا إِنَّا كُنَّا ظالِمِينَ فَإِنْ قُلْتُمْ أَيُّهَا النَّاسُ إِنَّ اللَّهَ عَزَّ وَ جَلَّ إِنَّمَا عَنَى بِهَذَا أَهْلَ الشِّرْكِ فَكَيْفَ ذَلِكَ وَ هُوَ يَقُولُ وَ نَضَعُ الْمَوازِينَ الْقِسْطَ لِيَوْمِ الْقِيامَةِ فَلا تُظْلَمُ نَفْسٌ شَيْئاً وَ إِنْ كانَ مِثْقالَ حَبَّةٍ مِنْ خَرْدَلٍ أَتَيْنا بِها وَ كَفى بِنا حاسِبِينَ اعْلَمُوا عِبَادَ اللَّهِ أَنَّ أَهْلَ الشِّرْكِ لَا يُنْصَبُ لَهُمُ الْمَوَازِينُ وَ لَا يُنْشَرُ لَهُمُ الدَّوَاوِينُ وَ إِنَّمَا يُحْشَرُونَ إِلَى جَهَنَّمَ زُمَراً وَ إِنَّمَا نَصْبُ الْمَوَازِينِ وَ نَشْرُ الدَّوَاوِينِ لِأَهْلِ الْإِسْلَامِ ",
          "فَاتَّقُوا اللَّهَ عِبَادَ اللَّهِ وَ اعْلَمُوا أَنَّ اللَّهَ عَزَّ وَ جَلَّ لَمْ يُحِبَّ زَهْرَةَ الدُّنْيَا وَ عَاجِلَهَا لِأَحَدٍ مِنْ أَوْلِيَائِهِ وَ لَمْ يُرَغِّبْهُمْ فِيهَا وَ فِي عَاجِلِ زَهْرَتِهَا وَ ظَاهِرِ بَهْجَتِهَا وَ إِنَّمَا خَلَقَ الدُّنْيَا وَ خَلَقَ أَهْلَهَا لِيَبْلُوَهُمْ فِيهَا أَيُّهُمْ أَحْسَنُ عَمَلًا لآِخِرَتِهِ وَ ايْمُ اللَّهِ لَقَدْ ضَرَبَ لَكُمْ فِيهِ الْأَمْثَالَ وَ صَرَّفَ الْآيَاتِ لِقَوْمٍ يَعْقِلُونَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ ",
          "فَازْهَدُوا فِيمَا زَهَّدَكُمُ اللَّهُ عَزَّ وَ جَلَّ فِيهِ مِنْ عَاجِلِ الْحَيَاةِ الدُّنْيَا فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ وَ قَوْلُهُ الْحَقُّ إِنَّما مَثَلُ الْحَياةِ الدُّنْيا كَماءٍ أَنْزَلْناهُ مِنَ السَّماءِ فَاخْتَلَطَ بِهِ نَباتُ الْأَرْضِ مِمَّا يَأْكُلُ النَّاسُ وَ الْأَنْعامُ حَتَّى إِذا أَخَذَتِ الْأَرْضُ زُخْرُفَها وَ ازَّيَّنَتْ وَ ظَنَّ أَهْلُها أَنَّهُمْ قادِرُونَ عَلَيْها أَتاها أَمْرُنا لَيْلًا أَوْ نَهاراً فَجَعَلْناها حَصِيداً كَأَنْ لَمْ تَغْنَ بِالْأَمْسِ كَذلِكَ نُفَصِّلُ الْآياتِ لِقَوْمٍ يَتَفَكَّرُونَ ",
          "فَكُونُوا عِبَادَ اللَّهِ مِنَ الْقَوْمِ الَّذِينَ يَتَفَكَّرُونَ وَ لَا تَرْكَنُوا إِلَى الدُّنْيَا فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ قَالَ لِمُحَمَّدٍ ( صلى الله عليه وآله ) وَ لا تَرْكَنُوا إِلَى الَّذِينَ ظَلَمُوا فَتَمَسَّكُمُ النَّارُ وَ لَا تَرْكَنُوا إِلَى زَهْرَةِ الدُّنْيَا وَ مَا فِيهَا رُكُونَ مَنِ اتَّخَذَهَا دَارَ قَرَارٍ وَ مَنْزِلَ اسْتِيطَانٍ فَإِنَّهَا دَارُ بُلْغَةٍ وَ مَنْزِلُ قُلْعَةٍ وَ دَارُ عَمَلٍ فَتَزَوَّدُوا الْأَعْمَالَ الصَّالِحَةَ فِيهَا قَبْلَ تَفَرُّقِ أَيَّامِهَا وَ قَبْلَ الْإِذْنِ مِنَ اللَّهِ فِي خَرَابِهَا فَكَانَ قَدْ أَخْرَبَهَا الَّذِي عَمَرَهَا أَوَّلَ مَرَّةٍ وَ ابْتَدَأَهَا وَ هُوَ وَلِيُّ مِيرَاثِهَا ",
          "فَأَسْأَلُ اللَّهَ الْعَوْنَ لَنَا وَ لَكُمْ عَلَى تَزَوُّدِ التَّقْوَى وَ الزُّهْدِ فِيهَا جَعَلَنَا اللَّهُ وَ إِيَّاكُمْ مِنَ الزَّاهِدِينَ فِي عَاجِلِ زَهْرَةِ الْحَيَاةِ الدُّنْيَا الرَّاغِبِينَ لآِجِلِ ثَوَابِ الْآخِرَةِ فَإِنَّمَا نَحْنُ بِهِ وَ لَهُ وَ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ النَّبِيِّ وَ آلِهِ وَ سَلَّمَ وَ السَّلَامُ عَلَيْكُمْ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473128\">H 14477</a> – Narrated to me Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, and Ali Bin Ibrahim, from his father altogether from Al-Hassan Bin Mahboub, from Abdullah Bin Ghalib Al-Asady from his father, from Saeed Bin Al-Musayyab who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>li Bin Al-Husayn</span><sup>asws</sup> used to advise the people and to make them to be ascetic in this world and incline them towards the deeds for the Hereafter by this speech in every Friday in the Masjid of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> which was preserved and written down.",
            "He<sup>asws</sup> would say: ‘O you people! Fear Allah<sup>azwj</sup> and know that you will be returning to Him<sup>azwj</sup>. So each soul would find what it had done in this world from the good in recorded form, and what it had done from the evil even though there would have been between it and itself a long time. And Allah<sup>azwj</sup> Himself<sup>azwj</sup> has Cautioned you, and woe be unto you O oblivious<a id=\"_ftnref11\"></a><sup>[11]</sup> son of Adam<sup>as</sup> for He<sup>azwj</sup> is not Oblivious of you. ",
            "O son of Adam<sup>as</sup>, your death is the quickest thing coming towards you seeking you in an aggressive manner. It would be around you when your time elapses and the Angel would capture your soul and take you to your grave alone. It would then return your soul back to you in it, and two Angels would storm into it, <span class=\"iTxt\">Naakir</span> and <span class=\"iTxt\">Nakeer</span> to question you and test you severely.",
            "And indeed! the first thing what they will ask you would be about your Lord<sup>azwj</sup> which you had worshipped, and about your Prophet<sup>saww</sup> who<sup>saww</sup> was sent to you, and about your Religion which you had made it to be, and about your Book which you recited, and about your Imam<sup>asws</sup> whom you had befriended. Then about your life what you had spent it on, and your wealth from where you had acquired it and in what you had spent it on. ",
            "So take caution and look at yourself, and prepare the answers before the examination, and the questioning, and the test. So if you are a Believer having understood your Religion, followed the truthful ones<sup>asws</sup>, befriended the friends of Allah<sup>azwj</sup>, Allah<sup>azwj</sup> will Provide your argument for you, and make your tongue to speak correctly and give good answers, and you will receive the news of the happiness and the Paradise from Allah<sup>azwj</sup> Mighty and Majestic. And the Angels will welcome you with joyful spirits and aromatic fragrance. If you do not become like that, your tongue will waver, and your argument will fail, and you will be unable to answer, and you will receive news of the Fire, and the Angels of Punishment will drag you into the Hell and its intense heat. ",
            "And know, O son of Adam<sup>as</sup> that what is coming behind you on the Day of Judgement is greater and more shocking and painful for the heart. That is the Day in which all people would be Gathered and that is the Day of Witnessing. Allah<sup>azwj</sup> Mighty and Majestic will Gather in it the former ones and the later ones. That is the Day in which the Trumpet would be Blown and the graves would be scattered. And that is the Day of tremors and the hearts would come up to the throat and the stumbling would not be reduced, and no ransom would be taken from anyone, and no excuses would be acceptable from anyone, and no repentance would be Accepted from anyone. ",
            "There is nothing except for the Recompense for the good deeds and the Recompense for the evil deeds. So the one who was from the Believers having done a good deed in this world the weight of an atom would find it, and the one was from the Believers having done an evil deed in this world the weight of an atom would find it too.",
            "So be cautious, O you people from the sins and the disobedience to what Allah<sup>azwj</sup> has Forbidden you from and Cautioned you in His<sup>azwj</sup> Truthful Book, and the Speaking Proofs<sup>asws</sup>. And do not feel secure from the Abhorrence of Allah<sup>azwj</sup> and His<sup>azwj</sup> Cautions and His<sup>azwj</sup> Threats from what the accursed Satan<sup>la</sup> calls you to himself<sup>la</sup> from the desires of short duration and the pleasures in this world, for Allah<sup>azwj</sup> Mighty and Majestic Said: <span class=\"ibTxt\">“[7:201] Surely those who guard (against evil), when a visitation from the Shaitan afflicts them they become mindful, then lo! they see”</span>.",
            "You must get your hearts to feel the fear of Allah<sup>azwj</sup> and remember what He<sup>azwj</sup> has Promised you regarding your returning to Him<sup>azwj</sup> from the good Rewards from Him<sup>azwj</sup>, just as you fear the harsh Punishment, for the one who fears something would be cautious of it, and the one who is cautious of something would avoid it. And do not become of the oblivious ones, the ones inclined towards the flowers of the world of those who devise evil, for Allah<sup>azwj</sup> Said in His<sup>azwj</sup> Decisive Book: <span class=\"ibTxt\">“[16:45] Do they then who plan evil (deeds) feel secure (of this) that Allah will not cause the earth to swallow them or that punishment may not overtake them from whence they do not perceive? [16:46] Or that He may not seize them in the course of their journeys, then shall they not escape; [16:47] Or that He may not seize them by causing them to suffer gradual loss”</span>",
            "So be cautious of what Allah<sup>azwj</sup> has Cautioned you with what He<sup>azwj</sup> has Done with the unjust ones in His<sup>azwj</sup> Book, and do not feel secure from what has been Promised for the unjust people in the Book. By Allah<sup>azwj</sup>, Allah<sup>azwj</sup> has Advised you all in His<sup>azwj</sup> Book by way of other people. So, happy is the one who takes a lesson from the advice given to others. ",
            "Allah<sup>azwj</sup> has Made you hear in His<sup>azwj</sup> Book what He<sup>azwj</sup> has Done with the unjust people of the town before you where He<sup>azwj</sup> said: <span class=\"ibTxt\">“[21:11] And how many a town which was iniquitous did We demolish”</span>, but rather what is Meant by the ‘town’ is its inhabitants, where He<sup>azwj</sup> Said: <span class=\"ibTxt\">“[21:11] and We raised up after it another people!”</span>. Allah<sup>azwj</sup> Mighty and Majestic Said: <span class=\"ibTxt\">“[21:12] Yet, when they felt Our Punishment (coming), behold, they (tried to) flee from it. [21:13] Flee not, but return to the good things of this life which were given you, and to your homes in order that ye may be called to account.”</span> So when the Punishment Came upon them, they said <span class=\"ibTxt\">“[21:14] They said: O woe to us! surely we were unjust [21:15] And that cry of theirs ceased not, till We made them as a field that is mown, as ashes silent and quenched”</span>.",
            "By Allah<sup>azwj</sup>, let this be an Advice for you and a Warning that you should heed and fear. Then refer to the Words from Allah<sup>azwj</sup> in His<sup>azwj</sup> Book against the people of disobedience and the sins. Allah<sup>azwj</sup> Mighty and Majestic Said: <span class=\"ibTxt\">“[21:46] And if a blast of the chastisement of your Lord were to touch them, they will certainly say: O woe to us! surely we were unjust”</span>. ",
            "O you people! If you were to say that Allah<sup>azwj</sup> Mighty and Majestic has Meant by this the people of the ‘Mushriqeen’ (Polytheism), so how can that be and He<sup>azwj</sup> Says: <span class=\"ibTxt\">“[21:47] And We will set up a just balance on the day of resurrection, so no soul shall be dealt with unjustly in the least; and though there be the weight of a grain of mustard seed, (yet) will We bring it, and sufficient are We to take account.”</span> Know, O servants of Allah<sup>azwj</sup>, that the people of the Polytheism will not have a Balance set up for them nor will their Register (of deeds) be published and they will be herded to Hell in groups, but rather the Balance and the publishing of the Register (of deeds) will be for the people of Al-Islam. ",
            "So fear Allah<sup>azwj</sup>, O servants of Allah<sup>azwj</sup> and know that Allah<sup>azwj</sup> Mighty and Majestic does not Love the blossoms of the world and its temporal matters for anyone of His<sup>azwj</sup> friends and does not Encourage them with regards to it and regarding its temporary blossoms and apparent delights. But rather, He<sup>azwj</sup> Created the world and Created its people so that they may be Tested therein as to which one of them is good in deeds for his Hereafter. And by Allah<sup>azwj</sup>, He<sup>azwj</sup> has Struck examples for you with regards to it and Presented Signs for the people of intellect, and there is no Strength except by Allah<sup>azwj</sup>.  ",
            "So abstain yourselves from what Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic has Told you to abstain from regarding the temporary life of the world, for Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic has Said, and His<sup style=\"font-weight: normal\">azwj</sup> Words are the Truth: <span class=\"ibTxt\">“[10:24] The likeness of the life of the present is as the rain which We send down from the skies: by its mingling arises the produce of the earth- which provides food for men and animals: (It grows) till the earth is clad with its golden ornaments and is decked out (in beauty): the people to whom it belongs think they have all powers of disposal over it: There reaches it Our command by night or by day, and We make it like a harvest clean-mown, as if it had not flourished only the day before! thus do We explain the Signs in detail for those who reflect.”</span>",
            "Servants of Allah<sup>azwj</sup>! become of the people who reflect and do not incline towards the world, for Allah<sup>azwj</sup> Mighty and Majestic Said to Muhammad<sup>saww</sup>: <span class=\"ibTxt\">“[11:113] And do not incline to those who are unjust, lest the fire touch you,”</span>, and do not incline towards the blossoms of the world and what is in it, like those who have taken it to be a house of permanent settlement for it is a lowly house, a shabby home, and a place of deeds. So make provisions in it of the good deeds before its days disperse and before the Call from Allah<sup>azwj</sup> for its destruction, for the One<sup>azwj</sup> Who Destroys it is the One<sup>azwj</sup> Who Built it in the first place and initiated it and He<sup>azwj</sup> is the Guardian of its inheritance. ",
            "So I hereby ask Allah<sup>azwj</sup> for the Support for us<sup>asws</sup> and for you all for the provisions of the piety and the restraint and may Allah<sup>azwj</sup> Make us<sup>asws</sup> and you to be of the ascetics with regards to the blossoms of the life of the world and of those who are hopeful for the Rewards of the Hereafter, for we are with Him<sup>azwj</sup> and for Him<sup>azwj</sup>. And Greetings of peace be upon Muhammad<sup>saww</sup> the Prophet and his<sup>saww</sup> Progeny<sup>asws</sup> and peace, and peace be upon you all and the Mercy of Allah<sup>azwj</sup> and His<sup>azwj</sup> Blessings’."
          ],
          "en.sarwar": [
            "29. Narrated to me Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, and Ali Bin Ibrahim, from his father altogether from Al-Hassan Bin Mahboub, from Abdullah Bin Ghalib Al-Asady from his father, from Saeed Bin Al-Musayyab who said: ‘Ali Bin Al-Husayn (a.s.) used to advise the people and to make them to be ascetic in this world and incline them towards the deeds for the Hereafter by this speech in every Friday in the Masjid of the Messenger (saww) of Allah (azwj) which was preserved and written down. He (a.s.) would say: ‘O you people! Fear Allah (azwj) and know that you will be returning to Him (azwj). So each soul would find what it had done in this world from the good in recorded form, and what it had done from the evil even though there would have been between it and itself a long time. And Allah (azwj) Himself (azwj) has Cautioned you, and woe be unto you O oblivious son of Adam (as) for He (azwj) is not Oblivious of you. O son of Adam (as), your death is the quickest thing coming towards you seeking you in an aggressive manner. It would be around you when your time elapses and the Angel would capture your soul and take you to your grave alone. It would then return your soul back to you in it, and two Angels would storm into it, Naakir and Nakeer to question you and test you severely. And indeed! the first thing what they will ask you would be about your Lord (azwj) which you had worshipped, and about your Prophet (saww) who (saww) was sent to you, and about your Religion which you had made it to be, and about your Book which you recited, and about your Imam (a.s.) whom you had befriended. Then about your life what you had spent it on, and your wealth from where you had acquired it and in what you had spent it on. So take caution and look at yourself, and prepare the answers before the examination, and the questioning, and the test. So if you are a Believer having understood your Religion, followed the truthful ones (a.s.), befriended the friends of Allah (azwj), Allah (azwj) will Provide your argument for you, and make your tongue to speak correctly and give good answers, and you will receive the news of the happiness and the Paradise from Allah (azwj) Mighty and Majestic. And the Angels will welcome you with joyful spirits and aromatic fragrance. If you do not become like that, your tongue will waver, and your argument will fail, and you will be unable to answer, and you will receive news of the Fire, and the Angels of Punishment will drag you into the Hell and its intense heat. And know, O son of Adam (as) that what is coming behind you on the Day of Judgement is greater and more shocking and painful for the heart. That is the Day in which all people would be Gathered and that is the Day of Witnessing. Allah (azwj) Mighty and Majestic will Gather in it the former ones and the later ones. That is the Day in which the Trumpet would be Blown and the graves would be scattered. And that is the Day of tremors and the hearts would come up to the throat and the stumbling would not be reduced, and no ransom would be taken from anyone, and no excuses would be acceptable from anyone, and no repentance would be Accepted from anyone. There is nothing except for the Recompense for the good deeds and the Recompense for the evil deeds. So the one who was from the Believers having done a good deed in this world the weight of an atom would find it, and the one was from the Believers having done an evil deed in this world the weight of an atom would find it too. So be cautious, O you people from the sins and the disobedience to what Allah (azwj) has Forbidden you from and Cautioned you in His (azwj) Truthful Book, and the Speaking Proofs (a.s.). And do not feel secure from the Abhorrence of Allah (azwj) and His (azwj) Cautions and His (azwj) Threats from what the accursed Satan (la) calls you to himself (la) from the desires of short duration and the pleasures in this world, for Allah (azwj) Mighty and Majestic Said: “[7:201] Surely those who guard (against evil), when a visitation from the Shaitan afflicts them they become mindful, then lo! they see”. You must get your hearts to feel the fear of Allah (azwj) and remember what He (azwj) has Promised you regarding your returning to Him (azwj) from the good Rewards from Him (azwj), just as you fear the harsh Punishment, for the one who fears something would be cautious of it, and the one who is cautious of something would avoid it. And do not become of the oblivious ones, the ones inclined towards the flowers of the world of those who devise evil, for Allah (azwj) Said in His (azwj) Decisive Book: “[16:45] Do they then who plan evil (deeds) feel secure (of this) that Allah will not cause the earth to swallow them or that punishment may not overtake them from whence they do not perceive? [16:46] Or that He may not seize them in the course of their journeys, then shall they not escape; [16:47] Or that He may not seize them by causing them to suffer gradual loss” So be cautious of what Allah (azwj) has Cautioned you with what He (azwj) has Done with the unjust ones in His (azwj) Book, and do not feel secure from what has been Promised for the unjust people in the Book. By Allah (azwj), Allah (azwj) has Advised you all in His (azwj) Book by way of other people. So, happy is the one who takes a lesson from the advice given to others. Allah (azwj) has Made you hear in His (azwj) Book what He (azwj) has Done with the unjust people of the town before you where He (azwj) said: “[21:11] And how many a town which was iniquitous did We demolish”, but rather what is Meant by the ‘town’ is its inhabitants, where He (azwj) Said: “[21:11] and We raised up after it another people!”. Allah (azwj) Mighty and Majestic Said: “[21:12] Yet, when they felt Our Punishment (coming), behold, they (tried to) flee from it. [21:13] Flee not, but return to the good things of this life which were given you, and to your homes in order that ye may be called to account.” So when the Punishment Came upon them, they said “[21:14] They said: O woe to us! surely we were unjust [21:15] And that cry of theirs ceased not, till We made them as a field that is mown, as ashes silent and quenched”. By Allah (azwj), let this be an Advice for you and a Warning that you should heed and fear. Then refer to the Words from Allah (azwj) in His (azwj) Book against the people of disobedience and the sins. Allah (azwj) Mighty and Majestic Said: “[21:46] And if a blast of the chastisement of your Lord were to touch them, they will certainly say: O woe to us! surely we were unjust”. O you people! If you were to say that Allah (azwj) Mighty and Majestic has Meant by this the people of the ‘Mushriqeen’ (Polytheism), so how can that be and He (azwj) Says: “[21:47] And We will set up a just balance on the day of resurrection, so no soul shall be dealt with unjustly in the least; and though there be the weight of a grain of mustard seed, (yet) will We bring it, and sufficient are We to take account.” Know, O servants of Allah (azwj), that the people of the Polytheism will not have a Balance set up for them nor will their Register (of deeds) be published and they will be herded to Hell in groups, but rather the Balance and the publishing of the Register (of deeds) will be for the people of Al-Islam. So fear Allah (azwj), O servants of Allah (azwj) and know that Allah (azwj) Mighty and Majestic does not Love the blossoms of the world and its temporal matters for anyone of His (azwj) friends and does not Encourage them with regards to it and regarding its temporary blossoms and apparent delights. But rather, He (azwj) Created the world and Created its people so that they may be Tested therein as to which one of them is good in deeds for his Hereafter. And by Allah (azwj), He (azwj) has Struck examples for you with regards to it and Presented Signs for the people of intellect, and there is no Strength except by Allah (azwj). So abstain yourselves from what Allah (azwj) Mighty and Majestic has Told you to abstain from regarding the temporary life of the world, for Allah (azwj) Mighty and Majestic has Said, and His (azwj) Words are the Truth: “[10:24] The likeness of the life of the present is as the rain which We send down from the skies: by its mingling arises the produce of the earth- which provides food for men and animals: (It grows) till the earth is clad with its golden ornaments and is decked out (in beauty): the people to whom it belongs think they have all powers of disposal over it: There reaches it Our command by night or by day, and We make it like a harvest clean-mown, as if it had not flourished only the day before! thus do We explain the Signs in detail for those who reflect.” Servants of Allah (azwj)! become of the people who reflect and do not incline towards the world, for Allah (azwj) Mighty and Majestic Said to Muhammad (saww): “[11:113] And do not incline to those who are unjust, lest the fire touch you,”, and do not incline towards the blossoms of the world and what is in it, like those who have taken it to be a house of permanent settlement for it is a lowly house, a shabby home, and a place of deeds. So make provisions in it of the good deeds before its days disperse and before the Call from Allah (azwj) for its destruction, for the One (azwj) Who Destroys it is the One (azwj) Who Built it in the first place and initiated it and He (azwj) is the Guardian of its inheritance. So I hereby ask Allah (azwj) for the Support for us (a.s.) and for you all for the provisions of the piety and the restraint and may Allah (azwj) Make us (a.s.) and you to be of the ascetics with regards to the blossoms of the life of the world and of those who are hopeful for the Rewards of the Hereafter, for we are with Him (azwj) and for Him (azwj). And Greetings of peace be upon Muhammad (saww) the Prophet and his (saww) Progeny (a.s.) and peace, and peace be upon you all and the Mercy of Allah (azwj) and His (azwj) Blessings’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:14",
  "kind": "verse_list"
}