{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 15"
        },
        "path": "/books/al-kafi:8:1:15",
        "titles": {
          "ar": "حَدِيثُ الشَّيْخِ مَعَ الْبَاقِرِ ( عليه السلام )",
          "en": "HADEETH OF THE OLD MAN WITH AL-BAQIR <sup>asws</sup>"
        }
      }
    ],
    "index": 2286,
    "local_index": 15,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 16"
        },
        "path": "/books/al-kafi:8:1:16",
        "titles": {
          "ar": "قِصَّةُ صَاحِبِ الزَّيْتِ",
          "en": "STORY OF THE OIL TRADER"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:8:1:14",
        "titles": {
          "ar": "كَلَامُ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام )",
          "en": "SPEECH OF ALI BIN AL-HUSAYN <sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:15",
    "titles": {
      "ar": "حَدِيثُ الشَّيْخِ مَعَ الْبَاقِرِ ( عليه السلام )",
      "en": "HADEETH OF THE OLD MAN WITH AL-BAQIR <sup>asws</sup>"
    },
    "verse_count": 1,
    "verse_start_index": 14713,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 176)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14714,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:15:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14478</span>-  مُحَمَّدُ بْنُ</span> يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ حَدَّثَنِي رَجُلٌ مِنْ أَصْحَابِنَا عَنِ الْحَكَمِ بْنِ عُتَيْبَةَ قَالَ بَيْنَا أَنَا مَعَ أَبِي جَعْفَرٍ ( عليه السلام ) وَ الْبَيْتُ غَاصٌّ بِأَهْلِهِ إِذْ أَقْبَلَ شَيْخٌ يَتَوَكَّأُ عَلَى عَنَزَةٍ لَهُ حَتَّى وَقَفَ عَلَى بَابِ الْبَيْتِ فَقَالَ السَّلَامُ عَلَيْكَ يَا ابْنَ رَسُولِ اللَّهِ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ ثُمَّ سَكَتَ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) وَ عَلَيْكَ السَّلَامُ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ ثُمَّ أَقْبَلَ الشَّيْخُ بِوَجْهِهِ عَلَى أَهْلِ الْبَيْتِ وَ قَالَ السَّلَامُ عَلَيْكُمْ ثُمَّ سَكَتَ حَتَّى أَجَابَهُ الْقَوْمُ جَمِيعاً وَ رَدُّوا عَلَيْهِ السَّلَامَ ",
          "ثُمَّ أَقْبَلَ بِوَجْهِهِ عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) ثُمَّ قَالَ يَا ابْنَ رَسُولِ اللَّهِ أَدْنِنِي مِنْكَ جَعَلَنِيَ اللَّهُ فِدَاكَ فَوَ اللَّهِ إِنِّي لَأُحِبُّكُمْ وَ أُحِبُّ مَنْ يُحِبُّكُمْ وَ وَ اللَّهِ مَا أُحِبُّكُمْ وَ أُحِبُّ مَنْ يُحِبُّكُمْ لِطَمَعٍ فِي دُنْيَا وَ [اللَّهِ] إِنِّي لَأُبْغِضُ عَدُوَّكُمْ وَ أَبْرَأُ مِنْهُ وَ وَ اللَّهِ مَا أُبْغِضُهُ وَ أَبْرَأُ مِنْهُ لِوَتْرٍ كَانَ بَيْنِي وَ بَيْنَهُ وَ اللَّهِ إِنِّي لَأُحِلُّ حَلَالَكُمْ وَ أُحَرِّمُ حَرَامَكُمْ وَ أَنْتَظِرُ أَمْرَكُمْ فَهَلْ تَرْجُو لِي جَعَلَنِيَ اللَّهُ فِدَاكَ",
          "فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) إِلَيَّ إِلَيَّ حَتَّى أَقْعَدَهُ إِلَى جَنْبِهِ ثُمَّ قَالَ أَيُّهَا الشَّيْخُ إِنَّ أَبِي عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) أَتَاهُ رَجُلٌ فَسَأَلَهُ عَنْ مِثْلِ الَّذِي سَأَلْتَنِي عَنْهُ فَقَالَ لَهُ أَبِي ( عليه السلام ) إِنْ تَمُتْ تَرِدُ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ عَلَى عَلِيٍّ وَ الْحَسَنِ وَ الْحُسَيْنِ وَ عَلِيِّ بْنِ الْحُسَيْنِ وَ يَثْلَجُ قَلْبُكَ وَ يَبْرُدُ فُؤَادُكَ وَ تَقَرُّ عَيْنُكَ وَ تُسْتَقْبَلُ بِالرَّوْحِ وَ الرَّيْحَانِ مَعَ الْكِرَامِ الْكَاتِبِينَ لَوْ قَدْ بَلَغَتْ نَفْسُكَ هَاهُنَا وَ أَهْوَى بِيَدِهِ إِلَى حَلْقِهِ وَ إِنْ تَعِشْ تَرَى مَا يُقِرُّ اللَّهُ بِهِ عَيْنَكَ وَ تَكُونُ مَعَنَا فِي السَّنَامِ الْأَعْلَى فَقَالَ الشَّيْخُ كَيْفَ قُلْتَ يَا أَبَا جَعْفَرٍ فَأَعَادَ عَلَيْهِ الْكَلَامَ",
          "فَقَالَ الشَّيْخُ اللَّهُ أَكْبَرُ يَا أَبَا جَعْفَرٍ إِنْ أَنَا مِتُّ أَرِدُ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ عَلَى عَلِيٍّ وَ الْحَسَنِ وَ الْحُسَيْنِ وَ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) وَ تَقَرُّ عَيْنِي وَ يَثْلَجُ قَلْبِي وَ يَبْرُدُ فُؤَادِي وَ أُسْتَقْبَلُ بِالرَّوْحِ وَ الرَّيْحَانِ مَعَ الْكِرَامِ الْكَاتِبِينَ لَوْ قَدْ بَلَغَتْ نَفْسِي إِلَى هَاهُنَا وَ إِنْ أَعِشْ أَرَى مَا يُقِرُّ اللَّهُ بِهِ عَيْنِي فَأَكُونُ مَعَكُمْ فِي السَّنَامِ الْأَعْلَى",
          "ثُمَّ أَقْبَلَ الشَّيْخُ يَنْتَحِبُ يَنْشِجُ هَا هَا هَا حَتَّى لَصِقَ بِالْأَرْضِ وَ أَقْبَلَ أَهْلُ الْبَيْتِ يَنْتَحِبُونَ وَ يَنْشِجُونَ لِمَا يَرَوْنَ مِنْ حَالِ الشَّيْخِ وَ أَقْبَلَ أَبُو جَعْفَرٍ ( عليه السلام ) يَمْسَحُ بِإِصْبَعِهِ الدُّمُوعَ مِنْ حَمَالِيقِ عَيْنَيْهِ وَ يَنْفُضُهَا ثُمَّ رَفَعَ الشَّيْخُ رَأْسَهُ فَقَالَ لِأَبِي جَعْفَرٍ ( عليه السلام ) يَا ابْنَ رَسُولِ اللَّهِ نَاوِلْنِي يَدَكَ جَعَلَنِيَ اللَّهُ فِدَاكَ فَنَاوَلَهُ يَدَهُ فَقَبَّلَهَا وَ وَضَعَهَا عَلَى عَيْنَيْهِ وَ خَدِّهِ ثُمَّ حَسَرَ عَنْ بَطْنِهِ وَ صَدْرِهِ ثُمَّ قَامَ فَقَالَ السَّلَامُ عَلَيْكُمْ",
          "وَ أَقْبَلَ أَبُو جَعْفَرٍ ( عليه السلام ) يَنْظُرُ فِي قَفَاهُ وَ هُوَ مُدْبِرٌ ثُمَّ أَقْبَلَ بِوَجْهِهِ عَلَى الْقَوْمِ فَقَالَ مَنْ أَحَبَّ أَنْ يَنْظُرَ إِلَى رَجُلٍ مِنْ أَهْلِ الْجَنَّةِ فَلْيَنْظُرْ إِلَى هَذَا فَقَالَ الْحَكَمُ بْنُ عُتَيْبَةَ لَمْ أَرَ مَأْتَماً قَطُّ يُشْبِهُ ذَلِكَ الْمَجْلِسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473130\">H 14478</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Sinan, from Is’haq Bin Ammar who said, ‘Narrated to me a man from our companions’, from Al-Hakam Bin Uteyba who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> was with Abu Ja’far</span><sup>asws</sup> and the house was full of its people when an old man (Sheykh) came up leaning upon his goat (for support) until he paused at the door of the house. He said, ‘Salam un Allaika’ ‘Peace be upon you O son<sup>asws</sup> of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> and Mercy of Allah<sup>azwj</sup> and His<sup>azwj</sup> Blessings’. Then he was quiet. Abu Ja’far<sup>asws</sup> said: ‘And peace be upon you and Mercy of Allah<sup>azwj</sup> and His<sup>azwj</sup> Blessings’. Then the old man turned his face toward the people of the house and said, ‘Peace be upon you’. Then he was quiet until all the people had answered him and returned his greetings.",
            "Then he turned his face towards Abu Ja’far<sup>asws</sup>, then said, ‘O son<sup>asws</sup> of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>, allow me (to come near you<sup>asws</sup>), may Allah<sup>azwj</sup> Make me to be sacrificed for you<sup>asws</sup>, for by Allah<sup>azwj</sup>, I love you<sup>asws</sup> and love those who love you<sup>asws</sup>, and by Allah<sup>azwj</sup> I don’t love you<sup>asws</sup> and those who love you<sup>asws</sup> for the greed of the world. By Allah<sup>azwj</sup> I hate your<sup>asws</sup> enemies and keep away from them, and by Allah<sup>azwj</sup> I do not hate them and keep away from them due to the dispute between me and them. By Allah<sup>azwj</sup>, I permit for myself that which you<sup>asws</sup> have made it to be permissible, and prohibit to myself that which you<sup>asws</sup> have made it to be prohibited, and I await your<sup>asws</sup> command. So is there hope for me, may Allah<sup>azwj</sup> Make me to be sacrificed for you?’",
            "Abu Ja’far<sup>asws</sup> said: ‘Come near, come near’, until he<sup>asw</sup><sup>s</sup> seated him by his<sup>asws</sup> side, then said: ‘O you old man, a man came to my<sup>asws</sup> father<sup>asws</sup> Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> and asked him similar to what you has asked me<sup>asws</sup>. So my<sup>asws</sup> father<sup>asws</sup> said to him: ‘If you were to die you would return to the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>, and to Ali<sup>asws</sup>, and Al-Hassan<sup>asws</sup>, and Al-Husayn<sup>asws</sup>, and Ali Bin Al-Husayn<sup>asws</sup>. Your heart would be in delight and it would be cooled at what your eyes would recognise, and you would be welcomed by the Spirit and the fragrance along with the Honourable Scribes. If your soul reaches here’ – and he<sup>asws</sup> indicated by his<sup>asws</sup> hand to his<sup>asws</sup> throat – ‘and when you live you will see what delights Allah<sup>azwj</sup> has Kept for your eyes, and you will be with us<sup>asws</sup> in the highest peak’. The old man said, ‘What did you<sup>asws</sup> say, O Abu Ja’far<sup>asws</sup>’. So he<sup>asws</sup> repeated the words for him.",
            "The old man said, ‘Allah<sup>a</sup><sup>zwj</sup> is Great! O Abu Ja’far<sup>asws</sup>, if I were to die I would return to the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>, and to Ali<sup>asws</sup>, and Al-Hassan<sup>asws</sup>, and Al-Husayn<sup>asws</sup>, and Ali Bin Al-Husayn<sup>asws</sup>, and my eyes would be delighted, and my heart would be cooled, and I would be welcome by the Spirit and the fragrance along with the Honourable Scribes. If my soul reached up to here, and I will live and see what delights Allah<sup>azwj</sup> has Kept for my eyes, so I would be with you<sup>asws</sup> in the highest peak’.",
            "Then the old man sobbed and wailed saying ‘Haaa, haaa, haaa’, until he rolled upon the ground, and all the people in the house sobbed and wailed upon seeing the condition of the old man, and Abu Ja’far<sup>asws</sup> came and wiped his tears from his eyes with his<sup>asws</sup> finger then flicked them away. Then the old man raised his head so he said to Abu Ja’far<sup>asws</sup>, ‘O son<sup>asws</sup> of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>, give me your<sup>asws</sup> hand, may Allah<sup>azwj</sup> Make me to be sacrificed for you<sup>asws</sup>’. So he<sup>asws</sup> gave him his<sup>asws</sup> hand. So he kissed it and place it upon his eyes and his cheek, then placed it upon his abdomen and his chest. Then he stood up to leave and said, ‘Peace be upon you<sup>asws</sup>’. ",
            "And Abu Ja’far<sup>asws</sup> kissed the scruff of his neck and looked at him when he was leaving. He<sup>asws</sup> then turned his<sup>asws</sup> face towards the people, so he<sup>asws</sup> said: ‘The one who would love to look at a man from the inhabitants of the Paradise, so they should look at this one’. Al-Hakam Al-Uteyba said, ‘I had never seen such mourners at all resembling like that gathering’.",
            "out of 567"
          ],
          "en.sarwar": [
            "30. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Sinan, from Is’haq Bin Ammar who said, ‘Narrated to me a man from our companions’, from Al-Hakam Bin Uteyba who said: ‘I was with Abu Ja’far (a.s.) and the house was full of its people when an old man (Sheykh) came up leaning upon his goat (for support) until he paused at the door of the house. He said, ‘Salam un Allaika’ ‘Peace be upon you O son (a.s.) of the Messenger (saww) of Allah (azwj) and Mercy of Allah (azwj) and His (azwj) Blessings’. Then he was quiet. Abu Ja’far (a.s.) said: ‘And peace be upon you and Mercy of Allah (azwj) and His (azwj) Blessings’. Then the old man turned his face toward the people of the house and said, ‘Peace be upon you’. Then he was quiet until all the people had answered him and returned his greetings. Then he turned his face towards Abu Ja’far (a.s.), then said, ‘O son (a.s.) of the Messenger (saww) of Allah (azwj), allow me (to come near you (a.s.)), may Allah (azwj) Make me to be sacrificed for you (a.s.), for by Allah (azwj), I love you (a.s.) and love those who love you (a.s.), and by Allah (azwj) I don’t love you (a.s.) and those who love you (a.s.) for the greed of the world. By Allah (azwj) I hate your (a.s.) enemies and keep away from them, and by Allah (azwj) I do not hate them and keep away from them due to the dispute between me and them. By Allah (azwj), I permit for myself that which you (a.s.) have made it to be permissible, and prohibit to myself that which you (a.s.) have made it to be prohibited, and I await your (a.s.) command. So is there hope for me, may Allah (azwj) Make me to be sacrificed for you?’ Abu Ja’far (a.s.) said: ‘Come near, come near’, until he (a.s.) seated him by his (a.s.) side, then said: ‘O you old man, a man came to my (a.s.) father (a.s.) Ali (a.s.) Bin Al-Husayn (a.s.) and asked him similar to what you has asked me (a.s.). So my (a.s.) father (a.s.) said to him: ‘If you were to die you would return to the Messenger (saww) of Allah (azwj), and to Ali (a.s.), and Al-Hassan (a.s.), and Al-Husayn (a.s.), and Ali Bin Al-Husayn (a.s.). Your heart would be in delight and it would be cooled at what your eyes would recognise, and you would be welcomed by the Spirit and the fragrance along with the Honourable Scribes. If your soul reaches here’ – and he (a.s.) indicated by his (a.s.) hand to his (a.s.) throat – ‘and when you live you will see what delights Allah (azwj) has Kept for your eyes, and you will be with us (a.s.) in the highest peak’. The old man said, ‘What did you (a.s.) say, O Abu Ja’far (a.s.)’. So he (a.s.) repeated the words for him. The old man said, ‘Allah (azwj) is Great! O Abu Ja’far (a.s.), if I were to die I would return to the Messenger (saww) of Allah (azwj), and to Ali (a.s.), and Al-Hassan (a.s.), and Al-Husayn (a.s.), and Ali Bin Al-Husayn (a.s.), and my eyes would be delighted, and my heart would be cooled, and I would be welcome by the Spirit and the fragrance along with the Honourable Scribes. If my soul reached up to here, and I will live and see what delights Allah (azwj) has Kept for my eyes, so I would be with you (a.s.) in the highest peak’. Then the old man sobbed and wailed saying ‘Haaa, haaa, haaa’, until he rolled upon the ground, and all the people in the house sobbed and wailed upon seeing the condition of the old man, and Abu Ja’far (a.s.) came and wiped his tears from his eyes with his (a.s.) finger then flicked them away. Then the old man raised his head so he said to Abu Ja’far (a.s.), ‘O son (a.s.) of the Messenger (saww) of Allah (azwj), give me your (a.s.) hand, may Allah (azwj) Make me to be sacrificed for you (a.s.)’. So he (a.s.) gave him his (a.s.) hand. So he kissed it and place it upon his eyes and his cheek, then placed it upon his abdomen and his chest. Then he stood up to leave and said, ‘Peace be upon you (a.s.)’. And Abu Ja’far (a.s.) kissed the scruff of his neck and looked at him when he was leaving. He (a.s.) then turned his (a.s.) face towards the people, so he (a.s.) said: ‘The one who would love to look at a man from the inhabitants of the Paradise, so they should look at this one’. Al-Hakam Al-Uteyba said, ‘I had never seen such mourners at all resembling like that gathering’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:15",
  "kind": "verse_list"
}