{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 16"
        },
        "path": "/books/al-kafi:8:1:16",
        "titles": {
          "ar": "قِصَّةُ صَاحِبِ الزَّيْتِ",
          "en": "STORY OF THE OIL TRADER"
        }
      }
    ],
    "index": 2287,
    "local_index": 16,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 17"
        },
        "path": "/books/al-kafi:8:1:17",
        "titles": {
          "ar": "وَصِيَّةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )",
          "en": "THE WILL OF THE PROPHET<sup>saww</sup> TO AMIR-UL-MOMINEEN<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 15"
        },
        "path": "/books/al-kafi:8:1:15",
        "titles": {
          "ar": "حَدِيثُ الشَّيْخِ مَعَ الْبَاقِرِ ( عليه السلام )",
          "en": "HADEETH OF THE OLD MAN WITH AL-BAQIR <sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:16",
    "titles": {
      "ar": "قِصَّةُ صَاحِبِ الزَّيْتِ",
      "en": "STORY OF THE OIL TRADER"
    },
    "verse_count": 2,
    "verse_start_index": 14714,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 178)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14715,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:16:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14479</span>-  عَنْهُ عَنْ أَحْمَدَ</span> بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ رَجُلٌ يَبِيعُ الزَّيْتَ وَ كَانَ يُحِبُّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) حُبّاً شَدِيداً كَانَ إِذَا أَرَادَ أَنْ يَذْهَبَ فِي حَاجَتِهِ لَمْ يَمْضِ حَتَّى يَنْظُرَ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ قَدْ عُرِفَ ذَلِكَ مِنْهُ فَإِذَا جَاءَ تَطَاوَلَ لَهُ حَتَّى يَنْظُرَ إِلَيْهِ حَتَّى إِذَا كَانَتْ ذَاتُ يَوْمٍ دَخَلَ عَلَيْهِ فَتَطَاوَلَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) حَتَّى نَظَرَ إِلَيْهِ ثُمَّ مَضَى فِي حَاجَتِهِ ",
          "فَلَمْ يَكُنْ بِأَسْرَعَ مِنْ أَنْ رَجَعَ فَلَمَّا رَآهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَدْ فَعَلَ ذَلِكَ أَشَارَ إِلَيْهِ بِيَدِهِ اجْلِسْ فَجَلَسَ بَيْنَ يَدَيْهِ فَقَالَ مَا لَكَ فَعَلْتَ الْيَوْمَ شَيْئاً لَمْ تَكُنْ تَفْعَلُهُ قَبْلَ ذَلِكَ فَقَالَ يَا رَسُولَ اللَّهِ وَ الَّذِي بَعَثَكَ بِالْحَقِّ نَبِيّاً لَغَشِيَ قَلْبِي شَيْ‏ءٌ مِنْ ذِكْرِكَ حَتَّى مَا اسْتَطَعْتُ أَنْ أَمْضِيَ فِي حَاجَتِي حَتَّى رَجَعْتُ إِلَيْكَ فَدَعَا لَهُ وَ قَالَ لَهُ خَيْراً ثُمَّ مَكَثَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَيَّاماً لَا يَرَاهُ فَلَمَّا فَقَدَهُ سَأَلَ عَنْهُ فَقِيلَ يَا رَسُولَ اللَّهِ مَا رَأَيْنَاهُ مُنْذُ أَيَّامٍ ",
          "فَانْتَعَلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ انْتَعَلَ مَعَهُ أَصْحَابُهُ وَ انْطَلَقَ حَتَّى أَتَوْا سُوقَ الزَّيْتِ فَإِذَا دُكَّانُ الرَّجُلِ لَيْسَ فِيهِ أَحَدٌ فَسَأَلَ عَنْهُ جِيرَتَهُ فَقَالُوا يَا رَسُولَ اللَّهِ مَاتَ وَ لَقَدْ كَانَ عِنْدَنَا أَمِيناً صَدُوقاً إِلَّا أَنَّهُ قَدْ كَانَ فِيهِ خَصْلَةٌ قَالَ وَ مَا هِيَ قَالُوا كَانَ يَرْهَقُ يَعْنُونَ يَتْبَعُ النِّسَاءَ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) رَحِمَهُ اللَّهُ وَ اللَّهِ لَقَدْ كَانَ يُحِبُّنِي حُبّاً لَوْ كَانَ نَخَّاساً لَغَفَرَ اللَّهُ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473132\">H 14479</a> – From him, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from one of our companions who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘There was a man who used to sell oil, and he used to love the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> with intense love. Whenever he intended to go for his business needs, he would never do it unless he looked at the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> first. He became well known for that for he would stretch himself above others so that he could look at him<sup>saww</sup>. It so happened that one day he came over to him<sup>saww</sup> and stretched out to look at the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> until he saw him<sup>saww</sup>, then he went away for his business needs.",
            "It was not long before he returned. So when the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> saw him do that he<sup>saww</sup> gestured by his<sup>saww</sup> (hand) to beckon him to be seated. So he sat down in front of him<sup>saww</sup>. He<sup>saww</sup> said: ‘What is the matter that you have done something which you had not done before that?’ He said, ‘O Messenger<sup>saww</sup> of Allah<sup>azwj</sup>, by the One<sup>azwj</sup> Who Sent you<sup>saww</sup> with the Truth as a Prophet<sup>saww</sup>, my remembrance of you<sup>saww</sup> overwhelmed my heart to the extent that I did not have the ability to go about my business until I returned to you<sup>saww</sup>’. So he<sup>saww</sup> supplicated for him and wished him well. Then the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> waited a few days but did not see him, so he<sup>saww</sup> asked about him. It was said to him<sup>saww</sup>, ‘O Messenger<sup>saww</sup> of Allah<sup>azwj</sup>, we have not seen him for days’.",
            "So the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> put on his<sup>saww</sup> shoes, and his<sup>saww</sup> companions did the same and walked until he<sup>saww</sup> came to the oil market. At the shop of the man there was no one in it. So he<sup>saww</sup> asked the neighbours about him. They said, ‘O Messenger<sup>saww</sup> of Allah<sup>azwj</sup>, he died, and he used to be a trustworthy one among us and truthful, but he had one (peculiar) habit’. He<sup>saww</sup> said: ‘And what was that?’ They said, ‘He used to exhaust himself following the women’. So the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> said: ‘May Allah<sup>azwj</sup> have Mercy upon him. By Allah<sup>azwj</sup>, he used to love me<sup>saww</sup> with (intense) love. Even if he had been a slave trader, Allah<sup>azwj</sup> would Forgive him’."
          ],
          "en.sarwar": [
            "31. From him, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from one of our companions who said: Abu Abdullah (a.s.) having said: ‘There was a man who used to sell oil, and he used to love the Messenger (saww) of Allah (azwj) with intense love. Whenever he intended to go for his business needs, he would never do it unless he looked at the Messenger (saww) of Allah (azwj) first. He became well known for that for he would stretch himself above others so that he could look at him (saww). It so happened that one day he came over to him (saww) and stretched out to look at the Messenger (saww) of Allah (azwj) until he saw him (saww), then he went away for his business needs. It was not long before he returned. So when the Messenger (saww) of Allah (azwj) saw him do that he (saww) gestured by his (saww) (hand) to beckon him to be seated. So he sat down in front of him (saww). He (saww) said: ‘What is the matter that you have done something which you had not done before that?’ He said, ‘O Messenger (saww) of Allah (azwj), by the One (azwj) Who Sent you (saww) with the Truth as a Prophet (saww), my remembrance of you (saww) overwhelmed my heart to the extent that I did not have the ability to go about my business until I returned to you (saww)’. So he (saww) supplicated for him and wished him well. Then the Messenger (saww) of Allah (azwj) waited a few days but did not see him, so he (saww) asked about him. It was said to him (saww), ‘O Messenger (saww) of Allah (azwj), we have not seen him for days’. So the Messenger (saww) of Allah (azwj) put on his (saww) shoes, and his (saww) companions did the same and walked until he (saww) came to the oil market. At the shop of the man there was no one in it. So he (saww) asked the neighbours about him. They said, ‘O Messenger (saww) of Allah (azwj), he died, and he used to be a trustworthy one among us and truthful, but he had one (peculiar) habit’. He (saww) said: ‘And what was that?’ They said, ‘He used to exhaust himself following the women’. So the Messenger (saww) of Allah (azwj) said: ‘May Allah (azwj) have Mercy upon him. By Allah (azwj), he used to love me (saww) with (intense) love. Even if he had been a slave trader, Allah (azwj) would Forgive him’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق على الظاهر</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5  / 179)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14716,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:16:2",
        "refs": {
          "Quran": [
            "/books/quran:38:63",
            "/books/quran:38:62",
            "/books/quran:38:64"
          ]
        },
        "text": [
          "14480-  عَلِيُّ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ مُيَسِّرٍ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ كَيْفَ أَصْحَابُكَ فَقُلْتُ جُعِلْتُ فِدَاكَ لَنَحْنُ عِنْدَهُمْ أَشَرُّ مِنَ الْيَهُودِ وَ النَّصَارَى وَ الْمَجُوسِ وَ الَّذِينَ أَشْرَكُوا قَالَ وَ كَانَ مُتَّكِئاً فَاسْتَوَى جَالِساً ثُمَّ قَالَ كَيْفَ قُلْتَ قُلْتُ وَ اللَّهِ لَنَحْنُ عِنْدَهُمْ أَشَرُّ مِنَ الْيَهُودِ وَ النَّصَارَى وَ الْمَجُوسِ وَ الَّذِينَ أَشْرَكُوا فَقَالَ أَمَا وَ اللَّهِ لَا تَدْخُلُ النَّارَ مِنْكُمُ اثْنَانِ لَا وَ اللَّهِ وَ لَا وَاحِدٌ وَ اللَّهِ إِنَّكُمُ الَّذِينَ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ قالُوا ما لَنا لا نَرى رِجالًا كُنَّا نَعُدُّهُمْ مِنَ الْأَشْرارِ أَتَّخَذْناهُمْ سِخْرِيًّا أَمْ زاغَتْ عَنْهُمُ الْأَبْصارُ إِنَّ ذلِكَ لَحَقٌّ تَخاصُمُ أَهْلِ النَّارِ ثُمَّ قَالَ طَلَبُوكُمْ وَ اللَّهِ فِي النَّارِ فَمَا وَجَدُوا مِنْكُمْ أَحَداً "
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473133\">H 14480</a> – Ali Bin Muhammad, from Ahmad Bin Abu Abdullah, from Usman Bin Isa, from Muyassar who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> came up to Abu Abdullah</span><sup>asws</sup>. He<sup>asws</sup> said: ‘How are your companions?’ So I said, ‘May I be sacrificed for you<sup>asws</sup>, we (Shiites) are more evil in the people’s eyes than the Jews, and the Christians, and the Magians, and those who associate (Mushriqeen)’. He (the narrator) said, ‘He<sup>asws</sup> had been leaning upon a pillow, so he<sup>asws</sup> sat up straight, then said: ‘How did you say that which you said?’ I said, ‘By Allah<sup>azwj</sup>, we (Shiites) are (considered to be) the most evil ones among them, more so than the Jews and the Christians, and the Magians, and those that associate (Mushriqeen)’. ",
            "He<sup>asws</sup> said: ‘But, by Allah<sup>azwj</sup>, no two of you will enter the Fire. No, by Allah<sup>azwj</sup>, not even one. By Allah<sup>azwj</sup>, you (Shiites) are the ones about whom Allah<sup>azwj</sup> Mighty and Majestic has Said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:38#h62\">[38:62]</a> And they shall say: What is the matter with us that we do not see men whom we used to count among the evil? <a href=\"/#/books/quran:38#h63\">[38:63]</a> Was it that we (only) took them in scorn, or have our eyes (now) turned aside from them? <a href=\"/#/books/quran:38#h64\">[38:64]</a> That most surely is the truth: the contending one with another of the inmates of the fire”</span>. Then he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>, they will be seeking you in the Fire, so they will not find even one of you therein’.",
            "out of 567"
          ],
          "en.sarwar": [
            "32. Ali Bin Muhammad, from Ahmad Bin Abu Abdullah, from Usman Bin Isa, from Muyassar who said: ‘I came up to Abu Abdullah (a.s.). He (a.s.) said: ‘How are your companions?’ So I said, ‘May I be sacrificed for you (a.s.), we (Shiites) are more evil in the people’s eyes than the Jews, and the Christians, and the Magians, and those who associate (Mushriqeen)’. He (the narrator) said, ‘He (a.s.) had been leaning upon a pillow, so he (a.s.) sat up straight, then said: ‘How did you say that which you said?’ I said, ‘By Allah (azwj), we (Shiites) are (considered to be) the most evil ones among them, more so than the Jews and the Christians, and the Magians, and those that associate (Mushriqeen)’. He (a.s.) said: ‘But, by Allah (azwj), no two of you will enter the Fire. No, by Allah (azwj), not even one. By Allah (azwj), you (Shiites) are the ones about whom Allah (azwj) Mighty and Majestic has Said: “<a href=\"/#/books/quran:38#h62\">[38:62]</a> And they shall say: What is the matter with us that we do not see men whom we used to count among the evil? <a href=\"/#/books/quran:38#h63\">[38:63]</a> Was it that we (only) took them in scorn, or have our eyes (now) turned aside from them? <a href=\"/#/books/quran:38#h64\">[38:64]</a> That most surely is the truth: the contending one with another of the inmates of the fire”. Then he (a.s.) said: ‘By Allah (azwj), they will be seeking you in the Fire, so they will not find even one of you therein’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:16",
  "kind": "verse_list"
}