{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 8"}, "path": "/books/al-kafi:8", "titles": {"ar": "الجزء الثامن‏", "en": "Volume Eight"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:8:1", "titles": {"ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;", "en": "The Book - Garden (of Flowers)"}}, {"indexed_titles": {"en": "Chapter 17"}, "path": "/books/al-kafi:8:1:17", "titles": {"ar": "وَصِيَّةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )", "en": "THE WILL OF THE PROPHET<sup>saww</sup> TO AMIR-UL-MOMINEEN<sup>asws</sup>"}}], "index": 2278, "local_index": 17, "part_type": "Chapter", "path": "/books/al-kafi:8:1:17", "titles": {"ar": "وَصِيَّةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )", "en": "THE WILL OF THE PROPHET<sup>saww</sup> TO AMIR-UL-MOMINEEN<sup>asws</sup>"}, "verse_count": 8, "verse_start_index": 14705, "verses": [{"index": 14706, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:8:1:17:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14481</span>-  مُحَمَّدُ بْنُ</span> يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ كَانَ فِي وَصِيَّةِ النَّبِيِّ ( صلى الله عليه وآله ) لِعَلِيٍّ ( عليه السلام ) أَنْ قَالَ يَا عَلِيُّ أُوصِيكَ فِي نَفْسِكَ بِخِصَالٍ فَاحْفَظْهَا عَنِّي \nثُمَّ قَالَ اللَّهُمَّ أَعِنْهُ أَمَّا الْأُولَى فَالصِّدْقُ وَ لَا تَخْرُجَنَّ مِنْ فِيكَ كَذِبَةٌ أَبَداً وَ الثَّانِيَةُ الْوَرَعُ وَ لَا تَجْتَرِئْ عَلَى خِيَانَةٍ أَبَداً وَ الثَّالِثَةُ الْخَوْفُ مِنَ اللَّهِ عَزَّ ذِكْرُهُ كَأَنَّكَ تَرَاهُ وَ الرَّابِعَةُ كَثْرَةُ الْبُكَاءِ مِنْ خَشْيَةِ اللَّهِ يُبْنَى لَكَ بِكُلِّ دَمْعَةٍ أَلْفُ بَيْتٍ فِي الْجَنَّةِ وَ الْخَامِسَةُ بَذْلُكَ مَالَكَ وَ دَمَكَ دُونَ دِينِكَ وَ السَّادِسَةُ الْأَخْذُ بِسُنَّتِي فِي صَلَاتِي وَ صَوْمِي وَ صَدَقَتِي \nأَمَّا الصَّلَاةُ فَالْخَمْسُونَ رَكْعَةً وَ أَمَّا الصِّيَامُ فَثَلَاثَةُ أَيَّامٍ فِي الشَّهْرِ الْخَمِيسُ فِي أَوَّلِهِ وَ الْأَرْبِعَاءُ فِي وَسَطِهِ وَ الْخَمِيسُ فِي آخِرِهِ وَ أَمَّا الصَّدَقَةُ فَجُهْدَكَ حَتَّى تَقُولَ قَدْ أَسْرَفْتُ وَ لَمْ تُسْرِفْ وَ عَلَيْكَ بِصَلَاةِ اللَّيْلِ وَ عَلَيْكَ بِصَلَاةِ الزَّوَالِ وَ عَلَيْكَ بِصَلَاةِ الزَّوَالِ وَ عَلَيْكَ بِصَلَاةِ الزَّوَالِ وَ عَلَيْكَ بِتِلَاوَةِ الْقُرْآنِ عَلَى كُلِّ حَالٍ وَ عَلَيْكَ بِرَفْعِ يَدَيْكَ فِي صَلَاتِكَ وَ تَقْلِيبِهِمَا وَ عَلَيْكَ بِالسِّوَاكِ عِنْدَ كُلِّ وُضُوءٍ وَ عَلَيْكَ بِمَحَاسِنِ الْأَخْلَاقِ فَارْكَبْهَا وَ مَسَاوِي الْأَخْلَاقِ فَاجْتَنِبْهَا فَإِنْ لَمْ تَفْعَلْ فَلَا تَلُومَنَّ إِلَّا نَفْسَكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473135\">H 14481</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-No’man, from Muawiya Bin Ammar who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> heard Abu Abdullah</span> say: ‘There was in the bequest of the Prophet<sup>saww</sup> to Ali<sup>asws</sup> that he<sup>saww</sup> said: ‘O Ali<sup>asws</sup>, I<sup>saww</sup> hereby bequeath you<sup>asws</sup> with regards to yourself<sup>asws</sup> of qualities, so preserve them from me<sup>saww</sup>’.\nThen he<sup>saww</sup> said: ‘Our Allah<sup>azwj</sup>, Support him<sup>asws</sup>. As for the first one is to be truthful, and do not let lies to come out from you<sup>asws</sup> ever. And the second is the piety and do not let yourself<sup>asws</sup> be treacherous ever. And the third is the fear of Allah<sup>azwj</sup>, Mighty is His<sup>azwj</sup> Mention, as if you<sup>asws</sup> can actually see Him<sup>azwj</sup>. And the fourth is the excessive weeping for the fear of Allah<sup>azwj</sup>. There will be built for you<sup>asws</sup>, for every tear drop, a thousand houses in the Paradise. And the fifth is that your<sup>asws</sup> wealth and your<sup>asws</sup> blood is not for other than your<sup>asws</sup> Religion. And the sixth is to take to my<sup>saww</sup> Sunnah with regards to my<sup>saww</sup> Prayer, and my<sup>saww</sup> Fast, and my<sup>saww</sup> charity.\nAs for the Prayer, so it is of fifty Rakaat<a id=\"_ftnref12\"></a><sup>[12]</sup>, and as for the Fasts, so that is for three days in the month, the Thursday in the first part of it, and the Wednesday in the middle of it, and the Thursday in the last part of it. And as for the charity, so you<sup>asws</sup> strive in it to the extent that you<sup>asws</sup> would say: ‘I<sup>asws</sup> have been excessive’, but you<sup>asws</sup> would not have been excessive. And it is on you<sup>asws</sup> to perform the Night Prayer, and it is on you<sup>asws</sup> to perform the Noon Prayer, and it is on you<sup>asws</sup> to perform the Noon Prayer, and it is on you<sup>asws</sup> to perform the Noon Prayer. \nAnd it is on you<sup>asws</sup> to recite the Quran in every condition. And it is on you<sup>asws</sup> to raise your<sup>asws</sup> hands in your<sup>asws</sup> Prayer and turn them both. And it is on you<sup>asws</sup> to brush (your<sup>asws</sup> teeth) during every ablution. And it is on you<sup>asws</sup> to observe the most excellent morals and to abstain from evil manners, for it you<sup>asws</sup> do not do it, so you<sup>asws</sup> should not blame anyone except for yourself<sup>asws</sup>’."}]}, {"index": 14707, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:8:1:17:2", "text": "14482-  عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ بَكْرِ بْنِ صَالِحٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ قَالَ حَدَّثَنِي جَعْفَرُ بْنُ إِبْرَاهِيمَ [بْنِ مُحَمَّدِ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ الطَّيَّارِ] عَنْ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ ( عليهما السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) حَسَبُ الْمَرْءِ دِينُهُ وَ مُرُوءَتُهُ وَ عَقْلُهُ وَ شَرَفُهُ وَ جَمَالُهُ وَ كَرَمُهُ تَقْوَاهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473136\">H 14482</a> – A number of our companions, from Sahl Bin Ziyad, from Bakr Bin Saaleh, from Al-Hassan Bin Ali, from Abdullah Bin Al-Mugheira who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span>t has been narrated</span> to me by Ja’far Bin Ibrahim Bin Muhammad Bin Ali Bin Abdullah Bin Ja’far Al-Tayyaar<sup>as</sup>, from Abu Abdullah<sup>asws</sup>, from his<sup>asws</sup> father<sup>asws</sup> having said: ‘The Messenger<sup>saww</sup> of Allah<sup>azwj</sup> said: ‘The status of the man is (in accordance to) his Religion, and his chivalry, and his intellect, and his nobility, and his beauty, and his generosity, and his piety. "}]}, {"index": 14708, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:8:1:17:3", "text": "14483-  عَنْهُمْ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ وَ ثَعْلَبَةَ بْنِ مَيْمُونٍ وَ غَالِبِ بْنِ عُثْمَانَ وَ هَارُونَ بْنِ مُسْلِمٍ عَنْ بُرَيْدِ بْنِ مُعَاوِيَةَ قَالَ كُنْتُ عِنْدَ أَبِي جَعْفَرٍ ( عليه السلام ) فِي فُسْطَاطٍ لَهُ بِمِنًى فَنَظَرَ إِلَى زِيَادٍ الْأَسْوَدِ مُنْقَلِعَ الرِّجْلِ فَرَثَى لَهُ فَقَالَ لَهُ مَا لِرِجْلَيْكَ هَكَذَا قَالَ جِئْتُ عَلَى بَكْرٍ لِي نِضْوٍ فَكُنْتُ أَمْشِي عَنْهُ عَامَّةَ الطَّرِيقِ فَرَثَى لَهُ وَ قَالَ لَهُ عِنْدَ ذَلِكَ زِيَادٌ إِنِّي أُلِمُّ بِالذُّنُوبِ حَتَّى إِذَا ظَنَنْتُ أَنِّي قَدْ هَلَكْتُ ذَكَرْتُ حُبَّكُمْ فَرَجَوْتُ النَّجَاةَ وَ تَجَلَّى عَنِّي \nفَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) وَ هَلِ الدِّينُ إِلَّا الْحُبُّ قَالَ اللَّهُ تَعَالَى حَبَّبَ إِلَيْكُمُ الْإِيمانَ وَ زَيَّنَهُ فِي قُلُوبِكُمْ وَ قَالَ إِنْ كُنْتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ وَ قَالَ يُحِبُّونَ مَنْ هاجَرَ إِلَيْهِمْ إِنَّ رَجُلًا أَتَى النَّبِيَّ ( صلى الله عليه وآله ) فَقَالَ يَا رَسُولَ اللَّهِ أُحِبُّ الْمُصَلِّينَ وَ لَا أُصَلِّي وَ أُحِبُّ الصَّوَّامِينَ وَ لَا أَصُومُ فَقَالَ لَهُ رَسُولُ اللَّهِ أَنْتَ مَعَ مَنْ أَحْبَبْتَ وَ لَكَ مَا اكْتَسَبْتَ وَ قَالَ مَا تَبْغُونَ وَ مَا تُرِيدُونَ أَمَا إِنَّهَا لَوْ كَانَ فَزْعَةٌ مِنَ السَّمَاءِ فَزِعَ كُلُّ قَوْمٍ إِلَى مَأْمَنِهِمْ وَ فَزِعْنَا إِلَى نَبِيِّنَا وَ فَزِعْتُمْ إِلَيْنَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473137\">H 14483</a> – From him, from Sahl Bin Ziyad, from Al-Hassan Bin Ali Bin Fazzal, from Ali Bin Uqba and Tha’alba Bin Maymoun and Ghalib Bin Usman and Haroun Bin Muslim, from Bureyd Bin Muawiya who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> was in the presence</span> of Abu Ja’far<sup>asws</sup> in his<sup>asws</sup> tent at Mina. He<sup>asws</sup> looked at the feet of Ziyad which had turned black, so he<sup>asws</sup> pitied it saying: ‘What is the matter with your feet that they are like this?’ He said, ‘I came upon a weak ride and so had to walk most of the way’. He<sup>asws</sup> lamented to him and Ziyad said to him<sup>asws</sup> during that, ‘I was in (so much) pain due to my sins to the extent that I thought that I would be destroyed. I remembered my love for you<sup>asws</sup> which gave me hope for salvation and it brightened my situation’.  \nSo Abu Ja’far<sup>asws</sup> said: ‘And is the Religion anything except for the love? Allah<sup>azwj</sup> the High has Said: <span class=\"ibTxt\">“[49:7] But Allah has endeared the Faith to you, and has made it beautiful in your hearts”</span>, and Said: <span class=\"ibTxt\">“[3:31] Say: If you love Allah, then follow me, Allah will love you”</span>, and Said: <span class=\"ibTxt\">“[59:9] love those who have fled to them”</span>. A man came up to the Prophet<sup>saww</sup> so he said, ‘O Messenger<sup>saww</sup> of Allah<sup>azwj</sup>, I love the Praying ones but I do not Pray myself, and I love the Fasting ones but I do not Fast myself’. The Messenger<sup>saww</sup> of Allah<sup>azwj</sup> said: ‘You are with the one whom you love, but to you belongs what you have acquired’. And he<sup>asws</sup> said: ‘What you are seeking and what you want, but it is if there is a scare from the sky, every people would seek protection in its safe place, and we<sup>asws</sup> will seek safety with our Prophet<sup>saww</sup>, and you will be seeking safety with us<sup>asws</sup>’."}]}, {"index": 14709, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:8:1:17:4", "text": "14484-  سَهْلٌ عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ وَ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ سَعِيدِ بْنِ يَسَارٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ الْحَمْدُ لِلَّهِ صَارَتْ فِرْقَةٌ مُرْجِئَةً وَ صَارَتْ فِرْقَةٌ حَرُورِيَّةً وَ صَارَتْ فِرْقَةٌ قَدَرِيَّةً وَ سُمِّيتُمُ التُّرَابِيَّةَ وَ شِيعَةَ عَلِيٍّ أَمَا وَ اللَّهِ مَا هُوَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ رَسُولُهُ ( صلى الله عليه وآله ) وَ آلُ رَسُولِ اللَّهِ ( عليهم السلام ) وَ شِيعَةُ آلِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ مَا النَّاسُ إِلَّا هُمْ كَانَ عَلِيٌّ ( عليه السلام ) أَفْضَلَ النَّاسِ بَعْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ أَوْلَى النَّاسِ بِالنَّاسِ حَتَّى قَالَهَا ثَلَاثاً .", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473138\">H 14484</a> – Sahl, from Ibn Fazzaal, from Ali Bin Uqba and Abdullah Bin Bukeyr, from Saeed Bin Yasaar who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> heard Abu Abdullah</span><sup>as</sup><sup>ws</sup> saying: ‘The Praise is to Allah<sup>azwj</sup>. They have become the Murjiyya sect, and the Haruriyya sect, and the Qadiriyya sect, and you have been named as the Tarabiyya and the Shiites of Ali<sup>asws</sup>. But, by Allah<sup>azwj</sup> and what is that except for that there is no god except Allah<sup>azwj</sup>, One with no associates to Him<sup>azwj</sup>, and His<sup>azwj</sup> Messenger<sup>saww</sup>, and the Progeny<sup>asws</sup> of the Messenger, and the Shiites of the progeny<sup>asws</sup> of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>. And what are the people except that it was Ali<sup>asws</sup> the best of the people after the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>, and the highest of the people than the people themselves’. He<sup>asws</sup> said it three times. "}]}, {"index": 14710, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:8:1:17:5", "text": "14485-  عَنْهُ عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ عُمَرَ بْنِ أَبَانٍ الْكَلْبِيِّ عَنْ عَبْدِ الْحَمِيدِ الْوَاسِطِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قُلْتُ لَهُ أَصْلَحَكَ اللَّهُ لَقَدْ تَرَكْنَا أَسْوَاقَنَا انْتِظَاراً لِهَذَا الْأَمْرِ حَتَّى لَيُوشِكُ الرَّجُلُ مِنَّا أَنْ يَسْأَلَ فِي يَدِهِ فَقَالَ يَا [أَبَا] عَبْدِ الْحَمِيدِ أَ تَرَى مَنْ حَبَسَ نَفْسَهُ عَلَى اللَّهِ لَا يَجْعَلُ اللَّهُ لَهُ مَخْرَجاً بَلَى وَ اللَّهِ لَيَجْعَلَنَّ اللَّهُ لَهُ مَخْرَجاً رَحِمَ اللَّهُ عَبْداً أَحْيَا أَمْرَنَا \nقُلْتُ أَصْلَحَكَ اللَّهُ إِنَّ هَؤُلَاءِ الْمُرْجِئَةَ يَقُولُونَ مَا عَلَيْنَا أَنْ نَكُونَ عَلَى الَّذِي نَحْنُ عَلَيْهِ حَتَّى إِذَا جَاءَ مَا تَقُولُونَ كُنَّا نَحْنُ وَ أَنْتُمْ سَوَاءً فَقَالَ يَا عَبْدَ الْحَمِيدِ صَدَقُوا مَنْ تَابَ تَابَ اللَّهُ عَلَيْهِ وَ مَنْ أَسَرَّ نِفَاقاً فَلَا يُرْغِمُ اللَّهُ إِلَّا بِأَنْفِهِ وَ مَنْ أَظْهَرَ أَمْرَنَا أَهْرَقَ اللَّهُ دَمَهُ يَذْبَحُهُمُ اللَّهُ عَلَى الْإِسْلَامِ كَمَا يَذْبَحُ الْقَصَّابُ شَاتَهُ \nقَالَ قُلْتُ فَنَحْنُ يَوْمَئِذٍ وَ النَّاسُ فِيهِ سَوَاءٌ قَالَ لَا أَنْتُمْ يَوْمَئِذٍ سَنَامُ الْأَرْضِ وَ حُكَّامُهَا لَا يَسَعُنَا فِي دِينِنَا إِلَّا ذَلِكَ قُلْتُ فَإِنْ مِتُّ قَبْلَ أَنْ أُدْرِكَ الْقَائِمَ ( عليه السلام ) قَالَ إِنَّ الْقَائِلَ مِنْكُمْ إِذَا قَالَ إِنْ أَدْرَكْتُ قَائِمَ آلِ مُحَمَّدٍ نَصَرْتُهُ كَالْمُقَارِعِ مَعَهُ بِسَيْفِهِ وَ الشَّهَادَةُ مَعَهُ شَهَادَتَانِ. ", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473139\">H 14485</a> – From him, from Ibn Fazzaal, from Ali Bin Uqba, from Umar Bin Abaan Al-kalby, from Abdul Hameed Al-Waasty who has said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> said Abu Ja’far</span><sup>asws</sup>, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well. We have left our markets (businesses) so as to wait for this matter (Al-Qaim<sup>asws</sup>), to the extent that one of us is about to ask by his hand (beg)’.  He<sup>asws</sup> said: ‘O Abu Abdul Hameed, Have you see that the one who confines himself to Allah<sup>azwj</sup> that Allah<sup>azwj</sup> will not Find a way out for him? Yes, He<sup>azwj</sup> does Find a way out for him. May Allah<sup>azwj</sup> have Mercy upon the one who revives our<sup>asws</sup> matter’.\nI said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well. These Murjiites are saying that it is not for us to become as we are until there comes what you<sup>asws</sup> are saying. What we were and what you are is the same’. So he<sup>asws</sup> said: ‘O Abdul Hameed. They have spoken the truth. The one who repents, Allah<sup>azwj</sup> Accepts his repentance, and the one who keeps his hypocrisy a secret, Allah<sup>azwj</sup> does not Force him except by Rubbing his nose (gets humiliated). And the one who makes apparent our<sup>asws</sup> matter, Allah<sup>azwj</sup> Sheds his blood. Allah<sup>azwj</sup> Gets him to be slaughtered upon Al-Islam just as the butcher slaughters his sheep’. \nHe (the narrator) said, ‘I asked, ‘So, on that day we and the people would be the same?’ He<sup>asws</sup> said: ‘No. On that day you will be at the pinnacle of the earth, and its rulers. There is no leeway in our<sup>asws</sup> Religion except for that’. I said, ‘If I were to die before having seen Al-Qaim<sup>asws</sup>?’ He<sup>asws</sup> said: ‘If one of you says that, ‘If I were to see Al-Qaim<sup>asws</sup> I would help him<sup>asws</sup>, is like the having struck with his sword alongside him<sup>asws</sup>, and the martyrdom with him<sup>asws</sup> are two martyrdoms’."}]}, {"index": 14711, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:8:1:17:6", "text": "14486-  عَنْهُ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ عَبْدِ اللَّهِ بْنِ الْوَلِيدِ الْكِنْدِيِّ قَالَ دَخَلْنَا عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي زَمَنِ مَرْوَانَ فَقَالَ مَنْ أَنْتُمْ فَقُلْنَا مِنْ أَهْلِ الْكُوفَةِ فَقَالَ مَا مِنْ بَلْدَةٍ مِنَ الْبُلْدَانِ أَكْثَرَ مُحِبّاً لَنَا مِنْ أَهْلِ الْكُوفَةِ وَ لَا سِيَّمَا هَذِهِ الْعِصَابَةِ إِنَّ اللَّهَ جَلَّ ذِكْرُهُ هَدَاكُمْ لِأَمْرٍ جَهِلَهُ النَّاسُ وَ أَحْبَبْتُمُونَا وَ أَبْغَضَنَا النَّاسُ وَ اتَّبَعْتُمُونَا وَ خَالَفَنَا النَّاسُ وَ صَدَّقْتُمُونَا وَ كَذَّبَنَا النَّاسُ فَأَحْيَاكُمُ اللَّهُ مَحْيَانَا وَ أَمَاتَكُمُ [اللَّهُ] مَمَاتَنَا \nفَأَشْهَدُ عَلَى أَبِي أَنَّهُ كَانَ يَقُولُ مَا بَيْنَ أَحَدِكُمْ وَ بَيْنَ أَنْ يَرَى مَا يُقِرُّ اللَّهُ بِهِ عَيْنَهُ وَ أَنْ يَغْتَبِطَ إِلَّا أَنْ تَبْلُغَ نَفْسُهُ هَذِهِ وَ أَهْوَى بِيَدِهِ إِلَى حَلْقِهِ وَ قَدْ قَالَ اللَّهُ عَزَّ وَ جَلَّ فِي كِتَابِهِ وَ لَقَدْ أَرْسَلْنا رُسُلًا مِنْ قَبْلِكَ وَ جَعَلْنا لَهُمْ أَزْواجاً وَ ذُرِّيَّةً فَنَحْنُ ذُرِّيَّةُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ).", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473140\">H 14486</a> – From him, from Al-Hassan Bin Ali, from Abdullah Bin Al-Waleed Al-Kindy who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-w\">‘W</span>e came up to Abu Abdullah</span><sup>asws</sup> during the era of Marwaan. He<sup>as</sup><sup>ws</sup> said: ‘Who are you all?’ So we said, ‘We are from the inhabitants of Al-Kufa’. He<sup>asws</sup> said: ‘There is no city from the cities with more people who love us<sup>asws</sup> than the inhabitants of Al-Kufa, and in particular this group. Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Mention, has Guided you to a matter which the people are ignorant of, and you love us<sup>asws</sup> whilst the people hate us<sup>asws</sup>, and you have followed us whilst the people oppose us<sup>asws</sup>, and you have ratified us<sup>asws</sup> and the people have belied us<sup>asws</sup>. So Allah<sup>azwj</sup> has Made you to live our<sup>asws</sup> life and Made you to die our<sup>asws</sup> deaths.\nI<sup>asws</sup> hereby testify for my<sup>asws</sup> father who<sup>asws</sup> used to say: ‘There is nothing between you all and your seeing of what delights Allah<sup>azwj</sup> has Kept for your eyes and your rejoicing, except for the reaching of your soul to over here’ – and he<sup>asws</sup> gestured by his<sup>asws</sup> hand to his<sup>asws</sup> throat – ‘and Allah<sup>azwj</sup> Mighty and Majestic has Said in His<sup>azwj</sup> Book: <span class=\"ibTxt\">“[13:38] And certainly We sent messengers before you and gave them wives and children”</span>. So we<sup>asws</sup> are the children of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>’."}]}, {"index": 14712, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:8:1:17:7", "text": "14487-  حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الْكِنْدِيِّ عَنْ أَحْمَدَ بْنِ عُدَيْسٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي الصَّبَّاحِ قَالَ سَمِعْتُ كَلَاماً يُرْوَى عَنِ النَّبِيِّ ( صلى الله عليه وآله ) وَ عَنْ عَلِيٍّ ( عليه السلام ) وَ عَنِ ابْنِ مَسْعُودٍ فَعَرَضْتُهُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ هَذَا قَوْلُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) أَعْرِفُهُ \nقَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الشَّقِيُّ مَنْ شَقِيَ فِي بَطْنِ أُمِّهِ وَ السَّعِيدُ مَنْ وُعِظَ بِغَيْرِهِ وَ أَكْيَسُ الْكِيسِ التَّقِيُّ وَ أَحْمَقُ الْحُمْقِ الْفَجُورُ وَ شَرُّ الرَّوِيِّ رَوِيُّ الْكَذِبِ وَ شَرُّ الْأُمُورِ مُحْدَثَاتُهَا وَ أَعْمَى الْعَمَى عَمَى الْقَلْبِ وَ شَرُّ النَّدَامَةِ نَدَامَةُ يَوْمِ الْقِيَامَةِ وَ أَعْظَمُ الْخَطَايَا عِنْدَ اللَّهِ لِسَانُ الْكَذَّابِ وَ شَرُّ الْكَسْبِ كَسْبُ الرِّبَا وَ شَرُّ الْمَآكِلِ أَكْلُ مَالِ الْيَتِيمِ وَ أَحْسَنُ الزِّينَةِ زِينَةِ الرَّجُلِ هَدْيٌ حَسَنٌ مَعَ إِيمَانٍ وَ أَمْلَكُ أَمْرِهِ بِهِ وَ قِوَامُ خَوَاتِيمِهِ \nوَ مَنْ يَتَّبِعِ السُّمْعَةَ يُسَمِّعِ اللَّهُ بِهِ الْكَذِبَةَ وَ مَنْ يَتَوَلَّ الدُّنْيَا يَعْجِزْ عَنْهَا وَ مَنْ يَعْرِفِ الْبَلَاءَ يَصْبِرْ عَلَيْهِ وَ مَنْ لَا يَعْرِفْهُ يَنْكُلْ وَ الرَّيْبُ كُفْرٌ وَ مَنْ يَسْتَكْبِرْ يَضَعْهُ اللَّهُ وَ مَنْ يُطِعِ الشَّيْطَانَ يَعْصِ اللَّهَ وَ مَنْ يَعْصِ اللَّهَ يُعَذِّبْهُ اللَّهُ وَ مَنْ يَشْكُرْ يَزِيدُهُ اللَّهُ وَ مَنْ يَصْبِرْ عَلَى الرَّزِيَّةِ يُعِنْهُ اللَّهُ وَ مَنْ يَتَوَكَّلْ عَلَى اللَّهِ فَحَسْبُهُ اللَّهُ \nلَا تُسْخِطُوا اللَّهَ بِرِضَا أَحَدٍ مِنْ خَلْقِهِ وَ لَا تَقَرَّبُوا إِلَى أَحَدٍ مِنَ الْخَلْقِ تَتَبَاعَدُوا مِنَ اللَّهِ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ لَيْسَ بَيْنَهُ وَ بَيْنَ أَحَدٍ مِنَ الْخَلْقِ شَيْ‏ءٌ يُعْطِيهِ بِهِ خَيْراً وَ لَا يَدْفَعُ بِهِ عَنْهُ شَرّاً إِلَّا بِطَاعَتِهِ وَ اتِّبَاعِ مَرْضَاتِهِ وَ إِنَّ طَاعَةَ اللَّهِ نَجَاحٌ مِنْ كُلِّ خَيْرٍ يُبْتَغَى وَ نَجَاةٌ مِنْ كُلِّ شَرٍّ يُتَّقَى \nوَ إِنَّ اللَّهَ عَزَّ ذِكْرُهُ يَعْصِمُ مَنْ أَطَاعَهُ وَ لَا يَعْتَصِمُ بِهِ مَنْ عَصَاهُ وَ لَا يَجِدُ الْهَارِبُ مِنَ اللَّهِ عَزَّ وَ جَلَّ مَهْرَباً وَ إِنَّ أَمْرَ اللَّهِ نَازِلٌ وَ لَوْ كَرِهَ الْخَلَائِقُ وَ كُلُّ مَا هُوَ آتٍ قَرِيبٌ مَا شَاءَ اللَّهُ كَانَ وَ مَا لَمْ يَشَأْ لَمْ يَكُنْ فَتَعَاوَنُوا عَلَى الْبِرِّ وَ التَّقْوَى وَ لَا تَعَاوَنُوا عَلَى الْإِثْمِ وَ الْعُدْوَانِ وَ اتَّقُوا اللَّهَ إِنَّ اللَّهَ شَدِيدُ الْعِقَابِ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473141\">H 14487</a> – Humeyd Bin Ziyad, from Al-Hassan Bin Muhammad Al-Kindy, from Ahmad Bin Udeys, from Abaan Bin Usmaan, from Abu Al-Sabbaah who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> heard a speech reported</span> from the Prophet<sup>saww</sup> and from Ali<sup>asws</sup>, and from Ibn Mas’oud. So I presented it to Abu Abdullah<sup>asws</sup>. He<sup>asws</sup> said: ‘These are the words of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>. I<sup>asws</sup> recognise them’.\nThe Messenger<sup>saww</sup> of Allah<sup>azwj</sup> said: ‘The wretched one is the one who is wretched in the womb of his mother, and a happy one is the one who heeds the advice given to the others. And the most intelligent one of the intelligent ones is the one who is pious, and the most stupid of the stupid ones is the immoral. The most evil of the report is the report of the lies (false report), and the most evil of the matters is the innovations. And the blindness of all blindness is the blindness of the heart, and the worst regret is the regret on the Day of Judgement. \nAnd the greatest of the sins in the Presence of Allah<sup>azwj</sup> is the lying tongue, and the most evil of the gains is the gain of the interest. And the most evil of the consumption is the consumption of the wealth of the orphans. The best of the decors of the decors of the man is good guidance along with faith, and the controlling of his affairs by it and strengthening them. \nThe one who seeks fame (show-off), Allah<sup>azwj</sup> makes him to be named as a liar, and the one who loves the world will be frustrated from it. And the one who recognises the affliction would be patient against it, and the one who does not recognised it will be tortured (during it). And the doubt is disbelief, and the one who is arrogant, Allah<sup>azwj</sup> Puts him in his place. And the one who obeys Satan<sup>la</sup> disobeys Allah<sup>azwj</sup>, and the one who disobeys Allah<sup>azwj</sup> is Punished by Allah<sup>azwj</sup>. The one who is thankful, Allah<sup>azwj</sup> Increases for him, the one who is patient upon a loss is Helped by Allah<sup>azwj</sup>. The one who places reliance upon Allah<sup>azwj</sup>, Allah<sup>azwj</sup> suffices for him.\nDo not Enrage Allah<sup>azwj</sup> by pleasing anyone from His<sup>azwj</sup> creatures, and do not seek nearness to anyone from the creatures who takes you far away from Allah<sup>azwj</sup>, for Allah<sup>azwj</sup> Mighty and Majestic, there is nothing between Him<sup>azwj</sup> and anyone from His<sup>azwj</sup> creatures anything by which good can be acquired nor evil be repelled except by being obedient to Him<sup>azwj</sup>, and the following of His<sup>azwj</sup> Pleasure. And in the obedience to Allah<sup>azwj</sup> is success in every good that you want, and salvation from every evil which is feared.  \nAnd that Allah<sup>azwj</sup>, Mighty is His<sup>azwj</sup> Mention, Defends the one who is obedient to Him<sup>azwj</sup> and the one who is disobedient to Him<sup>azwj</sup> does not seek protection from Him<sup>azwj</sup>. And the fugitive from Allah<sup>azwj</sup> Mighty and Majestic will not find an escape, and that the Command of Allah<sup>azwj</sup> will Descend even though the creatures may be averse to it. And everything which is to come is near, and Whatsoever Allah<sup>azwj</sup> so Desires has happened and whatsoever He<sup>azwj</sup> does not Desire will not happen. So help each other towards the righteousness and the piety and do not help each other towards the sins and the animosity. And fear Allah<sup>azwj</sup> for He<sup>azwj</sup> is Severe is the Punishment’."}]}, {"index": 14713, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:8:1:17:8", "text": "14488-  وَ بِهَذَا الْإِسْنَادِ عَنْ أَبَانٍ عَنْ يَعْقُوبَ بْنِ شُعَيْبٍ أَنَّهُ سَأَلَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ كانَ النَّاسُ أُمَّةً واحِدَةً فَقَالَ كَانَ النَّاسُ قَبْلَ نُوحٍ أُمَّةَ ضَلَالٍ فَبَدَا لِلَّهِ فَبَعَثَ الْمُرْسَلِينَ وَ لَيْسَ كَمَا يَقُولُونَ لَمْ يَزَلْ وَ كَذَبُوا يَفْرُقُ اللَّهُ فِي لَيْلَةِ الْقَدْرِ مَا كَانَ مِنْ شِدَّةٍ أَوْ رَخَاءٍ أَوْ مَطَرٍ بِقَدْرِ مَا يَشَاءُ اللَّهُ عَزَّ وَ جَلَّ أَنْ يُقَدِّرَ إِلَى مِثْلِهَا مِنْ قَابِلٍ ", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473142\">H 14488</a> – and by this chain, from Abaan, from Yaqoub Bin Shuayb, who has said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span>  asked Abu Abdullah</span><sup>asws</sup> about the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[2:213] Mankind were one community”</span>, so he<sup>asws</sup> said: ‘Before the era of Noah<sup>as</sup> the people were a misguided nation. So Allah<sup>azwj</sup> Initiated by sending the Messengers<sup>as</sup> and it is not as they are saying it to be that it never ceased, and they are lying for Allah<sup>azwj</sup> Differentiated in the Night of Power (<span class=\"iTxt\">Laylat Al-Qadr</span>) what was from the hardships, or ease, or rain in accordance with what Allah<sup>azwj</sup> Mighty and Majestic so Desired until the similar like it to come (Next <span class=\"iTxt\">Laylat Al-Qadr</span>)’.\nout of 567"}]}]}, "index": "al-kafi:8:1:17", "kind": "verse_list"}