{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:8:1:18",
        "titles": {
          "ar": "حَدِيثُ الْبَحْرِ مَعَ الشَّمْسِ",
          "en": "HADEETH OF THE SEA WITH THE SUN"
        }
      }
    ],
    "index": 2289,
    "local_index": 18,
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:18",
    "titles": {
      "ar": "حَدِيثُ الْبَحْرِ مَعَ الشَّمْسِ",
      "en": "HADEETH OF THE SEA WITH THE SUN"
    },
    "verse_count": 11,
    "verse_start_index": 14724,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 189)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14725,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:18:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14489</span>-  عَلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ مَعْرُوفِ بْنِ خَرَّبُوذَ عَنِ الْحَكَمِ بْنِ الْمُسْتَوْرِدِ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) قَالَ إِنَّ مِنَ الْأَقْوَاتِ الَّتِي قَدَّرَهَا اللَّهُ لِلنَّاسِ مِمَّا يَحْتَاجُونَ إِلَيْهِ الْبَحْرَ الَّذِي خَلَقَهُ اللَّهُ عَزَّ وَ جَلَّ بَيْنَ السَّمَاءِ وَ الْأَرْضِ ",
          "قَالَ وَ إِنَّ اللَّهَ قَدْ قَدَّرَ فِيهَا مَجَارِيَ الشَّمْسِ وَ الْقَمَرِ وَ النُّجُومِ وَ الْكَوَاكِبِ وَ قَدَّرَ ذَلِكَ كُلَّهُ عَلَى الْفَلَكِ ثُمَّ وَكَّلَ بِالْفَلَكِ مَلَكاً وَ مَعَهُ سَبْعُونَ أَلْفَ مَلَكٍ فَهُمْ يُدِيرُونَ الْفَلَكَ فَإِذَا أَدَارُوهُ دَارَتِ الشَّمْسُ وَ الْقَمَرُ وَ النُّجُومُ وَ الْكَوَاكِبُ مَعَهُ فَنَزَلَتْ فِي مَنَازِلِهَا الَّتِي قَدَّرَهَا اللَّهُ عَزَّ وَ جَلَّ فِيهَا لِيَوْمِهَا وَ لَيْلَتِهَا ",
          "فَإِذَا كَثُرَتْ ذُنُوبُ الْعِبَادِ وَ أَرَادَ اللَّهُ تَبَارَكَ وَ تَعَالَى أَنْ يَسْتَعْتِبَهُمْ بِآيَةٍ مِنْ آيَاتِهِ أَمَرَ الْمَلَكَ الْمُوَكَّلَ بِالْفَلَكِ أَنْ يُزِيلَ الْفَلَكَ الَّذِي عَلَيْهِ مَجَارِي الشَّمْسِ وَ الْقَمَرِ وَ النُّجُومِ وَ الْكَوَاكِبِ فَيَأْمُرُ الْمَلَكُ أُولَئِكَ السَّبْعِينَ أَلْفَ مَلَكٍ أَنْ يُزِيلُوهُ عَنْ مَجَارِيهِ ",
          "قَالَ فَيُزِيلُونَهُ فَتَصِيرُ الشَّمْسُ فِي ذَلِكَ الْبَحْرِ الَّذِي يَجْرِي فِي الْفَلَكِ قَالَ فَيَطْمِسُ ضَوْؤُهَا وَ يَتَغَيَّرُ لَوْنُهَا فَإِذَا أَرَادَ اللَّهُ عَزَّ وَ جَلَّ أَنْ يُعَظِّمَ الْآيَةَ طَمَسَتِ الشَّمْسُ فِي الْبَحْرِ عَلَى مَا يُحِبُّ اللَّهُ أَنْ يُخَوِّفَ خَلْقَهُ بِالْآيَةِ قَالَ وَ ذَلِكَ عِنْدَ انْكِسَافِ الشَّمْسِ ",
          "قَالَ وَ كَذَلِكَ يَفْعَلُ بِالْقَمَرِ قَالَ فَإِذَا أَرَادَ اللَّهُ أَنْ يُجَلِّيَهَا أَوْ يَرُدَّهَا إِلَى مَجْرَاهَا أَمَرَ الْمَلَكَ الْمُوَكَّلَ بِالْفَلَكِ أَنْ يَرُدَّ الْفَلَكَ إِلَى مَجْرَاهُ فَيَرُدُّ الْفَلَكَ فَتَرْجِعُ الشَّمْسُ إِلَى مَجْرَاهَا قَالَ فَتَخْرُجُ مِنَ الْمَاءِ وَ هِيَ كَدِرَةٌ قَالَ وَ الْقَمَرُ مِثْلُ ذَلِكَ",
          "قَالَ ثُمَّ قَالَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) أَمَا إِنَّهُ لَا يَفْزَعُ لَهُمَا وَ لَا يَرْهَبُ بِهَاتَيْنِ الْآيَتَيْنِ إِلَّا مَنْ كَانَ مِنْ شِيعَتِنَا فَإِذَا كَانَ كَذَلِكَ فَافْزَعُوا إِلَى اللَّهِ عَزَّ وَ جَلَّ ثُمَّ ارْجِعُوا إِلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473144\">H 14489</a> – Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Abdullah Bin Sinan, from Ma’rouf Bin Kharabouz, from Al-Hakam Bin Mustawrid, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>li Bin Al-Husayn</span><sup>asws</sup> said: ‘From among the sustenance are those which Allah<sup>azwj</sup> has Measured out for the people from what their needs are to Him<sup>azwj</sup>. The sea (atmosphere) is the one which Allah<sup>azwj</sup> Mighty and Majestic has Created to be between the sky and the earth’.",
            "He<sup>asws</sup> said: ‘And Allah<sup>azwj</sup> has Determined in these the flow of the sun and the moon, and the stars, and the planets, and has Determined all of that upon the orbit. Then for every orbit is an Angel with whom there are seventy thousand Angels. So they turn the circle of the orbit. So it is upon their turning that the sun, and the moon, and the stars, and the planets turn along with them. So they descend in their station which Allah<sup>azwj</sup> Mighty and Majestic has Determined for them. Therein are their days and their nights.",
            "So when the sins of the servants become numerous and Allah<sup>azwj</sup> Blessed and High Intends to Reproach them with a Sign from His<sup>azwj</sup> Signs, He<sup>azwj</sup> Orders the Angel in charge of the orbit to remove the orbit upon which the sun and the moon, and the stars, and the planets flow upon. So that Angel orders the seventy thousand Angels (which are under him) to remove these from their flows’.  ",
            "He<sup>asws</sup> said: ‘So they remove it and the sun becomes in that sea (atmosphere) in which flows in the orbit’. He<sup>asws</sup> said: ‘So its light gets obliterated and its colour changes. So if Allah<sup>azwj</sup> Mighty and Majestic Intends to maximise the Sign, He<sup>azwj</sup> Obliterates the sun in the sea (atmosphere) upon what Allah<sup>azwj</sup> Loves that His<sup>azwj</sup> creatures should fear His<sup>azwj</sup> Signs’. He<sup>asws</sup> said: ‘And that is during the eclipse of the sun’.",
            "He<sup>asws</sup> said: ‘And that is similar to what He<sup>azwj</sup> Does with the moon’. He<sup>asws</sup> said: ‘So if Allah<sup>azwj</sup> Intends to End it or Return it back to normal, He<sup>azwj</sup> Orders the Angel in charge of the orbit that he should return the orbit back to its normality. So he returns the orbit and the sun goes back to its normality’. He<sup>asws</sup> said: ‘So he takes it out from the water (fluid) and it is brownish (dim)’. He<sup>asws</sup> said: ‘And the (matter of) the moon is similar to that’. ",
            "He (the narrator) said, ‘Then Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said: ‘But rather, no one is scared of these two nor is anyone intimidated by these two Signs except the one who was from our<sup>asws</sup> Shiites. So if (these Signs) have happened, so be scared to Allah<sup>a</sup><sup>zwj</sup> Mighty and Majestic, then return (Repent) to Him<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "41. Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Abdullah Bin Sinan, from Ma’rouf Bin Kharabouz, from Al-Hakam Bin Mustawrid, who has said: Ali Bin Al-Husayn (a.s.) said: ‘From among the sustenance are those which Allah (azwj) has Measured out for the people from what their needs are to Him (azwj). The sea (atmosphere) is the one which Allah (azwj) Mighty and Majestic has Created to be between the sky and the earth’. He (a.s.) said: ‘And Allah (azwj) has Determined in these the flow of the sun and the moon, and the stars, and the planets, and has Determined all of that upon the orbit. Then for every orbit is an Angel with whom there are seventy thousand Angels. So they turn the circle of the orbit. So it is upon their turning that the sun, and the moon, and the stars, and the planets turn along with them. So they descend in their station which Allah (azwj) Mighty and Majestic has Determined for them. Therein are their days and their nights. So when the sins of the servants become numerous and Allah (azwj) Blessed and High Intends to Reproach them with a Sign from His (azwj) Signs, He (azwj) Orders the Angel in charge of the orbit to remove the orbit upon which the sun and the moon, and the stars, and the planets flow upon. So that Angel orders the seventy thousand Angels (which are under him) to remove these from their flows’. He (a.s.) said: ‘So they remove it and the sun becomes in that sea (atmosphere) in which flows in the orbit’. He (a.s.) said: ‘So its light gets obliterated and its colour changes. So if Allah (azwj) Mighty and Majestic Intends to maximise the Sign, He (azwj) Obliterates the sun in the sea (atmosphere) upon what Allah (azwj) Loves that His (azwj) creatures should fear His (azwj) Signs’. He (a.s.) said: ‘And that is during the eclipse of the sun’. He (a.s.) said: ‘And that is similar to what He (azwj) Does with the moon’. He (a.s.) said: ‘So if Allah (azwj) Intends to End it or Return it back to normal, He (azwj) Orders the Angel in charge of the orbit that he should return the orbit back to its normality. So he returns the orbit and the sun goes back to its normality’. He (a.s.) said: ‘So he takes it out from the water (fluid) and it is brownish (dim)’. He (a.s.) said: ‘And the (matter of) the moon is similar to that’. He (the narrator) said, ‘Then Ali (a.s.) Bin Al-Husayn (a.s.) said: ‘But rather, no one is scared of these two nor is anyone intimidated by these two Signs except the one who was from our (a.s.) Shiites. So if (these Signs) have happened, so be scared to Allah (azwj) Mighty and Majestic, then return (Repent) to Him (azwj)’."
          ]
        }
      },
      {
        "gradings": [
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14726,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:18:2",
        "text": [
          "14490-  عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنِ الْفَضْلِ بْنِ إِسْمَاعِيلَ الْهَاشِمِيِّ عَنْ أَبِيهِ قَالَ شَكَوْتُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا أَلْقَى مِنْ أَهْلِ بَيْتِي مِنِ اسْتِخْفَافِهِمْ بِالدِّينِ فَقَالَ يَا إِسْمَاعِيلُ لَا تُنْكِرْ ذَلِكَ مِنْ أَهْلِ بَيْتِكَ فَإِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى جَعَلَ لِكُلِّ أَهْلِ بَيْتٍ حُجَّةً يَحْتَجُّ بِهَا عَلَى أَهْلِ بَيْتِهِ فِي الْقِيَامَةِ فَيُقَالُ لَهُمْ أَ لَمْ تَرَوْا فُلَاناً فِيكُمْ أَ لَمْ تَرَوْا هَدْيَهُ فِيكُمْ أَ لَمْ تَرَوْا صَلَاتَهُ فِيكُمْ أَ لَمْ تَرَوْا دِينَهُ فَهَلَّا اقْتَدَيْتُمْ بِهِ فَيَكُونُ حُجَّةً عَلَيْهِمْ فِي الْقِيَامَةِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473145\">H 14490</a> – Ali Bin Ibrahim, from his father, from Muhammad Bin Suleyman, from Al-Fazl Bin Ismail Al-Hashimy, from his father who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> complained to Abu</span> Abdullah<sup>asws</sup> of what I had faced from my family from their taking of their Religion lightly’. So he<sup>asws</sup> said: ‘O Ismail, do not abhor that from your family, for Allah<sup>azwj</sup> Blessed and High has Made for every family a proof by which He<sup>azwj</sup> will Argue by against his (faithless) family on the Day of Judgement. ",
            "So He<sup>azwj</sup> will Say to them: “Did you not see so and so among you? Did you not see his guidance among you? Did you not see his Prayers among you? Did you not see his Religion? Did you not follow it? So he will become a proof against them on the Day of Judgement’."
          ],
          "en.sarwar": [
            "42. Ali Bin Ibrahim, from his father, from Muhammad Bin Suleyman, from Al-Fazl Bin Ismail Al-Hashimy, from his father who said: ‘I complained to Abu Abdullah (a.s.) of what I had faced from my family from their taking of their Religion lightly’. So he (a.s.) said: ‘O Ismail, do not abhor that from your family, for Allah (azwj) Blessed and High has Made for every family a proof by which He (azwj) will Argue by against his (faithless) family on the Day of Judgement. So He (azwj) will Say to them: “Did you not see so and so among you? Did you not see his guidance among you? Did you not see his Prayers among you? Did you not see his Religion? Did you not follow it? So he will become a proof against them on the Day of Judgement’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 192)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14727,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:18:3",
        "text": [
          "14491-  عَنْهُ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ عُثَيْمٍ النَّخَّاسِ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ الرَّجُلَ مِنْكُمْ لَيَكُونُ فِي الْمَحَلَّةِ فَيَحْتَجُّ اللَّهُ عَزَّ وَ جَلَّ يَوْمَ الْقِيَامَةِ عَلَى جِيرَانِهِ [بِهِ] فَيُقَالُ لَهُمْ أَ لَمْ يَكُنْ فُلَانٌ بَيْنَكُمْ أَ لَمْ تَسْمَعُوا كَلَامَهُ أَ لَمْ تَسْمَعُوا بُكَاءَهُ فِي اللَّيْلِ فَيَكُونُ حُجَّةَ اللَّهِ عَلَيْهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473146\">H 14491</a> – From him, from his father, from Muhammad Bin Usaym Al-Nakhaas, from Muawiya Bin Ammaar who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> heard Abu Abdullah</span><sup>asws</sup> saying that: ‘The man from among you lives in the neighbourhood. So Allah<sup>azwj</sup> Mighty and Majestic will Argue by him against his neighbours on the Day of Judgement. So He<sup>azwj</sup> will Say: “Was not so and so among you? Did you not hear his speech? Did you not hear his wailing during the night? So he will be the Argument of Allah<sup>azwj</sup> against them’."
          ],
          "en.sarwar": [
            "43. From him, from his father, from Muhammad Bin Usaym Al-Nakhaas, from Muawiya Bin Ammaar who said: ‘I heard Abu Abdullah (a.s.) saying that: ‘The man from among you lives in the neighbourhood. So Allah (azwj) Mighty and Majestic will Argue by him against his neighbours on the Day of Judgement. So He (azwj) will Say: “Was not so and so among you? Did you not hear his speech? Did you not hear his wailing during the night? So he will be the Argument of Allah (azwj) against them’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 192)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14728,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:18:4",
        "text": [
          "14492-  مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ أَبِي مَرْيَمَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ أَرْسَلَ عَلَيْهِمْ طَيْراً أَبابِيلَ تَرْمِيهِمْ بِحِجارَةٍ مِنْ سِجِّيلٍ قَالَ كَانَ طَيْرٌ سَافٌّ جَاءَهُمْ مِنْ قِبَلِ الْبَحْرِ رُءُوسُهَا كَأَمْثَالِ رُءُوسِ السِّبَاعِ وَ أَظْفَارُهَا كَأَظْفَارِ السِّبَاعِ مِنَ الطَّيْرِ مَعَ كُلِّ طَائِرٍ ثَلَاثَةُ أَحْجَارٍ فِي رِجْلَيْهِ حَجَرَانِ وَ فِي مِنْقَارِهِ حَجَرٌ فَجَعَلَتْ تَرْمِيهِمْ بِهَا حَتَّى جُدِّرَتْ أَجْسَادُهُمْ فَقَتَلَهُمْ بِهَا وَ مَا كَانَ قَبْلَ ذَلِكَ رُئِيَ شَيْ‏ءٌ مِنَ الْجُدَرِيِّ وَ لَا رَأَوْا ذَلِكَ مِنَ الطَّيْرِ قَبْلَ ذَلِكَ الْيَوْمِ وَ لَا بَعْدَهُ ",
          "قَالَ وَ مَنْ أَفْلَتَ مِنْهُمْ يَوْمَئِذٍ انْطَلَقَ حَتَّى إِذَا بَلَغُوا حَضْرَمَوْتَ وَ هُوَ وَادٍ دُونَ الْيَمَنِ أَرْسَلَ اللَّهُ عَلَيْهِمْ سَيْلًا فَغَرَّقَهُمْ أَجْمَعِينَ قَالَ وَ مَا رُئِيَ فِي ذَلِكَ الْوَادِي مَاءٌ قَطُّ قَبْلَ ذَلِكَ الْيَوْمِ بِخَمْسَةَ عَشَرَ سَنَةً قَالَ فَلِذَلِكَ سُمِّيَ حَضْرَمَوْتَ حِينَ مَاتُوا فِيهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473147\">H 14492</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Hassan Bin Mahboub, from Jameel Bin Saaleh, from Abu Maryam who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[105:3] And send against them swarms of flying creatures [105:4] Striking them with stones of baked clay”</span>, he<sup>asws</sup> said: ‘These were low flying birds which came upon them from the sea front. Their heads were like the heads of predatory birds, and their claws were like the claws of predatory birds. Along with each of the birds were three stones. In their legs were two stones and in their beaks was one stone each. So they went on to pelt them by these until their bodies became blistered with smallpox. So they killed them by it and there was not seen before that anything from the smallpox, nor were such birds seen before that day, nor after it’.",
            "He<sup>asws</sup> said: ‘And the ones from among them who escaped on that day went until they reached Hazramaut, and it is a valley in a part of Yemen. Allah<sup>azwj</sup> Sent against them a flood. So, all of them were drowned in it’. He<sup>asws</sup> said: ‘And no water had been seen in that valley at all for fifteen years before that’. He<sup>asws</sup> said: ‘So that is why it has been named as Hazramaut (death arrived), for that is wherein they died’."
          ],
          "en.sarwar": [
            "44. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Hassan Bin Mahboub, from Jameel Bin Saaleh, from Abu Maryam who has said: Abu Ja’far (a.s.), said, ‘I asked him (a.s.) about the Statement of Allah (azwj) Mighty and Majestic: “[105:3] And send against them swarms of flying creatures [105:4] Striking them with stones of baked clay”, he (a.s.) said: ‘These were low flying birds which came upon them from the sea front. Their heads were like the heads of predatory birds, and their claws were like the claws of predatory birds. Along with each of the birds were three stones. In their legs were two stones and in their beaks was one stone each. So they went on to pelt them by these until their bodies became blistered with smallpox. So they killed them by it and there was not seen before that anything from the smallpox, nor were such birds seen before that day, nor after it’. He (a.s.) said: ‘And the ones from among them who escaped on that day went until they reached Hazramaut, and it is a valley in a part of Yemen. Allah (azwj) Sent against them a flood. So, all of them were drowned in it’. He (a.s.) said: ‘And no water had been seen in that valley at all for fifteen years before that’. He (a.s.) said: ‘So that is why it has been named as Hazramaut (death arrived), for that is wherein they died’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 194)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 383)"
        ],
        "index": 14729,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:18:5",
        "text": [
          "14493- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ فَضَّالٍ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ وَ ثَعْلَبَةَ بْنِ مَيْمُونٍ وَ عَلِيِّ بْنِ عُقْبَةَ عَنْ زُرَارَةَ عَنْ عَبْدِ الْمَلِكِ قَالَ وَقَعَ بَيْنَ أَبِي جَعْفَرٍ وَ بَيْنَ وَلَدِ الْحَسَنِ ( عليه السلام ) كَلَامٌ فَبَلَغَنِي ذَلِكَ فَدَخَلْتُ عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) فَذَهَبْتُ أَتَكَلَّمُ فَقَالَ لِي مَهْ لَا تَدْخُلْ فِيمَا بَيْنَنَا فَإِنَّمَا مَثَلُنَا وَ مَثَلُ بَنِي عَمِّنَا كَمَثَلِ رَجُلٍ كَانَ فِي بَنِي إِسْرَائِيلَ كَانَتْ لَهُ ابْنَتَانِ فَزَوَّجَ إِحْدَاهُمَا مِنْ رَجُلٍ زَرَّاعٍ وَ زَوَّجَ الْأُخْرَى مِنْ رَجُلٍ فَخَّارٍ ",
          "ثُمَّ زَارَهُمَا فَبَدَأَ بِامْرَأَةِ الزَّرَّاعِ فَقَالَ لَهَا كَيْفَ حَالُكُمْ فَقَالَتْ قَدْ زَرَعَ زَوْجِي زَرْعاً كَثِيراً فَإِنْ أَرْسَلَ اللَّهُ السَّمَاءَ فَنَحْنُ أَحْسَنُ بَنِي إِسْرَائِيلَ حَالًا ثُمَّ مَضَى إِلَى امْرَأَةِ الْفَخَّارِ فَقَالَ لَهَا كَيْفَ حَالُكُمْ فَقَالَتْ قَدْ عَمِلَ زَوْجِي فَخَّاراً كَثِيراً فَإِنْ أَمْسَكَ اللَّهُ السَّمَاءَ فَنَحْنُ أَحْسَنُ بَنِي إِسْرَائِيلَ حَالًا فَانْصَرَفَ وَ هُوَ يَقُولُ اللَّهُمَّ أَنْتَ لَهُمَا وَ كَذَلِكَ نَحْنُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473148\">H 14493</a> – Muhammad Bin Yahya, form Ahmad Bin Muhammad Bin Isa, from Ibn Fazzaal, from Abdullah Bin Bukeyr and Sa’alba Bin Maymoun and Ali Bin Uqba, from Zarara, from Abdul Malik who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span> discussion took place</span> between Abu Ja’far<sup>asws</sup> and the children of Al-Hassan<sup>asws</sup>. That reached me, so I came up to Abu Ja’far<sup>asws</sup> to speak to him<sup>asws</sup> about it. He<sup>asws</sup> said to me: ‘Shhh! Do not interfere in what is in between us<sup>asws</sup>, for our<sup>asws</sup> example and the example of the sons of our<sup>asws</sup> uncle is like the man who was in the Children of Israel who had two daughters. So he married one of them to a farmer and married the other one to a potter.",
            "Then he went to visit them both. So he first went to the wife of the farmer and said to her, ‘What is your condition?’ She said, ‘The farm of my husband is a large farm, so if Allah<sup>azwj</sup> were to send (rain from) the sky, we would be in the best condition of the Children of Israel’. Then he went to the wife of the potter, so he said to her, ‘What is your condition?’ She said, ‘My husband has worked to produce a lot of pottery, so if Allah<sup>azwj</sup> were to Withhold (the rain from) the sky, we would be in the best condition of the Children of Israel’. So he left and he was saying, ‘Our Allah<sup>azwj</sup> You are for them both’, and that is how it is with us’."
          ],
          "en.sarwar": [
            "45. Muhammad Bin Yahya, form Ahmad Bin Muhammad Bin Isa, from Ibn Fazzaal, from Abdullah Bin Bukeyr and Sa’alba Bin Maymoun and Ali Bin Uqba, from Zarara, from Abdul Malik who said: ‘A discussion took place between Abu Ja’far (a.s.) and the children of Al-Hassan (a.s.). That reached me, so I came up to Abu Ja’far (a.s.) to speak to him (a.s.) about it. He (a.s.) said to me: ‘Shhh! Do not interfere in what is in between us (a.s.), for our (a.s.) example and the example of the sons of our (a.s.) uncle is like the man who was in the Children of Israel who had two daughters. So he married one of them to a farmer and married the other one to a potter. Then he went to visit them both. So he first went to the wife of the farmer and said to her, ‘What is your condition?’ She said, ‘The farm of my husband is a large farm, so if Allah (azwj) were to send (rain from) the sky, we would be in the best condition of the Children of Israel’. Then he went to the wife of the potter, so he said to her, ‘What is your condition?’ She said, ‘My husband has worked to produce a lot of pottery, so if Allah (azwj) were to Withhold (the rain from) the sky, we would be in the best condition of the Children of Israel’. So he left and he was saying, ‘Our Allah (azwj) You are for them both’, and that is how it is with us’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 194)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14730,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:18:6",
        "text": [
          "14494-  مُحَمَّدٌ عَنْ أَحْمَدَ عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ ذَرِيحٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يُعَوِّذُ بَعْضَ وُلْدِهِ وَ يَقُولُ عَزَمْتُ عَلَيْكِ يَا رِيحُ وَ يَا وَجَعُ كَائِناً مَا كُنْتِ بِالْعَزِيمَةِ الَّتِي عَزَمَ بِهَا عَلِيُّ بْنُ أَبِي طَالِبٍ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) رَسُولُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) عَلَى جِنِّ وَادِي الصَّبْرَةِ فَأَجَابُوا وَ أَطَاعُوا لَمَّا أَجَبْتِ وَ أَطَعْتِ وَ خَرَجْتِ عَنِ ابْنِي فُلَانٍ ابْنِ ابْنَتِي فُلَانَةَ السَّاعَةَ السَّاعَةَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473149\">H 14494</a> – Muhammad, from Ahmad, from Ibn Mahboub, from Jameel Bin Saaleh, from Zareeh who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> heard Abu Abdullah</span><sup>asws</sup> seeking refuge for one of his<sup>asws</sup> sons and he<sup>asws</sup> was saying: ‘I<sup>asws</sup> am resolved against you, O wind, and O pain, whatever creature you are, with the determination which Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> and the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> held against the Jinn in the valley of Al-Sabrah. So they answered, and they obeyed. You answer and obey, and go away from my<sup>asws</sup> son so and so, so of my<sup>asws</sup> daughter so and so, at this very moment, at this very moment’. "
          ],
          "en.sarwar": [
            "46. Muhammad, from Ahmad, from Ibn Mahboub, from Jameel Bin Saaleh, from Zareeh who said: ‘I heard Abu Abdullah (a.s.) seeking refuge for one of his (a.s.) sons and he (a.s.) was saying: ‘I (a.s.) am resolved against you, O wind, and O pain, whatever creature you are, with the determination which Ali (a.s.) Bin Abu Talib (a.s.) and the Messenger (saww) of Allah (azwj) held against the Jinn in the valley of Al-Sabrah. So they answered, and they obeyed. You answer and obey, and go away from my (a.s.) son so and so, so of my (a.s.) daughter so and so, at this very moment, at this very moment’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 196)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14731,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:18:7",
        "text": [
          "14495- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ سِنَانٍ عَنْ أَبِي الْجَارُودِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ يَتَفَقَّدْ يَفْقِدْ وَ مَنْ لَا يُعِدَّ الصَّبْرَ لِنَوَائِبِ الدَّهْرِ يَعْجِزْ وَ مَنْ قَرَضَ النَّاسَ قَرَضُوهُ وَ مَنْ تَرَكَهُمْ لَمْ يَتْرُكُوهُ قِيلَ فَأَصْنَعُ مَا ذَا يَا رَسُولَ اللَّهِ قَالَ أَقْرِضْهُمْ مِنْ عِرْضِكَ لِيَوْمِ فَقْرِكَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473150\">H 14495</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzaal, from Ibn Sinan, from Abu Al-Jaroud:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> said: ‘The Messenger<sup>saww</sup> of Allah<sup>azwj</sup> said: ‘The one who misses (someone in his absence) is himself missed (by others), and the one who does not prepare (himself to observe) patience against the ravages of the time would be frustrated, and the one who problems the people would be troubled by them, and the one who leaves them (under troubles) alone would not be left alone by them (but troubles will be returned to him)’. It was said, ‘So what shall I do, O Messenger<sup>saww</sup> of Allah<sup>azwj</sup>?’ He<sup>saww</sup> said: ‘Lend them from you dignity, from the little you have and from what you need (for yourself) to (them)’. "
          ],
          "en.sarwar": [
            "47. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzaal, from Ibn Sinan, from Abu Al-Jaroud: Abu Ja’far (a.s.) said: ‘The Messenger (saww) of Allah (azwj) said: ‘The one who misses (someone in his absence) is himself missed (by others), and the one who does not prepare (himself to observe) patience against the ravages of the time would be frustrated, and the one who problems the people would be troubled by them, and the one who leaves them (under troubles) alone would not be left alone by them (but troubles will be returned to him)’. It was said, ‘So what shall I do, O Messenger (saww) of Allah (azwj)?’ He (saww) said: ‘Lend them from you dignity, from the little you have and from what you need (for yourself) to (them)’."
          ]
        }
      },
      {
        "gradings": [
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14732,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:18:8",
        "text": [
          "14496-  عَنْهُ عَنْ أَحْمَدَ عَنِ الْبَرْقِيِّ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ حَمَّادِ بْنِ عُثْمَانَ قَالَ بَيْنَا مُوسَى بْنُ عِيسَى فِي دَارِهِ الَّتِي فِي الْمَسْعَى يُشْرِفُ عَلَى الْمَسْعَى إِذْ رَأَى أَبَا الْحَسَنِ مُوسَى  ( عليه السلام ) مُقْبِلًا مِنَ الْمَرْوَةِ عَلَى بَغْلَةٍ فَأَمَرَ ابْنُ هَيَّاجٍ رَجُلًا مِنْ هَمْدَانَ مُنْقَطِعاً إِلَيْهِ أَنْ يَتَعَلَّقَ بِلِجَامِهِ وَ يَدَّعِيَ الْبَغْلَةَ فَأَتَاهُ فَتَعَلَّقَ بِاللِّجَامِ وَ ادَّعَى الْبَغْلَةَ فَثَنَى أَبُو الْحَسَنِ ( عليه السلام ) رِجْلَهُ فَنَزَلَ عَنْهَا وَ قَالَ لِغِلْمَانِهِ خُذُوا سَرْجَهَا وَ ادْفَعُوهَا إِلَيْهِ فَقَالَ وَ السَّرْجُ أَيْضاً لِي فَقَالَ أَبُو الْحَسَنِ ( عليه السلام ) كَذَبْتَ عِنْدَنَا الْبَيِّنَةُ بِأَنَّهُ سَرْجُ مُحَمَّدِ بْنِ عَلِيٍّ وَ أَمَّا الْبَغْلَةُ فَإِنَّا اشْتَرَيْنَاهَا مُنْذُ قَرِيبٍ وَ أَنْتَ أَعْلَمُ وَ مَا قُلْتَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473151\">H 14496</a> – From him, from Ahmad, from Al-Barqy, from Muhammad Bin Yahya, from Hammaad Bin usmaan who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-m\">‘M</span>usa Bin Isa was in</span> his house which was in the place of Sa’ee (nearby the Kaaba), overlooking it when he saw Abu Al-Hassan Musa<sup>asws</sup> coming from <span class=\"iTxt\">Al-Marwa</span> upon his<sup>asws</sup> mule. So he ordered Ibn Hayyaaj, a man from Hamdaan who was very close to him<sup>asws</sup> to go and hold on to the reins and make a claim for the mule. So he came up to him<sup>asws</sup>, held on to the reins, and staked a claim for the mule. Abu Al-Hassan<sup>asws</sup> took his<sup>asws</sup> feet off and dismounted from it and said to his<sup>asws</sup> servant: ‘Take the saddle and hand (the mule) over to him’. He said, ‘And the saddle is mine as well’. So Abu Al-Hassan<sup>asws</sup> said: ‘You are lying, for we<sup>asws</sup> have clear proof that it is the saddle of Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>, and as for the mule, so we<sup>asws</sup> have bought it not so long ago and you know it, and what you are saying’."
          ],
          "en.sarwar": [
            "48. From him, from Ahmad, from Al-Barqy, from Muhammad Bin Yahya, from Hammaad Bin usmaan who said: ‘Musa Bin Isa was in his house which was in the place of Sa’ee (nearby the Kaaba), overlooking it when he saw Abu Al-Hassan Musa (a.s.) coming from Al-Marwa upon his (a.s.) mule. So he ordered Ibn Hayyaaj, a man from Hamdaan who was very close to him (a.s.) to go and hold on to the reins and make a claim for the mule. So he came up to him (a.s.), held on to the reins, and staked a claim for the mule. Abu Al-Hassan (a.s.) took his (a.s.) feet off and dismounted from it and said to his (a.s.) servant: ‘Take the saddle and hand (the mule) over to him’. He said, ‘And the saddle is mine as well’. So Abu Al-Hassan (a.s.) said: ‘You are lying, for we (a.s.) have clear proof that it is the saddle of Muhammad (a.s.) Bin Ali (a.s.), and as for the mule, so we (a.s.) have bought it not so long ago and you know it, and what you are saying’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 197)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 384)"
        ],
        "index": 14733,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:18:9",
        "text": [
          "14497-  عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ مُرَازِمٍ عَنْ أَبِيهِ قَالَ خَرَجْنَا مَعَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) حَيْثُ خَرَجَ مِنْ عِنْدِ أَبِي جَعْفَرٍ الْمَنْصُورِ مِنَ الْحِيرَةِ فَخَرَجَ سَاعَةَ أُذِنَ لَهُ وَ انْتَهَى إِلَى السَّالِحِينَ فِي أَوَّلِ اللَّيْلِ فَعَرَضَ لَهُ عَاشِرٌ كَانَ يَكُونُ فِي السَّالِحِينَ فِي أَوَّلِ اللَّيْلِ فَقَالَ لَهُ لَا أَدَعُكَ أَنْ تَجُوزَ فَأَلَحَّ عَلَيْهِ وَ طَلَبَ إِلَيْهِ فَأَبَى إِبَاءً",
          "وَ أَنَا وَ مُصَادِفٌ مَعَهُ فَقَالَ لَهُ مُصَادِفٌ جُعِلْتُ فِدَاكَ إِنَّمَا هَذَا كَلْبٌ قَدْ آذَاكَ وَ أَخَافُ أَنْ يَرُدَّكَ وَ مَا أَدْرِي مَا يَكُونُ مِنْ أَمْرِ أَبِي جَعْفَرٍ وَ أَنَا وَ مُرَازِمٌ أَ تَأْذَنُ لَنَا أَنْ نَضْرِبَ عُنُقَهُ ثُمَّ نَطْرَحَهُ فِي النَّهَرِ فَقَالَ كُفَّ يَا مُصَادِفُ ",
          "فَلَمْ يَزَلْ يَطْلُبُ إِلَيْهِ حَتَّى ذَهَبَ مِنَ اللَّيْلِ أَكْثَرُهُ فَأَذِنَ لَهُ فَمَضَى فَقَالَ يَا مُرَازِمُ هَذَا خَيْرٌ أَمِ الَّذِي قُلْتُمَاهُ قُلْتُ هَذَا جُعِلْتُ فِدَاكَ فَقَالَ إِنَّ الرَّجُلَ يَخْرُجُ مِنَ الذُّلِّ الصَّغِيرِ فَيُدْخِلُهُ ذَلِكَ فِي الذُّلِّ الْكَبِيرِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473152\">H 14497</a> – From him, from Ahmad Bin Muhammad, from Muhammad Bin Murazim, from his father who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-w\">‘W</span>e went out with Abu</span> Abdullah<sup>asws</sup> when he<sup>asws</sup> left from the presence of Abu Ja’far Al-Mansour from Al-Hira. So he<sup>asws</sup> left at the time permitted for him<sup>asws</sup> and ended up at Al-Saliheen in the beginning of the night. A tax collector presented himself to him<sup>asws</sup> who was in Al-Saliheen in the beginning of the night. He said to him<sup>asws</sup>, ‘I will not permit you<sup>asws</sup> to leave’. So he<sup>asws</sup> urged him and requested him, but he refused, rejecting it. ",
            "And I and Musaddaf were with him<sup>asws</sup>. So Musaddaf said to him<sup>asws</sup>, ‘May I be sacrificed for you, but this one is a dog. He has troubled you, and I fear that he would make you<sup>asws</sup> return, and I do not know what would be the order of Abu Ja’far (Al-Mansour). If you<sup>asws</sup> permit us, I and Murazim can strike his neck, then throw him (his body) in the river’. He<sup>asws</sup> said: ‘Restrain yourself, O Musaddaf’.",
            "So he<sup>asws</sup> did not stop requesting him until most of the night had passed, and he permitted him<sup>asws</sup> to pass. He<sup>asws</sup> said: ‘O Murazim, is this better or that which you had said?’ I said, ‘May I be sacrificed for you, this (is better)’. So he<sup>asws</sup> said: ‘The man comes out of the smaller humiliation, but that pushes him enter into the greater humiliation’."
          ],
          "en.sarwar": [
            "49. From him, from Ahmad Bin Muhammad, from Muhammad Bin Murazim, from his father who said: ‘We went out with Abu Abdullah (a.s.) when he (a.s.) left from the presence of Abu Ja’far Al-Mansour from Al-Hira. So he (a.s.) left at the time permitted for him (a.s.) and ended up at Al-Saliheen in the beginning of the night. A tax collector presented himself to him (a.s.) who was in Al-Saliheen in the beginning of the night. He said to him (a.s.), ‘I will not permit you (a.s.) to leave’. So he (a.s.) urged him and requested him, but he refused, rejecting it. And I and Musaddaf were with him (a.s.). So Musaddaf said to him (a.s.), ‘May I be sacrificed for you, but this one is a dog. He has troubled you, and I fear that he would make you (a.s.) return, and I do not know what would be the order of Abu Ja’far (Al-Mansour). If you (a.s.) permit us, I and Murazim can strike his neck, then throw him (his body) in the river’. He (a.s.) said: ‘Restrain yourself, O Musaddaf’. So he (a.s.) did not stop requesting him until most of the night had passed, and he permitted him (a.s.) to pass. He (a.s.) said: ‘O Murazim, is this better or that which you had said?’ I said, ‘May I be sacrificed for you, this (is better)’. So he (a.s.) said: ‘The man comes out of the smaller humiliation, but that pushes him enter into the greater humiliation’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 198)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14734,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:18:10",
        "text": [
          "14498-  عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَجَّالِ عَنْ حَفْصِ بْنِ أَبِي عَائِشَةَ قَالَ بَعَثَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) غُلَاماً لَهُ فِي حَاجَةٍ فَأَبْطَأَ فَخَرَجَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَلَى أَثَرِهِ لَمَّا أَبْطَأَ عَلَيْهِ فَوَجَدَهُ نَائِماً فَجَلَسَ عِنْدَ رَأْسِهِ يُرَوِّحُهُ حَتَّى انْتَبَهَ فَلَمَّا انْتَبَهَ قَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا فُلَانُ وَ اللَّهِ مَا ذَاكَ لَكَ تَنَامُ اللَّيْلَ وَ النَّهَارَ لَكَ اللَّيْلُ وَ لَنَا مِنْكَ النَّهَارُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473153\">H 14498</a> – From him, from Ahmad Bin Muhammad, from Al-Hajjaal, from Hafs Bin Abu A’isha who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>bu Abdullah</span><sup>asws</sup> sent one of his<sup>asws</sup> servants on an errand. He was delayed. So Abu Abdullah<sup>asws</sup> went out to see why he had been delayed. He<sup>asws</sup> found him sleeping. So he<sup>asws</sup> sat near to his head and caressed it (and waited) until he woke up. So when he was awake, Abu Abdullah<sup>asws</sup> said to him: ‘O so and so, by Allah<sup>azwj</sup>, that is not for you. The night is for you to sleep in and the day from you is for us<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "50. From him, from Ahmad Bin Muhammad, from Al-Hajjaal, from Hafs Bin Abu A’isha who said: ‘Abu Abdullah (a.s.) sent one of his (a.s.) servants on an errand. He was delayed. So Abu Abdullah (a.s.) went out to see why he had been delayed. He (a.s.) found him sleeping. So he (a.s.) sat near to his head and caressed it (and waited) until he woke up. So when he was awake, Abu Abdullah (a.s.) said to him: ‘O so and so, by Allah (azwj), that is not for you. The night is for you to sleep in and the day from you is for us (a.s.)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 198)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14735,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:18:11",
        "text": [
          "14499-  عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ حَسَّانَ عَنْ أَبِي عَلِيٍّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ لَا تَذْكُرُوا سِرَّنَا بِخِلَافِ عَلَانِيَتِنَا وَ لَا عَلَانِيَتَنَا بِخِلَافِ سِرِّنَا حَسْبُكُمْ أَنْ تَقُولُوا مَا نَقُولُ وَ تَصْمُتُوا عَمَّا نَصْمُتُ إِنَّكُمْ قَدْ رَأَيْتُمْ أَنَّ اللَّهَ عَزَّ وَ جَلَّ لَمْ يَجْعَلْ لِأَحَدٍ مِنَ النَّاسِ فِي خِلَافِنَا خَيْراً إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ فَلْيَحْذَرِ الَّذِينَ يُخالِفُونَ عَنْ أَمْرِهِ أَنْ تُصِيبَهُمْ فِتْنَةٌ أَوْ يُصِيبَهُمْ عَذابٌ أَلِيمٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473154\">H 14499</a> – From him, from Ahmad Bin Muhammad, from Ali Bin Al-Hakam, from Hassaan, from Abu Ali who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘Do not mention our<sup>asws</sup> secrets opposite to what we<sup>asws</sup> say publicly, and do not publicise us<sup>asws</sup> opposite to our<sup>asws</sup> secrets. It suffices for you all that you should say what we<sup>asws</sup> say, and remain silent about what we have observed silence on. You have seen that Allah<sup>azwj</sup> Mighty and Majestic have never Kept any good for anyone from the people in opposition to us<sup>asws</sup>. Allah<sup>azwj</sup> Mighty and Majestic Says: <span class=\"ibTxt\">“[24:63] therefore let those beware who go against his order lest a trial afflict them or there befalls upon them a painful chastisement.”</span>",
            "out of 567"
          ],
          "en.sarwar": [
            "51. From him, from Ahmad Bin Muhammad, from Ali Bin Al-Hakam, from Hassaan, from Abu Ali who said: ‘I heard Abu Abdullah (a.s.) saying: ‘Do not mention our (a.s.) secrets opposite to what we (a.s.) say publicly, and do not publicise us (a.s.) opposite to our (a.s.) secrets. It suffices for you all that you should say what we (a.s.) say, and remain silent about what we have observed silence on. You have seen that Allah (azwj) Mighty and Majestic have never Kept any good for anyone from the people in opposition to us (a.s.). Allah (azwj) Mighty and Majestic Says: “[24:63] therefore let those beware who go against his order lest a trial afflict them or there befalls upon them a painful chastisement.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:18",
  "kind": "verse_list"
}