{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 19"
        },
        "path": "/books/al-kafi:8:1:19",
        "titles": {
          "ar": "حَدِيثُ الطَّبِيبِ",
          "en": "HADEETH OF THE DOCTOR"
        }
      }
    ],
    "index": 2290,
    "local_index": 19,
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:19",
    "titles": {
      "ar": "حَدِيثُ الطَّبِيبِ",
      "en": "HADEETH OF THE DOCTOR"
    },
    "verse_count": 3,
    "verse_start_index": 14735,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 199)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14736,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:19:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14500</span>- مُحَمَّدٌ عَنْ أَحْمَدَ</span> بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ زِيَادِ بْنِ أَبِي الْحَلَّالِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ مُوسَى (عليه السلام) يَا رَبِّ مِنْ أَيْنَ الدَّاءُ قَالَ مِنِّي قَالَ فَالشِّفَاءُ قَالَ مِنِّي قَالَ فَمَا يَصْنَعُ عِبَادُكَ بِالْمُعَالِجِ قَالَ يُطَيِّبُ بِأَنْفُسِهِمْ فَيَوْمَئِذٍ سُمِّيَ الْمُعَالِجُ الطَّبِيبَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473156\">H 14500</a> – Muhammad, from Ahmad Bin Muhammad, from Ali Bin Al-Hakam, from Ziyad Bin Al-Hallaah, the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘(Prophet) Musa<sup>as</sup> said: ‘O Lord<sup>azwj</sup>! Where does illness come from?’ He<sup>azwj</sup> Said: “From Me<sup>azwj</sup>”. He<sup>as</sup> said: ‘And the cure?’ He<sup>azwj</sup> Said: “From Me<sup>azwj</sup>”. He<sup>asws</sup> said: ‘So what do Your<sup>azwj</sup> servants do with the healer?’ He<sup>azwj</sup> Said: “They soothe themselves by him”. These days the healer is called the Doctor’."
          ],
          "en.sarwar": [
            "52. Muhammad, from Ahmad Bin Muhammad, from Ali Bin Al-Hakam, from Ziyad Bin Al-Hallaah, the following: Abu Abdullah (a.s.) having said: ‘(Prophet) Musa (as) said: ‘O Lord (azwj)! Where does illness come from?’ He (azwj) Said: “From Me (azwj)”. He (as) said: ‘And the cure?’ He (azwj) Said: “From Me (azwj)”. He (a.s.) said: ‘So what do Your (azwj) servants do with the healer?’ He (azwj) Said: “They soothe themselves by him”. These days the healer is called the Doctor’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 200)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14737,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:19:2",
        "text": [
          "14501-  عَنْهُ عَنْ أَحْمَدَ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ أَبِي أَيُّوبَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا مِنْ دَاءٍ إِلَّا وَ هُوَ سَارِعٌ إِلَى الْجَسَدِ يَنْتَظِرُ مَتَى يُؤْمَرُ بِهِ فَيَأْخُذَهُ وَ فِي رِوَايَةٍ أُخْرَى إِلَّا الْحُمَّى فَإِنَّهَا تَرِدُ وُرُوداً ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473157\">H 14501</a> – From him, from Ahmad, from Ibn Fazzaal, from Ibn Bukeyr, from Abu Ayyub, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘There is none from the illnesses, but it waits, prior to rushing to the body (infecting), until after getting orders to act upon it’. And in another report: ‘Except for the fever, for it starts working as it comes’."
          ],
          "en.sarwar": [
            "53. From him, from Ahmad, from Ibn Fazzaal, from Ibn Bukeyr, from Abu Ayyub, who has said: Abu Abdullah (a.s.) said: ‘There is none from the illnesses, but it waits, prior to rushing to the body (infecting), until after getting orders to act upon it’. And in another report: ‘Except for the fever, for it starts working as it comes’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 200)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14738,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:19:3",
        "text": [
          "14502-  عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ الْمُهْتَدِي عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ دَاوُدَ بْنِ زُرْبِيٍّ قَالَ مَرِضْتُ بِالْمَدِينَةِ مَرَضاً شَدِيداً فَبَلَغَ ذَلِكَ أَبَا عَبْدِ اللَّهِ (عليه السلام) فَكَتَبَ إِلَيَّ قَدْ بَلَغَنِي عِلَّتُكَ فَاشْتَرِ صَاعاً مِنْ بُرٍّ ثُمَّ اسْتَلْقِ عَلَى قَفَاكَ وَ انْثُرْهُ عَلَى صَدْرِكَ كَيْفَمَا انْتَثَرَ وَ قُلِ اللَّهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ الَّذِي إِذَا سَأَلَكَ بِهِ الْمُضْطَرُّ كَشَفْتَ مَا بِهِ مِنْ ضُرٍّ وَ مَكَّنْتَ لَهُ فِي الْأَرْضِ وَ جَعَلْتَهُ خَلِيفَتَكَ عَلَى خَلْقِكَ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَ عَلَى أَهْلِ بَيْتِهِ وَ أَنْ تُعَافِيَنِي مِنْ عِلَّتِي ثُمَّ اسْتَوِ جَالِساً وَ اجْمَعِ الْبُرَّ مِنْ حَوْلِكَ وَ قُلْ مِثْلَ ذَلِكَ وَ اقْسِمْهُ مُدّاً مُدّاً لِكُلِّ مِسْكِينٍ وَ قُلْ مِثْلَ ذَلِكَ قَالَ دَاوُدُ فَفَعَلْتُ مِثْلَ ذَلِكَ فَكَأَنَّمَا نُشِطْتُ مِنْ عِقَالٍ وَ قَدْ فَعَلَهُ غَيْرُ وَاحِدٍ فَانْتَفَعَ بِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473158\">H 14502</a> – From him, from Ahmad Bin Muhammad, from Abdul Aziz Bin Al-Muhtady, from Yunus Bin Abdul Rahmaan, from Dawood Bin Zurby who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> fell ill in Al-Medina</span> with intense illness, and that (news) reached Abu Abdullah<sup>asws</sup>. So he<sup>asws</sup> wrote to me: ‘It has reached me<sup>asws</sup> (news of) your illness. Buy one Sa’a of wheat, then lie down on your back and scatter it upon your chest a scattering and say, ‘Our Allah<sup>azwj</sup>! I hereby ask You<sup>azwj</sup> by Your<sup>azwj</sup> Name which the restless (Al-Muztar i.e. Al-Qaim<sup>asws</sup>) asks You<sup>azwj</sup> to Remove the adversities, and Enable him<sup>asws</sup> in the earth and Make him<sup>asws</sup> as Your<sup>azwj</sup> Caliph upon Your<sup>azwj</sup> creatures, and send greetings upon Muhammad<sup>saww</sup> and upon the People<sup>asws</sup> of his<sup>saww</sup> Household, and Cure me from my illness’. Then sit straight and gather the wheat which is around you and say the like of that (again) and distribute one Mudd by one Mudd to each of the poor and say the like of that (again)’. Dawood said, ‘I did the like of that and I was as if I had been disentangled from a knot, and more than one person did that, so they all benefitted by it’."
          ],
          "en.sarwar": [
            "54. From him, from Ahmad Bin Muhammad, from Abdul Aziz Bin Al-Muhtady, from Yunus Bin Abdul Rahmaan, from Dawood Bin Zurby who said: ‘I fell ill in Al-Medina with intense illness, and that (news) reached Abu Abdullah (a.s.). So he (a.s.) wrote to me: ‘It has reached me (a.s.) (news of) your illness. Buy one Sa’a of wheat, then lie down on your back and scatter it upon your chest a scattering and say, ‘Our Allah (azwj)! I hereby ask You (azwj) by Your (azwj) Name which the restless (Al-Muztar i.e. Al-Qaim (a.s.)) asks You (azwj) to Remove the adversities, and Enable him (a.s.) in the earth and Make him (a.s.) as Your (azwj) Caliph upon Your (azwj) creatures, and send greetings upon Muhammad (saww) and upon the People (a.s.) of his (saww) Household, and Cure me from my illness’. Then sit straight and gather the wheat which is around you and say the like of that (again) and distribute one Mudd by one Mudd to each of the poor and say the like of that (again)’. Dawood said, ‘I did the like of that and I was as if I had been disentangled from a knot, and more than one person did that, so they all benefitted by it’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:19",
  "kind": "verse_list"
}