{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 2"
        },
        "path": "/books/al-kafi:8:1:2",
        "titles": {
          "ar": "صَحِيفَةُ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) وَ كَلَامُهُ فِي الزُّهْدِ       ",
          "en": "THE PARCHMENT OF ALI BIN AL-HUSAYN<sup>asws</sup> AND HIS<sup>asws</sup> SPEECH REGARDING THE ASCETISM"
        }
      }
    ],
    "index": 2273,
    "local_index": 2,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:8:1:3",
        "titles": {
          "ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) وَ هِيَ خُطْبَةُ الْوَسِيلَةِ",
          "en": "SERMON OF AMIR –UL- MOMINEEN<sup>asws</sup> AND IT IS THE SERMON OF THE MEANS (AL-WASEELA)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 1"
        },
        "path": "/books/al-kafi:8:1:1",
        "titles": {
          "ar": "&#1576;&#1616;&#1587;&#1618;&#1605;&#1616; &#1575;&#1604;&#1604;&#1617;&#1614;&#1607;&#1616; &#1575;&#1604;&#1585;&#1617;&#1614;&#1581;&#1618;&#1605;&#1614;&#1606;&#1616; &#1575;&#1604;&#1585;&#1617;&#1614;&#1581;&#1616;&#1610;&#1605;&#1616;",
          "en": "<a id=\"_Toc492473087\">H 14449</a> - Muhammad Ibn Yaqub Al-Kulayni has narrated that, ‘Narrated to me Ali Ibn Ibrahim from his father from Ibn FaddAl-from Hafs al-Mu'Adhdhin from Abu Abdullah<sup>asws </sup>as well as Muhammad Ibn 'Ismail Ibn Bazi' from Muhammad Ibn Sinan from 'Ismail Ibn Jabir that -  "
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:2",
    "titles": {
      "ar": "صَحِيفَةُ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) وَ كَلَامُهُ فِي الزُّهْدِ       ",
      "en": "THE PARCHMENT OF ALI BIN AL-HUSAYN<sup>asws</sup> AND HIS<sup>asws</sup> SPEECH REGARDING THE ASCETISM"
    },
    "verse_count": 2,
    "verse_start_index": 14685,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 14686,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:2:1",
        "refs": {
          "Quran": [
            "/books/quran:35:28"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14450</span>-  مُحَمَّدُ بْنُ</span> يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ أَبِي حَمْزَةَ قَالَ مَا سَمِعْتُ بِأَحَدٍ مِنَ النَّاسِ كَانَ أَزْهَدَ مِنْ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) إِلَّا مَا بَلَغَنِي مِنْ عَلِيِّ بْنِ أَبِي طَالِبٍ ( عليه السلام ) ",
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ق</span>َالَ أَبُو حَمْزَةَ</span> كَانَ الْإِمَامُ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) إِذَا تَكَلَّمَ فِي الزُّهْدِ وَ وَعَظَ أَبْكَى مَنْ بِحَضْرَتِهِ ",
          "قَالَ أَبُو حَمْزَةَ وَ قَرَأْتُ صَحِيفَةً فِيهَا كَلَامُ زُهْدٍ مِنْ كَلَامِ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) وَ كَتَبْتُ مَا فِيهَا ثُمَّ أَتَيْتُ عَلِيَّ بْنَ الْحُسَيْنِ ( صلوات الله عليه ) فَعَرَضْتُ مَا فِيهَا عَلَيْهِ فَعَرَفَهُ وَ صَحَّحَهُ وَ كَانَ مَا فِيهَا",
          "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ كَفَانَا اللَّهُ وَ إِيَّاكُمْ كَيْدَ الظَّالِمِينَ وَ بَغْيَ الْحَاسِدِينَ وَ بَطْشَ الْجَبَّارِينَ ",
          "أَيُّهَا الْمُؤْمِنُونَ لَا يَفْتِنَنَّكُمُ الطَّوَاغِيتُ وَ أَتْبَاعُهُمْ مِنْ أَهْلِ الرَّغْبَةِ فِي هَذِهِ الدُّنْيَا الْمَائِلُونَ إِلَيْهَا الْمُفْتَتِنُونَ بِهَا الْمُقْبِلُونَ عَلَيْهَا وَ عَلَى حُطَامِهَا الْهَامِدِ وَ هَشِيمِهَا الْبَائِدِ غَداً وَ احْذَرُوا مَا حَذَّرَكُمُ اللَّهُ مِنْهَا وَ ازْهَدُوا فِيمَا زَهَّدَكُمُ اللَّهُ فِيهِ مِنْهَا وَ لَا تَرْكَنُوا إِلَى مَا فِي هَذِهِ الدُّنْيَا رُكُونَ مَنِ اتَّخَذَهَا دَارَ قَرَارٍ وَ مَنْزِلَ اسْتِيطَانٍ ",
          "وَ اللَّهِ إِنَّ لَكُمْ مِمَّا فِيهَا عَلَيْهَا لَدَلِيلًا وَ تَنْبِيهاً مِنْ تَصْرِيفِ أَيَّامِهَا وَ تَغَيُّرِ انْقِلَابِهَا وَ مَثُلَاتِهَا وَ تَلَاعُبِهَا بِأَهْلِهَا إِنَّهَا لَتَرْفَعُ الْخَمِيلَ وَ تَضَعُ الشَّرِيفَ وَ تُورِدُ أَقْوَاماً إِلَى النَّارِ غَداً",
          "فَفِي هَذَا مُعْتَبَرٌ وَ مُخْتَبَرٌ وَ زَاجِرٌ لِمُنْتَبِهٍ إِنَّ الْأُمُورَ الْوَارِدَةَ عَلَيْكُمْ فِي كُلِّ يَوْمٍ وَ لَيْلَةٍ مِنْ مُظْلِمَاتِ الْفِتَنِ وَ حَوَادِثِ الْبِدَعِ وَ سُنَنِ الْجَوْرِ وَ بَوَائِقِ الزَّمَانِ وَ هَيْبَةِ السُّلْطَانِ وَ وَسْوَسَةِ الشَّيْطَانِ لَتُثَبِّطُ الْقُلُوبَ عَنْ تَنَبُّهِهَا وَ تُذْهِلُهَا عَنْ مَوْجُودِ الْهُدَى وَ مَعْرِفَةِ أَهْلِ الْحَقِّ إِلَّا قَلِيلًا مِمَّنْ عَصَمَ اللَّهُ فَلَيْسَ يَعْرِفُ تَصَرُّفَ أَيَّامِهَا وَ تَقَلُّبَ حَالَاتِهَا وَ عَاقِبَةَ ضَرَرِ فِتْنَتِهَا إِلَّا مَنْ عَصَمَ اللَّهُ وَ نَهَجَ سَبِيلَ الرُّشْدِ وَ سَلَكَ طَرِيقَ الْقَصْدِ ",
          "ثُمَّ اسْتَعَانَ عَلَى ذَلِكَ بِالزُّهْدِ فَكَرَّرَ الْفِكْرَ وَ اتَّعَظَ بِالصَّبْرِ فَازْدَجَرَ وَ زَهِدَ فِي عَاجِلِ بَهْجَةِ الدُّنْيَا وَ تَجَافَى عَنْ لَذَّاتِهَا وَ رَغِبَ فِي دَائِمِ نَعِيمِ الْآخِرَةِ وَ سَعَى لَهَا سَعْيَهَا وَ رَاقَبَ الْمَوْتَ وَ شَنَأَ الْحَيَاةَ مَعَ الْقَوْمِ الظَّالِمِينَ نَظَرَ إِلَى مَا فِي الدُّنْيَا بِعَيْنٍ نَيِّرَةٍ حَدِيدَةَ الْبَصَرِ وَ أَبْصَرَ حَوَادِثَ الْفِتَنِ وَ ضَلَالَ الْبِدَعِ وَ جَوْرَ الْمُلُوكِ الظَّلَمَةِ",
          "فَلَقَدْ لَعَمْرِي اسْتَدْبَرْتُمُ الْأُمُورَ الْمَاضِيَةَ فِي الْأَيَّامِ الْخَالِيَةِ مِنَ الْفِتَنِ الْمُتَرَاكِمَةِ وَ الِانْهِمَاكِ فِيمَا تَسْتَدِلُّونَ بِهِ عَلَى تَجَنُّبِ الْغُوَاةِ وَ أَهْلِ الْبِدَعِ وَ الْبَغْيِ وَ الْفَسَادِ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ فَاسْتَعِينُوا بِاللَّهِ وَ ارْجِعُوا إِلَى طَاعَةِ اللَّهِ وَ طَاعَةِ مَنْ هُوَ أَوْلَى بِالطَّاعَةِ مِمَّنِ اتُّبِعَ فَأُطِيعَ",
          "فَالْحَذَرَ الْحَذَرَ مِنْ قَبْلِ النَّدَامَةِ وَ الْحَسْرَةِ وَ الْقُدُومِ عَلَى اللَّهِ وَ الْوُقُوفِ بَيْنَ يَدَيْهِ وَ تَاللَّهِ مَا صَدَرَ قَوْمٌ قَطُّ عَنْ مَعْصِيَةِ اللَّهِ إِلَّا إِلَى عَذَابِهِ وَ مَا آثَرَ قَوْمٌ قَطُّ الدُّنْيَا عَلَى الْآخِرَةِ إِلَّا سَاءَ مُنْقَلَبُهُمْ وَ سَاءَ مَصِيرُهُمْ وَ مَا الْعِلْمُ بِاللَّهِ وَ الْعَمَلُ إِلَّا إِلْفَانِ مُؤْتَلِفَانِ فَمَنْ عَرَفَ اللَّهَ خَافَهُ وَ حَثَّهُ الْخَوْفُ عَلَى الْعَمَلِ بِطَاعَةِ اللَّهِ وَ إِنَّ أَرْبَابَ الْعِلْمِ وَ أَتْبَاعَهُمُ الَّذِينَ عَرَفُوا اللَّهَ فَعَمِلُوا لَهُ وَ رَغِبُوا إِلَيْهِ وَ قَدْ قَالَ اللَّهُ إِنَّما يَخْشَى اللَّهَ مِنْ عِبادِهِ الْعُلَماءُ",
          "فَلَا تَلْتَمِسُوا شَيْئاً مِمَّا فِي هَذِهِ الدُّنْيَا بِمَعْصِيَةِ اللَّهِ وَ اشْتَغِلُوا فِي هَذِهِ الدُّنْيَا بِطَاعَةِ اللَّهِ وَ اغْتَنِمُوا أَيَّامَهَا وَ اسْعَوْا لِمَا فِيهِ نَجَاتُكُمْ غَداً مِنْ عَذَابِ اللَّهِ فَإِنَّ ذَلِكَ أَقَلُّ لِلتَّبِعَةِ وَ أَدْنَى مِنَ الْعُذْرِ وَ أَرْجَى لِلنَّجَاةِ فَقَدِّمُوا أَمْرَ اللَّهِ وَ طَاعَةَ مَنْ أَوْجَبَ اللَّهُ طَاعَتَهُ بَيْنَ يَدَيِ الْأُمُورِ كُلِّهَا وَ لَا تُقَدِّمُوا الْأُمُورَ الْوَارِدَةَ عَلَيْكُمْ مِنْ طَاعَةِ الطَّوَاغِيتِ مِنْ زَهْرَةِ الدُّنْيَا بَيْنَ يَدَيِ اللَّهِ وَ طَاعَتِهِ وَ طَاعَةِ أُولِي الْأَمْرِ مِنْكُمْ",
          "وَ اعْلَمُوا أَنَّكُمْ عَبِيدُ اللَّهِ وَ نَحْنُ مَعَكُمْ يَحْكُمُ عَلَيْنَا وَ عَلَيْكُمْ سَيِّدٌ حَاكِمٌ غَداً وَ هُوَ مُوقِفُكُمْ وَ مُسَائِلُكُمْ فَأَعِدُّوا الْجَوَابَ قَبْلَ الْوُقُوفِ وَ الْمُسَاءَلَةِ وَ الْعَرْضِ عَلَى رَبِّ الْعَالَمِينَ يَوْمَئِذٍ لَا تَكَلَّمُ نَفْسٌ إِلَّا بِإِذْنِهِ",
          "وَ اعْلَمُوا أَنَّ اللَّهَ لَا يُصَدِّقُ يَوْمَئِذٍ كَاذِباً وَ لَا يُكَذِّبُ صَادِقاً وَ لَا يَرُدُّ عُذْرَ مُسْتَحِقٍّ وَ لَا يَعْذِرُ غَيْرَ مَعْذُورٍ لَهُ الْحُجَّةُ عَلَى خَلْقِهِ بِالرُّسُلِ وَ الْأَوْصِيَاءِ بَعْدَ الرُّسُلِ فَاتَّقُوا اللَّهَ عِبَادَ اللَّهِ وَ اسْتَقْبِلُوا فِي إِصْلَاحِ أَنْفُسِكُمْ وَ طَاعَةِ اللَّهِ وَ طَاعَةِ مَنْ تَوَلَّوْنَهُ فِيهَا لَعَلَّ نَادِماً قَدْ نَدِمَ فِيمَا فَرَّطَ بِالْأَمْسِ فِي جَنْبِ اللَّهِ وَ ضَيَّعَ مِنْ حُقُوقِ اللَّهِ وَ اسْتَغْفِرُوا اللَّهَ وَ تُوبُوا إِلَيْهِ فَإِنَّهُ يَقْبَلُ التَّوْبَةَ وَ يَعْفُو عَنِ السَّيِّئَةِ وَ يَعْلَمُ مَا تَفْعَلُونَ",
          "وَ إِيَّاكُمْ وَ صُحْبَةَ الْعَاصِينَ وَ مَعُونَةَ الظَّالِمِينَ وَ مُجَاوَرَةَ الْفَاسِقِينَ احْذَرُوا فِتْنَتَهُمْ وَ تَبَاعَدُوا مِنْ سَاحَتِهِمْ وَ اعْلَمُوا أَنَّهُ مَنْ خَالَفَ أَوْلِيَاءَ اللَّهِ وَ دَانَ بِغَيْرِ دِينِ اللَّهِ وَ اسْتَبَدَّ بِأَمْرِهِ دُونَ أَمْرِ وَلِيِّ اللَّهِ كَانَ فِي نَارٍ تَلْتَهِبُ تَأْكُلُ أَبْدَاناً قَدْ غَابَتْ عَنْهَا أَرْوَاحُهَا وَ غَلَبَتْ عَلَيْهَا شِقْوَتُهَا فَهُمْ مَوْتَى لَا يَجِدُونَ حَرَّ النَّارِ وَ لَوْ كَانُوا أَحْيَاءً لَوَجَدُوا مَضَضَ حَرِّ النَّارِ ",
          "وَ اعْتَبِرُوا يَا أُولِي الْأَبْصَارِ وَ احْمَدُوا اللَّهَ عَلَى مَا هَدَاكُمْ وَ اعْلَمُوا أَنَّكُمْ لَا تَخْرُجُونَ مِنْ قُدْرَةِ اللَّهِ إِلَى غَيْرِ قُدْرَتِهِ وَ سَيَرَى اللَّهُ عَمَلَكُمْ وَ رَسُولُهُ ثُمَّ إِلَيْهِ تُحْشَرُونَ فَانْتَفِعُوا بِالْعِظَةِ وَ تَأَدَّبُوا بِآدَابِ الصَّالِحِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473089\">H 14450</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, and Ali Bin Ibrahim, from his father, altogether from Al-Hassan Bin Mahboub, from Malik Bin Atiyya, from Abu Hamza who said, ‘I have not heard of anyone who was more ascetic (pious) than Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> except for what has reached to me from Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>’. ",
            "Abu Hamza said, ‘Whenever Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> spoke regarding the ascetism (self restrain), those who were present with him<sup>asws</sup> , (their eyes) would be filled with tears’.",
            "Abu Hamza said, ‘And I read a Parchment in which was the speech on ascetism from the speeches of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, and I wrote down what was in it. Then I came to Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, so I presented what was in it to him<sup>asws</sup>. He<sup>asws</sup> recognised it, and corrected (my mistakes) from what I had (in my notes)’.",
            "In the Name of Allah<sup>azwj</sup>, the Beneficent, the Merciful. Allah<sup>azwj</sup> is sufficient for us<sup>asws</sup>. And beware of the plots of the unjust ones, and the rebellion of the envious ones, and the threats of the aggressors. ",
            "O you Believers! Do not be deceived by the tyrants and those who follow them, from the people who covet this world, those that are inclined towards it, those who have been deceived by it, those who go towards it, and to its lifeless ruins, and its chaff which will be defunct tomorrow. And be cautious of what Allah<sup>azwj</sup> has Cautioned you from it, and abstain with regards to what Allah<sup>azwj</sup> has Told you to abstain from it, and do not incline towards what is in this world, inclining like the ones who has taken it to be as a house for permanent dwelling. ",
            "By Allah<sup>azwj</sup>, that which is in it is evidence for you and a warning from the changing of its days, and its conditions, and its examples, and it’s playing with its people. It raises the fallen one and degrades the honourable one, and it will return its people to the Fire tomorrow. ",
            "In it, there is a significant learning and warning, that the affairs which you come across every day and night from the darkness of the strife, and the new innovations, and the unjust traditions, and the commotions of the era, and the dignity of the Sultan, and the whisperings of the Satan<sup>la</sup>, all discourage the hearts from taking lessons from it, and boggle it from finding guidance, and the recognition of the people of the truth, except for a few whom Allah<sup>azwj</sup> has Protected. There is no one who will understand the changing of its days, and the alteration of its conditions, and hurtful consequences of its strife except for the one who is Protected by Allah<sup>azwj</sup>, and Makes him to approach the way of guidance, and travels on the road purposefully. ",
            "Then (he obtains) help against that by the ascetism, frequent thinking, paying attention to patience in order to notice the warning, and abstain from the immediate delights of the world, and defy its pleasures, and desire the Eternal Bliss of the Hereafter, and strive for it a striving. And he monitors the (approach of) death and passing away of the life with the unjust people. He looks at what is in the world with an illuminated vision, and the strife-taking place, and the misguidance of the innovations, and the injustices of the unjust kings. ",
            "By my<sup>asws</sup> life, you have matters from the past which were from days in which were free from strife, pre-occupations and engagements which have evidenced for you on avoiding the misguided and the people of innovation (Heretics) who rebel and create mischief in the earth without any right to do so. So seek Help from Allah<sup>azwj</sup> and return to the obedience of Allah<sup>azwj</sup> and the obedience of the one<sup>asws</sup> who is the foremost for the obedience and to be followed and obeyed. ",
            "So beware of the danger before the remorse and the regret before proceeding to Allah<sup>azwj</sup> and the pausing in front of Him<sup>azw</sup><sup>j</sup>, and no people ever went to Allah<sup>azwj</sup> after having disobeyed Him<sup>azwj</sup> except to His<sup>azwj</sup> Punishment, and no people preferred the world over the Hereafter at all except that evil was their return, and evil was their journey. The Knowledge, by Allah<sup>azwj</sup> and the deeds are nothing but two harmonious matters. So the one who recognises Allah<sup>azwj</sup> fears Him<sup>azwj</sup>, and the fear urges him to the deeds in obedience to Allah<sup>azwj</sup> and that the heads of the knowledge and those that follow them recognise Allah<sup>azwj</sup> so they work (do deeds) for Him<sup>azwj</sup> and desire towards Him<sup>azwj</sup>, and Allah<sup>azwj</sup> has Said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:35#h28\">[35:28]</a> Those truly fear Allah, among His Servants, who have knowledge”</span>.",
            "So do not seek anything from this world by being disobedient to Allah<sup>azwj</sup>, and preoccupy yourselves in this world by obedience to Allah<sup>azwj</sup>, and seize its days, in a way to ensure your salvation ‘Tomorrow’ from the Punishment of Allah<sup>azwj</sup>. That is the smallest consequence and the lowest form of excuse and the hope for the salvation. So give priority to the Commands of Allah<sup>azwj</sup> and the obedience to the one<sup>asws</sup> whose obedience Allah<sup>azwj</sup> has Made it to be more than obligatory in all the matters in front of you. Do not give priority to the commands, which come to you from being obedient to the tyrants about the attractions of this world as oppose to that of Allah<sup>azwj</sup> but rather submit to Him<sup>azwj</sup>, and to the Masters of the Command<sup>asws</sup> (Ul Al-Amr) from among you.",
            "And know that you are all servants of Allah<sup>azwj</sup> and we<sup>asws</sup> are with you. There is a Ruler<sup>azwj</sup> Who will Rule over us<sup>asws</sup> and you tomorrow, who is the Chief of the rulers. And He<sup>azwj</sup> will Make you to pause and Question you, so prepare the answer before the pausing and the Questioning and presentation to the Lord<sup>azwj</sup> of the Worlds on the Day in which no soul shall speak except by His<sup>azwj</sup> Permission.",
            "And know that Allah<sup>azwj</sup>, on that Day, will neither Ratify a liar nor will He<sup>azwj</sup> Belie a truthful one, nor will He<sup>azwj</sup> Reject the excuse of a deserving one, nor Excuse the one who has no justification, as He<sup>azwj</sup> has the Proof over His<sup>azwj</sup> creatures by the Messengers<sup>as</sup> and the successors<sup>as</sup> of the Messengers<sup>sa</sup>. So fear Allah<sup>azwj</sup>, servants of Allah<sup>azwj</sup>, and welcome the correctors to yourselves, and the obedience to Allah<sup>azwj</sup> and the obedience to the ones<sup>asws</sup> whom Allah<sup>azwj</sup> has Made to be Guardians regarding it. Perhaps the remorseful ones may regret for having wasted their yesterday regarding the Side of Allah<sup>azwj</sup> (Junb Allah<sup>azwj</sup> i.e. Ali<sup>asws</sup>), and wasted the Rights of Allah<sup>azwj</sup>. And seek Forgiveness from Allah<sup>azwj</sup> and repent to Him<sup>azwj</sup> for He<sup>azwj</sup> Accepts the repentance, and Forgives the sins and Knows what you are doing. ",
            "And beware of the company of the disobedience ones, and the help of the unjust ones, and the compulsions of the mischievous ones. Be cautious of their strife and distance yourselves from their places. And know that the one who opposes the Guardians<sup>asws</sup> of Allah<sup>azwj</sup>, and makes it to be a Religion without the Religion of Allah<sup>azwj</sup>, and issues commands other than the commands of the Guardians<sup>asws</sup> of Allah<sup>azwj</sup> will be in the Inflamed Fire, which consumes the bodies from which its spirit is absent, and which have been overcome by its misfortune. (At preent) they are dead, not feeling the heat of the Fire, and had they been alive they would have found their suffering in the heat of the Fire.",
            "And take a lesson, O people of vision, and Praise Allah<sup>azwj</sup> for what He<sup>azwj</sup> has Guided you with, and know that you cannot escape from the Power of Allah<sup>azwj</sup> to another power. Allah<sup>azwj</sup> Sees your deeds, as well as His<sup>azwj</sup> Messenger, then to them will be your resurrection. So benefit from the advice, and educate yourselves with the discipline of the righteous."
          ],
          "en.sarwar": [
            "2. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, and Ali Bin Ibrahim, from his father, altogether from Al-Hassan Bin Mahboub, from Malik Bin Atiyya, from Abu Hamza who said, ‘I have not heard of anyone who was more ascetic (pious) than Ali (a.s.) Bin Al-Husayn (a.s.) except for what has reached to me from Ali (a.s.) Bin Abu Talib (a.s.)’. Abu Hamza said, ‘Whenever Ali (a.s.) Bin Al-Husayn (a.s.) spoke regarding the ascetism (self restrain), those who were present with him (a.s.) , (their eyes) would be filled with tears’. Abu Hamza said, ‘And I read a Parchment in which was the speech on ascetism from the speeches of Ali (a.s.) Bin Al-Husayn (a.s.), and I wrote down what was in it. Then I came to Ali (a.s.) Bin Al-Husayn (a.s.), so I presented what was in it to him (a.s.). He (a.s.) recognised it, and corrected (my mistakes) from what I had (in my notes)’. In the Name of Allah (azwj), the Beneficent, the Merciful. Allah (azwj) is sufficient for us (a.s.). And beware of the plots of the unjust ones, and the rebellion of the envious ones, and the threats of the aggressors. O you Believers! Do not be deceived by the tyrants and those who follow them, from the people who covet this world, those that are inclined towards it, those who have been deceived by it, those who go towards it, and to its lifeless ruins, and its chaff which will be defunct tomorrow. And be cautious of what Allah (azwj) has Cautioned you from it, and abstain with regards to what Allah (azwj) has Told you to abstain from it, and do not incline towards what is in this world, inclining like the ones who has taken it to be as a house for permanent dwelling. By Allah (azwj), that which is in it is evidence for you and a warning from the changing of its days, and its conditions, and its examples, and it’s playing with its people. It raises the fallen one and degrades the honourable one, and it will return its people to the Fire tomorrow. In it, there is a significant learning and warning, that the affairs which you come across every day and night from the darkness of the strife, and the new innovations, and the unjust traditions, and the commotions of the era, and the dignity of the Sultan, and the whisperings of the Satan (la), all discourage the hearts from taking lessons from it, and boggle it from finding guidance, and the recognition of the people of the truth, except for a few whom Allah (azwj) has Protected. There is no one who will understand the changing of its days, and the alteration of its conditions, and hurtful consequences of its strife except for the one who is Protected by Allah (azwj), and Makes him to approach the way of guidance, and travels on the road purposefully. Then (he obtains) help against that by the ascetism, frequent thinking, paying attention to patience in order to notice the warning, and abstain from the immediate delights of the world, and defy its pleasures, and desire the Eternal Bliss of the Hereafter, and strive for it a striving. And he monitors the (approach of) death and passing away of the life with the unjust people. He looks at what is in the world with an illuminated vision, and the strife-taking place, and the misguidance of the innovations, and the injustices of the unjust kings. By my (a.s.) life, you have matters from the past which were from days in which were free from strife, pre-occupations and engagements which have evidenced for you on avoiding the misguided and the people of innovation (Heretics) who rebel and create mischief in the earth without any right to do so. So seek Help from Allah (azwj) and return to the obedience of Allah (azwj) and the obedience of the one (a.s.) who is the foremost for the obedience and to be followed and obeyed. So beware of the danger before the remorse and the regret before proceeding to Allah (azwj) and the pausing in front of Him (azwj), and no people ever went to Allah (azwj) after having disobeyed Him (azwj) except to His (azwj) Punishment, and no people preferred the world over the Hereafter at all except that evil was their return, and evil was their journey. The Knowledge, by Allah (azwj) and the deeds are nothing but two harmonious matters. So the one who recognises Allah (azwj) fears Him (azwj), and the fear urges him to the deeds in obedience to Allah (azwj) and that the heads of the knowledge and those that follow them recognise Allah (azwj) so they work (do deeds) for Him (azwj) and desire towards Him (azwj), and Allah (azwj) has Said: “<a href=\"/#/books/quran:35#h28\">[35:28]</a> Those truly fear Allah, among His Servants, who have knowledge”. So do not seek anything from this world by being disobedient to Allah (azwj), and preoccupy yourselves in this world by obedience to Allah (azwj), and seize its days, in a way to ensure your salvation ‘Tomorrow’ from the Punishment of Allah (azwj). That is the smallest consequence and the lowest form of excuse and the hope for the salvation. So give priority to the Commands of Allah (azwj) and the obedience to the one (a.s.) whose obedience Allah (azwj) has Made it to be more than obligatory in all the matters in front of you. Do not give priority to the commands, which come to you from being obedient to the tyrants about the attractions of this world as oppose to that of Allah (azwj) but rather submit to Him (azwj), and to the Masters of the Command (a.s.) (Ul Al-Amr) from among you. And know that you are all servants of Allah (azwj) and we (a.s.) are with you. There is a Ruler (azwj) Who will Rule over us (a.s.) and you tomorrow, who is the Chief of the rulers. And He (azwj) will Make you to pause and Question you, so prepare the answer before the pausing and the Questioning and presentation to the Lord (azwj) of the Worlds on the Day in which no soul shall speak except by His (azwj) Permission. And know that Allah (azwj), on that Day, will neither Ratify a liar nor will He (azwj) Belie a truthful one, nor will He (azwj) Reject the excuse of a deserving one, nor Excuse the one who has no justification, as He (azwj) has the Proof over His (azwj) creatures by the Messengers (as) and the successors (as) of the Messengers (sa). So fear Allah (azwj), servants of Allah (azwj), and welcome the correctors to yourselves, and the obedience to Allah (azwj) and the obedience to the ones (a.s.) whom Allah (azwj) has Made to be Guardians regarding it. Perhaps the remorseful ones may regret for having wasted their yesterday regarding the Side of Allah (azwj) (Junb Allah (azwj) i.e. Ali (a.s.)), and wasted the Rights of Allah (azwj). And seek Forgiveness from Allah (azwj) and repent to Him (azwj) for He (azwj) Accepts the repentance, and Forgives the sins and Knows what you are doing. And beware of the company of the disobedience ones, and the help of the unjust ones, and the compulsions of the mischievous ones. Be cautious of their strife and distance yourselves from their places. And know that the one who opposes the Guardians (a.s.) of Allah (azwj), and makes it to be a Religion without the Religion of Allah (azwj), and issues commands other than the commands of the Guardians (a.s.) of Allah (azwj) will be in the Inflamed Fire, which consumes the bodies from which its spirit is absent, and which have been overcome by its misfortune. (At preent) they are dead, not feeling the heat of the Fire, and had they been alive they would have found their suffering in the heat of the Fire. And take a lesson, O people of vision, and Praise Allah (azwj) for what He (azwj) has Guided you with, and know that you cannot escape from the Power of Allah (azwj) to another power. Allah (azwj) Sees your deeds, as well as His (azwj) Messenger, then to them will be your resurrection. So benefit from the advice, and educate yourselves with the discipline of the righteous."
          ]
        }
      },
      {
        "index": 14687,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:2:2",
        "refs": {
          "Quran": [
            "/books/quran:18:45"
          ]
        },
        "text": [
          "14451-  أَحْمَدُ بْنُ مُحَمَّدِ بْنِ أَحْمَدَ الْكُوفِيُّ وَ هُوَ الْعَاصِمِيُّ عَنْ عَبْدِ الْوَاحِدِ بْنِ الصَّوَّافِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ الْهَمْدَانِيِّ عَنْ أَبِي الْحَسَنِ مُوسَى ( عليه السلام ) قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) يُوصِي أَصْحَابَهُ وَ يَقُولُ أُوصِيكُمْ بِتَقْوَى اللَّهِ فَإِنَّهَا غِبْطَةُ الطَّالِبِ الرَّاجِي وَ ثِقَةُ الْهَارِبِ اللَّاجِي ",
          "وَ اسْتَشْعِرُوا التَّقْوَى شِعَاراً بَاطِناً وَ اذْكُرُوا اللَّهَ ذِكْراً خَالِصاً تَحْيَوْا بِهِ أَفْضَلَ الْحَيَاةِ وَ تَسْلُكُوا بِهِ طَرِيقَ النَّجَاةِ ",
          "انْظُرُوا فِي الدُّنْيَا نَظَرَ الزَّاهِدِ الْمُفَارِقِ لَهَا فَإِنَّهَا تُزِيلُ الثَّاوِيَ السَّاكِنَ وَ تَفْجَعُ الْمُتْرَفَ الْآمِنَ لَا يُرْجَى مِنْهَا مَا تَوَلَّى فَأَدْبَرَ وَ لَا يُدْرَى مَا هُوَ آتٍ مِنْهَا فَيُنْتَظَرَ وُصِلَ الْبَلَاءُ مِنْهَا بِالرَّخَاءِ وَ الْبَقَاءُ مِنْهَا إِلَى فَنَاءٍ ",
          "فَسُرُورُهَا مَشُوبٌ بِالْحُزْنِ وَ الْبَقَاءُ فِيهَا إِلَى الضَّعْفِ وَ الْوَهْنِ فَهِيَ كَرَوْضَةٍ اعْتَمَّ مَرْعَاهَا وَ أَعْجَبَتْ مَنْ يَرَاهَا عَذْبٌ شِرْبُهَا طَيِّبٌ تَرْبُهَا تَمُجُّ عُرُوقُهَا الثَّرَى وَ تَنْطُفُ فُرُوعُهَا النَّدَى حَتَّى إِذَا بَلَغَ الْعُشْبُ إِبَّانَهُ وَ اسْتَوَى بَنَانُهُ هَاجَتْ رِيحٌ تَحُتُّ الْوَرَقَ وَ تُفَرِّقُ مَا اتَّسَقَ فَأَصْبَحَتْ كَمَا قَالَ اللَّهُ هَشِيماً تَذْرُوهُ الرِّياحُ وَ كانَ اللَّهُ عَلى كُلِّ شَيْ‏ءٍ مُقْتَدِراً انْظُرُوا فِي الدُّنْيَا فِي كَثْرَةِ مَا يُعْجِبُكُمْ وَ قِلَّةِ مَا يَنْفَعُكُمْ "
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473090\">H 14451</a> – Ahmad Bin Muhammad Bin Ahmad All Kufy, and he is Al-A’asmiy, from Abdul Wahid Bin Al-Sawwaf, from Muhammad Bin Ismail Al-Hamdany who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Al-Hassan Musa</span><sup>asws</sup> having said: ‘Amir-ul-Momineen<sup>asws</sup> used to bequeath to his<sup>asws</sup> companions saying: ‘I<sup>asws</sup> bequeath you to fear Allah<sup>azwj</sup> for it is happiness for the truthful seeker, and a heavy shackle for the runaway fugitive.",
            "And be aware of the piety realising it within yourselves, and remember Allah<sup>azwj</sup> with a sincere Remembrance, being revived by it, and journey upon the path of salvation.",
            "Look at this world with the vision of the ascetics, the ones who have parted from it, for it dislodges its residents and causes distress to the affluent ones who (superficially) feel safe. Do not hope for those that are turned away from it, not knowing what it is that will come from it. So await patiently for the prosperity upon the arrival of the afflictions from it, and the survival from it up to the end.  ",
            "So its happiness is tainted with the grief, and the survival in it is up to the weakness and the fragility. So it is like a garden, the pasture of which is dense causing those who look at it, to wonder at it. Its drinks are sweet, its covering (soil) is good, its roots are excited in the ground, and its branches drip moisture until the grass reaches its due level. The scent gets triggered under the blades and gets separated from it in the morning, just as Allah<sup>azwj</sup> has Said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:18#h45\">[18:45]</a> then it becomes dry broken into pieces which the winds scatter; and Allah is the holder of power over all things.”</span> Look at this world and the numerous things which cause you to wonder, and the scarcity of the things which benefit you’."
          ],
          "en.sarwar": [
            "3. Ahmad Bin Muhammad Bin Ahmad All Kufy, and he is Al-A’asmiy, from Abdul Wahid Bin Al-Sawwaf, from Muhammad Bin Ismail Al-Hamdany who has narrated the following: Abu Al-Hassan Musa (a.s.) having said: ‘Amir-ul-Momineen (a.s.) used to bequeath to his (a.s.) companions saying: ‘I (a.s.) bequeath you to fear Allah (azwj) for it is happiness for the truthful seeker, and a heavy shackle for the runaway fugitive. And be aware of the piety realising it within yourselves, and remember Allah (azwj) with a sincere Remembrance, being revived by it, and journey upon the path of salvation. Look at this world with the vision of the ascetics, the ones who have parted from it, for it dislodges its residents and causes distress to the affluent ones who (superficially) feel safe. Do not hope for those that are turned away from it, not knowing what it is that will come from it. So await patiently for the prosperity upon the arrival of the afflictions from it, and the survival from it up to the end. So its happiness is tainted with the grief, and the survival in it is up to the weakness and the fragility. So it is like a garden, the pasture of which is dense causing those who look at it, to wonder at it. Its drinks are sweet, its covering (soil) is good, its roots are excited in the ground, and its branches drip moisture until the grass reaches its due level. The scent gets triggered under the blades and gets separated from it in the morning, just as Allah (azwj) has Said: “<a href=\"/#/books/quran:18#h45\">[18:45]</a> then it becomes dry broken into pieces which the winds scatter; and Allah is the holder of power over all things.” Look at this world and the numerous things which cause you to wonder, and the scarcity of the things which benefit you’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:2",
  "kind": "verse_list"
}