{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 22"
        },
        "path": "/books/al-kafi:8:1:22",
        "titles": {
          "ar": "حَدِيثُ الرِّيَاحِ",
          "en": "HADEETH OF THE WINDS"
        }
      }
    ],
    "index": 2293,
    "local_index": 22,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 23"
        },
        "path": "/books/al-kafi:8:1:23",
        "titles": {
          "ar": "حَدِيثُ أَهْلِ الشَّامِ",
          "en": "HADEETH OF THE PEOPLE OF SYRIA (AL-SHAAM)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 21"
        },
        "path": "/books/al-kafi:8:1:21",
        "titles": {
          "ar": "حَدِيثُ الْأَحْلَامِ وَ الْحُجَّةِ عَلَى أَهْلِ ذَلِكَ الزَّمَانِ",
          "en": "HADEETH OF THE DREAM AND THE PROOF UPON THE PEOPLE OF THAT ERA"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:22",
    "titles": {
      "ar": "حَدِيثُ الرِّيَاحِ",
      "en": "HADEETH OF THE WINDS"
    },
    "verse_count": 4,
    "verse_start_index": 14746,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 216)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14747,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "14511- "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/214",
              "text": "عَلِيِّ بْنِ رِئَابٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/111",
              "text": "هِشَامِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "14511- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ وَ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي بَصِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:22:1",
        "relations": {
          "Mentions": [
            "/books/quran:51:41",
            "/books/quran:54:19",
            "/books/quran:2:266",
            "/books/quran:46:24"
          ]
        },
        "text": [
          " سَأَلْتُ أَبَا جَعْفَرٍ (عليه السلام) عَنِ الرِّيَاحِ الْأَرْبَعِ الشَّمَالِ وَ الْجَنُوبِ وَ الصَّبَا وَ الدَّبُورِ وَ قُلْتُ إِنَّ النَّاسَ يَذْكُرُونَ أَنَّ الشَّمَالَ مِنَ الْجَنَّةِ وَ الْجَنُوبَ مِنَ النَّارِ فَقَالَ إِنَّ لِلَّهِ عَزَّ وَ جَلَّ جُنُوداً مِنْ رِيَاحٍ يُعَذِّبُ بِهَا مَنْ يَشَاءُ مِمَّنْ عَصَاهُ وَ لِكُلِّ رِيحٍ مِنْهَا مَلَكٌ مُوَكَّلٌ بِهَا فَإِذَا أَرَادَ اللَّهُ عَزَّ وَ جَلَّ أَنْ يُعَذِّبَ قَوْماً بِنَوْعٍ مِنَ الْعَذَابِ أَوْحَى إِلَى الْمَلَكِ الْمُوَكَّلِ بِذَلِكَ النَّوْعِ مِنَ الرِّيحِ الَّتِي يُرِيدُ أَنْ يُعَذِّبَهُمْ بِهَا قَالَ فَيَأْمُرُهَا الْمَلَكُ فَيَهِيجُ كَمَا يَهِيجُ الْأَسَدُ الْمُغْضَبُ ",
          "قَالَ وَ لِكُلِّ رِيحٍ مِنْهُنَّ اسْمٌ أَ مَا تَسْمَعُ قَوْلَهُ تَعَالَى كَذَّبَتْ عادٌ فَكَيْفَ كانَ عَذابِي وَ نُذُرِ إِنَّا أَرْسَلْنا عَلَيْهِمْ رِيحاً صَرْصَراً فِي يَوْمِ نَحْسٍ مُسْتَمِرٍّ وَ قَالَ الرِّيحَ الْعَقِيمَ وَ قَالَ رِيحٌ فِيها عَذابٌ أَلِيمٌ وَ قَالَ فَأَصابَها إِعْصارٌ فِيهِ نارٌ فَاحْتَرَقَتْ وَ مَا ذُكِرَ مِنَ الرِّيَاحِ الَّتِي يُعَذِّبُ اللَّهُ بِهَا مَنْ عَصَاهُ ",
          "قَالَ وَ لِلَّهِ عَزَّ ذِكْرُهُ رِيَاحُ رَحْمَةٍ لَوَاقِحُ وَ غَيْرُ ذَلِكَ يَنْشُرُهَا بَيْنَ يَدَيْ رَحْمَتِهِ مِنْهَا مَا يُهَيِّجُ السَّحَابَ لِلْمَطَرِ وَ مِنْهَا رِيَاحٌ تَحْبِسُ السَّحَابَ بَيْنَ السَّمَاءِ وَ الْأَرْضِ وَ رِيَاحٌ تَعْصِرُ السَّحَابَ فَتَمْطُرُهُ بِإِذْنِ اللَّهِ وَ مِنْهَا رِيَاحٌ مِمَّا عَدَّدَ اللَّهُ فِي الْكِتَابِ ",
          "فَأَمَّا الرِّيَاحُ الْأَرْبَعُ الشَّمَالُ وَ الْجَنُوبُ وَ الصَّبَا وَ الدَّبُورُ فَإِنَّمَا هِيَ أَسْمَاءُ الْمَلَائِكَةِ الْمُوَكَّلِينَ بِهَا فَإِذَا أَرَادَ اللَّهُ أَنْ يُهِبَّ شَمَالًا أَمَرَ الْمَلَكَ الَّذِي اسْمُهُ الشَّمَالُ فَيَهْبِطُ عَلَى الْبَيْتِ الْحَرَامِ فَقَامَ عَلَى الرُّكْنِ الشَّامِيِّ فَضَرَبَ بِجَنَاحِهِ فَتَفَرَّقَتْ رِيحُ الشَّمَالِ حَيْثُ يُرِيدُ اللَّهُ مِنَ الْبَرِّ وَ الْبَحْرِ ",
          "وَ إِذَا أَرَادَ اللَّهُ أَنْ يَبْعَثَ جَنُوباً أَمَرَ الْمَلَكَ الَّذِي اسْمُهُ الْجَنُوبُ فَهَبَطَ عَلَى الْبَيْتِ الْحَرَامِ فَقَامَ عَلَى الرُّكْنِ الشَّامِيِّ فَضَرَبَ بِجَنَاحِهِ فَتَفَرَّقَتْ رِيحُ الْجَنُوبِ فِي الْبَرِّ وَ الْبَحْرِ حَيْثُ يُرِيدُ اللَّهُ ",
          "وَ إِذَا أَرَادَ اللَّهُ أَنْ يَبْعَثَ رِيحَ الصَّبَا أَمَرَ الْمَلَكَ الَّذِي اسْمُهُ الصَّبَا فَهَبَطَ عَلَى الْبَيْتِ الْحَرَامِ فَقَامَ عَلَى الرُّكْنِ الشَّامِيِّ فَضَرَبَ بِجَنَاحِهِ فَتَفَرَّقَتْ رِيحُ الصَّبَا حَيْثُ يُرِيدُ اللَّهُ جَلَّ وَ عَزَّ فِي الْبَرِّ وَ الْبَحْرِ ",
          "وَ إِذَا أَرَادَ اللَّهُ أَنْ يَبْعَثَ دَبُوراً أَمَرَ الْمَلَكَ الَّذِي اسْمُهُ الدَّبُورُ فَهَبَطَ عَلَى الْبَيْتِ الْحَرَامِ فَقَامَ عَلَى الرُّكْنِ الشَّامِيِّ فَضَرَبَ بِجَنَاحِهِ فَتَفَرَّقَتْ رِيحُ الدَّبُورِ حَيْثُ يُرِيدُ اللَّهُ مِنَ الْبَرِّ وَ الْبَحْرِ ",
          "ثُمَّ قَالَ أَبُو جَعْفَرٍ (عليه السلام) أَ مَا تَسْمَعُ لِقَوْلِهِ رِيحُ الشَّمَالِ وَ رِيحُ الْجَنُوبِ وَ رِيحُ الدَّبُورِ وَ رِيحُ الصَّبَا إِنَّمَا تُضَافُ إِلَى الْمَلَائِكَةِ الْمُوَكَّلِينَ بِهَا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473170\">H 14511</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Hassan Bin Mahboub, from Ali Bin Ra’ab and Hashaam Bin Saalim, from Abu Baseer who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> asked Abu Ja’far</span><sup>asws</sup> about the four types of winds – the North, the South, <span class=\"iTxt\">Al-Saba</span> and <span class=\"iTxt\">Al-Dabour</span>, and I said that the people are mentioning that the North (wind) is from the Paradise, and the South (wind) is from the Fire’. So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> has armies of winds by which He<sup>azwj</sup> Punishes whomsoever that He<sup>azwj</sup> so Wishes to from the ones who disobey Him<sup>azwj</sup>, and from every wind from these is an Angel allocated to it. So if Allah<sup>azwj</sup> Intends to Punish a people by some kind of torment, He<sup>azwj</sup> Reveals to the Angel in charge of that particular type of the winds by which He<sup>azwj</sup> Intends to Punish them by. So the Angel orders it and it get excited like a lion gets excited when bothered’.",
            "He<sup>asws</sup> said: ‘And for every wind from these is a name. Have you not heard the Words of the High<sup>azwj</sup>: <span class=\"ibTxt\">“<a href=\"/#/books/quran:54#h19\">[54:19]</a> For We sent against them a furious wind (Sarsara), on a Day of violent Disaster”</span>, and Said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:51#h41\">[51:41]</a> When We sent upon them the destructive wind (Al-Aqeem)”</span>, and Said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:46#h24\">[46:24]</a> a blast of wind in which is a painful punishment,”</span>, and Said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:2#h266\">[2:266]</a> that it should be caught in a whirlwind, with fire therein, and be burnt up”</span>. And (others) from winds which have not been Mentioned by which Allah<sup>azwj</sup> Punishes the ones who disobey Him<sup>azwj</sup>’.",
            "He<sup>asws</sup> said: ‘And Allah<sup>azwj</sup> Mighty is His<sup>azwj</sup> mention has winds of Mercy which occur, and others besides that which He<sup>azwj</sup> Displays His<sup>azwj</sup> Mercy. From these is that which incites clouds for the rain, and from these is a wind which holds up the clouds in between the sky and the earth, and the winds which squeeze the clouds so they make rain by the Permission of Allah<sup>azwj</sup>, and from these are winds which Allah<sup>azwj</sup> has Counted in His<sup>azwj</sup> Book.",
            "As for the four winds – the North, and the South, and <span class=\"iTxt\">Al-Saba</span>, and <span class=\"iTxt\">Al-Dabour</span>, so these are the names of the Angels who have been allocated to these. So if Allah<sup>azwj</sup> Intends the North wind to blow, He<sup>azwj</sup> Commands the Angel whose name is the North (Al-Shimaal), so he descends upon the Sacred House (Al-Bayt Al-Haram), stands upon the <span class=\"iTxt\">Al-Shamy</span> corner of it and flaps his wings. So the North wind disperses in the land and the sea wherever Allah<sup>azwj</sup> Desires it to. ",
            "And if Allah<sup>azwj</sup> Intends to Send the South winds, He<sup>azwj</sup> Commands the Angel whose name is the South (Al-Junoub), so he descends upon the Sacred House (Al-Bayt Al-Haram), stands upon the <span class=\"iTxt\">Al-Shamy</span> corner of it and flaps his wings. So the South wind disperses in the land and the sea wherever Allah<sup>azwj</sup> Desires it to.",
            "And if Allah<sup>azwj</sup> Intends to Send <span class=\"iTxt\">Al-Saba</span> wind, He<sup>azwj</sup> Commands the Angel whose name is <span class=\"iTxt\">Al-Saba</span>, so he descends upon the Sacred House, stands upon the <span class=\"iTxt\">Al-Shamy </span>corner of it and flaps his wings. So the <span class=\"iTxt\">Al-Saba</span> wind disperses in the land and the sea wherever Allah<sup>azwj</sup> Desires it to.",
            "And if Allah<sup>azwj</sup> Intends to Send <span class=\"iTxt\">Daboura</span>, He<sup>azwj</sup> Commands the Angel whose name is <span class=\"iTxt\">Al-Dabour</span>, so he descends upon the Sacred House, stands upon the <span class=\"iTxt\">Al-Shamy</span> corner of it and flaps his wings. So <span class=\"iTxt\">Al-Dabour</span> wind disperses in the land and the sea wherever Allah<sup>azwj</sup> Desires it to’.",
            "Then Abu Ja’far<sup>asws</sup> said: ‘As for your hearing their words – the North wind, and the South wind, and <span class=\"iTxt\">Al-Dabour</span> wind, and <span class=\"iTxt\">Al-Saba wind</span>, but rather these are the Angels who have been entrusted with these."
          ],
          "en.sarwar": [
            "63. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Hassan Bin Mahboub, from Ali Bin Ra’ab and Hashaam Bin Saalim, from Abu Baseer who said: ‘I asked Abu Ja’far (a.s.) about the four types of winds – the North, the South, Al-Saba and Al-Dabour, and I said that the people are mentioning that the North (wind) is from the Paradise, and the South (wind) is from the Fire’. So he (a.s.) said: ‘Allah (azwj) has armies of winds by which He (azwj) Punishes whomsoever that He (azwj) so Wishes to from the ones who disobey Him (azwj), and from every wind from these is an Angel allocated to it. So if Allah (azwj) Intends to Punish a people by some kind of torment, He (azwj) Reveals to the Angel in charge of that particular type of the winds by which He (azwj) Intends to Punish them by. So the Angel orders it and it get excited like a lion gets excited when bothered’. He (a.s.) said: ‘And for every wind from these is a name. Have you not heard the Words of the High (azwj): “<a href=\"/#/books/quran:54#h19\">[54:19]</a> For We sent against them a furious wind (Sarsara), on a Day of violent Disaster”, and Said: “<a href=\"/#/books/quran:51#h41\">[51:41]</a> When We sent upon them the destructive wind (Al-Aqeem)”, and Said: “<a href=\"/#/books/quran:46#h24\">[46:24]</a> a blast of wind in which is a painful punishment,”, and Said: “<a href=\"/#/books/quran:2#h266\">[2:266]</a> that it should be caught in a whirlwind, with fire therein, and be burnt up”. And (others) from winds which have not been Mentioned by which Allah (azwj) Punishes the ones who disobey Him (azwj)’. He (a.s.) said: ‘And Allah (azwj) Mighty is His (azwj) mention has winds of Mercy which occur, and others besides that which He (azwj) Displays His (azwj) Mercy. From these is that which incites clouds for the rain, and from these is a wind which holds up the clouds in between the sky and the earth, and the winds which squeeze the clouds so they make rain by the Permission of Allah (azwj), and from these are winds which Allah (azwj) has Counted in His (azwj) Book. As for the four winds – the North, and the South, and Al-Saba, and Al-Dabour, so these are the names of the Angels who have been allocated to these. So if Allah (azwj) Intends the North wind to blow, He (azwj) Commands the Angel whose name is the North (Al-Shimaal), so he descends upon the Sacred House (Al-Bayt Al-Haram), stands upon the Al-Shamy corner of it and flaps his wings. So the North wind disperses in the land and the sea wherever Allah (azwj) Desires it to. And if Allah (azwj) Intends to Send the South winds, He (azwj) Commands the Angel whose name is the South (Al-Junoub), so he descends upon the Sacred House (Al-Bayt Al-Haram), stands upon the Al-Shamy corner of it and flaps his wings. So the South wind disperses in the land and the sea wherever Allah (azwj) Desires it to. And if Allah (azwj) Intends to Send Al-Saba wind, He (azwj) Commands the Angel whose name is Al-Saba, so he descends upon the Sacred House, stands upon the Al-Shamy corner of it and flaps his wings. So the Al-Saba wind disperses in the land and the sea wherever Allah (azwj) Desires it to. And if Allah (azwj) Intends to Send Daboura, He (azwj) Commands the Angel whose name is Al-Dabour, so he descends upon the Sacred House, stands upon the Al-Shamy corner of it and flaps his wings. So Al-Dabour wind disperses in the land and the sea wherever Allah (azwj) Desires it to’. Then Abu Ja’far (a.s.) said: ‘As for your hearing their words – the North wind, and the South wind, and Al-Dabour wind, and Al-Saba wind, but rather these are the Angels who have been entrusted with these."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 219)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14748,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "14512- "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/226",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1020",
              "text": "مَعْرُوفِ بْنِ خَرَّبُوذَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5942",
              "text": "أَبِي جَعْفَرٍ (عليه السلام)"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "14512- عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ مَعْرُوفِ بْنِ خَرَّبُوذَ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:22:2",
        "text": [
          " إِنَّ لِلَّهِ عَزَّ وَ جَلَّ رِيَاحَ رَحْمَةٍ وَ رِيَاحَ عَذَابٍ فَإِنْ شَاءَ اللَّهُ أَنْ يَجْعَلَ الْعَذَابَ مِنَ الرِّيَاحِ رَحْمَةً فَعَلَ قَالَ وَ لَنْ يَجْعَلَ الرَّحْمَةَ مِنَ الرِّيحِ عَذَاباً قَالَ وَ ذَلِكَ أَنَّهُ لَمْ يَرْحَمْ قَوْماً قَطُّ أَطَاعُوهُ وَ كَانَتْ طَاعَتُهُمْ إِيَّاهُ وَبَالًا عَلَيْهِمْ إِلَّا مِنْ بَعْدِ تَحَوُّلِهِمْ عَنْ طَاعَتِهِ ",
          "قَالَ كَذَلِكَ فَعَلَ بِقَوْمِ يُونُسَ لَمَّا آمَنُوا رَحِمَهُمُ اللَّهُ بَعْدَ مَا كَانَ قَدَّرَ عَلَيْهِمُ الْعَذَابَ وَ قَضَاهُ ثُمَّ تَدَارَكَهُمْ بِرَحْمَتِهِ فَجَعَلَ الْعَذَابَ الْمُقَدَّرَ عَلَيْهِمْ رَحْمَةً فَصَرَفَهُ عَنْهُمْ وَ قَدْ أَنْزَلَهُ عَلَيْهِمْ وَ غَشِيَهُمْ وَ ذَلِكَ لَمَّا آمَنُوا بِهِ وَ تَضَرَّعُوا إِلَيْهِ ",
          "قَالَ وَ أَمَّا الرِّيحُ الْعَقِيمُ فَإِنَّهَا رِيحُ عَذَابٍ لَا تُلْقِحُ شَيْئاً مِنَ الْأَرْحَامِ وَ لَا شَيْئاً مِنَ النَّبَاتِ وَ هِيَ رِيحٌ تَخْرُجُ مِنْ تَحْتِ الْأَرَضِينَ السَّبْعِ وَ مَا خَرَجَتْ مِنْهَا رِيحٌ قَطُّ إِلَّا عَلَى قَوْمِ عَادٍ حِينَ غَضِبَ اللَّهُ عَلَيْهِمْ فَأَمَرَ الْخُزَّانَ أَنْ يُخْرِجُوا مِنْهَا عَلَى مِقْدَارِ سَعَةِ الْخَاتَمِ ",
          "قَالَ فَعَتَتْ عَلَى الْخُزَّانِ فَخَرَجَ مِنْهَا عَلَى مِقْدَارِ مَنْخِرِ الثَّوْرِ تَغَيُّظاً مِنْهَا عَلَى قَوْمِ عَادٍ قَالَ فَضَجَّ الْخُزَّانُ إِلَى اللَّهِ عَزَّ وَ جَلَّ مِنْ ذَلِكَ فَقَالُوا رَبَّنَا إِنَّهَا قَدْ عَتَتْ عَنْ أَمْرِنَا إِنَّا نَخَافُ أَنْ تُهْلِكَ مَنْ لَمْ يَعْصِكَ مِنْ خَلْقِكَ وَ عُمَّارِ بِلَادِكَ قَالَ فَبَعَثَ اللَّهُ عَزَّ وَ جَلَّ إِلَيْهَا جَبْرَئِيلَ (عليه السلام) فَاسْتَقْبَلَهَا بِجَنَاحَيْهِ فَرَدَّهَا إِلَى مَوْضِعِهَا وَ قَالَ لَهَا اخْرُجِي عَلَى مَا أُمِرْتِ بِهِ قَالَ فَخَرَجَتْ عَلَى مَا أُمِرَتْ بِهِ وَ أَهْلَكَتْ قَوْمَ عَادٍ وَ مَنْ كَانَ بِحَضْرَتِهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473171\">H 14512</a> – From him, from Ahmad Bin Muhammad, from Ibn Mahboub, from Abdullah Bin Sinan, from Ma’rouf Bin Kharbouz, who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> said that ‘Allah<sup>azwj</sup> has winds of Mercy as well as winds of Punishment. So if Allah<sup>azwj</sup> Desires that He<sup>azwj</sup> Turns the winds of Punishment into the winds of Mercy, He<sup>azwj</sup> Does it, but He<sup>azwj</sup> never Makes (winds of ) Mercy to be turned into the wind of Punishment’. ",
            "He<sup>asws</sup> said: ‘And it is never the case that He<sup>azwj</sup> is Merciful to all people who obey Him<sup>azwj</sup> and that their obedience should become an affliction for them, except after theirs having turned from their obedience.",
            "He<sup>asws</sup> said: ‘That is how He<sup>azwj</sup> Acted with the people of Yunus<sup>as</sup>. When they believed, Allah<sup>azwj</sup> Bestowed mercy upon them after having had Ordained for them the Punishment. He<sup>a</sup><sup>zwj</sup> had Decided, then Enclosed them with His<sup>azwj</sup> Mercy. So He<sup>azwj</sup> Made the Punishment that was pre-destined for them as a Mercy.  He<sup>azwj</sup> Turned it away from them and it had already descended upon them and overwhelmed them, but they pleaded before Him<sup>azwj</sup>’.",
            "He<sup>asws</sup> said: ‘And as for the wind of the destruction (Al-Aqeem), so it is a wind of Punishment. Neither, does it inseminate anything from the wombs or anything from the seeds, and it is a wind which comes out from the underneath the seven earths, and not a (single) wind came out from it at all except upon the people of Aad when Allah<sup>azwj</sup> was Wrathful against them. So He<sup>azwj</sup> Commanded the Keepers to take from it a measure of the size of a ring’. ",
            "He<sup>asws</sup> said: ‘It rebelled against the Keepers, so there came out from it a measure of the nostril of a bull being wrathful against the people of Aad’. He<sup>asws</sup> said: ‘So the Keepers grumbled to Allah<sup>azwj</sup> from that. They said, ‘Our Lord<sup>azwj</sup>! It has rebelled against our orders. We are afraid that it would destroy the ones who have not been disobedient to You<sup>azwj</sup> from Your<sup>azwj</sup> creatures who built Your<sup>azwj</sup> City’. ",
            "He<sup>asws</sup> said: ‘So Allah<sup>azwj</sup> Sent Jibraeel towards it who faced it with both his wings and returned it back to its place and said to it: ‘Come out of the ones whom you have not been Commanded for’. He<sup>asws</sup> said: ‘So it came out from the ones against whom it had not been Commanded for, and destroyed the people of Aad and those who were present with them (their supporters)’."
          ],
          "en.sarwar": [
            "64. From him, from Ahmad Bin Muhammad, from Ibn Mahboub, from Abdullah Bin Sinan, from Ma’rouf Bin Kharbouz, who said: Abu Ja’far (a.s.) said that ‘Allah (azwj) has winds of Mercy as well as winds of Punishment. So if Allah (azwj) Desires that He (azwj) Turns the winds of Punishment into the winds of Mercy, He (azwj) Does it, but He (azwj) never Makes (winds of ) Mercy to be turned into the wind of Punishment’. He (a.s.) said: ‘And it is never the case that He (azwj) is Merciful to all people who obey Him (azwj) and that their obedience should become an affliction for them, except after theirs having turned from their obedience. He (a.s.) said: ‘That is how He (azwj) Acted with the people of Yunus (as). When they believed, Allah (azwj) Bestowed mercy upon them after having had Ordained for them the Punishment. He (azwj) had Decided, then Enclosed them with His (azwj) Mercy. So He (azwj) Made the Punishment that was pre-destined for them as a Mercy. He (azwj) Turned it away from them and it had already descended upon them and overwhelmed them, but they pleaded before Him (azwj)’. He (a.s.) said: ‘And as for the wind of the destruction (Al-Aqeem), so it is a wind of Punishment. Neither, does it inseminate anything from the wombs or anything from the seeds, and it is a wind which comes out from the underneath the seven earths, and not a (single) wind came out from it at all except upon the people of Aad when Allah (azwj) was Wrathful against them. So He (azwj) Commanded the Keepers to take from it a measure of the size of a ring’. He (a.s.) said: ‘It rebelled against the Keepers, so there came out from it a measure of the nostril of a bull being wrathful against the people of Aad’. He (a.s.) said: ‘So the Keepers grumbled to Allah (azwj) from that. They said, ‘Our Lord (azwj)! It has rebelled against our orders. We are afraid that it would destroy the ones who have not been disobedient to You (azwj) from Your (azwj) creatures who built Your (azwj) City’. He (a.s.) said: ‘So Allah (azwj) Sent Jibraeel towards it who faced it with both his wings and returned it back to its place and said to it: ‘Come out of the ones whom you have not been Commanded for’. He (a.s.) said: ‘So it came out from the ones against whom it had not been Commanded for, and destroyed the people of Aad and those who were present with them (their supporters)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على الشهور</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 221)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14749,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "14513- "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/38",
              "text": "النَّوْفَلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/39",
              "text": "السَّكُونِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5937",
              "text": "أَبِي عَبْدِ اللَّهِ (عليه السلام)"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "14513- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:22:3",
        "text": [
          " قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) مَنْ ظَهَرَتْ عَلَيْهِ النِّعْمَةُ فَلْيُكْثِرْ ذِكْرَ الْحَمْدُ لِلَّهِ وَ مَنْ كَثُرَتْ هُمُومُهُ فَعَلَيْهِ بِالِاسْتِغْفَارِ وَ مَنْ أَلَحَّ عَلَيْهِ الْفَقْرُ فَلْيُكْثِرْ مِنْ قَوْلِ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ يَنْفِي عَنْهُ الْفَقْرَ ",
          "وَ قَالَ فَقَدَ النَّبِيُّ (صلى الله عليه وآله) رَجُلًا مِنَ الْأَنْصَارِ فَقَالَ مَا غَيَّبَكَ عَنَّا فَقَالَ الْفَقْرُ يَا رَسُولَ اللَّهِ وَ طُولُ السُّقْمِ فَقَالَ لَهُ رَسُولُ اللَّهِ (صلى الله عليه وآله) أَ لَا أُعَلِّمُكَ كَلَاماً إِذَا قُلْتَهُ ذَهَبَ عَنْكَ الْفَقْرُ وَ السُّقْمُ فَقَالَ بَلَى يَا رَسُولَ اللَّهِ ",
          "فَقَالَ إِذَا أَصْبَحْتَ وَ أَمْسَيْتَ فَقُلْ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ [الْعَلِيِّ الْعَظِيمِ] تَوَكَّلْتُ عَلَى الْحَيِّ الَّذِي لَا يَمُوتُ وَ الْحَمْدُ لِلَّهِ الَّذِي لَمْ يَتَّخِذْ وَلَداً وَ لَمْ يَكُنْ لَهُ شَرِيكٌ فِي الْمُلْكِ وَ لَمْ يَكُنْ لَهُ وَلِيٌّ مِنَ الذُّلِّ وَ كَبِّرْهُ تَكْبِيراً فَقَالَ الرَّجُلُ فَوَ اللَّهِ مَا قُلْتُهُ إِلَّا ثَلَاثَةَ أَيَّامٍ حَتَّى ذَهَبَ عَنِّي الْفَقْرُ وَ السُّقْمُ.",
          "لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ [الْعَلِيِّ الْعَظِيمِ] تَوَكَّلْتُ عَلَى الْحَيِّ الَّذِي لَا يَمُوتُ وَ الْحَمْدُ لِلَّهِ الَّذِي لَمْ يَتَّخِذْ وَلَداً وَ لَمْ يَكُنْ لَهُ شَرِيكٌ فِي الْمُلْكِ وَ لَمْ يَكُنْ لَهُ وَلِيٌّ مِنَ الذُّلِّ وَ كَبِّرْهُ تَكْبِيراً فَقَالَ الرَّجُلُ فَوَ اللَّهِ مَا قُلْتُهُ "
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473172\">H 14513</a> – Ali Bin Ibrahim, from his father, from Al-Nawfaly, from Al-Sakuny, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said that the Rasool<sup>saww</sup> Allah<sup>azwj</sup> said; ‘For whom the Blessings appear should frequently mention ‘الْحَمْدُ لِلَّهِ’ ‘Praise be to Allah<sup>azwj</sup>’, and the one who has numerous worries so for him is ‘بِالِاسْتِغْفَارِ’ to seek Forgiveness, and the one who is pressed by the poverty should frequently say ‘لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ’ ‘There is no Power and no Might except by Allah<sup>azwj</sup> the High the Magnificent, the poverty would be negated from him’.",
            "And he<sup>asws</sup> said: ‘The Prophet<sup>saww</sup> missed a man from the Helpers so he<sup>saww</sup> said to him: ‘What is the reason for your absence?’ He said, ‘The poverty, O Rasool<sup>saww</sup> Allah<sup>azwj</sup>, and the lengthy illness’. So he<sup>saww</sup> said to him: ‘Shall I<sup>saww</sup> teach you certain words, if you were to recite these, the poverty would go away from you, as well as the illness?’ He said, ‘Yes, O Rasool<sup>saww</sup> Allah<sup>azwj</sup>’. ",
            "So he<sup>saww</sup> said: ‘When it is the morning and evening, say:",
            "‘There is no Power and no Might except by Allah<sup>azwj</sup>, the High, the Magnificent. I hereby rely upon the Alive Who does not die, and Praise be to Allah<sup>azwj</sup> Who never Took for Himself<sup>azwj</sup> a son, and there never was for Him<sup>azwj</sup> an associate in the Kingdom, and will not be for Him<sup>azwj</sup> a guardian from the humiliation, and Great is His<sup>azwj</sup> Greatness’. ",
            "So the man said, ‘By Allah<sup>azwj</sup>, I had not recited it except for three days, and the poverty and the illness went away from me’."
          ],
          "en.sarwar": [
            "65. Ali Bin Ibrahim, from his father, from Al-Nawfaly, from Al-Sakuny, who has narrated the following: Abu Abdullah (a.s.) has said that the Rasool (saww) Allah (azwj) said; ‘For whom the Blessings appear should frequently mention ‘الْحَمْدُ لِلَّهِ’ ‘Praise be to Allah (azwj)’, and the one who has numerous worries so for him is ‘بِالِاسْتِغْفَارِ’ to seek Forgiveness, and the one who is pressed by the poverty should frequently say ‘لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ’ ‘There is no Power and no Might except by Allah (azwj) the High the Magnificent, the poverty would be negated from him’. And he (a.s.) said: ‘The Prophet (saww) missed a man from the Helpers so he (saww) said to him: ‘What is the reason for your absence?’ He said, ‘The poverty, O Rasool (saww) Allah (azwj), and the lengthy illness’. So he (saww) said to him: ‘Shall I (saww) teach you certain words, if you were to recite these, the poverty would go away from you, as well as the illness?’ He said, ‘Yes, O Rasool (saww) Allah (azwj)’. So he (saww) said: ‘When it is the morning and evening, say: ‘There is no Power and no Might except by Allah (azwj), the High, the Magnificent. I hereby rely upon the Alive Who does not die, and Praise be to Allah (azwj) Who never Took for Himself (azwj) a son, and there never was for Him (azwj) an associate in the Kingdom, and will not be for Him (azwj) a guardian from the humiliation, and Great is His (azwj) Greatness’. So the man said, ‘By Allah (azwj), I had not recited it except for three days, and the poverty and the illness went away from me’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 221)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 384)"
        ],
        "index": 14750,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "14514-  "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/150",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2420",
              "text": "إِسْمَاعِيلَ بْنِ عَبْدِ الْخَالِقِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "14514-  مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ إِسْمَاعِيلَ بْنِ عَبْدِ الْخَالِقِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:22:4",
        "relations": {
          "Mentions": [
            "/books/quran:42:23"
          ]
        },
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ لِأَبِي جَعْفَرٍ الْأَحْوَلِ وَ أَنَا أَسْمَعُ أَتَيْتَ الْبَصْرَةَ فَقَالَ نَعَمْ قَالَ كَيْفَ رَأَيْتَ مُسَارَعَةَ النَّاسِ إِلَى هَذَا الْأَمْرِ وَ دُخُولَهُمْ فِيهِ قَالَ وَ اللَّهِ إِنَّهُمْ لَقَلِيلٌ وَ لَقَدْ فَعَلُوا وَ إِنَّ ذَلِكَ لَقَلِيلٌ فَقَالَ عَلَيْكَ بِالْأَحْدَاثِ فَإِنَّهُمْ أَسْرَعُ إِلَى كُلِّ خَيْرٍ ثُمَّ قَالَ مَا يَقُولُ أَهْلُ الْبَصْرَةِ فِي هَذِهِ الْآيَةِ قُلْ لا أَسْئَلُكُمْ عَلَيْهِ أَجْراً إِلَّا الْمَوَدَّةَ فِي الْقُرْبى قُلْتُ جُعِلْتُ فِدَاكَ إِنَّهُمْ يَقُولُونَ إِنَّهَا لِأَقَارِبِ رَسُولِ اللَّهِ (صلى الله عليه وآله) فَقَالَ كَذَبُوا إِنَّمَا نَزَلَتْ فِينَا خَاصَّةً فِي أَهْلِ الْبَيْتِ فِي عَلِيٍّ وَ فَاطِمَةَ وَ الْحَسَنِ وَ الْحُسَيْنِ أَصْحَابِ الْكِسَاءِ (عليهم السلام)."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473173\">H 14514</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from Ismail Bin Abd Al-Khaliq who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> heard Abu Abdullah</span><sup>asws</sup> saying to Abu Ja’far Al-Ahwal, and I was listening: ‘Did you go to Al-Basra?’ He said, ‘Yes’. He<sup>asws</sup> said: ‘How did you see the hastening of the people to this matter and their entering in it to be?’ He said, ‘By Allah<sup>azwj</sup>, they are few, and they have done it but that is little’. He<sup>asws</sup> said: ‘It is on you to (approach) the juveniles for they are quick to every good’. Then he<sup>asws</sup> said: ‘What are the people of Al-Basra saying regarding this Verse: <span class=\"ibTxt\">‘<a href=\"/#/books/quran:42#h23\">[42:23]</a> Say: I do not ask of you any reward for it but love for my near relatives”</span>. I said, ‘May I be sacrificed for you<sup>asws</sup>, they are saying that it is for the near relatives of the Rasool<sup>saww</sup> of Allah<sup>azwj</sup>’. He<sup>asws</sup> said: ‘They lie. But rather it Descended with regards to us<sup>asws</sup> especially, regarding the People<sup>asws</sup> of the Household, regarding Ali<sup>asws</sup>, and Fatima<sup>asws</sup>, and Al-Hassan<sup>asws</sup>, and Al-Husayn<sup>asws</sup> the ones of the Cloak (As’haab Al-Kisaa)’."
          ],
          "en.sarwar": [
            "66. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from Ismail Bin Abd Al-Khaliq who said: ‘I heard Abu Abdullah (a.s.) saying to Abu Ja’far Al-Ahwal, and I was listening: ‘Did you go to Al-Basra?’ He said, ‘Yes’. He (a.s.) said: ‘How did you see the hastening of the people to this matter and their entering in it to be?’ He said, ‘By Allah (azwj), they are few, and they have done it but that is little’. He (a.s.) said: ‘It is on you to (approach) the juveniles for they are quick to every good’. Then he (a.s.) said: ‘What are the people of Al-Basra saying regarding this Verse: ‘<a href=\"/#/books/quran:42#h23\">[42:23]</a> Say: I do not ask of you any reward for it but love for my near relatives”. I said, ‘May I be sacrificed for you (a.s.), they are saying that it is for the near relatives of the Rasool (saww) of Allah (azwj)’. He (a.s.) said: ‘They lie. But rather it Descended with regards to us (a.s.) especially, regarding the People (a.s.) of the Household, regarding Ali (a.s.), and Fatima (a.s.), and Al-Hassan (a.s.), and Al-Husayn (a.s.) the ones of the Cloak (As’haab Al-Kisaa)’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:22",
  "kind": "verse_list"
}