{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 8"}, "path": "/books/al-kafi:8", "titles": {"ar": "الجزء الثامن‏", "en": "Volume Eight"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:8:1", "titles": {"ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;", "en": "The Book - Garden (of Flowers)"}}, {"indexed_titles": {"en": "Chapter 23"}, "path": "/books/al-kafi:8:1:23", "titles": {"ar": "حَدِيثُ أَهْلِ الشَّامِ", "en": "HADEETH OF THE PEOPLE OF SYRIA (AL-SHAAM)"}}], "index": 2284, "local_index": 23, "part_type": "Chapter", "path": "/books/al-kafi:8:1:23", "titles": {"ar": "حَدِيثُ أَهْلِ الشَّامِ", "en": "HADEETH OF THE PEOPLE OF SYRIA (AL-SHAAM)"}, "verse_count": 2, "verse_start_index": 14739, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 14740, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:8:1:23:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14515</span>-  عَنْهُ عَنْ أَحْمَدَ</span> بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ دَاوُدَ عَنْ مُحَمَّدِ بْنِ عَطِيَّةَ قَالَ جَاءَ رَجُلٌ إِلَى أَبِي جَعْفَرٍ (عليه السلام) مِنْ أَهْلِ الشَّامِ مِنْ عُلَمَائِهِمْ فَقَالَ يَا أَبَا جَعْفَرٍ جِئْتُ أَسْأَلُكَ عَنْ مَسْأَلَةٍ قَدْ أَعْيَتْ عَلَيَّ أَنْ أَجِدَ أَحَداً يُفَسِّرُهَا وَ قَدْ سَأَلْتُ عَنْهَا ثَلَاثَةَ أَصْنَافٍ مِنَ النَّاسِ فَقَالَ كُلُّ صِنْفٍ مِنْهُمْ شَيْئاً غَيْرَ الَّذِي قَالَ الصِّنْفُ الْآخَرُ فَقَالَ لَهُ أَبُو جَعْفَرٍ (عليه السلام) مَا ذَاكَ قَالَ فَإِنِّي أَسْأَلُكَ عَنْ أَوَّلِ مَا خَلَقَ اللَّهُ مِنْ خَلْقِهِ فَإِنَّ بَعْضَ مَنْ سَأَلْتُهُ قَالَ الْقَدَرُ وَ قَالَ بَعْضُهُمُ الْقَلَمُ وَ قَالَ بَعْضُهُمُ الرُّوحُ ", "فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) مَا قَالُوا شَيْئاً أُخْبِرُكَ أَنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى كَانَ وَ لَا شَيْ‏ءَ غَيْرَهُ وَ كَانَ عَزِيزاً وَ لَا أَحَدَ كَانَ قَبْلَ عِزِّهِ وَ ذَلِكَ قَوْلُهُ سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ وَ كَانَ الْخَالِقُ قَبْلَ الْمَخْلُوقِ وَ لَوْ كَانَ أَوَّلُ مَا خَلَقَ مِنْ خَلْقِهِ الشَّيْ‏ءَ مِنَ الشَّيْ‏ءِ إِذاً لَمْ يَكُنْ لَهُ انْقِطَاعٌ أَبَداً وَ لَمْ يَزَلِ اللَّهُ إِذاً وَ مَعَهُ شَيْ‏ءٌ لَيْسَ هُوَ يَتَقَدَّمُهُ وَ لَكِنَّهُ كَانَ إِذْ لَا شَيْ‏ءَ غَيْرَهُ ", "وَ خَلَقَ الشَّيْ‏ءَ الَّذِي جَمِيعُ الْأَشْيَاءِ مِنْهُ وَ هُوَ الْمَاءُ الَّذِي خَلَقَ الْأَشْيَاءَ مِنْهُ فَجَعَلَ نَسَبَ كُلِّ شَيْ‏ءٍ إِلَى الْمَاءِ وَ لَمْ يَجْعَلْ لِلْمَاءِ نَسَباً يُضَافُ إِلَيْهِ وَ خَلَقَ الرِّيحَ مِنَ الْمَاءِ ثُمَّ سَلَّطَ الرِّيحَ عَلَى الْمَاءِ فَشَقَّقَتِ الرِّيحُ مَتْنَ الْمَاءِ حَتَّى ثَارَ مِنَ الْمَاءِ زَبَدٌ عَلَى قَدْرِ مَا شَاءَ أَنْ يَثُورَ فَخَلَقَ مِنْ ذَلِكَ الزَّبَدِ أَرْضاً بَيْضَاءَ نَقِيَّةً لَيْسَ فِيهَا صَدْعٌ وَ لَا ثَقْبٌ وَ لَا صُعُودٌ وَ لَا هُبُوطٌ وَ لَا شَجَرَةٌ ثُمَّ طَوَاهَا فَوَضَعَهَا فَوْقَ الْمَاءِ ", "ثُمَّ خَلَقَ اللَّهُ النَّارَ مِنَ الْمَاءِ فَشَقَّقَتِ النَّارُ مَتْنَ الْمَاءِ حَتَّى ثَارَ مِنَ الْمَاءِ دُخَانٌ عَلَى قَدْرِ مَا شَاءَ اللَّهُ أَنْ يَثُورَ فَخَلَقَ مِنْ ذَلِكَ الدُّخَانِ سَمَاءً صَافِيَةً نَقِيَّةً لَيْسَ فِيهَا صَدْعٌ وَ لَا ثَقْبٌ وَ ذَلِكَ قَوْلُهُ السَّماءُ بَناها رَفَعَ سَمْكَها فَسَوَّاها وَ أَغْطَشَ لَيْلَها وَ أَخْرَجَ ضُحاها قَالَ وَ لَا شَمْسٌ وَ لَا قَمَرٌ وَ لَا نُجُومٌ وَ لَا سَحَابٌ ثُمَّ طَوَاهَا فَوَضَعَهَا فَوْقَ الْأَرْضِ ثُمَّ نَسَبَ الْخَلِيقَتَيْنِ فَرَفَعَ السَّمَاءَ قَبْلَ الْأَرْضِ فَذَلِكَ قَوْلُهُ عَزَّ ذِكْرُهُ وَ الْأَرْضَ بَعْدَ ذلِكَ دَحاها يَقُولُ بَسَطَهَا ", "فَقَالَ لَهُ الشَّامِيُّ يَا أَبَا جَعْفَرٍ قَوْلُ اللَّهِ تَعَالَى أَ وَ لَمْ يَرَ الَّذِينَ كَفَرُوا أَنَّ السَّماواتِ وَ الْأَرْضَ كانَتا رَتْقاً فَفَتَقْناهُما فَقَالَ لَهُ أَبُو جَعْفَرٍ (عليه السلام) فَلَعَلَّكَ تَزْعُمُ أَنَّهُمَا كَانَتَا رَتْقاً مُلْتَزِقَتَيْنِ مُلْتَصِقَتَيْنِ فَفُتِقَتْ إِحْدَاهُمَا مِنَ الْأُخْرَى فَقَالَ نَعَمْ فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) اسْتَغْفِرْ رَبَّكَ فَإِنَّ قَوْلَ اللَّهِ جَلَّ وَ عَزَّ كانَتا رَتْقاً يَقُولُ كَانَتِ السَّمَاءُ رَتْقاً لَا تُنْزِلُ الْمَطَرَ وَ كَانَتِ الْأَرْضُ رَتْقاً لَا تُنْبِتُ الْحَبَّ فَلَمَّا خَلَقَ اللَّهُ تَبَارَكَ وَ تَعَالَى الْخَلْقَ وَ بَثَّ فِيهَا مِنْ كُلِّ دَابَّةٍ فَتَقَ السَّمَاءَ بِالْمَطَرِ وَ الْأَرْضَ بِنَبَاتِ الْحَبِّ فَقَالَ الشَّامِيُّ أَشْهَدُ أَنَّكَ مِنْ وُلْدِ الْأَنْبِيَاءِ وَ أَنَّ عِلْمَكَ عِلْمُهُمْ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473175\">H 14515</a> – From him, from Ahmad Bin Muhammad, from Al-Husayn Bin Saeed, from Muhammad Bin Dawood from Muhammad Bin Atiyya who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span> man from the scholars</span> of the people of Syria (Al-Shaam) came up to Abu Ja’far<sup>asws</sup>. He said, ‘O Abu Ja’far<sup>asws</sup>, I have come to ask you<sup>asws</sup> a question which has exhausted me in finding one who could explain it to me, and I have asked three kinds of the people about it, so each type from them said something other than what the other one said’. So Abu Ja’far<sup>asws</sup> said to him: ‘What would that be?’ He said, ‘I ask you<sup>asws</sup> about the first thing what Allah<sup>azwj</sup> Created from His<sup>azwj</sup> creatures, for some of the ones I asked said it was the Destiny, and some of them said it was the Pen, and some of them said it was the Spirit’.", "So Abu Ja’far<sup>asws</sup> said: ‘They have not said anything. I<sup>asws</sup> hereby inform you that Allah<sup>azwj</sup> Blessed and High Existed and there was nothing other than Him<sup>azwj</sup>, and He<sup>azwj</sup> was Mighty and there was no one who was mighty before Him<sup>azwj</sup>, and that is His<sup>azwj</sup> Statement: <span class=\"ibTxt\">“[37:180] Glory be to your Lord, the Lord of Honour, above what they describe”</span>, and He<sup>azwj</sup> was the Creator before the creation, and had He<sup>azwj</sup> Created, and Had He<sup>azwj</sup> Created something from His<sup>azwj</sup> Creation, something from something, then there would be no cut-off from it (the chain) ever, and it would never cease if Allah<sup>azwj</sup> had something with Him<sup>azwj</sup> and He<sup>azwj</sup> did not precede it, but He<sup>azwj</sup> Existed when there was nothing other than Him<sup>azwj</sup>. ", "And He<sup>azwj</sup> Created the thing from which are all things, and it is the water from which He<sup>azwj</sup> Created the things. So He<sup>azwj</sup> Lineage everything to the water and did not Make a lineage for the water to which it can be ascribed. And He<sup>azwj</sup> Created the wind from the water, then Made the wind to overcome the water. So the wind sent down into the body of the water until foam swirled from the water in accordance with what He<sup>azwj</sup> so Desired it to swirl. So He<sup>azwj</sup> Created from that foam, pure white land with no crack in it, nor any holes, neither ascending nor descending, and no tree. Then He<sup>azwj</sup> Folded it, so He<sup>azwj</sup> Placed it on top of the water.", "Then Allah<sup>azwj</sup> Created the fire from the water, so the fire bust out of the body of the water until smoke arose from the water in accordance with Allah<sup>azwj</sup> so Desired it to rise. So He<sup>azwj</sup> Created from that smoke, clear and pure sky in which there were no cracks nor any holes, and that is His<sup>azwj</sup> Statement: <span class=\"ibTxt\">“[79:27] Are you the harder to create or the heaven? He made it. [79:28] He raised high its height, then put it into a right good state. [79:29] And He made dark its night and brought out its light”</span>. He<sup>asws</sup> said: ‘And there was no sun, and no moon, and no stars and no clouds. Then He<sup>azwj</sup> Folded it and Placed it upon the earth, then Established two creations. Then He<sup>azwj</sup> Raised the sky before the earth, so that is His<sup>azwj</sup> Statement, Mighty is His<sup>azwj</sup> Mention: <span class=\"ibTxt\">“[79:30] And the earth, He expanded it after that”</span>. He<sup>azwj</sup> Said that He<sup>azwj</sup> Spread it out’.", "So the Syrian said to him<sup>asws</sup>, ‘O Abu Ja’far<sup>asws</sup>, the Statement of Allah<sup>azwj</sup> the High: “<span class=\"ibTxt\">[21:30] Do not those who disbelieve see that the heavens and the earth were closed up, but We have opened them”</span>. So Abu Ja’far<sup>asws</sup> said: ‘Perhaps you think that these two used to be stuck together and there were separated from each other?’ He said, ‘Yes’. Abu Ja’far<sup>asws</sup> said: ‘Seek Forgiveness from your Lord<sup>azwj</sup>, for it is the Statement of Allah<sup>azwj</sup> Mighty and Majestic that they were closed up, meaning that the sky used to be closed up and no rain descended from it, and the earth was closed up and did not grow any seed (vegetation). So when Allah<sup>azwj</sup> Blessed and High Created the creatures, He<sup>azwj</sup> Spread therein all kinds of animals. He<sup>azwj</sup> Opened up the sky by the rain and the earth by the seed’. The Syrian said, ‘I testify that you<sup>asws</sup> are from the children of the Prophets<sup>as</sup> and that your<sup>asws</sup> knowledge is their<sup>as</sup> knowledge’."]}}, {"index": 14741, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:8:1:23:2", "text": ["14516- مُحَمَّدٌ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ وَ الْحَجَّالِ عَنِ الْعَلَاءِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قَالَ لِي أَبُو جَعْفَرٍ (عليه السلام) كَانَ كُلُّ شَيْ‏ءٍ مَاءً وَ كَانَ عَرْشُهُ عَلَى الْمَاءِ فَأَمَرَ اللَّهُ عَزَّ ذِكْرُهُ الْمَاءَ فَاضْطَرَمَ نَاراً ثُمَّ أَمَرَ النَّارَ فَخَمَدَتْ فَارْتَفَعَ مِنْ خُمُودِهَا دُخَانٌ فَخَلَقَ اللَّهُ السَّمَاوَاتِ مِنْ ذَلِكَ الدُّخَانِ وَ خَلَقَ الْأَرْضَ مِنَ الرَّمَادِ ثُمَّ اخْتَصَمَ الْمَاءُ وَ النَّارُ وَ الرِّيحُ فَقَالَ الْمَاءُ أَنَا جُنْدُ اللَّهِ الْأَكْبَرُ وَ قَالَتِ الرِّيحُ أَنَا جُنْدُ اللَّهِ الْأَكْبَرُ وَ قَالَتِ النَّارُ أَنَا جُنْدُ اللَّهِ الْأَكْبَرُ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى الرِّيحِ أَنْتِ جُنْدِيِّ الْأَكْبَرُ ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473176\">H 14516</a> – Muhammad, from Ahmad Bin Muhammad, from Ibn Mahboub, from Al-A’ala Bin Razeyn, from Muhammad Bin Muslim and Al-Hajjaal, from Al-A’ala, from Muhammad Bin Muslim who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> said to me: ‘Everything used to be water, and His<sup>azwj</sup> Throne used to be on the water. So Allah<sup>azwj</sup> Mighty is His<sup>azwj</sup> Mention Commanded the water, so a fire was ignited. Then He<sup>azwj</sup> Commanded the fire, so it was extinguished and smoke arose from its subsidence. So Allah<sup>azwj</sup> Created the Heavens from that smoke, and Created the earth from the ash. Then the water, and the fire, and the wind quarrelled. So the water said, ‘I am the greatest army of Allah<sup>azwj</sup>’, and the wind said, ‘I am the greatest army of Allah<sup>azwj</sup>, and the fire said, ‘I am the greatest army of Allah<sup>azwj</sup>. So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto the wind: “You are My<sup>azwj</sup> greatest army’.", "out of 567"]}}]}, "index": "al-kafi:8:1:23", "kind": "verse_list"}