{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 24"
        },
        "path": "/books/al-kafi:8:1:24",
        "titles": {
          "ar": "حَدِيثُ الْجِنَانِ وَ النُّوقِ",
          "en": "HADEETH OF THE GARDENS AND THE SHE-CAMEL"
        }
      }
    ],
    "index": 2295,
    "local_index": 24,
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:24",
    "titles": {
      "ar": "حَدِيثُ الْجِنَانِ وَ النُّوقِ",
      "en": "HADEETH OF THE GARDENS AND THE SHE-CAMEL"
    },
    "verse_count": 2,
    "verse_start_index": 14752,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 233)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14753,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:24:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14517</span> - عَلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ الْمَدَنِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) سُئِلَ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ وَفْداً فَقَالَ يَا عَلِيُّ إِنَّ الْوَفْدَ لَا يَكُونُونَ إِلَّا رُكْبَاناً أُولَئِكَ رِجَالٌ اتَّقَوُا اللَّهَ فَأَحَبَّهُمُ اللَّهُ وَ اخْتَصَّهُمْ وَ رَضِيَ أَعْمَالَهُمْ فَسَمَّاهُمُ الْمُتَّقِينَ ",
          "ثُمَّ قَالَ لَهُ يَا عَلِيُّ أَمَا وَ الَّذِي فَلَقَ الْحَبَّةَ وَ بَرَأَ النَّسَمَةَ إِنَّهُمْ لَيَخْرُجُونَ مِنْ قُبُورِهِمْ وَ إِنَّ الْمَلَائِكَةَ لَتَسْتَقْبِلُهُمْ بِنُوقٍ مِنْ نُوقِ الْعِزِّ عَلَيْهَا رَحَائِلُ الذَّهَبِ مُكَلَّلَةً بِالدُّرِّ وَ الْيَاقُوتِ وَ جَلَائِلُهَا الْإِسْتَبْرَقُ وَ السُّنْدُسُ وَ خُطُمُهَا جَدْلُ الْأُرْجُوَانِ تَطِيرُ بِهِمْ إِلَى الْمَحْشَرِ مَعَ كُلِّ رَجُلٍ مِنْهُمْ أَلْفُ مَلَكٍ مِنْ قُدَّامِهِ وَ عَنْ يَمِينِهِ وَ عَنْ شِمَالِهِ يَزُفُّونَهُمْ زَفّاً حَتَّى يَنْتَهُوا بِهِمْ إِلَى بَابِ الْجَنَّةِ الْأَعْظَمِ وَ عَلَى بَابِ الْجَنَّةِ شَجَرَةٌ إِنَّ الْوَرَقَةَ مِنْهَا لَيَسْتَظِلُّ تَحْتَهَا أَلْفُ رَجُلٍ مِنَ النَّاسِ وَ عَنْ يَمِينِ الشَّجَرَةِ عَيْنٌ مُطَهِّرَةٌ مُزَكِّيَةٌ قَالَ فَيُسْقَوْنَ مِنْهَا شَرْبَةً فَيُطَهِّرُ اللَّهُ بِهَا قُلُوبَهُمْ مِنَ الْحَسَدِ وَ يُسْقِطُ مِنْ أَبْشَارِهِمُ الشَّعْرَ وَ ذَلِكَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ سَقاهُمْ رَبُّهُمْ شَراباً طَهُوراً مِنْ تِلْكَ الْعَيْنِ الْمُطَهِّرَةِ ",
          "قَالَ ثُمَّ يَنْصَرِفُونَ إِلَى عَيْنٍ أُخْرَى عَنْ يَسَارِ الشَّجَرَةِ فَيَغْتَسِلُونَ فِيهَا وَ هِيَ عَيْنُ الْحَيَاةِ فَلَا يَمُوتُونَ أَبَداً قَالَ ثُمَّ يُوقَفُ بِهِمْ قُدَّامَ الْعَرْشِ وَ قَدْ سَلِمُوا مِنَ الْآفَاتِ وَ الْأَسْقَامِ وَ الْحَرِّ وَ الْبَرْدِ أَبَداً قَالَ فَيَقُولُ الْجَبَّارُ جَلَّ ذِكْرُهُ لِلْمَلَائِكَةِ الَّذِينَ مَعَهُمْ احْشُرُوا أَوْلِيَائِي إِلَى الْجَنَّةِ وَ لَا تُوقِفُوهُمْ مَعَ الْخَلَائِقِ فَقَدْ سَبَقَ رِضَايَ عَنْهُمْ وَ وَجَبَتْ رَحْمَتِي لَهُمْ وَ كَيْفَ أُرِيدُ أَنْ أُوقِفَهُمْ مَعَ أَصْحَابِ الْحَسَنَاتِ وَ السَّيِّئَاتِ ",
          "قَالَ فَتَسُوقُهُمُ الْمَلَائِكَةُ إِلَى الْجَنَّةِ فَإِذَا انْتَهَوْا بِهِمْ إِلَى بَابِ الْجَنَّةِ الْأَعْظَمِ ضَرَبَ الْمَلَائِكَةُ الْحَلْقَةَ ضَرْبَةً فَتَصِرُّ صَرِيراً يَبْلُغُ صَوْتُ صَرِيرِهَا كُلَّ حَوْرَاءَ أَعَدَّهَا اللَّهُ عَزَّ وَ جَلَّ لِأَوْلِيَائِهِ فِي الْجِنَانِ فَيَتَبَاشَرْنَ بِهِمْ إِذَا سَمِعْنَ صَرِيرَ الْحَلْقَةِ فَيَقُولُ بَعْضُهُنَّ لِبَعْضٍ قَدْ جَاءَنَا أَوْلِيَاءُ اللَّهِ فَيُفْتَحُ لَهُمُ الْبَابُ فَيَدْخُلُونَ الْجَنَّةَ وَ تُشْرِفُ عَلَيْهِمْ أَزْوَاجُهُمْ مِنَ الْحُورِ الْعِينِ وَ الْآدَمِيِّينَ فَيَقُلْنَ مَرْحَباً بِكُمْ فَمَا كَانَ أَشَدَّ شَوْقَنَا إِلَيْكُمْ وَ يَقُولُ لَهُنَّ أَوْلِيَاءُ اللَّهِ مِثْلَ ذَلِكَ ",
          "فَقَالَ عَلِيٌّ (عليه السلام) يَا رَسُولَ اللَّهِ أَخْبِرْنَا عَنْ قَوْلِ اللَّهِ جَلَّ وَ عَزَّ غُرَفٌ مِنْ فَوْقِها غُرَفٌ مَبْنِيَّةٌ بِمَا ذَا بُنِيَتْ يَا رَسُولَ اللَّهِ فَقَالَ يَا عَلِيُّ تِلْكَ غُرَفٌ بَنَاهَا اللَّهُ عَزَّ وَ جَلَّ لِأَوْلِيَائِهِ بِالدُّرِّ وَ الْيَاقُوتِ وَ الزَّبَرْجَدِ سُقُوفُهَا الذَّهَبُ مَحْبُوكَةٌ بِالْفِضَّةِ لِكُلِّ غُرْفَةٍ مِنْهَا أَلْفُ بَابٍ مِنْ ذَهَبٍ عَلَى كُلِّ بَابٍ مِنْهَا مَلَكٌ مُوَكَّلٌ بِهِ فِيهَا فُرُشٌ مَرْفُوعَةٌ بَعْضُهَا فَوْقَ بَعْضٍ مِنَ الْحَرِيرِ وَ الدِّيبَاجِ بِأَلْوَانٍ مُخْتَلِفَةٍ وَ حَشْوُهَا الْمِسْكُ وَ الْكَافُورُ وَ الْعَنْبَرُ وَ ذَلِكَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ فُرُشٍ مَرْفُوعَةٍ إِذَا أُدْخِلَ الْمُؤْمِنُ إِلَى مَنَازِلِهِ فِي الْجَنَّةِ وَ وُضِعَ عَلَى رَأْسِهِ تَاجُ الْمُلْكِ وَ الْكَرَامَةِ أُلْبِسَ حُلَلَ الذَّهَبِ وَ الْفِضَّةِ وَ الْيَاقُوتِ وَ الدُّرِّ الْمَنْظُومِ فِي الْإِكْلِيلِ تَحْتَ التَّاجِ ",
          "قَالَ وَ أُلْبِسَ سَبْعِينَ حُلَّةَ حَرِيرٍ بِأَلْوَانٍ مُخْتَلِفَةٍ وَ ضُرُوبٍ مُخْتَلِفَةٍ مَنْسُوجَةً بِالذَّهَبِ وَ الْفِضَّةِ وَ اللُّؤْلُؤِ وَ الْيَاقُوتِ الْأَحْمَرِ فَذَلِكَ قَوْلُهُ عَزَّ وَ جَلَّ يُحَلَّوْنَ فِيها مِنْ أَساوِرَ مِنْ ذَهَبٍ وَ لُؤْلُؤاً وَ لِباسُهُمْ فِيها حَرِيرٌ فَإِذَا جَلَسَ الْمُؤْمِنُ عَلَى سَرِيرِهِ اهْتَزَّ سَرِيرُهُ فَرَحاً فَإِذَا اسْتَقَرَّ لِوَلِيِّ اللَّهِ جَلَّ وَ عَزَّ مَنَازِلُهُ فِي الْجِنَانِ اسْتَأْذَنَ عَلَيْهِ الْمَلَكُ الْمُوَكَّلُ بِجِنَانِهِ لِيُهَنِّئَهُ بِكَرَامَةِ اللَّهِ عَزَّ وَ جَلَّ إِيَّاهُ فَيَقُولُ لَهُ خُدَّامُ الْمُؤْمِنِ مِنَ الْوُصَفَاءِ وَ الْوَصَائِفِ مَكَانَكَ فَإِنَّ وَلِيَّ اللَّهِ قَدِ اتَّكَأَ عَلَى أَرِيكَتِهِ وَ زَوْجَتُهُ الْحَوْرَاءُ تَهَيَّأُ لَهُ فَاصْبِرْ لِوَلِيِّ اللَّهِ ",
          "قَالَ فَتَخْرُجُ عَلَيْهِ زَوْجَتُهُ الْحَوْرَاءُ مِنْ خَيْمَةٍ لَهَا تَمْشِي مُقْبِلَةً وَ حَوْلَهَا وَصَائِفُهَا وَ عَلَيْهَا سَبْعُونَ حُلَّةً مَنْسُوجَةً بِالْيَاقُوتِ وَ اللُّؤْلُؤِ وَ الزَّبَرْجَدِ وَ هِيَ مِنْ مِسْكٍ وَ عَنْبَرٍ وَ عَلَى رَأْسِهَا تَاجُ الْكَرَامَةِ وَ عَلَيْهَا نَعْلَانِ مِنْ ذَهَبٍ مُكَلَّلَتَانِ بِالْيَاقُوتِ وَ اللُّؤْلُؤِ شِرَاكُهُمَا يَاقُوتٌ أَحْمَرُ فَإِذَا دَنَتْ مِنْ وَلِيِّ اللَّهِ فَهَمَّ أَنْ يَقُومَ إِلَيْهَا شَوْقاً فَتَقُولُ لَهُ يَا وَلِيَّ اللَّهِ لَيْسَ هَذَا يَوْمَ تَعَبٍ وَ لَا نَصَبٍ فَلَا تَقُمْ أَنَا لَكَ وَ أَنْتَ لِي قَالَ فَيَعْتَنِقَانِ مِقْدَارَ خَمْسِمِائَةِ عَامٍ مِنْ أَعْوَامِ الدُّنْيَا لَا يُمِلُّهَا وَ لَا تُمِلُّهُ ",
          "قَالَ فَإِذَا فَتَرَ بَعْضَ الْفُتُورِ مِنْ غَيْرِ مَلَالَةٍ نَظَرَ إِلَى عُنُقِهَا فَإِذَا عَلَيْهَا قَلَائِدُ مِنْ قَصَبٍ مِنْ يَاقُوتٍ أَحْمَرَ وَسَطُهَا لَوْحٌ صَفْحَتُهُ دُرَّةٌ مَكْتُوبٌ فِيهَا أَنْتَ يَا وَلِيَّ اللَّهِ حَبِيبِي وَ أَنَا الْحَوْرَاءُ حَبِيبَتُكَ إِلَيْكَ تَنَاهَتْ نَفْسِي وَ إِلَيَّ تَنَاهَتْ نَفْسُكَ ",
          "ثُمَّ يَبْعَثُ اللَّهُ إِلَيْهِ أَلْفَ مَلَكٍ يُهَنِّئُونَهُ بِالْجَنَّةِ وَ يُزَوِّجُونَهُ بِالْحَوْرَاءِ قَالَ فَيَنْتَهُونَ إِلَى أَوَّلِ بَابٍ مِنْ جِنَانِهِ فَيَقُولُونَ لِلْمَلَكِ الْمُوَكَّلِ بِأَبْوَابِ جِنَانِهِ اسْتَأْذِنْ لَنَا عَلَى وَلِيِّ اللَّهِ فَإِنَّ اللَّهَ بَعَثَنَا إِلَيْهِ نُهَنِّئُهُ فَيَقُولُ لَهُمُ الْمَلَكُ حَتَّى أَقُولَ لِلْحَاجِبِ فَيُعْلِمَهُ بِمَكَانِكُمْ قَالَ فَيَدْخُلُ الْمَلَكُ إِلَى الْحَاجِبِ وَ بَيْنَهُ وَ بَيْنَ الْحَاجِبِ ثَلَاثُ جِنَانٍ حَتَّى يَنْتَهِيَ إِلَى أَوَّلِ بَابٍ فَيَقُولُ لِلْحَاجِبِ إِنَّ عَلَى بَابِ الْعَرْصَةِ أَلْفَ مَلَكٍ أَرْسَلَهُمْ رَبُّ الْعَالَمِينَ تَبَارَكَ وَ تَعَالَى لِيُهَنِّئُوا وَلِيَّ اللَّهِ وَ قَدْ سَأَلُونِي أَنْ آذَنَ لَهُمْ عَلَيْهِ فَيَقُولُ الْحَاجِبُ إِنَّهُ لَيَعْظُمُ عَلَيَّ أَنْ أَسْتَأْذِنَ لِأَحَدٍ عَلَى وَلِيِّ اللَّهِ وَ هُوَ مَعَ زَوْجَتِهِ الْحَوْرَاءِ ",
          "قَالَ وَ بَيْنَ الْحَاجِبِ وَ بَيْنَ وَلِيِّ اللَّهِ جَنَّتَانِ قَالَ فَيَدْخُلُ الْحَاجِبُ إِلَى الْقَيِّمِ فَيَقُولُ لَهُ إِنَّ عَلَى بَابِ الْعَرْصَةِ أَلْفَ مَلَكٍ أَرْسَلَهُمْ رَبُّ الْعِزَّةِ يُهَنِّئُونَ وَلِيَّ اللَّهِ فَاسْتَأْذِنْ لَهُمْ فَيَتَقَدَّمُ الْقَيِّمُ إِلَى الْخُدَّامِ فَيَقُولُ لَهُمْ إِنَّ رُسُلَ الْجَبَّارِ عَلَى بَابِ الْعَرْصَةِ وَ هُمْ أَلْفُ مَلَكٍ أَرْسَلَهُمُ اللَّهُ يُهَنِّئُونَ وَلِيَّ اللَّهِ فَأَعْلِمُوهُ بِمَكَانِهِمْ قَالَ فَيُعْلِمُونَهُ فَيُؤْذَنُ لِلْمَلَائِكَةِ فَيَدْخُلُونَ عَلَى وَلِيِّ اللَّهِ وَ هُوَ فِي الْغُرْفَةِ وَ لَهَا أَلْفُ بَابٍ وَ عَلَى كُلِّ بَابٍ مِنْ أَبْوَابِهَا مَلَكٌ مُوَكَّلٌ بِهِ فَإِذَا أُذِنَ لِلْمَلَائِكَةِ بِالدُّخُولِ عَلَى وَلِيِّ اللَّهِ فَتَحَ كُلُّ مَلَكٍ بَابَهُ الْمُوَكَّلَ بِهِ قَالَ فَيُدْخِلُ الْقَيِّمُ كُلَّ مَلَكٍ مِنْ بَابٍ مِنْ أَبْوَابِ الْغُرْفَةِ قَالَ فَيُبَلِّغُونَهُ رِسَالَةَ الْجَبَّارِ جَلَّ وَ عَزَّ وَ ذَلِكَ قَوْلُ اللَّهِ تَعَالَى وَ الْمَلائِكَةُ يَدْخُلُونَ عَلَيْهِمْ مِنْ كُلِّ بابٍ مِنْ أَبْوَابِ الْغُرْفَةِ سَلامٌ عَلَيْكُمْ إِلَى آخِرِ الْآيَةِ ",
          "قَالَ وَ ذَلِكَ قَوْلُهُ جَلَّ وَ عَزَّ وَ إِذا رَأَيْتَ ثَمَّ رَأَيْتَ نَعِيماً وَ مُلْكاً كَبِيراً يَعْنِي بِذَلِكَ وَلِيَّ اللَّهِ وَ مَا هُوَ فِيهِ مِنَ الْكَرَامَةِ وَ النَّعِيمِ وَ الْمُلْكِ الْعَظِيمِ الْكَبِيرِ إِنَّ الْمَلَائِكَةَ مِنْ رُسُلِ اللَّهِ عَزَّ ذِكْرُهُ يَسْتَأْذِنُونَ [فِي الدُّخُولِ] عَلَيْهِ فَلَا يَدْخُلُونَ عَلَيْهِ إِلَّا بِإِذْنِهِ فَلِذَلِكَ الْمُلْكُ الْعَظِيمُ الْكَبِيرُ قَالَ وَ الْأَنْهَارُ تَجْرِي مِنْ تَحْتِ مَسَاكِنِهِمْ وَ ذَلِكَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ تَجْرِي مِنْ تَحْتِهِمُ الْأَنْهارُ وَ الثِّمَارُ دَانِيَةٌ مِنْهُمْ وَ هُوَ قَوْلُهُ عَزَّ وَ جَلَّ وَ دانِيَةً عَلَيْهِمْ ظِلالُها وَ ذُلِّلَتْ قُطُوفُها تَذْلِيلًا مِنْ قُرْبِهَا مِنْهُمْ يَتَنَاوَلُ الْمُؤْمِنُ مِنَ النَّوْعِ الَّذِي يَشْتَهِيهِ مِنَ الثِّمَارِ بِفِيهِ وَ هُوَ مُتَّكِئٌ وَ إِنَّ الْأَنْوَاعَ مِنَ الْفَاكِهَةِ لَيَقُلْنَ لِوَلِيِّ اللَّهِ يَا وَلِيَّ اللَّهِ كُلْنِي قَبْلَ أَنْ تَأْكُلَ هَذَا قَبْلِي ",
          "قَالَ وَ لَيْسَ مِنْ مُؤْمِنٍ فِي الْجَنَّةِ إِلَّا وَ لَهُ جِنَانٌ كَثِيرَةٌ مَعْرُوشَاتٌ وَ غَيْرُ مَعْرُوشَاتٍ وَ أَنْهَارٌ مِنْ خَمْرٍ وَ أَنْهَارٌ مِنْ مَاءٍ وَ أَنْهَارٌ مِنْ لَبَنٍ وَ أَنْهَارٌ مِنْ عَسَلٍ فَإِذَا دَعَا وَلِيُّ اللَّهِ بِغِذَائِهِ أُتِيَ بِمَا تَشْتَهِي نَفْسُهُ عِنْدَ طَلَبِهِ الْغِذَاءَ مِنْ غَيْرِ أَنْ يُسَمِّيَ شَهْوَتَهُ قَالَ ثُمَّ يَتَخَلَّى مَعَ إِخْوَانِهِ وَ يَزُورُ بَعْضُهُمْ بَعْضاً وَ يَتَنَعَّمُونَ فِي جَنَّاتِهِمْ فِي ظِلٍّ مَمْدُودٍ فِي مِثْلِ مَا بَيْنَ طُلُوعِ الْفَجْرِ إِلَى طُلُوعِ الشَّمْسِ وَ أَطْيَبُ مِنْ ذَلِكَ لِكُلِّ مُؤْمِنٍ سَبْعُونَ زَوْجَةً حَوْرَاءَ وَ أَرْبَعُ نِسْوَةٍ مِنَ الْآدَمِيِّينَ وَ الْمُؤْمِنُ سَاعَةً مَعَ الْحَوْرَاءِ وَ سَاعَةً مَعَ الْآدَمِيَّةِ وَ سَاعَةً يَخْلُو بِنَفْسِهِ عَلَى الْأَرَائِكِ مُتَّكِئاً يَنْظُرُ بَعْضُهُمْ إِلَى بَعْضٍ ",
          "وَ إِنَّ الْمُؤْمِنَ لَيَغْشَاهُ شُعَاعُ نُورٍ وَ هُوَ عَلَى أَرِيكَتِهِ وَ يَقُولُ لِخُدَّامِهِ مَا هَذَا الشُّعَاعُ اللَّامِعُ لَعَلَّ الْجَبَّارَ لَحَظَنِي فَيَقُولُ لَهُ خُدَّامُهُ قُدُّوسٌ قُدُّوسٌ جَلَّ جَلَالُ اللَّهِ بَلْ هَذِهِ حَوْرَاءُ مِنْ نِسَائِكَ مِمَّنْ لَمْ تَدْخُلْ بِهَا بَعْدُ قَدْ أَشْرَفَتْ عَلَيْكَ مِنْ خَيْمَتِهَا شَوْقاً إِلَيْكَ وَ قَدْ تَعَرَّضَتْ لَكَ وَ أَحَبَّتْ لِقَاءَكَ فَلَمَّا أَنْ رَأَتْكَ مُتَّكِئاً عَلَى سَرِيرِكَ تَبَسَّمَتْ نَحْوَكَ شَوْقاً إِلَيْكَ فَالشُّعَاعُ الَّذِي رَأَيْتَ وَ النُّورُ الَّذِي غَشِيَكَ هُوَ مِنْ بَيَاضِ ثَغْرِهَا وَ صَفَائِهِ وَ نَقَائِهِ وَ رِقَّتِهِ ",
          "قَالَ فَيَقُولُ وَلِيُّ اللَّهِ ائْذَنُوا لَهَا فَتَنْزِلَ إِلَيَّ فَيَبْتَدِرُ إِلَيْهَا أَلْفُ وَصِيفٍ وَ أَلْفُ وَصِيفَةٍ يُبَشِّرُونَهَا بِذَلِكَ فَتَنْزِلُ إِلَيْهِ مِنْ خَيْمَتِهَا وَ عَلَيْهَا سَبْعُونَ حُلَّةً مَنْسُوجَةً بِالذَّهَبِ وَ الْفِضَّةِ مُكَلَّلَةً بِالدُّرِّ وَ الْيَاقُوتِ وَ الزَّبَرْجَدِ صِبْغُهُنَّ الْمِسْكُ وَ الْعَنْبَرُ بِأَلْوَانٍ مُخْتَلِفَةٍ يُرَى مُخُّ سَاقِهَا مِنْ وَرَاءِ سَبْعِينَ حُلَّةً طُولُهَا سَبْعُونَ ذِرَاعاً وَ عَرْضُ مَا بَيْنَ مَنْكِبَيْهَا عَشَرَةُ أَذْرُعٍ فَإِذَا دَنَتْ مِنْ وَلِيِّ اللَّهِ أَقْبَلَ الْخُدَّامُ بِصَحَائِفِ الذَّهَبِ وَ الْفِضَّةِ فِيهَا الدُّرُّ وَ الْيَاقُوتُ وَ الزَّبَرْجَدُ فَيَنْثُرُونَهَا عَلَيْهَا ثُمَّ يُعَانِقُهَا وَ تُعَانِقُهُ فَلَا يَمَلُّ وَ لَا تَمَلُّ ",
          "قَالَ ثُمَّ قَالَ أَبُو جَعْفَرٍ (عليه السلام) أَمَّا الْجِنَانُ الْمَذْكُورَةُ فِي الْكِتَابِ فَإِنَّهُنَّ جَنَّةُ عَدْنٍ وَ جَنَّةُ الْفِرْدَوْسِ وَ جَنَّةُ نَعِيمٍ وَ جَنَّةُ الْمَأْوَى قَالَ وَ إِنَّ لِلَّهِ عَزَّ وَ جَلَّ جِنَاناً مَحْفُوفَةً بِهَذِهِ الْجِنَانِ وَ إِنَّ الْمُؤْمِنَ لَيَكُونُ لَهُ مِنَ الْجِنَانِ مَا أَحَبَّ وَ اشْتَهَى يَتَنَعَّمُ فِيهِنَّ كَيْفَ يَشَاءُ وَ إِذَا أَرَادَ الْمُؤْمِنُ شَيْئاً أَوِ اشْتَهَى إِنَّمَا دَعْوَاهُ فِيهَا إِذَا أَرَادَ أَنْ يَقُولَ سُبْحَانَكَ اللَّهُمَّ فَإِذَا قَالَهَا تَبَادَرَتْ إِلَيْهِ الْخَدَمُ بِمَا اشْتَهَى مِنْ غَيْرِ أَنْ يَكُونَ طَلَبَهُ مِنْهُمْ أَوْ أَمَرَ بِهِ وَ ذَلِكَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ دَعْواهُمْ فِيها سُبْحانَكَ اللَّهُمَّ وَ تَحِيَّتُهُمْ فِيها سَلامٌ يَعْنِي الْخُدَّامَ قَالَ وَ آخِرُ دَعْواهُمْ أَنِ الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ يَعْنِي بِذَلِكَ عِنْدَ مَا يَقْضُونَ مِنْ لَذَّاتِهِمْ مِنَ الْجِمَاعِ وَ الطَّعَامِ وَ الشَّرَابِ يَحْمَدُونَ اللَّهَ عَزَّ وَ جَلَّ عِنْدَ فَرَاغَتِهِمْ",
          "وَ أَمَّا قَوْلُهُ أُولئِكَ لَهُمْ رِزْقٌ مَعْلُومٌ قَالَ يَعْلَمُهُ الْخُدَّامُ فَيَأْتُونَ بِهِ أَوْلِيَاءَ اللَّهِ قَبْلَ أَنْ يَسْأَلُوهُمْ إِيَّاهُ ",
          "وَ أَمَّا قَوْلُهُ عَزَّ وَ جَلَّ فَواكِهُ وَ هُمْ مُكْرَمُونَ قَالَ فَإِنَّهُمْ لَا يَشْتَهُونَ شَيْئاً فِي الْجَنَّةِ إِلَّا أُكْرِمُوا بِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473178\">H 14517</a> – Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Muhammad Bin Is’haq Al-Madany, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> having said that: ‘The Rasool<sup>saww</sup> of Allah<sup>azwj</sup> was asked about the Statement of Allah<sup>azwj</sup>: <span class=\"ibTxt\">“[19:85] The day We shall gather the righteous to (Allah) Most Gracious, like a band presented before a king for honours”</span>, so he<sup>saww</sup> said: ‘O Ali<sup>asws</sup>! Surely the delegation will not come up except on rides. These will be the men who feared Allah<sup>azwj</sup>, so Allah<sup>azwj</sup> Loved them and Specialised them and being Pleased with their deeds and therefore they have been named as the pious ones’.",
            "Then he<sup>saww</sup> said to him<sup>asws</sup>: ‘O Ali<sup>asws</sup>! By the One<sup>azwj</sup> Who Split the seed and Brought life out of it, they will be coming out from their graves and the Angels will be welcoming them by a she-camel from the she-camels of honour on which will be saddles of gold crowned with pearls and sapphire, and it will be covered in brocade and silk, and its braid will be purple, and it will fly with them to the place of Resurrection. ",
            "Along with every man from them will be a thousand Angels in front of them, and on his right, and on his left escorting them with an (honourable) escort until they will end up with them to the Great Door of the Paradise. And at the Door (Entrance) of the Paradise is a tree, a leaf from it can give shade to a thousand men from the people under it. And on the right of the tree is a fountain pure and clear’. He<sup>saww</sup> said: ‘They will quench themselves with a drink from it, so Allah<sup>azwj</sup> will Purify their hearts by it from the ‘الْحَسَدِ’ (jealousy/envy), and their bodily hair will drop off, and that is the Statement of Allah<sup>azwj</sup>: <span class=\"ibTxt\">“[76:21] and their Lord shall make them drink a pure drink”</span>. It will be from that pure fountain’.",
            "He<sup>saww</sup> said: ‘Then they will leave to go to another Fountain on the right of the Tree. So they will bathe in it, and it is the Fountain of (everlasting) Life, and so they will not be dying ever’. He<sup>saww</sup> said: ‘Then they (the she-camels) will pause by them in front of the Throne, and they would have been made safe from the diseases and the illnesses and the heat and the cold for all eternity’. ",
            "Rasool Allah<sup>saww</sup> said: ‘Then the ‘الْجَبَّارُ’ (Compeller<sup>azwj</sup>) Majestic, Who cannot be Described (by any means), will Say to the Angels who will be with them: “Usher My<sup>azwj</sup> friends to the Paradise and do not pause them with the creatures from I<sup>azwj</sup> am already Pleased with them and My<sup>azwj</sup> Mercy has been Obligated for them, and how can I<sup>azwj</sup> Want them to be paused, the companions of the good with that of the evil?’ ",
            "He<sup>saww</sup> said: ‘The Angels will lead them to the Paradise. So when they end up with them at the Great Entrance of the Paradise the Angels will knock hard on the door. Its pleasant sound will reach every Hourie whom Allah<sup>azwj</sup> has Prepared for His<sup>azwj</sup> friends in the Gardens. They (Houries) will give them the good news of it when they hear the pleasant sound of the ring (door bell), so some of them will say to the others, ‘The friends of Allah<sup>azwj</sup> have come to us, so open the Door for them’. They will enter the Paradise and their respective wives from the beautiful Houries and the humans will welcome them by saying, ‘Congratulations to you for we have been intensely eager in our desire to be with you’, and the friends of Allah<sup>azwj</sup> will say to them similarly’.",
            "Ali<sup>asws</sup> said: ‘O Rasool<sup>saww</sup> Allah<sup>azwj</sup>! Inform us about the Statement of Allah<sup>azwj</sup>; <span class=\"ibTxt\">“[39:20] But it is for those who fear their Lord. That lofty mansions, one above another, have been built”</span>, O Rasool<sup>saww</sup> Allah<sup>azwj</sup>’. So he<sup>saww</sup> said: ‘O Ali<sup>asws</sup>! Those are mansions which Allah<sup>azwj</sup> has Built for His<sup>azwj</sup> friends from the pearls, and the sapphire, and the emeralds, and their ceilings are of gold interwoven with silver. For each of the mansions are a thousand doors of gold upon each of which is an Angel allocated to it. In them are raised couches, one on top of the other from the silk, and the brocades of different colours, and their filling is of musk, and the camphor and ambergris, and that is the Statement of Allah<sup>azwj</sup>: <span class=\"ibTxt\">“[56:34] And raised couches”</span>. When the Believer enters his house in the Paradise, a crown of kingship and prestige would be placed upon his head, and he will be dressed in the clothes of gold, and silver, and the rubies, and the crystals arranged in designs as a wreath under the crown’.",
            "Rasool Allah<sup>saww</sup> said: ‘And he will be dressed in seventy garments of silk of different colours, struck with different designs with gold, and the silver, and the pearls, and the red sapphire. So that is the Statement of Allah<sup>azwj</sup>: <span class=\"ibTxt\">“[22:23] they shall be adorned therein with bracelets of gold and pearls; and their garments there will be of silk”</span>. So when the Believer sits upon his bed, it will vibrate with joy. When the friend of Allah<sup>azwj</sup> settles down in his house in the Paradise, the Angels allocated to his Garden will seek permission from him so as to congratulate him for the honour Bestowed upon him by Allah<sup>azwj</sup>, and they will come to him. So the servants of the Believer from the butlers and the maids will say to them, ‘Stay in your place, for the friend of Allah<sup>azwj</sup> is leaning upon his couch, and his Hourie wife is grooming herself for him, therefore wait for the friend of Allah<sup>azwj</sup>’.",
            "Rasool Allah<sup>saww</sup> said: ‘So his Hourie wife will come out to him from her tent, walking to welcome him, and around her will be her maids, and upon her would be seventy garments interwoven with the sapphire, and the pearls, and the emeralds, and scented with musk, and ambergris. And upon her head would be a crown of prestige, and she would be wearing shoes of gold laced with sapphire and pearls, and their laces will be of red sapphire. So when she approaches the friend of Allah<sup>azwj</sup>, he would understand it and he would get up for her in desire, so she will say to him, ‘O friend of Allah<sup>azwj</sup>, this is not a day of tiredness and suffering, so do not get up. I am for you and you are for me’. ",
            "Rasool Allah<sup>saww</sup> said: ‘So they will hug each other for a duration of five hundred years from the years of the world. Neither will he get weary of her nor will she get weary of him.",
            "Rasool Allah<sup>saww</sup> said: ‘So when he calms down without being disheartened from her, he will look at her neck, so he will see on her a necklace embedded with red sapphire. In the midst of it would be a panel of pears on which would be written, “You, O friend of Allah<sup>azwj</sup> is my beloved, and I am the Hourie, beloved to you. My self is devoted to you and your self is devoted to me”.",
            "Then Allah<sup>azwj</sup> will Send to him a thousand Angels to congratulate him for being in the Paradise and having been married to the Hourie’. Rasool Allah<sup>saww</sup> said: ‘So they will end up to the first of the doors of his Gardens. They will say to the Angel allocated for that door of his garden, ‘Grant us permission to the friend of Allah<sup>azwj</sup>, for Allah<sup>azwj</sup> has Sent us to him to congratulate him’. The Angel will say to them, ‘Wait until I inform the guard to inform him of your places’. ",
            "Rasool Allah<sup>saww</sup> said: ‘So the Angel would come up to the guard, and in between the guard and him would be three Gardens until he will end up at the first door. So he will say to the guard that, ‘A thousand Angels are awaiting at the door, having been Sent by the Lord<sup>azwj</sup> of the world, Blessed and High, to congratulate the friend of Allah<sup>azwj</sup> and have asked me to grant them permission to see him’. The guard will say to the Angel, ‘This is difficult for me that I should permit anyone to the friend of Allah<sup>azwj</sup> as he is with his Hourie wife’.",
            "Rasool Allah<sup>saww</sup> said: ‘And in between the guard and the friend of Allah<sup>azwj</sup> are two Gardens’. He<sup>saww</sup> said: ‘So the guard will come up to the supervisor and say to him that, ‘At the door are a thousand Angels whom the Lord<sup>a</sup><sup>zwj</sup> of Honour has Sent to congratulate the friend of Allah<sup>azwj</sup>, so grant them permission’. The supervisor will proceed to the servants and say to them that, ‘A thousand Angels are at the door whom Allah<sup>azwj</sup> has Sent to congratulate the friend of Allah<sup>azwj</sup>, so make their places known to him’. ",
            "Rasool Allah<sup>saww</sup> said: ‘So they will make it known to him, and he will tell him to grant permission to the Angels. So they will come up to the friend of Allah<sup>azwj</sup>, and he would be in a mansion of his, and there will be a thousand doors in it, and at each door of its doors would be an Angel allocated to it. So he will allow the Angels to enter to be with the friend of Allah<sup>azwj</sup> by opening one door for each of the Angels to enter by. The supervisor would then allow each of the Angels from the door of the doors of the Mansion’. He<sup>saww</sup> said: ‘So they would then convey the Message of the Compeller<sup>azwj</sup> Majestic and Mighty to him and that is the Statement of Allah<sup>azwj</sup>: <span class=\"ibTxt\">“[13:23] and the angels will enter in upon them from every gate”</span>, from the doors of the Mansion, <span class=\"ibTxt\">“[13:24] Peace be on you” </span>- up to the end of the Verse’.",
            "Rasool Allah<sup>saww</sup> said: ‘And that is the Statement of the Majestic and Mighty: <span class=\"ibTxt\">“[76:20] And when you see there, you shall see blessings and a great kingdom”</span>, meaning by that the friend of Allah<sup>azwj</sup> and what he would be in from the Prestige and the Bounties, and the Magnificent and Great Kingdom. The Angels Sent by the Message from Allah<sup>azwj</sup> Mighty is His<sup>azwj</sup> Mention, would seek permission for their entrance to him. So they do not come up to him except by his permission. So that is the Magnificent and Great Kingdom’. ",
            "Rasool Allah<sup>saww</sup> said: ‘And the rivers would flow from underneath his dwelling and that is the Statement of Allah<sup>azwj</sup>: <span class=\"ibTxt\">“[18:31] These it is for whom are gardens of perpetuity beneath which rivers flow”</span>. And the fruits would come near to them and it is the Statement of Mighty and Majestic: <span class=\"ibTxt\">“[76:14] And close down upon them (shall be) its shadows, and its fruits shall be made near (to them) (as in humility), being easy to reach”</span>. The Believer would eat from the varieties of fruits by its category whilst leaning (relaxed upon the couch), and the varieties of the fruits will say to the friend of Allah<sup>azwj</sup>, ‘Eat me before you eat this one’. ",
            "Rasool Allah<sup>saww</sup> said: ‘And there is none from the Believer in the Paradise except that for him would be numerous Gardens, with a gazebo or without a gazebo, and rivers of pure drinks, and rivers of water, and rivers of milk, and rivers of honey. So if the friend of Allah<sup>azwj</sup> calls to partake a meal, he would be given whatsoever he desires for from the foods without even having named his desire’. Rasool Allah<sup>saww</sup> said: ‘Then he would seclude himself with his wife, and some of them would visit each other, and they would enjoy in their Gardens in extended shade, similar to what is between the break of dawn to the rise of the sun, and better than that. ",
            "Each of the Believer would have seventy wives from the Houries, and four women from the humans, and the Believer would spend an hour with the Hourie, and an hour with the human (wife), and an hour alone with himself, being relaxed leaning on his couch, some looking at some others’.",
            "The Believer would be covered by a shining beam of light and he would be upon his couch, and he would say to his servants, ‘What is this beam of light? Perhaps it is the Brilliance of the Compeller<sup>azwj</sup> Who has Observed me’. His servants would say to him, ‘Holy is He<sup>azwj</sup>! Holy is He<sup>azwj</sup>! Majestic is His<sup>azwj</sup> Majesty! But, this is a Hourie from your women (wives) whom you have never entered into. She just looked out of her tent towards you in her desire for you, and wants to present herself to you, and would love to meet with you. So when she saw you relaxed upon your couch, she smiled in her desire for you. So that was the brilliant beam that you saw and the light which you were covered in, it was from the whiteness of her mouth (teeth), and her cleanliness, and her purity, and her tenderness’.",
            "He<sup>saww</sup> said: ‘So the friend of Allah<sup>azwj</sup> would say, ‘Grant her permission’. So a thousand servants and a thousand maids would descend to her to give her the good news of that. So she would then come to him from her tent, and she would have upon her seventy garments interwoven with the gold, and silver, laced with gems and the sapphire, and the emeralds cover with musk and ambergris, of different colours. The marrow of her leg would be seen from underneath the seventy garments of seventy cubits of length, and the (distance) between her shoulders would be of ten cubits. So when she approaches the friend of Allah<sup>azwj</sup>, the servants would welcome her by a tray of gold and the silver in which would be gems, and the sapphire, and the emeralds, so they would display these to her. Then he would embrace her and she would embrace him. So neither would he be weary nor would she be weary’.",
            "He the (narrator) said, ‘Then Abu Ja’far<sup>asws</sup> said: ‘But rather the Gardens Mentioned in the Book are the Garden of <span class=\"iTxt\">Eden</span>, and the Garden of <span class=\"iTxt\">Al-Firdows</span>, and Garden of <span class=\"iTxt\">Naeem</span>, and Garden of <span class=\"iTxt\">Al-Ma’wa</span>’. He<sup>asws</sup> said: ‘And Allah<sup>azwj</sup> has Surrounded these Gardens with other Gardens, and that the Believer would be able to have for him from the Gardens whichever one what he loves, and wants and enjoy wherever he so likes to. And if the Believer intends a thing, or covets it, he would call for it by saying, ‘Glory be to You<sup>azwj</sup>, our Allah<sup>azwj</sup>!’ So if he says it, the servants would keep coming to him with what he had coveted for even without him having asked them for it or commanded them for it, and that is the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[10:10] Their cry in it shall be: Glory to Thee, O Allah! and their greeting in it shall be: </span><span style=\"font-style: italic; font-weight: bold; text-decoration: underline\">‘</span><span dir=\"rtl\" style=\"font-weight: bold; text-decoration: underline\">سَلامٌ</span><span style=\"font-style: italic; font-weight: bold; text-decoration: underline\">’</span><span class=\"ibTxt\"> Peace”</span>, meaning the servants’. He<sup>asws</sup> said: <span class=\"ibTxt\">“[10:10] and the last of their cry shall be: Praise be to Allah, the Lord of the worlds.”</span>, meaning by that after their having had their enjoyment from the copulation, and the food, and the drinks, they will be Praising Allah<sup>azwj</sup> Mighty and Majestic during their being free from that’. ",
            "And as for His<sup>azwj</sup> Statement: <span class=\"ibTxt\">“[37:41] For them is a Sustenance determined”</span>, he<sup>asws</sup> said: ‘The servants know of it, so they bring it to the friend of Allah<sup>azwj</sup> before he even asks them for it’. ",
            "And as for the Statement of the Mighty and Majestic: <span class=\"ibTxt\">“[37:42] Fruits, and they shall be highly honoured”</span>, he<sup>asws</sup> said: ‘They will not desire anything in the Paradise, except that they will be honoured with it’."
          ],
          "en.sarwar": [
            "69. Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Muhammad Bin Is’haq Al-Madany, who has narrated the following: Abu Ja’far (a.s.) having said that: ‘The Rasool (saww) of Allah (azwj) was asked about the Statement of Allah (azwj): “[19:85] The day We shall gather the righteous to (Allah) Most Gracious, like a band presented before a king for honours”, so he (saww) said: ‘O Ali (a.s.)! Surely the delegation will not come up except on rides. These will be the men who feared Allah (azwj), so Allah (azwj) Loved them and Specialised them and being Pleased with their deeds and therefore they have been named as the pious ones’. Then he (saww) said to him (a.s.): ‘O Ali (a.s.)! By the One (azwj) Who Split the seed and Brought life out of it, they will be coming out from their graves and the Angels will be welcoming them by a she-camel from the she-camels of honour on which will be saddles of gold crowned with pearls and sapphire, and it will be covered in brocade and silk, and its braid will be purple, and it will fly with them to the place of Resurrection. Along with every man from them will be a thousand Angels in front of them, and on his right, and on his left escorting them with an (honourable) escort until they will end up with them to the Great Door of the Paradise. And at the Door (Entrance) of the Paradise is a tree, a leaf from it can give shade to a thousand men from the people under it. And on the right of the tree is a fountain pure and clear’. He (saww) said: ‘They will quench themselves with a drink from it, so Allah (azwj) will Purify their hearts by it from the ‘الْحَسَدِ’ (jealousy/envy), and their bodily hair will drop off, and that is the Statement of Allah (azwj): “[76:21] and their Lord shall make them drink a pure drink”. It will be from that pure fountain’. He (saww) said: ‘Then they will leave to go to another Fountain on the right of the Tree. So they will bathe in it, and it is the Fountain of (everlasting) Life, and so they will not be dying ever’. He (saww) said: ‘Then they (the she-camels) will pause by them in front of the Throne, and they would have been made safe from the diseases and the illnesses and the heat and the cold for all eternity’. Rasool Allah (saww) said: ‘Then the ‘الْجَبَّارُ’ (Compeller (azwj)) Majestic, Who cannot be Described (by any means), will Say to the Angels who will be with them: “Usher My (azwj) friends to the Paradise and do not pause them with the creatures from I (azwj) am already Pleased with them and My (azwj) Mercy has been Obligated for them, and how can I (azwj) Want them to be paused, the companions of the good with that of the evil?’ He (saww) said: ‘The Angels will lead them to the Paradise. So when they end up with them at the Great Entrance of the Paradise the Angels will knock hard on the door. Its pleasant sound will reach every Hourie whom Allah (azwj) has Prepared for His (azwj) friends in the Gardens. They (Houries) will give them the good news of it when they hear the pleasant sound of the ring (door bell), so some of them will say to the others, ‘The friends of Allah (azwj) have come to us, so open the Door for them’. They will enter the Paradise and their respective wives from the beautiful Houries and the humans will welcome them by saying, ‘Congratulations to you for we have been intensely eager in our desire to be with you’, and the friends of Allah (azwj) will say to them similarly’. Ali (a.s.) said: ‘O Rasool (saww) Allah (azwj)! Inform us about the Statement of Allah (azwj); “[39:20] But it is for those who fear their Lord. That lofty mansions, one above another, have been built”, O Rasool (saww) Allah (azwj)’. So he (saww) said: ‘O Ali (a.s.)! Those are mansions which Allah (azwj) has Built for His (azwj) friends from the pearls, and the sapphire, and the emeralds, and their ceilings are of gold interwoven with silver. For each of the mansions are a thousand doors of gold upon each of which is an Angel allocated to it. In them are raised couches, one on top of the other from the silk, and the brocades of different colours, and their filling is of musk, and the camphor and ambergris, and that is the Statement of Allah (azwj): “[56:34] And raised couches”. When the Believer enters his house in the Paradise, a crown of kingship and prestige would be placed upon his head, and he will be dressed in the clothes of gold, and silver, and the rubies, and the crystals arranged in designs as a wreath under the crown’. Rasool Allah (saww) said: ‘And he will be dressed in seventy garments of silk of different colours, struck with different designs with gold, and the silver, and the pearls, and the red sapphire. So that is the Statement of Allah (azwj): “[22:23] they shall be adorned therein with bracelets of gold and pearls; and their garments there will be of silk”. So when the Believer sits upon his bed, it will vibrate with joy. When the friend of Allah (azwj) settles down in his house in the Paradise, the Angels allocated to his Garden will seek permission from him so as to congratulate him for the honour Bestowed upon him by Allah (azwj), and they will come to him. So the servants of the Believer from the butlers and the maids will say to them, ‘Stay in your place, for the friend of Allah (azwj) is leaning upon his couch, and his Hourie wife is grooming herself for him, therefore wait for the friend of Allah (azwj)’. Rasool Allah (saww) said: ‘So his Hourie wife will come out to him from her tent, walking to welcome him, and around her will be her maids, and upon her would be seventy garments interwoven with the sapphire, and the pearls, and the emeralds, and scented with musk, and ambergris. And upon her head would be a crown of prestige, and she would be wearing shoes of gold laced with sapphire and pearls, and their laces will be of red sapphire. So when she approaches the friend of Allah (azwj), he would understand it and he would get up for her in desire, so she will say to him, ‘O friend of Allah (azwj), this is not a day of tiredness and suffering, so do not get up. I am for you and you are for me’. Rasool Allah (saww) said: ‘So they will hug each other for a duration of five hundred years from the years of the world. Neither will he get weary of her nor will she get weary of him. Rasool Allah (saww) said: ‘So when he calms down without being disheartened from her, he will look at her neck, so he will see on her a necklace embedded with red sapphire. In the midst of it would be a panel of pears on which would be written, “You, O friend of Allah (azwj) is my beloved, and I am the Hourie, beloved to you. My self is devoted to you and your self is devoted to me”. Then Allah (azwj) will Send to him a thousand Angels to congratulate him for being in the Paradise and having been married to the Hourie’. Rasool Allah (saww) said: ‘So they will end up to the first of the doors of his Gardens. They will say to the Angel allocated for that door of his garden, ‘Grant us permission to the friend of Allah (azwj), for Allah (azwj) has Sent us to him to congratulate him’. The Angel will say to them, ‘Wait until I inform the guard to inform him of your places’. Rasool Allah (saww) said: ‘So the Angel would come up to the guard, and in between the guard and him would be three Gardens until he will end up at the first door. So he will say to the guard that, ‘A thousand Angels are awaiting at the door, having been Sent by the Lord (azwj) of the world, Blessed and High, to congratulate the friend of Allah (azwj) and have asked me to grant them permission to see him’. The guard will say to the Angel, ‘This is difficult for me that I should permit anyone to the friend of Allah (azwj) as he is with his Hourie wife’. Rasool Allah (saww) said: ‘And in between the guard and the friend of Allah (azwj) are two Gardens’. He (saww) said: ‘So the guard will come up to the supervisor and say to him that, ‘At the door are a thousand Angels whom the Lord (azwj) of Honour has Sent to congratulate the friend of Allah (azwj), so grant them permission’. The supervisor will proceed to the servants and say to them that, ‘A thousand Angels are at the door whom Allah (azwj) has Sent to congratulate the friend of Allah (azwj), so make their places known to him’. Rasool Allah (saww) said: ‘So they will make it known to him, and he will tell him to grant permission to the Angels. So they will come up to the friend of Allah (azwj), and he would be in a mansion of his, and there will be a thousand doors in it, and at each door of its doors would be an Angel allocated to it. So he will allow the Angels to enter to be with the friend of Allah (azwj) by opening one door for each of the Angels to enter by. The supervisor would then allow each of the Angels from the door of the doors of the Mansion’. He (saww) said: ‘So they would then convey the Message of the Compeller (azwj) Majestic and Mighty to him and that is the Statement of Allah (azwj): “[13:23] and the angels will enter in upon them from every gate”, from the doors of the Mansion, “[13:24] Peace be on you” - up to the end of the Verse’. Rasool Allah (saww) said: ‘And that is the Statement of the Majestic and Mighty: “[76:20] And when you see there, you shall see blessings and a great kingdom”, meaning by that the friend of Allah (azwj) and what he would be in from the Prestige and the Bounties, and the Magnificent and Great Kingdom. The Angels Sent by the Message from Allah (azwj) Mighty is His (azwj) Mention, would seek permission for their entrance to him. So they do not come up to him except by his permission. So that is the Magnificent and Great Kingdom’. Rasool Allah (saww) said: ‘And the rivers would flow from underneath his dwelling and that is the Statement of Allah (azwj): “[18:31] These it is for whom are gardens of perpetuity beneath which rivers flow”. And the fruits would come near to them and it is the Statement of Mighty and Majestic: “[76:14] And close down upon them (shall be) its shadows, and its fruits shall be made near (to them) (as in humility), being easy to reach”. The Believer would eat from the varieties of fruits by its category whilst leaning (relaxed upon the couch), and the varieties of the fruits will say to the friend of Allah (azwj), ‘Eat me before you eat this one’. Rasool Allah (saww) said: ‘And there is none from the Believer in the Paradise except that for him would be numerous Gardens, with a gazebo or without a gazebo, and rivers of pure drinks, and rivers of water, and rivers of milk, and rivers of honey. So if the friend of Allah (azwj) calls to partake a meal, he would be given whatsoever he desires for from the foods without even having named his desire’. Rasool Allah (saww) said: ‘Then he would seclude himself with his wife, and some of them would visit each other, and they would enjoy in their Gardens in extended shade, similar to what is between the break of dawn to the rise of the sun, and better than that. Each of the Believer would have seventy wives from the Houries, and four women from the humans, and the Believer would spend an hour with the Hourie, and an hour with the human (wife), and an hour alone with himself, being relaxed leaning on his couch, some looking at some others’. The Believer would be covered by a shining beam of light and he would be upon his couch, and he would say to his servants, ‘What is this beam of light? Perhaps it is the Brilliance of the Compeller (azwj) Who has Observed me’. His servants would say to him, ‘Holy is He (azwj)! Holy is He (azwj)! Majestic is His (azwj) Majesty! But, this is a Hourie from your women (wives) whom you have never entered into. She just looked out of her tent towards you in her desire for you, and wants to present herself to you, and would love to meet with you. So when she saw you relaxed upon your couch, she smiled in her desire for you. So that was the brilliant beam that you saw and the light which you were covered in, it was from the whiteness of her mouth (teeth), and her cleanliness, and her purity, and her tenderness’. He (saww) said: ‘So the friend of Allah (azwj) would say, ‘Grant her permission’. So a thousand servants and a thousand maids would descend to her to give her the good news of that. So she would then come to him from her tent, and she would have upon her seventy garments interwoven with the gold, and silver, laced with gems and the sapphire, and the emeralds cover with musk and ambergris, of different colours. The marrow of her leg would be seen from underneath the seventy garments of seventy cubits of length, and the (distance) between her shoulders would be of ten cubits. So when she approaches the friend of Allah (azwj), the servants would welcome her by a tray of gold and the silver in which would be gems, and the sapphire, and the emeralds, so they would display these to her. Then he would embrace her and she would embrace him. So neither would he be weary nor would she be weary’. He the (narrator) said, ‘Then Abu Ja’far (a.s.) said: ‘But rather the Gardens Mentioned in the Book are the Garden of Eden, and the Garden of Al-Firdows, and Garden of Naeem, and Garden of Al-Ma’wa’. He (a.s.) said: ‘And Allah (azwj) has Surrounded these Gardens with other Gardens, and that the Believer would be able to have for him from the Gardens whichever one what he loves, and wants and enjoy wherever he so likes to. And if the Believer intends a thing, or covets it, he would call for it by saying, ‘Glory be to You (azwj), our Allah (azwj)!’ So if he says it, the servants would keep coming to him with what he had coveted for even without him having asked them for it or commanded them for it, and that is the Statement of Allah (azwj) Mighty and Majestic: “[10:10] Their cry in it shall be: Glory to Thee, O Allah! and their greeting in it shall be: ‘سَلامٌ’ Peace”, meaning the servants’. He (a.s.) said: “[10:10] and the last of their cry shall be: Praise be to Allah, the Lord of the worlds.”, meaning by that after their having had their enjoyment from the copulation, and the food, and the drinks, they will be Praising Allah (azwj) Mighty and Majestic during their being free from that’. And as for His (azwj) Statement: “[37:41] For them is a Sustenance determined”, he (a.s.) said: ‘The servants know of it, so they bring it to the friend of Allah (azwj) before he even asks them for it’. And as for the Statement of the Mighty and Majestic: “[37:42] Fruits, and they shall be highly honoured”, he (a.s.) said: ‘They will not desire anything in the Paradise, except that they will be honoured with it’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 241)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14754,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:24:2",
        "text": [
          "14518- الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي بَصِيرٍ قَالَ قِيلَ لِأَبِي جَعْفَرٍ (عليه السلام) وَ أَنَا عِنْدَهُ إِنَّ سَالِمَ بْنَ أَبِي حَفْصَةَ وَ أَصْحَابَهُ يَرْوُونَ عَنْكَ أَنَّكَ تَكَلَّمُ عَلَى سَبْعِينَ وَجْهاً لَكَ مِنْهَا الْمَخْرَجُ فَقَالَ مَا يُرِيدُ سَالِمٌ مِنِّي أَ يُرِيدُ أَنْ أَجِي‏ءَ بِالْمَلَائِكَةِ وَ اللَّهِ مَا جَاءَتْ بِهَذَا النَّبِيُّونَ وَ لَقَدْ قَالَ إِبْرَاهِيمُ (عليه السلام) إِنِّي سَقِيمٌ وَ مَا كَانَ سَقِيماً وَ مَا كَذَبَ وَ لَقَدْ قَالَ إِبْرَاهِيمُ (عليه السلام) بَلْ فَعَلَهُ كَبِيرُهُمْ هذا وَ مَا فَعَلَهُ وَ مَا كَذَبَ وَ لَقَدْ قَالَ يُوسُفُ (عليه السلام) أَيَّتُهَا الْعِيرُ إِنَّكُمْ لَسارِقُونَ وَ اللَّهِ مَا كَانُوا سَارِقِينَ وَ مَا كَذَبَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473179\">H 14518</a> – Al-Husayn Bin Muhammad Al-Ashary, from Moalla Bin Muhammad, from Al-Wahsa’a, from Abaan Bin Usmaan, from Abu Baseer who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span>t was said to Abu</span> Ja’far<sup>asws</sup> and I was in his<sup>asws</sup> presence that, ‘Saalim Bin Abu Hafsa and his companions are narrating from you<sup>asws</sup> that you<sup>asws</sup> speak upon seventy perspectives, for you<sup>asws</sup> there is a way out from (each one) of these?’ He<sup>asws</sup> said: ‘What does Saalim want from me<sup>asws</sup>? Does he want that I<sup>asws</sup> should come with the Angels. By Allah<sup>azwj</sup>, (even) the Prophets<sup>as</sup> did not come with this. And Ibrahim<sup>as</sup> said: <span class=\"ibTxt\">“[37:89] Then said: Lo! I feel sick!”</span>, and he<sup>as</sup> was not sick and he<sup>as</sup> did not lie. And Ibrahim<sup>as</sup> has said: <span class=\"ibTxt\">“[21:63] He said: \"Nay, this was done by  this their biggest one! Ask them, if they can speak!”</span>, and he (their biggest idol) had not done it, and he<sup>as</sup> did not lie’. And Yusuf<sup>as</sup> has said: <span class=\"ibTxt\">“[12:70] O camel-riders! Lo! Ye are surely thieves!”</span> by Allah<sup>azwj</sup> they had not stolen, and he<sup>as</sup> had not lied’.",
            "out of 567"
          ],
          "en.sarwar": [
            "70. Al-Husayn Bin Muhammad Al-Ashary, from Mu‘alla Bin Muhammad, from Al-Wahsa’a, from Abaan Bin Usmaan, from Abu Baseer who said: ‘It was said to Abu Ja’far (a.s.) and I was in his (a.s.) presence that, ‘Saalim Bin Abu Hafsa and his companions are narrating from you (a.s.) that you (a.s.) speak upon seventy perspectives, for you (a.s.) there is a way out from (each one) of these?’ He (a.s.) said: ‘What does Saalim want from me (a.s.)? Does he want that I (a.s.) should come with the Angels. By Allah (azwj), (even) the Prophets (as) did not come with this. And Ibrahim (as) said: “[37:89] Then said: Lo! I feel sick!”, and he (as) was not sick and he (as) did not lie. And Ibrahim (as) has said: “[21:63] He said: \"Nay, this was done by this their biggest one! Ask them, if they can speak!”, and he (their biggest idol) had not done it, and he (as) did not lie’. And Yusuf (as) has said: “[12:70] O camel-riders! Lo! Ye are surely thieves!” by Allah (azwj) they had not stolen, and he (as) had not lied’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:24",
  "kind": "verse_list"
}