{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 25"
        },
        "path": "/books/al-kafi:8:1:25",
        "titles": {
          "ar": "حَدِيثُ أَبِي بَصِيرٍ مَعَ الْمَرْأَةِ",
          "en": "HADEETH OF ABU BASEER WITH THE WOMAN"
        }
      }
    ],
    "index": 2296,
    "local_index": 25,
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:25",
    "titles": {
      "ar": "حَدِيثُ أَبِي بَصِيرٍ مَعَ الْمَرْأَةِ",
      "en": "HADEETH OF ABU BASEER WITH THE WOMAN"
    },
    "verse_count": 21,
    "verse_start_index": 14754,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 244)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14755,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:25:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14519</span>- أَبَانٌ عَنْ أَبِي</span> بَصِيرٍ قَالَ كُنْتُ جَالِساً عِنْدَ أَبِي عَبْدِ اللَّهِ (عليه السلام) إِذْ دَخَلَتْ عَلَيْنَا أُمُّ خَالِدٍ الَّتِي كَانَ قَطَعَهَا يُوسُفُ بْنُ عُمَرَ تَسْتَأْذِنُ عَلَيْهِ فَقَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) أَ يَسُرُّكَ أَنْ تَسْمَعَ كَلَامَهَا قَالَ فَقُلْتُ نَعَمْ قَالَ فَأَذِنَ لَهَا قَالَ وَ أَجْلَسَنِي مَعَهُ عَلَى الطِّنْفِسَةِ قَالَ ثُمَّ دَخَلَتْ فَتَكَلَّمَتْ فَإِذَا امْرَأَةٌ بَلِيغَةٌ فَسَأَلَتْهُ عَنْهُمَا فَقَالَ لَهَا تَوَلَّيْهِمَا قَالَتْ فَأَقُولُ لِرَبِّي إِذَا لَقِيتُهُ إِنَّكَ أَمَرْتَنِي بِوَلَايَتِهِمَا قَالَ نَعَمْ ",
          "قَالَتْ فَإِنَّ هَذَا الَّذِي مَعَكَ عَلَى الطِّنْفِسَةِ يَأْمُرُنِي بِالْبَرَاءَةِ مِنْهُمَا وَ كَثِيرٌ النَّوَّاءُ يَأْمُرُنِي بِوَلَايَتِهِمَا فَأَيُّهُمَا خَيْرٌ وَ أَحَبُّ إِلَيْكَ قَالَ هَذَا وَ اللَّهِ أَحَبُّ إِلَيَّ مِنْ كَثِيرٍ النَّوَّاءِ وَ أَصْحَابِهِ إِنَّ هَذَا تَخَاصَمَ فَيَقُولُ وَ مَنْ لَمْ يَحْكُمْ بِما أَنْزَلَ اللَّهُ فَأُولئِكَ هُمُ الْكافِرُونَ وَ مَنْ لَمْ يَحْكُمْ بِما أَنْزَلَ اللَّهُ فَأُولئِكَ هُمُ الظَّالِمُونَ وَ مَنْ لَمْ يَحْكُمْ بِما أَنْزَلَ اللَّهُ فَأُولئِكَ هُمُ الْفاسِقُونَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473181\">H 14519</a> – Abaan, from Abu Baseer who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> was seated in the</span> presence of Abu Abdullah<sup>asws</sup> when mother of Khalid who had been cut off by Yusuf Bin Umar came up, seeking permission to see him<sup>asws</sup>. Abu Abdullah<sup>asws</sup> said: ‘Would you like to listen to her speech?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘Grant her permission’, and he<sup>asws</sup> made me sit alongside him<sup>asws</sup> upon the seat. Then she came in. She spoke eloquently. So she asked about the two of them. He<sup>asws</sup> said to her: ‘Befriend the two of them’ She said, ‘Shall I say to my Lord<sup>azwj</sup> when I meet Him<sup>azwj</sup> that you<sup>asws</sup> ordered me to befriend them?’ He<sup>asws</sup> said: ‘Yes’. ",
            "She said, ‘But the one who is seated with you<sup>asws</sup> upon the seat (Abu Baseer) has ordered me to keep away (Tabarra) from those two whilst Kaseer Al-Nawa has ordered me to befriend those two. So, which one is better and more beloved to you<sup>asws</sup>?’ He<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! This one here is more beloved to me<sup>asws</sup> than Kaseer Al-Nawa and his companions. This one here argues by saying: <span class=\"ibTxt\">“[5:44] and whoever did not judge by what Allah revealed, those are they that are the unbelievers”; “[5:45] and whoever did not judge by what Allah revealed, those are they that are the unjust”; “[5:47] And the followers of the Injeel should have judged by what Allah revealed in it; and whoever did not judge by what Allah revealed, those are they that are the transgressors”</span>."
          ],
          "en.sarwar": [
            "71. Abaan, from Abu Baseer who said: ‘I was seated in the presence of Abu Abdullah (a.s.) when mother of Khalid who had been cut off by Yusuf Bin Umar came up, seeking permission to see him (a.s.). Abu Abdullah (a.s.) said: ‘Would you like to listen to her speech?’ I said, ‘Yes’. He (a.s.) said: ‘Grant her permission’, and he (a.s.) made me sit alongside him (a.s.) upon the seat. Then she came in. She spoke eloquently. So she asked about the two of them. He (a.s.) said to her: ‘Befriend the two of them’ She said, ‘Shall I say to my Lord (azwj) when I meet Him (azwj) that you (a.s.) ordered me to befriend them?’ He (a.s.) said: ‘Yes’. She said, ‘But the one who is seated with you (a.s.) upon the seat (Abu Baseer) has ordered me to keep away (Tabarra) from those two whilst Kaseer Al-Nawa has ordered me to befriend those two. So, which one is better and more beloved to you (a.s.)?’ He (a.s.) said: ‘By Allah (azwj)! This one here is more beloved to me (a.s.) than Kaseer Al-Nawa and his companions. This one here argues by saying: “[5:44] and whoever did not judge by what Allah revealed, those are they that are the unbelievers”; “[5:45] and whoever did not judge by what Allah revealed, those are they that are the unjust”; “[5:47] And the followers of the Injeel should have judged by what Allah revealed in it; and whoever did not judge by what Allah revealed, those are they that are the transgressors”."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 245)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14756,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:25:2",
        "text": [
          "14520- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ عُمَرَ بْنِ أَبَانٍ عَنْ عَبْدِ الْحَمِيدِ الْوَابِشِيِّ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ قُلْتُ لَهُ إِنَّ لَنَا جَاراً يَنْتَهِكُ الْمَحَارِمَ كُلَّهَا حَتَّى إِنَّهُ لَيَتْرُكُ الصَّلَاةَ فَضْلًا عَنْ غَيْرِهَا فَقَالَ سُبْحَانَ اللَّهِ وَ أَعْظَمَ ذَلِكَ أَ لَا أُخْبِرُكُمْ بِمَنْ هُوَ شَرٌّ مِنْهُ قُلْتُ بَلَى قَالَ النَّاصِبُ لَنَا شَرٌّ مِنْهُ أَمَا إِنَّهُ لَيْسَ مِنْ عَبْدٍ يُذْكَرُ عِنْدَهُ أَهْلُ الْبَيْتِ فَيَرِقُّ لِذِكْرِنَا إِلَّا مَسَحَتِ الْمَلَائِكَةُ ظَهْرَهُ وَ غُفِرَ لَهُ ذُنُوبُهُ كُلُّهَا إِلَّا أَنْ يَجِي‏ءَ بِذَنْبٍ يُخْرِجُهُ مِنَ الْإِيمَانِ وَ إِنَّ الشَّفَاعَةَ لَمَقْبُولَةٌ وَ مَا تُقُبِّلَ فِي نَاصِبٍ ",
          "وَ إِنَّ الْمُؤْمِنَ لَيَشْفَعُ لِجَارِهِ وَ مَا لَهُ حَسَنَةٌ فَيَقُولُ يَا رَبِّ جَارِي كَانَ يَكُفُّ عَنِّي الْأَذَى فَيُشَفَّعُ فِيهِ فَيَقُولُ اللَّهُ تَبَارَكَ وَ تَعَالَى أَنَا رَبُّكَ وَ أَنَا أَحَقُّ مَنْ كَافَى عَنْكَ فَيُدْخِلُهُ الْجَنَّةَ وَ مَا لَهُ مِنْ حَسَنَةٍ وَ إِنَّ أَدْنَى الْمُؤْمِنِينَ شَفَاعَةً لَيَشْفَعُ لِثَلَاثِينَ إِنْسَاناً فَعِنْدَ ذَلِكَ يَقُولُ أَهْلُ النَّارِ فَما لَنا مِنْ شافِعِينَ وَ لا صَدِيقٍ حَمِيمٍ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473182\">H 14520</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Hassan Bin Ali Bin Fazzaal, from Ali Bin Uqba, form Umar Bin Abaan, from Abdul Hameed Al-Wabishy, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> said, when I said from him<sup>asws</sup>, ‘We have a neighbour who violates all the Prohibitions to the extent that he leaves the Prayer as well among other matters’. He<sup>asws</sup> said: ‘Glory be to Allah<sup>azwj</sup>! And that is a great matter. However, shall I<sup>asws</sup> inform you of the one who is more evil than him?’ I said, ‘Yes’. ",
            "He<sup>asws</sup> said: ‘The one who is hostile to us<sup>asws</sup> (Nasibi) is more evil than him. But rather, there is none from the servant in whose presence the People<sup>asws</sup> of the Household are mentioned and he sympathises with our<sup>asws</sup> remembrance, except that the Angels wipe his back, and all of his sins are Forgiven unless he commits a sin which takes him out of the ‘Eman’ (faith), and his intercession is Accepted whilst it is not acceptable for the Nasibi (hostile one).",
            "And that the Believer will intercede for his neighbour even if there is no good deed to his credit. He will say, ‘O Lord<sup>azwj</sup>! My neighbour used to restrain himself from hurting me’, so he will intercede for him’. So Allah<sup>azwj</sup> Blessed and High will say: “I<sup>azwj</sup> am your Lord<sup>azwj</sup> and more Right to Suffice for you. So He<sup>azwj</sup> will Enter him in the Paradise although there will be no good deeds to his credit. And that the lowest of the ‘Momineen’ (Believers) would intercede for thirty people. When that happens, the inhabitants of the Fire will say, <span class=\"ibTxt\">“[26:100] So we have no intercessors, [26:101] Nor a true friend”</span>."
          ],
          "en.sarwar": [
            "72. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Hassan Bin Ali Bin Fazzaal, from Ali Bin Uqba, form Umar Bin Abaan, from Abdul Hameed Al-Wabishy, who has narrated the following: Abu Ja’far (a.s.) said, when I said from him (a.s.), ‘We have a neighbour who violates all the Prohibitions to the extent that he leaves the Prayer as well among other matters’. He (a.s.) said: ‘Glory be to Allah (azwj)! And that is a great matter. However, shall I (a.s.) inform you of the one who is more evil than him?’ I said, ‘Yes’. He (a.s.) said: ‘The one who is hostile to us (a.s.) (Nasibi) is more evil than him. But rather, there is none from the servant in whose presence the People (a.s.) of the Household are mentioned and he sympathises with our (a.s.) remembrance, except that the Angels wipe his back, and all of his sins are Forgiven unless he commits a sin which takes him out of the ‘Eman’ (faith), and his intercession is Accepted whilst it is not acceptable for the Nasibi (hostile one). And that the Believer will intercede for his neighbour even if there is no good deed to his credit. He will say, ‘O Lord (azwj)! My neighbour used to restrain himself from hurting me’, so he will intercede for him’. So Allah (azwj) Blessed and High will say: “I (azwj) am your Lord (azwj) and more Right to Suffice for you. So He (azwj) will Enter him in the Paradise although there will be no good deeds to his credit. And that the lowest of the ‘Momineen’ (Believers) would intercede for thirty people. When that happens, the inhabitants of the Fire will say, “[26:100] So we have no intercessors, [26:101] Nor a true friend”."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 246)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14757,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:25:3",
        "text": [
          "14521- مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ أَبِي هَارُونَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ لِنَفَرٍ عِنْدَهُ وَ أَنَا حَاضِرٌ مَا لَكُمْ تَسْتَخِفُّونَ بِنَا قَالَ فَقَامَ إِلَيْهِ رَجُلٌ مِنْ خُرَاسَانَ فَقَالَ مَعَاذٌ لِوَجْهِ اللَّهِ أَنْ نَسْتَخِفَّ بِكَ أَوْ بِشَيْ‏ءٍ مِنْ أَمْرِكَ فَقَالَ بَلَى إِنَّكَ أَحَدُ مَنِ اسْتَخَفَّ بِي فَقَالَ مَعَاذٌ لِوَجْهِ اللَّهِ أَنْ أَسْتَخِفَّ بِكَ فَقَالَ لَهُ وَيْحَكَ أَ وَ لَمْ تَسْمَعْ فُلَاناً وَ نَحْنُ بِقُرْبِ الْجُحْفَةِ وَ هُوَ يَقُولُ لَكَ احْمِلْنِي قَدْرَ مِيلٍ فَقَدْ وَ اللَّهِ أَعْيَيْتُ وَ اللَّهِ مَا رَفَعْتَ بِهِ رَأْساً وَ لَقَدِ اسْتَخْفَفْتَ بِهِ وَ مَنِ اسْتَخَفَّ بِمُؤْمِنٍ فِينَا اسْتَخَفَّ وَ ضَيَّعَ حُرْمَةَ اللَّهِ عَزَّ وَ جَلَّ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473183\">H 14521</a> – Muhammad Bin Yahya, from Muhammad Bin Al-Husayn, from Muhammad Bin Ismail Bin Yazi’e, from Saleh Bin Uqba, from Abu Haroun, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said to a number (of people) who were in his<sup>asws</sup> presence and I was present: ‘What is the matter with you all that you take us<sup>asws</sup> lightly?’ A man from Khurasan stood up and said, ‘Allah<sup>azwj</sup> Forbid that we should take you<sup>asws</sup> or any of your<sup>asws</sup> commands lightly’. ",
            "He<sup>asws</sup> said: ‘Yes, you are one of those who take me<sup>asws</sup> lightly’. He said, ‘Allah<sup>azwj</sup> Forbid that I should take you<sup>asws</sup> lightly’. He<sup>asws</sup> said to him: ‘Woe be unto you, or did you not hear so and so, and we were near <span class=\"iTxt\">Al-Juhfa</span>, and he was saying to you, ‘Give me a ride for about a mile, for By Allah<sup>azwj</sup>, I have become (very) tired’? By Allah<sup>azwj</sup>, you did not even raise your head and took him lightly by it, and the one who takes one who Believes in us<sup>asws</sup> lightly, has taken lightly and wasted the Sanctity of Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "73. Muhammad Bin Yahya, from Muhammad Bin Al-Husayn, from Muhammad Bin Ismail Bin Yazi’e, from Saleh Bin Uqba, from Abu Haroun, who has said: Abu Abdullah (a.s.) having said to a number (of people) who were in his (a.s.) presence and I was present: ‘What is the matter with you all that you take us (a.s.) lightly?’ A man from Khurasan stood up and said, ‘Allah (azwj) Forbid that we should take you (a.s.) or any of your (a.s.) commands lightly’. He (a.s.) said: ‘Yes, you are one of those who take me (a.s.) lightly’. He said, ‘Allah (azwj) Forbid that I should take you (a.s.) lightly’. He (a.s.) said to him: ‘Woe be unto you, or did you not hear so and so, and we were near Al-Juhfa, and he was saying to you, ‘Give me a ride for about a mile, for By Allah (azwj), I have become (very) tired’? By Allah (azwj), you did not even raise your head and took him lightly by it, and the one who takes one who Believes in us (a.s.) lightly, has taken lightly and wasted the Sanctity of Allah (azwj) Mighty and Majestic’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 247)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14758,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:25:4",
        "text": [
          "14522- الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ (عليه السلام) إِنَّ اللَّهَ عَزَّ وَ جَلَّ مَنَّ عَلَيْنَا بِأَنْ عَرَّفَنَا تَوْحِيدَهُ ثُمَّ مَنَّ عَلَيْنَا بِأَنْ أَقْرَرْنَا بِمُحَمَّدٍ (صلى الله عليه وآله) بِالرِّسَالَةِ ثُمَّ اخْتَصَّنَا بِحُبِّكُمْ أَهْلَ الْبَيْتِ نَتَوَلَّاكُمْ وَ نَتَبَرَّأُ مِنْ عَدُوِّكُمْ وَ إِنَّمَا نُرِيدُ بِذَلِكَ خَلَاصَ أَنْفُسِنَا مِنَ النَّارِ قَالَ وَ رَقَقْتُ فَبَكَيْتُ ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) سَلْنِي فَوَ اللَّهِ لَا تَسْأَلُنِي عَنْ شَيْ‏ءٍ إِلَّا أَخْبَرْتُكَ بِهِ قَالَ فَقَالَ لَهُ عَبْدُ الْمَلِكِ بْنُ أَعْيَنَ مَا سَمِعْتُهُ قَالَهَا لِمَخْلُوقٍ قَبْلَكَ قَالَ قُلْتُ خَبِّرْنِي عَنِ الرَّجُلَيْنِ قَالَ ظَلَمَانَا حَقَّنَا فِي كِتَابِ اللَّهِ عَزَّ وَ جَلَّ وَ مَنَعَا فَاطِمَةَ (صلوات الله عليها) مِيرَاثَهَا مِنْ أَبِيهَا وَ جَرَى ظُلْمُهُمَا إِلَى الْيَوْمِ قَالَ وَ أَشَارَ إِلَى خَلْفِهِ وَ نَبَذَا كِتَابَ اللَّهِ وَرَاءَ ظُهُورِهِمَا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473184\">H 14522</a> – Al-Husayn Bin Muhammad Al-Ashary, from Moala Bin Muhammad, from Al-Washa, from Abaan Bin Usmaan, from Abdul Rahmaan Bin Abu Abdullah who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> said to Abu Abdullah</span><sup>asws</sup> that, ‘Allah<sup>azwj</sup> Bestowed (Favour) upon us that we recognised His<sup>azwj</sup> Oneness, then Bestowed (Favour) upon us that we accepted the Prophet-hood of Muhammad<sup>saww</sup>, then Specialised us with your<sup>asws</sup> love, the People<sup>asws</sup> of the Household that we befriended you, and keep away from your<sup>asws</sup> enemies, and we intend by that to save ourselves from the Fire’. He (the narrator) said, ‘And I sympathised with him and cried’. ",
            "So Abu Abdullah<sup>asws</sup> said: ‘Ask me<sup>asws</sup>, for by Allah<sup>azwj</sup>, you will not ask me<sup>asws</sup> about a thing except that I<sup>asws</sup> will inform you of it’. He (the narrator) said, ‘Abdul Malik Bin Ayn, ‘I have not heard him<sup>asws</sup> say that to any creature before you’. I said, ‘Inform me about the two men (Abu Bakr and Umar)’. He<sup>asws</sup> said: ‘They were unjust to us<sup>asws</sup> of our<sup>asws</sup> rights in the Book of Allah<sup>azwj</sup>, and with us<sup>asws</sup> Fatima<sup>asws</sup>, the inheritance from her<sup>asws</sup> father<sup>saww</sup>, and the injustices of these two still flow up to this day’. He (the narrator) said, ‘And he gestured to his<sup>asws</sup> back’, (and said): ‘They threw the Book of Allah<sup>azwj</sup> behind their two backs’."
          ],
          "en.sarwar": [
            "74. Al-Husayn Bin Muhammad Al-Ashary, from Moala Bin Muhammad, from Al-Washa, from Abaan Bin Usmaan, from Abdul Rahmaan Bin Abu Abdullah who said: ‘I said to Abu Abdullah (a.s.) that, ‘Allah (azwj) Bestowed (Favour) upon us that we recognised His (azwj) Oneness, then Bestowed (Favour) upon us that we accepted the Prophet-hood of Muhammad (saww), then Specialised us with your (a.s.) love, the People (a.s.) of the Household that we befriended you, and keep away from your (a.s.) enemies, and we intend by that to save ourselves from the Fire’. He (the narrator) said, ‘And I sympathised with him and cried’. So Abu Abdullah (a.s.) said: ‘Ask me (a.s.), for by Allah (azwj), you will not ask me (a.s.) about a thing except that I (a.s.) will inform you of it’. He (the narrator) said, ‘Abdul Malik Bin Ayn, ‘I have not heard him (a.s.) say that to any creature before you’. I said, ‘Inform me about the two men (Abu Bakr and Umar)’. He (a.s.) said: ‘They were unjust to us (a.s.) of our (a.s.) rights in the Book of Allah (azwj), and with us (a.s.) Fatima (a.s.), the inheritance from her (a.s.) father (saww), and the injustices of these two still flow up to this day’. He (the narrator) said, ‘And he gestured to his (a.s.) back’, (and said): ‘They threw the Book of Allah (azwj) behind their two backs’."
          ]
        }
      },
      {
        "index": 14759,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:25:5",
        "text": [
          "14523- وَ بِهَذَا الْإِسْنَادِ عَنْ أَبَانٍ عَنْ عُقْبَةَ بْنِ بَشِيرٍ الْأَسَدِيِّ عَنِ الْكُمَيْتِ بْنِ زَيْدٍ الْأَسَدِيِّ قَالَ دَخَلْتُ عَلَى أَبِي جَعْفَرٍ (عليه السلام) فَقَالَ وَ اللَّهِ يَا كُمَيْتُ لَوْ كَانَ عِنْدَنَا مَالٌ لَأَعْطَيْنَاكَ مِنْهُ وَ لَكِنْ لَكَ مَا قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) لِحَسَّانَ بْنِ ثَابِتٍ لَنْ يَزَالَ مَعَكَ رُوحُ الْقُدُسِ مَا ذَبَبْتَ عَنَّا ",
          "قَالَ قُلْتُ خَبِّرْنِي عَنِ الرَّجُلَيْنِ قَالَ فَأَخَذَ الْوِسَادَةَ فَكَسَرَهَا فِي صَدْرِهِ ثُمَّ قَالَ وَ اللَّهِ يَا كُمَيْتُ مَا أُهَرِيقَ مِحْجَمَةٌ مِنْ دَمٍ وَ لَا أُخِذَ مَالٌ مِنْ غَيْرِ حِلِّهِ وَ لَا قُلِبَ حَجَرٌ عَنْ حَجَرٍ إِلَّا ذَاكَ فِي أَعْنَاقِهِمَا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473185\">H 14523</a> – And by this chain, from Abaan, from Uqba Bin Basheer Al-Asady, from Al-Kumeyt Bin Zayd Al-asady who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> came up to Abu Ja’far</span><sup>asws</sup>, so he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>, O Kumeyt, if we<sup>asws</sup> had in our<sup>asws</sup> possession some wealth, we<sup>as</sup><sup>ws</sup> would have given you from it, but for you is what the Rasool<sup>saww</sup> Allah<sup>azwj</sup> said to Hassan Bin Sabit: ‘The Holy Spirit will not cease to be with you so long as you defend us<sup>saww</sup>’. ",
            "I said, ‘Inform me about the two men (Abu Bakr and Umar)’. He (the narrator) said: ‘He<sup>asws</sup> took the pillow and folded it unto his<sup>asws</sup> chest’ and said: ‘By Allah<sup>azwj</sup>, O Kumeyt, there is no blood spilled unlawfully, nor any wealth taken without right, and not stone turned from another stone except that it would be upon their necks’."
          ],
          "en.sarwar": [
            "75. And by this chain, from Abaan, from Uqba Bin Basheer Al-Asady, from Al-Kumeyt Bin Zayd Al-asady who said: ‘I came up to Abu Ja’far (a.s.), so he (a.s.) said: ‘By Allah (azwj), O Kumeyt, if we (a.s.) had in our (a.s.) possession some wealth, we (a.s.) would have given you from it, but for you is what the Rasool (saww) Allah (azwj) said to Hassan Bin Sabit: ‘The Holy Spirit will not cease to be with you so long as you defend us (saww)’. I said, ‘Inform me about the two men (Abu Bakr and Umar)’. He (the narrator) said: ‘He (a.s.) took the pillow and folded it unto his (a.s.) chest’ and said: ‘By Allah (azwj), O Kumeyt, there is no blood spilled unlawfully, nor any wealth taken without right, and not stone turned from another stone except that it would be upon their necks’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 248)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14760,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:25:6",
        "text": [
          "14524- وَ بِهَذَا الْإِسْنَادِ عَنْ أَبَانٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِي الْعَبَّاسِ الْمَكِّيِّ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ (عليه السلام) يَقُولُ إِنَّ عُمَرَ لَقِيَ عَلِيّاً (صلوات الله عليه) فَقَالَ لَهُ أَنْتَ الَّذِي تَقْرَأُ هَذِهِ الْآيَةَ بِأَيِّكُمُ الْمَفْتُونُ وَ تُعَرِّضُ بِي وَ بِصَاحِبِي قَالَ فَقَالَ لَهُ أَ فَلَا أُخْبِرُكَ بِآيَةٍ نَزَلَتْ فِي بَنِي أُمَيَّةَ فَهَلْ عَسَيْتُمْ إِنْ تَوَلَّيْتُمْ أَنْ تُفْسِدُوا فِي الْأَرْضِ وَ تُقَطِّعُوا أَرْحامَكُمْ فَقَالَ كَذَبْتَ بَنُو أُمَيَّةَ أَوْصَلُ لِلرَّحِمِ مِنْكَ وَ لَكِنَّكَ أَبَيْتَ إِلَّا عَدَاوَةً لِبَنِي تَيْمٍ وَ بَنِي عَدِيٍّ وَ بَنِي أُمَيَّةَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473186\">H 14524</a> – And by this chain, from Abaan, from Abdul Rahmaan Bin Abu Abdullah, from Abu Al-Abbas Al-Makky who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> heard Abu Ja’far</span><sup>asws</sup> saying that: ‘Umar met Ali<sup>asws</sup>, so he said to him<sup>asws</sup>, ‘You<sup>asws</sup> are the one who is reciting this Verse: <span class=\"ibTxt\">“[68:6] Which of you is afflicted with madness”</span> and applying it to me and to my companion’. ",
            "He<sup>asws</sup> said to him: ‘Shall I not inform you of a Verse which has Descended about the Clan of Umayya: <span class=\"ibTxt\">“[47:22] But if you held command, you were sure to make mischief in the land and cut off the ties of kinship”</span>?’ So he said, ‘You<sup>asws</sup> are lying. The Clan of Umayya are better at maintaining relations than you<sup>asws</sup> are, but you<sup>asws</sup> refuse to do anything except be inimical to the Clan of Taym (Abu Bakr’s tribe), and the Clan of Ady (Umar’s tribe), and the Clan of Umayya (Muawiya’s tribe)’."
          ],
          "en.sarwar": [
            "76. And by this chain, from Abaan, from Abdul Rahmaan Bin Abu Abdullah, from Abu Al-Abbas Al-Makky who said: ‘I heard Abu Ja’far (a.s.) saying that: ‘Umar met Ali (a.s.), so he said to him (a.s.), ‘You (a.s.) are the one who is reciting this Verse: “[68:6] Which of you is afflicted with madness” and applying it to me and to my companion’. He (a.s.) said to him: ‘Shall I not inform you of a Verse which has Descended about the Clan of Umayya: “[47:22] But if you held command, you were sure to make mischief in the land and cut off the ties of kinship”?’ So he said, ‘You (a.s.) are lying. The Clan of Umayya are better at maintaining relations than you (a.s.) are, but you (a.s.) refuse to do anything except be inimical to the Clan of Taym (Abu Bakr’s tribe), and the Clan of Ady (Umar’s tribe), and the Clan of Umayya (Muawiya’s tribe)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 250)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14761,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:25:7",
        "text": [
          "14525- وَ بِهَذَا الْإِسْنَادِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنِ الْحَارِثِ النَّصْرِيِّ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ (عليه السلام) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ الَّذِينَ بَدَّلُوا نِعْمَتَ اللَّهِ كُفْراً قَالَ مَا تَقُولُونَ فِي ذَلِكَ قُلْتُ نَقُولُ هُمُ الْأَفْجَرَانِ مِنْ قُرَيْشٍ بَنُو أُمَيَّةَ وَ بَنُو الْمُغِيرَةِ قَالَ ثُمَّ قَالَ هِيَ وَ اللَّهِ قُرَيْشٌ قَاطِبَةً إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى خَاطَبَ نَبِيَّهُ (صلى الله عليه وآله) فَقَالَ إِنِّي فَضَّلْتُ قُرَيْشاً عَلَى الْعَرَبِ وَ أَتْمَمْتُ عَلَيْهِمْ نِعْمَتِي وَ بَعَثْتُ إِلَيْهِمْ رَسُولِي فَبَدَّلُوا نِعْمَتِي كُفْراً وَ أَحَلُّوا قَوْمَهُمْ دَارَ الْبَوَارِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473187\">H 14525</a> – And by this chain, from Abaan Bin Usmaan, from Al-Haris Al-Nasry who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> asked Abu Ja’far</span><sup style=\"font-weight: normal\">asws</sup> about the Statement of Allah<sup style=\"font-weight: normal\">azwj</sup>: <span class=\"ibTxt\">“[14:28] Have you not seen those who have changed Allah's favour for ungratefulness”</span>, (Imam<sup style=\"font-weight: normal\">asws</sup>) asked: ‘What are you all saying about that?’ I said, ‘We are saying that these are the tyrants from the Qureish, the Clan of Umayya and the Clan of Al-Mugheira’. He<sup style=\"font-weight: normal\">asws</sup> said: ‘By Allah<sup style=\"font-weight: normal\">azwj</sup>, this is about the Qureish in its entirety. Allah<sup style=\"font-weight: normal\">azwj</sup> Blessed and High Addressed His<sup style=\"font-weight: normal\">azwj</sup> Prophet<sup style=\"font-weight: normal\">saww</sup>, so He<sup style=\"font-weight: normal\">azwj</sup> Said: “I<sup style=\"font-weight: normal\">azwj</sup> Gave preference to the Qureish over the Arabs, and Completed upon them My<sup style=\"font-weight: normal\">azwj</sup> Favours, and Sent to the My<sup style=\"font-weight: normal\">azwj</sup> Rasool<sup style=\"font-weight: normal\">saww</sup>, so they changed My<sup style=\"font-weight: normal\">azwj</sup> Favour by denial <span class=\"ibTxt\">“[14:28] and made their people to alight into the abode of perdition”.</span>"
          ],
          "en.sarwar": [
            "77. And by this chain, from Abaan Bin Usmaan, from Al-Haris Al-Nasry who said: ‘I asked Abu Ja’far (a.s.) about the Statement of Allah (azwj): “[14:28] Have you not seen those who have changed Allah’s favour for ungratefulness”, (Imam (a.s.)) asked: ‘What are you all saying about that?’ I said, ‘We are saying that these are the tyrants from the Qureish, the Clan of Umayya and the Clan of Al-Mugheira’. He (a.s.) said: ‘By Allah (azwj), this is about the Qureish in its entirety. Allah (azwj) Blessed and High Addressed His (azwj) Prophet (saww), so He (azwj) Said: “I (azwj) Gave preference to the Qureish over the Arabs, and Completed upon them My (azwj) Favours, and Sent to the My (azwj) Rasool (saww), so they changed My (azwj) Favour by denial “[14:28] and made their people to alight into the abode of perdition”."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 252)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14762,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:25:8",
        "text": [
          "14526- وَ بِهَذَا الْإِسْنَادِ عَنْ أَبَانٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ (عليه السلام) أَنَّهُمَا قَالَا إِنَّ النَّاسَ لَمَّا كَذَّبُوا بِرَسُولِ اللَّهِ (صلى الله عليه وآله) هَمَّ اللَّهُ تَبَارَكَ وَ تَعَالَى بِهَلَاكِ أَهْلِ الْأَرْضِ إِلَّا عَلِيّاً فَمَا سِوَاهُ بِقَوْلِهِ فَتَوَلَّ عَنْهُمْ فَما أَنْتَ بِمَلُومٍ ثُمَّ بَدَا لَهُ فَرَحِمَ الْمُؤْمِنِينَ ثُمَّ قَالَ لِنَبِيِّهِ (صلى الله عليه وآله) وَ ذَكِّرْ فَإِنَّ الذِّكْرى تَنْفَعُ الْمُؤْمِنِينَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473188\">H 14526</a> – And by this chain, from Abaan, from Abu Baseer, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> and Abu Abdullah<sup>asws</sup>, that the two of them<sup>asws</sup> said: ‘When the people belied the Rasool<sup>saww</sup> Allah<sup>azwj</sup>, Allah<sup>azwj</sup> Blessed and High Decided to Destroy the people of the earth except for Ali<sup>asws</sup> and no one else by His<sup>azwj</sup> Statement: <span class=\"ibTxt\">“[51:54] Then turn your back upon them for you are not to blame”</span>. Then Changed it for them so He<sup>azwj</sup> was Merciful to the Believers. Then He<sup>azwj</sup> Said to His<sup>azwj</sup> Prophet<sup>saww</sup>: <span class=\"ibTxt\">“[51:55] And continue to remind, for surely the reminder profits the believers”</span>."
          ],
          "en.sarwar": [
            "78. And by this chain, from Abaan, from Abu Baseer, who has said: Abu Ja’far (a.s.) and Abu Abdullah (a.s.), that the two of them (a.s.) said: ‘When the people belied the Rasool (saww) Allah (azwj), Allah (azwj) Blessed and High Decided to Destroy the people of the earth except for Ali (a.s.) and no one else by His (azwj) Statement: “[51:54] Then turn your back upon them for you are not to blame”. Then Changed it for them so He (azwj) was Merciful to the Believers. Then He (azwj) Said to His (azwj) Prophet (saww): “[51:55] And continue to remind, for surely the reminder profits the believers”."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 252)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14763,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:25:9",
        "text": [
          "14527- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ أَبِي عُبَيْدَةَ الْحَذَّاءِ عَنْ ثُوَيْرِ بْنِ أَبِي فَاخِتَةَ قَالَ سَمِعْتُ عَلِيَّ بْنَ الْحُسَيْنِ (عليه السلام) يُحَدِّثُ فِي مَسْجِدِ رَسُولِ اللَّهِ (صلى الله عليه وآله) قَالَ حَدَّثَنِي أَبِي أَنَّهُ سَمِعَ أَبَاهُ عَلِيَّ بْنَ أَبِي طَالِبٍ (عليه السلام) يُحَدِّثُ النَّاسَ قَالَ إِذَا كَانَ يَوْمُ الْقِيَامَةِ بَعَثَ اللَّهُ تَبَارَكَ وَ تَعَالَى النَّاسَ مِنْ حُفَرِهِمْ عُزْلًا بُهْماً جُرْداً مُرْداً فِي صَعِيدٍ وَاحِدٍ يَسُوقُهُمُ النُّورُ وَ تَجْمَعُهُمُ الظُّلْمَةُ حَتَّى يَقِفُوا عَلَى عَقَبَةِ الْمَحْشَرِ فَيَرْكَبُ بَعْضُهُمْ بَعْضاً وَ يَزْدَحِمُونَ دُونَهَا فَيُمْنَعُونَ مِنَ الْمُضِيِّ فَتَشْتَدُّ أَنْفَاسُهُمْ وَ يَكْثُرُ عَرَقُهُمْ وَ تَضِيقُ بِهِمْ أُمُورُهُمْ وَ يَشْتَدُّ ضَجِيجُهُمْ وَ تَرْتَفِعُ أَصْوَاتُهُمْ قَالَ وَ هُوَ أَوَّلُ هَوْلٍ مِنْ أَهْوَالِ يَوْمِ الْقِيَامَةِ",
          "قَالَ فَيُشْرِفُ الْجَبَّارُ تَبَارَكَ وَ تَعَالَى عَلَيْهِمْ مِنْ فَوْقِ عَرْشِهِ فِي ظِلَالٍ مِنَ الْمَلَائِكَةِ فَيَأْمُرُ مَلَكاً مِنَ الْمَلَائِكَةِ فَيُنَادِي فِيهِمْ يَا مَعْشَرَ الْخَلَائِقِ أَنْصِتُوا وَ اسْتَمِعُوا مُنَادِيَ الْجَبَّارِ قَالَ فَيَسْمَعُ آخِرُهُمْ كَمَا يَسْمَعُ أَوَّلُهُمْ قَالَ فَتَنْكَسِرُ أَصْوَاتُهُمْ عِنْدَ ذَلِكَ وَ تَخْشَعُ أَبْصَارُهُمْ وَ تَضْطَرِبُ فَرَائِصُهُمْ وَ تَفْزَعُ قُلُوبُهُمْ وَ يَرْفَعُونَ رُءُوسَهُمْ إِلَى نَاحِيَةِ الصَّوْتِ مُهْطِعِينَ إِلَى الدَّاعِ قَالَ فَعِنْدَ ذَلِكَ يَقُولُ الْكَافِرُ هذا يَوْمٌ عَسِرٌ ",
          "قَالَ فَيُشْرِفُ الْجَبَّارُ عَزَّ وَ جَلَّ الْحَكَمُ الْعَدْلُ عَلَيْهِمْ فَيَقُولُ أَنَا اللَّهُ لَا إِلَهَ إِلَّا أَنَا الْحَكَمُ الْعَدْلُ الَّذِي لَا يَجُورُ الْيَوْمَ أَحْكُمُ بَيْنَكُمْ بِعَدْلِي وَ قِسْطِي لَا يُظْلَمُ الْيَوْمَ عِنْدِي أَحَدٌ الْيَوْمَ آخُذُ لِلضَّعِيفِ مِنَ الْقَوِيِّ بِحَقِّهِ وَ لِصَاحِبِ الْمَظْلِمَةِ بِالْمَظْلِمَةِ بِالْقِصَاصِ مِنَ الْحَسَنَاتِ وَ السَّيِّئَاتِ وَ أُثِيبُ عَلَى الْهِبَاتِ وَ لَا يَجُوزُ هَذِهِ الْعَقَبَةَ الْيَوْمَ عِنْدِي ظَالِمٌ وَ لِأَحَدٍ عِنْدَهُ مَظْلِمَةٌ إِلَّا مَظْلِمَةً يَهَبُهَا صَاحِبُهَا وَ أُثِيبُهُ عَلَيْهَا وَ آخُذُ لَهُ بِهَا عِنْدَ الْحِسَابِ فَتَلَازَمُوا أَيُّهَا الْخَلَائِقُ وَ اطْلُبُوا مَظَالِمَكُمْ عِنْدَ مَنْ ظَلَمَكُمْ بِهَا فِي الدُّنْيَا وَ أَنَا شَاهِدٌ لَكُمْ عَلَيْهِمْ وَ كَفَى بِي شَهِيداً ",
          "قَالَ فَيَتَعَارَفُونَ وَ يَتَلَازَمُونَ فَلَا يَبْقَى أَحَدٌ لَهُ عِنْدَ أَحَدٍ مَظْلِمَةٌ أَوْ حَقٌّ إِلَّا لَزِمَهُ بِهَا قَالَ فَيَمْكُثُونَ مَا شَاءَ اللَّهُ فَيَشْتَدُّ حَالُهُمْ وَ يَكْثُرُ عَرَقُهُمْ وَ يَشْتَدُّ غَمُّهُمْ وَ تَرْتَفِعُ أَصْوَاتُهُمْ بِضَجِيجٍ شَدِيدٍ فَيَتَمَنَّوْنَ الْمَخْلَصَ مِنْهُ بِتَرْكِ مَظَالِمِهِمْ لِأَهْلِهَا ",
          "قَالَ وَ يَطَّلِعُ اللَّهُ عَزَّ وَ جَلَّ عَلَى جَهْدِهِمْ فَيُنَادِي مُنَادٍ مِنْ عِنْدِ اللَّهِ تَبَارَكَ وَ تَعَالَى يُسْمِعُ آخِرَهُمْ كَمَا يُسْمِعُ أَوَّلَهُمْ يَا مَعْشَرَ الْخَلَائِقِ أَنْصِتُوا لِدَاعِي اللَّهِ تَبَارَكَ وَ تَعَالَى وَ اسْمَعُوا إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى يَقُولُ [لَكُمْ] أَنَا الْوَهَّابُ إِنْ أَحْبَبْتُمْ أَنْ تَوَاهَبُوا فَتَوَاهَبُوا وَ إِنْ لَمْ تَوَاهَبُوا أَخَذْتُ لَكُمْ بِمَظَالِمِكُمْ قَالَ فَيَفْرَحُونَ بِذَلِكَ لِشِدَّةِ جَهْدِهِمْ وَ ضِيقِ مَسْلَكِهِمْ وَ تَزَاحُمِهِمْ قَالَ فَيَهَبُ بَعْضُهُمْ مَظَالِمَهُمْ رَجَاءَ أَنْ يَتَخَلَّصُوا مِمَّا هُمْ فِيهِ وَ يَبْقَى بَعْضُهُمْ فَيَقُولُ يَا رَبِّ مَظَالِمُنَا أَعْظَمُ مِنْ أَنْ نَهَبَهَا ",
          "قَالَ فَيُنَادِي مُنَادٍ مِنْ تِلْقَاءِ الْعَرْشِ أَيْنَ رِضْوَانُ خَازِنُ الْجِنَانِ جِنَانِ الْفِرْدَوْسِ قَالَ فَيَأْمُرُهُ اللَّهُ عَزَّ وَ جَلَّ أَنْ يُطْلِعَ مِنَ الْفِرْدَوْسِ قَصْراً مِنْ فِضَّةٍ بِمَا فِيهِ مِنَ الْأَبْنِيَةِ وَ الْخَدَمِ قَالَ فَيُطْلِعُهُ عَلَيْهِمْ فِي حِفَافَةِ الْقَصْرِ الْوَصَائِفُ وَ الْخَدَمُ قَالَ فَيُنَادِي مُنَادٍ مِنْ عِنْدِ اللَّهِ تَبَارَكَ وَ تَعَالَى يَا مَعْشَرَ الْخَلَائِقِ ارْفَعُوا رُءُوسَكُمْ فَانْظُرُوا إِلَى هَذَا الْقَصْرِ قَالَ فَيَرْفَعُونَ رُءُوسَهُمْ فَكُلُّهُمْ يَتَمَنَّاهُ ",
          "قَالَ فَيُنَادِي مُنَادٍ مِنْ عِنْدِ اللَّهِ تَعَالَى يَا مَعْشَرَ الْخَلَائِقِ هَذَا لِكُلِّ مَنْ عَفَا عَنْ مُؤْمِنٍ قَالَ فَيَعْفُونَ كُلُّهُمْ إِلَّا الْقَلِيلَ قَالَ فَيَقُولُ اللَّهُ عَزَّ وَ جَلَّ لَا يَجُوزُ إِلَى جَنَّتِيَ الْيَوْمَ ظَالِمٌ وَ لَا يَجُوزُ إِلَى نَارِيَ الْيَوْمَ ظَالِمٌ وَ لِأَحَدٍ مِنَ الْمُسْلِمِينَ عِنْدَهُ مَظْلِمَةٌ حَتَّى يَأْخُذَهَا مِنْهُ عِنْدَ الْحِسَابِ أَيُّهَا الْخَلَائِقُ اسْتَعِدُّوا لِلْحِسَابِ ",
          "قَالَ ثُمَّ يُخَلَّى سَبِيلُهُمْ فَيَنْطَلِقُونَ إِلَى الْعَقَبَةِ يَكْرُدُ بَعْضُهُمْ بَعْضاً حَتَّى يَنْتَهُوا إِلَى الْعَرْصَةِ وَ الْجَبَّارُ تَبَارَكَ وَ تَعَالَى عَلَى الْعَرْشِ قَدْ نُشِرَتِ الدَّوَاوِينُ وَ نُصِبَتِ الْمَوَازِينُ وَ أُحْضِرَ النَّبِيُّونَ وَ الشُّهَدَاءُ وَ هُمُ الْأَئِمَّةُ يَشْهَدُ كُلُّ إِمَامٍ عَلَى أَهْلِ عَالَمِهِ بِأَنَّهُ قَدْ قَامَ فِيهِمْ بِأَمْرِ اللَّهِ عَزَّ وَ جَلَّ وَ دَعَاهُمْ إِلَى سَبِيلِ اللَّهِ ",
          "قَالَ فَقَالَ لَهُ رَجُلٌ مِنْ قُرَيْشٍ يَا ابْنَ رَسُولِ اللَّهِ إِذَا كَانَ لِلرَّجُلِ الْمُؤْمِنِ عِنْدَ الرَّجُلِ الْكَافِرِ مَظْلِمَةٌ أَيَّ شَيْ‏ءٍ يَأْخُذُ مِنَ الْكَافِرِ وَ هُوَ مِنْ أَهْلِ النَّارِ قَالَ فَقَالَ لَهُ عَلِيُّ بْنُ الْحُسَيْنِ (عليه السلام) يُطْرَحُ عَنِ الْمُسْلِمِ مِنْ سَيِّئَاتِهِ بِقَدْرِ مَا لَهُ عَلَى الْكَافِرِ فَيُعَذَّبُ الْكَافِرُ بِهَا مَعَ عَذَابِهِ بِكُفْرِهِ عَذَاباً بِقَدْرِ مَا لِلْمُسْلِمِ قِبَلَهُ مِنْ مَظْلِمَةٍ ",
          "قَالَ فَقَالَ لَهُ الْقُرَشِيُّ فَإِذَا كَانَتِ الْمَظْلِمَةُ لِلْمُسْلِمِ عِنْدَ مُسْلِمٍ كَيْفَ تُؤْخَذُ مَظْلِمَتُهُ مِنَ الْمُسْلِمِ قَالَ يُؤْخَذُ لِلْمَظْلُومِ مِنَ الظَّالِمِ مِنْ حَسَنَاتِهِ بِقَدْرِ حَقِّ الْمَظْلُومِ فَتُزَادُ عَلَى حَسَنَاتِ الْمَظْلُومِ قَالَ فَقَالَ لَهُ الْقُرَشِيُّ فَإِنْ لَمْ يَكُنْ لِلظَّالِمِ حَسَنَاتٌ قَالَ إِنْ لَمْ يَكُنْ لِلظَّالِمِ حَسَنَاتٌ فَإِنَّ لِلْمَظْلُومِ سَيِّئَاتٍ يُؤْخَذُ مِنْ سَيِّئَاتِ الْمَظْلُومِ فَتُزَادُ عَلَى سَيِّئَاتِ الظَّالِمِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473189\">H 14527</a> – A number of our companions, from Sahl Bin Ziyad, from Al-Hassan Bin Mahboub, from Ali Bin Ra’ib, from Abu Ubeyda Al-Haza’a, from Suweyr Bin Abu Fakhta who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Ali</span><sup>asws</sup> Bin Al-Husayn<sup>asws</sup> narrating in the Masjid of the Rasool<sup>saww</sup> Allah<sup>azwj</sup> saying: ‘Narrated to me<sup>asws</sup> by my<sup>asws</sup> father<sup>asws</sup>, and he<sup>asws</sup> heard it from his<sup>asws</sup> father<sup>asws</sup> Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> narrating to the people saying: ‘When it will be the Day of Judgement, Allah<sup>azwj</sup> will Resurrect the people from their graves in their isolation, without beards, in one plane, being driven by the light, and Gather them in the darkness until they are paused upon the hurdle on the Place of Resurrection. So, some of them will climb upon the others, becoming over crowded. They will be prevented from passing. Their breathing will be heavy and they will sweat profusely, and their affairs would be constricted, their noises would intensify, and their voices would be raised. He<sup>asws</sup> said: ‘This will be the first sensation from the sensations of the Day of Judgement’.",
            "He<sup>asws</sup> said: ‘The Compeller<sup>azwj</sup> Blessed and High will Attend to them from above His<sup>azwj</sup> Throne in the shadow of the Angels, so He<sup>azwj</sup> Command an Angel from the Angels who would call out among them: ‘O group of creatures! Listen, and listen intently to the Caller of the Compeller<sup>azwj</sup>’. He<sup>asws</sup> said: ‘So the last of them would hear it just as the first of them’. He<sup>asws</sup> said: ‘Their voices would break up due to that, and they will anxiously look around and their body parts would become restless, and their hearts would be in a panic, and they will be raising their heads towards the direction of the voice hastening to the Caller’. He<sup>asws</sup> said: ‘So when that happens, the Infidel would say, ‘This is a difficult day’.",
            "He<sup>asws</sup> said: ‘So the Compeller<sup>azwj</sup> Mighty and Majestic would Attend to be the Judge over them, so He<sup>azwj</sup> will Say to them: “I<sup>azwj</sup> am Allah<sup>azwj</sup>. There is no god except for Me<sup>azwj</sup>. I<sup>azwj</sup> am the Equitable Judge Whom will not Let any injustice be done today. I<sup>azwj</sup> Shall Judge between you all with Justice and Equity. No one will be done injustice in My<sup>azwj</sup> Presence today. I<sup>azwj</sup> shall Take the rights for weak ones from the strong ones and for those who have suffered injustices will be retaliation from the good deeds and the sins as compensation and be Rewarded for the gifts. And no one will be Permitted today in My<sup>azwj</sup> Presence, as an unjust one or one to whom injustice has been done except if he waives his right against the other one, and I<sup>azwj</sup> shall Take from him (the unjust one) during the Accounting correlated. ",
            "O you creatures! And seek what is due to you from the one who was unjust to you for it in the world, and I<sup>azwj</sup> am a Witness for you against them, and I<sup>azwj</sup> am sufficient as a Witness’.",
            "He<sup>asws</sup> said: ‘So they will recognise each other and seize the opportunity. So not one would remain for whom there would be anything from the unjust one any right except that he would claim for it’. He<sup>asws</sup> said: ‘So they would do that for as long as Allah<sup>azwj</sup> so Desires. Their condition would become difficult, and they will sweat profusely, and their grief would intensify, and they would be raising their voices by intense noise. So they would wish to be finished from it by letting go of their rights and not bother to claim for it from the unjust ones’.",
            "He<sup>asws</sup> said: ‘And Allah<sup>azwj</sup> would Know of their struggles, so a Caller would Call out from the Presence of Allah<sup>azwj</sup> Blessed and High which the last of them would hear as well as the first of them: ‘O group of creatures, listen intently to the Caller of Allah<sup>azwj</sup> Blessed and High, and listen to what Allah<sup>azwj</sup> Blessed and High is Saying to you all: ‘I<sup>azwj</sup> Am the Bestower and would Love it if you would gift (forego) each other and if you do not then I<sup>azwj</sup> will Take it for you from the one who was unjust to you’. He<sup>asws</sup> said: ‘So they would become happy with that due to their difficult struggles, and constriction, and their behaviour and contention’. He<sup>asws</sup> said: ‘So some of them would forego their rights in the hope that it would finish them from the situation that they would be in, and there would remain some of them who would say, ‘O Lord<sup>azwj</sup>, our rights are greater than us being able to forego them’.",
            "He<sup>asws</sup> said: ‘So a Caller would Call out from beside the Throne: ‘Where is Rizwaan, the keeper of the Gardens of <span class=\"iTxt\">Al-Firdows</span>?’ He<sup>asws</sup> said: ‘So Allah<sup>azwj</sup> Mighty and Majestic will Command him to display from <span class=\"iTxt\">Al-Firdows</span> a castle of silver with whatever is inside it from the construction and the servants’. He<sup>asws</sup> said: ‘The butlers and the servants would be seen on the grounds of the castle’. He<sup>asws</sup> said: ‘So a Caller would Call out from the Presence of Allah<sup>azwj</sup> Blessed and High: “O group of creatures! Raise your heads and look at this castle’. He<sup>asws</sup> said: ‘So they will be raising their heads, and each one of them would wish for it’.",
            "He<sup>asws</sup> said: ‘So a Caller will Call out from the Presence of Allah<sup>azwj</sup>: “O group of creatures! This is for every one forgives a Believer’. He<sup>asws</sup> said: ‘So all of them would be forgiving except for a few’. He<sup>asws</sup> said: ‘So Allah<sup>azwj</sup> Mighty and Majestic will Say: “There is no Permission to My<sup>azwj</sup> Paradise today for the unjust one, and there is no Permission today to the Fire today for the one who was oppressed, or anyone from the Muslims who has in his possession somebody’s rights until it will be Taken from him during the Accounting. O you creatures! Be prepared for the Accounting’.",
            "He<sup>asws</sup> said: ‘Then their way would be cleared for them, so they will be moving to the next stage preparing one another until they end up at the Plains, and the Compeller<sup>azwj</sup> Blessed and High would be upon the Throne. The registers (of deeds) would have been published, the scales set, and the Prophets<sup>as</sup>, and the witnesses<sup>asws</sup>, and these would be the Imams<sup>asws</sup> would be present. Each Imam<sup>asws</sup> testifying over the people of his<sup>asws</sup> era, having stood among them by the Command of Allah<sup>azwj</sup> Mighty and Majestic, and called them to the Way of Allah<sup>azwj</sup>’.",
            "He<sup>asws</sup> said: ‘So a man from Qureish said to him<sup>asws</sup>, ‘O son<sup>asws</sup> of the Rasool<sup>saww</sup> Allah<sup>azwj</sup>, if there is a Believing man who has a claim against an infidel man, which thing would be taken from the infidel, and he is from the inhabitants of the Fire?’ He<sup>asws</sup> said: ‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said to him: ‘The sins of the Muslim would be taken from him in accordance with what is due to him from the infidel, so the infidel would be Punished by it along with his Punishment for his infidelity in accordance with what was for the Muslim before that right’.",
            "He<sup>asws</sup> said: ‘So the Qureishi said to him<sup>asws</sup>, ‘So if there was a right for a Muslim against a Muslim, how would it be taken from a Muslim?’ He<sup>asws</sup> said: ‘The good deeds would be taken for the oppressed against the oppressor in accordance with the right of the oppressed and it would increase the good deeds of the oppressed one’. He<sup>asws</sup> said: ‘The Qureishi said to him<sup>asws</sup>: ‘If the oppressor does not have any good deeds to his credit?’ He<sup>asws</sup> said: ‘If the oppressor does not have any good deeds to his credit, the sins of the oppressed would be taken from him so it would increase the sins of the oppressor’. "
          ],
          "en.sarwar": [
            "79. A number of our companions, from Sahl Bin Ziyad, from Al-Hassan Bin Mahboub, from Ali Bin Ra’ib, from Abu Ubeyda Al-Haza’a, from Suweyr Bin Abu Fakhta who said: I heard Ali (a.s.) Bin Al-Husayn (a.s.) narrating in the Masjid of the Rasool (saww) Allah (azwj) saying: ‘Narrated to me (a.s.) by my (a.s.) father (a.s.), and he (a.s.) heard it from his (a.s.) father (a.s.) Ali (a.s.) Bin Abu Talib (a.s.) narrating to the people saying: ‘When it will be the Day of Judgement, Allah (azwj) will Resurrect the people from their graves in their isolation, without beards, in one plane, being driven by the light, and Gather them in the darkness until they are paused upon the hurdle on the Place of Resurrection. So, some of them will climb upon the others, becoming over crowded. They will be prevented from passing. Their breathing will be heavy and they will sweat profusely, and their affairs would be constricted, their noises would intensify, and their voices would be raised. He (a.s.) said: ‘This will be the first sensation from the sensations of the Day of Judgement’. He (a.s.) said: ‘The Compeller (azwj) Blessed and High will Attend to them from above His (azwj) Throne in the shadow of the Angels, so He (azwj) Command an Angel from the Angels who would call out among them: ‘O group of creatures! Listen, and listen intently to the Caller of the Compeller (azwj)’. He (a.s.) said: ‘So the last of them would hear it just as the first of them’. He (a.s.) said: ‘Their voices would break up due to that, and they will anxiously look around and their body parts would become restless, and their hearts would be in a panic, and they will be raising their heads towards the direction of the voice hastening to the Caller’. He (a.s.) said: ‘So when that happens, the Infidel would say, ‘This is a difficult day’. He (a.s.) said: ‘So the Compeller (azwj) Mighty and Majestic would Attend to be the Judge over them, so He (azwj) will Say to them: “I (azwj) am Allah (azwj). There is no god except for Me (azwj). I (azwj) am the Equitable Judge Whom will not Let any injustice be done today. I (azwj) Shall Judge between you all with Justice and Equity. No one will be done injustice in My (azwj) Presence today. I (azwj) shall Take the rights for weak ones from the strong ones and for those who have suffered injustices will be retaliation from the good deeds and the sins as compensation and be Rewarded for the gifts. And no one will be Permitted today in My (azwj) Presence, as an unjust one or one to whom injustice has been done except if he waives his right against the other one, and I (azwj) shall Take from him (the unjust one) during the Accounting correlated. O you creatures! And seek what is due to you from the one who was unjust to you for it in the world, and I (azwj) am a Witness for you against them, and I (azwj) am sufficient as a Witness’. He (a.s.) said: ‘So they will recognise each other and seize the opportunity. So not one would remain for whom there would be anything from the unjust one any right except that he would claim for it’. He (a.s.) said: ‘So they would do that for as long as Allah (azwj) so Desires. Their condition would become difficult, and they will sweat profusely, and their grief would intensify, and they would be raising their voices by intense noise. So they would wish to be finished from it by letting go of their rights and not bother to claim for it from the unjust ones’. He (a.s.) said: ‘And Allah (azwj) would Know of their struggles, so a Caller would Call out from the Presence of Allah (azwj) Blessed and High which the last of them would hear as well as the first of them: ‘O group of creatures, listen intently to the Caller of Allah (azwj) Blessed and High, and listen to what Allah (azwj) Blessed and High is Saying to you all: ‘I (azwj) Am the Bestower and would Love it if you would gift (forego) each other and if you do not then I (azwj) will Take it for you from the one who was unjust to you’. He (a.s.) said: ‘So they would become happy with that due to their difficult struggles, and constriction, and their behaviour and contention’. He (a.s.) said: ‘So some of them would forego their rights in the hope that it would finish them from the situation that they would be in, and there would remain some of them who would say, ‘O Lord (azwj), our rights are greater than us being able to forego them’. He (a.s.) said: ‘So a Caller would Call out from beside the Throne: ‘Where is Rizwaan, the keeper of the Gardens of Al-Firdows?’ He (a.s.) said: ‘So Allah (azwj) Mighty and Majestic will Command him to display from Al-Firdows a castle of silver with whatever is inside it from the construction and the servants’. He (a.s.) said: ‘The butlers and the servants would be seen on the grounds of the castle’. He (a.s.) said: ‘So a Caller would Call out from the Presence of Allah (azwj) Blessed and High: “O group of creatures! Raise your heads and look at this castle’. He (a.s.) said: ‘So they will be raising their heads, and each one of them would wish for it’. He (a.s.) said: ‘So a Caller will Call out from the Presence of Allah (azwj): “O group of creatures! This is for every one forgives a Believer’. He (a.s.) said: ‘So all of them would be forgiving except for a few’. He (a.s.) said: ‘So Allah (azwj) Mighty and Majestic will Say: “There is no Permission to My (azwj) Paradise today for the unjust one, and there is no Permission today to the Fire today for the one who was oppressed, or anyone from the Muslims who has in his possession somebody’s rights until it will be Taken from him during the Accounting. O you creatures! Be prepared for the Accounting’. He (a.s.) said: ‘Then their way would be cleared for them, so they will be moving to the next stage preparing one another until they end up at the Plains, and the Compeller (azwj) Blessed and High would be upon the Throne. The registers (of deeds) would have been published, the scales set, and the Prophets (as), and the witnesses (a.s.), and these would be the Imams (a.s.) would be present. Each Imam (a.s.) testifying over the people of his (a.s.) era, having stood among them by the Command of Allah (azwj) Mighty and Majestic, and called them to the Way of Allah (azwj)’. He (a.s.) said: ‘So a man from Qureish said to him (a.s.), ‘O son (a.s.) of the Rasool (saww) Allah (azwj), if there is a Believing man who has a claim against an infidel man, which thing would be taken from the infidel, and he is from the inhabitants of the Fire?’ He (a.s.) said: ‘Ali (a.s.) Bin Al-Husayn (a.s.) said to him: ‘The sins of the Muslim would be taken from him in accordance with what is due to him from the infidel, so the infidel would be Punished by it along with his Punishment for his infidelity in accordance with what was for the Muslim before that right’. He (a.s.) said: ‘So the Qureishi said to him (a.s.), ‘So if there was a right for a Muslim against a Muslim, how would it be taken from a Muslim?’ He (a.s.) said: ‘The good deeds would be taken for the oppressed against the oppressor in accordance with the right of the oppressed and it would increase the good deeds of the oppressed one’. He (a.s.) said: ‘The Qureishi said to him (a.s.): ‘If the oppressor does not have any good deeds to his credit?’ He (a.s.) said: ‘If the oppressor does not have any good deeds to his credit, the sins of the oppressed would be taken from him so it would increase the sins of the oppressor’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 257)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 385)"
        ],
        "index": 14764,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:25:10",
        "text": [
          "14528- أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ فَضَّالٍ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ أَبِي أُمَيَّةَ يُوسُفَ بْنِ ثَابِتِ بْنِ أَبِي سَعِيدَةَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) أَنَّهُمْ قَالُوا حِينَ دَخَلُوا عَلَيْهِ إِنَّمَا أَحْبَبْنَاكُمْ لِقَرَابَتِكُمْ مِنْ رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ لِمَا أَوْجَبَ اللَّهُ عَزَّ وَ جَلَّ مِنْ حَقِّكُمْ مَا أَحْبَبْنَاكُمْ لِلدُّنْيَا نُصِيبُهَا مِنْكُمْ إِلَّا لِوَجْهِ اللَّهِ وَ الدَّارِ الْآخِرَةِ وَ لِيَصْلُحَ لِامْرِئٍ مِنَّا دِينُهُ ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) صَدَقْتُمْ صَدَقْتُمْ ثُمَّ قَالَ مَنْ أَحَبَّنَا كَانَ مَعَنَا أَوْ جَاءَ مَعَنَا يَوْمَ الْقِيَامَةِ هَكَذَا ثُمَّ جَمَعَ بَيْنَ السَّبَّابَتَيْنِ ثُمَّ قَالَ وَ اللَّهِ لَوْ أَنَّ رَجُلًا صَامَ النَّهَارَ وَ قَامَ اللَّيْلَ ثُمَّ لَقِيَ اللَّهَ عَزَّ وَ جَلَّ بِغَيْرِ وَلَايَتِنَا أَهْلَ الْبَيْتِ لَلَقِيَهُ وَ هُوَ عَنْهُ غَيْرُ رَاضٍ أَوْ سَاخِطٌ عَلَيْهِ ثُمَّ قَالَ وَ ذَلِكَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ ما مَنَعَهُمْ أَنْ تُقْبَلَ مِنْهُمْ نَفَقاتُهُمْ إِلَّا أَنَّهُمْ كَفَرُوا بِاللَّهِ وَ بِرَسُولِهِ وَ لا يَأْتُونَ الصَّلاةَ إِلَّا وَ هُمْ كُسالى وَ لا يُنْفِقُونَ إِلَّا وَ هُمْ كارِهُونَ فَلا تُعْجِبْكَ أَمْوالُهُمْ وَ لا أَوْلادُهُمْ إِنَّما يُرِيدُ اللَّهُ لِيُعَذِّبَهُمْ بِها فِي الْحَياةِ الدُّنْيا وَ تَزْهَقَ أَنْفُسُهُمْ وَ هُمْ كافِرُونَ ",
          "ثُمَّ قَالَ وَ كَذَلِكَ الْإِيمَانُ لَا يَضُرُّ مَعَهُ الْعَمَلُ وَ كَذَلِكَ الْكُفْرُ لَا يَنْفَعُ مَعَهُ الْعَمَلُ ثُمَّ قَالَ إِنْ تَكُونُوا وَحْدَانِيِّينَ فَقَدْ كَانَ رَسُولُ اللَّهِ (صلى الله عليه وآله) وَحْدَانِيّاً يَدْعُو النَّاسَ فَلَا يَسْتَجِيبُونَ لَهُ وَ كَانَ أَوَّلَ مَنِ اسْتَجَابَ لَهُ عَلِيُّ بْنُ أَبِي طَالِبٍ (عليه السلام) وَ قَدْ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) أَنْتَ مِنِّي بِمَنْزِلَةِ هَارُونَ مِنْ مُوسَى إِلَّا أَنَّهُ لَا نَبِيَّ بَعْدِي."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473190\">H 14528</a> – Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbaar, from Al-Hassan Bin Ali Bin Fazzaal, from Tha’albat Bin Maymoun, from Aby Amiyya Yusuf Bin Sabit Bin Abu Saeeda, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said when they came up to him and said, ‘But rather, we love you<sup>asws</sup> due to your<sup>asws</sup> nearness to the Rasool<sup>saww</sup> Allah<sup>azwj</sup>, and for what Allah<sup>azwj</sup> Mighty and Majestic has Obligated from your<sup>asws</sup> rights. We do not love you<sup>asws</sup> for the sake of the world for getting a share of it from you<sup>asws</sup>. But (we love you<sup>asws</sup>) only for the Sake of Allah<sup>azwj</sup> and the House of the Hereafter and that the man from among us would be able to correct his Religion’.",
            "So Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> said: ‘You have spoken the truth, you have spoken the truth’. Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘The one who loves us<sup style=\"font-weight: normal\">asws</sup> is as if he is with us<sup style=\"font-weight: normal\">asws</sup>, or will come with us<sup style=\"font-weight: normal\">asws</sup> on the Day of Judgement like this’ – then he<sup style=\"font-weight: normal\">asws</sup> joined the two forefingers, then said – ‘By Allah<sup style=\"font-weight: normal\">azwj</sup>! If the man were to Fast during the day, and stand up (for Prayer) during the night, then meets Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic without our<sup style=\"font-weight: normal\">asws</sup> Wilayah, (the People<sup style=\"font-weight: normal\">asws</sup> of the Household) he then would be facing Him<sup style=\"font-weight: normal\">azwj</sup> (in such that) Allah<sup style=\"font-weight: normal\">azwj</sup> would either be Unhappy with him or Angry against him’. Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘And that is the Statement of Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[9:54] The only reasons why their contributions are not accepted are: that they reject Allah and His Rasool; that they come to prayer without earnestness; and that they offer contributions unwillingly [9:55] Let not then their property and their children excite your admiration; Allah only wishes to chastise them with these in this world's life and (that) their souls may depart while they are unbelievers”</span>",
            "Then he<sup>asws</sup> said: ‘And such is that belief that the (bad) deed neither had affected it adversely nor is that disbelief that the (good) deed had provided any profit to it’. Then he<sup>asws</sup> said; ‘You should become (believers in) Oneness (of Allah<sup>azwj</sup>) for the Rasool<sup>saww</sup> Allah<sup>azwj</sup> had called the people to the Oneness (of Allah<sup>azwj</sup>) but they did not answer him<sup>saww</sup>, and the first one who had came forward to him<sup>saww</sup> was Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, and the Rasool<sup>saww</sup> Allah<sup>azwj</sup> said: ‘You<sup>asws</sup> are from me<sup>saww</sup> of the status which Haroun<sup>as</sup> had from Musa<sup>as</sup> except that there is no Prophet<sup>as</sup> after me<sup>saww</sup>’."
          ],
          "en.sarwar": [
            "80. Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbaar, from Al-Hassan Bin Ali Bin Fazzaal, from Tha’albat Bin Maymoun, from Aby Amiyya Yusuf Bin Sabit Bin Abu Saeeda, who has narrated the following: Abu Abdullah (a.s.) having said when they came up to him and said, ‘But rather, we love you (a.s.) due to your (a.s.) nearness to the Rasool (saww) Allah (azwj), and for what Allah (azwj) Mighty and Majestic has Obligated from your (a.s.) rights. We do not love you (a.s.) for the sake of the world for getting a share of it from you (a.s.). But (we love you (a.s.)) only for the Sake of Allah (azwj) and the House of the Hereafter and that the man from among us would be able to correct his Religion’. So Abu Abdullah (a.s.) said: ‘You have spoken the truth, you have spoken the truth’. Then he (a.s.) said: ‘The one who loves us (a.s.) is as if he is with us (a.s.), or will come with us (a.s.) on the Day of Judgement like this’ – then he (a.s.) joined the two forefingers, then said – ‘By Allah (azwj)! If the man were to Fast during the day, and stand up (for Prayer) during the night, then meets Allah (azwj) Mighty and Majestic without our (a.s.) Wilayah, (the People (a.s.) of the Household) he then would be facing Him (azwj) (in such that) Allah (azwj) would either be Unhappy with him or Angry against him’. Then he (a.s.) said: ‘And that is the Statement of Allah (azwj) Mighty and Majestic: “[9:54] The only reasons why their contributions are not accepted are: that they reject Allah and His Rasool; that they come to prayer without earnestness; and that they offer contributions unwillingly [9:55] Let not then their property and their children excite your admiration; Allah only wishes to chastise them with these in this world’s life and (that) their souls may depart while they are unbelievers” Then he (a.s.) said: ‘And such is that belief that the (bad) deed neither had affected it adversely nor is that disbelief that the (good) deed had provided any profit to it’. Then he (a.s.) said; ‘You should become (believers in) Oneness (of Allah (azwj)) for the Rasool (saww) Allah (azwj) had called the people to the Oneness (of Allah (azwj)) but they did not answer him (saww), and the first one who had came forward to him (saww) was Ali (a.s.) Bin Abu Talib (a.s.), and the Rasool (saww) Allah (azwj) said: ‘You (a.s.) are from me (saww) of the status which Haroun (as) had from Musa (as) except that there is no Prophet (as) after me (saww)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح ظاهرا</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 260)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14765,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:25:11",
        "text": [
          "14529- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ يُونُسَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) لِعَبَّادِ بْنِ كَثِيرٍ الْبَصْرِيِّ الصُّوفِيِّ وَيْحَكَ يَا عَبَّادُ غَرَّكَ أَنْ عَفَّ بَطْنُكَ وَ فَرْجُكَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ فِي كِتَابِهِ يا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَ قُولُوا قَوْلًا سَدِيداً يُصْلِحْ لَكُمْ أَعْمالَكُمْ اعْلَمْ أَنَّهُ لَا يَتَقَبَّلُ اللَّهُ مِنْكَ شَيْئاً حَتَّى تَقُولَ قَوْلًا عَدْلًا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473191\">H 14529</a> – Ali Bin Ibrahim, from Muhammad Bin Isa Bin Ubeyd, from Yunus who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said to Abbaad Bin Kaseer Al-Basry Al-Soufy: ‘Woe be unto you, O Abbaad! You have been deceived yourself by (merely) abstaining from your stomach and your genitals. Allah<sup>azwj</sup> Mighty and Majestic has Said: <span class=\"ibTxt\">“[33:70] O you who believe! be careful of (your duty to) Allah and speak the right word [33:71] He will put your deeds into a right state for you”</span><span class=\"bTxt\">. </span>You must realise that Allah<sup>azwj</sup> will not Accept from you anything until you speak the truth and just word (do not only rely on the meditation but accept the truth, the Wilayah of Amimah<sup>asws</sup>)’."
          ],
          "en.sarwar": [
            "81. Ali Bin Ibrahim, from Muhammad Bin Isa Bin Ubeyd, from Yunus who said: Abu Abdullah (a.s.) said to Abbaad Bin Kaseer Al-Basry Al-Soufy: ‘Woe be unto you, O Abbaad! You have been deceived yourself by (merely) abstaining from your stomach and your genitals. Allah (azwj) Mighty and Majestic has Said: “[33:70] O you who believe! be careful of (your duty to) Allah and speak the right word [33:71] He will put your deeds into a right state for you”. You must realise that Allah (azwj) will not Accept from you anything until you speak the truth and just word (do not only rely on the meditation but accept the truth, the Wilayah of Amimah (a.s.))’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 260)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14766,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:25:12",
        "text": [
          "14530- يُونُسُ عَنْ عَلِيِّ بْنِ شَجَرَةَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ لِلَّهِ عَزَّ وَ جَلَّ فِي بِلَادِهِ خَمْسُ حُرَمٍ حُرْمَةُ رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ حُرْمَةُ آلِ رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ حُرْمَةُ كِتَابِ اللَّهِ عَزَّ وَ جَلَّ وَ حُرْمَةُ كَعْبَةِ اللَّهِ وَ حُرْمَةُ الْمُؤْمِنِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473192\">H 14530</a> – Yunus, from Ali Bin Shajarat, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic has five sanctimonious (matters) in His<sup>azwj</sup> earth – sanctity of the Rasool<sup>saww</sup> Allah<sup>azwj</sup>, and the sanctity of the Progeny<sup>asws</sup> of the Rasool<sup>saww</sup> Allah<sup>azwj</sup>, and the sanctity of the Book of Allah<sup>azwj</sup> Mighty and Majestic, and the sanctity of the Kaaba of Allah<sup>azwj</sup>, and sanctity of the Believer’."
          ],
          "en.sarwar": [
            "82. Yunus, from Ali Bin Shajarat, who has said: Abu Abdullah (a.s.) said: ‘Allah (azwj) Mighty and Majestic has five sanctimonious (matters) in His (azwj) earth – sanctity of the Rasool (saww) Allah (azwj), and the sanctity of the Progeny (a.s.) of the Rasool (saww) Allah (azwj), and the sanctity of the Book of Allah (azwj) Mighty and Majestic, and the sanctity of the Kaaba of Allah (azwj), and sanctity of the Believer’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 261)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14767,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:25:13",
        "text": [
          "14531- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ مُحَمَّدِ بْنِ الْقَاسِمِ عَنْ عَلِيِّ بْنِ الْمُغِيرَةِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ إِذَا بَلَغَ الْمُؤْمِنُ أَرْبَعِينَ سَنَةً آمَنَهُ اللَّهُ مِنَ الْأَدْوَاءِ الثَّلَاثَةِ الْبَرَصِ وَ الْجُذَامِ وَ الْجُنُونِ فَإِذَا بَلَغَ الْخَمْسِينَ خَفَّفَ اللَّهُ عَزَّ وَ جَلَّ حِسَابَهُ فَإِذَا بَلَغَ سِتِّينَ سَنَةً رَزَقَهُ اللَّهُ الْإِنَابَةَ فَإِذَا بَلَغَ السَّبْعِينَ أَحَبَّهُ أَهْلُ السَّمَاءِ فَإِذَا بَلَغَ الثَّمَانِينَ أَمَرَ اللَّهُ عَزَّ وَ جَلَّ بِإِثْبَاتِ حَسَنَاتِهِ وَ إِلْقَاءِ سَيِّئَاتِهِ فَإِذَا بَلَغَ التِّسْعِينَ غَفَرَ اللَّهُ تَبَارَكَ وَ تَعَالَى لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَ مَا تَأَخَّرَ وَ كُتِبَ أَسِيرَ اللَّهِ فِي أَرْضِهِ وَ فِي رِوَايَةٍ أُخْرَى فَإِذَا بَلَغَ الْمِائَةَ فَذَلِكَ أَرْذَلُ الْعُمُرِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473193\">H 14531</a> – A number of our companions, from Ahmad Bin Muhammad, from Ibn Abu Najran, from Muhammad Bin Al-Qasim, from Ali Bin Al-Mugheira, who has said the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said, ‘I heard him<sup>asws</sup> saying: ‘When the ‘Momin’ (believer) reaches forty years, Allah<sup>azwj</sup> Secures him from three illnesses – the leprosy, and the albinism and the madness. So when he reaches fifty, Allah<sup>azwj</sup> Makes his Accounting to be light. When he reaches sixty years, Allah<sup>azwj</sup> Grants him the repentance. So when he reaches seventy, the inhabitants of the sky love him. ",
            "So when he reaches eighty, Allah<sup>azwj</sup> Commands to Write down his good deeds and Deletes his bad deeds. So when he reaches ninety, Allah<sup>azwj</sup> Forgives him what has preceded from his Religion and what has been delayed and Writes him down as a prisoner of Allah<sup>azwj</sup> in His<sup>azwj</sup> earth’. And in another report – ‘So when he reaches a hundred, so that is the very (feeble) end of life’."
          ],
          "en.sarwar": [
            "83. A number of our companions, from Ahmad Bin Muhammad, from Ibn Abu Najran, from Muhammad Bin Al-Qasim, from Ali Bin Al-Mugheira, who has said the following: Abu Abdullah (a.s.) said, ‘I heard him (a.s.) saying: ‘When the ‘Momin’ (believer) reaches forty years, Allah (azwj) Secures him from three illnesses – the leprosy, and the albinism and the madness. So when he reaches fifty, Allah (azwj) Makes his Accounting to be light. When he reaches sixty years, Allah (azwj) Grants him the repentance. So when he reaches seventy, the inhabitants of the sky love him. So when he reaches eighty, Allah (azwj) Commands to Write down his good deeds and Deletes his bad deeds. So when he reaches ninety, Allah (azwj) Forgives him what has preceded from his Religion and what has been delayed and Writes him down as a prisoner of Allah (azwj) in His (azwj) earth’. And in another report – ‘So when he reaches a hundred, so that is the very (feeble) end of life’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 261)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14768,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:25:14",
        "text": [
          "14532- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ دَاوُدَ عَنْ سَيْفٍ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ الْعَبْدَ لَفِي فُسْحَةٍ مِنْ أَمْرِهِ مَا بَيْنَهُ وَ بَيْنَ أَرْبَعِينَ سَنَةً فَإِذَا بَلَغَ أَرْبَعِينَ سَنَةً أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى مَلَكَيْهِ قَدْ عَمَّرْتُ عَبْدِي هَذَا عُمُراً فَغَلِّظَا وَ شَدِّدَا وَ تَحَفَّظَا وَ اكْتُبَا عَلَيْهِ قَلِيلَ عَمَلِهِ وَ كَثِيرَهُ وَ صَغِيرَهُ وَ كَبِيرَهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473194\">H 14532</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from Dawood, from Sayf, from Abu Baseer who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said that: ‘The servant has the opportunity (to seek forgiveness) until he reaches at the age of forty years. So when he reaches at the age of forty years, Allah<sup>azwj</sup> Reveals to His<sup>azwj</sup> two Angels: “I<sup>azwj</sup> have Let My<sup>azwj</sup> servant to get to this age, so stringent and be more strict with him and write down all from little, big, less, more from his deeds."
          ],
          "en.sarwar": [
            "84. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from Dawood, from Sayf, from Abu Baseer who said: Abu Abdullah (a.s.) said that: ‘The servant has the opportunity (to seek forgiveness) until he reaches at the age of forty years. So when he reaches at the age of forty years, Allah (azwj) Reveals to His (azwj) two Angels: “I (azwj) have Let My (azwj) servant to get to this age, so stringent and be more strict with him and write down all from little, big, less, more from his deeds."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 261)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14769,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:25:15",
        "text": [
          "14533- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) عَنِ الْوَبَاءِ يَكُونُ فِي نَاحِيَةِ الْمِصْرِ فَيَتَحَوَّلُ الرَّجُلُ إِلَى نَاحِيَةٍ أُخْرَى أَوْ يَكُونُ فِي مِصْرٍ فَيَخْرُجُ مِنْهُ إِلَى غَيْرِهِ فَقَالَ لَا بَأْسَ إِنَّمَا نَهَى رَسُولُ اللَّهِ (صلى الله عليه وآله) عَنْ ذَلِكَ لِمَكَانِ رَبِيئَةٍ كَانَتْ بِحِيَالِ الْعَدُوِّ فَوَقَعَ فِيهِمُ الْوَبَاءُ فَهَرَبُوا مِنْهُ فَقَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) الْفَارُّ مِنْهُ كَالْفَارِّ مِنَ الزَّحْفِ كَرَاهِيَةَ أَنْ يَخْلُوَ مَرَاكِزُهُمْ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473195\">H 14533</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammaad Bin Usmaan, from Al-Halby, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-h\">H</span>e said, ‘I asked Abu</span> Abdullah<sup>asws</sup> about the epidemic which was spreading in the area around Egypt. Shall the man turn to another area or if he is in Egypt so he should exit from it to somewhere else’. He<sup>asws</sup> said: ‘There is no problem with it. However, the Rasool<sup>saww</sup> Allah<sup>azwj</sup> Prohibited the residence of the a hill who were facing the enemies, when there was a plague among them, (they started) to flee from it. So the Rasool<sup>saww</sup> Allah<sup>azwj</sup> said: ‘To flee from it is like fleeing from the march (of the enemy army). He<sup>saww</sup> abhorred that they should empty their positions’."
          ],
          "en.sarwar": [
            "85. Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammaad Bin Usmaan, from Al-Halby, who has narrated the following: He said, ‘I asked Abu Abdullah (a.s.) about the epidemic which was spreading in the area around Egypt. Shall the man turn to another area or if he is in Egypt so he should exit from it to somewhere else’. He (a.s.) said: ‘There is no problem with it. However, the Rasool (saww) Allah (azwj) Prohibited the residence of the a hill who were facing the enemies, when there was a plague among them, (they started) to flee from it. So the Rasool (saww) Allah (azwj) said: ‘To flee from it is like fleeing from the march (of the enemy army). He (saww) abhorred that they should empty their positions’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 262)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14770,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:25:16",
        "text": [
          "14534- عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي مَالِكٍ الْحَضْرَمِيِّ عَنْ حَمْزَةَ بْنِ حُمْرَانَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ ثَلَاثَةٌ لَمْ يَنْجُ مِنْهَا نَبِيٌّ فَمَنْ دُونَهُ التَّفَكُّرُ فِي الْوَسْوَسَةِ فِي الْخَلْقِ وَ الطِّيَرَةُ وَ الْحَسَدُ إِلَّا أَنَّ الْمُؤْمِنَ لَا يَسْتَعْمِلُ حَسَدَهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473196\">H 14534</a> – Ali, from his father, from Ibn Abu Umeyr, from Abu Maalik Al-Hazramy, from hamza Bin Humran, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘There are three things from which except for a Nabi<sup>as</sup> no one else is safe from – The ‘الْوَسْوَسَةِ’ untrue perception about the creation, and the ‘الطِّيَرَةُ’ pessimism/depression and the ‘الْحَسَدُ’ jealousy , except that believer does not make use of his jealousy’."
          ],
          "en.sarwar": [
            "86. Ali, from his father, from Ibn Abu Umeyr, from Abu Maalik Al-Hazramy, from hamza Bin Humran, who has said: Abu Abdullah (a.s.) having said: ‘There are three things from which except for a Nabi (as) no one else is safe from – The ‘الْوَسْوَسَةِ’ untrue perception about the creation, and the ‘الطِّيَرَةُ’ pessimism/depression and the ‘الْحَسَدُ’ jealousy , except that believer does not make use of his jealousy’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 264)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14771,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:25:17",
        "text": [
          "14535- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ الْجَوْهَرِيِّ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي إِبْرَاهِيمَ (عليه السلام) قَالَ قَالَ لِي إِنِّي لَمَوْعُوكٌ مُنْذُ سَبْعَةِ أَشْهُرٍ وَ لَقَدْ وُعِكَ ابْنِي اثْنَيْ عَشَرَ شَهْراً وَ هِيَ تَضَاعَفُ عَلَيْنَا أَ شَعَرْتَ أَنَّهَا لَا تَأْخُذُ فِي الْجَسَدِ كُلِّهِ وَ رُبَّمَا أَخَذَتْ فِي أَعْلَى الْجَسَدِ وَ لَمْ تَأْخُذْ فِي أَسْفَلِهِ وَ رُبَّمَا أَخَذَتْ فِي أَسْفَلِهِ وَ لَمْ تَأْخُذْ فِي أَعْلَى الْجَسَدِ كُلِّهِ ",
          "قُلْتُ جُعِلْتُ فِدَاكَ إِنْ أَذِنْتَ لِي حَدَّثْتُكَ بِحَدِيثٍ عَنْ أَبِي بَصِيرٍ عَنْ جَدِّكَ أَنَّهُ كَانَ إِذَا وُعِكَ اسْتَعَانَ بِالْمَاءِ الْبَارِدِ فَيَكُونُ لَهُ ثَوْبَانِ ثَوْبٌ فِي الْمَاءِ الْبَارِدِ وَ ثَوْبٌ عَلَى جَسَدِهِ يُرَاوِحُ بَيْنَهُمَا ثُمَّ يُنَادِي حَتَّى يُسْمَعَ صَوْتُهُ عَلَى بَابِ الدَّارِ يَا فَاطِمَةُ بِنْتَ مُحَمَّدٍ فَقَالَ صَدَقْتَ ",
          "قُلْتُ جُعِلْتُ فِدَاكَ فَمَا وَجَدْتُمْ لِلْحُمَّى عِنْدَكُمْ دَوَاءً فَقَالَ مَا وَجَدْنَا لَهَا عِنْدَنَا دَوَاءً إِلَّا الدُّعَاءَ وَ الْمَاءَ الْبَارِدَ إِنِّي اشْتَكَيْتُ فَأَرْسَلَ إِلَيَّ مُحَمَّدُ بْنُ إِبْرَاهِيمَ بِطَبِيبٍ لَهُ فَجَاءَنِي بِدَوَاءٍ فِيهِ قَيْ‏ءٌ فَأَبَيْتُ أَنْ أَشْرَبَهُ لِأَنِّي إِذَا قَيَيْتُ زَالَ كُلُّ مَفْصِلٍ مِنِّي."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473197\">H 14535</a> – Muhammad Bin Yahya, from Ahmad bin Muhammad Bin Isa, from Al-Husayn Bin Saeed, from Al-Qasim Bin Muhammad Al-Jowhary, from Ali Bin Abu Hamza, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ibrahim</span><sup>asws</sup> having said to me: ‘I<sup>asws</sup> have had fever for seven months and my<sup>asws</sup> son has had fever for twelve months and it has been increasing for us.  I<sup>asws</sup> feel that it does not affect the whole body. Sometimes it affects in the upper part of the body and does not affect in the lower of it, and sometimes it affects in the lower part of it and does not affect in all of the upper body’.",
            "I said, ‘May I be sacrificed for you. If you<sup>asws</sup> allow me, I would narrate to you<sup>asws</sup> a Hadeeth from Abu Baseer from your<sup>asws</sup> grandfather<sup>asws</sup> when he<sup>asws</sup> had fever, he<sup>asws</sup> sought help by the cold water. So he<sup>asws</sup> would take two pieces of cloth, one immerse it in the cold water and one on the body and rotate between them. Then he<sup>asws</sup> would call out until his<sup>asws</sup> voice would be heard at the door of the house;  ‘يَا فَاطِمَةُ بِنْتَ مُحَمَّدٍ’ ‘O Fatima<sup>asws</sup> daughter<sup>asws</sup> of the Muhammad<sup>saww</sup>’. He<sup>asws</sup> said: ‘You have spoken the truth’. ",
            "I said, ‘May I be sacrificed for you<sup>asws</sup>. Have you<sup>asws</sup> not found a cure for the fever?’ So he<sup>asws</sup> said: ‘We<sup>asws</sup> have not found a cure for it except for the supplication and the cold water. I<sup>asws</sup> complained of it, so Muhammad Bin Ibrahim sent a doctor to me for it. So he came to me<sup>asws</sup> with a medicine which made me<sup>asws</sup> vomit, so I refused to drink it, because if I vomit, all of my<sup>asws</sup> joints hurt’."
          ],
          "en.sarwar": [
            "87. Muhammad Bin Yahya, from Ahmad bin Muhammad Bin Isa, from Al-Husayn Bin Saeed, from Al-Qasim Bin Muhammad Al-Jowhary, from Ali Bin Abu Hamza, who has said: Abu Ibrahim (a.s.) having said to me: ‘I (a.s.) have had fever for seven months and my (a.s.) son has had fever for twelve months and it has been increasing for us. I (a.s.) feel that it does not affect the whole body. Sometimes it affects in the upper part of the body and does not affect in the lower of it, and sometimes it affects in the lower part of it and does not affect in all of the upper body’. I said, ‘May I be sacrificed for you. If you (a.s.) allow me, I would narrate to you (a.s.) a Hadeeth from Abu Baseer from your (a.s.) grandfather (a.s.) when he (a.s.) had fever, he (a.s.) sought help by the cold water. So he (a.s.) would take two pieces of cloth, one immerse it in the cold water and one on the body and rotate between them. Then he (a.s.) would call out until his (a.s.) voice would be heard at the door of the house; ‘يَا فَاطِمَةُ بِنْتَ مُحَمَّدٍ’ ‘O Fatima (a.s.) daughter (a.s.) of the Muhammad (saww)’. He (a.s.) said: ‘You have spoken the truth’. I said, ‘May I be sacrificed for you (a.s.). Have you (a.s.) not found a cure for the fever?’ So he (a.s.) said: ‘We (a.s.) have not found a cure for it except for the supplication and the cold water. I (a.s.) complained of it, so Muhammad Bin Ibrahim sent a doctor to me for it. So he came to me (a.s.) with a medicine which made me (a.s.) vomit, so I refused to drink it, because if I vomit, all of my (a.s.) joints hurt’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 265)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14772,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:25:18",
        "text": [
          "14536- الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ الْأَشْعَرِيِّ عَنْ بَكْرِ بْنِ مُحَمَّدٍ الْأَزْدِيِّ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) حُمَّ رَسُولُ اللَّهِ (صلى الله عليه وآله) فَأَتَاهُ جَبْرَئِيلُ (عليه السلام) فَعَوَّذَهُ فَقَالَ بِسْمِ اللَّهِ أَرْقِيكَ يَا مُحَمَّدُ وَ بِسْمِ اللَّهِ أَشْفِيكَ وَ بِسْمِ اللَّهِ مِنْ كُلِّ دَاءٍ يُعْيِيكَ بِسْمِ اللَّهِ وَ اللَّهُ شَافِيكَ بِسْمِ اللَّهِ خُذْهَا فَلْتَهْنِيكَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ فَلَا أُقْسِمُ بِمَوَاقِعِ النُّجُومِ لَتَبْرَأَنَّ بِإِذْنِ اللَّهِ قَالَ بَكْرٌ وَ سَأَلْتُهُ عَنْ رُقْيَةِ الْحُمَّى فَحَدَّثَنِي بِهَذَا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473198\">H 14536</a> – Al-Husayn Bin Muhammad Al-Ashary, from Muhammad Bin Is’haq Al-Ashary, from Bakr Bin Muhammad Al-Azady who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘The Rasool<sup>saww</sup> Allah<sup>azwj</sup> had fever so Jibraeel<sup>as</sup> gave to him<sup>saww</sup> a charm. So he said: ‘In the Name of Allah<sup>azwj</sup> I perform incantation on you<sup>saww</sup>, O Muhammad<sup>saww</sup>, and in the Name of Allah<sup>azwj</sup> I heal you<sup>saww</sup>, and in the Name of Allah<sup>azwj</sup> from every disease which has exhausted you<sup>saww</sup>, and in the Name of Allah<sup>azwj</sup>, and Allah<sup>azwj</sup> is your<sup>saww</sup> Healer. So take it and congratulations to you<sup>saww</sup>. <span class=\"ibTxt\">[56:75] Nay, I swear by the places of the stars</span> for it would free you<sup>saww</sup> from it by the Permission of Allah<sup>azwj</sup>’. Bakr (the narrator) said, ‘And I asked him<sup>asws</sup> about an incantation<a id=\"_ftnref13\"></a><sup>[13]</sup> for the fever, so he<sup>asws</sup> narrated to me with this’."
          ],
          "en.sarwar": [
            "88. Al-Husayn Bin Muhammad Al-Ashary, from Muhammad Bin Is’haq Al-Ashary, from Bakr Bin Muhammad Al-Azady who said: Abu Abdullah (a.s.) said: ‘The Rasool (saww) Allah (azwj) had fever so Jibraeel (as) gave to him (saww) a charm. So he said: ‘In the Name of Allah (azwj) I perform incantation on you (saww), O Muhammad (saww), and in the Name of Allah (azwj) I heal you (saww), and in the Name of Allah (azwj) from every disease which has exhausted you (saww), and in the Name of Allah (azwj), and Allah (azwj) is your (saww) Healer. So take it and congratulations to you (saww). [56:75] Nay, I swear by the places of the stars for it would free you (saww) from it by the Permission of Allah (azwj)’. Bakr (the narrator) said, ‘And I asked him (a.s.) about an incantation for the fever, so he (a.s.) narrated to me with this’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 266)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14773,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:25:19",
        "text": [
          "14537- أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ أَحْمَدَ بْنِ النَّضْرِ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) مَنْ قَالَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ ثَلَاثَ مَرَّاتٍ كَفَاهُ اللَّهُ عَزَّ وَ جَلَّ تِسْعَةً وَ تِسْعِينَ نَوْعاً مِنْ أَنْوَاعِ الْبَلَاءِ أَيْسَرُهُنَّ الْخَنْقُ.",
          "‘بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ’"
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473199\">H 14537</a> – Abu Ali Al-Ashary, from Muhammad Bin saalim, from Ahmad Bin Al-Nazar, from Amro Bin Shimr, from Jabir, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> has narrated that Rasool Allah<sup>saww</sup> said: ‘The one who says:",
            "‘There is no Power and no Mighty except by Allah<sup>azwj</sup> the High, the Magnificent’, <span style=\"font-weight: bold; text-decoration: underline\">three times</span>, Allah<sup>azwj</sup> Mighty and Majestic would Suffice for him for ninety nine types of affliction, the least of which is choking (suffocation)’."
          ],
          "en.sarwar": [
            "89. Abu Ali Al-Ashary, from Muhammad Bin saalim, from Ahmad Bin Al-Nazar, from Amro Bin Shimr, from Jabir, who has said: Abu Ja’far (a.s.) has narrated that Rasool Allah (saww) said: ‘The one who says: ‘بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ’ ‘There is no Power and no Mighty except by Allah (azwj) the High, the Magnificent’, three times, Allah (azwj) Mighty and Majestic would Suffice for him for ninety nine types of affliction, the least of which is choking (suffocation)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 266)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14774,
        "local_index": 20,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:25:20",
        "text": [
          "14538- حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الْكِنْدِيِّ عَنْ أَحْمَدَ بْنِ الْحَسَنِ الْمِيثَمِيِّ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ نُعْمَانَ الرَّازِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ انْهَزَمَ النَّاسُ يَوْمَ أُحُدٍ عَنْ رَسُولِ اللَّهِ (صلى الله عليه وآله) فَغَضِبَ غَضَباً شَدِيداً قَالَ وَ كَانَ إِذَا غَضِبَ انْحَدَرَ عَنْ جَبِينِهِ مِثْلُ اللُّؤْلُؤِ مِنَ الْعَرَقِ ",
          "قَالَ فَنَظَرَ فَإِذَا عَلِيٌّ (عليه السلام) إِلَى جَنْبِهِ فَقَالَ لَهُ الْحَقْ بِبَنِي أَبِيكَ مَعَ مَنِ انْهَزَمَ عَنْ رَسُولِ اللَّهِ فَقَالَ يَا رَسُولَ اللَّهِ لِي بِكَ أُسْوَةٌ قَالَ فَاكْفِنِي هَؤُلَاءِ فَحَمَلَ فَضَرَبَ أَوَّلَ مَنْ لَقِيَ مِنْهُمْ فَقَالَ جَبْرَئِيلُ (عليه السلام) إِنَّ هَذِهِ لَهِيَ الْمُوَاسَاةُ يَا مُحَمَّدُ فَقَالَ إِنَّهُ مِنِّي وَ أَنَا مِنْهُ فَقَالَ جَبْرَئِيلُ (عليه السلام) وَ أَنَا مِنْكُمَا يَا مُحَمَّدُ ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) فَنَظَرَ رَسُولُ اللَّهِ (صلى الله عليه وآله) إِلَى جَبْرَئِيلَ (عليه السلام) عَلَى كُرْسِيٍّ مِنْ ذَهَبٍ بَيْنَ السَّمَاءِ وَ الْأَرْضِ وَ هُوَ يَقُولُ لَا سَيْفَ إِلَّا ذُو الْفَقَارِ وَ لَا فَتَى إِلَّا عَلِيٌّ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473200\">H 14538</a> – Humeyd Bin Ziyad, from Al-Hassan Bin Muhammad Al-Kindy, from Ahmad Bin Al-Hassan Al-Maysamy, from Abaan Bin usmaan, from Mo’man Al-Razy, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘The people ran away being defeated on the Day of Ohad, from the Rasool<sup>saww</sup> of Allah<sup>azwj</sup>. So he<sup>saww</sup> became angry with intense anger’. He<sup>asws</sup> said: ‘Whenever he<sup>saww</sup> became angry, sweat would descend from his<sup>saww</sup> forehead like pearls’. ",
            "He<sup>asws</sup> said: ‘So he<sup>saww</sup> looked around so there was Ali<sup>asws</sup> by his<sup>saww</sup> side. So he<sup>saww</sup> said to him<sup>asws</sup>: Join with the sons of your<sup>asws</sup> father (and go after), the ones who have fled from the Rasool<sup>saww</sup> Allah<sup>azwj</sup>’. So he<sup>asws</sup> said: ‘O Rasool<sup>saww</sup> of Allah<sup>azwj</sup>, you<sup>saww</sup> are an example for me<sup>asws</sup>’. He<sup>saww</sup> said: ‘So suffice for me<sup>saww</sup> against these (enemies)’. So he<sup>asws</sup> rode and struck the first one he<sup>asws</sup> met from them’. So Jibraeel<sup>as</sup> said: ‘This is the consolation, O Muhammad<sup>saww</sup>!’ He<sup>saww</sup> said: ‘He<sup>asws</sup> is from me<sup>saww</sup> and I<sup>saww</sup> am from him<sup>asws</sup>’. So Jibraeel<sup>as</sup> said: ‘And I am from you<sup>asws</sup> both, O Muhammad<sup>saww</sup>’.",
            "Abu Abdullah<sup>asws</sup> said: ‘So the Rasool<sup>saww</sup> of Allah<sup>azwj</sup> looked towards Jibraeel<sup>saww</sup> who was on a seat of gold in between the sky and the earth and he was saying: ‘There is not sword except for <span class=\"iTxt\">Zu Al-Fiqar</span> and no warrior like Ali<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "90. Humeyd Bin Ziyad, from Al-Hassan Bin Muhammad Al-Kindy, from Ahmad Bin Al-Hassan Al-Maysamy, from Abaan Bin usmaan, from Mo’man Al-Razy, who has narrated the following: Abu Abdullah (a.s.) has said: ‘The people ran away being defeated on the Day of Ohad, from the Rasool (saww) of Allah (azwj). So he (saww) became angry with intense anger’. He (a.s.) said: ‘Whenever he (saww) became angry, sweat would descend from his (saww) forehead like pearls’. He (a.s.) said: ‘So he (saww) looked around so there was Ali (a.s.) by his (saww) side. So he (saww) said to him (a.s.): Join with the sons of your (a.s.) father (and go after), the ones who have fled from the Rasool (saww) Allah (azwj)’. So he (a.s.) said: ‘O Rasool (saww) of Allah (azwj), you (saww) are an example for me (a.s.)’. He (saww) said: ‘So suffice for me (saww) against these (enemies)’. So he (a.s.) rode and struck the first one he (a.s.) met from them’. So Jibraeel (as) said: ‘This is the consolation, O Muhammad (saww)!’ He (saww) said: ‘He (a.s.) is from me (saww) and I (saww) am from him (a.s.)’. So Jibraeel (as) said: ‘And I am from you (a.s.) both, O Muhammad (saww)’. Abu Abdullah (a.s.) said: ‘So the Rasool (saww) of Allah (azwj) looked towards Jibraeel (saww) who was on a seat of gold in between the sky and the earth and he was saying: ‘There is not sword except for Zu Al-Fiqar and no warrior like Ali (a.s.)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 268)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14775,
        "local_index": 21,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:25:21",
        "text": [
          "14539- حُمَيْدُ بْنُ زِيَادٍ عَنْ عُبَيْدِ اللَّهِ بْنِ أَحْمَدَ الدِّهْقَانِ عَنْ عَلِيِّ بْنِ الْحَسَنِ الطَّاطَرِيِّ عَنْ مُحَمَّدِ بْنِ زِيَادِ بْنِ عِيسَى بَيَّاعِ السَّابِرِيِّ عَنْ أَبَانِ بْنِ عُثْمَانَ قَالَ حَدَّثَنِي فُضَيْلٌ الْبُرْجُمِيُّ قَالَ كُنْتُ بِمَكَّةَ وَ خَالِدُ بْنُ عَبْدِ اللَّهِ أَمِيرٌ وَ كَانَ فِي الْمَسْجِدِ عِنْدَ زَمْزَمَ فَقَالَ ادْعُوا لِي قَتَادَةَ قَالَ فَجَاءَ شَيْخٌ أَحْمَرُ الرَّأْسِ وَ اللِّحْيَةِ فَدَنَوْتُ لِأَسْمَعَ فَقَالَ خَالِدٌ يَا قَتَادَةُ أَخْبِرْنِي بِأَكْرَمِ وَقْعَةٍ كَانَتْ فِي الْعَرَبِ وَ أَعَزِّ وَقْعَةٍ كَانَتْ فِي الْعَرَبِ وَ أَذَلِّ وَقْعَةٍ كَانَتْ فِي الْعَرَبِ فَقَالَ أَصْلَحَ اللَّهُ الْأَمِيرَ أُخْبِرُكَ بِأَكْرَمِ وَقْعَةٍ كَانَتْ فِي الْعَرَبِ وَ أَعَزِّ وَقْعَةٍ كَانَتْ فِي الْعَرَبِ وَ أَذَلِّ وَقْعَةٍ كَانَتْ فِي الْعَرَبِ وَاحِدَةٌ قَالَ خَالِدٌ وَيْحَكَ وَاحِدَةٌ قَالَ نَعَمْ أَصْلَحَ اللَّهُ الْأَمِيرَ قَالَ أَخْبِرْنِي قَالَ بَدْرٌ قَالَ وَ كَيْفَ ذَا ",
          "قَالَ إِنَّ بَدْراً أَكْرَمُ وَقْعَةٍ كَانَتْ فِي الْعَرَبِ بِهَا أَكْرَمَ اللَّهُ عَزَّ وَ جَلَّ الْإِسْلَامَ وَ أَهْلَهُ وَ هِيَ أَعَزُّ وَقْعَةٍ كَانَتْ فِي الْعَرَبِ بِهَا أَعَزَّ اللَّهُ الْإِسْلَامَ وَ أَهْلَهُ وَ هِيَ أَذَلُّ وَقْعَةٍ كَانَتْ فِي الْعَرَبِ فَلَمَّا قُتِلَتْ قُرَيْشٌ يَوْمَئِذٍ ذَلَّتِ الْعَرَبُ فَقَالَ لَهُ خَالِدٌ كَذَبْتَ لَعَمْرُ اللَّهِ إِنْ كَانَ فِي الْعَرَبِ يَوْمَئِذٍ مَنْ هُوَ أَعَزُّ مِنْهُمْ وَيْلَكَ يَا قَتَادَةُ أَخْبِرْنِي بِبَعْضِ أَشْعَارِهِمْ قَالَ خَرَجَ أَبُو جَهْلٍ يَوْمَئِذٍ وَ قَدْ أَعْلَمَ لِيُرَى مَكَانُهُ وَ عَلَيْهِ عِمَامَةٌ حَمْرَاءُ وَ بِيَدِهِ تُرْسٌ مُذَهَّبٌ وَ هُوَ يَقُولُ : مَا تَنْقِمُ الْحَرْبُ الشَّمُوسُ مِنِّي بَازِلُ عَامَيْنِ حَدِيثُ السِّنّ ‏لِمِثْلِ هَذَا وَلَدَتْنِي أُمِّي فَقَالَ كَذَبَ عَدُوُّ اللَّهِ إِنْ كَانَ ابْنُ أَخِي لَأَفْرَسَ مِنْهُ يَعْنِي خَالِدَ بْنَ الْوَلِيدِ وَ كَانَتْ أُمُّهُ قُشَيْرِيَّةً ",
          "وَيْلَكَ يَا قَتَادَةُ مَنِ الَّذِي يَقُولُ أُوفِي بِمِيعَادِي وَ أَحْمِي عَنْ حَسَبْ فَقَالَ أَصْلَحَ اللَّهُ الْأَمِيرَ لَيْسَ هَذَا يَوْمَئِذٍ هَذَا يَوْمُ أُحُدٍ خَرَجَ طَلْحَةُ بْنُ أَبِي طَلْحَةَ وَ هُوَ يُنَادِي مَنْ يُبَارِزُ فَلَمْ يَخْرُجْ إِلَيْهِ أَحَدٌ فَقَالَ إِنَّكُمْ تَزْعُمُونَ أَنَّكُمْ تُجَهِّزُونَّا بِأَسْيَافِكُمْ إِلَى النَّارِ وَ نَحْنُ نُجَهِّزُكُمْ بِأَسْيَافِنَا إِلَى الْجَنَّةِ فَلْيَبْرُزَنَّ إِلَيَّ رَجُلٌ يُجَهِّزُنِي بِسَيْفِهِ إِلَى النَّارِ وَ أُجَهِّزُهُ بِسَيْفِي إِلَى الْجَنَّةِ فَخَرَجَ إِلَيْهِ عَلِيُّ بْنُ أَبِي طَالِبٍ (عليه السلام) وَ هُوَ يَقُولُ : أَنَا ابْنُ ذِي الْحَوْضَيْنِ عَبْدِ الْمُطَّلِبْ وَ هَاشِمِ المُطْعِمِ فِي الْعَامِ السَّغِبْ‏ أُوفِي بِمِيعَادِي وَ أَحْمِي عَنْ حَسَبْ",
          "فَقَالَ خَالِدٌ لَعَنَهُ اللَّهُ كَذَبَ لَعَمْرِي وَ اللَّهِ أَبُو تُرَابٍ مَا كَانَ كَذَلِكَ فَقَالَ الشَّيْخُ أَيُّهَا الْأَمِيرُ ائْذَنْ لِي فِي الِانْصِرَافِ قَالَ فَقَامَ الشَّيْخُ يُفَرِّجُ النَّاسَ بِيَدِهِ وَ خَرَجَ وَ هُوَ يَقُولُ زِنْدِيقٌ وَ رَبِّ الْكَعْبَةِ زِنْدِيقٌ وَ رَبِّ الْكَعْبَةِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473201\">H 14539</a> – Humeyd Bin Ziyad, from Ubeydullah Bin Ahmad Al-Dahqaan, from Ali Bin Al-Hassan Al-Tatary, from Muhammad Bin Ziyad Bin Isa Bayya Al-Sabiry, from Aban Biin Usman said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-f\">‘F</span>uzyl Al-Barjumy narrated</span> to me saying, ‘I was at Mecca and Khalid Bin Abdull Ameer was the governor, and he was in Al-Masjid near Zamzam. He said, ‘Call Qatada for me’. An old man with a red beard came up, and I went near them to listen. Khalid said, ‘O Qatada, inform me of the most prestigious event that has transpired among the Arabs, and the most honourable event that has transpired among the Arabs, and the most disgraceful event that has transpired among the Arabs’. So he said, ‘May Allah<sup>azwj</sup> Keep the Emir well. I hereby inform you that the most honourable event that has transpired among the Arabs, and the most disgraceful event that has transpired among the Arabs, is one’. He said, ‘Woe be unto you, one?’ He said, ‘Yes, may Allah<sup>azwj</sup> Keep the Emir well’. He said, ‘Inform me’. He said, ‘Badr’. He said, ‘And how is that?’ ",
            "He said, ‘Badr was the most prestigious event that has transpired among the Arabs because Allah<sup>azwj</sup> Mighty and Majestic Gave prestige to Al-Islam and its people, and it is the most honourable event to have transpired among the Arabs because Allah<sup>azwj</sup> Mighty and Majestic gave Honour to Al-Islam and its people, and it is the most disgraceful event to have transpired among the Arabs, for Qureysh were killed on that Day and the Arabs were humiliated’. Khalid said to him, ‘You have lied, by the Life of Allah<sup>azwj</sup> for there was no day more honourable for the Arabs than that Day. Woe be unto you, O Qatada, inform me of some of their poems’. He said, ‘Abu Jahl came out on that Day, so that his status may be seen, and upon him was a red turban, and in his hand was a golden shield and he was saying, ‘A detestable war like this cannot take its revenge against me as I am like a two year old camel at the peak of its strength, and it is for the like of this that my mother has borne me’. He said, ‘The enemy of Allah<sup>azwj</sup> has lied, the son of my brother was more of a horse than him, meaning Khalid Bin Waleed, and his mother was Qushayriyya’.",
            "Woe be unto you, O Qatada, who is the one who said, ‘I fulfil my promise and defend my status’. He said, ‘May Allah<sup>azwj</sup> Keep the Emir well, this was not on that Day. This was on the Day of Ohad. Talha Bin Abu Talha came out and he was calling out, ‘Who will come out for the duel?’ No one came out against him’. So he said, ‘You all are alleging that you will exit us by way of your swords to the Fire, and we would dispatch you by our swords to the Paradise, so let a man duel with me to exit me by his sword to the Fire and I will dispatch him by my sword to the Paradise’. So Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> came out against him and he<sup>asws</sup> was saying: ‘I<sup>asws</sup> am the son<sup>asws</sup> the owner of the two Fountains Abdul Muttalib<sup>as</sup> and Hashim<sup>as</sup> the feeders in the year of the famine. I<sup>asws</sup> fulfil my<sup>asws</sup> promise and defend my<sup>asws</sup> status’. ",
            "Khalid said, ‘May Allah<sup>azwj</sup> Curse him<sup>asws</sup>. He<sup>asws</sup> has lied, by the Life of Allah<sup>azwj</sup>. Abu Turab<sup>asws</sup> was not like that’. The old man said, ‘O Emir, allow me to leave’. He (the narrator) said, ‘The old man stood up to leave, opening the way through the crowd of people by his hands and he was saying, ‘An atheist (Zindeeq), by the Lord<sup>azwj</sup> of the Kaaba! An atheist (Zindeeq), by the Lord<sup>azwj</sup> of the Kaaba’. (This is a report and not a hadeeth)"
          ],
          "en.sarwar": [
            "91. Humeyd Bin Ziyad, from Ubeydullah Bin Ahmad Al-Dahqaan, from Ali Bin Al-Hassan Al-Tatary, from Muhammad Bin Ziyad Bin Isa Bayya Al-Sabiry, from Aban Biin Usman said: ‘Fuzyl Al-Barjumy narrated to me saying, ‘I was at Mecca and Khalid Bin Abdull Ameer was the governor, and he was in Al-Masjid near Zamzam. He said, ‘Call Qatada for me’. An old man with a red beard came up, and I went near them to listen. Khalid said, ‘O Qatada, inform me of the most prestigious event that has transpired among the Arabs, and the most honourable event that has transpired among the Arabs, and the most disgraceful event that has transpired among the Arabs’. So he said, ‘May Allah (azwj) Keep the Emir well. I hereby inform you that the most honourable event that has transpired among the Arabs, and the most disgraceful event that has transpired among the Arabs, is one’. He said, ‘Woe be unto you, one?’ He said, ‘Yes, may Allah (azwj) Keep the Emir well’. He said, ‘Inform me’. He said, ‘Badr’. He said, ‘And how is that?’ He said, ‘Badr was the most prestigious event that has transpired among the Arabs because Allah (azwj) Mighty and Majestic Gave prestige to Al-Islam and its people, and it is the most honourable event to have transpired among the Arabs because Allah (azwj) Mighty and Majestic gave Honour to Al-Islam and its people, and it is the most disgraceful event to have transpired among the Arabs, for Qureysh were killed on that Day and the Arabs were humiliated’. Khalid said to him, ‘You have lied, by the Life of Allah (azwj) for there was no day more honourable for the Arabs than that Day. Woe be unto you, O Qatada, inform me of some of their poems’. He said, ‘Abu Jahl came out on that Day, so that his status may be seen, and upon him was a red turban, and in his hand was a golden shield and he was saying, ‘A detestable war like this cannot take its revenge against me as I am like a two year old camel at the peak of its strength, and it is for the like of this that my mother has borne me’. He said, ‘The enemy of Allah (azwj) has lied, the son of my brother was more of a horse than him, meaning Khalid Bin Waleed, and his mother was Qushayriyya’. Woe be unto you, O Qatada, who is the one who said, ‘I fulfil my promise and defend my status’. He said, ‘May Allah (azwj) Keep the Emir well, this was not on that Day. This was on the Day of Ohad. Talha Bin Abu Talha came out and he was calling out, ‘Who will come out for the duel?’ No one came out against him’. So he said, ‘You all are alleging that you will exit us by way of your swords to the Fire, and we would dispatch you by our swords to the Paradise, so let a man duel with me to exit me by his sword to the Fire and I will dispatch him by my sword to the Paradise’. So Ali (a.s.) Bin Abu Talib (a.s.) came out against him and he (a.s.) was saying: ‘I (a.s.) am the son (a.s.) the owner of the two Fountains Abdul Muttalib (as) and Hashim (as) the feeders in the year of the famine. I (a.s.) fulfil my (a.s.) promise and defend my (a.s.) status’. Khalid said, ‘May Allah (azwj) Curse him (a.s.). He (a.s.) has lied, by the Life of Allah (azwj). Abu Turab (a.s.) was not like that’. The old man said, ‘O Emir, allow me to leave’. He (the narrator) said, ‘The old man stood up to leave, opening the way through the crowd of people by his hands and he was saying, ‘An atheist (Zindeeq), by the Lord (azwj) of the Kaaba! An atheist (Zindeeq), by the Lord (azwj) of the Kaaba’. (This is a report and not a hadeeth)"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:25",
  "kind": "verse_list"
}