{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 26"
        },
        "path": "/books/al-kafi:8:1:26",
        "titles": {
          "ar": "حَدِيثُ آدَمَ ( عليه السلام ) مَعَ الشَّجَرَةِ",
          "en": "HADEETH OF ADAM<sup>as</sup> WITH THE TREE"
        }
      }
    ],
    "index": 2297,
    "local_index": 26,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 27"
        },
        "path": "/books/al-kafi:8:1:27",
        "titles": {
          "ar": "حَدِيثُ نَصْرَانِيِّ الشَّامِ مَعَ الْبَاقِرِ (عليه السلام)",
          "en": "HADEETH OF THE SYRIAN CHRISTIAN WITH AL-BAQIR<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 25"
        },
        "path": "/books/al-kafi:8:1:25",
        "titles": {
          "ar": "حَدِيثُ أَبِي بَصِيرٍ مَعَ الْمَرْأَةِ",
          "en": "HADEETH OF ABU BASEER WITH THE WOMAN"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:26",
    "titles": {
      "ar": "حَدِيثُ آدَمَ ( عليه السلام ) مَعَ الشَّجَرَةِ",
      "en": "HADEETH OF ADAM<sup>as</sup> WITH THE TREE"
    },
    "verse_count": 2,
    "verse_start_index": 14775,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 272)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14776,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:26:1",
        "relations": {
          "Mentions": [
            "/books/quran:3:33",
            "/books/quran:26:123",
            "/books/quran:7:157",
            "/books/quran:29:26",
            "/books/quran:26:191",
            "/books/quran:7:65",
            "/books/quran:29:16",
            "/books/quran:11:25",
            "/books/quran:3:34",
            "/books/quran:6:85",
            "/books/quran:11:89",
            "/books/quran:23:44",
            "/books/quran:24:36",
            "/books/quran:61:6",
            "/books/quran:6:84",
            "/books/quran:6:87",
            "/books/quran:4:54",
            "/books/quran:6:86",
            "/books/quran:2:132",
            "/books/quran:6:89",
            "/books/quran:26:124",
            "/books/quran:26:105",
            "/books/quran:20:115",
            "/books/quran:4:164",
            "/books/quran:5:27"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14540</span>- عَلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى عَهِدَ إِلَى آدَمَ (عليه السلام) أَنْ لَا يَقْرَبَ هَذِهِ الشَّجَرَةَ فَلَمَّا بَلَغَ الْوَقْتُ الَّذِي كَانَ فِي عِلْمِ اللَّهِ أَنْ يَأْكُلَ مِنْهَا نَسِيَ فَأَكَلَ مِنْهَا وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ لَقَدْ عَهِدْنا إِلى آدَمَ مِنْ قَبْلُ فَنَسِيَ وَ لَمْ نَجِدْ لَهُ عَزْماً فَلَمَّا أَكَلَ آدَمُ (عليه السلام) مِنَ الشَّجَرَةِ أُهْبِطَ إِلَى الْأَرْضِ فَوُلِدَ لَهُ هَابِيلُ وَ أُخْتُهُ تَوْأَمٌ وَ وُلِدَ لَهُ قَابِيلُ وَ أُخْتُهُ تَوْأَمٌ ثُمَّ ",
          "إِنَّ آدَمَ (عليه السلام) أَمَرَ هَابِيلَ وَ قَابِيلَ أَنْ يُقَرِّبَا قُرْبَاناً وَ كَانَ هَابِيلُ صَاحِبَ غَنَمٍ وَ كَانَ قَابِيلُ صَاحِبَ زَرْعٍ فَقَرَّبَ هَابِيلُ كَبْشاً مِنْ أَفَاضِلِ غَنَمِهِ وَ قَرَّبَ قَابِيلُ مِنْ زَرْعِهِ مَا لَمْ يُنَقَّ فَتُقُبِّلَ قُرْبَانُ هَابِيلَ وَ لَمْ يُتَقَبَّلْ قُرْبَانُ قَابِيلَ وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ اتْلُ عَلَيْهِمْ نَبَأَ ابْنَيْ آدَمَ بِالْحَقِّ إِذْ قَرَّبا قُرْباناً فَتُقُبِّلَ مِنْ أَحَدِهِما وَ لَمْ يُتَقَبَّلْ مِنَ الْآخَرِ إِلَى آخِرِ الْآيَةِ وَ كَانَ الْقُرْبَانُ تَأْكُلُهُ النَّارُ فَعَمَدَ قَابِيلُ إِلَى النَّارِ فَبَنَى لَهَا بَيْتاً وَ هُوَ أَوَّلُ مَنْ بَنَى بُيُوتَ النَّارِ فَقَالَ لَأَعْبُدَنَّ هَذِهِ النَّارَ حَتَّى تَتَقَبَّلَ مِنِّي قُرْبَانِي ",
          "ثُمَّ إِنَّ إِبْلِيسَ لَعَنَهُ اللَّهُ أَتَاهُ وَ هُوَ يَجْرِي مِنِ ابْنِ آدَمَ مَجْرَى الدَّمِ فِي الْعُرُوقِ فَقَالَ لَهُ يَا قَابِيلُ قَدْ تُقُبِّلَ قُرْبَانُ هَابِيلَ وَ لَمْ يُتَقَبَّلْ قُرْبَانُكَ وَ إِنَّكَ إِنْ تَرَكْتَهُ يَكُونُ لَهُ عَقِبٌ يَفْتَخِرُونَ عَلَى عَقِبِكَ وَ يَقُولُونَ نَحْنُ أَبْنَاءُ الَّذِي تُقُبِّلَ قُرْبَانُهُ فَاقْتُلْهُ كَيْلَا يَكُونَ لَهُ عَقِبٌ يَفْتَخِرُونَ عَلَى عَقِبِكَ فَقَتَلَهُ فَلَمَّا رَجَعَ قَابِيلُ إِلَى آدَمَ (عليه السلام) قَالَ لَهُ يَا قَابِيلُ أَيْنَ هَابِيلُ فَقَالَ اطْلُبْهُ حَيْثُ قَرَّبْنَا الْقُرْبَانَ فَانْطَلَقَ آدَمُ (عليه السلام) فَوَجَدَ هَابِيلَ قَتِيلًا فَقَالَ آدَمُ (عليه السلام) لُعِنْتِ مِنْ أَرْضٍ كَمَا قَبِلْتِ دَمَ هَابِيلَ وَ بَكَى آدَمُ (عليه السلام) عَلَى هَابِيلَ أَرْبَعِينَ لَيْلَةً ",
          "ثُمَّ إِنَّ آدَمَ سَأَلَ رَبَّهُ وَلَداً فَوُلِدَ لَهُ غُلَامٌ فَسَمَّاهُ هِبَةَ اللَّهِ لِأَنَّ اللَّهَ عَزَّ وَ جَلَّ وَهَبَهُ لَهُ وَ أُخْتُهُ تَوْأَمٌ فَلَمَّا انْقَضَتْ نُبُوَّةُ آدَمَ (عليه السلام) وَ اسْتَكْمَلَ أَيَّامَهُ أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ أَنْ يَا آدَمُ قَدِ انْقَضَتْ نُبُوَّتُكَ وَ اسْتَكْمَلْتَ أَيَّامَكَ فَاجْعَلِ الْعِلْمَ الَّذِي عِنْدَكَ وَ الْإِيمَانَ وَ الِاسْمَ الْأَكْبَرَ وَ مِيرَاثَ الْعِلْمِ وَ آثَارَ عِلْمِ النُّبُوَّةِ فِي الْعَقِبِ مِنْ ذُرِّيَّتِكَ عِنْدَ هِبَةِ اللَّهِ فَإِنِّي لَنْ أَقْطَعَ الْعِلْمَ وَ الْإِيمَانَ وَ الِاسْمَ الْأَكْبَرَ وَ آثَارَ النُّبُوَّةِ مِنَ الْعَقِبِ مِنْ ذُرِّيَّتِكَ إِلَى يَوْمِ الْقِيَامَةِ وَ لَنْ أَدَعَ الْأَرْضَ إِلَّا وَ فِيهَا عَالِمٌ يُعْرَفُ بِهِ دِينِي وَ يُعْرَفُ بِهِ طَاعَتِي وَ يَكُونُ نَجَاةً لِمَنْ يُولَدُ فِيمَا بَيْنَكَ وَ بَيْنَ نُوحٍ ",
          "وَ بَشَّرَ آدَمَ بِنُوحٍ (عليهما السلام) فَقَالَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى بَاعِثٌ نَبِيّاً اسْمُهُ نُوحٌ وَ إِنَّهُ يَدْعُو إِلَى اللَّهِ عَزَّ ذِكْرُهُ وَ يُكَذِّبُهُ قَوْمُهُ فَيُهْلِكُهُمُ اللَّهُ بِالطُّوفَانِ وَ كَانَ بَيْنَ آدَمَ وَ بَيْنَ نُوحٍ (عليه السلام) عَشَرَةُ آبَاءٍ أَنْبِيَاءُ وَ أَوْصِيَاءُ كُلُّهُمْ وَ أَوْصَى آدَمُ (عليه السلام) إِلَى هِبَةِ اللَّهِ أَنَّ مَنْ أَدْرَكَهُ مِنْكُمْ فَلْيُؤْمِنْ بِهِ وَ لْيَتَّبِعْهُ وَ لْيُصَدِّقْ بِهِ فَإِنَّهُ يَنْجُو مِنَ الْغَرَقِ ",
          "ثُمَّ إِنَّ آدَمَ (عليه السلام) مَرِضَ الْمَرْضَةَ الَّتِي مَاتَ فِيهَا فَأَرْسَلَ هِبَةَ اللَّهِ وَ قَالَ لَهُ إِنْ لَقِيتَ جَبْرَئِيلَ أَوْ مَنْ لَقِيتَ مِنَ الْمَلَائِكَةِ فَأَقْرِئْهُ مِنِّي السَّلَامَ وَ قُلْ لَهُ يَا جَبْرَئِيلُ إِنَّ أَبِي يَسْتَهْدِيكَ مِنْ ثِمَارِ الْجَنَّةِ فَقَالَ لَهُ جَبْرَئِيلُ يَا هِبَةَ اللَّهِ إِنَّ أَبَاكَ قَدْ قُبِضَ وَ إِنَّا نَزَلْنَا لِلصَّلَاةِ عَلَيْهِ فَارْجِعْ فَرَجَعَ فَوَجَدَ آدَمَ (عليه السلام) قَدْ قُبِضَ فَأَرَاهُ جَبْرَئِيلُ كَيْفَ يُغَسِّلُهُ فَغَسَّلَهُ حَتَّى إِذَا بَلَغَ الصَّلَاةَ عَلَيْهِ قَالَ هِبَةُ اللَّهِ يَا جَبْرَئِيلُ تَقَدَّمْ فَصَلِّ عَلَى آدَمَ فَقَالَ لَهُ جَبْرَئِيلُ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَمَرَنَا أَنْ نَسْجُدَ لِأَبِيكَ آدَمَ وَ هُوَ فِي الْجَنَّةِ فَلَيْسَ لَنَا أَنْ نَؤُمَّ شَيْئاً مِنْ وُلْدِهِ فَتَقَدَّمَ هِبَةُ اللَّهِ فَصَلَّى عَلَى أَبِيهِ وَ جَبْرَئِيلُ خَلْفَهُ وَ جُنُودُ الْمَلَائِكَةِ وَ كَبَّرَ عَلَيْهِ ثَلَاثِينَ تَكْبِيرَةً فَأَمَرَ جَبْرَئِيلُ (عليه السلام) فَرَفَعَ خَمْساً وَ عِشْرِينَ تَكْبِيرَةً وَ السُّنَّةُ الْيَوْمَ فِينَا خَمْسُ تَكْبِيرَاتٍ وَ قَدْ كَانَ يُكَبَّرُ عَلَى أَهْلِ بَدْرٍ تِسْعاً وَ سَبْعاً ",
          "ثُمَّ إِنَّ هِبَةَ اللَّهِ لَمَّا دَفَنَ أَبَاهُ أَتَاهُ قَابِيلُ فَقَالَ يَا هِبَةَ اللَّهِ إِنِّي قَدْ رَأَيْتُ أَبِي آدَمَ قَدْ خَصَّكَ مِنَ الْعِلْمِ بِمَا لَمْ أُخَصَّ بِهِ أَنَا وَ هُوَ الْعِلْمُ الَّذِي دَعَا بِهِ أَخُوكَ هَابِيلُ فَتُقُبِّلَ قُرْبَانُهُ وَ إِنَّمَا قَتَلْتُهُ لِكَيْلَا يَكُونَ لَهُ عَقِبٌ فَيَفْتَخِرُونَ عَلَى عَقِبِي فَيَقُولُونَ نَحْنُ أَبْنَاءُ الَّذِي تُقُبِّلَ قُرْبَانُهُ وَ أَنْتُمْ أَبْنَاءُ الَّذِي تُرِكَ قُرْبَانُهُ فَإِنَّكَ إِنْ أَظْهَرْتَ مِنَ الْعِلْمِ الَّذِي اخْتَصَّكَ بِهِ أَبُوكَ شَيْئاً قَتَلْتُكَ كَمَا قَتَلْتُ أَخَاكَ هَابِيلَ ",
          "فَلَبِثَ هِبَةُ اللَّهِ وَ الْعَقِبُ مِنْهُ مُسْتَخْفِينَ بِمَا عِنْدَهُمْ مِنَ الْعِلْمِ وَ الْإِيمَانِ وَ الِاسْمِ الْأَكْبَرِ وَ مِيرَاثِ النُّبُوَّةِ وَ آثَارِ عِلْمِ النُّبُوَّةِ حَتَّى بَعَثَ اللَّهُ نُوحاً (عليه السلام) وَ ظَهَرَتْ وَصِيَّةُ هِبَةِ اللَّهِ حِينَ نَظَرُوا فِي وَصِيَّةِ آدَمَ (عليه السلام) فَوَجَدُوا نُوحاً (عليه السلام) نَبِيّاً قَدْ بَشَّرَ بِهِ آدَمُ (عليه السلام) فَآمَنُوا بِهِ وَ اتَّبَعُوهُ وَ صَدَّقُوهُ ",
          "وَ قَدْ كَانَ آدَمُ (عليه السلام) وَصَّى هِبَةَ اللَّهِ أَنْ يَتَعَاهَدَ هَذِهِ الْوَصِيَّةَ عِنْدَ رَأْسِ كُلِّ سَنَةٍ فَيَكُونَ يَوْمَ عِيدِهِمْ فَيَتَعَاهَدُونَ نُوحاً وَ زَمَانَهُ الَّذِي يَخْرُجُ فِيهِ وَ كَذَلِكَ جَاءَ فِي وَصِيَّةِ كُلِّ نَبِيٍّ حَتَّى بَعَثَ اللَّهُ مُحَمَّداً (صلى الله عليه وآله) وَ إِنَّمَا عَرَفُوا نُوحاً بِالْعِلْمِ الَّذِي عِنْدَهُمْ وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ لَقَدْ أَرْسَلْنا نُوحاً إِلى قَوْمِهِ إِلَى آخِرِ الْآيَةِ وَ كَانَ مَنْ بَيْنَ آدَمَ وَ نُوحٍ مِنَ الْأَنْبِيَاءِ مُسْتَخْفِينَ وَ لِذَلِكَ خَفِيَ ذِكْرُهُمْ فِي الْقُرْآنِ فَلَمْ يُسَمَّوْا كَمَا سُمِّيَ مَنِ اسْتَعْلَنَ مِنَ الْأَنْبِيَاءِ صَلَوَاتُ اللَّهِ عَلَيْهِمْ أَجْمَعِينَ وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ رُسُلًا قَدْ قَصَصْناهُمْ عَلَيْكَ مِنْ قَبْلُ وَ رُسُلًا لَمْ نَقْصُصْهُمْ عَلَيْكَ يَعْنِي لَمْ أُسَمِّ الْمُسْتَخْفِينَ كَمَا سَمَّيْتُ الْمُسْتَعْلِنِينَ مِنَ الْأَنْبِيَاءِ (عليهم السلام) ",
          "فَمَكَثَ نُوحٌ (عليه السلام) فِي قَوْمِهِ أَلْفَ سَنَةٍ إِلَّا خَمْسِينَ عَاماً لَمْ يُشَارِكْهُ فِي نُبُوَّتِهِ أَحَدٌ وَ لَكِنَّهُ قَدِمَ عَلَى قَوْمٍ مُكَذِّبِينَ لِلْأَنْبِيَاءِ (عليهم السلام) الَّذِينَ كَانُوا بَيْنَهُ وَ بَيْنَ آدَمَ (عليه السلام) وَ ذَلِكَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ كَذَّبَتْ قَوْمُ نُوحٍ الْمُرْسَلِينَ يَعْنِي مَنْ كَانَ بَيْنَهُ وَ بَيْنَ آدَمَ (عليه السلام) إِلَى أَنِ انْتَهَى إِلَى قَوْلِهِ عَزَّ وَ جَلَّ وَ إِنَّ رَبَّكَ لَهُوَ الْعَزِيزُ الرَّحِيمُ ",
          "ثُمَّ إِنَّ نُوحاً (عليه السلام) لَمَّا انْقَضَتْ نُبُوَّتُهُ وَ اسْتُكْمِلَتْ أَيَّامُهُ أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ أَنْ يَا نُوحُ قَدْ قَضَيْتَ نُبُوَّتَكَ وَ اسْتَكْمَلْتَ أَيَّامَكَ فَاجْعَلِ الْعِلْمَ الَّذِي عِنْدَكَ وَ الْإِيمَانَ وَ الِاسْمَ الْأَكْبَرَ وَ مِيرَاثَ الْعِلْمِ وَ آثَارَ عِلْمِ النُّبُوَّةِ فِي الْعَقِبِ مِنْ ذُرِّيَّتِكَ فَإِنِّي لَنْ أَقْطَعَهَا كَمَا لَمْ أَقْطَعْهَا مِنْ بُيُوتَاتِ الْأَنْبِيَاءِ (عليهم السلام) الَّتِي بَيْنَكَ وَ بَيْنَ آدَمَ (عليه السلام) وَ لَنْ أَدَعَ الْأَرْضَ إِلَّا وَ فِيهَا عَالِمٌ يُعْرَفُ بِهِ دِينِي وَ تُعْرَفُ بِهِ طَاعَتِي وَ يَكُونُ نَجَاةً لِمَنْ يُولَدُ فِيمَا بَيْنَ قَبْضِ النَّبِيِّ إِلَى خُرُوجِ النَّبِيِّ الْآخَرِ",
          "وَ بَشَّرَ نُوحٌ سَاماً بِهُودٍ (عليه السلام) وَ كَانَ فِيمَا بَيْنَ نُوحٍ وَ هُودٍ مِنَ الْأَنْبِيَاءِ (عليهم السلام) وَ قَالَ نُوحٌ إِنَّ اللَّهَ بَاعِثٌ نَبِيّاً يُقَالُ لَهُ هُودٌ وَ إِنَّهُ يَدْعُو قَوْمَهُ إِلَى اللَّهِ عَزَّ وَ جَلَّ فَيُكَذِّبُونَهُ وَ اللَّهُ عَزَّ وَ جَلَّ مُهْلِكُهُمْ بِالرِّيحِ فَمَنْ أَدْرَكَهُ مِنْكُمْ فَلْيُؤْمِنْ بِهِ وَ لْيَتَّبِعْهُ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ يُنْجِيهِ مِنْ عَذَابِ الرِّيحِ وَ أَمَرَ نُوحٌ (عليه السلام) ابْنَهُ سَاماً أَنْ يَتَعَاهَدَ هَذِهِ الْوَصِيَّةَ عِنْدَ رَأْسِ كُلِّ سَنَةٍ فَيَكُونَ يَوْمُئِذٍ عِيداً لَهُمْ ",
          "فَيَتَعَاهَدُونَ فِيهِ مَا عِنْدَهُمْ مِنَ الْعِلْمِ وَ الْإِيمَانِ وَ الِاسْمِ الْأَكْبَرِ وَ مَوَارِيثِ الْعِلْمِ وَ آثَارِ عِلْمِ النُّبُوَّةِ فَوَجَدُوا هُوداً نَبِيّاً (عليه السلام) وَ قَدْ بَشَّرَ بِهِ أَبُوهُمْ نُوحٌ (عليه السلام) فَآمَنُوا بِهِ وَ اتَّبَعُوهُ وَ صَدَّقُوهُ فَنَجَوْا مِنْ عَذَابِ الرِّيحِ وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ إِلى عادٍ أَخاهُمْ هُوداً وَ قَوْلُهُ عَزَّ وَ جَلَّ كَذَّبَتْ عادٌ الْمُرْسَلِينَ إِذْ قالَ لَهُمْ أَخُوهُمْ هُودٌ أَ لا تَتَّقُونَ وَ قَالَ تَبَارَكَ وَ تَعَالَى وَ وَصَّى بِها إِبْراهِيمُ بَنِيهِ وَ يَعْقُوبُ وَ قَوْلُهُ وَ وَهَبْنا لَهُ إِسْحاقَ وَ يَعْقُوبَ كُلًّا هَدَيْنا لِنَجْعَلَهَا فِي أَهْلِ بَيْتِهِ وَ نُوحاً هَدَيْنا مِنْ قَبْلُ لِنَجْعَلَهَا فِي أَهْلِ بَيْتِهِ فَآمَنَ الْعَقِبُ مِنْ ذُرِّيَّةِ الْأَنْبِيَاءِ (عليهم السلام) مَنْ كَانَ قَبْلَ إِبْرَاهِيمَ لِإِبْرَاهِيمَ (عليه السلام) ",
          "وَ كَانَ بَيْنَ إِبْرَاهِيمَ وَ هُودٍ مِنَ الْأَنْبِيَاءِ (صلوات الله عليهم) وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ ما قَوْمُ لُوطٍ مِنْكُمْ بِبَعِيدٍ وَ قَوْلُهُ عَزَّ ذِكْرُهُ فَآمَنَ لَهُ لُوطٌ وَ قالَ إِنِّي مُهاجِرٌ إِلى رَبِّي وَ قَوْلُهُ عَزَّ وَ جَلَّ وَ إِبْراهِيمَ إِذْ قالَ لِقَوْمِهِ اعْبُدُوا اللَّهَ وَ اتَّقُوهُ ذلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ فَجَرَى بَيْنَ كُلِّ نَبِيَّيْنِ عَشَرَةُ أَنْبِيَاءَ وَ تِسْعَةُ وَ ثَمَانِيَةُ أَنْبِيَاءَ كُلُّهُمْ أَنْبِيَاءُ وَ جَرَى لِكُلِّ نَبِيٍّ مَا جَرَى لِنُوحٍ (صلوات الله عليه) وَ كَمَا جَرَى لآِدَمَ وَ هُودٍ وَ صَالِحٍ وَ شُعَيْبٍ وَ إِبْرَاهِيمَ (صلوات الله عليه) حَتَّى انْتَهَتْ إِلَى يُوسُفَ بْنِ يَعْقُوبَ (عليهما السلام) ",
          "ثُمَّ صَارَتْ مِنْ بَعْدِ يُوسُفَ فِي أَسْبَاطِ إِخْوَتِهِ حَتَّى انْتَهَتْ إِلَى مُوسَى (عليه السلام) فَكَانَ بَيْنَ يُوسُفَ وَ بَيْنَ مُوسَى مِنَ الْأَنْبِيَاءِ (عليهم السلام) فَأَرْسَلَ اللَّهُ مُوسَى وَ هَارُونَ (عليهما السلام) إِلَى فِرْعَوْنَ وَ هَامَانَ وَ قَارُونَ ثُمَّ أَرْسَلَ الرُّسُلَ تَتْرَى كُلَّ ما جاءَ أُمَّةً رَسُولُها كَذَّبُوهُ فَأَتْبَعْنا بَعْضَهُمْ بَعْضاً وَ جَعَلْناهُمْ أَحادِيثَ وَ كَانَتْ بَنُو إِسْرَائِيلَ تَقْتُلُ نَبِيّاً وَ اثْنَانِ قَائِمَانِ وَ يَقْتُلُونَ اثْنَيْنِ وَ أَرْبَعَةٌ قِيَامٌ حَتَّى أَنَّهُ كَانَ رُبَّمَا قَتَلُوا فِي الْيَوْمِ الْوَاحِدِ سَبْعِينَ نَبِيّاً وَ يَقُومُ سُوقُ قَتْلِهِمْ آخِرَ النَّهَارِ ",
          "فَلَمَّا نَزَلَتِ التَّوْرَاةُ عَلَى مُوسَى (عليه السلام) بَشَّرَ بِمُحَمَّدٍ (صلى الله عليه وآله) وَ كَانَ بَيْنَ يُوسُفَ وَ مُوسَى مِنَ الْأَنْبِيَاءِ وَ كَانَ وَصِيُّ مُوسَى يُوشَعَ بْنَ نُونٍ (عليهما السلام) وَ هُوَ فَتَاهُ الَّذِي ذَكَرَهُ اللَّهُ عَزَّ وَ جَلَّ فِي كِتَابِهِ فَلَمْ تَزَلِ الْأَنْبِيَاءُ تُبَشِّرُ بِمُحَمَّدٍ (صلى الله عليه وآله) حَتَّى بَعَثَ اللَّهُ تَبَارَكَ وَ تَعَالَى الْمَسِيحَ عِيسَى ابْنَ مَرْيَمَ فَبَشَّرَ بِمُحَمَّدٍ (صلى الله عليه وآله) وَ ذَلِكَ قَوْلُهُ تَعَالَى يَجِدُونَهُ يَعْنِي الْيَهُودَ وَ النَّصَارَى مَكْتُوباً يَعْنِي صِفَةَ مُحَمَّدٍ (صلى الله عليه وآله) عِنْدَهُمْ يَعْنِي فِي التَّوْراةِ وَ الْإِنْجِيلِ يَأْمُرُهُمْ بِالْمَعْرُوفِ وَ يَنْهاهُمْ عَنِ الْمُنْكَرِ وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ يُخْبِرُ عَنْ عِيسَى وَ مُبَشِّراً بِرَسُولٍ يَأْتِي مِنْ بَعْدِي اسْمُهُ أَحْمَدُ وَ بَشَّرَ مُوسَى وَ عِيسَى بِمُحَمَّدٍ (صلى الله عليه وآله) كَمَا بَشَّرَ الْأَنْبِيَاءُ (عليهم السلام) بَعْضُهُمْ بِبَعْضٍ حَتَّى بَلَغَتْ مُحَمَّداً (صلى الله عليه وآله) ",
          "فَلَمَّا قَضَى مُحَمَّدٌ (صلى الله عليه وآله) نُبُوَّتَهُ وَ اسْتُكْمِلَتْ أَيَّامُهُ أَوْحَى اللَّهُ تَبَارَكَ وَ تَعَالَى إِلَيْهِ يَا مُحَمَّدُ قَدْ قَضَيْتَ نُبُوَّتَكَ وَ اسْتَكْمَلْتَ أَيَّامَكَ فَاجْعَلِ الْعِلْمَ الَّذِي عِنْدَكَ وَ الْإِيمَانَ وَ الِاسْمَ الْأَكْبَرَ وَ مِيرَاثَ الْعِلْمِ وَ آثَارَ عِلْمِ النُّبُوَّةِ فِي أَهْلِ بَيْتِكَ عِنْدَ عَلِيِّ بْنِ أَبِي طَالِبٍ (عليه السلام) فَإِنِّي لَمْ أَقْطَعِ الْعِلْمَ وَ الْإِيمَانَ وَ الِاسْمَ الْأَكْبَرَ وَ مِيرَاثَ الْعِلْمِ وَ آثَارَ عِلْمِ النُّبُوَّةِ مِنَ الْعَقِبِ مِنْ ذُرِّيَّتِكَ كَمَا لَمْ أَقْطَعْهَا مِنْ بُيُوتَاتِ الْأَنْبِيَاءِ الَّذِينَ كَانُوا بَيْنَكَ وَ بَيْنَ أَبِيكَ آدَمَ وَ ذَلِكَ قَوْلُ اللَّهِ تَبَارَكَ وَ تَعَالَى إِنَّ اللَّهَ اصْطَفى آدَمَ وَ نُوحاً وَ آلَ إِبْراهِيمَ وَ آلَ عِمْرانَ عَلَى الْعالَمِينَ ذُرِّيَّةً بَعْضُها مِنْ بَعْضٍ وَ اللَّهُ سَمِيعٌ عَلِيمٌ ",
          "وَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى لَمْ يَجْعَلِ الْعِلْمَ جَهْلًا وَ لَمْ يَكِلْ أَمْرَهُ إِلَى أَحَدٍ مِنْ خَلْقِهِ لَا إِلَى مَلَكٍ مُقَرَّبٍ وَ لَا نَبِيٍّ مُرْسَلٍ وَ لَكِنَّهُ أَرْسَلَ رَسُولًا مِنْ مَلَائِكَتِهِ فَقَالَ لَهُ قُلْ كَذَا وَ كَذَا فَأَمَرَهُمْ بِمَا يُحِبُّ وَ نَهَاهُمْ عَمَّا يَكْرَهُ فَقَصَّ إِلَيْهِمْ أَمْرَ خَلْقِهِ بِعِلْمٍ فَعَلِمَ ذَلِكَ الْعِلْمَ وَ عَلَّمَ أَنْبِيَاءَهُ وَ أَصْفِيَاءَهُ مِنَ الْأَنْبِيَاءِ وَ الْإِخْوَانِ وَ الذُّرِّيَّةِ الَّتِي بَعْضُهَا مِنْ بَعْضٍ فَذَلِكَ قَوْلُهُ جَلَّ وَ عَزَّ فَقَدْ آتَيْنا آلَ إِبْراهِيمَ الْكِتابَ وَ الْحِكْمَةَ وَ آتَيْناهُمْ مُلْكاً عَظِيماً ",
          "فَأَمَّا الْكِتَابُ فَهُوَ النُّبُوَّةُ وَ أَمَّا الْحِكْمَةُ فَهُمُ الْحُكَمَاءُ مِنَ الْأَنْبِيَاءِ مِنَ الصَّفْوَةِ وَ أَمَّا الْمُلْكُ الْعَظِيمُ فَهُمُ الْأَئِمَّةُ [الْهُدَاةُ] مِنَ الصَّفْوَةِ وَ كُلُّ هَؤُلَاءِ مِنَ الذُّرِّيَّةِ الَّتِي بَعْضُهَا مِنْ بَعْضٍ وَ الْعُلَمَاءُ الَّذِينَ جَعَلَ اللَّهُ فِيهِمُ الْبَقِيَّةَ وَ فِيهِمُ الْعَاقِبَةَ وَ حِفْظَ الْمِيثَاقِ حَتَّى تَنْقَضِيَ الدُّنْيَا وَ الْعُلَمَاءَ وَ لِوُلَاةِ الْأَمْرِ اسْتِنْبَاطُ الْعِلْمِ وَ لِلْهُدَاةِ فَهَذَا شَأْنُ الْفُضَّلِ مِنَ الصَّفْوَةِ وَ الرُّسُلِ وَ الْأَنْبِيَاءِ وَ الْحُكَمَاءِ وَ أَئِمَّةِ الْهُدَى وَ الْخُلَفَاءِ الَّذِينَ هُمْ وُلَاةُ أَمْرِ اللَّهِ عَزَّ وَ جَلَّ وَ اسْتِنْبَاطِ عِلْمِ اللَّهِ وَ أَهْلُ آثَارِ عِلْمِ اللَّهِ مِنَ الذُّرِّيَّةِ الَّتِي بَعْضُهَا مِنْ بَعْضٍ مِنَ الصَّفْوَةِ بَعْدَ الْأَنْبِيَاءِ (عليهم السلام) مِنَ الْآبَاءِ وَ الْإِخْوَانِ وَ الذُّرِّيَّةِ مِنَ الْأَنْبِيَاءِ ",
          "فَمَنِ اعْتَصَمَ بِالْفُضَّلِ انْتَهَى بِعِلْمِهِمْ وَ نَجَا بِنُصْرَتِهِمْ وَ مَنْ وَضَعَ وُلَاةَ أَمْرِ اللَّهِ عَزَّ وَ جَلَّ وَ أَهْلَ اسْتِنْبَاطِ عِلْمِهِ فِي غَيْرِ الصَّفْوَةِ مِنْ بُيُوتَاتِ الْأَنْبِيَاءِ (عليهم السلام) فَقَدْ خَالَفَ أَمْرَ اللَّهِ عَزَّ وَ جَلَّ وَ جَعَلَ الْجُهَّالَ وُلَاةَ أَمْرِ اللَّهِ وَ الْمُتَكَلِّفِينَ بِغَيْرِ هُدًى مِنَ اللَّهِ عَزَّ وَ جَلَّ وَ زَعَمُوا أَنَّهُمْ أَهْلُ اسْتِنْبَاطِ عِلْمِ اللَّهِ فَقَدْ كَذَبُوا عَلَى اللَّهِ وَ رَسُولِهِ وَ رَغِبُوا عَنْ وَصِيِّهِ (عليه السلام) وَ طَاعَتِهِ وَ لَمْ يَضَعُوا فَضْلَ اللَّهِ حَيْثُ وَضَعَهُ اللَّهُ تَبَارَكَ وَ تَعَالَى فَضَلُّوا وَ أَضَلُّوا أَتْبَاعَهُمْ وَ لَمْ يَكُنْ لَهُمْ حُجَّةٌ يَوْمَ الْقِيَامَةِ ",
          "إِنَّمَا الْحُجَّةُ فِي آلِ إِبْرَاهِيمَ (عليه السلام) لِقَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ لَقَدْ آتَيْنَا آلَ إِبْرَاهِيمَ الْكِتَابَ وَ الْحُكْمَ وَ النُّبُوَّةَ وَ آتَيْنَاهُمْ مُلْكاً عَظِيماً فَالْحُجَّةُ الْأَنْبِيَاءُ (عليهم السلام) وَ أَهْلُ بُيُوتَاتِ الْأَنْبِيَاءِ (عليهم السلام) حَتَّى تَقُومَ السَّاعَةُ لِأَنَّ كِتَابَ اللَّهِ يَنْطِقُ بِذَلِكَ وَصِيَّةُ اللَّهِ بَعْضُهَا مِنْ بَعْضٍ الَّتِي وَضَعَهَا عَلَى النَّاسِ فَقَالَ عَزَّ وَ جَلَّ فِي بُيُوتٍ أَذِنَ اللَّهُ أَنْ تُرْفَعَ وَ هِيَ بُيُوتَاتُ الْأَنْبِيَاءِ وَ الرُّسُلِ وَ الْحُكَمَاءِ وَ أَئِمَّةِ الْهُدَى ",
          "فَهَذَا بَيَانُ عُرْوَةِ الْإِيمَانِ الَّتِي نَجَا بِهَا مَنْ نَجَا قَبْلَكُمْ وَ بِهَا يَنْجُو مَنْ يَتَّبِعُ الْأَئِمَّةَ وَ قَالَ اللَّهُ عَزَّ وَ جَلَّ فِي كِتَابِهِ وَ نُوحاً هَدَيْنا مِنْ قَبْلُ وَ مِنْ ذُرِّيَّتِهِ داوُدَ وَ سُلَيْمانَ وَ أَيُّوبَ وَ يُوسُفَ وَ مُوسى وَ هارُونَ وَ كَذلِكَ نَجْزِي الْمُحْسِنِينَ وَ زَكَرِيَّا وَ يَحْيى وَ عِيسى وَ إِلْياسَ كُلٌّ مِنَ الصَّالِحِينَ وَ إِسْماعِيلَ وَ الْيَسَعَ وَ يُونُسَ وَ لُوطاً وَ كلًّا فَضَّلْنا عَلَى الْعالَمِينَ وَ مِنْ آبائِهِمْ وَ ذُرِّيَّاتِهِمْ وَ إِخْوانِهِمْ وَ اجْتَبَيْناهُمْ وَ هَدَيْناهُمْ إِلى صِراطٍ مُسْتَقِيمٍ ",
          "أُولئِكَ الَّذِينَ آتَيْناهُمُ الْكِتابَ وَ الْحُكْمَ وَ النُّبُوَّةَ فَإِنْ يَكْفُرْ بِها هؤُلاءِ فَقَدْ وَكَّلْنا بِها قَوْماً لَيْسُوا بِها بِكافِرِينَ فَإِنَّهُ وَكَّلَ بِالْفُضَّلِ مِنْ أَهْلِ بَيْتِهِ وَ الْإِخْوَانِ وَ الذُّرِّيَّةِ وَ هُوَ قَوْلُ اللَّهِ تَبَارَكَ وَ تَعَالَى إِنْ تَكْفُرْ بِهِ أُمَّتُكَ فَقَدْ وَكَّلْتُ أَهْلَ بَيْتِكَ بِالْإِيمَانِ الَّذِي أَرْسَلْتُكَ بِهِ فَلَا يَكْفُرُونَ بِهِ أَبَداً وَ لَا أُضِيعُ الْإِيمَانَ الَّذِي أَرْسَلْتُكَ بِهِ مِنْ أَهْلِ بَيْتِكَ مِنْ بَعْدِكَ عُلَمَاءِ أُمَّتِكَ وَ وُلَاةِ أَمْرِي بَعْدَكَ وَ أَهْلِ اسْتِنْبَاطِ الْعِلْمِ الَّذِي لَيْسَ فِيهِ كَذِبٌ وَ لَا إِثْمٌ وَ لَا زُورٌ وَ لَا بَطَرٌ وَ لَا رِيَاءٌ فَهَذَا بَيَانُ مَا يَنْتَهِي إِلَيْهِ أَمْرُ هَذِهِ الْأُمَّةِ ",
          "إِنَّ اللَّهَ جَلَّ وَ عَزَّ طَهَّرَ أَهْلَ بَيْتِ نَبِيِّهِ (عليهم السلام) وَ سَأَلَهُمْ أَجْرَ الْمَوَدَّةِ وَ أَجْرَى لَهُمُ الْوَلَايَةَ وَ جَعَلَهُمْ أَوْصِيَاءَهُ وَ أَحِبَّاءَهُ ثَابِتَةً بَعْدَهُ فِي أُمَّتِهِ فَاعْتَبِرُوا يَا أَيُّهَا النَّاسُ فِيمَا قُلْتُ حَيْثُ وَضَعَ اللَّهُ عَزَّ وَ جَلَّ وَلَايَتَهُ وَ طَاعَتَهُ وَ مَوَدَّتَهُ وَ اسْتِنْبَاطَ عِلْمِهِ وَ حُجَجَهُ فَإِيَّاهُ فَتَقَبَّلُوا وَ بِهِ فَاسْتَمْسِكُوا تَنْجُوا بِهِ وَ تَكُونُ لَكُمُ الْحُجَّةُ يَوْمَ الْقِيَامَةِ وَ طَرِيقُ رَبِّكُمْ جَلَّ وَ عَزَّ وَ لَا تَصِلُ وَلَايَةٌ إِلَى اللَّهِ عَزَّ وَ جَلَّ إِلَّا بِهِمْ فَمَنْ فَعَلَ ذَلِكَ كَانَ حَقّاً عَلَى اللَّهِ أَنْ يُكْرِمَهُ وَ لَا يُعَذِّبَهُ وَ مَنْ يَأْتِ اللَّهَ عَزَّ وَ جَلَّ بِغَيْرِ مَا أَمَرَهُ كَانَ حَقّاً عَلَى اللَّهِ عَزَّ وَ جَلَّ أَنْ يُذِلَّهُ وَ أَنْ يُعَذِّبَهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473203\">H 14540</a> – Ali Bin Ibrahim, from his father, from Al-Hassan Bin Mahboub, from Muhammad Bin Al-Fuzeyl, from Abu Hamza, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> having said that: ‘Allah<sup>azwj</sup> Blessed and High Covenanted to Adam<sup>as</sup> that he<sup>as</sup> would not go near the tree. When the time came which was in the Knowledge of Allah<sup>azwj</sup>, he<sup>as</sup> ate from it. He<sup>as</sup> ate from it in forgetfulness and it is the Statement of Allah<sup>azwj</sup>: <span class=\"ibTxt\">“<a href=\"/#/books/quran:20#h115\">[20:115]</a> And certainly We gave a commandment to Adam before, but he forgot; and We did not find in him any determination”</span>. So when Adam<sup>as</sup> ate from the tree, he<sup>as</sup> came to the earth. There were born to him<sup>as</sup> Habeel<sup>as</sup> and his<sup>as</sup> sister as twins, and there were born to him<sup>as</sup> Qabeel<sup>la</sup> and his<sup>la</sup> sister as twins’.",
            "Adam<sup>as</sup> ordered Habeel<sup>as</sup> and Qabeel<sup>la</sup> that they should make an offering. And Habeel<sup>as</sup> was a shepherd and Qabeel<sup>la</sup> was a farmer. Habeel<sup>as</sup> presented a ram from the best of his<sup>as</sup> sheep, and Qabeel presented from his farm what had not ripened yet. So the offering of Habeel<sup>as</sup> was Accepted and the offering of Qabeel<sup>lar</sup> was not Accepted, and it is the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:5#h27\">[5:27]</a> And relate to them the story of the two sons of Adam with truth when they both offered an offering, but it was accepted from one of them and was not accepted from the other”</span> up to the end of the Verse. And it was that the offering was consumed by the Fire. So Qabeel<sup>la</sup> resorted to the Fire and built for it a house and it was the first of the houses to be built for the fire. He<sup>la</sup> said, ‘I<sup>la</sup> will worship this fire until my<sup>la</sup> offering is Accepted from me<sup>la</sup>’.",
            "Then Iblees<sup>la</sup> came to him<sup>la</sup> and he<sup>la</sup> used to flow in the son of Adam<sup>la</sup> like the flowing of blood in the veins. So he<sup>la</sup> said to him<sup>la</sup>, ‘O Qabeel<sup>la</sup>! The offering of Habeel<sup>as</sup> has been Accepted whilst your<sup>la</sup> offering has not been Accepted, and if you<sup>la</sup> were to leave him<sup>as</sup>, his<sup>as</sup> descendants would pride themselves over your<sup>la</sup> descendants and they will be saying to them, ‘We are the descendants of the one<sup>as</sup> whose offering was Accepted’. So kill him<sup>as</sup> so that he<sup>as</sup> would not have descendants to be able to gloat over your<sup>la</sup> descendants’. So he<sup>la</sup> killed him<sup>as</sup>. When Qabeel<sup>la</sup> returned to Adam<sup>as</sup>, he<sup>as</sup> said to him<sup>la</sup>: ‘O Qabeel<sup>la</sup>, where is Habeel<sup>as</sup>?’ He<sup>la</sup> said, ‘Seek him<sup>as</sup> where we offered the offerings’. So Adam<sup>as</sup> went and found Habeel<sup>la</sup> murdered. Adam<sup>as</sup> said: ‘Curse be upon the land which accepted the blood of Habeel<sup>as</sup>. And Adam<sup>as</sup> wept upon Habeel<sup>as</sup> for forty nights.",
            "Then Adam<sup>as</sup> asked his<sup>as</sup> Lord<sup>azwj</sup> for a son. So a boy was born to him<sup>as</sup> and he<sup>as</sup> named him<sup>as</sup> as Hibbat Allah<a id=\"_ftnref14\"></a><sup>[14]</sup> (Gift of Allah<sup>azwj</sup>) because Allah<sup>azwj</sup> Gifted him<sup>as</sup> to him<sup>as</sup>, and his<sup>as</sup> sister as twins. So when the Prophet-hood of Adam<sup>as</sup> came to an end, and his<sup>as</sup> days were complete, Allah<sup>azwj</sup> Revealed unto him<sup>as</sup>: “O Adam<sup>as</sup>! Your<sup>as</sup> Prophet-hood has ended and your<sup>as</sup> days are completed, so make the Knowledge which is in your<sup>as</sup> possession, and the Belief, and the Great Name, and the inheritance of the Knowledge, and the effects of Knowledge of the Prophet-hood to be in your<sup>as</sup> descendants to be in the possession of Hibbat Allah<sup>as</sup>, for I<sup>azwj</sup> will never Cut off the Knowledge, and the Belief, and the Great Name, and the effects of the Prophet-hood from your<sup>as</sup> progeny up to the Day of Judgement, and will never Leave the earth except that there will be in it a knowledgeable one by whom My<sup>azwj</sup> Religion would be recognised, and obedience to Me<sup>azwj</sup> would be recognised, and salvation would lie in the ones born between you<sup>as</sup> and between Noah<sup>as</sup>”. ",
            "And Adam<sup>as</sup> gave him<sup>as</sup> the good news of Noah<sup>as</sup> so he<sup>as</sup> said: ‘Allah<sup>azwj</sup> will be Sending a Prophet<sup>as</sup> whose name is Noah<sup>as</sup> and he<sup>as</sup> would call to Allah<sup>azwj</sup> is His<sup>azwj</sup> Mention, but his<sup>as</sup> people would belie him<sup>as</sup>. So Allah<sup>azwj</sup> would Destroy them by the storm’. And in between Adam<sup>as</sup> and Noah<sup>as</sup> were altogether ten generations of Prophets<sup>as</sup> and successors<sup>as</sup>. And Adam<sup>as</sup> bequeathed to Hibbat Allah<sup>as</sup> that: ‘The ones among you<sup>as</sup> who would meet him<sup>as</sup> should believe in him<sup>as</sup>, and follow him<sup>as</sup>, and ratify him<sup>as</sup> for he<sup>as</sup> would save you from drowning (loosing faith)’.",
            "Then Adam<sup>as</sup> became ill with an illness in which he<sup>as</sup> passed away, so he<sup>as</sup> sent for Hibbat Allah<sup>as</sup> and said to him<sup>as</sup>: ‘If you meet Jibraeel or meet any of the Angels, so covey greetings from me<sup>as</sup> and say to him: ‘O Jibraeel, my<sup>as</sup> father<sup>as</sup> will be guiding you from the fruits of the Paradise’. Jibraeel said to him<sup>as</sup>: ‘O Hibbat Allah<sup>as</sup>, your<sup>as</sup> father<sup>as</sup> has been Captured (passed away) and we are descending to Pray on him<sup>as</sup>, so return’. He<sup>as</sup> returned and found Adam<sup>as</sup> to have passed away. Jibraeel showed him<sup>as</sup> how to wash him<sup>as</sup>. So he<sup>as</sup> washed him<sup>as</sup> until when he<sup>as</sup> came to Pray over him<sup>as</sup>. Hibbat Allah<sup>as</sup> said: ‘O Jibraeel, go forward and Pray over Adam<sup>as</sup>’. Jibraeel said to him<sup>as</sup>: ‘Verily Allah<sup>azwj</sup> has Commanded us that we should prostrate to your<sup>as</sup> father<sup>as</sup> whilst he<sup>as</sup> was in the Paradise, so it is not for us to lead anyone from his<sup>as</sup> sons’. So Hibbat Allah<sup>as</sup> led the Prayed over his<sup>as</sup> father and Jibraeel and the army of the Angels were behind him<sup>as</sup> and Exclaimed Takbeer over him<sup>as</sup> thirty times. So Jibraeel was ordered (to announce) for twenty-five exclamations of Takbeer to be lifted from it and the Sunnah of today is of five Takbeers, whilst the exclamations (Takbeers) over the people of Badr were nine and seven’.",
            "Thereafter, when Hibbat Allah<sup>as</sup> had buried his<sup>as</sup> father<sup>as</sup>, Qabeel<sup>la</sup> came up to him<sup>as</sup> and said, ‘O Hibbat Allah<sup>as</sup>! I have seen my<sup>la</sup> father<sup>as</sup> that he<sup>as</sup> had specialised you<sup>as</sup> with the Knowledge by what he<sup>as</sup> had not specialised me<sup>la</sup> with, and it was the Knowledge by which your<sup>as</sup> brother<sup>as</sup> Habeel<sup>as</sup> had supplicated by. So his<sup>as</sup> offering was Accepted, therefore I<sup>la</sup> killed him<sup>as</sup> so that his<sup>as</sup> descendants would not be able to gloat over my<sup>la</sup> descendants by saying, ‘We are the sons of the one<sup>as</sup> whose offering was Accepted whilst you are the sons of the one<sup>lar</sup> whose offering was unsuccessful’. So if you<sup>as</sup> were to display anything from the Knowledge which your<sup>as</sup> father<sup>as</sup> has specialised you<sup>as</sup> with, I<sup>la</sup> will kill you<sup>as</sup> just like I<sup>la</sup> killed your<sup>as</sup> brother Habeel<sup>as</sup>’.",
            "So Hibbat Allah<sup>as</sup> and the descendants from him<sup>as</sup> continued with what was in their possession, in a fearful (observing Taqeeya<a id=\"_ftnref15\"></a><sup>[15]</sup>) manner, the Knowledge, and the Belief, and the Great Name, and the inheritance of the Prophet-hood, and the effect of Knowledge of the Prophet-hood until Allah<sup>azwj</sup> Sent Noah<sup>as</sup> and the will of Hibbat Allah<sup>as</sup> was displayed. When they (the descendants) look in the bequest of Adam<sup>as</sup> they found Noah<sup>as</sup> as a Prophet<sup>as</sup> the good news which Adam<sup>as</sup> had given them of. So they believed in him<sup>as</sup>, and followed him<sup>as</sup> and ratified him<sup>as</sup>.",
            "And Adam<sup>as</sup> had bequeathed to Hibbat Allah<sup>as</sup> that he<sup>as</sup> should frequently refer to the will during the start of every year and make it to be a day of Eid for them. They did that during the era of Noah<sup>as</sup> and the time of his<sup>as</sup> coming out and that is what has come in the will of every Prophet<sup>as</sup> until Allah<sup>azwj</sup> Sent Muhammad<sup>saww</sup>, and they recognised Noah<sup>as</sup> by the Knowledge which was in their possession, and it is the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:11#h25\">[11:25]</a> And certainly We sent Nuh to his people”</span> up to the end of the Verse. And there were in between Adam<sup>as</sup> and Noah<sup>as</sup>, Prophets<sup>as</sup> who were in hiding and it is for that reason their<sup>as</sup> mention is hidden in the Quran. So they<sup>as</sup> have not been named as have been named the proclaimed Prophets<sup>as</sup>, greetings be upon all of them<sup>as</sup>, and it is the Statement of Allah<sup>azwj</sup>; <span class=\"ibTxt\">“<a href=\"/#/books/quran:4#h164\">[4:164]</a> And (We sent) Rasools We have mentioned to you before and Rasools we have not mentioned to you”</span>, meaning the hidden ones from the Prophets<sup>as</sup> have not been named as the proclaimed ones have been named.",
            "Noah<sup>as</sup> lived among his<sup>as</sup> people for a thousand years less fifty (950) years. He<sup>as</sup> did not associate anyone in his<sup>as</sup> Prophet-hood for he<sup>as</sup> had come to a people who had rejected the Prophets<sup>as</sup> who were between him<sup>as</sup> and Adam<sup>as</sup> and that is the Statement of Allah<sup>azwj</sup>: <span class=\"ibTxt\">“<a href=\"/#/books/quran:26#h105\">[26:105]</a> The people of Nuh rejected the Rasools”</span>, meaning the ones<sup>as</sup> who were in between him<sup>as</sup> and Adam<sup>as</sup> to end in His<sup>azwj</sup> Statement, the Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:26#h191\">[26:191]</a> And most surely your Lord is Mighty, the Merciful”</span>. ",
            "So when the Prophet-hood of Noah<sup>as</sup> came to an end and his<sup>as</sup> days were completed, Allah<sup>azwj</sup> Revealed unto him<sup>as</sup> that: “O Noah<sup>as</sup>! Your<sup>as</sup> Prophet-hood has come to an end and your<sup>as</sup> days are completed, so make the Knowledge which is in your<sup>as</sup> possession, and the Belief, and the Great Name, and the inheritance of the Knowledge, and effects of Knowledge of the Prophet-hood, to be in the descendants from your<sup>as</sup> progeny, for I<sup>azwj</sup> will never Cut it off from the houses of the Prophets<sup>as</sup> which is your<sup>as</sup> house and between Adam<sup>as</sup>, and I<sup>azwj</sup> will never Leave the earth except that there will be in it a knowledgeable one by whom My<sup>azwj</sup> Religion would be recognised by, and obedience to Me<sup>azwj</sup> would be recognised by, and salvation would lie in the ones who are born during what is in between the Capture (passing away) of a Prophet<sup>as</sup> up to the coming out of another Prophet<sup>as</sup>.",
            "And Noah<sup>as</sup> gave the good news of Hud<sup>as</sup> to Saam<sup>as</sup> and there were Prophets<sup>as</sup> in between Noah<sup>as</sup> and Hud<sup>as</sup>. And Noah<sup>as</sup> said that Allah<sup>azwj</sup> will Send a Prophet<sup>as</sup> called Hud<sup>as</sup>, and he<sup>as</sup> would call his<sup>as</sup> people to Allah<sup>azwj</sup> Mighty and Majestic. They would belie him<sup>as</sup> and Allah<sup>azwj</sup> will Destroy them by the wind. So the ones among you who meet him<sup>as</sup> should believe in him<sup>as</sup>, and follow him<sup>as</sup> for Allah<sup>azwj</sup> would Rescue him from the Punishment of the wind. And Noah<sup>as</sup> ordered his<sup>as</sup> son<sup>as</sup> Sam<sup>as</sup> that he<sup>as</sup> should look at this bequest at the start of every year and make it to be a day of Eid for them.",
            "So they observed that which was in their possession from the Knowledge, and the belief, and the Great Name, and the inheritance of the knowledge, and effects of Knowledge of the Prophet-hood. They found Hud<sup>as</sup> as a Prophet<sup>as</sup> and their father Noah<sup>as</sup> had given them the good news of him<sup>as</sup> beforehand. So they believed in him<sup>as</sup>, and followed him<sup>as</sup>, and ratified him<sup>as</sup>, and were therefore Rescued from the Punishment of the wind, and it is the Statement of Allah<sup>azwj</sup>: <span class=\"ibTxt\">“<a href=\"/#/books/quran:7#h65\">[7:65]</a> And to Ad (We sent) their brother Hud”</span>, and the Statement of the Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:26#h123\">[26:123]</a> (The people of) A'ad denied the Rasools (of Allah). <a href=\"/#/books/quran:26#h124\">[26:124]</a> When their brother Hud said to them: Will you not guard (against evil)?”</span>, and the Blessed and High Said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:2#h132\">[2:132]</a> And the same did Ibrahim enjoin on his sons and (so did) Yaqoub”</span>, and His<sup>azwj</sup> Statement: <span class=\"ibTxt\">“<a href=\"/#/books/quran:6#h84\">[6:84]</a> And We gave to him Ishaq and Yaqoub </span>and Made it to be in his<sup>as</sup> Household <span class=\"ibTxt\">; each did We guide, and Nuh did We guide before,”</span> and Made it to be in his<sup>as</sup> Household, so the descendants of the Prophets<sup>as</sup> believed in them<sup>as</sup>, and those that lived before Ibrahim<sup>as</sup> believed in Ibrahim<sup>as</sup>.",
            "And there were Prophets<sup>as</sup> in between Ibrahim<sup>as</sup> and Hud<sup>as</sup> and it is the Statement of Allah<sup>azwj</sup>; <span class=\"ibTxt\">“<a href=\"/#/books/quran:11#h89\">[11:89]</a>, nor are the people of Lut far off from you”</span>, and His<sup>azwj</sup> Statement, Mighty is His<sup>azwj</sup> Mention: <span class=\"ibTxt\">“<a href=\"/#/books/quran:29#h26\">[29:26]</a> And Lut believed in Him, and he said: I am fleeing to my Lord”</span>, and the Statement of the Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:29#h16\">[29:16]</a> And (We sent) Ibrahim, when he said to his people: Serve Allah and be careful of (your duty to) Him; this is best for you, if you did but know”</span>. So there came in between every two Prophets<sup>as</sup>, ten, or nine, or eight Prophets<sup>as</sup>, and all of them were Prophets<sup>as</sup>, and there happened for every Prophet<sup>as</sup> what happened for Noah<sup>as</sup>, as is what had happened to Adam<sup>as</sup>, and Hud<sup>as</sup>, and Salih<sup>as</sup>, and Shuayb<sup>as</sup>, and Ibrahim<sup>as</sup> until it ended up to Yusuf Bin Yaqoub<sup>as</sup>.",
            "Then, from after Yusuf<sup>as</sup> it went to the grandsons until it ended up to Musa<sup>as</sup>. And there were Prophets<sup>as</sup> in between Yusuf<sup>as</sup> and Musa<sup>as</sup>. So Allah<sup>azwj</sup> Sent Musa<sup>as</sup> and Haroun<sup>as</sup> to Pharaoh<sup>la</sup>, and Hamaan<sup>la</sup>, and Qaroun<sup>la</sup>. <span class=\"ibTxt\">“<a href=\"/#/books/quran:23#h44\">[23:44]</a> Then We sent Our Rasools one after another; whenever there came to a people their Rasool, they called him a liar, so We made some of them follow others and We made them stories”</span>. And the Children of Israel killed a Prophet<sup>as</sup>, and if two were established they killed two, and four would be established, to the extent that sometimes they killed seventy Prophets<sup>as</sup> in one day, and they set up the market and killed them<sup>as</sup> at the end of the day.  ",
            "So when the Torah was Revealed unto Musa<sup>as</sup>, it gave the good News of Muhammad<sup>saww</sup>, and in between Yusuf<sup>as</sup> and Musa<sup>as</sup> were Prophets<sup>as</sup>. And Musa<sup>as</sup> had bequeathed to Yoshua bin Noon<sup>as</sup> and he<sup>as</sup> was the young man whom Allah<sup>azwj</sup> Mentioned in His<sup>azwj</sup> Book. The Prophets<sup>as</sup> never ceased to give the good News of Muhammad<sup>saww</sup> until Allah<sup>azwj</sup> Blessed and High Sent the Messiah Isa Bin Maryam<sup>as</sup>. So he<sup>as</sup> gave the good News of Muhammad<sup>saww</sup> and that is the Statement of the High: <span class=\"ibTxt\">“<a href=\"/#/books/quran:7#h157\">[7:157]</a> they find </span>meaning the Jews and the Christians <span class=\"ibTxt\">written down with them </span>meaning the description of Muhammad<sup>saww</sup> <span class=\"ibTxt\">in the Taurat and the Injeel (who) enjoins them good and forbids them evil,”</span> and it is the Statement of Allah<sup>azwj</sup>: <span class=\"ibTxt\">“<a href=\"/#/books/quran:61#h6\">[61:6]</a> And when Isa son of Marium said giving the good news of an Rasool who will come after me, his name being Ahmad,”</span>, and Musa<sup>as</sup> and Isa<sup>as</sup> gave the good news of Muhammad<sup>saww</sup> just as the Prophets<sup>as</sup> had given to one another until it reached Muhammad<sup>saww</sup>.",
            "So when the Prophet-hood of Muhammad<sup>saww</sup> came to an end, and his<sup>saww</sup> days were completed, Allah<sup>azwj</sup> Blessed and High Revealed unto him<sup>saww</sup>: “O Muhammad<sup>saww</sup>! Your<sup>saww</sup> Prophet-hood has come to an end and your<sup>saww</sup> days are completed, so make the Knowledge which is in your<sup>saww</sup> possession, and the Belief, and the Great Name, and inheritance of the Knowledge, and effects of Knowledge of the Prophet-hood to be in the People<sup>asws</sup> of your<sup>saww</sup> Household in the possession of Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, for I<sup>azwj</sup> will never Cut off the Knowledge, and the belief, and the Great Name, and inheritance of the Knowledge, and effects of Knowledge of the Prophet-hood from the descendants of your<sup>saww</sup> Progeny<sup>asws</sup> just as I<sup>azwj</sup> never Cut it off from the Houses of the Prophets<sup>as</sup> which were in between you<sup>saww</sup> and your<sup>saww</sup> father Adam<sup>as</sup>, and that is the Statement of Allah<sup>azwj</sup> Blessed and High: <span class=\"ibTxt\">“<a href=\"/#/books/quran:3#h33\">[3:33]</a> Surely Allah chose Adam and Nuh and the descendants of Ibrahim and the descendants of Imran above the nations <a href=\"/#/books/quran:3#h34\">[3:34]</a> Offspring one of the other; and Allah is Hearing, Knowing”</span>.",
            "And Allah<sup>azwj</sup> Blessed and High never Makes the Knowledge to be among the ignorant ones, and never Allocates His<sup>azwj</sup> Command to anyone from His<sup>azwj</sup> creatures, not even to an Angel of Proximity, and not to a ‘نَبِيٍّ مُرْسَلٍ’ Mursal Nabi<sup>as</sup>, but He<sup>azwj</sup> Sends Rasools from His<sup>azwj</sup> Angels and Said to him: “Say such and such”. So He<sup>azwj</sup> Commanded them with what He<sup>azwj</sup> Loves and Prohibited them from what He<sup>azwj</sup> Abhors. So He<sup>azwj</sup> Related to them the affairs of His<sup>azwj</sup> creatures by the Knowledge. So He<sup>azwj</sup> Taught that Knowledge, and Taught His<sup>azwj</sup> Prophets<sup>as</sup>, and His<sup>azwj</sup> and the specials ones from the Prophets<sup>as</sup>, and the brothers, and the descendants who were one from another, so that is the Statement of the Majestic and Mighty: <span class=\"ibTxt\">“<a href=\"/#/books/quran:4#h54\">[4:54]</a> But indeed We have given to Ibrahim's children the Book and the wisdom, and We have given them a grand kingdom”</span>.",
            "So, as for the Book, it is the Prophet-hood, and as for the Wisdom, so they<sup>as</sup> are the wise ones from the Prophets<sup>as</sup> from the elite, and as for the Great Kingdom, so they<sup>asws</sup> are the Imams<sup>asws</sup> of the guidance <span style=\"text-decoration: underline\">from the elite</span>, and all of these are from the descendants who were one from the other. ",
            "And the knowledgeable ones are the one whom Allah<sup>azwj</sup> has Made to be among them the remainders, and in them<sup>asws</sup> is the eventual end, and the preservation of the Covenant until the world comes to an end. And the knowledgeable ones and the Guardians of the Command (Wali Ul Amr) are the interpreters of the Knowledge and the guidance. So this is the Glory of the elite and the Rasools<sup>as</sup>, and the Prophets<sup>as</sup>, and the Wise ones, and the Imams<sup>asws</sup> of guidance, and the Caliphs who are the Guardians of the Command of Allah<sup>azwj</sup>, and the interpreters of the Knowledge of Allah<sup>azwj</sup>, and the people of the effects of the Knowledge of Allah<sup>azwj</sup> from the descendants who are one from another from the elite after the Prophets<sup>as</sup> from the fathers, and the brothers, and the descendants from the Prophets<sup>as</sup>. ",
            "So the ones who sought protection by the merit ended up with their<sup>as</sup> Knowledge and were rescued by their<sup>as</sup> help, and the ones who placed the Guardians of the Command of Allah<sup>azwj</sup> and the people of the interpretation (Istanbaat<a id=\"_ftnref16\"></a><sup>[16]</sup>) in others than the elites from the Houses of the Prophets<sup>as</sup> have opposed the Command of Allah<sup>azwj</sup>, and made the ignorant ones to be as the guardians of the command of Allah<sup>azwj</sup> (wali al-amr<a id=\"_ftnref17\"></a><sup>[17]</sup>), and the pretenders without guidance from Allah<sup>azwj</sup> and they claim that they are the ones who are the people of interpretation (Istanbaat) of the Knowledge of Allah<sup>azwj</sup>, so they have belied against Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>, and disregarded his<sup>saww</sup> successor<sup>asws</sup> and being obedient to him<sup>asws</sup>, and did not place the Preference of Allah<sup>azwj</sup> where Allah<sup>azwj</sup> Blessed and High had Placed it. So they went astray and led astray those who followed them, and there will be no argument for them on the Day of Judgement.",
            "But rather, the Proof is among the Progeny of Ibrahim<sup>as</sup> as is in the Statement of Allah<sup>azwj</sup>: <span class=\"ibTxt\">“<a href=\"/#/books/quran:4#h54\">[4:54]</a> But indeed We have given to Ibrahim's children the Book and the wisdom, and We have given them a grand kingdom”</span>. So the Proofs are the Prophets<sup>as</sup> and the People of the Household of the Prophets<sup>as</sup> until the Establishment of the Hour (Day of Judgement), because the Book of Allah<sup>azwj</sup> Speaks of that, the Will of Allah<sup>azwj</sup> some of them from the other which has been Placed upon the people, so the Mighty and Majestic Said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:24#h36\">[24:36]</a> In houses which Allah has permitted to be exalted”</span>, and these are the Houses of the Prophets<sup>as</sup>, and the Rasools<sup>as</sup>, and the Wise ones, and the Imams<sup>asws</sup> of Guidance. ",
            "So these is the explanation of the firm belief by which gained salvation the ones who were before you, and by it was the Rescued the ones who followed the Imams<sup>asws</sup>. And Allah<sup>azw</sup><sup>j</sup> Said in His<sup>azwj</sup> Book: <span class=\"ibTxt\">“<a href=\"/#/books/quran:6#h84\">[6:84]</a> And We gave to him Ishaq and Yaqoub; each did We guide, and Nuh did We guide before, and of his descendants, Dawood and Sulaiman and Ayub and Yusuf and Haroun; and thus do We reward those who do good (to others). <a href=\"/#/books/quran:6#h85\">[6:85]</a> And Zakariya and Yahya and Isa and Ilyas; every one was of the good <a href=\"/#/books/quran:6#h86\">[6:86]</a> And Ismail and Al-Yasha and Yunus and Lut; and every one We made to excel (in) the worlds <a href=\"/#/books/quran:6#h87\">[6:87]</a> And from among their fathers and their descendants and their brethren, and We chose them and guided them into the right way”</span>.",
            "<span class=\"ibTxt\">“<a href=\"/#/books/quran:6#h89\">[6:89]</a> These are they to whom We gave the book and the wisdom and the prophecy; therefore if these disbelieve in it We have already entrusted with it a people who are not disbelievers in it”</span>, for it has been Entrusted to the People from their<sup>as</sup> Household, and the brothers, and the descendants, and it is the Statement of Allah<sup>azwj</sup> Blessed and High that if your people were to deny it so He<sup>azwj</sup> has Entrusted it to the People<sup>asws</sup> of your<sup>saww</sup> Household with the Belief which He<sup>azwj</sup> Sent you<sup>saww</sup> with. So they will never deny it ever, and will not waste the Belief which you<sup>saww</sup> have been Sent with, the People<sup>asws</sup> of your<sup>saww</sup> Household from after you<sup>saww</sup>, the knowledgeable ones (Ulamaa) of your<sup>saww</sup> community, and the Guardians of My<sup>azwj</sup> Command (Wali Al-Amr) after you<sup>saww</sup>, and the people of the interpretation (Istinbaat) of the Knowledge in which there is lie, and no sin, and no forgery, and no arrogance, and no showing off. So this is the explanation of what ended up to him<sup>saww</sup> of the matters of the community.",
            "Allah<sup>azwj</sup> Purified the People<sup>asws</sup> of the Household of His<sup>azwj</sup> Prophet<sup>saww</sup>, and asked them (the people) for the recompense of the cordiality (Muwaddat), and Made the ‘Wilayah’ to flow for them<sup>asws</sup>, and Made them<sup>asws</sup> to be the successors<sup>asws</sup>, and His<sup>azwj</sup> Beloved ones. He<sup>saww</sup> Established it after him<sup>saww</sup> in his<sup>saww</sup> community: ‘O you people! Learn a lesson from what I<sup>saww</sup> am saying to you. The place where Allah<sup>azwj</sup> has Placed His<sup>azwj</sup> Wilayah, and obedience to Him<sup>azwj</sup>, and His<sup>azwj</sup> cordiality, and the interpretation of His<sup>azwj</sup> Knowledge, and His<sup>azwj</sup> Proofs, so these<sup>asws</sup> are the ones. So accept them<sup>asws</sup>, and attach yourselves to them<sup>asws</sup> in order to be Rescued by it, and it will become an argument for you on the Day of Judgement, and the Path of your Lord<sup>azwj</sup> Majestic and Mighty. And you cannot arrive to the Wilayah of Allah<sup>azwj</sup> except through them<sup>asws</sup>. ",
            "So the one who does that would have the right for Allah<sup>azwj</sup> to Honour him and not Punish him. And the one who comes to Allah<sup>azwj</sup> without what He<sup>azwj</sup> has Commanded for, would have become deserving for Allah<sup>azwj</sup> to Humiliate him and Punish him’."
          ],
          "en.sarwar": [
            "92. Ali Bin Ibrahim, from his father, from Al-Hassan Bin Mahboub, from Muhammad Bin Al-Fuzeyl, from Abu Hamza, who has said: Abu Ja’far (a.s.) having said that: ‘Allah (azwj) Blessed and High Covenanted to Adam (as) that he (as) would not go near the tree. When the time came which was in the Knowledge of Allah (azwj), he (as) ate from it. He (as) ate from it in forgetfulness and it is the Statement of Allah (azwj): “<a href=\"/#/books/quran:20#h115\">[20:115]</a> And certainly We gave a commandment to Adam before, but he forgot; and We did not find in him any determination”. So when Adam (as) ate from the tree, he (as) came to the earth. There were born to him (as) Habeel (as) and his (as) sister as twins, and there were born to him (as) Qabeel (la) and his (la) sister as twins’. Adam (as) ordered Habeel (as) and Qabeel (la) that they should make an offering. And Habeel (as) was a shepherd and Qabeel (la) was a farmer. Habeel (as) presented a ram from the best of his (as) sheep, and Qabeel presented from his farm what had not ripened yet. So the offering of Habeel (as) was Accepted and the offering of Qabeel (lar) was not Accepted, and it is the Statement of Allah (azwj) Mighty and Majestic: “<a href=\"/#/books/quran:5#h27\">[5:27]</a> And relate to them the story of the two sons of Adam with truth when they both offered an offering, but it was accepted from one of them and was not accepted from the other” up to the end of the Verse. And it was that the offering was consumed by the Fire. So Qabeel (la) resorted to the Fire and built for it a house and it was the first of the houses to be built for the fire. He (la) said, ‘I (la) will worship this fire until my (la) offering is Accepted from me (la)’. Then Iblees (la) came to him (la) and he (la) used to flow in the son of Adam (la) like the flowing of blood in the veins. So he (la) said to him (la), ‘O Qabeel (la)! The offering of Habeel (as) has been Accepted whilst your (la) offering has not been Accepted, and if you (la) were to leave him (as), his (as) descendants would pride themselves over your (la) descendants and they will be saying to them, ‘We are the descendants of the one (as) whose offering was Accepted’. So kill him (as) so that he (as) would not have descendants to be able to gloat over your (la) descendants’. So he (la) killed him (as). When Qabeel (la) returned to Adam (as), he (as) said to him (la): ‘O Qabeel (la), where is Habeel (as)?’ He (la) said, ‘Seek him (as) where we offered the offerings’. So Adam (as) went and found Habeel (la) murdered. Adam (as) said: ‘Curse be upon the land which accepted the blood of Habeel (as). And Adam (as) wept upon Habeel (as) for forty nights. Then Adam (as) asked his (as) Lord (azwj) for a son. So a boy was born to him (as) and he (as) named him (as) as Hibbat Allah (Gift of Allah (azwj)) because Allah (azwj) Gifted him (as) to him (as), and his (as) sister as twins. So when the Prophet-hood of Adam (as) came to an end, and his (as) days were complete, Allah (azwj) Revealed unto him (as): “O Adam (as)! Your (as) Prophet-hood has ended and your (as) days are completed, so make the Knowledge which is in your (as) possession, and the Belief, and the Great Name, and the inheritance of the Knowledge, and the effects of Knowledge of the Prophet-hood to be in your (as) descendants to be in the possession of Hibbat Allah (as), for I (azwj) will never Cut off the Knowledge, and the Belief, and the Great Name, and the effects of the Prophet-hood from your (as) progeny up to the Day of Judgement, and will never Leave the earth except that there will be in it a knowledgeable one by whom My (azwj) Religion would be recognised, and obedience to Me (azwj) would be recognised, and salvation would lie in the ones born between you (as) and between Noah (as)”. And Adam (as) gave him (as) the good news of Noah (as) so he (as) said: ‘Allah (azwj) will be Sending a Prophet (as) whose name is Noah (as) and he (as) would call to Allah (azwj) is His (azwj) Mention, but his (as) people would belie him (as). So Allah (azwj) would Destroy them by the storm’. And in between Adam (as) and Noah (as) were altogether ten generations of Prophets (as) and successors (as). And Adam (as) bequeathed to Hibbat Allah (as) that: ‘The ones among you (as) who would meet him (as) should believe in him (as), and follow him (as), and ratify him (as) for he (as) would save you from drowning (loosing faith)’. Then Adam (as) became ill with an illness in which he (as) passed away, so he (as) sent for Hibbat Allah (as) and said to him (as): ‘If you meet Jibraeel or meet any of the Angels, so covey greetings from me (as) and say to him: ‘O Jibraeel, my (as) father (as) will be guiding you from the fruits of the Paradise’. Jibraeel said to him (as): ‘O Hibbat Allah (as), your (as) father (as) has been Captured (passed away) and we are descending to Pray on him (as), so return’. He (as) returned and found Adam (as) to have passed away. Jibraeel showed him (as) how to wash him (as). So he (as) washed him (as) until when he (as) came to Pray over him (as). Hibbat Allah (as) said: ‘O Jibraeel, go forward and Pray over Adam (as)’. Jibraeel said to him (as): ‘Verily Allah (azwj) has Commanded us that we should prostrate to your (as) father (as) whilst he (as) was in the Paradise, so it is not for us to lead anyone from his (as) sons’. So Hibbat Allah (as) led the Prayed over his (as) father and Jibraeel and the army of the Angels were behind him (as) and Exclaimed Takbeer over him (as) thirty times. So Jibraeel was ordered (to announce) for twenty-five exclamations of Takbeer to be lifted from it and the Sunnah of today is of five Takbeers, whilst the exclamations (Takbeers) over the people of Badr were nine and seven’. Thereafter, when Hibbat Allah (as) had buried his (as) father (as), Qabeel (la) came up to him (as) and said, ‘O Hibbat Allah (as)! I have seen my (la) father (as) that he (as) had specialised you (as) with the Knowledge by what he (as) had not specialised me (la) with, and it was the Knowledge by which your (as) brother (as) Habeel (as) had supplicated by. So his (as) offering was Accepted, therefore I (la) killed him (as) so that his (as) descendants would not be able to gloat over my (la) descendants by saying, ‘We are the sons of the one (as) whose offering was Accepted whilst you are the sons of the one (lar) whose offering was unsuccessful’. So if you (as) were to display anything from the Knowledge which your (as) father (as) has specialised you (as) with, I (la) will kill you (as) just like I (la) killed your (as) brother Habeel (as)’. So Hibbat Allah (as) and the descendants from him (as) continued with what was in their possession, in a fearful (observing Taqeeya) manner, the Knowledge, and the Belief, and the Great Name, and the inheritance of the Prophet-hood, and the effect of Knowledge of the Prophet-hood until Allah (azwj) Sent Noah (as) and the will of Hibbat Allah (as) was displayed. When they (the descendants) look in the bequest of Adam (as) they found Noah (as) as a Prophet (as) the good news which Adam (as) had given them of. So they believed in him (as), and followed him (as) and ratified him (as). And Adam (as) had bequeathed to Hibbat Allah (as) that he (as) should frequently refer to the will during the start of every year and make it to be a day of Eid for them. They did that during the era of Noah (as) and the time of his (as) coming out and that is what has come in the will of every Prophet (as) until Allah (azwj) Sent Muhammad (saww), and they recognised Noah (as) by the Knowledge which was in their possession, and it is the Statement of Allah (azwj) Mighty and Majestic: “<a href=\"/#/books/quran:11#h25\">[11:25]</a> And certainly We sent Nuh to his people” up to the end of the Verse. And there were in between Adam (as) and Noah (as), Prophets (as) who were in hiding and it is for that reason their (as) mention is hidden in the Quran. So they (as) have not been named as have been named the proclaimed Prophets (as), greetings be upon all of them (as), and it is the Statement of Allah (azwj); “<a href=\"/#/books/quran:4#h164\">[4:164]</a> And (We sent) Rasools We have mentioned to you before and Rasools we have not mentioned to you”, meaning the hidden ones from the Prophets (as) have not been named as the proclaimed ones have been named. Noah (as) lived among his (as) people for a thousand years less fifty (950) years. He (as) did not associate anyone in his (as) Prophet-hood for he (as) had come to a people who had rejected the Prophets (as) who were between him (as) and Adam (as) and that is the Statement of Allah (azwj): “<a href=\"/#/books/quran:26#h105\">[26:105]</a> The people of Nuh rejected the Rasools”, meaning the ones (as) who were in between him (as) and Adam (as) to end in His (azwj) Statement, the Mighty and Majestic: “<a href=\"/#/books/quran:26#h191\">[26:191]</a> And most surely your Lord is Mighty, the Merciful”. So when the Prophet-hood of Noah (as) came to an end and his (as) days were completed, Allah (azwj) Revealed unto him (as) that: “O Noah (as)! Your (as) Prophet-hood has come to an end and your (as) days are completed, so make the Knowledge which is in your (as) possession, and the Belief, and the Great Name, and the inheritance of the Knowledge, and effects of Knowledge of the Prophet-hood, to be in the descendants from your (as) progeny, for I (azwj) will never Cut it off from the houses of the Prophets (as) which is your (as) house and between Adam (as), and I (azwj) will never Leave the earth except that there will be in it a knowledgeable one by whom My (azwj) Religion would be recognised by, and obedience to Me (azwj) would be recognised by, and salvation would lie in the ones who are born during what is in between the Capture (passing away) of a Prophet (as) up to the coming out of another Prophet (as). And Noah (as) gave the good news of Hud (as) to Saam (as) and there were Prophets (as) in between Noah (as) and Hud (as). And Noah (as) said that Allah (azwj) will Send a Prophet (as) called Hud (as), and he (as) would call his (as) people to Allah (azwj) Mighty and Majestic. They would belie him (as) and Allah (azwj) will Destroy them by the wind. So the ones among you who meet him (as) should believe in him (as), and follow him (as) for Allah (azwj) would Rescue him from the Punishment of the wind. And Noah (as) ordered his (as) son (as) Sam (as) that he (as) should look at this bequest at the start of every year and make it to be a day of Eid for them. So they observed that which was in their possession from the Knowledge, and the belief, and the Great Name, and the inheritance of the knowledge, and effects of Knowledge of the Prophet-hood. They found Hud (as) as a Prophet (as) and their father Noah (as) had given them the good news of him (as) beforehand. So they believed in him (as), and followed him (as), and ratified him (as), and were therefore Rescued from the Punishment of the wind, and it is the Statement of Allah (azwj): “<a href=\"/#/books/quran:7#h65\">[7:65]</a> And to Ad (We sent) their brother Hud”, and the Statement of the Mighty and Majestic: “<a href=\"/#/books/quran:26#h123\">[26:123]</a> (The people of) A’ad denied the Rasools (of Allah). <a href=\"/#/books/quran:26#h124\">[26:124]</a> When their brother Hud said to them: Will you not guard (against evil)?”, and the Blessed and High Said: “<a href=\"/#/books/quran:2#h132\">[2:132]</a> And the same did Ibrahim enjoin on his sons and (so did) Yaqoub”, and His (azwj) Statement: “<a href=\"/#/books/quran:6#h84\">[6:84]</a> And We gave to him Ishaq and Yaqoub and Made it to be in his (as) Household ; each did We guide, and Nuh did We guide before,” and Made it to be in his (as) Household, so the descendants of the Prophets (as) believed in them (as), and those that lived before Ibrahim (as) believed in Ibrahim (as). And there were Prophets (as) in between Ibrahim (as) and Hud (as) and it is the Statement of Allah (azwj); “<a href=\"/#/books/quran:11#h89\">[11:89]</a>, nor are the people of Lut far off from you”, and His (azwj) Statement, Mighty is His (azwj) Mention: “<a href=\"/#/books/quran:29#h26\">[29:26]</a> And Lut believed in Him, and he said: I am fleeing to my Lord”, and the Statement of the Mighty and Majestic: “<a href=\"/#/books/quran:29#h16\">[29:16]</a> And (We sent) Ibrahim, when he said to his people: Serve Allah and be careful of (your duty to) Him; this is best for you, if you did but know”. So there came in between every two Prophets (as), ten, or nine, or eight Prophets (as), and all of them were Prophets (as), and there happened for every Prophet (as) what happened for Noah (as), as is what had happened to Adam (as), and Hud (as), and Salih (as), and Shuayb (as), and Ibrahim (as) until it ended up to Yusuf Bin Yaqoub (as). Then, from after Yusuf (as) it went to the grandsons until it ended up to Musa (as). And there were Prophets (as) in between Yusuf (as) and Musa (as). So Allah (azwj) Sent Musa (as) and Haroun (as) to Pharaoh (la), and Hamaan (la), and Qaroun (la). “<a href=\"/#/books/quran:23#h44\">[23:44]</a> Then We sent Our Rasools one after another; whenever there came to a people their Rasool, they called him a liar, so We made some of them follow others and We made them stories”. And the Children of Israel killed a Prophet (as), and if two were established they killed two, and four would be established, to the extent that sometimes they killed seventy Prophets (as) in one day, and they set up the market and killed them (as) at the end of the day. So when the Torah was Revealed unto Musa (as), it gave the good News of Muhammad (saww), and in between Yusuf (as) and Musa (as) were Prophets (as). And Musa (as) had bequeathed to Yoshua bin Noon (as) and he (as) was the young man whom Allah (azwj) Mentioned in His (azwj) Book. The Prophets (as) never ceased to give the good News of Muhammad (saww) until Allah (azwj) Blessed and High Sent the Messiah Isa Bin Maryam (as). So he (as) gave the good News of Muhammad (saww) and that is the Statement of the High: “<a href=\"/#/books/quran:7#h157\">[7:157]</a> they find meaning the Jews and the Christians written down with them meaning the description of Muhammad (saww) in the Taurat and the Injeel (who) enjoins them good and forbids them evil,” and it is the Statement of Allah (azwj): “<a href=\"/#/books/quran:61#h6\">[61:6]</a> And when Isa son of Marium said giving the good news of an Rasool who will come after me, his name being Ahmad,”, and Musa (as) and Isa (as) gave the good news of Muhammad (saww) just as the Prophets (as) had given to one another until it reached Muhammad (saww). So when the Prophet-hood of Muhammad (saww) came to an end, and his (saww) days were completed, Allah (azwj) Blessed and High Revealed unto him (saww): “O Muhammad (saww)! Your (saww) Prophet-hood has come to an end and your (saww) days are completed, so make the Knowledge which is in your (saww) possession, and the Belief, and the Great Name, and inheritance of the Knowledge, and effects of Knowledge of the Prophet-hood to be in the People (a.s.) of your (saww) Household in the possession of Ali (a.s.) Bin Abu Talib (a.s.), for I (azwj) will never Cut off the Knowledge, and the belief, and the Great Name, and inheritance of the Knowledge, and effects of Knowledge of the Prophet-hood from the descendants of your (saww) Progeny (a.s.) just as I (azwj) never Cut it off from the Houses of the Prophets (as) which were in between you (saww) and your (saww) father Adam (as), and that is the Statement of Allah (azwj) Blessed and High: “<a href=\"/#/books/quran:3#h33\">[3:33]</a> Surely Allah chose Adam and Nuh and the descendants of Ibrahim and the descendants of Imran above the nations <a href=\"/#/books/quran:3#h34\">[3:34]</a> Offspring one of the other; and Allah is Hearing, Knowing”. And Allah (azwj) Blessed and High never Makes the Knowledge to be among the ignorant ones, and never Allocates His (azwj) Command to anyone from His (azwj) creatures, not even to an Angel of Proximity, and not to a ‘نَبِيٍّ مُرْسَلٍ’ Mursal Nabi (as), but He (azwj) Sends Rasools from His (azwj) Angels and Said to him: “Say such and such”. So He (azwj) Commanded them with what He (azwj) Loves and Prohibited them from what He (azwj) Abhors. So He (azwj) Related to them the affairs of His (azwj) creatures by the Knowledge. So He (azwj) Taught that Knowledge, and Taught His (azwj) Prophets (as), and His (azwj) and the specials ones from the Prophets (as), and the brothers, and the descendants who were one from another, so that is the Statement of the Majestic and Mighty: “<a href=\"/#/books/quran:4#h54\">[4:54]</a> But indeed We have given to Ibrahim’s children the Book and the wisdom, and We have given them a grand kingdom”. So, as for the Book, it is the Prophet-hood, and as for the Wisdom, so they (as) are the wise ones from the Prophets (as) from the elite, and as for the Great Kingdom, so they (a.s.) are the Imams (a.s.) of the guidance from the elite, and all of these are from the descendants who were one from the other. And the knowledgeable ones are the one whom Allah (azwj) has Made to be among them the remainders, and in them (a.s.) is the eventual end, and the preservation of the Covenant until the world comes to an end. And the knowledgeable ones and the Guardians of the Command (Wali Ul Amr) are the interpreters of the Knowledge and the guidance. So this is the Glory of the elite and the Rasools (as), and the Prophets (as), and the Wise ones, and the Imams (a.s.) of guidance, and the Caliphs who are the Guardians of the Command of Allah (azwj), and the interpreters of the Knowledge of Allah (azwj), and the people of the effects of the Knowledge of Allah (azwj) from the descendants who are one from another from the elite after the Prophets (as) from the fathers, and the brothers, and the descendants from the Prophets (as). So the ones who sought protection by the merit ended up with their (as) Knowledge and were rescued by their (as) help, and the ones who placed the Guardians of the Command of Allah (azwj) and the people of the interpretation (Istanbaat) in others than the elites from the Houses of the Prophets (as) have opposed the Command of Allah (azwj), and made the ignorant ones to be as the guardians of the command of Allah (azwj) (wali al-amr), and the pretenders without guidance from Allah (azwj) and they claim that they are the ones who are the people of interpretation (Istanbaat) of the Knowledge of Allah (azwj), so they have belied against Allah (azwj) and His (azwj) Rasool (saww), and disregarded his (saww) successor (a.s.) and being obedient to him (a.s.), and did not place the Preference of Allah (azwj) where Allah (azwj) Blessed and High had Placed it. So they went astray and led astray those who followed them, and there will be no argument for them on the Day of Judgement. But rather, the Proof is among the Progeny of Ibrahim (as) as is in the Statement of Allah (azwj): “<a href=\"/#/books/quran:4#h54\">[4:54]</a> But indeed We have given to Ibrahim’s children the Book and the wisdom, and We have given them a grand kingdom”. So the Proofs are the Prophets (as) and the People of the Household of the Prophets (as) until the Establishment of the Hour (Day of Judgement), because the Book of Allah (azwj) Speaks of that, the Will of Allah (azwj) some of them from the other which has been Placed upon the people, so the Mighty and Majestic Said: “<a href=\"/#/books/quran:24#h36\">[24:36]</a> In houses which Allah has permitted to be exalted”, and these are the Houses of the Prophets (as), and the Rasools (as), and the Wise ones, and the Imams (a.s.) of Guidance. So these is the explanation of the firm belief by which gained salvation the ones who were before you, and by it was the Rescued the ones who followed the Imams (a.s.). And Allah (azwj) Said in His (azwj) Book: “<a href=\"/#/books/quran:6#h84\">[6:84]</a> And We gave to him Ishaq and Yaqoub; each did We guide, and Nuh did We guide before, and of his descendants, Dawood and Sulaiman and Ayub and Yusuf and Haroun; and thus do We reward those who do good (to others). <a href=\"/#/books/quran:6#h85\">[6:85]</a> And Zakariya and Yahya and Isa and Ilyas; every one was of the good <a href=\"/#/books/quran:6#h86\">[6:86]</a> And Ismail and Al-Yasha and Yunus and Lut; and every one We made to excel (in) the worlds <a href=\"/#/books/quran:6#h87\">[6:87]</a> And from among their fathers and their descendants and their brethren, and We chose them and guided them into the right way”. “<a href=\"/#/books/quran:6#h89\">[6:89]</a> These are they to whom We gave the book and the wisdom and the prophecy; therefore if these disbelieve in it We have already entrusted with it a people who are not disbelievers in it”, for it has been Entrusted to the People from their (as) Household, and the brothers, and the descendants, and it is the Statement of Allah (azwj) Blessed and High that if your people were to deny it so He (azwj) has Entrusted it to the People (a.s.) of your (saww) Household with the Belief which He (azwj) Sent you (saww) with. So they will never deny it ever, and will not waste the Belief which you (saww) have been Sent with, the People (a.s.) of your (saww) Household from after you (saww), the knowledgeable ones (Ulamaa) of your (saww) community, and the Guardians of My (azwj) Command (Wali Al-Amr) after you (saww), and the people of the interpretation (Istinbaat) of the Knowledge in which there is lie, and no sin, and no forgery, and no arrogance, and no showing off. So this is the explanation of what ended up to him (saww) of the matters of the community. Allah (azwj) Purified the People (a.s.) of the Household of His (azwj) Prophet (saww), and asked them (the people) for the recompense of the cordiality (Muwaddat), and Made the ‘Wilayah’ to flow for them (a.s.), and Made them (a.s.) to be the successors (a.s.), and His (azwj) Beloved ones. He (saww) Established it after him (saww) in his (saww) community: ‘O you people! Learn a lesson from what I (saww) am saying to you. The place where Allah (azwj) has Placed His (azwj) Wilayah, and obedience to Him (azwj), and His (azwj) cordiality, and the interpretation of His (azwj) Knowledge, and His (azwj) Proofs, so these (a.s.) are the ones. So accept them (a.s.), and attach yourselves to them (a.s.) in order to be Rescued by it, and it will become an argument for you on the Day of Judgement, and the Path of your Lord (azwj) Majestic and Mighty. And you cannot arrive to the Wilayah of Allah (azwj) except through them (a.s.). So the one who does that would have the right for Allah (azwj) to Honour him and not Punish him. And the one who comes to Allah (azwj) without what He (azwj) has Commanded for, would have become deserving for Allah (azwj) to Humiliate him and Punish him’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 285)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14777,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:26:2",
        "relations": {
          "Mentions": [
            "/books/quran:21:30",
            "/books/quran:14:48",
            "/books/quran:43:45",
            "/books/quran:17:1"
          ]
        },
        "text": [
          "14541- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ أَبِي حَمْزَةَ ثَابِتِ بْنِ دِينَارٍ الثُّمَالِيِّ وَ أَبِي مَنْصُورٍ عَنْ أَبِي الرَّبِيعِ قَالَ حَجَجْنَا مَعَ أَبِي جَعْفَرٍ (عليه السلام) فِي السَّنَةِ الَّتِي كَانَ حَجَّ فِيهَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ وَ كَانَ مَعَهُ نَافِعٌ مَوْلَى عُمَرَ بْنِ الْخَطَّابِ فَنَظَرَ نَافِعٌ إِلَى أَبِي جَعْفَرٍ (عليه السلام) فِي رُكْنِ الْبَيْتِ وَ قَدِ اجْتَمَعَ عَلَيْهِ النَّاسُ فَقَالَ نَافِعٌ يَا أَمِيرَ الْمُؤْمِنِينَ مَنْ هَذَا الَّذِي قَدْ تَدَاكَّ عَلَيْهِ النَّاسُ فَقَالَ هَذَا نَبِيُّ أَهْلِ الْكُوفَةِ هَذَا مُحَمَّدُ بْنُ عَلِيٍّ فَقَالَ اشْهَدْ لآَتِيَنَّهُ فَلَأَسْأَلَنَّهُ عَنْ مَسَائِلَ لَا يُجِيبُنِي فِيهَا إِلَّا نَبِيٌّ أَوِ ابْنُ نَبِيٍّ أَوْ وَصِيُّ نَبِيٍّ قَالَ فَاذْهَبْ إِلَيْهِ وَ سَلْهُ لَعَلَّكَ تُخْجِلُهُ ",
          "فَجَاءَ نَافِعٌ حَتَّى اتَّكَأَ عَلَى النَّاسِ ثُمَّ أَشْرَفَ عَلَى أَبِي جَعْفَرٍ (عليه السلام) فَقَالَ يَا مُحَمَّدَ بْنَ عَلِيٍّ إِنِّي قَرَأْتُ التَّوْرَاةَ وَ الْإِنْجِيلَ وَ الزَّبُورَ وَ الْفُرْقَانَ وَ قَدْ عَرَفْتُ حَلَالَهَا وَ حَرَامَهَا وَ قَدْ جِئْتُ أَسْأَلُكَ عَنْ مَسَائِلَ لَا يُجِيبُ فِيهَا إِلَّا نَبِيٌّ أَوْ وَصِيُّ نَبِيٍّ أَوِ ابْنُ نَبِيٍّ قَالَ فَرَفَعَ أَبُو جَعْفَرٍ (عليه السلام) رَأْسَهُ فَقَالَ سَلْ عَمَّا بَدَا لَكَ فَقَالَ أَخْبِرْنِي كَمْ بَيْنَ عِيسَى وَ بَيْنَ مُحَمَّدٍ (صلى الله عليه وآله) مِنْ سَنَةٍ قَالَ أُخْبِرُكَ بِقَوْلِي أَوْ بِقَوْلِكَ قَالَ أَخْبِرْنِي بِالْقَوْلَيْنِ جَمِيعاً قَالَ أَمَّا فِي قَوْلِي فَخَمْسُمِائَةِ سَنَةٍ وَ أَمَّا فِي قَوْلِكَ فَسِتُّمِائَةِ سَنَةٍ ",
          "قَالَ فَأَخْبِرْنِي عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ لِنَبِيِّهِ وَ سْئَلْ مَنْ أَرْسَلْنا مِنْ قَبْلِكَ مِنْ رُسُلِنا أَ جَعَلْنا مِنْ دُونِ الرَّحْمنِ آلِهَةً يُعْبَدُونَ مَنِ الَّذِي سَأَلَ مُحَمَّدٌ (صلى الله عليه وآله) وَ كَانَ بَيْنَهُ وَ بَيْنَ عِيسَى خَمْسُمِائَةِ سَنَةٍ قَالَ فَتَلَا أَبُو جَعْفَرٍ (عليه السلام) هَذِهِ الْآيَةَ سُبْحانَ الَّذِي أَسْرى بِعَبْدِهِ لَيْلًا مِنَ الْمَسْجِدِ الْحَرامِ إِلَى الْمَسْجِدِ الْأَقْصَى الَّذِي بارَكْنا حَوْلَهُ لِنُرِيَهُ مِنْ آياتِنا فَكَانَ مِنَ الْآيَاتِ الَّتِي أَرَاهَا اللَّهُ تَبَارَكَ وَ تَعَالَى مُحَمَّداً (صلى الله عليه وآله) حَيْثُ أَسْرَى بِهِ إِلَى بَيْتِ الْمَقْدِسِ أَنْ حَشَرَ اللَّهُ عَزَّ ذِكْرُهُ الْأَوَّلِينَ وَ الْآخِرِينَ مِنَ النَّبِيِّينَ وَ الْمُرْسَلِينَ ثُمَّ أَمَرَ جَبْرَئِيلَ (عليه السلام) فَأَذَّنَ شَفْعاً وَ أَقَامَ شَفْعاً وَ قَالَ فِي أَذَانِهِ حَيَّ عَلَى خَيْرِ الْعَمَلِ ثُمَّ تَقَدَّمَ مُحَمَّدٌ (صلى الله عليه وآله) فَصَلَّى بِالْقَوْمِ فَلَمَّا انْصَرَفَ قَالَ لَهُمْ عَلَى مَا تَشْهَدُونَ وَ مَا كُنْتُمْ تَعْبُدُونَ قَالُوا نَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَنَّكَ رَسُولُ اللَّهِ أَخَذَ عَلَى ذَلِكَ عُهُودَنَا وَ مَوَاثِيقَنَا ",
          "فَقَالَ نَافِعٌ صَدَقْتَ يَا أَبَا جَعْفَرٍ فَأَخْبِرْنِي عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ أَ وَ لَمْ يَرَ الَّذِينَ كَفَرُوا أَنَّ السَّماواتِ وَ الْأَرْضَ كانَتا رَتْقاً فَفَتَقْناهُما قَالَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى لَمَّا أَهْبَطَ آدَمَ إِلَى الْأَرْضِ وَ كَانَتِ السَّمَاوَاتُ رَتْقاً لَا تَمْطُرُ شَيْئاً وَ كَانَتِ الْأَرْضُ رَتْقاً لَا تُنْبِتُ شَيْئاً فَلَمَّا أَنْ تَابَ اللَّهُ عَزَّ وَ جَلَّ عَلَى آدَمَ (عليه السلام) أَمَرَ السَّمَاءَ فَتَقَطَّرَتْ بِالْغَمَامِ ثُمَّ أَمَرَهَا فَأَرْخَتْ عَزَالِيَهَا ثُمَّ أَمَرَ الْأَرْضَ فَأَنْبَتَتِ الْأَشْجَارَ وَ أَثْمَرَتِ الثِّمَارَ وَ تَفَهَّقَتْ بِالْأَنْهَارِ فَكَانَ ذَلِكَ رَتْقَهَا وَ هَذَا فَتْقَهَا ",
          "قَالَ نَافِعٌ صَدَقْتَ يَا ابْنَ رَسُولِ اللَّهِ فَأَخْبِرْنِي عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ يَوْمَ تُبَدَّلُ الْأَرْضُ غَيْرَ الْأَرْضِ وَ السَّماواتُ أَيُّ أَرْضٍ تُبَدَّلُ يَوْمَئِذٍ فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) أَرْضٌ تَبْقَى خُبْزَةً يَأْكُلُونَ مِنْهَا حَتَّى يَفْرُغَ اللَّهُ عَزَّ وَ جَلَّ مِنَ الْحِسَابِ فَقَالَ نَافِعٌ إِنَّهُمْ عَنِ الْأَكْلِ لَمَشْغُولُونَ فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) أَ هُمْ يَوْمَئِذٍ أَشْغَلُ أَمْ إِذْ هُمْ فِي النَّارِ فَقَالَ نَافِعٌ بَلْ إِذْ هُمْ فِي النَّارِ قَالَ فَوَ اللَّهِ مَا شَغَلَهُمْ إِذْ دَعَوْا بِالطَّعَامِ فَأُطْعِمُوا الزَّقُّومَ وَ دَعَوْا بِالشَّرَابِ فَسُقُوا الْحَمِيمَ ",
          "قَالَ صَدَقْتَ يَا ابْنَ رَسُولِ اللَّهِ وَ لَقَدْ بَقِيَتْ مَسْأَلَةٌ وَاحِدَةٌ قَالَ وَ مَا هِيَ قَالَ أَخْبِرْنِي عَنِ اللَّهِ تَبَارَكَ وَ تَعَالَى مَتَى كَانَ قَالَ وَيْلَكَ مَتَى لَمْ يَكُنْ حَتَّى أُخْبِرَكَ مَتَى كَانَ سُبْحَانَ مَنْ لَمْ يَزَلْ وَ لَا يَزَالُ فَرْداً صَمَداً لَمْ يَتَّخِذْ صَاحِبَةً وَ لَا وَلَداً ",
          "ثُمَّ قَالَ يَا نَافِعُ أَخْبِرْنِي عَمَّا أَسْأَلُكَ عَنْهُ قَالَ وَ مَا هُوَ قَالَ مَا تَقُولُ فِي أَصْحَابِ النَّهْرَوَانِ فَإِنْ قُلْتَ إِنَّ أَمِيرَ الْمُؤْمِنِينَ قَتَلَهُمْ بِحَقٍّ فَقَدِ ارْتَدَدْتَ وَ إِنْ قُلْتَ إِنَّهُ قَتَلَهُمْ بَاطِلًا فَقَدْ كَفَرْتَ قَالَ فَوَلَّى مِنْ عِنْدِهِ وَ هُوَ يَقُولُ أَنْتَ وَ اللَّهِ أَعْلَمُ النَّاسِ حَقّاً حَقّاً فَأَتَى هِشَاماً فَقَالَ لَهُ مَا صَنَعْتَ قَالَ دَعْنِي مِنْ كَلَامِكَ هَذَا وَ اللَّهِ أَعْلَمُ النَّاسِ حَقّاً حَقّاً وَ هُوَ ابْنُ رَسُولِ اللَّهِ (صلى الله عليه وآله) حَقّاً وَ يَحِقُّ لِأَصْحَابِهِ أَنْ يَتَّخِذُوهُ نَبِيّاً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473204\">H 14541</a> – A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Al-Hassan Bin Mahboub, from Abu Hamza Sabit Bin Dinar Al-Thamaly and Abu Mansour, from Abu Al-Tabi’e who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-w\">‘W</span>e went on Pilgrimage</span> with Abu Ja’far<sup>asws</sup> in the year in which Hisham Abdul Malik was performing the Pilgrimage as well, and along with him was Nafa’u, the retainer of Umar Bin Al-Khattaab. So Nafa’u looked towards Abu Ja’far<sup>asws</sup> in the corner of the House and the people had gathered around him’. Nafa’u said, ‘O Commander of the Faithful, who is this one around whom the people have gathered?’ He said, ‘This is a Prophet of the people of Al-Kufa. This is Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>’. He said, ‘Be a witness for I shall ask him<sup>asws</sup> about certain matters that nobody can answer with regards to it except for a Prophet<sup>as</sup> or a son<sup>asws</sup> of a Prophet<sup>as</sup>, or a successor<sup>asws</sup> of a Prophet<sup>as</sup>’. He said, ‘So go ahead and ask him<sup>asws</sup>, perhaps you can embarrass him<sup>asws</sup>’.",
            "So Nafa’u came until he leaned upon the people, until he was higher than Abu Ja’far<sup>asws</sup>. He said, ‘O Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>! I have read the Torah, and the Evangel, and the Psalms, and the Furqaan (Quran), and have understood their Permissibles, and their Prohibitions, and I have come to ask you<sup>asws</sup> about certain matters that none can answer with regards to it except for a Prophet<sup>as</sup>, or a successor<sup>asws</sup> of a Prophet<sup>as</sup>, or son<sup>asws</sup> of a Prophet<sup>as</sup>’. He (the narrator) said, ‘Abu Ja’far<sup>asws</sup> raised his<sup>asws</sup> head and said; ‘Ask, or shall I<sup>asws</sup> begin for you?’ He said, ‘Inform me, how many years were there in between Isa<sup>as</sup> and Muhammad<sup>saww</sup>?’ He<sup>asws</sup> said: ‘Shall I<sup>asws</sup> inform you in accordance to your words or to mine<sup>asws</sup>?’ He said, ‘Inform me in accordance to both together’. He<sup>asws</sup> said: ‘In accordance to my<sup>asws</sup> words, so there were five hundred years, and in accordance to your words there were six hundred years’.",
            "He said, ‘So inform me about the Statement of Allah<sup>azwj</sup> Mighty and Majestic to His<sup>azwj</sup> Prophet<sup>saww</sup>: <span class=\"ibTxt\">“<a href=\"/#/books/quran:43#h45\">[43:45]</a> And ask those of Our Rasools whom We sent before you: Did We ever appoint gods to be worshipped besides the Beneficent Allah?”</span> who was the one that Muhammad<sup>saww</sup> asked since there were five hundred years in between him<sup>saww</sup> and Isa<sup>as</sup>?’ ",
            "Abu Ja’far<sup>asws</sup> said: ‘This is the Verse: <span class=\"ibTxt\">“<a href=\"/#/books/quran:17#h1\">[17:1]</a> Glory be to Him Who made His servant to go on a night from the Sacred Mosque to the remote mosque of which We have blessed the precincts, so that We may show to him some of Our signs; surely He is the Hearing, the Seeing”</span>, so Allah<sup>azwj</sup> Blessed and High Showed to Muhammad<sup>saww</sup> certain Signs when He<sup>azwj</sup> Made him<sup>saww</sup> to travel to the <span class=\"iTxt\">Bayt Al-Maqdas</span>, was that Allah<sup>azwj</sup> Mighty is His<sup>azwj</sup> Mention, Resurrected from the former ones and the later ones, Prophets<sup>as</sup> and Rasools<sup>as</sup>, then Commanded Jibraeel<sup>as</sup> to Call out the <span class=\"iTxt\">Adhaan</span> and the <span class=\"iTxt\">Iqamah</span>. ",
            "And he said in his <span class=\"iTxt\">Adhaan</span> “Hurry to the Best of the deeds” (Hayya Ala Khayr Al-Amal). Then Muhammad<sup>saww</sup> proceeded and Prayed with the people. When he<sup>saww</sup> had finished, he<sup>saww</sup> asked them: ‘What did you testify to and what did you worship?’ They replied, ‘We testified that there is no god except Allah<sup>azwj</sup>, One with no associates to Him<sup>azwj</sup>, and that you<sup>saww</sup> are the Rasool<sup>saww</sup> of Allah<sup>azwj</sup>, and it is upon that, that He<sup>azwj</sup> Took a Covenant from us and the Confirmation’. ",
            "So Nafa’u said, ‘You<sup>asws</sup> have spoken the truth, O Abu Ja’far<sup>asws</sup>! So Inform me about the Statement of Allah<sup>azwj</sup>: <span class=\"ibTxt\">“<a href=\"/#/books/quran:21#h30\">[21:30]</a> Do not those who disbelieve see that the heavens and the earth were closed up, but We have opened them”</span>. He<sup>asws</sup> said: ‘When Allah<sup>azwj</sup> Blessed and High Sent Adam<sup>as</sup> to the earth, and the skies were closed up and did not rain at all, and the earth was closed up and did not grow any vegetation. So when Allah<sup>azwj</sup> Accepted the repentance of Adam<sup>as</sup>, He<sup>azwj</sup> Commanded the sky, so it collected rain in the clouds. Then He<sup>azwj</sup> Commanded it, so it allowed it to fall. Then He<sup>azwj</sup> Commanded the earth, so it produced the trees, and the fruits, and the rivers flowed. So that is (what is meant by) ‘closed up’, and this is (what is meant by) ‘it opened up’’.",
            "Nafa’u said, ‘You<sup>asws</sup> had spoken the truth, O son<sup>asws</sup> of the Rasool<sup>saww</sup> of Allah<sup>azwj</sup>. So inform me about the Statement of Allah<sup>azwj</sup>: <span class=\"ibTxt\">“<a href=\"/#/books/quran:14#h48\">[14:48]</a> On the day when the earth shall be changed into a different earth, and the heavens (as well)”</span>. Which earth would it be replaced by on the Day?’ So Abu Ja’far<sup>asws</sup> said: ‘It will be the ground which would become edible, from which they will be eating until such time as Allah<sup>azwj</sup> has Completed the Accounting’. ",
            "Nafa’u said, ‘They would be busy (with the accounting) instead to eating’. So Abu Ja’far<sup>asws</sup> said: ‘Would they be busy on that Day or would they be in the Fire?’ Nafa’u said, ‘But they would be in the Fire’. He<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>, they would not be busy, it’s just that when they call for the food, so they will be fed the <span class=\"iTxt\">Zaqoom</span> (a tree in Hell), and they will call for drink and they will be quenched with <span class=\"iTxt\">Al-Hameem </span>(a river of Hell)’.",
            "He said, ‘You<sup>asws</sup> has spoken the truth, O son<sup>asws</sup> of the Rasool<sup>saww</sup> of Allah<sup>azwj</sup>, and there remains one question’. He<sup>asws</sup> said: ‘And what is that?’ He said, ‘Inform me about Allah<sup>azwj</sup> Blessed and High, when (did He<sup>azwj</sup> Exist) from?’ He<sup>asws</sup> said: ‘Woe be unto you. When was he<sup>azwj</sup> not from that I<sup>asws</sup> inform you when He<sup>azwj</sup> was from? Glory be to the One Who<sup>azwj</sup> always Was and will never cease to Be, Alone, Eternal, He<sup>azwj</sup> has not Taken any associate nor a son’. ",
            "Then he<sup>asws</sup> said: ‘O Nafa’u, inform me of what I<sup>asws</sup> ask you about’. He said, ‘And what is it?’ He<sup>asws</sup> said: ‘What do you say about the companions of Nahrwaan (a battle), for if you say that Amir-ul-Momineen<sup>asws</sup> killed them rightfully, therefore they were apostates, and if you were to say then he<sup>asws</sup> killed them wrongly, so you would have blasphemed’. He (the narrator) said, ‘He turned around from those that were with him, and he was saying, ‘By Allah<sup>azwj</sup>, you<sup>asws</sup> are truly the most knowledgeable of the people’. So he came to Hisham who asked, ‘What did you do?’ He said, ‘Leave me from your speech. By Allah<sup>azwj</sup>, this one<sup>asws</sup> is truly the most knowledgeable of the people, and he<sup>a</sup><sup>sws</sup> is truly the son<sup>asws</sup> of the Rasool<sup>saww</sup> of Allah<sup>azwj</sup>, and his<sup>asws</sup> companions are quite right in taking him<sup>asws</sup> as a Prophet<sup>as</sup>’."
          ],
          "en.sarwar": [
            "93. A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Al-Hassan Bin Mahboub, from Abu Hamza Sabit Bin Dinar Al-Thamaly and Abu Mansour, from Abu Al-Tabi’e who said: ‘We went on Pilgrimage with Abu Ja’far (a.s.) in the year in which Hisham Abdul Malik was performing the Pilgrimage as well, and along with him was Nafa’u, the retainer of Umar Bin Al-Khattaab. So Nafa’u looked towards Abu Ja’far (a.s.) in the corner of the House and the people had gathered around him’. Nafa’u said, ‘O Commander of the Faithful, who is this one around whom the people have gathered?’ He said, ‘This is a Prophet of the people of Al-Kufa. This is Muhammad (a.s.) Bin Ali (a.s.)’. He said, ‘Be a witness for I shall ask him (a.s.) about certain matters that nobody can answer with regards to it except for a Prophet (as) or a son (a.s.) of a Prophet (as), or a successor (a.s.) of a Prophet (as)’. He said, ‘So go ahead and ask him (a.s.), perhaps you can embarrass him (a.s.)’. So Nafa’u came until he leaned upon the people, until he was higher than Abu Ja’far (a.s.). He said, ‘O Muhammad (a.s.) Bin Ali (a.s.)! I have read the Torah, and the Evangel, and the Psalms, and the Furqaan (Quran), and have understood their Permissibles, and their Prohibitions, and I have come to ask you (a.s.) about certain matters that none can answer with regards to it except for a Prophet (as), or a successor (a.s.) of a Prophet (as), or son (a.s.) of a Prophet (as)’. He (the narrator) said, ‘Abu Ja’far (a.s.) raised his (a.s.) head and said; ‘Ask, or shall I (a.s.) begin for you?’ He said, ‘Inform me, how many years were there in between Isa (as) and Muhammad (saww)?’ He (a.s.) said: ‘Shall I (a.s.) inform you in accordance to your words or to mine (a.s.)?’ He said, ‘Inform me in accordance to both together’. He (a.s.) said: ‘In accordance to my (a.s.) words, so there were five hundred years, and in accordance to your words there were six hundred years’. He said, ‘So inform me about the Statement of Allah (azwj) Mighty and Majestic to His (azwj) Prophet (saww): “<a href=\"/#/books/quran:43#h45\">[43:45]</a> And ask those of Our Rasools whom We sent before you: Did We ever appoint gods to be worshipped besides the Beneficent Allah?” who was the one that Muhammad (saww) asked since there were five hundred years in between him (saww) and Isa (as)?’ Abu Ja’far (a.s.) said: ‘This is the Verse: “<a href=\"/#/books/quran:17#h1\">[17:1]</a> Glory be to Him Who made His servant to go on a night from the Sacred Mosque to the remote mosque of which We have blessed the precincts, so that We may show to him some of Our signs; surely He is the Hearing, the Seeing”, so Allah (azwj) Blessed and High Showed to Muhammad (saww) certain Signs when He (azwj) Made him (saww) to travel to the Bayt Al-Maqdas, was that Allah (azwj) Mighty is His (azwj) Mention, Resurrected from the former ones and the later ones, Prophets (as) and Rasools (as), then Commanded Jibraeel (as) to Call out the Adhaan and the Iqamah. And he said in his Adhaan “Hurry to the Best of the deeds” (Hayya Ala Khayr Al-Amal). Then Muhammad (saww) proceeded and Prayed with the people. When he (saww) had finished, he (saww) asked them: ‘What did you testify to and what did you worship?’ They replied, ‘We testified that there is no god except Allah (azwj), One with no associates to Him (azwj), and that you (saww) are the Rasool (saww) of Allah (azwj), and it is upon that, that He (azwj) Took a Covenant from us and the Confirmation’. So Nafa’u said, ‘You (a.s.) have spoken the truth, O Abu Ja’far (a.s.)! So Inform me about the Statement of Allah (azwj): “<a href=\"/#/books/quran:21#h30\">[21:30]</a> Do not those who disbelieve see that the heavens and the earth were closed up, but We have opened them”. He (a.s.) said: ‘When Allah (azwj) Blessed and High Sent Adam (as) to the earth, and the skies were closed up and did not rain at all, and the earth was closed up and did not grow any vegetation. So when Allah (azwj) Accepted the repentance of Adam (as), He (azwj) Commanded the sky, so it collected rain in the clouds. Then He (azwj) Commanded it, so it allowed it to fall. Then He (azwj) Commanded the earth, so it produced the trees, and the fruits, and the rivers flowed. So that is (what is meant by) ‘closed up’, and this is (what is meant by) ‘it opened up’’. Nafa’u said, ‘You (a.s.) had spoken the truth, O son (a.s.) of the Rasool (saww) of Allah (azwj). So inform me about the Statement of Allah (azwj): “<a href=\"/#/books/quran:14#h48\">[14:48]</a> On the day when the earth shall be changed into a different earth, and the heavens (as well)”. Which earth would it be replaced by on the Day?’ So Abu Ja’far (a.s.) said: ‘It will be the ground which would become edible, from which they will be eating until such time as Allah (azwj) has Completed the Accounting’. Nafa’u said, ‘They would be busy (with the accounting) instead to eating’. So Abu Ja’far (a.s.) said: ‘Would they be busy on that Day or would they be in the Fire?’ Nafa’u said, ‘But they would be in the Fire’. He (a.s.) said: ‘By Allah (azwj), they would not be busy, it’s just that when they call for the food, so they will be fed the Zaqoom (a tree in Hell), and they will call for drink and they will be quenched with Al-Hameem (a river of Hell)’. He said, ‘You (a.s.) has spoken the truth, O son (a.s.) of the Rasool (saww) of Allah (azwj), and there remains one question’. He (a.s.) said: ‘And what is that?’ He said, ‘Inform me about Allah (azwj) Blessed and High, when (did He (azwj) Exist) from?’ He (a.s.) said: ‘Woe be unto you. When was he (azwj) not from that I (a.s.) inform you when He (azwj) was from? Glory be to the One Who (azwj) always Was and will never cease to Be, Alone, Eternal, He (azwj) has not Taken any associate nor a son’. Then he (a.s.) said: ‘O Nafa’u, inform me of what I (a.s.) ask you about’. He said, ‘And what is it?’ He (a.s.) said: ‘What do you say about the companions of Nahrwaan (a battle), for if you say that Amir-ul-Momineen (a.s.) killed them rightfully, therefore they were apostates, and if you were to say then he (a.s.) killed them wrongly, so you would have blasphemed’. He (the narrator) said, ‘He turned around from those that were with him, and he was saying, ‘By Allah (azwj), you (a.s.) are truly the most knowledgeable of the people’. So he came to Hisham who asked, ‘What did you do?’ He said, ‘Leave me from your speech. By Allah (azwj), this one (a.s.) is truly the most knowledgeable of the people, and he (a.s.) is truly the son (a.s.) of the Rasool (saww) of Allah (azwj), and his (a.s.) companions are quite right in taking him (a.s.) as a Prophet (as)’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:26",
  "kind": "verse_list"
}