{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 27"
        },
        "path": "/books/al-kafi:8:1:27",
        "titles": {
          "ar": "حَدِيثُ نَصْرَانِيِّ الشَّامِ مَعَ الْبَاقِرِ (عليه السلام)",
          "en": "HADEETH OF THE SYRIAN CHRISTIAN WITH AL-BAQIR<sup>asws</sup>"
        }
      }
    ],
    "index": 2298,
    "local_index": 27,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 28"
        },
        "path": "/books/al-kafi:8:1:28",
        "titles": {
          "ar": "حَدِيثُ أَبِي الْحَسَنِ مُوسَى ( عليه السلام )",
          "en": "HADEETH OF ABU AL-HASSAN MUSA<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 26"
        },
        "path": "/books/al-kafi:8:1:26",
        "titles": {
          "ar": "حَدِيثُ آدَمَ ( عليه السلام ) مَعَ الشَّجَرَةِ",
          "en": "HADEETH OF ADAM<sup>as</sup> WITH THE TREE"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:27",
    "titles": {
      "ar": "حَدِيثُ نَصْرَانِيِّ الشَّامِ مَعَ الْبَاقِرِ (عليه السلام)",
      "en": "HADEETH OF THE SYRIAN CHRISTIAN WITH AL-BAQIR<sup>asws</sup>"
    },
    "verse_count": 1,
    "verse_start_index": 14777,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 292)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14778,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "14542- "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/226",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1947",
              "text": "إِسْمَاعِيلَ بْنِ أَبَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5957",
              "text": "عُمَرَ بْنِ عَبْدِ اللَّهِ الثَّقَفِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "14542- عَنْهُ عَنْ إِسْمَاعِيلَ بْنِ أَبَانٍ عَنْ عُمَرَ بْنِ عَبْدِ اللَّهِ الثَّقَفِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:27:1",
        "text": [
          " أَخْرَجَ هِشَامُ بْنُ عَبْدِ الْمَلِكِ أَبَا جَعْفَرٍ (عليه السلام) مِنَ الْمَدِينَةِ إِلَى الشَّامِ فَأَنْزَلَهُ مِنْهُ وَ كَانَ يَقْعُدُ مَعَ النَّاسِ فِي مَجَالِسِهِمْ فَبَيْنَا هُوَ قَاعِدٌ وَ عِنْدَهُ جَمَاعَةٌ مِنَ النَّاسِ يَسْأَلُونَهُ إِذْ نَظَرَ إِلَى النَّصَارَى يَدْخُلُونَ فِي جَبَلٍ هُنَاكَ فَقَالَ مَا لِهَؤُلَاءِ أَ لَهُمْ عِيدٌ الْيَوْمَ فَقَالُوا لَا يَا ابْنَ رَسُولِ اللَّهِ وَ لَكِنَّهُمْ يَأْتُونَ عَالِماً لَهُمْ فِي هَذَا الْجَبَلِ فِي كُلِّ سَنَةٍ فِي هَذَا الْيَوْمِ فَيُخْرِجُونَهُ فَيَسْأَلُونَهُ عَمَّا يُرِيدُونَ وَ عَمَّا يَكُونُ فِي عَامِهِمْ فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) وَ لَهُ عِلْمٌ فَقَالُوا هُوَ مِنْ أَعْلَمِ النَّاسِ قَدْ أَدْرَكَ أَصْحَابَ الْحَوَارِيِّينَ مِنْ أَصْحَابِ عِيسَى (عليه السلام) قَالَ فَهَلْ نَذْهَبُ إِلَيْهِ قَالُوا ذَاكَ إِلَيْكَ يَا ابْنَ رَسُولِ اللَّهِ ",
          "قَالَ فَقَنَّعَ أَبُو جَعْفَرٍ (عليه السلام) رَأْسَهُ بِثَوْبِهِ وَ مَضَى هُوَ وَ أَصْحَابُهُ فَاخْتَلَطُوا بِالنَّاسِ حَتَّى أَتَوُا الْجَبَلَ فَقَعَدَ أَبُو جَعْفَرٍ (عليه السلام) وَسْطَ النَّصَارَى هُوَ وَ أَصْحَابُهُ وَ أَخْرَجَ النَّصَارَى بِسَاطاً ثُمَّ وَضَعُوا الْوَسَائِدَ ثُمَّ دَخَلُوا فَأَخْرَجُوهُ ثُمَّ رَبَطُوا عَيْنَيْهِ فَقَلَّبَ عَيْنَيْهِ كَأَنَّهُمَا عَيْنَا أَفْعًى ثُمَّ قَصَدَ إِلَى أَبِي جَعْفَرٍ (عليه السلام) فَقَالَ يَا شَيْخُ أَ مِنَّا أَنْتَ أَمْ مِنَ الْأُمَّةِ الْمَرْحُومَةِ فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) بَلْ مِنَ الْأُمَّةِ الْمَرْحُومَةِ فَقَالَ أَ فَمِنْ عُلَمَائِهِمْ أَنْتَ أَمْ مِنْ جُهَّالِهِمْ فَقَالَ لَسْتُ مِنْ جُهَّالِهِمْ فَقَالَ النَّصْرَانِيُّ أَسْأَلُكَ أَمْ تَسْأَلُنِي فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) سَلْنِي فَقَالَ النَّصْرَانِيُّ يَا مَعْشَرَ النَّصَارَى رَجُلٌ مِنْ أُمَّةِ مُحَمَّدٍ يَقُولُ سَلْنِي إِنَّ هَذَا لَمَلِي‏ءٌ بِالْمَسَائِلِ ",
          "ثُمَّ قَالَ يَا عَبْدَ اللَّهِ أَخْبِرْنِي عَنْ سَاعَةٍ مَا هِيَ مِنَ اللَّيْلِ وَ لَا مِنَ النَّهَارِ أَيُّ سَاعَةٍ هِيَ فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) مَا بَيْنَ طُلُوعِ الْفَجْرِ إِلَى طُلُوعِ الشَّمْسِ فَقَالَ النَّصْرَانِيُّ فَإِذَا لَمْ تَكُنْ مِنْ سَاعَاتِ اللَّيْلِ وَ لَا مِنْ سَاعَاتِ النَّهَارِ فَمِنْ أَيِّ السَّاعَاتِ هِيَ فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) مِنْ سَاعَاتِ الْجَنَّةِ وَ فِيهَا تُفِيقُ مَرْضَانَا ",
          "فَقَالَ النَّصْرَانِيُّ فَأَسْأَلُكَ أَمْ تَسْأَلُنِي فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) سَلْنِي فَقَالَ النَّصْرَانِيُّ يَا مَعْشَرَ النَّصَارَى إِنَّ هَذَا لَمَلِي‏ءٌ بِالْمَسَائِلِ أَخْبِرْنِي عَنْ أَهْلِ الْجَنَّةِ كَيْفَ صَارُوا يَأْكُلُونَ وَ لَا يَتَغَوَّطُونَ أَعْطِنِي مَثَلَهُمْ فِي الدُّنْيَا فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) هَذَا الْجَنِينُ فِي بَطْنِ أُمِّهِ يَأْكُلُ مِمَّا تَأْكُلُ أُمُّهُ وَ لَا يَتَغَوَّطُ فَقَالَ النَّصْرَانِيُّ أَ لَمْ تَقُلْ مَا أَنَا مِنْ عُلَمَائِهِمْ فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) إِنَّمَا قُلْتُ لَكَ مَا أَنَا مِنْ جُهَّالِهِمْ ",
          "فَقَالَ النَّصْرَانِيُّ فَأَسْأَلُكَ أَوْ تَسْأَلُنِي فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) سَلْنِي فَقَالَ يَا مَعْشَرَ النَّصَارَى وَ اللَّهِ لَأَسْأَلَنَّهُ عَنْ مَسْأَلَةٍ يَرْتَطِمُ فِيهَا كَمَا يَرْتَطِمُ الْحِمَارُ فِي الْوَحْلِ فَقَالَ لَهُ سَلْ فَقَالَ أَخْبِرْنِي عَنْ رَجُلٍ دَنَا مِنِ امْرَأَتِهِ فَحَمَلَتْ بِاثْنَيْنِ حَمَلَتْهُمَا جَمِيعاً فِي سَاعَةٍ وَاحِدَةٍ وَ وَلَدَتْهُمَا فِي سَاعَةٍ وَاحِدَةٍ وَ مَاتَا فِي سَاعَةٍ وَاحِدَةٍ وَ دُفِنَا فِي قَبْرٍ وَاحِدٍ عَاشَ أَحَدُهُمَا خَمْسِينَ وَ مِائَةَ سَنَةٍ وَ عَاشَ الْآخَرُ خَمْسِينَ سَنَةً مَنْ هُمَا فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) عُزَيْرٌ وَ عَزْرَةُ كَانَا حَمَلَتْ أُمُّهُمَا بِهِمَا عَلَى مَا وَصَفْتَ وَ وَضَعَتْهُمَا عَلَى مَا وَصَفْتَ وَ عَاشَ عُزَيْرٌ وَ عَزْرَةُ كَذَا وَ كَذَا سَنَةً ثُمَّ أَمَاتَ اللَّهُ تَبَارَكَ وَ تَعَالَى عُزَيْراً مِائَةَ سَنَةٍ ثُمَّ بُعِثَ وَ عَاشَ مَعَ عَزْرَةَ هَذِهِ الْخَمْسِينَ سَنَةً وَ مَاتَا كِلَاهُمَا فِي سَاعَةٍ وَاحِدَةٍ ",
          "فَقَالَ النَّصْرَانِيُّ يَا مَعْشَرَ النَّصَارَى مَا رَأَيْتُ بِعَيْنِي قَطُّ أَعْلَمَ مِنْ هَذَا الرَّجُلِ لَا تَسْأَلُونِي عَنْ حَرْفٍ وَ هَذَا بِالشَّامِ رُدُّونِي قَالَ فَرَدُّوهُ إِلَى كَهْفِهِ وَ رَجَعَ النَّصَارَى مَعَ أَبِي جَعْفَرٍ (عليه السلام) "
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473206\">H 14542</a> – From him, from Ismail Bin Abaan, from Umar Bin Abdullah Al-Saqafy who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-h\">‘H</span>isham Bin Abdul Malik</span> made Abu Ja’far<sup>asws</sup> to go out from Al-Medina to Al-Shaam. He made him<sup>asws</sup> to stay in his accommodation, and he<sup>asws</sup> used to sit with the people in their gatherings. It so happened that he<sup>asws</sup> was sitting and in his<sup>asws</sup> presence was a group of people asking him, when he<sup>asws</sup> saw Christians entering inside a mountain over there. So he<sup>asws</sup> said: ‘What is with those, is it one of their festivities today?’ They said, ‘No, O son<sup>asws</sup> of the Rasool<sup>saww</sup> Allah<sup>azwj</sup>, but they are going to one of their scholars who (stays) inside this mountain all year long, and on this day he has come out. So they are asking him questions what they want and what is to happen in their year’. So Abu Ja’far<sup>asws</sup> said: ‘And he has knowledge?’ They said, ‘He is one of the most knowledgeable of the people. He has met the companions of the disciples of Isa<sup>as</sup>’. He<sup>asws</sup> said: ‘Shall we go to him?’ They said, ‘That is up to you<sup>asws</sup>, O son<sup>asws</sup> of the Rasool<sup>saww</sup> Allah<sup>azwj</sup>’.",
            "He (the narrator) said: ‘Abu Ja’far<sup>asws</sup> covered his<sup>asws</sup> head by his<sup>asws</sup> cloth, and went with his<sup>asws</sup> companions. He<sup>asw</sup><sup>s</sup> mingled with the Christians until he<sup>asws</sup> came to the mountain. Abu Ja’far<sup>asws</sup> sat down in the middle of the Christians along with his<sup>asws</sup> companions, and the Christians brought out a carpet and placed the pillows. Then they entered and brought him out with his eyes covered. His eyes stirred as if they were the eyes of a snake. Then he inadvertently turned towards Abu Ja’far<sup>asws</sup> and asked, ‘O Sheykh, where are you<sup>asws</sup> from, or are you<sup>asws</sup> from the Mercied community?’ So Abu Ja’far<sup>asws</sup> said: ‘But, I<sup>asws</sup> am from the Mercied community’. He said, ‘Are you<sup>asws</sup> from their knowledgeable ones or from their ignorant ones?’ He<sup>asws</sup> said: ‘I<sup>asws</sup> am not from the ignorant ones’. The Christian said, ‘Shall I ask you or you will ask me?’ Abu Ja’far said: ‘Ask me<sup>asws</sup>’. So the Christian said, ‘O group of Christians, a man from the community of Muhammad<sup>saww</sup> is saying, ‘Ask me!’. This one is full of answers’.",
            "Then he said, ‘O servant of Allah<sup>azwj</sup>, inform me about the hour which is neither from the night, nor from the day. Which hour is it?’ Abu Ja’far<sup>asws</sup> said: ‘That which is in between the dawn and sunrise’. So the Christian said, ‘So if it is neither an hour from the hours of the night, nor from the hours of the day, from which is it?’ Abu Ja’far<sup>asws</sup> said: ‘From the hours of the Paradise, and in which our patients are relieved (from pain). ",
            "So the Christian said, ‘Shall I ask you<sup>asws</sup> or will you ask me?’ Abu Ja’far<sup>asws</sup> said: ‘Ask me<sup>asws</sup>’. The Christian said, ‘O group of Christians, this one here is full of knowledge. Inform me about the inhabitants of the Paradise. How would they be eating but will not be excreting? Give me their example in the world’. So Abu Ja’far<sup>asws</sup> said: ‘The unborn (baby) which is in the womb of its mother eats from what its mother eats but does not excrete’. So the Christian said, ‘Did you not say, ‘I<sup>asws</sup> am not from the knowledgeable ones?’ Abu Ja’far<sup>asws</sup> said: ‘But rather, I<sup>asws</sup> said to you that I<sup>asws</sup> am not from the ignorant ones’.",
            "So the Christian said, ‘Shall I ask you<sup>asws</sup> or will you<sup>asws</sup> ask me?’ Abu Ja’far<sup>asws</sup> said: ‘Ask me<sup>asws</sup>’. He said, ‘O group of Christians! By Allah<sup>azwj</sup>, I will ask him about a matter which would bog him<sup>asws</sup> down just as the donkey gets bogged down in the mud’. He<sup>asws</sup> said to him: ‘Ask’. He said, ‘Inform me about a man who approached his woman, so she became pregnant with twins in the same one hour, and gave birth to both of them in the same one hour, and they both died in the same one hour, and were buried in the same one grave. One of them lived for one hundred and fifty years whilst the other one lived for fifty years. Who were those two?’ So Abu Ja’far<sup>asws</sup> said: ‘Uzayr and Uzrat. Their mother became pregnant with them both as you have described, and gave birth to both of them as you have described, and both Uzayr and Uzrat lived for such and such a time. Then Allah<sup>azwj</sup> Blessed and High Made Uzayr to die for a hundred years, then Resurrected him, and he lived with Uzrat for fifty years, and both of them died in the same one hour’.",
            "So the Christian said, ‘O group of Christians. I have not see with my eyes ever a more knowledgeable one than this man<sup>asws</sup>. Do not ask me about a single letter (anything at all) so long as this one is in Al-Shaam. Return me’. He (the narrator) said, ‘So they returned him to his cave, and the Christians returned with Abu Ja’far<sup>asws</sup>’. "
          ],
          "en.sarwar": [
            "94. From him, from Ismail Bin Abaan, from Umar Bin Abdullah Al-Saqafy who said: ‘Hisham Bin Abdul Malik made Abu Ja’far (a.s.) to go out from Al-Medina to Al-Shaam. He made him (a.s.) to stay in his accommodation, and he (a.s.) used to sit with the people in their gatherings. It so happened that he (a.s.) was sitting and in his (a.s.) presence was a group of people asking him, when he (a.s.) saw Christians entering inside a mountain over there. So he (a.s.) said: ‘What is with those, is it one of their festivities today?’ They said, ‘No, O son (a.s.) of the Rasool (saww) Allah (azwj), but they are going to one of their scholars who (stays) inside this mountain all year long, and on this day he has come out. So they are asking him questions what they want and what is to happen in their year’. So Abu Ja’far (a.s.) said: ‘And he has knowledge?’ They said, ‘He is one of the most knowledgeable of the people. He has met the companions of the disciples of Isa (as)’. He (a.s.) said: ‘Shall we go to him?’ They said, ‘That is up to you (a.s.), O son (a.s.) of the Rasool (saww) Allah (azwj)’. He (the narrator) said: ‘Abu Ja’far (a.s.) covered his (a.s.) head by his (a.s.) cloth, and went with his (a.s.) companions. He (a.s.) mingled with the Christians until he (a.s.) came to the mountain. Abu Ja’far (a.s.) sat down in the middle of the Christians along with his (a.s.) companions, and the Christians brought out a carpet and placed the pillows. Then they entered and brought him out with his eyes covered. His eyes stirred as if they were the eyes of a snake. Then he inadvertently turned towards Abu Ja’far (a.s.) and asked, ‘O Sheykh, where are you (a.s.) from, or are you (a.s.) from the Mercied community?’ So Abu Ja’far (a.s.) said: ‘But, I (a.s.) am from the Mercied community’. He said, ‘Are you (a.s.) from their knowledgeable ones or from their ignorant ones?’ He (a.s.) said: ‘I (a.s.) am not from the ignorant ones’. The Christian said, ‘Shall I ask you or you will ask me?’ Abu Ja’far said: ‘Ask me (a.s.)’. So the Christian said, ‘O group of Christians, a man from the community of Muhammad (saww) is saying, ‘Ask me!’. This one is full of answers’. Then he said, ‘O servant of Allah (azwj), inform me about the hour which is neither from the night, nor from the day. Which hour is it?’ Abu Ja’far (a.s.) said: ‘That which is in between the dawn and sunrise’. So the Christian said, ‘So if it is neither an hour from the hours of the night, nor from the hours of the day, from which is it?’ Abu Ja’far (a.s.) said: ‘From the hours of the Paradise, and in which our patients are relieved (from pain). So the Christian said, ‘Shall I ask you (a.s.) or will you ask me?’ Abu Ja’far (a.s.) said: ‘Ask me (a.s.)’. The Christian said, ‘O group of Christians, this one here is full of knowledge. Inform me about the inhabitants of the Paradise. How would they be eating but will not be excreting? Give me their example in the world’. So Abu Ja’far (a.s.) said: ‘The unborn (baby) which is in the womb of its mother eats from what its mother eats but does not excrete’. So the Christian said, ‘Did you not say, ‘I (a.s.) am not from the knowledgeable ones?’ Abu Ja’far (a.s.) said: ‘But rather, I (a.s.) said to you that I (a.s.) am not from the ignorant ones’. So the Christian said, ‘Shall I ask you (a.s.) or will you (a.s.) ask me?’ Abu Ja’far (a.s.) said: ‘Ask me (a.s.)’. He said, ‘O group of Christians! By Allah (azwj), I will ask him about a matter which would bog him (a.s.) down just as the donkey gets bogged down in the mud’. He (a.s.) said to him: ‘Ask’. He said, ‘Inform me about a man who approached his woman, so she became pregnant with twins in the same one hour, and gave birth to both of them in the same one hour, and they both died in the same one hour, and were buried in the same one grave. One of them lived for one hundred and fifty years whilst the other one lived for fifty years. Who were those two?’ So Abu Ja’far (a.s.) said: ‘Uzayr and Uzrat. Their mother became pregnant with them both as you have described, and gave birth to both of them as you have described, and both Uzayr and Uzrat lived for such and such a time. Then Allah (azwj) Blessed and High Made Uzayr to die for a hundred years, then Resurrected him, and he lived with Uzrat for fifty years, and both of them died in the same one hour’. So the Christian said, ‘O group of Christians. I have not see with my eyes ever a more knowledgeable one than this man (a.s.). Do not ask me about a single letter (anything at all) so long as this one is in Al-Shaam. Return me’. He (the narrator) said, ‘So they returned him to his cave, and the Christians returned with Abu Ja’far (a.s.)’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:27",
  "kind": "verse_list"
}