{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 28"
        },
        "path": "/books/al-kafi:8:1:28",
        "titles": {
          "ar": "حَدِيثُ أَبِي الْحَسَنِ مُوسَى ( عليه السلام )",
          "en": "HADEETH OF ABU AL-HASSAN MUSA<sup>asws</sup>"
        }
      }
    ],
    "index": 2299,
    "local_index": 28,
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:28",
    "titles": {
      "ar": "حَدِيثُ أَبِي الْحَسَنِ مُوسَى ( عليه السلام )",
      "en": "HADEETH OF ABU AL-HASSAN MUSA<sup>asws</sup>"
    },
    "verse_count": 1,
    "verse_start_index": 14778,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ف قوة الصحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 295)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14779,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:28:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14543</span>- عِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ مَنْصُورٍ الْخُزَاعِيِّ عَنْ عَلِيِّ بْنِ سُوَيْدٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ عَمِّهِ حَمْزَةَ بْنِ بَزِيعٍ عَنْ عَلِيِّ بْنِ سُوَيْدٍ وَ الْحَسَنُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ النَّهْدِيِّ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ مَنْصُورٍ عَنْ عَلِيِّ بْنِ سُوَيْدٍ قَالَ كَتَبْتُ إِلَى أَبِي الْحَسَنِ مُوسَى ( عليه السلام ) وَ هُوَ فِي الْحَبْسِ كِتَاباً أَسْأَلُهُ عَنْ حَالِهِ وَ عَنْ مَسَائِلَ كَثِيرَةٍ فَاحْتَبَسَ الْجَوَابُ عَلَيَّ أَشْهُراً ثُمَّ أَجَابَنِي بِجَوَابٍ هَذِهِ نُسْخَتُهُ ",
          "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ الْحَمْدُ لِلَّهِ الْعَلِيِّ الْعَظِيمِ الَّذِي بِعَظَمَتِهِ وَ نُورِهِ أَبْصَرَ قُلُوبَ الْمُؤْمِنِينَ وَ بِعَظَمَتِهِ وَ نُورِهِ عَادَاهُ الْجَاهِلُونَ وَ بِعَظَمَتِهِ وَ نُورِهِ ابْتَغَى مَنْ فِي السَّمَاوَاتِ وَ مَنْ فِي الْأَرْضِ إِلَيْهِ الْوَسِيلَةَ بِالْأَعْمَالِ الْمُخْتَلِفَةِ وَ الْأَدْيَانِ الْمُتَضَادَّةِ فَمُصِيبٌ وَ مُخْطِئٌ وَ ضَالٌّ وَ مُهْتَدٍ وَ سَمِيعٌ وَ أَصَمُّ وَ بَصِيرٌ وَ أَعْمَى حَيْرَانُ فَالْحَمْدُ لِلَّهِ الَّذِي عَرَفَ وَ وَصَفَ دِينَهُ مُحَمَّدٌ (صلى الله عليه وآله) ",
          "أَمَّا بَعْدُ فَإِنَّكَ امْرُؤٌ أَنْزَلَكَ اللَّهُ مِنْ آلِ مُحَمَّدٍ بِمَنْزِلَةٍ خَاصَّةٍ وَ حَفِظَ مَوَدَّةَ مَا اسْتَرْعَاكَ مِنْ دِينِهِ وَ مَا أَلْهَمَكَ مِنْ رُشْدِكَ وَ بَصَّرَكَ مِنْ أَمْرِ دِينِكَ بِتَفْضِيلِكَ إِيَّاهُمْ وَ بِرَدِّكَ الْأُمُورَ إِلَيْهِمْ كَتَبْتَ تَسْأَلُنِي عَنْ أُمُورٍ كُنْتُ مِنْهَا فِي تَقِيَّةٍ وَ مِنْ كِتْمَانِهَا فِي سَعَةٍ فَلَمَّا انْقَضَى سُلْطَانُ الْجَبَابِرَةِ وَ جَاءَ سُلْطَانُ ذِي السُّلْطَانِ الْعَظِيمِ بِفِرَاقِ الدُّنْيَا الْمَذْمُومَةِ إِلَى أَهْلِهَا الْعُتَاةِ عَلَى خَالِقِهِمْ رَأَيْتُ أَنْ أُفَسِّرَ لَكَ مَا سَأَلْتَنِي عَنْهُ مَخَافَةَ أَنْ يَدْخُلَ الْحَيْرَةُ عَلَى ضُعَفَاءِ شِيعَتِنَا مِنْ قِبَلِ جَهَالَتِهِمْ ",
          "فَاتَّقِ اللَّهَ عَزَّ ذِكْرُهُ وَ خُصَّ لِذَلِكَ الْأَمْرِ أَهْلَهُ وَ احْذَرْ أَنْ تَكُونَ سَبَبَ بَلِيَّةٍ عَلَى الْأَوْصِيَاءِ أَوْ حَارِشاً عَلَيْهِمْ بِإِفْشَاءِ مَا اسْتَوْدَعْتُكَ وَ إِظْهَارِ مَا اسْتَكْتَمْتُكَ وَ لَنْ تَفْعَلَ إِنْ شَاءَ اللَّهُ ",
          "إِنَّ أَوَّلَ مَا أُنْهِي إِلَيْكَ أَنِّي أَنْعَى إِلَيْكَ نَفْسِي فِي لَيَالِيَّ هَذِهِ غَيْرَ جَازِعٍ وَ لَا نَادِمٍ وَ لَا شَاكٍّ فِيمَا هُوَ كَائِنٌ مِمَّا قَدْ قَضَى اللَّهُ عَزَّ وَ جَلَّ وَ حَتَمَ فَاسْتَمْسِكْ بِعُرْوَةِ الدِّينِ آلِ مُحَمَّدٍ وَ الْعُرْوَةِ الْوُثْقَى الْوَصِيِّ بَعْدَ الْوَصِيِّ وَ الْمُسَالَمَةِ لَهُمْ وَ الرِّضَا بِمَا قَالُوا وَ لَا تَلْتَمِسْ دِينَ مَنْ لَيْسَ مِنْ شِيعَتِكَ وَ لَا تُحِبَّنَّ دِينَهُمْ فَإِنَّهُمُ الْخَائِنُونَ الَّذِينَ خَانُوا اللَّهَ وَ رَسُولَهُ وَ خَانُوا أَمَانَاتِهِمْ وَ تَدْرِي مَا خَانُوا أَمَانَاتِهِمُ ائْتُمِنُوا عَلَى كِتَابِ اللَّهِ فَحَرَّفُوهُ وَ بَدَّلُوهُ وَ دُلُّوا عَلَى وُلَاةِ الْأَمْرِ مِنْهُمْ فَانْصَرَفُوا عَنْهُمْ فَأَذَاقَهُمُ اللَّهُ لِبَاسَ الْجُوعِ وَ الْخَوْفِ بِمَا كَانُوا يَصْنَعُونَ ",
          "وَ سَأَلْتَ عَنْ رَجُلَيْنِ اغْتَصَبَا رَجُلًا مَالًا كَانَ يُنْفِقُهُ عَلَى الْفُقَرَاءِ وَ الْمَسَاكِينِ وَ أَبْنَاءِ السَّبِيلِ وَ فِي سَبِيلِ اللَّهِ فَلَمَّا اغْتَصَبَاهُ ذَلِكَ لَمْ يَرْضَيَا حَيْثُ غَصَبَاهُ حَتَّى حَمَّلَاهُ إِيَّاهُ كُرْهاً فَوْقَ رَقَبَتِهِ إِلَى مَنَازِلِهِمَا فَلَمَّا أَحْرَزَاهُ تَوَلَّيَا إِنْفَاقَهُ أَ يَبْلُغَانِ بِذَلِكَ كُفْراً فَلَعَمْرِي لَقَدْ نَافَقَا قَبْلَ ذَلِكَ وَ رَدَّا عَلَى اللَّهِ عَزَّ وَ جَلَّ كَلَامَهُ وَ هَزِئَا بِرَسُولِهِ ( صلى الله عليه وآله ) وَ هُمَا الْكَافِرَانِ عَلَيْهِمَا لَعْنَةُ اللَّهِ وَ الْمَلَائِكَةِ وَ النَّاسِ أَجْمَعِينَ وَ اللَّهِ مَا دَخَلَ قَلْبَ أَحَدٍ مِنْهُمَا شَيْ‏ءٌ مِنَ الْإِيمَانِ مُنْذُ خُرُوجِهِمَا مِنْ حَالَتَيْهِمَا وَ مَا ازْدَادَا إِلَّا شَكّاً كَانَا خَدَّاعَيْنِ مُرْتَابَيْنِ مُنَافِقَيْنِ حَتَّى تَوَفَّتْهُمَا مَلَائِكَةُ الْعَذَابِ إِلَى مَحَلِّ الْخِزْيِ فِي دَارِ الْمُقَامِ ",
          "وَ سَأَلْتَ عَمَّنْ حَضَرَ ذَلِكَ الرَّجُلَ وَ هُوَ يُغْصَبُ مَالُهُ وَ يُوضَعُ عَلَى رَقَبَتِهِ مِنْهُمْ عَارِفٌ وَ مُنْكِرٌ فَأُولَئِكَ أَهْلُ الرَّدَّةِ الْأُولَى مِنْ هَذِهِ الْأُمَّةِ فَعَلَيْهِمْ لَعْنَةُ اللَّهِ وَ الْمَلَائِكَةِ وَ النَّاسِ أَجْمَعِينَ ",
          "وَ سَأَلْتَ عَنْ مَبْلَغِ عِلْمِنَا وَ هُوَ عَلَى ثَلَاثَةِ وُجُوهٍ مَاضٍ وَ غَابِرٌ وَ حَادِثٌ فَأَمَّا الْمَاضِي فَمُفَسَّرٌ وَ أَمَّا الْغَابِرُ فَمَزْبُورٌ وَ أَمَّا الْحَادِثُ فَقَذْفٌ فِي الْقُلُوبِ وَ نَقْرٌ فِي الْأَسْمَاعِ وَ هُوَ أَفْضَلُ عِلْمِنَا وَ لَا نَبِيَّ بَعْدَ نَبِيِّنَا مُحَمَّدٍ (صلى الله عليه وآله) ",
          "وَ سَأَلْتَ عَنْ أُمَّهَاتِ أَوْلَادِهِمْ وَ عَنْ نِكَاحِهِمْ وَ عَنْ طَلَاقِهِمْ فَأَمَّا أُمَّهَاتُ أَوْلَادِهِمْ فَهُنَّ عَوَاهِرُ إِلَى يَوْمِ الْقِيَامَةِ نِكَاحٌ بِغَيْرِ وَلِيٍّ وَ طَلَاقٌ فِي غَيْرِ عِدَّةٍ وَ أَمَّا مَنْ دَخَلَ فِي دَعْوَتِنَا فَقَدْ هَدَمَ إِيمَانُهُ ضَلَالَهُ وَ يَقِينُهُ شَكَّهُ ",
          "وَ سَأَلْتَ عَنِ الزَّكَاةِ فِيهِمْ فَمَا كَانَ مِنَ الزَّكَاةِ فَأَنْتُمْ أَحَقُّ بِهِ لِأَنَّا قَدْ حَلَّلْنَا ذَلِكَ لَكُمْ مَنْ كَانَ مِنْكُمْ وَ أَيْنَ كَانَ ",
          "وَ سَأَلْتَ عَنِ الضُّعَفَاءِ فَالضَّعِيفُ مَنْ لَمْ يُرْفَعْ إِلَيْهِ حُجَّةٌ وَ لَمْ يَعْرِفِ الِاخْتِلَافَ فَإِذَا عَرَفَ الِاخْتِلَافَ فَلَيْسَ بِضَعِيفٍ ",
          "وَ سَأَلْتَ عَنِ الشَّهَادَاتِ لَهُمْ فَأَقِمِ الشَّهَادَةَ لِلَّهِ عَزَّ وَ جَلَّ وَ لَوْ عَلَى نَفْسِكَ وَ الْوَالِدَيْنِ وَ الْأَقْرَبِينَ فِيمَا بَيْنَكَ وَ بَيْنَهُمْ فَإِنْ خِفْتَ عَلَى أَخِيكَ ضَيْماً فَلَا وَ ادْعُ إِلَى شَرَائِطِ اللَّهِ عَزَّ ذِكْرُهُ بِمَعْرِفَتِنَا مَنْ رَجَوْتَ إِجَابَتَهُ وَ لَا تَحَصَّنْ بِحِصْنِ رِيَاءٍ وَ وَالِ آلَ مُحَمَّدٍ وَ لَا تَقُلْ لِمَا بَلَغَكَ عَنَّا وَ نُسِبَ إِلَيْنَا هَذَا بَاطِلٌ وَ إِنْ كُنْتَ تَعْرِفُ مِنَّا خِلَافَهُ فَإِنَّكَ لَا تَدْرِي لِمَا قُلْنَاهُ وَ عَلَى أَيِّ وَجْهٍ وَصَفْنَاهُ آمِنْ بِمَا أُخْبِرُكَ وَ لَا تُفْشِ مَا اسْتَكْتَمْنَاكَ مِنْ خَبَرِكَ ",
          "إِنَّ مِنْ وَاجِبِ حَقِّ أَخِيكَ أَنْ لَا تَكْتُمَهُ شَيْئاً تَنْفَعُهُ بِهِ لِأَمْرِ دُنْيَاهُ وَ آخِرَتِهِ وَ لَا تَحْقِدَ عَلَيْهِ وَ إِنْ أَسَاءَ وَ أَجِبْ دَعْوَتَهُ إِذَا دَعَاكَ وَ لَا تُخَلِّ بَيْنَهُ وَ بَيْنَ عَدُوِّهِ مِنَ النَّاسِ وَ إِنْ كَانَ أَقْرَبَ إِلَيْهِ مِنْكَ وَ عُدْهُ فِي مَرَضِهِ لَيْسَ مِنْ أَخْلَاقِ الْمُؤْمِنِينَ الْغِشُّ وَ لَا الْأَذَى وَ لَا الْخِيَانَةُ وَ لَا الْكِبْرُ وَ لَا الْخَنَا وَ لَا الْفُحْشُ وَ لَا الْأَمْرُ بِهِ فَإِذَا رَأَيْتَ الْمُشَوَّهَ الْأَعْرَابِيَّ فِي جَحْفَلٍ جَرَّارٍ فَانْتَظِرْ فَرَجَكَ وَ لِشِيعَتِكَ الْمُؤْمِنِينَ وَ إِذَا انْكَسَفَتِ الشَّمْسُ فَارْفَعْ بَصَرَكَ إِلَى السَّمَاءِ وَ انْظُرْ مَا فَعَلَ اللَّهُ عَزَّ وَ جَلَّ بِالْمُجْرِمِينَ فَقَدْ فَسَّرْتُ لَكَ جُمَلًا مُجْمَلًا وَ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ آلِهِ الْأَخْيَارِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473208\">H 14543</a> – A number of our companions, from Sahl Bin Ziyad, from Ismail Bin Mahraan, from Muhammad Bin Mansour Al-Khuzai’e, from Ali Bin Suweyd and Muhammad Bin Yahya, from Muhammad Bin Al-Husayn, from Muhammad Bin Ismail Bin Yazi’e, from his uncle Hamza bin Yazi’e, from Ali Bin Suweyd and Al-Hassan Biin Muhammad, from Muhammad Bin Ahmad Al-Nahdy, from Ismail Bin Mahraan, from Muhammad bin Mansour, from Ali Bin Suweyd who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> wrote to Abu Al-Hassan</span> Musa<sup>asws</sup> whilst he<sup>asws</sup> was in the solitary confinement. I wrote asking him<sup>asws</sup> about his<sup>asws</sup> condition and about numerous matters. The answer did not come for months, then he<sup>asws</sup> answered me by an answer and this is its copy: -",
            "In the Name of Allah<sup>azwj</sup> the Beneficent, the Merciful. Praise be to the High, the Magnificent. It is by His<sup>azwj</sup> Greatness and His<sup>azwj</sup> Light the hearts of the ‘الْمُؤْمِنِينَ’ (believers) achieve vision, and by His<sup>azwj</sup> Greatness and His<sup>azwj</sup> Light, (whereas) the ignorant ones are inimical to Him<sup>azwj</sup>, and by His<sup>azwj</sup> Greatness and His<sup>azwj</sup> Light crave the ones in the heavens and in the earth and to Him<sup>azwj</sup> is the Means by the different deeds and the contradictory Religions. So the rightful, and the mistaken, and the stray, and the guided, and the hearing, and the deaf, and the seeing, and the blind ones are perplexed. So the Praise Belongs to Allah<sup>azwj</sup> Whose Religion was recognised and described by Muhammad<sup>saww</sup>.",
            "Having said that, you are of the people whom Allah<sup>azwj</sup> has Blessed by Sending the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> (towards you and) and by special status, and Preserved the cordiality which attracted you to His<sup>azwj</sup> Religion, and what He<sup>azwj</sup> has Inspired from your guidance and your vision from the matters of your Religion that you give preference to them<sup>asws</sup> and are referring your matters to them<sup>asws</sup>. You wrote to me<sup>asws</sup> asking me<sup>asws</sup> about matters which I<sup>asws</sup> was observing dissimulation in and concealed them for a while. So when the authority of the tyrant passed by, and there came the authority of the One<sup>azwj</sup> with Great Authority, by my<sup>asws</sup> departing from the world which has been condemned by its inhabitants who have hardened themselves against their Creator, I<sup>asws</sup> saw that I<sup>asws</sup> could explain to you what you had asked me<sup>asws</sup> about, fearing that our<sup>asws</sup> weak Shiites may enter into confusion because of the ignorance which is in front of them.",
            "So fear Allah<sup>azwj</sup>, Mighty is His<sup>azwj</sup> Mention, and single out for these matters, its deserving ones, and be cautious that you should become a reason for the calamities against the successors<sup>asws</sup> or provoking (people) against them<sup>asws</sup> by publicising what I<sup>asws</sup> am entrusting you with and exposing what I<sup>asws</sup> have told you to conceal, and Allah<sup>azwj</sup> Willing, you will not do this.",
            "Firstly what I<sup>asws</sup> would like to inform you is that you should mourn for myself<sup>asws</sup> in this very night without remorse and no complaints, for what is to transpire is from what Allah<sup>azwj</sup> Mighty and Majestic has Ordained and is inevitable. So attach yourself to the Handle of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and the Firmest Handle of the successor<sup>asws</sup> after the successor<sup>asws</sup>, and the submission to them<sup>asws</sup> and be pleased with what they<sup>asws</sup> say, and do not seek Religion from the ones who are not from your Shiites, and do not love their Religion, for they are traitors who have betrayed Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>, and betrayed their trusts. And do you know how they betrayed their trusts? They were entrusted with the Book of Allah<sup>azwj</sup> so they distorted it and changed it, and evidenced it upon the rulers among them. So stay away from them. Allah<sup>azwj</sup> has Made them to Taste the clothing of the hunger, and the fear due to what they had done.",
            "And you asked about two men (Abu Bakr and Umar) who usurped the wealth of a man which he used to spend upon the poor and the needy and the traveller in need, and in the Way of Allah<sup>azwj</sup>. So when they usurped that, they were not happy until they made him carry it unwillingly upon his ride to their own homes. When they undertook to be in charge of its spending, and so reached infidelity by doing that. By my<sup>asws</sup> life, they had become hypocrites before that and rejected against Allah<sup>azwj</sup> His<sup>azwj</sup> Words, and mocked at His<sup>azwj</sup> Rasool<sup>saww</sup>, and they were both infidels. May Allah<sup>azwj</sup> Curse them, and the Angels, and the people altogether. ",
            "By Allah<sup>azwj</sup>, the ‘Eman’ (belief) did not enter into the heart of any one of them since their coming out from their condition (Kufr), and it did not increase them in anything except for doubts. They were deceivers, sceptical, hypocrites until they both died and the Angels of Punishment took them to the place of disgrace in the eternal abode.",
            "And you asked about those who were in the presence of that man whilst he was usurping his wealth and placed it upon his ride, and there were among them who knew about it and denied it. So those (Abu Bakr and Umar) are the first apostates from this community, and so may the Curse of Allah<sup>azwj</sup> and the Angels and all the people be upon them.",
            "And you asked about extent of our<sup>asws</sup> Knowledge, and it is upon three aspects. The past, and the future, and the newly recurring. So as for the past, it has been explained, and as for the future, it has been written down, and as for that which is newly occurring, so it gets imprinted upon the hearts, and resonated in the ears, and it is the highest of our<sup>asws</sup> Knowledge, and there is no Prophet<sup>as</sup> after our<sup>asws</sup> Prophet<sup>saww</sup>. ",
            "And you asked about the mothers of their children (the followers of those two), and about their marriages, and about their divorces. So, as for the mothers of their children, they are prostitutes up to the Day of Judgement, having married without a guardian (Wali’s consent), and going through divorces without (completing the) waiting periods. And as for the one who enters into our<sup>asws</sup> Invitation (call to Wilayah), so his ‘Eman’ demolishes his misguidance, and so does his ‘Yaqeen’ conviction (demolish) his doubts.",
            "And you asked about the Zakaat among them. So, there was nothing from the Zakaat (for them), as you are more deserving of it, because we<sup>asws</sup> have made that to be lawful for you, and those who are from you wherever they may be.",
            "And you asked about the weak. So the weak is the one who cannot argue against (the batil) and he does not understand the differences, for if he understands the difference, then he is not with the weakness.",
            "You asked about the ‘الشَّهَادَاتِ’ testimonies for them. So establish the testimony for the sake of Allah<sup>azwj</sup>, even if it is against your own-self, and the parents and the relatives in what is between you and them. So if you fear injustice against your brother, don’t (be part of it). And call to the Law of Allah<sup>azwj</sup>, as He<sup>azwj</sup> has (placed those) in our<sup>asws</sup> recognition (Ma’rifat). The one who hopes would be Answered and do not barricade yourself by the fort of hypocrisy. And befriend the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> and do not speak of what reaches you from us<sup>asws</sup>, and ascribe to us that ‘this is false’, and you may know something from us<sup>asws</sup> which is against it, for you do not know why we<sup>asws</sup> may have said it, and upon which perspective we may have described it. Believe in what I<sup>asws</sup> inform you<sup>asws</sup> and do not publicise what I<sup>asws</sup> have told you to conceal from what I<sup>asws</sup> inform you. ",
            "It is from the obligatory right of your brother that you do not conceal anything from him which might benefit him in the affairs of the world and the Hereafter. And do not hold a grudge against him and not to hurt him, and answer his call when he calls you and do not leave him alone between him and his enemies from the people even though they may be closer to you than him, and support him in his illness. ",
            "It is not from etiquettes of the ‘الْمُؤْمِنِينَ’ Believers, the defrauding, and the injuring, and the treachery, and the arrogance, and the vulgarities, and the immoralities, and the commanding for such things. So if you were to see the deformed Bedouin in legions (large armies), so wait for your relief (Al-Qaim<sup>asws</sup>), and for your Shiites, the believers, and when the sun rises, raise your vision to the sky and look at what Allah<sup>azwj</sup> has Done with the criminals. So I<sup>asws</sup> have explained to you all of this in summary. And send greetings upon Muhammad<sup>saww</sup> and his<sup>saww</sup> Progeny<sup>asws</sup>, the righteous’."
          ],
          "en.sarwar": [
            "95. A number of our companions, from Sahl Bin Ziyad, from Ismail Bin Mahraan, from Muhammad Bin Mansour Al-Khuzai’e, from Ali Bin Suweyd and Muhammad Bin Yahya, from Muhammad Bin Al-Husayn, from Muhammad Bin Ismail Bin Yazi’e, from his uncle Hamza bin Yazi’e, from Ali Bin Suweyd and Al-Hassan Biin Muhammad, from Muhammad Bin Ahmad Al-Nahdy, from Ismail Bin Mahraan, from Muhammad bin Mansour, from Ali Bin Suweyd who said: ‘I wrote to Abu Al-Hassan Musa (a.s.) whilst he (a.s.) was in the solitary confinement. I wrote asking him (a.s.) about his (a.s.) condition and about numerous matters. The answer did not come for months, then he (a.s.) answered me by an answer and this is its copy: - In the Name of Allah (azwj) the Beneficent, the Merciful. Praise be to the High, the Magnificent. It is by His (azwj) Greatness and His (azwj) Light the hearts of the ‘الْمُؤْمِنِينَ’ (believers) achieve vision, and by His (azwj) Greatness and His (azwj) Light, (whereas) the ignorant ones are inimical to Him (azwj), and by His (azwj) Greatness and His (azwj) Light crave the ones in the heavens and in the earth and to Him (azwj) is the Means by the different deeds and the contradictory Religions. So the rightful, and the mistaken, and the stray, and the guided, and the hearing, and the deaf, and the seeing, and the blind ones are perplexed. So the Praise Belongs to Allah (azwj) Whose Religion was recognised and described by Muhammad (saww). Having said that, you are of the people whom Allah (azwj) has Blessed by Sending the Progeny (a.s.) of Muhammad (saww) (towards you and) and by special status, and Preserved the cordiality which attracted you to His (azwj) Religion, and what He (azwj) has Inspired from your guidance and your vision from the matters of your Religion that you give preference to them (a.s.) and are referring your matters to them (a.s.). You wrote to me (a.s.) asking me (a.s.) about matters which I (a.s.) was observing dissimulation in and concealed them for a while. So when the authority of the tyrant passed by, and there came the authority of the One (azwj) with Great Authority, by my (a.s.) departing from the world which has been condemned by its inhabitants who have hardened themselves against their Creator, I (a.s.) saw that I (a.s.) could explain to you what you had asked me (a.s.) about, fearing that our (a.s.) weak Shiites may enter into confusion because of the ignorance which is in front of them. So fear Allah (azwj), Mighty is His (azwj) Mention, and single out for these matters, its deserving ones, and be cautious that you should become a reason for the calamities against the successors (a.s.) or provoking (people) against them (a.s.) by publicising what I (a.s.) am entrusting you with and exposing what I (a.s.) have told you to conceal, and Allah (azwj) Willing, you will not do this. Firstly what I (a.s.) would like to inform you is that you should mourn for myself (a.s.) in this very night without remorse and no complaints, for what is to transpire is from what Allah (azwj) Mighty and Majestic has Ordained and is inevitable. So attach yourself to the Handle of the Progeny (a.s.) of Muhammad (saww), and the Firmest Handle of the successor (a.s.) after the successor (a.s.), and the submission to them (a.s.) and be pleased with what they (a.s.) say, and do not seek Religion from the ones who are not from your Shiites, and do not love their Religion, for they are traitors who have betrayed Allah (azwj) and His (azwj) Rasool (saww), and betrayed their trusts. And do you know how they betrayed their trusts? They were entrusted with the Book of Allah (azwj) so they distorted it and changed it, and evidenced it upon the rulers among them. So stay away from them. Allah (azwj) has Made them to Taste the clothing of the hunger, and the fear due to what they had done. And you asked about two men (Abu Bakr and Umar) who usurped the wealth of a man which he used to spend upon the poor and the needy and the traveller in need, and in the Way of Allah (azwj). So when they usurped that, they were not happy until they made him carry it unwillingly upon his ride to their own homes. When they undertook to be in charge of its spending, and so reached infidelity by doing that. By my (a.s.) life, they had become hypocrites before that and rejected against Allah (azwj) His (azwj) Words, and mocked at His (azwj) Rasool (saww), and they were both infidels. May Allah (azwj) Curse them, and the Angels, and the people altogether. By Allah (azwj), the ‘Eman’ (belief) did not enter into the heart of any one of them since their coming out from their condition (Kufr), and it did not increase them in anything except for doubts. They were deceivers, sceptical, hypocrites until they both died and the Angels of Punishment took them to the place of disgrace in the eternal abode. And you asked about those who were in the presence of that man whilst he was usurping his wealth and placed it upon his ride, and there were among them who knew about it and denied it. So those (Abu Bakr and Umar) are the first apostates from this community, and so may the Curse of Allah (azwj) and the Angels and all the people be upon them. And you asked about extent of our (a.s.) Knowledge, and it is upon three aspects. The past, and the future, and the newly recurring. So as for the past, it has been explained, and as for the future, it has been written down, and as for that which is newly occurring, so it gets imprinted upon the hearts, and resonated in the ears, and it is the highest of our (a.s.) Knowledge, and there is no Prophet (as) after our (a.s.) Prophet (saww). And you asked about the mothers of their children (the followers of those two), and about their marriages, and about their divorces. So, as for the mothers of their children, they are prostitutes up to the Day of Judgement, having married without a guardian (Wali’s consent), and going through divorces without (completing the) waiting periods. And as for the one who enters into our (a.s.) Invitation (call to Wilayah), so his ‘Eman’ demolishes his misguidance, and so does his ‘Yaqeen’ conviction (demolish) his doubts. And you asked about the Zakaat among them. So, there was nothing from the Zakaat (for them), as you are more deserving of it, because we (a.s.) have made that to be lawful for you, and those who are from you wherever they may be. And you asked about the weak. So the weak is the one who cannot argue against (the batil) and he does not understand the differences, for if he understands the difference, then he is not with the weakness. You asked about the ‘الشَّهَادَاتِ’ testimonies for them. So establish the testimony for the sake of Allah (azwj), even if it is against your own-self, and the parents and the relatives in what is between you and them. So if you fear injustice against your brother, don’t (be part of it). And call to the Law of Allah (azwj), as He (azwj) has (placed those) in our (a.s.) recognition (Ma’rifat). The one who hopes would be Answered and do not barricade yourself by the fort of hypocrisy. And befriend the Progeny (a.s.) of Muhammad (saww) and do not speak of what reaches you from us (a.s.), and ascribe to us that ‘this is false’, and you may know something from us (a.s.) which is against it, for you do not know why we (a.s.) may have said it, and upon which perspective we may have described it. Believe in what I (a.s.) inform you (a.s.) and do not publicise what I (a.s.) have told you to conceal from what I (a.s.) inform you. It is from the obligatory right of your brother that you do not conceal anything from him which might benefit him in the affairs of the world and the Hereafter. And do not hold a grudge against him and not to hurt him, and answer his call when he calls you and do not leave him alone between him and his enemies from the people even though they may be closer to you than him, and support him in his illness. It is not from etiquettes of the ‘الْمُؤْمِنِينَ’ Believers, the defrauding, and the injuring, and the treachery, and the arrogance, and the vulgarities, and the immoralities, and the commanding for such things. So if you were to see the deformed Bedouin in legions (large armies), so wait for your relief (Al-Qaim (a.s.)), and for your Shiites, the believers, and when the sun rises, raise your vision to the sky and look at what Allah (azwj) has Done with the criminals. So I (a.s.) have explained to you all of this in summary. And send greetings upon Muhammad (saww) and his (saww) Progeny (a.s.), the righteous’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:28",
  "kind": "verse_list"
}