{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 29"
        },
        "path": "/books/al-kafi:8:1:29",
        "titles": {
          "ar": "حَدِيثٌ نَادِرٌ",
          "en": "RARE HADEETH"
        }
      }
    ],
    "index": 2300,
    "local_index": 29,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 30"
        },
        "path": "/books/al-kafi:8:1:30",
        "titles": {
          "ar": "حَدِيثُ رَسُولِ اللَّهِ ( صلى الله عليه وآله )",
          "en": "HADEETH OF THE RASOOL<sup>saww</sup> OF ALLAH<sup>azwj</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 28"
        },
        "path": "/books/al-kafi:8:1:28",
        "titles": {
          "ar": "حَدِيثُ أَبِي الْحَسَنِ مُوسَى ( عليه السلام )",
          "en": "HADEETH OF ABU AL-HASSAN MUSA<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:29",
    "titles": {
      "ar": "حَدِيثٌ نَادِرٌ",
      "en": "RARE HADEETH"
    },
    "verse_count": 3,
    "verse_start_index": 14779,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثوق كالصحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 303)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 385)"
        ],
        "index": 14780,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:29:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14544</span>- حُمَيْدُ بْنُ زِيَادٍ</span> عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ مُحَمَّدِ بْنِ أَيُّوبَ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ أَتَى أَبُو ذَرٍّ رَسُولَ اللَّهِ (صلى الله عليه وآله) فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي قَدِ اجْتَوَيْتُ الْمَدِينَةَ أَ فَتَأْذَنُ لِي أَنْ أَخْرُجَ أَنَا وَ ابْنُ أَخِي إِلَى مُزَيْنَةَ فَنَكُونَ بِهَا فَقَالَ إِنِّي أَخْشَى أَنْ يُغِيرَ عَلَيْكَ خَيْلٌ مِنَ الْعَرَبِ فَيُقْتَلَ ابْنُ أَخِيكَ فَتَأْتِيَنِي شَعَثاً فَتَقُومَ بَيْنَ يَدَيَّ مُتَّكِئاً عَلَى عَصَاكَ فَتَقُولَ قُتِلَ ابْنُ أَخِي وَ أُخِذَ السَّرْحُ فَقَالَ يَا رَسُولَ اللَّهِ بَلْ لَا يَكُونُ إِلَّا خَيْراً إِنْ شَاءَ اللَّهُ فَأَذِنَ لَهُ رَسُولُ اللَّهِ (صلى الله عليه وآله) ",
          "فَخَرَجَ هُوَ وَ ابْنُ أَخِيهِ وَ امْرَأَتُهُ فَلَمْ يَلْبَثْ هُنَاكَ إِلَّا يَسِيراً حَتَّى غَارَتْ خَيْلٌ لِبَنِي فَزَارَةَ فِيهَا عُيَيْنَةُ بْنُ حِصْنٍ فَأُخِذَتِ السَّرْحُ وَ قُتِلَ ابْنُ أَخِيهِ وَ أُخِذَتِ امْرَأَتُهُ مِنْ بَنِي غِفَارٍ وَ أَقْبَلَ أَبُو ذَرٍّ يَشْتَدُّ حَتَّى وَقَفَ بَيْنَ يَدَيْ رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ بِهِ طَعْنَةٌ جَائِفَةٌ فَاعْتَمَدَ عَلَى عَصَاهُ وَ قَالَ صَدَقَ اللَّهُ وَ رَسُولُهُ أُخِذَ السَّرْحُ وَ قُتِلَ ابْنُ أَخِي وَ قُمْتُ بَيْنَ يَدَيْكَ عَلَى عَصَايَ فَصَاحَ رَسُولُ اللَّهِ (صلى الله عليه وآله) فِي الْمُسْلِمِينَ فَخَرَجُوا فِي الطَّلَبِ فَرَدُّوا السَّرْحَ وَ قَتَلُوا نَفَراً مِنَ الْمُشْرِكِينَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473210\">H 14544</a> – Humeyd Bin Ziyad, from Al-Hassan Bin Muhammad Bin Sama’at, from Muhammad Bin Ayyub and Ali Bin Ibrahim, from his father altogether from Ahmad Bin Muhammad Bin Abu Nasr, from Abaan Bin Usmaan, from Abu Baseer, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘Abu Dharr<sup>ar</sup> came to the Rasool<sup>saww</sup> Allah<sup>azwj</sup> and said, ‘O Rasool<sup>saww</sup> Allah<sup>azwj</sup>, I<sup>asws</sup> have begun disliking Al-Medina. Will you<sup>saww</sup> permit me<sup>asws</sup>, and that I<sup>ar</sup> and the son of my<sup>ar</sup> brother go out to Muzeyna, for we are from it?’ He<sup>saww</sup> said: ‘I<sup>saww</sup> fear that you<sup>ar</sup> might be attacked by Arab horsemen, so they would kill the son of your<sup>ar</sup> brother and you will come to me<sup>saww</sup> beaten up, and stand in front of me<sup>saww</sup> leaning upon your stick and you will say, ‘The son of my<sup>ar</sup> brother has been killed, and the cattle taken away’. He<sup>ar</sup> said, ‘O Rasool<sup>saww</sup> Allah<sup>azwj</sup>, but nothing will happen except for the good, Allah<sup>azwj</sup> Willing’. So the Rasool<sup>saww</sup> Allah<sup>azwj</sup> gave him<sup>ar</sup> permission.",
            "So he<sup>ar</sup> and the son of his<sup>ar</sup> brother, and his<sup>ar</sup> wife went out. But, very soon the horsemen of the Clan of Fazaarat, among whom was Uyaynah Bin Hasan attacked them, took away the cattle, and killed the son of his<sup>ar</sup> brother, and took his<sup>ar</sup> wife who as from the Clan of Ghaffaar. And Abu Dharr<sup>ar</sup> came up in an intensely difficult condition and paused in front of the Rasool<sup>saww</sup> Allah<sup>azwj</sup>, badly wounded and leaning upon his stick and said, ‘Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup> were right. The cattle were taken, and the son of my<sup>ar</sup> brother being killed, and I<sup>ar</sup> am leaning upon my stick’. So the Rasool<sup>saww</sup> Allah<sup>azwj</sup> cried out among the Muslims. So they went out in the search, and returned the cattle, and killed a number from the Polytheists’."
          ],
          "en.sarwar": [
            "96. Humeyd Bin Ziyad, from Al-Hassan Bin Muhammad Bin Sama’at, from Muhammad Bin Ayyub and Ali Bin Ibrahim, from his father altogether from Ahmad Bin Muhammad Bin Abu Nasr, from Abaan Bin Usmaan, from Abu Baseer, who has narrated the following: Abu Abdullah (a.s.) having said: ‘Abu Dharr (ar) came to the Rasool (saww) Allah (azwj) and said, ‘O Rasool (saww) Allah (azwj), I (a.s.) have begun disliking Al-Medina. Will you (saww) permit me (a.s.), and that I (ar) and the son of my (ar) brother go out to Muzeyna, for we are from it?’ He (saww) said: ‘I (saww) fear that you (ar) might be attacked by Arab horsemen, so they would kill the son of your (ar) brother and you will come to me (saww) beaten up, and stand in front of me (saww) leaning upon your stick and you will say, ‘The son of my (ar) brother has been killed, and the cattle taken away’. He (ar) said, ‘O Rasool (saww) Allah (azwj), but nothing will happen except for the good, Allah (azwj) Willing’. So the Rasool (saww) Allah (azwj) gave him (ar) permission. So he (ar) and the son of his (ar) brother, and his (ar) wife went out. But, very soon the horsemen of the Clan of Fazaarat, among whom was Uyaynah Bin Hasan attacked them, took away the cattle, and killed the son of his (ar) brother, and took his (ar) wife who as from the Clan of Ghaffaar. And Abu Dharr (ar) came up in an intensely difficult condition and paused in front of the Rasool (saww) Allah (azwj), badly wounded and leaning upon his stick and said, ‘Allah (azwj) and His (azwj) Rasool (saww) were right. The cattle were taken, and the son of my (ar) brother being killed, and I (ar) am leaning upon my stick’. So the Rasool (saww) Allah (azwj) cried out among the Muslims. So they went out in the search, and returned the cattle, and killed a number from the Polytheists’."
          ]
        }
      },
      {
        "gradings": [
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 386)"
        ],
        "index": 14781,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:29:2",
        "text": [
          "14545- أَبَانٌ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) نَزَلَ رَسُولُ اللَّهِ (صلى الله عليه وآله) فِي غَزْوَةِ ذَاتِ الرِّقَاعِ تَحْتَ شَجَرَةٍ عَلَى شَفِيرِ وَادٍ فَأَقْبَلَ سَيْلٌ فَحَالَ بَيْنَهُ وَ بَيْنَ أَصْحَابِهِ فَرَآهُ رَجُلٌ مِنَ الْمُشْرِكِينَ وَ الْمُسْلِمُونَ قِيَامٌ عَلَى شَفِيرِ الْوَادِي يَنْتَظِرُونَ مَتَى يَنْقَطِعُ السَّيْلُ فَقَالَ رَجُلٌ مِنَ الْمُشْرِكِينَ لِقَوْمِهِ أَنَا أَقْتُلُ مُحَمَّداً فَجَاءَ وَ شَدَّ عَلَى رَسُولِ اللَّهِ (صلى الله عليه وآله) بِالسَّيْفِ ثُمَّ قَالَ مَنْ يُنْجِيكَ مِنِّي يَا مُحَمَّدُ فَقَالَ رَبِّي وَ رَبُّكَ فَنَسَفَهُ جَبْرَئِيلُ (عليه السلام) عَنْ فَرَسِهِ فَسَقَطَ عَلَى ظَهْرِهِ فَقَامَ رَسُولُ اللَّهِ (صلى الله عليه وآله) وَ أَخَذَ السَّيْفَ وَ جَلَسَ عَلَى صَدْرِهِ وَ قَالَ مَنْ يُنْجِيكَ مِنِّي يَا غَوْرَثُ فَقَالَ جُودُكَ وَ كَرَمُكَ يَا مُحَمَّدُ فَتَرَكَهُ فَقَامَ وَ هُوَ يَقُولُ وَ اللَّهِ لَأَنْتَ خَيْرٌ مِنِّي وَ أَكْرَمُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473211\">H 14545</a> – Abaan, from Abu Baseer has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said that the Rasool<sup>saww</sup> Allah<sup>azwj</sup> encamped under a tree on the edge of the valley during the (military) expedition of Zaat Al-Raqa’a. A flooding came in between him<sup>saww</sup> and his<sup>saww</sup> companions. A man from the Polytheists saw it, and the Muslims were standing upon the edge of the valley waiting for the flood to be cut-off (subside). So a man from the Polytheists said to his people, ‘I will kill Muhammad<sup>saww</sup>’. So he came and pulled out his sword against the Rasool<sup>saww</sup> Allah<sup>azwj</sup> then said, ‘Who is going to save you from me, O Muhammad<sup>saww</sup>?’ He<sup>saww</sup> said: ‘My<sup>saww</sup> Lord<sup>azwj</sup>, and your Lord<sup>azwj</sup>’. So Jibraeel<sup>as</sup> blew him off his horse and he fell upon his back. The Rasool<sup>saww</sup> stood up and took the sword, and sat upon his chest and said: ‘Who is the one who will rescue you from me<sup>saww</sup>, O Gowras?’ He said, ‘Your<sup>saww</sup> benevolence and your<sup>saww</sup> generosity, O Muhammad<sup>saww</sup>’. So he<sup>saww</sup> left him. He stood up and he was saying, ‘By Allah<sup>azwj</sup>, you<sup>saww</sup> are better than me and more generous’."
          ],
          "en.sarwar": [
            "97. Abaan, from Abu Baseer has narrated the following: Abu Abdullah (a.s.) has said that the Rasool (saww) Allah (azwj) encamped under a tree on the edge of the valley during the (military) expedition of Zaat Al-Raqa’a. A flooding came in between him (saww) and his (saww) companions. A man from the Polytheists saw it, and the Muslims were standing upon the edge of the valley waiting for the flood to be cut-off (subside). So a man from the Polytheists said to his people, ‘I will kill Muhammad (saww)’. So he came and pulled out his sword against the Rasool (saww) Allah (azwj) then said, ‘Who is going to save you from me, O Muhammad (saww)?’ He (saww) said: ‘My (saww) Lord (azwj), and your Lord (azwj)’. So Jibraeel (as) blew him off his horse and he fell upon his back. The Rasool (saww) stood up and took the sword, and sat upon his chest and said: ‘Who is the one who will rescue you from me (saww), O Gowras?’ He said, ‘Your (saww) benevolence and your (saww) generosity, O Muhammad (saww)’. So he (saww) left him. He stood up and he was saying, ‘By Allah (azwj), you (saww) are better than me and more generous’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 306)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14782,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:29:3",
        "text": [
          "14546- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ [وَ عَلِيُّ بْنُ مُحَمَّدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ] عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْمِنْقَرِيِّ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ إِنْ قَدَرْتُمْ أَنْ لَا تُعْرَفُوا فَافْعَلُوا وَ مَا عَلَيْكَ إِنْ لَمْ يُثْنِ النَّاسُ عَلَيْكَ وَ مَا عَلَيْكَ أَنْ تَكُونَ مَذْمُوماً عِنْدَ النَّاسِ إِذَا كُنْتَ مَحْمُوداً عِنْدَ اللَّهِ تَبَارَكَ وَ تَعَالَى إِنَّ أَمِيرَ الْمُؤْمِنِينَ (عليه السلام) كَانَ يَقُولُ لَا خَيْرَ فِي الدُّنْيَا إِلَّا لِأَحَدِ رَجُلَيْنِ رَجُلٍ يَزْدَادُ فِيهَا كُلَّ يَوْمٍ إِحْسَاناً وَ رَجُلٍ يَتَدَارَكُ مَنِيَّتَهُ بِالتَّوْبَةِ وَ أَنَّى لَهُ بِالتَّوْبَةِ فَوَ اللَّهِ أَنْ لَوْ سَجَدَ حَتَّى يَنْقَطِعَ عُنُقُهُ مَا قَبِلَ اللَّهُ عَزَّ وَ جَلَّ مِنْهُ عَمَلًا إِلَّا بِوَلَايَتِنَا أَهْلَ الْبَيْتِ أَلَا وَ مَنْ عَرَفَ حَقَّنَا أَوْ رَجَا الثَّوَابَ بِنَا وَ رَضِيَ بِقُوتِهِ نِصْفَ مُدٍّ كُلَّ يَوْمٍ وَ مَا يَسْتُرُ بِهِ عَوْرَتَهُ وَ مَا أَكَنَّ بِهِ رَأْسَهُ وَ هُمْ مَعَ ذَلِكَ وَ اللَّهِ خَائِفُونَ وَجِلُونَ وَدُّوا أَنَّهُ حَظُّهُمْ مِنَ الدُّنْيَا ",
          "وَ كَذَلِكَ وَصَفَهُمُ اللَّهُ عَزَّ وَ جَلَّ حَيْثُ يَقُولُ وَ الَّذِينَ يُؤْتُونَ ما آتَوْا وَ قُلُوبُهُمْ وَجِلَةٌ مَا الَّذِي أَتَوْا بِهِ أَتَوْا وَ اللَّهِ بِالطَّاعَةِ مَعَ الْمَحَبَّةِ وَ الْوَلَايَةِ وَ هُمْ فِي ذَلِكَ خَائِفُونَ أَنْ لَا يُقْبَلَ مِنْهُمْ وَ لَيْسَ وَ اللَّهِ خَوْفُهُمْ خَوْفَ شَكٍّ فِيمَا هُمْ فِيهِ مِنْ إِصَابَةِ الدِّينِ وَ لَكِنَّهُمْ خَافُوا أَنْ يَكُونُوا مُقَصِّرِينَ فِي مَحَبَّتِنَا وَ طَاعَتِنَا ",
          "ثُمَّ قَالَ إِنْ قَدَرْتَ أَنْ لَا تَخْرُجَ مِنْ بَيْتِكَ فَافْعَلْ فَإِنَّ عَلَيْكَ فِي خُرُوجِكَ أَنْ لَا تَغْتَابَ وَ لَا تَكْذِبَ وَ لَا تَحْسُدَ وَ لَا تُرَائِيَ وَ لَا تَتَصَنَّعَ وَ لَا تُدَاهِنَ ثُمَّ قَالَ نَعَمْ صَوْمَعَةُ الْمُسْلِمِ بَيْتُهُ يَكُفُّ فِيهِ بَصَرَهُ وَ لِسَانَهُ وَ نَفْسَهُ وَ فَرْجَهُ إِنَّ مَنْ عَرَفَ نِعْمَةَ اللَّهِ بِقَلْبِهِ اسْتَوْجَبَ الْمَزِيدَ مِنَ اللَّهِ عَزَّ وَ جَلَّ قَبْلَ أَنْ يُظْهِرَ شُكْرَهَا عَلَى لِسَانِهِ وَ مَنْ ذَهَبَ يَرَى أَنَّ لَهُ عَلَى الْآخَرِ فَضْلًا فَهُوَ مِنَ الْمُسْتَكْبِرِينَ ",
          "فَقُلْتُ لَهُ إِنَّمَا يَرَى أَنَّ لَهُ عَلَيْهِ فَضْلًا بِالْعَافِيَةِ إِذَا رَآهُ مُرْتَكِباً لِلْمَعَاصِي فَقَالَ هَيْهَاتَ هَيْهَاتَ فَلَعَلَّهُ أَنْ يَكُونَ قَدْ غُفِرَ لَهُ مَا أَتَى وَ أَنْتَ مَوْقُوفٌ مُحَاسَبٌ أَ مَا تَلَوْتَ قِصَّةَ سَحَرَةِ مُوسَى ( عليه السلام ) ثُمَّ قَالَ كَمْ مِنْ مَغْرُورٍ بِمَا قَدْ أَنْعَمَ اللَّهُ عَلَيْهِ وَ كَمْ مِنْ مُسْتَدْرَجٍ بِسَتْرِ اللَّهِ عَلَيْهِ وَ كَمْ مِنْ مَفْتُونٍ بِثَنَاءِ النَّاسِ عَلَيْهِ ثُمَّ قَالَ إِنِّي لَأَرْجُو النَّجَاةَ لِمَنْ عَرَفَ حَقَّنَا مِنْ هَذِهِ الْأُمَّةِ إِلَّا لِأَحَدِ ثَلَاثَةٍ صَاحِبِ سُلْطَانٍ جَائِرٍ وَ صَاحِبِ هَوًى وَ الْفَاسِقِ الْمُعْلِنِ ",
          "ثُمَّ تَلَا قُلْ إِنْ كُنْتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ ثُمَّ قَالَ يَا حَفْصُ الْحُبُّ أَفْضَلُ مِنَ الْخَوْفِ ثُمَّ قَالَ وَ اللَّهِ مَا أَحَبَّ اللَّهَ مَنْ أَحَبَّ الدُّنْيَا وَ وَالَى غَيْرَنَا وَ مَنْ عَرَفَ حَقَّنَا وَ أَحَبَّنَا فَقَدْ أَحَبَّ اللَّهَ تَبَارَكَ وَ تَعَالَى ",
          "فَبَكَى رَجُلٌ فَقَالَ أَ تَبْكِي لَوْ أَنَّ أَهْلَ السَّمَاوَاتِ وَ الْأَرْضِ كُلَّهُمُ اجْتَمَعُوا يَتَضَرَّعُونَ إِلَى اللَّهِ عَزَّ وَ جَلَّ أَنْ يُنْجِيَكَ مِنَ النَّارِ وَ يُدْخِلَكَ الْجَنَّةَ لَمْ يُشَفَّعُوا فِيكَ [ثُمَّ كَانَ لَكَ قَلْبٌ حَيٌّ لَكُنْتَ أَخْوَفَ النَّاسِ لِلَّهِ عَزَّ وَ جَلَّ فِي تِلْكَ الْحَالِ] ثُمَّ قَالَ لَهُ يَا حَفْصُ كُنْ ذَنَباً وَ لَا تَكُنْ رَأْساً يَا حَفْصُ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ خَافَ اللَّهَ كَلَّ لِسَانُهُ ",
          "ثُمَّ قَالَ بَيْنَا مُوسَى بْنُ عِمْرَانَ ( عليه السلام ) يَعِظُ أَصْحَابَهُ إِذْ قَامَ رَجُلٌ فَشَقَّ قَمِيصَهُ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ يَا مُوسَى قُلْ لَهُ لَا تَشُقَّ قَمِيصَكَ وَ لَكِنِ اشْرَحْ لِي عَنْ قَلْبِكَ ",
          "ثُمَّ قَالَ مَرَّ مُوسَى بْنُ عِمْرَانَ ( عليه السلام ) بِرَجُلٍ مِنْ أَصْحَابِهِ وَ هُوَ سَاجِدٌ فَانْصَرَفَ مِنْ حَاجَتِهِ وَ هُوَ سَاجِدٌ عَلَى حَالِهِ فَقَالَ لَهُ مُوسَى ( عليه السلام ) لَوْ كَانَتْ حَاجَتُكَ بِيَدِي لَقَضَيْتُهَا لَكَ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ يَا مُوسَى لَوْ سَجَدَ حَتَّى يَنْقَطِعَ عُنُقُهُ مَا قَبِلْتُهُ حَتَّى يَتَحَوَّلَ عَمَّا أَكْرَهُ إِلَى مَا أُحِبُّ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473212\">H 14546</a> – Ali Bin Ibrahim, from his father, from Al-Qasim Bin Muhammad, and Ali Bin Muhammad, from Al-Qasim Bin Muhammad, from Suleyman Bin Dawood Al-Munkary, from Hafs Bin Gayaas, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘If you have the ability to make yourselves unknown, you better do it. And it should not matter to you if the people do not praise you, and it should not matter to you either that you are condemned by the people whilst you are being Praised in the Presence of Allah<sup>azwj</sup>. ",
            "Amir-ul-Momineen<sup>asws</sup> used to say: ‘There is no good in the world except for one of the two men – a man who increases in it the good deeds every day and a man who corrects himself, ready to face death by the repentance. But, what is meant by the repentance? By Allah<sup>azwj</sup>! If he were to perform prostrations to the extent that his neck breaks off, Allah<sup>azwj</sup> will not Accept deeds from him except by our<sup>asws</sup> Wilayah, the People<sup>asws</sup> of the Household. Indeed, (Acceptance) is for the ones who recognise our<sup>asws</sup> rights and hope for Reward by us<sup>asws</sup>, (they) are pleased with their strength of half a ‘Mudd’ (Unit of measurement) of food every day, not being able to cover their private parts (insufficient clothing), and no covering over their head (roof), but still they are very much fearful of Allah<sup>azwj</sup> and are pleased with the (little) share from the world.",
            "And that is how Allah<sup>azwj</sup> has Described them where He<sup>azwj</sup> has Said: <span class=\"ibTxt\">“[23:60] And those who dispense their charity with their hearts full of fear”</span>. That’s what they come with? By Allah<sup>azwj</sup>! They come with obedience along with the love, and the Wilayah, and they are with regards to that, (but they are still) fearful that it may not be Accepted from them. By Allah<sup>azwj</sup>, they are not fearful with the fear of doubt with regards to what they are in from the difficulties of Religion, but they are fearful that they might have been deficient (Muqassir) in our<sup>asws</sup> love and being (less) obedient to us<sup>asws</sup>’. ",
            "Then said: ‘If you could afford not to go out of your houses, then do so, as when you go out then it becomes obligatory on you that you would not backbite, and not lie, and not be envious, and not show-off, and not pretend, and not flatter’. Then said: ‘Yes, a silo for the Muslim is his house in which he restrains his vision, and his tongue, and his self, and his genitals. The one, who recognises the Favours of Allah<sup>azwj</sup> by his heart, obligates more for himself from Allah<sup>azwj</sup>, before he even expresses his appreciation for it upon his tongue, and the one who goes around considering himself to be better than others, so he is from the arrogant ones’.",
            "So I said to him<sup>asws</sup>, ‘But what if he sees himself as better due to the (spiritual) health when he sees the one who is indulging in the sins?’ He<sup>asws</sup> said: ‘Far be it! Far be it! It may be that he has been Forgiven for his sins whilst you have been Paused for the Accounting. Have you not recited the story of the magicians (at the time) of Musa<sup>as</sup>?’ Then said: ‘How many are proud with what Allah<sup>azwj</sup> has Favoured them with, and how many have been enticed by the Veil of Allah<sup>azwj</sup> upon them, and how many have been infatuated by the praises of the people upon him’. Then said: ‘I<sup>asws</sup> hope for the salvation for the ones who recognise our<sup>asws</sup> rights, from this community except for one of the three – an unjust ruler, a follower of desires, an openly immoral one’. ",
            "Then he<sup>asws</sup> recited: <span class=\"ibTxt\">“[3:31] Say: If you love Allah, then follow me, Allah will love you”</span>, then said: ‘O Hafs, the love is higher than the fear’. Then said: ‘By Allah<sup>azwj</sup>, Allah<sup>azwj</sup> does not Love the one who loves the world, and takes as a friend other than us<sup>asws</sup>, whilst the one who recognises our<sup>asws</sup> rights and loves us<sup>asws</sup>, so he has loved Allah<sup>azwj</sup>’.",
            "A man wept, so he<sup>asws</sup> said: ‘Are you crying? Even if the inhabitants of the heavens and the earth, all of them get together crying to Allah<sup>azwj</sup> to be Rescued from the Fire and to be entered into the Paradise, they would not be able to intercede for you. Then if you had for yourself a living heart you would be the most fearful of the people to Allah<sup>azwj</sup> in that condition’. Then said to him: ‘O Hafs, be a follower and not a leader. O Hafs, the Rasool<sup>saww</sup> Allah<sup>azwj</sup> said: ‘The one who fears Allah<sup>azwj</sup>, would be of little speech’.",
            "Then said: ‘Once Musa Bin Imran<sup>as</sup> was advising his<sup>as</sup> companions, when a man stood up, and tore his shirt. So Allah<sup>azwj</sup> Revealed unto him<sup>as</sup>: “O Musa<sup>as</sup>! Say to him, ‘Do not tear your shirt, but open for Me<sup>azwj</sup> your heart’”.",
            "Then said: ‘Musa<sup>as</sup> Bin Imran<sup>as</sup> passed by a man from his<sup>as</sup> companion, and he was prostrating. So after return back from what he<sup>as</sup> had to do, (Musa<sup>as</sup>) saw him still in prostration. So Musa<sup>as</sup> said to him: ‘If (the fulfilment) of your need was in my<sup>as</sup> hands, I<sup>asws</sup> would have fulfilled it for you’. So Allah<sup>azwj</sup> Revealed unto him<sup>as</sup>; “O Musa<sup>as</sup>! Even if he were to prostrate until his neck breaks, I<sup>azwj</sup> will not Accept it until he turns away from what I<sup>azwj</sup> Abhor and towards what I<sup>azwj</sup> Love”.’"
          ],
          "en.sarwar": [
            "98. Ali Bin Ibrahim, from his father, from Al-Qasim Bin Muhammad, and Ali Bin Muhammad, from Al-Qasim Bin Muhammad, from Suleyman Bin Dawood Al-Munkary, from Hafs Bin Gayaas, who has said: Abu Abdullah (a.s.) having said: ‘If you have the ability to make yourselves unknown, you better do it. And it should not matter to you if the people do not praise you, and it should not matter to you either that you are condemned by the people whilst you are being Praised in the Presence of Allah (azwj). Amir-ul-Momineen (a.s.) used to say: ‘There is no good in the world except for one of the two men – a man who increases in it the good deeds every day and a man who corrects himself, ready to face death by the repentance. But, what is meant by the repentance? By Allah (azwj)! If he were to perform prostrations to the extent that his neck breaks off, Allah (azwj) will not Accept deeds from him except by our (a.s.) Wilayah, the People (a.s.) of the Household. Indeed, (Acceptance) is for the ones who recognise our (a.s.) rights and hope for Reward by us (a.s.), (they) are pleased with their strength of half a ‘Mudd’ (Unit of measurement) of food every day, not being able to cover their private parts (insufficient clothing), and no covering over their head (roof), but still they are very much fearful of Allah (azwj) and are pleased with the (little) share from the world. And that is how Allah (azwj) has Described them where He (azwj) has Said: “[23:60] And those who dispense their charity with their hearts full of fear”. That’s what they come with? By Allah (azwj)! They come with obedience along with the love, and the Wilayah, and they are with regards to that, (but they are still) fearful that it may not be Accepted from them. By Allah (azwj), they are not fearful with the fear of doubt with regards to what they are in from the difficulties of Religion, but they are fearful that they might have been deficient (Muqassir) in our (a.s.) love and being (less) obedient to us (a.s.)’. Then said: ‘If you could afford not to go out of your houses, then do so, as when you go out then it becomes obligatory on you that you would not backbite, and not lie, and not be envious, and not show-off, and not pretend, and not flatter’. Then said: ‘Yes, a silo for the Muslim is his house in which he restrains his vision, and his tongue, and his self, and his genitals. The one, who recognises the Favours of Allah (azwj) by his heart, obligates more for himself from Allah (azwj), before he even expresses his appreciation for it upon his tongue, and the one who goes around considering himself to be better than others, so he is from the arrogant ones’. So I said to him (a.s.), ‘But what if he sees himself as better due to the (spiritual) health when he sees the one who is indulging in the sins?’ He (a.s.) said: ‘Far be it! Far be it! It may be that he has been Forgiven for his sins whilst you have been Paused for the Accounting. Have you not recited the story of the magicians (at the time) of Musa (as)?’ Then said: ‘How many are proud with what Allah (azwj) has Favoured them with, and how many have been enticed by the Veil of Allah (azwj) upon them, and how many have been infatuated by the praises of the people upon him’. Then said: ‘I (a.s.) hope for the salvation for the ones who recognise our (a.s.) rights, from this community except for one of the three – an unjust ruler, a follower of desires, an openly immoral one’. Then he (a.s.) recited: “[3:31] Say: If you love Allah, then follow me, Allah will love you”, then said: ‘O Hafs, the love is higher than the fear’. Then said: ‘By Allah (azwj), Allah (azwj) does not Love the one who loves the world, and takes as a friend other than us (a.s.), whilst the one who recognises our (a.s.) rights and loves us (a.s.), so he has loved Allah (azwj)’. A man wept, so he (a.s.) said: ‘Are you crying? Even if the inhabitants of the heavens and the earth, all of them get together crying to Allah (azwj) to be Rescued from the Fire and to be entered into the Paradise, they would not be able to intercede for you. Then if you had for yourself a living heart you would be the most fearful of the people to Allah (azwj) in that condition’. Then said to him: ‘O Hafs, be a follower and not a leader. O Hafs, the Rasool (saww) Allah (azwj) said: ‘The one who fears Allah (azwj), would be of little speech’. Then said: ‘Once Musa Bin Imran (as) was advising his (as) companions, when a man stood up, and tore his shirt. So Allah (azwj) Revealed unto him (as): “O Musa (as)! Say to him, ‘Do not tear your shirt, but open for Me (azwj) your heart’”. Then said: ‘Musa (as) Bin Imran (as) passed by a man from his (as) companion, and he was prostrating. So after return back from what he (as) had to do, (Musa (as)) saw him still in prostration. So Musa (as) said to him: ‘If (the fulfilment) of your need was in my (as) hands, I (a.s.) would have fulfilled it for you’. So Allah (azwj) Revealed unto him (as); “O Musa (as)! Even if he were to prostrate until his neck breaks, I (azwj) will not Accept it until he turns away from what I (azwj) Abhor and towards what I (azwj) Love”.’"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:29",
  "kind": "verse_list"
}