{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:8:1:3",
        "titles": {
          "ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) وَ هِيَ خُطْبَةُ الْوَسِيلَةِ",
          "en": "SERMON OF AMIR –UL- MOMINEEN<sup>asws</sup> AND IT IS THE SERMON OF THE MEANS (AL-WASEELA)"
        }
      }
    ],
    "index": 2274,
    "local_index": 3,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 4"
        },
        "path": "/books/al-kafi:8:1:4",
        "titles": {
          "ar": "خُطْبَةُ الطَّالُوتِيَّةِ",
          "en": "SERMON OF AL-TAALUTIYYA"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 2"
        },
        "path": "/books/al-kafi:8:1:2",
        "titles": {
          "ar": "صَحِيفَةُ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) وَ كَلَامُهُ فِي الزُّهْدِ       ",
          "en": "THE PARCHMENT OF ALI BIN AL-HUSAYN<sup>asws</sup> AND HIS<sup>asws</sup> SPEECH REGARDING THE ASCETISM"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:3",
    "titles": {
      "ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) وَ هِيَ خُطْبَةُ الْوَسِيلَةِ",
      "en": "SERMON OF AMIR –UL- MOMINEEN<sup>asws</sup> AND IT IS THE SERMON OF THE MEANS (AL-WASEELA)"
    },
    "verse_count": 1,
    "verse_start_index": 14687,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 14688,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:3:1",
        "refs": {
          "Mentions": [
            "/books/quran:6:62",
            "/books/quran:25:28",
            "/books/quran:50:42",
            "/books/quran:5:3",
            "/books/quran:4:80",
            "/books/quran:3:31",
            "/books/quran:33:56",
            "/books/quran:25:29",
            "/books/quran:11:17",
            "/books/quran:50:44",
            "/books/quran:50:43",
            "/books/quran:7:142"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14452</span>-  مُحَمَّدُ بْنُ</span> عَلِيِّ بْنِ مَعْمَرٍ عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ عُكَايَةَ التَّمِيمِيِّ عَنِ الْحُسَيْنِ بْنِ النَّضْرِ الْفِهْرِيِّ عَنْ أَبِي عَمْرٍو الْأَوْزَاعِيِّ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرِ بْنِ يَزِيدَ قَالَ دَخَلْتُ عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) فَقُلْتُ يَا ابْنَ رَسُولِ اللَّهِ قَدْ أَرْمَضَنِي اخْتِلَافُ الشِّيعَةِ فِي مَذَاهِبِهَا فَقَالَ يَا جَابِرُ أَ لَمْ أَقِفْكَ عَلَى مَعْنَى اخْتِلَافِهِمْ مِنْ أَيْنَ اخْتَلَفُوا وَ مِنْ أَيِّ جِهَةٍ تَفَرَّقُوا قُلْتُ بَلَى يَا ابْنَ رَسُولِ اللَّهِ ",
          "قَالَ فَلَا تَخْتَلِفْ إِذَا اخْتَلَفُوا يَا جَابِرُ إِنَّ الْجَاحِدَ لِصَاحِبِ الزَّمَانِ كَالْجَاحِدِ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) فِي أَيَّامِهِ يَا جَابِرُ اسْمَعْ وَ عِ قُلْتُ إِذَا شِئْتَ قَالَ اسْمَعْ وَ عِ وَ بَلِّغْ حَيْثُ انْتَهَتْ بِكَ رَاحِلَتُكَ إِنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) خَطَبَ النَّاسَ بِالْمَدِينَةِ بَعْدَ سَبْعَةِ أَيَّامٍ مِنْ وَفَاةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ ذَلِكَ حِينَ فَرَغَ مِنْ جَمْعِ الْقُرْآنِ وَ تَأْلِيفِهِ ",
          "فَقَالَ الْحَمْدُ لِلَّهِ الَّذِي مَنَعَ الْأَوْهَامَ أَنْ تَنَالَ إِلَّا وُجُودَهُ وَ حَجَبَ الْعُقُولَ أَنْ تَتَخَيَّلَ ذَاتَهُ لِامْتِنَاعِهَا مِنَ الشَّبَهِ وَ التَّشَاكُلِ بَلْ هُوَ الَّذِي لَا يَتَفَاوَتُ فِي ذَاتِهِ وَ لَا يَتَبَعَّضُ بِتَجْزِئَةِ الْعَدَدِ فِي كَمَالِهِ فَارَقَ الْأَشْيَاءَ لَا عَلَى اخْتِلَافِ الْأَمَاكِنِ وَ يَكُونُ فِيهَا لَا عَلَى وَجْهِ الْمُمُازَجَةِ وَ عَلِمَهَا لَا بِأَدَاةٍ لَا يَكُونُ الْعِلْمُ إِلَّا بِهَا وَ لَيْسَ بَيْنَهُ وَ بَيْنَ مَعْلُومِهِ عِلْمُ غَيْرِهِ بِهِ كَانَ عَالِماً بِمَعْلُومِهِ",
          "إِنْ قِيلَ كَانَ فَعَلَى تَأْوِيلِ أَزَلِيَّةِ الْوُجُودِ وَ إِنْ قِيلَ لَمْ يَزَلْ فَعَلَى تَأْوِيلِ نَفْيِ الْعَدَمِ فَسُبْحَانَهُ وَ تَعَالَى عَنْ قَوْلِ مَنْ عَبَدَ سِوَاهُ وَ اتَّخَذَ إِلَهاً غَيْرَهُ عُلُوّاً كَبِيراً نَحْمَدُهُ بِالْحَمْدِ الَّذِي ارْتَضَاهُ مِنْ خَلْقِهِ وَ أَوْجَبَ قَبُولَهُ عَلَى نَفْسِهِ ",
          "وَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ شَهَادَتَانِ تَرْفَعَانِ الْقَوْلَ وَ تُضَاعِفَانِ الْعَمَلَ خَفَّ مِيزَانٌ تُرْفَعَانِ مِنْهُ وَ ثَقُلَ مِيزَانٌ تُوضَعَانِ فِيهِ وَ بِهِمَا الْفَوْزُ بِالْجَنَّةِ وَ النَّجَاةُ مِنَ النَّارِ وَ الْجَوَازُ عَلَى الصِّرَاطِ",
          "وَ بِالشَّهَادَةِ تَدْخُلُونَ الْجَنَّةَ وَ بِالصَّلَاةِ تَنَالُونَ الرَّحْمَةَ أَكْثِرُوا مِنَ الصَّلَاةِ عَلَى نَبِيِّكُمْ إِنَّ اللَّهَ وَ مَلائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ يا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَ سَلِّمُوا تَسْلِيماً صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ وَ سَلَّمَ تَسْلِيماً ",
          "أَيُّهَا النَّاسُ إِنَّهُ لَا شَرَفَ أَعْلَى مِنَ الْإِسْلَامِ وَ لَا كَرَمَ أَعَزُّ مِنَ التَّقْوَى وَ لَا مَعْقِلَ أَحْرَزُ مِنَ الْوَرَعِ وَ لَا شَفِيعَ أَنْجَحُ مِنَ التَّوْبَةِ وَ لَا لِبَاسَ أَجْمَلُ مِنَ الْعَافِيَةِ وَ لَا وِقَايَةَ أَمْنَعُ مِنَ السَّلَامَةِ وَ لَا مَالَ أَذْهَبُ بِالْفَاقَةِ مِنَ الرِّضَا بِالْقَنَاعَةِ وَ لَا كَنْزَ أَغْنَى مِنَ الْقُنُوعِ",
          "وَ مَنِ اقْتَصَرَ عَلَى بُلْغَةِ الْكَفَافِ فَقَدِ انْتَظَمَ الرَّاحَةَ وَ تَبَوَّأَ خَفْضَ الدَّعَةِ وَ الرَّغْبَةُ مِفْتَاحُ التَّعَبِ وَ الِاحْتِكَارُ مَطِيَّةُ النَّصَبِ وَ الْحَسَدُ آفَةُ الدِّينِ وَ الْحِرْصُ دَاعٍ إِلَى التَّقَحُّمِ فِي الذُّنُوبِ وَ هُوَ دَاعِي الْحِرْمَانِ وَ الْبَغْيُ سَائِقٌ إِلَى الْحَيْنِ وَ الشَّرَهُ جَامِعٌ لِمَسَاوِي الْعُيُوبِ رُبَّ طَمَعٍ خَائِبٍ وَ أَمَلٍ كَاذِبٍ وَ رَجَاءٍ يُؤَدِّي إِلَى الْحِرْمَانِ وَ تِجَارَةٍ تَئُولُ إِلَى الْخُسْرَانِ أَلَا وَ مَنْ تَوَرَّطَ فِي الْأُمُورِ غَيْرَ نَاظِرٍ فِي الْعَوَاقِبِ فَقَدْ تَعَرَّضَ لِمُفْضِحَاتِ النَّوَائِبِ وَ بِئْسَتِ الْقِلَادَةُ الذَّنْبُ لِلْمُؤْمِنِ",
          "َيُّهَا النَّاسُ إِنَّهُ لَا كَنْزَ أَنْفَعُ مِنَ الْعِلْمِ وَ لَا عِزَّ أَرْفَعُ مِنَ الْحِلْمِ وَ لَا حَسَبَ أَبْلَغُ مِنَ الْأَدَبِ وَ لَا نَصَبَ أَوْضَعُ مِنَ الْغَضَبِ وَ لَا جَمَالَ أَزْيَنُ مِنَ الْعَقْلِ وَ لَا سَوْأَةَ أَسْوَأُ مِنَ الْكَذِبِ وَ لَا حَافِظَ أَحْفَظُ مِنَ الصَّمْتِ وَ لَا غَائِبَ أَقْرَبُ مِنَ الْمَوْتِ",
          "أ أَيُّهَا النَّاسُ إِنَّهُ مَنْ نَظَرَ فِي عَيْبِ نَفْسِهِ اشْتَغَلَ عَنْ عَيْبِ غَيْرِهِ وَ مَنْ رَضِيَ بِرِزْقِ اللَّهِ لَمْ يَأْسَفْ عَلَى مَا فِي يَدِ غَيْرِهِ وَ مَنْ سَلَّ سَيْفَ الْبَغْيِ قُتِلَ بِهِ وَ مَنْ حَفَرَ لِأَخِيهِ بِئْراً وَقَعَ فِيهَا وَ مَنْ هَتَكَ حِجَابَ غَيْرِهِ انْكَشَفَ عَوْرَاتُ بَيْتِهِ وَ مَنْ نَسِيَ زَلَلَهُ اسْتَعْظَمَ زَلَلَ غَيْرِهِ وَ مَنْ أُعْجِبَ بِرَأْيِهِ ضَلَّ وَ مَنِ اسْتَغْنَى بِعَقْلِهِ زَلَّ وَ مَنْ تَكَبَّرَ عَلَى النَّاسِ ذَلَّ وَ مَنْ سَفِهَ عَلَى النَّاسِ شُتِمَ وَ مَنْ خَالَطَ الْأَنْذَالَ حُقِّرَ وَ مَنْ حَمَلَ مَا لَا يُطِيقُ عَجَزَ",
          "أَيُّهَا النَّاسُ إِنَّهُ لَا مَالَ هُوَ أَعْوَدُ مِنَ الْعَقْلِ وَ لَا فَقْرَ هُوَ أَشَدُّ مِنَ الْجَهْلِ وَ لَا وَاعِظَ هُوَ أَبْلَغُ مِنَ النُّصْحِ وَ لَا عَقْلَ كَالتَّدْبِيرِ وَ لَا عِبَادَةَ كَالتَّفَكُّرِ وَ لَا مُظَاهَرَةَ أَوْثَقُ مِنَ الْمُشَاوَرَةِ وَ لَا وَحْشَةَ أَشَدُّ مِنَ الْعُجْبِ وَ لَا وَرَعَ كَالْكَفِّ عَنِ الْمَحَارِمِ وَ لَا حِلْمَ كَالصَّبْرِ وَ الصَّمْتِ",
          "أَيُّهَا النَّاسُ فِي الْإِنْسَانِ عَشْرُ خِصَالٍ يُظْهِرُهَا لِسَانُهُ شَاهِدٌ يُخْبِرُ عَنِ الضَّمِيرِ حَاكِمٌ يَفْصِلُ بَيْنَ الْخِطَابِ وَ نَاطِقٌ يُرَدُّ بِهِ الْجَوَابُ وَ شَافِعٌ يُدْرَكُ بِهِ الْحَاجَةُ وَ وَاصِفٌ يُعْرَفُ بِهِ الْأَشْيَاءُ وَ أَمِيرٌ يَأْمُرُ بِالْحَسَنِ وَ وَاعِظٌ يَنْهَى عَنِ الْقَبِيحِ وَ مُعَزٍّ تُسَكَّنُ بِهِ الْأَحْزَانُ وَ حَاضِرٌ تُجْلَى بِهِ الضَّغَائِنُ وَ مُونِقٌ تَلْتَذُّ بِهِ الْأَسْمَاعُ ",
          "أَيُّهَا النَّاسُ إِنَّهُ لَا خَيْرَ فِي الصَّمْتِ عَنِ الْحُكْمِ كَمَا أَنَّهُ لَا خَيْرَ فِي الْقَوْلِ بِالْجَهْلِ وَ اعْلَمُوا أَيُّهَا النَّاسُ أَنَّهُ مَنْ لَمْ يَمْلِكْ لِسَانَهُ يَنْدَمْ وَ مَنْ لَا يَعْلَمْ يَجْهَلْ وَ مَنْ لَا يَتَحَلَّمْ لَا يَحْلُمْ وَ مَنْ لَا يَرْتَدِعْ لَا يَعْقِلْ وَ مَنْ لَا يَعْلَمْ يُهَنْ وَ مَنْ يُهَنْ لَا يُوَقَّرْ وَ مَنْ لَا يُوَقَّرْ يَتَوَبَّخْ وَ مَنْ يَكْتَسِبْ مَالًا مِنْ غَيْرِ حَقِّهِ يَصْرِفْهُ فِي غَيْرِ أَجْرِهِ وَ مَنْ لَا يَدَعْ وَ هُوَ مَحْمُودٌ يَدَعْ وَ هُوَ مَذْمُومٌ وَ مَنْ لَمْ يُعْطِ قَاعِداً مُنِعَ قَائِماً وَ مَنْ يَطْلُبِ الْعِزَّ بِغَيْرِ حَقٍّ يَذِلَّ وَ مَنْ يَغْلِبْ بِالْجَوْرِ يُغْلَبْ وَ مَنْ عَانَدَ الْحَقَّ لَزِمَهُ الْوَهْنُ وَ مَنْ تَفَقَّهَ وُقِّرَ وَ مَنْ تَكَبَّرَ حُقِّرَ وَ مَنْ لَا يُحْسِنْ لَا يُحْمَدْ ",
          "أَيُّهَا النَّاسُ إِنَّ الْمَنِيَّةَ قَبْلَ الدَّنِيَّةِ وَ التَّجَلُّدَ قَبْلَ التَّبَلُّدِ وَ الْحِسَابَ قَبْلَ الْعِقَابِ وَ الْقَبْرَ خَيْرٌ مِنَ الْفَقْرِ وَ غَضَّ الْبَصَرِ خَيْرٌ مِنْ كَثِيرٍ مِنَ النَّظَرِ وَ الدَّهْرَ يَوْمٌ لَكَ وَ يَوْمٌ عَلَيْكَ فَإِذَا كَانَ لَكَ فَلَا تَبْطَرْ وَ إِذَا كَانَ عَلَيْكَ فَاصْبِرْ فَبِكِلَيْهِمَا تُمْتَحَنُ [وَ فِي نُسْخَةٍ وَ كِلَاهُمَا سَيُخْتَبَرُ] ",
          "أَيُّهَا النَّاسُ أَعْجَبُ مَا فِي الْإِنْسَانِ قَلْبُهُ وَ لَهُ مَوَادُّ مِنَ الْحِكْمَةِ وَ أَضْدَادٌ مِنْ خِلَافِهَا فَإِنْ سَنَحَ لَهُ الرَّجَاءُ أَذَلَّهُ الطَّمَعُ وَ إِنْ هَاجَ بِهِ الطَّمَعُ أَهْلَكَهُ الْحِرْصُ وَ إِنْ مَلَكَهُ الْيَأْسُ قَتَلَهُ الْأَسَفُ وَ إِنْ عَرَضَ لَهُ الْغَضَبُ اشْتَدَّ بِهِ الْغَيْظُ وَ إِنْ أُسْعِدَ بِالرِّضَى نَسِيَ التَّحَفُّظَ وَ إِنْ نَالَهُ الْخَوْفُ شَغَلَهُ الْحَذَرُ وَ إِنِ اتَّسَعَ لَهُ الْأَمْنُ اسْتَلَبَتْهُ الْعِزَّةُ [وَ فِي نُسْخَةٍ أَخَذَتْهُ الْعِزَّةُ] وَ إِنْ جُدِّدَتْ لَهُ نِعْمَةٌ أَخَذَتْهُ الْعِزَّةُ وَ إِنْ أَفَادَ مَالًا أَطْغَاهُ الْغِنَى وَ إِنْ عَضَّتْهُ فَاقَةٌ شَغَلَهُ الْبَلَاءُ [وَ فِي نُسْخَةٍ جَهَدَهُ الْبُكَاءُ] وَ إِنْ أَصَابَتْهُ مُصِيبَةٌ فَضَحَهُ الْجَزَعُ وَ إِنْ أَجْهَدَهُ الْجُوعُ قَعَدَ بِهِ الضَّعْفُ وَ إِنْ أَفْرَطَ فِي الشِّبَعِ كَظَّتْهُ الْبِطْنَةُ فَكُلُّ تَقْصِيرٍ بِهِ مُضِرٌّ وَ كُلُّ إِفْرَاطٍ لَهُ مُفْسِدٌ ",
          "أَيُّهَا النَّاسُ إِنَّهُ مَنْ فَلَّ ذَلَّ وَ مَنْ جَادَ سَادَ وَ مَنْ كَثُرَ مَالُهُ رَأَسَ وَ مَنْ كَثُرَ حِلْمُهُ نَبُلَ وَ مَنْ أَفْكَرَ فِي ذَاتِ اللَّهِ تَزَنْدَقَ وَ مَنْ أَكْثَرَ مِنْ شَيْ‏ءٍ عُرِفَ بِهِ وَ مَنْ كَثُرَ مِزَاحُهُ اسْتُخِفَّ بِهِ وَ مَنْ كَثُرَ ضِحْكُهُ ذَهَبَتْ هَيْبَتُهُ فَسَدَ حَسَبُ مَنْ لَيْسَ لَهُ أَدَبٌ إِنَّ أَفْضَلَ الْفِعَالِ صِيَانَةُ الْعِرْضِ بِالْمَالِ لَيْسَ مَنْ جَالَسَ الْجَاهِلَ بِذِي مَعْقُولٍ مَنْ جَالَسَ الْجَاهِلَ فَلْيَسْتَعِدَّ لِقِيلٍ ",
          "وَ قَالٍ لَنْ يَنْجُوَ مِنَ الْمَوْتِ غَنِيٌّ بِمَالِهِ وَ لَا فَقِيرٌ لِإِقْلَالِهِ أَيُّهَا النَّاسُ لَوْ أَنَّ الْمَوْتَ يُشْتَرَى لَاشْتَرَاهُ مِنْ أَهْلِ الدُّنْيَا الْكَرِيمُ الْأَبْلَجُ وَ اللَّئِيمُ الْمَلْهُوجُ ",
          "أَيُّهَا النَّاسُ إِنَّ لِلْقُلُوبِ شَوَاهِدَ تُجْرِي الْأَنْفُسَ عَنْ مَدْرَجَةِ أَهْلِ التَّفْرِيطِ وَ فِطْنَةُ الْفَهْمِ لِلْمَوَاعِظِ مَا يَدْعُو النَّفْسَ إِلَى الْحَذَرِ مِنَ الْخَطَرِ وَ لِلْقُلُوبِ خَوَاطِرَ لِلْهَوَى وَ الْعُقُولُ تَزْجُرُ وَ تَنْهَى وَ فِي التَّجَارِبِ عِلْمٌ مُسْتَأْنَفٌ وَ الِاعْتِبَارُ يَقُودُ إِلَى الرَّشَادِ وَ كَفَاكَ أَدَباً لِنَفْسِكَ مَا تَكْرَهُهُ لِغَيْرِكَ وَ عَلَيْكَ لِأَخِيكَ الْمُؤْمِنِ مِثْلُ الَّذِي لَكَ عَلَيْهِ لَقَدْ خَاطَرَ مَنِ اسْتَغْنَى بِرَأْيِهِ وَ التَّدَبُّرُ قَبْلَ الْعَمَلِ فَإِنَّهُ يُؤْمِنُكَ مِنَ النَّدَمِ وَ مَنِ اسْتَقْبَلَ وُجُوهَ الْآرَاءِ عَرَفَ مَوَاقِعَ الْخَطَإِ وَ مَنْ أَمْسَكَ عَنِ الْفُضُولِ عَدَلَتْ رَأْيَهُ الْعُقُولُ ",
          "وَ مَنْ حَصَّنَ شَهْوَتَهُ فَقَدْ صَانَ قَدْرَهُ وَ مَنْ أَمْسَكَ لِسَانَهُ أَمِنَهُ قَوْمُهُ وَ نَالَ حَاجَتَهُ وَ فِي تَقَلُّبِ الْأَحْوَالِ عِلْمُ جَوَاهِرِ الرِّجَالِ وَ الْأَيَّامُ تُوضِحُ لَكَ السَّرَائِرَ الْكَامِنَةَ وَ لَيْسَ فِي الْبَرْقِ الْخَاطِفِ مُسْتَمْتَعٌ لِمَنْ يَخُوضُ فِي الظُّلْمَةِ وَ مَنْ عُرِفَ بِالْحِكْمَةِ لَحَظَتْهُ الْعُيُونُ بِالْوَقَارِ وَ الْهَيْبَةِ وَ أَشْرَفُ الْغِنَى تَرْكُ الْمُنَى وَ الصَّبْرُ جُنَّةٌ مِنَ الْفَاقَةِ وَ الْحِرْصُ عَلَامَةُ الْفَقْرِ وَ الْبُخْلُ جِلْبَابُ الْمَسْكَنَةِ وَ الْمَوَدَّةُ قَرَابَةٌ مُسْتَفَادَةٌ وَ وَصُولٌ مُعْدِمٌ خَيْرٌ مِنْ جَافٍ مُكْثِرٍ ",
          "وَ الْمَوْعِظَةُ كَهْفٌ لِمَنْ وَعَاهَا وَ مَنْ أَطْلَقَ طَرْفَهُ كَثُرَ أَسَفُهُ وَ قَدْ أَوْجَبَ الدَّهْرُ شُكْرَهُ عَلَى مَنْ نَالَ سُؤْلَهُ وَ قَلَّ مَا يُنْصِفُكَ اللِّسَانُ فِي نَشْرِ قَبِيحٍ أَوْ إِحْسَانٍ وَ مَنْ ضَاقَ خُلُقُهُ مَلَّهُ أَهْلُهُ وَ مَنْ نَالَ اسْتَطَالَ وَ قَلَّ مَا تَصْدُقُكَ الْأُمْنِيَّةُ وَ التَّوَاضُعُ يَكْسُوكَ الْمَهَابَةَ وَ فِي سَعَةِ الْأَخْلَاقِ كُنُوزُ الْأَرْزَاقِ كَمْ مِنْ عَاكِفٍ عَلَى ذَنْبِهِ فِي آخِرِ أَيَّامِ عُمُرِهِ وَ مَنْ كَسَاهُ الْحَيَاءُ ثَوْبَهُ خَفِيَ عَلَى النَّاسِ عَيْبُهُ ",
          "وَ انْحُ الْقَصْدَ مِنَ الْقَوْلِ فَإِنَّ مَنْ تَحَرَّى الْقَصْدَ خَفَّتْ عَلَيْهِ الْمُؤَنُ وَ فِي خِلَافِ النَّفْسِ رُشْدُكَ مَنْ عَرَفَ الْأَيَّامَ لَمْ يَغْفُلْ عَنِ الِاسْتِعْدَادِ أَلَا وَ إِنَّ مَعَ كُلِّ جُرْعَةٍ شَرَقاً وَ إِنَّ فِي كُلِّ أُكْلَةٍ غُصَصاً لَا تُنَالُ نِعْمَةٌ إِلَّا بِزَوَالِ أُخْرَى وَ لِكُلِّ ذِي رَمَقٍ قُوتٌ وَ لِكُلِّ حَبَّةٍ آكِلٌ وَ أَنْتَ قُوتُ الْمَوْتِ ",
          "اعْلَمُوا أَيُّهَا النَّاسُ أَنَّهُ مَنْ مَشَى عَلَى وَجْهِ الْأَرْضِ فَإِنَّهُ يَصِيرُ إِلَى بَطْنِهَا وَ اللَّيْلُ وَ النَّهَارُ يَتَنَازَعَانِ [يَتَسَارَعَانِ] فِي هَدْمِ الْأَعْمَارِ ",
          "يَا أَيُّهَا النَّاسُ كُفْرُ النِّعْمَةِ لُؤْمٌ وَ صُحْبَةُ الْجَاهِلِ شُؤْمٌ إِنَّ مِنَ الْكَرَمِ لِينَ الْكَلَامِ وَ مِنَ الْعِبَادَةِ إِظْهَارَ اللِّسَانِ وَ إِفْشَاءَ السَّلَامِ",
          "إِيَّاكَ وَ الْخَدِيعَةَ فَإِنَّهَا مِنْ خُلُقِ اللَّئِيمِ لَيْسَ كُلُّ طَالِبٍ يُصِيبُ وَ لَا كُلُّ غَائِبٍ يَئُوبُ لَا تَرْغَبْ فِيمَنْ زَهِدَ فِيكَ رُبَّ بَعِيدٍ هُوَ أَقْرَبُ مِنْ قَرِيبٍ سَلْ عَنِ الرَّفِيقِ قَبْلَ الطَّرِيقِ وَ عَنِ الْجَارِ قَبْلَ الدَّارِ أَلَا وَ مَنْ أَسْرَعَ فِي الْمَسِيرِ أَدْرَكَهُ الْمَقِيلُ اسْتُرْ عَوْرَةَ أَخِيكَ كَمَا تَعْلَمُهَا فِيكَ اغْتَفِرْ زَلَّةَ صَدِيقِكَ لِيَوْمِ يَرْكَبُكَ عَدُوُّكَ ",
          "مَنْ غَضِبَ عَلَى مَنْ لَا يَقْدِرُ عَلَى ضَرِّهِ طَالَ حُزْنُهُ وَ عَذَّبَ نَفْسَهُ مَنْ خَافَ رَبَّهُ كَفَّ ظُلْمَهُ [مَنْ خَافَ رَبَّهُ كُفِيَ عَذَابَهُ] وَ مَنْ لَمْ يَزِغْ فِي كَلَامِهِ أَظْهَرَ فَخْرَهُ وَ مَنْ لَمْ يَعْرِفِ الْخَيْرَ مِنَ الشَّرِّ فَهُوَ بِمَنْزِلَةِ الْبَهِيمَةِ",
          "إِنَّ مِنَ الْفَسَادِ إِضَاعَةَ الزَّادِ مَا أَصْغَرَ الْمُصِيبَةَ مَعَ عِظَمِ الْفَاقَةِ غَداً هَيْهَاتَ هَيْهَاتَ وَ مَا تَنَاكَرْتُمْ إِلَّا لِمَا فِيكُمْ مِنَ الْمَعَاصِي وَ الذُّنُوبِ فَمَا أَقْرَبَ الرَّاحَةَ مِنَ التَّعَبِ وَ الْبُؤْسَ مِنَ النَّعِيمِ وَ مَا شَرٌّ بِشَرٍّ بَعْدَهُ الْجَنَّةُ وَ مَا خَيْرٌ بِخَيْرٍ بَعْدَهُ النَّارُ وَ كُلُّ نَعِيمٍ دُونَ الْجَنَّةِ مَحْقُورٌ وَ كُلُّ بَلَاءٍ دُونَ النَّارِ عَافِيَةٌ ",
          "وَ عِنْدَ تَصْحِيحِ الضَّمَائِرِ تُبْدُو الْكَبَائِرُ تَصْفِيَةُ الْعَمَلِ أَشَدُّ مِنَ الْعَمَلِ وَ تَخْلِيصُ النِّيَّةِ مِنَ الْفَسَادِ أَشَدُّ عَلَى الْعَامِلِينَ مِنْ طُولِ الْجِهَادِ هَيْهَاتَ لَوْ لَا التُّقَى لَكُنْتُ أَدْهَى الْعَرَبِ",
          "أَيُّهَا النَّاسُ إِنَّ اللَّهَ تَعَالَى وَعَدَ نَبِيَّهُ مُحَمَّداً ( صلى الله عليه وآله ) الْوَسِيلَةَ وَ وَعْدُهُ الْحَقُّ وَ لَنْ يُخْلِفَ اللَّهُ وَعْدَهُ أَلَا وَ إِنَّ الْوَسِيلَةَ عَلَى دَرَجِ الْجَنَّةِ وَ ذِرْوَةِ ذَوَائِبِ الزُّلْفَةِ وَ نِهَايَةِ غَايَةِ الْأُمْنِيَّةِ لَهَا أَلْفُ مِرْقَاةٍ مَا بَيْنَ الْمِرْقَاةِ إِلَى الْمِرْقَاةِ حُضْرُ الْفَرَسِ الْجَوَادِ مِائَةَ عَامٍ وَ هُوَ مَا بَيْنَ مِرْقَاةِ دُرَّةٍ إِلَى مِرْقَاةِ جَوْهَرَةٍ إِلَى مِرْقَاةِ زَبَرْجَدَةٍ إِلَى مِرْقَاةِ لُؤْلُؤَةٍ إِلَى مِرْقَاةِ يَاقُوتَةٍ إِلَى مِرْقَاةِ زُمُرُّدَةٍ إِلَى مِرْقَاةِ مَرْجَانَةٍ إِلَى مِرْقَاةِ كَافُورٍ إِلَى مِرْقَاةِ عَنْبَرٍ إِلَى مِرْقَاةِ يَلَنْجُوجٍ إِلَى مِرْقَاةِ ذَهَبٍ إِلَى مِرْقَاةِ غَمَامٍ إِلَى مِرْقَاةِ هَوَاءٍ إِلَى مِرْقَاةِ نُورٍ قَدْ أَنَافَتْ عَلَى كُلِّ الْجِنَانِ",
          "وَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَوْمَئِذٍ قَاعِدٌ عَلَيْهَا مُرْتَدٍ بِرَيْطَتَيْنِ رَيْطَةٍ مِنْ رَحْمَةِ اللَّهِ وَ رَيْطَةٍ مِنْ نُورِ اللَّهِ عَلَيْهِ تَاجُ النُّبُوَّةِ وَ إِكْلِيلُ الرِّسَالَةِ قَدْ أَشْرَقَ بِنُورِهِ الْمَوْقِفُ ",
          "وَ أَنَا يَوْمَئِذٍ عَلَى الدَّرَجَةِ الرَّفِيعَةِ وَ هِيَ دُونَ دَرَجَتِهِ وَ عَلَيَّ رَيْطَتَانِ رَيْطَةٌ مِنْ أُرْجُوَانِ النُّورِ وَ رَيْطَةٌ مِنْ كَافُورٍ وَ الرُّسُلُ وَ الْأَنْبِيَاءُ قَدْ وَقَفُوا عَلَى الْمَرَاقِي وَ أَعْلَامُ الْأَزْمِنَةِ وَ حُجَجُ الدُّهُورِ عَنْ أَيْمَانِنَا وَ قَدْ تَجَلَّلَهُمْ حُلَلُ النُّورِ وَ الْكَرَامَةِ لَا يَرَانَا مَلَكٌ مُقَرَّبٌ وَ لَا نَبِيٌّ مُرْسَلٌ إِلَّا بُهِتَ بِأَنْوَارِنَا",
          "وَ عَجِبَ مِنْ ضِيَائِنَا وَ جَلَالَتِنَا وَ عَنْ يَمِينِ الْوَسِيلَةِ عَنْ يَمِينِ الرَّسُولِ ( صلى الله عليه وآله ) غَمَامَةٌ بَسْطَةَ الْبَصَرِ يَأْتِي مِنْهَا النِّدَاءُ يَا أَهْلَ الْمَوْقِفِ طُوبَى لِمَنْ أَحَبَّ الْوَصِيَّ وَ آمَنَ بِالنَّبِيِّ الْأُمِّيِّ الْعَرَبِيِّ وَ مَنْ كَفَرَ فَالنَّارُ مَوْعِدُهُ ",
          "وَ عَنْ يَسَارِ الْوَسِيلَةِ عَنْ يَسَارِ الرَّسُولِ ( صلى الله عليه وآله ) ظُلَّةٌ يَأْتِي مِنْهَا النِّدَاءُ يَا أَهْلَ الْمَوْقِفِ طُوبَى لِمَنْ أَحَبَّ الْوَصِيَّ وَ آمَنَ بِالنَّبِيِّ الْأُمِّيِّ وَ الَّذِي لَهُ الْمُلْكُ الْأَعْلَى لَا فَازَ أَحَدٌ وَ لَا نَالَ الرَّوْحَ وَ الْجَنَّةَ إِلَّا مَنْ لَقِيَ خَالِقَهُ بِالْإِخْلَاصِ لَهُمَا وَ الِاقْتِدَارِ بِنُجُومِهِمَا فَأَيْقِنُوا يَا أَهْلَ وَلَايَةِ اللَّهِ بِبَيَاضِ وُجُوهِكُمْ وَ شَرَفِ مَقْعَدِكُمْ وَ كَرَمِ مَآبِكُمْ وَ بِفَوْزِكُمُ الْيَوْمَ عَلَى سُرُرٍ مُتَقَابِلِينَ",
          "وَ يَا أَهْلَ الِانْحِرَافِ وَ الصُّدُودِ عَنِ اللَّهِ عَزَّ ذِكْرُهُ وَ رَسُولِهِ وَ صِرَاطِهِ وَ أَعْلَامِ الْأَزْمِنَةِ أَيْقِنُوا بِسَوَادِ وُجُوهِكُمْ وَ غَضَبِ رَبِّكُمْ جَزَاءً بِمَا كُنْتُمْ تَعْمَلُونَ وَ مَا مِنْ رَسُولٍ سَلَفَ وَ لَا نَبِيٍّ مَضَى إِلَّا وَ قَدْ كَانَ مُخْبِراً أُمَّتَهُ بِالْمُرْسَلِ الْوَارِدِ مِنْ بَعْدِهِ وَ مُبَشِّراً بِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ مُوصِياً قَوْمَهُ بِاتِّبَاعِهِ وَ مُحَلِّيَهُ عِنْدَ قَوْمِهِ لِيَعْرِفُوهُ بِصِفَتِهِ وَ لِيَتَّبِعُوهُ عَلَى شَرِيعَتِهِ وَ لِئَلَّا يَضِلُّوا فِيهِ مِنْ بَعْدِهِ فَيَكُونَ مَنْ هَلَكَ أَوْ ضَلَّ بَعْدَ وُقُوعِ الْإِعْذَارِ وَ الْإِنْذَارِ عَنْ بَيِّنَةٍ وَ تَعْيِينِ حُجَّةٍ ",
          "فَكَانَتِ الْأُمَمُ فِي رَجَاءٍ مِنَ الرُّسُلِ وَ وُرُودٍ مِنَ الْأَنْبِيَاءِ وَ لَئِنْ أُصِيبَتْ بِفَقْدِ نَبِيٍّ بَعْدَ نَبِيٍّ عَلَى عِظَمِ مَصَائِبِهِمْ وَ فَجَائِعِهَا بِهِمْ فَقَدْ كَانَتْ عَلَى سَعَةٍ مِنَ الْأَمَلِ وَ لَا مُصِيبَةٌ عَظُمَتْ وَ لَا رَزِيَّةٌ جَلَّتْ كَالْمُصِيبَةِ بِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) لِأَنَّ اللَّهَ خَتَمَ بِهِ الْإِنْذَارَ وَ الْإِعْذَارَ وَ قَطَعَ بِهِ الِاحْتِجَاجَ وَ الْعُذْرَ بَيْنَهُ وَ بَيْنَ خَلْقِهِ وَ جَعَلَهُ بَابَهُ الَّذِي بَيْنَهُ وَ بَيْنَ عِبَادِهِ وَ مُهَيْمِنَهُ الَّذِي لَا يَقْبَلُ إِلَّا بِهِ وَ لَا قُرْبَةَ إِلَيْهِ إِلَّا بِطَاعَتِهِ ",
          "وَ قَالَ فِي مُحْكَمِ كِتَابِهِ مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ اللَّهَ وَ مَنْ تَوَلَّى فَما أَرْسَلْناكَ عَلَيْهِمْ حَفِيظاً فَقَرَنَ طَاعَتَهُ بِطَاعَتِهِ وَ مَعْصِيَتَهُ بِمَعْصِيَتِهِ فَكَانَ ذَلِكَ دَلِيلًا عَلَى مَا فَوَّضَ إِلَيْهِ وَ شَاهِداً لَهُ عَلَى مَنِ اتَّبَعَهُ وَ عَصَاهُ وَ بَيَّنَ ذَلِكَ فِي غَيْرِ مَوْضِعٍ مِنَ الْكِتَابِ الْعَظِيمِ",
          "فَقَالَ تَبَارَكَ وَ تَعَالَى فِي التَّحْرِيضِ عَلَى اتَّبَاعِهِ وَ التَّرْغِيبِ فِي تَصْدِيقِهِ وَ الْقَبُولِ بِدَعْوَتِهِ قُلْ إِنْ كُنْتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ وَ يَغْفِرْ لَكُمْ ذُنُوبَكُمْ فَاتِّبَاعُهُ ( صلى الله عليه وآله ) مَحَبَّةُ اللَّهِ وَ رِضَاهُ غُفْرَانُ الذُّنُوبِ وَ كَمَالُ الْفَوْزِ وَ وُجُوبُ الْجَنَّةِ وَ فِي التَّوَلِّي عَنْهُ وَ الْإِعْرَاضِ مُحَادَّةُ اللَّهِ وَ غَضَبُهُ وَ سَخَطُهُ وَ الْبُعْدُ مِنْهُ مُسْكِنُ النَّارِ وَ ذَلِكَ قَوْلُهُ وَ مَنْ يَكْفُرْ بِهِ مِنَ الْأَحْزابِ فَالنَّارُ مَوْعِدُهُ يَعْنِي الْجُحُودَ بِهِ وَ الْعِصْيَانَ لَهُ",
          "فَإِنَّ اللَّهَ تَبَارَكَ اسْمُهُ امْتَحَنَ بِي عِبَادَهُ وَ قَتَلَ بِيَدِي أَضْدَادَهُ وَ أَفْنَى بِسَيْفِي جُحَّادَهُ وَ جَعَلَنِي زُلْفَةً لِلْمُؤْمِنِينَ وَ حِيَاضَ مَوْتٍ عَلَى الْجَبَّارِينَ وَ سَيْفَهُ عَلَى الْمُجْرِمِينَ وَ شَدَّ بِي أَزْرَ رَسُولِهِ وَ أَكْرَمَنِي بِنَصْرِهِ وَ شَرَّفَنِي بِعِلْمِهِ وَ حَبَانِي بِأَحْكَامِهِ وَ اخْتَصَّنِي بِوَصِيَّتِهِ وَ اصْطَفَانِي بِخِلَافَتِهِ فِي أُمَّتِهِ فَقَالَ ( صلى الله عليه وآله ) وَ قَدْ حَشَدَهُ الْمُهَاجِرُونَ وَ الْأَنْصَارُ وَ انْغَصَّتْ بِهِمُ الْمَحَافِلُ أَيُّهَا النَّاسُ إِنَّ عَلِيّاً مِنِّي كَهَارُونَ مِنْ مُوسَى إِلَّا أَنَّهُ لَا نَبِيَّ بَعْدِي ",
          "فَعَقَلَ الْمُؤْمِنُونَ عَنِ اللَّهِ نَطَقَ الرَّسُولُ إِذْ عَرَفُونِي أَنِّي لَسْتُ بِأَخِيهِ لِأَبِيهِ وَ أُمِّهِ كَمَا كَانَ هَارُونُ أَخَا مُوسَى لِأَبِيهِ وَ أُمِّهِ وَ لَا كُنْتُ نَبِيّاً فَاقْتَضَى نُبُوَّةً وَ لَكِنْ كَانَ ذَلِكَ مِنْهُ اسْتِخْلَافاً لِي كَمَا اسْتَخْلَفَ مُوسَى هَارُونَ (عليه السلام) حَيْثُ يَقُولُ اخْلُفْنِي فِي قَوْمِي وَ أَصْلِحْ وَ لا تَتَّبِعْ سَبِيلَ الْمُفْسِدِينَ",
          "وَ قَوْلُهُ ( عليه السلام ) حِينَ تَكَلَّمَتْ طَائِفَةٌ فَقَالَتْ نَحْنُ مَوَالِي رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَخَرَجَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِلَى حَجَّةِ الْوَدَاعِ ثُمَّ صَارَ إِلَى غَدِيرِ خُمٍّ فَأَمَرَ فَأُصْلِحَ لَهُ شِبْهُ الْمِنْبَرِ ثُمَّ عَلَاهُ وَ أَخَذَ بِعَضُدِي حَتَّى رُئِيَ بَيَاضُ إِبْطَيْهِ رَافِعاً صَوْتَهُ قَائِلًا فِي مَحْفِلِهِ مَنْ كُنْتُ مَوْلَاهُ فَعَلِيٌّ مَوْلَاهُ اللَّهُمَّ وَالِ مَنْ وَالَاهُ وَ عَادِ مَنْ عَادَاهُ فَكَانَتْ عَلَى وَلَايَتِي وَلَايَةُ اللَّهِ وَ عَلَى عَدَاوَتِي عَدَاوَةُ اللَّهِ",
          "وَ أَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ فِي ذَلِكَ الْيَوْمِ الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَ أَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَ رَضِيتُ لَكُمُ الْإِسْلامَ دِيناً فَكَانَتْ وَلَايَتِي كَمَالَ الدِّينِ وَ رِضَا الرَّبِّ جَلَّ ذِكْرُهُ وَ أَنْزَلَ اللَّهُ تَبَارَكَ وَ تَعَالَى اخْتِصَاصاً لِي وَ تَكَرُّماً نَحَلَنِيهِ وَ إِعْظَاماً وَ تَفْصِيلًا مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مَنَحَنِيهِ وَ هُوَ قَوْلُهُ تَعَالَى ثُمَّ رُدُّوا إِلَى اللَّهِ مَوْلاهُمُ الْحَقِّ أَلا لَهُ الْحُكْمُ وَ هُوَ أَسْرَعُ الْحاسِبِينَ ",
          "فِيَّ مَنَاقِبُ لَوْ ذَكَرْتُهَا لَعَظُمَ بِهَا الِارْتِفَاعُ فَطَالَ لَهَا الِاسْتِمَاعُ وَ لَئِنْ تَقَمَّصَهَا دُونِيَ الْأَشْقَيَانِ وَ نَازَعَانِي فِيمَا لَيْسَ لَهُمَا بِحَقٍّ وَ رَكِبَاهَا ضَلَالَةً وَ اعْتَقَدَاهَا جَهَالَةً فَلَبِئْسَ مَا عَلَيْهِ وَرَدَا وَ لَبِئْسَ مَا لِأَنْفُسِهِمَا مَهَّدَا يَتَلَاعَنَانِ فِي دُورِهِمَا وَ يَتَبَرَّأُ كُلُّ وَاحِدٍ مِنْهُمَا مِنْ صَاحِبِهِ يَقُولُ لِقَرِينِهِ إِذَا الْتَقَيَا يا لَيْتَ بَيْنِي وَ بَيْنَكَ بُعْدَ الْمَشْرِقَيْنِ فَبِئْسَ الْقَرِينُ فَيُجِيبُهُ الْأَشْقَى عَلَى رُثُوثَةٍ يَا لَيْتَنِي لَمْ أَتَّخِذْكَ خَلِيلًا لَقَدْ أَضْلَلْتَنِي عَنِ الذِّكْرِ بَعْدَ إِذْ جَاءَنِي وَ كَانَ الشَّيْطَانُ لِلْإِنْسَانِ خَذُولًا",
          "فَأَنَا الذِّكْرُ الَّذِي عَنْهُ ضَلَّ وَ السَّبِيلُ الَّذِي عَنْهُ مَالَ وَ الْإِيمَانُ الَّذِي بِهِ كَفَرَ وَ الْقُرْآنُ الَّذِي إِيَّاهُ هَجَرَ وَ الدِّينُ الَّذِي بِهِ كَذَّبَ وَ الصِّرَاطُ الَّذِي عَنْهُ نَكَبَ وَ لَئِنْ رَتَعَا فِي الْحُطَامِ الْمُنْصَرِمِ وَ الْغُرُورِ الْمُنْقَطِعِ وَ كَانَا مِنْهُ عَلَى شَفَا حُفْرَةٍ مِنَ النَّارِ لَهُمَا عَلَى شَرِّ وُرُودٍ فِي أَخْيَبِ وُفُودٍ وَ أَلْعَنِ مَوْرُودٍ يَتَصَارَخَانِ بِاللَّعْنَةِ وَ يَتَنَاعَقَانِ بِالْحَسْرَةِ مَا لَهُمَا مِنْ رَاحَةٍ وَ لَا عَنْ عَذَابِهِمَا مِنْ مَنْدُوحَةٍ",
          "إِنَّ الْقَوْمَ لَمْ يَزَالُوا عُبَّادَ أَصْنَامٍ وَ سَدَنَةَ أَوْثَانٍ يُقِيمُونَ لَهَا الْمَنَاسِكَ وَ يَنْصِبُونَ لَهَا الْعَتَائِرَ وَ يَتَّخِذُونَ لَهَا الْقُرْبَانَ وَ يَجْعَلُونَ لَهَا الْبَحِيرَةَ وَ الْوَصِيلَةَ وَ السَّائِبَةَ وَ الْحَامَ وَ يَسْتَقْسِمُونَ بِالْأَزْلَامِ عَامِهِينَ عَنِ اللَّهِ عَزَّ ذِكْرُهُ حَائِرِينَ عَنِ الرَّشَادِ مُهْطِعِينَ إِلَى الْبِعَادِ وَ قَدِ اسْتَحْوَذَ عَلَيْهِمُ الشَّيْطَانُ وَ غَمَرَتْهُمْ سَوْدَاءُ الْجَاهِلِيَّةِ وَ رَضَعُوهَا جَهَالَةً وَ انْفَطَمُوهَا ضَلَالَةً ",
          "فَأَخْرَجَنَا اللَّهُ إِلَيْهِمْ رَحْمَةً وَ أَطْلَعَنَا عَلَيْهِمْ رَأْفَةً وَ أَسْفَرَ بِنَا عَنِ الْحُجُبِ نُوراً لِمَنِ اقْتَبَسَهُ وَ فَضْلًا لِمَنِ اتَّبَعَهُ وَ تَأْيِيداً لِمَنْ صَدَّقَهُ فَتَبَوَّءُوا الْعِزَّ بَعْدَ الذِّلَّةِ وَ الْكَثْرَةَ بَعْدَ الْقِلَّةِ وَ هَابَتْهُمُ الْقُلُوبُ وَ الْأَبْصَارُ وَ أَذْعَنَتْ لَهُمُ الْجَبَابِرَةُ وَ طَوَائِفُهَا وَ صَارُوا أَهْلَ نِعْمَةٍ مَذْكُورَةٍ وَ كَرَامَةٍ مَيْسُورَةٍ وَ أَمْنٍ بَعْدَ خَوْفٍ وَ جَمْعٍ بَعْدَ كَوْفٍ ",
          "وَ أَضَاءَتْ بِنَا مَفَاخِرُ مَعَدِّ بْنِ عَدْنَانَ وَ أَوْلَجْنَاهُمْ بَابَ الْهُدَى وَ أَدْخَلْنَاهُمْ دَارَ السَّلَامِ وَ أَشْمَلْنَاهُمْ ثَوْبَ الْإِيمَانِ وَ فَلَجُوا بِنَا فِي الْعَالَمِينَ وَ أَبْدَتْ لَهُمْ أَيَّامُ الرَّسُولِ آثَارَ الصَّالِحِينَ مِنْ حَامٍ مُجَاهِدٍ وَ مُصَلٍّ قَانِتٍ وَ مُعْتَكِفٍ زَاهِدٍ يُظْهِرُونَ الْأَمَانَةَ وَ يَأْتُونَ الْمَثَابَةَ حَتَّى إِذَا دَعَا اللَّهُ عَزَّ وَ جَلَّ نَبِيَّهُ ( صلى الله عليه وآله ) وَ رَفَعَهُ إِلَيْهِ ",
          "لَمْ يَكُ ذَلِكَ بَعْدَهُ إِلَّا كَلَمْحَةٍ مِنْ خَفْقَةٍ أَوْ وَمِيضٍ مِنْ بَرْقَةٍ إِلَى أَنْ رَجَعُوا عَلَى الْأَعْقَابِ وَ انْتَكَصُوا عَلَى الْأَدْبَارِ وَ طَلَبُوا بِالْأَوْتَارِ وَ أَظْهَرُوا الْكَتَائِبَ وَ رَدَمُوا الْبَابَ وَ فَلُّوا الدِّيَارَ وَ غَيَّرُوا آثَارَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ رَغِبُوا عَنْ أَحْكَامِهِ وَ بَعُدُوا مِنْ أَنْوَارِهِ وَ اسْتَبْدَلُوا بِمُسْتَخْلَفِهِ بَدِيلًا لَمْ يَكُ ذَلِكَ بَعْدَهُ إِلَّا كَلَمْحَةٍ مِنْ خَفْقَةٍ أَوْ وَمِيضٍ مِنْ بَرْقَةٍ إِلَى أَنْ رَجَعُوا عَلَى الْأَعْقَابِ وَ انْتَكَصُوا عَلَى الْأَدْبَارِ وَ طَلَبُوا بِالْأَوْتَارِ وَ أَظْهَرُوا الْكَتَائِبَ وَ رَدَمُوا الْبَابَ وَ فَلُّوا الدِّيَارَ وَ غَيَّرُوا آثَارَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ رَغِبُوا عَنْ أَحْكَامِهِ وَ بَعُدُوا مِنْ أَنْوَارِهِ وَ اسْتَبْدَلُوا بِمُسْتَخْلَفِهِ بَدِيلًا اتَّخَذُوهُ وَ كَانُوا ظَالِمِينَ وَ زَعَمُوا أَنَّ مَنِ اخْتَارُوا مِنْ آلِ أَبِي قُحَافَةَ أَوْلَى بِمَقَامِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مِمَّنِ اخْتَارَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِمَقَامِهِ وَ أَنَّ مُهَاجِرَ آلِ أَبِي قُحَافَةَ خَيْرٌ مِنَ الْمُهَاجِرِيِّ الْأَنْصَارِيِّ الرَّبَّانِيِّ نَامُوسِ هَاشِمِ بْنِ عَبْدِ مَنَافٍ أَلَا وَ إِنَّ أَوَّلَ شَهَادَةِ زُورٍ وَقَعَتْ فِي الْإِسْلَامِ شَهَادَتُهُمْ أَنَّ صَاحِبَهُمْ مُسْتَخْلَفُ رَسُولِ اللَّهِ ( صلى الله عليه وآله )",
          "فَلَمَّا كَانَ مِنْ أَمْرِ سَعْدِ بْنِ عُبَادَةَ مَا كَانَ رَجَعُوا عَنْ ذَلِكَ وَ قَالُوا إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) مَضَى وَ لَمْ يَسْتَخْلِفْ فَكَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الطَّيِّبُ الْمُبَارَكُ أَوَّلَ مَشْهُودٍ عَلَيْهِ بِالزُّورِ فِي الْإِسْلَامِ وَ عَنْ قَلِيلٍ يَجِدُونَ غِبَّ مَا [يَعْلَمُونَ وَ سَيَجِدُونَ التَّالُونَ غِبَّ مَا] أَسَّسَهُ الْأَوَّلُونَ وَ لَئِنْ كَانُوا فِي مَنْدُوحَةٍ مِنَ الْمَهْلِ وَ شِفَاءٍ مِنَ الْأَجَلِ وَ سَعَةٍ مِنَ الْمُنْقَلَبِ وَ اسْتِدْرَاجٍ مِنَ الْغُرُورِ وَ سُكُونٍ مِنَ الْحَالِ وَ إِدْرَاكٍ مِنَ الْأَمَلِ",
          "فَقَدْ أَمْهَلَ اللَّهُ عَزَّ وَ جَلَّ شَدَّادَ بْنَ عَادٍ وَ ثَمُودَ بْنَ عَبُّودٍ وَ بَلْعَمَ بْنَ بَاعُورٍ وَ أَسْبَغَ عَلَيْهِمْ نِعَمَهُ ظَاهِرَةً وَ بَاطِنَةً وَ أَمَدَّهُمْ بِالْأَمْوَالِ وَ الْأَعْمَارِ وَ أَتَتْهُمُ الْأَرْضُ بِبَرَكَاتِهَا لِيَذَّكَّرُوا آلَاءَ اللَّهِ وَ لِيَعْرِفُوا الْإِهَابَةَ لَهُ وَ الْإِنَابَةَ إِلَيْهِ وَ لِيَنْتَهُوا عَنِ الِاسْتِكْبَارِ ",
          "فَلَمَّا بَلَغُوا الْمُدَّةَ وَ اسْتَتَمُّوا الْأُكْلَةَ أَخَذَهُمُ اللَّهُ عَزَّ وَ جَلَّ وَ اصْطَلَمَهُمْ فَمِنْهُمْ مَنْ حُصِبَ وَ مِنْهُمْ مَنْ أَخَذَتْهُ الصَّيْحَةُ وَ مِنْهُمْ مَنْ أَحْرَقَتْهُ الظُّلَّةُ وَ مِنْهُمْ مَنْ أَوْدَتْهُ الرَّجْفَةُ وَ مِنْهُمْ مَنْ أَرْدَتْهُ الْخَسْفَةُ فَما كانَ اللَّهُ لِيَظْلِمَهُمْ وَ لكِنْ كانُوا أَنْفُسَهُمْ يَظْلِمُونَ ",
          "أَلَا وَ إِنَّ لِكُلِّ أَجَلٍ كِتَاباً فَإِذَا بَلَغَ الْكِتَابُ أَجَلَهُ لَوْ كُشِفَ لَكَ عَمَّا هَوَى إِلَيْهِ الظَّالِمُونَ وَ آلَ إِلَيْهِ الْأَخْسَرُونَ لَهَرَبْتَ إِلَى اللَّهِ عَزَّ وَ جَلَّ مِمَّا هُمْ عَلَيْهِ مُقِيمُونَ وَ إِلَيْهِ صَائِرُونَ ",
          "أَلَا وَ إِنِّي فِيكُمْ أَيُّهَا النَّاسُ كَهَارُونَ فِي آلِ فِرْعَوْنَ وَ كَبَابِ حِطَّةٍ فِي بَنِي إِسْرَائِيلَ وَ كَسَفِينَةِ نُوحٍ فِي قَوْمِ نُوحٍ إِنِّي النَّبَأُ الْعَظِيمُ وَ الصِّدِّيقُ الْأَكْبَرُ ",
          "وَ عَنْ قَلِيلٍ سَتَعْلَمُونَ مَا تُوعَدُونَ وَ هَلْ هِيَ إِلَّا كَلُعْقَةِ الْآكِلِ وَ مَذْقَةِ الشَّارِبِ وَ خَفْقَةِ الْوَسْنَانِ ثُمَّ تُلْزِمُهُمُ الْمَعَرَّاتُ خِزْياً فِي الدُّنْيَا وَ يَوْمَ الْقِيامَةِ يُرَدُّونَ إِلى أَشَدِّ الْعَذابِ وَ مَا اللَّهُ بِغَافِلٍ عَمَّا يَعْمَلُونَ فَمَا جَزَاءُ مَنْ تَنَكَّبَ مَحَجَّتَهُ وَ أَنْكَرَ حُجَّتَهُ وَ خَالَفَ هُدَاتَهُ وَ حَادَّ عَنْ نُورِهِ وَ اقْتَحَمَ فِي ظُلَمِهِ وَ اسْتَبْدَلَ بِالْمَاءِ السَّرَابَ وَ بِالنَّعِيمِ الْعَذَابَ وَ بِالْفَوْزِ الشَّقَاءَ وَ بِالسَّرَّاءِ الضَّرَّاءَ وَ بِالسَّعَةِ الضَّنْكَ",
          "إِلَّا جَزَاءُ اقْتِرَافِهِ وَ سُوءُ خِلَافِهِ فَلْيُوقِنُوا بِالْوَعْدِ عَلَى حَقِيقَتِهِ وَ لْيَسْتَيْقِنُوا بِمَا يُوعَدُونَ يَوْمَ تَأْتِي الصَّيْحَةَ بِالْحَقِّ ذلِكَ يَوْمُ الْخُرُوجِ إِنَّا نَحْنُ نُحْيِي وَ نُمِيتُ وَ إِلَيْنَا الْمَصِيرُ يَوْمَ تَشَقَّقُ الْأَرْضُ عَنْهُمْ سِراعاً ـ إِلَى آخِرِ السُّورَةِ ـ ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473092\">H 14452</a> - Muhammad Bin Ali Bin Ma’mar, from Muhammad Bin Ali Bin Ukaayat Al-Tamimy, from Al-Husayn Bin Al-Nazar Al-Fahry, from Abu Amro Al-Awzaiy, from Amro Bin Shimr, from Jabir Bin Yazeed who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> came up to Abu Ja’far</span><sup>asws</sup>, so I said, ‘O son<sup>asws</sup> of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>, the differing among the Shiites in this Doctrine causes me pain’. He<sup>asws</sup> said: ‘O Jabir, shall I<sup>asws</sup> not suffice you with the meanings of their differences, from where they are differing, and from which perspective they are separating?’ I said, ‘Yes, O son<sup>asws</sup> of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>’.  ",
            "He<sup>asws</sup> said: ‘So do not differ if they differ, O Jabir. The one who fights against the Master<sup>asws</sup> of the Era (Imam<sup>asws</sup> of his time) is like the one who has fought against the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> in his<sup>saww</sup> days. O Jabir, listen attentively’. I said, ‘As you<sup>asws</sup> like’. He<sup>asws</sup> said: ‘Listen attentively, and make it reach to wherever your ride takes you, that Amir-ul-Momineen<sup>asws</sup> preached to the People at Al-Medina, seven days after the passing away of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>, and that was when he<sup>asws</sup> was free from collecting the Quran and compiling it.",
            "He<sup>asws</sup> said: ‘Praise be to Allah<sup>azwj</sup> Who has Prevented the imaginations to grasp Him<sup>azwj</sup> except for His<sup>azwj</sup> Existence, and Veiled the intellects to think about His<sup>azwj</sup> Essence due to the restrictions of Him<sup>azwj</sup> having no similarities or images. But He<sup>azwj</sup> is the One in Whose Essence there are not differences nor any division into a number of parts due to the Perfection. He<sup>azwj</sup> is separate from the things, not due to being in a different place, and He<sup>azwj</sup> is in things, not being mixed within them, and He<sup>azwj</sup> Knows these, not by the use of tools. And He<sup>azwj</sup> is not Knowledgeable except by it, and there is nothing between Him<sup>azwj</sup> and His<sup>azwj</sup> Knowledge, any other knowledge. He<sup>azwj</sup> is the Knowledgeable by Himself<sup>azwj</sup>.",
            "If it is said that He<sup>azwj</sup> was, it would be interpreted as the eternal existence, and if it is said that He<sup>azwj</sup> will never cease (to exist), it would be interpreted as the negation of the non-existence. He<sup>azwj</sup> is Glorious, and higher than the words of those who worship other than Him<sup>azwj</sup> and have taken a god other than Him<sup>azwj</sup>. He<sup>azwj</sup> is Higher and Greater. We<sup>asws</sup> Praise Him<sup>azwj</sup> with a Praise of those of His<sup>azwj</sup> creatures who has Pleased Him<sup>azwj</sup>, and He<sup>azwj</sup> has Made it to be more than Obligatory upon Himself<sup>azwj</sup> to Accept it. ",
            "And I<sup>asws</sup> hereby testify that there is no God but Allah<sup>azwj</sup>, One, with no Associates for Himself<sup>azwj</sup>, and I<sup>asws</sup> testify that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Messenger. These two testimonies elevate the words and increase the deeds. Light is the Scale from which these two are raised from, and heavy is the Scale on which these two are placed. And by these two is the victory of the Paradise, and the salvation from the Fire, and the Permission upon the (crossing of) the Bridge.",
            "And it is by the testimony that you will be entering the Paradise, and by the Prayers that you will be consuming the Mercy. Send the greetings frequently upon your Prophet<sup>saww</sup> <span class=\"ibTxt\">“<a href=\"/#/books/quran:33#h56\">[33:56]</a> Surely Allah and His angels bless the Prophet; O you who believe! call for (Divine) blessings on him and salute him with a (becoming) salutation”</span>.",
            "O you people! There is no nobility higher than Al-Islam, nor a prestige more honourable than the piety, nor a stronghold better than devoutness, nor an intercessor more excellent than repentance, nor a robe more majestic than good health, nor a protection more secure than safety, nor a wealth better at dispelling poverty than contentment with conviction/cetainity, nor a treasure more enriching than being satisfied. ",
            "And the one lives at the subsistence level and the reduction in comfort, so he has made the preparations for the rest, and the desires is the key to the fatigue, and the monopolisation follows from affliction, and the jealousy is a scourge on the Religion, and the greed is an invitation to the indulgence in the sins and the reason for the deprivation, and the transgression is a driver to the destruction, and greed gathers all the defects. Perhaps a failed greed, a false hope leads to the dispossession and a business trade to incur a loss. The one who gets involved in the matters without looking at the consequences will be exposed to misfortunes, and the most evil of the collars (humiliation) for a Believer is the sin.",
            "O you people! There is no treasure more beneficial than the knowledge, and no honour higher than the forbearance, and no nobility more eloquent than the ethics, and no affliction greater than anger, and no majesty more decorative than the intellect, and nothing is more disgraceful than the lies, and no protection safer than silence, and no absentee which is nearer than the death.  ",
            "O you people! The one who looks at his own faults will be too pre-occupied to look at the faults of the others, and the one who is contented with the sustenance of Allah<sup>azwj</sup> will not despair upon what is in the hands of the others, and the one who unsheathes the sword of rebellion will be killed by it, and the one who drills a pit for his brother will fall into it himself, and the one who discloses the veiled (privacy) of others will uncover the privacy of his own house, and the one who forgets his own mistakes will magnify the mistakes of the others, and the one who wonders at his own opinion will go astray, and the one who considers himself to be needless due to his intellect will make mistakes, and the one who is arrogant to the people will be humiliated, and the one who is a fool to the people will be hated, and the one who mixes with the villains will be degraded, and the one who burdens himself with what he cannot endure will be frustrated. ",
            "O you people! There is no wealth more valuable than the intellect, and no poverty which is more intense than the ignorance, and no preacher which is more profound than the sound advice, and no reasoning like the contemplation, and no worship like the pondering, and no demonstration more reliable than the consultation, and no isolation more severe than the self-conceit, nor piety like refraining from the Prohibitions, and no forbearance like patience and silence.  ",
            "O you people! In the human being there are ten qualities, which are revealed by his tongue and becomes witness to his hidden thoughts, it is a ruler by which he decides between what to be said, and the words by which he returns the answer, and an intercessor (limbs) by which he achieves the needs, and a describer (senses) by which he recognises the things, and a commander (decision) by which he commands for the good, and a preacher by which he prohibits from the ugly (deeds), and a consoler by which he gives solace to the sorrows, and a conscious by which he clears the malice, and an articulator by which he gives pleasure to the ears. ",
            "O you people! There is no good in keeping silent about the ‘الْحُكْمِ’ (the Command) just as there is no good in speaking out of ignorance. And know, O you people, that the one who does not control his tongue will regret, and the one who does not learn will be ignorant, and the one who does not forbear will not content, and the one who is not deterred does not learn, and the one who does not know is insulted, and the one who is insulted is not respected, and the one who is not respected is taunted, and the one who acquires wealth from where he has no right to do so will spend it extravagantly in other that the right way, and the one who does not desist when he is praised will desist when he is condemned, and the one who does not give in comfort will also be refused when in the need, and the one who seeks the honour without being deserving of it will be disgraced, the one who overcomes with injustice will also be overpowered, and the one who opposed the truth will necessitate weakness for himself, and the one who ponders will be dignified, and the one who is arrogant will be belittled, and the one who is not good will not be praised.",
            "O you people! The death is (better) before the lowliness, and the endurance before the apathy, and the accounting before the Punishment, and the grave is better than the poverty, lowering the sight is better than looking at a great deal, and the time, a day is for you and a day against you. So if it is for you, do not be ungrateful, and if it is against you, observe patience. So with both of them you will be Examined. (And in another copy – ‘And with both of them you will be Tested’)  ",
            "O you people! The strangest of what is in the human being is his heart, and in it are matters of wisdom and the antibodies to the one who opposes it. When there is prosperity for him, greed humiliates him, and if greed excites him, the thriftiness destroys him, when despair overpowers him, the remorse kills him, and when the anger presents itself, the rage intensifies, and when he is happy and satisfied he forgets to conserve, and when fear seizes him he gets preoccupied by caution, and when security is widened for him his honour makes him complacent (and in another copy ‘pride takes him over’), and when new bounties come up for him pride takes him over, and when he is benefitted by money his richness makes him oppressive, and when poverty bites him he is preoccupied by the affliction (and in another copy ‘he strives in the weeping’), and when he is inflicted by hardship anxiety injures him, and when the hunger exhausts him he is disabled by the weakness, and when he over-eats he is upset by indigestion, so every deficiency is harmful to him, and every excess spoils him.",
            "O you people! The one who is miserly will be disgraced and the one who is generous will be the master, and the one who increases his wealth becomes the leader and the one who increases his forbearance becomes noble, and the one who ponders regarding the Essence of Allah<sup>azwj</sup> becomes an Atheist, and the one who frequents in something becomes known for it, and the one frequently jokes will be taken lightly, and the one who frequently laughs his prestige goes away, the one who has no ethics will corrupt. The best deed is the maintenance of honour by wealth. There is none who sits with the ignorant ones who is reasonable, for the one who sits with the ignorant ones should ready himself for (a lot of) talk (against him)’. ",
            "And he<sup>asws</sup> said: ‘Neither did the rich one obtain salvation from death by his wealth, nor did the poor one due to his scarcity’. O you people! Had the death been (a commodity) which could be bought, the good and the honourable ones of the world, as well as the wicked and the greedy ones would have bought it. ",
            "O you people! There are witnesses for the hearts which hold them back from being the people of excesses, and there is insight for the understanding, which alerts the self and caution it from the danger. And for the heart there are memories of desires, and the intellect admonishes and prohibits from it. And in the experiences there is an appellant, which is a reliable guide to the right way. It is sufficient for yourself what you would not like it to happen to others, and it is upon you that the same should be for your believing brother, and in it upon him, likewise. The one who considers his own opinion to be self-sufficing from him would endanger him, and the pondering before the deeds would keep you safe from remorse. And the one who welcomes different opinions would understand the places of mistakes. And the one who refrains from the useless matters his opinion would balance the intellects. ",
            "The one who fortifies his carnal desires so he has kept his respect, and the one who restrains his tongue is trusted by the people and will achieve his needs. And in the alteration of the situations the jewels of the men become known, and the passing days make apparent the inner selves. And there is no enjoyment in the swiftness of lightning for the one who goes through darkness. And the one who is recognised by the wisdom, the eyes will notice him with reverence and prestige. The most noble of riches is the avoidance of wishes, and the patience is a shield against poverty, and the greed is a sign of poverty, and the stinginess is the gown of destitution, and the cordiality with the relatives is beneficial, and the sympathy of the poor is better than the disloyal rich.  ",
            "Counselling is like a cave for the one who listens to it, and the one who does not restrain his eyes, his regrets increase. And the (passage of) time has made it to be more than obligatory for the one who avails it, to thank it. The tongue does very little justice in displaying the ugly and the good. The one who constricts his ethics, his family get tired of him. And the one who seeks, achieves it for a long time, and very little of what is wished is sincere. Modesty clothes you with dignity, and in the extensiveness of the morals is a treasure for the sustenance, and how many from the people remain in their sins until the end of their days. And the one who robes himself with bashfulness as his clothing his faults are hidden from the people.  ",
            "And intend moderation in your speech, for the one who intends it will incur light expenses, and in the opposition to the ego is guidance for you. And the one who recognises the ‘days’ (his end) will never be oblivious from the preparation. Nay! Along with every sip (of drink) is (possibility of) choking, and in every morsel is (the possibility of) suffocation. Bounties cannot be achieved except by the decline of other (bounties), and for every breath is life, and for every grain is a consumer, and you are the morsel of the death. ",
            "And know, O you people! The ones who walks upon the face of the earth will end up in its belly, and the nights and the days, they dispute (they accelerate) regarding the destruction of the life-span. ",
            "O you people! Ingratitude for the bounties is wickedness, and the company of the ignorant is ominous. The softness of the speech is from the prestige. And from the (acts of) worship are displayed by the tongue (make it heard) and increase the greetings. ",
            "Beware of deceit for it is from the manners of the villains. Every seeker does not get a share, nor does every absentee return. Its not certain that one will get what he wishes and the lost is recovered. Seek (the company) of friends before setting of and ensure (good) neighbourhood before (moving into) the house. Indeed! The one who moves fast will catche up with the slower ones. Conceal the private (matters) of your brother just as he knows regarding you. Forgive the mistakes of your friend for the day that your enemy comes to dominate you.  ",
            "The one who is angry with the one over whom he has no power to injure, his grief would be prolonged and it will punish his soul. The one who fears his Lord<sup>azwj</sup> will refrain from committing injustices. The one who is good with the words would display his pride. And the one who does not recognise the good from the evil, is like an animal. ",
            "Indeed the corruption destroys the provisions (of the Hereafter). How little is the difficulty (of today) as compared with the great destitution tomorrow. Far it is! Far it is from being compared. And what is your antipathy due to, except for your indulgence in acts of disobedience and the sins. So how close is the rest to the tiredness, and the misery from the Bounties. The hardships are not painful after which there is the Paradise, and the goodtime is not the (lasting) comfort after which there is the Fire. And every bounty apart from the Paradise is insignificant, and every affliction apart from the Fire is healthy. ",
            "And turning away from correcting the consciences leads to the major sins. Purification of the deeds is more difficult than the deed itself, and the sincerity of the intention from the corruption is more difficulty upon the performer of the deed than the lengthy Jihaad. Far it is! Had it not been for the piety I<sup>asws</sup> would have been the shrewdest of the Arabs.",
            "O you people! Allah<sup>azwj</sup> the High Promised His<sup>azwj</sup> Prophet<sup>saww</sup> Muhammad<sup>saww</sup> the Means (Al-Waseela), and His<sup>azwj</sup> Promise is True, and Allah<sup>azwj</sup> does not Go against His<sup>azwj</sup> Promise. Surely <span class=\"iTxt\">Al-Waseela</span> is on the steps of the Paradise and is at the peak of the nearness (to Allah<sup>azwj</sup>), and is a total security at the very end of it. There are a thousand staircases, and what is in between one staircase and the other there is a travel distance by a fine horse of a hundred years. And in between these is a staircase of gems going up to a staircase of jewels, to a staircase of aquamarines, to a staircase of pearls, to a staircase of rubies, to a staircase of emeralds, to a staircase of corals, to a staircase of camphor, to a staircase of ambergris, to a staircase of aloe, to a staircase of gold, to a staircase of clouds, to a staircase of air, to a staircase of Light which encompasses all of the Gardens.",
            "And on that Day the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> would be seated wearing two Garments – a Garment of the Mercy of Allah<sup>azwj</sup> and a Garment of the Light of Allah<sup>azwj</sup>. On him<sup>saww</sup> will be a Crown of the Prophet-hood and a Garland of the Message, the Light of which will illuminate the whole of the Pausing Place (Station in the Hereafter).",
            "And on that Day, I<sup>asws</sup> will be upon the High Level, and it will be lower than his<sup>saww</sup> Level, and on me<sup>asws</sup> would be two Garments – a Garment of purple Light and a Garment of Camphor. And the Messengers<sup>as</sup> and the Prophets<sup>saww</sup> would have paused upon my<sup>asws</sup> staircase, with the Flags of the Eras and the Proof of the ages on our<sup>asws</sup> right, and they<sup>as</sup> will have Majestic Garments of Light and the Prestige. There is no Angel of Proximity, and no Messenger Prophet<sup>saww</sup> who will look at us<sup>asws</sup> except that he will be stunned by our<sup>asws</sup> Light. ",
            "And stranger than our<sup>asws</sup> Illumination and our<sup>asws</sup> Majesty is the <span class=\"iTxt\">Al-Waseela</span> on our<sup>asws</sup> right, and on the right of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> will be a cloud stretching out as far as the eye can see. A Call will come out from it: ‘O people of the Pausing Place! Goodness is for the ones who loved the successor<sup>asws</sup> and believed in the Prophet<sup>saww</sup>, the ‘Ummy’<a id=\"_ftnref5\"></a><sup>[5]</sup> of the Arabs. And the one who disbelieved, so the Fire is Prepared for him. ",
            "And on the left of <span class=\"iTxt\">Al-Waseela</span>, from the left of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> will be a shade. A Call will come out from it: ‘O people of the Pausing Place! Goodness is for the ones who loved the successor<sup>as</sup><sup>ws</sup> and believed in the ‘Ummy’ Prophet<sup>saww</sup>, the one<sup>saww</sup> for whom is the High Kingdom. There is no success for anyone, nor happiness for the soul, and the Paradise except for the one who is meeting his Creator<sup>azwj</sup> with the sincerity for these two<sup>asws</sup> and the follower of the stars (Imams<sup>asws</sup>) from these two<sup>asws</sup>. Be convinced, O people of <span class=\"iTxt\">Al-Wilayah</span> of Allah<sup>azwj</sup>, of the whitening of your faces, and the prestige of your seating, and the honour of your return and your success today, with bliss, facing each other.  ",
            "And O people of the deviation, and the diverters from Allah<sup>azwj</sup>, Mighty is His<sup>azwj</sup> Remembrance, and from His<sup>azwj</sup> Messenger<sup>saww</sup>, and from His<sup>azwj</sup> Path, and the Flags of the eras, be convinced of the blackening of your faces, and the Wrath of your Lord<sup>azwj</sup>, a Recompense of what you used to do before. And there is none from the Messengers<sup>as</sup> who preceded and none from the Prophets<sup>as</sup> of the past except that he<sup>as</sup> had informed his<sup>as</sup> community of the Messenger<sup>saww</sup> to come after him<sup>as</sup>, and the good news of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>, and bequeathed to his<sup>as</sup> community, and described him<sup>saww</sup> to his<sup>as</sup> community his<sup>saww</sup> qualities, and that they should follow him<sup>saww</sup> and be upon his<sup>saww</sup> Law, so that they would not stray with regards to him<sup>saww</sup> after him<sup>as</sup>. So the ones who would face destruction and straying afterwards would only be after the occurrence of the reasons and the warnings, and having been acquainted with the evidence, and the arguments having been established.  ",
            "So the communities lived in hope about the Messengers<sup>as</sup> and the Prophets<sup>as</sup> to come, if they were in difficult circumstances in the absence of a Prophet<sup>as</sup> after their Prophet<sup>as</sup>, in their great difficulties and disasters, so they were at the time in a state of hope. And there have never been a difficulty which was greater, and nor a disaster greater like the difficulties with the Messenger of Allah<sup>saww</sup>, because Allah<sup>azwj</sup> Ended the Warnings, and the Reasons, and Cut-off through him<sup>saww</sup> the Arguments, and the Reasons between Him<sup>azwj</sup> and His<sup>azwj</sup> creatures, and Made him<sup>saww</sup> to be His<sup>azwj</sup> Door which was between Him<sup>azwj</sup> and His<sup>azwj</sup> servants, and as His<sup>azwj</sup> Authority which nothing would be Acceptable except by him<sup>saww</sup>, nor any nearness to Him<sup>azwj</sup> except by being obedient to him<sup>saww</sup>.",
            "And He<sup>azwj</sup> Said Decisively in His<sup>azwj</sup> Book: <span class=\"ibTxt\">“<a href=\"/#/books/quran:4#h80\">[4:80]</a> Whoever obeys the Messenger, he indeed obeys Allah and whoever turns back, so We have not sent you as a keeper over them”</span>. So He<sup>azwj</sup> Joined obedience to Himself<sup>azwj</sup> with obedience to him<sup>saww</sup>, and disobedience to Himself<sup>azwj</sup> with disobedience to him<sup>saww</sup>. So that was the Evidence which was Delegated to him<sup>saww</sup>, and a Testimony against the one who obeys him<sup>saww</sup>, and disobeys him<sup>saww</sup>, and between that in other places from the Great Book.",
            "So the Blessed and the High Said in the Incitement to follow him<sup>saww</sup>, and the Exhortation with regards to his<sup>saww</sup> ratification, and the acceptance of his<sup>saww</sup> Call: <span class=\"ibTxt\">“<a href=\"/#/books/quran:3#h31\">[3:31]</a> Say, (O Muhammad, tell to mankind): If you love Allah, follow me; Allah will love you and forgive you your sins”</span>. So following him<sup>saww</sup> achieves the Love of Allah<sup>azwj</sup> and His<sup>azwj</sup> Pleasure, and the Forgiveness of the sins, and the completeness of the success, and the necessitation of the Paradise. And in the turning away from him<sup>saww</sup> achieves the Enmity of Allah<sup>azwj</sup>, and His<sup>azwj</sup> Wrath, and His<sup>azwj</sup> Harshness, and remoteness from Him<sup>azwj</sup>, and a dwelling in the Fire and that is His<sup>azwj</sup> Statement: <span class=\"ibTxt\">“<a href=\"/#/books/quran:11#h17\">[11:17]</a> and whoever of the (different) parties disbelieves in it, the Fire will be their promised meeting-place”</span>, meaning the striving against him<sup>saww</sup> and disobedience to him<sup>saww</sup>.",
            "Allah<sup>azwj</sup>, Blessed is His<sup>azwj</sup> Name, Tested His<sup>azwj</sup> servants by me<sup>asws</sup>, and killed those that opposed Him<sup>azwj</sup> by my<sup>asws</sup> hand, and annihilated those that strived against Him<sup>azwj</sup> by my<sup>asws</sup> sword, and Made me<sup>asws</sup> to be a Means of nearness to Him<sup>azwj</sup> (Zulfat) for the Believers, and a ground of death for the toughest tyrants, and His<sup>azwj</sup> Sword against the criminals, and Strengthened by me<sup>asws</sup> the back of His<sup>azwj</sup> Messenger<sup>saww</sup>, and Honoured me<sup>asws</sup> by helping him<sup>saww</sup>, and Privileged me<sup>asws</sup> with his<sup>saww</sup> knowledge, and Gifted me<sup>asws</sup> with his<sup>saww</sup> Laws, and Favoured me<sup>asws</sup> for his<sup>saww</sup> successorship, and Chose me<sup>asws</sup> for his<sup>saww</sup> Caliphate in his<sup>saww</sup> community. So he<sup>saww</sup> said when he<sup>saww</sup> mobilised the Emigrants and the Helpers in their gathering: ‘O you people! Surely, Ali<sup>asws</sup> is from me<sup>saww</sup> like Haroun<sup>as</sup> was from Musa<sup>as</sup> except that there is no Prophet<sup>as</sup> to come after me<sup>saww</sup>. ",
            "So the Believers understood that the Messenger<sup>saww</sup> was speaking on behalf of Allah<sup>azwj</sup>. They recognised me<sup>asws</sup> that I<sup>asws</sup> was not his<sup>saww</sup> brother by his<sup>saww</sup> father<sup>as</sup> or his<sup>saww</sup> mother<sup>as</sup> as was the case with Haroun<sup>saww</sup> who was the brother of Musa<sup>as</sup> from his<sup>as</sup> father and his<sup>as</sup> mother<sup>as</sup>, nor was I<sup>asws</sup> a Prophet<sup>as</sup>. The Prophet-hood has ended. But, that was from him<sup>saww</sup> appointing me<sup>asws</sup> as the Caliph just as Musa<sup>as</sup> had appointed Haroun<sup>as</sup> as the Caliph when he<sup>as</sup> said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:7#h142\">[7:142]</a> Take my place among my people, and act well and do not follow the way of the mischief-makers.” </span>",
            "And his<sup>saww</sup> words when a group spoke saying, ‘We are the friends of the Messenger of Allah<sup>azwj</sup>’. So the Messenger<sup>saww</sup> of Allah<sup>azwj </sup>went out to the Farewell Pilgrimage, then came up to <span class=\"iTxt\">Ghadeer Khumm</span>. So he<sup>saww</sup> ordered for something resembling a Pulpit to be prepared to him<sup>saww</sup>. Then he<sup>saww</sup> ascended it, grabbed my<sup>asws</sup> arm and raised it to the extent that the whiteness of his<sup>saww</sup> armpits were seen, and said in a raised voice in that forum: ‘The one to whom I<sup>saww</sup> was the Master of, so Ali<sup>asws</sup> is his Master. Our Allah<sup>azwj</sup>! Befriend the one who befriends him<sup>asws</sup>, and be Inimical to the one who is an enemy to him<sup>asws</sup>. Thus, upon my<sup>asws</sup> <span class=\"iTxt\">Wilayah</span> is the <span class=\"iTxt\">Wilayah</span> of Allah<sup>azwj</sup>, and upon my<sup>asws</sup> enmity is the enmity against Allah<sup>azwj</sup>. ",
            "And Allah<sup>azwj</sup>, Mighty and Majestic Revealed in that day: <span class=\"ibTxt\">“<a href=\"/#/books/quran:5#h3\">[5:3]</a> This day have I perfected for you your religion and completed My favor on you and chosen for you Islam as a religion”</span>. So upon my<sup>asws</sup> <span class=\"iTxt\">Wilayah</span> was the completion of the Religion, and the Pleasure of the Lord<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Remembrance. And Allah<sup>azwj</sup>, Blessed and High, Revealed it especially for me<sup>asws</sup> and Honoured the Gifting it for me<sup>asws</sup> as (a sign of) greatness, and its gifting from the Messenger of Allah<sup>saww</sup>, and it is the Statement of the High: <span class=\"ibTxt\">“<a href=\"/#/books/quran:6#h62\">[6:62]</a> Then are men returned unto Allah, their protector, the (only) reality: Is not His the command? and He is the swiftest in taking account.”</span>",
            "If I<sup>asws</sup> were to mention my<sup>asws</sup> merits, its loftiness would be great, and it’s listening prolonged. And about me<sup>asws</sup>, two miserable ones before me<sup>asws</sup> disputed with me<sup>asws</sup> regarding that in which they had no rights over it, and they rode its misguidance, and believed in the ignorance. So evil is what was to them, what they returned to, and evil is what they made as a cradle for themselves. They cursed each other in their own houses, and each one of them distanced himself from his companion saying to him when he met him, ‘Alas! If only there was the distance between the East and the West between me and between you’. So evil is the friend who answered him, the miserable one upon his ragged condition, <span class=\"ibTxt\">“<a href=\"/#/books/quran:25#h28\">[25:28]</a> O woe is me! would that I had not taken such a one for a friend. <a href=\"/#/books/quran:25#h29\">[25:29]</a> He verily led me astray from the Reminder after it had reached me. Satan was ever man's deserter in the hour of need”</span>. ",
            "So I<sup>asws</sup> am the Reminder from which he went astray, and the Way from which he deviated, and the Belief which he denied, and the Quran from which he fled, and the Religion which he belied, and the Path from which he digressed. And the debris which they lived upon in their constant pride, they were on it on the verge of the Fire (prepared) for them - an evil return amongst the wicked group, to a condemned destination. They will be shouting curses at each other grumbling in regret. There will be no rest for these two; nor a respite from their inevitable Punishment.",
            "The people never ceased to be the worshippers of the idols and being the custodians of the idols, establishing rituals for them, and designated certain offerings for them in order to seek nearness to them. And they made for them titles such as ‘<span class=\"iTxt\">Al-Baheyra</span>, and <span class=\"iTxt\">Al-Waseyla</span>, and <span class=\"iTxt\">Al-Sa’ebat</span>, and <span class=\"iTxt\">Al-Haam</span>’. They distributed these idols by casting lots by arrows, wondering about Allah<sup>azwj</sup> Mighty is His<sup>azwj</sup> Remembrance. They were confused about the guidance, hastening to the remoteness, and they had been overcome by Satan<sup>la</sup> who had flooded them with the darkness of ignorance, having breastfed them with ignorance and weaned them with misguidance. ",
            "Allah<sup>azwj</sup> Brought us<sup>asws</sup> out to them as a Mercy, and Informed about us<sup>asws</sup> as being higher than them, and Removed the Veil of Light from us<sup>asws</sup> for those that sought us<sup>asws</sup>, and Preferred the ones who followed it (the Light), and we<sup>asws</sup> were a support for the ones who ratified it. So honour followed after the disgrace, and the plenty after the scarcity. And their hearts and their eyes revered them, and the tyrants yielded to them, and its respective communities became the people of the Bounties, being worthy of mention, and prestigious, and ease, and security after fear, and ‘جَمْعٍ’ union after having been separated. ",
            "And Ma’d Bin Adnan was illuminated (famous) due to us<sup>asws</sup> and we<sup>asws</sup> inserted them in the Door of Guidance, and we<sup>asws</sup> entered them into the House of Peace, and we<sup>asws</sup> clothed them with the garment of Belief, and they became famous due to us<sup>asws</sup> in the worlds, and the effects of the righteous people appeared for them in the days of the Messenger<sup>saww</sup>, from a striving protector, and an obedient worshipper, and an ascetic retreater, and they preserved the trusts and became as such until when Allah<sup>azwj</sup> Mighty and Majestic Called back His<sup>azwj</sup> Prophet<sup>saww</sup> and Raised him<sup>saww</sup> to Himself<sup>azwj</sup>. ",
            "That was not after him<sup>saww</sup> except like a moment of pulse, or a glimmer of lightning for them to return back and turn back upon their heels, and sought revenge by forming battalions, and they blocked the Door and destroyed the houses, and changed the effects of the Messenger of Allah<sup>saww</sup>, and turned away from his<sup>saww</sup> rulings, and distanced themselves from his<sup>saww</sup> Light, and they changed his<sup>saww</sup> Caliph with an alternate. They took to him, and they were unjust in doing so, and they thought that the one whom they had chosen from the descendants of Abu Kohafa (Abu Bakr) is higher in status than the one<sup>asws</sup> whom the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> had chosen to be in his<sup>saww</sup> place, and that the Emigrants from the progeny of Abu Kohafa were better than the Emigrants and the Helpers of the Rabbi of the Law Hashim Bin Abd Manaf<sup>as</sup>. Nay! The first false testimony which occurred in Al-Islam was their testimony that their companion (Abu Bakr) is the one whom the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> had made to be the Caliph.",
            "So when the matter of Sa’d Bin Ubada was what it was, they retracted from that and said that the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> passed away and did not appoint a Caliph. So the Messenger of Allah<sup>saww</sup>, the good, the Blessed, was the first one in Al-Islam against who the false testimony was borne. And after a little while they found out the evil of what (they came to know and found out the consequences of the evil of what) the former ones had established. And they had an alternative and an opportunity to recover from the death, and had the time to turn around from the lure of pride, and be in a tranquil condition, and the realisation of the deeds.  ",
            "Allah<sup>azwj</sup> had respited Shaddaad Bin Aad, and Thamud Bin Abbuwad, and Bal’am Bin Ba’our, and Bestowed upon them His<sup>azwj</sup> Favours, both apparent as well as hidden, Supplied them with the wealth, and the (prolongation) of their lives, and Granted them the land, so that due to these Blessings they would Remember the Signs of Allah<sup>azwj</sup>, and they would recognise and be awed by Him<sup>azwj</sup>, and turn to Him<sup>azwj</sup>, and bring an end to their arrogance. ",
            "So before they reached their (allocated) time, and enjoy their meal, Allah<sup>azwj</sup> Mighty and Majestic Grabbed them and cut them down. Some of them from sandstorm, some were overtaken by a scream, and some from being burned by the shadow, and some from the tremors, and some from sinking of the earth. Allah<sup>azwj</sup> was not Unjust to them, but they had been unjust to their own selves.  ",
            "Indeed! For every term there is a writing. So when the writing reaches its term, and it is uncovered for you about what would befall the unjust ones, and what the greatest losers have got to, you will run towards Allah<sup>azwj</sup> Mighty and Majestic from what they had been involved in and to what they are proceeding to. ",
            "Nay! And I<sup>asws</sup> am among you, O you people, like Haroun<sup>as</sup> was in the people of the Pharaoh<sup>la</sup>, and like the Door of <span class=\"iTxt\">Hitta</span> in the Children of Israel, and like the Ark of Noah<sup>as</sup> in the people of Noah<sup>as</sup>. I<sup>asws</sup> am the Great News (Al-Nabaa Al-Azeem), and the Great Truthful (Al-Siddique Al-Akbar), ",
            "And after a little while you will come to know what had been Promised to you. And is this anything else but (was committed) for a morsel of food, and a sip of drink, light sleep. Then the disgrace will be necessitated upon them in the world, and on the Day of Judgement they will be returning to intense Punishment. And Allah<sup>azwj</sup> is not Oblivious (forgetful) of what they have done. So what is the Recompense for the one who turned away from His<sup>azwj</sup> Proof<sup>asws</sup>, and denied His<sup>azwj</sup> Argument, and opposed His<sup>azwj</sup> Guides<sup>asws</sup>, and turned away from His<sup>azwj</sup> Light and stormed (his way) into the darkness, and exchanged water for the mirage, and Bounties for the Punishment, and the success for the misery, and prosperity for the poverty, and the ease for the hardship. ",
            "Nay! This is the Recompense of what they had sown and done before. So be certain of the Promise and of its reality, and be assured of what has been Promised on the Day of the coming of the ‘Scream’ (Dooms Day), with the Truth. <span class=\"ibTxt\">“<a href=\"/#/books/quran:50#h42\">[50:42]</a> The day when they shall hear the cry in truth; that is the day of coming forth. <a href=\"/#/books/quran:50#h43\">[50:43]</a> Surely We give life and cause to die, and to Us is the eventuAl-coming <a href=\"/#/books/quran:50#h44\">[50:44]</a> The day on which the earth shall cleave asunder under them, they will make haste; that is a gathering together easy to Us”</span>."
          ],
          "en.sarwar": [
            "4. Muhammad Bin Ali Bin Ma’mar, from Muhammad Bin Ali Bin Ukaayat Al-Tamimy, from Al-Husayn Bin Al-Nazar Al-Fahry, from Abu Amro Al-Awzaiy, from Amro Bin Shimr, from Jabir Bin Yazeed who said: ‘I came up to Abu Ja’far (a.s.), so I said, ‘O son (a.s.) of the Messenger (saww) of Allah (azwj), the differing among the Shiites in this Doctrine causes me pain’. He (a.s.) said: ‘O Jabir, shall I (a.s.) not suffice you with the meanings of their differences, from where they are differing, and from which perspective they are separating?’ I said, ‘Yes, O son (a.s.) of the Messenger (saww) of Allah (azwj)’. He (a.s.) said: ‘So do not differ if they differ, O Jabir. The one who fights against the Master (a.s.) of the Era (Imam (a.s.) of his time) is like the one who has fought against the Messenger (saww) of Allah (azwj) in his (saww) days. O Jabir, listen attentively’. I said, ‘As you (a.s.) like’. He (a.s.) said: ‘Listen attentively, and make it reach to wherever your ride takes you, that Amir-ul-Momineen (a.s.) preached to the People at Al-Medina, seven days after the passing away of the Messenger (saww) of Allah (azwj), and that was when he (a.s.) was free from collecting the Quran and compiling it. He (a.s.) said: ‘Praise be to Allah (azwj) Who has Prevented the imaginations to grasp Him (azwj) except for His (azwj) Existence, and Veiled the intellects to think about His (azwj) Essence due to the restrictions of Him (azwj) having no similarities or images. But He (azwj) is the One in Whose Essence there are not differences nor any division into a number of parts due to the Perfection. He (azwj) is separate from the things, not due to being in a different place, and He (azwj) is in things, not being mixed within them, and He (azwj) Knows these, not by the use of tools. And He (azwj) is not Knowledgeable except by it, and there is nothing between Him (azwj) and His (azwj) Knowledge, any other knowledge. He (azwj) is the Knowledgeable by Himself (azwj). If it is said that He (azwj) was, it would be interpreted as the eternal existence, and if it is said that He (azwj) will never cease (to exist), it would be interpreted as the negation of the non-existence. He (azwj) is Glorious, and higher than the words of those who worship other than Him (azwj) and have taken a god other than Him (azwj). He (azwj) is Higher and Greater. We (a.s.) Praise Him (azwj) with a Praise of those of His (azwj) creatures who has Pleased Him (azwj), and He (azwj) has Made it to be more than Obligatory upon Himself (azwj) to Accept it. And I (a.s.) hereby testify that there is no God but Allah (azwj), One, with no Associates for Himself (azwj), and I (a.s.) testify that Muhammad (saww) is His (azwj) servant and His (azwj) Messenger. These two testimonies elevate the words and increase the deeds. Light is the Scale from which these two are raised from, and heavy is the Scale on which these two are placed. And by these two is the victory of the Paradise, and the salvation from the Fire, and the Permission upon the (crossing of) the Bridge. And it is by the testimony that you will be entering the Paradise, and by the Prayers that you will be consuming the Mercy. Send the greetings frequently upon your Prophet (saww) “<a href=\"/#/books/quran:33#h56\">[33:56]</a> Surely Allah and His angels bless the Prophet; O you who believe! call for (Divine) blessings on him and salute him with a (becoming) salutation”. O you people! There is no nobility higher than Al-Islam, nor a prestige more honourable than the piety, nor a stronghold better than devoutness, nor an intercessor more excellent than repentance, nor a robe more majestic than good health, nor a protection more secure than safety, nor a wealth better at dispelling poverty than contentment with conviction/cetainity, nor a treasure more enriching than being satisfied. And the one lives at the subsistence level and the reduction in comfort, so he has made the preparations for the rest, and the desires is the key to the fatigue, and the monopolisation follows from affliction, and the jealousy is a scourge on the Religion, and the greed is an invitation to the indulgence in the sins and the reason for the deprivation, and the transgression is a driver to the destruction, and greed gathers all the defects. Perhaps a failed greed, a false hope leads to the dispossession and a business trade to incur a loss. The one who gets involved in the matters without looking at the consequences will be exposed to misfortunes, and the most evil of the collars (humiliation) for a Believer is the sin. O you people! There is no treasure more beneficial than the knowledge, and no honour higher than the forbearance, and no nobility more eloquent than the ethics, and no affliction greater than anger, and no majesty more decorative than the intellect, and nothing is more disgraceful than the lies, and no protection safer than silence, and no absentee which is nearer than the death. O you people! The one who looks at his own faults will be too pre-occupied to look at the faults of the others, and the one who is contented with the sustenance of Allah (azwj) will not despair upon what is in the hands of the others, and the one who unsheathes the sword of rebellion will be killed by it, and the one who drills a pit for his brother will fall into it himself, and the one who discloses the veiled (privacy) of others will uncover the privacy of his own house, and the one who forgets his own mistakes will magnify the mistakes of the others, and the one who wonders at his own opinion will go astray, and the one who considers himself to be needless due to his intellect will make mistakes, and the one who is arrogant to the people will be humiliated, and the one who is a fool to the people will be hated, and the one who mixes with the villains will be degraded, and the one who burdens himself with what he cannot endure will be frustrated. O you people! There is no wealth more valuable than the intellect, and no poverty which is more intense than the ignorance, and no preacher which is more profound than the sound advice, and no reasoning like the contemplation, and no worship like the pondering, and no demonstration more reliable than the consultation, and no isolation more severe than the self-conceit, nor piety like refraining from the Prohibitions, and no forbearance like patience and silence. O you people! In the human being there are ten qualities, which are revealed by his tongue and becomes witness to his hidden thoughts, it is a ruler by which he decides between what to be said, and the words by which he returns the answer, and an intercessor (limbs) by which he achieves the needs, and a describer (senses) by which he recognises the things, and a commander (decision) by which he commands for the good, and a preacher by which he prohibits from the ugly (deeds), and a consoler by which he gives solace to the sorrows, and a conscious by which he clears the malice, and an articulator by which he gives pleasure to the ears. O you people! There is no good in keeping silent about the ‘الْحُكْمِ’ (the Command) just as there is no good in speaking out of ignorance. And know, O you people, that the one who does not control his tongue will regret, and the one who does not learn will be ignorant, and the one who does not forbear will not content, and the one who is not deterred does not learn, and the one who does not know is insulted, and the one who is insulted is not respected, and the one who is not respected is taunted, and the one who acquires wealth from where he has no right to do so will spend it extravagantly in other that the right way, and the one who does not desist when he is praised will desist when he is condemned, and the one who does not give in comfort will also be refused when in the need, and the one who seeks the honour without being deserving of it will be disgraced, the one who overcomes with injustice will also be overpowered, and the one who opposed the truth will necessitate weakness for himself, and the one who ponders will be dignified, and the one who is arrogant will be belittled, and the one who is not good will not be praised. O you people! The death is (better) before the lowliness, and the endurance before the apathy, and the accounting before the Punishment, and the grave is better than the poverty, lowering the sight is better than looking at a great deal, and the time, a day is for you and a day against you. So if it is for you, do not be ungrateful, and if it is against you, observe patience. So with both of them you will be Examined. (And in another copy – ‘And with both of them you will be Tested’) O you people! The strangest of what is in the human being is his heart, and in it are matters of wisdom and the antibodies to the one who opposes it. When there is prosperity for him, greed humiliates him, and if greed excites him, the thriftiness destroys him, when despair overpowers him, the remorse kills him, and when the anger presents itself, the rage intensifies, and when he is happy and satisfied he forgets to conserve, and when fear seizes him he gets preoccupied by caution, and when security is widened for him his honour makes him complacent (and in another copy ‘pride takes him over’), and when new bounties come up for him pride takes him over, and when he is benefitted by money his richness makes him oppressive, and when poverty bites him he is preoccupied by the affliction (and in another copy ‘he strives in the weeping’), and when he is inflicted by hardship anxiety injures him, and when the hunger exhausts him he is disabled by the weakness, and when he over-eats he is upset by indigestion, so every deficiency is harmful to him, and every excess spoils him. O you people! The one who is miserly will be disgraced and the one who is generous will be the master, and the one who increases his wealth becomes the leader and the one who increases his forbearance becomes noble, and the one who ponders regarding the Essence of Allah (azwj) becomes an Atheist, and the one who frequents in something becomes known for it, and the one frequently jokes will be taken lightly, and the one who frequently laughs his prestige goes away, the one who has no ethics will corrupt. The best deed is the maintenance of honour by wealth. There is none who sits with the ignorant ones who is reasonable, for the one who sits with the ignorant ones should ready himself for (a lot of) talk (against him)’. And he (a.s.) said: ‘Neither did the rich one obtain salvation from death by his wealth, nor did the poor one due to his scarcity’. O you people! Had the death been (a commodity) which could be bought, the good and the honourable ones of the world, as well as the wicked and the greedy ones would have bought it. O you people! There are witnesses for the hearts which hold them back from being the people of excesses, and there is insight for the understanding, which alerts the self and caution it from the danger. And for the heart there are memories of desires, and the intellect admonishes and prohibits from it. And in the experiences there is an appellant, which is a reliable guide to the right way. It is sufficient for yourself what you would not like it to happen to others, and it is upon you that the same should be for your believing brother, and in it upon him, likewise. The one who considers his own opinion to be self-sufficing from him would endanger him, and the pondering before the deeds would keep you safe from remorse. And the one who welcomes different opinions would understand the places of mistakes. And the one who refrains from the useless matters his opinion would balance the intellects. The one who fortifies his carnal desires so he has kept his respect, and the one who restrains his tongue is trusted by the people and will achieve his needs. And in the alteration of the situations the jewels of the men become known, and the passing days make apparent the inner selves. And there is no enjoyment in the swiftness of lightning for the one who goes through darkness. And the one who is recognised by the wisdom, the eyes will notice him with reverence and prestige. The most noble of riches is the avoidance of wishes, and the patience is a shield against poverty, and the greed is a sign of poverty, and the stinginess is the gown of destitution, and the cordiality with the relatives is beneficial, and the sympathy of the poor is better than the disloyal rich. Counselling is like a cave for the one who listens to it, and the one who does not restrain his eyes, his regrets increase. And the (passage of) time has made it to be more than obligatory for the one who avails it, to thank it. The tongue does very little justice in displaying the ugly and the good. The one who constricts his ethics, his family get tired of him. And the one who seeks, achieves it for a long time, and very little of what is wished is sincere. Modesty clothes you with dignity, and in the extensiveness of the morals is a treasure for the sustenance, and how many from the people remain in their sins until the end of their days. And the one who robes himself with bashfulness as his clothing his faults are hidden from the people. And intend moderation in your speech, for the one who intends it will incur light expenses, and in the opposition to the ego is guidance for you. And the one who recognises the ‘days’ (his end) will never be oblivious from the preparation. Nay! Along with every sip (of drink) is (possibility of) choking, and in every morsel is (the possibility of) suffocation. Bounties cannot be achieved except by the decline of other (bounties), and for every breath is life, and for every grain is a consumer, and you are the morsel of the death. And know, O you people! The ones who walks upon the face of the earth will end up in its belly, and the nights and the days, they dispute (they accelerate) regarding the destruction of the life-span. O you people! Ingratitude for the bounties is wickedness, and the company of the ignorant is ominous. The softness of the speech is from the prestige. And from the (acts of) worship are displayed by the tongue (make it heard) and increase the greetings. Beware of deceit for it is from the manners of the villains. Every seeker does not get a share, nor does every absentee return. Its not certain that one will get what he wishes and the lost is recovered. Seek (the company) of friends before setting of and ensure (good) neighbourhood before (moving into) the house. Indeed! The one who moves fast will catche up with the slower ones. Conceal the private (matters) of your brother just as he knows regarding you. Forgive the mistakes of your friend for the day that your enemy comes to dominate you. The one who is angry with the one over whom he has no power to injure, his grief would be prolonged and it will punish his soul. The one who fears his Lord (azwj) will refrain from committing injustices. The one who is good with the words would display his pride. And the one who does not recognise the good from the evil, is like an animal. Indeed the corruption destroys the provisions (of the Hereafter). How little is the difficulty (of today) as compared with the great destitution tomorrow. Far it is! Far it is from being compared. And what is your antipathy due to, except for your indulgence in acts of disobedience and the sins. So how close is the rest to the tiredness, and the misery from the Bounties. The hardships are not painful after which there is the Paradise, and the goodtime is not the (lasting) comfort after which there is the Fire. And every bounty apart from the Paradise is insignificant, and every affliction apart from the Fire is healthy. And turning away from correcting the consciences leads to the major sins. Purification of the deeds is more difficult than the deed itself, and the sincerity of the intention from the corruption is more difficulty upon the performer of the deed than the lengthy Jihaad. Far it is! Had it not been for the piety I (a.s.) would have been the shrewdest of the Arabs. O you people! Allah (azwj) the High Promised His (azwj) Prophet (saww) Muhammad (saww) the Means (Al-Waseela), and His (azwj) Promise is True, and Allah (azwj) does not Go against His (azwj) Promise. Surely Al-Waseela is on the steps of the Paradise and is at the peak of the nearness (to Allah (azwj)), and is a total security at the very end of it. There are a thousand staircases, and what is in between one staircase and the other there is a travel distance by a fine horse of a hundred years. And in between these is a staircase of gems going up to a staircase of jewels, to a staircase of aquamarines, to a staircase of pearls, to a staircase of rubies, to a staircase of emeralds, to a staircase of corals, to a staircase of camphor, to a staircase of ambergris, to a staircase of aloe, to a staircase of gold, to a staircase of clouds, to a staircase of air, to a staircase of Light which encompasses all of the Gardens. And on that Day the Messenger (saww) of Allah (azwj) would be seated wearing two Garments – a Garment of the Mercy of Allah (azwj) and a Garment of the Light of Allah (azwj). On him (saww) will be a Crown of the Prophet-hood and a Garland of the Message, the Light of which will illuminate the whole of the Pausing Place (Station in the Hereafter). And on that Day, I (a.s.) will be upon the High Level, and it will be lower than his (saww) Level, and on me (a.s.) would be two Garments – a Garment of purple Light and a Garment of Camphor. And the Messengers (as) and the Prophets (saww) would have paused upon my (a.s.) staircase, with the Flags of the Eras and the Proof of the ages on our (a.s.) right, and they (as) will have Majestic Garments of Light and the Prestige. There is no Angel of Proximity, and no Messenger Prophet (saww) who will look at us (a.s.) except that he will be stunned by our (a.s.) Light. And stranger than our (a.s.) Illumination and our (a.s.) Majesty is the Al-Waseela on our (a.s.) right, and on the right of the Messenger (saww) of Allah (azwj) will be a cloud stretching out as far as the eye can see. A Call will come out from it: ‘O people of the Pausing Place! Goodness is for the ones who loved the successor (a.s.) and believed in the Prophet (saww), the ‘Ummy’ of the Arabs. And the one who disbelieved, so the Fire is Prepared for him. And on the left of Al-Waseela, from the left of the Messenger (saww) of Allah (azwj) will be a shade. A Call will come out from it: ‘O people of the Pausing Place! Goodness is for the ones who loved the successor (a.s.) and believed in the ‘Ummy’ Prophet (saww), the one (saww) for whom is the High Kingdom. There is no success for anyone, nor happiness for the soul, and the Paradise except for the one who is meeting his Creator (azwj) with the sincerity for these two (a.s.) and the follower of the stars (Imams (a.s.)) from these two (a.s.). Be convinced, O people of Al-Wilayah of Allah (azwj), of the whitening of your faces, and the prestige of your seating, and the honour of your return and your success today, with bliss, facing each other. And O people of the deviation, and the diverters from Allah (azwj), Mighty is His (azwj) Remembrance, and from His (azwj) Messenger (saww), and from His (azwj) Path, and the Flags of the eras, be convinced of the blackening of your faces, and the Wrath of your Lord (azwj), a Recompense of what you used to do before. And there is none from the Messengers (as) who preceded and none from the Prophets (as) of the past except that he (as) had informed his (as) community of the Messenger (saww) to come after him (as), and the good news of the Messenger (saww) of Allah (azwj), and bequeathed to his (as) community, and described him (saww) to his (as) community his (saww) qualities, and that they should follow him (saww) and be upon his (saww) Law, so that they would not stray with regards to him (saww) after him (as). So the ones who would face destruction and straying afterwards would only be after the occurrence of the reasons and the warnings, and having been acquainted with the evidence, and the arguments having been established. So the communities lived in hope about the Messengers (as) and the Prophets (as) to come, if they were in difficult circumstances in the absence of a Prophet (as) after their Prophet (as), in their great difficulties and disasters, so they were at the time in a state of hope. And there have never been a difficulty which was greater, and nor a disaster greater like the difficulties with the Messenger of Allah (saww), because Allah (azwj) Ended the Warnings, and the Reasons, and Cut-off through him (saww) the Arguments, and the Reasons between Him (azwj) and His (azwj) creatures, and Made him (saww) to be His (azwj) Door which was between Him (azwj) and His (azwj) servants, and as His (azwj) Authority which nothing would be Acceptable except by him (saww), nor any nearness to Him (azwj) except by being obedient to him (saww). And He (azwj) Said Decisively in His (azwj) Book: “<a href=\"/#/books/quran:4#h80\">[4:80]</a> Whoever obeys the Messenger, he indeed obeys Allah and whoever turns back, so We have not sent you as a keeper over them”. So He (azwj) Joined obedience to Himself (azwj) with obedience to him (saww), and disobedience to Himself (azwj) with disobedience to him (saww). So that was the Evidence which was Delegated to him (saww), and a Testimony against the one who obeys him (saww), and disobeys him (saww), and between that in other places from the Great Book. So the Blessed and the High Said in the Incitement to follow him (saww), and the Exhortation with regards to his (saww) ratification, and the acceptance of his (saww) Call: “<a href=\"/#/books/quran:3#h31\">[3:31]</a> Say, (O Muhammad, tell to mankind): If you love Allah, follow me; Allah will love you and forgive you your sins”. So following him (saww) achieves the Love of Allah (azwj) and His (azwj) Pleasure, and the Forgiveness of the sins, and the completeness of the success, and the necessitation of the Paradise. And in the turning away from him (saww) achieves the Enmity of Allah (azwj), and His (azwj) Wrath, and His (azwj) Harshness, and remoteness from Him (azwj), and a dwelling in the Fire and that is His (azwj) Statement: “<a href=\"/#/books/quran:11#h17\">[11:17]</a> and whoever of the (different) parties disbelieves in it, the Fire will be their promised meeting-place”, meaning the striving against him (saww) and disobedience to him (saww). Allah (azwj), Blessed is His (azwj) Name, Tested His (azwj) servants by me (a.s.), and killed those that opposed Him (azwj) by my (a.s.) hand, and annihilated those that strived against Him (azwj) by my (a.s.) sword, and Made me (a.s.) to be a Means of nearness to Him (azwj) (Zulfat) for the Believers, and a ground of death for the toughest tyrants, and His (azwj) Sword against the criminals, and Strengthened by me (a.s.) the back of His (azwj) Messenger (saww), and Honoured me (a.s.) by helping him (saww), and Privileged me (a.s.) with his (saww) knowledge, and Gifted me (a.s.) with his (saww) Laws, and Favoured me (a.s.) for his (saww) successorship, and Chose me (a.s.) for his (saww) Caliphate in his (saww) community. So he (saww) said when he (saww) mobilised the Emigrants and the Helpers in their gathering: ‘O you people! Surely, Ali (a.s.) is from me (saww) like Haroun (as) was from Musa (as) except that there is no Prophet (as) to come after me (saww). So the Believers understood that the Messenger (saww) was speaking on behalf of Allah (azwj). They recognised me (a.s.) that I (a.s.) was not his (saww) brother by his (saww) father (as) or his (saww) mother (as) as was the case with Haroun (saww) who was the brother of Musa (as) from his (as) father and his (as) mother (as), nor was I (a.s.) a Prophet (as). The Prophet-hood has ended. But, that was from him (saww) appointing me (a.s.) as the Caliph just as Musa (as) had appointed Haroun (as) as the Caliph when he (as) said: “<a href=\"/#/books/quran:7#h142\">[7:142]</a> Take my place among my people, and act well and do not follow the way of the mischief-makers.” And his (saww) words when a group spoke saying, ‘We are the friends of the Messenger of Allah (azwj)’. So the Messenger (saww) of Allah (azwj) went out to the Farewell Pilgrimage, then came up to Ghadeer Khumm. So he (saww) ordered for something resembling a Pulpit to be prepared to him (saww). Then he (saww) ascended it, grabbed my (a.s.) arm and raised it to the extent that the whiteness of his (saww) armpits were seen, and said in a raised voice in that forum: ‘The one to whom I (saww) was the Master of, so Ali (a.s.) is his Master. Our Allah (azwj)! Befriend the one who befriends him (a.s.), and be Inimical to the one who is an enemy to him (a.s.). Thus, upon my (a.s.) Wilayah is the Wilayah of Allah (azwj), and upon my (a.s.) enmity is the enmity against Allah (azwj). And Allah (azwj), Mighty and Majestic Revealed in that day: “<a href=\"/#/books/quran:5#h3\">[5:3]</a> This day have I perfected for you your religion and completed My favor on you and chosen for you Islam as a religion”. So upon my (a.s.) Wilayah was the completion of the Religion, and the Pleasure of the Lord (azwj), Majestic is His (azwj) Remembrance. And Allah (azwj), Blessed and High, Revealed it especially for me (a.s.) and Honoured the Gifting it for me (a.s.) as (a sign of) greatness, and its gifting from the Messenger of Allah (saww), and it is the Statement of the High: “<a href=\"/#/books/quran:6#h62\">[6:62]</a> Then are men returned unto Allah, their protector, the (only) reality: Is not His the command? and He is the swiftest in taking account.” If I (a.s.) were to mention my (a.s.) merits, its loftiness would be great, and it’s listening prolonged. And about me (a.s.), two miserable ones before me (a.s.) disputed with me (a.s.) regarding that in which they had no rights over it, and they rode its misguidance, and believed in the ignorance. So evil is what was to them, what they returned to, and evil is what they made as a cradle for themselves. They cursed each other in their own houses, and each one of them distanced himself from his companion saying to him when he met him, ‘Alas! If only there was the distance between the East and the West between me and between you’. So evil is the friend who answered him, the miserable one upon his ragged condition, “<a href=\"/#/books/quran:25#h28\">[25:28]</a> O woe is me! would that I had not taken such a one for a friend. <a href=\"/#/books/quran:25#h29\">[25:29]</a> He verily led me astray from the Reminder after it had reached me. Satan was ever man’s deserter in the hour of need”. So I (a.s.) am the Reminder from which he went astray, and the Way from which he deviated, and the Belief which he denied, and the Quran from which he fled, and the Religion which he belied, and the Path from which he digressed. And the debris which they lived upon in their constant pride, they were on it on the verge of the Fire (prepared) for them - an evil return amongst the wicked group, to a condemned destination. They will be shouting curses at each other grumbling in regret. There will be no rest for these two; nor a respite from their inevitable Punishment. The people never ceased to be the worshippers of the idols and being the custodians of the idols, establishing rituals for them, and designated certain offerings for them in order to seek nearness to them. And they made for them titles such as ‘Al-Baheyra, and Al-Waseyla, and Al-Sa’ebat, and Al-Haam’. They distributed these idols by casting lots by arrows, wondering about Allah (azwj) Mighty is His (azwj) Remembrance. They were confused about the guidance, hastening to the remoteness, and they had been overcome by Satan (la) who had flooded them with the darkness of ignorance, having breastfed them with ignorance and weaned them with misguidance. Allah (azwj) Brought us (a.s.) out to them as a Mercy, and Informed about us (a.s.) as being higher than them, and Removed the Veil of Light from us (a.s.) for those that sought us (a.s.), and Preferred the ones who followed it (the Light), and we (a.s.) were a support for the ones who ratified it. So honour followed after the disgrace, and the plenty after the scarcity. And their hearts and their eyes revered them, and the tyrants yielded to them, and its respective communities became the people of the Bounties, being worthy of mention, and prestigious, and ease, and security after fear, and ‘جَمْعٍ’ union after having been separated. And Ma’d Bin Adnan was illuminated (famous) due to us (a.s.) and we (a.s.) inserted them in the Door of Guidance, and we (a.s.) entered them into the House of Peace, and we (a.s.) clothed them with the garment of Belief, and they became famous due to us (a.s.) in the worlds, and the effects of the righteous people appeared for them in the days of the Messenger (saww), from a striving protector, and an obedient worshipper, and an ascetic retreater, and they preserved the trusts and became as such until when Allah (azwj) Mighty and Majestic Called back His (azwj) Prophet (saww) and Raised him (saww) to Himself (azwj). That was not after him (saww) except like a moment of pulse, or a glimmer of lightning for them to return back and turn back upon their heels, and sought revenge by forming battalions, and they blocked the Door and destroyed the houses, and changed the effects of the Messenger of Allah (saww), and turned away from his (saww) rulings, and distanced themselves from his (saww) Light, and they changed his (saww) Caliph with an alternate. They took to him, and they were unjust in doing so, and they thought that the one whom they had chosen from the descendants of Abu Kohafa (Abu Bakr) is higher in status than the one (a.s.) whom the Messenger (saww) of Allah (azwj) had chosen to be in his (saww) place, and that the Emigrants from the progeny of Abu Kohafa were better than the Emigrants and the Helpers of the Rabbi of the Law Hashim Bin Abd Manaf (as). Nay! The first false testimony which occurred in Al-Islam was their testimony that their companion (Abu Bakr) is the one whom the Messenger (saww) of Allah (azwj) had made to be the Caliph. So when the matter of Sa’d Bin Ubada was what it was, they retracted from that and said that the Messenger (saww) of Allah (azwj) passed away and did not appoint a Caliph. So the Messenger of Allah (saww), the good, the Blessed, was the first one in Al-Islam against who the false testimony was borne. And after a little while they found out the evil of what (they came to know and found out the consequences of the evil of what) the former ones had established. And they had an alternative and an opportunity to recover from the death, and had the time to turn around from the lure of pride, and be in a tranquil condition, and the realisation of the deeds. Allah (azwj) had respited Shaddaad Bin Aad, and Thamud Bin Abbuwad, and Bal’am Bin Ba’our, and Bestowed upon them His (azwj) Favours, both apparent as well as hidden, Supplied them with the wealth, and the (prolongation) of their lives, and Granted them the land, so that due to these Blessings they would Remember the Signs of Allah (azwj), and they would recognise and be awed by Him (azwj), and turn to Him (azwj), and bring an end to their arrogance. So before they reached their (allocated) time, and enjoy their meal, Allah (azwj) Mighty and Majestic Grabbed them and cut them down. Some of them from sandstorm, some were overtaken by a scream, and some from being burned by the shadow, and some from the tremors, and some from sinking of the earth. Allah (azwj) was not Unjust to them, but they had been unjust to their own selves. Indeed! For every term there is a writing. So when the writing reaches its term, and it is uncovered for you about what would befall the unjust ones, and what the greatest losers have got to, you will run towards Allah (azwj) Mighty and Majestic from what they had been involved in and to what they are proceeding to. Nay! And I (a.s.) am among you, O you people, like Haroun (as) was in the people of the Pharaoh (la), and like the Door of Hitta in the Children of Israel, and like the Ark of Noah (as) in the people of Noah (as). I (a.s.) am the Great News (Al-Nabaa Al-Azeem), and the Great Truthful (Al-Siddique Al-Akbar), And after a little while you will come to know what had been Promised to you. And is this anything else but (was committed) for a morsel of food, and a sip of drink, light sleep. Then the disgrace will be necessitated upon them in the world, and on the Day of Judgement they will be returning to intense Punishment. And Allah (azwj) is not Oblivious (forgetful) of what they have done. So what is the Recompense for the one who turned away from His (azwj) Proof (a.s.), and denied His (azwj) Argument, and opposed His (azwj) Guides (a.s.), and turned away from His (azwj) Light and stormed (his way) into the darkness, and exchanged water for the mirage, and Bounties for the Punishment, and the success for the misery, and prosperity for the poverty, and the ease for the hardship. Nay! This is the Recompense of what they had sown and done before. So be certain of the Promise and of its reality, and be assured of what has been Promised on the Day of the coming of the ‘Scream’ (Dooms Day), with the Truth. “<a href=\"/#/books/quran:50#h42\">[50:42]</a> The day when they shall hear the cry in truth; that is the day of coming forth. <a href=\"/#/books/quran:50#h43\">[50:43]</a> Surely We give life and cause to die, and to Us is the eventuAl-coming <a href=\"/#/books/quran:50#h44\">[50:44]</a> The day on which the earth shall cleave asunder under them, they will make haste; that is a gathering together easy to Us”."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:3",
  "kind": "verse_list"
}