{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 8"}, "path": "/books/al-kafi:8", "titles": {"ar": "الجزء الثامن‏", "en": "Volume Eight"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:8:1", "titles": {"ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;", "en": "The Book - Garden (of Flowers)"}}, {"indexed_titles": {"en": "Chapter 30"}, "path": "/books/al-kafi:8:1:30", "titles": {"ar": "حَدِيثُ رَسُولِ اللَّهِ ( صلى الله عليه وآله )", "en": "HADEETH OF THE RASOOL<sup>saww</sup> OF ALLAH<sup>azwj</sup>"}}], "index": 2291, "local_index": 30, "part_type": "Chapter", "path": "/books/al-kafi:8:1:30", "titles": {"ar": "حَدِيثُ رَسُولِ اللَّهِ ( صلى الله عليه وآله )", "en": "HADEETH OF THE RASOOL<sup>saww</sup> OF ALLAH<sup>azwj</sup>"}, "verse_count": 4, "verse_start_index": 14771, "verses": [{"index": 14772, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:8:1:30:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14547</span>- عَلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ وَ غَيْرِهِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ مَا كَانَ شَيْ‏ءٌ أَحَبَّ إِلَى رَسُولِ اللَّهِ (صلى الله عليه وآله) مِنْ أَنْ يَظَلَّ جَائِعاً خَائِفاً فِي اللَّهِ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473214\">H 14547</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Saalim, and others, the following:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘There was nothing more beloved to the Rasool<sup>saww</sup> Allah<sup>azwj</sup> than remaining hungry and fearful for the sake of Allah<sup>azwj</sup>’."}]}, {"index": 14773, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:8:1:30:2", "text": "14548- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ جَمِيعاً عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ سَعِيدِ بْنِ عَمْرٍو الْجُعْفِيِّ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ دَخَلْتُ عَلَى أَبِي جَعْفَرٍ (عليه السلام) ذَاتَ يَوْمٍ وَ هُوَ يَأْكُلُ مُتَّكِئاً قَالَ وَ قَدْ كَانَ يَبْلُغُنَا أَنَّ ذَلِكَ يُكْرَهُ فَجَعَلْتُ أَنْظُرُ إِلَيْهِ فَدَعَانِي إِلَى طَعَامِهِ فَلَمَّا فَرَغَ قَالَ يَا مُحَمَّدُ لَعَلَّكَ تَرَى أَنَّ رَسُولَ اللَّهِ (صلى الله عليه وآله) مَا رَأَتْهُ عَيْنٌ وَ هُوَ يَأْكُلُ وَ هُوَ مُتَّكِئٌ مِنْ أَنْ بَعَثَهُ اللَّهُ إِلَى أَنْ قَبَضَهُ قَالَ ثُمَّ رَدَّ عَلَى نَفْسِهِ فَقَالَ لَا وَ اللَّهِ مَا رَأَتْهُ عَيْنٌ يَأْكُلُ وَ هُوَ مُتَّكِئٌ مِنْ أَنْ بَعَثَهُ اللَّهُ إِلَى أَنْ قَبَضَهُ \nثُمَّ قَالَ يَا مُحَمَّدُ لَعَلَّكَ تَرَى أَنَّهُ شَبِعَ مِنْ خُبْزِ الْبُرِّ ثَلَاثَةَ أَيَّامٍ مُتَوَالِيَةً مِنْ أَنْ بَعَثَهُ اللَّهُ إِلَى أَنْ قَبَضَهُ ثُمَّ رَدَّ عَلَى نَفْسِهِ ثُمَّ قَالَ لَا وَ اللَّهِ مَا شَبِعَ مِنْ خُبْزِ الْبُرِّ ثَلَاثَةَ أَيَّامٍ مُتَوَالِيَةً مُنْذُ بَعَثَهُ اللَّهُ إِلَى أَنْ قَبَضَهُ أَمَا إِنِّي لَا أَقُولُ إِنَّهُ كَانَ لَا يَجِدُ لَقَدْ كَانَ يُجِيزُ الرَّجُلَ الْوَاحِدَ بِالْمِائَةِ مِنَ الْإِبِلِ فَلَوْ أَرَادَ أَنْ يَأْكُلَ لَأَكَلَ وَ لَقَدْ أَتَاهُ جَبْرَئِيلُ (عليه السلام) بِمَفَاتِيحِ خَزَائِنِ الْأَرْضِ ثَلَاثَ مَرَّاتٍ يُخَيِّرُهُ مِنْ غَيْرِ أَنْ يَنْقُصَهُ اللَّهُ تَبَارَكَ وَ تَعَالَى مِمَّا أَعَدَّ اللَّهُ لَهُ يَوْمَ الْقِيَامَةِ شَيْئاً فَيَخْتَارُ التَّوَاضُعَ لِرَبِّهِ جَلَّ وَ عَزَّ وَ مَا سُئِلَ شَيْئاً قَطُّ فَيَقُولَ لَا إِنْ كَانَ أَعْطَى وَ إِنْ لَمْ يَكُنْ قَالَ يَكُونُ وَ مَا أَعْطَى عَلَى اللَّهِ شَيْئاً قَطُّ إِلَّا سَلَّمَ ذَلِكَ إِلَيْهِ حَتَّى إِنْ كَانَ لَيُعْطِي الرَّجُلَ الْجَنَّةَ فَيُسَلِّمُ اللَّهُ ذَلِكَ لَهُ ثُمَّ تَنَاوَلَنِي بِيَدِهِ \nوَ قَالَ وَ إِنْ كَانَ صَاحِبُكُمْ لَيَجْلِسُ جِلْسَةَ الْعَبْدِ وَ يَأْكُلُ إِكْلَةَ الْعَبْدِ وَ يُطْعِمُ النَّاسَ خُبْزَ الْبُرِّ وَ اللَّحْمَ وَ يَرْجِعُ إِلَى أَهْلِهِ فَيَأْكُلُ الْخُبْزَ وَ الزَّيْتَ وَ إِنْ كَانَ لَيَشْتَرِي الْقَمِيصَ السُّنْبُلَانِيَّ ثُمَّ يُخَيِّرُ غُلَامَهُ خَيْرَهُمَا ثُمَّ يَلْبَسُ الْبَاقِيَ فَإِذَا جَازَ أَصَابِعَهُ قَطَعَهُ وَ إِذَا جَازَ كَعْبَهُ حَذَفَهُ وَ مَا وَرَدَ عَلَيْهِ أَمْرَانِ قَطُّ كِلَاهُمَا لِلَّهِ رِضًا إِلَّا أَخَذَ بِأَشَدِّهِمَا عَلَى بَدَنِهِ وَ لَقَدْ وُلِّيَ النَّاسَ خَمْسَ سِنِينَ فَمَا وَضَعَ آجُرَّةً عَلَى آجُرَّةٍ وَ لَا لَبِنَةً عَلَى لَبِنَةٍ وَ لَا أَقْطَعَ قَطِيعَةً وَ لَا أَوْرَثَ بَيْضَاءَ وَ لَا حَمْرَاءَ إِلَّا سَبْعَمِائَةِ دِرْهَمٍ فَضَلَتْ مِنْ عَطَايَاهُ أَرَادَ أَنْ يَبْتَاعَ لِأَهْلِهِ بِهَا خَادِماً وَ مَا أَطَاقَ أَحَدٌ عَمَلَهُ وَ إِنْ كَانَ عَلِيُّ بْنُ الْحُسَيْنِ (عليه السلام) لَيَنْظُرُ فِي الْكِتَابِ مِنْ كُتُبِ عَلِيٍّ (عليه السلام) فَيَضْرِبُ بِهِ الْأَرْضَ وَ يَقُولُ مَنْ يُطِيقُ هَذَا.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473215\">H 14548</a> – A number of our companions, from sahl Bin Ziyad and Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbar altogether from Ibn Fazzaal, from Ali Bin Uqba, from Saeed Bin Amro and Al-Ju’fy, from Muhammad Bin Muslim who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> came up to Abu Ja’far</span><sup>asws</sup> one day and (I felt that) he<sup>asws</sup> was resting (upon something) whilst eating, and he<sup>asws</sup> had been telling us that it is undesirable. So I looked at him<sup>asws</sup>, so he<sup>asws</sup> called me over to eat with him<sup>asws</sup>. When he<sup>asws</sup> had finished, he<sup>asws</sup> said: ‘O Muhammad, you had been thinking that no eye had seen the Rasool<sup>saww</sup> Allah<sup>azwj</sup> eating whilst leaning (upon something) from the time Allah<sup>azwj</sup> Sent him<sup>saww</sup> up to his<sup>saww</sup> passing away’. He (the narrator) said, ‘Then he<sup>asws</sup> referred to himself<sup>asws</sup> and said: ‘No! By Allah<sup>azwj</sup>, no eye had seen him<sup>saww</sup> eating whilst leaning (upon something) from the time Allah<sup>azwj</sup> Sent him<sup>saww</sup> up to his<sup>saww</sup> passing away.\nThen said: ‘O Muhammad! Perhaps you think that he<sup>saww</sup> satiated himself<sup>saww</sup> from good bread for three continuous days from the time Allah<sup>azwj</sup> Sent him<sup>saww</sup> up to his<sup>saww</sup> passing away’. Then he<sup>asws</sup> referred to himself<sup>asws</sup>, then said: ‘No! By Allah<sup>azwj</sup>, he<sup>saww</sup> did not satiate himself<sup>saww</sup> from good bread for three continuous days since Allah<sup>azwj</sup> Sent him<sup>saww</sup> up to his<sup>saww</sup> passing away. But, I<sup>asws</sup> am not saying that he<sup>saww</sup> could not find it, for he<sup>saww</sup> used to gift one man a hundred camels. Had he<sup>saww</sup> intended to eat it he<sup>saww</sup> would have eaten. And Jibraeel had come to him<sup>saww</sup> with the Keys of the treasures of the earth three times giving him<sup>saww</sup> the option without any reduction of anything from Allah<sup>azwj</sup> from what Allah<sup>azwj</sup> had Prepared for him<sup>saww</sup> for the Day of Judgement. \nHe<sup>saww</sup> chose the modesty to his<sup>saww</sup> Lord<sup>azwj</sup>. And when asked for anything he<sup>saww</sup> never said, ‘No’, at all. He<sup>saww</sup> would say: ‘If I<sup>saww</sup> had it I<sup>saww</sup> would give it’. And if was not available, he<sup>saww</sup> would say: ‘It would come’, and whenever Allah<sup>azwj</sup> Gave anything at all he<sup>saww</sup> would hand it over to him, to the extent that if the man has been Given the Paradise, which Allah<sup>azwj</sup> would submit to him<sup>saww</sup>, then he<sup>saww</sup> would give it to him by his<sup>saww</sup> own hands’.\nAnd said: ‘Your Master (Amir-ul-Momineen<sup>asws</sup>) used to sit like the sitting of the slave, and eat like the eating of the slave, and would feed the people good bread and the meat, and would return to his<sup>asws</sup> family to eat bread with oil. And if he<sup>asws</sup> were to buy <span class=\"iTxt\">Al-Sunbulany</span> shirt, then he<sup>asws</sup> would give his<sup>asws</sup> slave the choice of the better one, then would wear the remaining one. \nSo if he<sup>asws</sup> would find a little excess he<sup>asws</sup> would withdraw it, and if his<sup>asws</sup> would feel that his heel<sup>asws</sup> had exceeded he<sup>asws</sup> would have removed it. No two matters would be referred to him<sup>asws</sup> at all for the sake of Allah<sup>azwj</sup> except that he<sup>asws</sup> would opt for the more difficult one upon his<sup>asws</sup> body, and he<sup>asws</sup> was the ruler of the people for five years but did not place a brick upon a brick, and did not build a construction upon a construction, and did not acquire a piece of land, and did not leave a legacy behind him, white or red except for seven hundred Dirhams as a gifts, intending that he<sup>asws</sup> would buy a servant for his<sup>asws</sup> Family. No one could bear any of his works, and Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> used to look into a Book from the Books of Ali<sup>asws</sup>, so he<sup>asws</sup> would strike the ground with it and would say: ‘Who can endure this?’ "}]}, {"index": 14774, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:8:1:30:3", "text": "14549- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ قَالَ حَدَّثَنِي عَلِيُّ بْنُ الْمُغِيرَةِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ إِنَّ جَبْرَئِيلَ (عليه السلام) أَتَى رَسُولَ اللَّهِ (صلى الله عليه وآله) فَخَيَّرَهُ وَ أَشَارَ عَلَيْهِ بِالتَّوَاضُعِ وَ كَانَ لَهُ نَاصِحاً فَكَانَ رَسُولُ اللَّهِ (صلى الله عليه وآله) يَأْكُلُ إِكْلَةَ الْعَبْدِ وَ يَجْلِسُ جِلْسَةَ الْعَبْدِ تَوَاضُعاً لِلَّهِ تَبَارَكَ وَ تَعَالَى ثُمَّ أَتَاهُ عِنْدَ الْمَوْتِ بِمَفَاتِيحِ خَزَائِنِ الدُّنْيَا فَقَالَ هَذِهِ مَفَاتِيحُ خَزَائِنِ الدُّنْيَا بَعَثَ بِهَا إِلَيْكَ رَبُّكَ لِيَكُونَ لَكَ مَا أَقَلَّتِ الْأَرْضُ مِنْ غَيْرِ أَنْ يَنْقُصَكَ شَيْئاً فَقَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) فِي الرَّفِيقِ الْأَعْلَى.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473216\">H 14549</a> – A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Hammaad Bin Usman from Ali Bin Mugheira who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying that: ‘Jibraeel<sup>as</sup> came to the Rasool<sup>saww</sup> Allah<sup>azwj</sup> giving the option and indicating to him<sup>saww</sup> for the humbleness and was advising him<sup>saww</sup>. The Rasool<sup>saww</sup> Allah<sup>azwj</sup> used to eat like the eating of the slave, and sit like the sitting of the slave being humble to Allah<sup>azwj</sup>. Then he<sup>saww</sup> was given (by Jibraeel) at the time of his<sup>saww</sup> death, the Keys of the treasures of the world. So he (Jibraeel) said: ‘These are the Keys of the treasures of the world which your<sup>saww</sup> Lord<sup>azwj</sup> has Sent to you<sup>saww</sup> so that there will be for you all that is carried by the earth without any reduction of anything’. The Rasool<sup>saww</sup> Allah<sup>azwj</sup> said: ‘I<sup>saww</sup> (want to be) among the friends of the Most High<sup>azwj</sup>’."}]}, {"index": 14775, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:8:1:30:4", "text": "14550- سَهْلُ بْنُ زِيَادٍ عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ عَبْدِ الْمُؤْمِنِ الْأَنْصَارِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) عُرِضَتْ عَلَيَّ بَطْحَاءُ مَكَّةَ ذَهَباً فَقُلْتُ يَا رَبِّ لَا وَ لَكِنْ أَشْبَعُ يَوْماً وَ أَجُوعُ يَوْماً فَإِذَا شَبِعْتُ حَمِدْتُكَ وَ شَكَرْتُكَ وَ إِذَا جُعْتُ دَعَوْتُكَ وَ ذَكَرْتُكَ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473217\">H 14550</a> – Sahl Bin Ziyad, from Ibn fazzaal, from Ali Bin Uqba, from Abdul Mo’min Al-Ansary, who has said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘The Rasool<sup>saww</sup> Allah<sup>azwj</sup> said: ‘There were presented to me<sup>saww</sup> <span class=\"iTxt\">Bat’ha</span> and <span class=\"iTxt\">Makka</span> of gold. So I<sup>saww</sup> said: ‘O Lord<sup>azwj</sup>! No, but I<sup>saww</sup> would like to satiate one day and remain hungry one day, for if I<sup>saww</sup> am satiated I<sup>saww</sup> would thank You<sup>azwj</sup>, and if I<sup>saww</sup> am hungry, I<sup>saww</sup> would supplicate to You<sup>azwj</sup> and Remember You<sup>azwj</sup>’.\nout of 567"}]}]}, "index": "al-kafi:8:1:30", "kind": "verse_list"}