{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 31"
        },
        "path": "/books/al-kafi:8:1:31",
        "titles": {
          "ar": "حَدِيثُ عِيسَى ابْنِ مَرْيَمَ ( عليهما السلام )",
          "en": "HADEETH OF ISA BIN MARYAM<sup>as</sup>"
        }
      }
    ],
    "index": 2302,
    "local_index": 31,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 32"
        },
        "path": "/books/al-kafi:8:1:32",
        "titles": {
          "ar": "حَدِيثُ إِبْلِيسَ",
          "en": "HADEETH ABOUT IBLEES<sup>la</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 30"
        },
        "path": "/books/al-kafi:8:1:30",
        "titles": {
          "ar": "حَدِيثُ رَسُولِ اللَّهِ ( صلى الله عليه وآله )",
          "en": "HADEETH OF THE RASOOL<sup>saww</sup> OF ALLAH<sup>azwj</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:31",
    "titles": {
      "ar": "حَدِيثُ عِيسَى ابْنِ مَرْيَمَ ( عليهما السلام )",
      "en": "HADEETH OF ISA BIN MARYAM<sup>as</sup>"
    },
    "verse_count": 2,
    "verse_start_index": 14786,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14787,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:31:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14551</span>- عَلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْهُمْ (عليهم السلام) قَالَ فِيمَا وَعَظَ اللَّهُ عَزَّ وَ جَلَّ بِهِ عِيسَى (عليه السلام) يَا عِيسَى أَنَا رَبُّكَ وَ رَبُّ آبَائِكَ اسْمِي وَاحِدٌ وَ أَنَا الْأَحَدُ الْمُتَفَرِّدُ بِخَلْقِ كُلِّ شَيْ‏ءٍ وَ كُلُّ شَيْ‏ءٍ مِنْ صُنْعِي وَ كُلٌّ إِلَيَّ رَاجِعُونَ ",
          "يَا عِيسَى أَنْتَ الْمَسِيحُ بِأَمْرِي وَ أَنْتَ تَخْلُقُ مِنَ الطِّينِ كَهَيْئَةِ الطَّيْرِ بِإِذْنِي وَ أَنْتَ تُحْيِي الْمَوْتَى بِكَلَامِي فَكُنْ إِلَيَّ رَاغِباً وَ مِنِّي رَاهِباً وَ لَنْ تَجِدَ مِنِّي مَلْجَأً إِلَّا إِلَيَّ ",
          "يَا عِيسَى أُوصِيكَ وَصِيَّةَ الْمُتَحَنِّنِ عَلَيْكَ بِالرَّحْمَةِ حَتَّى حَقَّتْ لَكَ مِنِّي الْوَلَايَةُ بِتَحَرِّيكَ مِنِّي الْمَسَرَّةَ فَبُورِكْتَ كَبِيراً وَ بُورِكْتَ صَغِيراً حَيْثُ مَا كُنْتَ أَشْهَدُ أَنَّكَ عَبْدِي ابْنُ أَمَتِي أَنْزِلْنِي مِنْ نَفْسِكَ كَهَمِّكَ وَ اجْعَلْ ذِكْرِي لِمَعَادِكَ وَ تَقَرَّبْ إِلَيَّ بِالنَّوَافِلِ وَ تَوَكَّلْ عَلَيَّ أَكْفِكَ وَ لَا تَوَكَّلْ عَلَى غَيْرِي فَآخُذَ لَكَ ",
          "يَا عِيسَى اصْبِرْ عَلَى الْبَلَاءِ وَ ارْضَ بِالْقَضَاءِ وَ كُنْ كَمَسَرَّتِي فِيكَ فَإِنَّ مَسَرَّتِي أَنْ أُطَاعَ فَلَا أُعْصَى ",
          "يَا عِيسَى أَحْيِ ذِكْرِي بِلِسَانِكَ وَ لْيَكُنْ وُدِّي فِي قَلْبِكَ ",
          "يَا عِيسَى تَيَقَّظْ فِي سَاعَاتِ الْغَفْلَةِ وَ احْكُمْ لِي لَطِيفَ الْحِكْمَةِ ",
          "يَا عِيسَى كُنْ رَاغِباً رَاهِباً وَ أَمِتْ قَلْبَكَ بِالْخَشْيَةِ ",
          "يَا عِيسَى رَاعِ اللَّيْلَ لِتَحَرِّي مَسَرَّتِي وَ أَظْمِئْ نَهَارَكَ لِيَوْمِ حَاجَتِكَ عِنْدِي ",
          "يَا عِيسَى نَافِسْ فِي الْخَيْرِ جُهْدَكَ تُعْرَفْ بِالْخَيْرِ حَيْثُمَا تَوَجَّهْتَ ",
          "يَا عِيسَى احْكُمْ فِي عِبَادِي بِنُصْحِي وَ قُمْ فِيهِمْ بِعَدْلِي فَقَدْ أَنْزَلْتُ عَلَيْكَ شِفَاءً لِمَا فِي الصُّدُورِ مِنْ مَرَضِ الشَّيْطَانِ ",
          "يَا عِيسَى لَا تَكُنْ جَلِيساً لِكُلِّ مَفْتُونٍ ",
          "يَا عِيسَى حَقّاً أَقُولُ مَا آمَنَتْ بِي خَلِيقَةٌ إِلَّا خَشَعَتْ لِي وَ لَا خَشَعَتْ لِي إِلَّا رَجَتْ ثَوَابِي فَأَشْهَدُ أَنَّهَا آمِنَةٌ مِنْ عِقَابِي مَا لَمْ تُبَدِّلْ أَوْ تُغَيِّرْ سُنَّتِي ",
          "يَا عِيسَى ابْنَ الْبِكْرِ الْبَتُولِ ابْكِ عَلَى نَفْسِكَ بُكَاءَ مَنْ وَدَّعَ الْأَهْلَ وَ قَلَى الدُّنْيَا وَ تَرَكَهَا لِأَهْلِهَا وَ صَارَتْ رَغْبَتُهُ فِيمَا عِنْدَ إِلَهِهِ ",
          "يَا عِيسَى كُنْ مَعَ ذَلِكَ تُلِينُ الْكَلَامَ وَ تُفْشِي السَّلَامَ يَقْظَانَ إِذَا نَامَتْ عُيُونُ الْأَبْرَارِ حَذَراً لِلْمَعَادِ وَ الزَّلَازِلِ الشِّدَادِ وَ أَهْوَالِ يَوْمِ الْقِيَامَةِ حَيْثُ لَا يَنْفَعُ أَهْلٌ وَ لَا وَلَدٌ وَ لَا مَالٌ ",
          "يَا عِيسَى اكْحُلْ عَيْنَكَ بِمِيلِ الْحُزْنِ إِذَا ضَحِكَ الْبَطَّالُونَ ",
          "يَا عِيسَى كُنْ خَاشِعاً صَابِراً فَطُوبَى لَكَ إِنْ نَالَكَ مَا وُعِدَ الصَّابِرُونَ ",
          "يَا عِيسَى رُحْ مِنَ الدُّنْيَا يَوْماً فَيَوْماً وَ ذُقْ لِمَا قَدْ ذَهَبَ طَعْمُهُ فَحَقّاً أَقُولُ مَا أَنْتَ إِلَّا بِسَاعَتِكَ وَ يَوْمِكَ فَرُحْ مِنَ الدُّنْيَا بِبُلْغَةٍ وَ لْيَكْفِكَ الْخَشِنُ الْجَشِبُ فَقَدْ رَأَيْتَ إِلَى مَا تَصِيرُ وَ مَكْتُوبٌ مَا أَخَذْتَ وَ كَيْفَ أَتْلَفْتَ ",
          "يَا عِيسَى إِنَّكَ مَسْئُولٌ فَارْحَمِ الضَّعِيفَ كَرَحْمَتِي إِيَّاكَ وَ لَا تَقْهَرِ الْيَتِيمَ ",
          "يَا عِيسَى ابْكِ عَلَى نَفْسِكَ فِي الْخَلَوَاتِ وَ انْقُلْ قَدَمَيْكَ إِلَى مَوَاقِيتِ الصَّلَوَاتِ وَ أَسْمِعْنِي لَذَاذَةَ نُطْقِكَ بِذِكْرِي فَإِنَّ صَنِيعِي إِلَيْكَ حَسَنٌ ",
          "يَا عِيسَى كَمْ مِنْ أُمَّةٍ قَدْ أَهْلَكْتُهَا بِسَالِفِ ذُنُوبٍ قَدْ عَصَمْتُكَ مِنْهَا ",
          "يَا عِيسَى ارْفُقْ بِالضَّعِيفِ وَ ارْفَعْ طَرْفَكَ الْكَلِيلَ إِلَى السَّمَاءِ وَ ادْعُنِي فَإِنِّي مِنْكَ قَرِيبٌ وَ لَا تَدْعُنِي إِلَّا مُتَضَرِّعاً إِلَيَّ وَ هَمَّكَ هَمّاً وَاحِداً فَإِنَّكَ مَتَى تَدْعُنِي كَذَلِكَ أُجِبْكَ ",
          "يَا عِيسَى إِنِّي لَمْ أَرْضَ بِالدُّنْيَا ثَوَاباً لِمَنْ كَانَ قَبْلَكَ وَ لَا عِقَاباً لِمَنِ انْتَقَمْتُ مِنْهُ ",
          "يَا عِيسَى إِنَّكَ تَفْنَى وَ أَنَا أَبْقَى وَ مِنِّي رِزْقُكَ وَ عِنْدِي مِيقَاتُ أَجَلِكَ وَ إِلَيَّ إِيَابُكَ وَ عَلَيَّ حِسَابُكَ فَسَلْنِي وَ لَا تَسْأَلْ غَيْرِي فَيَحْسُنَ مِنْكَ الدُّعَاءُ وَ مِنِّي الْإِجَابَةُ ",
          "يَا عِيسَى مَا أَكْثَرَ الْبَشَرَ وَ أَقَلَّ عَدَدَ مَنْ صَبَرَ الْأَشْجَارُ كَثِيرَةٌ وَ طَيِّبُهَا قَلِيلٌ فَلَا يَغُرَّنَّكَ حُسْنُ شَجَرَةٍ حَتَّى تَذُوقَ ثَمَرَهَا ",
          "يَا عِيسَى لَا يَغُرَّنَّكَ الْمُتَمَرِّدُ عَلَيَّ بِالْعِصْيَانِ يَأْكُلُ رِزْقِي وَ يَعْبُدُ غَيْرِي ثُمَّ يَدْعُونِي عِنْدَ الْكَرْبِ فَأُجِيبُهُ ثُمَّ يَرْجِعُ إِلَى مَا كَانَ عَلَيْهِ فَعَلَيَّ يَتَمَرَّدُ أَمْ بِسَخَطِي يَتَعَرَّضُ فَبِي حَلَفْتُ لآَخُذَنَّهُ أَخْذَةً لَيْسَ لَهُ مِنْهَا مَنْجًى وَ لَا دُونِي مَلْجَأٌ أَيْنَ يَهْرُبُ مِنْ سَمَائِي وَ أَرْضِي ",
          "يَا عِيسَى قُلْ لِظَلَمَةِ بَنِي إِسْرَائِيلَ لَا تَدْعُونِي وَ السُّحْتُ تَحْتَ أَحْضَانِكُمْ وَ الْأَصْنَامُ فِي بُيُوتِكُمْ فَإِنِّي آلَيْتُ أَنْ أُجِيبَ مَنْ دَعَانِي وَ أَنْ أَجْعَلَ إِجَابَتِي إِيَّاهُمْ لَعْناً عَلَيْهِمْ حَتَّى يَتَفَرَّقُوا ",
          "يَا عِيسَى كَمْ أُطِيلُ النَّظَرَ وَ أُحْسِنُ الطَّلَبَ وَ الْقَوْمُ فِي غَفْلَةٍ لَا يَرْجِعُونَ تَخْرُجُ الْكَلِمَةُ مِنْ أَفْوَاهِهِمْ لَا تَعِيهَا قُلُوبُهُمْ يَتَعَرَّضُونَ لِمَقْتِي وَ يَتَحَبَّبُونَ بِقُرْبِي إِلَى الْمُؤْمِنِينَ ",
          "يَا عِيسَى لِيَكُنْ لِسَانُكَ فِي السِّرِّ وَ الْعَلَانِيَةِ وَاحِداً وَ كَذَلِكَ فَلْيَكُنْ قَلْبُكَ وَ بَصَرُكَ وَ اطْوِ قَلْبَكَ وَ لِسَانَكَ عَنِ الْمَحَارِمِ وَ كُفَّ بَصَرَكَ عَمَّا لَا خَيْرَ فِيهِ فَكَمْ مِنْ نَاظِرٍ نَظْرَةً قَدْ زَرَعَتْ فِي قَلْبِهِ شَهْوَةً وَ وَرَدَتْ بِهِ مَوَارِدَ حِيَاضِ الْهَلَكَةِ ",
          "يَا عِيسَى كُنْ رَحِيماً مُتَرَحِّماً وَ كُنْ كَمَا تَشَاءُ أَنْ يَكُونَ الْعِبَادُ لَكَ وَ أَكْثِرْ ذِكْرَكَ الْمَوْتَ وَ مُفَارَقَةَ الْأَهْلِينَ وَ لَا تَلْهُ فَإِنَّ اللَّهْوَ يُفْسِدُ صَاحِبَهُ وَ لَا تَغْفُلْ فَإِنَّ الْغَافِلَ مِنِّي بَعِيدٌ وَ اذْكُرْنِي بِالصَّالِحَاتِ حَتَّى أَذْكُرَكَ ",
          "يَا عِيسَى تُبْ إِلَيَّ بَعْدَ الذَّنْبِ وَ ذَكِّرْ بِيَ الْأَوَّابِينَ وَ آمِنْ بِي وَ تَقَرَّبْ بِي إِلَى الْمُؤْمِنِينَ وَ مُرْهُمْ يَدْعُونِي مَعَكَ وَ إِيَّاكَ وَ دَعْوَةَ الْمَظْلُومِ فَإِنِّي آلَيْتُ عَلَى نَفْسِي أَنْ أَفْتَحَ لَهَا بَاباً مِنَ السَّمَاءِ بِالْقَبُولِ وَ أَنْ أُجِيبَهُ وَ لَوْ بَعْدَ حِينٍ ",
          "يَا عِيسَى اعْلَمْ أَنَّ صَاحِبَ السَّوْءِ يُعْدِي وَ قَرِينَ السَّوْءِ يُرْدِي وَ اعْلَمْ مَنْ تُقَارِنُ وَ اخْتَرْ لِنَفْسِكَ إِخْوَاناً مِنَ الْمُؤْمِنِينَ ",
          "يَا عِيسَى تُبْ إِلَيَّ فَإِنِّي لَا يَتَعَاظَمُنِي ذَنْبٌ أَنْ أَغْفِرَهُ وَ أَنَا أَرْحَمُ الرَّاحِمِينَ اعْمَلْ لِنَفْسِكَ فِي مُهْلَةٍ مِنْ أَجَلِكَ قَبْلَ أَنْ لَا يَعْمَلَ لَهَا غَيْرُكَ وَ اعْبُدْنِي لِيَوْمٍ كَأَلْفِ سَنَةٍ مِمَّا تَعُدُّونَ فِيهِ أَجْزِي بِالْحَسَنَةِ أَضْعَافَهَا وَ إِنَّ السَّيِّئَةَ تُوبِقُ صَاحِبَهَا فَامْهَدْ لِنَفْسِكَ فِي مُهْلَةٍ وَ نَافِسْ فِي الْعَمَلِ الصَّالِحِ فَكَمْ مِنْ مَجْلِسٍ قَدْ نَهَضَ أَهْلُهُ وَ هُمْ مُجَارُونَ مِنَ النَّارِ ",
          "يَا عِيسَى ازْهَدْ فِي الْفَانِي الْمُنْقَطِعِ وَ طَأْ رُسُومَ مَنَازِلِ مَنْ كَانَ قَبْلَكَ فَادْعُهُمْ وَ نَاجِهِمْ هَلْ تُحِسُّ مِنْهُمْ مِنْ أَحَدٍ وَ خُذْ مَوْعِظَتَكَ مِنْهُمْ وَ اعْلَمْ أَنَّكَ سَتَلْحَقُهُمْ فِي اللَّاحِقِينَ ",
          "يَا عِيسَى قُلْ لِمَنْ تَمَرَّدَ عَلَيَّ بِالْعِصْيَانِ وَ عَمِلَ بِالْإِدْهَانِ لِيَتَوَقَّعْ عُقُوبَتِي وَ يَنْتَظِرُ إِهْلَاكِي إِيَّاهُ سَيُصْطَلَمُ مَعَ الْهَالِكِينَ ",
          "طُوبَى لَكَ يَا ابْنَ مَرْيَمَ ثُمَّ طُوبَى لَكَ إِنْ أَخَذْتَ بِأَدَبِ إِلَهِكَ الَّذِي يَتَحَنَّنُ عَلَيْكَ تَرَحُّماً وَ بَدَأَكَ بِالنِّعَمِ مِنْهُ تَكَرُّماً وَ كَانَ لَكَ فِي الشَّدَائِدِ لَا تَعْصِهِ ",
          "يَا عِيسَى فَإِنَّهُ لَا يَحِلُّ لَكَ عِصْيَانُهُ قَدْ عَهِدْتُ إِلَيْكَ كَمَا عَهِدْتُ إِلَى مَنْ كَانَ قَبْلَكَ وَ أَنَا عَلَى ذَلِكَ مِنَ الشَّاهِدِينَ ",
          "يَا عِيسَى مَا أَكْرَمْتُ خَلِيقَةً بِمِثْلِ دِينِي وَ لَا أَنْعَمْتُ عَلَيْهَا بِمِثْلِ رَحْمَتِي",
          "يَا عِيسَى اغْسِلْ بِالْمَاءِ مِنْكَ مَا ظَهَرَ وَ دَاوِ بِالْحَسَنَاتِ مِنْكَ مَا بَطَنَ فَإِنَّكَ إِلَيَّ رَاجِعٌ ",
          "يَا عِيسَى أَعْطَيْتُكَ مَا أَنْعَمْتُ بِهِ عَلَيْكَ فَيْضاً مِنْ غَيْرِ تَكْدِيرٍ وَ طَلَبْتُ مِنْكَ قَرْضاً لِنَفْسِكَ فَبَخِلْتَ بِهِ عَلَيْهَا لِتَكُونَ مِنَ الْهَالِكِينَ",
          "يَا عِيسَى تَزَيَّنْ بِالدِّينِ وَ حُبِّ الْمَسَاكِينِ وَ امْشِ عَلَى الْأَرْضِ هَوْناً وَ صَلِّ عَلَى الْبِقَاعِ فَكُلُّهَا طَاهِرٌ",
          "يَا عِيسَى شَمِّرْ فَكُلُّ مَا هُوَ آتٍ قَرِيبٌ وَ اقْرَأْ كِتَابِي وَ أَنْتَ طَاهِرٌ وَ أَسْمِعْنِي مِنْكَ صَوْتاً حَزِيناً ",
          "يَا عِيسَى لَا خَيْرَ فِي لَذَاذَةٍ لَا تَدُومُ وَ عَيْشٍ مِنْ صَاحِبِهِ يَزُولُ ",
          "يَا ابْنَ مَرْيَمَ لَوْ رَأَتْ عَيْنُكَ مَا أَعْدَدْتُ لِأَوْلِيَائِيَ الصَّالِحِينَ ذَابَ قَلْبُكَ وَ زَهَقَتْ نَفْسُكَ شَوْقاً إِلَيْهِ فَلَيْسَ كَدَارِ الْآخِرَةِ دَارٌ تَجَاوَرَ فِيهَا الطَّيِّبُونَ وَ يَدْخُلُ عَلَيْهِمْ فِيهَا الْمَلَائِكَةُ الْمُقَرَّبُونَ وَ هُمْ مِمَّا يَأْتِي يَوْمَ الْقِيَامَةِ مِنْ أَهْوَالِهَا آمِنُونَ دَارٌ لَا يَتَغَيَّرُ فِيهَا النَّعِيمُ وَ لَا يَزُولُ عَنْ أَهْلِهَا ",
          "يَا ابْنَ مَرْيَمَ نَافِسْ فِيهَا مَعَ الْمُتَنَافِسِينَ فَإِنَّهَا أُمْنِيَّةُ الْمُتَمَنِّينَ حَسَنَةُ الْمَنْظَرِ ",
          "طُوبَى لَكَ يَا ابْنَ مَرْيَمَ إِنْ كُنْتَ لَهَا مِنَ الْعَامِلِينَ مَعَ آبَائِكَ آدَمَ وَ إِبْرَاهِيمَ فِي جَنَّاتٍ وَ نَعِيمٍ لَا تَبْغِي بِهَا بَدَلًا وَ لَا تَحْوِيلًا كَذَلِكَ أَفْعَلُ بِالْمُتَّقِينَ ",
          "يَا عِيسَى اهْرُبْ إِلَيَّ مَعَ مَنْ يَهْرُبُ مِنْ نَارٍ ذَاتِ لَهَبٍ وَ نَارٍ ذَاتِ أَغْلَالٍ وَ أَنْكَالٍ لَا يَدْخُلُهَا رَوْحٌ وَ لَا يَخْرُجُ مِنْهَا غَمٌّ أَبَداً قِطَعٌ كَقِطَعِ اللَّيْلِ الْمُظْلِمِ مَنْ يَنْجُ مِنْهَا يَفُزْ وَ لَنْ يَنْجُوَ مِنْهَا مَنْ كَانَ مِنَ الْهَالِكِينَ هِيَ دَارُ الْجَبَّارِينَ وَ الْعُتَاةِ الظَّالِمِينَ وَ كُلِّ فَظٍّ غَلِيظٍ وَ كُلِّ مُخْتَالٍ فَخُورٍ ",
          "يَا عِيسَى بِئْسَتِ الدَّارُ لِمَنْ رَكَنَ إِلَيْهَا وَ بِئْسَ الْقَرَارُ دَارُ الظَّالِمِينَ إِنِّي أُحَذِّرُكَ نَفْسَكَ فَكُنْ بِي خَبِيراً ",
          "يَا عِيسَى كُنْ حَيْثُ مَا كُنْتَ مُرَاقِباً لِي وَ اشْهَدْ عَلَى أَنِّي خَلَقْتُكَ وَ أَنْتَ عَبْدِي وَ أَنِّي صَوَّرْتُكَ وَ إِلَى الْأَرْضِ أَهْبَطْتُكَ ",
          "يَا عِيسَى لَا يَصْلُحُ لِسَانَانِ فِي فَمٍ وَاحِدٍ وَ لَا قَلْبَانِ فِي صَدْرٍ وَاحِدٍ وَ كَذَلِكَ الْأَذْهَانُ ",
          "يَا عِيسَى لَا تَسْتَيْقِظَنَّ عَاصِياً وَ لَا تَسْتَنْبِهَنَّ لَاهِياً وَ افْطِمْ نَفْسَكَ عَنِ الشَّهَوَاتِ الْمُوبِقَاتِ وَ كُلُّ شَهْوَةٍ تُبَاعِدُكَ مِنِّي فَاهْجُرْهَا وَ اعْلَمْ أَنَّكَ مِنِّي بِمَكَانِ الرَّسُولِ الْأَمِينِ فَكُنْ مِنِّي عَلَى حَذَرٍ وَ اعْلَمْ أَنَّ دُنْيَاكَ مُؤَدِّيَتُكَ إِلَيَّ وَ أَنِّي آخُذُكَ بِعِلْمِي فَكُنْ ذَلِيلَ النَّفْسِ عِنْدَ ذِكْرِي خَاشِعَ الْقَلْبِ حِينَ تَذْكُرُنِي يَقْظَانَ عِنْدَ نَوْمِ الْغَافِلِينَ ",
          "يَا عِيسَى هَذِهِ نَصِيحَتِي إِيَّاكَ وَ مَوْعِظَتِي لَكَ فَخُذْهَا مِنِّي وَ إِنِّي رَبُّ الْعَالَمِينَ ",
          "يَا عِيسَى إِذَا صَبَرَ عَبْدِي فِي جَنْبِي كَانَ ثَوَابُ عَمَلِهِ عَلَيَّ وَ كُنْتُ عِنْدَهُ حِينَ يَدْعُونِي وَ كَفَى بِي مُنْتَقِماً مِمَّنْ عَصَانِي أَيْنَ يَهْرُبُ مِنِّي الظَّالِمُونَ ",
          "يَا عِيسَى أَطِبِ الْكَلَامَ وَ كُنْ حَيْثُمَا كُنْتَ عَالِماً مُتَعَلِّماً ",
          "يَا عِيسَى أَفِضْ بِالْحَسَنَاتِ إِلَيَّ حَتَّى يَكُونَ لَكَ ذِكْرُهَا عِنْدِي وَ تَمَسَّكْ بِوَصِيَّتِي فَإِنَّ فِيهَا شِفَاءً لِلْقُلُوبِ ",
          "يَا عِيسَى لَا تَأْمَنْ إِذَا مَكَرْتَ مَكْرِي وَ لَا تَنْسَ عِنْدَ خَلَوَاتِ الدُّنْيَا ذِكْرِي ",
          "يَا عِيسَى حَاسِبْ نَفْسَكَ بِالرُّجُوعِ إِلَيَّ حَتَّى تَتَنَجَّزَ ثَوَابَ مَا عَمِلَهُ الْعَامِلُونَ أُولَئِكَ يُؤْتَوْنَ أَجْرَهُمْ وَ أَنَا خَيْرُ الْمُؤْتِينَ ",
          "يَا عِيسَى كُنْتَ خَلْقاً بِكَلَامِي وَلَدَتْكَ مَرْيَمُ بِأَمْرِيَ الْمُرْسَلُ إِلَيْهَا رُوحِي جَبْرَئِيلُ الْأَمِينُ مِنْ مَلَائِكَتِي حَتَّى قُمْتَ عَلَى الْأَرْضِ حَيّاً تَمْشِي كُلُّ ذَلِكَ فِي سَابِقِ عِلْمِي ",
          "يَا عِيسَى زَكَرِيَّا بِمَنْزِلَةِ أَبِيكَ وَ كَفِيلُ أُمِّكَ إِذْ يَدْخُلُ عَلَيْهَا الْمِحْرَابَ فَيَجِدُ عِنْدَهَا رِزْقاً وَ نَظِيرُكَ يَحْيَى مِنْ خَلْقِي وَهَبْتُهُ لِأُمِّهِ بَعْدَ الْكِبَرِ مِنْ غَيْرِ قُوَّةٍ بِهَا أَرَدْتُ بِذَلِكَ أَنْ يَظْهَرَ لَهَا سُلْطَانِي وَ يَظْهَرَ فِيكَ قُدْرَتِي أَحَبُّكُمْ إِلَيَّ أَطْوَعُكُمْ لِي وَ أَشَدُّكُمْ خَوْفاً مِنِّي ",
          "يَا عِيسَى تَيَقَّظْ وَ لَا تَيْأَسْ مِنْ رَوْحِي وَ سَبِّحْنِي مَعَ مَنْ يُسَبِّحُنِي وَ بِطَيِّبِ الْكَلَامِ فَقَدِّسْنِي ",
          "يَا عِيسَى كَيْفَ يَكْفُرُ الْعِبَادُ بِي وَ نَوَاصِيهِمْ فِي قَبْضَتِي وَ تَقَلُّبُهُمْ فِي أَرْضِي يَجْهَلُونَ نِعْمَتِي وَ يَتَوَلَّوْنَ عَدُوِّي وَ كَذَلِكَ يَهْلِكُ الْكَافِرُونَ ",
          "يَا عِيسَى إِنَّ الدُّنْيَا سِجْنٌ مُنْتِنُ الرِّيحِ وَ حَسُنَ فِيهَا مَا قَدْ تَرَى مِمَّا قَدْ تَذَابَحَ عَلَيْهِ الْجَبَّارُونَ وَ إِيَّاكَ وَ الدُّنْيَا فَكُلُّ نَعِيمِهَا يَزُولُ وَ مَا نَعِيمُهَا إِلَّا قَلِيلٌ ",
          "يَا عِيسَى ابْغِنِي عِنْدَ وِسَادِكَ تَجِدْنِي وَ ادْعُنِي وَ أَنْتَ لِي مُحِبٌّ فَإِنِّي أَسْمَعُ السَّامِعِينَ أَسْتَجِيبُ لِلدَّاعِينَ إِذَا دَعَوْنِي ",
          "يَا عِيسَى خَفْنِي وَ خَوِّفْ بِي عِبَادِي لَعَلَّ الْمُذْنِبِينَ أَنْ يُمْسِكُوا عَمَّا هُمْ عَامِلُونَ بِهِ فَلَا يَهْلِكُوا إِلَّا وَ هُمْ يَعْلَمُونَ ",
          "يَا عِيسَى ارْهَبْنِي رَهْبَتَكَ مِنَ السَّبُعِ وَ الْمَوْتِ الَّذِي أَنْتَ لَاقِيهِ فَكُلُّ هَذَا أَنَا خَلَقْتُهُ فَإِيَّايَ فَارْهَبُونِ",
          "يَا عِيسَى إِنَّ الْمُلْكَ لِي وَ بِيَدِي وَ أَنَا الْمَلِكُ فَإِنْ تُطِعْنِي أَدْخَلْتُكَ جَنَّتِي فِي جِوَارِ الصَّالِحِينَ ",
          "يَا عِيسَى إِنِّي إِذَا غَضِبْتُ عَلَيْكَ لَمْ يَنْفَعْكَ رِضَا مَنْ رَضِيَ عَنْكَ وَ إِنْ رَضِيتُ عَنْكَ لَمْ يَضُرَّكَ غَضَبُ الْمُغْضَبِينَ",
          "يَا عِيسَى اذْكُرْنِي فِي نَفْسِكَ أَذْكُرْكَ فِي نَفْسِي وَ اذْكُرْنِي فِي مَلَئِكَ أَذْكُرْكَ فِي مَلَإٍ خَيْرٍ مِنْ مَلَإِ الْآدَمِيِّينَ ",
          "يَا عِيسَى ادْعُنِي دُعَاءَ الْغَرِيقِ الْحَزِينِ الَّذِي لَيْسَ لَهُ مُغِيثٌ ",
          "يَا عِيسَى لَا تَحْلِفْ بِي كَاذِباً فَيَهْتَزَّ عَرْشِي غَضَباً الدُّنْيَا قَصِيرَةُ الْعُمُرِ طَوِيلَةُ الْأَمَلِ وَ عِنْدِي دَارٌ خَيْرٌ مِمَّا تَجْمَعُونَ ",
          "يَا عِيسَى كَيْفَ أَنْتُمْ صَانِعُونَ إِذَا أَخْرَجْتُ لَكُمْ كِتَاباً يَنْطِقُ بِالْحَقِّ وَ أَنْتُمْ تَشْهَدُونَ بِسَرَائِرَ قَدْ كَتَمْتُمُوهَا وَ أَعْمَالٍ كُنْتُمْ بِهَا عَامِلِينَ ",
          "يَا عِيسَى قُلْ لِظَلَمَةِ بَنِي إِسْرَائِيلَ غَسَلْتُمْ وُجُوهَكُمْ وَ دَنَّسْتُمْ قُلُوبَكُمْ أَ بِي تَغْتَرُّونَ أَمْ عَلَيَّ تَجْتَرِءُونَ تَطَيَّبُونَ بِالطِّيبِ لِأَهْلِ الدُّنْيَا وَ أَجْوَافُكُمْ عِنْدِي بِمَنْزِلَةِ الْجِيَفِ الْمُنْتِنَةِ كَأَنَّكُمْ أَقْوَامٌ مَيِّتُونَ ",
          "يَا عِيسَى قُلْ لَهُمْ قَلِّمُوا أَظْفَارَكُمْ مِنْ كَسْبِ الْحَرَامِ وَ أَصِمُّوا أَسْمَاعَكُمْ عَنْ ذِكْرِ الْخَنَا وَ أَقْبِلُوا عَلَيَّ بِقُلُوبِكُمْ فَإِنِّي لَسْتُ أُرِيدُ صُوَرَكُمْ ",
          "يَا عِيسَى افْرَحْ بِالْحَسَنَةِ فَإِنَّهَا لِي رِضًا وَ ابْكِ عَلَى السَّيِّئَةِ فَإِنَّهَا شَيْنٌ وَ مَا لَا تُحِبُّ أَنْ يُصْنَعَ بِكَ فَلَا تَصْنَعْهُ بِغَيْرِكَ وَ إِنْ لَطَمَ خَدَّكَ الْأَيْمَنَ فَأَعْطِهِ الْأَيْسَرَ وَ تَقَرَّبْ إِلَيَّ بِالْمَوَدَّةِ جُهْدَكَ وَ أَعْرِضْ عَنِ الْجَاهِلِينَ ",
          "يَا عِيسَى ذِلَّ لِأَهْلِ الْحَسَنَةِ وَ شَارِكْهُمْ فِيهَا وَ كُنْ عَلَيْهِمْ شَهِيداً وَ قُلْ لِظَلَمَةِ بَنِي إِسْرَائِيلَ يَا أَخْدَانَ السَّوْءِ وَ الْجُلَسَاءَ عَلَيْهِ إِنْ لَمْ تَنْتَهُوا أَمْسَخْكُمْ قِرَدَةً وَ خَنَازِيرَ ",
          "يَا عِيسَى قُلْ لِظَلَمَةِ بَنِي إِسْرَائِيلَ الْحِكْمَةُ تَبْكِي فَرَقاً مِنِّي وَ أَنْتُمْ بِالضَّحِكِ تَهْجُرُونَ أَتَتْكُمْ بَرَاءَتِي أَمْ لَدَيْكُمْ أَمَانٌ مِنْ عَذَابِي أَمْ تَعَرَّضُونَ لِعُقُوبَتِي فَبِي حَلَفْتُ لَأَتْرُكَنَّكُمْ مَثَلًا لِلْغَابِرِينَ ",
          "ثُمَّ أُوصِيكَ يَا ابْنَ مَرْيَمَ الْبِكْرِ الْبَتُولِ بِسَيِّدِ الْمُرْسَلِينَ وَ حَبِيبِي فَهُوَ أَحْمَدُ صَاحِبُ الْجَمَلِ الْأَحْمَرِ وَ الْوَجْهِ الْأَقْمَرِ الْمُشْرِقِ بِالنُّورِ الطَّاهِرِ الْقَلْبِ الشَّدِيدِ الْبَأْسِ الْحَيِيِّ الْمُتَكَرِّمِ فَإِنَّهُ رَحْمَةٌ لِلْعَالَمِينَ وَ سَيِّدُ وُلْدِ آدَمَ يَوْمَ يَلْقَانِي أَكْرَمُ السَّابِقِينَ عَلَيَّ وَ أَقْرَبُ الْمُرْسَلِينَ مِنِّي الْعَرَبِيُّ الْأَمِينُ الدَّيَّانُ بِدِينِي الصَّابِرُ فِي ذَاتِي الْمُجَاهِدُ الْمُشْرِكِينَ بِيَدِهِ عَنْ دِينِي أَنْ تُخْبِرَ بِهِ بَنِي إِسْرَائِيلَ وَ تَأْمُرَهُمْ أَنْ يُصَدِّقُوا بِهِ وَ أَنْ يُؤْمِنُوا بِهِ وَ أَنْ يَتَّبِعُوهُ وَ أَنْ يَنْصُرُوهُ ",
          "قَالَ عِيسَى (عليه السلام) إِلَهِي مَنْ هُوَ حَتَّى أُرْضِيَهُ فَلَكَ الرِّضَا قَالَ هُوَ مُحَمَّدٌ رَسُولُ اللَّهِ إِلَى النَّاسِ كَافَّةً أَقْرَبُهُمْ مِنِّي مَنْزِلَةً وَ أَحْضَرُهُمْ شَفَاعَةً طُوبَى لَهُ مِنْ نَبِيٍّ وَ طُوبَى لِأُمَّتِهِ إِنْ هُمْ لَقُونِي عَلَى سَبِيلِهِ يَحْمَدُهُ أَهْلُ الْأَرْضِ وَ يَسْتَغْفِرُ لَهُ أَهْلُ السَّمَاءِ أَمِينٌ مَيْمُونٌ طَيِّبٌ مُطَيَّبٌ خَيْرُ الْبَاقِينَ عِنْدِي يَكُونُ فِي آخِرِ الزَّمَانِ إِذَا خَرَجَ أَرْخَتِ السَّمَاءُ عَزَالِيَهَا وَ أَخْرَجَتِ الْأَرْضُ زَهْرَتَهَا حَتَّى يَرَوُا الْبَرَكَةَ وَ أُبَارِكُ لَهُمْ فِيمَا وَضَعَ يَدَهُ عَلَيْهِ كَثِيرُ الْأَزْوَاجِ قَلِيلُ الْأَوْلَادِ يَسْكُنُ بَكَّةَ مَوْضِعَ أَسَاسِ إِبْرَاهِيمَ ",
          "يَا عِيسَى دِينُهُ الْحَنِيفِيَّةُ وَ قِبْلَتُهُ يَمَانِيَّةٌ وَ هُوَ مِنْ حِزْبِي وَ أَنَا مَعَهُ فَطُوبَى لَهُ ثُمَّ طُوبَى لَهُ لَهُ الْكَوْثَرُ وَ الْمَقَامُ الْأَكْبَرُ فِي جَنَّاتِ عَدْنٍ يَعِيشُ أَكْرَمَ مَنْ عَاشَ وَ يُقْبَضُ شَهِيداً لَهُ حَوْضٌ أَكْبَرُ مِنْ بَكَّةَ إِلَى مَطْلَعِ الشَّمْسِ مِنْ رَحِيقٍ مَخْتُومٍ فِيهِ آنِيَةٌ مِثْلُ نُجُومِ السَّمَاءِ وَ أَكْوَابٌ مِثْلُ مَدَرِ الْأَرْضِ عَذْبٍ فِيهِ مِنْ كُلِّ شَرَابٍ وَ طَعْمِ كُلِّ ثِمَارٍ فِي الْجَنَّةِ مَنْ شَرِبَ مِنْهُ شَرْبَةً لَمْ يَظْمَأْ أَبَداً وَ ذَلِكَ مِنْ قَسْمِي لَهُ وَ تَفْضِيلِي إِيَّاهُ عَلَى فَتْرَةٍ بَيْنَكَ وَ بَيْنَهُ يُوَافِقُ سِرُّهُ عَلَانِيَتَهُ وَ قَوْلُهُ فِعْلَهُ لَا يَأْمُرُ النَّاسَ إِلَّا بِمَا يَبْدَأُهُمْ بِهِ",
          "دِينُهُ الْجِهَادُ فِي عُسْرٍ وَ يُسْرٍ تَنْقَادُ لَهُ الْبِلَادُ وَ يَخْضَعُ لَهُ صَاحِبُ الرُّومِ عَلَى دِينِ إِبْرَاهِيمَ يُسَمِّي عِنْدَ الطَّعَامِ وَ يُفْشِي السَّلَامَ وَ يُصَلِّي وَ النَّاسُ نِيَامٌ لَهُ كُلَّ يَوْمٍ خَمْسُ صَلَوَاتٍ مُتَوَالِيَاتٍ يُنَادِي إِلَى الصَّلَاةِ كَنِدَاءِ الْجَيْشِ بِالشِّعَارِ وَ يَفْتَتِحُ بِالتَّكْبِيرِ وَ يَخْتَتِمُ بِالتَّسْلِيمِ وَ يَصُفُّ قَدَمَيْهِ فِي الصَّلَاةِ كَمَا تَصُفُّ الْمَلَائِكَةُ أَقْدَامَهَا وَ يَخْشَعُ لِي قَلْبُهُ وَ رَأْسُهُ النُّورُ فِي صَدْرِهِ وَ الْحَقُّ عَلَى لِسَانِهِ وَ هُوَ عَلَى الْحَقِّ حَيْثُمَا كَانَ ",
          "أَصْلُهُ يَتِيمٌ ضَالٌّ بُرْهَةً مِنْ زَمَانِهِ عَمَّا يُرَادُ بِهِ تَنَامُ عَيْنَاهُ وَ لَا يَنَامُ قَلْبُهُ لَهُ الشَّفَاعَةُ وَ عَلَى أُمَّتِهِ تَقُومُ السَّاعَةُ وَ يَدِي فَوْقَ أَيْدِيهِمْ فَمَنْ نَكَثَ فَإِنَّمَا يَنْكُثُ عَلَى نَفْسِهِ وَ مَنْ أَوْفَى بِمَا عَاهَدَ عَلَيْهِ أَوْفَيْتُ لَهُ بِالْجَنَّةِ فَمُرْ ظَلَمَةَ بَنِي إِسْرَائِيلَ أَلَّا يَدْرُسُوا كُتُبَهُ وَ لَا يُحَرِّفُوا سُنَّتَهُ وَ أَنْ يُقْرِءُوهُ السَّلَامَ فَإِنَّ لَهُ فِي الْمَقَامِ شَأْناً مِنَ الشَّأْنِ ",
          "يَا عِيسَى كُلُّ مَا يُقَرِّبُكَ مِنِّي فَقَدْ دَلَلْتُكَ عَلَيْهِ وَ كُلُّ مَا يُبَاعِدُكَ مِنِّي فَقَدْ نَهَيْتُكَ عَنْهُ فَارْتَدْ لِنَفْسِكَ ",
          "يَا عِيسَى إِنَّ الدُّنْيَا حُلْوَةٌ وَ إِنَّمَا اسْتَعْمَلْتُكَ فِيهَا فَجَانِبْ مِنْهَا مَا حَذَّرْتُكَ وَ خُذْ مِنْهَا مَا أَعْطَيْتُكَ عَفْواً ",
          "يَا عِيسَى انْظُرْ فِي عَمَلِكَ نَظَرَ الْعَبْدِ الْمُذْنِبِ الْخَاطِئِ وَ لَا تَنْظُرْ فِي عَمَلِ غَيْرِكَ بِمَنْزِلَةِ الرَّبِّ كُنْ فِيهَا زَاهِداً وَ لَا تَرْغَبْ فِيهَا فَتَعْطَبَ ",
          "يَا عِيسَى اعْقِلْ وَ تَفَكَّرْ وَ انْظُرْ فِي نَوَاحِي الْأَرْضِ كَيْفَ كَانَ عَاقِبَةُ الظَّالِمِينَ ",
          "يَا عِيسَى كُلُّ وَصْفِي لَكَ نَصِيحَةٌ وَ كُلُّ قَوْلِي لَكَ حَقٌّ وَ أَنَا الْحَقُّ الْمُبِينُ فَحَقّاً أَقُولُ لَئِنْ أَنْتَ عَصَيْتَنِي بَعْدَ أَنْ أَنْبَأْتُكَ مَا لَكَ مِنْ دُونِي وَلِيٌّ وَ لَا نَصِيرٌ ",
          "يَا عِيسَى أَذِلَّ قَلْبَكَ بِالْخَشْيَةِ وَ انْظُرْ إِلَى مَنْ هُوَ أَسْفَلُ مِنْكَ وَ لَا تَنْظُرْ إِلَى مَنْ هُوَ فَوْقَكَ وَ اعْلَمْ أَنَّ رَأْسَ كُلِّ خَطِيئَةٍ وَ ذَنْبٍ هُوَ حُبُّ الدُّنْيَا فَلَا تُحِبَّهَا فَإِنِّي لَا أُحِبُّهَا ",
          "يَا عِيسَى أَطِبْ لِي قَلْبَكَ وَ أَكْثِرْ ذِكْرِي فِي الْخَلَوَاتِ وَ اعْلَمْ أَنَّ سُرُورِي أَنْ تُبَصْبِصَ إِلَيَّ كُنْ فِي ذَلِكَ حَيّاً وَ لَا تَكُنْ مَيِّتاً ",
          "يَا عِيسَى لَا تُشْرِكْ بِي شَيْئاً وَ كُنْ مِنِّي عَلَى حَذَرٍ وَ لَا تَغْتَرَّ بِالصِّحَّةِ وَ تُغَبِّطْ نَفْسَكَ فَإِنَّ الدُّنْيَا كَفَيْ‏ءٍ زَائِلٍ وَ مَا أَقْبَلَ مِنْهَا كَمَا أَدْبَرَ فَنَافِسْ فِي الصَّالِحَاتِ جُهْدَكَ وَ كُنْ مَعَ الْحَقِّ حَيْثُمَا كَانَ وَ إِنْ قُطِعْتَ وَ أُحْرِقْتَ بِالنَّارِ فَلَا تَكْفُرْ بِي بَعْدَ الْمَعْرِفَةِ فَلَا تَكُونَنَّ مِنَ الْجَاهِلِينَ فَإِنَّ الشَّيْ‏ءَ يَكُونُ مَعَ الشَّيْ‏ءِ ",
          "يَا عِيسَى صُبَّ لِيَ الدُّمُوعَ مِنْ عَيْنَيْكَ وَ اخْشَعْ لِي بِقَلْبِكَ ",
          "يَا عِيسَى اسْتَغِثْ بِي فِي حَالَاتِ الشِّدَّةِ فَإِنِّي أُغِيثُ الْمَكْرُوبِينَ وَ أُجِيبُ الْمُضْطَرِّينَ وَ أَنَا أَرْحَمُ الرَّاحِمِينَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473219\">H 14551</a> – Ali Bin Ibrahim, from his father, from Ali Bin Asbaat, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-t\">T</span>he Imam</span><sup>asws</sup> having said: ‘Among the Advice which Allah<sup>azwj</sup> Gave to Isa<sup>as</sup> was: “O Isa<sup>as</sup>! I<sup>azwj</sup> am your<sup>as</sup> Lord<sup>azwj</sup>, and the Lord<sup>azwj</sup> of your<sup>as</sup> forefathers. My<sup>azwj</sup> Name is ‘وَاحِدٌ’ the One, and I<sup>azwj</sup> am the ‘الْأَحَدُ’ the One, which cannot be divided, the Lone One Who<sup>azwj</sup> Created everything, and everything is Made by My<sup>azwj</sup> and everything Returns to Me<sup>azwj</sup>.",
            "O Isa<sup>as</sup>! You<sup>as</sup> are the Messiah by My<sup>azwj</sup> Command, and you<sup>as</sup> create from the clay something like the bird (but) by My<sup>azwj</sup> Permission, and you<sup>as</sup> revive the dead by My<sup>azwj</sup> Speech, so become attentive towards Me<sup>azwj</sup> and be a ‘رَاهِباً’ fully devote yourself to Me<sup>azwj</sup>, and you<sup>as</sup> will never find a refuge except with Me<sup>azwj</sup>.",
            "O Isa<sup>as</sup>! I<sup>azwj</sup> Bequeath to you<sup>as</sup> a Compassionate Command with the Mercy until the Wilayah is Ordained from Me<sup>azwj</sup> and there comes Pleasure from Me<sup>azwj</sup>. You<sup>as</sup> are blessed as a grown up and blessed as a child whereby you<sup>as</sup> testified that you<sup>as</sup> are My<sup>azwj</sup> servant, the son<sup>as</sup> of My<sup>azwj</sup> maidservant (Maryam<sup>as</sup>). Make room for Me<sup>azwj</sup> in yourself<sup>as</sup> like your<sup>as</sup> concerns, and make My<sup>azwj</sup> Remembrance to be for your<sup>as</sup> return, and come near to Me<sup>azwj</sup> by the optional (Prayers), and place reliance upon Me<sup>azwj</sup> for I<sup>azwj</sup> will Suffice for you<sup>as</sup>, and do not rely upon the others for I<sup>azwj</sup> shall Abandon you<sup>as</sup>. ",
            "O Isa<sup>as</sup>! Observe patience upon the afflictions and be pleased with the Destiny, and become like My<sup>azwj</sup> Happiness in you<sup>as</sup>, for if My<sup>azwj</sup> Happiness is what makes you<sup>as</sup> happy, you<sup>as</sup> will be obedient and will not disobey.",
            "O Isa<sup>as</sup>! Revive My<sup>azwj</sup> Remembrance by your<sup>as</sup> tongue, and make My<sup>azwj</sup> cordiality to be in your<sup>as</sup> heart.",
            "O Isa<sup>as</sup>! Be vigilant in the hours of neglect and consider Me<sup>azwj</sup> of Kind Wisdom.",
            "O Isa<sup>as</sup>! Be attentive, a Devotee, and prepare your<sup>as</sup> heart to fear (Me<sup>azwj</sup>).",
            "O Isa<sup>as</sup>! Be a shepherd of the night to search for My<sup>azwj</sup> Happiness, and Magnify Me<sup>azwj</sup> in your<sup>as</sup> daytime for asking for your<sup>as</sup> need from Me<sup>saww</sup>.",
            "O Isa<sup>as</sup>! Compete with regards to the good with your<sup>as</sup> striving; you<sup>as</sup> will be known by the good wherever you<sup>as</sup> may turn to.",
            "O Isa<sup>as</sup>! Judge among My<sup>azwj</sup> servants by My<sup>azwj</sup> Advice, and stand among them with My<sup>azwj</sup> Justice, for I<sup>azwj</sup> have Made to Descend upon you<sup>as</sup> a healing for what is in the chests from the diseases of the Satan<sup>la</sup>.",
            "O Isa<sup>as</sup>! Do not be seated with the intrigued (hypocrites). ",
            "O Isa<sup>as</sup>! Truly I<sup>azwj</sup> Say that no creature believed in Me<sup>azwj</sup> except that he was humble to Me<sup>azwj</sup>, and did not humble himself to Me<sup>azwj</sup> except that he hoped for My<sup>azwj</sup> Reward. Be a witness that he is safe from My<sup>azwj</sup> Punishment, (that will be) the one who did not change or replace My<sup>azwj</sup> Sunnah.",
            "O Isa<sup>as</sup>, the first son<sup>as</sup> of the chaste virgin, weep for your<sup>as</sup> self with a weeping like the one who says farewell to his family, and hate the world and leave it to its people, and become interested in what is in the Presence of your<sup>as</sup> God.",
            "O Isa<sup>as</sup>! Be along with that as a soft-spoken person, and offers greetings and be vigilant when the eyes of the righteous go to sleep. Be cautious of the Return and the severe earthquakes and the sensations of the Day of Judgement when neither the family, not the sons, nor the wealth would be of any benefit.",
            "O Isa<sup>as</sup>! Apply the Kohl of grief in your<sup>as</sup> eyes whilst the people of falsehood laugh.",
            "O Isa<sup>as</sup>! Become humble and patient, for <span class=\"iTxt\">Tooba</span> is for you<sup>as</sup> if you<sup>as</sup> achieve what has been Prepared for the patient ones.",
            "O Isa<sup>as</sup>! Go from the world day by day, and taste the food from which its taste is less indulging. So I<sup>azwj</sup> Truly Say, you<sup>as</sup> are not with anything except for your<sup>as</sup> hour and your<sup>as</sup> day, so go from the world with provision, and let the rough (clothes) and less tempting (food) suffice for you<sup>as</sup> for you<sup>as</sup> have seen what becomes of it, and whatever you<sup>as</sup> take is written down, and how you<sup>as</sup> have consumed it.",
            "O Isa<sup>as</sup>! You<sup>as</sup> will be questioned, so be merciful to the weak just like My<sup>azwj</sup> Mercy towards you<sup>as</sup>, and do not subdue the orphan.",
            "O Isa<sup>as</sup>! You<sup>as</sup> weep over yourself<sup>as</sup> in private, move your<sup>as</sup> feet to the timings of the Prayer, and let Me<sup>azwj</sup> Hear your<sup>as</sup> sweet speech of My<sup>az</sup><sup>wj</sup> remembrance, for My<sup>azwj</sup> Favour to you<sup>as</sup> is good.",
            "O Isa<sup>as</sup>! How many from the community I<sup>azwj</sup> have Destroyed for their previous sins which I<sup>azwj</sup> have Protected you<sup>as</sup> from it. ",
            "O Isa<sup>as</sup>! Be kind to the weak ones and raise your tired eye towards the sky and call upon Me<sup>azwj</sup> for I<sup>azwj</sup> am Near to you<sup>as</sup> and do not Pray to Me<sup>azwj</sup> except by Supplicating to Me<sup>azwj</sup> for your<sup>as</sup> concern is one concern, for when you<sup>as</sup> call upon Me<sup>azwj</sup> in such a manner, I<sup>azwj</sup> will Answer you<sup>as</sup>.  ",
            "O Isa<sup>as</sup>, I<sup>azwj</sup> was not Pleased with Presenting the world as a Reward for the ones who were before you<sup>as</sup>, nor as a Punishment for the ones I<sup>azwj</sup> Want to Retaliate against.  ",
            "O Isa<sup>as</sup>! You<sup>as</sup> are to die and I<sup>azwj</sup> shall Remain, and from Me<sup>azwj</sup> is your<sup>as</sup> sustenance, and with Me<sup>azwj</sup> is your<sup>as</sup> fixed term and to Me<sup>azwj</sup> is your<sup>as</sup> eventual return, and to Me<sup>azwj</sup> is your<sup>as</sup> Accounting, so ask Me<sup>azwj</sup> and do not ask someone else, for the best from you<sup>as</sup> is the supplication, and from Me<sup>azwj</sup> is the Answering of it.",
            "O Isa<sup>as</sup>! How numerous are the human beings and how little are, in numbers, the patient ones. The trees are many but the good ones of it are few. So do not be deceived by the beauty of the tree until you have tasted its fruit.",
            "O Isa<sup>as</sup>! Do not be deceived by the rebellious one by disobeying My (Commands), I<sup>azwj</sup> Provide sustenance so (don’t) worship someone else, then he calls upon Me<sup>azwj</sup> during hardships, so I<sup>azwj</sup> Answer him. Then he returns to what he used to be in, rebelling against Me<sup>azwj</sup> exposing himself to My<sup>azwj</sup> Anger. I<sup>azwj</sup> Swear by Myself<sup>azwj</sup> that I<sup>azwj</sup> shall Grab him with such a Grip that there will be no salvation for him from it, and no refuge apart from Me<sup>azwj</sup>. Where will he run from My<sup>azwj</sup> skies and from My<sup>azwj</sup> earth?",
            "O Isa<sup>as</sup>! Say to the unjust ones from the Children of Israel not to supplicate to Me<sup>azwj</sup> whilst the illegal earnings is under their hearts (into their stomach), and the idols are in their houses, for I<sup>azwj</sup> have Undertaken that I<sup>azwj</sup> shall Answer to the one who supplicates to Me<sup>azwj</sup>, and Make My<sup>azwj</sup> Answer to be a Curse upon them (who disobey) until they disperse.",
            "O Isa<sup>as</sup>! How many times have I<sup>azwj</sup> Given them lengthy Consideration, and goodness of the seeking, but the people are in neglect and they will not return. The words come out from their mouths but their hearts are not with it. They expose themselves to My<sup>azwj</sup> Abhorrence and seek nearness to the Believers by display their love for Me<sup>azwj</sup> (showing hypocrisy) ",
            "O Isa<sup>as</sup>! Make your<sup>as</sup> tongue to be one, be it in secret or in the open, and do that similarly with your<sup>as</sup> heart and your<sup>as</sup> vision. And turn your<sup>as</sup> heart and your<sup>as</sup> vision away from the Prohibited and restrain your<sup>as</sup> vision from that which has no benefit. So how many glances of the looker have planted lust in his heart, and returned him by it to the fountains of destruction. ",
            "O Isa<sup>as</sup>! Be merciful and compassionate, and be as you<sup>as</sup> would like the people to be towards you<sup>as</sup>. And frequently remember the death, and the separation of the families. And do not play for its amusements (as it) spoils the player. And do not be neglectful one for the neglectful is far from Me<sup>azwj</sup>. And Remember Me<sup>azwj</sup> by the righteous deeds so that I<sup>azwj</sup> speak of you<sup>as</sup>.",
            "O Isa<sup>as</sup>! Repent and return to Me<sup>azwj</sup> after the sins, and Mention Me<sup>azwj</sup> by the penitence, and believe in Me<sup>azwj</sup>, and come closer to the Believers by Me<sup>azwj</sup>, and urge them to supplicate to me<sup>azwj</sup> along with you<sup>as</sup>. And beware of the supplication of the oppressed for I<sup>azwj</sup> have Undertaken upon Myself<sup>azwj</sup> that I<sup>azwj</sup> shall Open for it the Doors of the sky by the Acceptance, and Answer him even though it may be after a while. ",
            "O Isa<sup>as</sup>! Know that the evil one infects, and the evil friend destroys. And know the one whom you<sup>as</sup> befriend and chose as a brother for yourself<sup>as</sup> from the Believers.  ",
            "O Isa<sup>as</sup>! Repent to Me<sup>azwj</sup> as there is no grand sin that I<sup>azwj</sup> do not Forgive it, and I<sup>azwj</sup> am the Most Merciful of the merciful ones. Work for yourself<sup>as</sup> in the time allocated from your<sup>as</sup> term before someone else works for it, and worship Me<sup>azwj</sup> for a day which will be like a thousand years of your counting, during which I<sup>azwj</sup> will Reward the good deeds by increasing them, and that the sins would remain with their doers. Prepare for yourself<sup>as</sup> in the allocated time, and compete in the good deeds, for how many a gathering has dispersed and its people being each other’s neighbours in the Fire.",
            "O Isa<sup>as</sup>! Abstain with regards to the mortal, that which will be cut-off, of the houses of the ones who were before you<sup>as</sup>, so call them and whisper to them. Do you<sup>as</sup> feel that any one of them would take your<sup>as</sup> advice? And know, that you<sup>as</sup> will be joining them among the joining ones’. ",
            "O Isa<sup>as</sup>! Say to the one who has rebelled against Me<sup>azwj</sup> by disobedience and works in opposition, to expect My<sup>azwj</sup> Punishment and await My<sup>azwj</sup> Destruction upon him, so he will be joined with the Destroyed ones.",
            "<span class=\"iTxt\">Tooba </span>is for you<sup>as</sup>, O son<sup>as</sup> of Maryam<sup>as</sup>. Then Tooba is for you<sup>as</sup> if you<sup>as</sup> were to take to the discipline of your<sup>as</sup> God Who is Compassionate towards you<sup>as</sup> and Merciful, and Begin with the Favours to you<sup>as</sup> from Him<sup>azwj</sup> for Honour, as He<sup>azwj</sup> was for you<sup>as</sup> in the difficulties, and you<sup>as</sup> did not disobey Him<sup>azwj</sup>.",
            "O Isa<sup>as</sup>! It is not Permissible for you<sup>as</sup> to disobey Him<sup>azwj</sup> Who has Advised you<sup>asws</sup> just as He<sup>azwj</sup> had Advised the ones who were before you<sup>as</sup>, and I<sup>azwj</sup> am a Witness over that.",
            "O Isa<sup>as</sup>! I<sup>azwj</sup> have not Honoured any creature with the like of My<sup>azwj</sup> Religion, nor a Favour to him like My<sup>azwj</sup> Mercy.",
            "O Isa<sup>as</sup>! Wash with the water from you, what is apparent and heal with the goodness from you<sup>as</sup> what is hidden, for you<sup>as</sup> will be returning to Me<sup>azwj</sup>.",
            "O Isa<sup>as</sup>! I<sup>azwj</sup> Gave to you<sup>as</sup> what I<sup>azwj</sup> had Favoured you<sup>as</sup> with an uninterrupted flow, and Sought from you<sup>as</sup> a loan for yourself<sup>as</sup>, so if you<sup>as</sup> were to be niggardly with regards to it you<sup>as</sup> would become of the Destroyed ones. ",
            "O Isa<sup>as</sup>! Adorn yourself<sup>as</sup> with the Religion and love the poor, and walk upon the earth in humility, and Pray upon the remainder, for all of it is clean. ",
            "O Isa<sup>as</sup>! Roll up (your<sup>as</sup> affairs) for all that comes, is close by, and read My<sup>azwj</sup> Book whilst you<sup>as</sup> are clean, make Me<sup>azwj</sup> Listen to a voice from you<sup>as</sup> full of grief. ",
            "O Isa<sup>as</sup>! There is no good in enjoyment which does not last and the life of the enjoyer is in decline.",
            "O son<sup>as</sup> of Maryam<sup>as</sup>! If you<sup>as</sup> were to see what I<sup>azwj</sup> have Prepared for My<sup>azwj</sup> righteous friends, your<sup>as</sup> heart would melt, and your<sup>as</sup> soul would come out (of your<sup>as</sup> body) in desire for it. So there is no house like the House of the Hereafter in which the neighbours are good people, and the Angels of Proximity come up to them, and they would be from the ones who would come on the Day of Judgement being safe from its horrors. A House in which, there is no change in the Bliss, nor are its inhabitants in decline. ",
            "O son<sup>as</sup> of Maryam<sup>as</sup>! Compete with regards to it (the House in the Hereafter) along with the competitors, for it is the desire of the desirous ones, of good scenery.",
            "<span class=\"iTxt\">Tooba</span> is for you, O son<sup>as</sup> of Maryam<sup>as</sup> , if you<sup>as</sup> are from the workers for it, along with your<sup>as</sup> forefathers Adam<sup>as</sup>, and Ibrahim<sup>as</sup>, being in the Gardens and Bliss, not seeking a substitution for it nor a transfer from it. That is how I<sup>azwj</sup> Deal with the pious ones. ",
            "O Isa<sup>as</sup>! Flee to Me<sup>azwj</sup> like those who flee from the flaming Fire, and the Fire with chains and fetters. No soul would enter it and its grief would leave from him ever. It is a part like the part of the dark night. Those who are rescued from it would be successful, and those who do not get Rescued from it would be of the Destroyed ones. This is the House of the tyrants, and hardened oppressors, and every harsh, rude one, and every arrogant boaster. ",
            "O Isa<sup>as</sup>! It is the evil house for the ones in its corner, and the evil dwelling for the unjust ones. I<sup>azwj</sup> Caution you<sup>as</sup>, so that you<sup>as</sup> would be informed about it. ",
            "O Isa<sup>as</sup>! Beware you<sup>as</sup> can be an observer for Me<sup>azwj</sup>, and testify that I<sup>azwj</sup> have Created you<sup>as</sup>, and you<sup>as</sup> are My<sup>azwj</sup> servant, and I<sup>azwj</sup> Shaped you<sup>as</sup>, and sent you<sup>as</sup> down to the earth. ",
            "O Isa<sup>as</sup>! It is not correct for two tongues to be in one mouth, not for two hearts to be in one chest, similarly for the minds. ",
            "O Isa<sup>as</sup>! Do not wake up as a disobedient one, nor indulge in vanities whilst awake, and turn yourself<sup>as</sup> away from the lusts and the sins, and every desire which distances you<sup>as</sup> from Me<sup>azwj</sup>. So migrate from it, and know that you<sup>as</sup> are from Me<sup>azwj</sup> at the status of the trustworthy Rasool<sup>as</sup>, so be cautious with regards to Me<sup>azwj</sup>, and know that your<sup>as</sup> world will deliver you<sup>as</sup> to Me<sup>azwj</sup>, and I<sup>azwj</sup> will Grab you<sup>as</sup> with My<sup>azwj</sup> Knowledge. So become a humble soul during My<sup>azwj</sup> Remembrance, with a revering heart when you<sup>as</sup> Mention Me<sup>azwj</sup>, being fully aware whilst the neglectful ones sleep. ",
            "O Isa<sup>as</sup>! This is My<sup>azwj</sup> Advice to you<sup>as</sup> and My<sup>azwj</sup> Preaching to you<sup>as</sup>, so take it from Me<sup>azwj</sup>, and I<sup>azwj</sup> am the Lord<sup>azwj</sup> of the worlds. ",
            "O Isa<sup>as</sup>! If My<sup>azwj</sup> servant is patient with Me<sup>azwj</sup>, his Rewards for his deeds are upon Me<sup>azwj</sup>, and it was upon him to supplicate to Me<sup>azwj</sup>, and I<sup>azwj</sup> am Sufficient to Take Revenge from the ones who are disobedient to Me<sup>azwj</sup>. Where will the unjust runaway to, from Me<sup>azwj</sup>?  ",
            "O Isa<sup>as</sup>! Speak good words wherever you<sup>as</sup> may be, for I<sup>azwj</sup> am a Knowledgeable Teacher. ",
            "O Isa<sup>as</sup>! Bestow the good deeds towards Me<sup>azwj</sup> until it is Mentioned in My<sup>azwj</sup> Presence, and take to My<sup>azwj</sup> Advice, for there is a healing for the hearts therein. ",
            "O Isa<sup>as</sup>! Do not hesitate when you<sup>as</sup> plan from My<sup>azwj</sup> Plan, and do not forget My<sup>azwj</sup> Remembrance in the privacy of the world.",
            "O Isa<sup>as</sup>! Take account of yourself<sup>as</sup> by referring to Me<sup>azwj</sup> until I<sup>azwj</sup> Accomplish the Rewards for what the workers have worked for. Those are the ones who will be getting their Recompense, and I<sup>azwj</sup> am the Best of the Givers. ",
            "O Isa<sup>as</sup>! You<sup>as</sup> were Created by My<sup>az</sup><sup>wj</sup> Word, and Maryam<sup>as</sup> gave birth to you <sup>as</sup> by My<sup>azwj</sup> Command, the Message sent to her<sup>as</sup> by My<sup>azwj</sup> Spirit Jibraeel the Trustworthy one from My<sup>azwj</sup> Angels, until you<sup>as</sup> stood upon the earth alive and walking. All that had been encompassed by My<sup>azwj</sup> Knowledge.",
            "O Isa<sup>as</sup>! Zakariyya<sup>as</sup> is at the status of your<sup>as</sup> father, and is the guardian of your<sup>as</sup> mother<sup>as</sup>. When he<sup>as</sup> came up to her<sup>as</sup> in the Niche (Al-Mihraab) he<sup>as</sup> found sustenance in her<sup>as</sup> presence. And your<sup>as</sup> counterpart Yahya<sup>as</sup> (John) is from My<sup>azwj</sup> creatures, and I<sup>azwj</sup> Gifted him<sup>as</sup> to his<sup>as</sup> mother after the old age had set in, and she had no strength to her. I<sup>azwj</sup> Intended by that to Display to her My<sup>azwj</sup> Authority, and Display with regards to you<sup>as</sup>, My<sup>azwj</sup> Power. The most Beloved of you all, to Me<sup>azwj</sup> is the one who is most obedient to Me<sup>azwj</sup>, and the most intense in his fear from Me<sup>azwj</sup>.",
            "O Isa<sup>as</sup>! Be vigilant and do not despair from My<sup>azwj</sup> Spirit, and Glorify Me<sup>azwj</sup> along with the ones who Glorify Me<sup>azwj</sup>, and with the good speech Extol My<sup>azwj</sup> Holiness.",
            "O Isa<sup>as</sup>! How can the servants disbelieve in Me<sup>azwj</sup> whilst their forelocks are in My<sup>azwj</sup> Grip, and their going about in My<sup>azwj</sup> land while being ignorant of My<sup>azwj</sup> Favours, and their befriending of My<sup>azwj</sup> enemies, and that is how the infidels are (destined for) Destruction.",
            "O Isa<sup>as</sup>! The world is a prison with the rotten smell, and there is beauty in it from what has been seen by the tyrants who slaughter each other for it. And beware of the world, for every bounty of it is subject to decline, and there is no bounty in it except for a little. ",
            "O Isa<sup>as</sup>! Reach for Me<sup>azwj</sup> near your<sup>as</sup> pillow and you<sup>as</sup> will find Me<sup>azwj</sup>, and call upon Me<sup>azwj</sup> and you<sup>as</sup> are Beloved unto Me<sup>azwj</sup>, for I<sup>az</sup><sup>wj</sup> am the most Hearing of the listening. I<sup>azwj</sup> shall Answer the supplicant when one supplicates to Me<sup>azwj</sup>. ",
            "O Isa<sup>as</sup>! Fear Me<sup>azwj</sup> and get My<sup>azwj</sup> servants to fear Me<sup>azwj</sup> perhaps the sinners would abstain from what they are working in, so no one would be destroyed except that they would be aware (of it).",
            "O Isa<sup>as</sup>! Be in awe of Me<sup>azwj</sup> as you<sup>as</sup> are awed by the (fearful) beasts, and the death which you<sup>as</sup> are going to meet up with, for all these things, I<sup>azwj</sup> Created them, so it is Me<sup>azwj</sup> they should be Awed of.",
            "O Isa<sup>as</sup>! The Kingdom is Mine<sup>azwj</sup> and in My<sup>azwj</sup> Hands, and I<sup>azwj</sup> am the King, so if you<sup>as</sup> were to obey Me<sup>azwj</sup>, I<sup>azwj</sup> shall Make you<sup>as</sup> to Enter My<sup>azwj</sup> Paradise among the neighbourhood of the righteous ones. ",
            "O Isa<sup>as</sup>! If I<sup>azwj</sup> am Angry with you<sup>as</sup>, the happiness of those who are happy with you<sup>as</sup> would be of no benefit to you<sup>as</sup>, and if I<sup>azwj</sup> am Pleased with you<sup>as</sup>, the anger of the angry ones would not adversely affect you<sup>as</sup>.",
            "O Isa<sup>as</sup>! Remember me<sup>azwj</sup> in your<sup>as</sup> soul, I<sup>azwj</sup> will Remember you<sup>as</sup> Myself<sup>azwj</sup>, and Mention Me<sup>azwj</sup> among your<sup>as</sup> people and I<sup>azwj</sup> will Mention you<sup>as</sup> among My<sup>azwj</sup> Gathering which is better than the gathering of the human beings.",
            "O Isa<sup>as</sup>! Supplicate to Me<sup>azwj</sup> by the supplication of the drowning one (Al-Ghareek), the grieving one for whom there is no helper (except Me<sup>azwj</sup>). ",
            "O Isa<sup>as</sup>! Do not swear falsely by Me<sup>azwj</sup>, for (that) My<sup>azwj</sup> Throne Trembles in Anger. The world has a short life span, but there are long yearnings therein, whilst in My<sup>azwj</sup> Possession is a better House from what you<sup>as</sup> accumulate. ",
            "O Isa<sup>as</sup>! How will you<sup>as</sup> react when I<sup>azwj</sup> Bring out a Book for you<sup>as</sup> which Speaks with the Truth, and you will all testify to the secrets that you have been concealing, and the deeds which you had been performing. ",
            "O Isa<sup>as</sup>! Say to the unjust ones of the Children of Israel: ‘You have washed your faces, and left your hearts as filthy. Are you trying to deceive Me<sup>azwj</sup> with a deception, or are you being audacious against Me<sup>azwj</sup>? You are applying fragrance for the people of the world whilst your inner selves are in My<sup>azwj</sup> Presence at the status of the rotten carcass, as if you are a dead people’. ",
            "O Isa<sup>as</sup>! Say to them: ‘Trim your fingernails (cut yourselves off) from unlawful gains, and deafen your ears from the indecent speech, and turn towards Me<sup>azwj</sup> by your hearts, for I<sup>azwj</sup> do not Want (Fond of) your appearances.",
            "O Isa<sup>as</sup>! Be happy with the good deeds for therein lies My<sup>azwj</sup> Pleasure, and weep over the sins for it is a disgrace. And do not carry forward to others what you<sup>as</sup> do not like them to do unto you<sup>as</sup>, and if your<sup>as</sup> right cheek is slapped then give him the left one. And come closer to Me<sup>azwj</sup> by the cordiality and your<sup>as</sup> striving, and keep away from the ignorant ones. ",
            "O Isa<sup>as</sup>! Be humble to the people of good deeds and participate with them in it, and be a witness upon them and say to the unjust ones of the Children of Israel: ‘O evil companions who are seated upon it, if you do not desist, I<sup>azwj</sup> will metamorphose you into monkeys and pigs.",
            "O Isa<sup>as</sup>! Say to the unjust ones of the Children of Israel: ‘The Wisdom weeps after being made to separate from Me<sup>azwj</sup>, and you are laughing by fleeing away from me. Has there come to you My<sup>azwj</sup> Disavowing, or have you found security from My<sup>azwj</sup> Punishment, or are you exposing yourselves to My<sup>azwj</sup> Punishment? I<sup>azwj</sup> Swear by Myself<sup>azwj</sup> that I<sup>azwj</sup> will Abandon you to be an example for the coming generations to learn a lesson from.  ",
            "Then I<sup>azwj</sup> Advise you<sup>as</sup>, O son<sup>as</sup> of Maryam<sup>as</sup> the chaste virgin, of the (coming of) the Chief of the Rasools<sup>as</sup>, and My<sup>azwj</sup> Beloved, so he<sup>saww</sup> is Ahmad<sup>saww</sup>, the owner of the red camel, with a face illuminated with the light as bright as the full moon, and the one pure of the heart, and intensely valiant, the prestigious, for he<sup>saww</sup> is the Mercy to the Worlds, and the Chief of the children of Adam<sup>as</sup> on the Day that he<sup>saww</sup> will meet Me<sup>azwj</sup>. The most honourable of the former ones to Me<sup>azwj</sup>, and the nearest one to Me<sup>azwj</sup> from the Rasools<sup>as</sup>, the Arab, the trustworthy, the embodiment of My<sup>azwj</sup> Religion, the patient one in struggling against the Polytheists by his<sup>saww</sup> own self and hands for the sake of My<sup>azwj</sup> Religion. And inform the Children of Israel about him<sup>saww</sup>, and command them that they should ratify him<sup>saww</sup>, and believe in him<sup>saww</sup>, and follow him<sup>saww</sup>, and help him<sup>saww</sup>”. ",
            "Isa<sup>as</sup> said: ‘My<sup>as</sup> God! Who is he<sup>saww</sup> that if I<sup>as</sup> were to please him<sup>saww</sup> it would Please You<sup>azwj</sup>?’ He<sup>azwj</sup> Said: “He<sup>saww</sup> is Muhammad<sup>saww</sup>, the Rasool Allah<sup>saww</sup> to all of the people. He<sup>saww</sup> is the closest to Me<sup>azwj</sup> in status, and the presenter for the intercession. <span class=\"iTxt\">Tooba</span> is for him<sup>saww</sup> from the Prophets<sup>as</sup> and <span class=\"iTxt\">Tooba</span> for his<sup>saww</sup> community who will meet Me<sup>azwj</sup> whilst being upon his<sup>saww</sup> way. The inhabitants of the earth praise him<sup>saww</sup>, and the inhabitants of the sky seek Forgiveness through him<sup>saww</sup>. ",
            "The trustworthy, the Entrusted one, the good, the blessed, the best of the remaining ones in My<sup>azwj</sup> Presence who will be in the end of times. When he<sup>saww</sup> comes out, the sky will loosen its rainfall and the earth will bring out its blossoms until they will see the Blessings, and I<sup>azwj</sup> will Bless for him<sup>saww</sup> whatever that he<sup>saww</sup> places his<sup>saww</sup> hand upon, one with many wives and few children. He<sup>saww</sup> will live at Bekka (Makkah), the place of foundation of Ibrahim<sup>as</sup>. ",
            "O Isa<sup>as</sup>! his<sup>saww</sup> Religion is the upright one (Al-Haneefa), and his<sup>saww</sup> direction (Qiblah) is the Right one, and he<sup>saww</sup> is from My<sup>azwj</sup> Party, and I<sup>azwj</sup> am with him<sup>saww</sup>. So <span class=\"iTxt\">Tooba</span> is for him<sup>saww</sup>. Then again <span class=\"iTxt\">Tooba</span> is for him<sup>saww</sup>, for him<sup>saww</sup> is Al-Kawsar, and the great status in Gardens of Eden, living honourably, the ones that live in it, and he<sup>saww</sup> will pass away as a martyr. ",
            "For him<sup>saww</sup> is the Fountain greater than from Bakka (Makkah) up to the rising of the sun. In this are springs of a sealed drink (<span class=\"iTxt\">Al-Raheeq Al-Makhtoum</span>) similar (in number) to the stars in the sky, and cups similar (in number) to the grains of the sands of the earth, sweetened in it from every drink and food of every fruit in the Paradise. The one, who drinks from it a drink, will never be thirsty ever again, and that is what I<sup>azwj</sup> have Apportioned for him<sup>saww</sup>, and as a merit for him<sup>saww</sup> over the period in between you<sup>as</sup> and him<sup>saww</sup>. His<sup>saww</sup> secret would be in accordance with his publicising, and his<sup>saww</sup> words would be his<sup>saww</sup> deeds. He<sup>saww</sup> will not command the people except by himself<sup>saww</sup> doing it first. ",
            "His<sup>saww</sup> Religion is the Holy War in hardship as well as in ease. The cities would surrender to him<sup>saww</sup> and the ruler of Rome would yield to him<sup>saww</sup>. He<sup>saww</sup> would be upon the Religion of Ibrahim<sup>as</sup>. He<sup>saww</sup> will mention My<sup>saww</sup> name during partaking of the food, and would express the greetings, and he<sup>saww</sup> will Pray whilst the people are sleeping. Every day he<sup>saww</sup> would Pray five Prayers calling out in sequence to the Prayer like the calling of the army by the slogan. And he<sup>saww</sup> would open by the exclamation of the Takbeer, and he<sup>saww</sup> would end by the greetings. He<sup>saww</sup> would keep his<sup>saww</sup> feet in a row during the Prayer just as the Angels keep their feet in a row. And he<sup>saww</sup> would humble his<sup>saww</sup> heart before Me<sup>azwj</sup>, as well as his<sup>saww</sup> head. The ‘النُّورُ ’( the Divine Light) would be in his<sup>saww</sup> chest, and the truth would be upon his<sup>saww</sup> tongue, and he<sup>saww</sup> would be on the truth wherever he<sup>saww</sup> may be. ",
            "His<sup>saww</sup> origin would be as an orphan wandering for a while during his<sup>saww</sup> time for that which is required from him<sup>saww</sup>. His<sup>saww</sup> eyes would sleep but his<sup>saww</sup> heart would never sleep. For him<sup>saww</sup> is the intercession, and upon his<sup>saww</sup> community the Hour would be Established (Day of Judgement be made easy). And My<sup>azwj</sup> Hand is Above their hands, so the one who breaks (the Covenant) so he would have broken it against himself. And the one who is loyal to what has been Covenanted with him, I<sup>azwj</sup> would be Loyal to him with the Paradise. So command the unjust ones of the Children of Israel to study his<sup>saww</sup> Books and not to alter his<sup>saww</sup> Sunnah, and that they should send the greetings upon him<sup>saww</sup> for he<sup>saww</sup> is upon the status more glorious than the glorious. ",
            "O Isa<sup>as</sup>! All that which brings you<sup>as</sup> closer to Me<sup>azwj</sup>, I<sup>azwj</sup> have Evidenced it for you<sup>as</sup>, and everything which distances you<sup>as</sup> from Me<sup>azwj</sup>, so I<sup>azwj</sup> have Prohibited you<sup>as</sup> from it, so refer to it for yourself<sup>as</sup>.",
            "O Isa<sup>as</sup>! The world is sweet, and I have Utilised you<sup>as</sup> in it, so stay aside from what I<sup>azwj</sup> have Cautioned you<sup>as</sup> from, and take from it what I<sup>azwj</sup> Give to you<sup>as</sup> as a Gift.",
            "O Isa<sup>as</sup>! Look into your<sup>as</sup> affairs with a consideration of the sinful servant, the erroneous one, and do not look into the affairs of the other with the position of the Lord<sup>azwj</sup>. Become an ascetic therein and do not be allured with regards to it, for you<sup>as</sup> would be corrupted. ",
            "O Isa<sup>as</sup>! Think, and ponder, and look around in the earth and see how the unjust ones had vanished from its (face). ",
            "O Isa<sup>as</sup>! All that I<sup>azwj</sup> have Described to you<sup>as</sup> is Advice, and every Word of Mine<sup>azwj</sup> to you<sup>as</sup> is ‘حَقٌّ’ Just, and I<sup>azwj</sup> am the ‘الْحَقُّ الْمُبِينُ’ Clear Just. So Truth is what I<sup>azwj</sup> Speak and if you<sup>as</sup> were to disobey Me<sup>azwj</sup> after I<sup>azwj</sup> have Informed you<sup>as</sup>, there will be no Guardian for you<sup>as</sup> other than Myself<sup>azwj</sup>, nor a Helper. ",
            "O Isa<sup>as</sup>! Humble your<sup>as</sup> heart by the reverence, and look to the one who is below you<sup>as</sup>, and do not look to the one who is above you<sup>as</sup>, and know that the head of every error and sin is the love of the world, so do not love it for I<sup>azwj</sup> do not Love it. ",
            "O Isa<sup>as</sup>! Perfume your<sup>as</sup> heart for Me<sup>azwj</sup> and frequent My<sup>az</sup><sup>wj</sup> Remembrance in the privacy, and know that My<sup>azwj</sup> Happiness is in your<sup>as</sup> pleading to Me<sup>azwj</sup>, so be alive during that and not become as dead (heart). ",
            "O Isa<sup>as</sup>! Do not associate anything with Me<sup>azwj</sup> and be cautious from Me<sup>azwj</sup>, and do not be deceived by the (good) health and do not be envious for the world is like a fleeting shadow, and what approaches it is like what has been left behind from it. So compete in the righteous deeds with your<sup>as</sup> striving, and be with the truth wherever it may be even though you<sup>as</sup> may be cut and burnt by the fire. So do not disbelieve in Me<sup>azwj</sup> after the understanding, and do not become of the ignorant ones, for one ends up with that to which one associates. ",
            "O Isa<sup>as</sup>! Pour out your<sup>as</sup> tears for Me<sup>azwj</sup> from your<sup>as</sup> eyes, and humble your<sup>as</sup> heart to Me<sup>azwj</sup>. ",
            "O Isa<sup>as</sup>! Cry out to Me<sup>azwj</sup> for help during difficult conditions, for I<sup>azwj</sup> Help the afflicted ones and I<sup>azwj</sup> Answer the restless, and I<sup>azwj</sup> the most Merciful of the merciful ones”. "
          ],
          "en.sarwar": [
            "103. Ali Bin Ibrahim, from his father, from Ali Bin Asbaat, who has narrated the following: The Imam (a.s.) having said: ‘Among the Advice which Allah (azwj) Gave to Isa (as) was: “O Isa (as)! I (azwj) am your (as) Lord (azwj), and the Lord (azwj) of your (as) forefathers. My (azwj) Name is ‘وَاحِدٌ’ the One, and I (azwj) am the ‘الْأَحَدُ’ the One, which cannot be divided, the Lone One Who (azwj) Created everything, and everything is Made by My (azwj) and everything Returns to Me (azwj). O Isa (as)! You (as) are the Messiah by My (azwj) Command, and you (as) create from the clay something like the bird (but) by My (azwj) Permission, and you (as) revive the dead by My (azwj) Speech, so become attentive towards Me (azwj) and be a ‘رَاهِباً’ fully devote yourself to Me (azwj), and you (as) will never find a refuge except with Me (azwj). O Isa (as)! I (azwj) Bequeath to you (as) a Compassionate Command with the Mercy until the Wilayah is Ordained from Me (azwj) and there comes Pleasure from Me (azwj). You (as) are blessed as a grown up and blessed as a child whereby you (as) testified that you (as) are My (azwj) servant, the son (as) of My (azwj) maidservant (Maryam (as)). Make room for Me (azwj) in yourself (as) like your (as) concerns, and make My (azwj) Remembrance to be for your (as) return, and come near to Me (azwj) by the optional (Prayers), and place reliance upon Me (azwj) for I (azwj) will Suffice for you (as), and do not rely upon the others for I (azwj) shall Abandon you (as). O Isa (as)! Observe patience upon the afflictions and be pleased with the Destiny, and become like My (azwj) Happiness in you (as), for if My (azwj) Happiness is what makes you (as) happy, you (as) will be obedient and will not disobey. O Isa (as)! Revive My (azwj) Remembrance by your (as) tongue, and make My (azwj) cordiality to be in your (as) heart. O Isa (as)! Be vigilant in the hours of neglect and consider Me (azwj) of Kind Wisdom. O Isa (as)! Be attentive, a Devotee, and prepare your (as) heart to fear (Me (azwj)). O Isa (as)! Be a shepherd of the night to search for My (azwj) Happiness, and Magnify Me (azwj) in your (as) daytime for asking for your (as) need from Me (saww). O Isa (as)! Compete with regards to the good with your (as) striving; you (as) will be known by the good wherever you (as) may turn to. O Isa (as)! Judge among My (azwj) servants by My (azwj) Advice, and stand among them with My (azwj) Justice, for I (azwj) have Made to Descend upon you (as) a healing for what is in the chests from the diseases of the Satan (la). O Isa (as)! Do not be seated with the intrigued (hypocrites). O Isa (as)! Truly I (azwj) Say that no creature believed in Me (azwj) except that he was humble to Me (azwj), and did not humble himself to Me (azwj) except that he hoped for My (azwj) Reward. Be a witness that he is safe from My (azwj) Punishment, (that will be) the one who did not change or replace My (azwj) Sunnah. O Isa (as), the first son (as) of the chaste virgin, weep for your (as) self with a weeping like the one who says farewell to his family, and hate the world and leave it to its people, and become interested in what is in the Presence of your (as) God. O Isa (as)! Be along with that as a soft-spoken person, and offers greetings and be vigilant when the eyes of the righteous go to sleep. Be cautious of the Return and the severe earthquakes and the sensations of the Day of Judgement when neither the family, not the sons, nor the wealth would be of any benefit. O Isa (as)! Apply the Kohl of grief in your (as) eyes whilst the people of falsehood laugh. O Isa (as)! Become humble and patient, for Tooba is for you (as) if you (as) achieve what has been Prepared for the patient ones. O Isa (as)! Go from the world day by day, and taste the food from which its taste is less indulging. So I (azwj) Truly Say, you (as) are not with anything except for your (as) hour and your (as) day, so go from the world with provision, and let the rough (clothes) and less tempting (food) suffice for you (as) for you (as) have seen what becomes of it, and whatever you (as) take is written down, and how you (as) have consumed it. O Isa (as)! You (as) will be questioned, so be merciful to the weak just like My (azwj) Mercy towards you (as), and do not subdue the orphan. O Isa (as)! You (as) weep over yourself (as) in private, move your (as) feet to the timings of the Prayer, and let Me (azwj) Hear your (as) sweet speech of My (azwj) remembrance, for My (azwj) Favour to you (as) is good. O Isa (as)! How many from the community I (azwj) have Destroyed for their previous sins which I (azwj) have Protected you (as) from it. O Isa (as)! Be kind to the weak ones and raise your tired eye towards the sky and call upon Me (azwj) for I (azwj) am Near to you (as) and do not Pray to Me (azwj) except by Supplicating to Me (azwj) for your (as) concern is one concern, for when you (as) call upon Me (azwj) in such a manner, I (azwj) will Answer you (as). O Isa (as), I (azwj) was not Pleased with Presenting the world as a Reward for the ones who were before you (as), nor as a Punishment for the ones I (azwj) Want to Retaliate against. O Isa (as)! You (as) are to die and I (azwj) shall Remain, and from Me (azwj) is your (as) sustenance, and with Me (azwj) is your (as) fixed term and to Me (azwj) is your (as) eventual return, and to Me (azwj) is your (as) Accounting, so ask Me (azwj) and do not ask someone else, for the best from you (as) is the supplication, and from Me (azwj) is the Answering of it. O Isa (as)! How numerous are the human beings and how little are, in numbers, the patient ones. The trees are many but the good ones of it are few. So do not be deceived by the beauty of the tree until you have tasted its fruit. O Isa (as)! Do not be deceived by the rebellious one by disobeying My (Commands), I (azwj) Provide sustenance so (don’t) worship someone else, then he calls upon Me (azwj) during hardships, so I (azwj) Answer him. Then he returns to what he used to be in, rebelling against Me (azwj) exposing himself to My (azwj) Anger. I (azwj) Swear by Myself (azwj) that I (azwj) shall Grab him with such a Grip that there will be no salvation for him from it, and no refuge apart from Me (azwj). Where will he run from My (azwj) skies and from My (azwj) earth? O Isa (as)! Say to the unjust ones from the Children of Israel not to supplicate to Me (azwj) whilst the illegal earnings is under their hearts (into their stomach), and the idols are in their houses, for I (azwj) have Undertaken that I (azwj) shall Answer to the one who supplicates to Me (azwj), and Make My (azwj) Answer to be a Curse upon them (who disobey) until they disperse. O Isa (as)! How many times have I (azwj) Given them lengthy Consideration, and goodness of the seeking, but the people are in neglect and they will not return. The words come out from their mouths but their hearts are not with it. They expose themselves to My (azwj) Abhorrence and seek nearness to the Believers by display their love for Me (azwj) (showing hypocrisy) O Isa (as)! Make your (as) tongue to be one, be it in secret or in the open, and do that similarly with your (as) heart and your (as) vision. And turn your (as) heart and your (as) vision away from the Prohibited and restrain your (as) vision from that which has no benefit. So how many glances of the looker have planted lust in his heart, and returned him by it to the fountains of destruction. O Isa (as)! Be merciful and compassionate, and be as you (as) would like the people to be towards you (as). And frequently remember the death, and the separation of the families. And do not play for its amusements (as it) spoils the player. And do not be neglectful one for the neglectful is far from Me (azwj). And Remember Me (azwj) by the righteous deeds so that I (azwj) speak of you (as). O Isa (as)! Repent and return to Me (azwj) after the sins, and Mention Me (azwj) by the penitence, and believe in Me (azwj), and come closer to the Believers by Me (azwj), and urge them to supplicate to me (azwj) along with you (as). And beware of the supplication of the oppressed for I (azwj) have Undertaken upon Myself (azwj) that I (azwj) shall Open for it the Doors of the sky by the Acceptance, and Answer him even though it may be after a while. O Isa (as)! Know that the evil one infects, and the evil friend destroys. And know the one whom you (as) befriend and chose as a brother for yourself (as) from the Believers. O Isa (as)! Repent to Me (azwj) as there is no grand sin that I (azwj) do not Forgive it, and I (azwj) am the Most Merciful of the merciful ones. Work for yourself (as) in the time allocated from your (as) term before someone else works for it, and worship Me (azwj) for a day which will be like a thousand years of your counting, during which I (azwj) will Reward the good deeds by increasing them, and that the sins would remain with their doers. Prepare for yourself (as) in the allocated time, and compete in the good deeds, for how many a gathering has dispersed and its people being each other’s neighbours in the Fire. O Isa (as)! Abstain with regards to the mortal, that which will be cut-off, of the houses of the ones who were before you (as), so call them and whisper to them. Do you (as) feel that any one of them would take your (as) advice? And know, that you (as) will be joining them among the joining ones’. O Isa (as)! Say to the one who has rebelled against Me (azwj) by disobedience and works in opposition, to expect My (azwj) Punishment and await My (azwj) Destruction upon him, so he will be joined with the Destroyed ones. Tooba is for you (as), O son (as) of Maryam (as). Then Tooba is for you (as) if you (as) were to take to the discipline of your (as) God Who is Compassionate towards you (as) and Merciful, and Begin with the Favours to you (as) from Him (azwj) for Honour, as He (azwj) was for you (as) in the difficulties, and you (as) did not disobey Him (azwj). O Isa (as)! It is not Permissible for you (as) to disobey Him (azwj) Who has Advised you (a.s.) just as He (azwj) had Advised the ones who were before you (as), and I (azwj) am a Witness over that. O Isa (as)! I (azwj) have not Honoured any creature with the like of My (azwj) Religion, nor a Favour to him like My (azwj) Mercy. O Isa (as)! Wash with the water from you, what is apparent and heal with the goodness from you (as) what is hidden, for you (as) will be returning to Me (azwj). O Isa (as)! I (azwj) Gave to you (as) what I (azwj) had Favoured you (as) with an uninterrupted flow, and Sought from you (as) a loan for yourself (as), so if you (as) were to be niggardly with regards to it you (as) would become of the Destroyed ones. O Isa (as)! Adorn yourself (as) with the Religion and love the poor, and walk upon the earth in humility, and Pray upon the remainder, for all of it is clean. O Isa (as)! Roll up (your (as) affairs) for all that comes, is close by, and read My (azwj) Book whilst you (as) are clean, make Me (azwj) Listen to a voice from you (as) full of grief. O Isa (as)! There is no good in enjoyment which does not last and the life of the enjoyer is in decline. O son (as) of Maryam (as)! If you (as) were to see what I (azwj) have Prepared for My (azwj) righteous friends, your (as) heart would melt, and your (as) soul would come out (of your (as) body) in desire for it. So there is no house like the House of the Hereafter in which the neighbours are good people, and the Angels of Proximity come up to them, and they would be from the ones who would come on the Day of Judgement being safe from its horrors. A House in which, there is no change in the Bliss, nor are its inhabitants in decline. O son (as) of Maryam (as)! Compete with regards to it (the House in the Hereafter) along with the competitors, for it is the desire of the desirous ones, of good scenery. Tooba is for you, O son (as) of Maryam (as) , if you (as) are from the workers for it, along with your (as) forefathers Adam (as), and Ibrahim (as), being in the Gardens and Bliss, not seeking a substitution for it nor a transfer from it. That is how I (azwj) Deal with the pious ones. O Isa (as)! Flee to Me (azwj) like those who flee from the flaming Fire, and the Fire with chains and fetters. No soul would enter it and its grief would leave from him ever. It is a part like the part of the dark night. Those who are rescued from it would be successful, and those who do not get Rescued from it would be of the Destroyed ones. This is the House of the tyrants, and hardened oppressors, and every harsh, rude one, and every arrogant boaster. O Isa (as)! It is the evil house for the ones in its corner, and the evil dwelling for the unjust ones. I (azwj) Caution you (as), so that you (as) would be informed about it. O Isa (as)! Beware you (as) can be an observer for Me (azwj), and testify that I (azwj) have Created you (as), and you (as) are My (azwj) servant, and I (azwj) Shaped you (as), and sent you (as) down to the earth. O Isa (as)! It is not correct for two tongues to be in one mouth, not for two hearts to be in one chest, similarly for the minds. O Isa (as)! Do not wake up as a disobedient one, nor indulge in vanities whilst awake, and turn yourself (as) away from the lusts and the sins, and every desire which distances you (as) from Me (azwj). So migrate from it, and know that you (as) are from Me (azwj) at the status of the trustworthy Rasool (as), so be cautious with regards to Me (azwj), and know that your (as) world will deliver you (as) to Me (azwj), and I (azwj) will Grab you (as) with My (azwj) Knowledge. So become a humble soul during My (azwj) Remembrance, with a revering heart when you (as) Mention Me (azwj), being fully aware whilst the neglectful ones sleep. O Isa (as)! This is My (azwj) Advice to you (as) and My (azwj) Preaching to you (as), so take it from Me (azwj), and I (azwj) am the Lord (azwj) of the worlds. O Isa (as)! If My (azwj) servant is patient with Me (azwj), his Rewards for his deeds are upon Me (azwj), and it was upon him to supplicate to Me (azwj), and I (azwj) am Sufficient to Take Revenge from the ones who are disobedient to Me (azwj). Where will the unjust runaway to, from Me (azwj)? O Isa (as)! Speak good words wherever you (as) may be, for I (azwj) am a Knowledgeable Teacher. O Isa (as)! Bestow the good deeds towards Me (azwj) until it is Mentioned in My (azwj) Presence, and take to My (azwj) Advice, for there is a healing for the hearts therein. O Isa (as)! Do not hesitate when you (as) plan from My (azwj) Plan, and do not forget My (azwj) Remembrance in the privacy of the world. O Isa (as)! Take account of yourself (as) by referring to Me (azwj) until I (azwj) Accomplish the Rewards for what the workers have worked for. Those are the ones who will be getting their Recompense, and I (azwj) am the Best of the Givers. O Isa (as)! You (as) were Created by My (azwj) Word, and Maryam (as) gave birth to you (as) by My (azwj) Command, the Message sent to her (as) by My (azwj) Spirit Jibraeel the Trustworthy one from My (azwj) Angels, until you (as) stood upon the earth alive and walking. All that had been encompassed by My (azwj) Knowledge. O Isa (as)! Zakariyya (as) is at the status of your (as) father, and is the guardian of your (as) mother (as). When he (as) came up to her (as) in the Niche (Al-Mihraab) he (as) found sustenance in her (as) presence. And your (as) counterpart Yahya (as) (John) is from My (azwj) creatures, and I (azwj) Gifted him (as) to his (as) mother after the old age had set in, and she had no strength to her. I (azwj) Intended by that to Display to her My (azwj) Authority, and Display with regards to you (as), My (azwj) Power. The most Beloved of you all, to Me (azwj) is the one who is most obedient to Me (azwj), and the most intense in his fear from Me (azwj). O Isa (as)! Be vigilant and do not despair from My (azwj) Spirit, and Glorify Me (azwj) along with the ones who Glorify Me (azwj), and with the good speech Extol My (azwj) Holiness. O Isa (as)! How can the servants disbelieve in Me (azwj) whilst their forelocks are in My (azwj) Grip, and their going about in My (azwj) land while being ignorant of My (azwj) Favours, and their befriending of My (azwj) enemies, and that is how the infidels are (destined for) Destruction. O Isa (as)! The world is a prison with the rotten smell, and there is beauty in it from what has been seen by the tyrants who slaughter each other for it. And beware of the world, for every bounty of it is subject to decline, and there is no bounty in it except for a little. O Isa (as)! Reach for Me (azwj) near your (as) pillow and you (as) will find Me (azwj), and call upon Me (azwj) and you (as) are Beloved unto Me (azwj), for I (azwj) am the most Hearing of the listening. I (azwj) shall Answer the supplicant when one supplicates to Me (azwj). O Isa (as)! Fear Me (azwj) and get My (azwj) servants to fear Me (azwj) perhaps the sinners would abstain from what they are working in, so no one would be destroyed except that they would be aware (of it). O Isa (as)! Be in awe of Me (azwj) as you (as) are awed by the (fearful) beasts, and the death which you (as) are going to meet up with, for all these things, I (azwj) Created them, so it is Me (azwj) they should be Awed of. O Isa (as)! The Kingdom is Mine (azwj) and in My (azwj) Hands, and I (azwj) am the King, so if you (as) were to obey Me (azwj), I (azwj) shall Make you (as) to Enter My (azwj) Paradise among the neighbourhood of the righteous ones. O Isa (as)! If I (azwj) am Angry with you (as), the happiness of those who are happy with you (as) would be of no benefit to you (as), and if I (azwj) am Pleased with you (as), the anger of the angry ones would not adversely affect you (as). O Isa (as)! Remember me (azwj) in your (as) soul, I (azwj) will Remember you (as) Myself (azwj), and Mention Me (azwj) among your (as) people and I (azwj) will Mention you (as) among My (azwj) Gathering which is better than the gathering of the human beings. O Isa (as)! Supplicate to Me (azwj) by the supplication of the drowning one (Al-Ghareek), the grieving one for whom there is no helper (except Me (azwj)). O Isa (as)! Do not swear falsely by Me (azwj), for (that) My (azwj) Throne Trembles in Anger. The world has a short life span, but there are long yearnings therein, whilst in My (azwj) Possession is a better House from what you (as) accumulate. O Isa (as)! How will you (as) react when I (azwj) Bring out a Book for you (as) which Speaks with the Truth, and you will all testify to the secrets that you have been concealing, and the deeds which you had been performing. O Isa (as)! Say to the unjust ones of the Children of Israel: ‘You have washed your faces, and left your hearts as filthy. Are you trying to deceive Me (azwj) with a deception, or are you being audacious against Me (azwj)? You are applying fragrance for the people of the world whilst your inner selves are in My (azwj) Presence at the status of the rotten carcass, as if you are a dead people’. O Isa (as)! Say to them: ‘Trim your fingernails (cut yourselves off) from unlawful gains, and deafen your ears from the indecent speech, and turn towards Me (azwj) by your hearts, for I (azwj) do not Want (Fond of) your appearances. O Isa (as)! Be happy with the good deeds for therein lies My (azwj) Pleasure, and weep over the sins for it is a disgrace. And do not carry forward to others what you (as) do not like them to do unto you (as), and if your (as) right cheek is slapped then give him the left one. And come closer to Me (azwj) by the cordiality and your (as) striving, and keep away from the ignorant ones. O Isa (as)! Be humble to the people of good deeds and participate with them in it, and be a witness upon them and say to the unjust ones of the Children of Israel: ‘O evil companions who are seated upon it, if you do not desist, I (azwj) will metamorphose you into monkeys and pigs. O Isa (as)! Say to the unjust ones of the Children of Israel: ‘The Wisdom weeps after being made to separate from Me (azwj), and you are laughing by fleeing away from me. Has there come to you My (azwj) Disavowing, or have you found security from My (azwj) Punishment, or are you exposing yourselves to My (azwj) Punishment? I (azwj) Swear by Myself (azwj) that I (azwj) will Abandon you to be an example for the coming generations to learn a lesson from. Then I (azwj) Advise you (as), O son (as) of Maryam (as) the chaste virgin, of the (coming of) the Chief of the Rasools (as), and My (azwj) Beloved, so he (saww) is Ahmad (saww), the owner of the red camel, with a face illuminated with the light as bright as the full moon, and the one pure of the heart, and intensely valiant, the prestigious, for he (saww) is the Mercy to the Worlds, and the Chief of the children of Adam (as) on the Day that he (saww) will meet Me (azwj). The most honourable of the former ones to Me (azwj), and the nearest one to Me (azwj) from the Rasools (as), the Arab, the trustworthy, the embodiment of My (azwj) Religion, the patient one in struggling against the Polytheists by his (saww) own self and hands for the sake of My (azwj) Religion. And inform the Children of Israel about him (saww), and command them that they should ratify him (saww), and believe in him (saww), and follow him (saww), and help him (saww)”. Isa (as) said: ‘My (as) God! Who is he (saww) that if I (as) were to please him (saww) it would Please You (azwj)?’ He (azwj) Said: “He (saww) is Muhammad (saww), the Rasool Allah (saww) to all of the people. He (saww) is the closest to Me (azwj) in status, and the presenter for the intercession. Tooba is for him (saww) from the Prophets (as) and Tooba for his (saww) community who will meet Me (azwj) whilst being upon his (saww) way. The inhabitants of the earth praise him (saww), and the inhabitants of the sky seek Forgiveness through him (saww). The trustworthy, the Entrusted one, the good, the blessed, the best of the remaining ones in My (azwj) Presence who will be in the end of times. When he (saww) comes out, the sky will loosen its rainfall and the earth will bring out its blossoms until they will see the Blessings, and I (azwj) will Bless for him (saww) whatever that he (saww) places his (saww) hand upon, one with many wives and few children. He (saww) will live at Bekka (Makkah), the place of foundation of Ibrahim (as). O Isa (as)! his (saww) Religion is the upright one (Al-Haneefa), and his (saww) direction (Qiblah) is the Right one, and he (saww) is from My (azwj) Party, and I (azwj) am with him (saww). So Tooba is for him (saww). Then again Tooba is for him (saww), for him (saww) is Al-Kawsar, and the great status in Gardens of Eden, living honourably, the ones that live in it, and he (saww) will pass away as a martyr. For him (saww) is the Fountain greater than from Bakka (Makkah) up to the rising of the sun. In this are springs of a sealed drink (Al-Raheeq Al-Makhtoum) similar (in number) to the stars in the sky, and cups similar (in number) to the grains of the sands of the earth, sweetened in it from every drink and food of every fruit in the Paradise. The one, who drinks from it a drink, will never be thirsty ever again, and that is what I (azwj) have Apportioned for him (saww), and as a merit for him (saww) over the period in between you (as) and him (saww). His (saww) secret would be in accordance with his publicising, and his (saww) words would be his (saww) deeds. He (saww) will not command the people except by himself (saww) doing it first. His (saww) Religion is the Holy War in hardship as well as in ease. The cities would surrender to him (saww) and the ruler of Rome would yield to him (saww). He (saww) would be upon the Religion of Ibrahim (as). He (saww) will mention My (saww) name during partaking of the food, and would express the greetings, and he (saww) will Pray whilst the people are sleeping. Every day he (saww) would Pray five Prayers calling out in sequence to the Prayer like the calling of the army by the slogan. And he (saww) would open by the exclamation of the Takbeer, and he (saww) would end by the greetings. He (saww) would keep his (saww) feet in a row during the Prayer just as the Angels keep their feet in a row. And he (saww) would humble his (saww) heart before Me (azwj), as well as his (saww) head. The ‘النُّورُ ’( the Divine Light) would be in his (saww) chest, and the truth would be upon his (saww) tongue, and he (saww) would be on the truth wherever he (saww) may be. His (saww) origin would be as an orphan wandering for a while during his (saww) time for that which is required from him (saww). His (saww) eyes would sleep but his (saww) heart would never sleep. For him (saww) is the intercession, and upon his (saww) community the Hour would be Established (Day of Judgement be made easy). And My (azwj) Hand is Above their hands, so the one who breaks (the Covenant) so he would have broken it against himself. And the one who is loyal to what has been Covenanted with him, I (azwj) would be Loyal to him with the Paradise. So command the unjust ones of the Children of Israel to study his (saww) Books and not to alter his (saww) Sunnah, and that they should send the greetings upon him (saww) for he (saww) is upon the status more glorious than the glorious. O Isa (as)! All that which brings you (as) closer to Me (azwj), I (azwj) have Evidenced it for you (as), and everything which distances you (as) from Me (azwj), so I (azwj) have Prohibited you (as) from it, so refer to it for yourself (as). O Isa (as)! The world is sweet, and I have Utilised you (as) in it, so stay aside from what I (azwj) have Cautioned you (as) from, and take from it what I (azwj) Give to you (as) as a Gift. O Isa (as)! Look into your (as) affairs with a consideration of the sinful servant, the erroneous one, and do not look into the affairs of the other with the position of the Lord (azwj). Become an ascetic therein and do not be allured with regards to it, for you (as) would be corrupted. O Isa (as)! Think, and ponder, and look around in the earth and see how the unjust ones had vanished from its (face). O Isa (as)! All that I (azwj) have Described to you (as) is Advice, and every Word of Mine (azwj) to you (as) is ‘حَقٌّ’ Just, and I (azwj) am the ‘الْحَقُّ الْمُبِينُ’ Clear Just. So Truth is what I (azwj) Speak and if you (as) were to disobey Me (azwj) after I (azwj) have Informed you (as), there will be no Guardian for you (as) other than Myself (azwj), nor a Helper. O Isa (as)! Humble your (as) heart by the reverence, and look to the one who is below you (as), and do not look to the one who is above you (as), and know that the head of every error and sin is the love of the world, so do not love it for I (azwj) do not Love it. O Isa (as)! Perfume your (as) heart for Me (azwj) and frequent My (azwj) Remembrance in the privacy, and know that My (azwj) Happiness is in your (as) pleading to Me (azwj), so be alive during that and not become as dead (heart). O Isa (as)! Do not associate anything with Me (azwj) and be cautious from Me (azwj), and do not be deceived by the (good) health and do not be envious for the world is like a fleeting shadow, and what approaches it is like what has been left behind from it. So compete in the righteous deeds with your (as) striving, and be with the truth wherever it may be even though you (as) may be cut and burnt by the fire. So do not disbelieve in Me (azwj) after the understanding, and do not become of the ignorant ones, for one ends up with that to which one associates. O Isa (as)! Pour out your (as) tears for Me (azwj) from your (as) eyes, and humble your (as) heart to Me (azwj). O Isa (as)! Cry out to Me (azwj) for help during difficult conditions, for I (azwj) Help the afflicted ones and I (azwj) Answer the restless, and I (azwj) the most Merciful of the merciful ones”."
          ]
        }
      },
      {
        "index": 14788,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:31:2",
        "relations": {
          "Mentions": [
            "/books/quran:38:63",
            "/books/quran:38:64",
            "/books/quran:38:62"
          ]
        },
        "text": [
          "14552- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ عَنْبَسَةَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ إِذَا اسْتَقَرَّ أَهْلُ النَّارِ فِي النَّارِ يَفْقِدُونَكُمْ فَلَا يَرَوْنَ مِنْكُمْ أَحَداً فَيَقُولُ بَعْضُهُمْ لِبَعْضٍ ما لَنا لا نَرى رِجالًا كُنَّا نَعُدُّهُمْ مِنَ الْأَشْرارِ أَتَّخَذْناهُمْ سِخْرِيًّا أَمْ زاغَتْ عَنْهُمُ الْأَبْصارُ قَالَ وَ ذَلِكَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ إِنَّ ذلِكَ لَحَقٌّ تَخاصُمُ أَهْلِ النَّارِ يَتَخَاصَمُونَ فِيكُمْ فِيمَا كَانُوا يَقُولُونَ فِي الدُّنْيَا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473220\">H 14552</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al-Hakam, from Mansour Bin Yunus, from Anbasat, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘When the inhabitants of the Fire settle down in the Fire, they will miss you (Shiites). So they will not see any one from you (therein). So some of them will say to the others, <span class=\"ibTxt\">“<a href=\"/#/books/quran:38#h62\">[38:62]</a> And they will say: \"What has happened to us that we see not men whom we used to number among the bad ones? <a href=\"/#/books/quran:38#h63\">[38:63]</a> Was it that we (only) took them in scorn, or have our eyes (now) turned aside from them? <a href=\"/#/books/quran:38#h64\">[38:64]</a>.  </span>Imam<sup>asws</sup> said: ‘And that is the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“That most surely is the truth: the contending one with another of the inmates of the fire”</span>. They will be disputing with each other regarding you (Shiites) with regards to what they had been saying about you (Shiites) in the world’. ",
            "out of 567"
          ],
          "en.sarwar": [
            "104. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al-Hakam, from Mansour Bin Yunus, from Anbasat, who has narrated the following: Abu Abdullah (a.s.) said: ‘When the inhabitants of the Fire settle down in the Fire, they will miss you (Shiites). So they will not see any one from you (therein). So some of them will say to the others, “<a href=\"/#/books/quran:38#h62\">[38:62]</a> And they will say: \"What has happened to us that we see not men whom we used to number among the bad ones? <a href=\"/#/books/quran:38#h63\">[38:63]</a> Was it that we (only) took them in scorn, or have our eyes (now) turned aside from them? <a href=\"/#/books/quran:38#h64\">[38:64]</a>. Imam (a.s.) said: ‘And that is the Statement of Allah (azwj) Mighty and Majestic: “That most surely is the truth: the contending one with another of the inmates of the fire”. They will be disputing with each other regarding you (Shiites) with regards to what they had been saying about you (Shiites) in the world’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:31",
  "kind": "verse_list"
}