{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 33"
        },
        "path": "/books/al-kafi:8:1:33",
        "titles": {
          "ar": "حَدِيثُ مُحَاسَبَةِ النَّفْسِ",
          "en": "HADEETH OF SELF-ACCOUNTING"
        }
      }
    ],
    "index": 2304,
    "local_index": 33,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 34"
        },
        "path": "/books/al-kafi:8:1:34",
        "titles": {
          "ar": "حَدِيثُ مَنْ وُلِدَ فِي الْإِسْلَامِ",
          "en": "HADEETH ABOUT THE ONE WHO IS BORN IN AL-ISLAM"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 32"
        },
        "path": "/books/al-kafi:8:1:32",
        "titles": {
          "ar": "حَدِيثُ إِبْلِيسَ",
          "en": "HADEETH ABOUT IBLEES<sup>la</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:33",
    "titles": {
      "ar": "حَدِيثُ مُحَاسَبَةِ النَّفْسِ",
      "en": "HADEETH OF SELF-ACCOUNTING"
    },
    "verse_count": 18,
    "verse_start_index": 14791,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 343)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14792,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:33:1",
        "relations": {
          "Mentions": [
            "/books/quran:32:5"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14556</span>- عَلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ عَلِيُّ بْنُ مُحَمَّدٍ جَمِيعاً عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْمِنْقَرِيِّ عَنْ حَفْصِ بْنِ غِيَاثٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) إِذَا أَرَادَ أَحَدُكُمْ أَنْ لَا يَسْأَلَ رَبَّهُ شَيْئاً إِلَّا أَعْطَاهُ فَلْيَيْأَسْ مِنَ النَّاسِ كُلِّهِمْ وَ لَا يَكُونُ لَهُ رَجَاءٌ إِلَّا مِنْ عِنْدِ اللَّهِ عَزَّ ذِكْرُهُ فَإِذَا عَلِمَ اللَّهُ عَزَّ وَ جَلَّ ذَلِكَ مِنْ قَلْبِهِ لَمْ يَسْأَلْهُ شَيْئاً إِلَّا أَعْطَاهُ فَحَاسِبُوا أَنْفُسَكُمْ قَبْلَ أَنْ تُحَاسَبُوا عَلَيْهَا فَإِنَّ لِلْقِيَامَةِ خَمْسِينَ مَوْقِفاً كُلُّ مَوْقِفٍ مِقْدَارُهُ أَلْفُ سَنَةٍ ثُمَّ تَلَا فِي يَوْمٍ كانَ مِقْدارُهُ أَلْفَ سَنَةٍ مِمَّا تَعُدُّونَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473226\">H 14556</a> – Ali Bin Ibrahim, from his father and Ali Bin Muhammad altogether from Al-Qasim Bin Muhammad, from Suleyman Bin Dawood Al-Munkary, from Hafs Bin Gayaas who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘When one of you intends that whenever he asks his Lord<sup>azwj</sup> for something He<sup>azwj</sup> would Give it to him, so he should despair from all the people, and do not have any hope for himself except from Allah<sup>azwj</sup> Mighty is His<sup>azwj</sup> Remembrance. So when Allah<sup>azwj</sup> Knows that to be in his heart, never would he ask for anything but it would be Given to him. So take account of your selves before Accounting is taken against you, for on the Day of Judgement there will be fifty pausing stations, with each stop being of the measurement of a thousand years’. Then he<sup>asws</sup> recited: <span class=\"ibTxt\">“<a href=\"/#/books/quran:32#h5\">[32:5]</a> in a day the measure of which is a thousand years of what you count”</span>."
          ],
          "en.sarwar": [
            "108. Ali Bin Ibrahim, from his father and Ali Bin Muhammad altogether from Al-Qasim Bin Muhammad, from Suleyman Bin Dawood Al-Munkary, from Hafs Bin Gayaas who said: Abu Abdullah (a.s.) said: ‘When one of you intends that whenever he asks his Lord (azwj) for something He (azwj) would Give it to him, so he should despair from all the people, and do not have any hope for himself except from Allah (azwj) Mighty is His (azwj) Remembrance. So when Allah (azwj) Knows that to be in his heart, never would he ask for anything but it would be Given to him. So take account of your selves before Accounting is taken against you, for on the Day of Judgement there will be fifty pausing stations, with each stop being of the measurement of a thousand years’. Then he (a.s.) recited: “<a href=\"/#/books/quran:32#h5\">[32:5]</a> in a day the measure of which is a thousand years of what you count”."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 343)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14793,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:33:2",
        "text": [
          "14557- وَ بِهَذَا الْإِسْنَادِ عَنْ حَفْصٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ مَنْ كَانَ مُسَافِراً فَلْيُسَافِرْ يَوْمَ السَّبْتِ فَلَوْ أَنَّ حَجَراً زَالَ عَنْ جَبَلٍ يَوْمَ السَّبْتِ لَرَدَّهُ اللَّهُ عَزَّ ذِكْرُهُ إِلَى مَوْضِعِهِ وَ مَنْ تَعَذَّرَتْ عَلَيْهِ الْحَوَائِجُ فَلْيَلْتَمِسْ طَلَبَهَا يَوْمَ الثَّلَاثَاءِ فَإِنَّهُ الْيَوْمُ الَّذِي أَلَانَ اللَّهُ فِيهِ الْحَدِيدَ لِدَاوُدَ (عليه السلام)."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473227\">H 14557</a> – And by this chain, from Hafs, who has reported the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘The one who wants to travel so he should do so on the day of Saturday. Even if a stone falls off a mountain on the day of Saturday, Allah<sup>azwj</sup> would Return it to its place. And the one who is unable to fulfill his need should seek it on the day of Tuesday, for it is the day in which Allah<sup>azwj</sup> Softened the iron for Dawood<sup>as</sup>’."
          ],
          "en.sarwar": [
            "109. And by this chain, from Hafs, who has reported the following: Abu Abdullah (a.s.) said: ‘The one who wants to travel so he should do so on the day of Saturday. Even if a stone falls off a mountain on the day of Saturday, Allah (azwj) would Return it to its place. And the one who is unable to fulfill his need should seek it on the day of Tuesday, for it is the day in which Allah (azwj) Softened the iron for Dawood (as)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 344)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14794,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:33:3",
        "text": [
          "14558- وَ بِهَذَا الْإِسْنَادِ عَنْ حَفْصٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ مَثَلُ النَّاسِ يَوْمَ الْقِيَامَةِ إِذَا قَامُوا لِرَبِّ الْعَالَمِينَ مَثَلُ السَّهْمِ فِي الْقُرْبِ لَيْسَ لَهُ مِنَ الْأَرْضِ إِلَّا مَوْضِعُ قَدَمِهِ كَالسَّهْمِ فِي الْكِنَانَةِ لَا يَقْدِرُ أَنْ يَزُولَ هَاهُنَا وَ لَا هَاهُنَا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473228\">H 14558</a> – And by this chain, from Hafs, who has reported the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘The example of the people of the Day of Judgement when they stand before the Lord<sup>azwj</sup> of the Worlds, where they will have no space for movement for themselves except for their feet, like the arrows (tightly packed) in the quiver, not having the ability for going over there or over there’."
          ],
          "en.sarwar": [
            "110. And by this chain, from Hafs, who has reported the following: Abu Abdullah (a.s.) said: ‘The example of the people of the Day of Judgement when they stand before the Lord (azwj) of the Worlds, where they will have no space for movement for themselves except for their feet, like the arrows (tightly packed) in the quiver, not having the ability for going over there or over there’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 344)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14795,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:33:4",
        "relations": {
          "Mentions": [
            "/books/quran:19:25"
          ]
        },
        "text": [
          "14559- وَ بِهَذَا الْإِسْنَادِ عَنْ حَفْصٍ قَالَ رَأَيْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَتَخَلَّلُ بَسَاتِينَ الْكُوفَةِ فَانْتَهَى إِلَى نَخْلَةٍ فَتَوَضَّأَ عِنْدَهَا ثُمَّ رَكَعَ وَ سَجَدَ فَأَحْصَيْتُ فِي سُجُودِهِ خَمْسَمِائَةِ تَسْبِيحَةٍ ثُمَّ اسْتَنَدَ إِلَى النَّخْلَةِ فَدَعَا بِدَعَوَاتٍ ثُمَّ قَالَ يَا أَبَا حَفْصٍ إِنَّهَا وَ اللَّهِ النَّخْلَةُ الَّتِي قَالَ اللَّهُ جَلَّ وَ عَزَّ لِمَرْيَمَ (عليها السلام) وَ هُزِّي إِلَيْكِ بِجِذْعِ النَّخْلَةِ تُساقِطْ عَلَيْكِ رُطَباً جَنِيًّا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473229\">H 14559</a> – And by this chain, from Hafs who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> saw Abu Abdullah</span><sup>a</sup><sup>sws</sup> alone in the gardens of Al-Kufa. He<sup>asws</sup> came to a palm tree, so he<sup>asws</sup> performed ablution near it, then bowed and prostrated. I counted in his<sup>asws</sup> prostration five hundred Glorifications (Tasbeeh). Then he<sup>asws</sup> leaned on the palm tree and supplicated by a supplication. Then he<sup>asws</sup> said: ‘O Abu Hafs! By Allah<sup>azwj</sup>, it is the palm tree about which Allah<sup>azwj</sup> Said to Maryam<sup>as</sup>: <span class=\"ibTxt\">“<a href=\"/#/books/quran:19#h25\">[19:25]</a> And shake towards you the trunk of the palm tree, it will drop on you fresh ripe dates”</span>."
          ],
          "en.sarwar": [
            "111. And by this chain, from Hafs who said: I saw Abu Abdullah (a.s.) alone in the gardens of Al-Kufa. He (a.s.) came to a palm tree, so he (a.s.) performed ablution near it, then bowed and prostrated. I counted in his (a.s.) prostration five hundred Glorifications (Tasbeeh). Then he (a.s.) leaned on the palm tree and supplicated by a supplication. Then he (a.s.) said: ‘O Abu Hafs! By Allah (azwj), it is the palm tree about which Allah (azwj) Said to Maryam (as): “<a href=\"/#/books/quran:19#h25\">[19:25]</a> And shake towards you the trunk of the palm tree, it will drop on you fresh ripe dates”."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 344)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14796,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:33:5",
        "text": [
          "14560- حَفْصٌ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ عِيسَى (عليه السلام) اشْتَدَّتْ مَئُونَةُ الدُّنْيَا وَ مَئُونَةُ الْآخِرَةِ أَمَّا مَئُونَةُ الدُّنْيَا فَإِنَّكَ لَا تَمُدُّ يَدَكَ إِلَى شَيْ‏ءٍ مِنْهَا إِلَّا وَجَدْتَ فَاجِراً قَدْ سَبَقَكَ إِلَيْهَا وَ أَمَّا مَئُونَةُ الْآخِرَةِ فَإِنَّكَ لَا تَجِدُ أَعْوَاناً يُعِينُونَكَ عَلَيْهَا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473230\">H 14560</a> – Hafs, who has reported the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has narrated that ‘Isa<sup>as</sup> said: ‘It is intensely difficult to collect the provisions of the world and the provisions of the Hereafter, As for the provisions of the world, so you will not extend your hand towards something except that you will find an immoral one has preceded you for it, and as for the provisions of the Hereafter, so you will not find any helper who will help you for it’."
          ],
          "en.sarwar": [
            "112. Hafs, who has reported the following: Abu Abdullah (a.s.) has narrated that ‘Isa (as) said: ‘It is intensely difficult to collect the provisions of the world and the provisions of the Hereafter, As for the provisions of the world, so you will not extend your hand towards something except that you will find an immoral one has preceded you for it, and as for the provisions of the Hereafter, so you will not find any helper who will help you for it’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 345)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 387)"
        ],
        "index": 14797,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:33:6",
        "text": [
          "14561- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ يُونُسَ بْنِ عَمَّارٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ أَيُّمَا مُؤْمِنٍ شَكَا حَاجَتَهُ وَ ضُرَّهُ إِلَى كَافِرٍ أَوْ إِلَى مَنْ يُخَالِفُهُ عَلَى دِينِهِ فَكَأَنَّمَا شَكَا اللَّهَ عَزَّ وَ جَلَّ إِلَى عَدُوٍّ مِنْ أَعْدَاءِ اللَّهِ وَ أَيُّمَا رَجُلٍ مُؤْمِنٍ شَكَا حَاجَتَهُ وَ ضُرَّهُ إِلَى مُؤْمِنٍ مِثْلِهِ كَانَتْ شَكْوَاهُ إِلَى اللَّهِ عَزَّ وَ جَلَّ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473231\">H 14561</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Yunus Bin Ammaar who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘Whichever Believer complains of his need and presents it to an Infidel or to the one who is opposed to his Religion, so it is as if he has complained against Allah<sup>azwj</sup> before an enemy from the enemies of Allah<sup>azwj</sup>. And whichever Believing man complains of his need and presents it to a Believer like him, so it is as if he has complained to Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "113. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Yunus Bin Ammaar who said: ‘I heard Abu Abdullah (a.s.) saying: ‘Whichever Believer complains of his need and presents it to an Infidel or to the one who is opposed to his Religion, so it is as if he has complained against Allah (azwj) before an enemy from the enemies of Allah (azwj). And whichever Believing man complains of his need and presents it to a Believer like him, so it is as if he has complained to Allah (azwj)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 345)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14798,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:33:7",
        "relations": {
          "Mentions": [
            "/books/quran:34:14"
          ]
        },
        "text": [
          "14562- ابْنُ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنِ الْوَلِيدِ بْنِ صَبِيحٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَوْحَى إِلَى سُلَيْمَانَ بْنِ دَاوُدَ (عليهما السلام) أَنَّ آيَةَ مَوْتِكَ أَنَّ شَجَرَةً تَخْرُجُ مِنْ بَيْتِ الْمَقْدِسِ يُقَالُ لَهَا الْخُرْنُوبَةُ قَالَ فَنَظَرَ سُلَيْمَانُ يَوْماً فَإِذَا الشَّجَرَةُ الْخُرْنُوبَةُ قَدْ طَلَعَتْ مِنْ بَيْتِ الْمَقْدِسِ فَقَالَ لَهَا مَا اسْمُكِ قَالَتِ الْخُرْنُوبَةُ قَالَ فَوَلَّى سُلَيْمَانُ مُدْبِراً إِلَى مِحْرَابِهِ فَقَامَ فِيهِ مُتَّكِئاً عَلَى عَصَاهُ فَقُبِضَ رُوحُهُ مِنْ سَاعَتِهِ قَالَ ",
          "فَجَعَلَتِ الْجِنُّ وَ الْإِنْسُ يَخْدُمُونَهُ وَ يَسْعَوْنَ فِي أَمْرِهِ كَمَا كَانُوا وَ هُمْ يَظُنُّونَ أَنَّهُ حَيٌّ لَمْ يَمُتْ يَغْدُونَ وَ يَرُوحُونَ وَ هُوَ قَائِمٌ ثَابِتٌ حَتَّى دَبَّتِ الْأَرَضَةُ مِنْ عَصَاهُ فَأَكَلَتْ مِنْسَأَتَهُ فَانْكَسَرَتْ وَ خَرَّ سُلَيْمَانُ إِلَى الْأَرْضِ أَ فَلَا تَسْمَعُ لِقَوْلِهِ عَزَّ وَ جَلَّ فَلَمَّا خَرَّ تَبَيَّنَتِ الْجِنُّ أَنْ لَوْ كانُوا يَعْلَمُونَ الْغَيْبَ ما لَبِثُوا فِي الْعَذابِ الْمُهِينِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473232\">H 14562</a> – Ibn Mahboub, from Jameel Bin Saleh, from Al-Waleed Bin Sabeeh, who has reported the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Revealed unto Suleyman Bin Dawood<sup>as</sup> that: “The sign of your<sup>as</sup> death is a tree which will come out from Bayt Al-Maqdas called <span class=\"iTxt\">Al-Kharnouba</span>”. Suleyman<sup>as</sup> looked around one day and there was <span class=\"iTxt\">Al-Kharnouba</span> tree which had emerged from Bayt Al-Maqdas. So he<sup>as</sup> said to it: ‘What is your name?’ It said, ‘Al-Kharnouba’. Suleyman<sup>as</sup> turned back to his<sup>as</sup> Prayer Niche and stood leaning upon his staff. His<sup>as</sup> soul was Captured (passed away) in that moment. ",
            "The Jinn and the human beings kept on serving him<sup>as</sup> and were striving in his<sup>as</sup> command as before, and they were thinking that he<sup>as</sup> was alive and had not died. The morning came and passed, and he<sup>as</sup> was still standing still, until the woodworm gnawed away at his<sup>as</sup> staff and it broke, and Suleyman<sup>as</sup> fell down upon the ground. Have you not heard the Statemennt of the Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:34#h14\">[34:14]</a> and when it fell down, the jinn came to know plainly that if they had known the unseen, they would not have tarried in abasing torment”</span>."
          ],
          "en.sarwar": [
            "114. Ibn Mahboub, from Jameel Bin Saleh, from Al-Waleed Bin Sabeeh, who has reported the following: Abu Abdullah (a.s.) having said: ‘Allah (azwj) Mighty and Majestic Revealed unto Suleyman Bin Dawood (as) that: “The sign of your (as) death is a tree which will come out from Bayt Al-Maqdas called Al-Kharnouba”. Suleyman (as) looked around one day and there was Al-Kharnouba tree which had emerged from Bayt Al-Maqdas. So he (as) said to it: ‘What is your name?’ It said, ‘Al-Kharnouba’. Suleyman (as) turned back to his (as) Prayer Niche and stood leaning upon his staff. His (as) soul was Captured (passed away) in that moment. The Jinn and the human beings kept on serving him (as) and were striving in his (as) command as before, and they were thinking that he (as) was alive and had not died. The morning came and passed, and he (as) was still standing still, until the woodworm gnawed away at his (as) staff and it broke, and Suleyman (as) fell down upon the ground. Have you not heard the Statemennt of the Mighty and Majestic: “<a href=\"/#/books/quran:34#h14\">[34:14]</a> and when it fell down, the jinn came to know plainly that if they had known the unseen, they would not have tarried in abasing torment”."
          ]
        }
      },
      {
        "gradings": [
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14799,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:33:8",
        "relations": {
          "Mentions": [
            "/books/quran:11:5"
          ]
        },
        "text": [
          "14563- ابْنُ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ سَدِيرٍ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ أَخْبَرَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ أَنَّ الْمُشْرِكِينَ كَانُوا إِذَا مَرُّوا بِرَسُولِ اللَّهِ حَوْلَ الْبَيْتِ طَأْطَأَ أَحَدُهُمْ ظَهْرَهُ وَ رَأْسَهُ هَكَذَا وَ غَطَّى رَأْسَهُ بِثَوْبِهِ لَا يَرَاهُ رَسُولُ اللَّهِ (صلى الله عليه وآله) فَأَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ أَلا إِنَّهُمْ يَثْنُونَ صُدُورَهُمْ لِيَسْتَخْفُوا مِنْهُ أَلا حِينَ يَسْتَغْشُونَ ثِيابَهُمْ يَعْلَمُ ما يُسِرُّونَ وَ ما يُعْلِنُونَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473233\">H 14563</a> – Ibn Mahboub, from Jameel Bin Saleh, from Sudeyr, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> said: ‘Jabir Bin Abdullah<sup>ar</sup> informed me<sup>asws</sup> that when the Polytheists used to pass by the Rasool Allah<sup>saww</sup>, they would incline their heads and cover their heads with their clothes so that the Rasool Allah<sup>saww</sup> would not see (recognise) them. So Allah<sup>azwj</sup> Mighty and Majestic Revealed: <span class=\"ibTxt\">“<a href=\"/#/books/quran:11#h5\">[11:5]</a> Now surely they fold up their breasts that they may conceal (their enmity) from Him; now surely, when they use their garments as a covering, He knows what they conceal and what they make public”</span>."
          ],
          "en.sarwar": [
            "115. Ibn Mahboub, from Jameel Bin Saleh, from Sudeyr, who has narrated the following: Abu Ja’far (a.s.) said: ‘Jabir Bin Abdullah (ar) informed me (a.s.) that when the Polytheists used to pass by the Rasool Allah (saww), they would incline their heads and cover their heads with their clothes so that the Rasool Allah (saww) would not see (recognise) them. So Allah (azwj) Mighty and Majestic Revealed: “<a href=\"/#/books/quran:11#h5\">[11:5]</a> Now surely they fold up their breasts that they may conceal (their enmity) from Him; now surely, when they use their garments as a covering, He knows what they conceal and what they make public”."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 347)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14800,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:33:9",
        "text": [
          "14564- ابْنُ مَحْبُوبٍ عَنْ أَبِي جَعْفَرٍ الْأَحْوَلِ عَنْ سَلَّامِ بْنِ الْمُسْتَنِيرِ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ خَلَقَ الْجَنَّةَ قَبْلَ أَنْ يَخْلُقَ النَّارَ وَ خَلَقَ الطَّاعَةَ قَبْلَ أَنْ يَخْلُقَ الْمَعْصِيَةَ وَ خَلَقَ الرَّحْمَةَ قَبْلَ الْغَضَبِ وَ خَلَقَ الْخَيْرَ قَبْلَ الشَّرِّ وَ خَلَقَ الْأَرْضَ قَبْلَ السَّمَاءِ وَ خَلَقَ الْحَيَاةَ قَبْلَ الْمَوْتِ وَ خَلَقَ الشَّمْسَ قَبْلَ الْقَمَرِ وَ خَلَقَ النُّورَ قَبْلَ الظُّلْمَةِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473234\">H 14564</a> – Ibn Mahboub, from Abu Ja’far Al-Howl, from Sallaam Bin Al-Mustaneer, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> said: ‘Allah<sup>azwj</sup> Created the Paradise before He<sup>azwj</sup> Created the Fire, and Created the obedience before He<sup>azwj</sup> Created the disobedience, and Created the Mercy before the Anger, and Created the good before the evil, and Created the earth before the sky, and Created the life before the death, and Created the sun before the moon, and Created the ‘النُّورَ’ (the Divine Light) before the darkness’."
          ],
          "en.sarwar": [
            "116. Ibn Mahboub, from Abu Ja’far Al-Howl, from Sallaam Bin Al-Mustaneer, who has narrated the following: Abu Ja’far (a.s.) said: ‘Allah (azwj) Created the Paradise before He (azwj) Created the Fire, and Created the obedience before He (azwj) Created the disobedience, and Created the Mercy before the Anger, and Created the good before the evil, and Created the earth before the sky, and Created the life before the death, and Created the sun before the moon, and Created the ‘النُّورَ’ (the Divine Light) before the darkness’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 347)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14801,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:33:10",
        "relations": {
          "Mentions": [
            "/books/quran:32:4"
          ]
        },
        "text": [
          "14565- عَنْهُ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ إِنَّ اللَّهَ خَلَقَ الْخَيْرَ يَوْمَ الْأَحَدِ وَ مَا كَانَ لِيَخْلُقَ الشَّرَّ قَبْلَ الْخَيْرِ وَ فِي يَوْمِ الْأَحَدِ وَ الْإِثْنَيْنِ خَلَقَ الْأَرَضِينَ وَ خَلَقَ أَقْوَاتَهَا فِي يَوْمِ الثَّلَاثَاءِ وَ خَلَقَ السَّمَاوَاتِ يَوْمَ الْأَرْبِعَاءِ وَ يَوْمَ الْخَمِيسِ وَ خَلَقَ أَقْوَاتَهَا يَوْمَ الْجُمُعَةِ وَ ذَلِكَ قَوْلُهُ عَزَّ وَ جَلَّ خَلَقَ السَّماواتِ وَ الْأَرْضَ وَ ما بَيْنَهُما فِي سِتَّةِ أَيَّامٍ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473235\">H 14565</a> – From him, from Abdullah Bin Sinan who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying that: ‘Allah<sup>azwj</sup> Created the good on the day of Sunday, and He<sup>azwj</sup> did not Create the evil before the good. And during the day of Sunday and the Monday Created the firmaments and created their sustenance during the day of Tuesday, and Created the Skies on the day of Wednesday and Thursday, and Created their sustenance on the day of Friday, and that is the Statement of the Mighty and Majestic; <span class=\"ibTxt\">“<a href=\"/#/books/quran:32#h4\">[32:4]</a> Allah it is Who created the heavens and the earth, and that which is between them, in six Days”</span>."
          ],
          "en.sarwar": [
            "117. From him, from Abdullah Bin Sinan who said: I heard Abu Abdullah (a.s.) saying that: ‘Allah (azwj) Created the good on the day of Sunday, and He (azwj) did not Create the evil before the good. And during the day of Sunday and the Monday Created the firmaments and created their sustenance during the day of Tuesday, and Created the Skies on the day of Wednesday and Thursday, and Created their sustenance on the day of Friday, and that is the Statement of the Mighty and Majestic; “<a href=\"/#/books/quran:32#h4\">[32:4]</a> Allah it is Who created the heavens and the earth, and that which is between them, in six Days”."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 352)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 387)"
        ],
        "index": 14802,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:33:11",
        "relations": {
          "Mentions": [
            "/books/quran:7:17",
            "/books/quran:7:16"
          ]
        },
        "text": [
          "14566- ابْنُ مَحْبُوبٍ عَنْ حَنَانٍ وَ عَلِيِّ بْنِ رِئَابٍ عَنْ زُرَارَةَ قَالَ قُلْتُ لَهُ قَوْلُهُ عَزَّ وَ جَلَّ لَأَقْعُدَنَّ لَهُمْ صِراطَكَ الْمُسْتَقِيمَ ثُمَّ لَآتِيَنَّهُمْ مِنْ بَيْنِ أَيْدِيهِمْ وَ مِنْ خَلْفِهِمْ وَ عَنْ أَيْمانِهِمْ وَ عَنْ شَمائِلِهِمْ وَ لا تَجِدُ أَكْثَرَهُمْ شاكِرِينَ قَالَ فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) يَا زُرَارَةُ إِنَّهُ إِنَّمَا صَمَدَ لَكَ وَ لِأَصْحَابِكَ فَأَمَّا الْآخَرُونَ فَقَدْ فَرَغَ مِنْهُمْ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473236\">H 14566</a> – Ibn Mahboub, from Hanaan and Ali Bin Ra’ib, from Zurara who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> said to him</span><sup>asws</sup>, ‘The Statement of the Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:7#h16\">[7:16]</a> I will certainly lie in wait for them in Thy straight path <a href=\"/#/books/quran:7#h17\">[7:17]</a> Then I will certainly come to them from before them and from behind them, and from their right-hand side and from their left-hand side; and Thou shalt not find most of them thankful”</span>, so Abu Ja’far<sup>asws</sup> said: ‘O Zurara! But rather, he (Satan<sup>la</sup>) is lying in wait for you and for your companions. So as for the other ones, he has finished from them’."
          ],
          "en.sarwar": [
            "118. Ibn Mahboub, from Hanaan and Ali Bin Ra’ib, from Zurara who said: I said to him (a.s.), ‘The Statement of the Mighty and Majestic: “<a href=\"/#/books/quran:7#h16\">[7:16]</a> I will certainly lie in wait for them in Thy straight path <a href=\"/#/books/quran:7#h17\">[7:17]</a> Then I will certainly come to them from before them and from behind them, and from their right-hand side and from their left-hand side; and Thou shalt not find most of them thankful”, so Abu Ja’far (a.s.) said: ‘O Zurara! But rather, he (Satan (la)) is lying in wait for you and for your companions. So as for the other ones, he has finished from them’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 353)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 387)"
        ],
        "index": 14803,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:33:12",
        "text": [
          "14567- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ وَ الْحُسَيْنِ بْنِ سَعِيدٍ جَمِيعاً عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى بْنِ عِمْرَانَ الْحَلَبِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ بَدْرِ بْنِ الْوَلِيدِ الْخَثْعَمِيِّ قَالَ دَخَلَ يَحْيَى بْنُ سَابُورَ عَلَى أَبِي عَبْدِ اللَّهِ (عليه السلام) لِيُوَدِّعَهُ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ (عليه السلام) أَمَا وَ اللَّهِ إِنَّكُمْ لَعَلَى الْحَقِّ وَ إِنَّ مَنْ خَالَفَكُمْ لَعَلَى غَيْرِ الْحَقِّ وَ اللَّهِ مَا أَشُكُّ لَكُمْ فِي الْجَنَّةِ وَ إِنِّي لَأَرْجُو أَنْ يُقِرَّ اللَّهُ لِأَعْيُنِكُمْ عَنْ قَرِيبٍ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473237\">H 14567</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Khalid and Al-Husayn Bin Saeed altogether, from Al-Nazar Bin Suweyd, from Yahya Bin Umraan Al-Halby, from Abdullah Bin Muskaan, from Badr Bin Al-Waleed Al-Khash’amy who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-y\">Y</span>ahya Bin Sabour came</span> up to Abu Abdullah<sup>asws</sup> to say farewell to him<sup>asws</sup>. So Abu Abdullah<sup>asws</sup> said to him: ‘By Allah<sup>azwj</sup>! You are upon the ‘الْحَقِّ’ Just, and that the ones opposed to you are upon other than the Just. By Allah<sup>azwj</sup>! I<sup>asws</sup> have no doubt for you with regards to the Paradise, and I<sup>asws</sup> hope that Allah<sup>azwj</sup> would Delight your eyes very soon’."
          ],
          "en.sarwar": [
            "119. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Khalid and Al-Husayn Bin Saeed altogether, from Al-Nazar Bin Suweyd, from Yahya Bin Umraan Al-Halby, from Abdullah Bin Muskaan, from Badr Bin Al-Waleed Al-Khash’amy who said: Yahya Bin Sabour came up to Abu Abdullah (a.s.) to say farewell to him (a.s.). So Abu Abdullah (a.s.) said to him: ‘By Allah (azwj)! You are upon the ‘الْحَقِّ’ Just, and that the ones opposed to you are upon other than the Just. By Allah (azwj)! I (a.s.) have no doubt for you with regards to the Paradise, and I (a.s.) hope that Allah (azwj) would Delight your eyes very soon’."
          ]
        }
      },
      {
        "gradings": [
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 388)"
        ],
        "index": 14804,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:33:13",
        "text": [
          "14568- يَحْيَى الْحَلَبِيُّ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ أَ رَأَيْتَ الرَّادَّ عَلَيَّ هَذَا الْأَمْرَ فَهُوَ كَالرَّادِّ عَلَيْكُمْ فَقَالَ يَا أَبَا مُحَمَّدٍ مَنْ رَدَّ عَلَيْكَ هَذَا الْأَمْرَ فَهُوَ كَالرَّادِّ عَلَى رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ عَلَى اللَّهِ تَبَارَكَ وَ تَعَالَى يَا أَبَا مُحَمَّدٍ إِنَّ الْمَيِّتَ مِنْكُمْ عَلَى هَذَا الْأَمْرِ شَهِيدٌ قَالَ قُلْتُ وَ إِنْ مَاتَ عَلَى فِرَاشِهِ قَالَ إِي وَ اللَّهِ وَ إِنْ مَاتَ عَلَى فِرَاشِهِ حَيٌّ عِنْدَ رَبِّهِ يُرْزَقُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473238\">H 14568</a> – Yahya Al-Halby, from Abdullah Bin Muskaan, from Abu Baseer who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> said to him</span><sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>, do you<sup>asws</sup> see the one who rejects this matter (Al-Wilayah) to me as if he has rejected you<sup>asws</sup>?’ He<sup>asws</sup> said: ‘O Abu Muhammad! The one who rejects this matter to you, so he has rejected against the Rasool Allah<sup>saww</sup>, and against Allah<sup>azwj</sup> Blessed and High. O Abu Muhammad! The dead ones from among you who were upon this matter (Al-Wilayah) is the martyr’. I said, ‘Even if he died upon his bed?’ He<sup>as</sup><sup>ws</sup> said: ‘Yes, by Allah<sup>azwj</sup>, even if he died upon his bed, he is alive in the Presence of his Lord<sup>azwj</sup> being given Sustenance’."
          ],
          "en.sarwar": [
            "120. Yahya Al-Halby, from Abdullah Bin Muskaan, from Abu Baseer who said: I said to him (a.s.), ‘May I be sacrificed for you (a.s.), do you (a.s.) see the one who rejects this matter (Al-Wilayah) to me as if he has rejected you (a.s.)?’ He (a.s.) said: ‘O Abu Muhammad! The one who rejects this matter to you, so he has rejected against the Rasool Allah (saww), and against Allah (azwj) Blessed and High. O Abu Muhammad! The dead ones from among you who were upon this matter (Al-Wilayah) is the martyr’. I said, ‘Even if he died upon his bed?’ He (a.s.) said: ‘Yes, by Allah (azwj), even if he died upon his bed, he is alive in the Presence of his Lord (azwj) being given Sustenance’."
          ]
        }
      },
      {
        "gradings": [
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 388)"
        ],
        "index": 14805,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:33:14",
        "text": [
          "14569- يَحْيَى الْحَلَبِيُّ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ حَبِيبٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ أَمَا وَ اللَّهِ مَا أَحَدٌ مِنَ النَّاسِ أَحَبَّ إِلَيَّ مِنْكُمْ وَ إِنَّ النَّاسَ سَلَكُوا سُبُلًا شَتَّى فَمِنْهُمْ مَنْ أَخَذَ بِرَأْيِهِ وَ مِنْهُمْ مَنِ اتَّبَعَ هَوَاهُ وَ مِنْهُمْ مَنِ اتَّبَعَ الرِّوَايَةَ وَ إِنَّكُمْ أَخَذْتُمْ بِأَمْرٍ لَهُ أَصْلٌ فَعَلَيْكُمْ بِالْوَرَعِ وَ الِاجْتِهَادِ وَ اشْهَدُوا الْجَنَائِزَ وَ عُودُوا الْمَرْضَى وَ احْضُرُوا مَعَ قَوْمِكُمْ فِي مَسَاجِدِهِمْ لِلصَّلَاةِ أَ مَا يَسْتَحْيِي الرَّجُلُ مِنْكُمْ أَنْ يَعْرِفَ جَارُهُ حَقَّهُ وَ لَا يَعْرِفَ حَقَّ جَارِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473239\">H 14569</a> – Yahya Al-Halby, from Abdullah Bin Muskaan, from Habeeb who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘By Allah<sup>azwj</sup>! There is no one from the people more beloved to me<sup>asws</sup> than you are, and that the people have gone in various directions. So among them is the ‘one’ who takes (religion) to his own opinion, and among them is one who follows his own desires, and among them is the one who follows the narration (Al-Riwayah), and you all have grabbed to a matter for which there is an origin. So it is for you to observe piety, and the struggle, and bear witness to the funerals, and console the sick, and be present with your people in their Masjids for the Prayers. Is it not shameful for the man among you that his right is being observed by his neighbour whilst he himself does not observe the rights of his neighbour?’ "
          ],
          "en.sarwar": [
            "121. Yahya Al-Halby, from Abdullah Bin Muskaan, from Habeeb who said: I heard Abu Abdullah (a.s.) saying: ‘By Allah (azwj)! There is no one from the people more beloved to me (a.s.) than you are, and that the people have gone in various directions. So among them is the ‘one’ who takes (religion) to his own opinion, and among them is one who follows his own desires, and among them is the one who follows the narration (Al-Riwayah), and you all have grabbed to a matter for which there is an origin. So it is for you to observe piety, and the struggle, and bear witness to the funerals, and console the sick, and be present with your people in their Masjids for the Prayers. Is it not shameful for the man among you that his right is being observed by his neighbour whilst he himself does not observe the rights of his neighbour?’"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 354)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 388)"
        ],
        "index": 14806,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:33:15",
        "text": [
          "14570- عَنْهُ عَنِ ابْنِ مُسْكَانَ عَنْ مَالِكٍ الْجُهَنِيِّ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ (عليه السلام) يَا مَالِكُ أَ مَا تَرْضَوْنَ أَنْ تُقِيمُوا الصَّلَاةَ وَ تُؤْتُوا الزَّكَاةَ وَ تَكُفُّوا وَ تَدْخُلُوا الْجَنَّةَ يَا مَالِكُ إِنَّهُ لَيْسَ مِنْ قَوْمٍ ائْتَمُّوا بِإِمَامٍ فِي الدُّنْيَا إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ يَلْعَنُهُمْ وَ يَلْعَنُونَهُ إِلَّا أَنْتُمْ وَ مَنْ كَانَ عَلَى مِثْلِ حَالِكُمْ يَا مَالِكُ إِنَّ الْمَيِّتَ وَ اللَّهِ مِنْكُمْ عَلَى هَذَا الْأَمْرِ لَشَهِيدٌ بِمَنْزِلَةِ الضَّارِبِ بِسَيْفِهِ فِي سَبِيلِ اللَّهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473240\">H 14570</a> – From him, from Ibn Muskaan, from maalik Al-Juhny who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said to me: ‘O Maalik! Will you not be happy that you establish the Prayer, and you give the Zakaat, and you restrain yourself, and you enter the Paradise? O Maalik! There is none from the people who followed the imam in the world except that he (their imam) will come on the Day of Judgement cursing them and they would be cursing him except for you and the one who is similar to your condition. O Maalik! By Allah<sup>azwj</sup>, the dead ones from among you who were upon this matter (Al-Wilayah) is a martyr of the status of the striker with his sword in the Way of Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "122. From him, from Ibn Muskaan, from maalik Al-Juhny who said: Abu Abdullah (a.s.) said to me: ‘O Maalik! Will you not be happy that you establish the Prayer, and you give the Zakaat, and you restrain yourself, and you enter the Paradise? O Maalik! There is none from the people who followed the imam in the world except that he (their imam) will come on the Day of Judgement cursing them and they would be cursing him except for you and the one who is similar to your condition. O Maalik! By Allah (azwj), the dead ones from among you who were upon this matter (Al-Wilayah) is a martyr of the status of the striker with his sword in the Way of Allah (azwj)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 355)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14807,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:33:16",
        "text": [
          "14571- يَحْيَى الْحَلَبِيُّ عَنْ بَشِيرٍ الْكُنَاسِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ وَصَلْتُمْ وَ قَطَعَ النَّاسُ وَ أَحْبَبْتُمْ وَ أَبْغَضَ النَّاسُ وَ عَرَفْتُمْ وَ أَنْكَرَ النَّاسُ وَ هُوَ الْحَقُّ إِنَّ اللَّهَ اتَّخَذَ مُحَمَّداً (صلى الله عليه وآله) عَبْداً قَبْلَ أَنْ يَتَّخِذَهُ نَبِيّاً وَ إِنَّ عَلِيّاً (عليه السلام) كَانَ عَبْداً نَاصِحاً لِلَّهِ عَزَّ وَ جَلَّ فَنَصَحَهُ وَ أَحَبَّ اللَّهَ عَزَّ وَ جَلَّ فَأَحَبَّهُ ",
          "إِنَّ حَقَّنَا فِي كِتَابِ اللَّهِ بَيِّنٌ لَنَا صَفْوُ الْأَمْوَالِ وَ لَنَا الْأَنْفَالُ وَ إِنَّا قَوْمٌ فَرَضَ اللَّهُ عَزَّ وَ جَلَّ طَاعَتَنَا وَ إِنَّكُمْ تَأْتَمُّونَ بِمَنْ لَا يُعْذَرُ النَّاسُ بِجَهَالَتِهِ وَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) مَنْ مَاتَ وَ لَيْسَ لَهُ إِمَامٌ مَاتَ مِيتَةً جَاهِلِيَّةً عَلَيْكُمْ بِالطَّاعَةِ فَقَدْ رَأَيْتُمْ أَصْحَابَ عَلِيٍّ (عليه السلام) ",
          "ثُمَّ قَالَ إِنَّ رَسُولَ اللَّهِ (صلى الله عليه وآله) قَالَ فِي مَرَضِهِ الَّذِي تُوُفِّيَ فِيهِ ادْعُوا لِي خَلِيلِي فَأَرْسَلَتَا إِلَى أَبَوَيْهِمَا فَلَمَّا جَاءَا أَعْرَضَ بِوَجْهِهِ ثُمَّ قَالَ ادْعُوا لِي خَلِيلِي فَقَالَا قَدْ رَآنَا لَوْ أَرَادَنَا لَكَلَّمَنَا فَأَرْسَلَتَا إِلَى عَلِيٍّ (عليه السلام) فَلَمَّا جَاءَ أَكَبَّ عَلَيْهِ يُحَدِّثُهُ وَ يُحَدِّثُهُ حَتَّى إِذَا فَرَغَ لَقِيَاهُ فَقَالَا مَا حَدَّثَكَ فَقَالَ حَدَّثَنِي بِأَلْفِ بَابٍ مِنَ الْعِلْمِ يُفْتَحُ كُلُّ بَابٍ إِلَى أَلْفِ بَابٍ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473241\">H 14571</a> – Yahya Al-Halby, from Basheer Al-Kunasy who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘You have maintained relations whilst the people have cut-off, and you loved whilst the people hated (you), and you recognised whilst the people denied, and it is the ‘الْحَقُّ’ Just. Allah<sup>azwj</sup> Took Muhammad<sup>saw</sup><sup>w</sup> to be a servant before He<sup>azwj</sup> Took him<sup>saww</sup> as a Prophet, and that Ali<sup>asws</sup> used to be a servant, and advisor for the Sake of Allah<sup>zwj</sup> Mighty and Majestic. So he<sup>asws</sup> was blessed and Allah<sup>azwj</sup> Mighty and Majestic Loved him<sup>asws</sup>, and he<sup>asws</sup> loved Him<sup>azwj</sup>.",
            "Surely, our<sup>asws</sup> Rights in the Book of Allah<sup>azwj</sup> are clear. For us<sup>asws</sup> is the clean wealth, and for us<sup>asws</sup> is the Spoils of war (Al-Anfaal- Khums), and that Allah<sup>azwj</sup> Mighty and Majestic has Obligated the people to be obedient to us<sup>asws</sup>, since you follow but the people have no excuse for their ignorance. And the Rasool Allah<sup>saww</sup> said: ‘The one who dies and he has no Imam for him has died the death of a pagan. So it is upon you to obey, and you have seen the companions of Ali<sup>asws</sup>. ",
            "Then he<sup>asws</sup> said: ‘The Rasool Allah<sup>saww</sup> said during his illness in which he<sup>saww</sup> passed away: ‘Call my<sup>saww</sup> friend for me<sup>saww</sup>!’. So two (females) sent for their respective fathers, but when they came, he<sup>saww</sup> turned his<sup>saww</sup> face away, then said: ‘Call my<sup>s</sup><sup>aww</sup> friend for me<sup>saww</sup>!’ They (two fathers) said, ‘He<sup>saww</sup> would have looked at us had he<sup>saww</sup> intended to speak to us’. So they sent for Ali<sup>asws</sup>. So when he<sup>asws</sup> came, he<sup>asws</sup> leaned across towards him<sup>saww</sup>, and he<sup>saww</sup> narrated to him<sup>asws</sup>, and narrated to him<sup>asws</sup> until he was free from it. So (the two fathers) met him<sup>asws</sup> and said, ‘What did he<sup>saww</sup> narrated to you<sup>asws</sup>?’ He<sup>asws</sup> said: ‘He<sup>saww</sup> narrated to me<sup>asws</sup> by a thousand doors of the knowledge, each door of which opens to a (further) thousand doors’."
          ],
          "en.sarwar": [
            "123. Yahya Al-Halby, from Basheer Al-Kunasy who said: ‘I heard Abu Abdullah (a.s.) saying: ‘You have maintained relations whilst the people have cut-off, and you loved whilst the people hated (you), and you recognised whilst the people denied, and it is the ‘الْحَقُّ’ Just. Allah (azwj) Took Muhammad (saww) to be a servant before He (azwj) Took him (saww) as a Prophet, and that Ali (a.s.) used to be a servant, and advisor for the Sake of Allah (zwj) Mighty and Majestic. So he (a.s.) was blessed and Allah (azwj) Mighty and Majestic Loved him (a.s.), and he (a.s.) loved Him (azwj). Surely, our (a.s.) Rights in the Book of Allah (azwj) are clear. For us (a.s.) is the clean wealth, and for us (a.s.) is the Spoils of war (Al-Anfaal- Khums), and that Allah (azwj) Mighty and Majestic has Obligated the people to be obedient to us (a.s.), since you follow but the people have no excuse for their ignorance. And the Rasool Allah (saww) said: ‘The one who dies and he has no Imam for him has died the death of a pagan. So it is upon you to obey, and you have seen the companions of Ali (a.s.). Then he (a.s.) said: ‘The Rasool Allah (saww) said during his illness in which he (saww) passed away: ‘Call my (saww) friend for me (saww)!’. So two (females) sent for their respective fathers, but when they came, he (saww) turned his (saww) face away, then said: ‘Call my (saww) friend for me (saww)!’ They (two fathers) said, ‘He (saww) would have looked at us had he (saww) intended to speak to us’. So they sent for Ali (a.s.). So when he (a.s.) came, he (a.s.) leaned across towards him (saww), and he (saww) narrated to him (a.s.), and narrated to him (a.s.) until he was free from it. So (the two fathers) met him (a.s.) and said, ‘What did he (saww) narrated to you (a.s.)?’ He (a.s.) said: ‘He (saww) narrated to me (a.s.) by a thousand doors of the knowledge, each door of which opens to a (further) thousand doors’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 356)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14808,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:33:17",
        "text": [
          "14572- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْهَيْثَمِ بْنِ أَبِي مَسْرُوقٍ النَّهْدِيِّ عَنْ مُوسَى بْنِ عُمَرَ بْنِ بَزِيعٍ قَالَ قُلْتُ لِلرِّضَا (عليه السلام) إِنَّ النَّاسَ رَوَوْا أَنَّ رَسُولَ اللَّهِ (صلى الله عليه وآله) كَانَ إِذَا أَخَذَ فِي طَرِيقٍ رَجَعَ فِي غَيْرِهِ فَهَكَذَا كَانَ يَفْعَلُ قَالَ فَقَالَ نَعَمْ فَأَنَا أَفْعَلُهُ كَثِيراً فَافْعَلْهُ ثُمَّ قَالَ لِي أَمَا إِنَّهُ أَرْزَقُ لَكَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473242\">H 14572</a> – A number of our companions, from Sahl Bin Ziyad, from Al-Haysam Bin Abu Masrouq Al-Nahdy, from Musa Bin Umar Bin Bazi’e who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> said to Al-Reza</span><sup>asws</sup> that, ‘The people are reporting that the Rasool Allah<sup>saww</sup>, whenever he<sup>saww</sup> used to take to a road, would return via another road. So this is what he<sup>saww</sup> used to do’. He<sup>asws</sup> said: ‘Yes, as I<sup>asws</sup> do so quite frequently, so do it’. Then he<sup>asws</sup> said to me: ‘But rather, it is better for your sustenance’."
          ],
          "en.sarwar": [
            "124. A number of our companions, from Sahl Bin Ziyad, from Al-Haysam Bin Abu Masrouq Al-Nahdy, from Musa Bin Umar Bin Bazi’e who said: ‘I said to Al-Ridha (a.s.) that, ‘The people are reporting that the Rasool Allah (saww), whenever he (saww) used to take to a road, would return via another road. So this is what he (saww) used to do’. He (a.s.) said: ‘Yes, as I (a.s.) do so quite frequently, so do it’. Then he (a.s.) said to me: ‘But rather, it is better for your sustenance’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 356)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14809,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:33:18",
        "relations": {
          "Mentions": [
            "/books/quran:24:19"
          ]
        },
        "text": [
          "14573- سَهْلُ بْنُ زِيَادٍ عَنْ يَحْيَى بْنِ الْمُبَارَكِ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الْحَسَنِ الْأَوَّلِ (عليه السلام) قَالَ قُلْتُ لَهُ جُعِلْتُ فِدَاكَ الرَّجُلُ مِنْ إِخْوَانِي يَبْلُغُنِي عَنْهُ الشَّيْ‏ءُ الَّذِي أَكْرَهُهُ فَأَسْأَلُهُ عَنْ ذَلِكَ فَيُنْكِرُ ذَلِكَ وَ قَدْ أَخْبَرَنِي عَنْهُ قَوْمٌ ثِقَاتٌ فَقَالَ لِي يَا مُحَمَّدُ كَذِّبْ سَمْعَكَ وَ بَصَرَكَ عَنْ أَخِيكَ فَإِنْ شَهِدَ عِنْدَكَ خَمْسُونَ قَسَامَةً وَ قَالَ لَكَ قَوْلًا فَصَدِّقْهُ وَ كَذِّبْهُمْ لَا تُذِيعَنَّ عَلَيْهِ شَيْئاً تَشِينُهُ بِهِ وَ تَهْدِمُ بِهِ مُرُوءَتَهُ فَتَكُونَ مِنَ الَّذِينَ قَالَ اللَّهُ فِي كِتَابِهِ إِنَّ الَّذِينَ يُحِبُّونَ أَنْ تَشِيعَ الْفاحِشَةُ فِي الَّذِينَ آمَنُوا لَهُمْ عَذابٌ أَلِيمٌ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473243\">H 14573</a> – Sahl Bin Ziyad, from Yahya Bin Al-Mubarak, from Abdullah Bin Jabalat, from Muhammad Bin Al-Fazeyl, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Al-Hassan the First</span><sup>asws</sup> replied, when I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>, (its about) a man from our brethren, a matter has reached me about him which I dislike, so I ask about that but he denies that, and it has been informed to me from reliable people’. He<sup>asws</sup> said to me: ‘O Muhammad, deny your hearing and your vision about your brother even though fifty have testified in your presence under oath, and if he says something to you, so ratify him and belie them. Do not publicise anything against him which would disgrace him and destroy his magnanimity, for you will become those for whom Allah<sup>azwj</sup> has Said in His<sup>azwj</sup> Book: <span class=\"ibTxt\">“<a href=\"/#/books/quran:24#h19\">[24:19]</a> Surely (as for) those who love that scandal should circulate respecting those who believe, they shall have a grievous chastisement in this world and the hereafter; and Allah knows, while you do not know”</span>.",
            "out of 567"
          ],
          "en.sarwar": [
            "125. Sahl Bin Ziyad, from Yahya Bin Al-Mubarak, from Abdullah Bin Jabalat, from Muhammad Bin Al-Fazeyl, who has narrated the following: Abu Al-Hassan the First (a.s.) replied, when I said to him (a.s.), ‘May I be sacrificed for you (a.s.), (its about) a man from our brethren, a matter has reached me about him which I dislike, so I ask about that but he denies that, and it has been informed to me from reliable people’. He (a.s.) said to me: ‘O Muhammad, deny your hearing and your vision about your brother even though fifty have testified in your presence under oath, and if he says something to you, so ratify him and belie them. Do not publicise anything against him which would disgrace him and destroy his magnanimity, for you will become those for whom Allah (azwj) has Said in His (azwj) Book: “<a href=\"/#/books/quran:24#h19\">[24:19]</a> Surely (as for) those who love that scandal should circulate respecting those who believe, they shall have a grievous chastisement in this world and the hereafter; and Allah knows, while you do not know”."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:33",
  "kind": "verse_list"
}