{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 34"
        },
        "path": "/books/al-kafi:8:1:34",
        "titles": {
          "ar": "حَدِيثُ مَنْ وُلِدَ فِي الْإِسْلَامِ",
          "en": "HADEETH ABOUT THE ONE WHO IS BORN IN AL-ISLAM"
        }
      }
    ],
    "index": 2305,
    "local_index": 34,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 35"
        },
        "path": "/books/al-kafi:8:1:35",
        "titles": {
          "ar": "حَدِيثُ زَيْنَبَ الْعَطَّارَةِ",
          "en": "HADEETH OF ZAYNAB THE PERFUME SELLER"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 33"
        },
        "path": "/books/al-kafi:8:1:33",
        "titles": {
          "ar": "حَدِيثُ مُحَاسَبَةِ النَّفْسِ",
          "en": "HADEETH OF SELF-ACCOUNTING"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:34",
    "titles": {
      "ar": "حَدِيثُ مَنْ وُلِدَ فِي الْإِسْلَامِ",
      "en": "HADEETH ABOUT THE ONE WHO IS BORN IN AL-ISLAM"
    },
    "verse_count": 17,
    "verse_start_index": 14809,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 357)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14810,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "14574- "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1052",
              "text": "سَهْلُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/115",
              "text": "يَعْقُوبَ بْنِ يَزِيدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4663",
              "text": "عَبْدِ رَبِّهِ بْنِ رَافِعٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4664",
              "text": "الْحُبَابِ بْنِ مُوسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4637",
              "text": "أَبِي جَعْفَرٍ (عليه السلام)"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "14574- سَهْلُ بْنُ زِيَادٍ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنْ عَبْدِ رَبِّهِ بْنِ رَافِعٍ عَنِ الْحُبَابِ بْنِ مُوسَى عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:34:1",
        "text": [
          " مَنْ وُلِدَ فِي الْإِسْلَامِ حُرّاً فَهُوَ عَرَبِيٌّ وَ مَنْ كَانَ لَهُ عَهْدٌ فَخُفِرَ فِي عَهْدِهِ فَهُوَ مَوْلًى لِرَسُولِ اللَّهِ (صلى الله عليه وآله) وَ مَنْ دَخَلَ فِي الْإِسْلَامِ طَوْعاً فَهُوَ مُهَاجِرٌ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473245\">H 14574</a> – Sahl Bin Ziyad, from Yaqoub Bin Yazeed, from Abdu Rabbahu Bin Raf’e Al-Hubaab Bin Musa, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> said: ‘The one born in Al-Islam as a free person, so he is an Arab, and the one who had a treaty for him and he kept to it, so he is a slave of the Rasool Allah<sup>saww</sup>, and the one who entered in Al-Islam willingly, so he is an emigrant’."
          ],
          "en.sarwar": [
            "126. Sahl Bin Ziyad, from Yaqoub Bin Yazeed, from Abdu Rabbahu Bin Raf’e Al-Hubaab Bin Musa, who has narrated the following: Abu Ja’far (a.s.) said: ‘The one born in Al-Islam as a free person, so he is an Arab, and the one who had a treaty for him and he kept to it, so he is a slave of the Rasool Allah (saww), and the one who entered in Al-Islam willingly, so he is an emigrant’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 358)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14811,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "14575- "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/277",
              "text": "هَارُونَ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/278",
              "text": "مَسْعَدَةَ بْنِ صَدَقَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4633",
              "text": "أَبِي عَبْدِ اللَّهِ (عليه السلام)"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "14575- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:34:2",
        "text": [
          " قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) مَنْ أَصْبَحَ وَ أَمْسَى وَ عِنْدَهُ ثَلَاثٌ فَقَدْ تَمَّتْ عَلَيْهِ النِّعْمَةُ فِي الدُّنْيَا مَنْ أَصْبَحَ وَ أَمْسَى مُعَافًى فِي بَدَنِهِ آمِناً فِي سَرْبِهِ عِنْدَهُ قُوتُ يَوْمِهِ فَإِنْ كَانَتْ عِنْدَهُ الرَّابِعَةُ فَقَدْ تَمَّتْ عَلَيْهِ النِّعْمَةُ فِي الدُّنْيَا وَ الْآخِرَةِ وَ هُوَ الْإِسْلَامُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473246\">H 14575</a> – Ali Bin Ibrahim, from Haroun Bin Muslim, from Mas’adat Bin Sadaqa, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said that: ‘The Rasool Allah<sup>saww</sup> said: ‘The one who goes through his mornings and evenings whilst having three things, so the bounties of the world are complete for him - the one who goes through his mornings and evenings with good physical health, security in his flock, and has his day’s provisions in his possession. So if he were to have the fourth, so the bounties in the world and the Hereafter would be complete for him, and it is Al-Islam’."
          ],
          "en.sarwar": [
            "127. Ali Bin Ibrahim, from Haroun Bin Muslim, from Mas’adat Bin Sadaqa, who has narrated the following: Abu Abdullah (a.s.) having said that: ‘The Rasool Allah (saww) said: ‘The one who goes through his mornings and evenings whilst having three things, so the bounties of the world are complete for him - the one who goes through his mornings and evenings with good physical health, security in his flock, and has his day’s provisions in his possession. So if he were to have the fourth, so the bounties in the world and the Hereafter would be complete for him, and it is Al-Islam’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 358)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14812,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "14576- "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/277",
              "text": "هَارُونَ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1051",
              "text": "مَسْعَدَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4665",
              "text": "أَبِي عَبْدِ اللَّهِ (عليه السلام) [عَنْ أَبِيهِ ع]"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "14576- عَنْهُ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) [عَنْ أَبِيهِ ع] أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:34:3",
        "text": [
          "هُ قَالَ لِرَجُلٍ وَ قَدْ كَلَّمَهُ بِكَلَامٍ كَثِيرٍ فَقَالَ أَيُّهَا الرَّجُلُ تَحْتَقِرُ الْكَلَامَ وَ تَسْتَصْغِرُهُ اعْلَمْ أَنَّ اللَّهَ عَزَّ وَ جَلَّ لَمْ يَبْعَثْ رُسُلَهُ حَيْثُ بَعَثَهَا وَ مَعَهَا ذَهَبٌ وَ لَا فِضَّةٌ وَ لَكِنْ بَعَثَهَا بِالْكَلَامِ وَ إِنَّمَا عَرَّفَ اللَّهُ جَلَّ وَ عَزَّ نَفْسَهُ إِلَى خَلْقِهِ بِالْكَلَامِ وَ الدَّلَالَاتِ عَلَيْهِ وَ الْأَعْلَامِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473247\">H 14576</a> – From him, from Haroun Bin Muslim, from Mas’ada, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup>, from his<sup>asws</sup> father<sup>asws</sup> having said to a man who spoke to him by a lengthy speech, so he<sup>asws</sup> said: ‘O you man who belittles the speech, and considers knowledge to be insignificant, know that Allah<sup>azwj</sup> did not Send His<sup>azwj</sup> Rasool<sup>as</sup> along with gold and silver, but He<sup>azwj</sup> Sent him<sup>saww</sup> by the speech. But rather, Allah<sup>azwj</sup> Majestic and Mighty Made Himself<sup>azwj</sup> Recognised to the creatures by the speech, and the evidence (pointing) towards Him<sup>azwj</sup>, and the Signs’."
          ],
          "en.sarwar": [
            "128. From him, from Haroun Bin Muslim, from Mas’ada, who has narrated the following: Abu Abdullah (a.s.), from his (a.s.) father (a.s.) having said to a man who spoke to him by a lengthy speech, so he (a.s.) said: ‘O you man who belittles the speech, and considers knowledge to be insignificant, know that Allah (azwj) did not Send His (azwj) Rasool (as) along with gold and silver, but He (azwj) Sent him (saww) by the speech. But rather, Allah (azwj) Majestic and Mighty Made Himself (azwj) Recognised to the creatures by the speech, and the evidence (pointing) towards Him (azwj), and the Signs’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 359)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14813,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "14577- وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "بِهَذَا الْإِسْنَادِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "14577- وَ بِهَذَا الْإِسْنَادِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:34:4",
        "text": [
          " قَالَ النَّبِيُّ (صلى الله عليه وآله) مَا خَلَقَ اللَّهُ جَلَّ وَ عَزَّ خَلْقاً إِلَّا وَ قَدْ أَمَّرَ عَلَيْهِ آخَرَ يَغْلِبُهُ فِيهِ وَ ذَلِكَ أَنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى لَمَّا خَلَقَ الْبِحَارَ السُّفْلَى فَخَرَتْ وَ زَخَرَتْ وَ قَالَتْ أَيُّ شَيْ‏ءٍ يَغْلِبُنِي فَخَلَقَ الْأَرْضَ فَسَطَحَهَا عَلَى ظَهْرِهَا فَذَلَّتْ ",
          "ثُمَّ قَالَ إِنَّ الْأَرْضَ فَخَرَتْ وَ قَالَتْ أَيُّ شَيْ‏ءٍ يَغْلِبُنِي فَخَلَقَ الْجِبَالَ فَأَثْبَتَهَا عَلَى ظَهْرِهَا أَوْتَاداً مِنْ أَنْ تَمِيدَ بِمَا عَلَيْهَا فَذَلَّتِ الْأَرْضُ وَ اسْتَقَرَّتْ ثُمَّ إِنَّ الْجِبَالَ فَخَرَتْ عَلَى الْأَرْضِ فَشَمَخَتْ وَ اسْتَطَالَتْ وَ قَالَتْ أَيُّ شَيْ‏ءٍ يَغْلِبُنِي فَخَلَقَ الْحَدِيدَ فَقَطَعَهَا فَقَرَّتِ الْجِبَالُ وَ ذَلَّتْ ثُمَّ إِنَّ الْحَدِيدَ فَخَرَتْ عَلَى الْجِبَالِ وَ قَالَ أَيُّ شَيْ‏ءٍ يَغْلِبُنِي فَخَلَقَ النَّارَ فَأَذَابَتِ الْحَدِيدَ فَذَلَّ الْحَدِيدُ ",
          "ثُمَّ إِنَّ النَّارَ زَفَرَتْ وَ شَهَقَتْ وَ فَخَرَتْ وَ قَالَتْ أَيُّ شَيْ‏ءٍ يَغْلِبُنِي فَخَلَقَ الْمَاءَ فَأَطْفَأَهَا فَذَلَّتْ ثُمَّ إِنَّ الْمَاءَ فَخَرَ وَ زَخَرَ وَ قَالَ أَيُّ شَيْ‏ءٍ يَغْلِبُنِي فَخَلَقَ الرِّيحَ فَحَرَّكَتْ أَمْوَاجَهُ وَ أَثَارَتْ مَا فِي قَعْرِهِ وَ حَبَسَتْهُ عَنْ مَجَارِيهِ فَذَلَّ الْمَاءُ ثُمَّ إِنَّ الرِّيحَ فَخَرَتْ وَ عَصَفَتْ وَ أَرْخَتْ أَذْيَالَهَا وَ قَالَتْ أَيُّ شَيْ‏ءٍ يَغْلِبُنِي فَخَلَقَ الْإِنْسَانَ فَبَنَى وَ احْتَالَ وَ اتَّخَذَ مَا يَسْتَتِرُ بِهِ مِنَ الرِّيحِ وَ غَيْرِهَا فَذَلَّتِ الرِّيحُ ",
          "ثُمَّ إِنَّ الْإِنْسَانَ طَغَى وَ قَالَ مَنْ أَشَدُّ مِنِّي قُوَّةً فَخَلَقَ اللَّهُ لَهُ الْمَوْتَ فَقَهَرَهُ فَذَلَّ الْإِنْسَانُ ثُمَّ إِنَّ الْمَوْتَ فَخَرَ فِي نَفْسِهِ فَقَالَ اللَّهُ عَزَّ وَ جَلَّ لَا تَفْخَرْ فَإِنِّي ذَابِحُكَ بَيْنَ الْفَرِيقَيْنِ أَهْلِ الْجَنَّةِ وَ أَهْلِ النَّارِ ثُمَّ لَا أُحْيِيكَ أَبَداً فَتُرْجَى أَوْ تُخَافَ ",
          "وَ قَالَ أَيْضاً وَ الْحِلْمُ يَغْلِبُ الْغَضَبَ وَ الرَّحْمَةُ تَغْلِبُ السُّخْطَ وَ الصَّدَقَةُ تَغْلِبُ الْخَطِيئَةَ ثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) مَا أَشْبَهَ هَذَا مِمَّا قَدْ يَغْلِبُ غَيْرَهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473248\">H 14577</a> – And by this chain:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-h\">H</span>e</span><sup>asws</sup> said: ‘The Prophet<sup>saww</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic did not Create a creature except that He<sup>azwj</sup> Commanded another one to overcome it, and that Allah<sup>azwj</sup> Blessed and High, when He<sup>azwj</sup> Created the deeper ocean, it prided itself and moved its waves and said, ‘Which thing can overcome me?’ So He<sup>azwj</sup> Created the earth, so it (ocean) surfaced upon its back, and so it became submissive.  ",
            "Then he<sup>asws</sup> said; ‘The earth prided itself and said, ‘Which thing can overcome me?’ So He<sup>azwj</sup> Created the mountains and Established them as pegs upon its back, so stop it from swaying due to what is upon her. So the earth became submissive and stabilised. Then the mountain prided itself over the earth, so it became bigger and taller, and said, ‘Which thing can overcome me?’ So He<sup>azwj</sup> Created the iron which cut it, and so the mountain calmed down and became submissive. Then the iron prided itself over the mountain and said, ‘Which thing can overcome me?’ So He<sup>azwj</sup> Created the Fire which melted it, and so the iron became submissive. ",
            "Then the fire exhaled and gasped (blazed), and prided itself and said, ‘Which thing can overcome me?’ So He<sup>azwj</sup> Created the water which extinguished it, and so it became submissive. Then the water prided itself and overflowed and said, ‘Which thing can overcome me?’ So He<sup>azwj</sup> Created the wind which moved its waves and raised what was in its bottom, and restrained it from its direction, and so the water became submissive. Then the wind prided itself, raged and loosened its tails and said, ‘Which thing can overcome me?’ So He<sup>azwj</sup> Created the human being who built shelters and tricked the wind by veiling himself from it and other, so the wind became humble. ",
            "Then the human being rebelled and said, ‘Who is stronger than me?’ So He<sup>azwj</sup> Created the death for him, which defeated him, and so he became submissive. Then the death prided itself so Allah<sup>azwj</sup> Mighty and Majestic Said: “Do not be proud, for I<sup>azwj</sup> will Slaughter you in between the two sects – the people of the Paradise and the people of the Fire, then I<sup>azwj</sup> will not Revive you ever, whether you return (repent) or you fear”.",
            "And he<sup>asws</sup> also said: ‘And the forbearance overcomes the anger, and the mercy overcomes the harshness, and the charity overcomes the sins’. Then Abu Abdullah<sup>asws</sup> said: ‘There is more like this where one thing overcomes the other’."
          ],
          "en.sarwar": [
            "129. And by this chain: He (a.s.) said: ‘The Prophet (saww) said: ‘Allah (azwj) Mighty and Majestic did not Create a creature except that He (azwj) Commanded another one to overcome it, and that Allah (azwj) Blessed and High, when He (azwj) Created the deeper ocean, it prided itself and moved its waves and said, ‘Which thing can overcome me?’ So He (azwj) Created the earth, so it (ocean) surfaced upon its back, and so it became submissive. Then he (a.s.) said; ‘The earth prided itself and said, ‘Which thing can overcome me?’ So He (azwj) Created the mountains and Established them as pegs upon its back, so stop it from swaying due to what is upon her. So the earth became submissive and stabilised. Then the mountain prided itself over the earth, so it became bigger and taller, and said, ‘Which thing can overcome me?’ So He (azwj) Created the iron which cut it, and so the mountain calmed down and became submissive. Then the iron prided itself over the mountain and said, ‘Which thing can overcome me?’ So He (azwj) Created the Fire which melted it, and so the iron became submissive. Then the fire exhaled and gasped (blazed), and prided itself and said, ‘Which thing can overcome me?’ So He (azwj) Created the water which extinguished it, and so it became submissive. Then the water prided itself and overflowed and said, ‘Which thing can overcome me?’ So He (azwj) Created the wind which moved its waves and raised what was in its bottom, and restrained it from its direction, and so the water became submissive. Then the wind prided itself, raged and loosened its tails and said, ‘Which thing can overcome me?’ So He (azwj) Created the human being who built shelters and tricked the wind by veiling himself from it and other, so the wind became humble. Then the human being rebelled and said, ‘Who is stronger than me?’ So He (azwj) Created the death for him, which defeated him, and so he became submissive. Then the death prided itself so Allah (azwj) Mighty and Majestic Said: “Do not be proud, for I (azwj) will Slaughter you in between the two sects – the people of the Paradise and the people of the Fire, then I (azwj) will not Revive you ever, whether you return (repent) or you fear”. And he (a.s.) also said: ‘And the forbearance overcomes the anger, and the mercy overcomes the harshness, and the charity overcomes the sins’. Then Abu Abdullah (a.s.) said: ‘There is more like this where one thing overcomes the other’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 368)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14814,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "14578- "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/277",
              "text": "هَارُونَ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/278",
              "text": "مَسْعَدَةَ بْنِ صَدَقَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4633",
              "text": "أَبِي عَبْدِ اللَّهِ (عليه السلام)"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "14578- عَنْهُ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:34:5",
        "text": [
          " إِنَّ رَجُلًا أَتَى النَّبِيَّ (صلى الله عليه وآله) فَقَالَ لَهُ يَا رَسُولَ اللَّهِ أَوْصِنِي فَقَالَ لَهُ رَسُولُ اللَّهِ (صلى الله عليه وآله) فَهَلْ أَنْتَ مُسْتَوْصٍ إِنْ أَنَا أَوْصَيْتُكَ حَتَّى قَالَ لَهُ ذَلِكَ ثَلَاثاً وَ فِي كُلِّهَا يَقُولُ لَهُ الرَّجُلُ نَعَمْ يَا رَسُولَ اللَّهِ فَقَالَ لَهُ رَسُولُ اللَّهِ (صلى الله عليه وآله) فَإِنِّي أُوصِيكَ إِذَا أَنْتَ هَمَمْتَ بِأَمْرٍ فَتَدَبَّرْ عَاقِبَتَهُ فَإِنْ يَكُ رُشْداً فَامْضِهِ وَ إِنْ يَكُ غَيّاً فَانْتَهِ عَنْهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473249\">H 14578</a> – From him, from Haroun Bin Muslim, from Mas’ada Bin Sadaqa, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said that: ‘A man came to the Prophet<sup>saww</sup> and said to him<sup>saww</sup>, ‘O Rasool Allah<sup>saww</sup>, advise me’. The Rasool Allah<sup>saww</sup> said to him: ‘So will you follow it if I<sup>saww</sup> give advice to you?’ To the extent that he<sup>saww</sup> said that to him three times, and during each of which the man said to him<sup>saww</sup>, Yes, O Rasool Allah<sup>saww</sup>’. So the Rasool Allah<sup>saww</sup> said to him: ‘So I<sup>saww</sup> hereby advise you that whenever you feel like doing something, ponder over its consequences, for if there is guidance for you, so do it, and if it is a straying for you, so abstain from it’."
          ],
          "en.sarwar": [
            "130. From him, from Haroun Bin Muslim, from Mas’ada Bin Sadaqa, who has narrated the following: Abu Abdullah (a.s.) having said that: ‘A man came to the Prophet (saww) and said to him (saww), ‘O Rasool Allah (saww), advise me’. The Rasool Allah (saww) said to him: ‘So will you follow it if I (saww) give advice to you?’ To the extent that he (saww) said that to him three times, and during each of which the man said to him (saww), Yes, O Rasool Allah (saww)’. So the Rasool Allah (saww) said to him: ‘So I (saww) hereby advise you that whenever you feel like doing something, ponder over its consequences, for if there is guidance for you, so do it, and if it is a straying for you, so abstain from it’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 369)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14815,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "14579- وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "بِهَذَا الْإِسْنَادِ"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "14579- وَ بِهَذَا الْإِسْنَادِ أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:34:6",
        "text": [
          " النَّبِيَّ (صلى الله عليه وآله) قَالَ ارْحَمُوا عَزِيزاً ذَلَّ وَ غَنِيّاً افْتَقَرَ وَ عَالِماً ضَاعَ فِي زَمَانِ جُهَّالٍ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473250\">H 14579</a> – And by this chain, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span>mam</span><sup>asws</sup> said that: ‘The Prophet<sup>saww</sup> said: ‘Be merciful towards a mighty one who has been humbled, and a rich one who has become poor, and a scholar who is wasted in the era of the ignorant ones. "
          ],
          "en.sarwar": [
            "131. And by this chain, who has narrated the following: Imam (a.s.) said that: ‘The Prophet (saww) said: ‘Be merciful towards a mighty one who has been humbled, and a rich one who has become poor, and a scholar who is wasted in the era of the ignorant ones."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 369)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14816,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "14580- وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "بِهَذَا الْإِسْنَادِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "14580- وَ بِهَذَا الْإِسْنَادِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:34:7",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ لِأَصْحَابِهِ يَوْماً لَا تَطْعُنُوا فِي عُيُوبِ مَنْ أَقْبَلَ إِلَيْكُمْ بِمَوَدَّتِهِ وَ لَا تُوَقِّفُوهُ عَلَى سَيِّئَةٍ يَخْضَعُ لَهَا فَإِنَّهَا لَيْسَتْ مِنْ أَخْلَاقِ رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ لَا مِنْ أَخْلَاقِ أَوْلِيَائِهِ ",
          "قَالَ وَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) إِنَّ خَيْرَ مَا وَرَّثَ الْآبَاءُ لِأَبْنَائِهِمُ الْأَدَبُ لَا الْمَالُ فَإِنَّ الْمَالَ يَذْهَبُ وَ الْأَدَبَ يَبْقَى قَالَ مَسْعَدَةُ يَعْنِي بِالْأَدَبِ الْعِلْمَ ",
          "قَالَ وَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) إِنْ أُجِّلْتَ فِي عُمُرِكَ يَوْمَيْنِ فَاجْعَلْ أَحَدَهُمَا لِأَدَبِكَ لِتَسْتَعِينَ بِهِ عَلَى يَوْمِ مَوْتِكَ فَقِيلَ لَهُ وَ مَا تِلْكَ الِاسْتِعَانَةُ قَالَ تُحْسِنُ تَدْبِيرَ مَا تُخَلِّفُ وَ تُحْكِمُهُ ",
          "قَالَ وَ كَتَبَ أَبُو عَبْدِ اللَّهِ (عليه السلام) إِلَى رَجُلٍ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ أَمَّا بَعْدُ فَإِنَّ الْمُنَافِقَ لَا يَرْغَبُ فِيمَا قَدْ سَعِدَ بِهِ الْمُؤْمِنُونَ وَ السَّعِيدُ يَتَّعِظُ بِمَوْعِظَةِ التَّقْوَى وَ إِنْ كَانَ يُرَادُ بِالْمَوْعِظَةِ غَيْرُهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473251\">H 14580</a> – And by this chain, he said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying to his<sup>asws</sup> companions one day: ‘Do not find faults with the one who comes to you with his cordiality, and do not let him remain upon the sins which he is indulging in, for it is not from the morals of the Rasool Allah<sup>saww</sup>, nor is it from the morals of his<sup>asws</sup> friends. ",
            "He (the narrator) said, ‘And Abu Abdullah<sup>asws</sup> said: ‘The best inheritance which the fathers can leave for their children is the etiquettes (discipline) and not the wealth, for the wealth goes away whilst the discipline remains’. Mas’adat (the narrator) said, ‘What is meant by the discipline is the knowledge’. ",
            "He (the narrator) said, ‘Abu Abdullah<sup>asws</sup> said: ‘If there are two days left from your life, so make one of them for your manners to seek help for the day of your death’. So it was said to him<sup>asws</sup>, ‘And what is that which is the help?’ He<sup>asws</sup> said: ‘Good management of what you leave behind and what you order for’.",
            "He (the narrator) said, ‘And Abu Abdullah<sup>asws</sup> wrote to a man: ‘In the Name of Allah<sup>azwj</sup> the Beneficent, the Merciful. Having said that, so the hypocrite does not like that which makes the Believers to be happy, and the happy one is he who heeds the advice of the piety, even if the advice is meant for the others’."
          ],
          "en.sarwar": [
            "132. And by this chain, he said: I heard Abu Abdullah (a.s.) saying to his (a.s.) companions one day: ‘Do not find faults with the one who comes to you with his cordiality, and do not let him remain upon the sins which he is indulging in, for it is not from the morals of the Rasool Allah (saww), nor is it from the morals of his (a.s.) friends. He (the narrator) said, ‘And Abu Abdullah (a.s.) said: ‘The best inheritance which the fathers can leave for their children is the etiquettes (discipline) and not the wealth, for the wealth goes away whilst the discipline remains’. Mas’adat (the narrator) said, ‘What is meant by the discipline is the knowledge’. He (the narrator) said, ‘Abu Abdullah (a.s.) said: ‘If there are two days left from your life, so make one of them for your manners to seek help for the day of your death’. So it was said to him (a.s.), ‘And what is that which is the help?’ He (a.s.) said: ‘Good management of what you leave behind and what you order for’. He (the narrator) said, ‘And Abu Abdullah (a.s.) wrote to a man: ‘In the Name of Allah (azwj) the Beneficent, the Merciful. Having said that, so the hypocrite does not like that which makes the Believers to be happy, and the happy one is he who heeds the advice of the piety, even if the advice is meant for the others’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 370)"
        ],
        "index": 14817,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "14581- "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/89",
              "text": "عَلِيِّ بْنِ أَسْبَاطٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "14581- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:34:8",
        "text": [
          " أَخْبَرَنِي بَعْضُ أَصْحَابِنَا عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قَالَ أَبُو جَعْفَرٍ (عليه السلام) يَا ابْنَ مُسْلِمٍ النَّاسُ أَهْلُ رِيَاءٍ غَيْرَكُمْ وَ ذَلِكُمْ أَنَّكُمْ أَخْفَيْتُمْ مَا يُحِبُّ اللَّهُ عَزَّ وَ جَلَّ وَ أَظْهَرْتُمْ مَا يُحِبُّ النَّاسُ وَ النَّاسُ أَظْهَرُوا مَا يُسْخِطُ اللَّهَ عَزَّ وَ جَلَّ وَ أَخْفَوْا مَا يُحِبُّهُ اللَّهُ يَا ابْنَ مُسْلِمٍ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى رَأَفَ بِكُمْ فَجَعَلَ الْمُتْعَةَ عِوَضاً لَكُمْ عَنِ الْأَشْرِبَةِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473252\">H 14581</a> – Ali Bin Ibrahim, from his father, from Ali Bin Asbaat who said, ‘Informed me, some of our companions, from Muhammad Bin Muslim who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> said: ‘O Ibn Muslim, the people are show-offs apart from you, and that is what you have concealed what Allah<sup>azwj</sup> Mighty and Majestic Loves, and have displayed what the people love, whilst the people have displayed what Allah<sup>azwj</sup> Mighty and Majestic is Angered by, and concealed what Allah<sup>azwj</sup> Loves. O Ibn Muslim, Allah<sup>azwj</sup> Blessed and High Sympathised with you, so He<sup>azwj</sup> Made the Mut’a (Temporary marriage) (Permissible) instead of the (intoxicating) drinks’."
          ],
          "en.sarwar": [
            "133. Ali Bin Ibrahim, from his father, from Ali Bin Asbaat who said, ‘Informed me, some of our companions, from Muhammad Bin Muslim who said: Abu Ja’far (a.s.) said: ‘O Ibn Muslim, the people are show-offs apart from you, and that is what you have concealed what Allah (azwj) Mighty and Majestic Loves, and have displayed what the people love, whilst the people have displayed what Allah (azwj) Mighty and Majestic is Angered by, and concealed what Allah (azwj) Loves. O Ibn Muslim, Allah (azwj) Blessed and High Sympathised with you, so He (azwj) Made the Mut’a (Temporary marriage) (Permissible) instead of the (intoxicating) drinks’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 371)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14818,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "14582- "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/593",
              "text": "مُعَمَّرِ بْنِ خَلَّادٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "14582- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُعَمَّرِ بْنِ خَلَّادٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:34:9",
        "text": [
          " قَالَ لِي أَبُو الْحَسَنِ الرِّضَا (عليه السلام) قَالَ لِيَ الْمَأْمُونُ يَا أَبَا الْحَسَنِ لَوْ كَتَبْتَ إِلَى بَعْضِ مَنْ يُطِيعُكَ فِي هَذِهِ النَّوَاحِي الَّتِي قَدْ فَسَدَتْ عَلَيْنَا قَالَ قُلْتُ لَهُ يَا أَمِيرَ الْمُؤْمِنِينَ إِنْ وَفَيْتَ لِي وَفَيْتُ لَكَ إِنَّمَا دَخَلْتُ فِي هَذَا الْأَمْرِ الَّذِي دَخَلْتُ فِيهِ عَلَى أَنْ لَا آمُرَ وَ لَا أَنْهَى وَ لَا أُوَلِّيَ وَ لَا أَعْزِلَ وَ مَا زَادَنِي هَذَا الْأَمْرُ الَّذِي دَخَلْتُ فِيهِ فِي النِّعْمَةِ عِنْدِي شَيْئاً ",
          "وَ لَقَدْ كُنْتُ بِالْمَدِينَةِ وَ كِتَابِي يَنْفُذُ فِي الْمَشْرِقِ وَ الْمَغْرِبِ وَ لَقَدْ كُنْتُ أَرْكَبُ حِمَارِي وَ أَمُرُّ فِي سِكَكِ الْمَدِينَةِ وَ مَا بِهَا أَعَزُّ مِنِّي وَ مَا كَانَ بِهَا أَحَدٌ مِنْهُمْ يَسْأَلُنِي حَاجَةً يُمْكِنُنِي قَضَاؤُهَا لَهُ إِلَّا قَضَيْتُهَا لَهُ قَالَ فَقَالَ لِي أَفِي لَكَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473253\">H 14582</a> – A number of our companions, from Sahl Bin Ziyad, from Muammar Bin Khallaad who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Al-Hassan Al-Reza</span><sup>asws</sup> said to me: ‘Al-Ma’moun said to me<sup>asws</sup>, ‘O Abu Al-Hassan<sup>asws</sup>, if you<sup>asws</sup> could write to some of the ones who are obedient to you<sup>asws</sup> in these areas in which their relationship with us is spoilt’. I<sup>asws</sup> said to him: ‘O Chief of believers, if you fulfil (your commitment) to me<sup>asws</sup>, I<sup>asws</sup> would (fulfil my<sup>asws</sup> commitment) to you, but rather, I<sup>asws</sup> have entered into this matter in which I<sup>asws</sup> have been entered into, I<sup>asws</sup> do not issue commands, nor do I<sup>asws</sup> prohibit, nor do I<sup>asws</sup> appoint anyone, nor do I<sup>asws</sup> dismiss anyone, and this matter which I<sup>asws</sup> have entered into has not increased anything for me<sup>asws</sup> regarding the favours. ",
            "And I<sup>asws</sup> used to be in Al-Medina, and my<sup>asws</sup> letter would be established in the east and the west, and I<sup>asws</sup> would ride upon my<sup>asws</sup> mule and pass by in the markets of Al-Medina, and there would be no one more prestigious than me<sup>asws</sup>, and there was none among them who would question me<sup>asws</sup> for a need with the possibility of my<sup>asws</sup> fulfilling it, except that I<sup>asws</sup> would fulfill it for him’. He said, ‘I will fulfill (my commitment) to you<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "134. A number of our companions, from Sahl Bin Ziyad, from Muammar Bin Khallaad who said: Abu Al-Hassan Al-Ridha (a.s.) said to me: ‘Al-Ma’moun said to me (a.s.), ‘O Abu Al-Hassan (a.s.), if you (a.s.) could write to some of the ones who are obedient to you (a.s.) in these areas in which their relationship with us is spoilt’. I (a.s.) said to him: ‘O Chief of believers, if you fulfil (your commitment) to me (a.s.), I (a.s.) would (fulfil my (a.s.) commitment) to you, but rather, I (a.s.) have entered into this matter in which I (a.s.) have been entered into, I (a.s.) do not issue commands, nor do I (a.s.) prohibit, nor do I (a.s.) appoint anyone, nor do I (a.s.) dismiss anyone, and this matter which I (a.s.) have entered into has not increased anything for me (a.s.) regarding the favours. And I (a.s.) used to be in Al-Medina, and my (a.s.) letter would be established in the east and the west, and I (a.s.) would ride upon my (a.s.) mule and pass by in the markets of Al-Medina, and there would be no one more prestigious than me (a.s.), and there was none among them who would question me (a.s.) for a need with the possibility of my (a.s.) fulfilling it, except that I (a.s.) would fulfill it for him’. He said, ‘I will fulfill (my commitment) to you (a.s.)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على الشهور</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 371)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14819,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "14583- "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/38",
              "text": "النَّوْفَلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/39",
              "text": "السَّكُونِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3323",
              "text": "أَبِي عَبْدِ اللَّهِ ع"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "14583- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ع قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:34:10",
        "text": [
          " قَالَ النَّبِيُّ (صلى الله عليه وآله) حَقٌّ عَلَى الْمُسْلِمِ إِذَا أَرَادَ سَفَراً أَنْ يُعْلِمَ إِخْوَانَهُ وَ حَقٌّ عَلَى إِخْوَانِهِ إِذَا قَدِمَ أَنْ يَأْتُوهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473254\">H 14583</a> – Ali Bin Ibrahim, from his father, from Al-Nowfaly, from Al-Sakuny, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘The Prophet<sup>saww</sup> said: ‘It is a right upon the Muslim if he intends to travel that he should let his brothers know about it, and it is a right upon his brothers that they should come to him (visit) when he comes back’."
          ],
          "en.sarwar": [
            "135. Ali Bin Ibrahim, from his father, from Al-Nowfaly, from Al-Sakuny, who has narrated the following: Abu Abdullah (a.s.) having said: ‘The Prophet (saww) said: ‘It is a right upon the Muslim if he intends to travel that he should let his brothers know about it, and it is a right upon his brothers that they should come to him (visit) when he comes back’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على الشهور</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 372)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14820,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "14584- وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "بِهَذَا الْإِسْنَادِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "14584- وَ بِهَذَا الْإِسْنَادِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:34:11",
        "text": [
          " قَالَ النَّبِيُّ (صلى الله عليه وآله) خَلَّتَانِ كَثِيرٌ مِنَ النَّاسِ فِيهِمَا مَفْتُونٌ الصِّحَّةُ وَ الْفَرَاغُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473255\">H 14584</a> – And by this chain, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span>mam</span><sup>asws</sup> said: ‘The Prophet<sup>saww</sup> said: ‘There are two qualities which the people are infatuated with – the health and the leisure’."
          ],
          "en.sarwar": [
            "136. And by this chain, who has narrated the following: Imam (a.s.) said: ‘The Prophet (saww) said: ‘There are two qualities which the people are infatuated with – the health and the leisure’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على الشهور</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 372)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14821,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "14585- وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "بِهَذَا الْإِسْنَادِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "14585- وَ بِهَذَا الْإِسْنَادِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:34:12",
        "text": [
          " قَالَ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) مَنْ عَرَّضَ نَفْسَهُ لِلتُّهَمَةِ فَلَا يَلُومَنَّ مَنْ أَسَاءَ بِهِ الظَّنَّ وَ مَنْ كَتَمَ سِرَّهُ كَانَتِ الْخِيَرَةُ فِي يَدِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473256\">H 14585</a> – And by this chain, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span>mam</span><sup>asws</sup> said: ‘Amir-ul-Momineen<sup>asws</sup> said: ‘The one who exposes himself for the accusation, so he should not blame the one who thinks bad about him, and the one who conceals his secret, would have the good in his hands (is secure from that)’."
          ],
          "en.sarwar": [
            "137. And by this chain, who has narrated the following: Imam (a.s.) said: ‘Amir-ul-Momineen (a.s.) said: ‘The one who exposes himself for the accusation, so he should not blame the one who thinks bad about him, and the one who conceals his secret, would have the good in his hands (is secure from that)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 372)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14822,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "14586- "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/145",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/62",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/242",
              "text": "مُحَمَّدِ بْنِ جُمْهُورٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4666",
              "text": "شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4667",
              "text": "أَبِي الْحَسَنِ مُوسَى (عليه السلام)"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "14586- الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ شَاذَانَ عَنْ أَبِي الْحَسَنِ مُوسَى (عليه السلام) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:34:13",
        "text": [
          " قَالَ لِي أَبِي إِنَّ فِي الْجَنَّةِ نَهَراً يُقَالُ لَهُ جَعْفَرٌ عَلَى شَاطِئِهِ الْأَيْمَنِ دُرَّةٌ بَيْضَاءُ فِيهَا أَلْفُ قَصْرٍ فِي كُلِّ قَصْرٍ أَلْفُ قَصْرٍ لِمُحَمَّدٍ وَ آلِ مُحَمَّدٍ (صلى الله عليه وآله) وَ عَلَى شَاطِئِهِ الْأَيْسَرِ دُرَّةٌ صَفْرَاءُ فِيهَا أَلْفُ قَصْرٍ فِي كُلِّ قَصْرٍ أَلْفُ قَصْرٍ لِإِبْرَاهِيمَ وَ آلِ إِبْرَاهِيمَ (عليه السلام)."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473257\">H 14586</a> – Al-Husayn Bin Muhammad Al-Ashary, from Moalla Bin Muhammad, from Muhammad Bin Jamhour, from Shazaan, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Al-Hassan Musa</span><sup>asws</sup> having said; ‘My<sup>asws</sup> father<sup>asws</sup> said to me<sup>asws</sup> that in the Paradise is a river called Ja’far. On its right bank is a white pearl in which are a thousand castles. In each of the castles are a thousand castles for Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>. And upon its left bank is a yellow pearl, in which are a thousand castles. In each of the castles for Ibrahim<sup>as</sup> and the Progeny<sup>asws</sup> of Ibrahim<sup>as</sup>’."
          ],
          "en.sarwar": [
            "138. Al-Husayn Bin Muhammad Al-Ashary, from Mu‘alla Bin Muhammad, from Muhammad Bin Jamhour, from Shazaan, who has narrated the following: Abu Al-Hassan Musa (a.s.) having said; ‘My (a.s.) father (a.s.) said to me (a.s.) that in the Paradise is a river called Ja’far. On its right bank is a white pearl in which are a thousand castles. In each of the castles are a thousand castles for Muhammad (saww) and the Progeny (a.s.) of Muhammad (saww). And upon its left bank is a yellow pearl, in which are a thousand castles. In each of the castles for Ibrahim (as) and the Progeny (a.s.) of Ibrahim (as)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 372)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 388)"
        ],
        "index": 14823,
        "local_index": 14,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "14587- "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/110",
              "text": "هِشَامِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4633",
              "text": "أَبِي عَبْدِ اللَّهِ (عليه السلام)"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "14587- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:34:14",
        "text": [
          " مَا الْتَقَتْ فِئَتَانِ قَطُّ مِنْ أَهْلِ الْبَاطِلِ إِلَّا كَانَ النَّصْرُ مَعَ أَحْسَنِهِمَا بَقِيَّةً عَلَى أَهْلِ الْإِسْلَامِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473258\">H 14587</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from Hisham Bin Salim, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘No two groups of the people of falsehood ever confronted each other at all except that the victory was with the better one of them, while the other way round (opposite) being for the people of Al-Islam’."
          ],
          "en.sarwar": [
            "139. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from Hisham Bin Salim, who has narrated the following: Abu Abdullah (a.s.) said: ‘No two groups of the people of falsehood ever confronted each other at all except that the victory was with the better one of them, while the other way round (opposite) being for the people of Al-Islam’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 373)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14824,
        "local_index": 15,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "14588- "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/177",
              "text": "أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/45",
              "text": "عَلِيِّ بْنِ حَدِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/18",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4633",
              "text": "أَبِي عَبْدِ اللَّهِ (عليه السلام)"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "14588- عَنْهُ عَنْ أَحْمَدَ عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:34:15",
        "text": [
          " جُبِلَتِ الْقُلُوبُ عَلَى حُبِّ مَنْ يَنْفَعُهَا وَ بُغْضِ مَنْ أَضَرَّ بِهَا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473259\">H 14588</a> – From him, from Ahmad, from Ali Bin Hadeed, from some of our companions, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘It is inherent in the hearts to love the one who benefits it, and hate the one who harms it’."
          ],
          "en.sarwar": [
            "140. From him, from Ahmad, from Ali Bin Hadeed, from some of our companions, who has narrated the following: Abu Abdullah (a.s.) said: ‘It is inherent in the hearts to love the one who benefits it, and hate the one who harms it’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 373)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14825,
        "local_index": 16,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "14589- "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/283",
              "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3068",
              "text": "مُوسَى بْنِ عِمْرَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4668",
              "text": "عَمِّهِ الْحُسَيْنِ بْنِ عِيسَى بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/613",
              "text": "عَلِيِّ بْنِ جَعْفَرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4669",
              "text": "أَخِيهِ أَبِي الْحَسَنِ مُوسَى (عليه السلام)"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "14589- مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ مُوسَى بْنِ عِمْرَانَ عَنْ عَمِّهِ الْحُسَيْنِ بْنِ عِيسَى بْنِ عَبْدِ اللَّهِ عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَخِيهِ أَبِي الْحَسَنِ مُوسَى (عليه السلام) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:34:16",
        "text": [
          " أَخَذَ أَبِي بِيَدِي ثُمَّ قَالَ يَا بُنَيَّ إِنَّ أَبِي مُحَمَّدَ بْنَ عَلِيٍّ (عليه السلام) أَخَذَ بِيَدِي كَمَا أَخَذْتُ بِيَدِكَ وَ قَالَ إِنَّ أَبِي عَلِيَّ بْنَ الْحُسَيْنِ (عليه السلام) أَخَذَ بِيَدِي وَ قَالَ يَا بُنَيَّ افْعَلِ الْخَيْرَ إِلَى كُلِّ مَنْ طَلَبَهُ مِنْكَ فَإِنْ كَانَ مِنْ أَهْلِهِ فَقَدْ أَصَبْتَ مَوْضِعَهُ وَ إِنْ لَمْ يَكُنْ مِنْ أَهْلِهِ كُنْتَ أَنْتَ مِنْ أَهْلِهِ وَ إِنْ شَتَمَكَ رَجُلٌ عَنْ يَمِينِكَ ثُمَّ تَحَوَّلَ إِلَى يَسَارِكَ فَاعْتَذَرَ إِلَيْكَ فَاقْبَلْ عُذْرَهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473260\">H 14589</a> – Muhammad Bin Abu Abdullah, from Musa Bin Umraan, from his uncle Al-Husayn Bin Isa Bin Abdullah, from Ali Bin Ja’far, from his brother Abu Al-Hassan Al-Musa<sup>asws</sup> having said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-m\">‘M</span>y</span><sup>asws</sup> father grabbed my<sup>asws</sup> hand then said: ‘O my<sup>asws</sup> son<sup>asws</sup>, my<sup>asws</sup> father<sup>asws</sup> Muhammad Bin Ali<sup>asws</sup> grabbed my<sup>asws</sup> hand just as I<sup>asws</sup> have grabbed your<sup>asws</sup> hand, and said: ‘My<sup>asws</sup> father<sup>asws</sup> Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> grabbed my<sup>asws</sup> hand and said: ‘My<sup>asws</sup> son<sup>asws</sup>, do good to everyone who seeks it from you<sup>asws</sup>, so if he was deserving of it then it has found its place, and if he was not deserving of it, then you<sup>asws</sup> were deserving of it, and if a man insults you from your<sup>asws</sup> right, then turn to your<sup>asws</sup> left. So if he offers his excuse for it, accept his excuse’. "
          ],
          "en.sarwar": [
            "141. Muhammad Bin Abu Abdullah, from Musa Bin Umraan, from his uncle Al-Husayn Bin Isa Bin Abdullah, from Ali Bin Ja’far, from his brother Abu Al-Hassan Al-Musa (a.s.) having said: ‘My (a.s.) father grabbed my (a.s.) hand then said: ‘O my (a.s.) son (a.s.), my (a.s.) father (a.s.) Muhammad Bin Ali (a.s.) grabbed my (a.s.) hand just as I (a.s.) have grabbed your (a.s.) hand, and said: ‘My (a.s.) father (a.s.) Ali (a.s.) Bin Al-Husayn (a.s.) grabbed my (a.s.) hand and said: ‘My (a.s.) son (a.s.), do good to everyone who seeks it from you (a.s.), so if he was deserving of it then it has found its place, and if he was not deserving of it, then you (a.s.) were deserving of it, and if a man insults you from your (a.s.) right, then turn to your (a.s.) left. So if he offers his excuse for it, accept his excuse’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 374)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 388)"
        ],
        "index": 14826,
        "local_index": 17,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "14590- "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/6",
              "text": "الْعَلَاءِ بْنِ رَزِينٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/457",
              "text": "الْحَجَّالِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1409",
              "text": "الْعَلَاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "14590- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ وَ الْحَجَّالِ عَنِ الْعَلَاءِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:34:17",
        "text": [
          " قَالَ لِي أَبُو جَعْفَرٍ (عليه السلام) كَانَ كُلُّ شَيْ‏ءٍ مَاءً وَ كَانَ عَرْشُهُ عَلَى الْمَاءِ فَأَمَرَ اللَّهُ عَزَّ ذِكْرُهُ الْمَاءَ فَاضْطَرَمَ نَاراً ثُمَّ أَمَرَ النَّارَ فَخَمَدَتْ فَارْتَفَعَ مِنْ خُمُودِهَا دُخَانٌ فَخَلَقَ اللَّهُ عَزَّ وَ جَلَّ السَّمَاوَاتِ مِنْ ذَلِكَ الدُّخَانِ وَ خَلَقَ اللَّهُ عَزَّ وَ جَلَّ الْأَرْضَ مِنَ الرَّمَادِ ثُمَّ اخْتَصَمَ الْمَاءُ وَ النَّارُ وَ الرِّيحُ فَقَالَ الْمَاءُ أَنَا جُنْدُ اللَّهِ الْأَكْبَرُ وَ قَالَتِ النَّارُ أَنَا جُنْدُ اللَّهِ الْأَكْبَرُ وَ قَالَتِ الرِّيحُ أَنَا جُنْدُ اللَّهِ الْأَكْبَرُ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى الرِّيحِ أَنْتِ جُنْدِيِّ الْأَكْبَر."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473261\">H 14590</a> - Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboun from Al-A’ala Bin Razeyn, from Muhammad Bin Muslim and Al-Hajjaal from Al-A’ala, from Muhammad Bin Muslim who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>bu Ja’far</span><sup>asws</sup> said to me: ‘Everything used to be water, and His<sup>azwj</sup> Throne was upon the water. So Allah<sup>azwj</sup> Commanded the water so the fire was ignited. Then He<sup>azwj</sup> Commanded the fire, so it was extinguished and from its smoldering a smoke arose. So Allah<sup>azwj</sup> Mighty and Majestic Created the Heavens from that smoke, and Allah<sup>azwj</sup> Mighty and Majestic Created the earth from the ashes. Then the water, and the fire, and the wind contended. So the water said, ‘I am the great army of Allah<sup>azwj</sup>’, and the fire said, ‘I am the great army of Allah<sup>azwj</sup>, and the wind said, ‘I am the great army of Allah<sup>azwj</sup>’. So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto the wind: “You are My<sup>azwj</sup> Great army’."
          ],
          "en.sarwar": [
            "142. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboun from Al-A’ala Bin Razeyn, from Muhammad Bin Muslim and Al-Hajjaal from Al-A’ala, from Muhammad Bin Muslim who said: ‘Abu Ja’far (a.s.) said to me: ‘Everything used to be water, and His (azwj) Throne was upon the water. So Allah (azwj) Commanded the water so the fire was ignited. Then He (azwj) Commanded the fire, so it was extinguished and from its smoldering a smoke arose. So Allah (azwj) Mighty and Majestic Created the Heavens from that smoke, and Allah (azwj) Mighty and Majestic Created the earth from the ashes. Then the water, and the fire, and the wind contended. So the water said, ‘I am the great army of Allah (azwj)’, and the fire said, ‘I am the great army of Allah (azwj), and the wind said, ‘I am the great army of Allah (azwj)’. So Allah (azwj) Mighty and Majestic Revealed unto the wind: “You are My (azwj) Great army’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:34",
  "kind": "verse_list"
}