{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 35"
        },
        "path": "/books/al-kafi:8:1:35",
        "titles": {
          "ar": "حَدِيثُ زَيْنَبَ الْعَطَّارَةِ",
          "en": "HADEETH OF ZAYNAB THE PERFUME SELLER"
        }
      }
    ],
    "index": 2306,
    "local_index": 35,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 36"
        },
        "path": "/books/al-kafi:8:1:36",
        "titles": {
          "ar": "حَدِيثُ الَّذِي أَضَافَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) بِالطَّائِفِ",
          "en": "HADEETH OF THE ONE WHO HOSTED THE Rasool Allah<sup>saww</sup> AT AL-TAEF"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 34"
        },
        "path": "/books/al-kafi:8:1:34",
        "titles": {
          "ar": "حَدِيثُ مَنْ وُلِدَ فِي الْإِسْلَامِ",
          "en": "HADEETH ABOUT THE ONE WHO IS BORN IN AL-ISLAM"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:35",
    "titles": {
      "ar": "حَدِيثُ زَيْنَبَ الْعَطَّارَةِ",
      "en": "HADEETH OF ZAYNAB THE PERFUME SELLER"
    },
    "verse_count": 1,
    "verse_start_index": 14826,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول ويكن عده ف السان 6</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2 / 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14827,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:35:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14591</span>- مُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نَجْرَانَ عَنْ صَفْوَانَ عَنْ خَلَفِ بْنِ حَمَّادٍ عَنِ الْحُسَيْنِ بْنِ زَيْدٍ الْهَاشِمِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ جَاءَتْ زَيْنَبُ الْعَطَّارَةُ الْحَوْلَاءُ إِلَى نِسَاءِ النَّبِيِّ (صلى الله عليه وآله) وَ بَنَاتِهِ وَ كَانَتْ تَبِيعُ مِنْهُنَّ الْعِطْرَ فَجَاءَ النَّبِيُّ (صلى الله عليه وآله) وَ هِيَ عِنْدَهُنَّ فَقَالَ إِذَا أَتَيْتِنَا طَابَتْ بُيُوتُنَا فَقَالَتْ بُيُوتُكَ بِرِيحِكَ أَطْيَبُ يَا رَسُولَ اللَّهِ قَالَ إِذَا بِعْتِ فَأَحْسِنِي وَ لَا تَغُشِّي فَإِنَّهُ أَتْقَى وَ أَبْقَى لِلْمَالِ فَقَالَتْ يَا رَسُولَ اللَّهِ مَا أَتَيْتُ بِشَيْ‏ءٍ مِنْ بَيْعِي وَ إِنَّمَا أَتَيْتُ أَسْأَلُكَ عَنْ عَظَمَةِ اللَّهِ عَزَّ وَ جَلَّ فَقَالَ جَلَّ جَلَالُ اللَّهِ سَأُحَدِّثُكِ عَنْ بَعْضِ ذَلِكِ",
          "ثُمَّ قَالَ إِنَّ هَذِهِ الْأَرْضَ بِمَنْ عَلَيْهَا عِنْدَ الَّتِي تَحْتَهَا كَحَلْقَةٍ مُلْقَاةٍ فِي فَلَاةٍ قِيٍّ وَ هَاتَانِ بِمَنْ فِيهِمَا وَ مَنْ عَلَيْهِمَا عِنْدَ الَّتِي تَحْتَهَا كَحَلْقَةٍ مُلْقَاةٍ فِي فَلَاةٍ قِيٍّ وَ الثَّالِثَةُ حَتَّى انْتَهَى إِلَى السَّابِعَةِ وَ تَلَا هَذِهِ الْآيَةَ خَلَقَ سَبْعَ سَماواتٍ وَ مِنَ الْأَرْضِ مِثْلَهُنَّ وَ السَّبْعُ الْأَرَضِينَ بِمَنْ فِيهِنَّ وَ مَنْ عَلَيْهِنَّ عَلَى ظَهْرِ الدِّيكِ كَحَلْقَةٍ مُلْقَاةٍ فِي فَلَاةٍ قِيٍّ وَ الدِّيكُ لَهُ جَنَاحَانِ جَنَاحٌ فِي الْمَشْرِقِ وَ جَنَاحٌ فِي الْمَغْرِبِ وَ رِجْلَاهُ فِي التُّخُومِ وَ السَّبْعُ وَ الدِّيكُ بِمَنْ فِيهِ وَ مَنْ عَلَيْهِ عَلَى الصَّخْرَةِ كَحَلْقَةٍ مُلْقَاةٍ فِي فَلَاةٍ قِيٍّ ",
          "وَ الصَّخْرَةُ بِمَنْ فِيهَا وَ مَنْ عَلَيْهَا عَلَى ظَهْرِ الْحُوتِ كَحَلْقَةٍ مُلْقَاةٍ فِي فَلَاةٍ قِيٍّ وَ السَّبْعُ وَ الدِّيكُ وَ الصَّخْرَةُ وَ الْحُوتُ بِمَنْ فِيهِ وَ مَنْ عَلَيْهِ عَلَى الْبَحْرِ الْمُظْلِمِ كَحَلْقَةٍ مُلْقَاةٍ فِي فَلَاةٍ قِيٍّ وَ السَّبْعُ وَ الدِّيكُ وَ الصَّخْرَةُ وَ الْحُوتُ وَ الْبَحْرُ الْمُظْلِمُ عَلَى الْهَوَاءِ الذَّاهِبِ كَحَلْقَةٍ مُلْقَاةٍ فِي فَلَاةٍ قِيٍّ وَ السَّبْعُ وَ الدِّيكُ وَ الصَّخْرَةُ وَ الْحُوتُ وَ الْبَحْرُ الْمُظْلِمُ وَ الْهَوَاءُ عَلَى الثَّرَى كَحَلْقَةٍ مُلْقَاةٍ فِي فَلَاةٍ قِيٍّ ثُمَّ تَلَا هَذِهِ الْآيَةَ لَهُ ما فِي السَّماواتِ وَ ما فِي الْأَرْضِ وَ ما بَيْنَهُما وَ ما تَحْتَ الثَّرى ثُمَّ انْقَطَعَ الْخَبَرُ عِنْدَ الثَّرَى ",
          "وَ السَّبْعُ وَ الدِّيكُ وَ الصَّخْرَةُ وَ الْحُوتُ وَ الْبَحْرُ الْمُظْلِمُ وَ الْهَوَاءُ وَ الثَّرَى بِمَنْ فِيهِ وَ مَنْ عَلَيْهِ عِنْدَ السَّمَاءِ الْأُولَى كَحَلْقَةٍ فِي فَلَاةٍ قِيٍّ وَ هَذَا كُلُّهُ وَ سَمَاءُ الدُّنْيَا بِمَنْ عَلَيْهَا وَ مَنْ فِيهَا عِنْدَ الَّتِي فَوْقَهَا كَحَلْقَةٍ فِي فَلَاةٍ قِيٍّ وَ هَاتَانِ السَّمَاءَانِ وَ مَنْ فِيهِمَا وَ مَنْ عَلَيْهِمَا عِنْدَ الَّتِي فَوْقَهُمَا كَحَلْقَةٍ فِي فَلَاةٍ قِيٍّ وَ هَذِهِ الثَّلَاثُ بِمَنْ فِيهِنَّ وَ مَنْ عَلَيْهِنَّ عِنْدَ الرَّابِعَةِ كَحَلْقَةٍ فِي فَلَاةٍ قِيٍّ حَتَّى انْتَهَى إِلَى السَّابِعَةِ ",
          "وَ هُنَّ وَ مَنْ فِيهِنَّ وَ مَنْ عَلَيْهِنَّ عِنْدَ الْبَحْرِ الْمَكْفُوفِ عَنْ أَهْلِ الْأَرْضِ كَحَلْقَةٍ فِي فَلَاةٍ قِيٍّ وَ هَذِهِ السَّبْعُ وَ الْبَحْرُ الْمَكْفُوفُ عِنْدَ جِبَالِ الْبَرَدِ كَحَلْقَةٍ فِي فَلَاةٍ قِيٍّ وَ تَلَا هَذِهِ الْآيَةَ وَ يُنَزِّلُ مِنَ السَّماءِ مِنْ جِبالٍ فِيها مِنْ بَرَدٍ وَ هَذِهِ السَّبْعُ وَ الْبَحْرُ الْمَكْفُوفُ وَ جِبَالُ الْبَرَدِ عِنْدَ الْهَوَاءِ الَّذِي تَحَارُ فِيهِ الْقُلُوبُ كَحَلْقَةٍ فِي فَلَاةٍ قِيٍّ وَ هَذِهِ السَّبْعُ وَ الْبَحْرُ الْمَكْفُوفُ وَ جِبَالُ الْبَرَدِ وَ الْهَوَاءُ عِنْدَ حُجُبِ النُّورِ كَحَلْقَةٍ فِي فَلَاةٍ قِيٍّ ",
          "وَ هَذِهِ السَّبْعُ وَ الْبَحْرُ الْمَكْفُوفُ وَ جِبَالُ الْبَرَدِ وَ الْهَوَاءُ وَ حُجُبُ النُّورِ عِنْدَ الْكُرْسِيِّ كَحَلْقَةٍ فِي فَلَاةٍ قِيٍّ ثُمَّ تَلَا هَذِهِ الْآيَةَ وَسِعَ كُرْسِيُّهُ السَّماواتِ وَ الْأَرْضَ وَ لا يَؤُدُهُ حِفْظُهُما وَ هُوَ الْعَلِيُّ الْعَظِيمُ وَ هَذِهِ السَّبْعُ وَ الْبَحْرُ الْمَكْفُوفُ وَ جِبَالُ الْبَرَدِ وَ الْهَوَاءُ وَ حُجُبُ النُّورِ وَ الْكُرْسِيُّ عِنْدَ الْعَرْشِ كَحَلْقَةٍ فِي فَلَاةٍ قِيٍّ وَ تَلَا هَذِهِ الْآيَةَ الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى [وَ فِي رِوَايَةِ الْحَسَنِ] الْحُجُبُ قَبْلَ الْهَوَاءِ الَّذِي تَحَارُ فِيهِ الْقُلُوبُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473263\">H 14591</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Abdul Rahmaan Bin Abu Najraan, from Safwaan, from Halaf Bin Hammaad, from Al-Husayn Bin Zayd Al-Hashimy, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘Zaynab the perfume seller came to the wives and the daughters of the Prophet<sup>saww</sup>, and she used to sell the perfume to them. The Prophet<sup>saww</sup> came over whilst she was among them. So he<sup>saww</sup> said: ‘You bring aroma to our<sup>saww</sup> house’. She said, ‘Your<sup>saww</sup> house is better in aroma due to your<sup>saww</sup> fragrance, O Rasool Allah<sup>saww</sup>!’ He<sup>saww</sup> said: ‘When you sell, do it well and do not cheat, for it would be more pious and protective of the wealth’. She said, ‘O Rasool Allah<sup>saww</sup>, I did not come to sell anything, but rather I came to ask you<sup>saww</sup> about the Magnificence of Allah<sup>azwj</sup> Mighty and Majestic’. So he<sup>saww</sup> said: ‘Majestic is the Majesty of Allah<sup>azwj</sup>. I<sup>saww</sup> shall tell you about some of that’.",
            "Then he<sup>saww</sup> said: ‘This earth with what is upon it, compared to that which is below it, it like a ring thrown in the desert, and these two with what is within them and what is upon them, compared to what is beneath them is like a ring thrown in the desert, and the third one, until it ends with the seventh’. And he<sup>saww</sup> recited this Verse: <span class=\"ibTxt\">“[65:12] Allah is He Who created seven Firmaments and of the earth a similar number”</span>. The seven earths (firmaments) along with all that is contained within it and what is on it are upon the back of the rooster, like a ring thrown in the desert. And the rooster has two wings to it – a wing in the east and a wing in the west, and its legs are on the fringes of it, and the seven (firmaments) and the rooster and all that is contained with these and whatever is on it, are upon a rock, like a ring thrown in the desert.",
            "And the rock along with all that it contains, and all that is on it, are upon the back of the whale like a ring thrown in the desert. And the seven (firmaments), and the rooster, and the rock, and the whale along with that they contain and what is on them are upon the dark ocean like a ring thrown in the desert. And the seven (firmaments), and the rooster, and the rock, and the whale, and the dark ocean are upon the outgoing air like a ring thrown in the desert. And the seven (firmaments), and the rooster, and the rock, and the whale, and the dark ocean, and the air are upon the soil (Al-Sarayy) like a ring thrown in the desert’. Then he<sup>saww</sup> recited this Verse: <span class=\"ibTxt\">“[20:6] To Him belongs what is in the heavens and on earth, and all between them, and all beneath the soil”</span>. Then the information about the soil (Al-Sarayy) is terminated. ",
            "And the seven (firmaments), and the rooster, and the rock, and the whale, and the dark ocean, and the air, and the soil (Al-Sarayy) along with all that these contain and whatever is on it, compared to the first sky is like a ring thrown in the desert. And all of this, and the sky of the world along with what is on it and what is contained within it, compared to that which is above it, is like a ring thrown in the desert. And these two skies and whatever these two contain, and what is on them, compared to what is above these two, are like a ring thrown in the desert. And these three, along with what is contained within them and whatever is on them, compared to the fourth, are like a ring thrown in the desert, (and it is like this) until it ends with the seventh. ",
            "And these and all that is contained within them and whatever is on them, compared to the ocean hidden from the people of the earth, is like a ring thrown in the desert. And these seven, and the hidden ocean, compared to the cold mountain are like a ring thrown in the desert’. And he<sup>saww</sup> recited this Verse: <span class=\"ibTxt\">“[24:43] And He sends down of the clouds that are (like) mountains wherein is hail”</span>. And these seven, and the hidden ocean, and the cold mountain, compared to the air which the hearts are confused about, are like a ring thrown in the desert. And these seven, and the hidden ocean, and the cold mountain, and the air, compared to veils of the light are like a ring thrown in the desert.",
            "And these seven, and the hidden ocean, and the cold mountain, and the air, and the veils of the light, compared to the Chair (Al-Kursy) are like a ring thrown in the desert’. And he<sup>saww</sup> recited this Verse: <span class=\"ibTxt\">“[2:255] His Throne (Chair) includes the heavens and the earth, and He is never weary of preserving them. He is the Sublime, the Tremendous”</span>. And these seven, and the hidden ocean, and the cold mountain, and the air, and veils of the light, and the Chair, compared to the Throne are like a ring thrown in the desert’. And he<sup>saww</sup> recite this Verse: <span class=\"ibTxt\">“[20:5] The Beneficent One, Who is established on the Throne”</span>. (And in the report of Al-Hassan) – ‘The veils before the air about which the hearts are confused’."
          ],
          "en.sarwar": [
            "143. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Abdul Rahmaan Bin Abu Najraan, from Safwaan, from Halaf Bin Hammaad, from Al-Husayn Bin Zayd Al-Hashimy, who has narrated the following: Abu Abdullah (a.s.) said: ‘Zaynab the perfume seller came to the wives and the daughters of the Prophet (saww), and she used to sell the perfume to them. The Prophet (saww) came over whilst she was among them. So he (saww) said: ‘You bring aroma to our (saww) house’. She said, ‘Your (saww) house is better in aroma due to your (saww) fragrance, O Rasool Allah (saww)!’ He (saww) said: ‘When you sell, do it well and do not cheat, for it would be more pious and protective of the wealth’. She said, ‘O Rasool Allah (saww), I did not come to sell anything, but rather I came to ask you (saww) about the Magnificence of Allah (azwj) Mighty and Majestic’. So he (saww) said: ‘Majestic is the Majesty of Allah (azwj). I (saww) shall tell you about some of that’. Then he (saww) said: ‘This earth with what is upon it, compared to that which is below it, it like a ring thrown in the desert, and these two with what is within them and what is upon them, compared to what is beneath them is like a ring thrown in the desert, and the third one, until it ends with the seventh’. And he (saww) recited this Verse: “[65:12] Allah is He Who created seven Firmaments and of the earth a similar number”. The seven earths (firmaments) along with all that is contained within it and what is on it are upon the back of the rooster, like a ring thrown in the desert. And the rooster has two wings to it – a wing in the east and a wing in the west, and its legs are on the fringes of it, and the seven (firmaments) and the rooster and all that is contained with these and whatever is on it, are upon a rock, like a ring thrown in the desert. And the rock along with all that it contains, and all that is on it, are upon the back of the whale like a ring thrown in the desert. And the seven (firmaments), and the rooster, and the rock, and the whale along with that they contain and what is on them are upon the dark ocean like a ring thrown in the desert. And the seven (firmaments), and the rooster, and the rock, and the whale, and the dark ocean are upon the outgoing air like a ring thrown in the desert. And the seven (firmaments), and the rooster, and the rock, and the whale, and the dark ocean, and the air are upon the soil (Al-Sarayy) like a ring thrown in the desert’. Then he (saww) recited this Verse: “[20:6] To Him belongs what is in the heavens and on earth, and all between them, and all beneath the soil”. Then the information about the soil (Al-Sarayy) is terminated. And the seven (firmaments), and the rooster, and the rock, and the whale, and the dark ocean, and the air, and the soil (Al-Sarayy) along with all that these contain and whatever is on it, compared to the first sky is like a ring thrown in the desert. And all of this, and the sky of the world along with what is on it and what is contained within it, compared to that which is above it, is like a ring thrown in the desert. And these two skies and whatever these two contain, and what is on them, compared to what is above these two, are like a ring thrown in the desert. And these three, along with what is contained within them and whatever is on them, compared to the fourth, are like a ring thrown in the desert, (and it is like this) until it ends with the seventh. And these and all that is contained within them and whatever is on them, compared to the ocean hidden from the people of the earth, is like a ring thrown in the desert. And these seven, and the hidden ocean, compared to the cold mountain are like a ring thrown in the desert’. And he (saww) recited this Verse: “[24:43] And He sends down of the clouds that are (like) mountains wherein is hail”. And these seven, and the hidden ocean, and the cold mountain, compared to the air which the hearts are confused about, are like a ring thrown in the desert. And these seven, and the hidden ocean, and the cold mountain, and the air, compared to veils of the light are like a ring thrown in the desert. And these seven, and the hidden ocean, and the cold mountain, and the air, and the veils of the light, compared to the Chair (Al-Kursy) are like a ring thrown in the desert’. And he (saww) recited this Verse: “[2:255] His Throne (Chair) includes the heavens and the earth, and He is never weary of preserving them. He is the Sublime, the Tremendous”. And these seven, and the hidden ocean, and the cold mountain, and the air, and veils of the light, and the Chair, compared to the Throne are like a ring thrown in the desert’. And he (saww) recite this Verse: “[20:5] The Beneficent One, Who is established on the Throne”. (And in the report of Al-Hassan) – ‘The veils before the air about which the hearts are confused’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:35",
  "kind": "verse_list"
}