{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 36"
        },
        "path": "/books/al-kafi:8:1:36",
        "titles": {
          "ar": "حَدِيثُ الَّذِي أَضَافَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) بِالطَّائِفِ",
          "en": "HADEETH OF THE ONE WHO HOSTED THE Rasool Allah<sup>saww</sup> AT AL-TAEF"
        }
      }
    ],
    "index": 2307,
    "local_index": 36,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 37"
        },
        "path": "/books/al-kafi:8:1:37",
        "titles": {
          "ar": "حَدِيثُ النَّاسِ يَوْمَ الْقِيَامَةِ",
          "en": "HADEETH ABOUT THE PEOPLE ON THE DAY OF JUDGEMENT"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 35"
        },
        "path": "/books/al-kafi:8:1:35",
        "titles": {
          "ar": "حَدِيثُ زَيْنَبَ الْعَطَّارَةِ",
          "en": "HADEETH OF ZAYNAB THE PERFUME SELLER"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:36",
    "titles": {
      "ar": "حَدِيثُ الَّذِي أَضَافَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) بِالطَّائِفِ",
      "en": "HADEETH OF THE ONE WHO HOSTED THE Rasool Allah<sup>saww</sup> AT AL-TAEF"
    },
    "verse_count": 10,
    "verse_start_index": 14827,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 8)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14828,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:36:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14592</span>- عَلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ يَزِيدَ الْكُنَاسِيِّ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ إِنَّ رَسُولَ اللَّهِ (صلى الله عليه وآله) كَانَ نَزَلَ عَلَى رَجُلٍ بِالطَّائِفِ قَبْلَ الْإِسْلَامِ فَأَكْرَمَهُ فَلَمَّا أَنْ بَعَثَ اللَّهُ مُحَمَّداً (صلى الله عليه وآله) إِلَى النَّاسِ قِيلَ لِلرَّجُلِ أَ تَدْرِي مَنِ الَّذِي أَرْسَلَهُ اللَّهُ عَزَّ وَ جَلَّ إِلَى النَّاسِ قَالَ لَا قَالُوا لَهُ هُوَ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ يَتِيمُ أَبِي طَالِبٍ وَ هُوَ الَّذِي كَانَ نَزَلَ بِكَ بِالطَّائِفِ يَوْمَ كَذَا وَ كَذَا فَأَكْرَمْتَهُ ",
          "قَالَ فَقَدِمَ الرَّجُلُ عَلَى رَسُولِ اللَّهِ (صلى الله عليه وآله) فَسَلَّمَ عَلَيْهِ وَ أَسْلَمَ ثُمَّ قَالَ لَهُ أَ تَعْرِفُنِي يَا رَسُولَ اللَّهِ قَالَ وَ مَنْ أَنْتَ قَالَ أَنَا رَبُّ الْمَنْزِلِ الَّذِي نَزَلْتَ بِهِ بِالطَّائِفِ فِي الْجَاهِلِيَّةِ يَوْمَ كَذَا وَ كَذَا فَأَكْرَمْتُكَ فَقَالَ لَهُ رَسُولُ اللَّهِ (صلى الله عليه وآله) مَرْحَباً بِكَ سَلْ حَاجَتَكَ فَقَالَ أَسْأَلُكَ مِائَتَيْ شَاةٍ بِرُعَاتِهَا فَأَمَرَ لَهُ رَسُولُ اللَّهِ (صلى الله عليه وآله) بِمَا سَأَلَ ثُمَّ قَالَ لِأَصْحَابِهِ مَا كَانَ عَلَى هَذَا الرَّجُلِ أَنْ يَسْأَلَنِي سُؤَالَ عَجُوزِ بَنِي إِسْرَائِيلَ لِمُوسَى (عليه السلام) فَقَالُوا وَ مَا سَأَلَتْ عَجُوزُ بَنِي إِسْرَائِيلَ لِمُوسَى",
          "فَقَالَ إِنَّ اللَّهَ عَزَّ ذِكْرُهُ أَوْحَى إِلَى مُوسَى أَنِ احْمِلْ عِظَامَ يُوسُفَ مِنْ مِصْرَ قَبْلَ أَنْ تَخْرُجَ مِنْهَا إِلَى الْأَرْضِ الْمُقَدَّسَةِ بِالشَّامِ فَسَأَلَ مُوسَى عَنْ قَبْرِ يُوسُفَ (عليه السلام) فَجَاءَهُ شَيْخٌ فَقَالَ إِنْ كَانَ أَحَدٌ يَعْرِفُ قَبْرَهُ فَفُلَانَةُ فَأَرْسَلَ مُوسَى (عليه السلام) إِلَيْهَا فَلَمَّا جَاءَتْهُ قَالَ تَعْلَمِينَ مَوْضِعَ قَبْرِ يُوسُفَ (عليه السلام) قَالَتْ نَعَمْ قَالَ فَدُلِّينِي عَلَيْهِ وَ لَكِ مَا سَأَلْتِ",
          "قَالَ لَا أَدُلُّكَ عَلَيْهِ إِلَّا بِحُكْمِي قَالَ فَلَكِ الْجَنَّةُ قَالَتْ لَا إِلَّا بِحُكْمِي عَلَيْكَ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى مُوسَى لَا يَكْبُرُ عَلَيْكَ أَنْ تَجْعَلَ لَهَا حُكْمَهَا فَقَالَ لَهَا مُوسَى فَلَكِ حُكْمُكِ قَالَتْ فَإِنَّ حُكْمِي أَنْ أَكُونَ مَعَكَ فِي دَرَجَتِكَ الَّتِي تَكُونُ فِيهَا يَوْمَ الْقِيَامَةِ فِي الْجَنَّةِ فَقَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) مَا كَانَ عَلَى هَذَا لَوْ سَأَلَنِي مَا سَأَلَتْ عَجُوزُ بَنِي إِسْرَائِيلَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473265\">H 14592</a> – Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Jameel Bin Saleh, from Yazeed Al-Kunasy, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> having said that; ‘The Rasool Allah<sup>saww</sup> had stayed at one man’s house in Al-Taef before the Islamic era. He had honoured him<sup>saww</sup>. So when Allah<sup>azwj</sup> Sent Muhammad<sup>saww</sup> to the people, it was said to the man, ‘Do you know the one whom Allah<sup>azwj</sup> Mighty and Majestic has Sent to the people?’ He said, ‘No’. They said, ‘He<sup>saww</sup> is Muhammad Bin Abdullah<sup>saww</sup>, the orphan of Abu Talib<sup>as</sup>, and he<sup>saww</sup> is the one whom stayed with you at Al-Taef on such and such a day. You had honoured him<sup>saww</sup>’.",
            "Imam<sup>asws</sup> said: ‘The man went to the Rasool Allah<sup>saww</sup>. He greeted him<sup>saww</sup>, then said to him<sup>saww</sup>, ‘Do you<sup>saww</sup> recognise me, O Rasool Allah<sup>saww</sup>?’ He<sup>saww</sup> said: ‘And who are you?’ He said, ‘I am the lord of the house where you<sup>saww</sup> stayed in at Al-Taef during the pre-Islamic period on such and such a day. I honoured you<sup>saww</sup>’. The Rasool Allah<sup>saww</sup> said to him: ‘Welcome to you. Ask for your need’. So he said, ‘I ask you<sup>saww</sup> for a hundred sheep along with its shepherd’. So the Rasool Allah<sup>saww</sup> ordered for him what he had asked for, then said to his<sup>saww</sup> companions: ‘What was it with this man that he did not ask me<sup>saww</sup> what the elderly woman of the Children of Israel asked to Musa<sup>as</sup>?’ They said, ‘And what did the elderly woman of the Children of Israel ask to Musa<sup>as</sup>?’ ",
            "So he<sup>saww</sup> said: ‘Allah<sup>azwj</sup> Revealed unto Musa<sup>as</sup> that: “Carry the bones of Yusuf<sup>as</sup> from Egypt, before you<sup>as</sup> leave from it, to the Holy land in Syria”. Musa<sup>as</sup> asked about the grave of Yusuf<sup>as</sup>. An old man came up and said, ‘If there is anyone who would recognise his<sup>as</sup> grave it would be such and such a woman. So Musa<sup>as</sup> sent for her. When she came, he<sup>as</sup> said: ‘Do you recognise the place of the grave of Yusuf<sup>as</sup>?’ She said, ‘Yes’. Point it out to me<sup>as</sup> and you can have whatever you ask for’.",
            "She said, ‘I will not point it out to you except under my command’. He<sup>as</sup> said: ‘For you is the Paradise’. She said, ‘No, except by my command on you<sup>as</sup>’. So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto Musa<sup>as</sup>: “It is not a great thing to you<sup>as</sup> for it to be by her command”. So Musa<sup>as</sup> said to her: ‘For you is the command’. She said, ‘My command is that I should be with you<sup>as</sup>, in your<sup>as</sup> level which you<sup>as</sup> would be upon, on the Day of Judgement, in the Paradise’. So the Rasool Allah<sup>saww</sup> said: ‘What was it with this (man) that he did not ask me<sup>saww</sup> for what the elderly woman of the Children of Israel asked for?’ "
          ],
          "en.sarwar": [
            "144. Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Jameel Bin Saleh, from Yazeed Al-Kunasy, who has narrated the following: Abu Ja’far (a.s.) having said that; ‘The Rasool Allah (saww) had stayed at one man’s house in Al-Taef before the Islamic era. He had honoured him (saww). So when Allah (azwj) Sent Muhammad (saww) to the people, it was said to the man, ‘Do you know the one whom Allah (azwj) Mighty and Majestic has Sent to the people?’ He said, ‘No’. They said, ‘He (saww) is Muhammad Bin Abdullah (saww), the orphan of Abu Talib (as), and he (saww) is the one whom stayed with you at Al-Taef on such and such a day. You had honoured him (saww)’. Imam (a.s.) said: ‘The man went to the Rasool Allah (saww). He greeted him (saww), then said to him (saww), ‘Do you (saww) recognise me, O Rasool Allah (saww)?’ He (saww) said: ‘And who are you?’ He said, ‘I am the lord of the house where you (saww) stayed in at Al-Taef during the pre-Islamic period on such and such a day. I honoured you (saww)’. The Rasool Allah (saww) said to him: ‘Welcome to you. Ask for your need’. So he said, ‘I ask you (saww) for a hundred sheep along with its shepherd’. So the Rasool Allah (saww) ordered for him what he had asked for, then said to his (saww) companions: ‘What was it with this man that he did not ask me (saww) what the elderly woman of the Children of Israel asked to Musa (as)?’ They said, ‘And what did the elderly woman of the Children of Israel ask to Musa (as)?’ So he (saww) said: ‘Allah (azwj) Revealed unto Musa (as) that: “Carry the bones of Yusuf (as) from Egypt, before you (as) leave from it, to the Holy land in Syria”. Musa (as) asked about the grave of Yusuf (as). An old man came up and said, ‘If there is anyone who would recognise his (as) grave it would be such and such a woman. So Musa (as) sent for her. When she came, he (as) said: ‘Do you recognise the place of the grave of Yusuf (as)?’ She said, ‘Yes’. Point it out to me (as) and you can have whatever you ask for’. She said, ‘I will not point it out to you except under my command’. He (as) said: ‘For you is the Paradise’. She said, ‘No, except by my command on you (as)’. So Allah (azwj) Mighty and Majestic Revealed unto Musa (as): “It is not a great thing to you (as) for it to be by her command”. So Musa (as) said to her: ‘For you is the command’. She said, ‘My command is that I should be with you (as), in your (as) level which you (as) would be upon, on the Day of Judgement, in the Paradise’. So the Rasool Allah (saww) said: ‘What was it with this (man) that he did not ask me (saww) for what the elderly woman of the Children of Israel asked for?’"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 10)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 389)"
        ],
        "index": 14829,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:36:2",
        "text": [
          "14593- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ كَانَتِ امْرَأَةٌ مِنَ الْأَنْصَارِ تَوَدُّنَا أَهْلَ الْبَيْتِ وَ تُكْثِرُ التَّعَاهُدَ لَنَا وَ إِنَّ عُمَرَ بْنَ الْخَطَّابِ لَقِيَهَا ذَاتَ يَوْمٍ وَ هِيَ تُرِيدُنَا فَقَالَ لَهَا أَيْنَ تَذْهَبِينَ يَا عَجُوزَ الْأَنْصَارِ فَقَالَتْ أَذْهَبُ إِلَى آلِ مُحَمَّدٍ أُسَلِّمُ عَلَيْهِمْ وَ أُجَدِّدُ بِهِمْ عَهْداً وَ أَقْضِي حَقَّهُمْ ",
          "فَقَالَ لَهَا عُمَرُ وَيْلَكِ لَيْسَ لَهُمُ الْيَوْمَ حَقٌّ عَلَيْكِ وَ لَا عَلَيْنَا إِنَّمَا كَانَ لَهُمْ حَقٌّ عَلَى عَهْدِ رَسُولِ اللَّهِ (صلى الله عليه وآله) فَأَمَّا الْيَوْمَ فَلَيْسَ لَهُمْ حَقٌّ فَانْصَرِفِي فَانْصَرَفَتْ حَتَّى أَتَتْ أُمَّ سَلَمَةَ فَقَالَتْ لَهَا أُمُّ سَلَمَةَ مَا ذَا أَبْطَأَ بِكِ عَنَّا فَقَالَتْ إِنِّي لَقِيتُ عُمَرَ بْنَ الْخَطَّابِ وَ أَخْبَرَتْهَا بِمَا قَالَتْ لِعُمَرَ وَ مَا قَالَ لَهَا عُمَرُ فَقَالَتْ لَهَا أُمُّ سَلَمَةَ كَذَبَ لَا يَزَالُ حَقُّ آلِ مُحَمَّدٍ (صلى الله عليه وآله) وَاجِباً عَلَى الْمُسْلِمِينَ إِلَى يَوْمِ الْقِيَامَةِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473266\">H 14593</a> – Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Abdullah Bin Sinan who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘There was a woman from the Helpers who had cordiality with us<sup>asws</sup> the People<sup>asws</sup> of the Household, and used to frequently pledge her allegiance to us<sup>asws</sup>, and Umar Bin Al-Khattab met her one day whilst she was on her way to us<sup>asws</sup>. He said to her, ‘Where are you headed, O elderly woman of the Helpers?’ She said, ‘I am going to the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> to greet them<sup>asws</sup>, and renew my allegiance with them<sup>asws</sup>, and give their<sup>asws</sup> rights to them<sup>asws</sup>. ",
            "So Umar said to her, ‘Woe be unto you! There are no rights for them<sup>asws</sup> today, neither from you nor from us. But rather, there used to be rights for them during the era of the Rasool Allah<sup>saww</sup>. As for today, there are no rights for them<sup>asws</sup>, so leave’. So she left until she came up to Umm Salma<sup>ar</sup>. Umm Salma<sup>ar</sup> said to her, ‘What was it that delayed you in coming to us<sup>as</sup>?’ So she said, ‘I met Umar Bin Al-Khattaab’, and she informed her<sup>as</sup> of what she had said to Umar and what Umar had said to her’. So Umm Salma<sup>ar</sup> said to her, ‘He lied. The rights of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> have not stopped. They are Obligatory upon the Muslims up to the Day of Judgement’. "
          ],
          "en.sarwar": [
            "145. Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Abdullah Bin Sinan who said: I heard Abu Abdullah (a.s.) saying: ‘There was a woman from the Helpers who had cordiality with us (a.s.) the People (a.s.) of the Household, and used to frequently pledge her allegiance to us (a.s.), and Umar Bin Al-Khattab met her one day whilst she was on her way to us (a.s.). He said to her, ‘Where are you headed, O elderly woman of the Helpers?’ She said, ‘I am going to the Progeny (a.s.) of Muhammad (saww) to greet them (a.s.), and renew my allegiance with them (a.s.), and give their (a.s.) rights to them (a.s.). So Umar said to her, ‘Woe be unto you! There are no rights for them (a.s.) today, neither from you nor from us. But rather, there used to be rights for them during the era of the Rasool Allah (saww). As for today, there are no rights for them (a.s.), so leave’. So she left until she came up to Umm Salma (ar). Umm Salma (ar) said to her, ‘What was it that delayed you in coming to us (as)?’ So she said, ‘I met Umar Bin Al-Khattaab’, and she informed her (as) of what she had said to Umar and what Umar had said to her’. So Umm Salma (ar) said to her, ‘He lied. The rights of the Progeny (a.s.) of Muhammad (saww) have not stopped. They are Obligatory upon the Muslims up to the Day of Judgement’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 11)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 389)"
        ],
        "index": 14830,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:36:3",
        "refs": {
          "Mentions": [
            "/books/quran:3:170"
          ]
        },
        "text": [
          "14594- ابْنُ مَحْبُوبٍ عَنِ الْحَارِثِ بْنِ مُحَمَّدِ بْنِ النُّعْمَانِ عَنْ بُرَيْدٍ الْعِجْلِيِّ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ (عليه السلام) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ يَسْتَبْشِرُونَ بِالَّذِينَ لَمْ يَلْحَقُوا بِهِمْ مِنْ خَلْفِهِمْ أَلَّا خَوْفٌ عَلَيْهِمْ وَ لا هُمْ يَحْزَنُونَ قَالَ هُمْ وَ اللَّهِ شِيعَتُنَا حِينَ صَارَتْ أَرْوَاحُهُمْ فِي الْجَنَّةِ وَ اسْتَقْبَلُوا الْكَرَامَةَ مِنَ اللَّهِ عَزَّ وَ جَلَّ عَلِمُوا وَ اسْتَيْقَنُوا أَنَّهُمْ كَانُوا عَلَى الْحَقِّ وَ عَلَى دِينِ اللَّهِ عَزَّ وَ جَلَّ وَ اسْتَبْشَرُوا بِمَنْ لَمْ يَلْحَقْ بِهِمْ مِنْ إِخْوَانِهِمْ مِنْ خَلْفِهِمْ مِنَ الْمُؤْمِنِينَ أَلَّا خَوْفٌ عَلَيْهِمْ وَ لَا هُمْ يَحْزَنُونَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473267\">H 14594</a> – Ibn Mahboub, from Al-Haris Bin Muhammad Bin Al-No’man, from Bureyd Al-Ajaly who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> asked Abu Ja’far</span><sup>asws</sup> about the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:3#h170\">[3:170]</a> and they rejoice for the sake of those who, (being left) behind them, have not yet joined them, that they shall have no fear, nor shall they grieve”</span>. He<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! These are our<sup>asws</sup> Shiites, when their souls will arrive in the Paradise, and they will be Welcomed honourably from Allah<sup>azwj</sup> Mighty and Majestic, they would come to know and be convinced that they were upon the ‘الْحَقِّ’ Just, and upon the Religion of Allah<sup>azwj</sup> Mighty and Majestic, and they would receive the good news of the ones whom they had left behind from their brethren from the Believers. There would be no fear to come upon them, nor would they be in any grief’."
          ],
          "en.sarwar": [
            "146. Ibn Mahboub, from Al-Haris Bin Muhammad Bin Al-No’man, from Bureyd Al-Ajaly who said: ‘I asked Abu Ja’far (a.s.) about the Statement of Allah (azwj) Mighty and Majestic: “<a href=\"/#/books/quran:3#h170\">[3:170]</a> and they rejoice for the sake of those who, (being left) behind them, have not yet joined them, that they shall have no fear, nor shall they grieve”. He (a.s.) said: ‘By Allah (azwj)! These are our (a.s.) Shiites, when their souls will arrive in the Paradise, and they will be Welcomed honourably from Allah (azwj) Mighty and Majestic, they would come to know and be convinced that they were upon the ‘الْحَقِّ’ Just, and upon the Religion of Allah (azwj) Mighty and Majestic, and they would receive the good news of the ones whom they had left behind from their brethren from the Believers. There would be no fear to come upon them, nor would they be in any grief’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 13)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14831,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:36:4",
        "refs": {
          "Mentions": [
            "/books/quran:55:70",
            "/books/quran:55:72"
          ]
        },
        "text": [
          "14595- عَنْهُ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنِ الْحَلَبِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فِيهِنَّ خَيْراتٌ حِسانٌ قَالَ هُنَّ صَوَالِحُ الْمُؤْمِنَاتِ الْعَارِفَاتِ قَالَ قُلْتُ حُورٌ مَقْصُوراتٌ فِي الْخِيامِ قَالَ الْحُورُ هُنَّ الْبِيضُ الْمَضْمُومَاتُ الْمُخَدَّرَاتُ فِي خِيَامِ الدُّرِّ وَ الْيَاقُوتِ وَ الْمَرْجَانِ لِكُلِّ خَيْمَةٍ أَرْبَعَةُ أَبْوَابٍ عَلَى كُلِّ بَابٍ سَبْعُونَ كَاعِباً حُجَّاباً لَهُنَّ وَ يَأْتِيهِنَّ فِي كُلِّ يَوْمٍ كَرَامَةٌ مِنَ اللَّهِ عَزَّ ذِكْرُهُ لِيُبَشِّرَ اللَّهُ عَزَّ وَ جَلَّ بِهِنَّ الْمُؤْمِنِينَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473268\">H 14595</a> – From him, from his father, from Ibn Mahboub, from Abu Ayyub, from Al-Halby who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked Abu Abdullah</span><sup>asws</sup> about the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“ <a href=\"/#/books/quran:55#h70\">[55:70]</a> In them are goodly things, beautiful ones”</span>, said: ‘These would be the righteous believing women, who had recognised (Al-Wilayah)’. I said, <span class=\"ibTxt\">“<a href=\"/#/books/quran:55#h72\">[55:72]</a> Pure ones (Houries) confined to the pavilions”</span>. He<sup>asws</sup> said: ‘The Houries like protected eggs, preserved in the tents of the pearls, and the sapphire, and the coral. For every tent would be four doors, and on every door would be seventy veiled ones, and there will be coming them, Prestige from Allah<sup>azwj</sup> every day for giving good news to the Believer by these (Houries)’."
          ],
          "en.sarwar": [
            "147. From him, from his father, from Ibn Mahboub, from Abu Ayyub, from Al-Halby who said: I asked Abu Abdullah (a.s.) about the Statement of Allah (azwj) Mighty and Majestic: “ <a href=\"/#/books/quran:55#h70\">[55:70]</a> In them are goodly things, beautiful ones”, said: ‘These would be the righteous believing women, who had recognised (Al-Wilayah)’. I said, “<a href=\"/#/books/quran:55#h72\">[55:72]</a> Pure ones (Houries) confined to the pavilions”. He (a.s.) said: ‘The Houries like protected eggs, preserved in the tents of the pearls, and the sapphire, and the coral. For every tent would be four doors, and on every door would be seventy veiled ones, and there will be coming them, Prestige from Allah (azwj) every day for giving good news to the Believer by these (Houries)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 13)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14832,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:36:5",
        "refs": {
          "Mentions": [
            "/books/quran:22:18"
          ]
        },
        "text": [
          "14596- عَلِيُّ بْنُ إِبْرَاهِيمَ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ عَنِ الْأَصْبَغِ بْنِ نُبَاتَةَ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) إِنَّ لِلشَّمْسِ ثَلَاثَمِائَةٍ وَ سِتِّينَ بُرْجاً كُلُّ بُرْجٍ مِنْهَا مِثْلُ جَزِيرَةٍ مِنْ جَزَائِرِ الْعَرَبِ فَتَنْزِلُ كُلَّ يَوْمٍ عَلَى بُرْجٍ مِنْهَا فَإِذَا غَابَتِ انْتَهَتْ إِلَى حَدِّ بُطْنَانِ الْعَرْشِ فَلَمْ تَزَلْ سَاجِدَةً إِلَى الْغَدِ ثُمَّ تُرَدُّ إِلَى مَوْضِعِ مَطْلَعِهَا وَ مَعَهَا مَلَكَانِ يَهْتِفَانِ مَعَهَا وَ إِنَّ وَجْهَهَا لِأَهْلِ السَّمَاءِ وَ قَفَاهَا لِأَهْلِ الْأَرْضِ وَ لَوْ كَانَ وَجْهُهَا لِأَهْلِ الْأَرْضِ لَاحْتَرَقَتِ الْأَرْضُ وَ مَنْ عَلَيْهَا مِنْ شِدَّةِ حَرِّهَا وَ مَعْنَى سُجُودِهَا مَا قَالَ سُبْحَانَهُ وَ تَعَالَى أَ لَمْ تَرَ أَنَّ اللَّهَ يَسْجُدُ لَهُ مَنْ فِي السَّماواتِ وَ مَنْ فِي الْأَرْضِ وَ الشَّمْسُ وَ الْقَمَرُ وَ النُّجُومُ وَ الْجِبالُ وَ الشَّجَرُ وَ الدَّوَابُّ وَ كَثِيرٌ مِنَ النَّاسِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473269\">H 14596</a> – Ali Bin Ibrahim, and a number of our companions, from Sahl Bin ziyad altogether, from Muhammad Bin Isa, from Yunus, from Abu Al-Sabbah Al-Kanany, from Al-Asbagh Bin Nabata who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>mir-ul-Momineen</span><sup style=\"font-weight: normal\">asws</sup> said: ‘For the sun there are three hundred constellations. Each of the constellations from these is like an island from the islands of Arabia. So it descends upon a constellation from these each day. So when it disappears, it ends up to the limits beneath the Throne. It does not stop prostrating until the next day. Then it returns to the place of its rising, and with it are two Angels who hail with it and turn its face towards the people of the sky reversing it from the people of the earth. And had it faced the people of the earth, it would have burnt down the earth and the ones upon it due to the intensity of its heat. And the meaning of its prostration is what the Glorious and the High has Said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:22#h18\">[22:18]</a> Do you not see that to Allah bow down in worship all things that are in the heavens and on earth, the sun, the moon, the stars; the hills, the trees, the animals; and a great number among mankind?”</span>"
          ],
          "en.sarwar": [
            "148. Ali Bin Ibrahim, and a number of our companions, from Sahl Bin ziyad altogether, from Muhammad Bin Isa, from Yunus, from Abu Al-Sabbah Al-Kanany, from Al-Asbagh Bin Nabata who said: Amir-ul-Momineen (a.s.) said: ‘For the sun there are three hundred constellations. Each of the constellations from these is like an island from the islands of Arabia. So it descends upon a constellation from these each day. So when it disappears, it ends up to the limits beneath the Throne. It does not stop prostrating until the next day. Then it returns to the place of its rising, and with it are two Angels who hail with it and turn its face towards the people of the sky reversing it from the people of the earth. And had it faced the people of the earth, it would have burnt down the earth and the ones upon it due to the intensity of its heat. And the meaning of its prostration is what the Glorious and the High has Said: “<a href=\"/#/books/quran:22#h18\">[22:18]</a> Do you not see that to Allah bow down in worship all things that are in the heavens and on earth, the sun, the moon, the stars; the hills, the trees, the animals; and a great number among mankind?”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف مرسل</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 17)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14833,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:36:6",
        "text": [
          "14597- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَمَّنْ حَدَّثَهُ عَنْ جَابِرِ بْنِ يَزِيدَ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ عَلِيٍّ (عليه السلام) سَبْعِينَ حَدِيثاً لَمْ أُحَدِّثْ بِهَا أَحَداً قَطُّ وَ لَا أُحَدِّثُ بِهَا أَحَداً أَبَداً فَلَمَّا مَضَى مُحَمَّدُ بْنُ عَلِيٍّ (عليه السلام) ثَقُلَتْ عَلَى عُنُقِي وَ ضَاقَ بِهَا صَدْرِي فَأَتَيْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) فَقُلْتُ جُعِلْتُ فِدَاكَ إِنَّ أَبَاكَ حَدَّثَنِي سَبْعِينَ حَدِيثاً لَمْ يَخْرُجْ مِنِّي شَيْ‏ءٌ مِنْهَا وَ لَا يَخْرُجُ شَيْ‏ءٌ مِنْهَا إِلَى أَحَدٍ وَ أَمَرَنِي بِسَتْرِهَا وَ قَدْ ثَقُلَتْ عَلَى عُنُقِي وَ ضَاقَ بِهَا صَدْرِي فَمَا تَأْمُرُنِي فَقَالَ يَا جَابِرُ إِذَا ضَاقَ بِكَ مِنْ ذَلِكَ شَيْ‏ءٌ فَاخْرُجْ إِلَى الْجَبَّانَةِ وَ احْتَفِرْ حَفِيرَةً ثُمَّ دَلِّ رَأْسَكَ فِيهَا وَ قُلْ حَدَّثَنِي مُحَمَّدُ بْنُ عَلِيٍّ بِكَذَا وَ كَذَا ثُمَّ طُمَّهُ فَإِنَّ الْأَرْضَ تَسْتُرُ عَلَيْكَ ",
          "قَالَ جَابِرٌ فَفَعَلْتُ ذَلِكَ فَخَفَّ عَنِّي مَا كُنْتُ أَجِدُهُ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ مِثْلَهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473270\">H 14597</a> – A number of our companions, from Saleh Bin Abu Hammaad, from Ismail Bin Mahraan, narrating from Jabir Bin Yazeed who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-m\">M</span>uhammad</span><sup>asws</sup> Bin Ali<sup>asws</sup> narrated seventy Ahadeeth to me which he<sup>asws</sup> never narrated to anyone at all, and I never narrated these to anyone ever. So when Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> passed away (martyred), it became heavy upon my neck, and my chest was constricted by it, so I came up to Abu Abdullah<sup>asws</sup> and said, ‘May I be sacrificed for you<sup>asws</sup>, your<sup>asws</sup> father<sup>asws</sup> narrated seventy Ahadeeth to me from which nothing came out from me, nor did I ever bring anything out from these to anyone, and he<sup>asws</sup> ordered me to keep these as a secret. This has become heavy upon my neck and my chest has been constricted by it, so what is your<sup>asws</sup> order for me?’ He<sup>asws</sup> said: ‘O Jabir! If some of that constricts your chest, go to the cemetery and dig up a ditch, then enter your head inside it and say, ‘Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> narrated to me with such and such’, then cover it up. The earth will keep it as a secret for you’.",
            "Jabir said, ‘I did that, so it became lighter upon me from what I had been under’. A number of our companions, from Sahl Bin Ziyad, from Ismail Bin Mahraan (have narrated) similar to this."
          ],
          "en.sarwar": [
            "149. A number of our companions, from Saleh Bin Abu Hammaad, from Ismail Bin Mahraan, narrating from Jabir Bin Yazeed who said: Muhammad (a.s.) Bin Ali (a.s.) narrated seventy Ahadeeth to me which he (a.s.) never narrated to anyone at all, and I never narrated these to anyone ever. So when Muhammad (a.s.) Bin Ali (a.s.) passed away (martyred), it became heavy upon my neck, and my chest was constricted by it, so I came up to Abu Abdullah (a.s.) and said, ‘May I be sacrificed for you (a.s.), your (a.s.) father (a.s.) narrated seventy Ahadeeth to me from which nothing came out from me, nor did I ever bring anything out from these to anyone, and he (a.s.) ordered me to keep these as a secret. This has become heavy upon my neck and my chest has been constricted by it, so what is your (a.s.) order for me?’ He (a.s.) said: ‘O Jabir! If some of that constricts your chest, go to the cemetery and dig up a ditch, then enter your head inside it and say, ‘Muhammad (a.s.) Bin Ali (a.s.) narrated to me with such and such’, then cover it up. The earth will keep it as a secret for you’. Jabir said, ‘I did that, so it became lighter upon me from what I had been under’. A number of our companions, from Sahl Bin Ziyad, from Ismail Bin Mahraan (have narrated) similar to this."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 17)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14834,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:36:7",
        "text": [
          "14598- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ الْحَارِثِ بْنِ الْمُغِيرَةِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) لآَخُذَنَّ الْبَرِي‏ءَ مِنْكُمْ بِذَنْبِ السَّقِيمِ وَ لِمَ لَا أَفْعَلُ وَ يَبْلُغُكُمْ عَنِ الرَّجُلِ مَا يَشِينُكُمْ وَ يَشِينُنِي فَتُجَالِسُونَهُمْ وَ تُحَدِّثُونَهُمْ فَيَمُرُّ بِكُمُ الْمَارُّ فَيَقُولُ هَؤُلَاءِ شَرٌّ مِنْ هَذَا فَلَوْ أَنَّكُمْ إِذَا بَلَغَكُمْ عَنْهُ مَا تَكْرَهُونَ زَبَرْتُمُوهُمْ وَ نَهَيْتُمُوهُمْ كَانَ أَبَرَّ بِكُمْ وَ بِي."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473271\">H 14598</a> – A number of our companions, from Sahl Bin Ziyad, from Safwaan Bin Yahya, from Al-Haris Bin Al-Mugheira who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘I hold the innocent ones among you to be responsible for the sins of the morbid ones. And why should I<sup>asws</sup> not do so, and there reaches you from that (evil) man which shames you as well as shames me<sup>asws</sup>, but you are (still like to) sit with them and narrate from them. So passer-by passes by, so he says, ‘They are more evil than this one’. So if there reaches you from them what you dislike, express your abhorrence to them, and forbid them. That would be better for you and for me<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "150. A number of our companions, from Sahl Bin Ziyad, from Safwaan Bin Yahya, from Al-Haris Bin Al-Mugheira who said: Abu Abdullah (a.s.) said: ‘I hold the innocent ones among you to be responsible for the sins of the morbid ones. And why should I (a.s.) not do so, and there reaches you from that (evil) man which shames you as well as shames me (a.s.), but you are (still like to) sit with them and narrate from them. So passer-by passes by, so he says, ‘They are more evil than this one’. So if there reaches you from them what you dislike, express your abhorrence to them, and forbid them. That would be better for you and for me (a.s.)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 18)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14835,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:36:8",
        "refs": {
          "Mentions": [
            "/books/quran:7:165"
          ]
        },
        "text": [
          "14599- سَهْلُ بْنُ زِيَادٍ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِهِ تَعَالَى فَلَمَّا نَسُوا ما ذُكِّرُوا بِهِ أَنْجَيْنَا الَّذِينَ يَنْهَوْنَ عَنِ السُّوءِ قَالَ كَانُوا ثَلَاثَةَ أَصْنَافٍ صِنْفٌ ائْتَمَرُوا وَ أَمَرُوا فَنَجَوْا وَ صِنْفٌ ائْتَمَرُوا وَ لَمْ يَأْمُرُوا فَمُسِخُوا ذَرّاً وَ صِنْفٌ لَمْ يَأْتَمِرُوا وَ لَمْ يَأْمُرُوا فَهَلَكُوا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473272\">H 14599</a> – Sahl Bin Ziyad, from Amro Bin Usman, from Abdullah Bin Al-Mugheira, from Talha Bin Zayd, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> regarding the Statement of the High<sup>azwj</sup>: <span class=\"ibTxt\">“<a href=\"/#/books/quran:7#h165\">[7:165]</a> So when they neglected what they had been reminded of, We delivered those who forbade evil”</span>. He<sup>asws</sup> said: ‘There were of three types – A type who were with the commands and they commanded others, so they were Rescued; and a type who were with the commands but they did not command others, so they were metamorphosed as particles; and a type who were not with the command and did not command others, so they perished’."
          ],
          "en.sarwar": [
            "151. Sahl Bin Ziyad, from Amro Bin Usman, from Abdullah Bin Al-Mugheira, from Talha Bin Zayd, who has narrated the following: Abu Abdullah (a.s.) regarding the Statement of the High (azwj): “<a href=\"/#/books/quran:7#h165\">[7:165]</a> So when they neglected what they had been reminded of, We delivered those who forbade evil”. He (a.s.) said: ‘There were of three types – A type who were with the commands and they commanded others, so they were Rescued; and a type who were with the commands but they did not command others, so they were metamorphosed as particles; and a type who were not with the command and did not command others, so they perished’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 19)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14836,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:36:9",
        "text": [
          "14600- عَنْهُ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ كَتَبَ أَبُو عَبْدِ اللَّهِ (عليه السلام) إِلَى الشِّيعَةِ لَيَعْطِفَنَّ ذَوُو السِّنِّ مِنْكُمْ وَ النُّهَى عَلَى ذَوِي الْجَهْلِ وَ طُلَّابِ الرِّئَاسَةِ أَوْ لَتُصِيبَنَّكُمْ لَعْنَتِي أَجْمَعِينَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473273\">H 14600</a> – From him, from Ali Bin Asbaat, from Al-A’la Bin Razeyn, from Muhammad Bin Muslim who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah wrote</span> to the Shiites: ‘Let those who are elderly from among you be sympathetic, and prohibit the ignorant ones and the seekers of leadership, or else you will all be affected by my<sup>asws</sup> curse’."
          ],
          "en.sarwar": [
            "152. From him, from Ali Bin Asbaat, from Al-A’la Bin Razeyn, from Muhammad Bin Muslim who said: Abu Abdullah wrote to the Shiites: ‘Let those who are elderly from among you be sympathetic, and prohibit the ignorant ones and the seekers of leadership, or else you will all be affected by my (a.s.) curse’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 19)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14837,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:36:10",
        "text": [
          "14601- مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ وَ مُحَمَّدُ بْنُ الْحَسَنِ جَمِيعاً عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنْ أَبِي جَعْفَرٍ الْكُوفِيِّ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ جَعَلَ الدِّينَ دَوْلَتَيْنِ دَوْلَةً لآِدَمَ (عليه السلام) وَ دَوْلَةً لِإِبْلِيسَ فَدَوْلَةُ آدَمَ هِيَ دَوْلَةُ اللَّهِ عَزَّ وَ جَلَّ فَإِذَا أَرَادَ اللَّهُ عَزَّ وَ جَلَّ أَنْ يُعْبَدَ عَلَانِيَةً أَظْهَرَ دَوْلَةَ آدَمَ وَ إِذَا أَرَادَ اللَّهُ أَنْ يُعْبَدَ سِرّاً كَانَتْ دَوْلَةُ إِبْلِيسَ فَالْمُذِيعُ لِمَا أَرَادَ اللَّهُ سَتْرَهُ مَارِقٌ مِنَ الدِّينِ "
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473274\">H 14601</a> – Muhammad Bin Abu Abdullah, and Muhammad Bin Al-Hassan, altogether from Saleh Bin Abu Hammaad, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said that: ‘Allah<sup>azwj</sup> Mighty and Majestic Made two governments for the Religion. The government of Adam<sup>as</sup> and the government of Iblees<sup>la</sup>. The government of Adam<sup>as</sup> is the government of Allah<sup>azwj</sup> Mighty and Majestic. So if Allah<sup>azwj</sup> Mighty and Majestic Intends to be worshipped publicly, He<sup>azwj</sup> Makes apparent the government of Adam<sup>as</sup>, and if He<sup>azwj</sup> Intends that He<sup>azwj</sup> should be worshipped in secret, it would be the government of Iblees<sup>la</sup>. So the broadcaster of what Allah<sup>azwj</sup> has Intended to be a secret, is a renegade from the Religion’."
          ],
          "en.sarwar": [
            "153. Muhammad Bin Abu Abdullah, and Muhammad Bin Al-Hassan, altogether from Saleh Bin Abu Hammaad, who has narrated the following: Abu Abdullah (a.s.) said that: ‘Allah (azwj) Mighty and Majestic Made two governments for the Religion. The government of Adam (as) and the government of Iblees (la). The government of Adam (as) is the government of Allah (azwj) Mighty and Majestic. So if Allah (azwj) Mighty and Majestic Intends to be worshipped publicly, He (azwj) Makes apparent the government of Adam (as), and if He (azwj) Intends that He (azwj) should be worshipped in secret, it would be the government of Iblees (la). So the broadcaster of what Allah (azwj) has Intended to be a secret, is a renegade from the Religion’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:36",
  "kind": "verse_list"
}