{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 8"}, "path": "/books/al-kafi:8", "titles": {"ar": "الجزء الثامن‏", "en": "Volume Eight"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:8:1", "titles": {"ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;", "en": "The Book - Garden (of Flowers)"}}, {"indexed_titles": {"en": "Chapter 39"}, "path": "/books/al-kafi:8:1:39", "titles": {"ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ (عليه السلام)", "en": "SERMON OF AMIR-UL-MOMINEEN<sup>asws</sup>"}}], "index": 2300, "local_index": 39, "part_type": "Chapter", "path": "/books/al-kafi:8:1:39", "titles": {"ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ (عليه السلام)", "en": "SERMON OF AMIR-UL-MOMINEEN<sup>asws</sup>"}, "verse_count": 61, "verse_start_index": 14866, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 14867, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14642</span>- عَلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ مُحَمَّدِ بْنِ النُّعْمَانِ أَوْ غَيْرِهِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) أَنَّهُ ذَكَرَ هَذِهِ الْخُطْبَةَ لِأَمِيرِ الْمُؤْمِنِينَ (عليه السلام) يَوْمَ الْجُمُعَةِ الْحَمْدُ لِلَّهِ أَهْلِ الْحَمْدِ وَ وَلِيِّهِ وَ مُنْتَهَى الْحَمْدِ وَ مَحَلِّهِ الْبَدِي‏ءِ الْبَدِيعِ الْأَجَلِّ الْأَعْظَمِ الْأَعَزِّ الْأَكْرَمِ الْمُتَوَحِّدِ بِالْكِبْرِيَاءِ وَ الْمُتَفَرِّدِ بِالْآلَاءِ الْقَاهِرِ بِعِزِّهِ وَ الْمُسَلِّطِ بِقَهْرِهِ الْمُمْتَنِعِ بِقُوَّتِهِ الْمُهَيْمِنِ بِقُدْرَتِهِ وَ الْمُتَعَالِي فَوْقَ كُلِّ شَيْ‏ءٍ بِجَبَرُوتِهِ الْمَحْمُودِ بِامْتِنَانِهِ وَ بِإِحْسَانِهِ الْمُتَفَضِّلِ بِعَطَائِهِ وَ جَزِيلِ فَوَائِدِهِ الْمُوَسِّعِ بِرِزْقِهِ الْمُسْبِغِ بِنِعَمِهِ نَحْمَدُهُ عَلَى آلَائِهِ وَ تَظَاهُرِ نَعْمَائِهِ حَمْداً يَزِنُ عَظَمَةَ جَلَالِهِ وَ يَمْلَأُ قَدْرَ آلَائِهِ وَ كِبْرِيَائِهِ وَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ الَّذِي كَانَ فِي أَوَّلِيَّتِهِ مُتَقَادِماً وَ فِي دَيْمُومِيَّتِهِ مُتَسَيْطِراً خَضَعَ الْخَلَائِقُ لِوَحْدَانِيَّتِهِ وَ رُبُوبِيَّتِهِ وَ قَدِيمِ أَزَلِيَّتِهِ وَ دَانُوا لِدَوَامِ أَبَدِيَّتِهِ ", "وَ أَشْهَدُ أَنَّ مُحَمَّداً (صلى الله عليه وآله) عَبْدُهُ وَ رَسُولُهُ وَ خِيَرَتُهُ مِنْ خَلْقِهِ اخْتَارَهُ بِعِلْمِهِ وَ اصْطَفَاهُ لِوَحْيِهِ وَ ائْتَمَنَهُ عَلَى سِرِّهِ وَ ارْتَضَاهُ لِخَلْقِهِ وَ انْتَدَبَهُ لِعَظِيمِ أَمْرِهِ وَ لِضِيَاءِ مَعَالِمِ دِينِهِ وَ مَنَاهِجِ سَبِيلِهِ وَ مِفْتَاحِ وَحْيِهِ وَ سَبَباً لِبَابِ رَحْمَتِهِ ابْتَعَثَهُ عَلَى حِينِ فَتْرَةٍ مِنَ الرُّسُلِ وَ هَدْأَةٍ مِنَ الْعِلْمِ وَ اخْتِلَافٍ مِنَ الْمِلَلِ وَ ضَلَالٍ عَنِ الْحَقِّ وَ جَهَالَةٍ بِالرَّبِّ وَ كُفْرٍ بِالْبَعْثِ وَ الْوَعْدِ أَرْسَلَهُ إِلَى النَّاسِ أَجْمَعِينَ رَحْمَةً لِلْعَالَمِينَ بِكِتَابٍ كَرِيمٍ قَدْ فَضَّلَهُ وَ فَصَّلَهُ وَ بَيَّنَهُ وَ أَوْضَحَهُ وَ أَعَزَّهُ وَ حَفِظَهُ مِنْ أَنْ يَأْتِيَهُ الْبَاطِلُ مِنْ بَيْنِ يَدَيْهِ وَ مِنْ خَلْفِهِ تَنْزِيلٍ مِنْ حَكِيمٍ حَمِيدٍ ضَرَبَ لِلنَّاسِ فِيهِ الْأَمْثَالَ وَ صَرَّفَ فِيهِ الْآيَاتِ لَعَلَّهُمْ يَعْقِلُونَ أَحَلَّ فِيهِ الْحَلَالَ وَ حَرَّمَ فِيهِ الْحَرَامَ وَ شَرَعَ فِيهِ الدِّينَ لِعِبَادِهِ عُذْراً وَ نُذْراً لِئَلَّا يَكُونَ لِلنَّاسِ عَلَى اللَّهِ حُجَّةٌ بَعْدَ الرُّسُلِ وَ يَكُونَ بَلَاغاً لِقَوْمٍ عَابِدِينَ فَبَلَّغَ رِسَالَتَهُ وَ جَاهَدَ فِي سَبِيلِهِ وَ عَبَدَهُ حَتَّى أَتَاهُ الْيَقِينُ صَلَّى اللَّهِ عَلَيْهِ وَ آلِهِ وَ سَلَّمَ تَسْلِيماً كَثِيراً ", "أُوصِيكُمْ عِبَادَ اللَّهِ وَ أُوصِي نَفْسِي بِتَقْوَى اللَّهِ الَّذِي ابْتَدَأَ الْأُمُورَ بِعِلْمِهِ وَ إِلَيْهِ يَصِيرُ غَداً مِيعَادُهَا وَ بِيَدِهِ فَنَاؤُهَا وَ فَنَاؤُكُمْ وَ تَصَرُّمُ أَيَّامِكُمْ وَ فَنَاءُ آجَالِكُمْ وَ انْقِطَاعُ مُدَّتِكُمْ فَكَأَنْ قَدْ زَالَتْ عَنْ قَلِيلٍ عَنَّا وَ عَنْكُمْ كَمَا زَالَتْ عَمَّنْ كَانَ قَبْلَكُمْ ", "فَاجْعَلُوا عِبَادَ اللَّهِ اجْتِهَادَكُمْ فِي هَذِهِ الدُّنْيَا التَّزَوُّدَ مِنْ يَوْمِهَا الْقَصِيرِ لِيَوْمِ الْآخِرَةِ الطَّوِيلِ فَإِنَّهَا دَارُ عَمَلٍ وَ الْآخِرَةَ دَارُ الْقَرَارِ وَ الْجَزَاءِ فَتَجَافَوْا عَنْهَا فَإِنَّ الْمُغْتَرَّ مَنِ اغْتَرَّ بِهَا لَنْ تَعْدُوَ الدُّنْيَا إِذَا تَنَاهَتْ إِلَيْهَا أُمْنِيَّةُ أَهْلِ الرَّغْبَةِ فِيهَا الْمُحِبِّينَ لَهَا الْمُطْمَئِنِّينَ إِلَيْهَا الْمَفْتُونِينَ بِهَا أَنْ تَكُونَ كَمَا قَالَ اللَّهُ عَزَّ وَ جَلَّ كَماءٍ أَنْزَلْناهُ مِنَ السَّماءِ فَاخْتَلَطَ بِهِ نَباتُ الْأَرْضِ مِمَّا يَأْكُلُ النَّاسُ وَ الْأَنْعامُ الْآيَةَ ", "مَعَ أَنَّهُ لَمْ يُصِبِ امْرُؤٌ مِنْكُمْ فِي هَذِهِ الدُّنْيَا حَبْرَةً إِلَّا أَوْرَثَتْهُ عَبْرَةً وَ لَا يُصْبِحُ فِيهَا فِي جَنَاحٍ آمِنٍ إِلَّا وَ هُوَ يَخَافُ فِيهَا نُزُولَ جَائِحَةٍ أَوْ تَغَيُّرَ نِعْمَةٍ أَوْ زَوَالَ عَافِيَةٍ مَعَ أَنَّ الْمَوْتَ مِنْ وَرَاءِ ذَلِكَ وَ هَوْلَ الْمُطَّلَعِ وَ الْوُقُوفَ بَيْنَ يَدَيِ الْحَكَمِ الْعَدْلِ تُجْزَى كُلُّ نَفْسٍ بِمَا عَمِلَتْ لِيَجْزِيَ الَّذِينَ أَساؤُا بِما عَمِلُوا وَ يَجْزِيَ الَّذِينَ أَحْسَنُوا بِالْحُسْنَى", "فَاتَّقُوا اللَّهَ عَزَّ ذِكْرُهُ وَ سَارِعُوا إِلَى رِضْوَانِ اللَّهِ وَ الْعَمَلِ بِطَاعَتِهِ وَ التَّقَرُّبِ إِلَيْهِ بِكُلِّ مَا فِيهِ الرِّضَا فَإِنَّهُ قَرِيبٌ مُجِيبٌ جَعَلَنَا اللَّهُ وَ إِيَّاكُمْ مِمَّنْ يَعْمَلُ بِمَحَابِّهِ وَ يَجْتَنِبُ سَخَطَهُ ", "ثُمَّ إِنَّ أَحْسَنَ الْقَصَصِ وَ أَبْلَغَ الْمَوْعِظَةِ وَ أَنْفَعَ التَّذَكُّرِ كِتَابُ اللَّهِ جَلَّ وَ عَزَّ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ إِذا قُرِئَ الْقُرْآنُ فَاسْتَمِعُوا لَهُ وَ أَنْصِتُوا لَعَلَّكُمْ تُرْحَمُونَ أَسْتَعِيذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ وَ الْعَصْرِ إِنَّ الْإِنْسانَ لَفِي خُسْرٍ إِلَّا الَّذِينَ آمَنُوا وَ عَمِلُوا الصَّالِحاتِ وَ تَواصَوْا بِالْحَقِّ وَ تَواصَوْا بِالصَّبْرِ إِنَّ اللَّهَ وَ مَلائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ يا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَ سَلِّمُوا تَسْلِيماً اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ بَارِكْ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ تَحَنَّنْ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ سَلِّمْ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ كَأَفْضَلِ مَا صَلَّيْتَ وَ بَارَكْتَ وَ تَرَحَّمْتَ وَ تَحَنَّنْتَ وَ سَلَّمْتَ عَلَى إِبْرَاهِيمَ وَ آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ ", "اللَّهُمَّ أَعْطِ مُحَمَّداً الْوَسِيلَةَ وَ الشَّرَفَ وَ الْفَضِيلَةَ وَ الْمَنْزِلَةَ الْكَرِيمَةَ اللَّهُمَّ اجْعَلْ مُحَمَّداً وَ آلَ مُحَمَّدٍ أَعْظَمَ الْخَلَائِقِ كُلِّهِمْ شَرَفاً يَوْمَ الْقِيَامَةِ وَ أَقْرَبَهُمْ مِنْكَ مَقْعَداً وَ أَوْجَهَهُمْ عِنْدَكَ يَوْمَ الْقِيَامَةِ جَاهاً وَ أَفْضَلَهُمْ عِنْدَكَ مَنْزِلَةً وَ نَصِيباً اللَّهُمَّ أَعْطِ مُحَمَّداً أَشْرَفَ الْمَقَامِ وَ حِبَاءَ السَّلَامِ وَ شَفَاعَةَ الْإِسْلَامِ اللَّهُمَّ وَ أَلْحِقْنَا بِهِ غَيْرَ خَزَايَا وَ لَا نَاكِبِينَ وَ لَا نَادِمِينَ وَ لَا مُبَدِّلِينَ إِلَهَ الْحَقِّ آمِينَ ", "ثُمَّ جَلَسَ قَلِيلًا ثُمَّ قَامَ فَقَالَ الْحَمْدُ لِلَّهِ أَحَقَّ مَنْ خُشِيَ وَ حُمِدَ وَ أَفْضَلَ مَنِ اتُّقِيَ وَ عُبِدَ وَ أَوْلَى مَنْ عُظِّمَ وَ مُجِّدَ نَحْمَدُهُ لِعَظِيمِ غَنَائِهِ وَ جَزِيلِ عَطَائِهِ وَ تَظَاهُرِ نَعْمَائِهِ وَ حُسْنِ بَلَائِهِ وَ نُؤْمِنُ بِهُدَاهُ الَّذِي لَا يَخْبُو ضِيَاؤُهُ وَ لَا يَتَمَهَّدُ سَنَاؤُهُ وَ لَا يُوهَنُ عُرَاهُ وَ نَعُوذُ بِاللَّهِ مِنْ سُوءِ كُلِّ الرَّيْبِ وَ ظُلَمِ الْفِتَنِ وَ نَسْتَغْفِرُهُ مِنْ مَكَاسِبِ الذُّنُوبِ وَ نَسْتَعْصِمُهُ مِنْ مَسَاوِي الْأَعْمَالِ وَ مَكَارِهِ الْآمَالِ وَ الْهُجُومِ فِي الْأَهْوَالِ وَ مُشَارَكَةِ أَهْلِ الرَّيْبِ وَ الرِّضَا بِمَا يَعْمَلُ الْفُجَّارُ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ ", "اللَّهُمَّ اغْفِرْ لَنَا وَ لِلْمُؤْمِنِينَ وَ الْمُؤْمِنَاتِ الْأَحْيَاءِ مِنْهُمْ وَ الْأَمْوَاتِ الَّذِينَ تَوَفَّيْتَهُمْ عَلَى دِينِكَ وَ مِلَّةِ نَبِيِّكَ (صلى الله عليه وآله) اللَّهُمَّ تَقَبَّلْ حَسَنَاتِهِمْ وَ تَجَاوَزْ عَنْ سَيِّئَاتِهِمْ وَ أَدْخِلْ عَلَيْهِمُ الرَّحْمَةَ وَ الْمَغْفِرَةَ وَ الرِّضْوَانَ وَ اغْفِرْ لِلْأَحْيَاءِ مِنَ الْمُؤْمِنِينَ وَ الْمُؤْمِنَاتِ الَّذِينَ وَحَّدُوكَ وَ صَدَّقُوا رَسُولَكَ وَ تَمَسَّكُوا بِدِينِكَ وَ عَمِلُوا بِفَرَائِضِكَ وَ اقْتَدَوْا بِنَبِيِّكَ وَ سَنُّوا سُنَّتَكَ وَ أَحَلُّوا حَلَالَكَ وَ حَرَّمُوا حَرَامَكَ وَ خَافُوا عِقَابَكَ وَ رَجَوْا ثَوَابَكَ وَ وَالَوْا أَوْلِيَاءَكَ وَ عَادَوْا أَعْدَاءَكَ اللَّهُمَّ اقْبَلْ حَسَنَاتِهِمْ وَ تَجَاوَزْ عَنْ سَيِّئَاتِهِمْ وَ أَدْخِلْهُمْ بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ إِلَهَ الْحَقِّ آمِينَ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473318\">H 14642</a> – Ali Bin Ibrahim, from his father, from Al-Hassan Bin Mahboub, from Muhammad Bin Al-No’man, who has narrated the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> mentioned this sermon of Amir-ul-Momineen<sup>asws</sup> on the day of Friday : - ‘All Praise is for Allah<sup>azwj</sup> Who<sup>azwj</sup> is Deserving of all Praise and is the Guardian of it, and all Praise ends to Him<sup>azwj</sup> in its rightful place, the Initiator, and Inventor, the Majestic, the Magnificent, the Mighty, the Benevolent, the only One for the Greatness, and the Unique One for the Highness, the Omnipotent with Esteem, and the Overcomer by His<sup>azwj</sup> Omnipotence, the Preventer by His<sup>azwj</sup> Force, the Dominant by His<sup>azwj</sup> Power, Higher than everything by His<sup>azwj</sup> Compulsiveness, the Praised One by His<sup>azwj</sup> Gratitude and by His<sup>azwj</sup> Favours, the Provider by His<sup>azwj</sup> Gifts, and excessive Benefits, the Expansive in His<sup>azwj</sup> Sustenance, the Bestower by His<sup>azwj</sup> Bounties. We Praise Him<sup>azwj</sup> for His<sup>azwj</sup> Bounties and apparent Blessings, with a Praise weighed by His<sup>azwj</sup> Greatness and His<sup>azwj</sup> Majesty, and filled by His<sup>azwj</sup> Blessings and Greatness. And I<sup>asws</sup> testify that there is no god except for Allah<sup>azwj</sup>, One with no associates to Him<sup>azwj</sup>, Who<sup>azwj</sup> was in His<sup>azwj</sup> Existence as Foremost and in His<sup>azwj</sup> Everlasting. Veiled from the creatures was His<sup>azwj</sup> Oneness, and His<sup>azwj</sup> Lordship, and His<sup>azwj</sup> being Eternal, and they were submitted to the continuance of time.", "And I<sup>asws</sup> testify that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant, and His<sup>azwj</sup> Messenger<sup>saww</sup>, and His<sup>azwj</sup> elite from His<sup>azwj</sup> creatures having Chosen him<sup>saww</sup> with His<sup>azwj</sup> Knowledge and Selected him<sup>saww</sup> for His<sup>azwj</sup> Revelation, and Relied upon him<sup>saww</sup> for His<sup>azwj</sup> Secret, and was Pleased with him<sup>saww</sup> for His<sup>azwj</sup> creatures, Assigned him<sup>saww</sup> for His<sup>azwj</sup> Great Command as a beacon for the Principles of His<sup>azwj</sup> Religion and a Program for His<sup>azwj</sup> Way, and an Opener for His<sup>azwj</sup> Revelation, as a Reason for the Door of His<sup>azwj</sup> Mercy. He<sup>azwj</sup> Sent him<sup>saww</sup> during a gap from the Messengers<sup>as</sup>, and Guides from the Knowledge, and during fatigue from the differing and straying from the truth, and ignorance about the Lord<sup>azwj</sup>, and denial of the Resurrection, and the Promise that He<sup>azwj</sup> Sent him<sup>saww</sup> to all the people as a Mercy to the Worlds by the Honourable Book which He<sup>azwj</sup> had Excelled it, and Detailed it, and Explained it, and Clarified it, and Strengthened it, and Preserved it from it being approached by the falsehood from its front and from its back. ", "A Revelation from the Most Wise and Praised One<sup>azwj</sup>. In it He<sup>azwj</sup> struck examples, and Gave therein Signs for the ones who have intellect. He<sup>azwj</sup> Permitted therein the Permissibles and Prohibited therein the Prohibitions, and Legalised therein the Religion for His<sup>azwj</sup> servants, Giving Excuses and Warnings so that they would become a Proof for the people to Allah<sup>azwj</sup> after the Messengers<sup>as</sup> and become a Preaching for a worshipping people. So he<sup>saww</sup> preached His<sup>azwj</sup> Message, and strived in His<sup>azwj</sup> Way, and worshipped Him<sup>azwj</sup> they were convinced. May Greetings of Allah<sup>azwj</sup> be upon him<sup>saww</sup> and his<sup>saww</sup> Progeny<sup>asws</sup>, and submission to him<sup>saww</sup> be a lot of Peace.", "I<sup>asws</sup> advise you, O servants of Allah<sup>azwj</sup> to fear Allah<sup>azwj</sup> Who Began the affairs by His<sup>azwj</sup> Knowledge and to Him<sup>azwj</sup> is their journey tomorrow for its end. And in His<sup>azwj</sup> Hand is their extinction, and your extinction, and the expiration for your days, and the extermination of your allocated terms, and the cutting off of your terms. So, very shortly it would pass by you all just as it had left the ones who were before you all.", "Servants of Allah<sup style=\"font-weight: normal\">azwj</sup>! Make your striving in this world to provide from these short-lived days for the days of the Hereafter which are prolonged, for this is the house for the deeds and the Hereafter is the house for dwelling in, and the Recompense. So abandon it (the world), for deceived is the one who is deceived by its deception. Do not rely upon the world by attaching your hopes and become the ones who love it, the ones who covet it, the ones who are fascinated by it just like what Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic has Said: <span class=\"ibTxt\">“[10:24] The likeness of this world's life is only as water which We send down from the cloud, then the herbage of the earth of which men and cattle eat grows luxuriantly thereby, until when the earth puts on its golden raiment and it becomes garnished, and its people think that they have power over it, Our command comes to it, by night or by day, so We render it as reaped seed; produce, as though it had not been in existence yesterday; thus do We make clear the communications for a people who reflect”.</span>", "Along with that, a person never got experience in this world except that he inherited a lesson from it, nor did he wake up in the morning feeling secure except that he feared in it the descent of a catastrophe, or a change in bounties or a decline in health, with the death right behind that, and the trepidation of the Pausing in front of the Wise and Just One<sup>azwj</sup> Recompensing every soul with what it had done <span class=\"ibTxt\">“[53:31] that He may reward those who do evil according to what they do, and (that) He may reward those who do good with goodness”</span>.", "So fear Allah<sup>azwj</sup>, Mighty is His<sup>azwj</sup> Mention, and hasten to the Pleasure of Allah<sup>azwj</sup>, and the deeds with obedience to Him<sup>azwj</sup>, and get closer to Him<sup>azwj</sup> with everything in which there is His<sup>azwj</sup> Pleasure for He<sup>azwj</sup> is Near and Answers. May Allah<sup>azwj</sup> Make us<sup>asws</sup> and you all of those who act towards His<sup>azwj</sup> Love and keep aside from His<sup>azwj</sup> Harshness. ", "Then the best of the stories, and the best of the Advice, and the most beneficial of the Remembrance is the Book of Allah<sup>azwj</sup> Majestic and Mighty. Allah<sup>azwj</sup> Mighty and Majestic has Said: <span class=\"ibTxt\">“[7:204] And when the Quran is recited, then listen to it and remain silent, that mercy may be shown to you”</span>. I<sup>asws</sup> seek Refuge with Allah<sup>azwj</sup> from the Satan<sup>la</sup> the castaway. In the Name of Allah<sup>azwj</sup> the Beneficent the Merciful <span class=\"ibTxt\">“[103:1] I swear by the time, [103:2] Most surely man is in loss, [103:3] Except those who believe and do good, and enjoin on each other truth, and enjoin on each other patience”</span>. <span class=\"ibTxt\">“[33:56] Surely Allah and His angels bless the Prophet; O you who believe! call for (Divine) blessings on him and salute him with a (becoming) salutation”</span>. Our Allah<sup>azwj</sup>! Send Greetings upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and Blessings upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and yearning upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad, and Peace upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> higher than what You<sup>azwj</sup> had Greeted, and Blessed, and Mercy, and Yearning, and Peace upon Ibrahim<sup>as</sup> and the Progeny of Ibrahim<sup>as</sup>, You<sup>azwj</sup> are the Most Praised and Most Glorious’.", "Our Allah<sup>azwj</sup>! Grant to Muhammad<sup>saww</sup> the ‘الْوَسِيلَةَ’ Means, and the ‘الشَّرَفَ’ Dignity, and the ‘الْفَضِيلَةَ’ Preference, and the ‘الْمَنْزِلَةَ الْكَرِيمَةَ’ Honourable Status. Our Allah<sup>azwj</sup>! Make Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad to be the greatest of all creatures, all of them<sup>asws</sup> as Dignitaries on the Day of Judgement, the nearest to You<sup>azwj</sup> in seating, the most eminent of faces in Your<sup>azwj</sup> Presence on the Day of Judgement, the most prestigious and preferential in Your<sup>azwj</sup> Presence in status and share. Our Allah<sup>azwj</sup>! Grant to Muhammad<sup>saww</sup> the most Dignified of the status, and Bestow the Peace and intercession of Al-Islam. Our Allah<sup>azwj</sup>! And join us all with him<sup>saww</sup>, without failure, or loss, or remorse or alteration. O Lord<sup>azwj</sup> of the ‘الْحَقِّ’ Just! Amen!’", "Then he<sup>asws</sup> sat down for a while, then stood up and said: ‘The Praise is due to Allah<sup>azwj</sup> the One most deserving to be Awed and Praised, and the Foremost for the one who fears and worships, and the Highest for the one who Magnifies and Glorifies. We Praise Him<sup>azwj</sup> for His<sup>azwj</sup> Great Benevolence, and Excessive Grants, and apparent of His<sup>azwj</sup> Favours, and the goodness of His<sup>azwj</sup> Trials. And we believe in His<sup>azwj</sup> Guidance whose light does not get extinguished, nor does His<sup>azwj</sup> Extol be fully expressed, Whose Handle does not weaken. We seek Refuge with Allah<sup>azwj</sup> from the evil of every doubt, and the darkness of the strife, and we seek Forgiveness from the accumulation of the sins, and seek Protection from Him<sup>azwj</sup> from the wickedness of the deeds, and the detestable hopes, and the attacks of the terrors, and association with the people of the doubt, and the happiness with what the immoral ones do in the earth without having any right to do so.  ", "Our Allah<sup>azwj</sup>! Forgive us, and the Believing men and the Believing women, the living ones among them and the dead who You<sup>azwj</sup> have Made to die upon Your<sup>azwj</sup> Religion, and the Nation of Your<sup>azwj</sup> Prophet<sup>saww</sup>. Our Allah<sup>azwj</sup>, Accept their good deeds, and Overlook their sins, and Make Mercy to enter upon them, and the Forgiveness, and the Pleasure. And Forgive the living ones from the Believing men and the Believing women who believed in Your<sup>azwj</sup> Oneness, and ratified Your<sup>azwj</sup> Messenger<sup>saww</sup>, and attached themselves to Your<sup>azwj</sup> Religion, and acted upon Your<sup>azwj</sup> Obligations, and followed Your<sup>azwj</sup> Prophet<sup>saww</sup>, and made Your<sup>azwj</sup> Sunnah to be their Sunnah, and permitted for themselves Your<sup>azwj</sup> Permissibles, and Prohibited for themselves Your<sup>azwj</sup> Prohibitions, and feared Your<sup>azwj</sup> Punishment, and hoped for Your<sup>azwj</sup> Rewards, and befriended Your<sup>azwj</sup> friends, and were inimical to Your<sup>azwj</sup> enemies. Our Allah<sup>azwj</sup>! Accept their good deeds, and Overlook their sins, and Keep them, by Your<sup>azwj</sup> Mercy, with the righteous servants, O Lord<sup>azwj</sup> of the ‘الْحَقِّ’ Just. Amen!’"]}}, {"index": 14868, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:2", "text": ["14643- الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ (عليه السلام) يَقُولُ لِكُلِّ مُؤْمِنٍ حَافِظٌ وَ سَائِبٌ قُلْتُ وَ مَا الْحَافِظُ وَ مَا السَّائِبُ يَا أَبَا جَعْفَرٍ قَالَ الْحَافِظُ مِنَ اللَّهِ تَبَارَكَ وَ تَعَالَى حَافِظٌ مِنَ الْوَلَايَةِ يَحْفَظُ بِهِ الْمُؤْمِنَ أَيْنَمَا كَانَ وَ أَمَّا السَّائِبُ فَبِشَارَةُ مُحَمَّدٍ (صلى الله عليه وآله) يُبَشِّرُ اللَّهُ تَبَارَكَ وَ تَعَالَى بِهَا الْمُؤْمِنَ أَيْنَمَا كَانَ وَ حَيْثُمَا كَانَ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473319\">H 14643</a> – Al-Husayn Bin Muhammad Al-Ashary, from Moalla Bin Muhammad, from Al-Hassan Bin Ali Al-Washa, from Muhammad Bin Al-Fazeyl, from Abu Hamza who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> heard Abu Ja’far</span><sup>asws</sup> saying: ‘For every Believer is a Protector and an Informer (Sa’ib)’. I said, ‘And what is the Protector, and what is the Informer, O Abu Ja’far<sup>asws</sup>?’ He<sup>asws</sup> said: ‘The Protector from Allah<sup>azwj</sup> Blessed and High, Protecting from Al-Wilayah by which the Believer is protected wherever he may be. And as for the Informer, so it is the good news of Muhammad<sup>saww</sup> which Allah<sup>azwj</sup> Blessed and High Gives to the Believer wherever he may be whatever situation he may be in’."]}}, {"index": 14869, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:3", "text": ["14644- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَجَّالِ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ خَالِطِ النَّاسَ تَخْبُرْهُمْ وَ مَتَى تَخْبُرْهُمْ تَقْلِهِمْ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473320\">H 14644</a> – A number of our companions, from Sahl Bin Ziyad, from Al-Hajjaal, from hammaad, from Al-Halby, who has narrated the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘Intermingle with the people to find out about them, and when you find out about them, (only then) travel/associate with them’."]}}, {"index": 14870, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:4", "text": ["14645- سَهْلٌ عَنْ بَكْرِ بْنِ صَالِحٍ رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ النَّاسُ مَعَادِنُ كَمَعَادِنِ الذَّهَبِ وَ الْفِضَّةِ فَمَنْ كَانَ لَهُ فِي الْجَاهِلِيَّةِ أَصْلٌ فَلَهُ فِي الْإِسْلَامِ أَصْلٌ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473321\">H 14645</a> – Sahl, from Bakr Bin Saleh with an unbroken chain from Abu Abdullah<sup>asws</sup> the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘The people are (similar to) a mine, like a mine of gold and that of silver. So they had an origin in the days of ignorance (pre-Islam), so there are (very few) who had an origin in Al-Islam’."]}}, {"index": 14871, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:5", "text": ["14646- سَهْلُ بْنُ زِيَادٍ عَنْ بَكْرِ بْنِ صَالِحٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ قَالَ تَمَثَّلَ أَبُو عَبْدِ اللَّهِ (عليه السلام) بِبَيْتِ شِعْرٍ لِابْنِ أَبِي عَقِبٍ وَ يُنْحَرُ بِالزَّوْرَاءِ مِنْهُمْ لَدَى الضُّحَى ثَمَانُونَ أَلْفاً مِثْلُ مَا تُنْحَرُ الْبُدْنُ [وَ رَوَى غَيْرُهُ الْبُزَّلُ] ثُمَّ قَالَ لِي تَعْرِفُ الزَّوْرَاءَ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ يَقُولُونَ إِنَّهَا بَغْدَادُ قَالَ لَا ثُمَّ قَالَ (عليه السلام) دَخَلْتَ الرَّيَّ قُلْتُ نَعَمْ قَالَ أَتَيْتَ سُوقَ الدَّوَابِّ قُلْتُ نَعَمْ قَالَ رَأَيْتَ الْجَبَلَ الْأَسْوَدَ عَنْ يَمِينِ الطَّرِيقِ تِلْكَ الزَّوْرَاءُ يُقْتَلُ فِيهَا ثَمَانُونَ أَلْفاً مِنْهُمْ ثَمَانُونَ رَجُلًا مِنْ وُلْدِ فُلَانٍ كُلُّهُمْ يَصْلُحُ لِلْخِلَافَةِ قُلْتُ وَ مَنْ يَقْتُلُهُمْ جُعِلْتُ فِدَاكَ قَالَ يَقْتُلُهُمْ أَوْلَادُ الْعَجَمِ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473322\">H 14646</a> – Sahl Bin Ziyad, from Bakr Bin Saleh, from Muhammad Bin Sinan, from Muawiya Bin Wahab who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>bu Abdullah</span><sup>asws</sup> quoted a verse from the poem of Ibn Abu Aqab as an example, ‘And there shall be slaughtered at Al-Zawra eighty thousand from among them, in the forenoon like the slaughtering of sacrificial animals’ (and others have reported it as ‘in the drain’). Then he<sup>asws</sup> said to me: ‘Do you know of Al-Zawra?’ I said, ‘May I be sacrificed for you<sup>asws</sup>, they are saying that it is Baghdad’. He<sup>asws</sup> said: ‘No’. Then he<sup>asws</sup> said: ‘Have you been to Al-Rayy?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘Did you come across the animal market?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘Have you seen the black mountain on the right? Well, that is Al-Zawra, in which eighty thousand would be killed, including eighty men from among them from the children of so and so, all of them being suitable for the ‘لِلْخِلَافَةِ’ succession’. I said, ‘May I be sacrificed for you<sup>asws</sup>, and who would be killing them?’ He<sup>asws</sup> said: ‘They would be killed by the ‘أَوْلَادُ الْعَجَمِ’ children of non-Arabs.’"]}}, {"index": 14872, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:6", "text": ["14647- عَلِيُّ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْعَبَّاسِ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ الَّذِينَ إِذا ذُكِّرُوا بِآياتِ رَبِّهِمْ لَمْ يَخِرُّوا عَلَيْها صُمًّا وَ عُمْياناً قَالَ مُسْتَبْصِرِينَ لَيْسُوا بِشُكَّاكٍ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473323\">H 14647</a> – Ali Bin Muhammad, from Ali Bin Al-Abbas, from Muhammad Bin Ziyad, from Abu Baseer who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> asked Abu Abdullah</span><sup>asws</sup> about the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[25:73] And they who, when reminded of the Signs of their Lord, do not fall down at them as if they were deaf or blind”</span>. He<sup>asws</sup> said: ‘Those who embrace (the Signs<a id=\"_ftnref21\"></a><sup>[21]</sup> of Allah) without any doubts’."]}}, {"index": 14873, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:7", "text": ["14648- عَنْهُ عَنْ عَلِيٍّ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ حَمَّادِ بْنِ عُثْمَانَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ فِي قَوْلِ اللَّهِ تَبَارَكَ وَ تَعَالَى وَ لا يُؤْذَنُ لَهُمْ فَيَعْتَذِرُونَ فَقَالَ اللَّهُ أَجَلُّ وَ أَعْدَلُ وَ أَعْظَمُ مِنْ أَنْ يَكُونَ لِعَبْدِهِ عُذْرٌ لَا يَدَعُهُ يَعْتَذِرُ بِهِ وَ لَكِنَّهُ فُلِجَ فَلَمْ يَكُنْ لَهُ عُذْرٌ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473324\">H 14648</a> – From him, from Ali, from Ismail Bin Mahraan, from Hammad Bin Busman who said, ", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> heard Abu Abdullah</span><sup>asws</sup> saying with regards to the Statement of Allah<sup>azwj</sup> Blessed and High: <span class=\"ibTxt\">“[77:36] And permission shall not be given to them so that they should offer excuses”</span>. So Imam<sup>asws</sup> said: ‘Allah<sup>azwj</sup> is more Majestic, and Just, and Greater than it, that if a servant has an excuse, He<sup>azwj</sup> would not Allow it to be presented by him. But, rather (it means that) he would fail and run out of excuses’."]}}, {"index": 14874, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:8", "text": ["14649- عَلِيٌّ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدٍ الْكُنَاسِيِّ قَالَ حَدَّثَنَا مَنْ رَفَعَهُ إِلَى أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِهِ عَزَّ ذِكْرُهُ وَ مَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مَخْرَجاً وَ يَرْزُقْهُ مِنْ حَيْثُ لا يَحْتَسِبُ قَالَ هَؤُلَاءِ قَوْمٌ مِنْ شِيعَتِنَا ضُعَفَاءُ لَيْسَ عِنْدَهُمْ مَا يَتَحَمَّلُونَ بِهِ إِلَيْنَا فَيَسْمَعُونَ حَدِيثَنَا وَ يَقْتَبِسُونَ مِنْ عِلْمِنَا فَيَرْحَلُ قَوْمٌ فَوْقَهُمْ وَ يُنْفِقُونَ أَمْوَالَهُمْ وَ يُتْعِبُونَ أَبْدَانَهُمْ حَتَّى يَدْخُلُوا عَلَيْنَا فَيَسْمَعُوا حَدِيثَنَا فَيَنْقُلُونَهُ إِلَيْهِمْ فَيَعِيهِ هَؤُلَاءِ وَ تُضَيِّعُهُ هَؤُلَاءِ فَأُولَئِكَ الَّذِينَ يَجْعَلُ اللَّهُ عَزَّ ذِكْرُهُ لَهُمْ مَخْرَجاً وَ يَرْزُقُهُمْ مِنْ حَيْثُ لَا يَحْتَسِبُونَ ", "وَ فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ هَلْ أَتاكَ حَدِيثُ الْغاشِيَةِ قَالَ الَّذِينَ يَغْشَوْنَ الْإِمَامَ إِلَى قَوْلِهِ عَزَّ وَ جَلَّ لا يُسْمِنُ وَ لا يُغْنِي مِنْ جُوعٍ قَالَ لَا يَنْفَعُهُمْ وَ لَا يُغْنِيهِمْ لَا يَنْفَعُهُمُ الدُّخُولُ وَ لَا يُغْنِيهِمُ الْقُعُودُ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473325\">H 14649</a> – Ali, from Ali Bin Al-Husayn, from Muhammad Al-Kunary who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span>t was narrated to</span> us with an unbroken chain going up to Abu Abdullah<sup>asws</sup> regarding His<sup>azwj</sup> Statement, Mighty is His<sup>azwj</sup> Mention: <span class=\"ibTxt\">“[65:2] and whoever is careful of (his duty to) Allah, He will make for him an outlet [65:3] And He provides for him from (sources) he never could imagine”</span>. He<sup>asws</sup> said: ‘These are our<sup>asws</sup> weak Shites who do not have the means in order to take it (directly) from us<sup>asws</sup>. So they hear our<sup>asws</sup> Hadeeth and they try to accumulate from our<sup>asws</sup> Knowledge. A people who are higher than them, who spend their wealth, tiring their bodies to the extent that they came up to us<sup>asws</sup>, hear our<sup>asws</sup> Hadeeth and transmit these to them. So these ones preserve them, whilst those ones waste them. So they are the ones for whom Allah<sup>azwj</sup> Mighty is His<sup>azwj</sup> Mention Makes an outlet for them and Gives them Sustenance (Hadeeth) from a source which they had not even considered beforehand. ", "And with regards to the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[88:1] Has not there come to you the news of the overwhelming calamity?”</span> he<sup>asws</sup> said; ‘These are the ones who have cheated the Imam<sup>asws</sup>’ – up to the Statement of the Mighty and Majestic: <span class=\"ibTxt\">“[88:7] Which will neither nourish nor satisfy hunger”</span>, said: ‘It will neither benefit them, nor free them from needs, nor will it benefit them with the entering (marital relationships), nor free them from the need of sitting down (from begging for more)’."]}}, {"index": 14875, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:9", "text": ["14650- عَنْهُ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ ما يَكُونُ مِنْ نَجْوى ثَلاثَةٍ إِلَّا هُوَ رابِعُهُمْ وَ لا خَمْسَةٍ إِلَّا هُوَ سادِسُهُمْ وَ لا أَدْنى مِنْ ذلِكَ وَ لا أَكْثَرَ إِلَّا هُوَ مَعَهُمْ أَيْنَ ما كانُوا ثُمَّ يُنَبِّئُهُمْ بِما عَمِلُوا يَوْمَ الْقِيامَةِ إِنَّ اللَّهَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ قَالَ نَزَلَتْ هَذِهِ الْآيَةُ فِي فُلَانٍ وَ فُلَانٍ وَ أَبِي عُبَيْدَةَ الْجَرَّاحِ وَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَ سَالِمٍ مَوْلَى أَبِي حُذَيْفَةَ وَ الْمُغِيرَةِ بْنِ شُعْبَةَ حَيْثُ كَتَبُوا الْكِتَابَ بَيْنَهُمْ وَ تَعَاهَدُوا وَ تَوَافَقُوا لَئِنْ مَضَى مُحَمَّدٌ لَا تَكُونُ الْخِلَافَةُ فِي بَنِي هَاشِمٍ وَ لَا النُّبُوَّةُ أَبَداً فَأَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ فِيهِمْ هَذِهِ الْآيَةَ ", "قَالَ قُلْتُ قَوْلُهُ عَزَّ وَ جَلَّ أَمْ أَبْرَمُوا أَمْراً فَإِنَّا مُبْرِمُونَ أَمْ يَحْسَبُونَ أَنَّا لا نَسْمَعُ سِرَّهُمْ وَ نَجْواهُمْ بَلى وَ رُسُلُنا لَدَيْهِمْ يَكْتُبُونَ قَالَ وَ هَاتَانِ الْآيَتَانِ نَزَلَتَا فِيهِمْ ذَلِكَ الْيَوْمَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) لَعَلَّكَ تَرَى أَنَّهُ كَانَ يَوْمٌ يُشْبِهُ يَوْمَ كُتِبَ الْكِتَابُ إِلَّا يَوْمَ قُتِلَ الْحُسَيْنُ (عليه السلام) وَ هَكَذَا كَانَ فِي سَابِقِ عِلْمِ اللَّهِ عَزَّ وَ جَلَّ الَّذِي أَعْلَمَهُ رَسُولَ اللَّهِ (صلى الله عليه وآله) أَنْ إِذَا كُتِبَ الْكِتَابُ قُتِلَ الْحُسَيْنُ وَ خَرَجَ الْمُلْكُ مِنْ بَنِي هَاشِمٍ فَقَدْ كَانَ ذَلِكَ كُلُّهُ ", "قُلْتُ وَ إِنْ طائِفَتانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُما فَإِنْ بَغَتْ إِحْداهُما عَلَى الْأُخْرى فَقاتِلُوا الَّتِي تَبْغِي حَتَّى تَفِي‏ءَ إِلى أَمْرِ اللَّهِ فَإِنْ فاءَتْ فَأَصْلِحُوا بَيْنَهُما بِالْعَدْلِ قَالَ الْفِئَتَانِ إِنَّمَا جَاءَ تَأْوِيلُ هَذِهِ الْآيَةِ يَوْمَ الْبَصْرَةِ وَ هُمْ أَهْلُ هَذِهِ الْآيَةِ وَ هُمُ الَّذِينَ بَغَوْا عَلَى أَمِيرِ الْمُؤْمِنِينَ (عليه السلام) فَكَانَ الْوَاجِبَ عَلَيْهِ قِتَالُهُمْ وَ قَتْلُهُمْ حَتَّى يَفِيئُوا إِلَى أَمْرِ اللَّهِ وَ لَوْ لَمْ يَفِيئُوا لَكَانَ الْوَاجِبَ عَلَيْهِ فِيمَا أَنْزَلَ اللَّهُ أَنْ لَا يَرْفَعَ السَّيْفَ عَنْهُمْ حَتَّى يَفِيئُوا وَ يَرْجِعُوا عَنْ رَأْيِهِمْ لِأَنَّهُمْ بَايَعُوا طَائِعِينَ غَيْرَ كَارِهِينَ وَ هِيَ الْفِئَةُ الْبَاغِيَةُ كَمَا قَالَ اللَّهُ تَعَالَى ", "فَكَانَ الْوَاجِبَ عَلَى أَمِيرِ الْمُؤْمِنِينَ (عليه السلام) أَنْ يَعْدِلَ فِيهِمْ حَيْثُ كَانَ ظَفِرَ بِهِمْ كَمَا عَدَلَ رَسُولُ اللَّهِ (صلى الله عليه وآله) فِي أَهْلِ مَكَّةَ إِنَّمَا مَنَّ عَلَيْهِمْ وَ عَفَا وَ كَذَلِكَ صَنَعَ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) بِأَهْلِ الْبَصْرَةِ حَيْثُ ظَفِرَ بِهِمْ مِثْلَ مَا صَنَعَ النَّبِيُّ (صلى الله عليه وآله) بِأَهْلِ مَكَّةَ حَذْوَ النَّعْلِ بِالنَّعْلِ ", "قَالَ قُلْتُ قَوْلُهُ عَزَّ وَ جَلَّ وَ الْمُؤْتَفِكَةَ أَهْوى قَالَ هُمْ أَهْلُ الْبَصْرَةِ هِيَ الْمُؤْتَفِكَةُ ", "قُلْتُ وَ الْمُؤْتَفِكاتِ أَتَتْهُمْ رُسُلُهُمْ بِالْبَيِّناتِ قَالَ أُولَئِكَ قَوْمُ لُوطٍ ائْتَفَكَتْ عَلَيْهِمُ انْقَلَبَتْ عَلَيْهِمْ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473326\">H 14650</a> – From him, from Ali Bin Al-Husayn, from Ali Bin Abu hamza, from Abu Baseer, who has narrated the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> regarding the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[58:7] Nowhere is there a secret counsel between three persons but He is the fourth of them, nor (between) five but He is the sixth of them, nor less than that nor more but He is with them wheresoever they are; then He will inform them of what they did on the day of resurrection: surely Allah is Cognizant of all things”</span>. He<sup>asws</sup> said; ‘This was Revealed regarding so and so and so and so (Abu Bakr and Umar), and Abu Ubeyda Ibn Al-Jarrah, and Abdul Rahman Ibn Awf, and Saalim Mawla Abu Huzeyfa, and Al-Mugheira Bin Sho’ba, when they wrote the agreement in between them and took a pledge and agreed that if Muhammad<sup>saww</sup> were to pass away, they would not let the Caliphate to be in the Clan of Hashim, nor the Prophet-hood ever. So Allah<sup>azwj</sup> Mighty and Majestic Revealed this Verse with regards to them.", "I said, ‘The Statement of the Mighty and Majestic: <span class=\"ibTxt\">“[43:79] Or have they settled an affair? Then surely, We are the settlers. [43:80] Or do they think that We do not hear what they conceal and their secret discourses? Indeed (We do), and Our messengers are by them, to record”</span>. He<sup>asws</sup> said: ‘And these two Verse were Revealed regarding them on that day’. Abu Abdullah<sup>asws</sup> said: ‘Hopefully you will see that is was a day resembling the day of the writing of the agreement except for the day Al-Husayn<sup>asws</sup> was martyred, and thus it had preceded in the Knowledge of Allah<sup>azwj</sup> Mighty and Majestic which He<sup>azwj</sup> Made known to the Rasool Allah<sup>saww</sup> that when the agreement is written down, Al-Husayn<sup>asws</sup> would be martyred, and the kingdom would exit from the Clan of Hashim. So all of that did take place. ", "I said, ‘The Verse: <span class=\"ibTxt\">“[49:9] And if two parties of the believers quarrel, make peace between them; but if one of them acts wrongfully towards the other, fight that which acts wrongfully until it returns to Allah's command; then if it returns, make peace between them with justice and act equitably; surely Allah loves those who act equitably”</span>. He<sup>asws</sup> said: ‘The two groups, but rather its explanation came on the day of Al-Basra (The battle of the Camel), and they are the ones belonging to this Verse, and they are the ones who rebelled against Amir-ul-Momineen<sup>asws</sup>. So it was obligatory upon him<sup>asws</sup> to fight them, and he<sup>asws</sup> fought them until they submitted to the Command of Allah<sup>azwj</sup>. And had they not been submitted, it became obligatory upon him<sup>asws</sup> with regards to what Allah<sup>azwj</sup> Revealed, that he<sup>asws</sup> should not raise his sword (stop fighting) until they complied and returned from their opinions, because they had pledged their allegiances willingly, without compulsion. And this is the rebel group as Allah<sup>azwj</sup> the High has Said.", "So it was obligatory upon Amir-ul-Momineen<sup>asws</sup> that he<sup>asws</sup> should deal with justice among them when he<sup>asws</sup> was victorious over them, just as the Rasool Allah<sup>saww</sup> had been just among the people of Mecca, he<sup>saww</sup> was benevolent upon them and forgave them. And that is what Amir-ul-Momineen<sup>asws</sup> did with the people of Al-Basra when he<sup>asws</sup> was victorious over them similar to what the Rasool Allah<sup>saww</sup> did with the people of Mecca. Like a sandal follows a sandal (same footsteps).  ", "I said, ‘(What about) the Statement of the Mighty and Majestic: <span class=\"ibTxt\">“[53:53] And He destroyed the Overthrown Cities (of Sodom and Gomorrah)”</span>. He<sup>a</sup><sup>sws</sup> said: ‘These are the people of Al-Basra. It is the overthrown city’.", "I said, ‘(What about) <span class=\"ibTxt\">“[9:70] and the overthrown cities; their messengers came to them with clear arguments”</span>. He<sup>asws</sup> said: ‘They were the people of Lut<sup>as</sup>, their town was turned upside down upon them’."]}}, {"index": 14876, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:10", "text": ["14651- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ حَنَانٍ قَالَ سَمِعْتُ أَبِي يَرْوِي عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ كَانَ سَلْمَانُ جَالِساً مَعَ نَفَرٍ مِنْ قُرَيْشٍ فِي الْمَسْجِدِ فَأَقْبَلُوا يَنْتَسِبُونَ وَ يَرْفَعُونَ فِي أَنْسَابِهِمْ حَتَّى بَلَغُوا سَلْمَانَ فَقَالَ لَهُ عُمَرُ بْنُ الْخَطَّابِ أَخْبِرْنِي مَنْ أَنْتَ وَ مَنْ أَبُوكَ وَ مَا أَصْلُكَ فَقَالَ أَنَا سَلْمَانُ بْنُ عَبْدِ اللَّهِ كُنْتُ ضَالًّا فَهَدَانِي اللَّهُ عَزَّ وَ جَلَّ بِمُحَمَّدٍ (صلى الله عليه وآله) وَ كُنْتُ عَائِلًا فَأَغْنَانِي اللَّهُ بِمُحَمَّدٍ (صلى الله عليه وآله) وَ كُنْتُ مَمْلُوكاً فَأَعْتَقَنِي اللَّهُ بِمُحَمَّدٍ (صلى الله عليه وآله) هَذَا نَسَبِي وَ هَذَا حَسَبِي ", "قَالَ فَخَرَجَ رَسُولُ اللَّهِ (صلى الله عليه وآله) وَ سَلْمَانُ رَضِيَ اللَّهُ عَنْهُ يُكَلِّمُهُمْ فَقَالَ لَهُ سَلْمَانُ يَا رَسُولَ اللَّهِ مَا لَقِيتُ مِنْ هَؤُلَاءِ جَلَسْتُ مَعَهُمْ فَأَخَذُوا يَنْتَسِبُونَ وَ يَرْفَعُونَ فِي أَنْسَابِهِمْ حَتَّى إِذَا بَلَغُوا إِلَيَّ قَالَ عُمَرُ بْنُ الْخَطَّابِ مَنْ أَنْتَ وَ مَا أَصْلُكَ وَ مَا حَسَبُكَ فَقَالَ النَّبِيُّ (صلى الله عليه وآله) فَمَا قُلْتَ لَهُ يَا سَلْمَانُ قَالَ قُلْتُ لَهُ أَنَا سَلْمَانُ بْنُ عَبْدِ اللَّهِ كُنْتُ ضَالًّا فَهَدَانِي اللَّهُ عَزَّ ذِكْرُهُ بِمُحَمَّدٍ (صلى الله عليه وآله) وَ كُنْتُ عَائِلًا فَأَغْنَانِي اللَّهُ عَزَّ ذِكْرُهُ بِمُحَمَّدٍ (صلى الله عليه وآله) وَ كُنْتُ مَمْلُوكاً فَأَعْتَقَنِي اللَّهُ عَزَّ ذِكْرُهُ بِمُحَمَّدٍ (صلى الله عليه وآله) هَذَا نَسَبِي وَ هَذَا حَسَبِي ", "فَقَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) يَا مَعْشَرَ قُرَيْشٍ إِنَّ حَسَبَ الرَّجُلِ دِينُهُ وَ مُرُوءَتَهُ خُلُقُهُ وَ أَصْلَهُ عَقْلُهُ وَ قَالَ اللَّهُ عَزَّ وَ جَلَّ إِنَّا خَلَقْناكُمْ مِنْ ذَكَرٍ وَ أُنْثى وَ جَعَلْناكُمْ شُعُوباً وَ قَبائِلَ لِتَعارَفُوا إِنَّ أَكْرَمَكُمْ عِنْدَ اللَّهِ أَتْقاكُمْ ثُمَّ قَالَ النَّبِيُّ (صلى الله عليه وآله) لِسَلْمَانَ لَيْسَ لِأَحَدٍ مِنْ هَؤُلَاءِ عَلَيْكَ فَضْلٌ إِلَّا بِتَقْوَى اللَّهِ عَزَّ وَ جَلَّ وَ إِنْ كَانَ التَّقْوَى لَكَ عَلَيْهِمْ فَأَنْتَ أَفْضَلُ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473327\">H 14651</a> – Ali Bin Ibrahim, from Abdullah Bin Muhammad Bin Isa, from Safwan Bin yahya, from Hanaan who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> heard my father narrated</span> from Abu Ja’far<sup>asws</sup> having said: ‘Salman<sup>ar</sup> was seated with a number of people from Qureish in the Masjid. They started priding over their lineages and ancestry until they reached Salman<sup>ar</sup>. Umar Bin Al-Khattab said to him<sup>ar</sup>, ‘Inform me, who you<sup>ar</sup> are, and who your<sup>ar</sup> father is, and what is your<sup>ar</sup> origin’. So he<sup>ar</sup> said: ‘I<sup>ar</sup> am Salman<sup>ar</sup> son of a servant of Allah<sup>azwj</sup>. I<sup>ar</sup> had strayed, so Allah<sup>azwj</sup> Mighty and Majestic Guided me<sup>ar</sup> by Muhammad<sup>saww</sup>, and I<sup>asws</sup> was needy, so Allah<sup>azwj</sup> Made me<sup>ar</sup> to be self-sufficient by Muhammad<sup>saww</sup>, and I<sup>ar</sup> was a slave, so Allah<sup>azwj</sup> Freed me<sup>ar</sup> by Muhammad<sup>saww</sup>. This is my<sup>ar</sup> lineage, and this is my<sup>asws</sup> nobility’. ", "He<sup>asws</sup> said: ‘The Rasool Allah<sup>saww</sup> came out and Salman<sup>ar</sup> spoke to him<sup>saww</sup>. Salman<sup>ar</sup> said to him<sup>saww</sup>, ‘O Rasool Allah<sup>saww</sup>, what has been meted out to me<sup>ar</sup> from those when I<sup>ar</sup> was seated with them. They took to priding themselves over their lineages and ancestry to the extent that they reached me<sup>ar</sup>. Umar Bin Al-Khattab said to me, ‘Who are you<sup>ar</sup>, and what is your<sup>ar</sup> origin, and what is your<sup>ar</sup> status?’ So the Prophet<sup>saww</sup> said: ‘So what did you<sup>ar</sup> say to him, O Salman<sup>ar</sup>?’ He<sup>ar</sup> said, ‘I<sup>ar</sup> said, ‘‘I<sup>ar</sup> am Salman<sup>ar</sup> son of a servant of Allah<sup>azwj</sup>. I<sup>ar</sup> had strayed, so Allah<sup>azwj</sup> Guided me<sup>ar</sup> through Muhammad<sup>saww</sup>, and I<sup>asws</sup> was needy, so Allah<sup>azwj</sup> Made me<sup>ar</sup> to be self-sufficient through Muhammad<sup>saww</sup>, and I<sup>ar</sup> was a slave, so Allah<sup>azwj</sup> Freed me<sup>ar</sup> through Muhammad<sup>saww</sup>. This is my<sup>ar</sup> lineage, and this is my<sup>asws</sup> nobility’.", "So the Rasool Allah<sup>saww</sup> said: ‘O group of Qureish, the nobility of a man is his Religion, and his chivalry in his manners, and his origin is his intellect. And Allah<sup>azwj</sup> Mighty and Majestic has Said: <span class=\"ibTxt\">“[49:13] O you men! surely We have created you of a male and a female, and made you tribes and families that you may know each other; surely the most honorable of you with Allah is the one among you most careful (of his duty)”.</span> Then the Prophet<sup>saww</sup> said to Salman<sup>ar</sup>: ‘There is no preference over you<sup>ar</sup> from any of these ones except by fear of Allah<sup>azwj</sup> Mighty and Majestic, and if there is piety for you<sup>ar</sup> over them, so you<sup>ar</sup> are more preferable’. "]}}, {"index": 14877, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:11", "text": ["14652- عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ لَمَّا وَلِيَ عَلِيٌّ (عليه السلام) صَعِدَ الْمِنْبَرَ فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ ثُمَّ قَالَ إِنِّي وَ اللَّهِ لَا أَرْزَؤُكُمْ مِنْ فَيْئِكُمْ دِرْهَماً مَا قَامَ لِي عِذْقٌ بِيَثْرِبَ فَلْيَصْدُقْكُمْ أَنْفُسُكُمْ أَ فَتَرَوْنِي مَانِعاً نَفْسِي وَ مُعْطِيَكُمْ قَالَ فَقَامَ إِلَيْهِ عَقِيلٌ فَقَالَ لَهُ وَ اللَّهِ لَتَجْعَلَنِّي وَ أَسْوَدَ بِالْمَدِينَةِ سَوَاءً فَقَالَ اجْلِسْ أَ مَا كَانَ هَاهُنَا أَحَدٌ يَتَكَلَّمُ غَيْرُكَ وَ مَا فَضْلُكَ عَلَيْهِ إِلَّا بِسَابِقَةٍ أَوْ بِتَقْوَى."], "translations": {"en.hubeali": ["<a id=\"_Toc492473328\">H 14652</a> – Ali, from his father, from Ibn Abu Umeyr, from Abdul Rahmaan Bin Al-Hajjaaj, from Muhammad Bin Muslim, who has narrated the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘When Ali<sup>asws</sup> became the ruler, he<sup>asws</sup> ascended the Pulpit. So he<sup>asws</sup> Praised Allah<sup>azwj</sup> and Extolled Him<sup>azwj</sup>, then said: ‘By Allah<sup>azwj</sup>! I<sup>asws</sup> will not give you the sustenance from your spoils of war (Al-Fey) a single Dirham (more than what each of you deserve) so long as I have a palm tree left in Yasrab (Al-Medina). So be truthful to yourselves. Do you see what I<sup>asws</sup> have prevented from myself<sup>asws</sup> that I<sup>asws</sup> shall give it to you?’ So Aqeel stood up and said to him<sup>asws</sup>, ‘By Allah<sup>azwj</sup>! You will consider me to be equal to a black man of Al-Medina?’ So he<sup>asws</sup> said: ‘Sit down! Is there not one here besides you to speak? And there is no preference to you except by a precedent (being foremost in Al-Islam) or by piety’."]}}, {"index": 14878, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:12", "text": ["14653- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ أَبِي عُبَيْدَةَ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ قَامَ رَسُولُ اللَّهِ (صلى الله عليه وآله) عَلَى الصَّفَا فَقَالَ يَا بَنِي هَاشِمٍ يَا بَنِي عَبْدِ الْمُطَّلِبِ إِنِّي رَسُولُ اللَّهِ إِلَيْكُمْ وَ إِنِّي شَفِيقٌ عَلَيْكُمْ وَ إِنَّ لِي عَمَلِي وَ لِكُلِّ رَجُلٍ مِنْكُمْ عَمَلَهُ لَا تَقُولُوا إِنَّ مُحَمَّداً مِنَّا وَ سَنَدْخُلُ مَدْخَلَهُ فَلَا وَ اللَّهِ مَا أَوْلِيَائِي مِنْكُمْ وَ لَا مِنْ غَيْرِكُمْ يَا بَنِي عَبْدِ الْمُطَّلِبِ إِلَّا الْمُتَّقُونَ أَلَا فَلَا أَعْرِفُكُمْ يَوْمَ الْقِيَامَةِ تَأْتُونَ تَحْمِلُونَ الدُّنْيَا عَلَى ظُهُورِكُمْ وَ يَأْتُونَ النَّاسُ يَحْمِلُونَ الْآخِرَةَ أَلَا إِنِّي قَدْ أَعْذَرْتُ إِلَيْكُمْ فِيمَا بَيْنِي وَ بَيْنَكُمْ وَ فِيمَا بَيْنِي وَ بَيْنَ اللَّهِ عَزَّ وَ جَلَّ فِيكُمْ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473329\">H 14653</a> – A number of our companions, from Sahl Bin Ziyad, from Ibn Mahboub, from Ali Bin Ra’ib, from Abu Ubeyda, who has narrated the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> said: ‘The Rasool Allah<sup>saww</sup> stood upon Al-Safa and said: ‘O Clan of Hashim<sup>as</sup>! O Clan of Abdul Muttalib<sup>as</sup>! I<sup>saww</sup> am the Rasool Allah<sup>saww</sup> to you all, and I<sup>asws</sup> am compassionate towards you, and for me<sup>saww</sup> are my<sup>saww</sup> deeds, and for every man among you are his deeds. ", "Do not say that Muhammad<sup>saww</sup> is from us and so we shall be entering where he<sup>saww</sup> would be entering (The Paradise). So, no, by Allah<sup>azwj</sup>! There are no friends for me<sup>saww</sup> from among you, nor from the others. O Clan of Abdul Muttalib<sup>as</sup>! Except for the pious ones, otherwise I<sup>saww</sup> will not recognise you on the Day of Judgement. You will be coming carrying the ‘world’ (burden of the world) upon your backs and the people would be coming carrying the Hereafter. So I<sup>saww</sup> warn you with regards to what is between me<sup>saww</sup> and you all, and with regards to what is between myself<sup>saww</sup> and Allah<sup>azwj</sup> Mighty and Majestic with regards to you all’."]}}, {"index": 14879, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:13", "text": ["14654- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنِ الْحَلَبِيِّ عَنِ ابْنِ مُسْكَانَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ رَأَيْتُ كَأَنِّي عَلَى رَأْسِ جَبَلٍ وَ النَّاسُ يَصْعَدُونَ إِلَيْهِ مِنْ كُلِّ جَانِبٍ حَتَّى إِذَا كَثُرُوا عَلَيْهِ تَطَاوَلَ بِهِمْ فِي السَّمَاءِ وَ جَعَلَ النَّاسُ يَتَسَاقَطُونَ عَنْهُ مِنْ كُلِّ جَانِبٍ حَتَّى لَمْ يَبْقَ مِنْهُمْ أَحَدٌ إِلَّا عِصَابَةٌ يَسِيرَةٌ فَفُعِلَ ذَلِكَ خَمْسَ مَرَّاتٍ فِي كُلِّ ذَلِكَ يَتَسَاقَطُ عَنْهُ النَّاسُ وَ يَبْقَى تِلْكَ الْعِصَابَةُ أَمَا إِنَّ قَيْسَ بْنَ عَبْدِ اللَّهِ بْنِ عَجْلَانَ فِي تِلْكَ الْعِصَابَةِ قَالَ فَمَا مَكَثَ بَعْدَ ذَلِكَ إِلَّا نَحْواً مِنْ خَمْسٍ حَتَّى هَلَكَ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473330\">H 14654</a> – A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Al-Nazar Bin Suweyd, from Al-Halby, from Ibn Muskaan, from Zurara, who has narrated the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> having said: ‘I<sup>asws</sup> saw (in a dream) as if I<sup>asws</sup> am on top of a mountain, and the people are climbing up from all sides, to the extent that they were many of them, and it prolonged by them in the sky, and the people started falling off from it from all sides until there did not remain among them any one except for a small group. So they made an attempt five times, and during each of that the people fell off from it and there did not remain except for a (small) group. As for Qays Bin Abdullah Bin Ajlaan, he was in that group’. He (the narrator) said: ‘He<sup>asws</sup> did not remain after that except for about five (days) until he<sup>asws</sup> passed away’. "]}}, {"index": 14880, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:14", "text": ["14655- عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ قَالَ حَدَّثَنِي أَبُو بَصِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ إِنَّ رَجُلًا كَانَ عَلَى أَمْيَالٍ مِنَ الْمَدِينَةِ فَرَأَى فِي مَنَامِهِ فَقِيلَ لَهُ انْطَلِقْ فَصَلِّ عَلَى أَبِي جَعْفَرٍ (عليه السلام) فَإِنَّ الْمَلَائِكَةَ تُغَسِّلُهُ فِي الْبَقِيعِ فَجَاءَ الرَّجُلُ فَوَجَدَ أَبَا جَعْفَرٍ (عليه السلام) قَدْ تُوُفِّيَ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473331\">H 14655</a> – From him, from Ahmad Bin Muhammad Bin Abu Nasr, from Hammaad Bin Usman who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>bu Baseer narrated</span> to me by saying, ‘I heard Abu Abdullah<sup>asws</sup> saying that: ‘A man who was miles away from Al-Medina, saw in his dream in which it was said to him, ‘Go and Pray over Abu Ja’far<sup>asws</sup>, for the Angels have performed his<sup>asws</sup> washing in Al-Baqi’e’. So the man went, and found Abu Ja’far<sup>asws</sup> to have passed away’."]}}, {"index": 14881, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:15", "text": ["14656- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَوْلُهُ تَعَالَى وَ كُنْتُمْ عَلى شَفا حُفْرَةٍ مِنَ النَّارِ فَأَنْقَذَكُمْ مِنْها بِمُحَمَّدٍ هَكَذَا وَ اللَّهِ نَزَلَ بِهَا جَبْرَئِيلُ (عليه السلام) عَلَى مُحَمَّدٍ (صلى الله عليه وآله)."], "translations": {"en.hubeali": ["<a id=\"_Toc492473332\">H 14656</a> – Ali Bin Ibrahim, from Ahmad Bin Muhammad Bin Khalid, from his father, who has narrated the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> regarding the Statement of the High<sup>azwj</sup>: <span class=\"ibTxt\">“[3:103] and you were on the brink of a pit of fire, then He saved you from it, </span><span style=\"font-style: italic; font-weight: bold; text-decoration: underline\">through Muhammad</span><sup style=\"font-style: italic; font-weight: bold; text-decoration: underline\">saww</sup>.’’ By Allah<sup>azwj</sup>, this is how Jibraeel<sup>as</sup> came down with it upon Muhammad<sup>saww</sup>’."]}}, {"index": 14882, "local_index": 16, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:16", "text": ["14657- عَنْهُ عَنْ أَبِيهِ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ يُونُسَ بْنِ ظَبْيَانَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) لَنْ تَنالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ هَكَذَا فَاقْرَأْهَا."], "translations": {"en.hubeali": ["<a id=\"_Toc492473333\">H 14657</a> – From him, from his father, from Umar Bin Abdul Aziz, from Yunus Bin Zibyaan, who has narrated the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> (regarding the Verse) <span class=\"ibTxt\">“[3:92] By no means shall you attain to righteousness until you spend (benevolently) out of all you love”</span>. This is how he<sup>asws</sup> read it’ (reading ‘مِمَّا تُحِبُّونَ هَكَذَا فَاقْرَأْهَا’ instead of what is now in the Holy Quran  ‘وَمَا تُنْفِقُوا مِنْ شَيْءٍ فَإِنَّ اللَّهَ بِهِ عَلِيمٌ’)."]}}, {"index": 14883, "local_index": 17, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:17", "text": ["14658- عَنْهُ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) وَ لَوْ أَنَّا كَتَبْنا عَلَيْهِمْ أَنِ اقْتُلُوا أَنْفُسَكُمْ وَ سَلِّمُوا لِلْإِمَامِ تَسْلِيماً أَوِ اخْرُجُوا مِنْ دِيارِكُمْ رِضًا لَهُ ما فَعَلُوهُ إِلَّا قَلِيلٌ مِنْهُمْ وَ لَوْ أَنَّ أَهْلَ الْخِلَافِ فَعَلُوا ما يُوعَظُونَ بِهِ لَكانَ خَيْراً لَهُمْ وَ أَشَدَّ تَثْبِيتاً وَ فِي هَذِهِ الْآيَةِ ثُمَّ لا يَجِدُوا فِي أَنْفُسِهِمْ حَرَجاً مِمَّا قَضَيْتَ مِنْ أَمْرِ الْوَالِي وَ يُسَلِّمُوا لِلَّهِ الطَّاعَةَ تَسْلِيماً."], "translations": {"en.hubeali": ["<a id=\"_Toc492473334\">H 14658</a> – From him, from his father, from Ali Bin Asbaat, from Ali Bin Abu Hamza, from Abu Baseer, who has narrated the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> (regarding the Verse) <span class=\"ibTxt\">“[4:66] And if We had prescribed for them: Lay down your lives (totally submit themselves to the Imam) or go forth from your homes (for His Happiness), they would not have done it except a few of them; and if they (the opposing ones) had done what they were commanded, it would have certainly been better for them and best in strengthening (them)”</span>, and regarding this Verse <span class=\"ibTxt\">\"[4:65] and then do not find any straightness in their hearts as to what you have decided </span>from the command of the Guardian<sup>asws</sup><span class=\"ibTxt\"> and submit </span>to the obedience of Allah<sup>azwj</sup><span class=\"ibTxt\"> with entire submission” </span>(referring to the Tahreef in the Holy Quran)."]}}, {"index": 14884, "local_index": 18, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:18", "text": ["14659- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِي جُنَادَةَ الْحُصَيْنِ بْنِ الْمُخَارِقِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ وَرْقَاءَ بْنِ حَبَشِيِّ بْنِ جُنَادَةَ السَّلُولِيِّ صَاحِبِ رَسُولِ اللَّهِ (صلى الله عليه وآله) عَنْ أَبِي الْحَسَنِ الْأَوَّلِ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ أُولئِكَ الَّذِينَ يَعْلَمُ اللَّهُ ما فِي قُلُوبِهِمْ فَأَعْرِضْ عَنْهُمْ فَقَدْ سَبَقَتْ عَلَيْهِمْ كَلِمَةُ الشَّقَاءِ وَ سَبَقَ لَهُمُ الْعَذَابُ وَ قُلْ لَهُمْ فِي أَنْفُسِهِمْ قَوْلًا بَلِيغاً."], "translations": {"en.hubeali": ["<a id=\"_Toc492473335\">H 14659</a> – Ali Bin Ibrahim, from Ahmad Bin Muhammad Bin Khalid, from Abu Junada Al-Husayn Bin Al-Mukharaq Bin Abdul Rahmaan Bin Warqa Bin Habashy Bin Junada Al-Saluly, who has narrated the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span> companion of the</span> Rasool Allah<sup style=\"font-weight: normal\">azwj</sup>, from Abu Al-Hassan the First<sup style=\"font-weight: normal\">asws</sup> regarding the Statement of Allah Mighty and Majestic: <span class=\"ibTxt\">“[4:63] These are they of whom Allah knows what is in their hearts; </span><span style=\"font-style: italic; font-weight: bold; text-decoration: underline\">for the Word of misery has already been Ordained for them and so has the Punishment been Ordained for them</span><span class=\"ibTxt\"> therefore turn aside from them and admonish them, and speak to them effectual words concerning themselves”</span>"]}}, {"index": 14885, "local_index": 19, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:19", "text": ["14660- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ بُرَيْدِ بْنِ مُعَاوِيَةَ قَالَ تَلَا أَبُو جَعْفَرٍ (عليه السلام) أَطِيعُوا اللَّهَ وَ أَطِيعُوا الرَّسُولَ وَ أُولِي الْأَمْرِ مِنْكُمْ فَإِنْ خِفْتُمْ تَنَازُعاً فِي الْأَمْرِ فَأَرْجِعُوهُ إِلَى اللَّهِ وَ إِلَى الرَّسُولِ وَ إِلَى أُولِي الْأَمْرِ مِنْكُمْ ثُمَّ قَالَ كَيْفَ يَأْمُرُ بِطَاعَتِهِمْ وَ يُرَخِّصُ فِي مُنَازَعَتِهِمْ إِنَّمَا قَالَ ذَلِكَ لِلْمَأْمُورِينَ الَّذِينَ قِيلَ لَهُمْ أَطِيعُوا اللَّهَ وَ أَطِيعُوا الرَّسُولَ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473336\">H 14660</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Uman Bin Azina, from Bureyd Bin Muawiya who said, ‘Abu Ja’far<sup>asws</sup> recited “[4:59] O you who believe! Obey Allah and obey the Messenger and those in authority from among you; then if you quarrel about anything, refer it to Allah and the Messenger, and to the Guardian<sup>asws</sup> of the Command among you (Ul-Al-Amr)”. Then said: ‘How can He<sup>azwj</sup> Command for their<sup>asws</sup> obedience and then allow them (the people) to dispute with them<sup>asws</sup>. But rather, He<sup>azwj</sup> has Said that to the Commanded ones when He<sup>azwj</sup> Said to them (the people): “Obey Allah and obey the Messenger”."]}}, {"index": 14886, "local_index": 20, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:20", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14661</span>- عَلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ قَالَ إِنَّ رَسُولَ اللَّهِ (صلى الله عليه وآله) سَأَلَ جَبْرَئِيلَ (عليه السلام) كَيْفَ كَانَ مَهْلَكُ قَوْمِ صَالِحٍ (عليه السلام) فَقَالَ يَا مُحَمَّدُ إِنَّ صَالِحاً بُعِثَ إِلَى قَوْمِهِ وَ هُوَ ابْنُ سِتَّ عَشْرَةَ سَنَةً فَلَبِثَ فِيهِمْ حَتَّى بَلَغَ عِشْرِينَ وَ مِائَةَ سَنَةٍ لَا يُجِيبُونَهُ إِلَى خَيْرٍ قَالَ وَ كَانَ لَهُمْ سَبْعُونَ صَنَماً يَعْبُدُونَهَا مِنْ دُونِ اللَّهِ عَزَّ وَ جَلَّ فَلَمَّا رَأَى ذَلِكَ مِنْهُمْ قَالَ يَا قَوْمِ بُعِثْتُ إِلَيْكُمْ وَ أَنَا ابْنُ سِتَّ عَشَرَ سَنَةً وَ قَدْ بَلَغْتُ عِشْرِينَ وَ مِائَةَ سَنَةٍ وَ أَنَا أَعْرِضُ عَلَيْكُمْ أَمْرَيْنِ إِنْ شِئْتُمْ فَاسْأَلُونِي حَتَّى أَسْأَلَ إِلَهِي فَيُجِيبَكُمْ فِيمَا سَأَلْتُمُونِي السَّاعَةَ وَ إِنْ شِئْتُمْ سَأَلْتُ آلِهَتَكُمْ فَإِنْ أَجَابَتْنِي بِالَّذِي أَسْأَلُهَا خَرَجْتُ عَنْكُمْ فَقَدْ سَئِمْتُكُمْ وَ سَئِمْتُمُونِي قَالُوا قَدْ أَنْصَفْتَ يَا صَالِحُ ", "فَاتَّعَدُوا لِيَوْمٍ يَخْرُجُونَ فِيهِ قَالَ فَخَرَجُوا بِأَصْنَامِهِمْ إِلَى ظَهْرِهِمْ ثُمَّ قَرَّبُوا طَعَامَهُمْ وَ شَرَابَهُمْ فَأَكَلُوا وَ شَرِبُوا فَلَمَّا أَنْ فَرَغُوا دَعَوْهُ فَقَالُوا يَا صَالِحُ سَلْ فَقَالَ لِكَبِيرِهِمْ مَا اسْمُ هَذَا قَالُوا فُلَانٌ فَقَالَ لَهُ صَالِحٌ يَا فُلَانُ أَجِبْ فَلَمْ يُجِبْهُ فَقَالَ صَالِحُ مَا لَهُ لَا يُجِيبُ قَالُوا ادْعُ غَيْرَهُ قَالَ فَدَعَاهَا كُلَّهَا بِأَسْمَائِهَا فَلَمْ يُجِبْهُ مِنْهَا شَيْ‏ءٌ فَأَقْبَلُوا عَلَى أَصْنَامِهِمْ فَقَالُوا لَهَا مَا لَكِ لَا تُجِيبِينَ صَالِحاً فَلَمْ تُجِبْ فَقَالُوا تَنَحَّ عَنَّا وَ دَعْنَا وَ آلِهَتَنَا سَاعَةً ", "ثُمَّ نَحَّوْا بُسُطَهُمْ وَ فُرُشَهُمْ وَ نَحَّوْا ثِيَابَهُمْ وَ تَمَرَّغُوا عَلَى التُّرَابِ وَ طَرَحُوا التُّرَابَ عَلَى رُءُوسِهِمْ وَ قَالُوا لِأَصْنَامِهِمْ لَئِنْ لَمْ تُجِبْنَ صَالِحاً الْيَوْمَ لَتُفْضَحْنَ قَالَ ثُمَّ دَعَوْهُ فَقَالُوا يَا صَالِحُ ادْعُهَا فَدَعَاهَا فَلَمْ تُجِبْهُ فَقَالَ لَهُمْ يَا قَوْمِ قَدْ ذَهَبَ صَدْرُ النَّهَارِ وَ لَا أَرَى آلِهَتَكُمْ تُجِيبُونِي فَاسْأَلُونِي حَتَّى أَدْعُوَ إِلَهِي فَيُجِيبَكُمُ السَّاعَةَ ", "فَانْتَدَبَ لَهُ مِنْهُمْ سَبْعُونَ رَجُلًا مِنْ كُبَرَائِهِمْ وَ الْمَنْظُورِ إِلَيْهِمْ مِنْهُمْ فَقَالُوا يَا صَالِحُ نَحْنُ نَسْأَلُكَ فَإِنْ أَجَابَكَ رَبُّكَ اتَّبَعْنَاكَ وَ أَجَبْنَاكَ وَ يُبَايِعُكَ جَمِيعُ أَهْلِ قَرْيَتِنَا فَقَالَ لَهُمْ صَالِحٌ (عليه السلام) سَلُونِي مَا شِئْتُمْ فَقَالُوا تَقَدَّمْ بِنَا إِلَى هَذَا الْجَبَلِ وَ كَانَ الْجَبَلُ قَرِيباً مِنْهُمْ فَانْطَلَقَ مَعَهُمْ صَالِحٌ فَلَمَّا انْتَهَوْا إِلَى الْجَبَلِ قَالُوا يَا صَالِحُ ادْعُ لَنَا رَبَّكَ يُخْرِجْ لَنَا مِنْ هَذَا الْجَبَلِ السَّاعَةَ نَاقَةً حَمْرَاءَ شَقْرَاءَ وَبْرَاءَ عُشَرَاءَ بَيْنَ جَنْبَيْهَا مِيلٌ ", "فَقَالَ لَهُمْ صَالِحٌ لَقَدْ سَأَلْتُمُونِي شَيْئاً يَعْظُمُ عَلَيَّ وَ يَهُونُ عَلَى رَبِّي جَلَّ وَ عَزَّ قَالَ فَسَأَلَ اللَّهَ تَعَالَى صَالِحٌ ذَلِكَ فَانْصَدَعَ الْجَبَلُ صَدْعاً كَادَتْ تَطِيرُ مِنْهُ عُقُولُهُمْ لَمَّا سَمِعُوا ذَلِكَ ثُمَّ اضْطَرَبَ ذَلِكَ الْجَبَلُ اضْطِرَاباً شَدِيداً كَالْمَرْأَةِ إِذَا أَخَذَهَا الْمَخَاضُ ثُمَّ لَمْ يَفْجَأْهُمْ إِلَّا رَأْسُهَا قَدْ طَلَعَ عَلَيْهِمْ مِنْ ذَلِكَ الصَّدْعِ فَمَا اسْتُتِمَّتْ رَقَبَتُهَا حَتَّى اجْتَرَّتْ ثُمَّ خَرَجَ سَائِرُ جَسَدِهَا ثُمَّ اسْتَوَتْ قَائِمَةً عَلَى الْأَرْضِ فَلَمَّا رَأَوْا ذَلِكَ قَالُوا يَا صَالِحُ مَا أَسْرَعَ مَا أَجَابَكَ رَبُّكَ ادْعُ لَنَا رَبَّكَ يُخْرِجْ لَنَا فَصِيلَهَا فَسَأَلَ اللَّهَ عَزَّ وَ جَلَّ ذَلِكَ فَرَمَتْ بِهِ فَدَبَّ حَوْلَهَا ", "فَقَالَ لَهُمْ يَا قَوْمِ أَ بَقِيَ شَيْ‏ءٌ قَالُوا لَا انْطَلِقْ بِنَا إِلَى قَوْمِنَا نُخْبِرُهُمْ بِمَا رَأَيْنَا وَ يُؤْمِنُونَ بِكَ قَالَ فَرَجَعُوا فَلَمْ يَبْلُغِ السَّبْعُونَ إِلَيْهِمْ حَتَّى ارْتَدَّ مِنْهُمْ أَرْبَعَةٌ وَ سِتُّونَ رَجُلًا وَ قَالُوا سِحْرٌ وَ كَذِبٌ قَالُوا فَانْتَهُوا إِلَى الْجَمِيعِ فَقَالَ السِّتَّةُ حَقٌّ وَ قَالَ الْجَمِيعُ كَذِبٌ وَ سِحْرٌ قَالَ فَانْصَرَفُوا عَلَى ذَلِكَ ثُمَّ ارْتَابَ مِنَ السِّتَّةِ وَاحِدٌ فَكَانَ فِيمَنْ عَقَرَهَا ", "قَالَ ابْنُ مَحْبُوبٍ فَحَدَّثْتُ بِهَذَا الْحَدِيثِ رَجُلًا مِنْ أَصْحَابِنَا يُقَالُ لَهُ سَعِيدُ بْنُ يَزِيدَ فَأَخْبَرَنِي أَنَّهُ رَأَى الْجَبَلَ الَّذِي خَرَجَتْ مِنْهُ بِالشَّامِ قَالَ فَرَأَيْتُ جَنْبَهَا قَدْ حَكَّ الْجَبَلَ فَأَثَّرَ جَنْبُهَا فِيهِ وَ جَبَلٍ آخَرَ بَيْنَهُ وَ بَيْنَ هَذَا مِيلٌ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473338\">H 14661</a> – Ali Bin Ibrahim, from his father, from Al-Hassan Bin Mahboub, from Abu Hamza, who has narrated the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> having said: ‘The Messenger<sup>saww</sup> asked Jibraeel<sup>as</sup>: ‘How were the people of Saleh<sup>as</sup> destroyed?’ So he said: ‘O Muhammad<sup>saww</sup>! Saleh<sup>as</sup> was Sent to his<sup>as</sup> people when he was sixteen years old. So he<sup>saww</sup> was with them until he<sup>as</sup> reached the age of one hundred and twenty years, they did not answer him<sup>as</sup> to the good. And they had for themselves seventy idols which they worshipped apart from Allah<sup>azwj</sup> Mighty and Majestic. So when he<sup>as</sup> saw that among them, he<sup>as</sup> said: ‘O people! I<sup>as</sup> was Sent to you all when I<sup>as</sup> was sixteen years old, and I<sup>as</sup> have now reached one hundred and twenty years, and I<sup>as</sup> present to you all two matters. If you like you can ask me until I<sup>as</sup> ask my<sup>as</sup> God<sup>azwj</sup> so He<sup>azwj</sup> would Answer you with regards to what you have asked me of within a short while. And if you like, I<sup>as</sup> would ask your gods, so if they answer me<sup>as</sup> by that which I<sup>as</sup> have asked them of, I<sup>as</sup> would go away from you all. So I<sup>as</sup> would have silenced you all and you would have silenced me<sup>as</sup>’. They said, ‘You<sup>as</sup> are being fair, O Saleh<sup>as</sup>’.", "So they prepared for the day that they will be going out for it. So they went out with their idols upon their backs, and prepared their food and drinks. So they ate and drank. When they finished, they called him<sup>as</sup> over. They said, ‘O Saleh<sup>as</sup>! Ask!’. So he<sup>as</sup> said to their elder: ‘What is the name of this one?’ He said, ‘Such and such’. So he<sup>as</sup> said to it: ‘O such and such! Answer me<sup>as</sup>!’ So it did not answer him<sup>as</sup>’. So Saleh<sup>as</sup> said: ‘What is the matter with it that it does not answer?’ They said, ‘Ask another one’. So he<sup>as</sup> asked all of them by their names, but they did not answer him<sup>as</sup> anything. So they turned towards their idols and said to them: ‘What is the matter with you all that you do not answer Saleh<sup>as</sup>?’ They did not answer. So they said, ‘Step away from us and leave us and our idols for a while’.", "Then they unrolled their rugs, and their furnishings, and their clothes, and wallowed upon the dust, and placed dust upon their heads, and said to their idols, ‘If you do not answer Saleh<sup>as</sup> today, you will be exposed’. Then they called him<sup>as</sup> over, so they said, ‘O Saleh<sup>as</sup>! Call to these (idols)’. So he<sup>as</sup> called upon them. They did not answer him<sup>as</sup>. So he <sup>as</sup> said to them: ‘O People! Half the morning has passed and I<sup>as</sup> have not seen your gods to have answered me<sup>as</sup>. So ask me<sup>as</sup>, and I<sup>as</sup> shall ask my<sup>as</sup> God<sup>azwj</sup>, and He<sup>azwj</sup> will Answer you shortly’.", "Seventy men from their elders were delegated to him<sup>as</sup> from the approved ones from among them, so they said, ‘O Saleh<sup>as</sup>! We ask you, so if your<sup>as</sup> Lord<sup>azwj</sup> were to answer us, we would follow you<sup>as</sup> and answer to you<sup>as</sup>, and pledge our allegiances to you<sup>as</sup>, all the people of our town altogether’. So Saleh<sup>as</sup> said to them: ‘Ask me<sup>as</sup> whatsoever you like’. So they said, ‘Walk with us towards this mountain’, and the mountain was quite near to them. So Saleh<sup>as</sup> went with them. When he<sup>as</sup> came up to the mountain, they said, ‘O Saleh<sup>as</sup>! Call upon your<sup>as</sup> Lord<sup>azwj</sup> for us, to bring out for us from this mountain this very moment, a blonde, tame, red she-camel with a distance of a mile between the two sides of the mountain’. ", "So Saleh<sup>as</sup> said to them: ‘You have asked me<sup>as</sup> for something which is great for me<sup>as</sup>, and is easy for my<sup>as</sup> Lord<sup>azwj</sup> Majestic and Mighty’. Saleh<sup>as</sup> asked Allah<sup>azwj</sup> the High for that. The mountain split asunder with such a split that their intellects took flight when they heard that rumble of it. Then the mountain trembled with a great tremble like a woman trembling during labour. Then only its head came out of the crack in the mountain. When its neck showed, it began to chew its cud. Then the rest of its body came out, and it stood erect upon the ground. So when they all saw that, they said, ‘O Saleh<sup>as</sup>, with what ease has your<sup>as</sup> Lord<sup>azwj</sup> Answered you<sup>as</sup>. Call upon your<sup>as</sup> Lord<sup>azwj</sup> for us to bring out for us its young’. So he<sup>as</sup> asked Allah<sup>azwj</sup> Mighty and Majestic for that. She brought it (babies) out and walked around them. ", "So he<sup>as</sup> said to them: ‘O people! Does there remain anything else?’ They said, ‘No. Come with us to our people. We shall inform them of what we have seen and they will believe in you<sup>as</sup>’. So they returned, but before the seventy of them could reach them, sixty four of them had reneged, and they were saying, This is sorcery and a lie’. This was reflected by all of them. So the remaining six were saying that it is the truth, whilst all the others were saying that it is a lie and sorcery. Then they all dispersed upon that, and one of the six then was overcome by doubt. So he was the one who slay it. ", "Ibn Mahboub (the narrator) said, ‘I narrated this Hadeeth to a man from our companions called Saeed Bin Yazeed. He informed me that he had seen the mountain from which (the she-camel) came out, in Syria. He said, ‘I saw its sides where the mountain split up, and the impact of it on its sides and the other side of it, and in between it and this one was a distance of a mile’."]}}, {"index": 14887, "local_index": 21, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:21", "text": ["14662- عَلِيُّ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْعَبَّاسِ عَنِ الْحَسَنِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قُلْتُ لَهُ كَذَّبَتْ ثَمُودُ بِالنُّذُرِ فَقالُوا أَ بَشَراً مِنَّا واحِداً نَتَّبِعُهُ إِنَّا إِذاً لَفِي ضَلالٍ وَ سُعُرٍ أَ أُلْقِيَ الذِّكْرُ عَلَيْهِ مِنْ بَيْنِنا بَلْ هُوَ كَذَّابٌ أَشِرٌ قَالَ هَذَا كَانَ بِمَا كَذَّبُوا بِهِ صَالِحاً وَ مَا أَهْلَكَ اللَّهُ عَزَّ وَ جَلَّ قَوْماً قَطُّ حَتَّى يَبْعَثَ إِلَيْهِمْ قَبْلَ ذَلِكَ الرُّسُلَ", "فَيَحْتَجُّوا عَلَيْهِمْ فَبَعَثَ اللَّهُ إِلَيْهِمْ صَالِحاً فَدَعَاهُمْ إِلَى اللَّهِ فَلَمْ يُجِيبُوا وَ عَتَوْا عَلَيْهِ وَ قَالُوا لَنْ نُؤْمِنَ لَكَ حَتَّى تُخْرِجَ لَنَا مِنْ هَذِهِ الصَّخْرَةِ نَاقَةً عُشَرَاءَ وَ كَانَتِ الصَّخْرَةُ يُعَظِّمُونَهَا وَ يَعْبُدُونَهَا وَ يُذَبِّحُونَ عِنْدَهَا فِي رَأْسِ كُلِّ سَنَةٍ وَ يَجْتَمِعُونَ عِنْدَهَا فَقَالُوا لَهُ إِنْ كُنْتَ كَمَا تَزْعُمُ نَبِيّاً رَسُولًا فَادْعُ لَنَا إِلَهَكَ حَتَّى تُخْرَجَ لَنَا مِنْ هَذِهِ الصَّخْرَةِ الصَّمَّاءِ نَاقَةٌ عُشَرَاءُ فَأَخْرَجَهَا اللَّهُ كَمَا طَلَبُوا مِنْهُ ", "ثُمَّ أَوْحَى اللَّهُ تَبَارَكَ وَ تَعَالَى إِلَيْهِ أَنْ يَا صَالِحُ قُلْ لَهُمْ إِنَّ اللَّهَ قَدْ جَعَلَ لِهَذِهِ النَّاقَةِ [مِنَ الْمَاءِ] شِرْبَ يَوْمٍ وَ لَكُمْ شِرْبَ يَوْمٍ وَ كَانَتِ النَّاقَةُ إِذَا كَانَ يَوْمُ شِرْبِهَا شَرِبَتِ الْمَاءَ ذَلِكَ الْيَوْمَ فَيَحْلُبُونَهَا فَلَا يَبْقَى صَغِيرٌ وَ لَا كَبِيرٌ إِلَّا شَرِبَ مِنْ لَبَنِهَا يَوْمَهُمْ ذَلِكَ فَإِذَا كَانَ اللَّيْلُ وَ أَصْبَحُوا غَدَوْا إِلَى مَائِهِمْ فَشَرِبُوا مِنْهُ ذَلِكَ الْيَوْمَ وَ لَمْ تَشْرَبِ النَّاقَةُ ذَلِكَ الْيَوْمَ فَمَكَثُوا بِذَلِكَ مَا شَاءَ اللَّهُ", "ثُمَّ إِنَّهُمْ عَتَوْا عَلَى اللَّهِ وَ مَشَى بَعْضُهُمْ إِلَى بَعْضٍ وَ قَالُوا اعْقِرُوا هَذِهِ النَّاقَةَ وَ اسْتَرِيحُوا مِنْهَا لَا نَرْضَى أَنْ يَكُونَ لَنَا شِرْبُ يَوْمٍ وَ لَهَا شِرْبُ يَوْمٍ ثُمَّ قَالُوا مَنِ الَّذِي يَلِي قَتْلَهَا وَ نَجْعَلَ لَهُ جُعْلًا مَا أَحَبَّ فَجَاءَهُمْ رَجُلٌ أَحْمَرُ أَشْقَرُ أَزْرَقُ وَلَدُ زِنًى لَا يُعْرَفُ لَهُ أَبٌ يُقَالُ لَهُ قُدَارٌ شَقِيٌّ مِنَ الْأَشْقِيَاءِ مَشْئُومٌ عَلَيْهِمْ فَجَعَلُوا لَهُ جُعْلًا فَلَمَّا تَوَجَّهَتِ النَّاقَةُ إِلَى الْمَاءِ الَّذِي كَانَتْ تَرِدُهُ تَرَكَهَا حَتَّى شَرِبَتِ الْمَاءَ وَ أَقْبَلَتْ رَاجِعَةً فَقَعَدَ لَهَا فِي طَرِيقِهَا فَضَرَبَهَا بِالسَّيْفِ ضَرْبَةً فَلَمْ تَعْمَلْ شَيْئاً فَضَرَبَهَا ضَرْبَةً أُخْرَى فَقَتَلَهَا وَ خَرَّتْ إِلَى الْأَرْضِ عَلَى جَنْبِهَا وَ هَرَبَ فَصِيلُهَا حَتَّى صَعِدَ إِلَى الْجَبَلِ فَرَغَى ثَلَاثَ مَرَّاتٍ إِلَى السَّمَاءِ", "وَ أَقْبَلَ قَوْمُ صَالِحٍ فَلَمْ يَبْقَ أَحَدٌ مِنْهُمْ إِلَّا شَرِكَهُ فِي ضَرْبَتِهِ وَ اقْتَسَمُوا لَحْمَهَا فِيمَا بَيْنَهُمْ فَلَمْ يَبْقَ مِنْهُمْ صَغِيرٌ وَ لَا كَبِيرٌ إِلَّا أَكَلَ مِنْهَا فَلَمَّا رَأَى ذَلِكَ صَالِحٌ أَقْبَلَ إِلَيْهِمْ فَقَالَ يَا قَوْمِ مَا دَعَاكُمْ إِلَى مَا صَنَعْتُمْ أَ عَصَيْتُمْ رَبَّكُمْ فَأَوْحَى اللَّهُ تَبَارَكَ وَ تَعَالَى إِلَى صَالِحٍ (عليه السلام) أَنَّ قَوْمَكَ قَدْ طَغَوْا وَ بَغَوْا وَ قَتَلُوا نَاقَةً بَعَثْتُهَا إِلَيْهِمْ حُجَّةً عَلَيْهِمْ وَ لَمْ يَكُنْ عَلَيْهِمْ فِيهَا ضَرَرٌ وَ كَانَ لَهُمْ مِنْهَا أَعْظَمُ الْمَنْفَعَةِ فَقُلْ لَهُمْ إِنِّي مُرْسِلٌ عَلَيْكُمْ عَذَابِي إِلَى ثَلَاثَةِ أَيَّامٍ فَإِنْ هُمْ تَابُوا وَ رَجَعُوا قَبِلْتُ تَوْبَتَهُمْ وَ صَدَدْتُ عَنْهُمْ وَ إِنْ هُمْ لَمْ يَتُوبُوا وَ لَمْ يَرْجِعُوا بَعَثْتُ عَلَيْهِمْ عَذَابِي فِي الْيَوْمِ الثَّالِثِ", "فَأَتَاهُمْ صَالِحٌ (عليه السلام) فَقَالَ لَهُمْ يَا قَوْمِ إِنِّي رَسُولُ رَبِّكُمْ إِلَيْكُمْ وَ هُوَ يَقُولُ لَكُمْ إِنْ أَنْتُمْ تُبْتُمْ وَ رَجَعْتُمْ وَ اسْتَغْفَرْتُمْ غَفَرْتُ لَكُمْ وَ تُبْتُ عَلَيْكُمْ فَلَمَّا قَالَ لَهُمْ ذَلِكَ كَانُوا أَعْتَى مَا كَانُوا وَ أَخْبَثَ وَ قَالُوا يا صالِحُ ائْتِنا بِما تَعِدُنا إِنْ كُنْتَ مِنَ الْمُرْسَلِينَ [الصَّادِقِينَ] قَالَ يَا قَوْمِ إِنَّكُمْ تُصْبِحُونَ غَداً وَ وُجُوهُكُمْ مُصْفَرَّةٌ وَ الْيَوْمَ الثَّانِيَ وُجُوهُكُمْ مُحْمَرَّةٌ وَ الْيَوْمَ الثَّالِثَ وُجُوهُكُمْ مُسْوَدَّةٌ", "فَلَمَّا أَنْ كَانَ أَوَّلُ يَوْمٍ أَصْبَحُوا وَ وُجُوهُهُمْ مُصْفَرَّةٌ فَمَشَى بَعْضُهُمْ إِلَى بَعْضٍ وَ قَالُوا قَدْ جَاءَكُمْ مَا قَالَ لَكُمْ صَالِحٌ فَقَالَ الْعُتَاةُ مِنْهُمْ لَا نَسْمَعُ قَوْلَ صَالِحٍ وَ لَا نَقْبَلُ قَوْلَهُ وَ إِنْ كَانَ عَظِيماً فَلَمَّا كَانَ الْيَوْمُ الثَّانِي أَصْبَحَتْ وُجُوهُهُمْ مُحْمَرَّةً فَمَشَى بَعْضُهُمْ إِلَى بَعْضٍ فَقَالُوا يَا قَوْمِ قَدْ جَاءَكُمْ مَا قَالَ لَكُمْ صَالِحٌ فَقَالَ الْعُتَاةُ مِنْهُمْ لَوْ أُهْلِكْنَا جَمِيعاً مَا سَمِعْنَا قَوْلَ صَالِحٍ وَ لَا تَرَكْنَا آلِهَتَنَا الَّتِي كَانَ آبَاؤُنَا يَعْبُدُونَهَا وَ لَمْ يَتُوبُوا وَ لَمْ يَرْجِعُوا فَلَمَّا كَانَ الْيَوْمُ الثَّالِثُ أَصْبَحُوا وَ وُجُوهُهُمْ مُسْوَدَّةٌ فَمَشَى بَعْضُهُمْ إِلَى بَعْضٍ وَ قَالُوا يَا قَوْمِ أَتَاكُمْ مَا قَالَ لَكُمْ صَالِحٌ فَقَالَ الْعُتَاةُ مِنْهُمْ قَدْ أَتَانَا مَا قَالَ لَنَا صَالِحٌ", "فَلَمَّا كَانَ نِصْفُ اللَّيْلِ أَتَاهُمْ جَبْرَئِيلُ (عليه السلام) فَصَرَخَ بِهِمْ صَرْخَةً خَرَقَتْ تِلْكَ الصَّرْخَةُ أَسْمَاعَهُمْ وَ فَلَقَتْ قُلُوبَهُمْ وَ صَدَعَتْ أَكْبَادَهُمْ وَ قَدْ كَانُوا فِي تِلْكَ الثَّلَاثَةِ الْأَيَّامِ قَدْ تَحَنَّطُوا وَ تَكَفَّنُوا وَ عَلِمُوا أَنَّ الْعَذَابَ نَازِلٌ بِهِمْ فَمَاتُوا أَجْمَعُونَ فِي طَرْفَةِ عَيْنٍ صَغِيرُهُمْ وَ كَبِيرُهُمْ فَلَمْ يَبْقَ لَهُمْ نَاعِقَةٌ وَ لَا رَاغِيَةٌ وَ لَا شَيْ‏ءٌ إِلَّا أَهْلَكَهُ اللَّهُ فَأَصْبَحُوا فِي دِيَارِهِمْ وَ مَضَاجِعِهِمْ مَوْتَى أَجْمَعِينَ ثُمَّ أَرْسَلَ اللَّهُ عَلَيْهِمْ مَعَ الصَّيْحَةِ النَّارَ مِنَ السَّمَاءِ فَأَحْرَقَتْهُمْ أَجْمَعِينَ وَ كَانَتْ هَذِهِ قِصَّتَهُمْ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473339\">H 14662</a> – Ali Bin Muhammad, from Ali Bin Al-Abbas, from Al-Hassan Bin Abdul Rahmaan, from Ali Bin Abu Hamza, who has narrated the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said when it was said to him<sup>asws</sup> <span class=\"ibTxt\">“[54:23] (The tribe of) Thamud rejected warnings [54:24] For they said; Is it a mortal man, alone among us, that we are to follow? Then indeed we should fall into error and madness [54:25] Has the reminder been made to light upon him from among us? Nay! he is an insolent liar!”</span>, he<sup>asws</sup> said: ‘This is what they belied Saleh<sup>as</sup> with, and Allah<sup>azwj</sup> Mighty and Majestic does not Destroy a people at all until He<sup>azwj</sup> Sends to them, before that, the Messenger<sup>as</sup>. ", "They argued against them (the Messengers<sup>as</sup>), so Allah<sup>azwj</sup> Sent Saleh<sup>as</sup> to them. He<sup>as</sup> called them towards Allah<sup>azwj</sup>. They did not respond and were insolent to him<sup>as</sup>, and said, ‘We will not believe you<sup>as</sup> until you<sup>as</sup> bring out for us from this rock a tame she-camel. And it was a rock which they used to magnify and worship and make their sacrifices near to its peak every year, and they used to gather around it. They said, ‘If you<sup>as</sup> are as you are alleging to be, a Prophet<sup>as</sup>, a Messenger<sup>as</sup>, so call upon your<sup>as</sup> Lord<sup>azwj</sup> for us until He<sup>azwj</sup> Brings out for us from this solid rock a tame she-camel’. So Allah<sup>azwj</sup> Brought it out as they had sought from him<sup>as</sup>.", "Then Allah<sup>azwj</sup> Blessed and High Revealed unto him<sup>as</sup>: “O Saleh<sup>as</sup>! Tell them that Allah<sup>azwj</sup> has Made a share for this she-camel, from the water, that it would drink from it one day and you would drink from it the next day”. And the day which was designated for the she-camel to drink, it would drink the water during that day. They would then milk her, and there did not remain any young one or old one except that he drank from her milk in the day of theirs when it was the night time. And in the morning they would drink from the water, and the she-camel would not drink from it during that day. So that situation prevailed until such time as Allah<sup>azwj</sup> so Desired it to. ", "Then they rebelled against Allah<sup>azwj</sup> and some of them walked towards the others and said, ‘Slay this she-camel, and be relaxed from it. We are not happy that there should be a day for us to drink and a day for it to drink’. Then they looked around for someone who could slay it, and made for him (a reward) of what he loved. So there came to them a red, blonde, blue-eyed man, of an adulterous birth, whose father was unknown, called Qudaar. A wretched one of all wretched ones of a sinister character, so they made up for him a reward for it. So when the she-camel went towards the water to drink from it, he left it until it had drunk the water. When it returned, he sat waiting for it upon its path. He struck her with the sword but it did not kill her. So he struck at it again and killed her and it fell down upon the earth on its side, and its young ones fled until they sat upon the mountain. They cried out three times towards the sky. ", "And the people of Saleh<sup>as</sup> came over. So there did not remain anyone from them except that he participated in hitting it, and they distributed its meat in between themselves. There did not remain anyone from them, whether young or old except that he ate from it. So when Saleh<sup>as</sup> saw that, he<sup>as</sup> came up to them and said, ‘O People! What called you all to do what you have done and rebelled against your Lord<sup>azwj</sup>?’ So Allah<sup>azwj</sup> Blessed and High unto Saleh<sup>as</sup>: “Your<sup>as</sup> people have been tyrannous and rebellious, and killed the she-camel that was Sent to them as a Proof to them, and there was no harm in it for them, and there were great benefits from it for them. So tell them that I<sup>azwj</sup> will be Sending upon you all My<sup>azwj</sup> Punishment after three days. So they were to repent and return (from their ways), I<sup>azwj</sup> shall Accept their repentance and Prevent it from them, and if they do not repent and do not return (from their ways), I<sup>azwj</sup> will Send to them My<sup>azwj</sup> Punishment on the third day”. ", "So Saleh<sup>as</sup> came and said to them: ‘O people! I<sup>as</sup> am a Messenger<sup>as</sup> of your Lord<sup>azwj</sup>. He<sup>azwj</sup> is Saying to you all that if you were to repent and return (from your ways) and seek Forgiveness, He<sup>azwj</sup> would Forgive you all and Turn towards you (Mercifully)’. So when he<sup>as</sup> said that to them they became more rebellious and treacherous than what they had been and said, ‘O Saleh<sup>as</sup>! Let it come to us, what you<sup>as</sup> are calling for us, if you<sup>as</sup> are from the Messengers<sup>as</sup>, the truthful ones’. He<sup>as</sup> said: ‘O people! When you wake up tomorrow morning your faces would be yellow, and on the second day your faces would be red, and on the third day your faces would be black’.", "So when it was the morning of the first day and their faces turned yellow, some of them walked towards the others and said, ‘There has come upon you what Saleh<sup>as</sup> had spoken of’. So the rebellious ones among them said, ‘We will not listen to the words of Saleh<sup>as</sup> and will not accept his<sup>as</sup> words, even though they may be great’. So when it was the morning of the second day and their faces turned red, some of them walked towards the others and said, ‘O people! There has come upon you what Saleh<sup>as</sup> had spoken about for you all’. So the rebellious ones among them said, ‘Even if we were all to be destroyed, we will not listen to the words of Saleh<sup>as</sup> nor will we leave our gods which our forefathers had been worshipping, nor will we repent, nor will we return (from our ways)’. So when it was the morning of the third day and their faces turned black. So some of them walked towards the others and said, ‘O people! There has come upon you what Saleh<sup>as</sup> had spoken of for you all’. So the rebellious ones from among them said, ‘Let it come upon us what Saleh<sup>as</sup> had said to us’. ", "So when it was the middle of the night, Jibraeel<sup>as</sup> came upon them and screamed out a loud scream at them which broke their eardrums, and split their hearts, and ruptured their livers. And during those three days they had been applying camphor upon themselves, and shrouding themselves, and they knew that the Punishment would be descending upon them. So all of them died in the blink of an eye, their young ones as well as their old ones. There did not remain for them a she-camel, or a sheep, or anything except that Allah<sup>azwj</sup> Destroyed it. They had all died in their homes and on their beds. Then Allah<sup>azw</sup><sup>j</sup> Sent upon them Fire along with the Scream from the sky. So it burnt all of them, and this was their story’."]}}, {"index": 14888, "local_index": 22, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:22", "text": ["14663- حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الْكِنْدِيِّ عَنْ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِنَا عَنْ أَبَانِ بْنِ عُثْمَانَ عَنِ الْفُضَيْلِ بْنِ الزُّبَيْرِ قَالَ حَدَّثَنِي فَرْوَةُ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ ذَاكَرْتُهُ شَيْئاً مِنْ أَمْرِهِمَا فَقَالَ ضَرَبُوكُمْ عَلَى دَمِ عُثْمَانَ ثَمَانِينَ سَنَةً وَ هُمْ يَعْلَمُونَ أَنَّهُ كَانَ ظَالِماً فَكَيْفَ يَا فَرْوَةُ إِذَا ذَكَرْتُمْ صَنَمَيْهِمْ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473340\">H 14663</a> – Humeyd Bin Ziyad, from Al-Hassan Bin Muhammad Al-Kiindy, from someone else from our companions, from Abaan Bin usmaan, from Al-Fuzeyl Bin Al-zubeyr who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-f\">F</span>arwat narrated to</span> me from Abu Ja’far<sup>asws</sup>. He said: ‘Remind me of something from the affairs of those two (Abu Bakr and Umar)’. So he<sup>asws</sup> said: ‘They have hit you upon the blood of Usman for eighty years, and they very well know that he was an unjust one. O Farwat, so how would it be if I<sup>asws</sup> mention to you their two idols (Abu Bakr and Umar)’. "]}}, {"index": 14889, "local_index": 23, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:23", "text": ["14664- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ سَدِيرٍ قَالَ كُنَّا عِنْدَ أَبِي جَعْفَرٍ (عليه السلام) فَذَكَرْنَا مَا أَحْدَثَ النَّاسُ بَعْدَ نَبِيِّهِمْ (صلى الله عليه وآله) وَ اسْتِذْلَالَهُمْ أَمِيرَ الْمُؤْمِنِينَ (عليه السلام) فَقَالَ رَجُلٌ مِنَ الْقَوْمِ أَصْلَحَكَ اللَّهُ فَأَيْنَ كَانَ عِزُّ بَنِي هَاشِمٍ وَ مَا كَانُوا فِيهِ مِنَ الْعَدَدِ فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) وَ مَنْ كَانَ بَقِيَ مِنْ بَنِي هَاشِمٍ إِنَّمَا كَانَ جَعْفَرٌ وَ حَمْزَةُ فَمَضَيَا وَ بَقِيَ مَعَهُ رَجُلَانِ ضَعِيفَانِ ذَلِيلَانِ حَدِيثَا عَهْدٍ بِالْإِسْلَامِ عَبَّاسٌ وَ عَقِيلٌ وَ كَانَا مِنَ الطُّلَقَاءِ أَمَا وَ اللَّهِ لَوْ أَنَّ حَمْزَةَ وَ جَعْفَراً كَانَا بِحَضْرَتِهِمَا مَا وَصَلَا إِلَى مَا وَصَلَا إِلَيْهِ وَ لَوْ كَانَا شَاهِدَيْهِمَا لَأَتْلَفَا نَفْسَيْهِمَا."], "translations": {"en.hubeali": ["<a id=\"_Toc492473341\">H 14664</a> – Muhammad Bin yahya, from Ahmad Bin Muhammad, from Al-Husayn Bin Saeed, from Ali Bin Al-No’man, from Abdullah Bin Muskaan, from Sudeyr who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-w\">W</span>e were in the presence</span> of Abu Ja’far<sup>asws</sup>, so we mentioned what the people had done after their Prophet<sup>saww</sup>, and their humiliating Amir-ul-Momineen<sup>asws</sup>. So a man from the people said, ‘May Allah<sup>azwj</sup> Keep you well, so where were the strong ones of the Clan of Hashim<sup>as</sup> and what was their number?’ So Abu Ja’far<sup>asws</sup> said: ‘And from those ones of the Clan of Hashim<sup>as</sup> that remained were Ja’far<sup>as</sup> and Hamza<sup>as</sup> who had passed away (martyred), and there remained with them two men who were weak, disgraceful, new ones in the era of Al-Islam, <span style=\"text-decoration: underline\">Abbas and Aqeel who were from the freed ones</span>. By Allah<sup>azwj</sup>! If Hamza<sup>as</sup> and Ja’far<sup>as</sup> were present among them, they would not have achieved what they achieved. And had they seen them<sup>as</sup> two, they would not have damaged themselves’."]}}, {"index": 14890, "local_index": 24, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:24", "text": ["14665- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ إِسْمَاعِيلَ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ مَنِ اشْتَكَى الْوَاهِنَةَ أَوْ كَانَ بِهِ صُدَاعٌ أَوْ غَمْرَةُ بَوْلٍ فَلْيَضَعْ يَدَهُ عَلَى ذَلِكَ الْمَوْضِعِ وَ لْيَقُلْ اسْكُنْ سَكَّنْتُكَ بِالَّذِي سَكَنَ لَهُ مَا فِي اللَّيْلِ وَ النَّهَارِ وَ هُوَ السَّمِيعُ الْعَلِيمُ.", "‘مَنِ اشْتَكَى الْوَاهِنَةَ أَوْ كَانَ بِهِ صُدَاعٌ أَوْ غَمْرَةُ بَوْلٍ فَلْيَضَعْ يَدَهُ عَلَى ذَلِكَ الْمَوْضِعِ وَ لْيَقُلْ اسْكُنْ سَكَّنْتُكَ بِالَّذِي سَكَنَ لَهُ مَا فِي اللَّيْلِ وَ النَّهَارِ وَ هُوَ السَّمِيعُ الْعَلِيمُ’"], "translations": {"en.hubeali": ["<a id=\"_Toc492473342\">H 14665</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from his father, from Abdullah Bin Al-Mugheira, from Ismail Bin Muslim, who has narrated the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘The one who complains of weakness, or headache, or urine blockage, should place his hand upon that particular place and should say: ", "‘Settle down for the Sake of the One for Whom<sup>azwj</sup> settle down what is in the night and the day, and He<sup>azwj</sup> the Hearing, the Knowing’. "]}}, {"index": 14891, "local_index": 25, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:25", "text": ["14666- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ وَ الْحَسَنِ بْنِ عَلِيِّ بْنِ فَضَّالٍ عَنْ أَبِي جَمِيلَةَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ الْحَزْمُ فِي الْقَلْبِ وَ الرَّحْمَةُ وَ الْغِلْظَةُ فِي الْكَبِدِ وَ الْحَيَاءُ فِي الرِّيَةِ. وَ فِي حَدِيثٍ آخَرَ لِأَبِي جَمِيلَةَ الْعَقْلُ مَسْكَنُهُ فِي الْقَلْبِ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473343\">H 14666</a> – Muhammad Bin yahya, from Ahmad Bin Muhammad Bin Isa, from Ahmad Bin Muhammad Bin Abu Nasr, and Al-Hassan Bin Ali Bin Fazzaal, from Abu Jameela, who has narrated the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘الْحَزْمُ’ Firmness is in the heart, and the ‘الرَّحْمَةُ وَ الْغِلْظَةُ’ compassion and the harshness is in the liver, and ‘الْحَيَاءُ’ bashfulness (honour) is in the lungs’. And in another Hadeeth from Abu Jameela, he<sup>asws</sup> said: ‘The intellect dwells in the heart’."]}}, {"index": 14892, "local_index": 26, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:26", "text": ["14667- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ مُوسَى بْنِ بَكْرٍ قَالَ اشْتَكَى غُلَامٌ إِلَى أَبِي الْحَسَنِ (عليه السلام) فَسَأَلَ عَنْهُ فَقِيلَ إِنَّهُ بِهِ طُحَالًا فَقَالَ أَطْعِمُوهُ الْكُرَّاثَ ثَلَاثَةَ أَيَّامٍ فَأَطْعَمْنَاهُ إِيَّاهُ فَقَعَدَ الدَّمُ ثُمَّ بَرَأَ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473344\">H 14667</a> – A number of our companions, from Sahl Bin Ziyad, from Ali Bin Hassaan, from Musa Bin Bakr who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-o\">O</span>nce a boy complained</span> to Abu Al-Hassan<sup>asws</sup>, so he<sup>asws</sup> asked about him, so they told him<sup>asws</sup> that the boy had the spleen trouble. So he<sup>asws</sup> said: ‘Feed him leek for three days’. So we fed it to him, he excreted blood, then was free (cured)’."]}}, {"index": 14893, "local_index": 27, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:27", "text": ["14668- مُحَمَّدُ بْنُ يَحْيَى عَنْ غَيْرِ وَاحِدٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ إِبْرَاهِيمَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ (عليه السلام) وَ شَكَوْتُ إِلَيْهِ ضَعْفَ مَعِدَتِي فَقَالَ اشْرَبِ الْحَزَاءَ بِالْمَاءِ الْبَارِدِ فَفَعَلْتُ فَوَجَدْتُ مِنْهُ مَا أُحِبُّ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473345\">H 14668</a> – Muhammad Bin Yahya, from someone else, from Muhammad Bin Isa, from Muhammad Bin Amro Bin Ibrahim who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked Abu Ja’far</span><sup>asws</sup> and complained to him<sup>asws</sup> of a weak stomach, so he<sup>asws</sup> said: ‘Drink ‘الْحَزَاءَ’ <span class=\"iTxt\">Al-Haza’a</span><a id=\"_ftnref24\"></a><span class=\"iTxt\"><sup>[24]</sup></span> with the cold water’. So I did it, and found from it what I liked’."]}}, {"index": 14894, "local_index": 28, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:28", "text": ["14669- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ بَكْرِ بْنِ صَالِحٍ قَالَ سَمِعْتُ أَبَا الْحَسَنِ الْأَوَّلَ (عليه السلام) يَقُولُ مِنَ الرِّيحِ الشَّابِكَةِ وَ الْحَامِ وَ الْإِبْرِدَةِ فِي الْمَفَاصِلِ تَأْخُذُ كَفَّ حُلْبَةٍ وَ كَفَّ تِينٍ يَابِسٍ تَغْمُرُهُمَا بِالْمَاءِ وَ تَطْبُخُهُمَا فِي قِدْرٍ نَظِيفَةٍ ثُمَّ تُصَفِّي ثُمَّ تُبَرِّدُ ثُمَّ تَشْرَبُهُ يَوْماً وَ تَغِبُّ يَوْماً حَتَّى تَشْرَبَ مِنْهُ تَمَامَ أَيَّامِكَ قَدْرَ قَدَحٍ رَوِيٍّ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473346\">H 14669</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from bakr Bin Saleh who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Al-Hassan</span> the First<sup>asws</sup> saying: ‘The one with wind (gastric trouble), and <span class=\"iTxt\">Al-Haam</span>, and the coldness in the joints should take a handful of fenugreek (plant) and a handful of dry fig, soak these two in the water, and cook these two in a clean pot, then drain it, then cool it, then drink from it every other day until the completeness of your days the measurement of a cup’."]}}, {"index": 14895, "local_index": 29, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:29", "text": ["14670- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ نُوحِ بْنِ شُعَيْبٍ عَمَّنْ ذَكَرَهُ عَنْ أَبِي الْحَسَنِ (عليه السلام) قَالَ مَنْ تَغَيَّرَ عَلَيْهِ مَاءُ الظَّهْرِ فَلْيَنْفَعْ لَهُ اللَّبَنُ الْحَلِيبُ وَ الْعَسَلُ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473347\">H 14670</a> – A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Ali, from Nuh Bin Shuayb, from the one whom he mentioned:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Al-Hassan</span><sup>asws</sup> said: ‘The one who’s water of the back (semen) has changed, so the butter milk and the honey would be beneficial for him’."]}}, {"index": 14896, "local_index": 30, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:30", "text": ["14671- الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ حُمْرَانَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) فِيمَ يَخْتَلِفُ النَّاسُ قُلْتُ يَزْعُمُونَ أَنَّ الْحِجَامَةَ فِي يَوْمِ الثَّلَاثَاءِ أَصْلَحُ قَالَ فَقَالَ لِي وَ إِلَى مَا يَذْهَبُونَ فِي ذَلِكَ قُلْتُ يَزْعُمُونَ أَنَّهُ يَوْمُ الدَّمِ قَالَ فَقَالَ صَدَقُوا فَأَحْرَى أَنْ لَا يُهَيِّجُوهُ فِي يَوْمِهِ أَمَا عَلِمُوا أَنَّ فِي يَوْمِ الثَّلَاثَاءِ سَاعَةً مَنْ وَافَقَهَا لَمْ يَرْقَأْ دَمُهُ حَتَّى يَمُوتَ أَوْ مَا شَاءَ اللَّهُ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473348\">H 14671</a> – Al-Husayn Bin Muhammad, from Moala Bin Muhammad, from Muhammad Bin Jamhour, from Humraan who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘So in what do the people differ?’ I said, ‘They are alleging that the cupping (Al-Hajaamat) during the day of Tuesday is correct’. He<sup>asws</sup> said to me: ‘And to what (direction) are they going with regards to that?’ I said, ‘They are alleging that it is the day of the blood’. He<sup>asws</sup> said: ‘They are right. So it is more appropriate not to stir it in its day. But rather, know that during the day of Tuesday there is a particular time, if it coincides with it, his bleeding would not stop until he dies, or what Allah<sup>azwj</sup> so Desires’."]}}, {"index": 14897, "local_index": 31, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:31", "text": ["14672- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنْ رَجُلٍ مِنَ الْكُوفِيِّينَ عَنْ أَبِي عُرْوَةَ أَخِي شُعَيْبٍ أَوْ عَنْ شُعَيْبٍ الْعَقَرْقُوفِيِّ قَالَ دَخَلْتُ عَلَى أَبِي الْحَسَنِ الْأَوَّلِ (عليه السلام) وَ هُوَ يَحْتَجِمُ يَوْمَ الْأَرْبِعَاءِ فِي الْحَبْسِ فَقُلْتُ لَهُ إِنَّ هَذَا يَوْمٌ يَقُولُ النَّاسُ إِنَّ مَنِ احْتَجَمَ فِيهِ أَصَابَهُ الْبَرَصُ فَقَالَ إِنَّمَا يُخَافُ ذَلِكَ عَلَى مَنْ حَمَلَتْهُ أُمُّهُ فِي حَيْضِهَا."], "translations": {"en.hubeali": ["<a id=\"_Toc492473349\">H 14672</a> – A number from our companions, from Sahl Bin Ziyad, from Yaqoub Bin Yazeed, from a man from the people of Al-Kufa, from Abu Urwa the brother of Shuayb, or from Shuayb Al-Aqarqufy who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> came up to Abu Al</span>-Hassan<sup>asws</sup> the First<sup>asws</sup> whilst he<sup>asws</sup> was doing the cupping (Al-Hajaamat) on the day of Wednesday in the prison. So I said to him<sup>asws</sup>, ‘This is the day for which the people say that the one who gets cupping (Al-Hajaamat) done would be struck by vitiligo (white patches on the body)’. He<sup>asws</sup> said: ‘But rather, the one who fears that is the one whose mother conceived him during her menstruation (Walud-ul-Haiz, the one would always be the enemy of Alye Mohammed<sup>asws</sup>)’."]}}, {"index": 14898, "local_index": 32, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:32", "text": ["14673- مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ لَا تَحْتَجِمُوا فِي يَوْمِ الْجُمُعَةِ مَعَ الزَّوَالِ فَإِنَّ مَنِ احْتَجَمَ مَعَ الزَّوَالِ فِي يَوْمِ الْجُمُعَةِ فَأَصَابَهُ شَيْ‏ءٌ فَلَا يَلُومَنَّ إِلَّا نَفْسَهُ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473350\">H 14673</a> – Muhammad Bin Yahya, from Muhammad Bin Al-Husayn, from Muhammad Bin Ismail, from Saleh Bin Uqba, from Is’haq Bin Ammar, who has narrated the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘Do not get cupping done during the day of Friday noon time, for the one who gets cupping done at noon during the day of Friday, if something were to happen to him, so he should not blame (anyone) except for himself’."]}}, {"index": 14899, "local_index": 33, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:33", "text": ["14674- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ أَبِي سَلَمَةَ عَنْ مُعَتِّبٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ الدَّوَاءُ أَرْبَعَةٌ السَّعُوطُ وَ الْحِجَامَةُ وَ النُّورَةُ وَ الْحُقْنَةُ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473351\">H 14674</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Hassan Bin Ali, from Abu Salma, from Mo’tab, who has narrated:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘The medical cures are four – The inhalation, and the cupping, and the hair removal (Al-Noura), and the enema’."]}}, {"index": 14900, "local_index": 34, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:34", "text": ["14675- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ قَالَ شَكَا رَجُلٌ إِلَى أَبِي عَبْدِ اللَّهِ (عليه السلام) السُّعَالَ وَ أَنَا حَاضِرٌ فَقَالَ لَهُ خُذْ فِي رَاحَتِكَ شَيْئاً مِنْ كَاشِمٍ وَ مِثْلَهُ مِنْ سُكَّرٍ فَاسْتَفَّهُ يَوْماً أَوْ يَوْمَيْنِ قَالَ ابْنُ أُذَيْنَةَ فَلَقِيتُ الرَّجُلَ بَعْدَ ذَلِكَ فَقَالَ مَا فَعَلْتُهُ إِلَّا مَرَّةً وَاحِدَةً حَتَّى ذَهَبَ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473352\">H 14675</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span> man complained to</span> Abu Abdullah<sup>asws</sup> for the cough whilst I was present, so he<sup>asws</sup> said to him: ‘At your convenience, take something from ‘كَاشِمٍ’ lovage (plant) and similar amount of sugar, swallow it for one or two days’. Ibn Azina (the narrator) said, ‘I met the man after that, so he said, ‘I did not do it but once and it went (cured)’. "]}}, {"index": 14901, "local_index": 35, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:35", "text": ["14676- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ سَعِيدِ بْنِ جَنَاحٍ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ إِنَّ مُوسَى بْنَ عِمْرَانَ (عليه السلام) شَكَا إِلَى رَبِّهِ تَعَالَى الْبِلَّةَ وَ الرُّطُوبَةَ فَأَمَرَ اللَّهُ تَعَالَى أَنْ يَأْخُذَ الْهَلِيلَجَ وَ الْبِلِيلَجَ وَ الْأَمْلَجَ فَيَعْجِنَهُ بِالْعَسَلِ وَ يَأْخُذَهُ ثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) هُوَ الَّذِي يُسَمُّونَهُ عِنْدَكُمُ الطَّرِيفِلَ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473353\">H 14676</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Saeed Bin Janaah, from a man, who has narrated the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said that: ‘Musa Bin Imran<sup>as</sup> complained to his<sup>as</sup> Lord<sup>azwj</sup> the High about the moisture and the humidity. So Allah<sup>azwj</sup> the high Commanded that he<sup>as</sup> should take the myrobalan (fruit) and ‘Al-Balaylaj’ and ‘Al-Amlaj’, knead it in honey and take it’. Then Abu Abdullah<sup>asws</sup> said: ‘It has been named as ‘Al-Tarayfil’ among you’."]}}, {"index": 14902, "local_index": 36, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:36", "text": ["14677- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ أَخِيهِ الْعَلَاءِ عَنْ إِسْمَاعِيلَ بْنِ الْحَسَنِ الْمُتَطَبِّبِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ (عليه السلام) إِنِّي رَجُلٌ مِنَ الْعَرَبِ وَ لِيَ بِالطِّبِّ بَصَرٌ وَ طِبِّي طِبٌّ عَرَبِيٌّ وَ لَسْتُ آخُذُ عَلَيْهِ صَفَداً فَقَالَ لَا بَأْسَ قُلْتُ إِنَّا نَبُطُّ الْجُرْحَ وَ نَكْوِي بِالنَّارِ قَالَ لَا بَأْسَ قُلْتُ وَ نَسْقِي هَذِهِ السُّمُومَ الْأَسْمَحِيقُونَ وَ الْغَارِيقُونَ قَالَ لَا بَأْسَ قُلْتُ إِنَّهُ رُبَّمَا مَاتَ قَالَ وَ إِنْ مَاتَ قُلْتُ نَسْقِي عَلَيْهِ النَّبِيذَ قَالَ لَيْسَ فِي حَرَامٍ شِفَاءٌ قَدِ اشْتَكَى رَسُولُ اللَّهِ (صلى الله عليه وآله) فَقَالَتْ لَهُ عَائِشَةُ بِكَ ذَاتُ الْجَنْبِ فَقَالَ أَنَا أَكْرَمُ عَلَى اللَّهِ عَزَّ وَ جَلَّ مِنْ أَنْ يَبْتَلِيَنِي بِذَاتِ الْجَنْبِ قَالَ فَأَمَرَ فَلُدَّ بِصَبِرٍ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473354\">H 14677</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Khalid, from Muhammad Bin Yahya, from his brother Al-A’la, from Ismail Bin Al-Hassan Al-Mutabbab who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> said to Abu Abdullah</span><sup>asws</sup>, ‘I am a man from the Arabs and I have medicine for vision, and my medicine is the Arabic medicine, and I do not take gifts for it’. He<sup>asws</sup> said: ‘There is no problem’. I said, ‘I let the wound bleed and burn it by the fire’. He<sup>asws</sup> said: ‘There is no problem’. I said, ‘And my prescription are these toxins ‘Al-Asmahiqoun’ and ‘Al-Ghariqoun’’. He<sup>asws</sup> said: ‘There is no problem’. I said, ‘Sometimes he (the patient) dies’. He<sup>asws</sup> said: ‘Even if he dies’. I said, ‘My prescription to him (the patient) is ‘Al-Nabeez’ (Intoxicating drink)’. He<sup>asws</sup> said: ‘There is no healing in the Prohibited (things). The Rasool Allah<sup>saww</sup> had complained, so Ayesha said to him<sup>saww</sup>, ‘You<sup>saww</sup> have pleurisy’. So he<sup>saww</sup> said: ‘I<sup>saww</sup> am more honourable to Allah<sup>azwj</sup> Mighty and Majestic that He<sup>azwj</sup> would involve me<sup>saww</sup> with the pleurisy’. So he<sup>saww</sup> ( said you should have observe) patient’."]}}, {"index": 14903, "local_index": 37, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:37", "text": ["14678- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ (عليه السلام) الرَّجُلُ يَشْرَبُ الدَّوَاءَ وَ يَقْطَعُ الْعِرْقَ وَ رُبَّمَا انْتَفَعَ بِهِ وَ رُبَّمَا قَتَلَهُ قَالَ يَقْطَعُ وَ يَشْرَبُ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473355\">H 14678</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Yunus Bin Yaqoub who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> said to Abu Abdullah</span><sup>asws</sup>, ‘The man drinks the medicine, and cuts the vein, and perhaps it benefits him and perhaps it kills him’. He<sup>asws</sup> said: ‘He can cut and he can drink’."]}}, {"index": 14904, "local_index": 38, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:38", "text": ["14679- أَحْمَدُ بْنُ مُحَمَّدٍ الْكُوفِيُّ عَنْ عَلِيِّ بْنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ فَضَّالٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْحَمِيدِ عَنِ الْحَكَمِ بْنِ مِسْكِينٍ عَنْ حَمْزَةَ بْنِ الطَّيَّارِ قَالَ كُنْتُ عِنْدَ أَبِي الْحَسَنِ الْأَوَّلِ (عليه السلام) فَرَآنِي أَتَأَوَّهُ فَقَالَ مَا لَكَ قُلْتُ ضِرْسِي فَقَالَ لَوِ احْتَجَمْتَ فَاحْتَجَمْتُ فَسَكَنَ فَأَعْلَمْتُهُ فَقَالَ لِي مَا تَدَاوَى النَّاسُ بِشَيْ‏ءٍ خَيْرٍ مِنْ مَصَّةِ دَمٍ أَمْ مُزْعَةِ عَسَلٍ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ مَا الْمُزْعَةُ عَسَلٍ [عَسَلًا] قَالَ لَعْقَةُ عَسَلٍ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473356\">H 14679</a> – Ahmad Bin Muhammad Al-Kufy, from Ali Bin Al-Hassan Bin Ali Bin Fazzaal, from Muhammad Bin Abdul Hameed, from Al-Hakam Bin Makeyn, from Hamza Bin Al-Tayyaar who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> was in the presence</span> of Abu Al-Hassan the First<sup>asws</sup>. He<sup>asws</sup> saw me groaning (with pain). So he<sup>asws</sup> said: ‘What is the matter with you?’ I said, ‘My molar (toothache)’. So he<sup>asws</sup> said: ‘If only you had cupping done’. So I got cupping done and it settled down. I informed him<sup>asws</sup> of it’. So he<sup>asws</sup> said to me: ‘There is no better cure for the people than the sucking out of the blood and a certain amount of honey’. I said, ‘May I be sacrificed for you<sup>asws</sup>, what is a certain amount of honey?’ He<sup>asws</sup> said: ‘A lick of honey’."]}}, {"index": 14905, "local_index": 39, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:39", "text": ["14680- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ بَكْرِ بْنِ صَالِحٍ عَنْ سُلَيْمَانَ بْنِ جَعْفَرٍ الْجَعْفَرِيِّ قَالَ سَمِعْتُ أَبَا الْحَسَنِ مُوسَى (عليه السلام) يَقُولُ دَوَاءُ الضِّرْسِ تَأْخُذُ حَنْظَلَةً فَتُقَشِّرُهَا ثُمَّ تَسْتَخْرِجُ دُهْنَهَا فَإِنْ كَانَ الضِّرْسُ مَأْكُولًا مُنْحَفِراً تُقَطِّرُ فِيهِ قَطَرَاتٍ وَ تَجْعَلُ مِنْهُ فِي قُطْنَةٍ شَيْئاً وَ تَجْعَلُ فِي جَوْفِ الضِّرْسِ وَ يَنَامُ صَاحِبُهُ مُسْتَلْقِياً يَأْخُذُهُ ثَلَاثَ لَيَالٍ فَإِنْ كَانَ الضِّرْسُ لَا أَكْلَ فِيهِ وَ كَانَتْ رِيحاً قَطِّرْ فِي الْأُذُنِ الَّتِي تَلِي ذَلِكَ الضِّرْسَ لَيَالِيَ كُلَّ لَيْلَةٍ قَطْرَتَيْنِ أَوْ ثَلَاثَ قَطَرَاتٍ يَبْرَأُ بِإِذْنِ اللَّهِ ", "قَالَ وَ سَمِعْتُهُ يَقُولُ لِوَجَعِ الْفَمِ وَ الدَّمِ الَّذِي يَخْرُجُ مِنَ الْأَسْنَانِ وَ الضَّرَبَانِ وَ الْحُمْرَةِ الَّتِي تَقَعُ فِي الْفَمِ تَأْخُذُ حَنْظَلَةً رَطْبَةً قَدِ اصْفَرَّتْ فَتَجْعَلُ عَلَيْهَا قَالَباً مِنْ طِينٍ ثُمَّ تَثْقُبُ رَأْسَهَا وَ تُدْخِلُ سِكِّيناً جَوْفَهَا فَتَحُكُّ جَوَانِبَهَا بِرِفْقٍ ثُمَّ تَصُبُّ عَلَيْهَا خَلَّ تَمْرٍ حَامِضاً شَدِيدَ الْحُمُوضَةِ ثُمَّ تَضَعُهَا عَلَى النَّارِ فَتُغْلِيهَا غَلَيَاناً شَدِيداً ثُمَّ يَأْخُذُ صَاحِبُهُ مِنْهُ كُلَّمَا احْتَمَلَ ظُفُرُهُ فَيَدْلُكُ بِهِ فِيهِ وَ يَتَمَضْمَضُ بِخَلٍّ وَ إِنْ أَحَبَّ أَنْ يُحَوِّلَ مَا فِي الْحَنْظَلَةِ فِي زُجَاجَةٍ أَوْ بَسْتُوقَةٍ فَعَلَ وَ كُلَّمَا فَنِيَ خَلُّهُ أَعَادَ مَكَانَهُ وَ كُلَّمَا عَتَقَ كَانَ خَيْراً لَهُ إِنْ شَاءَ اللَّهُ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473357\">H 14680</a> – A number of our companions, from Sahl Bin Ziyad, from Bakr Bin Saleh, from Suleyman Bin Ja’far Al-Ja’fary who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Al-Hassan</span> Musa<sup>asws</sup> saying: ‘To cure the toothache, take colocynth (a bitter fruit), peel it, then extracts its oil. So if the tooth has a cavity, apply the drops by cotton, place it inside the cavity and lie down upon the back. He should do this for three nights. And if the tooth does not have a cavity to it and it has a smell to it, apply the drops in each side of that tooth during the night. Every night two or three drops. He would be free (cured) by the Permission of Allah<sup>azwj</sup>’.", "He (the narrator) said, ‘And I heard him<sup>asws</sup> saying: ‘For the pain in the mouth and the blood which comes out from the teeth, and the ulcers and the redness which takes place in the mouth, take damp colocynth which has turned yellow, place it in a pot of clay, pierce its head and enter a knife inside it. Then gently rub its sides, then pour over it dates and vinegar, and it would be intensely bitter. Then place it upon the fire and boil it intensely. Then take from it all that can be carried by his finger, rub it in his mouth, and gargle with the vinegar. If he likes he can transfer what is in the colocynth into a bottle or bowl. And when all that becomes less, he can refill it with vinegar, and he would be free from all that, Allah<sup>azwj</sup> Willing’."]}}, {"index": 14906, "local_index": 40, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:40", "text": ["14681- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ ابْنِ فَضَّالٍ عَنِ الْحَسَنِ بْنِ أَسْبَاطٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَيَابَةَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ (عليه السلام) جُعِلْتُ لَكَ الْفِدَاءَ إِنَّ النَّاسَ يَقُولُونَ إِنَّ النُّجُومَ لَا يَحِلُّ النَّظَرُ فِيهَا وَ هِيَ تُعْجِبُنِي فَإِنْ كَانَتْ تُضِرُّ بِدِينِي فَلَا حَاجَةَ لِي فِي شَيْ‏ءٍ يُضِرُّ بِدِينِي وَ إِنْ كَانَتْ لَا تُضِرُّ بِدِينِي فَوَ اللَّهِ إِنِّي لَأَشْتَهِيهَا وَ أَشْتَهِي النَّظَرَ فِيهَا فَقَالَ لَيْسَ كَمَا يَقُولُونَ لَا تُضِرُّ بِدِينِكَ ", "ثُمَّ قَالَ إِنَّكُمْ تَنْظُرُونَ فِي شَيْ‏ءٍ مِنْهَا كَثِيرُهُ لَا يُدْرَكُ وَ قَلِيلُهُ لَا يُنْتَفَعُ بِهِ تَحْسُبُونَ عَلَى طَالِعِ الْقَمَرِ ثُمَّ قَالَ أَ تَدْرِي كَمْ بَيْنَ الْمُشْتَرِي وَ الزُّهَرَةِ مِنْ دَقِيقَةٍ قُلْتُ لَا وَ اللَّهِ قَالَ أَ فَتَدْرِي كَمْ بَيْنَ الزُّهَرَةِ وَ بَيْنَ الْقَمَرِ مِنْ دَقِيقَةٍ قُلْتُ لَا قَالَ أَ فَتَدْرِي كَمْ بَيْنَ الشَّمْسِ وَ بَيْنَ السُّنْبُلَةِ مِنْ دَقِيقَةٍ قُلْتُ لَا وَ اللَّهِ مَا سَمِعْتُ مِنْ أَحَدٍ مِنَ الْمُنَجِّمِينَ قَطُّ قَالَ أَ فَتَدْرِي كَمْ بَيْنَ السُّنْبُلَةِ وَ بَيْنَ اللَّوْحِ الْمَحْفُوظِ مِنْ دَقِيقَةٍ قُلْتُ لَا وَ اللَّهِ مَا سَمِعْتُهُ مِنَ مُنَجِّمٍ قَطُّ قَالَ مَا بَيْنَ كُلِّ وَاحِدٍ مِنْهُمَا إِلَى صَاحِبِهِ سِتُّونَ أَوْ سَبْعُونَ دَقِيقَةً", "[شَكَّ عَبْدُ الرَّحْمَنِ] ثُمَّ قَالَ يَا عَبْدَ الرَّحْمَنِ هَذَا حِسَابٌ إِذَا حَسَبَهُ الرَّجُلُ وَ وَقَعَ عَلَيْهِ عَرَفَ الْقَصَبَةَ الَّتِي فِي وَسَطِ الْأَجَمَةِ وَ عَدَدَ مَا عَنْ يَمِينِهَا وَ عَدَدَ مَا عَنْ يَسَارِهَا وَ عَدَدَ مَا خَلْفَهَا وَ عَدَدَ مَا أَمَامَهَا حَتَّى لَا يَخْفَى عَلَيْهِ مِنْ قَصَبِ الْأَجَمَةِ وَاحِدَةٌ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473358\">H 14681</a> – A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ibn Fazzaal, from Al-Hassan Bin Asbaat, from Abdul Rahmaan Bin Sayaabat who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> said to Abu Abdullah</span><sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>, the people are saying that it is not permissible to study the stars, and this has surprised me. So if it is harmful for my Religion, so there is no need for me to do anything which harms my Religion, and if it is not harmful to my Religion, by Allah<sup>azwj</sup> I love it and it is my desire to study it’. So he<sup>asws</sup> said: ‘This is not as they are saying it to be. It does not harm your Religion’. ", "Then he<sup>asws</sup> said; ‘You are studying something, a lot of which you are unaware of, and a small amount of it is not beneficial. You are calculating the rise of the Moon’. Then he<sup>asws</sup> said: ‘Do you know how many minutes there are in between Jupiter and Venus?’ I said, ‘No, by Allah<sup>azwj</sup>’. He<sup>asws</sup> said: ‘Do you know how many minutes there are in between the Venus and the Moon?’ I said, ‘No’. He<sup>asws</sup> said: ‘Do you know how many minutes there are in between the Sun and the Virgo?’ I said, ‘No, by Allah<sup>azwj</sup>, I have not heard from any one from the astrologers at all’. He<sup>asws</sup> said: ‘What is in between each one of these at its counterpart are sixty or seventy minutes’. ", "Abdul Rahmaan expressed his doubt. Then he<sup>asws</sup> said: ‘O Abdul Rahmaan, this is a calculation, which if the man calculates, he would come to know the reed in the middle of the bush, and the number (of reeds) which are on the right of it and the number (of reeds) which are on the left of it, and the number (of reeds) which are behind it, and the number (of reeds) which are in front of it, to the extent that there would not remain hidden from him a single reed from the bush’."]}}, {"index": 14907, "local_index": 41, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:41", "text": ["14682- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ قَالَ أَخْبَرَنَا النَّضْرُ بْنُ قِرْوَاشٍ الْجَمَّالُ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) عَنِ الْجِمَالِ يَكُونُ بِهَا الْجَرَبُ أَعْزِلُهَا مِنْ إِبِلِي مَخَافَةَ أَنْ يُعْدِيَهَا جَرَبُهَا وَ الدَّابَّةُ رُبَّمَا صَفَرْتُ لَهَا حَتَّى تَشْرَبَ الْمَاءَ ", "فَقَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) إِنَّ أَعْرَابِيّاً أَتَى رَسُولَ اللَّهِ (صلى الله عليه وآله) فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أُصِيبُ الشَّاةَ وَ الْبَقَرَةَ وَ النَّاقَةَ بِالثَّمَنِ الْيَسِيرِ وَ بِهَا جَرَبٌ فَأَكْرَهُ شِرَاءَهَا مَخَافَةَ أَنْ يُعْدِيَ ذَلِكَ الْجَرَبُ إِبِلِي وَ غَنَمِي فَقَالَ لَهُ رَسُولُ اللَّهِ (صلى الله عليه وآله) يَا أَعْرَابِيُّ فَمَنْ أَعْدَى الْأَوَّلَ ثُمَّ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) لَا عَدْوَى وَ لَا طِيَرَةَ وَ لَا هَامَةَ وَ لَا شُؤْمَ وَ لَا صَفَرَ وَ لَا رَضَاعَ بَعْدَ فِصَالٍ وَ لَا تَعَرُّبَ بَعْدَ هِجْرَةٍ وَ لَا صَمْتَ يَوْماً إِلَى اللَّيْلِ وَ لَا طَلَاقَ قَبْلَ النِّكَاحِ وَ لَا عِتْقَ قَبْلَ مِلْكٍ وَ لَا يُتْمَ بَعْدَ إِدْرَاكٍ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473359\">H 14682</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Hassan Bin Mahboub, who said, ‘we have been informed by Al-Nazar bin Qarwaash Al-Jammaal who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked Abu Abdullah</span><sup>asws</sup> about the camels who have scabies whether I should keep my camel away from these fearing it might get infected by the scabies, and the animals might have got it until it drank the water’.", "So Abu Abdullah<sup>asws</sup> said that: ‘A Bedouin came up to the Rasool Allah<sup>s</sup><sup>aww</sup>. He said, ‘O Rasool Allah<sup>saww</sup>, I come across injured sheep, cows, and the camels sold at a cheap price, but they have scabies. I dislike buying these fearing that they may infect my camels and my sheep with that scabies’. So the Rasool Allah<sup>saww</sup> said: ‘O Bedouin! So who infected the first (infected) one?’ Then the Rasool Allah<sup>saww</sup> said: ‘There is neither infection, nor bad omen, nor ghost, nor bad luck, nor ‘Safra’, nor breastfeeding after weaning, nor being a Bedouin after Migration (Hijra), nor Fasting of silence for a day to the night, nor divorce before the marriage, nor emancipation before slavery, nor being an orphan after achieving adulthood’."]}}, {"index": 14908, "local_index": 42, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:42", "text": ["14683- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ عَمْرِو بْنِ حُرَيْثٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) الطِّيَرَةُ عَلَى مَا تَجْعَلُهَا إِنْ هَوَّنْتَهَا تَهَوَّنَتْ وَ إِنْ شَدَّدْتَهَا تَشَدَّدَتْ وَ إِنْ لَمْ تَجْعَلْهَا شَيْئاً لَمْ تَكُنْ شَيْئاً."], "translations": {"en.hubeali": ["<a id=\"_Toc492473360\">H 14683</a> – Ali Bin Ibrahim, from his father, from Abdullah Bin Al-Mugheira, from Amro Bin Hureys who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘The omen is upon what you make it to be. If you take it lightly, it would be light, if you take it seriously it would be intense, and if you do not make anything of it, it would not be anything’."]}}, {"index": 14909, "local_index": 43, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:43", "text": ["14684- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) كَفَّارَةُ الطِّيَرَةِ التَّوَكُّلُ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473361\">H 14684</a> – Ali Bin Ibrahim, from his father, from Al-Nawfaly, from Al-Sakuny, who has narrated:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> says that the Rasool Allah<sup>saww</sup> said: ‘The expiration of the omen is the reliance (upon Allah<sup>azwj</sup>)’."]}}, {"index": 14910, "local_index": 44, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:44", "text": ["14685- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عُمَرَ بْنِ يَزِيدَ وَ غَيْرِهِ عَنْ بَعْضِهِمْ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) وَ بَعْضِهِمْ عَنْ أَبِي جَعْفَرٍ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ أَ لَمْ تَرَ إِلَى الَّذِينَ خَرَجُوا مِنْ دِيارِهِمْ وَ هُمْ أُلُوفٌ حَذَرَ الْمَوْتِ فَقالَ لَهُمُ اللَّهُ مُوتُوا ثُمَّ أَحْياهُمْ فَقَالَ إِنَّ هَؤُلَاءِ أَهْلُ مَدِينَةٍ مِنْ مَدَائِنِ الشَّامِ وَ كَانُوا سَبْعِينَ أَلْفَ بَيْتٍ وَ كَانَ الطَّاعُونُ يَقَعُ فِيهِمْ فِي كُلِّ أَوَانٍ فَكَانُوا إِذَا أَحَسُّوا بِهِ خَرَجَ مِنَ الْمَدِينَةِ الْأَغْنِيَاءُ لِقُوَّتِهِمْ وَ بَقِيَ فِيهَا الْفُقَرَاءُ لِضَعْفِهِمْ فَكَانَ الْمَوْتُ يَكْثُرُ فِي الَّذِينَ أَقَامُوا وَ يَقِلُّ فِي الَّذِينَ خَرَجُوا فَيَقُولُ الَّذِينَ خَرَجُوا لَوْ كُنَّا أَقَمْنَا لَكَثُرَ فِينَا الْمَوْتُ وَ يَقُولُ الَّذِينَ أَقَامُوا لَوْ كُنَّا خَرَجْنَا لَقَلَّ فِينَا الْمَوْتُ", "قَالَ فَاجْتَمَعَ رَأْيُهُمْ جَمِيعاً أَنَّهُ إِذَا وَقَعَ الطَّاعُونُ فِيهِمْ وَ أَحَسُّوا بِهِ خَرَجُوا كُلُّهُمْ مِنَ الْمَدِينَةِ فَلَمَّا أَحَسُّوا بِالطَّاعُونِ خَرَجُوا جَمِيعاً وَ تَنَحَّوْا عَنِ الطَّاعُونِ حَذَرَ الْمَوْتِ فَسَارُوا فِي الْبِلَادِ مَا شَاءَ اللَّهُ ثُمَّ إِنَّهُمْ مَرُّوا بِمَدِينَةٍ خَرِبَةٍ قَدْ جَلَا أَهْلُهَا عَنْهَا وَ أَفْنَاهُمُ الطَّاعُونُ فَنَزَلُوا بِهَا فَلَمَّا حَطُّوا رِحَالَهُمْ وَ اطْمَأَنُّوا بِهَا قَالَ لَهُمُ اللَّهُ عَزَّ وَ جَلَّ مُوتُوا جَمِيعاً فَمَاتُوا مِنْ سَاعَتِهِمْ وَ صَارُوا رَمِيماً يَلُوحُ وَ كَانُوا عَلَى طَرِيقِ الْمَارَّةِ فَكَنَسَتْهُمُ الْمَارَّةُ فَنَحَّوْهُمْ وَ جَمَعُوهُمْ فِي مَوْضِعٍ", "فَمَرَّ بِهِمْ نَبِيٌّ مِنْ أَنْبِيَاءِ بَنِي إِسْرَائِيلَ يُقَالُ لَهُ حِزْقِيلُ فَلَمَّا رَأَى تِلْكَ الْعِظَامَ بَكَى وَ اسْتَعْبَرَ وَ قَالَ يَا رَبِّ لَوْ شِئْتَ لَأَحْيَيْتَهُمُ السَّاعَةَ كَمَا أَمَتَّهُمْ فَعَمَرُوا بِلَادَكَ وَ وَلَدُوا عِبَادَكَ وَ عَبَدُوكَ مَعَ مَنْ يَعْبُدُكَ مِنْ خَلْقِكَ فَأَوْحَى اللَّهُ تَعَالَى إِلَيْهِ أَ فَتُحِبُّ ذَلِكَ قَالَ نَعَمْ يَا رَبِّ فَأَحْيِهِمْ قَالَ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ أَنْ قُلْ كَذَا وَ كَذَا فَقَالَ الَّذِي أَمَرَهُ اللَّهُ عَزَّ وَ جَلَّ أَنْ يَقُولَهُ ", "فَقَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) وَ هُوَ الِاسْمُ الْأَعْظَمُ فَلَمَّا قَالَ حِزْقِيلُ ذَلِكَ الْكَلَامَ نَظَرَ إِلَى الْعِظَامِ يَطِيرُ بَعْضُهَا إِلَى بَعْضٍ فَعَادُوا أَحْيَاءً يَنْظُرُ بَعْضُهُمْ إِلَى بَعْضٍ يُسَبِّحُونَ اللَّهَ عَزَّ ذِكْرُهُ وَ يُكَبِّرُونَهُ وَ يُهَلِّلُونَهُ فَقَالَ حِزْقِيلُ عِنْدَ ذَلِكَ أَشْهَدُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْ‏ءٍ قَدِيرٌ", "قَالَ عُمَرُ بْنُ يَزِيدَ فَقَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) فِيهِمْ نَزَلَتْ هَذِهِ الْآيَةُ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473362\">H 14685</a> – A number of our companions, from Sahl Bin Ziyad, from Ibn Mahboub, from Umar Bin Yazeed and someone else, from some of them, who have narrated the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup>, and some of them from Abu Ja’far<sup>asws</sup> regarding the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[2:243] Have you not considered those who went forth from their homes, for fear of death, and they were thousands, then Allah said to them, Die; again He gave them life”</span>. These were city folk from the cities of Syria, and there were seventy thousand households and plague used to occur among them every time. So whenever they sensed it, the rich ones would exit the city due to their (financial) strength and the poor would remain due to their (financial) weakness. So the death occurred mostly among those who would remain and less among those who went out. So those who left said, ‘Had we been of those who remained, death would frequent among us’. And those who remained said, ‘Had we been of those who went out, death would be less among us’.", "He<sup>asws</sup> said: ‘So they formed a consensus of their opinions that whenever they sense the plague occurring among them, all of them would go out from the city. So when they sensed the plague affecting them, all of them went out and took precaution against the death. So they travelled in the countryside for as long as Allah<sup>azwj</sup> so Desired. Then they passed by a city which was in ruins and its inhabitants had all left, being destroyed by the plague. So they encamped there, and settled their belongings being reassured by it. Allah<sup>azwj</sup> Said to them: “All of you die!” They all died at that instant and became decayed. The passers-by passed by and collected their ashes and gathered them in one place. ", "So a Prophet<sup>as</sup> from the Prophets<sup>as</sup> of the Children of Israel passed by them, whose<sup>as</sup> name was Hizkeel<sup>as</sup>. So when he<sup>as</sup> saw those bones, he<sup>as</sup> wept and reflected upon it and said: ‘O Lord<sup>azwj</sup>! If You<sup>azwj</sup> so Wish, You<sup>azwj</sup> can Revive them instantly, just as You<sup>azwj</sup> Caused them to die, so they would then inhabit Your<sup>azwj</sup> Country, and bear Your<sup>azwj</sup> servants who would worship You<sup>azwj</sup> along with those from Your<sup>azwj</sup> creatures who worship You<sup>azwj</sup>’. So Allah<sup>azwj</sup> the High Revealed unto him<sup>as</sup>: “Is that what you <sup>as</sup> would like to happen?’ He<sup>as</sup> said: ‘Yes, O Lord<sup>azwj</sup>! Revive them”. So Allah<sup>azwj</sup> Revealed unto him<sup>as</sup>; “Say such and such”. So he<sup>as</sup> said that which Allah<sup>azwj</sup> Mighty and Majestic had Commanded him<sup>as</sup> to say’.", "Abu Abdullah<sup>asws</sup> said: ‘And it was the Great Name (Al-Ism Al-Aazam). So when Hizkeel<sup>as</sup> said that Word, he<sup>as</sup> saw the bones flying towards each other. So they came back alive. Some of them looked at the others Glorifying Allah<sup>azwj</sup> and Exclaiming His<sup>azwj</sup> Greatness and Extolling His<sup>azwj</sup> Holiness. So Hizkeel<sup>as</sup> said during that: ‘I<sup>as</sup> hereby testify that Allah<sup>azwj</sup> has Power over all things’. ", "Umar Bin Yazeed (the narrator) said, ‘Abu Abdullah<sup>asws</sup> said: ‘This Verse was Revealed regarding them’."]}}, {"index": 14911, "local_index": 45, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:45", "text": ["14686- ابْنُ مَحْبُوبٍ عَنْ حَنَانِ بْنِ سَدِيرٍ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ قُلْتُ لَهُ أَخْبِرْنِي عَنْ قَوْلِ يَعْقُوبَ (عليه السلام) لِبَنِيهِ اذْهَبُوا فَتَحَسَّسُوا مِنْ يُوسُفَ وَ أَخِيهِ أَ كَانَ يَعْلَمُ أَنَّهُ حَيٌّ وَ قَدْ فَارَقَهُ مُنْذُ عِشْرِينَ سَنَةً قَالَ نَعَمْ قَالَ قُلْتُ كَيْفَ عَلِمَ قَالَ إِنَّهُ دَعَا فِي السَّحَرِ وَ سَأَلَ اللَّهَ عَزَّ وَ جَلَّ أَنْ يَهْبِطَ عَلَيْهِ مَلَكُ الْمَوْتِ فَهَبَطَ عَلَيْهِ بريالُ وَ هُوَ مَلَكُ الْمَوْتِ فَقَالَ لَهُ بريالُ مَا حَاجَتُكَ يَا يَعْقُوبُ قَالَ أَخْبِرْنِي عَنِ الْأَرْوَاحِ تَقْبِضُهَا مُجْتَمِعَةً أَوْ مُتَفَرِّقَةً قَالَ بَلْ أَقْبِضُهَا مُتَفَرِّقَةً رُوحاً رُوحاً قَالَ لَهُ فَأَخْبِرْنِي هَلْ مَرَّ بِكَ رُوحُ يُوسُفَ فِيمَا مَرَّ بِكَ قَالَ لَا فَعَلِمَ يَعْقُوبُ أَنَّهُ حَيٌّ فَعِنْدَ ذَلِكَ قَالَ لِوُلْدِهِ اذْهَبُوا فَتَحَسَّسُوا مِنْ يُوسُفَ وَ أَخِيهِ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473363\">H 14686</a> – Ibn Mahboub, from hanaan Bin Sudeyr, who has said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> said to Abu Ja’far</span><sup>asws</sup>, ‘Inform me about the words of Yaqoub<sup>as</sup> to his<sup>as</sup> sons: <span class=\"ibTxt\">“[12:87] O my sons! Go and inquire respecting Yusuf and his brother”</span>, Did he<sup>a</sup><sup>s</sup> know that he<sup>as</sup> was alive, and there was a separation of twenty years between them?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘How did he<sup>as</sup> know?’ He<sup>asws</sup> said: ‘He<sup>as</sup> supplicated before dawn and asked Allah<sup>azwj</sup> Mighty and Majestic that he<sup>azwj</sup> should Send down to him<sup>as</sup> the Angel of Death. So Biryaal descended unto him<sup>as</sup>, and he is the Angel of Death. So Biryaal said to him<sup>as</sup>: ‘What is your<sup>as</sup> need, O Yaqoub<sup>as</sup>?’ He<sup>as</sup> said: ‘Inform me about the souls. Do you capture them altogether or separately?’ He said, ‘But, I capture them separately, soul by soul’. He<sup>as</sup> said to him: ‘So inform me, Did you come across the soul of Yusuf<sup>as</sup> in what you have passed by?’ He said: ‘No’. Thus Yaqoub<sup>as</sup> came to know that he<sup>as</sup> was alive. So, due to that he<sup>as</sup> said <span class=\"ibTxt\">“[12:87] O my sons! Go and inquire respecting Yusuf and his brother”</span>."]}}, {"index": 14912, "local_index": 46, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:46", "text": ["14687- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ الْحُصَيْنِ عَنْ خَالِدِ بْنِ يَزِيدَ الْقُمِّيِّ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ حَسِبُوا أَلَّا تَكُونَ فِتْنَةٌ قَالَ حَيْثُ كَانَ النَّبِيُّ (صلى الله عليه وآله) بَيْنَ أَظْهُرِهِمْ فَعَمُوا وَ صَمُّوا حَيْثُ قُبِضَ رَسُولُ اللَّهِ (صلى الله عليه وآله) ثُمَّ تابَ اللَّهُ عَلَيْهِمْ حَيْثُ قَامَ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) قَالَ ثُمَّ عَمُوا وَ صَمُّوا إِلَى السَّاعَةِ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473364\">H 14687</a> – Muhammad Bin yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Husayn Bin Saeed, from Muhammad Bin Al-Husayn, from Khalid Bin Yazeed Al-Qummy, from some of his companions, who has narrated the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> regarding the Statement of Allah<sup>azwj</sup> Mighty and majestic: <span class=\"ibTxt\">“[5:71] And they thought that there would be no affliction”</span>, he<sup>asws</sup> said: ‘This was when the Rasool Allah<sup>saww</sup> was present among them. So they became blind and deaf when the Rasool Allah<sup>saww</sup> passed away. Then Allah<sup>azwj</sup> Turned (Mercifully) towards them when He<sup>azwj</sup> Established Amir-ul-Momineen<sup>asws</sup>. Then they became blind and deaf this time as well’."]}}, {"index": 14913, "local_index": 47, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:47", "text": ["14688- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ أَبِي عُبَيْدَةَ الْحَذَّاءِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ لُعِنَ الَّذِينَ كَفَرُوا مِنْ بَنِي إِسْرائِيلَ عَلى لِسانِ داوُدَ وَ عِيسَى ابْنِ مَرْيَمَ قَالَ الْخَنَازِيرُ عَلَى لِسَانَ دَاوُدَ وَ الْقِرَدَةُ عَلَى لِسَانَ عِيسَى ابْنِ مَرْيَمَ (عليهما السلام)."], "translations": {"en.hubeali": ["<a id=\"_Toc492473365\">H 14688</a> – A number of our companions, from Sahl Bin Ziyad, from Ibn Mahboub, from Ibn Ra’ab, from Abu Ubeyda Al-Haza’a, who has narrated the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> regarding the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[5:78] Those who disbelieved from among the children of Israel were cursed by the tongue of Dawood and Isa, son of Marium”</span>. He<sup>asws</sup> said: ‘The pigs, by the tongue of Dawood<sup>as</sup>, and the monkeys, by the tongue of Isa Bin Maryam<sup>as</sup>’."]}}, {"index": 14914, "local_index": 48, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:48", "text": ["14689- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ مُحَمَّدِ بْنِ أَبِي حَمْزَةَ عَنْ يَعْقُوبَ بْنِ شُعَيْبٍ عَنْ عِمْرَانَ بْنِ مِيثَمٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَرَأَ رَجُلٌ عَلَى أَمِيرِ الْمُؤْمِنِينَ (عليه السلام) فَإِنَّهُمْ لا يُكَذِّبُونَكَ وَ لكِنَّ الظَّالِمِينَ بِآياتِ اللَّهِ يَجْحَدُونَ فَقَالَ بَلَى وَ اللَّهِ لَقَدْ كَذَّبُوهُ أَشَدَّ التَّكْذِيبِ وَ لَكِنَّهَا مُخَفَّفَةٌ لا يُكَذِّبُونَكَ لَا يَأْتُونَ بِبَاطِلٍ يُكَذِّبُونَ بِهِ حَقَّكَ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473366\">H 14689</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al-Husayn Bin Saeed, from Al-nazar Bin Suweyd, from Muhammad Bin Abu Hamza, from Yaqoub Bin Shuayb, from Umraan Bin Maysam, who has narrated the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘A man recited to Amir-ul-Momineen<sup>asws</sup> (the following Verse) <span class=\"ibTxt\">“[6:33] We know indeed that what they say certainly grieves you, but surely they do not call you a liar; but the unjust deny the communications of Allah”</span>. He<sup>asws</sup> said: ‘Yes, by Allah<sup>azwj</sup>, they had denied him<sup>saww</sup> with an intense denial, but it was hidden. (The meaning of) “<span class=\"ibTxt\">but surely they do not call you a liar”</span> is that ‘they would not be able to come up with the refutation in order to belie your<sup>saww</sup> truth’’."]}}, {"index": 14915, "local_index": 49, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:49", "text": ["14690- أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَحَدِهِمَا (عليهما السلام) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ أَظْلَمُ مِمَّنِ افْتَرى عَلَى اللَّهِ كَذِباً أَوْ قالَ أُوحِيَ إِلَيَّ وَ لَمْ يُوحَ إِلَيْهِ شَيْ‏ءٌ قَالَ نَزَلَتْ فِي ابْنِ أَبِي سَرْحٍ الَّذِي كَانَ عُثْمَانُ اسْتَعْمَلَهُ عَلَى مِصْرَ وَ هُوَ مِمَّنْ كَانَ رَسُولُ اللَّهِ (صلى الله عليه وآله) يَوْمَ فَتْحِ مَكَّةَ هَدَرَ دَمَهُ وَ كَانَ يَكْتُبُ لِرَسُولِ اللَّهِ (صلى الله عليه وآله) فَإِذَا أَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ أَنَّ اللَّهَ عَزِيزٌ حَكِيمٌ كَتَبَ إِنَّ اللَّهَ عَلِيمٌ حَكِيمٌ فَيَقُولُ لَهُ رَسُولُ اللَّهِ (صلى الله عليه وآله) دَعْهَا فَإِنَّ اللَّهَ عَلِيمٌ حَكِيمٌ وَ كَانَ ابْنُ أَبِي سَرْحٍ يَقُولُ لِلْمُنَافِقِينَ إِنِّي لَأَقُولُ مِنْ نَفْسِي مِثْلَ مَا يَجِي‏ءُ بِهِ فَمَا يُغَيِّرُ عَلَيَّ فَأَنْزَلَ اللَّهُ تَبَارَكَ وَ تَعَالَى فِيهِ الَّذِي أَنْزَلَ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473367\">H 14690</a> – Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbaar, from Safwaan Bin Yahya, from Ibn Muskaan, from Abu Baseer, who has narrated the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-o\">O</span>ne of the Imams</span><sup>asws</sup> said when he<sup>asws</sup> was asked about the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[6:93] And who is more unjust than he who forges a lie against Allah, or says: It has been revealed to me; while nothing has been revealed to him”</span>. He<sup>asws</sup> said: ‘It was Revealed regarding Ibn Abu Sarh who was the office bearer of Usman over Egypt, and he was from the ones who were with the Rasool Allah<sup>saww</sup> on the Day of the conquest over Mecca whose blood was spared. And he used to write to the Rasool Allah<sup>saww</sup>. So if Allah<sup>azwj</sup> Mighty and Majestic Revealed that: “Surely Allah<sup>azwj</sup> is Most Mighty, Most Wise”. He would write, ‘Surely Allah<sup>azwj</sup> is Most Aware, Most Wise’. So the Rasool Allah<sup>saww</sup> said to him: ‘Leave it, although Allah<sup>azwj</sup> is surely Most Aware, Most Wise’. So Ibn Abu Sarh used to say to the hypocrites, ‘I am saying from myself similar to what he<sup>saww</sup> has come up with, so he<sup>saww</sup> does not let me alter it’. So Allah<sup>azwj</sup> Blessed and High Revealed regarding him what He<sup>azwj</sup> Revealed’."]}}, {"index": 14916, "local_index": 50, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:50", "text": ["14691- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ (عليه السلام) قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ قاتِلُوهُمْ حَتَّى لا تَكُونَ فِتْنَةٌ وَ يَكُونَ الدِّينُ كُلُّهُ لِلَّهِ فَقَالَ لَمْ يَجِئْ تَأْوِيلُ هَذِهِ الْآيَةِ بَعْدُ إِنَّ رَسُولَ اللَّهِ (صلى الله عليه وآله) رَخَّصَ لَهُمْ لِحَاجَتِهِ وَ حَاجَةِ أَصْحَابِهِ فَلَوْ قَدْ جَاءَ تَأْوِيلُهَا لَمْ يَقْبَلْ مِنْهُمْ لَكِنَّهُمْ يُقْتَلُونَ حَتَّى يُوَحَّدَ اللَّهُ عَزَّ وَ جَلَّ وَ حَتَّى لَا يَكُونَ شِرْكٌ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473368\">H 14691</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Uneyr Bin Azina, from Muhammad Bin Muslim who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> said to Abu Ja’far</span><sup>asws</sup>, ‘The Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[8:39] And fight with them until there is no more persecution and religion should be only for Allah”</span>, So he<sup>asws</sup> said: ‘The case to which this Verse applies has not come yet.  The Rasool Allah<sup>saww</sup> allowed them (the non-Muslims) for his<sup>saww</sup> need and the needs of his<sup>saww</sup> companions. Had there come the case of its implementation, he<sup>saww</sup> would not have accepted from them, but they would not spare their lives until they would have accepted the Oneness of Allah<sup>azwj</sup> Mighty and Majestic and until they would not have remained any Polytheism (Shirk)’."]}}, {"index": 14917, "local_index": 51, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:51", "text": ["14692- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ سَمِعْتُهُ يَقُولُ فِي هَذِهِ الْآيَةِ يا أَيُّهَا النَّبِيُّ قُلْ لِمَنْ فِي أَيْدِيكُمْ مِنَ الْأَسْرى إِنْ يَعْلَمِ اللَّهُ فِي قُلُوبِكُمْ خَيْراً يُؤْتِكُمْ خَيْراً مِمَّا أُخِذَ مِنْكُمْ وَ يَغْفِرْ لَكُمْ قَالَ نَزَلَتْ فِي الْعَبَّاسِ وَ عَقِيلٍ وَ نَوْفَلٍ ", "وَ قَالَ إِنَّ رَسُولَ اللَّهِ (صلى الله عليه وآله) نَهَى يَوْمَ بَدْرٍ أَنْ يُقْتَلَ أَحَدٌ مِنْ بَنِي هَاشِمٍ وَ أَبُو الْبَخْتَرِيِّ فَأُسِرُوا فَأَرْسَلَ عَلِيّاً ( عليه السلام ) فَقَالَ انْظُرْ مَنْ هَاهُنَا مِنْ بَنِي هَاشِمٍ قَالَ فَمَرَّ عَلِيٌّ (عليه السلام) عَلَى عَقِيلِ بْنِ أَبِي طَالِبٍ كَرَّمَ اللَّهُ وَجْهَهُ فَحَادَ عَنْهُ فَقَالَ لَهُ عَقِيلٌ يَا ابْنَ أُمِّ عَلَيَّ أَمَا وَ اللَّهِ لَقَدْ رَأَيْتَ مَكَانِي قَالَ فَرَجَعَ إِلَى رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ قَالَ هَذَا أَبُو الْفَضْلِ فِي يَدِ فُلَانٍ وَ هَذَا عَقِيلٌ فِي يَدِ فُلَانٍ وَ هَذَا نَوْفَلُ بْنُ الْحَارِثِ فِي يَدِ فُلَانٍ", "فَقَامَ رَسُولُ اللَّهِ (صلى الله عليه وآله) حَتَّى انْتَهَى إِلَى عَقِيلٍ فَقَالَ لَهُ يَا أَبَا يَزِيدَ قُتِلَ أَبُو جَهْلٍ فَقَالَ إِذاً لَا تُنَازَعُونَ فِي تِهَامَةَ فَقَالَ إِنْ كُنْتُمْ أَثْخَنْتُمُ الْقَوْمَ وَ إِلَّا فَارْكَبُوا أَكْتَافَهُمْ فَقَالَ فَجِي‏ءَ بِالْعَبَّاسِ فَقِيلَ لَهُ افْدِ نَفْسَكَ وَ افْدِ ابْنَ أَخِيكَ فَقَالَ يَا مُحَمَّدُ تَتْرُكُنِي أَسْأَلُ قُرَيْشاً فِي كَفِّي فَقَالَ أَعْطِ مِمَّا خَلَّفْتَ عِنْدَ أُمِّ الْفَضْلِ وَ قُلْتَ لَهَا إِنْ أَصَابَنِي فِي وَجْهِي هَذَا شَيْ‏ءٌ فَأَنْفِقِيهِ عَلَى وُلْدِكِ وَ نَفْسِكِ فَقَالَ لَهُ يَا ابْنَ أَخِي مَنْ أَخْبَرَكَ بِهَذَا فَقَالَ أَتَانِي بِهِ جَبْرَئِيلُ ( عليه السلام ) مِنْ عِنْدِ اللَّهِ عَزَّ وَ جَلَّ فَقَالَ وَ مَحْلُوفِهِ مَا عَلِمَ بِهَذَا أَحَدٌ إِلَّا أَنَا وَ هِيَ أَشْهَدُ أَنَّكَ رَسُولُ اللَّهِ ", "قَالَ فَرَجَعَ الْأَسْرَى كُلُّهُمْ مُشْرِكِينَ إِلَّا الْعَبَّاسُ وَ عَقِيلٌ وَ نَوْفَلٌ كَرَّمَ اللَّهُ وُجُوهَهُمْ وَ فِيهِمْ نَزَلَتْ هَذِهِ الْآيَةُ قُلْ لِمَنْ فِي أَيْدِيكُمْ مِنَ الْأَسْرى إِنْ يَعْلَمِ اللَّهُ فِي قُلُوبِكُمْ خَيْراً إِلَى آخِرِ الْآيَةِ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473369\">H 14692</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muawiya Bin Ammar, who has said the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying regarding this Verse: <span class=\"ibTxt\">“[8:70] O Prophet! say to those of the captives who are in your hands: If Allah knows anything good in your hearts, He will give to you better than that which has been taken away from you and will forgive you”</span>, he<sup>asws</sup> said: ‘This was Revealed regarding Al-Abbas, and Aqeel, and Naufal’.", "And he<sup>asws</sup> said that: ‘The Rasool Allah<sup>saww</sup> prohibited the killing of anyone from the Clan of Hashim<sup>as</sup> and Abu Al-Bakhtary on the Day of Badr. So they were made captives. The Rasool Allah<sup>saww</sup> sent for Ali<sup>asws</sup> and said: ‘Go and see over there, who are the ones from the Clan of Hashim<sup>as</sup>’. So Ali<sup>asws</sup> passed by Aqeel son of Abu Talib<sup>as</sup>, may Allah<sup>azwj</sup> Honour his<sup>as</sup> face. He<sup>asws</sup> turned away from him. So Aqeel said to him<sup>asws</sup>, ‘O son<sup>asws</sup> of my mother<sup>as</sup> Ali<sup>asws</sup>! But, by Allah<sup>azwj</sup>, you<sup>asws</sup> can see my situation’. He<sup>asws</sup> returned to the Rasool Allah<sup>saww</sup> and said: ‘This is Abu Al-Fazl in the hand of so and so, and this is Aqeel in the hand of so and so, and this is Naufal Bin Al-Haris in the hand of so and so’.", "So the Rasool Allah<sup>saww</sup> stood up and came up to Aqeel and said to him: ‘O Abu Yazeed, Abu Jahl has been killed’. He said, ‘Then you<sup>saww</sup> will not be disputing about Tahaamat’. He<sup>saww</sup> said: ‘If you are strong people, otherwise tie up their hands’. They came up with Al-Abbas, so he<sup>saww</sup> said: ‘Ransom yourself and ransom the son of your brother’. He said, ‘O Muhammad<sup>saww</sup>! Let me go and ask the Qureish for ransoming me’. He<sup>saww</sup> said: ‘Give from what you have left behind with Umm Al-Fazl and said to her that, ‘If this I face this difficulty, so spend upon your children and on yourself’. So he said to him<sup>saww</sup>: ‘O son<sup>saww</sup> of my brother<sup>as</sup>, who informed you<sup>saww</sup> of this?’ He<sup>saww</sup> said: ‘Jibraeel<sup>as</sup> came with it to me<sup>saww</sup> from the Presence of Allah<sup>azwj</sup> Mighty and Majestic’. So he said, ‘And I had held her on oath that no one would know of this except for myself and her. I hereby testify that you<sup>saww</sup> are the Rasool Allah<sup>saww</sup>’.", "He<sup>asws</sup> said; ‘All the captives returned as Polytheists except for Al-Abbas, and Aqeel, and Naufal, may Allah<sup>azwj</sup> Honour their faces, and it was regarding them that this Verse was Revealed: <span class=\"ibTxt\">“[8:70] O Prophet! say to those of the captives who are in your hands: If Allah knows anything good in your hearts, He will give to you better than that which has been taken away from you and will forgive you”</span> up to the end of the Verse’."]}}, {"index": 14918, "local_index": 52, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:52", "text": ["14693- أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَحَدِهِمَا (عليهما السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ أَ جَعَلْتُمْ سِقايَةَ الْحاجِّ وَ عِمارَةَ الْمَسْجِدِ الْحَرامِ كَمَنْ آمَنَ بِاللَّهِ وَ الْيَوْمِ الْآخِرِ نَزَلَتْ فِي حَمْزَةَ وَ عَلِيٍّ وَ جَعْفَرٍ وَ الْعَبَّاسِ وَ شَيْبَةَ إِنَّهُمْ فَخَرُوا بِالسِّقَايَةِ وَ الْحِجَابَةِ فَأَنْزَلَ اللَّهُ جَلَّ وَ عَزَّ أَ جَعَلْتُمْ سِقايَةَ الْحاجِّ وَ عِمارَةَ الْمَسْجِدِ الْحَرامِ كَمَنْ آمَنَ بِاللَّهِ وَ الْيَوْمِ الْآخِرِ وَ كَانَ عَلِيٌّ وَ حَمْزَةُ وَ جَعْفَرٌ صَلَوَاتُ اللَّهِ عَلَيْهِمُ الَّذِينَ آمَنُوا بِاللَّهِ وَ الْيَوْمِ الْآخِرِ وَ جَاهَدُوا فِي سَبِيلِ اللَّهِ لَا يَسْتَوُونَ عِنْدَ اللَّهِ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473370\">H 14693</a> – Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbar, from Safwaan Bin yahya, from Ibn Muskan, from Abu Baseer, who has said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-o\">O</span>ne of them</span><sup>asws</sup> regarding the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[9:19] What! do you make (one who undertakes) the giving of drink to the pilgrims and the guarding of the Sacred Mosque like him who believes in Allah and the latter day”</span>. He<sup>asws</sup> said: ‘This was Revealed regarding Hamza<sup>as</sup>, and Ali<sup>asws</sup>, and Ja’far<sup>as</sup>, and Al-Abbas<sup>as</sup>, and Shaeba. They prided themselves for quenching (the thirst) of the Pilgrims. So Allah<sup>azwj</sup> Majestic and Mighty Revealed <span class=\"ibTxt\">“[9:19] What! do you make (one who undertakes) the giving of drink to the pilgrims and the guarding of the Sacred Mosque like him who believes in Allah and the latter day”</span>, and it was Ali<sup>asws</sup>, and Hamza<sup>as</sup>, and Ja’far<sup>as</sup>, may greeting be upon them<sup>as</sup> are the ones who<sup>as</sup> believed in Allah<sup>azwj</sup> and the Last Day, and they<sup>as</sup> fought in the Way of Allah<sup>azwj</sup>, and (others) are not equal to them<sup>as</sup> in the Presence of Allah<sup>azwj</sup>’."]}}, {"index": 14919, "local_index": 53, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:53", "text": ["14694- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ عَمَّارٍ السَّابَاطِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) عَنْ قَوْلِ اللَّهِ تَعَالَى وَ إِذا مَسَّ الْإِنْسانَ ضُرٌّ دَعا رَبَّهُ مُنِيباً إِلَيْهِ قَالَ نَزَلَتْ فِي أَبِي الْفَصِيلِ إِنَّهُ كَانَ رَسُولُ اللَّهِ (صلى الله عليه وآله) عِنْدَهُ سَاحِراً فَكَانَ إِذَا مَسَّهُ الضُّرُّ يَعْنِي السُّقْمَ دَعَا رَبَّهُ مُنِيباً إِلَيْهِ يَعْنِي تَائِباً إِلَيْهِ مِنْ قَوْلِهِ فِي رَسُولِ اللَّهِ (صلى الله عليه وآله) مَا يَقُولُ ثُمَّ إِذا خَوَّلَهُ نِعْمَةً مِنْهُ يَعْنِي الْعَافِيَةَ نَسِيَ ما كانَ يَدْعُوا إِلَيْهِ مِنْ قَبْلُ يَعْنِي نَسِيَ التَّوْبَةَ إِلَى اللَّهِ عَزَّ وَ جَلَّ مِمَّا كَانَ يَقُولُ فِي رَسُولِ اللَّهِ (صلى الله عليه وآله) إِنَّهُ سَاحِرٌ وَ لِذَلِكَ قَالَ اللَّهُ عَزَّ وَ جَلَّ قُلْ تَمَتَّعْ بِكُفْرِكَ قَلِيلًا إِنَّكَ مِنْ أَصْحابِ النَّارِ يَعْنِي إِمْرَتَكَ عَلَى النَّاسِ بِغَيْرِ حَقٍّ مِنَ اللَّهِ عَزَّ وَ جَلَّ وَ مِنْ رَسُولِهِ (صلى الله عليه وآله) ", "قَالَ ثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) ثُمَّ عَطَفَ الْقَوْلَ مِنَ اللَّهِ عَزَّ وَ جَلَّ فِي عَلِيٍّ ( عليه السلام ) يُخْبِرُ بِحَالِهِ وَ فَضْلِهِ عِنْدَ اللَّهِ تَبَارَكَ وَ تَعَالَى فَقَالَ أَمَّنْ هُوَ قانِتٌ آناءَ اللَّيْلِ ساجِداً وَ قائِماً يَحْذَرُ الْآخِرَةَ وَ يَرْجُوا رَحْمَةَ رَبِّهِ قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ وَ الَّذِينَ لا يَعْلَمُونَ أَنْ مُحَمَّداً رَسُولُ اللَّهِ وَ أَنَّهُ سَاحِرٌ كَذَّابٌ إِنَّما يَتَذَكَّرُ أُولُوا الْأَلْبابِ قَالَ ثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) هَذَا تَأْوِيلُهُ يَا عَمَّارُ ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473371\">H 14694</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Hassan Bin Mahboub, from hashaam Bin Saalim, from Ammaar Al-saabaty who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked Abu Abdullah</span><sup>asws</sup> about the Statement of Allah<sup>azwj</sup> the High: <span class=\"ibTxt\">“[39:8] And when distress afflicts a man he calls upon his Lord turning to Him frequently”</span>, he<sup>asws</sup> said: ‘This was Revealed regarding Abu Al-Faseyl, who used to consider the Rasool Allah<sup>saww</sup> as a sorcerer. And when distress afflicted him, meaning illness, he would call upon his Lord<sup>azwj</sup>, turning to Him<sup>azwj</sup> frequently, meaning penitently to Him<sup>azwj</sup>, from what he used to say with regards to the Rasool Allah<sup>saww</sup>. <span class=\"bTxt\">“</span><span class=\"ibTxt\">then when He makes him possess a favour from Him,” </span>meaning the restoration of health, <span class=\"bTxt\">“</span><span class=\"ibTxt\">he forgets that for which he called upon Him before,” </span>meaning his asking for Forgiveness to Allah<sup>azwj</sup> from what he used to say regarding the Rasool Allah<sup>saww</sup> that he<sup>saww</sup> was a sorcerer, and that is the Statement of Allah<sup>azwj</sup> mighty and Majestic <span class=\"bTxt\">“</span><span class=\"ibTxt\">Say: Enjoy yourself in your ungratefulness a little, surely you are of the inmates of the fire</span><span class=\"bTxt\">”</span>, meaning your influence which you have over the people with any right from Allah<sup>azwj</sup> Mighty and Majestic or from His<sup>azwj</sup> Messenger<sup>saww</sup>’. ", "He (the narrator) said: ‘Then Abu Abdullah<sup>asws</sup> said: ‘Then Allah<sup>azwj</sup> Mighty and Majestic Spoke Sympathetically with regards to Ali<sup>asws</sup> Informing him<sup>asws</sup> of his<sup>asws</sup> situation, and his<sup>asws</sup> merits in the Presence of Allah<sup>azwj</sup> Blessed and High. So He<sup>azwj</sup> Said: <span class=\"ibTxt\">“[39:9] What! he who is obedient during hours of the night, prostrating himself and standing, takes care of the hereafter and hopes for the mercy of his Lord! Say: Are those who know </span>that Muhammad is the Rasool Allah<sup>saww</sup>, <span class=\"ibTxt\">and those who do not know </span>(saying) that Muhammad<sup>saww</sup> is a lying sorcerer <span class=\"ibTxt\">alike? Only the men of understanding are mindful”</span>. Then Abu Abdullah<sup>asws</sup> said: ‘This is its explanation, O Ammar’."]}}, {"index": 14920, "local_index": 54, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:54", "text": ["14695- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ قَالَ تَلَوْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ (عليه السلام) ذَوا عَدْلٍ مِنْكُمْ فَقَالَ ذُو عَدْلٍ مِنْكُمْ هَذَا مِمَّا أَخْطَأَتْ فِيهِ الْكُتَّابُ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473372\">H 14695</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammaad Bin Usmaan who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> recited: </span><span class=\"ibTxt\">“[5:95] as two just persons among you shall judge”</span> in the presence of Abu Abdullah<sup>asws</sup>, so he<sup>asws</sup> said: ‘Two just ones among you – this is from what the scribes have erred with regards to it’ (referring to the compilation mistakes in the Holy Quran - Tahreef in Quran)."]}}, {"index": 14921, "local_index": 55, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:55", "text": ["14696- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ رَجُلٍ عَنْ أَبِي جَعْفَرٍ (عليه السلام) لا تَسْئَلُوا عَنْ أَشْياءَ لَمْ تُبْدَ لَكُمْ إِنْ تُبْدَ لَكُمْ تَسُؤْكُمْ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473373\">H 14696</a> – A number of our companions, from Sahl Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from a man, who has narrated:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup style=\"font-weight: normal\">asws</sup> (has explained this verse) about <span class=\"ibTxt\">“[5:101] O you who believe! do not put questions about things which if declared to you may trouble you”</span>"]}}, {"index": 14922, "local_index": 56, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:56", "text": ["14697- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ الْبَرْقِيِّ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ مُحَمَّدِ بْنِ مَرْوَانَ قَالَ تَلَا أَبُو عَبْدِ اللَّهِ (عليه السلام) وَ تَمَّتْ كَلِمَتُ رَبِّكَ الْحُسْنَى صِدْقاً وَ عَدْلًا فَقُلْتُ جُعِلْتُ فِدَاكَ إِنَّمَا نَقْرَؤُهَا وَ تَمَّتْ كَلِمَةُ رَبِّكَ صِدْقاً وَ عَدْلًا فَقَالَ إِنَّ فِيهَا الْحُسْنَى."], "translations": {"en.hubeali": ["<a id=\"_Toc492473374\">H 14697</a> – Ali Bin Ibrahim, from Ahmad Bin Muhammad Bin Khalid Al-Barqy, from his father, from Muhammad Bin Sinan, from Muhammad bin Marwaan who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> recited: <span class=\"ibTxt\">“[6:115] And the </span><span style=\"font-style: italic; font-weight: bold; text-decoration: underline\">‘beautiful’</span><span class=\"ibTxt\"> word of your Lord has been accomplished truly and justly”</span>. I said, ‘May I be sacrificed for you<sup>asws</sup>, but rather we are reciting it as <span class=\"ibTxt\">“[6:115] And the word of your Lord has been accomplished truly and justly”</span>. So he<sup>asws</sup> said: ‘Surely, in it is ‘the beautiful’’ (referring to the Tahreef in the Holy Quran)."]}}, {"index": 14923, "local_index": 57, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:57", "text": ["14698- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الْأَصَمِّ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ الْبَطَلِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِهِ تَعَالَى وَ قَضَيْنا إِلى بَنِي إِسْرائِيلَ فِي الْكِتابِ لَتُفْسِدُنَّ فِي الْأَرْضِ مَرَّتَيْنِ قَالَ قَتْلُ عَلِيِّ بْنِ أَبِي طَالِبٍ (عليه السلام) وَ طَعْنُ الْحَسَنِ (عليه السلام) وَ لَتَعْلُنَّ عُلُوًّا كَبِيراً قَالَ قَتْلُ الْحُسَيْنِ (عليه السلام)", "فَإِذا جاءَ وَعْدُ أُولاهُما فَإِذَا جَاءَ نَصْرُ دَمِ الْحُسَيْنِ (عليه السلام) بَعَثْنا عَلَيْكُمْ عِباداً لَنا أُولِي بَأْسٍ شَدِيدٍ فَجاسُوا خِلالَ الدِّيارِ قَوْمٌ يَبْعَثُهُمُ اللَّهُ قَبْلَ خُرُوجِ الْقَائِمِ (عليه السلام) فَلَا يَدَعُونَ وَتْراً لآِلِ مُحَمَّدٍ إِلَّا قَتَلُوهُ وَ كانَ وَعْداً مَفْعُولًا خُرُوجُ الْقَائِمِ (عليه السلام) ", "ثُمَّ رَدَدْنا لَكُمُ الْكَرَّةَ عَلَيْهِمْ خُرُوجُ الْحُسَيْنِ (عليه السلام) فِي سَبْعِينَ مِنْ أَصْحَابِهِ عَلَيْهِمُ الْبَيْضُ الْمُذَهَّبُ لِكُلِّ بَيْضَةٍ وَجْهَانِ الْمُؤَدُّونَ إِلَى النَّاسِ أَنَّ هَذَا الْحُسَيْنَ قَدْ خَرَجَ حَتَّى لَا يَشُكَّ الْمُؤْمِنُونَ فِيهِ وَ أَنَّهُ لَيْسَ بِدَجَّالٍ وَ لَا شَيْطَانٍ وَ الْحُجَّةُ الْقَائِمُ بَيْنَ أَظْهُرِهِمْ فَإِذَا اسْتَقَرَّتِ الْمَعْرِفَةُ فِي قُلُوبِ الْمُؤْمِنِينَ أَنَّهُ الْحُسَيْنُ (عليه السلام) جَاءَ الْحُجَّةَ الْمَوْتُ فَيَكُونُ الَّذِي يُغَسِّلُهُ وَ يُكَفِّنُهُ وَ يُحَنِّطُهُ وَ يَلْحَدُهُ فِي حُفْرَتِهِ الْحُسَيْنَ بْنَ عَلِيٍّ (عليه السلام) وَ لَا يَلِي الْوَصِيَّ إِلَّا الْوَصِيُّ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473375\">H 14698</a> – A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al-Hassan Bin Shammoun, from Abdullah Bin Abdul Rahmaan Al-A’asam, from Abdullah Bin Al-Qasim Al-Batl, who has narrated the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> regarding the Statement: <span class=\"ibTxt\">“[17:4] And We had made known to the children of Israel in the Book: Most certainly you will make mischief in the land twice”</span>, he<sup>asws</sup> said: ‘The killing of Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> and the stabbing of Al-Hassan<sup>asws</sup>’. <span class=\"ibTxt\">“and most certainly you will behave insolently with great insolence”</span>, he<sup>asws</sup> said (this refers to): ‘The killing of Al-Husayn<sup>asws</sup>’.", "<span class=\"ibTxt\">“[17:5] So when the promise for the first of the two came, </span>So when the help comes for the blood of Al-Husayn<sup>asws</sup>, <span class=\"ibTxt\">We sent over you Our servants, of mighty prowess, so they go to and fro among the houses, </span>a people whom Allah<sup>azwj</sup> will be Sending before the coming out of Al-Qaim<sup>ajfj</sup> (who will serve him<sup>ajfj</sup> and under his<sup>ajfj</sup> command) they will not leave an enemy of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> except that they will kill him. <span class=\"ibTxt\">and it was a promise to be accomplished” </span>This is the coming of Al-Qaim<sup>asws</sup>. ", "<span class=\"ibTxt\">“[17:6] Then We gave you back the turn to prevail against them, </span>This is the coming of Al-Husayn<sup>asws</sup> and seventy of his<sup>asws</sup> companions who will be wearing protective helmets. For each of the helmets would be two facets to demonstrate to the people that this is indeed Al-Husayn<sup>asws</sup> who has come out, until the Believers would have no doubts about it, and that he<sup>asws</sup> is neither Al-Dajjaal<sup>la</sup>, nor Satan<sup>la</sup>, and Al-Hujjat Al-Qaim<sup>asws</sup> would also come in their support. So when the recognition would be settled in the hearts of the Believers that he<sup>asws</sup> is indeed Al-Husayn<sup>asws</sup>, the death will approach Al-Hujjat<sup>asws</sup>. So the one<sup>asws</sup> who would be washing him<sup>asws</sup>, and shrouding him<sup>asws</sup>, and embalming him<sup>asws</sup>, and burying him<sup>asws</sup> in his<sup>asws</sup> grave would be Al-Husayn Bin Ali<sup>asws</sup>, no one follows the successor<sup>asws</sup> except for the successor<sup>asws</sup>’."]}}, {"index": 14924, "local_index": 58, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:58", "text": ["14699- سَهْلٌ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ عَنْ مُحَمَّدِ بْنِ حَفْصٍ التَّمِيمِيِّ قَالَ حَدَّثَنِي أَبُو جَعْفَرٍ الْخَثْعَمِيُّ قَالَ قَالَ لَمَّا سَيَّرَ عُثْمَانُ أَبَا ذَرٍّ إِلَى الرَّبَذَةِ شَيَّعَهُ أَمِيرُ الْمُؤْمِنِينَ وَ عَقِيلٌ وَ الْحَسَنُ وَ الْحُسَيْنُ (عليهما السلام) وَ عَمَّارُ بْنُ يَاسِرٍ رَضِيَ اللَّهُ عَنْهُ فَلَمَّا كَانَ عِنْدَ الْوَدَاعِ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) يَا أَبَا ذَرٍّ إِنَّكَ إِنَّمَا غَضِبْتَ لِلَّهِ عَزَّ وَ جَلَّ فَارْجُ مَنْ غَضِبْتَ لَهُ إِنَّ الْقَوْمَ خَافُوكَ عَلَى دُنْيَاهُمْ وَ خِفْتَهُمْ عَلَى دِينِكَ فَأَرْحَلُوكَ عَنِ الْفِنَاءِ وَ امْتَحَنُوكَ بِالْبَلَاءِ وَ وَ اللَّهِ لَوْ كَانَتِ السَّمَاوَاتُ وَ الْأَرْضُ عَلَى عَبْدٍ رَتْقاً ثُمَّ اتَّقَى اللَّهَ عَزَّ وَ جَلَّ جَعَلَ لَهُ مِنْهَا مَخْرَجاً فَلَا يُؤْنِسْكَ إِلَّا الْحَقُّ وَ لَا يُوحِشْكَ إِلَّا الْبَاطِلُ ", "ثُمَّ تَكَلَّمَ عَقِيلٌ فَقَالَ يَا أَبَا ذَرٍّ أَنْتَ تَعْلَمُ أَنَّا نُحِبُّكَ وَ نَحْنُ نَعْلَمُ أَنَّكَ تُحِبُّنَا وَ أَنْتَ قَدْ حَفِظْتَ فِينَا مَا ضَيَّعَ النَّاسُ إِلَّا الْقَلِيلَ فَثَوَابُكَ عَلَى اللَّهِ عَزَّ وَ جَلَّ وَ لِذَلِكَ أَخْرَجَكَ الْمُخْرِجُونَ وَ سَيَّرَكَ الْمُسَيِّرُونَ فَثَوَابُكَ عَلَى اللَّهِ عَزَّ وَ جَلَّ فَاتَّقِ اللَّهَ وَ اعْلَمْ أَنَّ اسْتِعْفَاءَكَ الْبَلَاءَ مِنَ الْجَزَعِ وَ اسْتِبْطَاءَكَ الْعَافِيَةَ مِنَ الْيَأْسِ فَدَعِ الْيَأْسَ وَ الْجَزَعَ وَ قُلْ حَسْبِيَ اللَّهُ وَ نِعْمَ الْوَكِيلُ ", "ثُمَّ تَكَلَّمَ الْحَسَنُ (عليه السلام) فَقَالَ يَا عَمَّاهْ إِنَّ الْقَوْمَ قَدْ أَتَوْا إِلَيْكَ مَا قَدْ تَرَى وَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ بِالْمَنْظَرِ الْأَعْلَى فَدَعْ عَنْكَ ذِكْرَ الدُّنْيَا بِذِكْرِ فِرَاقِهَا وَ شِدَّةِ مَا يَرِدُ عَلَيْكَ لِرَخَاءِ مَا بَعْدَهَا وَ اصْبِرْ حَتَّى تَلْقَى نَبِيَّكَ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ وَ هُوَ عَنْكَ رَاضٍ إِنْ شَاءَ اللَّهُ ", "ثُمَّ تَكَلَّمَ الْحُسَيْنُ (عليه السلام) فَقَالَ يَا عَمَّاهْ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى قَادِرٌ أَنْ يُغَيِّرَ مَا تَرَى وَ هُوَ كُلَّ يَوْمٍ فِي شَأْنٍ إِنَّ الْقَوْمَ مَنَعُوكَ دُنْيَاهُمْ وَ مَنَعْتَهُمْ دِينَكَ فَمَا أَغْنَاكَ عَمَّا مَنَعُوكَ وَ مَا أَحْوَجَهُمْ إِلَى مَا مَنَعْتَهُمْ فَعَلَيْكَ بِالصَّبْرِ فَإِنَّ الْخَيْرَ فِي الصَّبْرِ وَ الصَّبْرَ مِنَ الْكَرَمِ وَ دَعِ الْجَزَعَ فَإِنَّ الْجَزَعَ لَا يُغْنِيكَ ", "ثُمَّ تَكَلَّمَ عَمَّارٌ رَضِيَ اللَّهُ عَنْهُ فَقَالَ يَا أَبَا ذَرٍّ أَوْحَشَ اللَّهُ مَنْ أَوْحَشَكَ وَ أَخَافَ مَنْ أَخَافَكَ إِنَّهُ وَ اللَّهِ مَا مَنَعَ النَّاسَ أَنْ يَقُولُوا الْحَقَّ إِلَّا الرُّكُونُ إِلَى الدُّنْيَا وَ الْحُبُّ لَهَا أَلَا إِنَّمَا الطَّاعَةُ مَعَ الْجَمَاعَةِ وَ الْمُلْكُ لِمَنْ غَلَبَ عَلَيْهِ وَ إِنَّ هَؤُلَاءِ الْقَوْمَ دَعَوُا النَّاسَ إِلَى دُنْيَاهُمْ فَأَجَابُوهُمْ إِلَيْهَا وَ وَهَبُوا لَهُمْ دِينَهُمْ فَخَسِرُوا الدُّنْيَا وَ الْآخِرَةَ وَ ذَلِكَ هُوَ الْخُسْرَانُ الْمُبِينُ ", "ثُمَّ تَكَلَّمَ أَبُو ذَرٍّ رَضِيَ اللَّهُ عَنْهُ فَقَالَ عَلَيْكُمُ السَّلَامُ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ بِأَبِي وَ أُمِّي هَذِهِ الْوُجُوهُ فَإِنِّي إِذَا رَأَيْتُكُمْ ذَكَرْتُ رَسُولَ اللَّهِ (صلى الله عليه وآله) بِكُمْ وَ مَا لِي بِالْمَدِينَةِ شَجَنٌ لِأَسْكُنَ غَيْرُكُمْ وَ إِنَّهُ ثَقُلَ عَلَى عُثْمَانَ جِوَارِي بِالْمَدِينَةِ كَمَا ثَقُلَ عَلَى مُعَاوِيَةَ بِالشَّامِ فَآلَى أَنْ يُسَيِّرَنِي إِلَى بَلْدَةٍ فَطَلَبْتُ إِلَيْهِ أَنْ يَكُونَ ذَلِكَ إِلَى الْكُوفَةِ فَزَعَمَ أَنَّهُ يَخَافُ أَنْ أُفْسِدَ عَلَى أَخِيهِ النَّاسَ بِالْكُوفَةِ وَ آلَى بِاللَّهِ لَيُسَيِّرُنِي إِلَى بَلْدَةٍ لَا أَرَى فِيهَا أَنِيساً وَ لَا أَسْمَعُ بِهَا حَسِيساً وَ إِنِّي وَ اللَّهِ مَا أُرِيدُ إِلَّا اللَّهَ عَزَّ وَ جَلَّ صَاحِباً وَ مَا لِي مَعَ اللَّهِ وَحْشَةٌ حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَ هُوَ رَبُّ الْعَرْشِ الْعَظِيمِ وَ صَلَّى اللَّهُ عَلَى سَيِّدِنَا مُحَمَّدٍ وَ آلِهِ الطَّيِّبِينَ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473376\">H 14699</a> – Sahl, from Muhammad Bin Al-Hassan, from Muhammad Bin Hafs Al-Tamimy who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far Al-Khash’amy</span> narrated to me saying, ‘When Usman exiled Abu Dharr<sup>ar</sup> to Al-Rabza, Amir-ul-Momineen<sup>asws</sup>, and Aqeel<sup>as</sup>, and Al-Hassan<sup>asws</sup>, and Al-Husayn<sup>asws</sup>, and Ammar Bin Yasir<sup>ar</sup> bid farewell to him<sup>ar</sup>. So when they were inside the valley, Amir-ul-Momineen<sup>asws</sup> said; ‘O Abu Dharr<sup>ar</sup>! You<sup>ar</sup> were angry for the Sake of Allah<sup>azwj</sup>, so have hope from His<sup>azwj</sup> Anger. The people feared you for their world whilst you<sup>ar</sup> feared upon your<sup>ar</sup> Religion, so they exiled you<sup>ar</sup> from (that which is) doomed and tested you<sup>ar</sup> by the affliction. And, by Allah<sup>azwj</sup>, if the skies and the earth are (forced) to closed-up on a servant, then Allah<sup>azwj</sup> would (surely) Open up a way out for him. Let nothing comfort you<sup>ar</sup> except for the truth, and let nothing scare you<sup>ar</sup> except for the falsehood’.", "Then Aqeel<sup>ar</sup> spoke saying, ‘O Abu Dharr<sup>ar</sup>! You<sup>ar</sup> know that we love you<sup>ar</sup>, and we know that you<sup>ar</sup> love us, and you<sup>ar</sup> have preserved with regards to us what the people have wasted except for a few. So your<sup>ar</sup> Reward is upon Allah<sup>azwj</sup>, and it is for that that they have thrown you<sup>ar</sup> out as the castaway and made you<sup>ar</sup> travel in the exile. So your<sup>ar</sup> Reward is upon Allah<sup>azwj</sup> Mighty and Majestic. So fear Allah<sup>azwj</sup> and know that you<sup>ar</sup> should resign to the affliction from the anxiety and your<sup>ar</sup> deterioration of the health from the despair. So leave the resignation and the despair and say, ‘Allah<sup>azwj</sup> is Sufficient for me<sup>ar</sup> and the best ‘الْوَكِيلُ’ advocate’. ", "Then Al-Hassan<sup>asws</sup> spoke saying: ‘O uncle<sup>ar</sup>! The people have meted out to you<sup>ar</sup> what you<sup>ar</sup> have seen, and Allah<sup>azwj</sup> is Watching from High above. So leave the memories of the world by remembrance of its separation and the difficulties, by what will be coming to you<sup>ar</sup> of the ease after it, and be patient until you<sup>ar</sup> meet your<sup>ar</sup> Prophet<sup>saww</sup>, and he<sup>saww</sup> will be pleased with you<sup>ar</sup>, Allah<sup>azwj</sup> Willing’.", "Then Al-Husayn<sup>asws</sup> spoke saying: ‘O uncle<sup>ar</sup>! Allah<sup>azwj</sup> Blessed and High has the Power to Change what you<sup>ar</sup> see, and every day He<sup>azwj</sup> is in (a State of) Glory. The people have denied you<sup>ar</sup> their world, and you<sup>ar</sup> have denied them your<sup>ar</sup> Religion. So what is your<sup>ar</sup> need from what they have denied you<sup>ar</sup>, and they are in greatest need for what you<sup>ar</sup> have denied them. So it is for you<sup>ar</sup> to observe patience, for the goodness is in the patience, and the patience is from the generosity. And leave the anxiety, for the anxiety provides no refuge’.", "Then Ammar<sup>ar</sup> spoke saying, ‘O Abu Dharr<sup>ar</sup>! May Allah<sup>azwj</sup> Make lonely the one who made you<sup>ar</sup> to be lonely, and Frighten the one who (tried to) frightened you<sup>ar</sup>. By Allah<sup>azwj</sup>! Nothing prevents the people from speaking the truth except their reliance upon the world and the love for it. But rather, the obedience is with the group and the kingdom is for the one who overcomes it, and this group of people have called the people to their world, so they responded to them for it and bestowed their Religion upon them. Thus, they incurred the loss of the world and the Hereafter, and that is what is the clear loss’.", "Then Abu Dharr<sup>ar</sup> spoke saying, ‘Peace be upon you all, and the Mercy of Allah<sup>azwj</sup> and His<sup>a</sup><sup>zwj</sup> Blessings! May my<sup>ar</sup> father and my<sup>ar</sup> mother (be sacrificed for you all). These are the faces, when I<sup>ar</sup> see them, I<sup>ar</sup> remember the Rasool Allah<sup>saww</sup>. And what is there for me<sup>ar</sup> in Al-Medina to dwell in apart from you. And it became heavy upon Usman to let me<sup>ar</sup> (live) in the neighbourhood of Al-Medina just as it became heavy upon Muawiya in Syria. He (Usman) decided that he would exile me<sup>ar</sup> to a town, so I<sup>ar</sup> said it should be Al-Kufa. So he feared that I<sup>ar</sup> would spoil the relationship of his brother with the people in Al-Kufa. By Allah<sup>azwj</sup> He is sending me<sup>ar</sup> to a place in which I<sup>ar</sup> will neither see any human being nor hear a humming sound. By Allah<sup>azwj</sup>! I<sup>ar</sup> do not want anyone except Allah<sup>azwj</sup> as a companion, and what is the loneliness for me<sup>ar</sup> when Allah<sup>azwj</sup> is with me<sup>ar</sup>. Allah<sup>azwj</sup> is Sufficient for me<sup>ar</sup>. There is no god except for Him<sup>azwj</sup>. Upon Him<sup>azwj</sup> do I<sup>ar</sup> rely and He<sup>azwj</sup> is the Lord<sup>azwj</sup> of the Magnificent Throne, and greetings of Allah<sup>azwj</sup> be upon our Chief Muhammad<sup>saww</sup> and his<sup>saww</sup> purified Progeny<sup>asws</sup>’."]}}, {"index": 14925, "local_index": 59, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:59", "text": ["14700- أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ فَضَّالٍ وَ الْحَجَّالِ جَمِيعاً عَنْ ثَعْلَبَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَسْلَمَةَ الْجَرِيرِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ (عليه السلام) يُوَبِّخُونَّا وَ يُكَذِّبُونَّا أَنَّا نَقُولُ إِنَّ صَيْحَتَيْنِ تَكُونَانِ يَقُولُونَ مِنْ أَيْنَ تُعْرَفُ الْمُحِقَّةُ مِنَ الْمُبْطِلَةِ إِذَا كَانَتَا قَالَ فَمَا ذَا تَرُدُّونَ عَلَيْهِمْ قُلْتُ مَا نَرُدُّ عَلَيْهِمْ شَيْئاً قَالَ قُولُوا يُصَدِّقُ بِهَا إِذَا كَانَ مَنْ يُؤْمِنُ بِهَا مِنْ قَبْلُ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ أَ فَمَنْ يَهْدِي إِلَى الْحَقِّ أَحَقُّ أَنْ يُتَّبَعَ أَمَّنْ لا يَهِدِّي إِلَّا أَنْ يُهْدى فَما لَكُمْ كَيْفَ تَحْكُمُونَ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473377\">H 14700</a> – Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbaar, from Ibn Fazzaal and Al-Hajjaal, from Sa’albat, from Abdul Rahmaan Bin Muslama Al-Jariry who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> said to Abu Abdullah</span><sup style=\"font-weight: normal\">asws</sup>: ‘They reproach us and belie us that we are saying that the two ‘announcements’ which are to occur. They are saying, ‘How would we differentiate between the true one from the false one, if we were to be there?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘So what do you respond to them with?’ I said, ‘We do not respond to them with anything’. He<sup style=\"font-weight: normal\">asws</sup> said: ‘Say to them, ‘Those who believed in it from before (have faith) would recognise it. Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic Says: <span class=\"ibTxt\">“[10:35] Is He then Who guides to the truth more worthy to be followed, or he who himself does not go aright unless he is guided? What then is the matter with you; how do you judge?”</span>"]}}, {"index": 14926, "local_index": 60, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:60", "text": ["14701- عَنْهُ عَنْ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ وَ الْحَجَّالِ عَنْ دَاوُدَ بْنِ فَرْقَدٍ قَالَ سَمِعَ رَجُلٌ مِنَ الْعِجْلِيَّةِ هَذَا الْحَدِيثَ قَوْلَهُ يُنَادِي مُنَادٍ أَلَا إِنَّ فُلَانَ بْنَ فُلَانٍ وَ شِيعَتَهُ هُمُ الْفَائِزُونَ أَوَّلَ النَّهَارِ وَ يُنَادِي آخِرَ النَّهَارِ أَلَا إِنَّ عُثْمَانَ وَ شِيعَتَهُ هُمُ الْفَائِزُونَ قَالَ وَ يُنَادِي أَوَّلَ النَّهَارِ مُنَادَى آخِرِ النَّهَارِ فَقَالَ الرَّجُلُ فَمَا يُدْرِينَا أَيُّمَا الصَّادِقُ مِنَ الْكَاذِبَ فَقَالَ يُصَدِّقُهُ عَلَيْهَا مَنْ كَانَ يُؤْمِنُ بِهَا قَبْلَ أَنْ يُنَادِيَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ أَ فَمَنْ يَهْدِي إِلَى الْحَقِّ أَحَقُّ أَنْ يُتَّبَعَ أَمَّنْ لا يَهِدِّي إِلَّا أَنْ يُهْدى الْآيَةَ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473378\">H 14701</a> – From him, from Muhammad, from Ibn Fazzaal and Al-hajjaal, from Dawood Bin Farqad who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span> man from Ajaliyya</span> heard this Hadeeth – A caller will call out: ‘So and so son of so and so and his Shites are the successful ones’ at the beginning of the day, and another one will call out at the end of the day: ‘Usman and his Shites are the successful ones’. He<sup style=\"font-weight: normal\">asws</sup> said: ‘And the caller at the beginning of the day and (another) calling at the end of the day’. So the man said, ‘So what would make us understand which one is the truthful from the liar?’ So he<sup style=\"font-weight: normal\">asws</sup> said: ‘The one who would believe in it before the call, would be ratifying it. Allah<sup style=\"font-weight: normal\">azwj</sup> Says: <span class=\"ibTxt\">“[10:35] Is He then Who guides to the truth more worthy to be followed, or he who himself does not go aright unless he is guided?” </span>The verse. "]}}, {"index": 14927, "local_index": 61, "part_type": "Hadith", "path": "/books/al-kafi:8:1:39:61", "text": ["14702- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ لَا تَرَوْنَ مَا تُحِبُّونَ حَتَّى يَخْتَلِفَ بَنُو فُلَانٍ فِيمَا بَيْنَهُمْ فَإِذَا اخْتَلَفُوا طَمِعَ النَّاسُ وَ تَفَرَّقَتِ الْكَلِمَةُ وَ خَرَجَ السُّفْيَانِيُّ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473379\">H 14702</a> – Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Is’haq Bin Ammar, who has said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘You will not be seeing what you would love to (appearance of Al-Qaim<sup>asws</sup>) until the Clan of so and so (Clan of Abbas) differing in what is between them. So when they differ, the people would become greedy and the words would be separated, and Al-Sufyani would come out’."]}}]}, "index": "al-kafi:8:1:39", "kind": "verse_list"}