{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 4"
        },
        "path": "/books/al-kafi:8:1:4",
        "titles": {
          "ar": "خُطْبَةُ الطَّالُوتِيَّةِ",
          "en": "SERMON OF AL-TAALUTIYYA"
        }
      }
    ],
    "index": 2275,
    "local_index": 4,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 5"
        },
        "path": "/books/al-kafi:8:1:5",
        "titles": {
          "ar": "حَدِيثُ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَعَ الْمَنْصُورِ فِي مَوْكِبِه",
          "en": "HADEETH OF ABU ABDULLAH<sup>asws</sup> WITH AL-MANSOUR IN HIS PROCESSION"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:8:1:3",
        "titles": {
          "ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) وَ هِيَ خُطْبَةُ الْوَسِيلَةِ",
          "en": "SERMON OF AMIR –UL- MOMINEEN<sup>asws</sup> AND IT IS THE SERMON OF THE MEANS (AL-WASEELA)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:4",
    "titles": {
      "ar": "خُطْبَةُ الطَّالُوتِيَّةِ",
      "en": "SERMON OF AL-TAALUTIYYA"
    },
    "verse_count": 2,
    "verse_start_index": 14688,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 14689,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:4:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14453</span>  -مُحَمَّدُ بْنُ</span> عَلِيِّ بْنِ مَعْمَرٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَيُّوبَ الْأَشْعَرِيُّ عَنْ عَمْرٍو الْأَوْزَاعِيِّ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ أَبِي الْهَيْثَمِ بْنِ التَّيِّهَانِ أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) خَطَبَ النَّاسَ بِالْمَدِينَةِ",
          "فَقَالَ الْحَمْدُ لِلَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ كَانَ حَيّاً بِلَا كَيْفٍ وَ لَمْ يَكُنْ لَهُ كَانٌ وَ لَا كَانَ لِكَانِهِ كَيْفٌ وَ لَا كَانَ لَهُ أَيْنٌ وَ لَا كَانَ فِي شَيْ‏ءٍ وَ لَا كَانَ عَلَى شَيْ‏ءٍ وَ لَا ابْتَدَعَ لِكَانِهِ مَكَاناً وَ لَا قَوِيَ بَعْدَ مَا كَوَّنَ شَيْئاً وَ لَا كَانَ ضَعِيفاً قَبْلَ أَنْ يُكَوِّنَ شَيْئاً وَ لَا كَانَ مُسْتَوْحِشاً قَبْلَ أَنْ يَبْتَدِعَ شَيْئاً وَ لَا يُشْبِهُ شَيْئاً وَ لَا كَانَ خِلْواً عَنِ الْمُلْكِ قَبْلَ إِنْشَائِهِ وَ لَا يَكُونُ خِلْواً مِنْهُ بَعْدَ ذَهَابِهِ كَانَ إِلَهاً حَيّاً بِلَا حَيَاةٍ وَ مَالِكاً قَبْلَ أَنْ يُنْشِئَ شَيْئاً وَ مَالِكاً بَعْدَ إِنْشَائِهِ لِلْكَوْنِ ",
          "وَ لَيْسَ يَكُونُ لِلَّهِ كَيْفٌ وَ لَا أَيْنٌ وَ لَا حَدٌّ يُعْرَفُ وَ لَا شَيْ‏ءٌ يُشْبِهُهُ وَ لَا يَهْرَمُ لِطُولِ بَقَائِهِ وَ لَا يَضْعُفُ لِذُعْرَةٍ وَ لَا يَخَافُ كَمَا تَخَافُ خَلِيقَتُهُ مِنْ شَيْ‏ءٍ وَ لَكِنْ سَمِيعٌ بِغَيْرِ سَمْعٍ وَ بَصِيرٌ بِغَيْرِ بَصَرٍ وَ قَوِيٌّ بِغَيْرِ قُوَّةٍ مِنْ خَلْقِهِ لَا تُدْرِكُهُ حَدَقُ النَّاظِرِينَ وَ لَا يُحِيطُ بِسَمْعِهِ سَمْعُ السَّامِعِينَ ",
          "إِذَا أَرَادَ شَيْئاً كَانَ بِلَا مَشُورَةٍ وَ لَا مُظَاهَرَةٍ وَ لَا مُخَابَرَةٍ وَ لَا يَسْأَلُ أَحَداً عَنْ شَيْ‏ءٍ مِنْ خَلْقِهِ أَرَادَهُ لا تُدْرِكُهُ الْأَبْصارُ وَ هُوَ يُدْرِكُ الْأَبْصارَ وَ هُوَ اللَّطِيفُ الْخَبِيرُ وَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ أَرْسَلَهُ بِالْهُدَى وَ دِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَ لَوْ كَرِهَ الْمُشْرِكُونَ فَبَلَّغَ الرِّسَالَةَ وَ أَنْهَجَ الدَّلَالَةَ ( صلى الله عليه وآله ) ",
          "أَيُّهَا الْأُمَّةُ الَّتِي خُدِعَتْ فَانْخَدَعَتْ وَ عَرَفَتْ خَدِيعَةَ مَنْ خَدَعَهَا فَأَصَرَّتْ عَلَى مَا عَرَفَتْ وَ اتَّبَعَتْ أَهْوَاءَهَا وَ ضَرَبَتْ فِي عَشْوَاءِ غَوَايَتِهَا وَ قَدِ اسْتَبَانَ لَهَا الْحَقُّ فَصَدَّتْ عَنْهُ وَ الطَّرِيقُ الْوَاضِحُ فَتَنَكَّبَتْهُ ",
          "أَمَا وَ الَّذِي فَلَقَ الْحَبَّةَ وَ بَرَأَ النَّسَمَةَ لَوِ اقْتَبَسْتُمُ الْعِلْمَ مِنْ مَعْدِنِهِ وَ شَرِبْتُمُ الْمَاءَ بِعُذُوبَتِهِ وَ ادَّخَرْتُمُ الْخَيْرَ مِنْ مَوْضِعِهِ وَ أَخَذْتُمُ الطَّرِيقَ مِنْ وَاضِحِهِ وَ سَلَكْتُمْ مِنَ الْحَقِّ نَهْجَهُ لَنَهَجَتْ بِكُمُ السُّبُلُ وَ بَدَتْ لَكُمُ الْأَعْلَامُ وَ أَضَاءَ لَكُمُ الْإِسْلَامُ فَأَكَلْتُمْ رَغَداً وَ مَا عَالَ فِيكُمْ عَائِلٌ وَ لَا ظُلِمَ مِنْكُمْ مُسْلِمٌ وَ لَا مُعَاهَدٌ وَ لَكِنْ سَلَكْتُمْ سَبِيلَ الظَّلَامِ فَأَظْلَمَتْ عَلَيْكُمْ دُنْيَاكُمْ بِرُحْبِهَا وَ سُدَّتْ عَلَيْكُمْ أَبْوَابُ الْعِلْمِ فَقُلْتُمْ بِأَهْوَائِكُمْ وَ اخْتَلَفْتُمْ فِي دِينِكُمْ فَأَفْتَيْتُمْ فِي دِينِ اللَّهِ بِغَيْرِ عِلْمٍ ",
          "وَ اتَّبَعْتُمُ الْغُوَاةَ فَأَغْوَتْكُمْ وَ تَرَكْتُمُ الْأَئِمَّةَ فَتَرَكُوكُمْ فَأَصْبَحْتُمْ تَحْكُمُونَ بِأَهْوَائِكُمْ إِذَا ذُكِرَ الْأَمْرُ سَأَلْتُمْ أَهْلَ الذِّكْرِ فَإِذَا أَفْتَوْكُمْ قُلْتُمْ هُوَ الْعِلْمُ بِعَيْنِهِ فَكَيْفَ وَ قَدْ تَرَكْتُمُوهُ وَ نَبَذْتُمُوهُ وَ خَالَفْتُمُوهُ رُوَيْداً عَمَّا قَلِيلٍ تَحْصُدُونَ جَمِيعَ مَا زَرَعْتُمْ وَ تَجِدُونَ وَخِيمَ مَا اجْتَرَمْتُمْ وَ مَا اجْتَلَبْتُمْ",
          "وَ الَّذِي فَلَقَ الْحَبَّةَ وَ بَرَأَ النَّسَمَةَ لَقَدْ عَلِمْتُمْ أَنِّي صَاحِبُكُمْ وَ الَّذِي بِهِ أُمِرْتُمْ وَ أَنِّي عَالِمُكُمْ وَ الَّذِي بِعِلْمِهِ نَجَاتُكُمْ وَ وَصِيُّ نَبِيِّكُمْ وَ خِيَرَةُ رَبِّكُمْ وَ لِسَانُ نُورِكُمْ وَ الْعَالِمُ بِمَا يُصْلِحُكُمْ ",
          "فَعَنْ قَلِيلٍ رُوَيْداً يَنْزِلُ بِكُمْ مَا وُعِدْتُمْ وَ مَا نَزَلَ بِالْأُمَمِ قَبْلَكُمْ وَ سَيَسْأَلُكُمُ اللَّهُ عَزَّ وَ جَلَّ عَنْ أَئِمَّتِكُمْ مَعَهُمْ تُحْشَرُونَ وَ إِلَى اللَّهِ عَزَّ وَ جَلَّ غَداً تَصِيرُونَ ",
          "أَمَا وَ اللَّهِ لَوْ كَانَ لِي عِدَّةُ أَصْحَابِ طَالُوتَ أَوْ عِدَّةُ أَهْلِ بَدْرٍ وَ هُمْ أَعْدَاؤُكُمْ لَضَرَبْتُكُمْ بِالسَّيْفِ حَتَّى تَئُولُوا إِلَى الْحَقِّ وَ تُنِيبُوا لِلصِّدْقِ فَكَانَ أَرْتَقَ لِلْفَتْقِ وَ آخَذَ بِالرِّفْقِ اللَّهُمَّ فَاحْكُمْ بَيْنَنَا بِالْحَقِّ وَ أَنْتَ خَيْرُ الْحَاكِمِينَ ",
          "قَالَ ثُمَّ خَرَجَ مِنَ الْمَسْجِدِ فَمَرَّ بِصِيرَةٍ فِيهَا نَحْوٌ مِنْ ثَلَاثِينَ شَاةً فَقَالَ وَ اللَّهِ لَوْ أَنَّ لِي رِجَالًا يَنْصَحُونَ لِلَّهِ عَزَّ وَ جَلَّ وَ لِرَسُولِهِ بِعَدَدِ هَذِهِ الشِّيَاهِ لَأَزَلْتُ ابْنَ آكِلَةِ الذِّبَّانِ عَنْ مُلْكِهِ",
          "قَالَ فَلَمَّا أَمْسَى بَايَعَهُ ثَلَاثُمِائَةٍ وَ سِتُّونَ رَجُلًا عَلَى الْمَوْتِ فَقَالَ لَهُمْ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) اغْدُوا بِنَا إِلَى أَحْجَارِ الزَّيْتِ مُحَلِّقِينَ وَ حَلَقَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَمَا وَافَى مِنَ الْقَوْمِ مُحَلِّقاً إِلَّا أَبُو ذَرٍّ وَ الْمِقْدَادُ وَ حُذَيْفَةُ بْنُ الْيَمَانِ وَ عَمَّارُ بْنُ يَاسِرٍ وَ جَاءَ سَلْمَانُ فِي آخِرِ الْقَوْمِ",
          "فَرَفَعَ يَدَهُ إِلَى السَّمَاءِ فَقَالَ اللَّهُمَّ إِنَّ الْقَوْمَ اسْتَضْعَفُونِي كَمَا اسْتَضْعَفَتْ بَنُو إِسْرَائِيلَ هَارُونَ اللَّهُمَّ فَإِنَّكَ تَعْلَمُ مَا نُخْفِي وَ مَا نُعْلِنُ وَ مَا يَخْفَى عَلَيْكَ شَيْ‏ءٌ فِي الْأَرْضِ وَ لَا فِي السَّمَاءِ تَوَفَّنِي مُسْلِماً وَ أَلْحِقْنِي بِالصَّالِحِينَ",
          "أَمَا وَ الْبَيْتِ وَ الْمُفْضِي إِلَى الْبَيْتِ [وَ فِي نُسْخَةٍ وَ الْمُزْدَلِفَةِ] وَ الْخِفَافِ إِلَى التَّجْمِيرِ لَوْ لَا عَهْدٌ عَهِدَهُ إِلَيَّ النَّبِيُّ الْأُمِّيُّ ( صلى الله عليه وآله ) لَأَوْرَدْتُ الْمُخَالِفِينَ خَلِيجَ الْمَنِيَّةِ وَ لَأَرْسَلْتُ عَلَيْهِمْ شَآبِيبَ صَوَاعِقِ الْمَوْتِ وَ عَنْ قَلِيلٍ سَيَعْلَمُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473094\">H 14453</a> – Muhammad Bin Ali Bin Ma’mar, from Muhammad Bin Ali, from Abdullah Bin Ayyub Al-Ash’ary, from Amro Al-Awza’iy, from Amro Bin Shimr, from Salma Biin Kuheyl, from Abu Al-Haysam Bin Al-Tayhaan who has narrated:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>mir-ul-Momineen</span><sup>asws</sup> gave a sermon to the people at Al-Medina.",
            "Amir-ul-Momineen<sup>asws</sup> said: ‘All Praise is due to Allah<sup>azwj</sup> besides Whom<sup>azwj</sup> there is no god but Him <sup>azwj</sup>. He<sup>azwj</sup> was Alive without (dependence on) any quality and without reliance on anything but on Himself<sup>azwj</sup> to exist nor can there be ‘where’ for Him<sup>azwj</sup>, nor He<sup>azwj</sup> is within anything, nor He<sup>azwj</sup> is upon anything, nor there is a beginning place for Him<sup>azwj</sup>, and He <sup>azwj</sup> is not strong after having Created a thing, nor was He<sup>azwj</sup> weak before anything came into being, nor was He<sup>azwj</sup> lonely before He<sup>azwj</sup> Began anything, nor is there anything which Resembles Him<sup>azwj</sup>, nor was He<sup>azwj</sup> without a Kingdom before He<sup>azwj</sup> Created it, nor will He<sup>azwj</sup> be without it after it goes away. He<sup>azwj</sup> is a Living God without having a lifespan, and He<sup>azwj</sup> was the Owner before He<sup>azwj</sup> Created anything, and will be the Owner after having Creating the Universe.",
            "And there cannot be for Allah<sup>azwj</sup>, ‘How’ nor ‘Where’, and no Limit to be Recognised by, and nothing resembles Him<sup>azwj</sup>, and He<sup>azwj</sup> does not age due to the Duration of His<sup>azwj</sup> Remaining, nor does He<sup>azwj</sup> weaken due to being Alone, nor does He<sup>azwj</sup> get scared like His<sup>azwj</sup> creatures do due to something. But, He<sup>azwj</sup> is All Hearing without having ears, He<sup>azwj</sup> is All Seeing without having eyes, and He<sup>azwj</sup> is Almighty without deriving strength from His<sup>azwj</sup> creatures. The gaze of the lookers cannot perceive Him<sup>azwj</sup>, and the ears of the listeners cannot sense (hear) Him<sup>azwj</sup>.",
            "If He<sup>azwj</sup> Intends something, it would be without any consultation, or demonstration, or informing, or asking anyone about anything from His<sup>azwj</sup> creatures, of His<sup>azwj</sup> Intention. The vision cannot perceive Him<sup>azwj</sup>, but He<sup>azwj</sup> Sees all visions. And He<sup>azwj</sup> is the Kind, the Aware, and I<sup>asws</sup> testify that there is no god except Allah<sup>azwj</sup>, One, having no associates for Him<sup>azwj</sup>, and I<sup>asws</sup> testify that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant. He<sup>azwj</sup> Sent him<sup>asws</sup> with the Guidance, and the true Religion, to overcome all the religions even though the Polytheists may not like it. So he<sup>saww</sup> preached the Message, and I<sup>asws</sup> follow the evidence. ",
            "O you community which has been deceived, and understood the deception of the deceiver who deceived it, but still persisted upon what it recognised, and wandered randomly in its seduction. And the truth had been clarified but they still turned away from it, and the path was made clear but they still deviated from it. ",
            "But, by the One<sup>azwj</sup> Who Split the seed and stemmed life from it, had you sought the knowledge from its Mine, and drank the water with its sweetness, and kept the good in its place, and take the path which was clear, and approached the truth by its programme the way would have been set out for you, and the signs would have appeared to you, and Al-Islam would have been illuminated for you. So you would have eaten plentiful, and there would have been no breadwinner among you who would have failed (to earn), nor any injustice would have been done to any Muslim or allies. But, you walked upon the path of the darkness, so your world became dark for you by its vastness. And the doors of knowledge were closed to you so you spoke from your own desires, and differed in your Religion, and started issuing verdicts (<span class=\"iTxt\">Fatwas</span>) in the Religion of Allah<sup>azwj</sup> without (being Blessed with the) Knowledge. ",
            "And you followed the misguided people so they misguided you, and you abandoned the Imams<sup>asws</sup> so they<sup>asws</sup> abandoned you. So you took control (of your own affairs) through judging by your own desires. When a matter was mentioned, you asked the People<sup>asws</sup> of the Remembrance (<span class=\"iTxt\">Ahl Al-Zikr</span>), so when they<sup>asws</sup> issued a verdict (Fatwa) to you, you said, ‘This is exactly the knowledge’. So how come you have abandoned him<sup>asws</sup>, and neglected him<sup>asws</sup>, and opposed him<sup>asws</sup>? Slowly (but surely), just wait a little while, and you will harvest all of what you have cultivated, and you will find the evil of what you have done and sought.  ",
            "By the One<sup>azwj</sup> Who Split the seed and stemmed life from it, you knew that I<sup>asws</sup> was your Master and the one<sup>asws</sup> whom you had been Commanded (for being obedient to), and I<sup>asws</sup> am more knowledgeable than you all and the one<sup>asws</sup> by whose knowledge was your salvation, and the successor<sup>asws</sup> of your Prophet<sup>saww</sup>, and the best of your Lord<sup>azwj</sup>, and the tongue (speaker) for your light (guidance), and the knowledge by which you can correct yourselves.",
            "So slowly (but surely) what has been narrated will descend upon you all, what has been promised, that which descended upon the communities before you. And Allah<sup>azwj</sup> Mighty and Majestic will Question you all about your Imams<sup>asws</sup> with whom<sup>asws</sup> you will be raised, and to Allah<sup>azwj</sup> Mighty and Majestic you will be going to tomorrow. ",
            "But, by Allah<sup>azwj</sup>, if I<sup>asws</sup> had for me<sup>asws</sup>, the number of companions which Talut had, or the number of the people at Badr who oppose your enemies, I<sup>asws</sup> would have struck by the sword until you would have come to the truth, and you would have repented sincerely. So that would have been more suitable than mending the rifts and taking to friendliness. Our Allah<sup>azwj</sup>, Judge between us with the truth, and You<sup>azwj</sup> are the Best of the Judges’. ",
            "He (the narrator) said, ‘Then he<sup>asws</sup> went out from the Masjid. He<sup>asws</sup> passed by a herd in which were around thirty sheep, so he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>, if I<sup>asws</sup> had for me<sup>asws</sup> for the sake of Allah<sup>azwj</sup> and His<sup>azwj</sup> Messenger<sup>saww</sup>, the number of these sheep, I<sup>asws</sup> would have removed the son of the woman who ate unhealthy things, from his kingdom’. ",
            "He (the narrator) said, ‘When it was evening, three hundred and sixty men had pledged allegiance to him<sup>a</sup><sup>sws</sup>, to the death. So Amir-ul-Momineen<sup>asws</sup> said to them: ‘Come to us (in the morning) to the <span class=\"iTxt\">Ahjaar Al-Zayt</span> having shaved (your heads)’. And Amir-ul-Momineen<sup>asws</sup> shaved (his<sup>asws</sup> head). No one from the people remained loyal, except for Abu Dharr<sup>ar</sup>, and Al-Miqdad<sup>ar</sup>, and Huzayfa Al-Yamani<sup>ar</sup>, and Ammar Bin Yasser<sup>ar</sup>, and Salman<sup>ar</sup>.",
            "So he<sup>asws</sup> raised his<sup>asws</sup> hands towards the sky and said: ‘Our Allah<sup>azwj</sup>! The people have weakened me<sup>asws</sup> just as the Children of Israel had weakened Haroun<sup>as</sup>. Our Allah<sup>azwj</sup>! You<sup>azwj</sup> Know what we hide and what we proclaim, and there is nothing which is hidden from You<sup>azwj</sup> in the earth, nor in the sky. Make me to pass away as a Muslim, and Associate me<sup>asws</sup> with the righteous ones’.",
            "But, by the House (Kaaba), and the Leading up to the House (and in another copy, ‘Al-Muzdalifa’), and the walking to the throwing of the pebbles, had it not been for the oath which the Ummy<a id=\"_ftnref6\"></a><sup>[6]</sup> Prophet<sup>saww</sup> had taken from me<sup>asws</sup>, I<sup>asws</sup> would have returned the opposition to the gulf of the death, and I<sup>asws</sup> would have sent upon them thunderbolts of the death, and after a little while they will come to know’. "
          ],
          "en.sarwar": [
            "5. Muhammad Bin Ali Bin Ma’mar, from Muhammad Bin Ali, from Abdullah Bin Ayyub Al-Ash’ary, from Amro Al-Awza’iy, from Amro Bin Shimr, from Salma Biin Kuheyl, from Abu Al-Haysam Bin Al-Tayhaan who has narrated: Amir-ul-Momineen (a.s.) gave a sermon to the people at Al-Medina. Amir-ul-Momineen (a.s.) said: ‘All Praise is due to Allah (azwj) besides Whom (azwj) there is no god but Him (azwj). He (azwj) was Alive without (dependence on) any quality and without reliance on anything but on Himself (azwj) to exist nor can there be ‘where’ for Him (azwj), nor He (azwj) is within anything, nor He (azwj) is upon anything, nor there is a beginning place for Him (azwj), and He (azwj) is not strong after having Created a thing, nor was He (azwj) weak before anything came into being, nor was He (azwj) lonely before He (azwj) Began anything, nor is there anything which Resembles Him (azwj), nor was He (azwj) without a Kingdom before He (azwj) Created it, nor will He (azwj) be without it after it goes away. He (azwj) is a Living God without having a lifespan, and He (azwj) was the Owner before He (azwj) Created anything, and will be the Owner after having Creating the Universe. And there cannot be for Allah (azwj), ‘How’ nor ‘Where’, and no Limit to be Recognised by, and nothing resembles Him (azwj), and He (azwj) does not age due to the Duration of His (azwj) Remaining, nor does He (azwj) weaken due to being Alone, nor does He (azwj) get scared like His (azwj) creatures do due to something. But, He (azwj) is All Hearing without having ears, He (azwj) is All Seeing without having eyes, and He (azwj) is Almighty without deriving strength from His (azwj) creatures. The gaze of the lookers cannot perceive Him (azwj), and the ears of the listeners cannot sense (hear) Him (azwj). If He (azwj) Intends something, it would be without any consultation, or demonstration, or informing, or asking anyone about anything from His (azwj) creatures, of His (azwj) Intention. The vision cannot perceive Him (azwj), but He (azwj) Sees all visions. And He (azwj) is the Kind, the Aware, and I (a.s.) testify that there is no god except Allah (azwj), One, having no associates for Him (azwj), and I (a.s.) testify that Muhammad (saww) is His (azwj) servant. He (azwj) Sent him (a.s.) with the Guidance, and the true Religion, to overcome all the religions even though the Polytheists may not like it. So he (saww) preached the Message, and I (a.s.) follow the evidence. O you community which has been deceived, and understood the deception of the deceiver who deceived it, but still persisted upon what it recognised, and wandered randomly in its seduction. And the truth had been clarified but they still turned away from it, and the path was made clear but they still deviated from it. But, by the One (azwj) Who Split the seed and stemmed life from it, had you sought the knowledge from its Mine, and drank the water with its sweetness, and kept the good in its place, and take the path which was clear, and approached the truth by its programme the way would have been set out for you, and the signs would have appeared to you, and Al-Islam would have been illuminated for you. So you would have eaten plentiful, and there would have been no breadwinner among you who would have failed (to earn), nor any injustice would have been done to any Muslim or allies. But, you walked upon the path of the darkness, so your world became dark for you by its vastness. And the doors of knowledge were closed to you so you spoke from your own desires, and differed in your Religion, and started issuing verdicts (Fatwas) in the Religion of Allah (azwj) without (being Blessed with the) Knowledge. And you followed the misguided people so they misguided you, and you abandoned the Imams (a.s.) so they (a.s.) abandoned you. So you took control (of your own affairs) through judging by your own desires. When a matter was mentioned, you asked the People (a.s.) of the Remembrance (Ahl Al-Zikr), so when they (a.s.) issued a verdict (Fatwa) to you, you said, ‘This is exactly the knowledge’. So how come you have abandoned him (a.s.), and neglected him (a.s.), and opposed him (a.s.)? Slowly (but surely), just wait a little while, and you will harvest all of what you have cultivated, and you will find the evil of what you have done and sought. By the One (azwj) Who Split the seed and stemmed life from it, you knew that I (a.s.) was your Master and the one (a.s.) whom you had been Commanded (for being obedient to), and I (a.s.) am more knowledgeable than you all and the one (a.s.) by whose knowledge was your salvation, and the successor (a.s.) of your Prophet (saww), and the best of your Lord (azwj), and the tongue (speaker) for your light (guidance), and the knowledge by which you can correct yourselves. So slowly (but surely) what has been narrated will descend upon you all, what has been promised, that which descended upon the communities before you. And Allah (azwj) Mighty and Majestic will Question you all about your Imams (a.s.) with whom (a.s.) you will be raised, and to Allah (azwj) Mighty and Majestic you will be going to tomorrow. But, by Allah (azwj), if I (a.s.) had for me (a.s.), the number of companions which Talut had, or the number of the people at Badr who oppose your enemies, I (a.s.) would have struck by the sword until you would have come to the truth, and you would have repented sincerely. So that would have been more suitable than mending the rifts and taking to friendliness. Our Allah (azwj), Judge between us with the truth, and You (azwj) are the Best of the Judges’. He (the narrator) said, ‘Then he (a.s.) went out from the Masjid. He (a.s.) passed by a herd in which were around thirty sheep, so he (a.s.) said: ‘By Allah (azwj), if I (a.s.) had for me (a.s.) for the sake of Allah (azwj) and His (azwj) Messenger (saww), the number of these sheep, I (a.s.) would have removed the son of the woman who ate unhealthy things, from his kingdom’. He (the narrator) said, ‘When it was evening, three hundred and sixty men had pledged allegiance to him (a.s.), to the death. So Amir-ul-Momineen (a.s.) said to them: ‘Come to us (in the morning) to the Ahjaar Al-Zayt having shaved (your heads)’. And Amir-ul-Momineen (a.s.) shaved (his (a.s.) head). No one from the people remained loyal, except for Abu Dharr (ar), and Al-Miqdad (ar), and Huzayfa Al-Yamani (ar), and Ammar Bin Yasser (ar), and Salman (ar). So he (a.s.) raised his (a.s.) hands towards the sky and said: ‘Our Allah (azwj)! The people have weakened me (a.s.) just as the Children of Israel had weakened Haroun (as). Our Allah (azwj)! You (azwj) Know what we hide and what we proclaim, and there is nothing which is hidden from You (azwj) in the earth, nor in the sky. Make me to pass away as a Muslim, and Associate me (a.s.) with the righteous ones’. But, by the House (Kaaba), and the Leading up to the House (and in another copy, ‘Al-Muzdalifa’), and the walking to the throwing of the pebbles, had it not been for the oath which the Ummy Prophet (saww) had taken from me (a.s.), I (a.s.) would have returned the opposition to the gulf of the death, and I (a.s.) would have sent upon them thunderbolts of the death, and after a little while they will come to know’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5  / 78)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14690,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:4:2",
        "refs": {
          "Mentions": [
            "/books/quran:39:9",
            "/books/quran:39:53",
            "/books/quran:44:42",
            "/books/quran:44:41",
            "/books/quran:33:23",
            "/books/quran:17:65",
            "/books/quran:4:69",
            "/books/quran:38:63",
            "/books/quran:43:67",
            "/books/quran:38:62",
            "/books/quran:40:7",
            "/books/quran:7:102",
            "/books/quran:15:47"
          ]
        },
        "text": [
          "14454-  عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ أَبِيهِ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِذْ دَخَلَ عَلَيْهِ أَبُو بَصِيرٍ وَ قَدْ خَفَرَهُ النَّفَسُ فَلَمَّا أَخَذَ مَجْلِسَهُ قَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا أَبَا مُحَمَّدٍ مَا هَذَا النَّفَسُ الْعَالِي فَقَالَ جُعِلْتُ فِدَاكَ يَا ابْنَ رَسُولِ اللَّهِ كَبِرَ سِنِّي وَ دَقَّ عَظْمِي وَ اقْتَرَبَ أَجَلِي مَعَ أَنَّنِي لَسْتُ أَدْرِي مَا أَرِدُ عَلَيْهِ مِنْ أَمْرِ آخِرَتِي",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا أَبَا مُحَمَّدٍ وَ إِنَّكَ لَتَقُولُ هَذَا قَالَ جُعِلْتُ فِدَاكَ وَ كَيْفَ لَا أَقُولُ هَذَا فَقَالَ يَا أَبَا مُحَمَّدٍ أَ مَا عَلِمْتَ أَنَّ اللَّهَ تَعَالَى يُكْرِمُ الشَّبَابَ مِنْكُمْ وَ يَسْتَحْيِي مِنَ الْكُهُولِ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ فَكَيْفَ يُكْرِمُ الشَّبَابَ وَ يَسْتَحْيِي مِنَ الْكُهُولِ فَقَالَ يُكْرِمُ اللَّهُ الشَّبَابَ أَنْ يُعَذِّبَهُمْ وَ يَسْتَحْيِي مِنَ الْكُهُولِ أَنْ يُحَاسِبَهُمْ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ هَذَا لَنَا خَاصَّةً أَمْ لِأَهْلِ التَّوْحِيدِ قَالَ فَقَالَ لَا وَ اللَّهِ إِلَّا لَكُمْ خَاصَّةً دُونَ الْعَالَمِ",
          "قَالَ قُلْتُ جُعِلْتُ فِدَاكَ فَإِنَّا قَدْ نُبِزْنَا نَبْزاً انْكَسَرَتْ لَهُ ظُهُورُنَا وَ مَاتَتْ لَهُ أَفْئِدَتُنَا وَ اسْتَحَلَّتْ لَهُ الْوُلَاةُ دِمَاءَنَا فِي حَدِيثٍ رَوَاهُ لَهُمْ فُقَهَاؤُهُمْ قَالَ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) الرَّافِضَةُ قَالَ قُلْتُ نَعَمْ قَالَ لَا وَ اللَّهِ مَا هُمْ سَمَّوْكُمْ وَ لَكِنَّ اللَّهَ سَمَّاكُمْ بِهِ",
          "أَ مَا عَلِمْتَ يَا أَبَا مُحَمَّدٍ أَنَّ سَبْعِينَ رَجُلًا مِنْ بَنِي إِسْرَائِيلَ رَفَضُوا فِرْعَوْنَ وَ قَوْمَهُ لَمَّا اسْتَبَانَ لَهُمْ ضَلَالُهُمْ فَلَحِقُوا بِمُوسَى (عليه السلام) لَمَّا اسْتَبَانَ لَهُمْ هُدَاهُ فَسُمُّوا فِي عَسْكَرِ مُوسَى الرَّافِضَةَ لِأَنَّهُمْ رَفَضُوا فِرْعَوْنَ وَ كَانُوا أَشَدَّ أَهْلِ ذَلِكَ الْعَسْكَرِ عِبَادَةً وَ أَشَدَّهُمْ حُبّاً لِمُوسَى وَ هَارُونَ وَ ذُرِّيَّتِهِمَا ( عليهما السلام ) ",
          "فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى مُوسَى ( عليه السلام ) أَنْ أَثْبِتْ لَهُمْ هَذَا الِاسْمَ فِي التَّوْرَاةِ فَإِنِّي قَدْ سَمَّيْتُهُمْ بِهِ وَ نَحَلْتُهُمْ إِيَّاهُ فَأَثْبَتَ مُوسَى ( عليه السلام ) الِاسْمَ لَهُمْ ثُمَّ ذَخَرَ اللَّهُ عَزَّ وَ جَلَّ لَكُمْ هَذَا الِاسْمَ حَتَّى نَحَلَكُمُوهُ",
          "يَا أَبَا مُحَمَّدٍ رَفَضُوا الْخَيْرَ وَ رَفَضْتُمُ الشَّرَّ افْتَرَقَ النَّاسُ كُلَّ فِرْقَةٍ وَ تَشَعَّبُوا كُلَّ شُعْبَةٍ فَانْشَعَبْتُمْ مَعَ أَهْلِ بَيْتِ نَبِيِّكُمْ ( صلى الله عليه وآله ) وَ ذَهَبْتُمْ حَيْثُ ذَهَبُوا وَ اخْتَرْتُمْ مَنِ اخْتَارَ اللَّهُ لَكُمْ وَ أَرَدْتُمْ مَنْ أَرَادَ اللَّهُ فَأَبْشِرُوا ثُمَّ أَبْشِرُوا فَأَنْتُمْ وَ اللَّهِ الْمَرْحُومُونَ الْمُتَقَبَّلُ مِنْ مُحْسِنِكُمْ وَ الْمُتَجَاوَزُ عَنْ مُسِيئِكُمْ مَنْ لَمْ يَأْتِ اللَّهَ عَزَّ وَ جَلَّ بِمَا أَنْتُمْ عَلَيْهِ يَوْمَ الْقِيَامَةِ لَمْ يُتَقَبَّلْ مِنْهُ حَسَنَةٌ وَ لَمْ يُتَجَاوَزْ لَهُ عَنْ سَيِّئَةٍ يَا أَبَا مُحَمَّدٍ فَهَلْ سَرَرْتُكَ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ زِدْنِي",
          "فَقَالَ يَا أَبَا مُحَمَّدٍ إِنَّ لِلَّهِ عَزَّ وَ جَلَّ مَلَائِكَةً يُسْقِطُونَ الذُّنُوبَ عَنْ ظُهُورِ شِيعَتِنَا كَمَا يُسْقِطُ الرِّيحُ الْوَرَقَ فِي أَوَانِ سُقُوطِهِ وَ ذَلِكَ قَوْلُهُ عَزَّ وَ جَلَّ الَّذِينَ يَحْمِلُونَ الْعَرْشَ وَ مَنْ حَوْلَهُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَ يَسْتَغْفِرُونَ لِلَّذِينَ آمَنُوا اسْتِغْفَارُهُمْ وَ اللَّهِ لَكُمْ دُونَ هَذَا الْخَلْقِ يَا أَبَا مُحَمَّدٍ فَهَلْ سَرَرْتُكَ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ زِدْنِي",
          "قَالَ يَا أَبَا مُحَمَّدٍ لَقَدْ ذَكَرَكُمُ اللَّهُ فِي كِتَابِهِ فَقَالَ مِنَ الْمُؤْمِنِينَ رِجالٌ صَدَقُوا ما عاهَدُوا اللَّهَ عَلَيْهِ فَمِنْهُمْ مَنْ قَضى نَحْبَهُ وَ مِنْهُمْ مَنْ يَنْتَظِرُ وَ ما بَدَّلُوا تَبْدِيلًا ",
          "إِنَّكُمْ وَفَيْتُمْ بِمَا أَخَذَ اللَّهُ عَلَيْهِ مِيثَاقَكُمْ مِنْ وَلَايَتِنَا وَ إِنَّكُمْ لَمْ تُبَدِّلُوا بِنَا غَيْرَنَا وَ لَوْ لَمْ تَفْعَلُوا لَعَيَّرَكُمُ اللَّهُ كَمَا عَيَّرَهُمْ حَيْثُ يَقُولُ جَلَّ ذِكْرُهُ وَ ما وَجَدْنا لِأَكْثَرِهِمْ مِنْ عَهْدٍ وَ إِنْ وَجَدْنا أَكْثَرَهُمْ لَفاسِقِينَ يَا أَبَا مُحَمَّدٍ فَهَلْ سَرَرْتُكَ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ زِدْنِي ",
          "فَقَالَ يَا أَبَا مُحَمَّدٍ لَقَدْ ذَكَرَكُمُ اللَّهُ فِي كِتَابِهِ فَقَالَ إِخْواناً عَلى سُرُرٍ مُتَقابِلِينَ وَ اللَّهِ مَا أَرَادَ بِهَذَا غَيْرَكُمْ يَا أَبَا مُحَمَّدٍ فَهَلْ سَرَرْتُكَ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ زِدْنِي",
          "فَقَالَ يَا أَبَا مُحَمَّدٍ الْأَخِلَّاءُ يَوْمَئِذٍ بَعْضُهُمْ لِبَعْضٍ عَدُوٌّ إِلَّا الْمُتَّقِينَ وَ اللَّهِ مَا أَرَادَ بِهَذَا غَيْرَكُمْ يَا أَبَا مُحَمَّدٍ فَهَلْ سَرَرْتُكَ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ زِدْنِي",
          "فَقَالَ يَا أَبَا مُحَمَّدٍ لَقَدْ ذَكَرَنَا اللَّهُ عَزَّ وَ جَلَّ وَ شِيعَتَنَا وَ عَدُوَّنَا فِي آيَةٍ مِنْ كِتَابِهِ فَقَالَ عَزَّ وَ جَلَّ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَ الَّذِينَ لا يَعْلَمُونَ إِنَّما يَتَذَكَّرُ أُولُوا الْأَلْبابِ فَنَحْنُ الَّذِينَ يَعْلَمُونَ وَ عَدُوُّنَا الَّذِينَ لَا يَعْلَمُونَ وَ شِيعَتُنَا هُمْ أُولُو الْأَلْبَابِ يَا أَبَا مُحَمَّدٍ فَهَلْ سَرَرْتُكَ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ زِدْنِي",
          "فَقَالَ يَا أَبَا مُحَمَّدٍ وَ اللَّهِ مَا اسْتَثْنَى اللَّهُ عَزَّ وَ جَلَّ بِأَحَدٍ مِنْ أَوْصِيَاءِ الْأَنْبِيَاءِ وَ لَا أَتْبَاعِهِمْ مَا خَلَا أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) وَ شِيعَتَهُ فَقَالَ فِي كِتَابِهِ وَ قَوْلُهُ الْحَقُّ يَوْمَ لا يُغْنِي مَوْلًى عَنْ مَوْلًى شَيْئاً وَ لا هُمْ يُنْصَرُونَ إِلَّا مَنْ رَحِمَ اللَّهُ يَعْنِي بِذَلِكَ عَلِيّاً ( عليه السلام ) وَ شِيعَتَهُ يَا أَبَا مُحَمَّدٍ فَهَلْ سَرَرْتُكَ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ زِدْنِي",
          "قَالَ يَا أَبَا مُحَمَّدٍ لَقَدْ ذَكَرَكُمُ اللَّهُ تَعَالَى فِي كِتَابِهِ إِذْ يَقُولُ يا عِبادِيَ الَّذِينَ أَسْرَفُوا عَلى أَنْفُسِهِمْ لا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعاً إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ وَ اللَّهِ مَا أَرَادَ بِهَذَا غَيْرَكُمْ فَهَلْ سَرَرْتُكَ يَا أَبَا مُحَمَّدٍ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ زِدْنِي",
          "فَقَالَ يَا أَبَا مُحَمَّدٍ لَقَدْ ذَكَرَكُمُ اللَّهُ فِي كِتَابِهِ فَقَالَ إِنَّ عِبادِي لَيْسَ لَكَ عَلَيْهِمْ سُلْطانٌ وَ اللَّهِ مَا أَرَادَ بِهَذَا إِلَّا الْأَئِمَّةَ ( عليهم السلام ) وَ شِيعَتَهُمْ فَهَلْ سَرَرْتُكَ يَا أَبَا مُحَمَّدٍ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ زِدْنِي",
          "فَقَالَ يَا أَبَا مُحَمَّدٍ لَقَدْ ذَكَرَكُمُ اللَّهُ فِي كِتَابِهِ فَقَالَ فَأُولئِكَ مَعَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِمْ مِنَ النَّبِيِّينَ وَ الصِّدِّيقِينَ وَ الشُّهَداءِ وَ الصَّالِحِينَ وَ حَسُنَ أُولئِكَ رَفِيقاً فَرَسُولُ اللَّهِ ( صلى الله عليه وآله ) فِي الْآيَةِ النَّبِيُّونَ وَ نَحْنُ فِي هَذَا الْمَوْضِعِ الصِّدِّيقُونَ وَ الشُّهَدَاءُ وَ أَنْتُمُ الصَّالِحُونَ فَتَسَمَّوْا بِالصَّلَاحِ كَمَا سَمَّاكُمُ اللَّهُ عَزَّ وَ جَلَّ يَا أَبَا مُحَمَّدٍ فَهَلْ سَرَرْتُكَ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ زِدْنِي",
          "قَالَ يَا أَبَا مُحَمَّدٍ لَقَدْ ذَكَرَكُمُ اللَّهُ إِذْ حَكَى عَنْ عَدُوِّكُمْ فِي النَّارِ بِقَوْلِهِ وَ قالُوا ما لَنا لا نَرى رِجالًا كُنَّا نَعُدُّهُمْ مِنَ الْأَشْرارِ أَتَّخَذْناهُمْ سِخْرِيًّا أَمْ زاغَتْ عَنْهُمُ الْأَبْصارُ وَ اللَّهِ مَا عَنَى وَ لَا أَرَادَ بِهَذَا غَيْرَكُمْ صِرْتُمْ عِنْدَ أَهْلِ هَذَا الْعَالَمِ شِرَارَ النَّاسِ وَ أَنْتُمْ وَ اللَّهِ فِي الْجَنَّةِ تُحْبَرُونَ وَ فِي النَّارِ تُطْلَبُونَ يَا أَبَا مُحَمَّدٍ فَهَلْ سَرَرْتُكَ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ زِدْنِي",
          "قَالَ يَا أَبَا مُحَمَّدٍ مَا مِنْ آيَةٍ نَزَلَتْ تَقُودُ إِلَى الْجَنَّةِ وَ لَا تَذْكُرُ أَهْلَهَا بِخَيْرٍ إِلَّا وَ هِيَ فِينَا وَ فِي شِيعَتِنَا وَ مَا مِنْ آيَةٍ نَزَلَتْ تَذْكُرُ أَهْلَهَا بِشَرٍّ وَ لَا تَسُوقُ إِلَى النَّارِ إِلَّا وَ هِيَ فِي عَدُوِّنَا وَ مَنْ خَالَفَنَا فَهَلْ سَرَرْتُكَ يَا أَبَا مُحَمَّدٍ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ زِدْنِي",
          "فَقَالَ يَا أَبَا مُحَمَّدٍ لَيْسَ عَلَى مِلَّةِ إِبْرَاهِيمَ إِلَّا نَحْنُ وَ شِيعَتُنَا وَ سَائِرُ النَّاسِ مِنْ ذَلِكَ بُرَآءُ يَا أَبَا مُحَمَّدٍ فَهَلْ سَرَرْتُكَ وَ فِي رِوَايَةٍ أُخْرَى فَقَالَ حَسْبِي ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473095\">H 14454</a> – A number from our companions, from Sahl Bin Ziyad, from Muhammad Bin Suleyman, from his father who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> was in the presence</span> of Abu Abdullah<sup>asws</sup>, when Abu Baseer came up to him<sup>asws</sup>, and he was panting. So when he took his seat, Abu Abdullah<sup>asws</sup> said to him: ‘O Abu Muhammad, what is this heavy breathing for?’ He said, ‘May I be sacrificed for you<sup>asws</sup>, O son<sup>asws</sup> of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>, great is my age, and my bones are creaking, and my term (death) is approaching, besides that I do not know what will happen to me from the matters of the Hereafter’.",
            "Abu Abdullah<sup>asws</sup> said: ‘O Abu Muhammad, and you are saying this?’ He said, ‘May I be sacrificed for you<sup>asws</sup>, and how can I not say this?’ He<sup>saww</sup> said: ‘O Abu Muhammad, but do you know that Allah<sup>azwj</sup> the High has Honoured the young ones among you, and is Bashful towards the elderly?’ He said, ‘May I be sacrificed for you, so how has He<sup>azwj</sup> Honoured the young, and been Bashful towards the elderly?’ He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> has Honoured the young ones (too much) to Punish them, and is too Bashful towards the elderly to bring them to the Reckoning’. He said, ‘May I be sacrificed for you<sup>asws</sup>, is this especially for us, or for (all) the people of <span class=\"iTxt\">Tawheed</span> (Believe in the Unity of Allah<sup>azwj</sup>)?’ He<sup>asws</sup> said: ‘No, by Allah<sup>azwj</sup>, it is only for you (Shiites) especially, apart from the whole world’.",
            "He said, ‘May I be sacrificed for you<sup>asws</sup>, we are being named by a name which is breaking our backs, and killing our hearts, and our blood has been declared lawful to be shed in the Hadeeth which are being narrated to them from their scholars’. Abu Abdullah<sup>asws</sup> said: ‘Is it ‘<span class=\"iTxt\">Al-Rafiza</span>’ (the rejectors)?’ He said, ‘Yes’. He<sup>asws</sup> said: ‘No, by Allah<sup>azwj</sup>, they are not the ones who have named you as such, but it is Allah<sup>azwj</sup> Who has Named you all with it’.",
            "But, do you know, O Abu Muhammad that seventy men from the Children of Israel rejected the Pharaoh<sup>la</sup> and his people, when they detected his misguidance. So they attached themselves with Musa<sup>as</sup> when they detected his<sup>as</sup> guidance. So they were named (referred to) in the army of Musa<sup>as</sup> as <span class=\"iTxt\">Al-Rafiza</span> (The Rejectors) because they had rejected the Pharaoh<sup>la</sup>, and they were the most intense worshippers in that army, and very intense in their love for Musa<sup>as</sup> and Haroun<sup>as</sup> and their<sup>as</sup> offspring. ",
            "So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto Musa<sup>as</sup> that: “Establish this name for them in the Torah, for I<sup>azwj</sup> has Named them with it, and have Gifted it to them”. So Musa<sup>as</sup> established the name for them, then Allah<sup>azwj</sup> Mighty and Majestic Reserved this name for you all to the extent that we<sup>asws</sup> have gifted it to you.",
            "O Abu Muhammad, they rejected the good, and you have rejected the evil. All the people have separated into sects, and they all divided into branches. You have branched out with the People<sup>asws</sup> of the Household of your Prophet<sup>saww</sup>, and you did what they did, and you chose what Allah<sup>azwj</sup> had Chosen for you, and you wanted what Allah<sup>azwj</sup> wanted. So received glad tidings upon glad tidings, for By Allah<sup>azwj</sup>, you (Shiites) are ones with whom Allah<sup>azwj</sup> has been Merciful, the ones whose good deeds will be Accepted, and the sins being Overlooked. The one who does not come to Allah<sup>azwj</sup> Mighty and Majestic, with what you are upon, on the Day of Judgement, the good deeds will not be Accepted from him, nor will his sins be Overlooked. O Abu Muhammad, have I<sup>asws</sup> made you happy?’ He said, ‘May I be sacrificed for you<sup>asws</sup>, increase it for me’.",
            "He<sup>asws</sup> said: ‘O Abu Muhammad, Allah<sup>azwj</sup> Mighty and Majestic has Assigned Angels to cut-off the sins from the backs of our<sup>asws</sup> Shiites just like the leaves get cut-off in the autumn by the wind, and that is His<sup>azwj</sup> Statement, the Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:40#h7\">[40:7]</a> Those who bear the Throne and those around Him celebrate the praise of their Lord and believe in Him and ask protection for those who believe”</span>. By Allah<sup>azwj</sup>, their Seeking of Forgiveness is for you (Shiites) apart from the other creatures. O Abu Muhammad, have I<sup>asws</sup> made you happy?’ He said, ‘May I be sacrificed for you<sup>asws</sup>, increase it for me’.",
            "He<sup style=\"font-weight: normal\">asws</sup> said: ‘O Abu Muhammad, Allah<sup style=\"font-weight: normal\">azwj</sup> has Mentioned you (Shiites) in His<sup style=\"font-weight: normal\">azwj</sup> Book. He<sup style=\"font-weight: normal\">azwj</sup> said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:33#h23\">[33:23]</a> Of the believers are men who are true to the covenant which they made with Allah: so of them is he who accomplished his vow, and of them is he who yet waits, and they have not changed in the least”</span>",
            "You all have been loyal to the Covenant which Allah<sup>azwj</sup> has Taken from you, of our<sup>asws</sup> Wilayah, and you never exchanged us<sup>asws</sup> for others. Had you not done that, Allah<sup>azwj</sup> would have Reproached you just as He<sup>azwj</sup> Reproached them where He<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Remembrance, Said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:7#h102\">[7:102]</a> And We did not find in most of them any (faithfulness to) covenant, and We found most of them to be certainly transgressors”</span>. O Abu Muhammad, have I<sup>asws</sup> made you happy?’ He said, ‘May I be sacrificed for you<sup>asws</sup>, increase it for me’.",
            "He<sup>asws</sup> said: ‘O Abu Muhammad, Allah<sup>azwj</sup> has Mentioned you in His<sup>azwj</sup> Book: <span class=\"ibTxt\">“<a href=\"/#/books/quran:15#h47\">[15:47]</a> (they shall be) as brethren, on raised couches, face to face”</span>. And Allah<sup>azwj</sup> has not Intended by this other than you (Shiites), O Abu Muhammad. So, have I<sup>asws</sup> made you happy?’ He said, ‘May I be sacrificed for you<sup>asws</sup>, increase it for me’.",
            "He<sup>asws</sup>: ‘O Abu Muhammad, <span class=\"ibTxt\">“<a href=\"/#/books/quran:43#h67\">[43:67]</a> The friends shall on that day be enemies one to another, except those who guard (against evil)”</span>, and Allah<sup>azwj</sup> has not Intended by this other than you (Shiites). O Abu Muhammad, have I<sup>asws</sup> made you happy?’ He said, ‘May I be sacrificed for you<sup>asws</sup>, increase it for me’.",
            "He<sup>asws</sup> said: ‘O Abu Muhammad, Allah<sup>azwj</sup> Mighty and Majestic has Mentioned us<sup>a</sup><sup>sws</sup> and our<sup>asws</sup> Shiites, and our<sup>asws</sup> enemies in a Verse from His<sup>azwj</sup> Book. The Mighty and Majestic Said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:39#h9\">[39:9]</a> Are those who know equal with those who know not? But only men of understanding will pay heed”</span>. So we<sup>asws</sup> are the ones who know, and our<sup>asws</sup> enemies are the ones who do not know, and our<sup>asws</sup> Shiites are the men of understanding. O Abu Muhammad, so have I<sup>asws</sup> made you happy?’ He said, ‘May I be sacrificed for you, increase it for me’.",
            "So he<sup>asws</sup> said: ‘O Abu Muhammad, By Allah<sup>azwj</sup>, Allah<sup>azwj</sup> has not Made an Exception for anyone from the successors<sup>as</sup> of the Prophets<sup>as</sup> and their<sup>as</sup> followers except for Amir-ul-Momineen<sup>asws</sup> and his<sup>asws</sup> Shiites. So He<sup>azwj</sup> Said in His<sup>azwj</sup> Book, and His<sup>azwj</sup> Words are True: <span class=\"ibTxt\">“<a href=\"/#/books/quran:44#h41\">[44:41]</a> The day on which a friend shall not avail (his) friend aught, nor shall they be helped, <a href=\"/#/books/quran:44#h42\">[44:42]</a> Save those on whom Allah shall have mercy; surely He is the Mighty the Merciful”</span> Meaning by that Ali<sup>asws</sup> and his<sup>asws</sup> Shiites. O Abu Muhammad, have I<sup>asws</sup> made you happy?’ He said, ‘May I be sacrificed for you<sup>asws</sup>, increase it for me’.",
            "He<sup>asws</sup> said: ‘O Abu Muhammad, Allah<sup>azwj</sup> the High has Mentioned you all when He<sup>azwj</sup> Said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:39#h53\">[39:53]</a> Say: O my servants! who have acted extravagantly against their own souls, do not despair of the mercy of Allah; surely Allah forgives the faults altogether; surely He is the Forgiving the Merciful”</span>. And Allah<sup>azwj</sup> has not Intended by this other than you (Shiites). So, have I<sup>asws</sup> made you happy, O Abu Muhammad’ He said, ‘May I be sacrificed for you<sup>asws</sup>, increase it for me’.  ",
            "So he<sup>asws</sup> said: ‘O Abu Muhammad, Allah<sup>azwj</sup> has Mentioned you all in His<sup>azwj</sup> Book: <span class=\"ibTxt\">“<a href=\"/#/books/quran:17#h65\">[17:65]</a> Surely (as for) My servants, you have no authority over them; and your Lord is sufficient as a Protector”</span>. And Allah<sup>azwj</sup> has not Intended by this but the Imams<sup>asws</sup> and their<sup>asws</sup> Shiites. So, have I<sup>asws</sup> made you happy, O Abu Muhammad?’ He said, ‘May I be sacrificed for you<sup>asws</sup>, increase it for me’.",
            "So he<sup>asws</sup> said: ‘O Abu Muhammad, Allah<sup>azwj</sup> has Mentioned you all in His<sup>azwj</sup> Book. He<sup>azwj</sup> Said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:4#h69\">[4:69]</a> these are with those upon whom Allah has bestowed favours from among the prophets and the truthful and the martyrs and the righteous, and a goodly company are they!”</span> So the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> in the Verse is ‘from among the Prophets<sup>as</sup>’, and we<sup>asws</sup>, in this subject are the ‘truthful and the martyrs’, and you all are the ‘righteous’, therefore adopt this name by the righteousness as Allah<sup>azwj</sup> Mighty and Majestic has Named you. O Abu Muhammad, so, have I made you happy?’ He said, ‘May I be sacrificed for you<sup>asws</sup>, increase it for me’. ",
            "He<sup>asws</sup> said: ‘O Abu Muhammad, Allah<sup>azwj</sup> has Mentioned you all when He<sup>azwj</sup> Narrated about your enemies in the Fire by His<sup>azwj</sup> Statement: <span class=\"ibTxt\">“<a href=\"/#/books/quran:38#h62\">[38:62]</a> And they shall say: What is the matter with us that we do not see men whom we used to count among the vicious? <a href=\"/#/books/quran:38#h63\">[38:63]</a> Was it that we (only) took them in scorn, or have our eyes (now) turned aside from them?” </span>And Allah<sup>azwj</sup> has not Meant, and not Intended by this other than you (Shiites). You have become as the evil people in the eyes of this world, and by Allah<sup>azwj</sup>, you will be in the Paradise you will be in delight whereas in the Fire you will be sought. O Abu Muhammad, so have I<sup>asws</sup> made you happy?’ He said, ‘May I be sacrificed for you<sup>asws</sup>, increase it for me’.",
            "He<sup>asws</sup> said: ‘O Abu Muhammad, there is none from the Verses Revealed Which Guides to the Paradise, nor Mentions it addressees with goodness except that it is regarding us<sup>asws</sup> and regarding our<sup>asws</sup> Shiites. And there is none from the Verses Revealed Which Mentions its addressees with evil, or Points to the Fire except that it is regarding our<sup>asws</sup> enemies and the ones who are opposed to us<sup>asws</sup>. So, have I<sup>asws</sup> made you happy, O Abu Muhammad?’ He said, ‘May I be sacrificed for you<sup>asws</sup>, increase it for me’.",
            "So he<sup>asws</sup> said: ‘O Abu Muhammad, There is no one upon the Nation of Ibrahim<sup>as</sup> except for us<sup>asws</sup>, and our<sup>asws</sup> Shiites, whereas the rest of the people are remote from that. O Abu Muhammad, have I<sup>asws</sup> made you happy?’ And in another report, he<sup>asws</sup> said: ‘This is enough’."
          ],
          "en.sarwar": [
            "6. A number from our companions, from Sahl Bin Ziyad, from Muhammad Bin Suleyman, from his father who said: ‘I was in the presence of Abu Abdullah (a.s.), when Abu Baseer came up to him (a.s.), and he was panting. So when he took his seat, Abu Abdullah (a.s.) said to him: ‘O Abu Muhammad, what is this heavy breathing for?’ He said, ‘May I be sacrificed for you (a.s.), O son (a.s.) of the Messenger (saww) of Allah (azwj), great is my age, and my bones are creaking, and my term (death) is approaching, besides that I do not know what will happen to me from the matters of the Hereafter’. Abu Abdullah (a.s.) said: ‘O Abu Muhammad, and you are saying this?’ He said, ‘May I be sacrificed for you (a.s.), and how can I not say this?’ He (saww) said: ‘O Abu Muhammad, but do you know that Allah (azwj) the High has Honoured the young ones among you, and is Bashful towards the elderly?’ He said, ‘May I be sacrificed for you, so how has He (azwj) Honoured the young, and been Bashful towards the elderly?’ He (a.s.) said: ‘Allah (azwj) has Honoured the young ones (too much) to Punish them, and is too Bashful towards the elderly to bring them to the Reckoning’. He said, ‘May I be sacrificed for you (a.s.), is this especially for us, or for (all) the people of Tawheed (Believe in the Unity of Allah (azwj))?’ He (a.s.) said: ‘No, by Allah (azwj), it is only for you (Shiites) especially, apart from the whole world’. He said, ‘May I be sacrificed for you (a.s.), we are being named by a name which is breaking our backs, and killing our hearts, and our blood has been declared lawful to be shed in the Hadeeth which are being narrated to them from their scholars’. Abu Abdullah (a.s.) said: ‘Is it ‘Al-Rafiza’ (the rejectors)?’ He said, ‘Yes’. He (a.s.) said: ‘No, by Allah (azwj), they are not the ones who have named you as such, but it is Allah (azwj) Who has Named you all with it’. But, do you know, O Abu Muhammad that seventy men from the Children of Israel rejected the Pharaoh (la) and his people, when they detected his misguidance. So they attached themselves with Musa (as) when they detected his (as) guidance. So they were named (referred to) in the army of Musa (as) as Al-Rafiza (The Rejectors) because they had rejected the Pharaoh (la), and they were the most intense worshippers in that army, and very intense in their love for Musa (as) and Haroun (as) and their (as) offspring. So Allah (azwj) Mighty and Majestic Revealed unto Musa (as) that: “Establish this name for them in the Torah, for I (azwj) has Named them with it, and have Gifted it to them”. So Musa (as) established the name for them, then Allah (azwj) Mighty and Majestic Reserved this name for you all to the extent that we (a.s.) have gifted it to you. O Abu Muhammad, they rejected the good, and you have rejected the evil. All the people have separated into sects, and they all divided into branches. You have branched out with the People (a.s.) of the Household of your Prophet (saww), and you did what they did, and you chose what Allah (azwj) had Chosen for you, and you wanted what Allah (azwj) wanted. So received glad tidings upon glad tidings, for By Allah (azwj), you (Shiites) are ones with whom Allah (azwj) has been Merciful, the ones whose good deeds will be Accepted, and the sins being Overlooked. The one who does not come to Allah (azwj) Mighty and Majestic, with what you are upon, on the Day of Judgement, the good deeds will not be Accepted from him, nor will his sins be Overlooked. O Abu Muhammad, have I (a.s.) made you happy?’ He said, ‘May I be sacrificed for you (a.s.), increase it for me’. He (a.s.) said: ‘O Abu Muhammad, Allah (azwj) Mighty and Majestic has Assigned Angels to cut-off the sins from the backs of our (a.s.) Shiites just like the leaves get cut-off in the autumn by the wind, and that is His (azwj) Statement, the Mighty and Majestic: “<a href=\"/#/books/quran:40#h7\">[40:7]</a> Those who bear the Throne and those around Him celebrate the praise of their Lord and believe in Him and ask protection for those who believe”. By Allah (azwj), their Seeking of Forgiveness is for you (Shiites) apart from the other creatures. O Abu Muhammad, have I (a.s.) made you happy?’ He said, ‘May I be sacrificed for you (a.s.), increase it for me’. He (a.s.) said: ‘O Abu Muhammad, Allah (azwj) has Mentioned you (Shiites) in His (azwj) Book. He (azwj) said: “<a href=\"/#/books/quran:33#h23\">[33:23]</a> Of the believers are men who are true to the covenant which they made with Allah: so of them is he who accomplished his vow, and of them is he who yet waits, and they have not changed in the least” You all have been loyal to the Covenant which Allah (azwj) has Taken from you, of our (a.s.) Wilayah, and you never exchanged us (a.s.) for others. Had you not done that, Allah (azwj) would have Reproached you just as He (azwj) Reproached them where He (azwj), Majestic is His (azwj) Remembrance, Said: “<a href=\"/#/books/quran:7#h102\">[7:102]</a> And We did not find in most of them any (faithfulness to) covenant, and We found most of them to be certainly transgressors”. O Abu Muhammad, have I (a.s.) made you happy?’ He said, ‘May I be sacrificed for you (a.s.), increase it for me’. He (a.s.) said: ‘O Abu Muhammad, Allah (azwj) has Mentioned you in His (azwj) Book: “<a href=\"/#/books/quran:15#h47\">[15:47]</a> (they shall be) as brethren, on raised couches, face to face”. And Allah (azwj) has not Intended by this other than you (Shiites), O Abu Muhammad. So, have I (a.s.) made you happy?’ He said, ‘May I be sacrificed for you (a.s.), increase it for me’. He (a.s.): ‘O Abu Muhammad, “<a href=\"/#/books/quran:43#h67\">[43:67]</a> The friends shall on that day be enemies one to another, except those who guard (against evil)”, and Allah (azwj) has not Intended by this other than you (Shiites). O Abu Muhammad, have I (a.s.) made you happy?’ He said, ‘May I be sacrificed for you (a.s.), increase it for me’. He (a.s.) said: ‘O Abu Muhammad, Allah (azwj) Mighty and Majestic has Mentioned us (a.s.) and our (a.s.) Shiites, and our (a.s.) enemies in a Verse from His (azwj) Book. The Mighty and Majestic Said: “<a href=\"/#/books/quran:39#h9\">[39:9]</a> Are those who know equal with those who know not? But only men of understanding will pay heed”. So we (a.s.) are the ones who know, and our (a.s.) enemies are the ones who do not know, and our (a.s.) Shiites are the men of understanding. O Abu Muhammad, so have I (a.s.) made you happy?’ He said, ‘May I be sacrificed for you, increase it for me’. So he (a.s.) said: ‘O Abu Muhammad, By Allah (azwj), Allah (azwj) has not Made an Exception for anyone from the successors (as) of the Prophets (as) and their (as) followers except for Amir-ul-Momineen (a.s.) and his (a.s.) Shiites. So He (azwj) Said in His (azwj) Book, and His (azwj) Words are True: “<a href=\"/#/books/quran:44#h41\">[44:41]</a> The day on which a friend shall not avail (his) friend aught, nor shall they be helped, <a href=\"/#/books/quran:44#h42\">[44:42]</a> Save those on whom Allah shall have mercy; surely He is the Mighty the Merciful” Meaning by that Ali (a.s.) and his (a.s.) Shiites. O Abu Muhammad, have I (a.s.) made you happy?’ He said, ‘May I be sacrificed for you (a.s.), increase it for me’. He (a.s.) said: ‘O Abu Muhammad, Allah (azwj) the High has Mentioned you all when He (azwj) Said: “<a href=\"/#/books/quran:39#h53\">[39:53]</a> Say: O my servants! who have acted extravagantly against their own souls, do not despair of the mercy of Allah; surely Allah forgives the faults altogether; surely He is the Forgiving the Merciful”. And Allah (azwj) has not Intended by this other than you (Shiites). So, have I (a.s.) made you happy, O Abu Muhammad’ He said, ‘May I be sacrificed for you (a.s.), increase it for me’. So he (a.s.) said: ‘O Abu Muhammad, Allah (azwj) has Mentioned you all in His (azwj) Book: “<a href=\"/#/books/quran:17#h65\">[17:65]</a> Surely (as for) My servants, you have no authority over them; and your Lord is sufficient as a Protector”. And Allah (azwj) has not Intended by this but the Imams (a.s.) and their (a.s.) Shiites. So, have I (a.s.) made you happy, O Abu Muhammad?’ He said, ‘May I be sacrificed for you (a.s.), increase it for me’. So he (a.s.) said: ‘O Abu Muhammad, Allah (azwj) has Mentioned you all in His (azwj) Book. He (azwj) Said: “<a href=\"/#/books/quran:4#h69\">[4:69]</a> these are with those upon whom Allah has bestowed favours from among the prophets and the truthful and the martyrs and the righteous, and a goodly company are they!” So the Messenger (saww) of Allah (azwj) in the Verse is ‘from among the Prophets (as)’, and we (a.s.), in this subject are the ‘truthful and the martyrs’, and you all are the ‘righteous’, therefore adopt this name by the righteousness as Allah (azwj) Mighty and Majestic has Named you. O Abu Muhammad, so, have I made you happy?’ He said, ‘May I be sacrificed for you (a.s.), increase it for me’. He (a.s.) said: ‘O Abu Muhammad, Allah (azwj) has Mentioned you all when He (azwj) Narrated about your enemies in the Fire by His (azwj) Statement: “<a href=\"/#/books/quran:38#h62\">[38:62]</a> And they shall say: What is the matter with us that we do not see men whom we used to count among the vicious? <a href=\"/#/books/quran:38#h63\">[38:63]</a> Was it that we (only) took them in scorn, or have our eyes (now) turned aside from them?” And Allah (azwj) has not Meant, and not Intended by this other than you (Shiites). You have become as the evil people in the eyes of this world, and by Allah (azwj), you will be in the Paradise you will be in delight whereas in the Fire you will be sought. O Abu Muhammad, so have I (a.s.) made you happy?’ He said, ‘May I be sacrificed for you (a.s.), increase it for me’. He (a.s.) said: ‘O Abu Muhammad, there is none from the Verses Revealed Which Guides to the Paradise, nor Mentions it addressees with goodness except that it is regarding us (a.s.) and regarding our (a.s.) Shiites. And there is none from the Verses Revealed Which Mentions its addressees with evil, or Points to the Fire except that it is regarding our (a.s.) enemies and the ones who are opposed to us (a.s.). So, have I (a.s.) made you happy, O Abu Muhammad?’ He said, ‘May I be sacrificed for you (a.s.), increase it for me’. So he (a.s.) said: ‘O Abu Muhammad, There is no one upon the Nation of Ibrahim (as) except for us (a.s.), and our (a.s.) Shiites, whereas the rest of the people are remote from that. O Abu Muhammad, have I (a.s.) made you happy?’ And in another report, he (a.s.) said: ‘This is enough’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:4",
  "kind": "verse_list"
}