{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 40"
        },
        "path": "/books/al-kafi:8:1:40",
        "titles": {
          "ar": "حَدِيثُ الصَّيْحَةِ",
          "en": "HADEETH OF THE SCREAM"
        }
      }
    ],
    "index": 2311,
    "local_index": 40,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 41"
        },
        "path": "/books/al-kafi:8:1:41",
        "titles": {
          "ar": "حَدِيثُ يَأْجُوجَ وَ مَأْجُوجَ",
          "en": "HADEETH OF YAJOUJ (GOG) AND MAJOUJ (MAGOG)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 39"
        },
        "path": "/books/al-kafi:8:1:39",
        "titles": {
          "ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ (عليه السلام)",
          "en": "SERMON OF AMIR-UL-MOMINEEN<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:40",
    "titles": {
      "ar": "حَدِيثُ الصَّيْحَةِ",
      "en": "HADEETH OF THE SCREAM"
    },
    "verse_count": 19,
    "verse_start_index": 14938,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 128)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14939,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:40:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14703</span>- عَلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي نَجْرَانَ وَ غَيْرِهِ عَنْ إِسْمَاعِيلَ بْنِ الصَّبَّاحِ قَالَ سَمِعْتُ شَيْخاً يَذْكُرُ عَنْ سَيْفِ بْنِ عَمِيرَةَ قَالَ كُنْتُ عِنْدَ أَبِي الدَّوَانِيقِ فَسَمِعْتُهُ يَقُولُ ابْتِدَاءً مِنْ نَفْسِهِ يَا سَيْفَ بْنَ عَمِيرَةَ لَا بُدَّ مِنْ مُنَادٍ يُنَادِي بِاسْمِ رَجُلٍ مِنْ وُلْدِ أَبِي طَالِبٍ قُلْتُ يَرْوِيهِ أَحَدٌ مِنَ النَّاسِ قَالَ وَ الَّذِي نَفْسِي بِيَدِهِ لَسَمِعَتْ أُذُنِي مِنْهُ يَقُولُ لَا بُدَّ مِنْ مُنَادٍ يُنَادِي بِاسْمِ رَجُلٍ قُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّ هَذَا الْحَدِيثَ مَا سَمِعْتُ بِمِثْلِهِ قَطُّ فَقَالَ لِي يَا سَيْفُ إِذَا كَانَ ذَلِكَ فَنَحْنُ أَوَّلُ مَنْ يُجِيبُهُ أَمَا إِنَّهُ أَحَدُ بَنِي عَمِّنَا قُلْتُ أَيُّ بَنِي عَمِّكُمْ قَالَ رَجُلٌ مِنْ وُلْدِ فَاطِمَةَ (عليها السلام) ثُمَّ قَالَ يَا سَيْفُ لَوْ لَا أَنِّي سَمِعْتُ أَبَا جَعْفَرٍ مُحَمَّدَ بْنَ عَلِيٍّ يَقُولُهُ ثُمَّ حَدَّثَنِي بِهِ أَهْلُ الْأَرْضِ مَا قَبِلْتُهُ مِنْهُمْ وَ لَكِنَّهُ مُحَمَّدُ بْنُ عَلِيٍّ (عليه السلام)."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473381\">H 14703</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Najraan and someone else, from Ismail Bin Al-Sabbaah who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard an old man</span> mentioning from Saif bin Umair who said, ‘I was in the presence of Abu Al-dawaniq, so I heard him saying, initiating it himself, ‘O saif Bin Umair! It is necessary for a caller to call in the name of a man from the sons of Abu Talib<sup>as</sup>’. I said, ‘Does any one from the people report it?’ He said, ‘By the One<sup>azwj</sup> in Whose Hand is my soul, my own ears have heard it from him<sup>asws</sup> (Abu Jafar<sup>asws</sup>) saying: ‘It is a must that a caller calls out in the name of a man’. I said, ‘O commander of the faithful! As for this Hadith, I have not heard similar to it at all’. He said to me, ‘O Saif! If it was like, so we would be the first ones to respond to it. But rather he would be one of the sons of our uncle’. I said, ‘Which son of your uncle?’ He said, ‘A man from the children of Fatima<sup>asws</sup>’. ",
            "He then said, ‘O Saif! Had I not heard it from Abu Ja’far<sup>asws</sup> Muhammad Bin Ali<sup>asws</sup> saying it, however, if it were narrated to me by the inhabitants of the earth, I would not have accepted it from them, but it is from Muhammad Bin Ali<sup>asws</sup>’. "
          ],
          "en.sarwar": [
            "255. Ali Bin Ibrahim, from his father, from Ibn Abu Najraan and someone else, from Ismail Bin Al-Sabbaah who said: I heard an old man mentioning from Saif bin Umair who said, ‘I was in the presence of Abu Al-dawaniq, so I heard him saying, initiating it himself, ‘O saif Bin Umair! It is necessary for a caller to call in the name of a man from the sons of Abu Talib (as)’. I said, ‘Does any one from the people report it?’ He said, ‘By the One (azwj) in Whose Hand is my soul, my own ears have heard it from him (a.s.) (Abu Jafar (a.s.)) saying: ‘It is a must that a caller calls out in the name of a man’. I said, ‘O commander of the faithful! As for this Hadith, I have not heard similar to it at all’. He said to me, ‘O Saif! If it was like, so we would be the first ones to respond to it. But rather he would be one of the sons of our uncle’. I said, ‘Which son of your uncle?’ He said, ‘A man from the children of Fatima (a.s.)’. He then said, ‘O Saif! Had I not heard it from Abu Ja’far (a.s.) Muhammad Bin Ali (a.s.) saying it, however, if it were narrated to me by the inhabitants of the earth, I would not have accepted it from them, but it is from Muhammad Bin Ali (a.s.)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق على الظاهر</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 128)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14940,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:40:2",
        "text": [
          "14704- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ كُنْتُ مَعَ أَبِي جَعْفَرٍ (عليه السلام) جَالِساً فِي الْمَسْجِدِ إِذْ أَقْبَلَ دَاوُدُ بْنُ عَلِيٍّ وَ سُلَيْمَانُ بْنُ خَالِدٍ وَ أَبُو جَعْفَرٍ عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ أَبُو الدَّوَانِيقِ فَقَعَدُوا نَاحِيَةً مِنَ الْمَسْجِدِ فَقِيلَ لَهُمْ هَذَا مُحَمَّدُ بْنُ عَلِيٍّ جَالِسٌ فَقَامَ إِلَيْهِ دَاوُدُ بْنُ عَلِيٍّ وَ سُلَيْمَانُ بْنُ خَالِدٍ وَ قَعَدَ أَبُو الدَّوَانِيقِ مَكَانَهُ حَتَّى سَلَّمُوا عَلَى أَبِي جَعْفَرٍ (عليه السلام) فَقَالَ لَهُمْ أَبُو جَعْفَرٍ (عليه السلام) مَا مَنَعَ جَبَّارَكُمْ مِنْ أَنْ يَأْتِيَنِي فَعَذَّرُوهُ عِنْدَهُ ",
          "فَقَالَ عِنْدَ ذَلِكَ أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ عَلِيٍّ (عليه السلام) أَمَا وَ اللَّهِ لَا تَذْهَبُ اللَّيَالِي وَ الْأَيَّامُ حَتَّى يَمْلِكَ مَا بَيْنَ قُطْرَيْهَا ثُمَّ لَيَطَأَنَّ الرِّجَالُ عَقِبَهُ ثُمَّ لَتَذِلَّنَّ لَهُ رِقَابُ الرِّجَالِ ثُمَّ لَيَمْلِكَنَّ مُلْكاً شَدِيداً فَقَالَ لَهُ دَاوُدُ بْنُ عَلِيٍّ وَ إِنَّ مُلْكَنَا قَبْلَ مُلْكِكُمْ قَالَ نَعَمْ يَا دَاوُدُ إِنَّ مُلْكَكُمْ قَبْلَ مُلْكِنَا وَ سُلْطَانَكُمْ قَبْلَ سُلْطَانِنَا فَقَالَ لَهُ دَاوُدُ أَصْلَحَكَ اللَّهُ فَهَلْ لَهُ مِنْ مُدَّةٍ فَقَالَ نَعَمْ يَا دَاوُدُ وَ اللَّهِ لَا يَمْلِكُ بَنُو أُمَيَّةَ يَوْماً إِلَّا مَلَكْتُمْ مِثْلَيْهِ وَ لَا سَنَةً إِلَّا مَلَكْتُمْ مِثْلَيْهَا وَ لَيَتَلَقَّفُهَا الصِّبْيَانُ مِنْكُمْ كَمَا تَلَقَّفُ الصِّبْيَانُ الْكُرَةَ",
          "فَقَامَ دَاوُدُ بْنُ عَلِيٍّ مِنْ عِنْدِ أَبِي جَعْفَرٍ (عليه السلام) فَرِحاً يُرِيدُ أَنْ يُخْبِرَ أَبَا الدَّوَانِيقِ بِذَلِكَ فَلَمَّا نَهَضَا جَمِيعاً هُوَ وَ سُلَيْمَانُ بْنُ خَالِدٍ نَادَاهُ أَبُو جَعْفَرٍ (عليه السلام) مِنْ خَلْفِهِ يَا سُلَيْمَانَ بْنَ خَالِدٍ لَا يَزَالُ الْقَوْمُ فِي فُسْحَةٍ مِنْ مُلْكِهِمْ مَا لَمْ يُصِيبُوا مِنَّا دَماً حَرَاماً وَ أَوْمَأَ بِيَدِهِ إِلَى صَدْرِهِ فَإِذَا أَصَابُوا ذَلِكَ الدَّمَ فَبَطْنُ الْأَرْضِ خَيْرٌ لَهُمْ مِنْ ظَهْرِهَا فَيَوْمَئِذٍ لَا يَكُونُ لَهُمْ فِي الْأَرْضِ نَاصِرٌ وَ لَا فِي السَّمَاءِ عَاذِرٌ",
          "ثُمَّ انْطَلَقَ سُلَيْمَانُ بْنُ خَالِدٍ فَأَخْبَرَ أَبَا الدَّوَانِيقِ فَجَاءَ أَبُو الدَّوَانِيقِ إِلَى أَبِي جَعْفَرٍ (عليه السلام) فَسَلَّمَ عَلَيْهِ ثُمَّ أَخْبَرَهُ بِمَا قَالَ لَهُ دَاوُدُ بْنُ عَلِيٍّ وَ سُلَيْمَانُ بْنُ خَالِدٍ فَقَالَ لَهُ نَعَمْ يَا أَبَا جَعْفَرٍ دَوْلَتُكُمْ قَبْلَ دَوْلَتِنَا وَ سُلْطَانُكُمْ قَبْلَ سُلْطَانِنَا سُلْطَانُكُمْ شَدِيدٌ عَسِرٌ لَا يُسْرَ فِيهِ وَ لَهُ مُدَّةٌ طَوِيلَةٌ وَ اللَّهِ لَا يَمْلِكُ بَنُو أُمَيَّةَ يَوْماً إِلَّا مَلَكْتُمْ مِثْلَيْهِ وَ لَا سَنَةً إِلَّا مَلَكْتُمْ مِثْلَيْهَا وَ لَيَتَلَقَّفُهَا صِبْيَانٌ مِنْكُمْ فَضْلًا عَنْ رِجَالِكُمْ كَمَا يَتَلَقَّفُ الصِّبْيَانُ الْكُرَةَ أَ فَهِمْتَ",
          "ثُمَّ قَالَ لَا تَزَالُونَ فِي عُنْفُوَانِ الْمُلْكِ تَرْغُدُونَ فِيهِ مَا لَمْ تُصِيبُوا مِنَّا دَماً حَرَاماً فَإِذَا أَصَبْتُمْ ذَلِكَ الدَّمَ غَضِبَ اللَّهُ عَزَّ وَ جَلَّ عَلَيْكُمْ فَذَهَبَ بِمُلْكِكُمْ وَ سُلْطَانِكُمْ وَ ذَهَبَ بِرِيحِكُمْ وَ سَلَّطَ اللَّهُ عَزَّ وَ جَلَّ عَلَيْكُمْ عَبْداً مِنْ عَبِيدِهِ أَعْوَرَ وَ لَيْسَ بِأَعْوَرَ مِنْ آلِ أَبِي سُفْيَانَ يَكُونُ اسْتِيصَالُكُمْ عَلَى يَدَيْهِ وَ أَيْدِي أَصْحَابِهِ ثُمَّ قَطَعَ الْكَلَامَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473382\">H 14704</a> – Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Ali Bin Abu Hamza, from Abu Baseer who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> was seated with Abu</span> Ja’far<sup>asws</sup> when Dawood Bin Ali, and Suleyman Bin Khalid, and Abu Ja’far Abdullah Bin Muhammad Abu Al-Dawaniqy came over and sat down in an area of the Masjid. It was said to them, ‘This is Muhammad Bin Ali<sup>asws</sup> seated (over there)’. So Dawood Bin Ali, and Suleyman Bin Khalid stood up and came over, whilst Abu Al-Dawaniqy remained seated in his place, until they greeted to Abu Ja’far<sup>asws</sup>. So Abu Ja’far<sup>asws</sup> said to them: ‘What prevented your tyrant from coming to me<sup>asws</sup>?’ So they offered excuses on his behalf in his<sup>asws</sup> presence.",
            "So Abu Ja’far<sup>asws</sup> said with regards to that: ‘But, by Allah<sup>azwj</sup>, (not many) nights and days would go by before he rules over the two regions. Then the men from his offspring would strengthen it for whom would be the reins, then they would govern with a severe government’. So Dawood Bin Ali said to him<sup>asws</sup>, ‘And he will be ruling over us before your<sup>asws</sup> rule?’ He<sup>asws</sup> said: ‘Yes, O Dawood! He will rule over you before our<sup>asws</sup> kingdom, and have authority over you before our<sup>asws</sup> authority’.",
            "Dawood said to him<sup>asws</sup>, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well, is there a time frame for it?’ He<sup>asws</sup> said: ‘Yes, O Dawood. By Allah<sup>azwj</sup>, the Clan of Umayya will not rule for a day except that you will rule for twice as much, and will not rule for a year but you will rule for twice as much, and the children from among you would seize it just like children seize the ball’. ",
            "Dawood Bin Ali stood up from the presence of Abu Ja’far<sup>asws</sup> with joy, intending to inform Abu Al-Dawaniqy of that. So when both, him and Suleyman Bin Khalid arose, Abu Ja’far called them back (to him<sup>asws</sup>): ‘O Suleyman Bin Khalid! The people would not cease from having space from their reign if they do not shed the blood from us<sup>asws</sup> unlawfully’ – and he<sup>asws</sup> gestured by his<sup>asws</sup> hand to his<sup>asws</sup> chest. ‘So if they shed that blood, the inside of the earth would be better for them than its surface, for on that Day there would not be any helper for them in the earth, nor a Forgiver for them in the sky’.",
            "Then Suleyman Bin Khalid went and informed Abu Al-Dawaniqy. So Abu Al-Dawaniqy came over to Abu Ja’far<sup>asws</sup>. He greeted to him<sup>asws</sup>, then informed him<sup>asws</sup> of what Dawood bin Ali and Suleyman Bin Khalid had told him. So he<sup>asws</sup> said to him: ‘Yes, O Abu Ja’far! Your government is before our<sup>asws</sup> government, and your authority would be before our<sup>asws</sup> authority. Your authority would be extremely difficult and there would be no ease in it and would have a long duration for it. By Allah<sup>azwj</sup>! The Clan of Umayya will not rule for a day but you will (rule) for twice as much, nor for a year but you will rule for twice as much, and the children from among you would seize it just as children seize the ball. Do you understand?’ ",
            "Then he<sup>asws</sup> said: ‘The force of your reign will not decline so long as you do not shed our<sup>asws</sup> blood unlawfully. But if you shed that blood, Allah<sup>azwj</sup> would be Wrathful, so your kingdom and authority would go away, and your power would go away, and Allah<sup>azwj</sup> would Make you to be overcome by a slave from the blind slaves, and he would not be more blind than the progeny of Abu Sufyan, and your eradication would be by his hands and the hands of his companions’. Then he<sup>asws</sup> discontinued the speech’."
          ],
          "en.sarwar": [
            "256. Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Ali Bin Abu Hamza, from Abu Baseer who said: I was seated with Abu Ja’far (a.s.) when Dawood Bin Ali, and Suleyman Bin Khalid, and Abu Ja’far Abdullah Bin Muhammad Abu Al-Dawaniqy came over and sat down in an area of the Masjid. It was said to them, ‘This is Muhammad Bin Ali (a.s.) seated (over there)’. So Dawood Bin Ali, and Suleyman Bin Khalid stood up and came over, whilst Abu Al-Dawaniqy remained seated in his place, until they greeted to Abu Ja’far (a.s.). So Abu Ja’far (a.s.) said to them: ‘What prevented your tyrant from coming to me (a.s.)?’ So they offered excuses on his behalf in his (a.s.) presence. So Abu Ja’far (a.s.) said with regards to that: ‘But, by Allah (azwj), (not many) nights and days would go by before he rules over the two regions. Then the men from his offspring would strengthen it for whom would be the reins, then they would govern with a severe government’. So Dawood Bin Ali said to him (a.s.), ‘And he will be ruling over us before your (a.s.) rule?’ He (a.s.) said: ‘Yes, O Dawood! He will rule over you before our (a.s.) kingdom, and have authority over you before our (a.s.) authority’. Dawood said to him (a.s.), ‘May Allah (azwj) Keep you (a.s.) well, is there a time frame for it?’ He (a.s.) said: ‘Yes, O Dawood. By Allah (azwj), the Clan of Umayya will not rule for a day except that you will rule for twice as much, and will not rule for a year but you will rule for twice as much, and the children from among you would seize it just like children seize the ball’. Dawood Bin Ali stood up from the presence of Abu Ja’far (a.s.) with joy, intending to inform Abu Al-Dawaniqy of that. So when both, him and Suleyman Bin Khalid arose, Abu Ja’far called them back (to him (a.s.)): ‘O Suleyman Bin Khalid! The people would not cease from having space from their reign if they do not shed the blood from us (a.s.) unlawfully’ – and he (a.s.) gestured by his (a.s.) hand to his (a.s.) chest. ‘So if they shed that blood, the inside of the earth would be better for them than its surface, for on that Day there would not be any helper for them in the earth, nor a Forgiver for them in the sky’. Then Suleyman Bin Khalid went and informed Abu Al-Dawaniqy. So Abu Al-Dawaniqy came over to Abu Ja’far (a.s.). He greeted to him (a.s.), then informed him (a.s.) of what Dawood bin Ali and Suleyman Bin Khalid had told him. So he (a.s.) said to him: ‘Yes, O Abu Ja’far! Your government is before our (a.s.) government, and your authority would be before our (a.s.) authority. Your authority would be extremely difficult and there would be no ease in it and would have a long duration for it. By Allah (azwj)! The Clan of Umayya will not rule for a day but you will (rule) for twice as much, nor for a year but you will rule for twice as much, and the children from among you would seize it just as children seize the ball. Do you understand?’ Then he (a.s.) said: ‘The force of your reign will not decline so long as you do not shed our (a.s.) blood unlawfully. But if you shed that blood, Allah (azwj) would be Wrathful, so your kingdom and authority would go away, and your power would go away, and Allah (azwj) would Make you to be overcome by a slave from the blind slaves, and he would not be more blind than the progeny of Abu Sufyan, and your eradication would be by his hands and the hands of his companions’. Then he (a.s.) discontinued the speech’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 131)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 394)"
        ],
        "index": 14941,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:40:3",
        "text": [
          "14705- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ الْمُفَضَّلِ بْنِ مَزْيَدٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قُلْتُ لَهُ أَيَّامَ عَبْدِ اللَّهِ بْنِ عَلِيٍّ قَدِ اخْتَلَفَ هَؤُلَاءِ فِيمَا بَيْنَهُمْ فَقَالَ دَعْ ذَا عَنْكَ إِنَّمَا يَجِي‏ءُ فَسَادُ أَمْرِهِمْ مِنْ حَيْثُ بَدَا صَلَاحُهُمْ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473383\">H 14705</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Al-Mufazzal Bin Mazeed, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> said to Abu Abdullah</span><sup>asws</sup>, ‘The days of Abdullah Bin Ali, they (Abbasid rulers) disputed regarding what was in between them’. So he<sup>asws</sup> said: ‘You leave that. But rather, the spoiling of their command would come from where their success began’."
          ],
          "en.sarwar": [
            "257. Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Al-Mufazzal Bin Mazeed, who has narrated the following: I said to Abu Abdullah (a.s.), ‘The days of Abdullah Bin Ali, they (Abbasid rulers) disputed regarding what was in between them’. So he (a.s.) said: ‘You leave that. But rather, the spoiling of their command would come from where their success began’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 131)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14942,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:40:4",
        "text": [
          "14706- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ بَدْرِ بْنِ الْخَلِيلِ الْأَزْدِيِّ قَالَ كُنْتُ جَالِساً عِنْدَ أَبِي جَعْفَرٍ (عليه السلام) فَقَالَ آيَتَانِ تَكُونَانِ قَبْلَ قِيَامِ الْقَائِمِ (عليه السلام) لَمْ تَكُونَا مُنْذُ هَبَطَ آدَمُ إِلَى الْأَرْضِ تَنْكَسِفُ الشَّمْسُ فِي النِّصْفِ مِنْ شَهْرِ رَمَضَانَ وَ الْقَمَرُ فِي آخِرِهِ فَقَالَ رَجُلٌ يَا ابْنَ رَسُولِ اللَّهِ تَنْكَسِفُ الشَّمْسُ فِي آخِرِ الشَّهْرِ وَ الْقَمَرُ فِي النِّصْفِ فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) إِنِّي أَعْلَمُ مَا تَقُولُ وَ لَكِنَّهُمَا آيَتَانِ لَمْ تَكُونَا مُنْذُ هَبَطَ آدَمُ (عليه السلام)."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473384\">H 14706</a> – A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Sa’albat Bin Maymoun, from Badr Bin Al-Khaleel Al-Azdy who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> was seated in the</span> presence of Abu Ja’far<sup>asws</sup>, so he<sup>asws</sup> said: ‘Two Signs would occur before the rising of Al-Qaim<sup>asws</sup> which have never occurred since the descent of Adam<sup>as</sup> to the earth – A solar eclipse in the middle of the Month of Ramadhan, and the lunar (eclipse) at the end of it’. So a man said, ‘O son<sup>asws</sup> of the Rasool! The sun gets eclipsed at the end of the month, and the moon in the middle of it’. So Abu Ja’far<sup>asws</sup> said: ‘I<sup>asws</sup> am more knowing of what you say, but these two Signs have never occurred since the descent of Adam<sup>as</sup>’."
          ],
          "en.sarwar": [
            "258. A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Sa’albat Bin Maymoun, from Badr Bin Al-Khaleel Al-Azdy who said: I was seated in the presence of Abu Ja’far (a.s.), so he (a.s.) said: ‘Two Signs would occur before the rising of Al-Qaim (a.s.) which have never occurred since the descent of Adam (as) to the earth – A solar eclipse in the middle of the Month of Ramadhan, and the lunar (eclipse) at the end of it’. So a man said, ‘O son (a.s.) of the Rasool! The sun gets eclipsed at the end of the month, and the moon in the middle of it’. So Abu Ja’far (a.s.) said: ‘I (a.s.) am more knowing of what you say, but these two Signs have never occurred since the descent of Adam (as)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> متلف فيه</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 132)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14943,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:40:5",
        "text": [
          "14707- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَمْرِو بْنِ أَبِي الْمِقْدَامِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ خَرَجْتُ أَنَا وَ أَبِي حَتَّى إِذَا كُنَّا بَيْنَ الْقَبْرِ وَ الْمِنْبَرِ إِذَا هُوَ بِأُنَاسٍ مِنَ الشِّيعَةِ فَسَلَّمَ عَلَيْهِمْ ثُمَّ قَالَ إِنِّي وَ اللَّهِ لَأُحِبُّ رِيَاحَكُمْ وَ أَرْوَاحَكُمْ فَأَعِينُونِي عَلَى ذَلِكَ بِوَرَعٍ وَ اجْتِهَادٍ وَ اعْلَمُوا أَنَّ وَلَايَتَنَا لَا تُنَالُ إِلَّا بِالْوَرَعِ وَ الِاجْتِهَادِ وَ مَنِ ائْتَمَّ مِنْكُمْ بِعَبْدٍ فَلْيَعْمَلْ بِعَمَلِهِ أَنْتُمْ شِيعَةُ اللَّهِ وَ أَنْتُمْ أَنْصَارُ اللَّهِ وَ أَنْتُمُ السَّابِقُونَ الْأَوَّلُونَ وَ السَّابِقُونَ الْآخِرُونَ وَ السَّابِقُونَ فِي الدُّنْيَا وَ السَّابِقُونَ فِي الْآخِرَةِ إِلَى الْجَنَّةِ",
          "قَدْ ضَمِنَّا لَكُمُ الْجَنَّةَ بِضَمَانِ اللَّهِ عَزَّ وَ جَلَّ وَ ضَمَانِ رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ اللَّهِ مَا عَلَى دَرَجَةِ الْجَنَّةِ أَكْثَرُ أَرْوَاحاً مِنْكُمْ فَتَنَافَسُوا فِي فَضَائِلِ الدَّرَجَاتِ أَنْتُمُ الطَّيِّبُونَ وَ نِسَاؤُكُمُ الطَّيِّبَاتُ كُلُّ مُؤْمِنَةٍ حَوْرَاءُ عَيْنَاءُ وَ كُلُّ مُؤْمِنٍ صِدِّيقٌ وَ لَقَدْ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) لِقَنْبَرٍ يَا قَنْبَرُ أَبْشِرْ وَ بَشِّرْ وَ اسْتَبْشِرْ فَوَ اللَّهِ لَقَدْ مَاتَ رَسُولُ اللَّهِ (صلى الله عليه وآله) وَ هُوَ عَلَى أُمَّتِهِ سَاخِطٌ إِلَّا الشِّيعَةَ",
          "أَلَا وَ إِنَّ لِكُلِّ شَيْ‏ءٍ عِزّاً وَ عِزُّ الْإِسْلَامِ الشِّيعَةُ أَلَا وَ إِنَّ لِكُلِّ شَيْ‏ءٍ دِعَامَةً وَ دِعَامَةُ الْإِسْلَامِ الشِّيعَةُ أَلَا وَ إِنَّ لِكُلِّ شَيْ‏ءٍ ذِرْوَةً وَ ذِرْوَةُ الْإِسْلَامِ الشِّيعَةُ أَلَا وَ إِنَّ لِكُلِّ شَيْ‏ءٍ شَرَفاً وَ شَرَفُ الْإِسْلَامِ الشِّيعَةُ أَلَا وَ إِنَّ لِكُلِّ شَيْ‏ءٍ سَيِّداً وَ سَيِّدُ الْمَجَالِسِ مَجَالِسُ الشِّيعَةِ أَلَا وَ إِنَّ لِكُلِّ شَيْ‏ءٍ إِمَاماً وَ إِمَامُ الْأَرْضِ أَرْضٌ تَسْكُنُهَا الشِّيعَةُ",
          "وَ اللَّهِ لَوْ لَا مَا فِي الْأَرْضِ مِنْكُمْ مَا رَأَيْتَ بِعَيْنٍ عُشْباً أَبَداً وَ اللَّهِ لَوْ لَا مَا فِي الْأَرْضِ مِنْكُمْ مَا أَنْعَمَ اللَّهُ عَلَى أَهْلِ خِلَافِكُمْ وَ لَا أَصَابُوا الطَّيِّبَاتِ مَا لَهُمْ فِي الدُّنْيَا وَ لَا لَهُمْ فِي الْآخِرَةِ مِنْ نَصِيبٍ كُلُّ نَاصِبٍ وَ إِنْ تَعَبَّدَ وَ اجْتَهَدَ مَنْسُوبٌ إِلَى هَذِهِ الْآيَةِ عامِلَةٌ ناصِبَةٌ تَصْلى ناراً حامِيَةً فَكُلُّ نَاصِبٍ مُجْتَهِدٍ فَعَمَلُهُ هَبَاءٌ ",
          "شِيعَتُنَا يَنْطِقُونَ بِنُورِ اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ يُخَالِفُهُمْ يَنْطِقُونَ بِتَفَلُّتٍ وَ اللَّهِ مَا مِنْ عَبْدٍ مِنْ شِيعَتِنَا يَنَامُ إِلَّا أَصْعَدَ اللَّهُ عَزَّ وَ جَلَّ رُوحَهُ إِلَى السَّمَاءِ فَيُبَارِكُ عَلَيْهَا فَإِنْ كَانَ قَدْ أَتَى عَلَيْهَا أَجَلُهَا جَعَلَهَا فِي كُنُوزِ رَحْمَتِهِ وَ فِي رِيَاضِ جَنَّةٍ وَ فِي ظِلِّ عَرْشِهِ وَ إِنْ كَانَ أَجَلُهَا مُتَأَخِّراً بَعَثَ بِهَا مَعَ أَمَنَتِهِ مِنَ الْمَلَائِكَةِ لِيَرُدُّوهَا إِلَى الْجَسَدِ الَّذِي خَرَجَتْ مِنْهُ لِتَسْكُنَ فِيهِ ",
          "وَ اللَّهِ إِنَّ حَاجَّكُمْ وَ عُمَّارَكُمْ لَخَاصَّةُ اللَّهِ عَزَّ وَ جَلَّ وَ إِنَّ فُقَرَاءَكُمْ لَأَهْلُ الْغِنَى وَ إِنَّ أَغْنِيَاءَكُمْ لَأَهْلُ الْقَنَاعَةِ وَ إِنَّكُمْ كُلَّكُمْ لَأَهْلُ دَعْوَتِهِ وَ أَهْلُ إِجَابَتِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473385\">H 14707</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Amro Bin Abu Al-Maqdaam who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘I<sup>asws</sup> and my<sup>asws</sup> father<sup>asws</sup> went out until we<sup>asws</sup> arrived in between the Grave and the Pulpit (of the Rasool Allah<sup>saww</sup>). There was a group of Shites over there, so I<sup>asws</sup> greeted them, and then said: ‘By Allah<sup>azwj</sup>! I<sup>asws</sup> love your aromas, and your spirits, so help me<sup>asws</sup> upon that by being pious and striving. And know that our<sup>asws</sup> Wilayah cannot be achieved except by piety and the striving, and the one from among you who follows a servant (an Imam<sup>asws</sup>); he should emulate what he does. You are the Shites of Allah<sup>azwj</sup>, and you are the Helpers of Allah<sup>azwj</sup>, and you are the foremost of the former ones, and the foremost of the later ones, and the foremost in the world, and the foremost in the Hereafter (and) to the Paradise. ",
            "We<sup>asws</sup> have taken your responsibility for the Paradise on the Guarantee of Allah<sup>azwj</sup> Mighty and Majestic, and the guarantee of the Rasool Allah<sup>saww</sup>. By Allah<sup>azwj</sup>! There are no Levels of the Paradise where there are more Spirits than yours, so compete for the higher Levels. You are the good ones and your women are the good ones. <span style=\"text-decoration: underline\">Every Believing woman is a virgin Hourie</span> and every Believer is a Truthful one. And Amir-ul-Momineen<sup>asws</sup> has said to Qanbar: ‘Receive good news, rejoice with the good news, and convey the good news, for, by Allah<sup>azwj</sup>, the Rasool Allah<sup>saww</sup> passed away while he<sup>saww</sup> was angry with his<sup>saww</sup> community except for the Shites’. ",
            "Indeed! For everything there is an honour and the honour of Al-Islam are the Shites. Indeed! For everything there is a pillar and the pillar of Al-Islam are the Shites. Indeed! For everything there is a chief and the chief of the gatherings is the gathering of the Shites. Indeed! For every thing is an Imam, and the Imam of the earth is the land on which the Shites live.",
            "By Allah<sup>azwj</sup>! Had you all not been in the earth, an eye would have never ever see herbs. By Allah<sup>azwj</sup>! Had you all not been in the earth, Allah<sup>azwj</sup> would not have Favoured the people who oppose you nor would they have been in any goodness. They would have nothing for them in the world nor any share for them in the Hereafter. Every hostile one (Nasibi), if he were to worship, and struggle, would be attributed to this Verse: <span class=\"ibTxt\">“[88:3] Toiling, Hostile one [88:4] Entering into burning fire”</span>. So every Hostile One (Nasibi) who struggles, his deeds would be wasted. ",
            "Our<sup>asws</sup> Shites speak with the ‘بِنُورِ’ Light of Allah<sup>azwj</sup> Mighty and Majestic, and the one who are opposed to them speak by instinct (biological needs). By Allah<sup>azwj</sup>! There is none from our<sup>asws</sup> Shites who sleeps, except that Allah<sup>azwj</sup> Makes his soul to ascend to the sky to be Blessed. So if its term (death) has come, He<sup>azwj</sup> Makes it to be within the Treasures of His<sup>azwj</sup> Mercy, and in the Gardens of Paradise, and in the Shade of His<sup>azwj</sup> Throne. And if its term (death) has been delayed, He<sup>azwj</sup> sends it back along with the trusted Angels to return it to the body from which it came out to dwell in it. ",
            "By Allah<sup>azwj</sup> those of you who perform the Hajj and the Umrah are the special ones of Allah<sup>azwj</sup> Mighty and Majestic. And the poor ones among you are the rich ones, and your rich ones are the contented ones. And all of you are the people whom He<sup>azwj</sup> Invited and the people who accepted His<sup>azwj</sup> Call’."
          ],
          "en.sarwar": [
            "259. Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Amro Bin Abu Al-Maqdaam who said: I heard Abu Abdullah (a.s.) saying: ‘I (a.s.) and my (a.s.) father (a.s.) went out until we (a.s.) arrived in between the Grave and the Pulpit (of the Rasool Allah (saww)). There was a group of Shites over there, so I (a.s.) greeted them, and then said: ‘By Allah (azwj)! I (a.s.) love your aromas, and your spirits, so help me (a.s.) upon that by being pious and striving. And know that our (a.s.) Wilayah cannot be achieved except by piety and the striving, and the one from among you who follows a servant (an Imam (a.s.)); he should emulate what he does. You are the Shites of Allah (azwj), and you are the Helpers of Allah (azwj), and you are the foremost of the former ones, and the foremost of the later ones, and the foremost in the world, and the foremost in the Hereafter (and) to the Paradise. We (a.s.) have taken your responsibility for the Paradise on the Guarantee of Allah (azwj) Mighty and Majestic, and the guarantee of the Rasool Allah (saww). By Allah (azwj)! There are no Levels of the Paradise where there are more Spirits than yours, so compete for the higher Levels. You are the good ones and your women are the good ones. Every Believing woman is a virgin Hourie and every Believer is a Truthful one. And Amir-ul-Momineen (a.s.) has said to Qanbar: ‘Receive good news, rejoice with the good news, and convey the good news, for, by Allah (azwj), the Rasool Allah (saww) passed away while he (saww) was angry with his (saww) community except for the Shites’. Indeed! For everything there is an honour and the honour of Al-Islam are the Shites. Indeed! For everything there is a pillar and the pillar of Al-Islam are the Shites. Indeed! For everything there is a chief and the chief of the gatherings is the gathering of the Shites. Indeed! For every thing is an Imam, and the Imam of the earth is the land on which the Shites live. By Allah (azwj)! Had you all not been in the earth, an eye would have never ever see herbs. By Allah (azwj)! Had you all not been in the earth, Allah (azwj) would not have Favoured the people who oppose you nor would they have been in any goodness. They would have nothing for them in the world nor any share for them in the Hereafter. Every hostile one (Nasibi), if he were to worship, and struggle, would be attributed to this Verse: “[88:3] Toiling, Hostile one [88:4] Entering into burning fire”. So every Hostile One (Nasibi) who struggles, his deeds would be wasted. Our (a.s.) Shites speak with the ‘بِنُورِ’ Light of Allah (azwj) Mighty and Majestic, and the one who are opposed to them speak by instinct (biological needs). By Allah (azwj)! There is none from our (a.s.) Shites who sleeps, except that Allah (azwj) Makes his soul to ascend to the sky to be Blessed. So if its term (death) has come, He (azwj) Makes it to be within the Treasures of His (azwj) Mercy, and in the Gardens of Paradise, and in the Shade of His (azwj) Throne. And if its term (death) has been delayed, He (azwj) sends it back along with the trusted Angels to return it to the body from which it came out to dwell in it. By Allah (azwj) those of you who perform the Hajj and the Umrah are the special ones of Allah (azwj) Mighty and Majestic. And the poor ones among you are the rich ones, and your rich ones are the contented ones. And all of you are the people whom He (azwj) Invited and the people who accepted His (azwj) Call’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 134)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14944,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:40:6",
        "text": [
          "14708- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ عَمْرِو بْنِ أَبِي الْمِقْدَامِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) مِثْلَهُ وَ زَادَ فِيهِ أَلَا وَ إِنَّ لِكُلِّ شَيْ‏ءٍ جَوْهَراً وَ جَوْهَرُ وُلْدِ آدَمَ مُحَمَّدٌ (صلى الله عليه وآله) وَ نَحْنُ وَ شِيعَتُنَا بَعْدَنَا حَبَّذَا شِيعَتُنَا مَا أَقْرَبَهُمْ مِنْ عَرْشِ اللَّهِ عَزَّ وَ جَلَّ وَ أَحْسَنَ صُنْعَ اللَّهِ إِلَيْهِمْ يَوْمَ الْقِيَامَةِ وَ اللَّهِ لَوْ لَا أَنْ يَتَعَاظَمَ النَّاسُ ذَلِكَ أَوْ يَدْخُلَهُمْ زَهْوٌ لَسَلَّمَتْ عَلَيْهِمُ الْمَلَائِكَةُ قُبُلًا ",
          "وَ اللَّهِ مَا مِنْ عَبْدٍ مِنْ شِيعَتِنَا يَتْلُو الْقُرْآنَ فِي صَلَاتِهِ قَائِماً إِلَّا وَ لَهُ بِكُلِّ حَرْفٍ مِائَةُ حَسَنَةٍ وَ لَا قَرَأَ فِي صَلَوَاتِهِ جَالِساً إِلَّا وَ لَهُ بِكُلِّ حَرْفٍ خَمْسُونَ حَسَنَةً وَ لَا فِي غَيْرِ صَلَاةٍ إِلَّا وَ لَهُ بِكُلِّ حَرْفٍ عَشْرُ حَسَنَاتٍ وَ إِنَّ لِلصَّامِتِ مِنْ شِيعَتِنَا لَأَجْرُ مَنْ قَرَأَ الْقُرْآنَ مِمَّنْ خَالَفَهُ ",
          "أَنْتُمْ وَ اللَّهِ عَلَى فُرُشِكُمْ نِيَامٌ لَكُمْ أَجْرُ الْمُجَاهِدِينَ وَ أَنْتُمْ وَ اللَّهِ فِي صَلَاتِكُمْ لَكُمْ أَجْرُ الصَّافِّينَ فِي سَبِيلِهِ أَنْتُمْ وَ اللَّهِ الَّذِينَ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ نَزَعْنا ما فِي صُدُورِهِمْ مِنْ غِلٍّ إِخْواناً عَلى سُرُرٍ مُتَقابِلِينَ إِنَّمَا شِيعَتُنَا أَصْحَابُ الْأَرْبَعَةِ الْأَعْيُنِ عَيْنَانِ فِي الرَّأْسِ وَ عَيْنَانِ فِي الْقَلْبِ أَلَا وَ الْخَلَائِقُ كُلُّهُمْ كَذَلِكَ إِلَّا أَنَّ اللَّهَ عَزَّ وَ جَلَّ فَتَحَ أَبْصَارَكُمْ وَ أَعْمَى أَبْصَارَهُمْ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473386\">H 14708</a> – A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al-Hassan Bin Shammoun, from Abdullah Bin Abdu Rahmaan, from Abdullah Bin Al-Qasim, from Amro Bin Abu Al-Maqdaam, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘Indeed! And for everything is an essence and the essence of the children of Adam<sup>as</sup> is Muhammad<sup>saww</sup>, and us<sup>asws</sup>, and our<sup>asws</sup> Shites after us<sup>asws</sup>. How lovely are our<sup>asws</sup> Shites! What will be closer to the Throne of Allah<sup>azwj</sup> Mighty and Majestic than them on the Day of Judgement. By Allah<sup>azwj</sup>! Had the people not magnified that, or pride entered into them, the Angels would have greeted them already.",
            "By Allah<sup>azwj</sup>! There is no servant from our<sup>asws</sup> Shites who recites the Quran whilst standing in his Prayer, except that there are a hundred Rewards for him for every letter of it, nor does he recite it seated in his Prayer, except that there are a fifty Rewards for him for every letter of it, nor in other than Prayers, except that there are ten Rewards for him for every letter of it. And the one from our<sup>asws</sup> Shites who is silent, there is the Reward for him of the recitation of the Quran by the one who is opposed to him.  ",
            "By Allah<sup>azwj</sup>! You sleep upon your beds and there is the Reward for you of the Holy Warriors (Al-Mujahideen). By Allah<sup>azwj</sup>! You are in your Prayers, and there is for you the Reward of the being in the rows of His<sup>azwj</sup> Way. By Allah<sup>azwj</sup>! You are the ones for whom Allah<sup>azwj</sup> has Said: <span class=\"ibTxt\">“[15:47] And We will root out whatever of rancour is in their breasts (they shall be) as brethren, on raised couches, face to face”</span>. But rather, our<sup>asws</sup> Shites are the people with four eyes – two eyes in the head and two eyes in the heart. Indeed! And all of the creatures are like that, except that Allah<sup>azwj</sup> has Opened your eyes, and Blinded their eyes’."
          ],
          "en.sarwar": [
            "260. A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al-Hassan Bin Shammoun, from Abdullah Bin Abdu Rahmaan, from Abdullah Bin Al-Qasim, from Amro Bin Abu Al-Maqdaam, who has narrated the following: Abu Abdullah (a.s.) said: ‘Indeed! And for everything is an essence and the essence of the children of Adam (as) is Muhammad (saww), and us (a.s.), and our (a.s.) Shites after us (a.s.). How lovely are our (a.s.) Shites! What will be closer to the Throne of Allah (azwj) Mighty and Majestic than them on the Day of Judgement. By Allah (azwj)! Had the people not magnified that, or pride entered into them, the Angels would have greeted them already. By Allah (azwj)! There is no servant from our (a.s.) Shites who recites the Quran whilst standing in his Prayer, except that there are a hundred Rewards for him for every letter of it, nor does he recite it seated in his Prayer, except that there are a fifty Rewards for him for every letter of it, nor in other than Prayers, except that there are ten Rewards for him for every letter of it. And the one from our (a.s.) Shites who is silent, there is the Reward for him of the recitation of the Quran by the one who is opposed to him. By Allah (azwj)! You sleep upon your beds and there is the Reward for you of the Holy Warriors (Al-Mujahideen). By Allah (azwj)! You are in your Prayers, and there is for you the Reward of the being in the rows of His (azwj) Way. By Allah (azwj)! You are the ones for whom Allah (azwj) has Said: “[15:47] And We will root out whatever of rancour is in their breasts (they shall be) as brethren, on raised couches, face to face”. But rather, our (a.s.) Shites are the people with four eyes – two eyes in the head and two eyes in the heart. Indeed! And all of the creatures are like that, except that Allah (azwj) has Opened your eyes, and Blinded their eyes’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 136)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 395)"
        ],
        "index": 14945,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:40:7",
        "text": [
          "14709- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ عَنْبَسَةَ بْنِ مُصْعَبٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ أَشْكُو إِلَى اللَّهِ عَزَّ وَ جَلَّ وَحْدَتِي وَ تَقَلْقُلِي بَيْنَ أَهْلِ الْمَدِينَةِ حَتَّى تَقْدَمُوا وَ أَرَاكُمْ وَ آنَسَ بِكُمْ فَلَيْتَ هَذِهِ الطَّاغِيَةَ أَذِنَ لِي فَأَتَّخِذَ قَصْراً فِي الطَّائِفِ فَسَكَنْتُهُ وَ أَسْكَنْتُكُمْ مَعِيَ وَ أَضْمَنَ لَهُ أَنْ لَا يَجِي‏ءَ مِنْ نَاحِيَتِنَا مَكْرُوهٌ أَبَداً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473387\">H 14709</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from Mansour Bin Yunus, from Anbasat Bin Mus’ab who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘I<sup>asws</sup> ‘أَشْكُو’ complain to Allah<sup>azwj</sup> Might and Majestic of my<sup>asws</sup> loneliness, and restlessness among the people of Al-Medina, until you (Shites) come over and I<sup>asws</sup> see you, and be comforted by you. If only this tyrant would allow me, so I<sup>asws</sup> would take a fort in Al-Taef, so I<sup>asws</sup> would dwell in it and you would all dwell in it with me<sup>asws</sup>. I<sup>asws</sup> would guarantee to him that there would not come from our area any harm to him ever’. "
          ],
          "en.sarwar": [
            "261. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from Mansour Bin Yunus, from Anbasat Bin Mus’ab who said: I heard Abu Abdullah (a.s.) saying: ‘I (a.s.) ‘أَشْكُو’ complain to Allah (azwj) Might and Majestic of my (a.s.) loneliness, and restlessness among the people of Al-Medina, until you (Shites) come over and I (a.s.) see you, and be comforted by you. If only this tyrant would allow me, so I (a.s.) would take a fort in Al-Taef, so I (a.s.) would dwell in it and you would all dwell in it with me (a.s.). I (a.s.) would guarantee to him that there would not come from our area any harm to him ever’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 136)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14946,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:40:8",
        "text": [
          "14710- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ عَنْ يُونُسَ بْنِ يَعْقُوبَ قَالَ أَنْشَدَ الْكُمَيْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) شِعْراً فَقَالَ: أَخْلَصَ اللَّهُ لِي هَوَايَ فَمَا أُغْرِقُ نَزْعاً وَ لَا تَطِيشُ سِهَامِي فَقَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) لَا تَقُلْ هَكَذَا فَمَا أُغْرِقُ نَزْعاً وَ لَكِنْ قُلْ فَقَدْ أُغْرِقَ نَزْعاً وَ لَا تَطِيشُ سِهَامِي."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473388\">H 14710</a> – A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al-Waleed, from Yunus Bin Yaqoub who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-k\">K</span>umeyt chanted some</span> poems to Abu Abdullah<sup>asws</sup>, so he said: ‘May Allah<sup>azwj</sup> Make my desires sincere to me so I do not pull the string of my bow, and my arrows do not waver’. So Abu Abdullah<sup>asws</sup> said; ‘Do not say like this, ‘I do not pull the string of my bow’, but say, ‘So I have pulled the string of my bow and my arrows do not waver’."
          ],
          "en.sarwar": [
            "262. A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al-Waleed, from Yunus Bin Yaqoub who said: Kumeyt chanted some poems to Abu Abdullah (a.s.), so he said: ‘May Allah (azwj) Make my desires sincere to me so I do not pull the string of my bow, and my arrows do not waver’. So Abu Abdullah (a.s.) said; ‘Do not say like this, ‘I do not pull the string of my bow’, but say, ‘So I have pulled the string of my bow and my arrows do not waver’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 137)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14947,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:40:9",
        "text": [
          "14711- سَهْلُ بْنُ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ أَبِي دَاوُدَ الْمُسْتَرِقِّ عَنْ سُفْيَانَ بْنِ مُصْعَبٍ الْعَبْدِيِّ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ (عليه السلام) فَقَالَ قُولُوا لِأُمِّ فَرْوَةَ تَجِي‏ءُ فَتَسْمَعُ مَا صُنِعَ بِجَدِّهَا قَالَ فَجَاءَتْ فَقَعَدَتْ خَلْفَ السِّتْرِ ثُمَّ قَالَ أَنْشِدْنَا قَالَ فَقُلْتُ فَرْوُ جُودِي بِدَمْعِكِ الْمَسْكُوبِ قَالَ فَصَاحَتْ وَ صِحْنَ النِّسَاءُ فَقَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) الْبَابَ الْبَابَ فَاجْتَمَعَ أَهْلُ الْمَدِينَةِ عَلَى الْبَابِ قَالَ فَبَعَثَ إِلَيْهِمْ أَبُو عَبْدِ اللَّهِ (عليه السلام) صَبِيٌّ لَنَا غُشِيَ عَلَيْهِ فَصِحْنَ النِّسَاءُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473389\">H 14711</a> – Sahl Bin Ziyad, from Muhammad Bin Al-Hassan, from Abu Dawood Al-Mustarraq, from Sufyan Bin Mus’ab Al-Abzay who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> came up to Abu Abdullah</span><sup>asws</sup>, so he<sup>asws</sup> said: ‘Tell Umm Farwa to come and listen to what happened with her grandfather’. So she came and sat behind the curtain. Then he<sup>asws</sup> said: ‘Recite a poem (Nasheed) to us’. So I said, ‘Let Farwa be generous in the flow of her tears’. So she wailed and the women wailed’. Abu Abdullah<sup>asws</sup> said: ‘The door! The door! The people of Al-Medina were gathered at the door. So Abu Abdullah<sup>asws</sup> sent a message to them: ‘One of our young ones fainted, hence the women wailed’."
          ],
          "en.sarwar": [
            "263. Sahl Bin Ziyad, from Muhammad Bin Al-Hassan, from Abu Dawood Al-Mustarraq, from Sufyan Bin Mus’ab Al-Abzay who said: I came up to Abu Abdullah (a.s.), so he (a.s.) said: ‘Tell Umm Farwa to come and listen to what happened with her grandfather’. So she came and sat behind the curtain. Then he (a.s.) said: ‘Recite a poem (Nasheed) to us’. So I said, ‘Let Farwa be generous in the flow of her tears’. So she wailed and the women wailed’. Abu Abdullah (a.s.) said: ‘The door! The door! The people of Al-Medina were gathered at the door. So Abu Abdullah (a.s.) sent a message to them: ‘One of our young ones fainted, hence the women wailed’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 138)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14948,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:40:10",
        "text": [
          "14712- سَهْلُ بْنُ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ بَعْضِ رِجَالِهِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ لَمَّا حَفَرَ رَسُولُ اللَّهِ (صلى الله عليه وآله) الْخَنْدَقَ مَرُّوا بِكُدْيَةٍ فَتَنَاوَلَ رَسُولُ اللَّهِ (صلى الله عليه وآله) الْمِعْوَلَ مِنْ يَدِ أَمِيرِ الْمُؤْمِنِينَ (عليه السلام) أَوْ مِنْ يَدِ سَلْمَانَ رَضِيَ اللَّهُ عَنْهُ فَضَرَبَ بِهَا ضَرْبَةً فَتَفَرَّقَتْ بِثَلَاثِ فِرَقٍ فَقَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) لَقَدْ فُتِحَ عَلَيَّ فِي ضَرْبَتِي هَذِهِ كُنُوزُ كِسْرَى وَ قَيْصَرَ فَقَالَ أَحَدُهُمَا لِصَاحِبِهِ يَعِدُنَا بِكُنُوزِ كِسْرَى وَ قَيْصَرَ وَ مَا يَقْدِرُ أَحَدُنَا أَنْ يَخْرُجَ يَتَخَلَّى."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473390\">H 14712</a> – Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Abaan Bin Usmaan, from one of his men, from Abu Abdullah having said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-w\">W</span>hen the Rasool Allah</span><sup>saww</sup> dug the trench (Al-Khandaq), he<sup>saww</sup> came across a rock. So the Rasool Allah<sup>saww</sup> took a pickaxe from the hand of Amir-ul-Momineen<sup>asws</sup>, or from the hand of Salman<sup>ar</sup>. He<sup>saww</sup> struck by it at the rock and it split into three pieces. The Rasool Allah<sup>saww</sup> said: ‘With this strike the treasures of Chosroe and Caesar have opened up for me<sup>saww</sup>. So one of them (Abu Bakr or Umar) said to his companion, ‘He<sup>saww</sup> promises us with the treasures of Chosroe and Caesar whilst no one of us has the control to go out for the toilet’."
          ],
          "en.sarwar": [
            "264. Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Abaan Bin Usmaan, from one of his men, from Abu Abdullah having said: When the Rasool Allah (saww) dug the trench (Al-Khandaq), he (saww) came across a rock. So the Rasool Allah (saww) took a pickaxe from the hand of Amir-ul-Momineen (a.s.), or from the hand of Salman (ar). He (saww) struck by it at the rock and it split into three pieces. The Rasool Allah (saww) said: ‘With this strike the treasures of Chosroe and Caesar have opened up for me (saww). So one of them (Abu Bakr or Umar) said to his companion, ‘He (saww) promises us with the treasures of Chosroe and Caesar whilst no one of us has the control to go out for the toilet’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 140)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14949,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:40:11",
        "text": [
          "14713- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِي يَحْيَى الْوَاسِطِيِّ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ إِنَّ لِلَّهِ تَبَارَكَ وَ تَعَالَى رِيحاً يُقَالُ لَهَا الْأَزْيَبُ لَوْ أَرْسَلَ مِنْهَا مِقْدَارَ مَنْخِرِ ثَوْرٍ لَأَثَارَتْ مَا بَيْنَ السَّمَاءِ وَ الْأَرْضِ وَ هِيَ الْجَنُوبُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473391\">H 14713</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Abu Yahya Al-Wasity, from one of our companions, who have narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘Allah<sup>azwj</sup> Blessed and High has a Wind which is called ‘Al-Azeyb). If He<sup>azwj</sup> Sends from it the measurement (which comes out of) the nostril of a bull, it would raise what is in between the sky and the earth, and this is (known as) the South (Wind)’."
          ],
          "en.sarwar": [
            "265. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Abu Yahya Al-Wasity, from one of our companions, who have narrated the following: Abu Abdullah (a.s.) said: ‘Allah (azwj) Blessed and High has a Wind which is called ‘Al-Azeyb). If He (azwj) Sends from it the measurement (which comes out of) the nostril of a bull, it would raise what is in between the sky and the earth, and this is (known as) the South (Wind)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 140)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14950,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:40:12",
        "text": [
          "14714- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنْ رُزَيْقٍ أَبِي الْعَبَّاسِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ أَتَى قَوْمٌ رَسُولَ اللَّهِ (صلى الله عليه وآله) فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّ بِلَادَنَا قَدْ قُحِطَتْ وَ تَوَالَتِ السِّنُونَ عَلَيْنَا فَادْعُ اللَّهَ تَبَارَكَ وَ تَعَالَى يُرْسِلِ السَّمَاءَ عَلَيْنَا فَأَمَرَ رَسُولُ اللَّهِ (صلى الله عليه وآله) بِالْمِنْبَرِ فَأُخْرِجَ وَ اجْتَمَعَ النَّاسُ فَصَعِدَ رَسُولُ اللَّهِ (صلى الله عليه وآله) وَ دَعَا وَ أَمَرَ النَّاسَ أَنْ يُؤَمِّنُوا ",
          "فَلَمْ يَلْبَثْ أَنْ هَبَطَ جَبْرَئِيلُ فَقَالَ يَا مُحَمَّدُ أَخْبِرِ النَّاسَ أَنَّ رَبَّكَ قَدْ وَعَدَهُمْ أَنْ يُمْطَرُوا يَوْمَ كَذَا وَ كَذَا وَ سَاعَةَ كَذَا وَ كَذَا فَلَمْ يَزَلِ النَّاسُ يَنْتَظِرُونَ ذَلِكَ الْيَوْمَ وَ تِلْكَ السَّاعَةَ حَتَّى إِذَا كَانَتْ تِلْكَ السَّاعَةُ أَهَاجَ اللَّهُ عَزَّ وَ جَلَّ رِيحاً فَأَثَارَتْ سَحَاباً وَ جَلَّلَتِ السَّمَاءَ وَ أَرْخَتْ عَزَالِيَهَا",
          "فَجَاءَ أُولَئِكَ النَّفَرُ بِأَعْيَانِهِمْ إِلَى النَّبِيِّ (صلى الله عليه وآله) فَقَالُوا يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ لَنَا أَنْ يَكُفَّ السَّمَاءَ عَنَّا فَإِنَّا كِدْنَا أَنْ نَغْرَقَ فَاجْتَمَعَ النَّاسُ وَ دَعَا النَّبِيُّ (صلى الله عليه وآله) وَ أَمَرَ النَّاسَ أَنْ يُؤَمِّنُوا عَلَى دُعَائِهِ فَقَالَ لَهُ رَجُلٌ مِنَ النَّاسِ يَا رَسُولَ اللَّهِ أَسْمِعْنَا فَإِنَّ كُلَّ مَا تَقُولُ لَيْسَ نَسْمَعُ فَقَالَ قُولُوا اللَّهُمَّ حَوَالَيْنَا وَ لَا عَلَيْنَا اللَّهُمَّ صُبَّهَا فِي بُطُونِ الْأَوْدِيَةِ وَ فِي نَبَاتِ الشَّجَرِ وَ حَيْثُ يَرْعَى أَهْلُ الْوَبَرِ اللَّهُمَّ اجْعَلْهَا رَحْمَةً وَ لَا تَجْعَلْهَا عَذَاباً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473392\">H 14714</a> – Ali Bin Ibrahim, from Saleh Bin Al-Sandy, from Ja’far Bin basher, from Ruzeyq Abu Al-Abbas, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘The people came to the Rasool Allah<sup>saww</sup>, so they said, ‘O Rasool Allah<sup>saww</sup>! Our towns have drought and it has prevailed for years upon us. So supplicate to Allah<sup>azwj</sup> Blessed and High to Send the sky (to rain) upon us’. So the Rasool Allah<sup>saww</sup> ordered for the Pulpit. They brought it out, and the people gathered. The Rasool Allah<sup>saww</sup> ascended and supplicated, and ordered the people to say ‘Ameen’.",
            "It was not long before Jibraeel descended and said; ‘O Muhammad<sup>saww</sup>! Inform the people that your<sup>saww</sup> Lord<sup>azwj</sup> has Promised to them that He<sup>azwj</sup> would Make it rain on such and such a day, and at such and such a time’. So the people did not cease to look out for that day and that particular time, until that time came up. Allah<sup>azwj</sup> Mighty and Majestic Excited a wind, so it raised clouds which covered the sky, and released the rain. ",
            "So those individuals came with their rich ones to the Prophet<sup>saww</sup>. They said, ‘O Rasool Allah<sup>saww</sup>, Supplicate to Allah<sup>azwj</sup> for us to withhold the sky (stop the rain) from us, for we are about to drown. So the people gathered, and the Prophet<sup>saww</sup> supplicated, and ordered the people that they should say ‘Ameen’ upon his<sup>saww</sup> supplication. A man from the people said, ‘O Rasool Allah<sup>saww</sup>, make us hear it, for all what you<sup>saww</sup> are saying, we cannot hear’. So he<sup>saww</sup> said; ‘Say, ‘Our Allah<sup>azwj</sup>! Around us and not upon us. Our Allah<sup>azwj</sup>! Let it pour in the middle of the valleys, and in the growth of the trees, and where the shepherds pasture. Our Allah<sup>azwj</sup>! Make it to be a Mercy, and do not Make it to be a Punishment’."
          ],
          "en.sarwar": [
            "266. Ali Bin Ibrahim, from Saleh Bin Al-Sandy, from Ja’far Bin basher, from Ruzeyq Abu Al-Abbas, who has narrated the following: Abu Abdullah (a.s.) having said: ‘The people came to the Rasool Allah (saww), so they said, ‘O Rasool Allah (saww)! Our towns have drought and it has prevailed for years upon us. So supplicate to Allah (azwj) Blessed and High to Send the sky (to rain) upon us’. So the Rasool Allah (saww) ordered for the Pulpit. They brought it out, and the people gathered. The Rasool Allah (saww) ascended and supplicated, and ordered the people to say ‘Ameen’. It was not long before Jibraeel descended and said; ‘O Muhammad (saww)! Inform the people that your (saww) Lord (azwj) has Promised to them that He (azwj) would Make it rain on such and such a day, and at such and such a time’. So the people did not cease to look out for that day and that particular time, until that time came up. Allah (azwj) Mighty and Majestic Excited a wind, so it raised clouds which covered the sky, and released the rain. So those individuals came with their rich ones to the Prophet (saww). They said, ‘O Rasool Allah (saww), Supplicate to Allah (azwj) for us to withhold the sky (stop the rain) from us, for we are about to drown. So the people gathered, and the Prophet (saww) supplicated, and ordered the people that they should say ‘Ameen’ upon his (saww) supplication. A man from the people said, ‘O Rasool Allah (saww), make us hear it, for all what you (saww) are saying, we cannot hear’. So he (saww) said; ‘Say, ‘Our Allah (azwj)! Around us and not upon us. Our Allah (azwj)! Let it pour in the middle of the valleys, and in the growth of the trees, and where the shepherds pasture. Our Allah (azwj)! Make it to be a Mercy, and do not Make it to be a Punishment’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 141)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14951,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:40:13",
        "text": [
          "14715- جَعْفَرُ بْنُ بَشِيرٍ عَنْ رُزَيْقٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ مَا أَبْرَقَتْ قَطُّ فِي ظُلْمَةِ لَيْلٍ وَ لَا ضَوْءِ نَهَارٍ إِلَّا وَ هِيَ مَاطِرَةٌ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473393\">H 14715</a> – Ja’far Bin Basheer, from Ruzeyq, who has reported the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘Lightning does not occur at all in the darkness of the night or the light of the day unless it is raining’."
          ],
          "en.sarwar": [
            "267. Ja’far Bin Basheer, from Ruzeyq, who has reported the following: Abu Abdullah (a.s.) has said: ‘Lightning does not occur at all in the darkness of the night or the light of the day unless it is raining’."
          ]
        }
      },
      {
        "gradings": [
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14952,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:40:14",
        "text": [
          "14716- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ ابْنِ الْعَزْرَمِيِّ رَفَعَهُ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) وَ سُئِلَ عَنِ السَّحَابِ أَيْنَ يَكُونُ قَالَ يَكُونُ عَلَى شَجَرٍ عَلَى كَثِيبٍ عَلَى شَاطِئِ الْبَحْرِ يَأْوِي إِلَيْهِ فَإِذَا أَرَادَ اللَّهُ عَزَّ وَ جَلَّ أَنْ يُرْسِلَهُ أَرْسَلَ رِيحاً فَأَثَارَتْهُ وَ وَكَّلَ بِهِ مَلَائِكَةً يَضْرِبُوهُ بِالْمَخَارِيقِ وَ هُوَ الْبَرْقُ فَيَرْتَفِعُ ثُمَّ قَرَأَ هَذِهِ الْآيَةَ اللَّهُ الَّذِي أَرْسَلَ الرِّياحَ فَتُثِيرُ سَحاباً فَسُقْناهُ إِلى بَلَدٍ مَيِّتٍ الْآيَةَ وَ الْمَلَكُ اسْمُهُ الرَّعْدُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473394\">H 14716</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Husayn Bin Saeed, from Ibn Al-Azramy with an unbroken chain has said the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>mir-ul-Momineen</span><sup>asws</sup> replied when he<sup>asws</sup> was asked, ‘Where do the clouds come from?’  He<sup>asws</sup> as said: ‘They are on the dense trees, on the dunes, and on the shores which are a resort for them. So if Allah<sup>azwj</sup> Mighty and Majestic Intends to Send a wind which stirs them, and Allocates Angels to these who strike it by ‘Al-makhareeq’, and it is the lightning. So they rise up’. Then he<sup>asws</sup> recited this verse: <span class=\"ibTxt\">“[35:9] And Allah is He Who sends the winds so they raise a cloud, then We drive it on to a dead country, and therewith We give life to the earth after its death”</span>, the Verse. And the Angel, its name is ‘Al-Ra’ad’ (The Thunder)’."
          ],
          "en.sarwar": [
            "268. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Husayn Bin Saeed, from Ibn Al-Azramy with an unbroken chain has said the following: Amir-ul-Momineen (a.s.) replied when he (a.s.) was asked, ‘Where do the clouds come from?’ He (a.s.) as said: ‘They are on the dense trees, on the dunes, and on the shores which are a resort for them. So if Allah (azwj) Mighty and Majestic Intends to Send a wind which stirs them, and Allocates Angels to these who strike it by ‘Al-makhareeq’, and it is the lightning. So they rise up’. Then he (a.s.) recited this verse: “[35:9] And Allah is He Who sends the winds so they raise a cloud, then We drive it on to a dead country, and therewith We give life to the earth after its death”, the Verse. And the Angel, its name is ‘Al-Ra’ad’ (The Thunder)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 142)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14953,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:40:15",
        "text": [
          "14717- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ مُثَنًّى الْحَنَّاطِ وَ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَا قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) مَنْ صَدَقَ لِسَانُهُ زَكَا عَمَلُهُ وَ مَنْ حَسُنَتْ نِيَّتُهُ زَادَ اللَّهُ عَزَّ وَ جَلَّ فِي رِزْقِهِ وَ مَنْ حَسُنَ بِرُّهُ بِأَهْلِهِ زَادَ اللَّهُ فِي عُمُرِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473395\">H 14717</a> – A number of our companions, from Sahl Bin ziyad, from Ahmad Bin Muhammad bin Abu nasr, from Musanna Al-Hannaat and Muhammad Bin Muslim who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘The one who is of a truthful tongue, his deeds would be pure, and the one who is of good intention, Allah<sup>azwj</sup> Increases his sustenance, and the one who is kind to his family, Allah<sup>azwj</sup> Increases his life’."
          ],
          "en.sarwar": [
            "269. A number of our companions, from Sahl Bin ziyad, from Ahmad Bin Muhammad bin Abu nasr, from Musanna Al-Hannaat and Muhammad Bin Muslim who said: Abu Abdullah (a.s.) said: ‘The one who is of a truthful tongue, his deeds would be pure, and the one who is of good intention, Allah (azwj) Increases his sustenance, and the one who is kind to his family, Allah (azwj) Increases his life’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 143)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14954,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:40:16",
        "text": [
          "14718—الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الْهَاشِمِيِّ قَالَ حَدَّثَنِي أَبِي عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى قَالَ حَدَّثَنِي جَعْفَرُ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ عَلِيٍّ (عليه السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) يَقُولُ اللَّهُ تَبَارَكَ وَ تَعَالَى لِابْنِ آدَمَ إِنْ نَازَعَكَ بَصَرُكَ إِلَى بَعْضِ مَا حَرَّمْتُ عَلَيْكَ فَقَدْ أَعَنْتُكَ عَلَيْهِ بِطَبَقَيْنِ فَأَطْبِقْ وَ لَا تَنْظُرْ وَ إِنْ نَازَعَكَ لِسَانُكَ إِلَى بَعْضِ مَا حَرَّمْتُ عَلَيْكَ فَقَدْ أَعَنْتُكَ عَلَيْهِ بِطَبَقَيْنِ فَأَطْبِقْ وَ لَا تَكَلَّمْ وَ إِنْ نَازَعَكَ فَرْجُكَ إِلَى بَعْضِ مَا حَرَّمْتُ عَلَيْكَ فَقَدْ أَعَنْتُكَ عَلَيْهِ بِطَبَقَيْنِ فَأَطْبِقْ وَ لَا تَأْتِ حَرَاماً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473396\">H 14718</a> – Al-Husayn Bin Muhammad Al-Ashary, from Moalla Bin Muhammad, from Ahmad Bin Muhammad Bin Abu Nasr, from Al-Hassan Bin Muhammad Al-Hashmy, from Ahmad Bin Muhammad Bin Isa who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span>t was narrated to</span> me by Ja’far Bin Muhammad<sup>asws</sup>, from his<sup>asws</sup> father<sup>asws</sup>, from his<sup>asws</sup> grandfather Ali<sup>asws</sup> that the Rasool Allah<sup>saww</sup> said: ‘Allah<sup>azwj</sup> Blessed and High Said to the Children of Adam<sup>as</sup>: “If your eye dispute for some of what I<sup>azwj</sup> have Prohibited to you, so I<sup>azwj</sup> have Aided you with two layers (eyelids), so close them and do not look. And if your tongue disputes for some of what I<sup>azwj</sup> have Prohibited to you, so I<sup>azwj</sup> have Aided you with two layers (lips), so close them and do not speak. And if your genitals dispute for some of what I<sup>azwj</sup> have Prohibited to you, so I<sup>azwj</sup> have Aided you with two layers (legs), so close them and do not come to the Prohibited’."
          ],
          "en.sarwar": [
            "270. Al-Husayn Bin Muhammad Al-Ashary, from Mu‘alla Bin Muhammad, from Ahmad Bin Muhammad Bin Abu Nasr, from Al-Hassan Bin Muhammad Al-Hashmy, from Ahmad Bin Muhammad Bin Isa who said: It was narrated to me by Ja’far Bin Muhammad (a.s.), from his (a.s.) father (a.s.), from his (a.s.) grandfather Ali (a.s.) that the Rasool Allah (saww) said: ‘Allah (azwj) Blessed and High Said to the Children of Adam (as): “If your eye dispute for some of what I (azwj) have Prohibited to you, so I (azwj) have Aided you with two layers (eyelids), so close them and do not look. And if your tongue disputes for some of what I (azwj) have Prohibited to you, so I (azwj) have Aided you with two layers (lips), so close them and do not speak. And if your genitals dispute for some of what I (azwj) have Prohibited to you, so I (azwj) have Aided you with two layers (legs), so close them and do not come to the Prohibited’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 143)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14955,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:40:17",
        "text": [
          "14719- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ مَوْلًى لِبَنِي هَاشِمٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ ثَلَاثٌ مَنْ كُنَّ فِيهِ فَلَا يُرْجَ خَيْرُهُ مَنْ لَمْ يَسْتَحِ مِنَ الْعَيْبِ وَ يَخْشَ اللَّهَ بِالْغَيْبِ وَ يَرْعَوِ عِنْدَ الشَّيْبِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473397\">H 14719</a> – Ali Bin Ibrahim, from his father, from Ali Bin Asbaat, from a slave of the Clan of Hashim<sup>as</sup>, the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘Three things, which if they are in someone, so there is no hope of goodness from him – The one who is never ashamed of the faults, and (never) fears Allah<sup>azwj</sup> for the Hidden, and (never becomes) pious during old age’. "
          ],
          "en.sarwar": [
            "271. Ali Bin Ibrahim, from his father, from Ali Bin Asbaat, from a slave of the Clan of Hashim (as), the following: Abu Abdullah (a.s.) has said: ‘Three things, which if they are in someone, so there is no hope of goodness from him – The one who is never ashamed of the faults, and (never) fears Allah (azwj) for the Hidden, and (never becomes) pious during old age’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 144)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14956,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:40:18",
        "text": [
          "14720- أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ الْحَجَّالِ قَالَ قُلْتُ لِجَمِيلِ بْنِ دَرَّاجٍ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) إِذَا أَتَاكُمْ شَرِيفُ قَوْمٍ فَأَكْرِمُوهُ قَالَ نَعَمْ قُلْتُ لَهُ وَ مَا الشَّرِيفُ قَالَ قَدْ سَأَلْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) عَنْ ذَلِكَ فَقَالَ الشَّرِيفُ مَنْ كَانَ لَهُ مَالٌ قَالَ قُلْتُ فَمَا الْحَسِيبُ قَالَ الَّذِي يَفْعَلُ الْأَفْعَالَ الْحَسَنَةَ بِمَالِهِ وَ غَيْرِ مَالِهِ قُلْتُ فَمَا الْكَرَمُ قَالَ التَّقْوَى."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473398\">H 14720</a> – Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbaar, from Al-HajjaAl-who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> said to Jameel Bin</span> Darraaj, ‘The Rasool Allah<sup>saww</sup> said: ‘If a respectable person of a people comes, so be kind to him’. He said, ‘Yes’. I said to him, ‘And what is the respectable one?’ He said, ‘I had asked Abu Abdullah<sup>asws</sup> about that, so he<sup>asws</sup> said that the honourable one is the one who is wealthy’. I said, ‘So what is nobility?’ He<sup>asws</sup> said: ‘The one who acts goodly with his wealth and the wealth of others’. I said, ‘So what is the kindness?’ He<sup>asws</sup> said: ‘The piety’."
          ],
          "en.sarwar": [
            "272. Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbaar, from Al-HajjaAl-who said: I said to Jameel Bin Darraaj, ‘The Rasool Allah (saww) said: ‘If a respectable person of a people comes, so be kind to him’. He said, ‘Yes’. I said to him, ‘And what is the respectable one?’ He said, ‘I had asked Abu Abdullah (a.s.) about that, so he (a.s.) said that the honourable one is the one who is wealthy’. I said, ‘So what is nobility?’ He (a.s.) said: ‘The one who acts goodly with his wealth and the wealth of others’. I said, ‘So what is the kindness?’ He (a.s.) said: ‘The piety’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على الشهور</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 144)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14957,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:40:19",
        "text": [
          "14721- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) مَا أَشَدَّ حُزْنَ النِّسَاءِ وَ أَبْعَدَ فِرَاقَ الْمَوْتِ وَ أَشَدُّ مِنْ ذَلِكَ كُلِّهِ فَقْرٌ يَتَمَلَّقُ صَاحِبُهُ ثُمَّ لَا يُعْطَى شَيْئاً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473399\">H 14721</a> – Ali Bin Ibrahim, from his father, from Al-nawfaly, from Al-Sakuny, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said that the Rasool Allah<sup>saww</sup> said: ‘There is nothing more intense than the grief of a woman, nor anything more remote than the separation of the death, and more intense than all of that is poverty. One flatters his companion, who then does not give him anything’.",
            "out of 567"
          ],
          "en.sarwar": [
            "273. Ali Bin Ibrahim, from his father, from Al-nawfaly, from Al-Sakuny, who has narrated the following: Abu Abdullah (a.s.) has said that the Rasool Allah (saww) said: ‘There is nothing more intense than the grief of a woman, nor anything more remote than the separation of the death, and more intense than all of that is poverty. One flatters his companion, who then does not give him anything’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:40",
  "kind": "verse_list"
}