{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 8"}, "path": "/books/al-kafi:8", "titles": {"ar": "الجزء الثامن‏", "en": "Volume Eight"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:8:1", "titles": {"ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;", "en": "The Book - Garden (of Flowers)"}}, {"indexed_titles": {"en": "Chapter 41"}, "path": "/books/al-kafi:8:1:41", "titles": {"ar": "حَدِيثُ يَأْجُوجَ وَ مَأْجُوجَ", "en": "HADEETH OF YAJOUJ (GOG) AND MAJOUJ (MAGOG)"}}], "index": 2302, "local_index": 41, "part_type": "Chapter", "path": "/books/al-kafi:8:1:41", "titles": {"ar": "حَدِيثُ يَأْجُوجَ وَ مَأْجُوجَ", "en": "HADEETH OF YAJOUJ (GOG) AND MAJOUJ (MAGOG)"}, "verse_count": 26, "verse_start_index": 14946, "verses": [{"index": 14947, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14722</span>- الْحُسَيْنُ بْنُ</span> مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنِ الْعَبَّاسِ بْنِ الْعَلَاءِ عَنْ مُجَاهِدٍ عَنِ ابْنِ عَبَّاسٍ قَالَ سُئِلَ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) عَنِ الْخَلْقِ فَقَالَ خَلَقَ اللَّهُ أَلْفاً وَ مِائَتَيْنِ فِي الْبَرِّ وَ أَلْفاً وَ مِائَتَيْنِ فِي الْبَحْرِ وَ أَجْنَاسُ بَنِي آدَمَ سَبْعُونَ جِنْساً وَ النَّاسُ وُلْدُ آدَمَ مَا خَلَا يَأْجُوجَ وَ مَأْجُوجَ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473401\">H 14722</a> – Al-Husayn Bin Muhammad Al-Ashary, from Moalla Bin Muhammad, from Ahmad Bin Muhammad Bin Abdullah, from Al-Abbas Bin Al-A’ala, from Mujahid, from Ibn Abbas who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked Amir-ul-Momineen</span><sup>asws</sup> about the creatures’. He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Created one thousand two hundred (species) in the land, and one thousand two hundred (species) in the sea, and Made seventy species (races) of the Children of Adam<sup>as</sup>, and the people are the Children of Adam<sup>as</sup>, except for the ‘يَأْجُوجَ وَ مَأْجُوجَ’."}]}, {"index": 14948, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:2", "text": "14723- الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ مُثَنًّى عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ [إِنَّ] النَّاسَ طَبَقَاتٌ ثَلَاثٌ طَبَقَةٌ هُمْ مِنَّا وَ نَحْنُ مِنْهُمْ وَ طَبَقَةٌ يَتَزَيَّنُونَ بِنَا وَ طَبَقَةٌ يَأْكُلُ بَعْضُهُمْ بَعْضاً [بِنَا].", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473402\">H 14723</a> – Al-Husayn Bin Muhammad Al-Ashary, from Moalla Bin Muhammad, from Al-Hassan Bin Ali Al-Washaa, from Musanna, from Abu Baseer, who has narrated the following:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said that: ‘The people are of three levels – A level who are from us<sup>asws</sup> and we<sup>asws</sup> are from them; and a level who adorn themselves by us<sup>asws</sup> (our<sup>asws</sup> name); and a level who eat each other by us<sup>asws</sup> (our<sup>asws</sup> name)’. "}]}, {"index": 14949, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:3", "text": "14724- عَنْهُ عَنْ مُعَلًّى عَنِ الْوَشَّاءِ عَنْ عَبْدِ الْكَرِيمِ بْنِ عَمْرٍو عَنْ عَمَّارِ بْنِ مَرْوَانَ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ قَالَ قَالَ أَبُو جَعْفَرٍ (عليه السلام) إِذَا رَأَيْتَ الْفَاقَةَ وَ الْحَاجَةَ قَدْ كَثُرَتْ وَ أَنْكَرَ النَّاسُ بَعْضُهُمْ بَعْضاً فَعِنْدَ ذَلِكَ فَانْتَظِرْ أَمْرَ اللَّهِ عَزَّ وَ جَلَّ قُلْتُ جُعِلْتُ فِدَاكَ هَذِهِ الْفَاقَةُ وَ الْحَاجَةُ قَدْ عَرَفْتُهُمَا فَمَا إِنْكَارُ النَّاسِ بَعْضُهُمْ بَعْضاً قَالَ يَأْتِي الرَّجُلُ مِنْكُمْ أَخَاهُ فَيَسْأَلُهُ الْحَاجَةَ فَيَنْظُرُ إِلَيْهِ بِغَيْرِ الْوَجْهِ الَّذِي كَانَ يَنْظُرُ إِلَيْهِ وَ يُكَلِّمُهُ بِغَيْرِ اللِّسَانِ الَّذِي كَانَ يُكَلِّمُهُ بِهِ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473403\">H 14724</a> – From him, from Moalla, from Al-Washa, from Abdul Kareem Bin Amro, from Ammar Bin Marwaan, from Al-Fazeyl Bin Yasaar who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> said: ‘When you see that poverty and need has abounded (too much), and the people are denying each other, await the Command of Allah<sup>azwj</sup> Mighty and Majestic’. I said, ‘May I be sacrificed for you<sup>asws</sup>, these two – poverty and need, I recognise them, so what is, ‘people denying each other’?’ He<sup>asws</sup> said: ‘A man from among you comes to his brother, so he asks him for his need, and he looks at him with a look with which he did not use to look at him before, and he speaks to him by a tongue (manner) in which he did not speak to him before’."}]}, {"index": 14950, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:4", "text": "14725- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عُبَيْدِ بْنِ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) وُكِّلَ الرِّزْقُ بِالْحُمْقِ وَ وُكِّلَ الْحِرْمَانُ بِالْعَقْلِ وَ وُكِّلَ الْبَلَاءُ بِالصَّبْرِ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473404\">H 14725</a> – A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Ali, from Ubeyd Bin Yahya, from Muhammad Bin Al-Husayn, from Ali Bin Al-Husayn, from his father, from his grandfather who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>mir-ul-Momineen</span><sup>asws</sup> said: ‘The sustenance is allocated to the foolishness, and the deprivation to the intellect, and the affliction to the patience’."}]}, {"index": 14951, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:5", "text": "14726- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْحَمِيدِ الْعَطَّارِ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ عُمَرَ أَخِي عُذَافِرٍ قَالَ دَفَعَ إِلَيَّ إِنْسَانٌ سِتَّمِائَةِ دِرْهَمٍ أَوْ سَبْعَمِائَةِ دِرْهَمٍ لِأَبِي عَبْدِ اللَّهِ (عليه السلام) فَكَانَتْ فِي جُوَالِقِي فَلَمَّا انْتَهَيْتُ إِلَى الْحَفِيرَةِ شُقَّ جُوَالِقِي وَ ذُهِبَ بِجَمِيعِ مَا فِيهِ وَ وَافَقْتُ عَامِلَ الْمَدِينَةِ بِهَا فَقَالَ أَنْتَ الَّذِي شُقَّتْ زَامِلَتُكَ وَ ذُهِبَ بِمَتَاعِكَ فَقُلْتُ نَعَمْ فَقَالَ إِذَا قَدِمْنَا الْمَدِينَةَ فَأْتِنَا حَتَّى أُعَوِّضَكَ \nقَالَ فَلَمَّا انْتَهَيْتُ إِلَى الْمَدِينَةِ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ (عليه السلام) فَقَالَ يَا عُمَرُ شُقَّتْ زَامِلَتُكَ وَ ذُهِبَ بِمَتَاعِكَ فَقُلْتُ نَعَمْ فَقَالَ مَا أَعْطَاكَ اللَّهُ خَيْرٌ مِمَّا أُخِذَ مِنْكَ إِنَّ رَسُولَ اللَّهِ (صلى الله عليه وآله) ضَلَّتْ نَاقَتُهُ فَقَالَ النَّاسُ فِيهَا يُخْبِرُنَا عَنِ السَّمَاءِ وَ لَا يُخْبِرُنَا عَنْ نَاقَتِهِ فَهَبَطَ عَلَيْهِ جَبْرَئِيلُ (عليه السلام) فَقَالَ يَا مُحَمَّدُ نَاقَتُكَ فِي وَادِي كَذَا وَ كَذَا مَلْفُوفٌ خِطَامُهَا بِشَجَرَةِ كَذَا وَ كَذَا \nقَالَ فَصَعِدَ الْمِنْبَرَ فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ وَ قَالَ يَا أَيُّهَا النَّاسُ أَكْثَرْتُمْ عَلَيَّ فِي نَاقَتِي أَلَا وَ مَا أَعْطَانِي اللَّهُ خَيْرٌ مِمَّا أُخِذَ مِنِّي أَلَا وَ إِنَّ نَاقَتِي فِي وَادِي كَذَا وَ كَذَا مَلْفُوفٌ خِطَامُهَا بِشَجَرَةِ كَذَا وَ كَذَا فَابْتَدَرَهَا النَّاسُ فَوَجَدُوهَا كَمَا قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) قَالَ ثُمَّ قَالَ ائْتِ عَامِلَ الْمَدِينَةِ فَتَنَجَّزْ مِنْهُ مَا وَعَدَكَ فَإِنَّمَا هُوَ شَيْ‏ءٌ دَعَاكَ اللَّهُ إِلَيْهِ لَمْ تَطْلُبْهُ مِنْهُ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473405\">H 14726</a> – A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Abdul Hameed Al-Ataar, from Yunus Bin Yaqoub, from Umar the brother of Azaafir who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span> person handed over</span> to me six or seven hundred Dirhams for Abu Abdullah<sup>asws</sup>. So it was in my bag, When I arrived at Al-Hafeera, my bag had split and whatever was in it had gone. I got the officer in Al-Medina to concur with it. He said, ‘Are you the one whose bag split and your belongings were gone?’ I said, ‘Yes’. He said, ‘When you get to the city, come to us and we will compensate you’.\nSo when I arrived at Al-Medina, I came up to Abu Abdullah<sup>asws</sup> who<sup>asws</sup> said, ‘O Umar, your bag was split and your belongings were gone?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘What Allah<sup>azwj</sup> has Given you is better than what has been taken from you. The she-camel of the Rasool Allah<sup>saww</sup> got lost, so the people said regarding it, ‘He<sup>saww</sup> informs us about the sky and he<sup>saww</sup> cannot inform us about his<sup>saww</sup> she-camel’. Jibraeel descended and said: ‘O Muhammad<sup>saww</sup>! Your<sup>saww</sup> she-camel is in such and such a valley. Its bridle has been entangled with such and such a tree’.\nHe<sup>asws</sup> said: ‘So he<sup>saww</sup> ascended the Pulpit. He<sup>saww</sup> Praised Allah<sup>azwj</sup> and Extolled Him<sup>azwj</sup> and said: ‘O you people! You spoke a great deal to me<sup>saww</sup> regarding my<sup>saww</sup> she-camel. Indeed! And what Allah<sup>azwj</sup> has Given me<sup>saww</sup> is better than what was taken from me<sup>saww</sup>. Indeed! My<sup>saww</sup> she-camel is in such a such a valley. Its bridle has been entangled with such and such a tree’. So the people rushed towards it and found her as the Rasool Allah<sup>saww</sup> had said’. Then he<sup>asws</sup> said: ‘Go to the office bearer of Al-Medina and acquire from him what he has promised you, for it is something, which Allah<sup>azwj</sup> has Invited you to it. You never demanded it from him’."}]}, {"index": 14952, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:6", "text": "14727- سَهْلٌ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْحَمِيدِ عَنْ يُونُسَ عَنْ شُعَيْبٍ الْعَقَرْقُوفِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ (عليه السلام) شَيْ‏ءٌ يُرْوَى عَنْ أَبِي ذَرٍّ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ كَانَ يَقُولُ ثَلَاثٌ يُبْغِضُهَا النَّاسُ وَ أَنَا أُحِبُّهَا أُحِبُّ الْمَوْتَ وَ أُحِبُّ الْفَقْرَ وَ أُحِبُّ الْبَلَاءَ فَقَالَ إِنَّ هَذَا لَيْسَ عَلَى مَا يَرْوُونَ إِنَّمَا عَنَى الْمَوْتُ فِي طَاعَةِ اللَّهِ أَحَبُّ إِلَيَّ مِنَ الْحَيَاةِ فِي مَعْصِيَةِ اللَّهِ وَ الْبَلَاءُ فِي طَاعَةِ اللَّهِ أَحَبُّ إِلَيَّ مِنَ الصِّحَّةِ فِي مَعْصِيَةِ اللَّهِ وَ الْفَقْرُ فِي طَاعَةِ اللَّهِ أَحَبُّ إِلَيَّ مِنَ الْغِنَى فِي مَعْصِيَةِ اللَّهِ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473406\">H 14727</a> – Sahl, from Muhammad Bin Abdul Hameed, from Yunus, from Shuayb Al-Aqarqufy who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> said to Abu Abdullah</span><sup>asws</sup> something which had been reported from Abu Dharr<sup>ar</sup>, that he<sup>ar</sup> had said, ‘Three things which the people hate but I<sup>ar</sup> love those. I<sup>ar</sup> love the death, and I<sup>ar</sup> love the poverty, and I<sup>ar</sup> love the afflictions’. So he<sup>asws</sup> said: ‘This is not as how they are reporting it. But, rather he<sup>ar</sup> meant, ‘The death in the obedience to Allah<sup>azwj</sup> is more beloved to me<sup>ar</sup> from the life in disobedience to Allah<sup>azwj</sup>, and the afflictions in the obedience to Allah<sup>azwj</sup> is more beloved to me<sup>ar</sup> from the health in disobedience to Allah<sup>azwj</sup>, and the poverty in obedience to Allah<sup>azwj</sup> is more beloved to me<sup>ar</sup> from the self-sufficiency in disobedience to Allah<sup>azwj</sup>’."}]}, {"index": 14953, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:7", "text": "14728- سَهْلُ بْنُ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْحَمِيدِ عَنْ يُونُسَ عَنْ عَلِيِّ بْنِ عِيسَى الْقَمَّاطِ عَنْ عَمِّهِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ هَبَطَ جَبْرَئِيلُ (عليه السلام) عَلَى رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ رَسُولُ اللَّهِ (صلى الله عليه وآله) كَئِيبٌ حَزِينٌ فَقَالَ يَا رَسُولَ اللَّهِ مَا لِي أَرَاكَ كَئِيباً حَزِيناً فَقَالَ إِنِّي رَأَيْتُ اللَّيْلَةَ رُؤْيَا قَالَ وَ مَا الَّذِي رَأَيْتَ قَالَ رَأَيْتُ بَنِي أُمَيَّةَ يَصْعَدُونَ الْمَنَابِرَ وَ يَنْزِلُونَ مِنْهَا قَالَ وَ الَّذِي بَعَثَكَ بِالْحَقِّ نَبِيّاً مَا عَلِمْتُ بِشَيْ‏ءٍ مِنْ هَذَا \nوَ صَعِدَ جَبْرَئِيلُ (عليه السلام) إِلَى السَّمَاءِ ثُمَّ أَهْبَطَهُ اللَّهُ جَلَّ ذِكْرُهُ بِآيٍ مِنَ الْقُرْآنِ يُعَزِّيهِ بِهَا قَوْلِهِ أَ فَرَأَيْتَ إِنْ مَتَّعْناهُمْ سِنِينَ ثُمَّ جاءَهُمْ ما كانُوا يُوعَدُونَ ما أَغْنى عَنْهُمْ ما كانُوا يُمَتَّعُونَ وَ أَنْزَلَ اللَّهُ جَلَّ ذِكْرُهُ إِنَّا أَنْزَلْناهُ فِي لَيْلَةِ الْقَدْرِ وَ ما أَدْراكَ ما لَيْلَةُ الْقَدْرِ لَيْلَةُ الْقَدْرِ خَيْرٌ مِنْ أَلْفِ شَهْرٍ لِلْقَوْمِ فَجَعَلَ اللَّهُ عَزَّ وَ جَلَّ لَيْلَةَ الْقَدْرِ لِرَسُولِهِ خَيْراً مِنْ أَلْفِ شَهْر.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473407\">H 14728</a> – Sahl Bin Ziyad, from Muhammad Bin Abdul Hameed, from yunus, from Ali Bin Isa Al-Qammaat, from his uncle who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘Jibraeel descended upon the Rasool Allah<sup>saww</sup> whilst the Rasool Allah<sup>saww</sup> was gloomy and sad. So he said; ‘O Rasool Allah<sup>saww</sup>, what is it that I see you<sup>saww</sup> to be gloomy and sad?’ He<sup>saww</sup> said: ‘I<sup>saww</sup> had a dream last night’. He said: ‘And what is it that you<sup>saww</sup> saw?’ He<sup>saww</sup> said: ‘I<sup>saww</sup> saw the Clan of Umayya ascending the Pulpit and descending from it’. He said: ‘And by the One Who<sup>azwj</sup> Sent you<sup>saww</sup> as a Prophet<sup>saww</sup> with the Truth, I do not know anything about this’.\nAnd Jibraeel ascended to the sky, then Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Mention, Made him descend with a Verse from the Quran to comfort him<sup>saww</sup> by: <span class=\"ibTxt\">“[26:205] Have you then considered if We let them enjoy themselves for years, [26:206] Then there comes to them that with which they are threatened [26:207] That which they were made to enjoy shall not avail them?”</span>. And Allah<sup>azwj</sup> Revealed: <span class=\"ibTxt\">“[97:1] We have indeed revealed this (Message) in the Night of Power [97:2] And what will explain to thee what the night of power is? [97:3] The Night of Power is better than a thousand months”</span>. So Allah<sup>azwj</sup> Made the Night of Power for His<sup>azwj</sup> Messenger<sup>saww</sup> to be better than a thousand months (of the Clan of Umayya)’."}]}, {"index": 14954, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:8", "text": "14729- سَهْلٌ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْحَمِيدِ عَنْ يُونُسَ عَنْ عَبْدِ الْأَعْلَى قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَلْيَحْذَرِ الَّذِينَ يُخالِفُونَ عَنْ أَمْرِهِ أَنْ تُصِيبَهُمْ فِتْنَةٌ أَوْ يُصِيبَهُمْ عَذابٌ أَلِيمٌ قَالَ فِتْنَةٌ فِي دِينِهِ أَوْ جِرَاحَةٌ لَا يَأْجُرُهُ اللَّهُ عَلَيْهَا.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473408\">H 14729</a> – Sahl, from Muhammad Bin Abdul Hameed, from yunus, from Abdul A’ala who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked Abu Abdullah</span><sup>a</sup><sup>sws</sup> about the Statement of Allah<sup>azwj</sup>: <span class=\"ibTxt\">“[24:63] therefore let those beware who go against his order lest a trial afflict them or there befall them a painful chastisement”</span>. Imam<sup>asws</sup> said: (it’s) ‘فِتْنَةٌ’ Strife in His<sup>azwj</sup> Religion or oppression for which Allah<sup>azwj</sup> does not Reward’."}]}, {"index": 14955, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:9", "text": "14730- سَهْلُ بْنُ زِيَادٍ عَنْ مُحَمَّدٍ عَنْ يُونُسَ عَنْ عَبْدِ الْأَعْلَى قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ (عليه السلام) إِنَّ شِيعَتَكَ قَدْ تَبَاغَضُوا وَ شَنِئَ بَعْضُهُمْ بَعْضاً فَلَوْ نَظَرْتَ جُعِلْتُ فِدَاكَ فِي أَمْرِهِمْ فَقَالَ لَقَدْ هَمَمْتُ أَنْ أَكْتُبَ كِتَاباً لَا يَخْتَلِفُ عَلَيَّ مِنْهُمُ اثْنَانِ قَالَ فَقُلْتُ مَا كُنَّا قَطُّ أَحْوَجَ إِلَى ذَلِكَ مِنَّا الْيَوْمَ قَالَ ثُمَّ قَالَ أَنَّى هَذَا وَ مَرْوَانُ وَ ابْنُ ذَرٍّ قَالَ فَظَنَنْتُ أَنَّهُ قَدْ مَنَعَنِي ذَلِكَ \nقَالَ فَقُمْتُ مِنْ عِنْدِهِ فَدَخَلْتُ عَلَى إِسْمَاعِيلَ فَقُلْتُ يَا أَبَا مُحَمَّدٍ إِنِّي ذَكَرْتُ لِأَبِيكَ اخْتِلَافَ شِيعَتِهِ وَ تَبَاغُضَهُمْ فَقَالَ لَقَدْ هَمَمْتُ أَنْ أَكْتُبَ كِتَاباً لَا يَخْتَلِفُ عَلَيَّ مِنْهُمُ اثْنَانِ قَالَ فَقَالَ مَا قَالَ مَرْوَانُ وَ ابْنُ ذَرٍّ قُلْتُ بَلَى قَالَ يَا عَبْدَ الْأَعْلَى إِنَّ لَكُمْ عَلَيْنَا لَحَقّاً كَحَقِّنَا عَلَيْكُمْ وَ اللَّهِ مَا أَنْتُمْ إِلَيْنَا بِحُقُوقِنَا أَسْرَعَ مِنَّا إِلَيْكُمْ ثُمَّ قَالَ سَأَنْظُرُ\nثُمَّ قَالَ يَا عَبْدَ الْأَعْلَى مَا عَلَى قَوْمٍ إِذَا كَانَ أَمْرُهُمْ أَمْراً وَاحِداً مُتَوَجِّهِينَ إِلَى رَجُلٍ وَاحِدٍ يَأْخُذُونَ عَنْهُ أَلَّا يَخْتَلِفُوا عَلَيْهِ وَ يُسْنِدُوا أَمْرَهُمْ إِلَيْهِ يَا عَبْدَ الْأَعْلَى إِنَّهُ لَيْسَ يَنْبَغِي لِلْمُؤْمِنِ وَ قَدْ سَبَقَهُ أَخُوهُ إِلَى دَرَجَةٍ مِنْ دَرَجَاتِ الْجَنَّةِ أَنْ يَجْذِبَهُ عَنْ مَكَانِهِ الَّذِي هُوَ بِهِ وَ لَا يَنْبَغِي لِهَذَا الْآخَرِ الَّذِي لَمْ يَبْلُغْ أَنْ يَدْفَعَ فِي صَدْرِ الَّذِي لَمْ يَلْحَقْ بِهِ وَ لَكِنْ يَسْتَلْحِقُ إِلَيْهِ وَ يَسْتَغْفِرُ اللَّهَ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473409\">H 14730</a> – Sahl Bin Ziyad, from Muhammad, from Yunus, from Abdul A’ala who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> said to Abu Abdullah</span><sup>asws</sup> that, ‘May I be sacrificed for you<sup>asws</sup>, your<sup>asws</sup> Shites hate and dispel each other. If you<sup>asws</sup> could look into this affair of theirs’. So he<sup>asws</sup> said: ‘I am thinking of writing a document so that no two of them would differ’. I said, ‘We have never been more needy of it than we are today’. Then he<sup>asws</sup> said: ‘This (will not settle the matter between) Marwaan and Ibn Dharr’. I thought that he<sup>asws</sup> had prevented me from that.\nI stood up from his<sup>asws</sup> presence, so I came up to Ismail. I said, ‘O Abu Muhammad! I mentioned to your father<sup>asws</sup> the differing of his<sup>asws</sup> Shites and their hatred (towards each other). So he<sup>asws</sup> said: ‘I<sup>asws</sup> am thinking of writing a book so that no two of them would differ’. He said, ‘What Marwaan and Ibn Dharr have said?’ I said, ‘Yes’. He said, ‘O Abdul A’ala! You all have rights over us as we have rights over you all. By Allah<sup>azwj</sup>, you are not quicker to us for the rights than we are to you’. Then he said, ‘I will look into it’. \nThen said: ‘O Abdul A’ala! What is wrong with a people if their matter was one that they would turn their attention to one man<sup>asws</sup>, taking (instructions) from him<sup>asws</sup> and not oppose him<sup>asws</sup>, and assign their matters to him<sup>asws</sup>?’ O Abdul A’ala! It is not befitting for the Believer that if his brother has preceded him to a Level from the Levels of the Paradise that he should pull him back from his place, which he is in. And it does not befit this other one who has not reached (to his level) that he should push back his chest, but he should hold his hand and make him join him, and seek Forgiveness from Allah<sup>azwj</sup>’."}]}, {"index": 14956, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:10", "text": "14731- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ أَبِي خَالِدٍ الْكَابُلِيِّ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ ضَرَبَ اللَّهُ مَثَلًا رَجُلًا فِيهِ شُرَكاءُ مُتَشاكِسُونَ وَ رَجُلًا سَلَماً لِرَجُلٍ هَلْ يَسْتَوِيانِ مَثَلًا قَالَ أَمَّا الَّذِي فِيهِ شُرَكَاءُ مُتَشَاكِسُونَ فَلِأَنَّ الْأَوَّلَ يَجْمَعُ الْمُتَفَرِّقُونَ وَلَايَتَهُ وَ هُمْ فِي ذَلِكَ يَلْعَنُ بَعْضُهُمْ بَعْضاً وَ يَبْرَأُ بَعْضُهُمْ مِنْ بَعْضٍ فَأَمَّا رَجُلٌ سَلَمُ رَجُلٍ فَإِنَّهُ الْأَوَّلُ حَقّاً وَ شِيعَتُهُ \nثُمَّ قَالَ إِنَّ الْيَهُودَ تَفَرَّقُوا مِنْ بَعْدِ مُوسَى (عليه السلام) عَلَى إِحْدَى وَ سَبْعِينَ فِرْقَةً مِنْهَا فِرْقَةٌ فِي الْجَنَّةِ وَ سَبْعُونَ فِرْقَةً فِي النَّارِ وَ تَفَرَّقَتِ النَّصَارَى بَعْدَ عِيسَى (عليه السلام) عَلَى اثْنَتَيْنِ وَ سَبْعِينَ فِرْقَةً فِرْقَةٌ مِنْهَا فِي الْجَنَّةِ وَ إِحْدَى وَ سَبْعُونَ فِي النَّارِ وَ تَفَرَّقَتْ هَذِهِ الْأُمَّةُ بَعْدَ نَبِيِّهَا (صلى الله عليه وآله) عَلَى ثَلَاثٍ وَ سَبْعِينَ فِرْقَةً اثْنَتَانِ وَ سَبْعُونَ فِرْقَةً فِي النَّارِ وَ فِرْقَةٌ فِي الْجَنَّةِ وَ مِنَ الثَّلَاثِ وَ سَبْعِينَ فِرْقَةً ثَلَاثَ عَشْرَةَ فِرْقَةً تَنْتَحِلُ وَلَايَتَنَا وَ مَوَدَّتَنَا اثْنَتَا عَشْرَةَ فِرْقَةً مِنْهَا فِي النَّارِ وَ فِرْقَةٌ فِي الْجَنَّةِ وَ سِتُّونَ فِرْقَةً مِنْ سَائِرِ النَّاسِ فِي النَّارِ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473410\">H 14731</a> – Muhammad Bin yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from Jameel Bin Salih, from Abu Khalid Al-Kabuly, who has narrated the following:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> having said: <span class=\"ibTxt\">“[39:29] Allah sets forth an example: There is a slave in whom are (several) partners differing with one another, and there is another slave wholly owned by one man. Are the two alike in condition?”</span> He<sup>asws</sup> said: ‘But rather it is the one who has associates with regards to whom they doubt because he was the first one who gathered them for his leadership, so they differed regarding it and some of them cursed each other for that, and some of them distanced themselves from each other. As for the man<sup>asws</sup> of peace, he is the first one for the ‘حَقّاً’ Just and his Shites’.  \nThen he<sup>asws</sup> said: ‘The Jews differed, from after Musa<sup>as</sup> and separated into seventy-one sects, one of which will be in the Paradise and seventy sects would be in the Fire. And the Christians separated, from after Isa<sup>as</sup> into seventy-two sects, one of which would be in the Paradise and seventy-one of the sects would be in the Fire. And this community will separate after its Prophet<sup>saww</sup> into seventy-three sects. Seventy-two sects would be in the Fire and one sect would be in the Paradise. And from these seventy-three sects, thirteen would be of those who claim to be in our<sup>asws</sup> Wilayah and show affection to us<sup>asws</sup>. Twelve sects from these would be in the Fire and one sect would be in the Paradise. And sixty sects from the rest of the people would be in the Fire’."}]}, {"index": 14957, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:11", "text": "14732- وَ عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ لَمْ تَزَلْ دَوْلَةُ الْبَاطِلِ طَوِيلَةً وَ دَوْلَةُ الْحَقِّ قَصِيرَةً.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473411\">H 14732</a> - And from him, from Ahmad Bin Muhammad, from Ibn Mahboub, from Abdullah Bin Sinan, who has said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said; ‘The government of the falsehood does not decline for a long time, and the government of the truth lasts for a short while’."}]}, {"index": 14958, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:12", "text": "14733- وَ عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ يَعْقُوبَ السَّرَّاجِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ (عليه السلام) مَتَى فَرَجُ شِيعَتِكُمْ قَالَ فَقَالَ إِذَا اخْتَلَفَ وُلْدُ الْعَبَّاسِ وَ وَهَى سُلْطَانُهُمْ وَ طَمِعَ فِيهِمْ مَنْ لَمْ يَكُنْ يَطْمَعُ فِيهِمْ وَ خَلَعَتِ الْعَرَبُ أَعِنَّتَهَا وَ رَفَعَ كُلُّ ذِي صِيصِيَةٍ صِيصِيَتَهُ وَ ظَهَرَ الشَّامِيُّ وَ أَقْبَلَ الْيَمَانِيُّ وَ تَحَرَّكَ الْحَسَنِيُّ وَ خَرَجَ صَاحِبُ هَذَا الْأَمْرِ مِنَ الْمَدِينَةِ إِلَى مَكَّةَ بِتُرَاثِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) \nفَقُلْتُ مَا تُرَاثُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) قَالَ سَيْفُ رَسُولِ اللَّهِ وَ دِرْعُهُ وَ عِمَامَتُهُ وَ بُرْدُهُ وَ قَضِيبُهُ وَ رَايَتُهُ وَ لَامَتُهُ وَ سَرْجُهُ حَتَّى يَنْزِلَ مَكَّةَ فَيُخْرِجَ السَّيْفَ مِنْ غِمْدِهِ وَ يَلْبَسَ الدِّرْعَ وَ يَنْشُرَ الرَّايَةَ وَ الْبُرْدَةَ وَ الْعِمَامَةَ وَ يَتَنَاوَلَ الْقَضِيبَ بِيَدِهِ وَ يَسْتَأْذِنَ اللَّهَ فِي ظُهُورِهِ \nفَيَطَّلِعُ عَلَى ذَلِكَ بَعْضُ مَوَالِيهِ فَيَأْتِي الْحَسَنِيَّ فَيُخْبِرُهُ الْخَبَرَ فَيَبْتَدِرُ الْحَسَنِيُّ إِلَى الْخُرُوجِ فَيَثِبُ عَلَيْهِ أَهْلُ مَكَّةَ فَيَقْتُلُونَهُ وَ يَبْعَثُونَ بِرَأْسِهِ إِلَى الشَّامِيِّ فَيَظْهَرُ عِنْدَ ذَلِكَ صَاحِبُ هَذَا الْأَمْرِ فَيُبَايِعُهُ النَّاسُ وَ يَتَّبِعُونَهُ وَ يَبْعَثُ الشَّامِيُّ عِنْدَ ذَلِكَ جَيْشاً إِلَى الْمَدِينَةِ فَيُهْلِكُهُمُ اللَّهُ عَزَّ وَ جَلَّ دُونَهَا وَ يَهْرُبُ يَوْمَئِذٍ مَنْ كَانَ بِالْمَدِينَةِ مِنْ وُلْدِ عَلِيٍّ ( عليه السلام ) إِلَى مَكَّةَ فَيَلْحَقُونَ بِصَاحِبِ هَذَا الْأَمْرِ وَ يُقْبِلُ صَاحِبُ هَذَا الْأَمْرِ نَحْوَ الْعِرَاقِ وَ يَبْعَثُ جَيْشاً إِلَى الْمَدِينَةِ فَيَأْمَنُ أَهْلُهَا وَ يَرْجِعُونَ إِلَيْهَا.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473412\">H 14733</a> – And from him, from Ahmad Bin Muhammad, from Ibn Mahboub, from Yaqoub Al-Sarraaj who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> said to Abu Abdullah</span><sup>asws</sup>, ‘When will there be relief for your<sup>asws</sup> Shites?’ He<sup>asws</sup> said: ‘When the children of Al-Abbas differ regarding their authority, and he who was not greedy for it before, covets it, and the Arabs remove their reins, and every one with spurs (horsemen) battles for it, and Al-Shamy (The Syrian) appears, and Al-Yamany (The Yemenite) comes forward, and Al-Hasany moves (with a movement), and the Master<sup>asws</sup> of this Command will come out from Al-Medina to Al-Makkah with the inheritance of the Rasool Allah<sup>saww</sup>’. \nSo I said, ‘What inheritance of the Rasool Allah<sup>saww</sup>?’ He<sup>asws</sup> said: ‘Sword of the Rasool Allah<sup>saww</sup>, and his<sup>saww</sup> armor, and his<sup>saww</sup> turban, and his<sup>saww</sup> gown, and his<sup>saww</sup> staff, and his<sup>saww</sup> banner, and his<sup>saww</sup> helmet, and his<sup>saww</sup> saddle, until he<sup>asws</sup> descends upon Makkah. So he<sup>asws</sup> will take out the sword from its sheath, and put on the armor, and display the banner, and (wear) the gown and the turban, and grab the staff by his<sup>asws</sup> hand, and seek Permission of Allah<sup>azwj</sup> for his<sup>asws</sup> appearance.\nThat will be announced to some of his<sup>asws</sup> friends. Al-Hassany would come. So he<sup>asws</sup> would inform him of the news. Al-Hassany would initiate the coming out (Al-Khurouj). The people of Makkah would pounce upon him. So they will kill him and send his head to Al-Shamy (The Syrian). During that, the Master<sup>asws</sup> of this Command will appear. So the people would pledge their allegiances to him<sup>asws</sup> and follow him<sup>asws</sup>. And Al-Shamy (The Syrian) would send an army to Al-Medina. So Allah<sup>azwj</sup> Mighty and Majestic would Destroy them before it (gets there). On that day, those from the children of Ali<sup>asws</sup> who would be in Al-Medina would flee to Makkah. So they would join up with the Master<sup>asws</sup> of this Command. And the Master<sup>asws</sup> of this Command would go towards Al-Iraq and send his<sup>asws</sup> army to Al-Medina. Its people would express belief and they would return to it’."}]}, {"index": 14959, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:13", "text": "14734- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ بَعْضِ أَصْحَابِ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ خَرَجَ إِلَيْنَا أَبُو عَبْدِ اللَّهِ (عليه السلام) وَ هُوَ مُغْضَبٌ فَقَالَ إِنِّي خَرَجْتُ آنِفاً فِي حَاجَةٍ فَتَعَرَّضَ لِي بَعْضُ سُودَانِ الْمَدِينَةِ فَهَتَفَ بِي لَبَّيْكَ يَا جَعْفَرَ بْنَ مُحَمَّدٍ لَبَّيْكَ فَرَجَعْتُ عَوْدِي عَلَى بَدْئِي إِلَى مَنْزِلِي خَائِفاً ذَعِراً مِمَّا قَالَ حَتَّى سَجَدْتُ فِي مَسْجِدِي لِرَبِّي وَ عَفَّرْتُ لَهُ وَجْهِي وَ ذَلَّلْتُ لَهُ نَفْسِي وَ بَرِئْتُ إِلَيْهِ مِمَّا هَتَفَ بِي وَ لَوْ أَنَّ عِيسَى ابْنَ مَرْيَمَ عَدَا مَا قَالَ اللَّهُ فِيهِ إِذاً لَصَمَّ صَمّاً لَا يَسْمَعُ بَعْدَهُ أَبَداً وَ عَمِيَ عَمًى لَا يُبْصِرُ بَعْدَهُ أَبَداً وَ خَرِسَ خَرْساً لَا يَتَكَلَّمُ بَعْدَهُ أَبَداً ثُمَّ قَالَ لَعَنَ اللَّهُ أَبَا الْخَطَّابِ وَ قَتَلَهُ بِالْحَدِيدِ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473413\">H 14734</a> – A number of our companions, from Ahmad Bin Muhammad, from Ibn Mahboub, from Maalik bin Atiyya, who has narrated the following:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-s\">S</span>ome of the companions</span> of Abu Abdullah<sup>asws</sup> has reported that Abu Abdullah<sup>asws</sup> came out to us and he<sup>asws</sup> was ‘مُغْضَبٌ’ angry. He<sup>asws</sup> said: ‘I<sup>asws</sup> went out for some need, so some black people of Al-Medina presented themselves to me<sup>asws</sup>. They shouted at me<sup>asws</sup> as: ‘لَبَّيْكَ يَا جَعْفَرَ بْنَ مُحَمَّدٍ لَبَّيْكَ’  ‘Here I am (Labbaik) O Ja’far Bin Muhammad<sup>asws</sup>, here I am (Labbaik)!’ So I<sup>asws</sup> returned back to my<sup>asws</sup> house, in a fearful panic from what they had said, until I<sup>asws</sup> prostrated to my<sup>asws</sup> Lord<sup>azwj</sup> and rubbed my<sup>asws</sup> face to Him<sup>azwj</sup>, and humbled myself<sup>asws</sup> to Him<sup>azwj</sup>, and distanced myself<sup>asws</sup> (from them) to Him<sup>azwj</sup> from what they had shouted to me<sup>asws</sup>. \nAnd if Isa<sup>as</sup> Ibn Maryam<sup>as</sup> had added anything to what Allah<sup>azwj</sup> had Said regarding him<sup>as</sup>, then he<sup>as</sup> would have become deaf and would not have been able to hear anything after that ever, and become blinded and would not have been able to visualise anything after that ever, and would have become dumb and would not have been able to speak anything after that ever’. Then he<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> Curse Abu Al-Khattaab and kill him with the iron’<a id=\"_ftnref25\"></a><sup>[25]</sup>."}]}, {"index": 14960, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:14", "text": "14735- عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ جَهْمِ بْنِ أَبِي جُهَيْمَةَ عَنْ بَعْضِ مَوَالِي أَبِي الْحَسَنِ (عليه السلام) قَالَ كَانَ عِنْدَ أَبِي الْحَسَنِ مُوسَى (عليه السلام) رَجُلٌ مِنْ قُرَيْشٍ فَجَعَلَ يَذْكُرُ قُرَيْشاً وَ الْعَرَبَ فَقَالَ لَهُ أَبُو الْحَسَنِ (عليه السلام) عِنْدَ ذَلِكَ دَعْ هَذَا النَّاسُ ثَلَاثَةٌ عَرَبِيٌّ وَ مَوْلًى وَ عِلْجٌ فَنَحْنُ الْعَرَبُ وَ شِيعَتُنَا الْمَوَالِي وَ مَنْ لَمْ يَكُنْ عَلَى مِثْلِ مَا نَحْنُ عَلَيْهِ فَهُوَ عِلْجٌ فَقَالَ الْقُرَشِيُّ تَقُولُ هَذَا يَا أَبَا الْحَسَنِ فَأَيْنَ أَفْخَاذُ قُرَيْشٍ وَ الْعَرَبِ فَقَالَ أَبُو الْحَسَنِ (عليه السلام) هُوَ مَا قُلْتُ لَكَ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473414\">H 14735</a> – From him, from Ahmad Bin Muhammad, from Ibn Mahboub, from jahm Bin Abu Juheyma, who has narrated the following:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span> slave of Abu Al-Hassan</span><sup>asws</sup> has said, ‘In the presence of Abu Al-Hassan Al-Musa<sup>asws</sup> was a man from Qureysh, who went on to mention the Qureysh and the Arabs. Abu Al-Hassan<sup>asws</sup> said during that; ‘Leave that! These people are three (types) – Arabs, and ‘مَوْلًى’ friends and faithless. So we<sup>asws</sup> are the Arabs, and our<sup>asws</sup> Shites are the friends, and the one who is not upon the like of what we are on, so he is faithless’. So the Qureyshi said, ‘O Abu Al-Hassan<sup>asws</sup>! You<sup>asws</sup> are saying this, so where are the prided ones of Qureysh and the Arabs?’ So Abu Al-Hassan<sup>asws</sup> said: ‘It is how I<sup>asws</sup> have said it to you’."}]}, {"index": 14961, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:15", "text": "14736- عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْأَحْوَلِ عَنْ سَلَّامِ بْنِ الْمُسْتَنِيرِ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ (عليه السلام) يُحَدِّثُ إِذَا قَامَ الْقَائِمُ عَرَضَ الْإِيمَانَ عَلَى كُلِّ نَاصِبٍ فَإِنْ دَخَلَ فِيهِ بِحَقِيقَةٍ وَ إِلَّا ضَرَبَ عُنُقَهُ أَوْ يُؤَدِّيَ الْجِزْيَةَ كَمَا يُؤَدِّيهَا الْيَوْمَ أَهْلُ الذِّمَّةِ وَ يَشُدُّ عَلَى وَسَطِهِ الْهِمْيَانَ وَ يُخْرِجُهُمْ مِنَ الْأَمْصَارِ إِلَى السَّوَادِ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473415\">H 14736</a> – From him, from Ahmad Bin Muhammad, from Ibn Mahboub, from Al-Ahowl, from Sallaam Bin Al-Mustaneer who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Ja’far</span><sup>asws</sup> narrate: ‘When Al-Qaim<sup>asws</sup> makes the stand, he<sup>asws</sup> will present the Faith to every Hostile One (Nasibi). Either they enter in it truly or else his neck would be struck, or he will have to hand over the tax just as the people under responsibility (Ahl Al-Dhimma – Christians and Jews) pay today, and tighten their waist and throw them out from the cities to the dark places’."}]}, {"index": 14962, "local_index": 16, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:16", "text": "14737- الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ عَلِيِّ بْنِ مُحَمَّدِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمِ بْنِ أَبِي سَلَمَةَ عَنْ مُحَمَّدِ بْنِ سَعِيدِ بْنِ غَزْوَانَ عَنْ مُحَمَّدِ بْنِ بُنَانٍ عَنْ أَبِي مَرْيَمَ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ قَالَ أَبِي يَوْماً وَ عِنْدَهُ أَصْحَابُهُ مَنْ مِنْكُمْ تَطِيبُ نَفْسُهُ أَنْ يَأْخُذَ جَمْرَةً فِي كَفِّهِ فَيُمْسِكَهَا حَتَّى تَطْفَأَ قَالَ فَكَاعَ النَّاسُ كُلُّهُمْ وَ نَكَلُوا فَقُمْتُ وَ قُلْتُ يَا أَبَةِ أَ تَأْمُرُ أَنْ أَفْعَلَ فَقَالَ لَيْسَ إِيَّاكَ عَنَيْتُ إِنَّمَا أَنْتَ مِنِّي وَ أَنَا مِنْكَ بَلْ إِيَّاهُمْ أَرَدْتُ \nقَالَ وَ كَرَّرَهَا ثَلَاثاً ثُمَّ قَالَ مَا أَكْثَرَ الْوَصْفَ وَ أَقَلَّ الْفِعْلَ إِنَّ أَهْلَ الْفِعْلِ قَلِيلٌ إِنَّ أَهْلَ الْفِعْلِ قَلِيلٌ أَلَا وَ إِنَّا لَنَعْرِفُ أَهْلَ الْفِعْلِ وَ الْوَصْفِ مَعاً وَ مَا كَانَ هَذَا مِنَّا تَعَامِياً عَلَيْكُمْ بَلْ لِنَبْلُوَ أَخْبَارَكُمْ وَ نَكْتُبَ آثَارَكُمْ \nفَقَالَ وَ اللَّهِ لَكَأَنَّمَا مَادَتْ بِهِمُ الْأَرْضُ حَيَاءً مِمَّا قَالَ حَتَّى إِنِّي لَأَنْظُرُ إِلَى الرَّجُلِ مِنْهُمْ يَرْفَضُّ عَرَقاً مَا يَرْفَعُ عَيْنَيْهِ مِنَ الْأَرْضِ فَلَمَّا رَأَى ذَلِكَ مِنْهُمْ قَالَ رَحِمَكُمُ اللَّهُ فَمَا أَرَدْتُ إِلَّا خَيْراً إِنَّ الْجَنَّةَ دَرَجَاتٌ فَدَرَجَةُ أَهْلِ الْفِعْلِ لَا يُدْرِكُهَا أَحَدٌ مِنْ أَهْلِ الْقَوْلِ وَ دَرَجَةُ أَهْلِ الْقَوْلِ لَا يُدْرِكُهَا غَيْرُهُمْ قَالَ فَوَ اللَّهِ لَكَأَنَّمَا نُشِطُوا مِنْ عِقَالٍ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473416\">H 14737</a> – Al-Husayn Bin Muhammad Al-Ashary, from Ali Bin Muhammad Bin Saeed, from Muhammad Bin Muslim Bin Abu Salma, from Muhammad Bin Saeed Bin Gazwaan, from Muhammad bin Bunaan, from Abu Maryam, who has narrated the following:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> says that one day my<sup>asws</sup> father<sup>asws</sup> said in the presence of his<sup>asws</sup> companions: ‘Which one of you is good enough to hold a burning ember in his hand and extinguish it by squeezing it?’ All the people were silent and stressed out. So I<sup>asws</sup> stood up and said: ‘O father<sup>asws</sup>! Do you<sup>asws</sup> command me<sup>asws</sup> to do it?’ So he<sup>asws</sup> said: ‘It is not you<sup>asws</sup> I<sup>asws</sup> meant, but rather, you<sup>asws</sup> are from me<sup>asws</sup> and I<sup>asws</sup> am from you<sup>asws</sup>, but it is they that I<sup>asws</sup> have intended by it’.\nHe<sup>asws</sup> said: ‘And he<sup>asws</sup> repeated it thrice, then said: ‘How much is the description (talk) and how little the action. The people of action are few indeed. And we<sup>asws</sup> recognise the people of action and the description (talk) both, and this was only a pretence of blindness from us<sup>asws</sup> towards you. But, your news reaches us<sup>asws</sup> and we<sup>asws</sup> write down your impressions’. \nThen he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! It is as if the earth has shaken them with the shame from what he<sup>asws</sup> had said to the extent that I<sup>asws</sup> looked at a man from among them sweating profusely and he was not raising his head from the ground’. So when he<sup>asws</sup> saw that (situation) among them, he<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> have Mercy on you all, for I<sup>asws</sup> have not intended except the good. In the Paradise there are Levels, so the level of the people of action cannot be understood by anyone from the people of the talk. And the Level of the people of the talk cannot be understood by others’. He<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>, it was as if they had been released from the chains’."}]}, {"index": 14963, "local_index": 17, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:17", "text": "14738- وَ بِهَذَا الْإِسْنَادِ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ الصُّوفِيِّ قَالَ حَدَّثَنِي مُوسَى بْنُ بَكْرٍ الْوَاسِطِيُّ قَالَ قَالَ لِي أَبُو الْحَسَنِ (عليه السلام) لَوْ مَيَّزْتُ شِيعَتِي لَمْ أَجِدْهُمْ إِلَّا وَاصِفَةً وَ لَوِ امْتَحَنْتُهُمْ لَمَا وَجَدْتُهُمْ إِلَّا مُرْتَدِّينَ وَ لَوْ تَمَحَّصْتُهُمْ لَمَا خَلَصَ مِنَ الْأَلْفِ وَاحِدٌ وَ لَوْ غَرْبَلْتُهُمْ غَرْبَلَةً لَمْ يَبْقَ مِنْهُمْ إِلَّا مَا كَانَ لِي إِنَّهُمْ طَالَ مَا اتَّكَوْا عَلَى الْأَرَائِكِ فَقَالُوا نَحْنُ شِيعَةُ عَلِيٍّ إِنَّمَا شِيعَةُ عَلِيٍّ مَنْ صَدَّقَ قَوْلَهُ فِعْلُهُ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473417\">H 14738</a> – And by this chain, from Muhammad Bin Suleyman, from Ibrahim Bin Abdullah Al-Sufy from Musa Bin Bakr Al-Wasity who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Al-Hassan</span><sup>asws</sup> said to me: ‘If I<sup>asws</sup> were to distinguish my<sup>asws</sup> Shites, I<sup>asws</sup> would not find them except for the description (talk). And if I<sup>asws</sup> were to test them, I<sup>asws</sup> would not find them except as apostates. And if I<sup>asws</sup> were to scrutinise them not even one out of a thousand would escape. And if I<sup>asws</sup> were to screen them with a screening, there would not remain from them except the one who was for me<sup>asws</sup>. They have been saying for a long time, leaning upon their couches, ‘We are the Shites of Ali<sup>asws</sup>’. But rather, the Shiite of Ali<sup>asws</sup> is the one who truthful in both his actions as well as his words’."}]}, {"index": 14964, "local_index": 18, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:18", "text": "14739- حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الْكِنْدِيِّ عَنْ أَحْمَدَ بْنِ الْحَسَنِ الْمِيثَمِيِّ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عَبْدِ الْأَعْلَى مَوْلَى آلِ سَامٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ يَقُولُ تُؤْتَى بِالْمَرْأَةِ الْحَسْنَاءِ يَوْمَ الْقِيَامَةِ الَّتِي قَدِ افْتُتِنَتْ فِي حُسْنِهَا فَتَقُولُ يَا رَبِّ حَسَّنْتَ خَلْقِي حَتَّى لَقِيتُ مَا لَقِيتُ فَيُجَاءُ بِمَرْيَمَ (عليها السلام) فَيُقَالُ أَنْتِ أَحْسَنُ أَوْ هَذِهِ قَدْ حَسَّنَّاهَا فَلَمْ تُفْتَتَنْ \nوَ يُجَاءُ بِالرَّجُلِ الْحَسَنِ الَّذِي قَدِ افْتُتِنَ فِي حُسْنِهِ فَيَقُولُ يَا رَبِّ حَسَّنْتَ خَلْقِي حَتَّى لَقِيتُ مِنَ النِّسَاءِ مَا لَقِيتُ فَيُجَاءُ بِيُوسُفَ (عليه السلام) فَيُقَالُ أَنْتَ أَحْسَنُ أَوْ هَذَا قَدْ حَسَّنَّاهُ فَلَمْ يُفْتَتَنْ \nوَ يُجَاءُ بِصَاحِبِ الْبَلَاءِ الَّذِي قَدْ أَصَابَتْهُ الْفِتْنَةُ فِي بَلَائِهِ فَيَقُولُ يَا رَبِّ شَدَّدْتَ عَلَيَّ الْبَلَاءَ حَتَّى افْتُتِنْتُ فَيُؤْتَى بِأَيُّوبَ (عليه السلام) فَيُقَالُ أَ بَلِيَّتُكَ أَشَدُّ أَوْ بَلِيَّةُ هَذَا فَقَدِ ابْتُلِيَ فَلَمْ يُفْتَتَنْ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473418\">H 14739</a> – Humeyd Bin Ziyad, from Al-Hassan Bin Muhammad Al-Kindy, from Ahmad Bin Al-Hassan Al-Maysamy, from Aban Bin usman, from Abdul A’la a slave of progeny of Saam who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘On the Day of Judgement, they will bring a beautiful woman who had done Fitna (mischief) due to her beauty. So she will say, ‘O Lord<sup>azwj</sup>! You<sup>azwj</sup> Created me beautiful until I did what I did. So they will come with Maryam<sup>as</sup> and say to her, ‘Are you more beautiful or her<sup>as</sup>? She<sup>as</sup> had beauty in her<sup>as</sup> but did not do Fitna (mischief)’.\nAnd they would come with the handsome man who had done Fitna (mischief) due to his beauty. So he will say, ‘O Lord<sup>azwj</sup>! You<sup>azwj</sup> Created me with beauty until I did with the women what I did. So they will bring Yusuf<sup>as</sup> and say, ‘Are you more handsome or he<sup>as</sup> is? He<sup>as</sup> had beauty but did not do Fitna (mischief)’. \nAnd they will come with the afflicted person who had been involved in Ftina (mischief) due to his afflictions. So he will say, ‘O Lord<sup>azwj</sup>! The intensity of the afflictions upon me were such that I did Fitna (mischief)’. So they would come with Ayyub<sup>as</sup>. So they would say, ‘Were your afflictions more severe or his<sup>as</sup> afflictions? He<sup>as</sup> was in afflictions but did not do Fitna (mischief)’."}]}, {"index": 14965, "local_index": 19, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:19", "text": "14740- وَ بِهَذَا الْإِسْنَادِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ إِسْمَاعِيلَ الْبَصْرِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ تَقْعُدُونَ فِي الْمَكَانِ فَتُحَدِّثُونَ وَ تَقُولُونَ مَا شِئْتُمْ وَ تَتَبَرَّءُونَ مِمَّنْ شِئْتُمْ وَ تَوَلَّوْنَ مَنْ شِئْتُمْ قُلْتُ نَعَمْ قَالَ وَ هَلِ الْعَيْشُ إِلَّا هَكَذَا.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473419\">H 14740</a> – And by this chain, from Abaan Bin Usman, from Ismail Al-Basary who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘Can you all sit in a place where you can narrate Hadith, say whatsoever you like, and distance yourselves (Tabarra) from whosoever you like, and befriend whosoever you like?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘Is (luxury of) life anything other than this?’ "}]}, {"index": 14966, "local_index": 20, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:20", "text": "14741- حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ عَنْ وُهَيْبِ بْنِ حَفْصٍ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ رَحِمَ اللَّهُ عَبْداً حَبَّبَنَا إِلَى النَّاسِ وَ لَمْ يُبَغِّضْنَا إِلَيْهِمْ أَمَا وَ اللَّهِ لَوْ يَرْوُونَ مَحَاسِنَ كَلَامِنَا لَكَانُوا بِهِ أَعَزَّ وَ مَا اسْتَطَاعَ أَحَدٌ أَنْ يَتَعَلَّقَ عَلَيْهِمْ بِشَيْ‏ءٍ وَ لَكِنْ أَحَدُهُمْ يَسْمَعُ الْكَلِمَةَ فَيَحُطُّ إِلَيْهَا عَشْراً.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473420\">H 14741</a> – Humeyd bin Ziyad, from Al-Hassan Bin Muhammad, from Wuheyb Bin Hafs, from Abu Baseer who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘May Allah<sup>azwj</sup> have Mercy upon a servant who makes us<sup>asws</sup> to be loveable to the people, and does not make us<sup>asws</sup> to be hateful towards them. But, by Allah<sup>azwj</sup>, they are reporting our<sup>asws</sup> beautiful words to be honoured by it, and there is no leeway for anyone that he should attach anything to these (our words<sup>asws</sup>), but one of them hears the words, so he degrades the beauty of these words by ten times (by dropping our<sup>asws</sup> words from himself)’."}]}, {"index": 14967, "local_index": 21, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:21", "text": "14742- وُهَيْبٌ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ الَّذِينَ يُؤْتُونَ ما آتَوْا وَ قُلُوبُهُمْ وَجِلَةٌ قَالَ هِيَ شَفَاعَتُهُمْ وَ رَجَاؤُهُمْ يَخَافُونَ أَنْ تُرَدَّ عَلَيْهِمْ أَعْمَالُهُمْ إِنْ لَمْ يُطِيعُوا اللَّهَ عَزَّ ذِكْرُهُ وَ يَرْجُونَ أَنْ يَقْبَلَ مِنْهُمْ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473421\">H 14742</a> – Wuheyb, from Abu Baseer, who has narrated the following:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked Abu Abdullah</span><sup>asws</sup> about the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[23:60] And those who give that which they give with hearts afraid”</span>, he<sup>asws</sup> said: ‘This is for their intercession, and their hopes, they (our<sup>asws</sup> shias) fear that their (good) deeds would be rejected (and thrown) back to them if they had not obeyed (with total submission to) Allah<sup>azwj</sup> but they are hoping that these would be Accepted from our<sup>asws</sup> (intercession)’."}]}, {"index": 14968, "local_index": 22, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:22", "text": "14743- وُهَيْبُ بْنُ حَفْصٍ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) مَا مِنْ عَبْدٍ يَدْعُو إِلَى ضَلَالَةٍ إِلَّا وَجَدَ مَنْ يُتَابِعُهُ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473422\">H 14743</a> – Wuheyb Bin hafs, from Abu Baseer who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘There is none from the servants who calls to the misguidance except that he finds the one who follows him’."}]}, {"index": 14969, "local_index": 23, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:23", "text": "14744- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ الصَّلْتِ عَنْ رَجُلٍ مِنْ أَهْلِ بَلْخَ قَالَ كُنْتُ مَعَ الرِّضَا (عليه السلام) فِي سَفَرِهِ إِلَى خُرَاسَانَ فَدَعَا يَوْماً بِمَائِدَةٍ لَهُ فَجَمَعَ عَلَيْهَا مَوَالِيَهُ مِنَ السُّودَانِ وَ غَيْرِهِمْ فَقُلْتُ جُعِلْتُ فِدَاكَ لَوْ عَزَلْتَ لِهَؤُلَاءِ مَائِدَةً فَقَالَ مَهْ إِنَّ الرَّبَّ تَبَارَكَ وَ تَعَالَى وَاحِدٌ وَ الْأُمَّ وَاحِدَةٌ وَ الْأَبَ وَاحِدٌ وَ الْجَزَاءَ بِالْأَعْمَالِ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473423\">H 14744</a> – A number of our companions, from Ahmad Bin Muhammad, from Abdullah Bin Al-Salt, from a man from the people of Balkh who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> was with Al-Reza</span><sup>asws</sup> in his<sup>asws</sup> journey to Khurasan. One day he<sup>asws</sup> called for the spread (for a meal) to be set up for him<sup>asws</sup>. So there gathered around him<sup>asws</sup> his<sup>asws</sup> black friends and others. So I said, ‘May I be sacrificed for you<sup>asws</sup>, if you<sup>asws</sup> could isolate the spread for these people’. So he<sup>asws</sup> said: ‘Muuh! (Shhhh!). The Lord<sup>azwj</sup> Blessed and High is One, and the mother is one, and the father is one, and the Recompense is by the deeds’."}]}, {"index": 14970, "local_index": 24, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:24", "text": "14745- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ سِنَانٍ قَالَ سَمِعْتُ أَبَا الْحَسَنِ (عليه السلام) يَقُولُ طَبَائِعُ الْجِسْمِ عَلَى أَرْبَعَةٍ فَمِنْهَا الْهَوَاءُ الَّذِي لَا تَحْيَا النَّفْسُ إِلَّا بِهِ وَ بِنَسِيمِهِ وَ يُخْرِجُ مَا فِي الْجِسْمِ مِنْ دَاءٍ وَ عُفُونَةٍ وَ الْأَرْضُ الَّتِي قَدْ تُوَلِّدُ الْيُبْسَ وَ الْحَرَارَةَ وَ الطَّعَامُ وَ مِنْهُ يَتَوَلَّدُ الدَّمُ أَ لَا تَرَى أَنَّهُ يَصِيرُ إِلَى الْمَعِدَةِ فَتُغَذِّيهِ حَتَّى يَلِينَ ثُمَّ يَصْفُوَ فَتَأْخُذُ الطَّبِيعَةُ صَفْوَهُ دَماً ثُمَّ يَنْحَدِرُ الثُّفْلُ وَ الْمَاءُ وَ هُوَ يُوَلِّدُ الْبَلْغَمَ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473424\">H 14745</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Sinan who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Al-Hassan</span><sup>asws</sup> saying: ‘The body is built upon four, so from it is the air without which ‘the self’ cannot survive except by its (in and out) flow, and it takes out the diseases which are in the body and the decay, and the dirt (earth) which gives causes the dryness, and the energy (heat), and the food and from it the blood is generated. Indeed! Have you not seen that it (food) goes into the stomach, which digests it until it becomes soft, then cleans it? So the natural process takes the clean blood, then the residue descends along with the water, and it gives birth to the phlegm’. "}]}, {"index": 14971, "local_index": 25, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:25", "text": "14746- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ يَزِيدَ النَّوْفَلِيِّ عَنِ الْحُسَيْنِ بْنِ أَعْيَنَ أَخُو مَالِكِ بْنِ أَعْيَنَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) عَنْ قَوْلِ الرَّجُلِ لِلرَّجُلِ جَزَاكَ اللَّهُ خَيْراً مَا يَعْنِي بِهِ فَقَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) إِنَّ خَيْراً نَهَرٌ فِي الْجَنَّةِ مَخْرَجُهُ مِنَ الْكَوْثَرِ وَ الْكَوْثَرَ مَخْرَجُهُ مِنْ سَاقِ الْعَرْشِ عَلَيْهِ مَنَازِلُ الْأَوْصِيَاءِ وَ شِيعَتِهِمْ عَلَى حَافَتَيْ ذَلِكَ النَّهَرِ جَوَارِي نَابِتَاتٌ كُلَّمَا قُلِعَتْ وَاحِدَةٌ نَبَتَتْ أُخْرَى سُمِّيَ بِذَلِكَ النَّهَرُ وَ ذَلِكَ قَوْلُهُ تَعَالَى فِيهِنَّ خَيْراتٌ حِسانٌ فَإِذَا قَالَ الرَّجُلُ لِصَاحِبِهِ جَزَاكَ اللَّهُ خَيْراً فَإِنَّمَا يَعْنِي بِذَلِكَ تِلْكَ الْمَنَازِلَ الَّتِي قَدْ أَعَدَّهَا اللَّهُ عَزَّ وَ جَلَّ لِصَفْوَتِهِ وَ خِيَرَتِهِ مِنْ خَلْقِهِ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473425\">H 14746</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al-Husayn Bin Yazeed Al-Nawfaly, from Al-Husayn Bin Ayn the brother of Malik Bin Ayn who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked Abu Abdullah</span><sup>asws</sup> about the words which a person would say to another person, ‘جَزَاكَ اللَّهُ خَيْراً’ ‘May Allah<sup>azwj</sup> Reward you with goodness (Khair)’, what is meant by it?’ So Abu Abdullah<sup>asws</sup> said: ‘Khair’ is a river in the Paradise, a tributary from Al-Kawsar. And Al-Kawsar comes out from the Pillar of the Throne around which are houses of the successors<sup>asws</sup>, and their<sup>asws</sup> Shites. On the banks of that river maids (Houries) grow. Every time one is taken, another one grows in its place, and they have been named after that river (Khair). And that is the Statement of the High<sup>azwj</sup>: <span class=\"ibTxt\">“[5:70] In them are goodly things (Khair), beautiful ones”</span>. So if the man says to his companion, ‘May Allah<sup>azwj</sup> Reward you with goodness (Khaira)’, it means by that those dwellings which Allah<sup>azwj</sup> Mighty and Majestic has Prepared for His<sup>azwj</sup> elite, and the good ones from His<sup>azwj</sup> creatures’."}]}, {"index": 14972, "local_index": 26, "part_type": "Hadith", "path": "/books/al-kafi:8:1:41:26", "text": "14747- وَ عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ الْحُسَيْنِ بْنِ عُثْمَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ إِنَّ فِي الْجَنَّةِ نَهَراً حَافَتَاهُ حُورٌ نَابِتَاتٌ فَإِذَا مَرَّ الْمُؤْمِنُ بِإِحْدَيهُنَّ فَأَعْجَبَتْهُ اقْتَلَعَهَا فَأَنْبَتَ اللَّهُ عَزَّ وَ جَلَّ مَكَانَهَا.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473426\">H 14747</a> – And from him, from Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Al-Husayn Bin Usmaan, from Abu Baseer, who has narrated the following:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘In the Paradise is a river on banks of which are Houries are thriving. So if the Believer passes by one of them, and she pleases him, he uproots her (takes her away). So Allah<sup>azwj</sup> Mighty and Majestic Implants another one in her place’."}]}]}, "index": "al-kafi:8:1:41", "kind": "verse_list"}