{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 42"
        },
        "path": "/books/al-kafi:8:1:42",
        "titles": {
          "ar": "حَدِيثُ الْقِبَابِ",
          "en": "HADEETH OF THE DOMES"
        }
      }
    ],
    "index": 2313,
    "local_index": 42,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 43"
        },
        "path": "/books/al-kafi:8:1:43",
        "titles": {
          "ar": "حَدِيثُ عَلِيِّ بْنِ الْحُسَيْنِ (عليه السلام) مَعَ يَزِيدَ",
          "en": "Hadith of Ali Bin Al-Husayn<sup>asws</sup> with Yazeed<sup>la</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 41"
        },
        "path": "/books/al-kafi:8:1:41",
        "titles": {
          "ar": "حَدِيثُ يَأْجُوجَ وَ مَأْجُوجَ",
          "en": "HADEETH OF YAJOUJ (GOG) AND MAJOUJ (MAGOG)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:42",
    "titles": {
      "ar": "حَدِيثُ الْقِبَابِ",
      "en": "HADEETH OF THE DOMES"
    },
    "verse_count": 14,
    "verse_start_index": 14983,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 167)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14984,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:42:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14748</span>- مُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي حَمْزَةَ قَالَ قَالَ لِي أَبُو جَعْفَرٍ (عليه السلام) لَيْلَةً وَ أَنَا عِنْدَهُ وَ نَظَرَ إِلَى السَّمَاءِ قَالَ يَا أَبَا حَمْزَةَ هَذِهِ قُبَّةُ أَبِينَا آدَمَ (عليه السلام) وَ إِنَّ لِلَّهِ عَزَّ وَ جَلَّ سِوَاهَا تِسْعَةً وَ ثَلَاثِينَ قُبَّةً فِيهَا خَلْقٌ مَا عَصَوُا اللَّهَ طَرْفَةَ عَيْنٍ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473428\">H 14748</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al-Washa, from Abdullah Bin Sinan, from Abu Hamza who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> said to me one night whilst I was in his<sup>asws</sup> presence, and he<sup>asws</sup> looked towards the sky. He<sup>asws</sup> said: ‘O Abu Hamza! This is a dome of our father Adam<sup>as</sup>, and Allah<sup>azwj</sup> has thirty-nine others (similar ones) for those creatures who have not disobeyed Allah<sup>azwj</sup> even for the blink of an eye’."
          ],
          "en.sarwar": [
            "300. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al-Washa, from Abdullah Bin Sinan, from Abu Hamza who said: Abu Ja’far (a.s.) said to me one night whilst I was in his (a.s.) presence, and he (a.s.) looked towards the sky. He (a.s.) said: ‘O Abu Hamza! This is a dome of our father Adam (as), and Allah (azwj) has thirty-nine others (similar ones) for those creatures who have not disobeyed Allah (azwj) even for the blink of an eye’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 167)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14985,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:42:2",
        "text": [
          "14749- عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَبِي يَحْيَى الْوَاسِطِيِّ عَنْ عَجْلَانَ أَبِي صَالِحٍ قَالَ دَخَلَ رَجُلٌ عَلَى أَبِي عَبْدِ اللَّهِ (عليه السلام) فَقَالَ لَهُ جُعِلْتُ فِدَاكَ هَذِهِ قُبَّةُ آدَمَ (عليه السلام) قَالَ نَعَمْ وَ لِلَّهِ قِبَابٌ كَثِيرَةٌ أَلَا إِنَّ خَلْفَ مَغْرِبِكُمْ هَذَا تِسْعَةٌ وَ ثَلَاثُونَ مَغْرِباً أَرْضاً بَيْضَاءَ مَمْلُوَّةً خَلْقاً يَسْتَضِيئُونَ بِنُورِهِ لَمْ يَعْصُوا اللَّهَ عَزَّ وَ جَلَّ طَرْفَةَ عَيْنٍ مَا يَدْرُونَ خُلِقَ آدَمُ أَمْ لَمْ يُخْلَقْ يَبْرَءُونَ مِنْ فُلَانٍ وَ فُلَانٍ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473429\">H 14749</a> – From him, from Ahmad Bin Muhammad, from Abu Yahya Al-Wasity, from Ajlaan Abu Salih who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span> man came up to Abu</span> Abdullah<sup>asws</sup>, so he said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>. This here (the sky) is the dome of Adam<sup>as</sup>?’ He<sup>asws</sup> said: ‘Yes. By Allah<sup>azwj</sup>, there are numerous domes. Indeed! Behind this West of yours are thirty-nine (other) in the West, white lands filled with creatures illuminated by its light. They have never disobeyed Allah<sup>azwj</sup> even for the blink of an eye. These creatures are not aware of the creation of Adam<sup>as</sup>, but they are distancing themselves (Tabarra) from so and so and so and so (Abu Bakr and Umar)’."
          ],
          "en.sarwar": [
            "301. From him, from Ahmad Bin Muhammad, from Abu Yahya Al-Wasity, from Ajlaan Abu Salih who said: A man came up to Abu Abdullah (a.s.), so he said to him (a.s.), ‘May I be sacrificed for you (a.s.). This here (the sky) is the dome of Adam (as)?’ He (a.s.) said: ‘Yes. By Allah (azwj), there are numerous domes. Indeed! Behind this West of yours are thirty-nine (other) in the West, white lands filled with creatures illuminated by its light. They have never disobeyed Allah (azwj) even for the blink of an eye. These creatures are not aware of the creation of Adam (as), but they are distancing themselves (Tabarra) from so and so and so and so (Abu Bakr and Umar)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 168)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14986,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:42:3",
        "text": [
          "14750- عَلِيُّ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنْ يَحْيَى بْنِ الْمُبَارَكِ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ مَنْ خَصَفَ نَعْلَهُ وَ رَقَّعَ ثَوْبَهُ وَ حَمَلَ سِلْعَتَهُ فَقَدْ بَرِئَ مِنَ الْكِبْرِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473430\">H 14750</a> – Ali Bin Muhammad, from Salih Bin Abu Hammaad, from Yahya Bin Al-Mubarak, from Abdullah Bin Jabalat, from Is’haq Bin Ammaar, who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘The one who repairs his owns shoes, and stitches his own clothes, and carries his own commodities is free from the arrogance’."
          ],
          "en.sarwar": [
            "302. Ali Bin Muhammad, from Salih Bin Abu Hammaad, from Yahya Bin Al-Mubarak, from Abdullah Bin Jabalat, from Is’haq Bin Ammaar, who said: Abu Abdullah (a.s.) has said: ‘The one who repairs his owns shoes, and stitches his own clothes, and carries his own commodities is free from the arrogance’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 168)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14987,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:42:4",
        "text": [
          "14751- عَنْهُ عَنْ صَالِحٍ عَنْ مُحَمَّدِ بْنِ أُورَمَةَ عَنِ ابْنِ سِنَانٍ عَنِ الْمُفَضَّلِ بْنِ عُمَرَ قَالَ كُنْتُ أَنَا وَ الْقَاسِمُ شَرِيكِي وَ نَجْمُ بْنُ حَطِيمٍ وَ صَالِحُ بْنُ سَهْلٍ بِالْمَدِينَةِ فَتَنَاظَرْنَا فِي الرُّبُوبِيَّةِ قَالَ فَقَالَ بَعْضُنَا لِبَعْضٍ مَا تَصْنَعُونَ بِهَذَا نَحْنُ بِالْقُرْبِ مِنْهُ وَ لَيْسَ مِنَّا فِي تَقِيَّةٍ قُومُوا بِنَا إِلَيْهِ قَالَ فَقُمْنَا فَوَ اللَّهِ مَا بَلَغْنَا الْبَابَ إِلَّا وَ قَدْ خَرَجَ عَلَيْنَا بِلَا حِذَاءٍ وَ لَا رِدَاءٍ قَدْ قَامَ كُلُّ شَعْرَةٍ مِنْ رَأْسِهِ مِنْهُ وَ هُوَ يَقُولُ لَا لَا يَا مُفَضَّلُ وَ يَا قَاسِمُ وَ يَا نَجْمُ لَا لَا بَلْ عِبَادٌ مُكْرَمُونَ لَا يَسْبِقُونَهُ بِالْقَوْلِ وَ هُمْ بِأَمْرِهِ يَعْمَلُونَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473431\">H 14751</a> – From him, from Salih, from Muhammad Bin Awramat, from Ibn Sinan, from Al-Mufazzal Bin Umar who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> and Al-Qasim Shureyki</span>, and Najm Bin Hateem, and Salih Bin Sahl were at Al-Medina. So we were debating regarding the Lordship (Al-Rububiyya). So some of us said to the others, ‘What are we doing with this when we are so near to him<sup>asws</sup>, and there is none from us who is in dissimulation. Let us all go to him<sup>asws</sup>’. So we went. By Allah<sup>azwj</sup> we had not reached the door but he<sup>asws</sup> had come out towards us without shoes or gown, and all the hair on his<sup>asws</sup> head was standing straight, and he<sup>asws</sup> was saying: ‘No! No! O Mufazzal, and O Qasim, and O Najm. No! No! But they<sup>asws</sup> are honourable servants who do not precede Him<sup>azwj</sup> by the speech, and they<sup>asws</sup> act in accordance with His<sup>azwj</sup> Commands’."
          ],
          "en.sarwar": [
            "303. From him, from Salih, from Muhammad Bin Awramat, from Ibn Sinan, from Al-Mufazzal Bin Umar who said: I and Al-Qasim Shureyki, and Najm Bin Hateem, and Salih Bin Sahl were at Al-Medina. So we were debating regarding the Lordship (Al-Rububiyya). So some of us said to the others, ‘What are we doing with this when we are so near to him (a.s.), and there is none from us who is in dissimulation. Let us all go to him (a.s.)’. So we went. By Allah (azwj) we had not reached the door but he (a.s.) had come out towards us without shoes or gown, and all the hair on his (a.s.) head was standing straight, and he (a.s.) was saying: ‘No! No! O Mufazzal, and O Qasim, and O Najm. No! No! But they (a.s.) are honourable servants who do not precede Him (azwj) by the speech, and they (a.s.) act in accordance with His (azwj) Commands’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 169)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14988,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:42:5",
        "text": [
          "14752- عَنْهُ عَنْ صَالِحٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ إِنَّ لِإِبْلِيسَ عَوْناً يُقَالُ لَهُ تَمْرِيحٌ إِذَا جَاءَ اللَّيْلُ مَلَأَ مَا بَيْنَ الْخَافِقَيْنِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473432\">H 14752</a> – From him, from Salih, from Ali Bin Al-Hakam, from Abaan Bin Usman, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘Iblees<sup>la</sup> has a helper called ‘تَمْرِيحٌ’ Tamreeh. When the night comes, he fills what is between the two palpitations (of the heart)’."
          ],
          "en.sarwar": [
            "304. From him, from Salih, from Ali Bin Al-Hakam, from Abaan Bin Usman, who has said: Abu Abdullah (a.s.) has said: ‘Iblees (la) has a helper called ‘تَمْرِيحٌ’ Tamreeh. When the night comes, he fills what is between the two palpitations (of the heart)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 169)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14989,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:42:6",
        "text": [
          "14753- عَنْهُ عَنْ صَالِحٍ عَنِ الْوَشَّاءِ عَنْ كَرَّامٍ عَنْ عَبْدِ اللَّهِ بْنِ طَلْحَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) عَنِ الْوَزَغِ فَقَالَ رِجْسٌ وَ هُوَ مَسْخٌ كُلُّهُ فَإِذَا قَتَلْتَهُ فَاغْتَسِلْ فَقَالَ إِنَّ أَبِي كَانَ قَاعِداً فِي الْحِجْرِ وَ مَعَهُ رَجُلٌ يُحَدِّثُهُ فَإِذَا هُوَ بِوَزَغٍ يُوَلْوِلُ بِلِسَانِهِ فَقَالَ أَبِي لِلرَّجُلِ أَ تَدْرِي مَا يَقُولُ هَذَا الْوَزَغُ قَالَ لَا عِلْمَ لِي بِمَا يَقُولُ قَالَ فَإِنَّهُ يَقُولُ وَ اللَّهِ لَئِنْ ذَكَرْتُمْ عُثْمَانَ بِشَتِيمَةٍ لَأَشْتِمَنَّ عَلِيّاً حَتَّى يَقُومَ مِنْ هَاهُنَا ",
          "قَالَ وَ قَالَ أَبِي لَيْسَ يَمُوتُ مِنْ بَنِي أُمَيَّةَ مَيِّتٌ إِلَّا مُسِخَ وَزَغاً قَالَ وَ قَالَ إِنَّ عَبْدَ الْمَلِكِ بْنَ مَرْوَانَ لَمَّا نَزَلَ بِهِ الْمَوْتُ مُسِخَ وَزَغاً فَذَهَبَ مِنْ بَيْنِ يَدَيْ مَنْ كَانَ عِنْدَهُ وَ كَانَ عِنْدَهُ وُلْدُهُ فَلَمَّا أَنْ فَقَدُوهُ عَظُمَ ذَلِكَ عَلَيْهِمْ فَلَمْ يَدْرُوا كَيْفَ يَصْنَعُونَ ثُمَّ اجْتَمَعَ أَمْرُهُمْ عَلَى أَنْ يَأْخُذُوا جِذْعاً فَيَصْنَعُوهُ كَهَيْئَةِ الرَّجُلِ قَالَ فَفَعَلُوا ذَلِكَ وَ أَلْبَسُوا الْجِذْعَ دِرْعَ حَدِيدٍ ثُمَّ لَفُّوهُ فِي الْأَكْفَانِ فَلَمْ يَطَّلِعْ عَلَيْهِ أَحَدٌ مِنَ النَّاسِ إِلَّا أَنَا وَ وُلْدُهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473433\">H 14753</a> – From him, from Salih, from Al-Washa’, from Karraam, from Abdullah Bin Talha who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked Abu Abdullah</span><sup>asws</sup> about the lizard, so he<sup>asws</sup> said: ‘Filthy, and it is a metamorphosed (creature), all of them. So if you were to kill it, wash yourself (Ghusl)’. My<sup>asws</sup> father was seated in Al-Hijr, and with him<sup>asws</sup> was a man to whom he<sup>asws</sup> was narrating. So a lizard started ululating with its tongue. So my<sup>asws</sup> father said to the man: ‘Do you know what this lizard is saying?’ He said, ‘I have no knowledge of what it is saying’. He<sup>asws</sup> said: ‘It is saying that if you mention Usman by insults, I will insult Ali<sup>asws</sup> until he goes from there’. ",
            "He<sup>asws</sup> said: ‘And my<sup>asws</sup> father<sup>asws</sup> said: ‘There is none from the Clan of Umayya who dies, but he gets metamorphosed as a lizard. Abdul Malik Bin Marwaan, when death descended upon him, was metamorphosed into a lizard in front of the children who were in his presence. So when he was lost, that was a great (problem) for them as they did not know what to do. Then they met in a gathering, and decided to take a trunk and make it to look like a man. So they did that and clothed that with a coat of iron armour. Then they wrapped it in the shroud. So no one from the people knew about it except for myself<sup>asws</sup> and his children’."
          ],
          "en.sarwar": [
            "305. From him, from Salih, from Al-Washa’, from Karraam, from Abdullah Bin Talha who said: I asked Abu Abdullah (a.s.) about the lizard, so he (a.s.) said: ‘Filthy, and it is a metamorphosed (creature), all of them. So if you were to kill it, wash yourself (Ghusl)’. My (a.s.) father was seated in Al-Hijr, and with him (a.s.) was a man to whom he (a.s.) was narrating. So a lizard started ululating with its tongue. So my (a.s.) father said to the man: ‘Do you know what this lizard is saying?’ He said, ‘I have no knowledge of what it is saying’. He (a.s.) said: ‘It is saying that if you mention Usman by insults, I will insult Ali (a.s.) until he goes from there’. He (a.s.) said: ‘And my (a.s.) father (a.s.) said: ‘There is none from the Clan of Umayya who dies, but he gets metamorphosed as a lizard. Abdul Malik Bin Marwaan, when death descended upon him, was metamorphosed into a lizard in front of the children who were in his presence. So when he was lost, that was a great (problem) for them as they did not know what to do. Then they met in a gathering, and decided to take a trunk and make it to look like a man. So they did that and clothed that with a coat of iron armour. Then they wrapped it in the shroud. So no one from the people knew about it except for myself (a.s.) and his children’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 170)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14990,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:42:7",
        "text": [
          "14754- عَنْهُ عَنْ صَالِحٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ مِهْرَانَ عَنْ عَبْدِ الْمَلِكِ بْنِ بَشِيرٍ عَنْ عُثَيْمِ بْنِ سُلَيْمَانَ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ إِذَا تَمَنَّى أَحَدُكُمُ الْقَائِمَ فَلْيَتَمَنَّهُ فِي عَافِيَةٍ فَإِنَّ اللَّهَ بَعَثَ مُحَمَّداً (صلى الله عليه وآله) رَحْمَةً وَ يَبْعَثُ الْقَائِمَ نَقِمَةً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473434\">H 14754</a> – From him, from Salih, from Muhammad Bin Abdullah Bin Mahraan, from Abdul Malik Bin Basheer, from Usaym Bin Suleyman, from Muawiya Bin Ammaar, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘If one of you wishes for Al-Qaim<sup>asws</sup> should do so with regards to ‘عَافِيَةٍ’ protection (for everyone), for Allah<sup>azwj</sup> Sent Muhammad<sup>saww</sup> as a mercy and Sent Al-Qaim as a Wrath’."
          ],
          "en.sarwar": [
            "306. From him, from Salih, from Muhammad Bin Abdullah Bin Mahraan, from Abdul Malik Bin Basheer, from Usaym Bin Suleyman, from Muawiya Bin Ammaar, who has narrated the following: Abu Abdullah (a.s.) has said: ‘If one of you wishes for Al-Qaim (a.s.) should do so with regards to ‘عَافِيَةٍ’ protection (for everyone), for Allah (azwj) Sent Muhammad (saww) as a mercy and Sent Al-Qaim as a Wrath’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 171)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14991,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:42:8",
        "text": [
          "14755- عَنْهُ عَنْ صَالِحٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ الْمَلِكِ بْنِ بَشِيرٍ عَنْ أَبِي الْحَسَنِ الْأَوَّلِ (عليه السلام) قَالَ كَانَ الْحَسَنُ (عليه السلام) أَشْبَهَ النَّاسِ بِمُوسَى بْنِ عِمْرَانَ مَا بَيْنَ رَأْسِهِ إِلَى سُرَّتِهِ وَ إِنَّ الْحُسَيْنَ (عليه السلام) أَشْبَهُ النَّاسِ بِمُوسَى بْنِ عِمْرَانَ مَا بَيْنَ سُرَّتِهِ إِلَى قَدَمِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473435\">H 14755</a> – From him, from Salih, from Muhammad Bin Abdullah, from Abdul Malik Bin Basheer, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Al-Hassan the First</span><sup>asws</sup> having said that Al-Hassan<sup>asws</sup> was the most similar, of the people, to Musa Bin Imran<sup>as</sup> from what is in between his<sup>asws</sup> head to his<sup>asws</sup> navel, and that Al-Husayn<sup>asws</sup> was the most similar of the people, to Musa Bin Imran<sup>as</sup> from what is in between his<sup>asws</sup> navel to his<sup>asws</sup> feet’. "
          ],
          "en.sarwar": [
            "307. From him, from Salih, from Muhammad Bin Abdullah, from Abdul Malik Bin Basheer, who has narrated the following: Abu Al-Hassan the First (a.s.) having said that Al-Hassan (a.s.) was the most similar, of the people, to Musa Bin Imran (as) from what is in between his (a.s.) head to his (a.s.) navel, and that Al-Husayn (a.s.) was the most similar of the people, to Musa Bin Imran (as) from what is in between his (a.s.) navel to his (a.s.) feet’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 171)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14992,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:42:9",
        "text": [
          "14756- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ مُقَاتِلِ بْنِ سُلَيْمَانَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) كَمْ كَانَ طُولُ آدَمَ (عليه السلام) حِينَ هُبِطَ بِهِ إِلَى الْأَرْضِ وَ كَمْ كَانَ طُولُ حَوَّاءَ قَالَ وَجَدْنَا فِي كِتَابِ عَلِيِّ بْنِ أَبِي طَالِبٍ (عليه السلام)  أَنَّ اللَّهَ عَزَّ وَ جَلَّ لَمَّا أَهْبَطَ آدَمَ وَ زَوْجَتَهُ حَوَّاءَ (عليها السلام) إِلَى الْأَرْضِ كَانَتْ رِجْلَاهُ بِثَنِيَّةِ الصَّفَا وَ رَأْسُهُ دُونَ أُفُقِ السَّمَاءِ وَ أَنَّهُ شَكَا إِلَى اللَّهِ مَا يُصِيبُهُ مِنْ حَرِّ الشَّمْسِ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى جَبْرَئِيلَ (عليه السلام) أَنَّ آدَمَ قَدْ شَكَا مَا يُصِيبُهُ مِنْ حَرِّ الشَّمْسِ فَاغْمِزْهُ غَمْزَةً وَ صَيِّرْ طُولَهُ سَبْعِينَ ذِرَاعاً بِذِرَاعِهِ وَ اغْمِزْ حَوَّاءَ غَمْزَةً فَيَصِيرَ طُولُهَا خَمْسَةً وَ ثَلَاثِينَ ذِرَاعاً بِذِرَاعِهَا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473436\">H 14756</a> – Ali Bin Ibrahim, from his father, from Al-Hassan Bin Mahboub, from Muqatil Bin Suleyman who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked Abu Abdullah</span><sup>asws</sup>, ‘What was the length of Adam<sup>as</sup> when he<sup>as</sup> descended to the earth, and what was the length of Hawwa<sup>as</sup>?’ He<sup>asws</sup> said: ‘We<sup>asws</sup> found in the Book of Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> that when Allah<sup>azwj</sup> Made Adam<sup>as</sup> and his<sup>as</sup> wife Hawwa<sup>as</sup> to the earth, his<sup>as</sup> legs were in its twin part of Al-Safa (Al-Marwa), and his<sup>as</sup> head was under the horizon of the sky, and he<sup>as</sup> complained to Allah<sup>azwj</sup> from the difficulty caused by the heat of the sun. So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto Jibraeel<sup>as</sup> that Adam<sup>as</sup> had complained from the difficulty caused from the heat of the Sun. So he compressed him<sup>as</sup> with a compression and his<sup>as</sup> length became of seventy cubits, and he compressed Hawwa<sup>as</sup> with a compression, so her<sup>as</sup> length became of thirty five cubits’. "
          ],
          "en.sarwar": [
            "308. Ali Bin Ibrahim, from his father, from Al-Hassan Bin Mahboub, from Muqatil Bin Suleyman who said: I asked Abu Abdullah (a.s.), ‘What was the length of Adam (as) when he (as) descended to the earth, and what was the length of Hawwa (as)?’ He (a.s.) said: ‘We (a.s.) found in the Book of Ali (a.s.) Bin Abu Talib (a.s.) that when Allah (azwj) Made Adam (as) and his (as) wife Hawwa (as) to the earth, his (as) legs were in its twin part of Al-Safa (Al-Marwa), and his (as) head was under the horizon of the sky, and he (as) complained to Allah (azwj) from the difficulty caused by the heat of the sun. So Allah (azwj) Mighty and Majestic Revealed unto Jibraeel (as) that Adam (as) had complained from the difficulty caused from the heat of the Sun. So he compressed him (as) with a compression and his (as) length became of seventy cubits, and he compressed Hawwa (as) with a compression, so her (as) length became of thirty five cubits’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 177)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14993,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:42:10",
        "text": [
          "14757- عَنْهُ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنِ الْحَارِثِ بْنِ الْمُغِيرَةِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) عَنْ رَجُلٍ أَصَابَ أَبَاهُ سَبْيٌ فِي الْجَاهِلِيَّةِ فَلَمْ يَعْلَمْ أَنَّهُ كَانَ أَصَابَ أَبَاهُ سَبْيٌ فِي الْجَاهِلِيَّةِ إِلَّا بَعْدَ مَا تَوَالَدَتْهُ الْعَبِيدُ فِي الْإِسْلَامِ وَ أُعْتِقَ قَالَ فَقَالَ فَلْيُنْسَبْ إِلَى آبَائِهِ الْعَبِيدِ فِي الْإِسْلَامِ ثُمَّ هُوَ يُعَدُّ مِنَ الْقَبِيلَةِ الَّتِي كَانَ أَبُوهُ سُبِيَ فِيهَا إِنْ كَانَ [أَبُوهُ] مَعْرُوفاً فِيهِمْ وَ يَرِثُهُمْ وَ يَرِثُونَهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473437\">H 14757</a> – From him, from Ibn Mahboub, from Abu Ayyub, from Al-Haris Bin Al-Mugheira who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked Abu Abdullah</span><sup>asws</sup> about a man whose father had been made a captive in the era of Ignorance, so he never knew that he was a son whose father was made a captive in the era of ignorance until after he had been born a slave in Al-Islam and had been freed’. So he<sup>asws</sup> said: ‘His lineage is to his enslaved father in Al-Islam, then he would be counted from the tribe which his father was enslaved in, that he was known to be from them, and he will inherit from them and they will inherit from him’."
          ],
          "en.sarwar": [
            "309. From him, from Ibn Mahboub, from Abu Ayyub, from Al-Haris Bin Al-Mugheira who said: I asked Abu Abdullah (a.s.) about a man whose father had been made a captive in the era of Ignorance, so he never knew that he was a son whose father was made a captive in the era of ignorance until after he had been born a slave in Al-Islam and had been freed’. So he (a.s.) said: ‘His lineage is to his enslaved father in Al-Islam, then he would be counted from the tribe which his father was enslaved in, that he was known to be from them, and he will inherit from them and they will inherit from him’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 177)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14994,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:42:11",
        "text": [
          "14758- ابْنُ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ عَبْدِ الْمُؤْمِنِ الْأَنْصَارِيِّ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى أَعْطَى الْمُؤْمِنَ ثَلَاثَ خِصَالٍ الْعِزَّ فِي الدُّنْيَا وَ الْآخِرَةِ وَ الْفَلْجَ فِي الدُّنْيَا وَ الْآخِرَةِ وَ الْمَهَابَةَ فِي صُدُورِ الظَّالِمِينَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473438\">H 14758</a> – Ibn Mahboub, from Abu Ayyub, from Abdul Momin Al-Ansary, who has narrated:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> having said that: ‘Allah<sup>azwj</sup> has Granted three characteristics to the Believer – the honour in the world and the Hereafter, and the success in the world and the Hereafter, and the prestige in front of the unjust ones’."
          ],
          "en.sarwar": [
            "310. Ibn Mahboub, from Abu Ayyub, from Abdul Momin Al-Ansary, who has narrated: Abu Ja’far (a.s.) having said that: ‘Allah (azwj) has Granted three characteristics to the Believer – the honour in the world and the Hereafter, and the success in the world and the Hereafter, and the prestige in front of the unjust ones’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 178)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14995,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:42:12",
        "text": [
          "14759- ابْنُ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ ثَلَاثٌ هُنَّ فَخْرُ الْمُؤْمِنِ وَ زَيْنُهُ فِي الدُّنْيَا وَ الْآخِرَةِ الصَّلَاةُ فِي آخِرِ اللَّيْلِ وَ يَأْسُهُ مِمَّا فِي أَيْدِي النَّاسِ وَ وَلَايَتُهُ الْإِمَامَ مِنْ آلِ مُحَمَّدٍ (عليهم السلام) قَالَ وَ ثَلَاثَةٌ هُمْ شِرَارُ الْخَلْقِ ابْتُلِيَ بِهِمْ خِيَارُ الْخَلْقِ أَبُو سُفْيَانَ أَحَدُهُمْ قَاتَلَ رَسُولَ اللَّهِ (صلى الله عليه وآله) وَ عَادَاهُ وَ مُعَاوِيَةُ قَاتَلَ عَلِيّاً (عليه السلام) وَ عَادَاهُ وَ يَزِيدُ بْنُ مُعَاوِيَةَ لَعَنَهُ اللَّهُ قَاتَلَ الْحُسَيْنَ بْنَ عَلِيٍّ (عليه السلام) وَ عَادَاهُ حَتَّى قَتَلَهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473439\">H 14759</a> – Ibn Mahboub, from Abdullah Bin Sinan who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying; ‘Three things are a matter of pride for the Believer and an adornment of him in the world and the Hereafter – The Prayer during the last part of the night, and his dejection from what is in the hands of the people, and his Wilayah of the Imam<sup>asws</sup> from the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>. And the three who are the most evil of the creatures by whom the people were plagued, are Abu Sufyan who fought against the Rasool Allah<sup>saww</sup> during his era and was inimical to him<sup>saww</sup>, and Muawiya fought against Ali<sup>asws</sup> and was inimical to him<sup>asws</sup>, and Yazeed Bin Muawiya, may Allah<sup>azwj</sup> Curse him<sup>la</sup>, fought against Al-Husayn Bin Ali<sup>asws</sup>, and was inimical to him<sup>asws</sup> until he<sup>la</sup> killed him<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "311. Ibn Mahboub, from Abdullah Bin Sinan who said: I heard Abu Abdullah (a.s.) saying; ‘Three things are a matter of pride for the Believer and an adornment of him in the world and the Hereafter – The Prayer during the last part of the night, and his dejection from what is in the hands of the people, and his Wilayah of the Imam (a.s.) from the Progeny (a.s.) of Muhammad (saww). And the three who are the most evil of the creatures by whom the people were plagued, are Abu Sufyan who fought against the Rasool Allah (saww) during his era and was inimical to him (saww), and Muawiya fought against Ali (a.s.) and was inimical to him (a.s.), and Yazeed Bin Muawiya, may Allah (azwj) Curse him (la), fought against Al-Husayn Bin Ali (a.s.), and was inimical to him (a.s.) until he (la) killed him (a.s.)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 178)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14996,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:42:13",
        "text": [
          "14760- ابْنُ مَحْبُوبٍ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ (عليه السلام) قَالَ لَا حَسَبَ لِقُرَشِيٍّ وَ لَا لِعَرَبِيٍّ إِلَّا بِتَوَاضُعٍ وَ لَا كَرَمَ إِلَّا بِتَقْوَى وَ لَا عَمَلَ إِلَّا بِالنِّيَّةِ وَ لَا عِبَادَةَ إِلَّا بِالتَّفَقُّهِ أَلَا وَ إِنَّ أَبْغَضَ النَّاسِ إِلَى اللَّهِ مَنْ يَقْتَدِي بِسُنَّةِ إِمَامٍ وَ لَا يَقْتَدِي بِأَعْمَالِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473440\">H 14760</a> – Ibn Mahboub, from Malik Bin Atiyya, from Abu Hamza Al-Thumaly, who has narrated:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>li Bin Al-Husayn</span><sup>asws</sup> has said: ‘There is no nobility for the Qureysh, nor for the Arabs except by humbleness, and there is no prestige except by piety, and there are no deeds except by the intention, and there is no worship except by the understanding. Indeed! The most hateful of the people to Allah<sup>azwj</sup> is the one who emulates the Sunnah of an Imam<sup>asws</sup> but does not emulate him<sup>asws</sup> in his deeds’."
          ],
          "en.sarwar": [
            "312. Ibn Mahboub, from Malik Bin Atiyya, from Abu Hamza Al-Thumaly, who has narrated: Ali Bin Al-Husayn (a.s.) has said: ‘There is no nobility for the Qureysh, nor for the Arabs except by humbleness, and there is no prestige except by piety, and there are no deeds except by the intention, and there is no worship except by the understanding. Indeed! The most hateful of the people to Allah (azwj) is the one who emulates the Sunnah of an Imam (a.s.) but does not emulate him (a.s.) in his deeds’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 178)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14997,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:42:14",
        "text": [
          "14761- ابْنُ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ بُرَيْدِ بْنِ مُعَاوِيَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ (عليه السلام) يَقُولُ إِنَّ يَزِيدَ بْنَ مُعَاوِيَةَ دَخَلَ الْمَدِينَةَ وَ هُوَ يُرِيدُ الْحَجَّ فَبَعَثَ إِلَى رَجُلٍ مِنْ قُرَيْشٍ فَأَتَاهُ فَقَالَ لَهُ يَزِيدُ أَ تُقِرُّ لِي أَنَّكَ عَبْدٌ لِي إِنْ شِئْتُ بِعْتُكَ وَ إِنْ شِئْتُ اسْتَرْقَيْتُكَ فَقَالَ لَهُ الرَّجُلُ وَ اللَّهِ يَا يَزِيدُ مَا أَنْتَ بِأَكْرَمَ مِنِّي فِي قُرَيْشٍ حَسَباً وَ لَا كَانَ أَبُوكَ أَفْضَلَ مِنْ أَبِي فِي الْجَاهِلِيَّةِ وَ الْإِسْلَامِ وَ مَا أَنْتَ بِأَفْضَلَ مِنِّي فِي الدِّينِ وَ لَا بِخَيْرٍ مِنِّي فَكَيْفَ أُقِرُّ لَكَ بِمَا سَأَلْتَ فَقَالَ لَهُ يَزِيدُ إِنْ لَمْ تُقِرَّ لِي وَ اللَّهِ قَتَلْتُكَ فَقَالَ لَهُ الرَّجُلُ لَيْسَ قَتْلُكَ إِيَّايَ بِأَعْظَمَ مِنْ قَتْلِكَ الْحُسَيْنَ بْنَ عَلِيٍّ (عليه السلام) ابْنَ رَسُولِ اللَّهِ (صلى الله عليه وآله) فَأَمَرَ بِهِ فَقُتِلَ لَعَنَهُ اللَّهُ"
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473441\">H 14761</a> – Ibn Mahboub, from Abu Ayyub, from Bureyd Bin Muawiya who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Ja’far</span><sup>asws</sup> saying that: ‘Yazeed Bin Muawiya<sup>la</sup> entered Al-Medina and he wanted to perform the Pilgrimage. So he<sup>la</sup> sent for a man from Qureysh who came to him. So Yazeed<sup>la</sup> said to him, ‘Do you accept that you are my<sup>la</sup> slave, and if I<sup>la</sup> wish I<sup>la</sup> can sell you, and if I<sup>la</sup> wish I<sup>la</sup> can promote you?’ So the man said to him<sup>la</sup>, ‘You<sup>la</sup> are no more prestigious than me among the Qureysh in nobility, nor was your<sup>la</sup> father more preferable than my father during the era of ignorance and Al-Islam, and neither are you<sup>la</sup> more preferable than me in the Religion, nor better than me. So how can I accept what you<sup>la</sup> are asking of me?’ So Yazeed<sup>la</sup> said to him, ‘By Allah<sup>azwj</sup>! If you do not accept me<sup>la</sup>, I<sup>la</sup> shall kill you’. So the man said to him<sup>la</sup>, ‘Your<sup>la</sup> killing me would not be greater than your<sup>la</sup> killing of Al-Husayn Bin Ali<sup>asws</sup> the son<sup>asws</sup> of the Rasool Allah<sup>saww</sup>’. So he<sup>la</sup> ordered that he be killed, may Allah Curse him<sup>la</sup>’.  "
          ],
          "en.sarwar": [
            "313. Ibn Mahboub, from Abu Ayyub, from Bureyd Bin Muawiya who said: I heard Abu Ja’far (a.s.) saying that: ‘Yazeed Bin Muawiya (la) entered Al-Medina and he wanted to perform the Pilgrimage. So he (la) sent for a man from Qureysh who came to him. So Yazeed (la) said to him, ‘Do you accept that you are my (la) slave, and if I (la) wish I (la) can sell you, and if I (la) wish I (la) can promote you?’ So the man said to him (la), ‘You (la) are no more prestigious than me among the Qureysh in nobility, nor was your (la) father more preferable than my father during the era of ignorance and Al-Islam, and neither are you (la) more preferable than me in the Religion, nor better than me. So how can I accept what you (la) are asking of me?’ So Yazeed (la) said to him, ‘By Allah (azwj)! If you do not accept me (la), I (la) shall kill you’. So the man said to him (la), ‘Your (la) killing me would not be greater than your (la) killing of Al-Husayn Bin Ali (a.s.) the son (a.s.) of the Rasool Allah (saww)’. So he (la) ordered that he be killed, may Allah Curse him (la)’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:42",
  "kind": "verse_list"
}