{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 43"
        },
        "path": "/books/al-kafi:8:1:43",
        "titles": {
          "ar": "حَدِيثُ عَلِيِّ بْنِ الْحُسَيْنِ (عليه السلام) مَعَ يَزِيدَ",
          "en": "Hadith of Ali Bin Al-Husayn<sup>asws</sup> with Yazeed<sup>la</sup>"
        }
      }
    ],
    "index": 2314,
    "local_index": 43,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 44"
        },
        "path": "/books/al-kafi:8:1:44",
        "titles": {
          "ar": "حَدِيثُ نُوحٍ ( عليه السلام ) يَوْمَ الْقِيَامَةِ",
          "en": "HADEETH OF NOAH<sup>as</sup> ON THE DAY OF JUDGEMENT"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 42"
        },
        "path": "/books/al-kafi:8:1:42",
        "titles": {
          "ar": "حَدِيثُ الْقِبَابِ",
          "en": "HADEETH OF THE DOMES"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:43",
    "titles": {
      "ar": "حَدِيثُ عَلِيِّ بْنِ الْحُسَيْنِ (عليه السلام) مَعَ يَزِيدَ",
      "en": "Hadith of Ali Bin Al-Husayn<sup>asws</sup> with Yazeed<sup>la</sup>"
    },
    "verse_count": 79,
    "verse_start_index": 14997,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 179)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14998,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ث</span>ُمَّ أَرْسَلَ إِلَى</span> عَلِيِّ بْنِ الْحُسَيْنِ (عليه السلام) فَقَالَ لَهُ مِثْلَ مَقَالَتِهِ لِلْقُرَشِيِّ فَقَالَ لَهُ عَلِيُّ بْنُ الْحُسَيْنِ (عليه السلام) أَ رَأَيْتَ إِنْ لَمْ أُقِرَّ لَكَ أَ لَيْسَ تَقْتُلُنِي كَمَا قَتَلْتَ الرَّجُلَ بِالْأَمْسِ فَقَالَ لَهُ يَزِيدُ لَعَنَهُ اللَّهُ بَلَى فَقَالَ لَهُ عَلِيُّ بْنُ الْحُسَيْنِ (عليه السلام) قَدْ أَقْرَرْتُ لَكَ بِمَا سَأَلْتَ أَنَا عَبْدٌ مُكْرَهٌ فَإِنْ شِئْتَ فَأَمْسِكْ وَ إِنْ شِئْتَ فَبِعْ فَقَالَ لَهُ يَزِيدُ لَعَنَهُ اللَّهُ أَوْلَى لَكَ حَقَنْتَ دَمَكَ وَ لَمْ يَنْقُصْكَ ذَلِكَ مِنْ شَرَفِكَ."
        ],
        "translations": {
          "en.hubeali": [
            "Then he<sup>la</sup> sent for Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>. So he<sup>la</sup> said to him<sup>asws</sup> similar to what he<sup>la</sup> had said to the Qureyshi. Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said to him<sup>la</sup>: ‘Do you<sup>la</sup> see that if I<sup>asws</sup> do not accept you<sup>la</sup>, you<sup>la</sup> kill me<sup>asws</sup> just as you<sup>la</sup> killed the man yesterday?’ Yazeed<sup>la</sup>, may Allah<sup>azwj</sup> Curse him<sup>la</sup> said to him<sup>asws</sup>, ‘Yes’. So Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said to him<sup>la</sup>: ‘I<sup>asws</sup> have accepted to you<sup>la</sup> with what you<sup>la</sup> asked. I<sup>asws</sup> am a humble slave (of Allah<sup>azwj</sup>), so if you<sup>la</sup> wish captivate me<sup>asws</sup> or if you<sup>la</sup> wish, release me’. So Yazeed<sup>la</sup> may Allah<sup>azwj</sup> Curse him<sup>la</sup> said to him<sup>asws</sup>, ‘It is of a higher level (referring to the one whom he<sup>la</sup> had killed the day before) even if I (kill) or spare your<sup>asws</sup> blood it would not reduce your<sup>asws</sup> nobility’."
          ],
          "en.sarwar": [
            "314. Then he (la) sent for Ali (a.s.) Bin Al-Husayn (a.s.). So he (la) said to him (a.s.) similar to what he (la) had said to the Qureyshi. Ali (a.s.) Bin Al-Husayn (a.s.) said to him (la): ‘Do you (la) see that if I (a.s.) do not accept you (la), you (la) kill me (a.s.) just as you (la) killed the man yesterday?’ Yazeed (la), may Allah (azwj) Curse him (la) said to him (a.s.), ‘Yes’. So Ali (a.s.) Bin Al-Husayn (a.s.) said to him (la): ‘I (a.s.) have accepted to you (la) with what you (la) asked. I (a.s.) am a humble slave (of Allah (azwj)), so if you (la) wish captivate me (a.s.) or if you (la) wish, release me’. So Yazeed (la) may Allah (azwj) Curse him (la) said to him (a.s.), ‘It is of a higher level (referring to the one whom he (la) had killed the day before) even if I (kill) or spare your (a.s.) blood it would not reduce your (a.s.) nobility’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 180)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14999,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:2",
        "text": [
          "14762- الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ عَلِيِّ بْنِ مُحَمَّدِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ سَالِمِ بْنِ أَبِي سَلَمَةَ عَنْ مُحَمَّدِ بْنِ سَعِيدِ بْنِ غَزْوَانَ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ الْمُغِيرَةِ قَالَ قُلْتُ لِأَبِي الْحَسَنِ (عليه السلام) إِنَّ لِي جَارَيْنِ أَحَدُهُمَا نَاصِبٌ وَ الْآخَرُ زَيْدِيٌّ وَ لَا بُدَّ مِنْ مُعَاشَرَتِهِمَا فَمَنْ أُعَاشِرُ فَقَالَ هُمَا سِيَّانِ مَنْ كَذَّبَ بِآيَةٍ مِنْ كِتَابِ اللَّهِ فَقَدْ نَبَذَ الْإِسْلَامَ وَرَاءَ ظَهْرِهِ وَ هُوَ الْمُكَذِّبُ بِجَمِيعِ الْقُرْآنِ وَ الْأَنْبِيَاءِ وَ الْمُرْسَلِينَ قَالَ ثُمَّ قَالَ إِنَّ هَذَا نَصَبَ لَكَ وَ هَذَا الزَّيْدِيُّ نَصَبَ لَنَا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473443\">H 14762</a> – Al-Husayn Bin Muhammad Al-Ashary, from Ali Bin Muhammad Bin Saeed, from Muhammad Bin Saalim Bin Abu Salma Muhammad Bin Saeed Bin Gazwaan, from Abdullah Bin Al-Mugheira who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> said to Abu Al-Hassan</span><sup>asws</sup> that, ‘I have two neighbours, one of them is a Hostile one (Nasibi) and one is a Zaydiite (A sect) and it is necessary to keep relations with them, so whom shall I keep relations with?’ So he<sup>asws</sup> said: ‘They are both the same. The one who belies the Verses from the Book of Allah<sup>azwj</sup>, so he has thrown Al-Islam behind his back and he has belied the whole of the Quran, and the Prophets<sup>as</sup>, and the Messengers<sup>as</sup>’. Then he<sup>asws</sup> said: ‘This one is hostile to you, and this Zaydiite is hostile to us<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "315. Al-Husayn Bin Muhammad Al-Ashary, from Ali Bin Muhammad Bin Saeed, from Muhammad Bin Saalim Bin Abu Salma Muhammad Bin Saeed Bin Gazwaan, from Abdullah Bin Al-Mugheira who said: I said to Abu Al-Hassan (a.s.) that, ‘I have two neighbours, one of them is a Hostile one (Nasibi) and one is a Zaydiite (A sect) and it is necessary to keep relations with them, so whom shall I keep relations with?’ So he (a.s.) said: ‘They are both the same. The one who belies the Verses from the Book of Allah (azwj), so he has thrown Al-Islam behind his back and he has belied the whole of the Quran, and the Prophets (as), and the Messengers (as)’. Then he (a.s.) said: ‘This one is hostile to you, and this Zaydiite is hostile to us (a.s.)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 180)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 395)"
        ],
        "index": 15000,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:3",
        "text": [
          "14763- مُحَمَّدُ بْنُ سَعِيدٍ قَالَ حَدَّثَنِي الْقَاسِمُ بْنُ عُرْوَةَ عَنْ عُبَيْدِ بْنِ زُرَارَةَ عَنْ أَبِيهِ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ مَنْ قَعَدَ فِي مَجْلِسٍ يُسَبُّ فِيهِ إِمَامٌ مِنَ الْأَئِمَّةِ يَقْدِرُ عَلَى الِانْتِصَافِ فَلَمْ يَفْعَلْ أَلْبَسَهُ اللَّهُ عَزَّ وَ جَلَّ الذُّلَّ فِي الدُّنْيَا وَ عَذَّبَهُ فِي الْآخِرَةِ وَ سَلَبَهُ صَالِحَ مَا مَنَّ بِهِ عَلَيْهِ مِنْ مَعْرِفَتِنَا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473444\">H 14763</a> – Muhammad Bin Saeed, from Al-Qasim Bin Urwat, from Ubeyd Bin Zurara, from his father, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> having said; ‘The one who sits in a gathering in which an Imam<sup>asws</sup> from the Imams<sup>asws</sup> is insulted, and he has the ability to remedy that and he does not do so, Allah<sup>azwj</sup> Mighty and Majestic would Clothe him in disgrace in the world and Punish him in the Hereafter, and would Confiscate the benefit which he has from our<sup>asws</sup> understanding (Ma’rifat)’. "
          ],
          "en.sarwar": [
            "316. Muhammad Bin Saeed, from Al-Qasim Bin Urwat, from Ubeyd Bin Zurara, from his father, who has narrated the following: Abu Ja’far (a.s.) having said; ‘The one who sits in a gathering in which an Imam (a.s.) from the Imams (a.s.) is insulted, and he has the ability to remedy that and he does not do so, Allah (azwj) Mighty and Majestic would Clothe him in disgrace in the world and Punish him in the Hereafter, and would Confiscate the benefit which he has from our (a.s.) understanding (Ma’rifat)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 182)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15001,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:4",
        "text": [
          "14764- أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ فَضَّالٍ عَنْ إِبْرَاهِيمَ بْنِ أَخِي أَبِي شِبْلٍ عَنْ أَبِي شِبْلٍ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ (عليه السلام) ابْتِدَاءً مِنْهُ أَحْبَبْتُمُونَا وَ أَبْغَضَنَا النَّاسُ وَ صَدَّقْتُمُونَا وَ كَذَّبَنَا النَّاسُ وَ وَصَلْتُمُونَا وَ جَفَانَا النَّاسُ فَجَعَلَ اللَّهُ مَحْيَاكُمْ مَحْيَانَا وَ مَمَاتَكُمْ مَمَاتَنَا أَمَا وَ اللَّهِ مَا بَيْنَ الرَّجُلِ وَ بَيْنَ أَنْ يُقِرَّ اللَّهُ عَيْنَهُ إِلَّا أَنْ تَبْلُغَ نَفْسُهُ هَذَا الْمَكَانَ وَ أَوْمَأَ بِيَدِهِ إِلَى حَلْقِهِ فَمَدَّ الْجِلْدَةَ ",
          "ثُمَّ أَعَادَ ذَلِكَ فَوَ اللَّهِ مَا رَضِيَ حَتَّى حَلَفَ لِي فَقَالَ وَ اللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ لَحَدَّثَنِي أَبِي مُحَمَّدُ بْنُ عَلِيٍّ (عليه السلام) بِذَلِكَ يَا أَبَا شِبْلٍ أَ مَا تَرْضَوْنَ أَنْ تُصَلُّوا وَ يُصَلُّوا فَيُقْبَلَ مِنْكُمْ وَ لَا يُقْبَلَ مِنْهُمْ أَ مَا تَرْضَوْنَ أَنْ تُزَكُّوا وَ يُزَكُّوا فَيُقْبَلَ مِنْكُمْ وَ لَا يُقْبَلَ مِنْهُمْ أَ مَا تَرْضَوْنَ أَنْ تَحُجُّوا وَ يَحُجُّوا فَيَقْبَلَ اللَّهُ جَلَّ ذِكْرُهُ مِنْكُمْ وَ لَا يَقْبَلَ مِنْهُمْ وَ اللَّهِ مَا تُقْبَلُ الصَّلَاةُ إِلَّا مِنْكُمْ وَ لَا الزَّكَاةُ إِلَّا مِنْكُمْ وَ لَا الْحَجُّ إِلَّا مِنْكُمْ ",
          "فَاتَّقُوا اللَّهَ عَزَّ وَ جَلَّ فَإِنَّكُمْ فِي هُدْنَةٍ وَ أَدُّوا الْأَمَانَةَ فَإِذَا تَمَيَّزَ النَّاسُ فَعِنْدَ ذَلِكَ ذَهَبَ كُلُّ قَوْمٍ بِهَوَاهُمْ وَ ذَهَبْتُمْ بِالْحَقِّ مَا أَطَعْتُمُونَا أَ لَيْسَ الْقُضَاةُ وَ الْأُمَرَاءُ وَ أَصْحَابُ الْمَسَائِلِ مِنْهُمْ قُلْتُ بَلَى قَالَ (عليه السلام) فَاتَّقُوا اللَّهَ عَزَّ وَ جَلَّ فَإِنَّكُمْ لَا تُطِيقُونَ النَّاسَ كُلَّهُمْ إِنَّ النَّاسَ أَخَذُوا هَاهُنَا وَ هَاهُنَا وَ إِنَّكُمْ أَخَذْتُمْ حَيْثُ أَخَذَ اللَّهُ عَزَّ وَ جَلَّ إِنَّ اللَّهَ عَزَّ وَ جَلَّ اخْتَارَ مِنْ عِبَادِهِ مُحَمَّداً (صلى الله عليه وآله) فَاخْتَرْتُمْ خِيَرَةَ اللَّهِ فَاتَّقُوا اللَّهَ وَ أَدُّوا الْأَمَانَاتِ إِلَى الْأَسْوَدِ وَ الْأَبْيَضِ وَ إِنْ كَانَ حَرُورِيّاً وَ إِنْ كَانَ شَامِيّاً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473445\">H 14764</a> – Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbaar, from Ibn Fazaal, from Ibrahim Bin Akhay Abu Shabl, from Abu Shabl who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said to me initiating a conversation: ‘You have loved us<sup>asws</sup> whilst the people have hated us<sup>asws</sup>, and you have ratified us<sup>asws</sup> whilst the people have belied us<sup>asws</sup>, and you have submitted to us<sup>asws</sup> whilst the people have been disloyal to us<sup>asws</sup>. So Allah<sup>azwj</sup> has Made your lives to be our<sup>asws</sup>, and your deaths to be like our<sup>asws</sup> passing away. But, by Allah<sup>azwj</sup>, there is nothing between the man and the delight which Allah<sup>azwj</sup> has kept for him except for the soul to reach this place’ – and he<sup>asws</sup> gestured with his<sup>asws</sup> to his<sup>asws</sup> throat and extended the skin. ",
            "Then he<sup>asws</sup> repeated that, so by Allah<sup>azwj</sup>, he<sup>asws</sup> was not happy until he<sup>asws</sup> took an oath to me, so he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup> besides Whom there is no god except for Him<sup>azwj</sup>, my<sup>asws</sup> father<sup>asws</sup> Muhammad Bin Ali<sup>asws</sup> narrated that to me. O Abu Shabl! Are you not happy that you pray, and they pray, so it is accepted from you and it’s not accepted from them? Are you not happy that you give zakat, and they give zakat, so it is accepted from you and it’s not accepted from them? Are you not happy that you perform the pilgrimage and they perform the pilgrimage, so Allah<sup>azwj</sup> Accepts from you and does not Accept from them? By Allah<sup>azwj</sup>! The prayer is not accepted except from you, nor the zakat except from you, nor the pilgrimage except from you’.",
            "So fear Allah<sup>azwj</sup> for you are in a truce and fulfil the trusts for it is an excellent (merit) of the people. So fulfil that. All the people went according to their desires and you went with the truth in what you obeyed us<sup>asws</sup>. Is it not that the judges, and the rulers, and the problem solvers (those who would give fatwa) are among them?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘So fear Allah<sup>azwj</sup> for you will not be able to tolerate all these people. The people take from here and there, and you are taking from where Allah<sup>azwj</sup> has Told you to take from. Allah<sup>azwj</sup> Chose Muhammad<sup>saww</sup> from His<sup>azwj</sup> servants, so you have chosen the Choice of Allah<sup>azwj</sup>. So fear Allah<sup>azwj</sup> and fulfil the trusts to the black and the white, even if he was a Haruriyya (a sect) or if he was a Syrian’."
          ],
          "en.sarwar": [
            "317. Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbaar, from Ibn Fazaal, from Ibrahim Bin Akhay Abu Shabl, from Abu Shabl who said: Abu Abdullah (a.s.) said to me initiating a conversation: ‘You have loved us (a.s.) whilst the people have hated us (a.s.), and you have ratified us (a.s.) whilst the people have belied us (a.s.), and you have submitted to us (a.s.) whilst the people have been disloyal to us (a.s.). So Allah (azwj) has Made your lives to be our (a.s.), and your deaths to be like our (a.s.) passing away. But, by Allah (azwj), there is nothing between the man and the delight which Allah (azwj) has kept for him except for the soul to reach this place’ – and he (a.s.) gestured with his (a.s.) to his (a.s.) throat and extended the skin. Then he (a.s.) repeated that, so by Allah (azwj), he (a.s.) was not happy until he (a.s.) took an oath to me, so he (a.s.) said: ‘By Allah (azwj) besides Whom there is no god except for Him (azwj), my (a.s.) father (a.s.) Muhammad Bin Ali (a.s.) narrated that to me. O Abu Shabl! Are you not happy that you pray, and they pray, so it is accepted from you and it’s not accepted from them? Are you not happy that you give zakat, and they give zakat, so it is accepted from you and it’s not accepted from them? Are you not happy that you perform the pilgrimage and they perform the pilgrimage, so Allah (azwj) Accepts from you and does not Accept from them? By Allah (azwj)! The prayer is not accepted except from you, nor the zakat except from you, nor the pilgrimage except from you’. So fear Allah (azwj) for you are in a truce and fulfil the trusts for it is an excellent (merit) of the people. So fulfil that. All the people went according to their desires and you went with the truth in what you obeyed us (a.s.). Is it not that the judges, and the rulers, and the problem solvers (those who would give fatwa) are among them?’ I said, ‘Yes’. He (a.s.) said: ‘So fear Allah (azwj) for you will not be able to tolerate all these people. The people take from here and there, and you are taking from where Allah (azwj) has Told you to take from. Allah (azwj) Chose Muhammad (saww) from His (azwj) servants, so you have chosen the Choice of Allah (azwj). So fear Allah (azwj) and fulfil the trusts to the black and the white, even if he was a Haruriyya (a sect) or if he was a Syrian’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 182)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15002,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:5",
        "text": [
          "14765- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ فَضَّالٍ عَنْ إِبْرَاهِيمَ بْنِ أَخِي أَبِي شِبْلٍ عَنْ أَبِي شِبْلٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) مِثْلَهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473446\">H 14765</a> – A number of our companions, from Sahl Bin Ziyad, from Ibn fazzaal, from Ibrahim Bin Akhay Abu Shabl, from Abu Shabl, from Abu Abdullah<sup>asws</sup>, similar to it’."
          ],
          "en.sarwar": [
            "318. A number of our companions, from Sahl Bin Ziyad, from Ibn fazzaal, from Ibrahim Bin Akhay Abu Shabl, from Abu Shabl, from Abu Abdullah (a.s.), similar to it’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 182)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15003,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:6",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14766</span>- سَهْلُ بْنُ زِيَادٍ</span> عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ حَمَّادِ بْنِ أَبِي طَلْحَةَ عَنْ مُعَاذِ بْنِ كَثِيرٍ قَالَ نَظَرْتُ إِلَى الْمَوْقِفِ وَ النَّاسُ فِيهِ كَثِيرٌ فَدَنَوْتُ إِلَى أَبِي عَبْدِ اللَّهِ (عليه السلام) فَقُلْتُ لَهُ إِنَّ أَهْلَ الْمَوْقِفِ لَكَثِيرٌ قَالَ فَصَرَفَ بِبَصَرِهِ فَأَدَارَهُ فِيهِمْ ثُمَّ قَالَ ادْنُ مِنِّي يَا أَبَا عَبْدِ اللَّهِ غُثَاءٌ يَأْتِي بِهِ الْمَوْجُ مِنْ كُلِّ مَكَانٍ لَا وَ اللَّهِ مَا الْحَجُّ إِلَّا لَكُمْ لَا وَ اللَّهِ مَا يَتَقَبَّلُ اللَّهُ إِلَّا مِنْكُمْ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473447\">H 14766</a> – Sahl Bin Ziyad, from Muhammad Bin Sinan, from Hammaad Bin Abu Talha, from Muaz Bin Kaseer who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> looked towards the</span> pausing station (during the Pilgrimage) and there were a lot of people in it. So I approached Abu Abdullah<sup>asws</sup> and said to him<sup>asws</sup> that, ‘The people at the Pausing station are so many (in numbers)’. He<sup>asws</sup> look around and pondered over them, then said: ‘Come closer to me<sup>asws</sup>, O Abu Abdullah, this is scum which the waves have brought from every place. No, by Allah<sup>azwj</sup>! There is no Pilgrimage except for you all. By Allah<sup>azwj</sup>, Allah<sup>azwj</sup> will not Accept except from you’."
          ],
          "en.sarwar": [
            "319. Sahl Bin Ziyad, from Muhammad Bin Sinan, from Hammaad Bin Abu Talha, from Muaz Bin Kaseer who said: I looked towards the pausing station (during the Pilgrimage) and there were a lot of people in it. So I approached Abu Abdullah (a.s.) and said to him (a.s.) that, ‘The people at the Pausing station are so many (in numbers)’. He (a.s.) look around and pondered over them, then said: ‘Come closer to me (a.s.), O Abu Abdullah, this is scum which the waves have brought from every place. No, by Allah (azwj)! There is no Pilgrimage except for you all. By Allah (azwj), Allah (azwj) will not Accept except from you’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 183)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15004,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:7",
        "refs": {
          "Quran": [
            "/books/quran:5:44",
            "/books/quran:5:45",
            "/books/quran:5:47"
          ]
        },
        "text": [
          "14767- الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي بَصِيرٍ قَالَ كُنْتُ جَالِساً عِنْدَ أَبِي عَبْدِ اللَّهِ (عليه السلام) إِذْ دَخَلَتْ عَلَيْهِ أُمُّ خَالِدٍ الَّتِي كَانَ قَطَعَهَا يُوسُفُ بْنُ عُمَرَ تَسْتَأْذِنُ عَلَيْهِ فَقَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) أَ يَسُرُّكَ أَنْ تَسْمَعَ كَلَامَهَا فَقُلْتُ نَعَمْ فَقَالَ أَمَّا الْآنَ فَأَذِنَ لَهَا قَالَ وَ أَجْلَسَنِي مَعَهُ عَلَى الطِّنْفِسَةِ",
          "ثُمَّ دَخَلَتْ فَتَكَلَّمَتْ فَإِذَا امْرَأَةٌ بَلِيغَةٌ فَسَأَلَتْهُ عَنْهُمَا فَقَالَ لَهَا تَوَلَّيْهِمَا قَالَتْ فَأَقُولُ لِرَبِّي إِذَا لَقِيتُهُ إِنَّكَ أَمَرْتَنِي بِوَلَايَتِهِمَا قَالَ نَعَمْ قَالَتْ فَإِنَّ هَذَا الَّذِي مَعَكَ عَلَى الطِّنْفِسَةِ يَأْمُرُنِي بِالْبَرَاءَةِ مِنْهُمَا وَ كَثِيرٌ النَّوَّاءُ يَأْمُرُنِي بِوَلَايَتِهِمَا فَأَيُّهُمَا خَيْرٌ وَ أَحَبُّ إِلَيْكَ قَالَ هَذَا وَ اللَّهِ أَحَبُّ إِلَيَّ مِنْ كَثِيرٍ النَّوَّاءِ وَ أَصْحَابِهِ إِنَّ هَذَا يُخَاصِمُ فَيَقُولُ وَ مَنْ لَمْ يَحْكُمْ بِما أَنْزَلَ اللَّهُ فَأُولئِكَ هُمُ الْكافِرُونَ وَ مَنْ لَمْ يَحْكُمْ بِما أَنْزَلَ اللَّهُ فَأُولئِكَ هُمُ الظَّالِمُونَ وَ مَنْ لَمْ يَحْكُمْ بِما أَنْزَلَ اللَّهُ فَأُولئِكَ هُمُ الْفاسِقُونَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473448\">H 14767</a> – Al-Husayn Bin Muhammad La Ashary, from Moala Bin Muhammad, from Al-Hassan Bin Ali Al-Washa, from Aban Bin Usman, from Abu Baseer who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> was seated in the</span> presence of Abu Abdullah<sup>asws</sup> when Umm Khalid, who had been cut off by Yusuf Bin Umar, came up and sought permission to see him<sup>asws</sup>. So Abu Abdullah<sup>asws</sup> said; ‘Would it please you to hear her words?’ So I said, ‘Yes’. He<sup>asws</sup> said: ‘As for now, give permission to her’. And he<sup>asws</sup> made me sit on settee along with him<sup>asws</sup>’. ",
            "Then she came in, and she spoke. She was an eloquent woman. So she asked about the two of them. So he<sup>asws</sup> said: ‘Consider them as friends. She said, ‘So shalI I say to my Lord<sup>azwj</sup> when I meet Him<sup>azwj</sup> that you<sup>asws</sup> have ordered me to befriend these two?’ So he<sup>asws</sup> said: ‘Yes’. She said, ‘This one who is with you<sup>asws</sup> upon the settee has ordered me to distance myself from those two, and Kusayr Al-Nawaa has ordered me to befriend those two. So which one is better and more beloved to you<sup>asws</sup>?’ He<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! This one is more beloved to me<sup>asws</sup> than Kusayr Al-Nawaa and his companions. This one here debates by saying: <span class=\"ibTxt\">“<a href=\"/#/books/quran:5#h44\">[5:44]</a> and whoever did not judge by what Allah revealed, those are they that are the unbelievers” “<a href=\"/#/books/quran:5#h45\">[5:45]</a> and whoever did not judge by what Allah revealed, those are they that are the unjust.” “<a href=\"/#/books/quran:5#h47\">[5:47]</a> and whoever did not judge by what Allah revealed, those are they that are the transgressors”</span>.’"
          ],
          "en.sarwar": [
            "320. Al-Husayn Bin Muhammad La Ashary, from Moala Bin Muhammad, from Al-Hassan Bin Ali Al-Washa, from Aban Bin Usman, from Abu Baseer who said: I was seated in the presence of Abu Abdullah (a.s.) when Umm Khalid, who had been cut off by Yusuf Bin Umar, came up and sought permission to see him (a.s.). So Abu Abdullah (a.s.) said; ‘Would it please you to hear her words?’ So I said, ‘Yes’. He (a.s.) said: ‘As for now, give permission to her’. And he (a.s.) made me sit on settee along with him (a.s.)’. Then she came in, and she spoke. She was an eloquent woman. So she asked about the two of them. So he (a.s.) said: ‘Consider them as friends. She said, ‘So shalI I say to my Lord (azwj) when I meet Him (azwj) that you (a.s.) have ordered me to befriend these two?’ So he (a.s.) said: ‘Yes’. She said, ‘This one who is with you (a.s.) upon the settee has ordered me to distance myself from those two, and Kusayr Al-Nawaa has ordered me to befriend those two. So which one is better and more beloved to you (a.s.)?’ He (a.s.) said: ‘By Allah (azwj)! This one is more beloved to me (a.s.) than Kusayr Al-Nawaa and his companions. This one here debates by saying: “<a href=\"/#/books/quran:5#h44\">[5:44]</a> and whoever did not judge by what Allah revealed, those are they that are the unbelievers” “<a href=\"/#/books/quran:5#h45\">[5:45]</a> and whoever did not judge by what Allah revealed, those are they that are the unjust.” “<a href=\"/#/books/quran:5#h47\">[5:47]</a> and whoever did not judge by what Allah revealed, those are they that are the transgressors”.’"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 183)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15005,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:8",
        "text": [
          "14768- عَنْهُ عَنِ الْمُعَلَّى عَنِ الْحَسَنِ عَنْ أَبَانٍ عَنْ أَبِي هَاشِمٍ قَالَ لَمَّا أُخْرِجَ بِعَلِيٍّ (عليه السلام) خَرَجَتْ فَاطِمَةُ (عليها السلام) وَاضِعَةً قَمِيصَ رَسُولِ اللَّهِ (صلى الله عليه وآله) عَلَى رَأْسِهَا آخِذَةً بِيَدَيِ ابْنَيْهَا فَقَالَتْ مَا لِي وَ مَا لَكَ يَا أَبَا بَكْرٍ تُرِيدُ أَنْ تُؤَتِّمَ ابْنَيَّ وَ تُرْمِلَنِي مِنْ زَوْجِي وَ اللَّهِ لَوْ لَا أَنْ تَكُونَ سَيِّئَةً لَنَشَرْتُ شَعْرِي وَ لَصَرَخْتُ إِلَى رَبِّي فَقَالَ رَجُلٌ مِنَ الْقَوْمِ مَا تُرِيدُ إِلَى هَذَا ثُمَّ أَخَذَتْ بِيَدِهِ فَانْطَلَقَتْ بِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473449\">H 14768</a> – From him, from Al-Moala, from Al-Hassan, from Aban, from Abu hashim who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-w\">W</span>hen they came out</span> with Ali<sup>asws</sup>, Fatima<sup>asws</sup> also came out having placed the shirt of the Rasool Allah<sup>saww</sup> upon her<sup>asws</sup> head, taking her<sup>asws</sup> two sons<sup>asws</sup> by the hand. So she<sup>asws</sup> said: ‘What is it between me<sup>asws</sup> and you, O Abu Bakr that you want to orphan my<sup>asws</sup> two sons<sup>asws</sup> and widow me<sup>asws</sup> from my<sup>asws</sup> husband<sup>asws</sup>? By Allah<sup>azwj</sup>! Had it not been a sin, I<sup>asws</sup> would have released my<sup>asws</sup> hair and cried out to my<sup>asws</sup> Lord<sup>azwj</sup>!’ So a man from the people said, ‘What do you want (from all) this?’ Then she<sup>asws</sup> took him<sup>asws</sup> (Ali<sup>asws</sup>) by his<sup>asws</sup> hand and left with him<sup>asws</sup>’. "
          ],
          "en.sarwar": [
            "321. From him, from Al-Moala, from Al-Hassan, from Aban, from Abu hashim who said: When they came out with Ali (a.s.), Fatima (a.s.) also came out having placed the shirt of the Rasool Allah (saww) upon her (a.s.) head, taking her (a.s.) two sons (a.s.) by the hand. So she (a.s.) said: ‘What is it between me (a.s.) and you, O Abu Bakr that you want to orphan my (a.s.) two sons (a.s.) and widow me (a.s.) from my (a.s.) husband (a.s.)? By Allah (azwj)! Had it not been a sin, I (a.s.) would have released my (a.s.) hair and cried out to my (a.s.) Lord (azwj)!’ So a man from the people said, ‘What do you want (from all) this?’ Then she (a.s.) took him (a.s.) (Ali (a.s.)) by his (a.s.) hand and left with him (a.s.)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 194)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15006,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:9",
        "text": [
          "14769- أَبَانٌ عَنْ عَلِيِّ بْنِ عَبْدِ الْعَزِيزِ عَنْ عَبْدِ الْحَمِيدِ الطَّائِيِّ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ وَ اللَّهِ لَوْ نَشَرَتْ شَعْرَهَا مَاتُوا طُرّاً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473450\">H 14769</a> – Abaan, from Ali Bin Abdul Aziz, from Abdul Hameed Al-Ta’any, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> has said; ‘By Allah<sup>azwj</sup>! Had she<sup>asws</sup> spread her<sup>asws</sup> hair, they would have all died’."
          ],
          "en.sarwar": [
            "322. Abaan, from Ali Bin Abdul Aziz, from Abdul Hameed Al-Ta’any, who has said: Abu Ja’far (a.s.) has said; ‘By Allah (azwj)! Had she (a.s.) spread her (a.s.) hair, they would have all died’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 194)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15007,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:10",
        "text": [
          "14770- أَبَانٌ عَنِ ابْنِ أَبِي يَعْفُورٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) إِنَّ وَلَدَ الزِّنَا يُسْتَعْمَلُ إِنْ عَمِلَ خَيْراً جُزِئَ بِهِ وَ إِنْ عَمِلَ شَرّاً جُزِئَ بِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473451\">H 14770</a> – Abaan, from Ibn Abu Ya’four who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘The one of adulterous birth should (also) perform deeds. If his deeds are good he would be Recompensated for it, and if his deeds are evil he would be Recompensed for it’."
          ],
          "en.sarwar": [
            "323. Abaan, from Ibn Abu Ya’four who said: Abu Abdullah (a.s.) said: ‘The one of adulterous birth should (also) perform deeds. If his deeds are good he would be Recompensated for it, and if his deeds are evil he would be Recompensed for it’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 194)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15008,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:11",
        "text": [
          "14771- أَبَانٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ خَرَجَ رَسُولُ اللَّهِ (صلى الله عليه وآله) مِنْ حُجْرَتِهِ وَ مَرْوَانُ وَ أَبُوهُ يَسْتَمِعَانِ إِلَى حَدِيثِهِ فَقَالَ لَهُ الْوَزَغُ ابْنُ الْوَزَغِ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) فَمِنْ يَوْمِئِذٍ يَرَوْنَ أَنَّ الْوَزَغَ يَسْمَعُ الْحَدِيثَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473452\">H 14771</a> – Abaan, from Abdul Rahmaan Bin Abu Abdullah who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘The Rasool Allah<sup>saww</sup> came out of his<sup>saww</sup> chamber, and Marwaan and his father were both trying to listen to his<sup>saww</sup> narration. So he<sup>saww</sup> said for him: ‘The lizard, son of a lizard!’ Abu Abdullah<sup>asws</sup> said: ‘From that time they are reporting that the lizard listens to the narrations’. "
          ],
          "en.sarwar": [
            "324. Abaan, from Abdul Rahmaan Bin Abu Abdullah who said: I heard Abu Abdullah (a.s.) saying: ‘The Rasool Allah (saww) came out of his (saww) chamber, and Marwaan and his father were both trying to listen to his (saww) narration. So he (saww) said for him: ‘The lizard, son of a lizard!’ Abu Abdullah (a.s.) said: ‘From that time they are reporting that the lizard listens to the narrations’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 195)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15009,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:12",
        "text": [
          "14772- أَبَانٌ عَنْ زُرَارَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ (عليه السلام) يَقُولُ لَمَّا وُلِدَ مَرْوَانُ عَرَضُوا بِهِ لِرَسُولِ اللَّهِ (صلى الله عليه وآله) أَنْ يَدْعُوَ لَهُ فَأَرْسَلُوا بِهِ إِلَى عَائِشَةَ لِيَدْعُوَ لَهُ فَلَمَّا قَرَّبَتْهُ مِنْهُ قَالَ أَخْرِجُوا عَنِّي الْوَزَغَ ابْنَ الْوَزَغِ قَالَ زُرَارَةُ وَ لَا أَعْلَمُ إِلَّا أَنَّهُ قَالَ وَ لَعَنَهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473453\">H 14772</a> – Abaan, from Zurara who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Ja’far</span><sup>asws</sup> saying; ‘When Marwan was born, they presented him to the Rasool Allah<sup>saww</sup> to supplicate for him. So they went with him to Ayesha so that (Prophet<sup>saww</sup> would) supplicate for him. So when she went near him, he<sup>saww</sup> said, ‘Take him away from me, the lizard son of the lizard’. Zurara (the narrator) said, ‘And I don’t know (more but) except that he<sup>saww</sup> said it, and cursed him (Marwan)’."
          ],
          "en.sarwar": [
            "325. Abaan, from Zurara who said: I heard Abu Ja’far (a.s.) saying; ‘When Marwan was born, they presented him to the Rasool Allah (saww) to supplicate for him. So they went with him to Ayesha so that (Prophet (saww) would) supplicate for him. So when she went near him, he (saww) said, ‘Take him away from me, the lizard son of the lizard’. Zurara (the narrator) said, ‘And I don’t know (more but) except that he (saww) said it, and cursed him (Marwan)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 195)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15010,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:13",
        "refs": {
          "Quran": [
            "/books/quran:68:6",
            "/books/quran:47:22"
          ]
        },
        "text": [
          "14773- أَبَانٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِي الْعَبَّاسِ الْمَكِّيِّ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ (عليه السلام) يَقُولُ إِنَّ عُمَرَ لَقِيَ أَمِيرَ الْمُؤْمِنِينَ (عليه السلام) فَقَالَ أَنْتَ الَّذِي تَقْرَأُ هَذِهِ الْآيَةَ بِأَيِّكُمُ الْمَفْتُونُ تَعَرُّضاً بِي وَ بِصَاحِبِي قَالَ أَ فَلَا أُخْبِرُكَ بِآيَةٍ نَزَلَتْ فِي بَنِي أُمَيَّةَ فَهَلْ عَسَيْتُمْ إِنْ تَوَلَّيْتُمْ أَنْ تُفْسِدُوا فِي الْأَرْضِ وَ تُقَطِّعُوا أَرْحامَكُمْ فَقَالَ كَذَبْتَ بَنُو أُمَيَّةَ أَوْصَلُ لِلرَّحِمِ مِنْكَ وَ لَكِنَّكَ أَبَيْتَ إِلَّا عَدَاوَةً لِبَنِي تَيْمٍ وَ عَدِيٍّ وَ بَنِي أُمَيَّةَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473454\">H 14773</a> – Abaan, from Abdul Rahmaan Bin Abu Abdullah, from Abu Al-Abbas Al-Makky who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Ja’far</span><sup>asws</sup> saying that: ‘Umar met Amir-ul-Momineen<sup>asws</sup> and said, ‘You<sup>asws</sup> are the one who recites this Verse: <span class=\"ibTxt\">“<a href=\"/#/books/quran:68#h6\">[68:6]</a> Which of you is afflicted with madness”</span>, applying it to me and my companion (abu Bakr)’. He<sup>asws</sup> said: ‘Shall I<sup>asws</sup> not inform you of the Verse which Descended regarding the Clan of Umayya: <span class=\"ibTxt\">“<a href=\"/#/books/quran:47#h22\">[47:22]</a> But if you held command, you were sure to make mischief in the land and cut off the ties of kinship!”</span>. So he said, ‘You<sup>asws</sup> are lying. The Clan of Umayya establish more ties of kinship than you<sup>asws</sup> do, but you<sup>asws</sup> are most insistent upon enmity to the Clan of Taym (Abu Bakr’s tribe) and Udayy (Umar’s tribe), and the Clan of Umayya’."
          ],
          "en.sarwar": [
            "326. Abaan, from Abdul Rahmaan Bin Abu Abdullah, from Abu Al-Abbas Al-Makky who said: I heard Abu Ja’far (a.s.) saying that: ‘Umar met Amir-ul-Momineen (a.s.) and said, ‘You (a.s.) are the one who recites this Verse: “<a href=\"/#/books/quran:68#h6\">[68:6]</a> Which of you is afflicted with madness”, applying it to me and my companion (abu Bakr)’. He (a.s.) said: ‘Shall I (a.s.) not inform you of the Verse which Descended regarding the Clan of Umayya: “<a href=\"/#/books/quran:47#h22\">[47:22]</a> But if you held command, you were sure to make mischief in the land and cut off the ties of kinship!”. So he said, ‘You (a.s.) are lying. The Clan of Umayya establish more ties of kinship than you (a.s.) do, but you (a.s.) are most insistent upon enmity to the Clan of Taym (Abu Bakr’s tribe) and Udayy (Umar’s tribe), and the Clan of Umayya’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 198)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15011,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:14",
        "text": [
          "14774- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ كَانَ عَلِيٌّ (عليه السلام) يَقُومُ فِي الْمَطَرِ أَوَّلَ مَا يَمْطُرُ حَتَّى يَبْتَلَّ رَأْسُهُ وَ لِحْيَتُهُ وَ ثِيَابُهُ فَقِيلَ لَهُ يَا أَمِيرَ الْمُؤْمِنِينَ الْكِنَّ الْكِنَّ فَقَالَ إِنَّ هَذَا مَاءٌ قَرِيبُ عَهْدٍ بِالْعَرْشِ ",
          "ثُمَّ أَنْشَأَ يُحَدِّثُ فَقَالَ إِنَّ تَحْتَ الْعَرْشِ بَحْراً فِيهِ مَاءٌ يُنْبِتُ أَرْزَاقَ الْحَيَوَانَاتِ فَإِذَا أَرَادَ اللَّهُ عَزَّ ذِكْرُهُ أَنْ يُنْبِتَ بِهِ مَا يَشَاءُ لَهُمْ رَحْمَةً مِنْهُ لَهُمْ أَوْحَى اللَّهُ إِلَيْهِ فَمَطَرَ مَا شَاءَ مِنْ سَمَاءٍ إِلَى سَمَاءٍ حَتَّى يَصِيرَ إِلَى سَمَاءِ الدُّنْيَا فِيمَا أَظُنُّ فَيُلْقِيَهُ إِلَى السَّحَابِ وَ السَّحَابُ بِمَنْزِلَةِ الْغِرْبَالِ ثُمَّ يُوحِي اللَّهُ إِلَى الرِّيحِ أَنِ اطْحَنِيهِ وَ أَذِيبِيهِ ذَوَبَانَ الْمَاءِ ثُمَّ انْطَلِقِي بِهِ إِلَى مَوْضِعِ كَذَا وَ كَذَا فَامْطُرِي عَلَيْهِمْ فَيَكُونَ كَذَا وَ كَذَا عُبَاباً وَ غَيْرَ ذَلِكَ ",
          "فَتَقْطُرُ عَلَيْهِمْ عَلَى النَّحْوِ الَّذِي يَأْمُرُهَا بِهِ فَلَيْسَ مِنْ قَطْرَةٍ تَقْطُرُ إِلَّا وَ مَعَهَا مَلَكٌ حَتَّى يَضَعَهَا مَوْضِعَهَا وَ لَمْ يَنْزِلْ مِنَ السَّمَاءِ قَطْرَةٌ مِنْ مَطَرٍ إِلَّا بِعَدَدٍ مَعْدُودٍ وَ وَزْنٍ مَعْلُومٍ إِلَّا مَا كَانَ مِنْ يَوْمِ الطُّوفَانِ عَلَى عَهْدِ نُوحٍ (عليه السلام) فَإِنَّهُ نَزَلَ مَاءٌ مُنْهَمِرٌ بِلَا وَزْنٍ وَ لَا عَدَدٍ قَالَ ",
          "وَ حَدَّثَنِي أَبُو عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ لِيَ أَبِي (عليه السلام) قَالَ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) إِنَّ اللَّهَ عَزَّ وَ جَلَّ جَعَلَ السَّحَابَ غَرَابِيلَ لِلْمَطَرِ هِيَ تُذِيبُ الْبَرَدَ حَتَّى يَصِيرَ مَاءً لِكَيْ لَا يُضِرَّ بِهِ شَيْئاً يُصِيبُهُ الَّذِي تَرَوْنَ فِيهِ مِنَ الْبَرَدِ وَ الصَّوَاعِقِ نَقِمَةٌ مِنَ اللَّهِ عَزَّ وَ جَلَّ يُصِيبُ بِهَا مَنْ يَشَاءُ مِنْ عِبَادِهِ ثُمَّ قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) لَا تُشِيرُوا إِلَى الْمَطَرِ وَ لَا إِلَى الْهِلَالِ فَإِنَّ اللَّهَ يَكْرَهُ ذَلِكَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473455\">H 14774</a> – Ali Bin Ibrahim, from Haroun Bin Muslim, from Mas’ada Bin Sadaqa, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘Ali<sup>asws</sup> used to stand in the first downpour when it rained, to the extent that his<sup>asws</sup> head, and his<sup>asws</sup> beard, and his<sup>asws</sup> clothes would get wet. So it was said to him<sup>asws</sup>, ‘O Amir-ul-Momineen<sup>asws</sup>! Take shelter, take shelter!’ So he<sup>asws</sup> would say that: ‘This is water from near the Throne’.",
            "Then he<sup>asws</sup> went on to narrate: ‘Underneath the Throne there is an ocean in which there is water which makes the sustenance of the animals to grow. So if Allah<sup>azwj</sup> Intends that He<sup>azwj</sup> should Make to grow whatever that He<sup>azwj</sup> so Desires to for them as a Mercy for them, Allah<sup>azwj</sup> Reveals to it. So it rains from sky to sky until it comes to the sky of the world to the clouds. And the clouds are at the status of the sieve. Then Allah<sup>azwj</sup> Reveals to the wind to grind it and melt it, dissolving the water. Then it takes it to such and such a place and pours upon it. So that becomes such and such a torrent and other than that. ",
            "Thus, it rains upon the area which it had been Ordered to. There is no drop from the drops except that there is an Angel with it until he places it in a particular place. There does not descend a drop from the sky except that it is numbered precisely and is of a known weight, except when it was the day of the storm in the era of Noah<sup>as</sup>, on that day it poured without measurement or number’. ",
            "And Abu Abdullah<sup>asws</sup> narrated to me saying: ‘My<sup>asws</sup> father said to me<sup>asws</sup>, that Amir-ul-Momineen<sup>asws</sup> said, that the Rasool Allah<sup>saww</sup> said: ‘Allah<sup>azwj</sup> Made the cloud to be as a sieve for the rain, and the sleet melts until it becomes water, not harming anything by it. The harm is what you see from the sleet and the lightning as a Wrath from Allah<sup>azwj</sup> Harming whosoever He<sup>azwj</sup> so desires from His<sup>azwj</sup> servants’. Then he<sup>asws</sup> said: ‘Then the Rasool Allah<sup>saww</sup> said: ‘Do not point (accuse) the rain or the crescent, for Allah<sup>azwj</sup> Abhors that’."
          ],
          "en.sarwar": [
            "327. Ali Bin Ibrahim, from Haroun Bin Muslim, from Mas’ada Bin Sadaqa, who has said: Abu Abdullah (a.s.) having said: ‘Ali (a.s.) used to stand in the first downpour when it rained, to the extent that his (a.s.) head, and his (a.s.) beard, and his (a.s.) clothes would get wet. So it was said to him (a.s.), ‘O Amir-ul-Momineen (a.s.)! Take shelter, take shelter!’ So he (a.s.) would say that: ‘This is water from near the Throne’. Then he (a.s.) went on to narrate: ‘Underneath the Throne there is an ocean in which there is water which makes the sustenance of the animals to grow. So if Allah (azwj) Intends that He (azwj) should Make to grow whatever that He (azwj) so Desires to for them as a Mercy for them, Allah (azwj) Reveals to it. So it rains from sky to sky until it comes to the sky of the world to the clouds. And the clouds are at the status of the sieve. Then Allah (azwj) Reveals to the wind to grind it and melt it, dissolving the water. Then it takes it to such and such a place and pours upon it. So that becomes such and such a torrent and other than that. Thus, it rains upon the area which it had been Ordered to. There is no drop from the drops except that there is an Angel with it until he places it in a particular place. There does not descend a drop from the sky except that it is numbered precisely and is of a known weight, except when it was the day of the storm in the era of Noah (as), on that day it poured without measurement or number’. And Abu Abdullah (a.s.) narrated to me saying: ‘My (a.s.) father said to me (a.s.), that Amir-ul-Momineen (a.s.) said, that the Rasool Allah (saww) said: ‘Allah (azwj) Made the cloud to be as a sieve for the rain, and the sleet melts until it becomes water, not harming anything by it. The harm is what you see from the sleet and the lightning as a Wrath from Allah (azwj) Harming whosoever He (azwj) so desires from His (azwj) servants’. Then he (a.s.) said: ‘Then the Rasool Allah (saww) said: ‘Do not point (accuse) the rain or the crescent, for Allah (azwj) Abhors that’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 200)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15012,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:15",
        "text": [
          "14775- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ رَفَعَهُ قَالَ كَتَبَ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) إِلَى ابْنِ عَبَّاسٍ أَمَّا بَعْدُ فَقَدْ يَسُرُّ الْمَرْءَ مَا لَمْ يَكُنْ لِيَفُوتَهُ وَ يَحْزُنُهُ مَا لَمْ يَكُنْ لِيُصِيبَهُ أَبَداً وَ إِنْ جَهَدَ فَلْيَكُنْ سُرُورُكَ بِمَا قَدَّمْتَ مِنْ عَمَلٍ صَالِحٍ أَوْ حُكْمٍ أَوْ قَوْلٍ وَ لْيَكُنْ أَسَفُكَ فِيمَا فَرَّطْتَ فِيهِ مِنْ ذَلِكَ وَ دَعْ مَا فَاتَكَ مِنَ الدُّنْيَا فَلَا تُكْثِرْ عَلَيْهِ حَزَناً وَ مَا أَصَابَكَ مِنْهَا فَلَا تَنْعَمْ بِهِ سُرُوراً وَ لْيَكُنْ هَمُّكَ فِيمَا بَعْدَ الْمَوْتِ وَ السَّلَامُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473456\">H 14775</a> – A number of our companions, from Sahl Bin Ziyad, from Ali Bin Asbaat with an unbroken chain, said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>mir-ul-Momineen</span><sup>asws</sup> wrote to Ibn Abbas: ‘Having said that, what has made the person happy is what he did not miss, and grieved for what he never could have got, ever. The efforts that you have made should make you happy with what you have sent forward from the righteous deeds, or Judgement, or speech, and it is to your regret regarding what you have neglected from that. And leave what you have missed from the world and do not grieve a lot for it. And what you have got from it, do not enjoy in its delight, but ponder over what comes after the death. With greetings’. "
          ],
          "en.sarwar": [
            "328. A number of our companions, from Sahl Bin Ziyad, from Ali Bin Asbaat with an unbroken chain, said: Amir-ul-Momineen (a.s.) wrote to Ibn Abbas: ‘Having said that, what has made the person happy is what he did not miss, and grieved for what he never could have got, ever. The efforts that you have made should make you happy with what you have sent forward from the righteous deeds, or Judgement, or speech, and it is to your regret regarding what you have neglected from that. And leave what you have missed from the world and do not grieve a lot for it. And what you have got from it, do not enjoy in its delight, but ponder over what comes after the death. With greetings’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 201)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 396)"
        ],
        "index": 15013,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:16",
        "text": [
          "14776- سَهْلُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ كَرَّامٍ عَنْ أَبِي الصَّامِتِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ مَرَرْتُ أَنَا وَ أَبُو جَعْفَرٍ (عليه السلام) عَلَى الشِّيعَةِ وَ هُمْ مَا بَيْنَ الْقَبْرِ وَ الْمِنْبَرِ فَقُلْتُ لِأَبِي جَعْفَرٍ (عليه السلام) شِيعَتُكَ وَ مَوَالِيكَ جَعَلَنِيَ اللَّهُ فِدَاكَ قَالَ أَيْنَ هُمْ فَقُلْتُ أَرَاهُمْ مَا بَيْنَ الْقَبْرِ وَ الْمِنْبَرِ فَقَالَ اذْهَبْ بِي إِلَيْهِمْ فَذَهَبَ فَسَلَّمَ عَلَيْهِمْ ثُمَّ قَالَ وَ اللَّهِ إِنِّي لَأُحِبُّ رِيحَكُمْ وَ أَرْوَاحَكُمْ فَأَعِينُوا مَعَ هَذَا بِوَرَعٍ وَ اجْتِهَادٍ إِنَّهُ لَا يُنَالُ مَا عِنْدَ اللَّهِ إِلَّا بِوَرَعٍ وَ اجْتِهَادٍ وَ إِذَا ائْتَمَمْتُمْ بِعَبْدٍ فَاقْتَدُوا بِهِ أَمَا وَ اللَّهِ إِنَّكُمْ لَعَلَى دِينِي وَ دِينِ آبَائِي إِبْرَاهِيمَ وَ إِسْمَاعِيلَ وَ إِنْ كَانَ هَؤُلَاءِ عَلَى دِينِ أُولَئِكَ فَأَعِينُوا عَلَى هَذَا بِوَرَعٍ وَ اجْتِهَادٍ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473457\">H 14776</a> – Sahl Bin Ziyad, from Al-Hassan Bin Ali, from Karraam, from Abu Al-Saamat, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘I<sup>asws</sup> and Abu Ja’far<sup>asws</sup> passed by the Shites whilst they were in between the Grave and the Pulpit (of the Rasool Allah<sup>saww</sup>). So I<sup>asws</sup> said to Abu Ja’far<sup>asws</sup>: ‘May I<sup>asws</sup> be sacrificed for you<sup>asws</sup>, these are your<sup>asws</sup> Shites and your<sup>asws</sup> friends’. He<sup>asws</sup> said: ‘Where are they?’ I<sup>asws</sup> said: ‘In between the Grave and the Pulpit’. He<sup>asws</sup> said: ‘So come with me<sup>asws</sup> to them’. So he<sup>asws</sup> went and greeted them, then said: ‘I<sup>asws</sup> love your aromas, and your souls, so support this with piety and struggle. What is with Allah<sup>azwj</sup> cannot be achieved except by piety and struggle, and if you follow a servant (an Imam<sup>asws</sup>), so follow him (emulate his<sup>asws</sup> deeds). But, by Allah<sup>azwj</sup>, all of you are upon my<sup>asws</sup> Religion, and the Religion of my<sup>asws</sup> forefather Ibrahim<sup>as</sup> and Ismail<sup>as</sup>, and if these were upon a Religion so they supported this by piety and struggle’."
          ],
          "en.sarwar": [
            "329. Sahl Bin Ziyad, from Al-Hassan Bin Ali, from Karraam, from Abu Al-Saamat, who has narrated the following: Abu Abdullah (a.s.) having said: ‘I (a.s.) and Abu Ja’far (a.s.) passed by the Shites whilst they were in between the Grave and the Pulpit (of the Rasool Allah (saww)). So I (a.s.) said to Abu Ja’far (a.s.): ‘May I (a.s.) be sacrificed for you (a.s.), these are your (a.s.) Shites and your (a.s.) friends’. He (a.s.) said: ‘Where are they?’ I (a.s.) said: ‘In between the Grave and the Pulpit’. He (a.s.) said: ‘So come with me (a.s.) to them’. So he (a.s.) went and greeted them, then said: ‘I (a.s.) love your aromas, and your souls, so support this with piety and struggle. What is with Allah (azwj) cannot be achieved except by piety and struggle, and if you follow a servant (an Imam (a.s.)), so follow him (emulate his (a.s.) deeds). But, by Allah (azwj), all of you are upon my (a.s.) Religion, and the Religion of my (a.s.) forefather Ibrahim (as) and Ismail (as), and if these were upon a Religion so they supported this by piety and struggle’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 201)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15014,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:17",
        "text": [
          "14777- أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنِ الْعَبَّاسِ بْنِ عَامِرٍعَنِ الرَّبِيعِ بْنِ مُحَمَّدٍ الْمُسْلِيِّ عَنْ أَبِي الرَّبِيعِ الشَّامِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ إِنَّ قَائِمَنَا إِذَا قَامَ مَدَّ اللَّهُ عَزَّ وَ جَلَّ لِشِيعَتِنَا فِي أَسْمَاعِهِمْ وَ أَبْصَارِهِمْ حَتَّى لَا يَكُونَ بَيْنَهُمْ وَ بَيْنَ الْقَائِمِ بَرِيدٌ يُكَلِّمُهُمُ فَيَسْمَعُونَ وَ يَنْظُرُونَ إِلَيْهِ وَ هُوَ فِي مَكَانِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473458\">H 14777</a> – Abu Ali Al-Ashary, from Al-Hassan Bin Ali Al-kufy, from Al-Abbas Bin Aamir, from Al-Rabi’e Bin Muhammad Al-Muslyy, from Abu Al-Rabi’e who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying that: ‘When our Qaim<sup>asws</sup> makes a stand, Allah<sup>azwj</sup> will extend the hearing of our<sup>asws</sup> Shites, and their vision to the extent that there will not be a postman in between them and Al-Qaim<sup>asws</sup>. They will be speaking, and hearing, and visualising him<sup>asws</sup> and he<sup>asws</sup> would be in Mecca’. "
          ],
          "en.sarwar": [
            "330. Abu Ali Al-Ashary, from Al-Hassan Bin Ali Al-kufy, from Al-Abbas Bin Aamir, from Al-Rabi’e Bin Muhammad Al-Muslyy, from Abu Al-Rabi’e who said: I heard Abu Abdullah (a.s.) saying that: ‘When our Qaim (a.s.) makes a stand, Allah (azwj) will extend the hearing of our (a.s.) Shites, and their vision to the extent that there will not be a postman in between them and Al-Qaim (a.s.). They will be speaking, and hearing, and visualising him (a.s.) and he (a.s.) would be in Mecca’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 202)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15015,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:18",
        "text": [
          "14778- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ هَارُونَ بْنِ خَارِجَةَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ مَنِ اسْتَخَارَ اللَّهَ رَاضِياً بِمَا صَنَعَ اللَّهُ لَهُ خَارَ اللَّهُ لَهُ حَتْماً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473459\">H 14778</a> – A number of our companions, from Sahl Bin Ziyad, from Usman Bin Isa, from haroun Bin Kharjat, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘The one who leaves the choice to Allah<sup>azwj</sup> and is happy with whatsoever Allah<sup>azwj</sup> Chooses for him, Allah<sup>azwj</sup> will inevitably Choose good for him’. "
          ],
          "en.sarwar": [
            "331. A number of our companions, from Sahl Bin Ziyad, from Usman Bin Isa, from haroun Bin Kharjat, who has said: Abu Abdullah (a.s.) has said: ‘The one who leaves the choice to Allah (azwj) and is happy with whatsoever Allah (azwj) Chooses for him, Allah (azwj) will inevitably Choose good for him’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 202)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15016,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:19",
        "text": [
          "14779- سَهْلُ بْنُ زِيَادٍ عَنْ دَاوُدَ بْنِ مِهْرَانَ عَنْ عَلِيِّ بْنِ إِسْمَاعِيلَ الْمِيثَمِيِّ عَنْ رَجُلٍ عَنْ جُوَيْرِيَةَ بْنِ مُسْهِرٍ قَالَ اشْتَدَدْتُ خَلْفَ أَمِيرِ الْمُؤْمِنِينَ (عليه السلام) فَقَالَ لِي يَا جُوَيْرِيَةُ إِنَّهُ لَمْ يَهْلِكْ هَؤُلَاءِ الْحَمْقَى إِلَّا بِخَفْقِ النِّعَالِ خَلْفَهُمْ مَا جَاءَ بِكَ قُلْتُ جِئْتُ أَسْأَلُكَ عَنْ ثَلَاثٍ عَنِ الشَّرَفِ وَ عَنِ الْمُرُوءَةِ وَ عَنِ الْعَقْلِ قَالَ أَمَّا الشَّرَفُ فَمَنْ شَرَّفَهُ السُّلْطَانُ شَرُفَ وَ أَمَّا الْمُرُوءَةُ فَإِصْلَاحُ الْمَعِيشَةِ وَ أَمَّا الْعَقْلُ فَمَنِ اتَّقَى اللَّهَ عَقَلَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473460\">H 14779</a> – Sahl Bin Ziyad, from Dawood Bin Mahraan, from Ali Bin Ismail Al-Maysamy, from a man from Juweyriyya Bin Mus’har who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> hurried behind Amir</span>-ul-Momineen<sup>asws</sup>, so he<sup>asws</sup> said to me: ‘O Juweyriyya! Those idiots were not destroyed except by the sound of the shoes behind them which followed them’. I said, ‘I came to ask you<sup>asws</sup> about three – about the nobility, and the chivalry, and the intellect’. He<sup>asws</sup> said: ‘As for the nobility, so the one whom ‘السُّلْطَانُ’ Allah<sup>azwj</sup> has Ennobled, is noble, and as for the chivalrous, so it is the righteous means for living, and as for the intellect, so the one who fears Allah<sup>azwj</sup> is the intellectual’."
          ],
          "en.sarwar": [
            "332. Sahl Bin Ziyad, from Dawood Bin Mahraan, from Ali Bin Ismail Al-Maysamy, from a man from Juweyriyya Bin Mus’har who said: I hurried behind Amir-ul-Momineen (a.s.), so he (a.s.) said to me: ‘O Juweyriyya! Those idiots were not destroyed except by the sound of the shoes behind them which followed them’. I said, ‘I came to ask you (a.s.) about three – about the nobility, and the chivalry, and the intellect’. He (a.s.) said: ‘As for the nobility, so the one whom ‘السُّلْطَانُ’ Allah (azwj) has Ennobled, is noble, and as for the chivalrous, so it is the righteous means for living, and as for the intellect, so the one who fears Allah (azwj) is the intellectual’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 203)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15017,
        "local_index": 20,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:20",
        "text": [
          "14780- سَهْلُ بْنُ زِيَادٍ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ عَلِيِّ بْنِ أَبِي النَّوَارِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ (عليه السلام) جُعِلْتُ فِدَاكَ لِأَيِّ شَيْ‏ءٍ صَارَتِ الشَّمْسُ أَشَدَّ حَرَارَةً مِنَ الْقَمَرِ فَقَالَ إِنَّ اللَّهَ خَلَقَ الشَّمْسَ مِنْ نُورِ النَّارِ وَ صَفْوِ الْمَاءِ طَبَقاً مِنْ هَذَا وَ طَبَقاً مِنْ هَذَا حَتَّى إِذَا كَانَتْ سَبْعَةَ أَطْبَاقٍ أَلْبَسَهَا لِبَاساً مِنْ نَارٍ فَمِنْ ثَمَّ صَارَتْ أَشَدَّ حَرَارَةً مِنَ الْقَمَرِ قُلْتُ جُعِلْتُ فِدَاكَ وَ الْقَمَرُ قَالَ إِنَّ اللَّهِ تَعَالَى ذِكْرُهُ خَلَقَ الْقَمَرَ مِنْ ضَوْءِ نُورِ النَّارِ وَ صَفْوِ الْمَاءِ طَبَقاً مِنْ هَذَا وَ طَبَقاً مِنْ هَذَا حَتَّى إِذَا كَانَتْ سَبْعَةَ أَطْبَاقٍ أَلْبَسَهَا لِبَاساً مِنْ مَاءٍ فَمِنْ ثَمَّ صَارَ الْقَمَرُ أَبْرَدَ مِنَ الشَّمْسِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473461\">H 14780</a> – Sahl Bin Ziyad, from Ali Bin Hassaan, from Ali Bin Abu Al-Nawaar, from Muhammad Bin Muslim who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> said to Abu Ja’far</span><sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>. Which is that thing which makes the sun to be hotter than the moon?’ So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Created the sun from the light of the fire and clearness of the water, a layer from this and a layer from this until there were seven layers, then clothed it with a clothing from the fire. Then it became hotter than the moon’. I said, ‘May I be sacrificed for you, and the moon?’ He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Created the moon from the illumination of the light of the fire and clearness of the water, a layer from this and a layer from this until there were seven layers, then clothed it in a clothing of water, so the moon became colder than the sun’."
          ],
          "en.sarwar": [
            "333. Sahl Bin Ziyad, from Ali Bin Hassaan, from Ali Bin Abu Al-Nawaar, from Muhammad Bin Muslim who said: I said to Abu Ja’far (a.s.), ‘May I be sacrificed for you (a.s.). Which is that thing which makes the sun to be hotter than the moon?’ So he (a.s.) said: ‘Allah (azwj) Created the sun from the light of the fire and clearness of the water, a layer from this and a layer from this until there were seven layers, then clothed it with a clothing from the fire. Then it became hotter than the moon’. I said, ‘May I be sacrificed for you, and the moon?’ He (a.s.) said: ‘Allah (azwj) Created the moon from the illumination of the light of the fire and clearness of the water, a layer from this and a layer from this until there were seven layers, then clothed it in a clothing of water, so the moon became colder than the sun’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 205)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15018,
        "local_index": 21,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:21",
        "text": [
          "14781- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ مُحَمَّدِ بْنِ الْهَيْثَمِ عَنْ زَيْدٍ أَبِي الْحَسَنِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ مَنْ كَانَتْ لَهُ حَقِيقَةٌ ثَابِتَةٌ لَمْ يَقُمْ عَلَى شُبْهَةٍ هَامِدَةٍ حَتَّى يَعْلَمَ مُنْتَهَى الْغَايَةِ وَ يَطْلُبَ الْحَادِثَ مِنَ النَّاطِقِ عَنِ الْوَارِثِ وَ بِأَيِّ شَيْ‏ءٍ جَهِلْتُمْ مَا أَنْكَرْتُمْ وَ بِأَيِّ شَيْ‏ءٍ عَرَفْتُمْ مَا أَبْصَرْتُمْ إِنْ كُنْتُمْ مُؤْمِنِينَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473462\">H 14781</a> – A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from one of our companions, from Muhammad Bin Al-Haysam, from Zayd Abu Al-Hassan who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘The one for whom the facts are established will never stand upon lifeless doubts. He will not stop until he comes to know the ultimate goal, and seeks the (explanation for) the newly emerging issues from the one who speaks from the inheritors<sup>asws</sup>, and for which thing you are ignorant of, what you have denied, and by which thing you have come to recognise what you have visualised, if you are Believers’."
          ],
          "en.sarwar": [
            "334. A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from one of our companions, from Muhammad Bin Al-Haysam, from Zayd Abu Al-Hassan who said: I heard Abu Abdullah (a.s.) saying: ‘The one for whom the facts are established will never stand upon lifeless doubts. He will not stop until he comes to know the ultimate goal, and seeks the (explanation for) the newly emerging issues from the one who speaks from the inheritors (a.s.), and for which thing you are ignorant of, what you have denied, and by which thing you have come to recognise what you have visualised, if you are Believers’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 205)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15019,
        "local_index": 22,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:22",
        "refs": {
          "Quran": [
            "/books/quran:21:18"
          ]
        },
        "text": [
          "14782- عَنْهُ عَنْ أَبِيهِ عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) لَيْسَ مِنْ بَاطِلٍ يَقُومُ بِإِزَاءِ الْحَقِّ إِلَّا غَلَبَ الْحَقُّ الْبَاطِلَ وَ ذَلِكَ قَوْلُهُ عَزَّ وَ جَلَّ بَلْ نَقْذِفُ بِالْحَقِّ عَلَى الْباطِلِ فَيَدْمَغُهُ فَإِذا هُوَ زاهِقٌ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473463\">H 14782</a> – From him, from his father, from Yunus Bin Abdul Rahmaan with an unbroken chain, said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘There is nothing from the falsehood which can stand up to the truth, but the truth will overcome the falsehood, and this is the Statement of the Mighty and Majestic<span class=\"ibTxt\">; “<a href=\"/#/books/quran:21#h18\">[21:18]</a> Nay! We cast the truth against the falsehood, so that it breaks its head, and lo! it vanishes”</span>."
          ],
          "en.sarwar": [
            "335. From him, from his father, from Yunus Bin Abdul Rahmaan with an unbroken chain, said: Abu Abdullah (a.s.) said: ‘There is nothing from the falsehood which can stand up to the truth, but the truth will overcome the falsehood, and this is the Statement of the Mighty and Majestic; “<a href=\"/#/books/quran:21#h18\">[21:18]</a> Nay! We cast the truth against the falsehood, so that it breaks its head, and lo! it vanishes”."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 206)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15020,
        "local_index": 23,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:23",
        "text": [
          "14783- عَنْهُ عَنْ أَبِيهِ مُرْسَلًا قَالَ قَالَ أَبُو جَعْفَرٍ (عليه السلام) لَا تَتَّخِذُوا مِنْ دُونِ اللَّهِ وَلِيجَةً فَلَا تَكُونُوا مُؤْمِنِينَ فَإِنَّ كُلَّ سَبَبٍ وَ نَسَبٍ وَ قَرَابَةٍ وَ وَلِيجَةٍ وَ بِدْعَةٍ وَ شُبْهَةٍ مُنْقَطِعٌ مُضْمَحِلٌّ كَمَا يَضْمَحِلُّ الْغُبَارُ الَّذِي يَكُونُ عَلَى الْحَجَرِ الصَّلْدِ إِذَا أَصَابَهُ الْمَطَرُ الْجَوْدُ إِلَّا مَا أَثْبَتَهُ الْقُرْآنُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473464\">H 14783</a> – From him, from his father, said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> said: ‘Do not take anyone other than Allah<sup>azwj</sup> as a confidant or else you will not remain a ‘Momin’ (Believer), for every reason, and lineage, and relationships, and confidants, and innovations, and doubts will be cut off. These will disappear like the dust which is upon a solid rock which disappears when abundant rain falls on it, except for what has been established by the Quran’."
          ],
          "en.sarwar": [
            "336. From him, from his father, said: Abu Ja’far (a.s.) said: ‘Do not take anyone other than Allah (azwj) as a confidant or else you will not remain a ‘Momin’ (Believer), for every reason, and lineage, and relationships, and confidants, and innovations, and doubts will be cut off. These will disappear like the dust which is upon a solid rock which disappears when abundant rain falls on it, except for what has been established by the Quran’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 207)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15021,
        "local_index": 24,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:24",
        "text": [
          "14784- عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ عَنْ عَبْدِ اللَّهِ بْنِ حَمَّادٍ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام)  قَالَ نَحْنُ أَصْلُ كُلِّ خَيْرٍ وَ مِنْ فُرُوعِنَا كُلُّ بِرٍّ فَمِنَ الْبِرِّ التَّوْحِيدُ وَ الصَّلَاةُ وَ الصِّيَامُ وَ كَظْمُ الْغَيْظِ وَ الْعَفْوُ عَنِ الْمُسِي‏ءِ وَ رَحْمَةُ الْفَقِيرِ وَ تَعَهُّدُ الْجَارِ وَ الْإِقْرَارُ بِالْفَضْلِ لِأَهْلِهِ ",
          "وَ عَدُوُّنَا أَصْلُ كُلِّ شَرٍّ وَ مِنْ فُرُوعِهِمْ كُلُّ قَبِيحٍ وَ فَاحِشَةٍ فَمِنْهُمُ الْكَذِبُ وَ الْبُخْلُ وَ النَّمِيمَةُ وَ الْقَطِيعَةُ وَ أَكْلُ الرِّبَا وَ أَكْلُ مَالِ الْيَتِيمِ بِغَيْرِ حَقِّهِ وَ تَعَدِّي الْحُدُودِ الَّتِي أَمَرَ اللَّهُ وَ رُكُوبُ الْفَوَاحِشِ مَا ظَهَرَ مِنْهَا وَ مَا بَطَنَ وَ الزِّنَا وَ السَّرِقَةُ وَ كُلُّ مَا وَافَقَ ذَلِكَ مِنَ الْقَبِيحِ فَكَذَبَ مَنْ زَعَمَ أَنَّهُ مَعَنَا وَ هُوَ مُتَعَلِّقٌ بِفُرُوعِ غَيْرِنَا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473465\">H 14784</a> – Ali Bin Muhammad Bin Abdullah, from Ibrahim Bin Is’haq, from Abdullah Bin Hammaad, from Ibn Muskaan, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said; ‘We<sup>asws</sup> are the origin of every good, and from our<sup>asws</sup> branches is every righteousness, So, from the righteousness is ‘التَّوْحِيدُ’ Oneness (Al-Tauheed), and the Prayer, and the Fasts, and suppression of the anger, and the pardoning others, and being merciful to the poor, and being helpful to the neighbour, and accepting the preference of the deserving ones.",
            "And our<sup>asws</sup> enemies are the origin of every evil, and from their branches is every ugliness and immorality. So, from these is the lie, and the niggardliness, and the slander, and the cutting-off (relationships), and consumption of the interest, and consumption of the wealth of the orphans without right, and infringement of the limits of the Commands of Allah<sup>azwj</sup>, commission of the immoral acts, the apparent from it as well as the hidden, and the adultery, and the theft, and every that which is consistent with that from the ugliness. So he has lied, the one who thinks he is with us<sup>asws</sup> whilst he attaches himself to the branches of others (which are) rather than ours<sup>asws</sup>’. "
          ],
          "en.sarwar": [
            "337. Ali Bin Muhammad Bin Abdullah, from Ibrahim Bin Is’haq, from Abdullah Bin Hammaad, from Ibn Muskaan, who has narrated the following: Abu Abdullah (a.s.) has said; ‘We (a.s.) are the origin of every good, and from our (a.s.) branches is every righteousness, So, from the righteousness is ‘التَّوْحِيدُ’ Oneness (Al-Tauheed), and the Prayer, and the Fasts, and suppression of the anger, and the pardoning others, and being merciful to the poor, and being helpful to the neighbour, and accepting the preference of the deserving ones. And our (a.s.) enemies are the origin of every evil, and from their branches is every ugliness and immorality. So, from these is the lie, and the niggardliness, and the slander, and the cutting-off (relationships), and consumption of the interest, and consumption of the wealth of the orphans without right, and infringement of the limits of the Commands of Allah (azwj), commission of the immoral acts, the apparent from it as well as the hidden, and the adultery, and the theft, and every that which is consistent with that from the ugliness. So he has lied, the one who thinks he is with us (a.s.) whilst he attaches himself to the branches of others (which are) rather than ours (a.s.)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 209)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 396)"
        ],
        "index": 15022,
        "local_index": 25,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:25",
        "text": [
          "14785- عَنْهُ وَ عَنْ غَيْرِهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ خَالِدِ بْنِ نَجِيحٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ لِرَجُلٍ اقْنَعْ بِمَا قَسَمَ اللَّهُ لَكَ وَ لَا تَنْظُرْ إِلَى مَا عِنْدَ غَيْرِكَ وَ لَا تَتَمَنَّ مَا لَسْتَ نَائِلَهُ فَإِنَّهُ مَنْ قَنِعَ شَبِعَ وَ مَنْ لَمْ يَقْنَعْ لَمْ يَشْبَعْ وَ خُذْ حَظَّكَ مِنْ آخِرَتِكَ ",
          "وَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) أَنْفَعُ الْأَشْيَاءِ لِلْمَرْءِ سَبْقُهُ النَّاسَ إِلَى عَيْبِ نَفْسِهِ وَ أَشَدُّ شَيْ‏ءٍ مَئُونَةً إِخْفَاءُ الْفَاقَةِ وَ أَقَلُّ الْأَشْيَاءِ غَنَاءً النَّصِيحَةُ لِمَنْ لَا يَقْبَلُهَا وَ مُجَاوَرَةُ الْحَرِيصِ وَ أَرْوَحُ الرَّوْحِ الْيَأْسُ مِنَ النَّاسِ وَ قَالَ لَا تَكُنْ ضَجِراً وَ لَا غَلِقاً وَ ذَلِّلْ نَفْسَكَ بِاحْتِمَالِ مَنْ خَالَفَكَ مِمَّنْ هُوَ فَوْقَكَ وَ مَنْ لَهُ الْفَضْلُ عَلَيْكَ فَإِنَّمَا أَقْرَرْتَ بِفَضْلِهِ لِئَلَّا تُخَالِفَهُ وَ مَنْ لَا يَعْرِفْ لِأَحَدٍ الْفَضْلَ فَهُوَ الْمُعْجَبُ بِرَأْيِهِ ",
          "وَ قَالَ لِرَجُلٍ اعْلَمْ أَنَّهُ لَا عِزَّ لِمَنْ لَا يَتَذَلَّلُ لِلَّهِ تَبَارَكَ وَ تَعَالَى وَ لَا رِفْعَةَ لِمَنْ لَمْ يَتَوَاضَعْ لِلَّهِ عَزَّ وَ جَلَّ وَ قَالَ لِرَجُلٍ أَحْكِمْ أَمْرَ دِينِكَ كَمَا أَحْكَمَ أَهْلُ الدُّنْيَا أَمْرَ دُنْيَاهُمْ فَإِنَّمَا جُعِلَتِ الدُّنْيَا شَاهِداً يُعْرَفُ بِهَا مَا غَابَ عَنْهَا مِنَ الْآخِرَةِ فَاعْرِفِ الْآخِرَةَ بِهَا وَ لَا تَنْظُرْ إِلَى الدُّنْيَا إِلَّا بِالِاعْتِبَارِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473466\">H 14785</a> – From him, and from someone else, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from Khalid Bin Najeeh, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said to a man: ‘Be content with what Allah<sup>azwj</sup> has Distributed to you, and do not look at what is in the possession of others, and do not covet what cannot be achieved, for the one who is content, he is satisfied, and the one who is not content is not at ease, and take your share from the Hereafter’.",
            "And Abu Abdullah<sup>asws</sup> said; ‘The most beneficial for the person is his precedence in finding faults with himself before (finding) the faults in others, and the most difficult thing is hiding the hunger, and the least of the (beneficial) things is the advice to the one who does not accept it and being in the neighbourhood of the greedy, and the most comforting of the comforts is in having despaired from the people’. And he<sup>asws</sup> said: ‘Do not be irritating or ill-mannered and humble yourself by bearing the one who opposes you, and the one who is above you, and the one who has a preference over you, and accept the preference of the one who is opposed to you. The one who does not accept the preference of others would be ‘الْمُعْجَبُ بِرَأْيِهِ’ self-conceited’.",
            "And he<sup>asws</sup> said to a man: ‘Know, that he has no honour, the one who does not humble himself to Allah<sup>azwj</sup> and no elevation for the one who does not humble himself before Allah<sup>azwj</sup> Mighty and Majestic’. And he<sup>asws</sup> said to a man: ‘Organise the affairs of your Religion just as the people of the world organise the affairs of their world. So the world has been Made as a witness by which the hidden matters of the Hereafter can be recognised. So recognise the Hereafter by it and do not look to the world except with a view to take a lesson from it’. "
          ],
          "en.sarwar": [
            "338. From him, and from someone else, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from Khalid Bin Najeeh, who has narrated the following: Abu Abdullah (a.s.) having said to a man: ‘Be content with what Allah (azwj) has Distributed to you, and do not look at what is in the possession of others, and do not covet what cannot be achieved, for the one who is content, he is satisfied, and the one who is not content is not at ease, and take your share from the Hereafter’. And Abu Abdullah (a.s.) said; ‘The most beneficial for the person is his precedence in finding faults with himself before (finding) the faults in others, and the most difficult thing is hiding the hunger, and the least of the (beneficial) things is the advice to the one who does not accept it and being in the neighbourhood of the greedy, and the most comforting of the comforts is in having despaired from the people’. And he (a.s.) said: ‘Do not be irritating or ill-mannered and humble yourself by bearing the one who opposes you, and the one who is above you, and the one who has a preference over you, and accept the preference of the one who is opposed to you. The one who does not accept the preference of others would be ‘الْمُعْجَبُ بِرَأْيِهِ’ self-conceited’. And he (a.s.) said to a man: ‘Know, that he has no honour, the one who does not humble himself to Allah (azwj) and no elevation for the one who does not humble himself before Allah (azwj) Mighty and Majestic’. And he (a.s.) said to a man: ‘Organise the affairs of your Religion just as the people of the world organise the affairs of their world. So the world has been Made as a witness by which the hidden matters of the Hereafter can be recognised. So recognise the Hereafter by it and do not look to the world except with a view to take a lesson from it’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 210)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15023,
        "local_index": 26,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:26",
        "text": [
          "14786- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ لِحُمْرَانَ بْنِ أَعْيَنَ يَا حُمْرَانُ انْظُرْ إِلَى مَنْ هُوَ دُونَكَ فِي الْمَقْدُرَةِ وَ لَا تَنْظُرْ إِلَى مَنْ هُوَ فَوْقَكَ فِي الْمَقْدُرَةِ فَإِنَّ ذَلِكَ أَقْنَعُ لَكَ بِمَا قُسِمَ لَكَ وَ أَحْرَى أَنْ تَسْتَوْجِبَ الزِّيَادَةَ مِنْ رَبِّكَ وَ اعْلَمْ أَنَّ الْعَمَلَ الدَّائِمَ الْقَلِيلَ عَلَى الْيَقِينِ أَفْضَلُ عِنْدَ اللَّهِ جَلَّ ذِكْرُهُ مِنَ الْعَمَلِ الْكَثِيرِ عَلَى غَيْرِ يَقِينٍ وَ اعْلَمْ أَنَّهُ لَا وَرَعَ أَنْفَعُ مِنْ تَجَنُّبِ مَحَارِمِ اللَّهِ وَ الْكَفِّ عَنْ أَذَى الْمُؤْمِنِينَ وَ اغْتِيَابِهِمْ وَ لَا عَيْشَ أَهْنَأُ مِنْ حُسْنِ الْخُلُقِ وَ لَا مَالَ أَنْفَعُ مِنَ الْقُنُوعِ بِالْيَسِيرِ الْمُجْزِي وَ لَا جَهْلَ أَضَرُّ مِنَ الْعُجْبِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473467\">H 14786</a> – A number of our companions, from Sahl Bin Ziyad, and Ali Bin Ibrahim, from his father altogether, from Ibn Mahboub, from Hisham Bin Saalim who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying to Humraan Bin Ayn: ‘O Humraan! Look to the one who is below you in the capability, and do not look at the one who is above you in the capability, for that would be contentment for you with what Allah<sup>azwj</sup> has Distributed for you, and you would be more likely to receive more from your Lord<sup>azwj</sup>.",
            "And know that a small amount of deeds with certainty are more preferable in the Presence of Allah<sup>azwj</sup> than the numerous deeds performed without certainty. And know that there is no devoutness which is more beneficial than avoiding the Prohibitions of Allah<sup>azwj</sup> and the restraint from hurting the Believers and back-biting against them, and no life more enjoyable than good manners, and no wealth more beneficial than contentment with less, and no ignorance more harmful than ‘الْعُجْبِ’ the self-conceit’."
          ],
          "en.sarwar": [
            "339. A number of our companions, from Sahl Bin Ziyad, and Ali Bin Ibrahim, from his father altogether, from Ibn Mahboub, from Hisham Bin Saalim who said: I heard Abu Abdullah (a.s.) saying to Humraan Bin Ayn: ‘O Humraan! Look to the one who is below you in the capability, and do not look at the one who is above you in the capability, for that would be contentment for you with what Allah (azwj) has Distributed for you, and you would be more likely to receive more from your Lord (azwj). And know that a small amount of deeds with certainty are more preferable in the Presence of Allah (azwj) than the numerous deeds performed without certainty. And know that there is no devoutness which is more beneficial than avoiding the Prohibitions of Allah (azwj) and the restraint from hurting the Believers and back-biting against them, and no life more enjoyable than good manners, and no wealth more beneficial than contentment with less, and no ignorance more harmful than ‘الْعُجْبِ’ the self-conceit’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  أو موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 212)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15024,
        "local_index": 27,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:27",
        "refs": {
          "Quran": [
            "/books/quran:2:199",
            "/books/quran:25:44",
            "/books/quran:14:36"
          ]
        },
        "text": [
          "14787- ابْنُ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ غَالِبٍ عَنْ أَبِيهِ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَ سَمِعْتُ عَلِيَّ بْنَ الْحُسَيْنِ (عليه السلام) يَقُولُ إِنَّ رَجُلًا جَاءَ إِلَى أَمِيرِ الْمُؤْمِنِينَ (عليه السلام) فَقَالَ أَخْبِرْنِي إِنْ كُنْتَ عَالِماً عَنِ النَّاسِ وَ عَنْ أَشْبَاهِ النَّاسِ وَ عَنِ النَّسْنَاسِ فَقَالَ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) يَا حُسَيْنُ أَجِبِ الرَّجُلَ فَقَالَ الْحُسَيْنُ (عليه السلام) أَمَّا قَوْلُكَ أَخْبِرْنِي عَنِ النَّاسِ فَنَحْنُ النَّاسُ وَ لِذَلِكَ قَالَ اللَّهُ تَعَالَى ذِكْرُهُ فِي كِتَابِهِ ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفاضَ النَّاسُ فَرَسُولُ اللَّهِ (صلى الله عليه وآله) الَّذِي أَفَاضَ بِالنَّاسِ ",
          "وَ أَمَّا قَوْلُكَ أَشْبَاهُ النَّاسِ فَهُمْ شِيعَتُنَا وَ هُمْ مَوَالِينَا وَ هُمْ مِنَّا وَ لِذَلِكَ قَالَ إِبْرَاهِيمُ (عليه السلام) فَمَنْ تَبِعَنِي فَإِنَّهُ مِنِّي وَ أَمَّا قَوْلُكَ النَّسْنَاسُ فَهُمُ السَّوَادُ الْأَعْظَمُ وَ أَشَارَ بِيَدِهِ إِلَى جَمَاعَةِ النَّاسِ ثُمَّ قَالَ إِنْ هُمْ إِلَّا كَالْأَنْعامِ بَلْ هُمْ أَضَلُّ سَبِيلًا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473468\">H 14787</a> – Ibn Mahboub, from Abdullah Bin Ghalib, from his father Saeed Bin Al-Musayyab who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Ali</span><sup>asws</sup> Bin Al-Husayn<sup>asws</sup> saying that: ‘A man went to Amir-ul-Momineen<sup>asws</sup> and said, ‘Inform me, if you<sup>asws</sup> are knowledgeable, about the people, and about those who resemble the people, and about the <span class=\"iTxt\">Nasnaas</span>’. So Amir-ul-Momineen<sup>asws</sup> said: ‘O Husayn<sup>asws</sup>, answer the man’. So Al-Husayn<sup>asws</sup> said: ‘As for your word, ‘Inform me about the people’, so we<sup>asws</sup> are the people, and that is what Allah<sup>azwj</sup> Says in His<sup>azwj</sup> Book: <span class=\"ibTxt\">“<a href=\"/#/books/quran:2#h199\">[2:199]</a> Then hasten on from the Place from which the people hasten on”</span>, so it is the Rasool Allah<sup>saww</sup> so he<sup>saww</sup> is the one<sup>saww</sup> about whom people should come forward.",
            "And as for your word, ‘Resembling the people’, so they are our<sup>asws</sup> Shites, and they are our<sup>asws</sup> friends, and they are from us<sup>asws</sup>, and that is what Ibrahim<sup>as</sup> said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:14#h36\">[14:36]</a> then whoever follows me, he is surely of me, and whoever disobeys me”</span>. And as for your words, ‘The <span class=\"iTxt\">Nasnaas</span>’, so they are the vast majority’ – and he<sup>asws</sup> gestured by his<sup>asws</sup> hand towards a group of the people, then said: <span class=\"ibTxt\">‘<a href=\"/#/books/quran:25#h44\">[25:44]</a> They are nothing but as cattle; nay, they are straying farther off from the path”</span>."
          ],
          "en.sarwar": [
            "340. Ibn Mahboub, from Abdullah Bin Ghalib, from his father Saeed Bin Al-Musayyab who said: I heard Ali (a.s.) Bin Al-Husayn (a.s.) saying that: ‘A man went to Amir-ul-Momineen (a.s.) and said, ‘Inform me, if you (a.s.) are knowledgeable, about the people, and about those who resemble the people, and about the Nasnaas’. So Amir-ul-Momineen (a.s.) said: ‘O Husayn (a.s.), answer the man’. So Al-Husayn (a.s.) said: ‘As for your word, ‘Inform me about the people’, so we (a.s.) are the people, and that is what Allah (azwj) Says in His (azwj) Book: “<a href=\"/#/books/quran:2#h199\">[2:199]</a> Then hasten on from the Place from which the people hasten on”, so it is the Rasool Allah (saww) so he (saww) is the one (saww) about whom people should come forward. And as for your word, ‘Resembling the people’, so they are our (a.s.) Shites, and they are our (a.s.) friends, and they are from us (a.s.), and that is what Ibrahim (as) said: “<a href=\"/#/books/quran:14#h36\">[14:36]</a> then whoever follows me, he is surely of me, and whoever disobeys me”. And as for your words, ‘The Nasnaas’, so they are the vast majority’ – and he (a.s.) gestured by his (a.s.) hand towards a group of the people, then said: ‘<a href=\"/#/books/quran:25#h44\">[25:44]</a> They are nothing but as cattle; nay, they are straying farther off from the path”."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 213)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15025,
        "local_index": 28,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:28",
        "text": [
          "14788- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَنَانِ بْنِ سَدِيرٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ حَنَانِ بْنِ سَدِيرٍ عَنْ أَبِيهِ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ (عليه السلام) عَنْهُمَا فَقَالَ يَا أَبَا الْفَضْلِ مَا تَسْأَلُنِي عَنْهُمَا فَوَ اللَّهِ مَا مَاتَ مِنَّا مَيِّتٌ قَطُّ إِلَّا سَاخِطاً عَلَيْهِمَا وَ مَا مِنَّا الْيَوْمَ إِلَّا سَاخِطاً عَلَيْهِمَا يُوصِي بِذَلِكَ الْكَبِيرُ مِنَّا الصَّغِيرَ إِنَّهُمَا ظَلَمَانَا حَقَّنَا وَ مَنَعَانَا فَيْئَنَا وَ كَانَا أَوَّلَ مَنْ رَكِبَ أَعْنَاقَنَا وَ بَثَقَا عَلَيْنَا بَثْقاً فِي الْإِسْلَامِ لَا يُسْكَرُ أَبَداً حَتَّى يَقُومَ قَائِمُنَا أَوْ يَتَكَلَّمَ مُتَكَلِّمُنَا ",
          "ثُمَّ قَالَ أَمَا وَ اللَّهِ لَوْ قَدْ قَامَ قَائِمُنَا أَوْ تَكَلَّمَ مُتَكَلِّمُنَا لَأَبْدَى مِنْ أُمُورِهِمَا مَا كَانَ يُكْتَمُ وَ لَكَتَمَ مِنْ أُمُورِهِمَا مَا كَانَ يُظْهَرُ وَ اللَّهِ مَا أُسِّسَتْ مِنْ بَلِيَّةٍ وَ لَا قَضِيَّةٍ تَجْرِي عَلَيْنَا أَهْلَ الْبَيْتِ إِلَّا هُمَا أَسَّسَا أَوَّلَهَا فَعَلَيْهِمَا لَعْنَةُ اللَّهِ وَ الْمَلَائِكَةِ وَ النَّاسِ أَجْمَعِينَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473469\">H 14788</a> – Ali Bin Ibrahim, from his father, from hanaan Bin Sudeyr, and Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Hanaan Bin Sudeyr, from his father who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked Abu Ja’far</span><sup>asws</sup> about the two (Abu Bakr and Umar), so he<sup>asws</sup> said: ‘O Abu Al-Fazl, don’t ask me about these two, for by Allah<sup>azwj</sup>, no one from among us<sup>asws</sup> passes away at all except being angry against these two, and there is none from us<sup>asws</sup> today except that he<sup>asws</sup> is angry at them. The old ones bequeath it to the young ones from us<sup>asws</sup>. These two have been unjust to us<sup>asws</sup> for our<sup>asws</sup> rights, and prevented us<sup>asws</sup> from our<sup>asws</sup> Fey (Spoils of War – Khums), and first one rode upon our<sup>asws</sup> necks, and caused damage to us<sup>asws</sup> with a damage in Al-Islam which can never be repaired ever until our<sup>asws</sup> Qaim<sup>asws</sup> makes a stand and speaks our<sup>asws</sup> speech’. ",
            "Then he<sup>asws</sup> said; ‘But, by Allah<sup>azwj</sup>, when our<sup>asws</sup> Qaim<sup>asws</sup> makes a stand, or speaks our<sup>asws</sup> speech, he<sup>asws</sup> will expose the matters of these two of what they had concealed, and conceal from their matters what they used to make apparent. By Allah<sup>azwj</sup>, nothing has afflicted us<sup>asws</sup> from the afflictions, and what has passed of the difficulties against us<sup>asws</sup>, the People<sup>asws</sup> of the Household, except that these two laid the foundations of it at first place, so against these two are the Curses of Allah<sup>azwj</sup>, and the Angels, and the people altogether’. "
          ],
          "en.sarwar": [
            "341. Ali Bin Ibrahim, from his father, from hanaan Bin Sudeyr, and Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Hanaan Bin Sudeyr, from his father who said: I asked Abu Ja’far (a.s.) about the two (Abu Bakr and Umar), so he (a.s.) said: ‘O Abu Al-Fazl, don’t ask me about these two, for by Allah (azwj), no one from among us (a.s.) passes away at all except being angry against these two, and there is none from us (a.s.) today except that he (a.s.) is angry at them. The old ones bequeath it to the young ones from us (a.s.). These two have been unjust to us (a.s.) for our (a.s.) rights, and prevented us (a.s.) from our (a.s.) Fey (Spoils of War – Khums), and first one rode upon our (a.s.) necks, and caused damage to us (a.s.) with a damage in Al-Islam which can never be repaired ever until our (a.s.) Qaim (a.s.) makes a stand and speaks our (a.s.) speech’. Then he (a.s.) said; ‘But, by Allah (azwj), when our (a.s.) Qaim (a.s.) makes a stand, or speaks our (a.s.) speech, he (a.s.) will expose the matters of these two of what they had concealed, and conceal from their matters what they used to make apparent. By Allah (azwj), nothing has afflicted us (a.s.) from the afflictions, and what has passed of the difficulties against us (a.s.), the People (a.s.) of the Household, except that these two laid the foundations of it at first place, so against these two are the Curses of Allah (azwj), and the Angels, and the people altogether’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 215)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15026,
        "local_index": 29,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:29",
        "refs": {
          "Quran": [
            "/books/quran:3:144"
          ]
        },
        "text": [
          "14789- حَنَانٌ عَنْ أَبِيهِ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ كَانَ النَّاسُ أَهْلَ رِدَّةٍ بَعْدَ النَّبِيِّ (صلى الله عليه وآله) إِلَّا ثَلَاثَةً فَقُلْتُ وَ مَنِ الثَّلَاثَةُ فَقَالَ الْمِقْدَادُ بْنُ الْأَسْوَدِ وَ أَبُو ذَرٍّ الْغِفَارِيُّ وَ سَلْمَانُ الْفَارِسِيُّ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ عَلَيْهِمْ ثُمَّ عَرَفَ أُنَاسٌ بَعْدَ يَسِيرٍ ",
          "وَ قَالَ هَؤُلَاءِ الَّذِينَ دَارَتْ عَلَيْهِمُ الرَّحَى وَ أَبَوْا أَنْ يُبَايِعُوا حَتَّى جَاءُوا بِأَمِيرِ الْمُؤْمِنِينَ (عليه السلام) مُكْرَهاً فَبَايَعَ وَ ذَلِكَ قَوْلُ اللَّهِ تَعَالَى وَ ما مُحَمَّدٌ إِلَّا رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ أَ فَإِنْ ماتَ أَوْ قُتِلَ انْقَلَبْتُمْ عَلى أَعْقابِكُمْ وَ مَنْ يَنْقَلِبْ عَلى عَقِبَيْهِ فَلَنْ يَضُرَّ اللَّهَ شَيْئاً وَ سَيَجْزِي اللَّهُ الشَّاكِرِينَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473470\">H 14789</a> – Hanaan, from his father, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> has said: ‘The people turned apostate after the Prophet<sup>saww</sup> except for three’. So I said, ‘And which three?’ So he<sup>asws</sup> said: ‘Al-Miqdad Bin Al-Aswad<sup>ar</sup>, and Abu Dharr Al-Ghaffari<sup>ar</sup>, and Salman Al-Farsy<sup>ar</sup>, may the Mercy of Allah<sup>azwj</sup> and His<sup>azwj</sup> Blessing be upon them<sup>ar</sup>. Then the people realised after a while’. ",
            "And he<sup>asws</sup> said: ‘They<sup>ar</sup> are the ones upon whom the grinding stone turned, but they still refused to pledge their<sup>ar</sup> allegiances until they went to Amir-ul-Momineen<sup>asws</sup>, so they pledged their<sup>ar</sup> allegiances under threat, and that is the Statement of Allah<sup>azwj</sup> the High: <span class=\"ibTxt\">“<a href=\"/#/books/quran:3#h144\">[3:144]</a> And Muhammad is no more than a messenger; the messengers have already passed away before him; if then he dies or is killed will you turn back upon your heels? And whoever turns back upon his heels, he will by no means do harm to Allah in the least and Allah will reward the grateful”</span>.’ "
          ],
          "en.sarwar": [
            "342. Hanaan, from his father, who has said: Abu Ja’far (a.s.) has said: ‘The people turned apostate after the Prophet (saww) except for three’. So I said, ‘And which three?’ So he (a.s.) said: ‘Al-Miqdad Bin Al-Aswad (ar), and Abu Dharr Al-Ghaffari (ar), and Salman Al-Farsy (ar), may the Mercy of Allah (azwj) and His (azwj) Blessing be upon them (ar). Then the people realised after a while’. And he (a.s.) said: ‘They (ar) are the ones upon whom the grinding stone turned, but they still refused to pledge their (ar) allegiances until they went to Amir-ul-Momineen (a.s.), so they pledged their (ar) allegiances under threat, and that is the Statement of Allah (azwj) the High: “<a href=\"/#/books/quran:3#h144\">[3:144]</a> And Muhammad is no more than a messenger; the messengers have already passed away before him; if then he dies or is killed will you turn back upon your heels? And whoever turns back upon his heels, he will by no means do harm to Allah in the least and Allah will reward the grateful”.’"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 215)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15027,
        "local_index": 30,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:30",
        "text": [
          "14790- حَنَانٌ عَنْ أَبِيهِ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ صَعِدَ رَسُولُ اللَّهِ (صلى الله عليه وآله) الْمِنْبَرَ يَوْمَ فَتْحِ مَكَّةَ فَقَالَ أَيُّهَا النَّاسُ إِنَّ اللَّهَ قَدْ أَذْهَبَ عَنْكُمْ نَخْوَةَ الْجَاهِلِيَّةِ وَ تَفَاخُرَهَا بِآبَائِهَا أَلَا إِنَّكُمْ مِنْ آدَمَ (عليه السلام) وَ آدَمُ مِنْ طِينٍ أَلَا إِنَّ خَيْرَ عِبَادِ اللَّهِ عَبْدٌ اتَّقَاهُ إِنَّ الْعَرَبِيَّةَ لَيْسَتْ بِأَبٍ وَالِدٍ وَ لَكِنَّهَا لِسَانٌ نَاطِقٌ فَمَنْ قَصَرَ بِهِ عَمَلُهُ لَمْ يُبْلِغْهُ حَسَبُهُ أَلَا إِنَّ كُلَّ دَمٍ كَانَ فِي الْجَاهِلِيَّةِ أَوْ إِحْنَةٍ وَ الْإِحْنَةُ الشَّحْنَاءُ فَهِيَ تَحْتَ قَدَمِي هَذِهِ إِلَى يَوْمِ الْقِيَامَةِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473471\">H 14790</a> – Hannaan, from his father, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> having said: ‘The Rasool Allah<sup>saww</sup> ascended the Pulpit on the day of victory over Makkah, so he<sup>saww</sup> said: ‘O you people! Allah<sup>azwj</sup> has Taken away from you the pride of the era of the ignorance, and what you are boasting of with regards to your forefathers. Indeed! You are from Adam<sup>as</sup>, and Adam is from clay. Indeed! The best of the servants of Allah<sup>azwj</sup> is a pious servant. The Arabic is not by a father and (grand) father, but it is a spoken tongue (language). So the one who is deficient in his deeds, his lineage would not help him. Indeed! Every blood (shed) during the era of ignorance, or feud – and the feud is the enmity – so it is now under my<sup>saww</sup> feet. This is how it will be up to the Day of Judgement’."
          ],
          "en.sarwar": [
            "343. Hannaan, from his father, who has said: Abu Ja’far (a.s.) having said: ‘The Rasool Allah (saww) ascended the Pulpit on the day of victory over Makkah, so he (saww) said: ‘O you people! Allah (azwj) has Taken away from you the pride of the era of the ignorance, and what you are boasting of with regards to your forefathers. Indeed! You are from Adam (as), and Adam is from clay. Indeed! The best of the servants of Allah (azwj) is a pious servant. The Arabic is not by a father and (grand) father, but it is a spoken tongue (language). So the one who is deficient in his deeds, his lineage would not help him. Indeed! Every blood (shed) during the era of ignorance, or feud – and the feud is the enmity – so it is now under my (saww) feet. This is how it will be up to the Day of Judgement’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 215)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15028,
        "local_index": 31,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:31",
        "text": [
          "14791- حَنَانٌ عَنْ أَبِيهِ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ قُلْتُ لَهُ مَا كَانَ وُلْدُ يَعْقُوبَ أَنْبِيَاءَ قَالَ لَا وَ لَكِنَّهُمْ كَانُوا أَسْبَاطَ أَوْلَادِ الْأَنْبِيَاءِ وَ لَمْ يَكُنْ يُفَارِقُوا الدُّنْيَا إِلَّا سُعَدَاءَ تَابُوا وَ تَذَكَّرُوا مَا صَنَعُوا وَ إِنَّ الشَّيْخَيْنِ فَارَقَا الدُّنْيَا وَ لَمْ يَتُوبَا وَ لَمْ يَتَذَكَّرَا مَا صَنَعَا بِأَمِيرِ الْمُؤْمِنِينَ (عليه السلام) فَعَلَيْهِمَا لَعْنَةُ اللَّهِ وَ الْمَلَائِكَةِ وَ النَّاسِ أَجْمَعِينَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473472\">H 14791</a> – Hanaan, from his father, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> said, when I said to him<sup>asws</sup>, ‘What were the children of Yaqoub<sup>as</sup>, Prophets<sup>as</sup>?’ He<sup>asws</sup> said: ‘No, but they were the grandchildren of the children of the Prophets<sup>as</sup>, and they did not depart from the world except as happy, repentant, and remembered what they had done, and the two old men (Abu Bakr and Umar – Shaykhayn) departed from the world, and they never remembered what they had done with Amir-ul-Momineen<sup>asws</sup>, so upon these two be the Curses of Allah<sup>azwj</sup>, and the Angels, and the people altogether’."
          ],
          "en.sarwar": [
            "344. Hanaan, from his father, who has said: Abu Ja’far (a.s.) said, when I said to him (a.s.), ‘What were the children of Yaqoub (as), Prophets (as)?’ He (a.s.) said: ‘No, but they were the grandchildren of the children of the Prophets (as), and they did not depart from the world except as happy, repentant, and remembered what they had done, and the two old men (Abu Bakr and Umar – Shaykhayn) departed from the world, and they never remembered what they had done with Amir-ul-Momineen (a.s.), so upon these two be the Curses of Allah (azwj), and the Angels, and the people altogether’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 216)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15029,
        "local_index": 32,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:32",
        "text": [
          "14792- حَنَانٌ عَنْ أَبِي الْخَطَّابِ عَنْ عَبْدٍ صَالِحٍ (عليه السلام) قَالَ إِنَّ النَّاسَ أَصَابَهُمْ قَحْطٌ شَدِيدٌ عَلَى عَهْدِ سُلَيْمَانَ بْنِ دَاوُدَ (عليهما السلام) فَشَكَوْا ذَلِكَ إِلَيْهِ وَ طَلَبُوا إِلَيْهِ أَنْ يَسْتَسْقِيَ لَهُمْ قَالَ فَقَالَ لَهُمْ إِذَا صَلَّيْتُ الْغَدَاةَ مَضَيْتُ فَلَمَّا صَلَّى الْغَدَاةَ مَضَى وَ مَضَوْا فَلَمَّا أَنْ كَانَ فِي بَعْضِ الطَّرِيقِ إِذَا هُوَ بِنَمْلَةٍ رَافِعَةٍ يَدَهَا إِلَى السَّمَاءِ وَاضِعَةٍ قَدَمَيْهَا إِلَى الْأَرْضِ وَ هِيَ تَقُولُ اللَّهُمَّ إِنَّا خَلْقٌ مِنْ خَلْقِكَ وَ لَا غِنَى بِنَا عَنْ رِزْقِكَ فَلَا تُهْلِكْنَا بِذُنُوبِ بَنِي آدَمَ قَالَ فَقَالَ سُلَيْمَانُ (عليه السلام) ارْجِعُوا فَقَدْ سُقِيتُمْ بِغَيْرِكُمْ قَالَ فَسُقُوا فِي ذَلِكَ الْعَامِ مَا لَمْ يُسْقَوْا مِثْلَهُ قَطُّ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473473\">H 14792</a> – Hanaan, from Abu Al-Khattab, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bd Salih</span><sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) having said: ‘The people were affected by severe drought during the era of Suleiman Bin Dawood<sup>as</sup>. So they complained about that to him<sup>as</sup>, and sought from him<sup>as</sup> that he<sup>as</sup> should Pray for them’. So he<sup>as</sup> said to them: ‘When I<sup>as</sup> have Prayed the morning Prayer, I<sup>as</sup> will come with you’. So when he<sup>as</sup> had Prayed the morning Prayer, he<sup>as</sup> went and they went (with him<sup>as</sup>). So when they were on one of the roads, there was an ant there which had raised its hand to the sky, and placed its feet upon the earth, and it was saying, ‘Our Allah<sup>azwj</sup>! We are also creatures from Your<sup>azwj</sup> creatures, and we are not needless of Your<sup>azwj</sup> sustenance, so do not Destroy us for the sins committed by the children of Adam<sup>as</sup>’. So Suleiman said: ‘Return! You shall be quenched by others (in other ways)’. So they were quenched in that year the like of which they had never been quenched at all’."
          ],
          "en.sarwar": [
            "345. Hanaan, from Abu Al-Khattab, who has said: Abd Salih (a.s.) (7 (th) Imam (a.s.)) having said: ‘The people were affected by severe drought during the era of Suleiman Bin Dawood (as). So they complained about that to him (as), and sought from him (as) that he (as) should Pray for them’. So he (as) said to them: ‘When I (as) have Prayed the morning Prayer, I (as) will come with you’. So when he (as) had Prayed the morning Prayer, he (as) went and they went (with him (as)). So when they were on one of the roads, there was an ant there which had raised its hand to the sky, and placed its feet upon the earth, and it was saying, ‘Our Allah (azwj)! We are also creatures from Your (azwj) creatures, and we are not needless of Your (azwj) sustenance, so do not Destroy us for the sins committed by the children of Adam (as)’. So Suleiman said: ‘Return! You shall be quenched by others (in other ways)’. So they were quenched in that year the like of which they had never been quenched at all’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول ومنهم من يعده ضعيفا</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 217)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15030,
        "local_index": 33,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:33",
        "text": [
          "14793- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُوسَى بْنِ جَعْفَرٍ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ خَلَفِ بْنِ عِيسَى عَنْ أَبِي عُبَيْدٍ الْمَدَائِنِيِّ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ إِنَّ لِلَّهِ تَعَالَى ذِكْرُهُ عِبَاداً مَيَامِينَ مَيَاسِيرَ يَعِيشُونَ وَ يَعِيشُ النَّاسُ فِي أَكْنَافِهِمْ وَ هُمْ فِي عِبَادِهِ بِمَنْزِلَةِ الْقَطْرِ وَ لِلَّهِ عَزَّ وَ جَلَّ عِبَادٌ مَلَاعِينُ مَنَاكِيرُ لَا يَعِيشُونَ وَ لَا يَعِيشُ النَّاسُ فِي أَكْنَافِهِمْ وَ هُمْ فِي عِبَادِهِ بِمَنْزِلَةِ الْجَرَادِ لَا يَقَعُونَ عَلَى شَيْ‏ءٍ إِلَّا أَتَوْا عَلَيْهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473474\">H 14793</a> – A number of our companions, from Sahl Bin Ziyad, from Musa Bin Ja’far, from Amro Bin Saeed, from Khalaf Bin Isa, from Abu Uney Al-Mada’iny, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> has said that Allah<sup>azwj</sup> has servants who are auspicious and righteous who are living, and the people live in their protection, and they are among His<sup>azwj</sup> servants at the status of the country. And Allah<sup>azwj</sup> has servants who are accursed and deniers. Neither do they live (a good life) nor do the people in their protection, and they are among His<sup>azwj</sup> servants at the status of the locusts. They do not occur on something except that they devour it’."
          ],
          "en.sarwar": [
            "346. A number of our companions, from Sahl Bin Ziyad, from Musa Bin Ja’far, from Amro Bin Saeed, from Khalaf Bin Isa, from Abu Uney Al-Mada’iny, who has narrated the following: Abu Ja’far (a.s.) has said that Allah (azwj) has servants who are auspicious and righteous who are living, and the people live in their protection, and they are among His (azwj) servants at the status of the country. And Allah (azwj) has servants who are accursed and deniers. Neither do they live (a good life) nor do the people in their protection, and they are among His (azwj) servants at the status of the locusts. They do not occur on something except that they devour it’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول أو ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 217)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15031,
        "local_index": 34,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:34",
        "refs": {
          "Quran": [
            "/books/quran:36:52"
          ]
        },
        "text": [
          "14794- الْحُسَيْنُ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ يَحْيَى جَمِيعاً عَنْ مُحَمَّدِ بْنِ سَالِمِ بْنِ أَبِي سَلَمَةَ عَنِ الْحَسَنِ بْنِ شَاذَانَ الْوَاسِطِيِّ قَالَ كَتَبْتُ إِلَى أَبِي الْحَسَنِ الرِّضَا (عليه السلام) أَشْكُو جَفَاءَ أَهْلِ وَاسِطٍ وَ حَمْلَهُمْ عَلَيَّ وَ كَانَتْ عِصَابَةٌ مِنَ الْعُثْمَانِيَّةِ تُؤْذِينِي فَوَقَّعَ بِخَطِّهِ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى أَخَذَ مِيثَاقَ أَوْلِيَائِنَا عَلَى الصَّبْرِ فِي دَوْلَةِ الْبَاطِلِ فَاصْبِرْ لِحُكْمِ رَبِّكَ فَلَوْ قَدْ قَامَ سَيِّدُ الْخَلْقِ لَقَالُوا يا وَيْلَنا مَنْ بَعَثَنا مِنْ مَرْقَدِنا هذا ما وَعَدَ الرَّحْمنُ وَ صَدَقَ الْمُرْسَلُونَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473475\">H 14794</a> – Al-Husayn Bin Muhammad, and Muhammad Bin Yahya, together from Muhammad Bin Saalim Bin Abu Salma, from Al-Hassan Bin Shazaan Al-Wasity who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> wrote to Abu Al-Hassan</span> Al-Reza<sup>asws</sup> complaining of my alienation from the people of ‘وَاسِطٍ’, and their burdening me, and they were from the Uthmaniyya group, hurting me’. So a reply came in his<sup>asws</sup> handwriting: ‘Surely Allah<sup>azwj</sup> has Taken a Covenant from our<sup>asws</sup> friends for the patience during the government of the falsehood. So be patient for the Judgement of your Lord<sup>azwj</sup>. So when the chief of the creatures (Al-Qaim<sup>asws</sup>) makes a stand, they would say: <span class=\"ibTxt\">“<a href=\"/#/books/quran:36#h52\">[36:52]</a> They shall say: O woe to us! who has raised us up from our sleeping-place? This is what the Beneficent Allah promised and the messengers told the truth”</span>.’"
          ],
          "en.sarwar": [
            "347. Al-Husayn Bin Muhammad, and Muhammad Bin Yahya, together from Muhammad Bin Saalim Bin Abu Salma, from Al-Hassan Bin Shazaan Al-Wasity who said: I wrote to Abu Al-Hassan Al-Ridha (a.s.) complaining of my alienation from the people of ‘وَاسِطٍ’, and their burdening me, and they were from the Uthmaniyya group, hurting me’. So a reply came in his (a.s.) handwriting: ‘Surely Allah (azwj) has Taken a Covenant from our (a.s.) friends for the patience during the government of the falsehood. So be patient for the Judgement of your Lord (azwj). So when the chief of the creatures (Al-Qaim (a.s.)) makes a stand, they would say: “<a href=\"/#/books/quran:36#h52\">[36:52]</a> They shall say: O woe to us! who has raised us up from our sleeping-place? This is what the Beneficent Allah promised and the messengers told the truth”.’"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 219)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15032,
        "local_index": 35,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:35",
        "text": [
          "14795- مُحَمَّدُ بْنُ سَالِمِ بْنِ أَبِي سَلَمَةَ عَنْ أَحْمَدَ بْنِ الرَّيَّانِ عَنْ أَبِيهِ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ لَوْ يَعْلَمُ النَّاسُ مَا فِي فَضْلِ مَعْرِفَةِ اللَّهِ عَزَّ وَ جَلَّ مَا مَدُّوا أَعْيُنَهُمْ إِلَى مَا مَتَّعَ اللَّهُ بِهِ الْأَعْدَاءَ مِنْ زَهْرَةِ الْحَيَاةِ الدُّنْيَا وَ نَعِيمِهَا وَ كَانَتْ دُنْيَاهُمْ أَقَلَّ عِنْدَهُمْ مِمَّا يَطَئُونَهُ بِأَرْجُلِهِمْ وَ لَنُعِّمُوا بِمَعْرِفَةِ اللَّهِ جَلَّ وَ عَزَّ وَ تَلَذَّذُوا بِهَا تَلَذُّذَ مَنْ لَمْ يَزَلْ فِي رَوْضَاتِ الْجِنَانِ مَعَ أَوْلِيَاءِ اللَّهِ إِنَّ مَعْرِفَةَ اللَّهِ عَزَّ وَ جَلَّ آنِسٌ مِنْ كُلِّ وَحْشَةٍ وَ صَاحِبٌ مِنْ كُلِّ وَحْدَةٍ وَ نُورٌ مِنْ كُلِّ ظُلْمَةٍ وَ قُوَّةٌ مِنْ كُلِّ ضَعْفٍ وَ شِفَاءٌ مِنْ كُلِّ سُقْمٍ ",
          "ثُمَّ قَالَ (عليه السلام) وَ قَدْ كَانَ قَبْلَكُمْ قَوْمٌ يُقْتَلُونَ وَ يُحْرَقُونَ وَ يُنْشَرُونَ بِالْمَنَاشِيرِ وَ تَضِيقُ عَلَيْهِمُ الْأَرْضُ بِرُحْبِهَا فَمَا يَرُدُّهُمْ عَمَّا هُمْ عَلَيْهِ شَيْ‏ءٌ مِمَّا هُمْ فِيهِ مِنْ غَيْرِ تِرَةٍ وَتَرُوا مَنْ فَعَلَ ذَلِكَ بِهِمْ وَ لَا أَذًى بَلْ مَا نَقَمُوا مِنْهُمْ إِلَّا أَنْ يُؤْمِنُوا بِاللَّهِ الْعَزِيزِ الْحَمِيدِ فَاسْأَلُوا رَبَّكُمْ دَرَجَاتِهِمْ وَ اصْبِرُوا عَلَى نَوَائِبِ دَهْرِكُمْ تُدْرِكُوا سَعْيَهُمْ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473476\">H 14795</a> – Muhammad Bin Saalim Bin Abu Salma, from Ahmad Bin Al-Rayyaan, from his father, from Jameel Bin Darraaj, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘If the people knew the merits of recognising Allah<sup>azwj</sup> they would not extend their eyes to what treats the enemies of Allah<sup>azwj</sup> have from the blossoms of the life of the world and its bounties. And their world would seem little in their presence than what they are treading on with their feet, and they would enjoy the recognition of Allah<sup>azwj</sup> and relish it with a relish of the one who would not cease to be in the Gardens of the Paradise with the friends of Allah<sup>azwj</sup>. ",
            "The recognition of Allah<sup>azwj</sup> is a comfort in every frightening state, and a companionship in every loneliness, and a Light in every darkness, and strength in every weakness, and a healing in every illness’.",
            "Then he<sup>asws</sup> said: ‘And before them were a people who were killed, and burnt, and cut into pieces by the saw, and the earth became constricted for them. So nothing from such hardships could return them from what they were on. And you will see that the one who acted like that with them and hurt them was for no reason other than that they believed in Allah<sup>azwj</sup> the Mighty, the Praiseworthy. So ask your Lord<sup>azwj</sup> for their levels, and be patient upon the ravages of your time in order to understand their quest’.  "
          ],
          "en.sarwar": [
            "348. Muhammad Bin Saalim Bin Abu Salma, from Ahmad Bin Al-Rayyaan, from his father, from Jameel Bin Darraaj, who has said: Abu Abdullah (a.s.) has said: ‘If the people knew the merits of recognising Allah (azwj) they would not extend their eyes to what treats the enemies of Allah (azwj) have from the blossoms of the life of the world and its bounties. And their world would seem little in their presence than what they are treading on with their feet, and they would enjoy the recognition of Allah (azwj) and relish it with a relish of the one who would not cease to be in the Gardens of the Paradise with the friends of Allah (azwj). The recognition of Allah (azwj) is a comfort in every frightening state, and a companionship in every loneliness, and a Light in every darkness, and strength in every weakness, and a healing in every illness’. Then he (a.s.) said: ‘And before them were a people who were killed, and burnt, and cut into pieces by the saw, and the earth became constricted for them. So nothing from such hardships could return them from what they were on. And you will see that the one who acted like that with them and hurt them was for no reason other than that they believed in Allah (azwj) the Mighty, the Praiseworthy. So ask your Lord (azwj) for their levels, and be patient upon the ravages of your time in order to understand their quest’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 219)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15033,
        "local_index": 36,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:36",
        "text": [
          "14796- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ سَعِيدِ بْنِ جَنَاحٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ مَا خَلَقَ اللَّهُ عَزَّ وَ جَلَّ خَلْقاً أَصْغَرَ مِنَ الْبَعُوضِ وَ الْجِرْجِسُ أَصْغَرُ مِنَ الْبَعُوضِ وَ الَّذِي نُسَمِّيهِ نَحْنُ الْوَلَعَ أَصْغَرُ مِنَ الْجِرْجِسِ وَ مَا فِي الْفِيلِ شَيْ‏ءٌ إِلَّا وَ فِيهِ مِثْلُهُ وَ فُضِّلَ عَلَى الْفِيلِ بِالْجَنَاحَيْنِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473477\">H 14796</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Saeed Bin Janaah, from one of our companions, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘Allah<sup>azwj</sup> has not Created a creature smaller than the mosquito, and <span class=\"iTxt\">Al-Jarjas</span> is smaller than the mosquito, and that which we call <span class=\"iTxt\">Al-Wala’a</span> is smaller than <span class=\"iTxt\">Al-Jarjas</span>, and there is nothing which the elephant has except that it is in it, similar to it, and it is better than the elephant by having two wings’."
          ],
          "en.sarwar": [
            "349. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Saeed Bin Janaah, from one of our companions, who has said: Abu Abdullah (a.s.) has said: ‘Allah (azwj) has not Created a creature smaller than the mosquito, and Al-Jarjas is smaller than the mosquito, and that which we call Al-Wala’a is smaller than Al-Jarjas, and there is nothing which the elephant has except that it is in it, similar to it, and it is better than the elephant by having two wings’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 224)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15034,
        "local_index": 37,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:37",
        "refs": {
          "Quran": [
            "/books/quran:30:42",
            "/books/quran:6:59",
            "/books/quran:37:138",
            "/books/quran:37:137",
            "/books/quran:8:24"
          ]
        },
        "text": [
          "14797- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ خَالِدٍ وَ الْحُسَيْنِ بْنِ سَعِيدٍ جَمِيعاً عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ زَيْدِ بْنِ الْوَلِيدِ الْخَثْعَمِيِّ عَنْ أَبِي الرَّبِيعِ الشَّامِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ يا أَيُّهَا الَّذِينَ آمَنُوا اسْتَجِيبُوا لِلَّهِ وَ لِلرَّسُولِ إِذا دَعاكُمْ لِما يُحْيِيكُمْ قَالَ نَزَلَتْ فِي وَلَايَةِ عَلِيٍّ (عليه السلام) ",
          "قَالَ وَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ ما تَسْقُطُ مِنْ وَرَقَةٍ إِلَّا يَعْلَمُها وَ لا حَبَّةٍ فِي ظُلُماتِ الْأَرْضِ وَ لا رَطْبٍ وَ لا يابِسٍ إِلَّا فِي كِتابٍ مُبِينٍ قَالَ فَقَالَ الْوَرَقَةُ السِّقْطُ وَ الْحَبَّةُ الْوَلَدُ وَ ظُلُمَاتُ الْأَرْضِ الْأَرْحَامُ وَ الرَّطْبُ مَا يَحْيَى مِنَ النَّاسِ وَ الْيَابِسُ مَا يُقْبَضُ وَ كُلُّ ذَلِكَ فِي إِمَامٍ مُبِينٍ ",
          "قَالَ وَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ قُلْ سِيرُوا فِي الْأَرْضِ فَانْظُرُوا كَيْفَ كانَ عاقِبَةُ الَّذِينَ مِنْ قَبْلُ فَقَالَ عَنَى بِذَلِكَ أَيِ انْظُرُوا فِي الْقُرْآنِ فَاعْلَمُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِنْ قَبْلِكُمْ وَ مَا أَخْبَرَكُمْ عَنْهُ",
          "قَالَ فَقُلْتُ فَقَوْلُهُ عَزَّ وَ جَلَّ وَ إِنَّكُمْ لَتَمُرُّونَ عَلَيْهِمْ مُصْبِحِينَ وَ بِاللَّيْلِ أَ فَلا تَعْقِلُونَ قَالَ تَمُرُّونَ عَلَيْهِمْ فِي الْقُرْآنِ إِذَا قَرَأْتُمُ الْقُرْآنَ تَقْرَأُ مَا قَصَّ اللَّهُ عَزَّ وَ جَلَّ عَلَيْكُمْ مِنْ خَبَرِهِمْ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473478\">H 14797</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Khalid, and Al-Husayn Bin Saeed together from Al-Nazar Bin Suweyd, from Yahya Al-Halby, from Abdullah Bin Muskaan, from Zayd Bin Al-Waleed Al-Khash’amy, from Abu Al-Rabi’e Al-Shamy who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked Abu Abdullah</span><sup>asws</sup> about the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:8#h24\">[8:24]</a> O you who believe! answer (the call of) Allah and His Messenger when he calls you to that which gives you life”</span>. He<sup>asws</sup> said: ‘It was Revealed regarding the Wilayah of Ali<sup>asws</sup>’.",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:6#h59\">[6:59]</a>, and there falls not a leaf but He knows it, nor a grain in the darkness of the earth, nor anything wet nor dry but (it is all) in a clear book”</span>. He<sup>asws</sup> said: ‘The fallen leaf (is the miscarried child) and the grain is the child, and the darkness of the earth is the womb, and the wet is who lives from the people, and the dry is who has been Captured (died), and all that is in the manifest Imam<sup>asws</sup>’.",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:30#h42\">[30:42]</a> Say: Travel in the land, then see how was the end of those before”</span>. So he<sup>asws</sup> said: ‘It means by that, look in the Quran so you will come to know how was the eventual end of those who were before you, and what it is informing you from it’.",
            "He (the narrator) said, ‘I said, ‘The Statement of the Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:37#h137\">[37:137]</a> And most surely you pass by them in the morning, <a href=\"/#/books/quran:37#h138\">[37:138]</a> And at night; do you not then understand?”</span> He<sup>asws</sup> said: ‘You pass by them in the Quran when you recite the Quran, read what story Allah<sup>azwj</sup> Mighty and Majestic has Told you from their news’."
          ],
          "en.sarwar": [
            "350. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Khalid, and Al-Husayn Bin Saeed together from Al-Nazar Bin Suweyd, from Yahya Al-Halby, from Abdullah Bin Muskaan, from Zayd Bin Al-Waleed Al-Khash’amy, from Abu Al-Rabi’e Al-Shamy who said: I asked Abu Abdullah (a.s.) about the Statement of Allah (azwj) Mighty and Majestic: “<a href=\"/#/books/quran:8#h24\">[8:24]</a> O you who believe! answer (the call of) Allah and His Messenger when he calls you to that which gives you life”. He (a.s.) said: ‘It was Revealed regarding the Wilayah of Ali (a.s.)’. He (the narrator) said, ‘And I asked him (a.s.) about the Statement of Allah (azwj) Mighty and Majestic: “<a href=\"/#/books/quran:6#h59\">[6:59]</a>, and there falls not a leaf but He knows it, nor a grain in the darkness of the earth, nor anything wet nor dry but (it is all) in a clear book”. He (a.s.) said: ‘The fallen leaf (is the miscarried child) and the grain is the child, and the darkness of the earth is the womb, and the wet is who lives from the people, and the dry is who has been Captured (died), and all that is in the manifest Imam (a.s.)’. He (the narrator) said, ‘And I asked him (a.s.) about the Statement of Allah (azwj) Mighty and Majestic: “<a href=\"/#/books/quran:30#h42\">[30:42]</a> Say: Travel in the land, then see how was the end of those before”. So he (a.s.) said: ‘It means by that, look in the Quran so you will come to know how was the eventual end of those who were before you, and what it is informing you from it’. He (the narrator) said, ‘I said, ‘The Statement of the Mighty and Majestic: “<a href=\"/#/books/quran:37#h137\">[37:137]</a> And most surely you pass by them in the morning, <a href=\"/#/books/quran:37#h138\">[37:138]</a> And at night; do you not then understand?” He (a.s.) said: ‘You pass by them in the Quran when you recite the Quran, read what story Allah (azwj) Mighty and Majestic has Told you from their news’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول ويكن عده ف السان</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 225)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15035,
        "local_index": 38,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:38",
        "text": [
          "14798- عَنْهُ عَنِ ابْنِ مُسْكَانَ عَنْ رَجُلٍ مِنْ أَهْلِ الْجَبَلِ لَمْ يُسَمِّهِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) عَلَيْكَ بِالتِّلَادِ وَ إِيَّاكَ وَ كُلَّ مُحْدَثٍ لَا عَهْدَ لَهُ وَ لَا أَمَانَةَ وَ لَا ذِمَّةَ وَ لَا مِيثَاقَ وَ كُنْ عَلَى حَذَرٍ مِنْ أَوْثَقِ النَّاسِ فِي نَفْسِكَ فَإِنَّ النَّاسَ أَعْدَاءُ النِّعَمِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473479\">H 14798</a> – From him, from Ibn Muskaan, from a man from the people of Al-Jabl whom he did not name, has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘It is on you to be with the original, and beware of every newly invented matter as there is no pledge for it, nor a trust for it, nor a guarantee for it, nor a Covenant for it. And be cautious of the people whom you rely upon for yourself, for the people are the enemies of the bounties’."
          ],
          "en.sarwar": [
            "351. From him, from Ibn Muskaan, from a man from the people of Al-Jabl whom he did not name, has narrated the following: Abu Abdullah (a.s.) said: ‘It is on you to be with the original, and beware of every newly invented matter as there is no pledge for it, nor a trust for it, nor a guarantee for it, nor a Covenant for it. And be cautious of the people whom you rely upon for yourself, for the people are the enemies of the bounties’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 228)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15036,
        "local_index": 39,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:39",
        "refs": {
          "Quran": [
            "/books/quran:47:4"
          ]
        },
        "text": [
          "14799-  يَحْيَى الْحَلَبِيُّ عَنْ أَبِي الْمُسْتَهِلِّ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ قَالَ سَأَلَنِي أَبُو عَبْدِ اللَّهِ (عليه السلام) فَقَالَ مَا دَعَاكُمْ إِلَى الْمَوْضِعِ الَّذِي وَضَعْتُمْ فِيهِ زَيْداً قَالَ قُلْتُ خِصَالٌ ثَلَاثٌ أَمَّا إِحْدَاهُنَّ فَقِلَّةُ مَنْ تَخَلَّفَ مَعَنَا إِنَّمَا كُنَّا ثَمَانِيَةَ نَفَرٍ وَ أَمَّا الْأُخْرَى فَالَّذِي تَخَوَّفْنَا مِنَ الصُّبْحِ أَنْ يَفْضَحَنَا وَ أَمَّا الثَّالِثَةُ فَإِنَّهُ كَانَ مَضْجَعَهُ الَّذِي كَانَ سَبَقَ إِلَيْهِ فَقَالَ كَمْ إِلَى الْفُرَاتِ مِنَ الْمَوْضِعِ الَّذِي وَضَعْتُمُوهُ فِيهِ قُلْتُ قَذْفَةُ حَجَرٍ ",
          "فَقَالَ سُبْحَانَ اللَّهِ أَ فَلَا كُنْتُمْ أَوْقَرْتُمُوهُ حَدِيداً وَ قَذَفْتُمُوهُ فِي الْفُرَاتِ وَ كَانَ أَفْضَلَ فَقُلْتُ جُعِلْتُ فِدَاكَ لَا وَ اللَّهِ مَا طُقْنَا لِهَذَا فَقَالَ أَيَّ شَيْ‏ءٍ كُنْتُمْ يَوْمَ خَرَجْتُمْ مَعَ زَيْدٍ قُلْتُ مُؤْمِنِينَ قَالَ فَمَا كَانَ عَدُوُّكُمْ قُلْتُ كُفَّاراً قَالَ فَإِنِّي أَجِدُ فِي كِتَابِ اللَّهِ عَزَّ وَ جَلَّ يَا أَيُّهَا الَّذِينَ آمَنُوا فَإِذا لَقِيتُمُ الَّذِينَ كَفَرُوا فَضَرْبَ الرِّقابِ حَتَّى إِذا أَثْخَنْتُمُوهُمْ فَشُدُّوا الْوَثاقَ فَإِمَّا مَنًّا بَعْدُ وَ إِمَّا فِداءً حَتَّى تَضَعَ الْحَرْبُ أَوْزارَها فَابْتَدَأْتُمْ أَنْتُمْ بِتَخْلِيَةِ مَنْ أَسَرْتُمْ سُبْحَانَ اللَّهِ مَا اسْتَطَعْتُمْ أَنْ تَسِيرُوا بِالْعَدْلِ سَاعَةً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473480\">H 14799</a> – Yahya Al-Halby, from Abu Al-Mustahal, from Suleyman Bin Khalid who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> questioned me: ‘What was the place in which you placed (the body of) Zayd?’ I said, ‘There were three issues. As for one of them, so there were very few of us who were left behind with us, but rather, we were eight persons. As for the other one, so we were afraid from the morning, which would have exposed us. And as for the third, so it was his bed (resting place) which he proceeded to’. So he<sup>asws</sup> said: ‘How far was the Euphrates from the place in which you placed (buried) him?’ I said, ‘A stone’s throw away’.",
            "So he<sup>asws</sup> said: ‘Glory be to Allah<sup>azwj</sup>! So why did you all not tie a (piece of) iron to him, and throw him in the Euphrates, and that would have been preferable?’ I said, ‘May I be sacrificed for you<sup>asws</sup>, no, by Allah<sup>azwj</sup>, we had no way for this’. So he<sup>asws</sup> said: ‘Which thing (were you on) on the day you all came out with Zayd?’ I said, ‘We were Believers’. He<sup>asws</sup> said: ‘Who were your enemies?’ I said, ‘Infidels’. He<sup>asws</sup> said: ‘I<sup>asws</sup> found in the Book of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">\"<a href=\"/#/books/quran:47#h4\">[47:4]</a> So when you meet in battle those who disbelieve, then smite the necks until when you have overcome them, then make (them) prisoners, and afterwards either set them free as a favour or let them ransom (themselves) until the war terminates”</span>. You all began by evacuating yourselves from captivity. Glory be to Allah<sup>azwj</sup>! You did not have the ability to travel with the justice even for a while’."
          ],
          "en.sarwar": [
            "352. Yahya Al-Halby, from Abu Al-Mustahal, from Suleyman Bin Khalid who said: Abu Abdullah (a.s.) questioned me: ‘What was the place in which you placed (the body of) Zayd?’ I said, ‘There were three issues. As for one of them, so there were very few of us who were left behind with us, but rather, we were eight persons. As for the other one, so we were afraid from the morning, which would have exposed us. And as for the third, so it was his bed (resting place) which he proceeded to’. So he (a.s.) said: ‘How far was the Euphrates from the place in which you placed (buried) him?’ I said, ‘A stone’s throw away’. So he (a.s.) said: ‘Glory be to Allah (azwj)! So why did you all not tie a (piece of) iron to him, and throw him in the Euphrates, and that would have been preferable?’ I said, ‘May I be sacrificed for you (a.s.), no, by Allah (azwj), we had no way for this’. So he (a.s.) said: ‘Which thing (were you on) on the day you all came out with Zayd?’ I said, ‘We were Believers’. He (a.s.) said: ‘Who were your enemies?’ I said, ‘Infidels’. He (a.s.) said: ‘I (a.s.) found in the Book of Allah (azwj) Mighty and Majestic: \"<a href=\"/#/books/quran:47#h4\">[47:4]</a> So when you meet in battle those who disbelieve, then smite the necks until when you have overcome them, then make (them) prisoners, and afterwards either set them free as a favour or let them ransom (themselves) until the war terminates”. You all began by evacuating yourselves from captivity. Glory be to Allah (azwj)! You did not have the ability to travel with the justice even for a while’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح على الظاهر</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 228)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15037,
        "local_index": 40,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:40",
        "text": [
          "14800- يَحْيَى الْحَلَبِيُّ عَنْ هَارُونَ بْنِ الْخَارِجَةِ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَعْفَى نَبِيَّكُمْ أَنْ يَلْقَى مِنْ أُمَّتِهِ مَا لَقِيَتِ الْأَنْبِيَاءُ مِنْ أُمَمِهَا وَ جَعَلَ ذَلِكَ عَلَيْنَا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473481\">H 14800</a> – Yahya Al-Halby, from Haroun Bin Al-Kharjat, from Abu Baseer, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said that: ‘Allah<sup>azwj</sup> Mighty and Majestic Exempted your Prophet<sup>saww</sup> from facing from his<sup>saww</sup> community what the Prophets<sup>as</sup> faced from their communities, and Made that for us<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "353. Yahya Al-Halby, from Haroun Bin Al-Kharjat, from Abu Baseer, who has said: Abu Abdullah (a.s.) having said that: ‘Allah (azwj) Mighty and Majestic Exempted your Prophet (saww) from facing from his (saww) community what the Prophets (as) faced from their communities, and Made that for us (a.s.)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 229)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15038,
        "local_index": 41,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:41",
        "text": [
          "14801- يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ ضُرَيْسٍ قَالَ تَمَارَى النَّاسُ عِنْدَ أَبِي جَعْفَرٍ (عليه السلام) فَقَالَ بَعْضُهُمْ حَرْبُ عَلِيٍّ شَرٌّ مِنْ حَرْبِ رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ قَالَ بَعْضُهُمْ حَرْبُ رَسُولِ اللَّهِ (صلى الله عليه وآله) شَرٌّ مِنْ حَرْبِ عَلِيٍّ (عليه السلام) قَالَ فَسَمِعَهُمْ أَبُو جَعْفَرٍ (عليه السلام) فَقَالَ مَا تَقُولُونَ فَقَالُوا أَصْلَحَكَ اللَّهُ تَمَارَيْنَا فِي حَرْبِ رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ فِي حَرْبِ عَلِيٍّ (عليه السلام) فَقَالَ بَعْضُنَا حَرْبُ عَلِيٍّ (عليه السلام) شَرٌّ مِنْ حَرْبِ رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ قَالَ بَعْضُنَا حَرْبُ رَسُولِ اللَّهِ (صلى الله عليه وآله) شَرٌّ مِنْ حَرْبِ عَلِيٍّ (عليه السلام) ",
          "فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) لَا بَلْ حَرْبُ عَلِيٍّ (عليه السلام) شَرٌّ مِنْ حَرْبِ رَسُولِ اللَّهِ (صلى الله عليه وآله) فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ أَ حَرْبُ عَلِيٍّ (عليه السلام) شَرٌّ مِنْ حَرْبِ رَسُولِ اللَّهِ (صلى الله عليه وآله) قَالَ نَعَمْ وَ سَأُخْبِرُكَ عَنْ ذَلِكَ إِنَّ حَرْبَ رَسُولِ اللَّهِ (صلى الله عليه وآله) لَمْ يُقِرُّوا بِالْإِسْلَامِ وَ إِنَّ حَرْبَ عَلِيٍّ (عليه السلام) أَقَرُّوا بِالْإِسْلَامِ ثُمَّ جَحَدُوهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473482\">H 14801</a> – Yahya, from Abdulah Bin Muskaan, from Zureys who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-t\">T</span>he people disputed</span> in the presence of Abu Ja’far<sup>asws</sup>. So some of them said, ‘The wars fought by Ali<sup>asws</sup> were (against a people) more evil than the wars fought by the Rasool Allah<sup>saww</sup>, and some of them said, ‘The wars fought by the Rasool Allah<sup>saww</sup> were (against a people) more evil than the wars fought by Ali<sup>asws</sup>’. He (the narrator) said, ‘So Abu Ja’far listened to them and said: ‘What are you all saying?’ So they said, ‘May Allah<sup>azwj</sup> keep you<sup>asws</sup> well, we are disputing with regards to the wars of the Rasool Allah<sup>saww</sup> and the wars of Ali<sup>asws</sup>. Some of us are saying that the wars of Ali<sup>asws</sup> were (against a people) more evil than the wars fought by the Rasool Allah<sup>saww</sup>, whilst some of us are saying that the wars fought by the Messenger<sup>saww</sup> were (against a people) more evil than the wars fought by Ali<sup>asws</sup>’.",
            "So Abu Ja’far<sup>asws</sup> said: ‘No! But, the wars of Ali<sup>asws</sup> were (against a people) more evil than the wars of the Rasool Allah<sup>saww</sup>’. So I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>, the wars of Ali<sup>asws</sup> were (against a people) more evil than the wars of the Rasool Allah<sup>saww</sup>?’ He<sup>asws</sup> said: ‘Yes, and I<sup>asws</sup> shall inform you about that. The Messenger<sup>saww</sup> fought wars (against a people) who did not accept Al-Islam, and that the wars of Ali<sup>asws</sup> were (against a people) who accepted Al-Islam, then fought against him<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "354. Yahya, from Abdulah Bin Muskaan, from Zureys who said: The people disputed in the presence of Abu Ja’far (a.s.). So some of them said, ‘The wars fought by Ali (a.s.) were (against a people) more evil than the wars fought by the Rasool Allah (saww), and some of them said, ‘The wars fought by the Rasool Allah (saww) were (against a people) more evil than the wars fought by Ali (a.s.)’. He (the narrator) said, ‘So Abu Ja’far listened to them and said: ‘What are you all saying?’ So they said, ‘May Allah (azwj) keep you (a.s.) well, we are disputing with regards to the wars of the Rasool Allah (saww) and the wars of Ali (a.s.). Some of us are saying that the wars of Ali (a.s.) were (against a people) more evil than the wars fought by the Rasool Allah (saww), whilst some of us are saying that the wars fought by the Messenger (saww) were (against a people) more evil than the wars fought by Ali (a.s.)’. So Abu Ja’far (a.s.) said: ‘No! But, the wars of Ali (a.s.) were (against a people) more evil than the wars of the Rasool Allah (saww)’. So I said to him (a.s.), ‘May I be sacrificed for you (a.s.), the wars of Ali (a.s.) were (against a people) more evil than the wars of the Rasool Allah (saww)?’ He (a.s.) said: ‘Yes, and I (a.s.) shall inform you about that. The Messenger (saww) fought wars (against a people) who did not accept Al-Islam, and that the wars of Ali (a.s.) were (against a people) who accepted Al-Islam, then fought against him (a.s.)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 233)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15039,
        "local_index": 42,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:42",
        "refs": {
          "Quran": [
            "/books/quran:21:84"
          ]
        },
        "text": [
          "14802- يَحْيَى بْنُ عِمْرَانَ عَنْ هَارُونَ بْنِ خَارِجَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ آتَيْناهُ أَهْلَهُ وَ مِثْلَهُمْ مَعَهُمْ قُلْتُ وُلْدُهُ كَيْفَ أُوتِيَ مِثْلَهُمْ مَعَهُمْ قَالَ أَحْيَا لَهُ مِنْ وُلْدِهِ الَّذِينَ كَانُوا مَاتُوا قَبْلَ ذَلِكَ بِآجَالِهِمْ مِثْلَ الَّذِينَ هَلَكُوا يَوْمَئِذٍ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473483\">H 14802</a> – Yahya Bin Umraan, from Haroun Bin Kharjat, from Abu Baseer, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> regarding the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:21#h84\">[21:84]</a> and We gave him his household (that he had lost) and the like thereof along with them”</span>. I said, ‘His (Prophet Ayub<sup>as</sup>) children, how was he<sup>as</sup> given the like of them, with them?’ He<sup>asws</sup> said: ‘He<sup>azwj</sup> Revived for him<sup>as</sup> from his<sup>as</sup> children who had died before that of natural causes, and the like (number) of those who had died on that day’."
          ],
          "en.sarwar": [
            "355. Yahya Bin Umraan, from Haroun Bin Kharjat, from Abu Baseer, who has narrated the following: Abu Abdullah (a.s.) regarding the Statement of Allah (azwj) Mighty and Majestic: “<a href=\"/#/books/quran:21#h84\">[21:84]</a> and We gave him his household (that he had lost) and the like thereof along with them”. I said, ‘His (Prophet Ayub (as)) children, how was he (as) given the like of them, with them?’ He (a.s.) said: ‘He (azwj) Revived for him (as) from his (as) children who had died before that of natural causes, and the like (number) of those who had died on that day’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 233)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15040,
        "local_index": 43,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:43",
        "refs": {
          "Quran": [
            "/books/quran:10:27"
          ]
        },
        "text": [
          "14803- يَحْيَى الْحَلَبِيُّ عَنِ الْمُثَنَّى عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ كَأَنَّما أُغْشِيَتْ وُجُوهُهُمْ قِطَعاً مِنَ اللَّيْلِ مُظْلِماً قَالَ أَ مَا تَرَى الْبَيْتَ إِذَا كَانَ اللَّيْلُ كَانَ أَشَدَّ سَوَاداً مِنْ خَارِجٍ فَلِذَلِكَ هُمْ يَزْدَادُونَ سَوَاداً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473484\">H 14803</a> – Yahya Al-halby, from Al-Musna, from Abu Baseer, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> regarding the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:10#h27\">[10:27]</a> as if their faces had been covered with slices of the dense darkness of night”</span>, he<sup>asws</sup> said: ‘But, have you seen the house when it is the night, so it would be darker inside than the outside of it. So, like that, their darkness would be increased’."
          ],
          "en.sarwar": [
            "356. Yahya Al-halby, from Al-Musna, from Abu Baseer, who has said: Abu Abdullah (a.s.) regarding the Statement of Allah (azwj) Mighty and Majestic: “<a href=\"/#/books/quran:10#h27\">[10:27]</a> as if their faces had been covered with slices of the dense darkness of night”, he (a.s.) said: ‘But, have you seen the house when it is the night, so it would be darker inside than the outside of it. So, like that, their darkness would be increased’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 234)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15041,
        "local_index": 44,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:44",
        "text": [
          "14804- الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنِ الْمُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنِ الْحَارِثِ بْنِ الْمُغِيرَةِ قَالَ سَمِعْتُ عَبْدَ الْمَلِكِ بْنَ أَعْيَنَ يَسْأَلُ أَبَا عَبْدِ اللَّهِ (عليه السلام) فَلَمْ يَزَلْ يُسَائِلُهُ حَتَّى قَالَ فَهَلَكَ النَّاسُ إِذاً قَالَ إِي وَ اللَّهِ يَا ابْنَ أَعْيَنَ فَهَلَكَ النَّاسُ أَجْمَعُونَ قُلْتُ مَنْ فِي الْمَشْرِقِ وَ مَنْ فِي الْمَغْرِبِ قَالَ إِنَّهَا فُتِحَتْ بِضَلَالٍ إِي وَ اللَّهِ لَهَلَكُوا إِلَّا ثَلَاثَةً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473485\">H 14804</a> – Al-Husayn Bin Muhammad, from Moala Bin Muhammad, from Al-Washa, from Abaan Bin Usman, from Al-haris Bin Al-Mugheira who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abdul Malik</span> Bin Ayn ask Abu Abdullah<sup>asws</sup> and he did not stop asking until he said, ‘So the people are destroyed’. He<sup>asws</sup> said: ‘Yes, by Allah<sup>azwj</sup>! O Ibn Ayn, all the people destroyed’. I said, ‘The ones who are in the east and the one who are in the west?’ He<sup>asws</sup> said: ‘They have been conquered by the misguidance. Yes, by Allah<sup>azwj</sup>! They were destroyed except for three (Salman<sup>ar</sup>, Abu Dharr<sup>ar</sup> and Al-Miqdad<sup>ar</sup>)’."
          ],
          "en.sarwar": [
            "357. Al-Husayn Bin Muhammad, from Moala Bin Muhammad, from Al-Washa, from Abaan Bin Usman, from Al-haris Bin Al-Mugheira who said: I heard Abdul Malik Bin Ayn ask Abu Abdullah (a.s.) and he did not stop asking until he said, ‘So the people are destroyed’. He (a.s.) said: ‘Yes, by Allah (azwj)! O Ibn Ayn, all the people destroyed’. I said, ‘The ones who are in the east and the one who are in the west?’ He (a.s.) said: ‘They have been conquered by the misguidance. Yes, by Allah (azwj)! They were destroyed except for three (Salman (ar), Abu Dharr (ar) and Al-Miqdad (ar))’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 235)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15042,
        "local_index": 45,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:45",
        "text": [
          "14805- مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ إِسْحَاقَ بْنِ يَزِيدَ عَنْ مِهْرَانَ عَنْ أَبَانِ بْنِ تَغْلِبَ وَ عِدَّةٍ قَالُوا كُنَّا عِنْدَ أَبِي عَبْدِ اللَّهِ (عليه السلام) جُلُوساً فَقَالَ (عليه السلام) لَا يَسْتَحِقُّ عَبْدٌ حَقِيقَةَ الْإِيمَانِ حَتَّى يَكُونَ الْمَوْتُ أَحَبَّ إِلَيْهِ مِنَ الْحَيَاةِ وَ يَكُونَ الْمَرَضُ أَحَبَّ إِلَيْهِ مِنَ الصِّحَّةِ وَ يَكُونَ الْفَقْرُ أَحَبَّ إِلَيْهِ مِنَ الْغِنَى فَأَنْتُمْ كَذَا فَقَالُوا لَا وَ اللَّهِ جَعَلَنَا اللَّهُ فِدَاكَ وَ سُقِطَ فِي أَيْدِيهِمْ وَ وَقَعَ الْيَأْسُ فِي قُلُوبِهِمْ ",
          "فَلَمَّا رَأَى مَا دَاخَلَهُمْ مِنْ ذَلِكَ قَالَ أَ يَسُرُّ أَحَدَكُمْ أَنَّهُ عُمِّرَ مَا عُمِّرَ ثُمَّ يَمُوتُ عَلَى غَيْرِ هَذَا الْأَمْرِ أَوْ يَمُوتُ عَلَى مَا هُوَ عَلَيْهِ قَالُوا بَلْ يَمُوتُ عَلَى مَا هُوَ عَلَيْهِ السَّاعَةَ قَالَ فَأَرَى الْمَوْتَ أَحَبَّ إِلَيْكُمْ مِنَ الْحَيَاةِ ",
          "ثُمَّ قَالَ أَ يَسُرُّ أَحَدَكُمْ أَنْ بَقِيَ مَا بَقِيَ لَا يُصِيبُهُ شَيْ‏ءٌ مِنْ هَذِهِ الْأَمْرَاضِ وَ الْأَوْجَاعِ حَتَّى يَمُوتَ عَلَى غَيْرِ هَذَا الْأَمْرِ قَالُوا لَا يَا ابْنَ رَسُولِ اللَّهِ قَالَ فَأَرَى الْمَرَضَ أَحَبَّ إِلَيْكُمْ مِنَ الصِّحَّةِ ",
          "ثُمَّ قَالَ أَ يَسُرُّ أَحَدَكُمْ أَنَّ لَهُ مَا طَلَعَتْ عَلَيْهِ الشَّمْسُ وَ هُوَ عَلَى غَيْرِ هَذَا الْأَمْرِ قَالُوا لَا يَا ابْنَ رَسُولِ اللَّهِ قَالَ فَأَرَى الْفَقْرَ أَحَبَّ إِلَيْكُمْ مِنَ الْغِنَى."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473486\">H 14805</a> – Muhammad Biin Yahya, from Muhammad Bin Al-Husayn, from Is’haq Bin Yazeed, from Mahraan, from Abaan Bin Taglub, and a number who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-w\">W</span>e were seated in the</span> presence of Abu Abdullah<sup>asws</sup>, so he<sup>asws</sup> said; ‘A servant does not become deserving of the true belief until the death becomes more beloved to him than the life, and the illness becomes more beloved to him than the health, and the poverty becomes more beloved to him than the richness. So are you all like this?’ So we said, ‘No, by Allah<sup>azwj</sup>! May Allah<sup>azwj</sup> Make us to be sacrificed for you<sup>asws</sup> ‘. And (their heads) fell into their hands, and despair filled their hearts.",
            "So when he<sup>asws</sup> saw what had entered into them from that, he<sup>asws</sup> said: ‘Is it more pleasing for one of you that he lives for as long as he does, then dies upon other than this matter (Al-Wilayah), or he dies what he is upon?’ We said, ‘But, dying what he is at this time’. He<sup>asws</sup> said: ‘So I<sup>asws</sup> see that the death is more beloved to you than the life’.",
            "Then said: ‘Is it more pleasing for one of you to remain upon what he is and not be struck by anything from these illnesses and the pains until he dies upon other than this matter (Al-Wilayah)’. We said, ‘No, O son<sup>asws</sup> of the Rasool Allah<sup>saww</sup>’. He<sup>asws</sup> said: ‘So I<sup>asws</sup> see that illness is more beloved to you than the health’.",
            "Then said: ‘Is it more pleasing to one of you that for him should be all that the sun rises upon, and he is upon other than this matter (Al-Wilayah)?’ We said, ‘No, O son<sup>asws</sup> of the Rasool Allah<sup>saww</sup>’. He<sup>asws</sup> said: ‘So I<sup>asws</sup> see that the poverty is more beloved to you than the richness’."
          ],
          "en.sarwar": [
            "358. Muhammad Biin Yahya, from Muhammad Bin Al-Husayn, from Is’haq Bin Yazeed, from Mahraan, from Abaan Bin Taglub, and a number who said: We were seated in the presence of Abu Abdullah (a.s.), so he (a.s.) said; ‘A servant does not become deserving of the true belief until the death becomes more beloved to him than the life, and the illness becomes more beloved to him than the health, and the poverty becomes more beloved to him than the richness. So are you all like this?’ So we said, ‘No, by Allah (azwj)! May Allah (azwj) Make us to be sacrificed for you (a.s.) ‘. And (their heads) fell into their hands, and despair filled their hearts. So when he (a.s.) saw what had entered into them from that, he (a.s.) said: ‘Is it more pleasing for one of you that he lives for as long as he does, then dies upon other than this matter (Al-Wilayah), or he dies what he is upon?’ We said, ‘But, dying what he is at this time’. He (a.s.) said: ‘So I (a.s.) see that the death is more beloved to you than the life’. Then said: ‘Is it more pleasing for one of you to remain upon what he is and not be struck by anything from these illnesses and the pains until he dies upon other than this matter (Al-Wilayah)’. We said, ‘No, O son (a.s.) of the Rasool Allah (saww)’. He (a.s.) said: ‘So I (a.s.) see that illness is more beloved to you than the health’. Then said: ‘Is it more pleasing to one of you that for him should be all that the sun rises upon, and he is upon other than this matter (Al-Wilayah)?’ We said, ‘No, O son (a.s.) of the Rasool Allah (saww)’. He (a.s.) said: ‘So I (a.s.) see that the poverty is more beloved to you than the richness’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 235)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15043,
        "local_index": 46,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:46",
        "text": [
          "14806- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ حَمَّادٍ اللَّحَّامِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) أَنَّ أَبَاهُ قَالَ يَا بُنَيَّ إِنَّكَ إِنْ خَالَفْتَنِي فِي الْعَمَلِ لَمْ تَنْزِلْ مَعِيَ غَداً فِي الْمَنْزِلِ ثُمَّ قَالَ أَبَى اللَّهُ عَزَّ وَ جَلَّ أَنْ يَتَوَلَّى قَوْمٌ قَوْماً يُخَالِفُونَهُمْ فِي أَعْمَالِهِمْ يَنْزِلُونَ مَعَهُمْ يَوْمَ الْقِيَامَةِ كَلَّا وَ رَبِّ الْكَعْبَةِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473487\">H 14806</a> – Muhammad Bin Yahya, from Ahmad bin Muhammad, from Al-Hassan Bin Ali, from Hammaad Al-Laham, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said that his<sup>asws</sup> father<sup>asws</sup> said: ‘O my<sup>asws</sup> son<sup>asws</sup>! If you<sup>asws</sup> oppose me<sup>asws</sup> in the deeds, you<sup>asws</sup> will not be descending with me<sup>asws</sup> tomorrow in the Dwelling (Hereafter)’. Then added: ‘Allah<sup>azwj</sup> has Refused to make friendship between those who oppose each other in their deeds when they are resurrected together on the Day of Judgement. No! By the Lord<sup>azwj</sup> of the Kabah (it will not happen)’."
          ],
          "en.sarwar": [
            "359. Muhammad Bin Yahya, from Ahmad bin Muhammad, from Al-Hassan Bin Ali, from Hammaad Al-Laham, who has said: Abu Abdullah (a.s.) said that his (a.s.) father (a.s.) said: ‘O my (a.s.) son (a.s.)! If you (a.s.) oppose me (a.s.) in the deeds, you (a.s.) will not be descending with me (a.s.) tomorrow in the Dwelling (Hereafter)’. Then added: ‘Allah (azwj) has Refused to make friendship between those who oppose each other in their deeds when they are resurrected together on the Day of Judgement. No! By the Lord (azwj) of the Kabah (it will not happen)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 236)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15044,
        "local_index": 47,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:47",
        "text": [
          "14807- الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ (عليه السلام) يَقُولُ مَا أَحَدٌ مِنْ هَذِهِ الْأُمَّةِ يَدِينُ بِدِينِ إِبْرَاهِيمَ (عليه السلام) إِلَّا نَحْنُ وَ شِيعَتُنَا وَ لَا هُدِيَ مَنْ هُدِيَ مِنْ هَذِهِ الْأُمَّةِ إِلَّا بِنَا وَ لَا ضَلَّ مَنْ ضَلَّ مِنْ هَذِهِ الْأُمَّةِ إِلَّا بِنَا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473488\">H 14807</a> – Al-Husayn Bin Muhammad Al-Ashary, from Moalla Bin Muhammad, from Al-Washa, from Muhammad Bin Al-Fazeyl, from Abu Hamza who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Ja’far</span><sup>asws</sup> saying: ‘There is no one from this community who has made a Religion for himself with the Religion of Ibrahim<sup>as</sup> except for us<sup>asws</sup>, and our<sup>asws</sup> Shites. And there is none who is upon the guidance who has been guided from this community except by us<sup>asws</sup>, nor has he strayed, the one who has strayed from this community, except due to (opposing) us<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "360. Al-Husayn Bin Muhammad Al-Ashary, from Mu‘alla Bin Muhammad, from Al-Washa, from Muhammad Bin Al-Fazeyl, from Abu Hamza who said: I heard Abu Ja’far (a.s.) saying: ‘There is no one from this community who has made a Religion for himself with the Religion of Ibrahim (as) except for us (a.s.), and our (a.s.) Shites. And there is none who is upon the guidance who has been guided from this community except by us (a.s.), nor has he strayed, the one who has strayed from this community, except due to (opposing) us (a.s.)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 236)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3/ 397)"
        ],
        "index": 15045,
        "local_index": 48,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:48",
        "text": [
          "14808- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَلِيِّ بْنِ عَطِيَّةَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ كُنْتُ عِنْدَهُ وَ سَأَلَهُ رَجُلٌ عَنْ رَجُلٍ يَجِي‏ءُ مِنْهُ الشَّيْ‏ءُ عَلَى حَدِّ الْغَضَبِ يُؤَاخِذُهُ اللَّهُ بِهِ فَقَالَ اللَّهُ أَكْرَمُ مِنْ أَنْ يَسْتَغْلِقَ عَبْدَهُ وَ فِي نُسْخَةِ أَبِي الْحَسَنِ الْأَوَّلِ (عليه السلام) يَسْتَقْلِقَ عَبْدَهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473489\">H 14808</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ali Bin Atiyya, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said, ‘I was in his<sup>asws</sup> presence and a man asked him<sup>asws</sup> about a man from whom something comes out due to his anger, will Allah<sup>azwj</sup> Hold him responsible for it?’ So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> is more benevolent than Tying down His<sup>azwj</sup> servant’. And in a copy from Abu Al-Hassan The First<sup>asws</sup>: (which says Allah<sup>azwj</sup> does not) ‘Coerce His<sup>azwj</sup> servant’."
          ],
          "en.sarwar": [
            "361. Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ali Bin Atiyya, who has said: Abu Abdullah (a.s.) said, ‘I was in his (a.s.) presence and a man asked him (a.s.) about a man from whom something comes out due to his anger, will Allah (azwj) Hold him responsible for it?’ So he (a.s.) said: ‘Allah (azwj) is more benevolent than Tying down His (azwj) servant’. And in a copy from Abu Al-Hassan The First (a.s.): (which says Allah (azwj) does not) ‘Coerce His (azwj) servant’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 237)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3/ 397)"
        ],
        "index": 15046,
        "local_index": 49,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:49",
        "refs": {
          "Quran": [
            "/books/quran:8:33"
          ]
        },
        "text": [
          "14809- عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ أَبِي حَمْزَةَ وَ غَيْرِ وَاحِدٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) إِنَّ لَكُمْ فِي حَيَاتِي خَيْراً وَ فِي مَمَاتِي خَيْراً قَالَ فَقِيلَ يَا رَسُولَ اللَّهِ أَمَّا حَيَاتَكَ فَقَدْ عَلِمْنَا فَمَا لَنَا فِي وَفَاتِكَ فَقَالَ أَمَّا فِي حَيَاتِي فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ قَالَ وَ ما كانَ اللَّهُ لِيُعَذِّبَهُمْ وَ أَنْتَ فِيهِمْ وَ أَمَّا فِي مَمَاتِي فَتُعْرَضُ عَلَيَّ أَعْمَالُكُمْ فَأَسْتَغْفِرُ لَكُمْ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473490\">H 14809</a> – Ali, from his father, from Ibn Abu Umeyr, from Muhammad Bin Abu Hamza and someone else, has reported the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> says that the Rasool Allah<sup>saww</sup> said: ‘There is goodness for you in my<sup>saww</sup> being alive and goodness for you in my<sup>saww</sup> passing away’. So they said, ‘O Rasool Allah<sup>saww</sup>! As for your<sup>saww</sup> being alive, so we have known that. So what is (goodness) for us in your<sup>saww</sup> passing away?’ He<sup>saww</sup> said: ‘As for my<sup>saww</sup> being alive, so Allah<sup>azwj</sup> Mighty and Majestic has Said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:8#h33\">[8:33]</a> But Allah was not going to chastise them while you were among them”</span>. And as for my<sup>saww</sup> passing away, your deeds would get presented to me<sup>saww</sup>, so I<sup>saww</sup> would be seeking Forgiveness for you’."
          ],
          "en.sarwar": [
            "362. Ali, from his father, from Ibn Abu Umeyr, from Muhammad Bin Abu Hamza and someone else, has reported the following: Abu Abdullah (a.s.) says that the Rasool Allah (saww) said: ‘There is goodness for you in my (saww) being alive and goodness for you in my (saww) passing away’. So they said, ‘O Rasool Allah (saww)! As for your (saww) being alive, so we have known that. So what is (goodness) for us in your (saww) passing away?’ He (saww) said: ‘As for my (saww) being alive, so Allah (azwj) Mighty and Majestic has Said: “<a href=\"/#/books/quran:8#h33\">[8:33]</a> But Allah was not going to chastise them while you were among them”. And as for my (saww) passing away, your deeds would get presented to me (saww), so I (saww) would be seeking Forgiveness for you’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 237)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15047,
        "local_index": 50,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:50",
        "text": [
          "14810- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍعَنْ هِشَامِ بْنِ سَالِمٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) إِنَّ مِمَّنْ يَنْتَحِلُ هَذَا الْأَمْرَ لَيَكْذِبُ حَتَّى إِنَّ الشَّيْطَانَ لَيَحْتَاجُ إِلَى كَذِبِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473491\">H 14810</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hashaam Bin Saalim who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘Whosoever (other than us<sup>asws</sup>) claims to posses this Command (Wilayah), he has lied to the extent that the Satan<sup>la</sup> would be needy of his lie’."
          ],
          "en.sarwar": [
            "363. Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hashaam Bin Saalim who said: Abu Abdullah (a.s.) said: ‘Whosoever (other than us (a.s.)) claims to posses this Command (Wilayah), he has lied to the extent that the Satan (la) would be needy of his lie’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 238)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15048,
        "local_index": 51,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:51",
        "text": [
          "14811- عَلِيُّ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ أَبِي حَمْزَةَ قَالَ إِنَّ أَوَّلَ مَا عَرَفْتُ عَلِيَّ بْنَ الْحُسَيْنِ (عليه السلام) أَنِّي رَأَيْتُ رَجُلًا دَخَلَ مِنْ بَابِ الْفِيلِ فَصَلَّى أَرْبَعَ رَكَعَاتٍ فَتَبِعْتُهُ حَتَّى أَتَى بِئْرَ الزَّكَاةِ وَ هِيَ عِنْدَ دَارِ صَالِحِ بْنِ عَلِيٍّ وَ إِذَا بِنَاقَتَيْنِ مَعْقُولَتَيْنِ وَ مَعَهُمَا غُلَامٌ أَسْوَدُ فَقُلْتُ لَهُ مَنْ هَذَا فَقَالَ هَذَا عَلِيُّ بْنُ الْحُسَيْنِ (عليه السلام) فَدَنَوْتُ إِلَيْهِ فَسَلَّمْتُ عَلَيْهِ وَ قُلْتُ لَهُ مَا أَقْدَمَكَ بِلَاداً قُتِلَ فِيهَا أَبُوكَ وَ جَدُّكَ فَقَالَ زُرْتُ أَبِي وَ صَلَّيْتُ فِي هَذَا الْمَسْجِدِ ثُمَّ قَالَ هَا هُوَ ذَا وَجْهِي صَلَّى اللَّهُ عَلَيْهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473492\">H 14811</a> – Ali Bin Muhammad, from Salih Bin Abu Hammaad, from Ali Bin Al-Hakam, from Malik Bin Atiyya, from Abu Hamza who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-t\">T</span>he first time I recognised</span> Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> was when I saw a man enter from the Door of ‘Al-Feel’. He<sup>asws</sup> Prayed four cycles. So I followed him<sup>asws</sup> until he<sup>asws</sup> came to the well of Al-Zakat, and it was in the house of Salih Bin Ali, and there were two she-camels with whom was a black slave. So I said to him, ‘Who is this one?’ He said, ‘This is Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>. So I approached him<sup>asws</sup>. I greeted him<sup>asws</sup> and said to him<sup>asws</sup>, ‘What is the reason that you<sup>asws</sup> have walked into the city in which your<sup>asws</sup> father<sup>asws</sup>, and your<sup>asws</sup> grandfather were killed?’ So he<sup>asws</sup> said: ‘I<sup>asws</sup> visited (Ziyarat) my<sup>asws</sup> father, and Prayed in this Masjid’. Then said: ‘This is where I<sup>asws</sup> have turned my<sup>asws</sup> attention to. May Allah<sup>azwj</sup> Send Greetings upon him<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "364. Ali Bin Muhammad, from Salih Bin Abu Hammaad, from Ali Bin Al-Hakam, from Malik Bin Atiyya, from Abu Hamza who said: The first time I recognised Ali (a.s.) Bin Al-Husayn (a.s.) was when I saw a man enter from the Door of ‘Al-Feel’. He (a.s.) Prayed four cycles. So I followed him (a.s.) until he (a.s.) came to the well of Al-Zakat, and it was in the house of Salih Bin Ali, and there were two she-camels with whom was a black slave. So I said to him, ‘Who is this one?’ He said, ‘This is Ali (a.s.) Bin Al-Husayn (a.s.). So I approached him (a.s.). I greeted him (a.s.) and said to him (a.s.), ‘What is the reason that you (a.s.) have walked into the city in which your (a.s.) father (a.s.), and your (a.s.) grandfather were killed?’ So he (a.s.) said: ‘I (a.s.) visited (Ziyarat) my (a.s.) father, and Prayed in this Masjid’. Then said: ‘This is where I (a.s.) have turned my (a.s.) attention to. May Allah (azwj) Send Greetings upon him (a.s.)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 238)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15049,
        "local_index": 52,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:52",
        "refs": {
          "Quran": [
            "/books/quran:17:33"
          ]
        },
        "text": [
          "14812- عَنْهُ عَنْ صَالِحٍ عَنِ الْحَجَّالِ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ قُتِلَ مَظْلُوماً فَقَدْ جَعَلْنا لِوَلِيِّهِ سُلْطاناً فَلا يُسْرِفْ فِي الْقَتْلِ قَالَ نَزَلَتْ فِي الْحُسَيْنِ (عليه السلام) لَوْ قُتِلَ أَهْلُ الْأَرْضِ بِهِ مَا كَانَ سَرَفاً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473493\">H 14812</a> – From him, from Salih, from Al-Hajjaal, from one of his companions, who has reported:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked Abu Abdullah</span><sup>asws</sup> about the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:17#h33\">[17:33]</a> and whoever is slain unjustly, We have indeed given to his heir authority, so let him not exceed the just limits in slaying”</span>. He<sup>asws</sup> said: ‘It was Revealed regarding Al-Husayn<sup>asws</sup>. Even if all the people of the earth were to be killed for it, it would not be excessive’."
          ],
          "en.sarwar": [
            "365. From him, from Salih, from Al-Hajjaal, from one of his companions, who has reported: I asked Abu Abdullah (a.s.) about the Statement of Allah (azwj) Mighty and Majestic: “<a href=\"/#/books/quran:17#h33\">[17:33]</a> and whoever is slain unjustly, We have indeed given to his heir authority, so let him not exceed the just limits in slaying”. He (a.s.) said: ‘It was Revealed regarding Al-Husayn (a.s.). Even if all the people of the earth were to be killed for it, it would not be excessive’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 238)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15050,
        "local_index": 53,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:53",
        "text": [
          "14813- عَنْهُ عَنْ صَالِحٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ عَبْدِ الصَّمَدِ بْنِ بَشِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ إِنَّ الْحُوتَ الَّذِي يَحْمِلُ الْأَرْضَ أَسَرَّ فِي نَفْسِهِ أَنَّهُ إِنَّمَا يَحْمِلُ الْأَرْضَ بِقُوَّتِهِ فَأَرْسَلَ اللَّهُ تَعَالَى إِلَيْهِ حُوتاً أَصْغَرَ مِنْ شِبْرٍ وَ أَكْبَرَ مِنْ فِتْرٍ فَدَخَلَتْ فِي خَيَاشِيمِهِ فَصَعِقَ فَمَكَثَ بِذَلِكَ أَرْبَعِينَ يَوْماً ثُمَّ إِنَّ اللَّهَ عَزَّ وَ جَلَّ رَءُوفَ بِهِ وَ رَحِمَهُ وَ خَرَجَ فَإِذَا أَرَادَ اللَّهُ جَلَّ وَ عَزَّ بِأَرْضٍ زَلْزَلَةً بَعَثَ ذَلِكَ الْحُوتَ إِلَى ذَلِكَ الْحُوتِ فَإِذَا رَآهُ اضْطَرَبَ فَتَزَلْزَلَتِ الْأَرْضُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473494\">H 14813</a> – From him, from Salih, from one of his companions, from Abdul Samad Bin Basheer, who has reported the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said that: ‘The whale which is carrying the earth secretly said to itself that it is carrying the earth by its own strength. So Allah<sup>azwj</sup> the High Sent to it a fish smaller than a palm’s length, and larger than a finger. So it entered in its gills and shocked it. It remained like that for forty days. Then Allah<sup>azwj</sup> Raised it and was Merciful to it, and Took it out. So whenever Allah<sup>azwj</sup> Intends the earth to be in a quake, He<sup>azwj</sup> Sends that (small) fish to that (big) fish. So when it sees it, it becomes restless, so the earth gets engulfed by the earthquake’."
          ],
          "en.sarwar": [
            "366. From him, from Salih, from one of his companions, from Abdul Samad Bin Basheer, who has reported the following: Abu Abdullah (a.s.) has said that: ‘The whale which is carrying the earth secretly said to itself that it is carrying the earth by its own strength. So Allah (azwj) the High Sent to it a fish smaller than a palm’s length, and larger than a finger. So it entered in its gills and shocked it. It remained like that for forty days. Then Allah (azwj) Raised it and was Merciful to it, and Took it out. So whenever Allah (azwj) Intends the earth to be in a quake, He (azwj) Sends that (small) fish to that (big) fish. So when it sees it, it becomes restless, so the earth gets engulfed by the earthquake’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح على الظاهر</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 240)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15051,
        "local_index": 54,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:54",
        "text": [
          "14814- عَنْهُ عَنْ صَالِحٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ عَنْ تَمِيمِ بْنِ حَاتِمٍ قَالَ كُنَّا مَعَ أَمِيرِ الْمُؤْمِنِينَ (عليه السلام) فَاضْطَرَبَتِ الْأَرْضُ فَوَحَاهَا بِيَدِهِ ثُمَّ قَالَ لَهَا اسْكُنِي مَا لَكِ ثُمَّ الْتَفَتَ إِلَيْنَا وَ قَالَ أَمَا إِنَّهَا لَوْ كَانَتِ الَّتِي قَالَ اللَّهُ عَزَّ وَ جَلَّ لَأَجَابَتْنِي وَ لَكِنْ لَيْسَتْ بِتِلْكَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473495\">H 14814</a> – From him, from Salih, from Muhammad Bin Sinan, from Ibn Muskaan, from Abu Bakr Al-Hazramy, from Tameem Bin Haatim who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-w\">W</span>e were with Amir-ul</span>-Momineen<sup>asws</sup>, so the earth became restless (tremor). So he<sup>asws</sup> gestured with his<sup>asws</sup> hand, then said to it: ‘Calm down! What is the matter with you?’ Then he<sup>asws</sup> turned towards us and said: ‘But, had it been that (quake<a id=\"_ftnref26\"></a><sup>[26]</sup>) which Allah<sup>azwj</sup> Mighty and Majestic has Said, it would have answered me<sup>asws</sup>, but it is not that one’."
          ],
          "en.sarwar": [
            "367. From him, from Salih, from Muhammad Bin Sinan, from Ibn Muskaan, from Abu Bakr Al-Hazramy, from Tameem Bin Haatim who said: We were with Amir-ul-Momineen (a.s.), so the earth became restless (tremor). So he (a.s.) gestured with his (a.s.) hand, then said to it: ‘Calm down! What is the matter with you?’ Then he (a.s.) turned towards us and said: ‘But, had it been that (quake) which Allah (azwj) Mighty and Majestic has Said, it would have answered me (a.s.), but it is not that one’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 240)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15052,
        "local_index": 55,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:55",
        "text": [
          "14815- أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ أَبِي الْيَسَعِ عَنْ أَبِي شِبْلٍ قَالَ صَفْوَانُ وَ لَا أَعْلَمُ إِلَّا أَنِّي قَدْ سَمِعْتُ مِنْ أَبِي شِبْلٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) مَنْ أَحَبَّكُمْ عَلَى مَا أَنْتُمْ عَلَيْهِ دَخَلَ الْجَنَّةَ وَ إِنْ لَمْ يَقُلْ كَمَا تَقُولُونَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473496\">H 14815</a> – Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbar, from Safwaan Bin Yahya, from Abu Al-Yas’a, from Abu Shabl, ‘Safwaan said, ‘And I do not know except that I have heard from Abu Shabl, that:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘The one loves you due to what you are upon (Al-Wilayah), would enter the Paradise even if he never said anything similar to what you are saying’."
          ],
          "en.sarwar": [
            "368. Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbar, from Safwaan Bin Yahya, from Abu Al-Yas’a, from Abu Shabl, ‘Safwaan said, ‘And I do not know except that I have heard from Abu Shabl, that: Abu Abdullah (a.s.) said: ‘The one loves you due to what you are upon (Al-Wilayah), would enter the Paradise even if he never said anything similar to what you are saying’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 243)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15053,
        "local_index": 56,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:56",
        "refs": {
          "Quran": [
            "/books/quran:13:11"
          ]
        },
        "text": [
          "14816- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ مُحَمَّدِ بْنِ النُّعْمَانِ أَبِي جَعْفَرٍ الْأَحْوَلِ عَنْ سَلَّامِ بْنِ الْمُسْتَنِيرِ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ قَالَ إِنَّ أَمِيرَ الْمُؤْمِنِينَ (عليه السلام) لَمَّا انْقَضَتِ الْقِصَّةُ فِيمَا بَيْنَهُ وَ بَيْنَ طَلْحَةَ وَ الزُّبَيْرِ وَ عَائِشَةَ بِالْبَصْرَةِ صَعِدَ الْمِنْبَرَ فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ وَ صَلَّى عَلَى رَسُولِ اللَّهِ (عليه السلام) ثُمَّ قَالَ يَا أَيُّهَا النَّاسُ إِنَّ الدُّنْيَا حُلْوَةٌ خَضِرَةٌ تَفْتِنُ النَّاسَ بِالشَّهَوَاتِ وَ تُزَيِّنُ لَهُمْ بِعَاجِلِهَا ",
          "وَ ايْمُ اللَّهِ إِنَّهَا لَتَغُرُّ مَنْ أَمَّلَهَا وَ تُخْلِفُ مَنْ رَجَاهَا وَ سَتُورِثُ أَقْوَاماً النَّدَامَةَ وَ الْحَسْرَةَ بِإِقْبَالِهِمْ عَلَيْهَا وَ تَنَافُسِهِمْ فِيهَا وَ حَسَدِهِمْ وَ بَغْيِهِمْ عَلَى أَهْلِ الدِّينِ وَ الْفَضْلِ فِيهَا ظُلْماً وَ عُدْوَاناً وَ بَغْياً وَ أَشَراً وَ بَطَراً وَ بِاللَّهِ إِنَّهُ مَا عَاشَ قَوْمٌ قَطُّ فِي غَضَارَةٍ مِنْ كَرَامَةِ نِعَمِ اللَّهِ فِي مَعَاشِ دُنْيَا وَ لَا دَائِمِ تَقْوَى فِي طَاعَةِ اللَّهِ وَ الشُّكْرِ لِنِعَمِهِ فَأَزَالَ ذَلِكَ عَنْهُمْ إِلَّا مِنْ بَعْدِ تَغْيِيرٍ مِنْ أَنْفُسِهِمْ وَ تَحْوِيلٍ عَنْ طَاعَةِ اللَّهِ وَ الْحَادِثِ مِنْ ذُنُوبِهِمْ وَ قِلَّةِ مُحَافَظَةٍ وَ تَرْكِ مُرَاقَبَةِ اللَّهِ جَلَّ وَ عَزَّ وَ تَهَاوُنٍ بِشُكْرِ نِعْمَةِ اللَّهِ لِأَنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ فِي مُحْكَمِ كِتَابِهِ إِنَّ اللَّهَ لا يُغَيِّرُ ما بِقَوْمٍ حَتَّى يُغَيِّرُوا ما بِأَنْفُسِهِمْ وَ إِذا أَرادَ اللَّهُ بِقَوْمٍ سُوْءاً فَلا مَرَدَّ لَهُ وَ ما لَهُمْ مِنْ دُونِهِ مِنْ والٍ",
          "وَ لَوْ أَنَّ أَهْلَ الْمَعَاصِي وَ كَسَبَةَ الذُّنُوبِ إِذَا هُمْ حَذِرُوا زَوَالَ نِعَمِ اللَّهِ وَ حُلُولَ نَقِمَتِهِ وَ تَحْوِيلَ عَافِيَتِهِ أَيْقَنُوا أَنَّ ذَلِكَ مِنَ اللَّهِ جَلَّ ذِكْرُهُ بِمَا كَسَبَتْ أَيْدِيهِمْ فَأَقْلَعُوا وَ تَابُوا وَ فَزِعُوا إِلَى اللَّهِ جَلَّ ذِكْرُهُ بِصِدْقٍ مِنْ نِيَّاتِهِمْ وَ إِقْرَارٍ مِنْهُمْ بِذُنُوبِهِمْ وَ إِسَاءَتِهِمْ لَصَفَحَ لَهُمْ عَنْ كُلِّ ذَنْبٍ وَ إِذاً لَأَقَالَهُمْ كُلَّ عَثْرَةٍ وَ لَرَدَّ عَلَيْهِمْ كُلَّ كَرَامَةِ نِعْمَةٍ ثُمَّ أَعَادَ لَهُمْ مِنْ صَلَاحِ أَمْرِهِمْ وَ مِمَّا كَانَ أَنْعَمَ بِهِ عَلَيْهِمْ كُلَّ مَا زَالَ عَنْهُمْ وَ أُفْسِدَ عَلَيْهِمْ ",
          "فَاتَّقُوا اللَّهَ أَيُّهَا النَّاسُ حَقَّ تُقَاتِهِ وَ اسْتَشْعِرُوا خَوْفَ اللَّهِ جَلَّ ذِكْرُهُ وَ أَخْلِصُوا الْيَقِينَ وَ تُوبُوا إِلَيْهِ مِنْ قَبِيحِ مَا اسْتَفَزَّكُمُ الشَّيْطَانُ مِنْ قِتَالِ وَلِيِّ الْأَمْرِ وَ أَهْلِ الْعِلْمِ بَعْدَ رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ مَا تَعَاوَنْتُمْ عَلَيْهِ مِنْ تَفْرِيقِ الْجَمَاعَةِ وَ تَشَتُّتِ الْأَمْرِ وَ فَسَادِ صَلَاحِ ذَاتِ الْبَيْنِ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقْبَلُ التَّوْبَةَ وَ يَعْفُو عَنِ السَّيِّئَاتِ وَ يَعْلَمُ مَا تَفْعَلُونَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473497\">H 14816</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Hassan Bin Mahboub, from Muhammad Bin Al-No’man Abu Ja’far Al-Ahowl, from salaam Bin Al-Mustaneer, who has said the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> having said that: ‘Amir-ul-Momineen<sup>asws</sup>, when the story in between him<sup>asws</sup> and Talha, and Al-Zubeyr, and Ayesha concluded at Al-Basra, he<sup>asws</sup> ascended the Pulpit. So he<sup>asws</sup> Praised Allah<sup>azwj</sup> and Extolled Him<sup>azwj</sup>, and sent greetings upon the Rasool Allah<sup>saww</sup>, then said: ‘O you people! The world is sweet and green, enchanting the people by the desires, and adorning them with its current affairs.",
            "And I<sup>asws</sup> swear by Allah<sup>azwj</sup> that it deceives the one who hopes in it, and breaks the one who wishes for it, and there are people who would be inheriting the regret and the sorrow by advancing towards it and competing with regards to it, by their jealousies and their rebellion against the people of the religion. ",
            "And they achieve preferences in it by injustice, and animosity, and rebellion, and ungratefulness. By Allah<sup>azwj</sup>! No people lived in the honour and dignity of the Bounties of Allah<sup>azwj</sup> in the life of the world, nor everlasting piety in obedience to Allah<sup>azwj</sup> and the appreciation for His<sup>azwj</sup> Bounties, and all that declined from them except after they had changed themselves, and diverted from the obedience to Allah<sup>azwj</sup>, and committed their sins were hardly vigilant, and ignored the Surveillance of Allah<sup>azwj</sup> Majestic and Mighty, and being complacent of appreciation for the Bounties of Allah<sup>azwj</sup>, because Allah<sup>azwj</sup> Mighty and Majestic is Saying in the Decisive (Verses) of His<sup>azwj</sup> Book that: <span class=\"ibTxt\">“<a href=\"/#/books/quran:13#h11\">[13:11]</a> surely Allah does not change the condition of a people until they change their own condition; and when Allah intends evil to a people, there is no averting it, and besides Him they have no protector”</span>. ",
            "And had the people of the disobedience, and the accumulators of the sins been cautious of the decline of the Bounties of Allah<sup>azwj</sup> (for them) and their replacement by His<sup>azwj</sup> Anger and the changing of their health, been convinced that it is from Allah<sup>azwj</sup> for what their own hands have accumulated, they would have changed, and repented, and panicked to Allah<sup>azwj</sup> by the sincerity of their intentions, and acknowledgement of their sins and their offences, He<sup>azwj</sup> would Forgive all the sins and Overlook all the faults, and Return to them all the Prestigious Bounties. Then He<sup>azwj</sup> would Correct their affairs, and from all that He<sup>azwj</sup> had Favoured them by which had declined from them and had been spoilt. ",
            "So fear Allah<sup>azwj</sup>, O you people, with the rightful fear, and feel the fear of Allah<sup>azwj</sup> and be convinced with sincerity, and repent to Him<sup>azwj</sup> from the ugliness of what the Satan<sup>la</sup> has enticed you with of the fighting against ‘وَلِيِّ الْأَمْرِ وَ أَهْلِ الْعِلْمِ’ the Master<sup>asws</sup> of the Command (Wali Al-Amr) and the People<sup>asws</sup> of the Knowledge after the Rasool Allah<sup>saww</sup> and do not co-operate with those who create differences in the group, and disperse the affairs, and spoil the relationships. Allah<sup>azwj</sup> Accept the repentance and Excuses the sins, and He<sup>azwj</sup> Knows what you are doing’."
          ],
          "en.sarwar": [
            "369. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Hassan Bin Mahboub, from Muhammad Bin Al-No’man Abu Ja’far Al-Ahowl, from salaam Bin Al-Mustaneer, who has said the following: Abu Ja’far (a.s.) having said that: ‘Amir-ul-Momineen (a.s.), when the story in between him (a.s.) and Talha, and Al-Zubeyr, and Ayesha concluded at Al-Basra, he (a.s.) ascended the Pulpit. So he (a.s.) Praised Allah (azwj) and Extolled Him (azwj), and sent greetings upon the Rasool Allah (saww), then said: ‘O you people! The world is sweet and green, enchanting the people by the desires, and adorning them with its current affairs. And I (a.s.) swear by Allah (azwj) that it deceives the one who hopes in it, and breaks the one who wishes for it, and there are people who would be inheriting the regret and the sorrow by advancing towards it and competing with regards to it, by their jealousies and their rebellion against the people of the religion. And they achieve preferences in it by injustice, and animosity, and rebellion, and ungratefulness. By Allah (azwj)! No people lived in the honour and dignity of the Bounties of Allah (azwj) in the life of the world, nor everlasting piety in obedience to Allah (azwj) and the appreciation for His (azwj) Bounties, and all that declined from them except after they had changed themselves, and diverted from the obedience to Allah (azwj), and committed their sins were hardly vigilant, and ignored the Surveillance of Allah (azwj) Majestic and Mighty, and being complacent of appreciation for the Bounties of Allah (azwj), because Allah (azwj) Mighty and Majestic is Saying in the Decisive (Verses) of His (azwj) Book that: “<a href=\"/#/books/quran:13#h11\">[13:11]</a> surely Allah does not change the condition of a people until they change their own condition; and when Allah intends evil to a people, there is no averting it, and besides Him they have no protector”. And had the people of the disobedience, and the accumulators of the sins been cautious of the decline of the Bounties of Allah (azwj) (for them) and their replacement by His (azwj) Anger and the changing of their health, been convinced that it is from Allah (azwj) for what their own hands have accumulated, they would have changed, and repented, and panicked to Allah (azwj) by the sincerity of their intentions, and acknowledgement of their sins and their offences, He (azwj) would Forgive all the sins and Overlook all the faults, and Return to them all the Prestigious Bounties. Then He (azwj) would Correct their affairs, and from all that He (azwj) had Favoured them by which had declined from them and had been spoilt. So fear Allah (azwj), O you people, with the rightful fear, and feel the fear of Allah (azwj) and be convinced with sincerity, and repent to Him (azwj) from the ugliness of what the Satan (la) has enticed you with of the fighting against ‘وَلِيِّ الْأَمْرِ وَ أَهْلِ الْعِلْمِ’ the Master (a.s.) of the Command (Wali Al-Amr) and the People (a.s.) of the Knowledge after the Rasool Allah (saww) and do not co-operate with those who create differences in the group, and disperse the affairs, and spoil the relationships. Allah (azwj) Accept the repentance and Excuses the sins, and He (azwj) Knows what you are doing’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 243)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15054,
        "local_index": 57,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:57",
        "text": [
          "14817- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ عُثْمَانَ قَالَ حَدَّثَنِي أَبُو عَبْدِ اللَّهِ الْمَدَائِنِيُّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ خَلَقَ نَجْماً فِي الْفَلَكِ السَّابِعِ فَخَلَقَهُ مِنْ مَاءٍ بَارِدٍ وَ سَائِرَ النُّجُومِ السِّتَّةِ الْجَارِيَاتِ مِنْ مَاءٍ حَارٍّ وَ هُوَ نَجْمُ الْأَنْبِيَاءِ وَ الْأَوْصِيَاءِ وَ هُوَ نَجْمُ أَمِيرِ الْمُؤْمِنِينَ (عليه السلام) يَأْمُرُ بِالْخُرُوجِ مِنَ الدُّنْيَا وَ الزُّهْدِ فِيهَا وَ يَأْمُرُ بِافْتِرَاشِ التُّرَابِ وَ تَوَسُّدِ اللَّبِنِ وَ لِبَاسِ الْخَشِنِ وَ أَكْلِ الْجَشِبِ وَ مَا خَلَقَ اللَّهُ نَجْماً أَقْرَبَ إِلَى اللَّهِ تَعَالَى مِنْهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473498\">H 14817</a> – A number of our companions, from Sahl Bin Ziyad, from Al-Hassan Bin Ali Bin Usman who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah Al-Mada’iny</span> narrated from Abu Abdullah<sup>asws</sup> having said that: ‘Allah<sup>azwj</sup> Created a star in the seventh orbit. So he<sup>azwj</sup> Created it from cold water and the rest of the six stars flowed from hot water, and it is the star of the Prophets<sup>as</sup>, and the successors<sup>asws</sup> and it is the star of Amir-ul-Momineen<sup>asws</sup> commanding the exit from the world, and the ascetism in it, and commanding for the dust to be the mattress, and bricks to rest upon (for a pillow), and coarse clothing, and eating the tasteless (food), and Allah<sup>azwj</sup> has not Created a star more closer to Allah<sup>azwj</sup> the High, than it’."
          ],
          "en.sarwar": [
            "370. A number of our companions, from Sahl Bin Ziyad, from Al-Hassan Bin Ali Bin Usman who said: Abu Abdullah Al-Mada’iny narrated from Abu Abdullah (a.s.) having said that: ‘Allah (azwj) Created a star in the seventh orbit. So he (azwj) Created it from cold water and the rest of the six stars flowed from hot water, and it is the star of the Prophets (as), and the successors (a.s.) and it is the star of Amir-ul-Momineen (a.s.) commanding the exit from the world, and the ascetism in it, and commanding for the dust to be the mattress, and bricks to rest upon (for a pillow), and coarse clothing, and eating the tasteless (food), and Allah (azwj) has not Created a star more closer to Allah (azwj) the High, than it’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 244)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15055,
        "local_index": 58,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:58",
        "text": [
          "14818- الْحُسَيْنُ بْنُ أَحْمَدَ بْنِ هِلَالٍ عَنْ يَاسِرٍ الْخَادِمِ قَالَ قُلْتُ لِأَبِي الْحَسَنِ الرِّضَا (عليه السلام) رَأَيْتُ فِي النَّوْمِ كَأَنَّ قَفَصاً فِيهِ سَبْعَ عَشْرَةَ قَارُورَةً إِذْ وَقَعَ الْقَفَصُ فَتَكَسَّرَتِ الْقَوَارِيرُ فَقَالَ إِنْ صَدَقَتْ رُؤْيَاكَ يَخْرُجُ رَجُلٌ مِنْ أَهْلِ بَيْتِي يَمْلِكُ سَبْعَةَ عَشَرَ يَوْماً ثُمَّ يَمُوتُ فَخَرَجَ مُحَمَّدُ بْنُ إِبْرَاهِيمَ بِالْكُوفَةِ مَعَ أَبِي السَّرَايَا فَمَكَثَ سَبْعَةَ عَشَرَ يَوْماً ثُمَّ مَاتَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473499\">H 14818</a> – Al-Husayn Bin Ahmad Bin Hilal, from Yaser Al-Khadam who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> said to Abu Al-Hassan</span> Al-Reza<sup>asws</sup>, ‘I saw (a dream) during the sleep, as if there was a cage in which were seventeen bottles. There was an impact upon the cage and the bottles broke’. So he<sup>asws</sup> said: ‘If your dream is true, a man from my<sup>asws</sup> Household would come out, govern for seventeen days, then die’. So Muhammad Bin Ibrahim came out at Al-Kufa along with Abu Al-Saraaya. So he remained for seventeen days, then died’."
          ],
          "en.sarwar": [
            "371. Al-Husayn Bin Ahmad Bin Hilal, from Yaser Al-Khadam who said: I said to Abu Al-Hassan Al-Ridha (a.s.), ‘I saw (a dream) during the sleep, as if there was a cage in which were seventeen bottles. There was an impact upon the cage and the bottles broke’. So he (a.s.) said: ‘If your dream is true, a man from my (a.s.) Household would come out, govern for seventeen days, then die’. So Muhammad Bin Ibrahim came out at Al-Kufa along with Abu Al-Saraaya. So he remained for seventeen days, then died’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 245)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15056,
        "local_index": 59,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:59",
        "text": [
          "14819- عَنْهُ عَنْ أَحْمَدَ بْنِ هِلَالٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ قَالَ قُلْتُ لِأَبِي الْحَسَنِ الرِّضَا (عليه السلام) فِي أَيَّامِ هَارُونَ إِنَّكَ قَدْ شَهَرْتَ نَفْسَكَ بِهَذَا الْأَمْرِ وَ جَلَسْتَ مَجْلِسَ أَبِيكَ وَ سَيْفُ هَارُونَ يُقَطِّرُ الدَّمَ فَقَالَ جَرَّأَنِي عَلَى هَذَا مَا قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) إِنْ أَخَذَ أَبُو جَهْلٍ مِنْ رَأْسِي شَعْرَةً فَاشْهَدُوا أَنِّي لَسْتُ بِنَبِيٍّ وَ أَنَا أَقُولُ لَكُمْ إِنْ أَخَذَ هَارُونُ مِنْ رَأْسِي شَعْرَةً فَاشْهَدُوا أَنِّي لَسْتُ بِإِمَامٍ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473500\">H 14819</a> – From him, from Ahmad Bin Hilal, from Muhammad Bin Sinan who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> said to Abu Al-Hassan</span> Al-Reza<sup>asws</sup>, during the days of Haroun, ‘You<sup>asws</sup> have famed yourself<sup>asws</sup> by this Command, and are sitting in the seat of your<sup>asws</sup> father, whilst the sword of Haroun drips blood’. So he<sup>asws</sup> said: ‘What encouraged me<sup>asws</sup> was what the Rasool Allah<sup>saww</sup> said; ‘If Abu Jahl<sup>la</sup> can take a single hair from my<sup>saww</sup> head (to hurt me<sup>saww</sup>), so testify that I<sup>saww</sup> am not a Prophet<sup>saww</sup>, and I<sup>asws</sup> say to you that if Haroun can take a single hair from my<sup>asws</sup> head, so testify that I<sup>asws</sup> am not an Imam<sup>asws</sup>’. "
          ],
          "en.sarwar": [
            "372. From him, from Ahmad Bin Hilal, from Muhammad Bin Sinan who said: I said to Abu Al-Hassan Al-Ridha (a.s.), during the days of Haroun, ‘You (a.s.) have famed yourself (a.s.) by this Command, and are sitting in the seat of your (a.s.) father, whilst the sword of Haroun drips blood’. So he (a.s.) said: ‘What encouraged me (a.s.) was what the Rasool Allah (saww) said; ‘If Abu Jahl (la) can take a single hair from my (saww) head (to hurt me (saww)), so testify that I (saww) am not a Prophet (saww), and I (a.s.) say to you that if Haroun can take a single hair from my (a.s.) head, so testify that I (a.s.) am not an Imam (a.s.)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل بل ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 249)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15057,
        "local_index": 60,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:60",
        "text": [
          "14820- عَنْهُ عَنْ أَحْمَدَ عَنْ زُرْعَةَ عَنْ سَمَاعَةَ قَالَ تَعَرَّضَ رَجُلٌ مِنْ وُلْدِ عُمَرَ بْنِ الْخَطَّابِ بِجَارِيَةِ رَجُلٍ عَقِيلِيٍّ فَقَالَتْ لَهُ إِنَّ هَذَا الْعُمَرِيَّ قَدْ آذَانِي فَقَالَ لَهَا عِدِيهِ وَ أَدْخِلِيهِ الدِّهْلِيزَ فَأَدْخَلَتْهُ فَشَدَّ عَلَيْهِ فَقَتَلَهُ وَ أَلْقَاهُ فِي الطَّرِيقِ فَاجْتَمَعَ الْبَكْرِيُّونَ وَ الْعُمَرِيُّونَ وَ الْعُثْمَانِيُّونَ وَ قَالُوا مَا لِصَاحِبِنَا كُفْوٌ لَنْ نَقْتُلَ بِهِ إِلَّا جَعْفَرَ بْنَ مُحَمَّدٍ وَ مَا قَتَلَ صَاحِبَنَا غَيْرُهُ وَ كَانَ أَبُو عَبْدِ اللَّهِ (عليه السلام) قَدْ مَضَى نَحْوَ قُبَا فَلَقِيتُهُ بِمَا اجْتَمَعَ الْقَوْمُ عَلَيْهِ فَقَالَ دَعْهُمْ قَالَ فَلَمَّا جَاءَ وَ رَأَوْهُ وَثَبُوا عَلَيْهِ وَ قَالُوا مَا قَتَلَ صَاحِبَنَا أَحَدٌ غَيْرُكَ وَ مَا نَقْتُلُ بِهِ أَحَداً غَيْرَكَ فَقَالَ لِيُكَلِّمْنِي مِنْكُمْ جَمَاعَةٌ فَاعْتَزَلَ قَوْمٌ مِنْهُمْ فَأَخَذَ بِأَيْدِيهِمْ فَأَدْخَلَهُمُ الْمَسْجِدَ فَخَرَجُوا وَ هُمْ يَقُولُونَ شَيْخُنَا أَبُو عَبْدِ اللَّهِ جَعْفَرُ بْنُ مُحَمَّدٍ مَعَاذَ اللَّهِ أَنْ يَكُونَ مِثْلُهُ يَفْعَلُ هَذَا وَ لَا يَأْمُرُ بِهِ انْصَرِفُوا ",
          "قَالَ فَمَضَيْتُ مَعَهُ فَقُلْتُ جُعِلْتُ فِدَاكَ مَا كَانَ أَقْرَبَ رِضَاهُمْ مِنْ سَخَطِهِمْ قَالَ نَعَمْ دَعَوْتُهُمْ فَقُلْتُ أَمْسِكُوا وَ إِلَّا أَخْرَجْتُ الصَّحِيفَةَ فَقُلْتُ وَ مَا هَذِهِ الصَّحِيفَةُ جَعَلَنِيَ اللَّهُ فِدَاكَ فَقَالَ إِنَّ أُمَّ الْخَطَّابِ كَانَتْ أَمَةً لِلزُّبَيْرِ بْنِ عَبْدِ الْمُطَّلِبِ فَسَطَّرَ بِهَا نُفَيْلٌ فَأَحْبَلَهَا فَطَلَبَهُ الزُّبَيْرُ فَخَرَجَ هَارِباً إِلَى الطَّائِفِ فَخَرَجَ الزُّبَيْرُ خَلْفَهُ فَبَصُرَتْ بِهِ ثَقِيفٌ فَقَالُوا يَا أَبَا عَبْدِ اللَّهِ مَا تَعْمَلُ هَاهُنَا قَالَ جَارِيَتِي سَطَّرَ بِهَا نُفَيْلُكُمْ ",
          "فَهَرَبَ مِنْهُ إِلَى الشَّامِ وَ خَرَجَ الزُّبَيْرُ فِي تِجَارَةٍ لَهُ إِلَى الشَّامِ فَدَخَلَ عَلَى مَلِكِ الدُّومَةِ فَقَالَ لَهُ يَا أَبَا عَبْدِ اللَّهِ لِي إِلَيْكَ حَاجَةٌ قَالَ وَ مَا حَاجَتُكَ أَيُّهَا الْمَلِكُ فَقَالَ رَجُلٌ مِنْ أَهْلِكَ قَدْ أَخَذْتَ وَلَدَهُ فَأُحِبُّ أَنْ تَرُدَّهُ عَلَيْهِ قَالَ لِيَظْهَرْ لِي حَتَّى أَعْرِفَهُ فَلَمَّا أَنْ كَانَ مِنَ الْغَدِ دَخَلَ عَلَى الْمَلِكِ فَلَمَّا رَآهُ الْمَلِكُ ضَحِكَ فَقَالَ مَا يُضْحِكُكَ أَيُّهَا الْمَلِكُ قَالَ مَا أَظُنُّ هَذَا الرَّجُلَ وَلَدَتْهُ عَرَبِيَّةٌ لَمَّا رَآكَ قَدْ دَخَلْتَ لَمْ يَمْلِكِ اسْتَهُ أَنْ جَعَلَ يَضْرِطُ فَقَالَ أَيُّهَا الْمَلِكُ إِذَا صِرْتُ إِلَى مَكَّةَ قَضَيْتُ حَاجَتَكَ",
          "فَلَمَّا قَدِمَ الزُّبَيْرُ تَحَمَّلَ عَلَيْهِ بِبُطُونِ قُرَيْشٍ كُلِّهَا أَنْ يَدْفَعَ إِلَيْهِ ابْنَهُ فَأَبَى ثُمَّ تَحَمَّلَ عَلَيْهِ بِعَبْدِ الْمُطَّلِبِ فَقَالَ مَا بَيْنِي وَ بَيْنَهُ عَمَلٌ أَ مَا عَلِمْتُمْ مَا فَعَلَ فِي ابْنِي فُلَانٍ وَ لَكِنِ امْضُوا أَنْتُمْ إِلَيْهِ فَقَصَدُوهُ وَ كَلَّمُوهُ فَقَالَ لَهُمُ الزُّبَيْرُ إِنَّ الشَّيْطَانَ لَهُ دَوْلَةٌ وَ إِنَّ ابْنَ هَذَا ابْنُ الشَّيْطَانِ وَ لَسْتُ آمَنُ أَنْ يَتَرَأَّسَ عَلَيْنَا وَ لَكِنْ أَدْخِلُوهُ مِنْ بَابِ الْمَسْجِدِ عَلَيَّ عَلَى أَنْ أُحْمِيَ لَهُ حَدِيدَةً وَ أَخُطَّ فِي وَجْهِهِ خُطُوطاً وَ أَكْتُبَ عَلَيْهِ وَ عَلَى ابْنِهِ أَلَّا يَتَصَدَّرَ فِي مَجْلِسٍ وَ لَا يَتَأَمَّرَ عَلَى أَوْلَادِنَا وَ لَا يَضْرِبَ مَعَنَا بِسَهْمٍ قَالَ فَفَعَلُوا وَ خَطَّ وَجْهَهُ بِالْحَدِيدَةِ وَ كَتَبَ عَلَيْهِ الْكِتَابَ وَ ذَلِكَ الْكِتَابُ عِنْدَنَا فَقُلْتُ لَهُمْ إِنْ أَمْسَكْتُمْ وَ إِلَّا أَخْرَجْتُ الْكِتَابَ فَفِيهِ فَضِيحَتُكُمْ فَأَمْسَكُوا",
          "وَ تُوُفِّيَ مَوْلًى لِرَسُولِ اللَّهِ (صلى الله عليه وآله) لَمْ يُخَلِّفْ وَارِثاً فَخَاصَمَ فِيهِ وُلْدُ الْعَبَّاسِ أَبَا عَبْدِ اللَّهِ (عليه السلام) وَ كَانَ هِشَامُ بْنُ عَبْدِ الْمَلِكِ قَدْ حَجَّ فِي تِلْكَ السَّنَةِ فَجَلَسَ لَهُمْ فَقَالَ دَاوُدُ بْنُ عَلِيٍّ الْوَلَاءُ لَنَا وَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) بَلِ الْوَلَاءُ لِي فَقَالَ دَاوُدُ بْنُ عَلِيٍّ إِنَّ أَبَاكَ قَاتَلَ مُعَاوِيَةَ فَقَالَ إِنْ كَانَ أَبِي قَاتَلَ مُعَاوِيَةَ فَقَدْ كَانَ حَظُّ أَبِيكَ فِيهِ الْأَوْفَرَ ثُمَّ فَرَّ بِخِيَانَتِهِ وَ قَالَ وَ اللَّهِ لَأُطَوِّقَنَّكَ غَداً طَوْقَ الْحَمَامَةِ فَقَالَ لَهُ دَاوُدُ بْنُ عَلِيٍّ كَلَامُكَ هَذَا أَهْوَنُ عَلَيَّ مِنْ بَعْرَةٍ فِي وَادِي الْأَزْرَقِ فَقَالَ أَمَا إِنَّهُ وَادٍ لَيْسَ لَكَ وَ لَا لِأَبِيكَ فِيهِ حَقٌّ قَالَ فَقَالَ هِشَامٌ إِذَا كَانَ غَداً جَلَسْتُ لَكُمْ ",
          "فَلَمَّا أَنْ كَانَ مِنَ الْغَدِ خَرَجَ أَبُو عَبْدِ اللَّهِ (عليه السلام) وَ مَعَهُ كِتَابٌ فِي كِرْبَاسَةٍ وَ جَلَسَ لَهُمْ هِشَامٌ فَوَضَعَ أَبُو عَبْدِ اللَّهِ (عليه السلام) الْكِتَابَ بَيْنَ يَدَيْهِ فَلَمَّا أَنْ قَرَأَهُ قَالَ ادْعُوا لِي جَنْدَلَ الْخُزَاعِيَّ وَ عُكَّاشَةَ الضَّمْرِيَّ وَ كَانَا شَيْخَيْنِ قَدْ أَدْرَكَا الْجَاهِلِيَّةَ فَرَمَى بِالْكِتَابِ إِلَيْهِمَا فَقَالَ تَعْرِفَانِ هَذِهِ الْخُطُوطَ قَالَا نَعَمْ هَذَا خَطُّ الْعَاصِ بْنِ أُمَيَّةَ وَ هَذَا خَطُّ فُلَانٍ وَ فُلَانٍ لِفُلَانٍ مِنْ قُرَيْشٍ وَ هَذَا خَطُّ حَرْبِ بْنِ أُمَيَّةَ فَقَالَ هِشَامٌ يَا أَبَا عَبْدِ اللَّهِ أَرَى خُطُوطَ أَجْدَادِي عِنْدَكُمْ فَقَالَ نَعَمْ قَالَ فَقَدْ قَضَيْتُ بِالْوَلَاءِ لَكَ قَالَ فَخَرَجَ وَ هُوَ يَقُولُ : إِنْ عَادَتِ الْعَقْرَبُ عُدْنَا لَهَا وَ كَانَتِ النَّعْلُ لَهَا حَاضِرَهْقَالَ ",
          "فَقُلْتُ مَا هَذَا الْكِتَابُ جُعِلْتُ فِدَاكَ قَالَ فَإِنَّ نُتَيْلَةَ كَانَتْ أَمَةً لِأُمِّ الزُّبَيْرِ وَ لِأَبِي طَالِبٍ وَ عَبْدِ اللَّهِ فَأَخَذَهَا عَبْدُ الْمُطَّلِبِ فَأَوْلَدَهَا فُلَاناً فَقَالَ لَهُ الزُّبَيْرُ هَذِهِ الْجَارِيَةُ وَرِثْنَاهَا مِنْ أُمِّنَا وَ ابْنُكَ هَذَا عَبْدٌ لَنَا فَتَحَمَّلَ عَلَيْهِ بِبُطُونِ قُرَيْشٍ قَالَ فَقَالَ قَدْ أَجَبْتُكَ عَلَى خَلَّةٍ عَلَى أَنْ لَا يَتَصَدَّرَ ابْنُكَ هَذَا فِي مَجْلِسٍ وَ لَا يَضْرِبَ مَعَنَا بِسَهْمٍ فَكَتَبَ عَلَيْهِ كِتَاباً وَ أَشْهَدَ عَلَيْهِ فَهُوَ هَذَا الْكِتَابُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473501\">H 14820</a> – From him, from Ahmad, from Zara’at, from Sama’at who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span> man from the children</span> of Umar Bin Al-Khattaab exposed (molested) a maid of an Uqeyli man. So she said to him, It was this Umary who has hurt me’. So he said to her, ‘Let him come into the corridor’. So she let him in, and he pounced hard and killed him, and threw his body onto the street’ So the Bakries, and Umaries, and Usmaanies gathered and said, ‘There is no match for our companion. We will not avenge his killing except by Ja’far Bin Muhammad, and we will not kill for our companion except him<sup>asws</sup>. And Abu Abdullah<sup>asws</sup> had gone near the Quba. So I met him<sup>asws</sup> and told of the gathering of the people against him<sup>asws</sup>. So he<sup>asws</sup> said: ‘Leave them’. So when they came and saw him<sup>asws</sup>, they were aggressive against him<sup>asws</sup> and said, ‘No one killed our companion apart from you<sup>asws</sup>, and we will not kill anyone apart from you<sup>asws</sup>’. So he<sup>asws</sup> said; ‘Let a group from you speak to me<sup>asws</sup>’. So a group separated itself from them, grabbed him<sup>asws</sup> by the hand and entered with him<sup>asws</sup> into the Masjid. So when they came out, they were saying, ‘Our Sheikh is Abu Abdullah Ja’far Bin Muhammad<sup>asws</sup>. We seek Refuge with Allah<sup>azwj</sup> that there was someone like him<sup>asws</sup> and for having done this, or ordered for it’. They dispersed. ",
            "When they had finished with him<sup>asws</sup>, I said, ‘May I be sacrificed for you<sup>asws</sup>, how close was their happiness from their anger’. He<sup>asws</sup> said: ‘Yes. I<sup>asws</sup> called them, so I<sup>asws</sup> said: ‘Let me<sup>asws</sup> go or else I<sup>asws</sup> will bring out the Parchment!’ So I said, ‘And what is this Parchment, may I be sacrificed for you<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘The mother of Al-Khattaab was a slave girl of Al-Zubeyr Bin Abdul Muttalib. Nufeyl seduced her and impregnated her. So Zubeyr was looking for him, and he fled to Al-Taef. Zubeyr went out behind him. Saqeef saw him and said, ‘O Abu Abdullah, what are you doing over here?’ My maid was seduced by Nufeyl’. ",
            "So he ran away from it to Syria and Al-Zubeyr went out on business to Syria. So he came up to the King of Dowmat who said to him, ‘O Abu Abdullah! I have a need from you’. He said, ‘And what is your need, O King’. He said, ‘A man from your people has taken his son, so I would love to return him back to his father’. He said, ‘Display him to me until I can recognise him’. So when it was the morning, he came up to the King. When the King saw him, he laughed. So he said, ‘What made you to laugh, O King?’ He said, ‘I don’t think that this man has been born to an Arab. When he saw you entering, he could not control his backside and released wind’. He said, ‘O King! When I go to Makkah, I shall fulfil your request’. ",
            "So when Al-Zubeyr went he carried him to the Qureysh who insisted that he hand over to him (Nufayl) his son (Al-Khattaab born from the slave girl of Al-Zubeyr). Then they took him to Abdul Muttalib<sup>as</sup>. So he said, ‘There is nothing between myself and him. Do you not know what he has done with regards to my son, so and so? But you all go to him, try to persuade him, and speak to him’. ",
            "Al-Zubeyr said to them, ‘The Satan<sup>la</sup> has a dominion to himself<sup>la</sup>, and that the son of this man is the son of Satan<sup>la</sup> and I do not feel safe that (tomorrow) he might become a leader over us. But, enter him in the door of the Masjid to me that I should take an iron and mark his face with it, and write down against him and his son that they shall not be part of our gatherings, and will not issue any orders on our children, nor will they cast arrows with us’. So they did that, and marked his face with the iron, and wrote against him a document, and that document is in our<sup>asws</sup> possession. So I<sup>asws</sup> told them: ‘Let me<sup>asws</sup> go or else I<sup>asws</sup> would bring out the document, for in it is your scandal’. So they let me<sup>asws</sup> go’.",
            "And a slave of the Rasool Allah<sup>saww</sup> died and did not leave any inheritors behind. So the sons of Al-Abbas and Abu Abdullah<sup>asws</sup> disputed with regards to it, and Hisham Bin Abdul Malik was performing the Pilgrimage during that year. So he sat (in Judgement) for them. So Dawood Bin Ali said, ‘The guardianship (of this legacy) is for us’, and Abu Abdullah<sup>asws</sup> said: ‘But, the guardianship (of this legacy) is for me<sup>asws</sup>’. Dawood Bin Ali said that, ‘Your<sup>asws</sup> father fought against Muawiya’. So he<sup>asws</sup> said: ‘If my<sup>asws</sup> father fought against Muawiya, so there was for your father an abundant share of it, then he fled after his embezzlement’. And he<sup>asws</sup> said; ‘By Allah<sup>azwj</sup>! Tomorrow I shall place upon your neck the collar of the pigeons’. Dawood Bin Ali said to him<sup>asws</sup>, ‘This speech of yours<sup>asws</sup> is lower to me than the droppings of a camel in the valley of Al-Arzaq’. He<sup>asws</sup> said: ‘As for the valley, there is no right either for you or your father therein’. So Hisham said, ‘When it is the morning, I shall sit (in Judgement) for you’.",
            "So when it was the next morning, Abu Abdullah<sup>asws</sup> came out, and with him<sup>asws</sup> was a document in a bag, and Hisham sat (in Judgement) for them. So Abu Abdullah<sup>asws</sup> place the document in front of him. So when he (Hisham) read it, he said, ‘Call Jandal Al-Jaza’iy and Ukkashat Al-Zamry for me’. And these were two old men who had lived through the era of ignorance. So He threw the document towards them and said, ‘Do you two recognise these handwritings?’ They said, ‘Yes. This is the handwriting of Al-A’as Bin Umayya, and this is the handwriting of so and so for so and so from Qureysh, and this is the handwriting of Harb Bin Umayya’. So Hisham said, ‘I see that you<sup>asws</sup> have in your<sup>asws</sup> possession the writings of our forefathers’. He<sup>asws</sup> said: ‘Yes’. He said, ‘So I hereby judge it to be in your<sup>asws</sup> guardianship’. He<sup>asws</sup> went out saying: ‘If the scorpion returns, the shoe would be ready to crush it’. ",
            "So I said, ‘May I be sacrificed for you<sup>asws</sup>, what is this document?’ He<sup>asws</sup> said: ‘Nutaylat was a maid for the mother of Al-Zubeyr, and for Abu Talib<sup>as</sup>, and Abdullah<sup>as</sup>. So Abdul Muttalib<sup>as</sup> took her, and she gave birth to her son so and so (Al-Abbas)’. So Al-Zubeyr said to them, ‘We have inherited this maid from our mother and your son. This is a slave for us. So he took him to the middle of Qureysh. He said, ‘I will answer you on the condition that this son of your will not participate in a gathering, nor will he cast arrows with us’. So he wrote against them a document, and testified against them. So this is that document’. "
          ],
          "en.sarwar": [
            "373. From him, from Ahmad, from Zara’at, from Sama’at who said: A man from the children of Umar Bin Al-Khattaab exposed (molested) a maid of an Uqeyli man. So she said to him, It was this Umary who has hurt me’. So he said to her, ‘Let him come into the corridor’. So she let him in, and he pounced hard and killed him, and threw his body onto the street’ So the Bakries, and Umaries, and Usmaanies gathered and said, ‘There is no match for our companion. We will not avenge his killing except by Ja’far Bin Muhammad, and we will not kill for our companion except him (a.s.). And Abu Abdullah (a.s.) had gone near the Quba. So I met him (a.s.) and told of the gathering of the people against him (a.s.). So he (a.s.) said: ‘Leave them’. So when they came and saw him (a.s.), they were aggressive against him (a.s.) and said, ‘No one killed our companion apart from you (a.s.), and we will not kill anyone apart from you (a.s.)’. So he (a.s.) said; ‘Let a group from you speak to me (a.s.)’. So a group separated itself from them, grabbed him (a.s.) by the hand and entered with him (a.s.) into the Masjid. So when they came out, they were saying, ‘Our Sheikh is Abu Abdullah Ja’far Bin Muhammad (a.s.). We seek Refuge with Allah (azwj) that there was someone like him (a.s.) and for having done this, or ordered for it’. They dispersed. When they had finished with him (a.s.), I said, ‘May I be sacrificed for you (a.s.), how close was their happiness from their anger’. He (a.s.) said: ‘Yes. I (a.s.) called them, so I (a.s.) said: ‘Let me (a.s.) go or else I (a.s.) will bring out the Parchment!’ So I said, ‘And what is this Parchment, may I be sacrificed for you (a.s.)?’ So he (a.s.) said: ‘The mother of Al-Khattaab was a slave girl of Al-Zubeyr Bin Abdul Muttalib. Nufeyl seduced her and impregnated her. So Zubeyr was looking for him, and he fled to Al-Taef. Zubeyr went out behind him. Saqeef saw him and said, ‘O Abu Abdullah, what are you doing over here?’ My maid was seduced by Nufeyl’. So he ran away from it to Syria and Al-Zubeyr went out on business to Syria. So he came up to the King of Dowmat who said to him, ‘O Abu Abdullah! I have a need from you’. He said, ‘And what is your need, O King’. He said, ‘A man from your people has taken his son, so I would love to return him back to his father’. He said, ‘Display him to me until I can recognise him’. So when it was the morning, he came up to the King. When the King saw him, he laughed. So he said, ‘What made you to laugh, O King?’ He said, ‘I don’t think that this man has been born to an Arab. When he saw you entering, he could not control his backside and released wind’. He said, ‘O King! When I go to Makkah, I shall fulfil your request’. So when Al-Zubeyr went he carried him to the Qureysh who insisted that he hand over to him (Nufayl) his son (Al-Khattaab born from the slave girl of Al-Zubeyr). Then they took him to Abdul Muttalib (as). So he said, ‘There is nothing between myself and him. Do you not know what he has done with regards to my son, so and so? But you all go to him, try to persuade him, and speak to him’. Al-Zubeyr said to them, ‘The Satan (la) has a dominion to himself (la), and that the son of this man is the son of Satan (la) and I do not feel safe that (tomorrow) he might become a leader over us. But, enter him in the door of the Masjid to me that I should take an iron and mark his face with it, and write down against him and his son that they shall not be part of our gatherings, and will not issue any orders on our children, nor will they cast arrows with us’. So they did that, and marked his face with the iron, and wrote against him a document, and that document is in our (a.s.) possession. So I (a.s.) told them: ‘Let me (a.s.) go or else I (a.s.) would bring out the document, for in it is your scandal’. So they let me (a.s.) go’. And a slave of the Rasool Allah (saww) died and did not leave any inheritors behind. So the sons of Al-Abbas and Abu Abdullah (a.s.) disputed with regards to it, and Hisham Bin Abdul Malik was performing the Pilgrimage during that year. So he sat (in Judgement) for them. So Dawood Bin Ali said, ‘The guardianship (of this legacy) is for us’, and Abu Abdullah (a.s.) said: ‘But, the guardianship (of this legacy) is for me (a.s.)’. Dawood Bin Ali said that, ‘Your (a.s.) father fought against Muawiya’. So he (a.s.) said: ‘If my (a.s.) father fought against Muawiya, so there was for your father an abundant share of it, then he fled after his embezzlement’. And he (a.s.) said; ‘By Allah (azwj)! Tomorrow I shall place upon your neck the collar of the pigeons’. Dawood Bin Ali said to him (a.s.), ‘This speech of yours (a.s.) is lower to me than the droppings of a camel in the valley of Al-Arzaq’. He (a.s.) said: ‘As for the valley, there is no right either for you or your father therein’. So Hisham said, ‘When it is the morning, I shall sit (in Judgement) for you’. So when it was the next morning, Abu Abdullah (a.s.) came out, and with him (a.s.) was a document in a bag, and Hisham sat (in Judgement) for them. So Abu Abdullah (a.s.) place the document in front of him. So when he (Hisham) read it, he said, ‘Call Jandal Al-Jaza’iy and Ukkashat Al-Zamry for me’. And these were two old men who had lived through the era of ignorance. So He threw the document towards them and said, ‘Do you two recognise these handwritings?’ They said, ‘Yes. This is the handwriting of Al-A’as Bin Umayya, and this is the handwriting of so and so for so and so from Qureysh, and this is the handwriting of Harb Bin Umayya’. So Hisham said, ‘I see that you (a.s.) have in your (a.s.) possession the writings of our forefathers’. He (a.s.) said: ‘Yes’. He said, ‘So I hereby judge it to be in your (a.s.) guardianship’. He (a.s.) went out saying: ‘If the scorpion returns, the shoe would be ready to crush it’. So I said, ‘May I be sacrificed for you (a.s.), what is this document?’ He (a.s.) said: ‘Nutaylat was a maid for the mother of Al-Zubeyr, and for Abu Talib (as), and Abdullah (as). So Abdul Muttalib (as) took her, and she gave birth to her son so and so (Al-Abbas)’. So Al-Zubeyr said to them, ‘We have inherited this maid from our mother and your son. This is a slave for us. So he took him to the middle of Qureysh. He said, ‘I will answer you on the condition that this son of your will not participate in a gathering, nor will he cast arrows with us’. So he wrote against them a document, and testified against them. So this is that document’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 250)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15058,
        "local_index": 61,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:61",
        "refs": {
          "Quran": [
            "/books/quran:56:90",
            "/books/quran:56:91"
          ]
        },
        "text": [
          "14821- الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ النَّهْدِيِّ عَنْ مُعَاوِيَةَ بْنِ حُكَيْمٍ عَنْ بَعْضِ رِجَالِهِ عَنْ عَنْبَسَةَ بْنِ بِجَادٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ أَمَّا إِنْ كانَ مِنْ أَصْحابِ الْيَمِينِ فَسَلامٌ لَكَ مِنْ أَصْحابِ الْيَمِينِ فَقَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) لِعَلِيٍّ (عليه السلام) هُمْ شِيعَتُكَ فَسَلِمَ وُلْدُكَ مِنْهُمْ أَنْ يَقْتُلُوهُمْ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473502\">H 14821</a> – Al-Husayn Bin Muhammad, from Muhammad Bin Ahmad Al-Nahdy, from Muawiya Bin Hukeym, from one of his men, from Anbasat Bin Bajaad, who has narrated:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> regarding the Statement of Allah<sup>azwj</sup>: <span class=\"ibTxt\">“<a href=\"/#/books/quran:56#h90\">[56:90]</a> And if he is of those on the right hand, <a href=\"/#/books/quran:56#h91\">[56:91]</a> Then the greeting from those on the right hand”</span>, so he<sup>asws</sup> said: ‘The Rasool Allah<sup>saww</sup> said to Ali<sup>asws</sup>: ‘These are your<sup>asws</sup> Shites from whom your<sup>asws</sup> children would be safe from being killed’."
          ],
          "en.sarwar": [
            "374. Al-Husayn Bin Muhammad, from Muhammad Bin Ahmad Al-Nahdy, from Muawiya Bin Hukeym, from one of his men, from Anbasat Bin Bajaad, who has narrated: Abu Abdullah (a.s.) regarding the Statement of Allah (azwj): “<a href=\"/#/books/quran:56#h90\">[56:90]</a> And if he is of those on the right hand, <a href=\"/#/books/quran:56#h91\">[56:91]</a> Then the greeting from those on the right hand”, so he (a.s.) said: ‘The Rasool Allah (saww) said to Ali (a.s.): ‘These are your (a.s.) Shites from whom your (a.s.) children would be safe from being killed’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 250)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15059,
        "local_index": 62,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:62",
        "text": [
          "14822- حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ صَفْوَانَ عَنْ مُحَمَّدِ بْنِ زِيَادِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ مُصْعَبٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) كُنْتُ أُبَايِعُ لِرَسُولِ اللَّهِ (صلى الله عليه وآله) عَلَى الْعُسْرِ وَ الْيُسْرِ وَ الْبَسْطِ وَ الْكُرْهِ إِلَى أَنْ كَثُرَ الْإِسْلَامُ وَ كَثُفَ قَالَ وَ أَخَذَ عَلَيْهِمْ عَلِيٌّ (عليه السلام) أَنْ يَمْنَعُوا مُحَمَّداً وَ ذُرِّيَّتَهُ مِمَّا يَمْنَعُونَ مِنْهُ أَنْفُسَهُمْ وَ ذَرَارِيَّهُمْ فَأَخَذْتُهَا عَلَيْهِمْ نَجَا مَنْ نَجَا وَ هَلَكَ مَنْ هَلَكَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473503\">H 14822</a> – Narrated to us Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Hassan Bin Ali, from Safwaan, from Muhammad Bin Ziyad Bin Isa, from Al-Husayn Bin Mus’ab, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘Amir-ul-Momineen<sup>asws</sup> said: ‘I<sup>asws</sup> had pledged allegiance to the Rasool Allah<sup>saww</sup>, to be (loyal) in the hardship, and ease, and the freedom, and the restriction, until such time Al-Islam spreads and becomes strong’. And Ali<sup>asws</sup> took from them (Shites) (a Covenant) that they shall prevent from Muhammad<sup>saww</sup> and his<sup>saww</sup> descendants, what they had prevented themselves as well as their own children from. So I<sup>asws</sup> also took from them (Shites). Rescued was the one who was rescued, and destroyed was the one who was destroyed’."
          ],
          "en.sarwar": [
            "375. Narrated to us Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Hassan Bin Ali, from Safwaan, from Muhammad Bin Ziyad Bin Isa, from Al-Husayn Bin Mus’ab, who has said: Abu Abdullah (a.s.) has said: ‘Amir-ul-Momineen (a.s.) said: ‘I (a.s.) had pledged allegiance to the Rasool Allah (saww), to be (loyal) in the hardship, and ease, and the freedom, and the restriction, until such time Al-Islam spreads and becomes strong’. And Ali (a.s.) took from them (Shites) (a Covenant) that they shall prevent from Muhammad (saww) and his (saww) descendants, what they had prevented themselves as well as their own children from. So I (a.s.) also took from them (Shites). Rescued was the one who was rescued, and destroyed was the one who was destroyed’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق ولعل فيه سقطا</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 252)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3/ 397)"
        ],
        "index": 15060,
        "local_index": 63,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:63",
        "text": [
          "14823- عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَبِي يَحْيَى الْوَاسِطِيِّ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ إِنَّ مِنْ وَرَاءِ الْيَمَنِ وَادِياً يُقَالُ لَهُ وَادِي بَرَهُوتَ وَ لَا يُجَاوِزُ ذَلِكَ الْوَادِيَ إِلَّا الْحَيَّاتُ السُّودُ وَ الْبُومُ مِنَ الطُّيُورِ فِي ذَلِكَ الْوَادِي بِئْرٌ يُقَالُ لَهَا بَلَهُوتُ يُغْدَى وَ يُرَاحُ إِلَيْهَا بِأَرْوَاحِ الْمُشْرِكِينَ يُسْقَوْنَ مِنْ مَاءِ الصَّدِيدِ خَلْفَ ذَلِكَ الْوَادِي قَوْمٌ يُقَالُ لَهُمُ الذَّرِيحُ لَمَّا أَنْ بَعَثَ اللَّهُ تَعَالَى مُحَمَّداً (صلى الله عليه وآله) صَاحَ عِجْلٌ لَهُمْ فِيهِمْ وَ ضَرَبَ بِذَنَبِهِ فَنَادَى فِيهِمْ يَا آلَ الذَّرِيحِ بِصَوْتٍ فَصِيحٍ أَتَى رَجُلٌ بِتِهَامَةَ يَدْعُو إِلَى شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللَّهُ قَالُوا لِأَمْرٍ مَا أَنْطَقَ اللَّهُ هَذَا الْعِجْلَ قَالَ فَنَادَى فِيهِمْ ثَانِيَةً ",
          "فَعَزَمُوا عَلَى أَنْ يَبْنُوا سَفِينَةً فَبَنَوْهَا وَ نَزَلَ فِيهَا سَبْعَةٌ مِنْهُمْ وَ حَمَلُوا مِنَ الزَّادِ مَا قَذَفَ اللَّهُ فِي قُلُوبِهِمْ ثُمَّ رَفَعُوا شِرَاعَهَا وَ سَيَّبُوهَا فِي الْبَحْرِ فَمَا زَالَتْ تَسِيرُ بِهِمْ حَتَّى رَمَتْ بِهِمْ بِجُدَّةَ فَأَتَوُا النَّبِيَّ (صلى الله عليه وآله) فَقَالَ لَهُمُ النَّبِيُّ (صلى الله عليه وآله) أَنْتُمْ أَهْلُ الذَّرِيحِ نَادَى فِيكُمُ الْعِجْلُ قَالُوا نَعَمْ قَالُوا اعْرِضْ عَلَيْنَا يَا رَسُولَ اللَّهِ الدِّينَ وَ الْكِتَابَ فَعَرَضَ عَلَيْهِمْ رَسُولُ اللَّهِ (صلى الله عليه وآله) الدِّينَ وَ الْكِتَابَ وَ السُّنَنَ وَ الْفَرَائِضَ وَ الشَّرَائِعَ كَمَا جَاءَ مِنْ عِنْدِ اللَّهِ جَلَّ وَ عَزَّ وَ وَلَّى عَلَيْهِمْ رَجُلًا مِنْ بَنِي هَاشِمٍ سَيَّرَهُ مَعَهُمْ فَمَا بَيْنَهُمُ اخْتِلَافٌ حَتَّى السَّاعَةَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473504\">H 14823</a> – From him, from Ahmad Bin Muhammad, from Abu Yahya Al-Wasity, from one of our companions, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said that; ‘Behind Al-Yemen there is a valley called Barhoot, and there is no permission to be in that valley except for the black (snakes) and the owls from the birds. In that valley is a well called Balhout where the souls of the ‘الْمُشْرِكِينَ’ Polytheists come to feed and be quenched from the water of pus. Behind that valley are a people called Al-Zareeh. When Allah<sup>azwj</sup> the High Sent Muhammad<sup>saww</sup>, one of their cows shouted and struck with its tail. So it called out, ‘O children of Al-Zareeh!’ - in an eloquent voice – ‘There has come a man<sup>saww</sup> at Tahaamat, calling to the testimony of ‘There is no god except Allah<sup>azwj</sup>’. They said, ‘What has Made Allah<sup>azwj</sup> to Make this cow to speak?’ So it called out among them for a second time’.  ",
            "So they decided to build a ship. So they built it and seven of them embarked in it, and they carried as much provisions as Allah<sup>azwj</sup> Struck them in their hearts. Then they raised its sails and floated it in the sea. They did not stop sailing in it until they reached Jeddah. So they came to the Prophet<sup>saww</sup>. The Prophet<sup>saww</sup> said to them: ‘You are the people of Al-Zareeh among whom the calf called out?’ They said, ‘Yes. O Rasool Allah<sup>saww</sup>, present to us the Religion and the Book’. So the Rasool Allah<sup>saww</sup> presented to them the Religion, and the Book, and the Sunnah, and the Obligation, and the Laws just as it had come from the presence of Allah<sup>azwj</sup> Majestic and Mighty, and made a guardian over them, a man from the Clan of Hashim<sup>as</sup> who journeyed with them. So there will be no differences among them until the Hour (Day of Judgement)’. "
          ],
          "en.sarwar": [
            "376. From him, from Ahmad Bin Muhammad, from Abu Yahya Al-Wasity, from one of our companions, who has said: Abu Abdullah (a.s.) has said that; ‘Behind Al-Yemen there is a valley called Barhoot, and there is no permission to be in that valley except for the black (snakes) and the owls from the birds. In that valley is a well called Balhout where the souls of the ‘الْمُشْرِكِينَ’ Polytheists come to feed and be quenched from the water of pus. Behind that valley are a people called Al-Zareeh. When Allah (azwj) the High Sent Muhammad (saww), one of their cows shouted and struck with its tail. So it called out, ‘O children of Al-Zareeh!’ - in an eloquent voice – ‘There has come a man (saww) at Tahaamat, calling to the testimony of ‘There is no god except Allah (azwj)’. They said, ‘What has Made Allah (azwj) to Make this cow to speak?’ So it called out among them for a second time’. So they decided to build a ship. So they built it and seven of them embarked in it, and they carried as much provisions as Allah (azwj) Struck them in their hearts. Then they raised its sails and floated it in the sea. They did not stop sailing in it until they reached Jeddah. So they came to the Prophet (saww). The Prophet (saww) said to them: ‘You are the people of Al-Zareeh among whom the calf called out?’ They said, ‘Yes. O Rasool Allah (saww), present to us the Religion and the Book’. So the Rasool Allah (saww) presented to them the Religion, and the Book, and the Sunnah, and the Obligation, and the Laws just as it had come from the presence of Allah (azwj) Majestic and Mighty, and made a guardian over them, a man from the Clan of Hashim (as) who journeyed with them. So there will be no differences among them until the Hour (Day of Judgement)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 254)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15061,
        "local_index": 64,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:64",
        "text": [
          "14824- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ حَدِيدٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ لَمَّا أُسْرِيَ بِرَسُولِ اللَّهِ (صلى الله عليه وآله) أَصْبَحَ فَقَعَدَ فَحَدَّثَهُمْ بِذَلِكَ فَقَالُوا لَهُ صِفْ لَنَا بَيْتَ الْمَقْدِسِ قَالَ فَوَصَفَ لَهُمْ وَ إِنَّمَا دَخَلَهُ لَيْلًا فَاشْتَبَهَ عَلَيْهِ النَّعْتُ فَأَتَاهُ جَبْرَئِيلُ (عليه السلام) فَقَالَ انْظُرْ هَاهُنَا فَنَظَرَ إِلَى الْبَيْتِ فَوَصَفَهُ وَ هُوَ يَنْظُرُ إِلَيْهِ ثُمَّ نَعَتَ لَهُمْ مَا كَانَ مِنْ عِيرٍ لَهُمْ فِيمَا بَيْنَهُمْ وَ بَيْنَ الشَّامِ ثُمَّ قَالَ هَذِهِ عِيرُ بَنِي فُلَانٍ تَقْدَمُ مَعَ طُلُوعِ الشَّمْسِ يَتَقَدَّمُهَا جَمَلٌ أَوْرَقُ أَوْ أَحْمَرُ قَالَ وَ بَعَثَ قُرَيْشٌ رَجُلًا عَلَى فَرَسٍ لِيَرُدَّهَا قَالَ وَ بَلَغَ مَعَ طُلُوعِ الشَّمْسِ قَالَ قُرْطَةُ بْنُ عَبْدِ عَمْرٍو يَا لَهْفاً أَلَّا أَكُونَ لَكَ جَذَعاً حِينَ تَزْعُمُ أَنَّكَ أَتَيْتَ بَيْتَ الْمَقْدِسِ وَ رَجَعْتَ مِنْ لَيْلَتِكَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473505\">H 14824</a> – Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Abaan Bin Usmaan, from Hadeed, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘When the ascension (Me’raaj) took place with the Rasool Allah<sup>saww</sup>, in the morning he<sup>saww</sup> sat and narrated it to them (his<sup>saww</sup> companions). So they said to him<sup>saww</sup>, ‘Describe for us Bayt Al-Maqdas’. So he<sup>saww</sup> described it for them, as he<sup>saww</sup> had seen it during the night, therefore they remained vague about it. So Jibraeel came to him<sup>saww</sup> and said: ‘Look over there!’ So he<sup>saww</sup> looked towards Al-Bayt (Al-Maqdas) and described it to them whilst looking at it. Then he<sup>saww</sup> described for them the caravan, which was in between them and Syria. Then said: ‘These were the camels of the Clan of so and so and will be arriving with the rise of the sun, led by a red camel’. And the Quresyh then sent a man upon a horse to turn these back, but it still arrived with the rise of the sun. Qurtat Bin Abd Amro said, ‘O a grief that I don't be for you a trunk (strong enough) when you<sup>saww</sup> claims that you<sup>saww</sup> came to Bait Al-Maqdis and returned in the same night (O Prophet<sup>saww</sup>!)."
          ],
          "en.sarwar": [
            "377. Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Abaan Bin Usmaan, from Hadeed, who has narrated the following: Abu Abdullah (a.s.) has said: ‘When the ascension (Me’raaj) took place with the Rasool Allah (saww), in the morning he (saww) sat and narrated it to them (his (saww) companions). So they said to him (saww), ‘Describe for us Bayt Al-Maqdas’. So he (saww) described it for them, as he (saww) had seen it during the night, therefore they remained vague about it. So Jibraeel came to him (saww) and said: ‘Look over there!’ So he (saww) looked towards Al-Bayt (Al-Maqdas) and described it to them whilst looking at it. Then he (saww) described for them the caravan, which was in between them and Syria. Then said: ‘These were the camels of the Clan of so and so and will be arriving with the rise of the sun, led by a red camel’. And the Quresyh then sent a man upon a horse to turn these back, but it still arrived with the rise of the sun. Qurtat Bin Abd Amro said, ‘O a grief that I don’t be for you a trunk (strong enough) when you (saww) claims that you (saww) came to Bait Al-Maqdis and returned in the same night (O Prophet (saww)!)."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 255)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15062,
        "local_index": 65,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:65",
        "text": [
          "14825- حُمَيْدُ بْنُ زِيَادٍ عَنْ مُحَمَّدِ بْنِ أَيُّوبَ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنِ الْحَكَمِ بْنِ مِسْكِينٍ عَنْ يُوسُفَ بْنِ صُهَيْبٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ سَمِعْتُ أَبَا جَعْفَرٍ (عليه السلام) يَقُولُ إِنَّ رَسُولَ اللَّهِ (صلى الله عليه وآله) أَقْبَلَ يَقُولُ لِأَبِي بَكْرٍ فِي الْغَارِ اسْكُنْ فَإِنَّ اللَّهَ مَعَنَا وَ قَدْ أَخَذَتْهُ الرِّعْدَةُ وَ هُوَ لَا يَسْكُنُ فَلَمَّا رَأَى رَسُولُ اللَّهِ (صلى الله عليه وآله) حَالَهُ قَالَ لَهُ تُرِيدُ أَنْ أُرِيَكَ أَصْحَابِي مِنَ الْأَنْصَارِ فِي مَجَالِسِهِمْ يَتَحَدَّثُونَ فَأُرِيَكَ جَعْفَراً وَ أَصْحَابَهُ فِي الْبَحْرِ يَغُوصُونَ قَالَ نَعَمْ فَمَسَحَ رَسُولُ اللَّهِ (صلى الله عليه وآله) بِيَدِهِ عَلَى وَجْهِهِ فَنَظَرَ إِلَى الْأَنْصَارِ يَتَحَدَّثُونَ وَ نَظَرَ إِلَى جَعْفَرٍ (عليه السلام) وَ أَصْحَابِهِ فِي الْبَحْرِ يَغُوصُونَ فَأَضْمَرَ تِلْكَ السَّاعَةَ أَنَّهُ سَاحِرٌ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473506\">H 14825</a> – Humeyd Bin Ziyad, from Muhammad Bin Ayyub, from Ali Bin Asbaat, from Al-Hakam Bin Muskaan, from Yusuf Bin Suheyb, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘I heard Abu Ja’far saying that: ‘The Rasool Allah<sup>saww</sup> said while turning to Abu Bakr in the cave: ‘Calm down, for Allah<sup>azwj</sup> is with us’. And he had been taken over by the trepidation, and he was not calm. So when the Rasool Allah<sup>saww</sup> saw his state, he<sup>saww</sup> said to him: ‘Would you like me<sup>saww</sup> to show you my<sup>saww</sup> companions from the Helpers narrating in their gathering? So shall I<sup>saww</sup> show you Ja’far<sup>as</sup> and his<sup>as</sup> companions sailing in the sea?’ He said, ‘Yes’. So the Rasool Allah<sup>saww</sup> wiped his<sup>saww</sup> hand upon his face. He visualised the Helpers narrating, and visualised Ja’far<sup>as</sup> and his<sup>as</sup> companions sailing in the sea. So he avouched in that moment that he<sup>saww</sup> was a sorcerer’."
          ],
          "en.sarwar": [
            "378. Humeyd Bin Ziyad, from Muhammad Bin Ayyub, from Ali Bin Asbaat, from Al-Hakam Bin Muskaan, from Yusuf Bin Suheyb, who has said: Abu Abdullah (a.s.) having said: ‘I heard Abu Ja’far saying that: ‘The Rasool Allah (saww) said while turning to Abu Bakr in the cave: ‘Calm down, for Allah (azwj) is with us’. And he had been taken over by the trepidation, and he was not calm. So when the Rasool Allah (saww) saw his state, he (saww) said to him: ‘Would you like me (saww) to show you my (saww) companions from the Helpers narrating in their gathering? So shall I (saww) show you Ja’far (as) and his (as) companions sailing in the sea?’ He said, ‘Yes’. So the Rasool Allah (saww) wiped his (saww) hand upon his face. He visualised the Helpers narrating, and visualised Ja’far (as) and his (as) companions sailing in the sea. So he avouched in that moment that he (saww) was a sorcerer’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 256)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15063,
        "local_index": 66,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:66",
        "text": [
          "14826- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) أَنَّ رَسُولَ اللَّهِ (صلى الله عليه وآله) لَمَّا خَرَجَ مِنَ الْغَارِ مُتَوَجِّهاً إِلَى الْمَدِينَةِ وَ قَدْ كَانَتْ قُرَيْشٌ جَعَلَتْ لِمَنْ أَخَذَهُ مِائَةً مِنَ الْإِبِلِ فَخَرَجَ سُرَاقَةُ بْنُ مَالِكِ بْنِ جُعْشُمٍ فِيمَنْ يَطْلُبُ فَلَحِقَ بِرَسُولِ اللَّهِ (صلى الله عليه وآله) فَقَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) اللَّهُمَّ اكْفِنِي شَرَّ سُرَاقَةَ بِمَا شِئْتَ ",
          "فَسَاخَتْ قَوَائِمُ فَرَسِهِ فَثَنَى رِجْلَهُ ثُمَّ اشْتَدَّ فَقَالَ يَا مُحَمَّدُ إِنِّي عَلِمْتُ أَنَّ الَّذِي أَصَابَ قَوَائِمَ فَرَسِي إِنَّمَا هُوَ مِنْ قِبَلِكَ فَادْعُ اللَّهَ أَنْ يُطْلِقَ لِي فَرَسِي فَلَعَمْرِي إِنْ لَمْ يُصِبْكُمْ مِنِّي خَيْرٌ لَمْ يُصِبْكُمْ مِنِّي شَرٌّ فَدَعَا رَسُولُ اللَّهِ (صلى الله عليه وآله) فَأَطْلَقَ اللَّهُ عَزَّ وَ جَلَّ فَرَسَهُ فَعَادَ فِي طَلَبِ رَسُولِ اللَّهِ (صلى الله عليه وآله) حَتَّى فَعَلَ ذَلِكَ ثَلَاثَ مَرَّاتٍ كُلَّ ذَلِكَ يَدْعُو رَسُولُ اللَّهِ (صلى الله عليه وآله) فَتَأْخُذُ الْأَرْضُ قَوَائِمَ فَرَسِهِ فَلَمَّا أَطْلَقَهُ فِي الثَّالِثَةِ قَالَ يَا مُحَمَّدُ هَذِهِ إِبِلِي بَيْنَ يَدَيْكَ فِيهَا غُلَامِي فَإِنِ احْتَجْتَ إِلَى ظَهْرٍ أَوْ لَبَنٍ فَخُذْ مِنْهُ وَ هَذَا سَهْمٌ مِنْ كِنَانَتِي عَلَامَةً وَ أَنَا أَرْجِعُ فَأَرُدُّ عَنْكَ الطَّلَبَ فَقَالَ لَا حَاجَةَ لَنَا فِيمَا عِنْدَكَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473507\">H 14826</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muawiya Bin Ammar, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘When the Rasool Allah<sup>saww</sup> came out of the cave, he<sup>saww</sup> turned his direction towards Al-Medina, and the Qureysh had placed a reward of one hundred camels for anyone who could capture him<sup>saww</sup>. So Suraqat Bin Malik Bin Jo’sham went out in search. He met up with the Rasool Allah<sup>saww</sup>. So the Rasool Allah<sup>saww</sup> said: ‘Our Allah<sup>azwj</sup>! Suffice me<sup>saww</sup> from the evil of Suraqat by whatever You<sup>azwj</sup> so Desire to’. ",
            "So the legs of his horse bent and got stuck in the soil. He said, ‘O Muhammad<sup>saww</sup>! I know that you<sup>saww</sup> are the one who made the legs of my horse to be stuck, so call upon Allah<sup>azwj</sup> that He<sup>azwj</sup> should Release my horse. If you<sup>saww</sup> do not face goodness from me, you<sup>saww</sup> will not face evil from me either’. So the Rasool Allah<sup>saww</sup> supplicated and Allah<sup>azwj</sup> Mighty and Majestic Released his horse. So he went back in pursuit of Rasool Allah<sup>saww</sup>, until he did that three times during each of which the Rasool Allah<sup>saww</sup> supplicated and the earth grabbed the legs of his horse. So when it was Released for the third time, he said, ‘O Muhammad<sup>saww</sup>! This is my camel in front of you along with my slave. So if you<sup>saww</sup> need to ride upon it or its milk, so take from it. And this is an arrow from my quiver as a sign, and I am returning and will not be pursuing you<sup>saww</sup>’. So he<sup>saww</sup> said: ‘There is no need for us with regards to what is in your possession’."
          ],
          "en.sarwar": [
            "379. Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muawiya Bin Ammar, who has said: Abu Abdullah (a.s.) said: ‘When the Rasool Allah (saww) came out of the cave, he (saww) turned his direction towards Al-Medina, and the Qureysh had placed a reward of one hundred camels for anyone who could capture him (saww). So Suraqat Bin Malik Bin Jo’sham went out in search. He met up with the Rasool Allah (saww). So the Rasool Allah (saww) said: ‘Our Allah (azwj)! Suffice me (saww) from the evil of Suraqat by whatever You (azwj) so Desire to’. So the legs of his horse bent and got stuck in the soil. He said, ‘O Muhammad (saww)! I know that you (saww) are the one who made the legs of my horse to be stuck, so call upon Allah (azwj) that He (azwj) should Release my horse. If you (saww) do not face goodness from me, you (saww) will not face evil from me either’. So the Rasool Allah (saww) supplicated and Allah (azwj) Mighty and Majestic Released his horse. So he went back in pursuit of Rasool Allah (saww), until he did that three times during each of which the Rasool Allah (saww) supplicated and the earth grabbed the legs of his horse. So when it was Released for the third time, he said, ‘O Muhammad (saww)! This is my camel in front of you along with my slave. So if you (saww) need to ride upon it or its milk, so take from it. And this is an arrow from my quiver as a sign, and I am returning and will not be pursuing you (saww)’. So he (saww) said: ‘There is no need for us with regards to what is in your possession’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 257)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15064,
        "local_index": 67,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:67",
        "text": [
          "14827- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ أَبِي الْجَارُودِ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ لَا تَرَوْنَ الَّذِي تَنْتَظِرُونَ حَتَّى تَكُونُوا كَالْمِعْزَى الْمُوَاتِ الَّتِي لَا يُبَالِي الْخَابِسُ أَيْنَ يَضَعُ يَدَهُ فِيهَا لَيْسَ لَكُمْ شَرَفٌ تَرْقَوْنَهُ وَ لَا سِنَادٌ تُسْنِدُونَ إِلَيْهِ أَمْرَكُمْ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473508\">H 14827</a> – A number of our companions, from Ahmad Bin Muhammad, from Ibn Abu Najraan, from Muhammad Bin Sinan, from Abu Al-Jaroud, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> having said: ‘You will not see that which you all are waiting for (Al-Qaim<sup>asws</sup>) until you become like the dead goat for whom the lion does not care where it places its paws on. There will be no honour for you to rise up to, and no supporter to lend you his support in your matters’."
          ],
          "en.sarwar": [
            "380. A number of our companions, from Ahmad Bin Muhammad, from Ibn Abu Najraan, from Muhammad Bin Sinan, from Abu Al-Jaroud, who has said: Abu Ja’far (a.s.) having said: ‘You will not see that which you all are waiting for (Al-Qaim (a.s.)) until you become like the dead goat for whom the lion does not care where it places its paws on. There will be no honour for you to rise up to, and no supporter to lend you his support in your matters’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 257)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 397)"
        ],
        "index": 15065,
        "local_index": 68,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:68",
        "text": [
          "14828- وَ عَنْهُ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ ابْنِ سِنَانٍ عَنْ أَبِي الْجَارُودِ مِثْلَهُ قَالَ قُلْتُ لِعَلِيِّ بْنِ الْحَكَمِ مَا الْمُوَاتُ مِنَ الْمَعْزِ قَالَ الَّتِي قَدِ اسْتَوَتْ لَا يَفْضُلُ بَعْضُهَا عَلَى بَعْضٍ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473509\">H 14828</a> – And from him, from Ali Bin Al-Hakam, from Ibn Sinan, from Abu Al-Jaroud, similar to it. He said, ‘I said to Ali Bin Al-Hakam, ‘The dead goat (what does it mean)?’ He said, ‘That which has become the same, and there is no preference for one over the other’."
          ],
          "en.sarwar": [
            "381. And from him, from Ali Bin Al-Hakam, from Ibn Sinan, from Abu Al-Jaroud, similar to it. He said, ‘I said to Ali Bin Al-Hakam, ‘The dead goat (what does it mean)?’ He said, ‘That which has become the same, and there is no preference for one over the other’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 259)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15066,
        "local_index": 69,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:69",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14829</span>- عَلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عِيصِ بْنِ الْقَاسِمِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ عَلَيْكُمْ بِتَقْوَى اللَّهِ وَحْدَهُ لَا شَرِيكَ لَهُ وَ انْظُرُوا لِأَنْفُسِكُمْ فَوَ اللَّهِ إِنَّ الرَّجُلَ لَيَكُونُ لَهُ الْغَنَمُ فِيهَا الرَّاعِي فَإِذَا وَجَدَ رَجُلًا هُوَ أَعْلَمُ بِغَنَمِهِ مِنَ الَّذِي هُوَ فِيهَا يُخْرِجُهُ وَ يَجِي‏ءُ بِذَلِكَ الرَّجُلِ الَّذِي هُوَ أَعْلَمُ بِغَنَمِهِ مِنَ الَّذِي كَانَ فِيهَا وَ اللَّهِ لَوْ كَانَتْ لِأَحَدِكُمْ نَفْسَانِ يُقَاتِلُ بِوَاحِدَةٍ يُجَرِّبُ بِهَا ثُمَّ كَانَتِ الْأُخْرَى بَاقِيَةً فَعَمِلَ عَلَى مَا قَدِ اسْتَبَانَ لَهَا وَ لَكِنْ لَهُ نَفْسٌ وَاحِدَةٌ إِذَا ذَهَبَتْ فَقَدْ وَ اللَّهِ ذَهَبَتِ التَّوْبَةُ",
          "فَأَنْتُمْ أَحَقُّ أَنْ تَخْتَارُوا لِأَنْفُسِكُمْ إِنْ أَتَاكُمْ آتٍ مِنَّا فَانْظُرُوا عَلَى أَيِّ شَيْ‏ءٍ تَخْرُجُونَ وَ لَا تَقُولُوا خَرَجَ زَيْدٌ فَإِنَّ زَيْداً كَانَ عَالِماً وَ كَانَ صَدُوقاً وَ لَمْ يَدْعُكُمْ إِلَى نَفْسِهِ إِنَّمَا دَعَاكُمْ إِلَى الرِّضَا مِنْ آلِ مُحَمَّدٍ (عليهم السلام) وَ لَوْ ظَهَرَ لَوَفَى بِمَا دَعَاكُمْ إِلَيْهِ إِنَّمَا خَرَجَ إِلَى سُلْطَانٍ مُجْتَمِعٍ لِيَنْقُضَهُ",
          "فَالْخَارِجُ مِنَّا الْيَوْمَ إِلَى أَيِّ شَيْ‏ءٍ يَدْعُوكُمْ إِلَى الرِّضَا مِنْ آلِ مُحَمَّدٍ (عليهم السلام) فَنَحْنُ نُشْهِدُكُمْ أَنَّا لَسْنَا نَرْضَى بِهِ وَ هُوَ يَعْصِينَا الْيَوْمَ وَ لَيْسَ مَعَهُ أَحَدٌ وَ هُوَ إِذَا كَانَتِ الرَّايَاتُ وَ الْأَلْوِيَةُ أَجْدَرُ أَنْ لَا يَسْمَعَ مِنَّا إِلَّا مَعَ مَنِ اجْتَمَعَتْ بَنُو فَاطِمَةَ مَعَهُ فَوَ اللَّهِ مَا صَاحِبُكُمْ إِلَّا مَنِ اجْتَمَعُوا عَلَيْهِ إِذَا كَانَ رَجَبٌ فَأَقْبِلُوا عَلَى اسْمِ اللَّهِ عَزَّ وَ جَلَّ وَ إِنْ أَحْبَبْتُمْ أَنْ تَتَأَخَّرُوا إِلَى شَعْبَانَ فَلَا ضَيْرَ وَ إِنْ أَحْبَبْتُمْ أَنْ تَصُومُوا فِي أَهَالِيكُمْ فَلَعَلَّ ذَلِكَ أَنْ يَكُونَ أَقْوَى لَكُمْ وَ كَفَاكُمْ بِالسُّفْيَانِيِّ عَلَامَةً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473510\">H 14829</a> – Ali Bin Ibrahim, from his father, from Safwaan Bin Yahya, from Ays Bin Al-Qasim who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘It is upon you to fear Allah<sup>azwj</sup>, One with no associates to Him<sup>azwj</sup>, and look into yourselves, for, by Allah<sup>azwj</sup>, the man who has sheep and the shepherd for it, if he finds a man who is more knowledgeable about the sheep than him, would let him go and come to that man who is more knowledgeable about his sheep. By Allah<sup>azwj</sup>! If one of you had two souls, he could have fought with one, experimenting by it, then he would have worked with the other one with what has been clarified for it. But, for him there is only one soul, if it goes, by Allah<sup>azwj</sup>, the repentance goes (with it). ",
            "So you are more deserving that you should choose for yourselves the one who comes to you from us<sup>asws</sup>, and upon which matter you are coming out, and do not go around saying that Zayd has come out, for Zayd was a scholar, and he was truthful, and he did not call you for himself. But rather he called to the pleasure (Al-Reza) from the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and had he made an appearance he would have been loyal to what he called you to. But rather, he came out against an authority to break it. ",
            "So the one who comes out from us<sup>asws</sup> today for anything, he will call you to the pleasure (Al-Reza) from the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>. So we<sup>asws</sup> are testifying to you that we<sup>asws</sup> are not happy with it, and he has disobeyed us<sup>asws</sup> today. And there is no one with him and he with the banners and the flags, more worthy that he should listen from us<sup>asws</sup> except that with him would be gathered the children of Fatima<sup>asws</sup>. By Allah<sup>azwj</sup>! What is your Master<sup>asws</sup> (Al-Qaim<sup>asws</sup>) except that there will be gathered around him<sup>asws</sup> in the month of Rajab. So go towards him<sup>asws</sup> in the Name of Allah<sup>azwj</sup>, and if you would like to delay it to the month of Shabaan, so it is not harmful, and if you would like to Fast in your situations so that would be more strengthening for you, and let Al-Sufyani suffice for you as a sign’."
          ],
          "en.sarwar": [
            "382. Ali Bin Ibrahim, from his father, from Safwaan Bin Yahya, from Ays Bin Al-Qasim who said: I heard Abu Abdullah (a.s.) saying: ‘It is upon you to fear Allah (azwj), One with no associates to Him (azwj), and look into yourselves, for, by Allah (azwj), the man who has sheep and the shepherd for it, if he finds a man who is more knowledgeable about the sheep than him, would let him go and come to that man who is more knowledgeable about his sheep. By Allah (azwj)! If one of you had two souls, he could have fought with one, experimenting by it, then he would have worked with the other one with what has been clarified for it. But, for him there is only one soul, if it goes, by Allah (azwj), the repentance goes (with it). So you are more deserving that you should choose for yourselves the one who comes to you from us (a.s.), and upon which matter you are coming out, and do not go around saying that Zayd has come out, for Zayd was a scholar, and he was truthful, and he did not call you for himself. But rather he called to the pleasure (Al-Reza) from the Progeny (a.s.) of Muhammad (saww), and had he made an appearance he would have been loyal to what he called you to. But rather, he came out against an authority to break it. So the one who comes out from us (a.s.) today for anything, he will call you to the pleasure (Al-Reza) from the Progeny (a.s.) of Muhammad (saww). So we (a.s.) are testifying to you that we (a.s.) are not happy with it, and he has disobeyed us (a.s.) today. And there is no one with him and he with the banners and the flags, more worthy that he should listen from us (a.s.) except that with him would be gathered the children of Fatima (a.s.). By Allah (azwj)! What is your Master (a.s.) (Al-Qaim (a.s.)) except that there will be gathered around him (a.s.) in the month of Rajab. So go towards him (a.s.) in the Name of Allah (azwj), and if you would like to delay it to the month of Shabaan, so it is not harmful, and if you would like to Fast in your situations so that would be more strengthening for you, and let Al-Sufyani suffice for you as a sign’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 259)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 398)"
        ],
        "index": 15067,
        "local_index": 70,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:70",
        "text": [
          "14830- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيٍّ رَفَعَهُ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ (عليه السلام) قَالَ وَ اللَّهِ لَا يَخْرُجُ وَاحِدٌ مِنَّا قَبْلَ خُرُوجِ الْقَائِمِ (عليه السلام) إِلَّا كَانَ مَثَلُهُ مَثَلَ فَرْخٍ طَارَ مِنْ وَكْرِهِ قَبْلَ أَنْ يَسْتَويَ جَنَاحَاهُ فَأَخَذَهُ الصِّبْيَانُ فَعَبِثُوا بِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473511\">H 14830</a> – Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Rabi’e with an unbroken chain, has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>li</span><sup>asws</sup> Bin Al-Husayn<sup>asws</sup> has said: ‘By Allah<sup>azwj</sup>! There will not come out any one from us<sup>asws</sup> before the coming out of Al-Qaim<sup>asws</sup> except that his example would be of a nestling trying to come out from its nest before its wings have been formed, so the young boys grab hold of it and play with it’."
          ],
          "en.sarwar": [
            "383. Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Rabi’e with an unbroken chain, has narrated the following: Ali (a.s.) Bin Al-Husayn (a.s.) has said: ‘By Allah (azwj)! There will not come out any one from us (a.s.) before the coming out of Al-Qaim (a.s.) except that his example would be of a nestling trying to come out from its nest before its wings have been formed, so the young boys grab hold of it and play with it’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 259)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15068,
        "local_index": 71,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:71",
        "text": [
          "14831- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ بَكْرِ بْنِ مُحَمَّدٍ عَنْ سَدِيرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) يَا سَدِيرُ الْزَمْ بَيْتَكَ وَ كُنْ حِلْساً مِنْ أَحْلَاسِهِ وَ اسْكُنْ مَا سَكَنَ اللَّيْلُ وَ النَّهَارُ فَإِذَا بَلَغَكَ أَنَّ السُّفْيَانِيَّ قَدْ خَرَجَ فَارْحَلْ إِلَيْنَا وَ لَوْ عَلَى رِجْلِكَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473512\">H 14831</a> – A number of our companions, from Ahmad Bin Muhammad, from Usmaan Bin Isa, from Bakr Bin Muhammad, from Sudeyr who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘O Sudeyr! Be seated in your houses and remain calm, and stay like that overnight, and when the day arrives, and Al-Sufyani has come out, so get out to come to us<sup>asws</sup> even if you have to walk on your feet’. ",
            "out of 567"
          ],
          "en.sarwar": [
            "384. A number of our companions, from Ahmad Bin Muhammad, from Usmaan Bin Isa, from Bakr Bin Muhammad, from Sudeyr who said: Abu Abdullah (a.s.) said: ‘O Sudeyr! Be seated in your houses and remain calm, and stay like that overnight, and when the day arrives, and Al-Sufyani has come out, so get out to come to us (a.s.) even if you have to walk on your feet’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 260)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15069,
        "local_index": 72,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:72",
        "text": [
          "14832- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ كَامِلِ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ الْجُعْفِيِّ قَالَ حَدَّثَنِي أَبِي قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام) فَقَالَ مَا لِي أَرَاكَ سَاهِمَ الْوَجْهِ فَقُلْتُ إِنَّ بِي حُمَّى الرِّبْعِ فَقَالَ مَا [ذَا] يَمْنَعُكَ مِنَ الْمُبَارَكِ الطَّيِّبِ اسْحَقِ السُّكَّرَ ثُمَّ امْخُضْهُ بِالْمَاءِ وَ اشْرَبْهُ عَلَى الرِّيقِ وَ عِنْدَ الْمَسَاءِ قَالَ فَفَعَلْتُ فَمَا عَادَتْ إِلَيَّ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473513\">H 14832</a> – Muhammad Bin yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from Kamil Bin Muhammad, from Muhammad Bin Ibrahim Al-Ju’fy who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-m\">M</span>y father narrated</span> to me that he came up to Abu Abdullah<sup>asws</sup> who<sup>asws</sup> said; ‘Why is it that I<sup>asws</sup> see you with a grim face?’ So I said, ‘I have fever’. So he<sup>asws</sup> said: ‘What prevents you from the blessed and good. Take the sugar and dissolve it in the water and drink it on an empty stomach and during the evening’. He said, ‘I did that, so it (fever) did not return to me’."
          ],
          "en.sarwar": [
            "385. Muhammad Bin yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from Kamil Bin Muhammad, from Muhammad Bin Ibrahim Al-Ju’fy who said: My father narrated to me that he came up to Abu Abdullah (a.s.) who (a.s.) said; ‘Why is it that I (a.s.) see you with a grim face?’ So I said, ‘I have fever’. So he (a.s.) said: ‘What prevents you from the blessed and good. Take the sugar and dissolve it in the water and drink it on an empty stomach and during the evening’. He said, ‘I did that, so it (fever) did not return to me’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول مرسل</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 260)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15070,
        "local_index": 73,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:73",
        "text": [
          "14833- عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ النُّعْمَانِ عَنْ بَعْضِ أَصْحَابِنَا قَالَ شَكَوْتُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) الْوَجَعَ فَقَالَ إِذَا أَوَيْتَ إِلَى فِرَاشِكَ فَكُلْ سُكَّرَتَيْنِ قَالَ فَفَعَلْتُ فَبَرَأْتُ وَ أَخْبَرْتُ بِهِ بَعْضَ الْمُتَطَبِّبِينَ وَ كَانَ أَفْرَهَ أَهْلِ بِلَادِنَا فَقَالَ مِنْ أَيْنَ عَرَفَ أَبُو عَبْدِ اللَّهِ (عليه السلام) هَذَا هَذَا مِنْ مَخْزُونِ عِلْمِنَا أَمَا إِنَّهُ صَاحِبُ كُتُبٍ يَنْبَغِي أَنْ يَكُونَ أَصَابَهُ فِي بَعْضِ كُتُبِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473514\">H 14833</a> – From him, from Ahmad Bin Muhammad, from Al-Hassan Bin Ali Bin Al-No’man, from one of our companions who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> complained to Abu</span> Abdullah<sup>asws</sup> of the aches, so he<sup>asws</sup> said: ‘When you go to your bed, take two (pieces) of sugar’. So he said, ‘I did it. So I was free from it, and I informed one of the doctors who was a renowned one of our city. He said, ‘From where did Abu Abdullah<sup>asws</sup> understand this? This is from the treasures of our knowledge. But he<sup>asws</sup> is the owner of Books. He probably got it from one of his<sup>asws</sup> Books’. "
          ],
          "en.sarwar": [
            "386. From him, from Ahmad Bin Muhammad, from Al-Hassan Bin Ali Bin Al-No’man, from one of our companions who said: I complained to Abu Abdullah (a.s.) of the aches, so he (a.s.) said: ‘When you go to your bed, take two (pieces) of sugar’. So he said, ‘I did it. So I was free from it, and I informed one of the doctors who was a renowned one of our city. He said, ‘From where did Abu Abdullah (a.s.) understand this? This is from the treasures of our knowledge. But he (a.s.) is the owner of Books. He probably got it from one of his (a.s.) Books’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> الظاهر أنه صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 261)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15071,
        "local_index": 74,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:74",
        "text": [
          "14834- عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ يَحْيَى الْخُزَاعِيِّ عَنِ الْحُسَيْنِ بْنِ الْحَسَنِ عَنْ عَاصِمِ بْنِ يُونُسَ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ لِرَجُلٍ بِأَيِّ شَيْ‏ءٍ تُعَالِجُونَ مَحْمُومَكُمْ إِذَا حُمَّ قَالَ أَصْلَحَكَ اللَّهُ بِهَذِهِ الْأَدْوِيَةِ الْمُرَّةِ بَسْفَايَجٍ وَ الْغَافِثِ وَ مَا أَشْبَهَهُ فَقَالَ سُبْحَانَ اللَّهِ الَّذِي يَقْدِرُ أَنْ يُبْرِئَ بِالْمُرِّ يَقْدِرُ أَنْ يُبْرِئَ بِالْحُلْوِ ",
          "ثُمَّ قَالَ إِذَا حُمَّ أَحَدُكُمْ فَلْيَأْخُذْ إِنَاءً نَظِيفاً فَيَجْعَلَ فِيهِ سُكَّرَةً وَ نِصْفاً ثُمَّ يَقْرَأَ عَلَيْهِ مَا حَضَرَ مِنَ الْقُرْآنِ ثُمَّ يَضَعَهَا تَحْتَ النُّجُومِ وَ يَجْعَلَ عَلَيْهَا حَدِيدَةً فَإِذَا كَانَ فِي الْغَدَاةِ صَبَّ عَلَيْهَا الْمَاءَ وَ مَرَسَهُ بِيَدِهِ ثُمَّ شَرِبَهُ فَإِذَا كَانَتِ اللَّيْلَةُ الثَّانِيَةُ زَادَهُ سُكَّرَةً أُخْرَى فَصَارَتْ سُكَّرَتَيْنِ وَ نِصْفاً فَإِذَا كَانَتِ اللَّيْلَةُ الثَّالِثَةُ زَادَهُ سُكَّرَةً أُخْرَى فَصَارَتْ ثَلَاثَ سُكَّرَاتٍ وَ نِصْفاً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473515\">H 14834</a> – From him, from Ahmad Bin Muhammad, from Ja’far Bin Yahya Al-Khazai’e, from Al-Husayn Bin Al-Hassan, from Aasim Bin Yunus, from a man, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said to a man: ‘With what thing do you cure your sick when they have fever?’ He said, ‘May Allah<sup>azwj</sup> Keep you well, by these bitter medicines – by <span class=\"iTxt\">Safaayaj</span>, and <span class=\"iTxt\">Al-Ghafas</span>, and similar to these’. So he<sup>asws</sup> said: ‘Glory be to Allah<sup>azwj</sup>, the One Who<sup>azwj</sup> has the Power to Free (Cure) with the bitter (medication) also has the Power to Free (Cure) with the sweet’. ",
            "Then said: ‘If one of you has fever, so he should take a clean container, and place sugar in it, then recite over it what he knows from the Quran. Then he should place it underneath the stars (at night in the open), and place iron in it. So when it is the morning, pour some water on it and mix it with his hand, then drink it. So when it is the second night, increase another (piece of) sugar in it so it becomes two and a half times as much. So when it is the third night, increase another (piece of) sugar so it become three and a half times as much’."
          ],
          "en.sarwar": [
            "387. From him, from Ahmad Bin Muhammad, from Ja’far Bin Yahya Al-Khazai’e, from Al-Husayn Bin Al-Hassan, from Aasim Bin Yunus, from a man, who has narrated the following: Abu Abdullah (a.s.) has said to a man: ‘With what thing do you cure your sick when they have fever?’ He said, ‘May Allah (azwj) Keep you well, by these bitter medicines – by Safaayaj, and Al-Ghafas, and similar to these’. So he (a.s.) said: ‘Glory be to Allah (azwj), the One Who (azwj) has the Power to Free (Cure) with the bitter (medication) also has the Power to Free (Cure) with the sweet’. Then said: ‘If one of you has fever, so he should take a clean container, and place sugar in it, then recite over it what he knows from the Quran. Then he should place it underneath the stars (at night in the open), and place iron in it. So when it is the morning, pour some water on it and mix it with his hand, then drink it. So when it is the second night, increase another (piece of) sugar in it so it becomes two and a half times as much. So when it is the third night, increase another (piece of) sugar so it become three and a half times as much’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 261)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15072,
        "local_index": 75,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:75",
        "refs": {
          "Quran": [
            "/books/quran:17:46"
          ]
        },
        "text": [
          "14835- أَحْمَدُ بْنُ مُحَمَّدٍ الْكُوفِيُّ عَنْ عَلِيِّ بْنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نَجْرَانَ عَنْ هَارُونَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ لِي كَتَمُوا بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ فَنِعْمَ وَ اللَّهِ الْأَسْمَاءُ كَتَمُوهَا كَانَ رَسُولُ اللَّهِ (صلى الله عليه وآله) إِذَا دَخَلَ إِلَى مَنْزِلِهِ وَ اجْتَمَعَتْ عَلَيْهِ قُرَيْشٌ يَجْهَرُ بِبِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ وَ يَرْفَعُ بِهَا صَوْتَهُ فَتُوَلِّي قُرَيْشٌ فِرَاراً فَأَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ فِي ذَلِكَ وَ إِذا ذَكَرْتَ رَبَّكَ فِي الْقُرْآنِ وَحْدَهُ وَلَّوْا عَلى أَدْبارِهِمْ نُفُوراً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473516\">H 14835</a> – Ahmad Bin Muhammad Al-Kufy, from Ali Bin Al-Hassan Bin Ali, from Abdul Rahmaan Bin Abu Najraan, from Haroun, who has said the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said to me: ‘They have concealed ‘بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ’ ‘In the Name of Allah<sup>azwj</sup> the Beneficent, the Merciful’. So, by Allah<sup>azwj</sup>, they have concealed the Best Name. The Rasool Allah<sup>saww</sup>, when he<sup>asws</sup> used to enter his<sup>saww</sup> house, and the Quresyh were gathered against him<sup>saww</sup>, would say loudly ‘بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ’ ‘In the Name of Allah<sup>azwj</sup>, the Beneficent, the Merciful’, and raise his<sup>saww</sup> voice with it. The Qureysh would then flee. So Allah<sup>azwj</sup> Mighty and Majestic Revealed with regards to that: <span class=\"ibTxt\">“<a href=\"/#/books/quran:17#h46\">[17:46]</a> And We have placed coverings on their hearts and a heaviness in their ears lest they understand it, and when you mention your Lord alone in the Quran they turn their backs in aversion”</span>.’"
          ],
          "en.sarwar": [
            "388. Ahmad Bin Muhammad Al-Kufy, from Ali Bin Al-Hassan Bin Ali, from Abdul Rahmaan Bin Abu Najraan, from Haroun, who has said the following: Abu Abdullah (a.s.) having said to me: ‘They have concealed ‘بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ’ ‘In the Name of Allah (azwj) the Beneficent, the Merciful’. So, by Allah (azwj), they have concealed the Best Name. The Rasool Allah (saww), when he (a.s.) used to enter his (saww) house, and the Quresyh were gathered against him (saww), would say loudly ‘بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ’ ‘In the Name of Allah (azwj), the Beneficent, the Merciful’, and raise his (saww) voice with it. The Qureysh would then flee. So Allah (azwj) Mighty and Majestic Revealed with regards to that: “<a href=\"/#/books/quran:17#h46\">[17:46]</a> And We have placed coverings on their hearts and a heaviness in their ears lest they understand it, and when you mention your Lord alone in the Quran they turn their backs in aversion”.’"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول وقد يعد ف السان</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 262)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15073,
        "local_index": 76,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:76",
        "refs": {
          "Quran": [
            "/books/quran:3:103"
          ]
        },
        "text": [
          "14836- عَنْهُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نَجْرَانَ عَنْ أَبِي هَارُونَ الْمَكْفُوفِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ كَانَ أَبُو عَبْدِ اللَّهِ (عليه السلام) إِذَا ذَكَرَ رَسُولَ اللَّهِ (صلى الله عليه وآله) قَالَ بِأَبِي وَ أُمِّي وَ قَوْمِي وَ عَشِيرَتِي عَجَبٌ لِلْعَرَبِ كَيْفَ لَا تَحْمِلُنَا عَلَى رُءُوسِهَا وَ اللَّهُ عَزَّ وَ جَلَّ يَقُولُ فِي كِتَابِهِ وَ كُنْتُمْ عَلى شَفا حُفْرَةٍ مِنَ النَّارِ فَأَنْقَذَكُمْ مِنْها فَبِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) أُنْقِذُوا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473517\">H 14836</a> – From him, from Abdul Rahmaan Bin Abu Najraan, from Abu Haroun Al-Makfouf, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-w\">W</span>henever Abu Abdullah</span><sup>asws</sup> mentioned the Rasool Allah<sup>saww</sup>, he would say: ‘By my<sup>asws</sup> father<sup>asws</sup>, and my<sup>asws</sup> mother<sup>as</sup>, and by my<sup>asws</sup> people, and my<sup>asws</sup> relatives! It is strange of the Arabs, how they have not carried us<sup>asws</sup> upon their heads, and Allah<sup>azwj</sup> Mighty and Majestic is Saying in His<sup>azwj</sup> Book: <span class=\"ibTxt\">“<a href=\"/#/books/quran:3#h103\">[3:103]</a> and you were on the brink of a pit of fire, then He saved you from it”</span>, so it was by the Rasool Allah<sup>saww</sup> that they were saved’."
          ],
          "en.sarwar": [
            "389. From him, from Abdul Rahmaan Bin Abu Najraan, from Abu Haroun Al-Makfouf, who has narrated the following: Whenever Abu Abdullah (a.s.) mentioned the Rasool Allah (saww), he would say: ‘By my (a.s.) father (a.s.), and my (a.s.) mother (as), and by my (a.s.) people, and my (a.s.) relatives! It is strange of the Arabs, how they have not carried us (a.s.) upon their heads, and Allah (azwj) Mighty and Majestic is Saying in His (azwj) Book: “<a href=\"/#/books/quran:3#h103\">[3:103]</a> and you were on the brink of a pit of fire, then He saved you from it”, so it was by the Rasool Allah (saww) that they were saved’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 263)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15074,
        "local_index": 77,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:77",
        "refs": {
          "Quran": [
            "/books/quran:3:26"
          ]
        },
        "text": [
          "14837- عَنْهُ عَنْ إِبْرَاهِيمَ بْنِ أَبِي بَكْرِ بْنِ أَبِي سَمَّاكٍ عَنْ دَاوُدَ بْنِ فَرْقَدٍ عَنْ عَبْدِ الْأَعْلَى مَوْلَى آلِ سَامٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قُلْتُ لَهُ قُلِ اللَّهُمَّ مالِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ مَنْ تَشاءُ وَ تَنْزِعُ الْمُلْكَ مِمَّنْ تَشاءُ أَ لَيْسَ قَدْ آتَى اللَّهُ عَزَّ وَ جَلَّ بَنِي أُمَيَّةَ الْمُلْكَ قَالَ لَيْسَ حَيْثُ تَذْهَبُ إِلَيْهِ إِنَّ اللَّهَ عَزَّ وَ جَلَّ آتَانَا الْمُلْكَ وَ أَخَذَتْهُ بَنُو أُمَيَّةَ بِمَنْزِلَةِ الرَّجُلِ يَكُونُ لَهُ الثَّوْبُ فَيَأْخُذُهُ الْآخَرُ فَلَيْسَ هُوَ لِلَّذِي أَخَذَهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473518\">H 14837</a> – From him, from Ibrahim bin Abu Bakr Bin Abu Sammaak, from Dawood Bin Farqad, from Abdul A’ala the slave of the progeny of Saam, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked from Abu Abdullah</span><sup>asws</sup> (about): <span class=\"ibTxt\">“<a href=\"/#/books/quran:3#h26\">[3:26]</a> Say: O Allah, Master of the Kingdom! You give the kingdom to whomsoever You please to and take away the kingdom from whomsoever You please to”</span><span class=\"bTxt\">. </span>Has not Allah<sup>azwj</sup> Mighty and Majestic Given the kingdom to the Clan of Umayya?’ He<sup>asws</sup> said; ‘This is not as, where you are going with it. ",
            "Allah<sup>azwj</sup> Gave us<sup>asws</sup> the kingdom and the Clan of Umayya took it away, like the man who has his clothes and another one takes it away from him, so it still does not belong to the one who took it (unlawfully)’."
          ],
          "en.sarwar": [
            "390. From him, from Ibrahim bin Abu Bakr Bin Abu Sammaak, from Dawood Bin Farqad, from Abdul A’ala the slave of the progeny of Saam, who has said: I asked from Abu Abdullah (a.s.) (about): “<a href=\"/#/books/quran:3#h26\">[3:26]</a> Say: O Allah, Master of the Kingdom! You give the kingdom to whomsoever You please to and take away the kingdom from whomsoever You please to”. Has not Allah (azwj) Mighty and Majestic Given the kingdom to the Clan of Umayya?’ He (a.s.) said; ‘This is not as, where you are going with it. Allah (azwj) Gave us (a.s.) the kingdom and the Clan of Umayya took it away, like the man who has his clothes and another one takes it away from him, so it still does not belong to the one who took it (unlawfully)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 263)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15075,
        "local_index": 78,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:78",
        "refs": {
          "Quran": [
            "/books/quran:57:17"
          ]
        },
        "text": [
          "14838- مُحَمَّدُ بْنُ أَحْمَدَ بْنِ الصَّلْتِ عَنْ عَبْدِ اللَّهِ بْنِ الصَّلْتِ عَنْ يُونُسَ عَنِ الْمُفَضَّلِ بْنِ صَالِحٍ عَنْ مُحَمَّدٍ الْحَلَبِيِّ أَنَّهُ سَأَلَ أَبَا عَبْدِ اللَّهِ (عليه السلام) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ اعْلَمُوا أَنَّ اللَّهَ يُحْيِ الْأَرْضَ بَعْدَ مَوْتِها قَالَ الْعَدْلَ بَعْدَ الْجَوْرِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473519\">H 14838</a> – Muhammad Bin Ahmad Bin Al-Salt, from Abdullah Bin Al-Salt, from yunus, from Al-Mufazzal Bin Salih, from Muhammad Al-Halby, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked Abu Abdullah</span><sup>asws</sup> about the Statement of Allah<sup>azwj</sup>: <span class=\"ibTxt\">“<a href=\"/#/books/quran:57#h17\">[57:17]</a> Know that Allah gives life to the earth after its death”</span>. He<sup>asws</sup> said: ‘The justice, after the oppression’. "
          ],
          "en.sarwar": [
            "391. Muhammad Bin Ahmad Bin Al-Salt, from Abdullah Bin Al-Salt, from yunus, from Al-Mufazzal Bin Salih, from Muhammad Al-Halby, who has said: I asked Abu Abdullah (a.s.) about the Statement of Allah (azwj): “<a href=\"/#/books/quran:57#h17\">[57:17]</a> Know that Allah gives life to the earth after its death”. He (a.s.) said: ‘The justice, after the oppression’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 264)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15076,
        "local_index": 79,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:43:79",
        "text": [
          "14839- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ مُحَمَّدِ بْنِ أَشْيَمَ عَنْ صَفْوَانَ بْنِ يَحْيَى قَالَ سَأَلْتُ أَبَا الْحَسَنِ الرِّضَا (عليه السلام) عَنْ ذِي الْفَقَارِ سَيْفِ رَسُولِ اللَّهِ (صلى الله عليه وآله) فَقَالَ نَزَلَ بِهِ جَبْرَئِيلُ (عليه السلام) مِنَ السَّمَاءِ وَ كَانَتْ حَلْقَتُهُ فِضَّةً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473520\">H 14839</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Muhammad Bin Asheym, from Safwaan Bin Yahya who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked Abu Al-Hassan</span> Al-Reza<sup>asws</sup> about <span class=\"iTxt\">Zi Al-Fiqaar</span> (Zulfiqaar), the sword of the Rasool Allah<sup>saww</sup>. He<sup>asws</sup> said: ‘Jibraeel <sup>as</sup> came down with it from the sky, and it hilt was made of silver’. "
          ],
          "en.sarwar": [
            "392. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Muhammad Bin Asheym, from Safwaan Bin Yahya who said: I asked Abu Al-Hassan Al-Ridha (a.s.) about Zi Al-Fiqaar (Zulfiqaar), the sword of the Rasool Allah (saww). He (a.s.) said: ‘Jibraeel (as) came down with it from the sky, and it hilt was made of silver’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:43",
  "kind": "verse_list"
}