{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 45"
        },
        "path": "/books/al-kafi:8:1:45",
        "titles": {
          "ar": "حَدِيثُ أَبِي ذَرٍّ رَضِيَ اللَّهُ عَنْهُ",
          "en": "HADEETH OF ABU DHARR<sup>ar</sup>"
        }
      }
    ],
    "index": 2316,
    "local_index": 45,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 46"
        },
        "path": "/books/al-kafi:8:1:46",
        "titles": {
          "ar": "حَدِيثُ الْفُقَهَاءِ وَ الْعُلَمَاءِ",
          "en": "HADEETH OF THE FUQAHA (JURISTS) AND THE ULAMA (SCHOLARS)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 44"
        },
        "path": "/books/al-kafi:8:1:44",
        "titles": {
          "ar": "حَدِيثُ نُوحٍ ( عليه السلام ) يَوْمَ الْقِيَامَةِ",
          "en": "HADEETH OF NOAH<sup>as</sup> ON THE DAY OF JUDGEMENT"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:45",
    "titles": {
      "ar": "حَدِيثُ أَبِي ذَرٍّ رَضِيَ اللَّهُ عَنْهُ",
      "en": "HADEETH OF ABU DHARR<sup>ar</sup>"
    },
    "verse_count": 20,
    "verse_start_index": 15141,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 354)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 403)"
        ],
        "index": 15142,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:45:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14905</span>- أَبُو عَلِيٍّ الْأَشْعَرِيُّ</span> عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ سَلَمَةَ اللُّؤْلُؤِيِّ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ أَ لَا أُخْبِرُكُمْ كَيْفَ كَانَ إِسْلَامُ سَلْمَانَ وَ أَبِي ذَرٍّ فَقَالَ الرَّجُلُ وَ أَخْطَأَ أَمَّا إِسْلَامُ سَلْمَانَ فَقَدْ عَرَفْتُهُ فَأَخْبِرْنِي بِإِسْلَامِ أَبِي ذَرٍّ فَقَالَ إِنَّ أَبَا ذَرٍّ كَانَ فِي بَطْنِ مَرٍّ يَرْعَى غَنَماً لَهُ فَأَتَى ذِئْبٌ عَنْ يَمِينِ غَنَمِهِ فَهَشَّ بِعَصَاهُ عَلَى الذِّئْبِ فَجَاءَ الذِّئْبُ عَنْ شِمَالِهِ فَهَشَّ عَلَيْهِ أَبُو ذَرٍّ ثُمَّ قَالَ لَهُ أَبُو ذَرٍّ مَا رَأَيْتُ ذِئْباً أَخْبَثَ مِنْكَ وَ لَا شَرّاً فَقَالَ لَهُ الذِّئْبُ شَرٌّ وَ اللَّهِ مِنِّي أَهْلُ مَكَّةَ بَعَثَ اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِمْ نَبِيّاً فَكَذَّبُوهُ وَ شَتَمُوهُ فَوَقَعَ فِي أُذُنِ أَبِي ذَرٍّ ",
          "فَقَالَ لِامْرَأَتِهِ هَلُمِّي مِزْوَدِي وَ إِدَاوَتِي وَ عَصَايَ ثُمَّ خَرَجَ عَلَى رِجْلَيْهِ يُرِيدُ مَكَّةَ لِيَعْلَمَ خَبَرَ الذِّئْبِ وَ مَا أَتَاهُ بِهِ حَتَّى بَلَغَ مَكَّةَ فَدَخَلَهَا فِي سَاعَةٍ حَارَّةٍ وَ قَدْ تَعِبَ وَ نَصِبَ فَأَتَى زَمْزَمَ وَ قَدْ عَطِشَ فَاغْتَرَفَ دَلْواً فَخَرَجَ لَبَنٌ فَقَالَ فِي نَفْسِهِ هَذَا وَ اللَّهِ يَدُلُّنِي عَلَى أَنَّ مَا خَبَّرَنِي الذِّئْبُ وَ مَا جِئْتُ لَهُ حَقٌّ فَشَرِبَ وَ جَاءَ إِلَى جَانِبٍ مِنْ جَوَانِبِ الْمَسْجِدِ فَإِذَا حَلْقَةٌ مِنْ قُرَيْشٍ فَجَلَسَ إِلَيْهِمْ فَرَآهُمْ يَشْتِمُونَ النَّبِيَّ (صلى الله عليه وآله) كَمَا قَالَ الذِّئْبُ",
          "فَمَا زَالُوا فِي ذَلِكَ مِنْ ذِكْرِ النَّبِيِّ (صلى الله عليه وآله) وَ الشَّتْمِ لَهُ حَتَّى جَاءَ أَبُو طَالِبٍ مِنْ آخِرِ النَّهَارِ فَلَمَّا رَأَوْهُ قَالَ بَعْضُهُمْ لِبَعْضٍ كُفُّوا فَقَدْ جَاءَ عَمُّهُ قَالَ فَكَفُّوا فَمَا زَالَ يُحَدِّثُهُمْ وَ يُكَلِّمُهُمْ حَتَّى كَانَ آخِرُ النَّهَارِ ثُمَّ قَامَ وَ قُمْتُ عَلَى أَثَرِهِ فَالْتَفَتَ إِلَيَّ فَقَالَ اذْكُرْ حَاجَتَكَ فَقُلْتُ هَذَا النَّبِيُّ الْمَبْعُوثُ فِيكُمْ قَالَ وَ مَا تَصْنَعُ بِهِ قُلْتُ أُومِنُ بِهِ وَ أُصَدِّقُهُ وَ أَعْرِضُ عَلَيْهِ نَفْسِي وَ لَا يَأْمُرُنِي بِشَيْ‏ءٍ إِلَّا أَطَعْتُهُ فَقَالَ وَ تَفْعَلُ فَقُلْتُ نَعَمْ قَالَ فَتَعَالَ غَداً فِي هَذَا الْوَقْتِ إِلَيَّ حَتَّى أَدْفَعَكَ إِلَيْهِ ",
          "قَالَ بِتُّ تِلْكَ اللَّيْلَةَ فِي الْمَسْجِدِ حَتَّى إِذَا كَانَ الْغَدُ جَلَسْتُ مَعَهُمْ فَمَا زَالُوا فِي ذِكْرِ النَّبِيِّ (صلى الله عليه وآله) وَ شَتْمِهِ حَتَّى إِذَا طَلَعَ أَبُو طَالِبٍ فَلَمَّا رَأَوْهُ قَالَ بَعْضُهُمْ لِبَعْضٍ أَمْسِكُوا فَقَدْ جَاءَ عَمُّهُ فَأَمْسَكُوا فَمَا زَالَ يُحَدِّثُهُمْ حَتَّى قَامَ فَتَبِعْتُهُ فَسَلَّمْتُ عَلَيْهِ فَقَالَ اذْكُرْ حَاجَتَكَ فَقُلْتُ النَّبِيُّ الْمَبْعُوثُ فِيكُمْ قَالَ وَ مَا تَصْنَعُ بِهِ فَقُلْتُ أُومِنُ بِهِ وَ أُصَدِّقُهُ وَ أَعْرِضُ عَلَيْهِ نَفْسِي وَ لَا يَأْمُرُنِي بِشَيْ‏ءٍ إِلَّا أَطَعْتُهُ قَالَ وَ تَفْعَلُ قُلْتُ نَعَمْ",
          "فَقَالَ قُمْ مَعِي فَتَبِعْتُهُ فَدَفَعَنِي إِلَى بَيْتٍ فِيهِ حَمْزَةُ (عليه السلام) فَسَلَّمْتُ عَلَيْهِ وَ جَلَسْتُ فَقَالَ لِي مَا حَاجَتُكَ فَقُلْتُ هَذَا النَّبِيُّ الْمَبْعُوثُ فِيكُمْ فَقَالَ وَ مَا حَاجَتُكَ إِلَيْهِ قُلْتُ أُومِنُ بِهِ وَ أُصَدِّقُهُ وَ أَعْرِضُ عَلَيْهِ نَفْسِي وَ لَا يَأْمُرُنِي بِشَيْ‏ءٍ إِلَّا أَطَعْتُهُ فَقَالَ تَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ قَالَ فَشَهِدْتُ ",
          "قَالَ فَدَفَعَنِي حَمْزَةُ إِلَى بَيْتٍ فِيهِ جَعْفَرٌ (عليه السلام) فَسَلَّمْتُ عَلَيْهِ وَ جَلَسْتُ فَقَالَ لِي جَعْفَرٌ (عليه السلام) مَا حَاجَتُكَ فَقُلْتُ هَذَا النَّبِيُّ الْمَبْعُوثُ فِيكُمْ قَالَ وَ مَا حَاجَتُكَ إِلَيْهِ فَقُلْتُ أُومِنُ بِهِ وَ أُصَدِّقُهُ وَ أَعْرِضُ عَلَيْهِ نَفْسِي وَ لَا يَأْمُرُنِي بِشَيْ‏ءٍ إِلَّا أَطَعْتُهُ فَقَالَ تَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ قَالَ فَشَهِدْتُ",
          "فَدَفَعَنِي إِلَى بَيْتٍ فِيهِ عَلِيٌّ (عليه السلام) فَسَلَّمْتُ وَ جَلَسْتُ فَقَالَ مَا حَاجَتُكَ فَقُلْتُ هَذَا النَّبِيُّ الْمَبْعُوثُ فِيكُمْ قَالَ وَ مَا حَاجَتُكَ إِلَيْهِ قُلْتُ أُومِنُ بِهِ وَ أُصَدِّقُهُ وَ أَعْرِضُ عَلَيْهِ نَفْسِي وَ لَا يَأْمُرُنِي بِشَيْ‏ءٍ إِلَّا أَطَعْتُهُ فَقَالَ تَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ قَالَ فَشَهِدْتُ",
          "فَدَفَعَنِي إِلَى بَيْتٍ فِيهِ رَسُولُ اللَّهِ (صلى الله عليه وآله) فَسَلَّمْتُ وَ جَلَسْتُ فَقَالَ لِي رَسُولُ اللَّهِ (صلى الله عليه وآله) مَا حَاجَتُكَ قُلْتُ النَّبِيُّ الْمَبْعُوثُ فِيكُمْ قَالَ وَ مَا حَاجَتُكَ إِلَيْهِ قُلْتُ أُومِنُ بِهِ وَ أُصَدِّقُهُ وَ لَا يَأْمُرُنِي بِشَيْ‏ءٍ إِلَّا أَطَعْتُهُ فَقَالَ تَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ فَقُلْتُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ",
          "فَقَالَ لِي رَسُولُ اللَّهِ (صلى الله عليه وآله) يَا أَبَا ذَرٍّ انْطَلِقْ إِلَى بِلَادِكَ فَإِنَّكَ تَجِدُ ابْنَ عَمٍّ لَكَ قَدْ مَاتَ وَ لَيْسَ لَهُ وَارِثٌ غَيْرُكَ فَخُذْ مَالَهُ وَ أَقِمْ عِنْدَ أَهْلِكَ حَتَّى يَظْهَرَ أَمْرُنَا قَالَ فَرَجَعَ أَبُو ذَرٍّ فَأَخَذَ الْمَالَ وَ أَقَامَ عِنْدَ أَهْلِهِ حَتَّى ظَهَرَ أَمْرُ رَسُولِ اللَّهِ (صلى الله عليه وآله) ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) هَذَا حَدِيثُ أَبِي ذَرٍّ وَ إِسْلَامِهِ رَضِيَ اللَّهُ عَنْهُ وَ أَمَّا حَدِيثُ سَلْمَانَ فَقَدْ سَمِعْتَهُ فَقَالَ جُعِلْتُ فِدَاكَ حَدِّثْنِي بِحَدِيثِ سَلْمَانَ فَقَالَ قَدْ سَمِعْتَهُ وَ لَمْ يُحَدِّثْهُ لِسُوءِ أَدَبِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473587\">H 14905</a> – Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbaar, from Abdullah Bin Muhammad, from Salmat Al-Lului, from a man, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘Shall I<sup>asws</sup> not inform you of how Salman<sup>ar</sup> and Abu Dharr<sup>ar</sup> (brought Islam)?’ So a man interrupted hastily and said, ‘As for the Islam of Salman<sup>ar</sup>, so I have understood it. Inform me of the Islam of Abu Dharr<sup>ar</sup>’. So he<sup>asws</sup> said: ‘Abu Dharr<sup>ar</sup> was in the middle of tending his<sup>ar</sup> sheep when he<sup>ar</sup> saw a wolf passing by on the right of his<sup>ar</sup> sheep. So he<sup>ar</sup> chased the wolf away by his<sup>ar</sup> staff. So the wolf came from his<sup>ar</sup> right. So Abu Dharr<sup>ar</sup> chased it away. Then Abu Dharr<sup>ar</sup> said to it, ‘I<sup>ar</sup> have not seen a wolf more vicious or evil than you’. So the wolf said to him<sup>ar</sup>, ‘By Allah<sup>azwj</sup>! The people of Makkah are more evil than I am. Allah<sup>azwj</sup> Mighty and Majestic has Sent a Prophet<sup>saww</sup> to them, so they belied him<sup>saww</sup> and insulted him<sup>saww</sup>’. This reverberated in the ears of Abu Dharr<sup>ar</sup>.",
            "So he<sup>ar</sup> said to his<sup>ar</sup> wife, ‘Prepare my<sup>ar</sup> provisions and give it to me<sup>asws</sup> along with my<sup>asws</sup> walking stick’. Then he<sup>ar</sup> went out on his feet towards Makkah to know the news of what the wolf had come up with. He<sup>ar</sup> reached Makkah and entered it at a time when it was hot, and he<sup>ar</sup> was exhausted. So he<sup>ar</sup> came up to Zamzam (well) and was thirsty. He<sup>ar</sup> filled a bucket and it turned out to be milk. So he<sup>ar</sup> said to himself, ‘This evidences to me<sup>ar</sup> to what the wolf had informed me<sup>ar</sup> of and what I<sup>ar</sup> have come to is right. So he<sup>ar</sup> drank and went to a side from the sides of the Masjid. There was a group of Qureysh there, so he<sup>ar</sup> sat among them. He<sup>ar</sup> saw them insulting the Prophet<sup>saww</sup> just as the wolf had said.",
            "They did not stop mentioning the Prophet<sup>saww</sup> and insulting him<sup>saww</sup> until Abu Talib<sup>as</sup> came up at the end of the night. So when they saw him<sup>as</sup>, some of them said to the others, ‘Refrain, for his<sup>saww</sup> uncle<sup>as</sup> is coming!’ They refrained. He<sup>ar</sup> said, ‘He<sup>as</sup> did not stop narrating to them and speaking to them until it was the end of the day. Then he<sup>as</sup> stood up, and I<sup>ar</sup> arose following his<sup>as</sup> footsteps. So he<sup>as</sup> turned towards me<sup>ar</sup> and said, ‘Mention your<sup>ar</sup> need’. So I<sup>ar</sup> said, ‘This Prophet<sup>saww</sup> who has been Sent among you’. He<sup>as</sup> said: ‘And what do you want to do with him<sup>saww</sup>?’ I<sup>ar</sup> said, ‘Believe with him<sup>saww</sup>, and ratify him<sup>saww</sup> and present myself<sup>ar</sup> to him<sup>saww</sup>, and he<sup>saww</sup> will not command me<sup>ar</sup> for anything except that I<sup>ar</sup> shall obey him<sup>saww</sup>’. He<sup>as</sup> said, ‘And you<sup>ar</sup> will do it?’ I<sup>ar</sup> said, ‘Yes’. So he<sup>as</sup> said, ‘Come to me<sup>as</sup> tomorrow at this time and I<sup>as</sup> will take you<sup>ar</sup> to him<sup>saww</sup>’. ",
            "I<sup>ar</sup> waited in the Masjid that night until when it was the morning, I<sup>ar</sup> sat with them (Qureysh). They did not stop mentioning the Prophet<sup>saww</sup> and insulting him<sup>saww</sup> until Abu Talib<sup>as</sup> came over. So when they saw him<sup>as</sup>, some of them said to the others, ‘Withhold yourselves, for his<sup>saww</sup> uncle<sup>as</sup> has come’. So they withheld. He<sup>as</sup> did not stop narrating to them until he<sup>as</sup> stood up from them. So I<sup>ar</sup> followed him<sup>as</sup>. I<sup>ar</sup> greeted him<sup>as</sup>, so he<sup>as</sup> said, ‘State your<sup>ar</sup> need’. So I<sup>ar</sup> said, ‘The Prophet<sup>saww</sup>, the one Sent among you’. He<sup>as</sup> said, ‘And what will you do with him<sup>saww</sup>?’ So I<sup>ar</sup> said, ‘Believe with him<sup>saww</sup>, and ratify him<sup>saww</sup>, and present myself<sup>ar</sup> to him<sup>saww</sup>, and there is nothing that he<sup>saww</sup> will command me<sup>ar</sup> for, but that I<sup>ar</sup> will obey him<sup>saww</sup>’. He<sup>as</sup> said, ‘And you<sup>ar</sup> will do it’. I<sup>ar</sup> said, ‘Yes’. ",
            "He<sup>as</sup> said, ‘Come with me<sup>as</sup>. So I<sup>ar</sup> followed him<sup>as</sup>. He<sup>as</sup> took me<sup>ar</sup> to a house in which was Hamza<sup>as</sup>. So I<sup>ar</sup> greeted him<sup>as</sup> and sat down. He<sup>as</sup> said to me<sup>ar</sup>, ‘What is your<sup>ar</sup> need?’ I said, ‘This Prophet<sup>saww</sup> Sent among you’. So he<sup>as</sup> said, ‘So what is your<sup>ar</sup> need to him<sup>saww</sup>?’ I said, ‘Believe with him<sup>saww</sup>, and ratify him<sup>saww</sup>, and present myself<sup>ar</sup> to him<sup>saww</sup>, and he<sup>saww</sup> will not command me for anything but that I<sup>ar</sup> will obey him<sup>saww</sup>’. So he<sup>as</sup> said, ‘Do you testify that there is no god except Allah<sup>azwj</sup> and that Muhammad<sup>saww</sup> is the Rasool Allah<sup>saww</sup>?’ I<sup>ar</sup> said, ‘I<sup>ar</sup> testify’.",
            "So Hamza<sup>as</sup> took me<sup>ar</sup> to a house in which was Ja’far<sup>as</sup>. I<sup>ar</sup> greeted him<sup>as</sup>, and sat down. Ja’far<sup>as</sup> said to me, ‘What is your<sup>ar</sup> need?’ So I<sup>ar</sup> said, ‘This Prophet<sup>saww</sup> Sent among you’. He<sup>as</sup> said, ‘And what is your<sup>ar</sup> to him<sup>saww</sup>?’ So I<sup>ar</sup> said, ‘Believe with him<sup>saww</sup>, and ratify him<sup>saww</sup>, and present myself<sup>ar</sup> to him<sup>saww</sup>, and he<sup>saww</sup> will not command me<sup>ar</sup> for anything but that I<sup>ar</sup> will obey him<sup>saww</sup>’. So he<sup>as</sup> said, ‘Do you<sup>ar</sup> testify that there is no god except Allah<sup>azwj</sup>, One with no associates to Him<sup>azwj</sup>, and that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Messenger<sup>saww</sup>?’ I<sup>ar</sup> said, ‘I<sup>ar</sup> testify’.",
            "So he<sup>as</sup> took me to a house in which was Ali<sup>asws</sup>. I<sup>ar</sup> greeted him<sup>asws</sup> and sat down. So he<sup>asws</sup> said; ‘What is your need?’ I said, ‘This Prophet<sup>saww</sup> Sent among you’. He<sup>asws</sup> said: ‘And what is your<sup>ar</sup> need to him<sup>saww</sup>?’ I said, ‘Believe with him<sup>saww</sup>, and ratify him<sup>saww</sup>, and present myself<sup>ar</sup> to him<sup>saww</sup>, and there is nothing that he<sup>saww</sup> will command me<sup>ar</sup> for but I<sup>ar</sup> will obey him<sup>saww</sup>’. So he<sup>asws</sup> said, ‘Do you<sup>ar</sup> testify that there is no god except Allah<sup>azwj</sup>, and that Muhammad<sup>saww</sup> is His<sup>azwj</sup> Messenger<sup>saww</sup>?’ I said, ‘I<sup>ar</sup> testify’. ",
            "So he<sup>asws</sup> took me<sup>ar</sup> to a house in which was the Rasool Allah<sup>saww</sup>. So I<sup>ar</sup> greeted and sat down. So the Rasool Allah<sup>saww</sup> said to me<sup>ar</sup>: ‘What is your<sup>ar</sup> need?’ I<sup>ar</sup> said, ‘The Prophet<sup>saww</sup> Sent among you’. He<sup>saww</sup> said: ‘And what is your<sup>ar</sup> need to him<sup>saww</sup>?’ I<sup>ar</sup> said, ‘Believe in him<sup>saww</sup>, and ratify him<sup>saww</sup>, and he<sup>saww</sup> will not command me<sup>ar</sup> for anything but that I<sup>ar</sup> will obey him<sup>saww</sup>’. So he<sup>saww</sup> said: ‘Do you<sup>ar</sup> testify that there is no god except Allah<sup>azwj</sup> and that Muhammad<sup>saww</sup> is the Rasool Allah<sup>saww</sup>?’ So I<sup>ar</sup> said, ‘I<sup>ar</sup> testify that there is no god except Allah<sup>azwj</sup> and that Muhammad<sup>saww</sup> is the Rasool Allah<sup>saww</sup>’. ",
            "So the Rasool Allah<sup>saww</sup> said to me<sup>ar</sup>; ‘O Abu Dharr<sup>ar</sup>! Go to your city, for you<sup>ar</sup> will find that a son of your<sup>ar</sup> uncle has died and there is no inheritor for him apart from you<sup>ar</sup>. So take his wealth and stay in the presence of your<sup>ar</sup> family until our<sup>saww</sup> matter is made apparent’. So Abu Dharr<sup>ar</sup> returned, took the wealth and stayed in the presence of his family until the matter of the Rasool Allah<sup>saww</sup> was made apparent’. ",
            "So Abu Abdullah<sup>asws</sup> said; ‘This is the Hadith of Abu Dharr<sup>ar</sup> and his<sup>ar</sup> Islam, may Allah<sup>azwj</sup> be Pleased with him<sup>ar</sup>. And as for the Hadith of Salman<sup>ar</sup>, so you have heard it’. So the man said, ‘May I be sacrificed for you<sup>asws</sup>, narrate to me the Hadith of Salman<sup>ar</sup>’. He<sup>asws</sup> said; ‘You have heard it’. (The narrator) said, ‘And he<sup>asws</sup> did not narrate it due to his bad manners’. "
          ],
          "en.sarwar": [
            "458. Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Abaan Bin Usmaan, from Zurara, who has narrated the following: Abu Ja’far (a.s.) that: ‘Samama Bin Asaal was captured by the cavalry of the Prophet (saww) and the Rasool Allah (saww) had said; ‘Our Allah (azwj)! Make me (saww) to overcome Samama!’ So the Rasool Allah (saww) said to him: ‘I (saww) give you one of three choices. I (saww) could kill you’. He said, ‘Then you (saww) would have killed a great person’. He (saww) said: ‘I (saww) could ransom you’. He said, ‘Then you (saww) would find me to be expensive’. He (saww) said: ‘Or I (saww) give safety to you’. He said, ‘Then you would find me to be thankful’. He (saww) said: ‘So I (saww) give safety to you’. He said, ‘I hereby testify that there is no god except Allah (azwj), and you (saww) Muhammad (saww) are the Rasool Allah (saww), and by Allah (azwj), I knew you (saww) were the Rasool Allah (saww) when I saw you (saww), and I did not testify by it whilst I was in bondage’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 355)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15143,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:45:2",
        "text": [
          "14906- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ (عليه السلام) أَنَّ ثُمَامَةَ بْنَ أُثَالٍ أَسَرَتْهُ خَيْلُ النَّبِيِّ (صلى الله عليه وآله) وَ قَدْ كَانَ رَسُولُ اللَّهِ (صلى الله عليه وآله) قَالَ اللَّهُمَّ أَمْكِنِّي مِنْ ثُمَامَةَ فَقَالَ لَهُ رَسُولُ اللَّهِ (صلى الله عليه وآله) إِنِّي مُخَيِّرُكَ وَاحِدَةً مِنْ ثَلَاثٍ أَقْتُلُكَ قَالَ إِذاً تَقْتُلَ عَظِيماً أَوْ أُفَادِيكَ قَالَ إِذاً تَجِدَنِي غَالِياً أَوْ أَمُنُّ عَلَيْكَ قَالَ إِذاً تَجِدَنِي شَاكِراً قَالَ فَإِنِّي قَدْ مَنَنْتُ عَلَيْكَ قَالَ فَإِنِّي أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّكَ مُحَمَّدٌ رَسُولُ اللَّهِ وَ قَدْ وَ اللَّهِ عَلِمْتُ أَنَّكَ رَسُولُ اللَّهِ حَيْثُ رَأَيْتُكَ وَ مَا كُنْتُ لِأَشْهَدَ بِهَا وَ أَنَا فِي الْوَثَاقِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473588\">H 14906</a> – Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Abaan Bin Usmaan, from Zurara, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> that: ‘Samama Bin Asaal was captured by the cavalry of the Prophet<sup>saww</sup> and the Rasool Allah<sup>saww</sup> had said; ‘Our Allah<sup>azwj</sup>! Make me<sup>saww</sup> to overcome Samama!’ So the Rasool Allah<sup>saww</sup> said to him: ‘I<sup>saww</sup> give you one of three choices. I<sup>saww</sup> could kill you’. He said, ‘Then you<sup>saww</sup> would have killed a great person’. He<sup>saww</sup> said: ‘I<sup>saww</sup> could ransom you’. He said, ‘Then you<sup>saww</sup> would find me to be expensive’. He<sup>saww</sup> said: ‘Or I<sup>saww</sup> give safety to you’. He said, ‘Then you would find me to be thankful’. He<sup>saww</sup> said: ‘So I<sup>saww</sup> give safety to you’. He said, ‘I hereby testify that there is no god except Allah<sup>azwj</sup>, and you<sup>saww</sup> Muhammad<sup>saww</sup> are the Rasool Allah<sup>saww</sup>, and by Allah<sup>azwj</sup>, I knew you<sup>saww</sup> were the Rasool Allah<sup>saww</sup> when I saw you<sup>saww</sup>, and I did not testify by it whilst I was in bondage’."
          ],
          "en.sarwar": [
            "459. From him, from his father, from Ahmad Bin Muhammad, from Abaan, from Abu Baseer, who has narrated the following: Abu Ja’far (a.s.) has said: ‘When the Prophet (saww) came to this world, a man from the People of the Book went to a group from the Qureysh among whom were Hisham Bin Al-Mugheira, and Al-Waleed Bin Al-Mugheira, and Al-A’as Biin Hisham, and Abu Wajzat Bin Abu Amro Bin Umayya, and Uteyba Bin Raiya. So he said, ‘Has there been a birth tonight among you?’ They said, ‘No’. He said, ‘Then there has been born in Palestine a boy (saww). His (saww) name is Ahmad (saww). He (saww) is with a black silky mole, and there will occur destruction of the People of the Book, and the Jews by his (saww) hands. By Allah (azwj), you are mistaken, O group of Qureysh’. So they dispersed and asked around. They were informed that a boy has been born to Abdullah Bin Abdul Muttalib (as). So they sought the man, met him and said, ‘By Allah (azwj), a boy has been born among us’. He said, ‘Was it before I spoke to you, or after what I spoke to you?’ They said, ‘It was before you spoke to us’. He said, ‘Come with me until I look at him (saww). So they went and came to his (saww) mother (as). They said, ‘Bring out the boy (saww) to us until we look at him (saww)’. She (as) said, ‘By Allah (azwj), my (as) son (saww) dropped and he (saww) did not drop like the newly born drop. He (saww) leaned upon the ground by his (saww) hands, and raised his (saww) head towards the sky. So he (saww) looked at it. Then Light came out from him (saww) to the extent that I saw the castles of Basra, and heard a call in the atmosphere saying: ‘You (as) have blessed with the Chief of the community. So when you (as) pick him (saww) up say, ‘I (as) seek refuge for him (saww) with the One (azwj), from the evil of every envious one, and name him (saww) Muhammad (saww)’. The man said, ‘Bring him (saww) out’. So she (as) brought him (saww) out. He looked at him (saww), then turned him (saww) over and looked at the mole between his (saww) shoulder blades. He fell down unconscious. So they took the boy (saww), and gave him (saww) to his (saww) mother (as) and said, ‘May Allah (azwj) Bless you (as) with regards to him (saww)’. When they went out, he had regained consciousness, so they said to him, ‘What is the matter with you? Woe be unto you!’ He said, ‘The Prophet-hood has gone from the Children of Israel up to the Day of Judgement. By Allah (azwj)! This is the one who (saww) will destroy them’. The Quresyh were happy with that. So when he saw that they had become happy, he said, ‘You are becoming happy? But, by Allah (azwj), he (saww) will rob you of the power which the people of the East and the West would talk about it’. And Abu Sufyan was saying, ‘He (saww) would rob (the power) from his (saww) own city?’"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 365)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15144,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:45:3",
        "text": [
          "14907- عَنْهُ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَبَانٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ لَمَّا وُلِدَ النَّبِيُّ (صلى الله عليه وآله) جَاءَ رَجُلٌ مِنْ أَهْلِ الْكِتَابِ إِلَى مَلَإٍ مِنْ قُرَيْشٍ فِيهِمْ هِشَامُ بْنُ الْمُغِيرَةِ وَ الْوَلِيدُ بْنُ الْمُغِيرَةِ وَ الْعَاصُ بْنُ هِشَامٍ وَ أَبُو وَجْزَةَ بْنُ أَبِي عَمْرِو بْنِ أُمَيَّةَ وَ عُتْبَةُ بْنُ رَبِيعَةَ فَقَالَ أَ وُلِدَ فِيكُمْ مَوْلُودٌ اللَّيْلَةَ فَقَالُوا لَا قَالَ فَوُلِدَ إِذاً بِفِلَسْطِينَ غُلَامٌ اسْمُهُ أَحْمَدُ بِهِ شَامَةٌ كَلَوْنِ الْخَزِّ الْأَدْكَنِ وَ يَكُونُ هَلَاكُ أَهْلِ الْكِتَابِ وَ الْيَهُودِ عَلَى يَدَيْهِ قَدْ أَخْطَأَكُمْ وَ اللَّهِ يَا مَعْشَرَ قُرَيْشٍ",
          "فَتَفَرَّقُوا وَ سَأَلُوا فَأُخْبِرُوا أَنَّهُ وُلِدَ لِعَبْدِ اللَّهِ بْنِ عَبْدِ الْمُطَّلِبِ غُلَامٌ فَطَلَبُوا الرَّجُلَ فَلَقُوهُ فَقَالُوا إِنَّهُ قَدْ وُلِدَ فِينَا وَ اللَّهِ غُلَامٌ قَالَ قَبْلَ أَنْ أَقُولَ لَكُمْ أَوْ بَعْدَ مَا قُلْتُ لَكُمْ قَالُوا قَبْلَ أَنْ تَقُولَ لَنَا قَالَ فَانْطَلِقُوا بِنَا إِلَيْهِ حَتَّى نَنْظُرَ إِلَيْهِ فَانْطَلَقُوا حَتَّى أَتَوْا أُمَّهُ فَقَالُوا أَخْرِجِي ابْنَكَ حَتَّى نَنْظُرَ إِلَيْهِ فَقَالَتْ إِنَّ ابْنِي وَ اللَّهِ لَقَدْ سَقَطَ وَ مَا سَقَطَ كَمَا يَسْقُطُ الصِّبْيَانُ لَقَدِ اتَّقَى الْأَرْضَ بِيَدَيْهِ وَ رَفَعَ رَأْسَهُ إِلَى السَّمَاءِ فَنَظَرَ إِلَيْهَا ثُمَّ خَرَجَ مِنْهُ نُورٌ حَتَّى نَظَرْتُ إِلَى قُصُورِ بُصْرَى وَ سَمِعْتُ هَاتِفاً فِي الْجَوِّ يَقُولُ لَقَدْ وَلَدْتِيهِ سَيِّدَ الْأُمَّةِ فَإِذَا وَضَعْتِيهِ فَقُولِي أُعِيذُهُ بِالْوَاحِدِ مِنْ شَرِّ كُلِّ حَاسِدٍ وَ سَمِّيهِ مُحَمَّداً",
          "قَالَ الرَّجُلُ فَأَخْرِجِيهِ فَأَخْرَجَتْهُ فَنَظَرَ إِلَيْهِ ثُمَّ قَلَّبَهُ وَ نَظَرَ إِلَى الشَّامَةِ بَيْنَ كَتِفَيْهِ فَخَرَّ مَغْشِيّاً عَلَيْهِ فَأَخَذُوا الْغُلَامَ فَأَدْخَلُوهُ إِلَى أُمِّهِ وَ قَالُوا بَارَكَ اللَّهُ لَكِ فِيهِ فَلَمَّا خَرَجُوا أَفَاقَ فَقَالُوا لَهُ مَا لَكَ وَيْلَكَ قَالَ ذَهَبَتْ نُبُوَّةُ بَنِي إِسْرَائِيلَ إِلَى يَوْمِ الْقِيَامَةِ هَذَا وَ اللَّهِ مَنْ يُبِيرُهُمْ فَفَرِحَتْ قُرَيْشٌ بِذَلِكَ فَلَمَّا رَآهُمْ قَدْ فَرِحُوا قَالَ قَدْ فَرِحْتُمْ أَمَا وَ اللَّهِ لَيَسْطُوَنَّ بِكُمْ سَطْوَةً يَتَحَدَّثُ بِهَا أَهْلُ الْمَشْرِقِ وَ الْمَغْرِبِ وَ كَانَ أَبُو سُفْيَانَ يَقُولُ يَسْطُو بِمِصْرِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473589\">H 14907</a> – From him, from his father, from Ahmad Bin Muhammad, from Abaan, from Abu Baseer, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> has said: ‘When the Prophet<sup>saww</sup> came to this world, a man from the People of the Book went to a group from the Qureysh among whom were Hisham Bin Al-Mugheira, and Al-Waleed Bin Al-Mugheira, and Al-A’as Biin Hisham, and Abu Wajzat Bin Abu Amro Bin Umayya, and Uteyba Bin Raiya. So he said, ‘Has there been a birth tonight among you?’ They said, ‘No’. He said, ‘Then there has been born in Palestine a boy<sup>saww</sup>. His<sup>saww</sup> name is Ahmad<sup>saww</sup>. He<sup>saww</sup> is with a black silky mole, and there will occur destruction of the People of the Book, and the Jews by his<sup>saww</sup> hands. By Allah<sup>azwj</sup>, you are mistaken, O group of Qureysh’. ",
            "So they dispersed and asked around. They were informed that a boy has been born to Abdullah Bin Abdul Muttalib<sup>as</sup>. So they sought the man, met him and said, ‘By Allah<sup>azwj</sup>, a boy has been born among us’. He said, ‘Was it before I spoke to you, or after what I spoke to you?’ They said, ‘It was before you spoke to us’. He said, ‘Come with me until I look at him<sup>saww</sup>. So they went and came to his<sup>saww</sup> mother<sup>as</sup>. They said, ‘Bring out the boy<sup>saww</sup> to us until we look at him<sup>saww</sup>’. She<sup>as</sup> said, ‘By Allah<sup>azwj</sup>, my<sup>as</sup> son<sup>saww</sup> dropped and he<sup>saww</sup> did not drop like the newly born drop. He<sup>saww</sup> leaned upon the ground by his<sup>saww</sup> hands, and raised his<sup>saww</sup> head towards the sky. So he<sup>saww</sup> looked at it. Then Light came out from him<sup>saww</sup> to the extent that I saw the castles of Basra, and heard a call in the atmosphere saying: ‘You<sup>as</sup> have blessed with the Chief of the community. So when you<sup>as</sup> pick him<sup>saww</sup> up say, ‘I<sup>as</sup> seek refuge for him<sup>saww</sup> with the One<sup>azwj</sup>, from the evil of every envious one, and name him<sup>saww</sup> Muhammad<sup>saww</sup>’. ",
            "The man said, ‘Bring him<sup>saww</sup> out’. So she<sup>as</sup> brought him<sup>saww</sup> out. He looked at him<sup>saww</sup>, then turned him<sup>saww</sup> over and looked at the mole between his<sup>saww</sup> shoulder blades. He fell down unconscious. So they took the boy<sup>saww</sup>, and gave him<sup>saww</sup> to his<sup>saww</sup> mother<sup>as</sup> and said, ‘May Allah<sup>azwj</sup> Bless you<sup>as</sup> with regards to him<sup>saww</sup>’. When they went out, he had regained consciousness, so they said to him, ‘What is the matter with you? Woe be unto you!’ He said, ‘The Prophet-hood has gone from the Children of Israel up to the Day of Judgement. By Allah<sup>azwj</sup>! This is the one who<sup>saww</sup> will destroy them’. The Quresyh were happy with that. So when he saw that they had become happy, he said, ‘You are becoming happy? But, by Allah<sup>azwj</sup>, he<sup>saww</sup> will rob you of the power which the people of the East and the West would talk about it’. And Abu Sufyan was saying, ‘He<sup>saww</sup> would rob (the power) from his<sup>saww</sup> own city?’ "
          ],
          "en.sarwar": [
            "460. Humeyd Bin Ziyad, from Muhammad Bin Ayyub, from Muhammad Bin Ziyad, from Asbaat Bin Saalim, who has narrated the following: Abu Abdullah (a.s.) having said: ‘When Aamina Bint Wahab (as) went behind the curtain, and was taken before the ‘nazool’ of the Prophet (saww), Fatima Bin Asad (as) the wife of Abu Talib (as) was present with her (as). She (as) did not cease to be with her (as) until she (sa) was blessed. So one of them (as) said to the other (as), ‘Did you (as) see what I (as) saw?’ She (as) said, ‘And what did you (as) see?’ She (as) said, ‘This light which has brightened up what is in between the East and the West and what is in between the two as well’. Then Abu Talib (as) came up to them (as) and said to them (as) both, ‘What is the matter with you (as) two? Which thing has astounded you (as) two?’ So Fatima (as) informed him (as) of the light which she (as) had seen. So Abu Talib (as) said to her (as), ‘Indeed! I (as) give you (as) good news!’ She (as) said, ‘Yes’. So he (as) said, ‘You (as) will be blessed with the one (a.s.) who will be the successor (a.s.) of this newborn (saww)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 383)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15145,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:45:4",
        "text": [
          "14908- حُمَيْدُ بْنُ زِيَادٍ عَنْ مُحَمَّدِ بْنِ أَيُّوبَ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ أَسْبَاطِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ كَانَ حَيْثُ طُلِقَتْ آمِنَةُ بِنْتُ وَهْبٍ وَ أَخَذَهَا الْمَخَاضُ بِالنَّبِيِّ (صلى الله عليه وآله) حَضَرَتْهَا فَاطِمَةُ بِنْتُ أَسَدٍ امْرَأَةُ أَبِي طَالِبٍ فَلَمْ تَزَلْ مَعَهَا حَتَّى وَضَعَتْ فَقَالَتْ إِحْدَاهُمَا لِلْأُخْرَى هَلْ تَرَيْنَ مَا أَرَى فَقَالَتْ وَ مَا تَرَيْنَ قَالَتْ هَذَا النُّورَ الَّذِي قَدْ سَطَعَ مَا بَيْنَ الْمَشْرِقِ وَ الْمَغْرِبِ فَبَيْنَمَا هُمَا كَذَلِكَ إِذْ دَخَلَ عَلَيْهِمَا أَبُو طَالِبٍ فَقَالَ لَهُمَا مَا لَكُمَا مِنْ أَيِّ شَيْ‏ءٍ تَعْجَبَانِ فَأَخْبَرَتْهُ فَاطِمَةُ بِالنُّورِ الَّذِي قَدْ رَأَتْ فَقَالَ لَهَا أَبُو طَالِبٍ أَ لَا أُبَشِّرُكِ فَقَالَتْ بَلَى فَقَالَ أَمَا إِنَّكِ سَتَلِدِينَ غُلَاماً يَكُونُ وَصِيَّ هَذَا الْمَوْلُودِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473590\">H 14908</a> – Humeyd Bin Ziyad, from Muhammad Bin Ayyub, from Muhammad Bin Ziyad, from Asbaat Bin Saalim, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘When Aamina Bint Wahab<sup>as</sup> went behind the curtain, and was taken before the ‘nazool’ of the Prophet<sup>saww</sup>, Fatima Bin Asad<sup>as</sup> the wife of Abu Talib<sup>as</sup> was present with her<sup>as</sup>. She<sup>as</sup> did not cease to be with her<sup>as</sup> until she<sup>sa</sup> was blessed. So one of them<sup>as</sup> said to the other<sup>as</sup>, ‘Did you<sup>as</sup> see what I<sup>as</sup> saw?’ She<sup>as</sup> said, ‘And what did you<sup>as</sup> see?’ She<sup>as</sup> said, ‘This light which has brightened up what is in between the East and the West and what is in between the two as well’. Then Abu Talib<sup>as</sup> came up to them<sup>as</sup> and said to them<sup>as</sup> both, ‘What is the matter with you<sup>as</sup> two? Which thing has astounded you<sup>as</sup> two?’ So Fatima<sup>as</sup> informed him<sup>as</sup> of the light which she<sup>as</sup> had seen. So Abu Talib<sup>as</sup> said to her<sup>as</sup>, ‘Indeed! I<sup>as</sup> give you<sup>as</sup> good news!’ She<sup>as</sup> said, ‘Yes’. So he<sup>as</sup> said, ‘You<sup>as</sup> will be blessed with the one<sup>asws</sup> who will be the successor<sup>asws</sup> of this newborn<sup>saww</sup>’."
          ],
          "en.sarwar": [
            "461. Muhammad Bin Ahmad, from Abdullah Bin Al-Salt, from Yunus, and from Abdul Aziz Bin Al-Muhtady, from a man, who has narrated the following: Abu Al-Hassan the Last (a.s.) regarding the Statement of the High: “[57:11] Who is he that will Loan to Allah a beautiful loan? for (Allah) will increase it manifold to his credit, and he will have (besides) a liberal Reward”, he (a.s.) said; ‘It is the ‘good’ towards the Imam (a.s.) during the government of the mischief’."
          ]
        }
      },
      {
        "gradings": [
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15146,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:45:5",
        "text": [
          "14909- مُحَمَّدُ بْنُ أَحْمَدَ عَنْ عَبْدِ اللَّهِ بْنِ الصَّلْتِ عَنْ يُونُسَ وَ عَنْ عَبْدِ الْعَزِيزِ بْنِ الْمُهْتَدِي عَنْ رَجُلٍ عَنْ أَبِي الْحَسَنِ الْمَاضِي (عليه السلام) فِي قَوْلِهِ تَعَالَى مَنْ ذَا الَّذِي يُقْرِضُ اللَّهَ قَرْضاً حَسَناً فَيُضاعِفَهُ لَهُ وَ لَهُ أَجْرٌ كَرِيمٌ قَالَ <span style=\"text-decoration: underline\">صِلَةُ</span> الْإِمَامِ فِي دَوْلَةِ الْفَسَقَةِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473591\">H 14909</a> – Muhammad Bin Ahmad, from Abdullah Bin Al-Salt, from Yunus, and from Abdul Aziz Bin Al-Muhtady, from a man, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Al-Hassan the Last</span><sup>asws</sup> regarding the Statement of the High: <span class=\"ibTxt\">“[57:11] Who is he that will Loan to Allah a beautiful loan? for (Allah) will increase it manifold to his credit, and he will have (besides) a liberal Reward”</span>, he<sup>asws</sup> said; ‘It is the ‘good’ towards the Imam<sup>asws</sup> during the government of the mischief’."
          ],
          "en.sarwar": [
            "462. Yunus, from Sinan Bin Tareyf who said: I heard Abu Abdullah (a.s.) saying: ‘It is befitting for ‘لِلْمُؤْمِنِ’ the Believer that he should fear Allah (azwj) with such a fear as if he is overlooking upon the Fire, and hope with such a hope as if he is from the inhabitants of the Paradise’. Then said: ‘Allah (azwj) is with the expectation of His (azwj) servant. If he expects good, so it will be good, and if he expects evil, so it will be evil’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على الشهور</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 384)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15147,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:45:6",
        "text": [
          "14910- يُونُسُ عَنْ سِنَانِ بْنِ طَرِيفٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ يَنْبَغِي لِلْمُؤْمِنِ أَنْ يَخَافَ اللَّهَ تَبَارَكَ وَ تَعَالَى خَوْفاً كَأَنَّهُ مُشْرِفٌ عَلَى النَّارِ وَ يَرْجُوَهُ رَجَاءً كَأَنَّهُ مِنْ أَهْلِ الْجَنَّةِ ثُمَّ قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ عِنْدَ ظَنِّ عَبْدِهِ إِنْ خَيْراً فَخَيْراً وَ إِنْ شَرّاً فَشَرّاً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473592\">H 14910</a> – Yunus, from Sinan Bin Tareyf who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘It is befitting for ‘لِلْمُؤْمِنِ’ the Believer that he should fear Allah<sup>azwj</sup> with such a fear as if he is overlooking upon the Fire, and hope with such a hope as if he is from the inhabitants of the Paradise’. Then said: ‘Allah<sup>azwj</sup> is with the expectation of His<sup>azwj</sup> servant. If he expects good, so it will be good, and if he expects evil, so it will be evil’."
          ],
          "en.sarwar": [
            "463. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Sinan, from Ismail Bin Jabir who said: I was in the presence of Abu Abdullah (a.s.) at Makkah when a messenger from Al-Medina came to him (a.s.). So he (a.s.) said to him: ‘Who did you come with?’ He said, ‘I had no one to accompany me’. Abu Abdullah (a.s.) said to him: ‘But, if I (a.s.) had come to see you, I (a.s.) would have educated you of well manners’. Then said: ‘One is a Satan (la), and two are Satans (la), and three are a company, and four are friends’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 385)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15148,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:45:7",
        "text": [
          "14911- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ سِنَانٍ عَنْ إِسْمَاعِيلَ بْنِ جَابِرٍ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ (عليه السلام) بِمَكَّةَ إِذْ جَاءَهُ رَسُولٌ مِنَ الْمَدِينَةِ فَقَالَ لَهُ مَنْ صَحِبْتَ قَالَ مَا صَحِبْتُ أَحَداً فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ (عليه السلام) أَمَا لَوْ كُنْتُ تَقَدَّمْتُ إِلَيْكَ لَأَحْسَنْتُ أَدَبَكَ ثُمَّ قَالَ وَاحِدٌ شَيْطَانٌ وَ اثْنَانِ شَيْطَانَانِ وَ ثَلَاثٌ صَحْبٌ وَ أَرْبَعَةٌ رُفَقَاءُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473593\">H 14911</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Sinan, from Ismail Bin Jabir who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> was in the presence</span> of Abu Abdullah<sup>asws</sup> at Makkah when a messenger from Al-Medina came to him<sup>asws</sup>. So he<sup>asws</sup> said to him: ‘Who did you come with?’ He said, ‘I had no one to accompany me’. Abu Abdullah<sup>asws</sup> said to him: ‘But, if I<sup>asws</sup> had come to see you, I<sup>asws</sup> would have educated you of well manners’. Then said: ‘One is a Satan<sup>la</sup>, and two are Satans<sup>la</sup>, and three are a company, and four are friends’."
          ],
          "en.sarwar": [
            "464. From him, from Ahmad, from Al-Husayn Bin Sayf, from his brother Ali, from his father, from a man from the Clan of Nowfal Bin Abdul Muttalib who said: Abu Ja’far Muhammad Bin Ali (a.s.) said: ‘The Rasool Allah (saww) said: ‘The most beloved company to Allah (azwj) is four (in number), and a group does not exceed seven except the frequency of the noise’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 385)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15149,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:45:8",
        "text": [
          "14912- عَنْهُ عَنْ أَحْمَدَ عَنِ الْحُسَيْنِ بْنِ سَيْفٍ عَنْ أَخِيهِ عَلِيٍّ عَنْ أَبِيهِ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنِي رَجُلٌ مِنْ بَنِي نَوْفَلِ بْنِ عَبْدِ الْمُطَّلِبِ قَالَ حَدَّثَنَا أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ عَلِيٍّ (عليه السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) أَحَبُّ الصَّحَابَةِ إِلَى اللَّهِ أَرْبَعَةٌ وَ مَا زَادَ قَوْمٌ عَلَى سَبْعَةٍ إِلَّا كَثُرَ لَغَطُهُمْ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473594\">H 14912</a> – From him, from Ahmad, from Al-Husayn Bin Sayf, from his brother Ali, from his father, from a man from the Clan of Nowfal Bin Abdul Muttalib who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far Muhammad</span> Bin Ali<sup>asws</sup> said: ‘The Rasool Allah<sup>saww</sup> said: ‘The most beloved company to Allah<sup>azwj</sup> is four (in number), and a group does not exceed seven except the frequency of the noise’."
          ],
          "en.sarwar": [
            "465. A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from the one whom he mentioned: Abu Al-Hassan Musa (a.s.) has narrated from his (a.s.) father (a.s.), from his (a.s.) grandfather (a.s.) regarding the will of the Rasool Allah (saww) to Ali (a.s.): ‘Do not go out alone on a journey for the Satan (la) would be with the loner, and he (la) is (also) with the two but further away. O Ali (a.s.)! If the man travels alone he is misguided, and two are (also) misguided, and the three is a group’. He (the narrator) said, ‘And some of them are reporting: ‘For travelling’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 386)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15150,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:45:9",
        "text": [
          "14913- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَمَّنْ ذَكَرَهُ عَنْ أَبِي الْحَسَنِ مُوسَى (عليه السلام) عَنْ أَبِيهِ عَنْ جَدِّهِ (عليهما السلام) فِي وَصِيَّةِ رَسُولِ اللَّهِ (صلى الله عليه وآله) لِعَلِيٍّ (عليه السلام) لَا تَخْرُجْ فِي سَفَرٍ وَحْدَكَ فَإِنَّ الشَّيْطَانَ مَعَ الْوَاحِدِ وَ هُوَ مِنَ الِاثْنَيْنِ أَبْعَدُ يَا عَلِيُّ إِنَّ الرَّجُلَ إِذَا سَافَرَ وَحْدَهُ فَهُوَ غَاوٍ وَ الِاثْنَانِ غَاوِيَانِ وَ الثَّلَاثَةُ نَفَرٌ قَالَ وَ رَوَى بَعْضُهُمْ سَفْرٌ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473595\">H 14913</a> – A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from the one whom he mentioned:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Al-Hassan Musa</span><sup>asws</sup> has narrated from his<sup>asws</sup> father<sup>asws</sup>, from his<sup>asws</sup> grandfather<sup>asws</sup> regarding the will of the Rasool Allah<sup>saww</sup> to Ali<sup>asws</sup>: ‘Do not go out alone on a journey for the Satan<sup>la</sup> would be with the loner, and he<sup>la</sup> is (also) with the two but further away. O Ali<sup>asws</sup>! If the man travels alone he is misguided, and two are (also) misguided, and the three is a group’. He (the narrator) said, ‘And some of them are reporting: ‘For travelling’.  "
          ],
          "en.sarwar": [
            "466. Ali Bin Ibrahim, from his father, from Al-Qasim Bin Muhammad, and Ali Bin Muhammad Al-Qasany, from Suleyman Bin Dawood, from Hammaad Bin Isa, who has narrated the following: Abu Abdullah (a.s.) having said: ‘Luqman (as) advised his (as) son: ‘O my (as) son! Travel with your sword, and your slippers, and your turban, and your tent, and your water container, and your needle, and your threads, and your shoe-repair kit, and your provision of medicines which are beneficial for you and the one is with you. And be in concordance with your companion except if it is in the disobedience to Allah (azwj) Mighty and Majestic’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على الشهور</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 386)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15151,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:45:10",
        "text": [
          "14914- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ وَ عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ فِي وَصِيَّةِ لُقْمَانَ لِابْنِهِ يَا بُنَيَّ سَافِرْ بِسَيْفِكَ وَ خُفِّكَ وَ عِمَامَتِكَ وَ خِبَائِكَ وَ سِقَائِكَ وَ إِبْرَتِكَ وَ خُيُوطِكَ وَ مِخْرَزِكَ وَ تَزَوَّدْ مَعَكَ مِنَ الْأَدْوِيَةِ مَا تَنْتَفِعُ بِهَا أَنْتَ وَ مَنْ مَعَكَ وَ كُنْ لِأَصْحَابِكَ مُوَافِقاً إِلَّا فِي مَعْصِيَةِ اللَّهِ عَزَّ وَ جَلَّ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473596\">H 14914</a> – Ali Bin Ibrahim, from his father, from Al-Qasim Bin Muhammad, and Ali Bin Muhammad Al-Qasany, from Suleyman Bin Dawood, from Hammaad Bin Isa, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘Luqman<sup>as</sup> advised his<sup>as</sup> son: ‘O my<sup>as</sup> son! Travel with your sword, and your slippers, and your turban, and your tent, and your water container, and your needle, and your threads, and your shoe-repair kit, and your provision of medicines which are beneficial for you and the one is with you. And be in concordance with your companion except if it is in the disobedience to Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "467. Ali, from his father, from Al-Nowfaly, from Al-Sakuny, who has narrated the following: Abu Abdullah (a.s.), from his forefathers (a.s.) having said: ‘The Rasool Allah (saww) said: ‘It is from the nobility of the man that he would have good provisions when he goes out on a journey’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 386)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 403)"
        ],
        "index": 15152,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:45:11",
        "text": [
          "14915- عَلِيٌّ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) عَنْ آبَائِهِ (عليهم السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) مِنْ شَرَفِ الرَّجُلِ أَنْ يُطَيِّبَ زَادَهُ إِذَا خَرَجَ فِي سَفَرِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473597\">H 14915</a> – Ali, from his father, from Al-Nowfaly, from Al-Sakuny, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup>, from his forefathers<sup>asws</sup> having said: ‘The Rasool Allah<sup>saww</sup> said: ‘It is from the nobility of the man that he would have good provisions when he goes out on a journey’."
          ],
          "en.sarwar": [
            "468. Ali, from his father, from Ibn Abu Umeyr, from Abdullah Bin Sinan, who has narrated the following: Abu Abdullah (a.s.) having said: ‘Whenever Ali (a.s.) Bin Al-Husayn (a.s.) used to travel to the Pilgrimage and the Umra, would provide himself (a.s.) with good provisions from the almonds, and the sugar, and the roasted and sweetened stem (beans)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 386)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15153,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:45:12",
        "text": [
          "14916- عَلِيٌّ عَنْ أَبِيهِ عَنْ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ كَانَ عَلِيُّ بْنُ الْحُسَيْنِ (عليه السلام) إِذَا سَافَرَ إِلَى الْحَجِّ وَ الْعُمْرَةِ تَزَوَّدَ مِنْ أَطْيَبِ الزَّادِ مِنَ اللَّوْزِ وَ السُّكَّرِ وَ السَّوِيقِ الْمُحَمَّصِ وَ الْمُحَلَّى."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473598\">H 14916</a> – Ali, from his father, from Ibn Abu Umeyr, from Abdullah Bin Sinan, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘Whenever Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> used to travel to the Pilgrimage and the Umra, would provide himself<sup>asws</sup> with good provisions from the almonds, and the sugar, and the roasted and sweetened stem (beans)’."
          ],
          "en.sarwar": [
            "469. Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Al-Waleed Bin Sabeeh, who has narrated the following: I came up to Abu Abdullah (a.s.) one day, so he (a.s.) presented to me a piece of cloth and said: ‘O Waleed, fold this upon its corners’. So I stood up in front of him (a.s.). Abu Abdullah (a.s.) said: ‘May Allah (azwj) have Mercy on Mu‘alla Bin Khunays’. So I though he (a.s.) is comparing my standing in front of him (a.s.) with the way in which Mu‘alla Bin Khuays may have stood in front of him (a.s.). Then he (a.s.)said: ‘Ugh to the world! Ugh to the world! But rather, the world is a place of afflictions in which Allah (azwj) has Made His (azwj) enemies to overcome His (azwj) friends, but after it is a house which is not like this’. So I said, ‘May I be sacrificed for you, and where is that house?’ He (a.s.) said: ‘Over there!’ – and he (a.s.) pointed by his (a.s.) hand to the ground’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 387)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15154,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:45:13",
        "text": [
          "14917- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ الْوَلِيدِ بْنِ صَبِيحٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) أَنَّهُ قَالَ دَخَلْتُ عَلَيْهِ يَوْماً فَأَلْقَى إِلَيَّ ثِيَاباً وَ قَالَ يَا وَلِيدُ رُدَّهَا عَلَى مَطَاوِيهَا فَقُمْتُ بَيْنَ يَدَيْهِ فَقَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) رَحِمَ اللَّهُ الْمُعَلَّى بْنَ خُنَيْسٍ فَظَنَنْتُ أَنَّهُ شَبَّهَ قِيَامِي بَيْنَ يَدَيْهِ بِقِيَامِ الْمُعَلَّى بَيْنَ يَدَيْهِ ثُمَّ قَالَ أُفٍّ لِلدُّنْيَا أُفٍّ لِلدُّنْيَا إِنَّمَا الدُّنْيَا دَارُ بَلَاءٍ يُسَلِّطُ اللَّهُ فِيهَا عَدُوَّهُ عَلَى وَلِيِّهِ وَ إِنَّ بَعْدَهَا دَاراً لَيْسَتْ هَكَذَا فَقُلْتُ جُعِلْتُ فِدَاكَ وَ أَيْنَ تِلْكَ الدَّارُ فَقَالَ هَاهُنَا وَ أَشَارَ بِيَدِهِ إِلَى الْأَرْضِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473599\">H 14917</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Al-Waleed Bin Sabeeh, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> came up to Abu Abdullah</span><sup>asws</sup> one day, so he<sup>asws</sup> presented to me a piece of cloth and said: ‘O Waleed, fold this upon its corners’. So I stood up in front of him<sup>asws</sup>. Abu Abdullah<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> have Mercy on Moalla Bin Khunays’. So I though he<sup>asws</sup> is comparing my standing in front of him<sup>asws</sup> with the way in which Moalla Bin Khuays may have stood in front of him<sup>asws</sup>. Then he <sup>asws</sup>said: ‘Ugh to the world! Ugh to the world! But rather, the world is a place of afflictions in which Allah<sup>azwj</sup> has Made His<sup>azwj</sup> enemies to overcome His<sup>azwj</sup> friends, but after it is a house which is not like this’. So I said, ‘May I be sacrificed for you, and where is that house?’ He<sup>asws</sup> said: ‘Over there!’ – and he<sup>asws</sup> pointed by his<sup>asws</sup> hand to the ground’."
          ],
          "en.sarwar": [
            "470. Muhammad Bin Ahmad, from Abdullah Bin Al-Salt, from Yunus, from the one whom he mention, from Abu Baseer who said: Abu Abdullah (a.s.) said: ‘O Abu Muhammad! Allah (azwj) Mighty and Majestic has Angels who cut off the sins from the backs of our (a.s.) Shites just like the cutting by the wind of the leaves from the tree in the season of autumn and that is the Statement of the Mighty and Majestic: “[40:7] hymn the praises of their Lord and believe in Him and ask forgiveness for those who believe”, and Allah (azwj) has not Intended by this other than you’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 387)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15155,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:45:14",
        "text": [
          "14918- مُحَمَّدُ بْنُ أَحْمَدَ عَنْ عَبْدِ اللَّهِ بْنِ الصَّلْتِ عَنْ يُونُسَ عَمَّنْ ذَكَرَهُ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) يَا أَبَا مُحَمَّدٍ إِنَّ لِلَّهِ عَزَّ وَ جَلَّ مَلَائِكَةً يُسْقِطُونَ الذُّنُوبَ عَنْ ظُهُورِ شِيعَتِنَا كَمَا تُسْقِطُ الرِّيحُ الْوَرَقَ مِنَ الشَّجَرِ فِي أَوَانِ سُقُوطِهِ وَ ذَلِكَ قَوْلُهُ عَزَّ وَ جَلَّ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ... وَ يَسْتَغْفِرُونَ لِلَّذِينَ آمَنُوا وَ اللَّهِ مَا أَرَادَ بِهَذَا غَيْرَكُمْ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473600\">H 14918</a> – Muhammad Bin Ahmad, from Abdullah Bin Al-Salt, from Yunus, from the one whom he mention, from Abu Baseer who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘O Abu Muhammad! Allah<sup>azwj</sup> Mighty and Majestic has Angels who cut off the sins from the backs of our<sup>asws</sup> Shites just like the cutting by the wind of the leaves from the tree in the season of autumn and that is the Statement of the Mighty and Majestic: <span class=\"ibTxt\">“[40:7] hymn the praises of their Lord and believe in Him and ask forgiveness for those who believe”</span>, and Allah<sup>azwj</sup> has not Intended by this other than you’."
          ],
          "en.sarwar": [
            "471. Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Zurara who said, ‘Narrated to me Abu Al-Khattab in the best of conditions that: He asked Abu Abdullah (a.s.) about the Statement of Allah (azwj) Mighty and Majestic: “[39:45] And when Allah alone is mentioned, (the Imam (a.s.) said it is) by the obedience to the one (a.s.), the obedience to whom (a.s.) Allah (azwj) the One has Commanded for from the Progeny (a.s.) of Muhammad (saww) the hearts of those who do not believe in the hereafter shrink, and when there is a mention of the one, the obedience to whom Allah (azwj) has not Commanded for lo! they are joyful”."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 388)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15156,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:45:15",
        "text": [
          "14919- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ زُرَارَةَ قَالَ حَدَّثَنِي أَبُو الْخَطَّابِ فِي أَحْسَنِ مَا يَكُونُ حَالًا قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ إِذا ذُكِرَ اللَّهُ وَحْدَهُ اشْمَأَزَّتْ قُلُوبُ الَّذِينَ لا يُؤْمِنُونَ بِالْآخِرَةِ فَقَالَ وَ إِذا ذُكِرَ اللَّهُ وَحْدَهُ بِطَاعَةِ مَنْ أَمَرَ اللَّهُ بِطَاعَتِهِ مِنْ آلِ مُحَمَّدٍ اشْمَأَزَّتْ قُلُوبُ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ وَ إِذَا ذُكِرَ الَّذِينَ لَمْ يَأْمُرِ اللَّهُ بِطَاعَتِهِمْ إِذَا هُمْ يَسْتَبْشِرُونَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473601\">H 14919</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Zurara who said, ‘Narrated to me Abu Al-Khattab in the best of conditions that:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-h\">H</span>e asked Abu Abdullah</span><sup>asws</sup> about the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[39:45] And when Allah alone is mentioned,</span> (the Imam<sup>asws</sup> said it is) by the obedience to the one<sup>asws</sup>, the obedience to whom<sup>asws</sup> Allah<sup>azwj</sup> the One has Commanded for from the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> <span class=\"ibTxt\">the hearts of those who do not believe in the hereafter shrink, </span>and when there is a mention of the one, the obedience to whom Allah<sup>azwj</sup> has not Commanded for<span class=\"ibTxt\"> lo! they are joyful”</span>."
          ],
          "en.sarwar": [
            "472. Ali Bin Ibrahim, from his father, from ibn Abu Umeyr, from Ibrahim the owner of the Barley, from Kaseer Bin Kalsama, who has narrated the following: Imam (a.s.), said, regarding the Statement of Allah (azwj) Mighty and Majestic: “[2:37] Then Adam received (some) words from his Lord”, he (a.s.) said: ‘There is no god except You (azwj), Glory be to You (azwj) our Allah (azwj) and by Your (azwj) Praise, I have acted in an evil manner and have been unjust to myself, so Forgive me and You (azwj) are the best of the Forgivers. There is no god except You (azwj). Glory be to You (azwj) our Allah (azwj), and by Your (azwj) Praise. I have acted in an evil manner and have been unjust to myself, so Forgive me and be Merciful to me, and You (azwj) are the Most Merciful of the merciful ones. There is no god except You (azwj). Glory be to You (azwj) our Allah (azwj), and by Your (azwj) Praise. I have acted in an evil manner and have been unjust to myself, so Turn (with Forgiveness) to me for You (azwj) are the Merciful Forgiver’. And in another report regarding the Statement of the Mighty and Majestic: “[2:37] Then Adam received (some) words from his Lord”, he (a.s.) said: ‘He (as) asked for (forgiveness for) the sake of Muhammad (saww), and Ali (a.s.), and Al-Hassan (a.s.), and Al-Husayn (a.s.), and Fatima (a.s.)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 388)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15157,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:45:16",
        "text": [
          "14920- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ صَاحِبِ الشَّعِيرِ عَنْ كَثِيرِ بْنِ كَلْثَمَةَ عَنْ أَحَدِهِمَا (عليهما السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَتَلَقَّى آدَمُ مِنْ رَبِّهِ كَلِماتٍ قَالَ لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ اللَّهُمَّ وَ بِحَمْدِكَ عَمِلْتُ سُوءاً وَ ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي وَ أَنْتَ خَيْرُ الْغَافِرِينَ لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ اللَّهُمَّ وَ بِحَمْدِكَ عَمِلْتُ سُوءاً وَ ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي وَ ارْحَمْنِي وَ أَنْتَ أَرْحَمُ الرَّاحِمِينَ لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ اللَّهُمَّ وَ بِحَمْدِكَ عَمِلْتُ سُوءاً وَ ظَلَمْتُ نَفْسِي فَتُبْ عَلَيَّ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ ",
          "وَ فِي رِوَايَةٍ أُخْرَى فِي قَوْلِهِ عَزَّ وَ جَلَّ فَتَلَقَّى آدَمُ مِنْ رَبِّهِ كَلِماتٍ قَالَ سَأَلَهُ بِحَقِّ مُحَمَّدٍ وَ عَلِيٍّ وَ الْحَسَنِ وَ الْحُسَيْنِ وَ فَاطِمَةَ صَلَّى اللَّهُ عَلَيْهِمْ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473602\">H 14920</a> – Ali Bin Ibrahim, from his father, from ibn Abu Umeyr, from Ibrahim the owner of the Barley, from Kaseer Bin Kalsama, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span>mam</span><sup>asws</sup>, said, regarding the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[2:37] Then Adam received (some) words from his Lord”</span>, he<sup>asws</sup> said: ‘There is no god except You<sup>azwj</sup>, Glory be to You<sup>azwj</sup> our Allah<sup>azwj</sup> and by Your<sup>azwj</sup> Praise, I have acted in an evil manner and have been unjust to myself, so Forgive me and You<sup>azwj</sup> are the best of the Forgivers. There is no god except You<sup>azwj</sup>. Glory be to You<sup>azwj</sup> our Allah<sup>azwj</sup>, and by Your<sup>azwj</sup> Praise. I have acted in an evil manner and have been unjust to myself, so Forgive me and be Merciful to me, and You<sup>azwj</sup> are the Most Merciful of the merciful ones. There is no god except You<sup>azwj</sup>. Glory be to You<sup>azwj</sup> our Allah<sup>azwj</sup>, and by Your<sup>azwj</sup> Praise. I have acted in an evil manner and have been unjust to myself, so Turn (with Forgiveness) to me for You<sup>azwj</sup> are the Merciful Forgiver’.",
            "And in another report regarding the Statement of the Mighty and Majestic: <span class=\"ibTxt\">“[2:37] Then Adam received (some) words from his Lord”</span>, he<sup>asws</sup> said: ‘He<sup>as</sup> asked for (forgiveness for) the sake of Muhammad<sup>saww</sup>, and Ali<sup>asws</sup>, and Al-Hassan<sup>asws</sup>, and Al-Husayn<sup>asws</sup>, and Fatima<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "473. Muhammad Bin yahya, from Ahmad Bin Muhammad Bin Isa, and Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abu Ayyub Al-Khazzaaz, from Abu Baseer, who has narrated the following: Abu Abdullah (a.s.) having said: ‘When Ibrahim (as) saw the Kingdom of the Heavens and the earth, he (as) turned and saw a man committing adultery. So he (as) supplicated against him. He died. Then he (as) saw another one. He (as) supplicated against him, so he died as well, to the extent that he (as) saw a third one, and he (as) supplicated against him and he died too. So Allah (azwj) Revealed unto him (as): “O Ibrahim (as)! If you (as) supplicate, it would be Answered, so do not supplicate against My (azwj) servants, for if I (azwj) so Desired, I (azwj) would have never Created them. I (azwj) Created My (azwj) creation upon three categories. There is a type of servant who worships Me (azwj) and does not associate anything with Me (azwj), so I (azwj) reward him; and there is a servant who worships other than Me (azwj) so he won’t escape Me (azwj); and a servant who worships other than Me (azwj), so I (azwj) bring out from his descendants the one who would worship Me (azwj)”. Then he (as) turned, so he (as) saw a carcass on the coast of the sea, half of it was in the water and half of it in the sand. The sea lions came and ate what was in the water, then returned and he (as) saw some of them on top of the others eating each other, and the lions of the land came and ate from it. So he (as) saw some of them on top of each other, eating each other. That surprised Ibrahim (as) from what he (as) saw, and said: “[2:260] Show me, Lord, how You will raise the dead”. How do You (azwj) Bring back that which has consumed each other’. “He replied: \"Have you no faith?\" He said \"Yes, but just to reassure my heart”, meaning, until he (as) sees this like he sees all the things’. “Allah said, \"Take four birds, draw them to you, and cut their bodies to pieces. Scatter them over the mountain-tops”. So he (as) cut them and mixed them up just like this corpse has been mixed up inside the lion which some of them consumed the others “Scatter them over the mountain-tops then call them back. They will come swiftly to you”. So when he (as) called them over, they responded. And the mountains were ten in number’."
          ]
        }
      },
      {
        "gradings": [
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15158,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:45:17",
        "text": [
          "14921- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ لَمَّا رَأَى إِبْرَاهِيمُ (عليه السلام) مَلَكُوتَ السَّمَاوَاتِ وَ الْأَرْضِ الْتَفَتَ فَرَأَى رَجُلًا يَزْنِي فَدَعَا عَلَيْهِ فَمَاتَ ثُمَّ رَأَى آخَرَ فَدَعَا عَلَيْهِ فَمَاتَ حَتَّى رَأَى ثَلَاثَةً فَدَعَا عَلَيْهِمْ فَمَاتُوا",
          "فَأَوْحَى اللَّهُ عَزَّ ذِكْرُهُ إِلَيْهِ يَا إِبْرَاهِيمُ إِنَّ دَعْوَتَكَ مُجَابَةٌ فَلَا تَدْعُ عَلَى عِبَادِي فَإِنِّي لَوْ شِئْتُ لَمْ أَخْلُقْهُمْ إِنِّي خَلَقْتُ خَلْقِي عَلَى ثَلَاثَةِ أَصْنَافٍ عَبْداً يَعْبُدُنِي لَا يُشْرِكُ بِي شَيْئاً فَأُثِيبُهُ وَ عَبْداً يَعْبُدُ غَيْرِي فَلَنْ يَفُوتَنِي وَ عَبْداً عَبَدَ غَيْرِي فَأُخْرِجُ مِنْ صُلْبِهِ مَنْ يَعْبُدُنِي",
          "ثُمَّ الْتَفَتَ فَرَأَى جِيفَةً عَلَى سَاحِلِ الْبَحْرِ نِصْفُهَا فِي الْمَاءِ وَ نِصْفُهَا فِي الْبِرِّ تَجِي‏ءُ سِبَاعُ الْبَحْرِ فَتَأْكُلُ مَا فِي الْمَاءِ ثُمَّ تَرْجِعُ فَيَشُدُّ بَعْضُهَا عَلَى بَعْضٍ فَيَأْكُلُ بَعْضُهَا بَعْضاً وَ تَجِي‏ءُ سِبَاعُ الْبَرِّ فَتَأْكُلُ مِنْهَا فَيَشُدُّ بَعْضُهَا عَلَى بَعْضٍ فَيَأْكُلُ بَعْضُهَا بَعْضاً فَعِنْدَ ذَلِكَ تَعَجَّبَ إِبْرَاهِيمُ ( عليه السلام ) مِمَّا رَأَى وَ قَالَ رَبِّ أَرِنِي كَيْفَ تُحْيِ الْمَوْتى قَالَ كَيْفَ تُخْرِجُ مَا تَنَاسَلَ الَّتِي أَكَلَ بَعْضُهَا بَعْضاً قالَ أَ وَ لَمْ تُؤْمِنْ قالَ بَلى وَ لكِنْ لِيَطْمَئِنَّ قَلْبِي يَعْنِي حَتَّى أَرَى هَذَا كَمَا رَأَيْتُ الْأَشْيَاءَ كُلَّهَا قالَ فَخُذْ أَرْبَعَةً مِنَ الطَّيْرِ فَصُرْهُنَّ إِلَيْكَ ثُمَّ اجْعَلْ عَلى كُلِّ جَبَلٍ مِنْهُنَّ جُزْءاً فَقَطِّعْهُنَّ وَ اخْلِطْهُنَّ كَمَا اخْتَلَطَتْ هَذِهِ الْجِيفَةُ فِي هَذِهِ السِّبَاعِ الَّتِي أَكَلَ بَعْضُهَا بَعْضاً فَخَلَّطَ ثُمَّ جَعَلَ عَلَى كُلِّ جَبَلٍ مِنْهُنَّ جُزْءاً ثُمَّ ادْعُهُنَّ يَأْتِينَكَ سَعْياً فَلَمَّا دَعَاهُنَّ أَجَبْنَهُ وَ كَانَتِ الْجِبَالُ عَشَرَةً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473603\">H 14921</a> – Muhammad Bin yahya, from Ahmad Bin Muhammad Bin Isa, and Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abu Ayyub Al-Khazzaaz, from Abu Baseer, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘When Ibrahim<sup>as</sup> saw the Kingdom of the Heavens and the earth, he<sup>as</sup> turned and saw a man committing adultery. So he<sup>as</sup> supplicated against him. He died. Then he<sup>as</sup> saw another one. He<sup>as</sup> supplicated against him, so he died as well, to the extent that he<sup>as</sup> saw a third one, and he<sup>as</sup> supplicated against him and he died too. ",
            "So Allah<sup>azwj</sup> Revealed unto him<sup>as</sup>: “O Ibrahim<sup>as</sup>! If you<sup>as</sup> supplicate, it would be Answered, so do not supplicate against My<sup>azwj</sup> servants, for if I<sup>azwj</sup> so Desired, I<sup>azwj</sup> would have never Created them. I<sup>azwj</sup> Created My<sup>azwj</sup> creation upon three categories. There is a type of servant who worships Me<sup>azwj</sup> and does not associate anything with Me<sup>azwj</sup>, so I<sup>azwj</sup> reward him; and there is a servant who worships other than Me<sup>azwj</sup> so he won’t escape Me<sup>azwj</sup>; and a servant who worships other than Me<sup>azwj</sup>, so I<sup>azwj</sup> bring out from his descendants the one who would worship Me<sup>azwj</sup>”.",
            "Then he<sup>as</sup> turned, so he<sup>as</sup> saw a carcass on the coast of the sea, half of it was in the water and half of it in the sand. The sea lions came and ate what was in the water, then returned and he<sup>as</sup> saw some of them on top of the others eating each other, and the lions of the land came and ate from it. So he<sup>as</sup> saw some of them on top of each other, eating each other. That surprised Ibrahim<sup>as</sup> from what he<sup>as</sup> saw, and said: <span class=\"ibTxt\">“[2:260] Show me, Lord, how You will raise the dead”</span>. How do You<sup>azwj</sup> Bring back that which has consumed each other’. <span class=\"ibTxt\">“He replied: \"Have you no faith?\" He said \"Yes, but just to reassure my heart”</span>, meaning, until he<sup>as</sup> sees this like he sees all the things’. <span class=\"ibTxt\">“Allah said, \"Take four birds, draw them to you, and cut their bodies to pieces. Scatter them over the mountain-tops”</span>. So he<sup>as</sup> cut them and mixed them up just like this corpse has been mixed up inside the lion which some of them consumed the others <span class=\"bTxt\">“</span><span class=\"ibTxt\">Scatter them over the mountain-tops then call them back. They will come swiftly to you</span><span class=\"bTxt\">”</span>. So when he<sup>as</sup> called them over, they responded. And the mountains were ten in number’."
          ],
          "en.sarwar": [
            "474. Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Malik Bin Atiyya, from Suleyman Bin Khalid who said: I asked Abu Abdullah (a.s.) about the heat and the cold, from what do they emanate?’ O Abu Ayyub! Mars is a hot planet and Saturn is a cold planet. So if Mars begins to rise, the Saturn goes lower, and that is in the spring. So they do not stop being like that. Every time Mars rises a level, Saturn falls for three months until the Mars ends up high and Saturn ends up in the decline. For the Mars that is its hottest time. So when it is at the end of the summer and the beginning of the autumn, Saturn begins to ascend and the Mars begins to descend. So these two do not stop being like that. Every time Saturn rises a level, Mars declines a level, and that is at the beginning of the winter and at the end of the summer. So that is its coldest time. Every time this one rises, this one comes down, and every time this one comes down, this one rises. So if there is a cold day in the summer, so that is the action of the Moon, and if there is a hot day in the winter, so that action is due to the Sun. “[36:38] that is the ordinance of the Mighty, the Knowing” and I (a.s.) am the servant of the Lord (azwj) of the Worlds’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 399)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15159,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:45:18",
        "text": [
          "14922- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) عَنِ الْحَرِّ وَ الْبَرْدِ مِمَّا يَكُونَانِ فَقَالَ لِي يَا أَبَا أَيُّوبَ إِنَّ الْمِرِّيخَ كَوْكَبٌ حَارٌّ وَ زُحَلَ كَوْكَبٌ بَارِدٌ فَإِذَا بَدَأَ الْمِرِّيخُ فِي الِارْتِفَاعِ انْحَطَّ زُحَلُ وَ ذَلِكَ فِي الرَّبِيعِ فَلَا يَزَالَانِ كَذَلِكَ كُلَّمَا ارْتَفَعَ الْمِرِّيخُ دَرَجَةً انْحَطَّ زُحَلُ دَرَجَةً ثَلَاثَةَ أَشْهُرٍ حَتَّى يَنْتَهِيَ الْمِرِّيخُ فِي الِارْتِفَاعِ وَ يَنْتَهِيَ زُحَلُ فِي الْهُبُوطِ فَيَجْلُوَ الْمِرِّيخُ فَلِذَلِكَ يَشْتَدُّ الْحَرُّ فَإِذَا كَانَ فِي آخِرِ الصَّيْفِ وَ أَوَّلِ الْخَرِيفِ بَدَأَ زُحَلُ فِي الِارْتِفَاعِ وَ بَدَأَ الْمِرِّيخُ فِي الْهُبُوطِ فَلَا يَزَالَانِ كَذَلِكَ كُلَّمَا ارْتَفَعَ زُحَلُ دَرَجَةً انْحَطَّ الْمِرِّيخُ دَرَجَةً حَتَّى يَنْتَهِيَ الْمِرِّيخُ فِي الْهُبُوطِ وَ يَنْتَهِيَ زُحَلُ فِي الِارْتِفَاعِ فَيَجْلُوَ زُحَلُ وَ ذَلِكَ فِي أَوَّلِ الشِّتَاءِ وَ آخِرِ الْخَرِيفِ فَلِذَلِكَ يَشْتَدُّ الْبَرْدُ وَ كُلَّمَا ارْتَفَعَ هَذَا هَبَطَ هَذَا وَ كُلَّمَا هَبَطَ هَذَا ارْتَفَعَ هَذَا فَإِذَا كَانَ فِي الصَّيْفِ يَوْمٌ بَارِدٌ فَالْفِعْلُ فِي ذَلِكَ لِلْقَمَرِ وَ إِذَا كَانَ فِي الشِّتَاءِ يَوْمٌ حَارٌّ فَالْفِعْلُ فِي ذَلِكَ لِلشَّمْسِ هَذَا تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ وَ أَنَا عَبْدُ رَبِّ الْعَالَمِينَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473604\">H 14922</a> – Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Malik Bin Atiyya, from Suleyman Bin Khalid who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked Abu Abdullah</span><sup>asws</sup> about the heat and the cold, from what do they emanate?’ O Abu Ayyub! Mars is a hot planet and Saturn is a cold planet. So if Mars begins to rise, the Saturn goes lower, and that is in the spring. So they do not stop being like that. Every time Mars rises a level, Saturn falls for three months until the Mars ends up high and Saturn ends up in the decline. ",
            "For the Mars that is its hottest time. So when it is at the end of the summer and the beginning of the autumn, Saturn begins to ascend and the Mars begins to descend. So these two do not stop being like that. Every time Saturn rises a level, Mars declines a level, and that is at the beginning of the winter and at the end of the summer. So that is its coldest time. ",
            "Every time this one rises, this one comes down, and every time this one comes down, this one rises. So if there is a cold day in the summer, so that is the action of the Moon, and if there is a hot day in the winter, so that action is due to the Sun. <span class=\"ibTxt\">“[36:38] that is the ordinance of the Mighty, the Knowing” </span>and I<sup>asws</sup> am the servant of the Lord<sup>azwj</sup> of the Worlds’."
          ],
          "en.sarwar": [
            "475. A number of our companions, from Sahl Bin Ziyad, from Ja’far Bin Muhammad Al-Ashary, from Abdullah Bin Maymoun Al-Qaddaah, who has narrated the following: Abu Abdullah (a.s.) has said that the Rasool Allah (saww) said: ‘O Ali (a.s.)! The one who loves you (a.s.), then dies, so he has died. And the one who loves you (a.s.) and has not died yet, so he is awaiting. And the sun does not rise nor sets except that it comes to him with sustenance and the faith’. And in another copy (it says): ‘Light’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على الشهور</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 400)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15160,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:45:19",
        "text": [
          "14923- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الْأَشْعَرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَيْمُونٍ الْقَدَّاحِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) يَا عَلِيُّ مَنْ أَحَبَّكَ ثُمَّ مَاتَ فَقَدْ قَضَى نَحْبَهُ وَ مَنْ أَحَبَّكَ وَ لَمْ يَمُتْ فَهُوَ يَنْتَظِرُ وَ مَا طَلَعَتْ شَمْسٌ وَ لَا غَرَبَتْ إِلَّا طَلَعَتْ عَلَيْهِ بِرِزْقٍ وَ إِيمَانٍ وَ فِي نُسْخَةٍ نُورٍ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473605\">H 14923</a> – A number of our companions, from Sahl Bin Ziyad, from Ja’far Bin Muhammad Al-Ashary, from Abdullah Bin Maymoun Al-Qaddaah, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said that the Rasool Allah<sup>saww</sup> said: ‘O Ali<sup>asws</sup>! The one who loves you<sup>asws</sup>, then dies, so he has died. And the one who loves you<sup>asws</sup> and has not died yet, so he is awaiting. And the sun does not rise nor sets except that it comes to him with sustenance and the faith’. And in another copy (it says): ‘Light’. "
          ],
          "en.sarwar": [
            "476. Ali Bin Ibrahim, from his father, from Al-Nowfaly, from Al-Sakuny, who has narrated the following: Abu Abdullah (a.s.) has said that the Rasool Allah (saww) said: ‘There will come a time upon my (saww) community when they will be ugly in their inner selves and beautiful in their appearances. They will be greedy for what is in the world and will not be intending what is in the Presence of Allah (azwj), their Lord (azwj). Their Religion would have become a (matter of) show-off. Fear will not have entered into them. Allah (azwj) would Prevail over them with Punishment. So they would be supplicating by the supplication of the Drowning One (Du’a Al-Ghareek), so He (azwj) will not Answer to them’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على الشهور</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 401)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15161,
        "local_index": 20,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:45:20",
        "text": [
          "14924- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) سَيَأْتِي عَلَى أُمَّتِي زَمَانٌ تَخْبُثُ فِيهِ سَرَائِرُهُمْ وَ تَحْسُنُ فِيهِ عَلَانِيَتُهُمْ طَمَعاً فِي الدُّنْيَا وَ لَا يُرِيدُونَ بِهِ مَا عِنْدَ اللَّهِ رَبِّهِمْ يَكُونُ دِينُهُمْ رِيَاءً لَا يُخَالِطُهُمْ خَوْفٌ يَعُمُّهُمُ اللَّهُ مِنْهُ بِعِقَابٍ فَيَدْعُونَهُ دُعَاءَ الْغَرِيقِ فَلَا يَسْتَجِيبُ لَهُمْ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473606\">H 14924</a> – Ali Bin Ibrahim, from his father, from Al-Nowfaly, from Al-Sakuny, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said that the Rasool Allah<sup>saww</sup> said: ‘There will come a time upon my<sup>saww</sup> community when they will be ugly in their inner selves and beautiful in their appearances. They will be greedy for what is in the world and will not be intending what is in the Presence of Allah<sup>azwj</sup>, their Lord<sup>azwj</sup>. Their Religion would have become a (matter of) show-off. Fear will not have entered into them. Allah<sup>azwj</sup> would Prevail over them with Punishment. So they would be supplicating by the supplication of the Drowning One (Du’a Al-Ghareek), so He<sup>azwj</sup> will not Answer to them’."
          ],
          "en.sarwar": [
            "477. From him, from his father, from Al-Nowfaly, from Al-Sakuny, who has narrated the following: Abu Abdullah (a.s.) has said that the Amir-ul- Momineen (a.s.) said: ‘When the jurists and the scholars used to write to (deal with) each other, they did so in three ways, and there was no fourth. The one who thought of his Hereafter, Allah (azwj) Sufficed for his concerns of the world. And the one who corrected himself in secret, Allah (azwj) Corrected him publicly. And the one who corrected with regards to what was in between him and Allah (azwj), Allah (azwj) Blessed and High Corrected with regards to what was in between him and the people’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:45",
  "kind": "verse_list"
}