{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 46"
        },
        "path": "/books/al-kafi:8:1:46",
        "titles": {
          "ar": "حَدِيثُ الْفُقَهَاءِ وَ الْعُلَمَاءِ",
          "en": "HADEETH OF THE FUQAHA (JURISTS) AND THE ULAMA (SCHOLARS)"
        }
      }
    ],
    "index": 2317,
    "local_index": 46,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 47"
        },
        "path": "/books/al-kafi:8:1:47",
        "titles": {
          "ar": "حَدِيثُ الَّذِي أَحْيَاهُ عِيسَى ( عليه السلام )",
          "en": "HADEETH OF THE ONE WHO WAS BROUGHT BACK TO LIFE BY ISA<sup>as</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 45"
        },
        "path": "/books/al-kafi:8:1:45",
        "titles": {
          "ar": "حَدِيثُ أَبِي ذَرٍّ رَضِيَ اللَّهُ عَنْهُ",
          "en": "HADEETH OF ABU DHARR<sup>ar</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:46",
    "titles": {
      "ar": "حَدِيثُ الْفُقَهَاءِ وَ الْعُلَمَاءِ",
      "en": "HADEETH OF THE FUQAHA (JURISTS) AND THE ULAMA (SCHOLARS)"
    },
    "verse_count": 55,
    "verse_start_index": 15161,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 401)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15162,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14925</span>- عَنْهُ عَنْ أَبِيهِ</span> عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) كَانَتِ الْفُقَهَاءُ وَ الْعُلَمَاءُ إِذَا كَتَبَ بَعْضُهُمْ إِلَى بَعْضٍ كَتَبُوا بِثَلَاثَةٍ لَيْسَ مَعَهُنَّ رَابِعَةٌ مَنْ كَانَتْ هِمَّتُهُ آخِرَتَهُ كَفَاهُ اللَّهُ هَمَّهُ مِنَ الدُّنْيَا وَ مَنْ أَصْلَحَ سَرِيرَتَهُ أَصْلَحَ اللَّهُ عَلَانِيَتَهُ وَ مَنْ أَصْلَحَ فِيمَا بَيْنَهُ وَ بَيْنَ اللَّهِ عَزَّ وَ جَلَّ أَصْلَحَ اللَّهُ تَبَارَكَ وَ تَعَالَى فِيمَا بَيْنَهُ وَ بَيْنَ النَّاسِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473608\">H 14925</a> – From him, from his father, from Al-Nowfaly, from Al-Sakuny, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said that the Amir-ul- Momineen<sup>asws</sup> said: ‘When the jurists and the scholars used to write to (deal with) each other, they did so in three ways, and there was no fourth. The one who thought of his Hereafter, Allah<sup>azwj</sup> Sufficed for his concerns of the world. And the one who corrected himself in secret, Allah<sup>azwj</sup> Corrected him publicly. And the one who corrected with regards to what was in between him and Allah<sup>azwj</sup>, Allah<sup>azwj</sup> Blessed and High Corrected with regards to what was in between him and the people’. "
          ],
          "en.sarwar": [
            "478. Al-Husayn Bin Muhammad Al-Ashary, from Mu‘alla Bin Muhammad, from Ali Bin Asbaat, from Sa’daan Bin Muslim, from some of our companions, who has narrated the following: Abu Abdullah (a.s.) having said: ‘There was a man in Al-Medina who entered the Masjid of the Messenger (saww) and he said, ‘Grant me comfort in my anxiety, and company for my loneliness, and sustenance of a righteous companion’. There was a man seated in the corner of the Masjid. So he greeted him and said to him, ‘Who are you, O servant of Allah (azwj)?’ So he (ar) said: ‘I (ar) am Abu Dharr (ar)’. The man said, ‘Allah (azwj) is Great! Allah (azwj) is Great!’ So Abu Dharr (ar) said: ‘And why did you exclaim that, O servant of Allah (azwj)?’ He said, ‘I entered the Masjid, so I supplicated to Allah (azwj) Mighty and Majestic to Grant me comfort in my anxiety, and company for my loneliness, and sustenance of a righteous companion’. So Abu Dharr (ar) said to him, ‘I (ar) have more right for the exclamation than you are if I (ar) was that companion, for I (ar) heard the Rasool Allah (saww) saying: ‘I (saww) and you (ar) would be upon a canal on the Day of Judgement until the people are free from the Accounting. Arise (and leave) O servant of Allah (azwj) for the authorities have prohibited for anyone to be seated with me (ar)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على الشهور</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 402)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15163,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:2",
        "text": [
          "14926- الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ سَعْدَانَ بْنِ مُسْلِمٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ كَانَ رَجُلٌ بِالْمَدِينَةِ يَدْخُلُ مَسْجِدَ الرَّسُولِ (صلى الله عليه وآله) فَقَالَ اللَّهُمَّ آنِسْ وَحْشَتِي وَ صِلْ وَحْدَتِي وَ ارْزُقْنِي جَلِيساً صَالِحاً فَإِذَا هُوَ بِرَجُلٍ فِي أَقْصَى الْمَسْجِدِ فَسَلَّمَ عَلَيْهِ وَ قَالَ لَهُ مَنْ أَنْتَ يَا عَبْدَ اللَّهِ فَقَالَ أَنَا أَبُو ذَرٍّ فَقَالَ الرَّجُلُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ فَقَالَ أَبُو ذَرٍّ وَ لِمَ تُكَبِّرُ يَا عَبْدَ اللَّهِ فَقَالَ إِنِّي دَخَلْتُ الْمَسْجِدَ فَدَعَوْتُ اللَّهَ عَزَّ وَ جَلَّ أَنْ يُؤْنِسَ وَحْشَتِي وَ أَنْ يَصِلَ وَحْدَتِي وَ أَنْ يَرْزُقَنِي جَلِيساً صَالِحاً فَقَالَ لَهُ أَبُو ذَرٍّ أَنَا أَحَقُّ بِالتَّكْبِيرِ مِنْكَ إِذَا كُنْتُ ذَلِكَ الْجَلِيسَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ (صلى الله عليه وآله) يَقُولُ أَنَا وَ أَنْتُمْ عَلَى تُرْعَةٍ يَوْمَ الْقِيَامَةِ حَتَّى يَفْرُغَ النَّاسُ مِنَ الْحِسَابِ قُمْ يَا عَبْدَ اللَّهِ فَقَدْ نَهَى السُّلْطَانُ عَنْ مُجَالَسَتِي."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473609\">H 14926</a> – Al-Husayn Bin Muhammad Al-Ashary, from Moalla Bin Muhammad, from Ali Bin Asbaat, from Sa’daan Bin Muslim, from some of our companions, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘There was a man in Al-Medina who entered the Masjid of the Messenger<sup>saww</sup> and he said, ‘Grant me comfort in my anxiety, and company for my loneliness, and sustenance of a righteous companion’. There was a man seated in the corner of the Masjid. So he greeted him and said to him, ‘Who are you, O servant of Allah<sup>azwj</sup>?’ So he<sup>ar</sup> said: ‘I<sup>ar</sup> am Abu Dharr<sup>ar</sup>’. The man said, ‘Allah<sup>azwj</sup> is Great! Allah<sup>azwj</sup> is Great!’ So Abu Dharr<sup>ar</sup> said: ‘And why did you exclaim that, O servant of Allah<sup>azwj</sup>?’ He said, ‘I entered the Masjid, so I supplicated to Allah<sup>azwj</sup> Mighty and Majestic to Grant me comfort in my anxiety, and company for my loneliness, and sustenance of a righteous companion’. So Abu Dharr<sup>ar</sup> said to him, ‘I<sup>ar</sup> have more right for the exclamation than you are if I<sup>ar</sup> was that companion, for I<sup>ar</sup> heard the Rasool Allah<sup>saww</sup> saying: ‘I<sup>saww</sup> and you<sup>ar</sup> would be upon a canal on the Day of Judgement until the people are free from the Accounting. Arise (and leave) O servant of Allah<sup>azwj</sup> for the authorities have prohibited for anyone to be seated with me<sup>ar</sup>’. "
          ],
          "en.sarwar": [
            "479. Ali Bin Ibrahim, from his father, from Al-Nowfaly, from Al-Sakuny, who has narrated the following: Abu Abdullah (a.s.) has said that the Amir-ul- Momineen (a.s.) said: ‘The Rasool Allah (saww) said: ‘There will come upon the people a time when nothing will remain from the Quran except for its image, and nothing from Al-Islam except for its name. They will be named by it (as Muslims) but they would be far from it. Their Masjid will be well built but would be ruins in matters of guidance. The Jurists of that era would be the most evil jurists under the shadow of the sky. The strife (Fitna) would commence from them and end up to them’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 402)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15164,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:3",
        "text": [
          "14927- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) سَيَأْتِي عَلَى النَّاسِ زَمَانٌ لَا يَبْقَى مِنَ الْقُرْآنِ إِلَّا رَسْمُهُ وَ مِنَ الْإِسْلَامِ إِلَّا اسْمُهُ يُسَمَّوْنَ بِهِ وَ هُمْ أَبْعَدُ النَّاسِ مِنْهُ مَسَاجِدُهُمْ عَامِرَةٌ وَ هِيَ خَرَابٌ مِنَ الْهُدَى فُقَهَاءُ ذَلِكَ الزَّمَانِ شَرُّ فُقَهَاءَ تَحْتَ ظِلِّ السَّمَاءِ مِنْهُمْ خَرَجَتِ الْفِتْنَةُ وَ إِلَيْهِمْ تَعُودُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473610\">H 14927</a> – Ali Bin Ibrahim, from his father, from Al-Nowfaly, from Al-Sakuny, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said that the Amir-ul- Momineen<sup>asws</sup> said: ‘The Rasool Allah<sup>saww</sup> said: ‘There will come upon the people a time when nothing will remain from the Quran except for its image, and nothing from Al-Islam except for its name. They will be named by it (as Muslims) but they would be far from it. Their Masjid will be well built but would be ruins in matters of guidance. The Jurists of that era would be the most evil jurists under the shadow of the sky. The strife (Fitna) would commence from them and end up to them’."
          ],
          "en.sarwar": [
            "480. Al-Husayn Bin Muhammad Al-Ashary, from Mu‘alla Bin Muhammad, from Ali Bin Asbaat, from Muhammad Bin Al-Husayn Bin Yazeed who said: I heard Al-Ridha (a.s.) at Khurasaan and he (a.s.) was saying: ‘We (a.s.), the People (a.s.) of the Household inherited the forgiveness from the Progeny of Yaqoub (as), and we (a.s.) inherited the appreciation from the Progeny of Dawood (as)’. And I (the narrator) think that there was another statement which was forgotten by Muhammad (the narrator), so I said to him, Perhaps it is that he (a.s.) said: ‘And we (a.s.) inherited the patience from the Progeny of Ayub (as)’. He said, ‘It is befitting’. Ali Bin Asbaat said, ‘But rather, I said that because I had heard Yaqoub Bin Yaqteen narrate from some of his men, ‘When Abu Ja’far Al-Mansour went to Al-Medina in the year in which Muhammad and Ibrahim the sons of Abdullah Bin Al-Hassan were killed, he turned towards his uncle Isa Bin Ali. He said to him, ‘O Abu Al-Abbas! The commander of the faithful (the Caliph) has decided that the trees of Al-Medina be cut down, and its fountains blocked, and it be turned upside down’. He said, ‘O commander of the faithful (Caliph), this here is the son (a.s.) of your uncle Ja’far Bin Muhammad (a.s.), send for him and ask him (a.s.) of his opinion’. He (the narrator) said, ‘So he sent a message which Isa informed him (a.s.) of, and then returned back to him. So he said to him, ‘O commander of the faithful (Caliph), Dawood (as) was Granted appreciation, and Ayyub (as) was in affliction so he (as) was patient, and that Yusuf (as) forgave after being in power. So forgive, for you are from the lineage of those ones (as)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 403)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 403)"
        ],
        "index": 15165,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:4",
        "text": [
          "14928- الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ بْنِ يَزِيدَ قَالَ سَمِعْتُ الرِّضَا (عليه السلام) بِخُرَاسَانَ وَ هُوَ يَقُولُ إِنَّا أَهْلُ بَيْتٍ وَرِثْنَا الْعَفْوَ مِنْ آلِ يَعْقُوبَ وَ وَرِثْنَا الشُّكْرَ مِنْ آلِ دَاوُدَ وَ زَعَمَ أَنَّهُ كَانَ كَلِمَةً أُخْرَى وَ نَسِيَهَا مُحَمَّدٌ فَقُلْتُ لَهُ لَعَلَّهُ قَالَ وَ وَرِثْنَا الصَّبْرَ مِنْ آلِ أَيُّوبَ فَقَالَ يَنْبَغِي.",
          "قَالَ عَلِيُّ بْنُ أَسْبَاطٍ وَ إِنَّمَا قُلْتُ ذَلِكَ لِأَنِّي سَمِعْتُ يَعْقُوبَ بْنَ يَقْطِينٍ يُحَدِّثُ عَنْ بَعْضِ رِجَالِهِ قَالَ لَمَّا قَدِمَ أَبُو جَعْفَرٍ الْمَنْصُورُ الْمَدِينَةَ سَنَةَ قَتْلِ مُحَمَّدٍ وَ إِبْرَاهِيمَ ابْنَيْ عَبْدِ اللَّهِ بْنِ الْحَسَنِ الْتَفَتَ إِلَى عَمِّهِ عِيسَى بْنِ عَلِيٍّ فَقَالَ لَهُ يَا أَبَا الْعَبَّاسِ إِنَّ أَمِيرَ الْمُؤْمِنِينَ قَدْ رَأَى أَنْ يَعْضِدَ شَجَرَ الْمَدِينَةِ وَ أَنْ يُعَوِّرَ عُيُونَهَا وَ أَنْ يَجْعَلَ أَعْلَاهَا أَسْفَلَهَا فَقَالَ لَهُ يَا أَمِيرَ الْمُؤْمِنِينَ هَذَا ابْنُ عَمِّكَ جَعْفَرُ بْنُ مُحَمَّدٍ بِالْحَضْرَةِ فَابْعَثْ إِلَيْهِ فَسَلْهُ عَنْ هَذَا الرَّأْيِ ",
          "قَالَ فَبَعَثَ إِلَيْهِ فَأَعْلَمَهُ عِيسَى فَأَقْبَلَ عَلَيْهِ فَقَالَ لَهُ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّ دَاوُدَ (عليه السلام) أُعْطِيَ فَشَكَرَ وَ إِنَّ أَيُّوبَ (عليه السلام) ابْتُلِيَ فَصَبَرَ وَ إِنَّ يُوسُفَ (عليه السلام) عَفَا بَعْدَ مَا قَدَرَ فَاعْفُ فَإِنَّكَ مِنْ نَسْلِ أُولَئِكَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473611\">H 14928</a> – Al-Husayn Bin Muhammad Al-Ashary, from Moalla Bin Muhammad, from Ali Bin Asbaat, from Muhammad Bin Al-Husayn Bin Yazeed who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Al-Reza</span><sup>asws</sup> at Khurasaan and he<sup>asws</sup> was saying: ‘We<sup>asws</sup>, the People<sup>asws</sup> of the Household inherited the forgiveness from the Progeny of Yaqoub<sup>as</sup>, and we<sup>asws</sup> inherited the appreciation from the Progeny of Dawood<sup>as</sup>’. And I (the narrator) think that there was another statement which was forgotten by Muhammad (the narrator), so I said to him, Perhaps it is that he<sup>asws</sup> said: ‘And we<sup>asws</sup> inherited the patience from the Progeny of Ayub<sup>as</sup>’. He said, ‘It is befitting’.",
            "Ali Bin Asbaat said, ‘But rather, I said that because I had heard Yaqoub Bin Yaqteen narrate from some of his men, ‘When Abu Ja’far Al-Mansour went to Al-Medina in the year in which Muhammad and Ibrahim the sons of Abdullah Bin Al-Hassan were killed, he turned towards his uncle Isa Bin Ali. He said to him, ‘O Abu Al-Abbas! The commander of the faithful (the Caliph) has decided that the trees of Al-Medina be cut down, and its fountains blocked, and it be turned upside down’. He said, ‘O commander of the faithful (Caliph), this here is the son<sup>asws</sup> of your uncle Ja’far Bin Muhammad<sup>asws</sup>, send for him and ask him<sup>asws</sup> of his opinion’.  ",
            "He (the narrator) said, ‘So he sent a message which Isa informed him<sup>asws</sup> of, and then returned back to him. So he said to him, ‘O commander of the faithful (Caliph), Dawood<sup>as</sup> was Granted appreciation, and Ayyub<sup>as</sup> was in affliction so he<sup>as</sup> was patient, and that Yusuf<sup>as</sup> forgave after being in power. So forgive, for you are from the lineage of those ones<sup>as</sup>’."
          ],
          "en.sarwar": [
            "481. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Husayn Bin Saeed, from Al-Nazar Bin Suweyd, from Zur’at Bin Muhammad, from Abu Baseer, who has said: Abu Abdullah (a.s.) regarding the Statement of Allah (azwj) Mighty and Majestic: “[2:89] and before that they used to pray for victory against those who disbelieve”. He (a.s.) said: ‘The Jews had found in their Book that Muhammad (saww) would emigrate between Ayr and Ohad, so they went out look for these places. They passed by a mountain called Hadaad, so they said, ‘Hadaad and Ohad are one and the same’. So they dispersed upon that. Some of them encamped at Tayma and some of them at Fadak, and some of them at Khyber’. The ones who were at Tayma longed to be with some of their brothers. A Bedouin from Qays, passed by them so they hired (a camel) from him and he said to them, ‘I shall pass with you in between Ayr and Ohad’. They said to him, ‘When you pass by these two, point these two places out to us. So when he was in the middle of the land of Al-Medina, he said to them, ‘That is Ayr and this is Ohad’. So they descended from the backs of his camels and said, ‘We have reached where we wanted to be, therefore we do not have any need for your camels, and so you can go to wherever you like’. And they wrote to their brothers who were at Fadak and Khyber, ‘We have got to the place so come to us’. They wrote back to them, ‘We have settled in the houses and acquired assets, and there is no one closer to us than you are. So when that event transpires, we would quickly come to you’. They acquired assets in the land of Al-Medina. When their wealth increased, it (news) reached Tubba and he attacked them. They fortified themselves from him, so he surrounded them. They felt sympathetic towards the weak ones of Tubba and they would throw the dates and the barley towards them at night. So (the news of) that reached Tubba, and he sympathised with them and granted them amnesty. They came down to him. He said to them, ‘I have come to like your city and would like to reside among you’. So they said to him, ‘It is not for you to dwell in that place, for a Prophet (saww) would be emigrating and that is not for anyone until that happens’. He said to them, ‘I will leave behind among you members of my family, so when that happens, they would support him (saww) and help him (saww)’. So he left behind two tribes, Al-Aws and Al-Khazraj. So when they multiplied, they used to take the wealth of the Jews and the Jews used to say to them, ‘But, when Muhammad (saww) is Sent, he (saww) would take you all out from our houses and our wealth’. So when Allah (azwj) Mighty and Majestic Sent Muhammad (saww), the Helpers believed in him (saww), but the Jews denied him (saww), and it is the Statement of Allah (azwj) Mighty and Majestic: “[2:89] and before that they used to pray for victory against those who disbelieve, but when there came to them (Prophet) that which they did not recognize, they disbelieved in him; so Allah’s curse is on the unbelievers.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 406)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15166,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:5",
        "text": [
          "14929-  مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ زُرْعَةَ بْنِ مُحَمَّدٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ كانُوا مِنْ قَبْلُ يَسْتَفْتِحُونَ عَلَى الَّذِينَ كَفَرُوا فَقَالَ كَانَتِ الْيَهُودُ تَجِدُ فِي كُتُبِهَا أَنَّ مُهَاجَرَ مُحَمَّدٍ (صلى الله عليه وآله) مَا بَيْنَ عَيْرٍ وَ أُحُدٍ فَخَرَجُوا يَطْلُبُونَ الْمَوْضِعَ فَمَرُّوا بِجَبَلٍ يُسَمَّى حَدَاداً فَقَالُوا حَدَادٌ وَ أُحُدٌ سَوَاءٌ فَتَفَرَّقُوا عِنْدَهُ فَنَزَلَ بَعْضُهُمْ بِتَيْمَاءَ وَ بَعْضُهُمْ بِفَدَكَ وَ بَعْضُهُمْ بِخَيْبَرَ ",
          "فَاشْتَاقَ الَّذِينَ بِتَيْمَاءَ إِلَى بَعْضِ إِخْوَانِهِمْ فَمَرَّ بِهِمْ أَعْرَابِيٌّ مِنْ قَيْسٍ فَتَكَارَوْا مِنْهُ وَ قَالَ لَهُمْ أَمُرُّ بِكُمْ مَا بَيْنَ عَيْرٍ وَ أُحُدٍ فَقَالُوا لَهُ إِذَا مَرَرْتَ بِهِمَا فَآذِنَّا بِهِمَا فَلَمَّا تَوَسَّطَ بِهِمْ أَرْضَ الْمَدِينَةِ قَالَ لَهُمْ ذَاكَ عَيْرٌ وَ هَذَا أُحُدٌ فَنَزَلُوا عَنْ ظَهْرِ إِبِلِهِ وَ قَالُوا قَدْ أَصَبْنَا بُغْيَتَنَا فَلَا حَاجَةَ لَنَا فِي إِبِلِكَ فَاذْهَبْ حَيْثُ شِئْتَ وَ كَتَبُوا إِلَى إِخْوَانِهِمُ الَّذِينَ بِفَدَكَ وَ خَيْبَرَ أَنَّا قَدْ أَصَبْنَا الْمَوْضِعَ فَهَلُمُّوا إِلَيْنَا فَكَتَبُوا إِلَيْهِمْ أَنَّا قَدِ اسْتَقَرَّتْ بِنَا الدَّارُ وَ اتَّخَذْنَا الْأَمْوَالَ وَ مَا أَقْرَبَنَا مِنْكُمْ فَإِذَا كَانَ ذَلِكَ فَمَا أَسْرَعَنَا إِلَيْكُمْ ",
          "فَاتَّخَذُوا بِأَرْضِ الْمَدِينَةِ الْأَمْوَالَ فَلَمَّا كَثُرَتْ أَمْوَالُهُمْ بَلَغَ تُبَّعَ فَغَزَاهُمْ فَتَحَصَّنُوا مِنْهُ فَحَاصَرَهُمْ وَ كَانُوا يَرِقُّونَ لِضُعَفَاءِ أَصْحَابِ تُبَّعٍ فَيُلْقُونَ إِلَيْهِمْ بِاللَّيْلِ التَّمْرَ وَ الشَّعِيرَ فَبَلَغَ ذَلِكَ تُبَّعَ فَرَقَّ لَهُمْ وَ آمَنَهُمْ فَنَزَلُوا إِلَيْهِ فَقَالَ لَهُمْ إِنِّي قَدِ اسْتَطَبْتُ بِلَادَكُمْ وَ لَا أَرَانِي إِلَّا مُقِيماً فِيكُمْ فَقَالُوا لَهُ إِنَّهُ لَيْسَ ذَاكَ لَكَ إِنَّهَا مُهَاجَرُ نَبِيٍّ وَ لَيْسَ ذَلِكَ لِأَحَدٍ حَتَّى يَكُونَ ذَلِكَ فَقَالَ لَهُمْ إِنِّي مُخَلِّفٌ فِيكُمْ مِنْ أُسْرَتِي مَنْ إِذَا كَانَ ذَلِكَ سَاعَدَهُ وَ نَصَرَهُ ",
          "فَخَلَّفَ حَيَّيْنِ الْأَوْسَ وَ الْخَزْرَجَ فَلَمَّا كَثُرُوا بِهَا كَانُوا يَتَنَاوَلُونَ أَمْوَالَ الْيَهُودِ وَ كَانَتِ الْيَهُودُ تَقُولُ لَهُمْ أَمَا لَوْ قَدْ بُعِثَ مُحَمَّدٌ لَيُخْرِجَنَّكُمْ مِنْ دِيَارِنَا وَ أَمْوَالِنَا فَلَمَّا بَعَثَ اللَّهُ عَزَّ وَ جَلَّ مُحَمَّداً (صلى الله عليه وآله) آمَنَتْ بِهِ الْأَنْصَارُ وَ كَفَرَتْ بِهِ الْيَهُودُ وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ كانُوا مِنْ قَبْلُ يَسْتَفْتِحُونَ عَلَى الَّذِينَ كَفَرُوا فَلَمَّا جاءَهُمْ ما عَرَفُوا كَفَرُوا بِهِ فَلَعْنَةُ اللَّهِ عَلَى الْكافِرِينَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473612\">H 14929</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Husayn Bin Saeed, from Al-Nazar Bin Suweyd, from Zur’at Bin Muhammad, from Abu Baseer, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> regarding the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[2:89] and before that they used to pray for victory against those who disbelieve”</span>. He<sup>asws</sup> said: ‘The Jews had found in their Book that Muhammad<sup>saww</sup> would emigrate between Ayr and Ohad, so they went out look for these places. They passed by a mountain called Hadaad, so they said, ‘Hadaad and Ohad are one and the same’. So they dispersed upon that. Some of them encamped at Tayma and some of them at Fadak, and some of them at Khyber’.",
            "The ones who were at Tayma longed to be with some of their brothers. A Bedouin from Qays, passed by them so they hired (a camel) from him and he said to them, ‘I shall pass with you in between Ayr and Ohad’. They said to him, ‘When you pass by these two, point these two places out to us. So when he was in the middle of the land of Al-Medina, he said to them, ‘That is Ayr and this is Ohad’. So they descended from the backs of his camels and said, ‘We have reached where we wanted to be, therefore we do not have any need for your camels, and so you can go to wherever you like’. And they wrote to their brothers who were at Fadak and Khyber, ‘We have got to the place so come to us’. They wrote back to them, ‘We have settled in the houses and acquired assets, and there is no one closer to us than you are. So when that event transpires, we would quickly come to you’.",
            "They acquired assets in the land of Al-Medina. When their wealth increased, it (news) reached Tubba and he attacked them. They fortified themselves from him, so he surrounded them. They felt sympathetic towards the weak ones of Tubba and they would throw the dates and the barley towards them at night. So (the news of) that reached Tubba, and he sympathised with them and granted them amnesty. They came down to him. He said to them, ‘I have come to like your city and would like to reside among you’. So they said to him, ‘It is not for you to dwell in that place, for a Prophet<sup>saww</sup> would be emigrating and that is not for anyone until that happens’. He said to them, ‘I will leave behind among you members of my family, so when that happens, they would support him<sup>saww</sup> and help him<sup>saww</sup>’.",
            "So he left behind two tribes, Al-Aws and Al-Khazraj. So when they multiplied, they used to take the wealth of the Jews and the Jews used to say to them, ‘But, when Muhammad<sup style=\"font-weight: normal\">saww</sup> is Sent, he<sup style=\"font-weight: normal\">saww</sup> would take you all out from our houses and our wealth’. So when Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic Sent Muhammad<sup style=\"font-weight: normal\">saww</sup>, the Helpers believed in him<sup style=\"font-weight: normal\">saww</sup>, but the Jews denied him<sup style=\"font-weight: normal\">saww</sup>, and it is the Statement of Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[2:89] and before that they used to pray for victory against those who disbelieve, but when there came to them (Prophet) that which they did not recognize, they disbelieved in him; so Allah's curse is on the unbelievers.”</span>"
          ],
          "en.sarwar": [
            "482. Ali Bin Ibrahim, from his father, from Safwan Bin Yahya, from Is’haq Bin Ammar who said: ‘I asked Abu Abdullah (a.s.) about the Statement of Allah (azwj) Blessed and High: “[2:89] and before that they used to pray for victory against those who disbelieve, but when there came to them (Prophet) that which they did not recognize, they disbelieved in him”. He (a.s.) said: ‘A people who were in between (the era of) Muhammad (saww) and Isa (as), and they would inform the idol worshippers about the promised Prophet (saww), and they were saying, ‘When the Prophet (saww) comes out, he (saww) would break your idols, and will do this with you, and that with you’. However, when the Rasool Allah (saww) came out, they denied him (saww)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 406)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 404)"
        ],
        "index": 15167,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:6",
        "text": [
          "14930- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) عَنْ قَوْلِ اللَّهِ تَبَارَكَ وَ تَعَالَى وَ كانُوا مِنْ قَبْلُ يَسْتَفْتِحُونَ عَلَى الَّذِينَ كَفَرُوا فَلَمَّا جاءَهُمْ ما عَرَفُوا كَفَرُوا بِهِ قَالَ كَانَ قَوْمٌ فِيمَا بَيْنَ مُحَمَّدٍ وَ عِيسَى صَلَّى اللَّهُ عَلَيْهِمَا وَ كَانُوا يَتَوَعَّدُونَ أَهْلَ الْأَصْنَامِ بِالنَّبِيِّ (صلى الله عليه وآله) وَ يَقُولُونَ لَيَخْرُجَنَّ نَبِيٌّ فَلَيُكَسِّرَنَّ أَصْنَامَكُمْ وَ لَيَفْعَلَنَّ بِكُمْ [وَ لَيَفْعَلَنَّ] فَلَمَّا خَرَجَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كَفَرُوا بِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473613\">H 14930</a> – Ali Bin Ibrahim, from his father, from Safwan Bin Yahya, from Is’haq Bin Ammar who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> asked Abu Abdullah</span><sup>asws</sup> about the Statement of Allah<sup>azwj</sup> Blessed and High: <span class=\"ibTxt\">“[2:89] and before that they used to pray for victory against those who disbelieve, but when there came to them (Prophet) that which they did not recognize, they disbelieved in him”</span>. He<sup>asws</sup> said: ‘A people who were in between (the era of) Muhammad<sup>saww</sup> and Isa<sup>as</sup>, and they would inform the idol worshippers about the promised Prophet<sup>saww</sup>, and they were saying, ‘When the Prophet<sup>saww</sup> comes out, he<sup>saww</sup> would break your idols, and will do this with you, and that with you’. However, when the Rasool Allah<sup>saww</sup> came out, they denied him<sup>saww</sup>’."
          ],
          "en.sarwar": [
            "483. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from Abu Ayyub Al-Khazaz, from Umar Bin Hanzala who said: I heard Abu Abdullah (a.s.) saying: ‘There are five signs before the rising of Al-Qaim (a.s.) – The scream, and the Sufyani, and the sinking (of the earth), and the killing of the pure soul (Al-Nafs Al-Zakkiyya) and Al-Yamany’. So I said, ‘May I be sacrificed for you (a.s.), if someone from your (a.s.) Household comes out (in revolt) before these signs, shall we come out (revolt) with him?’ He (a.s.) said: ‘No’. So when it was the next morning, I recited this Verse: “[26:4] If We please, We should send down upon them a sign from the heaven so that their necks should stoop to it”. I said, ‘Is this the scream?’ He (a.s.) said: ‘If that was, then the necks of the enemies of Allah (azwj) Mighty and Majestic would stoop down in humility’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 407)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15168,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:7",
        "text": [
          "14931- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ عُمَرَ بْنِ حَنْظَلَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ خَمْسُ عَلَامَاتٍ قَبْلَ قِيَامِ الْقَائِمِ الصَّيْحَةُ وَ السُّفْيَانِيُّ وَ الْخَسْفُ وَ قَتْلُ النَّفْسِ الزَّكِيَّةِ وَ الْيَمَانِيُّ فَقُلْتُ جُعِلْتُ فِدَاكَ إِنْ خَرَجَ أَحَدٌ مِنْ أَهْلِ بَيْتِكَ قَبْلَ هَذِهِ الْعَلَامَاتِ أَ نَخْرُجُ مَعَهُ قَالَ لَا فَلَمَّا كَانَ مِنَ الْغَدِ تَلَوْتُ هَذِهِ الْآيَةَ إِنْ نَشَأْ نُنَزِّلْ عَلَيْهِمْ مِنَ السَّماءِ آيَةً فَظَلَّتْ أَعْناقُهُمْ لَها خاضِعِينَ فَقُلْتُ لَهُ أَ هِيَ الصَّيْحَةُ فَقَالَ أَمَا لَوْ كَانَتْ خَضَعَتْ أَعْنَاقُ أَعْدَاءِ اللَّهِ عَزَّ وَ جَلَّ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473614\">H 14931</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from Abu Ayyub Al-Khazaz, from Umar Bin Hanzala who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘There are five signs before the rising of Al-Qaim<sup>asws</sup> – The scream, and the Sufyani, and the sinking (of the earth), and the killing of the pure soul (Al-Nafs Al-Zakkiyya) and Al-Yamany’. So I said, ‘May I be sacrificed for you<sup>asws</sup>, if someone from your<sup>asws</sup> Household comes out (in revolt) before these signs, shall we come out (revolt) with him?’ He<sup>asws</sup> said: ‘No’. So when it was the next morning, I recited this Verse: <span class=\"ibTxt\">“[26:4] If We please, We should send down upon them a sign from the heaven so that their necks should stoop to it”</span>. I said, ‘Is this the scream?’ He<sup>asws</sup> said: ‘If that was, then the necks of the enemies of Allah<sup>azwj</sup> Mighty and Majestic would stoop down in humility’."
          ],
          "en.sarwar": [
            "484. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzaal, from Abu Jameela, from Muhammad Bin Ali Al-Halby who said: I heard Abu Abdullah (a.s.) saying: ‘The differing of the Clan of Abbas is from the inevitable, and the Call is from the inevitable, and the coming out of Al-Qaim (a.s.) is from the inevitable’. I said, ‘And How would be the Call?’ He (a.s.) said: ‘A Caller will Call out from the sky at the beginning of the day: ‘Indeed! Ali (a.s.) and his (a.s.) Shites, they are the winners’. He (a.s.) said: ‘And a Caller will Call out at the end of the day: ‘Indeed! Usman and his Shites, they are the winners’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على الشهور</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 407)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15169,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:8",
        "text": [
          "14932- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ أَبِي جَمِيلَةَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ الْحَلَبِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ اخْتِلَافُ بَنِي الْعَبَّاسِ مِنَ الْمَحْتُومِ وَ النِّدَاءُ مِنَ الْمَحْتُومِ وَ خُرُوجُ الْقَائِمِ مِنَ الْمَحْتُومِ قُلْتُ وَ كَيْفَ النِّدَاءُ قَالَ يُنَادِي مُنَادٍ مِنَ السَّمَاءِ أَوَّلَ النَّهَارِ أَلَا إِنَّ عَلِيّاً وَ شِيعَتَهُ هُمُ الْفَائِزُونَ قَالَ وَ يُنَادِي مُنَادٍ فِي آخِرِ النَّهَارِ أَلَا إِنَّ عُثْمَانَ وَ شِيعَتَهُ هُمُ الْفَائِزُونَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473615\">H 14932</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzaal, from Abu Jameela, from Muhammad Bin Ali Al-Halby who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘The differing of the Clan of Abbas is from the inevitable, and the Call is from the inevitable, and the coming out of Al-Qaim<sup>asws</sup> is from the inevitable’. I said, ‘And How would be the Call?’ He<sup>asws</sup> said: ‘A Caller will Call out from the sky at the beginning of the day: ‘Indeed! Ali<sup>asws</sup> and his<sup>asws</sup> Shites, they are the winners’. He<sup>asws</sup> said: ‘And a Caller will Call out at the end of the day: ‘Indeed! Usman and his Shites, they are the winners’. "
          ],
          "en.sarwar": [
            "485. A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Muhammad Bin Sinan, from Zayd Al-Shahaam who said: Qatada Bin Da’ama came up to Abu Ja’far (a.s.), so he (a.s.) said: ‘O Qatada! Are you a Faqih (Jurist) of the people of Basra?’ He said, ‘That is what they are alleging’. Abu Ja’far (a.s.) said: ‘It has reached me (a.s.) that you are explaining the Quran’. Qatada said to him (a.s.), ‘Yes’. So Abu Ja’far (a.s.) said to him: ‘You are explaining it by knowledge or by ignorance?’ He said, ‘No, by knowledge’. So Abu Ja’far (a.s.) said to him: ‘So if you are explaining by knowledge, so ‘you are’ ‘who you are’ and I (a.s.) would like to ask you’. Qatada said, ‘Ask’. He (a.s.) said: ‘Inform me (a.s.) about the Statement of Allah (azwj) Mighty and Majestic in (the Chapter) Saba: “[34:18] and We apportioned the journey therein: Travel through them nights and days, secure”. Qatada said, ‘That is for the one who goes out from his house with lawful provisions, and camel rented lawfully intending this House (Kabah). He would be safe until he returns back to his family’. So Abu Ja’far (a.s.) said: ‘I (a.s.) hold you to Allah (azwj), O Qatada! Do you know that if the man comes out from his house with lawful provisions, and a camel rented lawfully, intending this House, he could get cut off (by bandits) on the road, and his provisions would be lost and he could be injured due to that?’ Qatada said, ‘Our Allah (azwj), Yes!’ So Abu Ja’far (a.s.) said: ‘Woe be unto you! But rather, you are explaining the Quran from your own free will, so you are destroyed and causing others to be destroyed. And if you have taken it from the men (others), you have been destroyed and so have they. Woe be unto you! (But) that is for the one who comes out from his house with provisions, and lawful means of transportation aspiring for this House while having recognised our (a.s.) rights, loving us (a.s.) with his heart, just as Allah (azwj) Mighty and Majestic has Said: “[14:37] therefore make the hearts of some people yearn towards them” and it does not mean the House, for He (azwj) is Saying ‘towards them’. So we (a.s.) are, by Allah (azwj), the supplication of Ibrahim (as) towards whom (a.s.) if one loves with one’s heart, his Pilgrimage would be Accepted, otherwise it will not be, O Qatada! So if it is like that, he would be safe from the Punishment of Hell on the Day of Judgement’. Qatada said, ‘No offence. By Allah (azwj), I will not explain it except like this’. So Abu Ja’far (a.s.) said: ‘Woe be unto you, O Qatada! But rather, you should understand the Quran from the ones (a.s.) who have been addressed by it’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 410)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15170,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:9",
        "text": [
          "14933- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ زَيْدٍ الشَّحَّامِ قَالَ دَخَلَ قَتَادَةُ بْنُ دِعَامَةَ عَلَى أَبِي جَعْفَرٍ (عليه السلام) فَقَالَ يَا قَتَادَةُ أَنْتَ فَقِيهُ أَهْلِ الْبَصْرَةِ فَقَالَ هَكَذَا يَزْعُمُونَ فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) بَلَغَنِي أَنَّكَ تُفَسِّرُ الْقُرْآنَ فَقَالَ لَهُ قَتَادَةُ نَعَمْ فَقَالَ لَهُ أَبُو جَعْفَرٍ (عليه السلام) بِعِلْمٍ تُفَسِّرُهُ أَمْ بِجَهْلٍ قَالَ لَا بِعِلْمٍ فَقَالَ لَهُ أَبُو جَعْفَرٍ (عليه السلام) فَإِنْ كُنْتَ تُفَسِّرُهُ بِعِلْمٍ فَأَنْتَ أَنْتَ وَ أَنَا أَسْأَلُكَ قَالَ قَتَادَةُ سَلْ",
          "قَالَ أَخْبِرْنِي عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فِي سَبَإٍ وَ قَدَّرْنا فِيهَا السَّيْرَ سِيرُوا فِيها لَيالِيَ وَ أَيَّاماً آمِنِينَ فَقَالَ قَتَادَةُ ذَلِكَ مَنْ خَرَجَ مِنْ بَيْتِهِ بِزَادٍ حَلَالٍ وَ رَاحِلَةٍ وَ كِرَاءٍ حَلَالٍ يُرِيدُ هَذَا الْبَيْتَ كَانَ آمِناً حَتَّى يَرْجِعَ إِلَى أَهْلِهِ فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) نَشَدْتُكَ اللَّهَ يَا قَتَادَةُ هَلْ تَعْلَمُ أَنَّهُ قَدْ يَخْرُجُ الرَّجُلُ مِنْ بَيْتِهِ بِزَادٍ حَلَالٍ وَ رَاحِلَةٍ وَ كِرَاءٍ حَلَالٍ يُرِيدُ هَذَا الْبَيْتَ فَيُقْطَعُ عَلَيْهِ الطَّرِيقُ فَتُذْهَبُ نَفَقَتُهُ وَ يُضْرَبُ مَعَ ذَلِكَ ضَرْبَةً فِيهَا اجْتِيَاحُهُ قَالَ قَتَادَةُ اللَّهُمَّ نَعَمْ",
          "فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) وَيْحَكَ يَا قَتَادَةُ إِنْ كُنْتَ إِنَّمَا فَسَّرْتَ الْقُرْآنَ مِنْ تِلْقَاءِ نَفْسِكَ فَقَدْ هَلَكْتَ وَ أَهْلَكْتَ وَ إِنْ كُنْتَ قَدْ أَخَذْتَهُ مِنَ الرِّجَالِ فَقَدْ هَلَكْتَ وَ أَهْلَكْتَ وَيْحَكَ يَا قَتَادَةُ ذَلِكَ مَنْ خَرَجَ مِنْ بَيْتِهِ بِزَادٍ وَ رَاحِلَةٍ وَ كِرَاءٍ حَلَالٍ يَرُومُ هَذَا الْبَيْتَ عَارِفاً بِحَقِّنَا يَهْوَانَا قَلْبُهُ كَمَا قَالَ اللَّهُ عَزَّ وَ جَلَّ فَاجْعَلْ أَفْئِدَةً مِنَ النَّاسِ تَهْوِي إِلَيْهِمْ وَ لَمْ يَعْنِ الْبَيْتَ فَيَقُولَ إِلَيْهِ فَنَحْنُ وَ اللَّهِ دَعْوَةُ إِبْرَاهِيمَ (عليه السلام) الَّتِي مَنْ هَوَانَا قَلْبُهُ قُبِلَتْ حَجَّتُهُ وَ إِلَّا فَلَا يَا قَتَادَةُ فَإِذَا كَانَ كَذَلِكَ كَانَ آمِناً مِنْ عَذَابِ جَهَنَّمَ يَوْمَ الْقِيَامَةِ قَالَ قَتَادَةُ لَا جَرَمَ وَ اللَّهِ لَا فَسَّرْتُهَا إِلَّا هَكَذَا فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) وَيْحَكَ يَا قَتَادَةُ إِنَّمَا يَعْرِفُ الْقُرْآنَ مَنْ خُوطِبَ بِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473616\">H 14933</a> – A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Muhammad Bin Sinan, from Zayd Al-Shahaam who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-q\">Q</span>atada Bin Da’ama came</span> up to Abu Ja’far<sup>asws</sup>, so he<sup>asws</sup> said: ‘O Qatada! Are you a Faqih (Jurist) of the people of Basra?’ He said, ‘That is what they are alleging'. Abu Ja’far<sup>asws</sup> said: ‘It has reached me<sup>asws</sup> that you are explaining the Quran’. Qatada said to him<sup>asws</sup>, ‘Yes’. So Abu Ja’far<sup>asws</sup> said to him: ‘You are explaining it by knowledge or by ignorance?’ He said, ‘No, by knowledge’. So Abu Ja’far<sup>asws</sup> said to him: ‘So if you are explaining by knowledge, so ‘you are’ ‘who you are’ and I<sup>asws</sup> would like to ask you’. Qatada said, ‘Ask’. ",
            "He<sup>asws</sup> said: ‘Inform me<sup>asws</sup> about the Statement of Allah<sup>azwj</sup> Mighty and Majestic in (the Chapter) Saba: <span class=\"ibTxt\">“[34:18] and We apportioned the journey therein: Travel through them nights and days, secure”</span>. Qatada said, ‘That is for the one who goes out from his house with lawful provisions, and camel rented lawfully intending this House (Kabah). He would be safe until he returns back to his family’. So Abu Ja’far<sup>asws</sup> said: ‘I<sup>asws</sup> hold you to Allah<sup>azwj</sup>, O Qatada! Do you know that if the man comes out from his house with lawful provisions, and a camel rented lawfully, intending this House, he could get cut off (by bandits) on the road, and his provisions would be lost and he could be injured due to that?’ Qatada said, ‘Our Allah<sup>azwj</sup>, Yes!’  ",
            "So Abu Ja’far<sup>asws</sup> said: ‘Woe be unto you! But rather, you are explaining the Quran from your own free will, so you are destroyed and causing others to be destroyed. And if you have taken it from the men (others), you have been destroyed and so have they. ",
            "Woe be unto you! (But) that is for the one who comes out from his house with provisions, and lawful means of transportation aspiring for this House while having recognised our<sup>asws</sup> rights, loving us<sup>asws</sup> with his heart, just as Allah<sup>azwj</sup> Mighty and Majestic has Said: <span class=\"ibTxt\">“[14:37] therefore make the hearts of some people yearn towards them”</span> and it does not mean the House, for He<sup>azwj</sup> is Saying ‘towards them’. So we<sup>asws</sup> are, by Allah<sup>azwj</sup>, the supplication of Ibrahim<sup>as</sup> towards whom<sup>asws</sup> if one loves with one’s heart, his Pilgrimage would be Accepted, otherwise it will not be, O Qatada! ",
            "So if it is like that, he would be safe from the Punishment of Hell on the Day of Judgement’. Qatada said, ‘No offence. By Allah<sup>azwj</sup>, I will not explain it except like this’. So Abu Ja’far<sup>asws</sup> said: ‘Woe be unto you, O Qatada! But rather, you should understand the Quran from the ones<sup>asws</sup> who have been addressed by it’."
          ],
          "en.sarwar": [
            "486. Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Mufazzal Bin Salih, from Jabir, who has said: Abu Ja’far (a.s.) says that the Prophet (saww) said: ‘The Trustworthy Spirit (Jibraeel) informed me (saww) that Allah (azwj), there is no god apart from Him (azwj), when He (azwj) Pauses the creatures and Gathers the former ones and the later ones, Hell will be brought by a thousand reins, each rein grabbed by a hundred thousand Angels from the strong and harsh ones, making crushing, and shattering sounds with its exhalation and inhalation, sighing in its exhalation. And if Allah (azwj) Mighty and Majestic does not Delay it until the Accounting is dealt with, it would destroy all. Then a neck would come out from it, which would encompass the creatures, be they righteous or be they tyrants from among them. So there is no creature of Allah (azwj), a servant from His (azwj) servants, Angel, or Prophet (as) except that he would call out, ‘O Lord (azwj), (save) my soul! (save) my soul! Whilst you (saww) would be saying: ‘O Lord (azwj), (save) my (saww) community! (save) My (saww) community! Then a Bridge would be placed over it, thinner than the hair, and sharper than the sword. It would have three hurdles for it. The first one being the fulfilment of the trusts and the mercy; and the second being the Salat’ and the third being the Lord (azwj) of the Words, there is no god apart from Him (azwj). So they will be mandated to cross over it. They would be captivated by the mercy and the fulfilment of the trust stage. So if they can be rescued from it, the Salat stage would capture them. So if they can be rescued from it, they would end up to the Lord (azwj) of the Worlds, Majestic is His (azwj) Mention, and it is the Statement of Allah (azwj) Blessed and High: “[89:14] Lo! Your Lord is ever watchful”. And the people would be upon the Bridge, (some) of their feet slipping and (some) of their feet firm; and the Angels would be around them Calling out: ‘O Benevolent! O Lenient! Excuse them, and Forgive them, and Return by Your (azwj) Grace, and Secure them while the people would be flocking on it like moths. So the one who is saved would be so by the Mercy of Allah (azwj) Blessed and High would look at it (the Bridge) and say, ‘The Praise is due to Allah (azwj) Who Rescued me from you (the Bridge) after finding me lost and in desperation, by His (azwj) Grace. Surely, our Lord (azwj) is Forgiving, Appreciative’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثوق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 412)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15171,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:10",
        "text": [
          "14934- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ مُفَضَّلِ بْنِ صَالِحٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ قَالَ النَّبِيُّ (صلى الله عليه وآله) أَخْبَرَنِي الرُّوحُ الْأَمِينُ أَنَّ اللَّهَ لَا إِلَهَ غَيْرُهُ إِذَا وَقَفَ الْخَلَائِقَ وَ جَمَعَ الْأَوَّلِينَ وَ الْآخِرِينَ أُتِيَ بِجَهَنَّمَ تُقَادُ بِأَلْفِ زِمَامٍ أَخَذَ بِكُلِّ زِمَامٍ مِائَةُ أَلْفِ مَلَكٍ مِنَ الْغِلَاظِ الشِّدَادِ وَ لَهَا هَدَّةٌ وَ تَحَطُّمٌ وَ زَفِيرٌ وَ شَهِيقٌ وَ إِنَّهَا لَتَزْفِرُ الزَّفْرَةَ فَلَوْ لَا أَنَّ اللَّهَ عَزَّ وَ جَلَّ أَخَّرَهَا إِلَى الْحِسَابِ لَأَهْلَكَتِ الْجَمِيعَ ثُمَّ يَخْرُجُ مِنْهَا عُنُقٌ يُحِيطُ بِالْخَلَائِقِ الْبَرِّ مِنْهُمْ وَ الْفَاجِرِ فَمَا خَلَقَ اللَّهُ عَبْداً مِنْ عِبَادِهِ مَلَكٍ وَ لَا نَبِيٍّ إِلَّا وَ يُنَادِي يَا رَبِّ نَفْسِي نَفْسِي وَ أَنْتَ تَقُولُ يَا رَبِّ أُمَّتِي أُمَّتِي",
          "ثُمَّ يُوضَعُ عَلَيْهَا صِرَاطٌ أَدَقُّ مِنَ الشَّعْرِ وَ أَحَدُّ مِنَ السَّيْفِ عَلَيْهِ ثَلَاثُ قَنَاطِرَ الْأُولَى عَلَيْهَا الْأَمَانَةُ وَ الرَّحْمَةُ وَ الثَّانِيَةُ عَلَيْهَا الصَّلَاةُ وَ الثَّالِثَةُ عَلَيْهَا رَبُّ الْعَالَمِينَ لَا إِلَهَ غَيْرُهُ فَيُكَلَّفُونَ الْمَمَرَّ عَلَيْهَا فَتَحْبِسُهُمُ الرَّحْمَةُ وَ الْأَمَانَةُ فَإِنْ نَجَوْا مِنْهَا حَبَسَتْهُمُ الصَّلَاةُ فَإِنْ نَجَوْا مِنْهَا كَانَ الْمُنْتَهَى إِلَى رَبِّ الْعَالَمِينَ جَلَّ ذِكْرُهُ وَ هُوَ قَوْلُ اللَّهِ تَبَارَكَ وَ تَعَالَى إِنَّ رَبَّكَ لَبِالْمِرْصادِ",
          "وَ النَّاسُ عَلَى الصِّرَاطِ فَمُتَعَلِّقٌ تَزِلُّ قَدَمُهُ وَ تَثْبُتُ قَدَمُهُ وَ الْمَلَائِكَةُ حَوْلَهَا يُنَادُونَ يَا كَرِيمُ يَا حَلِيمُ اعْفُ وَ اصْفَحْ وَ عُدْ بِفَضْلِكَ وَ سَلِّمْ وَ النَّاسُ يَتَهَافَتُونَ فِيهَا كَالْفَرَاشِ فَإِذَا نَجَا نَاجٍ بِرَحْمَةِ اللَّهِ تَبَارَكَ وَ تَعَالَى نَظَرَ إِلَيْهَا فَقَالَ الْحَمْدُ لِلَّهِ الَّذِي نَجَّانِي مِنْكِ بَعْدَ يَأْسٍ بِفَضْلِهِ وَ مَنِّهِ إِنَّ رَبَّنَا لَغَفُورٌ شَكُورٌ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473617\">H 14934</a> – Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Mufazzal Bin Salih, from Jabir, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> says that the Prophet<sup>saww</sup> said: ‘The Trustworthy Spirit (Jibraeel) informed me<sup>saww</sup> that Allah<sup>azwj</sup>, there is no god apart from Him<sup>azwj</sup>, when He<sup>azwj</sup> Pauses the creatures and Gathers the former ones and the later ones, Hell will be brought by a thousand reins, each rein grabbed by a hundred thousand Angels from the strong and harsh ones, making crushing, and shattering sounds with its exhalation and inhalation, sighing in its exhalation. And if Allah<sup>azwj</sup> Mighty and Majestic does not Delay it until the Accounting is dealt with, it would destroy all. Then a neck would come out from it, which would encompass the creatures, be they righteous or be they tyrants from among them. So there is no creature of Allah<sup>azwj</sup>, a servant from His<sup>azwj</sup> servants, Angel, or Prophet<sup>as</sup> except that he would call out, ‘O Lord<sup>azwj</sup>, (save) my soul! (save) my soul! Whilst you<sup>saww</sup> would be saying: ‘O Lord<sup>azwj</sup>, (save) my<sup>saww</sup> community! (save) My<sup>saww</sup> community!",
            "Then a Bridge would be placed over it, thinner than the hair, and sharper than the sword. It would have three hurdles for it. The first one being the fulfilment of the trusts and the mercy; and the second being the Salat’ and the third being the Lord<sup>azwj</sup> of the Words, there is no god apart from Him<sup>azwj</sup>. So they will be mandated to cross over it. They would be captivated by the mercy and the fulfilment of the trust stage. So if they can be rescued from it, the Salat stage would capture them. So if they can be rescued from it, they would end up to the Lord<sup>azwj</sup> of the Worlds, Majestic is His<sup>azwj</sup> Mention, and it is the Statement of Allah<sup>azwj</sup> Blessed and High: <span class=\"ibTxt\">“[89:14] Lo! Your Lord is ever watchful”</span>. ",
            "And the people would be upon the Bridge, (some) of their feet slipping and (some) of their feet firm; and the Angels would be around them Calling out: ‘O Benevolent! O Lenient! Excuse them, and Forgive them, and Return by Your<sup>azwj</sup> Grace, and Secure them while the people would be flocking on it like moths. So the one who is saved would be so by the Mercy of Allah<sup>azwj</sup> Blessed and High would look at it (the Bridge) and say, ‘The Praise is due to Allah<sup>azwj</sup> Who Rescued me from you (the Bridge) after finding me lost and in desperation, by His<sup>azwj</sup> Grace. Surely, our Lord<sup>azwj</sup> is Forgiving, Appreciative’."
          ],
          "en.sarwar": [
            "487. Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Mansour Bin Yunus, from Ismail Bin Jabir, from Abu Khalid, who has narrated the following: Abu Ja’far (a.s.) regarding the Statement of Allah (azwj) Mighty and Majestic: “[2:148] therefore hasten to (do) good works; wherever you are, Allah will bring you all together”. He (a.s.) said: ‘Good works is a reference to Al-Wilayah, and the Words of the Blessed and the High: “wherever you are, Allah will bring you all together” mean the companions of Al-Qaim (a.s.), three hundred and some ten men’. He (a.s.) said: ‘And they are, by Allah (azwj), a numbered community’. He (a.s.) said: ‘By Allah (azwj) they would gather together in a single moment, like clouds in the autumn’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 413)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15172,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:11",
        "text": [
          "14935- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ إِسْمَاعِيلَ بْنِ جَابِرٍ عَنْ أَبِي خَالِدٍ عَنْ أَبِي جَعْفَرٍ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَاسْتَبِقُوا الْخَيْراتِ أَيْنَ ما تَكُونُوا يَأْتِ بِكُمُ اللَّهُ جَمِيعاً قَالَ الْخَيْرَاتُ الْوَلَايَةُ وَ قَوْلُهُ تَبَارَكَ وَ تَعَالَى أَيْنَ ما تَكُونُوا يَأْتِ بِكُمُ اللَّهُ جَمِيعاً يَعْنِي أَصْحَابَ الْقَائِمِ الثَّلَاثَمِائَةِ وَ الْبِضْعَةَ عَشَرَ رَجُلًا قَالَ وَ هُمْ وَ اللَّهِ الْأُمَّةُ الْمَعْدُودَةُ قَالَ يَجْتَمِعُونَ وَ اللَّهِ فِي سَاعَةٍ وَاحِدَةٍ قَزَعٌ كَقَزَعِ الْخَرِيفِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473618\">H 14935</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Mansour Bin Yunus, from Ismail Bin Jabir, from Abu Khalid, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> regarding the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[2:148] therefore hasten to (do) good works; wherever you are, Allah will bring you all together”</span>. He<sup>asws</sup> said: ‘<span class=\"ibTxt\">Good works</span> is a reference to <span class=\"iTxt\">Al-Wilayah</span>, and the Words of the Blessed and the High: <span class=\"ibTxt\">“wherever you are, Allah will bring you all together”</span> mean the companions of Al-Qaim<sup>asws</sup>, three hundred and some ten men’. He<sup>asws</sup> said: ‘And they are, by Allah<sup>azwj</sup>, a numbered community’. He<sup>asws</sup> said: ‘By Allah<sup>azwj</sup> they would gather together in a single moment, like clouds in the autumn’."
          ],
          "en.sarwar": [
            "488. A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Ismail Bin Bazi’e, from Munzar in Jayfar, from Hisham Bin Saalim who said: I heard Abu Abdullah (a.s.) saying: ‘Travel when it is cool (time of the day)’. I said, ‘We are afraid of the pests’. So he (a.s.) said: ‘Even if something affects you, it is better for you in view to the fact that you will be safe (from sunstroke), as you are the protected ones (from pets)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على الشهور</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 414)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15173,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:12",
        "text": [
          "14936- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ مُنْذِرِ بْنِ جَيْفَرٍ عَنْ هِشَامِ بْنِ سَالِمٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ سِيرُوا الْبَرْدَيْنِ قُلْتُ إِنَّا نَتَخَوَّفُ مِنَ الْهَوَامِّ فَقَالَ إِنْ أَصَابَكُمْ شَيْ‏ءٌ فَهُوَ خَيْرٌ لَكُمْ مَعَ أَنَّكُمْ مَضْمُونُونَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473619\">H 14936</a> – A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Ismail Bin Bazi’e, from Munzar in Jayfar, from Hisham Bin Saalim who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying:  ‘Travel when it is cool (time of the day)’. I said, ‘We are afraid of the pests’. So he<sup>asws</sup> said: ‘Even if something affects you, it is better for you in view to the fact that you will be safe (from sunstroke), as you are the protected ones (from pets)’."
          ],
          "en.sarwar": [
            "489. Ali Bin Ibrahim, from his father, from Al-Nowfaly, from Al-Sakuny, who has narrated the following: Abu Abdullah (a.s.) has said: ‘The Rasool Allah (saww) said: ‘It is on you to travel at night, for the ground folds up at night’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 412)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 405)"
        ],
        "index": 15174,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:13",
        "text": [
          "14937- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) عَلَيْكُمْ بِالسَّفَرِ بِاللَّيْلِ فَإِنَّ الْأَرْضَ تُطْوَى بِاللَّيْلِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473620\">H 14937</a> – Ali Bin Ibrahim, from his father, from Al-Nowfaly, from Al-Sakuny, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘The Rasool Allah<sup>saww</sup> said: ‘It is on you to travel at night, for the ground folds up at night’. "
          ],
          "en.sarwar": [
            "490. A number of our companions, Ahmad Bin Muhammad Bin Khalid, from Ismail Bin Mahraan, from Sayf Bin Umeyra, from Basheer Al-Nabaal, from Humraan Bin Ayn who said: I said to Abu Ja’far (a.s.), ‘The people are saying the earth would fold up for us at night, how it would fold up?’ He (a.s.) said: ‘Like this’, then folded his (a.s.) cloth’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 414)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 405)"
        ],
        "index": 15175,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:14",
        "text": [
          "14938- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ بَشِيرٍ النَّبَّالِ عَنْ حُمْرَانَ بْنِ أَعْيَنَ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ (عليه السلام) يَقُولُ النَّاسُ تُطْوَى لَنَا الْأَرْضُ بِاللَّيْلِ كَيْفَ تُطْوَى قَالَ هَكَذَا ثُمَّ عَطَفَ ثَوْبَهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473621\">H 14938</a> – A number of our companions, Ahmad Bin Muhammad Bin Khalid, from Ismail Bin Mahraan, from Sayf Bin Umeyra, from Basheer Al-Nabaal, from Humraan Bin Ayn who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> said to Abu Ja’far</span><sup>asws</sup>, ‘The people are saying the earth would fold up for us at night, how it would fold up?’ He<sup>asws</sup> said: ‘Like this’, then folded his<sup>asws</sup> cloth’. "
          ],
          "en.sarwar": [
            "491. Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammaad Bin Usman, who has narrated the following: Abu Abdullah (a.s.) has said: ‘The earth folds up during the end of the night’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 415)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15176,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:15",
        "text": [
          "14939- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ الْأَرْضُ تُطْوَى فِي آخِرِ اللَّيْلِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473622\">H 14939</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammaad Bin Usman, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘The earth folds up during the end of the night’."
          ],
          "en.sarwar": [
            "492. A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from Abu Ayyub Al-Khazaz who said: We intended to go out, so we went to greet Abu Abdullah (a.s.). So he (a.s.) said: ‘It is as if you all are seeking blessings for Monday’. So we said, ‘Yes’. So he (a.s.) said: ‘So which day is greater in evil than the day of Monday, the day in which our Prophet (saww) departed, and the Revelation was Raised (stopped) from us (a.s.). Do not go out, and go out on the day of Wednesday’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 415)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15177,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:16",
        "text": [
          "14940- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ أَبِي أَيُّوبَ الْخَزَّازِ قَالَ أَرَدْنَا أَنْ نَخْرُجَ فَجِئْنَا نُسَلِّمُ عَلَى أَبِي عَبْدِ اللَّهِ (عليه السلام) فَقَالَ كَأَنَّكُمْ طَلَبْتُمْ بَرَكَةَ الْإِثْنَيْنِ فَقُلْنَا نَعَمْ فَقَالَ وَ أَيُّ يَوْمٍ أَعْظَمُ شُؤْماً مِنْ يَوْمِ الْإِثْنَيْنِ يَوْمٍ فَقَدْنَا فِيهِ نَبِيَّنَا وَ ارْتَفَعَ الْوَحْيُ عَنَّا لَا تَخْرُجُوا وَ اخْرُجُوا يَوْمَ الثَّلَاثَاءِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473623\">H 14940</a> – A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from Abu Ayyub Al-Khazaz who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-w\">W</span>e intended to go out</span>, so we went to greet Abu Abdullah<sup>asws</sup>. So he<sup>asws</sup> said: ‘It is as if you all are seeking blessings for Monday’. So we said, ‘Yes’. So he<sup>asws</sup> said: ‘So which day is greater in evil than the day of Monday, the day in which our Prophet<sup>saww</sup> departed, and the Revelation was Raised (stopped) from us<sup>asws</sup>. Do not go out, and go out on the day of Wednesday’."
          ],
          "en.sarwar": [
            "493. From him, from Bakr Bin Salih, from Suleyman Al-Ja’fary, who has narrated: Abu Al-Hassan Musa (a.s.) having said, ‘The evil, for the traveller in his road, are five things – The cawing crow on his right and spreading its tail; and the howling wolf which howls on the face of the man while sitting on it’s tail and raises its voice and lowers it three times; and the deer which crossing from the right to the left, and the crying owl, and an old woman coming in from the front, and confronting a female (astray) donkey. So the one who feels anything from these for himself, so he should immediately say, ‘I adhere to You (azwj), O Lord (azwj), from the evil of what I find in (front of) myself’. He (a.s.) said; ‘He would be protected from that’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 418)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15178,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:17",
        "text": [
          "14941- عَنْهُ عَنْ بَكْرِ بْنِ صَالِحٍ عَنْ سُلَيْمَانَ الْجَعْفَرِيِّ عَنْ أَبِي الْحَسَنِ مُوسَى (عليه السلام) قَالَ الشُّؤْمُ لِلْمُسَافِرِ فِي طَرِيقِهِ خَمْسَةُ أَشْيَاءَ الْغُرَابُ النَّاعِقُ عَنْ يَمِينِهِ وَ النَّاشِرُ لِذَنَبِهِ وَ الذِّئْبُ الْعَاوِي الَّذِي يَعْوِي فِي وَجْهِ الرَّجُلِ وَ هُوَ مُقْعٍ عَلَى ذَنَبِهِ يَعْوِي ثُمَّ يَرْتَفِعُ ثُمَّ يَنْخَفِضُ ثَلَاثاً وَ الظَّبْيُ السَّانِحُ مِنْ يَمِينٍ إِلَى شِمَالٍ وَ الْبُومَةُ الصَّارِخَةُ وَ الْمَرْأَةُ الشَّمْطَاءُ تِلْقَاءَ فَرْجِهَا وَ الْأَتَانُ الْعَضْبَاءُ يَعْنِي الْجَدْعَاءَ فَمَنْ أَوْجَسَ فِي نَفْسِهِ مِنْهُنَّ شَيْئاً فَلْيَقُلْ اعْتَصَمْتُ بِكَ يَا رَبِّ مِنْ شَرِّ مَا أَجِدُ فِي نَفْسِي قَالَ فَيُعْصَمُ مِنْ ذَلِكَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473624\">H 14941</a> – From him, from Bakr Bin Salih, from Suleyman Al-Ja’fary, who has narrated:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Al-Hassan Musa</span><sup>asws</sup> having said, ‘The evil, for the traveller in his road, are five things – The cawing crow on his right and spreading its tail; and the howling wolf which howls on the face of the man while sitting on it’s tail and raises its voice and lowers it three times; and the deer which crossing from the right to the left, and the crying owl, and an old woman coming in from the front, and confronting a female (astray) donkey. So the one who feels anything from these for himself, so he should immediately say, ‘I adhere to You<sup>azwj</sup>, O Lord<sup>azwj</sup>, from the evil of what I find in (front of) myself’. He<sup>asws</sup> said; ‘He would be protected from that’. "
          ],
          "en.sarwar": [
            "494. Muhammad Bin Yahya, from Salmat Bin Al-Khattab, from Abdullah, from Muhammad Bin Sinan, from Abdullah Bin Al-Qasim, from Amro Bin Abu Maqdam who said: Abu Abdullah (a.s.) said: ‘Allah (azwj) Blessed and High has Adorned our (a.s.) Shites with the forbearance, and Covered them with the knowledge by His (azwj) Knowledge of them before He (azwj) Created Adam (as)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 418)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15179,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:18",
        "text": [
          "14942- مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنْ عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ عَمْرِو بْنِ أَبِي الْمِقْدَامِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى زَيَّنَ شِيعَتَنَا بِالْحِلْمِ وَ غَشَّاهُمْ بِالْعِلْمِ لِعِلْمِهِ بِهِمْ قَبْلَ أَنْ يَخْلُقَ آدَمَ (عليه السلام)."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473625\">H 14942</a> – Muhammad Bin Yahya, from Salmat Bin Al-Khattab, from Abdullah, from Muhammad Bin Sinan, from Abdullah Bin Al-Qasim, from Amro Bin Abu Maqdam who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘Allah<sup>azwj</sup> Blessed and High has Adorned our<sup>asws</sup> Shites with the forbearance, and Covered them with the knowledge by His<sup>azwj</sup> Knowledge of them before He<sup>azwj</sup> Created Adam<sup>as</sup>’."
          ],
          "en.sarwar": [
            "495. Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbaar, and a number of our companions, from Sahl Bin Ziyad together, from Ibn Fazzaal, from Sa’albat Bin Maymoun, from Umar Bin Aban, from Al-Sabbaah Bin Sayaabat, who has said: Abu Abdullah (a.s.) has said that: ‘The man who loves you (Shites) and does not know what you are saying (believe in), so Allah (azwj) Enters him into the Paradise. And if the man hates you (Shites), and does not know what you are saying (believing in), so Allah (azwj) would Enter him into the Fire. And the man from among you would fill his book (of deeds) from without (having performed) deeds’. I said, ‘May I be sacrificed for you (a.s.), and how can that be?’ He (a.s.) said: ‘He passed by the group belittling us, they see him, and some of them say to the others, ‘Refrain, for this man is from their (a.s.) Shites’. And the man from our (a.s.) Shites passes by them, so they mock him and speak (bad) regarding him, so Allah (azwj) Writes for him Rewards, due to that, until his book (of) deeds gets filled up without (having performed) any deeds’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول وقيل ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 419)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15180,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:19",
        "text": [
          "14943- أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنِ ابْنِ فَضَّالٍ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ عُمَرَ بْنِ أَبَانٍ عَنِ الصَّبَّاحِ بْنِ سَيَابَةَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ إِنَّ الرَّجُلَ لَيُحِبُّكُمْ وَ مَا يَدْرِي مَا تَقُولُونَ فَيُدْخِلُهُ اللَّهُ عَزَّ وَ جَلَّ الْجَنَّةَ وَ إِنَّ الرَّجُلَ لَيُبْغِضُكُمْ وَ مَا يَدْرِي مَا تَقُولُونَ فَيُدْخِلُهُ اللَّهُ عَزَّ وَ جَلَّ النَّارَ وَ إِنَّ الرَّجُلَ مِنْكُمْ لَتُمْلَأُ صَحِيفَتُهُ مِنْ غَيْرِ عَمَلٍ قُلْتُ وَ كَيْفَ يَكُونُ ذَلِكَ قَالَ يَمُرُّ بِالْقَوْمِ يَنَالُونَ مِنَّا فَإِذَا رَأَوْهُ قَالَ بَعْضُهُمْ لِبَعْضٍ كُفُّوا فَإِنَّ هَذَا الرَّجُلَ مِنْ شِيعَتِهِمْ وَ يَمُرُّ بِهِمُ الرَّجُلُ مِنْ شِيعَتِنَا فَيَهْمِزُونَهُ وَ يَقُولُونَ فِيهِ فَيَكْتُبُ اللَّهُ لَهُ بِذَلِكَ حَسَنَاتٍ حَتَّى يَمْلَأَ صَحِيفَتَهُ مِنْ غَيْرِ عَمَلٍ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473626\">H 14943</a> – Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbaar, and a number of our companions, from Sahl Bin Ziyad together, from Ibn Fazzaal, from Sa’albat Bin Maymoun, from Umar Bin Aban, from Al-Sabbaah Bin Sayaabat, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said that: ‘The man who loves you (Shites) and does not know what you are saying (believe in), so Allah<sup>azwj</sup> Enters him into the Paradise. And if the man hates you (Shites), and does not know what you are saying (believing in), so Allah<sup>azwj</sup> would Enter him into the Fire. And the man from among you would fill his book (of deeds) from without (having performed) deeds’. I said, ‘May I be sacrificed for you<sup>asws</sup>, and how can that be?’ He<sup>asws</sup> said: ‘He passed by the group belittling us, they see him, and some of them say to the others, ‘Refrain, for this man is from their<sup>asws</sup> Shites’. And the man from our<sup>asws</sup> Shites passes by them, so they mock him and speak (bad) regarding him, so Allah<sup>azwj</sup> Writes for him Rewards, due to that, until his book (of) deeds gets filled up without (having performed) any deeds’."
          ],
          "en.sarwar": [
            "496. A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Al-Jaham, from Abu Khadija who said: Abu Abdullah (a.s.) said to me; ‘How much (distance is there) between you and Al-Basra?’ I said, ‘It is five (days) by the water (sea) if the wind is good, and upon the back (of the earth) eight days or approximate to that’. So he (a.s.) said: ‘This is not near. Visit each other frequently for there will not be an escape on the Day of Judgement from each human being to bring a witness who would testify for him upon his Religion’. And said: ‘If a Muslims sees his brother, it is a revival for his Religion if he Mentions Allah (azwj) (during their meeting)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 419)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 405)"
        ],
        "index": 15181,
        "local_index": 20,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:20",
        "text": [
          "14944- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ أَبِي الْجَهْمِ عَنْ أَبِي خَدِيجَةَ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كَمْ بَيْنَكَ وَ بَيْنَ الْبَصْرَةِ قُلْتُ فِي الْمَاءِ خَمْسٌ إِذَا طَابَتِ الرِّيحُ وَ عَلَى الظَّهْرِ ثَمَانٍ وَ نَحْوُ ذَلِكَ فَقَالَ مَا أَقْرَبَ هَذَا تَزَاوَرُوا وَ يَتَعَاهَدُ بَعْضُكُمْ بَعْضاً فَإِنَّهُ لَا بُدَّ يَوْمَ الْقِيَامَةِ مِنْ أَنْ يَأْتِيَ كُلُّ إِنْسَانٍ بِشَاهِدٍ يَشْهَدُ لَهُ عَلَى دِينِهِ وَ قَالَ إِنَّ الْمُسْلِمَ إِذَا رَأَى أَخَاهُ كَانَ حَيَاةً لِدِينِهِ إِذَا ذَكَرَ اللَّهَ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473627\">H 14944</a> – A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Al-Jaham, from Abu Khadija who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said to me; ‘How much (distance is there) between you and Al-Basra?’ I said, ‘It is five (days) by the water (sea) if the wind is good, and upon the back (of the earth) eight days or approximate to that’. So he<sup>asws</sup> said: ‘This is not near. Visit each other frequently for there will not be an escape on the Day of Judgement from each human being to bring a witness who would testify for him upon his Religion’. And said: ‘If a Muslims sees his brother, it is a revival for his Religion if he Mentions Allah<sup>azwj</sup> (during their meeting)’."
          ],
          "en.sarwar": [
            "497. Ali Bin Ibrahiim, from his father, from Hammaad Bin Isa, from Rabi’e, who has narrated the following: Abu Abdullah (a.s.) has said; ‘By Allah (azwj)! No one from the Arabs or the non-Arabs loves us (a.s.) except the people of noble houses, and the (noble) origins; and no one from these ones and those ones hates us (a.s.) except for all the filthy ones and of illegitimate origin’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 420)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 405)"
        ],
        "index": 15182,
        "local_index": 21,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:21",
        "text": [
          "14945- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيٍّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ وَ اللَّهِ لَا يُحِبُّنَا مِنَ الْعَرَبِ وَ الْعَجَمِ إِلَّا أَهْلُ الْبُيُوتَاتِ وَ الشَّرَفِ وَ الْمَعْدِنِ وَ لَا يُبْغِضُنَا مِنْ هَؤُلَاءِ وَ هَؤُلَاءِ إِلَّا كُلُّ دَنَسٍ مُلْصَقٍ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473628\">H 14945</a> – Ali Bin Ibrahiim, from his father, from Hammaad Bin Isa, from Rabi’e, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said; ‘By Allah<sup>azwj</sup>! No one from the Arabs or the non-Arabs loves us<sup>asws</sup> except the people of noble houses, and the (noble) origins; and no one from these ones and those ones hates us<sup>asws</sup> except for all the filthy ones and of illegitimate origin’."
          ],
          "en.sarwar": [
            "498. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Khalid, and Al-Husayn Bin Sa’d, from Al-Nazar Bin Suweyd, from Yahya Al-Halby, from Haroun Bin Kharjat, from Abu Baseer, who has narrated the following: Abu Ja’far (a.s.) regarding the Statement of Allah (azwj) Mighty and Majestic: “[2:247] And their prophet said to them: Surely Allah has raised Talut to be a king over you. He (a.s.) said: ‘He (as) was neither from the grandsons of the Prophets (as) nor was he (as) from the grandsons of the kings’. He said: Surely Allah has chosen him in preference to you”. And Said: “[2:248] And the prophet said to them: Surely the sign of His kingdom is, that there shall come to you the chest in which there is tranquillity from your Lord and residue of the relics of what the children of Musa and the children of Haroun have left, the angels bearing it”. And Allah (azwj) Said: “[2:249] Surely Allah will try you with a river; whoever then drinks from it, he is not of me, and whoever does not taste of it, he is surely of me, So they drank from it except for three hundred and thirteen men. From them were those who drank, and those who did not drink. So when it was time for duel, the ones who had drunk they said: We have today no power against Jalut and his forces. And those who did not drink said: How often has a small party vanquished a numerous host by Allah’s permission, and Allah is with the patient”."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 426)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15183,
        "local_index": 22,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:22",
        "text": [
          "14946- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ وَ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنْ هَارُونَ بْنِ خَارِجَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّ اللَّهَ قَدْ بَعَثَ لَكُمْ طالُوتَ مَلِكاً قالُوا أَنَّى يَكُونُ لَهُ الْمُلْكُ عَلَيْنا وَ نَحْنُ أَحَقُّ بِالْمُلْكِ مِنْهُ قَالَ لَمْ يَكُنْ مِنْ سِبْطِ النُّبُوَّةِ وَ لَا مِنْ سِبْطِ الْمَمْلَكَةِ قالَ إِنَّ اللَّهَ اصْطَفاهُ عَلَيْكُمْ وَ قَالَ إِنَّ آيَةَ مُلْكِهِ أَنْ يَأْتِيَكُمُ التَّابُوتُ فِيهِ سَكِينَةٌ مِنْ رَبِّكُمْ وَ بَقِيَّةٌ مِمَّا تَرَكَ آلُ مُوسى وَ آلُ هارُونَ فَجَاءَتْ بِهِ الْمَلَائِكَةُ تَحْمِلُهُ ",
          "وَ قَالَ اللَّهُ جَلَّ ذِكْرُهُ إِنَّ اللَّهَ مُبْتَلِيكُمْ بِنَهَرٍ فَمَنْ شَرِبَ مِنْهُ فَلَيْسَ مِنِّي وَ مَنْ لَمْ يَطْعَمْهُ فَإِنَّهُ مِنِّي فَشَرِبُوا مِنْهُ إِلَّا ثَلَاثَمِائَةٍ وَ ثَلَاثَةَ عَشَرَ رَجُلًا مِنْهُمْ مَنِ اغْتَرَفَ وَ مِنْهُمْ مَنْ لَمْ يَشْرَبْ فَلَمَّا بَرَزُوا قَالَ الَّذِينَ اغْتَرَفُوا لا طاقَةَ لَنَا الْيَوْمَ بِجالُوتَ وَ جُنُودِهِ وَ قَالَ الَّذِينَ لَمْ يَغْتَرِفُوا كَمْ مِنْ فِئَةٍ قَلِيلَةٍ غَلَبَتْ فِئَةً كَثِيرَةً بِإِذْنِ اللَّهِ وَ اللَّهُ مَعَ الصَّابِرِينَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473629\">H 14946</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Khalid, and Al-Husayn Bin Sa’d, from Al-Nazar Bin Suweyd, from Yahya Al-Halby, from Haroun Bin Kharjat, from Abu Baseer, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> regarding the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[2:247] And their prophet said to them: Surely Allah has raised Talut to be a king over you. </span>He<sup>asws</sup> said: ‘He<sup>as</sup> was neither from the grandsons of the Prophets<sup>as</sup> nor was he<sup>as</sup> from the grandsons of the kings’. <span class=\"ibTxt\">He said: Surely Allah has chosen him in preference to you”</span>. And Said: <span class=\"ibTxt\">“[2:248] And the prophet said to them: Surely the sign of His kingdom is, that there shall come to you the chest in which there is tranquillity from your Lord and residue of the relics of what the children of Musa and the children of Haroun have left, the angels bearing it”</span>. ",
            "And Allah<sup>azwj</sup> Said: <span class=\"ibTxt\">“[2:249] Surely Allah will try you with a river; whoever then drinks from it, he is not of me, and whoever does not taste of it, he is surely of me, </span>So they drank from it except for three hundred and thirteen men. From them were those who drank, and those who did not drink. So when it was time for duel, the ones who had drunk <span class=\"ibTxt\">they said: We have today no power against Jalut and his forces. </span>And those who did not drink <span class=\"ibTxt\">said: How often has a small party vanquished a numerous host by Allah's permission, and Allah is with the patient”</span>."
          ],
          "en.sarwar": [
            "499. From him, from Ahmad Bin Muhammad, from Al-Husayn Bin Saeed, from Fazaalat Bin Ayyub, from Yahya Al-Jalby, from Abdullah Bin Suleyman, who has narrated the following: Abu Ja’far (a.s.) said after reciting: “Surely the sign of His kingdom is, that there shall come to you the chest in which there is tranquillity from your Lord and residue of the relics of what the children of Musa and the children of Haroun have left, the angels bearing it”(2:248). He (a.s.) said: ‘They are described in the Verse of ‘Al-Baqra’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 428)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15184,
        "local_index": 23,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:23",
        "text": [
          "14947- عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ يَحْيَى الْحَلَبِيِّ عَنْ عَبْدِ اللَّهِ بْنِ سُلَيْمَانَ عَنْ أَبِي جَعْفَرٍ (عليه السلام) أَنَّهُ قَرَأَ إِنَّ آيَةَ مُلْكِهِ أَنْ يَأْتِيَكُمُ التَّابُوتُ فِيهِ سَكِينَةٌ مِنْ رَبِّكُمْ وَ بَقِيَّةٌ مِمَّا تَرَكَ آلُ مُوسى وَ آلُ هارُونَ تَحْمِلُهُ الْمَلائِكَةُ قَالَ كَانَتْ تَحْمِلُهُ فِي صُورَةِ الْبَقَرَةِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473630\">H 14947</a> – From him, from Ahmad Bin Muhammad, from Al-Husayn Bin Saeed, from Fazaalat Bin Ayyub, from Yahya Al-Jalby, from Abdullah Bin Suleyman, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> said after reciting<a id=\"_ftnref32\"></a><sup>[32]</sup>: <span class=\"ibTxt\">“Surely the sign of His kingdom is, that there shall come to you the chest in which there is tranquillity from your Lord and residue of the relics of what the children of Musa and the children of Haroun have left, the angels bearing it”(2:248)</span>. He<sup>asws</sup> said: ‘They are described in the Verse of ‘Al-Baqra’."
          ],
          "en.sarwar": [
            "500. Ali Bin Ibrahim, from his father, from Hammaad Bin Isa, from Hareyz, from the one who informed him, who has narrated the following: Abu Ja’far (a.s.) regarding the Statement of Allah (azwj) Blessed and High: ““there shall come to you the chest in which there is tranquillity from your Lord and residue of the relics of what the children of Musa and the children of Haroun have left, the angels bearing it”, he (a.s.) said: ‘The broken pieces of the Tablets in which was the Knowledge and the Wisdom’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 428)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15185,
        "local_index": 24,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:24",
        "text": [
          "14948- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي جَعْفَرٍ (عليه السلام) فِي قَوْلِ اللَّهِ تَبَارَكَ وَ تَعَالَى يَأْتِيَكُمُ التَّابُوتُ فِيهِ سَكِينَةٌ مِنْ رَبِّكُمْ وَ بَقِيَّةٌ مِمَّا تَرَكَ آلُ مُوسى وَ آلُ هارُونَ تَحْمِلُهُ الْمَلائِكَةُ قَالَ رَضْرَاضُ الْأَلْوَاحِ فِيهَا الْعِلْمُ وَ الْحِكْمَةُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473631\">H 14948</a> – Ali Bin Ibrahim, from his father, from Hammaad Bin Isa, from Hareyz, from the one who informed him, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> regarding the Statement of Allah<sup>azwj</sup> Blessed and High: “<span class=\"ibTxt\">“there shall come to you the chest in which there is tranquillity from your Lord and residue of the relics of what the children of Musa and the children of Haroun have left, the angels bearing it”</span>, he<sup>asws</sup> said: ‘The broken pieces of the Tablets in which was the Knowledge and the Wisdom’."
          ],
          "en.sarwar": [
            "501. A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Al-Hassan Bin Zareyf, from Abdul Samad Bin Bashir, from Abu Al-Jaroud, who has narrated the following: Abu Ja’far (a.s.) said to me: ‘O Abu Al-Jaroud! What are they saying to you all with regards to Al-Hassan (a.s.) and Al-Husayn (a.s.)?’ I said, ‘They are denying us that the two of them (a.s.) are the sons (a.s.) of the Rasool Allah (saww)’. He (a.s.) said: ‘So by which thing do you argue against them?’ I said, ‘We argue against them by the Statement of Allah (azwj) regarding Isa Bin Maryam (as): “[6:84] and of his descendants, Dawood and Sulaiman and Ayub and Yusuf and Musa and Haroun; and thus do We reward those who do good (to others) [6:85] And Zakariya and Yahya and Isa”. So He (azwj) Made Isa Bin Maryam (as) to be from the descendants of Noah (as)’. He (a.s.) said: ‘So what is it that they say to you?’ I said, ‘They say, ‘The sons of a daughter can be from the sons, but they still are not from the linage’. He (a.s.) said: ‘So which argument do you argue against them with?’ I said, ‘We argue against them by the Statement of Allah (azwj) to His (azwj) Messenger (saww): “[3:61] say: Come let us call our sons and your sons and our women and your women and ourselves and your selves”. He (a.s.) said: ‘So what do they say?’ I said, ‘They say that in the speech of the Arabs a man may say ‘our sons’ for the sons of another man’. (The narrator) said, ‘Abu Ja’far (a.s.) said: ‘O Abu Al-Jaroud! I (a.s.) will give it (proof) from the Book of Allah (azwj) that the two of them (a.s.) are from the progeny of the Rasool Allah (saww). None shall reject it except for the infidel’. I said, ‘May I be sacrificed for you (a.s.), and where is that?’ He (a.s.) said: ‘Where Allah (azwj) Says: “[4:23] Forbidden to you are your mothers and your daughters and your sisters - the Verse until it ends with the Words of the Blessed and High and the wives of your sons who are of your own loins”. So ask them, O Abu Al-Jaroud, was it Permissible for the Rasool Allah (saww) to marry the wives of the two of them (a.s.)? If they say, ‘Yes’, they lie, are mischievous, and if they say, ‘No’, so the two of them (a.s.) are from his (saww) seed’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن وربما قيل صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 431)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15186,
        "local_index": 25,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:25",
        "text": [
          "14949- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ الْحَسَنِ بْنِ ظَرِيفٍ عَنْ عَبْدِ الصَّمَدِ بْنِ بَشِيرٍ عَنْ أَبِي الْجَارُودِ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ قَالَ [لِي] أَبُو جَعْفَرٍ (عليه السلام) يَا أَبَا الْجَارُودِ مَا يَقُولُونَ لَكُمْ فِي الْحَسَنِ وَ الْحُسَيْنِ (عليه السلام) قُلْتُ يُنْكِرُونَ عَلَيْنَا أَنَّهُمَا ابْنَا رَسُولِ اللَّهِ (صلى الله عليه وآله) قَالَ فَأَيَّ شَيْ‏ءٍ احْتَجَجْتُمْ عَلَيْهِمْ قُلْتُ احْتَجَجْنَا عَلَيْهِمْ بِقَوْلِ اللَّهِ عَزَّ وَ جَلَّ فِي عِيسَى ابْنِ مَرْيَمَ (عليهما السلام) وَ مِنْ ذُرِّيَّتِهِ داوُدَ وَ سُلَيْمانَ وَ أَيُّوبَ وَ يُوسُفَ وَ مُوسى وَ هارُونَ وَ كَذلِكَ نَجْزِي الْمُحْسِنِينَ وَ زَكَرِيَّا وَ يَحْيى وَ عِيسى فَجَعَلَ عِيسَى ابْنَ مَرْيَمَ مِنْ ذُرِّيَّةِ نُوحٍ (عليه السلام) ",
          "قَالَ فَأَيَّ شَيْ‏ءٍ قَالُوا لَكُمْ قُلْتُ قَالُوا قَدْ يَكُونُ وَلَدُ الِابْنَةِ مِنَ الْوَلَدِ وَ لَا يَكُونُ مِنَ الصُّلْبِ قَالَ فَأَيَّ شَيْ‏ءٍ احْتَجَجْتُمْ عَلَيْهِمْ قُلْتُ احْتَجَجْنَا عَلَيْهِمْ بِقَوْلِ اللَّهِ تَعَالَى لِرَسُولِهِ (صلى الله عليه وآله) فَقُلْ تَعالَوْا نَدْعُ أَبْناءَنا وَ أَبْناءَكُمْ وَ نِساءَنا وَ نِساءَكُمْ وَ أَنْفُسَنا وَ أَنْفُسَكُمْ قَالَ فَأَيَّ شَيْ‏ءٍ قَالُوا قُلْتُ قَالُوا قَدْ يَكُونُ فِي كَلَامِ الْعَرَبِ أَبْنَاءُ رَجُلٍ وَ آخَرُ يَقُولُ أَبْنَاؤُنَا ",
          "قَالَ فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) يَا أَبَا الْجَارُودِ لَأُعْطِيَنَّكَهَا مِنْ كِتَابِ اللَّهِ جَلَّ وَ تَعَالَى أَنَّهُمَا مِنْ صُلْبِ رَسُولِ اللَّهِ (صلى الله عليه وآله) لَا يَرُدُّهَا إِلَّا الْكَافِرُ قُلْتُ وَ أَيْنَ ذَلِكَ جُعِلْتُ فِدَاكَ قَالَ مِنْ حَيْثُ قَالَ اللَّهُ تَعَالَى حُرِّمَتْ عَلَيْكُمْ أُمَّهاتُكُمْ وَ بَناتُكُمْ وَ أَخَواتُكُمْ الْآيَةَ إِلَى أَنِ انْتَهَى إِلَى قَوْلِهِ تَبَارَكَ وَ تَعَالَى وَ حَلائِلُ أَبْنائِكُمُ الَّذِينَ مِنْ أَصْلابِكُمْ فَسَلْهُمْ يَا أَبَا الْجَارُودِ هَلْ كَانَ يَحِلُّ لِرَسُولِ اللَّهِ (صلى الله عليه وآله) نِكَاحُ حَلِيلَتَيْهِمَا فَإِنْ قَالُوا نَعَمْ كَذَبُوا وَ فَجَرُوا وَ إِنْ قَالُوا لَا فَهُمَا ابْنَاهُ لِصُلْبِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473632\">H 14949</a> – A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Al-Hassan Bin Zareyf, from Abdul Samad Bin Bashir, from Abu Al-Jaroud, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> said to me: ‘O Abu Al-Jaroud! What are they saying to you all with regards to Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup>?’ I said, ‘They are denying us that the two of them<sup>asws</sup> are the sons<sup>asws</sup> of the Rasool Allah<sup>saww</sup>’. He<sup>asws</sup> said: ‘So by which thing do you argue against them?’ I said, ‘We argue against them by the Statement of Allah<sup>azwj</sup> regarding Isa Bin Maryam<sup>as</sup>: <span class=\"ibTxt\">“[6:84] and of his descendants, Dawood and Sulaiman and Ayub and Yusuf and Musa and Haroun; and thus do We reward those who do good (to others) [6:85] And Zakariya and Yahya and Isa”</span>. So He<sup>azwj</sup> Made Isa Bin Maryam<sup>as</sup> to be from the descendants of Noah<sup>as</sup>’.",
            "He<sup>asws</sup> said: ‘So what is it that they say to you?’ I said, ‘They say, ‘The sons of a daughter can be from the sons, but they still are not from the linage’. He<sup>asws</sup> said: ‘So which argument do you argue against them with?’ I said, ‘We argue against them by the Statement of Allah<sup>azwj</sup> to His<sup>azwj</sup> Messenger<sup>saww</sup>: <span class=\"ibTxt\">“[3:61] say: Come let us call our sons and your sons and our women and your women and ourselves and your selves”</span>. He<sup>asws</sup> said: ‘So what do they say?’ I said, ‘They say that in the speech of the Arabs a man may say ‘our sons’ for the sons of another man’.",
            "(The narrator) said, ‘Abu Ja’far<sup>asws</sup> said: ‘O Abu Al-Jaroud! I<sup>asws</sup> will give it (proof) from the Book of Allah<sup>azwj</sup> that the two of them<sup>asws</sup> are from the progeny of the Rasool Allah<sup>saww</sup>. None shall reject it except for the infidel’. I said, ‘May I be sacrificed for you<sup>asws</sup>, and where is that?’ He<sup>asws</sup> said: ‘Where Allah<sup>azwj</sup> Says: <span class=\"ibTxt\">“[4:23] Forbidden to you are your mothers and your daughters and your sisters </span>- the Verse until it ends with the Words of the Blessed and High <span class=\"ibTxt\">and the wives of your sons who are of your own loins”</span>. So ask them, O Abu Al-Jaroud, was it Permissible for the Rasool Allah<sup>saww</sup> to marry the wives of the two of them<sup>asws</sup>? If they say, ‘Yes’, they lie, are mischievous, and if they say, ‘No’, so the two of them<sup>asws</sup> are from his<sup>saww</sup> seed’. "
          ],
          "en.sarwar": [
            "502. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from Al-Husayn Abu Al-A’ala Al-Khaffaf, who has narrated the following: Abu Abdullah (a.s.) has said: ‘When the people were defeated on the Day of Ohad and fled from the Prophet (saww), he (saww) turned towards them with his (saww) face and was saying: ‘I (saww) am Muhammad (saww)! I (saww) am the Rasool Allah (saww)! I (saww) have neither been killed nor have I (saww) died’. So and so, and so and so (Abu Bakr and Umar) turned towards him (saww) saying, ‘Now he (saww) is mocking with us as well and we have been defeated. And there remained with him (saww) Ali (a.s.) and Samaak Bin Kharsha Abu Dujana (ar), may Allah (azwj) have Mercy on him. So the Prophet (saww) called him (ar) over and said: ‘O Abu Dujana! Leave, for you (ar) are free from your pledge of allegiance. As for Ali (a.s.), so I (saww) am him (a.s.) and he (a.s.) is me (saww)’. So he came over and sat down in front of the Prophet (saww) and wept, and said, ‘No, by Allah (azwj)!’ And he (ar) raised his (ar) head towards the sky and said, ‘No, by Allah (azwj)! I (ar) will not make myself free from my pledge of allegiance. I (ar) gave my (ar) pledge of allegiance to you (saww), so where shall I (ar) go, to a wife who will die, or a son who will die, or a house which will be ruined and wealth which will be destroyed, and a term (death) which comes nearer?’ So the Prophet (saww) left him (ar), and he (ar) did not stop fighting until he was weakened by the wounds and he (ar) was on one side of him (saww) and Ali (a.s.) was on the other side of him (saww). So when he (ar) dropped, Ali (a.s.) carried him (ar) to the Prophet (saww) and placed him (ar) in his (saww) presence. So he (ar) said, ‘O Rasool Allah (saww), have I (ar) been loyal to my (ar) pledge of allegiance?’ He (saww) said: ‘Yes’. And the Prophet (saww) said good things for him (ar). And the people were attacking the Prophet (saww) from the right, so Ali (a.s.) defended him (saww). So when he (a.s.) defended him (saww), they attacked the Prophet (saww) from the left. That situation did not cease until his (a.s.) sword broke into three pieces. So he (a.s.) came to the Prophet (saww). He (a.s.) displayed it in front him (saww) and said: ‘This is my (a.s.) sword which has broken. Thus, it was on that day that the Prophet (saww) gave him (a.s.) Za Al-Fiqar (Zulfiqar). And when the Prophet (saww) saw that (Ali (a.s.)) was exhausted due to the frequency of the fighting, he (saww) raised his (saww) head towards the sky and he wept and said: ‘O Lord (azwj)! You (azwj) Promised me (saww) that You (azwj) would be Making Your (azwj) Religion to prevail, and if You (azwj) so Desire, it would not Tire You (azwj)’. Ali (a.s.) turned towards the Prophet (saww) and said: ‘O Rasool Allah (saww)! I (a.s.) heard a loud rumble and heard the galloping of Hayzoum (Horse of Jibraeel), and I (a.s.) did not attack to strike anyone except that he would fall dead before I (a.s.) struck him. So he (saww) said: ‘This was Jibraeel and Mikaeel, and Israfeel among the Angels’. Then Jibraeel (as) went and paused to the side of the Rasool Allah (saww). He said: ‘O Muhammad (saww), this is the comfort’. So he (saww) said: ‘Ali (a.s.) is from me (a.s.), and I (saww) am from him (a.s.)’. So Jibraeel said: ‘And I am from both of you (a.s.). Then the people (enemy) were defeated. So the Rasool Allah (saww) said to Ali (a.s.): ‘O Ali (a.s.)! Go with your (a.s.) sword until you are opposite to them. If you (a.s.) see them riding the camels and the horses are by their side, then they are intending to go to Makkah. And if you (a.s.) see them to be riding the horses and their camels are by their sides, so they are intending to go to Al-Medina. Ali (a.s.) came up to them, and they were upon their camels, so Abu Sufyan said to Ali (a.s.), ‘O Ali (a.s.)! What do you (a.s.) want. That is where we are going, to Makkah. So leave and go to your (a.s.) companion (saww)’. Jibraeel followed them, and when they heard the galloping of his horse, they strived to move faster, and he kept following them. So when they moved, they said, ‘It is the army of Muhammad (saww) which is coming’. Abu Sufyan entered Makkah and informed them of the news. The shepherds and the woodcutters came. So they entered Makkah. They said, ‘We saw the army of Muhammad (saww)!’ All of them left. Abu Sufyan descended at Makkah and followed their footsteps horse to the horse. The people of Makkah came and addressed Abu Sufyan and reproached him. And the Prophet (saww) moved and the flag was with Ali (a.s.) and he (a.s.) was in front of him (saww). So when he (a.s.) came up with the flag while moving in front and when they reached ‘Al-Uqba’, and the people saw him (a.s.), Ali (a.s.) called out: ‘O you people! This is Muhammad (saww). He (saww) never died and he (saww) was never killed!’ So the one who had said, ‘He (saww) is mocking us and we have been defeated’ (Abu Bakr or Umar)’, said, ‘This is Ali (a.s.) and flag is in his (a.s.) hands’, until the Prophet (saww) moved towards them, and the women of the Helpers were in their courtyards and on the doorways of their houses, and the men came out to him (saww) returning from their flight and escape. The women of the Helpers had scratched their faces, and spread their hair, and placed dust upon their foreheads, and had torn the sides of their dresses, and tied their abdomens for (the grief for) Prophet (saww). So when he (saww) saw them, he (saww) said good things for them and told them to cover themselves up and enter their respective houses. And he (saww) said: ‘Allah (azwj) Promised me (saww) that He (azwj) would Make His (azwj) Religion to prevail over all the Religions’. And Allah (azwj) Revealed unto Muhammad (saww): “[3:144] Muhammad is but a messenger, messengers (the like of whom) have passed away before him; if then he dies or is killed will you turn back upon your heels? And whoever turns back upon his heels, he will by no means do harm to Allah in the least”, the Verse."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 438)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15187,
        "local_index": 26,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:26",
        "text": [
          "14950- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْحُسَيْنِ أَبِي الْعَلَاءِ الْخَفَّافِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ لَمَّا انْهَزَمَ النَّاسُ يَوْمَ أُحُدٍ عَنِ النَّبِيِّ (صلى الله عليه وآله) انْصَرَفَ إِلَيْهِمْ بِوَجْهِهِ وَ هُوَ يَقُولُ أَنَا مُحَمَّدٌ أَنَا رَسُولُ اللَّهِ لَمْ أُقْتَلْ وَ لَمْ أَمُتْ فَالْتَفَتَ إِلَيْهِ فُلَانٌ وَ فُلَانٌ فَقَالَا الْآنَ يَسْخَرُ بِنَا أَيْضاً وَ قَدْ هُزِمْنَا وَ بَقِيَ مَعَهُ عَلِيٌّ (عليه السلام) وَ سِمَاكُ بْنُ خَرَشَةَ أَبُو دُجَانَةَ رَحِمَهُ اللَّهُ",
          "فَدَعَاهُ النَّبِيُّ (صلى الله عليه وآله) فَقَالَ يَا أَبَا دُجَانَةَ انْصَرِفْ وَ أَنْتَ فِي حِلٍّ مِنْ بَيْعَتِكَ فَأَمَّا عَلِيٌّ فَأَنَا هُوَ وَ هُوَ أَنَا فَتَحَوَّلَ وَ جَلَسَ بَيْنَ يَدَيِ النَّبِيِّ (صلى الله عليه وآله) وَ بَكَى وَ قَالَ لَا وَ اللَّهِ وَ رَفَعَ رَأْسَهُ إِلَى السَّمَاءِ وَ قَالَ لَا وَ اللَّهِ لَا جَعَلْتُ نَفْسِي فِي حِلٍّ مِنْ بَيْعَتِي إِنِّي بَايَعْتُكَ فَإِلَى مَنْ أَنْصَرِفُ يَا رَسُولَ اللَّهِ إِلَى زَوْجَةٍ تَمُوتُ أَوْ وَلَدٍ يَمُوتُ أَوْ دَارٍ تَخْرَبُ وَ مَالٍ يَفْنَى وَ أَجَلٍ قَدِ اقْتَرَبَ فَرَقَّ لَهُ النَّبِيُّ (صلى الله عليه وآله) فَلَمْ يَزَلْ يُقَاتِلُ حَتَّى أَثْخَنَتْهُ الْجِرَاحَةُ وَ هُوَ فِي وَجْهٍ وَ عَلِيٌّ (عليه السلام) فِي وَجْهٍ ",
          "فَلَمَّا أُسْقِطَ احْتَمَلَهُ عَلِيٌّ (عليه السلام) فَجَاءَ بِهِ إِلَى النَّبِيِّ (صلى الله عليه وآله) فَوَضَعَهُ عِنْدَهُ فَقَالَ يَا رَسُولَ اللَّهِ أَ وَفَيْتُ بِبَيْعَتِي قَالَ نَعَمْ وَ قَالَ لَهُ النَّبِيُّ (صلى الله عليه وآله) خَيْراً وَ كَانَ النَّاسُ يَحْمِلُونَ عَلَى النَّبِيِّ (صلى الله عليه وآله) الْمَيْمَنَةَ فَيَكْشِفُهُمْ عَلِيٌّ (عليه السلام) فَإِذَا كَشَفَهُمْ أَقْبَلَتِ الْمَيْسَرَةُ إِلَى النَّبِيِّ (صلى الله عليه وآله) فَلَمْ يَزَلْ كَذَلِكَ حَتَّى تَقَطَّعَ سَيْفُهُ بِثَلَاثِ قِطَعٍ فَجَاءَ إِلَى النَّبِيِّ (صلى الله عليه وآله  فَطَرَحَهُ بَيْنَ يَدَيْهِ وَ قَالَ هَذَا سَيْفِي قَدْ تَقَطَّعَ فَيَوْمَئِذٍ أَعْطَاهُ النَّبِيُّ (صلى الله عليه وآله) ذَا الْفَقَارِ ",
          "وَ لَمَّا رَأَى النَّبِيُّ (صلى الله عليه وآله) اخْتِلَاجَ سَاقَيْهِ مِنْ كَثْرَةِ الْقِتَالِ رَفَعَ رَأْسَهُ إِلَى السَّمَاءِ وَ هُوَ يَبْكِي وَ قَالَ يَا رَبِّ وَعَدْتَنِي أَنْ تُظْهِرَ دِينَكَ وَ إِنْ شِئْتَ لَمْ يُعْيِكَ فَأَقْبَلَ عَلِيٌّ (عليه السلام) إِلَى النَّبِيِّ (صلى الله عليه وآله) فَقَالَ يَا رَسُولَ اللَّهِ أَسْمَعُ دَوِيّاً شَدِيداً وَ أَسْمَعُ أَقْدِمْ حَيْزُومُ وَ مَا أَهُمُّ أَضْرِبُ أَحَداً إِلَّا سَقَطَ مَيِّتاً قَبْلَ أَنْ أَضْرِبَهُ فَقَالَ هَذَا جَبْرَئِيلُ وَ مِيكَائِيلُ وَ إِسْرَافِيلُ فِي الْمَلَائِكَةِ ",
          "ثُمَّ جَاءَ جَبْرَئِيلُ (عليه السلام) فَوَقَفَ إِلَى جَنْبِ رَسُولِ اللَّهِ (صلى الله عليه وآله) فَقَالَ يَا مُحَمَّدُ إِنَّ هَذِهِ لَهِيَ الْمُوَاسَاةُ فَقَالَ إِنَّ عَلِيّاً مِنِّي وَ أَنَا مِنْهُ فَقَالَ جَبْرَئِيلُ وَ أَنَا مِنْكُمَا ثُمَّ انْهَزَمَ النَّاسُ فَقَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) لِعَلِيٍّ (عليه السلام) يَا عَلِيُّ امْضِ بِسَيْفِكَ حَتَّى تُعَارِضَهُمْ فَإِنْ رَأَيْتَهُمْ قَدْ رَكِبُوا الْقِلَاصَ وَ جَنَبُوا الْخَيْلَ فَإِنَّهُمْ يُرِيدُونَ مَكَّةَ وَ إِنْ رَأَيْتَهُمْ قَدْ رَكِبُوا الْخَيْلَ وَ هُمْ يَجْنُبُونَ الْقِلَاصَ فَإِنَّهُمْ يُرِيدُونَ الْمَدِينَةَ ",
          "فَأَتَاهُمْ عَلِيٌّ (عليه السلام) فَكَانُوا عَلَى الْقِلَاصِ فَقَالَ أَبُو سُفْيَانَ لِعَلِيٍّ (عليه السلام) يَا عَلِيُّ مَا تُرِيدُ هُوَ ذَا نَحْنُ ذَاهِبُونَ إِلَى مَكَّةَ فَانْصَرِفْ إِلَى صَاحِبِكَ فَأَتْبَعَهُمْ جَبْرَئِيلُ (عليه السلام)  فَكُلَّمَا سَمِعُوا وَقْعَ حَافِرِ فَرَسِهِ جَدُّوا فِي السَّيْرِ وَ كَانَ يَتْلُوهُمْ فَإِذَا ارْتَحَلُوا قَالُوا هُوَ ذَا عَسْكَرُ مُحَمَّدٍ قَدْ أَقْبَلَ فَدَخَلَ أَبُو سُفْيَانَ مَكَّةَ فَأَخْبَرَهُمُ الْخَبَرَ وَ جَاءَ الرُّعَاةُ وَ الْحَطَّابُونَ فَدَخَلُوا مَكَّةَ فَقَالُوا رَأَيْنَا عَسْكَرَ مُحَمَّدٍ كُلَّمَا رَحَلَ أَبُو سُفْيَانَ نَزَلُوا يَقْدُمُهُمْ فَارِسٌ عَلَى فَرَسٍ أَشْقَرَ يَطْلُبُ آثَارَهُمْ فَأَقْبَلَ أَهْلُ مَكَّةَ عَلَى أَبِي سُفْيَانَ يُوَبِّخُونَهُ",
          "وَ رَحَلَ النَّبِيُّ (صلى الله عليه وآله) وَ الرَّايَةُ مَعَ عَلِيٍّ (عليه السلام) وَ هُوَ بَيْنَ يَدَيْهِ فَلَمَّا أَنْ أَشْرَفَ بِالرَّايَةِ مِنَ الْعَقَبَةِ وَ رَآهُ النَّاسُ نَادَى عَلِيٌّ (عليه السلام) أَيُّهَا النَّاسُ هَذَا مُحَمَّدٌ لَمْ يَمُتْ وَ لَمْ يُقْتَلْ فَقَالَ صَاحِبُ الْكَلَامِ الَّذِي قَالَ الْآنَ يَسْخَرُ بِنَا وَ قَدْ هُزِمْنَا هَذَا عَلِيٌّ وَ الرَّايَةُ بِيَدِهِ حَتَّى هَجَمَ عَلَيْهِمُ النَّبِيُّ (صلى الله عليه وآله) وَ نِسَاءُ الْأَنْصَارِ فِي أَفْنِيَتِهِمْ عَلَى أَبْوَابِ دُورِهِمْ وَ خَرَجَ الرِّجَالُ إِلَيْهِ يَلُوذُونَ بِهِ وَ يَثُوبُونَ إِلَيْهِ وَ النِّسَاءُ نِسَاءُ الْأَنْصَارِ قَدْ خَدَشْنَ الْوُجُوهَ وَ نَشَرْنَ الشُّعُورَ وَ جَزَزْنَ النَّوَاصِيَ وَ خَرَقْنَ الْجُيُوبَ وَ حَزَمْنَ الْبُطُونَ عَلَى النَّبِيِّ (صلى الله عليه وآله) فَلَمَّا رَأَيْنَهُ قَالَ لَهُنَّ خَيْراً وَ أَمَرَهُنَّ أَنْ يَسْتَتِرْنَ وَ يَدْخُلْنَ مَنَازِلَهُنَّ وَ قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ وَعَدَنِي أَنْ يُظْهِرَ دِينَهُ عَلَى الْأَدْيَانِ كُلِّهَا وَ أَنْزَلَ اللَّهُ عَلَى مُحَمَّدٍ (صلى الله عليه وآله) وَ ما مُحَمَّدٌ إِلَّا رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ أَ فَإِنْ ماتَ أَوْ قُتِلَ انْقَلَبْتُمْ عَلى أَعْقابِكُمْ وَ مَنْ يَنْقَلِبْ عَلى عَقِبَيْهِ فَلَنْ يَضُرَّ اللَّهَ شَيْئاً الْآيَةَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473633\">H 14950</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from Al-Husayn Abu Al-A’ala Al-Khaffaf, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘When the people were defeated on the Day of Ohad and fled from the Prophet<sup>saww</sup>, he<sup>saww</sup> turned towards them with his<sup>saww</sup> face and was saying: ‘I<sup>saww</sup> am Muhammad<sup>saww</sup>! I<sup>saww</sup> am the Rasool Allah<sup>saww</sup>! I<sup>saww</sup> have neither been killed nor have I<sup>saww</sup> died’. So and so, and so and so (Abu Bakr and Umar) turned towards him<sup>saww</sup> saying, ‘Now he<sup>saww</sup> is mocking with us as well and we have been defeated. And there remained with him<sup>saww</sup> Ali<sup>asws</sup> and Samaak Bin Kharsha Abu Dujana<sup>ar</sup>, may Allah<sup>azwj</sup> have Mercy on him. ",
            "So the Prophet<sup>saww</sup> called him<sup>ar</sup> over and said: ‘O Abu Dujana! Leave, for you<sup>ar</sup> are free from your pledge of allegiance. As for Ali<sup>asws</sup>, so I<sup>saww</sup> am him<sup>asws</sup> and he<sup>asws</sup> is me<sup>saww</sup>’.  So he came over and sat down in front of the Prophet<sup>saww</sup> and wept, and said, ‘No, by Allah<sup>azwj</sup>!’ And he<sup>ar</sup> raised his<sup>ar</sup> head towards the sky and said, ‘No, by Allah<sup>azwj</sup>! I<sup>ar</sup> will not make myself free from my pledge of allegiance. I<sup>ar</sup> gave my<sup>ar</sup> pledge of allegiance to you<sup>saww</sup>, so where shall I<sup>ar</sup> go, to a wife who will die, or a son who will die, or a house which will be ruined and wealth which will be destroyed, and a term (death) which comes nearer?’ So the Prophet<sup>saww</sup> left him<sup>ar</sup>, and he<sup>ar</sup> did not stop fighting until he was weakened by the wounds and he<sup>ar</sup> was on one side of him<sup>saww</sup> and Ali<sup>asws</sup> was on the other side of him<sup>saww</sup>. ",
            "So when he<sup>ar</sup> dropped, Ali<sup>asws</sup> carried him<sup>ar</sup> to the Prophet<sup>saww</sup> and placed him<sup>ar</sup> in his<sup>saww</sup> presence. So he<sup>ar</sup> said, ‘O Rasool Allah<sup>saww</sup>, have I<sup>ar</sup> been loyal to my<sup>ar</sup> pledge of allegiance?’ He<sup>saww</sup> said: ‘Yes’. And the Prophet<sup>saww</sup> said good things for him<sup>ar</sup>. And the people were attacking the Prophet<sup>saww</sup> from the right, so Ali<sup>asws</sup> defended him<sup>saww</sup>. So when he<sup>asws</sup> defended him<sup>saww</sup>, they attacked the Prophet<sup>saww</sup> from the left. That situation did not cease until his<sup>asws</sup> sword broke into three pieces. So he<sup>asws</sup> came to the Prophet<sup>saww</sup>. He<sup>asws</sup> displayed it in front him<sup>saww</sup> and said: ‘This is my<sup>asws</sup> sword which has broken. Thus, it was on that day that the Prophet<sup>saww</sup> gave him<sup>asws</sup> <span class=\"iTxt\">Za Al-Fiqar</span> (Zulfiqar).",
            "And when the Prophet<sup>saww</sup> saw that (Ali<sup>asws</sup>) was exhausted due to the frequency of the fighting, he<sup>saww</sup> raised his<sup>saww</sup> head towards the sky and he wept and said: ‘O Lord<sup>azwj</sup>! You<sup>azwj</sup> Promised me<sup>saww</sup> that You<sup>azwj</sup> would be Making Your<sup>azwj</sup> Religion to prevail, and if You<sup>azwj</sup> so Desire, it would not Tire You<sup>azwj</sup>’. Ali<sup>asws</sup> turned towards the Prophet<sup>saww</sup> and said: ‘O Rasool Allah<sup>saww</sup>! I<sup>asws</sup> heard a loud rumble and heard the galloping of Hayzoum (Horse of Jibraeel), and I<sup>asws</sup> did not attack to strike anyone except that he would fall dead before I<sup>asws</sup> struck him. So he<sup>saww</sup> said: ‘This was Jibraeel and Mikaeel, and Israfeel among the Angels’.",
            "Then Jibraeel<sup>as</sup> went and paused to the side of the Rasool Allah<sup>saww</sup>. He said: ‘O Muhammad<sup>saww</sup>, this is the comfort’. So he<sup>saww</sup> said: ‘Ali<sup>asws</sup> is from me<sup>asws</sup>, and I<sup>saww</sup> am from him<sup>asws</sup>’. So Jibraeel said: ‘And I am from both of you<sup>asws</sup>. Then the people (enemy) were defeated. So the Rasool Allah<sup>saww</sup> said to Ali<sup>asws</sup>: ‘O Ali<sup>asws</sup>! Go with your<sup>asws</sup> sword until you are opposite to them. If you<sup>asws</sup> see them riding the camels and the horses are by their side, then they are intending to go to Makkah. And if you<sup>asws</sup> see them to be riding the horses and their camels are by their sides, so they are intending to go to Al-Medina. ",
            "Ali<sup>asws</sup> came up to them, and they were upon their camels, so Abu Sufyan said to Ali<sup>asws</sup>, ‘O Ali<sup>asws</sup>! What do you<sup>asws</sup> want. That is where we are going, to Makkah. So leave and go to your<sup>asws</sup> companion<sup>saww</sup>’. Jibraeel followed them, and when they heard the galloping of his horse, they strived to move faster, and he kept following them. So when they moved, they said, ‘It is the army of Muhammad<sup>saww</sup> which is coming’. Abu Sufyan entered Makkah and informed them of the news. The shepherds and the woodcutters came. So they entered Makkah. They said, ‘We saw the army of Muhammad<sup>saww</sup>!’ All of them left. Abu Sufyan descended at Makkah and followed their footsteps horse to the horse. The people of Makkah came and addressed Abu Sufyan and reproached him. ",
            "And the Prophet<sup>saww</sup> moved and the flag was with Ali<sup>asws</sup> and he<sup>asws</sup> was in front of him<sup>saww</sup>. So when he<sup>asws</sup> came up with the flag while moving in front and when they reached ‘Al-Uqba’, and the people saw him<sup>asws</sup>, Ali<sup>asws</sup> called out: ‘O you people! This is Muhammad<sup>saww</sup>. He<sup>saww</sup> never died and he<sup>saww</sup> was never killed!’ So the one who had said, ‘He<sup>saww</sup> is mocking us and we have been defeated’ (Abu Bakr or Umar)’, said, ‘This is Ali<sup>asws</sup> and flag is in his<sup>asws</sup> hands’, until the Prophet<sup>saww</sup> moved towards them, and the women of the Helpers were in their courtyards and on the doorways of their houses, and the men came out to him<sup>saww</sup> returning from their flight and escape. The women of the Helpers had scratched their faces, and spread their hair, and placed dust upon their foreheads, and had torn the sides of their dresses, and tied their abdomens for (the grief for) Prophet<sup>saww</sup>. So when he<sup>saww</sup> saw them, he<sup>saww</sup> said good things for them and told them to cover themselves up and enter their respective houses. And he<sup>saww</sup> said: ‘Allah<sup>azwj</sup> Promised me<sup>saww</sup> that He<sup>azwj</sup> would Make His<sup>azwj</sup> Religion to prevail over all the Religions’. And Allah<sup>azwj</sup> Revealed unto Muhammad<sup>saww</sup>: <span class=\"ibTxt\">“[3:144] Muhammad is but a messenger, messengers (the like of whom) have passed away before him; if then he dies or is killed will you turn back upon your heels? And whoever turns back upon his heels, he will by no means do harm to Allah in the least”</span>, the Verse."
          ],
          "en.sarwar": [
            "503. Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, and someone else, from Muawiya Bin Ammaar, who has reported the following: Abu Abdullah (a.s.) has said; ‘When the Messenger (saww) of Allah (azwj) went out in a military expedition of Al-Hudaybiyya, it was the Month of Zil-al-Qadaha. So when he (saww) ended up at the place in which Ihram had to be worn, they did so and wore their weapons as well. So when it (news) reached the ‘الْمُشْرِكِينَ’ (Polytheists), they sent to him (saww) Khalid Bin Waleed to turn him (saww) back. He (saww) said; ‘Bring me a man who can take me (saww) via a different road to this one. So they came with a man from Muzaynat or from Juhaynat. He (saww) asked him, but he did not agree. So he (saww) said; ‘Bring to me (saww) a man other than him’. So they came with another man from Muzaynat, or from Juhaynat. He said, ‘I remember it. So he took them with him until they ended up at Al-Uqba. So he (saww) said: ‘The one who climbs it, Allah (azwj) would Forgive him just as He (azwj) Forgave the Children of Israel, so He (azwj) Said: “[7:161] and enter the gate making obeisance, We will forgive you your wrongs”. The cavalry of the Helpers, Al-Aws, and Al-Khazraj initiated the advance, and they were one thousand eight hundred of them. So when they descended to Al-Hudaybiyya, there was a woman who had her son with her at Al-Quleyb. So her son ran away. So when she established that it was the Rasool Allah (saww), she screamed, ‘These are Al-Sa’ibun, there is no problem to you from them’. The Rasool Allah (saww) came up to her and commanded her to draw a bucket of water. The Rasool Allah (saww) took it. He (saww) drank, and washed his (saww) face. She took its remaining bit and returned it back in the well. That well still has water until this time. And the Rasool Allah (saww) came out, and the Polytheists sent to him (saww) Aban Bin Saeed with some horsemen in front of them. Then they sent Al-Hulays, so he saw the animals being prepared for sacrifice. He returned and did not come to the Rasool Allah (saww), and said to Abu Sufyan: ‘ By Allah (azwj), it was not this that we agreed upon, to return the sacrifices from its place’. He said, ‘Be quiet! For you are only a Bedouin’. He said, ‘But, by Allah (azwj), stay away from Muhammad (saww) and what he (saww) wants, or else I shall revolt among Al-Ahabeysh’. He said, ‘Keep quiet until we take an agreement from Muhammad (saww)’. So they sent to him (saww) Urwat Bin Masoud and he had gone to the Qureysh regarding the people whom Al-Mugheira Bin Soh’ba had killed when they had gone with him from Al-Taef, and they used to be businessmen. So he (al-Mughirah) killed them and had come with their wealth to the Rasool Allah (saww). So the Rasool Allah (saww) had refused to accept it and said; ‘This is treachery, and we (saww) have no need with regards to it’. They sent him so he said, ‘O Rasool Allah (saww), this is Urwat Bin Masoud who has come to you, and he magnifies the sacrifices’. He (saww) said: ‘Make him stand here’. They brought him to stand. He said, ‘O Muhammad (saww), why have you (saww) come?’ He (saww) said: ‘I (saww) have come to circumambulate (Tawaaf) the House, and perform Sa’ee between Al-Safa and Al-Marwa, and sacrifice this camel and leave its meat for you’. He said, ‘No, I swear by al-laat and al-uzza, a person like you (saww) should not be sent back from what he has come for. If your (saww) people bind you (saww) to Allah (azwj) and the mercy, to enter their city without their permission, and cut-off their relationships, and make enemies to go against them’. So the Rasool Allah (saww) said: ‘I (saww) will not do it until I (saww) enter the city’. And when Urwat Bin Masoud was speaking with the Rasool Allah (saww), he was holding his beard, and Al-Mugheira was standing near to his head. So he hit him by his hand and said, ‘Who is this, O Muhammad (saww)! So he (saww) said: ‘This is the son of your brother, Al-Mugheira’. He said, ‘O treachery! By Allah (azwj), I did not come here except for the reconciliation with you (saww)’. So he returned to them and said to Abu Sufyan and his companions, ‘No, by Allah (azwj), a person like Muhammad (saww) should not be turned back from what he has come for’. So they sent to him (saww) Suhail Bin Amro and Huweytab Bin Abdul Uzza. So the Rasool Allah (saww) commanded for the sacrificial animals to be spread out in front of their eyes. He said, ‘Why have you (saww) come here?’ He (saww) said: ‘For circumambulation of the House, and the Sa’ee between Al-Safa and Al-Marwa, and sacrifice the animals and leave their meat between you’. If your (saww) people bind you (saww) to Allah (azwj) and the mercy from entering their city without their permission, and cut-off their relationships, and make their enemies to go against them’. He (a.s.) said; ‘The Rasool Allah (saww) refused the two of them, except that he (saww) would enter it. And the Rasool Allah (saww) had intended to send Umar to them. So he said, ‘O Rasool Allah (saww), my relatives are few, and I am among them of the status that you (saww) know about (a humiliating one). You (saww) should send Usman Bin Affan’. So the Rasool Allah (saww) sent for him and said, ‘Go to your people from the Believers. Give them the good news of what my (saww) Lord (azwj) has Promised me (saww) of the victory over Makkah’. So when Usman went, he met Aban Bin Saeed. So he delayed the camel and made room for Usman to ride with him. Usman entered (Makkah) and there was a skirmish. So Suhail Bin Amro seated himself in the presence of the Rasool Allah (saww), and Usman sat in the army of the Polytheists. And the Rasool Allah (saww) got the Muslims to pledge their allegiances and tap one by his hand upon the other and Muslims said: ‘How good of Usman that he has circumambulated the House and performed Sa’ee between Al-Safa and Al-Marwa and be lawful (out of Ihraam)’. So the Rasool Allah (saww) said: ‘He did what he had to do’. So when Usman came, the Rasool Allah (saww) said to him; ‘Did you circumambulate the House?’ He said, ‘I could not circumambulate the House whilst the Rasool Allah (saww) had not circumambulated it’. Then he mentioned the story and what had happened’. So he (saww) said to Ali (a.s.): ‘Write – In the Name of Allah (azwj), the Beneficent, the Merciful’. Suhail said, ‘I don’t know what the Beneficent, the Merciful is except that I think this is the one at Al-Yamama. But, write as we write – ‘By Your (azwj) Name, our Allah (azwj)’. He (saww) said; ‘And write this – What has been agreed upon by the Rasool Allah (saww) and Suhail Bin Amro’. So Suhail said, ‘What are we fighting you (saww) for, O Muhammad (saww)?’ So he (saww) said; ‘I (saww) and the Rasool Allah (saww) and I (saww) am Muhammad bin Abdullah (saww)’. So the people said: ‘You (saww) are the Rasool Allah (saww)’. He said, ‘Write – Write that this is what has been agreed upon by Muhammad Bin Abdullah (saww)’. So the people said: ‘You (saww) are the Rasool Allah (saww)’. And what was in the agreement that – ‘The one who was from us, if he were to come to you, shall be returned back to us and the Rasool Allah (saww) will not keep him unwillingly from his religion, and the one who comes to us from you will not be returned back to you’. So the Rasool Allah (saww) said; ‘There is no need for us regarding them, and they should be allowed to worship Allah (azwj) among you openly, not in secret, and be allowed to exchange gifts between Al-Medina to Makkah’. And there was not agreement more magnificent in Blessings than it for it made Al-Islam to almost take over the people of Makkah. So Suhail Bin Amro struck his hand upon his son Abu Jandal, so he said, ‘The first of what we have agreed with you’. The Rasool Allah (saww) said: ‘Have I (saww) applied the agreement upon anything yet?’ He said, ‘O Muhammad (saww)! You (saww) are not a traitor’. So he went with Abu Jandal’. So he said, ‘O Rasool Allah (saww), you (saww) are handing me over to him?’ He (saww) said: ‘And I (saww) did not set any conditions for you’. And said: ‘Our Allah (azwj)! Make a way out for Abu Jandal!’"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثوق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 449)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15188,
        "local_index": 27,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:27",
        "text": [
          "14951- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ غَيْرِهِ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ لَمَّا خَرَجَ رَسُولُ اللَّهِ (صلى الله عليه وآله) فِي غَزْوَةِ الْحُدَيْبِيَةِ خَرَجَ فِي ذِي الْقَعْدَةِ فَلَمَّا انْتَهَى إِلَى الْمَكَانِ الَّذِي أَحْرَمَ فِيهِ أَحْرَمُوا وَ لَبِسُوا السِّلَاحَ فَلَمَّا بَلَغَهُ أَنَّ الْمُشْرِكِينَ قَدْ أَرْسَلُوا إِلَيْهِ خَالِدَ بْنَ الْوَلِيدِ لِيَرُدَّهُ قَالَ ابْغُونِي رَجُلًا يَأْخُذُنِي عَلَى غَيْرِ هَذَا الطَّرِيقِ فَأُتِيَ بِرَجُلٍ مِنْ مُزَيْنَةَ أَوْ مِنْ جُهَيْنَةَ فَسَأَلَهُ فَلَمْ يُوَافِقْهُ ",
          "فَقَالَ ابْغُونِي رَجُلًا غَيْرَهُ فَأُتِيَ بِرَجُلٍ آخَرَ إِمَّا مِنْ مُزَيْنَةَ وَ إِمَّا مِنْ جُهَيْنَةَ قَالَ فَذَكَرَ لَهُ فَأَخَذَهُ مَعَهُ حَتَّى انْتَهَى إِلَى الْعَقَبَةِ فَقَالَ مَنْ يَصْعَدْهَا حَطَّ اللَّهُ عَنْهُ كَمَا حَطَّ اللَّهُ عَنْ بَنِي إِسْرَائِيلَ فَقَالَ لَهُمُ ادْخُلُوا الْبابَ سُجَّداً... نَغْفِرْ لَكُمْ خَطاياكُمْ قَالَ فَابْتَدَرَهَا خَيْلُ الْأَنْصَارِ الْأَوْسِ وَ الْخَزْرَجِ قَالَ وَ كَانُوا أَلْفاً وَ ثَمَانَمِائَةٍ فَلَمَّا هَبَطُوا إِلَى الْحُدَيْبِيَةِ إِذَا امْرَأَةٌ مَعَهَا ابْنُهَا عَلَى الْقَلِيبِ فَسَعَى ابْنُهَا هَارِباً فَلَمَّا أَثْبَتَتْ أَنَّهُ رَسُولُ اللَّهِ (صلى الله عليه وآله) صَرَخَتْ بِهِ هَؤُلَاءِ الصَّابِئُونَ لَيْسَ عَلَيْكَ مِنْهُمْ بَأْسٌ",
          "فَأَتَاهَا رَسُولُ اللَّهِ (صلى الله عليه وآله) فَأَمَرَهَا فَاسْتَقَتْ دَلْواً مِنْ مَاءٍ فَأَخَذَهُ رَسُولُ اللَّهِ (صلى الله عليه وآله) فَشَرِبَ وَ غَسَلَ وَجْهَهُ فَأَخَذَتْ فَضْلَتَهُ فَأَعَادَتْهُ فِي الْبِئْرِ فَلَمْ تَبْرَحْ حَتَّى السَّاعَةِ وَ خَرَجَ رَسُولُ اللَّهِ (صلى الله عليه وآله) فَأَرْسَلَ إِلَيْهِ الْمُشْرِكُونَ أَبَانَ بْنَ سَعِيدٍ فِي الْخَيْلِ فَكَانَ بِإِزَائِهِ ثُمَّ أَرْسَلُوا الْحُلَيْسَ فَرَأَى الْبُدْنَ وَ هِيَ تَأْكُلُ بَعْضُهَا أَوْبَارَ بَعْضٍ فَرَجَعَ وَ لَمْ يَأْتِ رَسُولَ اللَّهِ (صلى الله عليه وآله) وَ قَالَ لِأَبِي سُفْيَانَ يَا أَبَا سُفْيَانَ أَمَا وَ اللَّهِ مَا عَلَى هَذَا حَالَفْنَاكُمْ عَلَى أَنْ تَرُدُّوا الْهَدْيَ عَنْ مَحِلِّهِ فَقَالَ اسْكُتْ فَإِنَّمَا أَنْتَ أَعْرَابِيٌّ فَقَالَ أَمَا وَ اللَّهِ لَتُخَلِّيَنَّ عَنْ مُحَمَّدٍ وَ مَا أَرَادَ أَوْ لَأَنْفَرِدَنَّ فِي الْأَحَابِيشِ فَقَالَ اسْكُتْ حَتَّى نَأْخُذَ مِنْ مُحَمَّدٍ وَلْثاً ",
          "فَأَرْسَلُوا إِلَيْهِ عُرْوَةَ بْنَ مَسْعُودٍ وَ قَدْ كَانَ جَاءَ إِلَى قُرَيْشٍ فِي الْقَوْمِ الَّذِينَ أَصَابَهُمُ الْمُغِيرَةُ بْنُ شُعْبَةَ كَانَ خَرَجَ مَعَهُمْ مِنَ الطَّائِفِ وَ كَانُوا تُجَّاراً فَقَتَلَهُمْ وَ جَاءَ بِأَمْوَالِهِمْ إِلَى رَسُولِ اللَّهِ (صلى الله عليه وآله) فَأَبَى رَسُولُ اللَّهِ (صلى الله عليه وآله) أَنْ يَقْبَلَهَا وَ قَالَ هَذَا غَدْرٌ وَ لَا حَاجَةَ لَنَا فِيهِ فَأَرْسَلُوا إِلَى رَسُولِ اللَّهِ (صلى الله عليه وآله) فَقَالُوا يَا رَسُولَ اللَّهِ هَذَا عُرْوَةُ بْنُ مَسْعُودٍ قَدْ أَتَاكُمْ وَ هُوَ يُعَظِّمُ الْبُدْنَ قَالَ فَأَقِيمُوهَا فَأَقَامُوهَا فَقَالَ يَا مُحَمَّدُ مَجِي‏ءَ مَنْ جِئْتَ قَالَ جِئْتُ أَطُوفُ بِالْبَيْتِ وَ أَسْعَى بَيْنَ الصَّفَا وَ الْمَرْوَةِ وَ أَنْحَرُ هَذِهِ الْإِبِلَ وَ أُخَلِّي عَنْكُمْ عَنْ لُحْمَانِهَا ",
          "قَالَ لَا وَ اللَّاتِ وَ الْعُزَّى فَمَا رَأَيْتُ مِثْلَكَ رُدَّ عَمَّا جِئْتَ لَهُ إِنَّ قَوْمَكَ يُذَكِّرُونَكَ اللَّهَ وَ الرَّحِمَ أَنْ تَدْخُلَ عَلَيْهِمْ بِلَادَهُمْ بِغَيْرِ إِذْنِهِمْ وَ أَنْ تَقْطَعَ أَرْحَامَهُمْ وَ أَنْ تُجَرِّيَ عَلَيْهِمْ عَدُوَّهُمْ فَقَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) مَا أَنَا بِفَاعِلٍ حَتَّى أَدْخُلَهَا قَالَ وَ كَانَ عُرْوَةُ بْنُ مَسْعُودٍ حِينَ كَلَّمَ رَسُولَ اللَّهِ (صلى الله عليه وآله) تَنَاوَلَ لِحْيَتَهُ وَ الْمُغِيرَةُ قَائِمٌ عَلَى رَأْسِهِ فَضَرَبَ بِيَدِهِ فَقَالَ مَنْ هَذَا يَا مُحَمَّدُ فَقَالَ هَذَا ابْنُ أَخِيكَ الْمُغِيرَةُ فَقَالَ يَا غُدَرُ وَ اللَّهِ مَا جِئْتَ إِلَّا فِي غَسْلِ سَلْحَتِكَ قَالَ فَرَجَعَ إِلَيْهِمْ فَقَالَ لِأَبِي سُفْيَانَ وَ أَصْحَابِهِ لَا وَ اللَّهِ مَا رَأَيْتُ مِثْلَ مُحَمَّدٍ رُدَّ عَمَّا جَاءَ لَهُ ",
          "فَأَرْسَلُوا إِلَيْهِ سُهَيْلَ بْنَ عَمْرٍو وَ حُوَيْطِبَ بْنَ عَبْدِ الْعُزَّى فَأَمَرَ رَسُولُ اللَّهِ (صلى الله عليه وآله) فَأُثِيرَتْ فِي وُجُوهِهِمُ الْبُدْنُ فَقَالَا مَجِي‏ءَ مَنْ جِئْتَ قَالَ جِئْتُ لِأَطُوفَ بِالْبَيْتِ وَ أَسْعَى بَيْنَ الصَّفَا وَ الْمَرْوَةِ وَ أَنْحَرَ الْبُدْنَ وَ أُخَلِّيَ بَيْنَكُمْ وَ بَيْنَ لُحْمَانِهَا فَقَالَا إِنَّ قَوْمَكَ يُنَاشِدُونَكَ اللَّهَ وَ الرَّحِمَ أَنْ تَدْخُلَ عَلَيْهِمْ بِلَادَهُمْ بِغَيْرِ إِذْنِهِمْ وَ تَقْطَعَ أَرْحَامَهُمْ وَ تُجَرِّيَ عَلَيْهِمْ عَدُوَّهُمْ قَالَ فَأَبَى عَلَيْهِمَا رَسُولُ اللَّهِ (صلى الله عليه وآله) إِلَّا أَنْ يَدْخُلَهَا وَ كَانَ رَسُولُ اللَّهِ (صلى الله عليه وآله) أَرَادَ أَنْ يَبْعَثَ عُمَرَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ عَشِيرَتِي قَلِيلٌ وَ إِنِّي فِيهِمْ عَلَى مَا تَعْلَمُ وَ لَكِنِّي أَدُلُّكَ عَلَى عُثْمَانَ بْنِ عَفَّانَ ",
          "فَأَرْسَلَ إِلَيْهِ رَسُولُ اللَّهِ (صلى الله عليه وآله) فَقَالَ انْطَلِقْ إِلَى قَوْمِكَ مِنَ الْمُؤْمِنِينَ فَبَشِّرْهُمْ بِمَا وَعَدَنِي رَبِّي مِنْ فَتْحِ مَكَّةَ فَلَمَّا انْطَلَقَ عُثْمَانُ لَقِيَ أَبَانَ بْنَ سَعِيدٍ فَتَأَخَّرَ عَنِ السَّرْحِ فَحَمَلَ عُثْمَانَ بَيْنَ يَدَيْهِ وَ دَخَلَ عُثْمَانُ فَأَعْلَمَهُمْ وَ كَانَتِ الْمُنَاوَشَةُ فَجَلَسَ سُهَيْلُ بْنُ عَمْرٍو عِنْدَ رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ جَلَسَ عُثْمَانُ فِي عَسْكَرِ الْمُشْرِكِينَ وَ بَايَعَ رَسُولُ اللَّهِ (صلى الله عليه وآله) الْمُسْلِمِينَ وَ ضَرَبَ بِإِحْدَى يَدَيْهِ عَلَى الْأُخْرَى لِعُثْمَانَ وَ قَالَ الْمُسْلِمُونَ طُوبَى لِعُثْمَانَ قَدْ طَافَ بِالْبَيْتِ وَ سَعَى بَيْنَ الصَّفَا وَ الْمَرْوَةِ وَ أَحَلَّ فَقَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) مَا كَانَ لِيَفْعَلَ فَلَمَّا جَاءَ عُثْمَانُ قَالَ لَهُ رَسُولُ اللَّهِ (صلى الله عليه وآله) أَ طُفْتَ بِالْبَيْتِ فَقَالَ مَا كُنْتُ لِأَطُوفَ بِالْبَيْتِ وَ رَسُولُ اللَّهِ (صلى الله عليه وآله) لَمْ يَطُفْ بِهِ ثُمَّ ذَكَرَ الْقِصَّةَ وَ مَا كَانَ فِيهَا ",
          "فَقَالَ لِعَلِيٍّ (عليه السلام) اكْتُبْ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ فَقَالَ سُهَيْلٌ مَا أَدْرِي مَا الرَّحْمَنُ الرَّحِيمُ إِلَّا أَنِّي أَظُنُّ هَذَا الَّذِي بِالْيَمَامَةِ وَ لَكِنِ اكْتُبْ كَمَا نَكْتُبُ بِاسْمِكَ اللَّهُمَّ قَالَ وَ اكْتُبْ هَذَا مَا قَاضَى عَلَيْهِ رَسُولُ اللَّهِ سُهَيْلَ بْنَ عَمْرٍو فَقَالَ سُهَيْلٌ فَعَلَى مَا نُقَاتِلُكَ يَا مُحَمَّدُ فَقَالَ أَنَا رَسُولُ اللَّهِ وَ أَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ فَقَالَ النَّاسُ أَنْتَ رَسُولُ اللَّهِ قَالَ اكْتُبْ فَكَتَبَ هَذَا مَا قَاضَى عَلَيْهِ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ فَقَالَ النَّاسُ أَنْتَ رَسُولُ اللَّهِ",
          "وَ كَانَ فِي الْقَضِيَّةِ أَنَّ مَنْ كَانَ مِنَّا أَتَى إِلَيْكُمْ رَدَدْتُمُوهُ إِلَيْنَا وَ رَسُولُ اللَّهِ غَيْرُ مُسْتَكْرِهٍ عَنْ دِينِهِ وَ مَنْ جَاءَ إِلَيْنَا مِنْكُمْ لَمْ نَرُدَّهُ إِلَيْكُمْ فَقَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) لَا حَاجَةَ لَنَا فِيهِمْ وَ عَلَى أَنْ يُعْبَدَ اللَّهُ فِيكُمْ عَلَانِيَةً غَيْرَ سِرٍّ وَ إِنْ كَانُوا لَيَتَهَادَوْنَ السُّيُورَ فِي الْمَدِينَةِ إِلَى مَكَّةَ وَ مَا كَانَتْ قَضِيَّةٌ أَعْظَمُ بَرَكَةً مِنْهَا لَقَدْ كَادَ أَنْ يَسْتَوْلِيَ عَلَى أَهْلِ مَكَّةَ الْإِسْلَامُ فَضَرَبَ سُهَيْلُ بْنُ عَمْرٍو عَلَى أَبِي جَنْدَلٍ ابْنِهِ فَقَالَ أَوَّلُ مَا قَاضَيْنَا عَلَيْهِ فَقَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) وَ هَلْ قَاضَيْتُ عَلَى شَيْ‏ءٍ فَقَالَ يَا مُحَمَّدُ مَا كُنْتَ بِغَدَّارٍ قَالَ فَذَهَبَ بِأَبِي جَنْدَلٍ فَقَالَ يَا رَسُولَ اللَّهِ تَدْفَعُنِي إِلَيْهِ قَالَ وَ لَمْ أَشْتَرِطْ لَكَ قَالَ وَ قَالَ اللَّهُمَّ اجْعَلْ لِأَبِي جَنْدَلٍ مَخْرَجاً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473634\">H 14951</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, and someone else, from Muawiya Bin Ammaar, who has reported the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said; ‘When the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> went out in a military expedition of Al-Hudaybiyya, it was the Month of Zil-al-Qadaha. So when he<sup>saww</sup> ended up at the place in which Ihram had to be worn, they did so and wore their weapons as well. So when it (news) reached the ‘الْمُشْرِكِينَ’ (Polytheists), they sent to him<sup>saww</sup> Khalid Bin Waleed to turn him<sup>saww</sup> back. He<sup>saww</sup> said; ‘Bring me a man who can take me<sup>saww</sup> via a different road to this one. So they came with a man from Muzaynat or from Juhaynat. He<sup>saww</sup> asked him, but he did not agree. ",
            "So he<sup>saww</sup> said; ‘Bring to me<sup>saww</sup> a man other than him’. So they came with another man from Muzaynat, or from Juhaynat. He said, ‘I remember it. So he took them with him until they ended up at Al-Uqba. So he<sup>saww</sup> said: ‘The one who climbs it, Allah<sup>azwj</sup> would Forgive him just as He<sup>azwj</sup> Forgave the Children of Israel, so He<sup>azwj</sup> Said: <span class=\"ibTxt\">“[7:161] and enter the gate making obeisance, We will forgive you your wrongs”</span>. The cavalry of the Helpers, Al-Aws, and Al-Khazraj initiated the advance, and they were one thousand eight hundred of them. So when they descended to Al-Hudaybiyya, there was a woman who had her son with her at Al-Quleyb. So her son ran away. So when she established that it was the Rasool Allah<sup>saww</sup>, she screamed, ‘These are Al-Sa’ibun, there is no problem to you from them’.",
            "The Rasool Allah<sup>saww</sup> came up to her and commanded her to draw a bucket of water. The Rasool Allah<sup>saww</sup> took it. He<sup>saww</sup> drank, and washed his<sup>saww</sup> face. She took its remaining bit and returned it back in the well. That well still has water until this time. And the Rasool Allah<sup>saww</sup> came out, and the Polytheists sent to him<sup>saww</sup> Aban Bin Saeed with some horsemen in front of them. Then they sent Al-Hulays, so he saw the animals being prepared for sacrifice. He returned and did not come to the Rasool Allah<sup>saww</sup>, and said to Abu Sufyan: ‘ By Allah<sup>azwj</sup>, it was not this that we agreed upon, to return the sacrifices from its place’. He said, ‘Be quiet! For you are only a Bedouin’. He said, ‘But, by Allah<sup>azwj</sup>, stay away from Muhammad<sup>saww</sup> and what he<sup>saww</sup> wants, or else I shall revolt among Al-Ahabeysh’. He said, ‘Keep quiet until we take an agreement from Muhammad<sup>saww</sup>’. ",
            "So they sent to him<sup>saww</sup> Urwat Bin Masoud and he had gone to the Qureysh regarding the people whom Al-Mugheira Bin Soh’ba had killed when they had gone with him from Al-Taef, and they used to be businessmen. So he (al-Mughirah) killed them and had come with their wealth to the Rasool Allah<sup>saww</sup>. So the Rasool Allah<sup>saww</sup> had refused to accept it and said; ‘This is treachery, and we<sup>saww</sup> have no need with regards to it’. They sent him so he said, ‘O Rasool Allah<sup>saww</sup>, this is Urwat Bin Masoud who has come to you, and he magnifies the sacrifices’. He<sup>saww</sup> said: ‘Make him stand here’. They brought him to stand. He said, ‘O Muhammad<sup>saww</sup>, why have you<sup>saww</sup> come?’ He<sup>saww</sup> said: ‘I<sup>saww</sup> have come to circumambulate (Tawaaf) the House, and perform Sa’ee between Al-Safa and Al-Marwa, and sacrifice this camel and leave its meat for you’.",
            "He said, ‘No, I swear by al-laat and al-uzza<a id=\"_ftnref33\"></a><sup>[33]</sup>, a person like you<sup>saww</sup> should not be sent back from what he has come for. If your<sup>saww</sup> people bind you<sup>saww</sup> to Allah<sup>azwj</sup> and the mercy, to enter their city without their permission, and cut-off their relationships, and make enemies to go against them’. So the Rasool Allah<sup>saww</sup> said: ‘I<sup>saww</sup> will not do it until I<sup>saww</sup> enter the city’. And when Urwat Bin Masoud was speaking with the Rasool Allah<sup>saww</sup>, he was holding his beard, and Al-Mugheira was standing near to his head. So he hit him by his hand and said, ‘Who is this, O Muhammad<sup>saww</sup>! So he<sup>saww</sup> said: ‘This is the son of your brother, Al-Mugheira’. He said, ‘O treachery! By Allah<sup>azwj</sup>, I did not come here except for the reconciliation with you<sup>saww</sup>’. So he returned to them and said to Abu Sufyan and his companions, ‘No, by Allah<sup>azwj</sup>, a person like Muhammad<sup>saww</sup> should not be turned back from what he has come for’.",
            "So they sent to him<sup>saww</sup> Suhail Bin Amro and Huweytab Bin Abdul Uzza. So the Rasool Allah<sup>saww</sup> commanded for the sacrificial animals to be spread out in front of their eyes. He said, ‘Why have you<sup>saww</sup> come here?’ He<sup>saww</sup> said: ‘For circumambulation of the House, and the Sa’ee between Al-Safa and Al-Marwa, and sacrifice the animals and leave their meat between you’. If your<sup>saww</sup> people bind you<sup>saww</sup> to Allah<sup>azwj</sup> and the mercy from entering their city without their permission, and cut-off their relationships, and make their enemies to go against them’. He<sup>asws</sup> said; ‘The Rasool Allah<sup>saww</sup> refused the two of them, except that he<sup>saww</sup> would enter it. And the Rasool Allah<sup>saww</sup> had intended to send Umar to them. So he said, ‘O Rasool Allah<sup>saww</sup>, my relatives are few, and I am among them of the status that you<sup>saww</sup> know about (a humiliating one). You<sup>saww</sup> should send Usman Bin Affan’.  ",
            "So the Rasool Allah<sup>saww</sup> sent for him and said, ‘Go to your people from the Believers. Give them the good news of what my<sup>saww</sup> Lord<sup>azwj</sup> has Promised me<sup>saww</sup> of the victory over Makkah’. So when Usman went, he met Aban Bin Saeed. So he delayed the camel and made room for Usman to ride with him. Usman entered (Makkah) and there was a skirmish. So Suhail Bin Amro seated himself in the presence of the Rasool Allah<sup>saww</sup>, and Usman sat in the army of the Polytheists. And the Rasool Allah<sup>saww</sup> got the Muslims to pledge their allegiances and tap one by his hand upon the other and Muslims said: ‘How good of Usman that he has circumambulated the House and performed Sa’ee between Al-Safa and Al-Marwa and be lawful (out of Ihraam)’. So the Rasool Allah<sup>saww</sup> said: ‘He did what he had to do’. So when Usman came, the Rasool Allah<sup>saww</sup> said to him; ‘Did you circumambulate the House?’ He said, ‘I could not circumambulate the House whilst the Rasool Allah<sup>saww</sup> had not circumambulated it’. Then he mentioned the story and what had happened’.",
            "So he<sup>saww</sup> said to Ali<sup>asws</sup>: ‘Write – In the Name of Allah<sup>azwj</sup>, the Beneficent, the Merciful’. Suhail said, ‘I don’t know what the Beneficent, the Merciful is except that I think this is the one at Al-Yamama. But, write as we write – ‘By Your<sup>azwj</sup> Name, our Allah<sup>azwj</sup>’. He<sup>saww</sup> said; ‘And write this – What has been agreed upon by the Rasool Allah<sup>saww</sup> and Suhail Bin Amro’. So Suhail said, ‘What are we fighting you<sup>saww</sup> for, O Muhammad<sup>saww</sup>?’ So he<sup>saww</sup> said; ‘I<sup>saww</sup> and the Rasool Allah<sup>saww</sup> and I<sup>saww</sup> am Muhammad bin Abdullah<sup>saww</sup>’. So the people said: ‘You<sup>saww</sup> are the Rasool Allah<sup>saww</sup>’. He said, ‘Write – Write that this is what has been agreed upon by Muhammad Bin Abdullah<sup>saww</sup>’. So the people said: ‘You<sup>saww</sup> are the Rasool Allah<sup>saww</sup>’. ",
            "And what was in the agreement that – ‘The one who was from us, if he were to come to you, shall be returned back to us and the Rasool Allah<sup>saww</sup> will not keep him unwillingly from his religion, and the one who comes to us from you will not be returned back to you’. So the Rasool Allah<sup>saww</sup> said; ‘There is no need for us regarding them, and they should be allowed to worship Allah<sup>azwj</sup> among you openly, not in secret, and be allowed to exchange gifts between Al-Medina to Makkah’. And there was not agreement more magnificent in Blessings than it for it made Al-Islam to almost take over the people of Makkah. So Suhail Bin Amro struck his hand upon his son Abu Jandal, so he said, ‘The first of what we have agreed with you’. The Rasool Allah<sup>saww</sup> said: ‘Have I<sup>saww</sup> applied the agreement upon anything yet?’ He said, ‘O Muhammad<sup>saww</sup>! You<sup>saww</sup> are not a traitor’. So he went with Abu Jandal’. So he said, ‘O Rasool Allah<sup>saww</sup>, you<sup>saww</sup> are handing me over to him?’ He<sup>saww</sup> said: ‘And I<sup>saww</sup> did not set any conditions for you’. And said: ‘Our Allah<sup>azwj</sup>! Make a way out for Abu Jandal!’ "
          ],
          "en.sarwar": [
            "504. Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Abaan, from Al-Fazl Abu Al-Abbas, who has narrated the following: Abu Abdullah (a.s.) regarding the Statement of Allah (azwj): “[4:90] or who come to you, their hearts shrinking from fighting you or fighting their own people”, he (a.s.) said: ‘Revealed with regards to the Clan of Mudlaj because they had come to the Rasool Allah (saww), so they said, ‘There are restrictions in our chests that we should testify that you (saww) are the Rasool Allah (saww), for we are neither with you (saww) nor are we with our people against you (saww)’. So I said, ‘How did the Rasool Allah (saww) deal with them?’ He (a.s.) said; ‘He (saww) said that he (saww) would leave them until he (saww) was free from dealing with the Arabs, then he (saww) would call them (to Al-Islam), to see if they answered or else he (saww) would fight against them’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 450)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15189,
        "local_index": 28,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:28",
        "text": [
          "14952- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانٍ عَنِ الْفَضْلِ أَبِي الْعَبَّاسِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ أَوْ جاؤُكُمْ حَصِرَتْ صُدُورُهُمْ أَنْ يُقاتِلُوكُمْ أَوْ يُقاتِلُوا قَوْمَهُمْ قَالَ نَزَلَتْ فِي بَنِي مُدْلِجٍ لِأَنَّهُمْ جَاءُوا إِلَى رَسُولِ اللَّهِ (صلى الله عليه وآله) فَقَالُوا إِنَّا قَدْ حَصِرَتْ صُدُورُنَا أَنْ نَشْهَدَ أَنَّكَ رَسُولُ اللَّهِ فَلَسْنَا مَعَكَ وَ لَا مَعَ قَوْمِنَا عَلَيْكَ قَالَ قُلْتُ كَيْفَ صَنَعَ بِهِمْ رَسُولُ اللَّهِ (صلى الله عليه وآله) قَالَ وَاعَدَهُمْ إِلَى أَنْ يَفْرُغَ مِنَ الْعَرَبِ ثُمَّ يَدْعُوهُمْ فَإِنْ أَجَابُوا وَ إِلَّا قَاتَلَهُمْ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473635\">H 14952</a> – Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Abaan, from Al-Fazl Abu Al-Abbas, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> regarding the Statement of Allah<sup>azwj</sup>: <span class=\"ibTxt\">“[4:90] or who come to you, their hearts shrinking from fighting you or fighting their own people”</span>, he<sup>asws</sup> said: ‘Revealed with regards to the Clan of Mudlaj because they had come to the Rasool Allah<sup>saww</sup>, so they said, ‘There are restrictions in our chests that we should testify that you<sup>saww</sup> are the Rasool Allah<sup>saww</sup>, for we are neither with you<sup>saww</sup> nor are we with our people against you<sup>saww</sup>’. So I said, ‘How did the Rasool Allah<sup>saww</sup> deal with them?’ He<sup>asws</sup> said; ‘He<sup>saww</sup> said that he<sup>saww</sup> would leave them until he<sup>saww</sup> was free from dealing with the Arabs, then he<sup>saww</sup> would call them (to Al-Islam), to see if they answered or else he<sup>saww</sup> would fight against them’. "
          ],
          "en.sarwar": [
            "505. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Fazzaal, from Dawood Bin Abu Yazeed and he is Farqad, from Abu Yazeed Al-Hammaar, who has said the following: Abu Abdullah (a.s.) having said that: ‘Allah (azwj) Sent four Angels (to Prophet Ibrahim (as)) for the destruction of the people of Lut (as) – Jibraeel (as), and Mikaeel (as), and Israfeel (as), and Karoubeel (as) and they had obscured their faces. They greeted him (as). He (as) did not recognise them and saw them as good persons. So he (as) said (to himself (as)), ‘No one shall attend to them except for myself personally’, and he (as) was a kind host. So he grilled a calf for them until it was well done, then placed it near to them. So when he (as) placed it in front of them, “[11:70] But when he saw that their hands were not extended towards it, he deemed them strange and conceived fear of them”. So when Jibraeel (as) saw that, he (as) removed the turban from his (as) face and from his (as) head. Ibrahim (as) recognised him (as). He (as) said: ‘You (as) are he (as)!’ He (as) said: ‘Yes’, and his (as) wife passed by and he (as) gave her (as) the good news of Is’haq (as), and after Is’haq (as) of Yaqoub (as). So she (as) said what Allah (azwj) has Stated, and they (as) answered her (as) with what is in the Mighty Book. So Ibrahim (as) said to them: ‘What have you (as) come for?’ They (as) said to him (as): ‘For the destruction of the people of Lut (as)’. So he (as) said to them (as): ‘Suppose there were a hundred Believers among them, would you (as) destroy them?’ Jibraeel (as) said: ‘No’. He (as) said: ‘If there were fifty?’ He (as) said: ‘No’. He (as) said, ‘If there were thirty?’ He (as) said; No’. He (as) said: ‘If there were twenty?’ He (as) said: ‘No’. He (as) said: ‘if there were ten?’ He (as) said; ‘No’. He (as) said: ‘If there were five?’ He (as) said: ‘No’. He (as) said: ‘If there was one?’ He (as) said: ‘No’. “[29:32] He said: Surely in it is Lut. They said: We know well who is in it; we shall certainly deliver him and his followers, except his wife; she shall be of those who remain behind”. Then they (as) left. And Al-Hassan Al-Askary Abu Muhammad (a.s.) said, and I don’t know whether it is the speech except that it has been preserved: ‘And it is the Statement of Allah (azwj) Mighty and Majestic: “[11:74] he began to plead with Us for Lut’s people”. So they (as) came to Lut (as) whilst he (as) was in his (as) farm near the city. So they (as) greeted him (as) whilst they (as) had obscured their (as) faces. So when he (as) saw them to be as good persons clad in white turbans and white robes, he (as) said to them (as): ‘Lodging?’ They (as) said: ‘Yes’. So he (as) led them (as) and they (as) walked behind him (as). He (as) regretted having offered lodging to them (as) and said (to himself (as)): ‘What shall I (as) do when I (as) come to my (as) people and I recognise them?’ So he (as) turned towards them (as) and said: ‘You (as) have come to evil creatures of Allah (azwj)’. And Jibraeel (as) had said: ‘We (as) will not make haste against them until he (as) testifies by three testimonies’. So Jibraeel (as) said (to himself (as)): ‘This is one testimony’. Then they (as) walked for a while, then he (as) turned towards them and said: ‘You (as) have come to evil creatures of Allah (azwj)’. So Jibraeel (as) said (to himself (as)): ‘These are two’. Then they (as) went, so when they reached the gate of the city, he (as) turned towards them (as) and said; ‘You (as) have come to evil creatures of Allah (azwj)’. So Jibraeel (as) said (to himself (as)): ‘These are three’. Then he (as) entered (the city) and they (as) entered with him (as). So when his (as) wife saw them (as) of good built she climbed on top of the roof of the house and whistled to the people. So when they did not hear her, she raised smoke. So when they saw the smoke they came rushing to the door. She came down to them and said, ‘He (as) has such people with him (as) that I have not seen such beauty ever better than theirs. They came to the gate, so when Lut (as) saw them, he (as) said: ‘O people! Fear Allah (azwj) and do not harass regarding my (as) guests. Is there no man with guidance among you? These are my (as) (community’s) daughters. They are cleaner for you, so call them to the Permissible’. They said, ‘You (as) are aware that there is no right for us regarding your daughters, and you (as) well know what we want’. So he (as) said; ‘If I (as) had strength or support I (as) would have resorted to a strong corner’. So Jibraeel (as) said (to himself (as)): ‘If only he (as) knew how much strength he (as) had’. So they spoke a lot until they (as) entered the house’. He (a.s.) said: ‘Jibraeel (as) shouted: ‘O Lut (as)! Call them to enter the house’. So when they entered, Jibraeel (as) pointed by his (as) finger around them, so their eyesight was lost and it is His (azwj) Words: “[54:37] but We blinded their eyes”. Then Jibraeel (as) called out: ‘We (as) have been Sent to destroy you all’. So he (as) said: ‘O Jibraeel (as), hurry up’. So he (as) said: ‘Their Promised time is the morning. Is not the morning yet?’ He (a.s.) said; ‘So he (Jibraeel (as)) commanded him to carry with him those who were with him (as) except for his (as) wife. Then Jibraeel (as), by his (as) wings, uprooted from the seventh firmament, then raised it until the inhabitants of the sky heard the barking of the dogs and the crowing of the roosters. Then he (as) overturned it, and rained upon it and upon the surrounding areas of the city, stones of clay’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على الشهور</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 455)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15190,
        "local_index": 29,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:29",
        "text": [
          "14953- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ فَضَّالٍ عَنْ دَاوُدَ بْنِ أَبِي يَزِيدَ وَ هُوَ فَرْقَدٌ عَنْ أَبِي يَزِيدَ الْحَمَّارِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ إِنَّ اللَّهَ تَعَالَى بَعَثَ أَرْبَعَةَ أَمْلَاكٍ فِي إِهْلَاكِ قَوْمِ لُوطٍ جَبْرَئِيلَ وَ مِيكَائِيلَ وَ إِسْرَافِيلَ وَ كَرُوبِيلَ (عليهم السلام) فَمَرُّوا بِإِبْرَاهِيمَ (عليه السلام) وَ هُمْ مُعْتَمُّونَ فَسَلَّمُوا عَلَيْهِ فَلَمْ يَعْرِفْهُمْ وَ رَأَى هَيْئَةً حَسَنَةً فَقَالَ لَا يَخْدُمُ هَؤُلَاءِ أَحَدٌ إِلَّا أَنَا بِنَفْسِي وَ كَانَ صَاحِبَ أَضْيَافٍ فَشَوَى لَهُمْ عِجْلًا سَمِيناً حَتَّى أَنْضَجَهُ ثُمَّ قَرَّبَهُ إِلَيْهِمْ فَلَمَّا وَضَعَهُ بَيْنَ أَيْدِيهِمْ رَأى أَيْدِيَهُمْ لا تَصِلُ إِلَيْهِ نَكِرَهُمْ وَ أَوْجَسَ مِنْهُمْ خِيفَةً ",
          "فَلَمَّا رَأَى ذَلِكَ جَبْرَئِيلُ (عليه السلام) حَسَرَ الْعِمَامَةَ عَنْ وَجْهِهِ وَ عَنْ رَأْسِهِ فَعَرَفَهُ إِبْرَاهِيمُ (عليه السلام) فَقَالَ أَنْتَ هُوَ فَقَالَ نَعَمْ وَ مَرَّتِ امْرَأَتُهُ سَارَةُ فَبَشَّرَهَا بِإِسْحَاقَ وَ مِنْ وَرَاءِ إِسْحَاقَ يَعْقُوبَ فَقَالَتْ مَا قَالَ اللَّهُ عَزَّ وَ جَلَّ فَأَجَابُوهَا بِمَا فِي الْكِتَابِ الْعَزِيزِ فَقَالَ إِبْرَاهِيمُ (عليه السلام) لَهُمْ فِيمَا ذَا جِئْتُمْ قَالُوا لَهُ فِي إِهْلَاكِ قَوْمِ لُوطٍ",
          "فَقَالَ لَهُمْ إِنْ كَانَ فِيهَا مِائَةٌ مِنَ الْمُؤْمِنِينَ تُهْلِكُونَهُمْ فَقَالَ جَبْرَئِيلُ (عليه السلام) لَا قَالَ فَإِنْ كَانُوا خَمْسِينَ قَالَ لَا قَالَ فَإِنْ كَانُوا ثَلَاثِينَ قَالَ لَا قَالَ فَإِنْ كَانُوا عِشْرِينَ قَالَ لَا قَالَ فَإِنْ كَانُوا عَشَرَةً قَالَ لَا قَالَ فَإِنْ كَانُوا خَمْسَةً قَالَ لَا قَالَ فَإِنْ كَانُوا وَاحِداً قَالَ لَا قالَ إِنَّ فِيها لُوطاً قالُوا نَحْنُ أَعْلَمُ بِمَنْ فِيها لَنُنَجِّيَنَّهُ وَ أَهْلَهُ إِلَّا امْرَأَتَهُ كانَتْ مِنَ الْغابِرِينَ ثُمَّ مَضَوْا ",
          "وَ قَالَ الْحَسَنُ الْعَسْكَرِيُّ أَبُو مُحَمَّدٍ لَا أَعْلَمُ ذَا الْقَوْلَ إِلَّا وَ هُوَ يَسْتَبْقِيهِمْ وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ يُجادِلُنا فِي قَوْمِ لُوطٍ فَأَتَوْا لُوطاً وَ هُوَ فِي زِرَاعَةٍ لَهُ قُرْبَ الْمَدِينَةِ فَسَلَّمُوا عَلَيْهِ وَ هُمْ مُعْتَمُّونَ فَلَمَّا رَآهُمْ رَأَى هَيْئَةً حَسَنَةً عَلَيْهِمْ عَمَائِمُ بِيضٌ وَ ثِيَابٌ بِيضٌ فَقَالَ لَهُمُ الْمَنْزِلَ فَقَالُوا نَعَمْ فَتَقَدَّمَهُمْ وَ مَشَوْا خَلْفَهُ فَنَدِمَ عَلَى عَرْضِهِ عَلَيْهِمُ الْمَنْزِلَ وَ قَالَ أَيَّ شَيْ‏ءٍ صَنَعْتُ آتِي بِهِمْ قَوْمِي وَ أَنَا أَعْرِفُهُمْ فَالْتَفَتَ إِلَيْهِمْ فَقَالَ إِنَّكُمْ تَأْتُونَ شِرَارَ خَلْقِ اللَّهِ وَ قَدْ قَالَ جَبْرَئِيلُ (عليه السلام) لَا نَعْجَلُ عَلَيْهِمْ حَتَّى يَشْهَدَ ثَلَاثَ شَهَادَاتٍ فَقَالَ جَبْرَئِيلُ (عليه السلام) هَذِهِ وَاحِدَةٌ ثُمَّ مَشَى سَاعَةً ثُمَّ الْتَفَتَ إِلَيْهِمْ فَقَالَ إِنَّكُمْ تَأْتُونَ شِرَارَ خَلْقِ اللَّهِ فَقَالَ جَبْرَئِيلُ (عليه السلام) هَذِهِ اثْنَتَانِ ثُمَّ مَضَى فَلَمَّا بَلَغَ بَابَ الْمَدِينَةِ الْتَفَتَ إِلَيْهِمْ فَقَالَ إِنَّكُمْ تَأْتُونَ شِرَارَ خَلْقِ اللَّهِ فَقَالَ جَبْرَئِيلُ (عليه السلام) هَذِهِ ثَالِثَةٌ",
          "ثُمَّ دَخَلَ وَ دَخَلُوا مَعَهُ فَلَمَّا رَأَتْهُمُ امْرَأَتُهُ رَأَتْ هَيْئَةً حَسَنَةً فَصَعِدَتْ فَوْقَ السَّطْحِ وَ صَعِقَتْ فَلَمْ يَسْمَعُوا فَدَخَّنَتْ فَلَمَّا رَأَوُا الدُّخَانَ أَقْبَلُوا يُهْرَعُونَ إِلَى الْبَابِ فَنَزَلَتْ إِلَيْهِمْ فَقَالَتْ عِنْدَهُ قَوْمٌ مَا رَأَيْتُ قَطُّ أَحْسَنَ مِنْهُمْ هَيْئَةً فَجَاءُوا إِلَى الْبَابِ لِيَدْخُلُوهَا فَلَمَّا رَآهُمْ لُوطٌ قَامَ إِلَيْهِمْ فَقَالَ يَا قَوْمِ فَاتَّقُوا اللَّهَ وَ لا تُخْزُونِ فِي ضَيْفِي أَ لَيْسَ مِنْكُمْ رَجُلٌ رَشِيدٌ فَقَالَ هَؤُلَاءِ بَنَاتِي هُنَّ أَطْهَرُ لَكُمْ فَدَعَاهُمْ إِلَى الْحَلَالِ فَقَالُوا لَقَدْ عَلِمْتَ مَا لَنَا فِي بَنَاتِكَ مِنْ حَقٍّ وَ إِنَّكَ لَتَعْلَمُ مَا نُرِيدُ فَقالَ لَوْ أَنَّ لِي بِكُمْ قُوَّةً أَوْ آوِي إِلى رُكْنٍ شَدِيدٍ فَقَالَ جَبْرَئِيلُ (عليه السلام) لَوْ يَعْلَمُ أَيُّ قُوَّةٍ لَهُ فَكَاثَرُوهُ حَتَّى دَخَلُوا الْبَيْتَ ",
          "قَالَ فَصَاحَ بِهِ جَبْرَئِيلُ يَا لُوطُ دَعْهُمْ يَدْخُلُونَ فَلَمَّا دَخَلُوا أَهْوَى جَبْرَئِيلُ بِإِصْبَعِهِ نَحْوَهُمْ فَذَهَبَتْ أَعْيُنُهُمْ وَ هُوَ قَوْلُهُ فَطَمَسْنا أَعْيُنَهُمْ ثُمَّ نَادَى جَبْرَئِيلُ فَقَالَ إِنَّا رُسُلُ رَبِّكَ لَنْ يَصِلُوا إِلَيْكَ فَأَسْرِ بِأَهْلِكَ بِقِطْعٍ مِنَ اللَّيْلِ وَ قَالَ لَهُ جَبْرَئِيلُ إِنَّا بُعِثْنَا فِي إِهْلَاكِهِمْ فَقَالَ يَا جَبْرَئِيلُ عَجِّلْ فَقَالَ إِنَّ مَوْعِدَهُمُ الصُّبْحُ أَ لَيْسَ الصُّبْحُ بِقَرِيبٍ ",
          "قَالَ فَأَمَرَهُ فَتَحَمَّلَ وَ مَنْ مَعَهُ إِلَّا امْرَأَتَهُ قَالَ ثُمَّ اقْتَلَعَهَا جَبْرَئِيلُ بِجَنَاحَيْهِ مِنْ سَبْعِ أَرَضِينَ ثُمَّ رَفَعَهَا حَتَّى سَمِعَ أَهْلُ سَمَاءِ الدُّنْيَا نُبَاحَ الْكِلَابِ وَ صِيَاحَ الدِّيَكَةِ ثُمَّ قَلَبَهَا وَ أَمْطَرَ عَلَيْهَا وَ عَلَى مَنْ حَوْلَ الْمَدِينَةِ حِجَارَةً مِنْ سِجِّيلٍ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473636\">H 14953</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Fazzaal, from Dawood Bin Abu Yazeed and he is Farqad, from Abu Yazeed Al-Hammaar, who has said the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup style=\"font-weight: normal\">asws</sup> having said that: ‘Allah<sup style=\"font-weight: normal\">azwj</sup> Sent four Angels (to Prophet Ibrahim<sup style=\"font-weight: normal\">as</sup>) for the destruction of the people of Lut<sup style=\"font-weight: normal\">as</sup> – Jibraeel<sup style=\"font-weight: normal\">as</sup>, and Mikaeel<sup style=\"font-weight: normal\">as</sup>, and Israfeel<sup style=\"font-weight: normal\">as</sup>, and Karoubeel<sup style=\"font-weight: normal\">as</sup> and they had obscured their faces. They greeted him<sup style=\"font-weight: normal\">as</sup>. He<sup style=\"font-weight: normal\">as</sup> did not recognise them and saw them as good persons. So he<sup style=\"font-weight: normal\">as</sup> said (to himself<sup style=\"font-weight: normal\">as</sup>), ‘No one shall attend to them except for myself personally’, and he<sup style=\"font-weight: normal\">as</sup> was a kind host. So he grilled a calf for them until it was well done, then placed it near to them. So when he<sup style=\"font-weight: normal\">as</sup> placed it in front of them, <span class=\"ibTxt\">“[11:70] But when he saw that their hands were not extended towards it, he deemed them strange and conceived fear of them”.</span>",
            "So when Jibraeel<sup>as</sup> saw that, he<sup>as</sup> removed the turban from his<sup>as</sup> face and from his<sup>as</sup> head. Ibrahim<sup>as</sup> recognised him<sup>as</sup>. He<sup>as</sup> said: ‘You<sup>as</sup> are he<sup>as</sup>!’ He<sup>as</sup> said: ‘Yes’, and his<sup>as</sup> wife passed by and he<sup>as</sup> gave her<sup>as</sup> the good news of Is’haq<sup>as</sup>, and after Is’haq<sup>as</sup> of Yaqoub<sup>as</sup>. So she<sup>as</sup> said what Allah<sup>azwj</sup> has Stated, and they<sup>as</sup> answered her<sup>as</sup> with what is in the Mighty Book. So Ibrahim<sup>as</sup> said to them: ‘What have you<sup>as</sup> come for?’ They<sup>as</sup> said to him<sup>as</sup>: ‘For the destruction of the people of Lut<sup>as</sup>’. ",
            "So he<sup>as</sup> said to them<sup>as</sup>: ‘Suppose there were a hundred Believers among them, would you<sup>as</sup> destroy them?’ Jibraeel<sup>as</sup> said: ‘No’. He<sup>as</sup> said: ‘If there were fifty?’ He<sup>as</sup> said: ‘No’. He<sup>as</sup> said, ‘If there were thirty?’ He<sup>as</sup> said; No’. He<sup>as</sup> said: ‘If there were twenty?’ He<sup>as</sup> said: ‘No’. He<sup>as</sup> said: ‘if there were ten?’ He<sup>as</sup> said; ‘No’. He<sup>as</sup> said: ‘If there were five?’ He<sup>as</sup> said: ‘No’. He<sup>as</sup> said: ‘If there was one?’ He<sup>as</sup> said: ‘No’. <span class=\"ibTxt\">“[29:32] He said: Surely in it is Lut. They said: We know well who is in it; we shall certainly deliver him and his followers, except his wife; she shall be of those who remain behind”</span><span style=\"font-size: small\">. </span>Then they<sup>as</sup> left.",
            "And Al-Hassan Al-Askary Abu Muhammad<sup>asws</sup> said, and I don’t know whether it is the speech except that it has been preserved: ‘And it is the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[11:74] he began to plead with Us for Lut's people”</span>. So they<sup>as</sup> came to Lut<sup>as</sup> whilst he<sup>as</sup> was in his<sup>as</sup> farm near the city. So they<sup>as</sup> greeted him<sup>as</sup> whilst they<sup>as</sup> had obscured their<sup>as</sup> faces. So when he<sup>as</sup> saw them to be as good persons clad in white turbans and white robes, he<sup>as</sup> said to them<sup>as</sup>: ‘Lodging?’ They<sup>as</sup> said: ‘Yes’. So he<sup>as</sup> led them<sup>as</sup> and they<sup>as</sup> walked behind him<sup>as</sup>. He<sup>as</sup> regretted having offered lodging to them<sup>as</sup> and said (to himself<sup>as</sup>): ‘What shall I<sup>as</sup> do when I<sup>as</sup> come to my<sup>as</sup> people and I recognise them?’ So he<sup>as</sup> turned towards them<sup>as</sup> and said: ‘You<sup>as</sup> have come to evil creatures of Allah<sup>azwj</sup>’. And Jibraeel<sup>as</sup> had said: ‘We<sup>as</sup> will not make haste against them until he<sup>as</sup> testifies by three testimonies’. So Jibraeel<sup>as</sup> said (to himself<sup>as</sup>): ‘This is one testimony’. Then they<sup>as</sup> walked for a while, then he<sup>as</sup> turned towards them and said: ‘You<sup>as</sup> have come to evil creatures of Allah<sup>azwj</sup>’. So Jibraeel<sup>as</sup> said (to himself<sup>as</sup>): ‘These are two’. Then they<sup>as</sup> went, so when they reached the gate of the city, he<sup>as</sup> turned towards them<sup>as</sup> and said; ‘You<sup>as</sup> have come to evil creatures of Allah<sup>azwj</sup>’. So Jibraeel<sup>as</sup> said (to himself<sup>as</sup>): ‘These are three’. ",
            "Then he<sup>as</sup> entered (the city) and they<sup>as</sup> entered with him<sup>as</sup>. So when his<sup>as</sup> wife saw them<sup>as</sup> of good built she climbed on top of the roof of the house and whistled to the people. So when they did not hear her, she raised smoke. So when they saw the smoke they came rushing to the door. She came down to them and said, ‘He<sup>as</sup> has such people with him<sup>as</sup> that I have not seen such beauty ever better than theirs. They came to the gate, so when Lut<sup>as</sup> saw them, he<sup>as</sup> said: ‘O people! Fear Allah<sup>azwj</sup> and do not harass regarding my<sup>as</sup> guests. Is there no man with guidance among you? These are my<sup>as</sup> (community’s) daughters. They are cleaner for you, so call them to the Permissible’. They said, ‘You<sup>as</sup> are aware that there is no right for us regarding your daughters, and you<sup>as</sup> well know what we want’. So he<sup>as</sup> said; ‘If I<sup>as</sup> had strength or support I<sup>as</sup> would have resorted to a strong corner’. So Jibraeel<sup>as</sup> said (to himself<sup>as</sup>): ‘If only he<sup>as</sup> knew how much strength he<sup>as</sup> had’. So they spoke a lot until they<sup>as</sup> entered the house’. ",
            "He<sup>asws</sup> said: ‘Jibraeel<sup>as</sup> shouted: ‘O Lut<sup>as</sup>! Call them to enter the house’. So when they entered, Jibraeel<sup>as</sup> pointed by his<sup>as</sup> finger around them, so their eyesight was lost and it is His<sup>azwj</sup> Words: <span class=\"ibTxt\">“[54:37] but We blinded their eyes”</span>. Then Jibraeel<sup>as</sup> called out: ‘We<sup>as</sup> have been Sent to destroy you all’. So he<sup>as</sup> said: ‘O Jibraeel<sup>as</sup>, hurry up’. So he<sup>as</sup> said: ‘Their Promised time is the morning. Is not the morning yet?’  ",
            "He<sup>asws</sup> said; ‘So he (Jibraeel<sup>as</sup>) commanded him to carry with him those who were with him<sup>as</sup> except for his<sup>as</sup> wife. Then Jibraeel<sup>as</sup>, by his<sup>as</sup> wings, uprooted from the seventh firmament, then raised it until the inhabitants of the sky heard the barking of the dogs and the crowing of the roosters. Then he<sup>as</sup> overturned it, and rained upon it and upon the surrounding areas of the city, stones of clay’."
          ],
          "en.sarwar": [
            "506. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Sinan, from Al-Al-Sabbaah Bin Abdul Hameed, from Muhammad Bin Muslim, who has narrated the following: Abu Ja’far (a.s.) has said: ‘By Allah (azwj), that which Al-Hassan Bin Ali (a.s.) did was better for this community from all that upon which the sun rises. By Allah (azwj), this Verse had been Revealed: “[4:77] Have you not seen those to whom it was said: Withhold your hands, and keep up prayer and pay the poor-rate, but rather, it is the obedience to the Imam (a.s.), and they sought to fight, but when fighting is prescribed for them alongside Al-Husayn (a.s.) they say: Our Lord! why hast Thou ordained fighting for us? Wherefore didst Thou not grant us a delay to a near end?” we would have responded to Your (azwj) Call and we would have followed the Messengers (as). They intended to delay that to Al-Qaim (a.s.)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 457)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15191,
        "local_index": 30,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:30",
        "text": [
          "14954- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ أَبِي الصَّبَّاحِ بْنِ عَبْدِ الْحَمِيدِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ وَ اللَّهِ لَلَّذِي صَنَعَهُ الْحَسَنُ بْنُ عَلِيٍّ (عليه السلام) كَانَ خَيْراً لِهَذِهِ الْأُمَّةِ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ وَ اللَّهِ لَقَدْ نَزَلَتْ هَذِهِ الْآيَةُ أَ لَمْ تَرَ إِلَى الَّذِينَ قِيلَ لَهُمْ كُفُّوا أَيْدِيَكُمْ وَ أَقِيمُوا الصَّلاةَ وَ آتُوا الزَّكاةَ إِنَّمَا هِيَ طَاعَةُ الْإِمَامِ وَ طَلَبُوا الْقِتَالَ فَلَمَّا كُتِبَ عَلَيْهِمُ الْقِتَالُ مَعَ الْحُسَيْنِ (عليه السلام) قالُوا رَبَّنا لِمَ كَتَبْتَ عَلَيْنَا الْقِتالَ لَوْ لا أَخَّرْتَنا إِلى أَجَلٍ قَرِيبٍ نُجِبْ دَعْوَتَكَ وَ نَتَّبِعِ الرُّسُلَ أَرَادُوا تَأْخِيرَ ذَلِكَ إِلَى الْقَائِمِ (عليه السلام)."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473637\">H 14954</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Sinan, from Al-Al-Sabbaah Bin Abdul Hameed, from Muhammad Bin Muslim, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> has said: ‘By Allah<sup>azwj</sup>, that which Al-Hassan Bin Ali<sup>asws</sup> did was better for this community from all that upon which the sun rises. By Allah<sup>azwj</sup>, this Verse had been Revealed: <span class=\"ibTxt\">“[4:77] Have you not seen those to whom it was said: Withhold your hands, and keep up prayer and pay the poor-rate</span>, but rather, it is the obedience to the Imam<sup>asws</sup>, and they sought to fight,<span class=\"ibTxt\"> but when fighting is prescribed for them</span> alongside Al-Husayn<sup>asws</sup> they<span class=\"ibTxt\"> say: Our Lord! why hast Thou ordained fighting for us? Wherefore didst Thou not grant us a delay to a near end?”</span> we would have responded to Your<sup>azwj</sup> Call and we would have followed the Messengers<sup>as</sup>. They intended to delay that to Al-Qaim<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "507. Muhammad Bin Yahya, from Salmat Bin Al-Khataab and a number of our companions, from Sahl Bin Ziyad together, from Ali Bin Hassaan, from Ali Bin Atiyya Al-Zayyaat, from Moala Bin Khuneys who said: I asked Abu Abdullah (a.s.) about the stars (astrology), is it true?’ So he (a.s.) said; ‘Yes. Allah (azwj) Sent Jupiter to the earth in the image of a man. So he took a man from the non-Arabs and taught him the stars (Astrology) until he thought that he understood it. Then he said to him, ‘Look around. Where is the Jupiter?’ So he said, ‘I cannot see it in the sky and I do not know where it is’. He (a.s.) said; ‘He left him and grabbed the hand of a man from India. So he taught him until he thought he had understood it, and said, ‘Look at Jupiter, where is it?’ So he said, ‘My calculation evidences to me that you are the Jupiter’. He (a.s.) said: ‘He gasped a cry and died, and his people inherited his knowledge, so the knowledge is over there (in India)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 457)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15192,
        "local_index": 31,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:31",
        "text": [
          "14955- مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ عَلِيِّ بْنِ عَطِيَّةَ الزَّيَّاتِ عَنْ مُعَلَّى بْنِ خُنَيْسٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) عَنِ النُّجُومِ أَ حَقٌّ هِيَ فَقَالَ نَعَمْ إِنَّ اللَّهَ عَزَّ وَ جَلَّ بَعَثَ الْمُشْتَرِيَ إِلَى الْأَرْضِ فِي صُورَةِ رَجُلٍ فَأَخَذَ رَجُلًا مِنَ الْعَجَمِ فَعَلَّمَهُ النُّجُومَ حَتَّى ظَنَّ أَنَّهُ قَدْ بَلَغَ ثُمَّ قَالَ لَهُ انْظُرْ أَيْنَ الْمُشْتَرِي فَقَالَ مَا أَرَاهُ فِي الْفَلَكِ وَ مَا أَدْرِي أَيْنَ هُوَ ",
          "قَالَ فَنَحَّاهُ وَ أَخَذَ بِيَدِ رَجُلٍ مِنَ الْهِنْدِ فَعَلَّمَهُ حَتَّى ظَنَّ أَنَّهُ قَدْ بَلَغَ وَ قَالَ انْظُرْ إِلَى الْمُشْتَرِي أَيْنَ هُوَ فَقَالَ إِنَّ حِسَابِي لَيَدُلُّ عَلَى أَنَّكَ أَنْتَ الْمُشْتَرِي قَالَ وَ شَهَقَ شَهْقَةً فَمَاتَ وَ وَرِثَ عِلْمَهُ أَهْلُهُ فَالْعِلْمُ هُنَاكَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473638\">H 14955</a> – Muhammad Bin Yahya, from Salmat Bin Al-Khataab and a number of our companions, from Sahl Bin Ziyad together, from Ali Bin Hassaan, from Ali Bin Atiyya Al-Zayyaat, from Moala Bin Khuneys who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked Abu Abdullah</span><sup>asws</sup> about the stars (astrology), is it true?’ So he<sup>asws</sup> said; ‘Yes. Allah<sup>azwj</sup> Sent Jupiter to the earth in the image of a man. So he took a man from the non-Arabs and taught him the stars (Astrology) until he thought that he understood it. Then he said to him, ‘Look around. Where is the Jupiter?’ So he said, ‘I cannot see it in the sky and I do not know where it is’. ",
            "He<sup>asws</sup> said; ‘He left him and grabbed the hand of a man from India. So he taught him until he thought he had understood it, and said, ‘Look at Jupiter, where is it?’ So he said, ‘My calculation evidences to me that you are the Jupiter’. He<sup>asws</sup> said: ‘He gasped a cry and died, and his people inherited his knowledge, so the knowledge is over there (in India)’. "
          ],
          "en.sarwar": [
            "508. Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel Bin Salih, from the one who informed him, the following: I asked about the stars (Astrology) from Abu Abdullah (a.s.). The Imam (a.s.) replied: ‘No one knows it except for a People of a household from the Arabs, and a people of a household from India’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 481)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15193,
        "local_index": 32,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:32",
        "text": [
          "14956- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ سُئِلَ عَنِ النُّجُومِ قَالَ مَا يَعْلَمُهَا إِلَّا أَهْلُ بَيْتٍ مِنَ الْعَرَبِ وَ أَهْلُ بَيْتٍ مِنَ الْهِنْدِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473639\">H 14956</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel Bin Salih, from the one who informed him, the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked about the stars</span> (Astrology) from Abu Abdullah<sup>asws</sup>. The Imam<sup>asws</sup> replied: ‘No one knows it except for a People of a household from the Arabs, and a people of a household from India’."
          ],
          "en.sarwar": [
            "509. Humeyd Bin Ziyad, from Abu Al-Abbas Ubeydullah Bin Ahmad Al-Dahqan, from Ali Bin Al-Hassan Al-Tatary, from Muhammad Bin Ziyad Baya’ Al-Sabiry, from Aban, from Sabbah bin Sayabat, from Al-Mu‘alla bin Khunays who said: I went with the letters of Abdul Salaam Bin Naeem, and Sudeyr, and a letter of someone else to Abu Abdullah (a.s.), When Al-Musawwadat makes his appearance, before the appearance of the sons of Al-Abbas, we have estimated that this Command would come to you (a.s.), so what do you (a.s.) see?’ ‘He (a.s.) threw the letters on the ground, and then said: ‘Uff! Uff! I (a.s.) am not an Imam (a.s.) for these ones, but they very well know that he (ajfj) would be killing Al-Sufyani’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 482)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 406)"
        ],
        "index": 15194,
        "local_index": 33,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:33",
        "text": [
          "14957- حُمَيْدُ بْنُ زِيَادٍ عَنْ أَبِي الْعَبَّاسِ عُبَيْدِ اللَّهِ بْنِ أَحْمَدَ الدِّهْقَانِ عَنْ عَلِيِّ بْنِ الْحَسَنِ الطَّاطَرِيِّ عَنْ مُحَمَّدِ بْنِ زِيَادٍ بَيَّاعِ السَّابِرِيِّ عَنْ أَبَانٍ عَنْ صَبَّاحِ بْنِ سَيَابَةَ عَنِ الْمُعَلَّى بْنِ خُنَيْسٍ قَالَ ذَهَبْتُ بِكِتَابِ عَبْدِ السَّلَامِ بْنِ نُعَيْمٍ وَ سَدِيرٍ وَ كُتُبِ غَيْرِ وَاحِدٍ إِلَى أَبِي عَبْدِ اللَّهِ (عليه السلام) حِينَ ظَهَرَتِ الْمُسَوِّدَةُ قَبْلَ أَنْ يَظْهَرَ وُلْدُ الْعَبَّاسِ بِأَنَّا قَدْ قَدَّرْنَا أَنْ يَئُولَ هَذَا الْأَمْرُ إِلَيْكَ فَمَا تَرَى قَالَ فَضَرَبَ بِالْكُتُبِ الْأَرْضَ ثُمَّ قَالَ أُفٍّ أُفٍّ مَا أَنَا لِهَؤُلَاءِ بِإِمَامٍ أَ مَا يَعْلَمُونَ أَنَّهُ إِنَّمَا يَقْتُلُ السُّفْيَانِيَّ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473640\">H 14957</a> – Humeyd Bin Ziyad, from Abu Al-Abbas Ubeydullah Bin Ahmad Al-Dahqan, from Ali Bin Al-Hassan Al-Tatary, from Muhammad Bin Ziyad Baya’ Al-Sabiry, from Aban, from Sabbah bin Sayabat, from Al-Moalla Bin Khuneys who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> went with the letters</span> of Abdul Salaam Bin Naeem, and Sudeyr, and a letter of someone else to Abu Abdullah<sup>asws</sup>, When Al-Musawwadat makes his appearance, before the appearance of the sons of Al-Abbas, we have estimated that this Command would come to you<sup>asws</sup>, so what do you<sup>asws</sup> see?’ ‘He<sup>asws</sup> threw the letters on the ground, and then said: ‘Uff! Uff! I<sup>asws</sup> am not an Imam<sup>asws</sup> for these ones, but they very well know that he<sup>ajfj</sup> would be killing Al-Sufyani’. "
          ],
          "en.sarwar": [
            "510. Aban, from Abu Baseer who said: I asked Abu Abdullah (a.s.) about the Statement of Allah (azwj): “[24:36] In houses which Allah has permitted to be exalted”, he (a.s.) said: ‘Houses of the Prophets (as)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 482)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 406)"
        ],
        "index": 15195,
        "local_index": 34,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:34",
        "text": [
          "14958- أَبَانٌ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فِي بُيُوتٍ أَذِنَ اللَّهُ أَنْ تُرْفَعَ قَالَ هِيَ بُيُوتُ النَّبِيِّ (صلى الله عليه وآله)."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473641\">H 14958</a> – Aban, from Abu Baseer who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked Abu Abdullah</span><sup>asws</sup> about the Statement of Allah<sup>azwj</sup>: <span class=\"ibTxt\">“[24:36] In houses which Allah has permitted to be exalted”</span>, he<sup>asws</sup> said: ‘Houses of the Prophets<sup>as</sup>’. "
          ],
          "en.sarwar": [
            "511. Aban, from Yahya Bin Abu Al-A’la who said: I heard Abu Abdullah (a.s.) saying: ‘The armour of the Rasool Allah (saww), Zat Al-Fuzoul had two rings of foil in front of it, and two rings of foil at the back of it’. And said; ‘Ali (a.s.) wore it on the Day of Al-Jamal’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 483)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15196,
        "local_index": 35,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:35",
        "text": [
          "14959- أَبَانٌ عَنْ يَحْيَى بْنِ أَبِي الْعَلَاءِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ دِرْعُ رَسُولِ اللَّهِ (صلى الله عليه وآله) ذَاتُ الْفُضُولِ لَهَا حَلْقَتَانِ مِنْ وَرِقٍ فِي مُقَدَّمِهَا وَ حَلْقَتَانِ مِنْ وَرِقٍ فِي مُؤَخَّرِهَا وَ قَالَ لَبِسَهَا عَلِيٌّ (عليه السلام) يَوْمَ الْجَمَلِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473642\">H 14959</a> – Aban, from Yahya Bin Abu Al-A’la who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘The armour of the Rasool Allah<sup>saww</sup>, <span class=\"iTxt\">Zat Al-Fuzoul</span> had two rings of foil in front of it, and two rings of foil at the back of it’. And said; ‘Ali<sup>asws</sup> wore it on the Day of Al-Jamal’."
          ],
          "en.sarwar": [
            "512. Aban, from Yaqoub Bin Shuayb, who has said: Abu Abdullah (a.s.) has said: ‘Ali (a.s.) tightened a glimmering belt around his (a.s.) abdomen on the Day of Al-Jamal which Jibraeel (as) had descended with from the sky, and the Rasool Allah (saww) used to wear it around his (saww) abdomen whenever he (saww) wore the armour’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 483)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 406)"
        ],
        "index": 15197,
        "local_index": 36,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:36",
        "text": [
          "14960- أَبَانٌ عَنْ يَعْقُوبَ بْنِ شُعَيْبٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ شَدَّ عَلِيٌّ (عليه السلام) عَلَى بَطْنِهِ يَوْمَ الْجَمَلِ بِعِقَالٍ أَبْرَقَ نَزَلَ بِهِ جَبْرَئِيلُ (عليه السلام) مِنَ السَّمَاءِ وَ كَانَ رَسُولُ اللَّهِ (صلى الله عليه وآله) يَشُدُّ بِهِ عَلَى بَطْنِهِ إِذَا لَبِسَ الدِّرْعَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473643\">H 14960</a> – Aban, from Yaqoub Bin Shuayb, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘Ali<sup>asws</sup> tightened a glimmering belt around his<sup>asws</sup> abdomen on the Day of Al-Jamal which Jibraeel<sup>as</sup> had descended with from the sky, and the Rasool Allah<sup>saww</sup> used to wear it around his<sup>saww</sup> abdomen whenever he<sup>saww</sup> wore the armour’."
          ],
          "en.sarwar": [
            "513. Aban, from Al-Fazeyl Bin Yasaar, who has said: Abu Ja’far (a.s.) has said: ‘Usman said to Al-Miqdad (ar), ‘By Allah (azwj), stop insulting me or I will return you (ar) to your (ar) First Lord (azwj)’. He (a.s.) said: ‘So when the death presented itself to Al-Miqdad (ar), he (ar) said to Ammar, ‘Make it reach to Usman from me (ar) that I (ar) have returned to my (ar) First Lord (azwj)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 483)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 406)"
        ],
        "index": 15198,
        "local_index": 37,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:37",
        "text": [
          "14961- أَبَانٌ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ إِنَّ عُثْمَانَ قَالَ لِلْمِقْدَادِ أَمَا وَ اللَّهِ لَتَنْتَهِيَنَّ أَوْ لَأَرُدَّنَّكَ إِلَى رَبِّكَ الْأَوَّلِ قَالَ فَلَمَّا حَضَرَتِ الْمِقْدَادَ الْوَفَاةُ قَالَ لِعَمَّارٍ أَبْلِغْ عُثْمَانَ عَنِّي أَنِّي قَدْ رُدِدْتُ إِلَى رَبِّيَ الْأَوَّلِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473644\">H 14961</a> – Aban, from Al-Fazeyl Bin Yasaar, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> has said: ‘Usman said to Al-Miqdad<sup>ar</sup>, ‘By Allah<sup>azwj</sup>, stop insulting me or I will return you<sup>ar</sup> to your<sup>ar</sup> First Lord<sup>azwj</sup>’. He<sup>asws</sup> said: ‘So when the death presented itself to Al-Miqdad<sup>ar</sup>, he<sup>ar</sup> said to Ammar, ‘Make it reach to Usman from me<sup>ar</sup> that I<sup>ar</sup> have returned to my<sup>ar</sup> First Lord<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "514. Aban, from Fazeyl and Ubeyd, who has said: Abu Abdullah (a.s.) has said: ‘When the death presented itself to Muhammad Bin Usama, the Clan of Hashim (as) came up to him. So he said to them, ‘You have recognised my being near in relations to you, and my status among you, and I have a debt upon me so I would love it if you could take the responsibility of it from me’. So Ali (a.s.) Bin Al-Husayn (a.s.) said: ‘By Allah (azwj), a third of your debt is upon me (a.s.)’, then he (a.s.) was quiet and they remained quiet. So Ali (a.s.) Bin Al-Husayn (a.s.) said: ‘Upon me (a.s.) is all of your debt’. Then Ali (a.s.) Bin Al-Husayn (a.s.) said: ‘But what prevented me (a.s.) from assuming the responsibility of all of his debts at first was the abhorrence that they would say, ‘He (a.s.) preceded us for it’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 484)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 406)"
        ],
        "index": 15199,
        "local_index": 38,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:38",
        "text": [
          "14962- أَبَانٌ عَنْ فُضَيْلٍ وَ عُبَيْدٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ لَمَّا حَضَرَ مُحَمَّدَ بْنَ أُسَامَةَ الْمَوْتُ دَخَلَتْ عَلَيْهِ بَنُو هَاشِمٍ فَقَالَ لَهُمْ قَدْ عَرَفْتُمْ قَرَابَتِي وَ مَنْزِلَتِي مِنْكُمْ وَ عَلَيَّ دَيْنٌ فَأُحِبُّ أَنْ تَضْمَنُوهُ عَنِّي فَقَالَ عَلِيُّ بْنُ الْحُسَيْنِ (عليه السلام) أَمَا وَ اللَّهِ ثُلُثُ دَيْنِكَ عَلَيَّ ثُمَّ سَكَتَ وَ سَكَتُوا فَقَالَ عَلِيُّ بْنُ الْحُسَيْنِ (عليه السلام) عَلَيَّ دَيْنُكَ كُلُّهُ ثُمَّ قَالَ عَلِيُّ بْنُ الْحُسَيْنِ (عليه السلام) أَمَا إِنَّهُ لَمْ يَمْنَعْنِي أَنْ أَضْمَنَهُ أَوَّلًا إِلَّا كَرَاهِيَةَ أَنْ يَقُولُوا سَبَقَنَا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473645\">H 14962</a> – Aban, from Fazeyl and Ubeyd, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘When the death presented itself to Muhammad Bin Usama, the Clan of Hashim<sup>as</sup> came up to him. So he said to them, ‘You have recognised my being near in relations to you, and my status among you, and I have a debt upon me so I would love it if you could take the responsibility of it from me’. So Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>, a third of your debt is upon me<sup>asws</sup>’, then he<sup>asws</sup> was quiet and they remained quiet. So Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said: ‘Upon me<sup>asws</sup> is all of your debt’. Then Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said: ‘But what prevented me<sup>asws</sup> from assuming the responsibility of all of his debts at first was the abhorrence that they would say, ‘He<sup>asws</sup> preceded us for it’."
          ],
          "en.sarwar": [
            "515. Aban, from Abu Baseer, who has narrated the following: Abu Abdullah (a.s.) having said: ‘Whenever the Rasool Allah (saww) descended from his (saww) she-camel Al-Qaswa, he (saww) would leave its reins upon it. It would go out and come to the Muslims. So this man would give it something, and that man would give it something. So it would not remain without (its hunger) is being satisfied. It entered its head in a tent of Samarat Bin Jundab, so he took hold of a stick and struck it upon its head. So he scratched it. So it went out to the Prophet (saww) and complained to him (saww)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 484)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15200,
        "local_index": 39,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:39",
        "text": [
          "14963- أَبَانٌ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ كَانَتْ نَاقَةُ رَسُولِ اللَّهِ (صلى الله عليه وآله) الْقَصْوَاءُ إِذَا نَزَلَ عَنْهَا عَلَّقَ عَلَيْهَا زِمَامَهَا قَالَ فَتَخْرُجُ فَتَأْتِي الْمُسْلِمِينَ قَالَ فَيُنَاوِلُهَا الرَّجُلُ الشَّيْ‏ءَ وَ يُنَاوِلُهُ هَذَا الشَّيْ‏ءَ فَلَا تَلْبَثُ أَنْ تَشْبَعَ قَالَ فَأَدْخَلَتْ رَأْسَهَا فِي خِبَاءِ سَمُرَةَ بْنِ جُنْدَبٍ فَتَنَاوَلَ عَنَزَةً فَضَرَبَ بِهَا عَلَى رَأْسِهَا فَشَجَّهَا فَخَرَجَتْ إِلَى النَّبِيِّ (صلى الله عليه وآله) فَشَكَتْهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473646\">H 14963</a> – Aban, from Abu Baseer, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said: ‘Whenever the Rasool Allah<sup>saww</sup> descended from his<sup>saww</sup> she-camel Al-Qaswa, he<sup>saww</sup> would leave its reins upon it. It would go out and come to the Muslims. So this man would give it something, and that man would give it something. So it would not remain without (its hunger) is being satisfied. It entered its head in a tent of Samarat Bin Jundab, so he took hold of a stick and struck it upon its head. So he scratched it. So it went out to the Prophet<sup>saww</sup> and complained to him<sup>saww</sup>’. "
          ],
          "en.sarwar": [
            "516. Aban, from a man, who said: Abu Abdullah (a.s.) has said that: ‘Maryam (as) carried (in her (as)) Isa (as) for nine hours, each hour for a month’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 485)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 407)"
        ],
        "index": 15201,
        "local_index": 40,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:40",
        "text": [
          "14964- أَبَانٌ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ إِنَّ مَرْيَمَ (عليها السلام) حَمَلَتْ بِعِيسَى (عليه السلام) تِسْعَ سَاعَاتٍ كُلُّ سَاعَةٍ شَهْراً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473647\">H 14964</a> – Aban, from a man, who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said that: ‘Maryam<sup>as</sup> carried (in her<sup>as</sup>) Isa<sup>as</sup> for nine hours, each hour for a month’."
          ],
          "en.sarwar": [
            "517. Aban, from Umar Bin Yazeed who said: I said to Abu Abdullah (a.s.) that: ‘Al-Mugheira (and his people) are alleging that this day is for the night that approaches it’. So he (a.s.) said: ‘They lie! This day today is for the night that has passed. The people of Al-Nakhla, when they see the crescent say, ‘The Sacred Month has entered’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 485)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15202,
        "local_index": 41,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:41",
        "text": [
          "14965- أَبَانٌ عَنْ عُمَرَ بْنِ يَزِيدَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ (عليه السلام) إِنَّ الْمُغِيرِيَّةَ يَزْعُمُونَ أَنَّ هَذَا الْيَوْمَ لِهَذِهِ اللَّيْلَةِ الْمُسْتَقْبَلَةِ فَقَالَ كَذَبُوا هَذَا الْيَوْمُ لِلَّيْلَةِ الْمَاضِيَةِ إِنَّ أَهْلَ بَطْنِ نَخْلَةَ حَيْثُ رَأَوُا الْهِلَالَ قَالُوا قَدْ دَخَلَ الشَّهْرُ الْحَرَامُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473648\">H 14965</a> – Aban, from Umar Bin Yazeed who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> said to Abu Abdullah</span><sup>asws</sup> that: ‘Al-Mugheira (and his people) are alleging that this day is for the night that approaches it’. So he<sup>asws</sup> said: ‘They lie! This day today is for the night that has passed. The people of Al-Nakhla, when they see the crescent say, ‘The Sacred Month has entered’. "
          ],
          "en.sarwar": [
            "518. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Sallar Abu Umrat, from Abu Maryam Al-Saqafy, from Ammar Bin Yasser who said: Whilst I was in the presence of the Rasool Allah (saww), when the Rasool Allah (saww) said that: ‘The Shites,the special ones, the sincere ones are from us (a.s.) the People (a.s.) of the Household’. So Umar said, ‘O Rasool Allah (saww), introduce them until we recognise them’. So the Rasool Allah (saww) said: ‘I (saww) am not saying to you except that I (saww) want to inform you’. Then the Rasool Allah (saww) said: ‘I (saww) am the Guide to Allah (azwj) and Ali (a.s.) is the support of the Religion, and its beacons are the People (a.s.) of the Household, and they (a.s.) are the Lights of the Religion by whom (a.s.) it is illuminated’. So Umar said, ‘O Rasool Allah (saww), so the one whose heart is not compatible with this?’ So the Rasool Allah (saww) said: ‘The heart has not been placed in that place except that it is either compatible with it or it is opposed to it. So the one whose heart is compatible with us (a.s.) the People (a.s.) of the Household, would be the saved one, and the one whose heart was opposed to us (a.s.) the People (a.s.) of the Household, would be destroyed’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 486)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15203,
        "local_index": 42,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:42",
        "text": [
          "14966- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ سَلَّارٍ أَبِي عَمْرَةَ عَنْ أَبِي مَرْيَمَ الثَّقَفِيِّ عَنْ عَمَّارِ بْنِ يَاسِرٍ قَالَ بَيْنَا أَنَا عِنْدَ رَسُولِ اللَّهِ (صلى الله عليه وآله) إِذْ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) إِنَّ الشِّيعَةَ الْخَاصَّةَ الْخَالِصَةَ مِنَّا أَهْلَ الْبَيْتِ فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ عَرِّفْنَاهُمْ حَتَّى نَعْرِفَهُمْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ مَا قُلْتُ لَكُمْ إِلَّا وَ أَنَا أُرِيدُ أَنْ أُخْبِرَكُمْ ",
          "ثُمَّ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله)  أَنَا الدَّلِيلُ عَلَى اللَّهِ عَزَّ وَ جَلَّ وَ عَلِيٌّ نَصْرُ الدِّينِ وَ مَنَارُهُ أَهْلُ الْبَيْتِ وَ هُمُ الْمَصَابِيحُ الَّذِينَ يُسْتَضَاءُ بِهِمْ فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ فَمَنْ لَمْ يَكُنْ قَلْبُهُ مُوَافِقاً لِهَذَا فَقَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) مَا وُضِعَ الْقَلْبُ فِي ذَلِكَ الْمَوْضِعِ إِلَّا لِيُوَافِقَ أَوْ لِيُخَالِفَ فَمَنْ كَانَ قَلْبُهُ مُوَافِقاً لَنَا أَهْلَ الْبَيْتِ كَانَ نَاجِياً وَ مَنْ كَانَ قَلْبُهُ مُخَالِفاً لَنَا أَهْلَ الْبَيْتِ كَانَ هَالِكاً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473649\">H 14966</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Sallar Abu Umrat, from Abu Maryam Al-Saqafy, from Ammar Bin Yasser who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-w\">W</span>hilst I was in the</span> presence of the Rasool Allah<sup>saww</sup>, when the Rasool Allah<sup>saww</sup> said that: ‘The Shites,the special ones, the sincere ones are from us<sup>asws</sup> the People<sup>asws</sup> of the Household’. So Umar said, ‘O Rasool Allah<sup>saww</sup>, introduce them until we recognise them’. So the Rasool Allah<sup>saww</sup> said: ‘I<sup>saww</sup> am not saying to you except that I<sup>saww</sup> want to inform you’. ",
            "Then the Rasool Allah<sup>saww</sup> said: ‘I<sup>saww</sup> am the Guide to Allah<sup>azwj</sup> and Ali<sup>asws</sup> is the support of the Religion, and its beacons are the People<sup>asws</sup> of the Household, and they<sup>asws</sup> are the Lights of the Religion by whom<sup>asws</sup> it is illuminated’. So Umar said, ‘O Rasool Allah<sup>saww</sup>, so the one whose heart is not compatible with this?’ So the Rasool Allah<sup>saww</sup> said: ‘The heart has not been placed in that place except that it is either compatible with it or it is opposed to it. So the one whose heart is compatible with us<sup>asws</sup> the People<sup>asws</sup> of the Household, would be the saved one, and the one whose heart was opposed to us<sup>asws</sup> the People<sup>asws</sup> of the Household, would be destroyed’."
          ],
          "en.sarwar": [
            "519. Ahmad, from Ali Bin Al-Hakam, from Quteyba Al-A’ashy who said: I heard Abu Abdullah (a.s.) saying: ‘You have antagonised your fathers, and your sons, and your wives with regards to us (a.s.), and your Reward is upon Allah (azwj) Mighty and Majestic. But rather, it would be most needed when you are in a state when your souls reach to here’ – and he (a.s.) gestured by his (a.s.) hand to his (a.s.) throat’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 486)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 407)"
        ],
        "index": 15204,
        "local_index": 43,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:43",
        "text": [
          "14967- أَحْمَدُ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ قُتَيْبَةَ الْأَعْشَى قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ عَادَيْتُمْ فِينَا الْآبَاءَ وَ الْأَبْنَاءَ وَ الْأَزْوَاجَ وَ ثَوَابُكُمْ عَلَى اللَّهِ عَزَّ وَ جَلَّ أَمَا إِنَّ أَحْوَجَ مَا تَكُونُونَ إِذَا بَلَغَتِ الْأَنْفُسُ إِلَى هَذِهِ وَ أَوْمَأَ بِيَدِهِ إِلَى حَلْقِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473650\">H 14967</a> – Ahmad, from Ali Bin Al-Hakam, from Quteyba Al-A’ashy who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘You have antagonised your fathers, and your sons, and your wives with regards to us<sup>asws</sup>, and your Reward is upon Allah<sup>azwj</sup> Mighty and Majestic. But rather, it would be most needed when you are in a state when your souls reach to here’ – and he<sup>asws</sup> gestured by his<sup>asws</sup> hand to his<sup>asws</sup> throat’."
          ],
          "en.sarwar": [
            "520. From him, from Ahmad Bin Muhammad, from Al-Hassan Bin Ali, from Dawood Bin Suleyman Al-Hammaar, from Saeed Bin Yasaar who said: We sought permission to see Abu Abdullah (a.s.), I, and Al-Haris Bin Al-Mugheira Al-Nasry, and Mansour Al-Sayaqal. So we agreed to meet at the house of Tahir, his (a.s.) slave. So we Prayed Al-Asr, then we went to him (a.s.). We found him (a.s.) leaning against a bed near to the ground. So we seated ourselves around him (a.s.). Then he (a.s.) sat upright and stretched his (a.s.) legs until he (a.s.) placed his (a.s.) feet upon the ground, then said: ‘The Praise is due to Allah (azwj) Who Made the people to go to the right and left as a Murjiite sect, and a Khwarijite sect, and a Qadiriyya sect, and you have been named as the Turabiyya’. Then said to the one seated on his (a.s.) right: ‘And Allah (azwj), there is no god except for Him (azwj), One with no associates to Him (azwj), and His (azwj) Messenger (saww), and the Progeny (a.s.) of His (azwj) Messenger (saww) and their (a.s.) Shites, may Allah (azwj) honour their faces, and he who was not upon that was not upon anything. By Allah (azwj), Ali (a.s.) was higher to the people than their own selves after the Rasool Allah (saww)’. He (a.s.) said it thrice’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 487)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15205,
        "local_index": 44,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:44",
        "text": [
          "14968- عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ دَاوُدَ بْنِ سُلَيْمَانَ الْحَمَّارِ عَنْ سَعِيدِ بْنِ يَسَارٍ قَالَ اسْتَأْذَنَّا عَلَى أَبِي عَبْدِ اللَّهِ (عليه السلام) أَنَا وَ الْحَارِثُ بْنُ الْمُغِيرَةِ النَّصْرِيُّ وَ مَنْصُورٌ الصَّيْقَلُ فَوَاعَدْنَا دَارَ طَاهِرٍ مَوْلَاهُ فَصَلَّيْنَا الْعَصْرَ ثُمَّ رُحْنَا إِلَيْهِ فَوَجَدْنَاهُ مُتَّكِئاً عَلَى سَرِيرٍ قَرِيبٍ مِنَ الْأَرْضِ فَجَلَسْنَا حَوْلَهُ ثُمَّ اسْتَوَى جَالِساً ثُمَّ أَرْسَلَ رِجْلَيْهِ حَتَّى وَضَعَ قَدَمَيْهِ عَلَى الْأَرْضِ ثُمَّ قَالَ الْحَمْدُ لِلَّهِ الَّذِي ذَهَبَ النَّاسُ يَمِيناً وَ شِمَالًا فِرْقَةٌ مُرْجِئَةٌ وَ فِرْقَةٌ خَوَارِجُ وَ فِرْقَةٌ قَدَرِيَّةٌ وَ سُمِّيتُمْ أَنْتُمُ التُّرَابِيَّةَ ثُمَّ قَالَ بِيَمِينٍ مِنْهُ أَمَا وَ اللَّهِ مَا هُوَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ رَسُولُهُ وَ آلُ رَسُولِهِ (صلى الله عليه وآله) وَ شِيعَتُهُمْ كَرَّمَ اللَّهُ وُجُوهَهُمْ وَ مَا كَانَ سِوَى ذَلِكَ فَلَا كَانَ عَلِيٌّ وَ اللَّهِ أَوْلَى النَّاسِ بِالنَّاسِ بَعْدَ رَسُولِ اللَّهِ (صلى الله عليه وآله) يَقُولُهَا ثَلَاثاً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473651\">H 14968</a> – From him, from Ahmad Bin Muhammad, from Al-Hassan Bin Ali, from Dawood Bin Suleyman Al-Hammaar, from Saeed Bin Yasaar who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-w\">W</span>e sought permission</span> to see Abu Abdullah<sup>asws</sup>, I, and Al-Haris Bin Al-Mugheira Al-Nasry, and Mansour Al-Sayaqal. So we agreed to meet at the house of Tahir, his<sup>asws</sup> slave. So we Prayed Al-Asr, then we went to him<sup>asws</sup>. We found him<sup>asws</sup> leaning against a bed near to the ground. So we seated ourselves around him<sup>asws</sup>. Then he<sup>asws</sup> sat upright and stretched his<sup>asws</sup> legs until he<sup>asws</sup> placed his<sup>asws</sup> feet upon the ground, then said: ‘The Praise is due to Allah<sup>azwj</sup> Who Made the people to go to the right and left as a Murjiite sect, and a Khwarijite sect, and a Qadiriyya sect, and you have been named as the Turabiyya’. Then said to the one seated on his<sup>asws</sup> right: ‘And Allah<sup>azwj</sup>, there is no god except for Him<sup>azwj</sup>, One with no associates to Him<sup>azwj</sup>, and His<sup>azwj</sup> Messenger<sup>saww</sup>, and the Progeny<sup>asws</sup> of His<sup>azwj</sup> Messenger<sup>saww</sup> and their<sup>asws</sup> Shites, may Allah<sup>azwj</sup> honour their faces, and he who was not upon that was not upon anything. By Allah<sup>azwj</sup>, Ali<sup>asws</sup> was higher to the people than their own selves after the Rasool Allah<sup>saww</sup>’. He<sup>asws</sup> said it thrice’."
          ],
          "en.sarwar": [
            "521. From him, from Ahmad, from Ali Bin Al-Mustawarad Al-Nakha’ie, from the one who reported it: Abu Abdullah (a.s.) has said; ‘From the Angels who are in the sky of the world, they come to one, and two, and three when they are mentioning the virtues of the Progeny (a.s.) of Muhammad (saww), so they say: ‘But did you see those in their scarcity (of numbers) and the abundance of their enemies, describing the virtues of the Progeny (a.s.) of Muhammad (saww)?’ So the other group of Angels say: “[62:4] That is Allah’s grace; He grants it to whom He pleases, and Allah is the Lord of mighty grace”."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح وقد يعد صحيحا</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 487)",
          "Shaykh Baqir al-Behbudi: <span>صحيح3</span> - Sahih al-Kafi"
        ],
        "index": 15206,
        "local_index": 45,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:45",
        "text": [
          "14969- عَنْهُ عَنْ أَحْمَدَ عَنْ عَلِيِّ بْنِ الْمُسْتَوْرِدِ النَّخَعِيِّ عَمَّنْ رَوَاهُ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ إِنَّ مِنَ الْمَلَائِكَةِ الَّذِينَ فِي سَمَاءِ الدُّنْيَا لَيَطَّلِعُونَ عَلَى الْوَاحِدِ وَ الِاثْنَيْنِ وَ الثَّلَاثَةِ وَ هُمْ يَذْكُرُونَ فَضْلَ آلِ مُحَمَّدٍ (عليهم السلام) فَيَقُولُونَ أَ مَا تَرَوْنَ هَؤُلَاءِ فِي قِلَّتِهِمْ وَ كَثْرَةِ عَدُوِّهِمْ يَصِفُونَ فَضْلَ آلِ مُحَمَّدٍ (عليهم السلام) فَتَقُولُ الطَّائِفَةُ الْأُخْرَى مِنَ الْمَلَائِكَةِ ذلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَنْ يَشاءُ وَ اللَّهُ ذُو الْفَضْلِ الْعَظِيمِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473652\">H 14969</a> – From him, from Ahmad, from Ali Bin Al-Mustawarad Al-Nakha’ie, from the one who reported it:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said; ‘From the Angels who are in the sky of the world, they come to one, and two, and three when they are mentioning the virtues of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, so they say: ‘But did you see those in their scarcity (of numbers) and the abundance of their enemies, describing the virtues of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>?’ So the other group of Angels say: <span class=\"ibTxt\">“[62:4] That is Allah's grace; He grants it to whom He pleases, and Allah is the Lord of mighty grace”</span>. "
          ],
          "en.sarwar": [
            "522. From him, from Ahmad Bin Muhammad, from Ali Bin Al-Hakam, from Umar Bin Hanzala, who has reported the following: Abu Abdullah (a.s.) has said: ‘O Umar, do not place a burden upon our (a.s.) Shites, and be kind to them, for the people cannot bear what you can bear’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 488)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15207,
        "local_index": 46,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:46",
        "text": [
          "14970- عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عُمَرَ بْنِ حَنْظَلَةَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ يَا عُمَرُ لَا تَحْمِلُوا عَلَى شِيعَتِنَا وَ ارْفُقُوا بِهِمْ فَإِنَّ النَّاسَ لَا يَحْتَمِلُونَ مَا تَحْمِلُونَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473653\">H 14970</a> – From him, from Ahmad Bin Muhammad, from Ali Bin Al-Hakam, from Umar Bin Hanzala, who has reported the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘O Umar, do not place a burden upon our<sup>asws</sup> Shites, and be kind to them, for the people cannot bear what you can bear’."
          ],
          "en.sarwar": [
            "523. Muhammad Bin Ahmad Al-Qummy, from his uncle Abdullah Bin Al-Salt, from Yunus Bin Abdul Rahman, from Abdullah Bin Sinan, from Husayn Al-Jamal, who has reported the following: Abu Abdullah (a.s.) regarding the Statement of Allah (azwj) Blessed and High: “[41:29] Our Lord! show us those who led us astray from among the jinn and the men that we may trample them under our feet so that they may be of the lowest”, he (a.s.) said: ‘Those two (Abu Bakr and Umar)’. Then said: ‘And that one (Umar) was a Satan (la)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول ويكن أن يعد حسنا</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 488)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15208,
        "local_index": 47,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:47",
        "text": [
          "14971- مُحَمَّدُ بْنُ أَحْمَدَ الْقُمِّيُّ عَنْ عَمِّهِ عَبْدِ اللَّهِ بْنِ الصَّلْتِ عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ حُسَيْنٍ الْجَمَّالِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِ اللَّهِ تَبَارَكَ وَ تَعَالَى رَبَّنا أَرِنَا الَّذَيْنِ أَضَلَّانا مِنَ الْجِنِّ وَ الْإِنْسِ نَجْعَلْهُما تَحْتَ أَقْدامِنا لِيَكُونا مِنَ الْأَسْفَلِينَ قَالَ هُمَا ثُمَّ قَالَ وَ كَانَ فُلَانٌ شَيْطَاناً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473654\">H 14971</a> - Muhammad Bin Ahmad Al-Qummy, from his uncle Abdullah Bin Al-Salt, from Yunus Bin Abdul Rahman, from Abdullah Bin Sinan, from Husayn Al-Jamal, who has reported the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> regarding the Statement of Allah<sup>azwj</sup> Blessed and High: <span class=\"ibTxt\">“[41:29] Our Lord! show us those who led us astray from among the jinn and the men that we may trample them under our feet so that they may be of the lowest”</span>, he<sup>asws</sup> said: ‘Those two (Abu Bakr and Umar)’. Then said: ‘And that one (Umar) was a Satan<sup>la</sup>’. "
          ],
          "en.sarwar": [
            "524. Yunus, from Sowrat Bin Kuleyb, who has reported the following: Abu Abdullah (a.s.) regarding the statement of Allah (azwj) Blessed and High: “[41:29] Our Lord! show us those who led us astray from among the jinn and the men that we may trample them under our feet so that they may be of the lowest”, he (a.s.) said: ‘O Sowrat! Those two (Abu Bakr and Umar), by Allah (azwj) those two (Abu Bakr and Umar) three times over. By Allah (azwj), O Sowrat, we (a.s.) are the Treasurers of the Knowledge of Allah (azwj) in the sky and we (a.s.) are the Treasurers of the Knowledge of Allah (azwj) in the earth’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 488)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15209,
        "local_index": 48,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:48",
        "text": [
          "14972- يُونُسُ عَنْ سَوْرَةَ بْنِ كُلَيْبٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِ اللَّهِ تَبَارَكَ وَ تَعَالَى رَبَّنا أَرِنَا الَّذَيْنِ أَضَلَّانا مِنَ الْجِنِّ وَ الْإِنْسِ نَجْعَلْهُما تَحْتَ أَقْدامِنا لِيَكُونا مِنَ الْأَسْفَلِينَ قَالَ يَا سَوْرَةُ هُمَا وَ اللَّهِ هُمَا ثَلَاثاً وَ اللَّهِ يَا سَوْرَةُ إِنَّا لَخُزَّانُ عِلْمِ اللَّهِ فِي السَّمَاءِ وَ إِنَّا لَخُزَّانُ عِلْمِ اللَّهِ فِي الْأَرْضِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473655\">H 14972</a> – Yunus, from Sowrat Bin Kuleyb, who has reported the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> regarding the statement of Allah<sup>azwj</sup> Blessed and High: <span class=\"ibTxt\">“[41:29] Our Lord! show us those who led us astray from among the jinn and the men that we may trample them under our feet so that they may be of the lowest”</span>, he<sup>asws</sup> said: ‘O Sowrat! Those two (Abu Bakr and Umar), by Allah<sup>azwj</sup> those two (Abu Bakr and Umar) three times over. By Allah<sup>azwj</sup>, O Sowrat, we<sup>asws</sup> are the Treasurers of the Knowledge of Allah<sup>azwj</sup> in the sky and we<sup>asws</sup> are the Treasurers of the Knowledge of Allah<sup>azwj</sup> in the earth’. "
          ],
          "en.sarwar": [
            "525. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Husayn Bin Saeed, from Suleyman Al-Ja’fary who said: I heard Abu Al-Hassan (a.s.) saying regarding the Statement of Allah (azwj) Blessed and High: “[4:108] They seek to hide from men and seek not to hide from Allah. He is with them when by night they hold discourse displeasing unto Him”, he (a.s.) said: ‘It means so and so and so and so (Abu Bakr and Umar), and Abu Ubeyda Bin Al-Jarrah’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 489)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15210,
        "local_index": 49,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:49",
        "text": [
          "14973- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ سُلَيْمَانَ الْجَعْفَرِيِّ قَالَ سَمِعْتُ أَبَا الْحَسَنِ (عليه السلام) يَقُولُ فِي قَوْلِ اللَّهِ تَبَارَكَ وَ تَعَالَى إِذْ يُبَيِّتُونَ ما لا يَرْضى مِنَ الْقَوْلِ قَالَ يَعْنِي فُلَاناً وَ فُلَاناً وَ أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473656\">H 14973</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Husayn Bin Saeed, from Suleyman Al-Ja’fary who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Al-Hassan</span><sup>asws</sup> saying regarding the Statement of Allah<sup>azwj</sup> Blessed and High: <span class=\"ibTxt\">“[4:108] They seek to hide from men and seek not to hide from Allah. He is with them when by night they hold discourse displeasing unto Him”</span>, he<sup>asws</sup> said: ‘It means so and so and so and so (Abu Bakr and Umar), and Abu Ubeyda Bin Al-Jarrah’. "
          ],
          "en.sarwar": [
            "526. Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, and someone else, from Mansour Bin Yunus, from Ibn Azina, from Abdullah Bin Najjashy who said: I heard Abu Abdullah (a.s.) saying regarding the Statement of Allah (azwj) Mighty and Majestic: “[4:63] These are they of whom Allah knows what is in their hearts; therefore turn aside from them and admonish them, and speak to them effectual words concerning themselves”, Meaning, by Allah (azwj), so and so and so and so (Abu Bakr and Umar). “[4:64] And We did not send any messenger but that he should be obeyed by Allah’s permission; and had they, when they were unjust to themselves, come to you and asked forgiveness of Allah and the Messenger had (also) asked forgiveness for them, they would have found Allah Oft-returning (to mercy), Merciful”, Meaning, by Allah (azwj), the Prophet (saww) and Ali (a.s.) due to what they had done to him (a.s.). Yes, had they come to you (a.s.) with it, O Ali (a.s.), and asked forgiveness of Allah and the Messenger had (also) asked forgiveness for them, they would have found Allah Oft-returning (to mercy), Merciful. “[4:65] But no! by your Lord! they do not believe (in reality) until they make you a judge of that which has become a matter of disagreement among them”. So Abu Abdullah (a.s.) said: ‘By Allah (azwj), it is Ali (a.s.) who is Meant by it. and then do not find any straightness in their hearts as to what you have decided, upon your (saww) tongue, O Rasool Allah (saww), Meaning by it the Wilayah of Ali (a.s.) and submit with entire submission to Ali (a.s.)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 490)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15211,
        "local_index": 50,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:50",
        "text": [
          "14974- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ وَ غَيْرُهُ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنِ ابْنِ أُذَيْنَةَ عَنْ عَبْدِ اللَّهِ بْنِ النَّجَاشِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ أُولئِكَ الَّذِينَ يَعْلَمُ اللَّهُ ما فِي قُلُوبِهِمْ فَأَعْرِضْ عَنْهُمْ وَ عِظْهُمْ وَ قُلْ لَهُمْ فِي أَنْفُسِهِمْ قَوْلًا بَلِيغاً يَعْنِي وَ اللَّهِ فُلَاناً وَ فُلَاناً",
          "وَ ما أَرْسَلْنا مِنْ رَسُولٍ إِلَّا لِيُطاعَ بِإِذْنِ اللَّهِ وَ لَوْ أَنَّهُمْ إِذْ ظَلَمُوا أَنْفُسَهُمْ جاؤُكَ فَاسْتَغْفَرُوا اللَّهَ وَ اسْتَغْفَرَ لَهُمُ الرَّسُولُ لَوَجَدُوا اللَّهَ تَوَّاباً رَحِيماً يَعْنِي وَ اللَّهِ النَّبِيَّ (صلى الله عليه وآله) وَ عَلِيّاً (عليه السلام) مِمَّا صَنَعُوا أَيْ لَوْ جَاءُوكَ بِهَا يَا عَلِيُّ فَاسْتَغْفَرُوا اللَّهَ مِمَّا صَنَعُوا وَ اسْتَغْفَرَ لَهُمُ الرَّسُولُ لَوَجَدُوا اللَّهَ تَوَّاباً رَحِيماً فَلا وَ رَبِّكَ لا يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ فِيما شَجَرَ بَيْنَهُمْ فَقَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) هُوَ وَ اللَّهِ عَلِيٌّ بِعَيْنِهِ ثُمَّ لا يَجِدُوا فِي أَنْفُسِهِمْ حَرَجاً مِمَّا قَضَيْتَ عَلَى لِسَانِكَ يَا رَسُولَ اللَّهِ يَعْنِي بِهِ مِنْ وَلَايَةِ عَلِيٍّ وَ يُسَلِّمُوا تَسْلِيماً لِعَلِيٍّ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473657\">H 14974</a> – Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, and someone else, from Mansour Bin Yunus, from Ibn Azina, from Abdullah Bin Najjashy who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Abdullah</span><sup>asws</sup> saying regarding the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[4:63] These are they of whom Allah knows what is in their hearts; therefore turn aside from them and admonish them, and speak to them effectual words concerning themselves”</span>, Meaning, by Allah<sup>azwj</sup>, so and so and so and so (Abu Bakr and Umar). ",
            "<span class=\"ibTxt\">“[4:64] And We did not send any messenger but that he should be obeyed by Allah's permission; and had they, when they were unjust to themselves, come to you and asked forgiveness of Allah and the Messenger had (also) asked forgiveness for them, they would have found Allah Oft-returning (to mercy), Merciful”</span>, Meaning, by Allah<sup>azwj</sup>, the Prophet<sup>saww</sup> and Ali<sup>asws</sup> due to what they had done to him<sup>asws</sup>. Yes, <span class=\"ibTxt\">had they</span> come to you<sup>asws</sup> with it, O Ali<sup>asws</sup>, <span class=\"ibTxt\">and asked forgiveness of Allah and the Messenger had (also) asked forgiveness for them, they would have found Allah Oft-returning (to mercy), Merciful</span>. <span class=\"ibTxt\">“[4:65] But no! by your Lord! they do not believe (in reality) until they make you a judge of that which has become a matter of disagreement among them”</span>. So Abu Abdullah<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>, it is Ali<sup>asws</sup> who is Meant by it. <span class=\"ibTxt\">and then do not find any straightness in their hearts as to what you have decided</span>, upon your<sup>saww</sup> tongue, O Rasool Allah<sup>saww</sup>, Meaning by it the Wilayah of Ali<sup>asws</sup> <span class=\"ibTxt\">and submit with entire submission</span> to Ali<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "527. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muammar Bin Khallaad who said: I heard Abu Al-Hassan (a.s.) saying: ‘Sometimes I (a.s.) see the dream, so I (a.s.) interpret it, and the dream is upon what you interpret’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 490)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15212,
        "local_index": 51,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:51",
        "text": [
          "14975- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُعَمَّرِ بْنِ خَلَّادٍ قَالَ سَمِعْتُ أَبَا الْحَسَنِ (عليه السلام) يَقُولُ رُبَّمَا رَأَيْتُ الرُّؤْيَا فَأُعَبِّرُهَا وَ الرُّؤْيَا عَلَى مَا تُعَبَّرُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473658\">H 14975</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muammar Bin Khallaad who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Al-Hassan</span><sup>asws</sup> saying: ‘Sometimes I<sup>asws</sup> see the dream, so I<sup>asws</sup> interpret it, and the dream is upon what you interpret’."
          ],
          "en.sarwar": [
            "528. b – From him, from Ahmad Bin Muhammad, from Ibn Fazzaal, from AL-Hassan Bin Jahm who said: I heard Abu Al-Hassan (a.s.) saying: ‘The dream is upon what interpretation you give it’. So I said to him (a.s.) that, ‘Some of our companions are reporting that the dream of the king was a confused dream’. So Abu Al-Hassan (a.s.) said: ‘A woman saw a dream during the era of the Rasool Allah (saww) that a pillar of her house had broken. So she came to the Rasool Allah (saww) and related the dream to him (saww). The Prophet (saww) said to her: ‘Your husband will come to you safely’; and her husband had gone away (in a caravan). So he came just as the Prophet (saww) said that he would. Then he went away from her for another time. She saw in the dream as if a pillar of her house had broken. So she came to the Prophet (saww) and related the dream to him (saww). So he (saww) said to her: ‘Your husband will come to you safely’. So he came as he (saww) had said he would. Then her husband went away for a third time. She saw in her dream that a pillar of her house had broken. She met a left-handed man (a fortune teller), so she related her dream to him. The man said to her, ‘The evil. Your husband is dead’. (As the news of her dead husband) reached the Prophet (saww), so he (saww) said: ‘If only he had interpreted it for her in a good way’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن لا يقصر عن الصحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 492)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15213,
        "local_index": 52,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:52",
        "text": [
          "14975 b- عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ الْحَسَنِ بْنِ جَهْمٍ قَالَ سَمِعْتُ أَبَا الْحَسَنِ (عليه السلام) يَقُولُ الرُّؤْيَا عَلَى مَا تُعَبَّرُ فَقُلْتُ لَهُ إِنَّ بَعْضَ أَصْحَابِنَا رَوَى أَنَّ رُؤْيَا الْمَلِكِ كَانَتْ أَضْغَاثَ أَحْلَامٍ فَقَالَ أَبُو الْحَسَنِ (عليه السلام) إِنَّ امْرَأَةً رَأَتْ عَلَى عَهْدِ رَسُولِ اللَّهِ (صلى الله عليه وآله) أَنَّ جِذْعَ بَيْتِهَا قَدِ انْكَسَرَ فَأَتَتْ رَسُولَ اللَّهِ (صلى الله عليه وآله) فَقَصَّتْ عَلَيْهِ الرُّؤْيَا فَقَالَ لَهَا النَّبِيُّ (صلى الله عليه وآله) يَقْدَمُ زَوْجُكِ وَ يَأْتِي وَ هُوَ صَالِحٌ وَ قَدْ كَانَ زَوْجُهَا غَائِباً فَقَدِمَ كَمَا قَالَ النَّبِيُّ (صلى الله عليه وآله)",
          "ثُمَّ غَابَ عَنْهَا زَوْجُهَا غَيْبَةً أُخْرَى فَرَأَتْ فِي الْمَنَامِ كَأَنَّ جِذْعَ بَيْتِهَا قَدِ انْكَسَرَ فَأَتَتِ النَّبِيَّ (صلى الله عليه وآله) فَقَصَّتْ عَلَيْهِ الرُّؤْيَا فَقَالَ لَهَا يَقْدَمُ زَوْجُكِ وَ يَأْتِي صَالِحاً فَقَدِمَ عَلَى مَا قَالَ ثُمَّ غَابَ زَوْجُهَا ثَالِثَةً فَرَأَتْ فِي مَنَامِهَا أَنَّ جِذْعَ بَيْتِهَا قَدِ انْكَسَرَ فَلَقِيَتْ رَجُلًا أَعْسَرَ فَقَصَّتْ عَلَيْهِ الرُّؤْيَا فَقَالَ لَهَا الرَّجُلُ السَّوْءُ يَمُوتُ زَوْجُكِ قَالَ فَبَلَغَ ذَلِكَ النَّبِيَّ (صلى الله عليه وآله) فَقَالَ أَلَّا كَانَ عَبَّرَ لَهَا خَيْراً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473659\">H 14975 b</a> – From him, from Ahmad Bin Muhammad, from Ibn Fazzaal, from AL-Hassan Bin Jahm who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Abu Al-Hassan</span><sup>asws</sup> saying: ‘The dream is upon what interpretation you give it’. So I said to him<sup>asws</sup> that, ‘Some of our companions are reporting that the dream of the king was a confused dream’. So Abu Al-Hassan<sup>asws</sup> said: ‘A woman saw a dream during the era of the Rasool Allah<sup>saww</sup> that a pillar of her house had broken. So she came to the Rasool Allah<sup>saww</sup> and related the dream to him<sup>saww</sup>. The Prophet<sup>saww</sup> said to her: ‘Your husband will come to you safely’; and her husband had gone away (in a caravan). So he came just as the Prophet<sup>saww</sup> said that he would.",
            "Then he went away from her for another time. She saw in the dream as if a pillar of her house had broken. So she came to the Prophet<sup>saww</sup> and related the dream to him<sup>saww</sup>. So he<sup>saww</sup> said to her: ‘Your husband will come to you safely’. So he came as he<sup>saww</sup> had said he would. Then her husband went away for a third time. She saw in her dream that a pillar of her house had broken. She met a left-handed man (a fortune teller), so she related her dream to him. The man said to her, ‘The evil. Your husband is dead’. (As the news of her dead husband) reached the Prophet<sup>saww</sup>, so he<sup>saww</sup> said: ‘If only he had interpreted it for her in a good way’. "
          ],
          "en.sarwar": [
            "529. A number of our companions, from Sahl Bin Ziyad and Ali Bin Ibrahim, from his father together, from Ibn Mahboub, from Abdullah Bin Ghalib, from Jabir Bin Yazeed, who has narrated the following: Abu Ja’far (a.s.) said that the Rasool Allah (saww) had said: ‘The dream of the Believer floats in between the sky and the earth over the head of its dreamer until he interprets it for himself, or it is interpreted for him by someone like him. So when it gets interpreted, it comes to the ground. So do not narrate your dreams except to the one who understand’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 492)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15214,
        "local_index": 53,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:53",
        "text": [
          "14976- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ غَالِبٍ عَنْ جَابِرِ بْنِ يَزِيدَ عَنْ أَبِي جَعْفَرٍ (عليه السلام) أَنَّ رَسُولَ اللَّهِ كَانَ يَقُولُ إِنَّ رُؤْيَا الْمُؤْمِنِ تُرِفُّ بَيْنَ السَّمَاءِ وَ الْأَرْضِ عَلَى رَأْسِ صَاحِبِهَا حَتَّى يُعَبِّرَهَا لِنَفْسِهِ أَوْ يُعَبِّرَهَا لَهُ مِثْلُهُ فَإِذَا عُبِّرَتْ لَزِمَتِ الْأَرْضَ فَلَا تَقُصُّوا رُؤْيَاكُمْ إِلَّا عَلَى مَنْ يَعْقِلُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473660\">H 14976</a> – A number of our companions, from Sahl Bin Ziyad and Ali Bin Ibrahim, from his father together, from Ibn Mahboub, from Abdullah Bin Ghalib, from Jabir Bin Yazeed, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> said that the Rasool Allah<sup>saww</sup> had said: ‘The dream of the Believer floats in between the sky and the earth over the head of its dreamer until he interprets it for himself, or it is interpreted for him by someone like him. So when it gets interpreted, it comes to the ground. So do not narrate your dreams except to the one who understand’. "
          ],
          "en.sarwar": [
            "530. Muhammad Bin yahya, from Ahmad Bin Muhammad, from Muhammad Bin Khalid, from Al-Qasim bin Urwat, from Abu Baseer, who has reported the following: Abu Abdullah (a.s.) has said that the Rasool Allah (saww) said: ‘Do not tell your dream except to a Believer who is free from the envy and the rebellion’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 492)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15215,
        "local_index": 54,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:54",
        "text": [
          "14977- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنِ الْقَاسِمِ بْنِ عُرْوَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) الرُّؤْيَا لَا تُقَصُّ إِلَّا عَلَى مُؤْمِنٍ خَلَا مِنَ الْحَسَدِ وَ الْبَغْيِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473661\">H 14977</a> – Muhammad Bin yahya, from Ahmad Bin Muhammad, from Muhammad Bin Khalid, from Al-Qasim bin Urwat, from Abu Baseer, who has reported the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said that the Rasool Allah<sup>saww</sup> said: ‘Do not tell your dream except to a Believer who is free from the envy and the rebellion’. "
          ],
          "en.sarwar": [
            "531. Humeyd Bin Ziyad, from Al-Hassan Bin Muhammad Al-Kindy, from Ahmad Bin Al-Hassan Al-Maysami, from Aban Bin Usman, from a man, who has reported the following: Abu Abdullah (a.s.) has said: ‘There was a man during the era of the Rasool Allah (saww) called Zu Al-Namrat, and he was from the ugliest of the people and that is why he was named Al-Zu Al-Namrat (Animal face) due to his ugliness. So he came to the Prophet (saww) and said, ‘O Rasool Allah (saww), inform me of what Allah (azwj) Mighty and Majestic has Made to be obligatory upon me’. So the Rasool Allah (saww) said to him: ‘Allah (azwj) has Made it an obligation upon you to Pray seventeen cycles during the day and the night, and Fasts of the Month of Ramadhan when you are of realisation (adult), and the Pilgrimage when you have the (financial) capability for it, and the Zakat’, and detailed these for him. So he said, ‘By the One Who (azwj) Sent you with the Truth as a Prophet (saww), I shall not increase anything upon what has been Obligated upon me’. So the Rasool Allah (saww) said; ‘And why, O Zu Al-Namrat?’ He said, ‘For He (azwj) has Created me as ugly’. He (a.s.) said: ‘So Jibraeel (as) descended upon the Prophet (saww) and said: ‘O Rasool Allah (saww)! Your (saww) Lord (azwj) Commands you (saww) that you (saww) should convey Greetings to Zu Al-Namrat and say to him: ‘Your Lord (azwj), Blessed and High has Said to you: “Would it not make you happy to be resurrected upon the beauty of Jibraeel (as) on the Day of Judgement?’ So the Rasool Allah (saww) said to him: ‘O Zu Al-Namrat! This here is Jibraeel (as) Commanding me (as) that I (saww) should convey Greetings to you and that your Lord (azwj) has said: “Would it not make you happy to be resurrected upon the beauty of Jibraeel?’ So Zu Al-Namrat said, ‘I have thus become happy, O Lord (azwj). By Your (azwj) Honour, I shall increase (my worship) for You (azwj) until You (azwj) are Pleased’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 493)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15216,
        "local_index": 55,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:46:55",
        "text": [
          "14978- حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الْكِنْدِيِّ عَنْ أَحْمَدَ بْنِ الْحَسَنِ الْمِيثَمِيِّ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ كَانَ عَلَى عَهْدِ رَسُولِ اللَّهِ (صلى الله عليه وآله) رَجُلٌ يُقَالُ لَهُ ذُو النَّمِرَةِ وَ كَانَ مِنْ أَقْبَحِ النَّاسِ وَ إِنَّمَا سُمِّيَ ذُو النَّمِرَةِ مِنْ قُبْحِهِ فَأَتَى النَّبِيَّ (صلى الله عليه وآله) فَقَالَ يَا رَسُولَ اللَّهِ أَخْبِرْنِي مَا فَرَضَ اللَّهُ عَزَّ وَ جَلَّ عَلَيَّ فَقَالَ لَهُ رَسُولُ اللَّهِ (صلى الله عليه وآله) فَرَضَ اللَّهُ عَلَيْكَ سَبْعَةَ عَشَرَ رَكْعَةً فِي الْيَوْمِ وَ اللَّيْلَةِ وَ صَوْمَ شَهْرِ رَمَضَانَ إِذَا أَدْرَكْتَهُ وَ الْحَجَّ إِذَا اسْتَطَعْتَ إِلَيْهِ سَبِيلًا وَ الزَّكَاةَ وَ فَسَّرَهَا لَهُ ",
          "فَقَالَ وَ الَّذِي بَعَثَكَ بِالْحَقِّ نَبِيّاً مَا أَزِيدُ رَبِّي عَلَى مَا فَرَضَ عَلَيَّ شَيْئاً فَقَالَ لَهُ النَّبِيُّ (صلى الله عليه وآله) وَ لِمَ يَا ذَا النَّمِرَةِ فَقَالَ كَمَا خَلَقَنِي قَبِيحاً ",
          "قَالَ فَهَبَطَ جَبْرَئِيلُ (عليه السلام) عَلَى النَّبِيِّ (صلى الله عليه وآله) فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ رَبَّكَ يَأْمُرُكَ أَنْ تُبَلِّغَ ذَا النَّمِرَةِ عَنْهُ السَّلَامَ وَ تَقُولَ لَهُ يَقُولُ لَكَ رَبُّكَ تَبَارَكَ وَ تَعَالَى أَ مَا تَرْضَى أَنْ أَحْشُرَكَ عَلَى جَمَالِ جَبْرَئِيلَ (عليه السلام) يَوْمَ الْقِيَامَةِ فَقَالَ لَهُ رَسُولُ اللَّهِ (صلى الله عليه وآله) يَا ذَا النَّمِرَةِ هَذَا جَبْرَئِيلُ يَأْمُرُنِي أَنْ أُبَلِّغَكَ السَّلَامَ وَ يَقُولُ لَكَ رَبُّكَ أَ مَا تَرْضَى أَنْ أَحْشُرَكَ عَلَى جَمَالِ جَبْرَئِيلَ فَقَالَ ذُو النَّمِرَةِ فَإِنِّي قَدْ رَضِيتُ يَا رَبِّ فَوَ عِزَّتِكَ لَأَزِيدَنَّكَ حَتَّى تَرْضَى."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473662\">H 14978</a> – Humeyd Bin Ziyad, from Al-Hassan Bin Muhammad Al-Kindy, from Ahmad Bin Al-Hassan Al-Maysami, from Aban Bin Usman, from a man, who has reported the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘There was a man during the era of the Rasool Allah<sup>saww</sup> called <span class=\"iTxt\">Zu Al-Namrat</span>, and he was from the ugliest of the people and that is why he was named Al-<span class=\"iTxt\">Zu Al-Namrat</span> (Animal face) due to his ugliness. So he came to the Prophet<sup>saww</sup> and said, ‘O Rasool Allah<sup>saww</sup>, inform me of what Allah<sup>azwj</sup> Mighty and Majestic has Made to be obligatory upon me’. So the Rasool Allah<sup>saww</sup> said to him: ‘Allah<sup>azwj</sup> has Made it an obligation upon you to Pray seventeen cycles during the day and the night, and Fasts of the Month of Ramadhan when you are of realisation (adult), and the Pilgrimage when you have the (financial) capability for it, and the Zakat’, and detailed these for him.",
            "So he said, ‘By the One Who<sup>azwj</sup> Sent you with the Truth as a Prophet<sup>saww</sup>, I shall not increase anything upon what has been Obligated upon me’. So the Rasool Allah<sup>saww</sup> said; ‘And why, O Zu Al-Namrat?’ He said, ‘For He<sup>azwj</sup> has Created me as ugly’. ",
            "He<sup>asws</sup> said: ‘So Jibraeel<sup>as</sup> descended upon the Prophet<sup>saww</sup> and said: ‘O Rasool Allah<sup>saww</sup>! Your<sup>saww</sup> Lord<sup>azwj</sup> Commands you<sup>saww</sup> that you<sup>saww</sup> should convey Greetings to Zu Al-Namrat and say to him: ‘Your Lord<sup>azwj</sup>, Blessed and High has Said to you: “Would it not make you happy to be resurrected upon the beauty of Jibraeel<sup>as</sup> on the Day of Judgement?’ So the Rasool Allah<sup>saww</sup> said to him: ‘O <span class=\"iTxt\">Zu Al-Namrat</span>! This here is Jibraeel<sup>as</sup> Commanding me<sup>as</sup> that I<sup>saww</sup> should convey Greetings to you and that your Lord<sup>azwj</sup> has said: “Would it not make you happy to be resurrected upon the beauty of Jibraeel?’ So <span class=\"iTxt\">Zu Al-Namrat</span> said, ‘I have thus become happy, O Lord<sup>azwj</sup>. By Your<sup>azwj</sup> Honour, I shall increase (my worship) for You<sup>azwj</sup> until You<sup>azwj</sup> are Pleased’. "
          ],
          "en.sarwar": [
            "532. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Hassan Bin Mahboub, from Abu Jameela, from Aban Bin Taglib, who has reported the following: Abu Abdullah (a.s.) was asked, ‘Did Isa Ibn Maryam (as) revive anyone after his death to the extent that he ate, received sustenance, and had a term, and children?’ He (a.s.) said: ‘Yes. He (as) had a friend who he (as) had established brotherhood with for the Sake of Allah (azwj) Blessed and High, and Isa (as) used to pass by him and visit him. And that Isa (as) remained absent from him for a while, then passed by his house to greet him. His mother came out to him (as). So he (as) asked her about him. She said, ‘He died, O Messenger (as) of Allah (azwj)’. He (as) said: ‘Would you love to see him’. She said, ‘Yes’. He (as) said to her: ‘Come to me (as) tomorrow and I (as) shall revive him for you by the Permission of Allah (azwj) Blessed and High’. So when it was the next day, she came over. He (as) said to her: ‘Come with me (as) to his grave’. So they went until they arrived at his grave. Isa (as) paused at it, and then supplicated to Allah (azwj). The grave split apart and her son came out alive. So when his mother saw him, and he saw her, they wept. Isa (as) sympathised with them. Isa (as) said to him: ‘Would you like to remain alive with your mother in the world?’ He said, ‘O Prophet (saww) of Allah (azwj), with eating and sustenance and a term, or without eating and sustenance and a term?’ So Isa (as) said to him: ‘With eating and sustenance and a term. And you will be living for twenty years and get married and have children’. He said, ‘Yes’. When he said that, Isa (as) handed him over to his mother. He thus lived for twenty years, and got married, and had children’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:46",
  "kind": "verse_list"
}