{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 8"}, "path": "/books/al-kafi:8", "titles": {"ar": "الجزء الثامن‏", "en": "Volume Eight"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:8:1", "titles": {"ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;", "en": "The Book - Garden (of Flowers)"}}, {"indexed_titles": {"en": "Chapter 47"}, "path": "/books/al-kafi:8:1:47", "titles": {"ar": "حَدِيثُ الَّذِي أَحْيَاهُ عِيسَى ( عليه السلام )", "en": "HADEETH OF THE ONE WHO WAS BROUGHT BACK TO LIFE BY ISA<sup>as</sup>"}}], "index": 2308, "local_index": 47, "part_type": "Chapter", "path": "/books/al-kafi:8:1:47", "titles": {"ar": "حَدِيثُ الَّذِي أَحْيَاهُ عِيسَى ( عليه السلام )", "en": "HADEETH OF THE ONE WHO WAS BROUGHT BACK TO LIFE BY ISA<sup>as</sup>"}, "verse_count": 4, "verse_start_index": 15205, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 15206, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:8:1:47:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14979</span>- مُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ أَبِي جَمِيلَةَ عَنْ أَبَانِ بْنِ تَغْلِبَ وَ غَيْرِهِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) أَنَّهُ سُئِلَ هَلْ كَانَ عِيسَى ابْنُ مَرْيَمَ أَحْيَا أَحَداً بَعْدَ مَوْتِهِ حَتَّى كَانَ لَهُ أَكْلٌ وَ رِزْقٌ وَ مُدَّةٌ وَ وَلَدٌ فَقَالَ نَعَمْ إِنَّهُ كَانَ لَهُ صَدِيقٌ مُوَاخٍ لَهُ فِي اللَّهِ تَبَارَكَ وَ تَعَالَى وَ كَانَ عِيسَى (عليه السلام) يَمُرُّ بِهِ وَ يَنْزِلُ عَلَيْهِ", "وَ إِنَّ عِيسَى غَابَ عَنْهُ حِيناً ثُمَّ مَرَّ بِهِ لِيُسَلِّمَ عَلَيْهِ فَخَرَجَتْ إِلَيْهِ أُمُّهُ فَسَأَلَهَا عَنْهُ فَقَالَتْ مَاتَ يَا رَسُولَ اللَّهِ فَقَالَ أَ فَتُحِبِّينَ أَنْ تَرَاهُ قَالَتْ نَعَمْ فَقَالَ لَهَا فَإِذَا كَانَ غَداً فَآتِيكِ حَتَّى أُحْيِيَهُ لَكِ بِإِذْنِ اللَّهِ تَبَارَكَ وَ تَعَالَى", "فَلَمَّا كَانَ مِنَ الْغَدِ أَتَاهَا فَقَالَ لَهَا انْطَلِقِي مَعِي إِلَى قَبْرِهِ فَانْطَلَقَا حَتَّى أَتَيَا قَبْرَهُ فَوَقَفَ عَلَيْهِ عِيسَى (عليه السلام) ثُمَّ دَعَا اللَّهَ عَزَّ وَ جَلَّ فَانْفَرَجَ الْقَبْرُ وَ خَرَجَ ابْنُهَا حَيّاً فَلَمَّا رَأَتْهُ أُمُّهُ وَ رَآهَا بَكَيَا فَرَحِمَهُمَا عِيسَى (عليه السلام) فَقَالَ لَهُ عِيسَى أَ تُحِبُّ أَنْ تَبْقَى مَعَ أُمِّكَ فِي الدُّنْيَا فَقَالَ يَا نَبِيَّ اللَّهِ بِأَكْلٍ وَ رِزْقٍ وَ مُدَّةٍ أَمْ بِغَيْرِ أَكْلٍ وَ لَا رِزْقٍ وَ لَا مُدَّةٍ فَقَالَ لَهُ عِيسَى (عليه السلام) بِأَكْلٍ وَ رِزْقٍ وَ مُدَّةٍ وَ تُعَمَّرُ عِشْرِينَ سَنَةً وَ تَزَوَّجُ وَ يُولَدُ لَكَ قَالَ نَعَمْ إِذاً قَالَ فَدَفَعَهُ عِيسَى إِلَى أُمِّهِ فَعَاشَ عِشْرِينَ سَنَةً وَ تَزَوَّجَ وَ وُلِدَ لَهُ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473664\">H 14979</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Hassan Bin Mahboub, from Abu Jameela, from Aban Bin Taglib, who has reported the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup style=\"font-weight: normal\">asws</sup> was asked, ‘Did Isa Ibn Maryam<sup style=\"font-weight: normal\">as</sup> revive anyone after his death to the extent that he ate, received sustenance, and had a term, and children?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘Yes. He<sup style=\"font-weight: normal\">as</sup> had a friend who he<sup style=\"font-weight: normal\">as</sup> had established brotherhood with for the Sake of Allah<sup style=\"font-weight: normal\">azwj</sup> Blessed and High, and Isa<sup style=\"font-weight: normal\">as</sup> used to pass by him and visit him.", "And that Isa<sup style=\"font-weight: normal\">as</sup> remained absent from him for a while, then passed by his house to greet him. His mother came out to him<sup style=\"font-weight: normal\">as</sup>. So he<sup style=\"font-weight: normal\">as</sup> asked her about him. She said, ‘He died, O Messenger<sup style=\"font-weight: normal\">as</sup> of Allah<sup style=\"font-weight: normal\">azwj</sup>’. He<sup style=\"font-weight: normal\">as</sup> said: ‘Would you love to see him’. She said, ‘Yes’. He<sup style=\"font-weight: normal\">as</sup> said to her: ‘Come to me <sup style=\"font-weight: normal\">as</sup> tomorrow and I<sup style=\"font-weight: normal\">as</sup> shall revive him for you by the Permission of Allah<sup style=\"font-weight: normal\">azwj</sup> Blessed and High’. ", "So when it was the next day, she came over. He<sup>as</sup> said to her: ‘Come with me<sup>as</sup> to his grave’. So they went until they arrived at his grave. Isa<sup>as</sup> paused at it, and then supplicated to Allah<sup>azwj</sup>. The grave split apart and her son came out alive. So when his mother saw him, and he saw her, they wept. Isa<sup>as</sup> sympathised with them. Isa<sup>as</sup> said to him: ‘Would you like to remain alive with your mother in the world?’ He said, ‘O Prophet<sup>saww</sup> of Allah<sup>azwj</sup>, with eating and sustenance and a term, or without eating and sustenance and a term?’ So Isa<sup>as</sup> said to him: ‘With eating and sustenance and a term. And you will be living for twenty years and get married and have children’. He said, ‘Yes’. When he said that, Isa<sup>as</sup> handed him over to his mother. He thus lived for twenty years, and got married, and had children’."]}}, {"index": 15207, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:8:1:47:2", "text": ["14980- ابْنُ مَحْبُوبٍ عَنْ أَبِي وَلَّادٍ وَ غَيْرُهُ مِنْ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ يُرِدْ فِيهِ بِإِلْحادٍ بِظُلْمٍ فَقَالَ مَنْ عَبَدَ فِيهِ غَيْرَ اللَّهِ عَزَّ وَ جَلَّ أَوْ تَوَلَّى فِيهِ غَيْرَ أَوْلِيَاءِ اللَّهِ فَهُوَ مُلْحِدٌ بِظُلْمٍ وَ عَلَى اللَّهِ تَبَارَكَ وَ تَعَالَى أَنْ يُذِيقَهُ مِنْ عَذَابٍ أَلِيمٍ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473665\">H 14980</a> – Ibn Mahboub, from Abu Walladin, and someone else from our companions, who have reported the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> regarding the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[22:25] and whoever shall incline therein to wrong unjustly, We will make him taste of a painful chastisement”</span>, so he<sup>asws</sup> said: ‘The one who worships other than Allah<sup>azwj</sup> Mighty and Majestic, or befriends other than the Guardians<sup>asws</sup> from Allah<sup>azwj</sup>, so he has inclined to injustice and it is upon Allah<sup>azwj</sup> Blessed and High to <span class=\"ibTxt\">make him taste of a painful chastisement”</span>."]}}, {"index": 15208, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:8:1:47:3", "text": ["14981- ابْنُ مَحْبُوبٍ عَنْ أَبِي جَعْفَرٍ الْأَحْوَلِ عَنْ سَلَّامِ بْنِ الْمُسْتَنِيرِ عَنْ أَبِي جَعْفَرٍ (عليه السلام) فِي قَوْلِ اللَّهِ تَبَارَكَ وَ تَعَالَى الَّذِينَ أُخْرِجُوا مِنْ دِيارِهِمْ بِغَيْرِ حَقٍّ إِلَّا أَنْ يَقُولُوا رَبُّنَا اللَّهُ قَالَ نَزَلَتْ فِي رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ عَلِيٍّ وَ حَمْزَةَ وَ جَعْفَرٍ وَ جَرَتْ فِي الْحُسَيْنِ عَلَيْهِمُ السَّلَامُ أَجْمَعِينَ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473666\">H 14981</a> – Ibn Mahboub, from Abu Ja’far Al-Howl, from Sallam Bin Al-Mustaneer, who has reported the following:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> regarding the Statement of Allah<sup>azwj</sup> Blessed and High: <span class=\"ibTxt\">“[22:40] Those who have been expelled from their homes without a just cause except that they say: Our Lord is Allah”</span>. He<sup>asws</sup> said: ‘It was Revealed regarding the Rasool Allah<sup>saww</sup>, and Ali<sup>asws</sup>, and Hamza<sup>ar</sup>, and Ja’far<sup>ar</sup>, and it flowed regarding Al-Husayn<sup>asws</sup>, may Peace be upon all of them’.  "]}}, {"index": 15209, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:8:1:47:4", "text": ["14982- ابْنُ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ بُرَيْدٍ الْكُنَاسِيِّ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ (عليه السلام) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ يَوْمَ يَجْمَعُ اللَّهُ الرُّسُلَ فَيَقُولُ ما ذا أُجِبْتُمْ قالُوا لا عِلْمَ لَنا قَالَ فَقَالَ إِنَّ لِهَذَا تَأْوِيلًا يَقُولُ مَا ذَا أُجِبْتُمْ فِي أَوْصِيَائِكُمُ الَّذِينَ خَلَّفْتُمُوهُمْ عَلَى أُمَمِكُمْ قَالَ فَيَقُولُونَ لَا عِلْمَ لَنَا بِمَا فَعَلُوا مِنْ بَعْدِنَا."], "translations": {"en.hubeali": ["<a id=\"_Toc492473667\">H 14982</a> – Ibn Mahboub, from Hisham Bin Salim, from Bureyd Al-Kunasy who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked Abu Ja’far</span><sup>asws</sup> about the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[5:109] On the day when Allah will assemble the messengers, then say: What answer were you given? They shall say: We have no knowledge, surely Thou art the great Knower of the unseen things”</span>. So he<sup>asws</sup> said; ‘There is an explanation for this. He<sup>azwj</sup> will say: “What response were you<sup>as</sup> given with regards to your<sup>as</sup> successors<sup>as</sup> whom you<sup>saww</sup> left behind among your<sup>as</sup> communities?’ So they<sup>as</sup> will say: ‘We have no knowledge of what they did from after us<sup>as</sup>’. "]}}]}, "index": "al-kafi:8:1:47", "kind": "verse_list"}