{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 47"
        },
        "path": "/books/al-kafi:8:1:47",
        "titles": {
          "ar": "حَدِيثُ الَّذِي أَحْيَاهُ عِيسَى ( عليه السلام )",
          "en": "HADEETH OF THE ONE WHO WAS BROUGHT BACK TO LIFE BY ISA<sup>as</sup>"
        }
      }
    ],
    "index": 2318,
    "local_index": 47,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 48"
        },
        "path": "/books/al-kafi:8:1:48",
        "titles": {
          "ar": "حَدِيثُ إِسْلَامِ عَلِيٍّ ( عليه السلام )",
          "en": "HADEETH OF ISLAM OF ALI<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 46"
        },
        "path": "/books/al-kafi:8:1:46",
        "titles": {
          "ar": "حَدِيثُ الْفُقَهَاءِ وَ الْعُلَمَاءِ",
          "en": "HADEETH OF THE FUQAHA (JURISTS) AND THE ULAMA (SCHOLARS)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:47",
    "titles": {
      "ar": "حَدِيثُ الَّذِي أَحْيَاهُ عِيسَى ( عليه السلام )",
      "en": "HADEETH OF THE ONE WHO WAS BROUGHT BACK TO LIFE BY ISA<sup>as</sup>"
    },
    "verse_count": 4,
    "verse_start_index": 15216,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 494)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15217,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:47:1",
        "refs": {
          "Quran": [
            "/books/quran:22:25"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14979</span>- مُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ أَبِي جَمِيلَةَ عَنْ أَبَانِ بْنِ تَغْلِبَ وَ غَيْرِهِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) أَنَّهُ سُئِلَ هَلْ كَانَ عِيسَى ابْنُ مَرْيَمَ أَحْيَا أَحَداً بَعْدَ مَوْتِهِ حَتَّى كَانَ لَهُ أَكْلٌ وَ رِزْقٌ وَ مُدَّةٌ وَ وَلَدٌ فَقَالَ نَعَمْ إِنَّهُ كَانَ لَهُ صَدِيقٌ مُوَاخٍ لَهُ فِي اللَّهِ تَبَارَكَ وَ تَعَالَى وَ كَانَ عِيسَى (عليه السلام) يَمُرُّ بِهِ وَ يَنْزِلُ عَلَيْهِ",
          "وَ إِنَّ عِيسَى غَابَ عَنْهُ حِيناً ثُمَّ مَرَّ بِهِ لِيُسَلِّمَ عَلَيْهِ فَخَرَجَتْ إِلَيْهِ أُمُّهُ فَسَأَلَهَا عَنْهُ فَقَالَتْ مَاتَ يَا رَسُولَ اللَّهِ فَقَالَ أَ فَتُحِبِّينَ أَنْ تَرَاهُ قَالَتْ نَعَمْ فَقَالَ لَهَا فَإِذَا كَانَ غَداً فَآتِيكِ حَتَّى أُحْيِيَهُ لَكِ بِإِذْنِ اللَّهِ تَبَارَكَ وَ تَعَالَى",
          "فَلَمَّا كَانَ مِنَ الْغَدِ أَتَاهَا فَقَالَ لَهَا انْطَلِقِي مَعِي إِلَى قَبْرِهِ فَانْطَلَقَا حَتَّى أَتَيَا قَبْرَهُ فَوَقَفَ عَلَيْهِ عِيسَى (عليه السلام) ثُمَّ دَعَا اللَّهَ عَزَّ وَ جَلَّ فَانْفَرَجَ الْقَبْرُ وَ خَرَجَ ابْنُهَا حَيّاً فَلَمَّا رَأَتْهُ أُمُّهُ وَ رَآهَا بَكَيَا فَرَحِمَهُمَا عِيسَى (عليه السلام) فَقَالَ لَهُ عِيسَى أَ تُحِبُّ أَنْ تَبْقَى مَعَ أُمِّكَ فِي الدُّنْيَا فَقَالَ يَا نَبِيَّ اللَّهِ بِأَكْلٍ وَ رِزْقٍ وَ مُدَّةٍ أَمْ بِغَيْرِ أَكْلٍ وَ لَا رِزْقٍ وَ لَا مُدَّةٍ فَقَالَ لَهُ عِيسَى (عليه السلام) بِأَكْلٍ وَ رِزْقٍ وَ مُدَّةٍ وَ تُعَمَّرُ عِشْرِينَ سَنَةً وَ تَزَوَّجُ وَ يُولَدُ لَكَ قَالَ نَعَمْ إِذاً قَالَ فَدَفَعَهُ عِيسَى إِلَى أُمِّهِ فَعَاشَ عِشْرِينَ سَنَةً وَ تَزَوَّجَ وَ وُلِدَ لَهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473664\">H 14979</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Hassan Bin Mahboub, from Abu Jameela, from Aban Bin Taglib, who has reported the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup style=\"font-weight: normal\">asws</sup> was asked, ‘Did Isa Ibn Maryam<sup style=\"font-weight: normal\">as</sup> revive anyone after his death to the extent that he ate, received sustenance, and had a term, and children?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘Yes. He<sup style=\"font-weight: normal\">as</sup> had a friend who he<sup style=\"font-weight: normal\">as</sup> had established brotherhood with for the Sake of Allah<sup style=\"font-weight: normal\">azwj</sup> Blessed and High, and Isa<sup style=\"font-weight: normal\">as</sup> used to pass by him and visit him.",
            "And that Isa<sup style=\"font-weight: normal\">as</sup> remained absent from him for a while, then passed by his house to greet him. His mother came out to him<sup style=\"font-weight: normal\">as</sup>. So he<sup style=\"font-weight: normal\">as</sup> asked her about him. She said, ‘He died, O Messenger<sup style=\"font-weight: normal\">as</sup> of Allah<sup style=\"font-weight: normal\">azwj</sup>’. He<sup style=\"font-weight: normal\">as</sup> said: ‘Would you love to see him’. She said, ‘Yes’. He<sup style=\"font-weight: normal\">as</sup> said to her: ‘Come to me <sup style=\"font-weight: normal\">as</sup> tomorrow and I<sup style=\"font-weight: normal\">as</sup> shall revive him for you by the Permission of Allah<sup style=\"font-weight: normal\">azwj</sup> Blessed and High’. ",
            "So when it was the next day, she came over. He<sup>as</sup> said to her: ‘Come with me<sup>as</sup> to his grave’. So they went until they arrived at his grave. Isa<sup>as</sup> paused at it, and then supplicated to Allah<sup>azwj</sup>. The grave split apart and her son came out alive. So when his mother saw him, and he saw her, they wept. Isa<sup>as</sup> sympathised with them. Isa<sup>as</sup> said to him: ‘Would you like to remain alive with your mother in the world?’ He said, ‘O Prophet<sup>saww</sup> of Allah<sup>azwj</sup>, with eating and sustenance and a term, or without eating and sustenance and a term?’ So Isa<sup>as</sup> said to him: ‘With eating and sustenance and a term. And you will be living for twenty years and get married and have children’. He said, ‘Yes’. When he said that, Isa<sup>as</sup> handed him over to his mother. He thus lived for twenty years, and got married, and had children’."
          ],
          "en.sarwar": [
            "533. Ibn Mahboub, from Abu Walladin, and someone else from our companions, who have reported the following: Abu Abdullah (a.s.) regarding the Statement of Allah (azwj) Mighty and Majestic: “<a href=\"/#/books/quran:22#h25\">[22:25]</a> and whoever shall incline therein to wrong unjustly, We will make him taste of a painful chastisement”, so he (a.s.) said: ‘The one who worships other than Allah (azwj) Mighty and Majestic, or befriends other than the Guardians (a.s.) from Allah (azwj), so he has inclined to injustice and it is upon Allah (azwj) Blessed and High to make him taste of a painful chastisement”."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 494)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15218,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:47:2",
        "refs": {
          "Quran": [
            "/books/quran:22:40",
            "/books/quran:22:25"
          ]
        },
        "text": [
          "14980- ابْنُ مَحْبُوبٍ عَنْ أَبِي وَلَّادٍ وَ غَيْرُهُ مِنْ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ يُرِدْ فِيهِ بِإِلْحادٍ بِظُلْمٍ فَقَالَ مَنْ عَبَدَ فِيهِ غَيْرَ اللَّهِ عَزَّ وَ جَلَّ أَوْ تَوَلَّى فِيهِ غَيْرَ أَوْلِيَاءِ اللَّهِ فَهُوَ مُلْحِدٌ بِظُلْمٍ وَ عَلَى اللَّهِ تَبَارَكَ وَ تَعَالَى أَنْ يُذِيقَهُ مِنْ عَذَابٍ أَلِيمٍ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473665\">H 14980</a> – Ibn Mahboub, from Abu Walladin, and someone else from our companions, who have reported the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> regarding the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:22#h25\">[22:25]</a> and whoever shall incline therein to wrong unjustly, We will make him taste of a painful chastisement”</span>, so he<sup>asws</sup> said: ‘The one who worships other than Allah<sup>azwj</sup> Mighty and Majestic, or befriends other than the Guardians<sup>asws</sup> from Allah<sup>azwj</sup>, so he has inclined to injustice and it is upon Allah<sup>azwj</sup> Blessed and High to <span class=\"ibTxt\">make him taste of a painful chastisement”</span>."
          ],
          "en.sarwar": [
            "534. Ibn Mahboub, from Abu Ja’far Al-Howl, from Sallam Bin Al-Mustaneer, who has reported the following: Abu Ja’far (a.s.) regarding the Statement of Allah (azwj) Blessed and High: “<a href=\"/#/books/quran:22#h40\">[22:40]</a> Those who have been expelled from their homes without a just cause except that they say: Our Lord is Allah”. He (a.s.) said: ‘It was Revealed regarding the Rasool Allah (saww), and Ali (a.s.), and Hamza (ar), and Ja’far (ar), and it flowed regarding Al-Husayn (a.s.), may Peace be upon all of them’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول على الشهور</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 494)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15219,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:47:3",
        "refs": {
          "Quran": [
            "/books/quran:22:40",
            "/books/quran:5:109"
          ]
        },
        "text": [
          "14981- ابْنُ مَحْبُوبٍ عَنْ أَبِي جَعْفَرٍ الْأَحْوَلِ عَنْ سَلَّامِ بْنِ الْمُسْتَنِيرِ عَنْ أَبِي جَعْفَرٍ (عليه السلام) فِي قَوْلِ اللَّهِ تَبَارَكَ وَ تَعَالَى الَّذِينَ أُخْرِجُوا مِنْ دِيارِهِمْ بِغَيْرِ حَقٍّ إِلَّا أَنْ يَقُولُوا رَبُّنَا اللَّهُ قَالَ نَزَلَتْ فِي رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ عَلِيٍّ وَ حَمْزَةَ وَ جَعْفَرٍ وَ جَرَتْ فِي الْحُسَيْنِ عَلَيْهِمُ السَّلَامُ أَجْمَعِينَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473666\">H 14981</a> – Ibn Mahboub, from Abu Ja’far Al-Howl, from Sallam Bin Al-Mustaneer, who has reported the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> regarding the Statement of Allah<sup>azwj</sup> Blessed and High: <span class=\"ibTxt\">“<a href=\"/#/books/quran:22#h40\">[22:40]</a> Those who have been expelled from their homes without a just cause except that they say: Our Lord is Allah”</span>. He<sup>asws</sup> said: ‘It was Revealed regarding the Rasool Allah<sup>saww</sup>, and Ali<sup>asws</sup>, and Hamza<sup>ar</sup>, and Ja’far<sup>ar</sup>, and it flowed regarding Al-Husayn<sup>asws</sup>, may Peace be upon all of them’.  "
          ],
          "en.sarwar": [
            "535. Ibn Mahboub, from Hisham Bin Salim, from Bureyd Al-Kunasy who said: I asked Abu Ja’far (a.s.) about the Statement of Allah (azwj) Mighty and Majestic: “<a href=\"/#/books/quran:5#h109\">[5:109]</a> On the day when Allah will assemble the messengers, then say: What answer were you given? They shall say: We have no knowledge, surely Thou art the great Knower of the unseen things”. So he (a.s.) said; ‘There is an explanation for this. He (azwj) will say: “What response were you (as) given with regards to your (as) successors (as) whom you (saww) left behind among your (as) communities?’ So they (as) will say: ‘We have no knowledge of what they did from after us (as)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 496)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15220,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:47:4",
        "refs": {
          "Quran": [
            "/books/quran:17:78",
            "/books/quran:5:109"
          ]
        },
        "text": [
          "14982- ابْنُ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ بُرَيْدٍ الْكُنَاسِيِّ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ (عليه السلام) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ يَوْمَ يَجْمَعُ اللَّهُ الرُّسُلَ فَيَقُولُ ما ذا أُجِبْتُمْ قالُوا لا عِلْمَ لَنا قَالَ فَقَالَ إِنَّ لِهَذَا تَأْوِيلًا يَقُولُ مَا ذَا أُجِبْتُمْ فِي أَوْصِيَائِكُمُ الَّذِينَ خَلَّفْتُمُوهُمْ عَلَى أُمَمِكُمْ قَالَ فَيَقُولُونَ لَا عِلْمَ لَنَا بِمَا فَعَلُوا مِنْ بَعْدِنَا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473667\">H 14982</a> – Ibn Mahboub, from Hisham Bin Salim, from Bureyd Al-Kunasy who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked Abu Ja’far</span><sup>asws</sup> about the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:5#h109\">[5:109]</a> On the day when Allah will assemble the messengers, then say: What answer were you given? They shall say: We have no knowledge, surely Thou art the great Knower of the unseen things”</span>. So he<sup>asws</sup> said; ‘There is an explanation for this. He<sup>azwj</sup> will say: “What response were you<sup>as</sup> given with regards to your<sup>as</sup> successors<sup>as</sup> whom you<sup>saww</sup> left behind among your<sup>as</sup> communities?’ So they<sup>as</sup> will say: ‘We have no knowledge of what they did from after us<sup>as</sup>’. "
          ],
          "en.sarwar": [
            "536. Ibn Mahboub, from Hisham Bin Salim, from Abu Hamza, from Saeed Bin Al-Musayyab who said: I asked Ali (a.s.) Bin Al-Husayn (a.s.), ‘How old was Ali (a.s.) on the day he (a.s.) became a Muslim?’ So he (a.s.) said: ‘What? Was he (a.s.) an infidel ever? But rather, when Allah (azwj) Sent His (azwj) Messenger (saww), Ali (a.s.) was ten years old, and he (a.s.) was never an infidel on that day, and he (a.s.) had believed in Allah (azwj), and in His (azwj) Messenger (saww), and preceded all of the people to the faith by Allah (azwj) and by His (azwj) Messenger (saww) and to the Prayer by three years’. And the first Prayer that he (a.s.) Prayed with the Rasool Allah (saww) was Al-Zohr (Midday) of two cycles and that is what Allah (azwj) Blessed and High had Obligated it as upon the one who became a Muslim at Makkah – two cycles, two cycles, and the Rasool Allah (saww) had Prayed two cycles at Makkah, and Ali (a.s.) had Prayed it with him (saww) as two cycles for a period of ten years until the Rasool Allah (saww) migrated to Al-Medina, and left Ali (a.s.) behind regarding the matters which no one part from him (a.s.) could have dealt with. And the going out of the Rasool Allah (saww) from Makkah was during the first of the Rabbi-ul-Awwal, and that was the day of Thursday on the thirteenth year from the Mab’as (Declaration of Prophet-hood), and journeyed to Al-Medina over twelve nights from the Month of Rabbi Ul-Awwal with the setting of the sun. So he (saww) descended at Quba, so he (saww) Prayed Al-Zohr two cycles, and Al-Asr two cycles. Then he (saww) did not cease to stay there, awaiting Ali (a.s.). He (saww) Prayed five Prayers of two cycles, two cycles. And he (saww) stayed at (the house of) Amro Bin Awf for about ten days. They were saying to him (saww), ‘Stay with us, so we will build for you (saww) house and a Masjid’. So he (saww) said; ‘No. I (saww) am awaiting Ali (a.s.) Bin Abu Talib (a.s.), and have ordered him (a.s.) to meet me (saww), and will not settle in a house until Ali (a.s.) comes, and he (a.s.) will not be long, Allah (azwj) Willing. So Ali (a.s.) came to the Prophet (saww) at the house of Amro Bin Awf and stayed with him (saww). Then the Rasool Allah (saww), when Ali (a.s.) arrived to him (saww), transferred from Quba to the Clan of Saalim Bin Awf, and Ali (a.s.) was with him (saww), on the Day of Friday at sunrise. So they drew a boundary for him (saww) for a Masjid, and established its Qiblah (direction of Prayer). He (saww) Prayed with them the Friday Prayer of two cycles, and preached them two sermons. Then he (saww) went to Al-Medina upon the she-camel which he (saww) had come upon, and Ali (a.s.) was with him (saww), not separating from him (saww), walking with him (saww) step by step. And there was no neighbourhood from the neighbourhoods of the Helpers which Rasool Allah (saww) passed by except that they stood up for him (saww) asking him (saww) to descend to them. He (saww) would say to them; ‘Make way for the she-camel for it is under instructions (of where to go). So it went and the Rasool Allah (saww) had freed its reins until it ended up at the place which you see’, and he (a.s.) gestured by his (a.s.) hands to the door of the Masjid of the Rasool Allah (saww) by which the funeral Prayers are performed. He (a.s.) said: ‘So it paused at it and knelt, and placed itself upon the ground. So the Rasool Allah (saww) descended, and Abu Ayub welcomed him (saww) to the extent that he carried his (saww) saddle bag and made him (saww) to enter his house. And the Rasool Allah (saww) and Ali (a.s.) stayed with him until they built for him (saww), his (saww) Masjid, and built for him (saww) his (saww) house, and a house for Ali (a.s.). So they two of them (a.s.) transferred to their (a.s.) houses’. So Saeed Bin Al-Musayyab (the narrator) said to Ali (a.s.) Bin Al-Husayn (a.s.), ‘May I be sacrificed for you (a.s.), Abu Bakr was with the Rasool Allah (saww) when he (saww) arrived at Al-Medina. So when did he separate from him (saww)?’ So he (a.s.) said: ‘Abu Bakr was with him (saww) when the Rasool Allah (saww) proceeded to Quba, and he (saww) decided to wait for Ali (a.s.). So Abu Bakr said to him (saww), ‘Come with us to Al-Medina, for the people would rejoice at your (saww) arrival there and are eager to welcome you (saww). So come with us and do not stay over here waiting for Ali (a.s.), from what I can see, it would take him (a.s.) a month to come to you (a.s.)’. So the Rasool Allah (saww) said to him: ‘Never! He (a.s.) will not be long, and I (saww) will not move until my (saww) cousin (a.s.), and my (saww) brother (a.s.) for the sake of Allah (azwj) Mighty and Majestic, and the most beloved to me (saww) of my (saww) Family comes over, for he (a.s.) saved me (saww) from the Polytheists by being in my (saww) place’. He (a.s.) said; ‘So Abu Bakr was angry and was disgusted by it, and envy for Ali (a.s.) entered into him due to that, and that was the first enmity initiated from him to the Rasool Allah (saww) with regards to Ali (a.s.), and the first of his opposition to the Rasool Allah (saww). So he went until he entered Al-Medina, and left behind the Rasool Allah (saww) at Quba waiting for Ali (a.s.)’. (The narrator) said, ‘I said to Ali (a.s.) Bin Al-Husayn (a.s.), ‘So when did the Messenger (saww) get Fatima (a.s.) married to Ali (a.s.)?’ He (a.s.) said: ‘At Al-Medina, a year after the Migration, and she was in her (a.s.) ninth year’. Ali (a.s.) Bin Al-Husayn (a.s.) said: ‘And there was no birth to the Rasool Allah (saww) from Khadija (as) upon the nature of Al-Islam except for Fatima (a.s.), and Khadija (as) had passed away a year before the Migration, and Abu Talib (as) had passed away a year after her (as) passing away. So when the two of them (as) passed away, the Rasool Allah (saww) got tired of staying at Makkah, and was overcome by intense grief and sympathised with himself (saww) from the infidels of Qureysh. He (saww) informed Jibraeel (as) about that, so Allah (azwj) Revealed unto him (saww): “Go out from the town where (its) people are unjust and Migrate to Al-Medina, for today there is no helper for you (saww) at Makkah, and establish a war against the Polytheists”. So the Rasool Allah (saww) heeded that and directed himself (saww) to Al-Medina’. So I (the narrator) said to him (a.s.), ‘So when was the Salat became Obligatory upon the Muslims in the form that they are Praying today?’ He (a.s.) said: ‘At Al-Medina when the Call was made apparent, and Al-Islam was strong, and Allah (azwj) Decreed Al-Jihaad upon the Muslims, and the Rasool Allah (saww) increased in the Prayer, seven cycles – two cycles in Al-Zohr, and two cycles in Al-Asr, and one cycle in Al-Maghrib, and two cycles in Al-Isha, and accepted Al-Fajr upon what it had been Obligated in order to expedite the descent of the Angels of the day from the sky and to expedite that rising of the Angels of the night to the sky. And the Angels of the night and the Angels of the day had been testifying with the Rasool Allah (saww) for Al-Fajr Prayer, so that is the Statement of Allah (azwj): “<a href=\"/#/books/quran:17#h78\">[17:78]</a> (the recital of) the Qur’an at dawn. Lo! (the recital of) the Qur’an at dawn is witnessed”, witnessed by the Muslims and witnessed by the Angels of the day and Angels of the night’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:47",
  "kind": "verse_list"
}