{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 48"
        },
        "path": "/books/al-kafi:8:1:48",
        "titles": {
          "ar": "حَدِيثُ إِسْلَامِ عَلِيٍّ ( عليه السلام )",
          "en": "HADEETH OF ISLAM OF ALI<sup>asws</sup>"
        }
      }
    ],
    "index": 2319,
    "local_index": 48,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 49"
        },
        "path": "/books/al-kafi:8:1:49",
        "titles": {
          "ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )",
          "en": "A SERMON OF AMIR-UL-MOMINEEN<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 47"
        },
        "path": "/books/al-kafi:8:1:47",
        "titles": {
          "ar": "حَدِيثُ الَّذِي أَحْيَاهُ عِيسَى ( عليه السلام )",
          "en": "HADEETH OF THE ONE WHO WAS BROUGHT BACK TO LIFE BY ISA<sup>as</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:48",
    "titles": {
      "ar": "حَدِيثُ إِسْلَامِ عَلِيٍّ ( عليه السلام )",
      "en": "HADEETH OF ISLAM OF ALI<sup>asws</sup>"
    },
    "verse_count": 14,
    "verse_start_index": 15220,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 501)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15221,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:48:1",
        "refs": {
          "Quran": [
            "/books/quran:17:78"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14983</span>- ابْنُ مَحْبُوبٍ</span> عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي حَمْزَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَ سَأَلْتُ عَلِيَّ بْنَ الْحُسَيْنِ (عليه السلام) ابْنُ كَمْ كَانَ عَلِيُّ بْنُ أَبِي طَالِبٍ (عليه السلام) يَوْمَ أَسْلَمَ فَقَالَ أَ وَ كَانَ كَافِراً قَطُّ إِنَّمَا كَانَ لِعَلِيٍّ (عليه السلام) حَيْثُ بَعَثَ اللَّهُ عَزَّ وَ جَلَّ رَسُولَهُ (صلى الله عليه وآله) عَشْرُ سِنِينَ وَ لَمْ يَكُنْ يَوْمَئِذٍ كَافِراً وَ لَقَدْ آمَنَ بِاللَّهِ تَبَارَكَ وَ تَعَالَى وَ بِرَسُولِهِ (صلى الله عليه وآله) وَ سَبَقَ النَّاسَ كُلَّهُمْ إِلَى الْإِيمَانِ بِاللَّهِ وَ بِرَسُولِهِ (صلى الله عليه وآله) وَ إِلَى الصَّلَاةِ بِثَلَاثِ سِنِينَ ",
          "وَ كَانَتْ أَوَّلُ صَلَاةٍ صَلَّاهَا مَعَ رَسُولِ اللَّهِ (صلى الله عليه وآله) الظُّهْرَ رَكْعَتَيْنِ وَ كَذَلِكَ فَرَضَهَا اللَّهُ تَبَارَكَ وَ تَعَالَى عَلَى مَنْ أَسْلَمَ بِمَكَّةَ رَكْعَتَيْنِ رَكْعَتَيْنِ وَ كَانَ رَسُولُ اللَّهِ (صلى الله عليه وآله) يُصَلِّيهَا بِمَكَّةَ رَكْعَتَيْنِ وَ يُصَلِّيهَا عَلِيٌّ ( عليه السلام ) مَعَهُ بِمَكَّةَ رَكْعَتَيْنِ مُدَّةَ عَشْرِ سِنِينَ حَتَّى هَاجَرَ رَسُولُ اللَّهِ (صلى الله عليه وآله) إِلَى الْمَدِينَةِ وَ خَلَّفَ عَلِيّاً (عليه السلام) فِي أُمُورٍ لَمْ يَكُنْ يَقُومُ بِهَا أَحَدٌ غَيْرُهُ ",
          "وَ كَانَ خُرُوجُ رَسُولِ اللَّهِ (صلى الله عليه وآله) مِنْ مَكَّةَ فِي أَوَّلِ يَوْمٍ مِنْ رَبِيعٍ الْأَوَّلِ وَ ذَلِكَ يَوْمُ الْخَمِيسِ مِنْ سَنَةِ ثَلَاثَ عَشْرَةَ مِنَ الْمَبْعَثِ وَ قَدِمَ الْمَدِينَةَ لِاثْنَتَيْ عَشْرَةَ لَيْلَةً خَلَتْ مِنْ شَهْرِ رَبِيعٍ الْأَوَّلِ مَعَ زَوَالِ الشَّمْسِ فَنَزَلَ بِقُبَا فَصَلَّى الظُّهْرَ رَكْعَتَيْنِ وَ الْعَصْرَ رَكْعَتَيْنِ ثُمَّ لَمْ يَزَلْ مُقِيماً يَنْتَظِرُ عَلِيّاً (عليه السلام) يُصَلِّي الْخَمْسَ صَلَوَاتٍ رَكْعَتَيْنِ رَكْعَتَيْنِ ",
          "وَ كَانَ نَازِلًا عَلَى عَمْرِو بْنِ عَوْفٍ فَأَقَامَ عِنْدَهُمْ بِضْعَةَ عَشَرَ يَوْماً يَقُولُونَ لَهُ أَ تُقِيمُ عِنْدَنَا فَنَتَّخِذَ لَكَ مَنْزِلًا وَ مَسْجِداً فَيَقُولُ لَا إِنِّي أَنْتَظِرُ عَلِيَّ بْنَ أَبِي طَالِبٍ وَ قَدْ أَمَرْتُهُ أَنْ يَلْحَقَنِي وَ لَسْتُ مُسْتَوْطِناً مَنْزِلًا حَتَّى يَقْدَمَ عَلِيٌّ وَ مَا أَسْرَعَهُ إِنْ شَاءَ اللَّهُ فَقَدِمَ عَلِيٌّ (عليه السلام) وَ النَّبِيُّ (صلى الله عليه وآله) فِي بَيْتِ عَمْرِو بْنِ عَوْفٍ فَنَزَلَ مَعَهُ ",
          "ثُمَّ إِنَّ رَسُولَ اللَّهِ (صلى الله عليه وآله) لَمَّا قَدِمَ عَلَيْهِ عَلِيٌّ (عليه السلام) تَحَوَّلَ مِنْ قُبَا إِلَى بَنِي سَالِمِ بْنِ عَوْفٍ وَ عَلِيٌّ (عليه السلام) مَعَهُ يَوْمَ الْجُمُعَةِ مَعَ طُلُوعِ الشَّمْسِ فَخَطَّ لَهُمْ مَسْجِداً وَ نَصَبَ قِبْلَتَهُ فَصَلَّى بِهِمْ فِيهِ الْجُمُعَةَ رَكْعَتَيْنِ وَ خَطَبَ خُطْبَتَيْنِ ثُمَّ رَاحَ مِنْ يَوْمِهِ إِلَى الْمَدِينَةِ عَلَى نَاقَتِهِ الَّتِي كَانَ قَدِمَ عَلَيْهَا وَ عَلِيٌّ (عليه السلام) مَعَهُ لَا يُفَارِقُهُ يَمْشِي بِمَشْيِهِ وَ لَيْسَ يَمُرُّ رَسُولُ اللَّهِ (صلى الله عليه وآله) بِبَطْنٍ مِنْ بُطُونِ الْأَنْصَارِ إِلَّا قَامُوا إِلَيْهِ يَسْأَلُونَهُ أَنْ يَنْزِلَ عَلَيْهِمْ فَيَقُولُ لَهُمْ خَلُّوا سَبِيلَ النَّاقَةِ فَإِنَّهَا مَأْمُورَةٌ",
          "فَانْطَلَقَتْ بِهِ وَ رَسُولُ اللَّهِ (صلى الله عليه وآله) وَاضِعٌ لَهَا زِمَامَهَا حَتَّى انْتَهَتْ إِلَى الْمَوْضِعِ الَّذِي تَرَى وَ أَشَارَ بِيَدِهِ إِلَى بَابِ مَسْجِدِ رَسُولِ اللَّهِ (صلى الله عليه وآله) الَّذِي يُصَلَّى عِنْدَهُ بِالْجَنَائِزِ فَوَقَفَتْ عِنْدَهُ وَ بَرَكَتْ وَ وَضَعَتْ جِرَانَهَا عَلَى الْأَرْضِ فَنَزَلَ رَسُولُ اللَّهِ (صلى الله عليه وآله) وَ أَقْبَلَ أَبُو أَيُّوبَ مُبَادِراً حَتَّى احْتَمَلَ رَحْلَهُ فَأَدْخَلَهُ مَنْزِلَهُ وَ نَزَلَ رَسُولُ اللَّهِ (صلى الله عليه وآله) وَ عَلِيٌّ (عليه السلام) مَعَهُ حَتَّى بُنِيَ لَهُ مَسْجِدُهُ بُنِيَتْ لَهُ مَسَاكِنُهُ وَ مَنْزِلُ عَلِيٍّ (عليه السلام) فَتَحَوَّلَا إِلَى مَنَازِلِهِمَا ",
          "فَقَالَ سَعِيدُ بْنُ الْمُسَيَّبِ لِعَلِيِّ بْنِ الْحُسَيْنِ (عليه السلام) جُعِلْتُ فِدَاكَ كَانَ أَبُو بَكْرٍ مَعَ رَسُولِ اللَّهِ (صلى الله عليه وآله) حِينَ أَقْبَلَ إِلَى الْمَدِينَةِ فَأَيْنَ فَارَقَهُ فَقَالَ إِنَّ أَبَا بَكْرٍ لَمَّا قَدِمَ رَسُولُ اللَّهِ (صلى الله عليه وآله) إِلَى قُبَا فَنَزَلَ بِهِمْ يَنْتَظِرُ قُدُومَ عَلِيٍّ (عليه السلام) فَقَالَ لَهُ أَبُو بَكْرٍ انْهَضْ بِنَا إِلَى الْمَدِينَةِ فَإِنَّ الْقَوْمَ قَدْ فَرِحُوا بِقُدُومِكَ وَ هُمْ يَسْتَرِيثُونَ إِقْبَالَكَ إِلَيْهِمْ فَانْطَلِقْ بِنَا وَ لَا تَقُمْ هَاهُنَا تَنْتَظِرُ عَلِيّاً فَمَا أَظُنُّهُ يَقْدَمُ عَلَيْكَ إِلَى شَهْرٍ فَقَالَ لَهُ رَسُولُ اللَّهِ (صلى الله عليه وآله) كَلَّا مَا أَسْرَعَهُ وَ لَسْتُ أَرِيمُ حَتَّى يَقْدَمَ ابْنُ عَمِّي وَ أَخِي فِي اللَّهِ عَزَّ وَ جَلَّ وَ أَحَبُّ أَهْلِ بَيْتِي إِلَيَّ فَقَدْ وَقَانِي بِنَفْسِهِ مِنَ الْمُشْرِكِينَ ",
          "قَالَ فَغَضِبَ عِنْدَ ذَلِكَ أَبُو بَكْرٍ وَ اشْمَأَزَّ وَ دَاخَلَهُ مِنْ ذَلِكَ حَسَدٌ لِعَلِيٍّ (عليه السلام) وَ كَانَ ذَلِكَ أَوَّلَ عَدَاوَةٍ بَدَتْ مِنْهُ لِرَسُولِ اللَّهِ (صلى الله عليه وآله) فِي عَلِيٍّ (عليه السلام) وَ أَوَّلَ خِلَافٍ عَلَى رَسُولِ اللَّهِ (صلى الله عليه وآله) فَانْطَلَقَ حَتَّى دَخَلَ الْمَدِينَةَ وَ تَخَلَّفَ رَسُولُ اللَّهِ (صلى الله عليه وآله) بِقُبَا يَنْتَظِرُ عَلِيّاً (عليه السلام) ",
          "قَالَ فَقُلْتُ لِعَلِيِّ بْنِ الْحُسَيْنِ (عليه السلام) فَمَتَى زَوَّجَ رَسُولُ اللَّهِ (صلى الله عليه وآله) فَاطِمَةَ مِنْ عَلِيٍّ (عليه السلام) فَقَالَ بِالْمَدِينَةِ بَعْدَ الْهِجْرَةِ بِسَنَةٍ وَ كَانَ لَهَا يَوْمَئِذٍ تِسْعُ سِنِينَ قَالَ عَلِيُّ بْنُ الْحُسَيْنِ (عليه السلام) وَ لَمْ يُولَدْ لِرَسُولِ اللَّهِ (صلى الله عليه وآله) مِنْ خَدِيجَةَ (عليها السلام) عَلَى فِطْرَةِ الْإِسْلَامِ إِلَّا فَاطِمَةُ (عليها السلام) وَ قَدْ كَانَتْ خَدِيجَةُ مَاتَتْ قَبْلَ الْهِجْرَةِ بِسَنَةٍ وَ مَاتَ أَبُو طَالِبٍ بَعْدَ مَوْتِ خَدِيجَةَ بِسَنَةٍ ",
          "فَلَمَّا فَقَدَهُمَا رَسُولُ اللَّهِ (صلى الله عليه وآله) سَئِمَ الْمُقَامَ بِمَكَّةَ وَ دَخَلَهُ حُزْنٌ شَدِيدٌ وَ أَشْفَقَ عَلَى نَفْسِهِ مِنْ كُفَّارِ قُرَيْشٍ فَشَكَا إِلَى جَبْرَئِيلَ (عليه السلام) ذَلِكَ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ اخْرُجْ مِنَ الْقَرْيَةِ الظَّالِمِ أَهْلُهَا وَ هَاجِرْ إِلَى الْمَدِينَةِ فَلَيْسَ لَكَ الْيَوْمَ بِمَكَّةَ نَاصِرٌ وَ انْصِبْ لِلْمُشْرِكِينَ حَرْباً فَعِنْدَ ذَلِكَ تَوَجَّهَ رَسُولُ اللَّهِ (صلى الله عليه وآله) إِلَى الْمَدِينَةِ ",
          "فَقُلْتُ لَهُ فَمَتَى فُرِضَتِ الصَّلَاةُ عَلَى الْمُسْلِمِينَ عَلَى مَا هُمْ عَلَيْهِ الْيَوْمَ فَقَالَ بِالْمَدِينَةِ حِينَ ظَهَرَتِ الدَّعْوَةُ وَ قَوِيَ الْإِسْلَامُ وَ كَتَبَ اللَّهُ عَزَّ وَ جَلَّ عَلَى الْمُسْلِمِينَ الْجِهَادَ وَ زَادَ رَسُولُ اللَّهِ (صلى الله عليه وآله) فِي الصَّلَاةِ سَبْعَ رَكَعَاتٍ فِي الظُّهْرِ رَكْعَتَيْنِ وَ فِي الْعَصْرِ رَكْعَتَيْنِ وَ فِي الْمَغْرِبِ رَكْعَةً وَ فِي الْعِشَاءِ الْآخِرَةِ رَكْعَتَيْنِ وَ أَقَرَّ الْفَجْرَ عَلَى مَا فُرِضَتْ لِتَعْجِيلِ نُزُولِ مَلَائِكَةِ النَّهَارِ مِنَ السَّمَاءِ وَ لِتَعْجِيلِ عُرُوجِ مَلَائِكَةِ اللَّيْلِ إِلَى السَّمَاءِ وَ كَانَ مَلَائِكَةُ اللَّيْلِ وَ مَلَائِكَةُ النَّهَارِ يَشْهَدُونَ مَعَ رَسُولِ اللَّهِ (صلى الله عليه وآله) صَلَاةَ الْفَجْرِ فَلِذَلِكَ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ قُرْآنَ الْفَجْرِ إِنَّ قُرْآنَ الْفَجْرِ كانَ مَشْهُوداً يَشْهَدُهُ الْمُسْلِمُونَ وَ يَشْهَدُهُ مَلَائِكَةُ النَّهَارِ وَ مَلَائِكَةُ اللَّيْلِ. "
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473669\">H 14983</a> – Ibn Mahboub, from Hisham Bin Salim, from Abu Hamza, from Saeed Bin Al-Musayyab who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> asked Ali</span><sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, ‘How old was Ali<sup>asws</sup> on the day he<sup>asws</sup> became a Muslim?’ So he<sup>asws</sup> said: ‘What? Was he<sup>asws</sup> an infidel ever? But rather, when Allah<sup>azwj</sup> Sent His<sup>azwj</sup> Messenger<sup>saww</sup>, Ali<sup>asws</sup> was ten years old, and he<sup>asws</sup> was never an infidel on that day, and he<sup>asws</sup> had believed in Allah<sup>azwj</sup>, and in His<sup>azwj</sup> Messenger<sup>saww</sup>, and preceded all of the people to the faith by Allah<sup>azwj</sup> and by His<sup>azwj</sup> Messenger<sup>saww</sup> and to the Prayer by three years’. ",
            "And the first Prayer that he<sup>asws</sup> Prayed with the Rasool Allah<sup>saww</sup> was <span class=\"iTxt\">Al-Zohr</span> (Midday) of two cycles and that is what Allah<sup>azwj</sup> Blessed and High had Obligated it as upon the one who became a Muslim at Makkah – two cycles, two cycles, and the Rasool Allah<sup>saww</sup> had Prayed two cycles at Makkah, and Ali<sup>asws</sup> had Prayed it with him<sup>saww</sup> as two cycles for a period of ten years until the Rasool Allah<sup>saww</sup> migrated to Al-Medina, and left Ali<sup>asws</sup> behind regarding the matters which no one part from him<sup>asws</sup> could have dealt with.",
            "And the going out of the Rasool Allah<sup>saww</sup> from Makkah was during the first of the Rabbi-ul-Awwal, and that was the day of Thursday on the thirteenth year from the <span class=\"iTxt\">Mab’as</span> (Declaration of Prophet-hood), and journeyed to Al-Medina over twelve nights from the Month of Rabbi Ul-Awwal with the setting of the sun. So he<sup>saww</sup> descended at Quba, so he<sup>saww</sup> Prayed <span class=\"iTxt\">Al-Zohr</span> two cycles, and <span class=\"iTxt\">Al-Asr</span> two cycles. Then he<sup>saww</sup> did not cease to stay there, awaiting Ali<sup>asws</sup>. He<sup>saww</sup> Prayed five Prayers of two cycles, two cycles.",
            "And he<sup>saww</sup> stayed at (the house of) Amro Bin Awf for about ten days. They were saying to him<sup>saww</sup>, ‘Stay with us, so we will build for you<sup>saww</sup> house and a Masjid’. So he<sup>saww</sup> said; ‘No. I<sup>saww</sup> am awaiting Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, and have ordered him<sup>asws</sup> to meet me<sup>saww</sup>, and will not settle in a house until Ali<sup>asws</sup> comes, and he<sup>asws</sup> will not be long, Allah<sup>azwj</sup> Willing. So Ali<sup>asws</sup> came to the Prophet<sup>saww</sup> at the house of Amro Bin Awf and stayed with him<sup>saww</sup>.",
            "Then the Rasool Allah<sup>saww</sup>, when Ali<sup>asws</sup> arrived to him<sup>saww</sup>, transferred from Quba to the Clan of Saalim Bin Awf, and Ali<sup>asws</sup> was with him<sup>saww</sup>, on the Day of Friday at sunrise. So they drew a boundary for him<sup>saww</sup> for a Masjid, and established its Qiblah (direction of Prayer). He<sup>saww</sup> Prayed with them the Friday Prayer of two cycles, and preached them two sermons. Then he<sup>saww</sup> went to Al-Medina upon the she-camel which he<sup>saww</sup> had come upon, and Ali<sup>asws</sup> was with him<sup>saww</sup>, not separating from him<sup>saww</sup>, walking with him<sup>saww</sup> step by step. And there was no neighbourhood from the neighbourhoods of the Helpers which Rasool Allah<sup>saww</sup> passed by except that they stood up for him<sup>saww</sup> asking him<sup>saww</sup> to descend to them. He<sup>saww</sup> would say to them; ‘Make way for the she-camel for it is under instructions (of where to go).",
            "So it went and the Rasool Allah<sup>saww</sup> had freed its reins until it ended up at the place which you see’, and he<sup>asws</sup> gestured by his<sup>asws</sup> hands to the door of the Masjid of the Rasool Allah<sup>saww</sup> by which the funeral Prayers are performed. He<sup>asws</sup> said: ‘So it paused at it and knelt, and placed itself upon the ground. So the Rasool Allah<sup>saww</sup> descended, and Abu Ayub welcomed him<sup>saww</sup> to the extent that he carried his<sup>saww</sup> saddle bag and made him<sup>saww</sup> to enter his house. And the Rasool Allah<sup>saww</sup> and Ali<sup>asws</sup> stayed with him until they built for him<sup>saww</sup>, his<sup>saww</sup> Masjid, and built for him<sup>saww</sup> his<sup>saww</sup> house, and a house for Ali<sup>asws</sup>. So they two of them<sup>asws</sup> transferred to their<sup>asws</sup> houses’.",
            "So Saeed Bin Al-Musayyab (the narrator) said to Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>, Abu Bakr was with the Rasool Allah<sup>saww</sup> when he<sup>saww</sup> arrived at Al-Medina. So when did he separate from him<sup>saww</sup>?’ So he<sup>asws</sup> said: ‘Abu Bakr was with him<sup>saww</sup> when the Rasool Allah<sup>saww</sup> proceeded to Quba, and he<sup>saww</sup> decided to wait for Ali<sup>asws</sup>. So Abu Bakr said to him<sup>saww</sup>, ‘Come with us to Al-Medina, for the people would rejoice at your<sup>saww</sup> arrival there and are eager to welcome you<sup>saww</sup>. So come with us and do not stay over here waiting for Ali<sup>asws</sup>, from what I can see, it would take him<sup>asws</sup> a month to come to you<sup>asws</sup>’. So the Rasool Allah<sup>saww</sup> said to him: ‘Never! He<sup>asws</sup> will not be long, and I<sup>saww</sup> will not move until my<sup>saww</sup> cousin<sup>asws</sup>, and my<sup>saww</sup> brother<sup>asws</sup> for the sake of Allah<sup>azwj</sup> Mighty and Majestic, and the most beloved to me<sup>saww</sup> of my<sup>saww</sup> Family comes over, for he<sup>asws</sup> saved me<sup>saww</sup> from the Polytheists by being in my<sup>saww</sup> place’. ",
            "He<sup>asws</sup> said; ‘So Abu Bakr was angry and was disgusted by it, and envy for Ali<sup>asws</sup> entered into him due to that, and that was the first enmity initiated from him to the Rasool Allah<sup>saww</sup> with regards to Ali<sup>asws</sup>, and the first of his opposition to the Rasool Allah<sup>saww</sup>. So he went until he entered Al-Medina, and left behind the Rasool Allah<sup>saww</sup> at Quba waiting for Ali<sup>asws</sup>’.",
            "(The narrator) said, ‘I said to Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, ‘So when did the Messenger<sup>saww</sup> get Fatima<sup>asws</sup> married to Ali<sup>asws</sup>?’ He<sup>asws</sup> said: ‘At Al-Medina, a year after the Migration, and she was in her<sup>asws</sup> ninth year’. Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said: ‘And there was no birth to the Rasool Allah<sup>saww</sup> from Khadija<sup>as</sup> upon the nature of Al-Islam except for Fatima<sup>asws</sup>, and Khadija<sup>as</sup> had passed away a year before the Migration, and Abu Talib<sup>as</sup> had passed away a year after her<sup>as</sup> passing away.",
            "So when the two of them<sup>as</sup> passed away, the Rasool Allah<sup>saww</sup> got tired of staying at Makkah, and was overcome by intense grief and sympathised with himself<sup>saww</sup> from the infidels of Qureysh. He<sup>saww</sup> informed Jibraeel<sup>as</sup> about that, so Allah<sup>azwj</sup> Revealed unto him<sup>saww</sup>: “Go out from the town where (its) people are unjust and Migrate to Al-Medina, for today there is no helper for you<sup>saww</sup> at Makkah, and establish a war against the Polytheists”. So the Rasool Allah<sup>saww</sup> heeded that and directed himself<sup>saww</sup> to Al-Medina’.",
            "So I (the narrator) said to him<sup>asws</sup>, ‘So when was the Salat became Obligatory upon the Muslims in the form that they are Praying today?’ He<sup>asws</sup> said: ‘At Al-Medina when the Call was made apparent, and Al-Islam was strong, and Allah<sup>azwj</sup> Decreed Al-Jihaad upon the Muslims, and the Rasool Allah<sup>saww</sup> increased in the Prayer, seven cycles – two cycles in <span class=\"iTxt\">Al-Zohr</span>, and two cycles in <span class=\"iTxt\">Al-Asr</span>, and one cycle in <span class=\"iTxt\">Al-Maghrib</span>, and two cycles in <span class=\"iTxt\">Al-Isha</span>, and accepted <span class=\"iTxt\">Al-Fajr</span> upon what it had been Obligated in order to expedite the descent of the Angels of the day from the sky and to expedite that rising of the Angels of the night to the sky. And the Angels of the night and the Angels of the day had been testifying with the Rasool Allah<sup>saww</sup> for Al-Fajr Prayer, so that is the Statement of Allah<sup>azwj</sup>: <span class=\"ibTxt\">“<a href=\"/#/books/quran:17#h78\">[17:78]</a> (the recital of) the Qur'an at dawn. Lo! (the recital of) the Qur'an at dawn is witnessed”</span>, witnessed by the Muslims and witnessed by the Angels of the day and Angels of the night’."
          ],
          "en.sarwar": [
            "537. Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, who has narrated the following: Abu Abdullah (a.s.) has said: ‘How easy it is to make the people to be happy with you. Just restrain your tongues from (speaking against) them’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 502)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15222,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:48:2",
        "text": [
          "14984- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ مَا أَيْسَرَ مَا رَضِيَ بِهِ النَّاسُ عَنْكُمْ كُفُّوا أَلْسِنَتَكُمْ عَنْهُمْ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473670\">H 14984</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘How easy it is to make the people to be happy with you. Just restrain your tongues from (speaking against) them’."
          ],
          "en.sarwar": [
            "538. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa and Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbar, together from Ali Bin hadeed, from Jameel Bin Darraaj, from Zurara who said: Abu Ja’far (a.s.) was in the Sacred Masjid. So there was a mention of the Clan of Umayya and their government. Some of his (a.s.) companions said to him (a.s.), ‘We hope that you (a.s.) will become their master and that Allah (azwj) will Display this Command upon your (a.s.) hands’. So he (a.s.) said: ‘I (a.s.) am not their master, nor am I (a.s.) happy to be their master, for their companions are the sons of adultery. Allah (azwj) never Created, since the creation of the Heavens and the earth, years nor days shorter than their years and their days. Allah (azwj) Ordered the Angels in who hands is the orbit, to rotate it like a scroll’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 502)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15223,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:48:3",
        "text": [
          "14985- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَ أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ جَمِيعاً عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ زُرَارَةَ قَالَ كَانَ أَبُو جَعْفَرٍ (عليه السلام) فِي الْمَسْجِدِ الْحَرَامِ فَذَكَرَ بَنِي أُمَيَّةَ وَ دَوْلَتَهُمْ فَقَالَ لَهُ بَعْضُ أَصْحَابِهِ إِنَّمَا نَرْجُو أَنْ تَكُونَ صَاحِبَهُمْ وَ أَنْ يُظْهِرَ اللَّهُ عَزَّ وَ جَلَّ هَذَا الْأَمْرَ عَلَى يَدَيْكَ فَقَالَ مَا أَنَا بِصَاحِبِهِمْ وَ لَا يَسُرُّنِي أَنْ أَكُونَ صَاحِبَهُمْ إِنَّ أَصْحَابَهُمْ أَوْلَادُ الزِّنَا إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى لَمْ يَخْلُقْ مُنْذُ خَلَقَ السَّمَاوَاتِ وَ الْأَرْضَ سِنِينَ وَ لَا أَيَّاماً أَقْصَرَ مِنْ سِنِينِهِمْ وَ أَيَّامِهِمْ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَأْمُرُ الْمَلَكَ الَّذِي فِي يَدِهِ الْفَلَكُ فَيَطْوِيهِ طَيّاً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473671\">H 14985</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa and Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbar, together from Ali Bin hadeed, from Jameel Bin Darraaj, from Zurara who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> was in the Sacred Masjid. So there was a mention of the Clan of Umayya and their government. Some of his<sup>asws</sup> companions said to him<sup>asws</sup>, ‘We hope that you<sup>asws</sup> will become their master and that Allah<sup>azwj</sup> will Display this Command upon your<sup>asws</sup> hands’. So he<sup>asws</sup> said: ‘I<sup>asws</sup> am not their master, nor am I<sup>asws</sup> happy to be their master, for their companions are the sons of adultery. Allah<sup>azwj</sup> never Created, since the creation of the Heavens and the earth, years nor days shorter than their years and their days. Allah<sup>azwj</sup> Ordered the Angels in who hands is the orbit, to rotate it like a scroll’. "
          ],
          "en.sarwar": [
            "539. Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammaad Bin Usman, who has reported: Abu Abdullah (a.s.) has said: ‘The sons of Al-Mardaas (Al-Abbas) – the one who associates with them, they turn him to be an unbeliever, and the one who distances himself from them, they impoverish him, and the one antagonises them, they kill him, and the one who fortifies himself from them they lower him, and the one flees from them, they are wary of him, until their government comes to an end’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 502)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15224,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:48:4",
        "text": [
          "14986- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ وُلْدُ الْمِرْدَاسِ مَنْ تَقَرَّبَ مِنْهُمْ أَكْفَرُوهُ وَ مَنْ تَبَاعَدَ مِنْهُمْ أَفْقَرُوهُ وَ مَنْ نَاوَاهُمْ قَتَلُوهُ وَ مَنْ تَحَصَّنَ مِنْهُمْ أَنْزَلُوهُ وَ مَنْ هَرَبَ مِنْهُمْ أَدْرَكُوهُ حَتَّى تَنْقَضِيَ دَوْلَتُهُمْ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473672\">H 14986</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammaad Bin Usman, who has reported:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘The sons of Al-Mardaas (Al-Abbas) – the one who associates with them, they turn him to be an unbeliever, and the one who distances himself from them, they impoverish him, and the one antagonises them, they kill him, and the one who fortifies himself from them they lower him, and the one flees from them, they are wary of him, until their government comes to an end’."
          ],
          "en.sarwar": [
            "540. Ali Bin Ibrahim, from his father, and Ahmad Bin Muhammad Al-Kufy, from Ali Bin Amro Bin Ayman together from Muhassan Bin Ahmad Bin Muaz, from Aban Bin Usman, from Basheer Al-Nabaal, who has reported: Abu Abdullah (a.s.) has said: ‘Once when the Rasool Allah (saww) was sitting a woman came, and held her hand and helped her to sit down. And then said, ‘ She is a daughter of a Prophet (as) whose people had neglected him (as). Khalid Bin Sinan called them, but they refused to believe. There used to be a fire called the fire of Al-Hadsaan which used to engulf them every year. So it used to devour some of them and it used to emerge during a specific time. So he said to them, ‘If I were to turn it back from you, will you believe?’ They said, ‘Yes’. He (a.s.) said: ‘So it came, and he met it by his clothes and repulsed it. Then he followed it until it entered its cave, and he entered with it, and the people seated themselves at the entrance of the cave, and they were looking out for him and it looked as if he would never come out of it. He came out and he was saying, ‘This, this, and all this is from that. The son, of Ab’as thought, ‘I will not go out whilst my forehead is perspiring’. Then said, ‘Do you believe in me?’ They said, ‘No’. He said, ‘I will die on such a such a day, so when I am dead, bury me. There will come here donkeys among which will be a donkey with its tail cut off until it stands at my grave. So bring me out of my grave and ask me whatsoever you like’. So when he died, they buried him, and on that day the donkeys came and gathered, and they all came intending to exhume him. They said, ‘You all did not believe in him during his lifetime, so how will you now believe in him after his death? And if you were to exhume him it will be damnation for you, so leave him alone’. So they left him’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> متلف فيه</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 504)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15225,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:48:5",
        "text": [
          "14987- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ أَحْمَدُ بْنُ مُحَمَّدٍ الْكُوفِيُّ عَنْ عَلِيِّ بْنِ عَمْرِو بْنِ أَيْمَنَ جَمِيعاً عَنْ مُحَسِّنِ بْنِ أَحْمَدَ بْنِ مُعَاذٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ بَشِيرٍ النَّبَّالِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ بَيْنَا رَسُولُ اللَّهِ (صلى الله عليه وآله) جَالِساً إِذْ جَاءَتْهُ امْرَأَةٌ فَرَحَّبَ بِهَا وَ أَخَذَ بِيَدِهَا وَ أَقْعَدَهَا ثُمَّ قَالَ ابْنَةُ نَبِيٍّ ضَيَّعَهُ قَوْمُهُ خَالِدِ بْنِ سِنَانٍ دَعَاهُمْ فَأَبَوْا أَنْ يُؤْمِنُوا ",
          "وَ كَانَتْ نَارٌ يُقَالُ لَهَا نَارُ الْحَدَثَانِ تَأْتِيهِمْ كُلَّ سَنَةٍ فَتَأْكُلُ بَعْضَهُمْ وَ كَانَتْ تَخْرُجُ فِي وَقْتٍ مَعْلُومٍ فَقَالَ لَهُمْ إِنْ رَدَدْتُهَا عَنْكُمْ تُؤْمِنُونَ قَالُوا نَعَمْ قَالَ فَجَاءَتْ فَاسْتَقْبَلَهَا بِثَوْبِهِ فَرَدَّهَا ثُمَّ تَبِعَهَا حَتَّى دَخَلَتْ كَهْفَهَا وَ دَخَلَ مَعَهَا وَ جَلَسُوا عَلَى بَابِ الْكَهْفِ وَ هُمْ يَرَوْنَ أَلَّا يَخْرُجَ أَبَداً فَخَرَجَ وَ هُوَ يَقُولُ هَذَا هَذَا وَ كُلُّ هَذَا مِنْ ذَا زَعَمَتْ بَنُو عَبْسٍ أَنِّي لَا أَخْرُجُ وَ جَبِينِي يَنْدَى ",
          "ثُمَّ قَالَ تُؤْمِنُونَ بِي قَالُوا لَا قَالَ فَإِنِّي مَيِّتٌ يَوْمَ كَذَا وَ كَذَا فَإِذَا أَنَا مِتُّ فَادْفِنُونِي فَإِنَّهَا سَتَجِي‏ءُ عَانَةٌ مِنْ حُمُرٍ يَقْدُمُهَا عَيْرٌ أَبْتَرُ حَتَّى يَقِفَ عَلَى قَبْرِي فَانْبُشُونِي وَ سَلُونِي عَمَّا شِئْتُمْ فَلَمَّا مَاتَ دَفَنُوهُ وَ كَانَ ذَلِكَ الْيَوْمُ إِذْ جَاءَتِ الْعَانَةُ اجْتَمَعُوا وَ جَاءُوا يُرِيدُونَ نَبْشَهُ فَقَالُوا مَا آمَنْتُمْ بِهِ فِي حَيَاتِهِ فَكَيْفَ تُؤْمِنُونَ بِهِ بَعْدَ مَوْتِهِ وَ لَئِنْ نَبَشْتُمُوهُ لَيَكُونَنَّ سُبَّةً عَلَيْكُمْ فَاتْرُكُوهُ فَتَرَكُوهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473673\">H 14987</a> – Ali Bin Ibrahim, from his father, and Ahmad Bin Muhammad Al-Kufy, from Ali Bin Amro Bin Ayman together from Muhassan Bin Ahmad Bin Muaz, from Aban Bin Usman, from Basheer Al-Nabaal, who has reported:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘Once when the Rasool Allah<sup>saww</sup> was sitting a woman came, and held her hand and helped her to sit down. And then said, ‘ She is a daughter of a Prophet<sup>as</sup> whose people had neglected him<sup>as</sup>. Khalid Bin Sinan called them, but they refused to believe. ",
            "There used to be a fire called the fire of Al-Hadsaan which used to engulf them every year. So it used to devour some of them and it used to emerge during a specific time. So he said to them, ‘If I were to turn it back from you, will you believe?’ They said, ‘Yes’. He<sup>asws</sup> said: ‘So it came, and he met it by his clothes and repulsed it. Then he followed it until it entered its cave, and he entered with it, and the people seated themselves at the entrance of the cave, and they were looking out for him and it looked as if he would never come out of it. He came out and he was saying, ‘This, this, and all this is from that. The son, of Ab’as thought, ‘I will not go out whilst my forehead is perspiring’. ",
            "Then said, ‘Do you believe in me?’ They said, ‘No’. He said, ‘I will die on such a such a day, so when I am dead, bury me. There will come here donkeys among which will be a donkey with its tail cut off until it stands at my grave. So bring me out of my grave and ask me whatsoever you like’. So when he died, they buried him, and on that day the donkeys came and gathered, and they all came intending to exhume him. They said, ‘You all did not believe in him during his lifetime, so how will you now believe in him after his death? And if you were to exhume him it will be damnation for you, so leave him alone’. So they left him’."
          ],
          "en.sarwar": [
            "541. Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Ibrahim Bin Amro Al-Yamani, from Suleym Bin Qays Al-Hilali who said: I heard Salman Al-Farsy (ar) saying: ‘When the Rasool Allah (saww) passed away, and the people did what they did, and Abu Bakr and Umar, and Abu Ubeyda Bin Al-Jarrah disputed with the Helpers, they disputed with them by the ‘بِحُجَّةِ’ rights of Ali (a.s.). They said, ‘O group of Helpers! Qureysh are more deserving of the Command than you are because the Rasool Allah (saww) is from Qureysh and the Emigrant are from them. Allah (azwj) the High has Begun by them in His (azwj) Book and has Preferred them, and the Rasool Allah (saww) has said that the Imams (a.s.) are going to be from Qureysh’. Salman (ar) said. ‘So I (ar) came to Ali (a.s.) and he (a.s.) was washing (the body of) the Rasool Allah (saww). I informed him of what the people had done and I said, ‘At this time, Abu Bakr is upon the Pulpit of the Rasool Allah (saww), and by Allah (azwj), they are not happy to pledge their allegiances to him with one hand, they are pledging their allegiances by both, their right hands and their left’. So he (a.s.) said to me; ‘O Salman (ar)! Do you know the one who pledged his allegiance to him upon the Pulpit of the Rasool Allah (saww)?’ I (ar) said, ‘I (ar) do not know except that I (ar) saw in the shadow of the Clan of Sa’ada where the Helpers were disputing, and the one who was the first to pledged his allegiance to him was Basheer Bin Sa’ad, and Abu Ubeyda Bin Al-Jarrah, then Umar, then Saalim’. He (a.s.) said; ‘I (a.s.) did not ask you (ar) about this, but do you (ar) know the first one who pledged his allegiance when he ascended upon the Pulpit of the Rasool Allah (saww)?’ I (ar) said, ‘No, but I (ar) saw an old man leaning upon his walking stick, with a mark of prostration between his eyes due to the intensity of Al-Tashmir (prostrations) climb up to him and he was weeping and saying, ‘Praise be to Allah (azwj) Who did not Cause me to die from the world until I saw you in this place. Extend your hand’. So he extended his hand, and he pledged his allegiance to him. Then he descended and went out from the Masjid’. So Ali (a.s.) said; ‘Do you know who he was?’ I said, ‘No, but his speech had displeased me, as if he was gloating at the passing away of the Prophet (saww)’. So he (a.s.) said; ‘That was Iblees (la), may Allah (azwj) Curse him (la). The Rasool Allah (saww) informed me (a.s.) that Iblees (la) and the chiefs of his (la) companions witnessed the Messenger (saww) establishing me (a.s.) to the people at Ghadeer Khumm by the Command of Allah (azwj), so he (saww) told them that I (a.s.) was higher to them than their own selves and commanded them that those who were present should make it reach to the absentees. So the devils and the castaways companions of his (la) turned towards Iblees (la) and said, ‘This community is a Blessed community and is infallible, and there is neither for you (la) nor for us (la) a way against them, for they have come to know their Imam (a.s.), and their shelter after their Prophet (saww). So Iblees (la) , may Allah (azwj) Curse him (la) went away bleak and in grief. And the Messenger (saww) informed me (a.s.) that when he (saww) passes away, the people would be pledging their allegiances to Abu Bakr in the shade of the Clan of Sa’ada after their quarrelling, then they would be coming to the Masjid, so the first one who would be pledging his allegiance upon my (saww) Pulpit would be Iblees (la) may Allah (azwj) Curse him (la) in the image of an old man with mark of prostration, saying such and such. Then he (la) will go out and gather his (la) Satans and devils and excitedly say to them, ‘All of you (la) thought that there was no way for me (la) against them, so how do you (la) see what I (la) have done with them, to the extent that they had left the Command of Allah (azwj) Mighty and Majestic, and being obedient to Him (azwj), and what the Rasool Allah (saww) has commanded them for’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 506)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15226,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:48:6",
        "refs": {
          "Quran": [
            "/books/quran:34:20"
          ]
        },
        "text": [
          "14988- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ الْيَمَانِيِّ عَنْ سُلَيْمِ بْنِ قَيْسٍ الْهِلَالِيِّ قَالَ سَمِعْتُ سَلْمَانَ الْفَارِسِيَّ رَضِيَ اللَّهُ عَنْهُ يَقُولُ لَمَّا قُبِضَ رَسُولُ اللَّهِ (صلى الله عليه وآله) وَ صَنَعَ النَّاسُ مَا صَنَعُوا وَ خَاصَمَ أَبُو بَكْرٍ وَ عُمَرُ وَ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ الْأَنْصَارَ فَخَصَمُوهُمْ بِحُجَّةِ عَلِيٍّ (عليه السلام) قَالُوا يَا مَعْشَرَ الْأَنْصَارِ قُرَيْشٌ أَحَقُّ بِالْأَمْرِ مِنْكُمْ لِأَنَّ رَسُولَ اللَّهِ (صلى الله عليه وآله) مِنْ قُرَيْشٍ وَ الْمُهَاجِرِينَ مِنْهُمْ إِنَّ اللَّهَ تَعَالَى بَدَأَ بِهِمْ فِي كِتَابِهِ وَ فَضَّلَهُمْ وَ قَدْ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْأَئِمَّةُ مِنْ قُرَيْشٍ",
          "قَالَ سَلْمَانُ رَضِيَ اللَّهُ عَنْهُ فَأَتَيْتُ عَلِيّاً (عليه السلام) وَ هُوَ يُغَسِّلُ رَسُولَ اللَّهِ (صلى الله عليه وآله) فَأَخْبَرْتُهُ بِمَا صَنَعَ النَّاسُ وَ قُلْتُ إِنَّ أَبَا بَكْرٍ السَّاعَةَ عَلَى مِنْبَرِ رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ اللَّهِ مَا يَرْضَى أَنْ يُبَايِعُوهُ بِيَدٍ وَاحِدَةٍ إِنَّهُمْ لَيُبَايِعُونَهُ بِيَدَيْهِ جَمِيعاً بِيَمِينِهِ وَ شِمَالِهِ فَقَالَ لِي يَا سَلْمَانُ هَلْ تَدْرِي مَنْ أَوَّلُ مَنْ بَايَعَهُ عَلَى مِنْبَرِ رَسُولِ اللَّهِ (صلى الله عليه وآله) قُلْتُ لَا أَدْرِي إِلَّا أَنِّي رَأَيْتُ فِي ظُلَّةِ بَنِي سَاعِدَةَ حِينَ خَصَمَتِ الْأَنْصَارُ وَ كَانَ أَوَّلَ مَنْ بَايَعَهُ بَشِيرُ بْنُ سَعْدٍ وَ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ ثُمَّ عُمَرُ ثُمَّ سَالِمٌ",
          "قَالَ لَسْتُ أَسْأَلُكَ عَنْ هَذَا وَ لَكِنْ تَدْرِي أَوَّلَ مَنْ بَايَعَهُ حِينَ صَعِدَ عَلَى مِنْبَرِ رَسُولِ اللَّهِ (صلى الله عليه وآله) قُلْتُ لَا وَ لَكِنِّي رَأَيْتُ شَيْخاً كَبِيراً مُتَوَكِّئاً عَلَى عَصَاهُ بَيْنَ عَيْنَيْهِ سَجَّادَةٌ شَدِيدُ التَّشْمِيرِ صَعِدَ إِلَيْهِ أَوَّلَ مَنْ صَعِدَ وَ هُوَ يَبْكِي وَ يَقُولُ الْحَمْدُ لِلَّهِ الَّذِي لَمْ يُمِتْنِي مِنَ الدُّنْيَا حَتَّى رَأَيْتُكَ فِي هَذَا الْمَكَانِ ابْسُطْ يَدَكَ فَبَسَطَ يَدَهُ فَبَايَعَهُ ثُمَّ نَزَلَ فَخَرَجَ مِنَ الْمَسْجِدِ",
          "فَقَالَ عَلِيٌّ (عليه السلام) هَلْ تَدْرِي مَنْ هُوَ قُلْتُ لَا وَ لَقَدْ سَاءَتْنِي مَقَالَتُهُ كَأَنَّهُ شَامِتٌ بِمَوْتِ النَّبِيِّ (صلى الله عليه وآله) فَقَالَ ذَاكَ إِبْلِيسُ لَعَنَهُ اللَّهُ أَخْبَرَنِي رَسُولُ اللَّهِ (صلى الله عليه وآله) أَنَّ إِبْلِيسَ وَ رُؤَسَاءَ أَصْحَابِهِ شَهِدُوا نَصْبَ رَسُولِ اللَّهِ (صلى الله عليه وآله) إِيَّايَ لِلنَّاسِ بِغَدِيرِ خُمٍّ بِأَمْرِ اللَّهِ عَزَّ وَ جَلَّ فَأَخْبَرَهُمْ أَنِّي أَوْلَى بِهِمْ مِنْ أَنْفُسِهِمْ وَ أَمَرَهُمْ أَنْ يُبَلِّغَ الشَّاهِدُ الْغَائِبَ",
          "فَأَقْبَلَ إِلَى إِبْلِيسَ أَبَالِسَتُهُ وَ مَرَدَةُ أَصْحَابِهِ فَقَالُوا إِنَّ هَذِهِ أُمَّةٌ مَرْحُومَةٌ وَ مَعْصُومَةٌ وَ مَا لَكَ وَ لَا لَنَا عَلَيْهِمْ سَبِيلٌ قَدْ أُعْلِمُوا إِمَامَهُمْ وَ مَفْزَعَهُمْ بَعْدَ نَبِيِّهِمْ فَانْطَلَقَ إِبْلِيسُ لَعَنَهُ اللَّهُ كَئِيباً حَزِيناً",
          "وَ أَخْبَرَنِي رَسُولُ اللَّهِ (صلى الله عليه وآله) أَنَّهُ لَوْ قُبِضَ أَنَّ النَّاسَ يُبَايِعُونَ أَبَا بَكْرٍ فِي ظُلَّةِ بَنِي سَاعِدَةَ بَعْدَ مَا يَخْتَصِمُونَ ثُمَّ يَأْتُونَ الْمَسْجِدَ فَيَكُونُ أَوَّلَ مَنْ يُبَايِعُهُ عَلَى مِنْبَرِي إِبْلِيسُ لَعَنَهُ اللَّهُ فِي صُورَةِ رَجُلٍ شَيْخٍ مُشَمِّرٍ يَقُولُ كَذَا وَ كَذَا ثُمَّ يَخْرُجُ فَيَجْمَعُ شَيَاطِينَهُ وَ أَبَالِسَتَهُ فَيَنْخُرُ وَ يَكْسَعُ وَ يَقُولُ كَلَّا زَعَمْتُمْ أَنْ لَيْسَ لِي عَلَيْهِمْ سَبِيلٌ فَكَيْفَ رَأَيْتُمْ مَا صَنَعْتُ بِهِمْ حَتَّى تَرَكُوا أَمْرَ اللَّهِ عَزَّ وَ جَلَّ وَ طَاعَتَهُ وَ مَا أَمَرَهُمْ بِهِ رَسُولُ اللَّهِ (صلى الله عليه وآله)."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473674\">H 14988</a> – Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Ibrahim Bin Amro Al-Yamani, from Suleym Bin Qays Al-Hilali who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> heard Salman Al-Farsy</span><sup>ar</sup> saying: ‘When the Rasool Allah<sup>saww</sup> passed away, and the people did what they did, and Abu Bakr and Umar, and Abu Ubeyda Bin Al-Jarrah disputed with the Helpers, they disputed with them by the ‘بِحُجَّةِ’ rights of Ali<sup>asws</sup>. They said, ‘O group of Helpers! Qureysh are more deserving of the Command than you are because the Rasool Allah<sup>saww</sup> is from Qureysh and the Emigrant are from them. Allah<sup>azwj</sup> the High has Begun by them in His<sup>azwj</sup> Book and has Preferred them, and the Rasool Allah<sup>saww</sup> has said that the Imams<sup>asws</sup> are going to be from Qureysh’.",
            "Salman<sup>ar</sup> said. ‘So I<sup>ar</sup> came to Ali<sup>asws</sup> and he<sup>asws</sup> was washing (the body of) the Rasool Allah<sup>saww</sup>. I informed him of what the people had done and I said, ‘At this time, Abu Bakr is upon the Pulpit of the Rasool Allah<sup>saww</sup>, and by Allah<sup>azwj</sup>, they are not happy to pledge their allegiances to him with one hand, they are pledging their allegiances by both, their right hands and their left’. So he<sup>asws</sup> said to me; ‘O Salman<sup>ar</sup>! Do you know the one who pledged his allegiance to him upon the Pulpit of the Rasool Allah<sup>saww</sup>?’ I<sup>ar</sup> said, ‘I<sup>ar</sup> do not know except that I<sup>ar</sup> saw in the shadow of the Clan of Sa’ada where the Helpers were disputing, and the one who was the first to pledged his allegiance to him was Basheer Bin Sa’ad, and Abu Ubeyda Bin Al-Jarrah, then Umar, then Saalim’.",
            "He<sup>asws</sup> said; ‘I<sup>asws</sup> did not ask you<sup>ar</sup> about this, but do you<sup>ar</sup> know the first one who pledged his allegiance when he ascended upon the Pulpit of the Rasool Allah<sup>saww</sup>?’ I<sup>ar</sup> said, ‘No, but I<sup>ar</sup> saw an old man leaning upon his walking stick, with a mark of prostration between his eyes due to the intensity of Al-Tashmir (prostrations) climb up to him and he was weeping and saying, ‘Praise be to Allah<sup>azwj</sup> Who did not Cause me to die from the world until I saw you in this place. Extend your hand’. So he extended his hand, and he pledged his allegiance to him. Then he descended and went out from the Masjid’. ",
            "So Ali<sup>asws</sup> said; ‘Do you know who he was?’ I said, ‘No, but his speech had displeased me, as if he was gloating at the passing away of the Prophet<sup>saww</sup>’. So he<sup>asws</sup> said; ‘That was Iblees<sup>la</sup>, may Allah<sup>azwj</sup> Curse him<sup>la</sup>. The Rasool Allah<sup>saww</sup> informed me<sup>asws</sup> that Iblees<sup>la</sup> and the chiefs of his<sup>la</sup> companions witnessed the Messenger<sup>saww</sup> establishing me<sup>asws</sup> to the people at Ghadeer Khumm by the Command of Allah<sup>azwj</sup>, so he<sup>saww</sup> told them that I<sup>asws</sup> was higher to them than their own selves and commanded them that those who were present should make it reach to the absentees. ",
            "So the devils and the castaways companions of his<sup>la</sup> turned towards Iblees<sup>la</sup> and said, ‘This community is a Blessed community and is infallible, and there is neither for you<sup>la</sup> nor for us<sup>la</sup> a way against them, for they have come to know their Imam<sup>asws</sup>, and their shelter after their Prophet<sup>saww</sup>. So Iblees<sup>la</sup> , may Allah<sup>azwj</sup> Curse him<sup>la</sup> went away bleak and in grief. ",
            "And the Messenger<sup>saww</sup> informed me<sup>asws</sup> that when he<sup>saww</sup> passes away, the people would be pledging their allegiances to Abu Bakr in the shade of the Clan of Sa’ada after their quarrelling, then they would be coming to the Masjid, so the first one who would be pledging his allegiance upon my<sup>saww</sup> Pulpit would be Iblees<sup>la</sup> may Allah<sup>azwj</sup> Curse him<sup>la</sup> in the image of an old man with mark of prostration, saying such and such. Then he<sup>la</sup> will go out and gather his<sup>la</sup> Satans and devils and excitedly say to them, ‘All of you<sup>la</sup> thought that there was no way for me<sup>la</sup> against them, so how do you<sup>la</sup> see what I<sup>la</sup> have done with them, to the extent that they had left the Command of Allah<sup>azwj</sup> Mighty and Majestic, and being obedient to Him<sup>azwj</sup>, and what the Rasool Allah<sup>saww</sup> has commanded them for’. "
          ],
          "en.sarwar": [
            "542. Muhammad Bin Yahya, from Ahmad Bin Suleyman, from Abdullah Bin Muhammad All Yamani, from Masma’a Bin All Hajjaj, from Sabbah Al-Haza’a, from Sabbah Al-Muzny, who has narrated from Jabir the following: Abu Ja’far (a.s.) has said; ‘When the Rasool Allah (saww) grabbed the hand of Ali (a.s.) on the Day of Al-Ghadeer, Iblees (la) screamed in his (la) army a loud scream. So there did not remain anyone from among them, either in the land or in the sea except that he came to him (la). So they said, ‘O our chief and our master, what was that shriek which we heard which was so frightening that you (la) have never screamed like this before’. So he (la) said to them, ‘It was the action of this Prophet (saww), if acted upon, no one would disobey Allah (azwj) ever’. So they said, ‘O our chief, you (la) dealt with Adam (as)’. So when the hypocrites said, ‘He (saww) speak out of desires’, and one of them two (Abu Bakr and Umar) said to his companion, ‘Did you see his (saww) turn in his (saww) head as if he (saww) is a mad man?’ (By this) meaning the Rasool Allah (saww), Iblees (la) screamed with a scream of pleasure. So his (la) friends gathered. So he (la) said, ‘But, do you know that I (la) dealt with Adam (as) beforehand?’ They said, ‘Yes’. He (la) said, ‘Adam (as) set aside the Covenant and did not blaspheme with the Lord (azwj), and these ones have set aside the Covenant and blasphemed against the Rasool Allah (saww)’. So when the Rasool Allah (saww) passed away and the people established someone other than Ali (a.s.), Iblees (la) wore a crown of the king and established a pulpit and sat upon the cushion, and gathered his (la) cavalry and his (la) infantry. Then he (la) said to them, ‘Be delighted! Allah (azwj) will not be obeyed until the Imam (a.s.) makes a stand’. And Abu Ja’far (a.s.) recited: “<a href=\"/#/books/quran:34#h20\">[34:20]</a> And certainly the Shaitan found true his conjecture concerning them, so they follow him, except a party of the believers”. Abu Ja’far (a.s.) said: ‘The explanation of this Verse came to the fore when the Rasool Allah (saww) passed away, and the conjecture from Iblees (la) where they said to the Rasool Allah (saww) that he (saww) speak out of desire, so Iblees (la) conjectured about them with a conjecture and they made his (la) conjecture to come true’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 507)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15227,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:48:7",
        "refs": {
          "Quran": [
            "/books/quran:34:20"
          ]
        },
        "text": [
          "14989- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ سُلَيْمَانَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ الْيَمَانِيِّ عَنْ مِسْمَعِ بْنِ الْحَجَّاجِ عَنْ صَبَّاحٍ الْحَذَّاءِ عَنْ صَبَّاحٍ الْمُزَنِيِّ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ لَمَّا أَخَذَ رَسُولُ اللَّهِ (صلى الله عليه وآله) بِيَدِ عَلِيٍّ (عليه السلام) يَوْمَ الْغَدِيرِ صَرَخَ إِبْلِيسُ فِي جُنُودِهِ صَرْخَةً فَلَمْ يَبْقَ مِنْهُمْ أَحَدٌ فِي بَرٍّ وَ لَا بَحْرٍ إِلَّا أَتَاهُ فَقَالُوا يَا سَيِّدَهُمْ وَ مَوْلَاهُمْ مَا ذَا دَهَاكَ فَمَا سَمِعْنَا لَكَ صَرْخَةً أَوْحَشَ مِنْ صَرْخَتِكَ هَذِهِ فَقَالَ لَهُمْ فَعَلَ هَذَا النَّبِيُّ فِعْلًا إِنْ تَمَّ لَمْ يُعْصَ اللَّهُ أَبَداً فَقَالُوا يَا سَيِّدَهُمْ أَنْتَ كُنْتَ لآِدَمَ",
          "فَلَمَّا قَالَ الْمُنَافِقُونَ إِنَّهُ يَنْطِقُ عَنِ الْهَوَى وَ قَالَ أَحَدُهُمَا لِصَاحِبِهِ أَ مَا تَرَى عَيْنَيْهِ تَدُورَانِ فِي رَأْسِهِ كَأَنَّهُ مَجْنُونٌ يَعْنُونَ رَسُولَ اللَّهِ (صلى الله عليه وآله) صَرَخَ إِبْلِيسُ صَرْخَةً بِطَرَبٍ فَجَمَعَ أَوْلِيَاءَهُ فَقَالَ أَ مَا عَلِمْتُمْ أَنِّي كُنْتُ لآِدَمَ مِنْ قَبْلُ قَالُوا نَعَمْ قَالَ آدَمُ نَقَضَ الْعَهْدَ وَ لَمْ يَكْفُرْ بِالرَّبِّ وَ هَؤُلَاءِ نَقَضُوا الْعَهْدَ وَ كَفَرُوا بِالرَّسُولِ",
          "فَلَمَّا قُبِضَ رَسُولُ اللَّهِ (صلى الله عليه وآله) وَ أَقَامَ النَّاسُ غَيْرَ عَلِيٍّ لَبِسَ إِبْلِيسُ تَاجَ الْمُلْكِ وَ نَصَبَ مِنْبَراً وَ قَعَدَ فِي الْوَثْبَةِ وَ جَمَعَ خَيْلَهُ وَ رَجْلَهُ ثُمَّ قَالَ لَهُمْ اطْرَبُوا لَا يُطَاعُ اللَّهُ حَتَّى يَقُومَ الْإِمَامُ وَ تَلَا أَبُو جَعْفَرٍ (عليه السلام) وَ لَقَدْ صَدَّقَ عَلَيْهِمْ إِبْلِيسُ ظَنَّهُ فَاتَّبَعُوهُ إِلَّا فَرِيقاً مِنَ الْمُؤْمِنِينَ قَالَ أَبُو جَعْفَرٍ (عليه السلام) كَانَ تَأْوِيلُ هَذِهِ الْآيَةِ لَمَّا قُبِضَ رَسُولُ اللَّهِ (صلى الله عليه وآله) وَ الظَّنُّ مِنْ إِبْلِيسَ حِينَ قَالُوا لِرَسُولِ اللَّهِ (صلى الله عليه وآله) إِنَّهُ يَنْطِقُ عَنِ الْهَوَى فَظَنَّ بِهِمْ إِبْلِيسُ ظَنّاً فَصَدَّقُوا ظَنَّهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473675\">H 14989</a> – Muhammad Bin Yahya, from Ahmad Bin Suleyman, from Abdullah Bin Muhammad All Yamani, from Masma’a Bin All Hajjaj, from Sabbah Al-Haza’a, from Sabbah Al-Muzny, who has narrated from Jabir the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> has said; ‘When the Rasool Allah<sup>saww</sup> grabbed the hand of Ali<sup>asws</sup> on the Day of Al-Ghadeer, Iblees<sup>la</sup> screamed in his<sup>la</sup> army a loud scream. So there did not remain anyone from among them, either in the land or in the sea except that he came to him<sup>la</sup>. So they said, ‘O our chief and our master, what was that shriek which we heard which was so frightening that you<sup>la</sup> have never screamed like this before’. So he<sup>la</sup> said to them, ‘It was the action of this Prophet<sup>saww</sup>, if acted upon, no one would disobey Allah<sup>azwj</sup> ever’. So they said, ‘O our chief, you <sup>la</sup> dealt with Adam<sup>as</sup>’. ",
            "So when the hypocrites said, ‘He<sup>saww</sup> speak out of desires’, and one of them two (Abu Bakr and Umar) said to his companion, ‘Did you see his<sup>saww</sup> turn in his<sup>saww</sup> head as if he<sup>saww</sup> is a mad man?’ (By this) meaning the Rasool Allah<sup>saww</sup>, Iblees<sup>la</sup> screamed with a scream of pleasure. So his <sup>la</sup> friends gathered. So he<sup>la</sup> said, ‘But, do you know that I<sup>la</sup> dealt with Adam<sup>as</sup> beforehand?’ They said, ‘Yes’. He<sup>la</sup> said, ‘Adam<sup>as</sup> set aside the Covenant and did not blaspheme with the Lord<sup>azwj</sup>, and these ones have set aside the Covenant and blasphemed against the Rasool Allah<sup>saww</sup>’.",
            "So when the Rasool Allah<sup>saww</sup> passed away and the people established someone other than Ali<sup>asws</sup>, Iblees<sup>la</sup> wore a crown of the king and established a pulpit and sat upon the cushion, and gathered his<sup>la</sup> cavalry and his<sup>la</sup> infantry. Then he<sup>la</sup> said to them, ‘Be delighted! Allah<sup>azwj</sup> will not be obeyed until the Imam<sup>asws</sup> makes a stand’. And Abu Ja’far<sup>asws</sup> recited: <span class=\"ibTxt\">“<a href=\"/#/books/quran:34#h20\">[34:20]</a> And certainly the Shaitan found true his conjecture concerning them, so they follow him, except a party of the believers”</span>. Abu Ja’far<sup>asws</sup> said: ‘The explanation of this Verse came to the fore when the Rasool Allah<sup>saww</sup> passed away, and the conjecture from Iblees<sup>la</sup> where they said to the Rasool Allah<sup>saww</sup> that he<sup>saww</sup> speak out of desire, so Iblees<sup>la</sup> conjectured about them with a conjecture and they made his<sup>la</sup> conjecture to come true’. "
          ],
          "en.sarwar": [
            "543. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Hadeed, from Jameel Bin Darraj, from Zurara, who has reported the following: One of the two of them (a.s.) (Fifth of sixth Imam (a.s.)) having said: ‘One morning the Rasool Allah (saww) was grim and in grief. So Ali (a.s.) said to him (saww): ‘What is it that I (a.s.) see you (saww) to be grim and sad, O Rasool Allah (saww)?’ So he (saww) said; ‘So how can I (saww) not be like that and I (saww) have dreamt last night that the Clan of Taym (Abu Bakr’s clan), and clan of Adayy (Umar’s clan) ascending upon this Pulpit of mine (saww), returning the people back from Al-Islam backwards. So I (saww) said: ‘O Lord (azwj)! Will it be during my (saww) lifetime or after my (saww) passing away?’ So He (azwj) Said; “After your (saww) passing away”."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 508)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15228,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:48:8",
        "text": [
          "14990- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ زُرَارَةَ عَنْ أَحَدِهِمَا (عليهما السلام ) قَالَ أَصْبَحَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَوْماً كَئِيباً حَزِيناً فَقَالَ لَهُ عَلِيٌّ ( عليه السلام ) مَا لِي أَرَاكَ يَا رَسُولَ اللَّهِ كَئِيباً حَزِيناً فَقَالَ وَ كَيْفَ لَا أَكُونُ كَذَلِكَ وَ قَدْ رَأَيْتُ فِي لَيْلَتِي هَذِهِ أَنَّ بَنِي تَيْمٍ وَ بَنِي عَدِيٍّ وَ بَنِي أُمَيَّةَ يَصْعَدُونَ مِنْبَرِي هَذَا يَرُدُّونَ النَّاسَ عَنِ الْإِسْلَامِ الْقَهْقَرَى فَقُلْتُ يَا رَبِّ فِي حَيَاتِي أَوْ بَعْدَ مَوْتِي فَقَالَ بَعْدَ مَوْتِكَ. "
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473676\">H 14990</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Hadeed, from Jameel Bin Darraj, from Zurara, who has reported the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-o\">O</span>ne of the two of them</span><sup>asws</sup> (Fifth of sixth Imam<sup>asws</sup>) having said: ‘One morning the Rasool Allah<sup>saww</sup> was grim and in grief. So Ali<sup>asws</sup> said to him<sup>saww</sup>: ‘What is it that I<sup>asws</sup> see you<sup>saww</sup> to be grim and sad, O Rasool Allah<sup>saww</sup>?’ So he<sup>saww</sup> said; ‘So how can I<sup>saww</sup> not be like that and I<sup>saww</sup> have dreamt last night that the Clan of Taym (Abu Bakr’s clan), and clan of Adayy (Umar’s clan) ascending upon this Pulpit of mine<sup>saww</sup>, returning the people back from Al-Islam backwards. So I<sup>saww</sup> said: ‘O Lord<sup>azwj</sup>! Will it be during my<sup>saww</sup> lifetime or after my<sup>saww</sup> passing away?’ So He<sup>azwj</sup> Said; “After your<sup>saww</sup> passing away”."
          ],
          "en.sarwar": [
            "544. Jameel, from Zurara, from one of them (a.s.) (Fifth or Sixth Imam (a.s.)) having said: ‘The Rasool Allah (saww) said: ‘Had it not been for my (saww) disliking that they would say, ‘Muhammad (saww) sought support of the people so that he (saww) would be victorious over his (saww) enemies’, I (saww) would have killed a lot of people by striking their necks’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 508)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15229,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:48:9",
        "text": [
          "14991- جَمِيلٌ عَنْ زُرَارَةَ عَنْ أَحَدِهِمَا (عليهما السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) لَوْ لَا أَنِّي أَكْرَهُ أَنْ يُقَالَ إِنَّ مُحَمَّداً اسْتَعَانَ بِقَوْمٍ حَتَّى إِذَا ظَفِرَ بِعَدُوِّهِ قَتَلَهُمْ لَضَرَبْتُ أَعْنَاقَ قَوْمٍ كَثِيرٍ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473677\">H 14991</a> – Jameel, from Zurara, from one of them<sup>asws</sup> (Fifth or Sixth Imam<sup>asws</sup>) having said: ‘The Rasool Allah<sup>saww</sup> said: ‘Had it not been for my<sup>saww</sup> disliking that they would say, ‘Muhammad<sup>saww</sup> sought support of the people so that he<sup>saww</sup> would be victorious over his<sup>saww</sup> enemies’, I<sup>saww</sup> would have killed a lot of people by striking their necks’."
          ],
          "en.sarwar": [
            "545. A number of our companions, from Sahl Bin Ziyad, from Ubeydullah Al-Dahqaan, from Abdullah Bin Al-Qasim, from Ibn Abu Najraan, from Aban Bin Taglub, who has narrated: Abu Abdullah (a.s.) has said; ‘The Messiah (as) used to say: ‘The one who avoids treating the wounded from his wounds is inevitably an associate of the one who wounded him, and that the injurer intended to destroy the wounded one, and the one who avoided treating him did not desire his well being. So if he did not desire his well being so he has desired his destruction unwillingly. Similar to that, do not narrate the wisdom to the one who does not deserve it for it would be ignorant of you, and do not prevent it from its deserving ones, for you would be a sinner, but one of you should become of the status of a doctor who treats when he sees it is appropriate for his medicine, otherwise he withholds’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 508)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15230,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:48:10",
        "refs": {
          "Quran": [
            "/books/quran:9:110",
            "/books/quran:14:7",
            "/books/quran:34:13"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14992</span>- عِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عُبَيْدِ اللَّهِ الدِّهْقَانِ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ أَبَانِ بْنِ تَغْلِبَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ كَانَ الْمَسِيحُ (عليه السلام) يَقُولُ إِنَّ التَّارِكَ شِفَاءَ الْمَجْرُوحِ مِنْ جُرْحِهِ شَرِيكٌ لِجَارِحِهِ لَا مَحَالَةَ وَ ذَلِكَ أَنَّ الْجَارِحَ أَرَادَ فَسَادَ الْمَجْرُوحِ وَ التَّارِكَ لِإِشْفَائِهِ لَمْ يَشَأْ صَلَاحَهُ فَإِذَا لَمْ يَشَأْ صَلَاحَهُ فَقَدْ شَاءَ فَسَادَهُ اضْطِرَاراً فَكَذَلِكَ لَا تُحَدِّثُوا بِالْحِكْمَةِ غَيْرَ أَهْلِهَا فَتَجْهَلُوا وَ لَا تَمْنَعُوهَا أَهْلَهَا فَتَأْثَمُوا وَ لْيَكُنْ أَحَدُكُمْ بِمَنْزِلَةِ الطَّبِيبِ الْمُدَاوِي إِنْ رَأَى مَوْضِعاً لِدَوَائِهِ وَ إِلَّا أَمْسَكَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473678\">H 14992</a> – A number of our companions, from Sahl Bin Ziyad, from Ubeydullah Al-Dahqaan, from Abdullah Bin Al-Qasim, from Ibn Abu Najraan, from Aban Bin Taglub, who has narrated:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said; ‘The Messiah<sup>as</sup> used to say: ‘The one who avoids treating the wounded from his wounds is inevitably an associate of the one who wounded him, and that the injurer intended to destroy the wounded one, and the one who avoided treating him did not desire his well being. So if he did not desire his well being so he has desired his destruction unwillingly. Similar to that, do not narrate the wisdom to the one who does not deserve it for it would be ignorant of you, and do not prevent it from its deserving ones, for you would be a sinner, but one of you should become of the status of a doctor who treats when he sees it is appropriate for his medicine, otherwise he withholds’."
          ],
          "en.sarwar": [
            "546. Sahl, from Ubeydullah, from Ahmad Bin Umar who said: I went to Abu Al-Hassan Al-Ridha (a.s.) with Husayn Bin Suweyr Bin Abu Fakhta. So I said to him (a.s.), ‘May I be sacrificed for you (a.s.), we used to be in a time of sustenance and led an affluent lifestyle. Our condition changed as it sometimes does, so supplicate to Allah (azwj) to return that state to us’. So he (a.s.) said: ‘What is it that you want? To become kings? Would you be satisfied to become like Tahir and Harsama, and they are opposed to what you are upon?’ I said, ‘No, by Allah (azwj), it would not satisfy me that there should be for me the whole world and whatever is in it of the gold and the silver, whilst I am upon the opposite to what I am upon at present (Al-Wilayah). He (a.s.) said; ‘So the one who is contented among you, should be thankful to Allah (azwj). Allah (azwj) is Saying: “<a href=\"/#/books/quran:14#h7\">[14:7]</a> If you are grateful, I would certainly give to you more”. And the Glorious and High Said: “<a href=\"/#/books/quran:34#h13\">[34:13]</a> give thanks, O family of Dawood! and very few of My servants are grateful”. And think good with Allah (azwj), for Abu Abdullah (a.s.) used to say; ‘The one who thinks about Allah (azwj), Allah (azwj) would also Mention him (Reward him), and the one who is happy with a little from the sustenance, Allah (azwj) would Accept even small amount of deeds. And the one who is happy with a small amount of Permissible, his expenses would be light and his family would enjoy, and Allah (azwj) would Show him the sicknesses of the world and its cure and Bring him out from it safely to the House of Peace’. Then said; ‘What is the action of Ibn Qayama?’ I said, ‘By Allah (azwj), he (does not) meet us in a goodly manner’. So he (a.s.) said: ‘And which thing prevents him from that?’ Then he (a.s.) recited this Verse: “<a href=\"/#/books/quran:9#h110\">[9:110]</a> The building which they have built will ever continue to be a source of disquiet in their hearts, except that their hearts get cut into pieces”. Then he (a.s.) said: ‘Do you know what was it that confused Ibn Qayama?’ I said, ‘No’. He (a.s.) said: ‘He chased Abu Al-Hassan (a.s.), so he came to him (a.s.) from his (a.s.) right, and from his (a.s.) left, and he wanted Masjid of the Prophet (saww). So Abu Al-Hassan (a.s.) turned towards him and said: ‘What do you want, may Allah (azwj) Confuse you’. Then he (a.s.) said: ‘Consider if Musa (as) were to return to them, so they said, ‘Had you (as) appointed him (Haroun (as)) for us, so we would have followed him (as) in his (as) footsteps’, were they more desirable in their speech or the ones who said, ‘We will not leave our devotions for him (Haroun (as)) until Musa (as) returns to us’. So I said, ‘No, but the ones who said, ‘He (as) has been appointed for us, so we will follow him (as) in his (as) footsteps’. So he (a.s.) said; ‘So it is from there that Ibn Qayama and the ones who speak by his speech come from’. Then he (a.s.) mentioned Ibn Al-Sarraaj, so he (a.s.) said: ‘He had accepted the death of Abu Al-Hassan (a.s.) and that is why he bequeathed during his death, so he said, ‘All of what I leave behind from the things, even my shirt which is upon my neck, is for the inheritors of Abu Al-Hassan (a.s.)’. And he never said that it is for Abu Al-Hassan (a.s.). And this is his acceptance, but which thing will profit him from that and from what he said?’ Then he (a.s.) was quiet’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 511)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15231,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:48:11",
        "refs": {
          "Quran": [
            "/books/quran:9:110",
            "/books/quran:14:7",
            "/books/quran:34:13"
          ]
        },
        "text": [
          "14993- سَهْلٌ عَنْ عُبَيْدِ اللَّهِ عَنْ أَحْمَدَ بْنِ عُمَرَ قَالَ دَخَلْتُ عَلَى أَبِي الْحَسَنِ الرِّضَا (عليه السلام) أَنَا وَ حُسَيْنُ بْنُ ثُوَيْرِ بْنِ أَبِي فَاخِتَةَ فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ إِنَّا كُنَّا فِي سَعَةٍ مِنَ الرِّزْقِ وَ غَضَارَةٍ مِنَ الْعَيْشِ فَتَغَيَّرَتِ الْحَالُ بَعْضَ التَّغْيِيرِ فَادْعُ اللَّهَ عَزَّ وَ جَلَّ أَنْ يَرُدَّ ذَلِكَ إِلَيْنَا فَقَالَ أَيَّ شَيْ‏ءٍ تُرِيدُونَ تَكُونُونَ مُلُوكاً أَ يَسُرُّكَ أَنْ تَكُونَ مِثْلَ طَاهِرٍ وَ هَرْثَمَةَ وَ إِنَّكَ عَلَى خِلَافِ مَا أَنْتَ عَلَيْهِ قُلْتُ لَا وَ اللَّهِ مَا يَسُرُّنِي أَنَّ لِيَ الدُّنْيَا بِمَا فِيهَا ذَهَباً وَ فِضَّةً وَ إِنِّي عَلَى خِلَافِ مَا أَنَا عَلَيْهِ",
          "قَالَ فَقَالَ فَمَنْ أَيْسَرَ مِنْكُمْ فَلْيَشْكُرِ اللَّهَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ لَئِنْ شَكَرْتُمْ لَأَزِيدَنَّكُمْ وَ قَالَ سُبْحَانَهُ وَ تَعَالَى اعْمَلُوا آلَ داوُدَ شُكْراً وَ قَلِيلٌ مِنْ عِبادِيَ الشَّكُورُ وَ أَحْسِنُوا الظَّنَّ بِاللَّهِ فَإِنَّ أَبَا عَبْدِ اللَّهِ (عليه السلام) كَانَ يَقُولُ مَنْ حَسُنَ ظَنُّهُ بِاللَّهِ كَانَ اللَّهُ عِنْدَ ظَنِّهِ بِهِ وَ مَنْ رَضِيَ بِالْقَلِيلِ مِنَ الرِّزْقِ قَبِلَ اللَّهُ مِنْهُ الْيَسِيرَ مِنَ الْعَمَلِ وَ مَنْ رَضِيَ بِالْيَسِيرِ مِنَ الْحَلَالِ خَفَّتْ مَئُونَتُهُ وَ تَنَعَّمَ أَهْلُهُ وَ بَصَّرَهُ اللَّهُ دَاءَ الدُّنْيَا وَ دَوَاءَهَا وَ أَخْرَجَهُ مِنْهَا سَالِماً إِلَى دَارِ السَّلَامِ",
          "قَالَ ثُمَّ قَالَ مَا فَعَلَ ابْنُ قِيَامَا قَالَ قُلْتُ وَ اللَّهِ إِنَّهُ لَيَلْقَانَا فَيُحْسِنُ اللِّقَاءَ فَقَالَ وَ أَيُّ شَيْ‏ءٍ يَمْنَعُهُ مِنْ ذَلِكَ ثُمَّ تَلَا هَذِهِ الْآيَةَ لا يَزالُ بُنْيانُهُمُ الَّذِي بَنَوْا رِيبَةً فِي قُلُوبِهِمْ إِلَّا أَنْ تَقَطَّعَ قُلُوبُهُمْ قَالَ ثُمَّ قَالَ تَدْرِي لِأَيِّ شَيْ‏ءٍ تَحَيَّرَ ابْنُ قِيَامَا قَالَ قُلْتُ لَا قَالَ إِنَّهُ تَبِعَ أَبَا الْحَسَنِ (عليه السلام) فَأَتَاهُ عَنْ يَمِينِهِ وَ عَنْ شِمَالِهِ وَ هُوَ يُرِيدُ مَسْجِدَ النَّبِيِّ (صلى الله عليه وآله) فَالْتَفَتَ إِلَيْهِ أَبُو الْحَسَنِ (عليه السلام) فَقَالَ مَا تُرِيدُ حَيَّرَكَ اللَّهُ",
          "قَالَ ثُمَّ قَالَ أَ رَأَيْتَ لَوْ رَجَعَ إِلَيْهِمْ مُوسَى فَقَالُوا لَوْ نَصَبْتَهُ لَنَا فَاتَّبَعْنَاهُ وَ اقْتَصَصْنَا أَثَرَهُ أَ هُمْ كَانُوا أَصْوَبَ قَوْلًا أَوْ مَنْ قَالَ لَنْ نَبْرَحَ عَلَيْهِ عاكِفِينَ حَتَّى يَرْجِعَ إِلَيْنا مُوسى قَالَ قُلْتُ لَا بَلْ مَنْ قَالَ نَصَبْتَهُ لَنَا فَاتَّبَعْنَاهُ وَ اقْتَصَصْنَا أَثَرَهُ قَالَ فَقَالَ مِنْ هَاهُنَا أُتِيَ ابْنُ قِيَامَا وَ مَنْ قَالَ بِقَوْلِهِ",
          "قَالَ ثُمَّ ذَكَرَ ابْنَ السَّرَّاجِ فَقَالَ إِنَّهُ قَدْ أَقَرَّ بِمَوْتِ أَبِي الْحَسَنِ (عليه السلام) وَ ذَلِكَ أَنَّهُ أَوْصَى عِنْدَ مَوْتِهِ فَقَالَ كُلُّ مَا خَلَّفْتُ مِنْ شَيْ‏ءٍ حَتَّى قَمِيصِي هَذَا الَّذِي فِي عُنُقِي لِوَرَثَةِ أَبِي الْحَسَنِ (عليه السلام) وَ لَمْ يَقُلْ هُوَ لِأَبِي الْحَسَنِ (عليه السلام) وَ هَذَا إِقْرَارٌ وَ لَكِنْ أَيُّ شَيْ‏ءٍ يَنْفَعُهُ مِنْ ذَلِكَ وَ مِمَّا قَالَ ثُمَّ أَمْسَكَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473679\">H 14993</a> – Sahl, from Ubeydullah, from Ahmad Bin Umar who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span> went to Abu Al-Hassan</span> Al-Reza<sup>asws</sup> with Husayn Bin Suweyr Bin Abu Fakhta. So I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>, we used to be in a time of sustenance and led an affluent lifestyle. Our condition changed as it sometimes does, so supplicate to Allah<sup>azwj</sup> to return that state to us’. So he<sup>asws</sup> said: ‘What is it that you want? To become kings? Would you be satisfied to become like Tahir and Harsama, and they are opposed to what you are upon?’ I said, ‘No, by Allah<sup>azwj</sup>, it would not satisfy me that there should be for me the whole world and whatever is in it of the gold and the silver, whilst I am upon the opposite to what I am upon at present (Al-Wilayah). ",
            "He<sup>asws</sup> said; ‘So the one who is contented among you, should be thankful to Allah<sup>azwj</sup>. Allah<sup>azwj</sup> is Saying: <span class=\"ibTxt\">“<a href=\"/#/books/quran:14#h7\">[14:7]</a> If you are grateful, I would certainly give to you more”</span>. And the Glorious and High Said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:34#h13\">[34:13]</a> give thanks, O family of Dawood! and very few of My servants are grateful”</span>. And think good with Allah<sup>azwj</sup>, for Abu Abdullah<sup>asws</sup> used to say; ‘The one who thinks about Allah<sup>azwj</sup>, Allah<sup>azwj</sup> would also Mention him (Reward him), and the one who is happy with a little from the sustenance, Allah<sup>azwj</sup> would Accept even small amount of deeds. And the one who is happy with a small amount of Permissible, his expenses would be light and his family would enjoy, and Allah<sup>azwj</sup> would Show him the sicknesses of the world and its cure and Bring him out from it safely to the House of Peace’. ",
            "Then said; ‘What is the action of Ibn Qayama?’ I said, ‘By Allah<sup>azwj</sup>, he (does not) meet us in a goodly manner’. So he<sup>asws</sup> said: ‘And which thing prevents him from that?’ Then he<sup>asws</sup> recited this Verse: <span class=\"ibTxt\">“<a href=\"/#/books/quran:9#h110\">[9:110]</a> The building which they have built will ever continue to be a source of disquiet in their hearts, except that their hearts get cut into pieces”</span>. Then he<sup>asws</sup> said: ‘Do you know what was it that confused Ibn Qayama?’ I said, ‘No’. He<sup>asws</sup> said: ‘He chased Abu Al-Hassan<sup>asws</sup>, so he came to him<sup>asws</sup> from his<sup>asws</sup> right, and from his<sup>asws</sup> left, and he wanted Masjid of the Prophet<sup>saww</sup>. So Abu Al-Hassan<sup>asws</sup> turned towards him and said: ‘What do you want, may Allah<sup>azwj</sup> Confuse you’. ",
            "Then he<sup>asws</sup> said: ‘Consider if Musa<sup>as</sup> were to return to them, so they said, ‘Had you<sup>as</sup> appointed him (Haroun<sup>as</sup>) for us, so we would have followed him<sup>as</sup> in his<sup>as</sup> footsteps’, were they more desirable in their speech or the ones who said, ‘We will not leave our devotions for him (Haroun<sup>as</sup>) until Musa<sup>as</sup> returns to us’. So I said, ‘No, but the ones who said, ‘He<sup>as</sup> has been appointed for us, so we will follow him<sup>as</sup> in his<sup>as</sup> footsteps’. So he<sup>asws</sup> said; ‘So it is from there that Ibn Qayama and the ones who speak by his speech come from’. ",
            "Then he<sup>asws</sup> mentioned Ibn Al-Sarraaj, so he<sup>asws</sup> said: ‘He had accepted the death of Abu Al-Hassan<sup>asws</sup> and that is why he bequeathed during his death, so he said, ‘All of what I leave behind from the things, even my shirt which is upon my neck, is for the inheritors of Abu Al-Hassan<sup>asws</sup>’. And he never said that it is for Abu Al-Hassan<sup>asws</sup>. And this is his acceptance, but which thing will profit him from that and from what he said?’ Then he<sup>asws</sup> was quiet’. "
          ],
          "en.sarwar": [
            "547. Ali Bin Ibrahim, from his father, from Al-Qasim Bin Muhammad, from Suleyman Bin Dawood Al-Munqary, from Hammaad, who has narrated the following: Abu Abdullah (a.s.) has said; ‘Luqman (as) said to his (as) son: ‘Whenever you travel with a group, take a lot of advice about them for your affairs and their affairs, and smile frequently in their faces, and be generous with your provisions. And if they call you, respond to them, and if they seek your support, help them. And be overcome them with three things – the length of silence, and the frequency of the Prayer, and generosity of the self with whatever is with you from the animal, or wealth, or provisions. And if they ask you to testify to ‘الْحَقِّ’ the truth, so testify for it, and exhaust your opinion for them if they consult you. Then do not advise them until you are sure about it and reconsider it, and do not answer in your advice until you stand regarding it, and sit, and sleep, and eat, and Pray, and you are utilising your thoughts and your wisdom with regards to your advice. So the one who does not refine his advice for the one who consulted him, Allah (azwj) Crucifies his opinion, and Removes from him the trust. And if you see your companions walking, so you should walk with them, and if you see them doing something, so do it with them, and if they give charity and give a loan, so give with them. And listen to the one who is older than you in age, and if he orders you and asks you, so say, Yes’, and do not say, ‘No’, for the ‘No’ is a fault and blameable. And if you are confused regarding your road, so stop and encamp, and if you are in doubt regarding the intended course, pause and plan. And if you see one person, do not ask him about your direction of road, and do not heed his guidance, for the one person in the wild is suspect for he could be an eye for the thieves, or he could be the Satan (la) who confused you. And be cautious of two persons as well, unless you can see what I (as) don’t, for the intellectual, when he sees something with his own eyes recognises the truth from it, and the witness can see what the absentee does not. O my son! And when the time of Salat comes up, so do not delay it for anything, and offer Salat and seek comfort from it for it is the Religion. And Pray in congregation even if there is pushing upon the head. And do not sleep upon your animal for that is injurious to its back, and that is not from the actions of the wise except if you are in a carriage and it is possible for you to stretch your joints. And when you come close to the destination, so descend from your animal and begin by feeding it before yourself. And when you intend to encamp, so it is upon you to remain in a land, which is good in colour, soft in soil, and abundance of grass. And if you encamp, so Pray two cycles before you sit down. And if you intend to fulfill your need (toilet), go far away. And when you embark (upon your journey) Pray two cycles, and say farewell to the land on which you spent time, and send greetings of peace upon it and upon its people, because for every patch of land has its inhabitants from the Angels. If you are able to, do not eat food until you begin by giving charity from it, so do it. And it is upon you to recite the Book of Allah (azwj) Mighty and Majestic as long as you are riding. And it is upon you for the Glorification for as long as you are working. And it is upon you to supplicate for as long as you are alone. And beware of travelling in the first part of the night. And it is upon you to travel from the middle of the night to its end. And beware of raising your voice during your travel’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 513)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15232,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:48:12",
        "refs": {
          "Quran": [
            "/books/quran:2:255"
          ]
        },
        "text": [
          "14994- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْمِنْقَرِيِّ عَنْ حَمَّادٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ لُقْمَانُ لِابْنِهِ إِذَا سَافَرْتَ مَعَ قَوْمٍ فَأَكْثِرِ اسْتِشَارَتَكَ إِيَّاهُمْ فِي أَمْرِكَ وَ أُمُورِهِمْ وَ أَكْثِرِ التَّبَسُّمَ فِي وُجُوهِهِمْ وَ كُنْ كَرِيماً عَلَى زَادِكَ وَ إِذَا دَعَوْكَ فَأَجِبْهُمْ وَ إِذَا اسْتَعَانُوا بِكَ فَأَعِنْهُمْ وَ اغْلِبْهُمْ بِثَلَاثٍ بِطُولِ الصَّمْتِ وَ كَثْرَةِ الصَّلَاةِ وَ سَخَاءِ النَّفْسِ بِمَا مَعَكَ مِنْ دَابَّةٍ أَوْ مَالٍ أَوْ زَادٍ",
          "وَ إِذَا اسْتَشْهَدُوكَ عَلَى الْحَقِّ فَاشْهَدْ لَهُمْ وَ اجْهَدْ رَأْيَكَ لَهُمْ إِذَا اسْتَشَارُوكَ ثُمَّ لَا تَعْزِمْ حَتَّى تَثَبَّتَ وَ تَنْظُرَ وَ لَا تُجِبْ فِي مَشُورَةٍ حَتَّى تَقُومَ فِيهَا وَ تَقْعُدَ وَ تَنَامَ وَ تَأْكُلَ وَ تُصَلِّيَ وَ أَنْتَ مُسْتَعْمِلٌ فِكْرَكَ وَ حِكْمَتَكَ فِي مَشُورَتِهِ فَإِنَّ مَنْ لَمْ يُمْحِضِ النَّصِيحَةَ لِمَنِ اسْتَشَارَهُ سَلَبَهُ اللَّهُ تَبَارَكَ وَ تَعَالَى رَأْيَهُ وَ نَزَعَ عَنْهُ الْأَمَانَةَ",
          "وَ إِذَا رَأَيْتَ أَصْحَابَكَ يَمْشُونَ فَامْشِ مَعَهُمْ وَ إِذَا رَأَيْتَهُمْ يَعْمَلُونَ فَاعْمَلْ مَعَهُمْ وَ إِذَا تَصَدَّقُوا وَ أَعْطَوْا قَرْضاً فَأَعْطِ مَعَهُمْ وَ اسْمَعْ لِمَنْ هُوَ أَكْبَرُ مِنْكَ سِنّاً وَ إِذَا أَمَرُوكَ بِأَمْرٍ وَ سَأَلُوكَ فَقُلْ نَعَمْ وَ لَا تَقُلْ لَا فَإِنَّ لَا عِيٌّ وَ لُؤْمٌ وَ إِذَا تَحَيَّرْتُمْ فِي طَرِيقِكُمْ فَانْزِلُوا وَ إِذَا شَكَكْتُمْ فِي الْقَصْدِ فَقِفُوا وَ تَآمَرُوا",
          "وَ إِذَا رَأَيْتُمْ شَخْصاً وَاحِداً فَلَا تَسْأَلُوهُ عَنْ طَرِيقِكُمْ وَ لَا تَسْتَرْشِدُوهُ فَإِنَّ الشَّخْصَ الْوَاحِدَ فِي الْفَلَاةِ مُرِيبٌ لَعَلَّهُ أَنْ يَكُونَ عَيْناً لِلُّصُوصِ أَوْ يَكُونَ هُوَ الشَّيْطَانَ الَّذِي حَيَّرَكُمْ وَ احْذَرُوا الشَّخْصَيْنِ أَيْضاً إِلَّا أَنْ تَرَوْا مَا لَا أَرَى فَإِنَّ الْعَاقِلَ إِذَا أَبْصَرَ بِعَيْنِهِ شَيْئاً عَرَفَ الْحَقَّ مِنْهُ وَ الشَّاهِدُ يَرَى مَا لَا يَرَى الْغَائِبُ",
          "يَا بُنَيَّ وَ إِذَا جَاءَ وَقْتُ صَلَاةٍ فَلَا تُؤَخِّرْهَا لِشَيْ‏ءٍ وَ صَلِّهَا وَ اسْتَرِحْ مِنْهَا فَإِنَّهَا دَيْنٌ وَ صَلِّ فِي جَمَاعَةٍ وَ لَوْ عَلَى رَأْسِ زُجٍّ وَ لَا تَنَامَنَّ عَلَى دَابَّتِكَ فَإِنَّ ذَلِكَ سَرِيعٌ فِي دَبَرِهَا وَ لَيْسَ ذَلِكَ مِنْ فِعْلِ الْحُكَمَاءِ إِلَّا أَنْ تَكُونَ فِي مَحْمِلٍ يُمْكِنُكَ التَّمَدُّدُ لِاسْتِرْخَاءِ الْمَفَاصِلِ",
          "وَ إِذَا قَرُبْتَ مِنَ الْمَنْزِلِ فَانْزِلْ عَنْ دَابَّتِكَ وَ ابْدَأْ بِعَلْفِهَا قَبْلَ نَفْسِكَ وَ إِذَا أَرَدْتَ النُّزُولَ فَعَلَيْكَ مِنْ بِقَاعِ الْأَرْضِ بِأَحْسَنِهَا لَوْناً وَ أَلْيَنِهَا تُرْبَةً وَ أَكْثَرِهَا عُشْباً وَ إِذَا نَزَلْتَ فَصَلِّ رَكْعَتَيْنِ قَبْلَ أَنْ تَجْلِسَ وَ إِذَا أَرَدْتَ قَضَاءَ حَاجَةٍ فَأَبْعِدِ الْمَذْهَبَ فِي الْأَرْضِ وَ إِذَا ارْتَحَلْتَ فَصَلِّ رَكْعَتَيْنِ وَ وَدِّعِ الْأَرْضَ الَّتِي حَلَلْتَ بِهَا وَ سَلِّمْ عَلَيْهَا وَ عَلَى أَهْلِهَا فَإِنَّ لِكُلِّ بُقْعَةٍ أَهْلًا مِنَ الْمَلَائِكَةِ ",
          "وَ إِنِ اسْتَطَعْتَ أَنْ لَا تَأْكُلَ طَعَاماً حَتَّى تَبْدَأَ فَتَتَصَدَّقَ مِنْهُ فَافْعَلْ وَ عَلَيْكَ بِقِرَاءَةِ كِتَابِ اللَّهِ عَزَّ وَ جَلَّ مَا دُمْتَ رَاكِباً وَ عَلَيْكَ بِالتَّسْبِيحِ مَا دُمْتَ عَامِلًا وَ عَلَيْكَ بِالدُّعَاءِ مَا دُمْتَ خَالِياً وَ إِيَّاكَ وَ السَّيْرَ مِنْ أَوَّلِ اللَّيْلِ وَ عَلَيْكَ بِالتَّعْرِيسِ وَ الدَّلْجَةِ مِنْ لَدُنْ نِصْفِ اللَّيْلِ إِلَى آخِرِهِ وَ إِيَّاكَ وَ رَفْعَ الصَّوْتِ فِي مَسِيرِكَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473680\">H 14994</a> – Ali Bin Ibrahim, from his father, from Al-Qasim Bin Muhammad, from Suleyman Bin Dawood Al-Munqary, from Hammaad, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said; ‘Luqman<sup>as</sup> said to his<sup>as</sup> son: ‘Whenever you travel with a group, take a lot of advice about them for your affairs and their affairs, and smile frequently in their faces, and be generous with your provisions. And if they call you, respond to them, and if they seek your support, help them. And be overcome them with three things – the length of silence, and the frequency of the Prayer, and generosity of the self with whatever is with you from the animal, or wealth, or provisions. ",
            "And if they ask you to testify to ‘الْحَقِّ’ the truth, so testify for it, and exhaust your opinion for them if they consult you. Then do not advise them until you are sure about it and reconsider it, and do not answer in your advice until you stand regarding it, and sit, and sleep, and eat, and Pray, and you are utilising your thoughts and your wisdom with regards to your advice. So the one who does not refine his advice for the one who consulted him, Allah<sup>azwj</sup> Crucifies his opinion, and Removes from him the trust.",
            "And if you see your companions walking, so you should walk with them, and if you see them doing something, so do it with them, and if they give charity and give a loan, so give with them. And listen to the one who is older than you in age, and if he orders you and asks you, so say, Yes’, and do not say, ‘No’, for the ‘No’ is a fault and blameable. And if you are confused regarding your road, so stop and encamp, and if you are in doubt regarding the intended course, pause and plan. ",
            "And if you see one person, do not ask him about your direction of road, and do not heed his guidance, for the one person in the wild is suspect for he could be an eye for the thieves, or he could be the Satan<sup>la</sup> who confused you. And be cautious of two persons as well, unless you can see what I<sup>as</sup> don’t, for the intellectual, when he sees something with his own eyes recognises the truth from it, and the witness can see what the absentee does not.",
            "O my son! And when the time of Salat comes up, so do not delay it for anything, and offer Salat and seek comfort from it for it is the Religion. And Pray in congregation even if there is pushing upon the head. And do not sleep upon your animal for that is injurious to its back, and that is not from the actions of the wise except if you are in a carriage and it is possible for you to stretch your joints. ",
            "And when you come close to the destination, so descend from your animal and begin by feeding it before yourself. And when you intend to encamp, so it is upon you to remain in a land, which is good in colour, soft in soil, and abundance of grass. And if you encamp, so Pray two cycles before you sit down. And if you intend to fulfill your need (toilet), go far away. And when you embark (upon your journey) Pray two cycles, and say farewell to the land on which you spent time, and send greetings of peace upon it and upon its people, because for every patch of land has its inhabitants from the Angels.",
            "If you are able to, do not eat food until you begin by giving charity from it, so do it. And it is upon you to recite the Book of Allah<sup>azwj</sup> Mighty and Majestic as long as you are riding. And it is upon you for the Glorification for as long as you are working. And it is upon you to supplicate for as long as you are alone. And beware of travelling in the first part of the night. And it is upon you to travel from the middle of the night to its end. And beware of raising your voice during your travel’.  "
          ],
          "en.sarwar": [
            "548. A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Al-Husayn Bin Yazeed Al-Nowfaly, from Ali Bin Dawood Al-Yaqouby, from Isa Bin Abdullah Al-Alawy who said: It has been narrated to me by Al-Asaydi and Muhammad Bin Basheer that Abdullah Bin Naf’a Al-Azraq used to say, ‘If only I knew someone between its (earth’s) diameter where my animal (ride) can reach to, who can debate with me that Ali (a.s.) killed the people of Naharwaan, and he (a.s.) was not unjust to them, I would ride over to him’ (to refute). So it was said to him, ‘And (what about his (a.s.) son (a.s.))?’ He said, ‘Is his (a.s.) son (a.s.) a knowledgeable one?’ So it was said to him, ‘This is your first ignorance. And have they (a.s.) ever been without a knowledgeable one?’ He said, ‘So who is their (a.s.) knowledgeable one today?’ It was said, ‘Muhammad (a.s.) Bin Ali (a.s.) Bin Al-Husayn Bin Ali (a.s.)’. He (the narrator) said, ‘So he rode over to him (a.s.) with the brave ones of his companions until he came up to Al-Medina. So he sought permission to see Abu Ja’far (a.s.). It was said to him (a.s.), ‘This is Abdullah Bin Naf’a’. He (a.s.) said; ‘So what has he to do with me (a.s.), and he ‘يَبْرَأُ’ distances himself (Tabarra) from me (a.s.) and from my (a.s.) father (a.s.) both morning and evening’. Abu Baseer Al-Kufy said to him (a.s.), ‘May I be sacrificed for you (a.s.), this one alleges that, ‘‘If only I knew someone between its (earth’s) diameter where my animal (ride) can reach to, who can debate with me that Ali (a.s.) killed the people of Naharwaan, and he (a.s.) was not unjust to them, I would ride over to him (to refute)’. So Abu Ja’far (a.s.) said to him: ‘You think he has come to me (a.s.) for a debate?’ He said, ‘Yes’. He (a.s.) said: ‘O boy (servant), go out and unload his saddlebag, and tell him to come to us (a.s.) tomorrow’. He (the narrator) said, ‘So when it was the next day, Abdullah Bin Naf’a came with the brave ones of his companions, and Abu Ja’far (a.s.) sent a message to all the sons of the Emigrants and the Helpers and gathered them. Then he (a.s.) came out to the people wearing two alluring robes and faced the people as if he (a.s.) was the moon in orbit. So he (a.s.) said: ‘The Praise is due to Allah (azwj), the Awarder of the positions, and the Attribute of the attributes, and the Director of the directions. The Praise is due to Allah (azwj) “<a href=\"/#/books/quran:2#h255\">[2:255]</a> slumber does not overtake Him nor sleep; whatever is in the heavens and whatever is in the earth is His” up to the end of the Verse. ‘And I (a.s.) testify that there is no god except for Allah (azwj), One, with no associates to Him (azwj). And I (a.s.) testify that Muhammad (saww) is His (azwj) servant, Chosen by Him (azwj) and Guided by Him (azwj) to be on the Straight Path. The Praise is due to Allah (azwj) Who Honoured us (a.s.) with the Prophet-hood and Favoured us by Al-Wilayah. O group of the sons of the Emigrants and the Helpers! The ones among you who have merits regarding Ali (a.s.) Bin Abu Talib (a.s.), so he should stand and narrate them’. So the people stood up, so they enumerated those merits. Abdullah said, ‘I am a narrator of these merits from them, but, subsequently the disbelief took place after the appointment of the two judges’. Then they ended up with the merits in the Hadeeth of Khyber: ‘I (saww) shall give the flag tomorrow to a man who loves Allah (azwj) and His (azwj) Messenger (saww), and Allah (azwj) and His (azwj) Messenger (saww) love him (a.s.). An attacking one, not a fleeing one who will not return until Allah (azwj) Grants victory upon his (a.s.) hands’. So Abu Ja’far (a.s.) said; ‘What do you say regarding this Hadeeth’. He said, ‘True. There is no doubt with regards to it, but disbelief took place afterwards’. So Abu Ja’far (a.s.) said to him: ‘May your mother be bereft of you! Inform me (a.s.) about Allah (azwj) Loving Ali (a.s.) Bin Abu Talib (a.s.) on the Day He (azwj) Loved him (a.s.) and He (azwj) Knew that he (a.s.) would be killing the people of Nahrwan, or did He (azwj) not Know?’ Ibn Naf’a said, ‘Repeat that for me’. So Abu Ja’far (a.s.) said to him: ‘Inform me (a.s.) about Allah (azwj), He (azwj) Loved Ali (a.s.) on the day that He (azwj) Loved him (a.s.), and He (azwj) Knew that he (a.s.) would be killing the people of Nahrwan, or did He (azwj) not Know?’ He said, ‘If I say, ‘No’, I would have blasphemed’. He (the narrator) said, ‘So he said, ‘He (azwj) had Known’. He (a.s.) said: ‘So did Allah (azwj) Love Ali (a.s.) to act in obedience to Him (azwj) or in disobedience to Him (azwj)?’ He (a.s.) said; ‘Upon his (a.s.) acting in obedience to Him (azwj)’. So Abu Ja’far (a.s.) said to him: ‘So stand up (and leave) for you have been defeated’. He stood up and he was saying, ‘Until the white thread becomes distinct from the black thread at dawn, Allah (azwj) Knows where He (azwj) should Make His (azwj) Message to be’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 515)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15233,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:48:13",
        "refs": {
          "Quran": [
            "/books/quran:2:255"
          ]
        },
        "text": [
          "14995- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ الْحُسَيْنِ بْنِ يَزِيدَ النَّوْفَلِيِّ عَنْ عَلِيِّ بْنِ دَاوُدَ الْيَعْقُوبِيِّ عَنْ عِيسَى بْنِ عَبْدِ اللَّهِ الْعَلَوِيِّ قَالَ وَ حَدَّثَنِي الْأُسَيْدِيُّ وَ مُحَمَّدُ بْنُ مُبَشِّرٍ أَنَّ عَبْدَ اللَّهِ بْنَ نَافِعٍ الْأَزْرَقَ كَانَ يَقُولُ لَوْ أَنِّي عَلِمْتُ أَنَّ بَيْنَ قُطْرَيْهَا أَحَداً تُبْلِغُنِي إِلَيْهِ الْمَطَايَا يَخْصِمُنِي أَنَّ عَلِيّاً قَتَلَ أَهْلَ النَّهْرَوَانِ وَ هُوَ لَهُمْ غَيْرُ ظَالِمٍ لَرَحَلْتُ إِلَيْهِ فَقِيلَ لَهُ وَ لَا وَلَدَهُ فَقَالَ أَ فِي وُلْدِهِ عَالِمٌ فَقِيلَ لَهُ هَذَا أَوَّلُ جَهْلِكَ وَ هُمْ يَخْلُونَ مِنْ عَالِمٍ قَالَ فَمَنْ عَالِمُهُمُ الْيَوْمَ قِيلَ مُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحُسَيْنِ بْنِ عَلِيٍّ (عليه السلام) ",
          "قَالَ فَرَحَلَ إِلَيْهِ فِي صَنَادِيدِ أَصْحَابِهِ حَتَّى أَتَى الْمَدِينَةَ فَاسْتَأْذَنَ عَلَى أَبِي جَعْفَرٍ (عليه السلام) فَقِيلَ لَهُ هَذَا عَبْدُ اللَّهِ بْنُ نَافِعٍ فَقَالَ وَ مَا يَصْنَعُ بِي وَ هُوَ يَبْرَأُ مِنِّي وَ مِنْ أَبِي طَرَفَيِ النَّهَارِ فَقَالَ لَهُ أَبُو بَصِيرٍ الْكُوفِيُّ جُعِلْتُ فِدَاكَ إِنَّ هَذَا يَزْعُمُ أَنَّهُ لَوْ عَلِمَ أَنَّ بَيْنَ قُطْرَيْهَا أَحَداً تُبْلِغُهُ الْمَطَايَا إِلَيْهِ يَخْصِمُهُ أَنَّ عَلِيّاً (عليه السلام) قَتَلَ أَهْلَ النَّهْرَوَانِ وَ هُوَ لَهُمْ غَيْرُ ظَالِمٍ لَرَحَلَ إِلَيْهِ فَقَالَ لَهُ أَبُو جَعْفَرٍ (عليه السلام) أَ تَرَاهُ جَاءَنِي مُنَاظِراً قَالَ نَعَمْ قَالَ يَا غُلَامُ اخْرُجْ فَحُطَّ رَحْلَهُ وَ قُلْ لَهُ إِذَا كَانَ الْغَدُ فَأْتِنَا ",
          "قَالَ فَلَمَّا أَصْبَحَ عَبْدُ اللَّهِ بْنُ نَافِعٍ غَدَا فِي صَنَادِيدِ أَصْحَابِهِ وَ بَعَثَ أَبُو جَعْفَرٍ (عليه السلام) إِلَى جَمِيعِ أَبْنَاءِ الْمُهَاجِرِينَ وَ الْأَنْصَارِ فَجَمَعَهُمْ ثُمَّ خَرَجَ إِلَى النَّاسِ فِي ثَوْبَيْنِ مُمَغَّرَيْنِ وَ أَقْبَلَ عَلَى النَّاسِ كَأَنَّهُ فِلْقَةُ قَمَرٍ فَقَالَ الْحَمْدُ لِلَّهِ مُحَيِّثِ الْحَيْثِ وَ مُكَيِّفِ الْكَيْفِ وَ مُؤَيِّنِ الْأَيْنِ الْحَمْدُ لِلَّهِ الَّذِي لَا تَأْخُذُهُ سِنَةٌ وَ لَا نَوْمٌ لَهُ مَا فِي السَّمَوَاتِ وَ مَا فِي الْأَرْضِ إِلَى آخِرِ الْآيَةِ وَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَشْهَدُ أَنَّ مُحَمَّداً (صلى الله عليه وآله) عَبْدُهُ وَ رَسُولُهُ اجْتَبَاهُ وَ هَدَاهُ إِلَى صِرَاطٍ مُسْتَقِيمٍ الْحَمْدُ لِلَّهِ الَّذِي أَكْرَمَنَا بِنُبُوَّتِهِ وَ اخْتَصَّنَا بِوَلَايَتِهِ",
          "يَا مَعْشَرَ أَبْنَاءِ الْمُهَاجِرِينَ وَ الْأَنْصَارِ مَنْ كَانَتْ عِنْدَهُ مَنْقَبَةٌ فِي عَلِيِّ بْنِ أَبِي طَالِبٍ (عليه السلام) فَلْيَقُمْ وَ لْيَتَحَدَّثْ قَالَ فَقَامَ النَّاسُ فَسَرَدُوا تِلْكَ الْمَنَاقِبَ فَقَالَ عَبْدُ اللَّهِ أَنَا أَرْوَى لِهَذِهِ الْمَنَاقِبِ مِنْ هَؤُلَاءِ وَ إِنَّمَا أَحْدَثَ عَلِيٌّ الْكُفْرَ بَعْدَ تَحْكِيمِهِ الْحَكَمَيْنِ حَتَّى انْتَهَوْا فِي الْمَنَاقِبِ إِلَى حَدِيثِ خَيْبَرَ لَأُعْطِيَنَّ الرَّايَةَ غَداً رَجُلًا يُحِبُّ اللَّهَ وَ رَسُولَهُ وَ يُحِبُّهُ اللَّهُ وَ رَسُولُهُ كَرَّاراً غَيْرَ فَرَّارٍ لَا يَرْجِعُ حَتَّى يَفْتَحَ اللَّهُ عَلَى يَدَيْهِ",
          "فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) مَا تَقُولُ فِي هَذَا الْحَدِيثِ فَقَالَ هُوَ حَقٌّ لَا شَكَّ فِيهِ وَ لَكِنْ أَحْدَثَ الْكُفْرَ بَعْدُ فَقَالَ لَهُ أَبُو جَعْفَرٍ (عليه السلام) ثَكِلَتْكَ أُمُّكَ أَخْبِرْنِي عَنِ اللَّهِ عَزَّ وَ جَلَّ أَحَبَّ عَلِيَّ بْنَ أَبِي طَالِبٍ يَوْمَ أَحَبَّهُ وَ هُوَ يَعْلَمُ أَنَّهُ يَقْتُلُ أَهْلَ النَّهْرَوَانِ أَمْ لَمْ يَعْلَمْ قَالَ ابْنُ نَافِعٍ أَعِدْ عَلَيَّ فَقَالَ لَهُ أَبُو جَعْفَرٍ (عليه السلام) أَخْبِرْنِي عَنِ اللَّهِ جَلَّ ذِكْرُهُ أَحَبَّ عَلِيَّ بْنَ أَبِي طَالِبٍ يَوْمَ أَحَبَّهُ وَ هُوَ يَعْلَمُ أَنَّهُ يَقْتُلُ أَهْلَ النَّهْرَوَانِ أَمْ لَمْ يَعْلَمْ قَالَ إِنْ قُلْتَ لَا كَفَرْتَ قَالَ فَقَالَ قَدْ عَلِمَ ",
          "قَالَ فَأَحَبَّهُ اللَّهُ عَلَى أَنْ يَعْمَلَ بِطَاعَتِهِ أَوْ عَلَى أَنْ يَعْمَلَ بِمَعْصِيَتِهِ فَقَالَ عَلَى أَنْ يَعْمَلَ بِطَاعَتِهِ فَقَالَ لَهُ أَبُو جَعْفَرٍ (عليه السلام) فَقُمْ مَخْصُوماً فَقَامَ وَ هُوَ يَقُولُ حَتَّى يَتَبَيَّنَ لَكُمُ الْخَيْطُ الْأَبْيَضُ مِنَ الْخَيْطِ الْأَسْوَدِ مِنَ الْفَجْرِ اللَّهُ أَعْلَمُ حَيْثُ يَجْعَلُ رِسَالَتَهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473681\">H 14995</a> – A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Al-Husayn Bin Yazeed Al-Nowfaly, from Ali Bin Dawood Al-Yaqouby, from Isa Bin Abdullah Al-Alawy who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span>t has been narrated</span> to me by Al-Asaydi and Muhammad Bin Basheer that Abdullah Bin Naf’a Al-Azraq used to say, ‘If only I knew someone between its (earth’s) diameter where my animal (ride) can reach to, who can debate with me that Ali<sup>asws</sup> killed the people of Naharwaan, and he<sup>asws</sup> was not unjust to them, I would ride over to him’ (to refute). So it was said to him, ‘And (what about his<sup>asws</sup> son<sup>asws</sup>)?’ He said, ‘Is his<sup>asws</sup> son<sup>asws</sup> a knowledgeable one?’ So it was said to him, ‘This is your first ignorance. And have they<sup>asws</sup> ever been without a knowledgeable one?’ He said, ‘So who is their<sup>asws</sup> knowledgeable one today?’ It was said, ‘Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> Bin Al-Husayn Bin Ali<sup>asws</sup>’. ",
            "He (the narrator) said, ‘So he rode over to him<sup>asws</sup> with the brave ones of his companions until he came up to Al-Medina. So he sought permission to see Abu Ja’far<sup>asws</sup>. It was said to him<sup>asws</sup>, ‘This is Abdullah Bin Naf’a’. He<sup>asws</sup> said; ‘So what has he to do with me<sup>asws</sup>, and he ‘يَبْرَأُ’ distances himself (Tabarra) from me<sup>asws</sup> and from my<sup>asws</sup> father<sup>asws</sup> both morning and evening’. Abu Baseer Al-Kufy said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>, this one alleges that, ‘‘If only I knew someone between its (earth’s) diameter where my animal (ride) can reach to, who can debate with me that Ali<sup>asws</sup> killed the people of Naharwaan, and he<sup>asws</sup> was not unjust to them, I would ride over to him (to refute)’. So Abu Ja’far<sup>asws</sup> said to him: ‘You think he has come to me<sup>asws</sup> for a debate?’ He said, ‘Yes’. He<sup>asws</sup> said: ‘O boy (servant), go out and unload his saddlebag, and tell him to come to us<sup>asws</sup> tomorrow’. ",
            "He (the narrator) said, ‘So when it was the next day, Abdullah Bin Naf’a came with the brave ones of his companions, and Abu Ja’far<sup>asws</sup> sent a message to all the sons of the Emigrants and the Helpers and gathered them. Then he<sup>asws</sup> came out to the people wearing two alluring robes and faced the people as if he<sup>asws</sup> was the moon in orbit. So he<sup>asws</sup> said: ‘The Praise is due to Allah<sup>azwj</sup>, the Awarder of the positions, and the Attribute of the attributes, and the Director of the directions. The Praise is due to Allah<sup>azwj</sup> <span class=\"ibTxt\">“<a href=\"/#/books/quran:2#h255\">[2:255]</a> slumber does not overtake Him nor sleep; whatever is in the heavens and whatever is in the earth is His”</span> up to the end of the Verse. ‘And I<sup>asws</sup> testify that there is no god except for Allah<sup>azwj</sup>, One, with no associates to Him<sup>azwj</sup>. And I<sup>asws</sup> testify that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant, Chosen by Him<sup>azwj</sup> and Guided by Him<sup>azwj</sup> to be on the Straight Path. The Praise is due to Allah<sup>azwj</sup> Who Honoured us<sup>asws</sup> with the Prophet-hood and Favoured us by Al-Wilayah.",
            "O group of the sons of the Emigrants and the Helpers! The ones among you who have merits regarding Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, so he should stand and narrate them’. So the people stood up, so they enumerated those merits. Abdullah said, ‘I am a narrator of these merits from them, but, subsequently the disbelief took place after the appointment of the two judges’. Then they ended up with the merits in the Hadeeth of Khyber: ‘I<sup>saww</sup> shall give the flag tomorrow to a man who loves Allah<sup>azwj</sup> and His<sup>azwj</sup> Messenger<sup>saww</sup>, and Allah<sup>azwj</sup> and His<sup>azwj</sup> Messenger<sup>saww</sup> love him<sup>asws</sup>. An attacking one, not a fleeing one who will not return until Allah<sup>azwj</sup> Grants victory upon his<sup>asws</sup> hands’.  ",
            "So Abu Ja’far<sup>asws</sup> said; ‘What do you say regarding this Hadeeth’. He said, ‘True. There is no doubt with regards to it, but disbelief took place afterwards’. So Abu Ja’far<sup>asws</sup> said to him: ‘May your mother be bereft of you! Inform me<sup>asws</sup> about Allah<sup>azwj</sup> Loving Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> on the Day He<sup>azwj</sup> Loved him<sup>asws</sup> and He<sup>azwj</sup> Knew that he<sup>asws</sup> would be killing the people of Nahrwan, or did He<sup>azwj</sup> not Know?’ Ibn Naf’a said, ‘Repeat that for me’. So Abu Ja’far<sup>asws</sup> said to him: ‘Inform me<sup>asws</sup> about Allah<sup>azwj</sup>, He<sup>azwj</sup> Loved Ali<sup>asws</sup> on the day that He<sup>azwj</sup> Loved him<sup>asws</sup>, and He<sup>azwj</sup> Knew that he<sup>asws</sup> would be killing the people of Nahrwan, or did He<sup>azwj</sup> not Know?’ He said, ‘If I say, ‘No’, I would have blasphemed’. He (the narrator) said, ‘So he said, ‘He<sup>azwj</sup> had Known’.  ",
            "He<sup>asws</sup> said: ‘So did Allah<sup>azwj</sup> Love Ali<sup>asws</sup> to act in obedience to Him<sup>azwj</sup> or in disobedience to Him<sup>azwj</sup>?’ He<sup>asws</sup> said; ‘Upon his<sup>asws</sup> acting in obedience to Him<sup>azwj</sup>’. So Abu Ja’far<sup>asws</sup> said to him: ‘So stand up (and leave) for you have been defeated’. He stood up and he was saying, ‘Until the white thread becomes distinct from the black thread at dawn, Allah<sup>azwj</sup> Knows where He<sup>azwj</sup> should Make His<sup>azwj</sup> Message to be’. "
          ],
          "en.sarwar": [
            "549. Ahmad Bin Muhammad, And Ali Bin Muhammad, together from Ali Bin Al-Hassan Al-Taymi, from Muhammad Bin Al-Khataab Al-Wasity, from Yunus Bin Abdul Rahman, from Ahmad Bin Umar Al-Halby, from hammad Al-Azdy, from Hisham Al-Khaffaf who said: Abu Abdullah (a.s.) said to me: ‘How is your insight into the stars (astrology)?’ I said, ‘There is no one left in Iraq with more insight into the stars than I’. So he (a.s.) said; ‘How is the rotation of the ‘الْفَلَكِ’ universe in accordance to you?’ So I took off my cap from my head and rotated it. (Imam (a.s.) said) ‘If the matter was as you are saying it to be, so what do you make of Al-Na’ash, and Al-Jaday, and Al-Faqadayn? They are not being seen to rotate in a day from the time in the direction?’ I said, ‘By Allah (azwj), this is something that I do not understand, not had I heard anyone from the people of the calculation mention it’. So he (a.s.) said to me: ‘What is the proportion of light of Al-Sukayna from Al-Zuhra Venus)?’ I said, ‘By Allah (azwj), this is a star which I have not heard of, nor have I heard anyone from the people mentioning it’. So he (a.s.) said; ‘Glory be to Allah (azwj)! So you have dropped (ignored) a whole star, so what is your calculation based upon?’ Then (Imam (a.s.)) said: ‘So what is the proportion of illumination of Al-Zuhra (Venus) from the moon is?’ I said, ‘This is a thing which no one knows except Allah (azwj) Mighty and Majestic’. He (a.s.) said; ‘So what is the proportion of the moon from the sun in its illumination?’ I said, ‘I do not know this’. He (a.s.) said; ‘You speak the truth’. Then said: ‘So what about the two armies which meet each other in accordance to this calculation, and in accordance to that calculation, and the calculator of this one calculated victory for this army, and the calculator of that one calculated victory for that army, then the two of them met, so one of them defeats the other, so now where would be the bad luck?’ I said, ‘By Allah (azwj), I do not know that’. He (a.s.) said: ‘You speak the truth. The origin of the calculation is true, but no one knows that except the one who knows the birth of creatures, all of them’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 517)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15234,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:48:14",
        "text": [
          "14996- أَحْمَدُ بْنُ مُحَمَّدٍ وَ عَلِيُّ بْنُ مُحَمَّدٍ جَمِيعاً عَنْ عَلِيِّ بْنِ الْحَسَنِ التَّيْمِيِّ عَنْ مُحَمَّدِ بْنِ الْخَطَّابِ الْوَاسِطِيِّ عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَحْمَدَ بْنِ عُمَرَ الْحَلَبِيِّ عَنْ حَمَّادٍ الْأَزْدِيِّ عَنْ هِشَامٍ الْخَفَّافِ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ (عليه السلام) كَيْفَ بَصَرُكَ بِالنُّجُومِ قَالَ قُلْتُ مَا خَلَّفْتُ بِالْعِرَاقِ أَبْصَرَ بِالنُّجُومِ مِنِّي فَقَالَ كَيْفَ دَوَرَانُ الْفَلَكِ عِنْدَكُمْ قَالَ فَأَخَذْتُ قَلَنْسُوَتِي عَنْ رَأْسِي فَأَدَرْتُهَا قَالَ فَقَالَ إِنْ كَانَ الْأَمْرُ عَلَى مَا تَقُولُ فَمَا بَالُ بَنَاتِ النَّعْشِ وَ الْجَدْيِ وَ الْفَرْقَدَيْنِ لَا يُرَوْنَ يَدُورُونَ يَوْماً مِنَ الدَّهْرِ فِي الْقِبْلَةِ قَالَ قُلْتُ هَذَا وَ اللَّهِ شَيْ‏ءٌ لَا أَعْرِفُهُ وَ لَا سَمِعْتُ أَحَداً مِنْ أَهْلِ الْحِسَابِ يَذْكُرُهُ فَقَالَ لِي كَمِ السُّكَيْنَةُ مِنَ الزُّهَرَةِ جُزْءاً فِي ضَوْئِهَا قَالَ قُلْتُ هَذَا وَ اللَّهِ نَجْمٌ مَا سَمِعْتُ بِهِ وَ لَا سَمِعْتُ أَحَداً مِنَ النَّاسِ يَذْكُرُهُ فَقَالَ سُبْحَانَ اللَّهِ فَأَسْقَطْتُمْ نَجْماً بِأَسْرِهِ فَعَلَى مَا تَحْسُبُونَ ",
          "ثُمَّ قَالَ فَكَمِ الزُّهَرَةُ مِنَ الْقَمَرِ جُزْءاً فِي ضَوْئِهِ قَالَ قُلْتُ هَذَا شَيْ‏ءٌ لَا يَعْلَمُهُ إِلَّا اللَّهُ عَزَّ وَ جَلَّ قَالَ فَكَمِ الْقَمَرُ جُزْءاً مِنَ الشَّمْسِ فِي ضَوْئِهَا قَالَ قُلْتُ مَا أَعْرِفُ هَذَا قَالَ صَدَقْتَ ثُمَّ قَالَ مَا بَالُ الْعَسْكَرَيْنِ يَلْتَقِيَانِ فِي هَذَا حَاسِبٌ وَ فِي هَذَا حَاسِبٌ فَيَحْسُبُ هَذَا لِصَاحِبِهِ بِالظَّفَرِ وَ يَحْسُبُ هَذَا لِصَاحِبِهِ بِالظَّفَرِ ثُمَّ يَلْتَقِيَانِ فَيَهْزِمُ أَحَدُهُمَا الْآخَرَ فَأَيْنَ كَانَتِ النُّحُوسُ قَالَ فَقُلْتُ لَا وَ اللَّهِ مَا أَعْلَمُ ذَلِكَ قَالَ فَقَالَ صَدَقْتَ إِنَّ أَصْلَ الْحِسَابِ حَقٌّ وَ لَكِنْ لَا يَعْلَمُ ذَلِكَ إِلَّا مَنْ عَلِمَ مَوَالِيدَ الْخَلْقِ كُلِّهِمْ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473682\">H 14996</a> – Ahmad Bin Muhammad, And Ali Bin Muhammad, together from Ali Bin Al-Hassan Al-Taymi, from Muhammad Bin Al-Khataab Al-Wasity, from Yunus Bin Abdul Rahman, from Ahmad Bin Umar Al-Halby, from hammad Al-Azdy, from Hisham Al-Khaffaf who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said to me: ‘How is your insight into the stars (astrology)?’ I said, ‘There is no one left in Iraq with more insight into the stars than I’. So he<sup>asws</sup> said; ‘How is the rotation of the ‘الْفَلَكِ’ universe in accordance to you?’ So I took off my cap from my head and rotated it. (Imam<sup>asws</sup> said) ‘If the matter was as you are saying it to be, so what do you make of Al-Na’ash, and Al-Jaday, and Al-Faqadayn? They are not being seen to rotate in a day from the time in the direction?’ I said, ‘By Allah<sup>azwj</sup>, this is something that I do not understand, not had I heard anyone from the people of the calculation mention it’. So he<sup>asws</sup> said to me: ‘What is the proportion of light of Al-Sukayna from Al-Zuhra Venus)?’ I said, ‘By Allah<sup>azwj</sup>, this is a star which I have not heard of, nor have I heard anyone from the people mentioning it’. So he<sup>asws</sup> said; ‘Glory be to Allah<sup>azwj</sup>! So you have dropped (ignored) a whole star, so what is your calculation based upon?’ ",
            "Then (Imam<sup>asws</sup>) said: ‘So what is the proportion of illumination of Al-Zuhra (Venus) from the moon is?’ I said, ‘This is a thing which no one knows except Allah<sup>azwj</sup> Mighty and Majestic’. He<sup>asws</sup> said; ‘So what is the proportion of the moon from the sun in its illumination?’ I said, ‘I do not know this’. He<sup>asws</sup> said; ‘You speak the truth’. Then said: ‘So what about the two armies which meet each other in accordance to this calculation, and in accordance to that calculation, and the calculator of this one calculated victory for this army, and the calculator of that one calculated victory for that army, then the two of them met, so one of them defeats the other, so now where would be the bad luck?’ I said, ‘By Allah<sup>azwj</sup>, I do not know that’. He<sup>asws</sup> said: ‘You speak the truth. The origin of the calculation is true, but no one knows that except the one who knows the birth of creatures, all of them’. ",
            "out of 567"
          ],
          "en.sarwar": [
            "550. Ali Bin Al-Hassan Al-Mowdab, from Ahmad Bin Muhammad Bin Khalid and Ahmad Bin Muhammad, from Ali Bin Al-Hassan Al-Taymi together, from Ismail Bin Mahran who said, ‘Narrated to me Abdullah Al-Haris, from Jabir, who has narrated the following: Abu Ja’far (a.s.) has said: ‘Amir-ul-Momineen (a.s.) gave a sermon to the people at Siffeen, so he (a.s.) Praised Allah (azwj) and Extolled Him (azwj), and sent greetings upon the Prophet (saww), then said: ‘Having said that, Allah (azwj) the High has Made my (a.s.) rights to be obligatory upon you all as the Guardian of your matters (Wali-ul-Amr) and my (a.s.) status which Allah (azwj) Revealed for you, and similarly you have rights upon me (a.s.) as I (a.s.) have upon you. And the right is the most beautiful of the things in description; and most expansive in sharing. There is no other thing which is applied on one’s favour without being applied against him and it is not applied against him unless it is applied in his favour. The only one for whom it flows for and does not flow against is Allah (azwj) Mighty and Majestic only apart from His (azwj) creatures, for He (azwj) is Powerful over His (azwj) servants, and His (azwj) Justice regarding everything that He (azwj) Judges. But He (azwj) Made His (azwj) Rights upon the servants that they should be obedient to Him (azwj), and Made expiation against them by the good Rewards as Grace from Him (azwj), and the prolonged Generosity, and Expanding by increasing it for the one who is deserving of it. Then He (azwj) Made from His (azwj) ‘حُقُوقِهِ’ Rights, certain rights to be obligated for some people upon some other people. So He (azwj) Made it such that it obligates some of them for the others and does not obligate some except by the others. So the greatest of what Allah (azwj) has Necessitated from these rights is the rights of the governor upon the citizens and the rights of the citizens upon the governor, an obligation which Allah (azwj) has Obligated upon one and all. So He (azwj) has Made it to be a system for them and as strength for their Religion, and the establishment of the true Sunnah among them. The citizens will not be corrected except by the governor being correct, nor will the governor be correct except by the integrity of the citizens. So if the citizens fulfil the rights to the governor and the governor fulfils their rights as well, the truth will be strengthened between them. The manifesto of the Religion would be established, and the landmarks of justice would find fairness, and the Sunnah would flow smoothly. That would make life prosperous, and they would yearn for the survival of the government, and the enemies would despair from their ambitions. And if the citizens overcome the governor and the governor seeks to overcome them that are where the differences of speech emerge. The yearning of tyranny appears, and abundance of the lawlessness in the Religion, and the landmarks of the Sunnah are left. So they act by the desires, effects vanish, and illnesses of the souls abound. There is no fear of the penalties for infringement of the Laws, nor does confronting the falsehood seem great. So that is where the humiliation of the righteous and the honour for the evil ones is, and the ruination of the cities, and the greater the consequences will be for the servants in the presence of Allah (azwj) Mighty and Majestic. So come, o you people, to the co-operation to the obedience to Allah (azwj) Mighty and Majestic, and the establishment by His (azwj) Justice, and the loyalty to His (azwj) Covenant, and the fairness to Him (azwj) is all of His (azwj) Rights, for there is nothing more needed for the servants than for advising with regards to that, and the beautiful co-operation to Him (azwj), and there is no one who intensifies his passion for striving for the Pleasure of Allah (azwj) to be able to reach its deserving point of fulfilling the Rights to Allah (azwj). But, from the obligatory Rights of Allah (azwj) Mighty and Majestic, upon the servants is the advice to each other with maximum efforts, and the co-operation upon the establishment of the truth among them. Then there is person, no matter how great his status regarding the truth, how magnified his preference regarding the truth is, would not be needless from the co-operation upon what Allah (azwj) Mighty and Majestic has Burdened him with from His (azwj) Rights. And there is no person, no matter how low he is in the affairs, and the eyes are looking down upon him, can remain without being helped upon or given support. And the people of the merits and the people of the Favours are more frequently in need of that, and everyone is in need of Allah (azwj) Mighty and Majestic equally’. A man from his (a.s.) army answered him (a.s.). No one knew who he was and it is said that he had never been seen in his (a.s.) army before that day, nor was he seen after it. So he stood up and beautifully Extolled Allah (azwj) Mighty and Majestic by what the afflictions He (azwj) had Placed upon them, and His (azwj) Favours from the Obligation of His (azwj) rights against them, and accepted all what had been mentioned of the changing conditions with him (a.s.) and with them. Then said, ‘You (a.s.) are our Commander, and we are your (a.s.) citizens. It is by you (a.s.) that Allah (azwj) Brought us out of the humiliation and it is by your (a.s.) strength that He (azwj) Freed His (azwj) servant from the chains. So choose for us, and we will go by your (a.s.) choice, and make a plan and we would go by your (a.s.) plan, for you (a.s.) are a truthful speaker, and the successful ruler, and the authorised king. It is not permissible for us to disobey you (a.s.) in anything, nor do we compare our knowledge with your (a.s.) knowledge. You (a.s.) are great in regard to that choice, in our eyes, and your (a.s.) virtues are majestic within us’. So Amir-ul-Momineen (a.s.) answered him saying: ‘It is from the Rights that the one who Magnifies the Majesty of Allah (azwj) within himself and exalts His (azwj) position in his heart, everything else would seem little to him. And the one most deserving to be like that is the one to whom the Bounties of Allah (azwj) are great as well as His (azwj) Kind Favours to him, for no one would magnify the Bounties of Allah (azwj) except that the Rights of Allah (azwj) Increase upon him. And the lowest of the conditions of the governor in the presence of the righteous people is when he thinks of the love for pride and bases his affairs upon the arrogance, and I (a.s.) did not like to become lost in your thoughts that I (a.s.) would love the praise and listening to the praise. And I (a.s.) am not like that. Thanks be to Allah (azwj). And had I (a.s.) loved what you said, I (a.s.) would have abandoned it due to it lowering me (a.s.) for the Sake of Allah (azwj) that I (a.s.) should take to magnificence and greatness when He (azwj) is more deserving of it. Maybe the people consider it sweet to be praised after the affliction. So do not praise me (a.s.) with beautiful praises as it may take my (a.s.) soul out from being for the Sake of Allah (azwj), and the remainder of the rights which I (a.s.) have yet to fulfill and the obligations which I (a.s.) have yet to perform. So, do not speak to me (a.s.) as you speak to the tyrants, and do not have reservations from me (a.s.) like you have reservations in the presence of the unresponsive people, and do not flatter me (a.s.), and do not think that I (a.s.) consider it heavy regarding the right which is said to me (a.s.), or that I (a.s.) seek self-greatness, for it is not correct for me (a.s.). So the one who considers the rights to be a burden if they are told to him, or the justice if it is presented to him, it would become heavier for him to act in accordance with these two. So do not withhold from me (a.s.) speaking about the rights, or consultation with justice, for I (a.s.) not, with regards to myself (a.s.), above mistakes, nor do I (a.s.) feel secure from that in my (a.s.) deeds except if Allah (azwj) Suffices for myself (a.s.) in matter which He (azwj) has more Control over than what I (a.s.) have. But rather, I (a.s.) and you all are servants, belonging to the Lord (azwj). There is no lord apart from Him (azwj). He (azwj) Owns us what we do not own ourselves, and Took us out from what we used to be in to be in a situation which was correct for us. So He (azwj) Protected us after straying, by the Guidance. He (azwj) Gave us the vision after the blindness. So, the man who answered him (a.s.) before, answered him (a.s.), ‘By Allah (azwj), you (a.s.) are deserving of what I said. By Allah (azwj), you (a.s.) are more deserving than what I said, for His (azwj) Favours are such that we cannot deny, and Allah (azwj) Blessed and High has Burdened you (a.s.) with our citizens, and the Guardianship of our political affairs. So you (a.s.) have become (a representative of) our knowledge with which we can be guided by, and our Imam (a.s.) whom we follow, and every matter of yours (a.s.) is guidance, and every word of yours (a.s.) is educational. Our eyes have found delight with you (a.s.) in our lives, and our hearts are filled with bliss by you (a.s.), and we are amazed at the qualities, which are within you (a.s.) and our intellects are at a loss to describe. We are not saying to you (a.s.), ‘O you (a.s.) righteous Imam (a.s.) as a purification for you (a.s.), nor are we exaggerating in our intentions regarding our praising you (a.s.). And we are not becoming critical of your (a.s.) conviction, or the purity of your (a.s.) Religion, so we have no fear that you (a.s.) would innovate by the Bounties of Allah (azwj) Blessed and High, or be tyrannical, or that arrogance should enter you (a.s.), but we are saying to you (a.s.) what we said in order to be closer to Allah (azwj) Mighty and Majestic by revering you (a.s.), and Enhancing your (a.s.) merits, and appreciate the greatness of your (a.s.) command. So consider yourself (a.s.) and use, and give preference to the Command of Allah (azwj) over yourself (a.s.) and over us, for we are obedient with regards to whatever you (a.s.) order us for, and we submit to the commands along with that regarding what is beneficial for us’. Amir-ul-Momineen (a.s.) answered him, so he (a.s.) said: ‘And I (a.s.) am binding you in the Presence of Allah (azwj) to myself (a.s.) for your knowing that I (a.s.) am the guardian for your matters, for very shortly you will be gathered with me (a.s.). And I (a.s.) warn you of the Pausing in front of Him (azwj), and the Questioning about what we were in, then some of us will testify against the others, so do not testify today against what you will be testifying tomorrow, for there is nothing hidden from Allah (azwj) Mighty and Majestic, nor is it permitted in His (azwj) Presence except for the good advice of the chests in all of the matters’. So the man answered him (a.s.), and it was said that the man was never seen again after this speech of his to Amir-ul-Momineen (a.s.), and he was bursting with emotion in his chest, and he spoke, and wailed which cut off his speech, and was anxious and choking, breaking his voice, being at the verge of collapse. So he Praised Allah (azwj) and Extolled Him (azwj), then pleaded before Him (azwj) of the horrors of what he had been cured of, from the great dangers, and the prolonged humiliation regarding the mischief to take place during his (a.s.) era, and the rebellions against him (a.s.) and the cutting off of what was from his (a.s.) government. Then he implored the matter to Allah (azwj) Mighty and Majestic of the Bestowing of Favours on him (a.s.), and the Dispelling (dangers) from him (a.s.), and then Extolled Him (azwj) in a goodly manner. So he said, ‘O Lord (azwj) of the servants, and O Giver of tranquillity to the cities! How can we speak of Your (azwj) Grace, and how can we reach Your (azwj) Attributes from Your (azwj) Actions, and for me to reach the reality of the beauty of Your (azwj) Praise, or count the beauty of Your (azwj) Favours. So how can we, and it is due to you (a.s.) that the Bounties of Allah (azwj) have flowed towards us, and it is upon your (a.s.) hands that the causes of the good have arrived to us. Did you (a.s.) not become a sanctuary for the lowest of the low, and a saviour for the disobedient infidels? So by whom, except for the People (a.s.) of your (a.s.) Household, and by you (a.s.) that Allah (azwj) Mighty and Majestic Took us out from horrors of those dangers, and by whom did he (azwj) Rescue us from the thrones of distress, and by whom except by you (a.s.) did Allah (azwj) Make apparent the landmarks of our Religion, and Corrected what was spoilt from our Religion until we came to be mentioned, after the tyranny. And our eyes were delighted with a prosperous life when you (a.s.) became our Guardian as a favour to us, and you (a.s.) struggled and fulfilled to us all of your (a.s.) promises, and stood by all of your (a.s.) oaths to us. So you (a.s.) were a witness for the ones who were absent from us, and a successor of the People (a.s.) of the Household for us. And you (a.s.) were the strength of our weak ones, and the wealth of our poor ones, and a pillar for our great ones. It was your (a.s.) justice that brought us together in the matters, and accommodated us regarding the truth by your (a.s.) patience. You (a.s.) were, for us a familiarity if we saw you (a.s.), and a tranquillity whenever we mentioned you (a.s.). So which is the good deed, which you (a.s.) did not perform, and which is the righteous deeds which you (a.s.) did not act upon? And had it not been for the matter which we fear for you (a.s.) from it reaching you, which our efforts could change, and our strengths could defend you (a.s.) from it, we would be permitted to sacrifice ourselves for your (a.s.) defence, and repulse it from you (a.s.) by ourselves and our sons, we would put ourselves and our sons before you (a.s.). And we would make this choice, and reduce its danger from you (a.s.), and we would stand in our efforts in an attempt to defend you (a.s.) from your (a.s.) enemies. But He (azwj) is an Authority, which cannot be stopped, and a Strength which cannot decline, and a Lord (azwj) Who cannot be overcome. So if he (azwj) was to Bestow a Favour to us by Bestowing upon you (a.s.) good health, and be Merciful towards us by Keeping you (a.s.) alive, and be Compassionate to us by Relieving you (a.s.) of these difficulties from your (a.s.) situation to Keep you (a.s.) safe for us, and remain with us in front of us, we would narrate appreciation to Allah (azwj) Mighty and Majestic for that, and Magnify Him (azwj), and Mention Him (azwj) constantly, and distribute half of our wealth as charity, and free half of our slaves, and narrate to Him (azwj) with humbleness in our selves, and be submissive in all of our affairs. And when He (azwj) Takes you to the Gardens, and Makes to Flow for you (a.s.) that which is inevitable, so no one would be able to change that which He (azwj) has Ordained, nor repulse from you (a.s.) His (azwj) Favours, nor will our hearts be opposed to that for that which He (azwj) has Chosen for you (a.s.) of what is with Him (azwj) over what you (a.s.) used to be in. But, we would weep if this authority (government) were to return back to humiliation, and for the Religion and the world to be consumed and we do not see for you (a.s.) a successor we can take our complaints to, nor a similar government we can have hope in establishing it’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:48",
  "kind": "verse_list"
}