{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 8"}, "path": "/books/al-kafi:8", "titles": {"ar": "الجزء الثامن‏", "en": "Volume Eight"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:8:1", "titles": {"ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;", "en": "The Book - Garden (of Flowers)"}}, {"indexed_titles": {"en": "Chapter 49"}, "path": "/books/al-kafi:8:1:49", "titles": {"ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )", "en": "A SERMON OF AMIR-UL-MOMINEEN<sup>asws</sup>"}}], "index": 2310, "local_index": 49, "part_type": "Chapter", "path": "/books/al-kafi:8:1:49", "titles": {"ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )", "en": "A SERMON OF AMIR-UL-MOMINEEN<sup>asws</sup>"}, "verse_count": 1, "verse_start_index": 15223, "verses": [{"index": 15224, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:8:1:49:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14997</span>- عَلِيُّ بْنُ الْحَسَنِ</span> الْمُؤَدِّبُ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ وَ أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَسَنِ التَّيْمِيِّ جَمِيعاً عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ الْحَارِثِ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ خَطَبَ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) النَّاسَ بِصِفِّينَ فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ وَ صَلَّى عَلَى مُحَمَّدٍ النَّبِيِّ (صلى الله عليه وآله) ثُمَّ قَالَ أَمَّا بَعْدُ فَقَدْ جَعَلَ اللَّهُ تَعَالَى لِي عَلَيْكُمْ حَقّاً بِوَلَايَةِ أَمْرِكُمْ وَ مَنْزِلَتِيَ الَّتِي أَنْزَلَنِي اللَّهُ عَزَّ ذِكْرُهُ بِهَا مِنْكُمْ وَ لَكُمْ عَلَيَّ مِنَ الْحَقِّ مِثْلُ الَّذِي لِي عَلَيْكُمْ \nوَ الْحَقُّ أَجْمَلُ الْأَشْيَاءِ فِي التَّوَاصُفِ وَ أَوْسَعُهَا فِي التَّنَاصُفِ لَا يَجْرِي لِأَحَدٍ إِلَّا جَرَى عَلَيْهِ وَ لَا يَجْرِي عَلَيْهِ إِلَّا جَرَى لَهُ وَ لَوْ كَانَ لِأَحَدٍ أَنْ يَجْرِيَ ذَلِكَ لَهُ وَ لَا يَجْرِيَ عَلَيْهِ لَكَانَ ذَلِكَ لِلَّهِ عَزَّ وَ جَلَّ خَالِصاً دُونَ خَلْقِهِ لِقُدْرَتِهِ عَلَى عِبَادِهِ وَ لِعَدْلِهِ فِي كُلِّ مَا جَرَتْ عَلَيْهِ ضُرُوبُ قَضَائِهِ وَ لَكِنْ جَعَلَ حَقَّهُ عَلَى الْعِبَادِ أَنْ يُطِيعُوهُ وَ جَعَلَ كَفَّارَتَهُمْ عَلَيْهِ بِحُسْنِ الثَّوَابِ تَفَضُّلًا مِنْهُ وَ تَطَوُّلًا بِكَرَمِهِ وَ تَوَسُّعاً بِمَا هُوَ مِنَ الْمَزِيدِ لَهُ أَهْلًا \nثُمَّ جَعَلَ مِنْ حُقُوقِهِ حُقُوقاً فَرَضَهَا لِبَعْضِ النَّاسِ عَلَى بَعْضٍ فَجَعَلَهَا تَتَكَافَى فِي وُجُوهِهَا وَ يُوجِبُ بَعْضُهَا بَعْضاً وَ لَا يُسْتَوْجَبُ بَعْضُهَا إِلَّا بِبَعْضٍ فَأَعْظَمُ مِمَّا افْتَرَضَ اللَّهُ تَبَارَكَ وَ تَعَالَى مِنْ تِلْكَ الْحُقُوقِ حَقُّ الْوَالِي عَلَى الرَّعِيَّةِ وَ حَقُّ الرَّعِيَّةِ عَلَى الْوَالِي فَرِيضَةٌ فَرَضَهَا اللَّهُ عَزَّ وَ جَلَّ لِكُلٍّ عَلَى كُلٍّ فَجَعَلَهَا نِظَامَ أُلْفَتِهِمْ وَ عِزّاً لِدِينِهِمْ وَ قِوَاماً لِسُنَنِ الْحَقِّ فِيهِمْ فَلَيْسَتْ تَصْلُحُ الرَّعِيَّةُ إِلَّا بِصَلَاحِ الْوُلَاةِ وَ لَا تَصْلُحُ الْوُلَاةُ إِلَّا بِاسْتِقَامَةِ الرَّعِيَّةِ \nفَإِذَا أَدَّتِ الرَّعِيَّةُ إِلَى الْوَالِي حَقَّهُ وَ أَدَّى إِلَيْهَا الْوَالِي كَذَلِكَ عَزَّ الْحَقُّ بَيْنَهُمْ فَقَامَتْ مَنَاهِجُ الدِّينِ وَ اعْتَدَلَتْ مَعَالِمُ الْعَدْلِ وَ جَرَتْ عَلَى أَذْلَالِهَا السُّنَنُ فَصَلَحَ بِذَلِكَ الزَّمَانُ وَ طَابَ بِهِ الْعَيْشُ وَ طُمِعَ فِي بَقَاءِ الدَّوْلَةِ وَ يَئِسَتْ مَطَامِعُ الْأَعْدَاءِ وَ إِذَا غَلَبَتِ الرَّعِيَّةُ وَالِيَهُمْ وَ عَلَا الْوَالِي الرَّعِيَّةَ اخْتَلَفَتْ هُنَالِكَ الْكَلِمَةُ وَ ظَهَرَتْ مَطَامِعُ الْجَوْرِ وَ كَثُرَ الْإِدْغَالُ فِي الدِّينِ وَ تُرِكَتْ مَعَالِمُ السُّنَنِ فَعُمِلَ بِالْهَوَى وَ عُطِّلَتِ الْآثَارُ وَ كَثُرَتْ عِلَلُ النُّفُوسِ وَ لَا يُسْتَوْحَشُ لِجَسِيمِ حَدٍّ عُطِّلَ وَ لَا لِعَظِيمِ بَاطِلٍ أُثِّلَ فَهُنَالِكَ تَذِلُّ الْأَبْرَارُ وَ تَعِزُّ الْأَشْرَارُ وَ تَخْرَبُ الْبِلَادُ وَ تَعْظُمُ تَبِعَاتُ اللَّهِ عَزَّ وَ جَلَّ عِنْدَ الْعِبَادِ \nفَهَلُمَّ أَيُّهَا النَّاسُ إِلَى التَّعَاوُنِ عَلَى طَاعَةِ اللَّهِ عَزَّ وَ جَلَّ وَ الْقِيَامِ بِعَدْلِهِ وَ الْوَفَاءِ بِعَهْدِهِ وَ الْإِنْصَافِ لَهُ فِي جَمِيعِ حَقِّهِ فَإِنَّهُ لَيْسَ الْعِبَادُ إِلَى شَيْ‏ءٍ أَحْوَجَ مِنْهُمْ إِلَى التَّنَاصُحِ فِي ذَلِكَ وَ حُسْنِ التَّعَاوُنِ عَلَيْهِ وَ لَيْسَ أَحَدٌ وَ إِنِ اشْتَدَّ عَلَى رِضَا اللَّهِ حِرْصُهُ وَ طَالَ فِي الْعَمَلِ اجْتِهَادُهُ بِبَالِغٍ حَقِيقَةَ مَا أَعْطَى اللَّهُ مِنَ الْحَقِّ أَهْلَهُ وَ لَكِنْ مِنْ وَاجِبِ حُقُوقِ اللَّهِ عَزَّ وَ جَلَّ عَلَى الْعِبَادِ النَّصِيحَةُ لَهُ بِمَبْلَغِ جُهْدِهِمْ وَ التَّعَاوُنُ عَلَى إِقَامَةِ الْحَقِّ فِيهِمْ \nثُمَّ لَيْسَ امْرُؤٌ وَ إِنْ عَظُمَتْ فِي الْحَقِّ مَنْزِلَتُهُ وَ جَسُمَتْ فِي الْحَقِّ فَضِيلَتُهُ بِمُسْتَغْنٍ عَنْ أَنْ يُعَانَ عَلَى مَا حَمَّلَهُ اللَّهُ عَزَّ وَ جَلَّ مِنْ حَقِّهِ وَ لَا لِامْرِئٍ مَعَ ذَلِكَ خَسَأَتْ بِهِ الْأُمُورُ وَ اقْتَحَمَتْهُ الْعُيُونُ بِدُونِ مَا أَنْ يُعِينَ عَلَى ذَلِكَ وَ يُعَانَ عَلَيْهِ وَ أَهْلُ الْفَضِيلَةِ فِي الْحَالِ وَ أَهْلُ النِّعَمِ الْعِظَامِ أَكْثَرُ فِي ذَلِكَ حَاجَةً وَ كُلٌّ فِي الْحَاجَةِ إِلَى اللَّهِ عَزَّ وَ جَلَّ شَرَعٌ سَوَاءٌ\nفَأَجَابَهُ رَجُلٌ مِنْ عَسْكَرِهِ لَا يُدْرَى مَنْ هُوَ وَ يُقَالُ إِنَّهُ لَمْ يُرَ فِي عَسْكَرِهِ قَبْلَ ذَلِكَ الْيَوْمِ وَ لَا بَعْدَهُ فَقَامَ وَ أَحْسَنَ الثَّنَاءَ عَلَى اللَّهِ عَزَّ وَ جَلَّ بِمَا أَبْلَاهُمْ وَ أَعْطَاهُمْ مِنْ وَاجِبِ حَقِّهِ عَلَيْهِمْ وَ الْإِقْرَارِ بِكُلِّ مَا ذَكَرَ مِنْ تَصَرُّفِ الْحَالَاتِ بِهِ وَ بِهِمْ ثُمَّ قَالَ أَنْتَ أَمِيرُنَا وَ نَحْنُ رَعِيَّتُكَ بِكَ أَخْرَجَنَا اللَّهُ عَزَّ وَ جَلَّ مِنَ الذُّلِّ وَ بِإِعْزَازِكَ أَطْلَقَ عِبَادَهُ مِنَ الْغُلِّ فَاخْتَرْ عَلَيْنَا وَ أَمْضِ اخْتِيَارَكَ وَ ائْتَمِرْ فَأَمْضِ ائْتِمَارَكَ فَإِنَّكَ الْقَائِلُ الْمُصَدَّقُ وَ الْحَاكِمُ الْمُوَفَّقُ وَ الْمَلِكُ الْمُخَوَّلُ لَا نَسْتَحِلُّ فِي شَيْ‏ءٍ مَعْصِيَتَكَ وَ لَا نَقِيسُ عِلْماً بِعِلْمِكَ يَعْظُمُ عِنْدَنَا فِي ذَلِكَ خَطَرُكَ وَ يَجِلُّ عَنْهُ فِي أَنْفُسِنَا فَضْلُكَ \nفَأَجَابَهُ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) فَقَالَ إِنَّ مِنْ حَقِّ مَنْ عَظُمَ جَلَالُ اللَّهِ فِي نَفْسِهِ وَ جَلَّ مَوْضِعُهُ مِنْ قَلْبِهِ أَنْ يَصْغُرَ عِنْدَهُ لِعِظَمِ ذَلِكَ كُلُّ مَا سِوَاهُ وَ إِنَّ أَحَقَّ مَنْ كَانَ كَذَلِكَ لَمَنْ عَظُمَتْ نِعْمَةُ اللَّهِ عَلَيْهِ وَ لَطُفَ إِحْسَانُهُ إِلَيْهِ فَإِنَّهُ لَمْ تَعْظُمْ نِعْمَةُ اللَّهِ عَلَى أَحَدٍ إِلَّا زَادَ حَقُّ اللَّهِ عَلَيْهِ عِظَماً \nوَ إِنَّ مِنْ أَسْخَفِ حَالَاتِ الْوُلَاةِ عِنْدَ صَالِحِ النَّاسِ أَنْ يُظَنَّ بِهِمْ حُبُّ الْفَخْرِ وَ يُوضَعَ أَمْرُهُمْ عَلَى الْكِبْرِ وَ قَدْ كَرِهْتُ أَنْ يَكُونَ جَالَ فِي ظَنِّكُمْ أَنِّي أُحِبُّ الْإِطْرَاءَ وَ اسْتِمَاعَ الثَّنَاءِ وَ لَسْتُ بِحَمْدِ اللَّهِ كَذَلِكَ وَ لَوْ كُنْتُ أُحِبُّ أَنْ يُقَالَ ذَلِكَ لَتَرَكْتُهُ انْحِطَاطاً لِلَّهِ سُبْحَانَهُ عَنْ تَنَاوُلِ مَا هُوَ أَحَقُّ بِهِ مِنَ الْعَظَمَةِ وَ الْكِبْرِيَاءِ وَ رُبَّمَا اسْتَحْلَى النَّاسُ الثَّنَاءَ بَعْدَ الْبَلَاءِ فَلَا تُثْنُوا عَلَيَّ بِجَمِيلِ ثَنَاءٍ لِإِخْرَاجِي نَفْسِي إِلَى اللَّهِ وَ إِلَيْكُمْ مِنَ الْبَقِيَّةِ فِي حُقُوقٍ لَمْ أَفْرُغْ مِنْ أَدَائِهَا وَ فَرَائِضَ لَا بُدَّ مِنْ إِمْضَائِهَا\nفَلَا تُكَلِّمُونِي بِمَا تُكَلَّمُ بِهِ الْجَبَابِرَةُ وَ لَا تَتَحَفَّظُوا مِنِّي بِمَا يُتَحَفَّظُ بِهِ عِنْدَ أَهْلِ الْبَادِرَةِ وَ لَا تُخَالِطُونِي بِالْمُصَانَعَةِ وَ لَا تَظُنُّوا بِي اسْتِثْقَالًا فِي حَقٍّ قِيلَ لِي وَ لَا الْتِمَاسَ إِعْظَامٍ لِنَفْسِي لِمَا لَا يَصْلُحُ لِي فَإِنَّهُ مَنِ اسْتَثْقَلَ الْحَقَّ أَنْ يُقَالَ لَهُ أَوِ الْعَدْلَ أَنْ يُعْرَضَ عَلَيْهِ كَانَ الْعَمَلُ بِهِمَا أَثْقَلَ عَلَيْهِ\nفَلَا تَكُفُّوا عَنِّي مَقَالَةً بِحَقٍّ أَوْ مَشُورَةً بِعَدْلٍ فَإِنِّي لَسْتُ فِي نَفْسِي بِفَوْقِ مَا أَنْ أُخْطِئَ وَ لَا آمَنُ ذَلِكَ مِنْ فِعْلِي إِلَّا أَنْ يَكْفِيَ اللَّهُ مِنْ نَفْسِي مَا هُوَ أَمْلَكُ بِهِ مِنِّي فَإِنَّمَا أَنَا وَ أَنْتُمْ عَبِيدٌ مَمْلُوكُونَ لِرَبٍّ لَا رَبَّ غَيْرُهُ يَمْلِكُ مِنَّا مَا لَا نَمْلِكُ مِنْ أَنْفُسِنَا وَ أَخْرَجَنَا مِمَّا كُنَّا فِيهِ إِلَى مَا صَلَحْنَا عَلَيْهِ فَأَبْدَلَنَا بَعْدَ الضَّلَالَةِ بِالْهُدَى وَ أَعْطَانَا الْبَصِيرَةَ بَعْدَ الْعَمَى \nفَأَجَابَهُ الرَّجُلُ الَّذِي أَجَابَهُ مِنْ قَبْلُ فَقَالَ أَنْتَ أَهْلُ مَا قُلْتَ وَ اللَّهِ وَ اللَّهِ فَوْقَ مَا قُلْتَهُ فَبَلَاؤُهُ عِنْدَنَا مَا لَا يُكْفَرُ وَ قَدْ حَمَّلَكَ اللَّهُ تَبَارَكَ وَ تَعَالَى رِعَايَتَنَا وَ وَلَّاكَ سِيَاسَةَ أُمُورِنَا فَأَصْبَحْتَ عَلَمَنَا الَّذِي نَهْتَدِي بِهِ وَ إِمَامَنَا الَّذِي نَقْتَدِي بِهِ وَ أَمْرُكَ كُلُّهُ رُشْدٌ وَ قَوْلُكَ كُلُّهُ أَدَبٌ قَدْ قَرَّتْ بِكَ فِي الْحَيَاةِ أَعْيُنُنَا وَ امْتَلَأَتْ مِنْ سُرُورٍ بِكَ قُلُوبُنَا وَ تَحَيَّرَتْ مِنْ صِفَةِ مَا فِيكَ مِنْ بَارِعِ الْفَضْلِ عُقُولُنَا\nوَ لَسْنَا نَقُولُ لَكَ أَيُّهَا الْإِمَامُ الصَّالِحُ تَزْكِيَةً لَكَ وَ لَا نُجَاوِزُ الْقَصْدَ فِي الثَّنَاءِ عَلَيْكَ وَ لَمْ يُكَنَّ فِي أَنْفُسِنَا طَعْنٌ عَلَى يَقِينِكَ أَوْ غِشٌّ فِي دِينِكَ فَنَتَخَوَّفَ أَنْ تَكُونَ أَحْدَثْتَ بِنِعْمَةِ اللَّهِ تَبَارَكَ وَ تَعَالَى تَجَبُّراً أَوْ دَخَلَكَ كِبْرٌ وَ لَكِنَّا نَقُولُ لَكَ مَا قُلْنَا تَقَرُّباً إِلَى اللَّهِ عَزَّ وَ جَلَّ بِتَوْقِيرِكَ وَ تَوَسُّعاً بِتَفْضِيلِكَ وَ شُكْراً بِإِعْظَامِ أَمْرِكَ فَانْظُرْ لِنَفْسِكَ وَ لَنَا وَ آثِرْ أَمْرَ اللَّهِ عَلَى نَفْسِكَ وَ عَلَيْنَا فَنَحْنُ طُوَّعٌ فِيمَا أَمَرْتَنَا نَنْقَادُ مِنَ الْأُمُورِ مَعَ ذَلِكَ فِيمَا يَنْفَعُنَا \nفَأَجَابَهُ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) فَقَالَ وَ أَنَا أَسْتَشْهِدُكُمْ عِنْدَ اللَّهِ عَلَى نَفْسِي لِعِلْمِكُمْ فِيمَا وُلِّيتُ بِهِ مِنْ أُمُورِكُمْ وَ عَمَّا قَلِيلٍ يَجْمَعُنِي وَ إِيَّاكُمُ الْمَوْقِفُ بَيْنَ يَدَيْهِ وَ السُّؤَالُ عَمَّا كُنَّا فِيهِ ثُمَّ يَشْهَدُ بَعْضُنَا عَلَى بَعْضٍ فَلَا تَشْهَدُوا الْيَوْمَ بِخِلَافِ مَا أَنْتُمْ شَاهِدُونَ غَداً فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ لَا يَخْفَى عَلَيْهِ خَافِيَةٌ وَ لَا يَجُوزُ عِنْدَهُ إِلَّا مُنَاصَحَةُ الصُّدُورِ فِي جَمِيعِ الْأُمُورِ\nفَأَجَابَهُ الرَّجُلُ وَ يُقَالُ لَمْ يُرَ الرَّجُلُ بَعْدَ كَلَامِهِ هَذَا لِأَمِيرِ الْمُؤْمِنِينَ (عليه السلام) فَأَجَابَهُ وَ قَدْ عَالَ الَّذِي فِي صَدْرِهِ فَقَالَ وَ الْبُكَاءُ يَقْطَعُ مَنْطِقَهُ وَ غُصَصُ الشَّجَا تَكْسِرُ صَوْتَهُ إِعْظَاماً لِخَطَرِ مَرْزِئَتِهِ وَ وَحْشَةً مِنْ كَوْنِ فَجِيعَتِهِ فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ ثُمَّ شَكَا إِلَيْهِ هَوْلَ مَا أَشْفَى عَلَيْهِ مِنَ الْخَطَرِ الْعَظِيمِ وَ الذُّلِّ الطَّوِيلِ فِي فَسَادِ زَمَانِهِ وَ انْقِلَابِ جَدِّهِ وَ انْقِطَاعِ مَا كَانَ مِنْ دَوْلَتِهِ\nثُمَّ نَصَبَ الْمَسْأَلَةَ إِلَى اللَّهِ عَزَّ وَ جَلَّ بِالِامْتِنَانِ عَلَيْهِ وَ الْمُدَافَعَةِ عَنْهُ بِالتَّفَجُّعِ وَ حُسْنِ الثَّنَاءِ فَقَالَ يَا رَبَّانِيَّ الْعِبَادِ وَ يَا سَكَنَ الْبِلَادِ أَيْنَ يَقَعُ قَوْلُنَا مِنْ فَضْلِكَ وَ أَيْنَ يَبْلُغُ وَصْفُنَا مِنْ فِعْلِكَ وَ أَنَّى نَبْلُغُ حَقِيقَةَ حُسْنِ ثَنَائِكَ أَوْ نُحْصِي جَمِيلَ بَلَائِكَ فَكَيْفَ وَ بِكَ جَرَتْ نِعَمُ اللَّهِ عَلَيْنَا وَ عَلَى يَدِكَ اتَّصَلَتْ أَسْبَابُ الْخَيْرِ إِلَيْنَا\nأَ لَمْ تَكُنْ لِذُلِّ الذَّلِيلِ مَلَاذاً وَ لِلْعُصَاةِ الْكُفَّارِ إِخْوَاناً فَبِمَنْ إِلَّا بِأَهْلِ بَيْتِكَ وَ بِكَ أَخْرَجَنَا اللَّهُ عَزَّ وَ جَلَّ مِنْ فَظَاعَةِ تِلْكَ الْخَطَرَاتِ أَوْ بِمَنْ فَرَّجَ عَنَّا غَمَرَاتِ الْكُرُبَاتِ وَ بِمَنْ إِلَّا بِكُمْ أَظْهَرَ اللَّهُ مَعَالِمَ دِينِنَا وَ اسْتَصْلَحَ مَا كَانَ فَسَدَ مِنْ دُنْيَانَا حَتَّى اسْتَبَانَ بَعْدَ الْجَوْرِ ذِكْرُنَا وَ قَرَّتْ مِنْ رَخَاءِ الْعَيْشِ أَعْيُنُنَا لِمَا وَلِيتَنَا بِالْإِحْسَانِ جَهْدَكَ وَ وَفَيْتَ لَنَا بِجَمِيعِ وَعْدِكَ وَ قُمْتَ لَنَا عَلَى جَمِيعِ عَهْدِكَ\nفَكُنْتَ شَاهِدَ مَنْ غَابَ مِنَّا وَ خَلَفَ أَهْلِ الْبَيْتِ لَنَا وَ كُنْتَ عِزَّ ضُعَفَائِنَا وَ ثِمَالَ فُقَرَائِنَا وَ عِمَادَ عُظَمَائِنَا يَجْمَعُنَا فِي الْأُمُورِ عَدْلُكَ وَ يَتَّسِعُ لَنَا فِي الْحَقِّ تَأَنِّيكَ فَكُنْتَ لَنَا أُنْساً إِذَا رَأَيْنَاكَ وَ سَكَناً إِذَا ذَكَرْنَاكَ فَأَيَّ الْخَيْرَاتِ لَمْ تَفْعَلْ وَ أَيَّ الصَّالِحَاتِ لَمْ تَعْمَلْ\nوَ لَوْ لَا أَنَّ الْأَمْرَ الَّذِي نَخَافُ عَلَيْكَ مِنْهُ يَبْلُغُ تَحْوِيلَهُ جُهْدُنَا وَ تَقْوَى لِمُدَافَعَتِهِ طَاقَتُنَا أَوْ يَجُوزُ الْفِدَاءُ عَنْكَ مِنْهُ بِأَنْفُسِنَا وَ بِمَنْ نَفْدِيهِ بِالنُّفُوسِ مِنْ أَبْنَائِنَا لَقَدَّمْنَا أَنْفُسَنَا وَ أَبْنَاءَنَا قِبَلَكَ وَ لَأَخْطَرْنَاهَا وَ قَلَّ خَطَرُهَا دُونَكَ وَ لَقُمْنَا بِجُهْدِنَا فِي مُحَاوَلَةِ مَنْ حَاوَلَكَ وَ فِي مُدَافَعَةِ مَنْ نَاوَاكَ\nوَ لَكِنَّهُ سُلْطَانٌ لَا يُحَاوَلُ وَ عِزٌّ لَا يُزَاوَلُ وَ رَبٌّ لَا يُغَالَبُ فَإِنْ يَمْنُنْ عَلَيْنَا بِعَافِيَتِكَ وَ يَتَرَحَّمْ عَلَيْنَا بِبَقَائِكَ وَ يَتَحَنَّنْ عَلَيْنَا بِتَفْرِيجِ هَذَا مِنْ حَالِكَ إِلَى سَلَامَةٍ مِنْكَ لَنَا وَ بَقَاءٍ مِنْكَ بَيْنَ أَظْهُرِنَا نُحْدِثْ لِلَّهِ عَزَّ وَ جَلَّ بِذَلِكَ شُكْراً نُعَظِّمُهُ وَ ذِكْراً نُدِيمُهُ وَ نَقْسِمْ أَنْصَافَ أَمْوَالِنَا صَدَقَاتٍ وَ أَنْصَافَ رَقِيقِنَا عُتَقَاءَ وَ نُحْدِثْ لَهُ تَوَاضُعاً فِي أَنْفُسِنَا وَ نَخْشَعْ فِي جَمِيعِ أُمُورِنَا \nوَ إِنْ يَمْضِ بِكَ إِلَى الْجِنَانِ وَ يُجْرِي عَلَيْكَ حَتْمَ سَبِيلِهِ فَغَيْرُ مُتَّهَمٍ فِيكَ قَضَاؤُهُ وَ لَا مَدْفُوعٍ عَنْكَ بَلَاؤُهُ وَ لَا مُخْتَلِفَةٍ مَعَ ذَلِكَ قُلُوبُنَا بِأَنَّ اخْتِيَارَهُ لَكَ مَا عِنْدَهُ عَلَى مَا كُنْتَ فِيهِ وَ لَكِنَّا نَبْكِي مِنْ غَيْرِ إِثْمٍ لِعِزِّ هَذَا السُّلْطَانِ أَنْ يَعُودَ ذَلِيلًا وَ لِلدِّينِ وَ الدُّنْيَا أَكِيلًا فَلَا نَرَى لَكَ خَلَفاً نَشْكُو إِلَيْهِ وَ لَا نَظِيراً نَأْمُلُهُ وَ لَا نُقِيمُهُ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473684\">H 14997</a> – Ali Bin Al-Hassan Al-Mowdab, from Ahmad Bin Muhammad Bin Khalid and Ahmad Bin Muhammad, from Ali Bin Al-Hassan Al-Taymi together, from Ismail Bin Mahran who said, ‘Narrated to me Abdullah Al-Haris, from Jabir, who has narrated the following:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> has said: ‘Amir-ul-Momineen<sup>asws</sup> gave a sermon to the people at Siffeen, so he<sup>asws</sup> Praised Allah<sup>azwj</sup> and Extolled Him<sup>azwj</sup>, and sent greetings upon the Prophet<sup>saww</sup>, then said: ‘Having said that, Allah<sup>azwj</sup> the High has Made my<sup>asws</sup> rights to be obligatory upon you all as the Guardian of your matters (Wali-ul-Amr) and my<sup>asws</sup> status which Allah<sup>azwj</sup> Revealed for you, and similarly you have rights upon me<sup>asws</sup> as I<sup>asws</sup> have upon you.\nAnd the right is the most beautiful of the things in description; and most expansive in sharing. There is no other thing which is applied on one’s favour without being applied against him and it is not applied against him unless it is applied in his favour. The only one for whom it flows for and does not flow against is Allah<sup>azwj</sup> Mighty and Majestic only apart from His<sup>azwj</sup> creatures, for He<sup>azwj</sup> is Powerful over His<sup>azwj</sup> servants, and His<sup>azwj</sup> Justice regarding everything that He<sup>azwj</sup> Judges. But He<sup>azwj</sup> Made His<sup>azwj</sup> Rights upon the servants that they should be obedient to Him<sup>azwj</sup>, and Made expiation against them by the good Rewards as Grace from Him<sup>azwj</sup>, and the prolonged Generosity, and Expanding by increasing it for the one who is deserving of it. \nThen He<sup>azwj</sup> Made from His<sup>azwj</sup> ‘حُقُوقِهِ’ Rights, certain rights to be obligated for some people upon some other people. So He<sup>azwj</sup> Made it such that it obligates some of them for the others and does not obligate some except by the others. So the greatest of what Allah<sup>azwj</sup> has Necessitated from these rights is the rights of the governor upon the citizens and the rights of the citizens upon the governor, an obligation which Allah<sup>azwj</sup> has Obligated upon one and all. So He<sup>azwj</sup> has Made it to be a system for them and as strength for their Religion, and the establishment of the true Sunnah among them. The citizens will not be corrected except by the governor being correct, nor will the governor be correct except by the integrity of the citizens. \nSo if the citizens fulfil the rights to the governor and the governor fulfils their rights as well, the truth will be strengthened between them. The manifesto of the Religion would be established, and the landmarks of justice would find fairness, and the Sunnah would flow smoothly. That would make life prosperous, and they would yearn for the survival of the government, and the enemies would despair from their ambitions. And if the citizens overcome the governor and the governor seeks to overcome them that are where the differences of speech emerge. The yearning of tyranny appears, and abundance of the lawlessness in the Religion, and the landmarks of the Sunnah are left. So they act by the desires, effects vanish, and illnesses of the souls abound. There is no fear of the penalties for infringement of the Laws, nor does confronting the falsehood seem great. So that is where the humiliation of the righteous and the honour for the evil ones is, and the ruination of the cities, and the greater the consequences will be for the servants in the presence of Allah<sup>azwj</sup> Mighty and Majestic. \nSo come, o you people, to the co-operation to the obedience to Allah<sup>azwj</sup> Mighty and Majestic, and the establishment by His<sup>azwj</sup> Justice, and the loyalty to His<sup>azwj</sup> Covenant, and the fairness to Him<sup>azwj</sup> is all of His<sup>azwj</sup> Rights, for there is nothing more needed for the servants than for advising with regards to that, and the beautiful co-operation to Him<sup>azwj</sup>, and there is no one who intensifies his passion for striving for the Pleasure of Allah<sup>azwj</sup> to be able to reach its deserving point of fulfilling the Rights to Allah<sup>azwj</sup>. But, from the obligatory Rights of Allah<sup>azwj</sup> Mighty and Majestic, upon the servants is the advice to each other with maximum efforts, and the co-operation upon the establishment of the truth among them.\nThen there is person, no matter how great his status regarding the truth, how magnified his preference regarding the truth is, would not be needless from the co-operation upon what Allah<sup>azwj</sup> Mighty and Majestic has Burdened him with from His<sup>azwj</sup> Rights. And there is no person, no matter how low he is in the affairs, and the eyes are looking down upon him, can remain without being helped upon or given support. And the people of the merits and the people of the Favours are more frequently in need of that, and everyone is in need of Allah<sup>azwj</sup> Mighty and Majestic equally’.  \nA man from his<sup>asws</sup> army answered him<sup>asws</sup>. No one knew who he was and it is said that he had never been seen in his<sup>asws</sup> army before that day, nor was he seen after it. So he stood up and beautifully Extolled Allah<sup>azwj</sup> Mighty and Majestic by what the afflictions He<sup>azwj</sup> had Placed upon them, and His<sup>azwj</sup> Favours from the Obligation of His<sup>azwj</sup> rights against them, and accepted all what had been mentioned of the changing conditions with him<sup>asws</sup> and with them. Then said, ‘You<sup>asws</sup> are our Commander, and we are your<sup>asws</sup> citizens. It is by you<sup>asws</sup> that Allah<sup>azwj</sup> Brought us out of the humiliation and it is by your<sup>asws</sup> strength that He<sup>azwj</sup> Freed His<sup>azwj</sup> servant from the chains. So choose for us, and we will go by your<sup>asws</sup> choice, and make a plan and we would go by your<sup>asws</sup> plan, for you<sup>asws</sup> are a truthful speaker, and the successful ruler, and the authorised king. It is not permissible for us to disobey you<sup>asws</sup> in anything, nor do we compare our knowledge with your<sup>asws</sup> knowledge. You<sup>asws</sup> are great in regard to that choice, in our eyes, and your<sup>asws</sup> virtues are majestic within us’. \nSo Amir-ul-Momineen<sup>asws</sup> answered him saying: ‘It is from the Rights that the one who Magnifies the Majesty of Allah<sup>azwj</sup> within himself and exalts His<sup>azwj</sup> position in his heart, everything else would seem little to him. And the one most deserving to be like that is the one to whom the Bounties of Allah<sup>azwj</sup> are great as well as His<sup>azwj</sup> Kind Favours to him, for no one would magnify the Bounties of Allah<sup>azwj</sup> except that the Rights of Allah<sup>azwj</sup> Increase upon him.\nAnd the lowest of the conditions of the governor in the presence of the righteous people is when he thinks of the love for pride and bases his affairs upon the arrogance, and I<sup>asws</sup> did not like to become lost in your thoughts that I<sup>asws</sup> would love the praise and listening to the praise. And I<sup>asws</sup> am not like that. Thanks be to Allah<sup>azwj</sup>. And had I<sup>asws</sup> loved what you said, I<sup>asws</sup> would have abandoned it due to it lowering me<sup>asws</sup> for the Sake of Allah<sup>azwj</sup> that I<sup>asws</sup> should take to magnificence and greatness when He<sup>azwj</sup> is more deserving of it. Maybe the people consider it sweet to be praised after the affliction. So do not praise me<sup>asws</sup> with beautiful praises as it may take my<sup>asws</sup> soul out from being for the Sake of Allah<sup>azwj</sup>, and the remainder of the rights which I<sup>asws</sup> have yet to fulfill and the obligations which I<sup>asws</sup> have yet to perform.\nSo, do not speak to me<sup>asws</sup> as you speak to the tyrants, and do not have reservations from me<sup>asws</sup> like you have reservations in the presence of the unresponsive people, and do not flatter me<sup>asws</sup>, and do not think that I<sup>asws</sup> consider it heavy regarding the right which is said to me<sup>asws</sup>, or that I<sup>asws</sup> seek self-greatness, for it is not correct for me<sup>asws</sup>. So the one who considers the rights to be a burden if they are told to him, or the justice if it is presented to him, it would become heavier for him to act in accordance with these two. \nSo do not withhold from me<sup>asws</sup> speaking about the rights, or consultation with justice, for I<sup>asws</sup> not, with regards to myself<sup>asws</sup>, above mistakes, nor do I<sup>asws</sup> feel secure from that in my<sup>asws</sup> deeds except if Allah<sup>azwj</sup> Suffices for myself<sup>asws</sup> in matter which He<sup>azwj</sup> has more Control over than what I<sup>asws</sup> have. But rather, I<sup>asws</sup> and you all are servants, belonging to the Lord<sup>azwj</sup>. There is no lord apart from Him<sup>azwj</sup>. He<sup>azwj</sup> Owns us what we do not own ourselves, and Took us out from what we used to be in to be in a situation which was correct for us. So He<sup>azwj</sup> Protected us after straying, by the Guidance. He<sup>azwj</sup> Gave us the vision after the blindness.\nSo, the man who answered him<sup>asws</sup> before, answered him<sup>asws</sup>, ‘By Allah<sup>azwj</sup>, you<sup>asws</sup> are deserving of what I said. By Allah<sup>azwj</sup>, you<sup>asws</sup> are more deserving than what I said, for His<sup>azwj</sup> Favours are such that we cannot deny, and Allah<sup>azwj</sup> Blessed and High has Burdened you<sup>asws</sup> with our citizens, and the Guardianship of our political affairs. So you<sup>asws</sup> have become (a representative of) our knowledge with which we can be guided by, and our Imam<sup>asws</sup> whom we follow, and every matter of yours<sup>asws</sup> is guidance, and every word of yours<sup>asws</sup> is educational. Our eyes have found delight with you<sup>asws</sup> in our lives, and our hearts are filled with bliss by you<sup>asws</sup>, and we are amazed at the qualities, which are within you<sup>asws</sup> and our intellects are at a loss to describe. \nWe are not saying to you<sup>asws</sup>, ‘O you<sup>asws</sup> righteous Imam<sup>asws</sup> as a purification for you<sup>asws</sup>, nor are we exaggerating in our intentions regarding our praising you<sup>asws</sup>. And we are not becoming critical of your<sup>asws</sup> conviction, or the purity of your<sup>asws</sup> Religion, so we have no fear that you<sup>asws</sup> would innovate by the Bounties of Allah<sup>azwj</sup> Blessed and High, or be tyrannical, or that arrogance should enter you<sup>asws</sup>, but we are saying to you<sup>asws</sup> what we said in order to be closer to Allah<sup>azwj</sup> Mighty and Majestic by revering you<sup>asws</sup>, and Enhancing your<sup>asws</sup> merits, and appreciate the greatness of your<sup>asws</sup> command. So consider yourself<sup>asws</sup> and use, and give preference to the Command of Allah<sup>azwj</sup> over yourself<sup>asws</sup> and over us, for we are obedient with regards to whatever you<sup>asws</sup> order us for, and we submit to the commands along with that regarding what is beneficial for us’.\nAmir-ul-Momineen<sup>asws</sup> answered him, so he<sup>asws</sup> said: ‘And I<sup>asws</sup> am binding you in the Presence of Allah<sup>azwj</sup> to myself<sup>asws</sup> for your knowing that I<sup>asws</sup> am the guardian for your matters, for very shortly you will be gathered with me<sup>asws</sup>. And I<sup>asws</sup> warn you of the Pausing in front of Him<sup>azwj</sup>, and the Questioning about what we were in, then some of us will testify against the others, so do not testify today against what you will be testifying tomorrow, for there is nothing hidden from Allah<sup>azwj</sup> Mighty and Majestic, nor is it permitted in His<sup>azwj</sup> Presence except for the good advice of the chests in all of the matters’. \nSo the man answered him<sup>asws</sup>, and it was said that the man was never seen again after this speech of his to Amir-ul-Momineen<sup>asws</sup>, and he was bursting with emotion in his chest, and he spoke, and wailed which cut off his speech, and was anxious and choking, breaking his voice, being at the verge of collapse. So he Praised Allah<sup>azwj</sup> and Extolled Him<sup>azwj</sup>, then pleaded before Him<sup>azwj</sup> of the horrors of what he had been cured of, from the great dangers, and the prolonged humiliation regarding the mischief to take place during his<sup>asws</sup> era, and the rebellions against him<sup>asws</sup> and the cutting off of what was from his<sup>asws</sup> government. \nThen he implored the matter to Allah<sup>azwj</sup> Mighty and Majestic of the Bestowing of Favours on him<sup>asws</sup>, and the Dispelling (dangers) from him<sup>asws</sup>, and then Extolled Him<sup>azwj</sup> in a goodly manner. So he said, ‘O Lord<sup>azwj</sup> of the servants, and O Giver of tranquillity to the cities! How can we speak of Your<sup>azwj</sup> Grace, and how can we reach Your<sup>azwj</sup> Attributes from Your<sup>azwj</sup> Actions, and for me to reach the reality of the beauty of Your<sup>azwj</sup> Praise, or count the beauty of Your<sup>azwj</sup> Favours. So how can we, and it is due to you<sup>asws</sup> that the Bounties of Allah<sup>azwj</sup> have flowed towards us, and it is upon your<sup>asws</sup> hands that the causes of the good have arrived to us. \nDid you<sup>asws</sup> not become a sanctuary for the lowest of the low, and a saviour for the disobedient infidels? So by whom, except for the People<sup>asws</sup> of your<sup>asws</sup> Household, and by you<sup>asws</sup> that Allah<sup>azwj</sup> Mighty and Majestic Took us out from horrors of those dangers, and by whom did he<sup>azwj</sup> Rescue us from the thrones of distress, and by whom except by you<sup>asws</sup> did Allah<sup>azwj</sup> Make apparent the landmarks of our Religion, and Corrected what was spoilt from our Religion until we came to be mentioned, after the tyranny. And our eyes were delighted with a prosperous life when you<sup>asws</sup> became our Guardian as a favour to us, and you<sup>asws</sup> struggled and fulfilled to us all of your<sup>asws</sup> promises, and stood by all of your<sup>asws</sup> oaths to us. \nSo you<sup>asws</sup> were a witness for the ones who were absent from us, and a successor of the People<sup>asws</sup> of the Household for us. And you<sup>asws</sup> were the strength of our weak ones, and the wealth of our poor ones, and a pillar for our great ones. It was your<sup>asws</sup> justice that brought us together in the matters, and accommodated us regarding the truth by your<sup>asws</sup> patience. You<sup>asws</sup> were, for us a familiarity if we saw you<sup>asws</sup>, and a tranquillity whenever we mentioned you<sup>asws</sup>. So which is the good deed, which you<sup>asws</sup> did not perform, and which is the righteous deeds which you<sup>asws</sup> did not act upon? \nAnd had it not been for the matter which we fear for you<sup>asws</sup> from it reaching you, which our efforts could change, and our strengths could defend you<sup>asws</sup> from it, we would be permitted to sacrifice ourselves for your<sup>asws</sup> defence, and repulse it from you<sup>asws</sup> by ourselves and our sons, we would put ourselves and our sons before you<sup>asws</sup>. And we would make this choice, and reduce its danger from you<sup>asws</sup>, and we would stand in our efforts in an attempt to defend you<sup>asws</sup> from your<sup>asws</sup> enemies. \nBut He<sup>azwj</sup> is an Authority, which cannot be stopped, and a Strength which cannot decline, and a Lord<sup>azwj</sup> Who cannot be overcome. So if he<sup>azwj</sup> was to Bestow a Favour to us by Bestowing upon you<sup>asws</sup> good health, and be Merciful towards us by Keeping you<sup>asws</sup> alive, and be Compassionate to us by Relieving you<sup>asws</sup> of these difficulties from your<sup>asws</sup> situation to Keep you<sup>asws</sup> safe for us, and remain with us in front of us, we would narrate appreciation to Allah<sup>azwj</sup> Mighty and Majestic for that, and Magnify Him<sup>azwj</sup>, and Mention Him<sup>azwj</sup> constantly, and distribute half of our wealth as charity, and free half of our slaves, and narrate to Him<sup>azwj</sup> with humbleness in our selves, and be submissive in all of our affairs. \nAnd when He<sup>azwj</sup> Takes you to the Gardens, and Makes to Flow for you<sup>asws</sup> that which is inevitable, so no one would be able to change that which He<sup>azwj</sup> has Ordained, nor repulse from you<sup>asws</sup> His<sup>azwj</sup> Favours, nor will our hearts be opposed to that for that which He<sup>azwj</sup> has Chosen for you<sup>asws</sup> of what is with Him<sup>azwj</sup> over what you<sup>asws</sup> used to be in. But, we would weep if this authority (government) were to return back to humiliation, and for the Religion and the world to be consumed and we do not see for you<sup>asws</sup> a successor we can take our complaints to, nor a similar government we can have hope in establishing it’. \nout of 567"}]}]}, "index": "al-kafi:8:1:49", "kind": "verse_list"}