{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 5"
        },
        "path": "/books/al-kafi:8:1:5",
        "titles": {
          "ar": "حَدِيثُ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَعَ الْمَنْصُورِ فِي مَوْكِبِه",
          "en": "HADEETH OF ABU ABDULLAH<sup>asws</sup> WITH AL-MANSOUR IN HIS PROCESSION"
        }
      }
    ],
    "index": 2276,
    "local_index": 5,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 6"
        },
        "path": "/books/al-kafi:8:1:6",
        "titles": {
          "ar": "حَدِيثُ مُوسَى (عليه السلام)",
          "en": "HADEETH OF MUSA<sup>as</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 4"
        },
        "path": "/books/al-kafi:8:1:4",
        "titles": {
          "ar": "خُطْبَةُ الطَّالُوتِيَّةِ",
          "en": "SERMON OF AL-TAALUTIYYA"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:5",
    "titles": {
      "ar": "حَدِيثُ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَعَ الْمَنْصُورِ فِي مَوْكِبِه",
      "en": "HADEETH OF ABU ABDULLAH<sup>asws</sup> WITH AL-MANSOUR IN HIS PROCESSION"
    },
    "verse_count": 1,
    "verse_start_index": 14690,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 82)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14691,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/5919",
              "text": "14455-مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "بَعْضِ أَصْحَابِهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2191",
              "text": "مُحَمَّدِ بْنِ أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/99",
              "text": "حُمْرَانَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "14455-مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِهِ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ جَمِيعاً عَنْ مُحَمَّدِ بْنِ أَبِي حَمْزَةَ عَنْ حُمْرَانَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:5:1",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ ذُكِرَ هَؤُلَاءِ عِنْدَهُ وَ سُوءُ حَالِ الشِّيعَةِ عِنْدَهُمْ ",
          "فَقَالَ إِنِّي سِرْتُ مَعَ أَبِي جَعْفَرٍ الْمَنْصُورِ وَ هُوَ فِي مَوْكِبِهِ وَ هُوَ عَلَى فَرَسٍ وَ بَيْنَ يَدَيْهِ خَيْلٌ وَ مِنْ خَلْفِهِ خَيْلٌ وَ أَنَا عَلَى حِمَارٍ إِلَى جَانِبِهِ فَقَالَ لِي يَا أَبَا عَبْدِ اللَّهِ قَدْ كَانَ فَيَنْبَغِي لَكَ أَنْ تَفْرَحَ بِمَا أَعْطَانَا اللَّهُ مِنَ الْقُوَّةِ وَ فَتَحَ لَنَا مِنَ الْعِزِّ وَ لَا تُخْبِرَ النَّاسَ أَنَّكَ أَحَقُّ بِهَذَا الْأَمْرِ مِنَّا وَ أَهْلَ بَيْتِكَ فَتُغْرِيَنَا بِكَ وَ بِهِمْ ",
          "قَالَ فَقُلْتُ وَ مَنْ رَفَعَ هَذَا إِلَيْكَ عَنِّي فَقَدْ كَذَبَ فَقَالَ لِي أَ تَحْلِفُ عَلَى مَا تَقُولُ قَالَ فَقُلْتُ إِنَّ النَّاسَ سَحَرَةٌ يَعْنِي يُحِبُّونَ أَنْ يُفْسِدُوا قَلْبَكَ عَلَيَّ فَلَا تُمَكِّنْهُمْ مِنْ سَمْعِكَ فَإِنَّا إِلَيْكَ أَحْوَجُ مِنْكَ إِلَيْنَا فَقَالَ لِي تَذْكُرُ يَوْمَ سَأَلْتُكَ هَلْ لَنَا مُلْكٌ فَقُلْتَ نَعَمْ طَوِيلٌ عَرِيضٌ شَدِيدٌ فَلَا تَزَالُونَ فِي مُهْلَةٍ مِنْ أَمْرِكُمْ وَ فُسْحَةٍ مِنْ دُنْيَاكُمْ حَتَّى تُصِيبُوا مِنَّا دَماً حَرَاماً فِي شَهْرٍ حَرَامٍ فِي بَلَدٍ حَرَامٍ فَعَرَفْتُ أَنَّهُ قَدْ حَفِظَ الْحَدِيثَ فَقُلْتُ لَعَلَّ اللَّهَ عَزَّ وَ جَلَّ أَنْ يَكْفِيَكَ فَإِنِّي لَمْ أَخُصَّكَ بِهَذَا وَ إِنَّمَا هُوَ حَدِيثٌ رَوَيْتُهُ ثُمَّ لَعَلَّ غَيْرَكَ مِنْ أَهْلِ بَيْتِكَ يَتَوَلَّى ذَلِكَ فَسَكَتَ عَنِّي",
          "فَلَمَّا رَجَعْتُ إِلَى مَنْزِلِي أَتَانِي بَعْضُ مَوَالِينَا فَقَالَ جُعِلْتُ فِدَاكَ وَ اللَّهِ لَقَدْ رَأَيْتُكَ فِي مَوْكِبِ أَبِي جَعْفَرٍ وَ أَنْتَ عَلَى حِمَارٍ وَ هُوَ عَلَى فَرَسٍ وَ قَدْ أَشْرَفَ عَلَيْكَ يُكَلِّمُكَ كَأَنَّكَ تَحْتَهُ فَقُلْتُ بَيْنِي وَ بَيْنَ نَفْسِي هَذَا حُجَّةُ اللَّهِ عَلَى الْخَلْقِ وَ صَاحِبُ هَذَا الْأَمْرِ الَّذِي يُقْتَدَى بِهِ وَ هَذَا الْآخَرُ يَعْمَلُ بِالْجَوْرِ وَ يَقْتُلُ أَوْلَادَ الْأَنْبِيَاءِ وَ يَسْفِكُ الدِّمَاءَ فِي الْأَرْضِ بِمَا لَا يُحِبُّ اللَّهُ وَ هُوَ فِي مَوْكِبِهِ وَ أَنْتَ عَلَى حِمَارٍ فَدَخَلَنِي مِنْ ذَلِكَ شَكٌّ حَتَّى خِفْتُ عَلَى دِينِي وَ نَفْسِي",
          "قَالَ فَقُلْتُ لَوْ رَأَيْتَ مَنْ كَانَ حَوْلِي وَ بَيْنَ يَدَيَّ وَ مِنْ خَلْفِي وَ عَنْ يَمِينِي وَ عَنْ شِمَالِي مِنَ الْمَلَائِكَةِ لَاحْتَقَرْتَهُ وَ احْتَقَرْتَ مَا هُوَ فِيهِ فَقَالَ الْآنَ سَكَنَ قَلْبِي",
          "ثُمَّ قَالَ إِلَى مَتَى هَؤُلَاءِ يَمْلِكُونَ أَوْ مَتَى الرَّاحَةُ مِنْهُمْ فَقُلْتُ أَ لَيْسَ تَعْلَمُ أَنَّ لِكُلِّ شَيْ‏ءٍ مُدَّةً قَالَ بَلَى فَقُلْتُ هَلْ يَنْفَعُكَ عِلْمُكَ أَنَّ هَذَا الْأَمْرَ إِذَا جَاءَ كَانَ أَسْرَعَ مِنْ طَرْفَةِ الْعَيْنِ إِنَّكَ لَوْ تَعْلَمُ حَالَهُمْ عِنْدَ اللَّهِ عَزَّ وَ جَلَّ وَ كَيْفَ هِيَ كُنْتَ لَهُمْ أَشَدَّ بُغْضاً وَ لَوْ جَهَدْتَ أَوْ جَهَدَ أَهْلُ الْأَرْضِ أَنْ يُدْخِلُوهُمْ فِي أَشَدِّ مَا هُمْ فِيهِمْ مِنَ الْإِثْمِ لَمْ يَقْدِرُوا فَلَا يَسْتَفِزَّنَّكَ الشَّيْطَانُ",
          "فَإِنَّ الْعِزَّةَ لِلَّهِ وَ لِرَسُولِهِ وَ لِلْمُؤْمِنِينَ وَ لَكِنَّ الْمُنَافِقِينَ لَا يَعْلَمُونَ أَ لَا تَعْلَمُ أَنَّ مَنِ انْتَظَرَ أَمْرَنَا وَ صَبَرَ عَلَى مَا يَرَى مِنَ الْأَذَى وَ الْخَوْفِ هُوَ غَداً فِي زُمْرَتِنَا فَإِذَا رَأَيْتَ الْحَقَّ قَدْ مَاتَ وَ ذَهَبَ أَهْلُهُ وَ رَأَيْتَ الْجَوْرَ قَدْ شَمِلَ الْبِلَادَ وَ رَأَيْتَ الْقُرْآنَ قَدْ خَلُقَ وَ أُحْدِثَ فِيهِ مَا لَيْسَ فِيهِ وَ وُجِّهَ عَلَى الْأَهْوَاءِ وَ رَأَيْتَ الدِّينَ قَدِ انْكَفَأَ كَمَا يَنْكَفِئُ الْمَاءُ",
          "وَ رَأَيْتَ أَهْلَ الْبَاطِلِ قَدِ اسْتَعْلَوْا عَلَى أَهْلِ الْحَقِّ وَ رَأَيْتَ الشَّرَّ ظَاهِراً لَا يُنْهَى عَنْهُ وَ يُعْذَرُ أَصْحَابُهُ وَ رَأَيْتَ الْفِسْقَ قَدْ ظَهَرَ وَ اكْتَفَى الرِّجَالُ بِالرِّجَالِ وَ النِّسَاءُ بِالنِّسَاءِ وَ رَأَيْتَ الْمُؤْمِنَ صَامِتاً لَا يُقْبَلُ قَوْلُهُ وَ رَأَيْتَ الْفَاسِقَ يَكْذِبُ وَ لَا يُرَدُّ عَلَيْهِ كَذِبُهُ وَ فِرْيَتُهُ وَ رَأَيْتَ الصَّغِيرَ يَسْتَحْقِرُ بِالْكَبِيرِ وَ رَأَيْتَ الْأَرْحَامَ قَدْ تَقَطَّعَتْ وَ رَأَيْتَ مَنْ يَمْتَدِحُ بِالْفِسْقِ يَضْحَكُ مِنْهُ وَ لَا يُرَدُّ عَلَيْهِ قَوْلُهُ",
          "وَ رَأَيْتَ الْغُلَامَ يُعْطِي مَا تُعْطِي الْمَرْأَةُ وَ رَأَيْتَ النِّسَاءَ يَتَزَوَّجْنَ النِّسَاءَ وَ رَأَيْتَ الثَّنَاءَ قَدْ كَثُرَ وَ رَأَيْتَ الرَّجُلَ يُنْفِقُ الْمَالَ فِي غَيْرِ طَاعَةِ اللَّهِ فَلَا يُنْهَى وَ لَا يُؤْخَذُ عَلَى يَدَيْهِ وَ رَأَيْتَ النَّاظِرَ يَتَعَوَّذُ بِاللَّهِ مِمَّا يَرَى الْمُؤْمِنَ فِيهِ مِنَ الِاجْتِهَادِ وَ رَأَيْتَ الْجَارَ يُؤْذِي جَارَهُ وَ لَيْسَ لَهُ مَانِعٌ وَ رَأَيْتَ الْكَافِرَ فَرِحاً لِمَا يَرَى فِي الْمُؤْمِنِ مَرِحاً لِمَا يَرَى فِي الْأَرْضِ مِنَ الْفَسَادِ وَ رَأَيْتَ الْخُمُورَ تُشْرَبُ عَلَانِيَةً وَ يَجْتَمِعُ عَلَيْهَا مَنْ لَا يَخَافُ اللَّهَ عَزَّ وَ جَلَّ",
          "وَ رَأَيْتَ الْآمِرَ بِالْمَعْرُوفِ ذَلِيلًا وَ رَأَيْتَ الْفَاسِقَ فِيمَا لَا يُحِبُّ اللَّهُ قَوِيّاً مَحْمُوداً وَ رَأَيْتَ أَصْحَابَ الْآيَاتِ يُحْتَقَرُونَ وَ يُحْتَقَرُ مَنْ يُحِبُّهُمْ وَ رَأَيْتَ سَبِيلَ الْخَيْرِ مُنْقَطِعاً وَ سَبِيلَ الشَّرِّ مَسْلُوكاً وَ رَأَيْتَ بَيْتَ اللَّهِ قَدْ عُطِّلَ وَ يُؤْمَرُ بِتَرْكِهِ وَ رَأَيْتَ الرَّجُلَ يَقُولُ مَا لَا يَفْعَلُهُ وَ رَأَيْتَ الرِّجَالَ يَتَسَمَّنُونَ لِلرِّجَالِ وَ النِّسَاءَ لِلنِّسَاءِ وَ رَأَيْتَ الرَّجُلَ مَعِيشَتُهُ مِنْ دُبُرِهِ وَ مَعِيشَةُ الْمَرْأَةِ مِنْ فَرْجِهَا وَ رَأَيْتَ النِّسَاءَ يَتَّخِذْنَ الْمَجَالِسَ كَمَا يَتَّخِذُهَا الرِّجَالُ ",
          "وَ رَأَيْتَ التَّأْنِيثَ فِي وُلْدِ الْعَبَّاسِ قَدْ ظَهَرَ وَ أَظْهَرُوا الْخِضَابَ وَ امْتَشَطُوا كَمَا تَمْتَشِطُ الْمَرْأَةُ لِزَوْجِهَا وَ أَعْطَوُا الرِّجَالَ الْأَمْوَالَ عَلَى فُرُوجِهِمْ وَ تُنُوفِسَ فِي الرَّجُلِ وَ تَغَايَرَ عَلَيْهِ الرِّجَالُ وَ كَانَ صَاحِبُ الْمَالِ أَعَزَّ مِنَ الْمُؤْمِنِ وَ كَانَ الرِّبَا ظَاهِراً لَا يُعَيَّرُ وَ كَانَ الزِّنَا تُمْتَدَحُ بِهِ النِّسَاءُ وَ رَأَيْتَ الْمَرْأَةَ تُصَانِعُ زَوْجَهَا عَلَى نِكَاحِ الرِّجَالِ وَ رَأَيْتَ أَكْثَرَ النَّاسِ وَ خَيْرَ بَيْتٍ مَنْ يُسَاعِدُ النِّسَاءَ عَلَى فِسْقِهِنَّ",
          "وَ رَأَيْتَ الْمُؤْمِنَ مَحْزُوناً مُحْتَقَراً ذَلِيلًا وَ رَأَيْتَ الْبِدَعَ وَ الزِّنَا قَدْ ظَهَرَ وَ رَأَيْتَ النَّاسَ يَعْتَدُّونَ بِشَاهِدِ الزُّورِ وَ رَأَيْتَ الْحَرَامَ يُحَلَّلُ وَ رَأَيْتَ الْحَلَالَ يُحَرَّمُ وَ رَأَيْتَ الدِّينِ بِالرَّأْيِ وَ عُطِّلَ الْكِتَابُ وَ أَحْكَامُهُ وَ رَأَيْتَ اللَّيْلَ لَا يُسْتَخْفَى بِهِ مِنَ الْجُرْأَةِ عَلَى اللَّهِ وَ رَأَيْتَ الْمُؤْمِنَ لَا يَسْتَطِيعُ أَنْ يُنْكِرَ إِلَّا بِقَلْبِهِ وَ رَأَيْتَ الْعَظِيمَ مِنَ الْمَالِ يُنْفَقُ فِي سَخَطِ اللَّهِ عَزَّ وَ جَلَّ وَ رَأَيْتَ الْوُلَاةَ يُقَرِّبُونَ أَهْلَ الْكُفْرِ وَ يُبَاعِدُونَ أَهْلَ الْخَيْرِ وَ رَأَيْتَ الْوُلَاةَ يَرْتَشُونَ فِي الْحُكْمِ وَ رَأَيْتَ الْوِلَايَةَ قَبَالَةً لِمَنْ زَادَ",
          "وَ رَأَيْتَ ذَوَاتِ الْأَرْحَامِ يُنْكَحْنَ وَ يُكْتَفَى بِهِنَّ وَ رَأَيْتَ الرَّجُلَ يُقْتَلُ عَلَى التُّهَمَةِ وَ عَلَى الظِّنَّةِ وَ يَتَغَايَرُ عَلَى الرَّجُلِ الذَّكَرِ فَيَبْذُلُ لَهُ نَفْسَهُ وَ مَالَهُ وَ رَأَيْتَ الرَّجُلَ يُعَيَّرُ عَلَى إِتْيَانِ النِّسَاءِ وَ رَأَيْتَ الرَّجُلَ يَأْكُلُ مِنْ كَسْبِ امْرَأَتِهِ مِنَ الْفُجُورِ يَعْلَمُ ذَلِكَ وَ يُقِيمُ عَلَيْهِ وَ رَأَيْتَ الْمَرْأَةَ تَقْهَرُ زَوْجَهَا وَ تَعْمَلُ مَا لَا يَشْتَهِي وَ تُنْفِقُ عَلَى زَوْجِهَا وَ رَأَيْتَ الرَّجُلَ يُكْرِي امْرَأَتَهُ وَ جَارِيَتَهُ وَ يَرْضَى بِالدَّنِيِّ مِنَ الطَّعَامِ وَ الشَّرَابِ وَ رَأَيْتَ الْأَيْمَانَ بِاللَّهِ عَزَّ وَ جَلَّ كَثِيرَةً عَلَى الزُّورِ وَ رَأَيْتَ الْقِمَارَ قَدْ ظَهَرَ",
          "وَ رَأَيْتَ الشَّرَابَ يُبَاعُ ظَاهِراً لَيْسَ لَهُ مَانِعٌ وَ رَأَيْتَ النِّسَاءَ يَبْذُلْنَ أَنْفُسَهُنَّ لِأَهْلِ الْكُفْرِ وَ رَأَيْتَ الْمَلَاهِيَ قَدْ ظَهَرَتْ يُمَرُّ بِهَا لَا يَمْنَعُهَا أَحَدٌ أَحَداً وَ لَا يَجْتَرِئُ أَحَدٌ عَلَى مَنْعِهَا وَ رَأَيْتَ الشَّرِيفَ يَسْتَذِلُّهُ الَّذِي يُخَافُ سُلْطَانُهُ وَ رَأَيْتَ أَقْرَبَ النَّاسِ مِنَ الْوُلَاةِ مَنْ يَمْتَدِحُ بِشَتْمِنَا أَهْلَ الْبَيْتِ وَ رَأَيْتَ مَنْ يُحِبُّنَا يُزَوَّرُ وَ لَا تُقْبَلُ شَهَادَتُهُ وَ رَأَيْتَ الزُّورَ مِنَ الْقَوْلِ يُتَنَافَسُ فِيهِ وَ رَأَيْتَ الْقُرْآنَ قَدْ ثَقُلَ عَلَى النَّاسِ اسْتِمَاعُهُ وَ خَفَّ عَلَى النَّاسِ اسْتِمَاعُ الْبَاطِلِ",
          "وَ رَأَيْتَ الْجَارَ يُكْرِمُ الْجَارَ خَوْفاً مِنْ لِسَانِهِ وَ رَأَيْتَ الْحُدُودَ قَدْ عُطِّلَتْ وَ عُمِلَ فِيهَا بِالْأَهْوَاءِ وَ رَأَيْتَ الْمَسَاجِدَ قَدْ زُخْرِفَتْ وَ رَأَيْتَ أَصْدَقَ النَّاسِ عِنْدَ النَّاسِ الْمُفْتَرِيَ الْكَذِبَ وَ رَأَيْتَ الشَّرَّ قَدْ ظَهَرَ وَ السَّعْيَ بِالنَّمِيمَةِ وَ رَأَيْتَ الْبَغْيَ قَدْ فَشَا وَ رَأَيْتَ الْغِيبَةَ تُسْتَمْلَحُ وَ يُبَشِّرُ بِهَا النَّاسُ بَعْضُهُمْ بَعْضاً وَ رَأَيْتَ طَلَبَ الْحَجِّ وَ الْجِهَادِ لِغَيْرِ اللَّهِ وَ رَأَيْتَ السُّلْطَانَ يُذِلُّ لِلْكَافِرِ الْمُؤْمِنَ وَ رَأَيْتَ الْخَرَابَ قَدْ أُدِيلَ مِنَ الْعُمْرَانِ وَ رَأَيْتَ الرَّجُلَ مَعِيشَتُهُ مِنْ بَخْسِ الْمِكْيَالِ وَ الْمِيزَانِ",
          "وَ رَأَيْتَ سَفْكَ الدِّمَاءِ يُسْتَخَفُّ بِهَا وَ رَأَيْتَ الرَّجُلَ يَطْلُبُ الرِّئَاسَةَ لِعَرَضِ الدُّنْيَا وَ يَشْهَرُ نَفْسَهُ بِخُبْثِ اللِّسَانِ لِيُتَّقَى وَ تُسْنَدَ إِلَيْهِ الْأُمُورُ وَ رَأَيْتَ الصَّلَاةَ قَدِ اسْتُخِفَّ بِهَا وَ رَأَيْتَ الرَّجُلَ عِنْدَهُ الْمَالُ الْكَثِيرُ ثُمَّ لَمْ يُزَكِّهِ مُنْذُ مَلَكَهُ وَ رَأَيْتَ الْمَيِّتَ يُنْبَشُ مِنْ قَبْرِهِ وَ يُؤْذَى وَ تُبَاعُ أَكْفَانُهُ وَ رَأَيْتَ الْهَرْجَ قَدْ كَثُرَ وَ رَأَيْتَ الرَّجُلَ يُمْسِي نَشْوَانَ وَ يُصْبِحُ سَكْرَانَ لَا يَهْتَمُّ بِمَا النَّاسُ فِيهِ وَ رَأَيْتَ الْبَهَائِمَ تُنْكَحُ وَ رَأَيْتَ الْبَهَائِمَ يَفْرِسُ بَعْضُهَا بَعْضاً ",
          "وَ رَأَيْتَ الرَّجُلَ يَخْرُجُ إِلَى مُصَلَّاهُ وَ يَرْجِعُ وَ لَيْسَ عَلَيْهِ شَيْ‏ءٌ مِنْ ثِيَابِهِ وَ رَأَيْتَ قُلُوبَ النَّاسِ قَدْ قَسَتْ وَ جَمَدَتْ أَعْيُنُهُمْ وَ ثَقُلَ الذِّكْرُ عَلَيْهِمْ وَ رَأَيْتَ السُّحْتَ قَدْ ظَهَرَ يُتَنَافَسُ فِيهِ وَ رَأَيْتَ الْمُصَلِّيَ إِنَّمَا يُصَلِّي لِيَرَاهُ النَّاسُ وَ رَأَيْتَ الْفَقِيهَ يَتَفَقَّهُ لِغَيْرِ الدِّينِ يَطْلُبُ الدُّنْيَا وَ الرِّئَاسَةَ وَ رَأَيْتَ النَّاسَ مَعَ مَنْ غَلَبَ وَ رَأَيْتَ طَالِبَ الْحَلَالِ يُذَمُّ وَ يُعَيَّرُ وَ طَالِبَ الْحَرَامِ يُمْدَحُ وَ يُعَظَّمُ وَ رَأَيْتَ الْحَرَمَيْنِ يُعْمَلُ فِيهِمَا بِمَا لَا يُحِبُّ اللَّهُ لَا يَمْنَعُهُمْ مَانِعٌ وَ لَا يَحُولُ بَيْنَهُمْ وَ بَيْنَ الْعَمَلِ الْقَبِيحِ أَحَدٌ وَ رَأَيْتَ الْمَعَازِفَ ظَاهِرَةً فِي الْحَرَمَيْنِ ",
          "وَ رَأَيْتَ الرَّجُلَ يَتَكَلَّمُ بِشَيْ‏ءٍ مِنَ الْحَقِّ وَ يَأْمُرُ بِالْمَعْرُوفِ وَ يَنْهَى عَنِ الْمُنْكَرِ فَيَقُومُ إِلَيْهِ مَنْ يَنْصَحُهُ فِي نَفْسِهِ فَيَقُولُ هَذَا عَنْكَ مَوْضُوعٌ  وَ رَأَيْتَ النَّاسَ يَنْظُرُ بَعْضُهُمْ إِلَى بَعْضٍ وَ يَقْتَدُونَ بِأَهْلِ الشُّرُورِ وَ رَأَيْتَ مَسْلَكَ الْخَيْرِ وَ طَرِيقَهُ خَالِياً لَا يَسْلُكُهُ أَحَدٌ وَ رَأَيْتَ الْمَيِّتَ يُهْزَأُ بِهِ فَلَا يَفْزَعُ لَهُ أَحَدٌ وَ رَأَيْتَ كُلَّ عَامٍ يَحْدُثُ فِيهِ مِنَ الشَّرِّ وَ الْبِدْعَةِ أَكْثَرُ مِمَّا كَانَ وَ رَأَيْتَ الْخَلْقَ وَ الْمَجَالِسَ لَا يُتَابِعُونَ إِلَّا الْأَغْنِيَاءَ وَ رَأَيْتَ الْمُحْتَاجَ يُعْطَى عَلَى الضَّحِكِ بِهِ وَ يُرْحَمُ لِغَيْرِ وَجْهِ اللَّهِ ",
          "وَ رَأَيْتَ الْآيَاتِ فِي السَّمَاءِ لَا يَفْزَعُ لَهَا أَحَدٌ وَ رَأَيْتَ النَّاسَ يَتَسَافَدُونَ كَمَا يَتَسَافَدُ الْبَهَائِمُ لَا يُنْكِرُ أَحَدٌ مُنْكَراً تَخَوُّفاً مِنَ النَّاسِ وَ رَأَيْتَ الرَّجُلَ يُنْفِقُ الْكَثِيرَ فِي غَيْرِ طَاعَةِ اللَّهِ وَ يَمْنَعُ الْيَسِيرَ فِي طَاعَةِ اللَّهِ وَ رَأَيْتَ الْعُقُوقَ قَدْ ظَهَرَ وَ اسْتُخِفَّ بِالْوَالِدَيْنِ وَ كَانَا مِنْ أَسْوَإِ النَّاسِ حَالًا عِنْدَ الْوَلَدِ وَ يَفْرَحُ بِأَنْ يَفْتَرِيَ عَلَيْهِمَا وَ رَأَيْتَ النِّسَاءَ وَ قَدْ غَلَبْنَ عَلَى الْمُلْكِ وَ غَلَبْنَ عَلَى كُلِّ أَمْرٍ لَا يُؤْتَى إِلَّا مَا لَهُنَّ فِيهِ هَوًى وَ رَأَيْتَ ابْنَ الرَّجُلِ يَفْتَرِي عَلَى أَبِيهِ وَ يَدْعُو عَلَى وَالِدَيْهِ وَ يَفْرَحُ بِمَوْتِهِمَا",
          "وَ رَأَيْتَ الرَّجُلَ إِذَا مَرَّ بِهِ يَوْمٌ وَ لَمْ يَكْسِبْ فِيهِ الذَّنْبَ الْعَظِيمَ مِنْ فُجُورٍ أَوْ بَخْسِ مِكْيَالٍ أَوْ مِيزَانٍ أَوْ غِشْيَانِ حَرَامٍ أَوْ شُرْبِ مُسْكِرٍ كَئِيباً حَزِيناً يَحْسَبُ أَنَّ ذَلِكَ الْيَوْمَ عَلَيْهِ وَضِيعَةٌ مِنْ عُمُرِهِ وَ رَأَيْتَ السُّلْطَانَ يَحْتَكِرُ الطَّعَامَ وَ رَأَيْتَ أَمْوَالَ ذَوِي الْقُرْبَى تُقْسَمُ فِي الزُّورِ وَ يُتَقَامَرُ بِهَا وَ تُشْرَبُ بِهَا الْخُمُورُ وَ رَأَيْتَ الْخَمْرَ يُتَدَاوَى بِهَا وَ يُوصَفُ لِلْمَرِيضِ وَ يُسْتَشْفَى بِهَا",
          "وَ رَأَيْتَ النَّاسَ قَدِ اسْتَوَوْا فِي تَرْكِ الْأَمْرِ بِالْمَعْرُوفِ وَ النَّهْيِ عَنِ الْمُنْكَرِ وَ تَرْكِ التَّدَيُّنِ بِهِ وَ رَأَيْتَ رِيَاحَ الْمُنَافِقِينَ وَ أَهْلِ النِّفَاقِ قَائِمَةً وَ رِيَاحَ أَهْلِ الْحَقِّ لَا تَحَرَّكُ وَ رَأَيْتَ الْأَذَانَ بِالْأَجْرِ وَ الصَّلَاةَ بِالْأَجْرِ وَ رَأَيْتَ الْمَسَاجِدَ مُحْتَشِيَةً مِمَّنْ لَا يَخَافُ اللَّهَ مُجْتَمِعُونَ فِيهَا لِلْغِيبَةِ وَ أَكْلِ لُحُومِ أَهْلِ الْحَقِّ وَ يَتَوَاصَفُونَ فِيهَا شَرَابَ الْمُسْكِرِ وَ رَأَيْتَ السَّكْرَانَ يُصَلِّي بِالنَّاسِ وَ هُوَ لَا يَعْقِلُ وَ لَا يُشَانُ بِالسُّكْرِ وَ إِذَا سَكِرَ أُكْرِمَ وَ اتُّقِيَ وَ خِيفَ وَ تُرِكَ لَا يُعَاقَبُ وَ يُعْذَرُ بِسُكْرِهِ",
          "وَ رَأَيْتَ مَنْ أَكَلَ أَمْوَالَ الْيَتَامَى يُحْمَدُ بِصَلَاحِهِ وَ رَأَيْتَ الْقُضَاةَ يَقْضُونَ بِخِلَافِ مَا أَمَرَ اللَّهُ وَ رَأَيْتَ الْوُلَاةَ يَأْتَمِنُونَ الْخَوَنَةَ لِلطَّمَعِ وَ رَأَيْتَ الْمِيرَاثَ قَدْ وَضَعَتْهُ الْوُلَاةُ لِأَهْلِ الْفُسُوقِ وَ الْجُرْأَةِ عَلَى اللَّهِ يَأْخُذُونَ مِنْهُمْ وَ يُخَلُّونَهُمْ وَ مَا يَشْتَهُونَ وَ رَأَيْتَ الْمَنَابِرَ يُؤْمَرُ عَلَيْهَا بِالتَّقْوَى وَ لَا يَعْمَلُ الْقَائِلُ بِمَا يَأْمُرُ وَ رَأَيْتَ الصَّلَاةَ قَدِ اسْتُخِفَّ بِأَوْقَاتِهَا وَ رَأَيْتَ الصَّدَقَةَ بِالشَّفَاعَةِ لَا يُرَادُ بِهَا وَجْهُ اللَّهِ وَ يُعْطَى لِطَلَبِ النَّاسِ",
          "وَ رَأَيْتَ النَّاسَ هَمُّهُمْ بُطُونُهُمْ وَ فُرُوجُهُمْ لَا يُبَالُونَ بِمَا أَكَلُوا وَ مَا نَكَحُوا وَ رَأَيْتَ الدُّنْيَا مُقْبِلَةً عَلَيْهِمْ وَ رَأَيْتَ أَعْلَامَ الْحَقِّ قَدْ دَرَسَتْ فَكُنْ عَلَى حَذَرٍ وَ اطْلُبْ إِلَى اللَّهِ عَزَّ وَ جَلَّ النَّجَاةَ وَ اعْلَمْ أَنَّ النَّاسَ فِي سَخَطِ اللَّهِ عَزَّ وَ جَلَّ وَ إِنَّمَا يُمْهِلُهُمْ لِأَمْرٍ يُرَادُ بِهِمْ ",
          "فَكُنْ مُتَرَقِّباً وَ اجْتَهِدْ لِيَرَاكَ اللَّهُ عَزَّ وَ جَلَّ فِي خِلَافِ مَا هُمْ عَلَيْهِ فَإِنْ نَزَلَ بِهِمُ الْعَذَابُ وَ كُنْتَ فِيهِمْ عَجَّلْتَ إِلَى رَحْمَةِ اللَّهِ وَ إِنْ أُخِّرْتَ ابْتُلُوا وَ كُنْتَ قَدْ خَرَجْتَ مِمَّا هُمْ فِيهِ مِنَ الْجُرْأَةِ عَلَى اللَّهِ عَزَّ وَ جَلَّ وَ اعْلَمْ أَنَّ اللَّهَ لَا يُضِيعُ أَجْرَ الْمُحْسِنِينَ وَ أَنَّ رَحْمَةَ اللَّهِ قَرِيبٌ مِنَ الْمُحْسِنِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473097\">H 14455</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad, from one of his companions, and Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr altogether, from Muhammad Bin Abu Hamza, from Humran who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>bu Abdullah</span><sup>asws</sup> said, and those in his<sup>asws</sup> presence mention the bad condition of the Shiites in his<sup>asws</sup> presence – ",
            "So he<sup>asws</sup> said: ‘I<sup>asws</sup> was walking with Abu Ja’far Al-Mansour, and he was in his procession, and he was upon a horse and in front him were horsemen and behind him were horsemen, and I<sup>asws</sup> was upon a mule by his side. He said to me, ‘O Abu Abdullah<sup>asws</sup>, it is befitting for you<sup>asws</sup> to be happy with what Allah<sup>azwj</sup> has Given us from the strength and the victory for us, and the honour, and do not tell your people that you<sup>asws</sup> and the People<sup>asws</sup> of your<sup>asws</sup> Household are more deserving of this Command (Caliphate) than we are, lest you<sup>asws</sup> provoke us against you<sup>asws</sup> and them. ",
            "He<sup>asws</sup> said, ‘I<sup>asws</sup> replied: ‘And the one who has related this to you from me<sup>asws</sup> has lied’. He said to me<sup>asws</sup>, ‘Will you<sup>asws</sup> swear an oath on what you<sup>asws</sup> are saying?’ I<sup>asws</sup> said: ‘The people are magicians, meaning they would love to spoil me<sup>asws</sup> (my<sup>asw</sup><sup>s</sup> position) in front of you. So do not listen to them, for people are more in need of you than you are of us’. He said to me<sup>asws</sup>, ‘Do you<sup>asws</sup> remember the day when I asked you<sup>asws</sup>, ‘Is there a kingdom for us?’, and you<sup>asws</sup> said, ‘Yes, very lengthy and vast’, you will not cease to be in the time in your command and the space in your world until you will harm us<sup>asws</sup> by shedding sacred blood in a sacred Month, in a sacred city?’ So I<sup>asws</sup> understood that he has memorized the Hadeeth. So I<sup>asws</sup> said: ‘Perhaps Allah<sup>azwj</sup> Mighty and Majestic will Suffice for you, for I<sup>asws</sup> did not apply this especially for you, but rather this is a Hadeeth which I<sup>asws</sup> reported to you. Maybe it is for someone else from the people of your household who will govern that’. He was silent from me<sup>asws</sup>.  ",
            "When I<sup>asws</sup> returned to my<sup>asws</sup> home, one of our<sup>asws</sup> friends came up. He said, ‘May I be sacrificed for you<sup>asws</sup>. By Allah<sup>azwj</sup>, I saw you<sup>asws</sup> in the procession of Abu Ja’far (Al-Mansour) and you<sup>asws</sup> were upon a mule and he was upon a horse, and he was speaking to you like an overseer speaks to an underling. So I said to myself, ‘This is the Proof<sup>asws</sup> of Allah<sup>azwj</sup> upon the creatures and the Master<sup>asws</sup> of this command (Caliphate) who should be followed, and this other one is acting by compulsion, and he kills the children of the Prophets<sup>as</sup>, and sheds the blood in the earth by what Allah<sup>azwj</sup> does not Like, and he is in his procession, and you<sup>asws</sup> are upon a mule’, so that entered a doubt in me to the extent that I feared for my Religion and myself’. ",
            "He<sup>asws</sup> said: ‘I<sup>asws</sup> said: ‘Had you seen those who were around me<sup>asws</sup>, and in front of me<sup>asws</sup>, and behind me<sup>asws</sup>, and on my<sup>asws</sup> right, and on my<sup>asws</sup> left from the Angels, you would have despised him and despised what he was indulging in’. He said, ‘Now my heart is tranquil’.",
            "Then he said, ‘Until when will these be ruling (us), or until when will we get rest from them (their injustices)?’ I<sup>asws</sup> said: ‘Do you not know that there is a time allocated for everything?’ He said, ‘Yes’. So I<sup>asws</sup> said: ‘Would it benefit you if you come to know that this command (Caliphate), when it goes, it would be quicker than the blink of an eye? If you come to know their condition in the Presence of Allah<sup>azwj</sup> Mighty and Majestic and how it would be, you would have been intense in your hatred of them. And if you were to struggle, and the people of the earth were to struggle to include them in more severity than what they are already in from the sins, you would not be able to. So do not let Satan<sup>la</sup> excite you. ",
            "The Honour is for Allah<sup>azwj</sup> and for His<sup>azwj</sup> Messenger<sup>saww</sup>, and for the Believers, but the hypocrites do not know. Nay! The one who waits for our<sup>asws</sup> Command, and observes patient upon what he see from the sufferings and the fear, tomorrow he would be in our<sup>asws</sup> group. So if you were to see that the truth has died and its people have gone away, and you will see, that the injustice has encompassed the country, and you will see that for the Quran they are inventing new things which are not in it and giving it a perspective in accordance to their own whims, and you will see that the Religion has receded like the receding of the water,",
            "and you will see the people of the falsehood to have achieved high positions above the people of the truth, and you will see the evil having been manifested with no one preventing it and actually finding excuses for its committers, and you will see the mischief having appeared, and the males satisfying themselves with the males, and the women satisfying themselves with the females, and you will see the Believer maintaining silence with no one accepting his words, and you will see the mischievous lying and no one refuting his lies and his falsity, and you will see the young ones belittling the grownups, and you will see the relatives with their relationships being cut-off, and you will see the one who is praised for his mischief and he laughs at it and his words are not being refuted, ",
            "and you will see the young boy being obedient as the women are, and will see the women getting married to women, and you will see the praises being increased, and you will see the man spending the wealth in ways other than in obedience to Allah<sup>azwj</sup> with no one preventing him or holding back his hand, and you will see the onlookers seeking Refuge with Allah<sup>azwj</sup> from what they see the (situation of the) Believers are in from the struggling, and you will see the neighbour hurt his neighbour and there is no one to prevent him, and you will see the infidel rejoicing at what they see in the Believer to be in, becoming happier at what he sees in the earth from the mischief, and you will see the intoxicants being drunk openly and the ones who do not fear Allah<sup>azwj</sup> Mighty and Majestic gathering for it, ",
            "and you will see the enjoining of the good being disgraced, and you will see the mischievous one indulging in what Allah<sup>azwj</sup> does not Like and being magnified and praised for it, and you will see the Masters<sup>asws</sup> of the Signs being belittled along with those who love them<sup>asws</sup>, and you will see the way of the good being cut-off and the way of the evil being travelled upon, and you will see the House of Allah<sup>azwj</sup> being blocked and orders issued for abandoning it, and you will see the man saying what he does not do, and you will see the men lustfule to the men and the women to the women, and you will see the man earning a living from his behind and the woman from her genitals, and you will see the women taking to the gatherings like the gatherings of the men, ",
            "and you will see the femininity appearing in the children of Al-Abbas and their usage of dyes and combs like the usage of these by the woman for her husband, and the men giving wealth for their genitals, and the man competing for the man and envying him, and the wealthy would be considered more honourable than the Believer, and the usury becoming publicised and he does not care, and the women being praise for their adultery, and you will see the woman preparing her husband to be married to the men, and you will see most of the people and the best of the households helping the women on their mischief,",
            "and you will see the Believer in grief, belittled, humiliated, and you will see the innovations and the adultery becoming apparent, and you will see the people arguing by false testimonies, and you will see the Prohibited being made to be permissible and the Permissible being made to be prohibited, and you will see the Religion being taken by the opinion and the Book and its Regulations being neglected, and you will see the night not being taken as a cover for one to be audacious against Allah<sup>azwj</sup>, and you will see the Believer not being able to deny except by his heart, and you will see a great amount of wealth being spent in ways which arouse the Anger of Allah<sup>azwj</sup> Mighty and Majestic, and you will see the rulers going closer to the people of disbelief and distancing themselves from the people of the good, and you will see the rulers accepting bribes for the Judgements, and you will see the rulers welcoming the one who gives more, ",
            "and you will see the (forbidden) near relatives being married (incest) and being satisfied by it, and you will see the man killing another one based upon false accusation and upon conjecture, and differing with the man who sacrifices his self and his wealth, and you will see the man living upon the gifts of the women, and you will see the man knowingly eating from the immoral earnings of his woman and lives by it, and you will see the woman overpowering her husband and doing what he does not like and spend on her husband, and you will see the man hiring out his woman and his slave girl and is pleased with the lowest of the food and the drink, and you will see a lot of the faith in Allah<sup>azwj</sup> Mighty and Majestic by the false pretence, and you will see the gambling becoming apparent,  ",
            "and you will see the intoxicating drinks being sold openly and there is no one to prevent it, and you will see the women giving themselves to the people of disbelief, and you will see the amusement clubs having appeared and the passer by does not prevent anyone nor does anyone having the guts to prevent it, and you will see the honourable one being humbled before the one whose authority they fear, and you will see the one who loves us<sup>asws</sup> being falsified and his testimony not being accepted, and you will see the false words being competed for, and you will see the Quran has become heavy upon the people to listen to it and the people find it easier to listen to the falsehood, ",
            "and you will see the neighbour respecting the neighbour out of fear from his tongue, and you will see the Limits (Penalties of the Law) being neglected and being used in accordance with whims, and you will see the Masjids having been decorated, and you will see the most truthful one among the people to be the one who is a fabricator of the lies, and you will see the evil to have appeared and the pursuit of gossip, and you will see the transgression to be widespread, and you will see backbiting to be liked and some people giving glad tidings by it to the others, and you will see the seeking of the Pilgrimage and the Jihaad for other than Allah<sup>azwj</sup>, and you will see the Sultan humiliating the Believer for the sake of the infidel, you will see the demolition to be more than the construction, and you will see the man making a living out of under-estimation of the weights and measures (cheating by measuring less), ",
            "and you will see the shedding of the blood being taken lightly, and you will see the man seeking the leadership for coveting the world and to make himself famous by bad mouthing so that he would be feared and the matters would depend upon him, and you will see the Prayer being taken lightly, and you will see the man who has a lot of wealth then not purifying it (Zakaat) since he acquired it, and you will see the dead being exhumed from his grave, hurt and his shroud being sold, and you will see that the anarchy to have increased, and you will see the man jubilant and in the morning intoxicated not caring about what the people think of him, and you will see the animals being married to him, and you will see the animals ride upon each other,  ",
            "and you will see the man come out to his Prayer place and return and there would be no signs of any gains upon him, and you will see the hearts of the people to have become hard and their eyes frozen, and the Remembrance to have become heavy upon them, and you will see the illegal money to be apparent and contested for, and you will see the Praying one who is Praying just to be seen by the people, and you will see the <span class=\"iTxt\">Faqih</span> gaining understanding for other than Religion, to covet the world and the leadership, and you will see the people to be with the one who overcomes, you will see the seeking of the lawful to be condemned and reproached and the seeking of the unlawful to be praised and magnified, and you will see in two Sacred Places (Al-Haramain) acts being committed which Allah<sup>azwj</sup> does not Like with no hindrance preventing these and no one coming in between these and the ugly acts, and you will see the musical instruments appear in the two Sacred Places (Al-Haramain), ",
            "And you will see the man speak about something from the truth and enjoin the doing of the good and prohibit from the evil, so the one being advised would stand up to him and say, ‘this is not your subject (responsibility), and you will see the people looking towards each other and follow the people of the evil, and you will see the path of the good and its way to be empty, no one travelling over it, and you will see the dead being mocked at and no one scared of it, and you will see every year new evil things and the innovations more than before, and you will see the people and the gatherings not following anyone except the rich, and you will see the needy been given so that they would be laughed at due to it, and being sympathised for other than the sake of Allah<sup>azwj</sup>,",
            "you will see signs appearing in the sky and no one fearing it, and you will see the people copulating like the copulation of the animals, with no one expressing abhorrence out of fear from the people, and you will see the man spending a great deal in ways other than the obedience to Allah<sup>azwj</sup> and being prevented easily (to spend) in the obedience to Allah<sup>azwj</sup>, and you will see the impiousness to have appeared and the belittling of the parents, and be in the most evil of the condition of the people with the children who will be happy with the one who throws accusations at them, and you will see the people, and you will see the women to have overcome upon the kingdom and to have overcome over all the commands brought about only due to the desire for them, and you will see the son of the man accusing against his father and making claims against his parent and being happy at their death,",
            "and you will see the man who passes a day in which he did not commit any great sins from the immoralities, or the understating of the weights or the measures, or unlawful acts, or drinking intoxicating drinks, he would become depressed and sad to have wasted that day from his life, and you will see the Sultan hoarding foodstuffs, and you will see the wealth of the near relatives being distributed in the false ways, and to be gambled with, and to be drunk by it the intoxicating drinks, and you will see the intoxication being utilised as medication and being prescribed to the sick to be cured by it.  ",
            "and you will see the people to have equalized regarding the avoidance of the enjoining of the good and the forbidding of the evil and the avoidance of the making of the Religion by it, and you will see the words of the hypocrites and the people of the hypocrisy being maintained and the words of the people of the truth wasted unnoticed, and you will see the Call to Prayer (Azaan) being given for the payment and the Prayer for the payment, and you will see the Masjids being filled from those who do not fear Allah<sup>azwj</sup>, gathering therein for the backbiting and eating of the flesh of the people of the truth and the intoxicating drinks would be described therein, and you will see the intoxicated ones Praying with (leading) the people having no understanding and will not be stained due to his intoxication, and when he is intoxicated he is respected and feared, and feared to be ignored, not being punished and being excused for his intoxicated state,",
            "and you will see the one who eats the wealth of the orphans being praised for his righteousness, and you will see the judges issuing Judgements in opposition to what Allah<sup>azwj</sup> has Ordered, and you will see the rulers entrusting to the treacherous for the greed, and you will see the rulers to have placed the inheritance to the people of the mischief and those audacious against Allah<sup>azwj</sup>, taking from them and leaving with them what they desire, and you will see upon the Pulpits preachers preaching the piety but the speaker does not practice what he has preached, and you will see the Prayer to have been taken lightly at its prescribed times, and you will see the charity given by intercession not intending by it the Perspective of Allah<sup>azwj</sup> and being given for seeking the (good will of) people,",
            "and you will see the people to be mainly concerned with their stomachs and their genitals, not caring what they eat and who they have relationship with, and you will see the world welcoming them, and you will see the banners of the truth to be a lesson for the one who is cautious and seeks salvation with Allah<sup>azwj</sup> Mighty and Majestic, and know that the people are subject to the Wrath of Allah<sup>azwj</sup> Mighty and Majestic, but rather He<sup>azwj</sup> has Given them respite of life which He<sup>azwj</sup> Wants to Give them. ",
            "So become expectant and spare no effort for Allah<sup>azwj</sup> Mighty and Majestic to See you to be against what they are indulging in. If the Punishment descends upon them and you were to be among them, you can hasten to the Mercy of Allah<sup>azwj</sup>. If you were to hesitate you will be involved in it, and you should have come out from what they are indulged in from the audacities against Allah<sup>azwj</sup> Mighty and Majestic. And know, that Allah<sup>azwj</sup> does not Waste the Recompense of the good doers, and that the Mercy of Allah<sup>azwj</sup> is very Near to those who do good’."
          ],
          "en.sarwar": [
            "7. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from one of his companions, and Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr altogether, from Muhammad Bin Abu Hamza, from Humran who said: ‘Abu Abdullah (a.s.) said, and those in his (a.s.) presence mention the bad condition of the Shiites in his (a.s.) presence – So he (a.s.) said: ‘I (a.s.) was walking with Abu Ja’far Al-Mansour, and he was in his procession, and he was upon a horse and in front him were horsemen and behind him were horsemen, and I (a.s.) was upon a mule by his side. He said to me, ‘O Abu Abdullah (a.s.), it is befitting for you (a.s.) to be happy with what Allah (azwj) has Given us from the strength and the victory for us, and the honour, and do not tell your people that you (a.s.) and the People (a.s.) of your (a.s.) Household are more deserving of this Command (Caliphate) than we are, lest you (a.s.) provoke us against you (a.s.) and them. He (a.s.) said, ‘I (a.s.) replied: ‘And the one who has related this to you from me (a.s.) has lied’. He said to me (a.s.), ‘Will you (a.s.) swear an oath on what you (a.s.) are saying?’ I (a.s.) said: ‘The people are magicians, meaning they would love to spoil me (a.s.) (my (a.s.) position) in front of you. So do not listen to them, for people are more in need of you than you are of us’. He said to me (a.s.), ‘Do you (a.s.) remember the day when I asked you (a.s.), ‘Is there a kingdom for us?’, and you (a.s.) said, ‘Yes, very lengthy and vast’, you will not cease to be in the time in your command and the space in your world until you will harm us (a.s.) by shedding sacred blood in a sacred Month, in a sacred city?’ So I (a.s.) understood that he has memorized the Hadeeth. So I (a.s.) said: ‘Perhaps Allah (azwj) Mighty and Majestic will Suffice for you, for I (a.s.) did not apply this especially for you, but rather this is a Hadeeth which I (a.s.) reported to you. Maybe it is for someone else from the people of your household who will govern that’. He was silent from me (a.s.). When I (a.s.) returned to my (a.s.) home, one of our (a.s.) friends came up. He said, ‘May I be sacrificed for you (a.s.). By Allah (azwj), I saw you (a.s.) in the procession of Abu Ja’far (Al-Mansour) and you (a.s.) were upon a mule and he was upon a horse, and he was speaking to you like an overseer speaks to an underling. So I said to myself, ‘This is the Proof (a.s.) of Allah (azwj) upon the creatures and the Master (a.s.) of this command (Caliphate) who should be followed, and this other one is acting by compulsion, and he kills the children of the Prophets (as), and sheds the blood in the earth by what Allah (azwj) does not Like, and he is in his procession, and you (a.s.) are upon a mule’, so that entered a doubt in me to the extent that I feared for my Religion and myself’. He (a.s.) said: ‘I (a.s.) said: ‘Had you seen those who were around me (a.s.), and in front of me (a.s.), and behind me (a.s.), and on my (a.s.) right, and on my (a.s.) left from the Angels, you would have despised him and despised what he was indulging in’. He said, ‘Now my heart is tranquil’. Then he said, ‘Until when will these be ruling (us), or until when will we get rest from them (their injustices)?’ I (a.s.) said: ‘Do you not know that there is a time allocated for everything?’ He said, ‘Yes’. So I (a.s.) said: ‘Would it benefit you if you come to know that this command (Caliphate), when it goes, it would be quicker than the blink of an eye? If you come to know their condition in the Presence of Allah (azwj) Mighty and Majestic and how it would be, you would have been intense in your hatred of them. And if you were to struggle, and the people of the earth were to struggle to include them in more severity than what they are already in from the sins, you would not be able to. So do not let Satan (la) excite you. The Honour is for Allah (azwj) and for His (azwj) Messenger (saww), and for the Believers, but the hypocrites do not know. Nay! The one who waits for our (a.s.) Command, and observes patient upon what he see from the sufferings and the fear, tomorrow he would be in our (a.s.) group. So if you were to see that the truth has died and its people have gone away, and you will see, that the injustice has encompassed the country, and you will see that for the Quran they are inventing new things which are not in it and giving it a perspective in accordance to their own whims, and you will see that the Religion has receded like the receding of the water, and you will see the people of the falsehood to have achieved high positions above the people of the truth, and you will see the evil having been manifested with no one preventing it and actually finding excuses for its committers, and you will see the mischief having appeared, and the males satisfying themselves with the males, and the women satisfying themselves with the females, and you will see the Believer maintaining silence with no one accepting his words, and you will see the mischievous lying and no one refuting his lies and his falsity, and you will see the young ones belittling the grownups, and you will see the relatives with their relationships being cut-off, and you will see the one who is praised for his mischief and he laughs at it and his words are not being refuted, and you will see the young boy being obedient as the women are, and will see the women getting married to women, and you will see the praises being increased, and you will see the man spending the wealth in ways other than in obedience to Allah (azwj) with no one preventing him or holding back his hand, and you will see the onlookers seeking Refuge with Allah (azwj) from what they see the (situation of the) Believers are in from the struggling, and you will see the neighbour hurt his neighbour and there is no one to prevent him, and you will see the infidel rejoicing at what they see in the Believer to be in, becoming happier at what he sees in the earth from the mischief, and you will see the intoxicants being drunk openly and the ones who do not fear Allah (azwj) Mighty and Majestic gathering for it, and you will see the enjoining of the good being disgraced, and you will see the mischievous one indulging in what Allah (azwj) does not Like and being magnified and praised for it, and you will see the Masters (a.s.) of the Signs being belittled along with those who love them (a.s.), and you will see the way of the good being cut-off and the way of the evil being travelled upon, and you will see the House of Allah (azwj) being blocked and orders issued for abandoning it, and you will see the man saying what he does not do, and you will see the men lustfule to the men and the women to the women, and you will see the man earning a living from his behind and the woman from her genitals, and you will see the women taking to the gatherings like the gatherings of the men, and you will see the femininity appearing in the children of Al-Abbas and their usage of dyes and combs like the usage of these by the woman for her husband, and the men giving wealth for their genitals, and the man competing for the man and envying him, and the wealthy would be considered more honourable than the Believer, and the usury becoming publicised and he does not care, and the women being praise for their adultery, and you will see the woman preparing her husband to be married to the men, and you will see most of the people and the best of the households helping the women on their mischief, and you will see the Believer in grief, belittled, humiliated, and you will see the innovations and the adultery becoming apparent, and you will see the people arguing by false testimonies, and you will see the Prohibited being made to be permissible and the Permissible being made to be prohibited, and you will see the Religion being taken by the opinion and the Book and its Regulations being neglected, and you will see the night not being taken as a cover for one to be audacious against Allah (azwj), and you will see the Believer not being able to deny except by his heart, and you will see a great amount of wealth being spent in ways which arouse the Anger of Allah (azwj) Mighty and Majestic, and you will see the rulers going closer to the people of disbelief and distancing themselves from the people of the good, and you will see the rulers accepting bribes for the Judgements, and you will see the rulers welcoming the one who gives more, and you will see the (forbidden) near relatives being married (incest) and being satisfied by it, and you will see the man killing another one based upon false accusation and upon conjecture, and differing with the man who sacrifices his self and his wealth, and you will see the man living upon the gifts of the women, and you will see the man knowingly eating from the immoral earnings of his woman and lives by it, and you will see the woman overpowering her husband and doing what he does not like and spend on her husband, and you will see the man hiring out his woman and his slave girl and is pleased with the lowest of the food and the drink, and you will see a lot of the faith in Allah (azwj) Mighty and Majestic by the false pretence, and you will see the gambling becoming apparent, and you will see the intoxicating drinks being sold openly and there is no one to prevent it, and you will see the women giving themselves to the people of disbelief, and you will see the amusement clubs having appeared and the passer by does not prevent anyone nor does anyone having the guts to prevent it, and you will see the honourable one being humbled before the one whose authority they fear, and you will see the one who loves us (a.s.) being falsified and his testimony not being accepted, and you will see the false words being competed for, and you will see the Quran has become heavy upon the people to listen to it and the people find it easier to listen to the falsehood, and you will see the neighbour respecting the neighbour out of fear from his tongue, and you will see the Limits (Penalties of the Law) being neglected and being used in accordance with whims, and you will see the Masjids having been decorated, and you will see the most truthful one among the people to be the one who is a fabricator of the lies, and you will see the evil to have appeared and the pursuit of gossip, and you will see the transgression to be widespread, and you will see backbiting to be liked and some people giving glad tidings by it to the others, and you will see the seeking of the Pilgrimage and the Jihaad for other than Allah (azwj), and you will see the Sultan humiliating the Believer for the sake of the infidel, you will see the demolition to be more than the construction, and you will see the man making a living out of under-estimation of the weights and measures (cheating by measuring less), and you will see the shedding of the blood being taken lightly, and you will see the man seeking the leadership for coveting the world and to make himself famous by bad mouthing so that he would be feared and the matters would depend upon him, and you will see the Prayer being taken lightly, and you will see the man who has a lot of wealth then not purifying it (Zakaat) since he acquired it, and you will see the dead being exhumed from his grave, hurt and his shroud being sold, and you will see that the anarchy to have increased, and you will see the man jubilant and in the morning intoxicated not caring about what the people think of him, and you will see the animals being married to him, and you will see the animals ride upon each other, and you will see the man come out to his Prayer place and return and there would be no signs of any gains upon him, and you will see the hearts of the people to have become hard and their eyes frozen, and the Remembrance to have become heavy upon them, and you will see the illegal money to be apparent and contested for, and you will see the Praying one who is Praying just to be seen by the people, and you will see the Faqih gaining understanding for other than Religion, to covet the world and the leadership, and you will see the people to be with the one who overcomes, you will see the seeking of the lawful to be condemned and reproached and the seeking of the unlawful to be praised and magnified, and you will see in two Sacred Places (Al-Haramain) acts being committed which Allah (azwj) does not Like with no hindrance preventing these and no one coming in between these and the ugly acts, and you will see the musical instruments appear in the two Sacred Places (Al-Haramain), And you will see the man speak about something from the truth and enjoin the doing of the good and prohibit from the evil, so the one being advised would stand up to him and say, ‘this is not your subject (responsibility), and you will see the people looking towards each other and follow the people of the evil, and you will see the path of the good and its way to be empty, no one travelling over it, and you will see the dead being mocked at and no one scared of it, and you will see every year new evil things and the innovations more than before, and you will see the people and the gatherings not following anyone except the rich, and you will see the needy been given so that they would be laughed at due to it, and being sympathised for other than the sake of Allah (azwj), you will see signs appearing in the sky and no one fearing it, and you will see the people copulating like the copulation of the animals, with no one expressing abhorrence out of fear from the people, and you will see the man spending a great deal in ways other than the obedience to Allah (azwj) and being prevented easily (to spend) in the obedience to Allah (azwj), and you will see the impiousness to have appeared and the belittling of the parents, and be in the most evil of the condition of the people with the children who will be happy with the one who throws accusations at them, and you will see the people, and you will see the women to have overcome upon the kingdom and to have overcome over all the commands brought about only due to the desire for them, and you will see the son of the man accusing against his father and making claims against his parent and being happy at their death, and you will see the man who passes a day in which he did not commit any great sins from the immoralities, or the understating of the weights or the measures, or unlawful acts, or drinking intoxicating drinks, he would become depressed and sad to have wasted that day from his life, and you will see the Sultan hoarding foodstuffs, and you will see the wealth of the near relatives being distributed in the false ways, and to be gambled with, and to be drunk by it the intoxicating drinks, and you will see the intoxication being utilised as medication and being prescribed to the sick to be cured by it. and you will see the people to have equalized regarding the avoidance of the enjoining of the good and the forbidding of the evil and the avoidance of the making of the Religion by it, and you will see the words of the hypocrites and the people of the hypocrisy being maintained and the words of the people of the truth wasted unnoticed, and you will see the Call to Prayer (Azaan) being given for the payment and the Prayer for the payment, and you will see the Masjids being filled from those who do not fear Allah (azwj), gathering therein for the backbiting and eating of the flesh of the people of the truth and the intoxicating drinks would be described therein, and you will see the intoxicated ones Praying with (leading) the people having no understanding and will not be stained due to his intoxication, and when he is intoxicated he is respected and feared, and feared to be ignored, not being punished and being excused for his intoxicated state, and you will see the one who eats the wealth of the orphans being praised for his righteousness, and you will see the judges issuing Judgements in opposition to what Allah (azwj) has Ordered, and you will see the rulers entrusting to the treacherous for the greed, and you will see the rulers to have placed the inheritance to the people of the mischief and those audacious against Allah (azwj), taking from them and leaving with them what they desire, and you will see upon the Pulpits preachers preaching the piety but the speaker does not practice what he has preached, and you will see the Prayer to have been taken lightly at its prescribed times, and you will see the charity given by intercession not intending by it the Perspective of Allah (azwj) and being given for seeking the (good will of) people, and you will see the people to be mainly concerned with their stomachs and their genitals, not caring what they eat and who they have relationship with, and you will see the world welcoming them, and you will see the banners of the truth to be a lesson for the one who is cautious and seeks salvation with Allah (azwj) Mighty and Majestic, and know that the people are subject to the Wrath of Allah (azwj) Mighty and Majestic, but rather He (azwj) has Given them respite of life which He (azwj) Wants to Give them. So become expectant and spare no effort for Allah (azwj) Mighty and Majestic to See you to be against what they are indulging in. If the Punishment descends upon them and you were to be among them, you can hasten to the Mercy of Allah (azwj). If you were to hesitate you will be involved in it, and you should have come out from what they are indulged in from the audacities against Allah (azwj) Mighty and Majestic. And know, that Allah (azwj) does not Waste the Recompense of the good doers, and that the Mercy of Allah (azwj) is very Near to those who do good’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:5",
  "kind": "verse_list"
}