{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 50"
        },
        "path": "/books/al-kafi:8:1:50",
        "titles": {
          "ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ (عليه السلام)",
          "en": "SERMON OF AMIR-UL-MOMINEEN<sup>asws</sup>"
        }
      }
    ],
    "index": 2321,
    "local_index": 50,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 51"
        },
        "path": "/books/al-kafi:8:1:51",
        "titles": {
          "ar": "حَدِيثُ الْعَابِدِ",
          "en": "HADEETH OF THE WORSHIPPER"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 49"
        },
        "path": "/books/al-kafi:8:1:49",
        "titles": {
          "ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )",
          "en": "A SERMON OF AMIR-UL-MOMINEEN<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:50",
    "titles": {
      "ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ (عليه السلام)",
      "en": "SERMON OF AMIR-UL-MOMINEEN<sup>asws</sup>"
    },
    "verse_count": 33,
    "verse_start_index": 15235,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 538)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15236,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14998</span>- عَلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ عَلِيٍّ جَمِيعاً عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ وَ أَحْمَدُ بْنُ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ عَلِيِّ بْنِ الْحَسَنِ التَّيْمِيِّ وَ عَلِيُّ بْنُ الْحُسَيْنِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ جَمِيعاً عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنِ الْمُنْذِرِ بْنِ جَيْفَرٍ عَنِ الْحَكَمِ بْنِ ظُهَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ جَرِيرٍ الْعَبْدِيِّ عَنِ الْأَصْبَغِ بْنِ نُبَاتَةَ قَالَ أَتَى أَمِيرَ الْمُؤْمِنِينَ (عليه السلام) عَبْدُ اللَّهِ بْنُ عُمَرَ وَ وُلْدُ أَبِي بَكْرٍ وَ سَعْدُ بْنُ أَبِي وَقَّاصٍ يَطْلُبُونَ مِنْهُ التَّفْضِيلَ لَهُمْ فَصَعِدَ الْمِنْبَرَ وَ مَالَ النَّاسُ إِلَيْهِ",
          "فَقَالَ الْحَمْدُ لِلَّهِ وَلِيِّ الْحَمْدِ وَ مُنْتَهَى الْكَرَمِ لَا تُدْرِكُهُ الصِّفَاتُ وَ لَا يُحَدُّ بِاللُّغَاتِ وَ لَا يُعْرَفُ بِالْغَايَاتِ وَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَنَّ مُحَمَّداً رَسُولَ اللَّهِ (صلى الله عليه وآله) نَبِيُّ الْهُدَى وَ مَوْضِعُ التَّقْوَى وَ رَسُولُ الرَّبِّ الْأَعْلَى جَاءَ بِالْحَقِّ مِنْ عِنْدِ الْحَقِّ لِيُنْذِرَ بِالْقُرْآنِ الْمُنِيرِ وَ الْبُرْهَانِ الْمُسْتَنِيرِ فَصَدَعَ بِالْكِتَابِ الْمُبِينِ وَ مَضَى عَلَى مَا مَضَتْ عَلَيْهِ الرُّسُلُ الْأَوَّلُونَ",
          "أَمَّا بَعْدُ أَيُّهَا النَّاسُ فَلَا يَقُولَنَّ رِجَالٌ قَدْ كَانَتِ الدُّنْيَا غَمَرَتْهُمْ فَاتَّخَذُوا الْعَقَارَ وَ فَجَّرُوا الْأَنْهَارَ وَ رَكِبُوا أَفْرَهَ الدَّوَابِّ وَ لَبِسُوا أَلْيَنَ الثِّيَابِ فَصَارَ ذَلِكَ عَلَيْهِمْ عَاراً وَ شَنَاراً إِنْ لَمْ يَغْفِرْ لَهُمُ الْغَفَّارُ إِذَا مَنَعْتُهُمْ مَا كَانُوا فِيهِ يَخُوضُونَ وَ صَيَّرْتُهُمْ إِلَى مَا يَسْتَوْجِبُونَ فَيَفْقِدُونَ ذَلِكَ فَيَسْأَلُونَ وَ يَقُولُونَ ظَلَمَنَا ابْنُ أَبِي طَالِبٍ وَ حَرَمَنَا وَ مَنَعَنَا حُقُوقَنَا",
          "فَاللَّهُ عَلَيْهِمُ الْمُسْتَعَانُ مَنِ اسْتَقْبَلَ قِبْلَتَنَا وَ أَكَلَ ذَبِيحَتَنَا وَ آمَنَ بِنَبِيِّنَا وَ شَهِدَ شَهَادَتَنَا وَ دَخَلَ فِي دِينِنَا أَجْرَيْنَا عَلَيْهِ حُكْمَ الْقُرْآنِ وَ حُدُودَ الْإِسْلَامِ لَيْسَ لِأَحَدٍ عَلَى أَحَدٍ فَضْلٌ إِلَّا بِالتَّقْوَى أَلَا وَ إِنَّ لِلْمُتَّقِينَ عِنْدَ اللَّهِ تَعَالَى أَفْضَلَ الثَّوَابِ وَ أَحْسَنَ الْجَزَاءِ وَ الْمَآبِ لَمْ يَجْعَلِ اللَّهُ تَبَارَكَ وَ تَعَالَى الدُّنْيَا لِلْمُتَّقِينَ ثَوَاباً وَ مَا عِنْدَ اللَّهِ خَيْرٌ لِلْأَبْرَارِ ",
          "انْظُرُوا أَهْلَ دِينِ اللَّهِ فِيمَا أَصَبْتُمْ فِي كِتَابِ اللَّهِ وَ تَرَكْتُمْ عِنْدَ رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ جَاهَدْتُمْ بِهِ فِي ذَاتِ اللَّهِ أَ بِحَسَبٍ أَمْ بِنَسَبٍ أَمْ بِعَمَلٍ أَمْ بِطَاعَةٍ أَمْ زَهَادَةٍ وَ فِيمَا أَصْبَحْتُمْ فِيهِ رَاغِبِينَ فَسَارِعُوا إِلَى مَنَازِلِكُمْ رَحِمَكُمُ اللَّهُ الَّتِي أُمِرْتُمْ بِعِمَارَتِهَا الْعَامِرَةِ الَّتِي لَا تَخْرَبُ الْبَاقِيَةِ الَّتِي لَا تَنْفَدُ الَّتِي دَعَاكُمْ إِلَيْهَا وَ حَضَّكُمْ عَلَيْهَا وَ رَغَّبَكُمْ فِيهَا وَ جَعَلَ الثَّوَابَ عِنْدَهُ عَنْهَا ",
          "فَاسْتَتِمُّوا نِعَمَ اللَّهِ عَزَّ ذِكْرُهُ بِالتَّسْلِيمِ لِقَضَائِهِ وَ الشُّكْرِ عَلَى نَعْمَائِهِ فَمَنْ لَمْ يَرْضَ بِهَذَا فَلَيْسَ مِنَّا وَ لَا إِلَيْنَا وَ إِنَّ الْحَاكِمَ يَحْكُمُ بِحُكْمِ اللَّهِ وَ لَا خَشْيَةَ عَلَيْهِ مِنْ ذَلِكَ أُولَئِكَ هُمُ الْمُفْلِحُونَ [وَ فِي نُسْخَةٍ وَ لَا وَحْشَةَ وَ أُولَئِكَ لَا خَوْفٌ عَلَيْهِمْ وَ لَا هُمْ يَحْزَنُونَ] ",
          "وَ قَالَ وَ قَدْ عَاتَبْتُكُمْ بِدِرَّتِيَ الَّتِي أُعَاتِبُ بِهَا أَهْلِي فَلَمْ تُبَالُوا وَ ضَرَبْتُكُمْ بِسَوْطِيَ الَّذِي أُقِيمُ بِهِ حُدُودَ رَبِّي فَلَمْ تَرْعَوُوا أَ تُرِيدُونَ أَنْ أَضْرِبَكُمْ بِسَيْفِي أَمَا إِنِّي أَعْلَمُ الَّذِي تُرِيدُونَ وَ يُقِيمُ أَوَدَكُمْ وَ لَكِنْ لَا أَشْتَرِي صَلَاحَكُمْ بِفَسَادِ نَفْسِي بَلْ يُسَلِّطُ اللَّهُ عَلَيْكُمْ قَوْماً فَيَنْتَقِمُ لِي مِنْكُمْ فَلَا دُنْيَا اسْتَمْتَعْتُمْ بِهَا وَ لَا آخِرَةَ صِرْتُمْ إِلَيْهَا فَبُعْداً وَ سُحْقاً لِأَصْحَابِ السَّعِيرِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473686\">H 14998</a> – Ali Bin Ibrahim, from his father, and Muhammad Bin Ali, together from ismail Bin Mahran, and Ahmad Bin Muhammad Bin Ahmad, from Ali Bin Al-hassan Al-Taymi, and Ali Bin Al-Husayn, from Ahmad Bin muhammad Bin Khalid, together from Ismail Bin Mahran, from Al-Munzar Bin Jayfar, from Al-Hakam Bin Zaheer, from Abdullah Bin Jareer Al-Abdy, from Al-Asbagh Bin Nubata who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-t\">‘T</span>here came to Amir</span>-ul-Momineen<sup style=\"font-weight: normal\">asws</sup>, Abdullah Bin Umar and a son of Abu Bakr, and Sa’d bin Abu Waqqas, seeking from him<sup style=\"font-weight: normal\">asws</sup> the preferential treatment for themselves. So he<sup style=\"font-weight: normal\">asws</sup> ascended the Pulpit, and the people turned their attention towards him<sup style=\"font-weight: normal\">asws</sup>. ",
            "So he<sup style=\"font-weight: normal\">asws</sup> said: ‘The Praise is due to Allah<sup style=\"font-weight: normal\">azwj</sup> to Whom belongs all Praise, and Who is extremely Generous. The descriptions do not fathom Him<sup style=\"font-weight: normal\">azwj</sup> nor is He<sup style=\"font-weight: normal\">azwj</sup> limited by the languages, nor can He<sup style=\"font-weight: normal\">azwj</sup> be understood by the wildest imaginations. And I<sup style=\"font-weight: normal\">asws</sup> testify that there is no god except Allah<sup style=\"font-weight: normal\">azwj</sup>, One with no associates to Him<sup style=\"font-weight: normal\">azwj</sup>, and that Muhammad<sup style=\"font-weight: normal\">saww</sup> is the Messenger<sup style=\"font-weight: normal\">saww</sup> of Allah<sup style=\"font-weight: normal\">azwj</sup>, a Prophet<sup style=\"font-weight: normal\">saww</sup> of Guidance and a place for the piety, and a Messenger<sup style=\"font-weight: normal\">saww</sup> of the Highest Lord<sup style=\"font-weight: normal\">azwj</sup> who<sup style=\"font-weight: normal\">saww</sup> came with the Truth from the Presence of the Truth, to warn by the Enlightening Quran and the Illuminating Proof. So he<sup style=\"font-weight: normal\">saww</sup> declared by the Manifest Book and passed away upon what the former Messengers<sup style=\"font-weight: normal\">saww</sup> had passed away. ",
            "Having said that, O you people! Do not speak of the men who were immersed in the world, and acquired properties, and made canals to flow, and rode plenty of animals, and cLuthed themselves with soft cLuthing, for that would became a source of shame and ignominy for them if the Forgiver does not Forgive them. If I<sup style=\"font-weight: normal\">asws</sup> were to prevent them from what they used to be in (affluent lifestyle) and take them to what is necessary for them, they would lose all that and they would be saying that the son<sup style=\"font-weight: normal\">asws</sup> of Abu Talib<sup style=\"font-weight: normal\">asws</sup> has been unjust to us and has prohibited us and prevented us from our rights.",
            "So, Allah<sup>azwj</sup> is the Helper against the one who (Prays) in our direction (Qiblah), and eats the animals slaughtered by us, and believes by our Prophet<sup>saww</sup>, and testifies to what we testify, and enters our Religion, we<sup>asws</sup> will apply upon him the Judgements of the Quran, and the Limits of Al-Islam. There is no preference for anyone over anyone else except by the piety. Indeed! The pious ones have the highest Rewards in the Presence of Allah<sup>azwj</sup> the High, and the best Recompense and the Return. Allah<sup>azwj</sup> did not Make the world to be for the pious ones as a form of Reward, and what is in the Possession of Allah<sup>azwj</sup> is better for the righteous. ",
            "People of the religion of Allah<sup>azwj</sup>! Consider what you find in the Book of Allah<sup>azwj</sup> and what you leave in the presence of the Rasool Allah<sup>saww</sup> and what you have been striving by for the Sake of Allah<sup>azwj</sup>, either by nobility, or by lineage, or by deeds, or by obedience, or devotion, and regarding what you were interested in. So rush to your destinations, may Allah<sup>azwj</sup> have mercy upon you, which you have been Commanded to construct. Assets, which will not spoil and will remain, and will not diminish. The dwellings to which you have received invitations for, and are being encouraged to acquire, and recommended to be interested in, and the Rewards are Made to be in His<sup>azwj</sup> Presence.",
            "So seek the completion of the Bounties of Allah<sup>azwj</sup> by the submission to His<sup>azwj</sup> Judgement, and the appreciation for His<sup>azwj</sup> Favours. The one, who is unhappy with this, is not from us<sup>asws</sup>, nor is he to us<sup>asws</sup>. The rulers who judge by the Judgement of Allah<sup>azwj</sup>, without being anxious from that, those are the successful ones’. (And in another copy: ‘They are not anxious, and those are the ones who have no fear upon them, nor shall they grieve’).",
            "And he<sup>asws</sup> said: ‘And I<sup>asws</sup> will discipline you with my<sup>asws</sup> whip which I discipline my<sup>asws</sup> family with, so do not worry, and I<sup>asws</sup> will be striking you by my whip by which I<sup>asws</sup> establish the Limits of my<sup>asws</sup> Lord<sup>azwj</sup>. So do not be scared. Do you want that I<sup>asws</sup> should strike you by my<sup>asws</sup> sword? But rather, I<sup>asws</sup> am more knowing of that which you want, and how to straighten your unevenness. But, I<sup>asws</sup> will not buy your correction in exchange for spoiling myself<sup>asws</sup>. However, Allah<sup>azwj</sup> will Make a people to overcome you and will exact my<sup>asws</sup> Revenge from you all. So you will have no world that you can enjoy in, and no Hereafter that you can look forward to. Thus, remote and crushed are the companions of the blazing Fire’."
          ],
          "en.sarwar": [
            "552. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, and Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbar, together from Ali Bin Hadeed, from Jameel, from Zurara, who has narrated the following: Abu Ja’far (a.s.) said, ‘Humran asked him (a.s.), ‘May Allah (azwj) Make me to be sacrificed for you (a.s.)! If you (a.s.) were to narrate to us when this Matter (Al-Qaim (a.s.)) is to take place, it would make us happy’. He (a.s.) said: ‘O Humran! You have friends, and brothers, and people whom you know. There used to be a scholar in the past, and he had a son who was never interested in the knowledge of his father, and did not ask him about anything, and they had a neighbour who used to come over and ask him, and take (knowledge) from him. The death presented itself to the man, so he called his son and said, ‘O my son! You have kept yourself away from what was in my possession, and had very little interest in it, and you never used to ask me about anything, whilst I had a neighbour who used to come to me, and ask me, and take (knowledge) from me, and memorise it from me. So now if you ever need anything, go to him. He introduced his neighbour to him. The man died, and his son remained. The king of that era saw a dream, so he asked around for the man. It was said to him that he had died. So the king said, ‘Did he leave a son?’ It was said to him, ‘Yes, he left a son’. So he said, ‘Bring him to me’. They went to him in order to bring him to the king. The boy said, ‘By Allah (azwj), I do not know why the king has called me, and there is no knowledge with me, and if he were to ask me about something, I would be disgraced’. He remembered what his father has bequeathed to him, so he came to the man who used to take the knowledge from his father. He said to him, ‘The king has sent for me to ask me, and I do not know why he has sent for me, and my father had ordered me that I should come to you if I ever have a need for anything’. The man said, ‘But I know very well with regards to what he has sent for you. So, if I were to inform you, then whatsoever that Allah (azwj) Brings out to you, so it would be (divided) between you and me’. He said, ‘Yes’. He took an oath from him and made a binding agreement with the boy. He said, ‘He wants to ask you about a dream that he saw, as to which era it relates to? So you should say to him, ‘This is the era of the wolf’. The boy went to him, and the king said to him, ‘Do you know why I sent for you?’ He said, ‘You sent for me intending to ask me about a dream that you saw, as to which era it relates to’. The king said, ‘You speak the truth, so inform me as to which era it relates to’. He said to him, ‘The era of the wolf’. So he ordered for an award to be given to him, and the boy grabbed it and left to go to his house. He refused to be loyal to his companion and said (to himself), ‘I will not hand over this wealth, and will consume it until I die, and there is no need for me, nor will I ever have to ask him about anything similar to what I have already asked him’. So that (situation) prevailed for as long as Allah (azwj) Desired it to. Then the king saw (another) dream, so he sent for the boy. He regretted at what he had done and said, ‘By Allah (azwj), there is no knowledge with me that I can give, and I do not know how to deal with my companion, and I have betrayed him, and never apologised to him’. Then said, ‘Let me go to him in any case and present excuses to him, hopefully he will inform me’. So he came and said to him, ‘I have done what I have done, and never apologised to you for what happened between I and you, and that which was in my hands has gone, and I have now got a need from you’. So adjure me to Allah (azwj) and do not abandon me, and I am a reliable one for you, that nothing will be given to me except that it would be (divided) between you and me. And the king has sent for me and I do not know what he will be asking me’. So he said, ‘He intends to ask you about a dream he saw, as to which era it relates to, so say to him, ‘It is for the era of the ram’. So he went to the king who said, ‘Do you know why I have sent for you?’ He said, ‘You saw a dream and you want to ask me as to which era it relates to’. So he said to him, ‘You have spoken the truth, so tell me which era this is for?’ He said, ‘This is for the era of the ram’. So he ordered a reward for him. The boy grabbed it and left for his house, and he was pondering whether he should be loyal to his companion, or whether he should not be loyal to him. Sometimes he thought that he should do it, sometimes he thought that he should not do it. Then he said (to himself), ‘I will have no need for him anymore after this time ever’, and opted for the betrayal and leave the loyalty. So that (situation) prevailed for as long as Allah (azwj) Desired it to. Then the king saw (another) dream, so he sent for him. He regretted at what he had done regarding what was between himself and his companion and said (to himself), ‘I have betrayed him twice, how shall I face him, and there is no knowledge with me. Then he decided on going to the man, and came up to him. So he swore upon Allah (azwj) Blessed and High, and asked him to let him know and inform him, and that this time he would be loyal to him, and be a trustworthy to him, and said, ‘Do not leave me upon this condition, for I will not return to the betrayal, and will be loyal to you. So he took an agreement from him. He said, ‘He has called you to ask you about a dream he saw, as to which era it relates to. So when he questions you, inform him that it is for the era of the scale (balance)’. He (a.s.) said: ‘So he came up to the king who said to him, ‘Do you know why I have sent for you?’ He said, ‘You have seen a dream and intend to ask me as to which era it relates to’. He said, ‘You have spoken the truth, so tell me which era this is for?’ He said, ‘This is for the era of the scale’. So he ordered a reward for him. The boy grabbed the reward and went with it to the man and placed it in front of him and said, ‘I have come to you with whatever was given to me, so divided it equally’. So the scholar said to him, ‘The first period was like the era of the wolf, and you were from the wolves. And the second period was the era of the ram which thinks but does not do it, and similarly you were thinking about it but were not loyal. And this period is the era of the scale, and you were, with regards to it, upon the loyalty. So grab your wealth for I have no need for it’. And he returned it back to him’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 541)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15237,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:2",
        "text": [
          "14999- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَ أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ جَمِيعاً عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ جَمِيلٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ سَأَلَهُ حُمْرَانُ فَقَالَ جَعَلَنِيَ اللَّهُ فِدَاكَ لَوْ حَدَّثْتَنَا مَتَى يَكُونُ هَذَا الْأَمْرُ فَسُرِرْنَا بِهِ",
          "فَقَالَ يَا حُمْرَانُ إِنَّ لَكَ أَصْدِقَاءَ وَ إِخْوَاناً وَ مَعَارِفَ إِنَّ رَجُلًا كَانَ فِيمَا مَضَى مِنَ الْعُلَمَاءِ وَ كَانَ لَهُ ابْنٌ لَمْ يَكُنْ يَرْغَبُ فِي عِلْمِ أَبِيهِ وَ لَا يَسْأَلُهُ عَنْ شَيْ‏ءٍ وَ كَانَ لَهُ جَارٌ يَأْتِيهِ وَ يَسْأَلُهُ وَ يَأْخُذُ عَنْهُ فَحَضَرَ الرَّجُلَ الْمَوْتُ فَدَعَا ابْنَهُ فَقَالَ يَا بُنَيَّ إِنَّكَ قَدْ كُنْتَ تَزْهَدُ فِيمَا عِنْدِي وَ تَقِلُّ رَغْبَتُكَ فِيهِ وَ لَمْ تَكُنْ تَسْأَلُنِي عَنْ شَيْ‏ءٍ وَ لِي جَارٌ قَدْ كَانَ يَأْتِينِي وَ يَسْأَلُنِي وَ يَأْخُذُ مِنِّي وَ يَحْفَظُ عَنِّي فَإِنِ احْتَجْتَ إِلَى شَيْ‏ءٍ فَأْتِهِ وَ عَرَّفَهُ جَارَهُ فَهَلَكَ الرَّجُلُ وَ بَقِيَ ابْنُهُ ",
          "فَرَأَى مَلِكُ ذَلِكَ الزَّمَانِ رُؤْيَا فَسَأَلَ عَنِ الرَّجُلِ فَقِيلَ لَهُ قَدْ هَلَكَ فَقَالَ الْمَلِكُ هَلْ تَرَكَ وَلَداً فَقِيلَ لَهُ نَعَمْ تَرَكَ ابْناً فَقَالَ ائْتُونِي بِهِ فَبُعِثَ إِلَيْهِ لِيَأْتِيَ الْمَلِكَ فَقَالَ الْغُلَامُ وَ اللَّهِ مَا أَدْرِي لِمَا يَدْعُونِي الْمَلِكُ وَ مَا عِنْدِي عِلْمٌ وَ لَئِنْ سَأَلَنِي عَنْ شَيْ‏ءٍ لَأَفْتَضِحَنَّ فَذَكَرَ مَا كَانَ أَوْصَاهُ أَبُوهُ بِهِ فَأَتَى الرَّجُلَ الَّذِي كَانَ يَأْخُذُ الْعِلْمَ مِنْ أَبِيهِ فَقَالَ لَهُ إِنَّ الْمَلِكَ قَدْ بَعَثَ إِلَيَّ يَسْأَلُنِي وَ لَسْتُ أَدْرِي فِيمَ بَعَثَ إِلَيَّ وَ قَدْ كَانَ أَبِي أَمَرَنِي أَنْ آتِيَكَ إِنِ احْتَجْتُ إِلَى شَيْ‏ءٍ فَقَالَ الرَّجُلُ وَ لَكِنِّي أَدْرِي فِيمَا بَعَثَ إِلَيْكَ فَإِنْ أَخْبَرْتُكَ فَمَا أَخْرَجَ اللَّهُ لَكَ مِنْ شَيْ‏ءٍ فَهُوَ بَيْنِي وَ بَيْنَكَ فَقَالَ نَعَمْ",
          "فَاسْتَحْلَفَهُ وَ اسْتَوْثَقَ مِنْهُ أَنْ يَفِيَ لَهُ فَأَوْثَقَ لَهُ الْغُلَامُ فَقَالَ إِنَّهُ يُرِيدُ أَنْ يَسْأَلَكَ عَنْ رُؤْيَا رَآهَا أَيُّ زَمَانٍ هَذَا فَقُلْ لَهُ هَذَا زَمَانُ الذِّئْبِ فَأَتَاهُ الْغُلَامُ فَقَالَ لَهُ الْمَلِكُ هَلْ تَدْرِي لِمَ أَرْسَلْتُ إِلَيْكَ فَقَالَ أَرْسَلْتَ إِلَيَّ تُرِيدُ أَنْ تَسْأَلَنِي عَنْ رُؤْيَا رَأَيْتَهَا أَيُّ زَمَانٍ هَذَا فَقَالَ لَهُ الْمَلِكُ صَدَقْتَ فَأَخْبِرْنِي أَيُّ زَمَانٍ هَذَا فَقَالَ لَهُ زَمَانُ الذِّئْبِ فَأَمَرَ لَهُ بِجَائِزَةٍ فَقَبَضَهَا الْغُلَامُ وَ انْصَرَفَ إِلَى مَنْزِلِهِ وَ أَبَى أَنْ يَفِيَ لِصَاحِبِهِ وَ قَالَ لَعَلِّي لَا أُنْفِدُ هَذَا الْمَالَ وَ لَا آكُلُهُ حَتَّى أَهْلِكَ وَ لَعَلِّي لَا أَحْتَاجُ وَ لَا أُسْأَلُ عَنْ مِثْلِ هَذَا الَّذِي سُئِلْتُ عَنْهُ فَمَكَثَ مَا شَاءَ اللَّهُ",
          "ثُمَّ إِنَّ الْمَلِكَ رَأَى رُؤْيَا فَبَعَثَ إِلَيْهِ يَدْعُوهُ فَنَدِمَ عَلَى مَا صَنَعَ وَ قَالَ وَ اللَّهِ مَا عِنْدِي عِلْمٌ آتِيهِ بِهِ وَ مَا أَدْرِي كَيْفَ أَصْنَعُ بِصَاحِبِي وَ قَدْ غَدَرْتُ بِهِ وَ لَمْ أَفِ لَهُ ثُمَّ قَالَ لآَتِيَنَّهُ عَلَى كُلِّ حَالٍ وَ لَأَعْتَذِرَنَّ إِلَيْهِ وَ لَأَحْلِفَنَّ لَهُ فَلَعَلَّهُ يُخْبِرُنِي فَأَتَاهُ فَقَالَ لَهُ إِنِّي قَدْ صَنَعْتُ الَّذِي صَنَعْتُ وَ لَمْ أَفِ لَكَ بِمَا كَانَ بَيْنِي وَ بَيْنَكَ وَ تَفَرَّقَ مَا كَانَ فِي يَدِي وَ قَدِ احْتَجْتُ إِلَيْكَ فَأَنْشُدُكَ اللَّهَ أَنْ لَا تَخْذُلَنِي وَ أَنَا أُوثِقُ لَكَ أَنْ لَا يَخْرُجَ لِي شَيْ‏ءٌ إِلَّا كَانَ بَيْنِي وَ بَيْنَكَ وَ قَدْ بَعَثَ إِلَيَّ الْمَلِكُ وَ لَسْتُ أَدْرِي عَمَّا يَسْأَلُنِي",
          "فَقَالَ إِنَّهُ يُرِيدُ أَنْ يَسْأَلَكَ عَنْ رُؤْيَا رَآهَا أَيُّ زَمَانٍ هَذَا فَقُلْ لَهُ إِنَّ هَذَا زَمَانُ الْكَبْشِ فَأَتَى الْمَلِكَ فَدَخَلَ عَلَيْهِ فَقَالَ لِمَا بَعَثْتُ إِلَيْكَ فَقَالَ إِنَّكَ رَأَيْتَ رُؤْيَا وَ إِنَّكَ تُرِيدُ أَنْ تَسْأَلَنِي أَيُّ زَمَانٍ هَذَا فَقَالَ لَهُ صَدَقْتَ فَأَخْبِرْنِي أَيُّ زَمَانٍ هَذَا فَقَالَ هَذَا زَمَانُ الْكَبْشِ فَأَمَرَ لَهُ بِصِلَةٍ فَقَبَضَهَا وَ انْصَرَفَ إِلَى مَنْزِلِهِ وَ تَدَبَّرَ فِي رَأْيِهِ فِي أَنْ يَفِيَ لِصَاحِبِهِ أَوْ لَا يَفِيَ لَهُ فَهَمَّ مَرَّةً أَنْ يَفْعَلَ وَ مَرَّةً أَنْ لَا يَفْعَلَ ثُمَّ قَالَ لَعَلِّي أَنْ لَا أَحْتَاجَ إِلَيْهِ بَعْدَ هَذِهِ الْمَرَّةِ أَبَداً وَ أَجْمَعَ رَأْيَهُ عَلَى الْغَدْرِ وَ تَرْكِ الْوَفَاءِ فَمَكَثَ مَا شَاءَ اللَّهُ",
          "ثُمَّ إِنَّ الْمَلِكَ رَأَى رُؤْيَا فَبَعَثَ إِلَيْهِ فَنَدِمَ عَلَى مَا صَنَعَ فِيمَا بَيْنَهُ وَ بَيْنَ صَاحِبِهِ وَ قَالَ بَعْدَ غَدْرٍ مَرَّتَيْنِ كَيْفَ أَصْنَعُ وَ لَيْسَ عِنْدِي عِلْمٌ ثُمَّ أَجْمَعَ رَأْيَهُ عَلَى إِتْيَانِ الرَّجُلِ فَأَتَاهُ فَنَاشَدَهُ اللَّهَ تَبَارَكَ وَ تَعَالَى وَ سَأَلَهُ أَنْ يُعَلِّمَهُ وَ أَخْبَرَهُ أَنَّ هَذِهِ الْمَرَّةَ يَفِي مِنْهُ وَ أَوْثَقَ لَهُ وَ قَالَ لَا تَدَعْنِي عَلَى هَذِهِ الْحَالِ فَإِنِّي لَا أَعُودُ إِلَى الْغَدْرِ وَ سَأَفِي لَكَ فَاسْتَوْثَقَ مِنْهُ فَقَالَ إِنَّهُ يَدْعُوكَ يَسْأَلُكَ عَنْ رُؤْيَا رَآهَا أَيُّ زَمَانٍ هَذَا فَإِذَا سَأَلَكَ فَأَخْبِرْهُ أَنَّهُ زَمَانُ الْمِيزَانِ",
          "قَالَ فَأَتَى الْمَلِكَ فَدَخَلَ عَلَيْهِ فَقَالَ لَهُ لِمَ بَعَثْتُ إِلَيْكَ فَقَالَ إِنَّكَ رَأَيْتَ رُؤْيَا وَ تُرِيدُ أَنْ تَسْأَلَنِي أَيُّ زَمَانٍ هَذَا فَقَالَ صَدَقْتَ فَأَخْبِرْنِي أَيُّ زَمَانٍ هَذَا فَقَالَ هَذَا زَمَانُ الْمِيزَانِ فَأَمَرَ لَهُ بِصِلَةٍ فَقَبَضَهَا وَ انْطَلَقَ بِهَا إِلَى الرَّجُلِ فَوَضَعَهَا بَيْنَ يَدَيْهِ وَ قَالَ قَدْ جِئْتُكَ بِمَا خَرَجَ لِي فَقَاسِمْنِيهِ فَقَالَ لَهُ الْعَالِمُ إِنَّ الزَّمَانَ الْأَوَّلَ كَانَ زَمَانَ الذِّئْبِ وَ إِنَّكَ كُنْتَ مِنَ الذِّئَابِ وَ إِنَّ الزَّمَانَ الثَّانِيَ كَانَ زَمَانَ الْكَبْشِ يَهُمُّ وَ لَا يَفْعَلُ وَ كَذَلِكَ كُنْتَ أَنْتَ تَهُمُّ وَ لَا تَفِي وَ كَانَ هَذَا زَمَانَ الْمِيزَانِ وَ كُنْتَ فِيهِ عَلَى الْوَفَاءِ فَاقْبِضْ مَالَكَ لَا حَاجَةَ لِي فِيهِ وَ رَدَّهُ عَلَيْهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473687\">H 14999</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, and Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbar, together from Ali Bin Hadeed, from Jameel, from Zurara, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> said, ‘Humran asked him<sup>asws</sup>, ‘May Allah<sup>azwj</sup> Make me to be sacrificed for you<sup>asws</sup>! If you<sup>asws</sup> were to narrate to us when this Matter (Al-Qaim<sup>asws</sup>) is to take place, it would make us happy’. ",
            "He<sup>asws</sup> said: ‘O Humran! You have friends, and brothers, and people whom you know. There used to be a scholar in the past, and he had a son who was never interested in the knowledge of his father, and did not ask him about anything, and they had a neighbour who used to come over and ask him, and take (knowledge) from him. The death presented itself to the man, so he called his son and said, ‘O my son! You have kept yourself away from what was in my possession, and had very little interest in it, and you never used to ask me about anything, whilst I had a neighbour who used to come to me, and ask me, and take (knowledge) from me, and memorise it from me. So now if you ever need anything, go to him. He introduced his neighbour to him. The man died, and his son remained. ",
            "The king of that era saw a dream, so he asked around for the man. It was said to him that he had died. So the king said, ‘Did he leave a son?’ It was said to him, ‘Yes, he left a son’. So he said, ‘Bring him to me’. They went to him in order to bring him to the king. The boy said, ‘By Allah<sup>azwj</sup>, I do not know why the king has called me, and there is no knowledge with me, and if he were to ask me about something, I would be disgraced’. He remembered what his father has bequeathed to him, so he came to the man who used to take the knowledge from his father. He said to him, ‘The king has sent for me to ask me, and I do not know why he has sent for me, and my father had ordered me that I should come to you if I ever have a need for anything’. The man said, ‘But I know very well with regards to what he has sent for you. So, if I were to inform you, then whatsoever that Allah<sup>azwj</sup> Brings out to you, so it would be (divided) between you and me’. He said, ‘Yes’. ",
            "He took an oath from him and made a binding agreement with the boy. He said, ‘He wants to ask you about a dream that he saw, as to which era it relates to? So you should say to him, ‘This is the era of the wolf’. The boy went to him, and the king said to him, ‘Do you know why I sent for you?’ He said, ‘You sent for me intending to ask me about a dream that you saw, as to which era it relates to’. The king said, ‘You speak the truth, so inform me as to which era it relates to’. He said to him, ‘The era of the wolf’. So he ordered for an award to be given to him, and the boy grabbed it and left to go to his house. He refused to be loyal to his companion and said (to himself), ‘I will not hand over this wealth, and will consume it until I die, and there is no need for me, nor will I ever have to ask him about anything similar to what I have already asked him’. So that (situation) prevailed for as long as Allah<sup>azwj</sup> Desired it to.",
            "Then the king saw (another) dream, so he sent for the boy. He regretted at what he had done and said, ‘By Allah<sup>azwj</sup>, there is no knowledge with me that I can give, and I do not know how to deal with my companion, and I have betrayed him, and never apologised to him’. Then said, ‘Let me go to him in any case and present excuses to him, hopefully he will inform me’. So he came and said to him, ‘I have done what I have done, and never apologised to you for what happened between I and you, and that which was in my hands has gone, and I have now got a need from you’. So adjure me to Allah<sup>azwj</sup> and do not abandon me, and I am a reliable one for you, that nothing will be given to me except that it would be (divided) between you and me. And the king has sent for me and I do not know what he will be asking me’. ",
            "So he said, ‘He intends to ask you about a dream he saw, as to which era it relates to, so say to him, ‘It is for the era of the ram’. So he went to the king who said, ‘Do you know why I have sent for you?’ He said, ‘You saw a dream and you want to ask me as to which era it relates to’. So he said to him, ‘You have spoken the truth, so tell me which era this is for?’ He said, ‘This is for the era of the ram’. So he ordered a reward for him. The boy grabbed it and left for his house, and he was pondering whether he should be loyal to his companion, or whether he should not be loyal to him. Sometimes he thought that he should do it, sometimes he thought that he should not do it. Then he said (to himself), ‘I will have no need for him anymore after this time ever’, and opted for the betrayal and leave the loyalty. So that (situation) prevailed for as long as Allah<sup>azwj</sup> Desired it to.",
            "Then the king saw (another) dream, so he sent for him. He regretted at what he had done regarding what was between himself and his companion and said (to himself), ‘I have betrayed him twice, how shall I face him, and there is no knowledge with me. Then he decided on going to the man, and came up to him. So he swore upon Allah<sup>azwj</sup> Blessed and High, and asked him to let him know and inform him, and that this time he would be loyal to him, and be a trustworthy to him, and said, ‘Do not leave me upon this condition, for I will not return to the betrayal, and will be loyal to you. So he took an agreement from him. He said, ‘He has called you to ask you about a dream he saw, as to which era it relates to. So when he questions you, inform him that it is for the era of the scale (balance)’. ",
            "He<sup>asws</sup> said: ‘So he came up to the king who said to him, ‘Do you know why I have sent for you?’ He said, ‘You have seen a dream and intend to ask me as to which era it relates to’. He said, ‘You have spoken the truth, so tell me which era this is for?’ He said, ‘This is for the era of the scale’. So he ordered a reward for him. The boy grabbed the reward and went with it to the man and placed it in front of him and said, ‘I have come to you with whatever was given to me, so divided it equally’. So the scholar said to him, ‘The first period was like the era of the wolf, and you were from the wolves. And the second period was the era of the ram which thinks but does not do it, and similarly you were thinking about it but were not loyal. And this period is the era of the scale, and you were, with regards to it, upon the loyalty. So grab your wealth for I have no need for it’. And he returned it back to him’."
          ],
          "en.sarwar": [
            "553. Ahmad Bin Muhammad Bin Ahmad Al-Kufy, from Ali Bin Al-Hassan Al-Taymi, from Ali Bin Asbaat, from Ali Bin Ja’far who said, ‘Narrated to me Moattab, or someone else, who said: ‘Abdullah Bin Al-Hassan sent a message to Abu Abdullah (a.s.) saying, ‘Abu Muhammad says to you (a.s.), ‘I am braver than you (a.s.), and I am more generous than you (a.s.), and I am more knowledgeable than you (a.s.)’. So he (a.s.) said to his messenger: ‘As for the bravery, by Allah (azwj) there has not been an incident whereby your cowardice can be distinguished from your bravery. And as for the generosity, so it is taking something and placing it in its rightful place. And as for the knowledge, your forefather Ali (a.s.) Bin Abu Talib (a.s.) had freed a thousand slaves, therefore name five of them for us (a.s.) if you are a knowledgeable one’. So the messenger returned to him. He told him, then he returned back to him (a.s.) saying, ‘He is saying to you (a.s.), that you (a.s.) are a man of Books’. So Abu Abdullah (a.s.) said to him; ‘Tell him, ‘Yes, by Allah (azwj), the Books of Ibrahim (as), and Musa (as), and Isa (as), which I (a.s.) have inherited from my (a.s.) forefathers (a.s.)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 542)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15238,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:3",
        "refs": {
          "Mentions": [
            "/books/quran:10:2"
          ]
        },
        "text": [
          "15000- أَحْمَدُ بْنُ مُحَمَّدِ بْنِ أَحْمَدَ الْكُوفِيُّ عَنْ عَلِيِّ بْنِ الْحَسَنِ التَّيْمِيِّ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ عَلِيِّ بْنِ جَعْفَرٍ قَالَ حَدَّثَنِي مُعَتِّبٌ أَوْ غَيْرُهُ قَالَ بَعَثَ عَبْدُ اللَّهِ بْنُ الْحَسَنِ إِلَى أَبِي عَبْدِ اللَّهِ (عليه السلام) يَقُولُ لَكَ أَبُو مُحَمَّدٍ أَنَا أَشْجَعُ مِنْكَ وَ أَنَا أَسْخَى مِنْكَ وَ أَنَا أَعْلَمُ مِنْكَ فَقَالَ لِرَسُولِهِ أَمَّا الشَّجَاعَةُ فَوَ اللَّهِ مَا كَانَ لَكَ مَوْقِفٌ يُعْرَفُ فِيهِ جُبْنُكَ مِنْ شَجَاعَتِكَ وَ أَمَّا السَّخَاءُ فَهُوَ الَّذِي يَأْخُذُ الشَّيْ‏ءَ مِنْ جِهَتِهِ فَيَضَعُهُ فِي حَقِّهِ وَ أَمَّا الْعِلْمُ فَقَدْ أَعْتَقَ أَبُوكَ عَلِيُّ بْنُ أَبِي طَالِبٍ (عليه السلام) أَلْفَ مَمْلُوكٍ فَسَمِّ لَنَا خَمْسَةً مِنْهُمْ وَ أَنْتَ عَالِمٌ فَعَادَ إِلَيْهِ فَأَعْلَمَهُ ثُمَّ عَادَ إِلَيْهِ فَقَالَ لَهُ يَقُولُ لَكَ أَنْتَ رَجُلٌ صُحُفِيٌّ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ (عليه السلام) قُلْ لَهُ إِي وَ اللَّهِ صُحُفُ إِبْرَاهِيمَ وَ مُوسَى وَ عِيسَى وَرِثْتُهَا عَنْ آبَائِي (عليهم السلام)."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473688\">H 15000</a> – Ahmad Bin Muhammad Bin Ahmad Al-Kufy, from Ali Bin Al-Hassan Al-Taymi, from Ali Bin Asbaat, from Ali Bin Ja’far who said, ‘Narrated to me Moattab, or someone else, who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>bdullah Bin Al-Hassan</span> sent a message to Abu Abdullah<sup>asws</sup> saying, ‘Abu Muhammad says to you<sup>asws</sup>, ‘I am braver than you<sup>asws</sup>, and I am more generous than you<sup>asws</sup>, and I am more knowledgeable than you<sup>asws</sup>’. So he<sup>asws</sup> said to his messenger: ‘As for the bravery, by Allah<sup>azwj</sup> there has not been an incident whereby your cowardice can be distinguished from your bravery. And as for the generosity, so it is taking something and placing it in its rightful place. And as for the knowledge, your forefather Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> had freed a thousand slaves, therefore name five of them for us<sup>asws</sup> if you are a knowledgeable one’. So the messenger returned to him. He told him, then he returned back to him<sup>asws</sup> saying, ‘He is saying to you<sup>asws</sup>, that you<sup>asws</sup> are a man of Books’. So Abu Abdullah<sup>asws</sup> said to him; ‘Tell him, ‘Yes, by Allah<sup>azwj</sup>, the Books of Ibrahim<sup>as</sup>, and Musa<sup>as</sup>, and Isa<sup>as</sup>, which I<sup>asws</sup> have inherited from my<sup>asws</sup> forefathers<sup>asws</sup>’. "
          ],
          "en.sarwar": [
            "554. Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Ibrahim Bin Umar Al-Yamani, from the one whom he mentioned: Abu Abdullah (a.s.) regarding the Statement of Allah (azwj) Blessed and High: “<a href=\"/#/books/quran:10#h2\">[10:2]</a> and give the good news to the Believers that they have before their Lord the lofty rank of truth”, so he (a.s.) said: ‘He (saww) (Good News) is the Messenger (saww) of Allah (azwj)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 543)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15239,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:4",
        "refs": {
          "Mentions": [
            "/books/quran:10:2",
            "/books/quran:10:101"
          ]
        },
        "text": [
          "15001- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ الْيَمَانِيِّ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِ اللَّهِ تَبَارَكَ وَ تَعَالَى وَ بَشِّرِ الَّذِينَ آمَنُوا أَنَّ لَهُمْ قَدَمَ صِدْقٍ عِنْدَ رَبِّهِمْ فَقَالَ هُوَ رَسُولُ اللَّهِ (صلى الله عليه وآله)."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473689\">H 15001</a> – Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Ibrahim Bin Umar Al-Yamani, from the one whom he mentioned:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> regarding the Statement of Allah<sup>azwj</sup> Blessed and High: <span class=\"ibTxt\">“<a href=\"/#/books/quran:10#h2\">[10:2]</a> and give the good news to the Believers that they have before their Lord the lofty rank of truth”</span>, so he<sup>asws</sup> said: ‘He<sup>saww</sup> (Good News) is the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>’. "
          ],
          "en.sarwar": [
            "555. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al-Hakam, from Abdullah Bin Yahya Al-Kahily, who has said: Abu Abdullah (a.s.) regarding the Statement of Allah (azwj) Mighty and Majestic: “<a href=\"/#/books/quran:10#h101\">[10:101]</a> and signs and warners do not avail a people who would not believe”. He (a.s.) said: ‘When ascension took place with the Messenger (saww) of Allah (azwj), Jibraeel came up to him (saww) with Al-Buraaq (the ride). So he (saww) rode on it and came to Bayt Al-Maqdas (Jerusalem). So he (saww) met the ones whom he (saww) met from his (saww) brothers from the Prophets (as). Then he (saww) returned and narrated it to his (saww) companions, ‘I (saww) came to Bayt Al-Maqdas, and returned during the night. Jibraeel came to me (saww) with Al-Buraaq, so I (saww) rode upon it, and the sign of that is that I (saww) passed by the camels of Abu Sufyan being watered at the watering hole of the clan of so and so. A red camel of theirs had strayed and the group were looking for it. So some of them said to the others, ‘But rather he (saww) went to Syria whilst riding at speed whereas you have been to Syria and recognise it. So ask him (saww) about its markets, and its doors, and its businessmen’. So they said, ‘O Messenger (saww) of Allah (azwj), how is Syria, and how are its markets?’ He (a.s.) said: ‘The Messenger (saww), when asked about something that he (saww) did not recognise, he (saww) would not describe it until after seeing it in front of him (saww). So when they were in the middle of that, Jibraeel came up to him (saww) and said: ‘O Rasool Allah (saww), this here is Syria which has been raised for you (saww)!’ So the Rasool Allah (saww) turned and visualised Syria, with its doors, and its markets, and its businessmen’. So he (saww) said: ‘Where are the questioners about Syria?’ So they said to him (saww), ‘It is so and so and so and so (Abu Bakr and Umar)’. So the Rasool Allah (saww) answered them with regards to all of what they asked from him (saww). Even then they did not believe from among them, except for a few, and it is the Statement of Allah (azwj) Blessed and High: “<a href=\"/#/books/quran:10#h101\">[10:101]</a> and signs and warners do not avail a people who would not believe”. Then Abu Abdullah (a.s.) said: ‘We (a.s.) seek Refuge with Allah (azwj) from disbelief in Allah (azwj) and in His (azwj) Rasool (saww). We (a.s.) believe in Allah (azwj) and in His (azwj) Messenger (saww)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 545)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15240,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:5",
        "refs": {
          "Mentions": [
            "/books/quran:10:101"
          ]
        },
        "text": [
          "15002- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَبْدِ اللَّهِ بْنِ يَحْيَى الْكَاهِلِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ ما تُغْنِي الْآياتُ وَ النُّذُرُ عَنْ قَوْمٍ لا يُؤْمِنُونَ قَالَ لَمَّا أُسْرِيَ بِرَسُولِ اللَّهِ (صلى الله عليه وآله) أَتَاهُ جَبْرَئِيلُ بِالْبُرَاقِ فَرَكِبَهَا فَأَتَى بَيْتَ الْمَقْدِسِ فَلَقِيَ مَنْ لَقِيَ مِنْ إِخْوَانِهِ مِنَ الْأَنْبِيَاءِ (عليهم السلام) ثُمَّ رَجَعَ فَحَدَّثَ أَصْحَابَهُ أَنِّي أَتَيْتُ بَيْتَ الْمَقْدِسِ وَ رَجَعْتُ مِنَ اللَّيْلَةِ وَ قَدْ جَاءَنِي جَبْرَئِيلُ بِالْبُرَاقِ فَرَكِبْتُهَا وَ آيَةُ ذَلِكَ أَنِّي مَرَرْتُ بِعِيرٍ لِأَبِي سُفْيَانَ عَلَى مَاءٍ لِبَنِي فُلَانٍ وَ قَدْ أَضَلُّوا جَمَلًا لَهُمْ أَحْمَرَ وَ قَدْ هَمَّ الْقَوْمُ فِي طَلَبِهِ",
          "فَقَالَ بَعْضُهُمْ لِبَعْضٍ إِنَّمَا جَاءَ الشَّامَ وَ هُوَ رَاكِبٌ سَرِيعٌ وَ لَكِنَّكُمْ قَدْ أَتَيْتُمُ الشَّامَ وَ عَرَفْتُمُوهَا فَسَلُوهُ عَنْ أَسْوَاقِهَا وَ أَبْوَابِهَا وَ تُجَّارِهَا فَقَالُوا يَا رَسُولَ اللَّهِ كَيْفَ الشَّامُ وَ كَيْفَ أَسْوَاقُهَا قَالَ كَانَ رَسُولُ اللَّهِ (صلى الله عليه وآله) إِذَا سُئِلَ عَنِ الشَّيْ‏ءِ لَا يَعْرِفُهُ شُقَّ عَلَيْهِ حَتَّى يُرَى ذَلِكَ فِي وَجْهِهِ قَالَ فَبَيْنَمَا هُوَ كَذَلِكَ إِذْ أَتَاهُ جَبْرَئِيلُ (عليه السلام) فَقَالَ يَا رَسُولَ اللَّهِ هَذِهِ الشَّامُ قَدْ رُفِعَتْ لَكَ فَالْتَفَتَ رَسُولُ اللَّهِ (صلى الله عليه وآله) فَإِذَا هُوَ بِالشَّامِ بِأَبْوَابِهَا وَ أَسْوَاقِهَا وَ تُجَّارِهَا",
          "فَقَالَ أَيْنَ السَّائِلُ عَنِ الشَّامِ فَقَالُوا لَهُ فُلَانٌ وَ فُلَانٌ فَأَجَابَهُمْ رَسُولُ اللَّهِ (صلى الله عليه وآله) فِي كُلِّ مَا سَأَلُوهُ عَنْهُ فَلَمْ يُؤْمِنْ مِنْهُمْ إِلَّا قَلِيلٌ وَ هُوَ قَوْلُ اللَّهِ تَبَارَكَ وَ تَعَالَى وَ ما تُغْنِي الْآياتُ وَ النُّذُرُ عَنْ قَوْمٍ لا يُؤْمِنُونَ ثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) نَعُوذُ بِاللَّهِ أَنْ لَا نُؤْمِنَ بِاللَّهِ وَ بِرَسُولِهِ آمَنَّا بِاللَّهِ وَ بِرَسُولِهِ (صلى الله عليه وآله)."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473690\">H 15002</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al-Hakam, from Abdullah Bin Yahya Al-Kahily, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> regarding the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:10#h101\">[10:101]</a> and signs and warners do not avail a people who would not believe”</span>. He<sup>asws</sup> said: ‘When ascension took place with the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>, Jibraeel came up to him<sup>saww</sup> with <span class=\"iTxt\">Al-Buraaq</span> (the ride). So he<sup>saww</sup> rode on it and came to <span class=\"iTxt\">Bayt Al-Maqdas</span> (Jerusalem). So he<sup>saww</sup> met the ones whom he<sup>saww</sup> met from his<sup>saww</sup> brothers from the Prophets<sup>as</sup>. Then he<sup>saww</sup> returned and narrated it to his<sup>saww</sup> companions, ‘I<sup>saww</sup> came to <span class=\"iTxt\">Bayt Al-Maqdas</span>, and returned during the night. Jibraeel came to me<sup>saww</sup> with <span class=\"iTxt\">Al-Buraaq</span>, so I<sup>saww</sup> rode upon it, and the sign of that is that I<sup>saww</sup> passed by the camels of Abu Sufyan being watered at the watering hole of the clan of so and so. A red camel of theirs had strayed and the group were looking for it. ",
            "So some of them said to the others, ‘But rather he<sup>saww</sup> went to Syria whilst riding at speed whereas you have been to Syria and recognise it. So ask him<sup>saww</sup> about its markets, and its doors, and its businessmen’. So they said, ‘O Messenger<sup>saww</sup> of Allah<sup>azwj</sup>, how is Syria, and how are its markets?’ He<sup>asws</sup> said: ‘The Messenger<sup>saww</sup>, when asked about something that he<sup>saww</sup> did not recognise, he<sup>saww</sup> would not describe it until after seeing it in front of him<sup>saww</sup>. So when they were in the middle of that, Jibraeel came up to him<sup>saww</sup> and said: ‘O Rasool Allah<sup>saww</sup>, this here is Syria which has been raised for you<sup>saww</sup>!’ So the Rasool Allah<sup>saww</sup> turned and visualised Syria, with its doors, and its markets, and its businessmen’. ",
            "So he<sup>saww</sup> said: ‘Where are the questioners about Syria?’ So they said to him<sup>saww</sup>, ‘It is so and so and so and so (Abu Bakr and Umar)’. So the Rasool Allah<sup>saww</sup> answered them with regards to all of what they asked from him<sup>saww</sup>. Even then they did not believe from among them, except for a few, and it is the Statement of Allah<sup>azwj</sup> Blessed and High: <span class=\"ibTxt\">“<a href=\"/#/books/quran:10#h101\">[10:101]</a> and signs and warners do not avail a people who would not believe”</span>. Then Abu Abdullah<sup>asws</sup> said: ‘We<sup>asws</sup> seek Refuge with Allah<sup>azwj</sup> from disbelief in Allah<sup>azwj</sup> and in His<sup>azwj</sup> Rasool<sup>saww</sup>. We<sup>asws</sup> believe in Allah<sup>azwj</sup> and in His<sup>azwj</sup> Messenger<sup>saww</sup>’. "
          ],
          "en.sarwar": [
            "556. Ahmad Bin Muhammad bin Ahmad, from Ali Bin Al-Hasan Al-Taymi, from Muhammad Bin Abdullah, from Zurara, from Muhammad Bin Al-Fazeyl, from Abu Hamza who said: ‘I heard Abu Abdullah (a.s.) saying: ‘When the believers says to his brother, ‘Uff!’ he comes out from his guardianship. If he says, ‘You are my enemy’, one of the two has blasphemed, because Allah (azwj) Mighty and Majestic does not Accept the deeds from anyone during the reproach of a Believer, and does not Accept from a Believer any deeds whilst he harbours evil in his heart against a Believer. If the covering is Lifted from the people, so they will see to the Means of what is between Allah (azwj) Mighty and Majestic and the Believers. Their necks would become submissive to the Believers, and their matters would become easier for them and they would be obedient to them. And if they were to look at the deeds rejected by Allah (azwj) Mighty and Majestic, they would say, ‘Allah (azwj) Mighty and Majestic does not Accept the deeds from anybody’. And I (the narrator) heard him (a.s.) say to a man from the Shites: ‘You all are the good ones, and your women are the good ones. Every Believing woman is a beautiful Hourie, and every believing man is a truthful one’. He (the narrator) said, ‘And I heard him (a.s.) saying: ‘Our (a.s.) Shites would be the closest of the creatures to the Throne of Allah (azwj) Mighty and Majestic on the Day of Judgement after us (a.s.). And there is no one from our (a.s.) Shites who stand to Pray except that the number of Angels equal to the ones opposed to him Pray for him in congregation for him until he is free from his Salat (Prayer). And the one from among you who Fasts will be enjoying in the Gardens of the Paradise, and the Angels prepare it for him until he breaks the Fast’. And I (the narrator) heard him (a.s.) saying: ‘You (Shites) are the people Greeted by the Greetings of Allah (azwj), and the people Impacted by the Mercy of Allah (azwj), and the people Guided by the Protection of Allah (azwj), and the people Invited by Allah (azwj) for being obedient to Him (azwj). There is no Accounting for you (Shites), and no fear, and no grief. You are all for the Paradise and the Paradise is for you all. Your names (titles) in our (a.s.) presence are, ‘the righteous’, and ‘the reformers’. And you are the people of the Pleasure of Allah (azwj), Him (azwj) being Pleased with you, and the Angels are your brothers in the good. So if you are striving, they supplicate for you, and if you are in neglect, they strive for you. And you are the best of the created beings. Your houses are gardens for your (living ones), and the graves are the garden for your (deceased). It is for the Paradise that you have been created, and it is in the Paradise that you will be Favoured by, and it is to the Paradise that you are travelling to’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على الشهور</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 547)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15241,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:6",
        "text": [
          "15003- أَحْمَدُ بْنُ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ عَلِيِّ بْنِ الْحَسَنِ التَّيْمِيِّ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ زُرَارَةَ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ إِذَا قَالَ الْمُؤْمِنُ لِأَخِيهِ أُفٍّ خَرَجَ مِنْ وَلَايَتِهِ وَ إِذَا قَالَ أَنْتَ عَدُوِّي كَفَرَ أَحَدُهُمَا لِأَنَّهُ لَا يَقْبَلُ اللَّهُ عَزَّ وَ جَلَّ مِنْ أَحَدٍ عَمَلًا فِي تَثْرِيبٍ عَلَى مُؤْمِنٍ نَصِيحَةً وَ لَا يَقْبَلُ مِنْ مُؤْمِنٍ عَمَلًا وَ هُوَ يُضْمِرُ فِي قَلْبِهِ عَلَى الْمُؤْمِنِ سُوءاً",
          "لَوْ كُشِفَ الْغِطَاءُ عَنِ النَّاسِ فَنَظَرُوا إِلَى وَصْلِ مَا بَيْنَ اللَّهِ عَزَّ وَ جَلَّ وَ بَيْنَ الْمُؤْمِنِ خَضَعَتْ لِلْمُؤْمِنِينَ رِقَابُهُمْ وَ تَسَهَّلَتْ لَهُمْ أُمُورُهُمْ وَ لَانَتْ لَهُمْ طَاعَتُهُمْ وَ لَوْ نَظَرُوا إِلَى مَرْدُودِ الْأَعْمَالِ مِنَ اللَّهِ عَزَّ وَ جَلَّ لَقَالُوا مَا يَتَقَبَّلُ اللَّهُ عَزَّ وَ جَلَّ مِنْ أَحَدٍ عَمَلًا",
          "وَ سَمِعْتُهُ يَقُولُ لِرَجُلٍ مِنَ الشِّيعَةِ أَنْتُمُ الطَّيِّبُونَ وَ نِسَاؤُكُمُ الطَّيِّبَاتُ كُلُّ مُؤْمِنَةٍ حَوْرَاءُ عَيْنَاءُ وَ كُلُّ مُؤْمِنٍ صِدِّيقٌ",
          "قَالَ وَ سَمِعْتُهُ يَقُولُ شِيعَتُنَا أَقْرَبُ الْخَلْقِ مِنْ عَرْشِ اللَّهِ عَزَّ وَ جَلَّ يَوْمَ الْقِيَامَةِ بَعْدَنَا وَ مَا مِنْ شِيعَتِنَا أَحَدٌ يَقُومُ إِلَى الصَّلَاةِ إِلَّا اكْتَنَفَتْهُ فِيهَا عَدَدَ مَنْ خَالَفَهُ مِنَ الْمَلَائِكَةِ يُصَلُّونَ عَلَيْهِ جَمَاعَةً حَتَّى يَفْرُغَ مِنْ صَلَاتِهِ وَ إِنَّ الصَّائِمَ مِنْكُمْ لَيَرْتَعُ فِي رِيَاضِ الْجَنَّةِ تَدْعُو لَهُ الْمَلَائِكَةُ حَتَّى يُفْطِرَ",
          "وَ سَمِعْتُهُ يَقُولُ أَنْتُمْ أَهْلُ تَحِيَّةِ اللَّهِ بِسَلَامِهِ وَ أَهْلُ أُثْرَةِ اللَّهِ بِرَحْمَتِهِ وَ أَهْلُ تَوْفِيقِ اللَّهِ بِعِصْمَتِهِ وَ أَهْلُ دَعْوَةِ اللَّهِ بِطَاعَتِهِ لَا حِسَابٌ عَلَيْكُمْ وَ لَا خَوْفٌ وَ لَا حُزْنٌ أَنْتُمْ لِلْجَنَّةِ وَ الْجَنَّةُ لَكُمْ أَسْمَاؤُكُمْ عِنْدَنَا الصَّالِحُونَ وَ الْمُصْلِحُونَ وَ أَنْتُمْ أَهْلُ الرِّضَا عَنِ اللَّهِ عَزَّ وَ جَلَّ بِرِضَاهُ عَنْكُمْ وَ الْمَلَائِكَةُ إِخْوَانُكُمْ فِي الْخَيْرِ فَإِذَا جُهِدْتُمُ ادْعُوا وَ إِذَا غَفَلْتُمُ اجْهَدُوا وَ أَنْتُمْ خَيْرُ الْبَرِيَّةِ دِيَارُكُمْ لَكُمْ جَنَّةٌ وَ قُبُورُكُمْ لَكُمْ جَنَّةٌ لِلْجَنَّةِ خُلِقْتُمْ وَ فِي الْجَنَّةِ نَعِيمُكُمْ وَ إِلَى الْجَنَّةِ تَصِيرُونَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473691\">H 15003</a> – Ahmad Bin Muhammad bin Ahmad, from Ali Bin Al-Hasan Al-Taymi, from Muhammad Bin Abdullah, from Zurara, from Muhammad Bin Al-Fazeyl, from Abu Hamza who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘When the believers says to his brother, ‘Uff!’ he comes out from his guardianship. If he says, ‘You are my enemy’, one of the two has blasphemed, because Allah<sup>azwj</sup> Mighty and Majestic does not Accept the deeds from anyone during the reproach of a Believer, and does not Accept from a Believer any deeds whilst he harbours evil in his heart against a Believer. ",
            "If the covering is Lifted from the people, so they will see to the Means of what is between Allah<sup>azwj</sup> Mighty and Majestic and the Believers. Their necks would become submissive to the Believers, and their matters would become easier for them and they would be obedient to them. And if they were to look at the deeds rejected by Allah<sup>azwj</sup> Mighty and Majestic, they would say, ‘Allah<sup>azwj</sup> Mighty and Majestic does not Accept the deeds from anybody’.",
            "And I (the narrator) heard him<sup>asws</sup> say to a man from the Shites: ‘You all are the good ones, and your women are the good ones. Every Believing woman is a beautiful Hourie, and every believing man is a truthful one’. ",
            "He (the narrator) said, ‘And I heard him<sup>asws</sup> saying: ‘Our<sup>asws</sup> Shites would be the closest of the creatures to the Throne of Allah<sup>azwj</sup> Mighty and Majestic on the Day of Judgement after us<sup>asws</sup>. And there is no one from our<sup>asws</sup> Shites who stand to Pray except that the number of Angels equal to the ones opposed to him Pray for him in congregation for him until he is free from his Salat (Prayer). And the one from among you who Fasts will be enjoying in the Gardens of the Paradise, and the Angels prepare it for him until he breaks the Fast’.",
            "And I (the narrator) heard him<sup>asws</sup> saying: ‘You (Shites) are the people Greeted by the Greetings of Allah<sup>azwj</sup>, and the people Impacted by the Mercy of Allah<sup>azwj</sup>, and the people Guided by the Protection of Allah<sup>azwj</sup>, and the people Invited by Allah<sup>azwj</sup> for being obedient to Him<sup>azwj</sup>. There is no Accounting for you (Shites), and no fear, and no grief. You are all for the Paradise and the Paradise is for you all. Your names (titles) in our<sup>asws</sup> presence are, ‘the righteous’, and ‘the reformers’. And you are the people of the Pleasure of Allah<sup>azwj</sup>, Him<sup>azwj</sup> being Pleased with you, and the Angels are your brothers in the good. So if you are striving, they supplicate for you, and if you are in neglect, they strive for you. And you are the best of the created beings. Your houses are gardens for your (living ones), and the graves are the garden for your (deceased). It is for the Paradise that you have been created, and it is in the Paradise that you will be Favoured by, and it is to the Paradise that you are travelling to’.  "
          ],
          "en.sarwar": [
            "557. Ahmad Bin Muhammad Bin Ahmad, from Muhammad Bin Ahmad Al-Nahdy, from Muhammad Bin Al-Waleed, from Aban Bin Usman, from Al-Fazeyl, who has said the following: Abu Ja’far (a.s.) has said: ‘The Rasool Allah (saww) said to Ja’far (as) when he (as) came back from Ethiopia; ‘Which was the most astonishing thing from what you (as) saw?’ He (as) said; ‘I saw an Ethiopian woman pass by and upon her head was a load. So a man passed by her and bumped into her, and the load fell from her head. She sat down, then said, ‘Woe be unto you from the Judge on the Day of Reckoning, when He (azwj) will Sit upon the Chair, and Take for the oppressed, from the oppressors’. So the Rasool Allah (saww) was (pleased with) astonishing (tale)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 548)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15242,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:7",
        "text": [
          "15004- أَحْمَدُ بْنُ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ النَّهْدِيِّ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنِ الْفُضَيْلِ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) لِجَعْفَرٍ (عليه السلام) حِينَ قَدِمَ مِنَ الْحَبَشَةِ أَيُّ شَيْ‏ءٍ أَعْجَبُ مَا رَأَيْتَ قَالَ رَأَيْتُ حَبَشِيَّةً مَرَّتْ وَ عَلَى رَأْسِهَا مِكْتَلٌ فَمَرَّ رَجُلٌ فَزَحَمَهَا فَطَرَحَهَا وَ وَقَعَ الْمِكْتَلُ عَنْ رَأْسِهَا فَجَلَسَتْ ثُمَّ قَالَتْ وَيْلٌ لَكَ مِنْ دَيَّانِ يَوْمِ الدِّينِ إِذَا جَلَسَ عَلَى الْكُرْسِيِّ وَ أَخَذَ لِلْمَظْلُومِ مِنَ الظَّالِمِ فَتَعَجَّبَ رَسُولُ اللَّهِ (صلى الله عليه وآله)."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473692\">H 15004</a> – Ahmad Bin Muhammad Bin Ahmad, from Muhammad Bin Ahmad Al-Nahdy, from Muhammad Bin Al-Waleed, from Aban Bin Usman, from Al-Fazeyl, who has said the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> has said: ‘The Rasool Allah<sup>saww</sup> said to Ja’far<sup>as</sup> when he<sup>as</sup> came back from Ethiopia; ‘Which was the most astonishing thing from what you<sup>as</sup> saw?’ He<sup>as</sup> said; ‘I saw an Ethiopian woman pass by and upon her head was a load. So a man passed by her and bumped into her, and the load fell from her head. She sat down, then said, ‘Woe be unto you from the Judge on the Day of Reckoning, when He<sup>azwj</sup> will Sit upon the Chair, and Take for the oppressed, from the oppressors’. So the Rasool Allah<sup>saww</sup> was (pleased with) astonishing (tale)’. "
          ],
          "en.sarwar": [
            "558. Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin salim, from Abu Ayyub Al-Khazzaz, from Abu Baseer, who has said the following: Abu Abdullah (a.s.) having said that: ‘Azar, the father of Ibrahim (as) was an astrologer for Nimrod (la) and he (la) never passed a law except after seeking his advice. So he looked at the stars one night, and in the morning he said to Nimrod (la), ‘I have seen something strange’. He (la) said, ‘And what is it?’ He said, ‘I saw a newborn being born in our land. Our destruction will be by his (as) hands. It will not be long after him (as) being conceived’. So he (la) was astounded by that and said, ‘Has the woman fallen pregnant with him (as) yet?’ He said, ‘Not yet’. So he (la) separated the women from the men. He (la) did not leave a single woman except that he (la) made her to be in the city, with no man being allowed to be alone with her. Azar copulated with his wife and Ibrahim (as) was conceived. He thought that he (as) might be the one. So he sent for the women from the midwives of that time, that if there is anything in her womb they should notify him. They examined her. So Allah (azwj) Mighty and Majestic Made what was in her womb to be transferred to the back. So they said, ‘We did not see anything in her tummy’. And what was in his knowledge was that he (as) would be burnt by the fire, and did not know that Allah (azwj) the High would be Rescuing him (as)’. He (a.s.) said: ‘So when the mother of Ibrahim (as) gave birth to him (as), Azar wanted to go with him (as) to Nimrod (la) to be killed. So his wife said to him, ‘Do not go with your son (as) to Nimrod (la) for he (la) will kill him (as). I shall go with him (as) to one of the caves and leave him (as) there until his (as) death comes to him (as), and you will not become the one to have killed your own son’. So he said to her, ‘Take him (as)’. So she went with him (as) to a cave, then placed him (as) in it, and placed a rock to block the entrance of the cave. Then she left him (as). He (a.s.) said: ‘Allah (azwj) Mighty and Majestic Made his (as) sustenance to be in his (as) thumb. He (as) would suck it and milk would flow from it. He (as) grew in a day like others grow in a week, and grew in a week like others grow in a month, and grew in a month like others grow in a year. So that situation remained for as long as Allah (azwj) Desired it to remain. Then his (as) mother said to his (as) father, ‘If you allow me, I shall go to that child’. So he allowed her. So she went there and there was Ibrahim (as). His (as) eyes lit up like two lanterns. She grabbed him (as) and pressed him (as) to her bosom, and fed him (as). Then she left him there. Azar asked her about him (as), so she said, ‘I have hidden (buried) him in the soil’. She waited, and she would come out for her need, and go to Ibrahim (as), hold him (as) to her bosom, feed him (as), and leave him (as). So when he (as) started moving, she would still come to him (as) and do as she had done before. So when she wanted to leave, he (as) grabbed her robe. She said to him (as), ‘What is the matter?’ He (as) said to her: ‘Take me (as) with you’. She said, ‘Not until your father orders me to’. He (a.s.) said: ‘The mother of Ibrahim (as) came to Azar. She related to him the story. He said to her, ‘Bring him (as) to me. Make him (as) to be seated upon the road, so when his (as) brothers pass by, make him (as) enter with them, and he (as) will not be noticed’. He (a.s.) said: ‘And the brothers of Ibrahim (as) used to carve the idols and would go with these to the markets and sell them. So she went to him (as), and came with him (as) until she made him (as) to sit upon the road. And his (as) brothers passed by, he (as) entered with them. So when his (as) father saw him (as), he was overwhelmed with the love for him (as). And so the situation remained as such for as long as Allah (azwj) Desired it to’. He (a.s.) said; ‘One day from the days during which, his (as) brothers were in the middle of carving the idols, Ibrahim (as) took the tool, and took a piece of wood, and carved such an idol from it the like of which they had never seen before at all. So Azar said to his (as) mother, ‘I hope that we receive good luck from the blessings of this son (as) of yours’. He (a.s.) said; ‘So when they were in the middle of that, Ibrahim (as) grabbed hold of the tool and broke the idol which he (as) had carved. So his (as) father got scared and was overcome with severe panic. He said to him (as), ‘What would you (as) have done with it?’ Ibrahim (as) said to him: ‘And what would you have done with it?’ Azar said, ‘People would have worshipped it’. So Ibrahim (as) said to him: ‘Are you worshipping what you yourself have carved?’ So Azar said to his (as) mother, ‘This is the one due to whom our kingdom would go away, by his (as) hands’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 552)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15243,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:8",
        "refs": {
          "Mentions": [
            "/books/quran:37:89",
            "/books/quran:2:258",
            "/books/quran:37:88"
          ]
        },
        "text": [
          "15005- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) أَنَّ آزَرَ أَبَا إِبْرَاهِيمَ (عليه السلام) كَانَ مُنَجِّماً لِنُمْرُودَ وَ لَمْ يَكُنْ يَصْدُرُ إِلَّا عَنْ أَمْرِهِ فَنَظَرَ لَيْلَةً فِي النُّجُومِ فَأَصْبَحَ وَ هُوَ يَقُولُ لِنُمْرُودَ لَقَدْ رَأَيْتُ عَجَباً قَالَ وَ مَا هُوَ قَالَ رَأَيْتُ مَوْلُوداً يُولَدُ فِي أَرْضِنَا يَكُونُ هَلَاكُنَا عَلَى يَدَيْهِ وَ لَا يَلْبَثُ إِلَّا قَلِيلًا حَتَّى يُحْمَلَ بِهِ",
          "قَالَ فَتَعَجَّبَ مِنْ ذَلِكَ وَ قَالَ هَلْ حَمَلَتْ بِهِ النِّسَاءُ قَالَ لَا قَالَ فَحَجَبَ النِّسَاءَ عَنِ الرِّجَالِ فَلَمْ يَدَعِ امْرَأَةً إِلَّا جَعَلَهَا فِي الْمَدِينَةِ لَا يُخْلَصُ إِلَيْهَا وَ وَقَعَ آزَرُ بِأَهْلِهِ فَعَلِقَتْ بِإِبْرَاهِيمَ (عليه السلام) فَظَنَّ أَنَّهُ صَاحِبُهُ فَأَرْسَلَ إِلَى نِسَاءٍ مِنَ الْقَوَابِلِ فِي ذَلِكَ الزَّمَانِ لَا يَكُونُ فِي الرَّحِمِ شَيْ‏ءٌ إِلَّا عَلِمْنَ بِهِ فَنَظَرْنَ فَأَلْزَمَ اللَّهُ عَزَّ وَ جَلَّ مَا فِي الرَّحِمِ إِلَى الظَّهْرِ فَقُلْنَ مَا نَرَى فِي بَطْنِهَا شَيْئاً وَ كَانَ فِيمَا أُوتِيَ مِنَ الْعِلْمِ أَنَّهُ سَيُحْرَقُ بِالنَّارِ وَ لَمْ يُؤْتَ عِلْمَ أَنَّ اللَّهَ تَعَالَى سَيُنْجِيهِ",
          "قَالَ فَلَمَّا وَضَعَتْ أُمُّ إِبْرَاهِيمَ أَرَادَ آزَرُ أَنْ يَذْهَبَ بِهِ إِلَى نُمْرُودَ لِيَقْتُلَهُ فَقَالَتْ لَهُ امْرَأَتُهُ لَا تَذْهَبْ بِابْنِكَ إِلَى نُمْرُودَ فَيَقْتُلَهُ دَعْنِي أَذْهَبْ بِهِ إِلَى بَعْضِ الْغِيرَانِ أَجْعَلْهُ فِيهِ حَتَّى يَأْتِيَ عَلَيْهِ أَجَلُهُ وَ لَا تَكُونَ أَنْتَ الَّذِي تَقْتُلُ ابْنَكَ فَقَالَ لَهَا فَامْضِي بِهِ قَالَ فَذَهَبَتْ بِهِ إِلَى غَارٍ ثُمَّ أَرْضَعَتْهُ ثُمَّ جَعَلَتْ عَلَى بَابِ الْغَارِ صَخْرَةً ثُمَّ انْصَرَفَتْ عَنْهُ",
          "قَالَ فَجَعَلَ اللَّهُ عَزَّ وَ جَلَّ رِزْقَهُ فِي إِبْهَامِهِ فَجَعَلَ يَمَصُّهَا فَيَشْخُبُ لَبَنُهَا وَ جَعَلَ يَشِبُّ فِي الْيَوْمِ كَمَا يَشِبُّ غَيْرُهُ فِي الْجُمْعَةِ وَ يَشِبُّ فِي الْجُمْعَةِ كَمَا يَشِبُّ غَيْرُهُ فِي الشَّهْرِ وَ يَشِبُّ فِي الشَّهْرِ كَمَا يَشِبُّ غَيْرُهُ فِي السَّنَةِ فَمَكَثَ مَا شَاءَ اللَّهُ أَنْ يَمْكُثَ ثُمَّ إِنَّ أُمَّهُ قَالَتْ لِأَبِيهِ لَوْ أَذِنْتَ لِي حَتَّى أَذْهَبَ إِلَى ذَلِكَ الصَّبِيِّ فَعَلْتُ قَالَ فَافْعَلِي فَذَهَبَتْ فَإِذَا هِيَ بِإِبْرَاهِيمَ (عليه السلام) وَ إِذَا عَيْنَاهُ تَزْهَرَانِ كَأَنَّهُمَا سِرَاجَانِ قَالَ فَأَخَذَتْهُ فَضَمَّتْهُ إِلَى صَدْرِهَا وَ أَرْضَعَتْهُ ثُمَّ انْصَرَفَتْ عَنْهُ",
          "فَسَأَلَهَا آزَرُ عَنْهُ فَقَالَتْ قَدْ وَارَيْتُهُ فِي التُّرَابِ فَمَكَثَتْ تَفْعَلُ فَتَخْرُجُ فِي الْحَاجَةِ وَ تَذْهَبُ إِلَى إِبْرَاهِيمَ (عليه السلام) فَتَضُمُّهُ إِلَيْهَا وَ تُرْضِعُهُ ثُمَّ تَنْصَرِفُ فَلَمَّا تَحَرَّكَ أَتَتْهُ كَمَا كَانَتْ تَأْتِيهِ فَصَنَعَتْ بِهِ كَمَا كَانَتْ تَصْنَعُ فَلَمَّا أَرَادَتِ الِانْصِرَافَ أَخَذَ بِثَوْبِهَا فَقَالَتْ لَهُ مَا لَكَ فَقَالَ لَهَا اذْهَبِي بِي مَعَكِ فَقَالَتْ لَهُ حَتَّى أَسْتَأْمِرَ أَبَاكَ ",
          "قَالَ فَأَتَتْ أُمُّ إِبْرَاهِيمَ (عليه السلام) آزَرَ فَأَعْلَمَتْهُ الْقِصَّةَ فَقَالَ لَهَا ائْتِينِي بِهِ فَأَقْعِدِيهِ عَلَى الطَّرِيقِ فَإِذَا مَرَّ بِهِ إِخْوَتُهُ دَخَلَ مَعَهُمْ وَ لَا يُعْرَفُ قَالَ وَ كَانَ إِخْوَةُ إِبْرَاهِيمَ (عليه السلام) يَعْمَلُونَ الْأَصْنَامَ وَ يَذْهَبُونَ بِهَا إِلَى الْأَسْوَاقِ وَ يَبِيعُونَهَا قَالَ فَذَهَبَتْ إِلَيْهِ فَجَاءَتْ بِهِ حَتَّى أَقْعَدَتْهُ عَلَى الطَّرِيقِ وَ مَرَّ إِخْوَتُهُ فَدَخَلَ مَعَهُمْ فَلَمَّا رَآهُ أَبُوهُ وَقَعَتْ عَلَيْهِ الْمَحَبَّةُ مِنْهُ فَمَكَثَ مَا شَاءَ اللَّهُ ",
          "قَالَ فَبَيْنَمَا إِخْوَتُهُ يَعْمَلُونَ يَوْماً مِنَ الْأَيَّامِ الْأَصْنَامَ إِذَا أَخَذَ إِبْرَاهِيمُ (عليه السلام) الْقَدُومَ وَ أَخَذَ خَشَبَةً فَنَجَرَ مِنْهَا صَنَماً لَمْ يَرَوْا قَطُّ مِثْلَهُ فَقَالَ آزَرُ لِأُمِّهِ إِنِّي لَأَرْجُو أَنْ نُصِيبَ خَيْراً بِبَرَكَةِ ابْنِكِ هَذَا قَالَ فَبَيْنَمَا هُمْ كَذَلِكَ إِذَا أَخَذَ إِبْرَاهِيمُ الْقَدُومَ فَكَسَرَ الصَّنَمَ الَّذِي عَمِلَهُ فَفَزِعَ أَبُوهُ مِنْ ذَلِكَ فَزَعاً شَدِيداً فَقَالَ لَهُ أَيَّ شَيْ‏ءٍ عَمِلْتَ فَقَالَ لَهُ إِبْرَاهِيمُ (عليه السلام) وَ مَا تَصْنَعُونَ بِهِ فَقَالَ آزَرُ نَعْبُدُهُ فَقَالَ لَهُ إِبْرَاهِيمُ (عليه السلام) أَ تَعْبُدُونَ ما تَنْحِتُونَ فَقَالَ آزَرُ لِأُمِّهِ هَذَا الَّذِي يَكُونُ ذَهَابُ مُلْكِنَا عَلَى يَدَيْهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473693\">H 15005</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin salim, from Abu Ayyub Al-Khazzaz, from Abu Baseer, who has said the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said that: ‘Azar, the father of Ibrahim<sup>as</sup> was an astrologer for Nimrod<sup>la</sup> and he<sup>la</sup> never passed a law except after seeking his advice. So he looked at the stars one night, and in the morning he said to Nimrod<sup>la</sup>, ‘I have seen something strange’. He<sup>la</sup> said, ‘And what is it?’ He said, ‘I saw a newborn being born in our land. Our destruction will be by his<sup>as</sup> hands. It will not be long after him<sup>as</sup> being conceived’. ",
            "So he<sup>la</sup> was astounded by that and said, ‘Has the woman fallen pregnant with him<sup>as</sup> yet?’ He said, ‘Not yet’. So he<sup>la</sup> separated the women from the men. He<sup>la</sup> did not leave a single woman except that he<sup>la</sup> made her to be in the city, with no man being allowed to be alone with her. Azar copulated with his wife and Ibrahim<sup>as</sup> was conceived. He thought that he<sup>as</sup> might be the one. So he sent for the women from the midwives of that time, that if there is anything in her womb they should notify him. They examined her. So Allah<sup>azwj</sup> Mighty and Majestic Made what was in her womb to be transferred to the back. So they said, ‘We did not see anything in her tummy’. And what was in his knowledge was that he<sup>as</sup> would be burnt by the fire, and did not know that Allah<sup>azwj</sup> the High would be Rescuing him<sup>as</sup>’.",
            "He<sup>asws</sup> said: ‘So when the mother of Ibrahim<sup>as</sup> gave birth to him<sup>as</sup>, Azar wanted to go with him<sup>as</sup> to Nimrod<sup>la</sup> to be killed. So his wife said to him, ‘Do not go with your son<sup>as</sup> to Nimrod<sup>la</sup> for he<sup>la</sup> will kill him<sup>as</sup>. I shall go with him<sup>as</sup> to one of the caves and leave him<sup>as</sup> there until his<sup>as</sup> death comes to him<sup>as</sup>, and you will not become the one to have killed your own son’. So he said to her, ‘Take him<sup>as</sup>’. So she went with him<sup>as</sup> to a cave, then placed him<sup>as</sup> in it, and placed a rock to block the entrance of the cave. Then she left him<sup>as</sup>. ",
            "He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Made his<sup>as</sup> sustenance to be in his<sup>as</sup> thumb. He<sup>as</sup> would suck it and milk would flow from it. He<sup>as</sup> grew in a day like others grow in a week, and grew in a week like others grow in a month, and grew in a month like others grow in a year. So that situation remained for as long as Allah<sup>azwj</sup> Desired it to remain. Then his<sup>as</sup> mother said to his<sup>as</sup> father, ‘If you allow me, I shall go to that child’. So he allowed her. So she went there and there was Ibrahim<sup>as</sup>. His<sup>as</sup> eyes lit up like two lanterns. She grabbed him<sup>as</sup> and pressed him<sup>as</sup> to her bosom, and fed him<sup>as</sup>. Then she left him there. ",
            "Azar asked her about him<sup>as</sup>, so she said, ‘I have hidden (buried) him in the soil’. She waited, and she would come out for her need, and go to Ibrahim<sup>as</sup>, hold him<sup>as</sup> to her bosom, feed him<sup>as</sup>, and leave him<sup>as</sup>. So when he<sup>as</sup> started moving, she would still come to him<sup>as</sup> and do as she had done before. So when she wanted to leave, he<sup>as</sup> grabbed her robe. She said to him<sup>as</sup>, ‘What is the matter?’ He<sup>as</sup> said to her: ‘Take me<sup>as</sup> with you’. She said, ‘Not until your father orders me to’.",
            "He<sup>asws</sup> said: ‘The mother of Ibrahim<sup>as</sup> came to Azar. She related to him the story. He said to her, ‘Bring him<sup>as</sup> to me. Make him<sup>as</sup> to be seated upon the road, so when his<sup>as</sup> brothers pass by, make him<sup>as</sup> enter with them, and he<sup>as</sup> will not be noticed’. He<sup>asws</sup> said: ‘And the brothers of Ibrahim<sup>as</sup> used to carve the idols and would go with these to the markets and sell them. So she went to him<sup>as</sup>, and came with him<sup>as</sup> until she made him<sup>as</sup> to sit upon the road. And his<sup>as</sup> brothers passed by, he<sup>as</sup> entered with them. So when his<sup>as</sup> father saw him<sup>as</sup>, he was overwhelmed with the love for him<sup>as</sup>. And so the situation remained as such for as long as Allah<sup>azwj</sup> Desired it to’. ",
            "He<sup>asws</sup> said; ‘One day from the days during which, his<sup>as</sup> brothers were in the middle of carving the idols, Ibrahim<sup>as</sup> took the tool, and took a piece of wood, and carved such an idol from it the like of which they had never seen before at all. So Azar said to his<sup>as</sup> mother, ‘I hope that we receive good luck from the blessings of this son<sup>as</sup> of yours’. He<sup>asws</sup> said; ‘So when they were in the middle of that, Ibrahim<sup>as</sup> grabbed hold of the tool and broke the idol which he<sup>as</sup> had carved. So his<sup>as</sup> father got scared and was overcome with severe panic. He said to him<sup>as</sup>, ‘What would you<sup>as</sup> have done with it?’ Ibrahim<sup>as</sup> said to him: ‘And what would you have done with it?’ Azar said, ‘People would have worshipped it’. So Ibrahim<sup>as</sup> said to him: ‘Are you worshipping what you yourself have carved?’ So Azar said to his<sup>as</sup> mother, ‘This is the one due to whom our kingdom would go away, by his<sup>as</sup> hands’. "
          ],
          "en.sarwar": [
            "559. Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Aban Bin usman, from Hujr, who has said the following: Abu Abdullah (a.s.) has said; ‘Ibrahim (as) opposed his (as) people, and faulted their gods until he was brought to Nimrod (la) to contend with him (la). So Ibrahim (as) said: “<a href=\"/#/books/quran:2#h258\">[2:258]</a> My Lord is He who gives life and causes to die, he said: I give life and cause death. Ibrahim said: So surely Allah causes the sun to rise from the east, then make it rise from the west; thus he who disbelieved was confounded; and Allah does not guide aright the unjust people”. And Abu Ja’far (a.s.) said: ‘He (as) faulted their gods, “<a href=\"/#/books/quran:37#h88\">[37:88]</a> And he glanced a glance at the stars <a href=\"/#/books/quran:37#h89\">[37:89]</a> Then said: Lo! I feel sick!” Abu Ja’far (a.s.) said: ‘By Allah (azwj), he (as) was not sick, nor did he (as) lie. So when they turned away from him (as) to attend to their festivities, Ibrahim (as) came to their gods with an axe and broke them, except for the big one of theirs, and placed the axe around its neck. They came back to their gods and saw what had happened to them, so they said, ‘No, by Allah (azwj), no one has the audacity to break these except for the young man (as) who had faulted these and keeps away from them’. So they did not find for him (as) a manner of killing more severe than the fire. They gathered the firewood, and fuelled it. When it came to the day in which he (as) was to be burnt, Nimord (la) and his (la) army came out, and there had been built for them a building to look at him (as) from above to see how the fire would grab hold of him (as). And they placed Ibrahim (as) in a catapult, and the earth cried out: ‘O Lord (azwj)! There is none upon my back who worships You (azwj) apart from him (as) who is being burnt by the fire’. The Lord (azwj) Said: “If he (as) supplicates to Me (azwj), I (azwj) shall Suffice for him (as)’. Aban has mentioned, from Muhammad Bin Marwan, from the one who reported it, from Abu Ja’far (a.s.) that: ‘The supplication of Ibrahim (as) on that day was: ‘O One! O Everlasting! O Everlasting! O One Who does not beget nor is He Begotten, and there is none comparable to Him!’ Then he (as) said: ‘I (as) rely upon Allah (azwj)’. So the Lord (azwj) Blessed and High Said: “I (azwj) shall Suffice for you (as)”. So the fire said: ‘Make me to be cold’. He (a.s.) said: ‘The teeth of Ibrahim chattered from the cold until Allah (azwj) Mighty and Majestic Said: “Safety upon Ibrahim (as)”. And Jibraeel descended, and he was seated with Ibrahim (as) talking to him (as) in the fire. Nimrod (la) said, ‘When you take a god, you should take a god similar to that of the God of Ibrahim (as)’. He (a.s.) said; ‘So a great one from their great ones said, ‘It was I who intended that the fire should not burn him (as)’. So a huge flame shot out from the fire at him until it incinerated him’. He (a.s.) said: ‘Lut (as) believed in him (as), and went out as an emigrant to Syria – him (as), and Sarah (as) and Lut (as)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 555)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15244,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:9",
        "refs": {
          "Mentions": [
            "/books/quran:37:89",
            "/books/quran:2:258",
            "/books/quran:37:88"
          ]
        },
        "text": [
          "15006- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ حُجْرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ خَالَفَ إِبْرَاهِيمُ (عليه السلام) قَوْمَهُ وَ عَابَ آلِهَتَهُمْ حَتَّى أُدْخِلَ عَلَى نُمْرُودَ فَخَاصَمَهُ فَقَالَ إِبْرَاهِيمُ (عليه السلام) رَبِّيَ الَّذِي يُحْيِي وَ يُمِيتُ قالَ أَنَا أُحْيِي وَ أُمِيتُ قَالَ إِبْرَاهِيمُ فَإِنَّ اللَّهَ يَأْتِي بِالشَّمْسِ مِنَ الْمَشْرِقِ فَأْتِ بِها مِنَ الْمَغْرِبِ فَبُهِتَ الَّذِي كَفَرَ وَ اللَّهُ لا يَهْدِي الْقَوْمَ الظَّالِمِينَ",
          "وَ قَالَ أَبُو جَعْفَرٍ (عليه السلام) عَابَ آلِهَتَهُمْ فَنَظَرَ نَظْرَةً فِي النُّجُومِ فَقالَ إِنِّي سَقِيمٌ قَالَ أَبُو جَعْفَرٍ (عليه السلام) وَ اللَّهِ مَا كَانَ سَقِيماً وَ مَا كَذَبَ فَلَمَّا تَوَلَّوْا عَنْهُ مُدْبِرِينَ إِلَى عِيدٍ لَهُمْ دَخَلَ إِبْرَاهِيمُ (عليه السلام) إِلَى آلِهَتِهِمْ بِقَدُومٍ فَكَسَرَهَا إِلَّا كَبِيراً لَهُمْ وَ وَضَعَ الْقَدُومَ فِي عُنُقِهِ فَرَجَعُوا إِلَى آلِهَتِهِمْ فَنَظَرُوا إِلَى مَا صُنِعَ بِهَا فَقَالُوا لَا وَ اللَّهِ مَا اجْتَرَأَ عَلَيْهَا وَ لَا كَسَرَهَا إِلَّا الْفَتَى الَّذِي كَانَ يَعِيبُهَا وَ يَبْرَأُ مِنْهَا ",
          "فَلَمْ يَجِدُوا لَهُ قِتْلَةً أَعْظَمَ مِنَ النَّارِ فَجُمِعَ لَهُ الْحَطَبُ وَ اسْتَجَادُوهُ حَتَّى إِذَا كَانَ الْيَوْمُ الَّذِي يُحْرَقُ فِيهِ بَرَزَ لَهُ نُمْرُودُ وَ جُنُودُهُ وَ قَدْ بُنِيَ لَهُ بِنَاءٌ لِيَنْظُرَ إِلَيْهِ كَيْفَ تَأْخُذُهُ النَّارُ وَ وُضِعَ إِبْرَاهِيمُ (عليه السلام) فِي مَنْجَنِيقٍ وَ قَالَتِ الْأَرْضُ يَا رَبِّ لَيْسَ عَلَى ظَهْرِي أَحَدٌ يَعْبُدُكَ غَيْرُهُ يُحْرَقُ بِالنَّارِ قَالَ الرَّبُّ إِنْ دَعَانِي كَفَيْتُهُ ",
          "فَذَكَرَ أَبَانٌ عَنْ مُحَمَّدِ بْنِ مَرْوَانَ عَمَّنْ رَوَاهُ عَنْ أَبِي جَعْفَرٍ (عليه السلام) أَنَّ دُعَاءَ إِبْرَاهِيمَ (عليه السلام) يَوْمَئِذٍ كَانَ يَا أَحَدُ [يَا أَحَدُ يَا صَمَدُ] يَا صَمَدُ يَا مَنْ لَمْ يَلِدْ وَ لَمْ يُولَدْ وَ لَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ ثُمَّ قَالَ تَوَكَّلْتُ عَلَى اللَّهِ فَقَالَ الرَّبُّ تَبَارَكَ وَ تَعَالَى كَفَيْتُ ",
          "فَقَالَ لِلنَّارِ كُونِي بَرْداً قَالَ فَاضْطَرَبَتْ أَسْنَانُ إِبْرَاهِيمَ (عليه السلام) مِنَ الْبَرْدِ حَتَّى قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ سَلاماً عَلى إِبْراهِيمَ وَ انْحَطَّ جَبْرَئِيلُ (عليه السلام) وَ إِذَا هُوَ جَالِسٌ مَعَ إِبْرَاهِيمَ (عليه السلام) يُحَدِّثُهُ فِي النَّارِ قَالَ نُمْرُودُ مَنِ اتَّخَذَ إِلَهاً فَلْيَتَّخِذْ مِثْلَ إِلَهِ إِبْرَاهِيمَ ",
          "قَالَ فَقَالَ عَظِيمٌ مِنْ عُظَمَائِهِمْ إِنِّي عَزَمْتُ عَلَى النَّارِ أَنْ لَا تُحْرِقَهُ قَالَ فَأَخَذَ عُنُقٌ مِنَ النَّارِ نَحْوَهُ حَتَّى أَحْرَقَهُ ",
          "قَالَ فَآمَنَ لَهُ لُوطٌ وَ خَرَجَ مُهَاجِراً إِلَى الشَّامِ هُوَ وَ سَارَةُ وَ لُوطٌ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473694\">H 15006</a> – Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Aban Bin usman, from Hujr, who has said the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said; ‘Ibrahim<sup>as</sup> opposed his<sup>as</sup> people, and faulted their gods until he was brought to Nimrod<sup>la</sup> to contend with him<sup>la</sup>. So Ibrahim<sup>as</sup> said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:2#h258\">[2:258]</a> My Lord is He who gives life and causes to die, he said: I give life and cause death. Ibrahim said: So surely Allah causes the sun to rise from the east, then make it rise from the west; thus he who disbelieved was confounded; and Allah does not guide aright the unjust people”</span>.",
            "And Abu Ja’far<sup>asws</sup> said: ‘He<sup>as</sup> faulted their gods, <span class=\"ibTxt\">“<a href=\"/#/books/quran:37#h88\">[37:88]</a> And he glanced a glance at the stars <a href=\"/#/books/quran:37#h89\">[37:89]</a> Then said: Lo! I feel sick!”</span> Abu Ja’far<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>, he<sup>as</sup> was not sick, nor did he<sup>as</sup> lie. So when they turned away from him<sup>as</sup> to attend to their festivities, Ibrahim<sup>as</sup> came to their gods with an axe and broke them, except for the big one of theirs, and placed the axe around its neck. They came back to their gods and saw what had happened to them, so they said, ‘No, by Allah<sup>azwj</sup>, no one has the audacity to break these except for the young man<sup>as</sup> who had faulted these and keeps away from them’. ",
            "So they did not find for him<sup>as</sup> a manner of killing more severe than the fire. They gathered the firewood, and fuelled it. When it came to the day in which he<sup>as</sup> was to be burnt, Nimord<sup>la</sup> and his<sup>la</sup> army came out, and there had been built for them a building to look at him<sup>as</sup> from above to see how the fire would grab hold of him<sup>as</sup>. And they placed Ibrahim<sup>as</sup> in a catapult, and the earth cried out: ‘O Lord<sup>azwj</sup>! There is none upon my back who worships You<sup>azwj</sup> apart from him<sup>as</sup> who is being burnt by the fire’. The Lord<sup>azwj</sup> Said: “If he<sup>as</sup> supplicates to Me<sup>azwj</sup>, I<sup>azwj</sup> shall Suffice for him<sup>as</sup>’.  ",
            "<span style=\"font-size: small\">Aban has mentioned, from Muhammad Bin Marwan, from the one who reported it</span>, from Abu Ja’far<sup>asws</sup> that: ‘The supplication of Ibrahim<sup>as</sup> on that day was: ‘O One! O Everlasting! O Everlasting! O One Who does not beget nor is He Begotten, and there is none comparable to Him!’ Then he<sup>as</sup> said: ‘I<sup>as</sup> rely upon Allah<sup>azwj</sup>’. So the Lord<sup>azwj</sup> Blessed and High Said: “I<sup>azwj</sup> shall Suffice for you<sup>as</sup>”. ",
            "So the fire said: ‘Make me to be cold’. He<sup>asws</sup> said: ‘The teeth of Ibrahim chattered from the cold until Allah<sup>azwj</sup> Mighty and Majestic Said: “Safety upon Ibrahim<sup>as</sup>”. And Jibraeel descended, and he was seated with Ibrahim<sup>as</sup> talking to him<sup>as</sup> in the fire. Nimrod<sup>la</sup> said, ‘When you take a god, you should take a god similar to that of the God of Ibrahim<sup>as</sup>’.",
            "He<sup>asws</sup> said; ‘So a great one from their great ones said, ‘It was I who intended that the fire should not burn him<sup>as</sup>’. So a huge flame shot out from the fire at him until it incinerated him’. ",
            "He<sup>asws</sup> said: ‘Lut<sup>as</sup> believed in him<sup>as</sup>, and went out as an emigrant to Syria – him<sup>as</sup>, and Sarah<sup>as</sup> and Lut<sup>as</sup>’. "
          ],
          "en.sarwar": [
            "560. Ali Bin Ibrahim, from his father, and a number of our companions, from Sahl Bin Ziyad, together from Al-Hassan Bin Mahboub, from Ibrahim Bin Abu Ziyad Al-Karkhy who said: ‘I heard Abu Abdullah (a.s.) saying that: ‘Ibrahim (as) was born at Kowsy Ruba, and his (as) father was from its inhabitants, and the mother of Ibrahim (as), and the mother of Lut (as) were Sara and Warqa’ (and in another copy ‘Ruqayya’), and were sisters, and they were both the daughters of Lahij (as). And Lahij (as) was a Prophet (as), a Warner, but was not a Messenger (as). And Ibrahim (as) was, in his (as) youth, upon the nature which Allah (azwj) Mighty and Majestic Created, to the extent that Allah (azwj) Blessed and High Guided him (as) to His (azwj) Religion, and Chose him (as). And he (as) married Sara, the daughter of Lahij (as), the daughter of his (as) maternal aunt. And Sara was the owner of a lot of assets, and vast lands, and of good financial condition, and Ibrahim (as) was the owner of all what she had owned. So he (as) managed it, and corrected the affairs, and increased the assets and plantations considerably, to the extent that he (as) became the most affluent man in the land of Kowsy Ruba. And when Ibrahim (as) broke the idols, Nimrod (la) ordered his (as) capture, and they built a platform, and gathered the firewood around it and ignited the fire, and threw Ibrahim (as) via a catapult to be burnt by it. Then they relaxed until the fire burnt out. Then they looked at the platform and there was Ibrahim (as), safe and sound, but the ropes that he (as) was bound by had been burnt to ashes. So they informed Nimrod (la) of his (as) news. So he (la) ordered them to exile Ibrahim (as) from his (as) city, and prevent him (as) from the taking his (as) assets and his (as) wealth with him (as). So Ibrahim (as) disputed with them with regards to that. He (as) said: ‘If you (as) are confiscating my (as) assets and my (as) wealth, therefore it is my (as) right against you that you should return to me (as) what has gone from my (as) lifetime in your city’, and he (as) argued against the judge of Nimrod (la), so he judged that Ibrahim (as) should submit to him (la) all of what he (as) had acquired in their city, and that Nimrod (la) to return what had gone from his (as) life. The news of that reached Nimrod (la), so he (la) ordered that they should open the way for him (as) and allow him (as) to take his (as) assets, and his (as) wealth, and throw him (as) out from their city to Syria. So Ibrahim (as) went out, and with him (as) was Lut (as) who would not separate from him (as), and Sara, and said to them: ‘I (as) am going to my (as) Lord (azwj) to be Guided by Him (azwj)’ – meaning Bayt Al-Maqdis. So Ibrahim (as) took his (as) assets, and his (as) wealth, and constructed a carriage (Taboot), and made Sara to be in it, and locked it with locks, due to his (as) honour from it, and went until he (as) exited from the authority of Nimrod (la) and went to the authority of a man from the Coptics called Araarat. So they passed by a tax collector of his. The tax collector stopped him (as) in order to tax him (as) for what was with him (as). So when he (as) ended up with the tax collector and with him (as) was the carriage (Taboot), the tax collector said to Ibrahim (as), ‘Open this carriage (Taboot) until whatever is in it gets displayed’. So Ibrahim (as) said to him: ‘Say whatever you like with regards to it, from the gold or the silver and I (as) shall pay it as tax, but do not open it’. The tax collector refused until he opened it, and Ibrahim (as) was angry over its opening. So when Sara came out, and she had good qualities and was very beautiful, the tax collector said to him (as), ‘What is (the relationship of) this woman to you (as)?’ Ibrahim (as) said; ‘She is my (as) sanctity (Hurmat i.e. wife) and the daughter of my (as) aunt’. So the tax collector said to him (as), ‘So what made you (as) to place her in this carriage (Taboot)?’ Ibrahim (as) said: ‘The honour (Ghairat) against anyone looking at her’. So the tax collector said to him (as), ‘I will not leave you (as) to depart until I let the king know of her condition and yours (as)’. So he sent a messenger to the king, who let him know, and the king sent a messenger from him telling them to bring him (as) to him. So Ibrahim (as) said to them: ‘I (as) will not separate from the carriage (Taboot) even if my (as) soul separates from my (as) body’. So they informed the king about that, and the king sent a message that they should bring him (as) and the box with him (as). So they took Ibrahim (as), and the carriage (Taboot), and all what was with him (as) until they came up to the king. The king said to him (as), ‘Open the carriage (Taboot)!’ So Ibrahim (as) said: ‘O king! In it is my (as) sanctity (Hurmat i.e. wife), the daughter of my (as) aunt, and I (as) am prepared to ransom all what is with me (as)’. The king got angry and forced Ibrahim (as) to open it. So when he saw Sara, he could not control his foolishness, and extended his hand towards her. Ibrahim (as) turned his (as) face away from her and from him due to his (as) honour (Ghairat) from it, and said: ‘Our Allah (azwj)! Withhold his hand from my (as) sanctity (Hurmat i.e. wife) and daughter of my (as) aunt!’ So his hand could not arrive to her nor would it return back to him. So the king said to him (as), ‘Was it your (as) Lord (azwj) Who did this to me?’ He (as) said to him: ‘Yes. Surely, my (as) Lord (azwj) is Honourable (Ghayyour). He (azwj) Abhors the Prohibited, and He (azwj) is the One Who Made this situation between you and what you intended from the Prohibited’. The king said to him (as), ‘So supplicate to your (as) God that He (azwj) should Return my hand back to me. If He (azwj) Answers you (as), I will never present (myself) to her’. Ibrahim (as) said: ‘My (as) God! Return his hand back to him, so that he would refrain from my (as) sanctity (Hurmat i.e. wife)’. So Allah (azwj) Mighty and Majestic Returned his hand back to him. The king came near to her and looked at her, then extended his hand around her. So Ibrahim (as) turned his (as) face away from it due to his (as) honour (Ghairat) from it, and said; ‘Our Allah (azwj)! Withhold his hand from her! So his hand withered and could not arrive to her. So the king said to Ibrahim (as), ‘Surely your (as) Lord (azwj) is Honourable (Ghayyour) and so are you, so supplicate to your God that He (azwj) should return my hand back to me, for it is an action that I shall not repeat. Ibrahim (as) said to him: ‘I (as) will ask Him (azwj) upon the condition that you will not ask me (as) again to supplicate to Him (azwj)’. The king said, ‘Yes’. So Ibrahim (as) said: ‘Our Allah (azwj)! If he is truthful, Return his hand! His hand returned back to him. So when the king saw that from the honour which he had never seen before, and saw the Sign in (the return of) his hand, he magnified Ibrahim (as), and endowed him (as) (with gifts), and honoured him (as), and let him (as) leave and said to him (as), ‘I grant you (as) safety from displaying her, or for anything else which is with you (as). So go to wherever you like, but I have a need from you (as)’. Ibrahim (as) said: ‘What is it?’ He said to him (as), ‘I would love it if you (as) would permit me that I should give her an attendant who is a Coptic woman who has beauty and intellect, who will serve her’. So Ibrahim (as) gave him permission for that. So he called for her, and gifted her to Sara, and she is Hajar, mother of Ismail (as). Ibrahim (as) travelled with all of what was with him (as), and the king came out with him, walking behind Ibrahim (as), in respect of Ibrahim (as) and for his (as) prestige. So Allah (azwj) Blessed and High Revealed to Ibrahim (as): “Pause, and do not walk in front of the domineering tyrant and he walks behind you (as), but make him to be in front of you (as) and walk, and show him respect, and prestige, for he is domineering, and it is necessary for there to be authorities in the earth, be they righteous or immoral”. So Ibrahim (as) paused and said to the king: ‘Wait, for my (as) God has revealed unto me (as) at this very moment that I (as) should show you respect, and honour you, and make you to walk in front of me (as), and I (as) should walk behind you, due to your majesty’. So the king said to him (as), ‘This has been Revealed unto you (as)?’ Ibrahim (as) said to him: ‘Yes’. So the king said to him (as), ‘I testify that surely your (as) God is Friendly, Lenient, generous, and that you are making me incline towards your (as) Religion’. And the king bade farewell to them. So Ibrahim (as) journeyed until he (as) encamped at the high place of Syria, and left behind Lut (as) in the lower valleys of Syria. Then, when the birth of a son was delayed, Ibrahim (as) said to Sara: ‘If you want, you can sell Hajar to me (as), perhaps Allah (azwj) would Grant us the sustenance of a son from it, who would become a successor for us’. So Ibrahim (as) bought Hajar from Sara. He (as) went to her, and she gave birth to Ismail (as)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 559)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15245,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:10",
        "text": [
          "15007- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ إِبْرَاهِيمَ بْنِ أَبِي زِيَادٍ الْكَرْخِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ إِنَّ إِبْرَاهِيمَ (عليه السلام) كَانَ مَوْلِدُهُ بِكُوثَى رُبَا وَ كَانَ أَبُوهُ مِنْ أَهْلِهَا وَ كَانَتْ أُمُّ إِبْرَاهِيمَ وَ أُمُّ لُوطٍ سَارَةَ وَ وَرَقَةَ وَ فِي نُسْخَةٍ رُقَيَّةَ أُخْتَيْنِ وَ هُمَا ابْنَتَانِ لِلَاحِجٍ وَ كَانَ اللَّاحِجُ نَبِيّاً مُنْذِراً وَ لَمْ يَكُنْ رَسُولًا وَ كَانَ إِبْرَاهِيمُ (عليه السلام) فِي شَبِيبَتِهِ عَلَى الْفِطْرَةِ الَّتِي فَطَرَ اللَّهُ عَزَّ وَ جَلَّ الْخَلْقَ عَلَيْهَا حَتَّى هَدَاهُ اللَّهُ تَبَارَكَ وَ تَعَالَى إِلَى دِينِهِ وَ اجْتَبَاهُ وَ إِنَّهُ تَزَوَّجَ سَارَةَ ابْنَةَ لَاحِجٍ وَ هِيَ ابْنَةُ خَالَتِهِ وَ كَانَتْ سَارَةُ صَاحِبَةَ مَاشِيَةٍ كَثِيرَةٍ وَ أَرْضٍ وَاسِعَةٍ وَ حَالٍ حَسَنَةٍ وَ كَانَتْ قَدْ مَلَّكَتْ إِبْرَاهِيمَ (عليه السلام) جَمِيعَ مَا كَانَتْ تَمْلِكُهُ فَقَامَ فِيهِ وَ أَصْلَحَهُ وَ كَثُرَتِ الْمَاشِيَةُ وَ الزَّرْعُ حَتَّى لَمْ يَكُنْ بِأَرْضِ كُوثَى رُبَا رَجُلٌ أَحْسَنُ حَالًا مِنْهُ ",
          "وَ إِنَّ إِبْرَاهِيمَ (عليه السلام) لَمَّا كَسَرَ أَصْنَامَ نُمْرُودَ أَمَرَ بِهِ نُمْرُودُ فَأُوثِقَ وَ عَمِلَ لَهُ حَيْراً وَ جَمَعَ لَهُ فِيهِ الْحَطَبَ وَ أَلْهَبَ فِيهِ النَّارَ ثُمَّ قَذَفَ إِبْرَاهِيمَ (عليه السلام) فِي النَّارِ لِتُحْرِقَهُ ثُمَّ اعْتَزَلُوهَا حَتَّى خَمَدَتِ النَّارُ ثُمَّ أَشْرَفُوا عَلَى الْحَيْرِ فَإِذَا هُمْ بِإِبْرَاهِيمَ (عليه السلام) سَلِيماً مُطْلَقاً مِنْ وَثَاقِهِ فَأُخْبِرَ نُمْرُودُ خَبَرَهُ فَأَمَرَهُمْ أَنْ يَنْفُوا إِبْرَاهِيمَ (عليه السلام) مِنْ بِلَادِهِ وَ أَنْ يَمْنَعُوهُ مِنَ الْخُرُوجِ بِمَاشِيَتِهِ وَ مَالِهِ",
          "فَحَاجَّهُمْ إِبْرَاهِيمُ (عليه السلام) عِنْدَ ذَلِكَ فَقَالَ إِنْ أَخَذْتُمْ مَاشِيَتِي وَ مَالِي فَإِنَّ حَقِّي عَلَيْكُمْ أَنْ تَرُدُّوا عَلَيَّ مَا ذَهَبَ مِنْ عُمُرِي فِي بِلَادِكُمْ وَ اخْتَصَمُوا إِلَى قَاضِي نُمْرُودَ فَقَضَى عَلَى إِبْرَاهِيمَ (عليه السلام) أَنْ يُسَلِّمَ إِلَيْهِمْ جَمِيعَ مَا أَصَابَ فِي بِلَادِهِمْ وَ قَضَى عَلَى أَصْحَابِ نُمْرُودَ أَنْ يَرُدُّوا عَلَى إِبْرَاهِيمَ (عليه السلام) مَا ذَهَبَ مِنْ عُمُرِهِ فِي بِلَادِهِمْ فَأُخْبِرَ بِذَلِكَ نُمْرُودُ فَأَمَرَهُمْ أَنْ يُخَلُّوا سَبِيلَهُ وَ سَبِيلَ مَاشِيَتِهِ وَ مَالِهِ وَ أَنْ يُخْرِجُوهُ وَ قَالَ إِنَّهُ إِنْ بَقِيَ فِي بِلَادِكُمْ أَفْسَدَ دِينَكُمْ وَ أَضَرَّ بِآلِهَتِكُمْ فَأَخْرَجُوا إِبْرَاهِيمَ وَ لُوطاً مَعَهُ صَلَّى اللَّهُ عَلَيْهِمَا مِنْ بِلَادِهِمْ إِلَى الشَّامِ",
          "فَخَرَجَ إِبْرَاهِيمُ وَ مَعَهُ لُوطٌ لَا يُفَارِقُهُ وَ سَارَةُ وَ قَالَ لَهُمْ إِنِّي ذاهِبٌ إِلى رَبِّي سَيَهْدِينِ يَعْنِي بَيْتَ الْمَقْدِسِ فَتَحَمَّلَ إِبْرَاهِيمُ (عليه السلام) بِمَاشِيَتِهِ وَ مَالِهِ وَ عَمِلَ تَابُوتاً وَ جَعَلَ فِيهِ سَارَةَ وَ شَدَّ عَلَيْهَا الْأَغْلَاقَ غَيْرَةً مِنْهُ عَلَيْهَا وَ مَضَى حَتَّى خَرَجَ مِنْ سُلْطَانِ نُمْرُودَ وَ صَارَ إِلَى سُلْطَانِ رَجُلٍ مِنَ الْقِبْطِ يُقَالُ لَهُ عَرَارَةُ",
          "فَمَرَّ بِعَاشِرٍ لَهُ فَاعْتَرَضَهُ الْعَاشِرُ لِيَعْشُرَ مَا مَعَهُ فَلَمَّا انْتَهَى إِلَى الْعَاشِرِ وَ مَعَهُ التَّابُوتُ قَالَ الْعَاشِرُ لِإِبْرَاهِيمَ (عليه السلام) افْتَحْ هَذَا التَّابُوتَ حَتَّى نَعْشُرَ مَا فِيهِ فَقَالَ لَهُ إِبْرَاهِيمُ (عليه السلام) قُلْ مَا شِئْتَ فِيهِ مِنْ ذَهَبٍ أَوْ فِضَّةٍ حَتَّى نُعْطِيَ عُشْرَهُ وَ لَا نَفْتَحَهُ قَالَ فَأَبَى الْعَاشِرُ إِلَّا فَتْحَهُ قَالَ وَ غَضِبَ إِبْرَاهِيمَ (عليه السلام) عَلَى فَتْحِهِ فَلَمَّا بَدَتْ لَهُ سَارَةُ وَ كَانَتْ مَوْصُوفَةً بِالْحُسْنِ وَ الْجَمَالِ قَالَ لَهُ الْعَاشِرُ مَا هَذِهِ الْمَرْأَةُ مِنْكَ قَالَ إِبْرَاهِيمُ (عليه السلام) هِيَ حُرْمَتِي وَ ابْنَةُ خَالَتِي",
          "فَقَالَ لَهُ الْعَاشِرُ فَمَا دَعَاكَ إِلَى أَنْ خَبَيْتَهَا فِي هَذَا التَّابُوتِ فَقَالَ إِبْرَاهِيمُ (عليه السلام) الْغَيْرَةُ عَلَيْهَا أَنْ يَرَاهَا أَحَدٌ فَقَالَ لَهُ الْعَاشِرُ لَسْتُ أَدَعُكَ تَبْرَحُ حَتَّى أُعْلِمَ الْمَلِكَ حَالَهَا وَ حَالَكَ قَالَ فَبَعَثَ رَسُولًا إِلَى الْمَلِكِ فَأَعْلَمَهُ فَبَعَثَ الْمَلِكُ رَسُولًا مِنْ قِبَلِهِ لِيَأْتُوهُ بِالتَّابُوتِ فَأَتَوْا لِيَذْهَبُوا بِهِ فَقَالَ لَهُمْ إِبْرَاهِيمُ (عليه السلام) إِنِّي لَسْتُ أُفَارِقُ التَّابُوتَ حَتَّى تُفَارِقَ رُوحِي جَسَدِي فَأَخْبَرُوا الْمَلِكَ بِذَلِكَ فَأَرْسَلَ الْمَلِكُ أَنِ احْمِلُوهُ وَ التَّابُوتَ مَعَهُ",
          "فَحَمَلُوا إِبْرَاهِيمَ (عليه السلام) و التَّابُوتَ وَ جَمِيعَ مَا كَانَ مَعَهُ حَتَّى أُدْخِلَ عَلَى الْمَلِكِ فَقَالَ لَهُ الْمَلِكُ افْتَحِ التَّابُوتَ فَقَالَ إِبْرَاهِيمُ (عليه السلام) أَيُّهَا الْمَلِكُ إِنَّ فِيهِ حُرْمَتِي وَ ابْنَةَ خَالَتِي وَ أَنَا مُفْتَدٍ فَتْحَهُ بِجَمِيعِ مَا مَعِي قَالَ فَغَضِبَ الْمَلِكُ إِبْرَاهِيمَ عَلَى فَتْحِهِ فَلَمَّا رَأَى سَارَةَ لَمْ يَمْلِكْ حِلْمُهُ سَفَهَهُ أَنْ مَدَّ يَدَهُ إِلَيْهَا فَأَعْرَضَ إِبْرَاهِيمُ (عليه السلام) بِوَجْهِهِ عَنْهَا وَ عَنْهُ غَيْرَةً مِنْهُ وَ قَالَ اللَّهُمَّ احْبِسْ يَدَهُ عَنْ حُرْمَتِي وَ ابْنَةِ خَالَتِي فَلَمْ تَصِلْ يَدُهُ إِلَيْهَا وَ لَمْ تَرْجِعْ إِلَيْهِ",
          "فَقَالَ لَهُ الْمَلِكُ إِنَّ إِلَهَكَ هُوَ الَّذِي فَعَلَ بِي هَذَا فَقَالَ لَهُ نَعَمْ إِنَّ إِلَهِي غَيُورٌ يَكْرَهُ الْحَرَامَ وَ هُوَ الَّذِي حَالَ بَيْنَكَ وَ بَيْنَ مَا أَرَدْتَ مِنَ الْحَرَامِ فَقَالَ لَهُ الْمَلِكُ فَادْعُ إِلَهَكَ يَرُدَّ عَلَيَّ يَدِي فَإِنْ أَجَابَكَ فَلَمْ أَعْرِضْ لَهَا فَقَالَ إِبْرَاهِيمُ (عليه السلام) إِلَهِي رُدَّ عَلَيْهِ يَدَهُ لِيَكُفَّ عَنْ حُرْمَتِي قَالَ فَرَدَّ اللَّهُ عَزَّ وَ جَلَّ عَلَيْهِ يَدَهُ",
          "فَأَقْبَلَ الْمَلِكُ نَحْوَهَا بِبَصَرِهِ ثُمَّ أَعَادَ بِيَدِهِ نَحْوَهَا فَأَعْرَضَ إِبْرَاهِيمُ (عليه السلام) عَنْهُ بِوَجْهِهِ غَيْرَةً مِنْهُ وَ قَالَ اللَّهُمَّ احْبِسْ يَدَهُ عَنْهَا قَالَ فَيَبِسَتْ يَدُهُ وَ لَمْ تَصِلْ إِلَيْهَا فَقَالَ الْمَلِكُ لِإِبْرَاهِيمَ (عليه السلام) إِنَّ إِلَهَكَ لَغَيُورٌ وَ إِنَّكَ لَغَيُورٌ فَادْعُ إِلَهَكَ يَرُدَّ عَلَيَّ يَدِي فَإِنَّهُ إِنْ فَعَلَ لَمْ أَعُدْ فَقَالَ لَهُ إِبْرَاهِيمُ (عليه السلام) أَسْأَلُهُ ذَلِكَ عَلَى أَنَّكَ إِنْ عُدْتَ لَمْ تَسْأَلْنِي أَنْ أَسْأَلَهُ فَقَالَ الْمَلِكُ نَعَمْ فَقَالَ إِبْرَاهِيمُ (عليه السلام) اللَّهُمَّ إِنْ كَانَ صَادِقاً فَرُدَّ عَلَيْهِ يَدَهُ فَرَجَعَتْ إِلَيْهِ يَدُهُ",
          "فَلَمَّا رَأَى ذَلِكَ الْمَلِكُ مِنَ الْغَيْرَةِ مَا رَأَى وَ رَأَى الْآيَةَ فِي يَدِهِ عَظَّمَ إِبْرَاهِيمَ (عليه السلام) وَ هَابَهُ وَ أَكْرَمَهُ وَ اتَّقَاهُ وَ قَالَ لَهُ قَدْ أَمِنْتَ مِنْ أَنْ أَعْرِضَ لَهَا أَوْ لِشَيْ‏ءٍ مِمَّا مَعَكَ فَانْطَلِقْ حَيْثُ شِئْتَ وَ لَكِنْ لِي إِلَيْكَ حَاجَةٌ فَقَالَ إِبْرَاهِيمُ (عليه السلام) مَا هِيَ فَقَالَ لَهُ أُحِبُّ أَنْ تَأْذَنَ لِي أَنْ أُخْدِمَهَا قِبْطِيَّةً عِنْدِي جَمِيلَةً عَاقِلَةً تَكُونُ لَهَا خَادِماً قَالَ فَأَذِنَ لَهُ إِبْرَاهِيمُ (عليه السلام)  فَدَعَا بِهَا فَوَهَبَهَا لِسَارَةَ وَ هِيَ هَاجَرُ أُمُّ إِسْمَاعِيلَ (عليه السلام)",
          "فَسَارَ إِبْرَاهِيمُ (عليه السلام) بِجَمِيعِ مَا مَعَهُ وَ خَرَجَ الْمَلِكُ مَعَهُ يَمْشِي خَلْفَ إِبْرَاهِيمَ (عليه السلام) إِعْظَاماً لِإِبْرَاهِيمَ (عليه السلام) وَ هَيْبَةً لَهُ فَأَوْحَى اللَّهُ تَبَارَكَ وَ تَعَالَى إِلَى إِبْرَاهِيمَ أَنْ قِفْ وَ لَا تَمْشِ قُدَّامَ الْجَبَّارِ الْمُتَسَلِّطِ وَ يَمْشِي هُوَ خَلْفَكَ وَ لَكِنِ اجْعَلْهُ أَمَامَكَ وَ امْشِ وَ عَظِّمْهُ وَ هَبْهُ فَإِنَّهُ مُسَلَّطٌ وَ لَا بُدَّ مِنْ إِمْرَةٍ فِي الْأَرْضِ بَرَّةٍ أَوْ فَاجِرَةٍ فَوَقَفَ إِبْرَاهِيمُ (عليه السلام) وَ قَالَ لِلْمَلِكِ امْضِ فَإِنَّ إِلَهِي أَوْحَى إِلَيَّ السَّاعَةَ أَنْ أُعَظِّمَكَ وَ أَهَابَكَ وَ أَنْ أُقَدِّمَكَ أَمَامِي وَ أَمْشِيَ خَلْفَكَ إِجْلَالًا لَكَ فَقَالَ لَهُ الْمَلِكُ أَوْحَى إِلَيْكَ بِهَذَا فَقَالَ لَهُ إِبْرَاهِيمُ (عليه السلام) نَعَمْ فَقَالَ لَهُ الْمَلِكُ أَشْهَدُ إِنَّ إِلَهَكَ لَرَفِيقٌ حَلِيمٌ كَرِيمٌ وَ إِنَّكَ تُرَغِّبُنِي فِي دِينِكَ قَالَ وَ وَدَّعَهُ الْمَلِكُ",
          "فَسَارَ إِبْرَاهِيمُ (عليه السلام) حَتَّى نَزَلَ بِأَعْلَى الشَّامَاتِ وَ خَلَّفَ لُوطاً (عليه السلام) فِي أَدْنَى الشَّامَاتِ ثُمَّ إِنَّ إِبْرَاهِيمَ (عليه السلام) لَمَّا أَبْطَأَ عَلَيْهِ الْوَلَدُ قَالَ لِسَارَةَ لَوْ شِئْتِ لَبِعْتِنِي هَاجَرَ لَعَلَّ اللَّهَ أَنْ يَرْزُقَنَا مِنْهَا وَلَداً فَيَكُونَ لَنَا خَلَفاً فَابْتَاعَ إِبْرَاهِيمُ (عليه السلام) هَاجَرَ مِنْ سَارَةَ فَوَقَعَ عَلَيْهَا فَوَلَدَتْ إِسْمَاعِيلَ (عليه السلام)."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473695\">H 15007</a> – Ali Bin Ibrahim, from his father, and a number of our companions, from Sahl Bin Ziyad, together from Al-Hassan Bin Mahboub, from Ibrahim Bin Abu Ziyad Al-Karkhy who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> heard Abu Abdullah</span><sup>asws</sup> saying that: ‘Ibrahim<sup>as</sup> was born at Kowsy Ruba, and his<sup>as</sup> father was from its inhabitants, and the mother of Ibrahim<sup>as</sup>, and the mother of Lut<sup>as</sup> were Sara and Warqa’ (and in another copy ‘Ruqayya’), and were sisters, and they were both the daughters of Lahij<sup>as</sup>. And Lahij<sup>as</sup> was a Prophet<sup>as</sup>, a Warner, but was not a Messenger<sup>as</sup>. And Ibrahim<sup>as</sup> was, in his<sup>as</sup> youth, upon the nature which Allah<sup>azwj</sup> Mighty and Majestic Created, to the extent that Allah<sup>azwj</sup> Blessed and High Guided him<sup>as</sup> to His<sup>azwj</sup> Religion, and Chose him<sup>as</sup>. And he<sup>as</sup> married Sara, the daughter of Lahij<sup>as</sup>, the daughter of his<sup>as</sup> maternal aunt. And Sara was the owner of a lot of assets, and vast lands, and of good financial condition, and Ibrahim<sup>as</sup> was the owner of all what she had owned. So he<sup>as</sup> managed it, and corrected the affairs, and increased the assets and plantations considerably, to the extent that he<sup>as</sup> became the most affluent man in the land of Kowsy Ruba. ",
            "And when Ibrahim<sup>as</sup> broke the idols, Nimrod<sup>la</sup> ordered his<sup>as</sup> capture, and they built a platform, and gathered the firewood around it and ignited the fire, and threw Ibrahim<sup>as</sup> via a catapult to be burnt by it. Then they relaxed until the fire burnt out. Then they looked at the platform and there was Ibrahim<sup>as</sup>, safe and sound, but the ropes that he<sup>as</sup> was bound by had been burnt to ashes. So they informed Nimrod<sup>la</sup> of his<sup>as</sup> news. So he<sup>la</sup> ordered them to exile Ibrahim<sup>as</sup> from his<sup>as</sup> city, and prevent him<sup>as</sup> from the taking his<sup>as</sup> assets and his<sup>as</sup> wealth with him<sup>as</sup>.",
            "So Ibrahim<sup>as</sup> disputed with them with regards to that. He<sup>as</sup> said: ‘If you<sup>as</sup> are confiscating my<sup>as</sup> assets and my<sup>as</sup> wealth, therefore it is my<sup>as</sup> right against you that you should return to me<sup>as</sup> what has gone from my<sup>as</sup> lifetime in your city’, and he<sup>as</sup> argued against the judge of Nimrod<sup>la</sup>, so he judged that Ibrahim<sup>as</sup> should submit to him<sup>la</sup> all of what he<sup>as</sup> had acquired in their city, and that Nimrod<sup>la</sup> to return what had gone from his<sup>as</sup> life. The news of that reached Nimrod<sup>la</sup>, so he<sup>la</sup> ordered that they should open the way for him<sup>as</sup> and allow him<sup>as</sup> to take his<sup>as</sup> assets, and his<sup>as</sup> wealth, and throw him<sup>as</sup> out from their city to Syria.",
            "So Ibrahim<sup>as</sup> went out, and with him<sup>as</sup> was Lut<sup>as</sup> who would not separate from him<sup>as</sup>, and Sara, and said to them: ‘I<sup>as</sup> am going to my<sup>as</sup> Lord<sup>azwj</sup> to be Guided by Him<sup>azwj</sup>’ – meaning Bayt Al-Maqdis. So Ibrahim<sup>as</sup> took his<sup>as</sup> assets, and his<sup>as</sup> wealth, and constructed a carriage (Taboot), and made Sara to be in it, and locked it with locks, due to his<sup>as</sup> honour from it, and went until he<sup>as</sup> exited from the authority of Nimrod<sup>la</sup> and went to the authority of a man from the Coptics called Araarat.  ",
            "So they passed by a tax collector of his. The tax collector stopped him<sup>as</sup> in order to tax him<sup>as</sup> for what was with him<sup>as</sup>. So when he<sup>as</sup> ended up with the tax collector and with him<sup>as</sup> was the carriage (Taboot), the tax collector said to Ibrahim<sup>as</sup>, ‘Open this carriage (Taboot) until whatever is in it gets displayed’. So Ibrahim<sup>as</sup> said to him: ‘Say whatever you like with regards to it, from the gold or the silver and I<sup>as</sup> shall pay it as tax, but do not open it’. The tax collector refused until he opened it, and Ibrahim<sup>as</sup> was angry over its opening. So when Sara came out, and she had good qualities and was very beautiful, the tax collector said to him<sup>as</sup>, ‘What is (the relationship of) this woman to you<sup>as</sup>?’ Ibrahim<sup>as</sup> said; ‘She is my<sup>as</sup> sanctity (Hurmat i.e. wife) and the daughter of my<sup>as</sup> aunt’. ",
            "So the tax collector said to him<sup>as</sup>, ‘So what made you<sup>as</sup> to place her in this carriage (Taboot)?’ Ibrahim<sup>as</sup> said: ‘The honour (Ghairat) against anyone looking at her’. So the tax collector said to him<sup>as</sup>, ‘I will not leave you<sup>as</sup> to depart until I let the king know of her condition and yours<sup>as</sup>’. So he sent a messenger to the king, who let him know, and the king sent a messenger from him telling them to bring him<sup>as</sup> to him. So Ibrahim<sup>as</sup> said to them: ‘I<sup>as</sup> will not separate from the carriage (Taboot) even if my<sup>as</sup> soul separates from my<sup>as</sup> body’. So they informed the king about that, and the king sent a message that they should bring him<sup>as</sup> and the box with him<sup>as</sup>.",
            "So they took Ibrahim<sup>as</sup>, and the carriage (Taboot), and all what was with him<sup>as</sup> until they came up to the king. The king said to him<sup>as</sup>, ‘Open the carriage (Taboot)!’ So Ibrahim<sup>as</sup> said: ‘O king! In it is my<sup>as</sup> sanctity (Hurmat i.e. wife), the daughter of my<sup>as</sup> aunt, and I<sup>as</sup> am prepared to ransom all what is with me<sup>as</sup>’. The king got angry and forced Ibrahim<sup>as</sup> to open it. So when he saw Sara, he could not control his foolishness, and extended his hand towards her. Ibrahim<sup>as</sup> turned his<sup>as</sup> face away from her and from him due to his<sup>as</sup> honour (Ghairat) from it, and said: ‘Our Allah<sup>azwj</sup>! Withhold his hand from my<sup>as</sup> sanctity (Hurmat i.e. wife) and daughter of my<sup>as</sup> aunt!’ So his hand could not arrive to her nor would it return back to him. ",
            "So the king said to him<sup>as</sup>, ‘Was it your<sup>as</sup> Lord<sup>azwj</sup> Who did this to me?’ He<sup>as</sup> said to him: ‘Yes. Surely, my<sup>as</sup> Lord<sup>azwj</sup> is Honourable (Ghayyour). He<sup>azwj</sup> Abhors the Prohibited, and He<sup>azwj</sup> is the One Who Made this situation between you and what you intended from the Prohibited’. The king said to him<sup>as</sup>, ‘So supplicate to your<sup>as</sup> God that He<sup>azwj</sup> should Return my hand back to me. If He<sup>azwj</sup> Answers you<sup>as</sup>, I will never present (myself) to her’. Ibrahim<sup>as</sup> said: ‘My<sup>as</sup> God! Return his hand back to him, so that he would refrain from my<sup>as</sup> sanctity (Hurmat i.e. wife)’. So Allah<sup>azwj</sup> Mighty and Majestic Returned his hand back to him. ",
            "The king came near to her and looked at her, then extended his hand around her. So Ibrahim<sup>as</sup> turned his<sup>as</sup> face away from it due to his<sup>as</sup> honour (Ghairat) from it, and said; ‘Our Allah<sup>azwj</sup>! Withhold his hand from her! So his hand withered and could not arrive to her. So the king said to Ibrahim<sup>as</sup>, ‘Surely your<sup>as</sup> Lord<sup>azwj</sup> is Honourable (Ghayyour) and so are you, so supplicate to your God that He<sup>azwj</sup> should return my hand back to me, for it is an action that I shall not repeat. Ibrahim<sup>as</sup> said to him: ‘I<sup>as</sup> will ask Him<sup>azwj</sup> upon the condition that you will not ask me<sup>as</sup> again to supplicate to Him<sup>azwj</sup>’. The king said, ‘Yes’. So Ibrahim<sup>as</sup> said: ‘Our Allah<sup>azwj</sup>! If he is truthful, Return his hand! His hand returned back to him. ",
            "So when the king saw that from the honour which he had never seen before, and saw the Sign in (the return of) his hand, he magnified Ibrahim<sup>as</sup>, and endowed him<sup>as</sup> (with gifts), and honoured him<sup>as</sup>, and let him<sup>as</sup> leave and said to him<sup>as</sup>, ‘I grant you<sup>as</sup> safety from displaying her, or for anything else which is with you<sup>as</sup>. So go to wherever you like, but I have a need from you<sup>as</sup>’. Ibrahim<sup>as</sup> said: ‘What is it?’ He said to him<sup>as</sup>, ‘I would love it if you<sup>as</sup> would permit me that I should give her an attendant who is a Coptic woman who has beauty and intellect, who will serve her’. So Ibrahim<sup>as</sup> gave him permission for that. So he called for her, and gifted her to Sara, and she is Hajar, mother of Ismail<sup>as</sup>.",
            "Ibrahim<sup>as</sup> travelled with all of what was with him<sup>as</sup>, and the king came out with him, walking behind Ibrahim<sup>as</sup>, in respect of Ibrahim<sup>as</sup> and for his<sup>as</sup> prestige. So Allah<sup>azwj</sup> Blessed and High Revealed to Ibrahim<sup>as</sup>: “Pause, and do not walk in front of the domineering tyrant and he walks behind you<sup>as</sup>, but make him to be in front of you<sup>as</sup> and walk, and show him respect, and prestige, for he is domineering, and it is necessary for there to be authorities in the earth, be they righteous or immoral”. So Ibrahim<sup>as</sup> paused and said to the king: ‘Wait, for my<sup>as</sup> God has revealed unto me<sup>as</sup> at this very moment that I<sup>as</sup> should show you respect, and honour you, and make you to walk in front of me<sup>as</sup>, and I<sup>as</sup> should walk behind you, due to your majesty’. So the king said to him<sup>as</sup>, ‘This has been Revealed unto you<sup>as</sup>?’ Ibrahim<sup>as</sup> said to him: ‘Yes’. So the king said to him<sup>as</sup>, ‘I testify that surely your<sup>as</sup> God is Friendly, Lenient, generous, and that you are making me incline towards your<sup>as</sup> Religion’. And the king bade farewell to them.",
            "So Ibrahim<sup>as</sup> journeyed until he<sup>as</sup> encamped at the high place of Syria, and left behind Lut<sup>as</sup> in the lower valleys of Syria. Then, when the birth of a son was delayed, Ibrahim<sup>as</sup> said to Sara: ‘If you want, you can sell Hajar to me<sup>as</sup>, perhaps Allah<sup>azwj</sup> would Grant us the sustenance of a son from it, who would become a successor for us’. So Ibrahim<sup>as</sup> bought Hajar from Sara. He<sup>as</sup> went to her, and she gave birth to Ismail<sup>as</sup>’."
          ],
          "en.sarwar": [
            "561. Ali Bin Ibrahim, from his father, from Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Husayn Bin Saeed, together from Ibn Abu Umeyr, from Husayn Bin Ahmad Al-Munqary, from Yunus Bin Zabyaan who said: ‘I said to Abu Abdullah (a.s.), Why do you (a.s.) not forbid these two men from (criticising) this man?’ So he (a.s.) said: ‘Who is this man, and who are these two men?’ I said, ‘Why do you (a.s.) not forbid Hujr Bin Zaida, and Aamir Bin Juza’at, from (criticising) Al-Mufazzal Bin Umar?’ So he (a.s.) said: ‘O Yunus! I (a.s.) had asked these two to refrain from it, but they did not do it. So I called the two of them over, and asked both of them, and wrote to both of them telling them what I (a.s.) needed from both of them, but they still did not restrain themselves from it. So, may Allah (azwj) not Forgive them both, for by Allah (azwj), there are many honourable ones in his cordiality than these two regarding what they are impersonating from my (a.s.) cordiality. Where he has said, ‘Why does she think by the absence that I do not love her?’, then the two of them have not honoured me (a.s.), but by Allah (azwj), had they both loved me (a.s.), they would have loved the one whom I (a.s.) love’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 560)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15246,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:11",
        "text": [
          "15008- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حُسَيْنِ بْنِ أَحْمَدَ الْمِنْقَرِيِّ عَنْ يُونُسَ بْنِ ظَبْيَانَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ (عليه السلام) أَ لَا تَنْهَى هَذَيْنِ الرَّجُلَيْنِ عَنْ هَذَا الرَّجُلِ فَقَالَ مَنْ هَذَا الرَّجُلِ وَ مَنْ هَذَيْنِ الرَّجُلَيْنِ قُلْتُ أَ لَا تَنْهَى حُجْرَ بْنَ زَائِدَةَ وَ عَامِرَ بْنَ جُذَاعَةَ عَنِ الْمُفَضَّلِ بْنِ عُمَرَ فَقَالَ يَا يُونُسُ قَدْ سَأَلْتُهُمَا أَنْ يَكُفَّا عَنْهُ فَلَمْ يَفْعَلَا فَدَعَوْتُهُمَا وَ سَأَلْتُهُمَا وَ كَتَبْتُ إِلَيْهِمَا وَ جَعَلْتُهُ حَاجَتِي إِلَيْهِمَا فَلَمْ يَكُفَّا عَنْهُ فَلَا غَفَرَ اللَّهُ لَهُمَا فَوَ اللَّهِ لَكُثَيِّرُ عَزَّةَ أَصْدَقُ فِي مَوَدَّتِهِ مِنْهُمَا فِيمَا يَنْتَحِلَانِ مِنْ مَوَدَّتِي حَيْثُ يَقُولُ :  أَ لَا زَعَمَتْ بِالْغَيْبِ أَلَّا أُحِبَّهَا إِذَا أَنَا لَمْ يُكْرَمْ عَلَيَّ كَرِيمُهَا أَمَا وَ اللَّهِ لَوْ أَحَبَّانِي لَأَحَبَّا مَنْ أُحِبُّ"
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473696\">H 15008</a> – Ali Bin Ibrahim, from his father, from Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Husayn Bin Saeed, together from Ibn Abu Umeyr, from Husayn Bin Ahmad Al-Munqary, from Yunus Bin Zabyaan who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> said to Abu Abdullah</span><sup>asws</sup>, Why do you<sup>asws</sup> not forbid these two men from (criticising) this man?’ So he<sup>asws</sup> said: ‘Who is this man, and who are these two men?’ I said, ‘Why do you<sup>asws</sup> not forbid Hujr Bin Zaida, and Aamir Bin Juza’at, from (criticising) Al-Mufazzal Bin Umar?’ So he<sup>asws</sup> said: ‘O Yunus! I<sup>asws</sup> had asked these two to refrain from it, but they did not do it. So I called the two of them over, and asked both of them, and wrote to both of them telling them what I<sup>asws</sup> needed from both of them, but they still did not restrain themselves from it. So, may Allah<sup>azwj</sup> not Forgive them both, for by Allah<sup>azwj</sup>, there are many honourable ones in his cordiality than these two regarding what they are impersonating from my<sup>asws</sup> cordiality. Where he has said, ‘Why does she think by the absence that I do not love her?’, then the two of them have not honoured me<sup>asws</sup>, but by Allah<sup>azwj</sup>, had they both loved me<sup>asws</sup>, they would have loved the one whom I<sup>asws</sup> love’."
          ],
          "en.sarwar": [
            "562. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Nu’man, from Al-Qasim the associate of Al-Mufazzal, and he was a truthful man, who said: ‘I heard Abu Abdullah (a.s.) saying: ‘There is a group in the Masjid who publicise us (a.s.) and publicise themselves. They are neither from us (a.s.) nor are we (a.s.) from them. I (a.s.) rush away and hide, but they still uncover my (a.s.) veil. May Allah (azwj) violate their veil. They are saying that I (a.s.) am the Imam (a.s.), but, by Allah (azwj), I (a.s.) am not an Imam (a.s.) except for the one who obeys me (a.s.). So as for the one who disobeys me (a.s.), I (a.s.) am not an Imam (a.s.) for him. Why are they attaching themselves to my (a.s.) name, and not refraining from mentioning my (a.s.) name from their mouths? By Allah (azwj), may He (azwj) not Gather me (a.s.) and them in one abode’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 561)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 407)"
        ],
        "index": 15247,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:12",
        "text": [
          "15009- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنِ الْقَاسِمِ شَرِيكِ الْمُفَضَّلِ وَ كَانَ رَجُلَ صِدْقٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ حَلَقٌ فِي الْمَسْجِدِ يَشْهَرُونَّا وَ يَشْهَرُونَ أَنْفُسَهُمْ أُولَئِكَ لَيْسُوا مِنَّا وَ لَا نَحْنُ مِنْهُمْ أَنْطَلِقُ فَأُوَارِي وَ أَسْتُرُ فَيَهْتِكُونَ سِتْرِي هَتَكَ اللَّهُ سُتُورَهُمْ يَقُولُونَ إِمَامٌ أَمَا وَ اللَّهِ مَا أَنَا بِإِمَامٍ إِلَّا لِمَنْ أَطَاعَنِي فَأَمَّا مَنْ عَصَانِي فَلَسْتُ لَهُ بِإِمَامٍ لِمَ يَتَعَلَّقُونَ بِاسْمِي أَ لَا يَكُفُّونَ اسْمِي مِنْ أَفْوَاهِهِمْ فَوَ اللَّهِ لَا يَجْمَعُنِي اللَّهُ وَ إِيَّاهُمْ فِي دَارٍ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473697\">H 15009</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Nu’man, from Al-Qasim the associate of Al-Mufazzal, and he was a truthful man, who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘There is a group in the Masjid who publicise us<sup>asws</sup> and publicise themselves. They are neither from us<sup>asws</sup> nor are we<sup>asws</sup> from them. I<sup>asws</sup> rush away and hide, but they still uncover my<sup>asws</sup> veil. May Allah<sup>azwj</sup> violate their veil. They are saying that I<sup>asws</sup> am the Imam<sup>asws</sup>, but, by Allah<sup>azwj</sup>, I<sup>asws</sup> am not an Imam<sup>asws</sup> except for the one who obeys me<sup>asws</sup>. So as for the one who disobeys me<sup>asws</sup>, I<sup>asws</sup> am not an Imam<sup>asws</sup> for him. Why are they attaching themselves to my<sup>asws</sup> name, and not refraining from mentioning my<sup>asws</sup> name from their mouths? By Allah<sup>azwj</sup>, may He<sup>azwj</sup> not Gather me<sup>asws</sup> and them in one abode’. "
          ],
          "en.sarwar": [
            "563. Muhammad Bin Yahya, from Muhammad Bin Al-Husayn, from Safwan, from Dareyh, who has narrated the following: Abu Abdullah (a.s.) has said; ‘When the Qureysh went out to Badr, and the sons of Abdul Muttalib (as) went out with them, Talib (as) Bin Abu Talib (as) went out. So their poetic slogan shouters descended and they were shouting their poetic slogans, and Talib Bin Abu Talib (as) descended and shouted a poetic slogan saying, ‘O Lord (azwj)! But they are invading (militarily) with Talib, in a group from these groups, so Make him to be in a group which gets overcome and flees, which gets crucified without a crucifier, and Make him to be overcome without him overcoming’. So the Qureysh said, ‘This one will make us to be defeated, so send him back’. (And in another report from Abu Abdullah (a.s.) is that he was a Muslim (by then)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 563)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 408)"
        ],
        "index": 15248,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:13",
        "text": [
          "15010- مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ عَنْ ذَرِيحٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ لَمَّا خَرَجَتْ قُرَيْشٌ إِلَى بَدْرٍ وَ أَخْرَجُوا بَنِي عَبْدِ الْمُطَّلِبِ مَعَهُمْ خَرَجَ طَالِبُ بْنُ أَبِي طَالِبٍ فَنَزَلَ رُجَّازُهُمْ وَ هُمْ يَرْتَجِزُونَ وَ نَزَلَ طَالِبُ بْنُ أَبِي طَالِبٍ يَرْتَجِزُ وَ يَقُولُ : يَا رَبِّ إِمَّا يَغْزُوُنَّ بِطَالِبٍ * فِي مِقْنَبٍ مِنْ هَذِهِ الْمَقَانِبِ‏ * فِي مِقْنَبِ الْمُغَالِبِ الْمُحَارِبِ * بِجَعْلِهِ الْمَسْلُوبَ غَيْرَ السَّالِبِ * ‏وَ جَعْلِهِ الْمَغْلُوبَ غَيْرَ الْغَالِبِ فَقَالَ قُرَيْشٌ إِنَّ هَذَا لَيَغْلِبُنَا فَرَدُّوهُ وَ فِي رِوَايَةٍ أُخْرَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ كَانَ أَسْلَمَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473698\">H 15010</a> – Muhammad Bin Yahya, from Muhammad Bin Al-Husayn, from Safwan, from Dareyh, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said; ‘When the Qureysh went out to Badr, and the sons of Abdul Muttalib<sup>as</sup> went out with them, Talib<sup>as</sup> Bin Abu Talib<sup>as</sup> went out. So their poetic slogan shouters descended and they were shouting their poetic slogans, and Talib Bin Abu Talib<sup>as</sup> descended and shouted a poetic slogan saying, ‘O Lord<sup>azwj</sup>! But they are invading (militarily) with Talib, in a group from these groups, so Make him to be in a group which gets overcome and flees, which gets crucified without a crucifier, and Make him to be overcome without him overcoming’. So the Qureysh said, ‘This one will make us to be defeated, so send him back’. (And in another report from Abu Abdullah<sup>asws</sup> is that he was a Muslim (by then)’. "
          ],
          "en.sarwar": [
            "564. Humeyd Bin Ziyad, from Al-Hassan Bin Muhammad Al-Kindy, from Ahmad Bin Al-Hassan Al-Maysami, from Aban Bin Usman, from Muhammad Bin Al-Mufazzal who said: ‘I heard Abu Abdullah (a.s.) saying: ‘Fatima (a.s.) went to a pillar in the Masjid, and she (a.s.) was addressing the Holy Prophet (saww): ‘Events have occurred after you (saww), and differences. Had you (as) witnessed them, they would not have increased so much. We (a.s.) have missed you (as) like the missing of the earth of its downpour of rain. And your (saww) people are in disturbance, so witness them and do not be absent’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 563)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3 / 408)"
        ],
        "index": 15249,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:14",
        "text": [
          "15011- حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الْكِنْدِيِّ عَنْ أَحْمَدَ بْنِ الْحَسَنِ الْمِيثَمِيِّ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ الْمُفَضَّلِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ جَاءَتْ فَاطِمَةُ (عليها السلام) إِلَى سَارِيَةٍ فِي الْمَسْجِدِ وَ هِيَ تَقُولُ وَ تُخَاطِبُ النَّبِيَّ (صلى الله عليه وآله) قَدْ كَانَ بَعْدَكَ أَنْبَاءٌ وَ هَنْبَثَةٌ لَوْ كُنْتَ شَاهِدَهَا لَمْ يَكْثُرِ الْخَطْبُ إِنَّا فَقَدْنَاكَ فَقْدَ الْأَرْضِ وَابِلَهَا وَ اخْتَلَّ قَوْمُكَ فَاشْهَدْهُمْ وَ لَا تَغِبُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473699\">H 15011</a> – Humeyd Bin Ziyad, from Al-Hassan Bin Muhammad Al-Kindy, from Ahmad Bin Al-Hassan Al-Maysami, from Aban Bin Usman, from Muhammad Bin Al-Mufazzal who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘Fatima<sup>asws</sup> went to a pillar in the Masjid, and she<sup>asws</sup> was addressing the Holy Prophet<sup>saww</sup>: ‘Events have occurred after you<sup>saww</sup>, and differences. Had you<sup>as</sup> witnessed them, they would not have increased so much. We<sup>asws</sup> have missed you<sup>as</sup> like the missing of the earth of its downpour of rain. And your<sup>saww</sup> people are in disturbance, so witness them and do not be absent’."
          ],
          "en.sarwar": [
            "565. Aban, from Abu Baseer, who said the following: Abu Abdullah (a.s.) has said: ‘Once the Rasool Allah (saww) was in the Masjid, when every high thing was lowered for him (saww) and every low thing was raised for him (saww), to the extent that he (saww) saw Ja’far (as) fighting the infidels. He (as) got killed. So the Messenger (saww) said: ‘Ja’far has been killed’, and a severe pain struck him (as) in his (saww) stomach’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 563)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15250,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:15",
        "text": [
          "15012- أَبَانٌ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ بَيْنَا رَسُولُ اللَّهِ (صلى الله عليه وآله) فِي الْمَسْجِدِ إِذْ خُفِضَ لَهُ كُلُّ رَفِيعٍ وَ رُفِعَ لَهُ كُلُّ خَفِيضٍ حَتَّى نَظَرَ إِلَى جَعْفَرٍ (عليه السلام) يُقَاتِلُ الْكُفَّارَ قَالَ فَقُتِلَ فَقَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) قُتِلَ جَعْفَرٌ وَ أَخَذَهُ الْمَغْصُ فِي بَطْنِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473700\">H 15012</a> – Aban, from Abu Baseer, who said the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘Once the Rasool Allah<sup>saww</sup> was in the Masjid, when every high thing was lowered for him<sup>saww</sup> and every low thing was raised for him<sup>saww</sup>, to the extent that he<sup>saww</sup> saw Ja’far<sup>as</sup> fighting the infidels. He<sup>as</sup> got killed. So the Messenger<sup>saww</sup> said: ‘Ja’far has been killed’, and a severe pain struck him<sup>as</sup> in his<sup>saww</sup> stomach’."
          ],
          "en.sarwar": [
            "566. Humeyd Bin Ziyad, from Ubeydullah Bin Ahmad Al-Dahqaan, from Ali Bin Al-Hassan Al-Tatary, from Muhammad Bin Ziyad Al-Sabiry, from Ajlaan Abu Salih who said: ‘I heard Abu Abdullah (a.s.) saying: ‘Ali (a.s.) Bin Abu Talib (as) killed forty by his (a.s.) hands on the Day of Hunain’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 564)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15251,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:16",
        "text": [
          "15013- حُمَيْدُ بْنُ زِيَادٍ عَنْ عُبَيْدِ اللَّهِ بْنِ أَحْمَدَ الدِّهْقَانِ عَنْ عَلِيِّ بْنِ الْحَسَنِ الطَّاطَرِيِّ عَنْ مُحَمَّدِ بْنِ زِيَادٍ بَيَّاعِ السَّابِرِيِّ عَنْ عَجْلَانَ أَبِي صَالِحٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ قَتَلَ عَلِيُّ بْنُ أَبِي طَالِبٍ (عليه السلام) بِيَدِهِ يَوْمَ حُنَيْنٍ أَرْبَعِينَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473701\">H 15013</a> – Humeyd Bin Ziyad, from Ubeydullah Bin Ahmad Al-Dahqaan, from Ali Bin Al-Hassan Al-Tatary, from Muhammad Bin Ziyad Al-Sabiry, from Ajlaan Abu Salih who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> heard Abu Abdullah</span><sup>asws</sup> saying: ‘Ali<sup>as</sup><sup>ws</sup> Bin Abu Talib<sup>as</sup> killed forty by his<sup>asws</sup> hands on the Day of Hunain’."
          ],
          "en.sarwar": [
            "567. Aban, from Abdullah Bin Ata’I, who has said the following: Abu Ja’far (a.s.) has said: ‘Jibraeel (as) came to the Rasool Allah (saww) with the Buraaq (ride) which was smaller than a mule, and larger than the donkey. It had two vibrating ears, and its eyes were in its hooves, and its steps were as far as its eyes could extend to. And if it ascends a mountain, its forelegs become shorter and its hind legs extend. So if it descends, its forelegs extend and its hind legs shorten. Its mane hung to the right of it, and it had two wings behind it."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 564)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15252,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:17",
        "refs": {
          "Mentions": [
            "/books/quran:9:118"
          ]
        },
        "text": [
          "15014- أَبَانٌ عَنْ عَبْدِ اللَّهِ بْنِ عَطَاءٍ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ أَتَى جَبْرَئِيلُ (عليه السلام) رَسُولَ اللَّهِ (صلى الله عليه وآله) بِالْبُرَاقِ أَصْغَرَ مِنَ الْبَغْلِ وَ أَكْبَرَ مِنَ الْحِمَارِ مُضْطَرِبَ الْأُذُنَيْنِ عَيْنَيْهِ فِي حَافِرِهِ وَ خُطَاهُ مَدَّ بَصَرِهِ وَ إِذَا انْتَهَى إِلَى جَبَلٍ قَصُرَتْ يَدَاهُ وَ طَالَتْ رِجْلَاهُ فَإِذَا هَبَطَ طَالَتْ يَدَاهُ وَ قَصُرَتْ رِجْلَاهُ أَهْدَبَ الْعُرْفِ الْأَيْمَنِ لَهُ جَنَاحَانِ مِنْ خَلْفِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473702\">H 15014</a> – Aban, from Abdullah Bin Ata’I, who has said the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> has said: ‘Jibraeel<sup>as</sup> came to the Rasool Allah<sup>saww</sup> with the <span class=\"iTxt\">Buraaq</span> (ride) which was smaller than a mule, and larger than the donkey. It had two vibrating ears, and its eyes were in its hooves, and its steps were as far as its eyes could extend to. And if it ascends a mountain, its forelegs become shorter and its hind legs extend. So if it descends, its forelegs extend and its hind legs shorten. Its mane hung to the right of it, and it had two wings behind it. "
          ],
          "en.sarwar": [
            "568. Ali Bin Ibrahim, from Salih Bin Al-Sanady, from Ja’far Bin Basheer, rom Fayz Bin Al-Mukhtar, who has narrated the following: ‘I said to Abu Abdullah (a.s.), ‘How do you (a.s.) read “<a href=\"/#/books/quran:9#h118\">[9:118]</a> And to the three who were left behind”. He (a.s.) said; ‘Had they been left behind (Khulifu), they would be in a state of obedience. But, they opposed (Khaalafu) – Usman and his two companions (Abu Bakr and Umar). But, by Allah (azwj), they did not hear the sound of hooves, or the rumble of the pebbles except that they said, ‘They are coming for us!’ Allah (azwj) Made fear to overcome them until the morning’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على الشهور</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 565)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15253,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:18",
        "refs": {
          "Mentions": [
            "/books/quran:9:118",
            "/books/quran:9:112"
          ]
        },
        "text": [
          "15015- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنْ فَيْضِ بْنِ الْمُخْتَارِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) كَيْفَ تَقْرَأُ وَ عَلَى الثَّلاثَةِ الَّذِينَ خُلِّفُوا قَالَ لَوْ كَانَ خُلِّفُوا لَكَانُوا فِي حَالِ طَاعَةٍ وَ لَكِنَّهُمْ خَالَفُوا عُثْمَانُ وَ صَاحِبَاهُ أَمَا وَ اللَّهِ مَا سَمِعُوا صَوْتَ حَافِرٍ وَ لَا قَعْقَعَةَ حَجَرٍ إِلَّا قَالُوا أُتِينَا فَسَلَّطَ اللَّهُ عَلَيْهِمُ الْخَوْفَ حَتَّى أَصْبَحُوا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473703\">H 15015</a> – Ali Bin Ibrahim, from Salih Bin Al-Sanady, from Ja’far Bin Basheer, rom Fayz Bin Al-Mukhtar, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> said to Abu Abdullah</span><sup>asws</sup>, ‘How do you<sup>asws</sup> read <span class=\"ibTxt\">“<a href=\"/#/books/quran:9#h118\">[9:118]</a> And to the three who were left behind”</span>. He<sup>asws</sup> said; ‘Had they been left behind (Khulifu), they would be in a state of obedience. But, they opposed (Khaalafu) – Usman and his two companions (Abu Bakr and Umar). But, by Allah<sup>azwj</sup>, they did not hear the sound of hooves, or the rumble of the pebbles except that they said, ‘They are coming for us!’ Allah<sup>azwj</sup> Made fear to overcome them until the morning’."
          ],
          "en.sarwar": [
            "569. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al-Hakam, from Ali Bin Abu Hamza, from Abu Baseer, who has said: Abu Ja’far (a.s.) said: ‘Are you (a.s.) reciting: “<a href=\"/#/books/quran:9#h112\">[9:112]</a> They who repent (Al-Ta’iboun), who serve (Al-Abidoun)”?’ So he (a.s.) said: ‘No. Recite “Al-Ta’ibeen Al-Abideen” upto the end of it’. So I asked about the reason for that, he (a.s.) said: ‘He (azwj) Bought from the Believers (their own selves), the repentant (and) the worshippers’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 566)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15254,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:19",
        "refs": {
          "Mentions": [
            "/books/quran:9:112",
            "/books/quran:9:128"
          ]
        },
        "text": [
          "15016- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ تَلَوْتُ التَّائِبُونَ الْعابِدُونَ فَقَالَ لَا اقْرَأِ التَّائِبِينَ الْعَابِدِينَ إِلَى آخِرِهَا فَسُئِلَ عَنِ الْعِلَّةِ فِي ذَلِكَ فَقَالَ اشْتَرَى مِنَ الْمُؤْمِنِينَ التَّائِبِينَ الْعَابِدِينَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473704\">H 15016</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al-Hakam, from Ali Bin Abu Hamza, from Abu Baseer, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> said: ‘Are you<sup>asws</sup> reciting: <span class=\"ibTxt\">“<a href=\"/#/books/quran:9#h112\">[9:112]</a> They who repent (Al-Ta’iboun), who serve (Al-Abidoun)”</span>?’ So he<sup>asws</sup> said: ‘No. Recite “<span class=\"iTxt\">Al-Ta’ibeen Al-Abideen</span>” upto the end of it’. So I asked about the reason for that, he<sup>asws</sup> said: ‘He<sup>azwj</sup> Bought from the Believers (their own selves), the repentant (and) the worshippers’. "
          ],
          "en.sarwar": [
            "570. A number of our companions, from Sahl Bin Ziyad, from Yahya Bin Al-Mubarak, from Abdullah Bin Jabalat, from Is’haq Bin Ammar, who has said: Abu Abdullah (a.s.) has said: ‘This is how Allah (azwj), Blessed and High Revealed it: “<a href=\"/#/books/quran:9#h128\">[9:128]</a> Certainly a Messenger has come to us from among ourselves; grievous to him is our falling into distress, full of concern for us; to the believers (he is) compassionate”. (Imam (a.s.) indicating the Tahreef in the Holy Quran)"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 566)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15255,
        "local_index": 20,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:20",
        "refs": {
          "Mentions": [
            "/books/quran:9:128",
            "/books/quran:9:40"
          ]
        },
        "text": [
          "15017- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ يَحْيَى بْنِ الْمُبَارَكِ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ هَكَذَا أَنْزَلَ اللَّهُ تَبَارَكَ وَ تَعَالَى لَقَدْ جَاءَنَا رَسُولٌ مِنْ أَنْفُسِنَا عَزِيزٌ عَلَيْهِ مَا عَنِتْنَا حَرِيصٌ عَلَيْنَا بِالْمُؤْمِنِينَ رَءُوفٌ رَحِيمٌ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473705\">H 15017</a> – A number of our companions, from Sahl Bin Ziyad, from Yahya Bin Al-Mubarak, from Abdullah Bin Jabalat, from Is’haq Bin Ammar, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>as</sup><sup>ws</sup> has said: ‘This is how Allah<sup>azwj</sup>, Blessed and High Revealed it: <span class=\"ibTxt\">“<a href=\"/#/books/quran:9#h128\">[9:128]</a></span><a id=\"_ftnref34\"></a><span class=\"ibTxt\"><sup>[34]</sup></span><span class=\"ibTxt\"> Certainly a Messenger has come to us from among ourselves; grievous to him is our falling into distress, full of concern for us; to the believers (he is) compassionate”</span>. (Imam<sup>asws</sup> indicating the Tahreef in the Holy Quran) "
          ],
          "en.sarwar": [
            "571. Muhammad, from Ahmad, from Ibn Fazzaal, who has said: Al-Ridha (a.s.) regarding: “<a href=\"/#/books/quran:9#h40\">[9:40]</a> So Allah sent down His tranquillity upon him and strengthened him with hosts which you did not see”. I said, ‘Like this?’ He (a.s.) said: ‘This is how we (a.s.) recite it, and this is how it was Revealed’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 567)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15256,
        "local_index": 21,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:21",
        "refs": {
          "Mentions": [
            "/books/quran:11:12",
            "/books/quran:9:40"
          ]
        },
        "text": [
          "15018- مُحَمَّدٌ عَنْ أَحْمَدَ عَنِ ابْنِ فَضَّالٍ عَنِ الرِّضَا (عليه السلام) فَأَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَى رَسُولِهِ وَ أَيَّدَهُ بِجُنُودٍ لَمْ تَرَوْهَا قُلْتُ هَكَذَا قَالَ هَكَذَا نَقْرَؤُهَا وَ هَكَذَا تَنْزِيلُهَا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473706\">H 15018</a> – Muhammad, from Ahmad, from Ibn Fazzaal, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>l-Reza</span><sup>asws</sup> regarding: <span class=\"ibTxt\">“<a href=\"/#/books/quran:9#h40\">[9:40]</a> So Allah sent down His tranquillity upon him and strengthened him with hosts which you did not see”</span>. I said, ‘Like this?’ He<sup>asws</sup> said: ‘This is how we<sup>asws</sup> recite it, and this is how it was Revealed’."
          ],
          "en.sarwar": [
            "572. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Khalid and Al-Husayn Bin Saeed, from Al-Nazar Bin Suweyd, from Yahya Al-Halby, from Ibn Muskaan, from Ammar Bin Suweyd who said: ‘I heard Abu Abdullah (a.s.) saying regarding this Verse: “<a href=\"/#/books/quran:11#h12\">[11:12]</a> Then, it may be that you will give up part of what is revealed to you and your breast will become straitened by it because they say: Why has not a treasure been sent down upon him or an angel come with him?”, When the Rasool Allah (saww) encamped at Qudeyd and said to Ali (a.s.): ‘O Ali (a.s.)! I (saww) asked my (saww) Lord (azwj) to Establish friendship between me (a.s.) and you (a.s.), so He (azwj) Did it. And I (saww) asked my (saww) Lord (azwj) to Establish brotherhood between me (saww) and you (a.s.), so he (azwj) Did it. And I (saww) asked my (saww) Lord (azwj) to Make you (a.s.) to be my (saww) successor, so He (azwj) Did it. Two men (Abu Bakr and Umar) from Qureysh said, ‘By Allah (azwj)! A Sa’a (unit of measurement) of dates in a basket is more beloved to us than what Muhammad (saww) asked his (saww) Lord (azwj) for. So, had he (saww) asked his (saww) Lord (azwj) for an Angel to support him (saww) against his (saww) enemies, or a treasure to make us to be needless by it from the hunger. By Allah (azwj)! He (saww) does not supplicate to Him (azwj), be it true or false, but that He (azwj) Answers him (saww)’. So Allah (azwj), Glorious and High Revealed: “<a href=\"/#/books/quran:11#h12\">[11:12]</a> Then, it may be that you will give up part of what is revealed to you and your breast will become straitened by it” – up to the end of the Verse’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 568)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15257,
        "local_index": 22,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:22",
        "refs": {
          "Mentions": [
            "/books/quran:11:119",
            "/books/quran:11:12",
            "/books/quran:11:118"
          ]
        },
        "text": [
          "15019- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ وَ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنِ ابْنِ مُسْكَانَ عَنْ عَمَّارِ بْنِ سُوَيْدٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ فِي هَذِهِ الْآيَةِ فَلَعَلَّكَ تارِكٌ بَعْضَ ما يُوحى إِلَيْكَ وَ ضائِقٌ بِهِ صَدْرُكَ أَنْ يَقُولُوا لَوْ لا أُنْزِلَ عَلَيْهِ كَنْزٌ أَوْ جاءَ مَعَهُ مَلَكٌ فَقَالَ إِنَّ رَسُولَ اللَّهِ (صلى الله عليه وآله) لَمَّا نَزَلَ قُدَيْدَ قَالَ لِعَلِيٍّ (عليه السلام) يَا عَلِيُّ إِنِّي سَأَلْتُ رَبِّي أَنْ يُوَالِيَ بَيْنِي وَ بَيْنَكَ فَفَعَلَ وَ سَأَلْتُ رَبِّي أَنْ يُوَاخِيَ بَيْنِي وَ بَيْنَكَ فَفَعَلَ وَ سَأَلْتُ رَبِّي أَنْ يَجْعَلَكَ وَصِيِّي فَفَعَلَ ",
          "فَقَالَ رَجُلَانِ مِنْ قُرَيْشٍ وَ اللَّهِ لَصَاعٌ مِنْ تَمْرٍ فِي شَنٍّ بَالٍ أَحَبُّ إِلَيْنَا مِمَّا سَأَلَ مُحَمَّدٌ رَبَّهُ فَهَلَّا سَأَلَ رَبَّهُ مَلَكاً يَعْضُدُهُ عَلَى عَدُوِّهِ أَوْ كَنْزاً يَسْتَغْنِي بِهِ عَنْ فَاقَتِهِ وَ اللَّهِ مَا دَعَاهُ إِلَى حَقٍّ وَ لَا بَاطِلٍ إِلَّا أَجَابَهُ إِلَيْهِ فَأَنْزَلَ اللَّهُ سُبْحَانَهُ وَ تَعَالَى فَلَعَلَّكَ تارِكٌ بَعْضَ ما يُوحى إِلَيْكَ وَ ضائِقٌ بِهِ صَدْرُكَ إِلَى آخِرِ الْآيَةِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473707\">H 15019</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Khalid and Al-Husayn Bin Saeed, from Al-Nazar Bin Suweyd, from Yahya Al-Halby, from Ibn Muskaan, from Ammar Bin Suweyd who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> heard Abu Abdullah</span><sup>asws</sup> saying regarding this Verse: <span class=\"ibTxt\">“<a href=\"/#/books/quran:11#h12\">[11:12]</a> Then, it may be that you will give up part of what is revealed to you and your breast will become straitened by it because they say: Why has not a treasure been sent down upon him or an angel come with him?”</span>, When the Rasool Allah<sup>saww</sup> encamped at Qudeyd and said to Ali<sup>asws</sup>: ‘O Ali<sup>asws</sup>! I<sup>saww</sup> asked my<sup>saww</sup> Lord<sup>azwj</sup> to Establish friendship between me<sup>asws</sup> and you<sup>asws</sup>, so He<sup>azwj</sup> Did it. And I<sup>saww</sup> asked my<sup>saww</sup> Lord<sup>azwj</sup> to Establish brotherhood between me<sup>saww</sup> and you<sup>asws</sup>, so he<sup>azwj</sup> Did it. And I<sup>saww</sup> asked my<sup>saww</sup> Lord<sup>azwj</sup> to Make you<sup>asws</sup> to be my<sup>saww</sup> successor, so He<sup>azwj</sup> Did it.  ",
            "Two men (Abu Bakr and Umar) from Qureysh said, ‘By Allah<sup>azwj</sup>! A Sa’a (unit of measurement) of dates in a basket is more beloved to us than what Muhammad<sup>saww</sup> asked his<sup>saww</sup> Lord<sup>azwj</sup> for. So, had he<sup>saww</sup> asked his<sup>saww</sup> Lord<sup>azwj</sup> for an Angel to support him<sup>saww</sup> against his<sup>saww</sup> enemies, or a treasure to make us to be needless by it from the hunger. By Allah<sup>azwj</sup>! He<sup>saww</sup> does not supplicate to Him<sup>azwj</sup>, be it true or false, but that He<sup>azwj</sup> Answers him<sup>saww</sup>’. So Allah<sup>azwj</sup>, Glorious and High Revealed: <span class=\"ibTxt\">“<a href=\"/#/books/quran:11#h12\">[11:12]</a> Then, it may be that you will give up part of what is revealed to you and your breast will become straitened by it”</span> – up to the end of the Verse’."
          ],
          "en.sarwar": [
            "573. Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdullah Bin Sinan who said: ‘Abu Abdullah (a.s.) was asked about the Statement of Allah (azwj) Mighty and Majestic: “<a href=\"/#/books/quran:11#h118\">[11:118]</a> And if your Lord had pleased He would certainly have made people a single nation, and they shall not cease to differ <a href=\"/#/books/quran:11#h119\">[11:119]</a> Except those on whom your Lord has mercy”, so he (a.s.) said: ‘They were one community, so Allah (azwj) Sent the Prophets (as) to take the Proof against them’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 569)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15258,
        "local_index": 23,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:23",
        "refs": {
          "Mentions": [
            "/books/quran:11:119",
            "/books/quran:24:35",
            "/books/quran:27:89",
            "/books/quran:53:1",
            "/books/quran:3:33",
            "/books/quran:53:3",
            "/books/quran:34:47",
            "/books/quran:6:58",
            "/books/quran:2:17",
            "/books/quran:3:67",
            "/books/quran:7:198",
            "/books/quran:53:4",
            "/books/quran:42:24",
            "/books/quran:36:37",
            "/books/quran:10:5",
            "/books/quran:53:2",
            "/books/quran:42:23",
            "/books/quran:3:34",
            "/books/quran:21:3",
            "/books/quran:38:86",
            "/books/quran:11:118",
            "/books/quran:11:73"
          ]
        },
        "text": [
          "15020- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ سُئِلَ أَبُو عَبْدِ اللَّهِ (عليه السلام) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ لَوْ شاءَ رَبُّكَ لَجَعَلَ النَّاسَ أُمَّةً واحِدَةً وَ لا يَزالُونَ مُخْتَلِفِينَ إِلَّا مَنْ رَحِمَ رَبُّكَ فَقَالَ كَانُوا أُمَّةً وَاحِدَةً فَبَعَثَ اللَّهُ النَّبِيِّينَ لِيَتَّخِذَ عَلَيْهِمُ الْحُجَّةَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473708\">H 15020</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdullah Bin Sinan who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>bu Abdullah</span><sup>asws</sup> was asked about the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:11#h118\">[11:118]</a> And if your Lord had pleased He would certainly have made people a single nation, and they shall not cease to differ <a href=\"/#/books/quran:11#h119\">[11:119]</a> Except those on whom your Lord has mercy”</span>, so he<sup>asws</sup> said: ‘They were one community, so Allah<sup>azwj</sup> Sent the Prophets<sup>as</sup> to take the Proof against them’."
          ],
          "en.sarwar": [
            "574. Ali Bin Muhammad, from Ali Bin Al-Abbas, from Ali Bin Hammad, from Amro Bin Shimr, from Jabir, who has narrated the following: ‘Abu Ja’far (a.s.) regarding the Statement of Allah (azwj) Mighty and Majestic: “<a href=\"/#/books/quran:42#h23\">[42:23]</a> and whoever earns good, We give him more of good therein”, said; ‘The one who befriends (Tawalla) the successors (a.s.) from the Progeny (a.s.) of Muhammad (saww), and follows their (a.s.) footsteps, so that increases for him the Wilayah of the ones from the past from the Prophets (as), and the former Believers until their Wilayah arrives to Adam (as), and it is the Statement of Allah (azwj) “<a href=\"/#/books/quran:27#h89\">[27:89]</a> Whoever brings good, he shall have better than it”, He (azwj) will Enter him into the Paradise, and it is the Statement of Allah (azwj): “<a href=\"/#/books/quran:34#h47\">[34:47]</a> Say: Whatever reward I have asked of you, that is only for yourselves”. He (saww) is saying that the reward is the cordiality which I (saww) never asked for anything other than it, so it is for you to be guided by it, and to be Rescued by it from the Punishment on the Day of Judgement’. And he (saww) said to the enemies of Allah (azwj), the friends of Satan (la), the people of the belying and the denial: “<a href=\"/#/books/quran:38#h86\">[38:86]</a> Say: \"No reward do I ask of you for this, nor am I a pretender”. He (saww) is saying; ‘I (saww) would be a pretender if I (saww) were to ask you what you are not deserving of’. So the hypocrites said to each other, with regards to that, ‘But it did not suffice Muhammad (saww) after having conquered us for twenty years, to the extent that he (saww) now wants to burden us with the People (a.s.) of his (saww) Household upon our necks’. So they said, ‘Allah (azwj) has not Revealed this, nor is it anything except for his (saww) words, intending to raise the People (a.s.) of his (saww) Household upon our necks, and if Muhammad (saww) were to be killed or dies, we would take it (rule) away from the People (a.s.) of his (saww) Household, then we would not let it return to be among them ever’. And Allah (azwj) Wanted to let know His (azwj) Prophet (saww) of that which was hidden in their chests and what they were keeping as a secret. So He (azwj) Said in His (azwj) Book: “<a href=\"/#/books/quran:42#h24\">[42:24]</a> Or do they say: He has forged a lie against Allah? But if Allah pleased, He would seal your heart”. He (azwj) is Saying: “Had I (azwj) so Liked to, I (azwj) would have Stopped the Revelation, so you (saww) would not have been able to speak of the virtues of the People (a.s.) of your (saww) Household, or of their cordiality”. And Allah (azwj) has Said: “<a href=\"/#/books/quran:42#h24\">[42:24]</a> And Allah will wipe out the lie and will vindicate the truth by His words” He (azwj) is Saying that the truth is the Wilayah for the People (a.s.) of the Household “Lo! He is Aware of what is hidden in the breasts”, and is Speaking of what is attached in their chests from the enmity to the People (a.s.) of the Household, and the injustices after you (saww), and it is the Statement of Allah (azwj) Mighty and Majestic: “<a href=\"/#/books/quran:21#h3\">[21:3]</a> and those who are unjust counsel together in secret: He is nothing but a mortal like yourselves; what! will you then yield to enchantment while you see?” And regarding the Statement of the Mighty and Majestic: “<a href=\"/#/books/quran:53#h1\">[53:1]</a> I swear by the star when it goes down He (a.s.) said; ‘(It means) I (azwj) Swear by the passing away of Muhammad (saww) when he (saww) passes away <a href=\"/#/books/quran:53#h2\">[53:2]</a> Your companion does not err, in giving out the virtues of the People (a.s.) of his (saww) Household nor does he go astray; <a href=\"/#/books/quran:53#h3\">[53:3]</a> Nor does he speak out of desire. He (azwj) is Saying that he (saww) does not speak of the virtues of the People (a.s.) of his (saww) Household out of his (saww) own desires, and it is the Statement of Allah (azwj) Mighty and Majestic <a href=\"/#/books/quran:53#h4\">[53:4]</a> It is naught but revelation that is revealed”. And Allah (azwj) Mighty and Majestic Said to Muhammad (saww): “<a href=\"/#/books/quran:6#h58\">[6:58]</a> Say: If that which you desire to hasten were with me, the matter would have certainly been decided between you and me”. He (saww) said: ‘Had I (saww) been Commanded to, I (saww) would have informed you all of what you are hiding in your chests of the hastening of my (saww) passing away, so that you would perpetrate injustices to the People (a.s.) of my (saww) Household from after me (saww). So the example of yours in as Allah (azwj) Mighty and Majestic has Said: “<a href=\"/#/books/quran:2#h17\">[2:17]</a> Their parable is like the parable of one who kindled a fire but when it had illumined all around him”, He (azwj) is Saying; “Illumination of the earth by the light of Muhammad (saww) just like the illumination of the sun”. So Allah (azwj) Cited an example of Muhammad (saww) with the sun, and an example of the successor (a.s.) with the moon, and it is the Statement of the Mighty and Majestic: “<a href=\"/#/books/quran:10#h5\">[10:5]</a> He it is Who made the sun a shining brightness and the moon a light”, and His (azwj) Statement: “<a href=\"/#/books/quran:36#h37\">[36:37]</a> And a sign to them is the night: We draw forth from it the day, then lo! they are in the dark”, and the Statement of the Mighty and Majestic: “<a href=\"/#/books/quran:2#h17\">[2:17]</a> Their parable is like the parable of one who kindled a fire but when it had illumined all around him, Allah took away their light, and left them in utter darkness - they do not see”, meaning, the passing away of Muhammad (saww) and the appearance of the darkness, so they cannot see the virtues of the People (a.s.) of his (saww) Household, and it is the Statement of the Mighty and Majestic: “<a href=\"/#/books/quran:7#h198\">[7:198]</a> And if you invite them to guidance, they do not hear; and you see them looking towards you, yet they do not see”. Then the Rasool Allah (saww) placed the knowledge which was with him (saww) to be with the successor (a.s.), and it is the Statement of Allah (azwj) Mighty and Majestic: “<a href=\"/#/books/quran:24#h35\">[24:35]</a> Allah is the light of the heavens and the earth, He (azwj) is Saying: “I (azwj) am the Guide of the Heavens and the earth, like the Knowledge which I (azwj) Gave out, and it is My (azwj) Light with which I (azwj) Guide by a likeness of His light is as a niche in which is a lamp, so the niche is the heart of Muhammad (saww), and the lamp is the Light in which is the Knowledge. And His (azwj) Statement the lamp is in a glass, He (azwj) is Saying: “I (azwj) Wanted to Make you (saww) pass away, and Make that which is in your presence to be with the successor (a.s.) just as the lamp is made to be in a glass, (and) the glass is as it were a brightly shining star, lit from a blessed tree”. So the origin of the Blessed Tree is Ibrahim (as) and it is the Statement of the Mighty and Majestic: “<a href=\"/#/books/quran:11#h73\">[11:73]</a> The mercy of Allah and His blessings are on you, O people of the house, surely He is Praised, Glorious”. And it is the Statement of Allah (azwj) Mighty and Majestic: “<a href=\"/#/books/quran:3#h33\">[3:33]</a> Surely Allah chose Adam and Nuh and the descendants of Ibrahim and the descendants of Imran above the nations <a href=\"/#/books/quran:3#h34\">[3:34]</a> Offspring one of the other; and Allah is Hearing, Knowing”. “<a href=\"/#/books/quran:24#h35\">[24:35]</a> neither eastern nor western”. He (azwj) is saying: “You are neither Jews so that you Pray in the direction of the west, nor are you Christians, so that you Pray in the direction of the east, but you are the nation of Ibrahim (as)”, and Allah (azwj) Mighty and Majestic has Said: “<a href=\"/#/books/quran:3#h67\">[3:67]</a> Ibrahim was not a Jew nor a Christian but he was (an) upright (man), a Muslim, and he was not one of the polytheists”. And it is the Statement of the Mighty and Majestic: “<a href=\"/#/books/quran:24#h35\">[24:35]</a> the oil whereof almost gives light though fire touch it not - light upon light - Allah guides to His light whom He pleases”, He (azwj) is Saying: “The example of your children whom you give birth to from among you, is like the example of the oil which comes out from the olive, “<a href=\"/#/books/quran:24#h35\">[24:35]</a> the oil whereof almost gives light though fire touch it not - light upon light - Allah guides to His light whom He pleases”. He (azwj) is saying that they almost speak with the Prophet-hood even though an Angel has not descended upon them’."
          ]
        }
      },
      {
        "index": 15259,
        "local_index": 24,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:24",
        "refs": {
          "Mentions": [
            "/books/quran:24:35",
            "/books/quran:53:1",
            "/books/quran:27:89",
            "/books/quran:3:33",
            "/books/quran:53:3",
            "/books/quran:34:47",
            "/books/quran:6:58",
            "/books/quran:2:17",
            "/books/quran:3:67",
            "/books/quran:7:198",
            "/books/quran:41:53",
            "/books/quran:53:4",
            "/books/quran:42:24",
            "/books/quran:36:37",
            "/books/quran:10:5",
            "/books/quran:53:2",
            "/books/quran:42:23",
            "/books/quran:3:34",
            "/books/quran:21:3",
            "/books/quran:38:86",
            "/books/quran:11:73"
          ]
        },
        "text": [
          "15021- عَلِيُّ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْعَبَّاسِ عَنْ عَلِيِّ بْنِ حَمَّادٍ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ يَقْتَرِفْ حَسَنَةً نَزِدْ لَهُ فِيها حُسْناً قَالَ مَنْ تَوَلَّى الْأَوْصِيَاءَ مِنْ آلِ مُحَمَّدٍ وَ اتَّبَعَ آثَارَهُمْ فَذَاكَ يَزِيدُهُ وَلَايَةَ مَنْ مَضَى مِنَ النَّبِيِّينَ وَ الْمُؤْمِنِينَ الْأَوَّلِينَ حَتَّى تَصِلَ وَلَايَتُهُمْ إِلَى آدَمَ (عليه السلام) وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ مَنْ جاءَ بِالْحَسَنَةِ فَلَهُ خَيْرٌ مِنْها يُدْخِلُهُ الْجَنَّةَ وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ قُلْ ما سَأَلْتُكُمْ مِنْ أَجْرٍ فَهُوَ لَكُمْ يَقُولُ أَجْرُ الْمَوَدَّةِ الَّذِي لَمْ أَسْأَلْكُمْ غَيْرَهُ فَهُوَ لَكُمْ تَهْتَدُونَ بِهِ وَ تَنْجُونَ مِنْ عَذَابِ يَوْمِ الْقِيَامَةِ ",
          "وَ قَالَ لِأَعْدَاءِ اللَّهِ أَوْلِيَاءِ الشَّيْطَانِ أَهْلِ التَّكْذِيبِ وَ الْإِنْكَارِ قُلْ ما أَسْئَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ وَ ما أَنَا مِنَ الْمُتَكَلِّفِينَ يَقُولُ مُتَكَلِّفاً أَنْ أَسْأَلَكُمْ مَا لَسْتُمْ بِأَهْلِهِ ",
          "فَقَالَ الْمُنَافِقُونَ عِنْدَ ذَلِكَ بَعْضُهُمْ لِبَعْضٍ أَ مَا يَكْفِي مُحَمَّداً أَنْ يَكُونَ قَهَرَنَا عِشْرِينَ سَنَةً حَتَّى يُرِيدُ أَنْ يُحَمِّلَ أَهْلَ بَيْتِهِ عَلَى رِقَابِنَا فَقَالُوا مَا أَنْزَلَ اللَّهُ هَذَا وَ مَا هُوَ إِلَّا شَيْ‏ءٌ يَتَقَوَّلُهُ يُرِيدُ أَنْ يَرْفَعَ أَهْلَ بَيْتِهِ عَلَى رِقَابِنَا وَ لَئِنْ قُتِلَ مُحَمَّدٌ أَوْ مَاتَ لَنَنْزِعَنَّهَا مِنْ أَهْلِ بَيْتِهِ ثُمَّ لَا نُعِيدُهَا فِيهِمْ أَبَداً",
          "وَ أَرَادَ اللَّهُ عَزَّ وَ جَلَّ أَنْ يُعْلِمَ نَبِيَّهُ ( صلى الله عليه وآله ) الَّذِي أَخْفَوْا فِي صُدُورِهِمْ وَ أَسَرُّوا بِهِ فَقَالَ فِي كِتَابِهِ عَزَّ وَ جَلَّ أَمْ يَقُولُونَ افْتَرى عَلَى اللَّهِ كَذِباً فَإِنْ يَشَإِ اللَّهُ يَخْتِمْ عَلى قَلْبِكَ يَقُولُ لَوْ شِئْتُ حَبَسْتُ عَنْكَ الْوَحْيَ فَلَمْ تَكَلَّمْ بِفَضْلِ أَهْلِ بَيْتِكَ وَ لَا بِمَوَدَّتِهِمْ ",
          "وَ قَدْ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ يَمْحُ اللَّهُ الْباطِلَ وَ يُحِقُّ الْحَقَّ بِكَلِماتِهِ يَقُولُ الْحَقُّ لِأَهْلِ بَيْتِكَ الْوَلَايَةُ إِنَّهُ عَلِيمٌ بِذاتِ الصُّدُورِ وَ يَقُولُ بِمَا أَلْقَوْهُ فِي صُدُورِهِمْ مِنَ الْعَدَاوَةِ لِأَهْلِ بَيْتِكَ وَ الظُّلْمِ بَعْدَكَ وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ أَسَرُّوا النَّجْوَى الَّذِينَ ظَلَمُوا هَلْ هذا إِلَّا بَشَرٌ مِثْلُكُمْ أَ فَتَأْتُونَ السِّحْرَ وَ أَنْتُمْ تُبْصِرُونَ",
          "وَ فِي قَوْلِهِ عَزَّ وَ جَلَّ وَ النَّجْمِ إِذا هَوى قَالَ أُقْسِمُ بِقَبْضِ مُحَمَّدٍ إِذَا قُبِضَ ما ضَلَّ صاحِبُكُمْ بِتَفْضِيلِهِ أَهْلَ بَيْتِهِ وَ ما غَوى وَ ما يَنْطِقُ عَنِ الْهَوى يَقُولُ مَا يَتَكَلَّمُ بِفَضْلِ أَهْلِ بَيْتِهِ بِهَوَاهُ وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ إِنْ هُوَ إِلَّا وَحْيٌ يُوحى ",
          "وَ قَالَ اللَّهُ عَزَّ وَ جَلَّ لِمُحَمَّدٍ (صلى الله عليه وآله) قُلْ لَوْ أَنَّ عِنْدِي ما تَسْتَعْجِلُونَ بِهِ لَقُضِيَ الْأَمْرُ بَيْنِي وَ بَيْنَكُمْ قَالَ لَوْ أَنِّي أُمِرْتُ أَنْ أُعْلِمَكُمُ الَّذِي أَخْفَيْتُمْ فِي صُدُورِكِمْ مِنِ اسْتِعْجَالِكُمْ بِمَوْتِي لِتَظْلِمُوا أَهْلَ بَيْتِي مِنْ بَعْدِي فَكَانَ مَثَلُكُمْ كَمَا قَالَ اللَّهُ عَزَّ وَ جَلَّ كَمَثَلِ الَّذِي اسْتَوْقَدَ ناراً فَلَمَّا أَضاءَتْ ما حَوْلَهُ يَقُولُ أَضَاءَتِ الْأَرْضُ بِنُورِ مُحَمَّدٍ كَمَا تُضِي‏ءُ الشَّمْسُ ",
          "فَضَرَبَ اللَّهُ مَثَلَ مُحَمَّدٍ (صلى الله عليه وآله) الشَّمْسَ وَ مَثَلَ الْوَصِيِّ الْقَمَرَ وَ هُوَ قَوْلُهُ عَزَّ وَ جَلَّ جَعَلَ الشَّمْسَ ضِياءً وَ الْقَمَرَ نُوراً وَ قَوْلُهُ وَ آيَةٌ لَهُمُ اللَّيْلُ نَسْلَخُ مِنْهُ النَّهارَ فَإِذا هُمْ مُظْلِمُونَ وَ قَوْلُهُ عَزَّ وَ جَلَّ ذَهَبَ اللَّهُ بِنُورِهِمْ وَ تَرَكَهُمْ فِي ظُلُماتٍ لا يُبْصِرُونَ يَعْنِي قُبِضَ مُحَمَّدٌ (صلى الله عليه وآله) وَ ظَهَرَتِ الظُّلْمَةُ فَلَمْ يُبْصِرُوا فَضْلَ أَهْلِ بَيْتِهِ وَ هُوَ قَوْلُهُ عَزَّ وَ جَلَّ وَ إِنْ تَدْعُوهُمْ إِلَى الْهُدى لا يَسْمَعُوا وَ تَراهُمْ يَنْظُرُونَ إِلَيْكَ وَ هُمْ لا يُبْصِرُونَ ",
          "ثُمَّ إِنَّ رَسُولَ اللَّهِ (صلى الله عليه وآله) وَضَعَ الْعِلْمَ الَّذِي كَانَ عِنْدَهُ عِنْدَ الْوَصِيِّ وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ اللَّهُ نُورُ السَّماواتِ وَ الْأَرْضِ يَقُولُ أَنَا هَادِي السَّمَاوَاتِ وَ الْأَرْضِ مَثَلُ الْعِلْمِ الَّذِي أَعْطَيْتُهُ وَ هُوَ نُورِيَ الَّذِي يُهْتَدَى بِهِ مَثَلُ الْمِشْكَاةِ فِيهَا الْمِصْبَاحُ فَالْمِشْكَاةُ قَلْبُ مُحَمَّدٍ (صلى الله عليه وآله) وَالْمِصْبَاحُ النُّورُ الَّذِي فِيهِ الْعِلْمُ",
          "وَ قَوْلُهُ الْمِصْباحُ فِي زُجاجَةٍ يَقُولُ إِنِّي أُرِيدُ أَنْ أَقْبِضَكَ فَاجْعَلِ الَّذِي عِنْدَكَ عِنْدَ الْوَصِيِّ كَمَا يُجْعَلُ الْمِصْبَاحُ فِي الزُّجَاجَةِ كَأَنَّها كَوْكَبٌ دُرِّيٌّ فَأَعْلَمَهُمْ فَضْلَ الْوَصِيِّ يُوقَدُ مِنْ شَجَرَةٍ مُبارَكَةٍ فَأَصْلُ الشَّجَرَةِ الْمُبَارَكَةِ إِبْرَاهِيمُ (عليه السلام) وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ رَحْمَتُ اللَّهِ وَ بَرَكاتُهُ عَلَيْكُمْ أَهْلَ الْبَيْتِ إِنَّهُ حَمِيدٌ مَجِيدٌ",
          "وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ إِنَّ اللَّهَ اصْطَفى آدَمَ وَ نُوحاً وَ آلَ إِبْراهِيمَ وَ آلَ عِمْرانَ عَلَى الْعالَمِينَ ذُرِّيَّةً بَعْضُها مِنْ بَعْضٍ وَ اللَّهُ سَمِيعٌ عَلِيمٌ لا شَرْقِيَّةٍ وَ لا غَرْبِيَّةٍ يَقُولُ لَسْتُمْ بِيَهُودٍ فَتُصَلُّوا قِبَلَ الْمَغْرِبِ وَ لَا نَصَارَى فَتُصَلُّوا قِبَلَ الْمَشْرِقِ وَ أَنْتُمْ عَلَى مِلَّةِ إِبْرَاهِيمَ (عليه السلام) وَ قَدْ قَالَ اللَّهُ عَزَّ وَ جَلَّ ما كانَ إِبْراهِيمُ يَهُودِيًّا وَ لا نَصْرانِيًّا وَ لكِنْ كانَ حَنِيفاً مُسْلِماً وَ ما كانَ مِنَ الْمُشْرِكِينَ ",
          "وَ قَوْلُهُ عَزَّ وَ جَلَّ يَكادُ زَيْتُها يُضِي‏ءُ وَ لَوْ لَمْ تَمْسَسْهُ نارٌ نُورٌ عَلى نُورٍ يَهْدِي اللَّهُ لِنُورِهِ مَنْ يَشاءُ يَقُولُ مَثَلُ أَوْلَادِكُمُ الَّذِينَ يُولَدُونَ مِنْكُمْ كَمَثَلِ الزَّيْتِ الَّذِي يُعْصَرُ مِنَ الزَّيْتُونِ يَكادُ زَيْتُها يُضِي‏ءُ وَ لَوْ لَمْ تَمْسَسْهُ نارٌ نُورٌ عَلى نُورٍ يَهْدِي اللَّهُ لِنُورِهِ مَنْ يَشاءُ يَقُولُ يَكَادُونَ أَنْ يَتَكَلَّمُوا بِالنُّبُوَّةِ وَ لَوْ لَمْ يُنْزَلْ عَلَيْهِمْ مَلَكٌ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473709\">H 15021</a> – Ali Bin Muhammad, from Ali Bin Al-Abbas, from Ali Bin Hammad, from Amro Bin Shimr, from Jabir, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>bu Ja’far</span><sup>asws</sup> regarding the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:42#h23\">[42:23]</a> and whoever earns good, We give him more of good therein”</span>, said; ‘The one who befriends (Tawalla) the successors<sup>asws</sup> from the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and follows their<sup>asws</sup> footsteps, so that increases for him the Wilayah of the ones from the past from the Prophets<sup>as</sup>, and the former Believers until their Wilayah arrives to Adam<sup>as</sup>, and it is the Statement of Allah<sup>azwj</sup> <span class=\"ibTxt\">“<a href=\"/#/books/quran:27#h89\">[27:89]</a> Whoever brings good, he shall have better than it”</span>, He<sup>azwj</sup> will Enter him into the Paradise, and it is the Statement of Allah<sup>azwj</sup>: <span class=\"ibTxt\">“<a href=\"/#/books/quran:34#h47\">[34:47]</a> Say: Whatever reward I have asked of you, that is only for yourselves”</span>. He<sup>saww</sup> is saying that the reward is the cordiality which I<sup>saww</sup> never asked for anything other than it, so it is for you to be guided by it, and to be Rescued by it from the Punishment on the Day of Judgement’.",
            "And he<sup>saww</sup> said to the enemies of Allah<sup>azwj</sup>, the friends of Satan<sup>la</sup>, the people of the belying and the denial: <span class=\"ibTxt\">“<a href=\"/#/books/quran:38#h86\">[38:86]</a> Say: \"No reward do I ask of you for this, nor am I a pretender”</span>. He<sup>saww</sup> is saying; ‘I<sup>saww</sup> would be a pretender if I<sup>saww</sup> were to ask you what you are not deserving of’.",
            "So the hypocrites said to each other, with regards to that, ‘But it did not suffice Muhammad<sup>saww</sup> after having conquered us for twenty years, to the extent that he<sup>saww</sup> now wants to burden us with the People<sup>asws</sup> of his<sup>saww</sup> Household upon our necks’. So they said, ‘Allah<sup>azwj</sup> has not Revealed this, nor is it anything except for his<sup>saww</sup> words, intending to raise the People<sup>asws</sup> of his<sup>saww</sup> Household upon our necks, and if Muhammad<sup>saww</sup> were to be killed or dies, we would take it (rule) away from the People<sup>asws</sup> of his<sup>saww</sup> Household, then we would not let it return to be among them ever’. ",
            "And Allah<sup>azwj</sup> Wanted to let know His<sup>azwj</sup> Prophet<sup>saww</sup> of that which was hidden in their chests and what they were keeping as a secret. So He<sup>azwj</sup> Said in His<sup>azwj</sup> Book: <span class=\"ibTxt\">“<a href=\"/#/books/quran:42#h24\">[42:24]</a> Or do they say: He has forged a lie against Allah? But if Allah pleased, He would seal your heart”</span>. He<sup>azwj</sup> is Saying: “Had I<sup>azwj</sup> so Liked to, I<sup>azwj</sup> would have Stopped the Revelation, so you<sup>saww</sup> would not have been able to speak of the virtues of the People<sup>asws</sup> of your<sup>saww</sup> Household, or of their cordiality”.",
            "And Allah<sup style=\"font-weight: normal\">azwj</sup> has Said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:42#h24\">[42:24]</a> And Allah will wipe out the lie and will vindicate the truth by His words” </span>He<sup style=\"font-weight: normal\">azwj</sup> is Saying that the truth is the Wilayah for the People<sup style=\"font-weight: normal\">asws</sup> of the Household <span class=\"ibTxt\">“Lo! He is Aware of what is hidden in the breasts”</span>, and is Speaking of what is attached in their chests from the enmity to the People<sup style=\"font-weight: normal\">asws</sup> of the Household, and the injustices after you<sup style=\"font-weight: normal\">saww</sup>, and it is the Statement of Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:21#h3\">[21:3]</a> and those who are unjust counsel together in secret: He is nothing but a mortal like yourselves; what! will you then yield to enchantment while you see?”</span>",
            "And regarding the Statement of the Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:53#h1\">[53:1]</a> I swear by the star when it goes down </span>He<sup>asws</sup> said; ‘(It means) I<sup>azwj</sup> Swear by the passing away of Muhammad<sup>saww</sup> when he<sup>saww</sup> passes away <span class=\"ibTxt\"><a href=\"/#/books/quran:53#h2\">[53:2]</a> Your companion does not err</span>, in giving out the virtues of the People<sup>asws</sup> of his<sup>saww</sup> Household<span class=\"ibTxt\"> nor does he go astray; <a href=\"/#/books/quran:53#h3\">[53:3]</a> Nor does he speak out of desire. </span>He<sup>azwj</sup> is Saying that he<sup>saww</sup> does not speak of the virtues of the People<sup>asws</sup> of his<sup>saww</sup> Household out of his<sup>saww</sup> own desires, and it is the Statement of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:53#h4\">[53:4]</a> It is naught but revelation that is revealed”</span>.",
            "And Allah<sup>azwj</sup> Mighty and Majestic Said to Muhammad<sup>saww</sup>: <span class=\"ibTxt\">“<a href=\"/#/books/quran:6#h58\">[6:58]</a> Say: If that which you desire to hasten were with me, the matter would have certainly been decided between you and me”</span>. He<sup>saww</sup> said: ‘Had I<sup>saww</sup> been Commanded to, I<sup>saww</sup> would have informed you all of what you are hiding in your chests of the hastening of my<sup>saww</sup> passing away, so that you would perpetrate injustices to the People<sup>asws</sup> of my<sup>saww</sup> Household from after me<sup>saww</sup>. So the example of yours in as Allah<sup>azwj</sup> Mighty and Majestic has Said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:2#h17\">[2:17]</a> Their parable is like the parable of one who kindled a fire but when it had illumined all around him”</span>, He<sup>azwj</sup> is Saying; “Illumination of the earth by the light of Muhammad<sup>saww</sup> just like the illumination of the sun”. ",
            "So Allah<sup>azwj</sup> Cited an example of Muhammad<sup>saww</sup> with the sun, and an example of the successor<sup>asws</sup> with the moon, and it is the Statement of the Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:10#h5\">[10:5]</a> He it is Who made the sun a shining brightness and the moon a light”</span>, and His<sup>azwj</sup> Statement: <span class=\"ibTxt\">“<a href=\"/#/books/quran:36#h37\">[36:37]</a> And a sign to them is the night: We draw forth from it the day, then lo! they are in the dark”</span>, and the Statement of the Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:2#h17\">[2:17]</a> Their parable is like the parable of one who kindled a fire but when it had illumined all around him, Allah took away their light, and left them in utter darkness - they do not see”, </span>meaning, the passing away of Muhammad<sup>saww</sup> and the appearance of the darkness, so they cannot see the virtues of the People<sup>asws</sup> of his<sup>saww</sup> Household, and it is the Statement of the Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:7#h198\">[7:198]</a> And if you invite them to guidance, they do not hear; and you see them looking towards you, yet they do not see”</span>.",
            "Then the Rasool Allah<sup>saww</sup> placed the knowledge which was with him<sup>saww</sup> to be with the successor<sup>asws</sup>, and it is the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:24#h35\">[24:35]</a> Allah is the light of the heavens and the earth</span>, He<sup>azwj</sup> is Saying: “I<sup>azwj</sup> am the Guide of the Heavens and the earth, like the Knowledge which I<sup>azwj</sup> Gave out, and it  is My<sup>azwj</sup> Light with which I<sup>azwj</sup> Guide by<span class=\"ibTxt\"> a likeness of His light is as a niche in which is a lamp,</span> so the niche is the heart of Muhammad<sup>saww</sup>, and the lamp is the Light in which is the Knowledge. ",
            "And His<sup>azwj</sup> Statement<span class=\"ibTxt\"> the lamp is in a glass, </span>He<sup>azwj</sup> is Saying: “I<sup>azwj</sup> Wanted to Make you<sup>saww</sup> pass away, and Make that which is in your presence to be with the successor<sup>asws</sup> just as the lamp is made to be in a glass, <span class=\"ibTxt\">(and) the glass is as it were a brightly shining star, lit from a blessed tree”</span>. So the origin of the Blessed Tree is Ibrahim<sup>as</sup> and it is the Statement of the Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:11#h73\">[11:73]</a> The mercy of Allah and His blessings are on you, O people of the house, surely He is Praised, Glorious”</span>.",
            "And it is the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:3#h33\">[3:33]</a> Surely Allah chose Adam and Nuh and the descendants of Ibrahim and the descendants of Imran above the nations <a href=\"/#/books/quran:3#h34\">[3:34]</a> Offspring one of the other; and Allah is Hearing, Knowing”</span>. <span class=\"ibTxt\">“<a href=\"/#/books/quran:24#h35\">[24:35]</a> neither eastern nor western”</span>. He<sup>azwj</sup> is saying: “You are neither Jews so that you Pray in the direction of the west, nor are you Christians, so that you Pray in the direction of the east, but you are the nation of Ibrahim<sup>as</sup>”, and Allah<sup>azwj</sup> Mighty and Majestic has Said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:3#h67\">[3:67]</a> Ibrahim was not a Jew nor a Christian but he was (an) upright (man), a Muslim, and he was not one of the polytheists”</span>. ",
            "And it is the Statement of the Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:24#h35\">[24:35]</a> the oil whereof almost gives light though fire touch it not - light upon light - Allah guides to His light whom He pleases”</span>, He<sup>azwj</sup> is Saying: “The example of your children whom you give birth to from among you, is like the example of the oil which comes out from the olive, <span class=\"ibTxt\">“<a href=\"/#/books/quran:24#h35\">[24:35]</a> the oil whereof almost gives light though fire touch it not - light upon light - Allah guides to His light whom He pleases”</span>. He<sup>azwj</sup> is saying that they almost speak with the Prophet-hood even though an Angel has not descended upon them’.  "
          ],
          "en.sarwar": [
            "575. Abu Ali Al-Ashary, from Muhammad bin Abdul Jabbar, from Al-Hassan Bin Ali, from Ali Bin Abu Hamza, from Abu Baseer, who has said: ‘I asked Abu Abdullah (a.s.) about the Statement of Allah (azwj) Mighty and Majestic: “<a href=\"/#/books/quran:41#h53\">[41:53]</a> We will soon show them Our signs in the Universe and in their own souls, until it will become quite clear to them that it is the truth”, he (a.s.) said: ‘He (azwj) Showed them in their own selves, the metamorphosis, and Showed them in the horizon, the breakdowns in the horizons so they would see the Power of Allah (azwj) Mighty and Majestic within themselves and in the horizon’. So I said to him, (What about) “until it will become quite clear to them that it is the truth”?’ He (a.s.) said: ‘The coming out of Al-Qaim (a.s.), it is the truth from the Presence of Allah (azwj) Mighty and Majestic which the creatures will see, it is inevitable’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 582)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15260,
        "local_index": 25,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:25",
        "refs": {
          "Mentions": [
            "/books/quran:41:53"
          ]
        },
        "text": [
          "15022- أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ سَنُرِيهِمْ آياتِنا فِي الْآفاقِ وَ فِي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ قَالَ يُرِيهِمْ فِي أَنْفُسِهِمُ الْمَسْخَ وَ يُرِيهِمْ فِي الْآفَاقِ انْتِقَاضَ الْآفَاقِ عَلَيْهِمْ فَيَرَوْنَ قُدْرَةَ اللَّهِ عَزَّ وَ جَلَّ فِي أَنْفُسِهِمْ وَ فِي الْآفَاقِ قُلْتُ لَهُ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ قَالَ خُرُوجُ الْقَائِمِ هُوَ الْحَقُّ مِنْ عِنْدِ اللَّهِ عَزَّ وَ جَلَّ يَرَاهُ الْخَلْقُ لَا بُدَّ مِنْهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473710\">H 15022</a> – Abu Ali Al-Ashary, from Muhammad bin Abdul Jabbar, from Al-Hassan Bin Ali, from Ali Bin Abu Hamza, from Abu Baseer, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> asked Abu Abdullah</span><sup>asws</sup> about the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:41#h53\">[41:53]</a> We will soon show them Our signs in the Universe and in their own souls, until it will become quite clear to them that it is the truth”</span>, he<sup>asws</sup> said: ‘He<sup>azwj</sup> Showed them in their own selves, the metamorphosis, and Showed them in the horizon, the breakdowns in the horizons so they would see the Power of Allah<sup>azwj</sup> Mighty and Majestic within themselves and in the horizon’. So I said to him, (What about) <span class=\"bTxt\">“</span><span class=\"ibTxt\">until it will become quite clear to them that it is the truth”</span>?’ He<sup>asws</sup> said: ‘The coming out of Al-Qaim<sup>asws</sup>, it is the truth from the Presence of Allah<sup>azwj</sup> Mighty and Majestic which the creatures will see, it is inevitable’."
          ],
          "en.sarwar": [
            "576. Muhammad Bin Yahya, and Al-Husayn Bin Muhammad, together from Ja’far Bin Muhammad, from Abbad Bin Yaqoub, from Ahmad Bin Ismail, from Amro Bin Kaysan, from Abu Abdullah Al-Ju’fy who said: ‘Abu Ja’far Muhammad Bin Ali (a.s.) said to me: ‘How many Rabaat (guards) are there in your presence?’ I said, ‘Forty’. He (a.s.) said: ‘But our (a.s.) guards are eternal guards. The ones who is a guard amongst us who looks after an animal, there will be for him its weight, and the weight of its (animal) weight so long as it was with him. And the one who is a guard amongst us with weapon would have its weight so long as it was with him. Do not grieve from once, or twice, or three times, or four, for our example and your example is like the example of the Prophet (as) who was in the Children of Israel. So Allah (azwj) Mighty and Majestic Revealed to him (as): “If you (as) prepare your (as) people for the fighting, I (azwj) will Help you (as)’. So he (as) gathered them from the top of the mountains and from other places (other) than that. Then he (as) directed them for it. So they neither struck with their swords, nor did they stab with their spears until they were defeated. Then Allah (azwj) Revealed to him: “If you (as) prepare your (as) people for the fighting, I (azwj) will Help you (as)”. So he (as) called them. They said, ‘You promised us the Help, but no Help came to us’. So Allah (azwj) the High Revealed to him (as): “But, they can either choose to fight or the Fire’. So he (as) said: ‘O Lord (azwj)! The fighting is more beloved to me (as) than the Fire’. So he (as) called upon them, and three hundred and thirteen of them answered him (as), the same number of the people of Badr. So he (as) directed them (for the battle). They neither struck with their swords, nor stabbed with their spears, until Allah (azwj) Mighty and Majestic Granted victory to them’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 583)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15261,
        "local_index": 26,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:26",
        "text": [
          "15023- مُحَمَّدُ بْنُ يَحْيَى وَ الْحُسَيْنُ بْنُ مُحَمَّدٍ جَمِيعاً عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ عَبَّادِ بْنِ يَعْقُوبَ عَنْ أَحْمَدَ بْنِ إِسْمَاعِيلَ عَنْ عَمْرِو بْنِ كَيْسَانَ عَنْ أَبِي عَبْدِ اللَّهِ الْجُعْفِيِّ قَالَ قَالَ لِي أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ عَلِيٍّ (عليه السلام) كَمِ الرِّبَاطُ عِنْدَكُمْ قُلْتُ أَرْبَعُونَ قَالَ لَكِنْ رِبَاطُنَا رِبَاطُ الدَّهْرِ وَ مَنِ ارْتَبَطَ فِينَا دَابَّةً كَانَ لَهُ وَزْنُهَا وَ وَزْنُ وَزْنِهَا مَا كَانَتْ عِنْدَهُ وَ مَنِ ارْتَبَطَ فِينَا سِلَاحاً كَانَ لَهُ وَزْنُهُ مَا كَانَ عِنْدَهُ لَا تَجْزَعُوا مِنْ مَرَّةٍ وَ لَا مِنْ مَرَّتَيْنِ وَ لَا مِنْ ثَلَاثٍ وَ لَا مِنْ أَرْبَعٍ فَإِنَّمَا مَثَلُنَا وَ مَثَلُكُمْ مَثَلُ نَبِيٍّ كَانَ فِي بَنِي إِسْرَائِيلَ",
          "فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ أَنِ ادْعُ قَوْمَكَ لِلْقِتَالِ فَإِنِّي سَأَنْصُرُكَ فَجَمَعَهُمْ مِنْ رُءُوسِ الْجِبَالِ وَ مِنْ غَيْرِ ذَلِكَ ثُمَّ تَوَجَّهَ بِهِمْ فَمَا ضَرَبُوا بِسَيْفٍ وَ لَا طَعَنُوا بِرُمْحٍ حَتَّى انْهَزَمُوا ثُمَّ أَوْحَى اللَّهُ تَعَالَى إِلَيْهِ أَنِ ادْعُ قَوْمَكَ إِلَى الْقِتَالِ فَإِنِّي سَأَنْصُرُكَ فَجَمَعَهُمْ ثُمَّ تَوَجَّهَ بِهِمْ فَمَا ضَرَبُوا بِسَيْفٍ وَ لَا طَعَنُوا بِرُمْحٍ حَتَّى انْهَزَمُوا ",
          "ثُمَّ أَوْحَى اللَّهُ إِلَيْهِ أَنِ ادْعُ قَوْمَكَ إِلَى الْقِتَالِ فَإِنِّي سَأَنْصُرُكَ فَدَعَاهُمْ فَقَالُوا وَعَدْتَنَا النَّصْرَ فَمَا نُصِرْنَا فَأَوْحَى اللَّهُ تَعَالَى إِلَيْهِ إِمَّا أَنْ يَخْتَارُوا الْقِتَالَ أَوِ النَّارَ فَقَالَ يَا رَبِّ الْقِتَالُ أَحَبُّ إِلَيَّ مِنَ النَّارِ فَدَعَاهُمْ فَأَجَابَهُ مِنْهُمْ ثَلَاثُمِائَةٍ وَ ثَلَاثَةَ عَشَرَ عِدَّةَ أَهْلِ بَدْرٍ فَتَوَجَّهَ بِهِمْ فَمَا ضَرَبُوا بِسَيْفٍ وَ لَا طَعَنُوا بِرُمْحٍ حَتَّى فَتَحَ اللَّهُ عَزَّ وَ جَلَّ لَهُمْ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473711\">H 15023</a> – Muhammad Bin Yahya, and Al-Husayn Bin Muhammad, together from Ja’far Bin Muhammad, from Abbad Bin Yaqoub, from Ahmad Bin Ismail, from Amro Bin Kaysan, from Abu Abdullah Al-Ju’fy who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>bu Ja’far Muhammad</span> Bin Ali<sup>asws</sup> said to me: ‘How many Rabaat (guards) are there in your presence?’ I said, ‘Forty’. He<sup>asws</sup> said: ‘But our<sup>asws</sup> guards are eternal guards. The ones who is a guard amongst us who looks after an animal, there will be for him its weight, and the weight of its (animal) weight so long as it was with him. And the one who is a guard amongst us with weapon would have its weight so long as it was with him. Do not grieve from once, or twice, or three times, or four, for our example and your example is like the example of the Prophet<sup>as</sup> who was in the Children of Israel.  ",
            "So Allah<sup>azwj</sup> Mighty and Majestic Revealed to him<sup>as</sup>: “If you<sup>as</sup> prepare your<sup>as</sup> people for the fighting, I<sup>azwj</sup> will Help you<sup>as</sup>’. So he<sup>as</sup> gathered them from the top of the mountains and from other places (other) than that. Then he<sup>as</sup> directed them for it. So they neither struck with their swords, nor did they stab with their spears until they were defeated. ",
            "Then Allah<sup>azwj</sup> Revealed to him: “If you<sup>as</sup> prepare your<sup>as</sup> people for the fighting, I<sup>azwj</sup> will Help you<sup>as</sup>”. So he<sup>as</sup> called them. They said, ‘You promised us the Help, but no Help came to us’. So Allah<sup>azwj</sup> the High Revealed to him<sup>as</sup>: “But, they can either choose to fight or the Fire’. So he<sup>as</sup> said: ‘O Lord<sup>azwj</sup>! The fighting is more beloved to me<sup>as</sup> than the Fire’. So he<sup>as</sup> called upon them, and three hundred and thirteen of them answered him<sup>as</sup>, the same number of the people of Badr. So he<sup>as</sup> directed them (for the battle). They neither struck with their swords, nor stabbed with their spears, until Allah<sup>azwj</sup> Mighty and Majestic Granted victory to them’. "
          ],
          "en.sarwar": [
            "577. A number of our companions, from Sahl Bin Ziyad, from Bakr bin Salih, and Al-Nowfali, and someone else with an unbroken chain going up to Abu Abdullah (a.s.), the following: Abu Abdullah (a.s.) has said: ‘The Rasool Allah (saww) never used to cure himself (saww) from the flu, and would say: ‘There is no one except that he has a vein from the leprosy, so if he is struck by the flu, it suppresses it’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 583)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15262,
        "local_index": 27,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:27",
        "text": [
          "15024- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ بَكْرِ بْنِ صَالِحٍ وَ النَّوْفَلِيِّ وَ غَيْرِهِمَا يَرْفَعُونَهُ إِلَى أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ كَانَ رَسُولُ اللَّهِ (صلى الله عليه وآله) لَا يَتَدَاوَى مِنَ الزُّكَامِ وَ يَقُولُ مَا مِنْ أَحَدٍ إِلَّا وَ بِهِ عِرْقٌ مِنَ الْجُذَامِ فَإِذَا أَصَابَهُ الزُّكَامُ قَمَعَهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473712\">H 15024</a> – A number of our companions, from Sahl Bin Ziyad, from Bakr bin Salih, and Al-Nowfali, and someone else with an unbroken chain going up to Abu Abdullah<sup>asws</sup>, the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘The Rasool Allah<sup>saww</sup> never used to cure himself<sup>saww</sup> from the flu, and would say: ‘There is no one except that he has a vein from the leprosy, so if he is struck by the flu, it suppresses it’. "
          ],
          "en.sarwar": [
            "578. Muhammad Bin yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Abu Umeyr, from Hisham Bin Salim, who has narrated the following: ‘Abu Abdullah (a.s.) has said; ‘The Rasool Allah (saww) said: ‘The flu is an army from the armies of Allah (azwj) Mighty and Majestic. Allah (azwj) Mighty and Majestic Sends it to the illness, to eradicate it’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 583)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15263,
        "local_index": 28,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:28",
        "text": [
          "15025- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) الزُّكَامُ جُنْدٌ مِنْ جُنُودِ اللَّهِ عَزَّ وَ جَلَّ يَبْعَثُهُ اللَّهُ عَزَّ وَ جَلَّ عَلَى الدَّاءِ فَيُزِيلُهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473713\">H 15025</a> – Muhammad Bin yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Abu Umeyr, from Hisham Bin Salim, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>bu Abdullah</span><sup>asws</sup> has said; ‘The Rasool Allah<sup>saww</sup> said: ‘The flu is an army from the armies of Allah<sup>azwj</sup> Mighty and Majestic. Allah<sup>azwj</sup> Mighty and Majestic Sends it to the illness, to eradicate it’. "
          ],
          "en.sarwar": [
            "579. Muhammad Bin Yahya, from Muhas Bin Al-Hassan, from Muhammad Bin Abdul Hameed, by his unbroken chain going up to Abu Abdullah (a.s.), the following: Abu Abdullah (a.s.) has said: ‘The Rasool Allah (saww) said: ‘There is no one from the children of Adam (as) except that there are two veins within him. A vein in his head which incites the leprosy, and a vein in his body which incites the vitiligo. So if the vein in the head gets incited, Allah (azwj) Mighty and Majestic Makes the flu to overcome it until the illness flows out from it. And if the vein which is in the body gets incited, Allah (azwj) Makes it to be overcome by the abscesses until the illness flows out from it. So if one of you sees the flu and abscesses, so he should Praise Allah (azwj) Mighty and Majestic for the health’. And he (a.s.) said; ‘Flu has origin in the head’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 584)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15264,
        "local_index": 29,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:29",
        "text": [
          "15026- مُحَمَّدُ بْنُ يَحْيَى عَنْ مُوسَى بْنِ الْحَسَنِ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْحَمِيدِ بِإِسْنَادِهِ رَفَعَهُ إِلَى أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) مَا مِنْ أَحَدٍ مِنْ وُلْدِ آدَمَ إِلَّا وَ فِيهِ عِرْقَانِ عِرْقٌ فِي رَأْسِهِ يُهَيِّجُ الْجُذَامَ وَ عِرْقٌ فِي بَدَنِهِ يُهَيِّجُ الْبَرَصَ فَإِذَا هَاجَ الْعِرْقُ الَّذِي فِي الرَّأْسِ سَلَّطَ اللَّهُ عَزَّ وَ جَلَّ عَلَيْهِ الزُّكَامَ حَتَّى يَسِيلَ مَا فِيهِ مِنَ الدَّاءِ وَ إِذَا هَاجَ الْعِرْقُ الَّذِي فِي الْجَسَدِ سَلَّطَ اللَّهُ عَلَيْهِ الدَّمَامِيلَ حَتَّى يَسِيلَ مَا فِيهِ مِنَ الدَّاءِ فَإِذَا رَأَى أَحَدُكُمْ بِهِ زُكَاماً وَ دَمَامِيلَ فَلْيَحْمَدِ اللَّهَ عَزَّ وَ جَلَّ عَلَى الْعَافِيَةِ وَ قَالَ الزُّكَامُ فُضُولٌ فِي الرَّأْسِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473714\">H 15026</a> – Muhammad Bin Yahya, from Muhas Bin Al-Hassan, from Muhammad Bin Abdul Hameed, by his unbroken chain going up to Abu Abdullah<sup>asws</sup>, the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘The Rasool Allah<sup>saww</sup> said: ‘There is no one from the children of Adam<sup>as</sup> except that there are two veins within him. A vein in his head which incites the leprosy, and a vein in his body which incites the vitiligo. So if the vein in the head gets incited, Allah<sup>azwj</sup> Mighty and Majestic Makes the flu to overcome it until the illness flows out from it. And if the vein which is in the body gets incited, Allah<sup>azwj</sup> Makes it to be overcome by the abscesses until the illness flows out from it. So if one of you sees the flu and abscesses, so he should Praise Allah<sup>azwj</sup> Mighty and Majestic for the health’. And he<sup>asws</sup> said; ‘Flu has origin in the head’. "
          ],
          "en.sarwar": [
            "580. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from a man who said: ‘A man came up to Abu Abdullah (a.s.) and he was complaining about his eyes, so he (a.s.) said to him: ‘Where are you from these three parts – the Aloe, the Camphor, and the Myrrh’. The man did that, and it (illness) went away from him’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 584)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15265,
        "local_index": 30,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:30",
        "text": [
          "15027- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ رَجُلٍ قَالَ دَخَلَ رَجُلٌ عَلَى أَبِي عَبْدِ اللَّهِ (عليه السلام) وَ هُوَ يَشْتَكِي عَيْنَيْهِ فَقَالَ لَهُ أَيْنَ أَنْتَ عَنْ هَذِهِ الْأَجْزَاءِ الثَّلَاثَةِ الصَّبِرِ وَ الْكَافُورِ وَ الْمُرِّ فَفَعَلَ الرَّجُلُ ذَلِكَ فَذَهَبَتْ عَنْهُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473715\">H 15027</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from a man who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span> man came up to Abu</span> Abdullah<sup>asws</sup> and he was complaining about his eyes, so he<sup>asws</sup> said to him: ‘Where are you from these three parts – the Aloe, the Camphor, and the Myrrh’. The man did that, and it (illness) went away from him’. "
          ],
          "en.sarwar": [
            "581. From him, from Ahmad, from Ibn Mahboub, from Jameel Bin Salih who said: ‘I said to Abu Abdullah (a.s.) that. ‘We have a young girl who used to see the planet like the jar’. He (a.s.) said: ‘Yes, and she can see it like a grain’. So I said, ‘Her eyesight is weak’. So he (a.s.) said: ‘Apply (in her eyes) the Aloe, and the Myrrh, and the Camphor in equal parts’. So we applied it in her eyes, and she benefited from it’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 584)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15266,
        "local_index": 31,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:31",
        "text": [
          "15028- عَنْهُ عَنْ أَحْمَدَ عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ (عليه السلام) إِنَّ لَنَا فَتَاةً كَانَتْ تَرَى الْكَوْكَبَ مِثْلَ الْجَرَّةِ قَالَ نَعَمْ وَ تَرَاهُ مِثْلَ الْحُبِّ قُلْتُ إِنَّ بَصَرَهَا ضَعُفَ فَقَالَ اكْحُلْهَا بِالصَّبِرِ وَ الْمُرِّ وَ الْكَافُورِ أَجْزَاءً سَوَاءً فَكَحَلْنَاهَا بِهِ فَنَفَعَهَا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473716\">H 15028</a> – From him, from Ahmad, from Ibn Mahboub, from Jameel Bin Salih who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> said to Abu Abdullah</span><sup>asws</sup> that. ‘We have a young girl who used to see the planet like the jar’. He<sup>asws</sup> said: ‘Yes, and she can see it like a grain’. So I said, ‘Her eyesight is weak’. So he<sup>asws</sup> said: ‘Apply (in her eyes) the Aloe, and the Myrrh, and the Camphor in equal parts’. So we applied it in her eyes, and she benefited from it’. "
          ],
          "en.sarwar": [
            "582. From him, from Ahmad, from Dawood Bin Muhammad, from Muhammad Bin Al-Fayz, who has narrated the following: Abu Abdullah (a.s.) has said: ‘I (a.s.) was in the presence of Abu Ja’far, meaning Abu Al-Dawaniq, when a packet came and he opened it and looked inside it. So he took something out from it. He said, ‘O Abu Abdullah (a.s.), do you (a.s.) know what this is?’ I (a.s.) said: ‘What is it?’ He said, ‘This is something that has come to me from behind Africa, from Tanjat, (or Tabnat, Muhammad (the narrator doubted). So I (a.s.) said: ‘What is it?’ He said, ‘There is a mountain there from which drops come out in a year and solidify, and it is best for the whiteness which occurs in the eyes, if this is applied to them, it would go away by the Permission of Allah (azwj) Mighty and Majestic. I (a.s.) said, ‘Yes, I recognise it, and if you like I can inform you of its name and its condition’. He (a.s.) said: ‘He never asked me (a.s.) about its name’. He said, ‘And what is its condition?’ So I (a.s.) said: ‘This is a mountain on which was a Prophet (as) from the sons of the Children of Israel, who had fled from his (as) people, and he (as) used to worship upon it. So the people came to know about it, and they killed him. So it (mountain) now weeps over that Prophet (as), and these are the drops from its weeping. And on the other side of it is a spring from which the water flows by the night and the day, but it does not arrive to that fountain (of tears)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 585)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15267,
        "local_index": 32,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:32",
        "text": [
          "15029- عَنْهُ عَنْ أَحْمَدَ عَنْ دَاوُدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ الْفَيْضِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ كُنْتُ عِنْدَ أَبِي جَعْفَرٍ يَعْنِي أَبَا الدَّوَانِيقِ فَجَاءَتْهُ خَرِيطَةٌ فَحَلَّهَا وَ نَظَرَ فِيهَا فَأَخْرَجَ مِنْهَا شَيْئاً فَقَالَ يَا أَبَا عَبْدِ اللَّهِ أَ تَدْرِي مَا هَذَا قُلْتُ مَا هُوَ قَالَ هَذَا شَيْ‏ءٌ يُؤْتَى بِهِ مِنْ خَلْفِ إِفْرِيقِيَةَ مِنْ طَنْجَةَ أَوْ طُبْنَةَ شَكَّ مُحَمَّدٌ قُلْتُ مَا هُوَ قَالَ جَبَلٌ هُنَاكَ يَقْطُرُ مِنْهُ فِي السَّنَةِ قَطَرَاتٌ فَتَجْمُدُ وَ هُوَ جَيِّدٌ لِلْبَيَاضِ يَكُونُ فِي الْعَيْنِ يُكْتَحَلُ بِهَذَا فَيَذْهَبُ بِإِذْنِ اللَّهِ عَزَّ وَ جَلَّ ",
          "قُلْتُ نَعَمْ أَعْرِفُهُ وَ إِنْ شِئْتَ أَخْبَرْتُكَ بِاسْمِهِ وَ حَالِهِ قَالَ فَلَمْ يَسْأَلْنِي عَنِ اسْمِهِ قَالَ وَ مَا حَالُهُ فَقُلْتُ هَذَا جَبَلٌ كَانَ عَلَيْهِ نَبِيٌّ مِنْ أَنْبِيَاءِ بَنِي إِسْرَائِيلَ هَارِباً مِنْ قَوْمِهِ يَعْبُدُ اللَّهَ عَلَيْهِ فَعَلِمَ بِهِ قَوْمُهُ فَقَتَلُوهُ فَهُوَ يَبْكِي عَلَى ذَلِكَ النَّبِيِّ (عليه السلام) وَ هَذِهِ الْقَطَرَاتُ مِنْ بُكَائِهِ وَ لَهُ مِنَ الْجَانِبِ الْآخَرِ عَيْنٌ تَنْبُعُ مِنْ ذَلِكَ الْمَاءِ بِاللَّيْلِ وَ النَّهَارِ وَ لَا يُوصَلُ إِلَى تِلْكَ الْعَيْنِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473717\">H 15029</a> – From him, from Ahmad, from Dawood Bin Muhammad, from Muhammad Bin Al-Fayz, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> has said: ‘I<sup>asws</sup> was in the presence of Abu Ja’far, meaning Abu Al-Dawaniq, when a packet came and he opened it and looked inside it. So he took something out from it. He said, ‘O Abu Abdullah<sup>asws</sup>, do you<sup>asws</sup> know what this is?’ I<sup>asws</sup> said: ‘What is it?’ He said, ‘This is something that has come to me from behind Africa, from Tanjat, (or Tabnat, Muhammad (the narrator doubted). So I<sup>asws</sup> said: ‘What is it?’ He said, ‘There is a mountain there from which drops come out in a year and solidify, and it is best for the whiteness which occurs in the eyes, if this is applied to them, it would go away by the Permission of Allah<sup>azwj</sup> Mighty and Majestic. ",
            "I<sup>asws</sup> said, ‘Yes, I recognise it, and if you like I can inform you of its name and its condition’. He<sup>asws</sup> said: ‘He never asked me<sup>asws</sup> about its name’. He said, ‘And what is its condition?’ So I<sup>asws</sup> said: ‘This is a mountain on which was a Prophet<sup>as</sup> from the sons of the Children of Israel, who had fled from his<sup>as</sup> people, and he<sup>as</sup> used to worship upon it. So the people came to know about it, and they killed him. So it (mountain) now weeps over that Prophet<sup>as</sup>, and these are the drops from its weeping. And on the other side of it is a spring from which the water flows by the night and the day, but it does not arrive to that fountain (of tears)’. "
          ],
          "en.sarwar": [
            "583. Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Suleym the slave of Ali Bin Yaqteen, who has said: He said: ‘I had conjunctivitis in my eye which hurt. ‘Abu Al-Hassan (a.s.) wrote to me about it initiating from himself (a.s.); ‘What is preventing you from applying the application of Abu Ja’far (a.s.), a part of Rabahiyya Camphor, Aloe of Asqutry, crushed together and sifted by silk. You should apply from it like the application from the powder, once in a month. It would chase away every illness in the head and exit it from the body’. He said, ‘He used to apply it, and had no complaints for his eyes until death’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 586)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15268,
        "local_index": 33,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:50:33",
        "text": [
          "15030- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ سُلَيْمٍ مَوْلَى عَلِيِّ بْنِ يَقْطِينٍ أَنَّهُ كَانَ يَلْقَى مِنْ رَمَدِ عَيْنَيْهِ أَذًى قَالَ فَكَتَبَ إِلَيْهِ أَبُو الْحَسَنِ (عليه السلام) ابْتِدَاءً مِنْ عِنْدِهِ مَا يَمْنَعُكَ مِنْ كُحْلِ أَبِي جَعْفَرٍ (عليه السلام) جُزْءُ كَافُورٍ رَبَاحِيٍّ وَ جُزْءُ صَبِرٍ أُصْقُوطْرَى يُدَقَّانِ جَمِيعاً وَ يُنْخَلَانِ بِحَرِيرَةٍ يُكْتَحَلُ مِنْهُ مِثْلَ مَا يُكْتَحَلُ مِنَ الْإِثْمِدِ الْكَحْلَةُ فِي الشَّهْرِ تَحْدُرُ كُلَّ دَاءٍ فِي الرَّأْسِ وَ تُخْرِجُهُ مِنَ الْبَدَنِ قَالَ فَكَانَ يَكْتَحِلُ بِهِ فَمَا اشْتَكَى عَيْنَيْهِ حَتَّى مَاتَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473718\">H 15030</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Suleym the slave of Ali Bin Yaqteen, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-h\">H</span>e said: ‘I had conjunctivitis</span> in my eye which hurt. ‘Abu Al-Hassan<sup>asws</sup> wrote to me about it initiating from himself<sup>asws</sup>; ‘What is preventing you from applying the application of Abu Ja’far<sup>asws</sup>, a part of Rabahiyya Camphor, Aloe of Asqutry, crushed together and sifted by silk. You should apply from it like the application from the powder, once in a month. It would chase away every illness in the head and exit it from the body’. He said, ‘He used to apply it, and had no complaints for his eyes until death’. "
          ],
          "en.sarwar": [
            "584. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, fromm Ali Bin Al-Hakam, from Muhammad Bin Sinan, from the one who informed him, the following: ‘Abu Abdullah (a.s.) has said: ‘There was a worshipper in the Children of Israel who never got involved with anything from the affairs of the world. Iblees (la) grunted a grunt, and his (la) army gathered towards him (la). So he (la) said, ‘Who is the one for me (la) for that one?’ One of them said, ‘I am for him’. So he (la) said, ‘From where you will come to him?’ He said, ‘From the aspect of the women’. He (la) said, ‘This is not for him. He will never be tempted by the women’. Another one said to him (la), ‘I will be for him’. So he (la) said, ‘From where will you come to him?’ He said, ‘From the aspect of the drink and the pleasures’. He (la) said, ‘This is not for him. This cannot be by this’. Another one said, ‘I will be for him’. He (la) said, ‘From where will you come to him?’ From the aspect of the righteousness’. So he (la) said, ‘Go, for you are the master of it’. So he went to the place of the man. He settled himself near him and Prayed. He (a.s.) said: ‘And the man used to sleep, and the Devil would not sleep, and he would rest, and the Devil would not rest. So the man turned towards him and belittled himself, and considered his deeds as short and small, so he said, ‘O servant of Allah (azwj)! With what thing do you get your strength from to perform these Prayers?’ He did not answer him. Then he repeated to him. He still did not answer him. Then he repeated it again to him, so he said, ‘O servant of Allah (azwj)! I committed a sin, and I am repentant from it. So now whenever I remember the sin, it gives me strength for the ‘Salat’ (Prayers)’. He said, ‘Inform be about your sin until I understand it, and I can repent if I were to commit it in order to derive strength for the Prayers’. He said, ‘Enter the city and ask around for so and so female prostitute. Give her two Dirhams, and benefit from her’. He said, ‘I do not know where I would get two Dirhams from?’ So the Devil took two Dirhams from under his feet and gave these to him. So he stood up and entered the city wearing his robe, asking around for the house of that prostitute. The people guided him thinking that he is going there to advise her, so they guided him. So he went to her and threw the two Dirhams at her and said, ‘Stand up’. So she stood up and entered inside her house, and she said, ‘Enter, and you have come to me in a dress which no one has come to me wearing the like of it. So, inform me of your news’. So he informed her. She said to him, ‘O servant of Allah (azwj)! The avoidance of sin is easier than repenting for it, and every repentant person does not find it (Accepted). But rather, it is befitting that he is a Devil who looks like you. So leave, for you will not see anything’. So he left, and she died that very night, and there was found written on her door, ‘Be cautious of this one, for she is from the inhabitants of the Paradise!’ The people became suspicious, so they waited for three days and did not bury her due to their doubts in her matter. So Allah (azwj) Mighty and Majestic Revealed unto a Prophet (as) from the Prophets (as) unknown to anyone except for Musa Bin Imran (as) that: “Go to her and Pray over her and order the people to Prayed over her, for I (azwj) have Forgiven her, and Obligated the Paradise for her, for her discouraging My (azwj) servant from disobeying Me (azwj)’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:50",
  "kind": "verse_list"
}