{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 51"
        },
        "path": "/books/al-kafi:8:1:51",
        "titles": {
          "ar": "حَدِيثُ الْعَابِدِ",
          "en": "HADEETH OF THE WORSHIPPER"
        }
      }
    ],
    "index": 2322,
    "local_index": 51,
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:51",
    "titles": {
      "ar": "حَدِيثُ الْعَابِدِ",
      "en": "HADEETH OF THE WORSHIPPER"
    },
    "verse_count": 2,
    "verse_start_index": 15268,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 587)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15269,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:51:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">15031</span>- مُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ عَابِدٌ فِي بَنِي إِسْرَائِيلَ لَمْ يُقَارِفْ مِنْ أَمْرِ الدُّنْيَا شَيْئاً فَنَخَرَ إِبْلِيسُ نَخْرَةً فَاجْتَمَعَ إِلَيْهِ جُنُودُهُ فَقَالَ مَنْ لِي بِفُلَانٍ فَقَالَ بَعْضُهُمْ أَنَا لَهُ فَقَالَ مِنْ أَيْنَ تَأْتِيهِ فَقَالَ مِنْ نَاحِيَةِ النِّسَاءِ قَالَ لَسْتَ لَهُ لَمْ يُجَرِّبِ النِّسَاءَ",
          "فَقَالَ لَهُ آخَرُ فَأَنَا لَهُ فَقَالَ لَهُ مِنْ أَيْنَ تَأْتِيهِ قَالَ مِنْ نَاحِيَةِ الشَّرَابِ وَ اللَّذَّاتِ قَالَ لَسْتَ لَهُ لَيْسَ هَذَا بِهَذَا قَالَ آخَرُ فَأَنَا لَهُ قَالَ مِنْ أَيْنَ تَأْتِيهِ قَالَ مِنْ نَاحِيَةِ الْبِرِّ قَالَ انْطَلِقْ فَأَنْتَ صَاحِبُهُ فَانْطَلَقَ إِلَى مَوْضِعِ الرَّجُلِ فَأَقَامَ حِذَاهُ يُصَلِّي ",
          "قَالَ وَ كَانَ الرَّجُلُ يَنَامُ وَ الشَّيْطَانُ لَا يَنَامُ وَ يَسْتَرِيحُ وَ الشَّيْطَانُ لَا يَسْتَرِيحُ فَتَحَوَّلَ إِلَيْهِ الرَّجُلُ وَ قَدْ تَقَاصَرَتْ إِلَيْهِ نَفْسُهُ وَ اسْتَصْغَرَ عَمَلَهُ فَقَالَ يَا عَبْدَ اللَّهِ بِأَيِّ شَيْ‏ءٍ قَوِيتَ عَلَى هَذِهِ الصَّلَاةِ فَلَمْ يُجِبْهُ ثُمَّ أَعَادَ عَلَيْهِ فَلَمْ يُجِبْهُ ثُمَّ أَعَادَ عَلَيْهِ فَقَالَ يَا عَبْدَ اللَّهِ إِنِّي أَذْنَبْتُ ذَنْباً وَ أَنَا تَائِبٌ مِنْهُ فَإِذَا ذَكَرْتُ الذَّنْبَ قَوِيتُ عَلَى الصَّلَاةِ ",
          "قَالَ فَأَخْبِرْنِي بِذَنْبِكَ حَتَّى أَعْمَلَهُ وَ أَتُوبَ فَإِذَا فَعَلْتُهُ قَوِيتُ عَلَى الصَّلَاةِ قَالَ ادْخُلِ الْمَدِينَةَ فَسَلْ عَنْ فُلَانَةَ الْبَغِيَّةِ فَأَعْطِهَا دِرْهَمَيْنِ وَ نَلْ مِنْهَا قَالَ وَ مِنْ أَيْنَ لِي دِرْهَمَيْنِ مَا أَدْرِي مَا الدِّرْهَمَيْنِ فَتَنَاوَلَ الشَّيْطَانُ مِنْ تَحْتِ قَدَمِهِ دِرْهَمَيْنِ فَنَاوَلَهُ إِيَّاهُمَا فَقَامَ فَدَخَلَ الْمَدِينَةَ بِجَلَابِيبِهِ يَسْأَلُ عَنْ مَنْزِلِ فُلَانَةَ الْبَغِيَّةِ فَأَرْشَدَهُ النَّاسُ وَ ظَنُّوا أَنَّهُ جَاءَ يَعِظُهَا فَأَرْشَدُوهُ ",
          "فَجَاءَ إِلَيْهَا فَرَمَى إِلَيْهَا بِالدِّرْهَمَيْنِ وَ قَالَ قُومِي فَقَامَتْ فَدَخَلَتْ مَنْزِلَهَا وَ قَالَتِ ادْخُلْ وَ قَالَتْ إِنَّكَ جِئْتَنِي فِي هَيْئَةٍ لَيْسَ يُؤْتَى مِثْلِي فِي مِثْلِهَا فَأَخْبِرْنِي بِخَبَرِكَ فَأَخْبَرَهَا فَقَالَتْ لَهُ يَا عَبْدَ اللَّهِ إِنَّ تَرْكَ الذَّنْبِ أَهْوَنُ مِنْ طَلَبِ التَّوْبَةِ وَ لَيْسَ كُلُّ مَنْ طَلَبَ التَّوْبَةَ وَجَدَهَا وَ إِنَّمَا يَنْبَغِي أَنْ يَكُونَ هَذَا شَيْطَاناً مُثِّلَ لَكَ فَانْصَرِفْ فَإِنَّكَ لَا تَرَى شَيْئاً ",
          "فَانْصَرَفَ وَ مَاتَتْ مِنْ لَيْلَتِهَا فَأَصْبَحَتْ فَإِذَا عَلَى بَابِهَا مَكْتُوبٌ احْضُرُوا فُلَانَةَ فَإِنَّهَا مِنْ أَهْلِ الْجَنَّةِ فَارْتَابَ النَّاسُ فَمَكَثُوا ثَلَاثاً لَمْ يَدْفِنُوهَا ارْتِيَاباً فِي أَمْرِهَا فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى نَبِيٍّ مِنَ الْأَنْبِيَاءِ لَا أَعْلَمُهُ إِلَّا مُوسَى بْنَ عِمْرَانَ (عليه السلام) أَنِ ائْتِ فُلَانَةَ فَصَلِّ عَلَيْهَا وَ مُرِ النَّاسَ أَنْ يُصَلُّوا عَلَيْهَا فَإِنِّي قَدْ غَفَرْتُ لَهَا وَ أَوْجَبْتُ لَهَا الْجَنَّةَ بِتَثْبِيطِهَا عَبْدِي فُلَاناً عَنْ مَعْصِيَتِي."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473720\">H 15031</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, fromm Ali Bin Al-Hakam, from Muhammad Bin Sinan, from the one who informed him, the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>bu Abdullah</span><sup style=\"font-weight: normal\">asws</sup> has said: ‘There was a worshipper in the Children of Israel who never got involved with anything from the affairs of the world. Iblees<sup style=\"font-weight: normal\">la</sup> grunted a grunt, and his<sup style=\"font-weight: normal\">la</sup> army gathered towards him<sup style=\"font-weight: normal\">la</sup>. So he<sup style=\"font-weight: normal\">la</sup> said, ‘Who is the one for me<sup style=\"font-weight: normal\">la</sup> for that one?’ One of them said, ‘I am for him’. So he<sup style=\"font-weight: normal\">la</sup> said, ‘From where you will come to him?’ He said, ‘From the aspect of the women’. He<sup style=\"font-weight: normal\">la</sup> said, ‘This is not for him. He will never be tempted by the women’. ",
            "Another one said to him<sup style=\"font-weight: normal\">la</sup>, ‘I will be for him’. So he<sup style=\"font-weight: normal\">la</sup> said, ‘From where will you come to him?’ He said, ‘From the aspect of the drink and the pleasures’. He<sup style=\"font-weight: normal\">la</sup> said, ‘This is not for him. This cannot be by this’. Another one said, ‘I will be for him’. He<sup style=\"font-weight: normal\">la</sup> said, ‘From where will you come to him?’ From the aspect of the righteousness’. So he<sup style=\"font-weight: normal\">la</sup> said, ‘Go, for you are the master of it’. So he went to the place of the man. He settled himself near him and Prayed. ",
            "He<sup>asws</sup> said: ‘And the man used to sleep, and the Devil would not sleep, and he would rest, and the Devil would not rest. So the man turned towards him and belittled himself, and considered his deeds as short and small, so he said, ‘O servant of Allah<sup>azwj</sup>! With what thing do you get your strength from to perform these Prayers?’ He did not answer him. Then he repeated to him. He still did not answer him. Then he repeated it again to him, so he said, ‘O servant of Allah<sup>azwj</sup>! I committed a sin, and I am repentant from it. So now whenever I remember the sin, it gives me strength for the ‘Salat’ (Prayers)’. ",
            "He said, ‘Inform be about your sin until I understand it, and I can repent if I were to commit it in order to derive strength for the Prayers’. He said, ‘Enter the city and ask around for so and so female prostitute. Give her two Dirhams, and benefit from her’. He said, ‘I do not know where I would get two Dirhams from?’ So the Devil took two Dirhams from under his feet and gave these to him. So he stood up and entered the city wearing his robe, asking around for the house of that prostitute. The people guided him thinking that he is going there to advise her, so they guided him. ",
            "So he went to her and threw the two Dirhams at her and said, ‘Stand up’. So she stood up and entered inside her house, and she said, ‘Enter, and you have come to me in a dress which no one has come to me wearing the like of it. So, inform me of your news’. So he informed her. She said to him, ‘O servant of Allah<sup>azwj</sup>! The avoidance of sin is easier than repenting for it, and every repentant person does not find it (Accepted). But rather, it is befitting that he is a Devil who looks like you. So leave, for you will not see anything’.",
            "So he left, and she died that very night, and there was found written on her door, ‘Be cautious of this one, for she is from the inhabitants of the Paradise!’ The people became suspicious, so they waited for three days and did not bury her due to their doubts in her matter. So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto a Prophet<sup>as</sup> from the Prophets<sup>as</sup> unknown to anyone except for Musa Bin Imran<sup>as</sup> that: “Go to her and Pray over her and order the people to Prayed over her, for I<sup>azwj</sup> have Forgiven her, and Obligated the Paradise for her, for her discouraging My<sup>azwj</sup> servant from disobeying Me<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "585. Ahmad Bin Muhammad Bin Ahmad, from Ali Bin Al-Hassan, from Muhammad Bin Abdullah Bin Zurara, from Muhammad Bin Al-Fazeyl, from Abu Hamza, who has narrated the following: Abu Ja’far (a.s.) has said: ‘There used to be a man in the Children of Israel, who was a worshipper who was a derived person. Whenever he turned his attention to anything, he would achieve nothing from it. So his wife used to spend on him until there was nothing left. So there came a day from the days when she handed over to him a spinning blade and said to him, ‘There is nothing else in my possession apart from it, so go and sell it, and buy for us something to eat’. So he went with the spinning blade for selling it. He found the market to be closed, but found two prospective buyers. He stood by them, but they were not interested and left. So he said (to himself), ‘If I could come to this water, I could perform ablution from it and bathe in it’, and he left. He came up to the sea shore and there was a fisherman there who had cast his net. When he pulled it out, there was nothing in it except for one fish which had turned soft and rotten. So he said to him, ‘Sell me this fish and I will give you this blade which you can benefit by with your fishing net. He said, ‘Yes’. So he took the fish and handed over the blade to him, and left with the fish to his house. He informed his wife of the news, so she took the fish in order to prepare it. When she sliced it open, a pearl came out from the middle of it. So his wife called him and showed it to him. He took it with him and went to the market. He sold it for twenty thousand Dirhams, and left for his house with the wealth. He placed it therein. Then a beggar came and knocked on the door and said, ‘O people of the house, give charity to a poor one, Allah (azwj) will have Mercy upon you’. The man said, ‘Enter’. So he entered. He said, ‘Take one of the two bags’. So he took one of them and left. So his wife said to him, ‘Glory be to Allah (azwj)! As soon as we have ease, half of it goes away from us’. No sooner had she said that, the beggar knocked on the door. The man said to him, ‘Enter’. So he came and placed the bag back in its place, then said, ‘Congratulations! Eat it rightfully. But rather, I am an Angel from the Angels of your Lord (azwj). Your Lord (azwj) Wanted to Try you, so He (azwj) found you to be appreciative’. Then he left’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 589)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15270,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:51:2",
        "text": [
          "15032- أَحْمَدُ بْنُ مُحَمَّدِ [بْنِ أَحْمَدَ] عَنْ عَلِيِّ بْنِ الْحَسَنِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ زُرَارَةَ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ كَانَ فِي بَنِي إِسْرَائِيلَ رَجُلٌ عَابِدٌ وَ كَانَ مُحَارَفاً لَا يَتَوَجَّهُ فِي شَيْ‏ءٍ فَيُصِيبَ فِيهِ شَيْئاً فَأَنْفَقَتْ عَلَيْهِ امْرَأَتُهُ حَتَّى لَمْ يَبْقَ عِنْدَهَا شَيْ‏ءٌ ",
          "فَجَاعُوا يَوْماً مِنَ الْأَيَّامِ فَدَفَعَتْ إِلَيْهِ نَصْلًا مِنْ غَزْلٍ وَ قَالَتْ لَهُ مَا عِنْدِي غَيْرُهُ انْطَلِقْ فَبِعْهُ وَ اشْتَرِ لَنَا شَيْئاً نَأْكُلْهُ فَانْطَلَقَ بِالنَّصْلِ الْغَزْلِ لِيَبِيعَهُ فَوَجَدَ السُّوقَ قَدْ غُلِقَتْ وَ وَجَدَ الْمُشْتَرِينَ قَدْ قَامُوا وَ انْصَرَفُوا فَقَالَ لَوْ أَتَيْتُ هَذَا الْمَاءَ فَتَوَضَّأْتُ مِنْهُ وَ صَبَبْتُ عَلَيَّ مِنْهُ وَ انْصَرَفْتُ فَجَاءَ إِلَى الْبَحْرِ وَ إِذَا هُوَ بِصَيَّادٍ قَدْ أَلْقَى شَبَكَتَهُ فَأَخْرَجَهَا وَ لَيْسَ فِيهَا إِلَّا سَمَكَةٌ رَدِيَّةٌ قَدْ مَكَثَتْ عِنْدَهُ حَتَّى صَارَتْ رِخْوَةً مُنْتِنَةً فَقَالَ لَهُ بِعْنِي هَذِهِ السَّمَكَةَ وَ أُعْطِيكَ هَذَا الْغَزْلَ تَنْتَفِعُ بِهِ فِي شَبَكَتِكَ قَالَ نَعَمْ ",
          "فَأَخَذَ السَّمَكَةَ وَ دَفَعَ إِلَيْهِ الْغَزْلَ وَ انْصَرَفَ بِالسَّمَكَةِ إِلَى مَنْزِلِهِ فَأَخْبَرَ زَوْجَتَهُ الْخَبَرَ فَأَخَذَتِ السَّمَكَةَ لِتُصْلِحَهَا فَلَمَّا شَقَّتْهَا بَدَتْ مِنْ جَوْفِهَا لُؤْلُؤَةٌ فَدَعَتْ زَوْجَهَا فَأَرَتْهُ إِيَّاهَا فَأَخَذَهَا فَانْطَلَقَ بِهَا إِلَى السُّوقِ فَبَاعَهَا بِعِشْرِينَ أَلْفَ دِرْهَمٍ وَ انْصَرَفَ إِلَى مَنْزِلِهِ بِالْمَالِ فَوَضَعَهُ ",
          "فَإِذَا سَائِلٌ يَدُقُّ الْبَابَ وَ يَقُولُ يَا أَهْلَ الدَّارِ تَصَدَّقُوا رَحِمَكُمُ اللَّهُ عَلَى الْمِسْكِينِ فَقَالَ لَهُ الرَّجُلُ ادْخُلْ فَدَخَلَ فَقَالَ لَهُ خُذْ إِحْدَى الْكِيسَيْنِ فَأَخَذَ إِحْدَاهُمَا وَ انْطَلَقَ فَقَالَتْ لَهُ امْرَأَتُهُ سُبْحَانَ اللَّهِ بَيْنَمَا نَحْنُ مَيَاسِيرُ إِذْ ذَهَبْتَ بِنِصْفِ يَسَارِنَا فَلَمْ يَكُنْ ذَلِكَ بِأَسْرَعَ مِنْ أَنْ دَقَّ السَّائِلُ الْبَابَ فَقَالَ لَهُ الرَّجُلُ ادْخُلْ فَدَخَلَ فَوَضَعَ الْكِيسَ فِي مَكَانِهِ ثُمَّ قَالَ كُلْ هَنِيئاً مَرِيئاً إِنَّمَا أَنَا مَلَكٌ مِنْ مَلَائِكَةِ رَبِّكَ إِنَّمَا أَرَادَ رَبُّكَ أَنْ يَبْلُوَكَ فَوَجَدَكَ شَاكِراً ثُمَّ ذَهَبَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473721\">H 15032</a> – Ahmad Bin Muhammad Bin Ahmad, from Ali Bin Al-Hassan, from Muhammad Bin Abdullah Bin Zurara, from Muhammad Bin Al-Fazeyl, from Abu Hamza, who has narrated the following:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>asws</sup> has said: ‘There used to be a man in the Children of Israel, who was a worshipper who was a derived person. Whenever he turned his attention to anything, he would achieve nothing from it. So his wife used to spend on him until there was nothing left.",
            "So there came a day from the days when she handed over to him a spinning blade and said to him, ‘There is nothing else in my possession apart from it, so go and sell it, and buy for us something to eat’. So he went with the spinning blade for selling it. He found the market to be closed, but found two prospective buyers. He stood by them, but they were not interested and left. So he said (to himself), ‘If I could come to this water, I could perform ablution from it and bathe in it’, and he left. He came up to the sea shore and there was a fisherman there who had cast his net. When he pulled it out, there was nothing in it except for one fish which had turned soft and rotten. So he said to him, ‘Sell me this fish and I will give you this blade which you can benefit by with your fishing net. He said, ‘Yes’. ",
            "So he took the fish and handed over the blade to him, and left with the fish to his house. He informed his wife of the news, so she took the fish in order to prepare it. When she sliced it open, a pearl came out from the middle of it. So his wife called him and showed it to him. He took it with him and went to the market. He sold it for twenty thousand Dirhams, and left for his house with the wealth. He placed it therein.",
            "Then a beggar came and knocked on the door and said, ‘O people of the house, give charity to a poor one, Allah<sup>azwj</sup> will have Mercy upon you’. The man said, ‘Enter’. So he entered. He said, ‘Take one of the two bags’. So he took one of them and left. So his wife said to him, ‘Glory be to Allah<sup>azwj</sup>! As soon as we have ease, half of it goes away from us’. No sooner had she said that, the beggar knocked on the door. The man said to him, ‘Enter’. So he came and placed the bag back in its place, then said, ‘Congratulations! Eat it rightfully. But rather, I am an Angel from the Angels of your Lord<sup>azwj</sup>. Your Lord<sup>azwj</sup> Wanted to Try you, so He<sup>azwj</sup> found you to be appreciative’. Then he left’. "
          ],
          "en.sarwar": [
            "586. Ahmad Bin Muhammad, from Sa’d Bin Al-Munzar Bin Muhammad, from his father, from his grandfather, from Muhammad Bin Al-Husayn, from his grandfather, from his father who said: ‘Amir-ul-Momineen (a.s.) gave a sermon’. (And someone else has also reported it without the above chain and mentioned that he (a.s.) gave the sermon as Zeeqaar). So he (a.s.) Praised Allah (azwj) and Extolled Him (azwj), then said: ‘Having said that, Allah (azwj) Blessed and High Sent Muhammad (saww) to take His (azwj) servants out from worshipping His (azwj) servants to worship Him (azwj), and from the covenants of His (azwj) servants to His (azwj) Covenant, and from obedience to His (azwj) servants to be in obedience to Him (azwj), and from the Wilayah of His (azwj) servants to His (azwj) Wilayah by good news and warnings. And he (saww) called to Allah (azwj) by His (azwj) Permission, and was an illuminating lamp, promising, and beginning, and excusing, and warning by the Judgements that he (saww) had decided, and decided what he (saww) had judged, and a Criterion which differentiated, and a Quran which Proved Him (azwj), so the servants would come to know their Lord (azwj) which they were ignorant of, and accept by it which they struggled against, and Establish Him (azwj) after having denied Him (azwj). So He (azwj) illustrated to them His (azwj) Glory in His (azwj) Book without them having seen Him (azwj). So he (azwj) Showed them His (azwj) Forbearance, how He (azwj) Forbears, and Showed them His (azwj) Forgiveness how He (azwj) Forgives, and Showed them His (azwj) Power and how Powerful He (azwj) is, and Frightened them from His (azwj) Authority, and how He (azwj) Created what He (azwj) Created from the Signs, and how He (azwj) Destroys the one whom He (azwj) Destroys from the disobeyers by the examples. And how he (azwj) Repelled the one whom He (azwj) repelled by the Torments, and how he (azwj) Sustained and Guided, and Granted, and Showed them His (azwj) Wisdom how Wise He (azwj) is, and Patient until they heard what they heard and saw. So Allah (azwj) Sent Muhammad (saww) with that. Then there will come upon you, from after me (a.s.) an era, and there will be nothing in that era which will be more hidden than the truth, nor anything more apparent than the falsehood, and nothing more numerous than the lies against Allah (azwj) the High and His (azwj) Messenger (saww). And there will be nothing in that era which will be more worthless than the Book when it is recited as it deserves to be recited, nor anything more worthy of selling and expensive in price than the Book if it is altered from its places. And there will be nothing in the servants nor in the cities anything which is more prevented than the good nor anything more recognised than the evil. And there will be nothing considered to be more immoral and evil, and no worse penalty than for the guidance in the presence of misguidance. During that era, those who bear the Book will be rejected and the memorizers will forget to the extent that they will interpret it in accordance with their own desires, and they would have inherited that from their forefathers, and they will act with alterations in the Book, lying and rejecting. So they will sell it for a cheap price, and they would be from the ascetics. So the Book and the People of the Book during that era would be two castaway fugitives, and two accompanying companions in one road not finding any protector or shelter. They are both good for each other and Whom (azwj) they work for. So the Book and the People of the Book during that era would be in the people but not be among (part of) them, and will be with them but still not be with them, and that is because the misguidance is not in harmony with the guidance. And if they meet, and the people would have met upon the sectarianism, and would separate from the group. They would give the rule of the matters of their Religion to the one who acts with regards to them by plotting, and the evil, and the bribery, and the murder, as if they are the imams (leaders) of the Book then the Book is not their imam (leading them). There will not remain in their possession from the truth except for its name, and they will not recognise anything from the Book except for its calligraphy and design. The entering one will enter (the religion) when he hears for the Judgements of the Quran, but he will not be satisfied in gatherings until he exits from the Religion. He will transfer from a Religion of a king to a Religion of a king, and from the wilayah of a king to a wilayah of a king, and from obedience of a king to the obedience of a king, and from the covenant of a king to a covenant of a king. So Allah (azwj) Lures them away from where they do not know, with good expectations and the hope until they give birth in the disobedience, and they make a religion with the tyranny, and the Book did not benefit them anything, and they will be wandering and straying, for they would have made a religion without the Religion of Allah (azwj) Mighty and Majestic, and for the sake of other than Allah (azwj). Their Masjid during that era would be constructed from misguidance, ruination of guidance. So its reciters and its builders would be the most failed ones among the creatures of Allah (azwj) and His (azwj) creatures. It is from their presence that misguidance would flow and return back to them. Thus, presence in their Masjids, and walking towards them would be blasphemy (Kufr) with Allah (azwj) the Magnificent, except for the one who walks towards it while being aware of their misguidance. Therefore, due to their actions upon that way, their Masjids would have become ruination of the guidance, and well-built in the misguidance, for the Sunnah of Allah (azwj) would have been changed, and His (azwj) Limits transgressed against. They will not be calling to the guidance, nor distribution the booty (Al-Fey), nor fulfilling the responsibilities. They will be calling the one from among them who would be killed upon that as a martyr, thus forging a lie against Allah (azwj), and the struggle, and they would be needless from the knowledge due to their ignorance, and from before they mutilated the righteous ones with every mutilation, and named their truthfulness to Allah (azwj) as libel, and apply the punishment for the sins to the good deeds. And Allah (azwj) Mighty and Majestic has Sent to you all a Messenger (saww) from yourselves. It grieves him (saww) to see you suffering, and he (saww) is kind and merciful to the Believers. And He (azwj) Revealed upon him (saww) a Mighty Book. “[41:42] Falsehood shall not come to it from before it nor from behind it; a revelation from the Wise, the Praised One” “[39:28] An Arabic Quran without any crookedness, that they may guard (against evil)” “[36:70] That it may warn him who would have life, and (that) the word may prove true against the unbelievers”. So do not let your hopes to distract you, nor consider the term (of life) to be prolonged, for the ones before you were destroyed for having long hopes against their approaching deadline until the Promised time (of death) descended upon them, and repulsed from them the excuses, and raised from them the repentance, and brought with it the calamity and the resentment. And Allah (azwj) has Preached to you with the Promise, and Made Decisive for you the speech, and Taught you the Sunnah, and Explained for you the Program to remove the illness, and Urged upon the Remembrance, and Evidence to the Salvation. And the one who act for the sake of Allah (azwj) and take His (azwj) Words as Evidence, would be Guided until he is strong, and Made to understand the right way, and Guided and facilitated to the good. So the one under the Protection of Allah (azwj) is safely preserved, and His (azwj) enemies would be in fearful and pretentious. So be cautious of Allah (azwj) through the frequency of the Remembrance, and be fearful from Him (azwj) by the piety, and get closer to Him (azwj) by the obedience, for He (azwj) is Close by and Answers. Allah (azwj) Mighty and Majestic Said: “[2:186] And when My servants ask you concerning Me, then surely I am very near; I answer the prayer of the suppliant when he calls on Me, so they should answer My call and believe in Me that they may walk in the right way”. So you must respond to Allah (azwj) and believe in Him (azwj), and Magnify Allah (azwj). It does not befit one who recognises the Greatness of Allah (azwj) to consider himself as significant. So the highest of the recognition of the Greatness of Allah (azwj) is being modest to Him (azwj), and the highest honour of the one who knows the Majesty of Allah (azwj) is to be humble to Him (azwj), and the most secure is the one who knows the Power of Allah (azwj) and submits to Him (azwj). So you will not be denying yourselves after the Guidance of the understanding, nor will you be going astray after the Guidance. So do not flee from the truth like the fleeing of the healthy ones from the one with the scabies, and the healthy ones from the sick. And know that you will never recognise the guidance until you recognise the ones who have left it, and will never take to the Covenant of the Book until you recognise the ones who broke it, and will never attach yourselves to it until you recognise the ones who have abandoned it, and will never be able to recite the Book as it deserves to be recited until you recognise the ones who altered it, and will never recognise the misguidance until you recognise the Guidance, and will never recognise the piety until you recognise the ones who abused it. So when you recognise that, you will recognise the innovations, and the impersonations, and you will see the fabrications against Allah (azwj) and against His (azwj) Messenger (saww), and the alterations to His (azwj) book, and you will see how Allah (azwj) Guided the one whom He (azwj) Guided. So do not let those who have no knowledge keep you ignorant. The Knowledge of the Quran cannot be known as to what it is except by the one (a.s.) who has tasted its food. So it was by the knowledge that his ignorance got to know, and his blindness got to visualise, and his deafness got to hear, and gained awareness of what knowledge had passed by and got revived by it after its death. And he established the good deeds in the Presence of Allah (azwj) and deleted the sins by it. And it was by it (knowledge) that he realised the Pleasure from Allah (azwj) Blessed and High. So, seek that from its special people, for they (a.s.) are the specialists, lights to be illuminated by, and the Imams (a.s.) to be followed. And they (a.s.) are the life for the knowledge and death for the ignorance. They (a.s.) are the ones (a.s.) whose Judgements inform you of their (a.s.) knowledge, and their (a.s.) silence about their (a.s.) speech, and their (a.s.) apparent about their (a.s.) hidden. They (a.s.) do not oppose the religion nor do they (a.s.) differ with regards to it. For it (knowledge) is a truthful witness between them (a.s.), and a silent speaker. It is from their (a.s.) glories to testify to the truth, and to be truthful reporters, neither opposing the truth nor differing with regards to it. The Precedence is for them (a.s.) from Allah (azwj), and Allah (azwj) Mighty and Majestic has Passed a Truthful Judgement for them (a.s.). And in that is a reminder for the speakers. So bear in mind the truth if you hear it with a caring mind and not with a narrative mind, for the narrators of the Book are many, and its guardians are few. And Allah (azwj) is the Best Supporter’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:51",
  "kind": "verse_list"
}