{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 52"
        },
        "path": "/books/al-kafi:8:1:52",
        "titles": {
          "ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )",
          "en": "A SERMON OF AMIR-UL-MOMINEEN<sup>asws</sup>"
        }
      }
    ],
    "index": 2323,
    "local_index": 52,
    "nav": {
      "prev": {
        "indexed_titles": {
          "en": "Chapter 51"
        },
        "path": "/books/al-kafi:8:1:51",
        "titles": {
          "ar": "حَدِيثُ الْعَابِدِ",
          "en": "HADEETH OF THE WORSHIPPER"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:52",
    "titles": {
      "ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )",
      "en": "A SERMON OF AMIR-UL-MOMINEEN<sup>asws</sup>"
    },
    "verse_count": 11,
    "verse_start_index": 15270,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 601)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15271,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:52:1",
        "relations": {
          "Mentions": [
            "/books/quran:2:186",
            "/books/quran:41:42",
            "/books/quran:39:28",
            "/books/quran:36:70"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">15033</span>- أَحْمَدُ بْنُ مُحَمَّدٍ</span> عَنْ سَعْدِ بْنِ الْمُنْذِرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ أَبِيهِ قَالَ خَطَبَ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) [وَ رَوَاهَا غَيْرُهُ بِغَيْرِ هَذَا الْإِسْنَادِ وَ ذَكَرَ أَنَّهُ خَطَبَ بِذِي قَارٍ] ",
          "فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ ثُمَّ قَالَ أَمَّا بَعْدُ فَإِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى بَعَثَ مُحَمَّداً (صلى الله عليه وآله  بِالْحَقِّ لِيُخْرِجَ عِبَادَهُ مِنْ عِبَادَةِ عِبَادِهِ إِلَى عِبَادَتِهِ وَ مِنْ عُهُودِ عِبَادِهِ إِلَى عُهُودِهِ وَ مِنْ طَاعَةِ عِبَادِهِ إِلَى طَاعَتِهِ وَ مِنْ وَلَايَةِ عِبَادِهِ إِلَى وَلَايَتِهِ بَشِيراً وَ نَذِيراً وَ دَاعِياً إِلَى اللَّهِ بِإِذْنِهِ وَ سِرَاجاً مُنِيراً عَوْداً وَ بَدْءاً وَ عُذْراً وَ نُذْراً بِحُكْمٍ قَدْ فَصَّلَهُ وَ تَفْصِيلٍ قَدْ أَحْكَمَهُ وَ فُرْقَانٍ قَدْ فَرَقَهُ وَ قُرْآنٍ قَدْ بَيَّنَهُ لِيَعْلَمَ الْعِبَادُ رَبَّهُمْ إِذْ جَهِلُوهُ وَ لِيُقِرُّوا بِهِ إِذْ جَحَدُوهُ وَ لِيُثْبِتُوهُ بَعْدَ إِذْ أَنْكَرُوهُ",
          "فَتَجَلَّى لَهُمْ سُبْحَانَهُ فِي كِتَابِهِ مِنْ غَيْرِ أَنْ يَكُونُوا رَأَوْهُ فَأَرَاهُمْ حِلْمَهُ كَيْفَ حَلُمَ وَ أَرَاهُمْ عَفْوَهُ كَيْفَ عَفَا وَ أَرَاهُمْ قُدْرَتَهُ كَيْفَ قَدَرَ وَ خَوَّفَهُمْ مِنْ سَطْوَتِهِ وَ كَيْفَ خَلَقَ مَا خَلَقَ مِنَ الْآيَاتِ وَ كَيْفَ مَحَقَ مَنْ مَحَقَ مِنَ الْعُصَاةِ بِالْمَثُلَاتِ وَ احْتَصَدَ مَنِ احْتَصَدَ بِالنَّقِمَاتِ وَ كَيْفَ رَزَقَ وَ هَدَى وَ أَعْطَى وَ أَرَاهُمْ حُكْمَهُ كَيْفَ حَكَمَ وَ صَبَرَ حَتَّى يَسْمَعَ مَا يَسْمَعُ وَ يَرَى فَبَعَثَ اللَّهُ عَزَّ وَ جَلَّ مُحَمَّداً (صلى الله عليه وآله) بِذَلِكَ",
          "ثُمَّ إِنَّهُ سَيَأْتِي عَلَيْكُمْ مِنْ بَعْدِي زَمَانٌ لَيْسَ فِي ذَلِكَ الزَّمَانِ شَيْ‏ءٌ أَخْفَى مِنَ الْحَقِّ وَ لَا أَظْهَرَ مِنَ الْبَاطِلِ وَ لَا أَكْثَرَ مِنَ الْكَذِبِ عَلَى اللَّهِ تَعَالَى وَ رَسُولِهِ (صلى الله عليه وآله) وَ لَيْسَ عِنْدَ أَهْلِ ذَلِكَ الزَّمَانِ سِلْعَةٌ أَبْوَرَ مِنَ الْكِتَابِ إِذَا تُلِيَ حَقَّ تِلَاوَتِهِ وَ لَا سِلْعَةٌ أَنْفَقَ بَيْعاً وَ لَا أَغْلَى ثَمَناً مِنَ الْكِتَابِ إِذَا حُرِّفَ عَنْ مَوَاضِعِهِ وَ لَيْسَ فِي الْعِبَادِ وَ لَا فِي الْبِلَادِ شَيْ‏ءٌ هُوَ أَنْكَرَ مِنَ الْمَعْرُوفِ وَ لَا أَعْرَفَ مِنَ الْمُنْكَرِ وَ لَيْسَ فِيهَا فَاحِشَةٌ أَنْكَرَ وَ لَا عُقُوبَةٌ أَنْكَى مِنَ الْهُدَى عِنْدَ الضَّلَالِ فِي ذَلِكَ الزَّمَانِ فَقَدْ نَبَذَ الْكِتَابَ حَمَلَتُهُ وَ تَنَاسَاهُ حَفَظَتُهُ حَتَّى تَمَالَتْ بِهِمُ الْأَهْوَاءُ وَ تَوَارَثُوا ذَلِكَ مِنَ الْآبَاءِ وَ عَمِلُوا بِتَحْرِيفِ الْكِتَابِ كَذِباً وَ تَكْذِيباً فَبَاعُوهُ بِالْبَخْسِ وَ كَانُوا فِيهِ مِنَ الزَّاهِدِينَ ",
          "فَالْكِتَابُ وَ أَهْلُ الْكِتَابِ فِي ذَلِكَ الزَّمَانِ طَرِيدَانِ مَنْفِيَّانِ وَ صَاحِبَانِ مُصْطَحِبَانِ فِي طَرِيقٍ وَاحِدٍ لَا يَأْوِيهِمَا مُؤْوٍ فَحَبَّذَا ذَانِكَ الصَّاحِبَانِ وَاهاً لَهُمَا وَ لِمَا يَعْمَلَانِ لَهُ فَالْكِتَابُ وَ أَهْلُ الْكِتَابِ فِي ذَلِكَ الزَّمَانِ فِي النَّاسِ وَ لَيْسُوا فِيهِمْ وَ مَعَهُمْ وَ لَيْسُوا مَعَهُمْ وَ ذَلِكَ لِأَنَّ الضَّلَالَةَ لَا تُوَافِقُ الْهُدَى ",
          "وَ إِنِ اجْتَمَعَا وَ قَدِ اجْتَمَعَ الْقَوْمُ عَلَى الْفُرْقَةِ وَ افْتَرَقُوا عَنِ الْجَمَاعَةِ قَدْ وَلَّوْا أَمْرَهُمْ وَ أَمْرَ دِينِهِمْ مَنْ يَعْمَلُ فِيهِمْ بِالْمَكْرِ وَ الْمُنْكَرِ وَ الرِّشَا وَ الْقَتْلِ كَأَنَّهُمْ أَئِمَّةُ الْكِتَابِ وَ لَيْسَ الْكِتَابُ إِمَامَهُمْ لَمْ يَبْقَ عِنْدَهُمْ مِنَ الْحَقِّ إِلَّا اسْمُهُ وَ لَمْ يَعْرِفُوا مِنَ الْكِتَابِ إِلَّا خَطَّهُ وَ زَبْرَهُ ",
          "يَدْخُلُ الدَّاخِلُ لِمَا يَسْمَعُ مِنْ حِكَمِ الْقُرْآنِ فَلَا يَطْمَئِنُّ جَالِساً حَتَّى يَخْرُجَ مِنَ الدِّينِ يَنْتَقِلُ مِنْ دِينِ مَلِكٍ إِلَى دِينِ مَلِكٍ وَ مِنْ وَلَايَةِ مَلِكٍ إِلَى وَلَايَةِ مَلِكٍ وَ مِنْ طَاعَةِ مَلِكٍ إِلَى طَاعَةِ مَلِكٍ وَ مِنْ عُهُودِ مَلِكٍ إِلَى عُهُودِ مَلِكٍ فَاسْتَدْرَجَهُمُ اللَّهُ تَعَالَى مِنْ حَيْثُ لَا يَعْلَمُونَ وَ إِنَّ كَيْدَهُ مَتِينٌ بِالْأَمَلِ وَ الرَّجَاءِ حَتَّى تَوَالَدُوا فِي الْمَعْصِيَةِ وَ دَانُوا بِالْجَوْرِ وَ الْكِتَابُ لَمْ يَضْرِبْ عَنْ شَيْ‏ءٍ مِنْهُ صَفْحاً ضُلَّالًا تَائِهِينَ قَدْ دَانُوا بِغَيْرِ دِينِ اللَّهِ عَزَّ وَ جَلَّ وَ أَدَانُوا لِغَيْرِ اللَّهِ",
          "مَسَاجِدُهُمْ فِي ذَلِكَ الزَّمَانِ عَامِرَةٌ مِنَ الضَّلَالَةِ خَرِبَةٌ مِنَ الْهُدَى قَدْ بُدِّلَ فِيهَا مِنَ الْهُدَى فَقُرَّاؤُهَا وَ عُمَّارُهَا أَخَائِبُ خَلْقِ اللَّهِ وَ خَلِيقَتِهِ مِنْ عِنْدِهِمْ جَرَتِ الضَّلَالَةُ وَ إِلَيْهِمْ تَعُودُ فَحُضُورُ مَسَاجِدِهِمْ وَ الْمَشْيُ إِلَيْهَا كُفْرٌ بِاللَّهِ الْعَظِيمِ إِلَّا مَنْ مَشَى إِلَيْهَا وَ هُوَ عَارِفٌ بِضَلَالِهِمْ فَصَارَتْ مَسَاجِدُهُمْ مِنْ فِعَالِهِمْ عَلَى ذَلِكَ النَّحْوِ خَرِبَةً مِنَ الْهُدَى عَامِرَةً مِنَ الضَّلَالَةِ قَدْ بُدِّلَتْ سُنَّةُ اللَّهِ وَ تُعُدِّيَتْ حُدُودُهُ",
          "وَ لَا يَدْعُونَ إِلَى الْهُدَى وَ لَا يَقْسِمُونَ الْفَيْ‏ءَ وَ لَا يُوفُونَ بِذِمَّةٍ يَدْعُونَ الْقَتِيلَ مِنْهُمْ عَلَى ذَلِكَ شَهِيداً قَدْ أَتَوُا اللَّهَ بِالِافْتِرَاءِ وَ الْجُحُودِ وَ اسْتَغْنَوْا بِالْجَهْلِ عَنِ الْعِلْمِ وَ مِنْ قَبْلُ مَا مَثَّلُوا بِالصَّالِحِينَ كُلَّ مُثْلَةٍ وَ سَمَّوْا صِدْقَهُمْ عَلَى اللَّهِ فِرْيَةً وَ جَعَلُوا فِي الْحَسَنَةِ الْعُقُوبَةَ السَّيِّئَةَ",
          "وَ قَدْ بَعَثَ اللَّهُ عَزَّ وَ جَلَّ إِلَيْكُمْ رَسُولًا مِنْ أَنْفُسِكُمْ عَزِيزٌ عَلَيْهِ ما عَنِتُّمْ حَرِيصٌ عَلَيْكُمْ بِالْمُؤْمِنِينَ رَؤُفٌ رَحِيمٌ (صلى الله عليه وآله) وَ أَنْزَلَ عَلَيْهِ كِتَاباً عَزِيزاً لا يَأْتِيهِ الْباطِلُ مِنْ بَيْنِ يَدَيْهِ وَ لا مِنْ خَلْفِهِ تَنْزِيلٌ مِنْ حَكِيمٍ حَمِيدٍ قُرْآناً عَرَبِيّاً غَيْرَ ذِي عِوَجٍ لِيُنْذِرَ مَنْ كانَ حَيًّا وَ يَحِقَّ الْقَوْلُ عَلَى الْكافِرِينَ",
          "فَلَا يُلْهِيَنَّكُمُ الْأَمَلُ وَ لَا يَطُولَنَّ عَلَيْكُمُ الْأَجَلُ فَإِنَّمَا أَهْلَكَ مَنْ كَانَ قَبْلَكُمْ أَمَدُ أَمَلِهِمْ وَ تَغْطِيَةُ الْآجَالِ عَنْهُمْ حَتَّى نَزَلَ بِهِمُ الْمَوْعُودُ الَّذِي تُرَدُّ عَنْهُ الْمَعْذِرَةُ وَ تُرْفَعُ عَنْهُ التَّوْبَةُ وَ تَحُلُّ مَعَهُ الْقَارِعَةُ وَ النَّقِمَةُ وَ قَدْ أَبْلَغَ اللَّهُ عَزَّ وَ جَلَّ إِلَيْكُمْ بِالْوَعْدِ وَ فَصَّلَ لَكُمُ الْقَوْلَ وَ عَلَّمَكُمُ السُّنَّةَ وَ شَرَحَ لَكُمُ الْمَنَاهِجَ لِيُزِيحَ الْعِلَّةَ وَ حَثَّ عَلَى الذِّكْرِ وَ دَلَّ عَلَى النَّجَاةِ",
          "وَ إِنَّهُ مَنِ انْتَصَحَ لِلَّهِ وَ اتَّخَذَ قَوْلَهُ دَلِيلًا هَدَاهُ لِلَّتِي هِيَ أَقْوَمُ وَ وَفَّقَهُ لِلرَّشَادِ وَ سَدَّدَهُ وَ يَسَّرَهُ لِلْحُسْنَى فَإِنَّ جَارَ اللَّهِ آمِنٌ مَحْفُوظٌ وَ عَدُوَّهُ خَائِفٌ مَغْرُورٌ فَاحْتَرِسُوا مِنَ اللَّهِ عَزَّ وَ جَلَّ بِكَثْرَةِ الذِّكْرِ وَ اخْشَوْا مِنْهُ بِالتُّقَى وَ تَقَرَّبُوا إِلَيْهِ بِالطَّاعَةِ فَإِنَّهُ قَرِيبٌ مُجِيبٌ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ إِذا سَأَلَكَ عِبادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ فَلْيَسْتَجِيبُوا لِي وَ لْيُؤْمِنُوا بِي لَعَلَّهُمْ يَرْشُدُونَ",
          "فَاسْتَجِيبُوا لِلَّهِ وَ آمِنُوا بِهِ وَ عَظِّمُوا اللَّهَ الَّذِي لَا يَنْبَغِي لِمَنْ عَرَفَ عَظَمَةَ اللَّهِ أَنْ يَتَعَظَّمَ فَإِنَّ رِفْعَةَ الَّذِينَ يَعْلَمُونَ مَا عَظَمَةُ اللَّهِ أَنْ يَتَوَاضَعُوا لَهُ وَ عِزَّ الَّذِينَ يَعْلَمُونَ مَا جَلَالُ اللَّهِ أَنْ يَذِلُّوا لَهُ وَ سَلَامَةَ الَّذِينَ يَعْلَمُونَ مَا قُدْرَةُ اللَّهِ أَنْ يَسْتَسْلِمُوا لَهُ فَلَا يُنْكِرُونَ أَنْفُسَهُمْ بَعْدَ حَدِّ الْمَعْرِفَةِ وَ لَا يَضِلُّونَ بَعْدَ الْهُدَى فَلَا تَنْفِرُوا مِنَ الْحَقِّ نِفَارَ الصَّحِيحِ مِنَ الْأَجْرَبِ وَ الْبَارِئِ مِنْ ذِي السُّقْمِ",
          "وَ اعْلَمُوا أَنَّكُمْ لَنْ تَعْرِفُوا الرُّشْدَ حَتَّى تَعْرِفُوا الَّذِي تَرَكَهُ وَ لَمْ تَأْخُذُوا بِمِيثَاقِ الْكِتَابِ حَتَّى تَعْرِفُوا الَّذِي نَقَضَهُ وَ لَنْ تَمَسَّكُوا بِهِ حَتَّى تَعْرِفُوا الَّذِي نَبَذَهُ وَ لَنْ تَتْلُوا الْكِتَابَ حَقَّ تِلَاوَتِهِ حَتَّى تَعْرِفُوا الَّذِي حَرَّفَهُ وَ لَنْ تَعْرِفُوا الضَّلَالَةَ حَتَّى تَعْرِفُوا الْهُدَى وَ لَنْ تَعْرِفُوا التَّقْوَى حَتَّى تَعْرِفُوا الَّذِي تَعَدَّى",
          "فَإِذَا عَرَفْتُمْ ذَلِكَ عَرَفْتُمُ الْبِدَعَ وَ التَّكَلُّفَ وَ رَأَيْتُمُ الْفِرْيَةَ عَلَى اللَّهِ وَ عَلَى رَسُولِهِ وَ التَّحْرِيفَ لِكِتَابِهِ وَ رَأَيْتُمْ كَيْفَ هَدَى اللَّهُ مَنْ هَدَى فَلَا يُجْهِلَنَّكُمُ الَّذِينَ لَا يَعْلَمُونَ إِنَّ عِلْمَ الْقُرْآنِ لَيْسَ يَعْلَمُ مَا هُوَ إِلَّا مَنْ ذَاقَ طَعْمَهُ",
          "فَعُلِّمَ بِالْعِلْمِ جَهْلَهُ وَ بُصِّرَ بِهِ عَمَاهُ وَ سُمِّعَ بِهِ صَمَمَهُ وَ أَدْرَكَ بِهِ عِلْمَ مَا فَاتَ وَ حَيِيَ بِهِ بَعْدَ إِذْ مَاتَ وَ أَثْبَتَ عِنْدَ اللَّهِ عَزَّ ذِكْرُهُ الْحَسَنَاتِ وَ مَحَا بِهِ السَّيِّئَاتِ وَ أَدْرَكَ بِهِ رِضْوَاناً مِنَ اللَّهِ تَبَارَكَ وَ تَعَالَى",
          "فَاطْلُبُوا ذَلِكَ مِنْ عِنْدِ أَهْلِهِ خَاصَّةً فَإِنَّهُمْ خَاصَّةً نُورٌ يُسْتَضَاءُ بِهِ وَ أَئِمَّةٌ يُقْتَدَى بِهِمْ وَ هُمْ عَيْشُ الْعِلْمِ وَ مَوْتُ الْجَهْلِ هُمُ الَّذِينَ يُخْبِرُكُمْ حُكْمُهُمْ عَنْ عِلْمِهِمْ وَ صَمْتُهُمْ عَنْ مَنْطِقِهِمْ وَ ظَاهِرُهُمْ عَنْ بَاطِنِهِمْ لَا يُخَالِفُونَ الدِّينَ وَ لَا يَخْتَلِفُونَ فِيهِ فَهُوَ بَيْنَهُمْ شَاهِدٌ صَادِقٌ وَ صَامِتٌ نَاطِقٌ فَهُمْ مِنْ شَأْنِهِمْ شُهَدَاءُ بِالْحَقِّ وَ مُخْبِرٌ صَادِقٌ لَا يُخَالِفُونَ الْحَقَّ وَ لَا يَخْتَلِفُونَ فِيهِ ",
          "قَدْ خَلَتْ لَهُمْ مِنَ اللَّهِ السَّابِقَةُ وَ مَضَى فِيهِمْ مِنَ اللَّهِ عَزَّ وَ جَلَّ حُكْمٌ صَادِقٌ وَ فِي ذَلِكَ ذِكْرَى لِلذَّاكِرِينَ فَاعْقِلُوا الْحَقَّ إِذَا سَمِعْتُمُوهُ عَقْلَ رِعَايَةٍ وَ لَا تَعْقِلُوهُ عَقْلَ رِوَايَةٍ فَإِنَّ رُوَاةَ الْكِتَابِ كَثِيرٌ وَ رُعَاتَهُ قَلِيلٌ وَ اللَّهُ الْمُسْتَعَانُ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473723\">H 15033</a> – Ahmad Bin Muhammad, from Sa’d Bin Al-Munzar Bin Muhammad, from his father, from his grandfather, from Muhammad Bin Al-Husayn, from his grandfather, from his father who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>mir-ul-Momineen</span><sup>asws</sup> gave a sermon’. (And someone else has also reported it without the above chain and mentioned that he<sup>asws</sup> gave the sermon as Zeeqaar).",
            "So he<sup>asws</sup> Praised Allah<sup>azwj</sup> and Extolled Him<sup>azwj</sup>, then said: ‘Having said that, Allah<sup>azwj</sup> Blessed and High Sent Muhammad<sup>saww</sup> to take His<sup>azwj</sup> servants out from worshipping His<sup>azwj</sup> servants to worship Him<sup>azwj</sup>, and from the covenants of His<sup>azwj</sup> servants to His<sup>azwj</sup> Covenant, and from obedience to His<sup>azwj</sup> servants to be in obedience to Him<sup>azwj</sup>, and from the Wilayah of His<sup>azwj</sup> servants to His<sup>azwj</sup> Wilayah by good news and warnings. ",
            "And he<sup>saww</sup> called to Allah<sup>azwj</sup> by His<sup>azwj</sup> Permission, and was an illuminating lamp, promising, and beginning, and excusing, and warning by the Judgements that he<sup>saww</sup> had decided, and decided what he<sup>saww</sup> had judged, and a Criterion which differentiated, and a Quran which Proved Him<sup>azwj</sup>, so the servants would come to know their Lord<sup>azwj</sup> which they were ignorant of, and accept by it which they struggled against, and Establish Him<sup>azwj</sup> after having denied Him<sup>azwj</sup>.",
            "So He<sup>azwj</sup> illustrated to them His<sup>azwj</sup> Glory in His<sup>azwj</sup> Book without them having seen Him<sup>azwj</sup>. So he<sup>azwj</sup> Showed them His<sup>azwj</sup> Forbearance, how He<sup>azwj</sup> Forbears, and Showed them His<sup>azwj</sup> Forgiveness how He<sup>azwj</sup> Forgives, and Showed them His<sup>azwj</sup> Power and how Powerful He<sup>azwj</sup> is, and Frightened them from His<sup>azwj</sup> Authority, and how He<sup>azwj</sup> Created what He<sup>azwj</sup> Created from the Signs, and how He<sup>azwj</sup> Destroys the one whom He<sup>azwj</sup> Destroys from the disobeyers by the examples. And how he<sup>azwj</sup> Repelled the one whom He<sup>azwj</sup> repelled by the Torments, and how he<sup>azwj</sup> Sustained and Guided, and Granted, and Showed them His<sup>azwj</sup> Wisdom how Wise He<sup>azwj</sup> is, and Patient until they heard what they heard and saw. So Allah<sup>azwj</sup> Sent Muhammad<sup>saww</sup> with that.",
            "Then there will come upon you, from after me<sup>asws</sup> an era, and there will be nothing in that era which will be more hidden than the truth, nor anything more apparent than the falsehood, and nothing more numerous than the lies against Allah<sup>azwj</sup> the High and His<sup>azwj</sup> Messenger<sup>saww</sup>. And there will be nothing in that era which will be more worthless than the Book when it is recited as it deserves to be recited, nor anything more worthy of selling and expensive in price than the Book if it is altered from its places. And there will be nothing in the servants nor in the cities anything which is more prevented than the good nor anything more recognised than the evil. And there will be nothing considered to be more immoral and evil, and no worse penalty than for the guidance in the presence of misguidance. During that era, those who bear the Book will be rejected and the memorizers will forget to the extent that they will interpret it in accordance with their own desires, and they would have inherited that from their forefathers, and they will act with alterations in the Book, lying and rejecting. So they will sell it for a cheap price, and they would be from the ascetics. ",
            "So the Book and the People of the Book during that era would be two castaway fugitives, and two accompanying companions in one road not finding any protector or shelter. They are both good for each other and Whom<sup>azwj</sup> they work for. So the Book and the People of the Book during that era would be in the people but not be among (part of) them, and will be with them but still not be with them, and that is because the misguidance is not in harmony with the guidance.",
            "And if they meet, and the people would have met upon the sectarianism, and would separate from the group. They would give the rule of the matters of their Religion to the one who acts with regards to them by plotting, and the evil, and the bribery, and the murder, as if they are the imams (leaders) of the Book then the Book is not their imam (leading them). There will not remain in their possession from the truth except for its name, and they will not recognise anything from the Book except for its calligraphy and design. ",
            "The entering one will enter (the religion) when he hears for the Judgements of the Quran, but he will not be satisfied in gatherings until he exits from the Religion. He will transfer from a Religion of a king to a Religion of a king, and from the wilayah of a king to a wilayah of a king, and from obedience of a king to the obedience of a king, and from the covenant of a king to a covenant of a king. ",
            "So Allah<sup>azwj</sup> Lures them away from where they do not know, with good expectations and the hope until they give birth in the disobedience, and they make a religion with the tyranny, and the Book did not benefit them anything, and they will be wandering and straying, for they would have made a religion without the Religion of Allah<sup>azwj</sup> Mighty and Majestic, and for the sake of other than Allah<sup>azwj</sup>. ",
            "Their Masjid during that era would be constructed from misguidance, ruination of guidance. So its reciters and its builders would be the most failed ones among the creatures of Allah<sup>azwj</sup> and His<sup>azwj</sup> creatures. It is from their presence that misguidance would flow and return back to them. <span style=\"text-decoration: underline\">Thus, presence in their Masjids, and walking towards them would be blasphemy (Kufr) with Allah</span><sup style=\"text-decoration: underline\">azwj</sup><span style=\"text-decoration: underline\"> the Magnificent, except for the one who walks towards it while being aware of their misguidance</span>. Therefore, due to their actions upon that way, their Masjids would have become ruination of the guidance, and well-built in the misguidance, for the Sunnah of Allah<sup>azwj</sup> would have been changed, and His<sup>azwj</sup> Limits transgressed against.",
            "They will not be calling to the guidance, nor distribution the booty (Al-Fey), nor fulfilling the responsibilities. They will be calling the one from among them who would be killed upon that as a martyr, thus forging a lie against Allah<sup>azwj</sup>, and the struggle, and they would be needless from the knowledge due to their ignorance, and from before they mutilated the righteous ones with every mutilation, and named their truthfulness to Allah<sup>azwj</sup> as libel, and apply the punishment for the sins to the good deeds. ",
            "And Allah<sup>azwj</sup> Mighty and Majestic has Sent to you all a Messenger<sup>saww</sup> from yourselves. It grieves him<sup>saww</sup> to see you suffering, and he<sup>saww</sup> is kind and merciful to the Believers. And He<sup>azwj</sup> Revealed upon him<sup>saww</sup> a Mighty Book. <span class=\"ibTxt\">“<a href=\"/#/books/quran:41#h42\">[41:42]</a> Falsehood shall not come to it from before it nor from behind it; a revelation from the Wise, the Praised One” “<a href=\"/#/books/quran:39#h28\">[39:28]</a> An Arabic Quran without any crookedness, that they may guard (against evil)” “<a href=\"/#/books/quran:36#h70\">[36:70]</a> That it may warn him who would have life, and (that) the word may prove true against the unbelievers”</span>.",
            "So do not let your hopes to distract you, nor consider the term (of life) to be prolonged, for the ones before you were destroyed for having long hopes against their approaching deadline until the Promised time (of death) descended upon them, and repulsed from them the excuses, and raised from them the repentance, and brought with it the calamity and the resentment. And Allah<sup>azwj</sup> has Preached to you with the Promise, and Made Decisive for you the speech, and Taught you the Sunnah, and Explained for you the Program to remove the illness, and Urged upon the Remembrance, and Evidence to the Salvation. ",
            "And the one who act for the sake of Allah<sup>azwj</sup> and take His<sup>azwj</sup> Words as Evidence, would be Guided until he is strong, and Made to understand the right way, and Guided and facilitated to the good. So the one under the Protection of Allah<sup>azwj</sup> is safely preserved, and His<sup>azwj</sup> enemies would be in fearful and pretentious. So be cautious of Allah<sup>azwj</sup> through the frequency of the Remembrance, and be fearful from Him<sup>azwj</sup> by the piety, and get closer to Him<sup>azwj</sup> by the obedience, for He<sup>azwj</sup> is Close by and Answers. Allah<sup>azwj</sup> Mighty and Majestic Said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:2#h186\">[2:186]</a> And when My servants ask you concerning Me, then surely I am very near; I answer the prayer of the suppliant when he calls on Me, so they should answer My call and believe in Me that they may walk in the right way”</span>.",
            "So you must respond to Allah<sup>azwj</sup> and believe in Him<sup>azwj</sup>, and Magnify Allah<sup>azwj</sup>. It does not befit one who recognises the Greatness of Allah<sup>azwj</sup> to consider himself as significant. So the highest of the recognition of the Greatness of Allah<sup>azwj</sup> is being modest to Him<sup>azwj</sup>, and the highest honour of the one who knows the Majesty of Allah<sup>azwj</sup> is to be humble to Him<sup>azwj</sup>, and the most secure is the one who knows the Power of Allah<sup>azwj</sup> and submits to Him<sup>azwj</sup>. So you will not be denying yourselves after the Guidance of the understanding, nor will you be going astray after the Guidance. So do not flee from the truth like the fleeing of the healthy ones from the one with the scabies, and the healthy ones from the sick.",
            "And know that you will never recognise the guidance until you recognise the ones who have left it, and will never take to the Covenant of the Book until you recognise the ones who broke it, and will never attach yourselves to it until you recognise the ones who have abandoned it, and will never be able to recite the Book as it deserves to be recited until you recognise the ones who altered it, and will never recognise the misguidance until you recognise the Guidance, and will never recognise the piety until you recognise the ones who abused it. ",
            "So when you recognise that, you will recognise the innovations, and the impersonations, and you will see the fabrications against Allah<sup>azwj</sup> and against His<sup>azwj</sup> Messenger<sup>saww</sup>, and the alterations to His<sup>azwj</sup> book, and you will see how Allah<sup>azwj</sup> Guided the one whom He<sup>azwj</sup> Guided. So do not let those who have no knowledge keep you ignorant. The Knowledge of the Quran cannot be known as to what it is except by the one<sup>a</sup><sup>sws</sup> who has tasted its food. ",
            "So it was by the knowledge that his ignorance got to know, and his blindness got to visualise, and his deafness got to hear, and gained awareness of what knowledge had passed by and got revived by it after its death. And he established the good deeds in the Presence of Allah<sup>azwj</sup> and deleted the sins by it. And it was by it (knowledge) that he realised the Pleasure from Allah<sup>azwj</sup> Blessed and High. ",
            "So, seek that from its special people, for they<sup>asws</sup> are the specialists, lights to be illuminated by, and the Imams<sup>asws</sup> to be followed. And they<sup>asws</sup> are the life for the knowledge and death for the ignorance. They<sup>asws</sup> are the ones<sup>asws</sup> whose Judgements inform you of their<sup>asws</sup> knowledge, and their<sup>asws</sup> silence about their<sup>asws</sup> speech, and their<sup>asws</sup> apparent about their<sup>asws</sup> hidden. They<sup>asws</sup> do not oppose the religion nor do they<sup>asws</sup> differ with regards to it. For it (knowledge) is a truthful witness between them<sup>asws</sup>, and a silent speaker. It is from their<sup>asws</sup> glories to testify to the truth, and to be truthful reporters, neither opposing the truth nor differing with regards to it.  ",
            "The Precedence is for them<sup>asws</sup> from Allah<sup>azwj</sup>, and Allah<sup>azwj</sup> Mighty and Majestic has Passed a Truthful Judgement for them<sup>asws</sup>. And in that is a reminder for the speakers. So bear in mind the truth if you hear it with a caring mind and not with a narrative mind, for the narrators of the Book are many, and its guardians are few. And Allah<sup>azwj</sup> is the Best Supporter’.  "
          ],
          "en.sarwar": [
            "587. A number of our companions, from Sahl Bin Ziyad, from Umar Bin Ali, from his uncle Muhammad Bin Umar, from Ibn Azina who said, ‘I heard Umar Bin Yazeed saying, ‘Narrated to me Ma’rouf Bin Kharbouz, who has said: ‘Ali Bin Al-Husayn (a.s.) was saying: ‘Woe be unto a mother who defends the one who does not cease to sin! Woe be unto a mother of an immoral one who does not cease to dispute! Woe be unto a mother of a sinner, one who speaks a lot regarding other than Allah (azwj) Mighty and Majestic!’"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 601)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15272,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:52:2",
        "text": [
          "15034- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عُمَرَ بْنِ عَلِيٍّ عَنْ عَمِّهِ مُحَمَّدِ بْنِ عُمَرَ عَنِ ابْنِ أُذَيْنَةَ قَالَ سَمِعْتُ عُمَرَ بْنَ يَزِيدَ يَقُولُ حَدَّثَنِي مَعْرُوفُ بْنُ خَرَّبُوذَ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ (عليه السلام) أَنَّهُ كَانَ يَقُولُ وَيْلُمِّهِ فَاسِقاً مَنْ لَا يَزَالُ مُمَارِئاً وَيْلُمِّهِ فَاجِراً مَنْ لَا يَزَالُ مُخَاصِماً وَيْلُمِّهِ آثِماً مَنْ كَثُرَ كَلَامُهُ فِي غَيْرِ ذَاتِ اللَّهِ عَزَّ وَ جَلَّ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473724\">H 15034</a> – A number of our companions, from Sahl Bin Ziyad, from Umar Bin Ali, from his uncle Muhammad Bin Umar, from Ibn Azina who said, ‘I heard Umar Bin Yazeed saying, ‘Narrated to me Ma’rouf Bin Kharbouz, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>li Bin Al-Husayn</span><sup>asws</sup> was saying: ‘Woe be unto a mother who defends the one who does not cease to sin! Woe be unto a mother of an immoral one who does not cease to dispute! Woe be unto a mother of a sinner, one who speaks a lot regarding other than Allah<sup>azwj</sup> Mighty and Majestic!’"
          ],
          "en.sarwar": [
            "588. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, and Ali Bin Ibrahim, from his father, together, from Ahmad Bin Muhammad Bin Abu Nasr, from Aban Bin Usman, from Al-Hassan Bin Umarat, from Nueym Al-Qazy, who has said: ‘Abu Ja’far (a.s.) has said: ‘One morning, Ibrahim (as) saw a white hair in his (as) beard, so he (as) said: ‘The Praise is due to Allah (azwj), the Lord (azwj) of the Worlds Who (azwj) Made me reach to this age, and I (as) never disobeyed Allah (azwj) even for the blink of an eye’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مهول</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 601)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15273,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:52:3",
        "text": [
          "15035- مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنِ الْحَسَنِ بْنِ عُمَارَةَ عَنْ نُعَيْمٍ الْقُضَاعِيِّ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ أَصْبَحَ إِبْرَاهِيمُ (عليه السلام) فَرَأَى فِي لِحْيَتِهِ شَعْرَةً بَيْضَاءَ فَقَالَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ الَّذِي بَلَّغَنِي هَذَا الْمَبْلَغَ لَمْ أَعْصِ اللَّهَ طَرْفَةَ عَيْنٍ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473725\">H 15035</a> – Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, and Ali Bin Ibrahim, from his father, together, from Ahmad Bin Muhammad Bin Abu Nasr, from Aban Bin Usman, from Al-Hassan Bin Umarat, from Nueym Al-Qazy, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>bu Ja’far</span><sup>asws</sup> has said: ‘One morning, Ibrahim<sup>as</sup> saw a white hair in his<sup>as</sup> beard, so he<sup>as</sup> said: ‘The Praise is due to Allah<sup>azwj</sup>, the Lord<sup>azwj</sup> of the Worlds Who<sup>azwj</sup> Made me reach to this age, and I<sup>as</sup> never disobeyed Allah<sup>azwj</sup> even for the blink of an eye’."
          ],
          "en.sarwar": [
            "589. Aban Bin Usman, from Muhammad Bin Marwan, from the one who reported it: ‘Abu Ja’far (a.s.) has said: ‘When Allah (azwj) Mighty and Majestic Took Ibrahim (as) as a friend, Gave him (as) good news in private. The Angel of Death came up to him (as) in the image of a young white man, wearing two white robes, with water and oil dripping from his head. So Ibrahim (as) entered the house, but welcomed him outside the house. And Ibrahim (as) was an honourable (Ghayour) man, and whenever he (as) went out for a need, he (as) would lock his (as) door, and takes its keys with him (as). Then he (as) would return and open it. So there was the man (Angel of Death) standing there, as handsome as a man can be. So he (as) grabbed his hand and said: ‘O servant of Allah (azwj), who entered you into my (as) house?’ He said: ‘Its Lord (azwj) Made me enter it’. So he (as) said: ‘Its Lord (azwj) is more deserving of it than I (as) am. So who are you?’ He said: ‘I am the Angel of death’. Ibrahim (as) panicked and said: ‘You have come to me (as) to capture my (as) soul?’ He said: ‘No. Allah (azwj) has Taken a servant as a friend, so I have come to give the good news to him (as). He (as) said: ‘So who is he (as)? I (as) would like to serve him (as) until I (as) die’. He said: ‘You (as) are him (as)’. So he (as) came up to Sara and said to her: ‘Allah (azwj) Blessed and High has Taken me (as) as a friend!’"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 603)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15274,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:52:4",
        "text": [
          "15036- أَبَانُ بْنُ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ مَرْوَانَ عَمَّنْ رَوَاهُ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ لَمَّا اتَّخَذَ اللَّهُ عَزَّ وَ جَلَّ إِبْرَاهِيمَ خَلِيلًا أَتَاهُ بُشْرَاهُ بِالْخَلَّةِ فَجَاءَهُ مَلَكُ الْمَوْتِ فِي صُورَةِ شَابٍّ أَبْيَضَ عَلَيْهِ ثَوْبَانِ أَبْيَضَانِ يَقْطُرُ رَأْسُهُ مَاءً وَ دُهْناً فَدَخَلَ إِبْرَاهِيمُ (عليه السلام) الدَّارَ فَاسْتَقْبَلَهُ خَارِجاً مِنَ الدَّارِ ",
          "وَ كَانَ إِبْرَاهِيمُ (عليه السلام) رَجُلًا غَيُوراً وَ كَانَ إِذَا خَرَجَ فِي حَاجَةٍ أَغْلَقَ بَابَهُ وَ أَخَذَ مِفْتَاحَهُ مَعَهُ ثُمَّ رَجَعَ فَفَتَحَ فَإِذَا هُوَ بِرَجُلٍ قَائِمٍ أَحْسَنَ مَا يَكُونُ مِنَ الرِّجَالِ فَأَخَذَهُ بِيَدِهِ وَ قَالَ يَا عَبْدَ اللَّهِ مَنْ أَدْخَلَكَ دَارِي فَقَالَ رَبُّهَا أَدْخَلَنِيهَا فَقَالَ رَبُّهَا أَحَقُّ بِهَا مِنِّي فَمَنْ أَنْتَ قَالَ أَنَا مَلَكُ الْمَوْتِ فَفَزِعَ إِبْرَاهِيمُ (عليه السلام) فَقَالَ جِئْتَنِي لِتَسْلُبَنِي رُوحِي قَالَ لَا وَ لَكِنِ اتَّخَذَ اللَّهُ عَبْداً خَلِيلًا فَجِئْتُ لِبِشَارَتِهِ قَالَ فَمَنْ هُوَ لَعَلِّي أَخْدُمُهُ حَتَّى أَمُوتَ قَالَ أَنْتَ هُوَ فَدَخَلَ عَلَى سَارَةَ (عليها السلام) فَقَالَ لَهَا إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى اتَّخَذَنِي خَلِيلًا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473726\">H 15036</a> – Aban Bin Usman, from Muhammad Bin Marwan, from the one who reported it:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>bu Ja’far</span><sup>asws</sup> has said: ‘When Allah<sup>azwj</sup> Mighty and Majestic Took Ibrahim<sup>as</sup> as a friend, Gave him<sup>as</sup> good news in private. The Angel of Death came up to him<sup>as</sup> in the image of a young white man, wearing two white robes, with water and oil dripping from his head. So Ibrahim<sup>as</sup> entered the house, but welcomed him outside the house. ",
            "And Ibrahim<sup>as</sup> was an honourable (Ghayour) man, and whenever he<sup>as</sup> went out for a need, he<sup>as</sup> would lock his<sup>as</sup> door, and takes its keys with him<sup>as</sup>. Then he<sup>as</sup> would return and open it. So there was the man (Angel of Death) standing there, as handsome as a man can be. So he<sup>as</sup> grabbed his hand and said: ‘O servant of Allah<sup>azwj</sup>, who entered you into my<sup>as</sup> house?’ He said: ‘Its Lord<sup>azwj</sup> Made me enter it’. So he<sup>as</sup> said: ‘Its Lord<sup>azwj</sup> is more deserving of it than I<sup>as</sup> am. So who are you?’ He said: ‘I am the Angel of death’. Ibrahim<sup>as</sup> panicked and said: ‘You have come to me<sup>as</sup> to capture my<sup>as</sup> soul?’ He said: ‘No. Allah<sup>azwj</sup> has Taken a servant as a friend, so I have come to give the good news to him<sup>as</sup>. He<sup>as</sup> said: ‘So who is he<sup>as</sup>? I<sup>as</sup> would like to serve him<sup>as</sup> until I<sup>as</sup> die’. He said: ‘You<sup>as</sup> are him<sup>as</sup>’. So he<sup>as</sup> came up to Sara and said to her: ‘Allah<sup>azwj</sup> Blessed and High has Taken me<sup>as</sup> as a friend!’"
          ],
          "en.sarwar": [
            "590. Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Suleym Al-Fara’a, from the one whom he mentioned: ‘Abu Abdullah (a.s.), said in his (a.s.) Hadeeth that: ‘When the Angel said: ‘Its Lord (azwj) Made me enter it’, Ibrahim (as) recognised that he is the Angel of Death. So he (as) said to him: ‘What made you descend?’ He said; ‘I have come to give good news to a man whom Allah (azwj) Blessed and High has Taken as a friend’. So Ibrahim (as) said to him: ‘So who is this man?’ The Angel said to him: ‘And what do you (as) want from him (as)?’ So Ibrahim (as) said to him: ‘I (as) will serve him (as) for the days of my (as) life’. The Angel said to him (as): ‘You (as) are him (as)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 603)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15275,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:52:5",
        "text": [
          "15037- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ سُلَيْمٍ الْفَرَّاءِ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) مِثْلَهُ إِلَّا أَنَّهُ قَالَ فِي حَدِيثِهِ إِنَّ الْمَلَكَ لَمَّا قَالَ أَدْخَلَنِيهَا رَبُّهَا عَرَفَ إِبْرَاهِيمُ (عليه السلام) أَنَّهُ مَلَكُ الْمَوْتِ (عليه السلام) فَقَالَ لَهُ مَا أَهْبَطَكَ قَالَ جِئْتُ أُبَشِّرُ رَجُلًا أَنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى اتَّخَذَهُ خَلِيلًا فَقَالَ لَهُ إِبْرَاهِيمُ (عليه السلام) فَمَنْ هَذَا الرَّجُلُ فَقَالَ لَهُ الْمَلَكُ وَ مَا تُرِيدُ مِنْهُ فَقَالَ لَهُ إِبْرَاهِيمُ (عليه السلام) أَخْدُمُهُ أَيَّامَ حَيَاتِي فَقَالَ لَهُ الْمَلَكُ فَأَنْتَ هُوَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473727\">H 15037</a> – Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Suleym Al-Fara’a, from the one whom he mentioned:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>bu Abdullah</span><sup>asws</sup>, said in his<sup>asws</sup> Hadeeth that: ‘When the Angel said: ‘Its Lord<sup>azwj</sup> Made me enter it’, Ibrahim<sup>as</sup> recognised that he is the Angel of Death. So he<sup>as</sup> said to him: ‘What made you descend?’ He said; ‘I have come to give good news to a man whom Allah<sup>azwj</sup> Blessed and High has Taken as a friend’. So Ibrahim<sup>as</sup> said to him: ‘So who is this man?’ The Angel said to him: ‘And what do you<sup>as</sup> want from him<sup>as</sup>?’ So Ibrahim<sup>as</sup> said to him: ‘I<sup>as</sup> will serve him<sup>as</sup> for the days of my<sup>as</sup> life’. The Angel said to him<sup>as</sup>: ‘You<sup>as</sup> are him<sup>as</sup>’."
          ],
          "en.sarwar": [
            "591. Ali Bin Ibrahim, from his father, from Al-Hassan Bin Mahboub, from Malik Bin Atiyya, from Abu Hamza Al-Thumaly, who has said: ‘Abu Ja’far (a.s.) said that: ‘One day Ibrahim (as) went out on a journey by a camel, so he (as) passed by a desert from the earth and there was a man who was standing in Prayer whose length had blocked the sky from the earth, and his clothing was his hair. Ibrahim (as) paused by him and was astounded from him and sat down awaiting him to be free from his Prayer. So when it became prolonged, he (as) moved him with his (as) hand and said to him; ‘I (as) have a need, so shorten it’. He (a.s.) said: ‘So the man shortened it and sat with Ibrahim (as). Ibrahim (as) said to him: ‘Who are you Praying to?’ He said, ‘To the God of Ibrahim (as)’. He (as) said to him: ‘And Who is the God of Ibrahim (as)?’ He said, ‘The One Who (azwj) Created me’. Ibrahim (as) said to him: ‘You have caused me (as) to wonder, and I (as) would love to make you a brother for the Sake of Allah (azwj). Where is your house, if I (as) intend to visit you and meet you?’ The man said to him, ‘My house is behind this drop’ – and he indicated by his hand to the sea, ‘and my Prayer Place is this place. You (as) will see me here if you (as) want me, Allah (azwj) Willing’. He (a.s.) said: ‘Then the man said to Ibrahim (as), ‘You (as) have a need?’. So Ibrahim (as) said: ‘Yes’. He said to him (as), ‘And what is it?’ He (as) said, ‘Supplicate to Allah (azwj) and I (as) shall say ‘Ameen’ to your supplication, and I (as) will supplicate and you say ‘Ameen’ over my supplication’. So the man said, ‘So what is it that we are supplicating for to Allah (azwj)?’ Ibrahim (as) said: ‘For the sinner from the Believers’. So the man said, ‘No’. Ibrahim (as) said: ‘And why not?’ He said, ‘Because I have been supplicating to Allah (azwj) for the past three years with a supplication, I have never seen its Answer until now, and I am ashamed from Allah (azwj) the High that I should supplicate (for more) until I know that He (azwj) has Answered me’. Ibrahim (as) said: ‘So what is it that you supplicated for?’ The man said to him (as), ‘I was in this Prayer Place one day when a young boy passed by and I saw a wonderful light emerging from his (as) forehead and two locks of hair behind him (as), and with him (as) were cows that he (as) was herding as if they had been painted with oil, and sheep which he (as) was herding as if they were energetic and healthy. What I saw astounded me, so I said to him (as), ‘O young boy! To whom do these cows and sheep belong to?’ He (as) said to me: ‘To Ibrahim (as)’. So I said, ‘And who are you (as)?’ He (as) said: ‘I (as) am Ismail Bin Ibrahim (as), friend of the Beneficent’. So I supplicated to Allah (azwj) Mighty and Majestic, and asked Him (azwj) to Show me His (azwj) friend’. Ibrahim (as) said to him: ‘So I (as) am Ibrahim (as), friend of the Beneficent, and that young boy is my (as) son (as)’. The man said to him (as) due to that, ‘The Praise is due to Allah (azwj) Who Answered my supplication’. Then the man kissed the two eyes of Ibrahim (as) and his (as) neck, then said, ‘But now, arise and supplicate until I say ‘Ameen’ over your supplication’. So Ibrahim (as) for the believing men, and the believing women, and the sinners from that day, to be Forgiven, and Allah (azwj) to be pleased with them. And the man said ‘Ameen’ over that supplication. Abu Ja’far (a.s.) said: ‘So the supplication of Ibrahim (as) will reach the Believers, the sinners from our (a.s.) Shites up to the Day of Judgement’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 605)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15276,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:52:6",
        "relations": {
          "Mentions": [
            "/books/quran:16:18"
          ]
        },
        "text": [
          "15038- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ عَنْ أَبِي جَعْفَرٍ (عليه السلام) أَنَّ إِبْرَاهِيمَ (عليه السلام) خَرَجَ ذَاتَ يَوْمٍ يَسِيرُ بِبَعِيرٍ فَمَرَّ بِفَلَاةٍ مِنَ الْأَرْضِ فَإِذَا هُوَ بِرَجُلٍ قَائِمٍ يُصَلِّي قَدْ قَطَعَ الْأَرْضَ إِلَى السَّمَاءِ طُولُهُ وَ لِبَاسُهُ شَعْرٌ قَالَ فَوَقَفَ عَلَيْهِ إِبْرَاهِيمُ (عليه السلام) وَ عَجِبَ مِنْهُ وَ جَلَسَ يَنْتَظِرُ فَرَاغَهُ فَلَمَّا طَالَ عَلَيْهِ حَرَّكَهُ بِيَدِهِ فَقَالَ لَهُ إِنَّ لِي حَاجَةً فَخَفِّفْ ",
          "قَالَ فَخَفَّفَ الرَّجُلُ وَ جَلَسَ إِبْرَاهِيمُ (عليه السلام) فَقَالَ لَهُ إِبْرَاهِيمُ (عليه السلام) لِمَنْ تُصَلِّي فَقَالَ لِإِلَهِ إِبْرَاهِيمَ فَقَالَ لَهُ وَ مَنْ إِلَهُ إِبْرَاهِيمَ فَقَالَ الَّذِي خَلَقَكَ وَ خَلَقَنِي فَقَالَ لَهُ إِبْرَاهِيمُ (عليه السلام) قَدْ أَعْجَبَنِي نَحْوُكَ وَ أَنَا أُحِبُّ أَنْ أُوَاخِيَكَ فِي اللَّهِ أَيْنَ مَنْزِلُكَ إِذَا أَرَدْتُ زِيَارَتَكَ وَ لِقَاءَكَ فَقَالَ لَهُ الرَّجُلُ مَنْزِلِي خَلْفَ هَذِهِ النُّطْفَةِ وَ أَشَارَ بِيَدِهِ إِلَى الْبَحْرِ وَ أَمَّا مُصَلَّايَ فَهَذَا الْمَوْضِعُ تُصِيبُنِي فِيهِ إِذَا أَرَدْتَنِي إِنْ شَاءَ اللَّهُ",
          "قَالَ ثُمَّ قَالَ الرَّجُلُ لِإِبْرَاهِيمَ (عليه السلام) أَ لَكَ حَاجَةٌ فَقَالَ إِبْرَاهِيمُ نَعَمْ فَقَالَ لَهُ وَ مَا هِيَ قَالَ تَدْعُو اللَّهَ وَ أُؤَمِّنُ عَلَى دُعَائِكَ وَ أَدْعُو أَنَا فَتُؤَمِّنُ عَلَى دُعَائِي فَقَالَ الرَّجُلُ فَبِمَ نَدْعُو اللَّهَ فَقَالَ إِبْرَاهِيمُ (عليه السلام) لِلْمُذْنِبِينَ مِنَ الْمُؤْمِنِينَ فَقَالَ الرَّجُلُ لَا فَقَالَ إِبْرَاهِيمُ (عليه السلام) وَ لِمَ فَقَالَ لِأَنِّي قَدْ دَعَوْتُ اللَّهَ عَزَّ وَ جَلَّ مُنْذُ ثَلَاثِ سِنِينَ بِدَعْوَةٍ لَمْ أَرَ إِجَابَتَهَا حَتَّى السَّاعَةِ وَ أَنَا أَسْتَحْيِي مِنَ اللَّهِ تَعَالَى أَنْ أَدْعُوَهُ حَتَّى أَعْلَمَ أَنَّهُ قَدْ أَجَابَنِي",
          "فَقَالَ إِبْرَاهِيمُ (عليه السلام) فَبِمَ دَعَوْتَهُ فَقَالَ لَهُ الرَّجُلُ إِنِّي فِي مُصَلَّايَ هَذَا ذَاتَ يَوْمٍ إِذْ مَرَّ بِي غُلَامٌ أَرْوَعُ النُّورُ يَطْلُعُ مِنْ جَبْهَتِهِ لَهُ ذُؤَابَةٌ مِنْ خَلْفِهِ وَ مَعَهُ بَقَرٌ يَسُوقُهَا كَأَنَّمَا دُهِنَتْ دَهْناً وَ غَنَمٌ يَسُوقُهَا كَأَنَّمَا دُخِسَتْ دَخَساً فَأَعْجَبَنِي مَا رَأَيْتُ مِنْهُ فَقُلْتُ لَهُ يَا غُلَامُ لِمَنْ هَذَا الْبَقَرُ وَ الْغَنَمُ فَقَالَ لِي لِإِبْرَاهِيمَ (عليه السلام) فَقُلْتُ وَ مَنْ أَنْتَ فَقَالَ أَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ خَلِيلِ الرَّحْمَنِ فَدَعَوْتُ اللَّهَ عَزَّ وَ جَلَّ وَ سَأَلْتُهُ أَنْ يُرِيَنِي خَلِيلَهُ",
          "فَقَالَ لَهُ إِبْرَاهِيمُ (عليه السلام) فَأَنَا إِبْرَاهِيمُ خَلِيلُ الرَّحْمَنِ وَ ذَلِكَ الْغُلَامُ ابْنِي فَقَالَ لَهُ الرَّجُلُ عِنْدَ ذَلِكَ الْحَمْدُ لِلَّهِ الَّذِي أَجَابَ دَعْوَتِي ثُمَّ قَبَّلَ الرَّجُلُ صَفْحَتَيْ إِبْرَاهِيمَ (عليه السلام) وَ عَانَقَهُ ثُمَّ قَالَ أَمَّا الْآنَ فَقُمْ فَادْعُ حَتَّى أُؤَمِّنَ عَلَى دُعَائِكَ فَدَعَا إِبْرَاهِيمُ (عليه السلام) لِلْمُؤْمِنِينَ وَ الْمُؤْمِنَاتِ وَ الْمُذْنِبِينَ مِنْ يَوْمِهِ ذَلِكَ بِالْمَغْفِرَةِ وَ الرِّضَا عَنْهُمْ قَالَ وَ أَمَّنَ الرَّجُلُ عَلَى دُعَائِهِ",
          "قَالَ أَبُو جَعْفَرٍ (عليه السلام) فَدَعْوَةُ إِبْرَاهِيمَ (عليه السلام) بَالِغَةٌ لِلْمُؤْمِنِينَ الْمُذْنِبِينَ مِنْ شِيعَتِنَا إِلَى يَوْمِ الْقِيَامَةِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473728\">H 15038</a> – Ali Bin Ibrahim, from his father, from Al-Hassan Bin Mahboub, from Malik Bin Atiyya, from Abu Hamza Al-Thumaly, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>bu Ja’far</span><sup>asws</sup> said that: ‘One day Ibrahim<sup>as</sup> went out on a journey by a camel, so he<sup>as</sup> passed by a desert from the earth and there was a man who was standing in Prayer whose length had blocked the sky from the earth, and his clothing was his hair. Ibrahim<sup>as</sup> paused by him and was astounded from him and sat down awaiting him to be free from his Prayer. So when it became prolonged, he<sup>as</sup> moved him with his<sup>as</sup> hand and said to him; ‘I<sup>as</sup> have a need, so shorten it’.",
            "He<sup>asws</sup> said: ‘So the man shortened it and sat with Ibrahim<sup>as</sup>. Ibrahim<sup>as</sup> said to him: ‘Who are you Praying to?’ He said, ‘To the God of Ibrahim<sup>as</sup>’. He<sup>as</sup> said to him: ‘And Who is the God of Ibrahim<sup>as</sup>?’ He said, ‘The One Who<sup>azwj</sup> Created me’. Ibrahim<sup>as</sup> said to him: ‘You have caused me<sup>as</sup> to wonder, and I<sup>as</sup> would love to make you a brother for the Sake of Allah<sup>azwj</sup>. Where is your house, if I<sup>as</sup> intend to visit you and meet you?’ The man said to him, ‘My house is behind this drop’ – and he indicated by his hand to the sea, ‘and my Prayer Place is this place. You<sup>as</sup> will see me here if you<sup>as</sup> want me, Allah<sup>azwj</sup> Willing’.  ",
            "He<sup>asws</sup> said: ‘Then the man said to Ibrahim<sup>as</sup>, ‘You<sup>as</sup> have a need?’. So Ibrahim<sup>as</sup> said: ‘Yes’. He said to him<sup>as</sup>, ‘And what is it?’ He<sup>as</sup> said, ‘Supplicate to Allah<sup>azwj</sup> and I<sup>as</sup> shall say ‘Ameen’ to your supplication, and I<sup>as</sup> will supplicate and you say ‘Ameen’ over my supplication’. So the man said, ‘So what is it that we are supplicating for to Allah<sup>azwj</sup>?’ Ibrahim<sup>as</sup> said: ‘For the sinner from the Believers’. So the man said, ‘No’. Ibrahim<sup>as</sup> said: ‘And why not?’ He said, ‘Because I have been supplicating to Allah<sup>azwj</sup> for the past three years with a supplication, I have never seen its Answer until now, and I am ashamed from Allah<sup>azwj</sup> the High that I should supplicate (for more) until I know that He<sup>azwj</sup> has Answered me’. ",
            "Ibrahim<sup>as</sup> said: ‘So what is it that you supplicated for?’ The man said to him<sup>as</sup>, ‘I was in this Prayer Place one day when a young boy passed by and I saw a wonderful light emerging from his<sup>as</sup> forehead and two locks of hair behind him<sup>as</sup>, and with him<sup>as</sup> were cows that he<sup>as</sup> was herding as if they had been painted with oil, and sheep which he<sup>as</sup> was herding as if they were energetic and healthy. What I saw astounded me, so I said to him<sup>as</sup>, ‘O young boy! To whom do these cows and sheep belong to?’ He<sup>as</sup> said to me: ‘To Ibrahim<sup>as</sup>’. So I said, ‘And who are you<sup>as</sup>?’ He<sup>as</sup> said: ‘I<sup>as</sup> am Ismail Bin Ibrahim<sup>as</sup>, friend of the Beneficent’. So I supplicated to Allah<sup>azwj</sup> Mighty and Majestic, and asked Him<sup>azwj</sup> to Show me His<sup>azwj</sup> friend’.",
            "Ibrahim<sup>as</sup> said to him: ‘So I<sup>as</sup> am Ibrahim<sup>as</sup>, friend of the Beneficent, and that young boy is my<sup>as</sup> son<sup>as</sup>’. The man said to him<sup>as</sup> due to that, ‘The Praise is due to Allah<sup>azwj</sup> Who Answered my supplication’. Then the man kissed the two eyes of Ibrahim<sup>as</sup> and his<sup>as</sup> neck, then said, ‘But now, arise and supplicate until I say ‘Ameen’ over your supplication’. So Ibrahim<sup>as</sup> for the believing men, and the believing women, and the sinners from that day, to be Forgiven, and Allah<sup>azwj</sup> to be pleased with them. And the man said ‘Ameen’ over that supplication.",
            "Abu Ja’far<sup>asws</sup> said: ‘So the supplication of Ibrahim<sup>as</sup> will reach the Believers, the sinners from our<sup>asws</sup> Shites up to the Day of Judgement’."
          ],
          "en.sarwar": [
            "592. Ali Bin Muhammad, from one of his companions, with an unbroken chain, said: ‘Whenever Ali (a.s.) Bin Al-Husayn (a.s.) used to recite this Verse: “<a href=\"/#/books/quran:16#h18\">[16:18]</a> And if you would count Allah’s favours, you will not be able to number them”, he (a.s.) would say: ‘Glory be to the One Who (azwj) never Made it to be in anyone the recognition of His (azwj) Favours except for the recognition falling short of (Al-Taqseer) recognising, just as He (azwj) has never Made it to be in anyone the recognition of being aware of Him (azwj) more than the knowledge that He (azwj) cannot be perceived. So gratitude be to the Majestic and Mighty for the recognition of the recognisers by their reduced recognition as appreciation, so He (azwj) Made their reduced recognition as an expression of gratitude, just as He (azwj) Knows that the knowledge of the knowledgeable people would not be able to perceived Him (azwj), so He (azwj) made Belief as knowledge from it, so they cannot exceed that. So no one from His (azwj) creatures can reach the limit of worshipping Him (azwj), and how can one reach the limit of worship of the One Who (azwj) has no Limits for Him (azwj), impossible! Allah (azwj) is Higher than that, Exalted and Great’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 605)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15277,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:52:7",
        "relations": {
          "Mentions": [
            "/books/quran:16:18"
          ]
        },
        "text": [
          "15039- عَلِيُّ بْنُ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِهِ رَفَعَهُ قَالَ كَانَ عَلِيُّ بْنُ الْحُسَيْنِ (عليه السلام) إِذَا قَرَأَ هَذِهِ الْآيَةَ وَ إِنْ تَعُدُّوا نِعْمَةَ اللَّهِ لا تُحْصُوها يَقُولُ سُبْحَانَ مَنْ لَمْ يَجْعَلْ فِي أَحَدٍ مِنْ مَعْرِفَةِ نِعَمِهِ إِلَّا الْمَعْرِفَةَ بِالتَّقْصِيرِ عَنْ مَعْرِفَتِهَا كَمَا لَمْ يَجْعَلْ فِي أَحَدٍ مِنْ مَعْرِفَةِ إِدْرَاكِهِ أَكْثَرَ مِنَ الْعِلْمِ أَنَّهُ لَا يُدْرِكُهُ ",
          "فَشَكَرَ جَلَّ وَ عَزَّ مَعْرِفَةَ الْعَارِفِينَ بِالتَّقْصِيرِ عَنْ مَعْرِفَةِ شُكْرِهِ فَجَعَلَ مَعْرِفَتَهُمْ بِالتَّقْصِيرِ شُكْراً كَمَا عَلِمَ عِلْمَ الْعَالِمِينَ أَنَّهُمْ لَا يُدْرِكُونَهُ فَجَعَلَهُ إِيمَاناً عِلْماً مِنْهُ أَنَّهُ قَدُّ وُسْعِ الْعِبَادِ فَلَا يَتَجَاوَزُ ذَلِكَ فَإِنَّ شَيْئاً مِنْ خَلْقِهِ لَا يَبْلُغُ مَدَى عِبَادَتِهِ وَ كَيْفَ يُبْلَغُ مَدَى عِبَادَتِهِ مَنْ لَا مَدَى لَهُ وَ لَا كَيْفَ تَعَالَى اللَّهُ عَنْ ذَلِكَ عُلُوّاً كَبِيراً."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473729\">H 15039</a> – Ali Bin Muhammad, from one of his companions, with an unbroken chain, said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-w\">‘W</span>henever Ali</span><sup>asws</sup> Bin Al-Husayn<sup>asws</sup> used to recite this Verse: <span class=\"ibTxt\">“<a href=\"/#/books/quran:16#h18\">[16:18]</a> And if you would count Allah's favours, you will not be able to number them”</span>, he<sup>asws</sup> would say: ‘Glory be to the One Who<sup>azwj</sup> never Made it to be in anyone the recognition of His<sup>azwj</sup> Favours except for the recognition falling short of (Al-Taqseer) recognising, just as He<sup>azwj</sup> has never Made it to be in anyone the recognition of being aware of Him<sup>azwj</sup> more than the knowledge that He<sup>azwj</sup> cannot be perceived. ",
            "So gratitude be to the Majestic and Mighty for the recognition of the recognisers by their reduced recognition as appreciation, so He<sup>azwj</sup> Made their reduced recognition as an expression of gratitude, just as He<sup>azwj</sup> Knows that the knowledge of the knowledgeable people would not be able to perceived Him<sup>azwj</sup>, so He<sup>azwj</sup> made Belief as knowledge from it, so they cannot exceed that. So no one from His<sup>azwj</sup> creatures can reach the limit of worshipping Him<sup>azwj</sup>, and how can one reach the limit of worship of the One Who<sup>azwj</sup> has no Limits for Him<sup>azwj</sup>, impossible! Allah<sup>azwj</sup> is Higher than that, Exalted and Great’."
          ],
          "en.sarwar": [
            "593. Muhammad Bin Yahya, from Muhammad Bin Al-Husayn, from Abdul Rahman Bin Abu Hisham, from Anbasat Bin Bajaad Al-Abid, from Jabir, who has said: ‘We were in the presence Abu Ja’far (a.s.), and the authority of the Clan of Umayya was mentioned, so Abu Ja’far (a.s.) said: ‘No one comes out (rebels) against Hisham except that he gets killed’. ‘And he (a.s.) also mentioned that his government would last for twenty years’. He (the narrator) said, ‘That grieved us’. So he (a.s.) said: ‘What is the matter with you? Whenever Allah (azwj) Mighty and Majestic Intends to Destroy the authority of a people, He (azwj) Commands the Angel to quicken the pace of the orbit in accordance to what He (azwj) Intends to’. He (the narrator) said, ‘So we said to Zayd, ‘This is the discussion we had’. So he said, ‘I witnessed Hisham, and the Rasool Allah (saww) was insulted in his presence, so he neither denied that, nor did he change it. By Allah (azwj)! Even if there is no one except for myself and my son, I would come out (in rebellion) against him’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> متلف فيه</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 606)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15278,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:52:8",
        "text": [
          "15040- مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي هَاشِمٍ عَنْ عَنْبَسَةَ بْنِ بِجَادٍ الْعَابِدِ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ كُنَّا عِنْدَهُ وَ ذَكَرُوا سُلْطَانَ بَنِي أُمَيَّةَ فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) لَا يَخْرُجُ عَلَى هِشَامٍ أَحَدٌ إِلَّا قَتَلَهُ قَالَ وَ ذَكَرَ مُلْكَهُ عِشْرِينَ سَنَةً قَالَ فَجَزِعْنَا فَقَالَ مَا لَكُمْ إِذَا أَرَادَ اللَّهُ عَزَّ وَ جَلَّ أَنْ يُهْلِكَ سُلْطَانَ قَوْمٍ أَمَرَ الْمَلَكَ فَأَسْرَعَ بِسَيْرِ الْفَلَكِ فَقَدَّرَ عَلَى مَا يُرِيدُ قَالَ فَقُلْنَا لِزَيْدٍ (عليه السلام) هَذِهِ الْمَقَالَةَ فَقَالَ إِنِّي شَهِدْتُ هِشَاماً وَ رَسُولُ اللَّهِ (صلى الله عليه وآله) يُسَبُّ عِنْدَهُ فَلَمْ يُنْكِرْ ذَلِكَ وَ لَمْ يُغَيِّرْهُ فَوَ اللَّهِ لَوْ لَمْ يَكُنْ إِلَّا أَنَا وَ ابْنِي لَخَرَجْتُ عَلَيْهِ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473730\">H 15040</a> – Muhammad Bin Yahya, from Muhammad Bin Al-Husayn, from Abdul Rahman Bin Abu Hisham, from Anbasat Bin Bajaad Al-Abid, from Jabir, who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-w\">‘W</span>e were in the presence</span> Abu Ja’far<sup>asws</sup>, and the authority of the Clan of Umayya was mentioned, so Abu Ja’far<sup>asws</sup> said: ‘No one comes out (rebels) against Hisham except that he gets killed’. ‘And he<sup>asws</sup> also mentioned that his government would last for twenty years’. He (the narrator) said, ‘That grieved us’. So he<sup>asws</sup> said: ‘What is the matter with you? Whenever Allah<sup>azwj</sup> Mighty and Majestic Intends to Destroy the authority of a people, He<sup>azwj</sup> Commands the Angel to quicken the pace of the orbit in accordance to what He<sup>azwj</sup> Intends to’. ",
            "He (the narrator) said, ‘So we said to Zayd, ‘This is the discussion we had’. So he said, ‘I witnessed Hisham, and the Rasool Allah<sup>saww</sup> was insulted in his presence, so he neither denied that, nor did he change it. By Allah<sup>azwj</sup>! Even if there is no one except for myself and my son, I would come out (in rebellion) against him’. "
          ],
          "en.sarwar": [
            "594. And by this chain, from Anbasat, from Mu‘alla Bin Khunays who said: ‘I was in the presence of Abu Abdullah (a.s.) when Muhammad Bin Abdullah came up and greeted, then went away. Abu Abdullah (a.s.) sympathised and tears flowed from his (a.s.) eyes. So I said to him (a.s.), ‘I saw you (a.s.) doing something what you never did for anyone before’. He (a.s.) said; ‘I (a.s.) sympathised for him because he will be established upon a command which is not for him. I (a.s.) did not find him in the Book of Ali (a.s.) from the Caliphs of this community, nor from its kings’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 606)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15279,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:52:9",
        "text": [
          "15041- وَ بِهَذَا الْإِسْنَادِ عَنْ عَنْبَسَةَ عَنْ مُعَلَّى بْنِ خُنَيْسٍ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ (عليه السلام) إِذْ أَقْبَلَ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ فَسَلَّمَ ثُمَّ ذَهَبَ فَرَقَّ لَهُ أَبُو عَبْدِ اللَّهِ (عليه السلام) وَ دَمَعَتْ عَيْنَاهُ فَقُلْتُ لَهُ لَقَدْ رَأَيْتُكَ صَنَعْتَ بِهِ مَا لَمْ تَكُنْ تَصْنَعُ فَقَالَ رَقَقْتُ لَهُ لِأَنَّهُ يُنْسَبُ إِلَى أَمْرٍ لَيْسَ لَهُ لَمْ أَجِدْهُ فِي كِتَابِ عَلِيٍّ (عليه السلام) مِنْ خُلَفَاءِ هَذِهِ الْأُمَّةِ وَ لَا مِنْ مُلُوكِهَا."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473731\">H 15041</a> – And by this chain, from Anbasat, from Moalla Bin Khunays who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> was in the presence</span> of Abu Abdullah<sup>asws</sup> when Muhammad Bin Abdullah came up and greeted, then went away. Abu Abdullah<sup>asws</sup> sympathised and tears flowed from his<sup>asws</sup> eyes. So I said to him<sup>asws</sup>, ‘I saw you<sup>asws</sup> doing something what you never did for anyone before’. He<sup>asws</sup> said; ‘I<sup>asws</sup> sympathised for him because he will be established upon a command which is not for him. I<sup>asws</sup> did not find him in the Book of Ali<sup>asws</sup> from the Caliphs of this community, nor from its kings’. "
          ],
          "en.sarwar": [
            "595. Ali Bin Ibrahim, by an unbroken chain, said: ‘Abu Abdullah (a.s.) said to a man: ‘What are considered to be the young ones (Al-Fati) among you?’ He said to him (a.s.), ‘The youth’. So he (a.s.) said; ‘No! Al-Fati is the Believer. The Companions of the Cave (As’haab Al-Kahf) were old people, Allah (azwj) Mighty and Majestic Called them ‘Young men’ due to their belief’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 607)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15280,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:52:10",
        "relations": {
          "Mentions": [
            "/books/quran:34:19",
            "/books/quran:34:17"
          ]
        },
        "text": [
          "15042- عَلِيُّ بْنُ إِبْرَاهِيمَ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) لِرَجُلٍ مَا الْفَتَى عِنْدَكُمْ فَقَالَ لَهُ الشَّابُّ فَقَالَ لَا الْفَتَى الْمُؤْمِنُ إِنَّ أَصْحَابَ الْكَهْفِ كَانُوا شُيُوخاً فَسَمَّاهُمُ اللَّهُ عَزَّ وَ جَلَّ فِتْيَةً بِإِيمَانِهِمْ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473732\">H 15042</a> – Ali Bin Ibrahim, by an unbroken chain, said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>bu Abdullah</span><sup>asws</sup> said to a man: ‘What are considered to be the young ones (<span class=\"iTxt\">Al-Fati</span>) among you?’ He said to him<sup>asws</sup>, ‘The youth’. So he<sup>asws</sup> said; ‘No! <span class=\"iTxt\">Al-Fati</span> is the Believer. The Companions of the Cave (As’haab Al-Kahf) were old people, Allah<sup>azwj</sup> Mighty and Majestic Called them ‘Young men’ due to their belief’. "
          ],
          "en.sarwar": [
            "596. Muhammad, from Ahmad Bin Muhammad, from Ibn Mahboub, from Jameel Bin Salih, from Sadeyr who said: ‘A man asked Abu Ja’far (a.s.) about the Statement of Allah (azwj) Mighty and Majestic: “<a href=\"/#/books/quran:34#h19\">[34:19]</a> And they said: O our Lord! make spaces to be longer between our journeys; and they were unjust to themselves”. He (a.s.) said: ‘They were a people who live in two inter-connected villages and were able to see each other, and rivers which flowed, and phenomenal wealth. They denied the Favours of Allah (azwj) and changed what was in themselves, so Allah (azwj) Mighty and Majestic Sent the flood of Al-Aram against them. Their two villages were submerged, and their houses were spoilt, and their wealth was gone. It changed their plantations into two plantations to be only with the edible plants of bitter tamarisk (a troublesome weed) and a few Lutus trees. Then Allah (azwj) Mighty and Majestic Said: “<a href=\"/#/books/quran:34#h17\">[34:17]</a> This We requited them with because they disbelieved; and We do not punish any but the ungrateful”."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6 / 607)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 15281,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:52:11",
        "relations": {
          "Mentions": [
            "/books/quran:34:19",
            "/books/quran:34:17"
          ]
        },
        "text": [
          "15043- مُحَمَّدٌ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ سَدِيرٍ قَالَ سَأَلَ رَجُلٌ أَبَا جَعْفَرٍ (عليه السلام) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَقالُوا رَبَّنا باعِدْ بَيْنَ أَسْفارِنا وَ ظَلَمُوا أَنْفُسَهُمْ فَقَالَ هَؤُلَاءِ قَوْمٌ كَانَ لَهُمْ قُرًى مُتَّصِلَةٌ يَنْظُرُ بَعْضُهُمْ إِلَى بَعْضٍ وَ أَنْهَارٌ جَارِيَةٌ وَ أَمْوَالٌ ظَاهِرَةٌ فَكَفَرُوا بِأَنْعُمِ اللَّهِ وَ غَيَّرُوا مَا بِأَنْفُسِهِمْ فَأَرْسَلَ اللَّهُ عَزَّ وَ جَلَّ عَلَيْهِمْ سَيْلَ الْعَرِمِ فَغَرَّقَ قُرَاهُمْ وَ أَخْرَبَ دِيَارَهُمْ وَ أَذْهَبَ بِأَمْوَالِهِمْ وَ أَبْدَلَهُمْ مَكَانَ جَنَّاتِهِمْ جَنَّتَيْنِ ذَوَاتَيْ أُكُلٍ خَمْطٍ وَ أَثْلٍ وَ شَيْ‏ءٍ مِنْ سِدْرٍ قَلِيلٍ ثُمَّ قَالَ اللَّهُ عَزَّ وَ جَلَّ ذلِكَ جَزَيْناهُمْ بِما كَفَرُوا وَ هَلْ نُجازِي إِلَّا الْكَفُورَ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473733\">H 15043</a> – Muhammad, from Ahmad Bin Muhammad, from Ibn Mahboub, from Jameel Bin Salih, from Sadeyr who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span> man asked Abu Ja’far</span><sup>asws</sup> about the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“<a href=\"/#/books/quran:34#h19\">[34:19]</a> And they said: O our Lord! make spaces to be longer between our journeys; and they were unjust to themselves”</span>. He<sup>asws</sup> said: ‘They were a people who live in two inter-connected villages and were able to see each other, and rivers which flowed, and phenomenal wealth. They denied the Favours of Allah<sup>azwj</sup> and changed what was in themselves, so Allah<sup>azwj</sup> Mighty and Majestic Sent the flood of Al-Aram against them. Their two villages were submerged, and their houses were spoilt, and their wealth was gone. It changed their plantations into two plantations to be only with the edible plants of bitter tamarisk (a troublesome weed) and a few Lutus trees. Then Allah<sup>azwj</sup> Mighty and Majestic Said: <span class=\"ibTxt\">“<a href=\"/#/books/quran:34#h17\">[34:17]</a> This We requited them with because they disbelieved; and We do not punish any but the ungrateful”</span>."
          ],
          "en.sarwar": [
            "597. Al-Husayn Bin Muhammad Al-Ashary, from Mu‘alla Bin Muhammad, from Al-Washa’, from Abu Baseer, from Ahmad Bin Umar who said: ‘Abu Ja’far (a.s.) said, when a man came up to him (a.s.), so he said to him (a.s.), ‘You (a.s.) all are the People (a.s.) of the Household of Mercy which Allah (azwj) Blessed and High has Specialised you (a.s.) all with’. He (a.s.) said: ‘That is what we (a.s.) are, and the Praise is due to Allah (azwj) that we (a.s.) do not enter anyone into misguidance, nor do we (a.s.) take anyone out of Guidance. The world will not end until Allah (azwj) Mighty and Majestic would Send a man (a.s.) from us (a.s.) the People (a.s.) of the Household, who (a.s.) will act by the Book of Allah (azwj). He (a.s.) will not see any evil among you all except that he (a.s.) will forbid it’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:52",
  "kind": "verse_list"
}