{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 8"}, "path": "/books/al-kafi:8", "titles": {"ar": "الجزء الثامن‏", "en": "Volume Eight"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:8:1", "titles": {"ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;", "en": "The Book - Garden (of Flowers)"}}, {"indexed_titles": {"en": "Chapter 6"}, "path": "/books/al-kafi:8:1:6", "titles": {"ar": "حَدِيثُ مُوسَى (عليه السلام)", "en": "HADEETH OF MUSA<sup>as</sup>"}}], "index": 2267, "local_index": 6, "part_type": "Chapter", "path": "/books/al-kafi:8:1:6", "titles": {"ar": "حَدِيثُ مُوسَى (عليه السلام)", "en": "HADEETH OF MUSA<sup>as</sup>"}, "verse_count": 8, "verse_start_index": 14680, "verses": [{"index": 14681, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:8:1:6:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14456</span>-  عَلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ عَلِيِّ بْنِ عِيسَى رَفَعَهُ \n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ق</span>َالَ إِنَّ مُوسَى</span> (عليه السلام) نَاجَاهُ اللَّهُ تَبَارَكَ وَ تَعَالَى فَقَالَ لَهُ فِي مُنَاجَاتِهِ يَا مُوسَى لَا يَطُولُ فِي الدُّنْيَا أَمَلُكَ فَيَقْسُوَ لِذَلِكَ قَلْبُكَ وَ قَاسِي الْقَلْبِ مِنِّي بَعِيدٌ \nيَا مُوسَى كُنْ كَمَسَرَّتِي فِيكَ فَإِنَّ مَسَرَّتِي أَنْ أُطَاعَ فَلَا أُعْصَى فَأَمِتْ قَلْبَكَ بِالْخَشْيَةِ وَ كُنْ خَلَقَ الثِّيَابِ جَدِيدَ الْقَلْبِ تُخْفَى عَلَى أَهْلِ الْأَرْضِ وَ تُعْرَفُ فِي أَهْلِ السَّمَاءِ حِلْسَ الْبُيُوتِ مِصْبَاحَ اللَّيْلِ وَ اقْنُتْ بَيْنَ يَدَيَّ قُنُوتَ الصَّابِرِينَ وَ صِحْ إِلَيَّ مِنْ كَثْرَةِ الذُّنُوبِ صِيَاحَ الْمُذْنِبِ الْهَارِبِ مِنْ عَدُوِّهِ وَ اسْتَعِنْ بِي عَلَى ذَلِكَ فَإِنِّي نِعْمَ الْعَوْنُ وَ نِعْمَ الْمُسْتَعَانُ \nيَا مُوسَى إِنِّي أَنَا اللَّهُ فَوْقَ الْعِبَادِ وَ الْعِبَادُ دُونِي وَ كُلٌّ لِي دَاخِرُونَ فَاتَّهِمْ نَفْسَكَ عَلَى نَفْسِكَ وَ لَا تَأْتَمِنْ وَلَدَكَ عَلَى دِينِكَ إِلَّا أَنْ يَكُونَ وَلَدُكَ مِثْلَكَ يُحِبُّ الصَّالِحِينَ\nيَا مُوسَى اغْسِلْ وَ اغْتَسِلْ وَ اقْتَرِبْ مِنْ عِبَادِيَ الصَّالِحِينَ \nيَا مُوسَى كُنْ إِمَامَهُمْ فِي صَلَاتِهِمْ وَ إِمَامَهُمْ فِيمَا يَتَشَاجَرُونَ وَ احْكُمْ بَيْنَهُمْ بِمَا أَنْزَلْتُ عَلَيْكَ فَقَدْ أَنْزَلْتُهُ حُكْماً بَيِّناً وَ بُرْهَاناً نَيِّراً وَ نُوراً يَنْطِقُ بِمَا كَانَ فِي الْأَوَّلِينَ وَ بِمَا هُوَ كَائِنٌ فِي الْآخِرِينَ\nأُوصِيكَ يَا مُوسَى وَصِيَّةَ الشَّفِيقِ الْمُشْفِقِ بِابْنِ الْبَتُولِ عِيسَى ابْنِ مَرْيَمَ صَاحِبِ الْأَتَانِ وَ الْبُرْنُسِ وَ الزَّيْتِ وَ الزَّيْتُونِ وَ الْمِحْرَابِ وَ مِنْ بَعْدِهِ بِصَاحِبِ الْجَمَلِ الْأَحْمَرِ الطَّيِّبِ الطَّاهِرِ الْمُطَهَّرِ فَمَثَلُهُ فِي كِتَابِكَ أَنَّهُ مُؤْمِنٌ مُهَيْمِنٌ عَلَى الْكُتُبِ كُلِّهَا وَ أَنَّهُ رَاكِعٌ سَاجِدٌ رَاغِبٌ رَاهِبٌ إِخْوَانُهُ الْمَسَاكِينُ وَ أَنْصَارُهُ قَوْمٌ آخَرُونَ وَ يَكُونُ فِي زَمَانِهِ أَزْلٌ وَ زِلْزَالٌ وَ قَتْلٌ وَ قِلَّةٌ مِنَ الْمَالِ اسْمُهُ أَحْمَدُ مُحَمَّدٌ الْأَمِينُ مِنَ الْبَاقِينَ مِنْ ثُلَّةِ الْأَوَّلِينَ الْمَاضِينَ يُؤْمِنُ بِالْكُتُبِ كُلِّهَا وَ يُصَدِّقُ جَمِيعَ الْمُرْسَلِينَ وَ يَشْهَدُ بِالْإِخْلَاصِ لِجَمِيعِ النَّبِيِّينَ أُمَّتُهُ مَرْحُومَةٌ مُبَارَكَةٌ مَا بَقُوا فِي الدِّينِ عَلَى حَقَائِقِهِ لَهُمْ سَاعَاتٌ مُوَقَّتَاتٌ يُؤَدُّونَ فِيهَا الصَّلَوَاتِ أَدَاءَ الْعَبْدِ إِلَى سَيِّدِهِ نَافِلَتَهُ فَبِهِ فَصَدِّقْ وَ مِنْهَاجَهُ فَاتَّبِعْ فَإِنَّهُ أَخُوكَ\nيَا مُوسَى إِنَّهُ أُمِّيٌّ وَ هُوَ عَبْدٌ صِدْقٌ يُبَارَكُ لَهُ فِيمَا وَضَعَ يَدَهُ عَلَيْهِ وَ يُبَارَكُ عَلَيْهِ كَذَلِكَ كَانَ فِي عِلْمِي وَ كَذَلِكَ خَلَقْتُهُ بِهِ أَفْتَحُ السَّاعَةَ وَ بِأُمَّتِهِ أَخْتِمُ مَفَاتِيحَ الدُّنْيَا فَمُرْ ظَلَمَةَ بَنِي إِسْرَائِيلَ أَنْ لَا يَدْرُسُوا اسْمَهُ وَ لَا يَخْذُلُوهُ وَ إِنَّهُمْ لَفَاعِلُونَ وَ حُبُّهُ لِي حَسَنَةٌ فَأَنَا مَعَهُ وَ أَنَا مِنْ حِزْبِهِ وَ هُوَ مِنْ حِزْبِي وَ حِزْبُهُمُ الْغَالِبُونَ فَتَمَّتْ كَلِمَاتِي لَأُظْهِرَنَّ دِينَهُ عَلَى الْأَدْيَانِ كُلِّهَا وَ لَأُعْبَدَنَّ بِكُلِّ مَكَانٍ وَ لَأُنْزِلَنَّ عَلَيْهِ قُرْآناً فُرْقَاناً شِفَاءً لِمَا فِي الصُّدُورِ مِنْ نَفْثِ الشَّيْطَانِ فَصَلِّ عَلَيْهِ يَا ابْنَ عِمْرَانَ فَإِنِّي أُصَلِّي عَلَيْهِ وَ مَلَائِكَتِي\nيَا مُوسَى أَنْتَ عَبْدِي وَ أَنَا إِلَهُكَ لَا تَسْتَذِلَّ الْحَقِيرَ الْفَقِيرَ وَ لَا تَغْبِطِ الْغَنِيَّ بِشَيْ‏ءٍ يَسِيرٍ وَ كُنْ عِنْدَ ذِكْرِي خَاشِعاً وَ عِنْدَ تِلَاوَتِهِ بِرَحْمَتِي طَامِعاً وَ أَسْمِعْنِي لَذَاذَةَ التَّوْرَاةِ بِصَوْتٍ خَاشِعٍ حَزِينٍ اطْمَئِنَّ عِنْدَ ذِكْرِي وَ ذَكِّرْ بِي مَنْ يَطْمَئِنُّ إِلَيَّ وَ اعْبُدْنِي وَ لَا تُشْرِكْ بِي شَيْئاً وَ تَحَرَّ مَسَرَّتِي إِنِّي أَنَا السَّيِّدُ الْكَبِيرُ إِنِّي خَلَقْتُكَ مِنْ نُطْفَةٍ مِنْ مَاءٍ مَهِينٍ مِنْ طِينَةٍ أَخْرَجْتُهَا مِنْ أَرْضٍ ذَلِيلَةٍ مَمْشُوجَةٍ فَكَانَتْ بَشَراً فَأَنَا صَانِعُهَا خَلْقاً فَتَبَارَكَ وَجْهِي وَ تَقَدَّسَ صَنِيعِي لَيْسَ كَمِثْلِي شَيْ‏ءٌ وَ أَنَا الْحَيُّ الدَّائِمُ الَّذِي لَا أَزُولُ \nيَا مُوسَى كُنْ إِذَا دَعَوْتَنِي خَائِفاً مُشْفِقاً وَجِلًا عَفِّرْ وَجْهَكَ لِي فِي التُّرَابِ وَ اسْجُدْ لِي بِمَكَارِمِ بَدَنِكَ وَ اقْنُتْ بَيْنَ يَدَيَّ فِي الْقِيَامِ وَ نَاجِنِي حِينَ تُنَاجِينِي بِخَشْيَةٍ مِنْ قَلْبٍ وَجِلٍ وَ احْيَ بِتَوْرَاتِي أَيَّامَ الْحَيَاةِ وَ عَلِّمِ الْجُهَّالَ مَحَامِدِي وَ ذَكِّرْهُمْ آلَائِي وَ نِعْمَتِي وَ قُلْ لَهُمْ لَا يَتَمَادَوْنَ فِي غَيِّ مَا هُمْ فِيهِ فَإِنَّ أَخْذِي أَلِيمٌ شَدِيدٌ\nيَا مُوسَى إِذَا انْقَطَعَ حَبْلُكَ مِنِّي لَمْ يَتَّصِلْ بِحَبْلِ غَيْرِي فَاعْبُدْنِي وَ قُمْ بَيْنَ يَدَيَّ مَقَامَ الْعَبْدِ الْحَقِيرِ الْفَقِيرِ ذُمَّ نَفْسَكَ فَهِيَ أَوْلَى بِالذَّمِّ وَ لَا تَتَطَاوَلْ بِكِتَابِي عَلَى بَنِي إِسْرَائِيلَ فَكَفَى بِهَذَا وَاعِظاً لِقَلْبِكَ وَ مُنِيراً وَ هُوَ كَلَامُ رَبِّ الْعَالَمِينَ جَلَّ وَ تَعَالَى\nيَا مُوسَى مَتَى مَا دَعَوْتَنِي وَ رَجَوْتَنِي فَإِنِّي سَأَغْفِرُ لَكَ عَلَى مَا كَانَ مِنْكَ السَّمَاءُ تُسَبِّحُ لِي وَجَلًا وَ الْمَلَائِكَةُ مِنْ مَخَافَتِي مُشْفِقُونَ وَ الْأَرْضُ تُسَبِّحُ لِي طَمَعاً وَ كُلُّ الْخَلْقِ يُسَبِّحُونَ لِي دَاخِرُونَ ثُمَّ عَلَيْكَ بِالصَّلَاةِ الصَّلَاةِ فَإِنَّهَا مِنِّي بِمَكَانٍ وَ لَهَا عِنْدِي عَهْدٌ وَثِيقٌ وَ أَلْحِقْ بِهَا مَا هُوَ مِنْهَا زَكَاةَ الْقُرْبَانِ مِنْ طَيِّبِ الْمَالِ وَ الطَّعَامِ فَإِنِّي لَا أَقْبَلُ إِلَّا الطَّيِّبَ يُرَادُ بِهِ وَجْهِي وَ اقْرُنْ مَعَ ذَلِكَ صِلَةَ الْأَرْحَامِ فَإِنِّي أَنَا اللَّهُ الرَّحْمَنُ الرَّحِيمُ وَ الرَّحِمُ أَنَا خَلَقْتُهَا فَضْلًا مِنْ رَحْمَتِي لِيَتَعَاطَفَ بِهَا الْعِبَادُ وَ لَهَا عِنْدِي سُلْطَانٌ فِي مَعَادِ الْآخِرَةِ وَ أَنَا قَاطِعُ مَنْ قَطَعَهَا وَ وَاصِلُ مَنْ وَصَلَهَا وَ كَذَلِكَ أَفْعَلُ بِمَنْ ضَيَّعَ أَمْرِي\nيَا مُوسَى أَكْرِمِ السَّائِلَ إِذَا أَتَاكَ بِرَدٍّ جَمِيلٍ أَوْ إِعْطَاءٍ يَسِيرٍ فَإِنَّهُ يَأْتِيكَ مَنْ لَيْسَ بِإِنْسٍ وَ لَا جَانٍّ مَلَائِكَةُ الرَّحْمَنِ يَبْلُونَكَ كَيْفَ أَنْتَ صَانِعٌ فِيمَا أَوْلَيْتُكَ وَ كَيْفَ مُوَاسَاتُكَ فِيمَا خَوَّلْتُكَ وَ اخْشَعْ لِي بِالتَّضَرُّعِ وَ اهْتِفْ لِي بِوَلْوَلَةِ الْكِتَابِ وَ اعْلَمْ أَنِّي أَدْعُوكَ دُعَاءَ السَّيِّدِ مَمْلُوكَهُ لِيَبْلُغَ بِهِ شَرَفَ الْمَنَازِلِ وَ ذَلِكَ مِنْ فَضْلِي عَلَيْكَ وَ عَلَى آبَائِكَ الْأَوَّلِينَ\nيَا مُوسَى لَا تَنْسَنِي عَلَى كُلِّ حَالٍ وَ لَا تَفْرَحْ بِكَثْرَةِ الْمَالِ فَإِنَّ نِسْيَانِي يُقْسِي الْقُلُوبَ وَ مَعَ كَثْرَةِ الْمَالِ كَثْرَةُ الذُّنُوبِ الْأَرْضُ مُطِيعَةٌ وَ السَّمَاءُ مُطِيعَةٌ وَ الْبِحَارُ مُطِيعَةٌ وَ عِصْيَانِي شَقَاءُ الثَّقَلَيْنِ وَ أَنَا الرَّحْمَنُ الرَّحِيمُ رَحْمَانُ كُلِّ زَمَانٍ آتِي بِالشِّدَّةِ بَعْدَ الرَّخَاءِ وَ بِالرَّخَاءِ بَعْدَ الشِّدَّةِ وَ بِالْمُلُوكِ بَعْدَ الْمُلُوكِ وَ مُلْكِي دَائِمٌ قَائِمٌ لَا يَزُولُ وَ لَا يَخْفَى عَلَيَّ شَيْ‏ءٌ فِي الْأَرْضِ وَ لَا فِي السَّمَاءِ وَ كَيْفَ يَخْفَى عَلَيَّ مَا مِنِّي مُبْتَدَؤُهُ وَ كَيْفَ لَا يَكُونُ هَمُّكَ فِيمَا عِنْدِي وَ إِلَيَّ تَرْجِعُ لَا مَحَالَةَ\nيَا مُوسَى اجْعَلْنِي حِرْزَكَ وَ ضَعْ عِنْدِي كَنْزَكَ مِنَ الصَّالِحَاتِ وَ خَفْنِي وَ لَا تَخَفْ غَيْرِي إِلَيَّ الْمَصِيرُ \nيَا مُوسَى ارْحَمْ مَنْ هُوَ أَسْفَلُ مِنْكَ فِي الْخَلْقِ وَ لَا تَحْسُدْ مَنْ هُوَ فَوْقَكَ فَإِنَّ الْحَسَدَ يَأْكُلُ الْحَسَنَاتِ كَمَا تَأْكُلُ النَّارُ الْحَطَبَ\nيَا مُوسَى إِنَّ ابْنَيْ آدَمَ تَوَاضَعَا فِي مَنْزِلَةٍ لِيَنَالَا بِهَا مِنْ فَضْلِي وَ رَحْمَتِي فَقَرَّبَا قُرْبَاناً وَ لَا أَقْبَلُ إِلَّا مِنَ الْمُتَّقِينَ فَكَانَ مِنْ شَأْنِهِمَا مَا قَدْ عَلِمْتَ فَكَيْفَ تَثِقُ بِالصَّاحِبِ بَعْدَ الْأَخِ وَ الْوَزِيرِ \nيَا مُوسَى ضَعِ الْكِبْرَ وَ دَعِ الْفَخْرَ وَ اذْكُرْ أَنَّكَ سَاكِنُ الْقَبْرِ فَلْيَمْنَعْكَ ذَلِكَ مِنَ الشَّهَوَاتِ \nيَا مُوسَى عَجِّلِ التَّوْبَةَ وَ أَخِّرِ الذَّنْبَ وَ تَأَنَّ فِي الْمَكْثِ بَيْنَ يَدَيَّ فِي الصَّلَاةِ وَ لَا تَرْجُ غَيْرِي اتَّخِذْنِي جُنَّةً لِلشَّدَائِدِ وَ حِصْناً لِمُلِمَّاتِ الْأُمُورِ\nيَا مُوسَى كَيْفَ تَخْشَعُ لِي خَلِيقَةٌ لَا تَعْرِفُ فَضْلِي عَلَيْهَا وَ كَيْفَ تَعْرِفُ فَضْلِي عَلَيْهَا وَ هِيَ لَا تَنْظُرُ فِيهِ وَ كَيْفَ تَنْظُرُ فِيهِ وَ هِيَ لَا تُؤْمِنُ بِهِ وَ كَيْفَ تُؤْمِنُ بِهِ وَ هِيَ لَا تَرْجُو ثَوَاباً وَ كَيْفَ تَرْجُو ثَوَاباً وَ هِيَ قَدْ قَنِعَتْ بِالدُّنْيَا وَ اتَّخَذَتْهَا مَأْوًى وَ رَكَنَتْ إِلَيْهَا رُكُونَ الظَّالِمِينَ\nيَا مُوسَى نَافِسْ فِي الْخَيْرِ أَهْلَهُ فَإِنَّ الْخَيْرَ كَاسْمِهِ وَ دَعِ الشَّرَّ لِكُلِّ مَفْتُونٍ \nيَا مُوسَى اجْعَلْ لِسَانَكَ مِنْ وَرَاءِ قَلْبِكَ تَسْلَمْ وَ أَكْثِرْ ذِكْرِي بِاللَّيْلِ وَ النَّهَارِ تَغْنَمْ وَ لَا تَتَّبِعِ الْخَطَايَا فَتَنْدَمَ فَإِنَّ الْخَطَايَا مَوْعِدُهَا النَّارُ\nيَا مُوسَى أَطِبِ الْكَلَامَ لِأَهْلِ التَّرْكِ لِلذُّنُوبِ وَ كُنْ لَهُمْ جَلِيساً وَ اتَّخِذْهُمْ لِغَيْبِكَ إِخْوَاناً وَ جِدَّ مَعَهُمْ يَجِدُّونَ مَعَكَ\nيَا مُوسَى الْمَوْتُ يَأْتِيكَ لَا مَحَالَةَ فَتَزَوَّدْ زَادَ مَنْ هُوَ عَلَى مَا يَتَزَوَّدُ وَارِدٌ عَلَى الْيَقِينِ\nيَا مُوسَى مَا أُرِيدَ بِهِ وَجْهِي فَكَثِيرٌ قَلِيلُهُ وَ مَا أُرِيدَ بِهِ غَيْرِي فَقَلِيلٌ كَثِيرُهُ وَ إِنَّ أَصْلَحَ أَيَّامِكَ الَّذِي هُوَ أَمَامَكَ فَانْظُرْ أَيُّ يَوْمٍ هُوَ فَأَعِدَّ لَهُ الْجَوَابَ فَإِنَّكَ مَوْقُوفٌ وَ مَسْئُولٌ وَ خُذْ مَوْعِظَتَكَ مِنَ الدَّهْرِ وَ أَهْلِهِ فَإِنَّ الدَّهْرَ طَوِيلُهُ قَصِيرٌ وَ قَصِيرُهُ طَوِيلٌ وَ كُلُّ شَيْ‏ءٍ فَانٍ فَاعْمَلْ كَأَنَّكَ تَرَى ثَوَابَ عَمَلِكَ لِكَيْ يَكُونَ أَطْمَعَ لَكَ فِي الْآخِرَةِ لَا مَحَالَةَ فَإِنَّ مَا بَقِيَ مِنَ الدُّنْيَا كَمَا وَلَّى مِنْهَا وَ كُلُّ عَامِلٍ يَعْمَلُ عَلَى بَصِيرَةٍ وَ مِثَالٍ فَكُنْ مُرْتَاداً لِنَفْسِكَ يَا ابْنَ عِمْرَانَ لَعَلَّكَ تَفُوزُ غَداً يَوْمَ السُّؤَالِ فَهُنَالِكَ يَخْسَرُ الْمُبْطِلُونَ\nيَا مُوسَى أَلْقِ كَفَّيْكَ ذُلًّا بَيْنَ يَدَيَّ كَفِعْلِ الْعَبْدِ الْمُسْتَصْرِخِ إِلَى سَيِّدِهِ فَإِنَّكَ إِذَا فَعَلْتَ ذَلِكَ رُحِمْتَ وَ أَنَا أَكْرَمُ الْقَادِرِينَ \nيَا مُوسَى سَلْنِي مِنْ فَضْلِي وَ رَحْمَتِي فَإِنَّهُمَا بِيَدِي لَا يَمْلِكُهُمَا أَحَدٌ غَيْرِي وَ انْظُرْ حِينَ تَسْأَلُنِي كَيْفَ رَغْبَتَكَ فِيمَا عِنْدِي لِكُلِّ عَامِلٍ جَزَاءٌ وَ قَدْ يُجْزَى الْكَفُورُ بِمَا سَعَى\nيَا مُوسَى طِبْ نَفْساً عَنِ الدُّنْيَا وَ انْطَوِ عَنْهَا فَإِنَّهَا لَيْسَتْ لَكَ وَ لَسْتَ لَهَا مَا لَكَ وَ لِدَارِ الظَّالِمِينَ إِلَّا لِعَامِلٍ فِيهَا بِالْخَيْرِ فَإِنَّهَا لَهُ نِعْمَ الدَّارُ \nيَا مُوسَى مَا آمُرُكَ بِهِ فَاسْمَعْ وَ مَهْمَا أَرَاهُ فَاصْنَعْ خُذْ حَقَائِقَ التَّوْرَاةِ إِلَى صَدْرِكَ وَ تَيَقَّظْ بِهَا فِي سَاعَاتِ اللَّيْلِ وَ النَّهَارِ وَ لَا تُمَكِّنْ أَبْنَاءَ الدُّنْيَا مِنْ صَدْرِكَ فَيَجْعَلُونَهُ وَكْراً كَوَكْرِ الطَّيْرِ\nيَا مُوسَى أَبْنَاءُ الدُّنْيَا وَ أَهْلُهَا فِتَنٌ بَعْضُهُمْ لِبَعْضٍ فَكُلٌّ مُزَيَّنٌ لَهُ مَا هُوَ فِيهِ وَ الْمُؤْمِنُ مَنْ زُيِّنَتْ لَهُ الْآخِرَةُ فَهُوَ يَنْظُرُ إِلَيْهَا مَا يَفْتُرُ قَدْ حَالَتْ شَهْوَتُهَا بَيْنَهُ وَ بَيْنَ لَذَّةِ الْعَيْشِ فَأَدْلَجَتْهُ بِالْأَسْحَارِ كَفِعْلِ الرَّاكِبِ السَّائِقِ إِلَى غَايَتِهِ يَظَلُّ كَئِيباً وَ يُمْسِي حَزِيناً فَطُوبَى لَهُ لَوْ قَدْ كُشِفَ الْغِطَاءُ مَا ذَا يُعَايِنُ مِنَ السُّرُورِ\nيَا مُوسَى الدُّنْيَا نُطْفَةٌ لَيْسَتْ بِثَوَابٍ لِلْمُؤْمِنِ وَ لَا نَقِمَةٍ مِنْ فَاجِرٍ فَالْوَيْلُ الطَّوِيلُ لِمَنْ بَاعَ ثَوَابَ مَعَادِهِ بِلَعْقَةٍ لَمْ تَبْقَ وَ بِلَعْسَةٍ لَمْ تَدُمْ وَ كَذَلِكَ فَكُنْ كَمَا أَمَرْتُكَ وَ كُلُّ أَمْرِي رَشَادٌ\nيَا مُوسَى إِذَا رَأَيْتَ الْغِنَى مُقْبِلًا فَقُلْ ذَنْبٌ عُجِّلَتْ لِي عُقُوبَتُهُ وَ إِذَا رَأَيْتَ الْفَقْرَ مُقْبِلًا فَقُلْ مَرْحَباً بِشِعَارِ الصَّالِحِينَ وَ لَا تَكُنْ جَبَّاراً ظَلُوماً وَ لَا تَكُنْ لِلظَّالِمِينَ قَرِيناً\nيَا مُوسَى مَا عُمُرٌ وَ إِنْ طَالَ يُذَمُّ آخِرُهُ وَ مَا ضَرَّكَ مَا زُوِيَ عَنْكَ إِذَا حُمِدَتْ مَغَبَّتُهُ\nيَا مُوسَى صَرَخَ الْكِتَابُ إِلَيْكَ صُرَاخاً بِمَا أَنْتَ إِلَيْهِ صَائِرٌ فَكَيْفَ تَرْقُدُ عَلَى هَذَا الْعُيُونُ أَمْ كَيْفَ يَجِدُ قَوْمٌ لَذَّةَ الْعَيْشِ لَوْ لَا التَّمَادِي فِي الْغَفْلَةِ وَ الِاتِّبَاعُ لِلشِّقْوَةِ وَ التَّتَابُعُ لِلشَّهْوَةِ وَ مِنْ دُونِ هَذَا يَجْزَعُ الصِّدِّيقُونَ\nيَا مُوسَى مُرْ عِبَادِي يَدْعُونِي عَلَى مَا كَانَ بَعْدَ أَنْ يُقِرُّوا لِي أَنِّي أَرْحَمُ الرَّاحِمِينَ مُجِيبُ الْمُضْطَرِّينَ وَ أَكْشِفُ السُّوءَ وَ أُبَدِّلُ الزَّمَانَ وَ آتِي بِالرَّخَاءِ وَ أَشْكُرُ الْيَسِيرَ وَ أُثِيبُ الْكَثِيرَ وَ أُغْنِي الْفَقِيرَ وَ أَنَا الدَّائِمُ الْعَزِيزُ الْقَدِيرُ فَمَنْ لَجَأَ إِلَيْكَ وَ انْضَوَى إِلَيْكَ مِنَ الْخَاطِئِينَ فَقُلْ أَهْلًا وَ سَهْلًا يَا رَحْبَ الْفِنَاءِ بِفِنَاءِ رَبِّ الْعَالَمِينَ وَ اسْتَغْفِرْ لَهُمْ وَ كُنْ لَهُمْ كَأَحَدِهِمْ وَ لَا تَسْتَطِلْ عَلَيْهِمْ بِمَا أَنَا أَعْطَيْتُكَ فَضْلَهُ وَ قُلْ لَهُمْ فَلْيَسْأَلُونِي مِنْ فَضْلِي وَ رَحْمَتِي فَإِنَّهُ لَا يَمْلِكُهَا أَحَدٌ غَيْرِي وَ أَنَا ذُو الْفَضْلِ الْعَظِيمِ طُوبَى لَكَ\nيَا مُوسَى كَهْفُ الْخَاطِئِينَ وَ جَلِيسُ الْمُضْطَرِّينَ وَ مُسْتَغْفِرٌ لِلْمُذْنِبِينَ إِنَّكَ مِنِّي بِالْمَكَانِ الرَّضِيِّ فَادْعُنِي بِالْقَلْبِ النَّقِيِّ وَ اللِّسَانِ الصَّادِقِ وَ كُنْ كَمَا أَمَرْتُكَ أَطِعْ أَمْرِي وَ لَا تَسْتَطِلْ عَلَى عِبَادِي بِمَا لَيْسَ مِنْكَ مُبْتَدَاهُ وَ تَقَرَّبْ إِلَيَّ فَإِنِّي مِنْكَ قَرِيبٌ فَإِنِّي لَمْ أَسْأَلْكَ مَا يُؤْذِيكَ ثِقَلُهُ وَ لَا حَمْلُهُ إِنَّمَا سَأَلْتُكَ أَنْ تَدْعُوَنِي فَأُجِيبَكَ وَ أَنْ تَسْأَلَنِي فَأُعْطِيَكَ وَ أَنْ تَتَقَرَّبَ إِلَيَّ بِمَا مِنِّي أَخَذْتَ تَأْوِيلَهُ وَ عَلَيَّ تَمَامُ تَنْزِيلِهِ\nيَا مُوسَى انْظُرْ إِلَى الْأَرْضِ فَإِنَّهَا عَنْ قَرِيبٍ قَبْرُكَ وَ ارْفَعْ عَيْنَيْكَ إِلَى السَّمَاءِ فَإِنَّ فَوْقَكَ فِيهَا مَلِكاً عَظِيماً وَ ابْكِ عَلَى نَفْسِكَ مَا دُمْتَ فِي الدُّنْيَا وَ تَخَوَّفِ الْعَطَبَ وَالْمَهَالِكَ وَ لَا تَغُرَّنَّكَ زِينَةُ الدُّنْيَا وَ زَهْرَتُهَا وَ لَا تَرْضَ بِالظُّلْمِ وَ لَا تَكُنْ ظَالِماً فَإِنِّي لِلظَّالِمِ رَصِيدٌ حَتَّى أُدِيلَ مِنْهُ الْمَظْلُومَ\nيَا مُوسَى إِنَّ الْحَسَنَةَ عَشَرَةُ أَضْعَافٍ وَ مِنَ السَّيِّئَةِ الْوَاحِدَةِ الْهَلَاكُ لَا تُشْرِكْ بِي لَا يَحِلُّ لَكَ أَنْ تُشْرِكَ بِي قَارِبْ وَ سَدِّدْ وَ ادْعُ دُعَاءَ الطَّامِعِ الرَّاغِبِ فِيمَا عِنْدِي النَّادِمِ عَلَى مَا قَدَّمَتْ يَدَاهُ فَإِنَّ سَوَادَ اللَّيْلِ يَمْحُوهُ النَّهَارُ وَ كَذَلِكَ السَّيِّئَةُ تَمْحُوهَا الْحَسَنَةُ وَ عَشْوَةُ اللَّيْلِ تَأْتِي عَلَى ضَوْءِ النَّهَارِ وَ كَذَلِكَ السَّيِّئَةُ تَأْتِي عَلَى الْحَسَنَةِ الْجَلِيلَةِ فَتُسَوِّدُهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473099\">H 14456</a> – Ali Bin Ibrahim, from his father, from Amro Bin Usman, from Ali Bin Isa, from an unbroken chain. \nHe<sup>asws</sup> said: ‘ (Prophet) Musa<sup>as</sup> was whispering (Munajaat) to Allah<sup>azwj</sup> Blessed and High. He<sup>azwj</sup> Said in His<sup>azwj</sup> Whispering: ‘O Musa<sup>as</sup>! Do not have long hopes regarding the world. That would harden your<sup>as</sup> heart, and the hard-hearted one is remote from Me<sup>azwj</sup>. \nO Musa<sup>as</sup>! Turn yourself<sup>as</sup> (to obedience) for the sake of My<sup>azwj</sup> Pleasure, for if My<sup>azwj</sup> Pleasure is obeyed, so I<sup>azwj</sup> am not disobeyed. Kill your heart with the fear and create new clothes for the heart. You<sup>as</sup> will be hidden from the people of the earth and be recognised by the people of the sky. Spread out the lamps in your house at night and plead before Me<sup>azwj</sup> with the pleading of the patient ones and wail to Me<sup>azwj</sup> from the great number of the sins like the wailing of the sinner who has fled from his enemies. And seek help for that from Me<sup>azwj</sup> for I<sup>azwj</sup> am the Best of the Helpers, and the best of the Supporters.\nO Musa<sup>as</sup>! I<sup>azwj</sup> am Allah<sup>azwj</sup> high above the servants, and the servants are below Me<sup>azwj</sup>, and everyone is helpless before Me<sup>azwj</sup>. Accuse yourself for having wronged yourself, and do not trust your<sup>as</sup> son upon your<sup>as</sup> Religion unless he becomes like you<sup>as</sup>, loving the righteous ones. \nO Musa<sup>as</sup>! Wash and bathe and be near to My<sup>azwj</sup> righteous servants. \nO Musa<sup>as</sup>! Be their Imam in their Prayers, and their Imam in what they squabble about, and judge between them by what I<sup>azwj</sup> have Revealed unto you<sup>as</sup>. I<sup>azwj</sup> have Sent it down as a clear and luminous Proof, and a Light Speaking by what had transpired regarding the former ones and what will be regarding the later ones. \nI<sup>azwj</sup> Bequeath to you<sup>as</sup>, O Musa<sup>as</sup>, a bequest of the compassionate, the kind-hearted son of the Pious Lady, Isa<sup>as</sup> son of Maryam<sup>as</sup>, owner of the mule, and the hooded gown, and the oil and the olive, and the Prayer Niche. And from after him<sup>saww</sup>, about the owner of the red camel, the food, and pure, the purified. His<sup>saww</sup> example in your<sup>as</sup> Book is that he<sup>saww</sup> is a Believer, dominant over all the Books, and that he<sup>saww</sup> is the bowing one, the prostrating one, a seeker, a Monk, his<sup>saww</sup> brothers will be the poor, and his<sup>saww</sup> helpers will be another people, and there will occur in his<sup>saww</sup> era hardships and earthquakes, killings, and shortages of the wealth. His<sup>saww</sup> name would be Ahmad<sup>saww</sup>, Muhammad<sup>saww</sup>, the trusted one from the remaining ones of the previous generations. He<sup>saww</sup> will believe in all the Books and ratify all the Messengers<sup>as</sup> and testify sincerely for all the Prophets<sup>as</sup>. His<sup>saww</sup> community will be the ones under the Mercy, Blessed with what will remain in the Religion upon its reality. They will fulfill their Prayers at its prescribed times, as servants optionally do for their chiefs, acknowledge him<sup>saww</sup> and follow his<sup>saww</sup> path. So he<sup>saww</sup> is your<sup>as</sup> brother. \nO Musa<sup>as</sup>! He<sup>saww</sup> is the ‘Ummy’<a id=\"_ftnref7\"></a><sup>[7]</sup>, and he<sup>saww</sup> is a truthful servant. Whatever he<sup>saww</sup> places his<sup>saww</sup> hand upon, it becomes a Blessing for him<sup>saww</sup> and a Blessing for it. That is how it was in My<sup>saww</sup> Knowledge and that is how I<sup>azwj</sup> Created him<sup>saww</sup> as. It is by him<sup>saww</sup> that I<sup>azwj</sup> will Open the Hour (Day of Judgement) and it is by his<sup>saww</sup> community I<sup>azwj</sup> shall Seal (Bring an end to) the keys of the world. So, order the unjust ones of the Children of Israel that they should learn his<sup>saww</sup> name, and not to abandon it, but they (surely) will do it.\nAnd to love him<sup>saww</sup> is a good deed to Me<sup>azwj</sup>, for I<sup>azwj</sup> am with him<sup>saww</sup> and I<sup>azwj</sup> am from his<sup>saww</sup> group, and he<sup>saww</sup> is from My<sup>azwj</sup> Group, and their group shall overcome. So, I<sup>azwj</sup> have Completed My<sup>azwj</sup> Words and will Make his<sup>saww</sup> Religion to prevail over all the Religions, and I<sup>azwj</sup> will be worshipped in all places, and I<sup>azwj</sup> shall Reveal unto him<sup>saww</sup> the Quran as a Criterion, a healing for what is in the chests from the whisperings of Satan<sup>la</sup>. So send greetings to him<sup>saww</sup>, O son<sup>as</sup> of Imran<sup>as</sup>, for I<sup>azwj</sup> Send Greetings to him<sup>saww</sup> and so do My<sup>azwj</sup> Angels.  \nO Musa<sup>as</sup>! You<sup>as</sup> are My<sup>azwj</sup> servant and I<sup>azwj</sup> am your<sup>azwj</sup> God. Do not belittle the despicable, the poor, and do not envy the rich for a little thing. And become humble in My<sup>azwj</sup> Remembrance and in it’s (the Torah) Recitation ravenously by My<sup>azwj</sup> Mercy, and make Me<sup>azwj</sup> Hear the pleasance of the Torah in a humble voice, full of grief. Be at rest during My<sup>azwj</sup> Remembrance, and mention Me<sup>azwj</sup> to the ‘one’ who is assured to Me<sup>azwj</sup>, and worship Me<sup>azwj</sup> and do not associate with Me<sup>azwj</sup> anything. And make haste to My<sup>azwj</sup> Pleasure, ‘إِنِّي أَنَا السَّيِّدُ الْكَبِيرُ’ for I<sup>azwj</sup> and the Great Master<sup>azwj</sup>. I<sup>azwj</sup> Created you<sup>as</sup> from a seed of menial water from clay which I<sup>azwj</sup> Took out from a disgraceful mixture of dust. So it was a human being and I<sup>azwj</sup> carved it into a creature. So Blessed is My<sup>azwj</sup> ‘وَجْهِي’ (My Wali<sup>as</sup>), and Holy is My<sup>azwj</sup> Craft. There is nothing like Me<sup>azwj</sup> and I<sup>azwj</sup> am the Eternal Living One who will not Decline.\nO Musa<sup>as</sup>! When you supplicate to Me<sup>azwj</sup>, be fearful, anxious and rub your<sup>as</sup> face in the dust to Me<sup>azwj</sup> and prostrate to Me<sup>azwj</sup> by the noble parts of your<sup>as</sup> body, and plead in front of Me<sup>azwj</sup> when standing, and whisper to Me<sup>azwj</sup> when you whisper with a humble heart anxiously, and revive My<sup>azwj</sup> Torah in the days of the life, and teach My<sup>azwj</sup> Praise to the ignorant ones, and remind them of My<sup>azwj</sup> Favours, and My<sup>azwj</sup> Bounties, and tell them not to persist in the transgression in which they are engulfed, for My<sup>azwj</sup> Hold is Painful and Intense.\nO Musa<sup>as</sup>! If I<sup>azwj</sup> Cut off your Rope from Me<sup>azwj</sup> you<sup>as</sup> will not (be able to) connect with the rope of others. So, worship Me<sup>azwj</sup>, and stand in front of Me<sup>azwj</sup> like the standing of the lowly poor servant. Condemn yourself for it is the highest (most deserving) for condemnation, and do not empower the Children of Israel by My<sup>azwj</sup> Book, for it is sufficient advice for your<sup>as</sup> heart and an enlightenment, and it is the Speech of the Lord<sup>azwj</sup> of the Worlds, Majestic and High.\nO Musa<sup>as</sup>! Whenever you supplicate to Me<sup>azwj</sup> and refer to Me<sup>azwj</sup>, I<sup>azwj</sup> shall Forgive you<sup>as</sup> what was from you<sup>as</sup>. The sky Glorifies to Me<sup>azwj</sup> My<sup>azwj</sup> Majesty, and the Angels are fearful of Me<sup>a</sup><sup>zwj</sup> and anxious, and the earth Glorifies to Me<sup>azwj</sup> ravenously, and all of the creation Glorifies Me<sup>azwj</sup> in humbleness. Then it is on you to Pray. The Prayer has a place with Me<sup>azwj</sup> and for it has in My<sup>azwj</sup> Presence a firm Covenant and I<sup>azwj</sup> Attach to it what was from it. \nZakat is a sacrifice in order to cleanse the wealth, and the food, for I<sup>azwj</sup> do not Accept except for the ‘الطَّيِّبَ’ pure, (unless the instructions of) My<sup>azwj</sup> ‘وَجْهِي’ (My Wali<sup>as</sup>) are sought. And I<sup>azwj</sup> Joined with that the maintenance of relations, for I<sup>azwj</sup> am Allah<sup>azwj</sup>, the Beneficent, the Merciful, and as for the relationships, I<sup>azwj</sup> Created it Preferentially from My<sup>azwj</sup> Mercy for the servants to sympathise (with each other) by it, and for it, in My<sup>azwj</sup> Presence is an authorization in the return of the Hereafter, and I<sup>azwj</sup> will Cut-off the one who cuts it off (from My<sup>azwj</sup> Wali<sup>asws</sup>), and Connect with the one who keeps the connection (with My<sup>azwj</sup> Wali<sup>asws</sup>). And that is how I<sup>azwj</sup> will Deal in My<sup>azwj</sup> Command. \nO Musa<sup>as</sup>! Be generous to the beggar when he comes to you<sup>as</sup> by beautiful words, or giving easily because he may have come to you from neither from the humans nor from the Jinn. The Angels of the Beneficent come to test you<sup>as</sup> to see how you<sup>as</sup> are in your<sup>as</sup> dealings in regard to what I<sup>azwj</sup> have Given to you<sup>as</sup>, and how consoling you<sup>as</sup> are regarding what I<sup>azwj</sup> have Authorised you<sup>as</sup> with. And be humble to Me<sup>azwj</sup> with the beseeching, and wail to Me<sup>azwj</sup> by lamentations from the Book. And know that I<sup>azwj</sup> Call you with the Calling of the master to his slave to Make him reach to the honourable position, and that is from My<sup>azwj</sup> Grace to you<sup>as</sup> and to your<sup>as</sup> forefathers of the former ones.\nO Musa<sup>as</sup>! Do not forget Me<sup>azwj</sup> in every situation, and do not be happy due to the abundance of the wealth, because forgetting Me<sup>azwj</sup> hardens the hearts, and the abundance of the wealth brings the abundance of the sins. The earth is obedient, and the sky is obedient, and the oceans are obedient, whereas disobedient to Me<sup>azwj</sup> are the unfortunate ones of Humans and the Jinns (Al-Saqalayn). And I<sup>azwj</sup> am the Beneficent, the Merciful. I<sup>azwj</sup> am Beneficent in every era. I<sup>azwj</sup> Give hardship after ease, and ease after hardship, and kings after kings, whereas My<sup>azwj</sup> Kingdom is permanently based and will never cease. And there is not hidden from Me<sup>azwj</sup> anything in the earth, nor in the sky, and how can it be hidden from Me<sup>azwj</sup> and from Me<sup>azwj</sup> is its beginning, and how come you are not fearful regarding what is in My<sup>azwj</sup> possession, and to Me<sup>azwj</sup> you<sup>as</sup> will inevitably return. \nO Musa<sup>as</sup>! Make Me<sup>azwj</sup> to be your<sup>as</sup> Protector, and place in My<sup>azwj</sup> possession your treasure for the good deeds, and fear Me<sup>azwj</sup> and do not fear others. To Me<sup>azwj</sup> is the destination.\nO Musa<sup>as</sup>! Be merciful to the one who is lower than you among the creatures, and do not become jealous of the one who is above you<sup>as</sup>, for the jealousy consumes the good deeds just like the fire consumes the firewood. \nO Musa<sup>as</sup>! The two sons of Adam<sup>as</sup> wanted to express humbleness at a stage so that they could win My<sup>azwj</sup> Grace and My<sup>azwj</sup> Mercy. So they offered offerings, and I<sup>azwj</sup> do not Accept except from the pious ones. So their affair was what you<sup>as</sup> know, so, after this, how can you<sup>as</sup> (select) a trustworthy companion, the brother and the vizier (but by Me<sup>azwj</sup>)? \nO Musa<sup>as</sup>! Put aside the arrogance and leave the pride, and remember that you<sup>as</sup> will be dwelling in the grave, and that should prevent you<sup>as</sup> from the lustful desires.\nO Musa<sup>as</sup>! Hasten to the repentance, and delay the sins, and deliberate in your<sup>as</sup> staying in front of Me<sup>azwj</sup> during the Prayer, and do not place hope in others. Take Me<sup>azwj</sup> to be your<sup>as</sup> shield in the difficulties, and as a fortress in disastrous circumstances. \nO Musa<sup>as</sup>! How can a creature humble itself to Me<sup>azwj</sup> without being aware of My<sup>azwj</sup> Mercy, and how can one recognise My<sup>azwj</sup> Mercy without having observed it; and how can one (ever) observe it without having faith in it, and how can one believe in it without having any hope of being blessed from it; and how can one hope for being Blessed while being satisfied with the world, having taken refuge in it and relying on the support of the unjust ones. \nO Musa<sup>as</sup>! Compete for the good with the people of goodness because the good is like its name, and leave the evil for those who are fascinated by it. \nO Musa<sup>as</sup>! Keep your<sup>as</sup> tongue behind your<sup>as</sup> heart and you<sup>as</sup> will be safe, and Remember Me<sup>azwj</sup> abundantly during the night and the day and you will gain, and do not follow the sins (errors) but you<sup>as</sup> will regret, for the sins are scheduled for the Fire. \nO Musa<sup>as</sup>! Speak good to the people who have left the sins and be in their company, and take them as your<sup>as</sup> brother in your<sup>as</sup> absence, and strive along with them and let them strive with you<sup>as</sup>.\nO Musa<sup>as</sup>! The death will inevitably come to you<sup>as</sup>. So make provision of such provisions like the one who is certain that it would last him till (he reaches) his destination. \nO Musa<sup>as</sup>! What you<sup>as</sup> intend with by for My<sup>azwj</sup> Face ‘وَجْهِي’ (My Wali<sup>as</sup>), even a little (submission) is a lot, and what you<sup>as</sup> intend with by for other than Me<sup>azwj</sup>, even a lot (of effort to please him) is little (worthless). And reform your<sup>as</sup> days which are in front of you<sup>a</sup><sup>s</sup>, and to realize the day in front of you and prepare to benefit from it, as for you<sup>as</sup> will be Paused and Questioned. Take your<sup>as</sup> lesson from the (past) era and its people, for the span of the era is short, but its shortness can be availed (to earn rewards), since everything is destined for destruction. So act as if you<sup>as</sup> can see the Reward for your<sup>as</sup> deeds in order for it to be an inevitable greed for you<sup>as</sup> regarding the Hereafter, for whatever is remaining from the world is like what has passed from it, and every worker strives upon visions and examples. So return to yourself<sup>as</sup>, O son<sup>as</sup> of Imran<sup>as</sup>, perhaps you<sup>as</sup> will succeed tomorrow on the Day of Questioning, for that is where the wrong doers will lose out.  \nO Musa<sup>as</sup>! Throw out your<sup>as</sup> hand in front of Me<sup>azwj</sup> like the act of the slave calling out to his master, for if you<sup>as</sup> were to do that, you<sup>as</sup> will be the recipient of Mercy for I<sup>azwj</sup> am the Most Generous of the Powerful ones. \nO Musa<sup>as</sup>! Ask Me<sup>azwj</sup> from My<sup>azwj</sup> Grace, and My<sup>azwj</sup> Mercy, for these two are in My<sup>azwj</sup> Hands, none other is their owner, and look when you<sup>as</sup> ask Me<sup>azwj</sup> how your<sup>as</sup> wish is with what is in My<sup>azwj</sup> Possession. For every worker is a Recompense, and the disbeliever will be Recompensed with what he strives for. \nO Musa<sup>as</sup>! Do not concern yourself<sup>as</sup> with the world and seclude from it, for it is not for you<sup>as</sup>, and you<sup>as</sup> are not its owner, and it is a house for the unjust ones. However, the one who does good deeds in it, it is a good house for him. \nO Musa<sup>as</sup>! What I<sup>azwj</sup> have Commanded you<sup>as</sup> to, so listen and keep quiet at whatever you<sup>as</sup> see. Take the realities of the Torah to your<sup>as</sup> chest, and keep vigil by it in the hours of the night and the day, and do not let the sons of the world to make your<sup>as</sup> chest to be a nest like the nest of the birds. \nO Musa<sup>as</sup>! The sons of the world and its people are a trial for some of them to the others. So each one of them decorates what is regarding him, whereas the Believer is the one for whom the Hereafter is decorated. So he looks at it unabated, and its pleasures become a barrier for him in between him and the pleasures of life. So he idealises by the dawn like the act of the passenger driven by it to its destination, remaining bleak and sad in the evening. So good news would be for him, and the curtain is Lifted, what he will see would delight his eyes.\nO Musa<sup>as</sup>! The world is a seed. It is not of any benefit for the Believer, nor is it a penalty for the one who is sinful. So, a lengthy woe is for the one who sells the Reward of his return for a morsel, which does not remain and a sip, which does not continue. So be as I<sup>azwj</sup> have Commanded you<sup>as</sup> to be, and every Command of Mine<sup>azwj</sup> is Guidance. \nO Musa<sup>as</sup>! When you<sup>as</sup> see the richness coming to you<sup>as</sup>, so say: ‘It is a sin which is hastening the punishment for me<sup>as</sup>’. And when you<sup>as</sup> see the poverty coming to you<sup>as</sup>, so say: ‘Welcome to the sign of the righteous ones’. And do not become an unjust tyrant, and do not join up with the unjust ones. \nO Musa<sup>as</sup>! What is a lifetime and it is lengthy and its end is condemnable. And what goes away from you<sup>as</sup> does not adversely affect you<sup>as</sup> if you<sup>a</sup><sup>s</sup> were to praise its result. \nO Musa<sup>as</sup>! The Book has Screamed out to you<sup>as</sup> a loud Scream with what you<sup>as</sup> are headed for. So how can the eyes fall asleep upon this, or how can the people find pleasure in the life. Had it not been for the deliberately being oblivious, and the following of the misfortune and the following of the lustful desires, and from other than this, that the righteous are in grief. \nO Musa<sup>as</sup>! Order My<sup>azwj</sup> servants to supplicate to Me<sup>azwj</sup> in whatever situation they may be in after having accepted that I<sup>a</sup><sup>zwj</sup> am indeed the Most Merciful of the merciful ones, the Answerer to the restless, and Remover of the evil, and the Changer of the eras, and the Giver of comfort, Thankful for a little, and Rewarding a great deal, and Enricher of the poor, and I<sup>azwj</sup> am the Eternally Mighty and Powerful. So the one who comes to you<sup>as</sup> and joined up with you<sup>as</sup> from the sinful ones, so say: ‘Welcome to the courtyard of the Lord<sup>azwj</sup> of the Worlds’, and seek Forgiven for them, and be kind to them like one of other, and do not dominate them by what I<sup>azwj</sup> have Given to you<sup>as</sup> of the preference over them, and tell them to ask from Me<sup>azwj</sup> from (and) My<sup>azwj</sup> Grace, and My<sup>azwj</sup> Mercy, for no one else is the owner of these, and I<sup>azwj</sup> am of the Great Grace , Good to you.\nO Musa<sup>as</sup>! Be a cave for the erroneous, and sit with the restless, and a seeker of Forgiveness among the sinful ones. You<sup>as</sup> are from Me<sup>azwj</sup> at the status of the Pleasure, so supplicate to Me<sup>azwj</sup> with the pure heart, and the truthful tongue, and be as I<sup>azwj</sup> have Commanded you<sup>as</sup> to be. Be obedient to My<sup>azwj</sup> Command and do not dominate over My<sup>azwj</sup> servants by what is not begun from you<sup>as</sup>. And come nearer to Me<sup>azwj</sup>, for I<sup>azwj</sup> am very near to you<sup>as</sup>, for I<sup>azwj</sup> will never Ask you<sup>as</sup> what injures you<sup>as</sup> by its weight nor to carry it (burden). But rather, I<sup>azwj</sup> Ask you<sup>as</sup> that you<sup>as</sup> should supplicate to Me<sup>azwj</sup> so I<sup>azwj</sup> will Answer you<sup>as</sup>, and that Ask from Me<sup>azwj</sup> so I<sup>azwj</sup> shall Give it to you<sup>as</sup>, and that to come near to Me<sup>az</sup><sup>wj</sup> by what you<sup>as</sup> have taken from Me<sup>azwj</sup> of its interpretation, and to Me<sup>azwj</sup> is the completion of its Revelation. \nO Musa<sup>as</sup>! Look towards the earth, for very soon it shall be your<sup>as</sup> grave, and raise your<sup>as</sup> eyes towards the sky for it is above you<sup>as</sup> and in it are great Angels, and weep upon yourself<sup>as</sup> for as long as you<sup>as</sup> are in the world, and fear the perishable and the destruction, and do not be deceived by the adornments of the world and its flowers, and do not be pleased with the injustice, and do not become an unjust one for I<sup>azwj</sup> Hold the oppressor to Account until I<sup>azwj</sup> Get justice from him for the oppressed one.\nO Musa<sup>as</sup>! The good deeds are Rewarded tenfold but there is single punishment for a sin even one is so severe. Do not Associate (anyone) with Me<sup>azwj</sup>, it is not Permissible for you that you<sup>as</sup> should Associate with Me<sup>azwj</sup>. Come nearer and be steadfast, and supplicate like the supplication of the greedy one greedy for what is in My<sup>azwj</sup> Possession, and regretful over what he has sent by what his hands (had earned) before. Just as the blackness of the night obliterates the day, and similarly the sins obliterate the good deeds, and the darkness of the night comes over the whiteness of the day, and similarly the sins come over the outstanding sins and blacken them (further)’."}]}, {"index": 14682, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:8:1:6:2", "text": "14457- عَلِيُّ بْنُ مُحَمَّدٍ عَمَّنْ ذَكَرَهُ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ وَ حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الْكِنْدِيِّ جَمِيعاً عَنْ أَحْمَدَ بْنِ الْحَسَنِ الْمِيثَمِيِّ عَنْ رَجُلٍ مِنْ أَصْحَابِهِ قَالَ قَرَأْتُ جَوَاباً مِنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) إِلَى رَجُلٍ مِنْ أَصْحَابِهِ \nأَمَّا بَعْدُ فَإِنِّي أُوصِيكَ بِتَقْوَى اللَّهِ فَإِنَّ اللَّهَ قَدْ ضَمِنَ لِمَنِ اتَّقَاهُ أَنْ يُحَوِّلَهُ عَمَّا يَكْرَهُ إِلَى مَا يُحِبُّ وَ يَرْزُقَهُ مِنْ حَيْثُ لَا يَحْتَسِبُ فَإِيَّاكَ أَنْ تَكُونَ مِمَّنْ يَخَافُ عَلَى الْعِبَادِ مِنْ ذُنُوبِهِمْ وَ يَأْمَنُ الْعُقُوبَةَ مِنْ ذَنْبِهِ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ لَا يُخْدَعُ عَنْ جَنَّتِهِ وَ لَا يُنَالُ مَا عِنْدَهُ إِلَّا بِطَاعَتِهِ إِنْ شَاءَ اللَّهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473100\">H 14457</a> – Ali Bin Muhammad, from someone he has mentioned, from Muhammad Bin Al-Husayn, and Humeyd Bin Zyad, from Al-Hassan Bin Muhammad Al-Kindy altogether, from Ahmad Bin Al-Hassan Al-Maysami, from a man from his companions who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> read the answer from</span> Abu Abdullah<sup>asws</sup> to a man from his<sup>asws</sup> companions.\nAfter this (having Praised Allah<sup>azwj</sup>,), I<sup>asws</sup> hereby advise you all to fear Allah<sup>azwj</sup>, for He<sup>azwj</sup> has Taken the responsibility for the one who is pious to turn them around from what He<sup>azwj</sup> Abhors towards what He<sup>azwj</sup> Loves, and Sustain him from where he does not expect. So beware of becoming from those who are feared by the servants due to their sins whereas they themselves feel secure from the consequences of their own sins. Allah<sup>azwj</sup> cannot be deceived about His<sup>azwj</sup> Paradise, nor can that be achieved which is with Him<sup>azwj</sup> except by being obedient to Him<sup>azwj</sup>, Allah<sup>azwj</sup> Willing’."}]}, {"index": 14683, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:8:1:6:3", "text": "14458-  عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ عَيْثَمِ بْنِ أَشْيَمَ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ خَرَجَ النَّبِيُّ ( صلى الله عليه وآله ) ذَاتَ يَوْمٍ وَ هُوَ مُسْتَبْشِرٌ يَضْحَكُ سُرُوراً فَقَالَ لَهُ النَّاسُ أَضْحَكَ اللَّهُ سِنَّكَ يَا رَسُولَ اللَّهِ وَ زَادَكَ سُرُوراً \nفَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّهُ لَيْسَ مِنْ يَوْمٍ وَ لَا لَيْلَةٍ إِلَّا وَ لِيَ فِيهِمَا تُحْفَةٌ مِنَ اللَّهِ أَلَا وَ إِنَّ رَبِّي أَتْحَفَنِي فِي يَوْمِي هَذَا بِتُحْفَةٍ لَمْ يُتْحِفْنِي بِمِثْلِهَا فِيمَا مَضَى إِنَّ جَبْرَئِيلَ أَتَانِي فَأَقْرَأَنِي مِنْ رَبِّيَ السَّلَامَ وَ قَالَ يَا مُحَمَّدُ إِنَّ اللَّهَ عَزَّ وَ جَلَّ اخْتَارَ مِنْ بَنِي هَاشِمٍ سَبْعَةً لَمْ يَخْلُقْ مِثْلَهُمْ فِيمَنْ مَضَى وَ لَا يَخْلُقُ مِثْلَهُمْ فِيمَنْ بَقِيَ \nأَنْتَ يَا رَسُولَ اللَّهِ سَيِّدُ النَّبِيِّينَ وَ عَلِيُّ بْنُ أَبِي طَالِبٍ وَصِيُّكَ سَيِّدُ الْوَصِيِّينَ وَ الْحَسَنُ وَ الْحُسَيْنُ سِبْطَاكَ سَيِّدَا الْأَسْبَاطِ وَ حَمْزَةُ عَمُّكَ سَيِّدُ الشُّهَدَاءِ وَ جَعْفَرٌ ابْنُ عَمِّكَ الطَّيَّارُ فِي الْجَنَّةِ يَطِيرُ مَعَ الْمَلَائِكَةِ حَيْثُ يَشَاءُ وَ مِنْكُمُ الْقَائِمُ يُصَلِّي عِيسَى ابْنُ مَرْيَمَ خَلْفَهُ إِذَا أَهْبَطَهُ اللَّهُ إِلَى الْأَرْضِ مِنْ ذُرِّيَّةِ عَلِيٍّ وَ فَاطِمَةَ مِنْ وُلْدِ الْحُسَيْنِ ( عليه السلام ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473101\">H 14458</a> – A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Suleyman, from Aysam Bin Asheym, from Muawiya Bin Ammar have said the following:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said: ‘One day the Prophet<sup>saww</sup> came out having received good news, smiling joyfully. So the people said to him<sup>saww</sup>, ‘May Allah<sup>azwj</sup> keep you smiling for the whole life, O Messenger<sup>saww</sup> of Allah<sup>azwj</sup>, and increase your<sup>saww</sup> joy’.\nThe Messenger<sup>saww</sup> of Allah<sup>azwj</sup> said: ‘There is no day or night except that I<sup>saww</sup> receive a Gift from Allah<sup>azwj</sup>. Indeed! Allah<sup>azwj</sup> has Gifted to me<sup>saww</sup> in this day of mine<sup>saww</sup> with a Gift which He<sup>azwj</sup> has never Gifted to me the like of it in the past. Gabriel<sup>as</sup> came to me<sup>saww</sup> and conveyed Greetings to me<sup>saww</sup> from my<sup>saww</sup> Lord<sup>azwj</sup> and said: ‘O Muhammad<sup>saww</sup>! Allah<sup>azwj</sup> Mighty and Majestic has Chosen seven from the Clan of Hashim<sup>as</sup> that He<sup>azwj</sup> has never Created anyone similar to them from the past nor will He<sup>azwj</sup> be Creating anyone like them in the future. \nYou<sup>saww</sup>, O Messenger<sup>saww</sup> of Allah<sup>azwj</sup> are the Chief of the Prophets<sup>as</sup>, and Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> is your<sup>saww</sup> Successor<sup>asws</sup> and the Chief of the successors<sup>as</sup>, and Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup> your<sup>saww</sup> grandsons<sup>asws</sup> are the Chiefs of the grandsons, and Hamza<sup>as</sup> your<sup>saww</sup> uncle is the Chief of the martyrs, and Ja’far<sup>as</sup> the son<sup>as</sup> of your<sup>saww</sup> uncle<sup>as</sup> is the flyer in the Paradise flying along with the Angels wherever he<sup>as</sup> desires to, and among you all is the Rising One (Al-Qaim<sup>asws</sup>) behind whom<sup>asws</sup> Isa<sup>as</sup> Bin Maryam<sup>as</sup> will be Praying when Allah<sup>azwj</sup> Sends him<sup>as</sup> down to the earth. He<sup>asws</sup> will be from the descendants of Ali<sup>asws</sup> and Fatima<sup>asws</sup> from the sons<sup>asws</sup> of Al-Husayn<sup>asws</sup>’."}]}, {"index": 14684, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:8:1:6:4", "text": "14459-  سَهْلُ بْنُ زِيَادٍ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ الدَّيْلَمِيِّ الْمِصْرِيِّ عَنْ أَبِيهِ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ هذا كِتابُنا يَنْطِقُ عَلَيْكُمْ بِالْحَقِّ قَالَ فَقَالَ إِنَّ الْكِتَابَ لَمْ يَنْطِقْ وَ لَنْ يَنْطِقَ وَ لَكِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) هُوَ النَّاطِقُ بِالْكِتَابِ قَالَ اللَّهُ عَزَّ وَ جَلَّ هَذَا كِتَابُنَا يُنْطَقُ عَلَيْكُمْ بِالْحَقِّ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ إِنَّا لَا نَقْرَؤُهَا هَكَذَا فَقَالَ هَكَذَا وَ اللَّهِ نَزَلَ بِهِ جَبْرَئِيلُ عَلَى مُحَمَّدٍ ( صلى الله عليه وآله ) وَ لَكِنَّهُ فِيمَا حُرِّفَ مِنْ كِتَابِ اللَّهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473102\">H 14459</a> - Sahl Bin Ziyad, from Muhammad Bin Suleyman Al-Saylami Al-Misry, from his father, from Abu Baseer, who has narrated:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> said when the Statement of Allah<sup>azwj</sup> Mighty and Majestic was recited to him<sup>asws</sup>; <span class=\"ibTxt\">“[45:29] This is Our book that speaks against you with the truth”</span>, he<sup>asws</sup> said: ‘Surely, the Book has never Spoken and will never Speak, but the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>, he<sup>saww</sup> is the speaker of the Book. Allah<sup>azwj</sup> has Said: <span class=\"ibTxt\">“[45:29] This (the Messenger</span><sup class=\"ibTxt\">saww</sup><span class=\"ibTxt\"> of Allah</span><sup class=\"ibTxt\">azwj</sup><span class=\"ibTxt\"> )is Our book that speaks against you with the truth”</span>. The narrator said, ‘I asked, ‘May I be sacrificed for you<sup>asws</sup>, we do not read it as such’. He<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>, this is how Gabriel came down with it upon Muhammad<sup>saww</sup>, but this is what was altered from the Book of Allah<sup>azwj</sup>’. "}]}, {"index": 14685, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:8:1:6:5", "text": "14460-  جَمَاعَةٌ عَنْ سَهْلٍ عَنْ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ أَبِي مُحَمَّدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ الشَّمْسِ وَ ضُحاها قَالَ الشَّمْسُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِهِ أَوْضَحَ اللَّهُ عَزَّ وَ جَلَّ لِلنَّاسِ دِينَهُمْ \nقَالَ قُلْتُ الْقَمَرِ إِذا تَلاها قَالَ ذَاكَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) تَلَا رَسُولَ اللَّهِ ( صلى الله عليه وآله ) وَ نَفَثَهُ بِالْعِلْمِ نَفْثاً \nقَالَ قُلْتُ وَ اللَّيْلِ إِذا يَغْشاها قَالَ ذَاكَ أَئِمَّةُ الْجَوْرِ الَّذِينَ اسْتَبَدُّوا بِالْأَمْرِ دُونَ آلِ الرَّسُولِ ( صلى الله عليه وآله ) وَ جَلَسُوا مَجْلِساً كَانَ آلُ الرَّسُولِ أَوْلَى بِهِ مِنْهُمْ فَغَشُوا دِينَ اللَّهِ بِالظُّلْمِ وَ الْجَوْرِ فَحَكَى اللَّهُ فِعْلَهُمْ فَقَالَ وَ اللَّيْلِ إِذا يَغْشاها \nقَالَ قُلْتُ وَ النَّهارِ إِذا جَلَّاها قَالَ ذَلِكَ الْإِمَامُ مِنْ ذُرِّيَّةِ فَاطِمَةَ (عليها السلام) يُسْأَلُ عَنْ دِينِ رَسُولِ اللَّهِ (صلى الله عليه وآله) فَيُجَلِّيهِ لِمَنْ سَأَلَهُ فَحَكَى اللَّهُ عَزَّ وَ جَلَّ قَوْلَهُ فَقَالَ وَ النَّهارِ إِذا جَلَّاها .", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473103\">H 14460</a> – A group, from Sahl Bin Ziyad, from Muhammad, from his father, from Abu Muhammad has narrated:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said when asked about the Statement of Allah<sup>azwj</sup>: <span class=\"ibTxt\">“[91:1] I swear by the sun and its brilliance,”</span>, said: ‘The sun (is a reference to) the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> by whom<sup>saww</sup> Allah<sup>azwj</sup> Mighty and Majestic Clarified for the people their Religion’. \n‘I then asked, ‘(What about) <span class=\"ibTxt\">“[91:2] And the moon when it follows the sun”</span>? He<sup>asws</sup> said: ‘That is Amir-ul-Momineen<sup>asws</sup> following the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>, and emitted the knowledge by reradiating (like moon reflects the rays to the earth which fall on its surface from the sun)’. \n‘I then asked, ‘(What about) <span class=\"ibTxt\">“[91:4] And the night when it draws a veil over it”</span>?’ Imam<sup>asws</sup> said: ‘That (is a reference to) the imams of the injustice who tyrannised by the command the Progeny<sup>asws</sup> of the Messenger<sup>saww</sup> and seated themselves upon a set which was for the Progeny<sup>asws</sup> of the Messenger<sup>saww</sup> who<sup>asws</sup> were higher (more deserving) for it than them. They veiled the Religion of Allah<sup>azwj</sup> by the injustices and the tyranny. So Allah<sup>azwj</sup> has Referred to their deeds by Saying <span class=\"ibTxt\">“[91:4] And the night when it draws a veil over it”</span>.\n‘I then asked, (What about) <span class=\"ibTxt\">“[91:3] By the Day as it shows up (the Sun's) clarity”</span>?’ He<sup>asws</sup> said: ‘That (is a reference to) the Imams<sup>asws</sup> from the descendants of Fatima<sup>asws</sup>, when asked about the Religion of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> so they clarify it for the one who has asked (from them<sup>asws</sup>). So Allah<sup>azwj</sup> has referred it in His<sup>azwj</sup> Statement by Saying <span class=\"ibTxt\">“[91:3] By the Day as it shows up (the Sun's) clarity”</span>."}]}, {"index": 14686, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:8:1:6:6", "text": "14461-  سَهْلٌ عَنْ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ هَلْ أَتاكَ حَدِيثُ الْغاشِيَةِ قَالَ يَغْشَاهُمُ الْقَائِمُ بِالسَّيْفِ قَالَ قُلْتُ وُجُوهٌ يَوْمَئِذٍ خاشِعَةٌ قَالَ خَاضِعَةٌ لَا تُطِيقُ الِامْتِنَاعَ قَالَ قُلْتُ عامِلَةٌ قَالَ عَمِلَتْ بِغَيْرِ مَا أَنْزَلَ اللَّهُ قَالَ قُلْتُ ناصِبَةٌ قَالَ نَصَبَتْ غَيْرَ وُلَاةِ الْأَمْرِ قَالَ قُلْتُ تَصْلى ناراً حامِيَةً قَالَ تَصْلَى نَارَ الْحَرْبِ فِي الدُّنْيَا عَلَى عَهْدِ الْقَائِمِ وَ فِي الْآخِرَةِ نَارَ جَهَنَّمَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473104\">H 14461</a> – Sahl, from Muhammad, from his father has narrated:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Abdullah</span><sup>asws</sup> having said when it was said to him<sup>asws</sup> <span class=\"ibTxt\">“[88:1] Has not there come to you the news of the overwhelming calamity?”</span>, he<sup>asws</sup> said: ‘They will be overwhelmed by the sword of the Rising One (Al-Qaim<sup>asws</sup>)’. He said, ‘I said, (What about) <span class=\"ibTxt\">“[88:2] Some faces, that Day, will be humiliated”</span>?’ He<sup>asws</sup> said: ‘They will be so humiliated that they will not be able to bear the exclusion’. He said, ‘I asked. ‘(What about) <span class=\"ibTxt\">“[88:3] Labouring”</span>?’ He<sup>asws</sup> said: ‘Labouring for other than what Allah<sup>azwj</sup> Revealed’. I then asked, (What about) <span class=\"ibTxt\">“[88:3] Appointing”</span>?’ He<sup>asws</sup> replied: ‘Having appointed other than the Master<sup>asws</sup> of the Command (Wali Al-Amr)’. He says then I asked, (What about) <span class=\"ibTxt\">“[88:4] Entering into burning fire”</span>?’ He<sup>asws</sup> replied: ‘Entering into the fire of the war in the world during the era of the Rising One (Al-Qaim<sup>asws</sup>), and in the Hereafter the Fire of Hell’."}]}, {"index": 14687, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:8:1:6:7", "text": "14462-  سَهْلٌ عَنْ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ أَبِي بَصِيرٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ (عليه السلام) قَوْلُهُ تَبَارَكَ وَ تَعَالَى وَ أَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمانِهِمْ لا يَبْعَثُ اللَّهُ مَنْ يَمُوتُ بَلى وَعْداً عَلَيْهِ حَقًّا وَ لكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ قَالَ فَقَالَ لِي يَا أَبَا بَصِيرٍ مَا تَقُولُ فِي هَذِهِ الْآيَةِ قَالَ قُلْتُ إِنَّ الْمُشْرِكِينَ يَزْعُمُونَ وَ يَحْلِفُونَ لِرَسُولِ اللَّهِ (صلى الله عليه وآله) أَنَّ اللَّهَ لَا يَبْعَثُ الْمَوْتَى قَالَ فَقَالَ تَبّاً لِمَنْ قَالَ هَذَا سَلْهُمْ هَلْ كَانَ الْمُشْرِكُونَ يَحْلِفُونَ بِاللَّهِ أَمْ بِاللَّاتِ وَ الْعُزَّى قَالَ قُلْتُ جُعِلْتُ فِدَاكَ فَأَوْجِدْنِيهِ \nقَالَ فَقَالَ لِي يَا أَبَا بَصِيرٍ لَوْ قَدْ قَامَ قَائِمُنَا بَعَثَ اللَّهُ إِلَيْهِ قَوْماً مِنْ شِيعَتِنَا قِبَاعُ سُيُوفِهِمْ عَلَى عَوَاتِقِهِمْ فَيَبْلُغُ ذَلِكَ قَوْماً مِنْ شِيعَتِنَا لَمْ يَمُوتُوا فَيَقُولُونَ بُعِثَ فُلَانٌ وَ فُلَانٌ وَ فُلَانٌ مِنْ قُبُورِهِمْ وَ هُمْ مَعَ الْقَائِمِ فَيَبْلُغُ ذَلِكَ قَوْماً مِنْ عَدُوِّنَا فَيَقُولُونَ يَا مَعْشَرَ الشِّيعَةِ مَا أَكْذَبَكُمْ هَذِهِ دَوْلَتُكُمْ وَ أَنْتُمْ تَقُولُونَ فِيهَا الْكَذِبَ لَا وَ اللَّهِ مَا عَاشَ هَؤُلَاءِ وَ لَا يَعِيشُونَ إِلَى يَوْمِ الْقِيَامَةِ قَالَ فَحَكَى اللَّهُ قَوْلَهُمْ فَقَالَ وَ أَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمانِهِمْ لا يَبْعَثُ اللَّهُ مَنْ يَمُوتُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473105\">H 14462</a> – Sahl, from Muhammad, from his father, from Abu Baseer who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> said to Abu Abdullah</span><sup>asw</sup><sup>s</sup> the Statement of the Blessed and the High<sup>azwj</sup>: <span class=\"ibTxt\">“[16:38] And they swear by Allah with the most energetic of their oaths: Allah will not raise up him who dies. Yea! it is a promise binding on Him, quite true, but most people do not know”</span>, he<sup>asws</sup> said: ‘O Abu Baseer! What do you (people) say about this Verse?’ I replied, ‘The ‘Mushrikeen’ (polytheists) are alleging and swearing upon oath to the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> that Allah<sup>azwj</sup> does not Resurrect the dead’. Imam<sup>asws</sup> said: ‘Woe be unto the ones who say this. Ask them, ‘Do the ‘Mushrikeen’ swear by Allah<sup>azwj</sup> or by <span class=\"iTxt\">Al-Laat</span>, and <span class=\"iTxt\">Al-Uzza</span> (names of worshipped idols)?’ I replied, ‘May I be sacrificed for you<sup>asws</sup>, enlighten me’. \nImam<sup>asws</sup> replied to me: ‘O Abu Baseer! When our<sup>asws</sup> Rising One (Al-Qaim<sup>asws</sup>) makes the stand, Allah<sup>azwj</sup> will Send to him<sup>asws</sup> a group from our<sup>asws</sup> Shiites with the sheaths of their swords upon their shoulders. So that (news) will reach a group from our<sup>asws</sup> Shiites who did not die. So they will say, so and so and so and so have been resurrected from their graves and they are with Al-Qaim<sup>asws</sup>. So that (news) will reach a group from our<sup>asws</sup> enemies, so they will say, ‘O group of Shiites, what lies you speak. This is your government and you are speaking lies about it? No, by Allah<sup>azwj</sup>, those have never lived nor will they ever be living up to the Day of Judgement’. He<sup>asws</sup> said: ‘So Allah<sup>azwj</sup> Quoted their words, so He<sup>azwj</sup> Said: <span class=\"ibTxt\">“[16:38] And they swear by Allah with the most energetic of their oaths: Allah will not raise up him who dies”</span>."}]}, {"index": 14688, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:8:1:6:8", "text": "14463- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ فَضَّالٍ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ بَدْرِ بْنِ الْخَلِيلِ الْأَسَدِيِّ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ (عليه السلام) يَقُولُ فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَلَمَّا أَحَسُّوا بَأْسَنا إِذا هُمْ مِنْها يَرْكُضُونَ لا تَرْكُضُوا وَ ارْجِعُوا إِلى ما أُتْرِفْتُمْ فِيهِ وَ مَساكِنِكُمْ لَعَلَّكُمْ تُسْئَلُونَ قَالَ إِذَا قَامَ الْقَائِمُ وَ بَعَثَ إِلَى بَنِي أُمَيَّةَ بِالشَّامِ فَهَرَبُوا إِلَى الرُّومِ \nفَيَقُولُ لَهُمُ الرُّومُ لَا نُدْخِلَنَّكُمْ حَتَّى تَتَنَصَّرُوا فَيُعَلِّقُونَ فِي أَعْنَاقِهِمُ الصُّلْبَانَ فَيُدْخِلُونَهُمْ فَإِذَا نَزَلَ بِحَضْرَتِهِمْ أَصْحَابُ الْقَائِمِ طَلَبُوا الْأَمَانَ وَ الصُّلْحَ فَيَقُولُ أَصْحَابُ الْقَائِمِ لَا نَفْعَلُ حَتَّى تَدْفَعُوا إِلَيْنَا مَنْ قِبَلَكُمْ مِنَّا قَالَ فَيَدْفَعُونَهُمْ إِلَيْهِمْ فَذَلِكَ قَوْلُهُ لا تَرْكُضُوا وَ ارْجِعُوا إِلى ما أُتْرِفْتُمْ فِيهِ وَ مَساكِنِكُمْ لَعَلَّكُمْ تُسْئَلُونَ قَالَ يَسْأَلُهُمُ الْكُنُوزَ وَ هُوَ أَعْلَمُ بِهَا قَالَ فَيَقُولُونَ يا وَيْلَنا إِنَّا كُنَّا ظالِمِينَ فَما زاَلَتْ تِلْكَ دَعْواهُمْ حَتَّى جَعَلْناهُمْ حَصِيداً خامِدِينَ بِالسَّيْفِ.", "translations": [{"lang": "en", "name": "hubeali", "text": "<a id=\"_Toc492473106\">H 14463</a> – Ali Bin Ibrahim, from his father, from Ibn Fazaal, from Sa’albat Bin Maymoun, from Badr Bin Al-Khaleel Al-Asady who said:\n<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">‘I</span> heard Abu Ja’far</span><sup>asw</sup><sup>s</sup> saying regarding the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[21:12] Yet, when they felt Our Punishment (coming), behold, they (tried to) flee from it. [21:13] Flee not, but return to the good things of this life which were given you, and to your homes in order that ye may be called to account.”</span> He<sup>asws</sup> said: ‘When Al-Qaim<sup>asws</sup> makes the stand, and sends (an army) to the Clan of Umayya in Syria, so they will run away to ‘al-Rome’.\nSo the Romans will say to them, ‘We will not let you enter until you become Christians’. So they will hang crosses upon their necks and allow them to enter. So when the companions of Al-Qaim<sup>asws</sup> descend upon them, they (Romans) will seek security and reconciliation. So the companions of Al-Qaim<sup>asws</sup> will say, ‘We will not do that until you hand over to us the ones who came to you beforehand from us’. So they will hand them over. So that is His<sup>azwj</sup> Statement: <span class=\"ibTxt\">“[21:13] Flee not, but return to the good things of this life which were given you, and to your homes in order that ye may be called to account”</span>. He<sup>asws</sup> said: ‘So he<sup>asws</sup> will question them about the treasure although he<sup>asws</sup> knows more than them about it. So they will say, ‘O woe be upon us! Surely we have been unjust’. They will not cease invoking that invocation of theirs until they will be cut down to extinction by the sword’."}]}]}, "index": "al-kafi:8:1:6", "kind": "verse_list"}