{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 7"
        },
        "path": "/books/al-kafi:8:1:7",
        "titles": {
          "ar": "رِسَالَةُ أَبِي جَعْفَرٍ ( عليه السلام ) إِلَى سَعْدٍ الْخَيْرِ",
          "en": "MESSAGE (LETTER) OF ABU JA’FAR<sup>asws</sup> TO SA’AD ALKHAYR"
        }
      }
    ],
    "index": 2278,
    "local_index": 7,
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:7",
    "titles": {
      "ar": "رِسَالَةُ أَبِي جَعْفَرٍ ( عليه السلام ) إِلَى سَعْدٍ الْخَيْرِ",
      "en": "MESSAGE (LETTER) OF ABU JA’FAR<sup>asws</sup> TO SA’AD ALKHAYR"
    },
    "verse_count": 1,
    "verse_start_index": 14699,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح على الظاهر</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 112)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14700,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:7:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14464</span>-  مُحَمَّدُ بْنُ</span> يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ عَمِّهِ حَمْزَةَ بْنِ بَزِيعٍ وَ الْحُسَيْنِ بْنِ مُحَمَّدٍ الْأَشْعَرِيِّ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ عَمَّنْ حَدَّثَهُ قَالَ كَتَبَ أَبُو جَعْفَرٍ ( عليه السلام ) إِلَى سَعْدٍ الْخَيْرِ ",
          "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ أَمَّا بَعْدُ فَإِنِّي أُوصِيكَ بِتَقْوَى اللَّهِ فَإِنَّ فِيهَا السَّلَامَةَ مِنَ التَّلَفِ وَ الْغَنِيمَةَ فِي الْمُنْقَلَبِ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقِي بِالتَّقْوَى عَنِ الْعَبْدِ مَا عَزَبَ عَنْهُ عَقْلُهُ وَ يُجْلِي بِالتَّقْوَى عَنْهُ عَمَاهُ وَ جَهْلَهُ وَ بِالتَّقْوَى نَجَا نُوحٌ وَ مَنْ مَعَهُ فِي السَّفِينَةِ وَ صَالِحٌ وَ مَنْ مَعَهُ مِنَ الصَّاعِقَةِ ",
          "وَ بِالتَّقْوَى فَازَ الصَّابِرُونَ وَ نَجَتْ تِلْكَ الْعُصَبُ مِنَ الْمَهَالِكِ وَ لَهُمْ إِخْوَانٌ عَلَى تِلْكَ الطَّرِيقَةِ يَلْتَمِسُونَ تِلْكَ الْفَضِيلَةَ نَبَذُوا طُغْيَانَهُمْ مِنَ الْإِيرَادِ بِالشَّهَوَاتِ لِمَا بَلَغَهُمْ فِي الْكِتَابِ مِنَ الْمَثُلَاتِ حَمِدُوا رَبَّهُمْ عَلَى مَا رَزَقَهُمْ وَ هُوَ أَهْلُ الْحَمْدِ وَ ذَمُّوا أَنْفُسَهُمْ عَلَى مَا فَرَّطُوا وَ هُمْ أَهْلُ الذَّمِّ وَ عَلِمُوا أَنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى الْحَلِيمَ الْعَلِيمَ إِنَّمَا غَضَبُهُ عَلَى مَنْ لَمْ يَقْبَلْ مِنْهُ رِضَاهُ وَ إِنَّمَا يَمْنَعُ مَنْ لَمْ يَقْبَلْ مِنْهُ عَطَاهُ وَ إِنَّمَا يُضِلُّ مَنْ لَمْ يَقْبَلْ مِنْهُ هُدَاهُ ",
          "ثُمَّ أَمْكَنَ أَهْلَ السَّيِّئَاتِ مِنَ التَّوْبَةِ بِتَبْدِيلِ الْحَسَنَاتِ دَعَا عِبَادَهُ فِي الْكِتَابِ إِلَى ذَلِكَ بِصَوْتٍ رَفِيعٍ لَمْ يَنْقَطِعْ وَ لَمْ يَمْنَعْ دُعَاءَ عِبَادِهِ فَلَعَنَ اللَّهُ الَّذِينَ يَكْتُمُونَ مَا أَنْزَلَ اللَّهُ وَ كَتَبَ عَلَى نَفْسِهِ الرَّحْمَةَ فَسَبَقَتْ قَبْلَ الْغَضَبِ فَتَمَّتْ صِدْقاً وَ عَدْلًا فَلَيْسَ يَبْتَدِئُ الْعِبَادَ بِالْغَضَبِ قَبْلَ أَنْ يُغْضِبُوهُ وَ ذَلِكَ مِنْ عِلْمِ الْيَقِينِ وَ عِلْمِ التَّقْوَى وَ كُلُّ أُمَّةٍ قَدْ رَفَعَ اللَّهُ عَنْهُمْ عِلْمَ الْكِتَابِ حِينَ نَبَذُوهُ وَ وَلَّاهُمْ عَدُوَّهُمْ حِينَ تَوَلَّوْهُ ",
          "وَ كَانَ مِنْ نَبْذِهِمُ الْكِتَابَ أَنْ أَقَامُوا حُرُوفَهُ وَ حَرَّفُوا حُدُودَهُ فَهُمْ يَرْوُونَهُ وَ لَا يَرْعَوْنَهُ وَ الْجُهَّالُ يُعْجِبُهُمْ حِفْظُهُمْ لِلرِّوَايَةِ وَ الْعُلَمَاءُ يَحْزُنُهُمْ تَرْكُهُمْ لِلرِّعَايَةِ",
          "وَ كَانَ مِنْ نَبْذِهِمُ الْكِتَابَ أَنْ وَلَّوْهُ الَّذِينَ لَا يَعْلَمُونَ فَأَوْرَدُوهُمُ الْهَوَى وَ أَصْدَرُوهُمْ إِلَى الرَّدَى وَ غَيَّرُوا عُرَى الدِّينِ ثُمَّ وَرَّثُوهُ فِي السَّفَهِ وَ الصِّبَا",
          "فَالْأُمَّةُ يَصْدُرُونَ عَنْ أَمْرِ النَّاسِ بَعْدَ أَمْرِ اللَّهِ تَبَارَكَ وَ تَعَالَى وَ عَلَيْهِ يُرَدُّونَ فَبِئْسَ لِلظَّالِمِينَ بَدَلًا وَلَايَةُ النَّاسِ بَعْدَ وَلَايَةِ اللَّهِ وَ ثَوَابُ النَّاسِ بَعْدَ ثَوَابِ اللَّهِ وَ رِضَا النَّاسِ بَعْدَ رِضَا اللَّهِ",
          "فَأَصْبَحَتِ الْأُمَّةُ كَذَلِكَ وَ فِيهِمُ الْمُجْتَهِدُونَ فِي الْعِبَادَةِ عَلَى تِلْكَ الضَّلَالَةِ مُعْجَبُونَ مَفْتُونُونَ فَعِبَادَتُهُمْ فِتْنَةٌ لَهُمْ وَ لِمَنِ اقْتَدَى بِهِمْ وَ قَدْ كَانَ فِي الرُّسُلِ ذِكْرَى لِلْعَابِدِينَ إِنَّ نَبِيّاً مِنَ الْأَنْبِيَاءِ كَانَ يَسْتَكْمِلُ الطَّاعَةَ ثُمَّ يَعْصِي اللَّهَ تَبَارَكَ وَ تَعَالَى فِي الْبَابِ الْوَاحِدِ فَخَرَجَ بِهِ مِنَ الْجَنَّةِ وَ يُنْبَذُ بِهِ فِي بَطْنِ الْحُوتِ ثُمَّ لَا يُنَجِّيهِ إِلَّا الِاعْتِرَافُ وَ التَّوْبَةُ",
          "فَاعْرِفْ أَشْبَاهَ الْأَحْبَارِ وَ الرُّهْبَانِ الَّذِينَ سَارُوا بِكِتْمَانِ الْكِتَابِ وَ تَحْرِيفِهِ فَما رَبِحَتْ تِجارَتُهُمْ وَ ما كانُوا مُهْتَدِينَ ثُمَّ اعْرِفْ أَشْبَاهَهُمْ مِنْ هَذِهِ الْأُمَّةِ الَّذِينَ أَقَامُوا حُرُوفَ الْكِتَابِ وَ حَرَّفُوا حُدُودَهُ فَهُمْ مَعَ السَّادَةِ وَ الْكُبُرَّةِ فَإِذَا تَفَرَّقَتْ قَادَةُ الْأَهْوَاءِ كَانُوا مَعَ أَكْثَرِهِمْ دُنْيَا وَ ذَلِكَ مَبْلَغُهُمْ مِنَ الْعِلْمِ لَا يَزَالُونَ كَذَلِكَ فِي طَبَعٍ وَ طَمَعٍ لَا يَزَالُ يُسْمَعُ صَوْتُ إِبْلِيسَ عَلَى أَلْسِنَتِهِمْ بِبَاطِلٍ كَثِيرٍ يَصْبِرُ مِنْهُمُ الْعُلَمَاءُ عَلَى الْأَذَى وَ التَّعْنِيفِ وَ يَعِيبُونَ عَلَى الْعُلَمَاءِ بِالتَّكْلِيفِ وَ الْعُلَمَاءُ فِي أَنْفُسِهِمْ خَانَةٌ إِنْ كَتَمُوا النَّصِيحَةَ إِنْ رَأَوْا تَائِهاً ضَالًّا لَا يَهْدُونَهُ أَوْ مَيِّتاً لَا يُحْيُونَهُ ",
          "فَبِئْسَ مَا يَصْنَعُونَ لِأَنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى أَخَذَ عَلَيْهِمُ الْمِيثَاقَ فِي الْكِتَابِ أَنْ يَأْمُرُوا بِالْمَعْرُوفِ وَ بِمَا أُمِرُوا بِهِ وَ أَنْ يَنْهَوْا عَمَّا نُهُوا عَنْهُ وَ أَنْ يَتَعَاوَنُوا عَلَى الْبِرِّ وَ التَّقْوَى وَ لَا يَتَعَاوَنُوا عَلَى الْإِثْمِ وَ الْعُدْوَانِ ",
          "فَالْعُلَمَاءُ مِنَ الْجُهَّالِ فِي جَهْدٍ وَ جِهَادٍ إِنْ وَعَظَتْ قَالُوا طَغَتْ وَ إِنْ عَلَّمُوا الْحَقَّ الَّذِي تَرَكُوا قَالُوا خَالَفَتْ وَ إِنِ اعْتَزَلُوهُمْ قَالُوا فَارَقَتْ وَ إِنْ قَالُوا هَاتُوا بُرْهَانَكُمْ عَلَى مَا تُحَدِّثُونَ قَالُوا نَافَقَتْ وَ إِنْ أَطَاعُوهُمْ قَالُوا عَصَتِ اللَّهَ عَزَّ وَ جَلَّ ",
          "فَهَلَكَ جُهَّالٌ فِيمَا لَا يَعْلَمُونَ أُمِّيُّونَ فِيمَا يَتْلُونَ يُصَدِّقُونَ بِالْكِتَابِ عِنْدَ التَّعْرِيفِ وَ يُكَذِّبُونَ بِهِ عِنْدَ التَّحْرِيفِ فَلَا يُنْكِرُونَ أُولَئِكَ أَشْبَاهُ الْأَحْبَارِ وَ الرُّهْبَانِ قَادَةٌ فِي الْهَوَى سَادَةٌ فِي الرَّدَى وَ آخَرُونَ مِنْهُمْ جُلُوسٌ بَيْنَ الضَّلَالَةِ وَ الْهُدَى لَا يَعْرِفُونَ إِحْدَى الطَّائِفَتَيْنِ مِنَ الْأُخْرَى يَقُولُونَ مَا كَانَ النَّاسُ يَعْرِفُونَ هَذَا وَ لَا يَدْرُونَ مَا هُوَ ",
          "وَ صَدَّقُوا تَرْكَهُمْ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) عَلَى الْبَيْضَاءِ لَيْلُهَا مِنْ نَهَارِهَا لَمْ يَظْهَرْ فِيهِمْ بِدْعَةٌ وَ لَمْ يُبَدَّلْ فِيهِمْ سُنَّةٌ لَا خِلَافَ عِنْدَهُمْ وَ لَا اخْتِلَافَ فَلَمَّا غَشِيَ النَّاسَ ظُلْمَةُ خَطَايَاهُمْ صَارُوا إِمَامَيْنِ دَاعٍ إِلَى اللَّهِ تَبَارَكَ وَ تَعَالَى وَ دَاعٍ إِلَى النَّارِ",
          "فَعِنْدَ ذَلِكَ نَطَقَ الشَّيْطَانُ فَعَلَا صَوْتُهُ عَلَى لِسَانِ أَوْلِيَائِهِ وَ كَثُرَ خَيْلُهُ وَ رَجْلُهُ وَ شَارَكَ فِي الْمَالِ وَ الْوَلَدِ مَنْ أَشْرَكَهُ فَعُمِلَ بِالْبِدْعَةِ وَ تُرِكَ الْكِتَابُ وَ السُّنَّةُ وَ نَطَقَ أَوْلِيَاءُ اللَّهِ بِالْحُجَّةِ وَ أَخَذُوا بِالْكِتَابِ وَ الْحِكْمَةِ ",
          "فَتَفَرَّقَ مِنْ ذَلِكَ الْيَوْمِ أَهْلُ الْحَقِّ وَ أَهْلُ الْبَاطِلِ وَ تَخَاذَلَ وَ تَهَادَنَ أَهْلُ الْهُدَى وَ تَعَاوَنَ أَهْلُ الضَّلَالَةِ حَتَّى كَانَتِ الْجَمَاعَةُ مَعَ فُلَانٍ وَ أَشْبَاهِهِ فَاعْرِفْ هَذَا الصِّنْفَ وَ صِنْفٌ آخَرُ فَأَبْصِرْهُمْ رَأْيَ الْعَيْنِ نُجَبَاءُ وَ الْزَمْهُمْ حَتَّى تَرِدَ أَهْلَكَ فَ إِنَّ الْخاسِرِينَ الَّذِينَ خَسِرُوا أَنْفُسَهُمْ وَ أَهْلِيهِمْ يَوْمَ الْقِيامَةِ أَلا ذلِكَ هُوَ الْخُسْرانُ الْمُبِينُ",
          "[إِلَى هَاهُنَا رِوَايَةُ الْحُسَيْنِ وَ فِي رِوَايَةِ مُحَمَّدِ بْنِ يَحْيَى زِيَادَةٌ]",
          "لَهُمْ عِلْمٌ بِالطَّرِيقِ فَإِنْ كَانَ دُونَهُمْ بَلَاءٌ فَلَا تَنْظُرْ إِلَيْهِمْ فَإِنْ كَانَ دُونَهُمْ عَسْفٌ مِنْ أَهْلِ الْعَسْفِ وَ خَسْفٌ وَ دُونَهُمْ بَلَايَا تَنْقَضِي ثُمَّ تَصِيرُ إِلَى رَخَاءٍ ",
          "ثُمَّ اعْلَمْ أَنَّ إِخْوَانَ الثِّقَةِ ذَخَائِرُ بَعْضُهُمْ لِبَعْضٍ وَ لَوْ لَا أَنْ تَذْهَبَ بِكَ الظُّنُونُ عَنِّي لَجَلَيْتُ لَكَ عَنْ أَشْيَاءَ مِنَ الْحَقِّ غَطَّيْتُهَا وَ لَنَشَرْتُ لَكَ أَشْيَاءَ مِنَ الْحَقِّ كَتَمْتُهَا وَ لَكِنِّي أَتَّقِيكَ وَ أَسْتَبْقِيكَ وَ لَيْسَ الْحَلِيمُ الَّذِي لَا يَتَّقِي أَحَداً فِي مَكَانِ التَّقْوَى وَ الْحِلْمُ لِبَاسُ الْعَالِمِ فَلَا تَعْرَيَنَّ مِنْهُ وَ السَّلَامُ "
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473108\">H 14464</a> – Muhammad Bin Yahya, from Muhammad Bin Al-Husayn, from Muhammad Bin Ismail Bin Yazi’e, from his uncle Hamza Bin Yazi’e and Al-Husayn Bin Muhammad Bin Al-Ashary, from Ahmad Bin Muhammad Bin Abdullah, from Yazeed Bin Abdullah, from the one who narrated to him said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>bu Ja’far</span><sup>asws</sup> wrote to Sa’ad Al-Khayr: -",
            "In the Name of Allah<sup>azwj</sup>, the Beneficent, the Merciful. Having said that, I<sup>asws</sup> hereby bequeath to you to fear Allah<sup>azwj</sup> for therein is safety from destruction and a gain during the returning (to Allah<sup>azwj</sup>). Allah<sup>azwj</sup> Mighty and Majestic Protects the servant by means of his piety from whatever his intellect was remote from; and by means of piety he gets clarity from his blindness and his ignorance. And it was by piety that Noah<sup>as</sup> got salvation and those who were with him<sup>as</sup> in the ark got safety from the storm. ",
            "And it was by piety that the patient ones succeeded and survived from the calamities, and they have brethren upon that path seeking those preferences, having renounced their insolence and their intentions by the desires when the examples from the Book reached them. They praised their Lord<sup>azwj</sup> on what He<sup>azwj</sup> has Sustained them with and that He<sup>azwj</sup> was the One<sup>azwj</sup> Deserving of the Praise, and they blamed their own selves upon what they had wasted and that they themselves were deserving of the condemnation. ",
            "And they knew that Allah<sup>azwj</sup> Blessed and High, is the Forbearing, the Knowledgeable, however, He<sup>azwj</sup> is Angry on the one who does not care about His<sup>azwj</sup> Pleasure and (as a result) He<sup>azwj</sup> Withholds from the one who does not accept His<sup>azwj</sup> Favours, and but rather the one does not accept guidance from Him<sup>azwj</sup> goes astray.",
            "Then it is possible for the sinful people to turn to the repentance and change to the doing of good deeds. He<sup>azwj</sup> has Called His<sup>azwj</sup> servants in the Book to that with a Loud Voice. He<sup>azwj</sup> Never Cut-off nor Prevented the calling of His<sup>azwj</sup> servants. So Allah<sup>azwj</sup> has Cursed the ones who conceal what Allah<sup>azwj</sup> has Revealed, and Obligated upon Himself<sup>azwj</sup>, the Mercy to be before the Wrath. So He<sup>azwj</sup> Completed the Truth and the Mercy, so there is no beginning for the servant with the Wrath before he arouses His<sup>azwj</sup> Anger, and that is from the knowledge of certainty and the knowledge of piety. And every community from whom Allah<sup>azwj</sup> has Raised the Knowledge from them (Taken away), the Knowledge of the Book is when they rejected it, and befriended His<sup>az</sup><sup>wj</sup> enemies when they made them to be the rulers. ",
            "And from their rejection of the Book was that they established its letters and distorted its Limits. So they were narrating it but were not acting upon it. And the ignorant ones were pleased with the preservation of the narrations, whereas the scholars became aggrieved at their abandonment of the correct aspects of the narrations. ",
            "And from their rejection of the Book was that they made such people as rulers who did not know, so they took them (in a direction) of wherever their own desires led them, and released them to the death (ruination). They amended the ties of the Religion, and then they left it as a legacy among the foolish and the childish (people).",
            "So the community was issued with the commands devised by the people instead of the Commands of Allah<sup>azwj</sup> Blessed and High, and it is to them that they referred to. So evil it was what the unjust took in exchange, the governance of the people instead of the Governance of Allah<sup>azwj</sup>, and took the reward of the people instead of the Reward of Allah<sup>azwj</sup>, and the pleasure of the people instead of the Pleasure of Allah<sup>azwj</sup>.",
            "So this is how the community has become, and among them were those who strived (The Mujtahids) in the worship upon that misguidance. They (the people) were fascinated by them, and admired them, and their worship became a strife (Fitna) for them as well as those who followed them, whereas in the Messengers<sup>as</sup> there was a Reminder for the worshippers. Of these Prophets<sup>as</sup> was a Prophet<sup>as</sup> who was complete in his<sup>as</sup> worship, but then he<sup>as</sup> disobeyed Allah<sup>azwj</sup> Blessed and High in one aspect, so he<sup>as</sup> was exited from the Paradise, and he<sup>as</sup> was thrown into the belly of the whale. Then he<sup>as</sup> was not rescued until he<sup>as</sup> recognised (Al-Wilayah<a id=\"_ftnref8\"></a><sup>[8]</sup>) and repented.  ",
            "So understand that there are similar ones to ‘<span class=\"iTxt\">Al-Ahbaar</span> and <span class=\"iTxt\">Al-Rahbaan’</span> who go around concealing the Book, and alter it. So their business did not give them any gain and they were not of the guided ones. Then understand those that are similar to them in this community who establish the letters of the Book and alter its Limits. So they are with the chiefs and the notables, and when they disperse there are guided by the desires and they are with those who have a lot of the world (wealth), and that is what has reached to them from the knowledge. They do not cease to be like that in the copying (emulating) and the greed. The voice of Iblees<sup>la</sup> does not cease to be heard from their tongues with the falsehood, a great deal. The scholars observe patience from them from the harm that they<sup>asws</sup> suffer and their bullying, whereas they themselves blame the scholars for having burdened them. And the scholars in themselves are disloyal for having concealed the advice when they see a lost and strayed one with no guidance to him, or for not having revived a dead one. ",
            "So evil it is what they do because Allah<sup>azwj</sup> Blessed and High has Taken a Covenant to them in the Book that they would enjoin the doing of good and by what He<sup>azwj</sup> has Ordered for, and forbid them from what He<sup>azwj</sup> has Forbidden them from, and that they would help each other upon the goodness, and the piety, and will not co-operate upon the sins and the animosity. ",
            "So the scholars are in a struggle in their efforts from the ignorant ones, that if they give good advice, the people would say that they have transgressed. And if they come to know the truth which they had avoided, they would say that they have opposed. And if they quit they would say that they have separated, and they say, ‘Give us your proof on what you are narrating’, they would say that they have become hypocrites, and if they obey them, they would say that Allah<sup>azwj</sup> Mighty and Majestic has been disobeyed. ",
            "So the ignorant ones are destroyed in what they do not know, unlettered in what they recite. They ratify the Book when it is defined and deny it in its altered state (Meaning they accept the present altered one and reject the original one which they consider to be the altered one), and so they are not deniers as such. They are similar to Al-Ahbaar and Al-Rahbaan, leaders in matters of desires and chiefs in matters of ruination, and others from among them are seated in between the misguidance and the guidance, not understanding one community from the other. They are saying that the people do not know this, not will they return to what it used to be.",
            "And they are right. The Messenger<sup>saww</sup> of Allah<sup>azwj</sup> left them upon the clarity, its night from its day. No innovations appeared among them, nor was the Sunnah changed among them. ",
            "There was no opposition from them or differences among them. So what made the people to be covered in darkness of their errors (sins) is when two imams appeared, one<sup>asws</sup> calling to Allah<sup>azwj</sup> Blessed and High, and one calling to the Fire. ",
            "At that time Satan<sup>la</sup> spoke in a loud voice by the tongues of his<sup>la</sup> friends and numerous were his horsemen, and infantry, and he included them in the wealth and the sons, the ones who associated with him<sup>la</sup>. So they acted by the innovations, and avoided the Book and the Sunnah, whereas the Guardians<sup>asws</sup> of Allah<sup>azwj</sup> spoke by the Proof and took to the Book and the Wisdom. ",
            "So from that day on, the people of the truth separated from the people of the falsehood. The people of guidance were abandoned and insulted, whilst the people of the misguidance helped each other until they became a group with so and so, and the like of him. So, understand this type, and the other type and look at them by the eyes of the excellent ones, and be firm with them until you come to your family, for the losers are the one who have lost themselves and their families on the Day of Judgement. Indeed! That is the clear loss’. ",
            "(Up to here is the report of Al-Husayn, and in the report of Muhammad Bin Yahya this is the extra bit).",
            "‘They (people of the truth) know the path, if without them<sup>asws</sup> there are afflictions do not hold it against them<sup>asws</sup>. If without them<sup>asws</sup> there is tyranny from the tyrannous people, and sinking of the earth and other afflictions, it will soon pass, then you will travel to the prosperity (through them<sup>asws</sup>).  ",
            "Then know that the reliable brothers are an ammunition, some of them for the other. Had it not been that you would leave from me<sup>asws</sup> due to your conjectures, I<sup>asws</sup> would have clarified for you certain things from the truth which I<sup>asws</sup> have kept covered, and would make public certain things from the truth which I<sup>asws</sup> have kept concealed, but I<sup>asws</sup> fear for you, and want you to remain (alive), and it is not for the forbearing person that he would not fear for anyone in the place of the piety, and the forbearance is the robe of the scholar, so do not be without it. ‘Salam’ (peace be with you)’. "
          ],
          "en.sarwar": [
            "16. Muhammad Bin Yahya, from Muhammad Bin Al-Husayn, from Muhammad Bin Ismail Bin Yazi’e, from his uncle Hamza Bin Yazi’e and Al-Husayn Bin Muhammad Bin Al-Ashary, from Ahmad Bin Muhammad Bin Abdullah, from Yazeed Bin Abdullah, from the one who narrated to him said: ‘Abu Ja’far (a.s.) wrote to Sa’ad Al-Khayr: - In the Name of Allah (azwj), the Beneficent, the Merciful. Having said that, I (a.s.) hereby bequeath to you to fear Allah (azwj) for therein is safety from destruction and a gain during the returning (to Allah (azwj)). Allah (azwj) Mighty and Majestic Protects the servant by means of his piety from whatever his intellect was remote from; and by means of piety he gets clarity from his blindness and his ignorance. And it was by piety that Noah (as) got salvation and those who were with him (as) in the ark got safety from the storm. And it was by piety that the patient ones succeeded and survived from the calamities, and they have brethren upon that path seeking those preferences, having renounced their insolence and their intentions by the desires when the examples from the Book reached them. They praised their Lord (azwj) on what He (azwj) has Sustained them with and that He (azwj) was the One (azwj) Deserving of the Praise, and they blamed their own selves upon what they had wasted and that they themselves were deserving of the condemnation. And they knew that Allah (azwj) Blessed and High, is the Forbearing, the Knowledgeable, however, He (azwj) is Angry on the one who does not care about His (azwj) Pleasure and (as a result) He (azwj) Withholds from the one who does not accept His (azwj) Favours, and but rather the one does not accept guidance from Him (azwj) goes astray. Then it is possible for the sinful people to turn to the repentance and change to the doing of good deeds. He (azwj) has Called His (azwj) servants in the Book to that with a Loud Voice. He (azwj) Never Cut-off nor Prevented the calling of His (azwj) servants. So Allah (azwj) has Cursed the ones who conceal what Allah (azwj) has Revealed, and Obligated upon Himself (azwj), the Mercy to be before the Wrath. So He (azwj) Completed the Truth and the Mercy, so there is no beginning for the servant with the Wrath before he arouses His (azwj) Anger, and that is from the knowledge of certainty and the knowledge of piety. And every community from whom Allah (azwj) has Raised the Knowledge from them (Taken away), the Knowledge of the Book is when they rejected it, and befriended His (azwj) enemies when they made them to be the rulers. And from their rejection of the Book was that they established its letters and distorted its Limits. So they were narrating it but were not acting upon it. And the ignorant ones were pleased with the preservation of the narrations, whereas the scholars became aggrieved at their abandonment of the correct aspects of the narrations. And from their rejection of the Book was that they made such people as rulers who did not know, so they took them (in a direction) of wherever their own desires led them, and released them to the death (ruination). They amended the ties of the Religion, and then they left it as a legacy among the foolish and the childish (people). So the community was issued with the commands devised by the people instead of the Commands of Allah (azwj) Blessed and High, and it is to them that they referred to. So evil it was what the unjust took in exchange, the governance of the people instead of the Governance of Allah (azwj), and took the reward of the people instead of the Reward of Allah (azwj), and the pleasure of the people instead of the Pleasure of Allah (azwj). So this is how the community has become, and among them were those who strived (The Mujtahids) in the worship upon that misguidance. They (the people) were fascinated by them, and admired them, and their worship became a strife (Fitna) for them as well as those who followed them, whereas in the Messengers (as) there was a Reminder for the worshippers. Of these Prophets (as) was a Prophet (as) who was complete in his (as) worship, but then he (as) disobeyed Allah (azwj) Blessed and High in one aspect, so he (as) was exited from the Paradise, and he (as) was thrown into the belly of the whale. Then he (as) was not rescued until he (as) recognised (Al-Wilayah) and repented. So understand that there are similar ones to ‘Al-Ahbaar and Al-Rahbaan’ who go around concealing the Book, and alter it. So their business did not give them any gain and they were not of the guided ones. Then understand those that are similar to them in this community who establish the letters of the Book and alter its Limits. So they are with the chiefs and the notables, and when they disperse there are guided by the desires and they are with those who have a lot of the world (wealth), and that is what has reached to them from the knowledge. They do not cease to be like that in the copying (emulating) and the greed. The voice of Iblees (la) does not cease to be heard from their tongues with the falsehood, a great deal. The scholars observe patience from them from the harm that they (a.s.) suffer and their bullying, whereas they themselves blame the scholars for having burdened them. And the scholars in themselves are disloyal for having concealed the advice when they see a lost and strayed one with no guidance to him, or for not having revived a dead one. So evil it is what they do because Allah (azwj) Blessed and High has Taken a Covenant to them in the Book that they would enjoin the doing of good and by what He (azwj) has Ordered for, and forbid them from what He (azwj) has Forbidden them from, and that they would help each other upon the goodness, and the piety, and will not co-operate upon the sins and the animosity. So the scholars are in a struggle in their efforts from the ignorant ones, that if they give good advice, the people would say that they have transgressed. And if they come to know the truth which they had avoided, they would say that they have opposed. And if they quit they would say that they have separated, and they say, ‘Give us your proof on what you are narrating’, they would say that they have become hypocrites, and if they obey them, they would say that Allah (azwj) Mighty and Majestic has been disobeyed. So the ignorant ones are destroyed in what they do not know, unlettered in what they recite. They ratify the Book when it is defined and deny it in its altered state (Meaning they accept the present altered one and reject the original one which they consider to be the altered one), and so they are not deniers as such. They are similar to Al-Ahbaar and Al-Rahbaan, leaders in matters of desires and chiefs in matters of ruination, and others from among them are seated in between the misguidance and the guidance, not understanding one community from the other. They are saying that the people do not know this, not will they return to what it used to be. And they are right. The Messenger (saww) of Allah (azwj) left them upon the clarity, its night from its day. No innovations appeared among them, nor was the Sunnah changed among them. There was no opposition from them or differences among them. So what made the people to be covered in darkness of their errors (sins) is when two imams appeared, one (a.s.) calling to Allah (azwj) Blessed and High, and one calling to the Fire. At that time Satan (la) spoke in a loud voice by the tongues of his (la) friends and numerous were his horsemen, and infantry, and he included them in the wealth and the sons, the ones who associated with him (la). So they acted by the innovations, and avoided the Book and the Sunnah, whereas the Guardians (a.s.) of Allah (azwj) spoke by the Proof and took to the Book and the Wisdom. So from that day on, the people of the truth separated from the people of the falsehood. The people of guidance were abandoned and insulted, whilst the people of the misguidance helped each other until they became a group with so and so, and the like of him. So, understand this type, and the other type and look at them by the eyes of the excellent ones, and be firm with them until you come to your family, for the losers are the one who have lost themselves and their families on the Day of Judgement. Indeed! That is the clear loss’. (Up to here is the report of Al-Husayn, and in the report of Muhammad Bin Yahya this is the extra bit). ‘They (people of the truth) know the path, if without them (a.s.) there are afflictions do not hold it against them (a.s.). If without them (a.s.) there is tyranny from the tyrannous people, and sinking of the earth and other afflictions, it will soon pass, then you will travel to the prosperity (through them (a.s.)). Then know that the reliable brothers are an ammunition, some of them for the other. Had it not been that you would leave from me (a.s.) due to your conjectures, I (a.s.) would have clarified for you certain things from the truth which I (a.s.) have kept covered, and would make public certain things from the truth which I (a.s.) have kept concealed, but I (a.s.) fear for you, and want you to remain (alive), and it is not for the forbearing person that he would not fear for anyone in the place of the piety, and the forbearance is the robe of the scholar, so do not be without it. ‘Salam’ (peace be with you)’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:7",
  "kind": "verse_list"
}