{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 8"
        },
        "path": "/books/al-kafi:8",
        "titles": {
          "ar": "الجزء الثامن‏",
          "en": "Volume Eight"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:8:1",
        "titles": {
          "ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;",
          "en": "The Book - Garden (of Flowers)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 8"
        },
        "path": "/books/al-kafi:8:1:8",
        "titles": {
          "ar": "رِسَالَةٌ مِنْهُ ( عليه السلام ) إِلَيْهِ أَيْضاً",
          "en": "A MESSAGE (LETTER) AS WELL FROM HIM <sup>asws</sup> TO HIM"
        }
      }
    ],
    "index": 2279,
    "local_index": 8,
    "part_type": "Chapter",
    "path": "/books/al-kafi:8:1:8",
    "titles": {
      "ar": "رِسَالَةٌ مِنْهُ ( عليه السلام ) إِلَيْهِ أَيْضاً",
      "en": "A MESSAGE (LETTER) AS WELL FROM HIM <sup>asws</sup> TO HIM"
    },
    "verse_count": 4,
    "verse_start_index": 14700,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح على الظاهر</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 122)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14701,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:8:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14465</span>-  مُحَمَّدُ بْنُ</span> يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ عَمِّهِ حَمْزَةَ بْنِ بَزِيعٍ قَالَ كَتَبَ أَبُو جَعْفَرٍ ( عليه السلام ) إِلَى سَعْدٍ الْخَيْرِ ",
          "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ أَمَّا بَعْدُ فَقَدْ جَاءَنِي كِتَابُكَ تَذْكُرُ فِيهِ مَعْرِفَةَ مَا لَا يَنْبَغِي تَرْكُهُ وَ طَاعَةَ مَنْ رِضَا اللَّهِ رِضَاهُ فَقُلْتَ مِنْ ذَلِكَ لِنَفْسِكَ مَا كَانَتْ نَفْسُكَ مُرْتَهَنَةً لَوْ تَرَكْتَهُ تَعْجَبُ أَنَّ رِضَا اللَّهِ وَ طَاعَتَهُ وَ نَصِيحَتَهُ لَا تُقْبَلُ وَ لَا تُوجَدُ وَ لَا تُعْرَفُ إِلَّا فِي عِبَادٍ غُرَبَاءَ أَخْلَاءً مِنَ النَّاسِ قَدِ اتَّخَذَهُمُ النَّاسُ سِخْرِيّاً لِمَا يَرْمُونَهُمْ بِهِ مِنَ الْمُنْكَرَاتِ وَ كَانَ يُقَالُ لَا يَكُونُ الْمُؤْمِنُ مُؤْمِناً حَتَّى يَكُونَ أَبْغَضَ إِلَى النَّاسِ مِنْ جِيفَةِ الْحِمَارِ وَ لَوْ لَا أَنْ يُصِيبَكَ مِنَ الْبَلَاءِ مِثْلُ الَّذِي أَصَابَنَا فَتَجْعَلَ فِتْنَةَ النَّاسِ كَعَذَابِ اللَّهِ وَ أُعِيذُكَ بِاللَّهِ وَ إِيَّانَا مِنْ ذَلِكَ لَقَرُبْتَ عَلَى بُعْدِ مَنْزِلَتِكَ",
          "وَ اعْلَمْ رَحِمَكَ اللَّهُ أَنَّهُ لَا تُنَالُ مَحَبَّةُ اللَّهِ إِلَّا بِبُغْضِ كَثِيرٍ مِنَ النَّاسِ وَ لَا وَلَايَتُهُ إِلَّا بِمُعَادَاتِهِمْ وَ فَوْتُ ذَلِكَ قَلِيلٌ يَسِيرٌ لِدَرْكِ ذَلِكَ مِنَ اللَّهِ لِقَوْمٍ يَعْلَمُونَ ",
          "يَا أَخِي إِنَّ اللَّهَ عَزَّ وَ جَلَّ جَعَلَ فِي كُلٍّ مِنَ الرُّسُلِ بَقَايَا مِنْ أَهْلِ الْعِلْمِ يَدْعُونَ مَنْ ضَلَّ إِلَى الْهُدَى وَ يَصْبِرُونَ مَعَهُمْ عَلَى الْأَذَى يُجِيبُونَ دَاعِيَ اللَّهِ وَ يَدْعُونَ إِلَى اللَّهِ ",
          "فَأَبْصِرْهُمْ رَحِمَكَ اللَّهُ فَإِنَّهُمْ فِي مَنْزِلَةٍ رَفِيعَةٍ وَ إِنْ أَصَابَتْهُمْ فِي الدُّنْيَا وَضِيعَةٌ إِنَّهُمْ يُحْيُونَ بِكِتَابِ اللَّهِ الْمَوْتَى وَ يُبَصِّرُنَّ بِنُورِ اللَّهِ مِنَ الْعَمَى كَمْ مِنْ قَتِيلٍ لِإِبْلِيسَ قَدْ أَحْيَوْهُ وَ كَمْ مِنْ تَائِهٍ ضَالٍّ قَدْ هَدَوْهُ يَبْذُلُونَ دِمَاءَهُمْ دُونَ هَلَكَةِ الْعِبَادِ وَ مَا أَحْسَنَ أَثَرَهُمْ عَلَى الْعِبَادِ وَ أَقْبَحَ آثَارَ الْعِبَادِ عَلَيْهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473110\">H 14465</a> – Muhammad Bin Yahya, from Muhammad Bin Al-Husayn, from Muhammad Bin Ismail Bin Yazi’e, from his uncle Hamza Bin Yazi’e who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>bu Ja’far</span><sup>asws</sup> wrote to Sa’d Al-Khayr: - ",
            "‘In the Name of Allah<sup>azwj</sup>, the Beneficent, the Merciful. Having said that, your letter came to me<sup>asws</sup> in which you have asked how much it is necessary to learn and the obedience to the one<sup>asws</sup> whose pleasure is the Pleasure of Allah<sup>azwj</sup>. So then you had said to yourself, then you will not be blamed if you then avoid some other. ",
            "You are (also) amazed (by the fact) that the Pleasure of Allah<sup>azwj</sup>, and obedience to Him<sup>azwj</sup>, and His<sup>azwj</sup> Advice is neither accepted, nor found, nor recognised except within the servants who are unrecognised (unknown to public), who are alone (away) from the people. ",
            "The people have taken them in ridicule and they ascribe to them evil matters to the extent that it was said that one cannot be a Believer and is not a Believer until he becomes more hated by the people than the carcass of a donkey. And if you suffer from the affliction similar to what we<sup>asws</sup> have suffered, so do not consider the strife of the people (against you) like a Punishment of Allah<sup>azwj</sup>, and I<sup>asws</sup> seek Refuge with Allah<sup>azwj</sup> as well as for you all from that, to Bring near your destination which though is a far distance.",
            "And know, may Allah<sup>azwj</sup> have Mercy upon you, that one cannot achieve the Love of Allah<sup>azwj</sup> except by hatred from a lot of the people, nor His<sup>azwj</sup> Wilayah except by being their enemy, and losing (their friendship) is very little in comparison to that which is Gained from Allah<sup>azwj</sup>, for a people who know. ",
            "O my<sup>asws</sup> brother, verily Allah<sup>azwj</sup> Mighty and Majestic has Made regarding everyone from the Messengers<sup>as</sup> a successor<sup>as</sup> who remains, from the people of the knowledge, calling the one who has strayed towards the guidance, and observes patience along with them upon the suffering, answering to the Call of Allah<sup>azwj</sup> and calling towards Allah<sup>azwj</sup>.",
            "So look at them<sup>asws</sup>, may Allah<sup>azwj</sup> have Mercy upon you, for they<sup>asws</sup> are in a high position even though they would be in affliction in the world and considered to be menial. They<sup>asws</sup> revive the dead by the Book of Allah<sup>azwj</sup>, and they<sup>asws</sup> visualise by the Light of Allah<sup>azwj</sup> from the blindness. How many who had been killed by the Iblees<sup>la</sup> were revived by them<sup>asws</sup>, and how many lost and strayed ones were guided by them<sup>asws</sup>, sacrificing their<sup>asws</sup> blood to save the servants from destruction, and how good are their<sup>asws</sup> effects upon the servants, and how ugly are the effects of the people against them<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "17. Muhammad Bin Yahya, from Muhammad Bin Al-Husayn, from Muhammad Bin Ismail Bin Yazi’e, from his uncle Hamza Bin Yazi’e who said: ‘Abu Ja’far (a.s.) wrote to Sa’d Al-Khayr: - ‘In the Name of Allah (azwj), the Beneficent, the Merciful. Having said that, your letter came to me (a.s.) in which you have asked how much it is necessary to learn and the obedience to the one (a.s.) whose pleasure is the Pleasure of Allah (azwj). So then you had said to yourself, then you will not be blamed if you then avoid some other. You are (also) amazed (by the fact) that the Pleasure of Allah (azwj), and obedience to Him (azwj), and His (azwj) Advice is neither accepted, nor found, nor recognised except within the servants who are unrecognised (unknown to public), who are alone (away) from the people. The people have taken them in ridicule and they ascribe to them evil matters to the extent that it was said that one cannot be a Believer and is not a Believer until he becomes more hated by the people than the carcass of a donkey. And if you suffer from the affliction similar to what we (a.s.) have suffered, so do not consider the strife of the people (against you) like a Punishment of Allah (azwj), and I (a.s.) seek Refuge with Allah (azwj) as well as for you all from that, to Bring near your destination which though is a far distance. And know, may Allah (azwj) have Mercy upon you, that one cannot achieve the Love of Allah (azwj) except by hatred from a lot of the people, nor His (azwj) Wilayah except by being their enemy, and losing (their friendship) is very little in comparison to that which is Gained from Allah (azwj), for a people who know. O my (a.s.) brother, verily Allah (azwj) Mighty and Majestic has Made regarding everyone from the Messengers (as) a successor (as) who remains, from the people of the knowledge, calling the one who has strayed towards the guidance, and observes patience along with them upon the suffering, answering to the Call of Allah (azwj) and calling towards Allah (azwj). So look at them (a.s.), may Allah (azwj) have Mercy upon you, for they (a.s.) are in a high position even though they would be in affliction in the world and considered to be menial. They (a.s.) revive the dead by the Book of Allah (azwj), and they (a.s.) visualise by the Light of Allah (azwj) from the blindness. How many who had been killed by the Iblees (la) were revived by them (a.s.), and how many lost and strayed ones were guided by them (a.s.), sacrificing their (a.s.) blood to save the servants from destruction, and how good are their (a.s.) effects upon the servants, and how ugly are the effects of the people against them (a.s.)’."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 125)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14702,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:8:2",
        "text": [
          "14466-  عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ أَبِيهِ عَنْ أَبِي بَصِيرٍ قَالَ بَيْنَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) ذَاتَ يَوْمٍ جَالِساً إِذْ أَقْبَلَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ فِيكَ شَبَهاً مِنْ عِيسَى ابْنِ مَرْيَمَ وَ لَوْ لَا أَنْ تَقُولَ فِيكَ طَوَائِفُ مِنْ أُمَّتِي مَا قَالَتِ النَّصَارَى فِي عِيسَى ابْنِ مَرْيَمَ لَقُلْتُ فِيكَ قَوْلًا لَا تَمُرُّ بِمَلَإٍ مِنَ النَّاسِ إِلَّا أَخَذُوا التُّرَابَ مِنْ تَحْتِ قَدَمَيْكَ يَلْتَمِسُونَ بِذَلِكَ الْبَرَكَةَ ",
          "قَالَ فَغَضِبَ الْأَعْرَابِيَّانِ وَ الْمُغِيرَةُ بْنُ شُعْبَةَ وَ عِدَّةٌ مِنْ قُرَيْشٍ مَعَهُمْ فَقَالُوا مَا رَضِيَ أَنْ يَضْرِبَ لِابْنِ عَمِّهِ مَثَلًا إِلَّا عِيسَى ابْنَ مَرْيَمَ فَأَنْزَلَ اللَّهُ عَلَى نَبِيِّهِ ( صلى الله عليه وآله ) فَقَالَ وَ لَمَّا ضُرِبَ ابْنُ مَرْيَمَ مَثَلًا إِذا قَوْمُكَ مِنْهُ يَصِدُّونَ وَ قالُوا أَ آلِهَتُنا خَيْرٌ أَمْ هُوَ ما ضَرَبُوهُ لَكَ إِلَّا جَدَلًا بَلْ هُمْ قَوْمٌ خَصِمُونَ إِنْ هُوَ إِلَّا عَبْدٌ أَنْعَمْنا عَلَيْهِ وَ جَعَلْناهُ مَثَلًا لِبَنِي إِسْرائِيلَ وَ لَوْ نَشاءُ لَجَعَلْنا مِنْكُمْ يَعْنِي مِنْ بَنِي هَاشِمٍ مَلائِكَةً فِي الْأَرْضِ يَخْلُفُونَ ",
          "قَالَ فَغَضِبَ الْحَارِثُ بْنُ عَمْرٍو الْفِهْرِيُّ فَقَالَ اللَّهُمَّ إِنْ كانَ هذا هُوَ الْحَقَّ مِنْ عِنْدِكَ أَنَّ بَنِي هَاشِمٍ يَتَوَارَثُونَ هِرَقْلًا بَعْدَ هِرَقْلٍ فَأَمْطِرْ عَلَيْنا حِجارَةً مِنَ السَّماءِ أَوِ ائْتِنا بِعَذابٍ أَلِيمٍ فَأَنْزَلَ اللَّهُ عَلَيْهِ مَقَالَةَ الْحَارِثِ وَ نَزَلَتْ هَذِهِ الْآيَةُ وَ ما كانَ اللَّهُ لِيُعَذِّبَهُمْ وَ أَنْتَ فِيهِمْ وَ ما كانَ اللَّهُ مُعَذِّبَهُمْ وَ هُمْ يَسْتَغْفِرُونَ ",
          "ثُمَّ قَالَ لَهُ يَا ابْنَ عَمْرٍو إِمَّا تُبْتَ وَ إِمَّا رَحَلْتَ فَقَالَ يَا مُحَمَّدُ بَلْ تَجْعَلُ لِسَائِرِ قُرَيْشٍ شَيْئاً مِمَّا فِي يَدَيْكَ فَقَدْ ذَهَبَتْ بَنُو هَاشِمٍ بِمَكْرُمَةِ الْعَرَبِ وَ الْعَجَمِ فَقَالَ لَهُ النَّبِيُّ ( صلى الله عليه وآله ) لَيْسَ ذَلِكَ إِلَيَّ ذَلِكَ إِلَى اللَّهِ تَبَارَكَ وَ تَعَالَى فَقَالَ يَا مُحَمَّدُ قَلْبِي مَا يُتَابِعُنِي عَلَى التَّوْبَةِ وَ لَكِنْ أَرْحَلُ عَنْكَ فَدَعَا بِرَاحِلَتِهِ فَرَكِبَهَا فَلَمَّا صَارَ بِظَهْرِ الْمَدِينَةِ أَتَتْهُ جَنْدَلَةٌ فَرَضَخَتْ هَامَتَهُ ",
          "ثُمَّ أَتَى الْوَحْيُ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) فَقَالَ سَأَلَ سائِلٌ بِعَذابٍ واقِعٍ لِلْكافِرينَ بِوَلَايَةِ عَلِيٍّ لَيْسَ لَهُ دافِعٌ مِنَ اللَّهِ ذِي الْمَعارِجِ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ إِنَّا لَا نَقْرَؤُهَا هَكَذَا فَقَالَ هَكَذَا وَ اللَّهِ نَزَلَ بِهَا جَبْرَئِيلُ عَلَى مُحَمَّدٍ ( صلى الله عليه وآله ) وَ هَكَذَا هُوَ وَ اللَّهِ مُثْبَتٌ فِي مُصْحَفِ فَاطِمَةَ ( عليها السلام ) ",
          "فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِمَنْ حَوْلَهُ مِنَ الْمُنَافِقِينَ انْطَلِقُوا إِلَى صَاحِبِكُمْ فَقَدْ أَتَاهُ مَا اسْتَفْتَحَ بِهِ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ اسْتَفْتَحُوا وَ خابَ كُلُّ جَبَّارٍ عَنِيدٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473111\">H 14466</a> – A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Suleyman, from his father, from Abu Baseer who said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-o\">‘O</span>ne day the Messenger</span><sup>saww</sup> of Allah<sup>azwj</sup> was explaining (matters) in a session, when Amir-ul-Momineen<sup>asws</sup> came over. The Messenger<sup>saww</sup> of Allah<sup>azwj</sup> said to him<sup>asws</sup> that: ‘In you<sup>asws</sup> there is a similarity with Isa<sup>as</sup> Bin Maryam<sup>as</sup>, and had it not been for a sect from my<sup>saww</sup> community saying regarding you<sup>asws</sup> what the Christians are saying regarding Isa<sup>as</sup> Bin Maryam<sup>asws</sup>, I<sup>saww</sup> would have said regarding you<sup>asws</sup> such words that none from the people would pass by you<sup>asws</sup> except that he would take the dust from under your<sup>asws</sup> feet seeking Blessings by that’. ",
            "He<sup style=\"font-weight: normal\">asws</sup> said: ‘Two Arabs became angered along with Al-Mugheira Bin Sho’bat as well a number from the Qureish among them. So they said, ‘He<sup style=\"font-weight: normal\">saww</sup> was not happy until he<sup style=\"font-weight: normal\">saww</sup> struck an example for the son<sup style=\"font-weight: normal\">asws</sup> of his<sup style=\"font-weight: normal\">saww</sup> uncle<sup style=\"font-weight: normal\">as</sup> with Isa<sup style=\"font-weight: normal\">as</sup> Bin Maryam<sup style=\"font-weight: normal\">as</sup>’. So Allah<sup style=\"font-weight: normal\">azwj</sup> Revealed unto His<sup style=\"font-weight: normal\">azwj</sup> Prophet<sup style=\"font-weight: normal\">saww</sup> Saying: <span class=\"ibTxt\">“[43:57] When (Jesus) the son of Mary is held up as an example, behold, thy people raise a clamour thereat (in ridicule)! [43:58] And they say: Are our gods better, or is he? They do not set it forth to you save by way of disputation; Ineed, they are a contentious people. [43:59] He was naught but a servant on whom We bestowed favour, and We made him an example for the children of Israel [43:60] And if it were Our Will, We could make angels from amongst you” </span>meaning the Clan of Hashim<sup style=\"font-weight: normal\">as</sup>,<span class=\"ibTxt\"> “succeeding each other on the earth”</span>",
            "He<sup>asws</sup> said: ‘Al-Haaris Bin Amro Al-Fahry became angry and said, ‘Our Allah<sup>azwj</sup>! If this was the truth from You<sup>azwj</sup> that the Clan of Hashim<sup>a</sup><sup>s</sup> will be inheriting from Heraclius and after Heraclius, so Rain upon us stones from the sky or Bring down upon us a Grievous Punishment’. So Allah<sup>azwj</sup> Revealed against the words of Al-Haaris and this Verse Came down: <span class=\"ibTxt\">“[8:33] But Allah was not going to chastise them while you were among them, nor is Allah going to chastise them while yet they ask for forgiveness”</span>.",
            "Then he<sup>saww</sup> said to him: ‘O Ibn Amro, either you repent or you leave’. He said, ‘O Muhammad<sup>saww</sup>, but you<sup>saww</sup> have made for all of the Qureish something from what is in your<sup>saww</sup> hands, for the Clan of Hashim<sup>as</sup> have taken away the prestige of the Arabs and the non-Arabs’. ",
            "The Prophet<sup>saww</sup> said to him: ‘That is not up to me<sup>saww</sup>, but that is up to Allah<sup>azwj</sup> Blessed and High’. He said, ‘O Muhammad<sup>saww</sup>, my heart does not incline me for the repentance, but I shall leave from you’. So he called for his ride and rode away. When he came to the back of Al-Medina, a stone fell upon him and crushed his skull.",
            "Then Revelation Came to the Prophet<sup>saww</sup> Saying: <span class=\"ibTxt\">“[70:1] One demanding, demanded the chastisement which must befall [70:2] Upon the disbelievers, of the Wilayah of Ali</span><sup class=\"ibTxt\">asws</sup><span class=\"ibTxt\"> which none can repel [70:3] From Allah, Lord of the Ascending Stairways”</span>. He (the narrator) said, ‘I said, ‘May I be sacrificed for you<sup>asws</sup>, we do not read it like this’. He<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! Jibraeel Descended with it upon Muhammad<sup>saww</sup>, and by Allah<sup>azwj</sup>, this is how it is recorded in the Parchment (Mus’haf) of Fatima<sup>asws</sup>’.",
            "So the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> said to those who were around him<sup>saww</sup> from the hypocrites: ‘Go to your companion, for he has got what he was seeking for’. Allah<sup>azwj</sup> Mighty and Majestic Said: <span class=\"ibTxt\">“[14:15] And they asked for Judgement and every insolent opposer was disappointed”</span>."
          ],
          "en.sarwar": [
            "18. A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Suleyman, from his father, from Abu Baseer who said: ‘One day the Messenger (saww) of Allah (azwj) was explaining (matters) in a session, when Amir-ul-Momineen (a.s.) came over. The Messenger (saww) of Allah (azwj) said to him (a.s.) that: ‘In you (a.s.) there is a similarity with Isa (as) Bin Maryam (as), and had it not been for a sect from my (saww) community saying regarding you (a.s.) what the Christians are saying regarding Isa (as) Bin Maryam (a.s.), I (saww) would have said regarding you (a.s.) such words that none from the people would pass by you (a.s.) except that he would take the dust from under your (a.s.) feet seeking Blessings by that’. He (a.s.) said: ‘Two Arabs became angered along with Al-Mugheira Bin Sho’bat as well a number from the Qureish among them. So they said, ‘He (saww) was not happy until he (saww) struck an example for the son (a.s.) of his (saww) uncle (as) with Isa (as) Bin Maryam (as)’. So Allah (azwj) Revealed unto His (azwj) Prophet (saww) Saying: “[43:57] When (Jesus) the son of Mary is held up as an example, behold, thy people raise a clamour thereat (in ridicule)! [43:58] And they say: Are our gods better, or is he? They do not set it forth to you save by way of disputation; Ineed, they are a contentious people. [43:59] He was naught but a servant on whom We bestowed favour, and We made him an example for the children of Israel [43:60] And if it were Our Will, We could make angels from amongst you” meaning the Clan of Hashim (as), “succeeding each other on the earth” He (a.s.) said: ‘Al-Haaris Bin Amro Al-Fahry became angry and said, ‘Our Allah (azwj)! If this was the truth from You (azwj) that the Clan of Hashim (as) will be inheriting from Heraclius and after Heraclius, so Rain upon us stones from the sky or Bring down upon us a Grievous Punishment’. So Allah (azwj) Revealed against the words of Al-Haaris and this Verse Came down: “[8:33] But Allah was not going to chastise them while you were among them, nor is Allah going to chastise them while yet they ask for forgiveness”. Then he (saww) said to him: ‘O Ibn Amro, either you repent or you leave’. He said, ‘O Muhammad (saww), but you (saww) have made for all of the Qureish something from what is in your (saww) hands, for the Clan of Hashim (as) have taken away the prestige of the Arabs and the non-Arabs’. The Prophet (saww) said to him: ‘That is not up to me (saww), but that is up to Allah (azwj) Blessed and High’. He said, ‘O Muhammad (saww), my heart does not incline me for the repentance, but I shall leave from you’. So he called for his ride and rode away. When he came to the back of Al-Medina, a stone fell upon him and crushed his skull. Then Revelation Came to the Prophet (saww) Saying: “[70:1] One demanding, demanded the chastisement which must befall [70:2] Upon the disbelievers, of the Wilayah of Ali (a.s.) which none can repel [70:3] From Allah, Lord of the Ascending Stairways”. He (the narrator) said, ‘I said, ‘May I be sacrificed for you (a.s.), we do not read it like this’. He (a.s.) said: ‘By Allah (azwj)! Jibraeel Descended with it upon Muhammad (saww), and by Allah (azwj), this is how it is recorded in the Parchment (Mus’haf) of Fatima (a.s.)’. So the Messenger (saww) of Allah (azwj) said to those who were around him (saww) from the hypocrites: ‘Go to your companion, for he has got what he was seeking for’. Allah (azwj) Mighty and Majestic Said: “[14:15] And they asked for Judgement and every insolent opposer was disappointed”."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 129)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (3/383)"
        ],
        "index": 14703,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:8:3",
        "text": [
          "14467- مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنِ ابْنِ مُسْكَانَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِهِ عَزَّ وَ جَلَّ ظَهَرَ الْفَسادُ فِي الْبَرِّ وَ الْبَحْرِ بِما كَسَبَتْ أَيْدِي النَّاسِ قَالَ ذَاكَ وَ اللَّهِ حِينَ قَالَتِ الْأَنْصَارُ مِنَّا أَمِيرٌ وَ مِنْكُمْ أَمِيرٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473112\">H 14467</a> – Muhammad Bin Yahya, from Muhammad Bin Al-Husyan, fom Ali Bin Al-No’man, from Ibn Muskaan, from Muhammad Bin Muslim who has said:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>bu Ja’far</span><sup>a</sup><sup>sws</sup> regarding the Statement of the Mighty and Majestic: <span class=\"ibTxt\">“[30:41] Corruption has appeared in the land and the sea on account of what the hands of men have wrought”</span>, he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>, that was when the ‘Al-Ansar’ (Helpers) said, ‘from us should be an Emir (commander), and from you should be an Emir’ (referring to Saqifa). "
          ],
          "en.sarwar": [
            "19. Muhammad Bin Yahya, from Muhammad Bin Al-Husyan, fom Ali Bin Al-No’man, from Ibn Muskaan, from Muhammad Bin Muslim who has said: Abu Ja’far (a.s.) regarding the Statement of the Mighty and Majestic: “[30:41] Corruption has appeared in the land and the sea on account of what the hands of men have wrought”, he (a.s.) said: ‘By Allah (azwj), that was when the ‘Al-Ansar’ (Helpers) said, ‘from us should be an Emir (commander), and from you should be an Emir’ (referring to Saqifa)."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح على الظاهر</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5 / 130)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 14704,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:8:1:8:4",
        "text": [
          "14468-  وَ عَنْهُ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنِ ابْنِ مُسْكَانَ عَنْ مُيَسِّرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قُلْتُ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ لا تُفْسِدُوا فِي الْأَرْضِ بَعْدَ إِصْلاحِها قَالَ فَقَالَ يَا مُيَسِّرُ إِنَّ الْأَرْضَ كَانَتْ فَاسِدَةً فَأَصْلَحَهَا اللَّهُ عَزَّ وَ جَلَّ بِنَبِيِّهِ ( صلى الله عليه وآله ) فَقَالَ وَ لا تُفْسِدُوا فِي الْأَرْضِ بَعْدَ إِصْلاحِها ."
        ],
        "translations": {
          "en.hubeali": [
            "<a id=\"_Toc492473113\">H 14468</a> – And from him, from Muhammad Bin Ali, from Ibn Muskan, from Muyassar has narrated:",
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-i\">I</span>t was said to Abu</span> Ja’far<sup>asws</sup> about the Statement of Allah<sup>azwj</sup> Mighty and Majestic: <span class=\"ibTxt\">“[7:56] Do no mischief on the earth, after it hath been set in order”</span>, so he<sup>asws</sup> said: ‘O Muyassar, verily the earth used to be in a state of disorder, so Allah<sup>azwj</sup> Mighty and Majestic Corrected it by His<sup>azwj</sup> Prophet<sup>saww</sup>, therefore He<sup>azwj</sup> Said:<span class=\"ibTxt\">“[7:56] Do no mischief on the earth, after it hath been set in order”</span>.",
            "out of 567"
          ],
          "en.sarwar": [
            "20. And from him, from Muhammad Bin Ali, from Ibn Muskan, from Muyassar has narrated: It was said to Abu Ja’far (a.s.) about the Statement of Allah (azwj) Mighty and Majestic: “[7:56] Do no mischief on the earth, after it hath been set in order”, so he (a.s.) said: ‘O Muyassar, verily the earth used to be in a state of disorder, so Allah (azwj) Mighty and Majestic Corrected it by His (azwj) Prophet (saww), therefore He (azwj) Said:“[7:56] Do no mischief on the earth, after it hath been set in order”."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:8:1:8",
  "kind": "verse_list"
}