{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 8"}, "path": "/books/al-kafi:8", "titles": {"ar": "الجزء الثامن‏", "en": "Volume Eight"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:8:1", "titles": {"ar": "&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1585;&#1617;&#1614;&#1608;&#1618;&#1590;&#1614;&#1577;&#1616;", "en": "The Book - Garden (of Flowers)"}}, {"indexed_titles": {"en": "Chapter 9"}, "path": "/books/al-kafi:8:1:9", "titles": {"ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )", "en": "SERMON OF AMIR-UL-MOMINEEN<sup>asws</sup>"}}], "index": 2270, "local_index": 9, "part_type": "Chapter", "path": "/books/al-kafi:8:1:9", "titles": {"ar": "خُطْبَةٌ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )", "en": "SERMON OF AMIR-UL-MOMINEEN<sup>asws</sup>"}, "verse_count": 1, "verse_start_index": 14693, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 14694, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:8:1:9:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-digits\">14469</span>- عَلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ بْنِ عُثْمَانَ عَنْ سُلَيْمِ بْنِ قَيْسٍ الْهِلَالِيِّ قَالَ خَطَبَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ ثُمَّ صَلَّى عَلَى النَّبِيِّ ( صلى الله عليه وآله ) ثُمَّ قَالَ أَلَا إِنَّ أَخْوَفَ مَا أَخَافُ عَلَيْكُمْ خَلَّتَانِ اتِّبَاعُ الْهَوَى وَ طُولُ الْأَمَلِ أَمَّا اتِّبَاعُ الْهَوَى فَيَصُدُّ عَنِ الْحَقِّ وَ أَمَّا طُولُ الْأَمَلِ فَيُنْسِي الْآخِرَةَ ", "أَلَا إِنَّ الدُّنْيَا قَدْ تَرَحَّلَتْ مُدْبِرَةً وَ إِنَّ الْآخِرَةَ قَدْ تَرَحَّلَتْ مُقْبِلَةً وَ لِكُلِّ وَاحِدَةٍ بَنُونَ فَكُونُوا مِنْ أَبْنَاءِ الْآخِرَةِ وَ لَا تَكُونُوا مِنْ أَبْنَاءِ الدُّنْيَا فَإِنَّ الْيَوْمَ عَمَلٌ وَ لَا حِسَابَ وَ إِنَّ غَداً حِسَابٌ وَ لَا عَمَلَ وَ إِنَّمَا بَدْءُ وُقُوعِ الْفِتَنِ مِنْ أَهْوَاءٍ تُتَّبَعُ وَ أَحْكَامٍ تُبْتَدَعُ يُخَالَفُ فِيهَا حُكْمُ اللَّهِ يَتَوَلَّى فِيهَا رِجَالٌ رِجَالًا ", "أَلَا إِنَّ الْحَقَّ لَوْ خَلَصَ لَمْ يَكُنِ اخْتِلَافٌ وَ لَوْ أَنَّ الْبَاطِلَ خَلَصَ لَمْ يُخَفْ عَلَى ذِي حِجًى لَكِنَّهُ يُؤْخَذُ مِنْ هَذَا ضِغْثٌ وَ مِنْ هَذَا ضِغْثٌ فَيُمْزَجَانِ فَيُجَلَّلَانِ مَعاً فَهُنَالِكَ يَسْتَوْلِي الشَّيْطَانُ عَلَى أَوْلِيَائِهِ وَ نَجَا الَّذِينَ سَبَقَتْ لَهُمْ مِنَ اللَّهِ الْحُسْنَى", "إِنِّي سَمِعْتُ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) يَقُولُ كَيْفَ أَنْتُمْ إِذَا لَبَسَتْكُمْ فِتْنَةٌ يَرْبُو فِيهَا الصَّغِيرُ وَ يَهْرَمُ فِيهَا الْكَبِيرُ يَجْرِي النَّاسُ عَلَيْهَا وَ يَتَّخِذُونَهَا سُنَّةً فَإِذَا غُيِّرَ مِنْهَا شَيْ‏ءٌ قِيلَ قَدْ غُيِّرَتِ السُّنَّةُ وَ قَدْ أَتَى النَّاسُ مُنْكَراً ثُمَّ تَشْتَدُّ الْبَلِيَّةُ وَ تُسْبَى الذُّرِّيَّةُ وَ تَدُقُّهُمُ الْفِتْنَةُ كَمَا تَدُقُّ النَّارُ الْحَطَبَ وَ كَمَا تَدُقُّ الرَّحَى بِثِفَالِهَا وَ يَتَفَقَّهُونَ لِغَيْرِ اللَّهِ وَ يَتَعَلَّمُونَ لِغَيْرِ الْعَمَلِ وَ يَطْلُبُونَ الدُّنْيَا بِأَعْمَالِ الْآخِرَةِ ", "ثُمَّ أَقْبَلَ بِوَجْهِهِ وَ حَوْلَهُ نَاسٌ مِنْ أَهْلِ بَيْتِهِ وَ خَاصَّتِهِ وَ شِيعَتِهِ فَقَالَ قَدْ عَمِلَتِ الْوُلَاةُ قَبْلِي أَعْمَالًا خَالَفُوا فِيهَا رَسُولَ اللَّهِ ( صلى الله عليه وآله ) مُتَعَمِّدِينَ لِخِلَافِهِ نَاقِضِينَ لِعَهْدِهِ مُغَيِّرِينِ لِسُنَّتِهِ وَ لَوْ حَمَلْتُ النَّاسَ عَلَى تَرْكِهَا وَ حَوَّلْتُهَا إِلَى مَوَاضِعِهَا وَ إِلَى مَا كَانَتْ فِي عَهْدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) لَتَفَرَّقَ عَنِّي جُنْدِي حَتَّى أَبْقَى وَحْدِي أَوْ قَلِيلٌ مِنْ شِيعَتِيَ الَّذِينَ عَرَفُوا فَضْلِي ", "وَ فَرْضَ إِمَامَتِي مِنْ كِتَابِ اللَّهِ عَزَّ وَ جَلَّ وَ سُنَّةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) أَ رَأَيْتُمْ لَوْ أَمَرْتُ بِمَقَامِ إِبْرَاهِيمَ ( عليه السلام ) فَرَدَدْتُهُ إِلَى الْمَوْضِعِ الَّذِي وَضَعَهُ فِيهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ رَدَدْتُ فَدَكاً إِلَى وَرَثَةِ فَاطِمَةَ ( عليها السلام ) وَ رَدَدْتُ صَاعَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) كَمَا كَانَ وَ أَمْضَيْتُ قَطَائِعَ أَقْطَعَهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِأَقْوَامٍ لَمْ تُمْضَ لَهُمْ وَ لَمْ تُنْفَذْ", "وَ رَدَدْتُ دَارَ جَعْفَرٍ إِلَى وَرَثَتِهِ وَ هَدَمْتُهَا مِنَ الْمَسْجِدِ وَ رَدَدْتُ قَضَايَا مِنَ الْجَوْرِ قُضِيَ بِهَا وَ نَزَعْتُ نِسَاءً تَحْتَ رِجَالٍ بِغَيْرِ حَقٍّ فَرَدَدْتُهُنَّ إِلَى أَزْوَاجِهِنَّ وَ اسْتَقْبَلْتُ بِهِنَّ الْحُكْمَ فِي الْفُرُوجِ وَ الْأَحْكَامِ وَ سَبَيْتُ ذَرَارِيَّ بَنِي تَغْلِبَ وَ رَدَدْتُ مَا قُسِمَ مِنْ أَرْضِ خَيْبَرَ وَ مَحَوْتُ دَوَاوِينَ الْعَطَايَا وَ أَعْطَيْتُ كَمَا كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يُعْطِي بِالسَّوِيَّةِ وَ لَمْ أَجْعَلْهَا دُولَةً بَيْنَ الْأَغْنِيَاءِ وَ أَلْقَيْتُ الْمَسَاحَةَ وَ سَوَّيْتُ بَيْنَ الْمَنَاكِحِ وَ أَنْفَذْتُ خُمُسَ الرَّسُولِ كَمَا أَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ وَ فَرَضَهُ ", "وَ رَدَدْتُ مَسْجِدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) إِلَى مَا كَانَ عَلَيْهِ وَ سَدَدْتُ مَا فُتِحَ فِيهِ مِنَ الْأَبْوَابِ وَ فَتَحْتُ مَا سُدَّ مِنْهُ وَ حَرَّمْتُ الْمَسْحَ عَلَى الْخُفَّيْنِ وَ حَدَدْتُ عَلَى النَّبِيذِ وَ أَمَرْتُ بِإِحْلَالِ الْمُتْعَتَيْنِ وَ أَمَرْتُ بِالتَّكْبِيرِ عَلَى الْجَنَائِزِ خَمْسَ تَكْبِيرَاتٍ وَ أَلْزَمْتُ النَّاسَ الْجَهْرَ بِبِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ وَ أَخْرَجْتُ مَنْ أُدْخِلَ مَعَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فِي مَسْجِدِهِ مِمَّنْ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَخْرَجَهُ وَ أَدْخَلْتُ مَنْ أُخْرِجَ بَعْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مِمَّنْ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَدْخَلَهُ ", "وَ حَمَلْتُ النَّاسَ عَلَى حُكْمِ الْقُرْآنِ وَ عَلَى الطَّلَاقِ عَلَى السُّنَّةِ وَ أَخَذْتُ الصَّدَقَاتِ عَلَى أَصْنَافِهَا وَ حُدُودِهَا وَ رَدَدْتُ الْوُضُوءَ وَ الْغُسْلَ وَ الصَّلَاةَ إِلَى مَوَاقِيتِهَا وَ شَرَائِعِهَا وَ مَوَاضِعِهَا وَ رَدَدْتُ أَهْلَ نَجْرَانَ إِلَى مَوَاضِعِهِمْ وَ رَدَدْتُ سَبَايَا فَارِسَ وَ سَائِرِ الْأُمَمِ إِلَى كِتَابِ اللَّهِ وَ سُنَّةِ نَبِيِّهِ ( صلى الله عليه وآله ) ", "إِذاً لَتَفَرَّقُوا عَنِّي وَ اللَّهِ لَقَدْ أَمَرْتُ النَّاسَ أَنْ لَا يَجْتَمِعُوا فِي شَهْرِ رَمَضَانَ إِلَّا فِي فَرِيضَةٍ وَ أَعْلَمْتُهُمْ أَنَّ اجْتِمَاعَهُمْ فِي النَّوَافِلِ بِدْعَةٌ فَتَنَادَى بَعْضُ أَهْلِ عَسْكَرِي مِمَّنْ يُقَاتِلُ مَعِي يَا أَهْلَ الْإِسْلَامِ غُيِّرَتْ سُنَّةُ عُمَرَ يَنْهَانَا عَنِ الصَّلَاةِ فِي شَهْرِ رَمَضَانَ تَطَوُّعاً وَ لَقَدْ خِفْتُ أَنْ يَثُورُوا فِي نَاحِيَةِ جَانِبِ عَسْكَرِي", "مَا لَقِيتُ مِنْ هَذِهِ الْأُمَّةِ مِنَ الْفُرْقَةِ وَ طَاعَةِ أَئِمَّةِ الضَّلَالَةِ وَ الدُّعَاةِ إِلَى النَّارِ وَ أَعْطَيْتُ مِنْ ذَلِكَ سَهْمَ ذِي الْقُرْبَى الَّذِي قَالَ اللَّهُ عَزَّ وَ جَلَّ إِنْ كُنْتُمْ آمَنْتُمْ بِاللَّهِ وَ ما أَنْزَلْنا عَلى عَبْدِنا يَوْمَ الْفُرْقانِ يَوْمَ الْتَقَى الْجَمْعانِ فَنَحْنُ وَ اللَّهِ عَنَى بِذِي الْقُرْبَى الَّذِي قَرَنَنَا اللَّهُ بِنَفْسِهِ وَ بِرَسُولِهِ ( صلى الله عليه وآله ) فَقَالَ تَعَالَى فَلِلَّهِ وَ لِلرَّسُولِ وَ لِذِي الْقُرْبى وَ الْيَتامى وَ الْمَساكِينِ وَ ابْنِ السَّبِيلِ فِينَا خَاصَّةً كَيْ لا يَكُونَ دُولَةً بَيْنَ الْأَغْنِياءِ مِنْكُمْ وَ ما آتاكُمُ الرَّسُولُ فَخُذُوهُ وَ ما نَهاكُمْ عَنْهُ فَانْتَهُوا وَ اتَّقُوا اللَّهَ فِي ظُلْمِ آلِ مُحَمَّدٍ إِنَّ اللَّهَ شَدِيدُ الْعِقابِ لِمَنْ ظَلَمَهُمْ رَحْمَةً مِنْهُ لَنَا وَ غِنًى أَغْنَانَا اللَّهُ بِهِ ", "وَ وَصَّى بِهِ نَبِيَّهُ ( صلى الله عليه وآله ) وَ لَمْ يَجْعَلْ لَنَا فِي سَهْمِ الصَّدَقَةِ نَصِيباً أَكْرَمَ اللَّهُ رَسُولَهُ ( صلى الله عليه وآله ) وَ أَكْرَمَنَا أَهْلَ الْبَيْتِ أَنْ يُطْعِمَنَا مِنْ أَوْسَاخِ النَّاسِ ", "فَكَذَّبُوا اللَّهَ وَ كَذَّبُوا رَسُولَهُ وَ جَحَدُوا كِتَابَ اللَّهِ النَّاطِقَ بِحَقِّنَا وَ مَنَعُونَا فَرْضاً فَرَضَهُ اللَّهُ لَنَا مَا لَقِيَ أَهْلُ بَيْتِ نَبِيٍّ مِنْ أُمَّتِهِ مَا لَقِينَا بَعْدَ نَبِيِّنَا ( صلى الله عليه وآله ) وَ اللَّهُ الْمُسْتَعَانُ عَلَى مَنْ ظَلَمَنَا وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ ."], "translations": {"en.hubeali": ["<a id=\"_Toc492473115\">H 14469</a> – Ali Bin Ibrahim, from his father, from Hamaad Bin Isa, from Ibrahim Bin Usman, from Sulaym Bin Qays Al-Hilaly who said:", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">‘A</span>mir-ul-Momineen</span><sup>asws</sup> preached, so he<sup>asws</sup> Praised Allah<sup>azwj</sup> and Extolled Him<sup>azwj</sup>, then sent greetings of peace ‘Salam’ upon the Prophet<sup>saww</sup>, then said: ‘Indeed! From the fears what I<sup>asws</sup> fear for you are two categories – following of desires and long hopes. As for the following of desires, so it will sway you away from the truth, and as for the long hopes, so they will make you forget the Hereafter.", "Indeed! The world has moved backwards (away from you) and that the Hereafter has moved forward (towards you), and for each of these are sons. So become from the sons of the Hereafter and do not become from the sons of the world, for today is the day of the deeds and there is no Reckoning, but tomorrow is the (day of) Reckoning and no (room to perform) deeds. ", "However, the commencement of the strife ‘Fitna’ occurs from the following of desires, and (the man made) rules are followed in opposition to the Commands of Allah<sup>azwj</sup>, so that a man would rule over a man (using these rules).", "Indeed! Surely the truth, had it been pure, there would have been no differing, and had the falsehood been pure, there would have been no fear about the one with the proof, but they take a fistful from this and a fistful from this, so they are mixed together. So that is where the Satan<sup>la</sup> rules over his<sup>la</sup> friends, and the ones for whom goodness has preceded from Allah<sup>azwj</sup> escape from this.", "I<sup>asws</sup> heard the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> saying: ‘How will your condition be when you are clothed in ‘Fitna’ (strife) in which the young ones will grow older while the adults would become elderly. The people will flow towards it (fitna) and take it as a Sunnah. So if something is altered therein, they will say, ‘The Sunnah has been altered’, and the people would have become deniers. Then the affliction would intensify, and the offspring would become captivated and the ‘Fitna’ (strife) would consume them just as the fire consumes the firewood, or just as the millstone grinds upon its lower base. And they would learn the Laws for the sake of other than Allah<sup>azwj</sup>, and they would learn for the sake of other than doing good deeds, and they will be coveting the world instead of working for the Hereafter.", "Then he<sup>asws</sup> turned his<sup>asws</sup> face towards those from his<sup>asws</sup> family and his<sup>asws</sup> special ones and his<sup>asws</sup> Shiites who were around him<sup>asws</sup>, so he<sup>asws</sup> said: ‘The rulers before me<sup>asws</sup> acted in opposition to the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> deliberately breaching the Covenant with him<sup>saww</sup> and altering his<sup>saww</sup> Sunnah. ", "And if I<sup>asws</sup> had burdened the people on avoiding it, and turned it back to its place and to what is used to be in the era of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>, my<sup>asws</sup> army would disperse from me<sup>asws</sup> to the extent that there would remain only myself<sup>asws</sup> or a few from my<sup>asws</sup> Shiites who recognise my<sup>asws</sup> ‘Fazilat’ (virtues). ", "And my<sup>asws</sup> Imamate has been Obligated from the Book of Allah<sup>azwj</sup> Mighty and Majestic, and the Sunnah of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>. Consider (what would happen) if I<sup>asws</sup> were to order for the <span class=\"iTxt\">Maqaam e Ibrahim</span><sup>as</sup> to be returned to its place where it was placed by the Messenger<sup>saww</sup> of Allah<sup>azwj</sup>, and returned the (plantation of) <span class=\"iTxt\">Fadak</span> to the inheritors of Fatima<sup>asws</sup>, and returned to the ‘Sa’a’ (unit of measurement) to just as it was before, and execute the treaties which were made by the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> for the people, which were never executed nor were those ever established, ", "And return the house of Ja’far<sup>as</sup> to his<sup>as</sup> inheritors, and demolish it from the Masjid, and rescind the inequitable Judgements which were judged and remove the women who are under (married to) certain men without right and return them back to their husbands, and issue the order regarding the matrimony, and the orders regarding the captives of the Clan of Taghlub, and return what was distributed from the land of Khyber, and erase the register of gifts and give it out as the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> used to give it out in an equitable manner and not make it to be distributed between the rich, and drop <span class=\"iTxt\">Al-Musahaat</span> (currency), and equalise between the marriages, and enforce the <span class=\"iTxt\">Khums</span> of the Messenger<sup>saww</sup> just as it had been Commanded by Allah<sup>azwj</sup> Mighty and Majestic and make it to be obligatory, ", "And return the Masjid of the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> to what it used to be, and shut what was in it from the doors, and open what has been closed in it, and prohibit the wiping (Masaah) upon the socks, and enforce the punishment upon the partaking of <span class=\"iTxt\">Al-Nabeedh</span> (intoxicant), and make the two <span class=\"iTxt\">Mu’tah’s</span> to be permissible, and order for the <span class=\"iTxt\">Takbeer</span> over the dead body as five <span class=\"iTxt\">Takbeers</span>, and necessitate the people to recite ‘In the Name of Allah<sup>azwj</sup> the Beneficent the Merciful’ aloud (in the Prayer), and throw out the one who has been included with the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> in his<sup>saww</sup> Masjid the one whom the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> had thrown out, and enter the one who had been thrown out after the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> whom the Messenger<sup>saww</sup> of Allah<sup>azwj</sup> had included, ", "And burden the people to the Commands of the Quran and upon the divorce to be in accordance with the Sunnah, and take the charities upon its types and its limits, and return the ablution and the (major) ablution and the Prayer to its prescribed times, and its laws and its places, and return the people of Najraan to their own places, and return the Persian captives, and the rest of the community to the Book of Allah<sup>azwj</sup> and the Sunnah of its Prophet<sup>saww</sup>.", "By Allah<sup>azwj</sup>, they would disperse from me<sup>asws</sup> if I<sup>asws</sup> were to order the people not to gather in the Month of Ramadhan except for the obligatory (Prayers) and make it known to them that their gathering for the optional Prayers (Nawaafil) is an innovation. So some of the people in my<sup>asws</sup> army would call out to the ones who are fighting alongside me<sup>asws</sup>, ‘O people of Al-Islam! The Sunnah of Umar has been changed. He<sup>asws</sup> is preventing us from the optional Prayer in the Month of Ramadhan, and I<sup>asws</sup> had feared that there would be a revolt in a section of my<sup>asws</sup> army.  ", "What will be meted out from this community from the sectarianism and the obedience to the imams of the misguidance and their calling to the Fire if I<sup>asws</sup> were to give out from that the share of the near relatives about which Allah<sup>azwj</sup> Mighty and Majestic has Said: <span class=\"ibTxt\">“[8:41] if you believe in Allah and in that which We revealed to Our servant, on the day of distinction, the day on which the two parties met”</span>. So we<sup>asws</sup> are the ones Meant by the near relatives whom Allah<sup>azwj</sup> has Joined with Himself<sup>azwj</sup> and with His<sup>azwj</sup> Messenger<sup>saww</sup>. So the High Said: <span class=\"ibTxt\">“[59:7] it is for Allah and for the Messenger, and for the near of kin and the orphans and the needy and the wayfarer, so that it may not be a thing taken by turns among the rich of you, and whatever the Messenger gives you, accept it, and from whatever he forbids you, keep back and be careful of Allah </span>(of being unjust to the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>)<span class=\"ibTxt\">; surely Allah is severe in retributing (evil)”</span> to the one who is unjust to them<sup>asws</sup>. (This is) a Mercy from Him<sup>azwj</sup> to us<sup>asws</sup> and a self-sufficiency by which Allah<sup>azwj</sup> has Made us<sup>asws</sup> to be self-sufficient with.", "And He<sup>azwj</sup> Bequeathed for it to His<sup>azwj</sup> Prophet<sup>saww</sup> and did not Make for us<sup>asws</sup> a share in the charity. Allah<sup>azwj</sup> Honoured His<sup>azwj</sup> Messenger<sup>saww</sup> and Honoured us<sup>asws</sup> the People<sup>asws</sup> of the Household, that He<sup>azwj</sup> should Feed us<sup>asws</sup> from the dirt of the people (charity). ", "They belied Allah<sup>azwj</sup>, and belied His<sup>azwj</sup> Messenger<sup>saww</sup> and fought against the Book of Allah<sup>azwj</sup> which Speaks of our<sup>asws</sup> rights, and prevented from us<sup>asws</sup> the obligation which Allah<sup>azwj</sup> has Obligated for us<sup>asws</sup>. What has been meted out to us<sup>asws</sup> after our<sup>asws</sup> Prophet<sup>saww</sup>, and Allah<sup>azwj</sup> is the Helper against the one who is unjust to us<sup>asws</sup>, and there is no Might and no Power except by Allah<sup>azwj</sup> the High, the Magnificent’."]}}]}, "index": "al-kafi:8:1:9", "kind": "verse_list"}