{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:6:2", "titles": {"ar": "كتاب الطلاق ", "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "}}, {"indexed_titles": {"en": "Chapter 18"}, "path": "/books/al-kafi:6:2:18", "titles": {"ar": "باب مَا يَهْدِمُ الطَّلَاقَ وَ مَا لَا يَهْدِمُ", "en": "Chapter 18 – What demolishes the divorce and what does not demolish"}}], "index": 1612, "local_index": 18, "part_type": "Chapter", "path": "/books/al-kafi:6:2:18", "titles": {"ar": "باب مَا يَهْدِمُ الطَّلَاقَ وَ مَا لَا يَهْدِمُ", "en": "Chapter 18 – What demolishes the divorce and what does not demolish"}, "verse_count": 4, "verse_start_index": 10604, "verses": [{"index": 10605, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:2:18:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ شُعَيْبٍ الْحَدَّادِ عَنْ مُعَلَّى بْنِ خُنَيْسٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ طَلَّقَ امْرَأَتَهُ ثُمَّ لَمْ يُرَاجِعْهَا حَتَّى حَاضَتْ ثَلَاثَ حِيَضٍ ثُمَّ تَزَوَّجَهَا ثُمَّ طَلَّقَهَا فَتَرَكَهَا حَتَّى حَاضَتْ ثَلَاثَ حِيَضٍ مِنْ غَيْرِ أَنْ يُرَاجِعَهَا يَعْنِي يَمَسَّهَا قَالَ لَهُ أَنْ يَتَزَوَّجَهَا أَبَداً مَا لَمْ يُرَاجِعْ وَ يَمَسَّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdullah Bin Al Mugheira, from Shuayb Al Hadda, from Moala Bin Khunays, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who divorced his wife, then did not revert back to her until she menstruated with three menstruation. Then he married her, then divorced her. So he left her until she menstruated with three menstruations from without him reverting back to her, meaning touching her’. He<sup>asws</sup> said: ‘For him is that he can marry her forever for as long as he does not revert back to her and touches’."}]}, {"index": 10606, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:2:18:2", "text": "حُمَيْدُ بْنُ زِيَادٍ عَنْ عُبَيْدِ اللَّهِ بْنِ أَحْمَدَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ شُعَيْبٍ الْحَدَّادِ عَنِ الْمُعَلَّى بْنِ خُنَيْسٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ طَلَّقَ امْرَأَتَهُ ثُمَّ لَمْ يُرَاجِعْهَا حَتَّى حَاضَتْ ثَلَاثَ حِيَضٍ ثُمَّ تَزَوَّجَهَا ثُمَّ طَلَّقَهَا فَتَرَكَهَا حَتَّى حَاضَتْ ثَلَاثَ حِيَضٍ ثُمَّ تَزَوَّجَهَا ثُمَّ طَلَّقَهَا مِنْ غَيْرِ أَنْ يُرَاجِعَهَا ثُمَّ تَرَكَهَا حَتَّى حَاضَتْ ثَلَاثَ حِيَضٍ قَالَ لَهُ أَنْ يَتَزَوَّجَهَا أَبَداً مَا لَمْ يُرَاجِعْ وَ يَمَسَّ \nوَ كَانَ ابْنُ بُكَيْرٍ وَ أَصْحَابُهُ يَقُولُونَ هَذَا فَأَخْبَرَنِي عَبْدُ اللَّهِ بْنُ الْمُغِيرَةِ قَالَ قُلْتُ لَهُ مِنْ أَيْنَ قُلْتَ هَذَا قَالَ قُلْتُهُ مِنْ قِبَلِ رِوَايَةِ رِفَاعَةَ رَوَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ يَهْدِمُ مَا مَضَى قَالَ قُلْتُ لَهُ فَإِنَّ رِفَاعَةَ إِنَّمَا قَالَ طَلَّقَهَا ثُمَّ تَزَوَّجَهَا رَجُلٌ ثُمَّ طَلَّقَهَا ثُمَّ تَزَوَّجَهَا الْأَوَّلُ إِنَّ ذَلِكَ يَهْدِمُ الطَّلَاقَ الْأَوَّلَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Humeyd Bin Ziyad, from Ubeydullah Bin Ahmad, from Ibn Abu Umeyr, from Abdullah Bin Al Mugheira, from Shuayb Al Haddad, from Al Moala Bin Khunays, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who divorced his wife, then did not revert to her until she menstruated three menstruation. Then he married her, then divorced her. So he left her until she menstruation three menstruation, then married her, then divorced her without reverting back to her. Then he left her until she menstruation three menstruations. He<sup>asws</sup> said: ‘For him is that he can marry her forever for as long as he does not revert and touches’. \nAnd Ibn Bukeyr and his companions were saying, this is what Abdullah Bin Al-Mugheira informed me saying, ‘I said to him, ‘From where do you say this?’ He said, ‘I say it from a report which Rafa’at reported from Abu Abdullah<sup>asws</sup> that it demolishes whatever is past. I said to him, ‘So if Rafa’at, rather said, ‘He divorced her, then a (another) man married her. Then he divorced her, then the first one married her. That demolished the first divorce’."}]}, {"index": 10607, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:6:2:18:3", "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ مُحَمَّدِ بْنِ زِيَادٍ وَ صَفْوَانَ عَنْ رِفَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ طَلَّقَ امْرَأَتَهُ حَتَّى بَانَتْ مِنْهُ وَ انْقَضَتْ عِدَّتُهَا ثُمَّ تَزَوَّجَتْ زَوْجاً آخَرَ فَطَلَّقَهَا أَيْضاً ثُمَّ تَزَوَّجَهَا زَوْجُهَا الْأَوَّلُ أَ يَهْدِمُ ذَلِكَ الطَّلَاقَ الْأَوَّلَ قَالَ نَعَمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Humeyd Bin Ziyad, from Ibn Sama’at, from Muhammad Bin Ziyad and Safwan, from Rafa’at, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who divorces his wife until she becomes irrevocably divorced from him, and fulfils her waiting period. Then she marries another husband, so he divorces her as well. Then she marries her first husband. Does that demolish the first divorce?’ He<sup>asws</sup> said; ‘Yes’."}]}, {"index": 10608, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:6:2:18:4", "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ مُعَاوِيَةَ بْنِ حُكَيْمٍ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ بُكَيْرٍ عَنْ رَجُلٍ طَلَّقَ امْرَأَتَهُ وَاحِدَةً ثُمَّ تَرَكَهَا حَتَّى بَانَتْ مِنْهُ ثُمَّ تَزَوَّجَهَا قَالَ هِيَ مَعَهُ كَمَا كَانَتْ فِي التَّزْوِيجِ قَالَ قُلْتُ لَهُ فَإِنَّ رِوَايَةَ رِفَاعَةَ إِذَا كَانَ بَيْنَهُمَا زَوْجٌ فَقَالَ لِي عَبْدُ اللَّهِ هَذَا زَوْجٌ وَ هَذَا مِمَّا رَزَقَ اللَّهُ مِنَ الرَّأْيِ وَ مَتَى مَا طَلَّقَهَا وَاحِدَةً فَبَانَتْ مِنْهُ ثُمَّ تَزَوَّجَهَا زَوْجٌ آخَرُ ثُمَّ طَلَّقَهَا زَوْجُهَا فَتَزَوَّجَهَا الْأَوَّلُ فَهِيَ عِنْدَهُ مُسْتَقْبِلَةٌ كَمَا كَانَتْ \nقَالَ فَقُلْتُ لِعَبْدِ اللَّهِ هَذَا بِرِوَايَةِ مَنْ فَقَالَ هَذَا مِمَّا رَزَقَ اللَّهُ قَالَ مُعَاوِيَةُ بْنُ حُكَيْمٍ رَوَى أَصْحَابُنَا عَنْ رِفَاعَةَ بْنِ مُوسَى أَنَّ الزَّوْجَ يَهْدِمُ الطَّلَاقَ الْأَوَّلَ فَإِنْ تَزَوَّجَهَا فَهِيَ عِنْدَهُ مُسْتَقْبِلَةٌ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَهْدِمُ الثَّلَاثَ وَ لَا يَهْدِمُ الْوَاحِدَةَ وَ الثِّنْتَيْنِ .\nوَ رِوَايَةُ رِفَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) هُوَ الَّذِي احْتَجَّ بِهِ ابْنُ بُكَيْرٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Abu Abdullah, from Muawiya Bin Hukeym, from Abdullah Bin Al Mugheira who said, \n‘I asked Abdullah Bin Bukeyr about a man who divorces his wife once, then leaves her until she irrevocably divorced from him. Then he re-marries her. He said, ‘She is with him as she was regarding the marriage’. I said to him, So in the report of Rafa’at is, ‘When there is a husband between the two’. So Abdullah said to me, ‘This is a husband, and this is from what Allah<sup>azwj</sup> has Granted from the opinion, and when he divorces her once, so she becomes irrevocably divorced from him, then she marries another husband. Then her husband divorces her, so she marries her former husband, so she would be with him accepted as she used to be’. \nHe (the narrator) said, ‘So I said to Abdullah, ‘With whose report is this, ‘So he said, ‘This is from what Allah<sup>azwj</sup> has Granted’?’ He said, ‘Muawiya Bin Hukeym reported, from our companions, from Rafa’at Bin Musa that the husband demolishes the first divorce. So if he were to marry her, so she would be with him, acceptable’. So Abu Abdullah<sup>asws</sup> said: ‘The third (divorce) demolishes, and the first and the second do not’. \nAnd in a report of Rafa’at, from Abu Abdullah<sup>asws</sup>, it is that which Ibn Bukeyr argues by’."}]}]}, "index": "al-kafi:6:2:18", "kind": "verse_list"}