{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:6:2",
        "titles": {
          "ar": "كتاب الطلاق ",
          "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:6:2:18",
        "titles": {
          "ar": "باب مَا يَهْدِمُ الطَّلَاقَ وَ مَا لَا يَهْدِمُ",
          "en": "Chapter 18 – What demolishes the divorce and what does not demolish"
        }
      }
    ],
    "index": 1619,
    "local_index": 18,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 19"
        },
        "path": "/books/al-kafi:6:2:19",
        "titles": {
          "ar": "باب الْغَائِبِ يَقْدَمُ مِنْ غَيْبَتِهِ فَيُطَلِّقُ عِنْدَ ذَلِكَ أَنَّهُ لَا يَقَعُ الطَّلَاقُ حَتَّى تَحِيضَ وَ تَطْهُرَ",
          "en": "Chapter 19 – The absentee comes back from his absence, so he divorces during that, so that divorce does not occur until she menstruates and is pure"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 17"
        },
        "path": "/books/al-kafi:6:2:17",
        "titles": {
          "ar": "باب الَّتِي لَا تَحِلُّ لِزَوْجِهَا حَتَّى تَنْكِحَ زَوْجاً غَيْرَهُ",
          "en": "Chapter 17 – (That) which does not make her to be Permissible for her husband unless she married another husband"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:6:2",
        "titles": {
          "ar": "كتاب الطلاق ",
          "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:2:18",
    "titles": {
      "ar": "باب مَا يَهْدِمُ الطَّلَاقَ وَ مَا لَا يَهْدِمُ",
      "en": "Chapter 18 – What demolishes the divorce and what does not demolish"
    },
    "verse_count": 4,
    "verse_start_index": 10614,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/130)"
        ],
        "index": 10615,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/206",
              "text": "عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/753",
              "text": "شُعَيْبٍ الْحَدَّادِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1861",
              "text": "مُعَلَّى بْنِ خُنَيْسٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4774",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ طَلَّقَ امْرَأَتَهُ ثُمَّ لَمْ يُرَاجِعْهَا حَتَّى حَاضَتْ ثَلَاثَ حِيَضٍ ثُمَّ تَزَوَّجَهَا ثُمَّ طَلَّقَهَا فَتَرَكَهَا حَتَّى حَاضَتْ ثَلَاثَ حِيَضٍ مِنْ غَيْرِ أَنْ يُرَاجِعَهَا يَعْنِي يَمَسَّهَا"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ شُعَيْبٍ الْحَدَّادِ عَنْ مُعَلَّى بْنِ خُنَيْسٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ طَلَّقَ امْرَأَتَهُ ثُمَّ لَمْ يُرَاجِعْهَا حَتَّى حَاضَتْ ثَلَاثَ حِيَضٍ ثُمَّ تَزَوَّجَهَا ثُمَّ طَلَّقَهَا فَتَرَكَهَا حَتَّى حَاضَتْ ثَلَاثَ حِيَضٍ مِنْ غَيْرِ أَنْ يُرَاجِعَهَا يَعْنِي يَمَسَّهَا قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:18:1",
        "text": [
          " لَهُ أَنْ يَتَزَوَّجَهَا أَبَداً مَا لَمْ يُرَاجِعْ وَ يَمَسَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdullah Bin Al Mugheira, from Shuayb Al Hadda, from Moala Bin Khunays, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who divorced his wife, then did not revert back to her until she menstruated with three menstruation. Then he married her, then divorced her. So he left her until she menstruated with three menstruations from without him reverting back to her, meaning touching her’. He<sup>asws</sup> said: ‘For him is that he can marry her forever for as long as he does not revert back to her and touches’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘ Abd af-Malik ibn al-Mughirah from Shu’ayb al-Haddad from Mu ‘alia’ ibn al-Khunays who has said the following: “There is a man who divorces his wife and does not go back to her until three Hayd (menses) are complete, then marries her then divorces her and leaves until three Hayd (menses) are complete and does not go back to her to touch her. Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘He can marry forever as long as he does not go back to her to touch”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/130)"
        ],
        "index": 10616,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1565",
              "text": "حُمَيْدُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4374",
              "text": "عُبَيْدِ اللَّهِ بْنِ أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/206",
              "text": "عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/753",
              "text": "شُعَيْبٍ الْحَدَّادِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/319",
              "text": "الْمُعَلَّى بْنِ خُنَيْسٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4775",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ طَلَّقَ امْرَأَتَهُ ثُمَّ لَمْ يُرَاجِعْهَا حَتَّى حَاضَتْ ثَلَاثَ حِيَضٍ ثُمَّ تَزَوَّجَهَا ثُمَّ طَلَّقَهَا فَتَرَكَهَا حَتَّى حَاضَتْ ثَلَاثَ حِيَضٍ ثُمَّ تَزَوَّجَهَا ثُمَّ طَلَّقَهَا مِنْ غَيْرِ أَنْ يُرَاجِعَهَا ثُمَّ تَرَكَهَا حَتَّى حَاضَتْ ثَلَاثَ حِيَضٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "حُمَيْدُ بْنُ زِيَادٍ عَنْ عُبَيْدِ اللَّهِ بْنِ أَحْمَدَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ شُعَيْبٍ الْحَدَّادِ عَنِ الْمُعَلَّى بْنِ خُنَيْسٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ طَلَّقَ امْرَأَتَهُ ثُمَّ لَمْ يُرَاجِعْهَا حَتَّى حَاضَتْ ثَلَاثَ حِيَضٍ ثُمَّ تَزَوَّجَهَا ثُمَّ طَلَّقَهَا فَتَرَكَهَا حَتَّى حَاضَتْ ثَلَاثَ حِيَضٍ ثُمَّ تَزَوَّجَهَا ثُمَّ طَلَّقَهَا مِنْ غَيْرِ أَنْ يُرَاجِعَهَا ثُمَّ تَرَكَهَا حَتَّى حَاضَتْ ثَلَاثَ حِيَضٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:18:2",
        "text": [
          " لَهُ أَنْ يَتَزَوَّجَهَا أَبَداً مَا لَمْ يُرَاجِعْ وَ يَمَسَّ ",
          "وَ كَانَ ابْنُ بُكَيْرٍ وَ أَصْحَابُهُ يَقُولُونَ هَذَا فَأَخْبَرَنِي عَبْدُ اللَّهِ بْنُ الْمُغِيرَةِ قَالَ قُلْتُ لَهُ مِنْ أَيْنَ قُلْتَ هَذَا قَالَ قُلْتُهُ مِنْ قِبَلِ رِوَايَةِ رِفَاعَةَ رَوَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ يَهْدِمُ مَا مَضَى قَالَ قُلْتُ لَهُ فَإِنَّ رِفَاعَةَ إِنَّمَا قَالَ طَلَّقَهَا ثُمَّ تَزَوَّجَهَا رَجُلٌ ثُمَّ طَلَّقَهَا ثُمَّ تَزَوَّجَهَا الْأَوَّلُ إِنَّ ذَلِكَ يَهْدِمُ الطَّلَاقَ الْأَوَّلَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Ubeydullah Bin Ahmad, from Ibn Abu Umeyr, from Abdullah Bin Al Mugheira, from Shuayb Al Haddad, from Al Moala Bin Khunays, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who divorced his wife, then did not revert to her until she menstruated three menstruation. Then he married her, then divorced her. So he left her until she menstruation three menstruation, then married her, then divorced her without reverting back to her. Then he left her until she menstruation three menstruations. He<sup>asws</sup> said: ‘For him is that he can marry her forever for as long as he does not revert and touches’. ",
            "And Ibn Bukeyr and his companions were saying, this is what Abdullah Bin Al-Mugheira informed me saying, ‘I said to him, ‘From where do you say this?’ He said, ‘I say it from a report which Rafa’at reported from Abu Abdullah<sup>asws</sup> that it demolishes whatever is past. I said to him, ‘So if Rafa’at, rather said, ‘He divorced her, then a (another) man married her. Then he divorced her, then the first one married her. That demolished the first divorce’."
          ],
          "en.sarwar": [
            "2. Humayd ibn Ziyad has narrated from ‘Ubayd Allah ibn Ahmad from ibn ‘Umayr from ‘Abd Allah ibn al-Mughirah from Shu’ayb al- Hadad from Mu ‘alia’ ibn al-Khunays who has said the following: “There is a man who divorces his wife, then does not go back to her until three cycles of Hayd (menses) are complete, then divorces and leaves her until three cycles of Hayd (menses) are complete then marries her then divorces without going back to her and leaves until three cycles of Hayd (menses) are complete. Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘He can marry her forever as long as he does not go back and touch her.’ Ibn Bukayr and his companions were of this opinion and ‘Abd Allah ibn al-Mughirah narrated it to me that he asked, ‘On what basis do you say so?’ He replied, ‘I say so on the basis of Hadith narrated by Rifa‘ah who has narrated from abu ‘Abd Allah, ‘Alayhi al- Salam, that it destroys what is passed. He (the narrator) has said, that Rifa‘ah has only said, ‘He divorced, then another man married her, then divorced; then the first man married her and this destroys the first ‘Talaq’ (divorce).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/131)"
        ],
        "index": 10617,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1565",
              "text": "حُمَيْدُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1519",
              "text": "ابْنِ سَمَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/419",
              "text": "مُحَمَّدِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/749",
              "text": "صَفْوَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1334",
              "text": "رِفَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ مُحَمَّدِ بْنِ زِيَادٍ وَ صَفْوَانَ عَنْ رِفَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:18:3",
        "text": [
          " سَأَلْتُهُ عَنْ رَجُلٍ طَلَّقَ امْرَأَتَهُ حَتَّى بَانَتْ مِنْهُ وَ انْقَضَتْ عِدَّتُهَا ثُمَّ تَزَوَّجَتْ زَوْجاً آخَرَ فَطَلَّقَهَا أَيْضاً ثُمَّ تَزَوَّجَهَا زَوْجُهَا الْأَوَّلُ أَ يَهْدِمُ ذَلِكَ الطَّلَاقَ الْأَوَّلَ قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Ibn Sama’at, from Muhammad Bin Ziyad and Safwan, from Rafa’at, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who divorces his wife until she becomes irrevocably divorced from him, and fulfils her waiting period. Then she marries another husband, so he divorces her as well. Then she marries her first husband. Does that demolish the first divorce?’ He<sup>asws</sup> said; ‘Yes’."
          ],
          "en.sarwar": [
            "3. Humayd ibn Ziyad has narrated from Sama‘ah from Muhammad ibn Ziyad and Safwan from Rifa‘ah who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who divorces his wife and she becomes a stranger to him because of the expiration of her waiting period; then another man marries her who divorces her also; then she marries the first husband; if it destroys the first divorce. He (the Imam) said, ‘Yes, it destroys the first divorce.’ Ibn Sama‘ah has said that ibn Bukayr would say, ‘If a divorced woman is divorced by her husband, then leaves her until she becomes stranger to him, then marries her, she then can live with him on the basis of a new divorce. Ibn Sama‘ah has said that al-Husayn ibn Hashim has mentioned that he asked ibn Bukayr who gave this answer and he then asked, ‘Have you heard anything about it?’ He replied, ‘No, it is what Allah, most Majestic, most Glorious, has granted in the form of opinion.’ Ibn Sama‘ah has said, ‘We do not accept the words of ibn Bukayr; in fact Hadith says, ‘If there is a husband between them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق وآخره مرسل كالموثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/131)"
        ],
        "index": 10618,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/358",
              "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/929",
              "text": "مُعَاوِيَةَ بْنِ حُكَيْمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/206",
              "text": "عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ مُعَاوِيَةَ بْنِ حُكَيْمٍ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:18:4",
        "text": [
          " سَأَلْتُ عَبْدَ اللَّهِ بْنَ بُكَيْرٍ عَنْ رَجُلٍ طَلَّقَ امْرَأَتَهُ وَاحِدَةً ثُمَّ تَرَكَهَا حَتَّى بَانَتْ مِنْهُ ثُمَّ تَزَوَّجَهَا قَالَ هِيَ مَعَهُ كَمَا كَانَتْ فِي التَّزْوِيجِ قَالَ قُلْتُ لَهُ فَإِنَّ رِوَايَةَ رِفَاعَةَ إِذَا كَانَ بَيْنَهُمَا زَوْجٌ فَقَالَ لِي عَبْدُ اللَّهِ هَذَا زَوْجٌ وَ هَذَا مِمَّا رَزَقَ اللَّهُ مِنَ الرَّأْيِ وَ مَتَى مَا طَلَّقَهَا وَاحِدَةً فَبَانَتْ مِنْهُ ثُمَّ تَزَوَّجَهَا زَوْجٌ آخَرُ ثُمَّ طَلَّقَهَا زَوْجُهَا فَتَزَوَّجَهَا الْأَوَّلُ فَهِيَ عِنْدَهُ مُسْتَقْبِلَةٌ كَمَا كَانَتْ ",
          "قَالَ فَقُلْتُ لِعَبْدِ اللَّهِ هَذَا بِرِوَايَةِ مَنْ فَقَالَ هَذَا مِمَّا رَزَقَ اللَّهُ قَالَ مُعَاوِيَةُ بْنُ حُكَيْمٍ رَوَى أَصْحَابُنَا عَنْ رِفَاعَةَ بْنِ مُوسَى أَنَّ الزَّوْجَ يَهْدِمُ الطَّلَاقَ الْأَوَّلَ فَإِنْ تَزَوَّجَهَا فَهِيَ عِنْدَهُ مُسْتَقْبِلَةٌ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَهْدِمُ الثَّلَاثَ وَ لَا يَهْدِمُ الْوَاحِدَةَ وَ الثِّنْتَيْنِ .",
          "وَ رِوَايَةُ رِفَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) هُوَ الَّذِي احْتَجَّ بِهِ ابْنُ بُكَيْرٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Abu Abdullah, from Muawiya Bin Hukeym, from Abdullah Bin Al Mugheira who said, ",
            "‘I asked Abdullah Bin Bukeyr about a man who divorces his wife once, then leaves her until she irrevocably divorced from him. Then he re-marries her. He said, ‘She is with him as she was regarding the marriage’. I said to him, So in the report of Rafa’at is, ‘When there is a husband between the two’. So Abdullah said to me, ‘This is a husband, and this is from what Allah<sup>azwj</sup> has Granted from the opinion, and when he divorces her once, so she becomes irrevocably divorced from him, then she marries another husband. Then her husband divorces her, so she marries her former husband, so she would be with him accepted as she used to be’. ",
            "He (the narrator) said, ‘So I said to Abdullah, ‘With whose report is this, ‘So he said, ‘This is from what Allah<sup>azwj</sup> has Granted’?’ He said, ‘Muawiya Bin Hukeym reported, from our companions, from Rafa’at Bin Musa that the husband demolishes the first divorce. So if he were to marry her, so she would be with him, acceptable’. So Abu Abdullah<sup>asws</sup> said: ‘The third (divorce) demolishes, and the first and the second do not’. ",
            "And in a report of Rafa’at, from Abu Abdullah<sup>asws</sup>, it is that which Ibn Bukeyr argues by’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn abu ‘Abd Allah has narrated from Mu‘awiyah ibn Hakam from ‘Abd Allah ibn al-Mughirah who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who divorces his wife and leaves until she becomes stranger to him, then marries her. He (the Imam) said, ‘She can live with him just as she did with marriage.’ I then said, ‘Hadith of Rifa‘ah says, “If there is a husband in between.’” Then ‘Abd Allah said to me, ‘This is husband and it is what Allah has granted of opinion. Whenever he divorces once and then she becomes stranger to him, then another man marries her then her husband divorces, then she marries the first husband, she can live with him accepted as she was.’ I then asked ‘Abd Allah, ‘According to whose Hadith is this?’ He replied, ‘It is what Allah has granted.’ Mu‘awiyah ibn Hukaym has said that our people have narrated from Rifa‘ah ibn Musa that husband destroys the first divorce and if he marries her she lives with him accepted.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, then said, ‘Three divorces destroy but not one and two.’ Hadith of Rifa‘ah from abu ‘Abd Allah, ‘Alayhi al-Salam, is the one on the basis of which ibn Bukayr has argued.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:2:18",
  "kind": "verse_list"
}