{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:6:2",
        "titles": {
          "ar": "كتاب الطلاق ",
          "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 2"
        },
        "path": "/books/al-kafi:6:2:2",
        "titles": {
          "ar": "باب تَطْلِيقِ الْمَرْأَةِ غَيْرِ الْمُوَافِقَةِ",
          "en": "Chapter 2 – Divorcing the incompatible woman"
        }
      }
    ],
    "index": 1603,
    "local_index": 2,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:6:2:3",
        "titles": {
          "ar": "باب أَنَّ النَّاسَ لَا يَسْتَقِيمُونَ عَلَى الطَّلَاقِ إِلَّا بِالسَّيْفِ",
          "en": "Chapter 3 – The people will not be standing straight upon the divorce (matters) except by the sword"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 1"
        },
        "path": "/books/al-kafi:6:2:1",
        "titles": {
          "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>اب كَرَاهِيَةِ طَلَاقِ</span> الزَّوْجَةِ الْمُوَافِقَةِ",
          "en": "Chapter 1 – Abhorrence of divorcing the compatible wife"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:6:2",
        "titles": {
          "ar": "كتاب الطلاق ",
          "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:2:2",
    "titles": {
      "ar": "باب تَطْلِيقِ الْمَرْأَةِ غَيْرِ الْمُوَافِقَةِ",
      "en": "Chapter 2 – Divorcing the incompatible woman"
    },
    "verse_count": 4,
    "verse_start_index": 10535,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/95)"
        ],
        "index": 10536,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:2:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ رَجُلٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّهُ كَانَتْ عِنْدَهُ امْرَأَةٌ تُعْجِبُهُ وَ كَانَ لَهَا مُحِبّاً فَأَصْبَحَ يَوْماً وَ قَدْ طَلَّقَهَا وَ اغْتَمَّ لِذَلِكَ فَقَالَ لَهُ بَعْضُ مَوَالِيهِ جُعِلْتُ فِدَاكَ لِمَ طَلَّقْتَهَا فَقَالَ إِنِّي ذَكَرْتُ عَلِيّاً ( عليه السلام ) فَتَنَقَّصَتْهُ فَكَرِهْتُ أَنْ أُلْصِقَ جَمْرَةً مِنْ جَمْرِ جَهَنَّمَ بِجِلْدِي ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Usman Bin Isa, from a man, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, that he<sup>asws</sup> used to have a wife who astounded him<sup>asws</sup> and he<sup>asws</sup> loved her. So, one morning he<sup>asws</sup> had divorced her, and was gloomy due to that. So one of his<sup>asws</sup> friends said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Why did you<sup>asws</sup> divorce her?’ So he<sup>asws</sup> said: ‘I<sup>asws</sup> mentioned Ali<sup>asws</sup>, so she reduced him<sup>asws</sup> (was disrespectful to him<sup>asws</sup>) therefore I<sup>asws</sup> disliked that I<sup>asws</sup> should be attached to an ember from the embers of Hell with my<sup>asws</sup> skin’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from ‘Uthman ibn ‘Isa from a man who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, had a wife whom he (the Imam) liked and loved. One day he (the Imam) divorced her and he was sad about it. A certain person of his followers asked, ‘Why did you divorce her?’ He (the Imam) replied, ‘I mentioned Ali, ‘Alayhi al-Salam, before her and she reduced him (the Imam). I did not like touching a burning piece of charcoal of the charcoal of hell with my skin.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/95)"
        ],
        "index": 10537,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:2:2",
        "text": [
          "مُحَمَّدُ بْنُ الْحُسَيْنِ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ الْأَحْمَرِ عَنْ عَبْدِ اللَّهِ بْنِ حَمَّادٍ عَنْ خَطَّابِ بْنِ سَلَمَةَ قَالَ كَانَتْ عِنْدِي امْرَأَةٌ تَصِفُ هَذَا الْأَمْرَ وَ كَانَ أَبُوهَا كَذَلِكَ وَ كَانَتْ سَيِّئَةَ الْخُلُقِ فَكُنْتُ أَكْرَهُ طَلَاقَهَا لِمَعْرِفَتِي بِإِيمَانِهَا وَ إِيمَانِ أَبِيهَا فَلَقِيتُ أَبَا الْحَسَنِ مُوسَى ( عليه السلام ) وَ أَنَا أُرِيدُ أَنْ أَسْأَلَهُ عَنْ طَلَاقِهَا فَقُلْتُ جُعِلْتُ فِدَاكَ إِنَّ لِي إِلَيْكَ حَاجَةً فَتَأْذَنُ لِي أَنْ أَسْأَلَكَ عَنْهَا فَقَالَ ائْتِنِي غَداً صَلَاةَ الظُّهْرِ ",
          "قَالَ فَلَمَّا صَلَّيْتُ الظُّهْرَ أَتَيْتُهُ فَوَجَدْتُهُ قَدْ صَلَّى وَ جَلَسَ فَدَخَلْتُ عَلَيْهِ وَ جَلَسْتُ بَيْنَ يَدَيْهِ فَابْتَدَأَنِي فَقَالَ يَا خَطَّابُ كَانَ أَبِي زَوَّجَنِي ابْنَةَ عَمٍّ لِي وَ كَانَتْ سَيِّئَةَ الْخُلُقِ وَ كَانَ أَبِي رُبَّمَا أَغْلَقَ عَلَيَّ وَ عَلَيْهَا الْبَابَ رَجَاءَ أَنْ أَلْقَاهَا فَأَتَسَلَّقُ الْحَائِطَ وَ أَهْرُبُ مِنْهَا فَلَمَّا مَاتَ أَبِي طَلَّقْتُهَا ",
          "فَقُلْتُ اللَّهُ أَكْبَرُ أَجَابَنِي وَ اللَّهِ عَنْ حَاجَتِي مِنْ غَيْرِ مَسْأَلَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Husayn, from Ibrahim Bin Is’haq Al Ahmar, from Abdullah Bin Hammad, from Khattab Bin Salma who said, ",
            "‘There was a wife with me described upon this matter (<span class=\"iTxt\">Al-Wilayah</span>), and her father was like that, and she was of evil manners. But, I abhorred divorcing her due to my recognition of her faith and the faith of her father. So I met Abu Al-Hassan Musa<sup>asws</sup>, and I intended to ask him<sup>asws</sup> about divorcing her. So I said, ‘May I be sacrificed for you! For me there is a need to you<sup>asws</sup>’. So he<sup>asws</sup> permitted me that I ask him<sup>asws</sup> about her, and he<sup>asws</sup> said: ‘Come to me<sup>asws</sup> tomorrow at <span class=\"iTxt\">Al-Zohr</span> Prayer’.",
            "He (the narrator) said, ‘So when I had Prayed <span class=\"iTxt\">Al-Zohr</span>, I found him<sup>asws</sup> (also) to have Prayed, and seated. So I went over to him<sup>asws</sup> and sat in front of him. He began before me, so he<sup>asws</sup> said: ‘O Khattab! My<sup>asws</sup> father<sup>asws</sup> got me<sup>asws</sup> married to a daughter of an uncle of mine<sup>asws</sup>, and she was of evil manners; and sometimes my<sup>asws</sup> father<sup>asws</sup> used to lock the door upon me<sup>asws</sup> and upon her, hoping that I<sup>asws</sup> settle (my affairs) with her. So I<sup>asws</sup> would climb the wall and go away from her. So when my<sup>asws</sup> father<sup>asws</sup> passed away, I<sup>asws</sup> divorced her’. ",
            "So I said, ‘Allah<sup>azwj</sup> is the Greatest! You<sup>asws</sup> have answered me, by Allah<sup>azwj</sup>, from my need, without being asked’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn al-Husayn has narrated from Ibrahim ibn Ishaq al-Ahmar from ‘Abd Allah ibn Hammad Khattab ibn Salmah who has said the following: “I had a wife who believed (in the divine authority of ‘ A’immah ) and so also was her father, but she had very bad moral behaviors and I did not like to divorce her because of her belief and the belief of her father. I met abu al-Hassan, Musa, ‘Alayhi al-Salam, and I wanted to ask him (the Imam) if divorcing her is proper saying, ‘I pray to Allah to keep my soul in service for your cause, I need an answer to a question and I like to ask you.’ He (the Imam) said, ‘Come tomorrow at the time of al- Zuhr Salat (prayer). He (the narrator) has said, ‘After performing al-Zuhr Salat (prayer) I went to see him (the Imam) and I found that he (the Imam) had completed his Salat (prayer) and he was sitting. I went inside and sat in front of him (the Imam). He (the Imam) initiated speaking to me and said, ‘O Khattab, my father made me marry a daughter of my uncle and her moral behaviors were very bad. My father sometimes would close the door on both of us in the hope that I may meet her, instead of climbing the wall to run away. When my father passed away I divorced her.’ I (the narrator) then said to myself, ‘Allah is Greater than can be described, He (the Imam) has answered my question before I could even ask him (the Imam).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/95)"
        ],
        "index": 10538,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:2:3",
        "text": [
          "أَحْمَدُ بْنُ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ خَطَّابِ بْنِ سَلَمَةَ قَالَ دَخَلْتُ عَلَيْهِ يَعْنِي أَبَا الْحَسَنِ مُوسَى ( عليه السلام ) وَ أَنَا أُرِيدُ أَنْ أَشْكُوَ إِلَيْهِ مَا أَلْقَى مِنِ امْرَأَتِي مِنْ سُوءِ خُلُقِهَا فَابْتَدَأَنِي فَقَالَ إِنَّ أَبِي كَانَ زَوَّجَنِي مَرَّةً امْرَأَةً سَيِّئَةَ الْخُلُقِ فَشَكَوْتُ ذَلِكَ إِلَيْهِ فَقَالَ لِي مَا يَمْنَعُكَ مِنْ فِرَاقِهَا قَدْ جَعَلَ اللَّهُ ذَلِكَ إِلَيْكَ فَقُلْتُ فِيمَا بَيْنِي وَ بَيْنَ نَفْسِي قَدْ فَرَّجْتَ عَنِّي ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mahran, from Muhammad Bin Ali, from Umar Bin Abdul Aziz, from Khattab Bin Salma who said, ",
            "‘I went over to him<sup>asws</sup>, meaning Abu Al-Hassan<sup>asws</sup>, and I wanted to complain to him<sup>asws</sup> what I faced from my wife from the evil of her mannerisms. So he<sup>asws</sup> began before me, so he<sup>asws</sup> said: ‘My<sup>asws</sup> father<sup>asws</sup> had got me<sup>asws</sup> married once to a woman of evil manners. So I<sup>asws</sup> complained of that to him<sup>asws</sup>, so he<sup>asws</sup> said to me<sup>asws</sup>: ‘What is preventing you from separating from her. Allah<sup>azwj</sup> has Made that (Permissible) to you<sup>asws</sup>?’ So I said in what is between me and myself, ‘He<sup>asws</sup> has relieved me’."
          ],
          "en.sarwar": [
            "3. Ahmad ibn Mehran has narrated from Muhammad ibn Ali from ‘Umar ibn ‘Abd al-‘Aziz from Khattab ibn Salmah who has said the following: “I once went to see him, abu al-Hassan, Musa, ‘Alayhi al-Salam, and complain before him against my wife because of her bad moral behaviors. He (the Imam) initiating to speak to me said, ‘One time my father arranged for me the marriage to a woman who had very bad moral behaviors and I complained before him against her. He said, ‘What stops you from divorcing her? Allah has already given you such authority.’ I (the narrator) then said to myself, ‘You (Imam) by Allah have provided relief and a way out for me.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/96)"
        ],
        "index": 10539,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:2:4",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنِ الْوَلِيدِ بْنِ صَبِيحٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ ثَلَاثَةٌ تُرَدُّ عَلَيْهِمْ دَعْوَتُهُمْ أَحَدُهُمْ رَجُلٌ يَدْعُو عَلَى امْرَأَتِهِ وَ هُوَ لَهَا ظَالِمٌ فَيُقَالُ لَهُ أَ لَمْ نَجْعَلْ أَمْرَهَا بِيَدِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Al Washa, from Abdullah Bin Sinan, from Al Waleed Bin Sabeeh, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘Three (people), the supplication is returned unto them (unanswered) – one of them is a man who supplicates against his wife, and he is unjust to her, so it is said to him: ‘Did we not make her matter to be in your hands (the choice of divorcing her)?’"
          ],
          "en.sarwar": [
            "4. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad ibn Sama‘ah from Muhammad ibn Ziyad ibn ‘Isa from ‘Abd Allah ibn Sinan who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin, ‘Alayhi al-Salam, once from the pulpit said, ‘Do not give in marriage to al-Hassan because he is a man who divorces very often.’ A man from Hamadan stood up and said, ‘Yes, we will give to him in marriage, by Allah, because he is the grandson of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and the son of ’Amir al-Mu’minin, ‘Alayhi al-Salam. He may keep if he likes or divorce if he so wills.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/96)"
        ],
        "part_type": "Hadith",
        "text": [
          "عدة من أصحابنا، عن أحمد بن محمد، عن محمد بن إسماعيل بن بزيع، عن جعفر بن بشير، عن يحيى بن أبي العلاء، عن أبي عبد الله عليه السلام قال: إن الحسن بن علي عليهما السلام طلق خمسين امرأة فقام علي عليه السلام بالكوفة فقال: يا معاشر أهل الكوفة لا تنكحوا الحسن فإنه رجل مطلاق فقام إليه رجل فقال: بلى والله لننكحنه فإنه ابن رسول الله صلى الله عليه وآله وابن فاطمة عليها السلام فإن أعجبته أمسك وإن كره طلق."
        ],
        "translations": {
          "en.sarwar": [
            "5. A number of our people have narrated from Ahmad ibn Muhammad from Muhammad ibn ’Isma‘il ibn Bazi‘ from Ja‘far ibn Bashir from Yahya ibn abu al-‘Ala’ who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said, ‘Al-Hassan ibn Ali, ‘Alayhi al-Salam, divorced fifty women. Ali, ‘Alayhi al-Salam, stood in al-Kufah and said, ‘O people of al-Kufah do not give in marriage to al-Hassan because he divorces very often.’ A man stood up and said, ‘Yes, we will give to him in marriage, by Allah, because he is the grandson of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and the son of Fatimah, ‘Alayha al-Salam. He may keep if he likes or divorces if he so wills.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/96)"
        ],
        "part_type": "Hadith",
        "text": [
          "الحسين بن محمد، عن معلى بن محمد، عن الوشاء، عن عبد الله بن سنان، عن الوليد ابن صبيح، عن أبي عبد الله عليه السلام قال: سمعته يقول: ثلاثة ترد عليهم دعوتهم أحدهم رجل يدعو على امرأته وهو لها ظالم فيقال له: ألم نجعل أمرها بيدك."
        ],
        "translations": {
          "en.sarwar": [
            "6. Al-Husayn from Muhammad has narrated from Mu‘alla’ ibn Muhammad from al-Washsha’ from ‘Abd Allah ibn Sinan from al-Walid ibn Sabih who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ‘The prayers of three kinds of people are returned to them without a favorable answer. One of such people is one who prays against his wife to whom he is unjust and it is said to him, ‘Have we not given you the authority to divorce her?”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:2:2",
  "kind": "verse_list"
}