{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:6:2",
        "titles": {
          "ar": "كتاب الطلاق ",
          "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 25"
        },
        "path": "/books/al-kafi:6:2:25",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب فِي الَّتِي يَخْفَى</span> حَيْضُهَا",
          "en": "Chapter 25 – The woman whose menstruation is obscure"
        }
      }
    ],
    "index": 1626,
    "local_index": 25,
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:2:25",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب فِي الَّتِي يَخْفَى</span> حَيْضُهَا",
      "en": "Chapter 25 – The woman whose menstruation is obscure"
    },
    "verse_count": 1,
    "verse_start_index": 10656,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/146)"
        ],
        "index": 10657,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:25:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنْ رَجُلٍ تَزَوَّجَ امْرَأَةً سِرّاً مِنْ أَهْلِهَا وَ هِيَ فِي مَنْزِلِ أَهْلِهَا وَ قَدْ أَرَادَ أَنْ يُطَلِّقَهَا وَ لَيْسَ يَصِلُ إِلَيْهَا فَيَعْلَمَ طَمْثَهَا إِذَا طَمِثَتْ وَ لَا يَعْلَمَ بِطُهْرِهَا إِذَا طَهُرَتْ قَالَ فَقَالَ هَذَا مِثْلُ الْغَائِبِ عَنْ أَهْلِهِ يُطَلِّقُهَا بِالْأَهِلَّةِ وَ الشُّهُورِ ",
          "قُلْتُ أَ رَأَيْتَ إِنْ كَانَ يَصِلُ إِلَيْهَا الْأَحْيَانَ وَ الْأَحْيَانَ لَا يَصِلُ إِلَيْهَا فَيَعْلَمَ حَالَهَا كَيْفَ يُطَلِّقُهَا فَقَالَ إِذَا مَضَى لَهُ شَهْرٌ لَا يَصِلُ إِلَيْهَا فِيهِ يُطَلِّقُهَا إِذَا نَظَرَ إِلَى غُرَّةِ الشَّهْرِ الْآخَرِ بِشُهُودٍ وَ يَكْتُبُ الشَّهْرَ الَّذِي يُطَلِّقُهَا فِيهِ وَ يُشْهِدُ عَلَى طَلَاقِهَا رَجُلَيْنِ فَإِذَا مَضَى ثَلَاثَةُ أَشْهُرٍ فَقَدْ بَانَتْ مِنْهُ وَ هُوَ خَاطِبٌ مِنَ الْخُطَّابِ وَ عَلَيْهِ نَفَقَتُهَا فِي تِلْكَ الثَّلَاثَةِ الْأَشْهُرِ الَّتِي تَعْتَدُّ فِيهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, and Ali Bin Ibrahim, form his father, both together from Ibn Mahboub, from Abdul Raham Bin Al Hajjaj who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about a man who married a woman secretly from her family and she was in the house of her family, and had intended to divorce her, and he could not go to her. So he knew her menstruation when she menstruated, and did not know of her purity when she was pure. So he<sup>asws</sup> said: ‘This is like the absentee from his wife. He divorces her by the new-moons and the months’. ",
            "I said, ‘What is your<sup>asws</sup> view if he could sometimes go to her and sometimes he could not go to her, so he would know of her state, how should he divorce her?’ So he<sup>asws</sup> said: ‘When a month passes by for him, not being able to go to her in it, he can divorce her by looking at the onset of the month, with witnesses, and he writes down the month in which he divorces her, and keeps two men as witnesses upon his divorcing her. So when three months pass by, so she is irrevocably divorced from him, and he is a proposer from the proposers, and upon him is her expenses in the third month which she had her waiting period in’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad and Ali ibn Ibrahim has narrated from his father all from ibn Mahbub from ‘ Abd al-Rahman ibn al-Hajj aj who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about the case of a man who marries a woman secretly in the house of her family. He wants to divorce her but cannot reach her to know about her Hayd (menses) and does not know when she becomes clean of Hayd (menses). He (the Imam) said, ‘This is like the case of a husband who is absent who divorces by counting new moon and months.’ I then asked, ‘What happens if he is able to reach her at certain times to find out about her Hayd (menses): how he should divorce her?’ He (the Imam) said, ‘When a month, during which he is not able to reach her, passes he can divorce her when he finds himself in the beginning of the next month. He must write down about the month in which he has divorced and arrange for two men as witnesses. When three months pass she becomes stranger to him and he becomes one of those who can propose marriage. He, however, must pay her expenses for the three months in which she counted the waiting period.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:2:25",
  "kind": "verse_list"
}