{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:6:2",
        "titles": {
          "ar": "كتاب الطلاق ",
          "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 29"
        },
        "path": "/books/al-kafi:6:2:29",
        "titles": {
          "ar": "بَابُ الْفَرْقِ بَيْنَ مَنْ طَلَّقَ عَلَى غَيْرِ السُّنَّةِ وَ بَيْنَ الْمُطَلَّقَةِ إِذَا خَرَجَتْ وَ هِيَ فِي عِدَّتِهَا أَوْ أَخْرَجَهَا زَوْجُهَا",
          "en": "29. The Difference between one Divorced in Non-Sunnah manner and the One who Goes out in her Waiting Period or is Sent out by the Husband"
        }
      }
    ],
    "index": 1630,
    "local_index": 29,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 30"
        },
        "path": "/books/al-kafi:6:2:30",
        "titles": {
          "ar": "باب فِي تَأْوِيلِ قَوْلِهِ تَعَالَى لا تُخْرِجُوهُنَّ مِنْ بُيُوتِهِنَّ وَ لا يَخْرُجْنَ",
          "en": "Chapter 29 – The explanation of the Words of the High [65:1] Do not drive them out of their houses, nor should they themselves go forth"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 28"
        },
        "path": "/books/al-kafi:6:2:28",
        "titles": {
          "ar": "باب عِدَّةِ الْمُطَلَّقَةِ وَ أَيْنَ تَعْتَدُّ",
          "en": "Chapter 28 – Waiting period of the divorced woman, and where she waits"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:6:2",
        "titles": {
          "ar": "كتاب الطلاق ",
          "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:2:29",
    "titles": {
      "ar": "بَابُ الْفَرْقِ بَيْنَ مَنْ طَلَّقَ عَلَى غَيْرِ السُّنَّةِ وَ بَيْنَ الْمُطَلَّقَةِ إِذَا خَرَجَتْ وَ هِيَ فِي عِدَّتِهَا أَوْ أَخْرَجَهَا زَوْجُهَا",
      "en": "29. The Difference between one Divorced in Non-Sunnah manner and the One who Goes out in her Waiting Period or is Sent out by the Husband"
    },
    "verse_count": 0,
    "verse_start_index": 10686,
    "verse_translations": [
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه موقو ف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/157)"
        ],
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/59",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ حَدَّثَنِي "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3861",
              "text": "حَمْدَانُ الْقَلانِسِيُّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنِي حَمْدَانُ الْقَلانِسِيُّ قَالَ"
        },
        "part_type": "Hadith",
        "text": [
          " قَالَ لِي عُمَرُ بْنُ شِهَابٍ الْعَبْدِيُّ مِنْ أَيْنَ زَعَمَ أَصْحَابُكَ أَنَّ مَنْ طَلَّقَ ثَلاثاً لَمْ يَقَعِ الطَّلاقُ فَقُلْتُ لَهُ زَعَمُوا أَنَّ الطَّلاقَ لِلْكِتَابِ وَالسُّنَّةِ فَمَنْ خَالَفَهُمَا رُدَّ إِلَيْهِمَا قَالَ فَمَا تَقُولُ فِيمَنْ طَلَّقَ عَلَى الْكِتَابِ وَالسُّنَّةِ فَخَرَجَتِ امْرَأَتُهُ أَوْ أَخْرَجَهَا فَاعْتَدَّتْ فِي غَيْرِ بَيْتِهَا تَجُوزُ عَلَيْهَا الْعِدَّةُ أَوْ يَرُدُّهَا إِلَى بَيْتِهِ حَتَّى تَعْتَدَّ عِدَّةً أُخْرَى فَإِنَّ اللهَ عَزَّ وَجَلَّ قَالَ لا تُخْرِجُوهُنَّ مِنْ بُيُوتِهِنَّ وَلا يَخْرُجْنَ قَالَ فَأَجَبْتُهُ بِجَوَابٍ لَمْ يَكُنْ عِنْدِي جَوَاباً وَمَضَيْتُ فَلَقِيتُ أَيُّوبَ بْنَ نُوحٍ فَسَأَلْتُهُ عَنْ ذَلِكَ فَأَخْبَرْتُهُ بِقَوْلِ عُمَرَ فَقَالَ لَيْسَ نَحْنُ أَصْحَابَ قِيَاسٍ إِنَّمَا نَقُولُ بِالآثَارِ فَلَقِيتُ عَلِيَّ بْنَ رَاشِدٍ فَسَأَلْتُهُ عَنْ ذَلِكَ وَأَخْبَرْتُهُ بِقَوْلِ عُمَرَ فَقَالَ قَدْ قَاسَ عَلَيْكَ وَهُوَ يُلْزِمُكَ إِنْ لَمْ يَجُزِ الطَّلاقُ إِلا لِلْكِتَابِ فَلا تَجُوزُ الْعِدَّةُ إِلا لِلْكِتَابِ فَسَأَلْتُ مُعَاوِيَةَ بْنَ حُكَيْمٍ عَنْ ذَلِكَ وَ أَخْبَرْتُهُ بِقَوْلِ عُمَرَ فَقَالَ مُعَاوِيَةُ لَيْسَ الْعِدَّةُ مِثْلَ الطَّلاقِ وَبَيْنَهُمَا فَرْقٌ وَذَلِكَ أَنَّ الطَّلاقَ فِعْلُ الْمُطَلِّقِ فَإِذَا فَعَلَ خِلافَ الْكِتَابِ وَمَا أُمِرَ بِهِ قُلْنَا لَهُ ارْجِعْ إِلَى الْكِتَابِ وَإِلا فَلا يَقَعُ الطَّلاقُ وَالْعِدَّةُ لَيْسَتْ فِعْلَ الرَّجُلِ وَلا فِعْلَ الْمَرْأَةِ إِنَّمَا هِيَ أَيَّامٌ تَمْضِي وَحَيْضٌ يَحْدُثُ لَيْسَ مِنْ فِعْلِهِ وَلا مِنْ فِعْلِهَا إِنَّمَا هُوَ فِعْلُ اللهِ تَبَارَكَ وَتَعَالَى فَلَيْسَ يُقَاسُ فِعْلُ اللهِ عَزَّ وَجَلَّ بِفِعْلِهِ وَفِعْلِهَا فَإِذَا عَصَتْ وَخَالَفَتْ فَقَدْ مَضَتِ الْعِدَّةُ وَبَاءَتْ بِإِثْمِ الْخِلافِ وَلَوْ كَانَتِ الْعِدَّةُ فِعْلَهَا لِمَا أَوْقَعْنَا عَلَيْهَا الْعِدَّةَ كَمَا لَمْ يَقَعِ الطَّلاقُ إِذَا خَالَفَ وَقَالَ الْفَضْلُ بْنُ شَاذَانَ فِي جَوَابٍ أَجَابَ بِهِ أَبَا عُبَيْدٍ فِي كِتَابِ الطَّلاقِ ذَكَرَ أَبُو عُبَيْدٍ أَنَّ بَعْضَ أَصْحَابِ الْكَلامِ قَالَ إِنَّ اللهَ تَبَارَكَ وَتَعَالَى حِينَ جَعَلَ الطَّلاقَ لِلْعِدَّةِ لَمْ يُخْبِرْنَا أَنَّ مَنْ طَلَّقَ لِغَيْرِ الْعِدَّةِ كَانَ طَلاقُهُ عَنْهُ سَاقِطاً وَلَكِنَّهُ شَيْ‏ءٌ تَعَبَّدَ بِهِ الرِّجَالُ كَمَا تَعَبَّدَ النِّسَاءُ بِأَنْ لا يَخْرُجْنَ مِنْ بُيُوتِهِنَّ مَا دُمْنَ يَعْتَدِدْنَ وَإِنَّمَا أَخْبَرَنَا فِي ذَلِكَ بِالْمَعْصِيَةِ فَقَالَ وَتِلْكَ حُدُودُ اللهِ فَلا تَعْتَدُوهَا وَمَنْ يَتَعَدَّ حُدُودَ اللهِ فَقَدْ ظَلَمَ نَفْسَهُ فَهَلِ الْمَعْصِيَةُ فِي الطَّلاقِ إِلا كَالْمَعْصِيَةِ فِي خُرُوجِ الْمُعْتَدَّةِ مِنْ بَيْتِهَا أَلَسْتُمْ تَرَوْنَ أَنَّ الأمَّةَ مُجْمِعَةٌ عَلَى أَنَّ الْمَرْأَةَ الْمُطَلَّقَةَ إِذَا خَرَجَتْ مِنْ بَيْتِهَا أَيَّاماً أَنَّ تِلْكَ الأيَّامَ مَحْسُوبَةٌ لَهَا فِي عِدَّتِهَا وَإِنْ كَانَتْ للهِ فِيهِ عَاصِيَةً فَكَذَلِكَ الطَّلاقُ فِي الْحَيْضِ مَحْسُوبٌ عَلَى الْمُطَلِّقِ وَإِنْ كَانَ للهِ فِيهِ عَاصِياً قَالَ الْفَضْلُ بْنُ شَاذَانَ أَمَّا قَوْلُهُ إِنْ اللهَ عَزَّ وَجَلَّ لَمَّا جَعَلَ الطَّلاقَ لِلْعِدَّةِ لَمْ يُخْبِرْنَا أَنَّ مَنْ طَلَّقَ لِغَيْرِ الْعِدَّةِ كَانَ الطَّلاقُ عَنْهُ سَاقِطاً فَلْيُعْلَمْ أَنَّ مِثْلَ هَذَا إِنَّمَا هُوَ تَعَلُّقٌ بِالسَّرَابِ إِنَّمَا يُقَالُ لَهُمْ إِنَّ أَمْرَ اللهِ عَزَّ وَجَلَّ بِالشَّيْ‏ءِ هُوَ نَهْيٌ عَنْ خِلافِهِ وَذَلِكَ أَنَّهُ جَلَّ ذِكْرُهُ حَيْثُ أَبَاحَ نِكَاحَ أَرْبَعِ نِسْوَةٍ لَمْ يُخْبِرْنَا أَنَّ أَكْثَرَ مِنْ ذَلِكَ لا يَجُوزُ وَحَيْثُ جَعَلَ الْكَعْبَةَ قِبْلَةً لَمْ يُخْبِرْنَا أَنَّ قِبْلَةً غَيْرَ الْكَعْبَةِ لا تَجُوزُ وَحَيْثُ جَعَلَ الْحَجَّ فِي ذِي الْحِجَّةِ. لَمْ يُخْبِرْنَا أَنَّ الْحَجَّ فِي غَيْرِ ذِي الْحِجَّةِ لا يَجُوزُ وَحَيْثُ جَعَلَ الصَّلاةَ رَكْعَةً وَسَجْدَتَيْنِ لَمْ يُخْبِرْنَا أَنَّ رَكْعَتَيْنِ وَثَلاثَ سَجَدَاتٍ لا يَجُوزُ فَلَوْ أَنَّ إِنْسَاناً تَزَوَّجَ خَمْسَ نِسْوَةٍ لَكَانَ نِكَاحُهُ الْخَامِسَةَ بَاطِلا وَلَوِ اتَّخَذَ قِبْلَةً غَيْرَ الْكَعْبَةِ لَكَانَ ضَالا مُخْطِئاً غَيْرَ جَائِزٍ لَهُ وَكَانَتْ صَلاتُهُ غَيْرَ جَائِزَةٍ وَلَوْ حَجَّ فِي غَيْرِ ذِي الْحِجَّةِ لَمْ يَكُنْ حَاجّاً وَكَانَ فِعْلُهُ بَاطِلا وَلَوْ جَعَلَ صَلاتَهُ بَدَلَ كُلِّ رَكْعَةٍ رَكْعَتَيْنِ وَثَلاثَ سَجَدَاتٍ لَكَانَتْ صَلاتُهُ فَاسِدَةً وَكَانَ غَيْرَ مُصَلٍّ لأنَّ كُلَّ مَنْ تَعَدَّى مَا أُمِرَ بِهِ وَلَمْ يُطْلَقْ لَهُ ذَلِكَ كَانَ فِعْلُهُ بَاطِلا فَاسِداً غَيْرَ جَائِزٍ وَلا مَقْبُولٍ فَكَذَلِكَ الأمْرُ وَالْحُكْمُ فِي الطَّلاقِ كَسَائِرِ مَا بَيَّنَّا وَالْحَمْدُ للهِ وَأَمَّا قَوْلُهُمْ إِنَّ ذَلِكَ شَيْ‏ءٌ تَعَبَّدَ بِهِ الرِّجَالُ كَمَا تَعَبَّدَ بِهِ النِّسَاءُ أَنْ لا يَخْرُجْنَ مَا دُمْنَ يَعْتَدِدْنَ مِنْ بُيُوتِهِنَّ فَأَخْبَرَنَا ذَلِكَ لَهُنَّ بِالْمَعْصِيَةِ وَهَلِ الْمَعْصِيَةُ فِي الطَّلاقِ إِلا كَالْمَعْصِيَةِ فِي خُرُوجِ الْمُعْتَدَّةِ مِنْ بَيْتِهَا فِي عِدَّتِهَا فَلَوْ خَرَجَتْ مِنْ بَيْتِهَا أَيَّاماً لَكَانَ ذَلِكَ مَحْسُوباً لَهَا فَكَذَلِكَ الطَّلاقُ فِي الْحَيْضِ مَحْسُوبٌ وَإِنْ كَانَ للهِ عَاصِياً فَيُقَالُ لَهُمْ إِنَّ هَذِهِ شُبْهَةٌ دَخَلَتْ عَلَيْكُمْ مِنْ حَيْثُ لا تَعْلَمُونَ وَذَلِكَ أَنَّ الْخُرُوجَ وَالإخْرَاجَ لَيْسَ مِنْ شَرَائِطِ الطَّلاقِ كَالْعِدَّةِ لأنَّ الْعِدَّةَ مِنْ شَرَائِطِ الطَّلاقِ ذَلِكَ أَنَّهُ لا يَحِلُّ لِلْمَرْأَةِ أَنْ تَخْرُجَ مِنْ بَيْتِهَا قَبْلَ الطَّلاقِ وَلا بَعْدَ الطَّلاقِ وَلا يَحِلُّ لِلرَّجُلِ أَنْ يُخْرِجَهَا مِنْ بَيْتِهَا قَبْلَ الطَّلاقِ وَلا بَعْدَ الطَّلاقِ فَالطَّلاقُ وَغَيْرُ الطَّلاقِ فِي حَظْرِ ذَلِكَ وَمَنْعِهِ وَاحِدٌ وَالْعِدَّةُ لا تَقَعُ إِلا مَعَ الطَّلاقِ وَلا تَجِبُ إِلا بِالطَّلاقِ وَلا يَكُونُ الطَّلاقُ لِمَدْخُولٍ بِهَا وَلا عِدَّةٌ كَمَا قَدْ يَكُونُ خُرُوجاً وَإِخْرَاجاً بِلا طَلاقٍ وَلا عِدَّةٍ فَلَيْسَ يُشَبَّهُ الْخُرُوجُ وَالإخْرَاجُ بِالْعِدَّةِ وَالطَّلاقِ فِي هَذَا الْبَابِ وَإِنَّمَا قِيَاسُ الْخُرُوجِ وَالإخْرَاجِ كَرَجُلٍ دَخَلَ دَارَ قَوْمٍ بِغَيْرِ إِذْنِهِمْ فَصَلَّى فِيهَا فَهُوَ عَاصٍ فِي دُخُولِهِ الدَّارَ وَصَلاتُهُ جَائِزَةٌ لأنَّ ذَلِكَ لَيْسَ مِنْ شَرَائِطِ الصَّلاةِ لأنَّهُ مَنْهِيٌّ عَنْ ذَلِكَ صَلَّى أَوْ لَمْ يُصَلِّ وَكَذَلِكَ لَوْ أَنَّ رَجُلا غَصَبَ ثَوْباً أَوْ أَخَذَهُ وَلَبِسَهُ بِغَيْرِ إِذْنِهِ فَصَلَّى فِيهِ لَكَانَتْ صَلاتُهُ جَائِزَةً وَكَانَ عَاصِياً فِي لُبْسِهِ ذَلِكَ الثَّوْبَ لأنَّ ذَلِكَ لَيْسَ مِنْ شَرَائِطِ الصَّلاةِ لأنَّهُ مَنْهِيٌّ عَنْ ذَلِكَ صَلَّى أَوْ لَمْ يُصَلِّ وَكَذَلِكَ لَوْ أَنَّهُ لَبِسَ ثَوْباً غَيْرَ طَاهِرٍ أَوْ لَمْ يُطَهِّرْ نَفْسَهُ أَوْ لَمْ يَتَوَجَّهْ نَحْوَ الْقِبْلَةِ لَكَانَتْ صَلاتُهُ فَاسِدَةً غَيْرَ جَائِزَةٍ لأنَّ ذَلِكَ مِنْ شَرَائِطِ الصَّلاةِ وَحُدُودِهَا لا يَجِبُ إِلا لِلصَّلاةِ وَكَذَلِكَ لَوْ كَذَبَ فِي شَهْرِ رَمَضَانَ وَهُوَ صَائِمٌ بَعْدَ أَنْ لا يُخْرِجَهُ كَذِبُهُ مِنَ الإيمَانِ لَكَانَ عَاصِياً فِي كَذِبِهِ ذَلِكَ وَكَانَ. صَوْمُهُ جَائِزاً لأنَّهُ مَنْهِيٌّ عَنِ الْكَذِبِ صَامَ أَوْ أَفْطَرَ وَلَوْ تَرَكَ الْعَزْمَ عَلَى الصَّوْمِ أَوْ جَامَعَ لَكَانَ صَوْمُهُ بَاطِلا فَاسِداً لأنَّ ذَلِكَ مِنْ شَرَائِطِ الصَّوْمِ وَحُدُودِهِ لا يَجِبُ إِلا مَعَ الصَّوْمِ وَكَذَلِكَ لَوْ حَجَّ وَهُوَ عَاقٌّ لِوَالِدَيْهِ وَلَمْ يُخْرِجْ لِغُرَمَائِهِ مِنْ حُقُوقِهِمْ لَكَانَ عَاصِياً فِي ذَلِكَ وَكَانَتْ حَجَّتُهُ جَائِزَةً لأنَّهُ مَنْهِيٌّ عَنْ ذَلِكَ حَجَّ أَوْ لَمْ يَحُجَّ وَلَوْ تَرَكَ الإحْرَامَ أَوْ جَامَعَ فِي إِحْرَامِهِ قَبْلَ الْوُقُوفِ لَكَانَتْ حَجَّتُهُ فَاسِدَةً غَيْرَ جَائِزَةٍ لأنَّ ذَلِكَ مِنْ شَرَائِطِ الْحَجِّ وَحُدُودِهِ لا يَجِبُ إِلا مَعَ الْحَجِّ وَمِنْ أَجْلِ الْحَجِّ فَكُلُّ مَا كَانَ وَاجِباً قَبْلَ الْفَرْضِ وَبَعْدَهُ فَلَيْسَ ذَلِكَ مِنْ شَرَائِطِ الْفَرْضِ لأنَّ ذَلِكَ أَتَى عَلَى حَدِّهِ وَالْفَرْضُ جَائِزٌ مَعَهُ فَكُلُّ مَا لَمْ يَجِبْ إِلا مَعَ الْفَرْضِ وَمِنْ أَجْلِ الْفَرْضِ فَإِنَّ ذَلِكَ مِنْ شَرَائِطِهِ لا يَجُوزُ الْفَرْضُ إِلا بِذَلِكَ عَلَى مَا بَيَّنَّاهُ وَلَكِنَّ الْقَوْمَ لا يَعْرِفُونَ وَلا يُمَيِّزُونَ وَيُرِيدُونَ أَنْ يَلْبِسُوا الْحَقَّ بِالْبَاطِلِ فَأَمَّا تَرْكُ الْخُرُوجِ وَالإخْرَاجِ فَوَاجِبٌ قَبْلَ الْعِدَّةِ وَمَعَ الْعِدَّةِ وَقَبْلَ الطَّلاقِ وَبَعْدَ الطَّلاقِ وَلَيْسَ هُوَ مِنْ شَرَائِطِ الطَّلاقِ وَلا مِنْ شَرَائِطِ الْعِدَّةِ وَالْعِدَّةُ جَائِزَةٌ مَعَهُ وَلا تَجِبُ الْعِدَّةُ إِلا مَعَ الطَّلاقِ وَمِنْ أَجْلِ الطَّلاقِ فَهِيَ مِنْ حُدُودِ الطَّلاقِ وَشَرَائِطِهِ عَلَى مَا مَثَّلْنَا وَبَيَّنَّا وَهُوَ فَرْقٌ وَاضِحٌ وَالْحَمْدُ للهِ وَبَعْدُ فَلْيُعْلَمْ أَنَّ مَعْنَى الْخُرُوجِ وَالإخْرَاجِ لَيْسَ هُوَ أَنْ تَخْرُجَ الْمَرْأَةُ إِلَى أَبِيهَا أَوْ تَخْرُجَ فِي حَاجَةٍ لَهَا أَوْ فِي حَقٍّ بِإِذْنِ زَوْجِهَا مِثْلِ مَأْتَمٍ أَوْ مَا أَشْبَهَ ذَلِكَ وَإِنَّمَا الْخُرُوجُ وَالإخْرَاجُ أَنْ تَخْرُجَ مُرَاغَمَةً أَوْ يُخْرِجَهَا زَوْجُهَا مُرَاغَمَةً فَهَذَا الَّذِي نَهَى اللهُ عَزَّ وَجَلَّ عَنْهُ فَلَوْ أَنَّ امْرَأَةً اسْتَأْذَنَتْ أَنْ تَخْرُجَ إِلَى أَبَوَيْهَا أَوْ تَخْرُجَ إِلَى حَقٍّ لَمْ نَقُلْ إِنَّهَا خَرَجَتْ مِنْ بَيْتِ زَوْجِهَا وَلا يُقَالُ إِنَّ فُلاناً أَخْرَجَ زَوْجَتَهُ مِنْ بَيْتِهَا إِنَّمَا يُقَالُ ذَلِكَ إِذَا كَانَ ذَلِكَ عَلَى الرَّغْمِ وَالسَّخَطِ وَعَلَى أَنَّهَا لا تُرِيدُ الْعَوْدَ إِلَى بَيْتِهَا فَأَمْسَكَهَا عَلَى ذَلِكَ وَفِيمَا بَيَّنَّا كِفَايَةٌ فَإِنْ قَالَ قَائِلٌ لَهَا أَنْ تَخْرُجَ قَبْلَ الطَّلاقِ بِإِذْنِ زَوْجِهَا وَلَيْسَ لَهَا أَنْ تَخْرُجَ بَعْدَ الطَّلاقِ وَإِنْ أَذِنَ لَهَا زَوْجُهَا فَحُكْمُ هَذَا الْخُرُوجِ غَيْرُ ذَلِكَ الْخُرُوجِ وَإِنَّمَا سَأَلْنَاكَ عَنْهُ فِي ذَلِكَ الْمَوْضِعِ الَّذِي يَشْتَبِهُ وَلَمْ نَسْأَلْكَ فِي هَذَا الْمَوْضِعِ الَّذِي لا يَشْتَبِهُ أَلَيْسَ قَدْ نُهِيَتْ عَنِ الْعِدَّةِ فِي غَيْرِ بَيْتِهَا فَإِنْ هِيَ فَعَلَتْ كَانَتْ عَاصِيَةً وَكَانَتِ الْعِدَّةُ جَائِزَةً فَكَذَلِكَ أَيْضاً إِذَا طَلَّقَ لِغَيْرِ. الْعِدَّةِ كَانَ خَاطِئاً وَكَانَ الطَّلاقُ وَاقِعاً وَإِلا فَمَا الْفَرْقُ قِيلَ لَهُ إِنَّ فِيمَا بَيَّنَّا كِفَايَةً مِنْ مَعْنَى الْخُرُوجِ وَالإخْرَاجِ مَا يُجْتَزَأُ بِهِ عَنْ هَذَا الْقَوْلِ لأنَّ أَصْحَابَ الأثَرِ وَأَصْحَابَ الرَّأْيِ وَأَصْحَابَ التَّشَيُّعِ قَدْ رَخَّصُوا لَهَا فِي الْخُرُوجِ الَّذِي لَيْسَ عَلَى السَّخَطِ وَالرَّغْمِ وَأَجْمَعُوا عَلَى ذَلِكَ فَمِنْ ذَلِكَ مَا رَوَى ابْنُ جَرِيحٍ عَنِ ابْنِ الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ خَالَتَهُ طُلِّقَتْ فَأَرَادَتِ الْخُرُوجَ إِلَى نَخْلٍ لَهَا تَجُذُّهُ فَلَقِيَتْ رَجُلا فَنَهَاهَا فَجَاءَتْ إِلَى رَسُولِ اللهِ (صَلَّى اللهُ عَلَيْهِ وَآلِه) فَقَالَ لَهَا اخْرُجِي فَجُذِّي نَخْلَكِ لَعَلَّكِ أَنْ تَصَدَّقِي أَوْ تَفْعَلِي مَعْرُوفاً وَرَوَى الْحَسَنُ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ طَاوُسٍ أَنَّ رَجُلا مِنْ أَصْحَابِ النَّبِيِّ (صَلَّى اللهُ عَلَيْهِ وَآلِه) سُئِلَ عَنِ الْمَرْأَةِ الْمُطَلَّقَةِ هَلْ تَخْرُجُ فِي عِدَّتِهَا فَرَخَّصَ فِي ذَلِكَ وَابْنُ بَشِيرٍ عَنِ الْمُغِيرَةِ عَنْ إِبْرَاهِيمَ أَنَّهُ قَالَ فِي الْمُطَلَّقَةِ ثَلاثاً إِنَّهَا لا تَخْرُجُ مِنْ بَيْتِ زَوْجِهَا إِلا فِي حَقٍّ مِنْ عِيَادَةِ مَرِيضٍ أَوْ قَرَابَةٍ أَوْ أَمْرٍ لا بُدَّ مِنْهُ مَالِكٌ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ أَنَّهُ كَانَ يَقُولُ لا تَبِيتُ الْمَبْتُوتَةُ وَالْمُتَوَفَّى عَنْهَا زَوْجُهَا إِلا فِي بَيْتِهَا وَهَذَا يَدُلُّ عَلَى أَنَّهُ قَدْ رَخَّصَ لَهَا فِي الْخُرُوجِ بِالنَّهَارِ وَقَالَ أَصْحَابُ الرَّأْيِ لَوْ أَنَّ مُطَلَّقَةً فِي مَنْزِلٍ لَيْسَ مَعَهَا فِيهِ رَجُلٌ تَخَافُ فِيهِ عَلَى نَفْسِهَا أَوْ مَتَاعِهَا كَانَتْ فِي سَعَةٍ مِنَ النُّقْلَةِ وَقَالُوا لَوْ كَانَتْ بِالسَّوَادِ فَطَلَّقَهَا زَوْجُهَا هُنَاكَ فَدَخَلَ عَلَيْهَا خَوْفٌ مِنْ سُلْطَانٍ أَوْ غَيْرِ ذَلِكَ كَانَتْ فِي سَعَةٍ مِنْ دُخُولِ الْمِصْرِ وَقَالُوا لِلأمَةِ الْمُطَلَّقَةِ أَنْ تَخْرُجَ فِي عِدَّتِهَا أَوْ تَبِيتَ عَنْ بَيْتِ زَوْجِهَا وَكَذَلِكَ قَالُوا أَيْضاً فِي الصَّبِيَّةِ الْمُطَلَّقَةِ قَالَ وَهَذَا كُلُّهُ يَدُلُّ عَلَى أَنَّ هَذَا الْخُرُوجَ غَيْرُ الْخُرُوجِ الَّذِي نَهَى اللهُ عَزَّ وَجَلَّ عَنْهُ وَإِنَّمَا الْخُرُوجُ الَّذِي نَهَى اللهُ عَزَّ وَجَلَّ عَنْهُ هُوَ مَا قُلْنَا أَنْ يَكُونَ خُرُوجُهَا عَلَى السَّخَطِ وَالْمُرَاغَمَةِ وَهُوَ الَّذِي يَجُوزُ فِي اللُّغَةِ أَنْ يُقَالَ فُلانَةُ خَرَجَتْ مِنْ بَيْتِ زَوْجِهَا وَإِنَّ فُلاناً أَخْرَجَ امْرَأَتَهُ مِنْ بَيْتِهِ وَلا يَجُوزُ أَنْ يُقَالَ لِسَائِرِ الْخُرُوجِ الَّذِي ذَكَرْنَا عَنْ أَصْحَابِ الرَّأْيِ وَالأثَرِ وَالتَّشَيُّعِ إِنَّ فُلانَةَ خَرَجَتْ مِنْ بَيْتِ زَوْجِهَا وَإِنَّ فُلاناً أَخْرَجَ امْرَأَتَهُ مِنْ بَيْتِهِ لأنَّ الْمُسْتَعْمَلَ فِي اللُّغَةِ هَذَا الَّذِي وَصَفْنَا وَبِاللهِ التَّوْفِيقُ."
        ],
        "translations": {
          "en.sarwar": [
            "1. Al-Husayn ibn Muhammad has said that narrated to me Hamdan al-Qalanisiy that ‘Umar ibn Shihab al-‘Abdiy asked me, ‘On what basis your people say that divorce pronounced three times does not make it three divorces?’ I said to him, ‘They believe that divorce is based on the book and al -Sunnah and whatever is against them is returned to them.’ He then asked, ‘What do you say about one who has divorced according to the book and Sunnah and his wife goes out or he sends her out and she counts the waiting period somewhere other than her house? Allah, most Majestic, most Glorious, has said, “Do not send them out of their house and they must not go out.’” I replied him with an answer, which was not from me. I met Ayyub ibn Nuh, asked him about it and informed him of the words of ‘Umar (ibn Shihab). He said, ‘We do not accept analogy. We only say what texts say.’ I then met Ali ibn Rashid and asked him about it and about the words of ‘Umar (ibn Shihab). He said, ‘He has used analogy against you to bind you. If divorce is not permissible without the book and Sunnah, waiting period also is not accepted without the book and Sunnah .’ I then asked Mu‘awiyah ibn al-Hukaym about it and informed him of the words of ‘Umar (ibn Shihab). Mu‘awiyah said, ‘Waiting period is not like divorce. There is a difference between them. Divorce is the act of divorcee. If he does against the book and against what he is commanded to do we can say to him to return to the book, otherwise, divorce is not valid. The waiting period is not the act of the man or woman. The days pass. Hayd (menses) takes place and it is not her act or his act. It is the act of Allah, most Blessed, most High. The act of Allah, most Majestic, most Glorious, cannot be analogized with his acts or her acts. If she acts against the law, the waiting period passes, and she has committed a sin in acting against the law. Had the waiting period been her act we would not make it to take place on her like divorce is invalid if it is against the law. “Al-Fadl ibn Shadhan has said, in answer presented by abu ‘Ubayd in the book of divorce that certain people of al-Kalam (theology) has said, ‘When Allah, the most Blessed, the most High, sanctioned divorce with waiting period He did not inform us that whoever divorces without waiting period his divorce is invalid. It is something that men and women obey and do not go out of the house as long as waiting period is not complete. We are only informed about sin. Allah has said, ‘. . . such is the limits set by Allah so do not transgress against them and those who transgress against the limits of Allah has done injustice to himself .’ Is disobedience in divorce like disobedience in waiting period by going out of her house? Do you not say that the nation collectively says that if a divorced woman goes out of her house for days, such days are counted as part of her waiting period even if she has disobeyed Allah? In addition, divorce during Hayd (menses) is counted against divorcee even though he has disobeyed Allah. [Translator’s Note: The words of al-Fadl ibn Shadhan are not translated but the Arabic text is preserved in applicable editions of this book.]"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:2:29",
  "kind": "verse_list"
}