{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:6:2", "titles": {"ar": "كتاب الطلاق ", "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "}}, {"indexed_titles": {"en": "Chapter 32"}, "path": "/books/al-kafi:6:2:32", "titles": {"ar": "باب فِي الَّتِي تَحِيضُ فِي كُلِّ شَهْرَيْنِ وَ ثَلَاثَةٍ", "en": "Chapter 32 – Regaring the woman who menstruates every two months or three"}}], "index": 1626, "local_index": 32, "part_type": "Chapter", "path": "/books/al-kafi:6:2:32", "titles": {"ar": "باب فِي الَّتِي تَحِيضُ فِي كُلِّ شَهْرَيْنِ وَ ثَلَاثَةٍ", "en": "Chapter 32 – Regaring the woman who menstruates every two months or three"}, "verse_count": 1, "verse_start_index": 10680, "verses": [{"index": 10681, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:2:32:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ عَمَّارٍ السَّابَاطِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سُئِلَ عَنْ رَجُلٍ عِنْدَهُ امْرَأَةٌ شَابَّةٌ وَ هِيَ تَحِيضُ كُلَّ شَهْرَيْنِ أَوْ ثَلَاثَةِ أَشْهُرٍ حَيْضَةً وَاحِدَةً كَيْفَ يُطَلِّقُهَا زَوْجُهَا فَقَالَ أَمْرُهَا شَدِيدٌ تُطَلَّقُ طَلَاقَ السُّنَّةِ تَطْلِيقَةً وَاحِدَةً عَلَى طُهْرٍ مِنْ غَيْرِ جِمَاعٍ بِشُهُودٍ ثُمَّ تُتْرَكُ حَتَّى تَحِيضَ ثَلَاثَ حِيَضٍ مَتَى حَاضَتْ فَإِذَا حَاضَتْ ثَلَاثاً فَقَدِ انْقَضَتْ عِدَّتُهَا \nقِيلَ لَهُ وَ إِنْ مَضَتْ سَنَةٌ وَ لَمْ تَحِضْ فِيهَا ثَلَاثَ حِيَضٍ قَالَ إِذَا مَضَتْ سَنَةٌ وَ لَمْ تَحِضْ ثَلَاثَ حِيَضٍ يُتَرَبَّصُ بِهَا بَعْدَ السَّنَةِ ثَلَاثَةَ أَشْهُرٍ ثُمَّ قَدِ انْقَضَتْ عِدَّتُهَا قِيلَ فَإِنْ مَاتَ أَوْ مَاتَتْ فَقَالَ أَيُّهُمَا مَاتَ وَرِثَ صَاحِبُهُ مَا بَيْنَهُ وَ بَيْنَ خَمْسَةَ عَشَرَ شَهْراً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Al Hassan Bin Mahboub, from Hisham Bin Salim, from Ammar Al Sabatany, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘He<sup>asws</sup> was asked about a man with whom was a young woman and she was menstruating every two months or three months with one menstruation, how should her husband divorce her?’ He<sup>asws</sup> said: ‘Her matter is difficult. She would be divorced by a divorce of the Sunnah, with one divorce upon purity, from without copulation, with witnesses. Then she would be left until she menstruates with three menstruations, whenever she menstruates. So when she has menstruated thrice, so she has fulfilled her waiting period’. \nIt was said to him<sup>asws</sup>, ‘And if a year passes by and she has not menstruated therein with three menstruations?’ He<sup>asws</sup> said: ‘When a year passes by and she has not menstruation with three menstruation, she would be observed with after the year, for three months. Then she has fulfilled her waiting period’. It was said, ‘Supposing he dies or she dies?’ So he<sup>asws</sup> said: ‘Whichever of the two dies, the other would inherit, during what is between it and fifteen months’."}]}]}, "index": "al-kafi:6:2:32", "kind": "verse_list"}