{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:6:2",
        "titles": {
          "ar": "كتاب الطلاق ",
          "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 36"
        },
        "path": "/books/al-kafi:6:2:36",
        "titles": {
          "ar": "باب الْمُسْتَرَابَةِ بِالْحَبَلِ",
          "en": "Chapter 35 – The woman of irregular menstruation with the pregnancy"
        }
      }
    ],
    "index": 1637,
    "local_index": 36,
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:2:36",
    "titles": {
      "ar": "باب الْمُسْتَرَابَةِ بِالْحَبَلِ",
      "en": "Chapter 35 – The woman of irregular menstruation with the pregnancy"
    },
    "verse_count": 5,
    "verse_start_index": 10703,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/171)"
        ],
        "index": 10704,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:36:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ سَمِعْتُ أَبَا إِبْرَاهِيمَ ( عليه السلام ) يَقُولُ إِذَا طَلَّقَ الرَّجُلُ امْرَأَتَهُ فَادَّعَتْ حَبَلًا انْتَظَرَ تِسْعَةَ أَشْهُرٍ فَإِنْ وَلَدَتْ وَ إِلَّا اعْتَدَّتْ ثَلَاثَةَ أَشْهُرٍ ثُمَّ قَدْ بَانَتْ مِنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajjaj who said, ",
            "‘I heard Abu Ibrahim<sup>asws</sup> (7th Imam<sup>asws</sup>) saying: ‘When the man divorces his wife, so she waits while pregnant, she should wait for nine months. So if she were to give birth, or else she should wait three months, then she is irrevocably divorced from him’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father and Muhammad ibn ’Isma‘il has narrated from af-Fadf ibn Shadhan from all from ibn abu ‘Umayr from ‘Abd al-Rahman ibn al-Hajj aj who has said the following: “I once heard abu Ibrahim, ‘Alayhi al-Salam, saying, ’If one divorces his wife and she claims to be pregnant, he must wait for nine months if she gives birth, otherwise, she counts a waiting period of three months.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/171)"
        ],
        "index": 10705,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:36:2",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ مُحَمَّدِ بْنِ أَبِي حَمْزَةَ عَنْ مُحَمَّدِ بْنِ حَكِيمٍ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ قُلْتُ لَهُ الْمَرْأَةُ الشَّابَّةُ الَّتِي تَحِيضُ مِثْلُهَا يُطَلِّقُهَا زَوْجُهَا فَيَرْتَفِعُ طَمْثُهَا كَمْ عِدَّتُهَا قَالَ ثَلَاثَةُ أَشْهُرٍ قُلْتُ فَإِنَّهَا ادَّعَتِ الْحَبَلَ بَعْدَ ثَلَاثَةِ أَشْهُرٍ قَالَ عِدَّتُهَا تِسْعَةُ أَشْهُرٍ قُلْتُ فَإِنَّهَا ادَّعَتِ الْحَبَلَ بَعْدَ تِسْعَةِ أَشْهُرٍ قَالَ إِنَّمَا الْحَبَلُ تِسْعَةُ أَشْهُرٍ قُلْتُ تَزَوَّجُ قَالَ تَحْتَاطُ بِثَلَاثَةِ أَشْهُرٍ قُلْتُ فَإِنَّهَا ادَّعَتْ بَعْدَ ثَلَاثَةِ أَشْهُرٍ قَالَ لَا رِيبَةَ عَلَيْهَا تَزَوَّجُ إِنْ شَاءَتْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Ibn Sama’at, from Muhammad Bin Abu Hamza, from Muhammad Bin Hakeem, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘A young woman the likes of whom menstruate, her husband divorces her, and her menstruations are lifted. How much is her waiting period?’ He<sup>asws</sup> said: ‘Three months’. I said, ‘So if she claims to be pregnant after three months?’ He<sup>asws</sup> said: ‘Her waiting period is nine months’. I said, ‘So if she claims to be pregnant after nine months?’ He<sup>asws</sup> said: ‘But rather, the pregnancy is of nine months’. I said, ‘She can marry?’ He<sup>asws</sup> said: ‘She should be precautionary for three months’. I said, ‘So if she claimed after three months?’ He<sup>asws</sup> said: ‘There is no doubt upon her. She can marry if she so desires to’."
          ],
          "en.sarwar": [
            "2. Humayd ibn Ziyad has narrated from ibn Sama‘ah from Muhammad ibn abu Hamzah from Muhammad ibn Hakim who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about the case of a woman who is young and other women like her experience Hayd (menses). She is divorced: then her Hayd stops. How long is her waiting period? He (the Imam) said, ‘It is three months.’ I then asked that she has claimed to be pregnant after three months. He (the Imam) said, ‘Her waiting period is nine months.’ I then said that after nine months she has claimed to be pregnant. He (the Imam) said, ‘Pregnancy is for nine months.’ I then asked, ‘Can she marry?’ He (the Imam) said, ‘She must observe precaution for three months.’ I then said that after three months she has claimed. He (the Imam) said, ‘There is no doubt about her, so she can marry if she wants.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/172)"
        ],
        "index": 10706,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:36:3",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ أَبَانٍ عَنِ ابْنِ حَكِيمٍ عَنْ أَبِي إِبْرَاهِيمَ أَوْ أَبِيهِ ( عليه السلام ) أَنَّهُ قَالَ فِي الْمُطَلَّقَةِ يُطَلِّقُهَا زَوْجُهَا فَتَقُولُ أَنَا حُبْلَى فَتَمْكُثُ سَنَةً قَالَ إِنْ جَاءَتْ بِهِ لِأَكْثَرَ مِنْ سَنَةٍ لَمْ تُصَدَّقْ وَ لَوْ سَاعَةً وَاحِدَةً فِي دَعْوَاهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Al Hassan Bin Ali, from Aban, from Ibn Hakeem, ",
            "(It has been narrated) from Abu Ibrahim<sup>asws</sup> (7th Imam<sup>asws</sup>), or from his<sup>asws</sup> father<sup>asws</sup> having said with regards to the divorced woman, her husband divorces her so she is saying, ‘I am pregnant’. So she remains for a year’, he<sup>asws</sup> said: ‘If she comes with him after more than a year, she would not be ratified, even if it is one hour in her claim’."
          ],
          "en.sarwar": [
            "3. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ ibn Muhammad from al-Hassan ibn Ali from Aban ibn Hakim who has said the following: “About the case of a woman who is divorced and she claims to be pregnant; so she waits for one year, abu Ibrahim or his father, ‘Alayhi al-Salam, has said, ‘If she comes up with such claim after a year it is not accepted even if it is one hour more.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/172)"
        ],
        "index": 10707,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:36:4",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ وَ أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ مُحَمَّدِ بْنِ حَكِيمٍ عَنِ الْعَبْدِ الصَّالِحِ ( عليه السلام ) قَالَ قُلْتُ لَهُ الْمَرْأَةُ الشَّابَّةُ الَّتِي تَحِيضُ مِثْلُهَا يُطَلِّقُهَا زَوْجُهَا فَيَرْتَفِعُ طَمْثُهَا مَا عِدَّتُهَا قَالَ ثَلَاثَةُ أَشْهُرٍ قُلْتُ جُعِلْتُ فِدَاكَ فَإِنَّهَا تَزَوَّجَتْ بَعْدَ ثَلَاثَةِ أَشْهُرٍ فَتَبَيَّنَ بِهَا بَعْدَ مَا دَخَلَتْ عَلَى زَوْجِهَا أَنَّهَا حَامِلٌ قَالَ هَيْهَاتَ مِنْ ذَلِكَ يَا ابْنَ حَكِيمٍ رَفْعُ الطَّمْثِ ضَرْبَانِ إِمَّا فَسَادٌ مِنْ حَيْضَةٍ فَقَدْ حَلَّ لَهَا الْأَزْوَاجُ وَ لَيْسَ بِحَامِلٍ وَ إِمَّا حَامِلٌ فَهُوَ تَسْتَبِينُ فِي ثَلَاثَةِ أَشْهُرٍ لِأَنَّ اللَّهَ عَزَّ وَ جَلَّ قَدْ جَعَلَهُ وَقْتاً يَسْتَبِينُ فِيهِ الْحَمْلُ ",
          "قَالَ قُلْتُ فَإِنَّهَا ارْتَابَتْ قَالَ عِدَّتُهَا تِسْعَةُ أَشْهُرٍ قُلْتُ فَإِنَّهَا ارْتَابَتْ بَعْدَ تِسْعَةِ أَشْهُرٍ قَالَ إِنَّمَا الْحَمْلُ تِسْعَةُ أَشْهُرٍ قُلْتُ فَتَزَوَّجُ قَالَ تَحْتَاطُ بِثَلَاثَةِ أَشْهُرٍ قُلْتُ فَإِنَّهَا ارْتَابَتْ بَعْدَ ثَلَاثَةِ أَشْهُرٍ قَالَ لَيْسَ عَلَيْهَا رِيبَةٌ تَتَزَوَّجُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Ibn Sama’at, and Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Muhammd Bin Hakeem, ",
            "(It has been narrated) from Al-Abd Al-Salih<sup>asws</sup> (7th Imam<sup>asws</sup>), said, ‘I said to him<sup>asws</sup>, ‘The young woman, the likes of whom menstruate, her husband divorces her, so her menstruations are lifted. What is her waiting period?’ He<sup>asws</sup> said: ‘Three months’. I said, ‘May I be sacrificed for you<sup>asws</sup>! Supposing she were to get married after three months, so it is manifested by her after having entered upon her husband, that she is pregnant?’ He<sup>asws</sup> said: ‘Far be it from that, O Ibn Hakeem! The lifting of the menstruations is of two types – either a spoiling of a menstruation, so the husbands are Permissible for her and she is not pregnant, or if she is pregnant it would have become apparent during three months, because Allah<sup>azwj</sup> Mighty and Majestic has Made a time during which the pregnancy becomes apparent’. ",
            "He (the narrator) said, ‘I said, ‘Suppose she is of irregular menstruations?’ He<sup>asws</sup> said: ‘Her waiting period is of nine months’. I said, ‘So if she became irregular after nine months?’ He<sup>asws</sup> said:’ But rather, the pregnancy is of nine months’. I said, ‘So if she were to marry?’ He<sup>asws</sup> said: ‘She should be precautionary for three monts’. I said, ‘So if she is irregular after three months?’ He<sup>asws</sup> said: ‘There is no doubt upon her. She can get married’."
          ],
          "en.sarwar": [
            "4. Humayd ibn Ziyad has narrated from ibn Sama‘ah and Abu Ali al-Ash‘ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan from Muhammad ibn Hakim who has said the following: “I once asked the virtuous servant, ‘Alayhi al-Salam, about the case of a woman who is young and women like her experience Hayd (menses). Her husband divorces her and her Hayd stops. How long is her waiting period? He (the Imam) said, ‘It is three months.’ I then said that she after three months became married and after going with her husband it was found that she is pregnant. He (the Imam) said, ‘This cannot happen, O ibn Hakim. Stoppage of Hayd is because of two reasons; it is because of disorder in Hayd in which case husbands were lawful for her, but she was not pregnant or that she is pregnant in which case it becomes apparent in three months because Allah, most Majestic, most Glorious, has set a time for it in which time pregnancy becomes apparent.’ I then asked, ‘What happens if she has doubts?’ He (the Imam) said, ‘Her ‘Iddah (waiting period) is nine months.’ I then said that she after nine months has doubts. He (the Imam) said, ‘Pregnancy is for nine months only.’ I then asked if she could marry. He (the Imam) said, ‘She must observe precaution for three months.’ I then said that she has doubts after three months.’ He (the Imam) said, ‘There is no doubt in her case, so she can marry if she wants.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/173)"
        ],
        "index": 10708,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:36:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ مُحَمَّدِ بْنِ حَكِيمٍ عَنْ أَبِي عَبْدِ اللَّهِ أَوْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ قُلْتُ لَهُ رَجُلٌ طَلَّقَ امْرَأَتَهُ فَلَمَّا مَضَتْ ثَلَاثَةُ أَشْهُرٍ ادَّعَتْ حَبَلًا قَالَ يُنْتَظَرُ بِهَا تِسْعَةَ أَشْهُرٍ قَالَ قُلْتُ فَإِنَّهَا ادَّعَتْ بَعْدَ ذَلِكَ حَبَلًا قَالَ هَيْهَاتَ هَيْهَاتَ إِنَّمَا يَرْتَفِعُ الطَّمْثُ مِنْ ضَرْبَيْنِ إِمَّا حَبَلٍ بَيِّنٍ وَ إِمَّا فَسَادٍ مِنَ الطَّمْثِ وَ لَكِنَّهَا تَحْتَاطُ بِثَلَاثَةِ أَشْهُرٍ بَعْدُ ",
          "وَ قَالَ أَيْضاً فِي الَّتِي كَانَتْ تَطْمَثُ ثُمَّ يَرْتَفِعُ طَمْثُهَا سَنَةً كَيْفَ تُطَلَّقُ قَالَ تُطَلَّقُ بِالشُّهُودِ "
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Sia, from Yunus, from Muhammad Bin Hakeem, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, or Abu Al-Hassan<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘A man divorces his wife. So when three months pass by, she claims to be pregnant’. He<sup>asws</sup> said: ‘He should wait with her for nine months’. I said, ‘So if she claim after to be pregnant?’ He<sup>asws</sup> Far be it! Far be it! But rather, the lifting of the menstruation is of two types – Either a pregnancy is manifested, or there is a spoiling from the menstruations. But, she should be precautionary by three months afterwards’. ",
            "And he (the narrator) said as well: ‘Regarding the woman who menstruates, then her menstruation is lifted for a year, how would she be divorced?’ He<sup>asws</sup> said: ‘She would be divorced by the witnesses?’"
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn ‘Isa from Yunus from Muhammad ibn Hakim who has said the following: “I once asked abu ‘Abd Allah, or abu al-Hassan, ‘Alayhi al-Salam, about the case of a man who divorces his wife and after three months she claims to be pregnant. He (the Imam) said, ‘There is a waiting for her for nine months.’ I then said, ‘She has claimed to be pregnant after that. He (the Imam) said, ‘This is far from reality. Hayd (menses) stops for two reasons, because of a clear pregnancy or disorder in Hayd. However, she can remain cautious for three months thereafter.’ “He (the narrator) also asked about a woman who experienced Hayd and then it stopped after one year and about how she is divorced. He (the Imam) said, ‘She is divorced in the presence of witnesses.’” (The following paragraph does not seem to be part of Hadith ) Certain ones have said that if he wants to divorce her, she does not experience Hayd (menses) and he has gone to bed with her; he can place her in quarantine. He must hold back from her for three months from the time a divorced woman becomes stranger to her husband, a woman whose Hayd (menses) is straight if pregnancy becomes clear, otherwise, he can divorce her once in the presence of two witnesses. If he leaves her for three months she becomes stranger by one divorce. If he wants to divorce her three times, he can leave her for one month, then go back to her, then divorce her for the second time, then hold back from her three months to place her in quarantine; if pregnancy becomes clear thereafter he only has to divorce her once.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:2:36",
  "kind": "verse_list"
}