{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:6:2",
        "titles": {
          "ar": "كتاب الطلاق ",
          "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 4"
        },
        "path": "/books/al-kafi:6:2:4",
        "titles": {
          "ar": "باب مَنْ طَلَّقَ لِغَيْرِ الْكِتَابِ وَ السُّنَّةِ",
          "en": "Chapter 4 – The one who divorces to other than the Book and the Sunnah"
        }
      }
    ],
    "index": 1605,
    "local_index": 4,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 5"
        },
        "path": "/books/al-kafi:6:2:5",
        "titles": {
          "ar": "باب أَنَّ الطَّلَاقَ لَا يَقَعُ إِلَّا لِمَنْ أَرَادَ الطَّلَاقَ",
          "en": "Chapter 5 – The divorce does not occur except for the one who intended the divorce"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:6:2:3",
        "titles": {
          "ar": "باب أَنَّ النَّاسَ لَا يَسْتَقِيمُونَ عَلَى الطَّلَاقِ إِلَّا بِالسَّيْفِ",
          "en": "Chapter 3 – The people will not be standing straight upon the divorce (matters) except by the sword"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:6:2",
        "titles": {
          "ar": "كتاب الطلاق ",
          "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:2:4",
    "titles": {
      "ar": "باب مَنْ طَلَّقَ لِغَيْرِ الْكِتَابِ وَ السُّنَّةِ",
      "en": "Chapter 4 – The one who divorces to other than the Book and the Sunnah"
    },
    "verse_count": 18,
    "verse_start_index": 10544,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/98)"
        ],
        "index": 10545,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:4:1",
        "refs": {
          "Quran": [
            "/books/quran:5:63"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانٍ عَنْ أَبِي بَصِيرٍ عَنْ عَمْرِو بْنِ رِيَاحٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قُلْتُ لَهُ بَلَغَنِي أَنَّكَ تَقُولُ مَنْ طَلَّقَ لِغَيْرِ السُّنَّةِ أَنَّكَ لَا تَرَى طَلَاقَهُ شَيْئاً فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) مَا أَقُولُهُ بَلِ اللَّهُ عَزَّ وَ جَلَّ يَقُولُهُ أَمَا وَ اللَّهِ لَوْ كُنَّا نُفْتِيكُمْ بِالْجَوْرِ لَكُنَّا شَرّاً مِنْكُمْ لِأَنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ لَوْ لا يَنْهاهُمُ الرَّبَّانِيُّونَ وَ الْأَحْبارُ عَنْ قَوْلِهِمُ الْإِثْمَ وَ أَكْلِهِمُ السُّحْتَ إِلَى آخِرِ الْآيَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, and Ali Bin Ibrahim, from his father, both together from Ahmad Bin Muhammad Bin Abu Nasr, from Aban, from Abu Baseer, from Amro Bin Riyah, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘It has reached me that you<sup>asws</sup> said: ‘The one who divorces to other than the Sunnah, you<sup>asws</sup> do not view his divorce as anything?’ So Abu Ja’far<sup>asws</sup> said: ‘I<sup>asws</sup> am not saying it, but Allah<sup>azwj</sup> Mighty and Majestic is Saying it. By Allah<sup>azwj</sup>! If we<sup>asws</sup> were to issue a Verdict/<span class=\"iTxt\">Fatwas</span> with the inequity we<sup>asws</sup> would be more evil than you all because Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:5#h63\">[5:63]</a> Why do not the Rabbis and the Monks prohibit them from their speaking of what is sinful and their eating of what is unlawfully acquired? </span>– up to the end of the Verse’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad and Ali ibn Ibrahim has narrated from his father from all from Ahmad ibn Muhammad from ibn abu Nasr from Aban from abu Basir from “Amr ibn Riyah who has said the following: “I once said to abu Ja’far, ‘Alayhi al-Salam, ‘Have you said that one who does not divorce according to the book and al -Sunnah his divorce is not valid?’ Abu Ja‘far, ‘Alayhi al-Salam, replied, ‘I have not said so, in fact, Allah, most Majestic, most Glorious, has said it. By Allah, were we to give you fatwas with injustice we would become worse than you; Allah, most Majestic, most Glorious, says, ‘Would that their Rabbis and Ahbar prohibit them from their sinful words and consuming what is filthy. . . .’ ( 5 : 63 )” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/98)"
        ],
        "index": 10546,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:4:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ عَبْدِ الْكَرِيمِ عَنْ عَبْدِ اللَّهِ بْنِ سُلَيْمَانَ الصَّيْرَفِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كُلُّ شَيْ‏ءٍ خَالَفَ كِتَابَ اللَّهِ عَزَّ وَ جَلَّ رُدَّ إِلَى كِتَابِ اللَّهِ عَزَّ وَ جَلَّ وَ السُّنَّةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Abdul Kareem, from Abdullah Bin Suleyman Al Sayrafi, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Everything which opposes the Book of Allah<sup>azwj</sup> Mighty and Majestic is to be returned to the Book of Allah<sup>azwj</sup> Mighty and Majestic, and the Sunnah’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad from ibn abu Nasr from ‘Abd al-Karim from ‘Abd Allah ibn Sulayman al-Sayrafiy who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘Whatever is not according to the book of Allah, most Majestic, most Glorious, is returned to the book of Allah, most Majestic, most Glorious, and al -Sunnah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/99)"
        ],
        "index": 10547,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:4:3",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ مُحَمَّدٍ الْحَلَبِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الرَّجُلُ يُطَلِّقُ امْرَأَتَهُ وَ هِيَ حَائِضٌ قَالَ الطَّلَاقُ عَلَى غَيْرِ السُّنَّةِ بَاطِلٌ قُلْتُ فَالرَّجُلُ يُطَلِّقُ ثَلَاثاً فِي مَقْعَدٍ قَالَ يُرَدُّ إِلَى السُّنَّةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Safwan Bin Yahya, from Abdullah Bin Muskan, from Muhammad Al Halby who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The man divorces his wife and she is menstruating’. He<sup>asws</sup> said : ‘The divorce upon other than the Sunnah is invalid’. I said, ‘So the man divorces three (times) in one sitting?’ He<sup>asws</sup> said: ‘He is to be returned to the Sunnah’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya from ‘Abd Allah ibn Muskan from Muhammad al-Halabiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who divorces his wife when she experiences Hayd (menses). He (the Imam) said, ‘A divorce which is not according to Sunnah is invalid.’ I then asked, ‘What happens if a man divorces his wife three times in one place and time?’ He (the Imam) said, ‘It must be returned to Sunnah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/100)"
        ],
        "index": 10548,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:4:4",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ أَبِي الْمَغْرَاءِ عَنْ سَمَاعَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ مَنْ طَلَّقَ لِغَيْرِ السُّنَّةِ رُدَّ إِلَى كِتَابِ اللَّهِ عَزَّ وَ جَلَّ وَ إِنْ رَغِمَ أَنْفُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad, from Abdullah Bin Jabala, from Abu Al Magra, from Sama’at, from Abu Baseer, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The one who divorces to other than the Sunnah, should be returned to the Book of Allah<sup>azwj</sup> Mighty and Majestic, even if his nose it to be forced’."
          ],
          "en.sarwar": [
            "4. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad from ‘Abd Allah ibn Jabalah from abu al=Mighra’ from Sama‘ah from abu Basir who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘One who does not divorce according to Sunnah must be returned to the book of Allah, most Majestic, most Glorious, even though he may refuse.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/100)"
        ],
        "index": 10549,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:4:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِهِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الطَّلَاقِ إِذَا لَمْ يُطَلِّقْ لِلْعِدَّةِ فَقَالَ يُرَدُّ إِلَى كِتَابِ اللَّهِ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from one of his companions, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the divorce, when he does not divorce to the waiting period. So he<sup>asws</sup> said: ‘Return him to the Book of Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from certain persons of his people from ‘Abd Allah ibn Sinan who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a divorce which is not with waiting period. He (the Imam) said, ‘It must be returned to the book of Allah, most Majestic, most Glorious.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/100)"
        ],
        "index": 10550,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:4:6",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ عَبْدِ الْكَرِيمِ عَنِ الْحَلَبِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ طَلَّقَ امْرَأَتَهُ وَ هِيَ حَائِضٌ فَقَالَ الطَّلَاقُ لِغَيْرِ السُّنَّةِ بَاطِلٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Abdul Kareem, from Al Halby, said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who divorces his wife and she is menstruating’. So he<sup>asws</sup> said: ‘The divorce to other than the Sunnah is invalid’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad from ibn abu Nasr from ‘Abd al-Karim from al-Halabiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who divorces his wife during her experiencing Hayd (menses). He (the Imam) said, ‘It is a divorce which is not according to Sunnah.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/100)"
        ],
        "index": 10551,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:4:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي أَيُّوبَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) مَنْ طَلَّقَ ثَلَاثاً فِي مَجْلِسٍ عَلَى غَيْرِ طُهْرٍ لَمْ يَكُنْ شَيْئاً إِنَّمَا الطَّلَاقُ الَّذِي أَمَرَ اللَّهُ عَزَّ وَ جَلَّ بِهِ فَمَنْ خَالَفَ لَمْ يَكُنْ لَهُ طَلَاقٌ وَ إِنَّ ابْنَ عُمَرَ طَلَّقَ امْرَأَتَهُ ثَلَاثاً فِي مَجْلِسٍ وَ هِيَ حَائِضٌ فَأَمَرَهُ النَّبِيُّ ( صلى الله عليه وآله ) أَنْ يَنْكِحَهَا وَ لَا يَعْتَدَّ بِالطَّلَاقِ",
          "قَالَ وَ جَاءَ رَجُلٌ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنِّي طَلَّقْتُ امْرَأَتِي قَالَ أَ لَكَ بَيِّنَةٌ قَالَ لَا فَقَالَ اعْزُبْ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abu Ayoub, from Muhammad Bin Muslim who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘The one who divorces three (times) in one sitting upon other than purity (menstruation), will not amount to anything. But rather, the divorce is which Allah<sup>azwj</sup> Mighty and Majestic Commanded has with. So the one who opposed, there would be no divorce for him, and that the son of Umar divorced his wife three (divorces) in one sitting, and she was menstruating. So the Prophet<sup>saww</sup> ordered that he should sleep with her and not to exceed with the divorce’.  ",
            "He<sup>asws</sup> said: ‘And a man came over to Amir Al-Momineen<sup>asws</sup>, so he said, ‘O Amir Al-Momineen<sup>asws</sup>! I divorced my wife’. He<sup>asws</sup> said: ‘Is there any proof (two witnesses) for you?’ He said, ‘No’. So he<sup>asws</sup> said: ‘Single’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from abu Ayyub from Muhammad ibn Muslim who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘If one divorces his wife in one place and time three times when she is experiencing Hayd (menses) such divorce does not have any valid effect. A valid divorce is that which Allah, most Majestic, most Glorious, has commanded. Whoever does otherwise it is not a divorce. Ibn ’Umar divorced his wife three times in one place and time when she experienced Hayd (menses). The Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, commanded him to go to bed with her and ignore that kind of divorce.’ He (the Imam) said, ’A man once came to ’Amir al-Mu’minin, ‘Alayhi al-Salam, and said, ‘O ’Amir al-Mu’minin, I have divorced my wife.’ He (the Imam) asked, ‘Do you have witnesses?’ he replied, ‘No, I do not have any witnesses.’ He (the Imam) said, ‘You must disregard it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/101)"
        ],
        "index": 10552,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:4:8",
        "text": [
          "مُحَمَّدُ بْنُ جَعْفَرٍ أَبُو الْعَبَّاسِ عَنْ أَيُّوبَ بْنِ نُوحٍ عَنْ صَفْوَانَ عَنْ يَعْقُوبَ بْنِ شُعَيْبٍ قَالَ سَمِعْتُ أَبَا بَصِيرٍ يَقُولُ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ امْرَأَةٍ طَلَّقَهَا زَوْجُهَا لِغَيْرِ السُّنَّةِ وَ قُلْنَا إِنَّهُمْ أَهْلُ بَيْتٍ وَ لَمْ يَعْلَمْ بِهِمْ أَحَدٌ فَقَالَ لَيْسَ بِشَيْ‏ءٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ja’far Abu Al Abbas, from Ayoub Bin Nuh, from Safwan, from Yaqoub Bin Shuayb who said, ‘I heard Abu Baseer saying, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about a woman whose husband had divorced her to other than the Sunnah, and we said they are a family, and there is no one who knows them. So he<sup>asws</sup> said: ‘It is not with anything’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Ja‘far abu al-‘ Abbas has narrated from Ayyub ibn Nuh from Safwan from Ya’qub ibn Shu’ayb who has said that I heard abu Basir saying the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about the case of a woman who is not divorced according to Sunnah and said that they are a family and no one knows them. He (the Imam) said, ‘It does not have any valid effect.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/101)"
        ],
        "index": 10553,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:4:9",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ مُحَمَّدِ بْنِ أَبِي حَمْزَةَ عَنْ سَعِيدٍ الْأَعْرَجِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ طَلَّقَ ابْنُ عُمَرَ امْرَأَتَهُ ثَلَاثاً وَ هِيَ حَائِضٌ فَسَأَلَ عُمَرُ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَأَمَرَهُ أَنْ يُرَاجِعَهَا فَقُلْتُ إِنَّ النَّاسَ يَقُولُونَ إِنَّمَا طَلَّقَهَا وَاحِدَةً وَ هِيَ حَائِضٌ فَقَالَ فَلِأَيِّ شَيْ‏ءٍ سَأَلَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) إِذَا كَانَ هُوَ أَمْلَكَ بِرَجْعَتِهَا كَذَبُوا وَ لَكِنَّهُ طَلَّقَهَا ثَلَاثاً فَأَمَرَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَنْ يُرَاجِعَهَا ثُمَّ قَالَ إِنْ شِئْتَ فَطَلِّقْ وَ إِنْ شِئْتَ فَأَمْسِكْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Muhammad Bin Abu Hamza, from Saeed Al A’raj who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Ibn Umar divorced his wife three (times) and she was menstruating. So Umar asked Rasool-Allah<sup>saww</sup>, so he<sup>saww</sup> ordered him that he should return to her’. So I said, ‘The people are saying that, rather his divorce was one divorce, and she was menstruating’. So he<sup>asws</sup> said: ‘So for which thing did he ask Rasool-Allah<sup>saww</sup>, when he had the control with returning to her? They are lying! But he divorced her three (times), so Rasool-Allah<sup>saww</sup> ordered him that he should return to her, then said: ‘If you so desire, so divorce, and if you so desire, so keep’."
          ],
          "en.sarwar": [
            "9. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id, from al-Nadr ibn Suwayd from Muhammad ibn abu Hamzah from Sa‘id al-A’raj who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, state this Hadith. ‘Ibn ‘Umar divorced his wife three times at the same place and time when she experienced Hayd (menses). He asked the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and he commanded him to go back to his wife.’ I then said, ‘People say that he divorced only once when she experienced Hayd (menses).’ He (the Imam) asked, ‘What for, then, did he ask the Messenger of Allah if he was able to go back to her? They speak a lie. He divorced three times at the same place and time, then the Messenger of Allah commanded him to go back to her and then divorce her if he wanted or keep her if he so willed.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/102)"
        ],
        "index": 10554,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:4:10",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُوسَى بْنِ بَكْرٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّهُ سُئِلَ عَنِ امْرَأَةٍ سَمِعَتْ أَنَّ رَجُلًا طَلَّقَهَا وَ جَحَدَ ذَلِكَ أَ تُقِيمُ مَعَهُ قَالَ نَعَمْ فَإِنَّ طَلَاقَهُ بِغَيْرِ شُهُودٍ لَيْسَ بِطَلَاقٍ وَ الطَّلَاقُ لِغَيْرِ الْعِدَّةِ لَيْسَ بِطَلَاقٍ وَ لَا يَحِلُّ لَهُ أَنْ يَفْعَلَ فَيُطَلِّقَهَا بِغَيْرِ شُهُودٍ وَ لِغَيْرِ الْعِدَّةِ الَّتِي أَمَرَ اللَّهُ عَزَّ وَ جَلَّ بِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Musa Bin Bakr, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having been asked about a woman who heard that a man divorced her, and he denied that. Should she stay with him?’ He<sup>asws</sup> said: ‘Yes, for a divorce without witnesses is not a divorce, and the divorce to other than the waiting period is not a divorce, it is not Permissible for him that he should do so by divorcing her without witnesses and to other than the waiting period which Allah<sup>azwj</sup> Mighty and Majestic has Commanded with’."
          ],
          "en.sarwar": [
            "10. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Musa ibn Bakr from Zurarah who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, was asked about the case of a woman who hears that the man has divorced her but he denies it: if she can stay with him. He (the Imam) said, ‘Yes, because divorce without witness is not a divorce, also divorce without waiting period is not a divorce. It is not lawful to divorce without witnesses and without waiting period that Allah, most Majestic, most Glorious, has commanded to do.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/102)"
        ],
        "index": 10555,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:4:11",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ زُرَارَةَ وَ مُحَمَّدِ بْنِ مُسْلِمٍ وَ بُكَيْرِ بْنِ أَعْيَنَ وَ بُرَيْدٍ وَ فُضَيْلٍ وَ إِسْمَاعِيلَ الْأَزْرَقِ وَ مَعْمَرِ بْنِ يَحْيَى عَنْ أَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُمَا قَالَا إِذَا طَلَّقَ الرَّجُلُ فِي دَمِ النِّفَاسِ أَوْ طَلَّقَهَا بَعْدَ مَا يَمَسُّهَا فَلَيْسَ طَلَاقُهُ إِيَّاهَا بِطَلَاقٍ وَ إِنْ طَلَّقَهَا فِي اسْتِقْبَالِ عِدَّتِهَا طَاهِراً مِنْ غَيْرِ جِمَاعٍ وَ لَمْ يُشْهِدْ عَلَى ذَلِكَ رَجُلَيْنِ عَدْلَيْنِ فَلَيْسَ طَلَاقُهُ إِيَّاهَا بِطَلَاقٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Umar Bin Azina, from Zurara, and Muhammad Bin Muslim, and Bukeyr Bin Ayn, and Bureyd, and Fuzayl, and Ismail Al Azraq, and Ma’mar Bin Yahya, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup> both of them having said: ‘When the man divorces during blood of the childbirth, or divorces her after having touched her, so his divorcing her is not with a (valid) divorce, and if he divorces her during the commencement of her waiting period, (when she is) clean from other than copulation, and two just witnesses did not witness upon that, so his divorcing her is not a (valid) divorce’."
          ],
          "en.sarwar": [
            "11. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from ibn ‘Udhaynah from Zurarah and Muhammad ibn Muslim and Bukayr ibn ’A‘yan and Burayd and Fudayl and ’Isma’il al-Azraq and Mu’ammar ibn Yahya from abu Ja‘far and abu ‘Abd Allah, ‘Alayhim al-Salam, who has said the following: “When a man during a woman’s experiencing blood discharge because of childbirth or after going to bed with her divorces, such divorce is not a valid divorce. A divorce at such time when commencing waiting period is possible and valid, that it is in a menses-free time but without the presence of two just witnesses, such divorce also is not a valid divorce.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/102)"
        ],
        "index": 10556,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:4:12",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي إِبْرَاهِيمَ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ يُطَلِّقُ امْرَأَتَهُ فِي طُهْرٍ مِنْ غَيْرِ جِمَاعٍ ثُمَّ يُرَاجِعُهَا مِنْ يَوْمِهِ ثُمَّ يُطَلِّقُهَا تَبِينُ مِنْهُ بِثَلَاثِ تَطْلِيقَاتٍ فِي طُهْرٍ وَاحِدٍ فَقَالَ خَالَفَ السُّنَّةَ قُلْتُ فَلَيْسَ يَنْبَغِي لَهُ إِذَا هُوَ رَاجَعَهَا أَنْ يُطَلِّقَهَا إِلَّا فِي طُهْرٍ آخَرَ قَالَ نَعَمْ قُلْتُ حَتَّى يُجَامِعَ قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Is’haq Bin Ammar, ",
            "(It has been narrated) from Abu Ibrahim<sup>asws</sup> (7th Imam<sup>asws</sup>), said, ‘I asked him<sup>asws</sup> about a man who divorced his wife during (her being) clean without copulating with her. Then he returned to her from that day. Then divorced her, manifesting from it with three divorces during one purity’. So he<sup>asws</sup> said: ‘Opposite to the Sunnah’. I said, ‘So is it not befitting for him when he returns to her that he should divorce her except during another purity?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘Until he sleeps with her?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            "12. Abu Ali al-Ash‘ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from Ishaq ibn ‘Ammar who has said the following: “I once asked abu al-Hassan, (Musa), ‘Alayhi al-Salam, about the case of a man who divorces his wife in a menses-free period during which he has not gone to bed with her. He then goes back to her on the same day, then divorces her: if it becomes irrevocable with three divorces during one menses-free period. He (the Imam) said, ‘He has opposed the Sunnah.’ I then asked, ‘Is it necessary after going back to his wife to divorce her in another menses-free period of time?’ He (the Imam) replied, ‘Yes, it is necessary.’ I said, ‘So that he can go to bed with her?’ He (the Imam) replied, ‘Yes, he can do so.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/103)"
        ],
        "index": 10557,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:4:13",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ طَلَّقَ بِغَيْرِ شُهُودٍ فَلَيْسَ بِشَيْ‏ءٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail Bin Bazie, from Muhammad Bin Al Fuzayl, from Abu Al Sabbah Al Kinany, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who divorces without witnesses, so it is not with anything’."
          ],
          "en.sarwar": [
            "13. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ’Isma‘il ibn Bazi‘ from Muhammad ibn al- Fudayl from abu al-Sabbah al-Kinaniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If one divorces his wife without witnesses it does not become of any valid effect.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/103)"
        ],
        "index": 10558,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:4:14",
        "text": [
          "سَهْلٌ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ عُمَرَ بْنِ يَزِيدَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قَدِمَ رَجُلٌ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) بِالْكُوفَةِ فَقَالَ إِنِّي طَلَّقْتُ امْرَأَتِي بَعْدَ مَا طَهُرَتْ مِنْ مَحِيضِهَا قَبْلَ أَنْ أُجَامِعَهَا فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَشْهَدْتَ رَجُلَيْنِ ذَوَيْ عَدْلٍ كَمَا أَمَرَ اللَّهُ عَزَّ وَ جَلَّ فَقَالَ لَا فَقَالَ اذْهَبْ فَإِنَّ طَلَاقَكَ لَيْسَ بِشَيْ‏ءٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl, from Ahmad Bin Muhammad, from Muhammad Bin Sama’at, from Umar Bin Yazeed, from Muhammad Bin Muslim who said, ",
            "‘A man came over to Amir Al-Momineen<sup>asws</sup> at Al-Kufa, so he said, ‘I divorced my wife after she was clean from her menstruation, before I slept with her’. So Amir Al-Momineen<sup>asws</sup> said: ‘Did you get two just witnesses just as Allah<sup>azwj</sup> Mighty and Majestic had Commanded?’ So he said, ‘No’. So he<sup>asws</sup> said: ‘Go, for your divorce is not with anything’."
          ],
          "en.sarwar": [
            "14. Sahl has narrated from Ahmad ibn Muhammad from Muhammad ibn Sama‘ah from ‘Umar ibn Yazid from Muhammad ibn Muslim who has said the following: “Once, a man in al-Kufah came to ’Amir al-Mu’minin, ‘Alayhi al-Salam, and said, ‘I have divorced my wife after she became clean from her Hayd (menses) and before I went to bed with her.’ ’Amir al- Mu’minin asked, ‘Did you ask two just men to witness as Allah, most Majestic, most Glorious, has commanded to do?’ He replied, ‘No, I did not do so.’ He (the Imam) said, ‘Your divorce in not valid.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/103)"
        ],
        "index": 10559,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:4:15",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ طَلَّقَ امْرَأَتَهُ ثَلَاثاً فِي مَجْلِسٍ وَ هِيَ حَائِضٌ فَلَيْسَ بِشَيْ‏ءٍ وَ قَدْ رَدَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) طَلَاقَ عَبْدِ اللَّهِ بْنِ عُمَرَ إِذَا طَلَّقَ امْرَأَتَهُ ثَلَاثاً وَ هِيَ حَائِضٌ فَأَبْطَلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) ذَلِكَ الطَّلَاقَ. ",
          "وَ قَالَ كُلُّ شَيْ‏ءٍ خَالَفَ كِتَابَ اللَّهِ عَزَّ وَ جَلَّ فَهُوَ رَدٌّ إِلَى كِتَابِ اللَّهِ عَزَّ وَ جَلَّ وَ قَالَ لَا طَلَاقَ إِلَّا فِي عِدَّةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said; ‘The one who divorces his wife three (times) in one sitting, and she is menstruating, so it is invalid, and Rasool-Allah<sup>saww</sup> had rejected a divorce of Abdullah Bin Umar when he divorced his wife three (times) and she was menstruating. So Rasool-Allah<sup>saww</sup> invalidated that divorce’. ",
            "And he<sup>asws</sup> said: ‘Everything which opposes the Book of Allah<sup>azwj</sup> Mighty and Majestic, so it is returned to the Book of Allah<sup>azwj</sup> Mighty and Majestic’. And he<sup>asws</sup> said: ‘There is no divorce except in a waiting period’."
          ],
          "en.sarwar": [
            "15. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If one divorces his wife three times at the same place and time it does not become of any valid effect. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, rejected the divorce of ‘Abd Allah ibn ‘Umar when he divorced his wife with three divorces when she experienced Hayd (menses). The Messenger of Allah called it an invalid divorce saying, ‘Whatever is against the book of Allah, most Majestic, most Glorious, must return to the book of Allah, most Majestic, most Glorious.’ He (the Messenger of Allah) said, ‘Divorce without waiting period is not valid.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/104)"
        ],
        "index": 10560,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:4:16",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ سَعِيدٍ الْأَعْرَجِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي سَأَلْتُ عَمْرَو بْنَ عُبَيْدٍ عَنْ طَلَاقِ ابْنِ عُمَرَ فَقَالَ طَلَّقَهَا وَ هِيَ طَامِثٌ وَاحِدَةً قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَ فَلَا قُلْتُمْ لَهُ إِذَا طَلَّقَهَا وَاحِدَةً وَ هِيَ طَامِثاً كَانَتْ أَوْ غَيْرَ طَامِثٍ فَهُوَ أَمْلَكُ بِرَجْعَتِهَا قَالَ قَدْ قُلْتُ لَهُ ذَلِكَ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كَذَبَ عَلَيْهِ لَعْنَةُ اللَّهِ بَلْ طَلَّقَهَا ثَلَاثاً فَرَدَّهَا النَّبِيُّ ( صلى الله عليه وآله ) فَقَالَ أَمْسِكْ أَوْ طَلِّقْ عَلَى السُّنَّةِ إِنْ أَرَدْتَ أَنْ تُطَلِّقَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Muhammad Bin Ismail Bin Bazie, from Ali Bin Al Noman, from Saeed Al A’araj who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I asked Amro Bin Ubeyd about divorce of Ibn Umar, so he said, ‘He divorced her and she was with one menstruation’. Abu Abdullah<sup>asws</sup> said: ‘So did you not say to him, ‘When he divorced her and she was with a menstruation, or she was without a menstruation, so he had control with returning to her?’ He said, ‘I had said that to him’. So Abu Abdullah<sup>asws</sup> said: ‘He has lied against him, may Allah<sup>azwj</sup> Curse him. But he divorced her three (times), so the Prophet<sup>saww</sup> rejected it, so he<sup>saww</sup> said: ‘Keep or divorce upon the Sunnah, if you intend to divorce’."
          ],
          "en.sarwar": [
            "16. Abu Ali al-Ash‘ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Muhammad ibn ’Isma‘il ibn Bazi‘ from Ali ibn al- Nu’man from Sa‘id al-A’raj who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘I asked ‘Amr ibn ‘Ubayd about the divorce of ‘Abd Allah ibn ‘Umar and he said, “He divorced her once when she experienced Hayd (menses).”’ Abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘Why did you not say to him, “If he divorced her once during her experiencing Hayd (menses) or when she did not experience Hayd (menses), he had more authority to go back to his wife.’ I said, ‘I did say so.’ He (the Imam) then said, ‘He has not spoken the truth, may Allah condemn him. He divorced three times but the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, rejected it and said, “You can keep your wife or divorce her according to Sunnah if you wanted.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/104)"
        ],
        "index": 10561,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:4:17",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ بُكَيْرٍ وَ غَيْرِهِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كُلُّ طَلَاقٍ لِغَيْرِ الْعِدَّةِ فَلَيْسَ بِطَلَاقٍ أَنْ يُطَلِّقَهَا وَ هِيَ حَائِضٌ أَوْ فِي دَمِ نِفَاسِهَا أَوْ بَعْدَ مَا يَغْشَاهَا قَبْلَ أَنْ تَحِيضَ فَلَيْسَ طَلَاقُهَا بِطَلَاقٍ فَإِنْ طَلَّقَهَا لِلْعِدَّةِ أَكْثَرَ مِنْ وَاحِدَةٍ فَلَيْسَ الْفَضْلُ عَلَى الْوَاحِدَةِ بِطَلَاقٍ وَ إِنْ طَلَّقَهَا لِلْعِدَّةِ بِغَيْرِ شَاهِدَيْ عَدْلٍ فَلَيْسَ طَلَاقُهُ بِطَلَاقٍ وَ لَا تَجُوزُ فِيهِ شَهَادَةُ النِّسَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Bukeyr, and someone else, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Every divorce without a waiting period, is not with a (valid) divorce, if he divorces her and she is menstruating, or in blood of childbirth, or after he had overwhelmed (copulated) with her before she menstruated, so his divorce is not a (valid) divorce. So if he were to divorce her to the waiting period more than once, so there is no preference (of the second one) over the one with a divorce; and if he divorces her to the waiting period without two just witnesses, so his divorce is not with a (valid) divorce, nor is there allowed with regards to it, the testimony of the women’."
          ],
          "en.sarwar": [
            "17. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ‘Udhaynah from Bukayr and others who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘Every divorce without waiting period is not a valid divorce, or divorce during her experiencing Hayd (menses), Nifas (childbirth), after going to bed with her before her Hayd (menses), such divorces are not valid. If one divorces with waiting period more than once the extra one does not have any valid effect. If one divorces with waiting period without just witnesses, it also is not a divorce and women’s witnessing is not sufficient.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/104)"
        ],
        "index": 10562,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:4:18",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كُنْتُ عِنْدَهُ إِذْ مَرَّ بِهِ نَافِعٌ مَوْلَى ابْنِ عُمَرَ فَقَالَ لَهُ أَبُو جَعْفَرٍ ( عليه السلام ) أَنْتَ الَّذِي تَزْعُمُ أَنَّ ابْنَ عُمَرَ طَلَّقَ امْرَأَتَهُ وَاحِدَةً وَ هِيَ حَائِضٌ فَأَمَرَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عُمَرَ أَنْ يَأْمُرَهُ أَنْ يُرَاجِعَهَا قَالَ نَعَمْ فَقَالَ لَهُ كَذَبْتَ وَ اللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ عَلَى ابْنِ عُمَرَ أَنَا سَمِعْتُ ابْنَ عُمَرَ يَقُولُ طَلَّقْتُهَا عَلَى عَهْدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ثَلَاثاً فَرَدَّهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَلَيَّ وَ أَمْسَكْتُهَا بَعْدَ الطَّلَاقِ فَاتَّقِ اللَّهَ يَا نَافِعُ وَ لَا تَرْوِ عَلَى ابْنِ عُمَرَ الْبَاطِلَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, form his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I was in his<sup>asws</sup> presence when Nafau, a slave of Ibn Umar passed by. So (I recalled) Abu Ja’far<sup>asws</sup> said to him: ‘Are you the one who is alleging that Ibn Umar divorced his wife once and she was menstruating, so Rasool-Allah<sup>saww</sup> ordered Umar that he should instruct him to return to her?’ He said, ‘Yes’. So he<sup>asws</sup> said to him: ‘You lie, by the One<sup>azwj</sup> there is not God except for Him<sup>azwj</sup>, upon Ibn Umar. I<sup>asws</sup> heard Ibn Umar saying: ‘I divorced her in the era of Rasool-Allah<sup>saww</sup> three (times), so Rasool-Allah<sup>saww</sup> rejected it upon me, and I kept her after the divorce. Therefore, fear Allah<sup>azwj</sup>, O Nafau, and do not report falsehood upon Ibn Umar!’"
          ],
          "en.sarwar": [
            "18. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ‘Udhaynah from Zurarah who has said the following: “Once, I was with abu Ja‘far, ‘Alayhi al-Salam, when, Nafi’ Mawla’ ibn ’Umar came to visit him (the Imam). Abu Ja’far, ‘Alayhi al-Salam, asked him, ‘Are you the one who believes that ibn ‘Umar divorced his wife once during her experiencing Hayd (menses) and the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, commanded ‘Umar to ask him to go back to his wife?’ He replied, ‘Yes, that is correct.’ He (the Imam) said, ‘You have spoken a lie against ibn ‘Umar, by Allah, besides whom no one deserves worship. I heard ibn ‘Umar saying, “I divorced her during the time of the Messenger of Allah, three divorces but the Messenger of Allah reversed it on me and I kept her after divorce.” O Nafi‘ you must have fear of Allah and do not narrate falsehood against ibn ‘Umar.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:2:4",
  "kind": "verse_list"
}