{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:6:2",
        "titles": {
          "ar": "كتاب الطلاق ",
          "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 40"
        },
        "path": "/books/al-kafi:6:2:40",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب مَا لِلْمُطَلَّقَةِ</span> الَّتِي لَمْ يُدْخَلْ بِهَا مِنَ الصَّدَاقِ",
          "en": "Chapter 39 – What is for the divorced woman who has not been touched with, from the dower"
        }
      }
    ],
    "index": 1641,
    "local_index": 40,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 41"
        },
        "path": "/books/al-kafi:6:2:41",
        "titles": {
          "ar": "باب مَا يُوجِبُ الْمَهْرَ كَمَلًا",
          "en": "Chapter 40 – What Obligates the complete dower"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 39"
        },
        "path": "/books/al-kafi:6:2:39",
        "titles": {
          "ar": "باب مُتْعَةِ الْمُطَلَّقَةِ",
          "en": "Chapter 38 – Providing for the divorced woman"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:6:2",
        "titles": {
          "ar": "كتاب الطلاق ",
          "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:2:40",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب مَا لِلْمُطَلَّقَةِ</span> الَّتِي لَمْ يُدْخَلْ بِهَا مِنَ الصَّدَاقِ",
      "en": "Chapter 39 – What is for the divorced woman who has not been touched with, from the dower"
    },
    "verse_count": 14,
    "verse_start_index": 10721,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/179)"
        ],
        "index": 10722,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:40:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َبُو عَلِيٍّ الْأَشْعَرِيُّ</span> عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ وَ أَبُو الْعَبَّاسِ مُحَمَّدُ بْنُ جَعْفَرٍ الرَّزَّازُ عَنْ أَيُّوبَ بْنِ نُوحٍ وَ حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ جَمِيعاً عَنْ صَفْوَانَ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا طَلَّقَ الرَّجُلُ امْرَأَتَهُ قَبْلَ أَنْ يَدْخُلَ بِهَا فَقَدْ بَانَتْ مِنْهُ وَ تَتَزَوَّجُ إِنْ شَاءَتْ مِنْ سَاعَتِهَا وَ إِنْ كَانَ فَرَضَ لَهَا مَهْراً فَلَهَا نِصْفُ الْمَهْرِ وَ إِنْ لَمْ يَكُنْ فَرَضَ لَهَا مَهْراً فَلْيُمَتِّعْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, and Abu Al Abbas Muhammad Bin Ja’far Al Razzaz, from Ayoub Bin Nuh, and Humeyd Bin Ziyad, from Ibn Sama’at, altogether from Safwan, from Ibn Muskan, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the man divorces his woman before he sleeps with her, so she is irrevocably divorced from him, and she can marry if she so desires to from that very moment; and if a dower was Obligated for her, so for her would be half the dower; and if a dower was not Obligated for her, so let him provide for her’."
          ],
          "en.sarwar": [
            "1. Abu Ali al-Ash‘ariy has narrated from Muhammad ibn ‘Abd al-Jabbar and al-‘Abbas Muhammad ibn Ja‘far al-Razzaz from Ayyub ibn Nuh and Humayd ibn Ziyad has narrated from ibn Sama‘ah all from Safwan from ibn Muskan from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If a man divorces his wife before going to bed with her, she becomes stranger to him and she can marry if she wants in the same hour after divorce. If mahr (dower) is set, she deserves one-half of it but if mahr (dower) is not set he must benefit her.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/180)"
        ],
        "index": 10723,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:40:2",
        "refs": {
          "Mentions": [
            "/books/quran:2:237"
          ]
        },
        "text": [
          "صَفْوَانُ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ وَ عَلِيٌّ عَنْ أَبِيهِ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ جَمِيعاً عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ إِنْ طَلَّقْتُمُوهُنَّ مِنْ قَبْلِ أَنْ تَمَسُّوهُنَّ وَ قَدْ فَرَضْتُمْ لَهُنَّ فَرِيضَةً فَنِصْفُ ما فَرَضْتُمْ إِلَّا أَنْ يَعْفُونَ أَوْ يَعْفُوَا الَّذِي بِيَدِهِ عُقْدَةُ النِّكاحِ قَالَ هُوَ الْأَبُ أَوِ الْأَخُ أَوِ الرَّجُلُ يُوصَى إِلَيْهِ وَ الَّذِي يَجُوزُ أَمْرُهُ فِي مَالِ الْمَرْأَةِ فَيَبْتَاعُ لَهَا فَتُجِيزُ فَإِذَا عَفَا فَقَدْ جَازَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Safwan, from Ibn Muskan, from Abu Baseer and Ali from his father, and a number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from Sama’at, altogether, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h237\">[2:237]</a> And if you divorce them before you have touched them and you have appointed for them a portion, then (pay to them) half of what you have appointed, unless they relinquish or he should relinquish in whose hand is the marriage tie</span>. He<sup>asws</sup> said: ‘He is the father, or the brother, or the man who has been bequeathed for it and his instructions are allowed with regards to the wealth of the woman, so he should provide for her. So it would be allowed, when he excuses in accordance to what is allowed’."
          ],
          "en.sarwar": [
            "2. Safwan has narrated from in from abu Basir and Ali has narrated from his father and A number of our people have narrated from Ahmad ibn Muhammad from ibn Khalid f, ‘Uthman ibn ‘Isa from Sama‘ah all from abu ‘Abd Allah, ‘Alayhi al-Salam, who has said the following: “The following are the words of Allah, most Majestic, most Glorious. ‘If you divorce them before you touch them and if you have set mahr (dower) for them that must be paid them one-half of it is payable unless it is waved or one who has authority in the matter of marriage waves it.’ <a href=\"/#/books/quran:2#h237\">[2:237]</a> Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Of people with such authority is the father, or brother or the executor of the will and those whose command in the assets of the woman is effective to buy certain things and she authorizes, if such person waves, then it is permissible. 5 ” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/180)"
        ],
        "index": 10724,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:40:3",
        "refs": {
          "Mentions": [
            "/books/quran:2:237"
          ]
        },
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ طَلَّقَ امْرَأَتَهُ قَبْلَ أَنْ يَدْخُلَ بِهَا قَالَ عَلَيْهِ نِصْفُ الْمَهْرِ إِنْ كَانَ فَرَضَ لَهَا شَيْئاً وَ إِنْ لَمْ يَكُنْ فَرَضَ لَهَا فَلْيُمَتِّعْهَا عَلَى نَحْوِ مَا يُمَتَّعُ مِثْلُهَا مِنَ النِّسَاءِ ",
          "قَالَ وَ قَالَ فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ أَوْ يَعْفُوَا الَّذِي بِيَدِهِ عُقْدَةُ النِّكاحِ قَالَ هُوَ الْأَبُ وَ الْأَخُ وَ الرَّجُلُ يُوصَى إِلَيْهِ وَ الرَّجُلُ يَجُوزُ أَمْرُهُ فِي مَالِ الْمَرْأَةِ فَيَبِيعُ لَهَا وَ يَشْتَرِي لَهَا فَإِذَا عَفَا فَقَدْ جَازَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who divorces his wife before he sleeps with her. He<sup>asws</sup> said: ‘Upon him is half the dower, if something was Obligated for her; and if it was not Obligated for her, so let him provide for her approximately to what he would provide for the likes of her from the women’.",
            "He (the narrator) said, ‘And he<sup>asws</sup> said regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h237\">[2:237]</a> or he should relinquish in whose hand is the marriage tie</span>. He<sup>asws</sup> said: ‘He is the father, or the brother, and the man who has been bequeathed to it, and the man whose instructions are allowed in the wealth of the woman, so he buys for her and he sells for her. So when he excuses, so it is allowed’."
          ],
          "en.sarwar": [
            "3. Ali has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “About the case of a man who divorces his wife before going to bed with her, abu ‘Abd Allah, ‘Alayhi al-Salam, has stated this Hadith. ‘He owes to her one-half of mahr (dower) if he has set something for her; but if he has not set anything for her he must benefit her like the benefits that similar women receive. 5 The words of Allah, most Majestic, most Glorious, say, ‘. . . or it is waived by the one who has authority in the matters of marriage. . .’ He (the Imam) said, ‘Of such people is father, or a brother or the executor of the will or a man who is authorized in dealing with the assets of the woman to buy for her and he buys if he waves, it then is effective. 555 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/181)"
        ],
        "index": 10725,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:40:4",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ بُكَيْرٍ عَنْ عُبَيْدِ بْنِ زُرَارَةَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) رَجُلٌ تَزَوَّجَ امْرَأَةً عَلَى مِائَةِ شَاةٍ ثُمَّ سَاقَ إِلَيْهَا الْغَنَمَ ثُمَّ طَلَّقَهَا قَبْلَ أَنْ يَدْخُلَ بِهَا وَ قَدْ وَلَدَتِ الْغَنَمُ قَالَ إِنْ كَانَتِ الْغَنَمُ حَمَلَتْ عِنْدَهُ رَجَعَ بِنِصْفِهَا وَ نِصْفِ أَوْلَادِهَا وَ إِنْ لَمْ يَكُنِ الْحَمْلُ عِنْدَهُ رَجَعَ بِنِصْفِهَا وَ لَمْ يَرْجِعْ مِنَ الْأَوْلَادِ بِشَيْ‏ءٍ .",
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ عُبَيْدِ بْنِ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مِثْلَهُ إِلَّا أَنَّهُ قَالَ سَاقَ إِلَيْهَا غَنَماً وَ رَقِيقاً فَوَلَدَتِ الْغَنَمُ وَ الرَّقِيقُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Ibn Abu Umeyr, from Ibn Bukeyr, from Ubeyd Bin Zurara who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘A man who married a woman upon one hundred sheep, then ushers the sheep to her. Then he divorces her before sleeping with her, and the sheep have given birth’. He<sup>asws</sup> said: ‘If the sheep were impregnated when they were with him, half of these would be returned with half of the children; and they were not impregnated when they were with him, half of these (sheep) would be returned and nothing from the children would be returned’.",
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr, from Ubeyd Bin Zurara, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, similar to it except that he said, ‘He ushered to her sheep and a slave. So the sheep and the slave gave birth’."
          ],
          "en.sarwar": [
            "4. Ali has narrated from his father from ibn abu ‘Umayr from ibn Bukayr from ‘Ubayd ibn Zurarah who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who marries a woman and sets a mahr (dower) of one hundred sheep. He then delivers them to her, then divorces her before going to bed with her and the sheep have given birth to their young. He (the Imam) said, ‘If the sheep had become pregnant with him she must return one-half of them and one-half of the young ones; but if they did not become pregnant with him she must return one-half of the sheep but not the young ones. 555 Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from ibn Bukayr from ‘Ubayd ibn Zurarah who has narrated the following: “He has narrated a similar Hadith from abu ‘Abd Allah, ‘Alayhi al-Salam, except that he has said, ‘He delivered sheep and slaves, then sheep and slaves gave birth. 555 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/181)"
        ],
        "index": 10726,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:40:5",
        "text": [
          "مُحَمَّدٌ عَنْ أَحْمَدَ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ بُكَيْرٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي الرَّجُلِ يَتَزَوَّجُ الْمَرْأَةَ الرَّتْقَاءَ أَوِ الْجَارِيَةَ الْبِكْرَ فَيُطَلِّقُهَا سَاعَةً تُدْخَلُ عَلَيْهِ فَقَالَ هَاتَانِ يَنْظُرُ إِلَيْهِمَا مَنْ يُوثَقُ بِهِ مِنَ النِّسَاءِ فَإِنْ كُنَّ عَلَى حَالِهِنَّ كَمَا أُدْخِلْنَ عَلَيْهِ فَإِنَّ لَهُنَّ نِصْفَ الصَّدَاقِ الَّذِي فَرَضَ لَهَا وَ لَا عِدَّةَ عَلَيْهَا مِنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad, from Ahmad, from Ibn Mahboub, from Ibn Bukeyr, from Ali Bin Raib, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the man who married the woman, the non-virgin or the virgin slave girl, so he divorced her the moment she came over to him. So he<sup>asws</sup> said: ‘This is where she would be examined by the reliable ones from the women. So if she was upon her state just as she had come over to him, so for her would be half the dower which was Obligated for her, and there is no waiting period for her from it’."
          ],
          "en.sarwar": [
            "5. Muhammad has narrated from Ahmad from ibn Mahbub, from ibn Bukayr from ibn Ri’ab from Zurarah who has said the following: “About the case of a man who marries a non-virgin woman or a virgin one and divorces her in the hour that she enters his house, abu Ja‘far, ‘Alayhi al-Salam, has stated this Hadith. ‘Trustworthy women must examine them and if they find such woman with the condition before she came to him then she deserves one-half of the mahr (dower) which is set for her and she does not need to count any waiting period.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/181)"
        ],
        "index": 10727,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:40:6",
        "text": [
          "مُحَمَّدٌ عَنْ أَحْمَدَ عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ تَزَوَّجَ امْرَأَةً بِأَلْفِ دِرْهَمٍ فَأَعْطَاهَا عَبْداً لَهُ آبِقاً وَ بُرْدَ حِبَرَةٍ بِالْأَلْفِ الَّتِي أَصْدَقَهَا فَقَالَ إِذَا رَضِيَتْ بِالْعَبْدِ وَ كَانَ قَدْ عَرَفَتْهُ فَلَا بَأْسَ إِذَا هِيَ قَبَضَتِ الثَّوْبَ وَ رَضِيَتْ بِالْعَبْدِ قُلْتُ فَإِنْ طَلَّقَهَا قَبْلَ أَنْ يَدْخُلَ بِهَا قَالَ لَا مَهْرَ لَهَا وَ تَرُدُّ عَلَيْهِ خَمْسَمِائَةِ دِرْهَمٍ وَ يَكُونُ الْعَبْدُ لَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad, from Ahmad, from Ibn Mahboub, from Jameel Bin Salih, from Al Fuzayl Bin Yasaar who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who married a woman by a thousand Dirhams. So he gives her a fugitive slave of his, and a garment, a veil, with a thousand (Dirhams) which is her dower. So he<sup>asws</sup> said: ‘When she is pleased with the slave, and he had recognised it, so there is no problem when she takes possession of the clothes, and she is pleased with the slave’. I said, ‘Supposing he were to divorce her before he sleeps with her?’ He<sup>asws</sup> said: ‘There is no dower for her, and she would return to him five hundred Dirhams, and the slave would be for her’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Ahmad has narrated from ibn Mahbub from Jamil ibn Salih from al-Fudayl ibn Yasar who has said the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about the case of a man who marries a woman and sets a mahr (dower) of one thousand dirham and gives her a runaway slave and a gown of Hibr for the one thousand set as mahr (dower). He (the Imam) said, ’If she knows about the slave and has agreed, then it is not unlawful if she has taken delivery of the cloths and has agreed about the slave.’ I then asked, ’What happens if he divorces her before going to bed with her? He (the Imam) said, ‘She has no mahr (dower) and she must return five hundred dirham and the slave is for her.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل كالموثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/182)"
        ],
        "index": 10728,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:40:7",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنِ ابْنِ أَبِي يَعْفُورٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ تَزَوَّجَ امْرَأَةً وَ جَعَلَ صَدَاقَهَا أَبَاهَا عَلَى أَنْ تَرُدَّ عَلَيْهِ أَلْفَ دِرْهَمٍ ثُمَّ طَلَّقَهَا قَبْلَ أَنْ يَدْخُلَ بِهَا مَا يَنْبَغِي لَهَا أَنْ تَرُدَّ عَلَيْهِ وَ إِنَّمَا لَهَا نِصْفُ الْمَهْرِ وَ أَبُوهَا شَيْخٌ قِيمَتُهُ خَمْسُمِائَةِ دِرْهَمٍ وَ هُوَ يَقُولُ لَوْ لَا أَنْتُمْ لَمْ أَبِعْهُ بِثَلَاثَةِ آلَافِ دِرْهَمٍ فَقَالَ لَا يُنْظَرُ فِي قَوْلِهِ وَ لَا تَرُدُّ عَلَيْهِ شَيْئاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Ibn Sama’at, from someone else, from Aban Bin usman, from Ibn Abu Yafour who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who married a woman and made her dower to be her father upon that a thousand Dirhams would be returned to him. Then he divorces her before he sleeps with her. What is befitting for her that she should return to him? And rather, for her is half the dower, and her father is an old man. His value is five hundred Dirhams, and he is saying, ‘Were it not for you, I would not sell him with three thousand Dirhams’. So he<sup>asws</sup> said: ‘There would be no consideration for his words, and nothing would be returned to him’."
          ],
          "en.sarwar": [
            "7. Humayd ibn Ziyad has narrated from ibn Sama‘ah from more than one person from Aban ibn ‘Uthman from ibn abu Ya‘fur who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who marries a woman and has set her father as her mahr (dower) and that she must return one thousand dirham to him. He then divorces her before going to bed with her. What must she return to him when she deserves only one- half of the mahr (dower )? Her father is an old man who is worth only five hundred dirham and he says, ’Were it not because of you I would not sell him for three thousand dirham. He (the Imam) said, ‘His words are not considered and nothing is returned to him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/182)"
        ],
        "index": 10729,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:40:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ صَالِحِ بْنِ رَزِينٍ عَنْ شِهَابٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ تَزَوَّجَ امْرَأَةً بِأَلْفِ دِرْهَمٍ فَأَدَّاهَا إِلَيْهَا فَوَهَبَتْهَا لَهُ وَ قَالَتْ أَنَا فِيكَ أَرْغَبُ فَطَلَّقَهَا قَبْلَ أَنْ يَدْخُلَ بِهَا قَالَ يَرْجِعُ عَلَيْهَا بِخَمْسِمِائَةِ دِرْهَمٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Salih Bin Razeyn, from Shahaab who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who married a woman by a thousand Dirhams. So he pays it to her, but she gifts it to him and she says, ‘I am desirous of you’. So he divorces her before he sleeps with her. He<sup>asws</sup> said: ‘There would be returned to her, five hundred Dirhams’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from Salih ibn Razin from Shihab who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who marries a woman for one thousand dirham and pays to her; but she gives it as a gift to him and says, ‘I am interested in you.’ He then divorces her before going to bed with her.’ He (the Imam) said, ‘He must return to her five hundred dirham.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/182)"
        ],
        "index": 10730,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:40:9",
        "text": [
          "مُحَمَّدٌ عَنْ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنِ ابْنِ أُذَيْنَةَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ تَزَوَّجَ امْرَأَةً فَأَمْهَرَهَا أَلْفَ دِرْهَمٍ وَ دَفَعَهَا إِلَيْهَا فَوَهَبَتْ لَهُ خَمْسَمِائَةِ دِرْهَمٍ وَ رَدَّتْهَا عَلَيْهِ ثُمَّ طَلَّقَهَا قَبْلَ أَنْ يَدْخُلَ بِهَا قَالَ تَرُدُّ عَلَيْهِ الْخَمْسَمِائَةِ دِرْهَمٍ الْبَاقِيَةَ لِأَنَّهَا إِنَّمَا كَانَتْ لَهَا خَمْسُمِائَةِ دِرْهَمٍ فَهِبَتُهَا إِيَّاهَا لَهُ وَ لِغَيْرِهِ سَوَاءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ahmad, from Muhammad Bin Ismail, from Mansour Bin Yunus, from Ibn Azina, from Muhammad Bin Muslim who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who married a woman, so her dowry was set at a thousand Dirhams and he handed it over to her. But she gifted five hundred Dirhams to him and returned it to him. Then he divorced her before he slept with her. He<sup>asws</sup> said: ‘The remaining five hundred would be returned back to him, because for her were five hundred Dirhams. So her gifting these to him and to someone else is the same’."
          ],
          "en.sarwar": [
            "9. Muhammad has narrated from Ahmad from Muhammad ibn ’Isma‘il from Mansur ibn Yunus from ibn ‘Udhaynah fm mm who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who marries a woman and sets a mahr (dower) of one thousand dirham and pays it to her. She then keeps five hundred and returns five hundred to him as gift. He then divorces before going to bed with her. He (the Imam) said, ‘She must return the other five hundred because five hundred belonged to her. Her giving as gift to him or others is the same.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/183)"
        ],
        "index": 10731,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:40:10",
        "text": [
          "مُحَمَّدٌ عَنْ أَحْمَدَ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنِ الْقَاسِمِ بْنِ سُلَيْمَانَ عَنْ عُبَيْدِ بْنِ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ تَزَوَّجَ امْرَأَةً وَ أَمْهَرَهَا أَبَاهَا وَ قِيمَةُ أَبِيهَا خَمْسُمِائَةِ دِرْهَمٍ عَلَى أَنْ تُعْطِيَهُ أَلْفَ دِرْهَمٍ ثُمَّ طَلَّقَهَا قَبْلَ أَنْ يَدْخُلَ بِهَا قَالَ لَيْسَ عَلَيْهَا شَيْ‏ءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad, from Ahmad, from Al Husayn Bin Saeed, from Al Nazar Bin Suwed, from Al Qasim Bin Suleyman, from Ubeyd Bin Zurara, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who married a woman, and set her father as her dower, and the value of her father was five hundred Dirhams upon that she would give him a thousand Dirhams. Then he divorced her before he slept with her. He<sup>asws</sup> said: ‘There is nothing upon her’."
          ],
          "en.sarwar": [
            "10. Muhammad has narrated from Ahmad from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from al-Qasim ibn Sulayman from ‘Ubayd ibn Zurarah who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who marries a woman and sets her (slave) father as her mahr (dower). His price is five hundred dirham; then he divorces before going to bed with her.’ He (the Imam) said, ‘She does not owe anything to him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/183)"
        ],
        "index": 10732,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:40:11",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ طَلَّقَ امْرَأَتَهُ قَبْلَ أَنْ يَدْخُلَ بِهَا قَالَ عَلَيْهِ نِصْفُ الْمَهْرِ إِنْ كَانَ فَرَضَ لَهَا شَيْئاً وَ إِنْ لَمْ يَكُنْ فَرَضَ لَهَا شَيْئاً فَلْيُمَتِّعْهَا عَلَى نَحْوِ مَا يُمَتَّعُ بِهِ مِثْلُهَا مِنَ النِّسَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ali Bin Abu Hamza, from Abu Baseer who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who divorces his wife before he sleeps with her. He<sup>asws</sup> said: ‘Upon him is half the dower, if anything was Obligated for her; and if nothing was Obligated for her, so let him provide for her upon an approximation of what similar to her from the women are provided with’."
          ],
          "en.sarwar": [
            "11. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Ali ibn abu Hamzah from abu Basir who has said the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about the case of a man who divorces his wife before going to bed with her. He (the Imam) said, ’He owes to her one-half of the mahr (dower) if he has set mahr (dower) for her, but if he has not set anything for her then he must benefit her in a fair manner as it is done with women similar to her.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/183)"
        ],
        "index": 10733,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:40:12",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى رَفَعَهُ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي الْحَسَنِ الْأَوَّلِ ( عليه السلام ) فِي رَجُلٍ تَزَوَّجَ امْرَأَةً عَلَى عَبْدٍ وَ امْرَأَتِهِ فَسَاقَهُمَا إِلَيْهَا فَمَاتَتِ امْرَأَةُ الْعَبْدِ عِنْدَ الْمَرْأَةِ ثُمَّ طَلَّقَهَا قَبْلَ أَنْ يَدْخُلَ بِهَا قَالَ إِنْ كَانَ قَوَّمَهَا عَلَيْهَا يَوْمَ تَزَوَّجَهَا فَإِنَّهُ يُقَوَّمُ الْعَبْدُ الْبَاقِي بِقِيمَتِهِ ثُمَّ يُنْظَرُ مَا بَقِيَ مِنَ الْقِيمَةِ الَّتِي تَزَوَّجَهَا عَلَيْهَا فَتَرُدُّ الْمَرْأَةُ عَلَى الزَّوْجِ ثُمَّ يُعْطِيهَا الزَّوْجُ النِّصْفَ مِمَّا صَارَ إِلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, fraising it from Is’haq Bin Ammar, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup> regarding a man who marries a woman upon a slave and his wife. So he sends them to her. So the wife of the slave dies in the presence of the woman. Then he divorces her before he sleeps with her. He<sup>asws</sup> said: ‘If she had been evaluated on the day he married her, so the remaining slave would be evaluated with his price. Then he would look at what remains from the price which he had married her upon, so the woman would return to the husband. Then the husband would give her the half from what had come to him’."
          ],
          "en.sarwar": [
            "12. Muhammad ibn Yahya in a marfu‘ manner has narrated from Ishaq ibn ‘Ammar who has said the following: “This is the case of a man who marries a woman for a slave with his wife. He delivers them to her then the wife of the slave dies in the possession of the woman; then he divorces her before going to bed with her. Abu al-Hassan, al-Awwal, ‘Alayhi al-Salam, has said, ‘If he had appraised her for her on the day of marriage he then appraises the slave. He then counts the difference of the day of marriage which she must return to him, then he gives her one-half of what he has received back.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/183)"
        ],
        "index": 10734,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:40:13",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ فِي الْمَرْأَةِ تَزَوَّجُ عَلَى الْوَصِيفِ فَيَكْبَرُ عِنْدَهَا فَيَزِيدُ أَوْ يَنْقُصُ ثُمَّ يُطَلِّقُهَا قَبْلَ أَنْ يَدْخُلَ بِهَا قَالَ عَلَيْهَا نِصْفُ قِيمَتِهِ يَوْمَ دُفِعَ إِلَيْهَا لَا يُنْظَرُ فِي زِيَادَةٍ وَ لَا نُقْصَانٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that Amir Al-Momineen<sup>asws</sup> said regarding the woman who marries upon the domestic servant. So he grew older with her, so he increased (in price) or decreased. Then he divorces her before he sleeps with her. He<sup>asws</sup> said: ‘Upon her is half the price on the day he was handed over to her. The increase and the decreased would not be considered’."
          ],
          "en.sarwar": [
            "13. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin has said this. ‘If a woman marries for a woman as mahr (dower) who grows with her whereby her price increases or reduces, then he divorces her before going to bed with her. She must give back half of the price of the day it was given to her regardless of any increase or decrease.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/185)"
        ],
        "index": 10735,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:40:14",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ فِي الرَّجُلِ يُعْتِقُ أَمَتَهُ فَيَجْعَلُ عِتْقَهَا مَهْرَهَا ثُمَّ يُطَلِّقُهَا قَبْلَ أَنْ يَدْخُلَ بِهَا قَالَ تَرُدُّ عَلَيْهِ نِصْفَ قِيمَتِهَا تُسْتَسْعَى فِيهَا."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain – ",
            "Regarding the man who emancipates (liberates) his slave girl, so he makes her emancipation as her dower. Then he divorces her before he sleeps with her. He<sup>asws</sup> said: ‘She would return to him half of her price. She would have to work with regards to it’."
          ],
          "en.sarwar": [
            "14. Through the same chain of narrators as that of the previous Hadith the following is narrated: “About the case of a man who sets his slave-girl free then sets her freedom as her mahr (dower) then divorces before going to bed with her. He (the Imam) said, ‘She must return one-half of her price and must work to pay the rest.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:2:40",
  "kind": "verse_list"
}