{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:6:2",
        "titles": {
          "ar": "كتاب الطلاق ",
          "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 44"
        },
        "path": "/books/al-kafi:6:2:44",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب عِلَّةِ اخْتِلَافِ</span> عِدَّةِ الْمُطَلَّقَةِ وَ عِدَّةِ الْمُتَوَفَّى عَنْهَا زَوْجُهَا",
          "en": "Chapter 43 – Reason for the difference is the waiting period of the divorced woman, and the waiting period of the woman widowed from her husband"
        }
      }
    ],
    "index": 1645,
    "local_index": 44,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 45"
        },
        "path": "/books/al-kafi:6:2:45",
        "titles": {
          "ar": "باب عِدَّةِ الْحُبْلَى الْمُتَوَفَّى عَنْهَا زَوْجُهَا وَ نَفَقَتِهَا",
          "en": "Chapter 44 – Waiting period of the pregnant woman widowed from her husband, and her expenses"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 43"
        },
        "path": "/books/al-kafi:6:2:43",
        "titles": {
          "ar": "باب عِدَّةِ الْمُتَوَفَّى عَنْهَا زَوْجُهَا وَ هُوَ غَائِبٌ",
          "en": "Chapter 42 – Waiting period of the woman widowed from her husband, and he was absent (when he died)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:6:2",
        "titles": {
          "ar": "كتاب الطلاق ",
          "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:2:44",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب عِلَّةِ اخْتِلَافِ</span> عِدَّةِ الْمُطَلَّقَةِ وَ عِدَّةِ الْمُتَوَفَّى عَنْهَا زَوْجُهَا",
      "en": "Chapter 43 – Reason for the difference is the waiting period of the divorced woman, and the waiting period of the woman widowed from her husband"
    },
    "verse_count": 1,
    "verse_start_index": 10759,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/193)"
        ],
        "index": 10760,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2570",
              "text": "الْحُسَيْنِ بْنِ سَيْفٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/68",
              "text": "مُحَمَّدِ بْنِ سُلَيْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/731",
              "text": "أَبِي جَعْفَرٍ الثَّانِي ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْحُسَيْنِ بْنِ سَيْفٍ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ أَبِي جَعْفَرٍ الثَّانِي ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:44:1",
        "relations": {
          "Mentions": [
            "/books/quran:2:234",
            "/books/quran:2:226"
          ]
        },
        "text": [
          " قُلْتُ لَهُ جُعِلْتُ فِدَاكَ كَيْفَ صَارَتْ عِدَّةُ الْمُطَلَّقَةِ ثَلَاثَ حِيَضٍ أَوْ ثَلَاثَةَ أَشْهُرٍ وَ صَارَتْ عِدَّةُ الْمُتَوَفَّى عَنْهَا زَوْجُهَا أَرْبَعَةَ أَشْهُرٍ وَ عَشْراً فَقَالَ أَمَّا عِدَّةُ الْمُطَلَّقَةِ ثَلَاثَةُ قُرُوءٍ فَلِاسْتِبْرَاءِ الرَّحِمِ مِنَ الْوَلَدِ وَ أَمَّا عِدَّةُ الْمُتَوَفَّى عَنْهَا زَوْجُهَا فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ شَرَطَ لِلنِّسَاءِ شَرْطاً وَ شَرَطَ عَلَيْهِنَّ شَرْطاً فَلَمْ يَجْأَ بِهِنَّ فِيمَا شَرَطَ لَهُنَّ وَ لَمْ يَجُرْ فِيمَا اشْتَرَطَ عَلَيْهِنَّ",
          "شَرَطَ لَهُنَّ فِي الْإِيلَاءِ أَرْبَعَةَ أَشْهُرٍ إِذْ يَقُولُ اللَّهُ عَزَّ وَ جَلَّ لِلَّذِينَ يُؤْلُونَ مِنْ نِسائِهِمْ تَرَبُّصُ أَرْبَعَةِ أَشْهُرٍ فَلَمْ يُجَوِّزْ لِأَحَدٍ أَكْثَرَ مِنْ أَرْبَعَةِ أَشْهُرٍ فِي الْإِيلَاءِ لِعِلْمِهِ تَبَارَكَ وَ تَعَالَى أَنَّهُ غَايَةُ صَبْرِ الْمَرْأَةِ مِنَ الرَّجُلِ ",
          "وَ أَمَّا مَا شَرَطَ عَلَيْهِنَّ فَإِنَّهُ أَمَرَهَا أَنْ تَعْتَدَّ إِذَا مَاتَ عَنْهَا زَوْجُهَا أَرْبَعَةَ أَشْهُرٍ وَ عَشْراً فَأَخَذَ مِنْهَا لَهُ عِنْدَ مَوْتِهِ مَا أَخَذَ لَهَا مِنْهُ فِي حَيَاتِهِ عِنْدَ إِيلَائِهِ قَالَ اللَّهُ تَبَارَكَ وَ تَعَالَى يَتَرَبَّصْنَ بِأَنْفُسِهِنَّ أَرْبَعَةَ أَشْهُرٍ وَ عَشْراً وَ لَمْ يَذْكُرِ الْعَشَرَةَ الْأَيَّامِ فِي الْعِدَّةِ إِلَّا مَعَ الْأَرْبَعَةِ أَشْهُرٍ وَ عَلِمَ أَنَّ غَايَةَ صَبْرِ الْمَرْأَةِ الْأَرْبَعَةُ أَشْهُرٍ فِي تَرْكِ الْجِمَاعِ فَمِنْ ثَمَّ أَوْجَبَهُ عَلَيْهَا وَ لَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Husayn Bin Sayf, from Muhammad Bin Suleyman, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> the 2nd, said, ‘I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! How come the waiting period of the divorced woman is three menstruations, or three months, and the waiting period of the woman widowed from her husband came to be four months and ten (days)?’ So he<sup>asws</sup> said: ‘As for the waiting period of the divorced woman being three <span class=\"iTxt\">Quroo</span>s (pure periods), so it is for the freeing of the womb from the child, and as for the waiting period of the woman widowed from her husband, so Allah<sup>azwj</sup> Mighty and Majestic Stipulated a condition for the women, and Stipulated a condition against them. So He<sup>azwj</sup> did not Seize them with regards to what He<sup>azwj</sup> stipulated for the, and was not Unjust with regards to what He<sup>azwj</sup> Stipulated against them. ",
            "A condition for them regarding the oath (by the husband not to copulate) is four months as Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h226\">[2:226]</a> Those who swear that they will not go in to their wives should wait four months</span>. Thus, it is not allowed for anyone, more than four months regarding the oath, for the Blessed and High Knows that it is the limit of the patient of the woman from the man.",
            "And as for what He<sup>azwj</sup> Stipulated against them, so He<sup>azwj</sup> Commanded her that she should wait, when her husband dies from her, for four months and ten (days). Thus, He<sup>azwj</sup> Took from her for him during his death, what he Took for her from him during his lifetime with the oathing. Allah<sup>azwj</sup> Says <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h234\">[2:234]</a> they should keep themselves in waiting for four months and ten</span>, and did not Mention the ‘ten days’ in the waiting period except with the four months, and Knows that the limit of the patience of the woman is four months regarding the neglect of the copulation, So from then it Obligates against her and for her’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from al-Husayn ibn Sayf from Muhammad ibn Sulayman who has said the following: “I once asked abu Ja‘far, al-Thaniy, ‘Alayhi al-Salam, saying, ‘I pray to Allah to keep my soul in service for your cause, why is it that waiting period for a woman divorced three times, is three cycles of Hayd (menses) or three months, and the waiting period of a widow is four months and ten days? He (the Imam) said, ‘Waiting period for a woman divorced three times is passing of three Hayd (menses)- free periods. It is to ascertain a womb is free of child and pregnancy. About the waiting period of a widow Allah, most Majestic, most Glorious, has set a condition for and a condition against women. In the condition for them He does not hold them accountable and in the condition against them He has not done injustice to them. In the case of ’Ila’ (swearing not to go to bed with one’s wife) it is four months as Allah, most Majestic, most Glorious, says, ‘. . . for those who swear there is a four month waiting period.’ <a href=\"/#/books/quran:2#h226\">[2:226]</a> He has not made it permissible for anyone in the case of ‘Ila’ to wait more than four months because He, most Blessed, most High, knows how long women can wait without going to bed and without men. The condition against women is in the case of the death of their husband in which case they must wait for four months and ten days. Thus He has taken from her when he dies as much as He has takes for her from him during his life time in the case of ‘Ila’ as Allah, most Blessed, most High, says, ‘. . . they must wait for four months and ten days.’ He has not mentioned the ten days in waiting period except with four months. He knows that women can wait without men only for four months and without going to bed. For this reason He has set conditions for and against them.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:2:44",
  "kind": "verse_list"
}