{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:6:2", "titles": {"ar": "كتاب الطلاق ", "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "}}, {"indexed_titles": {"en": "Chapter 54"}, "path": "/books/al-kafi:6:2:54", "titles": {"ar": "باب طَلَاقِ الْأَخْرَسِ", "en": "Chapter 54 – Divorce of the mute"}}], "index": 1648, "local_index": 54, "part_type": "Chapter", "path": "/books/al-kafi:6:2:54", "titles": {"ar": "باب طَلَاقِ الْأَخْرَسِ", "en": "Chapter 54 – Divorce of the mute"}, "verse_count": 4, "verse_start_index": 10824, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 10825, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:2:54:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنِ الرَّجُلِ تَكُونُ عِنْدَهُ الْمَرْأَةُ ثُمَّ يَصْمُتُ فَلَا يَتَكَلَّمُ قَالَ يَكُونُ أَخْرَسَ قُلْتُ نَعَمْ فَيُعْلَمُ مِنْهُ بُغْضٌ لِامْرَأَتِهِ وَ كَرَاهَتُهُ لَهَا أَ يَجُوزُ أَنْ يُطَلِّقَ عَنْهُ وَلِيُّهُ قَالَ لَا وَ لَكِنْ يَكْتُبُ وَ يُشْهِدُ عَلَى ذَلِكَ ", "قُلْتُ لَا يَكْتُبُ وَ لَا يَسْمَعُ كَيْفَ يُطَلِّقُهَا فَقَالَ بِالَّذِي يُعْرَفُ مِنْهُ مِنْ فِعَالِهِ مِثْلِ مَا ذَكَرْتَ مِنْ كَرَاهَتِهِ وَ بُغْضِهِ لَهَا ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu nasr who said, ", "‘I asked Abu Al-Hassan<sup>asws</sup> about the man who happened to have the woman with him. Then he kept silent and could not speak’. He<sup>asws</sup> said: ‘He became mute?’ I said, ‘Yes. So it was known from him to be with hatred for his wife and his abhorrence for her. Is it allowed that his guardian divorces on his behalf?’ He<sup>asws</sup> said: ‘No. But, he can write it out and keep witnesses upon that’. ", "I said, ‘He can neither write nor hear, how would he divorce her?’ So he<sup>asws</sup> said: ‘By that which is recognised from him from his actions the likes of what you mentioned from his abhorrence, and his hatred for her’."]}}, {"index": 10826, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:2:54:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ طَلَاقِ الْخَرْسَاءِ قَالَ يَلُفُّ قِنَاعَهَا عَلَى رَأْسِهَا وَ يَجْذِبُهُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Salih Bin Al Sandy, from Ja’far Bin Basheer, from Aban Bin Usman who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about a divorce of the mute. He<sup>asws</sup> said: ‘He should wrap her scarf upon her head and pull it away’."]}}, {"index": 10827, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:6:2:54:3", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ طَلَاقُ الْأَخْرَسِ أَنْ يَأْخُذَ مِقْنَعَتَهَا فَيَضَعَهَا عَلَى رَأْسِهَا وَ يَعْتَزِلَهَا ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A divorce of the mute is that he takes her veil, so he places it upon her head, and he takes it off’."]}}, {"index": 10828, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:6:2:54:4", "text": ["عَلِيٌّ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ فِي رَجُلٍ أَخْرَسَ كَتَبَ فِي الْأَرْضِ بِطَلَاقِ امْرَأَتِهِ قَالَ إِذَا فَعَلَ ذَلِكَ فِي قُبُلِ الطُّهْرِ بِشُهُودٍ وَ فُهِمَ عَنْهُ كَمَا يُفْهَمُ عَنْ مِثْلِهِ وَ يُرِيدُ الطَّلَاقَ جَازَ طَلَاقُهُ عَلَى السُّنَّةِ ."], "translations": {"en.hubeali": ["Ali, from his father, from Ismail Bin Marrar, from Yunus, ", "‘With regards to a mute man who writes in the ground with a divorce of his wife. He<sup>asws</sup> said: ‘When he does that, accepting the purity, with witnesses, and it is understood from him just as it is understood the likes of it, and he intends the divorce, so his divorce is allowed upon the Sunnah’."]}}]}, "index": "al-kafi:6:2:54", "kind": "verse_list"}