{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:6:2",
        "titles": {
          "ar": "كتاب الطلاق ",
          "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 54"
        },
        "path": "/books/al-kafi:6:2:54",
        "titles": {
          "ar": "باب طَلَاقِ الْمُضْطَرِّ وَ الْمُكْرَهِ",
          "en": "Chapter 53 – Divorce of the restless and the coerced"
        }
      }
    ],
    "index": 1655,
    "local_index": 54,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 55"
        },
        "path": "/books/al-kafi:6:2:55",
        "titles": {
          "ar": "باب طَلَاقِ الْأَخْرَسِ",
          "en": "Chapter 54 – Divorce of the mute"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 53"
        },
        "path": "/books/al-kafi:6:2:53",
        "titles": {
          "ar": "باب طَلَاقِ السَّكْرَانِ",
          "en": "Chapter 52 – Divorce of the intoxicated ones"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:6:2",
        "titles": {
          "ar": "كتاب الطلاق ",
          "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:2:54",
    "titles": {
      "ar": "باب طَلَاقِ الْمُضْطَرِّ وَ الْمُكْرَهِ",
      "en": "Chapter 53 – Divorce of the restless and the coerced"
    },
    "verse_count": 5,
    "verse_start_index": 10829,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/215)"
        ],
        "index": 10830,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/42",
              "text": "بَعْضِ أَصْحَابِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3873",
              "text": "ابْنِ أَبِي عُمَيْرٍ أَوْ غَيْرِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِهِ عَنِ ابْنِ أَبِي عُمَيْرٍ أَوْ غَيْرِهِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:54:1",
        "text": [
          " سَمِعْتُهُ يَقُولُ لَوْ أَنَّ رَجُلًا مُسْلِماً مَرَّ بِقَوْمٍ لَيْسُوا بِسُلْطَانٍ فَقَهَرُوهُ حَتَّى يَتَخَوَّفَ عَلَى نَفْسِهِ أَنْ يُعْتِقَ أَوْ يُطَلِّقَ فَفَعَلَ لَمْ يَكُنْ عَلَيْهِ شَيْ‏ءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from one of his companions, from Ibn Abu Umeyr, or someone else, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘If a Muslim man who passes by a people who are not with any authority, so they compel him until he fears upon himself, that he should either emancipate (liberate a slave) or divorce, so he does it, there would be nothing upon him’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from certain persons of his people from ibn abu ‘Umayr or others from ‘ Abd Allah ibn Sinan who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ‘If a Muslim man passes by a people who do have not any valid authority and they force him, he fears for his life, to set free a slave or divorce and he complies, it does not have any valid effect against him/” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/215)"
        ],
        "index": 10831,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/55",
              "text": "عَلِيٌّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/219",
              "text": "عُمَرَ بْنِ أُذَيْنَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/191",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:54:2",
        "text": [
          " سَأَلْتُهُ عَنْ طَلَاقِ الْمُكْرَهِ وَ عِتْقِهِ فَقَالَ لَيْسَ طَلَاقُهُ بِطَلَاقٍ وَ لَا عِتْقُهُ بِعِتْقٍ فَقُلْتُ إِنِّي رَجُلٌ تَاجِرٌ أَمُرُّ بِالْعَشَّارِ وَ مَعِي مَالٌ فَقَالَ غَيِّبْهُ مَا اسْتَطَعْتَ وَ ضَعْهُ مَوَاضِعَهُ فَقُلْتُ وَ إِنْ حَلَّفَنِي بِالطَّلَاقِ وَ الْعَتَاقِ فَقَالَ احْلِفْ لَهُ ثُمَّ أَخَذَ تَمْرَةً فَحَفَنَ بِهَا مِنْ زُبْدٍ كَانَ قُدَّامَهُ فَقَالَ مَا أُبَالِي حَلَفْتُ لَهُمْ بِالطَّلَاقِ وَ الْعَتَاقِ أَوْ أَكَلْتُهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a divorce of the coerced, and his emancipation (liberation of a slave). So he<sup>asws</sup> said: ‘His divorce is not with a (valid) divorce, nor is his emancipation a (valid) emancipation’. So I said, ‘I am a businessman. I pass by the tax collector and with me is wealth’. So he<sup>asws</sup> said: ‘Hide from him according to your capacity, and place it in its (proper) place’. So I said, ‘And if he makes me swear an oath with the divorce and the emancipation (of a slave)?’ So he<sup>asws</sup> said: ‘Swear for him’. Then he<sup>asws</sup> took a date, so he scooped with it from butter which was in front of him<sup>asws</sup>, so he<sup>asws</sup> said: ‘I<sup>asws</sup> don’t mind if you swear for them with the divorce, and the emancipation (of a slave), or I<sup>asws</sup> eat it (the date)’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ‘Udhaynah from Zurarah who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about the divorce of a man who is coerced and about his setting free slaves. He (the Imam) said, ‘His divorce is not a divorce and his setting free slaves is not valid freedom/ I then said, ‘I am a merchant and I pass by a one-tenth tax collector, with certain amount of assets with me/ He (the Imam) said, ‘Keep it concealed as much as you can in their proper place/ I then asked, ‘What must I do if they ask me to swear about divorce and setting free slaves?’ He (the Imam) said, ‘You can swear for him.’ He (the Imam) then took a piece of date and immersed it in butter in front of him (the Imam).’ He (the Imam) then said, ‘I do not mind about your swearing for divorce and setting free slaves or eating this.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/215)"
        ],
        "index": 10832,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1407",
              "text": "حُمَيْدُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1368",
              "text": "ابْنِ سَمَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/679",
              "text": "عُبَيْسِ بْنِ هِشَامٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/948",
              "text": "صَالِحِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/259",
              "text": "مَنْصُورِ بْنِ يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ عُبَيْسِ بْنِ هِشَامٍ وَ صَالِحِ بْنِ خَالِدٍ عَنْ مَنْصُورِ بْنِ يُونُسَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:54:3",
        "text": [
          " سَأَلْتُ الْعَبْدَ الصَّالِحَ ( عليه السلام ) وَ هُوَ بِالْعُرَيْضِ فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ إِنِّي قَدْ تَزَوَّجْتُ امْرَأَةً وَ كَانَ تُحِبُّنِي فَتَزَوَّجْتُ عَلَيْهَا ابْنَةَ خَالِي وَ قَدْ كَانَ لِي مِنَ الْمَرْأَةِ وَلَدٌ فَرَجَعْتُ إِلَى بَغْدَادَ فَطَلَّقْتُهَا وَاحِدَةً ثُمَّ رَاجَعْتُهَا ثُمَّ طَلَّقْتُهَا الثَّانِيَةَ ثُمَّ رَاجَعْتُهَا ثُمَّ خَرَجْتُ مِنْ عِنْدِهَا أُرِيدُ سَفَرِي هَذَا حَتَّى إِذَا كُنْتُ بِالْكُوفَةِ أَرَدْتُ النَّظَرَ إِلَى ابْنَةِ خَالِي فَقَالَتْ أُخْتِي وَ خَالَتِي لَا تَنْظُرُ إِلَيْهَا وَ اللَّهِ أَبَداً حَتَّى تُطَلِّقَ فُلَانَةَ فَقُلْتُ وَيْحَكُمْ وَ اللَّهِ مَا لِي إِلَى طَلَاقِهَا سَبِيلٌ ",
          "فَقَالَ لِي هُوَ مِنْ شَأْنِكَ لَيْسَ لَكَ إِلَى طَلَاقِهَا سَبِيلٌ فَقُلْتُ جُعِلْتُ فِدَاكَ إِنَّهُ كَانَتْ لِي مِنْهَا بِنْتٌ وَ كَانَتْ بِبَغْدَادَ وَ كَانَتْ هَذِهِ بِالْكُوفَةِ وَ خَرَجْتُ مِنْ عِنْدِهَا قَبْلَ ذَلِكَ بِأَرْبَعٍ فَأَبَوْا عَلَيَّ إِلَّا تَطْلِيقَهَا ثَلَاثاً وَ لَا وَ اللَّهِ جُعِلْتُ فِدَاكَ مَا أَرَدْتُ اللَّهَ وَ مَا أَرَدْتُ إِلَّا أَنْ أُدَارِيَهُمْ عَنْ نَفْسِي وَ قَدِ امْتَلَأَ قَلْبِي مِنْ ذَلِكَ جُعِلْتُ فِدَاكَ ",
          "فَمَكَثَ طَوِيلًا مُطْرِقاً ثُمَّ رَفَعَ رَأْسَهُ إِلَيَّ وَ هُوَ مُتَبَسِّمٌ فَقَالَ أَمَّا مَا بَيْنَكَ وَ بَيْنَ اللَّهِ عَزَّ وَ جَلَّ فَلَيْسَ بِشَيْ‏ءٍ وَ لَكِنْ إِذَا قَدَّمُوكَ إِلَى السُّلْطَانِ أَبَانَهَا مِنْكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Ibn sama’at, from Ubeys Bin Hisham, and Salih Bin Khalid, from Mansour Bin Yunus who said, ",
            "‘Al-Abd Al-Salih<sup>asws</sup> (7th Imam<sup>asws</sup>) was asked, and he<sup>asws</sup> was at Al-Urayz, so I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! I have married a woman and she used to love me, then I married upon her a daughter of my maternal uncle, and there was a son for me from the woman. So I returned to Baghdad, so I divorced her once. Then I reverted to her, then divorced her the second (divorce). Then I went from her presence intending this journey, until I was at Al-Kufa. I wanted to look at the daughter of my maternal uncle, so my sister and my maternal aunt said, ‘You will not look at her ever, by Allah<sup>azwj</sup>, until you divorce so and so’. So I said, ‘Woe be unto you! By Allah<sup>azwj</sup>, there is no way for me to divorce her’.  ",
            "So he<sup>asws</sup> said to me: ‘It is from your affairs, there is no way for you to divorce her’. So I said, ‘May I be sacrificed for you! There was a daughter for me from her, and she was at Baghdad, and this one is at Al-Kufa, and I went out from her presence before that by four (days), so they refused me (to see her) except that I divorce her three times, and no, by Allah<sup>azwj</sup>, may I be sacrificed for you<sup>asws</sup>! I did not intend (for the Sake of) Allah<sup>azwj</sup> except that I manage them from myself, and it has afflicted my heart due to that, may I be sacrificed for you<sup>asws</sup>!’ ",
            "So he<sup>asws</sup> remained silent for a long time, then raised his<sup>asws</sup> head towards me, and he<sup>asws</sup> was smiling. So he<sup>asws</sup> said: ‘As for what is between you and Allah<sup>azwj</sup> Mighty and Majestic, so it is not with anything, but, when they proceed you to the Sultan (ruling authority), they would irrevocably divorce her from you’."
          ],
          "en.sarwar": [
            "3. Humayd ibn Ziyad has narrated from ibn Sama‘ah from ‘Ubays ibn Hisham and Salih ibn Khalid from Mansur ibn Yunus who has said the following: “I once asked Allah’s virtuous servant, ‘Alayhi al-Salam, when he was in al-‘Arid, (name of a place) saying, ‘I pray to Allah to keep my soul in service for your cause, I married a woman who loved me. I then married the daughter of my maternal uncle and from the woman I had a son. I returned to Baghdad and divorced her once, then I went back to her, then divorced her for the second time, then I went back to her and then left for this journey. I arrived in al-Kufah to see the daughter of my maternal uncle, and my sister and maternal aunt told me that, by Allah, I could never look at her until I divorced so and so. I then told them: ‘Fie on you; I have no way to divorce her.’ He said, ‘It is up to you and it is your problem.’ I then said, ‘I pray to Allah to keep my soul in service for your cause. From her I had a daughter who lived in Baghdad and this is in al-Kufah; I had left her before four and they refused to allow me to see her unless I divorced her three times. No, by Allah, I pray to Allah to keep my soul in service for your cause, I did not want to do so except that I wanted to keep them away from myself, and my heart has become full (of disappointment with them). I pray to Allah to keep my soul in service for your cause.’ He (the Imam) then bent down his head for a long time, then raised his head, smiling and said, ‘Between you and Allah, most Majestic, most Glorious, there is no problem, however, if they take their case against you before the Sultan (ruling authorities) they can make her to become stranger to you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/216)"
        ],
        "index": 10833,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1951",
              "text": "يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ الْحَسَنِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:54:4",
        "text": [
          " سَمِعْتُهُ يَقُولُ لَا يَجُوزُ الطَّلَاقُ فِي اسْتِكْرَاهٍ وَ لَا يَجُوزُ عِتْقٌ فِي اسْتِكْرَاهٍ وَ لَا يَجُوزُ يَمِينٌ فِي قَطِيعَةِ رَحِمٍ وَ لَا فِي شَيْ‏ءٍ مِنْ مَعْصِيَةِ اللَّهِ فَمَنْ حَلَفَ أَوْ حُلِّفَ فِي شَيْ‏ءٍ مِنْ هَذَا وَ فَعَلَهُ فَلَا شَيْ‏ءَ عَلَيْهِ ",
          "قَالَ وَ إِنَّمَا الطَّلَاقُ مَا أُرِيدَ بِهِ الطَّلَاقُ مِنْ غَيْرِ اسْتِكْرَاهٍ وَ لَا إِضْرَارٍ عَلَى الْعِدَّةِ وَ السُّنَّةِ عَلَى طُهْرٍ بِغَيْرِ جِمَاعٍ وَ شَاهِدَيْنِ فَمَنْ خَالَفَ هَذَا فَلَيْسَ طَلَاقُهُ وَ لَا يَمِينُهُ بِشَيْ‏ءٍ يُرَدُّ إِلَى كِتَابِ اللَّهِ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Yahya Bin Abdullah Bin Al Hassan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘The divorce is not allowed during the compulsion, nor an emancipation (liberation of a slave) during compulsion, nor is an oath allowed regarding cutting-off of a relationship, nor with regards to something from the disobedience to Allah<sup>azwj</sup>. So the one who swears or be made to swear regarding something from this, and he does it, so there is nothing upon him’. ",
            "He<sup>asws</sup> said: ‘But rather, the divorce is what is intended by it, the divorce from without compulsion, nor any harm upon the waiting period, and the Sunnah upon purity without copulation, and two witnesses. So, the one who opposes this, so neither his divorce nor his oath is with anything. He would be returned to the Book of Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from Yahya ibn ‘Abd Allah ibn af-Hassan who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ‘Divorce under coercion is not permissible or setting free of a slave. It is not permissible to swear for cutting off good relations with relatives or for a sinful act in disobedience to Allah. Thus, whoever swears or is made to swear about something of this kind, it does not have any valid effect on him. Divorce is what is meant to be divorce, and without coercion or harming in a divorce in the manner of waiting period, according to the Sunnah, in a Hayd (menses)-free period, without sexual intercourse and is pronounced in the presence of two witnesses. If one opposes this, his divorce and oath do not have any valid effect and it is returned to the book of Allah, most Majestic, most Glorious.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/216)"
        ],
        "index": 10834,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/165",
              "text": "مُعَاوِيَةَ بْنِ وَهْبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1422",
              "text": "إِسْمَاعِيلَ الْجُعْفِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ عَنْ إِسْمَاعِيلَ الْجُعْفِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:54:5",
        "text": [
          " قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) أَمُرُّ بِالْعَشَّارِ وَ مَعِي مَالٌ فَيَسْتَحْلِفُنِي فَإِنْ حَلَفْتُ لَهُ تَرَكَنِي وَ إِنْ لَمْ أَحْلِفْ لَهُ فَتَّشَنِي وَ ظَلَمَنِي فَقَالَ احْلِفْ لَهُ قُلْتُ فَإِنَّهُ يَسْتَحْلِفُنِي بِالطَّلَاقِ فَقَالَ احْلِفْ لَهُ فَقُلْتُ فَإِنَّ الْمَالَ لَا يَكُونُ لِي قَالَ فَعَنْ مَالِ أَخِيكَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) رَدَّ طَلَاقَ ابْنِ عُمَرَ وَ قَدْ طَلَّقَ امْرَأَتَهُ ثَلَاثاً وَ هِيَ حَائِضٌ فَلَمْ يَرَ ذَلِكَ رَسُولُ اللَّهِ شَيْئاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Muawiya Bin Wahab, from Ismail Al Ju’fy who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘I pass by the tax collector and with me is wealth, so he makes me swear an oath. So if I were to swear for him, he leave me (alone), and if I do not swear for him, so he ransacks me and oppresses me’. So he<sup>asws</sup> said: ‘Swear for him’. I said, ‘Suppose he makes me swear with the divorce?’ So he<sup>asws</sup> said: ‘Swear for him’. I said, ‘So if the wealth does not happen to be mine?’ He<sup>asws</sup> said: ‘So (do it) for (the sake of) the wealth of your brother. Rasool-Allah<sup>saww</sup> rebuffed a divorce of Ibn Umar and he had divorced his wife three (divorces) and she was menstruating. Thus Rasool-Allah<sup>saww</sup> viewed that (divorce) as nothing’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Mu‘awiyah ibn Wahab from ’Isma‘il al-Ju‘fiy who has said the following: “I pass by one-tenth tax collector for trading with a certain amount of assets with me and the party (tax collector) asks me to swear. If I swear he allows me to go, but if I do not swear he searches my assets and does injustice to me. He (the Imam) said, ‘You can swear for him.’ I then said, ‘He asks me to swear in the issue of divorce. He (the Imam) said, ‘You can swear for him.’ I said, ‘The asset does not belong to me.’ He (the Imam) said, ‘Do it for the assets of your brother. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, reversed the divorce of ibn ‘Umar, who had divorced his wife three times during her Hayd (menses) and the Messenger of Allah considered it invalid and devoid of valid effect.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:2:54",
  "kind": "verse_list"
}