{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:6:2", "titles": {"ar": "كتاب الطلاق ", "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "}}, {"indexed_titles": {"en": "Chapter 60"}, "path": "/books/al-kafi:6:2:60", "titles": {"ar": "باب الْخِيَارِ", "en": "Chapter 60 – The Choice"}}], "index": 1654, "local_index": 60, "part_type": "Chapter", "path": "/books/al-kafi:6:2:60", "titles": {"ar": "باب الْخِيَارِ", "en": "Chapter 60 – The Choice"}, "verse_count": 4, "verse_start_index": 10857, "verses": [{"index": 10858, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:2:60:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ أَبِي</span> عَبْدِ اللَّهِ عَنْ مُعَاوِيَةَ بْنِ حُكَيْمٍ عَنْ صَفْوَانَ وَ عَلِيِّ بْنِ الْحَسَنِ بْنِ رِبَاطٍ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الْخِيَارِ فَقَالَ وَ مَا هُوَ وَ مَا ذَاكَ إِنَّمَا ذَاكَ شَيْ‏ءٌ كَانَ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله).", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Abu Abdullah, from Muawiya Bin Hukeym, from Safwan, and Ali Bin Al Hassan Bin Rabat, from Abu Ayoub Al Khazzaz, from Muhammad Bin Muslim who said, \n‘I asked Abu Ja’far<sup>asws</sup> about the choice, so he<sup>asws</sup> said: ‘And what is it, and what is that? But rather, that is something which was for Rasool-Allah<sup>saww</sup>’."}]}, {"index": 10859, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:2:60:2", "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ مُحَمَّدِ بْنِ زِيَادٍ وَ ابْنِ رِبَاطٍ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي سَمِعْتُ أَبَاكَ يَقُولُ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) خَيَّرَ نِسَاءَهُ فَاخْتَرْنَ اللَّهَ وَ رَسُولَهُ فَلَمْ يُمْسِكْهُنَّ عَلَى طَلَاقٍ وَ لَوِ اخْتَرْنَ أَنْفُسَهُنَّ لَبِنَّ فَقَالَ إِنَّ هَذَا حَدِيثٌ كَانَ يَرْوِيهِ أَبِي عَنْ عَائِشَةَ وَ مَا لِلنَّاسِ وَ لِلْخِيَارِ إِنَّمَا هَذَا شَيْ‏ءٌ خَصَّ اللَّهُ عَزَّ وَ جَلَّ بِهِ رَسُولَهُ ( صلى الله عليه وآله ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "Humeyd Bin Ziyad, from Ibn Sama’at, from Muhammad Bin Ziyad, and Ibn Rabat, from Abu Ayoub Al Khazzaz, from Muhammad Bin Muslim who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘I heard your<sup>asws</sup> father<sup>asws</sup> saying that Rasool-Allah<sup>saww</sup> (gave) a choice to his<sup>saww</sup> wives, so they chose Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>, so he<sup>saww</sup> did not keep them upon a divorce, and had they chosen themselves, they would have been irrevocably divorced’. So he<sup>asws</sup> said: ‘This is a Hadeeth which my<sup>asws</sup> father<sup>asws</sup> had reported about Ayesha. And what is for the people and the choice? But rather, this is something which Allah<sup>azwj</sup> Mighty and Majestic Specialised His<sup>azwj</sup> Rasool<sup>saww</sup> with’."}]}, {"index": 10860, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:6:2:60:3", "text": "حُمَيْدٌ عَنِ ابْنِ سَمَاعَةَ عَنِ ابْنِ رِبَاطٍ عَنْ عِيصِ بْنِ الْقَاسِمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ خَيَّرَ امْرَأَتَهُ فَاخْتَارَتْ نَفْسَهَا بَانَتْ مِنْهُ قَالَ لَا إِنَّمَا هَذَا شَيْ‏ءٌ كَانَ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) خَاصَّةً أُمِرَ بِذَلِكَ فَفَعَلَ وَ لَوِ اخْتَرْنَ أَنْفُسَهُنَّ لَطَلَّقَهُنَّ وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ قُلْ لِأَزْواجِكَ إِنْ كُنْتُنَّ تُرِدْنَ الْحَياةَ الدُّنْيا وَ زِينَتَها فَتَعالَيْنَ أُمَتِّعْكُنَّ وَ أُسَرِّحْكُنَّ سَراحاً جَمِيلًا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Humeyd, from Ibn Sama’at, from Ibn Rabat, from Ays Bin Al Qasim, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who (gave a) choice to his wife, so she chose herself to be irrevocably divorced from him’. He<sup>asws</sup> said: ‘No! This is something which was for Rasool-Allah<sup>saww</sup> in particular. He<sup>saww</sup> was Commanded with that, so he<sup>saww</sup> did it; and had they chosen themselves, they would have been divorced, and these are the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[33:28] O Prophet! Say to your wives: If you desire the life of the world and its adornment, then come, I will give you a provision and allow you to depart a goodly departing</span>’."}]}, {"index": 10861, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:6:2:60:4", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ مَا تَقُولُ فِي رَجُلٍ جَعَلَ أَمْرَ امْرَأَتِهِ بِيَدِهَا قَالَ فَقَالَ وَلَّى الْأَمْرَ مَنْ لَيْسَ أَهْلَهُ وَ خَالَفَ السُّنَّةَ وَ لَمْ يُجِزِ النِّكَاحَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from haroun Bin Muslim, from one of our companions, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘What are you<sup>asws</sup> saying regarding a man who made the matter of his wife to be in her hands?’ So he<sup>asws</sup> said: ‘He has given the matter to the one who is not deserving of it, and he has opposed the Sunnah, and the marriage is not allowed’."}]}]}, "index": "al-kafi:6:2:60", "kind": "verse_list"}