{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:6:2",
        "titles": {
          "ar": "كتاب الطلاق ",
          "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 62"
        },
        "path": "/books/al-kafi:6:2:62",
        "titles": {
          "ar": "باب كَيْفَ كَانَ أَصْلُ الْخِيَارِ",
          "en": "Chapter 61 – How was the origin of the choice"
        }
      }
    ],
    "index": 1663,
    "local_index": 62,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 63"
        },
        "path": "/books/al-kafi:6:2:63",
        "titles": {
          "ar": "باب الْخُلْعِ",
          "en": "Chapter 62 – The Compensatory Divorce (Khul’a)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 61"
        },
        "path": "/books/al-kafi:6:2:61",
        "titles": {
          "ar": "باب الْخِيَارِ",
          "en": "Chapter 60 – The Choice"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:6:2",
        "titles": {
          "ar": "كتاب الطلاق ",
          "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:2:62",
    "titles": {
      "ar": "باب كَيْفَ كَانَ أَصْلُ الْخِيَارِ",
      "en": "Chapter 61 – How was the origin of the choice"
    },
    "verse_count": 6,
    "verse_start_index": 10871,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/231)"
        ],
        "index": 10872,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:62:1",
        "relations": {
          "Mentions": [
            "/books/quran:33:28"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَنِفَ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) مِنْ مَقَالَةٍ قَالَتْهَا بَعْضُ نِسَائِهِ فَأَنْزَلَ اللَّهُ آيَةَ التَّخْيِيرِ فَاعْتَزَلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) نِسَاءَهُ تِسْعاً وَ عِشْرِينَ لَيْلَةً فِي مَشْرَبَةِ أُمِّ إِبْرَاهِيمَ ثُمَّ دَعَاهُنَّ فَخَيَّرَهُنَّ فَاخْتَرْنَهُ فَلَمْ يَكُ شَيْئاً وَ لَوِ اخْتَرْنَ أَنْفُسَهُنَّ كَانَتْ وَاحِدَةً بَائِنَةً ",
          "قَالَ وَ سَأَلْتُهُ عَنْ مَقَالَةِ الْمَرْأَةِ مَا هِيَ قَالَ فَقَالَ إِنَّهَا قَالَتْ يَرَى مُحَمَّدٌ أَنَّهُ لَوْ طَلَّقَنَا أَنَّهُ لَا يَأْتِينَا الْأَكْفَاءُ مِنْ قَوْمِنَا يَتَزَّوَجُونَّا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr, from Zurara who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying that Allah<sup>azwj</sup> Mighty and Majestic Scorned for Rasool-Allah<sup>saww</sup> due to the speech which one of his<sup>saww</sup> wives said, so He<sup>azwj</sup> Revealed the Verse of the Choice <a href=\"/#/books/quran:33#h28\">[33:28]</a>. So Rasool-Allah<sup>saww</sup> detached from his<sup>saww</sup> wives for twenty-nine nights in the watering place of Umm Ibrahim<sup>as</sup> (Mariah the Coptic). Then he<sup>saww</sup> called them over, so he<sup>saww</sup> gave them a choice, so they chose him<sup>saww</sup>. So nothing happened, and had they chosen themselves, even once, they would have been irrevocably divorced’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about the speech of the woman, and what it is?’ So he<sup>asws</sup> said: ‘She said, ‘Muhammad<sup>saww</sup> sees that if he<sup>saww</sup> were to divorce us, the matches from our people would not come to us to marry us’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from ibn Bukayr from Zurarah who has said the following: “I once heard abu Ja‘far, ‘Alayhi al-Salam, saying, ‘Allah, most Majestic, most Glorious, disdained and rejected the words of certain ones of his wives against the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and sent revelation about choice. The Messenger of Allah stayed away from his wives for twenty-nine days in the mashrabah (a place for water containers) of ‘Umm Ibrahim. He then called them and gave them the choice. They chose him (the Messenger of Allah) then nothing happened. Had they chosen themselves it would have been one final divorce which made them all become strangers to him (the Messenger of Allah).’ I then asked him (the Imam) about the word of the woman and who she was?’ He (the narrator) has said that he (the Imam) said, ‘She said, “Muhammad thinks that if he divorces us no one of our match from our tribes will marry us.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/231)"
        ],
        "index": 10873,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:62:2",
        "relations": {
          "Mentions": [
            "/books/quran:33:28",
            "/books/quran:33:29"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ قَالَ ذَكَرَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ زَيْنَبَ قَالَتْ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) لَا تَعْدِلُ وَ أَنْتَ رَسُولُ اللَّهِ وَ قَالَتْ حَفْصَةُ إِنْ طَلَّقَنَا وَجَدْنَا أَكْفَاءَنَا فِي قَوْمِنَا فَاحْتُبِسَ الْوَحْيُ عَنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) عِشْرِينَ يَوْماً",
          "قَالَ فَأَنِفَ اللَّهُ عَزَّ وَ جَلَّ لِرَسُولِهِ فَأَنْزَلَ يا أَيُّهَا النَّبِيُّ قُلْ لِأَزْواجِكَ إِنْ كُنْتُنَّ تُرِدْنَ الْحَياةَ الدُّنْيا وَ زِينَتَها فَتَعالَيْنَ إِلَى قَوْلِهِ أَجْراً عَظِيماً ",
          "قَالَ فَاخْتَرْنَ اللَّهَ وَ رَسُولَهُ وَ لَوِ اخْتَرْنَ أَنْفُسَهُنَّ لَبِنَّ وَ إِنِ اخْتَرْنَ اللَّهَ وَ رَسُولَهُ فَلَيْسَ بِشَيْ‏ءٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Muhammad Bin Al Fuzayl, from Abu Al Sabbah Al Kinany who said, ",
            "‘Abu Abdullah<sup>asws</sup> mentioned that Zaynab said to Rasool-Allah<sup>saww</sup>, ‘You<sup>saww</sup> are not being just and you<sup>saww</sup> are Rasool<sup>saww</sup> of Allah<sup>azwj</sup>!’ And Hafsa said, ‘If you<sup>saww</sup> were to divorce us, we would find our matches among our people’. So the Revelation was withheld (to Decide their matter) Rasool-Allah<sup>saww</sup> for twenty days (as a punishment to those wives).",
            "He<sup>asws</sup> said: ‘So Allah<sup>azwj</sup> Mighty and Majestic Condemned on behalf to His<sup>azwj</sup> Rasool<sup>saw</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:33#h28\">[33:28]</a> O Prophet! Say to your wives: If you desire the life of the world and its adornment, then come</span> – up to His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:33#h29\">[33:29]</a> a mighty Recompense</span>.",
            "He<sup>asws</sup> said: ‘So they chose Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>, and had they chosen themselves, they would have been irrevocably divorced, and since they chose Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>, so it is not with anything’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from Muhammad ibn al-Fudayl from abu al-Sabbah al-Kinaniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Zaynab said, ‘You are not fair and you are the Messenger of Allah.’ Hafsah said, ‘If you divorce us we will find our match in our people.’ Revelation stopped coming to the Messenger of Allah for twenty days. He (the Imam) said that Allah, most Majestic, most Glorious, disdained and rejected the words of these women against His Messenger and sent revelation that said, ‘O Prophet, say to your wives, “If you want the worldly life and its beauty become prepared . . . great reward.’” He (the Imam) said that they chose the Messenger of Allah. Had they chosen themselves they would have become stranger to him (the Messenger of Allah) and they chose the Messenger of Allah, then not anything else happened.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/232)"
        ],
        "index": 10874,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:62:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ أَبِي نَصْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ عَبْدِ الْأَعْلَى بْنِ أَعْيَنَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ يَقُولُ إِنَّ بَعْضَ نِسَاءِ النَّبِيِّ ( صلى الله عليه وآله ) قَالَتْ أَ يَرَى مُحَمَّدٌ أَنَّهُ إِنْ طَلَّقَنَا لَا نَجِدُ الْأَكْفَاءَ مِنْ قَوْمِنَا قَالَ فَغَضِبَ اللَّهُ عَزَّ وَ جَلَّ مِنْ فَوْقِ سَبْعِ سَمَاوَاتِهِ فَأَمَرَهُ فَخَيَّرَهُنَّ حَتَّى انْتَهَى إِلَى زَيْنَبَ بِنْتِ جَحْشٍ فَقَامَتْ وَ قَبَّلَتْهُ وَ قَالَتْ أَخْتَارُ اللَّهَ وَ رَسُولَهُ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ibn Abu Nasr, from Hammad Bin Usman, from Abdul A’ala Bin ayn who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying that one of the wives of the Prophet<sup>saww</sup> said, ‘Does Muhammad<sup>saww</sup> view that if he<sup>saww</sup> were to divorce us we would not find our matches from our people?’ So Allah<sup>azwj</sup> Mighty and Majestic was Angered from above the seven skies. So He<sup>azwj</sup> Commanded it, so he<sup>saww</sup> gave them a choice until he<sup>saww</sup> ended up with Zaynab Bint Jahash. So she stood up, and kissed him<sup>saww</sup> and said, ‘I choose Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from ibn abu Nasr from Hammad ibn ‘Uthaman from ‘Abd al-‘Ala’ ibn ’A‘yan who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ‘Certain ones of the wives of the Holy Prophet, had said, ‘Does Muhammad think that if he divorces us, no one from our people will marry us?’ He (the Imam) said that Allah, most Majestic, most Glorious, became angry from above the seven heavens and commanded him (the Messenger of Allah) and he gave them the choice until it was the turn of Zaynab bint Jahash. She stood and kissed him (the Messenger of Allah) and accepted, saying, “I choose Allah and His Messenger.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/232)"
        ],
        "index": 10875,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:62:4",
        "relations": {
          "Mentions": [
            "/books/quran:33:28"
          ]
        },
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ جَعْفَرِ بْنِ سَمَاعَةَ عَنْ دَاوُدَ بْنِ سِرْحَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ زَيْنَبَ بِنْتَ جَحْشٍ قَالَتْ أَ يَرَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنْ خَلَّى سَبِيلَنَا أَنَّا لَا نَجِدُ زَوْجاً غَيْرَهُ وَ قَدْ كَانَ اعْتَزَلَ نِسَاءَهُ تِسْعاً وَ عِشْرِينَ لَيْلَةً فَلَمَّا قَالَتْ زَيْنَبُ الَّذِي قَالَتْ بَعَثَ اللَّهُ عَزَّ وَ جَلَّ جَبْرَئِيلَ إِلَى مُحَمَّدٍ ( صلى الله عليه وآله ) فَقَالَ قُلْ لِأَزْواجِكَ إِنْ كُنْتُنَّ تُرِدْنَ الْحَياةَ الدُّنْيا وَ زِينَتَها فَتَعالَيْنَ أُمَتِّعْكُنَّ الْآيَتَيْنِ كِلْتَيْهِمَا فَقُلْنَ بَلْ نَخْتَارُ اللَّهَ وَ رَسُولَهُ وَ الدَّارَ الْآخِرَةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Ibn Sama’at, from Ja’far Bin sama’at, from Dawood Bin Sirhan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Zaynab Bint Jahash said, ‘Does Muhammad<sup>saww</sup> view that if he<sup>saww</sup> were to free our way we would not find husbands other than him<sup>saww</sup>?’ And he<sup>saww</sup> had detached from his<sup>saww</sup> wives for twenty-nine nights. So when Zaynab said which she said, Allah<sup>azwj</sup> Mighty and Majestic Sent Jibraeel<sup>as</sup> to Muhammad<sup>saww</sup>, so he<sup>as</sup> said <span class=\"ibTxt\"><a href=\"/#/books/quran:33#h28\">[33:28]</a> O Prophet! Say to your wives: If you desire the life of the world and its adornment, then come, I will give you a provision</span> – both the two Verses. So they said, ‘But we choose Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup> and the House of the Hereafter’."
          ],
          "en.sarwar": [
            "4. Humayd ibn Ziyad has narrated from ibn Sama‘ah from Ja‘far ibn Sama‘ah from Dawud ibn Sarhan who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Zaynab bint Jahash once said, ‘Does the Messenger of Allah think that if he divorces us we will not find anyone other than him to marry us?’ He had stayed away from his wives for twenty-nine days. When Zaynab said this Allah, most Majestic, most Glorious, sent Jibril to Muhammad, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. He said, ‘Say to your wives, “If you want the worldly life and its beauty, then be prepared he will benefit you . . .” They said, ‘We choose Allah and His Messenger and the house in the hereafter.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/232)"
        ],
        "index": 10876,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:62:5",
        "relations": {
          "Mentions": [
            "/books/quran:33:28"
          ]
        },
        "text": [
          "عَنْهُ عَنِ الْحَسَنِ بْنِ سَمَاعَةَ عَنْ وُهَيْبِ بْنِ حَفْصٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ زَيْنَبَ بِنْتَ جَحْشٍ قَالَتْ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) لَا تَعْدِلُ وَ أَنْتَ نَبِيٌّ فَقَالَ تَرِبَتْ يَدَاكِ إِذَا لَمْ أَعْدِلْ فَمَنْ يَعْدِلُ فَقَالَتْ دَعَوْتَ اللَّهَ يَا رَسُولَ اللَّهِ لِيَقْطَعَ يَدَيَّ فَقَالَ لَا وَ لَكِنْ لَتَتْرَبَانِ فَقَالَتْ إِنَّكَ إِنْ طَلَّقْتَنَا وَجَدْنَا فِي قَوْمِنَا أَكْفَاءَنَا فَاحْتُبِسَ الْوَحْيُ عَنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) تِسْعاً وَ عِشْرِينَ لَيْلَةً",
          "ثُمَّ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) فَأَنِفَ اللَّهُ عَزَّ وَ جَلَّ لِرَسُولِهِ فَأَنْزَلَ يا أَيُّهَا النَّبِيُّ قُلْ لِأَزْواجِكَ إِنْ كُنْتُنَّ تُرِدْنَ الْحَياةَ الدُّنْيا وَ زِينَتَها الْآيَتَيْنِ فَاخْتَرْنَ اللَّهَ وَ رَسُولَهُ فَلَمْ يَكُ شَيْئاً وَ لَوِ اخْتَرْنَ أَنْفُسَهُنَّ لَبِنَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Al Hassan Bin Sama’at, from Wuheyb Bin Hafs, from Abu Baseer, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Zaynab Bin Jahash said to Rasool-Allah<sup>saww</sup>, ‘You<sup>saww</sup> are not being just and you<sup>asws</sup> are a Prophet<sup>saww</sup>’. So he<sup>saww</sup> said: ‘Dust be on your hands! If I<sup>saww</sup> am not just so who is just?’ So she said, ‘You<sup>saww</sup> have supplicated, O Rasool-Allah<sup>saww</sup> for my hands to be cut-off?’ So he<sup>saww</sup> said: ‘No, but for them to be dusty’. So she said, ‘If you<sup>saww</sup> were to divorce us, we would find our matches among our people’. So the Revelation was withheld from Rasool-Allah<sup>saww</sup> for twenty-nine nights (to Decide their matter).",
            "Then, Abu Ja’far<sup>asws</sup> said: ‘So Allah<sup>azwj</sup> Mighty and Majestic Condemned (them on behalf of) His<sup>azwj</sup> Rasool<sup>saww</sup>, so He<sup>azwj</sup> Revealed <span class=\"ibTxt\"><a href=\"/#/books/quran:33#h28\">[33:28]</a> O Prophet! Say to your wives: If you desire the life of the world and its adornment</span> – the two Verses. So they chose Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>, so nothing occurred, and had they chosen themselves, they would have been irrevocably divorced’."
          ],
          "en.sarwar": [
            "5. It is narrated from the narrator of the previous Hadith from al-Husayn ibn Sama‘ah from Wuhayb ibn Hafs from abu Basir who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said that once Zaynab bint Jahash said to the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, ‘You are not fair and you are the Prophet.’ He (the Messenger of Allah) replied, ‘May your hands become soiled, ‘If I am not fair then who is fair?’ She then asked, ‘O Messenger of Allah, did you pray that my hands get cut off?’ He (the Messenger of Allah) replied, ‘No, but they become soiled.’ She then said, ‘If you divorce us we will find in our people men as our match who will marry us.’ Revelation stopped coming for twenty-nine nights.’ Abu Ja‘far, Alayhi al-Salam, then said, ‘Allah, most Majestic, most Glorious, disdained and rejected her words and sent revelation that said, ‘O Prophet, say to your wives, “If you want the worldly life and its beauty . . .” to the end of the two verses. They chose Allah and His Messenger then further things did not happen. Had they chosen themselves they would have become stranger to him (the Messenger of Allah).”’ (‘Your hands become soiled’ may mean poverty and it may also mean wealth) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/233)"
        ],
        "index": 10877,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:62:6",
        "text": [
          "وَ عَنْهُ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ مِثْلَهُ .",
          "وَ بِهَذَا الْإِسْنَادِ عَنْ يَعْقُوبَ بْنِ سَالِمٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الرَّجُلِ إِذَا خَيَّرَ امْرَأَتَهُ فَقَالَ إِنَّمَا الْخِيَرَةُ لَنَا لَيْسَ لِأَحَدٍ وَ إِنَّمَا خَيَّرَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِمَكَانِ عَائِشَةَ فَاخْتَرْنَ اللَّهَ وَ رَسُولَهُ وَ لَمْ يَكُنْ لَهُنَّ أَنْ يَخْتَرْنَ غَيْرَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "<span style=\"font-size: small\">And from him, from Abdullah Bin Jabala, from Ali Bin Abu Hamza, from Abu Baseer</span> – similar to it.",
            "And by this chain, from Yaqoub Bin Salim, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the man when he gives a choise to his wife. So he<sup>asws</sup> said: ‘But rather, the choice is for us<sup>asws</sup> and not for anyone (else), and rather Rasool-Allah<sup>saww</sup> gave a choice to Ayesha at her place, so she chose Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>, and it was not for her that she chooses other than Rasool-Allah<sup>saww</sup>’."
          ],
          "en.sarwar": [
            "6. Through the same chain of narrators as that of the previous Hadith the following is narrated from Ya’qub ibn Salim from Muhammad ibn Muslim who has said the following: “About the case of a man who gives his wife the choice abu ‘Abd Allah, Alayhi al-Salam, has said, ‘The choice is only for us and not for anyone else. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, gave the choice because of the words of ‘A’ishah. They then chose Allah and His Messenger and they must not have chosen anyone other than the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:2:62",
  "kind": "verse_list"
}