{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:6:2", "titles": {"ar": "كتاب الطلاق ", "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "}}, {"indexed_titles": {"en": "Chapter 67"}, "path": "/books/al-kafi:6:2:67", "titles": {"ar": "باب الْمَفْقُودِ", "en": "Chapter 67 – The lost"}}], "index": 1661, "local_index": 67, "part_type": "Chapter", "path": "/books/al-kafi:6:2:67", "titles": {"ar": "باب الْمَفْقُودِ", "en": "Chapter 67 – The lost"}, "verse_count": 4, "verse_start_index": 10904, "verses": [{"index": 10905, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:2:67:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ سُئِلَ عَنِ الْمَفْقُودِ فَقَالَ الْمَفْقُودُ إِذَا مَضَى لَهُ أَرْبَعُ سِنِينَ بَعَثَ الْوَالِي أَوْ يَكْتُبُ إِلَى النَّاحِيَةِ الَّتِي هُوَ غَائِبٌ فِيهَا فَإِنْ لَمْ يُوجَدْ لَهُ أَثَرٌ أَمَرَ الْوَالِي وَلِيَّهُ أَنْ يُنْفِقَ عَلَيْهَا فَمَا أَنْفَقَ عَلَيْهَا فَهِيَ امْرَأَتُهُ \nقَالَ قُلْتُ فَإِنَّهَا تَقُولُ فَإِنِّي أُرِيدُ مَا تُرِيدُ النِّسَاءُ قَالَ لَيْسَ ذَلِكَ لَهَا وَ لَا كَرَامَةَ فَإِنْ لَمْ يُنْفِقْ عَلَيْهَا وَلِيُّهُ أَوْ وَكِيلُهُ أَمَرَهُ أَنْ يُطَلِّقَهَا فَكَانَ ذَلِكَ عَلَيْهَا طَلَاقاً وَاجِباً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said about the lost one. So he<sup>asws</sup> said: ‘The lost one, where there pass by four years for him, the ruler should write to the area in which he disappeared in. So if no trace is found for him, the ruler would order his guardian that he should spend upon her. So whatever he spends upon her, she is his wife’. \nHe (the narrator) said, ‘I said, ‘Suppose she is saying, ‘I want what the women want’. He<sup>asws</sup> said: ‘That is not for her, nor is it honourable. So if his guardian or his representative does not spend upon her, he would be instructed to divorce her, so that would be an Obligatory divorce for her’."}]}, {"index": 10906, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:2:67:2", "text": "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ بُرَيْدِ بْنِ مُعَاوِيَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْمَفْقُودِ كَيْفَ يُصْنَعُ بِامْرَأَتِهِ قَالَ مَا سَكَتَتْ عَنْهُ وَ صَبَرَتْ يُخَلَّى عَنْهَا فَإِنْ هِيَ رَفَعَتْ أَمْرَهَا إِلَى الْوَالِي أَجَّلَهَا أَرْبَعَ سِنِينَ ثُمَّ يَكْتُبُ إِلَى الصُّقْعِ الَّذِي فُقِدَ فِيهِ فَلْيُسْأَلْ عَنْهُ فَإِنْ خُبِّرَ عَنْهُ بِحَيَاةٍ صَبَرَتْ وَ إِنْ لَمْ يُخْبَرْ عَنْهُ بِشَيْ‏ءٍ حَتَّى تَمْضِيَ الْأَرْبَعُ سِنِينَ دُعِيَ وَلِيُّ الزَّوْجِ الْمَفْقُودِ فَقِيلَ لَهُ هَلْ لِلْمَفْقُودِ مَالٌ فَإِنْ كَانَ لَهُ مَالٌ أُنْفِقَ عَلَيْهَا حَتَّى يُعْلَمَ حَيَاتُهُ مِنْ مَوْتِهِ \nوَ إِنْ لَمْ يَكُنْ لَهُ مَالٌ قِيلَ لِلْوَلِيِّ أَنْفِقْ عَلَيْهَا فَإِنْ فَعَلَ فَلَا سَبِيلَ لَهَا إِلَى أَنْ تَتَزَوَّجَ وَ إِنْ لَمْ يُنْفِقْ عَلَيْهَا أَجْبَرَهُ الْوَالِي عَلَى أَنْ يُطَلِّقَ تَطْلِيقَةً فِي اسْتِقْبَالِ الْعِدَّةِ وَ هِيَ طَاهِرٌ فَيَصِيرُ طَلَاقُ الْوَلِيِّ طَلَاقَ الزَّوْجِ فَإِنْ جَاءَ زَوْجُهَا مِنْ قَبْلِ أَنْ تَنْقَضِيَ عِدَّتُهَا مِنْ يَوْمَ طَلَّقَهَا الْوَلِيُّ فَبَدَا لَهُ أَنْ يُرَاجِعَهَا فَهِيَ امْرَأَتُهُ وَ هِيَ عِنْدَهُ عَلَى تَطْلِيقَتَيْنِ فَإِنِ انْقَضَتِ الْعِدَّةُ قَبْلَ أَنْ يَجِي‏ءَ أَوْ يُرَاجِعَ فَقَدْ حَلَّتْ لِلْأَزْوَاجِ وَ لَا سَبِيلَ لِلْأَوَّلِ عَلَيْهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Bureyd Bin Muawiya who said, \n‘I asked Abu Abdullah<sup>asws</sup> about the lost one, how should his wife be dealt with?’ He<sup>asws</sup> said: ‘If she is silent from it and has been patient, she would be left alone, but if she raises her matter to the ruler, her term is four years. Then he should write to the region in which he disappeared. So let him ask about him, and if there is news of him being alive, she has to be patience, and if there is no news about him, until the four years have passed, he would call the guardian of the lost husband, so he would say to him, ‘Is there wealth for the lost one?’ So if there was wealth for the lost for him, it would be spent upon her until his living from his death would be known. \nAnd if there is no wealth for him, he would say to the guardian, ‘Spend upon her. So if he were to do that, so there is no way for her to be remarried, and if he does not spend upon her, the ruler would compel him that he should divorce with one divorce during the inception of the waiting period and she is pure. Thus a divorce of the guardian would be a divorce of the husband. So if her husband were to come before the fulfillment of her waiting period, from the day the guardian divorced her, so it would be inevitable for him to revert to her, for she is his wife, and she is with him upon the two (remaining) divorces. So if her waiting period has passed before he is (found) alive, or he returns, so she is free for the marriage, and there is no way for the first (husband) upon her’."}]}, {"index": 10907, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:6:2:67:3", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي امْرَأَةٍ غَابَ عَنْهَا زَوْجُهَا أَرْبَعَ سِنِينَ وَ لَمْ يُنْفَقْ عَلَيْهَا وَ لَا يُدْرَى أَ حَيٌّ هُوَ أَمْ مَيِّتٌ أَ يُجْبَرُ وَلِيُّهُ عَلَى أَنْ يُطَلِّقَهَا قَالَ نَعَمْ وَ إِنْ لَمْ يَكُنْ لَهُ وَلِيٌّ طَلَّقَهَا السُّلْطَانُ \nقُلْتُ فَإِنْ قَالَ الْوَلِيُّ أَنَا أُنْفِقُ عَلَيْهَا قَالَ فَلَا يُجْبَرُ عَلَى طَلَاقِهَا قَالَ قُلْتُ أَ رَأَيْتَ إِنْ قَالَتْ أَنَا أُرِيدُ مِثْلَ مَا تُرِيدُ النِّسَاءُ وَ لَا أَصْبِرُ وَ لَا أَقْعُدُ كَمَا أَنَا قَالَ لَيْسَ لَهَا ذَلِكَ وَ لَا كَرَامَةَ إِذَا أَنْفَقَ عَلَيْهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Ismail, from Muhammad Bin Al Fuzayl, from Abu Al asbbah Al Kinany, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a woman from whom her husband is absent for four years, and he did not spend upon her, and it is not known whether he is alive or dead. Is it allowed for his guardian upon him divorcing her?’ He<sup>asws</sup> said: ‘Yes, and if there does not happen to be a guardian for him, the ruler would divorce her’. \nI said, ‘Supposing the guardian were to say, ‘I shall spend upon her’. He<sup>asws</sup> said: ‘So he (the ruler) is not allowed to divorce her’. I said, ‘What is your<sup>asws</sup> view if she were to say, ‘I want similar to what the women want, and I am not patient, and will not sit just as I am’?’ He<sup>asws</sup> said: ‘That is not for her, nor is it honourable, when she is being spent upon’."}]}, {"index": 10908, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:6:2:67:4", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ سَأَلْتُهُ عَنِ الْمَفْقُودِ فَقَالَ إِنْ عَلِمَتْ أَنَّهُ فِي أَرْضٍ فَهِيَ مُنْتَظِرَةٌ لَهُ أَبَداً حَتَّى تَأْتِيَهَا مَوْتُهُ أَوْ يَأْتِيَهَا طَلَاقُهُ وَ إِنْ لَمْ تَعْلَمْ أَيْنَ هُوَ مِنَ الْأَرْضِ كُلِّهَا وَ لَمْ يَأْتِهَا مِنْهُ كِتَابٌ وَ لَا خَبَرٌ فَإِنَّهَا تَأْتِي الْإِمَامَ \nفَيَأْمُرُهَا أَنْ تَنْتَظِرَ أَرْبَعَ سِنِينَ فَيُطْلَبُ فِي الْأَرْضِ فَإِنْ لَمْ يُوجَدْ لَهُ أَثَرٌ حَتَّى تَمْضِيَ الْأَرْبَعُ سِنِينَ أَمَرَهَا أَنْ تَعْتَدَّ أَرْبَعَةَ أَشْهُرٍ وَ عَشْراً ثُمَّ تَحِلُّ لِلرِّجَالِ فَإِنْ قَدِمَ زَوْجُهَا بَعْدَ مَا تَنْقَضِي عِدَّتُهَا فَلَيْسَ لَهُ عَلَيْهَا رَجْعَةٌ وَ إِنْ قَدِمَ وَ هِيَ فِي عِدَّتِهَا أَرْبَعَةَ أَشْهُرٍ وَ عَشْراً فَهُوَ أَمْلَكُ بِرَجْعَتِهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, and Ali Bin Ibrahim, from his father, altogether from Usman Bin Isa, from Sama’at who said, \n‘I asked him<sup>asws</sup> about the lost one, so he<sup>asws</sup> said: ‘If it is known that he is in a land, so she would wait for him forever until death comes upon her, or his divorce comes to her. And if it is not known where he is from the whole of the earth, and no letter comes from him, nor any news, so she would go to the Imam<sup>asws</sup>. \nHe would order her to wait for four years, and he would seek him in the earth. So if not trace is found for him until four years pass by, he would order her to observe the waiting period of four months and ten (days), then she would be permissible for the men. So if her husband were to come over after the fulfillment of her waiting period, so it is not for him any reversion to her, and if he comes up while she is in her waiting period of four months and (ten) days, so he is in control with reverting back to her’."}]}]}, "index": "al-kafi:6:2:67", "kind": "verse_list"}