{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:6:2",
        "titles": {
          "ar": "كتاب الطلاق ",
          "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 69"
        },
        "path": "/books/al-kafi:6:2:69",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الْمَرْأَةِ يَبْلُغُهَا</span> مَوْتُ زَوْجِهَا أَوْ طَلَاقُهَا فَتَعْتَدُّ ثُمَّ تَزَوَّجُ فَيَجِي‏ءُ زَوْجُهَا",
          "en": "Chapter 68 – The woman to whom reaches (the news of) the death of her husband, or his divorce, so she observes the waiting period, then remarries, and her husband returns"
        }
      }
    ],
    "index": 1670,
    "local_index": 69,
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:2:69",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الْمَرْأَةِ يَبْلُغُهَا</span> مَوْتُ زَوْجِهَا أَوْ طَلَاقُهَا فَتَعْتَدُّ ثُمَّ تَزَوَّجُ فَيَجِي‏ءُ زَوْجُهَا",
      "en": "Chapter 68 – The woman to whom reaches (the news of) the death of her husband, or his divorce, so she observes the waiting period, then remarries, and her husband returns"
    },
    "verse_count": 5,
    "verse_start_index": 10918,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/248)"
        ],
        "index": 10919,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:69:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُوسَى بْنِ بَكْرٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِذَا نُعِيَ الرَّجُلُ إِلَى أَهْلِهِ أَوْ خَبَّرُوهَا أَنَّهُ طَلَّقَهَا فَاعْتَدَّتْ ثُمَّ تَزَوَّجَتْ فَجَاءَ زَوْجُهَا بَعْدُ فَإِنَّ الْأَوَّلَ أَحَقُّ بِهَا مِنْ هَذَا الْآخَرِ دَخَلَ بِهَا أَوْ لَمْ يَدْخُلْ بِهَا وَ لَهَا مِنَ الْأَخِيرِ الْمَهْرُ بِمَا اسْتَحَلَّ مِنْ فَرْجِهَا قَالَ وَ لَيْسَ لِلْآخَرِ أَنْ يَتَزَوَّجَهَا أَبَداً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Musa Bin Bakr, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When the obituary of the man comes to his wife, or she is informed that he has divorced her, so she observes the waiting period, then she remarries. So her husband comes over afterwards, so he is more rightful with her than this later one, whether he has copulated with her or not copulated with her, and for her is the later of the dowers with what she had allowed from her relief’. He<sup>asws</sup> said: ‘And it is not for the later one that he remarries her, ever’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Musa ibn Bakr from Zurarah who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘If a woman receives news of the death of her husband or she is informed about her being divorced by her husband and she counts her waiting period. Thereafter marries then her previous husband comes. The first one is more rightful than the second one, regardless, he (the second) has gone to bed with her or not, but she can demand mahr (dower) from the second one because of his going to bed with her and the second one can thereafter never lawfully marry her again.”’ Abu al-‘Abbas al-Razzaz, Muhammad ibn Ja‘far has narrated from abu Ayyub ibn Nuh. Abu Ali al- Ash‘ariy has narrated from Muhammad ibn ‘Abd al-Jabbar Ahmad ibn Muhammad from Muhammad ibn Tsma’il has narrated from al-Fadl ibn Shadhan from all from Safwan from Musa ibn Bakr from Zurarah from abu Ja‘far, ‘Alayhi al-Salam, a similar Hadith. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/249)"
        ],
        "index": 10920,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:69:2",
        "text": [
          "أَبُو الْعَبَّاسِ الرَّزَّازُ مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ أَيُّوبَ بْنِ نُوحٍ وَ أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنْ صَفْوَانَ عَنْ مُوسَى بْنِ بَكْرٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) مِثْلَهُ .",
          "مُحَمَّدٌ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْعَلَاءِ وَ أَبِي أَيُّوبَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلَيْنِ شَهِدَا عَلَى رَجُلٍ غَائِبٍ عِنْدَ امْرَأَةٍ أَنَّهُ طَلَّقَهَا فَاعْتَدَّتِ الْمَرْأَةُ وَ تَزَوَّجَتْ ثُمَّ إِنَّ الزَّوْجَ الْغَائِبَ قَدِمَ فَزَعَمَ أَنَّهُ لَمْ يُطَلِّقْهَا وَ أَكْذَبَ نَفْسَهُ أَحَدُ الشَّاهِدَيْنِ فَقَالَ لَا سَبِيلَ لِلْأَخِيرِ عَلَيْهَا وَ يُؤْخَذُ الصَّدَاقُ مِنَ الَّذِي شَهِدَ فَيُرَدُّ عَلَى الْأَخِيرِ وَ الْأَوَّلُ أَمْلَكُ بِهَا وَ تَعْتَدُّ مِنَ الْأَخِيرِ وَ لَا يَقْرَبْهَا الْأَوَّلُ حَتَّى تَنْقَضِيَ عِدَّتُهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Al Abbas Al Razzaz Muhammad Bin Ja’far, from Ayoub Bin Noh, and Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Safwan, from Musa Bin Bakr, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> – similar to it’.",
            "Muhammad, from Ahmad Bin Muhammad, from Ibn Mahboub, from Al A’ala, and Abu Ayoub, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked Him<sup>asws</sup> about two men who testified upon an absent man in the presence of a woman that he had divorced her. So she observes the waiting period, and remarries (to another man). Then the absent husband comes over, so he claims that he did not divorce her, and one of the two witnesses belies upon himself. So he<sup>asws</sup> said: ‘There is no way for the later one upon her, and the dower would be taken from the one who witnesses and it would be returned upon the later one, and the first one is in control with her, and she would observe the waiting period from the later one, and the first one would not go near her until her waiting period passes by’."
          ],
          "en.sarwar": [
            "2. Muhammad has narrated from Ahmad ibn Muhammad from ibn Mahbub from ‘Ila’ (swearing) and abu Ayyub from Muhammad ibn Muslim who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about the case of a woman before whom two men testify that her absent husband has divorced her and she counts waiting period then marries; then the absent husband comes. He says that he has not divorced her and one of the two testifying people says that he has lied. He (the Imam) said, ‘The second has no way to her and the one who testified must pay the mahr (dower) to the second man and she must count her waiting period because of the second marriage. The first husband must not go near her until her waiting period is complete.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/249)"
        ],
        "index": 10921,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:69:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ رَجُلٍ حَسِبَ أَهْلُهُ أَنَّهُ قَدْ مَاتَ أَوْ قُتِلَ فَنَكَحَتِ امْرَأَتُهُ وَ تَزَوَّجَتْ سُرِّيَّتُهُ فَوَلَدَتْ كُلُّ وَاحِدَةٍ مِنْهُمَا مِنْ زَوْجِهَا فَجَاءَ زَوْجُهَا الْأَوَّلُ وَ مَوْلَى السُّرِّيَّةِ قَالَ فَقَالَ يَأْخُذُ امْرَأَتَهُ فَهُوَ أَحَقُّ بِهَا وَ يَأْخُذُ سُرِّيَّتَهُ وَ وَلَدَهَا أَوْ يَأْخُذُ عِوَضاً مِنْ ثَمَنِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and a number of our companions, from Sahl Bin Ziyad, altogether from Ibn Abu Najran, from Aasim Bin Humeyd, from Muhammad Bin Qays who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about a man whose wife reckoned that he had died, or been killed. So his wife as well as his concubine remarried. So each one of then gave birth from her husband. So the first husband and master of the concubine came over’. So he<sup>asws</sup> said: ‘He would take his wife, for he is more rightful with her, and he would take the concubine, and her child, or take its price in place of it’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father and A number of our people have narrated from Sahl ibn Ziyad all from ibn abu Najran from ‘Asem ibn Hamid ibn Qays who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about the case of a man whose wife thinks that he has died or is killed; thus she marries as well as his slave-girl and both give birth to their husband; then the first husband comes and the master of the slave-girl. He (the Imam) said, ‘He takes back his wife because he has the right to do so. He also takes back his slave-girl and her child or the cost of the child’s value.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/250)"
        ],
        "index": 10922,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:69:4",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ أَبِي بَصِيرٍ وَ غَيْرِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ فِي شَاهِدَيْنِ شَهِدَا عَلَى امْرَأَةٍ بِأَنَّ زَوْجَهَا طَلَّقَهَا أَوْ مَاتَ فَتَزَوَّجَتْ ثُمَّ جَاءَ زَوْجُهَا قَالَ يُضْرَبَانِ الْحَدَّ وَ يُضَمَّنَانِ الصَّدَاقَ لِلزَّوْجِ بِمَا غَرَّاهُ ثُمَّ تَعْتَدُّ وَ تَرْجِعُ إِلَى زَوْجِهَا الْأَوَّلِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazaan, and Ali Bin Ibrahim, from his father, altogether from Ibn Abu Umeyr, from Ibrahim Bin Abdul Hameed, from Abu Baseer, and someone else, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said regarding two witnesses having testified upon a woman with her husband having divorced her, or had died. So she remarried. Then her (former) husband came over. He<sup>asws</sup> said: ‘They would both be whipped the legal penalty (Hadd), and both be responsible for the dower to the (second) husband with what they had deceived him. Then she would observe the waiting period and return to her first husband’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from and Ali ibn Ibrahim has narrated from his father all from ibn abu ‘Umayr from Ibrahim ibn ‘Abd al-Hamid from abu Basir and others who has said the following: “About the case of two witnesses who testify that a woman’s husband has divorced her or that he has died, thus, she marries, then the husband comes, abu ‘Abd Allah, ‘Alayhi al-Salam, has stated this Hadith. ‘They are whipped for their crime. They are held responsible for the mahr (dower) to be paid to the husband for deceit; then she counts waiting period and returns to her first husband.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق أو حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/250)"
        ],
        "index": 10923,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:69:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ أَبِي نَصْرٍ عَنْ عَبْدِ الْكَرِيمِ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِذَا نُعِيَ الرَّجُلُ إِلَى أَهْلِهِ أَوْ خَبَّرُوهَا أَنَّهُ قَدْ طَلَّقَهَا فَاعْتَدَّتْ ثُمَّ تَزَوَّجَتْ فَجَاءَ زَوْجُهَا الْأَوَّلُ قَالَ الْأَوَّلُ أَحَقُّ بِهَا مِنَ الْآخَرِ دَخَلَ بِهَا أَوْ لَمْ يَدْخُلْ بِهَا وَ لَهَا مِنَ الْآخَرِ الْمَهْرُ بِمَا اسْتَحَلَّ مِنْ فَرْجِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, and Ali Bin Ibrahim, from his father, altogether from Ibn Abu Nasr, from Abdul Kareen, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When the obituary of the man comes to his wife, or she is informed that he has divorced her, so she observes the waiting period, then remarries. So her first husband comes over. He<sup>asws</sup> said: ‘The first (husband) is more rightful with her than the later one, whether he has copulated with her or not copulated with her, and for her is the dower from the later one with what she had permitted him from her relief’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Sahl ibn Ziyad and Ali ibn Ibrahim has narrated from his father all from ibn abu Nasr from ‘Abd al-Karim from Zurarah who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘If a woman receives news of the death of her husband or she is informed about her being divorced by her husband and she counts her waiting period and thereafter marries, then her previous husband comes. The first one is more rightful than the second one, regardless, he (the second) has gone to bed with her or not; but she can demand mahr (dower) from the second one because of his going to bed with her and the second one can thereafter never lawfully marry her again.”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:2:69",
  "kind": "verse_list"
}