{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:6:2", "titles": {"ar": "كتاب الطلاق ", "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "}}, {"indexed_titles": {"en": "Chapter 70"}, "path": "/books/al-kafi:6:2:70", "titles": {"ar": "باب عِدَّةِ الْمَرْأَةِ مِنَ الْخَصِيِّ", "en": "Chapter 70 – Waiting period of the woman from the eunuch"}}], "index": 1664, "local_index": 70, "part_type": "Chapter", "path": "/books/al-kafi:6:2:70", "titles": {"ar": "باب عِدَّةِ الْمَرْأَةِ مِنَ الْخَصِيِّ", "en": "Chapter 70 – Waiting period of the woman from the eunuch"}, "verse_count": 1, "verse_start_index": 10915, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 10916, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:2:70:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ أَبِي عُبَيْدَةَ قَالَ سُئِلَ أَبُو جَعْفَرٍ ( عليه السلام ) عَنْ خَصِيٍّ تَزَوَّجَ امْرَأَةً وَ فَرَضَ لَهَا صَدَاقاً وَ هِيَ تَعْلَمُ أَنَّهُ خَصِيٌّ فَقَالَ جَائِزٌ فَقِيلَ إِنَّهُ مَكَثَ مَعَهَا مَا شَاءَ اللَّهُ ثُمَّ طَلَّقَهَا هَلْ عَلَيْهَا عِدَّةٌ قَالَ نَعَمْ أَ لَيْسَ قَدْ لَذَّ مِنْهَا وَ لَذَّتْ مِنْهُ ", "قِيلَ لَهُ فَهَلْ كَانَ عَلَيْهَا فِيمَا كَانَ يَكُونُ مِنْهُ وَ مِنْهَا غُسْلٌ قَالَ فَقَالَ إِنْ كَانَتْ إِذَا كَانَ ذَلِكَ مِنْهُ أَمْنَتْ فَإِنَّ عَلَيْهَا غُسْلًا قِيلَ لَهُ فَلَهُ أَنْ يَرْجِعَ عَلَيْهَا بِشَيْ‏ءٍ مِنْ صَدَاقِهَا إِذَا طَلَّقَهَا فَقَالَ لَا ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, and Ali Bin Ibrahim, from his father, altogether from Ibn Mahboub, from Jameel Bin Salij, from Abu Ubeyda who said, ", "‘Abu Ja’far<sup>asws</sup> was asked about a eunuch who married a woman, and obligated a dower for her, and she knew he was a eunuch. So he<sup>asws</sup> said: ‘Allowed’. So it was said, ‘He remained with her for as long as Allah<sup>azwj</sup> so desired, then divorced her. Is there a waiting period upon her?’ He<sup>asws</sup> said: ‘Yes. Did he not achieve pleasure from her, and she achieved pleasure from him?’ ", "It was said to him<sup>asws</sup>, ‘So is there a washing upon her with regards to what happened from him and her?’ So he<sup>asws</sup> said:’ If it was like than from him, she discharged, so upon her is a washing’. It was said to him<sup>asws</sup>, ‘So is there for him if wants something returned from her from her dower when he divorces her?’ He<sup>asws</sup> said: ‘No’."]}}]}, "index": "al-kafi:6:2:70", "kind": "verse_list"}