{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:6:2",
        "titles": {
          "ar": "كتاب الطلاق ",
          "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 74"
        },
        "path": "/books/al-kafi:6:2:74",
        "titles": {
          "ar": "باب اللِّعَانِ",
          "en": "Chapter 73 – The cursing"
        }
      }
    ],
    "index": 1675,
    "local_index": 74,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 75"
        },
        "path": "/books/al-kafi:6:2:75",
        "titles": {
          "ar": "باب طَلَاقِ الْحُرَّةِ تَحْتَ الْمَمْلُوكِ وَ الْمَمْلُوكَةِ تَحْتَ الْحُرِّ",
          "en": "Chapter 74 – Divorce of the free woman under the owned slave, and the slave woman under the free man"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 73"
        },
        "path": "/books/al-kafi:6:2:73",
        "titles": {
          "ar": "باب الظِّهَارِ",
          "en": "Chapter 72 – Al-Zahaar (likening the wife as a mother)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:6:2",
        "titles": {
          "ar": "كتاب الطلاق ",
          "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:2:74",
    "titles": {
      "ar": "باب اللِّعَانِ",
      "en": "Chapter 73 – The cursing"
    },
    "verse_count": 21,
    "verse_start_index": 10963,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/269)"
        ],
        "index": 10964,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/386",
              "text": "ابْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/710",
              "text": "عَبْدِ الْكَرِيمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي نَصْرٍ عَنْ عَبْدِ الْكَرِيمِ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:74:1",
        "text": [
          " لَا يَقَعُ اللِّعَانُ حَتَّى يَدْخُلَ الرَّجُلُ بِأَهْلِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad and Ali Bin Ibrahim, from his father, from Ibn Abu Nasr, from Abdul Kareem, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The cursing does not occur until the man copulates with his wife’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad and Ali ibn Ibrahim has narrated from his father from ibn abu Nasr from ‘Abd al-Karim from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Al-Li‘an (condemnation) does not take place until one goes to bed with his wife/” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/269)"
        ],
        "index": 10965,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/61",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/64",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/327",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/220",
              "text": "أَبَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ أَبَانٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:74:2",
        "text": [
          " لَا تَكُونُ الْمُلَاعَنَةُ وَ لَا الْإِيلَاءُ إِلَّا بَعْدَ الدُّخُولِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Al Hassan Bin Ali, from Aban, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Neither does cursing happen, nor the swearing except after the copulation’."
          ],
          "en.sarwar": [
            "2. Al-Husayn from Muhammad has narrated from Mu‘alla’ ibn Muhammad from al-Hassan ibn Ali from Aban from Muhammad ibn Muslim who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘Condemnation and swearing take place only after going to bed with her.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/270)"
        ],
        "index": 10966,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/251",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1815",
              "text": "الْمُثَنَّى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/196",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنِ الْمُثَنَّى عَنْ زُرَارَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:74:3",
        "relations": {
          "Mentions": [
            "/books/quran:24:4",
            "/books/quran:24:6"
          ]
        },
        "text": [
          " سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ الَّذِينَ يَرْمُونَ أَزْواجَهُمْ وَ لَمْ يَكُنْ لَهُمْ شُهَداءُ إِلَّا أَنْفُسُهُمْ قَالَ هُوَ الْقَاذِفُ الَّذِي يَقْذِفُ امْرَأَتَهُ فَإِذَا قَذَفَهَا ثُمَّ أَقَرَّ أَنَّهُ كَذَبَ عَلَيْهَا جُلِدَ الْحَدَّ وَ رُدَّتْ إِلَيْهِ امْرَأَتُهُ وَ إِنْ أَبَى إِلَّا أَنْ يَمْضِيَ فَيَشْهَدُ عَلَيْهَا أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنَ الصَّادِقِينَ وَ الْخَامِسَةُ يَلْعَنُ فِيهَا نَفْسَهُ إِنْ كَانَ مِنَ الْكَاذِبِينَ ",
          "فَإِنْ أَرَادَتْ أَنْ تَدْفَعَ عَنْ نَفْسِهَا الْعَذَابَ وَ الْعَذَابُ هُوَ الرَّجْمُ شَهِدَتْ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنَ الْكَاذِبِينَ وَ الْخَامِسَةُ أَنَّ غَضَبَ اللَّهِ عَلَيْهَا إِنْ كَانَ مِنَ الصَّادِقِينَ فَإِنْ لَمْ تَفْعَلْ رُجِمَتْ وَ إِنْ فَعَلَتْ دَرَأَتْ عَنْ نَفْسِهَا الْحَدَّ ثُمَّ لَا تَحِلُّ لَهُ إِلَى يَوْمِ الْقِيَامَةِ ",
          "قُلْتُ أَ رَأَيْتَ إِنْ فُرِّقَ بَيْنَهُمَا وَ لَهَا وَلَدٌ فَمَاتَ قَالَ تَرِثُهُ أُمُّهُ وَ إِنْ مَاتَتْ أُمُّهُ وَرِثَهُ أَخْوَالُهُ وَ مَنْ قَالَ إِنَّهُ وَلَدُ زِنًى جُلِدَ الْحَدَّ قُلْتُ يُرَدُّ إِلَيْهِ الْوَلَدُ إِذَا أَقَرَّ بِهِ قَالَ لَا وَ لَا كَرَامَةَ وَ لَا يَرِثُ الِابْنَ وَ يَرِثُهُ الِابْنُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Al Musna, from Zurara who said, ",
            "‘Abu Abdullah<sup>asws</sup> was asked about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:24#h6\">[24:6]</a> And (as for) those who accuse their wives and have no witnesses except for themselves</span>. He<sup>asws</sup> said: ‘He is the slanderer who slanders his wife. So when he has slandered her, then he accepts that he had lied against her. He would be whipped the legal penalty (<span class=\"iTxt\">Hadd</span>), and his wife would be returned to him. And if he refuses except that he stands by it, so he should testify against her with four testimonies by Allah<sup>azwj</sup> that he is from the truthful ones, and fifthly he should curse himself in it, if he was from the liars.  ",
            "So if she intends to repel the punishment from herself, and the punishment is the stoning, she should testify with four testimonies with Allah<sup>azwj</sup> that he is from the liars, and the fifth that the Wrath of Allah<sup>azwj</sup> would be upon her if he was from the truthful ones. So if she does not do that, she would be stoned, and if she does do it, it would stave off the legal penalty (<span class=\"iTxt\">Hadd</span>) from her, then she would not be Permissible for him until the Day of Judgement’. ",
            "I said, ‘What is your<sup>asws</sup> view if there is separation between the two of them and for her is a child, so it dies’. He<sup>asws</sup> said: ‘Its mother would inherit it, and if its mother dies, its maternal uncles would inherit it, and the one who says that he is a son of adultery would be whipped the legal penalty (<span class=\"iTxt\">Hadd</span>)’. I said, ‘Would the child be returned to him if he accepts it?’ He<sup>asws</sup> said: ‘No, and there is no honour, and the father would not inherit it, but the son would inherit him’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad from ibn abu Nasr from al-Muthanna’ from Zurarah who has said the following: “Once abu ‘Abd Allah, ‘Alayhi al-Salam, was asked about the words of Allah, most Majestic, most Glorious, ‘Those who accuse their wives and do not have witnesses except themselves. . . <a href=\"/#/books/quran:24#h4\">[24:4]</a> He (the Imam) said, ‘He is one who accuses his wife. If he accuses then confesses that he has lied against her, the punishment for him is whipping and his wife is returned to him. If he refuses and goes ahead he must testify four times against her, by Allah, that he is truthful. For the fifth time he must condemn himself if he is of the lying people. If she wanted to defend herself against suffering (punishment and penalty), which is to be stoned, she must testify four times, by Allah, that he is of the lying people and for the fifth time must condemn herself by saying that she must be subjected to the anger of Allah if he has spoken the truth. If she did not do it she then is stoned but if she defended herself, penalty is diverted from her and thereafter she will never become lawful for him in marriage until the day of Day of Judgment.’ I then asked, ‘What happens if they are separated and she has a child who dies? He (the Imam) said, ‘His mother inherits him and if his mother dies his maternal uncles inherit him. Those who say that he is born out of wedlock must be punished by whipping.’ I then asked, ‘Is the child returned to him if he confesses that he has lied?’ He (the Imam) said, ‘No, it is not honorable. He does not inherit the son but the son inherits him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/270)"
        ],
        "index": 10967,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/213",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:74:4",
        "text": [
          " إِنَّ عَبَّادَ الْبَصْرِيِّ سَأَلَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا حَاضِرٌ كَيْفَ يُلَاعِنُ الرَّجُلُ الْمَرْأَةَ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ رَجُلًا مِنَ الْمُسْلِمِينَ أَتَى رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ يَا رَسُولَ اللَّهِ أَ رَأَيْتَ لَوْ أَنَّ رَجُلًا دَخَلَ مَنْزِلَهُ فَوَجَدَ مَعَ امْرَأَتِهِ رَجُلًا يُجَامِعُهَا مَا كَانَ يَصْنَعُ قَالَ فَأَعْرَضَ عَنْهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ انْصَرَفَ ذَلِكَ الرَّجُلُ وَ كَانَ ذَلِكَ الرَّجُلُ هُوَ الَّذِي ابْتُلِيَ بِذَلِكَ مِنِ امْرَأَتِهِ ",
          "قَالَ فَنَزَلَ عَلَيْهِ الْوَحْيُ مِنْ عِنْدِ اللَّهِ عَزَّ وَ جَلَّ بِالْحُكْمِ فِيهِمَا فَأَرْسَلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِلَى ذَلِكَ الرَّجُلِ فَدَعَاهُ فَقَالَ لَهُ أَنْتَ الَّذِي رَأَيْتَ مَعَ امْرَأَتِكَ رَجُلًا فَقَالَ نَعَمْ فَقَالَ لَهُ انْطَلِقْ فَأْتِنِي بِامْرَأَتِكَ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ قَدْ أَنْزَلَ الْحُكْمَ فِيكَ وَ فِيهَا",
          "قَالَ فَأَحْضَرَهَا زَوْجُهَا فَأَوْقَفَهُمَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) ثُمَّ قَالَ لِلزَّوْجِ اشْهَدْ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّكَ لَمِنَ الصَّادِقِينَ فِيمَا رَمَيْتَهَا بِهِ قَالَ فَشَهِدَ ثُمَّ قَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَمْسِكْ وَ وَعَظَهُ ثُمَّ قَالَ اتَّقِ اللَّهَ فَإِنَّ لَعْنَةَ اللَّهِ شَدِيدَةٌ ثُمَّ قَالَ لَهُ اشْهَدِ الْخَامِسَةَ أَنَّ لَعْنَةَ اللَّهِ عَلَيْكَ إِنْ كُنْتَ مِنَ الْكَاذِبِينَ قَالَ فَشَهِدَ ثُمَّ أَمَرَ بِهِ فَنُحِّيَ",
          "ثُمَّ قَالَ لِلْمَرْأَةِ اشْهَدِي أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّ زَوْجَكِ لَمِنَ الْكَاذِبِينَ فِيمَا رَمَاكِ بِهِ قَالَ فَشَهِدَتْ ثُمَّ قَالَ لَهَا أَمْسِكِي فَوَعَظَهَا وَ قَالَ لَهَا اتَّقِي اللَّهَ فَإِنَّ غَضَبَ اللَّهِ شَدِيدٌ ثُمَّ قَالَ لَهَا اشْهَدِي الْخَامِسَةَ أَنَّ غَضَبَ اللَّهِ عَلَيْكِ إِنْ كَانَ زَوْجُكِ مِنَ الصَّادِقِينَ فِيمَا رَمَاكِ بِهِ قَالَ فَشَهِدَتْ ",
          "قَالَ فَفَرَّقَ بَيْنَهُمَا وَ قَالَ لَهُمَا لَا تَجْتَمِعَا بِنِكَاحٍ أَبَداً بَعْدَ مَا تَلَاعَنْتُمَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Abdul Rahman Bin Hajjaj who said, ",
            "‘Abbad Al-Basry asked Abu Abdullah<sup>asws</sup> and I was present, ‘How does the man curse the woman?’ So Abu Abdullah<sup>asws</sup> said: ‘A man from the Muslims came over to Rasool-Allah<sup>saww</sup>, so he said, ‘O Rasool-Allah<sup>saww</sup>! What is your<sup>saww</sup> view, if a man were to enter into his house, so he finds a man copulating with his wife, what should he do?’ So Rasool-Allah<sup>saww</sup> turned away from him, and that man went away, and that was the man who was afflicted by that from his wife.",
            "He<sup>asws</sup> said: ‘So a Revelation descended upon him<sup>saww</sup> from the Presence of Allah<sup>azwj</sup> Mighty and Majestic with the judgement regarding both of them. So Rasool-Allah<sup>saww</sup> sent a message to that man calling him over. So he<sup>saww</sup> said to him: ‘Are you the one who saw a man with your wife?’ So he said, ‘Yes’. So he<sup>saww</sup> said: ‘Go and come to me<sup>saww</sup> with your wife, for Allah<sup>azwj</sup> Mighty and Majestic has Revealed the Judgement with regards to you and regarding her’. ",
            "He<sup>asws</sup> said: ‘So her husband presented her. So Rasool-Allah<sup>saww</sup> paused both of them, then said to the husband: ‘Testify with four testimonies by Allah<sup>azwj</sup>, that you are from the truthful ones, regarding what you are accusing her with’. So he testified. The Rasool-Allah<sup>saww</sup> said to him: ‘Wait’, and he<sup>saww</sup> advised him, then said: ‘Fear Allah<sup>azwj</sup>, for the Curse of Allah<sup>azwj</sup> is intense’. Then he<sup>saww</sup> said to him: ‘Testify the fifth that the Curse of Allah<sup>azwj</sup> be upon you if you were from the liars’. So he testified. Then he<sup>saww</sup> commanded for him to stand aside.",
            "Then he<sup>saww</sup> said to the woman: ‘Testify four testimonies that your husband is from the liars with regards to what he is accusing you with’. So she testified. Then he<sup>saww</sup> said to her: ‘Wait’. So he<sup>saww</sup> advised her and said to her: ‘Fear Allah<sup>azwj</sup>, for the Wrath of Allah<sup>azwj</sup> is intense’. Then he<sup>saww</sup> said: ‘Testify the fifth that the Wrath of Allah<sup>azwj</sup> be upon you if your husband was from the truthful ones with regards to what he is accusing you with’. So she testified’. ",
            "He<sup>asws</sup> said: ‘So he<sup>saww</sup> separated the two of them and said to both of them: ‘Do not copulate by marriages, ever, after what you both have cursed with’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn Mahbub from ‘Abd al-Rahman ibn al-Hajja] who has said the following: “Once ‘Abbad al-Basriy asked abu ‘Abd Allah, ‘Alayhi al-Salam, when I was present, ‘How does a man go through the process of Mula ‘inah (condemnation) against the woman?’ Abu ‘Abd Allah, ‘Alayhi al-Salam, explained a judgment of the Messenger of Allah. He (the Imam) said, ‘Once a man of the Muslims came to the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. He asked, “O Messenger of Allah, what happens if a man enters his house and finds a man with his wife involved in sexual intercourse? What must he do?”’ He (the Imam) said that the Messenger of Allah turned away from him and that man left. That man was the one who had faced that issue from his woman. He (the Imam) said that revelation from Allah, most Majestic, most Glorious, came with the commandment about them and the Messenger of Allah sent to summon that man. When he came, he (the Messenger of Allah) asked, ‘Did you see a man with your woman?’ He replied, ‘Yes, that it is true.’ He (the Messenger of Allah) then said, ‘You must go back and bring your woman because Allah, most Majestic, most Glorious, has sent a commandment about you and about her.’ He (the Imam) said that her husband then brought her and the Messenger of Allah held them in custody. He (the Messenger of Allah) said to the man, ‘Testify four times by Allah that you are truthful (of the truthful ones) in your accusing her of what you accuse her.’ He (the Imam) said that he testified; then he (the Messenger of Allah) said, ‘You must wait.’ He (the Messenger of Allah) preached to him and gave him advice then said, ‘Be pious and have fear of Allah; condemnation of Allah is severe.’ He (the Messenger of Allah) then told him to testify for the fifth time and say, ‘Condemnation of Allah will be upon me if I am of the liars.’ He (the Imam) said that the man testified and he (the Messenger of Allah) commanded him and he moved away. Then he (the Messenger of Allah) said to the woman, ‘Do you testify four times that your husband is of the lying people in what he has accused you of?’ He (the Imam) said that she then testified. Then he (the Messenger of Allah) told her to wait. He (the Messenger of Allah) preached to her, gave her good advice and told her to have fear of Allah; the condemnation of Allah is severe. He (the Messenger of Allah) then told her to testify for the fifth time saying that she will be subjected to the anger of Allah if her husband is of the truthful people in what he has accused her of.’ He (the Imam) said that she testified. He (the Imam) said that he (the Messenger of Allah) separated them from each other and told them that they can never come together in marriage after lodging condemnation upon each other.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/271)"
        ],
        "index": 10968,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/4399",
              "text": "الْحَسَنُ بْنُ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2073",
              "text": "عَبَّادِ بْنِ صُهَيْبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4862",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ أَوْقَفَهُ الْإِمَامُ لِلِّعَانِ فَشَهِدَ شَهَادَتَيْنِ ثُمَّ نَكَلَ فَأَكْذَبَ نَفْسَهُ قَبْلَ أَنْ يَفْرُغَ مِنَ اللِّعَانِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحَسَنُ بْنُ مَحْبُوبٍ عَنْ عَبَّادِ بْنِ صُهَيْبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ أَوْقَفَهُ الْإِمَامُ لِلِّعَانِ فَشَهِدَ شَهَادَتَيْنِ ثُمَّ نَكَلَ فَأَكْذَبَ نَفْسَهُ قَبْلَ أَنْ يَفْرُغَ مِنَ اللِّعَانِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:74:5",
        "text": [
          " يُجْلَدُ حَدَّ الْقَاذِفِ وَ لَا يُفَرَّقُ بَيْنَهُ وَ بَيْنَ امْرَأَتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Hassan Bin Mahboub, from Abbad Bin Suheyb, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man whom the leader had paused for the cursing, so he testified with two testimonies, then changed, so he belied himself before he was free from the cursing. He<sup>asws</sup> said: ‘He would be whipped a legal penalty (<span class=\"iTxt\">Hadd</span>) of the slanderer, and there would be no separation between him and his wife’."
          ],
          "en.sarwar": [
            "5. Al-Hassan ibn Mahbub has narrated from ‘Abbad ibn Suhayb who has said the following: “A man is placed under arrest by the Imam in the case of al-Li‘an (condemnation). He testifies twice, then refuses and confesses that he has lied before completing al-Li ‘an (condemnation). Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that he is whipped as the penalty for accusing the woman of committing fornication. He is not separated from his woman.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/271)"
        ],
        "index": 10969,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/317",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/171",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:74:6",
        "text": [
          " إِذَا قَذَفَ الرَّجُلُ امْرَأَتَهُ فَإِنَّهُ لَا يُلَاعِنُهَا حَتَّى يَقُولَ رَأَيْتُ بَيْنَ رِجْلَيْهَا رَجُلًا يَزْنِي بِهَا ",
          "قَالَ وَ سُئِلَ عَنِ الرَّجُلِ يَقْذِفُ امْرَأَتَهُ قَالَ يُلَاعِنُهَا ثُمَّ يُفَرَّقُ بَيْنَهُمَا فَلَا تَحِلُّ لَهُ أَبَداً فَإِنْ أَقَرَّ عَلَى نَفْسِهِ قَبْلَ الْمُلَاعَنَةِ جُلِدَ حَدّاً وَ هِيَ امْرَأَتُهُ ",
          "قَالَ وَ سَأَلْتُهُ عَنِ الْمَرْأَةِ الْحُرَّةِ يَقْذِفُهَا زَوْجُهَا وَ هُوَ مَمْلُوكٌ قَالَ يُلَاعِنُهَا ثُمَّ يُفَرَّقُ بَيْنَهُمَا فَلَا تَحِلُّ لَهُ أَبَداً فَإِنْ أَقَرَّ عَلَى نَفْسِهِ بَعْدَ الْمُلَاعَنَةِ جُلِدَ حَدّاً وَ هِيَ امْرَأَتُهُ ",
          "قَالَ وَ سَأَلْتُهُ عَنِ الْحُرِّ تَحْتَهُ أَمَةٌ فَيَقْذِفُهَا قَالَ يُلَاعِنُهَا ",
          "قَالَ وَ سَأَلْتُهُ عَنِ الْمُلَاعَنَةِ الَّتِي يَرْمِيهَا زَوْجُهَا وَ يَنْتَفِي مِنْ وَلَدِهَا وَ يُلَاعِنُهَا وَ يُفَارِقُهَا ثُمَّ يَقُولُ بَعْدَ ذَلِكَ الْوَلَدُ وَلَدِي وَ يُكْذِبُ نَفْسَهُ فَقَالَ أَمَّا الْمَرْأَةُ فَلَا تَرْجِعُ إِلَيْهِ أَبَداً وَ أَمَّا الْوَلَدُ فَإِنِّي أَرُدُّهُ إِلَيْهِ إِذَا ادَّعَاهُ وَ لَا أَدَعُ وَلَدَهُ وَ لَيْسَ لَهُ مِيرَاثٌ وَ يَرِثُ الِابْنُ الْأَبَ وَ لَا يَرِثُ الْأَبُ الِابْنَ وَ يَكُونُ مِيرَاثُهُ لِأَخْوَالِهِ فَإِنْ لَمْ يَدَّعِهِ أَبُوهُ فَإِنَّ أَخْوَالَهُ يَرِثُونَهُ وَ لَا يَرِثُهُمْ فَإِنْ دَعَاهُ أَحَدٌ ابْنَ الزَّانِيَةِ جُلِدَ الْحَدَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the man slanders his wife, so he cannot curse her unless he is saying, ‘I saw a man between her legs committing adultery with her’. ",
            "He (the narrator) said, ‘And he<sup>asws</sup> was asked about the man who slanders his wife. He<sup>asws</sup> said: ‘He curses her, then there would be separation between the two, so she would not be Permissible for him, ever’. So if he were to confess upon himself before the cursing, he would be whipped a legal penalty (<span class=\"iTxt\">Hadd</span>), and she would be his wife’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about the free woman, her husband accused her, and he was an owned slave. He<sup>asws</sup> said: ‘He would curse her, then there would be separation between the two, so she would not be Permissible for him, ever. So if he were to confess upon himself after the cursing, he would be whipped a legal penalty, and she would be his wife’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about the free man under whom is a slave girl, so he slanders her. He<sup>asws</sup> said: ‘He would curse her’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about the cursed woman who was accused by her husband, and denies from her child, and he curses her, and separates her. Then he is saying after that, ‘The child is my child’, and he belies himself. So he<sup>asws</sup> said: ‘As for the woman, so she would not return to him, ever; and as for the child, so I<sup>asws</sup> would return it to him when he claims it, and I<sup>asws</sup> would not call it as his child, and there is no inheritance for him, and the son would inherit from the father, and the father would not inherit the son, and there would happen to be its inheritance of its maternal uncles. So if its father does not claim it, so its maternal uncles would inherit it, and it shall not inherit them. So if anyone were to call him as a son of adultery, would be whipped the legal penalty (<span class=\"iTxt\">Hadd</span>)’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If a man accuses his wife he cannot condemn her unless he can say that he has seen a man between her legs fornicating.’ He (the narrator) has said that he (the Imam) was asked about the man who accuses. He (the Imam) said, ‘He condemns her and then they are separated from each other. She will never be lawful for him in marriage. However, if he confesses against himself before al-Li ‘an (condemnation) he is whipped as the penalty and she remains his woman.’” “He (the narrator) has said, ‘I asked him (the Imam) about a free person with a slave-girl in his control and about his accusing her. He (the Imam) said, ‘He can deal with it by the process of al-Li ‘an (condemnation).’ “He (the narrator) has said, ‘I asked him (the Imam) about al-Li ‘an (condemnation) in which the husband accuses her, denies her child and goes through the process of al-Li ‘an (condemnation), separates from her and thereafter says, ‘The child is my child’ and calls himself a liar. He (the Imam) said, ‘The woman cannot return to him forever, however, I return the child if he claims him as his child but do not call him his child. He (the man) cannot inherit the child but he inherits the father and the father does not inherit the son. The legacy of the son goes to his maternal uncles. If his father did not claim him his maternal uncles inherit his legacy but he does not inherit them. If anyone calls him the son of fornication such person is whipped as punishment for such crime.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/272)"
        ],
        "index": 10970,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/124",
              "text": "جَمِيلِ بْنِ دَرَّاجٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:74:7",
        "text": [
          " سَأَلْتُهُ عَنِ الْحُرِّ بَيْنَهُ وَ بَيْنَ الْمَمْلُوكَةِ لِعَانٌ فَقَالَ نَعَمْ وَ بَيْنَ الْمَمْلُوكِ وَ الْحُرَّةِ وَ بَيْنَ الْعَبْدِ وَ الْأَمَةِ وَ بَيْنَ الْمُسْلِمِ وَ الْيَهُودِيَّةِ وَ النَّصْرَانِيَّةِ وَ لَا يَتَوَارَثَانِ وَ لَا يَتَوَارَثُ الْحُرُّ وَ الْمَمْلُوكَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel Bin Darraj, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the free man, between him and the slave girl is a cursing?’ So he<sup>asws</sup> said: ‘Yes, and between the slave man and the free woman, and between the slave and the slave woman, and between the Muslim and the Jews, and the Christians; and they would not be inheriting each other, nor does the free and the slave girl inherit each other’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Jamil ibn Darraj who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, if al-Li‘an (condemnation) can take place between a free man and a slave-girl. He (the Imam) said, ’Yes, it can take place between a slave and a free woman, between a slave and a slave-girl, between a Muslim and a Jewish woman or a Christian woman but they do not inherit each other and there is no inheritance between a free and a slave-girl.’ ” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/273)"
        ],
        "index": 10971,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/386",
              "text": "ابْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/710",
              "text": "عَبْدِ الْكَرِيمِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/171",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4863",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ لَاعَنَ امْرَأَتَهُ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4864",
              "text": "هِيَ حُبْلَى ثُمَّ ادَّعَى وَلَدَهَا بَعْدَ مَا وَلَدَتْ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4865",
              "text": "زَعَمَ أَنَّهُ مِنْهُ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي نَصْرٍ عَنْ عَبْدِ الْكَرِيمِ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ لَاعَنَ امْرَأَتَهُ وَ هِيَ حُبْلَى ثُمَّ ادَّعَى وَلَدَهَا بَعْدَ مَا وَلَدَتْ وَ زَعَمَ أَنَّهُ مِنْهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:74:8",
        "text": [
          " يُرَدُّ إِلَيْهِ الْوَلَدُ وَ لَا يُجْلَدُ لِأَنَّهُ قَدْ مَضَى التَّلَاعُنُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, and Ali Bin Ibrahim, from his father, from Ibn Abu Nasr, from Abdul Kareem, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who cursed his wife and she was pregnant. Then he claimed her child after she had given birth, and claimed that it was from him. He<sup>asws</sup> said: ‘The child would be returned to him, and he would not be whipped, because the cursing had passed’."
          ],
          "en.sarwar": [
            "8. A number of our people have narrated from Sahl ibn Ziyad and Ali ibn Ibrahim has narrated from his father from ibn abu Nasr from ‘Abd al-Karim from al-Halabiy who has said the following: “About the case of a man who goes through the process of al-Li ‘an (condemnation) against his wife who is pregnant, then claims her child to be his child after childbirth thinking that the child is his. He (the Imam) said, ‘The child can be given to him without whipping because al-Li‘an (condemnation) has become a matter of the past in the case.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/273)"
        ],
        "index": 10972,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/317",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/171",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4866",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ قَذَفَ امْرَأَتَهُ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4867",
              "text": "هِيَ خَرْسَاءُ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ وَ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ قَذَفَ امْرَأَتَهُ وَ هِيَ خَرْسَاءُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:74:9",
        "text": [
          " يُفَرَّقُ بَيْنَهُمَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, and Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who slandered his wife, and she was mute’. He<sup>asws</sup> said: ‘There would be separation between them’."
          ],
          "en.sarwar": [
            "9. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy from Muhammad ibn Muslim who has said the following: “About the case of a man who goes through the process of al-Li‘an (condemnation) against his wife who is speechless, abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘They must be separated from each other.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/273)"
        ],
        "index": 10973,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/57",
              "text": "عَلِيٌّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/386",
              "text": "ابْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/153",
              "text": "جَمِيلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي نَصْرٍ عَنْ جَمِيلٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:74:10",
        "text": [
          " سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الْمُلَاعِنِ وَ الْمُلَاعَنَةِ كَيْفَ يَصْنَعَانِ قَالَ يَجْلِسُ الْإِمَامُ مُسْتَدْبِرَ الْقِبْلَةِ فَيُقِيمُهُمَا بَيْنَ يَدَيْهِ مُسْتَقْبِلَا الْقِبْلَةِ بِحِذَائِهِ وَ يَبْدَأُ بِالرَّجُلِ ثُمَّ الْمَرْأَةِ وَ الَّتِي يَجِبُ عَلَيْهَا الرَّجْمُ تُرْجَمُ مِنْ وَرَائِهَا وَ لَا يُرْجَمُ مِنْ وَجْهِهَا لِأَنَّ الضَّرْبَ وَ الرَّجْمَ لَا يُصِيبَانِ الْوَجْهَ يُضْرَبَانِ عَلَى الْجَسَدِ عَلَى الْأَعْضَاءِ كُلِّهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Ibn Abu Nasr, from Jameel, from Muhammad Bin Muslim who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about a cursing man and a cursing woman how should they both be dealt with?’ He<sup>asws</sup> said: ‘The Imam<sup>asws</sup> would sit with his<sup>asws</sup> back towards the <span class=\"iTxt\">Qiblah</span>, so he<sup>asws</sup> would be pausing both of them in front of him<sup>asws</sup> facing the <span class=\"iTxt\">Qiblah</span> with his<sup>asws</sup> shoes (towards them), and he<sup>asws</sup> would begin with the man, then the woman, and the one woman upon whom the stoning is Obligated, would be stoned from behind her back, and would not be stoned from her face, because the striking, and the stoning cannot be hitting the face, but both can be stoned upon the body, upon all of the parts’."
          ],
          "en.sarwar": [
            "10. Ali has narrated from his father from ibn abu Nasr from Jamil from Muhammad ibn Muslim who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about the case of a man and woman who are involved in al-Li‘an (condemnation) and about how they do it. He (the Imam) said, ‘The Imam sits with his back to al-Qiblah (al-Ka‘bah) and they stand in front of him facing al-Qiblah (al-Ka‘bah) before him and he begins with the man, then the woman. The woman on whom stoning is obligatory, is stoned from her backside and not from her front side; beating and stoning must not affect the face. Other parts of the body can be targeted in both, beating and stoning.’” [Note: Such cases are only applicable after due Islamic judicial process] "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/274)"
        ],
        "index": 10974,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/3621",
              "text": "أَحْمَدُ بْنُ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:74:11",
        "text": [
          " سَأَلْتُ أَبَا الْحَسَنِ الرِّضَا ( عليه السلام ) قُلْتُ لَهُ أَصْلَحَكَ اللَّهُ كَيْفَ الْمُلَاعَنَةُ قَالَ فَقَالَ يَقْعُدُ الْإِمَامُ وَ يَجْعَلُ ظَهْرَهُ إِلَى الْقِبْلَةِ وَ يَجْعَلُ الرَّجُلَ عَنْ يَمِينِهِ وَ الْمَرْأَةَ عَنْ يَسَارِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad Bin Abu Nasr who said, ",
            "‘I asked Abu Al-Hassan Al-Reza<sup>asws</sup>, I said to him<sup>asws</sup>, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! How is the cursing?’ So he<sup>asws</sup> said: ‘The Imam<sup>asws</sup> would be seated and make his<sup>asws</sup> back towards the <span class=\"iTxt\">Qiblah</span>, and he<sup>asws</sup> would make the man to be upon his<sup>asws</sup> right, and the woman to be upon his<sup>asws</sup> left (facing the <span class=\"iTxt\">Qiblah</span>)’."
          ],
          "en.sarwar": [
            "11. Ahmad ibn Muhammad from ibn abu Nasr has said the following: “I once asked al-Rida’, ‘Alayhi al-Salam, saying, ‘I pray to Allah to keep you well, how is al-Li‘an (condemnation) completed?’ He (the Imam) said, ‘The Imam sits down with his back to the al-Qiblah (al-Ka‘bah) and keeps the man on his right and the woman on his left.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/274)"
        ],
        "index": 10975,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/642",
              "text": "الْعَمْرَكِيِّ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/643",
              "text": "عَلِيِّ بْنِ جَعْفَرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1364",
              "text": "أَخِيهِ أَبِي الْحَسَنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنِ الْعَمْرَكِيِّ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَخِيهِ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:74:12",
        "text": [
          " سَأَلْتُهُ عَنْ رَجُلٍ لَاعَنَ امْرَأَتَهُ فَحَلَفَ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ ثُمَّ نَكَلَ فِي الْخَامِسَةِ قَالَ إِنْ نَكَلَ فِي الْخَامِسَةِ فَهِيَ امْرَأَتُهُ وَ جُلِدَ وَ إِنْ نَكَلَتِ الْمَرْأَةُ عَنْ ذَلِكَ إِذَا كَانَتِ الْيَمِينُ عَلَيْهَا فَعَلَيْهَا مِثْلُ ذَلِكَ ",
          "قَالَ وَ سَأَلْتُهُ عَنِ الْمُلَاعَنَةِ قَائِماً يُلَاعِنُ أَوْ قَاعِداً قَالَ الْمُلَاعَنَةُ وَ مَا أَشْبَهَهَا مِنْ قِيَامٍ ",
          "قَالَ وَ سَأَلْتُهُ عَنْ رَجُلٍ طَلَّقَ امْرَأَتَهُ قَبْلَ أَنْ يَدْخُلَ بِهَا فَادَّعَتْ أَنَّهَا حَامِلٌ قَالَ إِنْ أَقَامَتِ الْبَيِّنَةَ عَلَى أَنَّهُ أَرْخَى سِتْراً ثُمَّ أَنْكَرَ الْوَلَدَ لَاعَنَهَا ثُمَّ بَانَتْ مِنْهُ وَ عَلَيْهِ الْمَهْرُ كَمَلًا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Al Amraky Bin Ali, ",
            "(It has been narrated) from Ali son of Ja’far<sup>asws</sup>, from his brother<sup>asws</sup> Abu Al-Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who cursed his wife, so he swore on oath by Allah<sup>azwj</sup> with four testimonies, then abstained regarding the fifth. He<sup>asws</sup> said: ‘If he abstained regarding the fifth, so she is his wife, and he would be whipped, and if the woman abstained from that, when there was a swear against her, so upon her is similar to that’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about the cursing, would he curse standing or sitting?’ He<sup>asws</sup> said: ‘The cursing and what resembles it is from standing’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about a man who divorces his wife before he copulates with her, so she claims that she is pregnant. He<sup>asws</sup> said: ‘If she establishes the proof that he loosened the veil then denies the child, he can curse her and she would be irrevocably divorced from him, and upon him is the complete dower’."
          ],
          "en.sarwar": [
            "12. Muhammad ibn Yahya has narrated from al-‘Amrakiy ibn Ali from Ali ibn Ja‘far from his brother abu al-Hassan, ‘Alayhi al-Salam, who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about the case of a man who goes through the process of al-Li ‘an (condemnation) against his woman and testifies swearing by Allah four times but declines the fifth time. He (the Imam) said, ‘If he declines the fifth time she is his woman but he is whipped. If the woman declines when swearing is on her, she is subjected to the same process as he was.’ I then asked if al-Li‘an (condemnation) is completed in a sitting or standing position. He (the Imam) said, ‘Al-Li‘an (condemnation) and similar things are done in a standing position.’ “I then asked about a man who has divorced his wife before going to bed with her and then claims that she is pregnant. He (the Imam) said, ‘If he presents proof that he has uncovered a secret then denies the child to be his child, he can go through the process of al-Li‘an (condemnation) and she becomes stranger to him, but he must pay the mahr (dower).’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/275)"
        ],
        "index": 10976,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/214",
              "text": "عَلِيِّ بْنِ رِئَابٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/171",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنِ الْحَلَبِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:74:13",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ لَاعَنَ امْرَأَتَهُ وَ هِيَ حُبْلَى قَدِ اسْتَبَانَ حَمْلُهَا فَأَنْكَرَ مَا فِي بَطْنِهَا فَلَمَّا وَضَعَتْ ادَّعَاهُ وَ أَقَرَّ بِهِ وَ زَعَمَ أَنَّهُ مِنْهُ قَالَ فَقَالَ يُرَدُّ إِلَيْهِ وَلَدُهُ وَ يَرِثُهُ وَ لَا يُجْلَدُ لِأَنَّ اللِّعَانَ قَدْ مَضَى ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, and Ali Bin Ibrahim, from his father, and Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Ali Bin Raib, from Al Halby who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who curses his wife and she is pregnant, and her pregnancy had been identified. So he denies what is in her belly. So when she gives birth, he claims it, and confesses with it, and claims that it is from him. So he<sup>asws</sup> said: ‘His child would be returned to him, and it would inherit him, and he would not be whipped because the cursing had passed’."
          ],
          "en.sarwar": [
            "13. A number of our people have narrated from Sahl ibn Ziyad, Ali ibn Ibrahim has narrated from his father, and Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from ibn Ri’ab from al-Halabiy who has said the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about the case of a man who has gone through the process of al-Li‘an (condemnation) against his wife who is pregnant and her pregnancy has become clear but denies what is in her womb. When the child is born, he claims the child, keeps him close, and thinks that the child is his child. He (the Imam) said, The child is given to him and he inherits him but he is not whipped; al-Li‘an (condemnation) has become a matter of the past in the case.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/275)"
        ],
        "index": 10977,
        "local_index": 14,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/150",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1568",
              "text": "الْعَلَاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4188",
              "text": "أَحَدِهِمَا ( عليهما السلام ) أَنَّهُ سُئِلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4868",
              "text": "عَبْدٍ قَذَفَ امْرَأَتَهُ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْعَلَاءِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) أَنَّهُ سُئِلَ عَنْ عَبْدٍ قَذَفَ امْرَأَتَهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:74:14",
        "text": [
          " يَتَلَاعَنَانِ كَمَا يَتَلَاعَنُ الْحُرَّانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Al A’ala, from Muhammad Bin Muslim, ",
            "(It has been narrated) from one of the two (5th or 6th Imam<sup>asws</sup>) having been asked about a slave having slandered his wife. He<sup>asws</sup> said: ‘They would both curse just as the free ones curse’."
          ],
          "en.sarwar": [
            "14. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from al-‘Ala’ from Muhammad ibn Muslim who has said the following: “I once asked one of the two Imam, (abu Ja‘far or abu ‘Abd Allah), ‘Alayhim al-Salam, about the case of a slave who accuses his woman. He (the Imam) said, ‘They can go through the process of al-Li‘an (condemnation) against each other like free people do.”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/275)"
        ],
        "index": 10978,
        "local_index": 15,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/317",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/195",
              "text": "حَرِيزٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:74:15",
        "text": [
          " سَأَلْتُهُ عَنِ الرَّجُلِ يَفْتَرِي عَلَى امْرَأَتِهِ قَالَ يُجْلَدُ ثُمَّ يُخَلَّى بَيْنَهُمَا وَ لَا يُلَاعِنُهَا حَتَّى يَقُولَ أَشْهَدُ أَنِّي رَأَيْتُكِ تَفْعَلِينَ كَذَا وَ كَذَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad, from Hareyz, from Muhammad Bin Muslim who said, ",
            "‘I asked him<sup>asws</sup> about the man who forges (a lie) upon his wife. He<sup>asws</sup> said: ‘He would be whipped, then there would be loosening between the two of them, and they would not be cursing each other until he is saying, ‘I saw you doing such and such’."
          ],
          "en.sarwar": [
            "15. Ali ibn Ibrahim has narrated from his father, from Hammad from Hariz from Muhammad ibn Muslim who has said the following: “I once asked him (the Imam), Alayhi al-Salam, about the case of a man who falsely accuses his wife. He (the Imam) said, ‘He is whipped, then they are left alone. He does not go through the process of al- Li‘an (condemnation) who then is made to say, ‘I testify that I saw you doing so and so.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/275)"
        ],
        "index": 10979,
        "local_index": 16,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/46",
              "text": "عَلِيِّ بْنِ حَدِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/124",
              "text": "جَمِيلِ بْنِ دَرَّاجٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/524",
              "text": "أَحَدِهِمَا ( عليهما السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:74:16",
        "text": [
          " لَا يَكُونُ اللِّعَانُ إِلَّا بِنَفْيِ وَلَدٍ وَ قَالَ إِذَا قَذَفَ الرَّجُلُ امْرَأَتَهُ لَاعَنَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Hadeed, from Jameel Bin Darraj, from Muhammad Bin Muslim, ",
            "(It has been narrated) from one of the two (5th or the 6th Imam<sup>asws</sup>) having said: ‘The cursing does not happen except by the denial of a child’. And he<sup>asws</sup> said: ‘When the man slanders his wife, he would curse her’."
          ],
          "en.sarwar": [
            "16. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad, from Ali ibn Hadid from Jamil ibn Darraj from Muhammad ibn Muslim who has said the following: “One of the two Imam, (abu Ja‘far or abu ‘Abd Allah), Alayhim al-Salam, has said, ‘al-Li‘an (condemnation) does not take place without denying the child.’ He (the Imam) said, ‘When a man accuses his woman he can go through the process of al-Li‘an (condemnation) against her.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/276)"
        ],
        "index": 10980,
        "local_index": 17,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/262",
              "text": "مُحَمَّدٌ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/181",
              "text": "أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/6",
              "text": "الْعَلَاءِ بْنِ رَزِينٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/68",
              "text": "ابْنِ أَبِي يَعْفُورٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدٌ عَنْ أَحْمَدَ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنِ ابْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:74:17",
        "text": [
          " لَا يُلَاعِنُ الرَّجُلُ الْمَرْأَةَ الَّتِي يَتَمَتَّعُ بِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad, from Ahmad, from Ibn Mahboub, from Al A’ala Bin Razeyn, from Ibn Abu Yafour, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The man cannot curse the woman which he is temporarily married with’."
          ],
          "en.sarwar": [
            "17. Muhammad ibn Ahmad has narrated from ibn Mahbub from al-‘Ala’ ibn Razin from ibn abu Ya‘fur who has said the following: “Abu ‘Abd Allah, Alayhi al-Salam, has said, ‘A man cannot go through the process of al-Li‘an (condemnation) against his wife in the manner of Mut‘ah (advantageous marriage).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/276)"
        ],
        "index": 10981,
        "local_index": 18,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/262",
              "text": "مُحَمَّدٌ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/111",
              "text": "هِشَامِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدٌ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي بَصِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:74:18",
        "text": [
          " سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ قَذَفَ امْرَأَتَهُ بِالزِّنَى وَ هِيَ خَرْسَاءُ صَمَّاءُ لَا تَسْمَعُ مَا قَالَ قَالَ إِنْ كَانَ لَهَا بَيِّنَةٌ فَشَهِدُوا عِنْدَ الْإِمَامِ جُلِدَ الْحَدَّ وَ فُرِّقَ بَيْنَهُمَا ثُمَّ لَا تَحِلُّ لَهُ أَبَداً وَ إِنْ لَمْ تَكُنْ بَيِّنَةٌ فَهِيَ حَرَامٌ عَلَيْهِ مَا أَقَامَ مَعَهَا وَ لَا إِثْمَ عَلَيْهَا مِنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad, from Ahmad Bin Muhammad, from Ibn Mahboub, from Hisham Bin Salim, from Abu Baseer who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who slanders his wife with the adultery, and she is mute, deaf, not hearing what he says’ He<sup>asws</sup> said: ‘If there was a proof (witnesses) for her, so they can testify in the presence of the Imam<sup>asws</sup>, he would be whipped the legal penalty (<span class=\"iTxt\">Hadd</span>), and there would be separation between the two of them, then she would not be Permissible for him, forever; and if there does not happen to be proof, so she is Prohibited unto him for whatever he stays with her, and there is no sin upon her from him’."
          ],
          "en.sarwar": [
            "18. Muhammad has narrated from Ahmad ibn Muhammad from ibn Mahbub from Hisham ibn Salim from abu Basir who has said the following: “Once abu ‘Abd Allah, Alayhi al-Salam, was asked about the case of a man who accuses his wife of committing fornication and she is speechless, deaf and cannot hear. He (the Imam) said, ‘If she has witnesses who testify before the Imam in her favor, he is whipped as punishment and they are separated from each other. Thereafter she will not be lawful for him in marriage forever. If she does not have witnesses she becomes unlawful for him as long as he stays with her and there is no sin on her because of it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/277)"
        ],
        "index": 10982,
        "local_index": 19,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/226",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/711",
              "text": "الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "بَعْضِ أَصْحَابِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4869",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي امْرَأَةٍ قَذَفَتْ زَوْجَهَا"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4870",
              "text": "هُوَ أَصَمُّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَنْهُ عَنِ الْحَسَنِ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي امْرَأَةٍ قَذَفَتْ زَوْجَهَا وَ هُوَ أَصَمُّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:74:19",
        "text": [
          " يُفَرَّقُ بَيْنَهَا وَ بَيْنَهُ وَ لَا تَحِلُّ لَهُ أَبَداً ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Al Hassan, from one of his companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a woman whose husband slandered her, and he was deaf. He<sup>asws</sup> said: ‘There would be separation between her and him, and she would not be Permissible for him, ever’."
          ],
          "en.sarwar": [
            "19. It is narrated from the narrator of the previous Hadith from al-Hassan from certain persons of his people who has said the following: “About the case of a woman who accuses her husband who is speechless, abu ‘Abd Allah, Alayhi al- Salam, has said, ‘They are separated from each other and he is not lawful for her forever.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/277)"
        ],
        "index": 10983,
        "local_index": 20,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/386",
              "text": "ابْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/827",
              "text": "أَبِي جَمِيلَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/577",
              "text": "مُحَمَّدِ بْنِ مَرْوَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4871",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الْمَرْأَةِ الْخَرْسَاءِ كَيْفَ يُلَاعِنُهَا زَوْجُهَا"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي نَصْرٍ عَنْ أَبِي جَمِيلَةَ عَنْ مُحَمَّدِ بْنِ مَرْوَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الْمَرْأَةِ الْخَرْسَاءِ كَيْفَ يُلَاعِنُهَا زَوْجُهَا قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:74:20",
        "text": [
          " يُفَرَّقُ بَيْنَهُمَا وَ لَا تَحِلُّ لَهُ أَبَداً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Nasr, from Abu Jameela, from Muhammad Bin Marwan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the mute woman, how would her husband curse her. He<sup>asws</sup> said: ‘There would be separation between the two and she would not be Permissible for him, ever’."
          ],
          "en.sarwar": [
            "20. Ali ibn Ibrahim has narrated from his father from ibn abu Nasr from abu Jamifah from Muhammad ibn Marwan who has said the following: “About the case of a woman who is speechless and about how can he go through the process of al- Li‘an (condemnation) against her, abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘They must be separated from each other and she is not lawful for him in marriage forever.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/277)"
        ],
        "index": 10984,
        "local_index": 21,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/61",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/64",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/132",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/220",
              "text": "أَبَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/135",
              "text": "رَجُلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ أَبَانٍ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:2:74:21",
        "text": [
          " لَا يَكُونُ اللِّعَانُ حَتَّى يَزْعُمَ أَنَّهُ قَدْ عَايَنَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Al Hassan Bin Ali Al Washa, from Aban, from a man, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The cursing does not happen until her claims that he has seen it’."
          ],
          "en.sarwar": [
            "21. Al-Husayn from Muhammad has narrated from Mu‘alla’ ibn Muhammad from al-Hassan ibn Ali al-Washsha’ from Aban from a man who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Al-Li‘an (condemnation) does not take place unless one believes that he has seen it.’”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:2:74",
  "kind": "verse_list"
}