{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:6:2", "titles": {"ar": "كتاب الطلاق ", "en": "<a id=\"_Toc452729655\"></a>THE BOOK OF DIVORCE "}}, {"indexed_titles": {"en": "Chapter 8"}, "path": "/books/al-kafi:6:2:8", "titles": {"ar": "باب تَفْسِيرِ طَلَاقِ السُّنَّةِ وَ الْعِدَّةِ وَ مَا يُوجِبُ الطَّلَاقَ", "en": "Chapter 8 – Interpretation of the divorce of the Sunnah, and the waiting period, and what Obligates the divorce"}}], "index": 1602, "local_index": 8, "part_type": "Chapter", "path": "/books/al-kafi:6:2:8", "titles": {"ar": "باب تَفْسِيرِ طَلَاقِ السُّنَّةِ وَ الْعِدَّةِ وَ مَا يُوجِبُ الطَّلَاقَ", "en": "Chapter 8 – Interpretation of the divorce of the Sunnah, and the waiting period, and what Obligates the divorce"}, "verse_count": 9, "verse_start_index": 10562, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 10563, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:2:8:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َبُو عَلِيٍّ الْأَشْعَرِيُّ</span> عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ وَ مُحَمَّدُ بْنُ جَعْفَرٍ أَبُو الْعَبَّاسِ الرَّزَّازُ عَنْ أَيُّوبَ بْنِ نُوحٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ ابْنِ مُسْكَانَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ طَلَاقُ السُّنَّةِ يُطَلِّقُهَا تَطْلِيقَةً يَعْنِي عَلَى طُهْرٍ مِنْ غَيْرِ جِمَاعٍ بِشَهَادَةِ شَاهِدَيْنِ ثُمَّ يَدَعُهَا حَتَّى تَمْضِيَ أَقْرَاؤُهَا فَإِذَا مَضَتْ أَقْرَاؤُهَا فَقَدْ بَانَتْ مِنْهُ وَ هُوَ خَاطِبٌ مِنَ الْخُطَّابِ إِنْ شَاءَتْ نَكَحَتْهُ وَ إِنْ شَاءَتْ فَلَا وَ إِنْ أَرَادَ أَنْ يُرَاجِعَهَا أَشْهَدَ عَلَى رَجْعَتِهَا قَبْلَ أَنْ تَمْضِيَ أَقْرَاؤُهَا فَتَكُونُ عِنْدَهُ عَلَى التَّطْلِيقَةِ الْمَاضِيَةِ", "قَالَ وَ قَالَ أَبُو بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ الطَّلاقُ مَرَّتانِ فَإِمْساكٌ بِمَعْرُوفٍ أَوْ تَسْرِيحٌ بِإِحْسانٍ التَّطْلِيقَةُ الثَّانِيَةُ التَّسْرِيحُ بِإِحْسَانٍ ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar and Muhammad Bin Ja’far Abu Al Abbas Al Razaz, from Ayoub Bin Nuh, and Ali Bin Ibrahim, from his father, both together, from Safwan Bin Yahya, from Ibn Muskan, from Muhammad Bin Muslim, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Divorce of the Sunnah is (where) he divorces her with a (valid) divorce, meaning upon the purity from without copulation, with a testimony of two witnesses. Then he leaves her until she completes her menstruation. So when her menstruation is gone, so she is irrevocably divorced from him, and he would be an proposer from the proposers if he so desires to marry her (again); and if he intends to return to her, he should keep a witness upon returning to her before her menstruation passes, so he would be upon the past divorce’. ", "He (the narrator) said, ‘And Abu Baseer, from Abu Abdullah<sup>asws</sup> (having said): ‘These are the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[2:229] Divorce (is only Permissible) twice, then keep (them) in good fellowship or let (them) go with kindness</span>. (In) the second divorce is the letting go with kindness’."]}}, {"index": 10564, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:2:8:2", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّهُ قَالَ كُلُّ طَلَاقٍ لَا يَكُونُ عَلَى السُّنَّةِ أَوْ طَلَاقٍ عَلَى الْعِدَّةِ فَلَيْسَ بِشَيْ‏ءٍ ", "قَالَ زُرَارَةُ فَقُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) فَسِّرْ لِي طَلَاقَ السُّنَّةِ وَ طَلَاقَ الْعِدَّةِ فَقَالَ أَمَّا طَلَاقُ السُّنَّةِ فَإِذَا أَرَادَ الرَّجُلُ أَنْ يُطَلِّقَ امْرَأَتَهُ فَلْيَنْتَظِرْ بِهَا حَتَّى تَطْمَثَ وَ تَطْهُرَ فَإِذَا خَرَجَتْ مِنْ طَمْثِهَا طَلَّقَهَا تَطْلِيقَةً مِنْ غَيْرِ جِمَاعٍ وَ يُشْهِدُ شَاهِدَيْنِ عَلَى ذَلِكَ ثُمَّ يَدَعُهَا حَتَّى تَطْمَثَ طَمْثَتَيْنِ فَتَنْقَضِيَ عِدَّتُهَا بِثَلَاثِ حِيَضٍ وَ قَدْ بَانَتْ مِنْهُ وَ يَكُونُ خَاطِباً مِنَ الْخُطَّابِ إِنْ شَاءَتْ تَزَوَّجَتْهُ وَ إِنْ شَاءَتْ لَمْ تَتَزَوَّجْهُ وَ عَلَيْهِ نَفَقَتُهَا وَ السُّكْنَى مَا دَامَتْ فِي عِدَّتِهَا وَ هُمَا يَتَوَارَثَانِ حَتَّى تَنْقَضِيَ الْعِدَّةُ", "قَالَ وَ أَمَّا طَلَاقُ الْعِدَّةِ الَّذِي قَالَ اللَّهُ عَزَّ وَ جَلَّ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَ أَحْصُوا الْعِدَّةَ فَإِذَا أَرَادَ الرَّجُلُ مِنْكُمْ أَنْ يُطَلِّقَ امْرَأَتَهُ طَلَاقَ الْعِدَّةِ فَلْيَنْتَظِرْ بِهَا حَتَّى تَحِيضَ وَ تَخْرُجَ مِنْ حَيْضِهَا ثُمَّ يُطَلِّقُهَا تَطْلِيقَةً مِنْ غَيْرِ جِمَاعٍ وَ يُشْهِدُ شَاهِدَيْنِ عَدْلَيْنِ وَ يُرَاجِعُهَا مِنْ يَوْمِهِ ذَلِكَ إِنْ أَحَبَّ أَوْ بَعْدَ ذَلِكَ بِأَيَّامٍ أَوْ قَبْلَ أَنْ تَحِيضَ وَ يُشْهِدُ عَلَى رَجْعَتِهَا وَ يُوَاقِعُهَا وَ يَكُونُ مَعَهَا حَتَّى تَحِيضَ فَإِذَا حَاضَتْ وَ خَرَجَتْ مِنْ حَيْضِهَا طَلَّقَهَا تَطْلِيقَةً أُخْرَى مِنْ غَيْرِ جِمَاعٍ وَ يُشْهِدُ عَلَى ذَلِكَ ثُمَّ يُرَاجِعُهَا أَيْضاً مَتَى شَاءَ قَبْلَ أَنْ تَحِيضَ وَ يُشْهِدُ عَلَى رَجْعَتِهَا وَ يُوَاقِعُهَا وَ تَكُونُ مَعَهُ إِلَى أَنْ تَحِيضَ الْحَيْضَةَ الثَّالِثَةَ فَإِذَا خَرَجَتْ مِنْ حَيْضَتِهَا الثَّالِثَةِ طَلَّقَهَا التَّطْلِيقَةَ الثَّالِثَةَ بِغَيْرِ جِمَاعٍ وَ يُشْهِدُ عَلَى ذَلِكَ", "فَإِذَا فَعَلَ ذَلِكَ فَقَدْ بَانَتْ مِنْهُ وَ لَا تَحِلُّ لَهُ حَتَّى تَنْكِحَ زَوْجاً غَيْرَهُ قِيلَ لَهُ فَإِنْ كَانَتْ مِمَّنْ لَا تَحِيضُ فَقَالَ مِثْلُ هَذِهِ تُطَلَّقُ طَلَاقَ السُّنَّةِ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, and Muhammad Bin Yahya, from Ahmad Bin Muhammad, and Ali Bin Ibrahim, from his father, altogether from Al Hassan Bin Mahboub, from Ali Bin Raib, from Zurara, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Every divorce which does not take place upon the Sunnah, or a divorce upon the waiting period, so it is nothing’. ", "Zurara narrates, I said to Abu Ja’far<sup>asws</sup>, ‘Explain for me a divorce of the Sunnah, and a divorce of the waiting period’. So he<sup>asws</sup> said: ‘As for a divorce of the Sunnah, so when the man intends to divorce his wife, so let him wait with her until she menstruates and is pure. So when she comes out from her menstruation, he divorces her with a divorce from without copulation, and he have it witnessed by two witnesses upon that. Then he leaves until she menstruates with two menstruations. Thus, she fulfills her waiting period by three menstruations, and she would be irrevocably divorced from him, and he would happen to be a proposer from the proposers, if he so desires to marry her. And if he desires not to marry her, and upon him is her expenses and her dwelling for as long as she is in her waiting period; and they would both be inheriting (each other) until she fulfills the waiting period’. ", "He<sup>asws</sup> said: ‘And as for a divorce of the waiting period which Allah<sup>azwj</sup> Mighty and Majestic Speaks of <span class=\"ibTxt\">[65:1] When you divorce women, divorce them for their prescribed time, and calculate the number of the days prescribed</span>. So when the man from you intends to divorce his wife by a divorce of the waiting period, so let him wait with her until she menstruates, and comes out from her menstruation. Then he divorces her with a divorce without copulation, and have it witnessed by two just witnesses, and he can return to her from that day of his if he so likes, or after that by (some) days, or before she menstruates, and he should have it witnessed upon his returning to her, and copulate with her, and be with her until she menstruates. So when she menstruates and comes out from her menstruation, divorces her with another divorce from without copulation, and have it witnessed upon that. Then he returns to her again whenever he so desires to before she menstruates, and have it witnessed upon his returning to her; and he copulates with her and happens to be with her up to her menstruating with the third menstruation. So when she comes out from her third menstruation, divorces her with the third divorce without copulation, and have it witnessed upon that. ", "So when he does that, so she is irrevocably divorced from him, and she is not Permissible unto him until she marries another husband’. It was said to him<sup>asws</sup>, ‘Supposing she is from the ones who does not menstruate?’ So he<sup>asws</sup> said: ‘For the likes of these is a divorce of the Sunnah’."]}}, {"index": 10565, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:6:2:8:3", "text": ["ابْنُ مَحْبُوبٍ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ أُحِبُّ لِلرَّجُلِ الْفَقِيهِ إِذَا أَرَادَ أَنْ يُطَلِّقَ امْرَأَتَهُ أَنْ يُطَلِّقَهَا طَلَاقَ السُّنَّةِ ", "قَالَ ثُمَّ قَالَ وَ هُوَ الَّذِي قَالَ اللَّهُ عَزَّ وَ جَلَّ لَعَلَّ اللَّهَ يُحْدِثُ بَعْدَ ذلِكَ أَمْراً يَعْنِي بَعْدَ الطَّلَاقِ وَ انْقِضَاءِ الْعِدَّةِ التَّزْوِيجَ لَهُمَا مِنْ قَبْلِ أَنْ تَزَوَّجَ زَوْجاً غَيْرَهُ ", "قَالَ وَ مَا أَعْدَلَهُ وَ أَوْسَعَهُ لَهُمَا جَمِيعاً أَنْ يُطَلِّقَهَا عَلَى طُهْرٍ مِنْ غَيْرِ جِمَاعٍ تَطْلِيقَةً بِشُهُودٍ ثُمَّ يَدَعَهَا حَتَّى يَخْلُوَ أَجَلُهَا ثَلَاثَةَ أَشْهُرٍ أَوْ ثَلَاثَةَ قُرُوءٍ ثُمَّ يَكُونَ خَاطِباً مِنَ الْخُطَّابِ ."], "translations": {"en.hubeali": ["Ibn Mahboub, from Ibn Bukeyr, from Zurara who said, ", "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘I<sup>asws</sup> would love it for the understanding man when he intends to divorce his wife that he should divorce her with a divorce of the Sunnah’. ", "He (the narrator) said, ‘Then he<sup>asws</sup> said: ‘And it is that which Allah<sup>azwj</sup> Mighty and Majestic Says <span class=\"ibTxt\">[65:1] Perhaps Allah may, after that, bring about a matter</span> – Meaning, after the divorce and the fulfilling of the waiting period, the marriage of them both from before she marries another husband’. ", "He<sup>asws</sup> said: ‘How much justice there is, and leeway for both of them together, that he divorces her upon purity from without copulation with a divorce by witnesses, then leaves her until her term is free with three months, or three menstruations, then he happens to be a proposer from the proposers’."]}}, {"index": 10566, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:6:2:8:4", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي نَجْرَانَ أَوْ غَيْرِهِ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ طَلَاقِ السُّنَّةِ قَالَ طَلَاقُ السُّنَّةِ إِذَا أَرَادَ الرَّجُلُ أَنْ يُطَلِّقَ امْرَأَتَهُ يَدَعُهَا إِنْ كَانَ قَدْ دَخَلَ بِهَا حَتَّى تَحِيضَ ثُمَّ تَطْهُرَ فَإِذَا طَهُرَتْ طَلَّقَهَا وَاحِدَةً بِشَهَادَةِ شَاهِدَيْنِ ثُمَّ يَتْرُكُهَا حَتَّى تَعْتَدَّ ثَلَاثَةَ قُرُوءٍ فَإِذَا مَضَتْ ثَلَاثَةُ قُرُوءٍ فَقَدْ بَانَتْ مِنْهُ بِوَاحِدَةٍ وَ كَانَ زَوْجُهَا خَاطِباً مِنَ الْخُطَّابِ إِنْ شَاءَتْ تَزَوَّجَتْهُ وَ إِنْ شَاءَتْ لَمْ تَفْعَلْ فَإِنْ تَزَوَّجَهَا بِمَهْرٍ جَدِيدٍ كَانَتْ عِنْدَهُ عَلَى اثْنَتَيْنِ بَاقِيَتَيْنِ وَ قَدْ مَضَتِ الْوَاحِدَةُ ", "فَإِنْ هُوَ طَلَّقَهَا وَاحِدَةً أُخْرَى عَلَى طُهْرٍ مِنْ غَيْرِ جِمَاعٍ بِشَهَادَةِ شَاهِدَيْنِ ثُمَّ تَرَكَهَا حَتَّى تَمْضِيَ أَقْرَاؤُهَا فَإِذَا مَضَتْ أَقْرَاؤُهَا مِنْ قَبْلِ أَنْ يُرَاجِعَهَا فَقَدْ بَانَتْ مِنْهُ بِاثْنَتَيْنِ وَ مَلَكَتْ أَمْرَهَا وَ حَلَّتْ لِلْأَزْوَاجِ وَ كَانَ زَوْجُهَا خَاطِباً مِنَ الْخُطَّابِ إِنْ شَاءَتْ تَزَوَّجَتْهُ وَ إِنْ شَاءَتْ لَمْ تَفْعَلْ فَإِنْ هُوَ تَزَوَّجَهَا تَزْوِيجاً جَدِيداً بِمَهْرٍ جَدِيدٍ كَانَتْ مَعَهُ بِوَاحِدَةٍ بَاقِيَةٍ وَ قَدْ مَضَتِ اثْنَتَانِ ", "فَإِنْ أَرَادَ أَنْ يُطَلِّقَهَا طَلَاقاً لَا تَحِلُّ لَهُ حَتَّى تَنْكِحَ زَوْجاً غَيْرَهُ تَرَكَهَا حَتَّى إِذَا حَاضَتْ وَ طَهُرَتْ أَشْهَدَ عَلَى طَلَاقِهَا تَطْلِيقَةً وَاحِدَةً ثُمَّ لَا تَحِلُّ لَهُ حَتَّى تَنْكِحَ زَوْجاً غَيْرَهُ ", "وَ أَمَّا طَلَاقُ الرَّجْعَةِ فَأَنْ يَدَعَهَا حَتَّى تَحِيضَ وَ تَطْهُرَ ثُمَّ يُطَلِّقَهَا بِشَهَادَةِ شَاهِدَيْنِ ثُمَّ يُرَاجِعَهَا وَ يُوَاقِعَهَا ثُمَّ يَنْتَظِرَ بِهَا الطُّهْرَ فَإِذَا حَاضَتْ وَ طَهُرَتْ أَشْهَدَ شَاهِدَيْنِ عَلَى تَطْلِيقَةٍ أُخْرَى ثُمَّ يُرَاجِعُهَا وَ يُوَاقِعُهَا ثُمَّ يَنْتَظِرُ بِهَا الطُّهْرَ فَإِذَا حَاضَتْ وَ طَهُرَتْ أَشْهَدَ شَاهِدَيْنِ عَلَى التَّطْلِيقَةِ الثَّالِثَةِ ثُمَّ لَا تَحِلُّ لَهُ أَبَداً حَتَّى تَنْكِحَ زَوْجاً غَيْرَهُ وَ عَلَيْهَا أَنْ تَعْتَدَّ ثَلَاثَةَ قُرُوءٍ مِنْ يَوْمَ طَلَّقَهَا التَّطْلِيقَةَ الثَّالِثَةَ", "فَإِنْ طَلَّقَهَا وَاحِدَةً عَلَى طُهْرٍ بِشُهُودٍ ثُمَّ انْتَظَرَ بِهَا حَتَّى تَحِيضَ وَ تَطْهُرَ ثُمَّ طَلَّقَهَا قَبْلَ أَنْ يُرَاجِعَهَا لَمْ يَكُنْ طَلَاقُهُ الثَّانِيَةُ طَلَاقاً لِأَنَّهُ طَلَّقَ طَالِقاً لِأَنَّهُ إِذَا كَانَتِ الْمَرْأَةُ مُطَلَّقَةً مِنْ زَوْجِهَا كَانَتْ خَارِجَةً مِنْ مِلْكِهِ حَتَّى يُرَاجِعَهَا فَإِذَا رَاجَعَهَا صَارَتْ فِي مِلْكِهِ مَا لَمْ يُطَلِّقِ التَّطْلِيقَةَ الثَّالِثَةَ فَإِذَا طَلَّقَهَا التَّطْلِيقَةَ الثَّالِثَةَ فَقَدْ خَرَجَ مِلْكُ الرَّجْعَةِ مِنْ يَدِهِ فَإِنْ طَلَّقَهَا عَلَى طُهْرٍ بِشُهُودٍ ثُمَّ رَاجَعَهَا وَ انْتَظَرَ بِهَا الطُّهْرَ مِنْ غَيْرِ مُوَاقَعَةٍ فَحَاضَتْ وَ طَهُرَتْ ثُمَّ طَلَّقَهَا قَبْلَ أَنْ يُدَنِّسَهَا بِمُوَاقَعَةٍ بَعْدَ الرَّجْعَةِ لَمْ يَكُنْ طَلَاقُهُ لَهَا طَلَاقاً لِأَنَّهُ طَلَّقَهَا التَّطْلِيقَةَ الثَّانِيَةَ فِي طُهْرِ الْأُولَى وَ لَا يُنْقَضُ الطُّهْرُ إِلَّا بِمُوَاقَعَةٍ بَعْدَ الرَّجْعَةِ", "وَ كَذَلِكَ لَا تَكُونُ التَّطْلِيقَةُ الثَّالِثَةُ إِلَّا بِمُرَاجَعَةٍ وَ مُوَاقَعَةٍ بَعْدَ الْمُرَاجَعَةِ ثُمَّ حَيْضٍ وَ طُهْرٍ بَعْدَ الْحَيْضِ ثُمَّ طَلَاقٍ بِشُهُودٍ حَتَّى يَكُونَ لِكُلِّ تَطْلِيقَةٍ طُهْرٌ مِنْ تَدْنِيسِ الْمُوَاقَعَةِ بِشُهُودٍ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Najran, or someone else, from Ibn Muskan, from Abu Baseer, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about divorce of the Sunnah. He<sup>asws</sup> said: ‘Divorce of the Sunnah is when the man intends to divorce his wife, he leaves her if he had copulated with her, until she menstruates, then is pure. So when she is pure, he divorces her once with the witnesses of two witnesses. Then he leaves her until she waits for three menstruation. So when she fulfills three menstruations, so she is irrevocably divorced from him, once, and her husband is (now) a proposer from the proposers, if she so desires to, she marries him, and if she so desires to, does not do it. So if he marries her with a new dowry, so she would be in his presence upon the two remaining (divorces), and the one would have passed’. ", "So if he were to divorce her with another one upon purity from without copulation, with a testimony of two witnesses, then leaves her until she fulfills her menstruation. So when she fulfils her menstruation from before he returns to her, so she is irrevocably divorced from him with the two (divorces) and is in control of her affairs, and she is free to re-marry, and her (ex) husband would be a proposer from the proposers if she so desires to, she marries him, and if she so desires to, does not do it. So if he were to marry her with a new marriages, with a new dowry, she would be with him with one (divorce) remaining, and two would have passed.", "So if he intends to divorce her with a divorce, there is no Permissibility for him until she marries another husband, who leave her until when she menstruates, and is pure, have it witnessed upon her divorce with one divorce, then she is not Permissible for him until she marries another husband.", "And as for a divorce of the reversion, so he leaves her until she menstruates and is pure, then he divorces her with a testimony of two witnesses. Then he returns to her, and copulates with her. Then he waits with her for the purity. So when she has menstruated and is pure, witnesses it with two witnesses upon his another divorce. Then he returns to her and copulates with her, then waits with her for the purity. So when she has menstruated and is pure, has it witnessed by two witnesses upon the third divorce. Then she would not be Permissible for him, ever, until she marries another husband, and it is upon her that she waits for three menstruations from the day she is divorced with her third divorce. ", "Then her divorce is once, upon purity, with witnesses. Then she would be awaited with until she menstruates and is pure. Then he divorces her before he returns to her, the second divorce would not take place because he would be divorcing a divorced woman, because when the woman was divorced from her husband, she would have come out from his ownership until he returns to her. So when he returns to her, she comes to be in his ownership for as long as he does not divorce her with the third divorce. ", "So when he divorces her with the third divorce, so she would have come out from the bounds of the return from his hands. So if he divorces her upon purity with witnesses, then returns to her, and waits with her for the purity from without copulation, so she menstruates and is pure, then he divorces her before he violates by copulating with her after the return, his divorcing her would not happen to be a divorce because he would have divorced her with the second divorce in the first purity, and the purity is not passed except by copulation after the reversion. ", "And similar to that, the third divorce does not happen except by the reversion and copulation after the reversion, then she menstruates and is pure after the menstruation, then there is a divorce with witnesses, until there happens for each divorce, a purity from the violation of the copulation, by witnesses’."]}}, {"index": 10567, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:6:2:8:5", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ عَبْدِ الْكَرِيمِ جَمِيعاً عَنِ الْحَسَنِ بْنِ زِيَادٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ طَلَاقِ السُّنَّةِ كَيْفَ يُطَلِّقُ الرَّجُلُ امْرَأَتَهُ فَقَالَ يُطَلِّقُهَا فِي طُهْرٍ قَبْلَ عِدَّتِهَا مِنْ غَيْرِ جِمَاعٍ بِشُهُودٍ فَإِنْ طَلَّقَهَا وَاحِدَةً ثُمَّ تَرَكَهَا حَتَّى يَخْلُوَ أَجَلُهَا فَقَدْ بَانَتْ مِنْهُ وَ هُوَ خَاطِبٌ مِنَ الْخُطَّابِ وَ إِنْ رَاجَعَهَا فَهِيَ عِنْدَهُ عَلَى تَطْلِيقَةٍ مَاضِيَةٍ وَ بَقِيَ تَطْلِيقَتَانِ ", "فَإِنْ طَلَّقَهَا الثَّانِيَةَ وَ تَرَكَهَا حَتَّى يَخْلُوَ أَجَلُهَا فَقَدْ بَانَتْ مِنْهُ وَ إِنْ هُوَ أَشْهَدَ عَلَى رَجْعَتِهَا قَبْلَ أَنْ يَخْلُوَ أَجَلُهَا فَهِيَ عِنْدَهُ عَلَى تَطْلِيقَتَيْنِ مَاضِيَتَيْنِ وَ بَقِيَتْ وَاحِدَةٌ فَإِنْ طَلَّقَهَا الثَّالِثَةَ فَقَدْ بَانَتْ مِنْهُ وَ لَا تَحِلُّ لَهُ حَتَّى تَنْكِحَ زَوْجاً غَيْرَهُ وَ هِيَ تَرِثُ وَ تُورَثُ مَا كَانَ لَهُ عَلَيْهَا رَجْعَةٌ مِنَ التَّطْلِيقَتَيْنِ الْأَوَّلَتَيْنِ ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Bni Abdul Jabbar, from Safwan Bin Yahya, and a number of our companions, from Sahl Bin Ziyad, and Muhammad Bin Yahya, from Ahmad Biin Muhammad, and Ali Bin Ibrahim, from his father, both together, from Ahmad Bin Muhammad Bin Abu Nasr, from Abdul Kareem, both together from Al Hassan Bin Ziyad, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about divorce, how should the man divorce his wife. So he<sup>asws</sup> said: ‘He should divorce her during purity, before her waiting period from without copulation, with witnesses. So if he divorces her once, then leaves her until she is free from her term, so she is irrevocably divorced from him, and he would be a proposer from the proposers. And if he reverts to her, so she would be with him upon a previous divorce, and there would remain two divorces. ", "So if he were to divorce her for the second (divorce), and leaves her until she is free from her term, so she would be irrevocably divorced from him, and if he has taken witnesses upon returning to her before she is free from her term, so she would be with him upon two previous divorces, and there would remain one (divorce). So if he were to divorce her for the third (divorce) so she would be irrevocably divorced from him, and she would not be Permissible for him until she marries another husband, and she would inherit him and he would inherit her for as long as there is (the right of) reversion for him to her, from the two former divorces’."]}}, {"index": 10568, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:6:2:8:6", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنْ رَجُلٍ طَلَّقَ امْرَأَتَهُ بَعْدَ مَا غَشِيَهَا بِشَهَادَةِ عَدْلَيْنِ فَقَالَ لَيْسَ هَذَا بِطَلَاقٍ فَقُلْتُ جُعِلْتُ فِدَاكَ كَيْفَ طَلَاقُ السُّنَّةِ فَقَالَ يُطَلِّقُهَا إِذَا طَهُرَتْ مِنْ حَيْضِهَا قَبْلَ أَنْ يَغْشَاهَا بِشَاهِدَيْنِ عَدْلَيْنِ كَمَا قَالَ اللَّهُ عَزَّ وَ جَلَّ فِي كِتَابِهِ فَإِنْ خَالَفَ ذَلِكَ رُدَّ إِلَى كِتَابِ اللَّهِ عَزَّ وَ جَلَّ ", "فَقُلْتُ لَهُ فَإِنْ طَلَّقَ عَلَى طُهْرٍ مِنْ غَيْرِ جِمَاعٍ بِشَاهِدٍ وَ امْرَأَتَيْنِ فَقَالَ لَا تَجُوزُ شَهَادَةُ النِّسَاءِ فِي الطَّلَاقِ وَ قَدْ تَجُوزُ شَهَادَتُهُنَّ مَعَ غَيْرِهِنَّ فِي الدَّمِ إِذَا حَضَرَتْهُ فَقُلْتُ فَإِنْ أَشْهَدَ رَجُلَيْنِ نَاصِبِيَّيْنِ عَلَى الطَّلَاقِ أَ يَكُونُ طَلَاقاً فَقَالَ مَنْ وُلِدَ عَلَى الْفِطْرَةِ أُجِيزَتْ شَهَادَتُهُ عَلَى الطَّلَاقِ بَعْدَ أَنْ تَعْرِفَ مِنْهُ خَيْراً ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr who said, ", "‘I asked Abu Al-Hassan<sup>asws</sup> about a man who divorced his wife after having copulated with her, with two just witnesses. So he<sup>asws</sup> said: ‘This is not with a (valid) divorce’. So I said, ‘May I be sacrificed for you<sup>asws</sup>! How is the divorce of the Sunnah?’ So he<sup>asws</sup> said: ‘He divorces her when she is pure from her menstruation, before he copulates with her, with two just witnesses, just as Allah<sup>azwj</sup> Mighty and Majestic has Said in His<sup>azwj</sup> Book. So if he were to oppose that, he has to be returned to the Book of Allah<sup>azwj</sup> Mighty and Majestic’. ", "So I said to him<sup>asws</sup>, ‘Suppose if he divorces her upon purity from without copulation, with one (male) witness and two women?’ So he<sup>asws</sup> said: ‘It is not allowed, the testimony of the women in the (matter of) divorce, and their testimony has been allowed along with another, in the (matter of) the blood, when she is present’. So I said, ‘Supposing two men, Hostile ones (<span class=\"iTxt\">Nasibis</span>) were to witness upon the divorce, would that divorce take place?’ So he<sup>asws</sup> said: ‘The one who is born upon the nature, his testimony is allowed upon the divorce after you recognise the goodness from him’."]}}, {"index": 10569, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:6:2:8:7", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنِ ابْنِ بُكَيْرٍ وَ غَيْرِهِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّهُ قَالَ إِنَّ الطَّلَاقَ الَّذِي أَمَرَ اللَّهُ عَزَّ وَ جَلَّ بِهِ فِي كِتَابِهِ وَ الَّذِي سَنَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَنْ يُخَلِّيَ الرَّجُلُ عَنِ الْمَرْأَةِ فَإِذَا حَاضَتْ وَ طَهُرَتْ مِنْ مَحِيضِهَا أَشْهَدَ رَجُلَيْنِ عَدْلَيْنِ عَلَى تَطْلِيقَةٍ وَ هِيَ طَاهِرٌ مِنْ غَيْرِ جِمَاعٍ وَ هُوَ أَحَقُّ بِرَجْعَتِهَا مَا لَمْ تَنْقَضِ ثَلَاثَةُ قُرُوءٍ وَ كُلُّ طَلَاقٍ مَا خَلَا هَذَا فَبَاطِلٌ لَيْسَ بِطَلَاقٍ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibn Azina, from Ibn Bukeyr, and someone else, ", "(It has been narrated) from Abu Abu Ja’far<sup>asws</sup> having said: ‘The divorce which Allah<sup>azwj</sup> Mighty and Majestic Commanded with in His<sup>azwj</sup> Book, and which is a Sunnah of Rasool-Allah<sup>saww</sup> is that the man isolates from the wife. So when she menstruates and is pure from her menstruation, two just men bear witness upon a divorce, and she is pure from without copulation, and he is more rightful with reverting back to her, for as long as she has not fulfilled three menstruations; and every divorce apart from this, so it is invalid, it is not a divorce’."]}}, {"index": 10570, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:6:2:8:8", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ طَلَاقُ السُّنَّةِ إِذَا طَهُرَتِ الْمَرْأَةُ فَلْيُطَلِّقْهَا وَاحِدَةً مَكَانَهَا مِنْ غَيْرِ جِمَاعٍ يُشْهِدُ عَلَى طَلَاقِهَا فَإِذَا أَرَادَ أَنْ يُرَاجِعَهَا أَشْهَدَ عَلَى الْمُرَاجَعَةِ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Jameel Bin Darraj, from Zurara, ", "Abu Ja’far<sup>asws</sup> has said: ‘A divorce of the Sunnah is when the woman is pure, so he divorces her in one place, from without copulation, keeping witnesses upon her divorce. So when he intends to revert to her, he should keep witnesses upon the return’."]}}, {"index": 10571, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:6:2:8:9", "text": ["حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِذَا أَرَادَ الرَّجُلُ الطَّلَاقَ طَلَّقَهَا فِي قُبُلِ عِدَّتِهَا بِغَيْرِ جِمَاعٍ فَإِنَّهُ إِذَا طَلَّقَهَا وَاحِدَةً ثُمَّ تَرَكَهَا حَتَّى يَخْلُوَ أَجَلُهَا إِنْ شَاءَ أَنْ يَخْطُبَ مَعَ الْخُطَّابِ فَعَلَ فَإِنْ رَاجَعَهَا قَبْلَ أَنْ يَخْلُوَ أَجَلُهَا أَوْ بَعْدَهُ كَانَتْ عِنْدَهُ عَلَى تَطْلِيقَةٍ ", "فَإِنْ طَلَّقَهَا الثَّانِيَةَ أَيْضاً فَشَاءَ أَنْ يَخْطُبَهَا مَعَ الْخُطَّابِ إِنْ كَانَ تَرَكَهَا حَتَّى يَخْلُوَ أَجَلُهَا فَإِنْ شَاءَ رَاجَعَهَا قَبْلَ أَنْ يَنْقَضِيَ أَجَلُهَا فَإِنْ فَعَلَ فَهِيَ عِنْدَهُ عَلَى تَطْلِيقَتَيْنِ فَإِنْ طَلَّقَهَا الثَّالِثَةَ فَلَا تَحِلُّ لَهُ حَتَّى تَنْكِحَ زَوْجاً غَيْرَهُ وَ هِيَ تَرِثُ وَ تُورَثُ مَا كَانَتْ فِي الدَّمِ مِنَ التَّطْلِيقَتَيْنِ الْأَوَّلَتَيْنِ ."], "translations": {"en.hubeali": ["Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from Muhammad Bin Ziyad, from Abdullah Bin Sinan, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘When the man intends the divorce, he divorces her before her waiting period, without copulation. So if he divorces her once, then leaves her until she is free from her term, if he so desires to he can propose with the proposers, he can do so. So if he reverts to her before she is free from her term, or after it, she would be with him upon a (previous) divorce. ", "So if he divorces her for the second (divorce) as well, so if he so desires he can propose to her along with the (other proposers), if he had left her until she was free from her term, so if he so desires to he can revert to her before she has fulfilled her term. So if he does so, so she would be with him upon two (previous) divorces. So if he divorces her for the third (divorce), so she would not be Permissible for him until she marries another husband, and she would inherit from him and he would inherit her for as long as she was in the blood from the two former divorces’."]}}]}, "index": "al-kafi:6:2:8", "kind": "verse_list"}