{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:2:1", "titles": {"ar": "كتاب الإيمان و الكفر", "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"}}, {"indexed_titles": {"en": "Chapter 100"}, "path": "/books/al-kafi:2:1:100", "titles": {"ar": "بَابٌ فِي قِلَّةِ عَدَدِ الْمُؤْمِنِينَ", "en": "Chapter 100 – The smallness of the number of the Momineen"}}], "index": 288, "local_index": 100, "part_type": "Chapter", "path": "/books/al-kafi:2:1:100", "titles": {"ar": "بَابٌ فِي قِلَّةِ عَدَدِ الْمُؤْمِنِينَ", "en": "Chapter 100 – The smallness of the number of the Momineen"}, "verse_count": 7, "verse_start_index": 2310, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 2311, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:1:100:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ قُتَيْبَةَ الْأَعْشَى قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ الْمُؤْمِنَةُ أَعَزُّ مِنَ الْمُؤْمِنِ وَ الْمُؤْمِنُ أَعَزُّ مِنَ الْكِبْرِيتِ الْأَحْمَرِ فَمَنْ رَأَى مِنْكُمُ الْكِبْرِيتَ الْأَحْمَرَ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Sinan, from Quteyba Al A’ash who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The <span class=\"iTxt\">Momina</span> (female Believer) is more cherished than the <span class=\"iTxt\">Momin</span>, and the <span class=\"iTxt\">Momin</span> is more cherished than the alchemy. So who from you has (ever) seen alchemy?’."]}}, {"index": 2312, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:1:100:2", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ مُثَنًّى الْحَنَّاطِ عَنْ كَامِلٍ التَّمَّارِ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ النَّاسُ كُلُّهُمْ بَهَائِمُ ثَلَاثاً إِلَّا قَلِيلًا مِنَ الْمُؤْمِنِينَ وَ الْمُؤْمِنُ غَرِيبٌ ثَلَاثَ مَرَّاتٍ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Ibn Abu Najran, from Musa Al Hannat, from Kamil Al Tammar who said, ", "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘The people, all of them are beasts’ – three times, ‘except for a few from the <span class=\"iTxt\">Momineen</span>; and the <span class=\"iTxt\">Momin</span> is rare’ – three times’."]}}, {"index": 2313, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:2:1:100:3", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ لِأَبِي بَصِيرٍ أَمَا وَ اللَّهِ لَوْ أَنِّي أَجِدُ مِنْكُمْ ثَلَاثَةَ مُؤْمِنِينَ يَكْتُمُونَ حَدِيثِي مَا اسْتَحْلَلْتُ أَنْ أَكْتُمَهُمْ حَدِيثاً ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Ibn Raib who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying to Abu Baseer: ‘But, by Allah<sup>azwj</sup>! If I<sup>asws</sup> were to find three <span class=\"iTxt\">Momineen</span> from you all who are concealing my<sup>asws</sup> Ahadeeth, I<sup>asws</sup> would not have considered it Permissible that I<sup>asws</sup> should be concealing a single Hadeeth from them’."]}}, {"index": 2314, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:2:1:100:4", "text": ["مُحَمَّدُ بْنُ الْحَسَنِ وَ عَلِيُّ بْنُ مُحَمَّدِ بْنِ بُنْدَارَ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ عَنْ عَبْدِ اللَّهِ بْنِ حَمَّادٍ الْأَنْصَارِيِّ عَنْ سَدِيرٍ الصَّيْرَفِيِّ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقُلْتُ لَهُ وَ اللَّهِ مَا يَسَعُكَ الْقُعُودُ فَقَالَ وَ لِمَ يَا سَدِيرُ قُلْتُ لِكَثْرَةِ مَوَالِيكَ وَ شِيعَتِكَ وَ أَنْصَارِكَ وَ اللَّهِ لَوْ كَانَ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) مَا لَكَ مِنَ الشِّيعَةِ وَ الْأَنْصَارِ وَ الْمَوَالِي مَا طَمِعَ فِيهِ تَيْمٌ وَ لَا عَدِيٌّ", "فَقَالَ يَا سَدِيرُ وَ كَمْ عَسَى أَنْ يَكُونُوا قُلْتُ مِائَةَ أَلْفٍ قَالَ مِائَةَ أَلْفٍ قُلْتُ نَعَمْ وَ مِائَتَيْ أَلْفٍ قَالَ مِائَتَيْ أَلْفٍ قُلْتُ نَعَمْ وَ نِصْفَ الدُّنْيَا", "قَالَ فَسَكَتَ عَنِّي ثُمَّ قَالَ يَخِفُّ عَلَيْكَ أَنْ تَبْلُغَ مَعَنَا إِلَى يَنْبُعَ قُلْتُ نَعَمْ فَأَمَرَ بِحِمَارٍ وَ بَغْلٍ أَنْ يُسْرَجَا فَبَادَرْتُ فَرَكِبْتُ الْحِمَارَ فَقَالَ يَا سَدِيرُ أَ تَرَى أَنْ تُؤْثِرَنِي بِالْحِمَارِ قُلْتُ الْبَغْلُ أَزْيَنُ وَ أَنْبَلُ قَالَ الْحِمَارُ أَرْفَقُ بِي فَنَزَلْتُ فَرَكِبَ الْحِمَارَ وَ رَكِبْتُ الْبَغْلَ ", "فَمَضَيْنَا فَحَانَتِ الصَّلَاةُ فَقَالَ يَا سَدِيرُ انْزِلْ بِنَا نُصَلِّ ثُمَّ قَالَ هَذِهِ أَرْضٌ سَبِخَةٌ لَا تَجُوزُ الصَّلَاةُ فِيهَا فَسِرْنَا حَتَّى صِرْنَا إِلَى أَرْضٍ حَمْرَاءَ وَ نَظَرَ إِلَى غُلَامٍ يَرْعَى جِدَاءً فَقَالَ وَ اللَّهِ يَا سَدِيرُ لَوْ كَانَ لِي شِيعَةٌ بِعَدَدِ هَذِهِ الْجِدَاءِ مَا وَسِعَنِي الْقُعُودُ ", "وَ نَزَلْنَا وَ صَلَّيْنَا فَلَمَّا فَرَغْنَا مِنَ الصَّلَاةِ عَطَفْتُ عَلَى الْجِدَاءِ فَعَدَدْتُهَا فَإِذَا هِيَ سَبْعَةَ عَشَرَ ."], "translations": {"en.hubeali": ["Muhammad Bin Al Hassan and Ali Bin Muhammad Bin Bundar, from Ibrahim Bin Is’haq, from Abdullah Bin Hammad Al Ansary, from Sadeyr Al Sayrafi who said, ", "‘I went over to Abu Abdullah<sup>asws</sup> and I said to him<sup>asws</sup>, ‘By Allah<sup>azwj</sup>! What affords you<sup>asws</sup> to sit back (not rise up against the ruling authorities)?’ So he<sup>asws</sup> said: ‘And why (Shouldn’t I<sup>asws</sup> do so) O Sadeyr!’  I said, ‘Due to the abundance of your<sup>asws</sup> friends and your<sup>asws</sup> Shias, and your<sup>asws</sup> helpers. By Allah<sup>azwj</sup>! Had there been for Amir Al-Momineen<sup>asws</sup> what is for you<sup>asws</sup> from the Shias and the helpers and the friends, neither the (Clan of) Taym (Abu Bakr’s clan), nor (the Clan of Uday (Umar’s clan) would have been greedy with regards to it (the Caliphate)’. ", "So he<sup>asws</sup> said: ‘O Sadeyr! And how many could they (Shias) be?’ I said, ‘One hundred thousand’. He<sup>asws</sup> said: ‘One hundred thousand?’ I said, ‘Yes, and two hundred thousand’. He<sup>asws</sup> said: ‘Two hundred thousand?’ I said, ‘Yes, and half the world’. ", "He (Sadeyr) said, ‘So he<sup>asws</sup> was silent from me, then said: ‘Would it be light upon you if you were to come along with us<sup>asws</sup> to Yanbu?’ I said, ‘Yes’. So he<sup>asws</sup> ordered with a donkey and a mule to be saddled and harnessed. So I initiated and rode the donkey and he<sup>asws</sup> said: ‘O Sadeyr! What is your view if you were to prefer me<sup>asws</sup> to be with the donkey?’ I said, ‘The mule is good (for me)’. He<sup>asws</sup> said: ‘The donkey is kinder with me<sup>asws</sup>’. So I descended and he<sup>asws</sup> rode the donkey and I rode the mule.", "So we went on and the <span class=\"iTxt\">Salāt</span> (time) arrived, so he<sup style=\"font-weight: normal\">asws</sup> said: ‘O Sadeyr! Descend with us<sup style=\"font-weight: normal\">asws</sup> to pray <span class=\"iTxt\">Salāt</span>’. Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘This is a marshy land, the <span class=\"iTxt\">Salāt</span> is not allowed in it’. So we travelled until we arrived at red ground, and he<sup style=\"font-weight: normal\">asws</sup> looked at a boy pasturing goats, so he<sup style=\"font-weight: normal\">asws</sup> said: ‘By Allah<sup style=\"font-weight: normal\">azwj</sup>, O Sadeyr! Had there been for me<sup style=\"font-weight: normal\">asws</sup> Shias of the number of these goats, there would not have been leeway for the sitting back (not rising against the ruling authorities) for me<sup style=\"font-weight: normal\">asws</sup>’. ", "And we descended and we prayed <span class=\"iTxt\">Salāt</span>. So when we were free from the <span class=\"iTxt\">Salāt</span>, I turned towards the goats, and I counted them, and there were seventeen’."]}}, {"index": 2315, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:2:1:100:5", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَمَّارِ بْنِ مَرْوَانَ عَنْ سَمَاعَةَ بْنِ مِهْرَانَ قَالَ قَالَ لِي عَبْدٌ صَالِحٌ ( صلوات الله عليه )  يَا سَمَاعَةُ أَمِنُوا عَلَى فُرُشِهِمْ وَ أَخَافُونِي أَمَا وَ اللَّهِ لَقَدْ كَانَتِ الدُّنْيَا وَ مَا فِيهَا إِلَّا وَاحِدٌ يَعْبُدُ اللَّهَ وَ لَوْ كَانَ مَعَهُ غَيْرُهُ لَأَضَافَهُ اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ حَيْثُ يَقُولُ إِنَّ إِبْراهِيمَ كانَ أُمَّةً قانِتاً لِلَّهِ حَنِيفاً وَ لَمْ يَكُ مِنَ الْمُشْرِكِينَ ", "فَغَبَرَ بِذَلِكَ مَا شَاءَ اللَّهُ ثُمَّ إِنَّ اللَّهَ آنَسَهُ بِإِسْمَاعِيلَ وَ إِسْحَاقَ فَصَارُوا ثَلَاثَةً أَمَا وَ اللَّهِ إِنَّ الْمُؤْمِنَ لَقَلِيلٌ وَ إِنَّ أَهْلَ الْكُفْرِ لَكَثِيرٌ أَ تَدْرِي لِمَ ذَاكَ فَقُلْتُ لَا أَدْرِي جُعِلْتُ فِدَاكَ فَقَالَ صُيِّرُوا أُنْساً لِلْمُؤْمِنِينَ يَبُثُّونَ إِلَيْهِمْ مَا فِي صُدُورِهِمْ فَيَسْتَرِيحُونَ إِلَى ذَلِكَ وَ يَسْكُنُونَ إِلَيْهِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Sinan, from Ammar Bin Marwan, from Sama’at Bin Mihran who said, ", "‘Abd Salih<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup> said: ‘O Sama’at! They believed upon their beds and they are scaring me<sup>asws</sup>. But, by Allah<sup>azwj</sup>! It has been so that in the world and whatever was in it there was only one (person) who worshipped Allah<sup>azwj</sup>, and had there been anyone else along with him<sup>asws</sup>, Allah<sup>azwj</sup> Mighty and Majestic would have Added him in where He<sup>azwj</sup> is Saying <span class=\"ibTxt\">[16:120] Surely Ibrahim was a community, obedient to Allah, upright, and he was not from the Polytheists</span><span class=\"bTxt\">.</span>", "So it remained like that for as long as Allah<sup>azwj</sup> so Desired. Then Allah<sup>azwj</sup> Comforted him<sup>as</sup> with Ismail<sup>as</sup> and Is’haq. Thus they<sup>as</sup> became three. But, by Allah<sup>azwj</sup>! The <span class=\"iTxt\">Momineen</span> (have always been) few and the disbelievers numerous. Do you know why that is so?’ So I said, ‘I do not know, may I be sacrificed for you<sup>asws</sup>!’ So he<sup>asws</sup> said: ‘It became a comfort for the <span class=\"iTxt\">Momineen</span> what is Sent to them, what is in their hearts, so they are resting to that, and being tranquil to it’."]}}, {"index": 2316, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:2:1:100:6", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ أُورَمَةَ عَنِ النَّضْرِ عَنْ يَحْيَى بْنِ أَبِي خَالِدٍ الْقَمَّاطِ عَنْ حُمْرَانَ بْنِ أَعْيَنَ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) جُعِلْتُ فِدَاكَ مَا أَقَلَّنَا لَوِ اجْتَمَعْنَا عَلَى شَاةٍ مَا أَفْنَيْنَاهَا فَقَالَ أَ لَا أُحَدِّثُكَ بِأَعْجَبَ مِنْ ذَلِكَ الْمُهَاجِرُونَ وَ الْأَنْصَارُ ذَهَبُوا إِلَّا وَ أَشَارَ بِيَدِهِ ثَلَاثَةً ", "قَالَ حُمْرَانُ فَقُلْتُ جُعِلْتُ فِدَاكَ مَا حَالُ عَمَّارٍ قَالَ رَحِمَ اللَّهُ عَمَّاراً أَبَا الْيَقْظَانِ بَايَعَ وَ قُتِلَ شَهِيداً فَقُلْتُ فِي نَفْسِي مَا شَيْ‏ءٌ أَفْضَلَ مِنَ الشَّهَادَةِ فَنَظَرَ إِلَيَّ فَقَالَ لَعَلَّكَ تَرَى أَنَّهُ مِثْلُ الثَّلَاثَةِ أَيْهَاتَ أَيْهَاتَ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Awrama, from Al Nazar, from Yahya Bin Abu Khalid Al Qammat, from Humran Bin Ayn who said, ", "‘I said to Abu Ja’far<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! How few we are. If we were to gather together upon a sheep (feast), we would not (be able to) finish it’. So he<sup>asws</sup> said: ‘Shall I<sup>asws</sup> narrate to you with something more strange than that? The Emigrants and the Helpers were gone (at the time of Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup>) except for’, and he<sup>asws</sup> gestured with his<sup>asws</sup> hand, ‘three’ (Salman<sup>as</sup>, Abu Zarr<sup>as</sup> and Miqdad<sup>as</sup>)’. ", "Humran (the narrator) said, ‘So I said, ‘May I be sacrificed for you<sup>asws</sup>! What is the state of Ammar?’ He<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> have Mercy on Ammar, the alert. He pledged allegiance (to Abu Bakr) and was killed as a martyr’. So I said within myself, ‘What thing is more superior than the martyrdom?’ So he<sup>asws</sup> looked at me and he<sup>asws</sup> said: ‘Perhaps you view that he is like the (other) three. Far be it! Far be it!’."]}}, {"index": 2317, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:2:1:100:7", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ عَلِيِّ بْنِ جَعْفَرٍ قَالَ سَمِعْتُ أَبَا الْحَسَنِ ( عليه السلام ) يَقُولُ لَيْسَ كُلُّ مَنْ قَالَ بِوَلَايَتِنَا مُؤْمِناً وَ لَكِنْ جُعِلُوا أُنْساً لِلْمُؤْمِنِينَ ."], "translations": {"en.hubeali": ["Al Hassan Bin Muhammad, from Moalla Bin Muhammad, from Ahmad Bin Muhammad Bin Abdullah, ", "(It has been narrated) from Ali son of Ja’far<sup>asws</sup> who said, ‘I heard Abu Al-Hassan<sup>asws</sup> saying: ‘Not everyone who speaks as being with our<sup>asws</sup> Wilayah is a <span class=\"iTxt\">Momin</span>. But, it has been Made to be a comfort for the <span class=\"iTxt\">Momineen</span>’."]}}]}, "index": "al-kafi:2:1:100", "kind": "verse_list"}