{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:2:1", "titles": {"ar": "كتاب الإيمان و الكفر", "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"}}, {"indexed_titles": {"en": "Chapter 101"}, "path": "/books/al-kafi:2:1:101", "titles": {"ar": "بَابُ الرِّضَا بِمَوْهِبَةِ الْإِيمَانِ وَ الصَّبْرِ عَلَى كُلِّ شَيْ‏ءٍ بَعْدَهُ", "en": "Chapter 101 – The satisfaction with the gift of the Emān and the patience upon everything after it"}}], "index": 289, "local_index": 101, "part_type": "Chapter", "path": "/books/al-kafi:2:1:101", "titles": {"ar": "بَابُ الرِّضَا بِمَوْهِبَةِ الْإِيمَانِ وَ الصَّبْرِ عَلَى كُلِّ شَيْ‏ءٍ بَعْدَهُ", "en": "Chapter 101 – The satisfaction with the gift of the Emān and the patience upon everything after it"}, "verse_count": 6, "verse_start_index": 2317, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 2318, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:1:101:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ فُضَيْلِ بْنِ يَسَارٍ عَنْ عَبْدِ الْوَاحِدِ بْنِ الْمُخْتَارِ الْأَنْصَارِيِّ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) يَا عَبْدَ الْوَاحِدِ مَا يَضُرُّ رَجُلًا إِذَا كَانَ عَلَى ذَا الرَّأْيِ مَا قَالَ النَّاسُ لَهُ وَ لَوْ قَالُوا مَجْنُونٌ وَ مَا يَضُرُّهُ وَ لَوْ كَانَ عَلَى رَأْسِ جَبَلٍ يَعْبُدُ اللَّهَ حَتَّى يَجِيئَهُ الْمَوْتُ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr, from Fuzayl Bin Yasaar, from Abdul Wahid Bin Al Mukhtar Al Ansary who said, ", "‘Abu Ja’far<sup>asws</sup> said: ‘O Abdul Wahid! It would not harm a man when he was upon that view (of Al-Wilayah), what the people say for him, and even if they were to say he was insane; and it would not harm him and even if he was at the top of the mountain worshipping Allah<sup>azwj</sup> until the death comes to him’."]}}, {"index": 2319, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:1:101:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنِ ابْنِ مُسْكَانَ عَنْ مُعَلَّى بْنِ خُنَيْسٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَالَ اللَّهُ تَبَارَكَ وَ تَعَالَى لَوْ لَمْ يَكُنْ فِي الْأَرْضِ إِلَّا مُؤْمِنٌ وَاحِدٌ لَاسْتَغْنَيْتُ بِهِ عَنْ جَمِيعِ خَلْقِي وَ لَجَعَلْتُ لَهُ مِنْ إِيمَانِهِ أُنْساً لَا يَحْتَاجُ إِلَى أَحَدٍ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Ibn Muskan, from Moalla Bin Khunays, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Allah<sup>azwj</sup> Blessed and High Said: “If there does not happen to be in the earth except for one <span class=\"iTxt\">Momin</span>, I<sup>azwj</sup> would have Sufficed with him from the entirety of My<sup>azwj</sup> creatures, and would have Made his <span class=\"iTxt\">Emān</span> to be a comfort for him, he would not be needy to anyone (else)’."]}}, {"index": 2320, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:2:1:101:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنِ الْحُسَيْنِ بْنِ مُوسَى عَنْ فُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ مَا يُبَالِي مَنْ عَرَّفَهُ اللَّهُ هَذَا الْأَمْرَ أَنْ يَكُونَ عَلَى قُلَّةِ جَبَلٍ يَأْكُلُ مِنْ نَبَاتِ الْأَرْضِ حَتَّى يَأْتِيَهُ الْمَوْتُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ahmad Bin Muhammad Bin Abu Nasr, from Al Husayn Bin Musa, from Fuzayl Bin Yasaar, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘What would he care, the one whom Allah<sup>azwj</sup> Casues to recognise this matter (Al-Wilayah), if he happens to be upon the top of a mountain, eating from the vegetation of the earth until the death comes to him’."]}}, {"index": 2321, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:2:1:101:4", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ كُلَيْبِ بْنِ مُعَاوِيَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ مَا يَنْبَغِي لِلْمُؤْمِنِ أَنْ يَسْتَوْحِشَ إِلَى أَخِيهِ فَمَنْ دُونَهُ الْمُؤْمِنُ عَزِيزٌ فِي دِينِهِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Kuleyb Bin Muawiya, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘It is not befitting for the <span class=\"iTxt\">Momin</span> that he alienates to his brother from the ones below him (in understanding). The <span class=\"iTxt\">Momin</span>een are highly valued people in their Religion’."]}}, {"index": 2322, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:2:1:101:5", "text": ["عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ عُمَرَ بْنِ أَبَانٍ وَ سَيْفِ بْنِ عَمِيرَةَ عَنْ فُضَيْلِ بْنِ يَسَارٍ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي مَرْضَةٍ مَرِضَهَا لَمْ يَبْقَ مِنْهُ إِلَّا رَأْسُهُ فَقَالَ يَا فُضَيْلُ إِنَّنِي كَثِيراً مَا أَقُولُ مَا عَلَى رَجُلٍ عَرَّفَهُ اللَّهُ هَذَا الْأَمْرَ لَوْ كَانَ فِي رَأْسِ جَبَلٍ حَتَّى يَأْتِيَهُ الْمَوْتُ", "يَا فُضَيْلَ بْنَ يَسَارٍ إِنَّ النَّاسَ أَخَذُوا يَمِيناً وَ شِمَالًا وَ إِنَّا وَ شِيعَتَنَا هُدِينَا الصِّرَاطَ الْمُسْتَقِيمَ يَا فُضَيْلَ بْنَ يَسَارٍ إِنَّ الْمُؤْمِنَ لَوْ أَصْبَحَ لَهُ مَا بَيْنَ الْمَشْرِقِ وَ الْمَغْرِبِ كَانَ ذَلِكَ خَيْراً لَهُ وَ لَوْ أَصْبَحَ مُقَطَّعاً أَعْضَاؤُهُ كَانَ ذَلِكَ خَيْراً لَهُ يَا فُضَيْلَ بْنَ يَسَارٍ إِنَّ اللَّهَ لَا يَفْعَلُ بِالْمُؤْمِنِ إِلَّا مَا هُوَ خَيْرٌ لَهُ", "يَا فُضَيْلَ بْنَ يَسَارٍ لَوْ عَدَلَتِ الدُّنْيَا عِنْدَ اللَّهِ عَزَّ وَ جَلَّ جَنَاحَ بَعُوضَةٍ مَا سَقَى عَدُوَّهُ مِنْهَا شَرْبَةَ مَاءٍ يَا فُضَيْلَ بْنَ يَسَارٍ إِنَّهُ مَنْ كَانَ هَمُّهُ هَمّاً وَاحِداً كَفَاهُ اللَّهُ هَمَّهُ وَ مَنْ كَانَ هَمُّهُ فِي كُلِّ وَادٍ لَمْ يُبَالِ اللَّهُ بِأَيِّ وَادٍ هَلَكَ ."], "translations": {"en.hubeali": ["From him, from Ahmad Bin Muhammad, from Muhammad Bin Khalid, from Fazalat Bin Ayoub, from Umar Bin Aban and Sayf Bin Ameyra, from Fuzayl Bin Yasaar who said, ", "‘I went over to Abu Abdullah<sup>asws</sup> during an illness which had spread and there did not remain from him<sup>asws</sup> except for his<sup>asws</sup> head (as unaffected). So he<sup>asws</sup> said: ‘O Fuzayl! It is very frequently what I<sup>asws</sup> am saying, what is upon a man whom Allah<sup>azwj</sup> Causes to recognise this matter (Al-Wilayah), if he were to be at the top of a mountain until the death comes to him?", "O Fuzay Bin Yasaar! The people are taking to the right and the left, and we<sup style=\"font-weight: normal\">asws</sup> and our<sup style=\"font-weight: normal\">asws</sup> Shia, we are Guided to the Straight Path. O Fuzayl Bin Yasaar” The <span class=\"iTxt\">Momin</span>, if there happens to be for him, what is between the east and the west, it would be better for him, and if he was to become of cut off limbs, that would be better for him. O Fuzayl Bin Yasaar! Allah<sup style=\"font-weight: normal\">azwj</sup> does not Do with the <span class=\"iTxt\">Momin</span> except for what is better for him.", "O Fuzayl Bin Yasaar! Had the world in the Presence of Allah<sup>azwj</sup> equated to a wing of a fly, He<sup>azwj</sup> would not have Quenched His<sup>azwj</sup> enemies from it a drink of water. O Fuzayl Bin Yasaar! The one who concerns himself with one concern, Allah<sup>azwj</sup> would Suffice his concern, and the one whose concern was in every valley, Allah<sup>azwj</sup> would not Care in which valley he perishes’."]}}, {"index": 2323, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:2:1:101:6", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ مَنْصُورٍ الصَّيْقَلِ وَ الْمُعَلَّى بْنِ خُنَيْسٍ قَالَا سَمِعْنَا أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَالَ اللَّهُ عَزَّ وَ جَلَّ مَا تَرَدَّدْتُ فِي شَيْ‏ءٍ أَنَا فَاعِلُهُ كَتَرَدُّدِي فِي مَوْتِ عَبْدِيَ الْمُؤْمِنِ إِنَّنِي لَأُحِبُّ لِقَاءَهُ وَ يَكْرَهُ الْمَوْتَ فَأَصْرِفُهُ عَنْهُ وَ إِنَّهُ لَيَدْعُونِي فَأُجِيبُهُ وَ إِنَّهُ لَيَسْأَلُنِي فَأُعْطِيهِ وَ لَوْ لَمْ يَكُنْ فِي الدُّنْيَا إِلَّا وَاحِدٌ مِنْ عَبِيدِي مُؤْمِنٌ لَاسْتَغْنَيْتُ بِهِ عَنْ جَمِيعِ خَلْقِي وَ لَجَعَلْتُ لَهُ مِنْ إِيمَانِهِ أُنْساً لَا يَسْتَوْحِشُ إِلَى أَحَدٍ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Ibn Muskan, from Mansour Al Sayqal and Al Moalla Bin Khunays who both said, ", "‘We both heard Abu Abdullah<sup>asws</sup> saying: ‘Rasool-Allah<sup>saww</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Said: ‘I<sup>azwj</sup> do not Hesitate with regards to anything I<sup>azwj</sup> Do like I<sup>azwj</sup> Hesitate regarding the death of My<sup>azwj</sup> <span class=\"iTxt\">Momin</span> servant. I<sup>azwj</sup> Love to Meet him and he dislikes the death, so I<sup>azwj</sup> Exchange it from him; and he supplicates to Me<sup>azwj</sup>, so I<sup>azwj</sup> Answer him, and he asks Me<sup>azwj</sup>, so I<sup>azwj</sup> Give him; and if there did not happen to be in the world except for one <span class=\"iTxt\">Momin</span> from My<sup>azwj</sup> servants, I<sup>azwj</sup> would have Sufficed with him from the entirety of My<sup>azwj</sup> creatures, and would have Made his <span class=\"iTxt\">Emān</span> to be a comfort for him, (so that) he would not yearn to anyone’."]}}]}, "index": "al-kafi:2:1:101", "kind": "verse_list"}