{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 104"
        },
        "path": "/books/al-kafi:2:1:104",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابٌ فِي أَنَّ الْمُؤْمِنَ</span> صِنْفَانِ",
          "en": "Chapter 104 – Regarding that the Momin is of two types"
        }
      }
    ],
    "index": 292,
    "local_index": 104,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 105"
        },
        "path": "/books/al-kafi:2:1:105",
        "titles": {
          "ar": "بَابُ مَا أَخَذَهُ اللَّهُ عَلَى الْمُؤْمِنِ مِنَ الصَّبْرِ عَلَى مَا يَلْحَقُهُ فِيمَا ابْتُلِيَ بِهِ",
          "en": "Chapter 105 – What (Covenant) Allah<sup>azwj</sup> has Taken upon the Momin, from the patience upon whatever he faces regarding what he has been afflicted with"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 103"
        },
        "path": "/books/al-kafi:2:1:103",
        "titles": {
          "ar": "بَابٌ فِيمَا يَدْفَعُ اللَّهُ بِالْمُؤْمِنِ",
          "en": "Chapter 103 – Regarding what Allah<sup>azwj</sup> Fends off due to the Momin"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:104",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابٌ فِي أَنَّ الْمُؤْمِنَ</span> صِنْفَانِ",
      "en": "Chapter 104 – Regarding that the Momin is of two types"
    },
    "verse_count": 3,
    "verse_start_index": 2327,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/303)"
        ],
        "index": 2328,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:104:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ نُصَيْرٍ أَبِي الْحَكَمِ الْخَثْعَمِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْمُؤْمِنُ مُؤْمِنَانِ فَمُؤْمِنٌ صَدَقَ بِعَهْدِ اللَّهِ وَ وَفَى بِشَرْطِهِ وَ ذَلِكَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ رِجالٌ صَدَقُوا ما عاهَدُوا اللَّهَ عَلَيْهِ فَذَلِكَ الَّذِي لَا تُصِيبُهُ أَهْوَالُ الدُّنْيَا وَ لَا أَهْوَالُ الْآخِرَةِ وَ ذَلِكَ مِمَّنْ يَشْفَعُ وَ لَا يُشْفَعُ لَهُ ",
          "وَ مُؤْمِنٌ كَخَامَةِ الزَّرْعِ تَعْوَجُّ أَحْيَاناً وَ تَقُومُ أَحْيَاناً فَذَلِكَ مِمَّنْ تُصِيبُهُ أَهْوَالُ الدُّنْيَا وَ أَهْوَالُ الْآخِرَةِ وَ ذَلِكَ مِمَّنْ يُشْفَعُ لَهُ وَ لَا يَشْفَعُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Nusayr Abu Al Hakam Al Khash’amy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The <span class=\"iTxt\">Momineen</span> are of two (types of) <span class=\"iTxt\">Momin</span>een. So there is a <span class=\"iTxt\">Momin</span> who ratified with the Covenant of Allah<sup>azwj</sup> and loyal with His<sup>azwj</sup> Stipulation (Condition), and that is in the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[33:23] From the Believers are men who ratified what Covenant Allah Made with them</span>. So that is the one who would not be hit by the horrors of the world and the Hereafter, and that is from the one would interceded and would (be in no need) to be interceded for.",
            "And there is a <span class=\"iTxt\">Momin</span> like the stalk (trunk) of the plants, sometimes he is crooked (bent towards sins) and sometimes he is straight. So that is from the one who would be hit by the horrors of the world and the horrors of the Hereafter, and that is from the one who would be interceded for and he would not be interceding (for anyone else)’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from Nasir abu al-Hakim al-Khath’ami from abu ‘Abd Allah (a.s.) who has said the following: “There are two kinds of believing people: one kind is true to the covenant with Allah and has kept the stipulation as Allah, the Most Majestic, the Most Holy, has said, ‘Among the believers there are people who are true in their promise to Allah. . . .’ (33:23) This kind of believing people do not become subject to any fear, worldly or in the hereafter. They are those who intercede for others but need no intercession. There are the kinds of believing people who are like a sprouting plant that grows straight sometimes and not so straight under certain conditions. This kind of believing people may become subject to fear in this world as well as in the next life. They need intercession but cannot intercede for anyone.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (306/ 9)"
        ],
        "index": 2329,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:104:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ خَالِدٍ الْعَمِّيِّ عَنْ خَضِرِ بْنِ عَمْرٍو عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ الْمُؤْمِنُ مُؤْمِنَانِ مُؤْمِنٌ وَفَى لِلَّهِ بِشُرُوطِهِ الَّتِي شَرَطَهَا عَلَيْهِ فَذَلِكَ مَعَ النَّبِيِّينَ وَ الصِّدِّيقِينَ وَ الشُّهَدَاءِ وَ الصَّالِحِينَ وَ حَسُنَ أُولَئِكَ رَفِيقاً وَ ذَلِكَ مَنْ يَشْفَعُ وَ لَا يُشْفَعُ لَهُ وَ ذَلِكَ مِمَّنْ لَا تُصِيبُهُ أَهْوَالُ الدُّنْيَا وَ لَا أَهْوَالُ الْآخِرَةِ ",
          "وَ مُؤْمِنٌ زَلَّتْ بِهِ قَدَمٌ فَذَلِكَ كَخَامَةِ الزَّرْعِ كَيْفَمَا كَفَأَتْهُ الرِّيحُ انْكَفَأَ وَ ذَلِكَ مِمَّنْ تُصِيبُهُ أَهْوَالُ الدُّنْيَا وَ الْآخِرَةِ وَ يُشْفَعُ لَهُ وَ هُوَ عَلَى خَيْرٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Abdullah, from Khalid Al Amma, from Khazir Bin Amro, ",
            "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup>, said, ‘I heard him<sup style=\"font-weight: normal\">asws</sup> saying: ‘The <span class=\"iTxt\">Momin</span> are (two types of) <span class=\"iTxt\">Momin</span>s. A <span class=\"iTxt\">Momin</span> who is loyal to Allah<sup style=\"font-weight: normal\">azwj</sup> with His<sup style=\"font-weight: normal\">azwj</sup> Stipulation which He<sup style=\"font-weight: normal\">azwj</sup> Stipulated upon him. So that one would be with <span class=\"ibTxt\">[4:69] the Prophets and the Truthful and the Martyrs and the Righteous, and a goodly company are they!</span>. And that would be the one who would (be able to) intercede and (would not need to be (interceded for), and that one is from the one who would neither be hity by the horrors of the world nor the horrors of the Hereafter.",
            "And there is a <span class=\"iTxt\">Momin</span> whose feet waver with him, so that one is like the stalk of the plants. He moves whichever way the wind moves him, and that one is from the ones who would be hit by the horrors of the world and the Hereafter, and he would be interceded for, and he is upon good’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Sah ibn Ziyad from Muhammad ibn ‘Abd Allah from Khalid al-‘Ammi from Khidr ibn ‘Amr from abu ‘Abd Alllah (RecipientofDivineSupremeCovenant who has said the following: “I heard the Imam saying, ‘There are two kinds of believing people: one kind is true to the stipulations that He has made with him. He is with the prophets, the truthful ones, the martyrs and the virtuous ones. These indeed are good companions. Such ones intercede on behalf of others but they themselves do not need anyone’s intercessions on their behalf. Such believers do not suffer from any frightening thing in this world or in the hereafter. There are the believers who lose balance. Such believers are like a sprouting plant that deals with the wind as it goes. Such believers face the frightening things in this world and in the hereafter. They need others intercession on their behalf but they are in good hands.’” "
          ]
        }
      },
      {
        "index": 2330,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:104:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ أَبِي مَرْيَمَ الْأَنْصَارِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَامَ رَجُلٌ بِالْبَصْرَةِ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ أَخْبِرْنَا عَنِ الْإِخْوَانِ فَقَالَ الْإِخْوَانُ صِنْفَانِ إِخْوَانُ الثِّقَةِ وَ إِخْوَانُ الْمُكَاشَرَةِ",
          "فَأَمَّا إِخْوَانُ الثِّقَةِ فَهُمُ الْكَفُّ وَ الْجَنَاحُ وَ الْأَهْلُ وَ الْمَالُ فَإِذَا كُنْتَ مِنْ أَخِيكَ عَلَى حَدِّ الثِّقَةِ فَابْذُلْ لَهُ مَالَكَ وَ بَدَنَكَ وَ صَافِ مَنْ صَافَاهُ وَ عَادِ مَنْ عَادَاهُ وَ اكْتُمْ سِرَّهُ وَ عَيْبَهُ وَ أَظْهِرْ مِنْهُ الْحَسَنَ وَ اعْلَمْ أَيُّهَا السَّائِلُ أَنَّهُمْ أَقَلُّ مِنَ الْكِبْرِيتِ الْأَحْمَرِ ",
          "وَ أَمَّا إِخْوَانُ الْمُكَاشَرَةِ فَإِنَّكَ تُصِيبُ لَذَّتَكَ مِنْهُمْ فَلَا تَقْطَعَنَّ ذَلِكَ مِنْهُمْ وَ لَا تَطْلُبَنَّ مَا وَرَاءَ ذَلِكَ مِنْ ضَمِيرِهِمْ وَ ابْذُلْ لَهُمْ مَا بَذَلُوا لَكَ مِنْ طَلَاقَةِ الْوَجْهِ وَ حَلَاوَةِ اللِّسَانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ismail Bin Mihran, from Yunus Bin Yaqoub, from Abu Maryam Al Ansary, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘A man from Al-Basra stood up to Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup> and he said, ‘O Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup>! Inform us about the brethren’. So he<sup>asws</sup> said: ‘The brethren are of two types – The trustworthy brethren and the friendly brethren. ",
            "So as for the trustworthy brethren, so they are the palm, and the wing, and the family and the wealth. So when you were with a brother of yours who was upon the limit of trustworthiness, so spend the wealth and (exert) your body for him, and be sincere to those who are sincere to him, and assist those who assist him, and conceal his secrets and his faults and manifest the goodness from him. And know, O you people! They are scarcer than the red Ruby (in nature). ",
            "And as for the friendly brethren, so you would be attaining your pleasure from them, therefore do no cut that off from them, nor seek what is behind that from their consciences, and exert for them what they are exerting for you, from the relaxedness of the face and the sweetness of the tongue’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Isma’il ibn Mehran from Yunus ibn Ya’qub from abu Maryam al-Ansari from abu Ja’far (a.s.) who has said the following: “Once a man in Basra stood before Amir al-Mu’minin (Ali ibn abu Talib) (a.s.) and asked, ‘O Amir al-Mu’minin, speak to us of brothers (in belief).’ The Imam said, ‘Brothers are of two kinds: Trustworthy brothers and smiling brothers. The trustworthy brothers are one’s palms, wings, the family and wealth. If they are trustworthy you may spend and work for them, be sincere to those sincere to him, and be the enemy of his enemies, conceal his secrets and faults and publicize his virtuous qualities. You (questioning person) must know that they are as rare as alchemy. On the other hand, you may enjoy the smiling brother’s association that you should not cut it off from them but do not seek anything beyond it of their conscience. Do for them as much as they do for you like a happy face and sweet expressions.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:104",
  "kind": "verse_list"
}