{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:2:1", "titles": {"ar": "كتاب الإيمان و الكفر", "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"}}, {"indexed_titles": {"en": "Chapter 107"}, "path": "/books/al-kafi:2:1:107", "titles": {"ar": "بَابُ فَضْلِ فُقَرَاءِ الْمُسْلِمِينَ", "en": "Chapter 107 – The merits for the poor Muslims"}}], "index": 295, "local_index": 107, "part_type": "Chapter", "path": "/books/al-kafi:2:1:107", "titles": {"ar": "بَابُ فَضْلِ فُقَرَاءِ الْمُسْلِمِينَ", "en": "Chapter 107 – The merits for the poor Muslims"}, "verse_count": 23, "verse_start_index": 2373, "verses": [{"index": 2374, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الْعَلَاءِ عَنِ ابْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ فُقَرَاءَ الْمُسْلِمِينَ يَتَقَلَّبُونَ فِي رِيَاضِ الْجَنَّةِ قَبْلَ أَغْنِيَائِهِمْ بِأَرْبَعِينَ خَرِيفاً \nثُمَّ قَالَ سَأَضْرِبُ لَكَ مَثَلَ ذَلِكَ إِنَّمَا مَثَلُ ذَلِكَ مَثَلُ سَفِينَتَيْنِ مُرَّ بِهِمَا عَلَى عَاشِرٍ فَنَظَرَ فِي إِحْدَاهُمَا فَلَمْ يَرَ فِيهَا شَيْئاً فَقَالَ أَسْرِبُوهَا وَ نَظَرَ فِي الْأُخْرَى فَإِذَا هِيَ مَوْقُورَةٌ فَقَالَ احْبِسُوهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Muhammad Bin Sinan, from Al A’ala, from Ibn Abu Yafour, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The poor Muslims would be strolling in the Gardens of the Paradise before their rich ones do by forty autumns (years)’. \nThen he<sup style=\"font-weight: normal\">asws</sup> said: ‘I<sup style=\"font-weight: normal\">asws</sup> shall strike an example of that for you. But rather, an example of that is an example of two ships passing by a tax collector. So he looks into one of the two but does not see anything in it. So he says, ‘Let it go’. And he looks into the other one, so it is fully laden. So he says, ‘Withhold it’."}]}, {"index": 2375, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:2", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ سَعْدَانَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) الْمَصَائِبُ مِنَحٌ مِنَ اللَّهِ وَ الْفَقْرُ مَخْزُونٌ عِنْدَ اللَّهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Sa’dan who said, \n‘Abu Abdullah<sup>asws</sup> said: ‘The difficulties are a Conferment from Allah<sup>azwj</sup>, and the poverty is a Hoarded treasure in the Presence of Allah<sup>azwj</sup>’."}]}, {"index": 2376, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:3", "text": "وَ عَنْهُ رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَا عَلِيُّ إِنَّ اللَّهَ جَعَلَ الْفَقْرَ أَمَانَةً عِنْدَ خَلْقِهِ فَمَنْ سَتَرَهُ أَعْطَاهُ اللَّهُ مِثْلَ أَجْرِ الصَّائِمِ الْقَائِمِ وَ مَنْ أَفْشَاهُ إِلَى مَنْ يَقْدِرُ عَلَى قَضَاءِ حَاجَتِهِ فَلَمْ يَفْعَلْ فَقَدْ قَتَلَهُ أَمَا إِنَّهُ مَا قَتَلَهُ بِسَيْفٍ وَ لَا رُمْحٍ وَ لَكِنَّهُ قَتَلَهُ بِمَا نَكَى مِنْ قَلْبِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "And from him, raising it, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘O Ali<sup>asws</sup>! Allah<sup>azwj</sup> Made the poverty to be an entrustment with His<sup>azwj</sup> creatures. So the one who conceals it, Allah<sup>azwj</sup> would Give him the likes of the Recompense of a Fasting one, and the one who publicises it to the one who is able upon fulfilling his need, but does not do so, so he has killed him (the questioner). But, he would not have killed him by a sword nor a spear, but he would have killed him by what hurt his heart’."}]}, {"index": 2377, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:4", "text": "عَنْهُ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ دَاوُدَ الْحَذَّاءِ عَنْ مُحَمَّدِ بْنِ صَغِيرٍ عَنْ جَدِّهِ شُعَيْبٍ عَنْ مُفَضَّلٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كُلَّمَا ازْدَادَ الْعَبْدُ إِيمَاناً ازْدَادَ ضِيقاً فِي مَعِيشَتِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Muhammad Bin Ali, from Dawood Al Haza’a, from Muhammad Bin Sagheer, from his grandfather Shuayb, from Mufazzal who said, \n‘Abu Abdullah<sup>asws</sup> said: ‘Every time the <span class=\"iTxt\">Emān</span> of the servant increases, the constriction in his livelihood increases’."}]}, {"index": 2378, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:5", "text": "وَ بِإِسْنَادِهِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَوْ لَا إِلْحَاحُ الْمُؤْمِنِينَ عَلَى اللَّهِ فِي طَلَبِ الرِّزْقِ لَنَقَلَهُمْ مِنَ الْحَالِ الَّتِي هُمْ فِيهَا إِلَى حَالٍ أَضْيَقَ مِنْهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "And by his chain, said, \n‘Abu Abdullah<sup>asws</sup> said: ‘Had it not been for the pleading of the <span class=\"iTxt\">Momineen</span> to Allah<sup>azwj</sup> regarding seeking of the sustenance, He<sup>azwj</sup> would have Transferred them from a state which they were in to a state more constricted than it’."}]}, {"index": 2379, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:6", "text": "عَنْهُ عَنْ بَعْضِ أَصْحَابِهِ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَا أُعْطِيَ عَبْدٌ مِنَ الدُّنْيَا إِلَّا اعْتِبَاراً وَ مَا زُوِيَ عَنْهُ إِلَّا اخْتِبَاراً .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from one of his companions, raising it, said, \n‘Abu Abdullah<sup>asws</sup> said: ‘Whatever Given to a servant from the world is only as a lesson, and whatever is Delayed from him is only as a Trial’."}]}, {"index": 2380, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:7", "text": "عَنْهُ عَنْ نُوحِ بْنِ شُعَيْبٍ وَ أَبِي إِسْحَاقَ الْخَفَّافِ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَيْسَ لِمُصَاصِ شِيعَتِنَا فِي دَوْلَةِ الْبَاطِلِ إِلَّا الْقُوتُ شَرِّقُوا إِنْ شِئْتُمْ أَوْ غَرِّبُوا لَنْ تُرْزَقُوا إِلَّا الْقُوتَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Nuh Bin Shuayb and Abu Is’haq Al Khaffaf, from A man, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There is nothing for our<sup>asws</sup> sincere Shia in the government of the falsehood except for the bare necessities. They can go east if they so like to, or west, they will never be Graced except with the bare necessities’."}]}, {"index": 2381, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:8", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ الْأَشْعَرِيِّ عَنْ بَعْضِ مَشَايِخِهِ عَنْ إِدْرِيسَ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ النَّبِيُّ ( صلى الله عليه وآله ) يَا عَلِيُّ الْحَاجَةُ أَمَانَةُ اللَّهِ عِنْدَ خَلْقِهِ فَمَنْ كَتَمَهَا عَلَى نَفْسِهِ أَعْطَاهُ اللَّهُ ثَوَابَ مَنْ صَلَّى وَ مَنْ كَشَفَهَا إِلَى مَنْ يَقْدِرُ أَنْ يُفَرِّجَ عَنْهُ وَ لَمْ يَفْعَلْ فَقَدْ قَتَلَهُ أَمَا إِنَّهُ لَمْ يَقْتُلْهُ بِسَيْفٍ وَ لَا سِنَانٍ وَ لَا سَهْمٍ وَ لَكِنْ قَتَلَهُ بِمَا نَكَى مِنْ قَلْبِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Al Hassan Al Ashary, from one of his Sheykhs, from Idrees Bin Abdullah, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Prophet<sup>saww</sup> said: ‘O Ali<sup>asws</sup>! There is a need in <span style=\"text-decoration: line-through\">an</span> Entrustment of Allah<sup>azwj</sup> with His<sup>azwj</sup> creatures. So the one who conceals it upon himself, Allah<sup>azwj</sup> would Give him the Rewards of the one who prays <span class=\"iTxt\">Salāt</span>, but if he reveals it to the one who is able to help and does not help he has killed him, not with a sword or spears, but has killed him by breaking his heart’."}]}, {"index": 2382, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:9", "text": "وَ عَنْهُ عَنْ أَحْمَدَ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَعْدَانَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَلْتَفِتُ يَوْمَ الْقِيَامَةِ إِلَى فُقَرَاءِ الْمُؤْمِنِينَ شَبِيهاً بِالْمُعْتَذِرِ إِلَيْهِمْ فَيَقُولُ وَ عِزَّتِي وَ جَلَالِي مَا أَفْقَرْتُكُمْ فِي الدُّنْيَا مِنْ هَوَانٍ بِكُمْ عَلَيَّ وَ لَتَرَوُنَّ مَا أَصْنَعُ بِكُمُ الْيَوْمَ فَمَنْ زَوَّدَ أَحَداً مِنْكُمْ فِي دَارِ الدُّنْيَا مَعْرُوفاً فَخُذُوا بِيَدِهِ فَأَدْخِلُوهُ الْجَنَّةَ \nقَالَ فَيَقُولُ رَجُلٌ مِنْهُمْ يَا رَبِّ إِنَّ أَهْلَ الدُّنْيَا تَنَافَسُوا فِي دُنْيَاهُمْ فَنَكَحُوا النِّسَاءَ وَ لَبِسُوا الثِّيَابَ اللَّيِّنَةَ وَ أَكَلُوا الطَّعَامَ وَ سَكَنُوا الدُّورَ وَ رَكِبُوا الْمَشْهُورَ مِنَ الدَّوَابِّ فَأَعْطِنِي مِثْلَ مَا أَعْطَيْتَهُمْ فَيَقُولُ تَبَارَكَ وَ تَعَالَى لَكَ وَ لِكُلِّ عَبْدٍ مِنْكُمْ مِثْلُ مَا أَعْطَيْتُ أَهْلَ الدُّنْيَا مُنْذُ كَانَتِ الدُّنْيَا إِلَى أَنِ انْقَضَتِ الدُّنْيَا سَبْعُونَ ضِعْفاً .", "translations": [{"lang": "en", "name": "hubeali", "text": "And from him, from Ahmad, from Ali Bin Al Hakam, from Sa’dan who said, \n‘Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> said: ‘Allah<sup style=\"font-weight: normal\">azwj</sup> would be Turning (with Mercy) towards the poor <span class=\"iTxt\">Momineen</span> on the Day of Judgement aimilar to being Apologetic towards them and He<sup style=\"font-weight: normal\">azwj</sup> would be Saying: “ By My<sup style=\"font-weight: normal\">azwj</sup> Honour and My<sup style=\"font-weight: normal\">azwj</sup> Majestic! I<sup style=\"font-weight: normal\">azwj</sup> did not Impoverish you all in the world due to abasement with you upon Me<sup style=\"font-weight: normal\">azwj</sup>, and you will be seeing what I<sup style=\"font-weight: normal\">azwj</sup> shall be Doing with you today.So the one who provided any one of you in the house of the world with goodness, so grab him by the hand and enter him into the Paradise”. \nHe<sup style=\"font-weight: normal\">asws</sup> said: ‘So a man from them would be saying, ‘O Lord<sup style=\"font-weight: normal\">azwj</sup>! The people of the world used to compete with each other in regarding their world, so they married the women and wore the soft clothes, and ate the meals, and dwelled in the houses, and rode the distinguished from the riding animals, therefore Give me similar to what You<sup style=\"font-weight: normal\">azwj</sup> had Given them’. So the Blessed and High would be Saying: “For you and for every servant from you all would be similar to what I<sup style=\"font-weight: normal\">azwj</sup> had Given, seventy times over, to the people of the world (in the Paradise) since that World exist (forever) after the expiry of the (moral) world’."}]}, {"index": 2383, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:10", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ عَنْ إِسْمَاعِيلَ بْنِ سَهْلٍ وَ إِسْمَاعِيلَ بْنِ عَبَّادٍ جَمِيعاً يَرْفَعَانِهِ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا كَانَ مِنْ وُلْدِ آدَمَ مُؤْمِنٌ إِلَّا فَقِيراً وَ لَا كَافِرٌ إِلَّا غَنِيّاً حَتَّى جَاءَ إِبْرَاهِيمُ ( عليه السلام ) فَقَالَ رَبَّنا لا تَجْعَلْنا فِتْنَةً لِلَّذِينَ كَفَرُوا فَصَيَّرَ اللَّهُ فِي هَؤُلَاءِ أَمْوَالًا وَ حَاجَةً وَ فِي هَؤُلَاءِ أَمْوَالًا وَ حَاجَةً .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ibrahim Bin Uqba, from Ismail Bin Sahl and Ismail Bin Abbad, altogether raising it to, \nAbu Abdullah<sup>asws</sup> having said: ‘There was never a <span class=\"iTxt\">Momin</span> from the sons of Adam<sup>as</sup> except as poor, nor a disbeliever except as rich until Ibrahim<sup>as</sup> came, so he<sup>as</sup> said <span class=\"ibTxt\">[60:5] Our Lord! Do not make us a trial for those who disbelieve</span>. Thus, Allah<sup>azwj</sup> Transferred wealth and needs to be in these ones, and wealth and needs to be in those ones’."}]}, {"index": 2384, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:11", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ جَاءَ رَجُلٌ مُوسِرٌ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) نَقِيُّ الثَّوْبِ فَجَلَسَ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَجَاءَ رَجُلٌ مُعْسِرٌ دَرِنُ الثَّوْبِ فَجَلَسَ إِلَى جَنْبِ الْمُوسِرِ فَقَبَضَ الْمُوسِرُ ثِيَابَهُ مِنْ تَحْتِ فَخِذَيْهِ فَقَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَ خِفْتَ أَنْ يَمَسَّكَ مِنْ فَقْرِهِ شَيْ‏ءٌ قَالَ لَا قَالَ فَخِفْتَ أَنْ يُصِيبَهُ مِنْ غِنَاكَ شَيْ‏ءٌ قَالَ لَا قَالَ فَخِفْتَ أَنْ يُوَسِّخَ ثِيَابَكَ قَالَ لَا \nقَالَ فَمَا حَمَلَكَ عَلَى مَا صَنَعْتَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ لِي قَرِيناً يُزَيِّنُ لِي كُلَّ قَبِيحٍ وَ يُقَبِّحُ لِي كُلَّ حَسَنٍ وَ قَدْ جَعَلْتُ لَهُ نِصْفَ مَالِي فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِلْمُعْسِرِ أَ تَقْبَلُ قَالَ لَا فَقَالَ لَهُ الرَّجُلُ وَ لِمَ قَالَ أَخَافُ أَنْ يَدْخُلَنِي مَا دَخَلَكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from the one who mentioned it, \n(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> having said: ‘An affluent man came to Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> wearing clean clothes, and he sat by the side of Rasool-Allah<sup style=\"font-weight: normal\">saww</sup>. And a poor man wearing dirty clothes came over and sat by the side of the affluent man. So the affluent man grabbed his clothes from beneath his thighs. So Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> said to him: ‘Are you fearing that something from his poverty might touch you?’ He said, ‘No’. He<sup style=\"font-weight: normal\">saww</sup> said: ‘So did you fear that something from your riches might go to him?’ He said, ‘No’. He<sup style=\"font-weight: normal\">saww</sup> said: ‘So did you fear he might dirty your clothes?’ He said, ‘No’. \nHe<sup style=\"font-weight: normal\">saww</sup> said: ‘So what carried you upon (doing) what you did?’ So he said, ‘O Rasool-Allah<sup style=\"font-weight: normal\">saww</sup>! I have an associate (within myself) who adorns every ugly thing for me, and makes ugly for me every good thing, and I have (decided) make half my wealth for him (the poor man)’. So Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> said to the poor man: ‘Do you accept?’ He said, ‘No’. So the (affluent) man said to him, ‘And why not?’ He said, ‘I fear that there would enter into me (the feelings) what entered into you’."}]}, {"index": 2385, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:12", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْمِنْقَرِيِّ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي مُنَاجَاةِ مُوسَى ( عليه السلام ) يَا مُوسَى إِذَا رَأَيْتَ الْفَقْرَ مُقْبِلًا فَقُلْ مَرْحَباً بِشِعَارِ الصَّالِحِينَ وَ إِذَا رَأَيْتَ الْغِنَى مُقْبِلًا فَقُلْ ذَنْبٌ عُجِّلَتْ عُقُوبَتُهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from Ali Bin Muhammad Al Qasany, from Al Qasim Bin Muhammad, from Suleyman Bin Dawood Al Minqary, from Hafs Bin Giyas, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘In a Whispering (of Allah<sup>azwj</sup> to) Musa<sup>as</sup>: “O Musa<sup>as</sup>! Whenever you see the poverty coming, so say: ‘Welcome to the banner of the righteous!’; and whenever you<sup>as</sup> see the riches coming, so say: ‘A sin, the Punishment of which has hastened’”’."}]}, {"index": 2386, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:13", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ النَّبِيُّ ( صلى الله عليه وآله ) طُوبَى لِلْمَسَاكِينِ بِالصَّبْرِ وَ هُمُ الَّذِينَ يَرَوْنَ مَلَكُوتَ السَّمَاوَاتِ وَ الْأَرْضِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Prophet<sup>saww</sup> said: ‘Tooba is for the poor ones due to the patience, and they are those who would be shown the Kingdoms of the skies and the earth’."}]}, {"index": 2387, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:14", "text": "وَ بِإِسْنَادِهِ قَالَ قَالَ النَّبِيُّ ( صلى الله عليه وآله ) يَا مَعْشَرَ الْمَسَاكِينِ طِيبُوا نَفْساً وَ أَعْطُوا اللَّهَ الرِّضَا مِنْ قُلُوبِكُمْ يُثِبْكُمُ اللَّهُ عَزَّ وَ جَلَّ عَلَى فَقْرِكِمْ فَإِنْ لَمْ تَفْعَلُوا فَلَا ثَوَابَ لَكُمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "And by his chain, \n‘He<sup>asws</sup> said: ‘The Prophet<sup>saww</sup> said: ‘O group of the poor ones! Pleasant yourselves and give the pleasure to Allah<sup>azwj</sup> from your hearts, Allah<sup>azwj</sup> Mighty and Majestic will Reward you upon your poverty. But, if you do not do it, so there would be no Rewards for you’."}]}, {"index": 2388, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:15", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ عِيسَى الْفَرَّاءِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِذَا كَانَ يَوْمُ الْقِيَامَةِ أَمَرَ اللَّهُ تَبَارَكَ وَ تَعَالَى مُنَادِياً يُنَادِي بَيْنَ يَدَيْهِ أَيْنَ الْفُقَرَاءُ فَيَقُومُ عُنُقٌ مِنَ النَّاسِ كَثِيرٌ فَيَقُولُ عِبَادِي فَيَقُولُونَ لَبَّيْكَ رَبَّنَا فَيَقُولُ إِنِّي لَمْ أُفْقِرْكُمْ لِهَوَانٍ بِكُمْ عَلَيَّ وَ لَكِنِّي إِنَّمَا اخْتَرْتُكُمْ لِمِثْلِ هَذَا الْيَوْمِ تَصَفَّحُوا وُجُوهَ النَّاسِ فَمَنْ صَنَعَ إِلَيْكُمْ مَعْرُوفاً لَمْ يَصْنَعْهُ إِلَّا فِيَّ فَكَافُوهُ عَنِّي بِالْجَنَّةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Abu Nasr, from Isa Al Farr’a, from Muhammad Bin Muslim, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When it will be the Day of Judgement, Allah<sup>azwj</sup> Blessed and High will Command a Caller to Call out in front of Him<sup>azwj</sup>: ‘Where are the poor ones?’ So a lot of necks from the people would be rising. So He<sup>azwj</sup> would be Saying: “My<sup>azwj</sup> servants!” So they would be saying, ‘Here we are, our Lord<sup>azwj</sup>!’ So He<sup>azwj</sup> would be Saying: “I<sup>azwj</sup> did not Impoverish you all in order to Abase you, but rather, I Chose you all for the like of this Day. Browse through the faces of the people, so the ones who were good towards you, not being good except for Me<sup>azwj</sup>, so compensate them from Me<sup>azwj</sup>, with the Paradise”’."}]}, {"index": 2389, "local_index": 16, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:16", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ الْحَذَّاءِ عَنْ مُحَمَّدِ بْنِ صَغِيرٍ عَنْ جَدِّهِ شُعَيْبٍ عَنْ مُفَضَّلٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَوْ لَا إِلْحَاحُ هَذِهِ الشِّيعَةِ عَلَى اللَّهِ فِي طَلَبِ الرِّزْقِ لَنَقَلَهُمْ مِنَ الْحَالِ الَّتِي هُمْ فِيهَا إِلَى مَا هُوَ أَضْيَقُ مِنْهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibrahim Al Haza’a, from Muhammad Bin Sagheer, from his grandfather Shuayb, from Mufazzal who said, \n‘Abu Abdullah<sup>asws</sup> said: ‘Had these Shias not pleaded to Allah<sup>azwj</sup> regarding seeking of the sustenance, He<sup>azwj</sup> would have Transferred them from the state which they are in to what is more constricted than it’."}]}, {"index": 2390, "local_index": 17, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:17", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ فَضَّالٍ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ بْنِ كَثِيرٍ الْخَزَّازِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ لِي أَ مَا تَدْخُلُ السُّوقَ أَ مَا تَرَى الْفَاكِهَةَ تُبَاعُ وَ الشَّيْ‏ءَ مِمَّا تَشْتَهِيهِ فَقُلْتُ بَلَى فَقَالَ أَمَا إِنَّ لَكَ بِكُلِّ مَا تَرَاهُ فَلَا تَقْدِرُ عَلَى شِرَائِهِ حَسَنَةً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Ibn Fazzal, from Muhammad Bin Al Husayn Bin Kaseer Al Khazzaz, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘He<sup>asws</sup> said to me: ‘Would you not like to enter the market and see the fruits and the things from whatever you desire, being sold?’ So I said, ‘Yes’. So he<sup>asws</sup> said: ‘But, for you, with everything what you see and are not able upon buying it, there is a good deed’."}]}, {"index": 2391, "local_index": 18, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:18", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَلِيِّ بْنِ عَفَّانَ عَنْ مُفَضَّلِ بْنِ عُمَرَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ جَلَّ ثَنَاؤُهُ لَيَعْتَذِرُ إِلَى عَبْدِهِ الْمُؤْمِنِ الْمُحْوِجِ فِي الدُّنْيَا كَمَا يَعْتَذِرُ الْأَخُ إِلَى أَخِيهِ فَيَقُولُ وَ عِزَّتِي وَ جَلَالِي مَا أَحْوَجْتُكَ فِي الدُّنْيَا مِنْ هَوَانٍ كَانَ بِكَ عَلَيَّ فَارْفَعْ هَذَا السَّجْفَ فَانْظُرْ إِلَى مَا عَوَّضْتُكَ مِنَ الدُّنْيَا \nقَالَ فَيَرْفَعُ فَيَقُولُ مَا ضَرَّنِي مَا مَنَعْتَنِي مَعَ مَا عَوَّضْتَنِي .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Sinan, from Ali Bin Affan, from Mufazzal Bin Umar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Praise Apologises to His<sup>azwj</sup> <span class=\"iTxt\">Momin</span> servant, the one needy in the world, just as the brother apologises to his brother, so He<sup>azwj</sup> Saying: ‘By My<sup>azwj</sup> Honour and My<sup>azwj</sup> Majesty! I<sup>azwj</sup> did not Impoverish you in the world for Humiliation with you. So raise this Curtain and look at what I<sup>azwj</sup> have Compensated you from (instead of) the world”.\nHe<sup style=\"font-weight: normal\">asws</sup> said: ‘So he would raise it, and he would be saying, ‘It did not harm me what You<sup style=\"font-weight: normal\">azwj</sup> Prevented from me, with You<sup style=\"font-weight: normal\">azwj</sup> have Compensated to me’’."}]}, {"index": 2392, "local_index": 19, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:19", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا كَانَ يَوْمُ الْقِيَامَةِ قَامَ عُنُقٌ مِنَ النَّاسِ حَتَّى يَأْتُوا بَابَ الْجَنَّةِ فَيَضْرِبُوا بَابَ الْجَنَّةِ فَيُقَالُ لَهُمْ مَنْ أَنْتُمْ فَيَقُولُونَ نَحْنُ الْفُقَرَاءُ فَيُقَالُ لَهُمْ أَ قَبْلَ الْحِسَابِ فَيَقُولُونَ مَا أَعْطَيْتُمُونَا شَيْئاً تُحَاسِبُونَّا عَلَيْهِ فَيَقُولُ اللَّهُ عَزَّ وَ جَلَّ صَدَقُوا ادْخُلُوا الْجَنَّةَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Al Hakam, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When it will be the Day of Judgement, necks from the people would rise until they come over to the Door of the Paradise, so they would be knocking the Door of the Paradise. So it would be said to them: ‘Who are you all?’ So they would be saying, ‘We are the poor ones’. So it would be said to them: ‘Before the Reckoning?’ So they would be saying, ‘You<sup>azwj</sup> did not Give us anything for us to be Reckoned upon’. So Allah<sup>azwj</sup> Mighty and Majestic would be Saying: “They are speaking the truth. Enter them into the Paradise’’."}]}, {"index": 2393, "local_index": 20, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:20", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ مُبَارَكٍ غُلَامِ شُعَيْبٍ قَالَ سَمِعْتُ أَبَا الْحَسَنِ مُوسَى ( عليه السلام ) يَقُولُ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ إِنِّي لَمْ أُغْنِ الْغَنِيَّ لِكَرَامَةٍ بِهِ عَلَيَّ وَ لَمْ أُفْقِرِ الْفَقِيرَ لِهَوَانٍ بِهِ عَلَيَّ وَ هُوَ مِمَّا ابْتَلَيْتُ بِهِ الْأَغْنِيَاءَ بِالْفُقَرَاءِ وَ لَوْ لَا الْفُقَرَاءُ لَمْ يَسْتَوْجِبِ الْأَغْنِيَاءُ الْجَنَّةَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from usman Bin Isa, from Mubarak, a slave of Shuayb who said, \n‘I heard Abu Al-Hassan Musa<sup>asws</sup> saying: ‘Allah<sup>azwj</sup> Mighty and Majestic is Saying: “I<sup>azwj</sup> do not Enrich the rich in order to Honour him with it to Me<sup>azwj</sup>, and I<sup>azwj</sup> do not Impoverish the poor in order to Humiliate him with it to Me<sup>azwj</sup>, and it is from what I<sup>azwj</sup> Test the rich by the poor; and had it not been for the poor, the Paradise would not be Obligated upon the rich’."}]}, {"index": 2394, "local_index": 21, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:21", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ إِسْحَاقَ بْنِ عِيسَى عَنْ إِسْحَاقَ بْنِ عَمَّارٍ وَ الْمُفَضَّلِ بْنِ عُمَرَ قَالَا قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَيَاسِيرُ شِيعَتِنَا أُمَنَاؤُنَا عَلَى مَحَاوِيجِهِمْ فَاحْفَظُونَا فِيهِمْ يَحْفَظْكُمُ اللَّهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Is’haq Bin Isa, from Is’haq Bin Ammar and Al Mufazzal Bin Umar who both said, \n‘Abu Abdullah<sup>asws</sup> said: ‘The affluent ones of our<sup>asws</sup> Shias are our trustees upon their needy ones, therefore safeguard us<sup>asws</sup> regarding them, may Allah<sup>azwj</sup> Safeguard you all’."}]}, {"index": 2395, "local_index": 22, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:22", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) الْفَقْرُ أَزْيَنُ لِلْمُؤْمِنِ مِنَ الْعِذَارِ عَلَى خَدِّ الْفَرَسِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup> said: ‘The poverty is more of an adornment for the <span class=\"iTxt\">Momin</span> that the harness is upon the cheek of the horse’."}]}, {"index": 2396, "local_index": 23, "part_type": "Hadith", "path": "/books/al-kafi:2:1:107:23", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ غَالِبٍ عَنْ أَبِيهِ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَ سَأَلْتُ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ لَوْ لا أَنْ يَكُونَ النَّاسُ أُمَّةً واحِدَةً قَالَ عَنَى بِذَلِكَ أُمَّةَ مُحَمَّدٍ ( صلى الله عليه وآله ) أَنْ يَكُونُوا عَلَى دِينٍ وَاحِدٍ كُفَّاراً كُلَّهُمْ لَجَعَلْنا لِمَنْ يَكْفُرُ بِالرَّحْمنِ لِبُيُوتِهِمْ سُقُفاً مِنْ فِضَّةٍ وَ لَوْ فَعَلَ اللَّهُ ذَلِكَ بِأُمَّةِ مُحَمَّدٍ ( صلى الله عليه وآله ) لَحَزِنَ الْمُؤْمِنُونَ وَ غَمَّهُمْ ذَلِكَ وَ لَمْ يُنَاكِحُوهُمْ وَ لَمْ يُوَارِثُوهُمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ibn Mahboub, from Abdullah Bin Ghalib, from his father, from Saeed Bin Al Musayyab who said, \n‘I asked Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[43:33] And were it not that all people had been a single nation</span>. He<sup>asws</sup> said: ‘It Means by that the community of Muhammad<sup>saww</sup>, if they had happened to be upon one Religion, they would have been disbeliever, all of them <span class=\"ibTxt\">We would certainly have Assigned to those who disbelieve in the Beneficent (to make) of silver the roofs of their houses</span>. And had Allah<sup>azwj</sup> Done that with the community of Muhammad<sup>saww</sup>, the <span class=\"iTxt\">Momineen</span> would have grieved and that would have saddened them, and would not have married them and would not have inherited them’."}]}]}, "index": "al-kafi:2:1:107", "kind": "verse_list"}