{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 109"
        },
        "path": "/books/al-kafi:2:1:109",
        "titles": {
          "ar": "بَابُ أَنَّ لِلْقَلْبِ أُذُنَيْنِ يَنْفُثُ فِيهِمَا الْمَلَكُ وَ الشَّيْطَانُ",
          "en": "Chapter 109 – For the heart there are two ears into which blow the Angel and the Satan<sup>la</sup>"
        }
      }
    ],
    "index": 297,
    "local_index": 109,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 110"
        },
        "path": "/books/al-kafi:2:1:110",
        "titles": {
          "ar": "بَابُ الرُّوحِ الَّذِي أُيِّدَ بِهِ الْمُؤْمِنُ",
          "en": "Chapter 110 – The spirit which the Momin is Aided with"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 108"
        },
        "path": "/books/al-kafi:2:1:108",
        "titles": {
          "ar": "بَابٌ",
          "en": "Chapter 108 – A Chapter"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:109",
    "titles": {
      "ar": "بَابُ أَنَّ لِلْقَلْبِ أُذُنَيْنِ يَنْفُثُ فِيهِمَا الْمَلَكُ وَ الشَّيْطَانُ",
      "en": "Chapter 109 – For the heart there are two ears into which blow the Angel and the Satan<sup>la</sup>"
    },
    "verse_count": 3,
    "verse_start_index": 2398,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/377)"
        ],
        "index": 2399,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:109:1",
        "relations": {
          "Mentions": [
            "/books/quran:50:17",
            "/books/quran:50:18"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا مِنْ قَلْبٍ إِلَّا وَ لَهُ أُذُنَانِ عَلَى إِحْدَاهُمَا مَلَكٌ مُرْشِدٌ وَ عَلَى الْأُخْرَى شَيْطَانٌ مُفْتِنٌ هَذَا يَأْمُرُهُ وَ هَذَا يَزْجُرُهُ الشَّيْطَانُ يَأْمُرُهُ بِالْمَعَاصِي وَ الْمَلَكُ يَزْجُرُهُ عَنْهَا وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ عَنِ الْيَمِينِ وَ عَنِ الشِّمالِ قَعِيدٌ ما يَلْفِظُ مِنْ قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from his father, from Ibn Abu Umeyr, from Hammad, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There is none from heart except that there are two ears for it, upon one of the two is a guiding Angel, and upon the other is a tempting Satan<sup>la</sup>. This one instructs him and this one rebukes him. The Satan<sup>la</sup> instructs him with the disobedience and the Angel rebukes him from it, and these are the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:50#h17\">[50:17]</a> seated on the right and on the left <a href=\"/#/books/quran:50#h18\">[50:18]</a> He utters not a word but there is by him a watcher at hand</span>’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from abu ‘Abd Allah (a.s.) who has said the following: “There is no heart without two ears. On one of them there is an angel who provides guidance and on the other there is a Satan (devil) who induces temptation. This one commands him and that one prohibits him. Satan commands him to disobey and the angel prohibits him from sins as it is mentioned in the words of Allah, the Most Majestic, the Most Holy, ‘. . . since the two scribes are sitting on each of his shoulders, he does not utter a word that is not recorded immediately by the watchful scribes.’” <a href=\"/#/books/quran:50#h17\">[50:17]</a>. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/388)"
        ],
        "index": 2400,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:109:2",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ سَعْدَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ لِلْقَلْبِ أُذُنَيْنِ فَإِذَا هَمَّ الْعَبْدُ بِذَنْبٍ قَالَ لَهُ رُوحُ الْإِيمَانِ لَا تَفْعَلْ وَ قَالَ لَهُ الشَّيْطَانُ افْعَلْ وَ إِذَا كَانَ عَلَى بَطْنِهَا نُزِعَ مِنْهُ رُوحُ الْإِيمَانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Ahmad Bin Is’haq, from Sa’dan, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘For the ‘Qalub’ heart there are two ears. So when the servant thinks of sinning, the spirit of <span class=\"iTxt\">Emān</span> says, ‘Don’t do it’; but the Satan<sup>la</sup> says to him, ‘Do it’. And when he was upon its belly (about to sin), the spirit of <span class=\"iTxt\">Emān</span> is Removed from him’."
          ],
          "en.sarwar": [
            "2. Al-Husayn ibn Muhammad has narrated from Ahmad ibn Ishaq from Sa’dan from abu Basir from abu ‘Abd Allah (a.s.) who has said the following: “The heart has two ears. When a servant (of Allah) thinks to commit a sin the spirit of belief says to him, ‘Do not do it’ and Satan says, ‘Do it.’ When he is on her belly (for an indecent act) the spirit of belief is taken away from him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/390)"
        ],
        "index": 2401,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:109:3",
        "relations": {
          "Mentions": [
            "/books/quran:58:22"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبَانِ بْنِ تَغْلِبَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا مِنْ مُؤْمِنٍ إِلَّا وَ لِقَلْبِهِ أُذُنَانِ فِي جَوْفِهِ أُذُنٌ يَنْفُثُ فِيهَا الْوَسْوَاسُ الْخَنَّاسُ وَ أُذُنٌ يَنْفُثُ فِيهَا الْمَلَكُ فَيُؤَيِّدُ اللَّهُ الْمُؤْمِنَ بِالْمَلَكِ فَذَلِكَ قَوْلُهُ وَ أَيَّدَهُمْ بِرُوحٍ مِنْه .ُ"
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Sayf Bin Ameyra, from Aban Bin Taghlub, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There is none from a <span class=\"iTxt\">Momin</span> except for his heart would be two ears in its interior – an ear into which the slinking whisperer (Satan<sup>la</sup>) would blow, and an ear into which the Angel would blow. Thus Allah<sup>azwj</sup> Assists the <span class=\"iTxt\">Momin</span> with the Angel, and these are His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:58#h22\">[58:22]</a> and He has Supported them with a Spirit from Him</span>’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from Sayf ibn ‘ Amirah from Aban ibn Taghlib from abu ‘Abd Allah (a.s.) who has said the following: “There is no believer but that his heart inside him has two ears. Into one of them al-Waswas and al-Khannas (two devils) blow and in the other ear an angel blows. Allah supports the believer through the angel as He has said, ‘. . . supported them by a Spirit from Himself. . .’” <a href=\"/#/books/quran:58#h22\">[58:22]</a> "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:109",
  "kind": "verse_list"
}