{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 11"
        },
        "path": "/books/al-kafi:2:1:11",
        "titles": {
          "ar": "بَابُ الْإِخْلَاصِ",
          "en": "Chapter 11 – The sincerity"
        }
      }
    ],
    "index": 199,
    "local_index": 11,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:2:1:12",
        "titles": {
          "ar": "بَابُ الشَّرَائِعِ",
          "en": "Chapter 12 – The Laws"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 10"
        },
        "path": "/books/al-kafi:2:1:10",
        "titles": {
          "ar": "بَابٌ فِي أَنَّ السَّكِينَةَ هِيَ الْإِيمَانُ",
          "en": "Chapter 10 – Regarding the tranquility (Re 48:4) – it is the faith"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:11",
    "titles": {
      "ar": "بَابُ الْإِخْلَاصِ",
      "en": "Chapter 11 – The sincerity"
    },
    "verse_count": 6,
    "verse_start_index": 1474,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (74/ 7)"
        ],
        "index": 1475,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:11:1",
        "refs": {
          "Quran": [
            "/books/quran:3:67"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ حَنِيفاً مُسْلِماً قَالَ خَالِصاً مُخْلِصاً لَيْسَ فِيهِ شَيْ‏ءٌ مِنْ عِبَادَةِ الْأَوْثَانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Abdullah Bin Muskan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h67\">[3:67]</a> (an) upright (man), a Muslim</span>. He<sup>asws</sup> said: ‘Purely sincere, there not being in him anything from the worshipping of the idols’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from ‘Abd Allah ibn Maskan from abu ‘Abd Allah (a.s.) who has said the following: “About the words of Allah, the Majestic, the Glorious, ‘. . . humble and submitted.’ <a href=\"/#/books/quran:3#h67\">[3:67]</a>, the Imam said, ‘It (humble and submitted) is one purely sincere who has not worshipped any idols.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (75/ 7)"
        ],
        "index": 1476,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:11:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ رَفَعَهُ إِلَى أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَا أَيُّهَا النَّاسُ إِنَّمَا هُوَ اللَّهُ وَ الشَّيْطَانُ وَ الْحَقُّ وَ الْبَاطِلُ وَ الْهُدَى وَ الضَّلَالَةُ وَ الرُّشْدُ وَ الْغَيُّ وَ الْعَاجِلَةُ وَ الْآجِلَةُ وَ الْعَاقِبَةُ وَ الْحَسَنَاتُ وَ السَّيِّئَاتُ فَمَا كَانَ مِنْ حَسَنَاتٍ فَلِلَّهِ وَ مَا كَانَ مِنْ سَيِّئَاتٍ فَلِلشَّيْطَانِ لَعَنَهُ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from his father, ",
            "(It has been narrated) raising it to Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘O you people! But rather, it is Allah<sup>azwj</sup> and the Satan<sup>la</sup>, and the truth and the falsehood, and the guidance and the straying, and the right way from the error, and the present and the future and the end-result, and the good deeds and the evil deeds. So whatever was from the good deeds, so it is for Allah<sup>azwj</sup>, and whatever was from the evil deeds, so it is for the Satans<sup>la</sup> may Allah<sup>azwj</sup> Curse him<sup>la</sup>’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from his father in a Marfa* manner from abu Ja’far (a.s.) who has said the following: “The Messenger of Allah (a.s.) has said, ‘O people, what there is, is Allah and Satan, Truth and falsehood, guidance and straying, wisdom and error, present and future, the consequences, the good deeds and evil deeds. Good deeds are for Allah and evil deeds are for Satan, may Allah condemn him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (76/ 7)"
        ],
        "index": 1477,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:11:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( صلوات الله عليه )  كَانَ يَقُولُ طُوبَى لِمَنْ أَخْلَصَ لِلَّهِ الْعِبَادَةَ وَ الدُّعَاءَ وَ لَمْ يَشْغَلْ قَلْبَهُ بِمَا تَرَى عَيْنَاهُ وَ لَمْ يَنْسَ ذِكْرَ اللَّهِ بِمَا تَسْمَعُ أُذُنَاهُ وَ لَمْ يَحْزُنْ صَدْرَهُ بِمَا أُعْطِيَ غَيْرُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Asbaat, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup> that Amir Al-Momineen<sup>asws</sup> was saying: ‘Beatitude is for the one who is sincere to Allah<sup>azwj</sup> in the worship and the supplication, and does not pre-occupy his heart with what his eyes see, and the does not forget the Remembrance of Allah<sup>azwj</sup> with what his ears hear, and does not grieve his chest with what others have been Given’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Asbat from abu al-Hassan al-Rada (a.s.) who has said the following: “Amir al Mu’minin (a.s.) has said, ‘Paradise is for those who maintain sincerity in worshipping Allah and in prayer to Him. Whatever they see does not occupy their heart. Whatever they hear does not make them forget to speak of Allah and they do not feel depressed because of what is given to others.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/77)"
        ],
        "index": 1478,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:11:4",
        "refs": {
          "Quran": [
            "/books/quran:67:2",
            "/books/quran:17:84"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنِ الْمِنْقَرِيِّ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا قَالَ لَيْسَ يَعْنِي أَكْثَرَ عَمَلًا وَ لَكِنْ أَصْوَبَكُمْ عَمَلًا وَ إِنَّمَا الْإِصَابَةُ خَشْيَةُ اللَّهِ وَ النِّيَّةُ الصَّادِقَةُ وَ الْحَسَنَةُ ",
          "ثُمَّ قَالَ الْإِبْقَاءُ عَلَى الْعَمَلِ حَتَّى يَخْلُصَ أَشَدُّ مِنَ الْعَمَلِ وَ الْعَمَلُ الْخَالِصُ الَّذِي لَا تُرِيدُ أَنْ يَحْمَدَكَ عَلَيْهِ أَحَدٌ إِلَّا اللَّهُ عَزَّ وَ جَلَّ وَ النِّيَّةُ أَفْضَلُ مِنَ الْعَمَلِ أَلَا وَ إِنَّ النِّيَّةَ هِيَ الْعَمَلُ ",
          "ثُمَّ تَلَا قَوْلَهُ عَزَّ وَ جَلَّ قُلْ كُلٌّ يَعْمَلُ عَلى شاكِلَتِهِ يَعْنِي عَلَى نِيَّتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Qasim Bin Muhammad, from Al Minqary, from Sufyan Bin Uyayna, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:67#h2\">[67:2]</a> that He may Test you - which of you is best in deeds</span>. He<sup>asws</sup> said ‘It does not Mean the abundance of deeds, but the correct ones of your deeds, and rather the correctness is the fear of Allah<sup>azwj</sup> and the truthful intention, and the good deeds’.",
            "Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘The remaining upon the deed until it finishes is more difficult than performing the deed itself, and the sincere deed is that which you do not want to be praised upon by anyone except for Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic; and the intention is superior than the deed itself. Indeed! The intention, it is the deed’. ",
            "Then he<sup style=\"font-weight: normal\">asws</sup> recited the Words of the Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:17#h84\">[17:84]</a> Say: Every one acts according to his own disposition</span> – Meaning, upon his intention’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from al-Qasim ibn Muhammad from al-Minqari from Sufyan ibn ‘Uyayna from abu ‘Abd Allah (a.s.) who has said the following: “About the words of Allah, the Most Majestic, the Most Holy, ‘So that He may try you to see who among you is best in good deeds. . . .’ <a href=\"/#/books/quran:67#h2\">[67:2]</a>, the Imam said, ‘He has not meant thereby the quantity of deeds. He thereby has meant the most correct ones in deeds. Correctness comes only from overwhelming respect for Allah, true intention and goodness.’ He then said, ‘It comes from continuity of the good deeds. In fact, maintaining continuity until deeds reach purity is more difficult than performing the deed itself. It is the intention that forms the deed.’ The Imam then recited the words of Allah, the Most Majestic, the Most Holy, ‘Say (O Muhammad), “Everyone acts according to his way,” <a href=\"/#/books/quran:17#h84\">[17:84]</a> it (way) means according to his intentions.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (86/ 7)"
        ],
        "index": 1479,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:11:5",
        "refs": {
          "Quran": [
            "/books/quran:26:89"
          ]
        },
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِلَّا مَنْ أَتَى اللَّهَ بِقَلْبٍ سَلِيمٍ قَالَ الْقَلْبُ السَّلِيمُ الَّذِي يَلْقَى رَبَّهُ وَ لَيْسَ فِيهِ أَحَدٌ سِوَاهُ قَالَ وَ كُلُّ قَلْبٍ فِيهِ شِرْكٌ أَوْ شَكٌّ فَهُوَ سَاقِطٌ وَ إِنَّمَا أَرَادُوا الزُّهْدَ فِي الدُّنْيَا لِتَفْرُغَ قُلُوبُهُمْ لِلْآخِرَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, he said, ",
            "‘I asked him<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:26#h89\">[26:89]</a> Except one who comes to Allah with a secure heart</span>. He<sup>asws</sup> said: ‘The secure heart is that which is attached to its Lord<sup>azwj</sup>, and there is no one in it besides Him<sup>azwj</sup>; and every heart wherein is an association, or a doubt, so it is fallen, and rather they are intending the ascetism in the world in order to free their hearts for the Hereafter’."
          ],
          "en.sarwar": [
            "5. It is reported through the same chain of narrators that he said: “Once I asked abu ‘Abd Allah (a.s.) about the words of Allah, the Most Majestic, the Most Holy, ‘Except those who would come to Allah with safe and protected hearts. . . .’ <a href=\"/#/books/quran:26#h89\">[26:89]</a> The Imam said, ‘A safe and protected heart is such a heart that goes in the presence of his Lord while there is nothing in it besides his Lord. He then said that every heart in which there is polytheism or doubt, such a heart is a failing heart. They (pious people) have chosen to restrict themselves from worldly matters so that their hearts are reserved for the matters of the life hereafter only.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/87)"
        ],
        "index": 1480,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:11:6",
        "refs": {
          "Quran": [
            "/books/quran:7:152",
            "/books/quran:7:157"
          ]
        },
        "text": [
          "بِهَذَا الْإِسْنَادِ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ عَنِ السِّنْدِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ مَا أَخْلَصَ الْعَبْدُ الْإِيمَانَ بِاللَّهِ عَزَّ وَ جَلَّ أَرْبَعِينَ يَوْماً أَوْ قَالَ مَا أَجْمَلَ عَبْدٌ ذِكْرَ اللَّهِ عَزَّ وَ جَلَّ أَرْبَعِينَ يَوْماً إِلَّا زَهَّدَهُ اللَّهُ عَزَّ وَ جَلَّ فِي الدُّنْيَا وَ بَصَّرَهُ دَاءَهَا وَ دَوَاءَهَا فَأَثْبَتَ الْحِكْمَةَ فِي قَلْبِهِ وَ أَنْطَقَ بِهَا لِسَانَهُ ",
          "ثُمَّ تَلَا إِنَّ الَّذِينَ اتَّخَذُوا الْعِجْلَ سَيَنالُهُمْ غَضَبٌ مِنْ رَبِّهِمْ وَ ذِلَّةٌ فِي الْحَياةِ الدُّنْيا وَ كَذلِكَ نَجْزِي الْمُفْتَرِينَ فَلَا تَرَى صَاحِبَ بِدْعَةٍ إِلَّا ذَلِيلًا وَ مُفْتَرِياً عَلَى اللَّهِ عَزَّ وَ جَلَّ وَ عَلَى رَسُولِهِ ( صلى الله عليه وآله ) وَ عَلَى أَهْلِ بَيْتِهِ ( صلوات الله عليهم ) إِلَّا ذَلِيلًا ."
        ],
        "translations": {
          "en.hubeali": [
            "By this chain, from Sufyan Bin Uyayna, from Al Sindy, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘If a servant maintains pure <span class=\"iTxt\">Em</span><span style=\"font-style: italic; text-decoration: underline\">ā</span><span class=\"iTxt\">n</span> (belief) in Allah<sup>azwj</sup> for forty days, Allah<sup>azwj</sup> Purifies his heart in this world and Shows him his illness and the cure for them (illness). ",
            "Then he<sup>asws</sup> recited <span class=\"ibTxt\"><a href=\"/#/books/quran:7#h152\">[7:152]</a> (As for) those who took the calf (for a god), surely Wrath from their Lord and disgrace in this world's life shall Seize them, and thus do We Recompense the devisers of lies</span>. So you will not see the owner of the innovation (the innovator) except as disgraced and the forger of lies upon Allah<sup>azwj</sup> Mighty and Majestic, and upon His<sup>azwj</sup> Rasool<sup>saww</sup>, and upon the people<sup>asws</sup> of his<sup>saww</sup> Household, except as disgraced’."
          ],
          "en.sarwar": [
            "6. It is reported through the same chain of narrators from Sufyan ibn ‘Uyayna from al-Sindy from abu Ja’far (a.s.) who has said the following: “Abu Ja’far (a.s.) has said, ‘If a servant maintains pure belief in Allah, the Most Majestic, the Most Holy, for forty days, Allah, the Most Majestic, the Most Holy, purifies his heart in this world and shows him his illnesses and the cure for them (illnesses).’ Also he (a.s.) said, ‘Whenever a servant of Allah speaks of Him in a beautiful way for forty days Allah, the Most Majestic, the Most Holy, purifies his heart in this world and shows him his illnesses and the cure for such illnesses. He then establishes wisdom in his heart and will make his tongue to speak wisdom. ’ The Imam then recited this verse of the Holy Quran, ‘Those who took the calf as their Lord will face anger and humiliation from their Lord in the worldly life and thus, We recompense those who forge lies.’ <a href=\"/#/books/quran:7#h157\">[7:157]</a> “The Imam said, ‘You should note that all those who forge lies are but despicable persons. So also is one who forges lies against Allah, the Most Majestic, the Most Holy, His messenger and his A hi al-Bayt, recipients of divine supreme covenant. Such person is nothing but a despicable one.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:11",
  "kind": "verse_list"
}