{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:2:1", "titles": {"ar": "كتاب الإيمان و الكفر", "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"}}, {"indexed_titles": {"en": "Chapter 110"}, "path": "/books/al-kafi:2:1:110", "titles": {"ar": "بَابُ الرُّوحِ الَّذِي أُيِّدَ بِهِ الْمُؤْمِنُ", "en": "Chapter 110 – The spirit which the Momin is Aided with"}}], "index": 298, "local_index": 110, "part_type": "Chapter", "path": "/books/al-kafi:2:1:110", "titles": {"ar": "بَابُ الرُّوحِ الَّذِي أُيِّدَ بِهِ الْمُؤْمِنُ", "en": "Chapter 110 – The spirit which the Momin is Aided with"}, "verse_count": 1, "verse_start_index": 2401, "verses": [{"index": 2402, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:1:110:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> وَ مُحَمَّدُ بْنُ يَحْيَى جَمِيعاً عَنْ عَلِيِّ بْنِ مُحَمَّدِ بْنِ سَعْدٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي سَلَمَةَ عَنْ مُحَمَّدِ بْنِ سَعِيدِ بْنِ غَزْوَانَ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ أَبِي خَدِيجَةَ قَالَ دَخَلْتُ عَلَى أَبِي الْحَسَنِ ( عليه السلام ) فَقَالَ لِي إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى أَيَّدَ الْمُؤْمِنَ بِرُوحٍ مِنْهُ تَحْضُرُهُ فِي كُلِّ وَقْتٍ يُحْسِنُ فِيهِ وَ يَتَّقِي وَ تَغِيبُ عَنْهُ فِي كُلِّ وَقْتٍ يُذْنِبُ فِيهِ وَ يَعْتَدِي فَهِيَ مَعَهُ تَهْتَزُّ سُرُوراً عِنْدَ إِحْسَانِهِ وَ تَسِيخُ فِي الثَّرَى عِنْدَ إِسَاءَتِهِ\nفَتَعَاهَدُوا عِبَادَ اللَّهِ نِعَمَهُ بِإِصْلَاحِكُمْ أَنْفُسَكُمْ تَزْدَادُوا يَقِيناً وَ تَرْبَحُوا نَفِيساً ثَمِيناً رَحِمَ اللَّهُ امْرَأً هَمَّ بِخَيْرٍ فَعَمِلَهُ أَوْ هَمَّ بِشَرٍّ فَارْتَدَعَ عَنْهُ \nثُمَّ قَالَ نَحْنُ نُؤَيِّدُ الرُّوحَ بِالطَّاعَةِ لِلَّهِ وَ الْعَمَلِ لَهُ.", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, and Muhammad Bin Yahya, altogether from Ali Bin Muhammad Bin Sa’ad, from Muhammad Bin Muslim, from Abu Salma, from Muhammad Bin Saeed Bin Gazwan, from Ibn Abu Najran, from Muhammad Bin Sinan, from Abu Khadeeja who said, \n‘I went over to Abu Al-Hassan<sup>asws</sup>, and he<sup>asws</sup> said to me: ‘Allah<sup>azwj</sup> Blessed and High Aids the <span class=\"iTxt\">Momin</span> with a spirit from Him<sup>azwj</sup>, cautioning him during every time he does a good deed in it, and it is absent from him during every time he sins in it and transgresses. So it is with him, vibrating joyfully during his good deeds and falling into the earth during his sinning. \nTherefore, make a pact for His<sup style=\"font-weight: normal\">azwj</sup> Blessings, servants of Allah<sup style=\"font-weight: normal\">azwj</sup>, by correcting yourselves, you will be increasing your conviction and you will be profiting by a good price. May Allah<sup style=\"font-weight: normal\">azwj</sup> have Mercy upon a man who thinks of doing good, so he does it, or thinks of doing evil, but retracts from it’. \nThen said: We<sup style=\"font-weight: normal\">asws</sup> assist the spirit by the obedience to Allah<sup style=\"font-weight: normal\">azwj</sup> and working for Him<sup style=\"font-weight: normal\">azwj</sup>’."}]}]}, "index": "al-kafi:2:1:110", "kind": "verse_list"}