{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 122"
        },
        "path": "/books/al-kafi:2:1:122",
        "titles": {
          "ar": "بَابُ الْحَسَدِ",
          "en": "Chapter 122 – The Envy"
        }
      }
    ],
    "index": 310,
    "local_index": 122,
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:122",
    "titles": {
      "ar": "بَابُ الْحَسَدِ",
      "en": "Chapter 122 – The Envy"
    },
    "verse_count": 7,
    "verse_start_index": 2536,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/157)"
        ],
        "index": 2537,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:122:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) إِنَّ الرَّجُلَ لَيَأْتِي بِأَيِّ بَادِرَةٍ فَيَكْفُرُ وَ إِنَّ الْحَسَدَ لَيَأْكُلُ الْإِيمَانَ كَمَا تَأْكُلُ النَّارُ الْحَطَبَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘The man comes to a sin hastily so he (gradually) disbelieves, but the envy consumes the <span class=\"iTxt\">Emān</span> (so fast) just as the fire consumes the firewood’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from al-‘Ala’ ibn Razin from Muhammad ibn Muslim who has said the following: “Abu Ja’far (a.s.) has said, ‘The man may hastily commit any evil deed and then (gradually) turn in disbelief, however, envy consumes belief (immediately) just as fire consumes firewood.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/163)"
        ],
        "index": 2538,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:122:2",
        "text": [
          "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ وَ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنِ الْقَاسِمِ بْنِ سُلَيْمَانَ عَنْ جَرَّاحٍ الْمَدَائِنِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْحَسَدَ يَأْكُلُ الْإِيمَانَ كَمَا تَأْكُلُ النَّارُ الْحَطَبَ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ahmad Bin Muhammad, from Muhammad Bin Khalid and Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Al Qasim Bin Suleyman, from Jarrah al Madainy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The envy consumes the <span class=\"iTxt\">Emān</span> just as the fire consumes the firewood’."
          ],
          "en.sarwar": [
            "2. It is narrated from him (narrator of the Hadith above) from Ahmad ibn Muhammad from Muhammad ibn Khalid and al-Husayn ibn Sa’id from al-Nadr ibn Suwayd from al-Qasim ibn Sulayman from Jarrah al-Mada’ini from abu ‘Abd Allah (a.s.) who has said the following: “Envy consumes belief just as fire consumes firewood.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه وصحته أقو ى  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/163)"
        ],
        "index": 2539,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:122:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ دَاوُدَ الرَّقِّيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ اتَّقُوا اللَّهَ وَ لَا يَحْسُدْ بَعْضُكُمْ بَعْضاً إِنَّ عِيسَى ابْنَ مَرْيَمَ كَانَ مِنْ شَرَائِعِهِ السَّيْحُ فِي الْبِلَادِ فَخَرَجَ فِي بَعْضِ سَيْحِهِ وَ مَعَهُ رَجُلٌ مِنْ أَصْحَابِهِ قَصِيرٌ وَ كَانَ كَثِيرَ اللُّزُومِ لِعِيسَى ( عليه السلام )",
          "فَلَمَّا انْتَهَى عِيسَى إِلَى الْبَحْرِ قَالَ بِسْمِ اللَّهِ بِصِحَّةِ يَقِينٍ مِنْهُ فَمَشَى عَلَى ظَهْرِ الْمَاءِ فَقَالَ الرَّجُلُ الْقَصِيرُ حِينَ نَظَرَ إِلَى عِيسَى ( عليه السلام ) جَازَهُ بِسْمِ اللَّهِ بِصِحَّةِ يَقِينٍ مِنْهُ فَمَشَى عَلَى الْمَاءِ وَ لَحِقَ بِعِيسَى ( عليه السلام ) فَدَخَلَهُ الْعُجْبُ بِنَفْسِهِ فَقَالَ هَذَا عِيسَى رُوحُ اللَّهِ يَمْشِي عَلَى الْمَاءِ وَ أَنَا أَمْشِي عَلَى الْمَاءِ فَمَا فَضْلُهُ عَلَيَّ ",
          "قَالَ فَرُمِسَ فِي الْمَاءِ فَاسْتَغَاثَ بِعِيسَى فَتَنَاوَلَهُ مِنَ الْمَاءِ فَأَخْرَجَهُ ثُمَّ قَالَ لَهُ مَا قُلْتَ يَا قَصِيرُ قَالَ قُلْتُ هَذَا رُوحُ اللَّهِ يَمْشِي عَلَى الْمَاءِ وَ أَنَا أَمْشِي عَلَى الْمَاءِ فَدَخَلَنِي مِنْ ذَلِكَ عُجْبٌ فَقَالَ لَهُ عِيسَى لَقَدْ وَضَعْتَ نَفْسَكَ فِي غَيْرِ الْمَوْضِعِ الَّذِي وَضَعَكَ اللَّهُ فِيهِ فَمَقَتَكَ اللَّهُ عَلَى مَا قُلْتَ فَتُبْ إِلَى اللَّهِ عَزَّ وَ جَلَّ مِمَّا قُلْتَ ",
          "قَالَ فَتَابَ الرَّجُلُ وَ عَادَ إِلَى مَرْتَبَتِهِ الَّتِي وَضَعَهُ اللَّهُ فِيهَا فَاتَّقُوا اللَّهَ وَ لَا يَحْسُدَنَّ بَعْضُكُمْ بَعْضاً ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ibn Mahboub, from Dawood Al Raqqy who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Fear Allah<sup>azwj</sup> and some of you should not envy the others. From the Laws of Isa<sup>as</sup> Bin Maryam<sup>as</sup> was the travelling about in the city. So he<sup>as</sup> went out in one of his tours and with him<sup>as</sup> was a man from his<sup>as</sup> companions of a short stature, and he used to frequently accompany Isa<sup>as</sup>. ",
            "So when Isa<sup>as</sup> ended up to the sea, he<sup>as</sup> said: ‘In the Name of Allah<sup>azwj</sup>’, with correct certainty from him<sup>as</sup>, and he<sup>as</sup> walked upon the back of the surface of the water. So the short man said when he looked at Isa<sup>as</sup> risking it, ‘In the Name of Allah<sup>azwj</sup>’ with correct certainty from him. So he walked upon the water and caught up with Isa<sup>as</sup>. Then self-conceitedness entered into himself, so he said (to himself), ‘This is Isa<sup>as</sup>, the Spirit of Allah<sup>azwj</sup>, walking upon the water and I am walking upon the water. So what is his<sup>as</sup> merit over me?’ ",
            "He<sup style=\"font-weight: normal\">asws</sup> said: ‘So he sunk into the water, and he cried for help to Isa<sup style=\"font-weight: normal\">as</sup>. So he<sup style=\"font-weight: normal\">as</sup> grabbed him from the water and extracted him, then said to him: ‘What did you say, O Shortie!?’ He said, ‘I said, ‘This is Isa<sup style=\"font-weight: normal\">as</sup>, Spirit of Allah<sup style=\"font-weight: normal\">azwj</sup>, walking upon the water, and I am walking upon the water’, and the self-conceitedness entered me due to that’. So Isa<sup style=\"font-weight: normal\">as</sup> said to him: ‘You had placed yourself in other than the place which Allah<sup style=\"font-weight: normal\">azwj</sup> had Placed you in, therefore Allah<sup style=\"font-weight: normal\">azwj</sup> Detested you upon what you said. So repent to Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic from what you said’. ",
            "He<sup style=\"font-weight: normal\">asws</sup> said: ‘So the man repented and returned to his status which Allah<sup style=\"font-weight: normal\">azwj</sup> had Placed him in. Therefore, fear Allah<sup style=\"font-weight: normal\">azwj</sup> and you should not envy each other’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ibn Mahbub from Dawud al-Riqqi who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘Be pious before Allah and do not envy each other. It was in the Shari’a of Jesus to travel in the land. During one of his journeys one of his companions, who was of short height, accompanied him very often. When they reached the sea, Jesus with correct certainty said, ‘(I begin) in the name of Allah,’ and began to walk over the water. The short man, looking at Jesus walking over the water, also with correct certainty said, ‘(I begin) in the name of Allah’, walked over the water and reached Jesus. At such time he felt proud of himself and said, ‘This is Jesus, the Spirit of Allah who walks over the water, and I also walk over the water. Why then should he be more excellent than me?’ The Imam said, ‘He then sunk in the water and cried for help from Jesus, who took him out of water and asked, ‘What did you say, O short man?’ He replied, ‘This is Jesus, the Spirit of Allah who walks over the water and I also walk over the water, and I sensed pride inside.’ Jesus said to him, ‘You placed yourself in a place where Allah had not placed it. Allah resented what you said. Repent and return to Allah, the Most Majestic, the Most Holy, because of what you have said.’ The man repented and returned to his position that Allah had given him. Be pious before Allah and no one of you must envy the others.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/165)"
        ],
        "index": 2540,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:122:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كَادَ الْفَقْرُ أَنْ يَكُونَ كُفْراً وَ كَادَ الْحَسَدُ أَنْ يَغْلِبَ الْقَدَرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that ‘Rasool-Allah<sup>saww</sup> said: ‘The poverty can almost cause one to be a disbeliever, and the envy may almost overcome (disable) the power of an envying person’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from al-Nawfali from al-Sakuni from abu ‘Abd Allah (a.s.) who has said the following: ‘‘The Messenger of Allah has said, ‘Poverty can almost be disbelief, and envy may almost overcome (disable) the power of an envying person.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/171)"
        ],
        "index": 2541,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:122:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) آفَةُ الدِّينِ الْحَسَدُ وَ الْعُجْبُ وَ الْفَخْرُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin isa, from Yunus, from Muawiya Bin Wahab who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The disaster for the Religion is the envy, and the self-conceitedness, and the pride’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from Mu’awiyah ibn Wahab who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘Among the tragedies for religion is envy, feeling self- important and proud.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه صحيح عندي   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/172)"
        ],
        "index": 2542,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:122:6",
        "text": [
          "يُونُسُ عَنْ دَاوُدَ الرَّقِّيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَالَ اللَّهُ عَزَّ وَ جَلَّ لِمُوسَى بْنِ عِمْرَانَ ( عليه السلام ) يَا ابْنَ عِمْرَانَ لَا تَحْسُدَنَّ النَّاسَ عَلَى مَا آتَيْتُهُمْ مِنْ فَضْلِي وَ لَا تَمُدَّنَّ عَيْنَيْكَ إِلَى ذَلِكَ وَ لَا تُتْبِعْهُ نَفْسَكَ فَإِنَّ الْحَاسِدَ سَاخِطٌ لِنِعَمِي صَادٌّ لِقَسْمِيَ الَّذِي قَسَمْتُ بَيْنَ عِبَادِي وَ مَنْ يَكُ كَذَلِكَ فَلَسْتُ مِنْهُ وَ لَيْسَ مِنِّي ."
        ],
        "translations": {
          "en.hubeali": [
            "Yunus, from Dawood Al Raqqy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Said to Musa<sup>as</sup> Bin Imran<sup>as</sup>: “O son<sup>as</sup> of Imran<sup>as</sup>! Neither should you envy the people upon what I<sup>azwj</sup> have Given them from My<sup>azwj</sup> Grace, nor should you<sup>as</sup> extend your<sup>as</sup> eyes towards that, and do not follow it yourself<sup>as</sup>, for the envying one gets angered at My<sup>azwj</sup> Bounties, blocks My<sup>azwj</sup> Apportionment which I<sup>azwj</sup> have Apportioned between My<sup>azwj</sup> servant. And the one who is such as that, so I<sup>azwj</sup> am not from him and he is not from Me<sup>azwj</sup>”’."
          ],
          "en.sarwar": [
            "6. Yunus has narrated from Dawud al-Riqqi from abu ‘Abd Allah (a.s.) who has said the following: “The Messenger of Allah has said, ‘Allah, the Most Majestic, the Most Holy, said to Moses, “O son of ‘Imran, do not envy people for what I have given them of My favors, do not focus your eyes on it (what I have given to people), and do not allow your soul to follow it; an envious person is angry with My bounties, and blocks My distribution (favors) among My servants. Whoever is as such, I am not for him, and he is not from Me.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/172)"
        ],
        "index": 2543,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:122:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنِ الْمِنْقَرِيِّ عَنِ الْفُضَيْلِ بْنِ عِيَاضٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْمُؤْمِنَ يَغْبِطُ وَ لَا يَحْسُدُ وَ الْمُنَافِقُ يَحْسُدُ وَ لَا يَغْبِطُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Qasim Bin Muhammad, from Al Minqary, from Al Fuzayl Bin Ayaaz, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A <span class=\"iTxt\">Momin</span> backbites but does not envy, and the hypocrite envies and does not backbite’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from al-Qasim ibn Muhammad from al-Minqari from al-Fudayl ibn ‘Iyad from abu ‘Abd Allah (a.s.) who has said the following: “A believer asks Allah for help but does not envy, and a hypocrite envies, but does not ask Allah for help.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:122",
  "kind": "verse_list"
}