{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 124"
        },
        "path": "/books/al-kafi:2:1:124",
        "titles": {
          "ar": "بَابُ الْكِبْرِ",
          "en": "Chapter 124 – The Arrogance"
        }
      }
    ],
    "index": 312,
    "local_index": 124,
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:124",
    "titles": {
      "ar": "بَابُ الْكِبْرِ",
      "en": "Chapter 124 – The Arrogance"
    },
    "verse_count": 17,
    "verse_start_index": 2550,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/182)"
        ],
        "index": 2551,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:124:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ أَبَانٍ عَنْ حُكَيْمٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ أَدْنَى الْإِلْحَادِ فَقَالَ إِنَّ الْكِبْرَ أَدْنَاهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Aban, from Hukeym who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the least of atheism (disbelief). So he<sup>asws</sup> said: ‘The arrogance is the lowest of it’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from Aban from Hakim who has said the following: “Once I asked abu ‘Abd Allah (a.s.) about a minimum degree of atheism and the Imam said, ‘Arrogance is its minimum.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/202)"
        ],
        "index": 2552,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:124:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْحُسَيْنِ بْنِ أَبِي الْعَلَاءِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ الْكِبْرُ قَدْ يَكُونُ فِي شِرَارِ النَّاسِ مِنْ كُلِّ جِنْسٍ وَ الْكِبْرُ رِدَاءُ اللَّهِ فَمَنْ نَازَعَ اللَّهَ عَزَّ وَ جَلَّ رِدَاءَهُ لَمْ يَزِدْهُ اللَّهُ إِلَّا سَفَالًا ",
          "إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) مَرَّ فِي بَعْضِ طُرُقِ الْمَدِينَةِ وَ سَوْدَاءُ تَلْقُطُ السِّرْقِينَ فَقِيلَ لَهَا تَنَحَّيْ عَنْ طَرِيقِ رَسُولِ اللَّهِ فَقَالَتْ إِنَّ الطَّرِيقَ لَمُعْرَضٌ فَهَمَّ بِهَا بَعْضُ الْقَوْمِ أَنْ يَتَنَاوَلَهَا فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) دَعُوهَا فَإِنَّهَا جَبَّارَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Al Husayn Bin Abu Al A’ala, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘The arrogance has happened to be in the evil people from every race, and the Pride is a Gown of Allah<sup>azwj</sup>. So whoever disputes with Allah<sup>azwj</sup> Mighty and Majestic about His<sup>azwj</sup> Gown, Allah<sup>azwj</sup> would not Increase him in except for the lowliness. ",
            "Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> passed by one of the streets of Al-Medina and a black lady was scooping up the manure. So it was said to her, ‘Move aside from the way of Rasool-Allah<sup style=\"font-weight: normal\">saww</sup>!’ So she said, ‘The road is open (wide enough)’. So, some of the people thought of grabbing her (and pushing her aside). So Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> said: ‘Leave her, for she is tyrannial’ (bully)."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from al-Husayn ibn abu al-‘Ala’ who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘Arrogance can be found in mischievous people of all sexes. Pride is the gown of Allah. Therefore, whoever disputes Allah, the Majestic, the Glorious, about His gown; it will only bring him low. Once, the Messenger of Allah was passing through one of the streets of Madina. On the way there was a black lady collecting manure (to fuel fire). She was told to move to the side to clear the way for the Messenger of Allah. She said, ‘The road is wide.’ Certain individuals wanted to push her aside but the Messenger of Allah said, ‘Leave her alone, she is a bully.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/205)"
        ],
        "index": 2553,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:124:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنِ الْعَلَاءِ بْنِ الْفُضَيْلِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) الْعِزُّ رِدَاءُ اللَّهِ وَ الْكِبْرُ إِزَارُهُ فَمَنْ تَنَاوَلَ شَيْئاً مِنْهُ أَكَبَّهُ اللَّهُ فِي جَهَنَّمَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Usman Bin Isa, from Al A’ala Bin Al Fuzayl, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Abu Ja’far<sup>asws</sup> said: ‘The Honour is a Gown of Allah<sup>azwj</sup>, and the Pride is His<sup>azwj</sup> Garment. So whoever holds onto any of these, Allah<sup>azwj</sup> would Fling him into Hell’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from ‘Uthman ibn ‘Isa from al-‘Ala’ ibn al-Fudayl from abu ‘Abd Allah (a.s.) who has said the following: “Abu Ja’far (a.s.) has said, ‘Majesty is the gown of Allah and pride is His loin clothe, therefore, whoever holds to any of these, Allah will throw him in hell.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/206)"
        ],
        "index": 2554,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:124:4",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ فَضَّالٍ عَنْ ثَعْلَبَةَ عَنْ مَعْمَرِ بْنِ عُمَرَ بْنِ عَطَاءٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ الْكِبْرُ رِدَاءُ اللَّهِ وَ الْمُتَكَبِّرُ يُنَازِعُ اللَّهَ رِدَاءَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Ibn Fazzal, from Sa’alba, from Mo’mar Bin Umar Bin Ata’a, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The Pride is a Gown of Allah<sup>azwj</sup> and the arrogant one disputes Allah<sup>azwj</sup> about His<sup>azwj</sup> Gown’."
          ],
          "en.sarwar": [
            "4. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from ibn Faddal from Tha’labah from Mu’ammar ibn ‘Umar ibn ‘Ata’ from abu Ja’far (a.s.) who has said the following: “Pride is the gown of Allah. An arrogant person (assuming arrogance) disputes Allah about His gown.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/207)"
        ],
        "index": 2555,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:124:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ أَبِي جَمِيلَةَ عَنْ لَيْثٍ الْمُرَادِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْكِبْرُ رِدَاءُ اللَّهِ فَمَنْ نَازَعَ اللَّهَ شَيْئاً مِنْ ذَلِكَ أَكَبَّهُ اللَّهُ فِي النَّارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Ali, from Abu Jameela, from Lays Al Murady, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Pride is a Gown of Allah<sup>azwj</sup>. So the one who disputes Allah<sup>azwj</sup> regarding anything from that, Allah<sup>azwj</sup> would Fling him into the Fire’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Muhammad ibn Ali from abu Jamilah from Lath al-Muradi from abu ‘Abd Allah (a.s.) who has said the following: “Pride is the gown of Allah and whoever disputes Allah in anything about it, Allah will throw him into the fire.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/207)"
        ],
        "index": 2556,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:124:6",
        "text": [
          "عَنْهُ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ عُرْوَةَ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَا لَا يَدْخُلُ الْجَنَّةَ مَنْ فِي قَلْبِهِ مِثْقَالُ ذَرَّةٍ مِنْ كِبْرٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from his father, from Al Qasim Bin Urwa, from Abdullah Bin Bukeyr, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup> both having said: ‘He would not enter the Paradise, the one in whose heart is particle’s weight of arrogance’."
          ],
          "en.sarwar": [
            "6. It is narrated from him (narrator of the Hadith above) from his father from al- Qasim ibn ‘Urwah from ‘Abd Allah ibn Bukayr from Zurara from abu Ja’far and abu ‘Abd Allah (a.s.) who have said the following: “Whoever in his heart may have an amount of arrogance of the size of an atom he will not be able to enter paradise.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/208)"
        ],
        "index": 2557,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:124:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ أَبِي أَيُّوبَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ لَا يَدْخُلُ الْجَنَّةَ مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ خَرْدَلٍ مِنَ الْكِبْرِ قَالَ فَاسْتَرْجَعْتُ فَقَالَ مَا لَكَ تَسْتَرْجِعُ قُلْتُ لِمَا سَمِعْتُ مِنْكَ فَقَالَ لَيْسَ حَيْثُ تَذْهَبُ إِنَّمَا أَعْنِي الْجُحُودَ إِنَّمَا هُوَ الْجُحُودُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Abu Ayoub, from Muhammad Bin Muslim, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) having said: ‘He would not enter the Paradise, the one in whose heart there was the weight of a mustard seed from the arrogance’. He (the narrator) said, ‘So I said, ‘We are from Allah<sup>azwj</sup> and to Him<sup>azwj</sup> we are returning’. So he<sup>asws</sup> said: ‘What is the matter with you saying ‘We are from Allah<sup>azwj</sup> and to Him<sup>azwj</sup> we are returning’?’ I said, ‘Due to what I heard from you<sup>asws</sup>’. So he<sup>asws</sup> said: ‘It is not where you are going (understanding it). But rather, I<sup>asws</sup> mean the rejection (of <span class=\"iTxt\">Wilayah</span>). But rather it (arrogance) is the rejection (of <span class=\"iTxt\">Wilayah</span>)’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from abu Ayyub from Muhammad ibn Muslim from one of them (two Imam) who has said the following: “Whoever has an amount of arrogance in his heart of the size of a mustard seed, he will not be able to enter paradise.” 1 then expressed astonishment saying, ‘To Allah we belong and to Him we return!’ The Imam asked, ‘What has made you astonish?’ I said, ‘I have not heard such Hadith from you.’ The Imam said, ‘It is not the way you have thought. I meant thereby denial and rejection; it (arrogance) is rejection.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالحسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/209)"
        ],
        "index": 2558,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:124:8",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ أَيُّوبَ بْنِ الْحُرِّ عَنْ عَبْدِ الْأَعْلَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْكِبْرُ أَنْ تَغْمِصَ النَّاسَ وَ تَسْفَهَ الْحَقَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Ibn Fazzal, from Ali Bin Uqba, from Ayoub Bin Al Hurr, from Abdul A’ala, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The arrogance is that you belittle the people and consider the Truth as foolish’."
          ],
          "en.sarwar": [
            "8. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from ibn Faddal from Ali ibn ‘Uqbah from Ayyub ibn al-Hurr from ‘Abd al-‘Ala’ from abu ‘Abd Allah (a.s.) who has said the following: “Arrogance is when one belittles the people and calls the truth foolishness.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالحسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/209)"
        ],
        "index": 2559,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:124:9",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ عَبْدِ الْأَعْلَى بْنِ أَعْيَنَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ أَعْظَمَ الْكِبْرِ غَمْصُ الْخَلْقِ وَ سَفَهُ الْحَقِّ قَالَ قُلْتُ وَ مَا غَمْصُ الْخَلْقِ وَ سَفَهُ الْحَقِّ قَالَ يَجْهَلُ الْحَقَّ وَ يَطْعُنُ عَلَى أَهْلِهِ فَمَنْ فَعَلَ ذَلِكَ فَقَدْ نَازَعَ اللَّهَ عَزَّ وَ جَلَّ رِدَاءَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Sayf Bin Ameyra, from Abdul Al’ala Bin Ayn who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘The greatest of the arrogance is belittling the people and considering the Truth as foolish’. I said, ‘And what (constitutes) belittling the people and considering the Truth as foolish?’ He<sup>asws</sup> said, ‘Ignoring the Truth and maligning upon its people. So the one who does that, so he has snatched from Allah<sup>azwj</sup> Mighty and Majestic, His<sup>azwj</sup> Gown (of Pride)’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from Sayf ibn ‘Amirah from ‘Abd al-‘Ala’ ibn ‘A’Yun who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘The Messenger of Allah has said, “The biggest form of arrogance is to sink (belittle or look down upon) people and consider the truth foolishness.” I (the narrator) then asked, ‘What is to ‘sink’ the people and hoodwink the truth?’ The Imam said, ‘It is ignoring the truth and criticizing the people of truth. Whoever does it has disputed Allah, the Majestic, the Glorious, about His gown.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن موثق كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/210)"
        ],
        "index": 2560,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:124:10",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ بُكَيْرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ فِي جَهَنَّمَ لَوَادِياً لِلْمُتَكَبِّرِينَ يُقَالُ لَهُ سَقَرُ شَكَا إِلَى اللَّهِ عَزَّ وَ جَلَّ شِدَّةَ حَرِّهِ وَ سَأَلَهُ أَنْ يَأْذَنَ لَهُ أَنْ يَتَنَفَّسَ فَتَنَفَّسَ فَأَحْرَقَ جَهَنَّمَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibn Bukeyr, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘In Hell there is a valley for the arrogant ones called Saqar. It complained to Allah<sup>azwj</sup> Mighty and Majestic of the intensity of its own heat, and asked Him<sup>azwj</sup> that He<sup>azwj</sup> Permits for it to breathe. So it exhaled and it burnt down the Hell’."
          ],
          "en.sarwar": [
            "10. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ibn Bukayr from abu ‘Abd Allah (a.s.) who has said the following: ‘‘In hell there is a valley for the arrogant people and it is called ‘Saqar’. It complained to Allah of excessive heat and asked Him to allow it to breathe. When it took a breath, it burnt (all of) hell.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/211)"
        ],
        "index": 2561,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:124:11",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ دَاوُدَ بْنِ فَرْقَدٍ عَنْ أَخِيهِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ الْمُتَكَبِّرِينَ يُجْعَلُونَ فِي صُوَرِ الذَّرِّ يَتَوَطَّأُهُمُ النَّاسُ حَتَّى يَفْرُغَ اللَّهُ مِنَ الْحِسَابِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Sinan, from Dawood Bin Farqad, from his brother who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The arrogant ones would be Made to be in the image of the particles. The people would be trampling upon them until Allah<sup>azwj</sup> is Free from the Reckoning’."
          ],
          "en.sarwar": [
            "11. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from Dawud ibn Farqad from his brother who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘The arrogant people will be turned into particles on whom people will walk until Allah will finalize (people’s) accounts.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل كالحسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/212)"
        ],
        "index": 2562,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:124:12",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ غَيْرِ وَاحِدٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ عَمِّهِ يَعْقُوبَ بْنِ سَالِمٍ عَنْ عَبْدِ الْأَعْلَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ مَا الْكِبْرُ فَقَالَ أَعْظَمُ الْكِبْرِ أَنْ تَسْفَهَ الْحَقَّ وَ تَغْمِصَ النَّاسَ قُلْتُ وَ مَا سَفَهُ الْحَقِّ قَالَ يَجْهَلُ الْحَقَّ وَ يَطْعُنُ عَلَى أَهْلِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from someone else, from Ali Bin Asbaat, from his uncle Yaqoub Bin Salim, from Abdul A’ala, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘What is the arrogance?’ So he<sup>asws</sup> said: ‘The greatest of the arrogance is that you consider the Truth as foolish and you belittle the people (of Truth)’. I said, ‘And what is considering the Truth as foolish?’ He<sup>asws</sup> said: ‘Ignoring the Truth and his criticizing the people of Truth’."
          ],
          "en.sarwar": [
            "12. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from more than one person from Ali ibn Asbat from his uncle, Ya’qub ibn Salim from ‘Abd al-‘Ala’ who has said the following: “Once I asked abu ‘Abd Allah (a.s.) ‘What is arrogance?’ The Imam said, ‘The biggest arrogance is to hoodwink the truth and look down upon the people.’ I then asked, ‘What is to hoodwink the truth and belittle the people?’ The Imam said, ‘It is one’s disregarding and ignoring the truth and his criticizing the people of the truth.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/212)"
        ],
        "index": 2563,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:124:13",
        "text": [
          "عَنْهُ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنْ مُحَمَّدِ بْنِ عُمَرَ بْنِ يَزِيدَ عَنْ أَبِيهِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّنِي آكُلُ الطَّعَامَ الطَّيِّبَ وَ أَشَمُّ الرِّيحَ الطَّيِّبَةَ وَ أَرْكَبُ الدَّابَّةَ الْفَارِهَةَ وَ يَتْبَعُنِي الْغُلَامُ فَتَرَى فِي هَذَا شَيْئاً مِنَ التَّجَبُّرِ فَلَا أَفْعَلَهُ فَأَطْرَقَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) ثُمَّ قَالَ إِنَّمَا الْجَبَّارُ الْمَلْعُونُ مَنْ غَمَصَ النَّاسَ وَ جَهِلَ الْحَقَّ ",
          "قَالَ عُمَرُ فَقُلْتُ أَمَّا الْحَقُّ فَلَا أَجْهَلُهُ وَ الْغَمْصُ لَا أَدْرِي مَا هُوَ قَالَ مَنْ حَقَّرَ النَّاسَ وَ تَجَبَّرَ عَلَيْهِمْ فَذَلِكَ الْجَبَّارُ ."
        ],
        "translations": {
          "en.hubeali": [
            "From, from Yaqoub Bin Yazeed, from Muhammad Bin Umr Bin Yazeed, from his father who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I eat the good food, and smell the good perfume, and ride the luxurious animals, and the slaves follow behind me. So if you<sup>asws</sup> were to view anything from the tyranny in this, then I will not do it’. So Abu Abdullah<sup>asws</sup> remained (silent for a while), then said: ‘But rather, the tyrant is the accursed, the one who belittles the people and ignores the Truth’. ",
            "Umar (the narrator) said, ‘So I said, ‘As for the Truth, so I do not ignore it, and the belittling, I do not know what it is’. He<sup>asws</sup> said: ‘The one who considers the people as insignificant and is tyrannous upon them, so that is the tyrant’."
          ],
          "en.sarwar": [
            "13. It is narrated from him (narrator of the Hadith above) from Ya’qub ibn Yazid from Muhammad ibn ‘Umar ibn Yazid from his father who has said the following: “Once, I said to abu ‘Abd Allah (a.s.) ‘I eat good food, use good perfumes, and ride good energetic animals and a young man escorts me. Do you see anything tyrannical in it so I should avoid it? Abu ‘Abd Allah (a.s.) remained quiet for a while. He then said, ‘A condemned tyrant is one who ignores people and disregards the truth.’ ‘Umar has said that he then said, ‘I do not disregard the truth, but ignoring people is not clear for me.’ The Imam said, ‘Tyranny is when one considers people insignificant and acts among them repressively, such person is a tyrant.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/213)"
        ],
        "index": 2564,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:124:14",
        "text": [
          "مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْحَمِيدِ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) ثَلَاثَةٌ لَا يُكَلِّمُهُمُ اللَّهُ وَ لَا يَنْظُرُ إِلَيْهِمْ يَوْمَ الْقِيَامَةِ وَ لَا يُزَكِّيهِمْ وَ لَهُمْ عَذَابٌ أَلِيمٌ شَيْخٌ زَانٍ وَ مَلِكٌ جَبَّارٌ وَ مُقِلٌّ مُخْتَالٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ja’far, from Muhammad Bin Abdul Hameed, from Aasim Bin Humeyd, from Abu Hamza, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Three (people), Allah<sup>azwj</sup> will not Speak to them, nor Look towards them on the Day of Judgment, nor will He<sup>azwj</sup> Purify them, and for them would be a painful Punishment – an aged adulterer, and a tyrannous king, and an arrogant self-denying one’."
          ],
          "en.sarwar": [
            "14. Muhammad ibn Ja’far has narrated from Muhammad ibn ‘Abd al-Hamid from ‘Asim ibn Humayd from abu Hamza from abu Ja’far (a.s.) who has said the following: “The messenger of Allah has said, ‘There are three kinds of people to whom, on the Day of Judgment, Allah will not speak or look to and will not purify them. They will suffer a painful punishment: an old man who fornicates, a tyrant king and an arrogant poor person.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/215)"
        ],
        "index": 2565,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:124:15",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مَرْوَكِ بْنِ عُبَيْدٍ عَمَّنْ حَدَّثَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ يُوسُفَ ( عليه السلام ) لَمَّا قَدِمَ عَلَيْهِ الشَّيْخُ يَعْقُوبُ ( عليه السلام ) دَخَلَهُ عِزُّ الْمُلْكِ فَلَمْ يَنْزِلْ إِلَيْهِ فَهَبَطَ جَبْرَئِيلُ ( عليه السلام ) فَقَالَ يَا يُوسُفُ ابْسُطْ رَاحَتَكَ فَخَرَجَ مِنْهَا نُورٌ سَاطِعٌ فَصَارَ فِي جَوِّ السَّمَاءِ فَقَالَ يُوسُفُ يَا جَبْرَئِيلُ مَا هَذَا النُّورُ الَّذِي خَرَجَ مِنْ رَاحَتِي فَقَالَ نُزِعَتِ النُّبُوَّةُ مِنْ عَقِبِكَ عُقُوبَةً لِمَا لَمْ تَنْزِلْ إِلَى الشَّيْخِ يَعْقُوبَ فَلَا يَكُونُ مِنْ عَقِبِكَ نَبِيٌّ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Marwak Bin Ubeyd, from the one who narrated it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Yusuf<sup>as</sup> was such that when the elderly Yaqoub<sup>as</sup> proceeded to him<sup>as</sup>, the might of the kingship entered into him<sup>as</sup> and he<sup>as</sup> did not dismount to (welcome) him<sup>as</sup>. So Jibraeel<sup>as</sup> descended and said: ‘O Yusuf<sup>as</sup>! Extend your<sup>as</sup> palm!’. So a shining light came out from it and came to be in the atmosphere of the sky. So Yusuf<sup>as</sup> said: ‘What is this light which came out from my<sup>as</sup> palm?’ So he<sup>as</sup> said: ‘The Prophet-hood has been Removed from your<sup>as</sup> children as a Punishment to what caused you<sup>as</sup> not to descend to the elderly Yaqoub<sup>as</sup>, therefore there will not happen to be a Prophet<sup>as</sup> from your<sup>as</sup> children’."
          ],
          "en.sarwar": [
            "15. A number of our people have narrated from Ahmad ibn Muhammad from Marwak ibn ‘Ubayd from those narrated to him from abu ‘Abd Allah (a.s.) who has said the following: “Joseph, Yusuf, peace be upon him, met his old father, Ya’qub and because of majestic feeling of a king he did not dismount. Jibril (Gabriel) descended to him and said, ‘O Yusuf (look on) your palm.’ A shining light came out and went into the sky. Joseph asked, ‘O Jibril (Gabriel), what was that light that came out of my palm?’ He said, ‘Prophet-hood was removed from your descendents as punishment for not dismounting to the old Ya’qub, thus, there will be no prophet in your descendents.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/215)"
        ],
        "index": 2566,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:124:16",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا مِنْ عَبْدٍ إِلَّا وَ فِي رَأْسِهِ حِكْمَةٌ وَ مَلَكٌ يُمْسِكُهَا فَإِذَا تَكَبَّرَ قَالَ لَهُ اتَّضِعْ وَضَعَكَ اللَّهُ فَلَا يَزَالُ أَعْظَمَ النَّاسِ فِي نَفْسِهِ وَ أَصْغَرَ النَّاسِ فِي أَعْيُنِ النَّاسِ وَ إِذَا تَوَاضَعَ رَفَعَهُ اللَّهُ عَزَّ وَ جَلَّ ثُمَّ قَالَ لَهُ انْتَعِشْ نَعَشَكَ اللَّهُ فَلَا يَزَالُ أَصْغَرَ النَّاسِ فِي نَفْسِهِ وَ أَرْفَعَ النَّاسِ فِي أَعْيُنِ النَّاسِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from one of his companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There is none from a servant except that there is wisdom in his head and an Angel withholds it (there). So when he is arrogant, (the Angel) says to him: ‘Be humble, may Allah<sup>azwj</sup> Drop you!’. So he does not cease to be the greatest of the people within himself and the smallest of the people in the eyes of the people; but when he is humble, Allah<sup>azwj</sup> Might and Majestic Raises him, then (the Angel) says to him: ‘Be humble, may Allah<sup>azwj</sup> Dignify you!’ So he does not cease to be the smallest of the people within himself and the highest of the people in the eyes of the people’."
          ],
          "en.sarwar": [
            "16. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from certain individuals of his people from abu ‘Abd Allah (a.s.) who has said the following: “Every servant (of Allah) has in his head a certain degree of wisdom being held therein by an angel. When he expresses arrogance the angel says, ‘Be humble, may Allah bring you low.’ Thereafter he thinks himself to be the greatest of people but in the eyes of the people he remains the lowest of all. When he behaves humbly, Allah, the Most Majestic, the Most Holy, lifts him up. The angel then says, ‘Be lofty, may Allah grant you dignity.’ He thereafter remains the lowest of all people before his own soul and the most dignified in the eyes of people.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/217)"
        ],
        "index": 2567,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:124:17",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ بَعْضِ أَصْحَابِهِ عَنِ النَّهْدِيِّ عَنْ يَزِيدَ بْنِ إِسْحَاقَ شَعِرٍ عَنْ عَبْدِ اللَّهِ بْنِ الْمُنْذِرِ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَا مِنْ أَحَدٍ يَتِيهُ إِلَّا مِنْ ذِلَّةٍ يَجِدُهَا فِي نَفْسِهِ ",
          "وَ فِي حَدِيثٍ آخَرَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا مِنْ رَجُلٍ تَكَبَّرَ أَوْ تَجَبَّرَ إِلَّا لِذِلَّةٍ وَجَدَهَا فِي نَفْسِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from one of his companions, from al Nahdy, from Yazeed Bin Is’haq Sha’ar, from Abdullah Bin Al Munzir, from Abdullah Bin Bukeyr who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘There is no one who comes to it (arrogance) except from a disgrace which he finds within himself’. ",
            "And in another Hadeeth, from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> having said: ‘There is none from a man who is arrogant or tyrannous except due to the disgrace which he finds within himself’."
          ],
          "en.sarwar": [
            "17. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from certain individuals of his people from al-Nahdi from Yazid ibn Ishaq Sha’ar from ‘Abd Allah ibn al-Mudar from ‘Abd Allah ibn Bukayr who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘No one expresses arrogance but because of lowliness that he feels in his soul.’ In another Hadith abu ‘Abd Allah (a.s.) has said, ‘There is no man who expresses arrogance or tyranny but because of lowliness that he feels in his soul.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:124",
  "kind": "verse_list"
}