{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:2:1:13",
        "titles": {
          "ar": "بَابُ دَعَائِمِ الْإِسْلَامِ",
          "en": "Chapter 13 – The Pillars of Al-Islām"
        }
      }
    ],
    "index": 201,
    "local_index": 13,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:2:1:14",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ أَنَّ الْإِسْلَامَ</span> يُحْقَنُ بِهِ الدَّمُ وَ تُؤَدَّى بِهِ الْأَمَانَةُ وَ أَنَّ الثَّوَابَ عَلَى الْإِيمَانِ",
          "en": "Chapter 14 – Al-Islām, the blood is saved by it, and the entrustments are paid by it, and that the Rewards are based upon the faith"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:2:1:12",
        "titles": {
          "ar": "بَابُ الشَّرَائِعِ",
          "en": "Chapter 12 – The Laws"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:13",
    "titles": {
      "ar": "بَابُ دَعَائِمِ الْإِسْلَامِ",
      "en": "Chapter 13 – The Pillars of Al-Islām"
    },
    "verse_count": 15,
    "verse_start_index": 1482,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/100)"
        ],
        "index": 1483,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:13:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ح</span>َدَّثَنِي الْحُسَيْنُ</span> بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ الزِّيَادِيِّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ قَالَ حَدَّثَنَا أَبَانُ بْنُ عُثْمَانَ عَنْ فُضَيْلٍ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ عَلَى الصَّلَاةِ وَ الزَّكَاةِ وَ الصَّوْمِ وَ الْحَجِّ وَ الْوَلَايَةِ وَ لَمْ يُنَادَ بِشَيْ‏ءٍ كَمَا نُودِيَ بِالْوَلَايَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad Al Ashary narrated to me, from Moalla Bin Muhammad Al Ziyadi, from Al Hassan Bin Ali Al Washa who said, ‘Aban Bin Usman narrated to us, from Fuzayl Bin Abu Hamza, ",
            "(It has been narrated) from Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> having said: ‘<span class=\"iTxt\">Islām</span> is built upon five – Upon the <span class=\"iTxt\">Salāt</span>, and the <span class=\"iTxt\">Zakāt</span>, and the <span class=\"iTxt\">Soām</span> (Fasts), and the <span class=\"iTxt\">Hajj</span>, and the <span class=\"iTxt\">Wilayah</span>, and we<sup style=\"font-weight: normal\">asws</sup> do not call (emphasise) with anything like what we<sup style=\"font-weight: normal\">asws</sup> called (have emphasised) with the <span class=\"iTxt\">Wilayah</span>’."
          ],
          "en.sarwar": [
            "1. Al-Husayn ibn Muhammad al-Ash’ari narrated to me from Mu’ alia ibn Muhammad al-Ziyadi from Hassan ibn Ali al-Washsha’ who has said that narrated to us Aban ibn ‘Uthman from Fudayl from abu Hamza from abu Ja’far (a.s.) who has said the following: “Abu Ja’far (a.s.) has said, ‘Islam is based on five principles. It is based on Prayer, Charity (al-Zakat) Fasting, Hajj and al-Wilayah (Divine Authority of A ’immah). The call to none of the other principles has been so emphatic as it has been to al-Wilayah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/101)"
        ],
        "index": 1484,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:13:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَجْلَانَ أَبِي صَالِحٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَوْقِفْنِي عَلَى حُدُودِ الْإِيمَانِ فَقَالَ شَهَادَةُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ وَ الْإِقْرَارُ بِمَا جَاءَ بِهِ مِنْ عِنْدِ اللَّهِ وَ صَلَوَاتُ الْخَمْسِ وَ أَدَاءُ الزَّكَاةِ وَ صَوْمُ شَهْرِ رَمَضَانَ وَ حِجُّ الْبَيْتِ وَ وَلَايَةُ وَلِيِّنَا وَ عَدَاوَةُ عَدُوِّنَا وَ الدُّخُولُ مَعَ الصَّادِقِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus Bin Abdul Rahman, from Ajlan Abu Salih who said, ",
            "‘I said to Abu Abdullah<sup style=\"font-weight: normal\">asws</sup>, ‘Set me upon the limits of the ‘<span class=\"iTxt\">Emān</span>’ (faith). So he<sup style=\"font-weight: normal\">asws</sup> said: ‘The testimony that there is no god except for Allah<sup style=\"font-weight: normal\">azwj</sup> and that Muhammad<sup style=\"font-weight: normal\">saww</sup> is Rasool<sup style=\"font-weight: normal\">saww</sup> of Allah<sup style=\"font-weight: normal\">azwj</sup>, and the acknowledgement with whatever he<sup style=\"font-weight: normal\">saww</sup> came with from the Presence of Allah<sup style=\"font-weight: normal\">azwj</sup>, and the five <span class=\"iTxt\">Salāt</span>, and payment of the <span class=\"iTxt\">Zakāt</span>, and Fasting the Month of Ramazan, and <span class=\"iTxt\">Hajj</span> of the House (Kabah), and the <span class=\"iTxt\">Wilayah</span> for us<sup style=\"font-weight: normal\">asws</sup> and enmity for our<sup style=\"font-weight: normal\">asws</sup> enemies, and the entering to be with the truthful’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from Muhammad ibn ’Isa from Yunus ibn ‘Abd al- Rahman from ’Ajlan ibn Salih who has said the following: “I requested abu ‘Abd Allah (a.s.) ‘Teach me, please, the principles of beliefs. The Imam said, ‘They are: to testify and affirm that there is no one who deserves to be worshipped except Allah, to testify and affirm that Muhammad is the Messenger of Allah and to affirm that whatever he has taught is from Allah. (It is of the principles of beliefs) to affirm and accept that there is prayer five times every day. (It is of the principles of beliefs) to pay Zakat (charity), to fast in the month of Ramadan and to perform Hajj of the House (of Allah). (It is of the principles of beliefs) to love those who love us ( A ’immah from the family of the Messenger of Allah), to disown our enemies and to become part of the group of the truthful ones. (All such issues are of principles and obligatory matters).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (101/ 7)"
        ],
        "index": 1485,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:13:3",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنْ عَبَّاسِ بْنِ عَامِرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ فُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ عَلَى الصَّلَاةِ وَ الزَّكَاةِ وَ الصَّوْمِ وَ الْحَجِّ وَ الْوَلَايَةِ وَ لَمْ يُنَادَ بِشَيْ‏ءٍ كَمَا نُودِيَ بِالْوَلَايَةِ فَأَخَذَ النَّاسُ بِأَرْبَعٍ وَ تَرَكُوا هَذِهِ يَعْنِي الْوَلَايَةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Al Hassan Bin Al Al Kufy, from Abbas Bin Aamir, from Aban Bin Usman, from Fuzayl Bin Yasaar, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Al-<span class=\"iTxt\">Islām</span> is built upon five – Upon the <span class=\"iTxt\">Salāt</span>, and the <span class=\"iTxt\">Zakāt</span>, and the Fasting, and the <span class=\"iTxt\">Hajj</span>, and the <span class=\"iTxt\">Wilayah</span>, and we<sup>asws</sup> do not call with anything like what we<sup>asws</sup> call with the <span class=\"iTxt\">Wilayah</span>. So the people (instead) grabbed the four and neglected this, meaning Al-<span class=\"iTxt\">Wilayah</span>’."
          ],
          "en.sarwar": [
            "3. Abu Ali al-Ash’ari has narrated from al-Hassan ibn Ali al-Kufi from ‘Abbas ibn ‘Amir from Aban ibn ‘Uthman from Fudayl ibn Yasar from abu Ja’far (a.s.) who has said the following: “Abu Ja’far (a.s.) has said, ‘Islam is based on five principles. They are: Prayer, al-Zakat (charity) fasting, Hajj and al-Wilayah. The call to none of the other principles has been so emphatic as it has been to al- Wilayah. People accepted the other four but they left aside this [al-Wilayah].’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/101)"
        ],
        "index": 1486,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:13:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ ابْنِ الْعَرْزَمِيِّ عَنْ أَبِيهِ عَنِ الصَّادِقِ ( عليه السلام ) قَالَ قَالَ أَثَافِيُّ الْإِسْلَامِ ثَلَاثَةٌ الصَّلَاةُ وَ الزَّكَاةُ وَ الْوَلَايَةُ لَا تَصِحُّ وَاحِدَةٌ مِنْهُنَّ إِلَّا بِصَاحِبَتَيْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Ibn Al Arzamy, from his father, ",
            "(It has been narrated) from Al-Sadiq<sup>asws</sup> having said: ‘The ‘Asafy’ (essence) of Al-<span class=\"iTxt\">Islām</span> are three – The <span class=\"iTxt\">Salāt</span>, and the <span class=\"iTxt\">Zakāt</span>, and the <span class=\"iTxt\">Wilayah</span>. Not one of these would be correct except with its two companions’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ’Isa from al-Husayn ibn Sa’id from al-‘Arzami from his father from abu ‘Abd Allah (a.s.) who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘The tripod of Islam consists of prayer, al-Zakat (charity) and al-Wilayah. No one of these can be considered correct without the other two.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/102)"
        ],
        "index": 1487,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:13:5",
        "relations": {
          "Mentions": [
            "/books/quran:3:97",
            "/books/quran:4:80"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عَبْدِ اللَّهِ بْنِ الصَّلْتِ جَمِيعاً عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزِ بْنِ عَبْدِ اللَّهِ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ بُنِيَ الْإِسْلَامُ عَلَى خَمْسَةِ أَشْيَاءَ عَلَى الصَّلَاةِ وَ الزَّكَاةِ وَ الْحَجِّ وَ الصَّوْمِ وَ الْوَلَايَةِ قَالَ زُرَارَةُ فَقُلْتُ وَ أَيُّ شَيْ‏ءٍ مِنْ ذَلِكَ أَفْضَلُ فَقَالَ الْوَلَايَةُ أَفْضَلُ لِأَنَّهَا مِفْتَاحُهُنَّ وَ الْوَالِي هُوَ الدَّلِيلُ عَلَيْهِنَّ",
          "قُلْتُ ثُمَّ الَّذِي يَلِي ذَلِكَ فِي الْفَضْلِ فَقَالَ الصَّلَاةُ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ الصَّلَاةُ عَمُودُ دِينِكُمْ",
          "قَالَ قُلْتُ ثُمَّ الَّذِي يَلِيهَا فِي الْفَضْلِ قَالَ الزَّكَاةُ لِأَنَّهُ قَرَنَهَا بِهَا وَ بَدَأَ بِالصَّلَاةِ قَبْلَهَا وَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الزَّكَاةُ تُذْهِبُ الذُّنُوبَ",
          "قُلْتُ وَ الَّذِي يَلِيهَا فِي الْفَضْلِ قَالَ الْحَجُّ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ لِلَّهِ عَلَى النَّاسِ حِجُّ الْبَيْتِ مَنِ اسْتَطاعَ إِلَيْهِ سَبِيلًا وَ مَنْ كَفَرَ فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعالَمِينَ وَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَحَجَّةٌ مَقْبُولَةٌ خَيْرٌ مِنْ عِشْرِينَ صَلَاةً نَافِلَةً وَ مَنْ طَافَ بِهَذَا الْبَيْتِ طَوَافاً أَحْصَى فِيهِ أُسْبُوعَهُ وَ أَحْسَنَ رَكْعَتَيْهِ غَفَرَ اللَّهُ لَهُ وَ قَالَ فِي يَوْمِ عَرَفَةَ وَ يَوْمِ الْمُزْدَلِفَةِ مَا قَالَ",
          "قُلْتُ فَمَا ذَا يَتْبَعُهُ قَالَ الصَّوْمُ قُلْتُ وَ مَا بَالُ الصَّوْمِ صَارَ آخِرَ ذَلِكَ أَجْمَعَ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الصَّوْمُ جُنَّةٌ مِنَ النَّارِ",
          "قَالَ ثُمَّ قَالَ إِنَّ أَفْضَلَ الْأَشْيَاءِ مَا إِذَا فَاتَكَ لَمْ تَكُنْ مِنْهُ تَوْبَةٌ دُونَ أَنْ تَرْجِعَ إِلَيْهِ فَتُؤَدِّيَهُ بِعَيْنِهِ إِنَّ الصَّلَاةَ وَ الزَّكَاةَ وَ الْحَجَّ وَ الْوَلَايَةَ لَيْسَ يَقَعُ شَيْ‏ءٌ مَكَانَهَا دُونَ أَدَائِهَا وَ إِنَّ الصَّوْمَ إِذَا فَاتَكَ أَوْ قَصَّرْتَ أَوْ سَافَرْتَ فِيهِ أَدَّيْتَ مَكَانَهُ أَيَّاماً غَيْرَهَا وَ جَزَيْتَ ذَلِكَ الذَّنْبَ بِصَدَقَةٍ وَ لَا قَضَاءَ عَلَيْكَ وَ لَيْسَ مِنْ تِلْكَ الْأَرْبَعَةِ شَيْ‏ءٌ يُجْزِيكَ مَكَانَهُ غَيْرُهُ",
          "قَالَ ثُمَّ قَالَ ذِرْوَةُ الْأَمْرِ وَ سَنَامُهُ وَ مِفْتَاحُهُ وَ بَابُ الْأَشْيَاءِ وَ رِضَا الرَّحْمَنِ الطَّاعَةُ لِلْإِمَامِ بَعْدَ مَعْرِفَتِهِ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ اللَّهَ وَ مَنْ تَوَلَّى فَما أَرْسَلْناكَ عَلَيْهِمْ حَفِيظاً ",
          "أَمَا لَوْ أَنَّ رَجُلًا قَامَ لَيْلَهُ وَ صَامَ نَهَارَهُ وَ تَصَدَّقَ بِجَمِيعِ مَالِهِ وَ حَجَّ جَمِيعَ دَهْرِهِ وَ لَمْ يَعْرِفْ وَلَايَةَ وَلِيِّ اللَّهِ فَيُوَالِيَهُ وَ يَكُونَ جَمِيعُ أَعْمَالِهِ بِدَلَالَتِهِ إِلَيْهِ مَا كَانَ لَهُ عَلَى اللَّهِ جَلَّ وَ عَزَّ حَقٌّ فِي ثَوَابِهِ وَ لَا كَانَ مِنْ أَهْلِ الْإِيمَانِ ",
          "ثُمَّ قَالَ أُولَئِكَ الْمُحْسِنُ مِنْهُمْ يُدْخِلُهُ اللَّهُ الْجَنَّةَ بِفَضْلِ رَحْمَتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Abdullah Bin Al Salt, altogether from Hammad Bin Isa, from Hareyz Bin Abdullah, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘ The foundation of Al-<span class=\"iTxt\">Islām</span> is upon five things (pillars) – upon the <span class=\"iTxt\">Salāt</span>, and the <span class=\"iTxt\">Zakāt</span>, and the <span class=\"iTxt\">Hajj</span>, and the <span class=\"iTxt\">Soām</span> (Fasts), and the <span class=\"iTxt\">Wilayah</span>’. Zurara (the narrator) said, ‘So I said, ‘And which from that is superior?’ So he<sup>asws</sup> said: ‘The <span class=\"iTxt\">Wilayah</span> is superior because it is their key (soul), and the ‘الْوَالِي’ the Guardian<sup>asws</sup> is ‘الدَّلِيلُ’ the Proof upon these’. ",
            "I said, ‘Then which is in the superiority after that (the <span class=\"iTxt\">Wilayah)</span>?’ So he<sup>asws</sup> said: ‘The <span class=\"iTxt\">Salāt</span>. Rasool-Allah<sup>saww</sup> said: ‘The <span class=\"iTxt\">Salāt </span>is a pillar of your Religion’. ",
            "He (the narrator) said, ‘I said, ‘Then which follows it in the superiority?’ He<sup>asws</sup> said: ‘The <span class=\"iTxt\">Zakāt</span>, because it is paired with it and begun with the <span class=\"iTxt\">Salāt</span>, before it; and Rasool-Allah<sup>saww</sup> said: ‘The <span class=\"iTxt\">Zakāt </span>cleans the sins’. ",
            "I said, ‘And which follows it in superiority (after <span class=\"iTxt\">Zakāt</span>)?’ He<sup>asws</sup> said: ‘The <span class=\"iTxt\">Hajj</span>. Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h97\">[3:97]</a> and Pilgrimage to the House is incumbent upon the people for the Sake of Allah, (upon) everyone who is able to undertake the journey to it; and whoever disbelieves, then surely Allah is Self-sufficient, above any need of the worlds</span>. And Rasool-Allah<sup>saww</sup> said: ‘An Accepted <span class=\"iTxt\">Hajj</span> is between than twenty optional <span class=\"iTxt\">Salāt</span>, and the one who performs <span class=\"iTxt\">Tawaaf</span> of this House (Kabah) counting seven in it, and performs good two <span class=\"iTxt\">Rakāts</span> (of <span class=\"iTxt\">Salāt</span>) therein, Allah<sup>azwj</sup> would Forgive him. And he<sup>saww</sup> said regarding the day of <span class=\"iTxt\">Arafāt</span> and the day of Al-Muzdalifa what he<sup>saww</sup> said’. ",
            "I said, ‘So what is that which follows it?’ He<sup>asws</sup> said: ‘The <span class=\"iTxt\">Soām</span>’ (Fast). I said, ‘And what is the matter the <span class=\"iTxt\">Soām</span> (Fast) came to be at the end of all that?’ He<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘The Fast is a shield from the Fire’. ",
            "He (the narrator) said, ‘Then he<sup>asws</sup> said: ‘The superior is what, when it is missed out by you, there would be no repentance from it besides that you would return to it, so you would fulfil it with exactly it. The <span class=\"iTxt\">Salāt</span>, and the <span class=\"iTxt\">Zakāt</span>, and the <span class=\"iTxt\">Hajj</span>, and the <span class=\"iTxt\">Wilayah</span>, nothing can happen to be in its place besides its fulfilment, and that the <span class=\"iTxt\">Soām</span>, when it is missed out by you, or you are deficient, or you are in a journey, you can fulfil it in days other than it, and that sin would be sufficed for you by a charity, and there would be no paying back (of the outstanding <span class=\"iTxt\">Soām</span>) upon you, and there is nothing from those four, anything which would suffice you in its place, something else’. ",
            "Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘The peak of the matter, and its hump, and its key, and the door of the things, and Pleasure of the Beneficent (Allah<sup style=\"font-weight: normal\">azwj</sup>) is in the obedience to the (Divine) Imam<sup style=\"font-weight: normal\">asws</sup> after recognising him<sup style=\"font-weight: normal\">asws</sup>. Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h80\">[4:80]</a> Whoever obeys the Rasool, so he has obeyed Allah, and whoever turns back, so We have not Sent you as a keeper over them</span>. ",
            "At the same time, if a man were to stand (for <span class=\"iTxt\">Salāt</span>) for his night, and (observe) <span class=\"iTxt\">Soām</span> (Fast) for his day, and give charity with the entirety of his wealth, and perform <span class=\"iTxt\">Hajj</span> for the entirety of his lifetime, but would not recognise the <span class=\"iTxt\">Wilayah</span> of the ‘وَلِيِّ اللَّهِ’ Guardian<sup style=\"font-weight: normal\">asws</sup> of Allah<sup style=\"font-weight: normal\">azwj</sup>, so there would be no right for him upon Allah<sup style=\"font-weight: normal\">azwj</sup> Majestic and Mighty, any right for His<sup style=\"font-weight: normal\">azwj</sup> Rewards, nor would he ever be from the people of the <span class=\"iTxt\">Emān</span> (faith)’. ",
            "Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘The good one from them, Allah<sup style=\"font-weight: normal\">azwj</sup> would Enter him into the Paradise by the Grace of His<sup style=\"font-weight: normal\">azwj</sup> Mercy’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father and ‘Abd Allah ibn al-Salt all of them from Hammad ibn ’Isa from Hariz ibn ‘Abd Allah from Zurara from abu Ja’far (a.s.) who has said the following: “Abu Ja’far (a.s.) has said, ‘Islam is based on five issues. It is based on prayer, charity (al- Zakat), Hajj, Fasting and al-Wilayah.’’ Zurara has said, ‘I then asked the Imam, “Which of these is more important than the others?’” The Imam said, ‘Al-Wilayah is more important. It is the key to the others. The person who possesses Divine Authority is the guide to the other principles.’ I then asked, ‘Which is the next important?’ The Imam said, ‘Thereafter is prayer. The Messenger of Allah has said, “Prayer is the pillar of your religion.’” I then asked, ‘Which is the next important among them?’ The Imam said, ‘Al-Zakat is the one thereafter. Allah has mentioned it next to prayer but He has mentioned prayer first. The Messenger of Allah has said, “Al-Zakat removes sins.’” I then asked, ‘Which one is important thereafter?’ The Imam said, ‘Hajj is important thereafter. Allah, the Most Majestic, the Most Holy, has said, “It is a duty of the people to Allah to perform Hajj of the House if they are capable to do so. Whoever rejects it should know that Allah does not need anyone in the world.” <a href=\"/#/books/quran:3#h97\">[3:97]</a> The messenger of Allah has said, “Performing Hajj that is accepted is more virtuous than twenty Rak’at optional prayer. Whoever walks around the House seven times and performs the two Rak’at prayers thereafter properly Allah will grant him cover.” He (The Messenger of Allah) did say on the ninth of the month of Dil Hajj and on the tenth of the month of Dil Hajj in Muzdalifa (a place in Makka), what he wanted to say.’ I then asked, ‘Which one is important thereafter?’ The Imam said, ‘It is fasting.’ “I then asked, ‘Why is fasting the last of all in importance?’ The Imam said, ‘The Messenger of Allah has said, “Fasting is a shield against the fire.’” The narrator has said that the Imam said, ‘The best of all things is that for which, if you miss, you do not find an alternative accept going back to achieve it. Prayer, al-Wilayah and Hajj are not of matters replaceable with their own kind. On the other hand if fasting is missed on a journey one has the choice to fast on other days as remedy, or compensate for the sin with expiation and no fasting is necessary as a remedy. In the cases of the other four issues there is no alternative for them.’ The narrator has said that the Imam then said, ‘The topmost, the peak of the issue, the key and the door to it and the pleasure of the Beneficent (Lord) is to obey the Imam properly after knowing him clearly. Allah, the Most Majestic, the Most Holy, says, “Whoever obeys the Messenger he has obeyed Allah and whoever turns away from such obedience then you should know that We have not sent you to guard them.” <a href=\"/#/books/quran:4#h80\">[4:80]</a> ‘Without recognizing the Divine Authority of the Imam, the deputy of Allah, no one has the right to receive any reward from Allah, the Most Majestic, the Most Holy. This is true even though in his lifetime he may stand up in worship the whole night, fast during the day, give all his belongings in charity and perform Hajj every year. So also it is if he does not acknowledge the Divine Authority of his Imam with which all of one’s deeds can take place with the guidance of the Imam. Wiothout al- Wilayah, one is not considered of the people of belief.’ Thereafter the Imam said, ‘Allah will admit, those of them who do good deeds into paradise through His extra mercy.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح بسنديه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (108/ 7)"
        ],
        "index": 1488,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:13:6",
        "relations": {
          "Mentions": [
            "/books/quran:4:59"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عِيسَى بْنِ السَّرِيِّ أَبِي الْيَسَعِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَخْبِرْنِي بِدَعَائِمِ الْإِسْلَامِ الَّتِي لَا يَسَعُ أَحَداً التَّقْصِيرُ عَنْ مَعْرِفَةِ شَيْ‏ءٍ مِنْهَا الَّذِي مَنْ قَصَّرَ عَنْ مَعْرِفَةِ شَيْ‏ءٍ مِنْهَا فَسَدَ دِينُهُ وَ لَمْ يَقْبَلِ [اللَّهُ] مِنْهُ عَمَلَهُ وَ مَنْ عَرَفَهَا وَ عَمِلَ بِهَا صَلَحَ لَهُ دِينُهُ وَ قَبِلَ مِنْهُ عَمَلَهُ وَ لَمْ يَضِقْ بِهِ مِمَّا هُوَ فِيهِ لِجَهْلِ شَيْ‏ءٍ مِنَ الْأُمُورِ جَهْلُهُ",
          "فَقَالَ شَهَادَةُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ الْإِيمَانُ بِأَنَّ مُحَمَّداً رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ الْإِقْرَارُ بِمَا جَاءَ بِهِ مِنْ عِنْدِ اللَّهِ وَ حَقٌّ فِي الْأَمْوَالِ الزَّكَاةُ وَ الْوَلَايَةُ الَّتِي أَمَرَ اللَّهُ عَزَّ وَ جَلَّ بِهَا وَلَايَةُ آلِ مُحَمَّدٍ ( صلى الله عليه وآله )",
          "قَالَ فَقُلْتُ لَهُ هَلْ فِي الْوَلَايَةِ شَيْ‏ءٌ دُونَ شَيْ‏ءٍ فَضْلٌ يُعْرَفُ لِمَنْ أَخَذَ بِهِ قَالَ نَعَمْ قَالَ اللَّهُ عَزَّ وَ جَلَّ يا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَ أَطِيعُوا الرَّسُولَ وَ أُولِي الْأَمْرِ مِنْكُمْ وَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ مَاتَ وَ لَا يَعْرِفُ إِمَامَهُ مَاتَ مِيتَةً جَاهِلِيَّةً وَ كَانَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) وَ كَانَ عَلِيّاً ( عليه السلام ) وَ قَالَ الْآخَرُونَ كَانَ مُعَاوِيَةَ ثُمَّ كَانَ الْحَسَنَ ( عليه السلام ) ثُمَّ كَانَ الْحُسَيْنَ ( عليه السلام ) وَ قَالَ الْآخَرُونَ يَزِيدَ بْنَ مُعَاوِيَةَ وَ حُسَيْنَ بْنَ عَلِيٍّ وَ لَا سِوَاءَ وَ لَا سِوَاءَ",
          "قَالَ ثُمَّ سَكَتَ ثُمَّ قَالَ أَزِيدُكَ فَقَالَ لَهُ حَكَمٌ الْأَعْوَرُ نَعَمْ جُعِلْتُ فِدَاكَ قَالَ ثُمَّ كَانَ عَلِيَّ بْنَ الْحُسَيْنِ ثُمَّ كَانَ مُحَمَّدَ بْنَ عَلِيٍّ أَبَا جَعْفَرٍ وَ كَانَتِ الشِّيعَةُ قَبْلَ أَنْ يَكُونَ أَبُو جَعْفَرٍ وَ هُمْ لَا يَعْرِفُونَ مَنَاسِكَ حَجِّهِمْ وَ حَلَالَهُمْ وَ حَرَامَهُمْ حَتَّى كَانَ أَبُو جَعْفَرٍ فَفَتَحَ لَهُمْ وَ بَيَّنَ لَهُمْ مَنَاسِكَ حَجِّهِمْ وَ حَلَالَهُمْ وَ حَرَامَهُمْ حَتَّى صَارَ النَّاسُ يَحْتَاجُونَ إِلَيْهِمْ مِنْ بَعْدِ مَا كَانُوا يَحْتَاجُونَ إِلَى النَّاسِ ",
          "وَ هَكَذَا يَكُونُ الْأَمْرُ وَ الْأَرْضُ لَا تَكُونُ إِلَّا بِإِمَامٍ وَ مَنْ مَاتَ لَا يَعْرِفُ إِمَامَهُ مَاتَ مِيتَةً جَاهِلِيَّةً وَ أَحْوَجُ مَا تَكُونُ إِلَى مَا أَنْتَ عَلَيْهِ إِذْ بَلَغَتْ نَفْسُكَ هَذِهِ وَ أَهْوَى بِيَدِهِ إِلَى حَلْقِهِ وَ انْقَطَعَتْ عَنْكَ الدُّنْيَا تَقُولُ لَقَدْ كُنْتُ عَلَى أَمْرٍ حَسَنٍ .",
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ عِيسَى بْنِ السَّرِيِّ أَبِي الْيَسَعِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Safwan Bin Yahya, from Isa Bin Al Sariy Abu Al Yas’a who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Inform me of the foundation of Al-<span class=\"iTxt\">Islām</span> which no one has the capacity to be deficient from recognising anything from it, which if one was to be deficient from recognising anything from it, would spoil his Religion, and Allah<sup>azwj</sup> would not Accept his deeds from him; and the one who recognizes it and acts accordingly with it, his Religion would be correct for him, and his deeds would be Accepted from him, and he would not be constricted by it from what he would be in due to the ignorance of something from the matters of his ignorance’.",
            "So he<sup>asws</sup> said: ‘The testimony that there is no god except for Allah<sup>azwj</sup>, and the <span class=\"iTxt\">Emān (belief)</span> that Muhammad<sup>saww</sup> is Rasool<sup>saww</sup> of Allah<sup>azwj</sup>, and the acknowledgement with whatever he<sup>saww</sup> came with from the Presence of Allah<sup>azwj</sup>, and the right of <span class=\"iTxt\">Zakāt</span> in the wealth, and the <span class=\"iTxt\">Wilayah</span> which Allah<sup>azwj</sup> Mighty and Majestic Commanded with, the <span class=\"iTxt\">Wilayah</span> of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>’. ",
            "He (the narrator) said, ‘So I said to him<sup>asws</sup>, ‘Is there anything regarding the <span class=\"iTxt\">Wilayah</span> besides the thing which the one who takes to it can be recognised with?’ He<sup>asws</sup> said: ‘Yes. Allah<sup>azwj</sup> Mighty and Majestic Said: <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h59\">[4:59]</a> O you who believe! Obey Allah and obey the Rasool and those in authority from among you</span>. And Rasool-Allah<sup>saww</sup> said: ‘The one who dies and does not recognise his<sup>asws</sup> Imam<sup>asws</sup> has died the death of ‘جَاهِلِيَّةً’ (Kufr - the Pre-<span class=\"iTxt\">Islām</span>ic period), and it was Rasool-Allah<sup>saww</sup> and it was Ali<sup>asws</sup>, and the others said it was Muawiya. Then it was Al-Hassan<sup>asws</sup>, then it was Al-Husayn<sup>asws</sup>, and the others said (it was) Yazeed Bin Muawiya and Al-Husayn Bin Ali<sup>asws</sup>. And they were not equal, and they were not equal’. ",
            "He (the narrator) said, ‘Then he<sup>asws</sup> was silent. Then he<sup>asws</sup> said: ‘Shall I<sup>asws</sup> increase it for you?’ So Hakam Al-Awro said to him<sup>asws</sup>, ‘Yes, May I be sacrificed for you<sup>asws</sup>!’. He<sup>asws</sup> said: ‘Then it was Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, then it was Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> Abu Ja’far<sup>asws</sup>. And the Shias before Abu Jafar<sup>asws</sup> did not know the rituals of their <span class=\"iTxt\">Hajj</span>, and their Permissible and their Prohibitions until it was Abu Ja’far<sup>asws</sup> (as the <span class=\"iTxt\">Ul Al-Amr</span>). So he<sup>asws</sup> opened (the knowledge) for them and explained to them the rituals of their <span class=\"iTxt\">Hajj</span>, and their Permissible and their Prohibitions, to the extent that the people came to be needy to them from after their being needy to the people. ",
            "And that is how the matter happens to be, and the earth will not happen to be except with an Imam<sup>asws</sup>, and the one who dies not having recognised his Imam<sup>asws</sup> would have died the death of ‘جَاهِلِيَّةً’ (kufr - the Pre-Islāmic period); and the neediest what you will happen to be, what you are upon, is when your soul reaches this here’ – and he<sup>asws</sup> pointed with his<sup>asws</sup> hand to his<sup>asws</sup> throat – ‘and the world would be cut-off from you, and you would be saying, ‘We were upon a beautiful matter’’. ",
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Isa Bin Al Sariy Abu Al Yas’a, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> – similar to it."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Safwan ibn Yahya from ‘Isa ibn al-Sariyy abu al-Yasa’ who has said the following: “Once I said to abu ‘Abd Allah (a.s.) ‘Teach me, please, the basic principles of Islam that are necessary for everyone to know to his limits of understanding, and if he fails to learn them to the necessary levels his religion is destroyed and Allah does not accept his deeds. What is the limit of learning about the deeds with which someone’s religion can take proper shape and Allah may accept his deeds? What are the limits and degrees of the permissible level of ignorance and lack of knowledge of certain aspects of these principles?’ “The Imam said, ‘The matters necessary to learn are to testify that no one deserves to be worshipped except Allah, that Muhammad (a.s.) is the Messenger of Allah, that whatever he has brought from Allah is the truth and to affirm that paying Zakat (charity) is a right. (Of such necessary matters is) to affirm al-Wilayah (Divine Authority of ‘ A’immah ) that Allah, the Most Majestic, the Most Holy, has made obligatory upon the other people to obey and acknowledge the Divine Authority of certain members of the family of Prophet Muhammad, recipient of divine supreme covenant.’ I (the narrator) then asked the Imam, ‘Is al-Wilayah of an exclusive nature?’ The Imam said, ‘Yes, Allah, the Most Majestic, the Most Holy, has said, “O believers, obey Allah, obey the Messenger and those among you who possess Divine Authority.” <a href=\"/#/books/quran:4#h59\">[4:59]</a> The Merssenger of Allah has said, “Whoever dies without knowing who the Imam of his time is, he is considered as a person dying in the time of ignorance (as an unbeliever).” There was the Messenger of Allah and there was Ali (a.s.) but others said there was Mu’awiyah. Then there was al-Hassan (a.s.) and then there was al-Husayn, recipient of divine supreme covenant. Others said that there were Yazid ibn Mu’awiyah and Husayn ibn Ali. They were not equals and certainly they were not equals, meaning thereby Ali, al-Hassan and al-Husayn with Mu’awiyah and his son Yazid.’ He has said that the Imam remained calm for a while and then said, ‘Do you want me to tell you additional facts?’ Hakam ibn al-’A’War said, ‘Yes, may Allah keep my soul in service to your cause.’ The Imam said, ‘Then there was Ali ibn al-Husayn (a.s.) then there was Muhammad ibn Ali, abu Ja’far. The Shi’a before abu Ja’far did not know the rules of Hajj, the lawful matters and the unlawful matters until there was abu Ja’far, recipient of divine supreme covenant. He opened it (system of religion) for them and explained to them the rules of their Hajj, the lawful and unlawful matters. People began to realize that they needed him very much while before they would ask other people for what they needed. This is how the facts are. The earth does not remain without an Imam and one who dies without knowing, who his Imam is, he is as though he was of the people of the dark ages of ignorance. The time when you need al-Wilayah most urgently is the time when your soul reaches here (pointing to his throat) and the world is cut off from you and then you say, ‘I have certainly been on the good side of the affairs, (a supporter of al-Wilayah).”’’ Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan from ‘Isa ibn al-Sariyy abu al-Yasa’ from abu ‘Abd Allah (a.s.) a similar Hadith. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/112)"
        ],
        "index": 1489,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:13:7",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ مُثَنًّى الْحَنَّاطِ عَنْ عَبْدِ اللَّهِ بْنِ عَجْلَانَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ الْوَلَايَةِ وَ الصَّلَاةِ وَ الزَّكَاةِ وَ صَوْمِ شَهْرِ رَمَضَانَ وَ الْحَجِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Musna Al hannat, from Abdullah Bin Ajlan, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Al-<span class=\"iTxt\">Islām</span> is built upon five – The <span class=\"iTxt\">Wilayah</span>, and the <span class=\"iTxt\">Salāt</span>, and the <span class=\"iTxt\">Zakāt</span>, and the <span class=\"iTxt\">Soām </span>(Fast) of the Month of Ramazan, and the <span class=\"iTxt\">Hajj</span>’."
          ],
          "en.sarwar": [
            "7. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad ibn abu Nasr from Muthanna al-Hannat from ‘Abd Allah ‘Ajlan from abu Ja’far (a.s.) who has said the following: “Abu Ja’far (a.s.) has said, ‘Islam is based on five principles. They are al-Wilayah, (accepting the Divine Authority of ‘ A’immah ), the prayer, al- Zakat (charity), fasting in the month of Ramadan and al-Hajj.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/112)"
        ],
        "index": 1490,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:13:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنْ أَبَانٍ عَنْ فُضَيْلٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ الصَّلَاةِ وَ الزَّكَاةِ وَ الصَّوْمِ وَ الْحَجِّ وَ الْوَلَايَةِ وَ لَمْ يُنَادَ بِشَيْ‏ءٍ مَا نُودِيَ بِالْوَلَايَةِ يَوْمَ الْغَدِيرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Salih Bin Al Sindy, from Ja’far Bin bashir, from Aban, from Fuzayl, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Al-<span class=\"iTxt\">Islām</span> is built upon five – The <span class=\"iTxt\">Salāt</span>, and the <span class=\"iTxt\">Zakāt</span>, and the <span class=\"iTxt\">Soām</span>, and the <span class=\"iTxt\">Hajj</span>, and the <span class=\"iTxt\">Wilayah</span>, and we<sup>asws</sup> do not call with anything what we<sup>asws</sup> call with the <span class=\"iTxt\">Wilayah</span> of the day of Ghadeer’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from Salih ibn al-Sindy from Ja’far ibn Bashir from Aban from Fudayl from abu Ja’far (a.s.) who has said the following: “Abu Ja’far (a.s.) has said, ‘Islam is based on five principles: The prayer, al-Zakat (charity), fasting, al-Hajj and al-Wilayah. The call to no one of the other principles has been so emphatic as it was for al-Wilayah on the day of al-Ghadir (name of a place between Makka and Madina.)”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (113/ 7)"
        ],
        "index": 1491,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:13:9",
        "relations": {
          "Mentions": [
            "/books/quran:4:59"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ عِيسَى بْنِ السَّرِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) حَدِّثْنِي عَمَّا بُنِيَتْ عَلَيْهِ دَعَائِمُ الْإِسْلَامِ إِذَا أَنَا أَخَذْتُ بِهَا زَكَى عَمَلِي وَ لَمْ يَضُرَّنِي جَهْلُ مَا جَهِلْتُ بَعْدَهُ فَقَالَ شَهَادَةُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ الْإِقْرَارُ بِمَا جَاءَ بِهِ مِنْ عِنْدِ اللَّهِ وَ حَقٌّ فِي الْأَمْوَالِ مِنَ الزَّكَاةِ وَ الْوَلَايَةُ الَّتِي أَمَرَ اللَّهُ عَزَّ وَ جَلَّ بِهَا وَلَايَةُ آلِ مُحَمَّدٍ ( صلى الله عليه وآله ) فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ مَنْ مَاتَ وَ لَا يَعْرِفُ إِمَامَهُ مَاتَ مِيتَةً جَاهِلِيَّةً",
          "قَالَ اللَّهُ عَزَّ وَ جَلَّ أَطِيعُوا اللَّهَ وَ أَطِيعُوا الرَّسُولَ وَ أُولِي الْأَمْرِ مِنْكُمْ فَكَانَ عَلِيٌّ ( عليه السلام ) ثُمَّ صَارَ مِنْ بَعْدِهِ الْحَسَنُ ثُمَّ مِنْ بَعْدِهِ الْحُسَيْنُ ثُمَّ مِنْ بَعْدِهِ عَلِيُّ بْنُ الْحُسَيْنِ ثُمَّ مِنْ بَعْدِهِ مُحَمَّدُ بْنُ عَلِيٍّ ثُمَّ هَكَذَا يَكُونُ الْأَمْرُ إِنَّ الْأَرْضَ لَا تَصْلُحُ إِلَّا بِإِمَامٍ وَ مَنْ مَاتَ لَا يَعْرِفُ إِمَامَهُ مَاتَ مِيتَةً جَاهِلِيَّةً وَ أَحْوَجُ مَا يَكُونُ أَحَدُكُمْ إِلَى مَعْرِفَتِهِ إِذَا بَلَغَتْ نَفْسُهُ هَاهُنَا قَالَ وَ أَهْوَى بِيَدِهِ إِلَى صَدْرِهِ يَقُولُ حِينَئِذٍ لَقَدْ كُنْتُ عَلَى أَمْرٍ حَسَنٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Hammad Bin usman, from Isa Bin Al Sariy who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Narrate to me about what foundations Al-<span class=\"iTxt\">Islām</span> has been built upon, so that when I take with it, my deeds would be purified and ignorance of what I do not know would not harm me, after it’. So he<sup>asws</sup> said: ‘The testimony that there is no god except for Allah<sup>azwj</sup> and that Muhammad<sup>saww</sup> is Rasool<sup>saww</sup> of Allah<sup>azwj</sup>, and the acknowledgement with whatever he<sup>saww</sup> came with from the Presence of Allah<sup>azwj</sup>, and a right of <span class=\"iTxt\">Zakāt</span> in the wealth, and the <span class=\"iTxt\">Wilayah</span> which Allah<sup>azwj</sup> Mighty and Majestic Commanded with, the <span class=\"iTxt\">Wilayah</span> of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, for Rasool-Allah<sup>saww</sup> said: ‘The one who dies and did not recognise his Imam<sup>asws</sup> would have died a death of ‘جَاهِلِيَّةً’ (Kufr - the Pre-Islāmic period).",
            "Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h59\">[4:59]</a> Obey Allah and obey the Rasool and those in authority from among you</span>. So it was Ali<sup style=\"font-weight: normal\">asws</sup>, then it came to be after him<sup style=\"font-weight: normal\">asws</sup>, Al-Hasan<sup style=\"font-weight: normal\">asws</sup>. Then, from after him<sup style=\"font-weight: normal\">asws</sup>, Al-Husayn<sup style=\"font-weight: normal\">asws</sup>. Then from after him<sup style=\"font-weight: normal\">asws</sup>, Ali<sup style=\"font-weight: normal\">asws</sup> Bin Al-Husayn<sup style=\"font-weight: normal\">asws</sup>. Then from after him<sup style=\"font-weight: normal\">asws</sup>, Muhammad<sup style=\"font-weight: normal\">asws</sup> Bin Ali<sup style=\"font-weight: normal\">asws</sup>. Then that is how the matter happened to be. The earth would not be correct except with an Imam<sup style=\"font-weight: normal\">asws</sup>, and the one who dies without having recognised his Imam<sup style=\"font-weight: normal\">asws</sup> would have died the death of ‘جَاهِلِيَّةً’ (kufr - the Pre-<span class=\"iTxt\">Islām</span>ic period); and the neediest of what one of you will ever be to his<sup style=\"font-weight: normal\">asws</sup> recognition is when his soul reaches over here’. He (the narrator) said, ‘And he<sup style=\"font-weight: normal\">asws</sup> pointed by his<sup style=\"font-weight: normal\">asws</sup> hand to his<sup style=\"font-weight: normal\">asws</sup> chest’. He<sup style=\"font-weight: normal\">asws</sup> said: ‘He would be saying then, ‘I was upon a beautiful matter’."
          ],
          "en.sarwar": [
            "9. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from Hammad ibn ‘Uthman from ‘Isa al-Sariyy who has said the following: “Once I asked abu ‘Abd Allah (a.s.) to teach me the principles of Islam in such a way that on holding to them my deeds can take pure and correct form and thereafter the ignorance of whatever I am ignorant of cannot harm me. The Imam said, ‘Of the principles of Islam are to testify and acknowledge that no one deserves to be worshipped except Allah, and that Muhammad (a.s.) is the Messenger of Allah. Of such principles is to affirm and acknowledge that whatever he has brought is from Allah, to pay al-Zakat (charity) is a right and that al-Wilayah which Allah, the Most Majestic, the Most Holy, has commanded to accept and acknowledge is al-Wilayah (Divine Authority) of Ahl al-Bayt of Muhammad, recipient of divine supreme covenant. The Messenger of Allah has said, “Whoever dies while he does not know who his Imam is, he is considered as one who has died in the darkness of ignorance.” Allah, the Most Majestic, the Most Holy, has said, “Obey Allah, obey the Messenger of Allah and the persons among you who possess Divine Authority.” <a href=\"/#/books/quran:4#h59\">[4:59]</a>. Imam Ali was there (possessed Divine Authority) and after him were Imam Hassan, Imam Husayn and Ali ibn al-Husayn and after them was Muhammad ibn Ali, recipients of divine supreme covenant, successively and thus it will continue. The land will not take an ideal shape without an Imam. Whoever dies while he does not know who his Imam is, he is considered as one who has died in the darkness of ignorance. What everyone of you will need very urgently when his soul will reach here (pointing to his chest) is to know him (the Imam) so that he can say it is certain that I have been holding to a genuinely good matter.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/114)"
        ],
        "index": 1492,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:13:10",
        "text": [
          "عَنْهُ عَنْ أَبِي الْجَارُودِ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) يَا ابْنَ رَسُولِ اللَّهِ هَلْ تَعْرِفُ مَوَدَّتِي لَكُمْ وَ انْقِطَاعِي إِلَيْكُمْ وَ مُوَالَاتِي إِيَّاكُمْ قَالَ فَقَالَ نَعَمْ قَالَ فَقُلْتُ فَإِنِّي أَسْأَلُكَ مَسْأَلَةً تُجِيبُنِي فِيهَا فَإِنِّي مَكْفُوفُ الْبَصَرِ قَلِيلُ الْمَشْيِ وَ لَا أَسْتَطِيعُ زِيَارَتَكُمْ كُلَّ حِينٍ قَالَ هَاتِ حَاجَتَكَ قُلْتُ أَخْبِرْنِي بِدِينِكَ الَّذِي تَدِينُ اللَّهَ عَزَّ وَ جَلَّ بِهِ أَنْتَ وَ أَهْلُ بَيْتِكَ لِأَدِينَ اللَّهَ عَزَّ وَ جَلَّ بِهِ ",
          "قَالَ إِنْ كُنْتَ أَقْصَرْتَ الْخُطْبَةَ فَقَدْ أَعْظَمْتَ الْمَسْأَلَةَ وَ اللَّهِ لَأُعْطِيَنَّكَ دِينِي وَ دِينَ آبَائِيَ الَّذِي نَدِينُ اللَّهَ عَزَّ وَ جَلَّ بِهِ شَهَادَةَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ الْإِقْرَارَ بِمَا جَاءَ بِهِ مِنْ عِنْدِ اللَّهِ وَ الْوَلَايَةَ لِوَلِيِّنَا وَ الْبَرَاءَةَ مِنْ عَدُوِّنَا وَ التَّسْلِيمَ لِأَمْرِنَا وَ انْتِظَارَ قَائِمِنَا وَ الِاجْتِهَادَ وَ الْوَرَعَ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Abu Al Jaroud who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! Do you<sup>asws</sup> recognise my cordiality for you<sup>asws</sup> and my cutting-off (from others) towards you<sup>asws</sup> and my <span class=\"iTxt\">Wilayah</span> for you<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘Yes’. So I said, ‘So I would like to ask you<sup>asws</sup> a question. You<sup>asws</sup> answer me regarding it, for I am blind of vision, and little (ability for) walking, and are not able to visit you<sup>asws</sup> except every now and then’. He<sup>asws</sup> said: ‘Ask for your need’. I said, ‘Inform me of your<sup>asws</sup> Religion which you<sup>asws</sup> are making it to be as a Religion of Allah<sup>azwj</sup> Mighty and Majestic with, you<sup>asws</sup> and your<sup>asws</sup> family, as a Religion of Allah<sup>azwj</sup> Mighty and Majestic with’. ",
            "The Imam<sup>asws</sup> said: ‘Even though you have asked a short question but it spans over an extensive (subject). (However) by Allah<sup>azwj</sup>! I<sup>asws</sup> will give you my<sup>asws</sup> Religion and the Religion of my<sup>asws</sup> forefathers<sup>asws</sup> which we<sup>asws</sup> have embraced to be as a Religion of Allah<sup>azwj</sup> Mighty and Majestic with – The testimony that there is no god except for Allah<sup>azwj</sup> and that Muhammad<sup>saww</sup> is Rasool<sup>saww</sup> of Allah<sup>azwj</sup>, and the acknowledgement with whatever he<sup>saww</sup> came with from the Presence of Allah<sup>azwj</sup>, and the <span class=\"iTxt\">Wilayah</span> to befriend us<sup>asws</sup> (the 12 Imams<sup>asws</sup>) and disavow from our<sup>asws</sup> enemies, and the submission to our<sup>asws</sup> command, and awaiting our<sup>asws</sup> Qaim<sup>asws</sup>, and the striving and the piety’."
          ],
          "en.sarwar": [
            "10. It is narrated from him (Ali ibn Ibrahim) from abu al-Jarud who has said the following: “Once I asked abu Ja’far (a.s.) ‘Do you know, O child of the Messenger of Allah that I love you ( Ahl al-Bayt). that 1 have disassociated myself from other people to associate with you only and that I support you ( Ahl al-Bayt )?’ The Imam said, ‘Yes, I know it.’ 1 then said, ‘I ask you to answer my question; my eyes are restricted, I walk very little and I am not able to visit you except every now and then.’ The Imam said, ‘What is your question?’ I then said, ‘What is the religion by which you obey Allah, the Most Majestic, the Most Holy, and the religion that your Ahl al-Bayt follow so that I will also obey Allah, the Most Majestic, the Most Holy, by the rules of your religion?’ The Imam said, ‘Although your introduction was brief, your question is a great question. By Allah, I will certainly teach you my religion and the religion of my ancestors by the rules of which we worship Allah, the Most Majestic, the Most Holy. It is to testify that no one deserves to be worshipped except Allah, that Muhammad (a.s.) is the Messenger of Allah, and that whatever (message) he has brought is from Allah. That it is obligatory to love and support those who support and love us ( Ahl al-Bayt ) and disassociate from our enemies. That it is obligatory to obey our commands, cherish the hope for the coming of the one from us who will rise with Divine Authority and to strive hard ( Ijtihad) for progress in the matters of religion and live a life of piety, warn’ (stay away from sins).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/115)"
        ],
        "index": 1493,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:13:11",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُهُ يَسْأَلُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لَهُ جُعِلْتُ فِدَاكَ أَخْبِرْنِي عَنِ الدِّينِ الَّذِي افْتَرَضَ اللَّهُ عَزَّ وَ جَلَّ عَلَى الْعِبَادِ مَا لَا يَسَعُهُمْ جَهْلُهُ وَ لَا يُقْبَلُ مِنْهُمْ غَيْرُهُ مَا هُوَ فَقَالَ أَعِدْ عَلَيَّ فَأَعَادَ عَلَيْهِ فَقَالَ شَهَادَةُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ إِقَامُ الصَّلَاةِ وَ إِيتَاءُ الزَّكَاةِ وَ حِجُّ الْبَيْتِ مَنِ اسْتَطَاعَ إِلَيْهِ سَبِيلًا وَ صَوْمُ شَهْرِ رَمَضَانَ ",
          "ثُمَّ سَكَتَ قَلِيلًا ثُمَّ قَالَ وَ الْوَلَايَةُ مَرَّتَيْنِ ثُمَّ قَالَ هَذَا الَّذِي فَرَضَ اللَّهُ عَلَى الْعِبَادِ وَ لَا يَسْأَلُ الرَّبُّ الْعِبَادَ يَوْمَ الْقِيَامَةِ فَيَقُولَ أَلَّا زِدْتَنِي عَلَى مَا افْتَرَضْتُ عَلَيْكَ وَ لَكِنْ مَنْ زَادَ زَادَهُ اللَّهُ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) سَنَّ سُنَناً حَسَنَةً جَمِيلَةً يَنْبَغِي لِلنَّاسِ الْأَخْذُ بِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Salih Bin Al Sindiy, from Ja’far Bin Bashir, from Ali Bin Abu Hamza, from Abu Baseer who said, ",
            "‘I heard him asking Abu Abdullah<sup>asws</sup>, so he said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Inform me about the Religion which Allah<sup>azwj</sup> Mighty and Majestic Necessitated upon the servants what they have no leeway for being ignorant of it, nor would anything else be Accepted from them. What is it?’ He<sup>asws</sup> said: ‘Repeat it to me<sup>asws</sup>’. So he repeated to him<sup>asws</sup>. So he<sup>asws</sup> said: ‘The testimony that there is no god except for Allah<sup>azwj</sup> and that Muhammad<sup>saww</sup> is Rasool<sup>saww</sup> of Allah<sup>azwj</sup>, and establishing the <span class=\"iTxt\">Salāt</span>, and giving the <span class=\"iTxt\">Zakāt</span>, and <span class=\"iTxt\">Hajj</span> of the House (Kabah) by the one who has the capacity for a way to it, and Fasting the Month of Ramazan’. ",
            "Then he<sup>asws</sup> was silent for a while, then said: ‘And the <span class=\"iTxt\">Wilayah</span>’, twice. Then he<sup>asws</sup> said: ‘This is which Allah<sup>azwj</sup> Necessitated upon the servant, and the Lord<sup>azwj</sup> will not Ask the servants on the Day of Judgement: “Why did you not increase upon what I<sup>azwj</sup> Necessitate upon you?” But, the one who increases (the deeds), Allah<sup>azwj</sup> would Increase (for) him (the Rewards). Rasool-Allah<sup>saww</sup> made a Sunnah, a beautiful Sunnah. It is befitting for the people to take by it’."
          ],
          "en.sarwar": [
            "11. Ali ibn Ibrahim has narrated from Salih ibn al-Sindy from Ja’far ibn al-Bashir from Ali ibn abu Hamza from abu Basir who has said the following: “Once I heard abu Basir asking abu ‘Abd Allah (a.s.) ‘May Allah keep my soul in service for your cause, teach me the religion that Allah, the Most Majestic, the Most Holy, has made obligatory for people to follow. Teach me the religion of which they must not remain ignorant and besides which no other religion is accepted. What is this religion?’ The Imam said, ‘Repeat your question.’ He repeated his question. The Imam said, ‘It (such religion) is to testify that no one else deserves to be worshipped except Allah, that Muhammad (a.s.) is the Messenger of Allah, and that it is obligatory to perform prayer, pay al-Zakat (charity), perform Hajj of the House if one has the ability and fast in the month of Ramadan.’ Then he remained silent for a little while and said twice, “ Al-Wilayah .” He then said, ‘This is what Allah has made obligatory upon His servants. The Lord on the Day of Judgment will not sk His servants why you have not done more than what I had made obligatory upon you. However, if someone does more good deeds Allah will grant him additional rewards. The Messenger of Allah has set up noble and beautiful traditions and it is very good for the people to practice them all.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/116)"
        ],
        "index": 1494,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:13:12",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ أَبِي زَيْدٍ الْحَلَّالِ عَنْ عَبْدِ الْحَمِيدِ بْنِ أَبِي الْعَلَاءِ الْأَزْدِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ اللَّهَ عَزَّ وَ جَلَّ فَرَضَ عَلَى خَلْقِهِ خَمْساً فَرَخَّصَ فِي أَرْبَعٍ وَ لَمْ يُرَخِّصْ فِي وَاحِدَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Jamhour, from Fazalat Bin Ayoub, from Abu Zayd Al Hallali, from Abdul Hameed Bin Abu Al A’ala Al Azdy who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying that Allah<sup>azwj</sup> Mighty and Majestic Imposed five (matters) upon His<sup>azwj</sup> creatures, so He<sup>azwj</sup> has (Given them an) allowance regarding four, but did not (Given them an) allowance regarding one (Al-<span class=\"iTxt\">Wilayah</span>)’."
          ],
          "en.sarwar": [
            "12. Al-Husayn ibn Muhammad has narrated from Mu’ alia ibn Muhammad from Muhammad ibn Jumhur from Fadalah ibn Ayyub from abu Zayd al-Hallal from ‘Abd al-Hamid ibn abu al-‘Ala’ al-Azdi who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘Allah, the Most Majestic, the Most Holy, has made five things obligatory upon His creatures. He has given them permission in four but in one of them He has not given permission.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/117)"
        ],
        "index": 1495,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:13:13",
        "text": [
          "عَنْهُ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَبَانٍ عَنْ إِسْمَاعِيلَ الْجُعْفِيِّ قَالَ دَخَلَ رَجُلٌ عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) وَ مَعَهُ صَحِيفَةٌ فَقَالَ لَهُ أَبُو جَعْفَرٍ ( عليه السلام ) هَذِهِ صَحِيفَةُ مُخَاصِمٍ يَسْأَلُ عَنِ الدِّينِ الَّذِي يُقْبَلُ فِيهِ الْعَمَلُ فَقَالَ رَحِمَكَ اللَّهُ هَذَا الَّذِي أُرِيدُ ",
          "فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) شَهَادَةُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَنَّ مُحَمَّداً ( صلى الله عليه وآله ) عَبْدُهُ وَ رَسُولُهُ وَ تُقِرَّ بِمَا جَاءَ مِنْ عِنْدِ اللَّهِ وَ الْوَلَايَةُ لَنَا أَهْلَ الْبَيْتِ وَ الْبَرَاءَةُ مِنْ عَدُوِّنَا وَ التَّسْلِيمُ لِأَمْرِنَا وَ الْوَرَعُ وَ التَّوَاضُعُ وَ انْتِظَارُ قَائِمِنَا فَإِنَّ لَنَا دَوْلَةً إِذَا شَاءَ اللَّهُ جَاءَ بِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Moalla Bin Muhammad, from Al Washa, from Aban, from Ismail Al Ju’fy who said, ",
            "‘A man came over to Abu Ja’far<sup>asws</sup> and with him<sup>asws</sup> was a sheet of paper. So Abu Ja’far<sup>asws</sup> said to him: ‘This here is a paper of an adversary asking about the Religion in which the deeds are Accepted’. So he said, ‘May Allah<sup>azwj</sup> have Mercy on you<sup>asws</sup>! (He said) this is what I want (to know)’. ",
            "So Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> said: ‘The testimony that there is no god except for Allah<sup style=\"font-weight: normal\">azwj</sup> Alone, there being no associates for Him<sup style=\"font-weight: normal\">azwj</sup>, and that Muhammad<sup style=\"font-weight: normal\">saww</sup> is His<sup style=\"font-weight: normal\">azwj</sup> servant, and His<sup style=\"font-weight: normal\">azwj</sup> Rasool<sup style=\"font-weight: normal\">saww</sup>, and you acknowledge with whatever he<sup style=\"font-weight: normal\">saww</sup> came from the Presence of Allah<sup style=\"font-weight: normal\">azwj</sup>, and the <span class=\"iTxt\">Wilayah</span> for us<sup style=\"font-weight: normal\">asws</sup>, the People<sup style=\"font-weight: normal\">asws</sup> of the Household, and the disavowment from our<sup style=\"font-weight: normal\">asws</sup> enemies, and the submission to our<sup style=\"font-weight: normal\">asws</sup> command, and the piety, and the revenerence, and awaiting our<sup style=\"font-weight: normal\">asws</sup> Qaim<sup style=\"font-weight: normal\">asws</sup>, so when there is a government for us<sup style=\"font-weight: normal\">asws</sup> when Allah<sup style=\"font-weight: normal\">azwj</sup> so Desires, he<sup style=\"font-weight: normal\">asws</sup> would come with it’."
          ],
          "en.sarwar": [
            "13. It is narrated from him (narrator of the Hadith above) from Mu’alla ibn Muhammad from al-Washsha’ from Aban from Isma’il al-Ja’fi who has said the following: “Once a man came to abu Ja’far, recipient of divine supreme covenant. He had a book with him. Abu Ja’far said, ‘This is the book of a polemicist who wants to learn a religion that if followed ones deeds are accepted.’ The man said, ‘May the blessings of Allah be with you, this is exactly what I want.’ Abu Ja’far (a.s.) said, ‘Such religion is to testify that no one deserves to be worshipped except Allah, Who has no partners. That Muhammad (a.s.) is His servant and Messenger. And that you affirm and acknowledge that whatever he has brought is from Allah. That one has love (in his heart) for us, Ahl al-Bayt, and disassociates himself from our enemies, obeys our commands, maintains piety and humbleness in life and has hope in the rise from us of one with the Divine Authority. For us there is a government and he will establish it when Allah wills.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (117/ 7)"
        ],
        "index": 1496,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:13:14",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ جَمِيعاً عَنْ صَفْوَانَ عَنْ عَمْرِو بْنِ حُرَيْثٍ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ هُوَ فِي مَنْزِلِ أَخِيهِ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ مَا حَوَّلَكَ إِلَى هَذَا الْمَنْزِلِ قَالَ طَلَبُ النُّزْهَةِ فَقُلْتُ جُعِلْتُ فِدَاكَ أَ لَا أَقُصُّ عَلَيْكَ دِينِي فَقَالَ بَلَى",
          "قُلْتُ أَدِينُ اللَّهَ بِشَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ وَ أَنَّ السَّاعَةَ آتِيَةٌ لَا رَيْبَ فِيهَا وَ أَنَّ اللَّهَ يَبْعَثُ مَنْ فِي الْقُبُورِ وَ إِقَامِ الصَّلَاةِ وَ إِيتَاءِ الزَّكَاةِ وَ صَوْمِ شَهْرِ رَمَضَانَ وَ حِجِّ الْبَيْتِ وَ الْوَلَايَةِ لِعَلِيٍّ أَمِيرِ الْمُؤْمِنِينَ بَعْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ الْوَلَايَةِ لِلْحَسَنِ وَ الْحُسَيْنِ وَ الْوَلَايَةِ لِعَلِيِّ بْنِ الْحُسَيْنِ وَ الْوَلَايَةِ لِمُحَمَّدِ بْنِ عَلِيٍّ وَ لَكَ مِنْ بَعْدِهِ صَلَوَاتُ اللَّهِ عَلَيْهِمْ أَجْمَعِينَ وَ أَنَّكُمْ أَئِمَّتِي عَلَيْهِ أَحْيَا وَ عَلَيْهِ أَمُوتُ وَ أَدِينُ اللَّهَ بِهِ",
          "فَقَالَ يَا عَمْرُو هَذَا وَ اللَّهِ دِينُ اللَّهِ وَ دِينُ آبَائِيَ الَّذِي أَدِينُ اللَّهَ بِهِ فِي السِّرِّ وَ الْعَلَانِيَةِ فَاتَّقِ اللَّهَ وَ كُفَّ لِسَانَكَ إِلَّا مِنْ خَيْرٍ وَ لَا تَقُلْ إِنِّي هَدَيْتُ نَفْسِي بَلِ اللَّهُ هَدَاكَ فَأَدِّ شُكْرَ مَا أَنْعَمَ اللَّهُ عَزَّ وَ جَلَّ بِهِ عَلَيْكَ وَ لَا تَكُنْ مِمَّنْ إِذَا أَقْبَلَ طُعِنَ فِي عَيْنِهِ وَ إِذَا أَدْبَرَ طُعِنَ فِي قَفَاهُ وَ لَا تَحْمِلِ النَّاسَ عَلَى كَاهِلِكَ فَإِنَّكَ أَوْشَكَ إِنْ حَمَلْتَ النَّاسَ عَلَى كَاهِلِكَ أَنْ يُصَدِّعُوا شَعَبَ كَاهِلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Abu Ali Al Ashary, from Muhammad Bin Abdu Jabbar, altogether from Safwan, from Amro Bin Hureys who said, ",
            "‘I went over to Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> and he<sup style=\"font-weight: normal\">asws</sup> was in the house of his<sup style=\"font-weight: normal\">asws</sup> brother Abdullah son of Muhammad (Al-Baqir)<sup style=\"font-weight: normal\">asws</sup>. So I said to him<sup style=\"font-weight: normal\">asws</sup>, ‘May I be sacrificed for you<sup style=\"font-weight: normal\">asws</sup>! What made you<sup style=\"font-weight: normal\">asws</sup> to transfer to this house?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘Seeking the solitude’. So I said, ‘May I be sacrificed for you<sup style=\"font-weight: normal\">asws</sup>! Shall I relate my Religion to you<sup style=\"font-weight: normal\">asws</sup>?’ So he<sup style=\"font-weight: normal\">asws</sup> said: ‘Yes’. ",
            "I said, ‘I make a Religion of Allah<sup style=\"font-weight: normal\">azwj</sup> with the testimony that there is no god except for Allah<sup style=\"font-weight: normal\">azwj</sup> Alone, there being no associates for Him<sup style=\"font-weight: normal\">azwj</sup>, and that Muhammad<sup style=\"font-weight: normal\">saww</sup> is His<sup style=\"font-weight: normal\">azwj</sup> servant, and that the Hour is coming, there being no doubt in it, and that Allah<sup style=\"font-weight: normal\">azwj</sup> would be Resurrecting the ones in the graves, and to establish the <span class=\"iTxt\">Salāt</span>, and to give the <span class=\"iTxt\">Zakāt</span>, and (to observe) <span class=\"iTxt\">Soām</span> the Month of Ramazan, and <span class=\"iTxt\">Hajj</span> of the House (Kabah), and the <span class=\"iTxt\">Wilayah</span> of Ali<sup style=\"font-weight: normal\">asws</sup> Amir Al-Momineen<sup style=\"font-weight: normal\">asws</sup> after Rasool-Allah<sup style=\"font-weight: normal\">saww</sup>, and the <span class=\"iTxt\">Wilayah</span> of Al-Hassan<sup style=\"font-weight: normal\">asws</sup> and Al-Husayn<sup style=\"font-weight: normal\">asws</sup>, and the <span class=\"iTxt\">Wilayah</span> of Ali<sup style=\"font-weight: normal\">asws</sup> Bin Al-Husayn<sup style=\"font-weight: normal\">asws</sup>, and the <span class=\"iTxt\">Wilayah</span> of Muhammad<sup style=\"font-weight: normal\">asws</sup> Bin Ali<sup style=\"font-weight: normal\">asws</sup>, and for you<sup style=\"font-weight: normal\">asws</sup> from after him<sup style=\"font-weight: normal\">asws</sup>, and you<sup style=\"font-weight: normal\">asws</sup> all are my Imams<sup style=\"font-weight: normal\">asws</sup>, upon it I do live and upon it I would be dying, and I make a Religion of Allah<sup style=\"font-weight: normal\">azwj</sup> by it’.",
            "So he<sup style=\"font-weight: normal\">asws</sup> said: ‘O Amro! And this, by Allah<sup style=\"font-weight: normal\">azwj</sup>, is the Religion of Allah<sup style=\"font-weight: normal\">azwj</sup> and the Religion of my<sup style=\"font-weight: normal\">asws</sup> forefathers<sup style=\"font-weight: normal\">asws</sup> which they<sup style=\"font-weight: normal\">asws</sup> made as a Religion of Allah<sup style=\"font-weight: normal\">azwj</sup> with in the privacy and the publicly. Therefore fear Allah<sup style=\"font-weight: normal\">azwj</sup> and restrain your tongue except from goodness, and do not say, ‘I have guided myself’, but Allah<sup style=\"font-weight: normal\">azwj</sup> Guided you. Therefore thank Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic for the Favoured He<sup style=\"font-weight: normal\">azwj</sup> has Done to you, and do not become from the ones who when he faces forwards, the gets hit in his eye, and when he turns backwards, he gets stabbed in his neck, and do not carry the people upon your shoulders. So if you do carry the people upon your shoulders, they cause injury to your shoulders’."
          ],
          "en.sarwar": [
            "14. Ali ibn Ibrahim has narrated from his father and abu Ali al-Ash’ari from Muhammad ibn ‘Abd al-Jabbar all of them from Safwan from ‘Amr ibn Harith who has said the following: “Once I went to see abu ‘Abd Allah (a.s.) and he was in the house of his brother, ‘Abd Allah ibn Muhammad, and I said, ‘May Allah keep my soul in service for your cause, what has brought you to this house?’ ‘Seeking privacy,’ said the Imam. I said, ‘May Allah keep my soul in service for your cause, can I state before you my religion?’ The Imam said, ‘Yes, you may do so.’ I then said, ‘I follow a religion (that requires me) to obey Allah and testify that no one else deserves to be worshipped except Allah Who has no partners. That Muhammad (a.s.) is His servant and messenger, that the Hour (of reckoning) will certainly come, that Allah will bring all people from their graves, that it is obligatory to pray, pay Zakat (charity), fast in the month of Ramadan and perform Hajj of the House. I affirm and acknowledge the Divine Authority of Ali ibn abu Talib after the Messenger of Allah, the Divine Authority of al-Hassan, al- Husayn, the Divine Authority of Ali ibn al-Husayn, the Divine Authority of Muhammad ibn Ali and your Divine Authority after him (your father), recipients of divine supreme covenant. You are my Imam. With such beliefs I live and with them I will die and such is my religion before Allah.’ The Imam said, ‘Such, O ‘Amr, I swear by Allah, is the religion of Allah and the religion of my ancestors and such is the religion that 1 follow to obey Allah in private and in public. Maintain piety before Allah and hold your tongue except from good and do not say, “I have guided myself.” In fact, Allah has guided you. Give thanks to Allah, the Most Majestic, the Most Holy, for the favor that He has done to you. Do not be of those who on their moving forward are hit in the eyes or when moving backwards are hit from the back. Do not allow people ride on your shoulders for if you do so they cause injury to your shoulders.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (119/ 7)"
        ],
        "index": 1497,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:13:15",
        "relations": {
          "Mentions": [
            "/books/quran:32:16"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنِ ابْنِ مُسْكَانَ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ أَ لَا أُخْبِرُكَ بِالْإِسْلَامِ أَصْلِهِ وَ فَرْعِهِ وَ ذِرْوَةِ سَنَامِهِ قُلْتُ بَلَى جُعِلْتُ فِدَاكَ قَالَ أَمَّا أَصْلُهُ فَالصَّلَاةُ وَ فَرْعُهُ الزَّكَاةُ وَ ذِرْوَةُ سَنَامِهِ الْجِهَادُ ",
          "ثُمَّ قَالَ إِنْ شِئْتَ أَخْبَرْتُكَ بِأَبْوَابِ الْخَيْرِ قُلْتُ نَعَمْ جُعِلْتُ فِدَاكَ قَالَ الصَّوْمُ جُنَّةٌ مِنَ النَّارِ وَ الصَّدَقَةُ تَذْهَبُ بِالْخَطِيئَةِ وَ قِيَامُ الرَّجُلِ فِي جَوْفِ اللَّيْلِ بِذِكْرِ اللَّهِ ثُمَّ قَرَأَ ( عليه السلام ) تَتَجافى جُنُوبُهُمْ عَنِ الْمَضاجِعِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Nu’man, from Ibn Muskan, from Suleyman Bin Khalid, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Shall I inform you with Al-<span class=\"iTxt\">Islām</span>, its roots, and its branches, and the peak of its hump’. I said, ‘Yes, may I be sacrificed for you<sup>asws</sup>!’ He<sup>asws</sup> said: ‘As for its root, so it is the <span class=\"iTxt\">Salāt</span>, and its branch is the <span class=\"iTxt\">Zakāt</span>, and the peak of its hump is the <span class=\"iTxt\">Jihād</span>’. ",
            "Then he<sup>asws</sup> said: ‘If you so desire, I<sup>asws</sup> can inform you about the doors of goodness’. I said, ‘Yes, may I be sacrificed for you<sup>asws</sup>’. He<sup>asws</sup> said: ‘The <span class=\"iTxt\">Soām</span> is a shield from the Fire, and the charity eradicates the mistakes, and the standing of the man in the middle of the night with the Remembrance of Allah<sup>azwj</sup>’. Then he<sup>asws</sup> recited <span class=\"ibTxt\"><a href=\"/#/books/quran:32#h16\">[32:16]</a> Their sides forsake their beds</span>’."
          ],
          "en.sarwar": [
            "15. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Ni’man from ibn Maskan from Sulayman ibn Khalid from abu Ja’far recipient of divine supreme covenant, who has said the following: “Do you want me to teach you the root of Islam, its branch and its peak? I said, ‘Yes, may Allah take my soul in service for your cause.’ The Imam said, ‘Its root is prayer, its branch is al-Zakat (charity) and its peak is Jihad (the hard work in defense and preaching of the belief).’ The Imam then said, ‘If you want 1 can teach you about the gates to all good.’ I said, ‘Yes, please, May Allah keep my soul in service for your cause, do so.’ “The Imam said, ‘Fasting is a shield against fire, charity removes sins and of the gates to good is to stand up (for worship) during the night to speak of Allah.’ He then read (the words of Allah) ‘They do not allow their sides to rest in bed (but they stand up at night to pray to Allah).”’ <a href=\"/#/books/quran:32#h16\">[32:16]</a> "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:13",
  "kind": "verse_list"
}