{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:2:1", "titles": {"ar": "كتاب الإيمان و الكفر", "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"}}, {"indexed_titles": {"en": "Chapter 138"}, "path": "/books/al-kafi:2:1:138", "titles": {"ar": "بَابُ الْمَكْرِ وَ الْغَدْرِ وَ الْخَدِيعَةِ", "en": "Chapter 138 – The Plotting and the Treachery and the Deception"}}], "index": 326, "local_index": 138, "part_type": "Chapter", "path": "/books/al-kafi:2:1:138", "titles": {"ar": "بَابُ الْمَكْرِ وَ الْغَدْرِ وَ الْخَدِيعَةِ", "en": "Chapter 138 – The Plotting and the Treachery and the Deception"}, "verse_count": 6, "verse_start_index": 2665, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 2666, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:1:138:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ رَفَعَهُ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) لَوْ لَا أَنَّ الْمَكْرَ وَ الْخَدِيعَةَ فِي النَّارِ لَكُنْتُ أَمْكَرَ النَّاسِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, raising it who said, ", "‘Amir Al-<span class=\"iTxt\">Momin</span>een<sup>asws</sup> said: ‘Had it not been that the plotting and the deception would be in the Fire, I<sup>asws</sup> would have been the most skilful in evil planning’."]}}, {"index": 2667, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:1:138:2", "text": ["عَلِيٌّ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَجِي‏ءُ كُلُّ غَادِرٍ يَوْمَ الْقِيَامَةِ بِإِمَامٍ مَائِلٍ شِدْقُهُ حَتَّى يَدْخُلَ النَّارَ وَ يَجِي‏ءُ كُلُّ نَاكِثٍ بَيْعَةَ إِمَامٍ أَجْذَمَ حَتَّى يَدْخُلَ النَّارَ ."], "translations": {"en.hubeali": ["Ali, from his father, from Al Nowfaly, from Al Sakuny, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Every treacherous one would come on the Day of Judgment with an imam (leader), with a lopsided mouth until he enters the Fire; and every breaker of the allegiance to an Imam<sup>asws</sup> would come as a leper (mutilated) until he enters the Fire’."]}}, {"index": 2668, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:2:1:138:3", "text": ["عَنْهُ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَيْسَ مِنَّا مَنْ مَاكَرَ مُسْلِماً ."], "translations": {"en.hubeali": ["From him, from his father, from Al Nowfaly, from Al Sakuny, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘He is not from us<sup>saww</sup> the one who plots against a Muslim’."]}}, {"index": 2669, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:2:1:138:4", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَرْيَتَيْنِ مِنْ أَهْلِ الْحَرْبِ لِكُلِّ وَاحِدَةٍ مِنْهُمَا مَلِكٌ عَلَى حِدَةٍ اقْتَتَلُوا ثُمَّ اصْطَلَحُوا ثُمَّ إِنَّ أَحَدَ الْمَلِكَيْنِ غَدَرَ بِصَاحِبِهِ فَجَاءَ إِلَى الْمُسْلِمِينَ فَصَالَحَهُمْ عَلَى أَنْ يَغْزُوَ مَعَهُمْ تِلْكَ الْمَدِينَةَ ", "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَا يَنْبَغِي لِلْمُسْلِمِينَ أَنْ يَغْدِرُوا وَ لَا يَأْمُرُوا بِالْغَدْرِ وَ لَا يُقَاتِلُوا مَعَ الَّذِينَ غَدَرُوا وَ لَكِنَّهُمْ يُقَاتِلُونَ الْمُشْرِكِينَ حَيْثُ وَجَدُوهُمْ وَ لَا يَجُوزُ عَلَيْهِمْ مَا عَاهَدَ عَلَيْهِ الْكُفَّارُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Yahya, from Talha Bin Zayd, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about two towns from the people of war, for each of them being a king upon a border. They fought then they reconciled. Then one of the two kings betrayed his companion, so he came over to the Muslims and reconciled with them upon that he would carry out a military expedition along with them for that city (of the other king)’. ", "So Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> said: ‘It is not befitting for the Muslims that they should be treacherous, nor should they be instructing others with the treachery, nor should they be fighting alongside those who are treacherous. But, they should be fighting against the Polytheists wherever they find them, nor is it allowed upon them what the disbelievers pact upon them’."]}}, {"index": 2670, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:2:1:138:5", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْأَشْعَثِ عَنْ عَبْدِ اللَّهِ بْنِ حَمَّادٍ الْأَنْصَارِيِّ عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ الْحَسَنِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَجِي‏ءُ كُلُّ غَادِرٍ بِإِمَامٍ يَوْمَ الْقِيَامَةِ مَائِلًا شِدْقُهُ حَتَّى يَدْخُلَ النَّارَ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Al Hassan, from Muhammad Bin Al Hassan Bin Shamoun, from Abdullah Bin Amro Bin Al Ash’as, from Abdullah Bin Hammad Al Ansary, from Yahya Bin Abdullah Bin Al Hassan, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Every treacherous one would come with an imam on the Day of Judgment, with a lopsided mouth until he enters the Fire’."]}}, {"index": 2671, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:2:1:138:6", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ عَمِّهِ يَعْقُوبَ بْنِ سَالِمٍ عَنْ أَبِي الْحَسَنِ الْعَبْدِيِّ عَنْ سَعْدِ بْنِ طَرِيفٍ عَنِ الْأَصْبَغِ بْنِ نُبَاتَةَ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) ذَاتَ يَوْمٍ وَ هُوَ يَخْطُبُ عَلَى الْمِنْبَرِ بِالْكُوفَةِ يَا أَيُّهَا النَّاسُ لَوْ لَا كَرَاهِيَةُ الْغَدْرِ كُنْتُ مِنْ أَدْهَى النَّاسِ أَلَا إِنَّ لِكُلِّ غُدَرَةٍ فُجَرَةً وَ لِكُلِّ فُجَرَةٍ كُفَرَةً أَلَا وَ إِنَّ الْغَدْرَ وَ الْفُجُورَ وَ الْخِيَانَةَ فِي النَّارِ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ali Bin Asbaat, from his uncle Yaqoub Bin Salim, from Abu Al Hassan Al Abady, from Sa’d Bin Tareyf, from Al Asbagh Bin Nubata who said, ", "‘Amir Al-<span class=\"iTxt\">Momin</span>een<sup>asws</sup> said one day, and he<sup>asws</sup> was addressing upon the Pulpit at Al-Kufa: ‘O you people! Had it not been for my<sup>asws</sup> abhorrence of the treachery, I<sup>asws</sup> would have been the craftiest of the people. Indeed! For every treachery there is an immorality, and for every immorality there is disbelief. Indeed! And the treachery, and the immorality, and the betrayal would be in the Fire’."]}}]}, "index": "al-kafi:2:1:138", "kind": "verse_list"}