{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 141"
        },
        "path": "/books/al-kafi:2:1:141",
        "titles": {
          "ar": "بَابُ الْهِجْرَةِ",
          "en": "Chapter 141 – The Desertion"
        }
      }
    ],
    "index": 329,
    "local_index": 141,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 142"
        },
        "path": "/books/al-kafi:2:1:142",
        "titles": {
          "ar": "بَابُ قَطِيعَةِ الرَّحِمِ",
          "en": "Chapter 142 – Severing the relationships"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 140"
        },
        "path": "/books/al-kafi:2:1:140",
        "titles": {
          "ar": "بَابُ ذِي اللِّسَانَيْنِ",
          "en": "Chapter 140 – The Two-tongued (Duplicity)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:141",
    "titles": {
      "ar": "بَابُ الْهِجْرَةِ",
      "en": "Chapter 141 – The Desertion"
    },
    "verse_count": 7,
    "verse_start_index": 2696,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/359)"
        ],
        "index": 2697,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:141:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنِ الْقَاسِمِ بْنِ الرَّبِيعِ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ رَفَعَهُ قَالَ فِي وَصِيَّةِ الْمُفَضَّلِ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ لَا يَفْتَرِقُ رَجُلَانِ عَلَى الْهِجْرَانِ إِلَّا اسْتَوْجَبَ أَحَدُهُمَا الْبَرَاءَةَ وَ اللَّعْنَةَ وَ رُبَّمَا اسْتَحَقَّ ذَلِكَ كِلَاهُمَا ",
          "فَقَالَ لَهُ مُعَتِّبٌ جَعَلَنِيَ اللَّهُ فِدَاكَ هَذَا الظَّالِمُ فَمَا بَالُ الْمَظْلُومِ قَالَ لِأَنَّهُ لَا يَدْعُو أَخَاهُ إِلَى صِلَتِهِ وَ لَا يَتَغَامَسُ لَهُ عَنْ كَلَامِهِ سَمِعْتُ أَبِي يَقُولُ إِذَا تَنَازَعَ اثْنَانِ فَعَازَّ أَحَدُهُمَا الْآخَرَ فَلْيَرْجِعِ الْمَظْلُومُ إِلَى صَاحِبِهِ حَتَّى يَقُولَ لِصَاحِبِهِ أَيْ أَخِي أَنَا الظَّالِمُ حَتَّى يَقْطَعَ الْهِجْرَانَ بَيْنَهُ وَ بَيْنَ صَاحِبِهِ فَإِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى حَكَمٌ عَدْلٌ يَأْخُذُ لِلْمَظْلُومِ مِنَ الظَّالِمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Ja’far Bin Muhammad, from Al Qasim Bin Al Rabie, and a number of our companions, from Ahmad Bin Muhammad Bin Khalid, raising it, said, ",
            "‘In a bequest of Al-Mufazzal, I heard Abu Abdullah<sup>asws</sup> saying: ‘No two men would separate upon the desertion except upon one of the two would Obligate the disowning and the cursing, and sometimes both of them deserve that’. ",
            "So Mo’tab said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! This is the unjust one, so what is the matter with the oppressed one?’ He<sup>asws</sup> said: ‘Because he did not leave his brother to good relations nor did he overlook from his speech. I<sup>asws</sup> heard my<sup>asws</sup> father<sup>asws</sup> saying: ‘When two (people) dispute, so one overpowers the other, so let the oppressed return to his companion until he is saying to his companion, ‘Yes, my brother, I am the unjust’, until he cuts-off the fleeing between him and his companion, for Allah<sup>azwj</sup> Blessed and High Judges justly. He<sup>azwj</sup> Seizes for the oppressed, from the oppressor’."
          ],
          "en.sarwar": [
            "1. Al-Husayn ibn Muhammad has narrated from Ja’far ibn Muhammad from al- Qasim ibn al-Rabi’ and certain individuals of our people from Ahmad ibn Muhammad ibn Khalid in a marfu’ manner it is in the advice to al-Mufaddal who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘Of the two people who depart each other to abandon and walk out on each other, one is subject to disowning and condemnation or perhaps both of them will face such conditions.’ Mu’attib then said, ‘May Allah keep my soul in service for your cause, one is unjust, what about the oppressed?’ The Imam said, ‘It is because he did not ask his brother (in belief) to maintain good brotherly relations and did not ignore his words. I heard my father saying, “Whenever two people dispute and one of them over power the other, the oppressed should turn to his companion and say to him, ‘O brother (in belief), I am the unjust,”’ so that forsaking and abandonment would not take place among them. Allah, the Most Blessed, the Most High, is the Judge with justice, He judges with justice for the oppressed against the oppressor.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/360)"
        ],
        "index": 2698,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:141:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَا هِجْرَةَ فَوْقَ ثَلَاثٍ "
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Ibn Abu Umeyr, from Hisham Bin Al Hakam, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘There should be no desertion (ceasing of relationship) for more than three (days)’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Isma’il from Fadl ibn Shadhan from ibn abu ‘Umayr from Hisham ibn al-Hakam from abu ‘Abd Allah (a.s.) who has said the following: “The Messenger of Allah has said, ‘(Due to) walking out on another person (separation) should not continue more than three days.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/360)"
        ],
        "index": 2699,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:141:3",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ وُهَيْبِ بْنِ حَفْصٍ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَصْرِمُ ذَوِي قَرَابَتِهِ مِمَّنْ لَا يَعْرِفُ الْحَقَّ قَالَ لَا يَنْبَغِي لَهُ أَنْ يَصْرِمَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from Wuheyb Bin Hafs, from Abu Baseer who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man forsakes his relatives, from the ones who do not recognise the Truth. He<sup>asws</sup> said: ‘It is not befitting for him that he abandon them’."
          ],
          "en.sarwar": [
            "3. Hamid ibn Ziyad has narrated from al-Hassan ibn Muhammad ibn Sama’a from Wuhayb ibn Hafs from abu Basir who has said the following: “Once I asked abu ‘Abd Allah (a.s.) about a man who has forsaken his relatives who do not recognize the truth.’ The Imam said, ‘It is not proper for him to abandon them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/361)"
        ],
        "index": 2700,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:141:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ عَمِّهِ مُرَازِمِ بْنِ حَكِيمٍ قَالَ كَانَ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) رَجُلٌ مِنْ أَصْحَابِنَا يُلَقَّبُ شَلَقَانَ وَ كَانَ قَدْ صَيَّرَهُ فِي نَفَقَتِهِ وَ كَانَ سَيِّئَ الْخُلُقِ فَهَجَرَهُ فَقَالَ لِي يَوْماً يَا مُرَازِمُ وَ تُكَلِّمُ عِيسَى فَقُلْتُ نَعَمْ فَقَالَ أَصَبْتَ لَا خَيْرَ فِي الْمُهَاجَرَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Hadeed, from his uncle Murazim Bin Hakeem who said, ",
            "‘It was so that in the presence of Abu Abdullah<sup>asws</sup> was a man from our companions titled as Shalqaan, and he<sup>asws</sup> had made him to be in charge regarding his<sup>asws</sup> finances, and he was of the evil manners, but he had deserted him<sup>asws</sup>. So he<sup>asws</sup> said to me one day: ‘O murazim, and do you speak to Isa (Shalqaan)?’ So I said, ‘Yes’. So he<sup>asws</sup> said: ‘You are correct. There is no goodness in the desertion’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Ahmad ibn Muhammad from Ali ibn Hadid from his uncle, Murazim ibn Hakim who has said the following: “In the presence of abu ‘Abd Allah (a.s.) there was a man from our people, also called Shalqan. The Imam had appointed him over his household expenses (included among his dependents) but he had bad manners so he was removed from the job (by Murazim). One day the Imam asked me, ‘O Murazim, have you talked to ‘Isa (Shalqan)?’ I said, ‘Yes, I have talked to him.’ The Imam said, ‘You have done the right thing; there is nothing good in being neglectful. ’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/362)"
        ],
        "index": 2701,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:141:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ أَبِي سَعِيدٍ الْقَمَّاطِ عَنْ دَاوُدَ بْنِ كَثِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ قَالَ أَبِي ( عليه السلام ) قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَيُّمَا مُسْلِمَيْنِ تَهَاجَرَا فَمَكَثَا ثَلَاثاً لَا يَصْطَلِحَانِ إِلَّا كَانَا خَارِجَيْنِ مِنَ الْإِسْلَامِ وَ لَمْ يَكُنْ بَيْنَهُمَا وَلَايَةٌ فَأَيُّهُمَا سَبَقَ إِلَى كَلَامِ أَخِيهِ كَانَ السَّابِقَ إِلَى الْجَنَّةِ يَوْمَ الْحِسَابِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Abu Saeed Al Qammat, from Dawood Bin Kaseer who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘My<sup>asws</sup> father<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘Whichever two Muslims desert each other, and they remain so for three (days) not reconciling, except that they both would have exited from Al-Islam, there would be no Wilayah between the two. So whichever of the two preceded to speak to his brother, he would precede him to the Paradise on the Day of the Reckoning’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from abu Sa’id al-Qammat from Dawud ibn Kathir who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘My father has said, “The Messenger of Allah has said, ‘Whoever of two Muslims forsake the other and do not make peace within three days they both will be considered out of Islam and there will be no Divine Guardianship relations among them. Whoever of the two speaks first to the other, he, on the Day of Judgment, will be the first one to enter paradise.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/362)"
        ],
        "index": 2702,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:141:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ الشَّيْطَانَ يُغْرِي بَيْنَ الْمُؤْمِنِينَ مَا لَمْ يَرْجِعْ أَحَدُهُمْ عَنْ دِينِهِ فَإِذَا فَعَلُوا ذَلِكَ اسْتَلْقَى عَلَى قَفَاهُ وَ تَمَدَّدَ ثُمَّ قَالَ فُزْتُ فَرَحِمَ اللَّهُ امْرَأً أَلَّفَ بَيْنَ وَلِيَّيْنِ لَنَا يَا مَعْشَرَ الْمُؤْمِنِينَ تَأَلَّفُوا وَ تَعَاطَفُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibn Azina, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The Satan<sup>la</sup> tempts the <span class=\"iTxt\">Momineen</span> for as long as one of them does not return from his Religion. So when he does that, he<sup>la</sup> lies down upon his<sup>la</sup> back and stretches, then says, ‘I<sup>la</sup> have succeeded’. So May Allah<sup>azwj</sup> have Mercy on the person who unites between two friends of our<sup>asws</sup>. O group of <span class=\"iTxt\">Momineen</span>! Be united and sympathetic (to each other)!’"
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ibn ‘Udhaynah from Zurara from abu Ja’far (a.s.) who has said the following: “Satan keeps throwing animosity among the believers until one of them forsakes his religion. When this happens, Satan stretches down on his back and says, ‘This is my victory.’ May Allah grant blessings to those who make peace between two of our friends. O believing people, unite and be compassionate to each other.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/363)"
        ],
        "index": 2703,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:141:7",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ مُحَمَّدِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ مُحَمَّدِ بْنِ مَحْفُوظٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا يَزَالُ إِبْلِيسُ فَرِحاً مَا اهْتَجَرَ الْمُسْلِمَانِ فَإِذَا الْتَقَيَا اصْطَكَّتْ رُكْبَتَاهُ وَ تَخَلَّعَتْ أَوْصَالُهُ وَ نَادَى يَا وَيْلَهُ مَا لَقِيَ مِنَ الثُّبُور .ُ"
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Ali Bin Muhammad Bin Saeed, from Muhammad Bin Muslim, from Muhammad Bin Mahfouz, from Ali Bin Al Nu’man, from Ibn Muskan, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Iblees<sup>la</sup> does not cease to be joyful for as long as the two Muslims desert each other. So when they meet (reconcile), his<sup>la</sup> knees tremble and his<sup>la</sup> joints creak, and he<sup>la</sup> calls out, ‘O Woe, what I<sup>la</sup> face from the doom!’."
          ],
          "en.sarwar": [
            "7. Al-Husayn ibn Muhammad has narrated from Ali ibn Muhammad ibn Sa’id from Muhammad ibn Muslim from Muhammad ibn Mahfuz from Ali ibn al-Nu’man from ibn Muskan from abu Basir from abu ‘Abd Allah (a.s.) who has said the following: “As long as two Muslims continue abandoning each other, Satan enjoys it. When they meet, his (Satan’s) knees began to shake and his bone joints began to come apart and he cries, ‘Woe upon me; I have to face this destruction.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:141",
  "kind": "verse_list"
}