{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 155"
        },
        "path": "/books/al-kafi:2:1:155",
        "titles": {
          "ar": "بَابُ مَنْ حَجَبَ أَخَاهُ الْمُؤْمِنَ",
          "en": "Chapter 155 – The one who obstructs his Momin brother"
        }
      }
    ],
    "index": 343,
    "local_index": 155,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 156"
        },
        "path": "/books/al-kafi:2:1:156",
        "titles": {
          "ar": "بَابُ مَنِ اسْتَعَانَ بِهِ أَخُوهُ فَلَمْ يُعِنْهُ",
          "en": "Chapter 156 – The one whose assistance is sought by his brother but he does not assist him"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 154"
        },
        "path": "/books/al-kafi:2:1:154",
        "titles": {
          "ar": "بَابُ خُلْفِ الْوَعْدِ",
          "en": "Chapter 154 – Breaking the promise"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:155",
    "titles": {
      "ar": "بَابُ مَنْ حَجَبَ أَخَاهُ الْمُؤْمِنَ",
      "en": "Chapter 155 – The one who obstructs his Momin brother"
    },
    "verse_count": 4,
    "verse_start_index": 2776,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/45)"
        ],
        "index": 2777,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:155:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َبُو عَلِيٍّ الْأَشْعَرِيُّ</span> عَنْ مُحَمَّدِ بْنِ حَسَّانَ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ جَمِيعاً عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الْمُفَضَّلِ بْنِ عُمَرَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَيُّمَا مُؤْمِنٍ كَانَ بَيْنَهُ وَ بَيْنَ مُؤْمِنٍ حِجَابٌ ضَرَبَ اللَّهُ عَزَّ وَ جَلَّ بَيْنَهُ وَ بَيْنَ الْجَنَّةِ سَبْعِينَ أَلْفَ سُورٍ مَا بَيْنَ السُّورِ إِلَى السُّورِ مَسِيرَةُ أَلْفِ عَامٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Hassan, and a number of our companions, from Ahmad bin Muhammad Bin Khalid, altogether from Muhammad Bin Ali, from Muhammad Bin Sinan, from Al Mufazzal Bin Umar who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Whichever <span class=\"iTxt\">Momin</span> (creates) an obstruction between himself and a <span class=\"iTxt\">Momin</span>, Allah<sup>azwj</sup> Mighty and Majestic would Strike seventy thousand barriers between him and the Paradise, there being between the barrier and the barrier, a travel distance of a thousand years’."
          ],
          "en.sarwar": [
            "1. Ali ibn Muhammad has narrated from Muhammad ibn Jumhur from Ahmad ibn al-Husayn from his father from Isma’il ibn Muhammad from Muhammad ibn Sinan who has said the following: “Once I was in the presence of al-Rida (a.s.) and he stated to me as follows: ‘O Muhammad, in the time of the children of Israel there were four believing people. One of them once went to the house where the other three had gathered together for a meeting on a certain issue among them. He knocked the door and a slave came to him. He then asked, ‘Where is your master?’ The slave replied, ‘He is not home.’ The man returned back and the slave went inside. His master asked, ‘Who was at the door?’ The slave replied, ‘It was so and so and I told him that you were not home.’ He remained quiet without regretting or blaming the slave for his false reply, nor did the other two show any concern for the return of their friend from the door and they continued talking. Next morning the man (their friend) came to the door very early and met the other three when they were leaving to go to a certain property that belonged to one of them. He offered them his greeting of peace and said, ‘I also want to come with you.’ They agreed but did not apologize to him for their attitude the day before. The man was needy or weak. On a certain part of the way a piece of cloud appeared over their heads with shadows and they thought it might rain. They began to move faster. When the cloud reached exactly over their heads an announcer announced from the cloud, ‘O fire, strike them. I am Jibril (Gabriel), the Messenger of Allah. ’ Suddenly, fire from the cloud snatched the three away and the man remained frightened and astonished for what had happened to the other people. He did not know the reason. He came to the city and met Yusha’ ibn Nun (peace be upon him). He explained to him what he had seen and heard. Yusha’ asked, ‘Did you not know that Allah had become angry with them, after that He was happy with them? It was because of the way they behaved toward you.’ He asked, ‘What had they done to me?’ Yusha’ informed him of their behavior and the man said, ‘I, however, am ready to forgive them.’ Yusha’ said, ‘Had this happened before it could have benefited them but now it does not benefit them and perhaps it may benefit them afterwards.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/46)"
        ],
        "index": 2778,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:155:2",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ أَحْمَدَ بْنِ الْحُسَيْنِ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ قَالَ كُنْتُ عِنْدَ الرِّضَا ( صلوات الله عليه )  فَقَالَ لِي يَا مُحَمَّدُ إِنَّهُ كَانَ فِي زَمَنِ بَنِي إِسْرَائِيلَ أَرْبَعَةُ نَفَرٍ مِنَ الْمُؤْمِنِينَ فَأَتَى وَاحِدٌ مِنْهُمُ الثَّلَاثَةَ وَ هُمْ مُجْتَمِعُونَ فِي مَنْزِلِ أَحَدِهِمْ فِي مُنَاظَرَةٍ بَيْنَهُمْ فَقَرَعَ الْبَابَ فَخَرَجَ إِلَيْهِ الْغُلَامُ فَقَالَ أَيْنَ مَوْلَاكَ فَقَالَ لَيْسَ هُوَ فِي الْبَيْتِ",
          "فَرَجَعَ الرَّجُلُ وَ دَخَلَ الْغُلَامُ إِلَى مَوْلَاهُ فَقَالَ لَهُ مَنْ كَانَ الَّذِي قَرَعَ الْبَابَ قَالَ كَانَ فُلَانٌ فَقُلْتُ لَهُ لَسْتَ فِي الْمَنْزِلِ فَسَكَتَ وَ لَمْ يَكْتَرِثْ وَ لَمْ يَلُمْ غُلَامَهُ وَ لَا اغْتَمَّ أَحَدٌ مِنْهُمْ لِرُجُوعِهِ عَنِ الْبَابِ وَ أَقْبَلُوا فِي حَدِيثِهِمْ ",
          "فَلَمَّا كَانَ مِنَ الْغَدِ بَكَّرَ إِلَيْهِمُ الرَّجُلُ فَأَصَابَهُمْ وَ قَدْ خَرَجُوا يُرِيدُونَ ضَيْعَةً لِبَعْضِهِمْ فَسَلَّمَ عَلَيْهِمْ وَ قَالَ أَنَا مَعَكُمْ فَقَالُوا لَهُ نَعَمْ وَ لَمْ يَعْتَذِرُوا إِلَيْهِ وَ كَانَ الرَّجُلُ مُحْتَاجاً ضَعِيفَ الْحَالِ فَلَمَّا كَانُوا فِي بَعْضِ الطَّرِيقِ إِذَا غَمَامَةٌ قَدْ أَظَلَّتْهُمْ فَظَنُّوا أَنَّهُ مَطَرٌ فَبَادَرُوا ",
          "فَلَمَّا اسْتَوَتِ الْغَمَامَةُ عَلَى رُءُوسِهِمْ إِذَا مُنَادٍ يُنَادِي مِنْ جَوْفِ الْغَمَامَةِ أَيَّتُهَا النَّارُ خُذِيهِمْ وَ أَنَا جَبْرَئِيلُ رَسُولُ اللَّهِ فَإِذَا نَارٌ مِنْ جَوْفِ الْغَمَامَةِ قَدِ اخْتَطَفَتِ الثَّلَاثَةَ النَّفَرِ وَ بَقِيَ الرَّجُلُ مَرْعُوباً يَعْجَبُ مِمَّا نَزَلَ بِالْقَوْمِ وَ لَا يَدْرِي مَا السَّبَبُ ",
          "فَرَجَعَ إِلَى الْمَدِينَةِ فَلَقِيَ يُوشَعَ بْنَ نُونٍ ( عليه السلام ) فَأَخْبَرَهُ الْخَبَرَ وَ مَا رَأَى وَ مَا سَمِعَ فَقَالَ يُوشَعُ بْنُ نُونٍ ( عليه السلام ) أَ مَا عَلِمْتَ أَنَّ اللَّهَ سَخِطَ عَلَيْهِمْ بَعْدَ أَنْ كَانَ عَنْهُمْ رَاضِياً وَ ذَلِكَ بِفِعْلِهِمْ بِكَ فَقَالَ وَ مَا فِعْلُهُمْ بِي فَحَدَّثَهُ يُوشَعُ فَقَالَ الرَّجُلُ فَأَنَا أَجْعَلُهُمْ فِي حِلٍّ وَ أَعْفُو عَنْهُمْ قَالَ لَوْ كَانَ هَذَا قَبْلُ لَنَفَعَهُمْ فَأَمَّا السَّاعَةَ فَلَا وَ عَسَى أَنْ يَنْفَعَهُمْ مِنْ بَعْدُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Muhammad Bni Jamhour, from Ahmad Bin Al Husayn, from his father, from Ismail Bin Muhammad, from Muhammad Bin Sianna who said, ",
            "‘I was in the presence of Al-Reza<sup>asws</sup>, so he<sup>asws</sup> said to me: ‘O Abu Muhammad! It was so that in the era of the Children of Israel there were four persons from the <span class=\"iTxt\">Momineen</span>. So one of them came over to the three and they had gathered in a house of one of them regarding a discussion between them. So he knocked on the door and the slave came over to him. So he said, ‘Where is your master?’ So he said, ‘He is not in the house’. ",
            "So the man returned and the slave went over to his master. So he said to him, ‘Who was that who knocked the door?’ He said, ‘It was so and so, so I told him you were not in the house’. So he remained silent and did not care and did not blame his slave, nor was anyone one of them saddened of his return from the door, and they returned towards their discussion. ",
            "So when it was from the morning, the man came very early to them and he came across them and they had come out intending a property of one of them. So he greeted upon them and said, ‘I (want to go) with you’. So they said to him, ‘Yes’, and they did not apologise to him, and the man was needy and of a weak (financial) state. So when they were in one of the streets, there was a cloud which shaded them. So they thought it was going to rain, and they hastened. ",
            "So when the cloud was directly upon their heads, a Caller Called out from the interior of the cloud: ‘O you Fire! Seize them, and I<sup>as</sup> am Jibraeel<sup>as</sup>, a Messenger of Allah<sup>azwj</sup>!’ So a flame came out from the inside of the cloud and snatched the three persons, and there remained the man, awed, astounded from what had befallen with the group, and he did not know what the cause of it was. ",
            "So he returned to the city and met Yoshua<sup style=\"font-weight: normal\">as</sup> Bin Noon<sup style=\"font-weight: normal\">as</sup> and informed him<sup style=\"font-weight: normal\">as</sup> of the news and what he had seen and what he had heard. So Yoshua<sup style=\"font-weight: normal\">as</sup> Bin Noon<sup style=\"font-weight: normal\">as</sup> said: ‘Do you not know that Allah<sup style=\"font-weight: normal\">azwj</sup> is Angered upon them after having been Pleased from them, and that was due to what they did with you’. So he said, ‘And what was their deed with me?’ So Yoshua<sup style=\"font-weight: normal\">as</sup> narrated it. So the man said, ‘So I hereby make them to be free and excuse them’. He<sup style=\"font-weight: normal\">as</sup> said: ‘Had this been before, it would have benefitted them, but as for now, so no, and perhaps it might benefit them from afterwards’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Sahl ibn Ziyad from Bakr ibn Salih from Muhammad ibn Sinan from Mufaddal from abu ‘Abd Allah (a.s.) who has said the following: “If a believer creates a barrier between himself and another believer, Allah creates between him and paradise seventy thousand walls each of which will be as thick as the distance of a one thousand year journey, and of the same length will be the distance from one wall to the other wall.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/48)"
        ],
        "index": 2779,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:155:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ بَكْرِ بْنِ صَالِحٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ مُفَضَّلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَيُّمَا مُؤْمِنٍ كَانَ بَيْنَهُ وَ بَيْنَ مُؤْمِنٍ حِجَابٌ ضَرَبَ اللَّهُ بَيْنَهُ وَ بَيْنَ الْجَنَّةِ سَبْعِينَ أَلْفَ سُورٍ غِلَظُ كُلِّ سُورٍ مَسِيرَةُ أَلْفِ عَامٍ مَا بَيْنَ السُّورِ إِلَى السُّورِ مَسِيرَةُ أَلْفِ عَامٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Bakr Bin Salih, from Muhammad Bin Sinan, from Mufazzal, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whichever <span class=\"iTxt\">Momin</span> makes an obstruction to be between him and a <span class=\"iTxt\">Momin</span>, Allah<sup>azwj</sup> will Strike seventy thousand barriers to be between him and the Paradise, the thickness of every barrier being of a travel distance of a thousand years, and what is between the barrier and the barrier, would be a travel distance of a thousand years’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from Yahya ibn al-Mubarak from ‘Abd Allah ibn Jabalah from ‘Asim ibn Humayd from abu Hamza who has said the following: “Once I said to abu Ja’far (a.s.) ‘May Allah keep my soul in service for your cause, what do you say about a Muslim who comes to the door of a Muslim as a visitor, or for help when he is home, and is asked permission for a meeting but does not give permission, nor does he come out to see his visitor?’ The Imam said, ‘O abu Hamza, if a Muslim comes to a Muslim as a visitor, or for help and he is home, and is asked permission but he does not come out to meet him, he continues living in the condemnation of Allah until the two will meet.’ I (the narrator) then asked the Imam, ‘May Allah keep my soul in service for your cause, will he live with the condemnation of Allah until the two will meet?’ The Imam said, ‘Yes, O abu Hamza.’” "
          ]
        }
      },
      {
        "index": 2780,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:155:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ يَحْيَى بْنِ الْمُبَارَكِ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قُلْتُ لَهُ جُعِلْتُ فِدَاكَ مَا تَقُولُ فِي مُسْلِمٍ أَتَى مُسْلِماً زَائِراً أَوْ طَالِبَ حَاجَةٍ وَ هُوَ فِي مَنْزِلِهِ فَاسْتَأْذَنَ عَلَيْهِ فَلَمْ يَأْذَنْ لَهُ وَ لَمْ يَخْرُجْ إِلَيْهِ ",
          "قَالَ يَا أَبَا حَمْزَةَ أَيُّمَا مُسْلِمٍ أَتَى مُسْلِماً زَائِراً أَوْ طَالِبَ حَاجَةٍ وَ هُوَ فِي مَنْزِلِهِ فَاسْتَأْذَنَ لَهُ وَ لَمْ يَخْرُجْ إِلَيْهِ لَمْ يَزَلْ فِي لَعْنَةِ اللَّهِ حَتَّى يَلْتَقِيَا فَقُلْتُ جُعِلْتُ فِدَاكَ فِي لَعْنَةِ اللَّهِ حَتَّى يَلْتَقِيَا قَالَ نَعَمْ يَا أَبَا حَمْزَةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Yahya Bin Al Mubarak, from Abdullah Bin Jabala, from Aasim Bin Humeyr, from Abu Hamza, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! What are you<sup>asws</sup> saying regarding a Muslim who comes over to a Muslim to visit or seeking a need while he is in his house, so he seeks permission to him but he does not permit him, and does not come out to him’. ",
            "He<sup>asws</sup> said: ‘O Abu Hamza! Whichever Muslim comes over to a Muslim to visit or seeking a need while he is in his house, so he seeks permission to him and he does not come out to him, he would not cease to be in the Curse of Allah<sup>azwj</sup> until they both do meet’. So I said, ‘May I be sacrificed for you<sup>asws</sup>! (He would be) in the Curse of Allah<sup>azwj</sup> until they both do meet?’ He<sup>asws</sup> said: ‘Yes, O Abu Hamza’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:155",
  "kind": "verse_list"
}