{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 164"
        },
        "path": "/books/al-kafi:2:1:164",
        "titles": {
          "ar": "بَابُ أَصْنَافِ النَّاسِ",
          "en": "Chapter 164 – The Categories of people"
        }
      }
    ],
    "index": 352,
    "local_index": 164,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 165"
        },
        "path": "/books/al-kafi:2:1:165",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الْكُفْرِ</span>",
          "en": "Chapter 165 – The Disbelief (Kufr)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 163"
        },
        "path": "/books/al-kafi:2:1:163",
        "titles": {
          "ar": "بَابُ مُجَالَسَةِ أَهْلِ الْمَعَاصِي",
          "en": "Chapter 163 – The gathering (sitting) with the people of disobedience (sinners)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:164",
    "titles": {
      "ar": "بَابُ أَصْنَافِ النَّاسِ",
      "en": "Chapter 164 – The Categories of people"
    },
    "verse_count": 3,
    "verse_start_index": 2829,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/100)"
        ],
        "index": 2830,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:164:1",
        "refs": {
          "Mentions": [
            "/books/quran:7:48",
            "/books/quran:9:102",
            "/books/quran:9:106",
            "/books/quran:4:99",
            "/books/quran:4:98"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ سُلَيْمٍ مَوْلَى طِرْبَالٍ قَالَ حَدَّثَنِي هِشَامٌ عَنْ حَمْزَةَ بْنِ الطَّيَّارِ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) النَّاسُ عَلَى سِتَّةِ أَصْنَافٍ قَالَ قُلْتُ أَ تَأْذَنُ لِي أَنْ أَكْتُبَهَا قَالَ نَعَمْ قُلْتُ مَا أَكْتُبُ قَالَ اكْتُبْ أَهْلَ الْوَعِيدِ مِنْ أَهْلِ الْجَنَّةِ وَ أَهْلِ النَّارِ وَ اكْتُبْ وَ آخَرُونَ اعْتَرَفُوا بِذُنُوبِهِمْ خَلَطُوا عَمَلًا صالِحاً وَ آخَرَ سَيِّئاً قَالَ قُلْتُ مَنْ هَؤُلَاءِ قَالَ وَحْشِيٌّ مِنْهُمْ قَالَ وَ اكْتُبْ وَ آخَرُونَ مُرْجَوْنَ لِأَمْرِ اللَّهِ إِمَّا يُعَذِّبُهُمْ وَ إِمَّا يَتُوبُ عَلَيْهِمْ ",
          "قَالَ وَ اكْتُبْ إِلَّا الْمُسْتَضْعَفِينَ مِنَ الرِّجالِ وَ النِّساءِ وَ الْوِلْدانِ لا يَسْتَطِيعُونَ حِيلَةً وَ لا يَهْتَدُونَ سَبِيلًا لَا يَسْتَطِيعُونَ حِيلَةً إِلَى الْكُفْرِ وَ لَا يَهْتَدُونَ سَبِيلًا إِلَى الْإِيمَانِ فَأُولئِكَ عَسَى اللَّهُ أَنْ يَعْفُوَ عَنْهُمْ ",
          "قَالَ وَ اكْتُبْ أَصْحَابَ الْأَعْرَافِ قَالَ قُلْتُ وَ مَا أَصْحَابُ الْأَعْرَافِ قَالَ قَوْمٌ اسْتَوَتْ حَسَنَاتُهُمْ وَ سَيِّئَاتُهُمْ فَإِنْ أَدْخَلَهُمُ النَّارَ فَبِذُنُوبِهِمْ وَ إِنْ أَدْخَلَهُمُ الْجَنَّةَ فَبِرَحْمَتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Anumber of our companions, from Sahl Bin Ziyad, from Ali Bin Asbaat, from Suleym a slave of Tarbaal who said, ",
            "‘Hisham narrated to me, from Hamza Bin Al-Tayyar who said, ‘Abu Abdullah<sup>asws</sup> said to me: ‘The people are upon three categories’. I said, ‘Would you<sup>asws</sup> permit me that I write this down?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘What shall I write?’ He<sup>asws</sup> said: ‘The Promised people would be from the inhabitants of the Paradise and the inhabitants of the Fire. And write <span class=\"ibTxt\"><a href=\"/#/books/quran:9#h102\">[9:102]</a> And others have confessed their sins, they have mingled a good deed and an evil one; maybe Allah will Turn to them (Mercifully)</span>’.",
            "He<sup style=\"font-weight: normal\">asws</sup> said: ‘And write <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h98\">[4:98]</a> Except the weak from among the men and the children who have not in their power the means nor can they find a way (to escape) <a href=\"/#/books/quran:4#h99\">[4:99]</a> So these, it may be, Allah will Pardon them</span>’.",
            "He<sup style=\"font-weight: normal\">asws</sup> said: ‘And write <span class=\"ibTxt\"><a href=\"/#/books/quran:7#h48\">[7:48]</a> And the the people of Al-Araf</span>’. I said, ‘And what are the the people of Al-Araf?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘A people whose good deeds and their evils deeds would be equal. So if they were to be entered into the Fire, it would be due to their sins, and if they were to be entered into the Paradise, it would be due to His<sup style=\"font-weight: normal\">azwj</sup> Mercy’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Asbat from Sulaym Mawla Tirbal who has said the Hisham narrated to him from Hamza ibn al-Tayyar who has said the following: “Once abu ‘Abd Allah (a.s.) said to me, ‘People are of six categories.’ I then asked, ‘Can I write them down?’ The Imam said, ‘Yes, you can do so.’ I then asked, ‘What should I write?’ The Imam said, ‘Write down: the people promised paradise and those warned against the fire (but ignored it). Write down, “. . . others of them have already confessed their sins and have mixed virtuous deeds with sinful ones.’” <a href=\"/#/books/quran:9#h102\">[9:102]</a> I then asked, ‘Who are such people?’ The Imam said, ‘Wahshi (assassin of Hamza) is one of them.’ The Imam said, ‘Write down, “There are others who have no good deeds for which they may receive any reward or sins for which they may be punished. . . .” <a href=\"/#/books/quran:9#h106\">[9:106]</a> The Imam said, ‘Write down, “As for the really weak and oppressed men, women, and children who were not able to find any means of obtaining their freedom or of having the right guidance, <a href=\"/#/books/quran:4#h98\">[4:98]</a> [are not able to do anything against the unbelievers or find the right guidance] perhaps Allah will forgive them; He is All-merciful and All- forgiving.” <a href=\"/#/books/quran:4#h99\">[4:99]</a> The Imam said, ‘Write down the people of ‘A’raf.’ I asked, ‘Who are they?’ The Imam said, ‘They are the people whose good and bad deeds measure equally. If they will be sent to the fire it will be due to their sins and if they will be sent to paradise it will be due to His kindness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/105)"
        ],
        "index": 2831,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:164:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ يُونُسَ عَنْ حَمَّادٍ عَنْ حَمْزَةَ بْنِ الطَّيَّارِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) النَّاسُ عَلَى سِتِّ فِرَقٍ يَئُولُونَ كُلُّهُمْ إِلَى ثَلَاثِ فِرَقٍ الْإِيمَانِ وَ الْكُفْرِ وَ الضَّلَالِ وَ هُمْ أَهْلُ الْوَعْدَيْنِ الَّذِينَ وَعَدَهُمُ اللَّهُ الْجَنَّةَ وَ النَّارَ الْمُؤْمِنُونَ وَ الْكَافِرُونَ وَ الْمُسْتَضْعَفُونَ وَ الْمُرْجَوْنَ لِأَمْرِ اللَّهِ إِمَّا يُعَذِّبُهُمْ وَ إِمَّا يَتُوبُ عَلَيْهِمْ وَ الْمُعْتَرِفُونَ بِذُنُوبِهِمْ خَلَطُوا عَمَلًا صَالِحاً وَ آخَرَ سَيِّئاً وَ أَهْلُ الْأَعْرَافِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Ubeyd, from Yunus, from Hammad, from Hamza Bin Al Tayyar who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The people are upon six divisions. All of these can be interpreted to be upon three divisions – the <span class=\"iTxt\">Emān</span>, and the <span class=\"iTxt\">Kufr</span> (disbelief), and the straying. And they are the Promised people whom Allah<sup>azwj</sup> has Promised the Paradise and the Fire – the <span class=\"iTxt\">Momineen</span>, and the Unbelivers, and the weak ones, and the hopeful ones for the Command of Allah<sup>azwj</sup>, either He<sup>azwj</sup> Punishes them or He<sup>azwj</sup> Turns towards them (with Mercy), and the acknowledgers of their sins mixing the righteous deeds and the evil deeds, and the people of the Heights’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from ‘Ubayd from Yunus from Hammad from Hamza ibn al-Tayyar from abu ‘Abd Allah (a.s.) who has said the following: “People are of six categories. All of them come from three groups: people of belief, disbelief and straying. All three are the people of two promises. Allah has promised paradise and fire. There are the believers, and the unbelievers. Besides, there are the weak ones who hope in the command of Allah whereby they may be punished or forgiven and there are those who have confessed to their sins and have mixed good deeds with bad deeds. Also there are the people of ‘A’raf. (Straying people are of four groups and with the other two: believing people and unbelievers total six groups).” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/106)"
        ],
        "index": 2832,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:164:3",
        "refs": {
          "Mentions": [
            "/books/quran:9:102",
            "/books/quran:4:98",
            "/books/quran:7:48",
            "/books/quran:9:60"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ زُرَارَةَ قَالَ دَخَلْتُ أَنَا وَ حُمْرَانُ أَوْ أَنَا وَ بُكَيْرٌ عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قُلْتُ لَهُ إِنَّا نَمُدُّ الْمِطْمَارَ قَالَ وَ مَا الْمِطْمَارُ قُلْتُ التُّرُّ فَمَنْ وَافَقَنَا مِنْ عَلَوِيٍّ أَوْ غَيْرِهِ تَوَلَّيْنَاهُ وَ مَنْ خَالَفَنَا مِنْ عَلَوِيٍّ أَوْ غَيْرِهِ بَرِئْنَا مِنْهُ ",
          "فَقَالَ لِي يَا زُرَارَةُ قَوْلُ اللَّهِ أَصْدَقُ مِنْ قَوْلِكَ فَأَيْنَ الَّذِينَ قَالَ اللَّهُ عَزَّ وَ جَلَّ إِلَّا الْمُسْتَضْعَفِينَ مِنَ الرِّجالِ وَ النِّساءِ وَ الْوِلْدانِ لا يَسْتَطِيعُونَ حِيلَةً وَ لا يَهْتَدُونَ سَبِيلًا أَيْنَ الْمُرْجَوْنَ لِأَمْرِ اللَّهِ أَيْنَ الَّذِينَ خَلَطُوا عَمَلًا صَالِحاً وَ آخَرَ سَيِّئاً أَيْنَ أَصْحَابُ الْأَعْرَافِ أَيْنَ الْمُؤَلَّفَةُ قُلُوبُهُمْ .",
          "وَ زَادَ حَمَّادٌ فِي الْحَدِيثِ قَالَ فَارْتَفَعَ صَوْتُ أَبِي جَعْفَرٍ ( عليه السلام ) وَ صَوْتِي حَتَّى كَانَ يَسْمَعُهُ مَنْ عَلَى بَابِ الدَّارِ .",
          "وَ زَادَ فِيهِ جَمِيلٌ عَنْ زُرَارَةَ فَلَمَّا كَثُرَ الْكَلَامُ بَيْنِي وَ بَيْنَهُ قَالَ لِي يَا زُرَارَةُ حَقّاً عَلَى اللَّهِ أَنْ لَا يُدْخِلَ الضُّلَّالَ الْجَنَّةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, from Zurara who said, ",
            "‘I and Humran’, or ‘I and Bukeyr went over to Abu Ja’far<sup>asws</sup>. I said to him, ‘We are extending the plumb-line (a measuring device)’. He<sup>asws</sup> said: ‘And what is the plumb-line?’ I said, ‘A measuring criteria. So the one who is concordant with us from the Alawites or others, we befriend him, and the one who opposes us from the Alawites or others, we disavow from him’.",
            "So he<sup>asws</sup> said to me: ‘O Zurara! The Words of Allah<sup>azwj</sup> are Truer than your words. So where are those from whom Allah<sup>azwj</sup> Mighty and Majestic Spoke of <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h98\">[4:98]</a> Except the weak from among the men and the children who have not in their power the means nor can they find a way (to escape)</span>? Where are the hopeful ones to the Command of Allah<sup>azwj</sup>, those <span class=\"ibTxt\"><a href=\"/#/books/quran:9#h102\">[9:102]</a> have mingled a good deed and an evil one</span>? Where are <span class=\"ibTxt\"><a href=\"/#/books/quran:7#h48\">[7:48]</a> the the people of Al-Araf</span>? Where are the <span class=\"ibTxt\"><a href=\"/#/books/quran:9#h60\">[9:60]</a> those whose hearts are made to incline (to Truth)</span>?’ ",
            "And there is an increase in the Hadeeth from Hammad having said, ‘So the voice of Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> and my voice was raised to the extent that it was heard from the doorway of the house.",
            "And there was an increase by Jameel, from Zurara having said, ‘So when the speech became a lot between him<sup>asws</sup> and him, he<sup>asws</sup> said to me: ‘O Zurara! It is a right upon Allah<sup>azwj</sup> that He<sup>azwj</sup> does not Enter the straying one into the Paradise’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hisham ibn Salim from Zurara who has said the following: “Once Humran and I or Bukayr and I went in the presence of abu Ja’far (a.s.) and I said, ‘We use the Mitmar.’ The Imam said, ‘What is the Mitmar?’ I said, ‘It is a measuring device. Whoever of ‘Alawi or none ‘Alawi agrees with us we love them and whoever, ‘Alawi or none ‘Alawi opposes us, we disavow them.’ The Imam said, ‘O Zurara, the words of Allah are more true than your words. Where are those about whom Allah, the Most Majestic, the Most Holy, has said, ‘As for the really weak and oppressed men, women, and children who were not able to find any means of obtaining their freedom or of having the right guidance,’ <a href=\"/#/books/quran:4#h98\">[4:98]</a> and where are those who have hope in Allah’s command? Where are those who mix good deeds with bad deeds? Where are the people of ‘A’raf and where are people whose hearts incline to the truth?’” “Hammad has added in the Haditlr. The voices of abu Ja’far (a.s.) and I became loud and people at the door could hear them. “Jamil from Zurara has added: When many words were exchanged between him and I, he said, ‘O Zurara, it is a right on Allah not to send the straying people to paradise.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:164",
  "kind": "verse_list"
}