{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 165"
        },
        "path": "/books/al-kafi:2:1:165",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الْكُفْرِ</span>",
          "en": "Chapter 165 – The Disbelief (Kufr)"
        }
      }
    ],
    "index": 353,
    "local_index": 165,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 166"
        },
        "path": "/books/al-kafi:2:1:166",
        "titles": {
          "ar": "بَابُ وُجُوهِ الْكُفْرِ",
          "en": "Chapter 166 – Aspects of the Kufr (Disbelief)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 164"
        },
        "path": "/books/al-kafi:2:1:164",
        "titles": {
          "ar": "بَابُ أَصْنَافِ النَّاسِ",
          "en": "Chapter 164 – The Categories of people"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:165",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الْكُفْرِ</span>",
      "en": "Chapter 165 – The Disbelief (Kufr)"
    },
    "verse_count": 21,
    "verse_start_index": 2832,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه وصحته أرجح عند ي   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/108)"
        ],
        "index": 2833,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:165:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ دَاوُدَ بْنِ كَثِيرٍ الرَّقِّيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) سُنَنُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) كَفَرَائِضِ اللَّهِ عَزَّ وَ جَلَّ فَقَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ فَرَضَ فَرَائِضَ مُوجَبَاتٍ عَلَى الْعِبَادِ فَمَنْ تَرَكَ فَرِيضَةً مِنَ الْمُوجَبَاتِ فَلَمْ يَعْمَلْ بِهَا وَ جَحَدَهَا كَانَ كَافِراً وَ أَمَرَ رَسُولُ اللَّهِ بِأُمُورٍ كُلُّهَا حَسَنَةٌ فَلَيْسَ مَنْ تَرَكَ بَعْضَ مَا أَمَرَ اللَّهُ عَزَّ وَ جَلَّ بِهِ عِبَادَهُ مِنَ الطَّاعَةِ بِكَافِرٍ وَ لَكِنَّهُ تَارِكٌ لِلْفَضْلِ مَنْقُوصٌ مِنَ الْخَيْرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Dawood Bin Kaseer Al Raqqy who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Is the Sunnah of Rasool-Allah<sup>azwj</sup> like the Impositions of Allah<sup>azwj</sup> Mighty and Majestic?’ So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Imposed the Impositions being Obligatory upon the servants. So the one who neglects an Imposition from the Obligations, and he does not act by it and denies it, he would be an Unbeliever. And Rasool-Allah<sup>saww</sup> ordered with the orders, all of them being good deeds. Thus, one does not become an Unbeliever (<span class=\"iTxt\">Kafir</span>) for ignoring a few of the obligations that Allah<sup>azwj</sup> Mighty and Majestic has Commanded His<sup>azwj</sup> servants to Perform, however, he has ignored a virtue and has cut down goodness’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from al- Hassan ibn Mahbub from Dawud ibn Kathir al-Raqqi who has said the following: “Once I asked abu ‘Abd Allah (a.s.) ‘Are the traditions, Sunan of the Messenger of Allah like the obligations Allah, the Most Majestic, the Most Holy, has sanctioned?’ The Imam said, ‘Allah, the Most Majestic, the Most Holy, has sanctioned obligations that are compulsory for the servants (of Allah). Whoever ignores an obligation of the compulsory ones; does not perform it and rejects it, he becomes an unbeliever. The Messenger of Allah has commanded certain matters to be performed and they all are good deeds. One does not become an unbeliever for ignoring a few of the obligations that Allah, the Most Majestic, the Most Holy, has commanded His servant to perform, however, he has ignored a virtue and has cut down goodness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/110)"
        ],
        "index": 2834,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:165:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ وَ اللَّهِ إِنَّ الْكُفْرَ لَأَقْدَمُ مِنَ الشِّرْكِ وَ أَخْبَثُ وَ أَعْظَمُ ",
          "قَالَ ثُمَّ ذَكَرَ كُفْرَ إِبْلِيسَ حِينَ قَالَ اللَّهُ لَهُ اسْجُدْ لآِدَمَ فَأَبَى أَنْ يَسْجُدَ فَالْكُفْرُ أَعْظَمُ مِنَ الشِّرْكِ فَمَنِ اخْتَارَ عَلَى اللَّهِ عَزَّ وَ جَلَّ وَ أَبَى الطَّاعَةَ وَ أَقَامَ عَلَى الْكَبَائِرِ فَهُوَ كَافِرٌ وَ مَنْ نَصَبَ دِيناً غَيْرَ دِينِ الْمُؤْمِنِينَ فَهُوَ مُشْرِكٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘By Allah<sup>azwj</sup>! The disbelief (<span class=\"iTxt\">Kufr</span>) occurred earlier than the association (<span class=\"iTxt\">Shirk</span>) and is worse and more grievous’. ",
            "He (the narrator) said, ‘Then he<sup style=\"font-weight: normal\">asws</sup> mentioned: ‘Iblees<sup style=\"font-weight: normal\">la</sup> disbelieved where Allah<sup style=\"font-weight: normal\">azwj</sup> Told him<sup style=\"font-weight: normal\">la</sup> to prostrate to Adam<sup style=\"font-weight: normal\">as</sup>, but he<sup style=\"font-weight: normal\">la</sup> refused to prostrate. Hence, the disbelief (<span class=\"iTxt\">Kufr</span>) is more grievous than the association (<span class=\"iTxt\">Shirk</span>). So the one who chooses against Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic and refuses the obedience and stands upon the major sins, so he is a Unbeliver (<span class=\"iTxt\">Kafir</span>); and the one who establishes a religion other than the Religion of the <span class=\"iTxt\">Momineen</span><sup style=\"font-weight: normal\">asws</sup>, so he is a Polytheist (<span class=\"iTxt\">Mushrik</span>)’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz from Zurara from abu Ja’far (a.s.) who has said the following: “By Allah, disbelief is before paganism and it is greater in filth. The narrator has said that the Imam then mentioned the disbelief of Satan when Allah told him to bow down before Adam and refused to prostrate, that disbelief is greater than considering things partners of Allah. Whoever chooses something instead of Allah, the Most Majestic, the Most Holy, refuses to obey and commits major sins is an unbeliever. One who establishes a religion other than the religion of the believers has considered things as partners of Allah.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/111)"
        ],
        "index": 2835,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:165:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ ذُكِرَ عِنْدَهُ سَالِمُ بْنُ أَبِي حَفْصَةَ وَ أَصْحَابُهُ فَقَالَ إِنَّهُمْ يُنْكِرُونَ أَنْ يَكُونَ مَنْ حَارَبَ عَلِيّاً ( عليه السلام ) مُشْرِكِينَ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) فَإِنَّهُمْ يَزْعُمُونَ أَنَّهُمْ كُفَّارٌ ",
          "ثُمَّ قَالَ لِي إِنَّ الْكُفْرَ أَقْدَمُ مِنَ الشِّرْكِ ثُمَّ ذَكَرَ كُفْرَ إِبْلِيسَ حِينَ قَالَ لَهُ اسْجُدْ فَأَبَى أَنْ يَسْجُدَ ",
          "وَ قَالَ الْكُفْرُ أَقْدَمُ مِنَ الشِّرْكِ فَمَنِ اجْتَرَى عَلَى اللَّهِ فَأَبَى الطَّاعَةَ وَ أَقَامَ عَلَى الْكَبَائِرِ فَهُوَ كَافِرٌ يَعْنِي مُسْتَخِفٌّ كَافِرٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Abdullah Bin Bukeyr, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘Salim Bin Abu Hafs and his companions were mentioned in his<sup>asws</sup> presence, so he (the narrator) said: ‘They are denying that the ones who battled against Ali<sup>asws</sup> were Polytheists (<span class=\"iTxt\">Mushrik</span>)’. So Abu Ja’far<sup>asws</sup> said: ‘So they are claiming that they were Unbelivers (<span class=\"iTxt\">Kafir</span>)’.",
            "Then he<sup style=\"font-weight: normal\">asws</sup> said to me: ‘The disbelief (<span class=\"iTxt\">Kufr</span>) was earlier than the association (<span class=\"iTxt\">Shirk</span>)’. Then he<sup style=\"font-weight: normal\">asws</sup> mentioned: ‘Iblees<sup style=\"font-weight: normal\">la</sup> disbelieved where He<sup style=\"font-weight: normal\">azwj</sup> Told him<sup style=\"font-weight: normal\">la</sup> to prostrate, but he<sup style=\"font-weight: normal\">la</sup> refused to prostrate’. ",
            "And he<sup style=\"font-weight: normal\">asws</sup> said: ‘The disbelief (<span class=\"iTxt\">Kufr</span>) occurred earlier than the association (<span class=\"iTxt\">Shirk</span>). So the one who is audacious upon Allah<sup style=\"font-weight: normal\">azwj</sup> and refuses the obedience, and stands upon the major sin, so he is a Unbeliver (<span class=\"iTxt\">Kafir</span>), meaning the incognito (disguised) Unbeliver (<span class=\"iTxt\">Kafir</span>)’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from ‘Abd Allah ibn Bukayr from Zurara from abu Ja’far (a.s.) who has said the following: “The narrator has said that once Salim ibn abu Hafs and his companions were mentioned before abu Ja’far (a.s.) and that they denied that those who waged war against Ali (a.s.) are of the people who consider things as partners of Allah ( Mushrik ). Abu Ja’far (a.s.) said, ‘So they think such people are unbelievers.’ The Imam then said to me, ‘Disbelief is before paganism.’ He (the Imam) then mentioned Satan when Allah told him to prostrate, and he refused to do so. The Imam said that disbelief is before al-Shirk (paganism and considering things as partners of Allah). Whoever boldly disobeys Allah and commits major sins is an unbeliever. He has considered belief insignificant so he is an unbeliever.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/112)"
        ],
        "index": 2836,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:165:4",
        "refs": {
          "Quran": [
            "/books/quran:76:3"
          ]
        },
        "text": [
          "عَنْهُ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ زُرَارَةَ عَنْ حُمْرَانَ بْنِ أَعْيَنَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِهِ عَزَّ وَ جَلَّ إِنَّا هَدَيْناهُ السَّبِيلَ إِمَّا شاكِراً وَ إِمَّا كَفُوراً قَالَ إِمَّا آخِذٌ فَهُوَ شَاكِرٌ وَ إِمَّا تَارِكٌ فَهُوَ كَافِرٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Abdullah Bin Bukeyr, from Zurara, from Humran Bin Ayn who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of the Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:76#h3\">[76:3]</a> Surely, We have shown him the way: he may be thankful or unthankful</span>. He<sup>asws</sup> said: ‘Either he adopts (the Wilayah) so he is a thankful one, or he neglects (the Wilayah) so he is a Unbeliever (<span class=\"iTxt\">Kafir</span>)’."
          ],
          "en.sarwar": [
            "4. It is narrated from him (narrator of the Hadith above) from ‘Abd Allah ibn Bukayr from Zurara from Humran ibn ‘A’yun who has said the following: “Once I asked abu ‘Abd Allah (a.s.) about the words of Allah, the Most Majestic, the Most Holy, ‘We showed him the right path, whether he would be grateful or ungrateful.’ <a href=\"/#/books/quran:76#h3\">[76:3]</a> The Imam said, ‘If he accepts it (belief), he is then grateful or rejects it; he then is an unbeliever.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/113)"
        ],
        "index": 2837,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:165:5",
        "refs": {
          "Quran": [
            "/books/quran:5:5"
          ]
        },
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ عُبَيْدٍ عَنْ زُرَارَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ يَكْفُرْ بِالْإِيمانِ فَقَدْ حَبِطَ عَمَلُهُ قَالَ تَرْكُ الْعَمَلِ الَّذِي أَقَرَّ بِهِ مِنْ ذَلِكَ أَنْ يَتْرُكَ الصَّلَاةَ مِنْ غَيْرِ سُقْمٍ وَ لَا شُغُلٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan Bin Ali, from Hammad Bin Usman, from Ubeyd, from Zurara who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:5#h5\">[5:5]</a> and whoever denies the faith, his work indeed would be Confiscated</span>. He<sup>asws</sup> said: ‘Neglecting the deed which he had acknowledged with it. From that is if he were to neglect the <span class=\"iTxt\">Salāt</span> from without an illness or a pre-occupation’."
          ],
          "en.sarwar": [
            "5. Al-Husayn ibn Muhammad has narrated from Mu’alla ibn Muhammad from al- Hassan ibn Ali from Hammad ibn ‘Uthman from ‘Ubayd from Zurara who has said the following: “Once I asked abu ‘Abd Allah (a.s.) about the words of Allah, the Most Majestic, the Most Holy, ‘The deeds of anyone who rejects belief, certainly, become fruitless. He, on the Day of Judgment will be of those who lose.’ <a href=\"/#/books/quran:5#h5\">[5:5]</a> The Imam said, ‘It is disregarding the deeds that he has confessed to be true. Of such deeds is disregarding prayer without suffering from illness or being preoccupied. ’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/114)"
        ],
        "index": 2838,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:165:6",
        "refs": {
          "Quran": [
            "/books/quran:2:34"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ مُوسَى بْنِ بُكَيْرٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنِ الْكُفْرِ وَ الشِّرْكِ أَيُّهُمَا أَقْدَمُ قَالَ فَقَالَ لِي مَا عَهْدِي بِكَ تُخَاصِمُ النَّاسَ قُلْتُ أَمَرَنِي هِشَامُ بْنُ سَالِمٍ أَنْ أَسْأَلَكَ عَنْ ذَلِكَ فَقَالَ لِي الْكُفْرُ أَقْدَمُ وَ هُوَ الْجُحُودُ قَالَ اللَّهُ عَزَّ وَ جَلَّ إِلَّا إِبْلِيسَ أَبى وَ اسْتَكْبَرَ وَ كانَ مِنَ الْكافِرِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin ziyad, from Ali Bin Asbat, from Musa Bin Bukeyr who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about the disbelief (<span class=\"iTxt\">Kufr</span>) and the association (<span class=\"iTxt\">Shirk</span>), which of the two was earlier?’ So he<sup>asws</sup> said to me: ‘I<sup>asws</sup> have not agreed with you to debate with the people’. I said, ‘Hisham Bin Salim instructed me that I ask you<sup>asws</sup> about that’. So he<sup>asws</sup> said to me: ‘The disbelief (<span class=\"iTxt\">Kufr</span>) occurred earlier and it is the denial. Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h34\">[2:34]</a> except for Iblees. He refused and was arrogant, and he was one of the unbelievers</span>’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Asbat from Musa ibn Bukayr who has said the following: “Once I asked abu al-Hassan (a.s.) about disbelief and al-Shirk (paganism) as to which is before. The Imam said to me, ‘I have not experienced your involvement in polemics among the people.’ I then said, ‘Hisham ibn Salim has ordered me to ask you this question.’ The Imam said, ‘Disbelief is before and it is denial and rejection. Allah, the Most Majestic, the Most Holy, has said, . . except Iblis (Satan) who abstained out of pride, and so he became one of those who deny the truth.’” <a href=\"/#/books/quran:2#h34\">[2:34]</a> "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح بسنديه    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/115)"
        ],
        "index": 2839,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:165:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ زُرَارَةَ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) يَدْخُلُ النَّارَ مُؤْمِنٌ قَالَ لَا وَ اللَّهِ قُلْتُ فَمَا يَدْخُلُهَا إِلَّا كَافِرٌ قَالَ لَا إِلَّا مَنْ شَاءَ اللَّهُ فَلَمَّا رَدَدْتُ عَلَيْهِ مِرَاراً قَالَ لِي أَيْ زُرَارَةُ إِنِّي أَقُولُ لَا وَ أَقُولُ إِلَّا مَنْ شَاءَ اللَّهُ وَ أَنْتَ تَقُولُ لَا وَ لَا تَقُولُ إِلَّا مَنْ شَاءَ اللَّهُ ",
          "قَالَ فَحَدَّثَنِي هِشَامُ بْنُ الْحَكَمِ وَ حَمَّادٌ عَنْ زُرَارَةَ قَالَ قُلْتُ فِي نَفْسِي شَيْخٌ لَا عِلْمَ لَهُ بِالْخُصُومَةِ قَالَ فَقَالَ لِي يَا زُرَارَةُ مَا تَقُولُ فِيمَنْ أَقَرَّ لَكَ بِالْحُكْمِ أَ تَقْتُلُهُ مَا تَقُولُ فِي خَدَمِكُمْ وَ أَهْلِيكُمْ أَ تَقْتُلُهُمْ قَالَ فَقُلْتُ أَنَا وَ اللَّهِ الَّذِي لَا عِلْمَ لِي بِالْخُصُومَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajjaj, from Zurara who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘Would a <span class=\"iTxt\">Momin</span> enter into the Fire?’ He<sup>asws</sup> said: ‘No, by Allah<sup>azwj</sup>!’ I said, ‘So none would enter it except for an Unbeliever (<span class=\"iTxt\">Kafir</span>)?’ He<sup>asws</sup> said: ‘No, except the one whom Allah<sup>azwj</sup> so Desires to’. So when I reiterated it upon him<sup>asws</sup> time and again, he<sup>asws</sup> said to me: ‘Yes, Zurara! I<sup>asws</sup> am saying, ‘No’, and I<sup>asws</sup> am (also) saying: ‘Except for the one whom Allah<sup>azwj</sup> so Desires to’, while you are saying, ‘No’, and you are not saying, ‘Except the one whom Allah<sup>azwj</sup> so Desires to’’.",
            "He (the narrator) said, ‘Hisham Bin Al-Hakam narrated to me, and Hammad, from Zurara who said, ‘I said within myself, ‘And old man. There is no knowledge to him with the debates’. So he<sup>asws</sup> said to me: ‘O Zurara! What are you saying regarding the one who acknowledge to you with the judgment, would you kill him? What are you saying regarding your servant and your family, would you kill them?’ So I said (to myself), ‘I, by Allah<sup>azwj</sup>, am the one who has no knowledge for the debating’’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Abd al- Rahman ibn al-Hajjaj from Zurara who has said the following: “Once I asked abu Ja’far (a.s.) ‘Will a believer go in the fire?’ The Imam said, ‘No, by Allah.’ I then asked, ‘So no one will be sent in the fire except the unbelievers?’ The Imam said, ‘No, except whoever Allah wills.’ I (the narrator) repeated my question several times and the Imam said, ‘O Zurara, I say, “No,” and I say, ‘Except whoever Allah will wish’ and you say, “No,” but do not say, ‘Except whoever Allah will wish.’” Ibn abu ‘Umayr has said that Hisham ibn al-Hakam and Hammad have narrated from Zurara who has said the following: “I said to myself, ‘An old man has no knowledge of polemics.’ The narrator (Zurara) has said the Imam said to me, ‘O Zurara, what do you say about one who says, ‘I am at your command (whatever you say in matters of belief I accept). Will you kill him? What do you say about your servants and people very closely related to you? Will you kill them?’ “I (the narrator) then said to myself, ‘I am the one who has no knowledge of polemics.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/116)"
        ],
        "index": 2840,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:165:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ سُئِلَ عَنِ الْكُفْرِ وَ الشِّرْكِ أَيُّهُمَا أَقْدَمُ فَقَالَ الْكُفْرُ أَقْدَمُ وَ ذَلِكَ أَنَّ إِبْلِيسَ أَوَّلُ مَنْ كَفَرَ وَ كَانَ كُفْرُهُ غَيْرَ شِرْكٍ لِأَنَّهُ لَمْ يَدْعُ إِلَى عِبَادَةِ غَيْرِ اللَّهِ وَ إِنَّمَا دَعَا إِلَى ذَلِكَ بَعْدُ فَأَشْرَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Haroun Bin Muslim, from Mas’ada Bin Sadaqa who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> and he<sup>asws</sup> had been asked about the disbelief (<span class=\"iTxt\">Kufr</span>) and the association (<span class=\"iTxt\">Shirk</span>), ‘Which of the two occurred earlier?’ So he<sup>asws</sup> said: ‘(It was) the disbelief (<span class=\"iTxt\">Kufr</span>), and that is because Iblees<sup>la</sup> was the first one who disbelieved and his<sup>la</sup> disbelief was other than <span class=\"iTxt\">Shirk</span>, because he<sup>la</sup> did not (initially) submit to the worship of other than Allah<sup>azwj</sup>, and rather he<sup>la</sup> called towards that afterwards, so he<sup>la</sup> associated (committed <span class=\"iTxt\">Shirk</span>)’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from Harun ibn Muslim from Mas’adah ibn Sadaqa who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, when he was asked about disbelief and paganism which one was first, ‘Disbelief is first. Satan was the first to become an unbeliever and his disbelief was something other than al-Shirk (paganism) he did not invite to worship anyone other than Allah, he invited to such worship afterwards and thus, became a pagan.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/117)"
        ],
        "index": 2841,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:165:9",
        "text": [
          "هَارُونُ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ سُئِلَ مَا بَالُ الزَّانِي لَا تُسَمِّيهِ كَافِراً وَ تَارِكُ الصَّلَاةِ قَدْ سَمَّيْتَهُ كَافِراً وَ مَا الْحُجَّةُ فِي ذَلِكَ فَقَالَ لِأَنَّ الزَّانِيَ وَ مَا أَشْبَهَهُ إِنَّمَا يَفْعَلُ ذَلِكَ لِمَكَانِ الشَّهْوَةِ لِأَنَّهَا تَغْلِبُهُ وَ تَارِكُ الصَّلَاةِ لَا يَتْرُكُهَا إِلَّا اسْتِخْفَافاً بِهَا وَ ذَلِكَ لِأَنَّكَ لَا تَجِدُ الزَّانِيَ يَأْتِي الْمَرْأَةَ إِلَّا وَ هُوَ مُسْتَلِذٌّ لِإِتْيَانِهِ إِيَّاهَا قَاصِداً إِلَيْهَا وَ كُلُّ مَنْ تَرَكَ الصَّلَاةَ قَاصِداً إِلَيْهَا فَلَيْسَ يَكُونُ قَصْدُهُ لِتَرْكِهَا اللَّذَّةَ فَإِذَا نُفِيَتِ اللَّذَّةُ وَقَعَ الِاسْتِخْفَافُ وَ إِذَا وَقَعَ الِاسْتِخْفَافُ وَقَعَ الْكُفْرُ ",
          "قَالَ وَ سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ قِيلَ لَهُ مَا الْفَرْقُ بَيْنَ مَنْ نَظَرَ إِلَى امْرَأَةٍ فَزَنَى بِهَا أَوْ خَمْرٍ فَشَرِبَهَا وَ بَيْنَ مَنْ تَرَكَ الصَّلَاةَ حَتَّى لَا يَكُونَ الزَّانِي وَ شَارِبُ الْخَمْرِ مُسْتَخِفّاً كَمَا يَسْتَخِفُّ تَارِكُ الصَّلَاةِ وَ مَا الْحُجَّةُ فِي ذَلِكَ وَ مَا الْعِلَّةُ الَّتِي تَفْرُقُ بَيْنَهُمَا ",
          "قَالَ الْحُجَّةُ أَنَّ كُلَّمَا أَدْخَلْتَ أَنْتَ نَفْسَكَ فِيهِ لَمْ يَدْعُكَ إِلَيْهِ دَاعٍ وَ لَمْ يَغْلِبْكَ غَالِبُ شَهْوَةٍ مِثْلَ الزِّنَى وَ شُرْبِ الْخَمْرِ وَ أَنْتَ دَعَوْتَ نَفْسَكَ إِلَى تَرْكِ الصَّلَاةِ وَ لَيْسَ ثَمَّ شَهْوَةٌ فَهُوَ الِاسْتِخْفَافُ بِعَيْنِهِ وَ هَذَا فَرْقُ مَا بَيْنَهُمَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Haroun, from Mas’ada Bin Sadaqa who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> and he<sup>asws</sup> had been asked, ‘What is the matter that the adulterer is not named as an Unbeliever (<span class=\"iTxt\">Kafir</span>) and the neglector of the <span class=\"iTxt\">Salāt</span> has been named as a Unbeliever (<span class=\"iTxt\">Kafir</span>), and what is the proof with regards to that?’ So he<sup>asws</sup> said: ‘Because the adulterer and whoever resembles him, rather does that under the influence of the lustful desire, because it overcomes him, while the neglector of the <span class=\"iTxt\">Salāt</span> does not neglect it except considering it as insignificant, and that is because you will never find the adulterer going to the woman except for deriving the pleasure of going to her, and everyone who neglects the <span class=\"iTxt\">Salāt</span> is aiming to it, but his aim of neglecting it is not for the (sake of) pleasure. So when the pleasure is negated, the insignificance sets in, and when the insignificance occurs, the disbelief (<span class=\"iTxt\">Kufr</span>) occurs’. ",
            "He (the narrator) said, ‘And Abu Abdullah<sup>asws</sup> was asked and it was said to him<sup>asws</sup>, ‘What is the difference between the one who looks at a woman so he commits adultery with her, or (looks) at wine, so he drinks it, and the one who neglects the <span class=\"iTxt\">Salāt</span>, to the extent that the adulterer and the drinker of wine are not deemed to be as ones who are considering it as insignificant like the neglector of the <span class=\"iTxt\">Salāt</span> is deemed to consider it as insignificant, and what is the proof with regards to that, and what is the reason which differentiates between the two?’ ",
            "He<sup style=\"font-weight: normal\">asws</sup> said: ‘The proof is that every time you enter yourself into it, it is not inviting you with an invitation, and a lustful desire does not overcome you like the adultery and drinking of the wine, and you are inviting yourself to the neglecting of the <span class=\"iTxt\">Salāt</span>, and there is no desire then. So it is considering it insignificant exactly, and this is the difference what is between the two’."
          ],
          "en.sarwar": [
            "9. Harun has narrated from Mas’adah ibn Sadaqa who has said the following: “I heard abu ‘Abd Allah (a.s.) when he was asked, ‘Why is it that a fornicator is not considered an unbeliever as one ignoring the prayer is? What is the reason and evidence?’ The Imam said, ‘A fornicator and so forth commits such act due to lust that influences him, while one ignoring the prayer does so due to his considering it insignificant. You do not find a fornicator contact a female for any other reason besides lust and desire that motivates him. One who ignores the prayer does not do so for pleasure. When you negate lust and pleasure then the motive is considering it insignificant, and when this happens it is disbelief.’ “The narrator has said that abu ‘Abd Allah (a.s.) was asked, ‘What is the difference between a person’s looking at a female, then fornicating or to wine, then drinking it and one who ignores the prayer? Why is it that in the two aforementioned cases it is not ‘considered insignificant’ as is the case with ignoring prayer? What is the proof and reason that establish a difference?’ The Imam said, ‘Proof is that whenever you place your soul in something without any urging motive like lust and so forth, that are found in fornication and wine. In a case such as prayer in which there is no lust and desire, then it (the motive) is considering it insignificant and that is the difference between this and the other two cases.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/118)"
        ],
        "index": 2842,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:165:10",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ شَكَّ فِي اللَّهِ وَ فِي رَسُولِهِ ( صلى الله عليه وآله ) فَهُوَ كَافِرٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who doubts in Allah<sup>azwj</sup> and in His<sup>azwj</sup> Rasool<sup>saww</sup>, so his is an Unbeliver (<span class=\"iTxt\">Kafir</span>)’."
          ],
          "en.sarwar": [
            "10. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn Mahbub from ‘Abd Allah ibn Sinan from abu ‘Abd Allah (a.s.) who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘Whoever doubts Allah and the Messenger of Allah is an unbeliever.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/119)"
        ],
        "index": 2843,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:165:11",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ صَفْوَانَ عَنْ مَنْصُورِ بْنِ حَازِمٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَنْ شَكَّ فِي رَسُولِ اللَّهِ ( صلى الله عليه وآله ) قَالَ كَافِرٌ قُلْتُ فَمَنْ شَكَّ فِي كُفْرِ الشَّاكِّ فَهُوَ كَافِرٌ فَأَمْسَكَ عَنِّي فَرَدَدْتُ عَلَيْهِ ثَلَاثَ مَرَّاتٍ فَاسْتَبَنْتُ فِي وَجْهِهِ الْغَضَبَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Safwan, from Mansour Bin Hazim who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘(What about) the one who doubts in Rasool-Allah<sup>saw</sup>?’. He<sup>asws</sup> said: ‘An Unbeliever (<span class=\"iTxt\">Kafir</span>)’. I said, ‘So the one who doubts in the disbelief (<span class=\"iTxt\">Kufr</span>) of the doubting one, so he is an Unbeliever (<span class=\"iTxt\">Kafir</span>)?’ So he<sup>asws</sup> withheld from me. So I reiterated upon him<sup>asws</sup> three times, and the anger became apparent in his<sup>asws</sup> face’."
          ],
          "en.sarwar": [
            "11. Ali ibn Ibrahim has narrated from his father from Safwan from Mansur ibn Hazim who has said the following: “Once I asked abu ‘Abd Allah (a.s.) ‘What if one doubts the Messenger of Allah?’ The Imam said, ‘He is an unbeliever.’ I then asked, ‘What if one doubts the disbelief of such a doubting person? Is he also an unbeliever?’ The Imam did not answer me and I asked it three times. Then 1 noticed anger on his face?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/119)"
        ],
        "index": 2844,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:165:12",
        "refs": {
          "Quran": [
            "/books/quran:5:5"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ عُبَيْدِ بْنِ زُرَارَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ يَكْفُرْ بِالْإِيمانِ فَقَدْ حَبِطَ عَمَلُهُ فَقَالَ مَنْ تَرَكَ الْعَمَلَ الَّذِي أَقَرَّ بِهِ قُلْتُ فَمَا مَوْضِعُ تَرْكِ الْعَمَلِ حَتَّى يَدَعَهُ أَجْمَعَ قَالَ مِنْهُ الَّذِي يَدَعُ الصَّلَاةَ مُتَعَمِّداً لَا مِنْ سُكْرٍ وَ لَا مِنْ عِلَّةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr, from Ubeyd Bin Zurara who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:5#h5\">[5:5]</a> and whoever denies the faith, his work indeed would be Confiscated</span>. So he<sup>asws</sup> said: ‘The one who neglects the deed which he had acknowledge with’. I said, ‘So what is the subject of the neglected deed to the extent that he (is deemed) to have left the entirety of it?’ He<sup>asws</sup> From it is the one who leaves the <span class=\"iTxt\">Salāt</span> deliberately, neither from intoxication (of sleep) nor from an illness’."
          ],
          "en.sarwar": [
            "12. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from ibn Bukayr from ‘Ubayd ibn Zurara who has said the following: “Once I asked abu ‘Abd Allah (a.s.) about the words of Allah, the Most Majestic, the Most Holy, ‘The deeds of anyone who rejects belief, certainly, become fruitless. He on the Day of Judgment will be of those who lose.’ <a href=\"/#/books/quran:5#h5\">[5:5]</a> The Imam said, ‘It is he who ignores a deed that has held to be true.’ I then asked, ‘What kind of deed is it that has such consequences if ignored?’ The Imam said, ‘Of such deed is ignoring the prayer purposely not because of drunkenness or illness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/120)"
        ],
        "index": 2845,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:165:13",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ حَكِيمٍ وَ حَمَّادٍ عَنْ أَبِي مَسْرُوقٍ قَالَ سَأَلَنِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَنْ أَهْلِ الْبَصْرَةِ فَقَالَ لِي مَا هُمْ قُلْتُ مُرْجِئَةٌ وَ قَدَرِيَّةٌ وَ حَرُورِيَّةٌ فَقَالَ لَعَنَ اللَّهُ تِلْكَ الْمِلَلَ الْكَافِرَةَ الْمُشْرِكَةَ الَّتِي لَا تَعْبُدُ اللَّهَ عَلَى شَيْ‏ءٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muhammad Bin Hakeym and Hammad, from Abu Masrouq who said, ",
            "‘Abu Abdullah<sup>asws</sup> asked me about the people of Al-Basra and he<sup>asws</sup> said to me: ‘What are they?’ I said, ‘Murjiites, and Qadiriyya, and Harouriyya (sects)’. So he<sup>asws</sup> said: ‘May the Curse of Allah<sup>azwj</sup> upon those religion of the Unbelievers (<span class=\"iTxt\">Kafir</span>s) and the Polytheists (<span class=\"iTxt\">Mushrik</span>), those who do not worship Allah<sup>azwj</sup> upon anything’."
          ],
          "en.sarwar": [
            "13. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Muhammad ibn Hakim and Hammad from abu Masruq who has said the following: “Once abu ‘Abd Allah (a.s.) asked me about the people of Basra and asked me, ‘Who are they?’ I said, ‘They are Murji’a’, Qadriah and Harawriah’ (names of groups of certain beliefs). The Imam said, ‘May Allah condemn such nations of disbelief and paganism who have no basis for worshipping Allah.’” Note: Murji’a were those who did not believe in the true position of Amir al- Mu’minin, Ali ibn abu Talib (a.s.) Qadriah believed in absolute free will and Harawriah was of the group who opposed Amir al-Mu’minin, Ali ibn abu Talib, recipient of divine supreme covenant. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/121)"
        ],
        "index": 2846,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:165:14",
        "text": [
          "عَنْهُ عَنِ الْخَطَّابِ بْنِ مَسْلَمَةَ وَ أَبَانٍ عَنِ الْفُضَيْلِ قَالَ دَخَلْتُ عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) وَ عِنْدَهُ رَجُلٌ فَلَمَّا قَعَدْتُ قَامَ الرَّجُلُ فَخَرَجَ فَقَالَ لِي يَا فُضَيْلُ مَا هَذَا عِنْدَكَ قُلْتُ وَ مَا هُوَ قَالَ حَرُورِيٌّ قُلْتُ كَافِرٌ قَالَ إِي وَ اللَّهِ مُشْرِكٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Al Khattab Bin Maslama and Aban, from Al Fuzayl who said, ",
            "‘I went over to Abu Ja’far<sup>asws</sup> and in his<sup>asws</sup> presence was a man. So when I was seated, the man stood up and went out, and he<sup>asws</sup> said to me: ‘O Fuzayl! What is this one in your presence?’ I said, ‘And what is it?’ He<sup>asws</sup> said: ‘(The) Harouriyya (a sect)’. I said, ‘An unbeliever (<span class=\"iTxt\">Kafir</span>)’. He<sup>asws</sup> said: ‘Yes, by Allah<sup>azwj</sup>, a Polytheist (<span class=\"iTxt\">Mushrik</span>)’."
          ],
          "en.sarwar": [
            "14. It is narrated from him (narrator of the Hadith above) from al-Khattab ibn Muslimah and Aban from al-Fudayl who has said the following: “Once I went in the presence of abu Ja’far (a.s.) and saw a man with him. As I sat down, the man stood up and left. The Imam said to me, ‘O Fudayl, what is this with you?’ I asked, ‘What is he?’ The Imam said, ‘He is a Harawri .’ I asked, ‘Is he an unbeliever?’ The Imam said, ‘Yes, by Allah, he is a Mushrik (one who considers things as partners of Allah).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/121)"
        ],
        "index": 2847,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:165:15",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ كُلُّ شَيْ‏ءٍ يَجُرُّهُ الْإِقْرَارُ وَ التَّسْلِيمُ فَهُوَ الْإِيمَانُ وَ كُلُّ شَيْ‏ءٍ يَجُرُّهُ الْإِنْكَارُ وَ الْجُحُودُ فَهُوَ الْكُفْرُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Abu Ayoub, from Muhammad Bin Muslim who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘Everything which attracts the acknowledgement and the submission, so it is the <span class=\"iTxt\">Emān</span>, and everything which attracts the denial and the rejection, so it is the disbelief’."
          ],
          "en.sarwar": [
            "15. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from abu Ayyub from Muhammad ibn Muslim who has said the following: “I heard abu Ja’far (a.s.) saying, ‘Anything that professing and submission carry is belief, and anything that denial and rejection carry is disbelief.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور معتبر عند ي   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/122)"
        ],
        "index": 2848,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:165:16",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي حَمْزَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ إِنَّ عَلِيّاً ( صلوات الله عليه )  بَابٌ فَتَحَهُ اللَّهُ مَنْ دَخَلَهُ كَانَ مُؤْمِناً وَ مَنْ خَرَجَ مِنْهُ كَانَ كَافِراً ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washa, from Abdullah Bin Sinan, from Abu Hamza who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying that Ali<sup>asws</sup> is a door which Allah<sup>azwj</sup> Opened. The one who enters it would be a <span class=\"iTxt\">Momin</span>, and the one who exits from it would be an Unbeliever (<span class=\"iTxt\">Kafir</span>)’."
          ],
          "en.sarwar": [
            "16. Al-Husayn ibn Muhammad has narrated from Mu’alla’ ibn Muhammad from al- Washsha’ from ‘Abd Allah ibn Sinan from abu Hamza who has said the following: “I heard abu la’ far (a.s.) saying, ‘Amir al-Mu’minin, Ali ibn abu Talib (a.s.) is a (means of) access that Allah has prepared. Whoever approaches through this access is a believer and whoever departs is an unbeliever.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/122)"
        ],
        "index": 2849,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:165:17",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ يَحْيَى بْنِ الْمُبَارَكِ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ وَ ابْنِ سِنَانٍ وَ سَمَاعَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) طَاعَةُ عَلِيٍّ ( عليه السلام ) ذُلٌّ وَ مَعْصِيَتُهُ كُفْرٌ بِاللَّهِ قِيلَ يَا رَسُولَ اللَّهِ وَ كَيْفَ يَكُونُ طَاعَةُ عَلِيٍّ ( عليه السلام ) ذُلًّا وَ مَعْصِيَتُهُ كُفْراً بِاللَّهِ قَالَ إِنَّ عَلِيّاً ( عليه السلام ) يَحْمِلُكُمْ عَلَى الْحَقِّ فَإِنْ أَطَعْتُمُوهُ ذَلَلْتُمْ وَ إِنْ عَصَيْتُمُوهُ كَفَرْتُمْ بِاللَّهِ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Yahya Bin Al Mubarak, from Abdullah Bin Jabala, from Is’haq Bin Ammar and Ibn Sinan and Sama’at, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Obeying Ali<sup>asws</sup> is suffering (in this world) and disobeying him<sup>asws</sup> is disbelief (<span class=\"iTxt\">Kufr</span>) in Allah<sup>azwj</sup>’. It was said, ‘O Rasool-Allah<sup>saww</sup>! And how can obedience to Ali<sup>asws</sup> be a suffering (in this world) and disobedience to him<sup>asws</sup> be disbelief (<span class=\"iTxt\">Kufr</span>) in Allah<sup>azwj</sup>?’ He<sup>saww</sup> said: ‘Ali<sup>asws</sup> carries you all upon the Truth, so if you were to obey him<sup>asws</sup> you will suffer, but if you were to disobey him<sup>asws</sup>, you would have disbelieved in Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "17. A number of our people have narrated from Sahl ibn Ziyad from Yahya ibn al- Mubarak from ‘Abd Allah ibn Jabalah from Ishaq ibn ‘Ammar and ibn Sinan and Sama’a from abu Basir from abu ‘Abd Allah (a.s.) who has said the following: “The Messenger of Allah has said, ‘Obedience to Ali (a.s.) is suffering (in this world) and disobedience to him is disbelief in Allah.’ It was said, ‘O Messenger of Allah, how can obedience to Ali (a.s.) be suffering and disobedience to him disbelief in Allah?’ The Messenger of Allah said, ‘Ali (a.s.) leads you to the truth. If you obey him you will suffer and if you disobey him you will become unbelievers in Allah, the Most Majestic, the Most Holy.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/123)"
        ],
        "index": 2850,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:165:18",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ أَبِي بَكْرٍ قَالَ سَمِعْتُ أَبَا الْحَسَنِ مُوسَى ( عليه السلام ) يَقُولُ إِنَّ عَلِيّاً ( عليه السلام ) بَابٌ مِنْ أَبْوَابِ الْهُدَى فَمَنْ دَخَلَ مِنْ بَابِ عَلِيٍّ كَانَ مُؤْمِناً وَ مَنْ خَرَجَ مِنْهُ كَانَ كَافِراً وَ مَنْ لَمْ يَدْخُلْ فِيهِ وَ لَمْ يَخْرُجْ مِنْهُ كَانَ فِي الطَّبَقَةِ الَّذِينَ لِلَّهِ فِيهِمُ الْمَشِيئَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washa who said, ‘Ibrahim Bin Abu Bakr narrated to me saying, ",
            "‘I heard Abu Al-Hassan Musa<sup>asws</sup> saying that Ali<sup>asws</sup> is a door from the doors of Guidance. So the one who enters from the door of Ali<sup>asws</sup> would be a <span class=\"iTxt\">Momin</span>, and the one who exits from it would be a Unbeliver (<span class=\"iTxt\">Kafir</span>), and the one who does not enter into it and does not exit out from it would be in the category of those for Allah<sup>azwj</sup> there would be a Desire (Decision) regarding them’."
          ],
          "en.sarwar": [
            "18. Al-Husayn ibn Muhammad has narrated from Mu’alla ibn Muhammad from al- Washsha’ who has said that narrated to him Ibrahim ibn abu Bakr who has said the following: “I heard abu al-Hassan Musa (a.s.) saying, ‘Ali (a.s.) is a door of the doors of guidance. Whoever enters by the door of Ali (a.s.) is a believer and whoever ignors this door is an unbeliever. Whoever does not enter and does not leave is among the group about whom Allah has the will and decision.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/123)"
        ],
        "index": 2851,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:165:19",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَوْ أَنَّ الْعِبَادَ إِذَا جَهِلُوا وَقَفُوا وَ لَمْ يَجْحَدُوا لَمْ يَكْفُرُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Ibn Bukeyr, from Zurara, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘If the servant, when they were ignorant (of a matter), paused and not rejected, would not have been Unbelievers (<span class=\"iTxt\">Kafir</span>s)’."
          ],
          "en.sarwar": [
            "19. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from ibn Bukayr from Zurara from abu ‘Abd Allah (a.s.) who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘Had the servants (of Allah) when ignorant stood on hold and did not reject or deny they would not become unbelievers.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/124)"
        ],
        "index": 2852,
        "local_index": 20,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:165:20",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ فُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ نَصَبَ عَلِيّاً ( عليه السلام ) عَلَماً بَيْنَهُ وَ بَيْنَ خَلْقِهِ فَمَنْ عَرَفَهُ كَانَ مُؤْمِناً وَ مَنْ أَنْكَرَهُ كَانَ كَافِراً وَ مَنْ جَهِلَهُ كَانَ ضَالًّا وَ مَنْ نَصَبَ مَعَهُ شَيْئاً كَانَ مُشْرِكاً وَ مَنْ جَاءَ بِوَلَايَتِهِ دَخَلَ الْجَنَّةَ وَ مَنْ جَاءَ بِعَدَاوَتِهِ دَخَلَ النَّارَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Fuzayl Bin Yasaar, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Appointed Ali<sup>asws</sup> as a flag between Him<sup>azwj</sup> and His<sup>azwj</sup> creatures. So the one who recognised him<sup>asws</sup> would be a <span class=\"iTxt\">Momin</span>, but the one who denied him<sup>asws</sup> would be a Unbeliever (<span class=\"iTxt\">Kafir</span>), and the one who was ignorant of him<sup>asws</sup> would stray; and the one who appoints anything (anyone else) with him would be a Polytheist (<span class=\"iTxt\">Mushrik</span>), and the one who comes with his<sup>asws</sup> Wilayah would enter the Paradise, and the one who comes with his<sup>asws</sup> animosity would enter the Fire’."
          ],
          "en.sarwar": [
            "20. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from Fudayl ibn Yasar from abu Ja’far (a.s.) who has said the following: “Allah, the Most Majestic, the Most Holy, has appointed Ali (a.s.) as a sign between Himself and His creatures. Those who come to know him turn into believing people and those who reject him end up as unbelievers. Those who are ignorant of him become among the straying people. Those who appoint something with him grow to be Mushrik (pagans) and those who come under his guardianship will enter paradise and those who come with his animosity will enter the fire.’” "
          ]
        }
      },
      {
        "index": 2853,
        "local_index": 21,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:165:21",
        "text": [
          "يُونُسُ عَنْ مُوسَى بْنِ بَكْرٍ عَنْ أَبِي إِبْرَاهِيمَ ( عليه السلام ) قَالَ إِنَّ عَلِيّاً ( عليه السلام ) بَابٌ مِنْ أَبْوَابِ الْجَنَّةِ فَمَنْ دَخَلَ بَابَهُ كَانَ مُؤْمِناً وَ مَنْ خَرَجَ مِنْ بَابِهِ كَانَ كَافِراً وَ مَنْ لَمْ يَدْخُلْ فِيهِ وَ لَمْ يَخْرُجْ مِنْهُ كَانَ فِي الطَّبَقَةِ الَّتِي لِلَّهِ فِيهِمُ الْمَشِيئَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Yunus, from Musa Bin Bakr, ",
            "(It has been narrated) from Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) having said that Ali<sup>asws</sup> is a door from the doors of the Paradise. So the one who enters his<sup>asws</sup> door would be a <span class=\"iTxt\">Momin</span>, but the one who exits from his<sup>asws</sup> door would be a Unbeliever (<span class=\"iTxt\">Kafir</span>), and the one who does not enter into it and does not exit from it would be in the category whose (fate would depend on) Allah<sup>azwj</sup> Desire (Decision) regarding them’."
          ],
          "en.sarwar": [
            "21. Yunus has narrated from Musa ibn Bukayr from abu Ibrahim (a.s.) who has said the following: “Ali (a.s.) is a door of the doors of paradise. Whoever approaches through him is a believer, those who depart him are unbelievers, and those who do not approach or leave are among the group about whom Allah has the will to decide.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:165",
  "kind": "verse_list"
}