{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 166"
        },
        "path": "/books/al-kafi:2:1:166",
        "titles": {
          "ar": "بَابُ وُجُوهِ الْكُفْرِ",
          "en": "Chapter 166 – Aspects of the Kufr (Disbelief)"
        }
      }
    ],
    "index": 354,
    "local_index": 166,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 167"
        },
        "path": "/books/al-kafi:2:1:167",
        "titles": {
          "ar": "بَابُ دَعَائِمِ الْكُفْرِ وَ شُعَبِهِ",
          "en": "Chapter 167 – The pillars of the Kufr (Disbelief) and its branches"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 165"
        },
        "path": "/books/al-kafi:2:1:165",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الْكُفْرِ</span>",
          "en": "Chapter 165 – The Disbelief (Kufr)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:166",
    "titles": {
      "ar": "بَابُ وُجُوهِ الْكُفْرِ",
      "en": "Chapter 166 – Aspects of the Kufr (Disbelief)"
    },
    "verse_count": 1,
    "verse_start_index": 2853,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/124)"
        ],
        "index": 2854,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:166:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ بَكْرِ بْنِ صَالِحٍ عَنِ الْقَاسِمِ بْنِ يَزِيدَ عَنْ أَبِي عَمْرٍو الزُّبَيْرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ أَخْبِرْنِي عَنْ وُجُوهِ الْكُفْرِ فِي كِتَابِ اللَّهِ عَزَّ وَ جَلَّ قَالَ الْكُفْرُ فِي كِتَابِ اللَّهِ عَلَى خَمْسَةِ أَوْجُهٍ فَمِنْهَا كُفْرُ الْجُحُودُ وَ الْجُحُودُ عَلَى وَجْهَيْنِ وَ الْكُفْرُ بِتَرْكِ مَا أَمَرَ اللَّهُ وَ كُفْرُ الْبَرَاءَةِ وَ كُفْرُ النِّعَمِ ",
          "فَأَمَّا كُفْرُ الْجُحُودِ فَهُوَ الْجُحُودُ بِالرُّبُوبِيَّةِ وَ هُوَ قَوْلُ مَنْ يَقُولُ لَا رَبَّ وَ لَا جَنَّةَ وَ لَا نَارَ وَ هُوَ قَوْلُ صِنْفَيْنِ مِنَ الزَّنَادِقَةِ يُقَالُ لَهُمُ الدَّهْرِيَّةُ وَ هُمُ الَّذِينَ يَقُولُونَ وَ ما يُهْلِكُنا إِلَّا الدَّهْرُ وَ هُوَ دِينٌ وَضَعُوهُ لِأَنْفُسِهِمْ بِالِاسْتِحْسَانِ عَلَى غَيْرِ تَثَبُّتٍ مِنْهُمْ وَ لَا تَحْقِيقٍ لِشَيْ‏ءٍ مِمَّا يَقُولُونَ",
          "قَالَ اللَّهُ عَزَّ وَ جَلَّ إِنْ هُمْ إِلَّا يَظُنُّونَ أَنَّ ذَلِكَ كَمَا يَقُولُونَ وَ قَالَ إِنَّ الَّذِينَ كَفَرُوا سَواءٌ عَلَيْهِمْ أَ أَنْذَرْتَهُمْ أَمْ لَمْ تُنْذِرْهُمْ لا يُؤْمِنُونَ يَعْنِي بِتَوْحِيدِ اللَّهِ تَعَالَى فَهَذَا أَحَدُ وُجُوهِ الْكُفْرِ",
          "وَ أَمَّا الْوَجْهُ الْآخَرُ مِنَ الْجُحُودِ عَلَى مَعْرِفَةٍ وَ هُوَ أَنْ يَجْحَدَ الْجَاحِدُ وَ هُوَ يَعْلَمُ أَنَّهُ حَقٌّ قَدِ اسْتَقَرَّ عِنْدَهُ وَ قَدْ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ جَحَدُوا بِها وَ اسْتَيْقَنَتْها أَنْفُسُهُمْ ظُلْماً وَ عُلُوًّا وَ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ كانُوا مِنْ قَبْلُ يَسْتَفْتِحُونَ عَلَى الَّذِينَ كَفَرُوا فَلَمَّا جاءَهُمْ ما عَرَفُوا كَفَرُوا بِهِ فَلَعْنَةُ اللَّهِ عَلَى الْكافِرِينَ فَهَذَا تَفْسِيرُ وَجْهَيِ الْجُحُودِ ",
          "وَ الْوَجْهُ الثَّالِثُ مِنَ الْكُفْرِ كُفْرُ النِّعَمِ وَ ذَلِكَ قَوْلُهُ تَعَالَى يَحْكِي قَوْلَ سُلَيْمَانَ ( عليه السلام ) هذا مِنْ فَضْلِ رَبِّي لِيَبْلُوَنِي أَ أَشْكُرُ أَمْ أَكْفُرُ وَ مَنْ شَكَرَ فَإِنَّما يَشْكُرُ لِنَفْسِهِ وَ مَنْ كَفَرَ فَإِنَّ رَبِّي غَنِيٌّ كَرِيمٌ وَ قَالَ لَئِنْ شَكَرْتُمْ لَأَزِيدَنَّكُمْ وَ لَئِنْ كَفَرْتُمْ إِنَّ عَذابِي لَشَدِيدٌ وَ قَالَ فَاذْكُرُونِي أَذْكُرْكُمْ وَ اشْكُرُوا لِي وَ لا تَكْفُرُونِ ",
          "وَ الْوَجْهُ الرَّابِعُ مِنَ الْكُفْرِ تَرْكُ مَا أَمَرَ اللَّهُ عَزَّ وَ جَلَّ بِهِ وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ إِذْ أَخَذْنا مِيثاقَكُمْ لا تَسْفِكُونَ دِماءَكُمْ وَ لا تُخْرِجُونَ أَنْفُسَكُمْ مِنْ دِيارِكُمْ ثُمَّ أَقْرَرْتُمْ وَ أَنْتُمْ تَشْهَدُونَ ثُمَّ أَنْتُمْ هؤُلاءِ تَقْتُلُونَ أَنْفُسَكُمْ وَ تُخْرِجُونَ فَرِيقاً مِنْكُمْ مِنْ دِيارِهِمْ تَظاهَرُونَ عَلَيْهِمْ بِالْإِثْمِ وَ الْعُدْوانِ وَ إِنْ يَأْتُوكُمْ أُسارى تُفادُوهُمْ وَ هُوَ مُحَرَّمٌ عَلَيْكُمْ إِخْراجُهُمْ أَ فَتُؤْمِنُونَ بِبَعْضِ الْكِتابِ وَ تَكْفُرُونَ بِبَعْضٍ فَما جَزاءُ مَنْ يَفْعَلُ ذلِكَ مِنْكُمْ ",
          "فَكَفَّرَهُمْ بِتَرْكِ مَا أَمَرَ اللَّهُ عَزَّ وَ جَلَّ بِهِ وَ نَسَبَهُمْ إِلَى الْإِيمَانِ وَ لَمْ يَقْبَلْهُ مِنْهُمْ وَ لَمْ يَنْفَعْهُمْ عِنْدَهُ فَقَالَ فَما جَزاءُ مَنْ يَفْعَلُ ذلِكَ مِنْكُمْ إِلَّا خِزْيٌ فِي الْحَياةِ الدُّنْيا وَ يَوْمَ الْقِيامَةِ يُرَدُّونَ إِلى أَشَدِّ الْعَذابِ وَ مَا اللَّهُ بِغافِلٍ عَمَّا تَعْمَلُونَ ",
          "وَ الْوَجْهُ الْخَامِسُ مِنَ الْكُفْرِ كُفْرُ الْبَرَاءَةِ وَ ذَلِكَ قَوْلُهُ عَزَّ وَ جَلَّ يَحْكِي قَوْلَ إِبْرَاهِيمَ ( عليه السلام ) كَفَرْنا بِكُمْ وَ بَدا بَيْنَنا وَ بَيْنَكُمُ الْعَداوَةُ وَ الْبَغْضاءُ أَبَداً حَتَّى تُؤْمِنُوا بِاللَّهِ وَحْدَهُ يَعْنِي تَبَرَّأْنَا مِنْكُمْ",
          "وَ قَالَ يَذْكُرُ إِبْلِيسَ وَ تَبْرِئَتَهُ مِنْ أَوْلِيَائِهِ مِنَ الْإِنْسِ يَوْمَ الْقِيَامَةِ إِنِّي كَفَرْتُ بِما أَشْرَكْتُمُونِ مِنْ قَبْلُ وَ قَالَ إِنَّمَا اتَّخَذْتُمْ مِنْ دُونِ اللَّهِ أَوْثاناً مَوَدَّةَ بَيْنِكُمْ فِي الْحَياةِ الدُّنْيا ثُمَّ يَوْمَ الْقِيامَةِ يَكْفُرُ بَعْضُكُمْ بِبَعْضٍ وَ يَلْعَنُ بَعْضُكُمْ بَعْضاً يَعْنِي يَتَبَرَّأُ بَعْضُكُمْ مِنْ بَعْضٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Bakr Bin Salih, from Al Qasim Bin Yazeed, from Abu Amro Al Zubeyri, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘Inform me about the aspects of the <span class=\"iTxt\">Kufr</span> (disbelief) in the Book of Allah<sup>azwj</sup> Mighty and Majestic’. He<sup>asws</sup> said: ‘The <span class=\"iTxt\">Kufr</span> (disbelief) in the Book of Allah<sup>azwj</sup> is upon five aspects. So, from these is the <span class=\"iTxt\">Kufr</span> (disbelief) of the denial. And the denial is upon two aspects – the <span class=\"iTxt\">Kufr</span> (disbelief) by neglecting what Allah<sup>azwj</sup> Commanded for, and <span class=\"iTxt\">Kufr</span> (disbelief) of the disownment (<span class=\"iTxt\">Tabarra</span>); and there is the <span class=\"iTxt\">Kufr</span> (disbelief) of the Bounties.",
            "So, as for the <span class=\"iTxt\">Kufr</span> of the denial, so it is the denial of the Lordship (of Allah<sup>azwj</sup>), and it is the speech of the one who is saying, ‘There is neither a Lord<sup>azwj</sup>, nor a Paradise, nor a Fire, and it is the speech of two types of the atheists called the <span class=\"iTxt\">‘Dahriyya’</span> (Eternalists); and they are the ones who are saying, <span class=\"ibTxt\">[45:24] and nothing destroys us but the passage of time</span>’; and it is a religion placed for their own selves with the approval upon without there being an affirmation from them, nor any investigation of anything from what they are saying.  ",
            "Allah<sup>azwj</sup> Mighty and Mjestic Says <span class=\"ibTxt\">[45:24] they only but conjecture</span>, if it was like as what they are saying. And He<sup>azwj</sup> Said <span class=\"ibTxt\">[36:10] And it is alike to them whether you warn them or do not warn them, they will not be believing</span>. Meaning, (believing) in the Oneness of Allah<sup>azwj</sup> the Exalted. Thus, this is one of the aspects of the disbelief (<span class=\"iTxt\">Kufr</span>).",
            "And as for the other aspect from the denial upon the recognition, and it is that the denier denies and he knows that it is true which he has already acknowledged with himself, and Allah<sup>azwj</sup> Mighty and Majestic has Said <span class=\"ibTxt\">[27:14] And they denied with it unjustly and out of pride although they were certain themselves</span>. And Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\">[2:89] And when there came to them a Book from Allah Verifying that which was with them, and beforehand they used to pray for victory against those who disbelieve, but when there came to them what they recognised, they disbelieved in it; so the Curse of Allah is on the unbelievers</span>. So this is the interpretation of the aspect of the denial.",
            "And the third aspect from the <span class=\"iTxt\">Kufr</span> (disbelief) is the <span class=\"iTxt\">Kufr</span> of the Bounties, and these are the Words of the Exalted Relating the words of Suleyman<sup>as</sup> <span class=\"ibTxt\">This is from the Grace of my Lord that He may Try me whether I am grateful or ungrateful; and whoever is grateful, so he is grateful for his own soul, and whoever is ungrateful, then surely my Lord is Self-sufficient, Generous</span>. And He<sup>azwj</sup> Said <span class=\"ibTxt\">[14:7] If you are grateful, I would Increase it more for you, and if you are ungrateful, My Punishment is truly Severe</span>. And He<sup>azwj</sup> Said <span class=\"ibTxt\">[2:152] Therefore remember Me, I will remember you, and be thankful to Me, and do not be ungrateful to Me</span>’.",
            "And the fourth aspect from the <span class=\"iTxt\">Kufr</span> (disbelief) is neglecting what Allah<sup>azwj</sup> Mighty and Majestic had Commanded with, and these are the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[2:84] And when We Took a Covenant with you: You shall not shed your blood and you shall not throw your people out of your houses; then you gave a promise while you witnessed [2:85] Then you are those who kill your people and turn a party from among you out of their homes, backing each other up against them unlawfully and exceeding the limits; and if they were to come to you as captives, you would ransom them - while their very turning out was unlawful for you. Do you then believe in a part of the Book and disbelieve in the other? What then is the Recompense of such among you as do this</span>.",
            "So their <span class=\"iTxt\">Kufr</span> (disbelief) was with the neglecting of what Allah<sup>azwj</sup> Mighty and Majestic had Commanded with and their linking to the <span class=\"iTxt\">Emān</span>, and it would not be Accepted from them and it will not benefit them in His<sup>azwj</sup> Presence, therefore He<sup>azwj</sup> Said <span class=\"ibTxt\">What then is the Recompense of such among you as do this except for disgrace in the life of the world, and on the Day of Resurrection they shall be Sent back to the most grievous Punishment, and Allah is not at all heedless of what you are doing</span>.",
            "And the fifth aspect from the <span class=\"iTxt\">Kufr</span> (disbelief) is <span class=\"iTxt\">Kufr</span> of the disownment, and these are the Words of the Mighty and Majestic Relating the words of Ibrahim<sup>as</sup> <span class=\"ibTxt\">[60:4] Surely we distance ourselves from you and what you are worshipping besides Allah; We deny you, and enmity and hatred have appeared between us and you and will be forever until you believe in Allah Alone</span>, meaning ‘We disavow from you all!’. ",
            "And He<sup>azwj</sup> Said Mentioning Iblees<sup>la</sup> and his<sup>la</sup> disavowment from his<sup>la</sup> friends from the human beings on the Day of Judgment <span class=\"ibTxt\">[14:22] surely I disbelieved in your associating me with Allah from before</span>. <span class=\"ibTxt\">[29:25] And he said: But rather, you have only taken for yourselves idols besides Allah by way of cordiality between you in the life of the world, then on the Day of Judgement some of you would deny others, and some of you will curse others</span> – meaning some of you would be disavowing from the others’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Bakr ibn Salih from al-Qasim ibn Yazid from abu ‘Amr al-Zubayri who has said the following: “Once I said to abu ‘Abd Allah (a.s.) ‘Instruct me about the kinds of disbelief (mentioned) in the book of Allah, the Most Majestic, the Most Holy.’ The Imam said, ‘Disbelief in the book of Allah is of five kinds: “(1) Of disbelief is denial, which is of two kinds. (2) There is disbelief for disregarding the commands of Allah. (3) Another form of disbelief for disavowing, and (4) disbelief in the bounties is still another form of disbelief. “Disbelief for denial is (a) denial of His Lordship and it is the belief of those who say that there is no Lord, paradise and fire. It is the belief of two kinds of atheism, called Dahriah, who say, ‘It is only time that destroys us.’ (45:23) It is a religion that they made for themselves on the basis of what they felt to be good with out proof and research in any of the things they say. Allah, the Most Majestic, the Most Holy, has said, ‘It is only what they guess, . . .’ (45:23) their religion is based on mere guessing. Allah has said, ‘Those who deny your message will not believe, whether you warn them or not.’ (2:6) They will not believe in the Oneness of Allah. This is one kind of disbelief. (b) The other kind of denial is denial of knowledge. This is when the denying person denies knowing well the truth that is established before him. Allah, the Most Majestic, the Most Holy, has said, ‘They rejected the evidence because of their arrogance and injustice, although their souls knew it to be true. . . .’ (27:14) Allah, the Most Majestic, the Most Holy, has said, ‘. . . despite the fact that they had been praying for victory over the disbelievers (by the help of the truthful Prophet), they refused to accept this book, even though they knew it (to be the Truth). May Allah condemn those who hide the Truth.” (2:89) This is the explanation of two kinds of disbelief.’ “The third kind of disbelief is disbelief in the bounties as Allah, the Most High, has said quoting Sulayman, ‘. . . This is a favor from my Lord by which He wants to test whether I am grateful or ungrateful. Whoever thanks Allah, does so for his own good. Whoever is ungrateful to Allah should know that my Lord is Self-sufficient and Benevolent.’ (27:40) Allah has said, ‘If you give thanks, I shall give you greater (favors), but if you deny the Truth, know that My retribution is severe.’ (14:7) Allah has said, ‘ . . . remember Me and I shall remember you. Thank Me and do not hide the truth about Me.’ (2:152) “The fourth kind of disbelief is disbelief in the form of disregard of what Allah, the Most Majestic, the Most Holy, has commanded as in the words of Allah, the Most Majestic, the Most Holy, ‘We made a covenant with you that you should not shed each other’s blood or expel each other from your homeland. You accepted and bore witness to this covenant, (2:84) yet you murdered each other and forced a number of your people out of their homeland, helping each other to commit sin and to be hostile to one another. When you had expelled people from their homeland and later they had been made captives (of other people), you then paid their ransom (thinking that it was a righteous deed). Allah forbade you to expel these people in the fust place. Do you believe in one part of the Book and not in the other? [They are called unbelievers due to their disregard of the commands of Allah, the Most Majestic, the Most Holy, and He has ascribed them to belief but He has not accepted it and it has been of no benefit before Him] and He has said, . Those who behave in this way shall reap disgrace in this world and severe punishment on the Day of Resurrection. Allah is not unaware of things that you do.’ (2:85) “The fifth kind of disbelief is disbelief in the form of disavowing as in the words of Allah, the Most Majestic, the Most Holy, quoting Ibrahim (Abraham), ‘We have rejected you. Enmity and hatred will separate us forever unless you believe in Allah only. . . .’ (60:4) This is disavowing. Allah has said when mentioning (the case of) Satan and his friend of man on the Day of Judgment, ‘I did not agree with your belief that I was equal to Allah. . . .’ (14:22) Allah has said, ‘. . . you believe in idols besides Allah, only out of worldly love, but on the Day of Judgment you will reject and condemn each other . . .’ (29:25) That is disavowing each other.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:166",
  "kind": "verse_list"
}