{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:2:1", "titles": {"ar": "كتاب الإيمان و الكفر", "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"}}, {"indexed_titles": {"en": "Chapter 167"}, "path": "/books/al-kafi:2:1:167", "titles": {"ar": "بَابُ دَعَائِمِ الْكُفْرِ وَ شُعَبِهِ", "en": "Chapter 167 – The pillars of the Kufr (Disbelief) and its branches"}}], "index": 355, "local_index": 167, "part_type": "Chapter", "path": "/books/al-kafi:2:1:167", "titles": {"ar": "بَابُ دَعَائِمِ الْكُفْرِ وَ شُعَبِهِ", "en": "Chapter 167 – The pillars of the Kufr (Disbelief) and its branches"}, "verse_count": 1, "verse_start_index": 2854, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 2855, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:1:167:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ الْيَمَانِيِّ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ أَبَانِ بْنِ أَبِي عَيَّاشٍ عَنْ سُلَيْمِ بْنِ قَيْسٍ الْهِلَالِيِّ عَنْ أَمِيرِ الْمُؤْمِنِينَ ( صلوات الله عليه )  قَالَ بُنِيَ الْكُفْرُ عَلَى أَرْبَعِ دَعَائِمَ الْفِسْقِ وَ الْغُلُوِّ وَ الشَّكِّ وَ الشُّبْهَةِ", "وَ الْفِسْقُ عَلَى أَرْبَعِ شُعَبٍ عَلَى الْجَفَاءِ وَ الْعَمَى وَ الْغَفْلَةِ وَ الْعُتُوِّ فَمَنْ جَفَا احْتَقَرَ الْحَقَّ وَ مَقَتَ الْفُقَهَاءَ وَ أَصَرَّ عَلَى الْحِنْثِ الْعَظِيمِ وَ مَنْ عَمِيَ نَسِيَ الذِّكْرَ وَ اتَّبَعَ الظَّنَّ وَ بَارَزَ خَالِقَهُ وَ أَلَحَّ عَلَيْهِ الشَّيْطَانُ وَ طَلَبَ الْمَغْفِرَةَ بِلَا تَوْبَةٍ وَ لَا اسْتِكَانَةٍ وَ لَا غَفْلَةٍ", "وَ مَنْ غَفَلَ جَنَى عَلَى نَفْسِهِ وَ انْقَلَبَ عَلَى ظَهْرِهِ وَ حَسِبَ غَيَّهُ رُشْداً وَ غَرَّتْهُ الْأَمَانِيُّ وَ أَخَذَتْهُ الْحَسْرَةُ وَ النَّدَامَةُ إِذَا قُضِيَ الْأَمْرُ وَ انْكَشَفَ عَنْهُ الْغِطَاءُ وَ بَدَا لَهُ مَا لَمْ يَكُنْ يَحْتَسِبُ وَ مَنْ عَتَا عَنْ أَمْرِ اللَّهِ شَكَّ وَ مَنْ شَكَّ تَعَالَى اللَّهُ عَلَيْهِ فَأَذَلَّهُ بِسُلْطَانِهِ وَ صَغَّرَهُ بِجَلَالِهِ كَمَا اغْتَرَّ بِرَبِّهِ الْكَرِيمِ وَ فَرَّطَ فِي أَمْرِهِ ", "وَ الْغُلُوُّ عَلَى أَرْبَعِ شُعَبٍ عَلَى التَّعَمُّقِ بِالرَّأْيِ وَ التَّنَازُعِ فِيهِ وَ الزَّيْغِ وَ الشِّقَاقِ فَمَنْ تَعَمَّقَ لَمْ يُنِبْ إِلَى الْحَقِّ وَ لَمْ يَزْدَدْ إِلَّا غَرَقاً فِي الْغَمَرَاتِ وَ لَمْ تَنْحَسِرْ عَنْهُ فِتْنَةٌ إِلَّا غَشِيَتْهُ أُخْرَى وَ انْخَرَقَ دِينُهُ فَهُوَ يَهْوِي فِي أَمْرٍ مَرِيجٍ", "وَ مَنْ نَازَعَ فِي الرَّأْيِ وَ خَاصَمَ شُهِرَ بِالْعَثَلِ مِنْ طُولِ اللَّجَاجِ وَ مَنْ زَاغَ قَبُحَتْ عِنْدَهُ الْحَسَنَةُ وَ حَسُنَتْ عِنْدَهُ السَّيِّئَةُ وَ مَنْ شَاقَّ اعْوَرَّتْ عَلَيْهِ طُرُقُهُ وَ اعْتَرَضَ عَلَيْهِ أَمْرُهُ فَضَاقَ عَلَيْهِ مَخْرَجُهُ إِذَا لَمْ يَتَّبِعْ سَبِيلَ الْمُؤْمِنِينَ ", "وَ الشَّكُّ عَلَى أَرْبَعِ شُعَبٍ عَلَى الْمِرْيَةِ وَ الْهَوَى وَ التَّرَدُّدِ وَ الِاسْتِسْلَامِ وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ فَبِأَيِّ آلاءِ رَبِّكَ تَتَمارى", "وَ فِي رِوَايَةٍ أُخْرَى عَلَى الْمِرْيَةِ وَ الْهَوْلِ مِنَ الْحَقِّ وَ التَّرَدُّدِ وَ الِاسْتِسْلَامِ لِلْجَهْلِ وَ أَهْلِهِ", "فَمَنْ هَالَهُ مَا بَيْنَ يَدَيْهِ نَكَصَ عَلَى عَقِبَيْهِ وَ مَنِ امْتَرَى فِي الدِّينِ تَرَدَّدَ فِي الرَّيْبِ وَ سَبَقَهُ الْأَوَّلُونَ مِنَ الْمُؤْمِنِينَ وَ أَدْرَكَهُ الْآخَرُونَ وَ وَطِئَتْهُ سَنَابِكُ الشَّيْطَانِ وَ مَنِ اسْتَسْلَمَ لِهَلَكَةِ الدُّنْيَا وَ الْآخِرَةِ هَلَكَ فِيمَا بَيْنَهُمَا وَ مَنْ نَجَا مِنْ ذَلِكَ فَمِنْ فَضْلِ الْيَقِينِ وَ لَمْ يَخْلُقِ اللَّهُ خَلْقاً أَقَلَّ مِنَ الْيَقِينِ", "وَ الشُّبْهَةُ عَلَى أَرْبَعِ شُعَبٍ إِعْجَابٍ بِالزِّينَةِ وَ تَسْوِيلِ النَّفْسِ وَ تَأَوُّلِ الْعِوَجِ وَ لَبْسِ الْحَقِّ بِالْبَاطِلِ وَ ذَلِكَ بِأَنَّ الزِّينَةَ تَصْدِفُ عَنِ الْبَيِّنَةِ وَ أَنَّ تَسْوِيلَ النَّفْسِ يُقَحِّمُ عَلَى الشَّهْوَةِ وَ أَنَّ الْعِوَجَ يَمِيلُ بِصَاحِبِهِ مَيْلًا عَظِيماً وَ أَنَّ اللَّبْسَ ظُلُمَاتٌ بَعْضُهَا فَوْقَ بَعْضٍ ", "فَذَلِكَ الْكُفْرُ وَ دَعَائِمُهُ وَ شُعَبُهُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Ibrahim Bin Umar Al Yamani, from Umar Bin Azina, from Aban Bin Abu Ayyash, from Suleym Bin Qays Al Hilaly, ", "(It has been narrated) from Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup> having said: ‘The <span class=\"iTxt\">Kufr</span> (disbelief) is built upon four pillars – the immorality, and the exaggeration, and the doubt, and the suspicion. ", "And the immorality is upon four branches – upon the disloyalty, and the blindness, and the heedlessness, and the insolence. So the one who was disloyal would consider the truth as insignificant and would detest the understanding ones<sup>asws</sup>, and insist upon committing the grievous sins. And the one who is blind would forget the Remembrance (of Allah<sup>azwj</sup>) and follow the conjectures and duel against his Creator, and the Satan<sup>la</sup> would urge upon him, and he would seek the Forgiveness without repenting, and he would neither be complacent nor be heedless. ", "And the one who is heedless would perpetrate against himself and overturn upon his back and reckon that his straying is a guidance, and the wishful thinking deceives him, and the regret and remorse seizes him when the matter is accomplished and the covering is uncovered from him, and there appears to him what he had not reckoned with; and the one who is insolent about the Commands of Allah<sup>azwj</sup> would doubt, and the one who doubts, Allah<sup>azwj</sup> Overcomes upon him and Disgraces him with His<sup>azwj</sup> Authority, and Belittles him by His<sup>azwj</sup> Majesty just as he had deceived with his Benevolent Lord<sup>azwj</sup> and exceeded in His<sup>azwj</sup> Commands.", "And the exaggeration is upon four branches – upon the diving into the opinions, and the disputing in it, and the aberrations and the discord. So the one who dives (into the opinions) would not be reprimanded to the Truth and would not increase except in drowning in the immersions, and a strife would not recede from him except that another one would overwhelm him, and his religion would be punctured (demolished), so he would tumble into a confusing affair. ", "And the one who disputes regarding the opinions and quarrels, would be exposed by the absurdities from the prolonged obstinacy. So the one who is disloyal, the good deeds would seem terrible to him and the evil deeds would appear good to him. And the one who is troublesome, his ways would be dead-ended, and his affairs would be protested upon him. Thus, his exit would be constricted upon him when he does not follow the way of the <span class=\"iTxt\">Momineen</span>’.  ", "And the doubt is upon four branches – upon the suspicion, and the whims, and the hesitation, and the submission, and these are the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[53:55] Which of your Lord's benefits will you then be suspicious about?</span>’. ", "And in another report, ‘(The doubt) is upon the suspicions, and the awe from the Truth, and the hesitation, and the submission to the ignorance and its people’. ", "So the one who is terrified of what is in front of him would turn back upon his heels, and the one who suspects in the Religion would hesitate in the doubts, and the former ones from the <span class=\"iTxt\">Momineen</span> would precede him and the later ones would catch up with him, and he would be trampled under the hooves of the Satans<sup>la</sup>; and the one who submits to the destruction of the world and the Hereafter would  be destroyed in what is between the two, and the one who is saved from that is by the merit of the conviction. And Allah<sup>azwj</sup> did not Create anything more scarcely than the conviction.", "And the confusion is upon four branches – being astounded by the adornments, and the temptations of the self, and the interpretation of the crookedness, and the clothing the truth with the falsehood, and that is because the adornments block from the evidence, and that the temptations of the self hurl you upon the lustful desires, and that the crookedness inclines its owner with a grievous inclination, and that the clothing (the truth with the falsehood) is the darkness, part of it on top of part.", "So that is the <span class=\"iTxt\">Kufr</span> (disbelief), and its pillars, and its branches’."]}}]}, "index": "al-kafi:2:1:167", "kind": "verse_list"}