{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 168"
        },
        "path": "/books/al-kafi:2:1:168",
        "titles": {
          "ar": "بَابُ صِفَةِ النِّفَاقِ وَ الْمُنَافِقِ",
          "en": "Chapter 168 – Description of the hypocrisy and the hypocrite (Continued from above)"
        }
      }
    ],
    "index": 356,
    "local_index": 168,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 169"
        },
        "path": "/books/al-kafi:2:1:169",
        "titles": {
          "ar": "بَابُ الشِّرْكِ",
          "en": "Chapter 169 – The Shirk (Polytheism/Association)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 167"
        },
        "path": "/books/al-kafi:2:1:167",
        "titles": {
          "ar": "بَابُ دَعَائِمِ الْكُفْرِ وَ شُعَبِهِ",
          "en": "Chapter 167 – The pillars of the Kufr (Disbelief) and its branches"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:168",
    "titles": {
      "ar": "بَابُ صِفَةِ النِّفَاقِ وَ الْمُنَافِقِ",
      "en": "Chapter 168 – Description of the hypocrisy and the hypocrite (Continued from above)"
    },
    "verse_count": 6,
    "verse_start_index": 2855,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/155)"
        ],
        "index": 2856,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:168:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ق</span>َالَ وَ النِّفَاقُ</span> عَلَى أَرْبَعِ دَعَائِمَ عَلَى الْهَوَى وَ الْهُوَيْنَا وَ الْحَفِيظَةِ وَ الطَّمَعِ فَالْهَوَى عَلَى أَرْبَعِ شُعَبٍ عَلَى الْبَغْيِ وَ الْعُدْوَانِ وَ الشَّهْوَةِ وَ الطُّغْيَانِ فَمَنْ بَغَى كَثُرَتْ غَوَائِلُهُ وَ تُخُلِّيَ مِنْهُ وَ قُصِرَ عَلَيْهِ وَ مَنِ اعْتَدَى لَمْ يُؤْمَنْ بَوَائِقُهُ وَ لَمْ يَسْلَمْ قَلْبُهُ وَ لَمْ يَمْلِكْ نَفْسَهُ عَنِ الشَّهَوَاتِ وَ مَنْ لَمْ يَعْذِلْ نَفْسَهُ فِي الشَّهَوَاتِ خَاضَ فِي الْخَبِيثَاتِ وَ مَنْ طَغَى ضَلَّ عَلَى عَمْدٍ بِلَا حُجَّةٍ ",
          "وَ الْهُوَيْنَا عَلَى أَرْبَعِ شُعَبٍ عَلَى الْغِرَّةِ وَ الْأَمَلِ وَ الْهَيْبَةِ وَ الْمُمَاطَلَةِ وَ ذَلِكَ بِأَنَّ الْهَيْبَةَ تَرُدُّ عَنِ الْحَقِّ وَ الْمُمَاطَلَةَ تُفَرِّطُ فِي الْعَمَلِ حَتَّى يَقْدَمَ عَلَيْهِ الْأَجَلُ وَ لَوْ لَا الْأَمَلُ عَلِمَ الْإِنْسَانُ حَسَبَ مَا هُوَ فِيهِ وَ لَوْ عَلِمَ حَسَبَ مَا هُوَ فِيهِ مَاتَ خُفَاتاً مِنَ الْهَوْلِ وَ الْوَجَلِ وَ الْغِرَّةَ تَقْصُرُ بِالْمَرْءِ عَنِ الْعَمَلِ ",
          "وَ الْحَفِيظَةُ عَلَى أَرْبَعِ شُعَبٍ عَلَى الْكِبْرِ وَ الْفَخْرِ وَ الْحَمِيَّةِ وَ الْعَصَبِيَّةِ فَمَنِ اسْتَكْبَرَ أَدْبَرَ عَنِ الْحَقِّ وَ مَنْ فَخَرَ فَجَرَ وَ مَنْ حَمِيَ أَصَرَّ عَلَى الذُّنُوبِ وَ مَنْ أَخَذَتْهُ الْعَصَبِيَّةُ جَارَ فَبِئْسَ الْأَمْرُ أَمْرٌ بَيْنَ إِدْبَارٍ وَ فُجُورٍ وَ إِصْرَارٍ وَ جَوْرٍ عَلَى الصِّرَاطِ ",
          "وَ الطَّمَعُ عَلَى أَرْبَعِ شُعَبٍ الْفَرَحِ وَ الْمَرَحِ وَ اللَّجَاجَةِ وَ التَّكَاثُرِ فَالْفَرَحُ مَكْرُوهٌ عِنْدَ اللَّهِ وَ الْمَرَحُ خُيَلَاءُ وَ اللَّجَاجَةُ بَلَاءٌ لِمَنِ اضْطَرَّتْهُ إِلَى حَمْلِ الْآثَامِ وَ التَّكَاثُرُ لَهْوٌ وَ لَعِبٌ وَ شُغُلٌ وَ اسْتِبْدَالُ الَّذِي هُوَ أَدْنَى بِالَّذِي هُوَ خَيْرٌ ",
          "فَذَلِكَ النِّفَاقُ وَ دَعَائِمُهُ وَ شُعَبُهُ وَ اللَّهُ قَاهِرٌ فَوْقَ عِبَادِهِ تَعَالَى ذِكْرُهُ وَ جَلَّ وَجْهُهُ وَ أَحْسَنَ كُلَّ شَيْ‏ءٍ خَلَقَهُ وَ انْبَسَطَتْ يَدَاهُ وَ وَسِعَتْ كُلَّ شَيْ‏ءٍ رَحْمَتُهُ وَ ظَهَرَ أَمْرُهُ وَ أَشْرَقَ نُورُهُ وَ فَاضَتْ بَرَكَتُهُ وَ اسْتَضَاءَتْ حِكْمَتُهُ وَ هَيْمَنَ كِتَابُهُ وَ فَلَجَتْ حُجَّتُهُ وَ خَلَصَ دِينُهُ وَ اسْتَظْهَرَ سُلْطَانُهُ وَ حَقَّتْ كَلِمَتُهُ وَ أَقْسَطَتْ مَوَازِينُهُ وَ بَلَّغَتْ رُسُلُهُ ",
          "فَجَعَلَ السَّيِّئَةَ ذَنْباً وَ الذَّنْبَ فِتْنَةً وَ الْفِتْنَةَ دَنَساً وَ جَعَلَ الْحُسْنَى عُتْبَى وَ الْعُتْبَى تَوْبَةً وَ التَّوْبَةَ طَهُوراً فَمَنْ تَابَ اهْتَدَى وَ مَنِ افْتُتِنَ غَوَى مَا لَمْ يَتُبْ إِلَى اللَّهِ وَ يَعْتَرِفْ بِذَنْبِهِ وَ لَا يَهْلِكُ عَلَى اللَّهِ إِلَّا هَالِكٌ ",
          "اللَّهَ اللَّهَ فَمَا أَوْسَعَ مَا لَدَيْهِ مِنَ التَّوْبَةِ وَ الرَّحْمَةِ وَ الْبُشْرَى وَ الْحِلْمِ الْعَظِيمِ وَ مَا أَنْكَلَ مَا عِنْدَهُ مِنَ الْأَنْكَالِ وَ الْجَحِيمِ وَ الْبَطْشِ الشَّدِيدِ فَمَنْ ظَفِرَ بِطَاعَتِهِ اجْتَلَبَ كَرَامَتَهُ وَ مَنْ دَخَلَ فِي مَعْصِيَتِهِ ذَاقَ وَبَالَ نَقِمَتِهِ وَ عَمَّا قَلِيلٍ لَيُصْبِحُنَّ نَادِمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "He<sup>asws</sup> said: ‘And the hypocrisy is upon four pillars – upon the whims, and the leisureliness, and the grudges, and the greed. The desires are upon four branches – upon the rebellion, and the animosity, and the lustful desires, and the tyranny. So the one who rebels, is change of circumstances would be frequent and he would be isolated from, and would have restrictions upon him; and the one who transgresses would not be secure from his harmful consequences, and his heart would not be tranquil, and he would not be in control of himself from the lustful desires; and the one who does not rebukes his own self regarding the lustful desires would dive into the evil deeds; and the one who is arrogant would stray upon deliberation without a proof.",
            "And the leisureliness is upon four branches – upon the inattention, and the expectations, and the awe, and the procrastination, and that is because the awe repels from the truth, and the procrastination (leads to) carelessness in the deed until the deadline comes up upon him, and had it not been for the expectation the human being would know the reckoning of what he is in, and if he were to know the reckoning of what he is in, he would die fearing from the horrors and the apprehension; and the inattentiveness cuts short the man from the deeds.",
            "And the grudges are upon four branches – upon the arrogance, and the pride, and the egoism, and the prejudice. So the one who is arrogant would turn back from the truth, and the one who is proud would be immoral, and the one who is egoistic would persist upon the sins, and the one who is seized by the prejudice would be tyrannous. So the most evil of the matters is a matter between the turning back, and the immorality, and the persistence and the tyranny upon the path.",
            "And the greed is upon four branches – the jubilation, and the hilarity, and the obstinacy and the abundance. So the jubilation is Disliked in the Presence of Allah<sup>azwj</sup>, and the hilarity is haughtiness, and the obstinacy is an affliction for the one who is desperate to carry upon the sins, and the abundance is sport, and play, and pre-occupation, and the changing for that which is lowly by that which is good.",
            "So that is the hypocrisy and its pillars and its branches. And Allah<sup>azwj</sup> is Compelling upon His<sup>azwj</sup> servants, Exalted is His<sup>azwj</sup> Mention and Majestic is His<sup>azwj</sup> Face, and good is everything which He<sup>azwj</sup> Created, and His<sup>azwj</sup> Hand is Extensive, and His<sup>azwj</sup> Mercy Covers everything, and His<sup>azwj</sup> Command is Manifest, and His<sup>azwj</sup> Light is bright, and His<sup>azwj</sup> Blessing is over-flowing, and His<sup>azwj</sup> Wisdom is Illuminating, and His<sup>azwj</sup> Book is Absolute, and His<sup>azwj</sup> Argument is overwhelming, and His<sup>azwj</sup> Religion is pure, and His<sup>azwj</sup> Authority is overpowering, and His<sup>azwj</sup> Word is justified, and His Scale is equitable, and His<sup>azwj</sup> Rasools<sup>as</sup> delivered (the Message).",
            "So He<sup style=\"font-weight: normal\">azwj</sup> Made the evil deed to be a sin, and the sin to be a strife, and the strife to be an impurity, and Made the good deed to be a threshold, and the threshold to be the repentance, a purification. So the one who repents would be Guided, and the one who indulges in strife would stray for as long as he does not repent to Allah<sup style=\"font-weight: normal\">azwj</sup> and acknowledges his sins, and there is no destruction upon Allah<sup style=\"font-weight: normal\">azwj</sup> (it is) only upon whom Allah<sup style=\"font-weight: normal\">azwj</sup> Destroys. ",
            "Allah<sup style=\"font-weight: normal\">azwj</sup>! Allah<sup style=\"font-weight: normal\">azwj</sup>! So how vast is His<sup style=\"font-weight: normal\">azwj</sup> Acceptance of the repentance, and the Mercy, and the Glad Tidings, and the Great Forbearance, and how torturous is what is in His<sup style=\"font-weight: normal\">azwj</sup> Presence from the tortures, and the blazing Fire, and the intense assaults. So the one who is victorious by His<sup style=\"font-weight: normal\">azwj</sup> obedience would attract His<sup style=\"font-weight: normal\">azwj</sup> Benevolence, and the one who indulges in His<sup style=\"font-weight: normal\">azwj</sup> disobedience would taste the results of His<sup style=\"font-weight: normal\">azwj</sup> Retribution, and after a little while he would be remorseful’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Ibrahim ibn ‘Umar al-Yamani from ‘Umar ibn ‘Udhaynah from Aban ibn abu ‘Ayyash from Sulaym ibn Qays al-Hilali from Amir al-Mu’minin, Ali ibn abu Talib (a.s.) who has said the following:“‘Hypocrisy has four pillars: Desire, Neglect, Resentment and Greed. “Desire is of four branches: disproportionate behavior, transgression, lust and insubordination. Whoever behaves disproportionately faces great risks, remains lonely and without supporters. Whoever transgresses does not remain immune to harmful consequences, his heart is not in peace and he does not control his soul against lustful matters. Whoever has not balanced his soul in lustful matters he indulges in filthy activities. Whoever acts insubordinately purposely and without evidence strays in falsehood. “Neglect is of four branches: dishonesty, yearning, fear and procrastination. Fear and apprehension turns one away from the truth and procrastination leads to extremely reduced activities until the deadline approaches. If one does not have any yearnings he knows his true condition and measures. If he knows the true measure of his condition in which he is, he would die suddenly due to fear and apprehension. Dishonesty cuts short one’s deeds. “Resentment is of four branches: arrogance, boastfulness, egoistic, and racism. Whoever is arrogant turns his back to the truth. Whoever is boastful indulges in sins. Whoever is egoistic persists in sins. Whoever comes in the clench of racism commits injustice. “Thus, evil is the affair that swings in deterioration, indecency, persistence and injustice on the path. “Greed is of four branches: exhilaration, pleasure seeking, worrying and superfluity. Exhilaration is detestable before Allah. Pleasure seeking is feeblemindedness. Worrisome is a misfortune for one who is forced to carry sins. Seeking superfluity is useless, a childish manner, a vastful preoccupation and an effort to change what is of a lower quality to a better one. “This is how hypocrisy its pillars and branches are. Allah is dominant over his servants. Speaking of Him is exalted and glory is His. He has created all things in good fashion. His hands are free, His favor is universal. His command is manifest, His light shines, His blessing overflows. His wisdom is the source of light. His book is overriding. His evidence is overwhelming. His religion is pure. His kingdom is powerful. His word is the truth, His measures are just and His messengers have already preached. Thus, He has made evil a sin, sin a misfortune and misfortune a filth. “He has made virtuous deeds a threshold. The threshold is repentance and repentance is purification. One who repents finds guidance. One who plots goes astray, as long as he does not repent before Allah and confess to his sins. No one dares to act, to his own destruction, against Allah, except those who are doomed. “Allah! Allah! How vast is what He has for repentance, favors, joy and great forbearance. How severe is what is before Him of retribution, hell, and a hard grip! Whoever succeeds in obedience to Him attracts His generosity. Whoever indulges in disobedience to Him he will test the results of His disapproval and very shortly he will become regretful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/170)"
        ],
        "index": 2857,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:168:2",
        "refs": {
          "Mentions": [
            "/books/quran:4:143",
            "/books/quran:4:142"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنِ الْحُسَيْنِ بْنِ إِسْحَاقَ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْحَمِيدِ وَ الْحُسَيْنِ بْنِ سَعِيدٍ جَمِيعاً عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ قَالَ كَتَبْتُ إِلَى أَبِي الْحَسَنِ ( عليه السلام ) أَسْأَلُهُ عَنْ مَسْأَلَةٍ فَكَتَبَ إِلَيَّ إِنَّ الْمُنافِقِينَ يُخادِعُونَ اللَّهَ وَ هُوَ خادِعُهُمْ وَ إِذا قامُوا إِلَى الصَّلاةِ قامُوا كُسالى يُراؤُنَ النَّاسَ وَ لا يَذْكُرُونَ اللَّهَ إِلَّا قَلِيلًا مُذَبْذَبِينَ بَيْنَ ذلِكَ لا إِلى هؤُلاءِ وَ لا إِلى هؤُلاءِ وَ مَنْ يُضْلِلِ اللَّهُ فَلَنْ تَجِدَ لَهُ سَبِيلًا لَيْسُوا مِنَ الْكَافِرِينَ وَ لَيْسُوا مِنَ الْمُؤْمِنِينَ وَ لَيْسُوا مِنَ الْمُسْلِمِينَ يُظْهِرُونَ الْإِيمَانَ وَ يَصِيرُونَ إِلَى الْكُفْرِ وَ التَّكْذِيبِ لَعَنَهُمُ اللَّهُ"
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Al Husayn Bin Is’haq, from Ali Bin Mahziyar, from Muhammad Bin Abdul Hameed and Al Husayn Bin Saeed, altogether from Muhammad Bin Al Fuzayl who said, ",
            "‘I wrote to Abu Al-Hassan<sup>asws</sup> asking him<sup>asws</sup> a question. So he<sup>asws</sup> wrote to me: <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h142\">[4:142]</a> Surely the hypocrites strive to deceive Allah, and He shall Requite their deceit back to them, and when they stand up for the Prayer they stand up sluggishly; they do it only to be seen of men and do not remember Allah except for a little <a href=\"/#/books/quran:4#h143\">[4:143]</a> Wavering between that (and this), (belonging) neither to these nor to those; and whomsoever Allah Causes to err, you shall not find a way for him</span>. They are neither from the Unbelievers (<span class=\"iTxt\">Kafir</span>) nor from the <span class=\"iTxt\">Momineen</span>, and they are not from the Muslims. They are displaying the <span class=\"iTxt\">Emān</span> and they are becoming to the <span class=\"iTxt\">Kufr</span> (disbelief) and (with) the lies. May Allah<sup>azwj</sup> Curse them’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from al-Husayn ibn Ishaq from Ali ibn Mahziyar from Muhammad ibn ‘Abd Hamid and al-Husayn ibn Sa’id all from Muhammad ibn al-Fudayl who has said the following: “Once I wrote to abu al-Hassan (a.s.) asking him a question and he wrote back to me, ‘The hypocrites try to deceive Allah, but He, in fact, deceives them. They stand up in prayer lazily just to show that they pray, but, in truth, they remember Allah very little. <a href=\"/#/books/quran:4#h142\">[4:142]</a> “They are hesitant people belonging to neither side. You can find no other way for one whom Allah has caused to go astray.’ (4: 143) They are not of the unbelievers, or of the believers or of the Muslims. They claim to be of belief. They change to disbelief and denial. May Allah condemn them all.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/171)"
        ],
        "index": 2858,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:168:3",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الْأَصَمِّ عَنِ الْهَيْثَمِ بْنِ وَاقِدٍ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي حَمْزَةَ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ( صلوات الله عليه )  قَالَ قَالَ إِنَّ الْمُنَافِقَ يَنْهَى وَ لَا يَنْتَهِي وَ يَأْمُرُ بِمَا لَا يَأْتِي وَ إِذَا قَامَ إِلَى الصَّلَاةِ اعْتَرَضَ قُلْتُ يَا ابْنَ رَسُولِ اللَّهِ وَ مَا الِاعْتِرَاضُ قَالَ الِالْتِفَاتُ ",
          "وَ إِذَا رَكَعَ رَبَضَ يُمْسِي وَ هَمُّهُ الْعَشَاءُ وَ هُوَ مُفْطِرٌ وَ يُصْبِحُ وَ هَمُّهُ النَّوْمُ وَ لَمْ يَسْهَرْ إِنْ حَدَّثَكَ كَذَبَكَ وَ إِنِ ائْتَمَنْتَهُ خَانَكَ وَ إِنْ غِبْتَ اغْتَابَكَ وَ إِنْ وَعَدَكَ أَخْلَفَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Muhammad Bin Jamhour, from Abdullah Bin Abdul Rahman Al Asammi, from Al Haysam Bin Waqid, form Muhammad Bin Suleyman, from Ibn Muskan, from Abu Hamza, ",
            "(It has been narrated) from Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> having said: ‘They hypocrite forbids and he does not keep away (himself), and he orders with what he does not perform; and when he stands to the <span class=\"iTxt\">Salāt</span>, raises objections’. I said, ‘O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! And what is the ‘raising objections’?’ He<sup>asws</sup> said: ‘The turning around. ",
            "And when he performs <span class=\"iTxt\">Ruku’u</span>, he crouches, and in the evening he thinks of the dinner although he did not Fast, and in the morning he thinks of the sleep although he did not stay awake worshipping at night. If he were to narrate to you, he would lie, and if you were to entrust him, he would betray you, and if you are absent, he would backbite you, and if he promises you, he would break it’."
          ],
          "en.sarwar": [
            "3. Al-Husayn ibn Muhammad has narrated from Muhammad ibn Jumhur from ‘Abd Allah ibn ‘Abd al-Rahman al-‘Assam from al-Haytham ibn Waqid from Muhammad ibn Sulayman from ibn Muskan from abu Hamza from Ali ibn al- Husayn (a.s.) who has said the following: “Ali ibn al-Husayn (a.s.) has said, ‘A hypocrite forbids others, but himself does not desist from prohibited matters and commands others with what he himself does not perform. When prayer is to begin he (7 ’tarazd) avoids it.’ I (the narrator) then asked, ‘O descendent of the messenger of Allah, “What is ‘I’tirazT’ The Imam said, ‘It is turning away. When he is in the Ruku’ position (kneeling) he uses it as resting place. Toward the evening his only concern is dinner, even though he is not fasting. Toward morning his only concern is more sleep, even though he has not passed the night awake worshipping. If he speaks to you, he lies. If you trust him, he breaches it. Behind your back, he backbites you and if he promises you, he disregards his promise.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/172)"
        ],
        "index": 2859,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:168:4",
        "text": [
          "عَنْهُ عَنِ ابْنِ جُمْهُورٍ عَنْ سُلَيْمَانَ بْنِ سَمَاعَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ بَحْرٍ رَفَعَهُ مِثْلَ ذَلِكَ وَ زَادَ فِيهِ إِذَا رَكَعَ رَبَضَ وَ إِذَا سَجَدَ نَقَرَ وَ إِذَا جَلَسَ شَغَرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ibn Jamhour, from Suleyman Bin Sama’at, from Abdul Malik bin Bahr, raising it, similar to that, and there is an increase in it, ",
            "‘(He<sup>asws</sup> said): ‘And when he performs <span class=\"iTxt\">Ruku’u</span>, he crouches, and when he performs Sajda, he falls, and when he sits, (does so) upon his heels’ (sitting on his heels for <span class=\"iTxt\">Tashahhud</span>)."
          ],
          "en.sarwar": [
            "4. It is narrated from him (narrator of the Hadith above) from ibn Jumhur from Sulayman ibn Sama’a from ‘Abd al-Malik ibn Bahr in a marfu’ manner a similar Hadith with the following addition: “In, Ruku’ position he rests and in Sajdah (the prostration) he acts like a crow picking up grains very fast, and sits on his heels.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/172)"
        ],
        "index": 2860,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:168:5",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَعِيدِ بْنِ يَسَارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَثَلُ الْمُنَافِقِ مَثَلُ جِذْعِ النَّخْلِ أَرَادَ صَاحِبُهُ أَنْ يَنْتَفِعَ بِهِ فِي بَعْضِ بِنَائِهِ فَلَمْ يَسْتَقِمْ لَهُ فِي الْمَوْضِعِ الَّذِي أَرَادَ فَحَوَّلَهُ فِي مَوْضِعٍ آخَرَ فَلَمْ يَسْتَقِمْ لَهُ فَكَانَ آخِرُ ذَلِكَ أَنْ أَحْرَقَهُ بِالنَّارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Al Hassan Bin Ali Al Kufy, from Usman Bin Isa, from Saeed Bin Yasaar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘An example of the hypocrite is like an example of the trunk of a palm tree. When its owner intends to benefit by it in one of his constructions, so it does not sit straight for him in the place in which he intends it. So he transfers it to another place, but it is not straight for him. So at the end of that he burns it in the fire’."
          ],
          "en.sarwar": [
            "5. Abu Ali al-Ash’ari has narrated from al-Hassan ibn Ali al-Kufi from ‘Uthman ibn ‘Isa from Sa’id ibn Yasar from abu ‘Abd Allah (a.s.) who has said the following: “The Messenger of Allah has said, ‘The case of a hypocrite is like the trunk of a palm tree. His owner wants to use it in a construction but it does not fit where he wants it to fit. He then tries it in another place and it still does not fit. At last he burns it in the fire.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/173)"
        ],
        "index": 2861,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:168:6",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ مِسْمَعِ بْنِ عَبْدِ الْمَلِكِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَا زَادَ خُشُوعُ الْجَسَدِ عَلَى مَا فِي الْقَلْبِ فَهُوَ عِنْدَنَا نِفَاقٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al Hassan Bin Shamoun, from Abdullah Bin Abdul Rahman, from Misma’a Bin Abdul Malik, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Whatever increase there is of the humility in the body over what is in the <span class=\"iTxt\">‘Qalb’</span>, so in in our<sup>asws</sup> view it is hypocrisy’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn al-Hassan ibn Shammun from ‘Abd Allah ibn ‘Abd al-Rahman from Misma’ ibn ‘Abd al-Malik from abu ‘Abd Allah (a.s.) who has said the following: “The Messenger of Allah has said, ‘If humility expressed physically is more than what is in the heart, in our view it is hypocrisy.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:168",
  "kind": "verse_list"
}