{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 17"
        },
        "path": "/books/al-kafi:2:1:17",
        "titles": {
          "ar": "بَابٌ",
          "en": "Chapter 17 – A Chapter"
        }
      }
    ],
    "index": 205,
    "local_index": 17,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:2:1:18",
        "titles": {
          "ar": "بَابٌ فِي أَنَّ الْإِيمَانَ مَبْثُوثٌ لِجَوَارِحِ الْبَدَنِ كُلِّهَا",
          "en": "Chapter 18 -  Regarding that the Emān (belief) spreads out to the parts of the body, all of them"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 16"
        },
        "path": "/books/al-kafi:2:1:16",
        "titles": {
          "ar": "بَابٌ آخَرُ مِنْهُ وَ فِيهِ أَنَّ الْإِسْلَامَ قَبْلَ الْإِيمَانِ",
          "en": "Chapter 16 – Another Chapter from it, and in it is that the Islām is before the Emān"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:17",
    "titles": {
      "ar": "بَابٌ",
      "en": "Chapter 17 – A Chapter"
    },
    "verse_count": 3,
    "verse_start_index": 1510,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/164)"
        ],
        "index": 1511,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:17:1",
        "refs": {
          "Mentions": [
            "/books/quran:84:15",
            "/books/quran:84:10",
            "/books/quran:26:94",
            "/books/quran:24:2",
            "/books/quran:24:5",
            "/books/quran:92:16",
            "/books/quran:33:65",
            "/books/quran:67:1",
            "/books/quran:17:39",
            "/books/quran:33:64",
            "/books/quran:83:2",
            "/books/quran:92:1",
            "/books/quran:26:92",
            "/books/quran:9:67",
            "/books/quran:69:27",
            "/books/quran:22:42",
            "/books/quran:17:38",
            "/books/quran:2:65",
            "/books/quran:84:13",
            "/books/quran:19:37",
            "/books/quran:26:99",
            "/books/quran:17:23",
            "/books/quran:24:4",
            "/books/quran:42:13",
            "/books/quran:3:182",
            "/books/quran:83:1",
            "/books/quran:67:9",
            "/books/quran:69:28",
            "/books/quran:24:1",
            "/books/quran:17:37",
            "/books/quran:26:91",
            "/books/quran:92:14",
            "/books/quran:26:176",
            "/books/quran:84:14",
            "/books/quran:17:35",
            "/books/quran:9:30",
            "/books/quran:17:34",
            "/books/quran:69:26",
            "/books/quran:26:1",
            "/books/quran:17:36",
            "/books/quran:69:25",
            "/books/quran:92:15",
            "/books/quran:7:38",
            "/books/quran:26:93",
            "/books/quran:32:18",
            "/books/quran:17:32",
            "/books/quran:4:15",
            "/books/quran:17:30",
            "/books/quran:3:7",
            "/books/quran:18:50",
            "/books/quran:3:77",
            "/books/quran:4:93",
            "/books/quran:26:95",
            "/books/quran:4:163",
            "/books/quran:17:71",
            "/books/quran:24:24",
            "/books/quran:84:1",
            "/books/quran:84:11",
            "/books/quran:24:3",
            "/books/quran:69:33",
            "/books/quran:17:33",
            "/books/quran:17:31",
            "/books/quran:56:92",
            "/books/quran:67:8",
            "/books/quran:71:3",
            "/books/quran:24:23",
            "/books/quran:26:160",
            "/books/quran:4:10",
            "/books/quran:84:12"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ مُحَمَّدٍ</span> عَنْ بَعْضِ أَصْحَابِهِ عَنْ آدَمَ بْنِ إِسْحَاقَ عَنْ عَبْدِ الرَّزَّاقِ بْنِ مِهْرَانَ عَنِ الْحُسَيْنِ بْنِ مَيْمُونٍ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ [أُ] نَاساً تَكَلَّمُوا فِي هَذَا الْقُرْآنِ بِغَيْرِ عِلْمٍ وَ ذَلِكَ أَنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى يَقُولُ هُوَ الَّذِي أَنْزَلَ عَلَيْكَ الْكِتابَ مِنْهُ آياتٌ مُحْكَماتٌ هُنَّ أُمُّ الْكِتابِ وَ أُخَرُ مُتَشابِهاتٌ فَأَمَّا الَّذِينَ فِي قُلُوبِهِمْ زَيْغٌ فَيَتَّبِعُونَ ما تَشابَهَ مِنْهُ ابْتِغاءَ الْفِتْنَةِ وَ ابْتِغاءَ تَأْوِيلِهِ وَ ما يَعْلَمُ تَأْوِيلَهُ إِلَّا اللَّهُ الْآيَةَ فَالْمَنْسُوخَاتُ مِنَ الْمُتَشَابِهَاتِ وَ الْمُحْكَمَاتُ مِنَ النَّاسِخَاتِ ",
          "إِنَّ اللَّهَ عَزَّ وَ جَلَّ بَعَثَ نُوحاً إِلَى قَوْمِهِ أَنِ اعْبُدُوا اللَّهَ وَ اتَّقُوهُ وَ أَطِيعُونِ ثُمَّ دَعَاهُمْ إِلَى اللَّهِ وَحْدَهُ وَ أَنْ يَعْبُدُوهُ وَ لَا يُشْرِكُوا بِهِ شَيْئاً ثُمَّ بَعَثَ الْأَنْبِيَاءَ ( عليهم السلام ) عَلَى ذَلِكَ إِلَى أَنْ بَلَغُوا مُحَمَّداً ( صلى الله عليه وآله ) فَدَعَاهُمْ إِلَى أَنْ يَعْبُدُوا اللَّهَ وَ لَا يُشْرِكُوا بِهِ شَيْئاً وَ قَالَ شَرَعَ لَكُمْ مِنَ الدِّينِ ما وَصَّى بِهِ نُوحاً وَ الَّذِي أَوْحَيْنا إِلَيْكَ وَ ما وَصَّيْنا بِهِ إِبْراهِيمَ وَ مُوسى وَ عِيسى أَنْ أَقِيمُوا الدِّينَ وَ لا تَتَفَرَّقُوا فِيهِ كَبُرَ عَلَى الْمُشْرِكِينَ ما تَدْعُوهُمْ إِلَيْهِ اللَّهُ يَجْتَبِي إِلَيْهِ مَنْ يَشاءُ وَ يَهْدِي إِلَيْهِ مَنْ يُنِيبُ",
          "فَبَعَثَ الْأَنْبِيَاءَ إِلَى قَوْمِهِمْ بِشَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ الْإِقْرَارِ بِمَا جَاءَ [بِهِ] مِنْ عِنْدِ اللَّهِ فَمَنْ آمَنَ مُخْلِصاً وَ مَاتَ عَلَى ذَلِكَ أَدْخَلَهُ اللَّهُ الْجَنَّةَ بِذَلِكَ وَ ذَلِكَ أَنَّ اللَّهَ لَيْسَ بِظَلَّامٍ لِلْعَبِيدِ وَ ذَلِكَ أَنَّ اللَّهَ لَمْ يَكُنْ يُعَذِّبُ عَبْداً حَتَّى يُغَلِّظَ عَلَيْهِ فِي الْقَتْلِ وَ الْمَعَاصِي الَّتِي أَوْجَبَ اللَّهُ عَلَيْهِ بِهَا النَّارَ لِمَنْ عَمِلَ بِهَا ",
          "فَلَمَّا اسْتَجَابَ لِكُلِّ نَبِيٍّ مَنِ اسْتَجَابَ لَهُ مِنْ قَوْمِهِ مِنَ الْمُؤْمِنِينَ جَعَلَ لِكُلِّ نَبِيٍّ مِنْهُمْ شِرْعَةً وَ مِنْهَاجاً وَ الشِّرْعَةُ وَ الْمِنْهَاجُ سَبِيلٌ وَ سُنَّةٌ وَ قَالَ اللَّهُ لِمُحَمَّدٍ ( صلى الله عليه وآله ) إِنَّا أَوْحَيْنا إِلَيْكَ كَما أَوْحَيْنا إِلى نُوحٍ وَ النَّبِيِّينَ مِنْ بَعْدِهِ وَ أَمَرَ كُلَّ نَبِيٍّ بِالْأَخْذِ بِالسَّبِيلِ وَ السُّنَّةِ",
          "وَ كَانَ مِنَ السُّنَّةِ وَ السَّبِيلِ الَّتِي أَمَرَ اللَّهُ عَزَّ وَ جَلَّ بِهَا مُوسَى ( عليه السلام ) أَنْ جَعَلَ اللَّهُ عَلَيْهِمُ السَّبْتَ وَ كَانَ مِنْ أَعْظَمِ السَّبْتِ وَ لَمْ يَسْتَحِلَّ أَنْ يَفْعَلَ ذَلِكَ مِنْ خَشْيَةِ اللَّهِ أَدْخَلَهُ اللَّهُ الْجَنَّةَ وَ مَنِ اسْتَخَفَّ بِحَقِّهِ وَ اسْتَحَلَّ مَا حَرَّمَ اللَّهُ عَلَيْهِ مِنَ الْعَمَلِ الَّذِي نَهَاهُ اللَّهُ عَنْهُ فِيهِ أَدْخَلَهُ اللَّهُ عَزَّ وَ جَلَّ النَّارَ وَ ذَلِكَ حَيْثُ اسْتَحَلُّوا الْحِيتَانَ وَ احْتَبَسُوهَا وَ أَكَلُوهَا يَوْمَ السَّبْتِ ",
          "غَضِبَ اللَّهُ عَلَيْهِمْ مِنْ غَيْرِ أَنْ يَكُونُوا أَشْرَكُوا بِالرَّحْمَنِ وَ لَا شَكُّوا فِي شَيْ‏ءٍ مِمَّا جَاءَ بِهِ مُوسَى ( عليه السلام ) قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ لَقَدْ عَلِمْتُمُ الَّذِينَ اعْتَدَوْا مِنْكُمْ فِي السَّبْتِ فَقُلْنا لَهُمْ كُونُوا قِرَدَةً خاسِئِينَ ",
          "ثُمَّ بَعَثَ اللَّهُ عِيسَى ( عليه السلام ) بِشَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ الْإِقْرَارِ بِمَا جَاءَ بِهِ مِنْ عِنْدِ اللَّهِ وَ جَعَلَ لَهُمْ شِرْعَةً وَ مِنْهَاجاً فَهَدَمَتِ السَّبْتَ الَّذِي أُمِرُوا بِهِ أَنْ يُعَظِّمُوهُ قَبْلَ ذَلِكَ وَ عَامَّةَ مَا كَانُوا عَلَيْهِ مِنَ السَّبِيلِ وَ السُّنَّةِ الَّتِي جَاءَ بِهَا مُوسَى فَمَنْ لَمْ يَتَّبِعْ سَبِيلَ عِيسَى أَدْخَلَهُ اللَّهُ النَّارَ وَ إِنْ كَانَ الَّذِي جَاءَ بِهِ النَّبِيُّونَ جَمِيعاً أَنْ لَا يُشْرِكُوا بِاللَّهِ شَيْئاً ",
          "ثُمَّ بَعَثَ اللَّهُ مُحَمَّداً ( صلى الله عليه وآله ) وَ هُوَ بِمَكَّةَ عَشْرَ سِنِينَ فَلَمْ يَمُتْ بِمَكَّةَ فِي تِلْكَ الْعَشْرِ سِنِينَ أَحَدٌ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً ( صلى الله عليه وآله ) رَسُولُ اللَّهِ إِلَّا أَدْخَلَهُ اللَّهُ الْجَنَّةَ بِإِقْرَارِهِ وَ هُوَ إِيمَانُ التَّصْدِيقِ وَ لَمْ يُعَذِّبِ اللَّهُ أَحَداً مِمَّنْ مَاتَ وَ هُوَ مُتَّبِعٌ لِمُحَمَّدٍ ( صلى الله عليه وآله ) عَلَى ذَلِكَ إِلَّا مَنْ أَشْرَكَ بِالرَّحْمَنِ",
          "وَ تَصْدِيقُ ذَلِكَ أَنَّ اللَّهَ عَزَّ وَ جَلَّ أَنْزَلَ عَلَيْهِ فِي سُورَةِ بَنِي إِسْرَائِيلَ بِمَكَّةَ وَ قَضى رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ وَ بِالْوالِدَيْنِ إِحْساناً إِلَى قَوْلِهِ تَعَالَى إِنَّهُ كانَ بِعِبادِهِ خَبِيراً بَصِيراً",
          "أَدَبٌ وَ عِظَةٌ وَ تَعْلِيمٌ وَ نَهْيٌ خَفِيفٌ وَ لَمْ يَعِدْ عَلَيْهِ وَ لَمْ يَتَوَاعَدْ عَلَى اجْتِرَاحِ شَيْ‏ءٍ مِمَّا نَهَى عَنْهُ وَ أَنْزَلَ نَهْياً عَنْ أَشْيَاءَ حَذَّرَ عَلَيْهَا وَ لَمْ يُغَلِّظْ فِيهَا وَ لَمْ يَتَوَاعَدْ عَلَيْهَا وَ قَالَ وَ لا تَقْتُلُوا أَوْلادَكُمْ خَشْيَةَ إِمْلاقٍ نَحْنُ نَرْزُقُهُمْ وَ إِيَّاكُمْ إِنَّ قَتْلَهُمْ كانَ خِطْأً كَبِيراً وَ لا تَقْرَبُوا الزِّنى إِنَّهُ كانَ فاحِشَةً وَ ساءَ سَبِيلًا",
          "وَ لا تَقْتُلُوا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ وَ مَنْ قُتِلَ مَظْلُوماً فَقَدْ جَعَلْنا لِوَلِيِّهِ سُلْطاناً فَلا يُسْرِفْ فِي الْقَتْلِ إِنَّهُ كانَ مَنْصُوراً وَ لا تَقْرَبُوا مالَ الْيَتِيمِ إِلَّا بِالَّتِي هِيَ أَحْسَنُ حَتَّى يَبْلُغَ أَشُدَّهُ وَ أَوْفُوا بِالْعَهْدِ إِنَّ الْعَهْدَ كانَ مَسْؤُلًا وَ أَوْفُوا الْكَيْلَ إِذا كِلْتُمْ وَ زِنُوا بِالْقِسْطاسِ الْمُسْتَقِيمِ ذلِكَ خَيْرٌ وَ أَحْسَنُ تَأْوِيلًا",
          "وَ لا تَقْفُ ما لَيْسَ لَكَ بِهِ عِلْمٌ إِنَّ السَّمْعَ وَ الْبَصَرَ وَ الْفُؤادَ كُلُّ أُولئِكَ كانَ عَنْهُ مَسْؤُلًا وَ لا تَمْشِ فِي الْأَرْضِ مَرَحاً إِنَّكَ لَنْ تَخْرِقَ الْأَرْضَ وَ لَنْ تَبْلُغَ الْجِبالَ طُولًا كُلُّ ذلِكَ كانَ سَيِّئُهُ عِنْدَ رَبِّكَ مَكْرُوهاً ذلِكَ مِمَّا أَوْحى إِلَيْكَ رَبُّكَ مِنَ الْحِكْمَةِ وَ لا تَجْعَلْ مَعَ اللَّهِ إِلهاً آخَرَ فَتُلْقى فِي جَهَنَّمَ مَلُوماً مَدْحُوراً ",
          "وَ أَنْزَلَ فِي وَ اللَّيْلِ إِذَا يَغْشَى فَأَنْذَرْتُكُمْ ناراً تَلَظَّى لا يَصْلاها إِلَّا الْأَشْقَى الَّذِي كَذَّبَ وَ تَوَلَّى فَهَذَا مُشْرِكٌ",
          "وَ أَنْزَلَ فِي إِذَا السَّمَاءُ انْشَقَّتْ وَ أَمَّا مَنْ أُوتِيَ كِتابَهُ وَراءَ ظَهْرِهِ فَسَوْفَ يَدْعُوا ثُبُوراً وَ يَصْلى سَعِيراً إِنَّهُ كانَ فِي أَهْلِهِ مَسْرُوراً إِنَّهُ ظَنَّ أَنْ لَنْ يَحُورَ بَلى فَهَذَا مُشْرِكٌ ",
          "وَ أَنْزَلَ فِي [سُورَةِ] تَبَارَكَ كُلَّما أُلْقِيَ فِيها فَوْجٌ سَأَلَهُمْ خَزَنَتُها أَ لَمْ يَأْتِكُمْ نَذِيرٌ قالُوا بَلى قَدْ جاءَنا نَذِيرٌ فَكَذَّبْنا وَ قُلْنا ما نَزَّلَ اللَّهُ مِنْ شَيْ‏ءٍ فَهَؤُلَاءِ مُشْرِكُونَ وَ أَنْزَلَ فِي الْوَاقِعَةِ وَ أَمَّا إِنْ كانَ مِنَ الْمُكَذِّبِينَ الضَّالِّينَ فَنُزُلٌ مِنْ حَمِيمٍ وَ تَصْلِيَةُ جَحِيمٍ فَهَؤُلَاءِ مُشْرِكُونَ",
          "وَ أَنْزَلَ فِي الْحَاقَّةِ وَ أَمَّا مَنْ أُوتِيَ كِتابَهُ بِشِمالِهِ فَيَقُولُ يا لَيْتَنِي لَمْ أُوتَ كِتابِيَهْ وَ لَمْ أَدْرِ ما حِسابِيَهْ يا لَيْتَها كانَتِ الْقاضِيَةَ ما أَغْنى عَنِّي مالِيَهْ إِلَى قَوْلِهِ إِنَّهُ كانَ لا يُؤْمِنُ بِاللَّهِ الْعَظِيمِ فَهَذَا مُشْرِكٌ",
          "وَ أَنْزَلَ فِي طسم وَ بُرِّزَتِ الْجَحِيمُ لِلْغاوِينَ وَ قِيلَ لَهُمْ أَيْنَ ما كُنْتُمْ تَعْبُدُونَ مِنْ دُونِ اللَّهِ هَلْ يَنْصُرُونَكُمْ أَوْ يَنْتَصِرُونَ فَكُبْكِبُوا فِيها هُمْ وَ الْغاوُونَ وَ جُنُودُ إِبْلِيسَ أَجْمَعُونَ جُنُودُ إِبْلِيسَ ذُرِّيَّتُهُ مِنَ الشَّيَاطِينِ وَ قَوْلُهُ وَ ما أَضَلَّنا إِلَّا الْمُجْرِمُونَ يَعْنِي الْمُشْرِكِينَ الَّذِينَ اقْتَدَوْا بِهِمْ هَؤُلَاءِ فَاتَّبَعُوهُمْ عَلَى شِرْكِهِمْ وَ هُمْ قَوْمُ مُحَمَّدٍ ( صلى الله عليه وآله ) لَيْسَ فِيهِمْ مِنَ الْيَهُودِ وَ النَّصَارَى أَحَدٌ",
          "وَ تَصْدِيقُ ذَلِكَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ كَذَّبَ أَصْحابُ الْأَيْكَةِ كَذَّبَتْ قَوْمُ لُوطٍ لَيْسَ فِيهِمُ الْيَهُودُ الَّذِينَ قَالُوا عُزَيْرٌ ابْنُ اللَّهِ وَ لَا النَّصَارَى الَّذِينَ قَالُوا الْمَسِيحُ ابْنُ اللَّهِ سَيُدْخِلُ اللَّهُ الْيَهُودَ وَ النَّصَارَى النَّارَ وَ يُدْخِلُ كُلَّ قَوْمٍ بِأَعْمَالِهِمْ",
          "وَ قَوْلُهُمْ وَ ما أَضَلَّنا إِلَّا الْمُجْرِمُونَ إِذْ دَعَوْنَا إِلَى سَبِيلِهِمْ ذَلِكَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ فِيهِمْ حِينَ جَمَعَهُمْ إِلَى النَّارِ قالَتْ أُخْراهُمْ لِأُولاهُمْ رَبَّنا هؤُلاءِ أَضَلُّونا فَآتِهِمْ عَذاباً ضِعْفاً مِنَ النَّارِ وَ قَوْلُهُ كُلَّما دَخَلَتْ أُمَّةٌ لَعَنَتْ أُخْتَها حَتَّى إِذَا ادَّارَكُوا فِيها جَمِيعاً بَرِئَ بَعْضُهُمْ مِنْ بَعْضٍ وَ لَعَنَ بَعْضُهُمْ بَعْضاً يُرِيدُ بَعْضُهُمْ أَنْ يَحُجَّ بَعْضاً رَجَاءَ الْفَلْجِ فَيُفْلِتُوا مِنْ عَظِيمِ مَا نَزَلَ بِهِمْ وَ لَيْسَ بِأَوَانِ بَلْوَى وَ لَا اخْتِبَارٍ وَ لَا قَبُولِ مَعْذِرَةٍ وَ لَاتَ حِينَ نَجَاةٍ ",
          "وَ الْآيَاتُ وَ أَشْبَاهُهُنَّ مِمَّا نَزَلَ بِهِ بِمَكَّةَ وَ لَا يُدْخِلُ اللَّهُ النَّارَ إِلَّا مُشْرِكاً فَلَمَّا أَذِنَ اللَّهُ لِمُحَمَّدٍ ( صلى الله عليه وآله ) فِي الْخُرُوجِ مِنْ مَكَّةَ إِلَى الْمَدِينَةِ بَنَى الْإِسْلَامَ عَلَى خَمْسٍ شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً ( صلى الله عليه وآله ) عَبْدُهُ وَ رَسُولُهُ وَ إِقَامِ الصَّلَاةِ وَ إِيتَاءِ الزَّكَاةِ وَ حِجِّ الْبَيْتِ وَ صِيَامِ شَهْرِ رَمَضَانَ",
          "وَ أَنْزَلَ عَلَيْهِ الْحُدُودَ وَ قِسْمَةَ الْفَرَائِضِ وَ أَخْبَرَهُ بِالْمَعَاصِي الَّتِي أَوْجَبَ اللَّهُ عَلَيْهَا وَ بِهَا النَّارَ لِمَنْ عَمِلَ بِهَا وَ أَنْزَلَ فِي بَيَانِ الْقَاتِلِ وَ مَنْ يَقْتُلْ مُؤْمِناً مُتَعَمِّداً فَجَزاؤُهُ جَهَنَّمُ خالِداً فِيها وَ غَضِبَ اللَّهُ عَلَيْهِ وَ لَعَنَهُ وَ أَعَدَّ لَهُ عَذاباً عَظِيماً ",
          "وَ لَا يَلْعَنُ اللَّهُ مُؤْمِناً قَالَ اللَّهُ عَزَّ وَ جَلَّ إِنَّ اللَّهَ لَعَنَ الْكافِرِينَ وَ أَعَدَّ لَهُمْ سَعِيراً خالِدِينَ فِيها أَبَداً لا يَجِدُونَ وَلِيًّا وَ لا نَصِيراً وَ كَيْفَ يَكُونُ فِي الْمَشِيئَةِ وَ قَدْ أَلْحَقَ بِهِ حِينَ جَزَاهُ جَهَنَّمَ الْغَضَبَ وَ اللَّعْنَةَ ",
          "وَ قَدْ بَيَّنَ ذَلِكَ مَنِ الْمَلْعُونُونَ فِي كِتَابِهِ وَ أَنْزَلَ فِي مَالِ الْيَتِيمِ مَنْ أَكَلَهُ ظُلْماً إِنَّ الَّذِينَ يَأْكُلُونَ أَمْوالَ الْيَتامى ظُلْماً إِنَّما يَأْكُلُونَ فِي بُطُونِهِمْ ناراً وَ سَيَصْلَوْنَ سَعِيراً وَ ذَلِكَ أَنَّ آكِلَ مَالِ الْيَتِيمِ يَجِي‏ءُ يَوْمَ الْقِيَامَةِ وَ النَّارُ تَلْتَهِبُ فِي بَطْنِهِ حَتَّى يَخْرُجَ لَهَبُ النَّارِ مِنْ فِيهِ حَتَّى يَعْرِفَهُ كُلُّ أَهْلِ الْجَمْعِ أَنَّهُ آكِلُ مَالِ الْيَتِيمِ",
          "وَ أَنْزَلَ فِي الْكَيْلِ وَيْلٌ لِلْمُطَفِّفِينَ وَ لَمْ يَجْعَلِ الْوَيْلَ لِأَحَدٍ حَتَّى يُسَمِّيَهُ كَافِراً قَالَ اللَّهُ عَزَّ وَ جَلَّ فَوَيْلٌ لِلَّذِينَ كَفَرُوا مِنْ مَشْهَدِ يَوْمٍ عَظِيمٍ",
          "وَ أَنْزَلَ فِي الْعَهْدِ إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَ أَيْمانِهِمْ ثَمَناً قَلِيلًا أُولئِكَ لا خَلاقَ لَهُمْ فِي الْآخِرَةِ وَ لا يُكَلِّمُهُمُ اللَّهُ وَ لا يَنْظُرُ إِلَيْهِمْ يَوْمَ الْقِيامَةِ وَ لا يُزَكِّيهِمْ وَ لَهُمْ عَذابٌ أَلِيمٌ وَ الْخَلَاقُ النَّصِيبُ فَمَنْ لَمْ يَكُنْ لَهُ نَصِيبٌ فِي الْآخِرَةِ فَبِأَيِّ شَيْ‏ءٍ يَدْخُلُ الْجَنَّةَ",
          "وَ أَنْزَلَ بِالْمَدِينَةِ الزَّانِي لا يَنْكِحُ إِلَّا زانِيَةً أَوْ مُشْرِكَةً وَ الزَّانِيَةُ لا يَنْكِحُها إِلَّا زانٍ أَوْ مُشْرِكٌ وَ حُرِّمَ ذلِكَ عَلَى الْمُؤْمِنِينَ فَلَمْ يُسَمِّ اللَّهُ الزَّانِيَ مُؤْمِناً وَ لَا الزَّانِيَةَ مُؤْمِنَةً وَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَيْسَ يَمْتَرِي فِيهِ أَهْلُ الْعِلْمِ أَنَّهُ قَالَ لَا يَزْنِي الزَّانِي حِينَ يَزْنِي وَ هُوَ مُؤْمِنٌ وَ لَا يَسْرِقُ السَّارِقُ حِينَ يَسْرِقُ وَ هُوَ مُؤْمِنٌ فَإِنَّهُ إِذَا فَعَلَ ذَلِكَ خُلِعَ عَنْهُ الْإِيمَانُ كَخَلْعِ الْقَمِيصِ",
          "وَ نَزَلَ بِالْمَدِينَةِ وَ الَّذِينَ يَرْمُونَ الْمُحْصَناتِ ثُمَّ لَمْ يَأْتُوا بِأَرْبَعَةِ شُهَداءَ فَاجْلِدُوهُمْ ثَمانِينَ جَلْدَةً وَ لا تَقْبَلُوا لَهُمْ شَهادَةً أَبَداً وَ أُولئِكَ هُمُ الْفاسِقُونَ إِلَّا الَّذِينَ تابُوا مِنْ بَعْدِ ذلِكَ وَ أَصْلَحُوا فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ فَبَرَّأَهُ اللَّهُ مَا كَانَ مُقِيماً عَلَى الْفِرْيَةِ مِنْ أَنْ يُسَمَّى بِالْإِيمَانِ",
          "قَالَ اللَّهُ عَزَّ وَ جَلَّ أَ فَمَنْ كانَ مُؤْمِناً كَمَنْ كانَ فاسِقاً لا يَسْتَوُونَ وَ جَعَلَهُ اللَّهُ مُنَافِقاً قَالَ اللَّهُ عَزَّ وَ جَلَّ إِنَّ الْمُنافِقِينَ هُمُ الْفاسِقُونَ وَ جَعَلَهُ عَزَّ وَ جَلَّ مِنْ أَوْلِيَاءِ إِبْلِيسَ قَالَ إِلَّا إِبْلِيسَ كانَ مِنَ الْجِنِّ فَفَسَقَ عَنْ أَمْرِ رَبِّهِ وَ جَعَلَهُ مَلْعُوناً فَقَالَ إِنَّ الَّذِينَ يَرْمُونَ الْمُحْصَناتِ الْغافِلاتِ الْمُؤْمِناتِ لُعِنُوا فِي الدُّنْيا وَ الْآخِرَةِ وَ لَهُمْ عَذابٌ عَظِيمٌ يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وَ أَيْدِيهِمْ وَ أَرْجُلُهُمْ بِما كانُوا يَعْمَلُونَ وَ لَيْسَتْ تَشْهَدُ الْجَوَارِحُ عَلَى مُؤْمِنٍ إِنَّمَا تَشْهَدُ عَلَى مَنْ حَقَّتْ عَلَيْهِ كَلِمَةُ الْعَذَابِ ",
          "فَأَمَّا الْمُؤْمِنُ فَيُعْطَى كِتَابَهُ بِيَمِينِهِ قَالَ اللَّهُ عَزَّ وَ جَلَّ فَأَمَّا مَنْ أُوتِيَ كِتابَهُ بِيَمِينِهِ فَأُولئِكَ يَقْرَؤُنَ كِتابَهُمْ وَ لا يُظْلَمُونَ فَتِيلًا",
          "وَ سُورَةُ النُّورِ أُنْزِلَتْ بَعْدَ سُورَةِ النِّسَاءِ وَ تَصْدِيقُ ذَلِكَ أَنَّ اللَّهَ عَزَّ وَ جَلَّ أَنْزَلَ عَلَيْهِ فِي سُورَةِ النِّسَاءِ وَ اللَّاتِي يَأْتِينَ الْفاحِشَةَ مِنْ نِسائِكُمْ فَاسْتَشْهِدُوا عَلَيْهِنَّ أَرْبَعَةً مِنْكُمْ فَإِنْ شَهِدُوا فَأَمْسِكُوهُنَّ فِي الْبُيُوتِ حَتَّى يَتَوَفَّاهُنَّ الْمَوْتُ أَوْ يَجْعَلَ اللَّهُ لَهُنَّ سَبِيلًا وَ السَّبِيلُ الَّذِي قَالَ اللَّهُ عَزَّ وَ جَلَّ سُورَةٌ أَنْزَلْناها وَ فَرَضْناها وَ أَنْزَلْنا فِيها آياتٍ بَيِّناتٍ لَعَلَّكُمْ تَذَكَّرُونَ الزَّانِيَةُ وَ الزَّانِي فَاجْلِدُوا كُلَّ واحِدٍ مِنْهُما مِائَةَ جَلْدَةٍ وَ لا تَأْخُذْكُمْ بِهِما رَأْفَةٌ فِي دِينِ اللَّهِ إِنْ كُنْتُمْ تُؤْمِنُونَ بِاللَّهِ وَ الْيَوْمِ الْآخِرِ وَ لْيَشْهَدْ عَذابَهُما طائِفَةٌ مِنَ الْمُؤْمِنِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from one of his companions, from Adam Bin Is’haq, from Abdul Razzaq Bin Mihran, from Al Husayn Bin Maymoun, from Muhammad Bin Salim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The people are speaking regarding this Quran without knowledge, and Allah<sup>azwj</sup> Blessed and High is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h7\">[3:7]</a> He is the One Who has Revealed the Book to you; some of its Verses are Decisive, they are the Mother of the Book, and others are Allegorical; then as for those in whose hearts there is perversity they follow the part of it which is allegorical, seeking to mislead and seeking to give it (their own) interpretation. but none knows its interpretation except Allah</span> – the Verse. Thus, the Abrogated are from the Allegorical, and the Decisive are from the Abrogating ones.",
            "Allah<sup>azwj</sup> Mighty and Majestic Sent Nuh<sup>as</sup> to his<sup>as</sup> people <span class=\"ibTxt\">71:3] That you should serve Allah and fear Him and obey</span>. Then he<sup>as</sup> called them to Allah<sup>azwj</sup> Alone, and that they should worship him and should not associate anything with Him<sup>azwj</sup>. Then He<sup>azwj</sup> Sent the Prophets<sup>as</sup> upon that until it reached to Muhammad<sup>saww</sup>. So he<sup>saww</sup> called them to, that they should be worshipping Allah<sup>azwj</sup> should not be associating anything with Him<sup>azwj</sup>, and Said <span class=\"ibTxt\"><a href=\"/#/books/quran:42#h13\">[42:13]</a> He has  Legislated to you from the Religion what He Enjoined upon Nuh and that which We have Revealed to you and that which We Enjoined upon Ibrahim and Musa and Isa that be steadfast upon the Religion and be not divided therein; hard to the Polytheists is that which you call them to; Allah Chooses for Himself whom He Desires to, and Guides to Himself him who turns (to Him), frequently</span>.",
            "So He<sup>azwj</sup> Sent the Prophets<sup>as</sup> to their<sup>as</sup> people with the testimony that there is no god except for Allah<sup>azwj</sup> and the acknowledgement with whatever he<sup>saww</sup> came with from the Presence of Allah<sup>azwj</sup>. So the one who believes sincerely and dies upon that, Allah<sup>azwj</sup> would Enter him into the Paradise due to that, <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h182\">[3:182]</a> and because Allah is not in the least unjust to the servants</span>, and that is because Allah<sup>azwj</sup> would be Punishing a servant until he toughens upon it regarding the killing and the disobedience which Allah<sup>azwj</sup> Obligated the Fire over it for the one who does it.",
            "So when they answered to each Prophet<sup>azwj</sup>, the one who answered to him<sup>as</sup> from his<sup>as</sup> people, from the <span class=\"iTxt\">Momineen (plural of Momin)</span>, He<sup>azwj</sup> Made for each Prophet<sup>as</sup> from them<sup>as</sup>, a Law, and a manifesto; and the Law and the manifesto are a Way and a Sunnah, and Allah<sup>azwj</sup> Said to Muhammad<sup>saww</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h163\">[4:163]</a> Surely, We have Revealed to you as We Revealed unto Noah, and the Prophets after him</span>; and He<sup>azwj</sup> Commanded to each Prophet<sup>as</sup> with the holding to the Way and the Sunnah.",
            "And it was from the Sunnah and the Way which Allah<sup>azwj</sup> Mighty and Majestic Commanded Musa<sup>as</sup> with, that Allah<sup>azwj</sup> Made the Sabbath to be upon them, and it was from the reverence of the Sabbath and (the one who) did not Legalise (fishing during it). If he did that (reverence) from fear of Allah<sup>azwj</sup>, Allah<sup>azwj</sup> would Enter him into the Paradise, but the one who takes its right lightly and legalizes what Allah<sup>azwj</sup> Prohibited upon him, from the deed which Allah<sup>azwj</sup> had Forbidden from, Allah<sup>azwj</sup> Mighty and Majestic would Enter him into the Fire; and that was where they legalized the fish and they ensnared these and ate these on the day of the Sabbath. ",
            "Allah<sup>azwj</sup> was Angered upon them from without them having associated with the Beneficent nor having doubted in anything from what Musa<sup>as</sup> had come with. Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h65\">[2:65]</a> And you have known those among you who exceeded the limits of the Sabbath, so We Said to them: Become apes, despised</span>.",
            "Then Allah<sup>azwj</sup> Sent Isa<sup>as</sup> with the testimony that there is no god except for Allah<sup>azwj</sup>, and the acknowledgement with whatever he<sup>as</sup> came with from the Presence of Allah<sup>azwj</sup>, and Made a Law to be for them and a manifesto. So he<sup>as</sup> abolished the Sabbath which they had been Commanded with to revere it before that, and the generality of whatever they were upon, from the Way and the Sunnah which Musa<sup>as</sup> came with. So the one who did not follow the Way of Isa<sup>as</sup>, Allah<sup>azwj</sup> would Enter him into the Fire, and even if it was that which the entirety of the Prophets<sup>as</sup> had come with, that they should not associate anything with Allah<sup>azwj</sup>’. ",
            "Then Allah<sup>azwj</sup> Sent Muhammad<sup>saww</sup>, and he<sup>saww</sup> was in Makkah for ten years. So there did not die anyone in Makkah during those ten years testifying that there is no god except for Allah<sup>azwj</sup> and that Muhammad<sup>saww</sup> is Rasool<sup>saww</sup> of Allah<sup>azwj</sup>, except that Allah<sup>azwj</sup> Entered him into the Paradise due to his acknowledgement, and it was the <span class=\"iTxt\">Emān (belief)</span> of the ratification; and Allah<sup>azwj</sup> did not Punish anyone from the ones who died, and he was a follower of Muhammad<sup>saww</sup> upon that, except the one who associated with the Beneficent. ",
            "And the ratification of that is that Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>saww</sup> in Surah Bani Israil (Chapter 17) in Makkah <span class=\"ibTxt\"><a href=\"/#/books/quran:17#h23\">[17:23]</a> And your Lord has Decreed that you shall not worship except Him, and goodness to the parents</span> – up to His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:17#h30\">[17:30]</a> He was always most Informed, All-Seeing of His servants</span>. ",
            "Discipline, and preaching, and teaching, and light Prohibitions, and He<sup>azwj</sup> did not Threaten upon it and did not Threaten upon the audacity of anything from what He<sup>azwj</sup> had Forbidden from, and He<sup>azwj</sup> Sent down the Prohibition about things Cautioning upon it and was not Tough regarding these, and did not Threaten upon these, and Said <span class=\"ibTxt\"><a href=\"/#/books/quran:17#h31\">[17:31]</a> And do not kill your children for fear of poverty; We Give Sustenance to them and to yourselves; and beware! to kill them is a great wrong <a href=\"/#/books/quran:17#h32\">[17:32]</a> And do not go near the adultery; it was always an immorality and an evil way</span>.",
            "<span class=\"ibTxt\"><a href=\"/#/books/quran:17#h33\">[17:33]</a> And do not kill any one whom Allah has forbidden, except with the right; and whoever is killed unjustly, We have indeed Given to his heir authority, so let him not be excessive with regards to the killing; surely he would always be Aided <a href=\"/#/books/quran:17#h34\">[17:34]</a> And do not go near to the wealth of the orphan except in a goodly way till he attains his maturity; and fulfill the oath; the oath will always be questioned about <a href=\"/#/books/quran:17#h35\">[17:35]</a> And give full measure when you measure out, and weigh with a true balance; this is fair and better in the end</span>.",
            "<span class=\"ibTxt\"><a href=\"/#/books/quran:17#h36\">[17:36]</a> And do not follow that of which you have no knowledge of; surely the hearing and the sight and the heart, all of these, shall be questioned about <a href=\"/#/books/quran:17#h37\">[17:37]</a> And do not go about in the land exultingly, for you cannot cut through the earth nor reach the mountains in height <a href=\"/#/books/quran:17#h38\">[17:38]</a> All that - the evil of it - is hateful in the sight of your Lord <a href=\"/#/books/quran:17#h39\">[17:39]</a> That is from what your Lord has Revealed to you from the Wisdom; and do not associate any other god with Allah so you would be Thrown into Hell, blamed, cast away</span>.",
            "And He<sup>azwj</sup> Revealed regarding <span class=\"ibTxt\"><a href=\"/#/books/quran:92#h1\">[92:1]</a> I swear by the night when it draws a veil - <a href=\"/#/books/quran:92#h14\">[92:14]</a> Therefore I warn you of the fire that flames: <a href=\"/#/books/quran:92#h15\">[92:15]</a> None shall arrive to it but the most wretched <a href=\"/#/books/quran:92#h16\">[92:16]</a> Who gives the lie (to the truth) and turns (his) back</span> – so this is a Polytheist. ",
            "And He<sup>azwj</sup> Revealed regarding <span class=\"ibTxt\"><a href=\"/#/books/quran:84#h1\">[84:1]</a> When the sky bursts asunder </span>- <span class=\"ibTxt\"><a href=\"/#/books/quran:84#h10\">[84:10]</a> And as for him who is given his book behind his back, <a href=\"/#/books/quran:84#h11\">[84:11]</a> He shall call for perdition, <a href=\"/#/books/quran:84#h12\">[84:12]</a> And enter into burning fire <a href=\"/#/books/quran:84#h13\">[84:13]</a> Surely he used to be joyful among his people <a href=\"/#/books/quran:84#h14\">[84:14]</a> Surely he thought that he would never return <a href=\"/#/books/quran:84#h15\">[84:15]</a> Yea!</span> – So this one is a Polytheist.",
            "And He<sup>azwj</sup> Revealed in Surah <span class=\"ibTxt\"><a href=\"/#/books/quran:67#h1\">[67:1]</a> Blessed</span> - <span class=\"ibTxt\"><a href=\"/#/books/quran:67#h8\">[67:8]</a> Whenever a group is cast into it, its keeper shall ask them: Did there not come to you a warner? <a href=\"/#/books/quran:67#h9\">[67:9]</a> They shall say: Yes! Indeed there came to us a warner, but we rejected (him) and said: Allah has not Revealed anything</span>. So these ones are the Polytheists.",
            "And He<sup>azwj</sup> Revealed in (Surah) Al Haaqa (Chapter 69) - <span class=\"ibTxt\"><a href=\"/#/books/quran:69#h25\">[69:25]</a> And as for him who is given his book in his left hand he shall be saying: I wish that my book had never been given to me: <a href=\"/#/books/quran:69#h26\">[69:26]</a> And I had not known what my account was <a href=\"/#/books/quran:69#h27\">[69:27]</a> O I wish I was gone <a href=\"/#/books/quran:69#h28\">[69:28]</a> My wealth has availed me nothing</span> – up to His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:69#h33\">[69:33]</a> Surely he did not believe in Allah, the Magnificent</span>. So this one is a Polytheist.",
            "And He<sup>azwj</sup> Revealed in <span class=\"ibTxt\"><a href=\"/#/books/quran:26#h1\">[26:1]</a> Ta Sin Meem</span> - <span class=\"ibTxt\"><a href=\"/#/books/quran:26#h91\">[26:91]</a> And the Blazing Fire shall emerge for the erring ones <a href=\"/#/books/quran:26#h92\">[26:92]</a> And it shall be said to them: Where are what you were worshipping <a href=\"/#/books/quran:26#h93\">[26:93]</a> Besides Allah? Can they help you or help themselves? <a href=\"/#/books/quran:26#h94\">[26:94]</a> So they shall be flung into it, they and the erring ones <a href=\"/#/books/quran:26#h95\">[26:95]</a> And the armies of Iblees altogether</span>. The armies of Iblees<sup>la</sup> are his<sup>la</sup> offspring from the devils. And His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:26#h99\">[26:99]</a> And none but the guilty led us astray</span> – Meaning the Polytheists who believed in them, so they followed them upon their polytheism, and they are the people of Muhammad<sup>saww</sup> (Muslims), there not being anyone from the Jews and the Christians among them. ",
            "And the ratification of that are the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:22#h42\">[22:42]</a> then already before them the people of Noah belied <a href=\"/#/books/quran:26#h176\">[26:176]</a> The dwellers of the thicket belied the Rasools <a href=\"/#/books/quran:26#h160\">[26:160]</a> The people of Lut belied the Rasools</span><span class=\"iTxt\">. </span>There were no Jews among. Those who said, <span class=\"ibTxt\"><a href=\"/#/books/quran:9#h30\">[9:30]</a> Uzayr is the son of Allah</span> and those who said <span class=\"ibTxt\"><a href=\"/#/books/quran:9#h30\">[9:30]</a> and the Christians say: The Messiah is the son of Allah</span>, Allah<sup>azwj</sup> will be Entering the Jews and the Christians into the Fire, and every people would be entering (the Fire) due to their deeds.",
            "And their words <span class=\"ibTxt\"><a href=\"/#/books/quran:26#h99\">[26:99]</a> And none but the guilty led us astray </span>is ‘When they invited us to their way’. These are the Words of Allah<sup>azwj</sup> Mighty and Majestic regarding them when He<sup>azwj</sup> will Gather them to the Fire <span class=\"ibTxt\"><a href=\"/#/books/quran:7#h38\">[7:38]</a> the last of them shall say with regard to the foremost of them: Our Lord! These led us astray, therefore give them a double Punishment of the Fire</span>. And His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:7#h38\">[7:38]</a> whenever a community shall enter, it shall curse its sister (community)</span> until when they all come to it, some of them would disavow from some, and some of them would curse some (others). Some of them would want to argue against others hoping for the winning so they could escape from the magnitude of what would have descended upon them. And there would neither be a winning, nor a trial, nor an Acceptance of excuses nor a way to salvation.",
            "And the Verses and those resembling these from what were Revealed in Makkah, Allah<sup>azwj</sup> will not Enter anyone into the Fire except for a Polytheist. So when Allah<sup>azwj</sup> Permitted to Muhammad<sup>saww</sup> regarding the going out from Makkah to Al-Medina, Al-<span class=\"iTxt\">Islām</span> was built upon five – The testimony that there is no god except for Allah<sup>azwj</sup>, and that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Rasool<sup>saww</sup>, and establishment of the <span class=\"iTxt\">Salāt</span>, and the payment of the <span class=\"iTxt\">Zakāt</span>, and performance of the <span class=\"iTxt\">Hajj</span> of the House (Kabah), and (observing the) <span class=\"iTxt\">Soām</span><span class=\"ibTxt\"> (</span>Fasting) the Month of Ramazan.",
            "And the legal Punishments were Revealed unto Him<sup>saww</sup>, and the Obligatory distributions (inheritances), and He<sup>azwj</sup> Informed him<sup>saww</sup> of the disobediences which Allah<sup>azwj</sup> has Obligated the Fire upon, and due to it, for the ones who do it. And He<sup>azwj</sup> Revealed regarding the killer <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h93\">[4:93]</a> And whoever kills a Momin intentionally, his Punishment is Hell; he shall abide in it eternally, and Allah will Send His Wrath on him and Curse him and Prepare for him a Painful Punishment</span>. ",
            "And Allah<sup>azwj</sup> did not Curse the <span class=\"iTxt\">Momin (believer)</span>. Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\"><a href=\"/#/books/quran:33#h64\">[33:64]</a> Surely, Allah has Cursed the unbelievers and has Prepared for them a Blazing Fire <a href=\"/#/books/quran:33#h65\">[33:65]</a> To abide therein forever; they shall neither find a protector nor a helper</span>. How can it (the killing) be in the Will of Allah<sup>azwj</sup> when He<sup>azwj</sup> Joined the Anger and the Curse and his (killer’s) Recompense is Hell? ",
            "And He<sup>azwj</sup> Explained that from the Accursed ones in His<sup>azwj</sup> Book, and He<sup>azwj</sup> Revealed regarding the wealth of the orphans, the ones who consume it unjustly <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h10\">[4:10]</a> (As for) those who swallow the property of the orphans unjustly, but rather they only swallow fire into their bellies and they shall arriving at the Blazing Fire</span>; and that is the consumer of the wealth of the orphans would come on the Day of Judgement, and the Fire would be inflamed inside his belly to the extent that a flame of the fire would be coming out from his mouth, until everyone gathered would recognise that he had consumed the wealth of the orphans. ",
            "And He<sup>azwj</sup> Revealed regarding the weighing <span class=\"ibTxt\"><a href=\"/#/books/quran:83#h1\">[83:1]</a> Woe to the defrauders</span>, and He<sup>azwj</sup> did not Make the woe to be for anyone until He<sup>azwj</sup> Named him as a disbeliever. Allah<sup>azwj</sup> Mighty and Majestic Says <span class=\"ibTxt\"><a href=\"/#/books/quran:19#h37\">[19:37]</a> But the parties from among them disagreed with each other, so woe unto those who disbelieve in being present on a Great Day</span>. ",
            "And He<sup>azwj</sup> Revealed regarding the oath <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h77\">[3:77]</a> (As for) those who take a small price for the Covenant of Allah and their own oaths - surely they shall have no portion in the Hereafter, and Allah will not Speak to them, nor will He Look upon them on the Day of Judgement nor will He Purify them, and they shall have a painful Punishment</span>. And the ‘portion’ is the share. So the one who does not happen to have a share for him in the Hereafter, so with which thing would he enter the Paradise?",
            "And He<sup>azwj</sup> Revealed in Al-Medina <span class=\"ibTxt\"><a href=\"/#/books/quran:24#h3\">[24:3]</a> The adulterer shall not marry any but a adulteress or an idolatress, and (as for) the adulteress, none shall marry her but an adulterer or an idolater; and that is Forbidden to the Momineen (plural of Momin)</span>. So Allah<sup>azwj</sup> did not Name the adulterer as a <span class=\"iTxt\">Momin</span> nor the adulteress as a <span class=\"iTxt\">Momina</span> (Believing woman). And Rasool-Allah<sup>saww</sup> said, and the knowledgeable people would not doubt in it, he<sup>saww</sup> said: ‘An adulterer would not commit adultery when he is committing adultery while he is a <span class=\"iTxt\">Momin</span>, nor would a <span class=\"iTxt\">Momin</span> be a thief but when he steals Emān departs from him, the <span class=\"iTxt\">Emān</span> would be removed from him like the removal of the shirt’.",
            "And He<sup>azwj</sup> Revealed in Al-Medina <span class=\"ibTxt\"><a href=\"/#/books/quran:24#h4\">[24:4]</a> And those who accuse righteous women then do not bring four witnesses, so flog them eighty stripes, and do not accept any testimony from them ever; and these it is that are the transgressors <a href=\"/#/books/quran:24#h5\">[24:5]</a> Except those who repent after that and act aright, for surely Allah is Forgiving, Merciful</span>. So Allah<sup>azwj</sup> Freed whoever was staying upon the lie from him being Named as being with the <span class=\"iTxt\">Emān</span>. ",
            "Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\"><a href=\"/#/books/quran:32#h18\">[32:18]</a> Is the one who was a Momin like the one who was a transgressor? They are not equal</span>. And Allah<sup>azwj</sup> Made him to be a hypocrite. Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\"><a href=\"/#/books/quran:9#h67\">[9:67]</a> surely the hypocrites are the transgressors</span>. And the Mighty and Majestic Made him to be from the friends of Iblees<sup>la</sup>. He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:18#h50\">[18:50]</a> except for Iblees. He was from the Jinn, so he transgressed the Command of his Lord</span>. And He<sup>azwj</sup> Made him to be an Accursed one, so He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:24#h23\">[24:23]</a> Surely those who accuse righteous believing women, unaware (of the evil), are Cursed in the world and the Hereafter, and they shall have a grievous Punishment <a href=\"/#/books/quran:24#h24\">[24:24]</a> On the Day when their tongues and their hands and their feet shall testify against them as to what they had been doing</span>. And it is not for the body parts to testify against a <span class=\"iTxt\">Momin</span>. But rather, these would testify against the one upon whom the Sentence of the Punishment is due.",
            "So, as for the <span class=\"iTxt\">Momin</span>, so he would be Given his Book (Register of deeds) in his right hand. Allah<sup>azwj</sup> Mighty and Majestic Says <span class=\"ibTxt\"><a href=\"/#/books/quran:17#h71\">[17:71]</a> so whoever is Given his Book in his right hand, so they shall be reading their Book; and they shall not be dealt with unjustly by even a hair on a date stone</span>. ",
            "And Surah Al-Noor (Chapter 24) was Revealed after Surah Al-Nisaa (Chater 4), and the ratification of that is that Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>saww</sup> in Surah Al Nisaa (Chapter 4) <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h15\">[4:15]</a> And as for those who are guilty of an indecency from among your women, call to witnesses against them four (witnesses) from among you; then if they bear witness confine them to the houses until death takes them away or Allah opens some way for them</span>. And the way is that which Allah<sup>azwj</sup> Mighty and Majestic Spoke of <span class=\"ibTxt\"><a href=\"/#/books/quran:24#h1\">[24:1]</a> (This is) a Chapter We have Revealed and Made it Obligatory and Revealed in it clear Signs that you may be mindful <a href=\"/#/books/quran:24#h2\">[24:2]</a> (As for) the adulteress and the adulterer, flog each one of them a hundred stripes, and let not pity for them detain you regarding the Religion of Allah, if you are believing in Allah and the Last Day, and let a party of believers witness their Punishment</span>’."
          ],
          "en.sarwar": [
            "1. Ali ibn Muhammad has narrated from certain persons of his people from Adam ibn Ishaq from ‘Abd al-Razzaq from ibn Mihran from al-Husayn ibn Maymun from Muhammad ibn Salim from abu Ja’far (a.s.) who has said the following: “Abu Ja’far (a.s.) has said, ‘Certain people have spoken from this Holy Quran without knowledge. It is because Allah, the Most Holy, the Most High, has said, “It is Allah Who has revealed the Book to you in which certain verses are clear statements (that accept no interpretation), and these are the fundamental ideas of the Book, while other verses may have several possibilities. Those whose hearts are perverse follow the unclear statements in pursuit of their own mischievous goals by interpreting them in a way that will suit their own purpose. No one knows its true interpretations except Allah, and those who have a firm grounding in knowledge say, ‘We believe in it. All its verses are from our Lord.’ No one can grasp this fact except the people of reason.” <a href=\"/#/books/quran:3#h7\">[3:7]</a> ‘The suspended verses are of the unclear ones and the verses whose meaning can clearly be understood are of the suspending ones. Allah, the Most Majestic, the Most Holy, sent Prophet Noah to his people who said to them, “Worship Allah, have fear of Him and obey me” <a href=\"/#/books/quran:71#h3\">[71:3]</a>. He then called them to Allah alone to worship Him only and not to take any partners for Him. Thereafter He sent the prophets until (their coming ended with) Muhammad, recipient of divine supreme covenant. He invited people to worship Allah only and not to take partners for Him. And He said, “He has plainly clarified the religion which is revealed to you and that which Noah, Abraham, Moses, and Jesus were commanded to follow (He has explained it) so that you may remain steadfast and united in your religion. What you call the pagans to is extremely grave for them. Allah attracts (to the religion) whomever He wants and guides to it whoever turns to Him with repentance.” <a href=\"/#/books/quran:42#h13\">[42:13]</a> ‘He sent the prophets to their people with the testimony that stated, “No one deserves to be worshipped except Allah and that whatever every one (of the prophets) has brought is from Allah.” Those who sincerely accepted the faith and died with what they had accepted, Allah, through this will, admit them in paradise. Allah is not unjust to His servants, and Allah will not punish a servant unless he intensely sins such as committing murder or the sins for which Allah has made it clear that perpetrators thereof go to hell. When the believers of the people of each prophet followed them He gave them a system of laws and guidance. Al-Shari’a is a system, a path and tradition. Allah said to Prophet Muhammad, “(Muhammad), We have sent revelations to you just as were sent to Noah and the prophets who lived after him . . .” <a href=\"/#/books/quran:4#h163\">[4:163]</a>. Allah commanded every prophet to follow the path and the tradition. Of the traditions that Allah, the Most Majestic, the Most Holy, commanded Moses to follow was al-Sabbath. Those who observed its greatness and did not violate it out of respect for Allah, Allah admitted them to paradise. Those who violated its sanctity and considered lawful what Allah had made unlawful and prohibited, Allah, the Most Majestic, the Most Holy, sent them to hellfire for their making fishing lawful. They captured fish and ate them on Sabbath. Allah showed anger toward them even though they had not taken anyone as partners of the Beneficent or doubted the truth of what Moses had brought. Allah, the Most Majestic, the Most Holy, has said, “You certainly knew about those among you who were transgressors on the Sabbath. We commanded them, ‘Become detested apes . . <a href=\"/#/books/quran:2#h65\">[2:65]</a> Then Allah sent Jesus with the testimony that said, “No one deserves to be worshipped except Allah and all that he (Jesus) had brought was from Allah.’’ He made for them a system of law and a path. He abolished the Sabbath for which they, before, were commanded to pay respect and the ways and traditions that Moses had brought. Whoever did not follow Jesus, Allah sent them to fire, although all that the prophets had said was that no one must be considered as a partner of Allah. Then He sent Prophet Muhammad and for the ten years that he lived in Makka everyone who testified to the fact that “No one deserves to be worshipped except Allah, and that Muhammad is His messenger” Allah admitted him to paradise just because of his affirmation. It was belief and affirmation. Allah did not punish anyone of those who died following Muhammad in that matter except those who took partners for the Beneficent. Evidence of this is what Allah, the Most Majestic, the Most Holy, has revealed in Chapter 17 in Makka). “Your Lord has ordained that you must not worship anything other than Him and that you must be kind to your parents ... He is Well-aware and watches over His servants.” <a href=\"/#/books/quran:17#h30\">[17:30]</a> ‘It (besides belief in Allah) is discipline, advice and education. It (law) is a light prohibition and there is no warning about it and there is no warning against violating what is prohibited. He has revealed prohibitions of certain matters without warning (for issues less serious than disbelief) saying: “Do not kill your children for fear of poverty. We will give sustenance to all of you. To kill them is certainly a great sin. <a href=\"/#/books/quran:17#h31\">[17:31]</a> “Do not even approach adultery. It is indecent and an evil act. <a href=\"/#/books/quran:17#h32\">[17:32]</a> “Do not kill a respectable soul without a just cause. If anyone is wrongfully killed, We have given the heirs of that person the right (to demand satisfaction or to forgive). He must not exceed the law in having vengeance; law shall also assist his victim. <a href=\"/#/books/quran:17#h33\">[17:33]</a> “Do not get close to the property of the orphans (unless it is for a good reason) until they are mature and strong. Keep your promise; you will be questioned about it. <a href=\"/#/books/quran:17#h34\">[17:34]</a> “While weighing, use proper measurements in the exchange of your property. This is fair and will be better in the end. <a href=\"/#/books/quran:17#h35\">[17:35]</a> “Do not follow what you do not know; the ears, eyes, and hearts will all be held responsible for their deeds. <a href=\"/#/books/quran:17#h36\">[17:36]</a> “Do not walk proudly on the earth; your feet cannot tear apart the earth nor are you as tall as the mountains <a href=\"/#/books/quran:17#h37\">[17:37]</a>. All such things are sins and detestable in the sight of your Lord. <a href=\"/#/books/quran:17#h38\">[17:38]</a> “(Muhammad), these are words of wisdom, which your Lord has revealed to you. Do not consider anything equal to Allah lest you be thrown into hell, despised, and driven away from Allah’s mercy.” <a href=\"/#/books/quran:17#h39\">[17:39]</a> ‘(About more serious issues) Allah has also said, “By the night when it covers the day. <a href=\"/#/books/quran:92#h1\">[92:1]</a> I have warned you about the fierce blazing fire (14) in which no one will suffer forever (15) except the wicked ones who have rejected the (Truth) and have turned away from it.” <a href=\"/#/books/quran:92#h16\">[92:16]</a> ‘This (the wicked) is a pagan and in Chapter 84 Allah has said, “But as for those whose Book of Records will be given behind their backs, <a href=\"/#/books/quran:84#h10\">[84:10]</a> they will say, ‘Woe to us!’ (11). They will suffer the heat of hellfire (12). They lived among their people joyfully (13) and had thought that they would never be brought back to life again.” <a href=\"/#/books/quran:84#h14\">[84:14]</a> ‘This (one rejecting the Day of Judgment) is a pagan and in Chapter 67 Allah has said, “Whenever a group is thrown into it (hell), its keepers will ask them, ‘Did no one come to warn you? <a href=\"/#/books/quran:67#h8\">[67:8]</a> “They will say, ‘Yes, someone did come to warn us, but we rejected him saying, “Allah has revealed nothing. You are in great error.”’ <a href=\"/#/books/quran:67#h9\">[67:9]</a> ‘These are pagans and in Chapter 56 Allah has said, “If he is of those who have rejected the Truth and have gone astray, <a href=\"/#/books/quran:56#h92\">[56:92]</a> the dwelling (for him) will be (in) boiling water (93) and the heat of hellfire.” (94) ‘These also are pagans. In Chapter 69 Allah has said, “However, one who will receive the book of the records of his deeds in his left hand will say, ‘I wish that this record was never given to me <a href=\"/#/books/quran:69#h25\">[69:25]</a> and that I never known what my records contained. (26) Would that death had taken me away for good. (27) My wealth has been of no benefit to me (28) ... he did not believe in Allah, the Great . . .’ <a href=\"/#/books/quran:69#h33\">[69:33]</a> ‘This also is a pagan, and in Chapter 26 Allah has said, “. . . hell will be left open for the rebellious ones <a href=\"/#/books/quran:26#h91\">[26:91]</a> who will be asked, ‘What did you worship <a href=\"/#/books/quran:26#h92\">[26:92]</a> besides Allah? Will the idols help you? Can they help themselves? <a href=\"/#/books/quran:26#h93\">[26:93]</a>. The idol worshippers, the idols, the rebellious ones, <a href=\"/#/books/quran:26#h94\">[26:94]</a> and the army of Satan will all be thrown headlong into hell.’” <a href=\"/#/books/quran:26#h95\">[26:95]</a> The army of Satan and his descendents are of the devils (Shayatin) ‘Allah’s words, “Only the sinful ones made us go astray,” <a href=\"/#/books/quran:26#h99\">[26:99]</a> refers to pagans whom they had followed in their pagan manners and they were of the people of Prophet Muhammad (a.s.) of whom no one was a Jew or a Christian. Evidence of this is the words of Allah, the Most Majestic, the Most Holy, in Chapter 38 verse 12, “The people of Noah then rejected our messengers.” “The dwellers of the forest also rejected the Messengers.” <a href=\"/#/books/quran:26#h176\">[26:176]</a> “The people of Lot rejected the Messengers.” <a href=\"/#/books/quran:26#h160\">[26:160]</a> ‘Among them there is no one of the Jews who considered ‘Uzayr as the son of Allah or of the Christians who considered Jesus as the son of Allah. Allah will send (such) Jews and Christians to fire as well as those who had acted similarly. It comes from their own word, “Only the sinful ones made us go astray,” <a href=\"/#/books/quran:26#h99\">[26:99]</a> they invited us to their ways. ‘Evidence of this (more serious sins) is the words of Allah, the Most Majestic, the Most Holy, about them on their being brought together in fire, “The last group will accuse the first saying, ‘Lord, they made us go astray. Therefore, double their torment in the Fire . . .’” <a href=\"/#/books/quran:7#h38\">[7:38]</a> They will condemn and accuse each other. They argue in the hope of winning but there will be no winning, trial or acceptance of excuses and there will be no way to safety. Such verses and similar other ones were revealed in Makka. Allah does not send to fire anyone except the pagans. ‘When Allah granted Muhammad permission to leave Makka for Madina he spoke of Islam having five principles: ‘To testify that no one deserves to be worshipped except Allah, that Muhammad is His servant and His messenger, that performing the prayer, paying al-Zakat (charity), Hajj of the House and fasting in the month of Ramadan are obligatory. That Allah sent to him judicial rules, and the rules for the distribution of inheritance, and informed him of the sins for which Allah has made it obligatory to punish in fire those who commit such sins. About the murder He has revealed, “The punishment for one who purposely slays a believer will be to live in hellfire forever. Allah is angry with him and has condemned him. He has prepared for him a great torment.” <a href=\"/#/books/quran:4#h93\">[4:93]</a> ‘Allah does not condemn the believers. Allah, the Most Majestic, the Most Holy, has said, “Allah has condemned the unbelievers and prepared for them a burning torment <a href=\"/#/books/quran:33#h64\">[33:64]</a> wherein they will live forever without being able to find any guardian or helper.” <a href=\"/#/books/quran:33#h65\">[33:65]</a> ‘Committing murder does not come from His wish; His anger and condemnation apply to the murderer by sending him to fire. In the book he (murderer) is condemned. About the properties of the orphans that are consumed unjustly He has said, “Those who wrongfully consume the property of orphans are, in fact, consuming fire in their bellies and they will suffer the blazing fire.” (4: 10) ‘On the Day of Judgment, those who consume such properties unjustly will come when fire will be blazing in their bellies so much so that it will come out of their mouth. All the people in the gathering will learn that they are wrongful consumer of orphan’s properties. ‘About measurement for transactions He has said, “ Wayl , a place in hell, is for those who do not maintain proper measurement.” <a href=\"/#/books/quran:83#h2\">[83:2]</a> He has not said that Wayl is for any kinds of people other than those whom He has called to be of those who reject the faith. Allah, the Most Majestic, the Most Holy, has said, “Wayl ’is for those who reject faith and belief. The unbelievers shall face a woeful condition on the great Day (of Judgment).” <a href=\"/#/books/quran:19#h37\">[19:37]</a> ‘About the covenant Allah has said: “Those who sell their covenant with Allah and their promises for a small price will have no share in the life hereafter. Allah on the Day of Judgment will not speak to them nor will He look at them nor will He purify them. They will face a painful torment.” <a href=\"/#/books/quran:3#h77\">[3:77]</a> ‘If someone will have no share on the Day of Judgment then by what means would he enter paradise? ‘The following was revealed in Madina. “No one should marry a (male) fornicator except a (female) fornicator or a pagan woman. No one should marry a (female) fornicator except a (male) fornicator or a pagan man. Such (marriage) is unlawful to the believers.” <a href=\"/#/books/quran:24#h3\">[24:3]</a> ‘Allah has not called a male or female fornicator a believer. People of knowledge do not doubt what the Messenger of Allah has said to them: “At the time of committing fornication a male or female is not a believer, a thief, male or female is not a believer at the time of committing theft and if one does commit theft one is devoid of belief. It is like a shirt removed from one’s body.” The following verse of the Quran was revealed in Madina: “Those who accuse married women of committing adultery, but are not able to prove their accusation by producing four witness, must be flogged eighty lashes. Never accept their testimony thereafter; they are sinful, <a href=\"/#/books/quran:24#h4\">[24:4]</a> except that of those who afterwards repent and reform themselves; Allah is All- forgiving and All-merciful.” <a href=\"/#/books/quran:24#h5\">[24:5]</a> ‘Allah has not called an accuser a believer. Allah, the Most Majestic, the Most Holy, has said, “Is a believer equal to an evildoer? They are not equal at all.” <a href=\"/#/books/quran:32#h18\">[32:18]</a> ‘Allah had made him a hypocrite. As Allah, the Most Majestic, the Most Holy, has said, “The hypocrites indeed are evildoers.” <a href=\"/#/books/quran:9#h67\">[9:67]</a> ‘Allah, the Most Majestic, the Most Holy, has made them of the friends of Satan as He has said, . . except lblis. He was a Jinn and he sinned against the command of his Lord. . . .” <a href=\"/#/books/quran:18#h50\">[18:50]</a> ‘Allah called him ‘condemned’ in his words, “Those who slander the unaware but chaste and believing women (of committing unlawful carnal relations) are condemned in this life and in the life hereafter. They will suffer a great punishment <a href=\"/#/books/quran:24#h23\">[24:23]</a> on the day when their tongues, hands and feet will testify to what they have done.” <a href=\"/#/books/quran:24#h24\">[24:24]</a> ‘Parts of the body do not testify against a believer. They testify against those who have become subject to punishment. However, the believers will receive the book of their account in their right hand as Allah, the Most Majestic, the Most Holy, has said, “. . . those whose records of deeds are given to their right hands will read the book and the least wrong will not be done to them.” <a href=\"/#/books/quran:17#h71\">[17:71]</a> ‘Chapter 24 was revealed after Chapter 4. There is evidence for this in what Allah, the Most Majestic, the Most Holy, sent down to him (Muhammad) in Chapter 4 as follows: “Agaisnt those of your women who commit fornication, let four (Muslim) witness testify to their act. If there is sufficient testimony, confine them to their homes until they die, or until Allah provides a way for their freedom.” <a href=\"/#/books/quran:4#h15\">[4:15]</a> ‘The path is what Allah, the Most Majestic, the Most Holy, has said, “This is a Chapter which We have revealed to you and made obligatory for you to following its guidance. We have revealed clear verses in it so that perhaps you may take heed. <a href=\"/#/books/quran:24#h1\">[24:1]</a> “Flog the (female) fornicator and the (male) fornicator with a hundred lashes each. Let there be no reluctance in enforcing the laws of Allah, if you have faith in Allah and the Day of Judgment. Let it take place in the presence of a group of believers.”’” <a href=\"/#/books/quran:24#h2\">[24:2]</a> "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (206/ 7)"
        ],
        "index": 1512,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:17:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ فُضَيْلٍ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قِيلَ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) مَنْ شَهِدَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كَانَ مُؤْمِناً قَالَ فَأَيْنَ فَرَائِضُ اللَّهِ ",
          "قَالَ وَ سَمِعْتُهُ يَقُولُ كَانَ عَلِيٌّ ( عليه السلام ) يَقُولُ لَوْ كَانَ الْإِيمَانُ كَلَاماً لَمْ يَنْزِلْ فِيهِ صَوْمٌ وَ لَا صَلَاةٌ وَ لَا حَلَالٌ وَ لَا حَرَامٌ ",
          "قَالَ وَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) إِنَّ عِنْدَنَا قَوْماً يَقُولُونَ إِذَا شَهِدَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَهُوَ مُؤْمِنٌ قَالَ فَلِمَ يُضْرَبُونَ الْحُدُودَ وَ لِمَ تُقْطَعُ أَيْدِيهِمْ وَ مَا خَلَقَ اللَّهُ عَزَّ وَ جَلَّ خَلْقاً أَكْرَمَ عَلَى اللَّهِ عَزَّ وَ جَلَّ مِنَ الْمُؤْمِنِ لِأَنَّ الْمَلَائِكَةَ خُدَّامُ الْمُؤْمِنِينَ وَ أَنَّ جِوَارَ اللَّهِ لِلْمُؤْمِنِينَ وَ أَنَّ الْجَنَّةَ لِلْمُؤْمِنِينَ وَ أَنَّ الْحُورَ الْعِينَ لِلْمُؤْمِنِينَ ",
          "ثُمَّ قَالَ فَمَا بَالُ مَنْ جَحَدَ الْفَرَائِضَ كَانَ كَافِراً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Muhammad Bin Fuzayl, from Abu Al Sabbah Al Kinany, ",
            "(It has been narrated) from Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> having said: ‘It was said to Amir Al-Momineen<sup style=\"font-weight: normal\">asws</sup>, ‘The one who testifies that there is no god except for Allah<sup style=\"font-weight: normal\">azwj</sup> and that Muhammad<sup style=\"font-weight: normal\">saww</sup> is Rasool<sup style=\"font-weight: normal\">saww</sup> of Allah<sup style=\"font-weight: normal\">azwj</sup>, would be a <span class=\"iTxt\">Momin</span>?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘So where are the Obligations of Allah<sup style=\"font-weight: normal\">azwj</sup>?’ ",
            "He (the narrator) said, ‘And I heard him<sup style=\"font-weight: normal\">asws</sup> saying: ‘Ali<sup style=\"font-weight: normal\">asws</sup> was saying: ‘If the <span class=\"iTxt\">Emān</span> was speech, there would not have been Sent down regarding it a <span class=\"iTxt\">Soām</span>, nor a <span class=\"iTxt\">Salāt</span>, nor a Permissible, nor a Prohibition’. ",
            "He (the narrator) said, ‘I said to Abu Ja’far<sup style=\"font-weight: normal\">asws</sup>: ‘With us there is a group of people who are saying, ‘When one testifies that there is no god except for Allah<sup style=\"font-weight: normal\">azwj</sup>, and that Muhammad<sup style=\"font-weight: normal\">saww</sup> is Rasool<sup style=\"font-weight: normal\">saww</sup> of Allah<sup style=\"font-weight: normal\">azwj</sup>, so he would be a <span class=\"iTxt\">Momin</span>’. He<sup style=\"font-weight: normal\">asws</sup> said: ‘And why are they being struck by the legal punishments, and why are their hands being cut-off. And Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic has not Created a creature more prestigious to Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic than the <span class=\"iTxt\">Momin</span>, because the Angels are the attendants of the <span class=\"iTxt\">Momineen (plural of Momin)</span>, and that vicinity of Allah<sup style=\"font-weight: normal\">azwj</sup> is for the <span class=\"iTxt\">Momineen</span>, and that the Paradise is for the <span class=\"iTxt\">Momineen</span>, and that the Maiden Houries are for the <span class=\"iTxt\">Momineen</span>’. ",
            "Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘So what is the case of the one who denies the Obligations? He would be a disbeliever’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Isma’il from Muhammad ibn Fudayl from abu al-Sabbah al- Kinani from abu la’ far (a.s.) who has said the following: “Amir al-Mu’minin (Ali ibn abu Talib) was asked, ‘Is one who testifies that no one deserves to be worshipped except Allah and that Muhammad is the Messenger of Allah, a believer?’ The Imam said, ‘Wherefore, then, are the obligations toward Allah?’ “I (the narrator) heard the Imam saying, ‘Ali (a.s.) would say, “Had belief been just ‘asserted words’ nothing about fasting, prayer, lawful and unlawful matters would have been needed to come down (from heaven).”’ He has said, ‘I reported to abu Ja’far (a.s.) “We know a people who say that upon saying, ‘No one deserves to be worshipped except Allah and Muhammad is the Messenger of Allah,’ one becomes a believer.” The Imam said, ‘Is it then that (there is no need) to apply any judicial rules to them, like the rules about theft? Allah, the Most Majestic, the Most Holy, has not created any creature more honorable to Allah, the Most Majestic, the Most Holy, than a believer. The angels serve the believers; they are near Allah, that paradise is for the believers; that spouses with large black eyes are for the believers.’ He then said, ‘Do they, who reject the obligations, know that they are unbelievers?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/208)"
        ],
        "index": 1513,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:17:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ سَلَّامٍ الْجُعْفِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْإِيمَانِ فَقَالَ الْإِيمَانُ أَنْ يُطَاعَ اللَّهُ فَلَا يُعْصَى ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Sallam Al Ju’fy who said, ",
            "‘I asked Abu Abdullah about the <span class=\"iTxt\">Emān</span>, so he<sup style=\"font-weight: normal\">asws</sup> said: ‘The <span class=\"iTxt\">Emān</span> is that you obey Allah<sup style=\"font-weight: normal\">azwj</sup> and you do not disobey’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from Salam al-Ju’fly who has said the following: “Once I asked abu ‘Aabd Allah (a.s.) about belief. He said, ‘Belief is whereby Allah is obeyed and (with it) one does not commit sins.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:17",
  "kind": "verse_list"
}