{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 170"
        },
        "path": "/books/al-kafi:2:1:170",
        "titles": {
          "ar": "بَابُ الشَّكِّ",
          "en": "Chapter 170 – The Doubt"
        }
      }
    ],
    "index": 358,
    "local_index": 170,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 171"
        },
        "path": "/books/al-kafi:2:1:171",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الضَّلَالِ</span>",
          "en": "Chapter 171 – The Straying"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 169"
        },
        "path": "/books/al-kafi:2:1:169",
        "titles": {
          "ar": "بَابُ الشِّرْكِ",
          "en": "Chapter 169 – The Shirk (Polytheism/Association)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:170",
    "titles": {
      "ar": "بَابُ الشَّكِّ",
      "en": "Chapter 170 – The Doubt"
    },
    "verse_count": 9,
    "verse_start_index": 2869,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/180)"
        ],
        "index": 2870,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:170:1",
        "refs": {
          "Quran": [
            "/books/quran:7:102",
            "/books/quran:2:260"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنِ الْحُسَيْنِ بْنِ الْحَكَمِ قَالَ كَتَبْتُ إِلَى الْعَبْدِ الصَّالِحِ ( عليه السلام ) أُخْبِرُهُ أَنِّي شَاكٌّ وَ قَدْ قَالَ إِبْرَاهِيمُ ( عليه السلام ) رَبِّ أَرِنِي كَيْفَ تُحْيِ الْمَوْتى وَ أَنِّي أُحِبُّ أَنْ تُرِيَنِي شَيْئاً ",
          "فَكَتَبَ ( عليه السلام ) إِنَّ إِبْرَاهِيمَ كَانَ مُؤْمِناً وَ أَحَبَّ أَنْ يَزْدَادَ إِيمَاناً وَ أَنْتَ شَاكٌّ وَ الشَّاكُّ لَا خَيْرَ فِيهِ ",
          "وَ كَتَبَ إِنَّمَا الشَّكُّ مَا لَمْ يَأْتِ الْيَقِينُ فَإِذَا جَاءَ الْيَقِينُ لَمْ يَجُزِ الشَّكُّ وَ كَتَبَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ وَ ما وَجَدْنا لِأَكْثَرِهِمْ مِنْ عَهْدٍ وَ إِنْ وَجَدْنا أَكْثَرَهُمْ لَفاسِقِينَ قَالَ نَزَلَتْ فِي الشَّاكِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Al Husayn Bin Al Hakam who said, ",
            "‘I wrote to Al-Abd Al-Salih<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), informing him<sup>asws</sup> that I am doubtful, and Ibrahim<sup>as</sup> had said <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h260\">[2:260]</a> And when Ibrahim said: Lord! Show me how You Revive the dead</span>, and I would like you<sup>asws</sup> to show me something’. ",
            "So he<sup style=\"font-weight: normal\">asws</sup> wrote: ‘Ibrahim<sup style=\"font-weight: normal\">as</sup> was a <span class=\"iTxt\">Momin</span> and he<sup style=\"font-weight: normal\">as</sup> loved that there be an increase in his<sup style=\"font-weight: normal\">as</sup> <span class=\"iTxt\">Emān</span>, and you are doubtful, and the doubt it such that there is no good in it’. And he<sup style=\"font-weight: normal\">asws</sup> wrote: ‘But rather, the doubt is what the conviction does not come to. So when the conviction does come, the doubt is not allowed’. ",
            "And he<sup style=\"font-weight: normal\">asws</sup> wrote: ‘Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:7#h102\">[7:102]</a> And We did not find in most of them any (faithfulness to) the Covenant, and We found most of them to be as transgressors</span>. He<sup style=\"font-weight: normal\">asws</sup> said: ‘It was Revealed regarding the doubt’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from al- Husayn ibn Hakam who has said the following: “Once I wrote to the virtuous servant (of Allah) saying that I had doubt and Ibrahim, peace be upon him, had said, ‘Lord, show me how you will bring the dead to life?’ (2: 260) and I would love that you show me something. The Imam wrote back to me, ‘Ibrahim was a believer. He wanted to increase his belief. You, however, have doubt and there is nothing good in doubt.’ The Imam further wrote, ‘Doubt comes when there is no certainty when certainty, comes then doubting is not permissible.’ He wrote further, ‘Allah, the Most Majestic, the Most Holy, has said, “We did not find many among them keeping their promises. However, We did find many evil-doers among them.” <a href=\"/#/books/quran:7#h102\">[7:102]</a> The Imam said, ‘It was revealed about people who doubt.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/182)"
        ],
        "index": 2871,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:170:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ أَبِي إِسْحَاقَ الْخُرَاسَانِيِّ قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) يَقُولُ فِي خُطْبَتِهِ لَا تَرْتَابُوا فَتَشُكُّوا وَ لَا تَشُكُّوا فَتَكْفُرُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Asbat, from Abu Is’haq Al Khurasany who said, ",
            "‘Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup> was saying in a sermon of his<sup>asws</sup>: ‘Do not be suspicious for you will be doubting, and do not be doubtful for you would be disbelieving’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Asbat from abu Ishaq al-Khurasani who has said the following: “Amir al-Mu’minin, Ali ibn abu Talib (a.s.) would say in his sermons, ‘Do not suspect; you will doubt and do not doubt; you will become unbelievers.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/182)"
        ],
        "index": 2872,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:170:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ خَلَفِ بْنِ حَمَّادٍ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) جَالِساً عَنْ يَسَارِهِ وَ زُرَارَةُ عَنْ يَمِينِهِ فَدَخَلَ عَلَيْهِ أَبُو بَصِيرٍ فَقَالَ يَا أَبَا عَبْدِ اللَّهِ مَا تَقُولُ فِيمَنْ شَكَّ فِي اللَّهِ فَقَالَ كَافِرٌ يَا أَبَا مُحَمَّدٍ قَالَ فَشَكَّ فِي رَسُولِ اللَّهِ فَقَالَ كَافِرٌ قَالَ ثُمَّ الْتَفَتَ إِلَى زُرَارَةَ فَقَالَ إِنَّمَا يَكْفُرُ إِذَا جَحَدَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Khalaf Bin Hammad, from Abu Ayoub Al Khazzaz, from Muhammad Bin Muslim who said, ",
            "‘I was in the presence of Abu Abdullah<sup style=\"font-weight: normal\">asws</sup>, seated on his<sup style=\"font-weight: normal\">asws</sup> left, and Zurara was on his<sup style=\"font-weight: normal\">asws</sup> right, and Abu Baseer came over and he said, ‘O Abu Abdullah<sup style=\"font-weight: normal\">asws</sup>! What are you<sup style=\"font-weight: normal\">asws</sup> saying regarding the one who doubts in Allah<sup style=\"font-weight: normal\">azwj</sup>’. So he<sup style=\"font-weight: normal\">asws</sup> said: ‘A <span class=\"iTxt\">Kafir</span> (Unbeliver), O Abu Muhammad!’ He said, ‘So (what about) the doubt in Rasool-Allah<sup style=\"font-weight: normal\">saww</sup>?’ So he<sup style=\"font-weight: normal\">asws</sup> said: ‘A <span class=\"iTxt\">Kafir</span> (Unbeliver)’. Then he<sup style=\"font-weight: normal\">asws</sup> turned towards Zurara and he<sup style=\"font-weight: normal\">asws</sup> said: ‘But rather, he disblieves when he rejects’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father from Khalaf ibn Hammad from abu Ayyub al-Khazzaz from Muhammad ibn Muslim who has said the following: “Once I was in the presence of abu ‘Abd Allah (a.s.) sitting to his left side and Zurara was sitting to his right side. Abu Basil’ came in and he asked, ‘What do you say if one doubts in Allah?’ The Imam said, ‘He is an unbeliever, O abu Muhammad.’ Abu Basir then asked, ‘What if one has doubts in the Messenger of Allah?’ The Imam said, ‘He is an unbeliever.’ The narrator has said that the Imam then turned to Zurara and said, ‘He (such a person) is an unbeliever only if he rejects.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/183)"
        ],
        "index": 2873,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:170:4",
        "refs": {
          "Quran": [
            "/books/quran:6:82"
          ]
        },
        "text": [
          "عَنْهُ عَنْ أَبِيهِ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى بْنِ عِمْرَانَ الْحَلَبِيِّ عَنْ هَارُونَ بْنِ خَارِجَةَ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ الَّذِينَ آمَنُوا وَ لَمْ يَلْبِسُوا إِيمانَهُمْ بِظُلْمٍ قَالَ بِشَكٍّ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from his father, from Al Nazar Bin Suweyd, from Yahya Bin Imran Al Halby, from Haroun Bin Kharija, ",
            "(It has been narrated) from Abu Baseer who said, ‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h82\">[6:82]</a> Those who believe and do not mix up their faith with iniquity</span>. He<sup>asws</sup> said: ‘By doubt’."
          ],
          "en.sarwar": [
            "4. It is narrated from him (narrator of the Hadith above) from his father from al- Nadr ibn Suwayd from Yahya ibn ‘Imran al-Halabi from Harun ibn Kharijah from abu Basir who has said the following: “Once I asked abu ‘Abd Allah (a.s.) about the words of Allah, the Most Majestic, the Most Holy, ‘Those who have accepted the faith and have kept it pure from injustice have achieved security and guidance.’ <a href=\"/#/books/quran:6#h82\">[6:82]</a> The Imam said, ‘(It means one) who has kept it (belief) pure from doubt.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/185)"
        ],
        "index": 2874,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:170:5",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ بَكْرِ بْنِ مُحَمَّدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الشَّكَّ وَ الْمَعْصِيَةَ فِي النَّارِ لَيْسَا مِنَّا وَ لَا إِلَيْنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Ahmad Bin Is’haq, from Bakr Bin Muhammad, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The doubter and the disobedient one would be in the Fire. He is neither from us<sup>asws</sup> nor to us<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "5. Al-Husayn ibn Muhammad has narrated from Ahmad ibn Ishaq from Bakr ibn Muhammad from abu ‘Abd Allah (a.s.) who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘Doubts and disobedience are in the fire. It (doubt or people having doubts) is not from us nor is it directed to us.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/185)"
        ],
        "index": 2875,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:170:6",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ شَكَّ فِي اللَّهِ بَعْدَ مَوْلِدِهِ عَلَى الْفِطْرَةِ لَمْ يَفِئْ إِلَى خَيْرٍ أَبَداً ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Usman Bin Isa, from a man, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who doubts in Allah<sup>azwj</sup> after his birth being upon the nature (natural disposition to believe in Allah<sup>azwj</sup>), would not end up to anything good, ever!’"
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from ‘Uthman ibn ‘Isa from a man from abu ‘Abd Allah (a.s.) who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘One who doubts in Allah after being born from Muslim parents, forever, will not end up to anything good.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/185)"
        ],
        "index": 2876,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:170:7",
        "text": [
          "عَنْهُ عَنْ أَبِيهِ رَفَعَهُ إِلَى أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَا يَنْفَعُ مَعَ الشَّكِّ وَ الْجُحُودِ عَمَلٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from his father, ",
            "(It has been narrated) raising it to Abu Ja’far<sup>asws</sup> having said: ‘No deed with doubt and denial will be of any benefit’."
          ],
          "en.sarwar": [
            "7. It is narrated from him (narrator of the Hadith above) from his father in a marfu’ manner from abu la’ far (a.s.) who has said the following: “Abu Ja’far (a.s.) has said, ‘No deed with doubt and denial will be of any benefit.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/186)"
        ],
        "index": 2877,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:170:8",
        "text": [
          "وَ فِي وَصِيَّةِ الْمُفَضَّلِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ مَنْ شَكَّ أَوْ ظَنَّ وَ أَقَامَ عَلَى أَحَدِهِمَا أَحْبَطَ اللَّهُ عَمَلَهُ إِنَّ حُجَّةَ اللَّهِ هِيَ الْحُجَّةُ الْوَاضِحَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "And in a bequest of Al Mufazzal, he said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The one who doubts or <span class=\"iTxt\">Zann</span> (conjectures), and lives with one of them, Allah<sup>azwj</sup> would Confiscate his deeds. The proof of (existence of) Allah<sup>azwj</sup> is the Proof which is Radiant (Clearly Evident)’."
          ],
          "en.sarwar": [
            "8. It is in the advice to al-Mufaddal who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘One who has doubt or Zann (better than doubt and less than certainty) and lives with one of them (such conditions), Allah turns his deeds fruitless. The authority and proof for (existence of) Allah is clear authority and proof.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/186)"
        ],
        "index": 2878,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:170:9",
        "text": [
          "عَنْهُ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ قُلْتُ إِنَّا لَنَرَى الرَّجُلَ لَهُ عِبَادَةٌ وَ اجْتِهَادٌ وَ خُشُوعٌ وَ لَا يَقُولُ بِالْحَقِّ فَهَلْ يَنْفَعُهُ ذَلِكَ شَيْئاً فَقَالَ يَا أَبَا مُحَمَّدٍ إِنَّمَا مَثَلُ أَهْلِ الْبَيْتِ مَثَلُ أَهْلِ بَيْتٍ كَانُوا فِي بَنِي إِسْرَائِيلَ كَانَ لَا يَجْتَهِدُ أَحَدٌ مِنْهُمْ أَرْبَعِينَ لَيْلَةً إِلَّا دَعَا فَأُجِيبَ ",
          "وَ إِنَّ رَجُلًا مِنْهُمُ اجْتَهَدَ أَرْبَعِينَ لَيْلَةً ثُمَّ دَعَا فَلَمْ يُسْتَجَبْ لَهُ فَأَتَى عِيسَى ابْنَ مَرْيَمَ ( عليه السلام ) يَشْكُوا إِلَيْهِ مَا هُوَ فِيهِ وَ يَسْأَلُهُ الدُّعَاءَ قَالَ فَتَطَهَّرَ عِيسَى وَ صَلَّى ثُمَّ دَعَا اللَّهَ عَزَّ وَ جَلَّ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ يَا عِيسَى إِنَّ عَبْدِي أَتَانِي مِنْ غَيْرِ الْبَابِ الَّذِي أُوتَى مِنْهُ إِنَّهُ دَعَانِي وَ فِي قَلْبِهِ شَكٌّ مِنْكَ فَلَوْ دَعَانِي حَتَّى يَنْقَطِعَ عُنُقُهُ وَ تَنْتَثِرَ أَنَامِلُهُ مَا اسْتَجَبْتُ لَهُ ",
          "قَالَ فَالْتَفَتَ إِلَيْهِ عِيسَى ( عليه السلام ) فَقَالَ تَدْعُو رَبَّكَ وَ أَنْتَ فِي شَكٍّ مِنْ نَبِيِّهِ فَقَالَ يَا رُوحَ اللَّهِ وَ كَلِمَتَهُ قَدْ كَانَ وَ اللَّهِ مَا قُلْتَ فَادْعُ اللَّهَ لِي أَنْ يَذْهَبَ بِهِ عَنِّي قَالَ فَدَعَا لَهُ عِيسَى ( عليه السلام ) فَتَابَ اللَّهُ عَلَيْهِ وَ قَبِلَ مِنْهُ وَ صَارَ فِي حَدِّ أَهْلِ بَيْتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ali Bin Asbat, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>), said, ‘I said, ‘We see the man who has worshipped, and the striving, and the humbleness, but he is not saying with the truth (Al-Wilayah). So would then he get any benefit?’ So he<sup>asws</sup> said: ‘O Abu Muhammad! An example of the People<sup>asws</sup> of the Household is like an example of the People of the Household who used to be among the Children of Israel (Prophet Isa<sup>as</sup>). It was so that no one from them (the nation of Isa<sup>as</sup>) would strive for more than forty nights and supplicate except it would be Answered. ",
            "And that a man from them (Children of Israel) strived for forty nights, then supplicated, but it was not Answered for him. So he came over to Isa<sup>as</sup> Bin Maryam<sup>as</sup> complaining to him<sup>as</sup> of what he was in and asked him<sup>as</sup> of the supplication. So Isa<sup>as</sup> purified and prayed <span class=\"iTxt\">Salāt</span>, then supplicated to Allah<sup>azwj</sup> Mighty and Majestic. So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>as</sup>: “O Isa<sup>as</sup>! My<sup>azwj</sup> servant came to me from other than the door which I<sup>azwj</sup> am approached. He supplicated to Me<sup>azwj</sup> and in his heart was doubt about you<sup>as</sup>. So even if he were to supplicate to me<sup>azwj</sup> to the extent that his neck breaks off and his fingers scatter (disintegrate), I<sup>azwj</sup> will not Answer for him”.",
            "He<sup style=\"font-weight: normal\">asws</sup> said: ‘So Isa<sup style=\"font-weight: normal\">as</sup> turned towards him and said, ‘You supplicated to your Lord<sup style=\"font-weight: normal\">azwj</sup> and you were in doubt about His<sup style=\"font-weight: normal\">azwj</sup> Prophet<sup style=\"font-weight: normal\">as</sup>?’ So he said, ‘O Spirit of Allah<sup style=\"font-weight: normal\">azwj</sup> and His<sup style=\"font-weight: normal\">azwj</sup> Word! It has been so, by Allah<sup style=\"font-weight: normal\">azwj</sup>, what you<sup style=\"font-weight: normal\">as</sup> said. Therefore, supplicate for me that He<sup style=\"font-weight: normal\">azwj</sup> Removes it from me’. So Isa<sup style=\"font-weight: normal\">as</sup> supplicated for him, and Allah<sup style=\"font-weight: normal\">azwj</sup> Turned towards him (with Forgiveness), and Accepted from him, and he came to be within a limit (closer) of his<sup class=\"bTxt\">as</sup> family’."
          ],
          "en.sarwar": [
            "9. It is narrated from him (narrator of the Hadith above) from Ali ibn Asbat from al-‘Ala’ ibn Razin from Muhammad ibn Muslim who has said the following: “Once I said to one of (two Imam) (a.s.) ‘We find a man who worships, and strives with humility but does not believe in the truth (Shi’a belief). Will it be of any benefit for him?’ The Imam said, ‘O abu Muhammad, the case of AM al-Bayt (of Muhammad) is like that AM al-Bayt in the family of Israel. An individual of that family would strive for forty nights and pray, his prayers received the answer. Only one man of that family strived for forty nights and prayed but his prayer did not receive any answer. When Jesus, son of Mary came, he complained to him about his case and asked him for prayer. The Imam said that Jesus then cleansed himself, said the prayer, prayed to Allah, the Most Majestic, the Most Holy, and Allah, the Most Majestic, the Most Holy, sent revelations to Jesus that said, ‘O Jesus, My servant came to Me from a door that is other than the door from which one must come to Me. He prayed and there was doubt in his heart about you. Were he to pray to Me until his neck would be cut off (disintegrate) and his fingers turn into dust, I would not answer his prayer.’ The Imam said, ‘Jesus then turned to the man and asked, ‘Do you ask your Lord for help while you have doubt in His prophet?’ The man said, ‘O Spirit of Allah and His word, it has been just as you said. Pray to Allah for me to remove doubt from me. ’ The Imam said that Jesus than prayed for him and Allah accepted his repentance and he became like all the other ones of that family.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:170",
  "kind": "verse_list"
}