{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:2:1", "titles": {"ar": "كتاب الإيمان و الكفر", "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"}}, {"indexed_titles": {"en": "Chapter 171"}, "path": "/books/al-kafi:2:1:171", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الضَّلَالِ</span>", "en": "Chapter 171 – The Straying"}}], "index": 359, "local_index": 171, "part_type": "Chapter", "path": "/books/al-kafi:2:1:171", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الضَّلَالِ</span>", "en": "Chapter 171 – The Straying"}, "verse_count": 2, "verse_start_index": 2878, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 2879, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:1:171:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ هَاشِمٍ صَاحِبِ الْبَرِيدِ قَالَ كُنْتُ أَنَا وَ مُحَمَّدُ بْنُ مُسْلِمٍ وَ أَبُو الْخَطَّابِ مُجْتَمِعِينَ فَقَالَ لَنَا أَبُو الْخَطَّابِ مَا تَقُولُونَ فِيمَنْ لَمْ يَعْرِفْ هَذَا الْأَمْرَ فَقُلْتُ مَنْ لَمْ يَعْرِفْ هَذَا الْأَمْرَ فَهُوَ كَافِرٌ فَقَالَ أَبُو الْخَطَّابِ لَيْسَ بِكَافِرٍ حَتَّى تَقُومَ عَلَيْهِ الْحُجَّةُ فَإِذَا قَامَتْ عَلَيْهِ الْحُجَّةُ فَلَمْ يَعْرِفْ فَهُوَ كَافِرٌ فَقَالَ لَهُ مُحَمَّدُ بْنُ مُسْلِمٍ سُبْحَانَ اللَّهِ مَا لَهُ إِذَا لَمْ يَعْرِفْ وَ لَمْ يَجْحَدْ يَكْفُرُ لَيْسَ بِكَافِرٍ إِذَا لَمْ يَجْحَدْ", "قَالَ فَلَمَّا حَجَجْتُ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ فَأَخْبَرْتُهُ بِذَلِكَ فَقَالَ إِنَّكَ قَدْ حَضَرْتَ وَ غَابَا وَ لَكِنْ مَوْعِدُكُمُ اللَّيْلَةَ الْجَمْرَةُ الْوُسْطَى بِمِنًى فَلَمَّا كَانَتِ اللَّيْلَةُ اجْتَمَعْنَا عِنْدَهُ وَ أَبُو الْخَطَّابِ وَ مُحَمَّدُ بْنُ مُسْلِمٍ", "فَتَنَاوَلَ وِسَادَةً فَوَضَعَهَا فِي صَدْرِهِ ثُمَّ قَالَ لَنَا مَا تَقُولُونَ فِي خَدَمِكُمْ وَ نِسَائِكُمْ وَ أَهْلِيكُمْ أَ لَيْسَ يَشْهَدُونَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ قُلْتُ بَلَى قَالَ أَ لَيْسَ يَشْهَدُونَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قُلْتُ بَلَى قَالَ أَ لَيْسَ يُصَلُّونَ وَ يَصُومُونَ وَ يَحُجُّونَ قُلْتُ بَلَى قَالَ فَيَعْرِفُونَ مَا أَنْتُمْ عَلَيْهِ قُلْتُ لَا قَالَ فَمَا هُمْ عِنْدَكُمْ قُلْتُ مَنْ لَمْ يَعْرِفْ هَذَا الْأَمْرَ فَهُوَ كَافِرٌ ", "قالَ سُبْحَانَ اللَّهِ أَ مَا رَأَيْتَ أَهْلَ الطَّرِيقِ وَ أَهْلَ الْمِيَاهِ قُلْتُ بَلَى قَالَ أَ لَيْسَ يُصَلُّونَ وَ يَصُومُونَ وَ يَحُجُّونَ أَ لَيْسَ يَشْهَدُونَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ قُلْتُ بَلَى قَالَ فَيَعْرِفُونَ مَا أَنْتُمْ عَلَيْهِ قُلْتُ لَا قَالَ فَمَا هُمْ عِنْدَكُمْ قُلْتُ مَنْ لَمْ يَعْرِفْ هَذَا الْأَمْرَ فَهُوَ كَافِرٌ", "قَالَ سُبْحَانَ اللَّهِ أَ مَا رَأَيْتَ الْكَعْبَةَ وَ الطَّوَافَ وَ أَهْلَ الْيَمَنِ وَ تَعَلُّقَهُمْ بِأَسْتَارِ الْكَعْبَةِ قُلْتُ بَلَى قَالَ أَ لَيْسَ يَشْهَدُونَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ يُصَلُّونَ وَ يَصُومُونَ وَ يَحُجُّونَ قُلْتُ بَلَى قَالَ فَيَعْرِفُونَ مَا أَنْتُمْ عَلَيْهِ قُلْتُ لَا قَالَ فَمَا تَقُولُونَ فِيهِمْ قُلْتُ مَنْ لَمْ يَعْرِفْ فَهُوَ كَافِرٌ ", "قَالَ سُبْحَانَ اللَّهِ هَذَا قَوْلُ الْخَوَارِجِ ", "ثُمَّ قَالَ إِنْ شِئْتُمْ أَخْبَرْتُكُمْ فَقُلْتُ أَنَا لَا فَقَالَ أَمَا إِنَّهُ شَرٌّ عَلَيْكُمْ أَنْ تَقُولُوا بِشَيْ‏ءٍ مَا لَمْ تَسْمَعُوهُ مِنَّا قَالَ فَظَنَنْتُ أَنَّهُ يُدِيرُنَا عَلَى قَوْلِ مُحَمَّدِ بْنِ مُسْلِمٍ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajjaj, from Hashim Sahib al Bareyd who said, ", "‘I and Muhammad Bin Muslim and Abu Al-Khattab had gathered. So Abu Al-Khattab said to us, ‘What are you saying regarding the one who does not recognise this matter (Al-Wilayah)?’ So I said, ‘The one who does not recognise this matter (Al-Wilayah), so he is a <span class=\"iTxt\">Kafir</span> (Unbeliever)’. So Abu Al-Khattab said, ‘But he is not a <span class=\"iTxt\">Kafir</span> (Unbeliever) until the proof is established upon him. So when the proof is established upon him and (then) he does not recognise, so he is a <span class=\"iTxt\">Kafir</span> (Unbeliever)’. So Muhammad Bin Muslim said to him, ‘Glory be to Allah<sup>azwj</sup>! What is for him when he does not recognise and does not reject, he commits <span class=\"iTxt\">Kufr</span> (disbelief)? He is not a <span class=\"iTxt\">Kafir</span> when he does not reject?’ ", "He (the narrator) said, ‘So when I performed Hajj, I went over to Abu Abdullah<sup>asws</sup> and informed him<sup>asws</sup> with that. So he<sup>asws</sup> said: ‘You<sup>asws</sup> have attended and those two are absent. But, I<sup>asws</sup> give you an appointment of the night of the Middle Rock (for stoning during Hajj) in Mina’. So when it was the (appointed) night, I gathered in his<sup>asws</sup> presence, and Muhammad Abu Al-Khattab and Muhammad Bin Muslim. ", "So he<sup>asws</sup> grabbed a pillow and placed it upon his<sup>asws</sup> chest, then said to us: ‘What are you saying regarding your servants and your womenfolk, and your family members. Are they not testifying that there is no god except for Allah<sup>azwj</sup>?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘So are they recognising what you are upon (Al-Wilayah)?’ He<sup>asws</sup> said: ‘Are they not testifying that Muhammad<sup>saww</sup> is Rasool-Allah<sup>saww</sup>?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘Are they not praying <span class=\"iTxt\">Salāt</span>, and are Fasting, and are performing Hajj?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘So are they recognising what you are upon (Al-Wilayah)?’ I said, ‘No’. He<sup>asws</sup> said: ‘So what are they in your presence?’ I said, ‘The one who does not recognise this matter (Al-Wilayah), so he is a <span class=\"iTxt\">Kafir</span> (Unbeliever)’. ", "He<sup>asws</sup> said: ‘Glory be to Allah<sup>azwj</sup>! Do you not see the people of the roads and the people of its waters?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘Are they not praying <span class=\"iTxt\">Salāt</span>, and they are Fasting, and they are performing Hajj? Are they not testifying that there is no god except for Allah<sup>azwj</sup> and that Muhammad<sup>saww</sup> is Rasool-Allah<sup>saww</sup>?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘So are they recognising what you are upon (Al-Wilayah)?’ I said, ‘No’. He<sup>asws</sup> said: ‘So what are they in your presence?’ I said, ‘The one who does not recognise this matter (Al-Wilayah), so he is a <span class=\"iTxt\">Kafir</span> (Unbeliever)’. ", "He<sup>asws</sup> said: ‘Glory be to Allah<sup>azwj</sup>! Do you not see the Kabah and the <span class=\"iTxt\">Tawaaf</span>, and the people of Al-Yemen hanging on to the curtains of the Kabah?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘Are they not testifying that there is no god except for Allah<sup>azwj</sup> and that Muhammad<sup>saww</sup> is Rasool-Allah<sup>saww</sup>, and they are praying <span class=\"iTxt\">Salāt</span>, and they are Fasting, and they are performing Hajj?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘So are they recognising what you are upon (Al-Wilayah)?’ I said, ‘No’. He<sup>asws</sup> said:’ So what are you saying regarding them?’ I said, ‘The one who does not recognise (Al-Wilayah) so he is a <span class=\"iTxt\">Kafir</span> (Unbeliever)’. ", "He<sup>asws</sup> said: ‘Glory be to Allah<sup>azwj</sup>! These are the words of the Kharijites’. ", "Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘If you like, I<sup style=\"font-weight: normal\">asws</sup> shall inform you all’. So I said, ‘(As for) I, no’. So he<sup style=\"font-weight: normal\">asws</sup> said: ‘It is an evil upon you if you are saying with something what you have not heard from us<sup style=\"font-weight: normal\">asws</sup>’. He (the narrator) said, ‘So I guessed that he<sup style=\"font-weight: normal\">asws</sup> turned us upon the words of Muhammad Bin Muslim’."]}}, {"index": 2880, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:1:171:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ رَجُلٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قُلْتُ لَهُ فَمَا تَقُولُ فِي مُنَاكَحَةِ النَّاسِ فَإِنِّي قَدْ بَلَغْتُ مَا تَرَاهُ وَ مَا تَزَوَّجْتُ قَطُّ فَقَالَ وَ مَا يَمْنَعُكَ مِنْ ذَلِكَ فَقُلْتُ مَا يَمْنَعُنِي إِلَّا أَنَّنِي أَخْشَى أَنْ لَا تَحِلَّ لِي مُنَاكَحَتُهُمْ فَمَا تَأْمُرُنِي ", "فَقَالَ فَكَيْفَ تَصْنَعُ وَ أَنْتَ شَابٌّ أَ تَصْبِرُ قُلْتُ أَتَّخِذُ الْجَوَارِيَ قَالَ فَهَاتِ الْآنَ فَبِمَا تَسْتَحِلُّ الْجَوَارِيَ قُلْتُ إِنَّ الْأَمَةَ لَيْسَتْ بِمَنْزِلَةِ الْحُرَّةِ إِنْ رَابَتْنِي بِشَيْ‏ءٍ بِعْتُهَا وَ اعْتَزَلْتُهَا قَالَ فَحَدِّثْنِي بِمَا اسْتَحْلَلْتَهَا قَالَ فَلَمْ يَكُنْ عِنْدِي جَوَابٌ ", "فَقُلْتُ لَهُ فَمَا تَرَى أَتَزَوَّجُ فَقَالَ مَا أُبَالِي أَنْ تَفْعَلَ قُلْتُ أَ رَأَيْتَ قَوْلَكَ مَا أُبَالِي أَنْ تَفْعَلَ فَإِنَّ ذَلِكَ عَلَى جِهَتَيْنِ تَقُولُ لَسْتُ أُبَالِي أَنْ تَأْثَمَ مِنْ غَيْرِ أَنْ آمُرَكَ فَمَا تَأْمُرُنِي أَفْعَلُ ذَلِكَ بِأَمْرِكَ", "فَقَالَ لِي قَدْ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) تَزَوَّجَ وَ قَدْ كَانَ مِنْ أَمْرِ امْرَأَةِ نُوحٍ وَ امْرَأَةِ لُوطٍ مَا قَدْ كَانَ إِنَّهُمَا قَدْ كَانَتَا تَحْتَ عَبْدَيْنِ مِنْ عِبَادِنَا صَالِحَيْنِ فَقُلْتُ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) لَيْسَ فِي ذَلِكَ بِمَنْزِلَتِي إِنَّمَا هِيَ تَحْتَ يَدِهِ وَ هِيَ مُقِرَّةٌ بِحُكْمِهِ مُقِرَّةٌ بِدِينِهِ", "قَالَ فَقَالَ لِي مَا تَرَى مِنَ الْخِيَانَةِ فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَخانَتاهُما مَا يَعْنِي بِذَلِكَ إِلَّا الْفَاحِشَةَ وَ قَدْ زَوَّجَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فُلَاناً", "قَالَ قُلْتُ أَصْلَحَكَ اللَّهُ مَا تَأْمُرُنِي أَنْطَلِقُ فَأَتَزَوَّجُ بِأَمْرِكَ فَقَالَ لِي إِنْ كُنْتَ فَاعِلًا فَعَلَيْكَ بِالْبَلْهَاءِ مِنَ النِّسَاءِ قُلْتُ وَ مَا الْبَلْهَاءُ قَالَ ذَوَاتُ الْخُدُورِ الْعَفَائِفُ فَقُلْتُ مَنْ هِيَ عَلَى دِينِ سَالِمِ بْنِ أَبِي حَفْصَةَ قَالَ لَا فَقُلْتُ مَنْ هِيَ عَلَى دِينِ رَبِيعَةِ الرَّأْيِ فَقَالَ لَا وَ لَكِنَّ الْعَوَاتِقَ اللَّوَاتِي لَا يَنْصِبْنَ كُفْراً وَ لَا يَعْرِفْنَ مَا تَعْرِفُونَ ", "قُلْتُ وَ هَلْ تَعْدُو أَنْ تَكُونَ مُؤْمِنَةً أَوْ كَافِرَةً فَقَالَ تَصُومُ وَ تُصَلِّي وَ تَتَّقِي اللَّهَ وَ لَا تَدْرِي مَا أَمْرُكُمْ فَقُلْتُ قَدْ قَالَ اللَّهُ عَزَّ وَ جَلَّ هُوَ الَّذِي خَلَقَكُمْ فَمِنْكُمْ كافِرٌ وَ مِنْكُمْ مُؤْمِنٌ لَا وَ اللَّهِ لَا يَكُونُ أَحَدٌ مِنَ النَّاسِ لَيْسَ بِمُؤْمِنٍ وَ لَا كَافِرٍ", "قَالَ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) قَوْلُ اللَّهِ أَصْدَقُ مِنْ قَوْلِكَ يَا زُرَارَةُ أَ رَأَيْتَ قَوْلَ اللَّهِ عَزَّ وَ جَلَّ خَلَطُوا عَمَلًا صالِحاً وَ آخَرَ سَيِّئاً عَسَى اللَّهُ أَنْ يَتُوبَ عَلَيْهِمْ فَلَمَّا قَالَ عَسَى فَقُلْتُ مَا هُمْ إِلَّا مُؤْمِنِينَ أَوْ كَافِرِينَ", "قَالَ فَقَالَ مَا تَقُولُ فِي قَوْلِهِ عَزَّ وَ جَلَّ إِلَّا الْمُسْتَضْعَفِينَ مِنَ الرِّجالِ وَ النِّساءِ وَ الْوِلْدانِ لا يَسْتَطِيعُونَ حِيلَةً وَ لا يَهْتَدُونَ سَبِيلًا إِلَى الْإِيمَانِ فَقُلْتُ مَا هُمْ إِلَّا مُؤْمِنِينَ أَوْ كَافِرِينَ فَقَالَ وَ اللَّهِ مَا هُمْ بِمُؤْمِنِينَ وَ لَا كَافِرِينَ", "ثُمَّ أَقْبَلَ عَلَيَّ فَقَالَ مَا تَقُولُ فِي أَصْحَابِ الْأَعْرَافِ فَقُلْتُ مَا هُمْ إِلَّا مُؤْمِنِينَ أَوْ كَافِرِينَ إِنْ دَخَلُوا الْجَنَّةَ فَهُمْ مُؤْمِنُونَ وَ إِنْ دَخَلُوا النَّارَ فَهُمْ كَافِرُونَ ", "فَقَالَ وَ اللَّهِ مَا هُمْ بِمُؤْمِنِينَ وَ لَا كَافِرِينَ وَ لَوْ كَانُوا مُؤْمِنِينَ لَدَخَلُوا الْجَنَّةَ كَمَا دَخَلَهَا الْمُؤْمِنُونَ وَ لَوْ كَانُوا كَافِرِينَ لَدَخَلُوا النَّارَ كَمَا دَخَلَهَا الْكَافِرُونَ وَ لَكِنَّهُمْ قَوْمٌ قَدِ اسْتَوَتْ حَسَنَاتُهُمْ وَ سَيِّئَاتُهُمْ فَقَصُرَتْ بِهِمُ الْأَعْمَالُ وَ أَنَّهُمْ لَكَمَا قَالَ اللَّهُ عَزَّ وَ جَلَّ ", "فَقُلْتُ أَ مِنْ أَهْلِ الْجَنَّةِ هُمْ أَمْ مِنْ أَهْلِ النَّارِ فَقَالَ اتْرُكْهُمْ حَيْثُ تَرَكَهُمُ اللَّهُ قُلْتُ أَ فَتُرْجِئُهُمْ قَالَ نَعَمْ أُرْجِئُهُمْ كَمَا أَرْجَأَهُمُ اللَّهُ إِنْ شَاءَ أَدْخَلَهُمُ الْجَنَّةَ بِرَحْمَتِهِ وَ إِنْ شَاءَ سَاقَهُمْ إِلَى النَّارِ بِذُنُوبِهِمْ وَ لَمْ يَظْلِمْهُمْ", "فَقُلْتُ هَلْ يَدْخُلُ الْجَنَّةَ كَافِرٌ قَالَ لَا قُلْتُ فَهَلْ يَدْخُلُ النَّارَ إِلَّا كَافِرٌ قَالَ فَقَالَ لَا إِلَّا أَنْ يَشَاءَ اللَّهُ يَا زُرَارَةُ إِنَّنِي أَقُولُ مَا شَاءَ اللَّهُ وَ أَنْتَ لَا تَقُولُ مَا شَاءَ اللَّهُ أَمَا إِنَّكَ إِنْ كَبِرْتَ رَجَعْتَ وَ تحَلَّلَتْ عَنْكَ عُقَدُكَ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from a man, from Zurara, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘So what are you<sup>asws</sup> saying regarding marrying the people (General Muslims), for I have reached (adulthood) what you<sup>asws</sup> see and I have not married at all’. So he<sup>asws</sup> said: ‘So what prevents you from that’. I said, ‘Nothing prevents me except that I am fearing that it would not be Permissible for me to marry them. So what are you<sup>asws</sup> ordering me for?’ ", "So he<sup>asws</sup> said: ‘So what do you do and you are a youth. Are you observing patience?’ I said, ‘I take the slave girls’. He<sup>asws</sup> said: ‘So here, now. So by what are you considering the slave girls to be Permissible?’ I said, ‘The slave girl is not at the status of the free woman. If something makes me suspicious, so I sell her and isolate from her’. He (the narrator) said, ‘So he<sup>asws</sup> narrated me with what makes her to be Permissible, and there did not happen to be an answer with me’. ", "So I said to him<sup>asws</sup>, ‘So what is your<sup>asws</sup> view. Shall I get married?’ So he<sup>asws</sup> said: ‘It does not matter to me<sup>asws</sup> if you were to do so’. I said, ‘What is your<sup>asws</sup> view of your<sup>asws</sup> own words, ‘It does not matter to me if you were to do so’, for that is upon two aspects. You<sup>asws</sup> are saying: ‘It does not matter to me<sup>asws</sup> if you were to sin from other than my<sup>asws</sup> having ordered you. So what are you<sup>asws</sup> ordering me with. Shall I do that with your<sup>asws</sup> order?’ ", "So he<sup>asws</sup> said to me: ‘It was so that Rasool-Allah<sup>saww</sup> had married, and it was so from the matter of <span class=\"ibTxt\">[66:10] the wife of Nuh and the wife of Lut: they were both under two of Our righteous servants</span>’. So I said, ‘Rasool-Allah<sup>saww</sup> is not in that at my status. But rather, she was under his<sup>saww</sup> hand and she was acknowledging with his<sup>saww</sup> rulings, acknowledging with his<sup>saww</sup> Religion’. ", "He (the narrator) said, ‘So he<sup>asws</sup> said to me: ‘What is your view of the betrayal in the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[66:10] but they acted treacherously towards them</span>. What is the Meaning with that except for the immorality? And Rasool-Allah<sup>saww</sup> had married the so and so’. ", "He (the narrator) said, ‘I said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! What are you ordering me? Shall I go and get married by your<sup>asws</sup> order?’ So he<sup>asws</sup> said to me: ‘If you were to do so, so upon you is (getting married) with the simple ones from the women’. I said, ‘And what are the ‘simple ones’? He<sup>asws</sup> said: ‘The ones with the veils, the chaste’. So I said, ‘The one who is upon the Religion of Saalim Bin Abu Hafsa?’ He<sup>asws</sup> said: ‘No’. So I said, ‘The one who is upon the Religion of Rabi’a Al-Rai’y?’ So he<sup>asws</sup> said: ‘No, but the adolescent girls who are not establishing <span class=\"iTxt\">Kufr</span> (disbelief) nor are they recognising what you are recognising (Al Wilayah).", "I said, ‘And would she be anything more than either a <span class=\"iTxt\">Momina</span> (believing woman) or a <span class=\"iTxt\">Kafira</span> (disbelieving woman)?’ So he<sup>asws</sup> said: ‘She would be Fasting and praying <span class=\"iTxt\">Salāt</span>, and she would be fearing Allah<sup>azwj</sup>, and she would not be knowing what your matter (<span class=\"iTxt\">Al Wilayah</span>) is’. So I said, ‘Allah<sup>azwj</sup> Mighty and Majestic has Said <span class=\"ibTxt\">[64:2] He is the one Who Created you, so among you is an unbeliever and among you is a Believer</span>. No, by Allah<sup>azwj</sup>! There does not happen to be anyone from the people who is neither a <span class=\"iTxt\">Momin</span> (Believer) nor a <span class=\"iTxt\">Kafir</span> (Unbeliever)’.", "He (the narrator) said, ‘So Abu Ja’far<sup>asws</sup> said: ‘The Words of Allah<sup>azwj</sup> Truer than your words, O Zurara! What is your view of the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[9:102] they have mingled a good deed and an evil one; maybe Allah will Turn to them (Mercifully); surely Allah is Forgiving, Merciful</span>. So what did He<sup>azwj</sup> Say: “Maybe”?’ So I said, ‘They are not, except for <span class=\"iTxt\">Momineen</span> (Believers) or <span class=\"iTxt\">Kafireen</span> (unbelievers)’.", "He (the narrator) said, ‘So he<sup>asws</sup> said: ‘What are you saying regarding the Words of the Mighty and Majestic <span class=\"ibTxt\">[4:98] Except the weak from among the men and the children who have not in their power the means nor can they find a way</span> to the <span class=\"iTxt\">Emān</span>?’ So I said, ‘They are not except for <span class=\"iTxt\">Momineen</span> (Believers) or <span class=\"iTxt\">Kafireen</span> (unbelievers)’. So he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! They are neither <span class=\"iTxt\">Momineen</span> (Believers) nor <span class=\"iTxt\">Kafireen</span> (unbelievers)’.", "Then he<sup>asws</sup> turned towards me and he<sup>asws</sup> said: ‘What are you saying regarding <span class=\"ibTxt\">[7:48] the the people of Al-Araf</span>?’ So I said, ‘They are either <span class=\"iTxt\">Momineen</span> (Believers) or <span class=\"iTxt\">Kafireen</span> (unbelievers). If they were to enter into the Paradise so they are <span class=\"iTxt\">Momineen</span>, and if they enter into the Fire, so they are <span class=\"iTxt\">Kafireen</span> (Unbelievers)’. ", "So he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! They are ‘They are neither <span class=\"iTxt\">Momineen</span> (Believers) nor <span class=\"iTxt\">Kafireen</span> (unbelievers); and had they been <span class=\"iTxt\">Momineen</span>, they would have entered into the Paradise just as the <span class=\"iTxt\">Momineen</span> would enter it, and had they been <span class=\"iTxt\">Kafireen</span>, they would have entered the Fire just as the <span class=\"iTxt\">Kafireen</span> would enter. But, they are a people whose good deeds and their evil deeds are equal, so the deeds are deficient with them and they are just as Allah<sup>azwj</sup> Mighty and Majestic has Said.", "So I said, ‘Are they from the inhabitants of the Paradise or from the inhabitants of the Fire?’ So he<sup>asws</sup> said: ‘You should leave them where Allah<sup>azwj</sup> has Left them to be’. I said, ‘Shall I postpone them?’ He<sup>asws</sup> said: ‘Yes, postpone them just as Allah<sup>azwj</sup> has Postponed them. If He<sup>azwj</sup> so Desires to, He<sup>azwj</sup> will Enter them into the Paradise by His<sup>azwj</sup> Mercy, and if He<sup>azwj</sup> so Desires to, He<sup>azwj</sup> would Usher them to the Fire due to their sins, and He<sup>azwj</sup> would be Unjust to them’.", "So I said, ‘Would a <span class=\"iTxt\">Kafir</span> (Unbeliever) enter the Paradise?’ He<sup>asws</sup> said: ‘No’. I said, ‘So would anyone enter the Fire except for a <span class=\"iTxt\">Kafir</span>?’ So he<sup>asws</sup> said: ‘No, except if Allah<sup>azwj</sup> so Desires to. O Zurara! I<sup>asws</sup> am saying: ‘Whatever Allah<sup>azwj</sup> so Desires’, and you are not saying, ‘Whatever Allah<sup>azwj</sup> so Desires’. But, you, when you get older, would return (from your view), and your knots would be loosened from you’."]}}]}, "index": "al-kafi:2:1:171", "kind": "verse_list"}