{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:2:1", "titles": {"ar": "كتاب الإيمان و الكفر", "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"}}, {"indexed_titles": {"en": "Chapter 172"}, "path": "/books/al-kafi:2:1:172", "titles": {"ar": "بَابُ الْمُسْتَضْعَفِ", "en": "Chapter 172 – The Weak Ones (of understanding)"}}], "index": 360, "local_index": 172, "part_type": "Chapter", "path": "/books/al-kafi:2:1:172", "titles": {"ar": "بَابُ الْمُسْتَضْعَفِ", "en": "Chapter 172 – The Weak Ones (of understanding)"}, "verse_count": 12, "verse_start_index": 2880, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 2881, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:1:172:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ زُرَارَةَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الْمُسْتَضْعَفِ فَقَالَ هُوَ الَّذِي لَا يَهْتَدِي حِيلَةً إِلَى الْكُفْرِ فَيَكْفُرَ وَ لَا يَهْتَدِي سَبِيلًا إِلَى الْإِيمَانِ لَا يَسْتَطِيعُ أَنْ يُؤْمِنَ وَ لَا يَسْتَطِيعُ أَنْ يَكْفُرَ فَهُمُ الصِّبْيَانُ وَ مَنْ كَانَ مِنَ الرِّجَالِ وَ النِّسَاءِ عَلَى مِثْلِ عُقُولِ الصِّبْيَانِ مَرْفُوعٌ عَنْهُمُ الْقَلَمُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from one of his companions, from Zurara who said, ", "‘I asked Abu Ja’far<sup>asws</sup> about the weak ones (of understanding). So he<sup>asws</sup> said: ‘He is the one who is neither guided by a reason to the <span class=\"iTxt\">Kufr</span> (disbelief) so he would disbelieve, nor is he guided by a way to the <span class=\"iTxt\">Emān</span>. He neither has the capacity that he believes, nor does he have the capacity that he disbelieves. So they are children. And the ones from the men and the women who were upon a similar intellect of the children, the Pen (Recording of the deeds) would be Raised from them’."]}}, {"index": 2882, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:1:172:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ الْمُسْتَضْعَفُونَ الَّذِينَ لا يَسْتَطِيعُونَ حِيلَةً وَ لا يَهْتَدُونَ سَبِيلًا قَالَ لَا يَسْتَطِيعُونَ حِيلَةً إِلَى الْإِيمَانِ وَ لَا يَكْفُرُونَ الصِّبْيَانُ وَ أَشْبَاهُ عُقُولِ الصِّبْيَانِ مِنَ الرِّجَالِ وَ النِّسَاءِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel, from Zurara, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The weak ones (of understanding) are those who do not have the capacity to reason, nor are they guided to a way. They are not able upon a reason to the <span class=\"iTxt\">Emān</span>, nor are they disbelieving (like) the children, and those of similar intellect to the children, from the men and the women’."]}}, {"index": 2883, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:2:1:172:3", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ زُرَارَةَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الْمُسْتَضْعَفِ فَقَالَ هُوَ الَّذِي لَا يَسْتَطِيعُ حِيلَةً يَدْفَعُ بِهَا عَنْهُ الْكُفْرَ وَ لَا يَهْتَدِي بِهَا إِلَى سَبِيلِ الْإِيمَانِ لَا يَسْتَطِيعُ أَنْ يُؤْمِنَ وَ لَا يَكْفُرَ قَالَ وَ الصِّبْيَانُ وَ مَنْ كَانَ مِنَ الرِّجَالِ وَ النِّسَاءِ عَلَى مِثْلِ عُقُولِ الصِّبْيَانِ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Ibn Mahboub, from Ibn Ra’ib, from Zurara who said, ", "‘I asked Abu Ja’far<sup>asws</sup> about the weak one (of understanding). So he<sup>asws</sup> said: ‘He is one who has no capacity of reason to repel the <span class=\"iTxt\">Kufr</span> (disbelief) by it, nor is he guided by it to the way of <span class=\"iTxt\">Emān</span>. He has not capacity that he believes nor that he disbelieves’. He<sup>asws</sup> said: ‘And the childfren, and the ones from the men and the women who was upon a similar intellect of the children’."]}}, {"index": 2884, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:2:1:172:4", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَبْدِ اللَّهِ بْنِ جُنْدَبٍ عَنْ سُفْيَانَ بْنِ السِّمْطِ الْبَجَلِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا تَقُولُ فِي الْمُسْتَضْعَفِينَ فَقَالَ لِي شَبِيهاً بِالْفَزِعِ فَتَرَكْتُمْ أَحَداً يَكُونُ مُسْتَضْعَفاً وَ أَيْنَ الْمُسْتَضْعَفُونَ فَوَ اللَّهِ لَقَدْ مَشَى بِأَمْرِكُمْ هَذَا الْعَوَاتِقُ إِلَى الْعَوَاتِقِ فِي خُدُورِهِنَّ وَ تُحَدِّثُ بِهِ السَّقَّايَاتُ فِي طَرِيقِ الْمَدِينَةِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Abdullah Bin Jundab, from Sufyan Bin Al Simt Al Bajaly who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘What are you<sup>asws</sup> saying regarding the weak ones (of understanding)?’ So he<sup>asws</sup> said resembling the panic: ‘So have you all left anyone who can be weak? And where are the weak ones? By Allah<sup>azwj</sup>! The adolescent girls have walked with this matter of yours to the adolescent girls in their veils, and the water-carriers of Al-Medina are discussing with it in the streets’."]}}, {"index": 2885, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:2:1:172:5", "text": ["عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ عُمَرَ بْنِ أَبَانٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْمُسْتَضْعَفِينَ فَقَالَ هُمْ أَهْلُ الْوَلَايَةِ فَقُلْتُ أَيُّ وَلَايَةٍ فَقَالَ أَمَا إِنَّهَا لَيْسَتْ بِالْوَلَايَةِ فِي الدِّينِ وَ لَكِنَّهَا الْوَلَايَةُ فِي الْمُنَاكَحَةِ وَ الْمُوَارَثَةِ وَ الْمُخَالَطَةِ وَ هُمْ لَيْسُوا بِالْمُؤْمِنِينَ وَ لَا بِالْكُفَّارِ وَ مِنْهُمُ الْمُرْجَوْنَ لِأَمْرِ اللَّهِ عَزَّ وَ جَلَّ ."], "translations": {"en.hubeali": ["From him, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Umar Bin Aban who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about the weak ones (of understanding). So he<sup>asws</sup> said: ‘They are the people of Al-Wilayah’. So I said, ‘Which Wilayah?’ So he<sup>asws</sup> said: ‘But these are not with a Wilayah in the Religion, but it is the Wilayah (Guardianship) regarding the marriages, and the inheritances, and the inter-mingling, and they are neither with the <span class=\"iTxt\">Momineen</span> nor with the Kuffar (Unbelievers), and among them are the ones hopeful for the Command (Mercy) of Allah<sup>azwj</sup> Mighty and Majestic’."]}}, {"index": 2886, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:2:1:172:6", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ مُثَنًّى عَنْ إِسْمَاعِيلَ الْجُعْفِيِّ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الدِّينِ الَّذِي لَا يَسَعُ الْعِبَادَ جَهْلُهُ فَقَالَ الدِّينُ وَاسِعٌ وَ لَكِنَّ الْخَوَارِجَ ضَيَّقُوا عَلَى أَنْفُسِهِمْ مِنْ جَهْلِهِمْ قُلْتُ جُعِلْتُ فِدَاكَ فَأُحَدِّثُكَ بِدِينِيَ الَّذِي أَنَا عَلَيْهِ فَقَالَ بَلَى فَقُلْتُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ وَ الْإِقْرَارَ بِمَا جَاءَ مِنْ عِنْدِ اللَّهِ وَ أَتَوَلَّاكُمْ وَ أَبْرَأُ مِنْ عَدُوِّكُمْ وَ مَنْ رَكِبَ رِقَابَكُمْ وَ تَأَمَّرَ عَلَيْكُمْ وَ ظَلَمَكُمْ حَقَّكُمْ ", "فَقَالَ مَا جَهِلْتَ شَيْئاً هُوَ وَ اللَّهِ الَّذِي نَحْنُ عَلَيْهِ قُلْتُ فَهَلْ سَلِمَ أَحَدٌ لَا يَعْرِفُ هَذَا الْأَمْرَ فَقَالَ لَا إِلَّا الْمُسْتَضْعَفِينَ قُلْتُ مَنْ هُمْ قَالَ نِسَاؤُكُمْ وَ أَوْلَادُكُمْ ", "ثُمَّ قَالَ أَ رَأَيْتَ أُمَّ أَيْمَنَ فَإِنِّي أَشْهَدُ أَنَّهَا مِنْ أَهْلِ الْجَنَّةِ وَ مَا كَانَتْ تَعْرِفُ مَا أَنْتُمْ عَلَيْهِ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washha, from Musna, from Ismail Al Ju’fy who said, ", "‘I asked Abu Ja’far<sup>asws</sup> about the Religion which there is no leeway for the servants to be ignorant of it. So he<sup>asws</sup> said: ‘The Religion is vast but the Kharijites narrowed it upon themselves due to their ignorance’. I said, ‘May I be sacrificed for you<sup>asws</sup>! Can I narrate to you<sup>asws</sup> with my Religion which I am upon?’ So he<sup>asws</sup> said: ‘Yes’. So I said, ‘I testify that there is no god except for Allah<sup>azwj</sup>, and I testify that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Rasool<sup>saww</sup>, and I acknowledge with whatever he<sup>saww</sup> came with from the Presence of Allah<sup>azwj</sup>, and I befriend you<sup>asws</sup> and disavow from your<sup>asws</sup> enemies and the ones who stay away from you<sup>asws</sup> rights and are ordering upon you<sup>asws</sup> and are oppressing you<sup>asws</sup> of your<sup>asws</sup> rights’. ", "So he<sup style=\"font-weight: normal\">asws</sup> said: ‘You are not ignorant of anything. It is, by Allah<sup style=\"font-weight: normal\">azwj</sup>, that which we<sup style=\"font-weight: normal\">asws</sup> are upon’. I said, ‘So would anyone be safe if he does not recognise this matter (Al-Wilayah)?’ So he<sup style=\"font-weight: normal\">asws</sup> said: ‘No, except for the weak ones (of understanding’. I said, ‘Who are they?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘Your womenfolk and your children’. ", "Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘What is your<sup style=\"font-weight: normal\">asws</sup> view of Umm Ayman<sup style=\"font-weight: normal\">ra</sup>, for I<sup style=\"font-weight: normal\">asws</sup> testify that she<sup style=\"font-weight: normal\">ra</sup> is from the inhabitants of the Paradise, and she<sup style=\"font-weight: normal\">ra</sup> did not recognise what you are upon’."]}}, {"index": 2887, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:2:1:172:7", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَنْ عَرَفَ اخْتِلَافَ النَّاسِ فَلَيْسَ بِمُسْتَضْعَفٍ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Ibn Muskan, from Abu Baseer who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘The one who recognises the differing of the people, so he is not a weak one (of understanding)’."]}}, {"index": 2888, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:2:1:172:8", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي رُبَّمَا ذَكَرْتُ هَؤُلَاءِ الْمُسْتَضْعَفِينَ فَأَقُولُ نَحْنُ وَ هُمْ فِي مَنَازِلِ الْجَنَّةِ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَا يَفْعَلُ اللَّهُ ذَلِكَ بِكُمْ أَبَداً ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from Jameel Bin Darraj who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘Sometimes I remember these weak ones (of understanding), so I am saying that us and them would be in (the same) dwellings in the Paradise’. So Abu Abdullah<sup>asws</sup> said: ‘Allah<sup>azwj</sup> would not do that with you all, ever!’"]}}, {"index": 2889, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:2:1:172:9", "text": ["عَنْهُ عَنْ عَلِيِّ بْنِ الْحَسَنِ التَّيْمِيِّ عَنْ أَخَوَيْهِ مُحَمَّدٍ وَ أَحْمَدَ ابْنَيِ الْحَسَنِ عَنْ عَلِيِّ بْنِ يَعْقُوبَ عَنْ مَرْوَانَ بْنِ مُسْلِمٍ عَنْ أَيُّوبَ بْنِ الْحُرِّ قَالَ قَالَ رَجُلٌ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ نَحْنُ عِنْدَهُ جُعِلْتُ فِدَاكَ إِنَّا نَخَافُ أَنْ نَنْزِلَ بِذُنُوبِنَا مَنَازِلَ الْمُسْتَضْعَفِينَ قَالَ فَقَالَ لَا وَ اللَّهِ لَا يَفْعَلُ اللَّهُ ذَلِكَ بِكُمْ أَبَداً .", "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مِثْلَهُ ."], "translations": {"en.hubeali": ["From him, from Ali Bin Al Hassan Al Taymi, from his two brothers Muhammad and Ahmad the two sons of Al Hassan Bin Ali Bin Yaqoub, from Marwan Bin Muslim, from Ayoub Bin Al Hurr who said, ", "‘A man said to Abu Abdullah<sup>asws</sup> and we were in his<sup>asws</sup> presence, ‘May I be sacrificed for you<sup>asws</sup>! we fear that due to our sins we would be lodged in the dwellings of the weak ones (of understanding)’. So he<sup>asws</sup> said: ‘No, by Allah! Allah<sup>azwj</sup> would not do that with you all, ever!’ ", "<span style=\"font-size: small\">Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from a man,</span> from Abu Abdullah<sup>asws</sup> – similar to it."]}}, {"index": 2890, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:2:1:172:10", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي الْمَغْرَاءِ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ عَرَفَ اخْتِلَافَ النَّاسِ فَلَيْسَ بِمُسْتَضْعَفٍ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abu Al Magra’a, from Abu Baseer, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who recognises the differing of the people, so he is not a weak one (of understanding)’."]}}, {"index": 2891, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:2:1:172:11", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ مَنْصُورٍ الْخُزَاعِيِّ عَنْ عَلِيِّ بْنِ سُوَيْدٍ عَنْ أَبِي الْحَسَنِ مُوسَى ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الضُّعَفَاءِ فَكَتَبَ إِلَيَّ الضَّعِيفُ مَنْ لَمْ تُرْفَعْ إِلَيْهِ حُجَّةٌ وَ لَمْ يَعْرِفِ الِاخْتِلَافَ فَإِذَا عَرَفَ الِاخْتِلَافَ فَلَيْسَ بِمُسْتَضْعَفٍ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Ismail Bin Mihran, from Muhammad Bin Mansour Al Khuzai’e, from Ali Bin Suweyd, ", "(It has been narrated) from Abu Al-Hassan Musa<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the weak ones (of understanding). So he<sup>asws</sup> wrote to me: ‘The weak one (of understanding) is the one to whom the proof has not been raised, and he does not recognise the differing. So when he does recognise the differing, so he would not be a weak one (of understanding)’."]}}, {"index": 2892, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:2:1:172:12", "text": ["بَعْضُ أَصْحَابِنَا عَنْ عَلِيِّ بْنِ الْحَسَنِ عَنْ عَلِيِّ بْنِ حَبِيبٍ الْخَثْعَمِيِّ عَنْ أَبِي سَارَةَ إِمَامِ مَسْجِدِ بَنِي هِلَالٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَيْسَ الْيَوْمَ مُسْتَضْعَفٌ أَبْلَغَ الرِّجَالُ الرِّجَالَ وَ النِّسَاءُ النِّسَاءَ ."], "translations": {"en.hubeali": ["One of our companions, from Ali Bin Al Hassan, from Ali Bin Habeeb Al Khash’amy, from Abu Sara, the prayer leader of the Masjid of the Clan of Hilal, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Today there is no one weak (of understanding). The men have delivered (the Message) to the men, and the women to the women’."]}}]}, "index": "al-kafi:2:1:172", "kind": "verse_list"}