{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 173"
        },
        "path": "/books/al-kafi:2:1:173",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الْمُرْجَوْنَ</span> لِأَمْرِ اللَّهِ",
          "en": "Chapter 173 – The ones hopeful for the Command of Allah<sup>azwj</sup>"
        }
      }
    ],
    "index": 361,
    "local_index": 173,
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:173",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الْمُرْجَوْنَ</span> لِأَمْرِ اللَّهِ",
      "en": "Chapter 173 – The ones hopeful for the Command of Allah<sup>azwj</sup>"
    },
    "verse_count": 2,
    "verse_start_index": 2892,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف كالموثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/214)"
        ],
        "index": 2893,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:173:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُوسَى بْنِ بَكْرٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ آخَرُونَ مُرْجَوْنَ لِأَمْرِ اللَّهِ قَالَ قَوْمٌ كَانُوا مُشْرِكِينَ فَقَتَلُوا مِثْلَ حَمْزَةَ وَ جَعْفَرٍ وَ أَشْبَاهَهُمَا مِنَ الْمُؤْمِنِينَ ثُمَّ إِنَّهُمْ دَخَلُوا فِي الْإِسْلَامِ فَوَحَّدُوا اللَّهَ وَ تَرَكُوا الشِّرْكَ وَ لَمْ يَعْرِفُوا الْإِيمَانَ بِقُلُوبِهِمْ فَيَكُونُوا مِنَ الْمُؤْمِنِينَ فَتَجِبَ لَهُمُ الْجَنَّةُ ",
          "وَ لَمْ يَكُونُوا عَلَى جُحُودِهِمْ فَيَكْفُرُوا فَتَجِبَ لَهُمُ النَّارُ فَهُمْ عَلَى تِلْكَ الْحَالِ إِمَّا يُعَذِّبُهُمْ وَ إِمَّا يَتُوبُ عَلَيْهِمْ . "
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Musa Bin Bakr, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[9:106] And others are hopeful of Allah's Command</span>. He<sup>asws</sup> said: ‘A group who used to be Polytheists, and they killed the likes of Hamza<sup>as</sup>, and Ja’far<sup>as</sup>, and the likes of these two<sup>as</sup> from the <span class=\"iTxt\">Momineen</span>, then they entered into Al-Islam. So they acknowledged Allah<sup>azwj</sup> and left the <span class=\"iTxt\">Shirk</span> (Polytheism) but did not recognise the <span class=\"iTxt\">Emān</span> by their hearts. So they came closer the <span class=\"iTxt\">Momineen</span> to qualify for the Paradise.",
            "And they were not in denial and a rejecting attitude as unbelievers to be subjected to fire (of hell).  They are in that condition as such that it will be up to Allah to punish or accept their repentance’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Musa ibn Bakr from Zurara from abu Ja’far (a.s.) who has said the following: “About the words of Allah, the Most Majestic, the Most Holy, ‘. . . there are others who have no good deeds for which they may receive any reward or sins for which they may be punished. Their fate will be in the hands of Allah. Allah is All-knowing and All-wise,’ (9:106) the Imam said, ‘Certain people were pagans. They murdered people like Hamza and Ja’far and similar persons from the believers. Then they accepted Islam and Allah only and gave up paganism, but did not know belief with their heart so they could be among the believers to deserve paradise. They were not in denial and a rejecting attitude as unbelievers to be subjected to fire (of hell). They are in that condition as such that it will be up to Allah to punish or accept their repentance.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/215)"
        ],
        "index": 2894,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:173:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ مُوسَى بْنِ بَكْرٍ الْوَاسِطِيِّ عَنْ رَجُلٍ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) الْمُرْجَوْنَ قَوْمٌ كَانُوا مُشْرِكِينَ فَقَتَلُوا مِثْلَ حَمْزَةَ وَ جَعْفَرٍ وَ أَشْبَاهَهُمَا مِنَ الْمُؤْمِنِينَ ثُمَّ إِنَّهُمْ بَعْدَ ذَلِكَ دَخَلُوا فِي الْإِسْلَامِ فَوَحَّدُوا اللَّهَ وَ تَرَكُوا الشِّرْكَ وَ لَمْ يَكُونُوا يُؤْمِنُونَ فَيَكُونُوا مِنَ الْمُؤْمِنِينَ وَ لَمْ يُؤْمِنُوا فَتَجِبَ لَهُمُ الْجَنَّةُ وَ لَمْ يَكْفُرُوا فَتَجِبَ لَهُمُ النَّارُ فَهُمْ عَلَى تِلْكَ الْحَالِ مُرْجَوْنَ لِأَمْرِ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Hassan, from Musa Bin Bakr Al Wasity, from a man who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The hopeful ones used to be the Polytheists, so they killed the likes of Hamza<sup>as</sup> and Ja’far<sup>as</sup> and the likes of these two<sup>as</sup> from the <span class=\"iTxt\">Momineen</span>. Then they, after that, entered into Al-Islam, so they accept Allah<sup>azwj</sup> only.  They gave up paganism, but did not believe’ to be among believing people.  They did not deserve paradise.  They were not in denial and a rejecting attitude to be subjected to Fire (of Hell).  They are in that condition as such that it will be up to Allah<sup>azwj</sup> to either Punish or Accept their repentance."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Hassan from Musa ibn Bakr al-Wasiti from a man who has said the following: “Abu Ja’far (a.s.) has said, ‘Al- Murjawn were a pagan people. They murdered people like Hamza and Ja’far and similar persons from the believers. Then they accepted Islam. They accepted Allah only. They gave up paganism, but did not believe to be among believing people. They did not believe to deserve paradise. They were not in denial and a rejecting attitude to be subjected to fire (of hell). They are in that condition as such that it will be up to Allah to punish or accept their repentance.”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:173",
  "kind": "verse_list"
}