{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:2:1", "titles": {"ar": "كتاب الإيمان و الكفر", "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"}}, {"indexed_titles": {"en": "Chapter 178"}, "path": "/books/al-kafi:2:1:178", "titles": {"ar": "بَابٌ فِي قَوْلِهِ تَعَالَى وَ مِنَ النَّاسِ مَنْ يَعْبُدُ اللَّهَ عَلى حَرْفٍ", "en": "Chapter 178 – Regarding the Words of the Exalted [22:11] And among men is he who worships Allah<sup>azwj</sup> superficially"}}], "index": 366, "local_index": 178, "part_type": "Chapter", "path": "/books/al-kafi:2:1:178", "titles": {"ar": "بَابٌ فِي قَوْلِهِ تَعَالَى وَ مِنَ النَّاسِ مَنْ يَعْبُدُ اللَّهَ عَلى حَرْفٍ", "en": "Chapter 178 – Regarding the Words of the Exalted [22:11] And among men is he who worships Allah<sup>azwj</sup> superficially"}, "verse_count": 2, "verse_start_index": 2908, "verses": [{"index": 2909, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:1:178:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنِ الْفُضَيْلِ وَ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ مِنَ النَّاسِ مَنْ يَعْبُدُ اللَّهَ عَلى حَرْفٍ فَإِنْ أَصابَهُ خَيْرٌ اطْمَأَنَّ بِهِ وَ إِنْ أَصابَتْهُ فِتْنَةٌ انْقَلَبَ عَلى وَجْهِهِ خَسِرَ الدُّنْيا وَ الْآخِرَةَ \nقَالَ زُرَارَةُ سَأَلْتُ عَنْهَا أَبَا جَعْفَرٍ ( عليه السلام ) فَقَالَ هَؤُلَاءِ قَوْمٌ عَبَدُوا اللَّهَ وَ خَلَعُوا عِبَادَةَ مَنْ يُعْبَدُ مِنْ دُونِ اللَّهِ وَ شَكُّوا فِي مُحَمَّدٍ ( صلى الله عليه وآله ) وَ مَا جَاءَ بِهِ فَتَكَلَّمُوا بِالْإِسْلَامِ وَ شَهِدُوا أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ وَ أَقَرُّوا بِالْقُرْآنِ وَ هُمْ فِي ذَلِكَ شَاكُّونَ فِي مُحَمَّدٍ ( صلى الله عليه وآله ) وَ مَا جَاءَ بِهِ وَ لَيْسُوا شُكَّاكاً فِي اللَّهِ \nقَالَ اللَّهُ عَزَّ وَ جَلَّ وَ مِنَ النَّاسِ مَنْ يَعْبُدُ اللَّهَ عَلى حَرْفٍ يَعْنِي عَلَى شَكٍّ فِي مُحَمَّدٍ ( صلى الله عليه وآله ) وَ مَا جَاءَ بِهِ فَإِنْ أَصابَهُ خَيْرٌ يَعْنِي عَافِيَةً فِي نَفْسِهِ وَ مَالِهِ وَ وُلْدِهِ اطْمَأَنَّ بِهِ وَ رَضِيَ بِهِ وَ إِنْ أَصابَتْهُ فِتْنَةٌ يَعْنِي بَلَاءً فِي جَسَدِهِ أَوْ مَالِهِ تَطَيَّرَ وَ كَرِهَ الْمُقَامَ عَلَى الْإِقْرَارِ بِالنَّبِيِّ ( صلى الله عليه وآله ) فَرَجَعَ إِلَى الْوُقُوفِ وَ الشَّكِّ فَنَصَبَ الْعَدَاوَةَ لِلَّهِ وَ لِرَسُولِهِ وَ الْجُحُودَ بِالنَّبِيِّ وَ مَا جَاءَ بِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Al Fuzayl and Zurara, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[22:11] And among men is he who worships Allah superficially, so that if good befalls him he is satisfied therewith, but if a trial afflicts him he turns back headlong; he loses this world as well as the Hereafter; that is a manifest loss</span>. \nZurara (the narrator) said, ‘I asked Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> about it, so he<sup style=\"font-weight: normal\">asws</sup> said: ‘They are a people worshipping Allah<sup style=\"font-weight: normal\">azwj</sup> and keeping away from worshipping the ones besides Allah<sup style=\"font-weight: normal\">azwj</sup> and are doubting regarding Muhammad<sup style=\"font-weight: normal\">saww</sup> and what he<sup style=\"font-weight: normal\">saww</sup> came with. Thus, they are speaking with Al-Islam and are testifying that there is no god except for Allah<sup style=\"font-weight: normal\">azwj</sup> and that Muhammad<sup style=\"font-weight: normal\">saww</sup> is Rasool-Allah<sup style=\"font-weight: normal\">saww</sup>, and are acknowledging with the Quran, and they are doubting in that regarding Muhammad<sup style=\"font-weight: normal\">saww</sup> and what he<sup style=\"font-weight: normal\">saww</sup> came with, and are not doubtful regarding Allah<sup style=\"font-weight: normal\">azwj</sup>’. \nAllah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic Says <span class=\"ibTxt\">[22:11] And among men is he who worships Allah superficially</span> – Meaning doubting in Muhammad<sup style=\"font-weight: normal\">saww</sup> and what he<sup style=\"font-weight: normal\">saww</sup> came with. <span class=\"ibTxt\">so that if good befalls him </span>meaning well being regarding himself and his wealth and his children <span class=\"ibTxt\">he is satisfied therewith, but if a trial afflicts him </span>meaning an affliction in his body or his wealth he flies off and dislikes the standing upon the acknowledgement with the Prophet<sup style=\"font-weight: normal\">saww</sup>. So he returns to the pausing and the doubting and establishes the enmity to Allah<sup style=\"font-weight: normal\">azwj</sup> and to His<sup style=\"font-weight: normal\">azwj</sup> Rasool<sup style=\"font-weight: normal\">saww</sup>, and becomes critical to the Prophet<sup style=\"font-weight: normal\">saww</sup> and what he<sup style=\"font-weight: normal\">saww</sup> came with’."}]}, {"index": 2910, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:1:178:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُوسَى بْنِ بَكْرٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ مِنَ النَّاسِ مَنْ يَعْبُدُ اللَّهَ عَلى حَرْفٍ قَالَ هُمْ قَوْمٌ وَحَّدُوا اللَّهَ وَ خَلَعُوا عِبَادَةَ مَنْ يُعْبَدُ مِنْ دُونِ اللَّهِ فَخَرَجُوا مِنَ الشِّرْكِ وَ لَمْ يَعْرِفُوا أَنَّ مُحَمَّداً ( صلى الله عليه وآله ) رَسُولُ اللَّهِ فَهُمْ يَعْبُدُونَ اللَّهَ عَلَى شَكٍّ فِي مُحَمَّدٍ ( صلى الله عليه وآله ) وَ مَا جَاءَ بِهِ \nفَأَتَوْا رَسُولَ اللَّهِ ( صلى الله عليه وآله ) وَ قَالُوا نَنْظُرُ فَإِنْ كَثُرَتْ أَمْوَالُنَا وَ عُوفِينَا فِي أَنْفُسِنَا وَ أَوْلَادِنَا عَلِمْنَا أَنَّهُ صَادِقٌ وَ أَنَّهُ رَسُولُ اللَّهِ وَ إِنْ كَانَ غَيْرَ ذَلِكَ نَظَرْنَا \nقَالَ اللَّهُ عَزَّ وَ جَلَّ فَإِنْ أَصابَهُ خَيْرٌ اطْمَأَنَّ بِهِ يَعْنِي عَافِيَةً فِي الدُّنْيَا وَ إِنْ أَصابَتْهُ فِتْنَةٌ يَعْنِي بَلَاءً فِي نَفْسِهِ وَ مَالِهِ انْقَلَبَ عَلى وَجْهِهِ انْقَلَبَ عَلَى شَكِّهِ إِلَى الشِّرْكِ خَسِرَ الدُّنْيا وَ الْآخِرَةَ ذلِكَ هُوَ الْخُسْرانُ الْمُبِينُ يَدْعُوا مِنْ دُونِ اللَّهِ ما لا يَضُرُّهُ وَ ما لا يَنْفَعُهُ \nقَالَ يَنْقَلِبُ مُشْرِكاً يَدْعُو غَيْرَ اللَّهِ وَ يَعْبُدُ غَيْرَهُ فَمِنْهُمْ مَنْ يَعْرِفُ وَ يَدْخُلُ الْإِيمَانُ قَلْبَهُ فَيُؤْمِنُ وَ يُصَدِّقُ وَ يَزُولُ عَنْ مَنْزِلَتِهِ مِنَ الشَّكِّ إِلَى الْإِيمَانِ وَ مِنْهُمْ مَنْ يَثْبُتُ عَلَى شَكِّهِ وَ مِنْهُمْ مَنْ يَنْقَلِبُ إِلَى الشِّرْكِ .\nعَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ رَجُلٍ عَنْ زُرَارَةَ مِثْلَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Mjuhammad, from Ali Bin Al hakam, from Musa Bin Bakr, from Zurara, \n(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[22:11] And among men is he who worships Allah superficially</span>. He<sup>asws</sup> said: ‘They are a people professing the Oneness of Allah<sup>azwj</sup> and keeping away from worshipping the ones besides Allah<sup>azwj</sup>. So they are exiting from the <span class=\"iTxt\">Shirk</span> (Polytheism) but are not recognising that Muhammad<sup>saww</sup> is the Rasool<sup>saww</sup> of Allah<sup>azwj</sup>. Thus, they are worshipping Allah<sup>azwj</sup> upon doubt regarding Muhammad<sup>saww</sup> and what he<sup>saww</sup> came with.\nSo they came over to Rasool-Allah<sup>saww</sup> and said, ‘We shall consider, so if our wealth becomes abundant, and we are with good health regarding ourselves and our children, we will know that he<sup>saww</sup> is truthful and that he<sup>saww</sup> is Rasool<sup>saww</sup> of Allah<sup>azwj</sup>; but if it is other than that, we shall reconsider’. \nAllah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\">[22:11] so that if good befalls him he is satisfied therewith </span>Meaning the well being in the world<span class=\"ibTxt\"> but if a trial afflicts him </span> Meaning an an affliction regarding himself and his wealth <span class=\"ibTxt\">he turns back headlong </span>overturning upon his doubt to the <span class=\"iTxt\">Shirk</span> (Polytheism) <span class=\"ibTxt\"> he loses this world as well as the Hereafter; that is a manifest loss</span>. He supplicates to the ones besides Allah<sup style=\"font-weight: normal\">azwj</sup> who can neither harm him nor that can benefit him’.   \nHe<sup style=\"font-weight: normal\">asws</sup> said: ‘He overturns to be a <span class=\"iTxt\">Mushrik</span> (Polytheist) supplicting to other than Allah<sup style=\"font-weight: normal\">azwj</sup> and worshipping other than Him<sup style=\"font-weight: normal\">azwj</sup>. So from them is one who recognises and the <span class=\"iTxt\">Emān</span> enters his heart, so he belives and ratifies and declines from his state of doubt to (embrace) the <span class=\"iTxt\">Emān</span>, and from them is the one who remains affirmed upon his doubt, and from them is the one who overturns to the <span class=\"iTxt\">Shirk</span> (Polytheism)’. \n<span style=\"font-size: small\">Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from A man, from Zurara </span>– similar to it."}]}]}, "index": "al-kafi:2:1:178", "kind": "verse_list"}