{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:2:1", "titles": {"ar": "كتاب الإيمان و الكفر", "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"}}, {"indexed_titles": {"en": "Chapter 179"}, "path": "/books/al-kafi:2:1:179", "titles": {"ar": "بَابُ أَدْنَى مَا يَكُونُ بِهِ الْعَبْدُ مُؤْمِناً أَوْ كَافِراً أَوْ ضَالًّا", "en": "Chapter 179 – The least of what by which the servant can be a Momin, or a Kafir (unbeliever), or a straying one"}}], "index": 367, "local_index": 179, "part_type": "Chapter", "path": "/books/al-kafi:2:1:179", "titles": {"ar": "بَابُ أَدْنَى مَا يَكُونُ بِهِ الْعَبْدُ مُؤْمِناً أَوْ كَافِراً أَوْ ضَالًّا", "en": "Chapter 179 – The least of what by which the servant can be a Momin, or a Kafir (unbeliever), or a straying one"}, "verse_count": 1, "verse_start_index": 2910, "verses": [{"index": 2911, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:1:179:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ الْيَمَانِيِّ عَنِ ابْنِ أُذَيْنَةَ عَنْ أَبَانِ بْنِ عَيَّاشٍ عَنْ سُلَيْمِ بْنِ قَيْسٍ قَالَ سَمِعْتُ عَلِيّاً ( صلوات الله عليه )  يَقُولُ وَ أَتَاهُ رَجُلٌ فَقَالَ لَهُ مَا أَدْنَى مَا يَكُونُ بِهِ الْعَبْدُ مُؤْمِناً وَ أَدْنَى مَا يَكُونُ بِهِ الْعَبْدُ كَافِراً وَ أَدْنَى مَا يَكُونُ بِهِ الْعَبْدُ ضَالًّا\nفَقَالَ لَهُ قَدْ سَأَلْتَ فَافْهَمِ الْجَوَابَ أَمَّا أَدْنَى مَا يَكُونُ بِهِ الْعَبْدُ مُؤْمِناً أَنْ يُعَرِّفَهُ اللَّهُ تَبَارَكَ وَ تَعَالَى نَفْسَهُ فَيُقِرَّ لَهُ بِالطَّاعَةِ وَ يُعَرِّفَهُ نَبِيَّهُ ( صلى الله عليه وآله ) فَيُقِرَّ لَهُ بِالطَّاعَةِ وَ يُعَرِّفَهُ إِمَامَهَ وَ حُجَّتَهُ فِي أَرْضِهِ وَ شَاهِدَهُ عَلَى خَلْقِهِ فَيُقِرَّ لَهُ بِالطَّاعَةِ\nقُلْتُ لَهُ يَا أَمِيرَ الْمُؤْمِنِينَ وَ إِنْ جَهِلَ جَمِيعَ الْأَشْيَاءِ إِلَّا مَا وَصَفْتَ قَالَ نَعَمْ إِذَا أُمِرَ أَطَاعَ وَ إِذَا نُهِيَ انْتَهَى \nوَ أَدْنَى مَا يَكُونُ بِهِ الْعَبْدُ كَافِراً مَنْ زَعَمَ أَنَّ شَيْئاً نَهَى اللَّهُ عَنْهُ أَنَّ اللَّهَ أَمَرَ بِهِ وَ نَصَبَهُ دِيناً يَتَوَلَّى عَلَيْهِ وَ يَزْعُمُ أَنَّهُ يَعْبُدُ الَّذِي أَمَرَهُ بِهِ وَ إِنَّمَا يَعْبُدُ الشَّيْطَانَ\nوَ أَدْنَى مَا يَكُونُ بِهِ الْعَبْدُ ضَالًّا أَنْ لَا يَعْرِفَ حُجَّةَ اللَّهِ تَبَارَكَ وَ تَعَالَى وَ شَاهِدَهُ عَلَى عِبَادِهِ الَّذِي أَمَرَ اللَّهُ عَزَّ وَ جَلَّ بِطَاعَتِهِ وَ فَرَضَ وَلَايَتَهُ\nقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ صِفْهُمْ لِي فَقَالَ الَّذِينَ قَرَنَهُمُ اللَّهُ عَزَّ وَ جَلَّ بِنَفْسِهِ وَ نَبِيِّهِ فَقَالَ يا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَ أَطِيعُوا الرَّسُولَ وَ أُولِي الْأَمْرِ مِنْكُمْ\nقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ جَعَلَنِيَ اللَّهُ فِدَاكَ أَوْضِحْ لِي فَقَالَ الَّذِينَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فِي آخِرِ خُطْبَتِهِ يَوْمَ قَبَضَهُ اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ إِنِّي قَدْ تَرَكْتُ فِيكُمْ أَمْرَيْنِ لَنْ تَضِلُّوا بَعْدِي مَا إِنْ تَمَسَّكْتُمْ بِهِمَا كِتَابَ اللَّهِ وَ عِتْرَتِي أَهْلَ بَيْتِي فَإِنَّ اللَّطِيفَ الْخَبِيرَ قَدْ عَهِدَ إِلَيَّ أَنَّهُمَا لَنْ يَفْتَرِقَا حَتَّى يَرِدَا عَلَيَّ الْحَوْضَ كَهَاتَيْنِ وَ جَمَعَ بَيْنَ مُسَبِّحَتَيْهِ وَ لَا أَقُولُ كَهَاتَيْنِ وَ جَمَعَ بَيْنَ الْمُسَبِّحَةِ وَ الْوُسْطَى فَتَسْبِقَ إِحْدَاهُمَا الْأُخْرَى فَتَمَسَّكُوا بِهِمَا لَا تَزِلُّوا وَ لَا تَضِلُّوا وَ لَا تَقَدَّمُوهُمْ فَتَضِلُّوا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Ibrahim Bin Umar Al Yamani, from Ibn Azina, from Aban Bin Ayyash, from Suleym Bin Qays who said, \n‘I heard Ali<sup>asws</sup> saying and a man had come over to him<sup>asws</sup>, and he said to him<sup>asws</sup>: ‘What is the least of that with which the servant (of Allah<sup>azwj</sup>) becomes a <span class=\"iTxt\">Momin</span> (believer), or a <span class=\"iTxt\">Kafir</span> (unbeliever), or a straying one?’ \nSo he<sup>asws</sup> said to him: ‘You have asked so now try to understand the answer. As for the least of that with which the servant (of Allah<sup>azwj</sup>) can be a <span class=\"iTxt\">Momin</span> is that he recognises Allah<sup>azwj</sup> Blessed and High himself, so he acknowledges to Him<sup>azwj</sup> with the obedience, and he recognises His<sup>azwj</sup> Prophet<sup>saww</sup>, so he acknowledges to him<sup>saww</sup> with his<sup>saww</sup> obedience, and he recognises His<sup>azwj</sup> Imam<sup>asws</sup> and His<sup>azwj</sup> Proof in His<sup>azwj</sup> earth, and His<sup>azwj</sup> Witness over His<sup>azwj</sup> creatures, so he acknowledges to him<sup>asws</sup> with the obedience’.\nI said to him<sup>asws</sup>, ‘O Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup>! And even if he was ignorant of the entirety of the things except what you<sup>asws</sup> have described?’ He<sup>asws</sup> said: ‘Yes. Whenever he<sup>asws</sup> orders, he obeys, and whenever he<sup>asws</sup> forbids, he keeps away.\nAnd the least of that with which the servant (of Allah<sup>azwj</sup>) can be a <span class=\"iTxt\">Kafir</span> (unbeliever) is the one who alleges that the things Allah<sup>azwj</sup> has Forbidden from is what Allah<sup>azwj</sup> has Commanded with, and establishes it as a religion, and pretends that he is worshipping the One<sup>azwj</sup> Who has Commanded with it, and rather he is worshipping the Satan<sup>la</sup>. \nAnd the least of that with which the servant (of Allah<sup>azwj</sup>) happen to be straying one is that he does not recognise the Proof<sup>asws</sup> of Allah<sup>azwj</sup> Blessed and High and His<sup>azwj</sup> Witness upon His<sup>azwj</sup> servants whom Allah<sup>azwj</sup> Mighty and Majestic has Commanded with his<sup>asws</sup> obedience and Imposed his<sup>asws</sup> Wilayah’. \nI said, ‘O Amir Al <span class=\"iTxt\">Momineen</span><sup>asws</sup>! Describe them<sup>asws</sup> to me’. So he<sup>asws</sup> said: ‘Those<sup>asws</sup> whom Allah<sup>azwj</sup> Mighty and Majestic has Paired with Himself<sup>azwj</sup> and His<sup>azwj</sup> Prophet<sup>saww</sup>, so He<sup>azwj</sup> Said <span class=\"ibTxt\">[4:59] O you who believe! Obey Allah and obey the Rasool and those in authority from among you</span>’. \nI said, ‘O Amir Al <span class=\"iTxt\">Momineen</span><sup>asws</sup>! May Allah<sup>azwj</sup> Make me to be sacrificed for you<sup>asws</sup>! Clarify it to me’. So he<sup>asws</sup> said: ‘Those<sup>asws</sup> for whom Rasool-Allah<sup>saww</sup> spoke of at the end of his<sup>saww</sup> sermon on the day Allah<sup>azwj</sup> Mighty and Majestic Caused him<sup>saww</sup> to pass away: ‘I<sup>saww</sup> am leaving behind two matters among you all. You will never stray after me<sup>saww</sup> for as long as you attach yourselves with these two – the Book of Allah<sup>azwj</sup> and my<sup>saww</sup> offspring, the People<sup>asws</sup> of my<sup>saww</sup> Household, for the Knower of the subtleties and the All-Aware has Informed me<sup>saww</sup> and has Covenanted to me<sup>saww</sup> that these two will never separate until they both come to me<sup>saww</sup> at the Fountain, like these two’ – and he<sup>saww</sup> gathered between his<sup>saww</sup> ‘<span class=\"iTxt\">Tasbeeh</span> fingers’ (the forefinger and the thumb), ‘And I<sup>saww</sup> am not saying like this’ – and he<sup>saww</sup> gathered between the thumb and the middle finger, ‘So that one of the two would precede the other. Therefore, attach yourselves with these two and you will neither be deceived nor stray, and do not precede them<sup>asws</sup>, for you will go astray’."}]}]}, "index": "al-kafi:2:1:179", "kind": "verse_list"}