{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:2:1:18",
        "titles": {
          "ar": "بَابٌ فِي أَنَّ الْإِيمَانَ مَبْثُوثٌ لِجَوَارِحِ الْبَدَنِ كُلِّهَا",
          "en": "Chapter 18 -  Regarding that the Emān (belief) spreads out to the parts of the body, all of them"
        }
      }
    ],
    "index": 206,
    "local_index": 18,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 19"
        },
        "path": "/books/al-kafi:2:1:19",
        "titles": {
          "ar": "بَابُ السَّبْقِ إِلَى الْإِيمَانِ",
          "en": "Chapter 19 – The preceding (racing) to the Emān"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 17"
        },
        "path": "/books/al-kafi:2:1:17",
        "titles": {
          "ar": "بَابٌ",
          "en": "Chapter 17 – A Chapter"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:18",
    "titles": {
      "ar": "بَابٌ فِي أَنَّ الْإِيمَانَ مَبْثُوثٌ لِجَوَارِحِ الْبَدَنِ كُلِّهَا",
      "en": "Chapter 18 -  Regarding that the Emān (belief) spreads out to the parts of the body, all of them"
    },
    "verse_count": 8,
    "verse_start_index": 1513,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 1514,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:18:1",
        "relations": {
          "Mentions": [
            "/books/quran:18:13",
            "/books/quran:5:6",
            "/books/quran:24:30",
            "/books/quran:2:83",
            "/books/quran:6:68",
            "/books/quran:13:28",
            "/books/quran:31:19",
            "/books/quran:22:77",
            "/books/quran:72:18",
            "/books/quran:25:72",
            "/books/quran:9:124",
            "/books/quran:28:55",
            "/books/quran:29:46",
            "/books/quran:23:4",
            "/books/quran:24:31",
            "/books/quran:16:106",
            "/books/quran:2:143",
            "/books/quran:17:36",
            "/books/quran:23:2",
            "/books/quran:41:22",
            "/books/quran:47:4",
            "/books/quran:5:41",
            "/books/quran:9:125",
            "/books/quran:23:3",
            "/books/quran:17:37",
            "/books/quran:39:18",
            "/books/quran:36:65",
            "/books/quran:23:1",
            "/books/quran:2:284"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ بَكْرِ بْنِ صَالِحٍ عَنِ الْقَاسِمِ بْنِ بُرَيْدٍ قَالَ حَدَّثَنَا أَبُو عَمْرٍو الزُّبَيْرِيُّ عَنْ أَبِي عَبْدِ اللَّهِ ع قَالَ قُلْتُ لَهُ أَيُّهَا الْعَالِمُ أَخْبِرْنِي أَيُّ الْأَعْمَالِ أَفْضَلُ عِنْدَ اللَّهِ قَالَ مَا لَا يَقْبَلُ اللَّهُ شَيْئاً إِلَّا بِهِ",
          "قُلْتُ وَ مَا هُوَ قَالَ‏ الْإِيمَانُ بِاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ أَعْلَى الْأَعْمَالِ دَرَجَةً وَ أَشْرَفُهَا مَنْزِلَةً وَ أَسْنَاهَا حَظّاً قَالَ قُلْتُ أَ لَا تُخْبِرُنِي عَنِ الْإِيمَانِ أَ قَوْلٌ هُوَ وَ عَمَلٌ أَمْ قَوْلٌ بِلَا عَمَلٍ",
          "فَقَالَ الْإِيمَانُ عَمَلٌ كُلُّهُ وَ الْقَوْلُ بَعْضُ ذَلِكَ الْعَمَلِ بِفَرْضٍ مِنَ اللَّهِ بَيَّنَ فِي كِتَابِهِ وَاضِحٍ نُورُهُ ثَابِتَةٍ حُجَّتُهُ يَشْهَدُ لَهُ بِهِ الْكِتَابُ وَ يَدْعُوهُ إِلَيْهِ",
          "قَالَ قُلْتُ صِفْهُ لِي جُعِلْتُ فِدَاكَ حَتَّى أَفْهَمَهُ قَالَ الْإِيمَانُ حَالَاتٌ وَ دَرَجَاتٌ وَ طَبَقَاتٌ وَ مَنَازِلُ فَمِنْهُ التَّامُّ الْمُنْتَهَى تَمَامُهُ وَ مِنْهُ النَّاقِصُ الْبَيِّنُ نُقْصَانُهُ وَ مِنْهُ الرَّاجِحُ الزَّائِدُ رُجْحَانُهُ",
          "قُلْتُ إِنَّ الْإِيمَانَ لَيَتِمُّ وَ يَنْقُصُ وَ يَزِيدُ قَالَ نَعَمْ قُلْتُ كَيْفَ ذَلِكَ قَالَ لِأَنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى فَرَضَ الْإِيمَانَ عَلَى جَوَارِحِ ابْنِ آدَمَ وَ قَسَّمَهُ عَلَيْهَا وَ فَرَّقَهُ فِيهَا فَلَيْسَ مِنْ جَوَارِحِهِ جَارِحَةٌ إِلَّا وَ قَدْ وُكِّلَتْ مِنَ الْإِيمَانِ بِغَيْرِ مَا وُكِّلَتْ بِهِ أُخْتُهَا",
          "فَمِنْهَا قَلْبُهُ الَّذِي بِهِ يَعْقِلُ وَ يَفْقَهُ وَ يَفْهَمُ وَ هُوَ أَمِيرُ بَدَنِهِ الَّذِي لَا تَرِدُ الْجَوَارِحُ وَ لَا تَصْدُرُ إِلَّا عَنْ رَأْيِهِ وَ أَمْرِهِ وَ مِنْهَا عَيْنَاهُ اللَّتَانِ يُبْصِرُ بِهِمَا وَ أُذُنَاهُ اللَّتَانِ يَسْمَعُ بِهِمَا وَ يَدَاهُ اللَّتَانِ يَبْطِشُ بِهِمَا وَ رِجْلَاهُ اللَّتَانِ يَمْشِي بِهِمَا وَ فَرْجُهُ الَّذِي الْبَاهُ مِنْ قِبَلِهِ وَ لِسَانُهُ الَّذِي يَنْطِقُ بِهِ وَ رَأْسُهُ الَّذِي فِيهِ وَجْهُهُ فَلَيْسَ مِنْ هَذِهِ جَارِحَةٌ إِلَّا وَ قَدْ وُكِّلَتْ مِنَ الْإِيمَانِ بِغَيْرِ مَا وُكِّلَتْ بِهِ أُخْتُهَا بِفَرْضٍ مِنَ اللَّهِ تَبَارَكَ اسْمُهُ يَنْطِقُ بِهِ الْكِتَابُ لَهَا وَ يَشْهَدُ بِهِ عَلَيْهَا",
          "فَفَرَضَ عَلَى الْقَلْبِ غَيْرَ مَا فَرَضَ عَلَى السَّمْعِ وَ فَرَضَ عَلَى السَّمْعِ غَيْرَ مَا فَرَضَ عَلَى الْعَيْنَيْنِ وَ فَرَضَ عَلَى الْعَيْنَيْنِ غَيْرَ مَا فَرَضَ عَلَى اللِّسَانِ وَ فَرَضَ عَلَى اللِّسَانِ غَيْرَ مَا فَرَضَ عَلَى الْيَدَيْنِ وَ فَرَضَ عَلَى الْيَدَيْنِ غَيْرَ مَا فَرَضَ عَلَى الرِّجْلَيْنِ وَ فَرَضَ عَلَى الرِّجْلَيْنِ غَيْرَ مَا فَرَضَ عَلَى الْفَرْجِ وَ فَرَضَ عَلَى الْفَرْجِ غَيْرَ مَا فَرَضَ عَلَى الْوَجْهِ",
          "فَأَمَّا مَا فَرَضَ عَلَى الْقَلْبِ مِنَ الْإِيمَانِ فَالْإِقْرَارُ وَ الْمَعْرِفَةُ وَ الْعَقْدُ وَ الرِّضَا وَ التَّسْلِيمُ بِأَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ إِلَهاً وَاحِداً لَمْ يَتَّخِذْ صَاحِبَةً وَ لَا وَلَداً وَ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ ص وَ الْإِقْرَارُ بِمَا جَاءَ مِنْ عِنْدِ اللَّهِ مِنْ نَبِيٍّ أَوْ كِتَابٍ فَذَلِكَ مَا فَرَضَ اللَّهُ عَلَى الْقَلْبِ مِنَ الْإِقْرَارِ وَ الْمَعْرِفَةِ وَ هُوَ عَمَلُهُ وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ إِلَّا مَنْ أُكْرِهَ وَ قَلْبُهُ مُطْمَئِنٌّ بِالْإِيمانِ وَ لكِنْ مَنْ شَرَحَ بِالْكُفْرِ صَدْراً",
          "وَ قَالَ أَلا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ",
          "وَ قَالَ الَّذِينَ آمَنُوا بِأَفْوَاهِهِمْ وَ لَمْ تُؤْمِنْ قُلُوبُهُمْ",
          "وَ قَالَ إِنْ تُبْدُوا ما فِي أَنْفُسِكُمْ أَوْ تُخْفُوهُ يُحاسِبْكُمْ بِهِ اللَّهُ فَيَغْفِرُ لِمَنْ يَشاءُ وَ يُعَذِّبُ مَنْ يَشاءُ",
          "فَذَلِكَ مَا فَرَضَ اللَّهُ عَزَّ وَ جَلَّ عَلَى الْقَلْبِ مِنَ الْإِقْرَارِ وَ الْمَعْرِفَةِ وَ هُوَ عَمَلُهُ وَ هُوَ رَأْسُ الْإِيمَانِ",
          "وَ فَرَضَ اللَّهُ عَلَى اللِّسَانِ الْقَوْلَ وَ التَّعْبِيرَ عَنِ الْقَلْبِ بِمَا عَقَدَ عَلَيْهِ وَ أَقَرَّ بِهِ قَالَ اللَّهُ تَبَارَكَ وَ تَعَالَى وَ قُولُوا لِلنَّاسِ حُسْناً",
          "وَ قَالَ وَ قُولُوا آمَنَّا بِالَّذِي أُنْزِلَ إِلَيْنا وَ أُنْزِلَ إِلَيْكُمْ وَ إِلهُنا وَ إِلهُكُمْ واحِدٌ وَ نَحْنُ لَهُ مُسْلِمُونَ فَهَذَا مَا فَرَضَ اللَّهُ عَلَى اللِّسَانِ وَ هُوَ عَمَلُهُ",
          "وَ فَرَضَ عَلَى السَّمْعِ أَنْ يَتَنَزَّهَ عَنِ الِاسْتِمَاعِ إِلَى مَا حَرَّمَ اللَّهُ وَ أَنْ يُعْرِضَ عَمَّا لَا يَحِلُّ لَهُ مِمَّا نَهَى اللَّهُ عَزَّ وَ جَلَّ عَنْهُ وَ الْإِصْغَاءِ إِلَى مَا أَسْخَطَ اللَّهَ عَزَّ وَ جَلَّ فَقَالَ فِي ذَلِكَ وَ قَدْ نَزَّلَ عَلَيْكُمْ فِي الْكِتابِ أَنْ إِذا سَمِعْتُمْ آياتِ اللَّهِ يُكْفَرُ بِها وَ يُسْتَهْزَأُ بِها فَلا تَقْعُدُوا مَعَهُمْ حَتَّى يَخُوضُوا فِي حَدِيثٍ غَيْرِهِ",
          "ثُمَّ اسْتَثْنَى اللَّهُ عَزَّ وَ جَلَّ مَوْضِعَ النِّسْيَانِ فَقَالَ وَ إِمَّا يُنْسِيَنَّكَ الشَّيْطانُ فَلا تَقْعُدْ بَعْدَ الذِّكْرى‏ مَعَ الْقَوْمِ الظَّالِمِينَ",
          "وَ قَالَ فَبَشِّرْ عِبادِ الَّذِينَ يَسْتَمِعُونَ الْقَوْلَ فَيَتَّبِعُونَ أَحْسَنَهُ أُولئِكَ الَّذِينَ هَداهُمُ اللَّهُ وَ أُولئِكَ هُمْ أُولُوا الْأَلْبابِ",
          "وَ قَالَ عَزَّ وَ جَلَّ قَدْ أَفْلَحَ الْمُؤْمِنُونَ الَّذِينَ هُمْ فِي صَلاتِهِمْ خاشِعُونَ وَ الَّذِينَ هُمْ عَنِ اللَّغْوِ مُعْرِضُونَ وَ الَّذِينَ هُمْ لِلزَّكاةِ فاعِلُونَ",
          "وَ قَالَ وَ إِذا سَمِعُوا اللَّغْوَ أَعْرَضُوا عَنْهُ وَ قالُوا لَنا أَعْمالُنا وَ لَكُمْ أَعْمالُكُمْ",
          "وَ قَالَ وَ إِذا مَرُّوا بِاللَّغْوِ مَرُّوا كِراماً",
          "فَهَذَا مَا فَرَضَ اللَّهُ عَلَى السَّمْعِ مِنَ الْإِيمَانِ أَنْ لَا يُصْغِيَ إِلَى مَا لَا يَحِلُّ لَهُ وَ هُوَ عَمَلُهُ وَ هُوَ مِنَ الْإِيمَانِ",
          "وَ فَرَضَ عَلَى الْبَصَرِ أَنْ لَا يَنْظُرَ إِلَى مَا حَرَّمَ اللَّهُ عَلَيْهِ وَ أَنْ يُعْرِضَ عَمَّا نَهَى اللَّهُ عَنْهُ مِمَّا لَا يَحِلُّ لَهُ وَ هُوَ عَمَلُهُ وَ هُوَ مِنَ الْإِيمَانِ",
          "فَقَالَ تَبَارَكَ وَ تَعَالَى قُلْ لِلْمُؤْمِنِينَ يَغُضُّوا مِنْ أَبْصارِهِمْ وَ يَحْفَظُوا فُرُوجَهُمْ",
          "فَنَهَاهُمْ أَنْ يَنْظُرُوا إِلَى عَوْرَاتِهِمْ وَ أَنْ يَنْظُرَ الْمَرْءُ إِلَى فَرْجِ أَخِيهِ وَ يَحْفَظَ فَرْجَهُ أَنْ يُنْظَرَ إِلَيْهِ",
          "وَ قَالَ وَ قُلْ لِلْمُؤْمِناتِ يَغْضُضْنَ مِنْ أَبْصارِهِنَّ وَ يَحْفَظْنَ فُرُوجَهُنَ‏  ",
          "مِنْ أَنْ تَنْظُرَ إِحْدَاهُنَّ إِلَى فَرْجِ أُخْتِهَا وَ تَحْفَظَ فَرْجَهَا مِنْ أَنْ يُنْظَرَ إِلَيْهَا وَ قَالَ كُلُّ شَيْ‏ءٍ فِي الْقُرْآنِ مِنْ حِفْظِ الْفَرْجِ فَهُوَ مِنْ الزِّنَا إِلَّا هَذِهِ الْآيَةَ فَإِنَّهَا مِنَ النَّظَرِ",
          "ثُمَّ نَظَمَ مَا فَرَضَ عَلَى الْقَلْبِ وَ اللِّسَانِ وَ السَّمْعِ وَ الْبَصَرِ فِي آيَةٍ أُخْرَى فَقَالَ وَ ما كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَ لا أَبْصارُكُمْ وَ لا جُلُودُكُمْ",
          "يَعْنِي بِالْجُلُودِ الْفُرُوجَ وَ الْأَفْخَاذَ وَ قَالَ وَ لا تَقْفُ ما لَيْسَ لَكَ بِهِ عِلْمٌ إِنَّ السَّمْعَ وَ الْبَصَرَ وَ الْفُؤادَ كُلُّ أُولئِكَ كانَ عَنْهُ مَسْؤُلًا",
          "فَهَذَا مَا فَرَضَ اللَّهُ عَلَى الْعَيْنَيْنِ مِنْ غَضِّ الْبَصَرِ عَمَّا حَرَّمَ اللَّهُ عَزَّ وَ جَلَّ وَ هُوَ عَمَلُهُمَا وَ هُوَ مِنَ الْإِيمَانِ",
          "وَ فَرَضَ اللَّهُ عَلَى الْيَدَيْنِ أَنْ لَا يَبْطِشَ بِهِمَا إِلَى مَا حَرَّمَ اللَّهُ وَ أَنْ يَبْطِشَ بِهِمَا إِلَى مَا أَمَرَ اللَّهُ عَزَّ وَ جَلَّ وَ فَرَضَ عَلَيْهِمَا مِنَ الصَّدَقَةِ وَ صِلَةِ الرَّحِمِ وَ الْجِهَادِ فِي سَبِيلِ اللَّهِ وَ الطَّهُورِ لِلصَّلَاةِ",
          "فَقَالَ يا أَيُّهَا الَّذِينَ آمَنُوا إِذا قُمْتُمْ إِلَى الصَّلاةِ فَاغْسِلُوا وُجُوهَكُمْ وَ أَيْدِيَكُمْ إِلَى الْمَرافِقِ وَ امْسَحُوا بِرُؤُسِكُمْ وَ أَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ",
          "وَ قَالَ فَإِذا لَقِيتُمُ الَّذِينَ كَفَرُوا فَضَرْبَ الرِّقابِ حَتَّى إِذا أَثْخَنْتُمُوهُمْ فَشُدُّوا الْوَثاقَ فَإِمَّا مَنًّا بَعْدُ وَ إِمَّا فِداءً حَتَّى تَضَعَ الْحَرْبُ أَوْزارَها ",
          "فَهَذَا مَا فَرَضَ اللَّهُ عَلَى الْيَدَيْنِ لِأَنَّ الضَّرْبَ مِنْ عِلَاجِهِمَا",
          "وَ فَرَضَ عَلَى الرِّجْلَيْنِ أَنْ لَا يَمْشِيَ بِهِمَا إِلَى شَيْ‏ءٍ مِنْ مَعَاصِي اللَّهِ وَ فَرَضَ عَلَيْهِمَا الْمَشْيَ إِلَى مَا يُرْضِي اللَّهَ عَزَّ وَ جَلَّ فَقَالَ وَ لا تَمْشِ فِي الْأَرْضِ مَرَحاً إِنَّكَ لَنْ تَخْرِقَ الْأَرْضَ وَ لَنْ تَبْلُغَ الْجِبالَ طُولًا وَ قَالَ وَ اقْصِدْ فِي مَشْيِكَ وَ اغْضُضْ مِنْ صَوْتِكَ إِنَّ أَنْكَرَ الْأَصْواتِ لَصَوْتُ الْحَمِيرِ",
          "وَ قَالَ فِيمَا شَهِدَتِ الْأَيْدِي وَ الْأَرْجُلُ عَلَى أَنْفُسِهِمَا وَ عَلَى أَرْبَابِهِمَا مِنْ تَضْيِيعِهِمَا لِمَا أَمَرَ اللَّهُ عَزَّ وَ جَلَّ بِهِ وَ فَرَضَهُ عَلَيْهِمَا الْيَوْمَ نَخْتِمُ عَلى‏ أَفْواهِهِمْ وَ تُكَلِّمُنا أَيْدِيهِمْ وَ تَشْهَدُ أَرْجُلُهُمْ بِما كانُوا يَكْسِبُونَ",
          "فَهَذَا أَيْضاً مِمَّا فَرَضَ اللَّهُ عَلَى الْيَدَيْنِ وَ عَلَى الرِّجْلَيْنِ وَ هُوَ عَمَلُهُمَا وَ هُوَ مِنَ الْإِيمَانِ",
          "وَ فَرَضَ عَلَى الْوَجْهِ السُّجُودَ لَهُ بِاللَّيْلِ وَ النَّهَارِ فِي مَوَاقِيتِ الصَّلَاةِ فَقَالَ يا أَيُّهَا الَّذِينَ آمَنُوا ارْكَعُوا وَ اسْجُدُوا وَ اعْبُدُوا رَبَّكُمْ وَ افْعَلُوا الْخَيْرَ لَعَلَّكُمْ تُفْلِحُونَ‏",
          "فَهَذِهِ فَرِيضَةٌ جَامِعَةٌ عَلَى الْوَجْهِ وَ الْيَدَيْنِ وَ الرِّجْلَيْنِ وَ قَالَ فِي مَوْضِعٍ آخَرَ وَ أَنَّ الْمَساجِدَ لِلَّهِ فَلا تَدْعُوا مَعَ اللَّهِ أَحَداً وَ قَالَ فِيمَا فَرَضَ عَلَى الْجَوَارِحِ مِنَ الطَّهُورِ وَ الصَّلَاةِ بِهَا وَ ذَلِكَ أَنَّ اللَّهَ عَزَّ وَ جَلَّ لَمَّا صَرَفَ نَبِيَّهُ ص إِلَى الْكَعْبَةِ عَنِ الْبَيْتِ الْمُقَدَّسِ فَأَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ وَ ما كانَ اللَّهُ لِيُضِيعَ إِيمانَكُمْ إِنَّ اللَّهَ بِالنَّاسِ لَرَؤُفٌ رَحِيمٌ",
          "فَسَمَّى الصَّلَاةَ إِيمَاناً فَمَنْ لَقِيَ اللَّهَ عَزَّ وَ جَلَّ حَافِظاً لِجَوَارِحِهِ مُوفِياً كُلُّ جَارِحَةٍ مِنْ جَوَارِحِهِ مَا فَرَضَ اللَّهُ عَزَّ وَ جَلَّ عَلَيْهَا لَقِيَ اللَّهَ عَزَّ وَ جَلَّ مُسْتَكْمِلًا لِإِيمَانِهِ وَ هُوَ مِنْ أَهْلِ الْجَنَّةِ وَ مَنْ خَانَ فِي شَيْ‏ءٍ مِنْهَا أَوْ تَعَدَّى مَا أَمَرَ اللَّهُ عَزَّ وَ جَلَّ فِيهَا لَقِيَ اللَّهَ عَزَّ وَ جَلَّ نَاقِصَ الْإِيمَانِ",
          "قُلْتُ قَدْ فَهِمْتُ نُقْصَانَ الْإِيمَانِ وَ تَمَامَهُ فَمِنْ أَيْنَ جَاءَتْ زِيَادَتُهُ فَقَالَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ إِذا ما أُنْزِلَتْ سُورَةٌ فَمِنْهُمْ مَنْ يَقُولُ أَيُّكُمْ زادَتْهُ هذِهِ إِيماناً فَأَمَّا الَّذِينَ آمَنُوا فَزادَتْهُمْ إِيماناً وَ هُمْ يَسْتَبْشِرُونَ وَ أَمَّا الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ فَزادَتْهُمْ رِجْساً إِلَى رِجْسِهِمْ وَ قَالَ نَحْنُ نَقُصُّ عَلَيْكَ نَبَأَهُمْ بِالْحَقِّ إِنَّهُمْ فِتْيَةٌ آمَنُوا بِرَبِّهِمْ وَ زِدْناهُمْ هُدىً ",
          "وَ لَوْ كَانَ كُلُّهُ وَاحِداً لَا زِيَادَةَ فِيهِ وَ لَا نُقْصَانَ لَمْ يَكُنْ لِأَحَدٍ مِنْهُمْ فَضْلٌ عَلَى الْآخَرِ وَ لَاسْتَوَتِ النِّعَمُ فِيهِ وَ لَاسْتَوَى النَّاسُ وَ بَطَلَ التَّفْضِيلُ وَ لَكِنْ بِتَمَامِ الْإِيمَانِ دَخَلَ الْمُؤْمِنُونَ الْجَنَّةَ وَ بِالزِّيَادَةِ فِي الْإِيمَانِ تَفَاضَلَ الْمُؤْمِنُونَ بِالدَّرَجَاتِ عِنْدَ اللَّهِ وَ بِالنُّقْصَانِ دَخَلَ الْمُفَرِّطُونَ النَّارَ "
        ],
        "translations": {
          "en.hubeali": [
            "Ali ibn Ibrahim has narrated from his father from Bakr ibn Salih from al-Qasim ibn Burayd who has said that it has been narrated to us by Abu Amr al-Zubayri:",
            "‘I said to Abu Abd Allah<sup>asws</sup> ‘الْعَالِمُ أَيُّهَا’ ‘O Scholar, tell me which deed is more virtuous before Allah<sup>azwj</sup>?’ He<sup>asws</sup> said. ‘It is the deed without which Allah<sup>azwj</sup> does not Accept any (deed).’ ",
            "I asked, ‘What is that?’ He<sup>asws</sup> said, ‘الْإِيمَانِ’ ‘<span class=\"iTxt\">Emān</span><a id=\"_ftnref73\"></a><sup>[73]</sup> in Allah<sup>azwj</sup> besides whom no one deserves to be worshipped. It (<span class=\"iTxt\">Emān</span>) is the highest in degree among the deeds, the most valuable among them and the top-most among them in (matters of) reward.’ I then said, ‘Please, tell me then about the <span class=\"iTxt\">Emān</span>. Is it deeds or it is words without deeds?’",
            "‘The Imam<sup>asws</sup> replied: ‘All of the <span class=\"iTxt\">Emān</span> is deeds and certain parts of such deeds are words. Allah<sup>azwj</sup> has made it obligatory as is explained in His book. Its ‘نُورُهُ’ Noor (Divine Guidance)<a id=\"_ftnref74\"></a><sup>[74]</sup> is clear, its evidence is well established. The (Holy) Book testifies to it for one, and calls one to it.’ ",
            "I then asked, ‘May Allah<sup>azwj</sup> Keep my soul in service for your<sup>asws</sup> cause, please explain it to me so I may understand.’ The Imam<sup>asws</sup> said, ‘<span class=\"iTxt\">Emān</span> has levels it’s conditions, degrees and stages. Of <span class=\"iTxt\">Emān</span> there is that which is perfect and complete in perfection and (also) of <span class=\"iTxt\">Emān</span> there is that which is defective and the defect is noticeable. Of <span class=\"iTxt\">Emān</span> there is that which is heavier on the perfection side.’ ",
            "I then asked, ‘Does <span class=\"iTxt\">Emān</span> become perfect, decrease and increase?’ The Imam<sup>asws</sup> said, ‘Yes, it does.’ I then asked, ‘How does it happen?’ He<sup>asws</sup> said, ‘It is because Allah<sup>azwj</sup> has written <span class=\"iTxt\">Emān</span> for each part of the body of the children of Adam and has divided and distributed it among them. There is no part of their body but that has a guard of <span class=\"iTxt\">Emān</span> different from such guard assigned to other parts. ",
            "Of such part is one’s heart, with which one understands and reasons to comprehend, and it is the commander of his body. It oversees the body and without its opinion no part moves to act. Of the parts of the body are one’s eyes with which one sees and his ears with which one listens. There are one’s hands with which one works, one’s legs with which one walks, one’s sexual organs from which comes carnal desires, one’s tongue with which one speaks and one’s head on which there is one’s face. For each of these parts a different guard of <span class=\"iTxt\">Emān</span> is assigned. It is all due to what Allah<sup>azwj</sup>, Most Blessed is Whose Name, has written, to which His<sup>azwj</sup> Holy Book speaks and testifies.",
            "For each of these parts a different obligation is written. The obligation of the heart is different from the obligation of the ears. What is made obligatory for the ears is different from the obligation of the eyes and what is made obligatory for the eyes is different from what is made obligatory for the tongue. What is made obligatory for the tongue is different from what is made obligatory for the hands and what is made obligatory for the hands is different from what is made obligatory for the legs. The obligation of the legs is different from the obligations of the sexual organs. What is obligatory for the sexual organs is different from the obligation of the face.",
            "What is made obligatory for the heart of <span class=\"iTxt\">Emān</span> is affirmation, recognition and the formation of <span class=\"iTxt\">Emān</span>, consent and submission to the fact that no one deserves to be worshipped except Allah<sup style=\"font-weight: normal\">azwj</sup> Who is One and has no partner. He<sup style=\"font-weight: normal\">azwj</sup> is the One and only. He<sup style=\"font-weight: normal\">azwj</sup> has not Taken any companion and children. That Muhammad<sup style=\"font-weight: normal\">saww</sup> is His<sup style=\"font-weight: normal\">azwj</sup> servant and Rasool<sup style=\"font-weight: normal\">saww</sup>, he<sup style=\"font-weight: normal\">saww</sup> and his<sup style=\"font-weight: normal\">saww</sup> family<sup style=\"font-weight: normal\">asws</sup> being ‘Alayhim al-Salam, and to affirm that whatever he<sup style=\"font-weight: normal\">saww</sup> has brought is from Allah<sup style=\"font-weight: normal\">azwj</sup>, be it about a Prophet<sup style=\"font-weight: normal\">as</sup> or a Book. That is what Allah<sup style=\"font-weight: normal\">azwj</sup> has Made obligatory for the heart; the task of affirmation and recognition, which is it’s deed. This is stated in the Words of Allah<sup style=\"font-weight: normal\">azwj</sup>, ‘<span class=\"ibTxt\">but his heart is confident about his Emān. However, those whose breasts have become open to disbelief <a href=\"/#/books/quran:16#h106\">[16:106]</a></span>",
            "Allah<sup style=\"font-weight: normal\">azwj</sup> has Said, ‘<span class=\"ibTxt\">Remembrance (speaking) of Allah certainly brings comfort to all hearts.’ <a href=\"/#/books/quran:13#h28\">[13:28]</a></span>",
            "Allah<sup style=\"font-weight: normal\">azwj</sup> has Said, ‘<span class=\"ibTxt\">They only say that they believe but, in fact, they have no Emān (faith) in their hearts .... ‘ <a href=\"/#/books/quran:5#h41\">[5:41]</a></span>",
            "Allah<sup style=\"font-weight: normal\">azwj</sup> has Said, <span class=\"ibTxt\">‘Allah will call you to account for all that you may reveal from your souls and all that you may conceal. Allah will forgive or punish whoever He wants .... ‘ <a href=\"/#/books/quran:2#h284\">[2:284]</a> </span>",
            "These are what Allah<sup>azwj</sup> has Made obligatory on the hearts of affirmation and recognition, and these are its deeds and this is the chief of the <span class=\"iTxt\">Emān</span>. ",
            "On the tongue Allah<sup style=\"font-weight: normal\">azwj</sup> has Made it obligatory to speak and express what the heart has established and has confirmed as Allah<sup style=\"font-weight: normal\">azwj</sup> has Said, ‘  <span class=\"ibTxt\">that they should speak righteous words to people ... ‘ <a href=\"/#/books/quran:2#h83\">[2:83]</a></span>",
            "(Allah has also) Said, <span class=\"ibTxt\">‘Tell them, we believe in Allah and in what is revealed to us and to you. Our Lord and your Lord are one. We have submitted ourselves to His will.’ <a href=\"/#/books/quran:29#h46\">[29:46]</a>. </span>‘This is what Allah<sup>azwj</sup> has Made obligatory for the tongue and this is its deed. ",
            "Allah<sup>azwj</sup> has Made it obligatory for the ears to keep it clean from what is unlawful to hear, and to keep away from things that Allah<sup>azwj</sup> has Prohibited to listen to attentively; it angers Allah<sup>azwj</sup>. And in this regard He<sup>azwj</sup> has Said, <span class=\"ibTxt\">‘Allah has told you (Momins) in the Book that when you hear people disbelieving and mocking Allah’s revelations, do not sit with them unless they change the subject ... ‘ (4: 140) </span>",
            "Allah<sup>azwj</sup> then has Made an exception for the case of forgetfulness, <span class=\"ibTxt\">‘If Satan causes you to forget this, do not sit with the unjust people when you recall.’ <a href=\"/#/books/quran:6#h68\">[6:68]</a></span>",
            "Allah<sup>azwj</sup> has also Said, ‘(O Muhammad<sup>saww</sup>), <span class=\"ibTxt\">Give the glad news to those of My servants who listen to the words and follow only the best ones. Tell them that they are those whom Allah has guided. They are the people of understanding.’ <a href=\"/#/books/quran:39#h18\">[39:18]</a> </span>",
            "Allah<sup style=\"font-weight: normal\">azwj</sup> has Said, ‘<span class=\"ibTxt\">Triumphant indeed are the Momins, <a href=\"/#/books/quran:23#h1\">[23:1]</a> who are submissive to Allah in their prayers, <a href=\"/#/books/quran:23#h2\">[23:2]</a> who avoid impious talks <a href=\"/#/books/quran:23#h3\">[23:3]</a> and pay al-Zakat (charity).’ <a href=\"/#/books/quran:23#h4\">[23:4]</a></span>",
            "Allah<sup style=\"font-weight: normal\">azwj</sup> has Said, <span class=\"ibTxt\">‘When they hear impious words, they ignore them, saying, ‘We shall be responsible for our deeds and you will be responsible for yours .... ‘, <a href=\"/#/books/quran:28#h55\">[28:55]</a></span>",
            "Allah has Said, ‘<span class=\"ibTxt\">When they come across something impious, they pass it by nobly.’ <a href=\"/#/books/quran:25#h72\">[25:72]</a> </span>",
            "This is what Allah<sup>azwj</sup> has Made obligatory for the ears in relation to <span class=\"iTxt\">Emān</span>; that they must not listen to what is unlawful to hear, and such matters are of its deeds, which is of <span class=\"iTxt\">Emān</span>. ",
            "Allah<sup>azwj</sup> has Made it Obligatory for the eyes not to look at things He<sup>azwj</sup> has Made unlawful to look at and to stay away from what Allah<sup>azwj</sup> has Prohibited of the things that are not lawful for them. Such things are of their deeds and of <span class=\"iTxt\">Emān</span>. ",
            "Allah<sup style=\"font-weight: normal\">azwj</sup> has Said, <span class=\"ibTxt\">‘(O Muhammad</span><sup class=\"ibTxt\">saww</sup><span class=\"ibTxt\">), tell the believing men to cast down their eyes and guard their carnal desires.’ <a href=\"/#/books/quran:24#h30\">[24:30]</a> </span>",
            "Allah<sup>azwj</sup> has Prohibited looking at the privacy of one’s brother and to keep one’s privacy protected from the onlookers.",
            "Allah has said, ‘ ... <span class=\"ibTxt\">Tell the believing woman to cast down their eyes, guard their chastity (private parts).’ <a href=\"/#/books/quran:24#h31\">[24:31]</a></span>",
            "‘They must find protection against being looked upon and keep away from looking at their sisters (private parts). The Imam<sup>asws</sup> said that everywhere in the Holy Quran where protection of private parts is mentioned it is a reference to fornication except this verse which is a reference to looking.",
            "‘Allah<sup style=\"font-weight: normal\">azwj</sup> has Spoken about the obligations of the heart, tongue, ears and eyes in another verse also: <span class=\"ibTxt\">‘You did not (think to) hide your deeds from your ears, eyes and skin and you felt that Allah would not know all that you had been doing.’ <a href=\"/#/books/quran:41#h22\">[41:22]</a> </span>",
            "(Here) Skin is a reference to private parts and thighs. Allah<sup style=\"font-weight: normal\">azwj</sup> has Said, <span class=\"ibTxt\">‘Do not follow what you do not know; the ears, eyes, and hearts will all be held responsible for their deeds.’ <a href=\"/#/books/quran:17#h36\">[17:36]</a></span>",
            "This is what Allah<sup>azwj</sup> has Made Obligatory for the eyes; to cast down away from what Allah<sup>azwj</sup> has Prohibited. This is their deed and it is of <span class=\"iTxt\">Emān</span>. ",
            "Allah<sup>azwj</sup> has Made it Obligatory for the hands not to move to what Allah<sup>azwj</sup> has Prohibited, instead move forward for what Allah<sup>azwj</sup> has Commanded to move to such as charity, good relation with relatives and striving for the Cause of Allah<sup>azwj</sup> and cleansing for prayer.",
            "Allah<sup style=\"font-weight: normal\">azwj</sup> has Said, <span class=\"ibTxt\">‘Momins, when you are about to pray, wash your face and your hands along with the elbows and wipe your head and your feet to the ankles .... ‘ <a href=\"/#/books/quran:5#h6\">[5:6]</a> </span>",
            "Allah<sup>azwj</sup> has Said, <span class=\"ibTxt\">‘If you encounter the unMomins in a battle, strike-off their heads. Take them as captives when they are defeated. Then you may set them free as a favour to them, with or without a ransom, when the battle is over. ... ‘ <a href=\"/#/books/quran:47#h4\">[47:4]</a> </span>",
            "This is what Allah<sup>azwj</sup> has Made Obligatory for the hands; striking is their task. ",
            "Allah<sup>azwj</sup> has Made it Obligatory for the legs not to walk to what is made unlawful and in disobedience to Allah<sup>azwj</sup>. He<sup>azwj</sup> has Made it obligatory for them to walk to what makes Allah<sup>azwj</sup> Happy. Allah<sup>azwj</sup> has Said, <span class=\"ibTxt\">‘Do not walk proudly on the earth; your feet cannot tear apart the earth nor are you as tall as the mountains.’ <a href=\"/#/books/quran:17#h37\">[17:37]</a> ‘Do not walk around inflated with pride; be moderate in your walking and your talking. The most unpleasant sound is the braying of donkeys.’ (31: 19) </span>",
            "About the testifying of the hands and legs against their own selves and their master for their disregard of the commands of Allah<sup style=\"font-weight: normal\">azwj</sup> and the obligation upon them, Allah has Said: ‘ ... <span class=\"ibTxt\">this Day, We seal their mouths and their hands will speak to Us and their feet will testify to what they had achieved.’ <a href=\"/#/books/quran:36#h65\">[36:65]</a> </span>",
            "This is also what Allah<sup>azwj</sup> has Made obligatory for the hands and the legs and this is their deed and it is of <span class=\"iTxt\">Emān</span>. ",
            "Allah<sup style=\"font-weight: normal\">azwj</sup> has Made it obligatory for the face to prostrate before Him<sup style=\"font-weight: normal\">azwj</sup> in the days and nights in the times of the prayers. Allah<sup style=\"font-weight: normal\">azwj</sup> has Said, <span class=\"ibTxt\">‘Momins, worship your Lord, bow down and prostrate yourselves before Him and do virtuous deeds so that perhaps you will have everlasting happiness.’ <a href=\"/#/books/quran:22#h77\">[22:77]</a> </span>",
            "This is an obligation that involves the face, hands and legs. In another passage Allah<sup>azwj</sup> has said, <span class=\"ibTxt\">‘All the parts of the body to be placed on the ground during prostration belong to Allah. Do not prostrate before anyone other than Him .... ‘ (72: 18)</span> It was in regards to the obligations upon the parts of the body in the form of purification for prayer that Allah<sup>azwj</sup> Made His<sup>azwj</sup> Prophet<sup>saww</sup> to change facing the Holy House in Palestine to facing al-Kabah. Allah<sup>azwj</sup> revealed this: <span class=\"ibTxt\">‘Allah did not want to make your previous Emān (Salat) worthless; Allah is Compassionate and All-Merciful to people.’ <a href=\"/#/books/quran:2#h143\">[2:143]</a> </span>",
            "Allah<sup>azwj</sup> has Called Salat ‘<span class=\"iTxt\">Emān</span>.’ Therefore, whoever meets Allah<sup>azwj</sup> perfecting his <span class=\"iTxt\">Emān</span> is of the people of paradise. Whoever cheats in any of the obligations or violates the Commands of Allah<sup>azwj</sup> will meet Allah<sup>azwj</sup> with a defective <span class=\"iTxt\">Emān</span>.",
            "I then asked the Imam<sup style=\"font-weight: normal\">asws</sup>, ‘I now understand perfect and defective <span class=\"iTxt\">Emān</span>. How does the <span class=\"iTxt\">Emān</span> increases or (decreases) come from?’ The Imam<sup style=\"font-weight: normal\">asws</sup> said, ‘Consider the Words of Allah<sup style=\"font-weight: normal\">azwj</sup> <span class=\"ibTxt\">‘When a Chapter (of the Quran) is revealed, certain people ask others, ‘Whose Emān among you people has received strength from this (revelation)?’ It (the revelation) certainly strengthens the Emān of the Momins and they consider it to be glad news. (9: 124) But to those whose hearts are sick, it adds more filth to their hearts and they die as unMomins.’ (9: 125)</span> Allah<sup style=\"font-weight: normal\">azwj</sup> has Said, ‘<span class=\"ibTxt\">We tell you this story for a genuine purpose. They were young people who believed in their Lord and We gave them further guidance.’ (18: 13) </span>",
            "Had <span class=\"iTxt\">Emān</span> been the same and without any difference in defects and in perfections no one of them would have had any distinction over the others and the favours would have been equal to all. People had been all equal and excellence would become void. However, with perfection in <span class=\"iTxt\">Emān</span> makes <span class=\"iTxt\">Momin</span>s to enter paradise. By increase in <span class=\"iTxt\">Emān</span> the <span class=\"iTxt\">Momin</span>s excel in degrees before Allah<sup>azwj</sup> and for the defect in <span class=\"iTxt\">Emān</span> the mischievous go in fire’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Bakr ibn Salih from al-Qasim ibn Burayd who has said that narrated to us abu ‘Amr al-Zubayri who has said the following: “I said to abu ‘Abd Allah (a.s.) ‘O scholar, tell me which deed is more virtuous before Allah?’ He said, ‘It is the deed without which Allah does not accept any (deed).’ I asked, ‘What is such a thing?’ He said, ‘Belief in Allah besides whom no one deserves to be worshipped. It (belief) is the highest in degree among the deeds, the most valuable among them and the topmost among them in (matters of) reward.’ I then said, ‘Please, tell me then about belief, is it deeds or it is words without deeds?’ “He said, ‘All of belief is deeds and certain parts of such deeds are words. Allah has made it obligatory as is explained in His book. Its light is clear, its evidence well established. The (Holy) book testifies to it for one, and calls one to it.’ I (the narrator) then asked, ‘May Allah keep my soul in service for your cause, explain it to me so I may understand.’ He (the Imam) said, ‘Belief is of degrees, conditions, levels and stages. Of belief there is that which is perfect and complete in perfection. Of belief there is that which is defective and the defect is clear. Of belief there is that which is heavier on the perfection side.’ I then asked, ‘Does belief become perfect, decrease and increase?’ He said, ‘Yes, it does.’ I then asked, ‘How does it happen?’ He said, ‘It is because Allah, the Most Blessed, the Most High, has written belief for each part of the body of the children of Adam and has divided and distributed it among them. There is no part of thier body but that has a guard of belief different from such guard assigned to other parts. Of such part is one’s heart, with which one understands and reasons to comprehend, and it is the commander of his body. It oversees the body and without its opinion no part moves to act. Of the parts of the body are one’s eyes with which one sees and his ears with which one listens. There are one’s hands with which one works, one’s legs with which one walks, one’s sexual organs from which comes carnal desires, one’s tongue with which one speaks and one’s head on which there is one’s face. For each of these parts a different guard of belief is assigned. It is all due to what Allah, Most Blessed is Whose name, has written, to which His Holy book speaks and testifies. ‘For each of these parts a different obligation is written. The obligation of the heart is different from the obligation of the ears. What is made obligatory for the ears is different from the obligation of the eyes and what is made obligatory for the eyes is different from what is made obligatory for the tongue. What is made obligatory for the tongue is different from what is made obligatory for the hands and what is made obligatory for the hands is different from what is made obligatory for the legs. The obligation of the legs is different from the obligations of the sexual organs. What is obligatory for the sexual organs is different from the obligation of the face. ‘What is made obligatory for the heart of belief is affirmation, recognition and the formation of belief, consent and submission to the fact that no one deserves to be worshipped except Allah Who is One and has no partner. He is the One and only. He has not taken any companion and children. That Muhammad is His servant and messenger, he and his family being recipients of Divine supreme covenant, and to affirm that whatever he has brought is from Allah, be it about a prophet or a book. That is what Allah has made obligatory for the heart; the task of affirmation and recognition, which is its deed. This is stated in the words of Allah, the Most Majestic, the Most Holy, “. . . but his heart is confident about his faith. However, those whose breasts have become open to disbelief will be subject to the wrath of Allah and will suffer a great torment.” (16: 106) ‘Allah has said, “. . . Remembrance (speaking) of Allah certainly brings comfort to all hearts.” <a href=\"/#/books/quran:13#h28\">[13:28]</a> ‘Allah has said, “. . . They only say that they believe but, in fact, they have no faith in their hearts. . . .” <a href=\"/#/books/quran:5#h41\">[5:41]</a> ‘Allah has said, ‘‘Allah will call you to account for all that you may reveal from your souls and all that you may conceal. Allah will forgive or punish whoever He wants. . . .” <a href=\"/#/books/quran:2#h284\">[2:284]</a> ‘These are what Allah, the Most Majestic, the Most Holy, has made obligatory on the hearts of affirmation and recognition, and these are its deeds and this is the head of the belief. ‘On the tongue Allah has made it obligatory to speak and express what the heart has established and has confirmed as Allah, the Most Blessed, the Most High, has said, “ . . . that they should speak righteous words to people . . .” <a href=\"/#/books/quran:2#h83\">[2:83]</a> ‘Allah has said, “Tell them, we believe in Allah and in what is revealed to us and to you. Our Lord and your Lord are one. We have submitted ourselves to His will.” <a href=\"/#/books/quran:29#h46\">[29:46]</a> ‘This is what Allah has made obligatory for the tongue and this is its deed. He has made it obligatory for the ears to keep it clean from what is unlawful to listen to, and to keep away from things that Allah, the Most Majestic, the Most Holy, has prohibited to listen to attentively; it angers Allah, the Most Majestic, the Most Holy. And in this regard He has said, “Allah has told you (believers) in the Book that when you hear people disbelieving and mocking Allah’s revelations, do not sit with them unless they change the subject . . .” (4: 140) ‘Allah, the Most Majestic, the Most Holy, then has made an exception for the case of forgetfulness, ‘If Satan causes you to forget this, do not sit with the unjust people when you recall.” ( 6 : 68 ) ‘Allah has also said, “(Muhammad), give the glad news to those of My servants who listen to the words and follow only the best ones. Tell them that they are those whom Allah has guided. They are the people of understanding.” <a href=\"/#/books/quran:39#h18\">[39:18]</a> ‘Allah, the Most Majestic, the Most Holy, has said, “Triumphant indeed are the believers, <a href=\"/#/books/quran:23#h1\">[23:1]</a> who are submissive to Allah in their prayers, <a href=\"/#/books/quran:23#h2\">[23:2]</a> who avoid impious talks <a href=\"/#/books/quran:23#h3\">[23:3]</a> and pay al- Zakat (charity).” <a href=\"/#/books/quran:23#h4\">[23:4]</a> ‘Allah has said, “When they hear impious words, they ignore them, saying, ‘We shall be responsible for our deeds and you will be responsible for yours. . . <a href=\"/#/books/quran:28#h55\">[28:55]</a> ‘Allah has said, “. . . when they come across something impious, they pass it by nobly.” <a href=\"/#/books/quran:25#h72\">[25:72]</a> ‘This is what Allah has made obligatory for the ears in relation to belief; that they must not listen to what is unlawful to listen to, and such matters are of its deeds, which is of belief. He has made it obligatory for the eyes not to look at things He has made unlawful to look at and to stay away from what Allah has prohibited of the things that are not lawful for them. Such things are of their deeds and of belief. ‘Allah, the Most Blessed, the Most High, has said, “(Muhammad), tell the believing men to cast down their eyes and guard their carnal desires.” <a href=\"/#/books/quran:24#h30\">[24:30]</a> ‘Allah has prohibited looking at the privacy of one’s brother and to keep one’s privacy protected from the onlookers. Allah has said, “. . .Tell the believing woman to cast down their eyes, guard their chastity (private parts).” <a href=\"/#/books/quran:24#h31\">[24:31]</a> ‘They must find protection against being looked upon and keep away from looking at their sisters (private parts). The Imam said that everywhere in the Holy Quran where protection of private parts is mentioned it is a reference to fornication except this verse which is a reference to looking. ‘Allah has spoken about the obligations of the heart, tongue, ears and eyes in another verse also: “You did not (think to) hide your deeds from your ears, eyes and skin and you felt that Allah would not know all that you had been doing.” (41 :22) ‘Skin is reference to private parts and thighs. Allah has said, “Do not follow what you do not know; the ears, eyes, and hearts will all be held responsible for their deeds.” <a href=\"/#/books/quran:17#h36\">[17:36]</a> ‘This is what Allah has made obligatory for the eyes; to cast down away from what Allah, the Most Majestic, the Most Holy, has prohibited. This is their deed and it is of belief. Allah has made it obligatory for the hands not to move to what He has prohibited, instead move to what Allah, the Most Majestic, the Most Holy, has commanded to move to such as charity, good relation with relatives and striving for the cause of Allah and cleansing for prayer. ‘Allah has said, “Believers, when you are about to pray, wash your face and your hands along with the elbows and wipe your head and your feet to the ankles. . . .” <a href=\"/#/books/quran:5#h6\">[5:6]</a> ‘Allah has said, “If you encounter the unbelievers in a battle, strike-off their heads. Take them as captives when they are defeated. Then you may set them free as a favor to them, with or without a ransom, when the battle is over. . . .” <a href=\"/#/books/quran:47#h4\">[47:4]</a> ‘This is what Allah has made obligatory for the hands; striking is their task. Allah has made it obligatory for the legs not to walk to what is made unlawful and in disobedience to Allah. He has made it obligatory for them to walk to what makes Allah, the Most Majestic, the Most Holy, happy. Allah has said, “Do not walk proudly on the earth; your feet cannot tear apart the earth nor are you as tall as the mountains.” <a href=\"/#/books/quran:17#h37\">[17:37]</a> “Do not walk around inflated with pride; be moderate in your walking and your talking. The most unpleasant sound is the braying of donkeys.” <a href=\"/#/books/quran:31#h19\">[31:19]</a> ‘About the testifying of the hands and legs against their ownselves and their master for their disregard of the commands of Allah, the Most Majestic, the Most Holy, and the obligation upon them, Allah has said: “. . . this Day, We seal their mouths and their hands will speak to Us and their feet will testify to what they had achieved.” <a href=\"/#/books/quran:36#h65\">[36:65]</a> ‘This also is what Allah has made obligatory for the hands and the legs and this is their deed and it is of belief. Allah has made it obligatory for the face to prostrate before Him in the days and nights in the times of the prayers. Allah has said, “Believers, worship your Lord, bow down and prostrate yourselves before Him and do virtuous deeds so that perhaps you will have everlasting happiness.” <a href=\"/#/books/quran:22#h77\">[22:77]</a> ‘This is an obligation that involves the face, hands and legs. In another passage He has said, ‘All the parts of the body to be placed on the ground during prostration belong to Allah. Do not prostrate before anyone other than Him. . . .” <a href=\"/#/books/quran:72#h18\">[72:18]</a> It was in regards to the obligations upon the parts of the body in the form of purification for prayer that Allah, the Most Majestic, the Most Holy, made His prophet to change facing the Holy House in Palestine to facing al-Ka’ba. Allah, the Most Majestic, the Most Holy, revealed this: “Allah did not want to make your previous belief (prayers) worthless; Allah is Compassionate and All- Merciful to people.” <a href=\"/#/books/quran:2#h143\">[2:143]</a> He has called prayer ‘Belief.’ Therefore, whoever meets Allah, the Most Majestic, the Most Holy, perfecting his belief is of the people of paradise. Whoever cheats in any of the obligations or violates the commands of Allah, the Most Majestic, the Most Holy, will meet Allah, the Most Majestic, the Most Holy, with a defective belief.’ “I then asked the Imam, ‘I now understand perfect and defective belief. Where does the increase in belief come from?’ The Imam said, ‘Consider the words of Allah, the Most Majestic, the Most Holy, “When a Chapter (of the Quran) is revealed, certain people ask others, ‘Whose belief among you people has received strength from this (revelation)?’ It (the revelation) certainly strengthens the belief of the believers and they consider it to be glad news. <a href=\"/#/books/quran:9#h124\">[9:124]</a> But to those whose hearts are sick, it adds more filth to their hearts and they die as unbelievers.” <a href=\"/#/books/quran:9#h125\">[9:125]</a> Allah has said, “. . .We tell you this story for a genuine purpose. They were young people who believed in their Lord and We gave them further guidance.” <a href=\"/#/books/quran:18#h13\">[18:13]</a> ‘Had belief been the same and without any difference in defects and in perfections no one of them would have had any distinction over the others and the favors would have been equal to all. People had been all equal and excellence would become void. However, with perfection in belief believers enter paradise. By increase in belief the believers excel in degrees before Allah and for the defect in belief the extremists go in fire.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (242/ 7)"
        ],
        "index": 1515,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:18:2",
        "relations": {
          "Mentions": [
            "/books/quran:17:36"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى جَمِيعاً عَنِ الْبَرْقِيِّ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى بْنِ عِمْرَانَ الْحَلَبِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ [الْحَسَنِ عَنِ الْحَسَنِ بْنِ] هَارُونَ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ السَّمْعَ وَ الْبَصَرَ وَ الْفُؤادَ كُلُّ أُولئِكَ كانَ عَنْهُ مَسْؤُلًا قَالَ يُسْأَلُ السَّمْعُ عَمَّا سَمِعَ وَ الْبَصَرُ عَمَّا نَظَرَ إِلَيْهِ وَ الْفُؤَادُ عَمَّا عَقَدَ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, and Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, altogether from Al Barqy, from Al Nazar Bin Suweyd, from Yahya Bin Imran Al Halby, from Ubeydullah Bin Al Hassan, from Al Hassan Bin Haroun who said, ",
            "‘Abu Abdullah<sup>asws</sup> said to me ‘The hearing, and the vision, and the heart, they would be Questioned. The hearing would be Questioned about what it heard, and the vision about what it looked at, and the heart about what it held on to’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father. And Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa all have narrated from al-Barqi from al-Nadr ibn Suwayd from Yahya ibn ‘Imran al-Halabi from ‘Ubayd Allah ibn al-Hassan from al- Hassan ibn Harun who has said the following: “Once abu ‘Abd Allah (a.s.) said to me, ‘It is of certainty that the ears, eyes and heart will all be questioned. ’<a href=\"/#/books/quran:17#h36\">[17:36]</a> He said, ‘The ears will be questioned about what they have heard, the eyes will be questioned about what they have looked upon and the heart will be questioned about what it has established as belief.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/243)"
        ],
        "index": 1516,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:18:3",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ أَوْ غَيْرِهِ عَنِ الْعَلَاءِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الْإِيمَانِ فَقَالَ شَهَادَةُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ [وَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ] وَ الْإِقْرَارُ بِمَا جَاءَ مِنْ عِنْدِ اللَّهِ وَ مَا اسْتَقَرَّ فِي الْقُلُوبِ مِنَ التَّصْدِيقِ بِذَلِكَ ",
          "قَالَ قُلْتُ الشَّهَادَةُ أَ لَيْسَتْ عَمَلًا قَالَ بَلَى قُلْتُ الْعَمَلُ مِنَ الْإِيمَانِ قَالَ نَعَمْ الْإِيمَانُ لَا يَكُونُ إِلَّا بِعَمَلٍ وَ الْعَمَلُ مِنْهُ وَ لَا يَثْبُتُ الْإِيمَانُ إِلَّا بِعَمَلٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abul Jabbar, from Safwan, or someone else, from Al A’ala, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup>, said, ‘I asked him<sup style=\"font-weight: normal\">asws</sup> about the <span class=\"iTxt\">Emān</span>. So he<sup style=\"font-weight: normal\">asws</sup> said: ‘The testimony that there is no god except for Allah<sup style=\"font-weight: normal\">azwj</sup> and that Muhammad<sup style=\"font-weight: normal\">saww</sup> is His<sup style=\"font-weight: normal\">azwj</sup> Rasool<sup style=\"font-weight: normal\">saww</sup>, and the acknowledgement with whatever he<sup style=\"font-weight: normal\">saww</sup> came with from the Presence of Allah<sup style=\"font-weight: normal\">azwj</sup>, and what settles in the hearts from the ratification of that’. ",
            "He (the narrator) said, ‘I said, ‘The testimony, is it not a deed?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘Yes’. I said, ‘The deeds is from the <span class=\"iTxt\">Emān</span>?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘Yes, the <span class=\"iTxt\">Emān</span> cannot happen to be except with a deed, and the deed is from it, and the <span class=\"iTxt\">Emān</span> is not affirmed except with a deed’."
          ],
          "en.sarwar": [
            "3. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan or one other than him from al-‘Ala’ from Muhammad ibn Muslim who has said the following: “Once I asked abu ‘Abd Allah (a.s.) about belief. He said, ‘It is to testify that no one deserves to be worshipped except Allah, Muhammad (a.s.) is the Messenger of Allah and to affirm that whatever he (Muhammad) brought is from Allah. That which is established in the hearts through acknowledgement of such facts is belief.’ I then asked, ‘Is it not that the testimony is a deed?’ He said, ‘Yes, it is a deed.’ I then asked, ‘Is the deed of belief?’ He said, ‘Yes, belief does not shape up without deed. The deed is from belief and belief cannot stand firmly without deed. ’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/244)"
        ],
        "index": 1517,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:18:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ مَا الْإِسْلَامُ فَقَالَ دِينُ اللَّهِ اسْمُهُ الْإِسْلَامُ وَ هُوَ دِينُ اللَّهِ قَبْلَ أَنْ تَكُونُوا حَيْثُ كُنْتُمْ وَ بَعْدَ أَنْ تَكُونُوا فَمَنْ أَقَرَّ بِدِينِ اللَّهِ فَهُوَ مُسْلِمٌ وَ مَنْ عَمِلَ بِمَا أَمَرَ اللَّهُ عَزَّ وَ جَلَّ بِهِ فَهُوَ مُؤْمِنٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from Abdullah Bin Muskan, from one of his companions, ",
            "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup>, said, ‘I said to him<sup style=\"font-weight: normal\">asws</sup>, ‘What is Al-<span class=\"iTxt\">Islām</span>?’ So He<sup style=\"font-weight: normal\">asws</sup> said: ‘Religion of Allah<sup style=\"font-weight: normal\">azwj</sup>. It’s name is Al-<span class=\"iTxt\">Islām</span>, and it was the Religion of Allah<sup style=\"font-weight: normal\">azwj</sup> before you happened to be, where you are, and after you. So the one who acknowledges by the Religion of Allah<sup style=\"font-weight: normal\">azwj</sup>, so he is a Muslim, and the one who acts in accordance with whatever Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic Commanded with, so he is <span class=\"iTxt\">‘Momin’</span> (a Believer)’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ‘Uthman ibn ‘Isa from ‘Abd Allah ibn Muskan from certain individuals of his people who has said the following: “I asked abu ‘Abd Allah (a.s.) ‘What is Islam?’ He said, ‘It is the name of the religion of Allah. It was the religion of Allah before you were as you are now and after you it will be there. Whoever professes the religion of Allah, is a Muslim. Whoever does what Allah, the Most Majestic, the Most Holy, has commanded, is a believer.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (244/ 7)"
        ],
        "index": 1518,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:18:5",
        "text": [
          "عَنْهُ عَنْ أَبِيهِ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى بْنِ عِمْرَانَ الْحَلَبِيِّ عَنْ أَيُّوبَ بْنِ الْحُرِّ عَنْ أَبِي بَصِيرٍ قَالَ كُنْتُ عِنْدَ أَبِي جَعْفَرٍ ( عليه السلام ) فَقَالَ لَهُ سَلَّامٌ إِنَّ خَيْثَمَةَ ابْنَ أَبِي خَيْثَمَةَ يُحَدِّثُنَا عَنْكَ أَنَّهُ سَأَلَكَ عَنِ الْإِسْلَامِ فَقُلْتَ لَهُ إِنَّ الْإِسْلَامَ مَنِ اسْتَقْبَلَ قِبْلَتَنَا وَ شَهِدَ شَهَادَتَنَا وَ نَسَكَ نُسُكَنَا وَ وَالَى وَلِيَّنَا وَ عَادَى عَدُوَّنَا فَهُوَ مُسْلِمٌ فَقَالَ صَدَقَ خَيْثَمَةُ قُلْتُ وَ سَأَلَكَ عَنِ الْإِيمَانِ فَقُلْتَ الْإِيمَانُ بِاللَّهِ وَ التَّصْدِيقُ بِكِتَابِ اللَّهِ وَ أَنْ لَا يُعْصَى اللَّهُ فَقَالَ صَدَقَ خَيْثَمَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from his father, from Al Nazar Bin Suweyd, from Yahya Bin Imran Al Halby, from Ayoub Bin Al Hurr, from Abu Baseer who said, ",
            "‘I was in the presence of Abu Ja’far<sup style=\"font-weight: normal\">asws</sup>, so Sallam said to him<sup style=\"font-weight: normal\">asws</sup>, ‘Khaysama Ibn Abu Khaysama narrated from you<sup style=\"font-weight: normal\">asws</sup> that he asked you<sup style=\"font-weight: normal\">asws</sup> about Al-<span class=\"iTxt\">Islām</span>. So you<sup style=\"font-weight: normal\">asws</sup> said to him: ‘Al-<span class=\"iTxt\">Islām</span> is from the acceptance of our<sup style=\"font-weight: normal\">asws</sup> Qiblah, and testify ‘شَهَادَتَنَا’ our<sup style=\"font-weight: normal\">asws</sup> testimonies, and performing our<sup style=\"font-weight: normal\">asws</sup> rituals, and befriend our<sup style=\"font-weight: normal\">asws</sup> friends, and be inimical to our<sup style=\"font-weight: normal\">asws</sup> enemies, so (only then) he become a Muslim’. So he<sup style=\"font-weight: normal\">asws</sup> said: ‘Khaysama spoke the truth’. I said, ‘And he asked you<sup style=\"font-weight: normal\">asws</sup> about the <span class=\"iTxt\">Emān</span>, so you<sup style=\"font-weight: normal\">asws</sup> said: ‘The <span class=\"iTxt\">Emān</span> in Allah<sup style=\"font-weight: normal\">azwj</sup>, and the ratification with the Book of Allah<sup style=\"font-weight: normal\">azwj</sup>, and that he would not disobey Allah<sup style=\"font-weight: normal\">azwj</sup>’. So he<sup style=\"font-weight: normal\">asws</sup> said: ‘Khaysama spoke the truth’."
          ],
          "en.sarwar": [
            "5. From him from his father from al-Nadr ibn Suwayd from Yahya ibn ‘Imran al- Halabi from Ayyub ibn al-Hurr from abu Basir who has said the following: “I was in the presence of abu Ja’far (a.s.) when Salam said, ‘Khaythamah ibn abu Khaythamah narrates to us from you that you were asked about Islam and you said, ‘Islam is this: Whoever faces our Qibla (direction of Makka), testifies to our testiment of belief, practices our practice, is a friend of our friend and an enemy of our enemies, he is a Muslim.’ The Imam said, ‘Khaythamah has told the truth. ’ 1 then said, ‘He had asked you about belief and you said, ‘It is belief in Allah, to acknowledge the book of Allah and not to disobey Allah.’ He said, ‘Khaythamah has told the truth.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/246)"
        ],
        "index": 1519,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:18:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْإِيمَانِ فَقَالَ شَهَادَةُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ قَالَ قُلْتُ أَ لَيْسَ هَذَا عَمَلٌ قَالَ بَلَى قُلْتُ فَالْعَمَلُ مِنَ الْإِيمَانِ قَالَ لَا يَثْبُتُ لَهُ الْإِيمَانُ إِلَّا بِالْعَمَلِ وَ الْعَمَلُ مِنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Abu Umeyr, from Jameel Bin Darraj who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the <span class=\"iTxt\">Emān</span>, so he<sup>asws</sup> said: ‘The testimony that there is no God except for Allah<sup>azwj</sup> and that Muhammad<sup>saww</sup> is Rasool<sup>saww</sup> of Allah<sup>azwj</sup>’. I said, ‘Is this not a deed?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘So the deed is from the <span class=\"iTxt\">Emān</span>?’ He<sup>asws</sup> said: ‘The <span class=\"iTxt\">Emān</span> would not be affirmed for him except with the deed, and the deed is from it’ (the <span class=\"iTxt\">Emān</span>)."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn abu ‘Umayr from Jamil ibn Darraj who has said the following: “I asked abu ‘Abd Allah (a.s.) about belief. He said, ‘It is to testify that no one deserves to be worshipped except Allah and that Muhammad (a.s.) is the Messenger of Allah.’ I asked, ‘Is it not a deed?’ He said, ‘Yes, it is a deed.’ 1 then asked, ‘Is deed of belief?’ He said, ‘One’s belief does not take any root without deed and deed is from belief.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/246)"
        ],
        "index": 1520,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:18:7",
        "text": [
          "بَعْضُ أَصْحَابِنَا عَنْ عَلِيِّ بْنِ الْعَبَّاسِ عَنْ عَلِيِّ بْنِ مُيَسِّرٍ عَنْ حَمَّادِ بْنِ عَمْرٍو النَّصِيبِيِّ قَالَ سَأَلَ رَجُلٌ الْعَالِمَ ( عليه السلام ) فَقَالَ أَيُّهَا الْعَالِمُ أَخْبِرْنِي أَيُّ الْأَعْمَالِ أَفْضَلُ عِنْدَ اللَّهِ قَالَ مَا لَا يُقْبَلُ عَمَلٌ إِلَّا بِهِ فَقَالَ وَ مَا ذَلِكَ قَالَ الْإِيمَانُ بِاللَّهِ الَّذِي هُوَ أَعْلَى الْأَعْمَالِ دَرَجَةً وَ أَسْنَاهَا حَظّاً وَ أَشْرَفُهَا مَنْزِلَةً",
          "قُلْتُ أَخْبِرْنِي عَنِ الْإِيمَانِ أَ قَوْلٌ وَ عَمَلٌ أَمْ قَوْلٌ بِلَا عَمَلٍ قَالَ الْإِيمَانُ عَمَلٌ كُلُّهُ وَ الْقَوْلُ بَعْضُ ذَلِكَ الْعَمَلِ بِفَرْضٍ مِنَ اللَّهِ بَيَّنَهُ فِي كِتَابِهِ وَاضِحٍ نُورُهُ ثَابِتَةٍ حُجَّتُهُ يَشْهَدُ بِهِ الْكِتَابُ وَ يَدْعُو إِلَيْهِ قُلْتُ صِفْ لِي ذَلِكَ حَتَّى أَفْهَمَهُ",
          "فَقَالَ إِنَّ الْإِيمَانَ حَالَاتٌ وَ دَرَجَاتٌ وَ طَبَقَاتٌ وَ مَنَازِلُ فَمِنْهُ التَّامُّ الْمُنْتَهَى تَمَامُهُ وَ مِنْهُ النَّاقِصُ الْمُنْتَهَى نُقْصَانُهُ وَ مِنْهُ الزَّائِدُ الرَّاجِحُ زِيَادَتُهُ قُلْتُ وَ إِنَّ الْإِيمَانَ لَيَتِمُّ وَ يَزِيدُ وَ يَنْقُصُ قَالَ نَعَمْ قُلْتُ وَ كَيْفَ ذَلِكَ",
          "قَالَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى فَرَضَ الْإِيمَانَ عَلَى جَوَارِحِ بَنِي آدَمَ وَ قَسَّمَهُ عَلَيْهَا وَ فَرَّقَهُ عَلَيْهَا فَلَيْسَ مِنْ جَوَارِحِهِمْ جَارِحَةٌ إِلَّا وَ هِيَ مُوَكَّلَةٌ مِنَ الْإِيمَانِ بِغَيْرِ مَا وُكِّلَتْ بِهِ أُخْتُهَا",
          "فَمِنْهَا قَلْبُهُ الَّذِي بِهِ يَعْقِلُ وَ يَفْقَهُ وَ يَفْهَمُ وَ هُوَ أَمِيرُ بَدَنِهِ الَّذِي لَا تُورَدُ الْجَوَارِحُ وَ لَا تَصْدُرُ إِلَّا عَنْ رَأْيِهِ وَ أَمْرِهِ وَ مِنْهَا يَدَاهُ اللَّتَانِ يَبْطِشُ بِهِمَا وَ رِجْلَاهُ اللَّتَانِ يَمْشِي بِهِمَا وَ فَرْجُهُ الَّذِي الْبَاهُ مِنْ قِبَلِهِ وَ لِسَانُهُ الَّذِي يَنْطِقُ بِهِ الْكِتَابُ وَ يَشْهَدُ بِهِ عَلَيْهَا وَ عَيْنَاهُ اللَّتَانِ يُبْصِرُ بِهِمَا وَ أُذُنَاهُ اللَّتَانِ يَسْمَعُ بِهِمَا",
          "وَ فَرَضَ عَلَى الْقَلْبِ غَيْرَ مَا فَرَضَ عَلَى اللِّسَانِ وَ فَرَضَ عَلَى اللِّسَانِ غَيْرَ مَا فَرَضَ عَلَى الْعَيْنَيْنِ وَ فَرَضَ عَلَى الْعَيْنَيْنِ غَيْرَ مَا فَرَضَ عَلَى السَّمْعِ وَ فَرَضَ عَلَى السَّمْعِ غَيْرَ مَا فَرَضَ عَلَى الْيَدَيْنِ وَ فَرَضَ عَلَى الْيَدَيْنِ غَيْرَ مَا فَرَضَ عَلَى الرِّجْلَيْنِ وَ فَرَضَ عَلَى الرِّجْلَيْنِ غَيْرَ مَا فَرَضَ عَلَى الْفَرْجِ وَ فَرَضَ عَلَى الْفَرْجِ غَيْرَ مَا فَرَضَ عَلَى الْوَجْهِ",
          "فَأَمَّا مَا فَرَضَ عَلَى الْقَلْبِ مِنَ الْإِيمَانِ فَالْإِقْرَارُ وَ الْمَعْرِفَةُ وَ التَّصْدِيقُ وَ التَّسْلِيمُ وَ الْعَقْدُ وَ الرِّضَا بِأَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ أَحَداً صَمَداً لَمْ يَتَّخِذْ صَاحِبَةً وَ لَا وَلَداً وَ أَنَّ مُحَمَّداً ( صلى الله عليه وآله ) عَبْدُهُ وَ رَسُولُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "One of our companions, from Ali Bin Al Abbas, from Ali Bin Muyassar, from Hammad Bin Amro Al Nasaybi who said, ",
            "‘A man asked ‘الْعَالِمَ’(Al-Alim - the knowledgeable one<sup>asws</sup>, so he said, ‘O the ‘الْعَالِمَ’ knowledgeable one<sup>asws</sup>! Inform me, which of the deeds is the most superior in the Presence of Allah<sup>azwj</sup>?’ He<sup>asws</sup> said: ‘That without which a ‘deed’ cannot be Accepted’. So he asked, ‘And what is that?’ He<sup>asws</sup> said: ‘The <span class=\"iTxt\">Emān</span> in Allah<sup>azwj</sup> is that which is the highest of the deeds in levels, and its highest in share (Rewards), and its noblest is status’. ",
            "I said, ‘Inform me about the <span class=\"iTxt\">Emān</span>, is it a speech and a deed, or is it a speech without a deed?’ He<sup>asws</sup> said: ‘The <span class=\"iTxt\">Emān</span> is a deed, all of it, and the speech, some of that is the deed by an Imposition from Allah<sup>azwj</sup> Explained in His<sup>azwj</sup> Book. Its Light is clear, and its argument is affirm. The Book Testifies with it and calls towards Him<sup>azwj</sup>’. I said, ‘Described that to me until I understand it’. ",
            "So he<sup>asws</sup> said: ‘The <span class=\"iTxt\">Emān</span> has states, and levels, and layers, and status. So, from it is the complete, its completion being ultimate, and from it is the deficient, its deficiency being ultimate, and from it is the increase, its increase being pre-dominant’. I said, ‘Does the <span class=\"iTxt\">Emān</span> remain complete or it increases and decreases?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘And how is that?’ ",
            "He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Blessed and High Imposed the <span class=\"iTxt\">Emān</span> upon the body parts of the children of Adam<sup>as</sup>, and Distributed it upon them, and Separated it upon them. Thus, there is no body part from their body parts except that it has been Allocated from the <span class=\"iTxt\">Emān</span> with other than what its counterpart (Kufr) has been Allocated with. ",
            "So, from these is his heart by which he minds, and understands, and realises, and it is the commander in his body which the body parts can neither refute nor implement except from its view and its command. And from these are his two hands which he extends with, and his two legs which he walks with, and his private part which he copulates with, and his tongue through which he recites the Book and testifies upon it, and his two eyes which he visualizes with, and his two ears which he hears with.",
            "And He<sup>azwj</sup> Imposed upon the heart other than what He<sup>azwj</sup> Imposed upon the tongue; and He<sup>azwj</sup> Imposed upon the tongue with other than what He<sup>azwj</sup> Imposed upon the two eyes; and He<sup>azwj</sup> Imposed upon the two eyes with other than what He<sup>azwj</sup> Imposed upon the hearing; and He<sup>azwj</sup> Imposed upon the hearing with other than what He<sup>azwj</sup> Imposed upon the two hands; and He<sup>azwj</sup> Imposed upon the two hands with other than what He<sup>azwj</sup> Imposed upon the two legs; and He<sup>azwj</sup> Imposed upon the two legs with other than what He<sup>azwj</sup> Imposed upon the private part; and He<sup>azwj</sup> Imposed upon the private part with other that what He<sup>azwj</sup> Imposed upon the face.",
            "So, as for what Allah<sup style=\"font-weight: normal\">azwj</sup> Imposed upon the heart from the <span class=\"iTxt\">Emān</span>, so it is the acknowledgement, and the recognition, and the ratification, and the submission, and the oath, and the satisfaction with that there is no god except for Allah<sup style=\"font-weight: normal\">azwj</sup> Alone, there being no associates for Him<sup style=\"font-weight: normal\">azwj</sup>, One, Last, neither having Taken a companion nor a child, and that Muhammad<sup style=\"font-weight: normal\">saww</sup> is His<sup style=\"font-weight: normal\">azwj</sup> servant and His<sup style=\"font-weight: normal\">azwj</sup> Rasool<sup style=\"font-weight: normal\">saww</sup>’."
          ],
          "en.sarwar": [
            "7. Certain individuals of our people have narrated from Ali ibn ‘Abbas from Ali ibn Maysir from Hammad ibn al-Nusaybi who has said the following: “A man asked the scholar (a.s.) ‘O scholar, tell me which deed is more virtuous before Allah?’ He said, ‘It is the deed without which Allah does not accept any deed.’ He asked, ‘What is such thing?’ He said, ‘It is belief in Allah (besides Whom no one deserves to be worshipped). It (belief) is the highest in degree among the deeds, the most valuable among them (in virtue) and the topmost among them in reward.’ The man then said, ‘Please, tell me then about belief. Is it deeds or it is words without deeds?’ “The Imam said, ‘All of belief is deeds and parts of such deeds are words. Allah has made it obligatory as is explained in His book. Its light is clear, its evidence well established. The (Holy) book testifies to it for one, and calls one thereto.’ I (the narrator) then asked, ‘Explain it to me so I may understand.’ He (the Imam) said, ‘Belief is of degrees, conditions, levels and stages. Of belief there is that which is perfect and complete in perfection. Of belief there is that which is defective and the defect is clear. Of belief there is that which is heavier on the perfection side.’ The man then asked, ‘Does belief become perfect, decrease and increase?’ He said, ‘Yes, it does.’ The man then asked, ‘How does it happen?’ He said, ‘It is because Allah, the Most Blessed, the Most High, has written belief for each part of the body of the children of Adam and has divided and distributed it among them. There is no part of the parts but that has a guard of belief that is different from such guard as is assigned to other parts. Of such part is one’s heart with which one understands and rationalizes to comprehend, and he is the commander of one’s body. It oversees the body and without its opinion no part moves to act. Of the parts of the body are one’s hands with which one works, one’s legs with which one walks, one’s sexual organs from which come carnal desires, one’s tongue with which one speaks of the book and testfies thereby, one’s eyes with which one sees and one’s ears with which one listens. ‘For each of these parts a different obligation is written. The obligation of the heart is different from the obligation of the tongue. What is made obligatory for the tongue is different from the obligation of the eyes and what is made obligatory for the eyes is different from what is made obligatory for the ears. What is made obligatory for the ears is different from what is made obligatory for the hands and what is made obligatory for the hands is different from what is made obligatory for the legs. The obligation of the legs is different from the obligations of the sexual organs. What is obligatory for the sexual organs is different from the obligation of the face. ‘What is made obligatory for the heart of belief is affirmation, recognition and formation of belief, consent and submission to the fact that no one deserves to be worshipped except Allah Who is One and has no partner. He is the One and only Who deserves to be worshipped. He has not taken any companion and children. Muhammad (a.s.) is His servant and messenger.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (248/ 7)"
        ],
        "index": 1521,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:18:8",
        "text": [
          "مُحَمَّدُ بْنُ الْحَسَنِ عَنْ بَعْضِ أَصْحَابِنَا عَنِ الْأَشْعَثِ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ حَفْصِ بْنِ خَارِجَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ وَ سَأَلَهُ رَجُلٌ عَنْ قَوْلِ الْمُرْجِئَةِ فِي الْكُفْرِ وَ الْإِيمَانِ وَ قَالَ إِنَّهُمْ يَحْتَجُّونَ عَلَيْنَا وَ يَقُولُونَ كَمَا أَنَّ الْكَافِرَ عِنْدَنَا هُوَ الْكَافِرُ عِنْدَ اللَّهِ فَكَذَلِكَ نَجِدُ الْمُؤْمِنَ إِذَا أَقَرَّ بِإِيمَانِهِ أَنَّهُ عِنْدَ اللَّهِ مُؤْمِنٌ ",
          "فَقَالَ سُبْحَانَ اللَّهِ وَ كَيْفَ يَسْتَوِي هَذَانِ وَ الْكُفْرُ إِقْرَارٌ مِنَ الْعَبْدِ فَلَا يُكَلَّفُ بَعْدَ إِقْرَارِهِ بِبَيِّنَةٍ وَ الْإِيمَانُ دَعْوًى لَا تَجُوزُ إِلَّا بِبَيِّنَةٍ وَ بَيِّنَتُهُ عَمَلُهُ وَ نِيَّتُهُ فَإِذَا اتَّفَقَا فَالْعَبْدُ عِنْدَ اللَّهِ مُؤْمِنٌ ",
          "وَ الْكُفْرُ مَوْجُودٌ بِكُلِّ جِهَةٍ مِنْ هَذِهِ الْجِهَاتِ الثَّلَاثِ مِنْ نِيَّةٍ أَوْ قَوْلٍ أَوْ عَمَلٍ وَ الْأَحْكَامُ تَجْرِي عَلَى الْقَوْلِ وَ الْعَمَلِ فَمَا أَكْثَرَ مَنْ يَشْهَدُ لَهُ الْمُؤْمِنُونَ بِالْإِيمَانِ وَ يَجْرِي عَلَيْهِ أَحْكَامُ الْمُؤْمِنِينَ وَ هُوَ عِنْدَ اللَّهِ كَافِرٌ وَ قَدْ أَصَابَ مَنْ أَجْرَى عَلَيْهِ أَحْكَامَ الْمُؤْمِنِينَ بِظَاهِرِ قَوْلِهِ وَ عَمَلِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Hassan, from one of our companions, from Al Ash’as Bin Muhammad, from Muhammad Bin Hads Bin Kharjat who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying, and a man had asked him<sup>asws</sup> about the words of the Murjiites regarding the disbelief and the belief (<span class=\"iTxt\">Emān</span>), and he said, ‘They are arguing against us and are saying like, The dis<span class=\"iTxt\">Momin</span> amongst us is a dis<span class=\"iTxt\">Momin</span> in the Presence of Allah<sup>azwj</sup>, and similar to that, we find the <span class=\"iTxt\">Momin</span> when he acknowledges with his belief, he is a <span class=\"iTxt\">Momin</span> in the Presence of Allah<sup>azwj</sup>’.",
            "So he<sup style=\"font-weight: normal\">asws</sup> said: ‘Glory be to Allah<sup style=\"font-weight: normal\">azwj</sup>! And how can these two be the same, and the disbelief is an acknowledgement from the servant? So he would not be encumbered after his acknowlegement with (presenting) a proof. And the <span class=\"iTxt\">Emān</span> (belief) is a claim. It is not allowed except with proof, and its proof is his deed and his intention. So when they are concordant, so the servant would be a <span class=\"iTxt\">Momin</span> in the Presence of Allah<sup style=\"font-weight: normal\">azwj</sup>. ",
            "And the disbelief is present in every direction from these three directions – from an intention, or speech, or deed. And the Ordinances would flow upon the speech as well as from the deed. So how often the <span class=\"iTxt\">Momin</span>s testify for someone as having belief (<span class=\"iTxt\">Emān</span>), and the Ordinances of the <span class=\"iTxt\">Momin</span>s flow upon him, (but) he is a dis<span class=\"iTxt\">Momin</span> in the Presence of Allah<sup style=\"font-weight: normal\">azwj</sup>; and he would be correct, the one who applies the Ordinances of the <span class=\"iTxt\">Momin</span>s upon him (going by the) aparent of his words and his deeds’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn al-Hassan has narrated from certain individuals of our people from al-Ash’ath ibn Muhammad from Muhammad ibn Hafs ibn Kharija who has said the following: “I heard abu ‘Abd Allah (a.s.) saying - when a man asked him about the words of al-Murji’a, a religious sect, about rejection (disbelief) and belief -, ‘They argue against us and say, “Just as to us one who disbelieves is a rejecter of belief, so also is he in the sight of Allah. The same applies to a believer. We find a believer that when he affirms his belief he is a believer in the sight of Allah.” He (a.s.) said, “Glory belongs to Allah. How can these two be equal? Rejection of belief is an affirmation and confession of a servant, and thereafter he is not required to present any witness to prove his case. (On the other hand) belief is a claim, which is not accepted without the testimony of a witness. Witness to prove his case is his deed and intention. If they (deed and intention) agree, a servant is a believer in the sight of Allah. Rejection of belief exists in all the three things; word, deed and intention and rules of law apply to both word and deed. In of favor many persons believers testify to prove them to be believers and the rules of law applicable to believers are applied to them, but in the sight of Allah they are rejecters of belief. In certain conditions one’s applying rules of law, applicable to believers, to such unbelievers is also correct according to the apparent condition of his deed and words.’”” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:18",
  "kind": "verse_list"
}