{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 181"
        },
        "path": "/books/al-kafi:2:1:181",
        "titles": {
          "ar": "بَابُ ثُبُوتِ الْإِيمَانِ وَ هَلْ يَجُوزُ أَنْ يَنْقُلَهُ اللَّهُ",
          "en": "Chapter 181 – Affirmation of the Emān and is it allowed that Allah<sup>azwj</sup> would Transfer it"
        }
      }
    ],
    "index": 369,
    "local_index": 181,
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:181",
    "titles": {
      "ar": "بَابُ ثُبُوتِ الْإِيمَانِ وَ هَلْ يَجُوزُ أَنْ يَنْقُلَهُ اللَّهُ",
      "en": "Chapter 181 – Affirmation of the Emān and is it allowed that Allah<sup>azwj</sup> would Transfer it"
    },
    "verse_count": 1,
    "verse_start_index": 2912,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/235)"
        ],
        "index": 2913,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:181:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ حُسَيْنِ بْنِ نُعَيْمٍ الصَّحَّافِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) لِمَ يَكُونُ الرَّجُلُ عِنْدَ اللَّهِ مُؤْمِناً قَدْ ثَبَتَ لَهُ الْإِيمَانُ عِنْدَهُ ثُمَّ يَنْقُلُهُ اللَّهُ بَعْدُ مِنَ الْإِيمَانِ إِلَى الْكُفْرِ ",
          "قَالَ فَقَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ هُوَ الْعَدْلُ إِنَّمَا دَعَا الْعِبَادَ إِلَى الْإِيمَانِ بِهِ لَا إِلَى الْكُفْرِ وَ لَا يَدْعُو أَحَداً إِلَى الْكُفْرِ بِهِ فَمَنْ آمَنَ بِاللَّهِ ثُمَّ ثَبَتَ لَهُ الْإِيمَانُ عِنْدَ اللَّهِ لَمْ يَنْقُلْهُ اللَّهُ عَزَّ وَ جَلَّ بَعْدَ ذَلِكَ مِنَ الْإِيمَانِ إِلَى الْكُفْرِ ",
          "قُلْتُ لَهُ فَيَكُونُ الرَّجُلُ كَافِراً قَدْ ثَبَتَ لَهُ الْكُفْرُ عِنْدَ اللَّهِ ثُمَّ يَنْقُلُهُ بَعْدَ ذَلِكَ مِنَ الْكُفْرِ إِلَى الْإِيمَانِ ",
          "قَالَ فَقَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ خَلَقَ النَّاسَ كُلَّهُمْ عَلَى الْفِطْرَةِ الَّتِي فَطَرَهُمْ عَلَيْهَا لَا يَعْرِفُونَ إِيمَاناً بِشَرِيعَةٍ وَ لَا كُفْراً بِجُحُودٍ ثُمَّ بَعَثَ اللَّهُ الرُّسُلَ تَدْعُوا الْعِبَادَ إِلَى الْإِيمَانِ بِهِ فَمِنْهُمْ مَنْ هَدَى اللَّهُ وَ مِنْهُمْ مَنْ لَمْ يَهْدِهِ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Mahboub, from Husayn Bin Nuaym Al Sahhaf who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Why is it so that the man happens to be a <span class=\"iTxt\">Momin</span> in the Presence of Allah<sup>azwj</sup>, the <span class=\"iTxt\">Emān</span> having been affirmed to him in His<sup>azwj</sup> Presence, then Allah<sup>azwj</sup> Transfers him afterwards, from the <span class=\"iTxt\">Emān</span> to the <span class=\"iTxt\">Kufr</span> (disbelief)?’",
            "So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic, He<sup>azwj</sup> is Just. But rather, He<sup>azwj</sup> Calls the servants to the <span class=\"iTxt\">Emān</span> in Him<sup>azwj</sup> not to the <span class=\"iTxt\">Kufr</span> (disbelief), and He<sup>azwj</sup> does not Call anyone to the <span class=\"iTxt\">Kufr</span> (disbelief) in Him<sup>azwj</sup>. So the one who believes in Allah<sup>azwj</sup>, then the <span class=\"iTxt\">Emān</span> gets affirmed for him in the Presence of Allah<sup>azwj</sup>, Allah<sup>azwj</sup> Mighty and Majestic will not Transfer it after that, from the <span class=\"iTxt\">Emān</span> to the <span class=\"iTxt\">Kufr</span> (disbelief)’. ",
            "I said to him<sup>asws</sup>, ‘Can it happen that the man is a <span class=\"iTxt\">Kafir</span> (unbeliever), the <span class=\"iTxt\">Kufr</span> (disbelief) having been affirmed for him in the Presence of Allah<sup>azwj</sup>, then He<sup>azwj</sup> Transfer him, after that, from the <span class=\"iTxt\">Kufr</span> to the <span class=\"iTxt\">Emān</span>?’ ",
            "He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Created the people, all of them upon the nature which He<sup>azwj</sup> Natured them upon. They were neither recognising <span class=\"iTxt\">Emān</span> with its stipulations, nor <span class=\"iTxt\">Kufr</span> with its denials. Then Allah<sup>azwj</sup> Sent the Rasools<sup>as</sup> inviting the people to the <span class=\"iTxt\">Emān</span> in Him<sup>azwj</sup>. So, from them is the one whom Allah<sup>azwj</sup> Guided, and from them is the one who Allah<sup>azwj</sup> did not Guide’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Mahbub from Husayn ibn Nu’aym al-Sahhaf who has said the following: “Once I asked abu ‘Abd Allah (a.s.) ‘Why is it that a man is a believer before Allah and belief is established for him, then Allah transfers him from belief to disbelief?’ The narrator has said that the Imam said, ‘Allah, the Most Majestic, the Most Holy, is just. He has called the servants to believe in Him, not to disbelief and does not call anyone to disbelieve Him. Whoever believes in Allah and belief is then established for him before Allah, Allah, the Most Majestic, the Most Holy, does not transfer him thereafter from belief to disbelief.’ I said, ‘If a man is an unbeliever whose disbelief is established before Allah, will He transfer him from disbelief to belief?’ The Imam said, ‘Allah, the Most Majestic, the Most Holy, has created people - all of them - with the nature upon which He has fashioned them. They do not know belief in a way of life and a system of laws (is necessary) or that disbelief is denial (of something). Allah sent the Messengers who called people to believe in Him. Certain people are those whom Allah has guided (to the right path) and also among them are those whom He has not guided (to the right path).”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:181",
  "kind": "verse_list"
}