{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:2:1", "titles": {"ar": "كتاب الإيمان و الكفر", "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"}}, {"indexed_titles": {"en": "Chapter 182"}, "path": "/books/al-kafi:2:1:182", "titles": {"ar": "بَابُ الْمُعَارِينَ", "en": "Chapter 182 – The ones of temporary (Emān)"}}], "index": 370, "local_index": 182, "part_type": "Chapter", "path": "/books/al-kafi:2:1:182", "titles": {"ar": "بَابُ الْمُعَارِينَ", "en": "Chapter 182 – The ones of temporary (Emān)"}, "verse_count": 5, "verse_start_index": 2913, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 2914, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:1:182:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي أَيُّوبَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ سَمِعْتُهُ يَقُولُ إِنَّ اللَّهَ عَزَّ وَ جَلَّ خَلَقَ خَلْقاً لِلْإِيمَانِ لَا زَوَالَ لَهُ وَ خَلَقَ خَلْقاً لِلْكُفْرِ لَا زَوَالَ لَهُ وَ خَلَقَ خَلْقاً بَيْنَ ذَلِكَ وَ اسْتَوْدَعَ بَعْضَهُمُ الْإِيمَانَ فَإِنْ يَشَأْ أَنْ يُتِمَّهُ لَهُمْ أَتَمَّهُ وَ إِنْ يَشَأْ أَنْ يَسْلُبَهُمْ إِيَّاهُ سَلَبَهُمْ وَ كَانَ فُلَانٌ مِنْهُمْ مُعَاراً ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Abu Ayoub, from Muhammad Bin Muslim, ", "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘Allah<sup>azwj</sup> Mighty and Majestic Created a people for the <span class=\"iTxt\">Emān</span>, there not being a decline for it, and Created a people for the <span class=\"iTxt\">Kufr</span> (disbelief), there being no decline for it, and Created a people between that and Deposited the <span class=\"iTxt\">Emān</span> in some of them. So if He<sup>azwj</sup> so Desires He<sup>azwj</sup> would Complete it for them, and if He<sup>azwj</sup> so Desires He<sup>azwj</sup> would Confiscate it from them; and so and so from them was with temporary <span class=\"iTxt\">Emān</span>’."]}}, {"index": 2915, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:1:182:2", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ وَ الْقَاسِمِ بْنِ مُحَمَّدٍ الْجَوْهَرِيِّ عَنْ كُلَيْبِ بْنِ مُعَاوِيَةَ الْأَسَدِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْعَبْدَ يُصْبِحُ مُؤْمِناً وَ يُمْسِيَ كَافِراً وَ يُصْبِحُ كَافِراً وَ يُمْسِيَ مُؤْمِناً وَ قَوْمٌ يُعَارُونَ الْإِيمَانَ ثُمَّ يُسْلَبُونَهُ وَ يُسَمَّوْنَ الْمُعَارِينَ ثُمَّ قَالَ فُلَانٌ مِنْهُمْ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub and Al Qasim Bin Muhammad Al Jowfary, from Kuleyb Bin Muawiya Al Asady, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A servant could be a <span class=\"iTxt\">Momin</span> in the morning and in the evening he would be a <span class=\"iTxt\">Kafir</span> (unbeliever), and in the morning he could be a <span class=\"iTxt\">Kafir</span> and in the evening he would be a <span class=\"iTxt\">Momin</span>; and a people are being Lent the <span class=\"iTxt\">Emān</span>, then it is Confiscated and (they) are being named as the ‘temporary ones’’. Then he<sup>asws</sup> said: ‘So and so was from them’."]}}, {"index": 2916, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:2:1:182:3", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ وَ غَيْرِهِ عَنْ عِيسَى شَلَقَانَ قَالَ كُنْتُ قَاعِداً فَمَرَّ أَبُو الْحَسَنِ مُوسَى ( عليه السلام ) وَ مَعَهُ بَهْمَةٌ قَالَ قُلْتُ يَا غُلَامُ مَا تَرَى مَا يَصْنَعُ أَبُوكَ يَأْمُرُنَا بِالشَّيْ‏ءِ ثُمَّ يَنْهَانَا عَنْهُ أَمَرَنَا أَنْ نَتَوَلَّى أَبَا الْخَطَّابِ ثُمَّ أَمَرَنَا أَنْ نَلْعَنَهُ وَ نَتَبَرَّأَ مِنْهُ ", "فَقَالَ أَبُو الْحَسَنِ ( عليه السلام ) وَ هُوَ غُلَامٌ إِنَّ اللَّهَ خَلَقَ خَلْقاً لِلْإِيمَانِ لَا زَوَالَ لَهُ وَ خَلَقَ خَلْقاً لِلْكُفْرِ لَا زَوَالَ لَهُ وَ خَلَقَ خَلْقاً بَيْنَ ذَلِكَ أَعَارَهُ الْإِيمَانَ يُسَمَّوْنَ الْمُعَارِينَ إِذَا شَاءَ سَلَبَهُمْ وَ كَانَ أَبُو الْخَطَّابِ مِمَّنْ أُعِيرَ الْإِيمَانَ ", "قَالَ فَدَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَأَخْبَرْتُهُ مَا قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) وَ مَا قَالَ لِي فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّهُ نَبْعَةُ نُبُوَّةٍ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hafs Bin Al Bakhtary and someone else from Isa Shalqan who said, ", "‘I was seated and Abu Al-Hassan Musa<sup>asws</sup> passed by, and with him was a goat. I said, ‘O boy! What is your<sup>asws</sup> view of what your<sup>asws</sup> father<sup>asws</sup> did, ordering us with something then forbidding us from it. He<sup>asws</sup> ordered us that we befriend Abu Al-Khattab, then he<sup>asws</sup> ordered us that we curse him and we should disavow from him?’ ", "So Abu Al-Hassan<sup style=\"font-weight: normal\">asws</sup> said, and he<sup style=\"font-weight: normal\">asws</sup> was a boy: ‘Allah<sup style=\"font-weight: normal\">azwj</sup> Created a people for the <span class=\"iTxt\">Emān</span>, there being no decline for it, and Created a people for the <span class=\"iTxt\">Kufr</span> (disbelief) there being no decline for it, and Created a people between that, Lending the <span class=\"iTxt\">Emān</span> to him, named as the ‘temporary ones’. Whenever He<sup style=\"font-weight: normal\">azwj</sup> so Desires, He<sup style=\"font-weight: normal\">azwj</sup> Confiscates it from them, and Abu Al-Khattab was from the ones who was Lent the <span class=\"iTxt\">Emān</span>’. ", "He (the narrator) said, ‘So I went over to Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> and informed him<sup style=\"font-weight: normal\">asws</sup> of what I had said to Abu Al-Hassan<sup style=\"font-weight: normal\">asws</sup> and what he<sup style=\"font-weight: normal\">asws</sup> had said to me. So Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> said: ‘He<sup style=\"font-weight: normal\">asws</sup> is a spring of the Prophet-hood’."]}}, {"index": 2917, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:2:1:182:4", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي الْحَسَنِ ( صلوات الله عليه )  قَالَ إِنَّ اللَّهَ خَلَقَ النَّبِيِّينَ عَلَى النُّبُوَّةِ فَلَا يَكُونُونَ إِلَّا أَنْبِيَاءَ وَ خَلَقَ الْمُؤْمِنِينَ عَلَى الْإِيمَانِ فَلَا يَكُونُونَ إِلَّا مُؤْمِنِينَ وَ أَعَارَ قَوْماً إِيمَاناً فَإِنْ شَاءَ تَمَّمَهُ لَهُمْ وَ إِنْ شَاءَ سَلَبَهُمْ إِيَّاهُ ", "قَالَ وَ فِيهِمْ جَرَتْ فَمُسْتَقَرٌّ وَ مُسْتَوْدَعٌ وَ قَالَ لِي إِنَّ فُلَاناً كَانَ مُسْتَوْدَعاً إِيمَانُهُ فَلَمَّا كَذَبَ عَلَيْنَا سُلِبَ إِيمَانُهُ ذَلِكَ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus, from one of our companions, ", "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Created the Prophets<sup>as</sup> upon the Prophet-hood, so they will not happen to be except for Prophets<sup>as</sup>; and he<sup>azwj</sup> Created the <span class=\"iTxt\">Momineen</span> upon the <span class=\"iTxt\">Emān</span>, so they will not happen to be except for <span class=\"iTxt\">Momineen</span>; and Lent <span class=\"iTxt\">Emān</span> to a people. So if He<sup>azwj</sup> so Desires, would Complete it for them, and if He<sup>azwj</sup> so Desires would Confiscate it’. ", "He<sup style=\"font-weight: normal\">asws</sup> said: ‘And among them flowed the stable ones and the temporary ones’. And he<sup style=\"font-weight: normal\">asws</sup> said to me: ‘So and so had temporary <span class=\"iTxt\">Emān</span>. So when he lied against us<sup style=\"font-weight: normal\">asws</sup>, that <span class=\"iTxt\">Emān</span> of his was Confiscated’."]}}, {"index": 2918, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:2:1:182:5", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ حَبِيبٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ جَبَلَ النَّبِيِّينَ عَلَى نُبُوَّتِهِمْ فَلَا يَرْتَدُّونَ أَبَداً وَ جَبَلَ الْأَوْصِيَاءَ عَلَى وَصَايَاهُمْ فَلَا يَرْتَدُّونَ أَبَداً وَ جَبَلَ بَعْضَ الْمُؤْمِنِينَ عَلَى الْإِيمَانِ فَلَا يَرْتَدُّونَ أَبَداً وَ مِنْهُمْ مَنْ أُعِيرَ الْإِيمَانَ عَارِيَّةً فَإِذَا هُوَ دَعَا وَ أَلَحَّ فِي الدُّعَاءِ مَاتَ عَلَى الْإِيمَانِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Al Qasim Bin Habeeb, from Is’haq Bin Ammar, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Formed the Prophets<sup>as</sup> upon their<sup>as</sup> Prophet-hood. Thus, they<sup>as</sup> will not be reneging, ever! And He<sup>azwj</sup> Formed the successors<sup>as</sup> upon their successorship. Thus, they<sup>as</sup> will not be reneging, ever! And He<sup>azwj</sup> Moulded some of the <span class=\"iTxt\">Momineen</span> upon the <span class=\"iTxt\">Emān</span>. Thus they will not be reneging, ever! And from them is one to whom the <span class=\"iTxt\">Emān</span> is Lent with a Lending. So when he supplicates and persists in the supplication, would die upon the <span class=\"iTxt\">Emān</span>’."]}}]}, "index": "al-kafi:2:1:182", "kind": "verse_list"}