{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 184"
        },
        "path": "/books/al-kafi:2:1:184",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ سَهْوِ الْقَلْبِ</span>",
          "en": "Chapter 184 – Omissions of the heart"
        }
      }
    ],
    "index": 372,
    "local_index": 184,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 185"
        },
        "path": "/books/al-kafi:2:1:185",
        "titles": {
          "ar": "بَابٌ فِي ظُلْمَةِ قَلْبِ الْمُنَافِقِ وَ إِنْ أُعْطِيَ اللِّسَانَ وَ نُورِ قَلْبِ الْمُؤْمِنِ وَ إِنْ قَصَرَ بِهِ لِسَانُهُ",
          "en": "Chapter 185 – Regarding the darkness of the ‘الْقَلْبُ’ (Qalb) of the hypocrite and even though he has been given the tongue, and radiance of the الْقَلْبُ (Qalb) of the Momin and even though he falls short with his tongue"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 183"
        },
        "path": "/books/al-kafi:2:1:183",
        "titles": {
          "ar": "بَابٌ فِي عَلَامَةِ الْمُعَارِ",
          "en": "Chapter 183 – Regarding the signs of the Lending (of the Emān)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:184",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ سَهْوِ الْقَلْبِ</span>",
      "en": "Chapter 184 – Omissions of the heart"
    },
    "verse_count": 7,
    "verse_start_index": 2919,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول أو حسن موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/250)"
        ],
        "index": 2920,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:184:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَعْفَرِ بْنِ عُثْمَانَ عَنْ سَمَاعَةَ عَنْ أَبِي بَصِيرٍ وَ غَيْرِهِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ الْقَلْبَ لَيَكُونُ السَّاعَةَ مِنَ اللَّيْلِ وَ النَّهَارِ مَا فِيهِ كُفْرٌ وَ لَا إِيمَانٌ كَالثَّوْبِ الْخَلَقِ ",
          "قَالَ ثُمَّ قَالَ لِي أَ مَا تَجِدُ ذَلِكَ مِنْ نَفْسِكَ قَالَ ثُمَّ تَكُونُ النُّكْتَةُ مِنَ اللَّهِ فِي الْقَلْبِ بِمَا شَاءَ مِنْ كُفْرٍ وَ إِيمَانٍ .",
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ أَبِي عُمَيْرٍ مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ja’far Bin Usman, from Sama’at, from Abu Baseer and someone else who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The heart happens to be such during a time of the day and the night that there is neither a <span class=\"iTxt\">Kufr</span> (disbelief) in it nor <span class=\"iTxt\">Emān</span>, like the newly-created garment’.",
            "He (the narrator) said, ‘Then he<sup style=\"font-weight: normal\">asws</sup> said to me: ‘But, do you not find that from yourself?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘The spot appears from Allah<sup style=\"font-weight: normal\">azwj</sup> in the heart with whatever Allah<sup style=\"font-weight: normal\">azwj</sup> has so Desired it to be, from <span class=\"iTxt\">Kufr</span> and the <span class=\"iTxt\">Emān</span>’.",
            "<span style=\"font-size: small\">A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al Husayn, from Muhammad Bin Abu Umeyr </span>– smilar to it."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from la’ far ibn ‘Uthman from Sama’a from abu Basir and others who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘The heart in certain hours of the night and day has no disbelief or belief in it and it is like an old mg.’ The narrator has said that the Imam then asked, ‘Do you not find that in yourself? Then there is a dot from Allah in the heart of the kind that He wills in the form of disbelief or belief.’” A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn al-Husayn from Muhammad ibn abu ‘Umayr a similar Hadith. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/252)"
        ],
        "index": 2921,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:184:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْعَبَّاسِ بْنِ مَعْرُوفٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ يَكُونُ الْقَلْبُ مَا فِيهِ إِيمَانٌ وَ لَا كُفْرٌ شِبْهَ الْمُضْغَةِ أَ مَا يَجِدُ أَحَدُكُمْ ذَلِكَ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Abbas Bin Marouf, from Hammad Bin Isa, from Al Husayn Bin Al Mukhtar, from Abu Baseer who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘الْقَلْبُ’ The heart (sometimes) becomes such that there is neither <span class=\"iTxt\">Emān</span> in it nor <span class=\"iTxt\">Kufr</span> (disbelief), resembling a lump. Hasn’t any one of you found that?’"
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al- ‘Abbas ibn Ma’ruf from Hammad ibn ‘Isa from al-Husayn ibn al-Mukhtar from abu Basir who has said the following: “I heard abu Ja’far (a.s.) saying, ‘There is the heart in which there is no belief or disbelief, like a chunk of flesh. Does any one of you feel it is as such sometimes?’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/252)"
        ],
        "index": 2922,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:184:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنِ الْعَمْرَكِيِّ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَبِي الْحَسَنِ مُوسَى ( عليه السلام ) قَالَ إِنَّ اللَّهَ خَلَقَ قُلُوبَ الْمُؤْمِنِينَ مَطْوِيَّةً مُبْهَمَةً عَلَى الْإِيمَانِ فَإِذَا أَرَادَ اسْتِنَارَةَ مَا فِيهَا نَضَحَهَا بِالْحِكْمَةِ وَ زَرَعَهَا بِالْعِلْمِ وَ زَارِعُهَا وَ الْقَيِّمُ عَلَيْهَا رَبُّ الْعَالَمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Al Amraky Bin Ali, ",
            "(It has been narrated) from Ali son of Ja’far<sup>asws</sup>, from Abu Al-Hassan Musa<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Created the hearts of the <span class=\"iTxt\">Momineen</span> folded opaquely upon the <span class=\"iTxt\">Emān</span>. So whenever he (the <span class=\"iTxt\">Momin</span>) intends to enlighten what is in it, he sprinkles it with the wisdom and then cultivates it with the knowledge, and its Cultivator and the Overseer over it is the Lord<sup>azwj</sup> of the worlds’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from al-‘Amraki ibn Ali from Ali ibn Ja’far from abu al-Hassan Musa (a.s.) who has said the following: “Allah has created the hearts of the believers, in which belief is wrapped up and is unknown. When He wills to light up what is in it He sprinkles it with wisdom and plants knowledge therein. The fanner and guardian thereof is the Lord, the Cherisher of the worlds.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/254)"
        ],
        "index": 2923,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:184:4",
        "relations": {
          "Mentions": [
            "/books/quran:64:11"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْقَلْبَ لَيَتَرَجَّجُ فِيمَا بَيْنَ الصَّدْرِ وَ الْحَنْجَرَةِ حَتَّى يُعْقَدَ عَلَى الْإِيمَانِ فَإِذَا عُقِدَ عَلَى الْإِيمَانِ قَرَّ وَ ذَلِكَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ يُؤْمِنْ بِاللَّهِ يَهْدِ قَلْبَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Al Husayn Bin Mukhtar, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The ‘الْقَلْبُ’ (الْقَلْبُ cannot be translated as heart. In one Hadith it is referred to <span class=\"iTxt\">Aql</span> it is not a physical entity) tends to vibrate between the chest and the throat until it sits upon the <span class=\"iTxt\">Emān</span>. So when it is tied upon the <span class=\"iTxt\">Emān</span>, it settles down, and these are the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:64#h11\">[64:11]</a> and whoever believes in Allah, He Guides aright his </span>الْقَلْبُ <span class=\"ibTxt\">(Qalb)</span>’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from al-Husayn ibn al-Mukhtar from abu Basir from abu ‘Abd Allah (a.s.) who has said the following: “The heart vibrates between the chest and the throat until it forms belief, when it does so it rests as is in the words of Allah, the Most Majestic, the Most Holy, ‘Whoever believes in Allah his heart calms down.’” <a href=\"/#/books/quran:64#h11\">[64:11]</a> "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/255)"
        ],
        "index": 2924,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:184:5",
        "relations": {
          "Mentions": [
            "/books/quran:6:125"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ ابْنِ فَضَّالٍ عَنْ أَبِي جَمِيلَةَ عَنْ مُحَمَّدٍ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْقَلْبَ لَيَتَجَلْجَلُ فِي الْجَوْفِ يَطْلُبُ الْحَقَّ فَإِذَا أَصَابَهُ اطْمَأَنَّ وَ قَرَّ ثُمَّ تَلَا أَبُو عَبْدِ اللَّهِ ( عليه السلام ) هَذِهِ الْآيَةَ فَمَنْ يُرِدِ اللَّهُ أَنْ يَهْدِيَهُ يَشْرَحْ صَدْرَهُ لِلْإِسْلامِ إِلَى قَوْلِهِ كَأَنَّما يَصَّعَّدُ فِي السَّماءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ibn Fazzal, from Abu Jameela, from Muhammad Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The الْقَلْبُ tends to jingle in the inside, seeking the truth. So when it comes across it, it is reassured and settles down’. Then Abu Abdullah<sup>asws</sup> recited this Verse <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h125\">[6:125]</a> Therefore (for) whomsoever Allah Intends that He would Guide him aright, He Expands his chest for Islam</span> – up to His<sup>azwj</sup> Words<span class=\"ibTxt\"> as though he were ascending to the sky</span>’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ibn Faddal from abu Jamilah from Muhammad al-Halabi from abu ‘Abd Allah (a.s.) who has said the following: “The heart beats noisily inside in search of the truth. If it finds the truth it calms down and rests.’ The Imam then recited this verse: ‘Allah will open the hearts of whomever He wants to guide to Islam, but He will tighten the chest of one whom He has led astray, as though he were climbing high up into the sky. Thus, God places wickedness on those who do not accept the faith. <a href=\"/#/books/quran:6#h125\">[6:125]</a>’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/256)"
        ],
        "index": 2925,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:184:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ أَبِي الْمَغْرَاءِ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ إِنَّ الْقَلْبَ يَكُونُ فِي السَّاعَةِ مِنَ اللَّيْلِ وَ النَّهَارِ لَيْسَ فِيهِ إِيمَانٌ وَ لَا كُفْرٌ أَ مَا تَجِدُ ذَلِكَ ثُمَّ تَكُونُ بَعْدَ ذَلِكَ نُكْتَةٌ مِنَ اللَّهِ فِي قَلْبِ عَبْدِهِ بِمَا شَاءَ إِنْ شَاءَ بِإِيمَانٍ وَ إِنْ شَاءَ بِكُفْرٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Abu Al Magra’a, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘The الْقَلْبُ (<span class=\"iTxt\">Qalb</span>) happens to be such during a time from the night and the day, there is neither <span class=\"iTxt\">Emān</span> in it nor <span class=\"iTxt\">Kufr</span> (disbelief). But, do you not find that (to be so)? Then a spot appears after that from Allah<sup>azwj</sup> in the heart of His<sup>azwj</sup> servant with whatever He<sup>azwj</sup> so Desires. If He<sup>azwj</sup> so Desires with <span class=\"iTxt\">Emān</span>, and if He<sup>azwj</sup> so Desires, with <span class=\"iTxt\">Kufr</span> (disbelief)’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from abu al- Maghra’ from abu Basir who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘The heart in (certain) hours of the night and day has no belief or disbelief in it. Do you not find that in yourself? Thereafter, a dot from Allah comes in the heart of His servant in the form that He wills. If He wills, it is with belief and if He wills, it is in disbelief.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/256)"
        ],
        "index": 2926,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:184:7",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ يُونُسَ بْنِ ظَبْيَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ خَلَقَ قُلُوبَ الْمُؤْمِنِينَ مُبْهَمَةً عَلَى الْإِيمَانِ فَإِذَا أَرَادَ اسْتِنَارَةَ مَا فِيهَا فَتَحَهَا بِالْحِكْمَةِ وَ زَرَعَهَا بِالْعِلْمِ وَ زَارِعُهَا وَ الْقَيِّمُ عَلَيْهَا رَبُّ الْعَالَمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al Hassan Bin Shamoun, from Abdullah Bin Abdul Rahman, from Abdullah Bin Al Qasim, from Yunus Bin Zabyan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Created the ‘قُلُوبَ’ (Qalub – plural of Qalb) of the <span class=\"iTxt\">Momineen</span> wrapped up over the <span class=\"iTxt\">Emān</span>. So whenever he (the <span class=\"iTxt\">Momin</span>) intends to enlighten what is in it, begins it with the wisdom and cultivates it with the knowledge, and its Cultivator and the Overseer upon it is the Lord<sup>azwj</sup> of the Worlds’."
          ],
          "en.sarwar": [
            "7. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn al-Hassan ibn Shammun from ‘Abd Allah ibn ‘Abd al-Rahman from ‘Abd Allah ibn al-Qasim from Yunus ibn Zabyan from abu ‘Abd Allah (a.s.) who has said the following: “Allah has created the hearts of the believers wrapped up over belief. When He wills to light it up He opens it with wisdom and plants it with knowledge. The farmer and guardian thereof is the Lord of the worlds.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:184",
  "kind": "verse_list"
}