{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 185"
        },
        "path": "/books/al-kafi:2:1:185",
        "titles": {
          "ar": "بَابٌ فِي ظُلْمَةِ قَلْبِ الْمُنَافِقِ وَ إِنْ أُعْطِيَ اللِّسَانَ وَ نُورِ قَلْبِ الْمُؤْمِنِ وَ إِنْ قَصَرَ بِهِ لِسَانُهُ",
          "en": "Chapter 185 – Regarding the darkness of the ‘الْقَلْبُ’ (Qalb) of the hypocrite and even though he has been given the tongue, and radiance of the الْقَلْبُ (Qalb) of the Momin and even though he falls short with his tongue"
        }
      }
    ],
    "index": 373,
    "local_index": 185,
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:185",
    "titles": {
      "ar": "بَابٌ فِي ظُلْمَةِ قَلْبِ الْمُنَافِقِ وَ إِنْ أُعْطِيَ اللِّسَانَ وَ نُورِ قَلْبِ الْمُؤْمِنِ وَ إِنْ قَصَرَ بِهِ لِسَانُهُ",
      "en": "Chapter 185 – Regarding the darkness of the ‘الْقَلْبُ’ (Qalb) of the hypocrite and even though he has been given the tongue, and radiance of the الْقَلْبُ (Qalb) of the Momin and even though he falls short with his tongue"
    },
    "verse_count": 3,
    "verse_start_index": 2926,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/257)"
        ],
        "index": 2927,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:185:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ عَمْرٍو عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ لَنَا ذَاتَ يَوْمٍ تَجِدُ الرَّجُلَ لَا يُخْطِئُ بِلَامٍ وَ لَا وَاوٍ خَطِيباً مِصْقَعاً وَ لَقَلْبُهُ أَشَدُّ ظُلْمَةً مِنَ اللَّيْلِ الْمُظْلِمِ وَ تَجِدُ الرَّجُلَ لَا يَسْتَطِيعُ يُعَبِّرُ عَمَّا فِي قَلْبِهِ بِلِسَانِهِ وَ قَلْبُهُ يَزْهَرُ كَمَا يَزْهَرُ الْمِصْبَاحُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Fazzal, from Ali Bin Uqba, from Amro, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said to us one day: ‘You will find the man not erring with a ‘Laam; or ‘Waaw’ (letters of the Arabic Alphabet), an orator, eloquent, and for his الْقَلْبُ <span style=\"text-decoration: underline\">(</span><span style=\"font-style: italic; text-decoration: underline\">Qalb</span><span style=\"text-decoration: underline\">) </span>would be a darkness more intense than the night; and you will find the man not being able to express by his tongue what is in his الْقَلْبُ (<span class=\"iTxt\">Qalb</span>), but his (<span class=\"iTxt\">Qalb</span>) would be shining just as the lantern shines’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn Faddal from Ali ibn ‘Uqbah from ‘Amr from abu ‘Abd Allah who has said the following: “One day the Imam said to us, ‘You may find a man who does not make any mistakes of the size of letter ‘L’ or ‘W’ and he is an exuberant speaker while his heart is darker than the darkest night. You may also find a man who is not able to express what is in his heart with his tongue while his heart shines like a lantern.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/257)"
        ],
        "index": 2928,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:185:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ هَارُونَ بْنِ الْجَهْمِ عَنِ الْمُفَضَّلِ عَنْ سَعْدٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ الْقُلُوبَ أَرْبَعَةٌ قَلْبٌ فِيهِ نِفَاقٌ وَ إِيمَانٌ وَ قَلْبٌ مَنْكُوسٌ وَ قَلْبٌ مَطْبُوعٌ وَ قَلْبٌ أَزْهَرُ أَجْرَدُ فَقُلْتُ مَا الْأَزْهَرُ قَالَ فِيهِ كَهَيْئَةِ السِّرَاجِ فَأَمَّا الْمَطْبُوعُ فَقَلْبُ الْمُنَافِقِ وَ أَمَّا الْأَزْهَرُ فَقَلْبُ الْمُؤْمِنِ إِنْ أَعْطَاهُ شَكَرَ وَ إِنِ ابْتَلَاهُ صَبَرَ وَ أَمَّا الْمَنْكُوسُ فَقَلْبُ الْمُشْرِكِ ",
          "ثُمَّ قَرَأَ هَذِهِ الْآيَةَ أَ فَمَنْ يَمْشِي مُكِبًّا عَلى وَجْهِهِ أَهْدى أَمَّنْ يَمْشِي سَوِيًّا عَلى صِراطٍ مُسْتَقِيمٍ فَأَمَّا الْقَلْبُ الَّذِي فِيهِ إِيمَانٌ وَ نِفَاقٌ فَهُمْ قَوْمٌ كَانُوا بِالطَّائِفِ فَإِنْ أَدْرَكَ أَحَدَهُمْ أَجَلُهُ عَلَى نِفَاقِهِ هَلَكَ وَ إِنْ أَدْرَكَهُ عَلَى إِيمَانِهِ نَجَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Haroun Bin Al Jahm, from Al Mufazzal, from Sa’ad, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The قُلُوبَ (<span class=\"iTxt\">Qalub</span>) are three (types) – a الْقَلْبُ (<span class=\"iTxt\">Qalb</span>) wherein is hypocrisy and <span class=\"iTxt\">Emān</span>, and an inverted الْقَلْبُ (<span class=\"iTxt\">Qalb</span>), and an imprinted الْقَلْبُ (<span class=\"iTxt\">Qalb</span>), and a shining bare الْقَلْبُ’ (<span class=\"iTxt\">Qalb</span>). So I said, ‘What is the shining <span style=\"text-decoration: underline\">(</span><span style=\"font-style: italic; text-decoration: underline\">Qalb</span><span style=\"text-decoration: underline\">)?</span>’ He<sup>asws</sup> said: ‘Wherein is like a physical lamp; as for the imprinted one, it is the الْقَلْبُ of the hypocrisy, and as for the shining one, it is the الْقَلْبُ of the <span class=\"iTxt\">Momin</span> if He<sup>azwj</sup> Gives him, he is grateful, and if He<sup>azwj</sup> Tries him, he is patient; and as for the inverted one, it is the الْقَلْبُ of the <span class=\"iTxt\">Mushrik</span> (Polytheist)’. ",
            "Then he<sup>asws</sup> recited this Verse <span class=\"ibTxt\">[67:22] Is the one who goes prone upon his face better guided or he who walks upright upon a Straight Path?</span> As for the الْقَلْبُ wherein is <span class=\"iTxt\">Emān</span> and hypocrisy, so they were a people who were in Al-Ta’if. So if death seized one of them upon his hypocrisy, he perished, but if it (death) approached him upon his <span class=\"iTxt\">Emān</span>, attained salvation’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father from Harun ibn al-Jahm from al-Mufaddal from Sa’d from abu Ja’far (a.s.) who has said the following: “There are four kinds of hearts: the heart in which there is hypocrisy and belief, the heart that is upside down, the heart that is stamped and the heart that is Azhar and is free. I then asked, ‘What is ‘Azhar’? The Imam said, ‘In it (the heart) there is something like a lamp. The stamped heart is the heart of hypocrite. Azhar is the heart of the believer who upon receiving favors, thanks, and in suffering exercises patience. The upside down heart is the heart of the pagans.’ The Imam then read this verse: ‘Can one who walks with his head hanging down be better guided than one who walks with his head upright?’ (67:22) The heart with belief and hypocrisy therein was the heart of a people in Ta’if. If death seized one of them upon his hypocrisy, he perished, and if it approached him upon belief he gained salvation.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/260)"
        ],
        "index": 2929,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:185:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ الْقُلُوبُ ثَلَاثَةٌ قَلْبٌ مَنْكُوسٌ لَا يَعِي شَيْئاً مِنَ الْخَيْرِ وَ هُوَ قَلْبُ الْكَافِرِ وَ قَلْبٌ فِيهِ نُكْتَةٌ سَوْدَاءُ فَالْخَيْرُ وَ الشَّرُّ فِيهِ يَعْتَلِجَانِ فَأَيُّهُمَا كَانَتْ مِنْهُ غَلَبَ عَلَيْهِ وَ قَلْبٌ مَفْتُوحٌ فِيهِ مَصَابِيحُ تَزْهَرُ وَ لَا يُطْفَأُ نُورُهُ إِلَى يَوْمِ الْقِيَامَةِ وَ هُوَ قَلْبُ الْمُؤْمِنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ibn Mahboub, from Abu Hamza Al Sumaly, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The قُلُوبَ are three (types) – an inverted الْقَلْبُ not being aware of anything from the good, and it is the الْقَلْبُ of the <span class=\"iTxt\">Kafir</span> (disbeliever); and a الْقَلْبُ (<span class=\"iTxt\">Qalb</span>) wherein is a black spot, so the good and the evil are wrestling in it. So it would be whichever of the two which overcomes upon it; and an open الْقَلْبُ wherein are shining lanterns, and its light will not be getting extinguished until the Day of Judgment, and it is the الْقَلْبُ of the <span class=\"iTxt\">Momin</span>’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from ibn Mahbub from abu Hamza al-Thumali from abu Ja’far (a.s.) who has said the following: “Hearts are of three kinds: an upside down heart that holds nothing good is the heart of an unbeliever. The heart in which there is a black dot, thus, good and evil duel therein. Whichever dominates the heart defeats the other. There is the open heart. In it lamps shine and its light does not extinguish until the Day of Judgment and that is the heart of a believer.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:185",
  "kind": "verse_list"
}