{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 186"
        },
        "path": "/books/al-kafi:2:1:186",
        "titles": {
          "ar": "بَابٌ فِي تَنَقُّلِ أَحْوَالِ الْقَلْبِ",
          "en": "Chapter 186 – Transference of the states of the الْقَلْبُ (Qalb)"
        }
      }
    ],
    "index": 374,
    "local_index": 186,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 187"
        },
        "path": "/books/al-kafi:2:1:187",
        "titles": {
          "ar": "بَابُ الْوَسْوَسَةِ وَ حَدِيثِ النَّفْسِ",
          "en": "Chapter 187 – The (Satanic) insinuations and discussing with the self"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 185"
        },
        "path": "/books/al-kafi:2:1:185",
        "titles": {
          "ar": "بَابٌ فِي ظُلْمَةِ قَلْبِ الْمُنَافِقِ وَ إِنْ أُعْطِيَ اللِّسَانَ وَ نُورِ قَلْبِ الْمُؤْمِنِ وَ إِنْ قَصَرَ بِهِ لِسَانُهُ",
          "en": "Chapter 185 – Regarding the darkness of the ‘الْقَلْبُ’ (Qalb) of the hypocrite and even though he has been given the tongue, and radiance of the الْقَلْبُ (Qalb) of the Momin and even though he falls short with his tongue"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:186",
    "titles": {
      "ar": "بَابٌ فِي تَنَقُّلِ أَحْوَالِ الْقَلْبِ",
      "en": "Chapter 186 – Transference of the states of the الْقَلْبُ (Qalb)"
    },
    "verse_count": 1,
    "verse_start_index": 2929,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/261)"
        ],
        "index": 2930,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2264",
              "text": "مُحَمَّدِ بْنِ النُّعْمَانِ الْأَحْوَلِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1256",
              "text": "سَلَّامِ بْنِ الْمُسْتَنِيرِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ مُحَمَّدِ بْنِ النُّعْمَانِ الْأَحْوَلِ عَنْ سَلَّامِ بْنِ الْمُسْتَنِيرِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:186:1",
        "relations": {
          "Mentions": [
            "/books/quran:11:3",
            "/books/quran:2:222"
          ]
        },
        "text": [
          " كُنْتُ عِنْدَ أَبِي جَعْفَرٍ ( عليه السلام ) فَدَخَلَ عَلَيْهِ حُمْرَانُ بْنُ أَعْيَنَ وَ سَأَلَهُ عَنْ أَشْيَاءَ فَلَمَّا هَمَّ حُمْرَانُ بِالْقِيَامِ قَالَ لِأَبِي جَعْفَرٍ ( عليه السلام ) أُخْبِرُكَ أَطَالَ اللَّهُ بَقَاءَكَ لَنَا وَ أَمْتَعَنَا بِكَ أَنَّا نَأْتِيكَ فَمَا نَخْرُجُ مِنْ عِنْدِكَ حَتَّى تَرِقَّ قُلُوبُنَا وَ تَسْلُوَ أَنْفُسُنَا عَنِ الدُّنْيَا وَ يَهُونَ عَلَيْنَا مَا فِي أَيْدِي النَّاسِ مِنْ هَذِهِ الْأَمْوَالِ ثُمَّ نَخْرُجُ مِنْ عِنْدِكَ فَإِذَا صِرْنَا مَعَ النَّاسِ وَ التُّجَّارِ أَحْبَبْنَا الدُّنْيَا قَالَ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) إِنَّمَا هِيَ الْقُلُوبُ مَرَّةً تَصْعُبُ وَ مَرَّةً تَسْهُلُ",
          "ثُمَّ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) أَمَا إِنَّ أَصْحَابَ مُحَمَّدٍ ( صلى الله عليه وآله ) قَالُوا يَا رَسُولَ اللَّهِ نَخَافُ عَلَيْنَا النِّفَاقَ قَالَ فَقَالَ وَ لِمَ تَخَافُونَ ذَلِكَ قَالُوا إِذَا كُنَّا عِنْدَكَ فَذَكَّرْتَنَا وَ رَغَّبْتَنَا وَجِلْنَا وَ نَسِينَا الدُّنْيَا وَ زَهِدْنَا حَتَّى كَأَنَّا نُعَايِنُ الْآخِرَةَ وَ الْجَنَّةَ وَ النَّارَ وَ نَحْنُ عِنْدَكَ فَإِذَا خَرَجْنَا مِنْ عِنْدِكَ وَ دَخَلْنَا هَذِهِ الْبُيُوتَ وَ شَمِمْنَا الْأَوْلَادَ وَ رَأَيْنَا الْعِيَالَ وَ الْأَهْلَ يَكَادُ أَنْ نُحَوَّلَ عَنِ الْحَالِ الَّتِي كُنَّا عَلَيْهَا عِنْدَكَ وَ حَتَّى كَأَنَّا لَمْ نَكُنْ عَلَى شَيْ‏ءٍ أَ فَتَخَافُ عَلَيْنَا أَنْ يَكُونَ ذَلِكَ نِفَاقاً ",
          "فَقَالَ لَهُمْ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كَلَّا إِنَّ هَذِهِ خُطُوَاتُ الشَّيْطَانِ فَيُرَغِّبُكُمْ فِي الدُّنْيَا وَ اللَّهِ لَوْ تَدُومُونَ عَلَى الْحَالَةِ الَّتِي وَصَفْتُمْ أَنْفُسَكُمْ بِهَا لَصَافَحَتْكُمُ الْمَلَائِكَةُ وَ مَشَيْتُمْ عَلَى الْمَاءِ وَ لَوْ لَا أَنَّكُمْ تُذْنِبُونَ فَتَسْتَغْفِرُونَ اللَّهَ لَخَلَقَ اللَّهُ خَلْقاً حَتَّى يُذْنِبُوا ثُمَّ يَسْتَغْفِرُوا اللَّهَ فَيَغْفِرَ اللَّهُ لَهُمْ إِنَّ الْمُؤْمِنَ مُفَتَّنٌ تَوَّابٌ أَ مَا سَمِعْتَ قَوْلَ اللَّهِ عَزَّ وَ جَلَّ إِنَّ اللَّهَ يُحِبُّ التَّوَّابِينَ وَ يُحِبُّ الْمُتَطَهِّرِينَ وَ قَالَ اسْتَغْفِرُوا رَبَّكُمْ ثُمَّ تُوبُوا إِلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and a number of our companions, from Sahl Bin Ziyad and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Ibn Mahboub, from Muhammad Bin Al Nu’man Al Ahowl, from Sallam Bin Al Mustaneer who said, ",
            "‘I was in the presence of Abu Ja’far<sup>asws</sup> when Humran Bin Ayn came over to him<sup>asws</sup> and asked him about certain things. So when Humran was thinking of arising, he said to Abu Ja’far<sup>asws</sup>, ‘I want to inform you<sup>asws</sup>, may Allah<sup>azwj</sup> Prolong your<sup>asws</sup> remaining for us and our happiness with you<sup>asws</sup>. We come to you<sup>asws</sup>, so we do not exit from your<sup>asws</sup> presence until our قُلُوبَ (<span class=\"iTxt\">Qalub</span>) melt and our قُلُوبَ (<span class=\"iTxt\">Qalub</span>) divert us away from the world and it gets trivialised upon us what is in the hands of the people from these wealth’s. Then we exit from your<sup>asws</sup> presence, and we come to be with the people and the business, we love the world (once again)’. He (the narrator) said, ‘So Abu Ja’far<sup>asws</sup> said: ‘But rather these are the قُلُوبَ  (<span class=\"iTxt\">Qalub</span>), sometimes (they make it) difficult (for you) and sometimes (they make it) easy’.",
            "Then Abu Ja’far<sup>asws</sup> said: ‘As for the companions of Muhammad<sup>saww</sup>, they said, ‘O Rasool-Allah<sup>saww</sup>! We fear the hypocrisy upon us’. So he<sup>saww</sup> said: ‘And why are you fearing that?’ They said, ‘Whenever we are in your<sup>saww</sup> presence so you<sup>saww</sup> remind us, and make us crave (the Hereafter), and scare us (of Hell) and make us forget the world, and make us to be ascetic, as if we are visualizing the Hereafter, and the Paradise, and the Fire, and (although) we are in your<sup>saww</sup> presence. So when we exit from your<sup>saww</sup> presence and we enter these houses and we smell the children, and we see the dependants and the family members, we are almost transformed from the state which we used to be upon in your<sup>saww</sup> presence, and to the extent as if we are not upon anything. So, do you<sup>saww</sup> fear upon us that, that would happen to be hypocrisy?’ ",
            "So Rasool-Allah<sup>saww</sup> said to them: ‘Never! These are the footsteps of the Satan<sup>la</sup> and he<sup>la</sup> is making you covet in the world. By Allah<sup>azwj</sup>! If you were to persist upon the state which you are describing yourselves to be with, the Angels would shake your hands and you would be walking upon the water. And had it not been for you all sinning and then seeking Forgiveness of Allah<sup>azwj</sup>, Allah<sup>azwj</sup> would have Created a people until they would be sinning, then seeking Forgiveness of Allah<sup>azwj</sup>, so Allah<sup>azwj</sup> would Forgive them. The <span class=\"iTxt\">Momin</span> is a Tried one, repentant. Have you not heard the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h222\">[2:222]</a> surely Allah Loves the repentant, and He Loves those who purify themselves</span>. And He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:11#h3\">[11:3]</a> And ask Forgiveness from your Lord, then turn repenting to Him</span>’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father and a number of our people have narrated from Sahl ibn Ziyad and Muhammad ibn Yahya from Ahmad ibn Muhammad all from ibn Mahbub from Muhammad ibn al-Nu’man al-‘Ahwal from Sallam ibn al-Mustanir who has said the following: “Once I was in the presence of abu Ja’far (a.s.) when Humran ibn ‘A’yan came in and asked him a few things. When Humran wanted to stand up and leave he said to abu Ja’far (a.s.) ‘I like to tell you, may Allah grant you long life for us so we benefit from you more, whenever we come to you and then leave our hearts feel affectionate, we forget ourselves in the world, and what is in the hands of people of belongings seem to us insignificant. When we leave you and meet others and business people we begin to love the world.’ Abu Ja’far (a.s.) said, ‘The hearts sometimes harden and at other times soften.’ “Abu Ja’far (a.s.) then said, ‘The companions of Muhammad (a.s.) had said, ‘O Messenger of Allah, we are afraid of hypocrisy.’ The Imam said that the Messenger of Allah then asked, ‘Why are you afraid of it?’ They said, ‘When we are in your presence, you remind us (of our religion), encourage us to good deeds, we feel fear, forget the world and restrain ourselves from it, as if we observe the next life, paradise and fire while we are in your presence. When we leave your presence, go to these houses, sense the smell of the children and see the family and relatives, our condition that we had in your presence changes. It is as if we are on nothing (of belief or religion). Do you fear that is hypocrisy in us?’ The Messenger of Allah said, ‘Beware; this is among the steps of Satan who encourages you to be interested in the world. By Allah, if you continue in such condition that you described to exist in you, the angels shake hands with you and you can walk over the water. Even if you do not commit any sin and do not need to ask Allah’s forgiveness, Allah will create a creature who will sin then ask Him for forgiveness and He will forgive them. Believing people are under trial and they repent. Have you not heard the words of Allah, the Most Majestic, the Most Holy, ‘Allah loves those who repent and those who cleanse themselves,’ <a href=\"/#/books/quran:2#h222\">[2:222]</a> also He has said, ‘Ask your Lord for forgiveness and turn to Him in repentance.’” <a href=\"/#/books/quran:11#h3\">[11:3]</a> "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:186",
  "kind": "verse_list"
}