{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 187"
        },
        "path": "/books/al-kafi:2:1:187",
        "titles": {
          "ar": "بَابُ الْوَسْوَسَةِ وَ حَدِيثِ النَّفْسِ",
          "en": "Chapter 187 – The (Satanic) insinuations and discussing with the self"
        }
      }
    ],
    "index": 375,
    "local_index": 187,
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:187",
    "titles": {
      "ar": "بَابُ الْوَسْوَسَةِ وَ حَدِيثِ النَّفْسِ",
      "en": "Chapter 187 – The (Satanic) insinuations and discussing with the self"
    },
    "verse_count": 5,
    "verse_start_index": 2930,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/266)"
        ],
        "index": 2931,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:187:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ مُحَمَّدِ بْنِ حُمْرَانَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْوَسْوَسَةِ وَ إِنْ كَثُرَتْ فَقَالَ لَا شَيْ‏ءَ فِيهَا تَقُولُ لَا إِلَهَ إِلَّا اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washa, from Muhammad Bin Humran who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the (Satanic) insinuations and if it was frequent. So he<sup>asws</sup> said: ‘There is nothing in it. You should be saying, ‘لَا إِلَهَ إِلَّا اللَّهُ’ ‘There is no god except for Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "1. Al-Husayn ibn Muhammad has narrated from Mu’alla ibn Muhammad from al- Washsha’ from Muhammad ibn Humran who has said the following: “Once I asked abu ‘Abd Allah (a.s.) ‘What if temptation (soul’s tale telling) becomes a great deal.’ The Imam said, ‘There is nothing in it. Say, ‘No one deserves to be worshipped except Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/268)"
        ],
        "index": 2932,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:187:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ إِنَّهُ يَقَعُ فِي قَلْبِي أَمْرٌ عَظِيمٌ فَقَالَ قُلْ لَا إِلَهَ إِلَّا اللَّهُ ",
          "قَالَ جَمِيلٌ فَكُلَّمَا وَقَعَ فِي قَلْبِي شَيْ‏ءٌ قُلْتُ لَا إِلَهَ إِلَّا اللَّهُ فَيَذْهَبُ عَنِّي ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel Bin Darraj, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘There has occurred in my الْقَلْبُ (<span class=\"iTxt\">Qalb</span>), a grievous matter’. So he<sup>asws</sup> said: ‘Say, ‘لَا إِلَهَ إِلَّا اللَّهُ’ ‘There is no god except for Allah<sup>azwj</sup>’. ",
            "Jameel (the narrator) said, ‘So every time something occurred in my heart, I would say, ‘لَا إِلَهَ إِلَّا اللَّهُ’ ‘There is no god except for Allah<sup style=\"font-weight: normal\">azwj</sup>, and it would go away from me’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Jamil ibn Darraj who has said the following: “Once I asked abu ‘Abd Allah (a.s.) ‘A great thing happens in my heart.’ The Imam told me to say, ‘No one deserves to be worshipped except Allah.’ Jamil has said, ‘Whenever anything happens in my heart I say, ‘No one deserves to be worshipped except Allah,’ and it goes away.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/268)"
        ],
        "index": 2933,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:187:3",
        "text": [
          "ابْنُ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) فَقَالَ يَا رَسُولَ اللَّهِ هَلَكْتُ فَقَالَ لَهُ ( عليه السلام ) أَتَاكَ الْخَبِيثُ فَقَالَ لَكَ مَنْ خَلَقَكَ فَقُلْتَ اللَّهُ فَقَالَ لَكَ اللَّهُ مَنْ خَلَقَهُ فَقَالَ إِي وَ الَّذِي بَعَثَكَ بِالْحَقِّ لَكَانَ كَذَا فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) ذَاكَ وَ اللَّهِ مَحْضُ الْإِيمَانِ .",
          "قَالَ ابْنُ أَبِي عُمَيْرٍ فَحَدَّثْتُ بِذَلِكَ عَبْدَ الرَّحْمَنِ بْنَ الْحَجَّاجِ فَقَالَ حَدَّثَنِي أَبِي عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) إِنَّمَا عَنَى بِقَوْلِهِ هَذَا وَ اللَّهِ مَحْضُ الْإِيمَانِ خَوْفَهُ أَنْ يَكُونَ قَدْ هَلَكَ حَيْثُ عَرَضَ لَهُ ذَلِكَ فِي قَلْبِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Abu Umeyr, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A man came over to the Prophet<sup>saww</sup> and he said, ‘O Rasool-Allah<sup>saww</sup>! I am destroyed!’ So he<sup>saww</sup> said to him: ‘The wicked one (Satan<sup>la</sup>) came to you and he<sup>la</sup> said to you, ‘Who Created you?’ So you said, ‘Allah<sup>azwj</sup>’. So he<sup>la</sup> said to you, ‘Who Created Him<sup>azwj</sup>?’’ So he said, ‘Yes, by the One<sup>azwj</sup> Whom Sent you<sup>saww</sup> with the Truth, it was such’. So Rasool-Allah<sup>saww</sup> said: ‘That, by Allah<sup>azwj</sup>, is purity of the <span class=\"iTxt\">Emān</span>’. ",
            "Ibn Abu Umeyr (the narrator) said, ‘So I narrate with that to Abdul Rahman Bin Al-Hajjaj, and he said, ‘Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> narrated to me that Rasool-Allah<sup style=\"font-weight: normal\">saww</sup>, rather, meant by his<sup style=\"font-weight: normal\">saww</sup> words: ‘This, by Allah<sup style=\"font-weight: normal\">azwj</sup>, is purity of the <span class=\"iTxt\">Emān</span>’, fearing him that he happened to have persihed were that was displayed to him in his heart’."
          ],
          "en.sarwar": [
            "3. Ibn abu ‘Umayr has narrated from Muhammad ibn Muslim from abu ‘Abd Allah (a.s.) who has said the following: “Once a man came to the Holy Prophet and said, ‘O Messenger of Allah, I am destroyed,’ and the Messenger of Allah said, ‘Has the filthy one come to you and asked you, “Who has created you?” and you said, ‘Allah has created me,’ and he said, “Who has created Allah?” The man said, ‘Yes, by the One Who has sent you with the truth, it was just as you said. ’ The Messenger of Allah said, ‘That by Allah is pure belief.’ Ibn abu ‘Umayr has said that I told this to ‘Abd al-Rahman ibn al-Hajjaj and he said that his father narrated to him from abu ‘Abd Allah (a.s.) who has said the following: “By saying, ‘This by Allah it is pure belief the Messenger of Allah referred to his fear of temptation and to the degree that he thought it (soul’s such tale telling) is destructive.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/269)"
        ],
        "index": 2934,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:187:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنْ عَلِيِّ بْنِ مَهْزِيَارَ قَالَ كَتَبَ رَجُلٌ إِلَى أَبِي جَعْفَرٍ ( عليه السلام ) يَشْكُو إِلَيْهِ لَمَماً يَخْطُرُ عَلَى بَالِهِ فَأَجَابَهُ فِي بَعْضِ كَلَامِهِ إِنَّ اللَّهَ عَزَّ وَ جَلَّ إِنْ شَاءَ ثَبَّتَكَ فَلَا يَجْعَلُ لِإِبْلِيسَ عَلَيْكَ طَرِيقاً ",
          "قَدْ شَكَا قَوْمٌ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) لَمَماً يَعْرِضُ لَهُمْ لَأَنْ تَهْوِيَ بِهِمُ الرِّيحُ أَوْ يُقَطَّعُوا أَحَبُّ إِلَيْهِمْ مِنْ أَنْ يَتَكَلَّمُوا بِهِ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَ تَجِدُونَ ذَلِكَ قَالُوا نَعَمْ فَقَالَ وَ الَّذِي نَفْسِي بِيَدِهِ إِنَّ ذَلِكَ لَصَرِيحُ الْإِيمَانِ فَإِذَا وَجَدْتُمُوهُ فَقُولُوا آمَنَّا بِاللَّهِ وَ رَسُولِهِ وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ .",
          "‘آمَنَّا بِاللَّهِ وَ رَسُولِهِ وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ’"
        ],
        "translations": {
          "en.hubeali": [
            "A number of companions, from Sahl Bin Ziyad and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Ali Bin Mahziyar who said, ",
            "‘A man wrote to Abu Ja’far<sup>asws</sup> complaining to him<sup>asws</sup> of what tends to come upon his mind. So he<sup>asws</sup> answered in one of his<sup>asws</sup> speeches that: ‘Allah<sup>azwj</sup> Mighty and Majestic, if He<sup>azwj</sup> so Desires to, would Affirm you, so He<sup>azwj</sup> would not Make for Iblees<sup>la</sup> to have a way upon you. ",
            "A group of people had complained to the Prophet<sup>saww</sup> of what tended to present to them because it was easier for them if the wind were to sweep them away or a beloved one would be cut off from them, than that they should be speaking about it. So Rasool-Allah<sup>saww</sup> said: ‘You are finding that (to be so)?’ They said, ‘Yes’. So he<sup>saww</sup> said: ‘By the One<sup>azwj</sup> in Whose Hand is my<sup>saww</sup> soul! That is explicit <span class=\"iTxt\">Emān</span>. So whenever you find it to be so, so you should be saying, ",
            "‘We believe in Allah<sup>azwj</sup> and in His<sup>azwj</sup> Rasool<sup>saww</sup>, and there is neither any Might or Strength except with Allah<sup>azwj</sup>’’’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Sahl ibn Ziyad and Muhammad ibn Yahya from Ahmad ibn Muhammad (all them) from Ali ibn Mahziyar who has said the following: “A man wrote to abu Ja’far (a.s.) and complained about what would pass in his mind. The Imam answered him in certain parts of his words: ‘If Allah, the Most Majestic, the Most Holy, wills, He will keep you steadfast and He will not allow Satan to find way in you. Certain people complained to the Holy Prophet for what happened in their mind so much so that they liked to be blown away by the wind or being cut in pieces than to speak out of that thing in their mind. The Messenger of Allah asked, ‘Do you find that?’ They said, ‘Yes we do.’ The Messenger of Allah said, ‘By the One in whose hands is my soul that it is clear belief. Whenever you sense it say, “We believe in Allah and His Messenger and there is no means and power without Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/270)"
        ],
        "index": 2935,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:187:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ بَكْرِ بْنِ جَنَاحٍ عَنْ زَكَرِيَّا بْنِ مُحَمَّدٍ عَنْ أَبِي الْيَسَعِ دَاوُدَ الْأَبْزَارِيِّ عَنْ حُمْرَانَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ رَجُلًا أَتَى رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ يَا رَسُولَ اللَّهِ إِنَّنِي نَافَقْتُ فَقَالَ وَ اللَّهِ مَا نَافَقْتَ وَ لَوْ نَافَقْتَ مَا أَتَيْتَنِي تُعْلِمُنِي مَا الَّذِي رَابَكَ أَظُنُّ الْعَدُوَّ الْحَاضِرَ أَتَاكَ فَقَالَ لَكَ مَنْ خَلَقَكَ فَقُلْتَ اللَّهُ خَلَقَنِي فَقَالَ لَكَ مَنْ خَلَقَ اللَّهَ قَالَ إِي وَ الَّذِي بَعَثَكَ بِالْحَقِّ لَكَانَ كَذَا ",
          "فَقَالَ إِنَّ الشَّيْطَانَ أَتَاكُمْ مِنْ قِبَلِ الْأَعْمَالِ فَلَمْ يَقْوَ عَلَيْكُمْ فَأَتَاكُمْ مِنْ هَذَا الْوَجْهِ لِكَيْ يَسْتَزِلَّكُمْ فَإِذَا كَانَ كَذَلِكَ فَلْيَذْكُرْ أَحَدُكُمُ اللَّهَ وَحْدَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ismail Bin Muhammad, from Muhammad Bin Bakr Bin Janah, from Zakariyya Bin Muhammad, from Abu Al Yas’a Dawood Al Abzary, from Humran, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘A man came over to Rasool-Allah<sup>saww</sup> and he said, ‘O Rasool-Allah<sup>saww</sup>! I have become a hypocrite’. So he<sup>saww</sup> said: ‘By Allah<sup>azwj</sup> you are not so; and had you been so, you would not have come to me to let me know what is that which has caused you to doubt. I<sup>saww</sup> think the present enemy (Satan<sup>la</sup>) came over to you and he<sup>la</sup> said to you, ‘Who Created you?’ So you said, ‘Allah<sup>azwj</sup>!’. So he<sup>la</sup> said to you, ‘Who Created Allah<sup>azwj</sup>!’’. He said, ‘Yes, by the One<sup>azwj</sup> Who Sent you with the Truth, it was such’. ",
            "So he<sup>saww</sup> said: ‘The Satan<sup>la</sup> comes to you from the aspect of the deeds, but is not strong enough upon you, so he comes from this direction perhaps he<sup>la</sup> would make you waver. Therefore, whenever it was like that, so let one of you mentioned Allah<sup>azwj</sup> Alone’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Isma’il ibn Muhammad from Muhammad ibn Bakr ibn Janah from Zakariya ibn Muhammad from ibn al-Yasa’, Dawud al-Abzari has narrated from Humran from abu Ja’far (a.s.) who has said the following: “Once a man came to the Messenger of Allah and said, O Messenger of Allah, ‘I have become a hypocrite.’ The Messenger of Allah said, ‘By Allah, you have not become a hypocrite, otherwise, you would not have come to me to tell me what has made you suspicious. I think the present enemy has come to you asking, “Who has created you?” You said, ‘Allah has created me,’ and he asked, “Who has created Allah?” The man said, ‘Yes, by the One Who has sent you with the truth, it was just like that.’ The Messenger of Allah said, ‘Satan comes to you through the deeds and fails to overpower you. Then he comes to you from this aspect to make you slip, if this happens you must speak of Allah alone (and say, ‘No one deserves to be worshipped except Allah).”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:187",
  "kind": "verse_list"
}