{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 19"
        },
        "path": "/books/al-kafi:2:1:19",
        "titles": {
          "ar": "بَابُ السَّبْقِ إِلَى الْإِيمَانِ",
          "en": "Chapter 19 – The preceding (racing) to the Emān"
        }
      }
    ],
    "index": 207,
    "local_index": 19,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 20"
        },
        "path": "/books/al-kafi:2:1:20",
        "titles": {
          "ar": "بَابُ دَرَجَاتِ الْإِيمَانِ",
          "en": "Chapter 20 – Levels of the Emān"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:2:1:18",
        "titles": {
          "ar": "بَابٌ فِي أَنَّ الْإِيمَانَ مَبْثُوثٌ لِجَوَارِحِ الْبَدَنِ كُلِّهَا",
          "en": "Chapter 18 -  Regarding that the Emān (belief) spreads out to the parts of the body, all of them"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:19",
    "titles": {
      "ar": "بَابُ السَّبْقِ إِلَى الْإِيمَانِ",
      "en": "Chapter 19 – The preceding (racing) to the Emān"
    },
    "verse_count": 1,
    "verse_start_index": 1521,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/261)"
        ],
        "index": 1522,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:19:1",
        "refs": {
          "Mentions": [
            "/books/quran:58:21",
            "/books/quran:4:96",
            "/books/quran:9:20",
            "/books/quran:9:8",
            "/books/quran:56:10",
            "/books/quran:3:163",
            "/books/quran:17:55",
            "/books/quran:57:10",
            "/books/quran:11:3",
            "/books/quran:9:120",
            "/books/quran:99:8",
            "/books/quran:58:11",
            "/books/quran:2:253",
            "/books/quran:56:11",
            "/books/quran:57:21",
            "/books/quran:99:7",
            "/books/quran:2:110",
            "/books/quran:9:100",
            "/books/quran:17:21",
            "/books/quran:4:95"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ بَكْرِ بْنِ صَالِحٍ عَنِ الْقَاسِمِ بْنِ بُرَيْدٍ قَالَ حَدَّثَنَا أَبُو عَمْرٍو الزُّبَيْرِيُّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ إِنَّ لِلْإِيمَانِ دَرَجَاتٍ وَ مَنَازِلَ يَتَفَاضَلُ الْمُؤْمِنُونَ فِيهَا عِنْدَ اللَّهِ قَالَ نَعَمْ قُلْتُ صِفْهُ لِي رَحِمَكَ اللَّهُ حَتَّى أَفْهَمَهُ",
          "قَالَ إِنَّ اللَّهَ سَبَّقَ بَيْنَ الْمُؤْمِنِينَ كَمَا يُسَبَّقُ بَيْنَ الْخَيْلِ يَوْمَ الرِّهَانِ ثُمَّ فَضَّلَهُمْ عَلَى دَرَجَاتِهِمْ فِي السَّبْقِ إِلَيْهِ فَجَعَلَ كُلَّ امْرِئٍ مِنْهُمْ عَلَى دَرَجَةِ سَبْقِهِ لَا يَنْقُصُهُ فِيهَا مِنْ حَقِّهِ وَ لَا يَتَقَدَّمُ مَسْبُوقٌ سَابِقاً وَ لَا مَفْضُولٌ فَاضِلًا تَفَاضَلَ بِذَلِكَ أَوَائِلُ هَذِهِ الْأُمَّةِ وَ أَوَاخِرُهَا وَ لَوْ لَمْ يَكُنْ لِلسَّابِقِ إِلَى الْإِيمَانِ فَضْلٌ عَلَى الْمَسْبُوقِ إِذاً لَلَحِقَ آخِرُ هَذِهِ الْأُمَّةِ أَوَّلَهَا نَعَمْ وَ لَتَقَدَّمُوهُمْ إِذَا لَمْ يَكُنْ لِمَنْ سَبَقَ إِلَى الْإِيمَانِ الْفَضْلُ عَلَى مَنْ أَبْطَأَ عَنْهُ",
          "وَ لَكِنْ بِدَرَجَاتِ الْإِيمَانِ قَدَّمَ اللَّهُ السَّابِقِينَ وَ بِالْإِبْطَاءِ عَنِ الْإِيمَانِ أَخَّرَ اللَّهُ الْمُقَصِّرِينَ لِأَنَّا نَجِدُ مِنَ الْمُؤْمِنِينَ مِنَ الْآخِرِينَ مَنْ هُوَ أَكْثَرُ عَمَلًا مِنَ الْأَوَّلِينَ وَ أَكْثَرُهُمْ صَلَاةً وَ صَوْماً وَ حَجّاً وَ زَكَاةً وَ جِهَاداً وَ إِنْفَاقاً وَ لَوْ لَمْ يَكُنْ سَوَابِقُ يَفْضُلُ بِهَا الْمُؤْمِنُونَ بَعْضُهُمْ بَعْضاً عِنْدَ اللَّهِ لَكَانَ الْآخِرُونَ بِكَثْرَةِ الْعَمَلِ مُقَدَّمِينَ عَلَى الْأَوَّلِينَ وَ لَكِنْ أَبَى اللَّهُ عَزَّ وَ جَلَّ أَنْ يُدْرِكَ آخِرُ دَرَجَاتِ الْإِيمَانِ أَوَّلَهَا وَ يُقَدَّمَ فِيهَا مَنْ أَخَّرَ اللَّهُ أَوْ يُؤَخَّرَ فِيهَا مَنْ قَدَّمَ اللَّهُ ",
          "قُلْتُ أَخْبِرْنِي عَمَّا نَدَبَ اللَّهُ عَزَّ وَ جَلَّ الْمُؤْمِنِينَ إِلَيْهِ مِنَ الِاسْتِبَاقِ إِلَى الْإِيمَانِ فَقَالَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ سابِقُوا إِلى مَغْفِرَةٍ مِنْ رَبِّكُمْ وَ جَنَّةٍ عَرْضُها كَعَرْضِ السَّماءِ وَ الْأَرْضِ أُعِدَّتْ لِلَّذِينَ آمَنُوا بِاللَّهِ وَ رُسُلِهِ وَ قَالَ السَّابِقُونَ السَّابِقُونَ أُولئِكَ الْمُقَرَّبُونَ",
          "وَ قَالَ وَ السَّابِقُونَ الْأَوَّلُونَ مِنَ الْمُهاجِرِينَ وَ الْأَنْصارِ وَ الَّذِينَ اتَّبَعُوهُمْ بِإِحْسانٍ رَضِيَ اللَّهُ عَنْهُمْ وَ رَضُوا عَنْهُ فَبَدَأَ بِالْمُهَاجِرِينَ الْأَوَّلِينَ عَلَى دَرَجَةِ سَبْقِهِمْ ثُمَّ ثَنَّى بِالْأَنْصَارِ ثُمَّ ثَلَّثَ بِالتَّابِعِينَ لَهُمْ بِإِحْسَانٍ فَوَضَعَ كُلَّ قَوْمٍ عَلَى قَدْرِ دَرَجَاتِهِمْ وَ مَنَازِلِهِمْ عِنْدَهُ ",
          "ثُمَّ ذَكَرَ مَا فَضَّلَ اللَّهُ عَزَّ وَ جَلَّ بِهِ أَوْلِيَاءَهُ بَعْضَهُمْ عَلَى بَعْضٍ فَقَالَ عَزَّ وَ جَلَّ تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى بَعْضٍ مِنْهُمْ مَنْ كَلَّمَ اللَّهُ وَ رَفَعَ بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجاتٍ إِلَى آخِرِ الْآيَةِ وَ قَالَ وَ لَقَدْ فَضَّلْنا بَعْضَ النَّبِيِّينَ عَلى بَعْضٍ وَ قَالَ انْظُرْ كَيْفَ فَضَّلْنا بَعْضَهُمْ عَلى بَعْضٍ وَ لَلْآخِرَةُ أَكْبَرُ دَرَجاتٍ وَ أَكْبَرُ تَفْضِيلًا وَ قَالَ هُمْ دَرَجاتٌ عِنْدَ اللَّهِ وَ قَالَ وَ يُؤْتِ كُلَّ ذِي فَضْلٍ فَضْلَهُ",
          "وَ قَالَ الَّذِينَ آمَنُوا وَ هاجَرُوا وَ جاهَدُوا فِي سَبِيلِ اللَّهِ بِأَمْوالِهِمْ وَ أَنْفُسِهِمْ أَعْظَمُ دَرَجَةً عِنْدَ اللَّهِ وَ قَالَ فَضَّلَ اللَّهُ الْمُجاهِدِينَ عَلَى الْقاعِدِينَ أَجْراً عَظِيماً دَرَجاتٍ مِنْهُ وَ مَغْفِرَةً وَ رَحْمَةً وَ قَالَ لا يَسْتَوِي مِنْكُمْ مَنْ أَنْفَقَ مِنْ قَبْلِ الْفَتْحِ وَ قاتَلَ أُولئِكَ أَعْظَمُ دَرَجَةً مِنَ الَّذِينَ أَنْفَقُوا مِنْ بَعْدُ وَ قاتَلُوا",
          "وَ قَالَ يَرْفَعِ اللَّهُ الَّذِينَ آمَنُوا مِنْكُمْ وَ الَّذِينَ أُوتُوا الْعِلْمَ دَرَجاتٍ وَ قَالَ ذلِكَ بِأَنَّهُمْ لا يُصِيبُهُمْ ظَمَأٌ وَ لا نَصَبٌ وَ لا مَخْمَصَةٌ فِي سَبِيلِ اللَّهِ وَ لا يَطَؤُنَ مَوْطِئاً يَغِيظُ الْكُفَّارَ وَ لا يَنالُونَ مِنْ عَدُوٍّ نَيْلًا إِلَّا كُتِبَ لَهُمْ بِهِ عَمَلٌ صالِحٌ وَ قَالَ وَ ما تُقَدِّمُوا لِأَنْفُسِكُمْ مِنْ خَيْرٍ تَجِدُوهُ عِنْدَ اللَّهِ وَ قَالَ فَمَنْ يَعْمَلْ مِثْقالَ ذَرَّةٍ خَيْراً يَرَهُ وَ مَنْ يَعْمَلْ مِثْقالَ ذَرَّةٍ شَرًّا يَرَهُ ",
          "فَهَذَا ذِكْرُ دَرَجَاتِ الْإِيمَانِ وَ مَنَازِلِهِ عِنْدَ اللَّهِ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Bakr Bin Salih, from Al Qasim Bin Bureyd who said, ‘Abu Amro Al Zubeyri narrated to us, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘Are there for the <span class=\"iTxt\">Emān</span>, levels and status the <span class=\"iTxt\">Momin</span>s can have superiority regarding these in the Presence of Allah<sup>azwj</sup>?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘Describe it to me, may Allah<sup>azwj</sup> Have Mercy on you<sup>asws</sup>, until I understand it’. ",
            "He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Made a race to be between the <span class=\"iTxt\">Momin</span>s just as there is a race between the cavalry horses on the day of the contest. Then He<sup>azwj</sup> Preferred them upon their levels in their race to Him<sup>azwj</sup>. So He<sup>azwj</sup> Made every person from them upon a Level of his race, not Reducing him from his right, nor does the one lagging behind precede the preceding one, nor does the inferior (precede the) preceding one. ",
            "The first ones and the end ones of this community are preferred by that, and had there not been a superiority for the preceding ones to the <span class=\"iTxt\">Emān</span> over the ones lagging behind, then end ones of this community would certainly catch-up with its earlier ones and be in front of them. When there does not happen to be the superiority for the ones who preceded to the <span class=\"iTxt\">Emān</span>, over the ones who were slower to (embrace) it.",
            "But it is by the levels of the <span class=\"iTxt\">Emān</span> that Allah<sup>azwj</sup> Brings forward the preceding ones to the <span class=\"iTxt\">Emān</span> than the sluggish ones.  Allah<sup>azwj</sup> Delays the deficient ones, because we tend to find from the <span class=\"iTxt\">Momin</span> from the later ones, the one who is more with respect to deeds than the former ones, and more in (performing) <span class=\"iTxt\">Salāt</span>, and So<span class=\"iTxt\">ā</span>m, and Hajj, and <span class=\"iTxt\">Zakāt</span>, and <span class=\"iTxt\">Jihād</span>, and spending (on charity); and if the preceding did not happen to be the (criteria of determining the) superiority of the <span class=\"iTxt\">Momin</span> with.",
            "Some of them with the others in the Presence of Allah<sup>azwj</sup>, it would be that the later ones, due to the frequency of their deeds would be preceding (them) upon the former ones. But, Allah<sup>azwj</sup> Mighty and Majestic Refused that the ones at the end of the levels of the <span class=\"iTxt\">Emān</span> should come to its first ones, and in it the one whom Allah<sup>azwj</sup> had Delayed should precede, or he should be delayed in it the one whom Allah<sup>azwj</sup> has Made to precede.",
            "I said, ‘Inform me about what Allah<sup>azwj</sup> Mighty and Majestic has Accredited the <span class=\"iTxt\">Momin</span>s to, from the preceding to the <span class=\"iTxt\">Emān</span>’. So he<sup>asws</sup> said: ‘The Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:57#h21\">[57:21]</a> Hasten to Forgiveness from your Lord and to a Garden the extensiveness of which is as the extensiveness of the skies and the earth; it is prepared for those who believe in Allah and His Rasools</span>. And He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:56#h10\">[56:10]</a> And the foremost are the foremost, <a href=\"/#/books/quran:56#h11\">[56:11]</a> These are the ones of proximity</span>.",
            "And he<sup>asws</sup> said: ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:9#h100\">[9:100]</a> And (as for) the foremost, the first of the Emigrants and the Helpers, and those who followed them in goodness, Allah is well Pleased with them and they are well pleased with Him</span>. So He<sup>azwj</sup> Began with the Emigrants, the first ones, upon a level of their preceding, then secondly with the Helpers, then thirdly with the followers of their with goodness. Thus He<sup>azwj</sup> Placed each group upon a measurement of their levels and their status in His<sup>azwj</sup> Presence. ",
            "Then He<sup>azwj</sup> Mentioned what Allah<sup>azwj</sup> Mighty and Majestic Preferred His<sup>azwj</sup> Guardians with, some of them over the others, so the Mighty and Majestic Said <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h253\">[2:253]</a> We have made some of these Rasools to excel the others; among them are they to whom Allah Spoke, and some of them He Exalted by rank</span> – up to the end of the Verse. And He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:17#h55\">[17:55]</a> and We have Preferred some of the prophets above others</span>. And He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:17#h21\">[17:21]</a> See how We have Made some Preferrable to others, and certainly the Hereafter is greater in Levels and greater in Preferment</span>. And He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h163\">[3:163]</a> There are (varying) Levels with Allah</span>. <span class=\"ibTxt\"><a href=\"/#/books/quran:11#h3\">[11:3]</a> and Bestow His Grace on every one Endowed with merits</span>.",
            "And He<sup>azwj</sup> Said: ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:9#h20\">[9:20]</a> Those who believed and fled (their homes), and strove hard in Allah's Way with their property and their own selves, are much higher in rank with Allah</span>. And He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h95\">[4:95]</a> and Allah shall Grant to the strivers above the holders back a Mighty Recompense <a href=\"/#/books/quran:4#h96\">[4:96]</a> (High) Levels from Him and Forgiveness and Mercy</span>. And He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:57#h10\">[57:10]</a> not alike among you are those who spent before the victory and fought (and those who did not): they are more exalted in rank than those who spent and fought afterwards</span>. ",
            "And He<sup style=\"font-weight: normal\">azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:58#h11\">[58:11]</a> Allah will Exalt those of you who believe, and those who are given knowledge, in high Levels</span>. And He<sup style=\"font-weight: normal\">azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:9#h120\">[9:120]</a> this is because there afflicts them not thirst or fatigue or hunger in Allah's Way, nor do they tread a path which enrages the unMomins, nor do they attain from the enemy what they attain, but a good work is written down to them on account of it</span><span class=\"bTxt\">. </span>And He<sup style=\"font-weight: normal\">azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h110\">[2:110]</a> and whatever good you send ahead for yourselves, you shall find it with Allah</span><span class=\"bTxt\">. </span>And He<sup style=\"font-weight: normal\">azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:99#h7\">[99:7]</a> So. he who has done an atom's weight of good shall see it <a href=\"/#/books/quran:9#h8\">[9:8]</a> And he who has done an atom's weight of evil shall see it.</span>",
            "So this is a mention of the levels of the <span class=\"iTxt\">Emān</span> and its status in the Presence of Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Bakr ibn Salih from al-Qasim ibn Burayd who has said that abu ‘ Amr al-Zubayri who has said the following: “I asked abu ‘Abd Allah (a.s.) ‘Are there degrees and stages of belief in which the believers may excel in the sight of Allah?’ He said, ‘Yes, there are.’ 1 then said, ‘Explain to me, please, may Allah grant you favors, so I can understand.’ The Imam said, ‘Allah has set a contest among the believers like the contest set for horses. He then has given degrees of excellence for those who excel to win. For each contestant there He has set a level and everyone receives (a reward) exactly to the degree he has achieved. Those left behind do not go ahead of those who have advanced forward and have excelled others. Such was the case of the people who lived in the earliest period of the history of this nation and those who lived later. Had there been no distinction for those advanced in belief over those behind, the last of this nation could catch up with those of the earliest times of this nation. This certainly happens if those advancing in belief are given no distinction over those slow in their progress for belief. ‘In fact, by the degrees of belief Allah has given preference to the advancing ones, and due to slow progress in (matters of) belief Allah has left back those with shortcomings in belief. We find that of the believers of the later (generations) there are those who have many more (good) deeds than those of the earlier (generations), more prayer, fasting, Hajj al-Zakat (charity), hard work (Jihad) for the cause of Allah. Were it not for advancing being considered reason for distinction among the believers in the sight of Allah, those of later (generations) would have had superiority over those earlier, due to more deeds. However, Allah, the Most Majestic, the Most Holy, abstains from allowing the last, in degrees of belief, to reach the first and forward ones. It amounts to forwarding those whom Allah has made to be the last, and throwing back those whom Allah has made to be forward. ‘I then said, “Tell me about Allah’s call on the believers to advance in belief.’’ The Imam said, ‘It is in the words of Allah, the Most Majestic, the Most Holy, “Compete with one another to achieve forgiveness from your Lord and to reach paradise, which is as vast as the heavens and the earth, and is prepared for those who believe in Allah and His Messenger. . . .” <a href=\"/#/books/quran:58#h21\">[58:21]</a> Allah has said, “(The foremost ones) will be the nearest ones to Allah.’’ <a href=\"/#/books/quran:56#h11\">[56:11]</a> Allah has said, “Allah is well pleased with the foremost ones of those who left their homes for the cause of Allah, those who helped them after their arrival in Medina and those who nobly followed these two groups. . . .” <a href=\"/#/books/quran:9#h100\">[9:100]</a> ‘He (Allah) has begun with the first immigrants according to the degree of their advancing. He then has spoken of the Ansars (first Muslims of Madina) and thirdly He has spoken of the second generation who followed them in good deeds. He has placed each group according to their degrees and stages in the sight of Allah. Thereafter Allah, the Most Majestic, the Most Holy, has mentioned the degrees of His friends (messengers) of whom there are those who excel over the others. Allah, the Most Majestic, the Most Holy, has said, “We gave certain ones of Our Messengers preference over others. To others of them Allah spoke and He raised the rank of a number of them. . . .” <a href=\"/#/books/quran:2#h253\">[2:253]</a> ‘Allah has said, “We have given preference to certain prophets over others and We gave the psalms to David.” <a href=\"/#/books/quran:17#h55\">[17:55]</a> Allah has said, “Consider how We have given preference to certain people above others, yet the life to come has more honor and respect.” <a href=\"/#/books/quran:17#h21\">[17:21]</a> Allah has said, “People are of various grades in the sight of Allah. . . .” <a href=\"/#/books/quran:3#h163\">[3:163]</a> Allah has said, “He (Allah) will reward everyone according to his merits.” <a href=\"/#/books/quran:11#h3\">[11:3]</a> Allah has said. “To those who have believed in Allah, left their homes and fought for His cause with their possessions and in person, Allah will grant high ranks and success.” <a href=\"/#/books/quran:9#h20\">[9:20]</a> ‘Allah has said, “He will grant greater reward to those who strive for His cause than to those who stay home (for no reason). <a href=\"/#/books/quran:4#h95\">[4:95]</a> Allah will grant to those who strive, high ranks, forgiveness and mercy. . . .” <a href=\"/#/books/quran:4#h96\">[4:96]</a> Allah has said, “Those who spend for the cause of Allah and fight before victory will have higher positions than those who spend for the cause of Allah and fight after victory. . . .” <a href=\"/#/books/quran:57#h10\">[57:10]</a> Allah has said, “Allah will raise the position of the believers and of those who have received knowledge. Allah is Well-aware of what you do.” <a href=\"/#/books/quran:58#h11\">[58:11]</a> ‘Allah has said, “. . . they did not experience any hardships of thirst, fatigue or hunger in their straggle for the cause of Allah, nor has any of their traveling enraged the disbelievers, and they did not receive any injury from enemies for which Allah did not record for them a virtuous deed. . . .” <a href=\"/#/books/quran:9#h120\">[9:120]</a> Allah has said, “You will receive a good reward from Allah for all your good works. . . .” <a href=\"/#/books/quran:2#h110\">[2:110]</a> Allah has said, “Whoever has done an atom’s weight of good <a href=\"/#/books/quran:99#h7\">[99:7]</a> will see it, and whoever has done an atom’s weight of evil will also see it.” <a href=\"/#/books/quran:99#h8\">[99:8]</a> ‘Such are the stages and degrees of belief in the sight of Allah, the Most Majestic, the Most Holy.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:19",
  "kind": "verse_list"
}