{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 191"
        },
        "path": "/books/al-kafi:2:1:191",
        "titles": {
          "ar": "بَابُ التَّوْبَةِ",
          "en": "Chapter 191 – The Repentance"
        }
      }
    ],
    "index": 379,
    "local_index": 191,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 192"
        },
        "path": "/books/al-kafi:2:1:192",
        "titles": {
          "ar": "بَابُ الِاسْتِغْفَارِ مِنَ الذَّنْبِ",
          "en": "Chapter 192 – The seeking of Forgiveness from the sins"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 190"
        },
        "path": "/books/al-kafi:2:1:190",
        "titles": {
          "ar": "بَابُ مَنْ يَهُمُّ بِالْحَسَنَةِ أَوْ السَّيِّئَةِ",
          "en": "Chapter 190 – The one who intends performing the good deed or the evil deed"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:191",
    "titles": {
      "ar": "بَابُ التَّوْبَةِ",
      "en": "Chapter 191 – The Repentance"
    },
    "verse_count": 13,
    "verse_start_index": 2949,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/295)"
        ],
        "index": 2950,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:191:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِذَا تَابَ الْعَبْدُ تَوْبَةً نَصُوحاً أَحَبَّهُ اللَّهُ فَسَتَرَ عَلَيْهِ فِي الدُّنْيَا وَ الْآخِرَةِ فَقُلْتُ وَ كَيْفَ يَسْتُرُ عَلَيْهِ قَالَ يُنْسِي مَلَكَيْهِ مَا كَتَبَا عَلَيْهِ مِنَ الذُّنُوبِ وَ يُوحِي إِلَى جَوَارِحِهِ اكْتُمِي عَلَيْهِ ذُنُوبَهُ وَ يُوحِي إِلَى بِقَاعِ الْأَرْضِ اكْتُمِي مَا كَانَ يَعْمَلُ عَلَيْكِ مِنَ الذُّنُوبِ فَيَلْقَى اللَّهَ حِينَ يَلْقَاهُ وَ لَيْسَ شَيْ‏ءٌ يَشْهَدُ عَلَيْهِ بِشَيْ‏ءٍ مِنَ الذُّنُوبِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Mahboub, from Muawiya Bin Wahab who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘When the servant repents sincerely, Allah<sup>azwj</sup> Loves him, so He<sup>azwj</sup> Veils upon him in the world and the Hereafter’. So I said, ‘And how does He<sup>azwj</sup> Veil upon him?’ He<sup>asws</sup> said: ‘He<sup>azwj</sup> Causes His<sup>azwj</sup> Angels to forget what they had written against him from the sins, and He<sup>azwj</sup> Reveals unto his body parts: “Conceal his sins upon him”, and He<sup>azwj</sup> Reveals unto the spot of the earth: “Conceal what was committed upon you from the sin”. Thus, he would meet Allah<sup>azwj</sup> when he does Meet Him<sup>azwj</sup>, and there would be nothing to testify against him with anything from the sins’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Mahbub from Mu’awiyah ibn Wahab who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘When a servant (of Allah) repents in the form of the repentance of Nasuh (sincere advise to one’s soul, or name of a person who repented in the real sense), Allah then loves him, covers and protects him in this world and in the next life.’ 1 then asked, ‘How will He cover him?’ The Imam said, ‘He will make the two angels forget what they have written against him. He will inspire the parts of his body to hide his sins and the places of earth to hide the sins that he had committed thereat. Allah will meet him while there will be nothing to testify anything against him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/298)"
        ],
        "index": 2951,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:191:2",
        "refs": {
          "Quran": [
            "/books/quran:2:275"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَمَنْ جاءَهُ مَوْعِظَةٌ مِنْ رَبِّهِ فَانْتَهى فَلَهُ ما سَلَفَ قَالَ الْمَوْعِظَةُ التَّوْبَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abu Ayoub Al Khazzaz, from Muhammad Bin Muslim, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h275\">[2:275]</a> So to whomsoever then the Advice has come from his Lord, then he desists, he shall have what has already passed</span>. He<sup>asws</sup> said: ‘The advice is the repentance’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from abu Ayyub al-Khazzaz from Muhammad ibn Muslim from one of the two Imams (a.s.) who has said the following: “About the words of Allah, the Most Majestic, the Most Holy, ‘. . . one who has received advice from his Lord and has stopped committing sins will be rewarded for his previous good deeds . . .’ <a href=\"/#/books/quran:2#h275\">[2:275]</a> The Imam said, ‘Advice means repentance.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/298)"
        ],
        "index": 2952,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:191:3",
        "refs": {
          "Quran": [
            "/books/quran:66:8"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ يا أَيُّهَا الَّذِينَ آمَنُوا تُوبُوا إِلَى اللَّهِ تَوْبَةً نَصُوحاً قَالَ يَتُوبُ الْعَبْدُ مِنَ الذَّنْبِ ثُمَّ لَا يَعُودُ فِيهِ .",
          "قَالَ مُحَمَّدُ بْنُ الْفُضَيْلِ سَأَلْتُ عَنْهَا أَبَا الْحَسَنِ ( عليه السلام ) فَقَالَ يَتُوبُ مِنَ الذَّنْبِ ثُمَّ لَا يَعُودُ فِيهِ وَ أَحَبُّ الْعِبَادِ إِلَى اللَّهِ تَعَالَى الْمُفَتَّنُونَ التَّوَّابُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Ali, from Muhammad Bin Al Fuzayl, from Abu Al Sabbah Al Kinany who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:66#h8\">[66:8]</a> O you who believe! Turn to Allah with a sincere repentance</span>. He<sup>asws</sup> said: ‘The servant repents from the sin then he does not repeat it’.",
            "Muhammad Bin Al-Fuzayl said, ‘I asked Abu Al-Hassan<sup>asws</sup> about it, so he<sup>asws</sup> said: ‘He repents from the sin, then he does not repeat it, and the most Beloved of servants to Allah<sup>azwj</sup> the Exalted are the Tried ones, the repentant’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Muhammad ibn Ali from Muhammad ibn al-Fudayl from abu al-Sabah al- Kinani who has said the following: “Once I asked abu ‘Abd Allah (a.s.) about the words of Allah, the Most Majestic, the Most Holy, ‘Believers, turn to Allah in repentance, in a Nasuh manner, with the intention of never repeating the same sin.’ <a href=\"/#/books/quran:66#h8\">[66:8]</a> The Imam said, ‘It means a servant (of Allah) repents from sins and never repeats them. ’ “Muhammad ibn al-Fudayl has said, ‘I asked abu al-Hassan (a.s.) about it (repentance in a Nasuh manner) he said, ‘One repents from sin and then does not repeat it. The most beloved among the servants (of Allah) to Allah, the Most High, are those who are put to trial and who repent from sins.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/299)"
        ],
        "index": 2953,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:191:4",
        "refs": {
          "Quran": [
            "/books/quran:66:8"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي أَيُّوبَ عَنْ أَبِي بَصِيرٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) يا أَيُّهَا الَّذِينَ آمَنُوا تُوبُوا إِلَى اللَّهِ تَوْبَةً نَصُوحاً قَالَ هُوَ الذَّنْبُ الَّذِي لَا يَعُودُ فِيهِ أَبَداً قُلْتُ وَ أَيُّنَا لَمْ يَعُدْ فَقَالَ يَا أَبَا مُحَمَّدٍ إِنَّ اللَّهَ يُحِبُّ مِنْ عِبَادِهِ الْمُفَتَّنَ التَّوَّابَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abu Ayoub, from Abu Baseer who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘(What about) <span class=\"ibTxt\"><a href=\"/#/books/quran:66#h8\">[66:8]</a> O you who believe! Turn to Allah with a sincere repentance</span>?’ He<sup>asws</sup> said: ‘It is the sin which is not repeated, ever!’ I said, ‘Which of us do not repeat?’ So he<sup>asws</sup> said: ‘O Abu Muhammad! Allah<sup>azwj</sup> Loves from His<sup>azwj</sup> servant, the Tried one, the repentant’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from abu Ayyub from abu Basir who has said the following: “Once I asked abu ‘Abd Allah (a.s.) about the words of Allah, the Most Majestic, the Most Holy, ‘Believers, turn to Allah in repentance, “In a Nasuh manner,” with the intention of never repeating the same sin.’ <a href=\"/#/books/quran:66#h8\">[66:8]</a> The Imam said, ‘It is the sin that one never repeats.’ I then asked, ‘Who among us does not repeat?’ The Imam said, ‘O abu Muhammad, of His servants Allah loves those who are put to trial and the ones who repent very often.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع كالحسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/299)"
        ],
        "index": 2954,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:191:5",
        "refs": {
          "Quran": [
            "/books/quran:25:69",
            "/books/quran:25:70",
            "/books/quran:40:8",
            "/books/quran:40:9",
            "/books/quran:40:7",
            "/books/quran:2:222",
            "/books/quran:25:68"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ بَعْضِ أَصْحَابِنَا رَفَعَهُ قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَعْطَى التَّائِبِينَ ثَلَاثَ خِصَالٍ لَوْ أَعْطَى خَصْلَةً مِنْهَا جَمِيعَ أَهْلِ السَّمَاوَاتِ وَ الْأَرْضِ لَنَجَوْا بِهَا قَوْلُهُ عَزَّ وَ جَلَّ إِنَّ اللَّهَ يُحِبُّ التَّوَّابِينَ وَ يُحِبُّ الْمُتَطَهِّرِينَ فَمَنْ أَحَبَّهُ اللَّهُ لَمْ يُعَذِّبْهُ ",
          "وَ قَوْلُهُ الَّذِينَ يَحْمِلُونَ الْعَرْشَ وَ مَنْ حَوْلَهُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ... وَ يَسْتَغْفِرُونَ لِلَّذِينَ آمَنُوا رَبَّنا وَسِعْتَ كُلَّ شَيْ‏ءٍ رَحْمَةً وَ عِلْماً فَاغْفِرْ لِلَّذِينَ تابُوا وَ اتَّبَعُوا سَبِيلَكَ وَ قِهِمْ عَذابَ الْجَحِيمِ رَبَّنا وَ أَدْخِلْهُمْ جَنَّاتِ عَدْنٍ الَّتِي وَعَدْتَهُمْ وَ مَنْ صَلَحَ مِنْ آبائِهِمْ وَ أَزْواجِهِمْ وَ ذُرِّيَّاتِهِمْ إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ وَ قِهِمُ السَّيِّئاتِ وَ مَنْ تَقِ السَّيِّئاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَهُ وَ ذلِكَ هُوَ الْفَوْزُ الْعَظِيمُ",
          "وَ قَوْلُهُ عَزَّ وَ جَلَّ وَ الَّذِينَ لا يَدْعُونَ مَعَ اللَّهِ إِلهاً آخَرَ وَ لا يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ وَ لا يَزْنُونَ وَ مَنْ يَفْعَلْ ذلِكَ يَلْقَ أَثاماً يُضاعَفْ لَهُ الْعَذابُ يَوْمَ الْقِيامَةِ وَ يَخْلُدْ فِيهِ مُهاناً إِلَّا مَنْ تابَ وَ آمَنَ وَ عَمِلَ عَمَلًا صالِحاً فَأُوْلئِكَ يُبَدِّلُ اللَّهُ سَيِّئاتِهِمْ حَسَناتٍ وَ كانَ اللَّهُ غَفُوراً رَحِيماً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from one of our companions, raising it, said, ",
            "‘Allah<sup>azwj</sup> Mighty and Majestic Gave three characteristics to the repenting ones. Had He<sup>azwj</sup> Given one characteristic from it to the inhabitants of the skies and the earth, they would have attained salvation by it. The Words of the Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h222\">[2:222]</a> surely Allah Loves the repentant, and He Loves those who purify themselves</span>. So the one whom Allah<sup>azwj</sup> Loves, would not Punish him.",
            "And His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:40#h7\">[40:7]</a> Those who are bearing the Throne and those around it Glorify the Praise of their Lord and believe in Him and ask Forgiveness for those who believe: Our Lord Extends all things in Mercy and Knowledge, therefore grant Forgiveness to those who repent and follow Your Way, and save them from the Punishment of the Blazing Fire: <a href=\"/#/books/quran:40#h8\">[40:8]</a> Our Lord! And Make them enter the Gardens of Eden which You have Promised to them and those who do good of their fathers and their wives and their offspring, surely You are the Mighty, the Wise. <a href=\"/#/books/quran:40#h9\">[40:9]</a> And Save them from evil deeds, and whom You are Saving from evil deeds on this Day, indeed You hast Mercy on him, and that is the mighty achievement</span>.",
            "<span class=\"ibTxt\"><a href=\"/#/books/quran:25#h68\">[25:68]</a> And they who do not call upon another god with Allah and do not slay the soul, which Allah has Forbidden except with the right, nor are they adulterous, and the one who does that would be in sin <a href=\"/#/books/quran:25#h69\">[25:69]</a> The Punishment shall be doubled to him on the Day of Resurrection, and he shall abide therein eternally in disgrace <a href=\"/#/books/quran:25#h70\">[25:70]</a> Except for the one who repents and believes and does righteous deeds; so these are they for whom Allah would Exchange their evil deeds to good ones; and Allah is ever Forgiving, Merciful</span>’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from certain individuals of our people in a marfu ’ manner from the Imam (a.s.) who has said the following: “Allah, the Most Majestic, the Most Holy, has given three things to the repenting people. Had any of it been given to all of those in the heavens and on earth, all have had their salvation. The following words of Allah, the Most Majestic, the Most Holy, mention those three things: ‘Allah loves those who ‘Repent’ and those who cleanse themselves, <a href=\"/#/books/quran:2#h222\">[2:222]</a> whomever Allah loves He will not punish him.’ ‘The bearers of the Throne glorify their Lord with His praise. They believe in Him and ask Him to forgive the believers. They say, “Our Lord, Your mercy and knowledge encompass all things. Forgive those who turn to You in ‘Repentance’ and follow Your path. Lord, save them from the torment of hell. <a href=\"/#/books/quran:40#h7\">[40:7]</a> Lord, admit them and their fathers, spouses, and offspring who have reformed themselves to the gardens of Eden which You have promised them. You are Majestic and All-wise. <a href=\"/#/books/quran:40#h8\">[40:8]</a> “Lord, keep them away from evil deeds. Whomever You have saved from evil on the Day of Judgment has certainly been granted Your mercy and this is the greatest triumph.’ <a href=\"/#/books/quran:40#h9\">[40:9]</a> “The last thing is in the words of Allah, the Most Majestic, the Most Holy, ‘ . . . who do not worship idols besides Allah, nor without a just cause murder a soul whom Allah has granted protection, who do not commit fornication; those who do so have committed a sin <a href=\"/#/books/quran:25#h68\">[25:68]</a> and on the Day of Judgment their torment will be double. They will suffer forever in disgrace. <a href=\"/#/books/quran:25#h69\">[25:69]</a> But only those who ‘Repent’ believe and act righteously will have their sins replaced with virtue; Allah is All-forgiving and All-merciful.’” <a href=\"/#/books/quran:25#h70\">[25:70]</a> "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/302)"
        ],
        "index": 2955,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:191:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْعَلَاءِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ يَا مُحَمَّدَ بْنَ مُسْلِمٍ ذُنُوبُ الْمُؤْمِنِ إِذَا تَابَ مِنْهَا مَغْفُورَةٌ لَهُ فَلْيَعْمَلِ الْمُؤْمِنُ لِمَا يَسْتَأْنِفُ بَعْدَ التَّوْبَةِ وَ الْمَغْفِرَةِ أَمَا وَ اللَّهِ إِنَّهَا لَيْسَتْ إِلَّا لِأَهْلِ الْإِيمَانِ ",
          "قُلْتُ فَإِنْ عَادَ بَعْدَ التَّوْبَةِ وَ الِاسْتِغْفَارِ مِنَ الذُّنُوبِ وَ عَادَ فِي التَّوْبَةِ فَقَالَ يَا مُحَمَّدَ بْنَ مُسْلِمٍ أَ تَرَى الْعَبْدَ الْمُؤْمِنَ يَنْدَمُ عَلَى ذَنْبِهِ وَ يَسْتَغْفِرُ مِنْهُ وَ يَتُوبُ ثُمَّ لَا يَقْبَلُ اللَّهُ تَوْبَتَهُ ",
          "قُلْتُ فَإِنَّهُ فَعَلَ ذَلِكَ مِرَاراً يُذْنِبُ ثُمَّ يَتُوبُ وَ يَسْتَغْفِرُ اللَّهَ فَقَالَ كُلَّمَا عَادَ الْمُؤْمِنُ بِالِاسْتِغْفَارِ وَ التَّوْبَةِ عَادَ اللَّهُ عَلَيْهِ بِالْمَغْفِرَةِ وَ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ يَقْبَلُ التَّوْبَةَ وَ يَعْفُو عَنِ السَّيِّئَاتِ فَإِيَّاكَ أَنْ تُقَنِّطَ الْمُؤْمِنِينَ مِنْ رَحْمَةِ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad bin Muhammad, from Ibn Mahboub, Al A’ala, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘O Muhammad Bin Muslim! The sins of the <span class=\"iTxt\">Momin</span> when he repents from these, are Forgiven for him, so let the <span class=\"iTxt\">Momin</span> do (good deeds) to what he can resume after the repentance and the Forgiveness. But, by Allah<sup>azwj</sup>! It is not for anyone except for the people of <span class=\"iTxt\">Emān</span>’. ",
            "I said, ‘Supposing if he repeats after the repentance and the Forgiveness from the sins, and repeats in the repentance?’ So he<sup style=\"font-weight: normal\">asws</sup> said: ‘O Muhammad Bin Muslim! Do you see that <span class=\"iTxt\">Momin</span> servant regretting upon his sin and seeking Forgiveness from it and repenting, then Allah<sup style=\"font-weight: normal\">azwj</sup> does not Accept his repentance?’ ",
            "I said, ‘Supposing he does that repeatedly, sinning then repenting and seeking Forgiveness of Allah<sup style=\"font-weight: normal\">azwj</sup>?’ So he<sup style=\"font-weight: normal\">asws</sup> said: ‘Every time the <span class=\"iTxt\">Momin</span> repeats with the seeking of the Forgiveness and the repentance, Allah<sup style=\"font-weight: normal\">azwj</sup> Repeats upon him with the Forgiveness, and that Allah<sup style=\"font-weight: normal\">azwj</sup> is Most-Forgiving, the Merciful. He<sup style=\"font-weight: normal\">azwj</sup> Accepts the repentance and Forgives the evil deeds. So the <span class=\"iTxt\">Momineen</span> should beware from despairing from the Mercy of Allah<sup style=\"font-weight: normal\">azwj</sup>’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from al-‘Ala’ from Muhammad ibn Muslim from abu Ja’far (a.s.) who has said the following: “Once abu Ja’far (a.s.) said, ‘O Muhammad ibn Muslim, if believing people repent for their sins they will be forgiven. Believing people must resume their good deeds after repentance and forgiveness. By Allah, this is only for the believers.’ I then asked, ‘What if he goes back to sin after repenting and asking for forgiveness and repents again?’ The Imam said, ‘O Muhammad ibn Muslim, do you think a believing servant (of Allah) regrets his sins, asks forgiveness and repents but Allah does not accept his repentance?’ I said, ‘He, however, has done it many times. He sins, repents and asks forgiveness (from Allah).’ The Imam said, ‘Whenever a believing servant (of Allah) returns back for repentance and pleas for forgiveness, Allah returns to him with forgiveness; Allah is forgiving and merciful. He accepts repentance and effaces the evil deeds. You must never cause a believer to lose hope in the favor and mercy of Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/302)"
        ],
        "index": 2956,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:191:7",
        "refs": {
          "Quran": [
            "/books/quran:7:201"
          ]
        },
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ فَضَّالٍ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِذا مَسَّهُمْ طائِفٌ مِنَ الشَّيْطانِ تَذَكَّرُوا فَإِذا هُمْ مُبْصِرُونَ قَالَ هُوَ الْعَبْدُ يَهُمُّ بِالذَّنْبِ ثُمَّ يَتَذَكَّرُ فَيُمْسِكُ فَذَلِكَ قَوْلُهُ تَذَكَّرُوا فَإِذا هُمْ مُبْصِرُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Ibn Fazzal, from Sa’alba Bin Maymoun, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:7#h201\">[7:201]</a> Surely those who fear, when a visitation from the Satan afflicts them they become mindful, then they see</span>. He<sup>asws</sup> said: ‘He is the servant intending the sin, then he is mindful, then he withholds, so these are His<sup>azwj</sup> Words <span class=\"ibTxt\">they become mindful, then they see</span>’."
          ],
          "en.sarwar": [
            "7. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from ibn Faddal from Tha’labah ibn Maymun from abu Basir who has said the following: “Once I asked abu ‘Abd Allah (a.s.) about the words of Allah, the Most Majestic, the Most Holy, ‘When a Satanic thought starts to bother the pious ones, they understand and see the light.’ <a href=\"/#/books/quran:7#h201\">[7:201]</a> The Imam said, ‘It means that a servant (of Allah) intends to commit an evil deed then he realizes it and holds back and that is indicated in His words, ‘They understand and see.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/303)"
        ],
        "index": 2957,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:191:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ أَبِي عُبَيْدَةَ الْحَذَّاءِ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ إِنَّ اللَّهَ تَعَالَى أَشَدُّ فَرَحاً بِتَوْبَةِ عَبْدِهِ مِنْ رَجُلٍ أَضَلَّ رَاحِلَتَهُ وَ زَادَهُ فِي لَيْلَةٍ ظَلْمَاءَ فَوَجَدَهَا فَاللَّهُ أَشَدُّ فَرَحاً بِتَوْبَةِ عَبْدِهِ مِنْ ذَلِكَ الرَّجُلِ بِرَاحِلَتِهِ حِينَ وَجَدَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Abu Ubeyda Al Haza’a who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘Allah<sup>azwj</sup> the Exalted is more Intensely Happier with the repentance of His<sup>azwj</sup> servant than a man would be whose ride and his provision has strayed during a dark night, and he finds it. Allah<sup>azwj</sup> is more intensely Happy with the repentance of His<sup>azwj</sup> servant than that man would be when he finds his ride’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ‘Udhaynah from abu ‘Ubaydah al-Hadhdha’ who has said the following: “I heard abu Ja’far (a.s.) saying, ‘Allah, the Most High, is more pleased for the repentance of His servant than one who loses his animals, that carry his load and supplies, in a dark night and then finds them out. Allah is more pleased for the repentance of His servant than the person who finds his lost properties.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/304)"
        ],
        "index": 2958,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:191:9",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ عَنْ أَبِي جَمِيلَةَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ اللَّهَ يُحِبُّ الْعَبْدَ الْمُفَتَّنَ التَّوَّابَ وَ مَنْ لَمْ يَكُنْ ذَلِكَ مِنْهُ كَانَ أَفْضَلَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Ismail, from Abdullah Bin Usman, from Abu Jameela who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Loves the Tried servant, the repentant; and the one from whom that does not happen, would be superior’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Isma’il from ‘Abd Allah ibn ‘Uthman from abu Jamilah who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘Allah loves the servant who is put to trial (by sin) and repents, however, one without such (sinful) condition is better.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/304)"
        ],
        "index": 2959,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:191:10",
        "text": [
          "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ يُوسُفَ بْنِ أَبِي يَعْقُوبَ بَيَّاعِ الْأَرُزِّ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ التَّائِبُ مِنَ الذَّنْبِ كَمَنْ لَا ذَنْبَ لَهُ وَ الْمُقِيمُ عَلَى الذَّنْبِ وَ هُوَ مُسْتَغْفِرٌ مِنْهُ كَالْمُسْتَهْزِئِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ahmad Bin Muhammad, from Ali Bin Al Nu’man, from Muhammad Bin Sinan, from Yusuf Bin Abu Yaqoub Baya’a Al Aruz, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘The repentant from the sins is like the one who has not sins to him, and the one established upon the sins while he has been Forgiven from it is like the mocking one’."
          ],
          "en.sarwar": [
            "10. It is narrated from him (narrator of the Hadith above) from Ahmad ibn Muhammad from Ali ibn al-Nu’man from Muhammad ibn Sinan from Yusuf (ibn) abu Ya’qub Bayya’ al-Arz from Jabir who has said the following: “I heard abu Ja’far (a.s.) saying, ‘A person repenting from sins is like one who has not sinned. One who persists in sin and asks forgiveness is like one contemptuous of it (repentance).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/305)"
        ],
        "index": 2960,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:191:11",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَوْحَى إِلَى دَاوُدَ ( عليه السلام ) أَنِ ائْتِ عَبْدِي دَانِيَالَ فَقُلْ لَهُ إِنَّكَ عَصَيْتَنِي فَغَفَرْتُ لَكَ وَ عَصَيْتَنِي فَغَفَرْتُ لَكَ وَ عَصَيْتَنِي فَغَفَرْتُ لَكَ فَإِنْ أَنْتَ عَصَيْتَنِيَ الرَّابِعَةَ لَمْ أَغْفِرْ لَكَ ",
          "فَأَتَاهُ دَاوُدُ ( عليه السلام ) فَقَالَ يَا دَانِيَالُ إِنَّنِي رَسُولُ اللَّهِ إِلَيْكَ وَ هُوَ يَقُولُ لَكَ إِنَّكَ عَصَيْتَنِي فَغَفَرْتُ لَكَ وَ عَصَيْتَنِي فَغَفَرْتُ لَكَ وَ عَصَيْتَنِي فَغَفَرْتُ لَكَ فَإِنْ أَنْتَ عَصَيْتَنِيَ الرَّابِعَةَ لَمْ أَغْفِرْ لَكَ فَقَالَ لَهُ دَانِيَالُ قَدْ أَبْلَغْتَ يَا نَبِيَّ اللَّهِ ",
          "فَلَمَّا كَانَ فِي السَّحَرِ قَامَ دَانِيَالُ فَنَاجَى رَبَّهُ فَقَالَ يَا رَبِّ إِنَّ دَاوُدَ نَبِيَّكَ أَخْبَرَنِي عَنْكَ أَنَّنِي قَدْ عَصَيْتُكَ فَغَفَرْتَ لِي وَ عَصَيْتُكَ فَغَفَرْتَ لِي وَ عَصَيْتُكَ فَغَفَرْتَ لِي وَ أَخْبَرَنِي عَنْكَ أَنَّنِي إِنْ عَصَيْتُكَ الرَّابِعَةَ لَمْ تَغْفِرْ لِي فَوَ عِزَّتِكَ لَئِنْ لَمْ تَعْصِمْنِي لَأَعْصِيَنَّكَ ثُمَّ لَأَعْصِيَنَّكَ ثُمَّ لَأَعْصِيَنَّكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and a number of our companions, from Sahl Bin Ziyad, altogether from Ibn Mahboub, from Abu Hamza, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Revealed unto Dawood: “Go to My<sup>azwj</sup> servant Daniel and say to him, “You disobeyed Me<sup>azwj</sup> and I<sup>azwj</sup> Forgave you, so you disobeyed Me<sup>azwj</sup> and I<sup>azwj</sup> Forgave you, so you disobeyed Me<sup>azwj</sup> and I<sup>azwj</sup> Forgave you. But if you were to disobey Me<sup>azwj</sup> fourthly, I<sup>azwj</sup> will not Forgive you”. ",
            "So Dawood<sup style=\"font-weight: normal\">as</sup> went over and said: ‘O Daniel! I<sup style=\"font-weight: normal\">as</sup> am a Rasool<sup style=\"font-weight: normal\">as</sup> of Allah<sup style=\"font-weight: normal\">azwj</sup> to you and He<sup style=\"font-weight: normal\">azwj</sup> is Saying to you “You disobeyed Me<sup style=\"font-weight: normal\">azwj</sup> and I<sup style=\"font-weight: normal\">azwj</sup> Forgave you, so you disobeyed Me<sup style=\"font-weight: normal\">azwj</sup> and I<sup style=\"font-weight: normal\">azwj</sup> Forgave you, so you disobeyed Me<sup style=\"font-weight: normal\">azwj</sup> and I<sup style=\"font-weight: normal\">azwj</sup> Forgave you. But if you were to disobey Me<sup style=\"font-weight: normal\">azwj</sup> fourthly, I<sup style=\"font-weight: normal\">azwj</sup> will not Forgive you”. So Daniel said to him<sup style=\"font-weight: normal\">as</sup>, ‘You<sup style=\"font-weight: normal\">as</sup> have delivered (the Message), O Prophet<sup style=\"font-weight: normal\">as</sup> of Allah<sup style=\"font-weight: normal\">azwj</sup>!’. ",
            "So when it was the next morning, Daniel stood and whispered to his Lord<sup style=\"font-weight: normal\">azwj</sup> and he said, ‘O Lord<sup style=\"font-weight: normal\">azwj</sup>! Dawood<sup style=\"font-weight: normal\">as</sup>, Your<sup style=\"font-weight: normal\">azwj</sup> Prophet<sup style=\"font-weight: normal\">saww</sup> informed me that I disobeyed You<sup style=\"font-weight: normal\">azwj</sup> so You<sup style=\"font-weight: normal\">azwj</sup> Forgave me, and I disobeyed You<sup style=\"font-weight: normal\">azwj</sup>, so You<sup style=\"font-weight: normal\">azwj</sup> Forgave me, and I disobeyed You<sup style=\"font-weight: normal\">azwj</sup>, so You<sup style=\"font-weight: normal\">azwj</sup> Forgave me, and he<sup style=\"font-weight: normal\">as</sup> informed me from You<sup style=\"font-weight: normal\">azwj</sup> that if I were to disobey You<sup style=\"font-weight: normal\">azwj</sup> for the fourth time, You<sup style=\"font-weight: normal\">azwj</sup> will not be Forgiving me. So, by Your<sup style=\"font-weight: normal\">azwj</sup> Might, if You<sup style=\"font-weight: normal\">azwj</sup> will not Defend me, I will (end up) disobeying You<sup style=\"font-weight: normal\">azwj</sup>, then I will (end up) disobeying You<sup style=\"font-weight: normal\">azwj</sup>, and I (end up) will disobeying You<sup style=\"font-weight: normal\">azwj</sup>’’."
          ],
          "en.sarwar": [
            "11. Ali ibn Ibrahim has narrated from his father and a number of our people have narrated from Sahl ibn Ziyad all from ibn Mahbub from abu Hamza from abu Ja’far (a.s.) who has said the following: “Allah, the Most Majestic, the Most Holy, sent revelation to David, ‘Meet My servant Daniel and say to him, ‘You have disobeyed Me and I forgave you, you disobeyed Me, I forgave you, you disobeyed Me and I forgave you. If you will disobey Me the forth time I will not forgive you.’ David went to meet Daniel and said, ‘O Daniel, I am the Messenger of Allah and He says to you, “You disobeyed Me and I forgave you, you disobeyed Me and I forgave you, you disobeyed Me and I forgave you. If you will disobey Me the forth time I will not forgive you.’” Daniel said, ‘O prophet of Allah, you have conveyed your message.’ In the early morning Daniel woke up and prayed to his Lord, saying, ‘O Lord, Your prophet David informed me that I have disobeyed You and You forgave me, I disobeyed You and You forgave me, I disobeyed You and You forgave me and if I will disobey You the forth time You will not forgive me. I swear by Your Majesty, if You will not protect me I will certainly disobey You, I will certainly disobey You, I will certainly disobey You.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/305)"
        ],
        "index": 2961,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:191:12",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُوسَى بْنِ الْقَاسِمِ عَنْ جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِذَا تَابَ الْعَبْدُ تَوْبَةً نَصُوحاً أَحَبَّهُ اللَّهُ فَسَتَرَ عَلَيْهِ فَقُلْتُ وَ كَيْفَ يَسْتُرُ عَلَيْهِ قَالَ يُنْسِي مَلَكَيْهِ مَا كَانَا يَكْتُبَانِ عَلَيْهِ وَ يُوحِي اللَّهُ إِلَى جَوَارِحِهِ وَ إِلَى بِقَاعِ الْأَرْضِ أَنِ اكْتُمِي عَلَيْهِ ذُنُوبَهُ فَيَلْقَى اللَّهَ عَزَّ وَ جَلَّ حِينَ يَلْقَاهُ وَ لَيْسَ شَيْ‏ءٌ يَشْهَدُ عَلَيْهِ بِشَيْ‏ءٍ مِنَ الذُّنُوبِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Musa Bin Al Qasim, from his grandfather Al Hassan Bin Rashid, from Muawiya Bin Wahab who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘When the servant repents with a sincere repentance, Allah<sup>azwj</sup> Loves him, so He<sup>azwj</sup> Veils upon him’. So I said, ‘And how does He<sup>azwj</sup> Veil upon him?’ He<sup>asws</sup> said: ‘He<sup>azwj</sup> Causes His<sup>azwj</sup> Angels who used to Record upon him to forget, and He<sup>azwj</sup> Reveals unto his body parts and unto the spot of the earth that they conceal his sins upon him. Thus, he would meet Allah<sup>azwj</sup> Mighty and Majestic when he does Meet him, and there would be nothing to testify against him for anything from the sins’."
          ],
          "en.sarwar": [
            "12. A number of our people have narrated from Ahmad ibn Muhammad from Musa ibn al-Qasim from his grandfather al-Hassan ibn Rashid from Mu’awiyah ibn Wahab who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘When a servant (of Allah) repents in the form of the repentance of Nasuh (sincerely repenting) Allah loves him and covers him up.’ I then asked, ‘How He covers him up?’ The Imam said, ‘He makes his two angels forget whatever they have written against him and Allah sends inspiration to the parts of his body and to the parts of the earth to hide his sins and he will meet Allah, the Most Majestic, the Most Holy in his meeting while there will be no one to testify anything against him for his sins.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/306)"
        ],
        "index": 2962,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:191:13",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الْأَشْعَرِيِّ عَنِ ابْنِ الْقَدَّاحِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَفْرَحُ بِتَوْبَةِ عَبْدِهِ الْمُؤْمِنِ إِذَا تَابَ كَمَا يَفْرَحُ أَحَدُكُمْ بِضَالَّتِهِ إِذَا وَجَدَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ja’far Bin Muhammad Al Ashary, from Ibn Al Qaddah, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> is as Happy with the repentance of his <span class=\"iTxt\">Momin</span> servant when he repents, just as one of you is happy with his lost property when he finds it’."
          ],
          "en.sarwar": [
            "13. A number of our people have narrated from Sahl ibn Ziyad from Ja’far ibn Muhammad al-Ash’ari from ibn al-Qaddah from abu ‘Abd Allah (a.s.) who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘The repentance of a servant (of Allah) from sins pleases Allah, the Majestic, the Glorious, more than a person’s finding a dearly cherished thing that he has lost.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:191",
  "kind": "verse_list"
}