{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 198"
        },
        "path": "/books/al-kafi:2:1:198",
        "titles": {
          "ar": "بَابٌ نَادِرٌ",
          "en": "Chapter 198 - Miscellaneous"
        }
      }
    ],
    "index": 386,
    "local_index": 198,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 199"
        },
        "path": "/books/al-kafi:2:1:199",
        "titles": {
          "ar": "بَابٌ نَادِرٌ أَيْضاً",
          "en": "Chapter 199 – Miscellaneous as well"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 197"
        },
        "path": "/books/al-kafi:2:1:197",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابٌ فِي تَفْسِيرِ</span> الذُّنُوبِ",
          "en": "Chapter 197 – Regarding the interpretation of the sins"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:198",
    "titles": {
      "ar": "بَابٌ نَادِرٌ",
      "en": "Chapter 198 - Miscellaneous"
    },
    "verse_count": 1,
    "verse_start_index": 2999,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/344)"
        ],
        "index": 3000,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/704",
              "text": "عَبْدِ الْعَزِيزِ الْعَبْدِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/68",
              "text": "ابْنِ أَبِي يَعْفُورٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَبْدِ الْعَزِيزِ الْعَبْدِيِّ عَنِ ابْنِ أَبِي يَعْفُورٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:198:1",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ قَالَ اللَّهُ عَزَّ وَ جَلَّ إِنَّ الْعَبْدَ مِنْ عَبِيدِيَ الْمُؤْمِنِينَ لَيُذْنِبُ الذَّنْبَ الْعَظِيمَ مِمَّا يَسْتَوْجِبُ بِهِ عُقُوبَتِي فِي الدُّنْيَا وَ الْآخِرَةِ فَأَنْظُرُ لَهُ فِيمَا فِيهِ صَلَاحُهُ فِي آخِرَتِهِ فَأُعَجِّلُ لَهُ الْعُقُوبَةَ عَلَيْهِ فِي الدُّنْيَا لِأُجَازِيَهُ بِذَلِكَ الذَّنْبِ وَ أُقَدِّرُ عُقُوبَةَ ذَلِكَ الذَّنْبِ ",
          "وَ أَقْضِيهِ وَ أَتْرُكُهُ عَلَيْهِ مَوْقُوفاً غَيْرَ مُمْضًى وَ لِي فِي إِمْضَائِهِ الْمَشِيئَةُ وَ مَا يَعْلَمُ عَبْدِي بِهِ فَأَتَرَدَّدُ فِي ذَلِكَ مِرَاراً عَلَى إِمْضَائِهِ ثُمَّ أُمْسِكُ عَنْهُ فَلَا أُمْضِيهِ كَرَاهَةً لِمَسَاءَتِهِ وَ حَيْداً عَنْ إِدْخَالِ الْمَكْرُوهِ عَلَيْهِ فَأَتَطَوَّلُ عَلَيْهِ بِالْعَفْوِ عَنْهُ وَ الصَّفْحِ مَحَبَّةً لِمُكَافَاتِهِ لِكَثِيرِ نَوَافِلِهِ الَّتِي يَتَقَرَّبُ بِهَا إِلَيَّ فِي لَيْلِهِ وَ نَهَارِهِ ",
          "فَأَصْرِفُ ذَلِكَ الْبَلَاءَ عَنْهُ وَ قَدْ قَدَّرْتُهُ وَ قَضَيْتُهُ وَ تَرَكْتُهُ مَوْقُوفاً وَ لِي فِي إِمْضَائِهِ الْمَشِيئَةُ ثُمَّ أَكْتُبُ لَهُ عَظِيمَ أَجْرِ نُزُولِ ذَلِكَ الْبَلَاءِ وَ أَدَّخِرُهُ وَ أُوَفِّرُ لَهُ أَجْرَهُ وَ لَمْ يَشْعُرْ بِهِ وَ لَمْ يَصِلْ إِلَيْهِ أَذَاهُ وَ أَنَا اللَّهُ الْكَرِيمُ الرَّءُوفُ الرَّحِيمُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Mahboub, from Abdul Aziz Al Abady, from Ibn Abu Yafour who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Allah<sup>azwj</sup> Mighty and Majestic is Saying: “The servant from My<sup>azwj</sup> <span class=\"iTxt\">Momin</span> servants commits the grievous sin from what Obligates My<sup>azwj</sup> Punishment by it in the world and in the Hereafter. So I<sup>azwj</sup> Respite for him regarding what is correct for him in his Hereafter. So I<sup>azwj</sup> Hasten the Punishment upon him in the world in order to suffice the sin with that, although I<sup>azwj</sup> am Able upon that Punishment. ",
            "And I<sup>azwj</sup> Ordain it and Leave it pending upon him without it coming to pass, and for Me<sup>azwj</sup> in its pending, is the Desire; and My<sup>azwj</sup> servant does not know of it. So I<sup>azwj</sup> Hesitate during that time and again upon its coming to pass. Then I<sup>azwj</sup> Withhold it from him and I<sup>azwj</sup> do not Make it come to pass, Disliking for it being for his lone evil deed (and) from causing the abhorrence to enter upon him. So I<sup>azwj</sup> Prolong upon him with the Pardoning from him and the Forgiveness of Loving to Off-set it due to the abundance of his optional (<span class=\"iTxt\">Salāt</span>) by which he comes closer to Me<sup>azwj</sup> with during his night and his day.",
            "So I<sup style=\"font-weight: normal\">azwj</sup> Exchange that affliction from him, although I<sup style=\"font-weight: normal\">azwj</sup> had Ordained it, and Decided it, and left it pending, and for Me<sup style=\"font-weight: normal\">azwj</sup> in its pending is the Desire. Then I<sup style=\"font-weight: normal\">azwj</sup> Write the great recompense for him for the descent of that affliction, and I<sup style=\"font-weight: normal\">azwj</sup> Hoard it to be Given to him as his Recompense and he is not aware of it, and it (affliction) does not arrive to him to harm him, and I<sup style=\"font-weight: normal\">azwj</sup> am Allah<sup style=\"font-weight: normal\">azwj</sup>, the Benevolent, the Kind, the Merciful’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Mahbub from ‘Abd al-‘Aziz al-‘Abdi from ibn abu Ya’fur who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘Allah, the Most Majestic, the Most Holy, has said, “A servant among My believing servants commits a great sin that will make him subject to My punishment in this world and in the next life. I then see what is best for him in his next life. I then like to speed up punishment for him in this world to get even for that sin. I determine the punishment for that sin and make a decision about it. I then keep it on hold without executing and, in its execution I have a wish, and My servant does not know about it. 1 then hesitate many times in its execution. I then keep it on hold and do not execute; I dislike making him suffer and avoid sending affliction upon him. I then grant him forgiveness and ignore (his sin) because of love for his offsetting the sin through his many optional prayers at nights, as well as during the day, with which he tries to get closer to Me. I then divert the misfortune from him even though I had already determined, decided and had kept it on hold and for its execution I had a wish. I then write for him a great reward for the ‘Would be coming misfortune’ upon him. I preserve it for him, make his reward available and he does not realize it. No trouble or misfortune reaches him. I am Allah, the Honorable, the Compassionate, the Merciful.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:198",
  "kind": "verse_list"
}