{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 199"
        },
        "path": "/books/al-kafi:2:1:199",
        "titles": {
          "ar": "بَابٌ نَادِرٌ أَيْضاً",
          "en": "Chapter 199 – Miscellaneous as well"
        }
      }
    ],
    "index": 387,
    "local_index": 199,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 200"
        },
        "path": "/books/al-kafi:2:1:200",
        "titles": {
          "ar": "بَابُ أَنَّ اللَّهَ يَدْفَعُ بِالْعَامِلِ عَنْ غَيْرِ الْعَامِلِ",
          "en": "Chapter 200 – Allah<sup>azwj</sup> Defends the workers (of good deeds) from other than the workers (of good deeds)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 198"
        },
        "path": "/books/al-kafi:2:1:198",
        "titles": {
          "ar": "بَابٌ نَادِرٌ",
          "en": "Chapter 198 - Miscellaneous"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:199",
    "titles": {
      "ar": "بَابٌ نَادِرٌ أَيْضاً",
      "en": "Chapter 199 – Miscellaneous as well"
    },
    "verse_count": 3,
    "verse_start_index": 3000,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/346)"
        ],
        "index": 3001,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:199:1",
        "refs": {
          "Quran": [
            "/books/quran:42:30"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ ما أَصابَكُمْ مِنْ مُصِيبَةٍ فَبِما كَسَبَتْ أَيْدِيكُمْ فَقَالَ هُوَ وَ يَعْفُوا عَنْ كَثِيرٍ قَالَ قُلْتُ لَيْسَ هَذَا أَرَدْتُ أَ رَأَيْتَ مَا أَصَابَ عَلِيّاً وَ أَشْبَاهَهُ مِنْ أَهْلِ بَيْتِهِ ( عليهم السلام ) مِنْ ذَلِكَ فَقَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ يَتُوبُ إِلَى اللَّهِ فِي كُلِّ يَوْمٍ سَبْعِينَ مَرَّةً مِنْ غَيْرِ ذَنْبٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:42#h30\">[42:30]</a> And whatever affliction befalls you, it is on account of what your hands have wrought</span>. So he<sup>asws</sup> said: ‘<span class=\"ibTxt\">and (yet) He Pardons most (of your faults)</span>’. I said, ‘Is it not this which I intended. What is your<sup>asws</sup> view of what hit Ali<sup>asws</sup> and his<sup>asws</sup> like from the People<sup>asws</sup> of his<sup>asws</sup> Household, from that?’ So he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> used to turn to Allah<sup>azwj</sup> during every day, seventy times, from without having sinned’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from ibn Bukayr who has said the following: “Once I asked abu ‘Abd Allah (a.s.) about the words of Allah, the Most Majestic, the Most Holy, ‘Whatever affliction befalls you is because of what your hands have obtained. ’<a href=\"/#/books/quran:42#h30\">[42:30]</a> The Imam said, ‘. . . He forgives a great deal,’ <a href=\"/#/books/quran:42#h30\">[42:30]</a> I (the narrator) then said, ‘I did not mean in that sense. Consider what befell Ali (a.s.) and people like him from Ahl al-Bayt (family of Holy Prophet).’ The Imam said, ‘The Messenger of Allah would plead, to return before Allah seventy times a day without committing any sin.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/347)"
        ],
        "index": 3002,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:199:2",
        "refs": {
          "Quran": [
            "/books/quran:42:30",
            "/books/quran:42:29"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ ما أَصابَكُمْ مِنْ مُصِيبَةٍ فَبِما كَسَبَتْ أَيْدِيكُمْ أَ رَأَيْتَ مَا أَصَابَ عَلِيّاً وَ أَهْلَ بَيْتِهِ ( عليهم السلام ) مِنْ بَعْدِهِ هُوَ بِمَا كَسَبَتْ أَيْدِيهِمْ وَ هُمْ أَهْلُ بَيْتِ طَهَارَةٍ مَعْصُومُونَ ",
          "فَقَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ يَتُوبُ إِلَى اللَّهِ وَ يَسْتَغْفِرُهُ فِي كُلِّ يَوْمٍ وَ لَيْلَةٍ مِائَةَ مَرَّةٍ مِنْ غَيْرِ ذَنْبٍ إِنَّ اللَّهَ يَخُصُّ أَوْلِيَاءَهُ بِالْمَصَائِبِ لِيَأْجُرَهُمْ عَلَيْهَا مِنْ غَيْرِ ذَنْبٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, and Ali Bin Ibrahim, from his father, altogether from Ibn Mahboub, from Ali bin Ra’ib who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:42#h30\">[42:30]</a> And whatever affliction befalls you, it is on account of what your hands have wrought</span>. What is your<sup>asws</sup> view of what hit Ali<sup>asws</sup> and the People<sup>asws</sup> of his<sup>asws</sup> Household from after him<sup>asws</sup>, is it due to that their<sup>asws</sup> hands had wrought and they<sup>asws</sup> are the Pure People<sup>asws</sup> of the Household, the infallible?’ ",
            "So he<sup style=\"font-weight: normal\">asws</sup> said: ‘Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> used to turn to Allah<sup style=\"font-weight: normal\">azwj</sup> and seek His<sup style=\"font-weight: normal\">azwj</sup> Forgiveness during every day and night, one hundred times, from without having had sinned. Allah<sup style=\"font-weight: normal\">azwj</sup> Particularised His<sup style=\"font-weight: normal\">azwj</sup> Guardians<sup style=\"font-weight: normal\">asws</sup> with the difficulties in order to Recompense them<sup style=\"font-weight: normal\">asws</sup> from without then<sup style=\"font-weight: normal\">asws</sup> having had sinned’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Sahl ibn Ziyad and Ali ibn Ibrahim has narrated from his father all from ibn Mahbub from Ali ibn Ri’ab who has said the following: “Once I asked abu ‘Abd Allah (a.s.) about the words of Allah, the Most Majestic, the Most Holy, ‘Whatever afflictions befall you is because of what your hands have obtained,’ <a href=\"/#/books/quran:42#h29\">[42:29]</a> do you consider whatever befell Ali and his family (a.s.) after him was because of their deeds and acquisition of their hands despite the fact that they were members of the family of al- Taharah (cleansed by the will of Allah), the infallible people?’ The Imam said, ‘The Messenger of Allah would plead, to return, before Allah seventy times every day and night without any sins. Allah wants his friends, especially, to suffer so He may grant them rewards without sins.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/348)"
        ],
        "index": 3003,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:199:3",
        "refs": {
          "Quran": [
            "/books/quran:42:30",
            "/books/quran:57:22"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ رَفَعَهُ قَالَ لَمَّا حُمِلَ عَلِيُّ بْنُ الْحُسَيْنِ ( صلوات الله عليه )  إِلَى يَزِيدَ بْنِ مُعَاوِيَةَ فَأُوقِفَ بَيْنَ يَدَيْهِ قَالَ يَزِيدُ لَعَنَهُ اللَّهُ وَ ما أَصابَكُمْ مِنْ مُصِيبَةٍ فَبِما كَسَبَتْ أَيْدِيكُمْ فَقَالَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) لَيْسَتْ هَذِهِ الْآيَةُ فِينَا إِنَّ فِينَا قَوْلَ اللَّهِ عَزَّ وَ جَلَّ ما أَصابَ مِنْ مُصِيبَةٍ فِي الْأَرْضِ وَ لا فِي أَنْفُسِكُمْ إِلَّا فِي كِتابٍ مِنْ قَبْلِ أَنْ نَبْرَأَها إِنَّ ذلِكَ عَلَى اللَّهِ يَسِيرٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, raising it, said, ",
            "‘When Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> taken to Yazeed Bin Muawiya<sup>la</sup>, so he<sup>asws</sup> was paused in front of him<sup>la</sup>. Yazeed<sup>la</sup>, may Allah<sup>azwj</sup> Curse him<sup>la</sup> said, ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:42#h30\">[42:30]</a> And whatever affliction befalls you, it is on account of what your hands have wrought</span>’. So Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said: ‘This Verse is not regarding us<sup>asws</sup>, (but it is) the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:57#h22\">[57:22]</a> No difficulty befalls upon the earth nor upon your own souls, but it is in a Book before We Bring it into existence; surely that is easy for Allah</span>’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated in a marfu’ manner has narrated from abu ‘Abd Allah (a.s.) who has said the following: “When Ali ibn al-Husayn (a.s.) was taken as a captive to Damascus and was made to stand before Yazid ibn Mu’awiyah, he, (Yazid) may Allah condemn him, read this verse: ‘Whatever affliction befalls you is because of what your hands have obtained,’ <a href=\"/#/books/quran:42#h30\">[42:30]</a> Ali ibn al-Husayn (a.s.) said, ‘This verse is not about us. What applies to us are the words of Allah, the Most Majestic, the Most Holy, ‘Whatever hardships you face on earth and in your souls, were written in the Book before the creation of souls. This is certainly easy for Allah.’” <a href=\"/#/books/quran:57#h22\">[57:22]</a> "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:199",
  "kind": "verse_list"
}