{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 2"
        },
        "path": "/books/al-kafi:2:1:2",
        "titles": {
          "ar": "بَابٌ آخَرُ مِنْهُ وَ فِيهِ زِيَادَةُ وُقُوعِ التَّكْلِيفِ الْأَوَّلِ",
          "en": "Chapter 2 – Another Chapter from it, and in it is an increase – Occurrence of the first Mandate"
        }
      }
    ],
    "index": 190,
    "local_index": 2,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:2:1:3",
        "titles": {
          "ar": "بَابٌ آخَرُ مِنْهُ",
          "en": "Chapter 3 – Another Chapter from it"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 1"
        },
        "path": "/books/al-kafi:2:1:1",
        "titles": {
          "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>َابُ طِينَةِ الْمُؤْمِنِ</span> وَ الْكَافِرِ",
          "en": "Chapter 1 – The clay of the Momin (Believer) and the disbeliever (Kafir)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:2",
    "titles": {
      "ar": "بَابٌ آخَرُ مِنْهُ وَ فِيهِ زِيَادَةُ وُقُوعِ التَّكْلِيفِ الْأَوَّلِ",
      "en": "Chapter 2 – Another Chapter from it, and in it is an increase – Occurrence of the first Mandate"
    },
    "verse_count": 3,
    "verse_start_index": 1448,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/16)"
        ],
        "index": 1449,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:2:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َبُو عَلِيٍّ الْأَشْعَرِيُّ</span> وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَوْ عَلِمَ النَّاسُ كَيْفَ ابْتِدَاءُ الْخَلْقِ مَا اخْتَلَفَ اثْنَانِ إِنَّ اللَّهَ عَزَّ وَ جَلَّ قَبْلَ أَنْ يَخْلُقَ الْخَلْقَ قَالَ كُنْ مَاءً عَذْباً أَخْلُقْ مِنْكَ جَنَّتِي وَ أَهْلَ طَاعَتِي وَ كُنْ مِلْحاً أُجَاجاً أَخْلُقْ مِنْكَ نَارِي وَ أَهْلَ مَعْصِيَتِي",
          "ثُمَّ أَمَرَهُمَا فَامْتَزَجَا فَمِنْ ذَلِكَ صَارَ يَلِدُ الْمُؤْمِنُ الْكَافِرَ وَ الْكَافِرُ الْمُؤْمِنَ ثُمَّ أَخَذَ طِيناً مِنْ أَدِيمِ الْأَرْضِ فَعَرَكَهُ عَرْكاً شَدِيداً فَإِذَا هُمْ كَالذَّرِّ يَدِبُّونَ فَقَالَ لِأَصْحَابِ الْيَمِينِ إِلَى الْجَنَّةِ بِسَلَامٍ وَ قَالَ لِأَصْحَابِ الشِّمَالِ إِلَى النَّارِ وَ لَا أُبَالِي ",
          "ثُمَّ أَمَرَ نَاراً فَأُسْعِرَتْ فَقَالَ لِأَصْحَابِ الشِّمَالِ ادْخُلُوهَا فَهَابُوهَا فَقَالَ لِأَصْحَابِ الْيَمِينِ ادْخُلُوهَا فَدَخَلُوهَا فَقَالَ كُونِي بَرْداً وَ سَلَاماً فَكَانَتْ بَرْداً وَ سَلَاماً فَقَالَ أَصْحَابُ الشِّمَالِ يَا رَبِّ أَقِلْنَا فَقَالَ قَدْ أَقَلْتُكُمْ فَادْخُلُوهَا فَذَهَبُوا فَهَابُوهَا فَثَمَّ ثَبَتَتِ الطَّاعَةُ وَ الْمَعْصِيَةُ فَلَا يَسْتَطِيعُ هَؤُلَاءِ أَنْ يَكُونُوا مِنْ هَؤُلَاءِ وَ لَا هَؤُلَاءِ مِنْ هَؤُلَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary and Muhammad Bin Yahya, from Muhammad Bin Ismail, from Ali Bin Al Hakam, from Aban Bin Usman, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> having said: ‘If the people knew how the creation began, no two would differ. Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic, before He<sup style=\"font-weight: normal\">azwj</sup> Began the creation, Said: “Be sweet water! I<sup style=\"font-weight: normal\">azwj</sup> shall Create from you, My<sup style=\"font-weight: normal\">azwj</sup> Paradise and the people who obey Me<sup style=\"font-weight: normal\">azwj</sup>. And be bitter water! I<sup style=\"font-weight: normal\">azwj</sup> shall Create from you, My<sup style=\"font-weight: normal\">azwj</sup> Fire and the people who disobey Me<sup style=\"font-weight: normal\">azwj</sup>”.",
            "Then, He<sup style=\"font-weight: normal\">azwj</sup> Commanded both of them, so they were blended. Thus, from that the Believer came to beget the disbeliever, and the disbeliever (begetting) the Believer. Then he (the Kalimat-Allah<sup style=\"font-weight: normal\">azwj</sup>) grabbed a clay from the crust of the earth, and kneaded it with an intense kneading, and they were like the particles, crawling. So He<sup style=\"font-weight: normal\">azwj</sup> said to the companions of the right hand: “To the Paradise in peace”, and Said to the companions of the left hand: “To the Fire, and I<sup style=\"font-weight: normal\">azwj</sup> don’t Care”.",
            "Then He<sup style=\"font-weight: normal\">azwj</sup> Commanded a fire, so it inflamed, and He<sup style=\"font-weight: normal\">azwj</sup> Said to the companions of the left: “Enter into it”. But they were terrified of it. So He<sup style=\"font-weight: normal\">azwj</sup> Said to the companions of the right: “Enter into it”. So they entered it. So He<sup style=\"font-weight: normal\">azwj</sup> Said: “Be cool and a safety”. So it was cool and safe. So the companions of the left said, ‘O Lord! Forgive us!’ So He <sup style=\"font-weight: normal\">azwj</sup>Said: “I Forgive you. So enter into it’. So they went but were terrified of it. So from then was affirmed the obedience and the disobedience. Thus, these ones do not have the capacity that they happen to be from those, and those ones do not have the capacity to be from these’."
          ],
          "en.sarwar": [
            "1. Abu Ali al-Ash’ari and Muhammad ibn Yahya have narrated from Muhammad ibn ‘Isma’il from Ali ibn al-Hakam from Aban ibn ‘Uthman from Zurara from abu Ja’far (a.s.) who has said the following: “Had people known how the beginning of the creation was, no one would have disagreed with another person. Allah, the Majestic, the Glorious, before creating the creatures said, ‘Be a sweet water so I create from you My paradise and people who obey My commands. Be very salty water; from you I create My fire and those who disobey Me.’ He then commanded them to mix and from this the believers give birth to unbelievers and the unbelievers give birth to the believers. Then He took a clay from the surface of the earth and kneaded it very strongly whereby they (children of Adam) appeared as particles crawling about. He then said to the people of the right hand, ‘To paradise (you go) in peace.’ To the people of the left hand He said, ‘To the fire (you go) and I am not concerned.’ He then commanded a fire that began to blaze and He said to the people of the left hand, ‘Enter therein.’ They then were frightened thereby. He then said to the people of the right hand, ‘Enter the fire.’ They then entered therein and He said, ‘O fire be cool and peaceful.’ The fire became cool and peaceful. The people of the left hand then said, ‘O Lord forgive us and reduce our burden.’ The Lord said, ‘I have reduced it for you. Enter.’ They went but were afraid of it. It was there that obedience and disobedience came to take place. Thus, these will not be able to become of those and they will not be able to become of these.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/ 7)"
        ],
        "index": 1450,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:2:2",
        "relations": {
          "Mentions": [
            "/books/quran:7:172"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ زُرَارَةَ أَنَّ رَجُلًا سَأَلَ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ جَلَّ وَ عَزَّ وَ إِذْ أَخَذَ رَبُّكَ مِنْ بَنِي آدَمَ مِنْ ظُهُورِهِمْ ذُرِّيَّتَهُمْ وَ أَشْهَدَهُمْ عَلى أَنْفُسِهِمْ أَ لَسْتُ بِرَبِّكُمْ قالُوا بَلى إِلَى آخِرِ الْآيَةِ",
          "فَقَالَ وَ أَبُوهُ يَسْمَعُ ( عليه السلام ) حَدَّثَنِي أَبِي أَنَّ اللَّهَ عَزَّ وَ جَلَّ قَبَضَ قَبْضَةً مِنْ تُرَابِ التُّرْبَةِ الَّتِي خَلَقَ مِنْهَا آدَمَ ( عليه السلام ) فَصَبَّ عَلَيْهَا الْمَاءَ الْعَذْبَ الْفُرَاتَ ثُمَّ تَرَكَهَا أَرْبَعِينَ صَبَاحاً ثُمَّ صَبَّ عَلَيْهَا الْمَاءَ الْمَالِحَ الْأُجَاجَ فَتَرَكَهَا أَرْبَعِينَ صَبَاحاً فَلَمَّا اخْتَمَرَتِ الطِّينَةُ أَخَذَهَا فَعَرَكَهَا عَرْكاً شَدِيداً فَخَرَجُوا كَالذَّرِّ مِنْ يَمِينِهِ وَ شِمَالِهِ وَ أَمَرَهُمْ جَمِيعاً أَنْ يَقَعُوا فِي النَّارِ فَدَخَلَ أَصْحَابُ الْيَمِينِ فَصَارَتْ عَلَيْهِمْ بَرْداً وَ سَلَاماً وَ أَبَى أَصْحَابُ الشِّمَالِ أَنْ يَدْخُلُوهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibn Azina, from Zurara that, ",
            "‘A man asked Abu Ja’far<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Majestic and Mighty <span class=\"ibTxt\"><a href=\"/#/books/quran:7#h172\">[7:172]</a> And when your Lord brought forth from the Children of Adam, from their backs, their descendants, and made them testify against their own souls: Am I not your Lord? They said: Yes! We testify</span> – up to the end of the Verse.",
            "So he<sup>asws</sup> said, and his<sup>asws</sup> father<sup>asws</sup> was listening: ‘My<sup>asws</sup> father<sup>asws</sup> narrated to me that Allah<sup>azwj</sup> Mighty and Majestic Grabbed a Handfull of dust, the dust from which Adam<sup>as</sup> was Created, and He<sup>azwj</sup> Poured the sweet water of the Euphrates over it. Then He<sup>azwj</sup> Left it for forty mornings. Then He<sup>azwj</sup> Poured the salty, bitter water over it, and Left it for forty mornings. So when the clay became (like) dough, He<sup>azwj</sup> Grabbed it and Kneaded it with an intense kneading. So they came out like articles, from its right and its left, and He<sup>azwj</sup> Commanded the together that they should fall into the Fire. So the companions of the right entered, and it became cold, safe, for them, but the companions of the left refused to enter into it’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ibn ‘Udhayna from Zurara who has said the following: “Once a man asked abu Ja’far (a.s.) about the words of Allah, the Majestic the Glorious, ‘When your Lord took from the back of the children of Adam their offspring and told them to bear testimony to the words of Allah, “Am I not your Lord,” they all said, “Yes, You are our Lord. . . .”’ <a href=\"/#/books/quran:7#h172\">[7:172]</a> “He (the Imam), while his father (a.s.) was listening, said, ‘My father narrated to me that Allah, the Majestic, the Glorious, took a handful of clay, from which He created Adam. He poured upon it sweet water from Euphrates and left it for forty mornings. Then He poured upon it very salty water and left it for forty mornings. When the clay fermented He then kneaded it strongly and they (children of Adam) appeared as particles from his right and left sides. He ordered all of them to enter the fire. The people of the right hand entered it and it became cool and peaceful for them but the people of the left hand refused to enter.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن موثق كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/ 7)"
        ],
        "index": 1451,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:2:3",
        "relations": {
          "Mentions": [
            "/books/quran:43:81"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ لَمَّا أَرَادَ أَنْ يَخْلُقَ آدَمَ ( عليه السلام ) أَرْسَلَ الْمَاءَ عَلَى الطِّينِ ثُمَّ قَبَضَ قَبْضَةً فَعَرَكَهَا ثُمَّ فَرَّقَهَا فِرْقَتَيْنِ بِيَدِهِ ثُمَّ ذَرَأَهُمْ فَإِذَا هُمْ يَدِبُّونَ ",
          "ثُمَّ رَفَعَ لَهُمْ نَاراً فَأَمَرَ أَهْلَ الشِّمَالِ أَنْ يَدْخُلُوهَا فَذَهَبُوا إِلَيْهَا فَهَابُوهَا فَلَمْ يَدْخُلُوهَا ثُمَّ أَمَرَ أَهْلَ الْيَمِينِ أَنْ يَدْخُلُوهَا فَذَهَبُوا فَدَخَلُوهَا فَأَمَرَ اللَّهُ جَلَّ وَ عَزَّ النَّارَ فَكَانَتْ عَلَيْهِمْ بَرْداً وَ سَلَاماً فَلَمَّا رَأَى ذَلِكَ أَهْلُ الشِّمَالِ قَالُوا رَبَّنَا أَقِلْنَا فَأَقَالَهُمْ ثُمَّ قَالَ لَهُمُ ادْخُلُوهَا فَذَهَبُوا فَقَامُوا عَلَيْهَا وَ لَمْ يَدْخُلُوهَا فَأَعَادَهُمْ طِيناً وَ خَلَقَ مِنْهَا آدَمَ ( عليه السلام ) ",
          "وَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَلَنْ يَسْتَطِيعَ هَؤُلَاءِ أَنْ يَكُونُوا مِنْ هَؤُلَاءِ وَ لَا هَؤُلَاءِ أَنْ يَكُونُوا مِنْ هَؤُلَاءِ ",
          "قَالَ فَيَرَوْنَ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) أَوَّلُ مَنْ دَخَلَ تِلْكَ النَّارَ فَذَلِكَ قَوْلُهُ جَلَّ وَ عَزَّ قُلْ إِنْ كانَ لِلرَّحْمنِ وَلَدٌ فَأَنَا أَوَّلُ الْعابِدِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Aban Bin Usman, from Muhammad Bin Ali Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> having said: ‘Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic, when He<sup style=\"font-weight: normal\">azwj</sup> Intended to Create Adam<sup style=\"font-weight: normal\">as</sup>, Sent the water upon the clay. Then He<sup style=\"font-weight: normal\">azwj</sup> Grabbed a Handfull and Kneaded it. The Separated it into two arts by His<sup style=\"font-weight: normal\">azwj</sup> Hand. Then He<sup style=\"font-weight: normal\">azwj</sup> Scattered them and they were crawling. ",
            "Then He<sup style=\"font-weight: normal\">azwj</sup> Raised a Fire for them, and Commanded the people of the left that they should be entering into it. So they went towards it, but were terrified of it, so they did not enter into it. Then He<sup style=\"font-weight: normal\">azwj</sup> Commanded the people of the right that they should be entering into it. So they went towards it and entered into it. So Allah<sup style=\"font-weight: normal\">azwj</sup> Majestic and Mighty Commanded the Fire, so it was cold and safe for them . So when the people of the left saw that, they said, ‘Our Lord<sup style=\"font-weight: normal\">azwj</sup>! Forgive us’. So He<sup style=\"font-weight: normal\">azwj</sup> Forgave them, then Said to them: “Enter into it!” So they went and stood at it but did not enter into it. So He<sup style=\"font-weight: normal\">azwj</sup> Returned them (all) as clay and Created Adam<sup style=\"font-weight: normal\">as</sup> from it’.",
            "And Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> said: ‘So these ones will never have the capacity that they become from those ones nor would those ones to happen to be from these ones’. ",
            "He<sup>asws</sup> said: ‘So they were seeing that Rasool-Allah<sup>saww</sup> was the first one to enter that Fire, and these are the Words of the Majestic and Mighty <span class=\"ibTxt\"><a href=\"/#/books/quran:43#h81\">[43:81]</a> Say: If the Beneficent had a son, I am the first one of the worshippers</span>’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from Ahmad ibn Muhammad ibn abu Nasr from Aban ibn ‘Uthman from Muhammad ibn Ali al-Halabi from abu ‘Abd Allah (a.s.) who has said the following: “When Allah, the Majestic, the Glorious, willed to create Adam He sent water on the clay. He then took a handful and kneaded it and then divided it in two parts with His hands then scattered them and they began to move. He then started a fire for them and commanded the people of the left hand to enter therein. They went near but were afraid of it and they did not enter therein. He then commanded the people of the right hand to enter in the fire. They went and entered into it and Allah, the Majestic, the Glorious, commanded the fire to become cool and peaceful for them. When the people of the left hand observed it they said, ‘Our Lord, forgive us.’ He forgave them and said to them, ‘Enter into the fire.’ They went but did not enter therein. He then changed them to clay and He created Adam therefrom. Abu ‘Abd Allah (a.s.) then said, ‘Those will never be able to become these and they will never be able to become of those.’ He (a.s.) then said, ‘They saw the Messenger of Allah (a.s.) to be the first to enter that fire. For this reason is the words of Allah, the Majestic, the Glorious, ‘(Muhammad), Say, “Had the Beneficent had a son then I would have been the first to worship.”’” (43: 81) "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:2",
  "kind": "verse_list"
}