{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 20"
        },
        "path": "/books/al-kafi:2:1:20",
        "titles": {
          "ar": "بَابُ دَرَجَاتِ الْإِيمَانِ",
          "en": "Chapter 20 – Levels of the Emān"
        }
      }
    ],
    "index": 208,
    "local_index": 20,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 21"
        },
        "path": "/books/al-kafi:2:1:21",
        "titles": {
          "ar": "بَابٌ آخَرُ مِنْهُ",
          "en": "Chapter 21 – Another chapter from it"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 19"
        },
        "path": "/books/al-kafi:2:1:19",
        "titles": {
          "ar": "بَابُ السَّبْقِ إِلَى الْإِيمَانِ",
          "en": "Chapter 19 – The preceding (racing) to the Emān"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:20",
    "titles": {
      "ar": "بَابُ دَرَجَاتِ الْإِيمَانِ",
      "en": "Chapter 20 – Levels of the Emān"
    },
    "verse_count": 2,
    "verse_start_index": 1522,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول بعما ر  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (272/ 7)"
        ],
        "index": 1523,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/434",
              "text": "أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1439",
              "text": "عَمَّارِ بْنِ أَبِي الْأَحْوَصِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَمَّارِ بْنِ أَبِي الْأَحْوَصِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:20:1",
        "text": [
          " إِنَّ اللَّهَ عَزَّ وَ جَلَّ وَضَعَ الْإِيمَانَ عَلَى سَبْعَةِ أَسْهُمٍ عَلَى الْبِرِّ وَ الصِّدْقِ وَ الْيَقِينِ وَ الرِّضَا وَ الْوَفَاءِ وَ الْعِلْمِ وَ الْحِلْمِ ثُمَّ قَسَمَ ذَلِكَ بَيْنَ النَّاسِ فَمَنْ جَعَلَ فِيهِ هَذِهِ السَّبْعَةَ الْأَسْهُمِ فَهُوَ كَامِلٌ مُحْتَمِلٌ وَ قَسَمَ لِبَعْضِ النَّاسِ السَّهْمَ وَ لِبَعْضٍ السَّهْمَيْنِ وَ لِبَعْضٍ الثَّلَاثَةَ حَتَّى انْتَهَوْا إِلَى السَّبْعَةِ ",
          "ثُمَّ قَالَ لَا تَحْمِلُوا عَلَى صَاحِبِ السَّهْمِ سَهْمَيْنِ وَ لَا عَلَى صَاحِبِ السَّهْمَيْنِ ثَلَاثَةً فَتَبْهَضُوهُمْ ثُمَّ قَالَ كَذَلِكَ حَتَّى يَنْتَهِيَ إِلَى السَّبْعَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Al Hassan Bin Mahboub, from Ammar Bin Abu Al Ahows, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> havings said: ‘Allah<sup>azwj</sup> Mighty and Majestic Places the <span class=\"iTxt\">Emān</span> to be upon seven portions – upon the righteousness, and the truthfulness, and the conviction, and the agreeability, and the loyalty, and the knowledge, and the forbearance. Then He<sup>azwj</sup> Distributed that between the people. So the one in whom He<sup>azwj</sup> Made these seven portions to be, so he would be of perfect potential (of achieving the complete <span class=\"iTxt\">Emān</span>). And He<sup>azwj</sup> Distributed such that one portion to be for some of the people, and for some, the two portions, and for some, the three, until ending to the seven (portions). ",
            "Then he<sup>asws</sup> said: ‘Do not burden upon the owner of the one portion with (the obligations of) two portions, nor upon the owner of the two portions, with the three, so you would break them’. Then he<sup>asws</sup> said: ‘It is like that until it ends up to the seven’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from al- Hassan ibn Mahbub from ‘Ammar ibn abu al-Ahwas from abu ‘Abd Allah (a.s.) who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘Allah, the Most Majestic, the Most Holy, made belief in seven shares: virtue, truthfulness, certainty, compliance, loyalty, knowledge and forbearance. He then distributed it among the people. Whoever received all seven shares is perfect and heavy. He has given to certain people one share or two or three and so on up to seven.’ The Imam then said, ‘Do not expect two shares from those who have been given one share or three from those who have received two shares lest you overburden them, and so on up to seven,’ he added.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/274)"
        ],
        "index": 1524,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/23",
              "text": "الْحَسَنِ بْنِ الْجَهْمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1440",
              "text": "أَبِي الْيَقْظَانِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1441",
              "text": "يَعْقُوبَ بْنِ الضَّحَّاكِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1442",
              "text": "رَجُلٍ مِنْ أَصْحَابِنَا سَرَّاجٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1443",
              "text": "كَانَ خَادِماً لِأَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى جَمِيعاً عَنِ ابْنِ فَضَّالٍ عَنِ الْحَسَنِ بْنِ الْجَهْمِ عَنْ أَبِي الْيَقْظَانِ عَنْ يَعْقُوبَ بْنِ الضَّحَّاكِ عَنْ رَجُلٍ مِنْ أَصْحَابِنَا سَرَّاجٍ وَ كَانَ خَادِماً لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:20:2",
        "text": [
          " بَعَثَنِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فِي حَاجَةٍ وَ هُوَ بِالْحِيرَةِ أَنَا وَ جَمَاعَةً مِنْ مَوَالِيهِ قَالَ فَانْطَلَقْنَا فِيهَا ثُمَّ رَجَعْنَا مُغْتَمِّينَ",
          "قَالَ وَ كَانَ فِرَاشِي فِي الْحَائِرِ الَّذِي كُنَّا فِيهِ نُزُولًا فَجِئْتُ وَ أَنَا بِحَالٍ فَرَمَيْتُ بِنَفْسِي فَبَيْنَا أَنَا كَذَلِكَ إِذَا أَنَا بِأَبِي عَبْدِ اللَّهِ ( عليه السلام )  قَدْ أَقْبَلَ قَالَ فَقَالَ قَدْ أَتَيْنَاكَ أَوْ قَالَ جِئْنَاكَ فَاسْتَوَيْتُ جَالِساً وَ جَلَسَ عَلَى صَدْرِ فِرَاشِي فَسَأَلَنِي عَمَّا بَعَثَنِي لَهُ فَأَخْبَرْتُهُ فَحَمِدَ اللَّهَ",
          "ثُمَّ جَرَى ذِكْرُ قَوْمٍ فَقُلْتُ جُعِلْتُ فِدَاكَ إِنَّا نَبْرَأُ مِنْهُمْ إِنَّهُمْ لَا يَقُولُونَ مَا نَقُولُ قَالَ فَقَالَ يَتَوَلَّوْنَا وَ لَا يَقُولُونَ مَا تَقُولُونَ تَبْرَءُونَ مِنْهُمْ ق",
          "َالَ قُلْتُ نَعَمْ قَالَ فَهُوَ ذَا عِنْدَنَا مَا لَيْسَ عِنْدَكُمْ فَيَنْبَغِي لَنَا أَنْ نَبْرَأَ مِنْكُمْ قَالَ قُلْتُ لَا جُعِلْتُ فِدَاكَ قَالَ وَ هُوَ ذَا عِنْدَ اللَّهِ مَا لَيْسَ عِنْدَنَا أَ فَتَرَاهُ اطَّرَحَنَا قَالَ قُلْتُ لَا وَ اللَّهِ جُعِلْتُ فِدَاكَ مَا نَفْعَلُ",
          "قَالَ فَتَوَلَّوْهُمْ وَ لَا تَبَرَّءُوا مِنْهُمْ إِنَّ مِنَ الْمُسْلِمِينَ مَنْ لَهُ سَهْمٌ وَ مِنْهُمْ مَنْ لَهُ سَهْمَانِ وَ مِنْهُمْ مَنْ لَهُ ثَلَاثَةُ أَسْهُمٍ وَ مِنْهُمْ مَنْ لَهُ أَرْبَعَةُ أَسْهُمٍ وَ مِنْهُمْ مَنْ لَهُ خَمْسَةُ أَسْهُمٍ وَ مِنْهُمْ مَنْ لَهُ سِتَّةُ أَسْهُمٍ وَ مِنْهُمْ مَنْ لَهُ سَبْعَةُ أَسْهُمٍ",
          "فَلَيْسَ يَنْبَغِي أَنْ يُحْمَلَ صَاحِبُ السَّهْمِ عَلَى مَا عَلَيْهِ صَاحِبُ السَّهْمَيْنِ وَ لَا صَاحِبُ السَّهْمَيْنِ عَلَى مَا عَلَيْهِ صَاحِبُ الثَّلَاثَةِ وَ لَا صَاحِبُ الثَّلَاثَةِ عَلَى مَا عَلَيْهِ صَاحِبُ الْأَرْبَعَةِ وَ لَا صَاحِبُ الْأَرْبَعَةِ عَلَى مَا عَلَيْهِ صَاحِبُ الْخَمْسَةِ وَ لَا صَاحِبُ الْخَمْسَةِ عَلَى مَا عَلَيْهِ صَاحِبُ السِّتَّةِ وَ لَا صَاحِبُ السِّتَّةِ عَلَى مَا عَلَيْهِ صَاحِبُ السَّبْعَةِ",
          "وَ سَأَضْرِبُ لَكَ مَثَلًا إِنَّ رَجُلًا كَانَ لَهُ جَارٌ وَ كَانَ نَصْرَانِيّاً فَدَعَاهُ إِلَى الْإِسْلَامِ وَ زَيَّنَهُ لَهُ فَأَجَابَهُ فَأَتَاهُ سُحَيْراً فَقَرَعَ عَلَيْهِ الْبَابَ فَقَالَ لَهُ مَنْ هَذَا قَالَ أَنَا فُلَانٌ قَالَ وَ مَا حَاجَتُكَ فَقَالَ تَوَضَّأْ وَ الْبَسْ ثَوْبَيْكَ وَ مُرَّ بِنَا إِلَى الصَّلَاةِ قَالَ فَتَوَضَّأَ وَ لَبِسَ ثَوْبَيْهِ وَ خَرَجَ مَعَهُ",
          "قَالَ فَصَلَّيَا مَا شَاءَ اللَّهُ ثُمَّ صَلَّيَا الْفَجْرَ ثُمَّ مَكَثَا حَتَّى أَصْبَحَا فَقَامَ الَّذِي كَانَ نَصْرَانِيّاً يُرِيدُ مَنْزِلَهُ فَقَالَ لَهُ الرَّجُلُ أَيْنَ تَذْهَبُ النَّهَارُ قَصِيرٌ وَ الَّذِي بَيْنَكَ وَ بَيْنَ الظُّهْرِ قَلِيلٌ قَالَ فَجَلَسَ مَعَهُ إِلَى أَنْ صَلَّى الظُّهْرَ ثُمَّ قَالَ وَ مَا بَيْنَ الظُّهْرِ وَ الْعَصْرِ قَلِيلٌ فَاحْتَبَسَهُ حَتَّى صَلَّى الْعَصْرَ",
          "قَالَ ثُمَّ قَامَ وَ أَرَادَ أَنْ يَنْصَرِفَ إِلَى مَنْزِلِهِ فَقَالَ لَهُ إِنَّ هَذَا آخِرُ النَّهَارِ وَ أَقَلُّ مِنْ أَوَّلِهِ فَاحْتَبَسَهُ حَتَّى صَلَّى الْمَغْرِبَ ثُمَّ أَرَادَ أَنْ يَنْصَرِفَ إِلَى مَنْزِلِهِ فَقَالَ لَهُ إِنَّمَا بَقِيَتْ صَلَاةٌ وَاحِدَةٌ قَالَ فَمَكَثَ حَتَّى صَلَّى الْعِشَاءَ الْآخِرَةَ ثُمَّ تَفَرَّقَا",
          "فَلَمَّا كَانَ سُحَيْرٌ غَدَا عَلَيْهِ فَضَرَبَ عَلَيْهِ الْبَابَ فَقَالَ مَنْ هَذَا قَالَ أَنَا فُلَانٌ قَالَ وَ مَا حَاجَتُكَ قَالَ تَوَضَّأْ وَ الْبَسْ ثَوْبَيْكَ وَ اخْرُجْ بِنَا فَصَلِّ قَالَ اطْلُبْ لِهَذَا الدِّينِ مَنْ هُوَ أَفْرَغُ مِنِّي وَ أَنَا إِنْسَانٌ مِسْكِينٌ وَ عَلَيَّ عِيَالٌ ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام )  أَدْخَلَهُ فِي شَيْ‏ءٍ أَخْرَجَهُ مِنْهُ أَوْ قَالَ أَدْخَلَهُ مِنْ مِثْلِ ذِهْ وَ أَخْرَجَهُ مِنْ مِثْلِ هَذَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar and Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, altogether from Ibn Fazzal, from Al Hassan Bin Al Jaham, from Abu Al Yaqteen, from Yaqoub Bin Al Zahhaq, ",
            "(It has been narrated) from a man from our companions, Sirraj, and he was a servant of Abu Abdullah<sup>asws</sup> who said, ‘Abu Abdullah<sup>asws</sup> sent me regarding a need and he<sup>asws</sup> was at Al-Hira, I and a group of his<sup>asws</sup> slaves. So we went regarding it. Then we returned gloomy. ",
            "He said, ‘And my bed was in Al-Ha’er which we had lodged in. So I went and I was in a (gloomy) state, so I threw myself (on the bed). So while I was like that when I was with Abu Abdullah<sup>asws</sup> who had come over. So he<sup>asws</sup> said: ‘I<sup>asws</sup> have come to you’, or he<sup>asws</sup> said: ‘We<sup>asws</sup> have come to you’. So I sat up straight, and he<sup>asws</sup> sat upon the middle of my bed. So he<sup>asws</sup> asked me about what he<sup>asws</sup> had sent me for, so. I informed him<sup>asws</sup>. So he<sup>asws</sup> Praised Allah<sup>azwj</sup>. ",
            "Then there flowed a mention of a group of people, so I said, ‘May I be sacrificed for you<sup>asws</sup>! We disavow from them. They are not saying (believing) in what we are saying (believing in)’. So he<sup>asws</sup> said: ‘(If) they were befriending us<sup>asws</sup> and not saying what you are saying, you would be disassociating from them?’ ",
            "I said, ‘Yes’. He<sup>asws</sup> said: ‘So since that which is with us<sup>asws</sup> is not what is with you, so it would be befitting for us<sup>asws</sup> what we<sup>asws</sup> disassociate from you?’ I said, ‘No, may I be sacrificed for you<sup>asws</sup>!’ He<sup>asws</sup> said: ‘And since that which is with Allah<sup>azwj</sup> is what is not with us<sup>asws</sup>, so what is your view, should we<sup>asws</sup> drop it?’ I said, ‘No, by Allah<sup>azwj</sup>, may I be sacrificed for you<sup>asws</sup>! What should we do?’ ",
            "He<sup>asws</sup> said: ‘So befriend them and do not disassociate from them. From the Muslims, there is the one from him there is one portion, and from them is the one for whom there are two portions, and from them is the one for whom there are three portions, and from them is the one for whom there are four portions, and from them is the one for whom there are five portions, and from them is the one for him there are six portions, and from them is the one for whom there are seven portions. ",
            "So it is not befitting that the owner of the one portion be burdened with what is upon the owner of the two portions, nor the owner of the two potions by what is upon the owner of the three, nor the owner of the three by what is upon the owner of the four, nor the owner of the four by what is upon the owner of the five, nor the owner of the five by what is upon the owner of the six, nor the owner of the six by what is upon the owner of the seven.",
            "And I<sup>asws</sup> shall strike an example for you. A man had a neighbour for him, and he was a Christian. So he invited him to Al-<span class=\"iTxt\">Islām</span>, and adorned it for him. So he responded to it. So he went over at pre-dawn and knocked the door upon him. So he said to him, ‘Who is this?’ He said, ‘I am so and so’. He said, ‘And what is your need?’ So he said, ‘You should perform ablution and wear your clothes and come with me to the <span class=\"iTxt\">Salāt</span> (in the Masjid)’. So he performed ablution and wore his clothes and went with him’. ",
            "He<sup>asws</sup> said: ‘So they both prayed <span class=\"iTxt\">Salāt</span> whatever Allah<sup>azwj</sup> so Desired, then prayed Al-Fajr <span class=\"iTxt\">Salāt</span>. Then they both remain until the morning. So he arose, the one who used to be a Christian, intending to go to his house. So the man said to him, ‘Where are you going? The day is short, and that which is between you and Al-Zohr (<span class=\"iTxt\">Salāt</span>), is little (time)’. So he sat with him until he prayed Al-Zohr <span class=\"iTxt\">Salāt</span>. Then he said, ‘And how little (time) is between Al-Zohr and Al-Asr (<span class=\"iTxt\">Salāt</span>)’. So he withheld him until he prayed Al-Asr. ",
            "Then he arose and intended to leave to go to his house. So he said to him, ‘This is the end of the day, and it is less than its beginning’. So he withheld him until he prayed Al-Maghrib. Then he intended to leave to go to his house, so he said to him, ‘But rather, there remains one <span class=\"iTxt\">Salāt</span> (only)’. So he remained until he had prayed Al-Isha the last. Then they both dispersed. ",
            "So when it was the next pre-dawn upon him, he knocked the door upon him. So he said, ‘Who is this?’ He said, ‘I am so and so’. He said, ‘And what is your need?’ He said, ‘Perform ablution and wear your clothes, and come out with me, so pray <span class=\"iTxt\">Salāt</span>’. He said, ‘Seek for this religion the one who is more free (for time) than I am, and I am a poor person, and upon me are dependants’. ",
            "So Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> said: ‘He entered him into something (but then he) took it out from him’, or he<sup style=\"font-weight: normal\">asws</sup> said: ‘He entered him from the likes of those ones and took him out from the likes of this’."
          ],
          "en.sarwar": [
            "2. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from Muhammad ibn Yahya from Ahmad ibn Muhammad ibn ‘Isa all from ibn Faddal from al-Hassan ibn al-Jahm from abu al-Yaqzan from Ya’qub ibn al-Dahhak from a man of our people, Sarraj who was a servant of abu ‘Abd Allah (a.s.) has said the following: “ Abu ‘Abd Allah (a.s.) once sent me with a group of his followers for an errand and at that time he was in Hirah (a place near Kufa, Iraq). We left for it and returned depressed. My bed was in al-Ha’ir (a comfortable private quarter). I went there in an upset condition and threw myself thereat. At this time abu ‘Abd Allah (a.s.) came in saying, ‘We have come to see you,’ or he said, ‘We have come to you.’ I then sat up straight and he sat in the middle of my bed and asked me about the errand for which he had sent me. I reported to him and he thanked Allah. Thereafter, a mention of certain people came up and I said, ‘May Allah keep my soul in service for your cause, we disassociate from these people; they do not say what we say.’ The Imam then said, ‘If they love and support us, but do not say what you say, do you (still) disassociate from them?’ I then said, ‘Yes, we do so.’ “The Imam said, ‘It is just like this (’ A’immah’s case). We have what you do not have. Should we disassociate from you?’ I then said, ‘No, may Allah keep my soul in service for your cause.’ The Imam said, ‘It is just like this (the case of Allah). With Him there is what we do not have. Do you think we should give it up?’ “I then said, ‘No, may Allah keep my soul in service for your cause. We should not do so.’ The Imam said, ‘Be friends with them and do not disassociate from them. Among the Muslims there are those who have only one share, those who have two shares, three shares, four shares, five shares, six shares and those who have seven shares. It is not proper for those who have one share to blame those who have two shares, or those who have two shares to blame those who have three shares, those who have three shares to blame those who have four shares, those who have four shares to blame those who have five shares, those who have five shares to blame those who have six shares and those who have six shares to blame those who have seven shares. I will give an example: “A man had a Christian neighbor to whom he preached Islam attractively and the neighbor accepted. It was early next morning when he knocked at his (convert’s) door. He said, ‘Who is it?’ He (the preacher) said, ‘I am so and so.’ ‘What do you want?’ the (convert) said. ‘Make Wuzu, dress up in your two cloths and join us for prayer,’ said the preacher. The new convert then made Wuzu, dressed up in his two pieces of cloth and joined him. They performed prayers a great deal. Then they prayed the morning-prayer, then waited until it was light. The convert got up to go home and the man asked him, ‘Where are you going? The day is short. The time left to noontime is very little.’ The new convert sat down with him until noontime and they prayed the noontime prayer. Then he said that there is very little time to afternoon prayer. He prevented the new convert from going home until they said the afternoon prayer. He then wanted to go home but he (the preacher) said, ‘It is the last part of the day and is less than the beginning of it.’ So he (the preacher) stopped him until they performed the prayer at sunset. Then the new convert wanted to go home, he (the preacher) said, ‘Only one more prayer is left.’ He then waited until they performed the late evening prayer and then they departed each other. Next early morning he (the preacher) went and knocked at the door of the new convert. He (the new convert) asked, ‘Who is it?’ He (the preacher) said, ‘I am so and so.’ He (the new convert) asked, ‘What do you want?’ He (the preacher) said, ‘Make Wuzu, dress up in your two pieces of cloth and join us for prayer.’ He (the Christian man) said, ‘Find other persons for this religion who have more free time. I am a poor person with a family to feed.’ “Abu ‘Abd Allah (a.s.) then said, ‘He (the preacher) took him (Christian) into a thing in such a way that it took him (the new convert) out of it. Or that the Imam said, ‘Took him in like this and forced him out like that.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:20",
  "kind": "verse_list"
}