{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:2:1", "titles": {"ar": "كتاب الإيمان و الكفر", "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"}}, {"indexed_titles": {"en": "Chapter 200"}, "path": "/books/al-kafi:2:1:200", "titles": {"ar": "بَابُ أَنَّ اللَّهَ يَدْفَعُ بِالْعَامِلِ عَنْ غَيْرِ الْعَامِلِ", "en": "Chapter 200 – Allah<sup>azwj</sup> Defends the workers (of good deeds) from other than the workers (of good deeds)"}}], "index": 388, "local_index": 200, "part_type": "Chapter", "path": "/books/al-kafi:2:1:200", "titles": {"ar": "بَابُ أَنَّ اللَّهَ يَدْفَعُ بِالْعَامِلِ عَنْ غَيْرِ الْعَامِلِ", "en": "Chapter 200 – Allah<sup>azwj</sup> Defends the workers (of good deeds) from other than the workers (of good deeds)"}, "verse_count": 1, "verse_start_index": 3003, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 3004, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:1:200:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ مَعْبَدٍ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ يُونُسَ بْنِ ظَبْيَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ لَيَدْفَعُ بِمَنْ يُصَلِّي مِنْ شِيعَتِنَا عَمَّنْ لَا يُصَلِّي مِنْ شِيعَتِنَا وَ لَوْ أَجْمَعُوا عَلَى تَرْكِ الصَّلَاةِ لَهَلَكُوا ", "وَ إِنَّ اللَّهَ لَيَدْفَعُ بِمَنْ يُزَكِّي مِنْ شِيعَتِنَا عَمَّنْ لَا يُزَكِّي وَ لَوْ أَجْمَعُوا عَلَى تَرْكِ الزَّكَاةِ لَهَلَكُوا ", "وَ إِنَّ اللَّهَ لَيَدْفَعُ بِمَنْ يَحُجُّ مِنْ شِيعَتِنَا عَمَّنْ لَا يَحُجُّ وَ لَوْ أَجْمَعُوا عَلَى تَرْكِ الْحَجِّ لَهَلَكُوا وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ لَوْ لا دَفْعُ اللَّهِ النَّاسَ بَعْضَهُمْ بِبَعْضٍ لَفَسَدَتِ الْأَرْضُ وَ لكِنَّ اللَّهَ ذُو فَضْلٍ عَلَى الْعالَمِينَ فَوَ اللَّهِ مَا نَزَلَتْ إِلَّا فِيكُمْ وَ لَا عَنَى بِهَا غَيْرَكُمْ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ali Bin Ma’bad, from Abdullah Bin Al Qasim, from Yunus Bin Zabyan, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Defends by the ones from our<sup>asws</sup> Shias who do pray <span class=\"iTxt\">Salāt</span>, from the ones from our<sup>asws</sup> Shias who do not pray <span class=\"iTxt\">Salāt</span>; and were they (all) to gather upon the neglect of the <span class=\"iTxt\">Salāt</span>, they would (all) be destroyed. ", "And that Allah<sup style=\"font-weight: normal\">azwj</sup> Defends by the ones from our<sup style=\"font-weight: normal\">asws</sup> Shias who do pay <span class=\"iTxt\">Zakāt</span> from the ones who do not pay the <span class=\"iTxt\">Zakāt</span>, and were they (all) to gather upon neglecting the <span class=\"iTxt\">Zakāt</span>, they would (all) be destroyed.", "And that Allah<sup>azwj</sup> Defends by the ones from our<sup>asws</sup> Shias who do perform Hajj from the ones who do not perform Hajj, and were they (all) to gather upon neglecting the Hajj, they would (all) be destroyed; and these are the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[2:251] And were it not for Allah's Repelling some men with others, the earth would certainly be in a spoilt state; but Allah is Gracious to the worlds</span>. So, by Allah<sup>azwj</sup>! It was not Revealed except regarding you all (Shias), and it does not Mean by it except for you all (Shias)’."]}}]}, "index": "al-kafi:2:1:200", "kind": "verse_list"}