{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 200"
        },
        "path": "/books/al-kafi:2:1:200",
        "titles": {
          "ar": "بَابُ أَنَّ اللَّهَ يَدْفَعُ بِالْعَامِلِ عَنْ غَيْرِ الْعَامِلِ",
          "en": "Chapter 200 – Allah<sup>azwj</sup> Defends the workers (of good deeds) from other than the workers (of good deeds)"
        }
      }
    ],
    "index": 388,
    "local_index": 200,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 201"
        },
        "path": "/books/al-kafi:2:1:201",
        "titles": {
          "ar": "بَابُ أَنَّ تَرْكَ الْخَطِيئَةِ أَيْسَرُ مِنْ طَلَبِ التَّوْبَةِ",
          "en": "Chapter 201 – The neglecting of the sins is easier than seeking the Forgiveness"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 199"
        },
        "path": "/books/al-kafi:2:1:199",
        "titles": {
          "ar": "بَابٌ نَادِرٌ أَيْضاً",
          "en": "Chapter 199 – Miscellaneous as well"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:200",
    "titles": {
      "ar": "بَابُ أَنَّ اللَّهَ يَدْفَعُ بِالْعَامِلِ عَنْ غَيْرِ الْعَامِلِ",
      "en": "Chapter 200 – Allah<sup>azwj</sup> Defends the workers (of good deeds) from other than the workers (of good deeds)"
    },
    "verse_count": 1,
    "verse_start_index": 3003,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/350)"
        ],
        "index": 3004,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:200:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ مَعْبَدٍ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ يُونُسَ بْنِ ظَبْيَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ لَيَدْفَعُ بِمَنْ يُصَلِّي مِنْ شِيعَتِنَا عَمَّنْ لَا يُصَلِّي مِنْ شِيعَتِنَا وَ لَوْ أَجْمَعُوا عَلَى تَرْكِ الصَّلَاةِ لَهَلَكُوا ",
          "وَ إِنَّ اللَّهَ لَيَدْفَعُ بِمَنْ يُزَكِّي مِنْ شِيعَتِنَا عَمَّنْ لَا يُزَكِّي وَ لَوْ أَجْمَعُوا عَلَى تَرْكِ الزَّكَاةِ لَهَلَكُوا ",
          "وَ إِنَّ اللَّهَ لَيَدْفَعُ بِمَنْ يَحُجُّ مِنْ شِيعَتِنَا عَمَّنْ لَا يَحُجُّ وَ لَوْ أَجْمَعُوا عَلَى تَرْكِ الْحَجِّ لَهَلَكُوا وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ لَوْ لا دَفْعُ اللَّهِ النَّاسَ بَعْضَهُمْ بِبَعْضٍ لَفَسَدَتِ الْأَرْضُ وَ لكِنَّ اللَّهَ ذُو فَضْلٍ عَلَى الْعالَمِينَ فَوَ اللَّهِ مَا نَزَلَتْ إِلَّا فِيكُمْ وَ لَا عَنَى بِهَا غَيْرَكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ali Bin Ma’bad, from Abdullah Bin Al Qasim, from Yunus Bin Zabyan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Defends by the ones from our<sup>asws</sup> Shias who do pray <span class=\"iTxt\">Salāt</span>, from the ones from our<sup>asws</sup> Shias who do not pray <span class=\"iTxt\">Salāt</span>; and were they (all) to gather upon the neglect of the <span class=\"iTxt\">Salāt</span>, they would (all) be destroyed. ",
            "And that Allah<sup style=\"font-weight: normal\">azwj</sup> Defends by the ones from our<sup style=\"font-weight: normal\">asws</sup> Shias who do pay <span class=\"iTxt\">Zakāt</span> from the ones who do not pay the <span class=\"iTxt\">Zakāt</span>, and were they (all) to gather upon neglecting the <span class=\"iTxt\">Zakāt</span>, they would (all) be destroyed.",
            "And that Allah<sup>azwj</sup> Defends by the ones from our<sup>asws</sup> Shias who do perform Hajj from the ones who do not perform Hajj, and were they (all) to gather upon neglecting the Hajj, they would (all) be destroyed; and these are the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[2:251] And were it not for Allah's Repelling some men with others, the earth would certainly be in a spoilt state; but Allah is Gracious to the worlds</span>. So, by Allah<sup>azwj</sup>! It was not Revealed except regarding you all (Shias), and it does not Mean by it except for you all (Shias)’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Ali ibn Ma’bad from ‘Abd Allah ibn al-Qasim from Yunus ibn Zabyan from abu ‘Abd Allah (a.s.) who has said the following: ‘‘Allah defends through those of our Shi’a (followers) who perform prayer from those of our Shi’a (followers) who do not perform prayers, and if they all stop praying all of them will face destruction. Allah defends through those of our Shi’a (followers) who pay al-Zakat (charity) from those who do not pay al-Zakat and if they all stop paying al-Zakat all of them will be destroyed. Allah defends through those of our Shi’a (followers) who perform Hajj from those who do not perform Hajj and if they all stop performing Hajj all of them will be destroyed. This is indicated in the words of Allah, the Most Majestic, the Most Holy, ‘Had Allah not defended one group of people through the other, the earth would have been destroyed, but Allah is generous to the worlds.’ (2:251) This, by Allah, has been revealed about you and no one else is meant thereby.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:200",
  "kind": "verse_list"
}