{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 203"
        },
        "path": "/books/al-kafi:2:1:203",
        "titles": {
          "ar": "بَابُ مُحَاسَبَةِ الْعَمَلِ",
          "en": "Chapter 203 – Counting the deeds"
        }
      }
    ],
    "index": 391,
    "local_index": 203,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 204"
        },
        "path": "/books/al-kafi:2:1:204",
        "titles": {
          "ar": "بَابُ مَنْ يَعِيبُ النَّاسَ",
          "en": "Chapter 204 – The one who faults the people"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 202"
        },
        "path": "/books/al-kafi:2:1:202",
        "titles": {
          "ar": "بَابُ الِاسْتِدْرَاجِ",
          "en": "Chapter 202 – The gradual allurement"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:203",
    "titles": {
      "ar": "بَابُ مُحَاسَبَةِ الْعَمَلِ",
      "en": "Chapter 203 – Counting the deeds"
    },
    "verse_count": 23,
    "verse_start_index": 3009,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/355)"
        ],
        "index": 3010,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ أَبِي حَمْزَةَ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) يَقُولُ إِنَّمَا الدَّهْرُ ثَلَاثَةُ أَيَّامٍ أَنْتَ فِيمَا بَيْنَهُنَّ مَضَى أَمْسِ بِمَا فِيهِ فَلَا يَرْجِعُ أَبَداً فَإِنْ كُنْتَ عَمِلْتَ فِيهِ خَيْراً لَمْ تَحْزَنْ لِذَهَابِهِ وَ فَرِحْتَ بِمَا اسْتَقْبَلْتَهُ مِنْهُ وَ إِنْ كُنْتَ قَدْ فَرَّطْتَ فِيهِ فَحَسْرَتُكَ شَدِيدَةٌ لِذَهَابِهِ وَ تَفْرِيطِكَ فِيهِ",
          "وَ أَنْتَ فِي يَوْمِكَ الَّذِي أَصْبَحْتَ فِيهِ مِنْ غَدٍ فِي غِرَّةٍ وَ لَا تَدْرِي لَعَلَّكَ لَا تَبْلُغُهُ وَ إِنْ بَلَغْتَهُ لَعَلَّ حَظَّكَ فِيهِ فِي التَّفْرِيطِ مِثْلُ حَظِّكَ فِي الْأَمْسِ الْمَاضِي عَنْكَ",
          "فَيَوْمٌ مِنَ الثَّلَاثَةِ قَدْ مَضَى أَنْتَ فِيهِ مُفَرِّطٌ وَ يَوْمٌ تَنْتَظِرُهُ لَسْتَ أَنْتَ مِنْهُ عَلَى يَقِينٍ مِنْ تَرْكِ التَّفْرِيطِ وَ إِنَّمَا هُوَ يَوْمُكَ الَّذِي أَصْبَحْتَ فِيهِ وَ قَدْ يَنْبَغِي لَكَ أَنْ عَقَلْتَ وَ فَكَّرْتَ فِيمَا فَرَّطْتَ فِي الْأَمْسِ الْمَاضِي مِمَّا فَاتَكَ فِيهِ مِنْ حَسَنَاتٍ أَلَّا تَكُونَ اكْتَسَبْتَهَا وَ مِنْ سَيِّئَاتٍ أَلَّا تَكُونَ أَقْصَرْتَ عَنْهَا ",
          "وَ أَنْتَ مَعَ هَذَا مَعَ اسْتِقْبَالِ غَدٍ عَلَى غَيْرِ ثِقَةٍ مِنْ أَنْ تَبْلُغَهُ وَ عَلَى غَيْرِ يَقِينٍ مِنِ اكْتِسَابِ حَسَنَةٍ أَوْ مُرْتَدَعٍ عَنْ سَيِّئَةٍ مُحْبِطَةٍ فَأَنْتَ مِنْ يَوْمِكَ الَّذِي تَسْتَقْبِلُ عَلَى مِثْلِ يَوْمِكَ الَّذِي اسْتَدْبَرْتَ فَاعْمَلْ عَمَلَ رَجُلٍ لَيْسَ يَأْمُلُ مِنَ الْأَيَّامِ إِلَّا يَوْمَهُ الَّذِي أَصْبَحَ فِيهِ وَ لَيْلَتَهُ فَاعْمَلْ أَوْ دَعْ وَ اللَّهُ الْمُعِينُ عَلَى ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and a number of our companions, from Sahl Bin Ziyad, altogether from Al Hassan Bin Mahboub, from Ali Bin Raib, from Abu Hamza, ",
            "(It has been narrated) from Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> was saying: ‘But rather the eras are three – (Past, present and future) – days you are (living in). Yesterday passed away with whatever was in it and it will not be returning, ever! So if you had worked good during it, you will not grieve of its going away and you will be happy with what is coming in the future of it. But if you had wasted (your time) during it, your regret of its going away would be intense due to your wasting (your time) during it. ",
            "And you are (now) in your day in which you have come to be in a surprise from the coming morning and you do not know, perhaps you may not reach it, and if you do reach it, perhaps your share in it regarding the wastage would be similar to your share (of wastage) during yesterday, the past from you. ",
            "So one day from the three has passed (yesterday) and you wasted in it, and a day you are awaiting for (tomorrow), with you not being upon a certainty from it from leaving the wasting, and rather it is your day which you have come to be in (today), and it is befitting for you that you use your intellect and think regarding what you wasted during the yesterday past from what was lost from you during it, from the performance of the good deeds you did not happen to earn and from the evil deeds you did not happen to be deficient from.",
            "And you are with this with the welcoming of the future of tomorrow upon without a certainty that you will reach it, and upon without a certainty from earning good eeds or turning away from the evil deeds, frustrated. Thus you are from your day which you are welcoming (tomorrow) upon a similar (state) of your day which has gone behind you (yesterday). Therefore perform the work of a man who does not hope from the days except for his day which he has come to be in (today) and his night. So, either work or let it be, and Allah<sup>azwj</sup> is the Aider upon that’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father and a number of our people have narrated from Sahl ibn Ziyad all from al-Hassan ibn Mahbub from Ali ibn Ri’ab from abu Hamza from Ali ibn al-Husayn (a.s.) who has said the following: “Amir al-Mu’minin, Ali ibn abu Talib (a.s.) would say, ‘Time consists of three days in the middle of which you live. Yesterday that has passed in history with all that was in it and it will never return. If you had done good deeds in it you do not feel sad about it’s passing into history and you feel happy about everything that you experienced in it. If you had acted extremely (bad) in it your regret is severe, for it’s passing into history, due to your acting extremely (bad). While you are in the day that you live, about tomorrow you are unaware, you do not know if you will ever reach it. Perhaps your share of acting extremely (bad) in it will be just as yesterday that has passed into history.’ “One of the three days has passed and in it you had acted extremely (bad). There is the day that you are waiting for and you are not sure if you will avoid acting extremely (bad) in it. What is left is the day in which you live and it is very proper for you to use your power of reason and think about your acting extremely (bad) yesterday that passed and of the good deeds that you missed to perform when you should have performed them and the evil deeds that you should have avoided. Despite this, about tomorrow you are not certain of reaching it and whether you will perform any good deeds in it or avoid committing evil deeds that deletes the good deeds. Thus, your position toward tomorrow is like your position toward yesterday. Therefore, you must act like one who has no hope in any of the days except the day and night in which he lives. Do good deeds and save and Allah is the supporter for such task.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/358)"
        ],
        "index": 3011,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ الْيَمَانِيِّ عَنْ أَبِي الْحَسَنِ الْمَاضِي ( صلوات الله عليه )  قَالَ لَيْسَ مِنَّا مَنْ لَمْ يُحَاسِبْ نَفْسَهُ فِي كُلِّ يَوْمٍ فَإِنْ عَمِلَ حَسَناً اسْتَزَادَ اللَّهَ وَ إِنْ عَمِلَ سَيِّئاً اسْتَغْفَرَ اللَّهَ مِنْهُ وَ تَابَ إِلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Ibrahim Bin Umar Al Yamani, ",
            "(It has been narrated) from Abu Al-Hassan Al-Maazy<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) having said: ‘He is not from us<sup>asws</sup>, the one who does not account himself during every day. So if he has done good deeds, he would ask Allah<sup>azwj</sup> for an increase, and if he has done evil deeds, he would seek Forgiveness of Allah<sup>azwj</sup> from it and repent to Him<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Ibrahim ibn ‘Umar al-Yamani from abu al-Hassan (Ali ibn al-Husayn) (a.s.) who has said the following: “One who does not evaluate his deeds every day is not one of us. One must evaluate his deeds and pray to Allah to increase his good deeds, plead for forgiveness to Allah due to one’s committing evil deeds and turn to Him in repentance.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول بسندي ه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/359)"
        ],
        "index": 3012,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي النُّعْمَانِ الْعِجْلِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ يَا أَبَا النُّعْمَانِ لَا يَغُرَّنَّكَ النَّاسُ مِنْ نَفْسِكَ فَإِنَّ الْأَمْرَ يَصِلُ إِلَيْكَ دُونَهُمْ وَ لَا تَقْطَعْ نَهَارَكَ بِكَذَا وَ كَذَا فَإِنَّ مَعَكَ مَنْ يَحْفَظُ عَلَيْكَ عَمَلَكَ وَ أَحْسِنْ فَإِنِّي لَمْ أَرَ شَيْئاً أَحْسَنَ دَرَكاً وَ لَا أَسْرَعَ طَلَباً مِنْ حَسَنَةٍ مُحْدَثَةٍ لِذَنْبٍ قَدِيمٍ .",
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي النُّعْمَانِ مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Nu’man, from Is’haq Bin Ammar, from Abu Al Nu’man Al Ijaly, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘O Abu Al Nu’man! Do not let the people deceive you from yourself, for the matter will arrive to you besides them, and do not pass your day with such and such, as your are one who is preserving your deeds upon you. And perform good deeds, for I<sup>asws</sup> cannot see anything producing better results, nor anything easier as a remedy, than a new good deed for an old sin’. ",
            "<span style=\"font-size: small\">A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from one of our companions, from Abu Al Nu’man</span> – similar to it."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Nu’man from Ishaq ibn ‘Ammar from abu al-Nu’man al-‘Ijli from abu Ja’far (a.s.) who has said the following: “O abu al-Nu’man, do not allow people to deceive you about yourself; the matter will come to you and not to them. Do not spend your day in this and that; with you there is one who preserves your deeds for you. Do good deeds; I do not see anything of better result and remedy for the old sins then new good deeds.’” A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ‘Uthman ibn ‘Isa from certain individuals of our people from abu al- Nu’man a similar Hadith. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/360)"
        ],
        "index": 3013,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ اصْبِرُوا عَلَى الدُّنْيَا فَإِنَّمَا هِيَ سَاعَةٌ فَمَا مَضَى مِنْهُ فَلَا تَجِدُ لَهُ أَلَماً وَ لَا سُرُوراً وَ مَا لَمْ يَجِئْ فَلَا تَدْرِي مَا هُوَ وَ إِنَّمَا هِيَ سَاعَتُكَ الَّتِي أَنْتَ فِيهَا فَاصْبِرْ فِيهَا عَلَى طَاعَةِ اللَّهِ وَ اصْبِرْ فِيهَا عَنْ مَعْصِيَةِ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from one our companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Be patient upon the world, for rather it is a moment. So whatever is past from it, neither renew a pain nor a joy for it; and whatever has not come yet, so you do not know what it is; and rather it is your time which you are in (at the moment), so observe patience during it upon the obedience of Allah<sup>azwj</sup>, and be patient during it from disobeying Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ‘Uthman ibn ‘Isa from certain individuals of our people from abu ‘Abd Allah (a.s.) who has said the following: “Exercise patience in worldly matters; it is only an hour. You do not find any pain or happiness in whatever has passed. The hour that has not yet arrived is unknown to you in matters of its contents. The only time is the hour in which you live. Exercise patience in it to obey Allah and exercise patience in such time in the matters of disobedience to Allah.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/361)"
        ],
        "index": 3014,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:5",
        "text": [
          "عَنْهُ عَنْ بَعْضِ أَصْحَابِنَا رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) احْمِلْ نَفْسَكَ لِنَفْسِكَ فَإِنْ لَمْ تَفْعَلْ لَمْ يَحْمِلْكَ غَيْرُكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from one of our companions, raising it, said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Carry yourself (your burden) by yourself, for it you do not do so, others will not carry you’."
          ],
          "en.sarwar": [
            "5. It is narrated from him (narrator of the Hadith above) from certain individuals of our people in a marfu’ manner who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘Hold your soul responsible for yourself. If you did not do so others will not do for you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/361)"
        ],
        "index": 3015,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:6",
        "text": [
          "عَنْهُ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لِرَجُلٍ إِنَّكَ قَدْ جُعِلْتَ طَبِيبَ نَفْسِكَ وَ بُيِّنَ لَكَ الدَّاءُ وَ عُرِّفْتَ آيَةَ الصِّحَّةِ وَ دُلِلْتَ عَلَى الدَّوَاءِ فَانْظُرْ كَيْفَ قِيَامُكَ عَلَى نَفْسِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, raising it, said, ",
            "‘Abu Abdullah<sup>asws</sup> said to a man: ‘You have been made to be a physician yourself, and the illnesses have been clarified to you, and you have recognises the signs of good health, and you have been indicated upon the medication, therefore look how you are standing (burden) upon yourself’."
          ],
          "en.sarwar": [
            "6. It is narrated from him (narrator of the Hadith above) in a marfu’ manner from abu ‘Abd Allah (a.s.) who has said the following to a man: “You have been made the physician for your own self. Medicine is prescribed for you; signs of good health are shown to you, and the direction for medicine is given to you. It is all up to you how you treat yourself.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/362)"
        ],
        "index": 3016,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:7",
        "text": [
          "عَنْهُ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لِرَجُلٍ اجْعَلْ قَلْبَكَ قَرِيناً بَرّاً أَوْ وَلَداً وَاصِلًا وَ اجْعَلْ عَمَلَكَ وَالِداً تَتَّبِعُهُ وَ اجْعَلْ نَفْسَكَ عَدُوّاً تُجَاهِدُهَا وَ اجْعَلْ مَالَكَ عَارِيَّةً تَرُدُّهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, raising it, said: ",
            "‘Abu Abdullah<sup>asws</sup> said to a man: ‘Make your heart to be a righteous companion as a child would be grateful to its parents, and make your deed to be a father which you follow (cheerfully), and make your ‘<span class=\"iTxt\">Nafs</span>’ (yourself) to be an enemy against which you wage a war, and make your wealth as a lease you will be returning’."
          ],
          "en.sarwar": [
            "7. It is narrated from him (narrator of the Hadith above) in a marfu’ manner from abu ‘Abd Allah (a.s.) who has said the following to a man: “Make your heart a virtuous companion for yourself or like a child who does not fail to maintain good relations with parents. Consider your deeds as your father whom you follow, consider your soul as your enemy against whom you strive and consider your properties as borrowed for the safe return of which you are responsible.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/363)"
        ],
        "index": 3017,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:8",
        "text": [
          "وَ عَنْهُ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) اقْصُرْ نَفْسَكَ عَمَّا يَضُرُّهَا مِنْ قَبْلِ أَنْ تُفَارِقَكَ وَ اسْعَ فِي فَكَاكِهَا كَمَا تَسْعَى فِي طَلَبِ مَعِيشَتِكَ فَإِنَّ نَفْسَكَ رَهِينَةٌ بِعَمَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, raising it, said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘And from him, raising it, said, ‘Abu Abdullah<sup>asws</sup> said: ‘Limit your ‘Nafs’ (soul) from what harms it before it departs from you and strive in its liberation just as you strive in seeking your livelihood, for your ‘Nafs’ is pledged with your deeds (<span class=\"ibTxt\">[74:38] Every soul is held in pledge for what it earns</span>)’."
          ],
          "en.sarwar": [
            "8. It is narrated from him (narrator of the Hadith above) in a marfu’ manner from abu ‘Abd Allah (a.s.) who has said the following: “Hold back your soul from that which harms it before it departs you, strive to set it free just as you strive to make a living; your soul’s well being depends upon your good deeds.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/363)"
        ],
        "index": 3018,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:9",
        "text": [
          "عَنْهُ عَنْ بَعْضِ أَصْحَابِهِ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كَمْ مِنْ طَالِبٍ لِلدُّنْيَا لَمْ يُدْرِكْهَا وَ مُدْرِكٍ لَهَا قَدْ فَارَقَهَا فَلَا يَشْغَلَنَّكَ طَلَبُهَا عَنْ عَمَلِكَ وَ الْتَمِسْهَا مِنْ مُعْطِيهَا وَ مَالِكِهَا فَكَمْ مِنْ حَرِيصٍ عَلَى الدُّنْيَا قَدْ صَرَعَتْهُ وَ اشْتَغَلَ بِمَا أَدْرَكَ مِنْهَا عَنْ طَلَبِ آخِرَتِهِ حَتَّى فَنِيَ عُمُرُهُ وَ أَدْرَكَهُ أَجَلُهُ .",
          "وَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) الْمَسْجُونُ مَنْ سَجَنَتْهُ دُنْيَاهُ عَنْ آخِرَتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from one of our companions, raising it,said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘How many are the ones who seek for the world and do not achieve it, and its achievers have separated from it (have died). So do not pre-occupy ‘Nafs’ (yourselves) in seeking it (too much) from performing your deed, and beseech it from its Giver and its Owner. So how many are the greedy ones upon the world were cut down and pre-occupied themselves with whatever they achieved from it, (while keep themselves away) from seeking the Hereafter - until one’s life-time perished and he realised his death’. ",
            "And Abu Abdullah<sup>asws</sup> said: ‘The (real) prisoner is that one whose world has imprisoned him from his Hereafter’."
          ],
          "en.sarwar": [
            "9. It is narrated from him (narrator of the Hadith above) from certain individuals of his people in a marfu’ manner from abu ‘Abd Allah (a.s.) who has said the following: “How many are those who seek worldly gains but can not achieve them and how many are those who had achieved worldly gains but have already departed them! Do not allow your seeking worldly gains prevent you from good deeds. You must request worldly gains from the One Who grants them and is the owner of the same. How many were those who were greedy of the worldly gains that were destroyed and whose preoccupation in them prevented them from seeking the gains of the next life until their lives finished and the appointed time approached them! “Abu ‘Abd Allah (a.s.) has said, ‘A prisoner is one whose worldly affairs imprison him so he cannot do anything for his next life.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/364)"
        ],
        "index": 3019,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:10",
        "text": [
          "وَ عَنْهُ رَفَعَهُ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ إِذَا أَتَتْ عَلَى الرَّجُلِ أَرْبَعُونَ سَنَةً قِيلَ لَهُ خُذْ حِذْرَكَ فَإِنَّكَ غَيْرُ مَعْذُورٍ وَ لَيْسَ ابْنُ الْأَرْبَعِينَ بِأَحَقَّ بِالْحِذْرِ مِنِ ابْنِ الْعِشْرِينَ فَإِنَّ الَّذِي يَطْلُبُهُمَا وَاحِدٌ وَ لَيْسَ بِرَاقِدٍ فَاعْمَلْ لِمَا أَمَامَكَ مِنَ الْهَوْلِ وَ دَعْ عَنْكَ فُضُولَ الْقَوْلِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, raising it, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When a man comes to the age of forty it is said to him: ‘Take a caution, for you are without an excuse’, and there is no person of forty (years of age) more rightful with the caution than a person of twenty, for what is seeking them both, is the one (death) and it is not sleeping. Therefore, work for what is in front of you from the horrors and stay away from the useless speech’."
          ],
          "en.sarwar": [
            "10. It is narrated from him (narrator of the Hadith above) in a marfu’ manner from abu Ja’far (a.s.) who has said the following: “When a man reaches the age of forty it is said to him, ‘Beware, you have no excuses!’ In fact, a person at the age of forty is not obliged to exercise caution against sins more than the person at the age of twenty. What is after both of them is the same (that is death) and it is not sleeping. Perform good deeds for what lies ahead of frightening conditions and stop the unnecessary words.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/365)"
        ],
        "index": 3020,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:11",
        "text": [
          "عَنْهُ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ حَسَّانَ عَنْ زَيْدٍ الشَّحَّامِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) خُذْ لِنَفْسِكَ مِنْ نَفْسِكَ خُذْ مِنْهَا فِي الصِّحَّةِ قَبْلَ السُّقْمِ وَ فِي الْقُوَّةِ قَبْلَ الضَّعْفِ وَ فِي الْحَيَاةِ قَبْلَ الْمَمَاتِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ali Bin Al Hakam, from Hassan, from Zayd Al Shahham who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Work (on behalf of) ‘<span class=\"iTxt\">Nafs</span>’ (yourself) for (the sake of) your ‘<span class=\"iTxt\">Nafs</span>’ (yourself). Take from it during the good health before the sickness, and during the strength before the weakness, and during the life before the death’."
          ],
          "en.sarwar": [
            "11. It is narrated from him (narrator of the Hadith above) from Ali ibn al-Hakam from Hassan from Zayd al-Shahham who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘Take from your soul for your soul. Take from it in good health before illness, during its strength before weakness and in its lifetime before death.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/365)"
        ],
        "index": 3021,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:12",
        "text": [
          "عَنْهُ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ النَّهَارَ إِذَا جَاءَ قَالَ يَا ابْنَ آدَمَ اعْمَلْ فِي يَوْمِكَ هَذَا خَيْراً أَشْهَدْ لَكَ بِهِ عِنْدَ رَبِّكَ يَوْمَ الْقِيَامَةِ فَإِنِّي لَمْ آتِكَ فِيمَا مَضَى وَ لَا آتِيكَ فِيمَا بَقِيَ وَ إِذَا جَاءَ اللَّيْلُ قَالَ مِثْلَ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ali Bin Al Hakam, from Hisham Bin Salim, from one of his companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The day, when it comes, says, ‘O son of Adam<sup>as</sup> work good in this day of yours, I will testify for you with it in the Presence of your Lord<sup>azwj</sup> on the Day of Judgment, for I did not come to you in what is lost (gone) nor will I come to you in what remains (future - as you may not be alive)’. And when the night comes, it says similar to that’."
          ],
          "en.sarwar": [
            "12. It is narrated from him (narrator of the Hadith above) from Ali ibn al-Hakam from Hisham ibn Salim from certain individuals of his people from abu ‘Abd Allah (a.s.) who has said the following: “When the day comes it says, ‘O son of Adam do good deeds this day so I may bear witness to it to testify (in your support) before your Lord on the Day of Judgment. I had not come to you before and will not come to you in future.’ When the night comes it speaks likewise.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/365)"
        ],
        "index": 3022,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:13",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ شُعَيْبِ بْنِ عَبْدِ اللَّهِ عَنْ بَعْضِ أَصْحَابِهِ رَفَعَهُ قَالَ جَاءَ رَجُلٌ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ أَوْصِنِي بِوَجْهٍ مِنْ وُجُوهِ الْبِرِّ أَنْجُو بِهِ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَيُّهَا السَّائِلُ اسْتَمِعْ ثُمَّ اسْتَفْهِمْ ثُمَّ اسْتَيْقِنْ ثُمَّ اسْتَعْمِلْ وَ اعْلَمْ أَنَّ النَّاسَ ثَلَاثَةٌ زَاهِدٌ وَ صَابِرٌ وَ رَاغِبٌ ",
          "فَأَمَّا الزَّاهِدُ فَقَدْ خَرَجَتِ الْأَحْزَانُ وَ الْأَفْرَاحُ مِنْ قَلْبِهِ فَلَا يَفْرَحُ بِشَيْ‏ءٍ مِنَ الدُّنْيَا وَ لَا يَأْسَى عَلَى شَيْ‏ءٍ مِنْهَا فَاتَهُ فَهُوَ مُسْتَرِيحٌ ",
          "وَ أَمَّا الصَّابِرُ فَإِنَّهُ يَتَمَنَّاهَا بِقَلْبِهِ فَإِذَا نَالَ مِنْهَا أَلْجَمَ نَفْسَهُ عَنْهَا لِسُوءِ عَاقِبَتِهَا وَ شَنَآنِهَا لَوِ اطَّلَعْتَ عَلَى قَلْبِهِ عَجِبْتَ مِنْ عِفَّتِهِ وَ تَوَاضُعِهِ وَ حَزْمِهِ ",
          "وَ أَمَّا الرَّاغِبُ فَلَا يُبَالِي مِنْ أَيْنَ جَاءَتْهُ الدُّنْيَا مِنْ حِلِّهَا أَوْ مِنْ حَرَامِهَا وَ لَا يُبَالِي مَا دَنَّسَ فِيهَا عِرْضَهُ وَ أَهْلَكَ نَفْسَهُ وَ أَذْهَبَ مُرُوءَتَهُ فَهُمْ فِي غَمْرَةٍ يَضْطَرِبُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ahmad Bin Muhammad, from Shuayb Bin Abdullah, from one of his companions, raising it, said, ",
            "‘A man came over to Amir Al-Momineen<sup>asws</sup> and he said, ‘O Amir Al-Momineen<sup>asws</sup>! Advise me of an aspect from the aspects of the righteousness I can attain salvation with it’. Amir Al-Momineen<sup>asws</sup> said: ‘O you questioner! Listen intently, then understand, then be convinced, and perform; and know that the people are three (types) – an ascetic, and a patient, and a coveting one (having cravings).",
            "So as for the ascetic one, so the grief and the happiness has exited from his heart, so he does not get happy with anything from the world nor does he despair upon anything that is lost from him. Thus he is in peace (of mind).",
            "And as for the patient one, so he wishes for it in his heart. So when he does attain from it, reins (restraints) his self from it due to the evil consequences of it and its seduction. Were you to be notified upon (the contents of) his heart it would astonish you from its chastity, and its humbleness, and its resoluteness.",
            "And as for the covetous one, so he does not care from when the world comes to him, from its Permissible (means) or from its Prohibited (means), and he does not care what filth there is in its display, and it destroys his soul, and removes his honour. Thus, these (covetous ones) are in the midst of disturbances’."
          ],
          "en.sarwar": [
            "13. Al-Husayn ibn Muhammad has narrated from Mu’alla ibn Muhammad from Ahmad ibn Muhammad from Shu’ayb ibn ‘Abd Allah from certain individuals of his people in a marfu’ manner that has said the following: “Once a man came to Amir al-Mu’minin, Ali ibn abu Talib (a.s.) and said, ‘O Amir al- Mu’minin, grant me good advice in the aspects of virtue so I may attain salvation.’ Amir al-Mu’minin, Ali ibn abu Talib (a.s.) said, ‘O seeker of advice, listen carefully, understand, ascertain and practice. You must know that people are of three kinds: restraining themselves from worldly matters, exercising patience and those who are inclined toward worldly gains. “From the hearts of restraining people sadness and happiness have moved out. He does not become happy for any of the worldly things, nor he is grieved over anything of the world that he may have missed, thus, he is comfortable. “The person who exercises patience has hopes to have worldly gains in his heart and when he gains anything he holds his soul back from it due to such gains’ bad consequences and disgrace. Were you to see his heart you would be astonished by its chastity, humility and determination. “To those who are inclined to worldly gains it does not matter wherefrom worldly gains come to them, lawful or unlawful as well as whether it throws filth over their honor or destroys their souls, or takes away their kindness. They are restless in a vortex. ’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/367)"
        ],
        "index": 3023,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:14",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ مُحَمَّدِ بْنِ حَكِيمٍ عَمَّنْ حَدَّثَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه )  لَا يَصْغَرُ مَا يَنْفَعُ يَوْمَ الْقِيَامَةِ وَ لَا يَصْغَرُ مَا يَضُرُّ يَوْمَ الْقِيَامَةِ فَكُونُوا فِيمَا أَخْبَرَكُمُ اللَّهُ عَزَّ وَ جَلَّ كَمَنْ عَايَنَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Muhammad Bin Hakeyn, from the one who narrated it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘Do not belittle what would benefit on the Day of Judgment, nor belittle what would harm on the Day of Judgment. Thus, you should become, regarding whatever Allah<sup>azwj</sup> Mighty and Majestic Informed you all, like the one who can visualise it’."
          ],
          "en.sarwar": [
            "14. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from Muhammad ibn Hakim from those whom has mentioned (in his book) from abu ‘Abd Allah (a.s.) who has said the following: “Amir al-Mu’minin, Ali ibn abu Talib (a.s.) has said, ‘What is beneficial on the Day of Judgment is not small (insignificant) and nor what is harmful for one on the Day of Judgment is small (insignificant). About whatever Allah, the Most Majestic, the Most Holy, has informed, you must be like one who has eye-witnessed them.’” "
          ]
        }
      },
      {
        "index": 3024,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:15",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ جَمِيعاً عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ الْمِنْقَرِيِّ عَنْ حَفْصِ بْنِ غِيَاثٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ يَقُولُ إِنْ قَدَرْتَ أَنْ لَا تُعْرَفَ فَافْعَلْ وَ مَا عَلَيْكَ أَلَّا يُثْنِيَ عَلَيْكَ النَّاسُ وَ مَا عَلَيْكَ أَنْ تَكُونَ مَذْمُوماً عِنْدَ النَّاسِ إِذَا كُنْتَ مَحْمُوداً عِنْدَ اللَّهِ ",
          "ثُمَّ قَالَ قَالَ أَبِي عَلِيُّ بْنُ أَبِي طَالِبٍ ( عليه السلام ) لَا خَيْرَ فِي الْعَيْشِ إِلَّا لِرَجُلَيْنِ رَجُلٍ يَزْدَادُ كُلَّ يَوْمٍ خَيْراً وَ رَجُلٍ يَتَدَارَكُ مَنِيَّتَهُ بِالتَّوْبَةِ وَ أَنَّى لَهُ بِالتَّوْبَةِ ",
          "وَ اللَّهِ لَوْ سَجَدَ حَتَّى يَنْقَطِعَ عُنُقُهُ مَا قَبِلَ اللَّهُ تَبَارَكَ وَ تَعَالَى مِنْهُ إِلَّا بِوَلَايَتِنَا أَهْلَ الْبَيْتِ ",
          "أَلَا وَ مَنْ عَرَفَ حَقَّنَا وَ رَجَا الثَّوَابَ فِينَا وَ رَضِيَ بِقُوتِهِ نِصْفِ مُدٍّ فِي كُلِّ يَوْمٍ وَ مَا سَتَرَ عَوْرَتَهُ وَ مَا أَكَنَّ رَأْسَهُ وَ هُمْ وَ اللَّهِ فِي ذَلِكَ خَائِفُونَ وَجِلُونَ وَدُّوا أَنَّهُ حَظُّهُمْ مِنَ الدُّنْيَا وَ كَذَلِكَ وَصَفَهُمُ اللَّهُ عَزَّ وَ جَلَّ فَقَالَ وَ الَّذِينَ يُؤْتُونَ ما آتَوْا وَ قُلُوبُهُمْ وَجِلَةٌ أَنَّهُمْ إِلى رَبِّهِمْ راجِعُونَ",
          "ثُمَّ قَالَ مَا الَّذِي آتَوْا آتَوْا وَ اللَّهِ مَعَ الطَّاعَةِ الْمَحَبَّةَ وَ الْوَلَايَةَ وَ هُمْ فِي ذَلِكَ خَائِفُونَ لَيْسَ خَوْفُهُمْ خَوْفَ شَكٍّ وَ لَكِنَّهُمْ خَافُوا أَنْ يَكُونُوا مُقَصِّرِينَ فِي مَحَبَّتِنَا وَ طَاعَتِنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Ali Bin Muhammad Al Qasany, altogether from Al Qasim Bin Muhammad, from Suleyman Al Minqary, from Hafs Bin Giyas who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘If you are able upon that you are not recognised, then do so, so what would be upon you if the people do not mention you in praise, and what is upon you if you become condemned in the presence of the people while you are a Praised one in the Presence of Allah<sup>azwj</sup>?’",
            "Then he<sup>asws</sup> said: ‘Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> said: ‘There is no goodness in the life except for two (types of) men – a man who increases goodness every day and a man who rectifies his evil deeds with the repentance, and (unless) there is an obstruction for him with the repentance. ",
            "By Allah<sup>azwj</sup>! Even if one were to perform <span class=\"iTxt\">Sajdah</span> (prostration) until his neck gets cut off, Allah<sup>azwj</sup> Blessed and High will not Accept it from him except by our<sup>asws</sup> Wilayah - the People<sup>asws</sup> of the Household.",
            "Indeed! And the one who recognises our<sup>asws</sup> rights and hopes for the Rewards regarding us<sup>asws</sup>, and he would be pleased with his subsistence of half a <span class=\"iTxt\">Mudd</span> (1 <span class=\"iTxt\">Mudd</span> = 750 gms.) during every day, and with what can conceal his bareness, and with what can cover his head, and they, by Allah<sup>azwj</sup> are fearful during that, and are agreeing lovingly that it is their share from the world, and that is how Allah<sup>azwj</sup> Mighty and Majestic Described them, so He<sup>azwj</sup> Said <span class=\"ibTxt\">[23:60] And the ones who give what they give whilst their hearts are full of fear that to their Lord they would be returning</span>.",
            "Then he<sup>asws</sup> said: ‘What is that which they would be bringing? By Allah<sup>azwj</sup>! They would be bringing with them the obedience, the love and the Wilayah, and they would be fearful during that. Their fear would not be the fear of doubt, but they would be fearing that perhaps they have been deficient (Mukassireen) in our<sup>asws</sup> love and our<sup>asws</sup> obedience’."
          ],
          "en.sarwar": [
            "15. Ali ibn Ibrahim has narrated from his father and Ali ibn Muhammad al-Qasani have all narrated from al-Qasim ibn Muhammad from Sulayman al-Minqari from Hafs ibn Ghiyath who has said the following: “Once I heard abu ‘Abd Allah (a.s.) saying, ‘If you can remain unknown, then do so. There will be nothing wrong if people will not praise you. There is nothing wrong for you if people censure you if you are praiseworthy before Allah.’ The Imam said, ‘My father Amir al- Mu’minin, Ali ibn abu Talib (a.s.) has said, “There is nothing good in life except for two kinds of people: a man who every day increases his good deeds and a man who every day remedies a destructive deed with repentance. How can repentance be of any benefit for him? By Allah, if he would perform a Sajdah prostration for such a length of time that his neck severs off of his body still, Allah, the Most Blessed, the Most High, will not accept his repentance without his acknowledgement of the Wilayah (Divine Authority) of our Ahl al-Bayt (family of Holy Prophet). You must know that whoever recognizes our rights can have hope for rewards because of us. He agrees, for his survival, to half of a one time meal every day, and with that which provides him covering for his privacy, his or her head, and with it, by Allah, they live in fear and apprehension and love to agree with this much as their share from the world and this is how Allah, the Majestic, the Glorious, has described them, ‘. . . who bring what is brought to them and whose hearts are afraid of their return to their Lord.’ (23:60) What do they bring? They, by Allah, will bring along with obedience, love and (acknowledgement of) the guardianship (of Allah and Ahl al-Bayt (family of Holy Prophet) and they still will be afraid. Such fear is not due to doubts, but it is due to their fear of falling short in our love and obedience.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/370)"
        ],
        "index": 3025,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:16",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ إِبْرَاهِيمَ بْنِ مِهْزَمٍ عَنِ الْحَكَمِ بْنِ سَالِمٍ قَالَ دَخَلَ قَوْمٌ فَوَعَظَهُمْ ثُمَّ قَالَ مَا مِنْكُمْ مِنْ أَحَدٍ إِلَّا وَ قَدْ عَايَنَ الْجَنَّةَ وَ مَا فِيهَا وَ عَايَنَ النَّارَ وَ مَا فِيهَا إِنْ كُنْتُمْ تُصَدِّقُونَ بِالْكِتَابِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Ibrahim Bin Mihzam, from Al hakam Bin Salim who said, ",
            "‘A group came over, so he<sup>asws</sup> advised them, then said: ‘There is not one of you except that he has visualised the Paradise and whatever is in it, and visualised the Fire and whatever there is in it, if you are ratifying by the Book’."
          ],
          "en.sarwar": [
            "16. Ali ibn Ibrahim has narrated from his father from ibn Mahbub from Ibrahim ibn Mehzam from Hakam ibn Salim who has said the following: “Once a people came to the Imam (abu Ja’far or abu ‘Abd Allah, recipient of divine supreme covenant) who granted them good advice and then said, ‘If you really affirm the Holy book there is no one among you who have not observed paradise and all that it contains or the fire with all that is in it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/371)"
        ],
        "index": 3026,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:17",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ سَمِعْتُ أَبَا الْحَسَنِ ( عليه السلام ) يَقُولُ لَا تَسْتَكْثِرُوا كَثِيرَ الْخَيْرِ وَ تَسْتَقِلُّوا قَلِيلَ الذُّنُوبِ فَإِنَّ قَلِيلَ الذُّنُوبِ يَجْتَمِعُ حَتَّى يَصِيرَ كَثِيراً وَ خَافُوا اللَّهَ فِي السِّرِّ حَتَّى تُعْطُوا مِنْ أَنْفُسِكُمُ النَّصَفَ وَ سَارِعُوا إِلَى طَاعَةِ اللَّهِ وَ اصْدُقُوا الْحَدِيثَ وَ أَدُّوا الْأَمَانَةَ فَإِنَّمَا ذَلِكَ لَكُمْ وَ لَا تَدْخُلُوا فِيمَا لَا يَحِلُّ لَكُمْ فَإِنَّمَا ذَلِكَ عَلَيْكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad bin Muhammad Bin Khalid, from Usman Bin Isa, from Sama’at who said, ",
            "‘I heard Abu Al-Hassan<sup>asws</sup> saying: ‘Do not consider it a lot, a lot of goodness, and do not consider it as few, the few sins, for the few sins would be gathering until they become a lot; and be fearful of Allah<sup>azwj</sup> in the secret until you are obeying the fairness from yourselves; and hasten to the obedience of Allah<sup>azwj</sup> and ratify the Ahadeeth, and pay the entrustment, so rather that is for you; and do not indulge in what is not Permissible for you, for rather that is upon you (the burden of the sins)’."
          ],
          "en.sarwar": [
            "17. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ‘Uthman ibn ‘Isa from Sama’a who has said the following: “I heard abu al-Hassan (a.s.) saying, ‘Do not consider a great deal of good deeds a great deal. Do not consider a little sin little; the little sins accumulate to become a great deal. Have fear of Allah in private so you can yield to justice against yourselves. Hurry up in obedience to Allah, be truthful in your words, keep the trust; it is for you. Do not be involved in what is not lawful to you; it is against you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/371)"
        ],
        "index": 3027,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:18",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ مَا أَحْسَنَ الْحَسَنَاتِ بَعْدَ السَّيِّئَاتِ وَ مَا أَقْبَحَ السَّيِّئَاتِ بَعْدَ الْحَسَنَاتِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Abu Ayoubm from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘How good are the good deeds after the evil deeds, and how ugly are the evil deeds after the good deeds’."
          ],
          "en.sarwar": [
            "18. Ali ibn Ibrahim has narrated from his father from ibn Mahbub from abu Ayyub from Muhammad ibn Muslim who has said the following: “I heard abu Ja’far (a.s.) saying ‘How excellent are good deeds after evil deeds and how disgraceful are evil deeds after good deeds!”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/372)"
        ],
        "index": 3028,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:19",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنِ ابْنِ فَضَّالٍ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّكُمْ فِي آجَالٍ مَقْبُوضَةٍ وَ أَيَّامٍ مَعْدُودَةٍ وَ الْمَوْتُ يَأْتِي بَغْتَةً مَنْ يَزْرَعْ خَيْراً يَحْصُدْ غِبْطَةً وَ مَنْ يَزْرَعْ شَرّاً يَحْصِدْ نَدَامَةً وَ لِكُلِّ زَارِعٍ مَا زَرَعَ وَ لَا يَسْبِقُ الْبَطِي‏ءَ مِنْكُمْ حَظُّهُ وَ لَا يُدْرِكُ حَرِيصٌ مَا لَمْ يُقَدَّرْ لَهُ مَنْ أُعْطِيَ خَيْراً فَاللَّهُ أَعْطَاهُ وَ مَنْ وُقِيَ شَرّاً فَاللَّهُ وَقَاهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Ibn Fazzal, from the one who mentioned it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘You are all (living) in a term which is being marked (allotted) and days which are numbered, and the death comes unexpectedly. The one who cultivates goodness would harvest (eternal) Bliss, but the one who cultivates evil would harvest regret; and for every farmer is what he farms; and the slow moving one from you will not be preceded by his share, nor would the greedy one comes across what is not Ordained for him. The one who does good, Allah<sup>azwj</sup> will Grant him good, but the one who saves (himself from) evil, So Allah<sup>azwj</sup> will Save evil for him’."
          ],
          "en.sarwar": [
            "19. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from ibn Faddal from those whom has mentioned (in his book) from abu ‘Abd Allah (a.s.) who has said the following: “You live in a period of time that is continuously reduced and in calculated days. Death comes suddenly. Whoever sows goodness will harvest what is very much sought after. Whoever sows evil will harvest regret. Every farmer finds what he has planted. The sustenance of the slow moving ones among you will not move ahead of him and the greedy will not achieve what is not assigned for him. Whoever does good, Allah grants him good and whoever safeguards against evil, Allah protects him.” "
          ]
        }
      },
      {
        "index": 3029,
        "local_index": 20,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:20",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِهِ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي عُثْمَانَ عَنْ وَاصِلٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ جَاءَ رَجُلٌ إِلَى أَبِي ذَرٍّ فَقَالَ يَا أَبَا ذَرٍّ مَا لَنَا نَكْرَهُ الْمَوْتَ فَقَالَ لِأَنَّكُمْ عَمَرْتُمُ الدُّنْيَا وَ أَخْرَبْتُمُ الْآخِرَةَ فَتَكْرَهُونَ أَنْ تُنْقَلُوا مِنْ عُمْرَانٍ إِلَى خَرَابٍ ",
          "فَقَالَ لَهُ فَكَيْفَ تَرَى قُدُومَنَا عَلَى اللَّهِ فَقَالَ أَمَّا الْمُحْسِنُ مِنْكُمْ فَكَالْغَائِبِ يَقْدَمُ عَلَى أَهْلِهِ وَ أَمَّا الْمُسِي‏ءُ مِنْكُمْ فَكَالْآبِقِ يُرَدُّ عَلَى مَوْلَاهُ ",
          "قَالَ فَكَيْفَ تَرَى حَالَنَا عِنْدَ اللَّهِ قَالَ اعْرِضُوا أَعْمَالَكُمْ عَلَى الْكِتَابِ إِنَّ اللَّهَ يَقُولُ إِنَّ الْأَبْرارَ لَفِي نَعِيمٍ وَ إِنَّ الْفُجَّارَ لَفِي جَحِيمٍ ",
          "قَالَ فَقَالَ الرَّجُلُ فَأَيْنَ رَحْمَةُ اللَّهِ قَالَ رَحْمَةُ اللَّهِ قَرِيبٌ مِنَ الْمُحْسِنِينَ",
          "قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ كَتَبَ رَجُلٌ إِلَى أَبِي ذَرٍّ رَضِيَ اللَّهُ عَنْهُ يَا أَبَا ذَرٍّ أَطْرِفْنِي بِشَيْ‏ءٍ مِنَ الْعِلْمِ فَكَتَبَ إِلَيْهِ أَنَّ الْعِلْمَ كَثِيرٌ وَ لَكِنْ إِنْ قَدَرْتَ أَنْ لَا تُسِي‏ءَ إِلَى مَنْ تُحِبُّهُ فَافْعَلْ قَالَ فَقَالَ لَهُ الرَّجُلُ وَ هَلْ رَأَيْتَ أَحَداً يُسِي‏ءُ إِلَى مَنْ يُحِبُّهُ فَقَالَ لَهُ نَعَمْ نَفْسُكَ أَحَبُّ الْأَنْفُسِ إِلَيْكَ فَإِذَا أَنْتَ عَصَيْتَ اللَّهَ فَقَدْ أَسَأْتَ إِلَيْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Ahmad Bin Muhammad, from one of his companions, from Al Hassan Bin Ali Bin Abu Usman, from Wasil, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A man came over to Abu Zarr<sup>a</sup><sup>r</sup> and he said, ‘O Abu Zarr<sup>a</sup><sup>r</sup>! What is the matter with us that we dislike the death?’ So he<sup>a</sup><sup>r</sup> said: ‘Because you are all building the world and ruining the Hereafter, therefore you are disliking to be transferred from buildings to the ruins’. ",
            "So he said to him<sup style=\"font-weight: normal\">a</sup><sup style=\"font-weight: normal\">r</sup>, ‘So how do you<sup style=\"font-weight: normal\">a</sup><sup style=\"font-weight: normal\">r</sup> see our proceeding to Allah<sup style=\"font-weight: normal\">azwj</sup>?’ So he<sup style=\"font-weight: normal\">a</sup><sup style=\"font-weight: normal\">r</sup> said: ‘As for the good ones from you, so he is like the absentee proceeding to his family, and as for the disobedient ones from you, so he is like the absconder (slave) returning to his master’. ",
            "So he said: ‘So how do you<sup style=\"font-weight: normal\">a</sup><sup style=\"font-weight: normal\">r</sup> see our state in the Presence of Allah<sup style=\"font-weight: normal\">azwj</sup>?’ He<sup style=\"font-weight: normal\">a</sup><sup style=\"font-weight: normal\">r</sup> said: ‘Your deeds would be presented upon the Book. Allah<sup style=\"font-weight: normal\">azwj</sup> is Saying <span class=\"ibTxt\">[82:13] Most surely the righteous are in Bliss, [82:14] And most surely the wicked are in Blazing Fire</span>’.",
            "He<sup style=\"font-weight: normal\">asws</sup> said: ‘So the man said, ‘So where is the Mercy of Allah<sup style=\"font-weight: normal\">azwj</sup>?’ He<sup style=\"font-weight: normal\">a</sup><sup style=\"font-weight: normal\">r</sup> said: ‘The Mercy of Allah<sup style=\"font-weight: normal\">azwj</sup> is nearby to the good doers’. ",
            "Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> said: ‘And a man wrote to Abu Zarr<sup style=\"font-weight: normal\">a</sup><sup style=\"font-weight: normal\">r</sup>, may Allah<sup style=\"font-weight: normal\">azwj</sup> be Pleased with him<sup style=\"font-weight: normal\">as</sup>, ‘O Abu Zarr<sup style=\"font-weight: normal\">a</sup><sup style=\"font-weight: normal\">r</sup>! Present to me something from the knowledge’. So he<sup style=\"font-weight: normal\">a</sup><sup style=\"font-weight: normal\">r</sup> wrote to him: ‘The knowledge is a lot, but if you are able that you do not disappoint the one whom you love, then do so’. So the man said to him<sup style=\"font-weight: normal\">a</sup><sup style=\"font-weight: normal\">r</sup>, ‘And have you<sup style=\"font-weight: normal\">a</sup><sup style=\"font-weight: normal\">r</sup> seen anyone who disappoint the one whom he loves?’ So he<sup style=\"font-weight: normal\">a</sup><sup style=\"font-weight: normal\">r</sup> said to him: ‘Yes, your soul is the most beloved of the selves to you. So when you disobey Allah<sup style=\"font-weight: normal\">azwj</sup>, so you would have disappointed it’."
          ],
          "en.sarwar": [
            "20. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from certain individuals of his people from al-Hassan ibn Ali ibn abu ‘Uthman from Wasil from ‘Abd Allah ibn Sinan from abu ‘Abd Allah (a.s.) who has said the following: “A man came to abu Dhar and asked, ‘O abu Dhar, why do we dislike death?’ He said, ‘It is because you have developed the world and destroyed the next life and you dislike moving from developed to that which is mined.’ The man asked, ‘How do you see our moving in the presence of Allah?’ He replied, ‘The people of good deeds among you will be like one coming home from a journey. The evil doers among you, however, will be like a runaway slave returned to his master.’ The man then asked, ‘How do you see our condition before Allah?’ He said, ‘Present your deeds before the book of Allah. Allah has said, ‘‘The virtuous ones will live in bounties and the evil doers will live in fire.” (82:14,15) The man than asked, ‘Where then is the mercy of Allah?’ He replied, ‘The mercy of Allah is very close to the people who do good deeds.’ “Abu ‘Abd Allah (a.s.) then said, ‘A man wrote to abu Dhar, may Allah be pleased with him, “O abu Dhar instruct me with a few things of knowledge.” He wrote back to him, ‘Knowledge is of many kinds, however, if you are able not to disappoint those whom you love, then do so. Yes, your soul is the most beloved to you. When you disobey Allah, you are doing bad and disappointing things to your own soul.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/374)"
        ],
        "index": 3030,
        "local_index": 21,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:21",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ اصْبِرُوا عَلَى طَاعَةِ اللَّهِ وَ تَصَبَّرُوا عَنْ مَعْصِيَةِ اللَّهِ فَإِنَّمَا الدُّنْيَا سَاعَةٌ فَمَا مَضَى فَلَيْسَ تَجِدُ لَهُ سُرُوراً وَ لَا حُزْناً وَ مَا لَمْ يَأْتِ فَلَيْسَ تَعْرِفُهُ فَاصْبِرْ عَلَى تِلْكَ السَّاعَةِ الَّتِي أَنْتَ فِيهَا فَكَأَنَّكَ قَدِ اغْتَبَطْتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from Sama’at, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘Be patient upon the obedience of Allah<sup>azwj</sup> and observe patience from the disobedience of Allah<sup>azwj</sup>, for rather, the world is for a moment. So what is past, you will neither find joy for it nor a grief, and what has not come yet, so you do not recognise it. Therefore, be patient upon that time which you are in (now), so it would be as if you have been backbit’."
          ],
          "en.sarwar": [
            "21. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ‘Uthman ibn ‘Isa from Sama’a from abu ‘Abd Allah (a.s.) who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘Exercise patience in the act of obedience to Allah and dictate yourselves with patience in the matters of disobeying Allah. The world is one hour. What is passed its joys and sadness do not renew. What has not yet arrived, you do not know it. Bear patience in the hour in which you live, your condition will be the one very much sought after.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/375)"
        ],
        "index": 3031,
        "local_index": 22,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:22",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ الْخَضِرُ لِمُوسَى ( عليه السلام ) يَا مُوسَى إِنَّ أَصْلَحَ يَوْمَيْكَ الَّذِي هُوَ أَمَامَكَ فَانْظُرْ أَيُّ يَوْمٍ هُوَ وَ أَعِدَّ لَهُ الْجَوَابَ فَإِنَّكَ مَوْقُوفٌ وَ مَسْئُولٌ وَ خُذْ مَوْعِظَتَكَ مِنَ الدَّهْرِ فَإِنَّ الدَّهْرَ طَوِيلٌ قَصِيرٌ فَاعْمَلْ كَأَنَّكَ تَرَى ثَوَابَ عَمَلِكَ لِيَكُونَ أَطْمَعَ لَكَ فِي الْآخِرَةِ فَإِنَّ مَا هُوَ آتٍ مِنَ الدُّنْيَا كَمَا هُوَ قَدْ وَلَّى مِنْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from a man, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Al-Khizr<sup>as</sup> said to Musa<sup>as</sup>: ‘O Musa<sup>as</sup>! Rectify the day which is in front of you<sup>as</sup>, so look which day it is and prepare the answer for it, for you<sup>as</sup> would be Paused and Questioned; and take your<sup>as</sup> advice from the time, for the long time is short, therefore work as if you<sup>as</sup> can see the Rewards for your deed so that you<sup>as</sup> in order for it to be a greed for you<sup>as</sup> regarding the Hereafter, for whatever comes from the word is like what has turned away from it’."
          ],
          "en.sarwar": [
            "22. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from a man from abu ‘Abd Allah (a.s.) who has said the following: “Al-Khidr said to Moses, peace be upon him, ‘O Moses, the best of your two days is the one before you. Consider which one it is. Then prepare the answer for it. You will be stopped for questioning. Learn your lessons from time. Time is long and also (in certain cases) short. Act as if you see the reward for your deeds so it may seem attractive due to its rewards. Anything that comes from the world is like going away from one.’” "
          ]
        }
      },
      {
        "index": 3032,
        "local_index": 23,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:203:23",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قِيلَ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) عِظْنَا وَ أَوْجِزْ فَقَالَ الدُّنْيَا حَلَالُهَا حِسَابٌ وَ حَرَامُهَا عِقَابٌ وَ أَنَّى لَكُمْ بِالرَّوْحِ وَ لَمَّا تَأَسَّوْا بِسُنَّةِ نَبِيِّكُمْ تَطْلُبُونَ مَا يُطْغِيكُمْ وَ لَا تَرْضَوْنَ مَا يَكْفِيكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Yaqoub Bin Yazeed, from the one who mentioned it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It was said to Amir Al-Momineen<sup>asws</sup>, ‘Advise us and be brief’. So he<sup>asws</sup> said: ‘The world, its Permissible would be accounted for, and its Prohibition would be Punished for, and I<sup>asws</sup> am cautioning you of the comfort, and for what are you not following the Sunnah of your Prophet<sup>saww</sup>, seeking what would make you transgress, and you are not being pleased with what is sufficing you?’."
          ],
          "en.sarwar": [
            "23. A number of our people have narrated from Sahl ibn Ziyad from Ya’qub ibn Yazid from those whom has mentioned (in his book) from abu ‘Abd Allah (a.s.) who has said the following: “It was said to Amir al-Mu’minin, Ali ibn abu Talib (a.s.) ‘Instinct us briefly with good advice.’ He then said, ‘For the lawful things of the world there is accountability and for the unlawful things of the world there is torment. How can you have comfort without following the traditions of your prophet? You seek what takes you to transgression and you do not agree with what is sufficient for you.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:203",
  "kind": "verse_list"
}