{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 208"
        },
        "path": "/books/al-kafi:2:1:208",
        "titles": {
          "ar": "بَابُ مَا رُفِعَ عَنِ الْأُمَّةِ",
          "en": "Chapter 208 – What the community is exepmted from"
        }
      }
    ],
    "index": 396,
    "local_index": 208,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 209"
        },
        "path": "/books/al-kafi:2:1:209",
        "titles": {
          "ar": "بَابُ أَنَّ الْإِيمَانَ لَا يَضُرُّ مَعَهُ سَيِّئَةٌ وَ الْكُفْرَ لَا يَنْفَعُ مَعَهُ حَسَنَةٌ",
          "en": "Chapter 209 – The Emān is such that along with it an evil deed will not harm, and the Kufr (disbelief) is such that along with it a good deed will not benefit"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 207"
        },
        "path": "/books/al-kafi:2:1:207",
        "titles": {
          "ar": "بَابُ الْمُعَافَيْنَ مِنَ الْبَلَاءِ",
          "en": "Chapter 207 – The ones Protected from the afflictions"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:208",
    "titles": {
      "ar": "بَابُ مَا رُفِعَ عَنِ الْأُمَّةِ",
      "en": "Chapter 208 – What the community is exepmted from"
    },
    "verse_count": 2,
    "verse_start_index": 3042,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/387)"
        ],
        "index": 3043,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:208:1",
        "refs": {
          "Mentions": [
            "/books/quran:2:286",
            "/books/quran:16:106"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَبِي دَاوُدَ الْمُسْتَرِقِّ قَالَ حَدَّثَنِي عَمْرُو بْنُ مَرْوَانَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) رُفِعَ عَنْ أُمَّتِي أَرْبَعُ خِصَالٍ خَطَأُهَا وَ نِسْيَانُهَا وَ مَا أُكْرِهُوا عَلَيْهِ وَ مَا لَمْ يُطِيقُوا وَ ذَلِكَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ رَبَّنا لا تُؤاخِذْنا إِنْ نَسِينا أَوْ أَخْطَأْنا رَبَّنا وَ لا تَحْمِلْ عَلَيْنا إِصْراً كَما حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنا رَبَّنا وَ لا تُحَمِّلْنا ما لا طاقَةَ لَنا بِهِ وَ قَوْلُهُ إِلَّا مَنْ أُكْرِهَ وَ قَلْبُهُ مُطْمَئِنٌّ بِالْإِيمانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Abu Dawood Al Mustariq who said, ‘Amro Bin Marwan narrated to me saying, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Rasool-Allah<sup>saww</sup> said: ‘Four characteristics have been Raised from my<sup>saww</sup> community (exempted from) – its mistakes, and its forgetfulness, and whatever is compelled upon one, and what one cannot endure, and these are the Words of Allah<sup>azwj</sup> Mighty and Majesic <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h286\">[2:286]</a> Our Lord! Do not Seize us if we forget or make a mistake; Our Lord! Do not lay on us a burden as You did Lay on those before us, Our Lord do not Impose upon us that which we have not the strength to bear</span>. And His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:16#h106\">[16:106]</a> except the one who is compelled while his heart is at rest on account of faith</span>’."
          ],
          "en.sarwar": [
            "1. Al-Husayn ibn Muhammad has narrated from Mu’alla ibn Muhammad from abu Dawud al-Mustriq who has that narrated to him ‘Amr ibn Marwan who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘The Messenger of Allah has said, “My followers are exempt from responsibility for four things: Acting mistakenly, forgetting, being coerced and compelled, and for failing to act. This has been mentioned in the words of Allah, the Most Majestic, the Most Holy, ‘Lord, do not hold us responsible for our forgetfulness and mistakes. Lord, do not lay upon us the burden that You laid upon those who lived before us. Lord, do not lay upon us what we cannot afford. Ignore and forgive our sins. Have mercy upon us. You are our Lord. Help us against the unbelievers,’ <a href=\"/#/books/quran:2#h286\">[2:286]</a> also in His words, ‘No one verbally denounces his faith in Allah, unless he is forced, but his heart is confident with his faith. . . <a href=\"/#/books/quran:16#h106\">[16:106]</a> "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/391)"
        ],
        "index": 3044,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:208:2",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ النَّهْدِيِّ رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وُضِعَ عَنْ أُمَّتِي تِسْعُ خِصَالٍ الْخَطَأُ وَ النِّسْيَانِ وَ مَا لَا يَعْلَمُونَ وَ مَا لَا يُطِيقُونَ وَ مَا اضْطُرُّوا إِلَيْهِ وَ مَا اسْتُكْرِهُوا عَلَيْهِ وَ الطِّيَرَةُ وَ الْوَسْوَسَةُ فِي التَّفَكُّرِ فِي الْخَلْقِ وَ الْحَسَدُ مَا لَمْ يُظْهِرْ بِلِسَانٍ أَوْ يَدٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Muhammad Bin Ahmad Al Nahdy, raising it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Nine characteristics have been Dropped from my<sup>saww</sup> community – the mistake, and the forgetfulness, and what they are not knowing, and what they are not enduring, and what they are desperate to, and what they are compelled upon, and the evil omen, and the uncertainty in the pondering in the creation, and the envy what is not made apparent either by the tongue or the hand’."
          ],
          "en.sarwar": [
            "2. Al-Husayn ibn has narrated from Ahmad ibn Muhammad al-Hindi in a marfu’ manner from abu ‘Abd Allah (a.s.) who has said the following: “The Messenger of Allah has said, ‘My followers are exempt from responsibilities in nine kinds of acts and conditions: 1. Acting by mistake, 2. Out of forgetfulness, 3. Things they have no knowledge of, 4. Things they are not able to do, 5. Things they needed badly, 6. Things they are compelled to do, 7. Omens, 8. Temptations in thinking about creatures, 9. Feeling envy as long as it is not expressed by their tongues or hands.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:208",
  "kind": "verse_list"
}