{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 21"
        },
        "path": "/books/al-kafi:2:1:21",
        "titles": {
          "ar": "بَابٌ آخَرُ مِنْهُ",
          "en": "Chapter 21 – Another chapter from it"
        }
      }
    ],
    "index": 209,
    "local_index": 21,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 22"
        },
        "path": "/books/al-kafi:2:1:22",
        "titles": {
          "ar": "بَابُ نِسْبَةِ الْإِسْلَامِ",
          "en": "Chapter 22 – Ascription of Al-Islām"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 20"
        },
        "path": "/books/al-kafi:2:1:20",
        "titles": {
          "ar": "بَابُ دَرَجَاتِ الْإِيمَانِ",
          "en": "Chapter 20 – Levels of the Emān"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:21",
    "titles": {
      "ar": "بَابٌ آخَرُ مِنْهُ",
      "en": "Chapter 21 – Another chapter from it"
    },
    "verse_count": 4,
    "verse_start_index": 1524,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (277/ 7)"
        ],
        "index": 1525,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:21:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َحْمَدُ بْنُ مُحَمَّدٍ</span> عَنِ الْحَسَنِ بْنِ مُوسَى عَنْ أَحْمَدَ بْنِ عُمَرَ عَنْ يَحْيَى بْنِ أَبَانٍ عَنْ شِهَابٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام )  يَقُولُ لَوْ عَلِمَ النَّاسُ كَيْفَ خَلَقَ اللَّهُ تَبَارَكَ وَ تَعَالَى هَذَا الْخَلْقَ لَمْ يَلُمْ أَحَدٌ أَحَداً فَقُلْتُ أَصْلَحَكَ اللَّهُ فَكَيْفَ ذَاكَ فَقَالَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى خَلَقَ أَجْزَاءً بَلَغَ بِهَا تِسْعَةً وَ أَرْبَعِينَ جُزْءاً ثُمَّ جَعَلَ الْأَجْزَاءَ أَعْشَاراً فَجَعَلَ الْجُزْءَ عَشْرَةَ أَعْشَارٍ ثُمَّ قَسَمَهُ بَيْنَ الْخَلْقِ ",
          "فَجَعَلَ فِي رَجُلٍ عُشْرَ جُزْءٍ وَ فِي آخَرَ عُشْرَيْ جُزْءٍ حَتَّى بَلَغَ بِهِ جُزْءاً تَامّاً وَ فِي آخَرَ جُزْءاً وَ عُشْرَ جُزْءٍ وَ آخَرَ جُزْءاً وَ عُشْرَيْ جُزْءٍ وَ آخَرَ جُزْءاً وَ ثَلَاثَةَ أَعْشَارِ جُزْءٍ حَتَّى بَلَغَ بِهِ جُزْءَيْنِ تَامَّيْنِ ثُمَّ بِحِسَابِ ذَلِكَ حَتَّى بَلَغَ بِأَرْفَعِهِمْ تِسْعَةً وَ أَرْبَعِينَ جُزْءاً ",
          "فَمَنْ لَمْ يَجْعَلْ فِيهِ إِلَّا عُشْرَ جُزْءٍ لَمْ يَقْدِرْ عَلَى أَنْ يَكُونَ مِثْلَ صَاحِبِ الْعُشْرَيْنِ وَ كَذَلِكَ صَاحِبُ الْعُشْرَيْنِ لَا يَكُونُ مِثْلَ صَاحِبِ الثَّلَاثَةِ الْأَعْشَارِ وَ كَذَلِكَ مَنْ تَمَّ لَهُ جُزْءٌ لَا يَقْدِرُ عَلَى أَنْ يَكُونَ مِثْلَ صَاحِبِ الْجُزْءَيْنِ وَ لَوْ عَلِمَ النَّاسُ أَنَّ اللَّهَ عَزَّ وَ جَلَّ خَلَقَ هَذَا الْخَلْقَ عَلَى هَذَا لَمْ يَلُمْ أَحَدٌ أَحَداً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Al Hassan Bin Musa, from Ahmad Bin Umar, from Yahya Bin Aban, from Shihab who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘If the people knew how Allah<sup>azwj</sup> Blessed and High Created this creation (people), no one would blame anyone’. So I said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! How was that?’ So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Blessed and High Created parts reaching forty-nine parts by it. Then He<sup>azwj</sup> Made the parts into tenths, thus making the ten tenths. Then He<sup>azwj</sup> Distributed it between the people.",
            "So He<sup style=\"font-weight: normal\">azwj</sup> Made to be in a man a tenth of a part, and in another, two-tenths of a part, until reaching by it, a complete part; and in another a part and a tenth of a part, and another a part and two-tenths of a part, and another a part and three-tenths of a part, until reaching by it, two parts complete. Then by the accounting of that, until reaching with the highest of them, forty nine parts. ",
            "So the one in whom there has not been Made to be except for a tenth of a part would not be able upon becoming like the owner of the two-tenths; and similarly the owner of the two-tenths cannot happen to be like the owner of the three-tenth; and similar to that, the one for whom a part is complete is not able upon becoming like the owner of the two parts. And if the people knew that Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic Created this creation (people) upon this, no one would blame any one’."
          ],
          "en.sarwar": [
            "1. Ahmad ibn Muhammad has narrated from al-Hassan ibn Musa from Ahmad ibn ‘Umar from Yahya ibn Aban from Shihab who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘Had the people known how Allah, the Most Blessed, the Most High, has created this creation no one would blame others.’ 1 then said, ‘May Allah grant you well being, how is that?’ The Imam said, ‘Allah, the Most Blessed, the Most High, created parts numbering ninety-four parts. He then made them into tenths; thus, He made one part into ten parts. He then distributed them among the creatures. In one man He placed one tenth, in another person He placed two tenths until there came a man in whom He place a whole part. In another He placed one part and one tenth, in another person one part and two tenths and in another one part and three tenths up to a man in whom He placed two whole parts and so on up to the highest one in whom He placed ninety-four whole parts. Therefore, one in whom only one tenth of a part is placed cannot be like the one in whom two tenths are placed. The one in whom two tenths of a part are placed cannot be like the one in whom three tenths are placed. So also the owner of one part cannot be like the owner of two whole parts. Had the people known that Allah, the Majestic, the Glorious, has created them in this way no one would have blamed the others.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/278)"
        ],
        "index": 1526,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:21:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ بَعْضِ أَصْحَابِهِ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي عُثْمَانَ عَنْ مُحَمَّدِ بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ حَمَّادٍ الْخَزَّازِ عَنْ عَبْدِ الْعَزِيزِ الْقَرَاطِيسِيِّ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام )  يَا عَبْدَ الْعَزِيزِ إِنَّ الْإِيمَانَ عَشْرُ دَرَجَاتٍ بِمَنْزِلَةِ السُّلَّمِ يُصْعَدُ مِنْهُ مِرْقَاةً بَعْدَ مِرْقَاةٍ فَلَا يَقُولَنَّ صَاحِبُ الِاثْنَيْنِ لِصَاحِبِ الْوَاحِدِ لَسْتَ عَلَى شَيْ‏ءٍ حَتَّى يَنْتَهِيَ إِلَى الْعَاشِرِ فَلَا تُسْقِطْ مَنْ هُوَ دُونَكَ فَيُسْقِطَكَ مَنْ هُوَ فَوْقَكَ وَ إِذَا رَأَيْتَ مَنْ هُوَ أَسْفَلُ مِنْكَ بِدَرَجَةٍ فَارْفَعْهُ إِلَيْكَ بِرِفْقٍ وَ لَا تَحْمِلَنَّ عَلَيْهِ مَا لَا يُطِيقُ فَتَكْسِرَهُ فَإِنَّ مَنْ كَسَرَ مُؤْمِناً فَعَلَيْهِ جَبْرُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from one of his companions, from Al Hassan Bin Ali Bin Abu Usman, from Muhamad Bin Usman, from Muhammad Bin Hammad Al Khazzaz, from Abdul Aziz Al Qarataysi who said, ",
            "‘Abu Abdullah<sup>asws</sup> said to me: ‘O Abdul Aziz! The <span class=\"iTxt\">Emān</span> is of ten levels at the status of the staircase. One would climb from it, a step after a step. So let not the one on the second step say to the one who is on the first, ‘You are not upon anything’, until he ends up at the tenth. So do not drop the one who is below you, so the one who is above you would drop (you). And when you see the one who is lower than you by a level, so raise him to you by kindness, but do not burden upon him what he cannot endure, so you would break him, for the one who breaks a <span class=\"iTxt\">Momin</span>, so upon him its consequences (blame)’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Muhammad ibn Ahmad from certain individuals of his people from al-Hassan from Ali ibn abu ‘Uthman from Muhammad ibn ‘Uthman from Muhammad ibn Hammad al-Khazzaz from ‘Abd al-‘Aziz al-Qaratisi who has said the following: “Once abu ‘Abd Allah (a.s.) said, ‘O ‘Abd al-‘Aziz, belief is of ten stages like the steps of a ladder. To climb, one uses it one step after the other one by one. One who possesses two degrees of belief should never say to one who possesses only one degree that he does not have enough belief and so on up to the tenth degree or stage. One who is higher should not throw back the one below because the one above you may also fall. If you see one below, you should help him climb up higher gently and do not burden him with what he cannot lift up; he may break down and if one breaks down a believer, he will be held responsible for compensation to him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (280/ 7)"
        ],
        "index": 1527,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:21:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ سَدِيرٍ قَالَ قَالَ لِي أَبُو جَعْفَرٍ ( عليه السلام ) إِنَّ الْمُؤْمِنِينَ عَلَى مَنَازِلَ مِنْهُمْ عَلَى وَاحِدَةٍ وَ مِنْهُمْ عَلَى اثْنَتَيْنِ وَ مِنْهُمْ عَلَى ثَلَاثٍ وَ مِنْهُمْ عَلَى أَرْبَعٍ وَ مِنْهُمْ عَلَى خَمْسٍ وَ مِنْهُمْ عَلَى سِتٍّ وَ مِنْهُمْ عَلَى سَبْعٍ",
          "فَلَوْ ذَهَبْتَ تَحْمِلُ عَلَى صَاحِبِ الْوَاحِدَةِ ثِنْتَيْنِ لَمْ يَقْوَ وَ عَلَى صَاحِبِ الثِّنْتَيْنِ ثَلَاثاً لَمْ يَقْوَ وَ عَلَى صَاحِبِ الثَّلَاثِ أَرْبَعاً لَمْ يَقْوَ وَ عَلَى صَاحِبِ الْأَرْبَعِ خَمْساً لَمْ يَقْوَ وَ عَلَى صَاحِبِ الْخَمْسِ سِتّاً لَمْ يَقْوَ وَ عَلَى صَاحِبِ السِّتِّ سَبْعاً لَمْ يَقْوَ وَ عَلَى هَذِهِ الدَّرَجَاتُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Sinan, from Ibn Muskan, from Sadeyr who said, ",
            "‘Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> said to me: ‘The <span class=\"iTxt\">Momin</span>s are upon levels. From them are ones upon one, and from them are ones upon two, and from them are ones upon three, and from them are ones upon four, and from them are ones upon five, and from them are ones upon six, and from them are one upon seven. ",
            "So if you were to go and burden two upon the owner of the one he would not be strong enough (for it), and (burden) three upon the owner of the two he would not be strong enough (for it), and (burden) four upon the owner of the three he would not be strong enough (for it), and (burden) five upon the owner of the four he would not be strong enough (for it), and (burden) six upon the owner of the five he would not be strong enough (for it), and (burden) seven upon the owner of the six he would not be strong enough (for it). These are the levels’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from ibn Muskan from Sadir who has said the following: “Abu Ja’far (a.s.) said to me, ’Believers are of various positions in connection with belief. There are those who have one degree of belief, others have two degrees, still others may have three or four, five, six or seven degrees of belief. If you expect two degrees of belief from one who has only one degree of belief he is not able to bear it, or expect three degrees of belief from the one who has only two degrees of it he also is not able to bear it. The one who may have three cannot bear four degrees of belief, the one who has four degrees of belief is not able to bear five degrees of belief. One who has only five degrees of belief is not able to bear six degrees of belief and one who has six degrees of belief is not able to bear seven degrees of belief. This is how the degrees of belief are.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/281)"
        ],
        "index": 1528,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:21:4",
        "text": [
          "عَنْهُ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الصَّبَّاحِ بْنِ سَيَابَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا أَنْتُمْ وَ الْبَرَاءَةَ يَبْرَأُ بَعْضُكُمْ مِنْ بَعْضٍ إِنَّ الْمُؤْمِنِينَ بَعْضُهُمْ أَفْضَلُ مِنْ بَعْضٍ وَ بَعْضُهُمْ أَكْثَرُ صَلَاةً مِنْ بَعْضٍ وَ بَعْضُهُمْ أَنْفَذُ بَصَراً مِنْ بَعْضٍ وَ هِيَ الدَّرَجَاتُ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ali Bin Al Hakam, from Muhammad Bin Sinan, from Al Sabbah Bin Sayaba, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘What are you and the disavowing (<span class=\"iTxt\">Tabarra</span>)? Some of you are disavowing (<span class=\"iTxt\">Tabarra</span>) from the others. The <span class=\"iTxt\">Momin</span>s, some of them are superior to some, and some of them are more frequent of the <span class=\"iTxt\">Salāt</span> than some, and some of them are of more accomplished insight than some, and these are the levels’."
          ],
          "en.sarwar": [
            "4. It is narrated from him (Muhammad ibn Yahya) from Ali ibn al-Hakam from Muhammad ibn Sinan from al-Sabah ibn Siyabah from abu ‘Abd Allah (a.s.) who has said the following: “What is this disavowing and disassociation of yours? There are those of you who renounce the others. Among the believers there are those who are better than others. Among them there are those who pray more, and others are of shaip insight. Such are the degrees of belief.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:21",
  "kind": "verse_list"
}