{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 22"
        },
        "path": "/books/al-kafi:2:1:22",
        "titles": {
          "ar": "بَابُ نِسْبَةِ الْإِسْلَامِ",
          "en": "Chapter 22 – Ascription of Al-Islām"
        }
      }
    ],
    "index": 210,
    "local_index": 22,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 23"
        },
        "path": "/books/al-kafi:2:1:23",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ خِصَالِ الْمُؤْمِنِ</span>",
          "en": "Chapter 23 – Characteristics of the ‘Momin’ (Believer)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 21"
        },
        "path": "/books/al-kafi:2:1:21",
        "titles": {
          "ar": "بَابٌ آخَرُ مِنْهُ",
          "en": "Chapter 21 – Another chapter from it"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:22",
    "titles": {
      "ar": "بَابُ نِسْبَةِ الْإِسْلَامِ",
      "en": "Chapter 22 – Ascription of Al-Islām"
    },
    "verse_count": 3,
    "verse_start_index": 1528,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/282)"
        ],
        "index": 1529,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/18",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ بَعْضِ أَصْحَابِنَا رَفَعَهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:22:1",
        "text": [
          " قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) لَأَنْسُبَنَّ الْإِسْلَامَ نِسْبَةً لَا يَنْسُبُهُ أَحَدٌ قَبْلِي وَ لَا يَنْسُبُهُ أَحَدٌ بَعْدِي إِلَّا بِمِثْلِ ذَلِكَ إِنَّ الْإِسْلَامَ هُوَ التَّسْلِيمُ وَ التَّسْلِيمَ هُوَ الْيَقِينُ وَ الْيَقِينَ هُوَ التَّصْدِيقُ وَ التَّصْدِيقَ هُوَ الْإِقْرَارُ وَ الْإِقْرَارَ هُوَ الْعَمَلُ وَ الْعَمَلَ هُوَ الْأَدَاءُ ",
          "إِنَّ الْمُؤْمِنَ لَمْ يَأْخُذْ دِينَهُ عَنْ رَأْيِهِ وَ لَكِنْ أَتَاهُ مِنْ رَبِّهِ فَأَخَذَهُ إِنَّ الْمُؤْمِنَ يُرَى يَقِينُهُ فِي عَمَلِهِ وَ الْكَافِرَ يُرَى إِنْكَارُهُ فِي عَمَلِهِ فَوَ الَّذِي نَفْسِي بِيَدِهِ مَا عَرَفُوا أَمْرَهُمْ فَاعْتَبِرُوا إِنْكَارَ الْكَافِرِينَ وَ الْمُنَافِقِينَ بِأَعْمَالِهِمُ الْخَبِيثَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from one of our companions, raising it, said, ",
            "‘Amir Al-<span class=\"iTxt\">Momin</span>een<sup style=\"font-weight: normal\">asws</sup> said: ‘I<sup style=\"font-weight: normal\">asws</sup> shall ascribe (describe) Al-<span class=\"iTxt\">Islām</span> with such an ascription, none has ascribed it as such before me<sup style=\"font-weight: normal\">asws</sup> and no one would be ascribing it after me<sup style=\"font-weight: normal\">asws</sup> (but only) with the likes of that (copying it from me<sup style=\"font-weight: normal\">asws</sup>). Al-<span class=\"iTxt\">Islām</span>, it is the submission, and the submission, it is the conviction, and the conviction, it is the ratification, and the ratification, it is the acknowledgement, and the acknowledgement, it is the deed, and the deed, it is the performance (of it). ",
            "A <span class=\"iTxt\">Momin (Believer)</span> would not take his Religion from his own opinions, but it would be Given to him from his Lord<sup style=\"font-weight: normal\">azwj</sup>, so he would take it. A <span class=\"iTxt\">Momin</span>, his conviction can be seen in his deeds, and the dis<span class=\"iTxt\">Momin</span>, his denial would be seen in his deeds. So, by the One<sup style=\"font-weight: normal\">azwj</sup> in Whose Hand is my<sup style=\"font-weight: normal\">asws</sup> soul, they will not recognise their matter. Therefore, learn a lesson from the denial of the dis<span class=\"iTxt\">Momin</span> and the hypocrites in their bad deeds’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from certain individuals of our people in a marfu’ manner from Amir al- Mu’minin (Ali ibn abu Talib) who has said the following: “I will describe Islam in a way that no one could have done before or would do after me except just as my description: ‘Islam is submission and submission is certainty. Certainty is affirmation (and confirmation). Affirmation is professing. Professing is action. Action and deeds are completion and remittance. A believer does not take his religion from his own personal opinion. It comes from his Lord and he accepts it. A believer finds his certainty in his deeds. An unbeliever finds his rejection in his deeds. I swear by the One in whose hands is my soul, they did not recognize their goal. Take a lesson from the case of the filthy deeds of the unbelievers and the hypocrites.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف بسندي ه  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (288/ 7)"
        ],
        "index": 1530,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/617",
              "text": "عَبْدِ اللَّهِ بْنِ الْقَاسِمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1451",
              "text": "مُدْرِكِ بْنِ عَبْدِ الرَّحْمَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَنْهُ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ مُدْرِكِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:22:2",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْإِسْلَامُ عُرْيَانٌ فَلِبَاسُهُ الْحَيَاءُ وَ زِينَتُهُ الْوَقَارُ وَ مُرُوءَتُهُ الْعَمَلُ الصَّالِحُ وَ عِمَادُهُ الْوَرَعُ وَ لِكُلِّ شَيْ‏ءٍ أَسَاسٌ وَ أَسَاسُ الْإِسْلَامِ حُبُّنَا أَهْلَ الْبَيْتِ .",
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ مَعْبَدٍ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ مُدْرِكِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from his father, from Abdullah Bin Al Qasim, from Mudrik Bin Abdul Rahman, ",
            "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> having said: ‘Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> said: ‘Al-<span class=\"iTxt\">Islām</span> is bare, so clothe it with the bashfulness, and adorn it with the dignity, and its personality is the righteous deed, and its pillar is the piety, and for every thing is a foundation, and the foundation of Al-<span class=\"iTxt\">Islām</span> is love for us<sup style=\"font-weight: normal\">asws</sup> the People<sup style=\"font-weight: normal\">asws</sup> of the Household’. ",
            "Ali Bin Ibrahim, from his father, from Ali Bin Ma’bad, from Abdullah Bin Al Qasim, from Mudrik Bin Abdul Rahman, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> – similar to it."
          ],
          "en.sarwar": [
            "2. It is narrated from him from his father from ‘Abd Allah ibn al-Qasim from Mudrik ibn ‘Abd al-Rahman from abu ‘Abd Allah (a.s.) who has said the following: “The Messenger of Allah has said, ‘Islam is bare. Its dress is bashfulness, dignity is its ornament, virtuous deeds are its kindness and strict following of law is its support. Everything has a foundation. The foundation of Islam is loving us, Ahl al- Bayt .’” Ali ibn Ibrahim has narrated from his father from Ali ibn Ma’bad from ‘Abd Allah ibn al-Qasim from Murik ibn ‘Abd al-Rahman from abu ‘Abd Allah, recipient of divine supreme covenant: a similar Hadith. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح بل صحيح عندي  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (289/ 7)"
        ],
        "index": 1531,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/425",
              "text": "عَبْدِ الْعَظِيمِ بْنِ عَبْدِ اللَّهِ الْحَسَنِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/731",
              "text": "أَبِي جَعْفَرٍ الثَّانِي ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1452",
              "text": "جَدِّهِ صَلَوَاتُ اللَّهِ عَلَيْهِمْ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَبْدِ الْعَظِيمِ بْنِ عَبْدِ اللَّهِ الْحَسَنِيِّ عَنْ أَبِي جَعْفَرٍ الثَّانِي ( عليه السلام ) عَنْ أَبِيهِ عَنْ جَدِّهِ صَلَوَاتُ اللَّهِ عَلَيْهِمْ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:22:3",
        "text": [
          " قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ اللَّهَ خَلَقَ الْإِسْلَامَ فَجَعَلَ لَهُ عَرْصَةً وَ جَعَلَ لَهُ نُوراً وَ جَعَلَ لَهُ حِصْناً وَ جَعَلَ لَهُ نَاصِراً",
          "فَأَمَّا عَرْصَتُهُ فَالْقُرْآنُ وَ أَمَّا نُورُهُ فَالْحِكْمَةُ وَ أَمَّا حِصْنُهُ فَالْمَعْرُوفُ وَ أَمَّا أَنْصَارُهُ فَأَنَا وَ أَهْلُ بَيْتِي وَ شِيعَتُنَا فَأَحِبُّوا أَهْلَ بَيْتِي وَ شِيعَتَهُمْ وَ أَنْصَارَهُمْ فَإِنَّهُ لَمَّا أُسْرِيَ بِي إِلَى السَّمَاءِ الدُّنْيَا فَنَسَبَنِي جَبْرَئِيلُ ( عليه السلام ) لِأَهْلِ السَّمَاءِ اسْتَوْدَعَ اللَّهُ حُبِّي وَ حُبَّ أَهْلِ بَيْتِي وَ شِيعَتِهِمْ فِي قُلُوبِ الْمَلَائِكَةِ فَهُوَ عِنْدَهُمْ وَدِيعَةٌ إِلَى يَوْمِ الْقِيَامَةِ ",
          "ثُمَّ هَبَطَ بِي إِلَى أَهْلِ الْأَرْضِ فَنَسَبَنِي إِلَى أَهْلِ الْأَرْضِ فَاسْتَوْدَعَ اللَّهُ عَزَّ وَ جَلَّ حُبِّي وَ حُبَّ أَهْلِ بَيْتِي وَ شِيعَتِهِمْ فِي قُلُوبِ مُؤْمِنِي أُمَّتِي فَمُؤْمِنُو أُمَّتِي يَحْفَظُونَ وَدِيعَتِي فِي أَهْلِ بَيْتِي إِلَى يَوْمِ الْقِيَامَةِ ",
          "أَلَا فَلَوْ أَنَّ الرَّجُلَ مِنْ أُمَّتِي عَبَدَ اللَّهَ عَزَّ وَ جَلَّ عُمُرَهُ أَيَّامَ الدُّنْيَا ثُمَّ لَقِيَ اللَّهَ عَزَّ وَ جَلَّ مُبْغِضاً لِأَهْلِ بَيْتِي وَ شِيعَتِي مَا فَرَّجَ اللَّهُ صَدْرَهُ إِلَّا عَنِ النِّفَاقِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Abdul Azeem Bin Abdullah Al Hasany, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup>, from his<sup>asws</sup> father<sup>asws</sup>, from his<sup>asws</sup> grandfather<sup>asws</sup> having said: ‘Amir Al-<span class=\"iTxt\">Momin</span>een<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘Allah<sup>azwj</sup> Created Al-<span class=\"iTxt\">Islām</span>. So He<sup>azwj</sup> Made a land for it, and a light, and Made a fort for it, and Made a helper for it. ",
            "So, as for its land, so it is the Quran, and as for its ‘نُورُهُ’ Light, so it is the Wisdom, and as for its fort, so it is the goodness, and as for its helpers, so it is I<sup style=\"font-weight: normal\">saww</sup>, and the People<sup style=\"font-weight: normal\">asws</sup> of my<sup style=\"font-weight: normal\">saww</sup> Household, and our<sup style=\"font-weight: normal\">asws</sup> Shia. Therefore, love the People<sup style=\"font-weight: normal\">asws</sup> of my<sup style=\"font-weight: normal\">saww</sup> Household and their<sup style=\"font-weight: normal\">asws</sup> Shia and their helpers, for what I<sup style=\"font-weight: normal\">saww</sup> was ascended with to the sky of the world, Jibraeel<sup style=\"font-weight: normal\">as</sup> introduced me<sup style=\"font-weight: normal\">saww</sup> to the inhabitants of the sky. Allah<sup style=\"font-weight: normal\">azwj</sup> Entrusted love for me<sup style=\"font-weight: normal\">saww</sup>, and love for the People<sup style=\"font-weight: normal\">asws</sup> of my<sup style=\"font-weight: normal\">saww</sup> Household and their Shia into the hearts of the Angels. So it is a deposit with them up to the Day of Judgement. ",
            "Then I<sup style=\"font-weight: normal\">saww</sup> was descended with to the inhabitants of the earth. So he<sup style=\"font-weight: normal\">as</sup> introduced me<sup style=\"font-weight: normal\">saww</sup> to the people of the earth, and Allah<sup style=\"font-weight: normal\">azwj</sup> Entrusted the love for me<sup style=\"font-weight: normal\">saww</sup>, and the love for the People<sup style=\"font-weight: normal\">asws</sup> of my<sup style=\"font-weight: normal\">saww</sup> Household and their<sup style=\"font-weight: normal\">asws</sup> Shia into the hearts of the <span class=\"iTxt\">Momin</span>s of my<sup style=\"font-weight: normal\">saww</sup> community. Thus, the <span class=\"iTxt\">Momin</span>s of my<sup style=\"font-weight: normal\">saww</sup> community would be preserving my<sup style=\"font-weight: normal\">saww</sup> entrustment and that of the People<sup style=\"font-weight: normal\">asws</sup> of my<sup style=\"font-weight: normal\">saww</sup> Household up to the Day of Judgement.",
            "Indeed! If a man from my<sup style=\"font-weight: normal\">saww</sup> community were to worship Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic for his lifetime of the days of the world, then meets Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic as hateful towards the People<sup style=\"font-weight: normal\">asws</sup> of my<sup style=\"font-weight: normal\">saww</sup> Household and my<sup style=\"font-weight: normal\">saww</sup> Shia, Allah<sup style=\"font-weight: normal\">azwj</sup> will not Open his chest for anything except for the hypocrisy’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad from ‘Abd al-‘Azim from ‘Abd Allah al-Hassani from Abu Ja’far al-Thani (a.s.) from his father from his grandfather (a.s.) who has said the following: “Amir al-Mu’minin (Ali ibn abu Talib) (a.s.) has said that the Messenger of Allah said, ‘Allah created Islam and made for it a backyard and front-yard, a light, a fortress and supporter. Its backyard and front-yard are the Holy Quran. Wisdom is its light. Lawfulness is its fortress. My Ahl al-Bayt (my family), our Shi’a (followers) and I are its supporters. You must love my Ahl al-Bayt (members of my family), their followers (Shi’a) and their supporters. When I was taken to heaven above the earth, Gibril introduced me to its inhabitants. Allah entrusted the love for me, my Ahl al-Bayt and their followers (Shi’a) to the hearts of the angels. It is with them in trust until the Day of Judgment. Then I was brought to earth and he introduced me to the inhabitants of earth. Allah entrusted the love for me, my Ahl al-Bayt and their followers (Shi’a) to the hearts of the believers of my people. They will keep my trust and the trust of my Ahl al-Bayt until the Day of Judgment. One must know that if a man of my people would worship Allah, the Most Majestic, the Most Holy, all the time of his life and then would meet Allah, the Most Majestic, the Most Holy, while hating my Ahl al-Bayt and my followers (Shi’a) Allah will not open his chest for anything but in hypocrisy.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:22",
  "kind": "verse_list"
}