{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 23"
        },
        "path": "/books/al-kafi:2:1:23",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ خِصَالِ الْمُؤْمِنِ</span>",
          "en": "Chapter 23 – Characteristics of the ‘Momin’ (Believer)"
        }
      }
    ],
    "index": 211,
    "local_index": 23,
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:23",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ خِصَالِ الْمُؤْمِنِ</span>",
      "en": "Chapter 23 – Characteristics of the ‘Momin’ (Believer)"
    },
    "verse_count": 4,
    "verse_start_index": 1531,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/291)"
        ],
        "index": 1532,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:23:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ عَبْدِ الْمَلِكِ بْنِ غَالِبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ يَنْبَغِي لِلْمُؤْمِنِ أَنْ يَكُونَ فِيهِ ثَمَانِي خِصَالٍ وَقُوراً عِنْدَ الْهَزَاهِزِ صَبُوراً عِنْدَ الْبَلَاءِ شَكُوراً عِنْدَ الرَّخَاءِ قَانِعاً بِمَا رَزَقَهُ اللَّهُ لَا يَظْلِمُ الْأَعْدَاءَ وَ لَا يَتَحَامَلُ لِلْأَصْدِقَاءِ بَدَنُهُ مِنْهُ فِي تَعَبٍ وَ النَّاسُ مِنْهُ فِي رَاحَةٍ ",
          "إِنَّ الْعِلْمَ خَلِيلُ الْمُؤْمِنِ وَ الْحِلْمَ وَزِيرُهُ وَ الْعَقْلَ أَمِيرُ جُنُودِهِ وَ الرِّفْقَ أَخُوهُ وَ الْبِرَّ وَالِدُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Mahboub, from jameel Bin Salih, from Abdul Malik Bin Ghalib, ",
            "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> having said: ‘It is befitting for the <span class=\"iTxt\">Momin (Believer)</span> that there happen to be eight characteristics in him – dignity during distubances, patience during the afflictions, gratefulness during the prosperity, contentment with what Allah<sup style=\"font-weight: normal\">azwj</sup> has Graced him, not being unjust to the enemies, not being a burden to his friends, his body should be tired from it (the hard work) but the people would be at rest from him.",
            "The knowledge is a friend of the <span class=\"iTxt\">Momin</span>, and the forbearance is his Vizier, and the intellect is the commander of his army, and the kindness is his brother, and the righteousness is his father’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Mahbub from Jamil ibn Salih from ‘Abd al-Malik ibn Ghalib from abu ‘Abd Allah (a.s.) who has said the following: “A believer should have eight qualities. He is dignified in turbulent times. He is patient in afflicting conditions. He is thankful in prosperous life. He is content with what Allah has granted him. He does not do injustice to the enemies. He does not overburden friends. His own body is tired due to his efforts and people are comfortable with him. Knowledge is a friend of the believer, forbearance is his secretary, reason is the commander-in-chief of his army, kindness is his brother and virtuous deed is his father.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/293)"
        ],
        "index": 1533,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:23:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ ( عليهما السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ صَلَوَاتُ اللَّهِ عَلَيْهِ الْإِيمَانُ لَهُ أَرْكَانٌ أَرْبَعَةٌ التَّوَكُّلُ عَلَى اللَّهِ وَ تَفْوِيضُ الْأَمْرِ إِلَى اللَّهِ وَ الرِّضَا بِقَضَاءِ اللَّهِ وَ التَّسْلِيمُ لِأَمْرِ اللَّهِ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup>, from his<sup style=\"font-weight: normal\">asws</sup> father<sup style=\"font-weight: normal\">asws</sup> having said: ‘Amir Al-<span class=\"iTxt\">Momin</span>een<sup style=\"font-weight: normal\">asws</sup> said: ‘The <span class=\"iTxt\">Emān</span> has four pillars for it – the reliance upon Allah<sup style=\"font-weight: normal\">azwj</sup>, and delegating the matter to Allah<sup style=\"font-weight: normal\">azwj</sup>, and the pleasure with the Judgement of Allah<sup style=\"font-weight: normal\">azwj</sup>, and the submission to the Command of Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from al-Nawfali form al-Sakuni from abu ‘Abd Allah from his father (a.s.) who has said the following: “Amir al-Mu’minin (Ali ibn abu Talib) (a.s.) has said, ‘Belief has four corner (stones): They are trust in Allah, having Allah as the person in charge of one’s affairs, to agree with the decision of Allah and to submit to the command of Allah, the Most Majestic, the Most Holy.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (294/ 7)"
        ],
        "index": 1534,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:23:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَمَّنْ ذَكَرَهُ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَبِيهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّكُمْ لَا تَكُونُونَ صَالِحِينَ حَتَّى تَعْرِفُوا وَ لَا تَعْرِفُونَ حَتَّى تُصَدِّقُوا وَ لَا تُصَدِّقُونَ حَتَّى تُسَلِّمُوا أَبْوَاباً أَرْبَعَةً لَا يَصْلُحُ أَوَّلُهَا إِلَّا بِآخِرِهَا ضَلَّ أَصْحَابُ الثَّلَاثَةِ وَ تَاهُوا تَيْهاً بَعِيداً",
          "إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى لَا يَقْبَلُ إِلَّا الْعَمَلَ الصَّالِحَ وَ لَا يَتَقَبَّلُ اللَّهُ إِلَّا بِالْوَفَاءِ بِالشُّرُوطِ وَ الْعُهُودِ وَ مَنْ وَفَى اللَّهَ بِشُرُوطِهِ وَ اسْتَكْمَلَ مَا وَصَفَ فِي عَهْدِهِ نَالَ مَا عِنْدَهُ وَ اسْتَكْمَلَ وَعْدَهُ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَخْبَرَ الْعِبَادَ بِطَرِيقِ الْهُدَى وَ شَرَعَ لَهُمْ فِيهَا الْمَنَارَ وَ أَخْبَرَهُمْ كَيْفَ يَسْلُكُونَ فَقَالَ وَ إِنِّي لَغَفَّارٌ لِمَنْ تابَ وَ آمَنَ وَ عَمِلَ صالِحاً ثُمَّ اهْتَدى",
          "وَ قَالَ إِنَّما يَتَقَبَّلُ اللَّهُ مِنَ الْمُتَّقِينَ فَمَنِ اتَّقَى اللَّهَ عَزَّ وَ جَلَّ فِيمَا أَمَرَهُ لَقِيَ اللَّهَ عَزَّ وَ جَلَّ مُؤْمِناً بِمَا جَاءَ بِهِ مُحَمَّدٌ ( صلى الله عليه وآله ) هَيْهَاتَ هَيْهَاتَ فَاتَ قَوْمٌ وَ مَاتُوا قَبْلَ أَنْ يَهْتَدُوا وَ ظَنُّوا أَنَّهُمْ آمَنُوا وَ أَشْرَكُوا مِنْ حَيْثُ لَا يَعْلَمُونَ إِنَّهُ مَنْ أَتَى الْبُيُوتَ مِنْ أَبْوَابِهَا اهْتَدَى وَ مَنْ أَخَذَ فِي غَيْرِهَا سَلَكَ طَرِيقَ الرَّدَى",
          "وَصَلَ اللَّهُ طَاعَةَ وَلِيِّ أَمْرِهِ بِطَاعَةِ رَسُولِهِ ( صلى الله عليه وآله ) وَ طَاعَةَ رَسُولِهِ بِطَاعَتِهِ فَمَنْ تَرَكَ طَاعَةَ وُلَاةِ الْأَمْرِ لَمْ يُطِعِ اللَّهَ وَ لَا رَسُولَهُ وَ هُوَ الْإِقْرَارُ بِمَا نَزَلَ مِنْ عِنْدِ اللَّهِ خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ وَ الْتَمِسُوا الْبُيُوتَ الَّتِي أَذِنَ اللَّهُ أَنْ تُرْفَعَ وَ يُذْكَرَ فِيهَا اسْمُهُ",
          "فَإِنَّهُ قَدْ خَبَّرَكُمْ أَنَّهُمْ رِجَالٌ لَا تُلْهِيهِمْ تِجَارَةٌ وَ لَا بَيْعٌ عَنْ ذِكْرِ اللَّهِ عَزَّ وَ جَلَّ وَ إِقَامِ الصَّلَاةِ وَ إِيتَاءِ الزَّكَاةِ يَخَافُونَ يَوْماً تَتَقَلَّبُ فِيهِ الْقُلُوبُ وَ الْأَبْصَارُ إِنَّ اللَّهَ قَدِ اسْتَخْلَصَ الرُّسُلَ لِأَمْرِهِ ثُمَّ اسْتَخْلَصَهُمْ مُصَدِّقِينَ لِذَلِكَ فِي نُذُرِهِ ",
          "فَقَالَ وَ إِنْ مِنْ أُمَّةٍ إِلَّا خَلا فِيها نَذِيرٌ تَاهَ مَنْ جَهِلَ وَ اهْتَدَى مَنْ أَبْصَرَ وَ عَقَلَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ فَإِنَّها لا تَعْمَى الْأَبْصارُ وَ لكِنْ تَعْمَى الْقُلُوبُ الَّتِي فِي الصُّدُورِ وَ كَيْفَ يَهْتَدِي مَنْ لَمْ يُبْصِرْ وَ كَيْفَ يُبْصِرُ مَنْ لَمْ يُنْذَرْ ",
          "اتَّبِعُوا رَسُولَ اللَّهِ ( صلى الله عليه وآله ) وَ أَقِرُّوا بِمَا نَزَلَ مِنْ عِنْدِ اللَّهِ وَ اتَّبِعُوا آثَارَ الْهُدَى فَإِنَّهُمْ عَلَامَاتُ الْأَمَانَةِ وَ التُّقَى وَ اعْلَمُوا أَنَّهُ لَوْ أَنْكَرَ رَجُلٌ عِيسَى ابْنَ مَرْيَمَ ( عليه السلام ) وَ أَقَرَّ بِمَنْ سِوَاهُ مِنَ الرُّسُلِ لَمْ يُؤْمِنْ اقْتَصُّوا الطَّرِيقَ بِالْتِمَاسِ الْمَنَارِ وَ الْتَمِسُوا مِنْ وَرَاءِ الْحُجُبِ الْآثَارَ تَسْتَكْمِلُوا أَمْرَ دِينِكُمْ وَ تُؤْمِنُوا بِاللَّهِ رَبِّكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from the one who mentioned it, from Muhammad Bin Abdul Rahman Bin Abu Layli, from his father, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘You will never happen to be righteous until you recognise, and you will not be recognising until you ratify, and you will not be ratifying until you submit to the four doors, its first one not being correct except by its last one. Strayed, are the companions of the three and they have wandered with a far wandering. ",
            "Allah<sup>azwj</sup> Blessed and High does not Accept except for the righteous deed, nor does Allah<sup>azwj</sup> Accept except with the loyalty with the stipulations and the Covenants. And the one who is loyal to Allah<sup>azwj</sup> with His<sup>azwj</sup> Stipulations and completes what is described in his Covenant, would attain what is in His<sup>azwj</sup> Presence, and He<sup>azwj</sup> would Complete His<sup>azwj</sup> Promise. Allah<sup>azwj</sup> Mighty and Majestic Informed the servants with the way of the Guidance and Explained to them that there are minarets therein, and Informed them how they should be travelling, so He<sup>azwj</sup> Said <span class=\"ibTxt\">[20:82] And I am Forgiving to him who repents and believes and does righteous deeds, then follows the right Guidance</span>. ",
            "And He<sup>azwj</sup> Said <span class=\"ibTxt\">[5:27] But rather, Allah only Accepts from those who are pious</span>. So the one who fears Allah<sup>azwj</sup> Mighty and Majestic would meet Allah<sup>azwj</sup> Mighty and Majestic as a <span class=\"iTxt\">Momin</span> in whatever Muhammad<sup>saww</sup> came with. Far be it! Far be it! Lost are the people and they died before they were guided and they thought that they were believing, and instead they associated (committed Shirk) from (an aspect) where they were not knowing. The one who comes to the houses from its doors would be guided, and the one who takes (a way) of the others would travel upon a road of annihilation. ",
            "Allah<sup>azwj</sup> Linked the obedience to the Guardian<sup>asws</sup> of His<sup>azwj</sup> Command with the obedience to His<sup>azwj</sup> Rasool, and the obedience to His<sup>azwj</sup> Rasool<sup>saww</sup> with obedience to Him<sup>azwj</sup>. So the one who neglects the obedience to the Masters<sup>asws</sup> of the Command, would neither be obeying Allah<sup>azwj</sup> nor His<sup>azwj</sup> Rasool<sup>saww</sup>, and it is the acknowledgement with whatever was Revealed from the Presence of Allah<sup>azwj</sup>. <span class=\"ibTxt\">[7:31] Take to your adornments at every Masjid</span> and seek the <span class=\"ibTxt\">[24:36] houses which Allah has Allowed to be Exalted and that His Name may be Mentioned in them</span>. ",
            "So He<sup style=\"font-weight: normal\">azwj</sup> has Informed you that these are <span class=\"ibTxt\">[24:37] Men whom neither merchandise nor selling diverts from the Remembrance of Allah and the keeping up of Salāt and the giving of Zakat; they fear a Day in which the hearts and eyes shall be overturned</span>. Allah<sup style=\"font-weight: normal\">azwj</sup> had Selected the Rasools<sup style=\"font-weight: normal\">as</sup> for His<sup style=\"font-weight: normal\">azwj</sup> Comman. Then He<sup style=\"font-weight: normal\">azwj</sup> Selected them<sup style=\"font-weight: normal\">as</sup> as ratifier to that regarding the warning. ",
            "So He<sup style=\"font-weight: normal\">azwj</sup> Said <span class=\"ibTxt\">[35:24] and there is not a community but a warner has gone among them</span>. The one who ignorant (of this), strayed, and the one who had insight and intellect was Guided. Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\">[22:46] For surely it is not the eyes that are blind, but blind are the hearts which are in the chests</span>.  And how can he be Guided, the one who does not see, and how can he see, the one who was not warned. ",
            "Follow Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> and acknowledge with what was Revealed from the Presence of Allah<sup style=\"font-weight: normal\">azwj</sup> and follow the the effects of the Guidance for these are signs of the entrustments and the piety. And know! If a man were to deny Isa<sup style=\"font-weight: normal\">as</sup> Bin Maryam<sup style=\"font-weight: normal\">as</sup> and acknowledge with the ones besides him<sup style=\"font-weight: normal\">as</sup> from the Rasools<sup style=\"font-weight: normal\">as</sup>, would not have believed. Shorten the way by seeking the Minarets, and seek from behind the veils, the effect which would perfect the matter of your Religion, and believe in Allah<sup style=\"font-weight: normal\">azwj</sup>, your Lord<sup style=\"font-weight: normal\">azwj</sup>’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father from those whom he has mentioned from Muhammad ibn ‘Abd al-Rahman ibn abu Layla from his father from abu ‘Abd Allah (a.s.) who has said the following: “You will not become virtuous until you learn, you will not learn until you affirm and you will not affirm until you accept four Chapters, the first of which will be of no benefit without the last one. People of three Chapters have strayed far away. Allah, the Most Blessed, the Most High, does not accept anything but virtuous deeds and Allah does not accept (anything) without loyalty in keeping up with one’s stipulations and covenants. Whoever fulfils his stipulations toward Allah and completes whatever is in one’s covenant, he will find (the reward that is) with Him and He will fulfill His promise. Allah, the Most Majestic, the Most Holy, has informed the people of the ways of guidance and has established for it the lighthouse. He has informed them how to behave, saying, ‘I am All-forgiving to the righteously striving believers who repent and follow the right guidance.’ (20:82) Allah has also said, ‘Allah accepts only the offerings of the pious ones.’ (5:27) “Whoever maintains piety before Allah, the Most Majestic, the Most Holy, in the matter of His commands he will come in the presence of Allah, the Most Majestic, the Most Holy, as a believer in whatever Muhammad (a.s.) has brought from Him. How remote, far away and lost are the people who have died before achieving guidance, and had thought that they were believers. They had considered things as partners of Allah without knowing what they had done. Whoever comes to a house through its door finds proper guidance, and whoever looks for a way other than the door has chosen a condemned path. Allah has joined obedience to His Messenger with obedience to those who possess Divine Authority and the obedience to His Messenger with obedience to His own commands. Therefore, whoever does not obey the people who possess Divine Authority, they have not obeyed Allah and His Messenger and it (obedience to people who possess Divine Authority) is the affirmation of what has come from Allah. Dress up (in piety) before every Mosque. Find the houses through the doors to them, the houses for which Allah has granted permission to be raised high, wherein people speak of Him. He has informed you that in these houses there are men who do not become distracted because of trade and business from speaking of Allah, the Most Majestic, the Most Holy, from prayer and paying al-Zakat (charity). These men fear the Day wherein the hearts and eyes undergo turbulent conditions. Allah chose and purified the messengers for His command, then He purified and chose them (people who possess Divine Authority) who are confirmed in His warnings. Allah has said, ‘No nation who lived before was left without a Warner. . . .’ (35:25) “Lost are those who remained ignorant and guided are those who thought and understood. Allah, the Most Majestic, the Most Holy, has said, ‘It is not their seeing ability that is blind but it is their hearts which are in their chests.’ (22:46) “How can one who does not think find guidance? How can one who has not received warnings think? Follow the Messenger of Allah, affirm whatever has come from Allah, follow the marks of guidance; they are the signs of trust and piety. You must know that if a man rejects Jesus Christ and acknowledges all the other messengers of Allah, he is not a believer. Find the way through finding the lighthouse and look for the marks from behind the curtains. Strive to perfect the affairs of your religion and believe in Allah your Lord.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (297/ 7)"
        ],
        "index": 1535,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:23:4",
        "text": [
          "عَنْهُ عَنْ أَبِيهِ عَنْ سُلَيْمَانَ الْجَعْفَرِيِّ عَنْ أَبِي الْحَسَنِ الرِّضَا عَنْ أَبِيهِ ( عليهما السلام ) قَالَ رَفَعَ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) قَوْمٌ فِي بَعْضِ غَزَوَاتِهِ فَقَالَ مَنِ الْقَوْمُ فَقَالُوا مُؤْمِنُونَ يَا رَسُولَ اللَّهِ قَالَ وَ مَا بَلَغَ مِنْ إِيمَانِكُمْ قَالُوا الصَّبْرُ عِنْدَ الْبَلَاءِ وَ الشُّكْرُ عِنْدَ الرَّخَاءِ وَ الرِّضَا بِالْقَضَاءِ ",
          "فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) حُلَمَاءُ عُلَمَاءُ كَادُوا مِنَ الْفِقْهِ أَنْ يَكُونُوا أَنْبِيَاءَ إِنْ كُنْتُمْ كَمَا تَصِفُونَ فَلَا تَبْنُوا مَا لَا تَسْكُنُونَ وَ لَا تَجْمَعُوا مَا لَا تَأْكُلُونَ وَ اتَّقُوا اللَّهَ الَّذِي إِلَيْهِ تُرْجَعُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from his father, from Suleyman Al Ja’fary, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup style=\"font-weight: normal\">asws</sup>, from his<sup style=\"font-weight: normal\">asws</sup> father<sup style=\"font-weight: normal\">asws</sup> having said: ‘A group of people came up to Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> during one of his<sup style=\"font-weight: normal\">saww</sup> military expeditions, so he<sup style=\"font-weight: normal\">saww</sup> said: ‘Who are these people?’ So they said, ‘<span class=\"iTxt\">Momin</span>s, O Rasool-Allah<sup style=\"font-weight: normal\">saww</sup>! He<sup style=\"font-weight: normal\">saww</sup> said: ‘And what has reached from your <span class=\"iTxt\">Emān</span>?’ They said, ‘The patience during the afflictions, and the gratefulness during the prosperity, and the pleasure with the Ordainment’. ",
            "So Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> said: ‘Forbearing, knowledgeable. The understanding is almost as if it could happen to be of Prophets<sup style=\"font-weight: normal\">as</sup>, if you are just as you are describing (yourselves to be). So, do not build what you would not be living in, and do not amass what you would not be consuming, and fear Allah<sup style=\"font-weight: normal\">azwj</sup>, the One to Whom you will be returning’."
          ],
          "en.sarwar": [
            "4. It is narrated from him from his father from Sulayman al-Ja’fary from abu al- Hassan al-Rida from his father (a.s.) who has said the following: “A people came to the Messenger of Allah during one of the armed expeditions and he asked who are these people? They said, ‘Believers, O Messenger of Allah.’ He then asked, ‘What is the degree of your belief?’ They replied, ‘It is patience in hardships, thankfulness in prosperous life and agreement with the decision of Allah.’ The Messenger of Allah then said, ‘These are forbearing and knowledgeable people. Their understanding is almost to the degree of the prophets. If you really are what you say you are, do not build what you will not use for dwelling, do not accumulate what you will not eat and be pious before Allah to whom you will return.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:23",
  "kind": "verse_list"
}