{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 25"
        },
        "path": "/books/al-kafi:2:1:25",
        "titles": {
          "ar": "بَابُ صِفَةِ الْإِيمَانِ",
          "en": "Chapter 25 – Description of the Emān"
        }
      }
    ],
    "index": 213,
    "local_index": 25,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 26"
        },
        "path": "/books/al-kafi:2:1:26",
        "titles": {
          "ar": "بَابُ فَضْلِ الْإِيمَانِ عَلَى الْإِسْلَامِ وَ الْيَقِينِ عَلَى الْإِيمَانِ",
          "en": "Chapter 26 – Superiority of the Emān over Al-Islām, and the (superiority of the) conviction over the Emān"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 24"
        },
        "path": "/books/al-kafi:2:1:24",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابٌ</span>",
          "en": "Chapter 24 – A Chapter"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:25",
    "titles": {
      "ar": "بَابُ صِفَةِ الْإِيمَانِ",
      "en": "Chapter 25 – Description of the Emān"
    },
    "verse_count": 1,
    "verse_start_index": 1536,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/313)"
        ],
        "index": 1537,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:25:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>ِالْإِسْنَادِ الْأَوَّلِ</span> عَنِ ابْنِ مَحْبُوبٍ عَنْ يَعْقُوبَ السَّرَّاجِ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سُئِلَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) عَنِ الْإِيمَانِ فَقَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ جَعَلَ الْإِيمَانَ عَلَى أَرْبَعِ دَعَائِمَ عَلَى الصَّبْرِ وَ الْيَقِينِ وَ الْعَدْلِ وَ الْجِهَادِ",
          "فَالصَّبْرُ مِنْ ذَلِكَ عَلَى أَرْبَعِ شُعَبٍ عَلَى الشَّوْقِ وَ الْإِشْفَاقِ وَ الزُّهْدِ وَ التَّرَقُّبِ فَمَنِ اشْتَاقَ إِلَى الْجَنَّةِ سَلَا عَنِ الشَّهَوَاتِ وَ مَنْ أَشْفَقَ مِنَ النَّارِ رَجَعَ عَنِ الْمُحَرَّمَاتِ وَ مَنْ زَهِدَ فِي الدُّنْيَا هَانَتْ عَلَيْهِ الْمُصِيبَاتُ وَ مَنْ رَاقَبَ الْمَوْتَ سَارَعَ إِلَى الْخَيْرَاتِ",
          "وَ الْيَقِينُ عَلَى أَرْبَعِ شُعَبٍ تَبْصِرَةِ الْفِطْنَةِ وَ تَأَوُّلِ الْحِكْمَةِ وَ مَعْرِفَةِ الْعِبْرَةِ وَ سُنَّةِ الْأَوَّلِينَ فَمَنْ أَبْصَرَ الْفِطْنَةَ عَرَفَ الْحِكْمَةَ وَ مَنْ تَأَوَّلَ الْحِكْمَةَ عَرَفَ الْعِبْرَةَ وَ مَنْ عَرَفَ الْعِبْرَةَ عَرَفَ السُّنَّةَ وَ مَنْ عَرَفَ السُّنَّةَ فَكَأَنَّمَا كَانَ مَعَ الْأَوَّلِينَ وَ اهْتَدَى إِلَى الَّتِي هِيَ أَقْوَمُ وَ نَظَرَ إِلَى مَنْ نَجَا بِمَا نَجَا وَ مَنْ هَلَكَ بِمَا هَلَكَ وَ إِنَّمَا أَهْلَكَ اللَّهُ مَنْ أَهْلَكَ بِمَعْصِيَتِهِ وَ أَنْجَى مَنْ أَنْجَى بِطَاعَتِهِ ",
          "وَ الْعَدْلُ عَلَى أَرْبَعِ شُعَبٍ غَامِضِ الْفَهْمِ وَ غَمْرِ الْعِلْمِ وَ زَهْرَةِ الْحُكْمِ وَ رَوْضَةِ الْحِلْمِ فَمَنْ فَهِمَ فَسَّرَ جَمِيعَ الْعِلْمِ وَ مَنْ عَلِمَ عَرَفَ شَرَائِعَ الْحُكْمِ وَ مَنْ حَلُمَ لَمْ يُفَرِّطْ فِي أَمْرِهِ وَ عَاشَ فِي النَّاسِ حَمِيداً ",
          "وَ الْجِهَادُ عَلَى أَرْبَعِ شُعَبٍ عَلَى الْأَمْرِ بِالْمَعْرُوفِ وَ النَّهْيِ عَنِ الْمُنْكَرِ وَ الصِّدْقِ فِي الْمَوَاطِنِ وَ شَنَآنِ الْفَاسِقِينَ فَمَنْ أَمَرَ بِالْمَعْرُوفِ شَدَّ ظَهْرَ الْمُؤْمِنِ وَ مَنْ نَهَى عَنِ الْمُنْكَرِ أَرْغَمَ أَنْفَ الْمُنَافِقِ وَ أَمِنَ كَيْدَهُ وَ مَنْ صَدَقَ فِي الْمَوَاطِنِ قَضَى الَّذِي عَلَيْهِ وَ مَنْ شَنِئَ الْفَاسِقِينَ غَضِبَ لِلَّهِ وَ مَنْ غَضِبَ لِلَّهِ غَضِبَ اللَّهُ لَهُ ",
          "فَذَلِكَ الْإِيمَانُ وَ دَعَائِمُهُ وَ شُعَبُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "By the former chain, from Ibn Mahboub, rom Yaqoub Al Sarraj, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-<span class=\"iTxt\">Momin</span>een<sup>asws</sup> was asked about the <span class=\"iTxt\">Emān</span>. So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Made the <span class=\"iTxt\">Emān</span> to be upon four foundations – Upon the patience, and the conviction, and the justice, and the Jihad. ",
            "So the patience from that, is upon four branches – The desire, and the fear, and the ascetism, and the vigilance. So the one who is desirous for the Paradise would disregard the lustful desires; and the one who fears from the Fire would back away from the Prohibitions; and the one who is ascetic in the world, the difficulties would be easy upon him (to bear); and the one who is vigilant of the death, would hasten to the goodness. ",
            "And the conviction is upon four branches – Clever thinking, and the construed wisdom, and the lesson understood, and a Sunnah of the former ones. So the one who thinks cleverly would recognise the wisdom, and the one who construes the wisdom would recognise the lesson (to be learnt), and the one who recognises the lesson (to be learnt) would recognise the <span class=\"iTxt\">Sunnah</span>, and the one who recognises the <span class=\"iTxt\">Sunnah</span>, so it is as if he was with the former ones, and he would be guided to that which is upright, and he would look at the one who achieved salvation, what he had achieved salvation with, and the one who was destroyed, what he was destroyed by. And rather, destroyed is the one whom Allah<sup>azwj</sup> Destroys due to his disobedience, and salvaged is the one who is salvaged by his obedience’. ",
            "And the justice is upon four branches – Depth of understanding, and vastness of knowledge, and the blossom of wisdom, and the garden of forbearance. So the one who understands would interpret the entirety of knowledge, and the one is knowledgeable would recognise the Laws of wisdom, and the one who is forbearing would not exaggerate in his matters, and would live among the people, praised.",
            "And the <span class=\"iTxt\">Jihād</span> is upon four branches – Upon the enjoining of the good, and forbidding from the evil, and the truthfulness in the places, and shunning the transgressors. So the one who enjoins with the goodness would strengthen the back of the <span class=\"iTxt\">Momin</span>, and the one who forbids from the evil would grind the nose of the hypocrites and thwart his plots, and the one who is truthful in the places, it would come to pass, that which is upon him, and the one who shuns the transgressors would be angered for the Sake of Allah<sup>azwj</sup>, and the one who is angered for the Sake of Allah<sup>azwj</sup>, Allah<sup>azwj</sup> would get Angered for him (against his enemies). ",
            "So that is the <span class=\"iTxt\">Emān</span> and its pillars and its branches."
          ],
          "en.sarwar": [
            "1. Through the same chain of narrators as the above Hadith it is narrated from ibn Mahbub from Ya’qub al-Sarraj from Jabir from abu Ja’far (a.s.) who has said the following: “Amir al-Mu’minin (Ali ibn abu Talib) (a.s.) was asked about belief and he said, ‘Allah, the Most Majestic, the Most Holy, made belief upon four pillars: ‘Patience, Certainty, Justice and Jihad (hard work for the cause of Allah). ‘The Patience therein has four branches: nostalgia, fear, restraint and vigilance. One who has a longing for paradise forgets the worldly desires. One who has fear of hell abstains from unlawful things. One who exercises restraint in worldly matters the worldly hardships become easier for him, and one who is vigilant of death hastens to good deeds. ‘The Certainty therein is also of four branches. They consist of sharp understanding, proper application of wisdom, recognizing good lessons and knowledge of the traditions of the people of the past. One who possesses sharp understanding recognizes the matters of wisdom. One who applies wisdom properly recognizes the good lessons, and one who recognizes the good lessons recognizes the traditions, and one who recognizes traditions is like the one who has lived with the people of the past and has found proper and firm guidance. He has seen who found salvation and by what means they found. He has also seen those who were destroyed and things that destroyed them. Allah destroys only those who disobey Him and grants salvation for ones obedience to His commands. ‘The Justice therein is also of four branches. It is a matter of deep understanding, a huge body of knowledge, the bloom of wisdom and the garden of forbearance. One who has deep understanding has the ability to interpret all knowledge. One who has a huge body of knowledge knows the ways of wisdom, and one who is forbearing is not an extremist in his decrees and lives among the people with a good name. ‘The Jihad (hard work for the cause of Allah) therein, is also of four branches. They consist of helping others to perform their duties and to stay away from that which is prohibited, to speak the truth whenever needed and to shun sins and sinners. One who helps others to perform their duties has supported the believer. One who helps stop others from sinning has humiliated the hypocrites and has thwarted their wicked plans. One who speaks the truth at the right time, his is the winning side. One who shuns the sinners has used anger for Allah. One who becomes angry for Allah, Allah becomes angry for him. Such is belief, its pillars and branches.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:25",
  "kind": "verse_list"
}