{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 27"
        },
        "path": "/books/al-kafi:2:1:27",
        "titles": {
          "ar": "بَابُ حَقِيقَةِ الْإِيمَانِ وَ الْيَقِينِ",
          "en": "Chapter 27 – The reality of the Emān and ‘الْيَقِينَ’ (Yaqeen - the conviction)"
        }
      }
    ],
    "index": 215,
    "local_index": 27,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 28"
        },
        "path": "/books/al-kafi:2:1:28",
        "titles": {
          "ar": "بَابُ التَّفَكُّرِ",
          "en": "Chapter 28 – The ‘التَّفَكُّرِ’ Contemplation"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 26"
        },
        "path": "/books/al-kafi:2:1:26",
        "titles": {
          "ar": "بَابُ فَضْلِ الْإِيمَانِ عَلَى الْإِسْلَامِ وَ الْيَقِينِ عَلَى الْإِيمَانِ",
          "en": "Chapter 26 – Superiority of the Emān over Al-Islām, and the (superiority of the) conviction over the Emān"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:27",
    "titles": {
      "ar": "بَابُ حَقِيقَةِ الْإِيمَانِ وَ الْيَقِينِ",
      "en": "Chapter 27 – The reality of the Emān and ‘الْيَقِينَ’ (Yaqeen - the conviction)"
    },
    "verse_count": 4,
    "verse_start_index": 1543,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/331)"
        ],
        "index": 1544,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/204",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1624",
              "text": "مُحَمَّدِ بْنِ عُذَافِرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ مُحَمَّدِ بْنِ عُذَافِرٍ عَنْ أَبِيهِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:27:1",
        "text": [
          " بَيْنَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فِي بَعْضِ أَسْفَارِهِ إِذْ لَقِيَهُ رَكْبٌ فَقَالُوا السَّلَامُ عَلَيْكَ يَا رَسُولَ اللَّهِ فَقَالَ مَا أَنْتُمْ فَقَالُوا نَحْنُ مُؤْمِنُونَ يَا رَسُولَ اللَّهِ قَالَ فَمَا حَقِيقَةُ إِيمَانِكُمْ قَالُوا الرِّضَا بِقَضَاءِ اللَّهِ وَ التَّفْوِيضُ إِلَى اللَّهِ وَ التَّسْلِيمُ لِأَمْرِ اللَّهِ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عُلَمَاءُ حُكَمَاءُ كَادُوا أَنْ يَكُونُوا مِنَ الْحِكْمَةِ أَنْبِيَاءَ فَإِنْ كُنْتُمْ صَادِقِينَ فَلَا تَبْنُوا مَا لَا تَسْكُنُونَ وَ لَا تَجْمَعُوا مَا لَا تَأْكُلُونَ وَ اتَّقُوا اللَّهَ الَّذِي إِلَيْهِ تُرْجَعُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Ismail Bin Bazie, from Muhammad Bin Uzafir, from his father, ",
            "(It has been narrated) from Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> having said: ‘While Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> was in one of his<sup style=\"font-weight: normal\">saww</sup> journeys, he<sup style=\"font-weight: normal\">saww</sup> met some riders. So they said, ‘The greetings be upon you<sup style=\"font-weight: normal\">saww</sup> O Rasool-Allah<sup style=\"font-weight: normal\">saww</sup>! So he<sup style=\"font-weight: normal\">saww</sup> said: ‘What are you?’ So they said, ‘We are <span class=\"iTxt\">Momin</span>s, O Rasool-Allah<sup style=\"font-weight: normal\">saww</sup>! He<sup style=\"font-weight: normal\">saww</sup> said: ‘So what is the reality of your <span class=\"iTxt\">Emān</span>?’ They said, ‘The agreeability with the Judgement of Allah<sup style=\"font-weight: normal\">azwj</sup>, and the delegation (of the matters) to Allah<sup style=\"font-weight: normal\">azwj</sup>, and the submission to the Command of Allah<sup style=\"font-weight: normal\">azwj</sup>’. So Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> said: ‘Scholars, wise ones, almost they could happen to be from the wisdom of the Prophets<sup style=\"font-weight: normal\">as</sup>. So if you all are truthful, so do not build what you would not be dwelling it, and do not amass what you would not be consuming, and fear Allah<sup style=\"font-weight: normal\">azwj</sup>, to Whom you will be returning’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Muhammad ibn Isma’il from Bazi’ from Muhammad ibn ‘Azafir from his father from abu Ja’far (a.s.) who has said the following: “During one of the journeys of the Messenger of Allah a group of people who were riding came to meet him. They said, ‘Salute to you O Messenger of Allah.’ He asked, ‘Who are you?’ They replied, ‘We are believers, O Messenger of Allah.’ He then asked, ‘What is the essence of your belief?’ They replied, ‘It is to agree with the decision of Allah, allow Him be the person in charge of one’s affairs and submit to the command of Allah.’ The Messenger of Allah said, ‘They are scholars and people of wisdom who for their wisdom can almost be prophets. If what you say is true then do not build that which you do not use as dwelling, do not accumulate what you do not eat and be pious before Allah to whom you will return.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/332)"
        ],
        "index": 1545,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1625",
              "text": "أَبِي مُحَمَّدٍ الْوَابِشِيِّ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1083",
              "text": "إِبْرَاهِيمَ بْنِ مِهْزَمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/28",
              "text": "إِسْحَاقَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي مُحَمَّدٍ الْوَابِشِيِّ وَ إِبْرَاهِيمَ بْنِ مِهْزَمٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:27:2",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) صَلَّى بِالنَّاسِ الصُّبْحَ فَنَظَرَ إِلَى شَابٍّ فِي الْمَسْجِدِ وَ هُوَ يَخْفِقُ وَ يَهْوِي بِرَأْسِهِ مُصْفَرّاً لَوْنُهُ قَدْ نَحِفَ جِسْمُهُ وَ غَارَتْ عَيْنَاهُ فِي رَأْسِهِ",
          "فَقَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كَيْفَ أَصْبَحْتَ يَا فُلَانُ قَالَ أَصْبَحْتُ يَا رَسُولَ اللَّهِ مُوقِناً فَعَجِبَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مِنْ قَوْلِهِ وَ قَالَ إِنَّ لِكُلِّ يَقِينٍ حَقِيقَةً فَمَا حَقِيقَةُ يَقِينِكَ",
          "فَقَالَ إِنَّ يَقِينِي يَا رَسُولَ اللَّهِ هُوَ الَّذِي أَحْزَنَنِي وَ أَسْهَرَ لَيْلِي وَ أَظْمَأَ هَوَاجِرِي فَعَزَفَتْ نَفْسِي عَنِ الدُّنْيَا وَ مَا فِيهَا حَتَّى كَأَنِّي أَنْظُرُ إِلَى عَرْشِ رَبِّي وَ قَدْ نُصِبَ لِلْحِسَابِ وَ حُشِرَ الْخَلَائِقُ لِذَلِكَ وَ أَنَا فِيهِمْ وَ كَأَنِّي أَنْظُرُ إِلَى أَهْلِ الْجَنَّةِ يَتَنَعَّمُونَ فِي الْجَنَّةِ وَ يَتَعَارَفُونَ وَ عَلَى الْأَرَائِكِ مُتَّكِئُونَ وَ كَأَنِّي أَنْظُرُ إِلَى أَهْلِ النَّارِ وَ هُمْ فِيهَا مُعَذَّبُونَ مُصْطَرِخُونَ وَ كَأَنِّي الْآنَ أَسْمَعُ زَفِيرَ النَّارِ يَدُورُ فِي مَسَامِعِي ",
          "فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِأَصْحَابِهِ هَذَا عَبْدٌ نَوَّرَ اللَّهُ قَلْبَهُ بِالْإِيمَانِ ثُمَّ قَالَ لَهُ الْزَمْ مَا أَنْتَ عَلَيْهِ فَقَالَ الشَّابُّ ادْعُ اللَّهَ لِي يَا رَسُولَ اللَّهِ أَنْ أُرْزَقَ الشَّهَادَةَ مَعَكَ فَدَعَا لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَلَمْ يَلْبَثْ أَنْ خَرَجَ فِي بَعْضِ غَزَوَاتِ النَّبِيِّ ( صلى الله عليه وآله ) فَاسْتُشْهِدَ بَعْدَ تِسْعَةِ نَفَرٍ وَ كَانَ هُوَ الْعَاشِرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, and Ali Bin Ibrahim, from his father, altogether, from Ibn Mahboub, from Abu Muhammad Al Wabishy and Ibrahim Bin Mihran, from Is’haq Bin Ammar who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying that Rasool-Allah<sup>saww</sup> prayed <span class=\"iTxt\">Salāt</span> (leading) with the people in the morning. So he looked at a youth in the Masjid, and he was fearful and had hung his head, being pale of colour, his body being slim, and his eyes had sunk in his head. ",
            "So Rasool-Allah<sup>saww</sup> said to him: ‘How is your morning, O so and so?’ He said, ‘I woke in the morning on ‘الْيَقِينَ’ conviction’. So Rasool-Allah<sup>saww</sup> was astounded from his words, and he<sup>saww</sup> said: ‘For every ‘الْيَقِينَ’ conviction there is a reality. So what is the reality of your الْيَقِينَ ‘’ conviction?’ ",
            "So he said, ‘My conviction, O Rasool-Allah<sup>saww</sup>, it is that which grieves me. I stay awake during my night and am thirsty. I have withdrawn myself from the world and whatever is in it, to the extent that it is as if I am looking at the Throne of my Lord<sup>azwj</sup>, and He<sup>azwj</sup> has Established the Reckoning, and the creatures have been Resurrected for that, and I am among them; and it is as if I am looking at the people of the Paradise blissfully in the Paradise, and they are being introduced and they are reclining upon the raise couches; and it is as if I am looking at the people of the Fire, and they are being Punished in it, shrieking; and it is as if I am hearing the exhalation of the Fire circling in my ears’. ",
            "So Rasool-Allah<sup>saww</sup> said to his<sup>saww</sup> companions, ‘This is a servant whose heart Allah<sup>azwj</sup> has Enlightened with the <span class=\"iTxt\">Emān</span>’. Then he<sup>saww</sup> said to him: ‘Keep necessitating what you are upon’. So the youth said, ‘Supplicate for me, O Rasool-Allah<sup>saww</sup>, that I may be Graced with the martyrdom along with you<sup>saww</sup>’. So Rasool-Allah<sup>saww</sup> supplicated for him, and it was not long before he went out in one of the military expeditions of the Prophet<sup>saww</sup>, and he was martyred after nine persons, and he was the tenth’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa and Ali ibn Ibrahim has narrated from his father all from ibn Mahbub from abu Muhammad al-Wabishi and Ibrahim ibn Mehzam from Ishaq ibn ‘Ammar who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘Once the Messenger of Allah after leading the morningprayer for the people looked at a young man in the Mosque whose head hung down. He looked pale and slim and his eyes sunk into his head. The Messenger of Allah asked, ‘O so and so, how is your morning?’ He (the young man) replied, ‘This morning, I, O Messenger of Allah, am in a condition of certainty. The messenger of Allah admired him for his words and he said, ‘For everything there is an essence. What is the essence of your certainty?’ The young man said, ‘My certainty, O Messenger of Allah, is that which has made me depressed. It has kept me awake all night and to endure thirst during the day. My soul is withdrawn from the world and the things in it, so much so, as if I am looking at the Throne of my Lord that is established to call everyone to Judgment, all creatures are resurrected and I am among them. It is as if I am looking at the people of paradise who enjoy therein being introduced to each other while leaning against raised couches. It is also as if I am looking at the people of hell wherein they suffer and cry for help. Right now, it is as if I hear the roaring of the fire. It is striking against my ears.’ The Messenger of Allah said to his companions, ‘This is a servant of Allah whose heart He has brightened up with belief.’ He (the Messenger of Allah) said to him (the young man), ‘Keep up with what you are in (condition of your belief).’ The young man said, ‘Pray to Allah for me, O Messenger of Allah, to grant me martyrdom (while working hard in support of your cause) along with you.’ The Messenger of Allah prayed for him. Not very long thereafter he joined the prophet in an armed expedition and he was the tenth man to become a martyr.’” "
          ]
        }
      },
      {
        "index": 1546,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/31",
              "text": "مُحَمَّدِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/260",
              "text": "عَبْدِ اللَّهِ بْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:27:3",
        "text": [
          " اسْتَقْبَلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) حَارِثَةَ بْنَ مَالِكِ بْنِ النُّعْمَانِ الْأَنْصَارِيَّ فَقَالَ لَهُ كَيْفَ أَنْتَ يَا حَارِثَةَ بْنَ مَالِكٍ فَقَالَ يَا رَسُولَ اللَّهِ مُؤْمِنٌ حَقّاً فَقَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِكُلِّ شَيْ‏ءٍ حَقِيقَةٌ فَمَا حَقِيقَةُ قَوْلِكَ",
          "فَقَالَ يَا رَسُولَ اللَّهِ عَزَفَتْ نَفْسِي عَنِ الدُّنْيَا فَأَسْهَرَتْ لَيْلِي وَ أَظْمَأَتْ هَوَاجِرِي وَ كَأَنِّي أَنْظُرُ إِلَى عَرْشِ رَبِّي [وَ] قَدْ وُضِعَ لِلْحِسَابِ وَ كَأَنِّي أَنْظُرُ إِلَى أَهْلِ الْجَنَّةِ يَتَزَاوَرُونَ فِي الْجَنَّةِ وَ كَأَنِّي أَسْمَعُ عُوَاءَ أَهْلِ النَّارِ فِي النَّارِ ",
          "فَقَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَبْدٌ نَوَّرَ اللَّهُ قَلْبَهُ أَبْصَرْتَ فَاثْبُتْ فَقَالَ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ لِي أَنْ يَرْزُقَنِي الشَّهَادَةَ مَعَكَ فَقَالَ اللَّهُمَّ ارْزُقْ حَارِثَةَ الشَّهَادَةَ فَلَمْ يَلْبَثْ إِلَّا أَيَّاماً حَتَّى بَعَثَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) سَرِيَّةً فَبَعَثَهُ فِيهَا فَقَاتَلَ فَقُتِلَ تِسْعَةٌ أَوْ ثَمَانِيَةٌ ثُمَّ قُتِلَ .",
          "وَ فِي رِوَايَةِ الْقَاسِمِ بْنِ بُرَيْدٍ عَنْ أَبِي بَصِيرٍ قَالَ اسْتُشْهِدَ مَعَ جَعْفَرِ بْنِ أَبِي طَالِبٍ بَعْدَ تِسْعَةِ نَفَرٍ وَ كَانَ هُوَ الْعَاشِرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Abdullah Bin Muskan, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> met Harise Bin Malik Bin Al-Numan Al-Ansary, so he<sup>saww</sup> said to him: ‘How are you, O Harisa Bin Malik?’ So he said, ‘O Rasool-Allah<sup>saww</sup>! A <span class=\"iTxt\">Momin</span> truly’. So Rasool-Allah<sup>saww</sup> said him ‘For everything there is a reality. So what is the reality of your words?’ ",
            "So he said, ‘O Rasool-Allah<sup>saww</sup>! I have withdrawn myself from the world, so I stay awake during my night and am thirsty, and it is as if I am looking at the Throne of my Lord<sup>azwj</sup>, and it has been placed for the Reckoning, and it is as if I am looking at the people of the Paradise visiting in the Paradise, and it is as if I am hearing the howling of the people of the Fire in the Fire’. ",
            "So Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> said to him: ‘(You are) a servant whose heart Allah<sup style=\"font-weight: normal\">azwj</sup> has Enlightened. You have insight, so be steadfast’. So he said, ‘O Rasool-Allah<sup style=\"font-weight: normal\">saww</sup>! Supplicate for me that He<sup style=\"font-weight: normal\">azwj</sup> should Grace me with the martyrdom with you’. So he<sup style=\"font-weight: normal\">saww</sup> said: ‘O Allah<sup style=\"font-weight: normal\">azwj</sup> Grace the martyrdon to Harisa’. So it wasn’t long, only a few days, until Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> sent a batallion, and sent him in it. So he fought and killed nine, or eight, then he was killed’. ",
            "And in another repoted of Al-Qasim Bureyd, from Abu Baseer who said, ‘He was martyred with Ja’far<sup style=\"font-weight: normal\">as</sup> Bin Abu Talib<sup style=\"font-weight: normal\">as</sup> after nine people, and he was the tenth’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from ‘Abd Allah ibn Muskan from abu Basir from abu ‘Abd Allah (a.s.) who has said the following: ‘‘The Messenger of Allah once met Harithah ibn Malik al- Nu’man al-Ansari and asked him, ‘How are you, O Harithah ibn Malik?’ He replied, ‘O Messenger of Allah, I am a believer in a real sense.’ The Messenger of Allah then asked, ‘Everything has a reality and essence. What are the reality and essence of your words?’ “He replied, ‘O Messenger of Allah, my soul has withdrawn from this world; it has kept me awake all night and to endure thirst in the middle of the day. It is as if I am looking to the Throne of my Lord that is established to bring all people to account. It is as if I am looking at the people of paradise who are visiting each other and I hear the barking of the people of hell therefrom.’ The Messenger of Allah, then said, ‘He is a servant whose heart is brightened (by the command of) Allah. You have reached (true) understanding, remain steadfast.’ He then asked, ‘O Messenger of Allah, pray to Allah for me to grant me martyrdom (while working hard to support your cause) along with you.’ The Messenger of Allah prayed, ‘O Allah, grant him martyrdom.’ Within very few days thereafter, he (the messenger of Allah) dispatched a group of people for an armed expedition and Harithah was among them. He (Harithah) fought the enemy and did away with eight or nine people before he became a martyr. “In the narration of al-Qasim from his father from abu Basir it is said that Harithah was martyred in the army of Ja’far ibn abu Talib after the martyrdom of nine people.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (337/ 7)"
        ],
        "index": 1547,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/38",
              "text": "النَّوْفَلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/39",
              "text": "السَّكُونِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:27:4",
        "text": [
          " قَالَ أَمِيرُ الْمُؤْمِنِينَ صَلَوَاتُ اللَّهِ عَلَيْهِ إِنَّ عَلَى كُلِّ حَقٍّ حَقِيقَةً وَ عَلَى كُلِّ صَوَابٍ نُوراً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-<span class=\"iTxt\">Momin</span>een<sup>asws</sup> said: ‘Upon every ‘حَقٍّ’ Just/truth there is ‘حَقِيقَةً’ a reality, and upon every correct deed is ‘نُوراً’ a Light’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from al-Nawfali from al-Sakuni from abu ‘Abd Allah (a.s.) who has said the following: “Amir al-Mu’minin (Ali ibn abu Talib) (a.s.) has said, ‘Over every truth there certainly is a reality and over every correct issue there is light.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:27",
  "kind": "verse_list"
}