{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 29"
        },
        "path": "/books/al-kafi:2:1:29",
        "titles": {
          "ar": "بَابُ الْمَكَارِمِ",
          "en": "Chapter 29 – The Nobilities"
        }
      }
    ],
    "index": 217,
    "local_index": 29,
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:29",
    "titles": {
      "ar": "بَابُ الْمَكَارِمِ",
      "en": "Chapter 29 – The Nobilities"
    },
    "verse_count": 7,
    "verse_start_index": 1552,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/343)"
        ],
        "index": 1553,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:29:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْهَيْثَمِ بْنِ أَبِي مَسْرُوقٍ عَنْ يَزِيدَ بْنِ إِسْحَاقَ شَعِرٍ عَنِ الْحُسَيْنِ بْنِ عَطِيَّةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْمَكَارِمُ عَشْرٌ فَإِنِ اسْتَطَعْتَ أَنْ تَكُونَ فِيكَ فَلْتَكُنْ فَإِنَّهَا تَكُونُ فِي الرَّجُلِ وَ لَا تَكُونُ فِي وَلَدِهِ وَ تَكُونُ فِي الْوَلَدِ وَ لَا تَكُونُ فِي أَبِيهِ وَ تَكُونُ فِي الْعَبْدِ وَ لَا تَكُونُ فِي الْحُرِّ قِيلَ وَ مَا هُنَّ ",
          "قَالَ صِدْقُ الْبَأْسِ وَ صِدْقُ اللِّسَانِ وَ أَدَاءُ الْأَمَانَةِ وَ صِلَةُ الرَّحِمِ وَ إِقْرَاءُ الضَّيْفِ وَ إِطْعَامُ السَّائِلِ وَ الْمُكَافَأَةُ عَلَى الصَّنَائِعِ وَ التَّذَمُّمُ لِلْجَارِ وَ التَّذَمُّمُ لِلصَّاحِبِ وَ رَأْسُهُنَّ الْحَيَاءُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Haysam Bin Abu Masrouq, from Yazeed Bin Is’haq Shairin, from Al Husayn Bin Atiyya, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The nobilities are ten. So if you have the capacity that they should happen to be in you, so let it happen, for these can happen to be in the man and not happen to be in his son, and these can happen to be in the son and not happen to be in his father, and these can happen to be in the slave and not happen to be in the free (one)’. It was said, ‘And what are these?’ ",
            "He<sup>asws</sup> said: ‘True bravery, and truthful of the tongue, and paying the entrustments, and helping the relatives, and entertaining the guest, and feeding the beggar, and the rewarding upon the works, and the responsibility for the neighbour, and the responsibility for the companions – and the head of these is ‘الْحَيَاءُ’ the bashfulness’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hatham ibn abu Masruq from Yazid ibn Ishaq Sha’ar from al-Husayn ibn al- ‘Atiyah from abu ‘Abd Allah (a.s.) who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘Noble (human) qualities are ten. If you can establish all of them so be it. Such qualities may be found in a man but may not be found in his children. They may be found in the children but not in the father. At times they are found in a slave person but not in a free one.’ It was asked, ‘What are these noble qualities?’ The Imam said they are: ‘Losing all hope in the true sense for receiving help from anyone other than Allah, truthfulness of tongue, returning the trust (safely), maintaining good relations with relatives, entertaining guests, feeding the needy, making up for favors in a proper corresponding manner, keeping up with one’s responsibilities toward the neighbors and with one’s companion, and the head of such qualities is bashfulness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق وآخره مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (347/ 7)"
        ],
        "index": 1554,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:29:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ خَصَّ رُسُلَهُ بِمَكَارِمِ الْأَخْلَاقِ فَامْتَحِنُوا أَنْفُسَكُمْ فَإِنْ كَانَتْ فِيكُمْ فَاحْمَدُوا اللَّهَ وَ اعْلَمُوا أَنَّ ذَلِكَ مِنْ خَيْرٍ وَ إِنْ لَا تَكُنْ فِيكُمْ فَاسْأَلُوا اللَّهَ وَ ارْغَبُوا إِلَيْهِ فِيهَا ",
          "قَالَ فَذَكَرَهَا عَشَرَةً الْيَقِينَ وَ الْقَنَاعَةَ وَ الصَّبْرَ وَ الشُّكْرَ وَ الْحِلْمَ وَ حُسْنَ الْخُلُقِ وَ السَّخَاءَ وَ الْغَيْرَةَ وَ الشَّجَاعَةَ وَ الْمُرُوءَةَ ",
          "قَالَ وَ رَوَى بَعْضُهُمْ بَعْدَ هَذِهِ الْخِصَالِ الْعَشَرَةِ وَ زَادَ فِيهَا الصِّدْقَ وَ أَدَاءَ الْأَمَانَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from Abdullah Bin Muskan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Specialised His<sup>azwj</sup> Rasools<sup>as</sup> with the noble mannerisms, so therefore examine yourselves. So if these were in you, then Praise Allah<sup>azwj</sup> and know that, that is from the goodness, and if these are not in you, then ask Allah<sup>azwj</sup> and hope to Him<sup>azwj</sup> regarding these’.",
            "He (the narrator) said, ‘So he<sup style=\"font-weight: normal\">asws</sup> mentioned these ten as being – the conviiction, and the contentment, and the patience, and the gratefulness, and the forbearance, and the good mannerisms, and the generousity, and the sense of pride, and the bravery, and the magnanimity’. ",
            "He (the narrator) said, ‘And some of them reported after these them characteristics and increase in it, the truthfulness and the paying of the entrusments’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ‘Uthman ibn ‘Isa from ‘Abd Allah ibn Muskan from abu ‘Abd Allah (a.s.) who has said the following: “Allah, the Most Majestic, the Most Holy, chose His messengers for noble moral (human) qualities. You must test yourselves. If you find the noble qualities in you then be thankful to Allah and understand that it is of goodness. If you do not find them in you, then pray to Allah to grant them to you and show Him that you are interested in having them. The narrator has said that the Imam counted the noble qualities up to ten: They consist of Certainty, Contentment, Patience, Thankfulness, Forbearance, Good Moral Behavior, Generosity, Dignity, Bravery and Kindness. “Certain narrators have listed other qualities after the above- mentioned ones and have added to them Truthfulness and Keeping Trust.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/349)"
        ],
        "index": 1555,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:29:3",
        "text": [
          "عَنْهُ عَنْ بَكْرِ بْنِ صَالِحٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الْهَاشِمِيِّ عَنْ إِسْمَاعِيلَ بْنِ عَبَّادٍ قَالَ بَكْرٌ وَ أَظُنُّنِي قَدْ سَمِعْتُهُ مِنْ إِسْمَاعِيلَ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّا لَنُحِبُّ مَنْ كَانَ عَاقِلًا فَهِماً فَقِيهاً حَلِيماً مُدَارِياً صَبُوراً صَدُوقاً وَفِيّاً إِنَّ اللَّهَ عَزَّ وَ جَلَّ خَصَّ الْأَنْبِيَاءَ بِمَكَارِمِ الْأَخْلَاقِ فَمَنْ كَانَتْ فِيهِ فَلْيَحْمَدِ اللَّهَ عَلَى ذَلِكَ وَ مَنْ لَمْ تَكُنْ فِيهِ فَلْيَتَضَرَّعْ إِلَى اللَّهِ عَزَّ وَ جَلَّ وَ لْيَسْأَلْهُ إِيَّاهَا ",
          "قَالَ قُلْتُ جُعِلْتُ فِدَاكَ وَ مَا هُنَّ قَالَ هُنَّ الْوَرَعُ وَ الْقَنَاعَةُ وَ الصَّبْرُ وَ الشُّكْرُ وَ الْحِلْمُ وَ الْحَيَاءُ وَ السَّخَاءُ وَ الشَّجَاعَةُ وَ الْغَيْرَةُ وَ الْبِرُّ وَ صِدْقُ الْحَدِيثِ وَ أَدَاءُ الْأَمَانَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Bakr Bin Salih, from Ja’far Bin Muhammad Al Hashimy, from Ismail Bin Abbad who said, ",
            "‘Bakr said, and I think he heard it from Ismail, from Abu Abdullah Bin Bakr, from Abu Abdullah<sup>asws</sup> having said: ‘We<sup>asws</sup> love the one who was an intellectual, understanding, scholarly, forbearing, kind, patient, truthful, loyal. Allah<sup>azwj</sup> Mighty and Majestic Specialise the Prophets<sup>as</sup> with the noble mannerisms. So the one in whom these are, so let him Praise Allah<sup>azwj</sup> upon that, and the one in whom these do not happen to be, so let him beseech to Allah<sup>azwj</sup> Mighty and Majestic and let him ask Him<sup>azwj</sup>’. ",
            "He (the narrator) said, ‘I said, ‘May I be sacrificed for you<sup>asws</sup>! And what are these?’ He<sup>asws</sup> said: ‘These are – the piety, and the contentment, and the patience, and the gratefulness, and the forbearance, and the bashfulness, and the generosity, and the bravery, and the self-esteem, and the goodwill, and truthful of the discussion, and payment of the entrustment’."
          ],
          "en.sarwar": [
            "3. It is narrated from him from Bakr ibn Salih from Ja’far ibn Muhammad al- Hashimi from Isma’il ‘Abbad who has said that perhaps he has heard it from Isma’il from ‘Abd Allah ibn Bukayr from abu ‘Abd Allah (a.s.) who has said the following: “We certainly love a person of reason, of good understanding, who has good knowledge and understanding of the law, who is forbearing, who is kind, who bears patience, who is truthful and who is loyal. Allah, the Most Majestic, the Most Holy, has chosen the prophets for noble moral (human) qualities. Whoever has them (noble qualities) should be thankful to Allah. Whoever does not have them he must pray humbly to Allah, the Most Majestic, the Most Holy, and request Him to grant them to him. “I (the narrator) then said, ‘May Allah keep my soul in service for your cause, what are the noble qualities?’ “The Imam said, ‘They consist of restraint from indulging in worldly matters, to be content, to bear patience, to be thankful, to be forbearing, to be bashful, to be generous, to have dignity, to be virtuous, to be truthful in one’s words and to be trustworthy.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (351/ 7)"
        ],
        "index": 1556,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:29:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ ارْتَضَى لَكُمُ الْإِسْلَامَ دِيناً فَأَحْسِنُوا صُحْبَتَهُ بِالسَّخَاءِ وَ حُسْنِ الْخُلُقِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Mahboub, from one of his companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic is Pleased with you all with Al-<span class=\"iTxt\">Islām</span> as a Religion, therefore make good your companionship with the generously, and good mannerisms’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Mahbub from certain individuals of his people from abu ‘Abd Allah (a.s.) who has said the following: “Allah, the Most Majestic, the Most Holy, has chosen Islam to be your religion. Keep good company with your religion by means of exercising generosity and good moral behavior.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (351/ 7)"
        ],
        "index": 1557,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:29:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه )  الْإِيمَانُ أَرْبَعَةُ أَرْكَانٍ الرِّضَا بِقَضَاءِ اللَّهِ وَ التَّوَكُّلُ عَلَى اللَّهِ وَ تَفْوِيضُ الْأَمْرِ إِلَى اللَّهِ وَ التَّسْلِيمُ لِأَمْرِ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-<span class=\"iTxt\">Momin</span>een<sup>asws</sup> said: ‘The <span class=\"iTxt\">Emān</span> has four pillars/foundations/dimensions – the pleasure with the Judgement of Allah<sup>azwj</sup>, and the reliance upon Allah<sup>azwj</sup>, and delegation of the matters to Allah<sup>azwj</sup>, and the submission to the Command of Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from al-Nawfali from al-Sakuni from abu ‘Abd Allah (a.s.) who has said the following: “Amir al-Mu’minin (Ali ibn abu Talib) has said, ‘Belief has four pillars. They consist of agreeing with the decision of Allah, trusting Allah, choosing Allah to be the person in charge of all affairs and submission to the command of Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/352)"
        ],
        "index": 1558,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:29:6",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ رَجُلٍ مِنْ بَنِي هَاشِمٍ قَالَ أَرْبَعٌ مَنْ كُنَّ فِيهِ كَمَلَ إِسْلَامُهُ وَ لَوْ كَانَ مِنْ قَرْنِهِ إِلَى قَدَمِهِ خَطَايَا لَمْ تَنْقُصْهُ الصِّدْقُ وَ الْحَيَاءُ وَ حُسْنُ الْخُلُقِ وَ الشُّكْرُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan Bin Ali, from Abdullah Bin Sinan, ",
            "(It has been narrated) from a man from the Clan of Hashim<sup>as</sup>, he<sup>asws</sup> said, ‘Four (things), if these are in someone, his <span class=\"iTxt\">Islām</span> would be perfect, and even if he was in sin from his head to his feet, it would not incur him a loss – the truthfulness, and the bashfulness, and the good mannerisms, and the gratefulness’."
          ],
          "en.sarwar": [
            "6. Al-Husayn ibn Muhammad has narrated from Mu’alla ibn Muhammad from al- Hassan ibn Ali from ‘Abd Allah ibn Sinan from a man from Banu Hashim who has said the following: “If four things are found in a person his Islam is perfect, even though he may be fdled with sins from his top to his toes it will not harm him. They consist of Truthfulness, Bashfulness, Good Moral Behavior and Thankfulness.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (352/ 7)"
        ],
        "index": 1559,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:29:7",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ أَبِي حَمْزَةَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَ لَا أُخْبِرُكُمْ بِخَيْرِ رِجَالِكُمْ قُلْنَا بَلَى يَا رَسُولَ اللَّهِ قَالَ إِنَّ مِنْ خَيْرِ رِجَالِكُمُ التَّقِيَّ النَّقِيَّ السَّمْحَ الْكَفَّيْنِ النَّقِيَّ الطَّرَفَيْنِ الْبَرَّ بِوَالِدَيْهِ وَ لَا يُلْجِئُ عِيَالَهُ إِلَى غَيْرِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, and Ali Bin Ibrahim, from his father, altogether from Ibn Mahboub, from Ibn Riab, from Abu Hamza, from Jabir Bin Abdullah who said, ",
            "‘Rasool-Allah<sup>saww</sup> said: ‘Shall I<sup>saww</sup> inform you with the best of your men?’ We said, ‘Yes, O Rasool-Allah<sup>saww</sup>!’ The best of your men is the pious, and the clean, and the forgiving of the hands, clean of the two sides (mouth and backside), the righteous with the parents, and does not leave his dependants to be a burden on) others’."
          ],
          "en.sarwar": [
            "7. A number of our people have narrated from Sahl ibn Ziyad and Ali ibn Ibrahim has narrated from his father all from ibn Mahbub from ibn Ri’ab from abu Hamza from Jabir ibn ‘Abd Allah who has said the following: “The Messenger of Allah (a.s.) once said, ‘Do you want me to tell you about the best men among you?’ We said, ‘Yes, O, Messenger of Allah, do so.’ He said, ‘The best men among you are the pious, clean, of forgiving hands, clean on both ends (tongue and genitals) who is kind to his parents and does not leave out his dependents to (trouble) others.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:29",
  "kind": "verse_list"
}