{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:2:1:3",
        "titles": {
          "ar": "بَابٌ آخَرُ مِنْهُ",
          "en": "Chapter 3 – Another Chapter from it"
        }
      }
    ],
    "index": 191,
    "local_index": 3,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 4"
        },
        "path": "/books/al-kafi:2:1:4",
        "titles": {
          "ar": "بَابُ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) أَوَّلُ مَنْ أَجَابَ وَ أَقَرَّ لِلَّهِ عَزَّ وَ جَلَّ بِالرُّبُوبِيَّةِ",
          "en": "Chapter 4 – Rasool-Allah<sup>saww</sup> was the first one to answer and acknowledge to Allah<sup>azwj</sup> Mighty and Majestic with the Lordship"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 2"
        },
        "path": "/books/al-kafi:2:1:2",
        "titles": {
          "ar": "بَابٌ آخَرُ مِنْهُ وَ فِيهِ زِيَادَةُ وُقُوعِ التَّكْلِيفِ الْأَوَّلِ",
          "en": "Chapter 2 – Another Chapter from it, and in it is an increase – Occurrence of the first Mandate"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:3",
    "titles": {
      "ar": "بَابٌ آخَرُ مِنْهُ",
      "en": "Chapter 3 – Another Chapter from it"
    },
    "verse_count": 3,
    "verse_start_index": 1451,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/22)"
        ],
        "index": 1452,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1399",
              "text": "دَاوُدَ الْعِجْلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/191",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/98",
              "text": "حُمْرَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ دَاوُدَ الْعِجْلِيِّ عَنْ زُرَارَةَ عَنْ حُمْرَانَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:3:1",
        "relations": {
          "Mentions": [
            "/books/quran:20:115",
            "/books/quran:7:172"
          ]
        },
        "text": [
          " إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى حَيْثُ خَلَقَ الْخَلْقَ خَلَقَ مَاءً عَذْباً وَ مَاءً مَالِحاً أُجَاجاً فَامْتَزَجَ الْمَاءَانِ فَأَخَذَ طِيناً مِنْ أَدِيمِ الْأَرْضِ فَعَرَكَهُ عَرْكاً شَدِيداً فَقَالَ لِأَصْحَابِ الْيَمِينِ وَ هُمْ كَالذَّرِّ يَدِبُّونَ إِلَى الْجَنَّةِ بِسَلَامٍ وَ قَالَ لِأَصْحَابِ الشِّمَالِ إِلَى النَّارِ وَ لَا أُبَالِي",
          "ثُمَّ قَالَ أَ لَسْتُ بِرَبِّكُمْ قالُوا بَلى شَهِدْنا أَنْ تَقُولُوا يَوْمَ الْقِيامَةِ إِنَّا كُنَّا عَنْ هذا غافِلِينَ ثُمَّ أَخَذَ الْمِيثَاقَ عَلَى النَّبِيِّينَ فَقَالَ أَ لَسْتُ بِرَبِّكُمْ وَ أَنَّ هَذَا مُحَمَّدٌ رَسُولِي وَ أَنَّ هَذَا عَلِيٌّ أَمِيرُ الْمُؤْمِنِينَ قَالُوا بَلَى فَثَبَتَتْ لَهُمُ النُّبُوَّةُ",
          "وَ أَخَذَ الْمِيثَاقَ عَلَى أُولِي الْعَزْمِ أَنَّنِي رَبُّكُمْ وَ مُحَمَّدٌ رَسُولِي وَ عَلِيٌّ أَمِيرُ الْمُؤْمِنِينَ وَ أَوْصِيَاؤُهُ مِنْ بَعْدِهِ وُلَاةُ أَمْرِي وَ خُزَّانُ عِلْمِي ( عليهم السلام ) وَ أَنَّ الْمَهْدِيَّ أَنْتَصِرُ بِهِ لِدِينِي وَ أُظْهِرُ بِهِ دَوْلَتِي وَ أَنْتَقِمُ بِهِ مِنْ أَعْدَائِي وَ أُعْبَدُ بِهِ طَوْعاً وَ كَرْهاً",
          "قَالُوا أَقْرَرْنَا يَا رَبِّ وَ شَهِدْنَا وَ لَمْ يَجْحَدْ آدَمُ وَ لَمْ يُقِرَّ فَثَبَتَتِ الْعَزِيمَةُ لِهَؤُلَاءِ الْخَمْسَةِ فِي الْمَهْدِيِّ وَ لَمْ يَكُنْ لآِدَمَ عَزْمٌ عَلَى الْإِقْرَارِ بِهِ وَ هُوَ قَوْلُهُ عَزَّ وَ جَلَّ وَ لَقَدْ عَهِدْنا إِلى آدَمَ مِنْ قَبْلُ فَنَسِيَ وَ لَمْ نَجِدْ لَهُ عَزْماً ",
          "قَالَ إِنَّمَا هُوَ فَتَرَكَ ثُمَّ أَمَرَ نَاراً فَأُجِّجَتْ فَقَالَ لِأَصْحَابِ الشِّمَالِ ادْخُلُوهَا فَهَابُوهَا وَ قَالَ لِأَصْحَابِ الْيَمِينِ ادْخُلُوهَا فَدَخَلُوهَا فَكَانَتْ عَلَيْهِمْ بَرْداً وَ سَلَاماً فَقَالَ أَصْحَابُ الشِّمَالِ يَا رَبِّ أَقِلْنَا فَقَالَ قَدْ أَقَلْتُكُمُ اذْهَبُوا فَادْخُلُوا فَهَابُوهَا فَثَمَّ ثَبَتَتِ الطَّاعَةُ وَ الْوَلَايَةُ وَ الْمَعْصِيَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Dawood Al Ijaly, from Zurara, from Humran, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When Allah<sup>azwj</sup> Blessed and High Created the creation, Created the sweet water and salty bitter water. So He<sup>azwj</sup> Blended the two waters, and Grabbed clay from the crust of the earth and Kneaded it with an intense Kneading. So He<sup>azwj</sup> Said to the companions of the right, and they were like the crawling particles: “To the Paradise in peace!”, and Said to the companions of the left: “To the Fire, and I<sup>azwj</sup> don’t Care”.",
            "Then He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:7#h172\">[7:172]</a> Am I not your Lord? They said: Yes! We testify. Lest you should say on the Day of Judgement: Surely we were heedless of this</span>. Then He<sup>azwj</sup> Took the Covenant upon the Prophets<sup>as</sup>, so He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:7#h172\">[7:172]</a> Am I not your Lord? </span>And that this is Muhammad<sup>saww</sup>, My<sup>azwj</sup> Rasool<sup>saww</sup>, and that this is Ali<sup>asws</sup> Amir Al-Momineen<sup>asws</sup>?’ <span class=\"ibTxt\">They said: Yes! We testify</span>. So the Prophet-hood was Affirmed for them<sup>as</sup>. ",
            "And He<sup>azwj</sup> Took the Covenant upon the Determined Ones (<span class=\"iTxt\">Ul Al-Azam</span>) (from the Prophets<sup>as</sup>): “I<sup>azwj</sup> am your<sup>as</sup> Lord<sup>azwj</sup>, and that this Muhammad<sup>saww</sup> is My<sup>azwj</sup> Rasool<sup>saww</sup>, and Ali<sup>asws</sup> is Amir Al-Momineen<sup>asws</sup> and the successors<sup>asws</sup> from after him<sup>saww</sup> are the Masters of My<sup>azwj</sup> Command and Treasurers of My<sup>azwj</sup> Knowledge, and that Al-Mahdi<sup>asws</sup>, I<sup>azwj</sup> Shall Grant victory to My<sup>azwj</sup> Religion through him<sup>asws</sup>, and Manifest My<sup>azwj</sup> Government through him<sup>asws</sup>, and Exact revenge from My<sup>azwj</sup> enemies through him<sup>asws</sup>, and I<sup>azwj</sup> shall be worshipped willingly and unwillingly through him<sup>asws</sup>”. ",
            "They<sup>as</sup> said: ‘We<sup>asws</sup> acknowledge, O Lord<sup>azwj</sup>, and we testify’. And Adam<sup>as</sup> neither denied nor acknowledged. Thus, the Determination was affirmed for these five regarding Al-Mahdi<sup>asws</sup>, and Adam<sup>as</sup> did not become a Determined One (<span class=\"iTxt\">Ul Al-Azam</span>) upon the acknowledgement of him<sup>asws</sup>, and these are the Words of the Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:20#h115\">[20:115]</a> And We had Given a Covenant to Adam before, but he forgot; and We did not find determination in him</span>’.",
            "He<sup style=\"font-weight: normal\">asws</sup> said: ‘But rather, he<sup style=\"font-weight: normal\">as</sup> was left out. Then He<sup style=\"font-weight: normal\">azwj</sup> Commanded the Fire, so it inflamed, and He<sup style=\"font-weight: normal\">azwj</sup> Said to the companions of the left: “Enter into it”, But they were terrified of it. And He<sup style=\"font-weight: normal\">azwj</sup> Said to the companions of the right: “Enter into it”. So they entered into it, and it was cold and safe upon them. So the comanions of the left said, ‘O Lord<sup style=\"font-weight: normal\">azwj</sup>! Forgive us’. So He<sup style=\"font-weight: normal\">azwj</sup> Said: “I<sup style=\"font-weight: normal\">azwj</sup> Forgive you, so enter into it”. But, they were terrified of it. Thus, with this obedience, the <span class=\"iTxt\">Wilayah</span>, and the disobedience (to <span class=\"iTxt\">Wilayah</span>) came to take place’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Dawud al-’Ijli from Zurara from Humran from abu Ja’far (a.s.) who has said the following: “Abu Ja’far (a.s.) has said, ‘As Allah, the Most Holy the Most High, created the creation. He created sweet water and a very salty water and then mixed the two together. Then He took a (kind of) clay from the surface of the earth and kneaded it intensely. He then said to the people of the right, as they crawled about like particles, “To paradise (you go) in peace.” He then said to the people of the left hand, “To the fire (you go) and I am not concerned.” Then He asked, “Am I not your Lord?” They all said, “Yes, You are our Lord we testify.” Allah said, “I make you to witness this) so that on the Day of Judgment you will not say, ‘We were unaware of this.’” <a href=\"/#/books/quran:7#h172\">[7:172]</a> ‘Then He made the prophets to form the covenant. He asked them, “Am 1 not your Lord and is not this Muhammad, My messenger and is not this Ali, the commander of the believers?” They said, “Yes, it is just as You said.” This established their prophethood. He then made the ‘Ulu al-’Azm messengers to testify and acknowledge this fact: “I am your Lord, Muhammad is My messenger, Ali is the commander of the believers and his successors, recipients of divine supreme covenant, after him are people who possess My Authority and are the reservoir of My knowledge. That al-Mahdi (a.s.) is one whom I will make to lend support to My religion. Through him I will establish My kingdom on earth and make My enemies to face justice for their crimes. Through him I will make them to worship Me willingly or otherwise.” The prophets altogether said, “Yes, Lord we testify to these facts and bear witness.” Adam did not refuse and did not affirm (verbally) the fact about al-Mahdi (a.s.) so he was not included in the group of five ‘Ulu al-’Azm messengers of Allah. Adam did not have the resolve to affirm the facts about al-Mahdi, recipient of divine supreme covenant. Allah, the Majestic, the Glorious, has said in the Holy Quran, “We had made a covenant with Adam before but he forgot all about it and we did not find in him a firm resolve.” <a href=\"/#/books/quran:20#h115\">[20:115]</a> He said that it was so but he ignored it. He then created a fire that blazed and told the people of the left hand to enter in the fire. They were afraid thereby. He said to the people of the right hand, “Enter in the fire.” They entered in the fire and it was cool and peaceful to them. The people of the left hand then said, “Lord, forgive us and reduce our sins.” The Lord said, “I have forgiven you but you must go in the fire.” They were afraid. Thus, with this the obedience, authority and disobedience came to take place.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/24)"
        ],
        "index": 1453,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/110",
              "text": "هِشَامِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1037",
              "text": "حَبِيبٍ السِّجِسْتَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ حَبِيبٍ السِّجِسْتَانِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:3:2",
        "text": [
          " سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ إِنَّ اللَّهَ عَزَّ وَ جَلَّ لَمَّا أَخْرَجَ ذُرِّيَّةَ آدَمَ ( عليه السلام ) مِنْ ظَهْرِهِ لِيَأْخُذَ عَلَيْهِمُ الْمِيثَاقَ بِالرُّبُوبِيَّةِ لَهُ وَ بِالنُّبُوَّةِ لِكُلِّ نَبِيٍّ فَكَانَ أَوَّلَ مَنْ أَخَذَ لَهُ عَلَيْهِمُ الْمِيثَاقَ بِنُبُوَّتِهِ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ ( صلى الله عليه وآله )",
          "ثُمَّ قَالَ اللَّهُ عَزَّ وَ جَلَّ لآِدَمَ انْظُرْ مَا ذَا تَرَى قَالَ فَنَظَرَ آدَمُ ( عليه السلام ) إِلَى ذُرِّيَّتِهِ وَ هُمْ ذَرٌّ قَدْ مَلَئُوا السَّمَاءَ قَالَ آدَمُ ( عليه السلام ) يَا رَبِّ مَا أَكْثَرَ ذُرِّيَّتِي وَ لِأَمْرٍ مَا خَلَقْتَهُمْ فَمَا تُرِيدُ مِنْهُمْ بِأَخْذِكَ الْمِيثَاقَ عَلَيْهِمْ قَالَ اللَّهُ عَزَّ وَ جَلَّ يَعْبُدُونَنِي لَا يُشْرِكُونَ بِي شَيْئاً وَ يُؤْمِنُونَ بِرُسُلِي وَ يَتَّبِعُونَهُم",
          "قَالَ آدَمُ ( عليه السلام ) يَا رَبِّ فَمَا لِي أَرَى بَعْضَ الذَّرِّ أَعْظَمَ مِنْ بَعْضٍ وَ بَعْضَهُمْ لَهُ نُورٌ كَثِيرٌ وَ بَعْضَهُمْ لَهُ نُورٌ قَلِيلٌ وَ بَعْضَهُمْ لَيْسَ لَهُ نُورٌ فَقَالَ اللَّهُ عَزَّ وَ جَلَّ كَذَلِكَ خَلَقْتُهُمْ لِأَبْلُوَهُمْ فِي كُلِّ حَالَاتِهِمْ",
          "قَالَ آدَمُ ( عليه السلام ) يَا رَبِّ فَتَأْذَنُ لِي فِي الْكَلَامِ فَأَتَكَلَّمَ قَالَ اللَّهُ عَزَّ وَ جَلَّ تَكَلَّمْ فَإِنَّ رُوحَكَ مِنْ رُوحِي وَ طَبِيعَتَكَ [مِنْ] خِلَافِ كَيْنُونَتِي قَالَ آدَمُ يَا رَبِّ فَلَوْ كُنْتَ خَلَقْتَهُمْ عَلَى مِثَالٍ وَاحِدٍ وَ قَدْرٍ وَاحِدٍ وَ طَبِيعَةٍ وَاحِدَةٍ وَ جِبِلَّةٍ وَاحِدَةً وَ أَلْوَانٍ وَاحِدَةٍ وَ أَعْمَارٍ وَاحِدَةٍ وَ أَرْزَاقٍ سَوَاءٍ لَمْ يَبْغِ بَعْضُهُمْ عَلَى بَعْضٍ وَ لَمْ يَكُنْ بَيْنَهُمْ تَحَاسُدٌ وَ لَا تَبَاغُضٌ وَ لَا اخْتِلَافٌ فِي شَيْ‏ءٍ مِنَ الْأَشْيَاءِ",
          "قَالَ اللَّهُ عَزَّ وَ جَلَّ يَا آدَمُ بِرُوحِي نَطَقْتَ وَ بِضَعْفِ طَبِيعَتِكَ تَكَلَّفْتَ مَا لَا عِلْمَ لَكَ بِهِ وَ أَنَا الْخَالِقُ الْعَالِمُ بِعِلْمِي خَالَفْتُ بَيْنَ خَلْقِهِمْ وَ بِمَشِيئَتِي يَمْضِي فِيهِمْ أَمْرِي وَ إِلَى تَدْبِيرِي وَ تَقْدِيرِي صَائِرُونَ لَا تَبْدِيلَ لِخَلْقِي",
          "إِنَّمَا خَلَقْتُ الْجِنَّ وَ الْإِنْسَ لِيَعْبُدُونِ وَ خَلَقْتُ الْجَنَّةَ لِمَنْ أَطَاعَنِي وَ عَبَدَنِي مِنْهُمْ وَ اتَّبَعَ رُسُلِي وَ لَا أُبَالِي وَ خَلَقْتُ النَّارَ لِمَنْ كَفَرَ بِي وَ عَصَانِي وَ لَمْ يَتَّبِعْ رُسُلِي وَ لَا أُبَالِي",
          "وَ خَلَقْتُكَ وَ خَلَقْتُ ذُرِّيَّتَكَ مِنْ غَيْرِ فَاقَةٍ بِي إِلَيْكَ وَ إِلَيْهِمْ وَ إِنَّمَا خَلَقْتُكَ وَ خَلَقْتُهُمْ لِأَبْلُوَكَ وَ أَبْلُوَهُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا فِي دَارِ الدُّنْيَا فِي حَيَاتِكُمْ وَ قَبْلَ مَمَاتِكُمْ فَلِذَلِكَ خَلَقْتُ الدُّنْيَا وَ الْآخِرَةَ وَ الْحَيَاةَ وَ الْمَوْتَ وَ الطَّاعَةَ وَ الْمَعْصِيَةَ وَ الْجَنَّةَ وَ النَّارَ",
          "وَ كَذَلِكَ أَرَدْتُ فِي تَقْدِيرِي وَ تَدْبِيرِي وَ بِعِلْمِيَ النَّافِذِ فِيهِمْ خَالَفْتُ بَيْنَ صُوَرِهِمْ وَ أَجْسَامِهِمْ وَ أَلْوَانِهِمْ وَ أَعْمَارِهِمْ وَ أَرْزَاقِهِمْ وَ طَاعَتِهِمْ وَ مَعْصِيَتِهِمْ فَجَعَلْتُ مِنْهُمُ الشَّقِيَّ وَ السَّعِيدَ وَ الْبَصِيرَ وَ الْأَعْمَى وَ الْقَصِيرَ وَ الطَّوِيلَ وَ الْجَمِيلَ وَ الدَّمِيمَ وَ الْعَالِمَ وَ الْجَاهِلَ وَ الْغَنِيَّ وَ الْفَقِيرَ وَ الْمُطِيعَ وَ الْعَاصِيَ وَ الصَّحِيحَ وَ السَّقِيمَ وَ مَنْ بِهِ الزَّمَانَةُ وَ مَنْ لَا عَاهَةَ بِهِ",
          "فَيَنْظُرُ الصَّحِيحُ إِلَى الَّذِي بِهِ الْعَاهَةُ فَيَحْمَدُنِي عَلَى عَافِيَتِهِ وَ يَنْظُرُ الَّذِي بِهِ الْعَاهَةُ إِلَى الصَّحِيحِ فَيَدْعُونِي وَ يَسْأَلُنِي أَنْ أُعَافِيَهُ وَ يَصْبِرُ عَلَى بَلَائِي فَأُثِيبُهُ جَزِيلَ عَطَائِي وَ يَنْظُرُ الْغَنِيُّ إِلَى الْفَقِيرِ فَيَحْمَدُنِي وَ يَشْكُرُنِي وَ يَنْظُرُ الْفَقِيرُ إِلَى الْغَنِيِّ فَيَدْعُونِي وَ يَسْأَلُنِي وَ يَنْظُرُ الْمُؤْمِنُ إِلَى الْكَافِرِ فَيَحْمَدُنِي عَلَى مَا هَدَيْتُهُ ",
          "فَلِذَلِكَ خَلَقْتُهُمْ لِأَبْلُوَهُمْ فِي السَّرَّاءِ وَ الضَّرَّاءِ وَ فِيمَا أُعَافِيهِمْ وَ فِيمَا أَبْتَلِيهِمْ وَ فِيمَا أُعْطِيهِمْ وَ فِيمَا أَمْنَعُهُمْ وَ أَنَا اللَّهُ الْمَلِكُ الْقَادِرُ وَ لِي أَنْ أَمْضِيَ جَمِيعَ مَا قَدَّرْتُ عَلَى مَا دَبَّرْتُ وَ لِي أَنْ أُغَيِّرَ مِنْ ذَلِكَ مَا شِئْتُ إِلَى مَا شِئْتُ وَ أُقَدِّمَ مِنْ ذَلِكَ مَا أَخَّرْتُ وَ أُؤَخِّرَ مِنْ ذَلِكَ مَا قَدَّمْتُ وَ أَنَا اللَّهُ الْفَعَّالُ لِمَا أُرِيدُ لَا أُسْأَلُ عَمَّا أَفْعَلُ وَ أَنَا أَسْأَلُ خَلْقِي عَمَّا هُمْ فَاعِلُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, and Ali Bin Ibrahim, from his father, from Al Hassan Bin Mahboub, from Hisham Bin Salim, from Habeeb Al Sijistany who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘Allah<sup>azwj</sup> Mighty and Majestic. When He<sup>azwj</sup> Extracted the offspring of Adam<sup>as</sup> from his<sup>as</sup> back in order to Take the Covenant with the Lordship for Himself<sup>azwj</sup>, and with the Prophet-hood for every Prohet<sup>as</sup>, so the first one He<sup>azwj</sup> Took the Covenant for Himself<sup>azwj</sup> upon him with his<sup>saww</sup> Prophet-hood was Muhammad Bin Abdullah<sup>saww</sup>.",
            "Then Allah<sup>azwj</sup> Mighty and Majestic Said to Adam<sup>as</sup>: “Look! What do you<sup>as</sup> see?” He<sup>asws</sup> said: ‘So Adam<sup>as</sup> looked at his<sup>as</sup> children, and they were particles which had filled up the sky. Adam<sup>as</sup> said: ‘O Lord<sup>azwj</sup>! How abundant are my<sup>as</sup> children and for what matter have You<sup>azwj</sup> Created them? So what do You<sup>azwj</sup> Want from them by Taking the Covenant upon them?’ Allah<sup>azwj</sup> Mighty and Majestic Said: “For them to be worshipping Me<sup>azwj</sup> not associating anything with Me<sup>azwj</sup>, and believing in My<sup>azwj</sup> Rasools<sup>as</sup> and following them<sup>as</sup>”.",
            "Adam<sup>as</sup> said: ‘O Lord<sup>azwj</sup>! So what is the matter I<sup>as</sup> see some of the particles to be greater than the others, and some of them have a lot of light for them, and some of them are of little light, and some of them have no light for them?’ So Allah<sup>azwj</sup> Mighty and Majestic Said: “Like that is how I<sup>azwj</sup> Created them in order to Try them in all their states”.",
            "Adam<sup>as</sup> said: ‘O Lord<sup>azwj</sup>! So, could You<sup>azwj</sup> Permit me<sup>as</sup> regarding the speech, so I<sup>as</sup> can speak (to them)?’ Allah<sup>azwj</sup> Mighty and Majestic Said: “Speak, for your<sup>as</sup> spirit is from My<sup>azwj</sup> Spirit, but your<sup>azwj</sup> nature is different from My<sup>azwj</sup> Being”. Adam<sup>as</sup> said: ‘O Lord<sup>azwj</sup>! If only You<sup>azwj</sup> had Created them upon one likeness, and of one measurement, and of one clay, and of one constitution, and of one colour, and of one age, and with the equal sustenance, some of them would not rebel against the others, and there would neither happen to be between them any envy, or hatred, or differing with regards to anything from the things’.",
            "Allah<sup>azwj</sup> Mighty and Majestic Said: “O Adam<sup>as</sup>! By My<sup>azwj</sup> Spirit you<sup>as</sup> speak, and by the weakness is in your<sup>as</sup> nature you<sup>as</sup> made the effort on what there is no knowledge for you<sup>as</sup> in it, and I<sup>azwj</sup> am the Creator, the Knowledgeable. With My<sup>azwj</sup> Knowledge I<sup>azwj</sup> Caused the difference in their Creation, and by My<sup>azwj</sup> Desire do I<sup>azwj</sup> Ordain My<sup>azwj</sup> Command among them, and to My<sup>azwj</sup> Management and My<sup>azwj</sup> Ordainment are they coming into being, there being no alteration in My<sup>azwj</sup> Creation.",
            "But rather, I<sup>azwj</sup> Created the Jinn and the human beings for them to be worshipping Me<sup>azwj</sup>, and I<sup>azwj</sup> Created the Paradise for the one who obeys Me<sup>azwj</sup> and worships Me<sup>azwj</sup> from them, and follows My<sup>azwj</sup> Rasools<sup>as</sup>, and I<sup>azwj</sup> do not Retract; and I<sup>azwj</sup> Created the Fire for the one who disbelieve in Me<sup>azwj</sup>, and disobeys Me<sup>azwj</sup>, and does not follow My<sup>azwj</sup> Rasools<sup>as</sup>, and I<sup>azwj</sup> do not Retract.",
            "And I<sup>azwj</sup> Created you<sup>as</sup> and your<sup>as</sup> offspring from without a need of Mine to you<sup>as</sup> and to them, and rather I<sup>azwj</sup> Created you<sup>as</sup> and Created them in order to Test you<sup>as</sup> and Test them, which ones of you is best of deeds in the house of the world during your lifetime and before your deaths. Thus, for that I<sup>azwj</sup> Created the world and the Hereafter, and the life and the death, and the obedience and the disobedience, and the Paradise and the Fire. ",
            "And like that, I<sup>azwj</sup> Intended in My<sup>azwj</sup> Ordainment and My<sup>azwj</sup> Management, and with My<sup>azwj</sup> Knowledge, the Implementation among them of the difference between their chests (consciences), and their bodies, and their colours, and their ages, and their sustenance, and their obedience, and their disobedience. So I<sup>azwj</sup> Made from them, the miserable, and the fortunate, and the seeing and the blind, and the short and the long, and the beautiful and the ugly, and the knowledgeable and the ignorant, and the rich and the poor, and the obedient and the disobedient, and the healthy and the sick, and the one with disabilities and the one with no handicap with him.",
            "So the healthy would look at the one with the disability and he would Praise Me<sup style=\"font-weight: normal\">azwj</sup>; and the one with the disability would look at the healthy and he would supplicate to Me<sup style=\"font-weight: normal\">azwj</sup> and ask Me<sup style=\"font-weight: normal\">azwj</sup> for his good health and be patient upon My<sup style=\"font-weight: normal\">azwj</sup> Affliction, so I<sup style=\"font-weight: normal\">azwj</sup> would Grant him a lot of My<sup style=\"font-weight: normal\">azwj</sup> Grants. And the rich would look at the poor and he would Praise Me<sup style=\"font-weight: normal\">azwj</sup> and thank Me<sup style=\"font-weight: normal\">azwj</sup>, and the poor would look at the rich and would suplicate to me and ask Me<sup style=\"font-weight: normal\">azwj</sup>. And the Believer would look at the disbeliever and he would Praise Me<sup style=\"font-weight: normal\">azwj</sup> upon what I<sup style=\"font-weight: normal\">azwj</sup> Guided him.",
            "Thus, it is for that I<sup style=\"font-weight: normal\">azwj</sup> Created them in order to Test them during the ease and adversity, and regarding what I<sup style=\"font-weight: normal\">azwj</sup> Grant them good health and regarding what I<sup style=\"font-weight: normal\">azwj</sup> Test them, and regarding what I<sup style=\"font-weight: normal\">azwj</sup> Give them and regarding what I<sup style=\"font-weight: normal\">azwj</sup> Prevent them from; and I<sup style=\"font-weight: normal\">azwj</sup> am Allah<sup style=\"font-weight: normal\">azwj</sup>, the King, the Powerful, and for Me<sup style=\"font-weight: normal\">azwj</sup> is that I<sup style=\"font-weight: normal\">azwj</sup> Implement the entirety of what I<sup style=\"font-weight: normal\">azwj</sup> Ordain, and for Me<sup style=\"font-weight: normal\">azwj</sup> is that I<sup style=\"font-weight: normal\">azwj</sup> Change from that whatever I<sup style=\"font-weight: normal\">azwj</sup> so Desire to whatever I<sup style=\"font-weight: normal\">azwj</sup> so Desire, and I<sup style=\"font-weight: normal\">azwj</sup> Bring forward from that whatever I<sup style=\"font-weight: normal\">azwj</sup> had Delayed, and Delay what I<sup style=\"font-weight: normal\">azwj</sup> had Brought forward, and I<sup style=\"font-weight: normal\">azwj</sup> am Allah<sup style=\"font-weight: normal\">azwj</sup>. I<sup style=\"font-weight: normal\">azwj</sup> Do whatever I<sup style=\"font-weight: normal\">azwj</sup> Want. I<sup style=\"font-weight: normal\">azwj</sup> will not be questioned about what I<sup style=\"font-weight: normal\">azwj</sup> Do, and I<sup style=\"font-weight: normal\">azwj</sup> will be Questioning My<sup style=\"font-weight: normal\">azwj</sup> creatures about what they are doing”’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad and Ali ibn Ibrahim has narrated from his father from al-Hassan ibn Mahbub from Hisham ibn Salim from Habib al-Sajistani who has said the following: “I heard abu Ja’far (a.s.) saying, ‘There was a time when Allah, the Majestic, the Glorious, took the descendents of Adam from his back to establish a covenant with them to testify that He is their Lord and to believe in the prophethood of all the prophets. The first among the prophets whose prophethood Allah wanted them to accept through a covenant was Muhammad ibn ‘Abd Allah, recipient of divine supreme covenant. Allah, the Majestic, the Glorious, then said to Adam, “Look (to find) what you can see.” ‘The Imam then said, “Adam then looked and saw his descendents appearing as small particles that filled the sky. Adam then said, ‘Lord, how huge in number my descendents are! For what purpose have You created them and for what reason did You make them to establish a covenant with You?’” Allah, the Majestic, the Glorious, replied, “So that they worship Me and do not consider anything else as My equal and so that they believe in My messengers and follow them (for guidance).” Adam then asked, “Lord, why is it that I see certain ones of the particles are greater, others have a great deal of lights, yet others among them have very little light and still others among them have no lights at all?” Allah, the Majestic, the Glorious, replied, “Thus, I have created them to place them to test in every condition that they will live.” Adam then asked, “My Lord, will You grant me permission to speak so I may express myself?” Allah, the Majestic the Glorious said, “Speak up; your spirit is from My spirit but your nature is different from My being.” Adam then asked, “Lord, had You created them all just like each other, by the same measure, the same nature, of likewise design, of the same color, of equal life span, of equal amount of means of living they would not act against each other. No jealousy, animosity and differences would exist among them over anything.” Allah, the Majestic, the Glorious, said, “O Adam, through My spirit you just spoke and due to the weakness of your nature you made an effort to give an opinion about that of which you have no knowledge. I Am the Creator of the world. I knowingly have created each one different from the others and through My Own way I will make My commands to take effect and they will continue existing through My plans and measures. There will be no changes in My creation. I have created the Jinn and human beings only to worship Me. I have created paradise for those who obey and worship Me and follow My messengers. I have no regrets in what 1 have done. I have created the fire for those who disbelieve, disobey Me and do not follow My messengers and I have no regrets in it. I have created you and your descendents not because I ever need you or your descendents in anyway or form. I have created you and created them to test you and test them to see which ones among you do good deeds in the worldly life before your deaths. For this reason I have created the world and the life thereafter, life, death, obedience, disobedience, paradise and the fire. This is how I willed in My measure and plan. Through My all-pervasive knowledge in them I have placed differences in their forms, bodies, colors, lifespan, means of living, obedience and disobedience. I, thus, have made certain ones of them to be unfortunate or very fortunate. Certain ones among them will have eyesight or be blind, others among them will be of short size or tall ones, beautiful or otherwise, knowledgeable or ignorant, wealthy or poor, obedient or disobedient, of good health or suffering from illness, of defective bodies or free of bodily defects. In this way those of perfect bodies will look at the defective ones and thank Me for the perfect body that 1 have given them and those with defective bodies will look at the perfect ones and will pray to Me and ask Me to grant them good health and exercise patience when and in the way I test them. Thus, I will grant them good rewards. The wealthy ones after looking to the poor ones will thank Me and appreciate My favors. When the poor ones look to the wealthy ones they pray to Me and ask Me favors. It is as such so that the believers will look to the unbelievers and thank Me for the guidance that I have granted them. For such reasons I have created them. I test them in ease and in hardships and in good health that I grant them and in the matters with which I test them, in the matters of what I grant them and in the matters that 1 refuse them. I am Allah, the powerful King. It is all up to Me to allow all of My measures and plans to take form or change them as I wish to the time that I wish. I may change the sequel of the timing of my measures and plans and allow, that which comes first to come last and vice versa. I am Allah, and I execute whatever I will. I am not questioned for whatever I do but 1 question My creatures about their deeds.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (30/ 7)"
        ],
        "index": 1454,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/104",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/339",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1166",
              "text": "صَالِحِ بْنِ عُقْبَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1228",
              "text": "عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ الْجُعْفِيِّ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1400",
              "text": "عُقْبَةَ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ الْجُعْفِيِّ وَ عُقْبَةَ جَمِيعاً عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:3:3",
        "relations": {
          "Mentions": [
            "/books/quran:43:87",
            "/books/quran:31:25",
            "/books/quran:7:101",
            "/books/quran:10:74"
          ]
        },
        "text": [
          " إِنَّ اللَّهَ عَزَّ وَ جَلَّ خَلَقَ الْخَلْقَ فَخَلَقَ مَنْ أَحَبَّ مِمَّا أَحَبَّ وَ كَانَ مَا أَحَبَّ أَنْ خَلَقَهُ مِنْ طِينَةِ الْجَنَّةِ وَ خَلَقَ مَنْ أَبْغَضَ مِمَّا أَبْغَضَ وَ كَانَ مَا أَبْغَضَ أَنْ خَلَقَهُ مِنْ طِينَةِ النَّارِ ثُمَّ بَعَثَهُمْ فِي الظِّلَالِ فَقُلْتُ وَ أَيُّ شَيْ‏ءٍ الظِّلَالُ فَقَالَ أَ لَمْ تَرَ إِلَى ظِلِّكَ فِي الشَّمْسِ شَيْئاً وَ لَيْسَ بِشَيْ‏ءٍ ",
          "ثُمَّ بَعَثَ مِنْهُمُ النَّبِيِّينَ فَدَعَوْهُمْ إِلَى الْإِقْرَارِ بِاللَّهِ عَزَّ وَ جَلَّ وَ هُوَ قَوْلُهُ عَزَّ وَ جَلَّ وَ لَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَهُمْ لَيَقُولُنَّ اللَّهُ ثُمَّ دَعَوْهُمْ إِلَى الْإِقْرَارِ بِالنَّبِيِّينَ فَأَقَرَّ بَعْضُهُمْ وَ أَنْكَرَ بَعْضٌ ثُمَّ دَعَوْهُمْ إِلَى وَلَايَتِنَا فَأَقَرَّ بِهَا وَ اللَّهِ مَنْ أَحَبَّ وَ أَنْكَرَهَا مَنْ أَبْغَضَ وَ هُوَ قَوْلُهُ فَما كانُوا لِيُؤْمِنُوا بِما كَذَّبُوا بِهِ مِنْ قَبْلُ ثُمَّ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) كَانَ التَّكْذِيبُ ثَمَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail, from Salih Bin Uqba, from Abdullah Bin Muhammad Al Juf’y, and Uqba altogether, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Created the creatures. So He<sup>azwj</sup> Created the ones He<sup>azwj</sup> Loved from what He<sup>azwj</sup> Loved, and whatever He<sup>azwj</sup> Loved He<sup>azwj</sup>, Created it from the clay of the Paradise; and He<sup>azwj</sup> Created the ones He<sup>azwj</sup> Hated from what He<sup>azwj</sup> Hated, and whatever He<sup>azwj</sup> Hated, Created it from the clay of the Fire. Then He<sup>azwj</sup> Sent them into the shadows’. So I said, ‘And which thing is the shadow?’ So he<sup>asws</sup> said: ‘Do you not see your own shadow in the sunshine? It is something, but is not a thing’. ",
            "Then He<sup>azwj</sup> Sent Prophets<sup>as</sup> from them, and they<sup>as</sup> invited them to the acknowledgment in Allah<sup>azwj</sup> Mighty and Majestic, and these are the Words of the Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:43#h87\">[43:87]</a> And if you should ask them who created them, they would certainly say: Allah</span>. Then He<sup>azwj</sup> Invited them to the acknowledgement in the Prophets<sup>as</sup>. So some of them acknowledged, and some denied. Then He<sup>azwj</sup> Invited them to our<sup>asws</sup> <span class=\"iTxt\">Wilayah</span>, So he acknowledge in it, By Allah<sup>azwj</sup>, the one whom He<sup>azwj</sup> Loved, and he denied it, the one whom He<sup>azwj</sup> Hated, and these are His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:10#h74\">[10:74]</a> but they were not going to believe in what they had belied in beforehand</span>’. Then Abu Ja’far<sup>asws</sup> said: ‘The belying (in us<sup>asws</sup>) was (from) then’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn ‘Isma’il from Salih ibn ‘Aqaba from ‘Abd Allah ibn Muhammad al-Ju’fi and ‘Aqaba together from abu Ja’far (a.s.) who has said the following: “Allah, the Majestic, the Glorious, created the creation. He created His most beloved ones from that which He loved most. What was most beloved to Him was the fact that he created His most beloved ones from the clay of paradise. He created those whom He hated most from that which he hated most. What was most hated to Him was the fact that he created from the clay of the fire and then sent them to the shadows. I asked him, ‘What are the shadows?’ He replied, ‘Have you not seen your own shadow in a sunny day that looks like a thing but is nothing? Allah then raised from them the prophets who called them to believe in Allah, the Majestic, the Glorious, as mentioned in His, words, “When you ask them who has created them they will say, ‘Allah.” <a href=\"/#/books/quran:31#h25\">[31:25]</a> He then called them to express their belief in the prophets. Some expressed their belief as such and others among them did not do so. He then called them to express their (Wala’) belief and support to us (A hi al-Bayt). I swear by Allah, those whom He loved expressed their belief that we were the people who possess Divine Authority and only those whom He hated refused to express such beliefs as it is said in the following verse of the Holy Quran. “They do not express faith in what they before had refused to have faith in.’” <a href=\"/#/books/quran:7#h101\">[7:101]</a> Abu Ja’far (a.s.) then said, ‘Rejection (to have faith in us) was then.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:3",
  "kind": "verse_list"
}