{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 31"
        },
        "path": "/books/al-kafi:2:1:31",
        "titles": {
          "ar": "بَابُ الرِّضَا بِالْقَضَاءِ",
          "en": "Chapter 31 – Satisfaction with the Judgement (of Allah<sup>azwj</sup>)"
        }
      }
    ],
    "index": 219,
    "local_index": 31,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 32"
        },
        "path": "/books/al-kafi:2:1:32",
        "titles": {
          "ar": "بَابُ التَّفْوِيضِ إِلَى اللَّهِ وَ التَّوَكُّلِ عَلَيْهِ",
          "en": "Chapter 32 – The delegating (of matters) to Allah<sup>azwj</sup> and the reliance upon Him<sup>azwj</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 30"
        },
        "path": "/books/al-kafi:2:1:30",
        "titles": {
          "ar": "بَابُ فَضْلِ الْيَقِينِ",
          "en": "Chapter 30 – Superiority of the conviction"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:31",
    "titles": {
      "ar": "بَابُ الرِّضَا بِالْقَضَاءِ",
      "en": "Chapter 31 – Satisfaction with the Judgement (of Allah<sup>azwj</sup>)"
    },
    "verse_count": 13,
    "verse_start_index": 1570,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/ 8)"
        ],
        "index": 1571,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "جَمِيلِ بْنِ صَالِحٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1637",
              "text": "بَعْضِ أَشْيَاخِ بَنِي النَّجَاشِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ بَعْضِ أَشْيَاخِ بَنِي النَّجَاشِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:31:1",
        "text": [
          " رَأْسُ طَاعَةِ اللَّهِ الصَّبْرُ وَ الرِّضَا عَنِ اللَّهِ فِيمَا أَحَبَّ الْعَبْدُ أَوْ كَرِهَ وَ لَا يَرْضَى عَبْدٌ عَنِ اللَّهِ فِيمَا أَحَبَّ أَوْ كَرِهَ إِلَّا كَانَ خَيْراً لَهُ فِيمَا أَحَبَّ أَوْ كَرِهَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu UUmeyr, from Jameel Bin Salih, from one of the Sheykhs of the clan of Al Najjashy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The chief of obedience to Allah<sup>azwj</sup> is the patience and the satisfaction from Allah<sup>azwj</sup> regarding whatever the servant loves or abhors; and a servant would not be satisfied from Allah<sup>azwj</sup> regarding whatever he loves or abhors except it was better for him regarding what He<sup>azwj</sup> Loves or Abhors’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Jamil ibn Salih from certain shaykhs of Banu al-Najashi from abu ‘Abd Allah (a.s.) who has said the following: “The head of obedience to Allah is patience and agreeing with the decisions of Allah in all matters whether a servant may love or dislike doing so. Of the servant of Allah anyone who agrees with the decisions of Allah in all matters which he loves or dislikes, should know that agreeing, in fact, is in his best interest.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/ 8)"
        ],
        "index": 1572,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/460",
              "text": "أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/133",
              "text": "حَمَّادِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/260",
              "text": "عَبْدِ اللَّهِ بْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1638",
              "text": "لَيْثٍ الْمُرَادِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ لَيْثٍ الْمُرَادِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:31:2",
        "text": [
          " إِنَّ أَعْلَمَ النَّاسِ بِاللَّهِ أَرْضَاهُمْ بِقَضَاءِ اللَّهِ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from his father, from Hammad Bin Isa, from Abdullah Bin Muskan, from Lays Al Murady, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The most knowledgeable of the people with Allah<sup>azwj</sup> is the one most satisfied of them with the Judgement of Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn ‘Abd Allah from his father from Hammad ibn ‘Isa from ‘Abd Allah ibn Muskan from Layth al- Muradi from abu ‘Abd Allah (a.s.) who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘The most knowledgeable among people is the one who agrees with the decisions of Allah, the Most Majestic, the Most Holy.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/2)"
        ],
        "index": 1573,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/226",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1639",
              "text": "يَحْيَى بْنِ إِبْرَاهِيمَ بْنِ أَبِي الْبِلَادِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/280",
              "text": "عَاصِمِ بْنِ حُمَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "أَبِي حَمْزَةَ الثُّمَالِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/162",
              "text": "عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَنْهُ عَنْ يَحْيَى بْنِ إِبْرَاهِيمَ بْنِ أَبِي الْبِلَادِ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:31:3",
        "text": [
          " الصَّبْرُ وَ الرِّضَا عَنِ اللَّهِ رَأْسُ طَاعَةِ اللَّهِ وَ مَنْ صَبَرَ وَ رَضِيَ عَنِ اللَّهِ فِيمَا قَضَى عَلَيْهِ فِيمَا أَحَبَّ أَوْ كَرِهَ لَمْ يَقْضِ اللَّهُ عَزَّ وَ جَلَّ لَهُ فِيمَا أَحَبَّ أَوْ كَرِهَ إِلَّا مَا هُوَ خَيْرٌ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Yahya Bin Ibrahim Bin Abu Al Balaad, from Aasim Bin Humeyd, from Abu Hamza Al Sumaly, ",
            "(It has been narrated) from Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> having said: ‘The patience and the satisfaction from Allah<sup>azwj</sup> is the chief of the obedience to Allah<sup>azwj</sup>, and the one who is patient and satisfied from Allah<sup>azwj</sup> regarding whatever has been Judged upon him, with regards to whatever he loves or abhors, Allah<sup>azwj</sup> Mighty and Majestic would not Judge for him regarding whatever he loves or abhors, except what is better for him’."
          ],
          "en.sarwar": [
            "3. It is narrated from him from Yahya ibn Ibrahim ibn abu al-Balad from ‘Asim ibn Humayd from abu Hamza al-Thumali from Ali ibn al-Husayn (a.s.) who has said the following: “Patience and agreeing with the decisions of Allah is the head of obedience to Allah. If one exercises patience and agrees with the decisions of Allah in all the matters which he loves or dislikes, Allah, the Most Majestic, the Most Holy, will not make any decision in any of his affairs which he loves or dislikes but that the decisions are in his best interest.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه صحيح على الظاهر    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/3)"
        ],
        "index": 1574,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/483",
              "text": "دَاوُدَ الرَّقِّيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/160",
              "text": "أَبِي عُبَيْدَةَ الْحَذَّاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ دَاوُدَ الرَّقِّيِّ عَنْ أَبِي عُبَيْدَةَ الْحَذَّاءِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:31:4",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَالَ اللَّهُ عَزَّ وَ جَلَّ إِنَّ مِنْ عِبَادِيَ الْمُؤْمِنِينَ عِبَاداً لَا يَصْلُحُ لَهُمْ أَمْرُ دِينِهِمْ إِلَّا بِالْغِنَى وَ السَّعَةِ وَ الصِّحَّةِ فِي الْبَدَنِ فَأَبْلُوهُمْ بِالْغِنَى وَ السَّعَةِ وَ صِحَّةِ الْبَدَنِ فَيُصْلِحُ عَلَيْهِمْ أَمْرَ دِينِهِمْ",
          "وَ إِنَّ مِنْ عِبَادِيَ الْمُؤْمِنِينَ لَعِبَاداً لَا يَصْلُحُ لَهُمْ أَمْرُ دِينِهِمْ إِلَّا بِالْفَاقَةِ وَ الْمَسْكَنَةِ وَ السُّقْمِ فِي أَبْدَانِهِمْ فَأَبْلُوهُمْ بِالْفَاقَةِ وَ الْمَسْكَنَةِ وَ السُّقْمِ فَيُصْلِحُ عَلَيْهِمْ أَمْرَ دِينِهِمْ وَ أَنَا أَعْلَمُ بِمَا يَصْلُحُ عَلَيْهِ أَمْرُ دِينِ عِبَادِيَ الْمُؤْمِنِينَ",
          "وَ إِنَّ مِنْ عِبَادِيَ الْمُؤْمِنِينَ لَمَنْ يَجْتَهِدُ فِي عِبَادَتِي فَيَقُومُ مِنْ رُقَادِهِ وَ لَذِيذِ وِسَادِهِ فَيَتَهَجَّدُ لِيَ اللَّيَالِيَ فَيُتْعِبُ نَفْسَهُ فِي عِبَادَتِي فَأَضْرِبُهُ بِالنُّعَاسِ اللَّيْلَةَ وَ اللَّيْلَتَيْنِ نَظَراً مِنِّي لَهُ وَ إِبْقَاءً عَلَيْهِ فَيَنَامُ حَتَّى يُصْبِحَ فَيَقُومُ وَ هُوَ مَاقِتٌ لِنَفْسِهِ زَارِئٌ عَلَيْهَا",
          "وَ لَوْ أُخَلِّي بَيْنَهُ وَ بَيْنَ مَا يُرِيدُ مِنْ عِبَادَتِي لَدَخَلَهُ الْعُجْبُ مِنْ ذَلِكَ فَيُصَيِّرُهُ الْعُجْبُ إِلَى الْفِتْنَةِ بِأَعْمَالِهِ فَيَأْتِيهِ مِنْ ذَلِكَ مَا فِيهِ هَلَاكُهُ لِعُجْبِهِ بِأَعْمَالِهِ وَ رِضَاهُ عَنْ نَفْسِهِ حَتَّى يَظُنَّ أَنَّهُ قَدْ فَاقَ الْعَابِدِينَ وَ جَازَ فِي عِبَادَتِهِ حَدَّ التَّقْصِيرِ فَيَتَبَاعَدُ مِنِّي عِنْدَ ذَلِكَ وَ هُوَ يَظُنُّ أَنَّهُ يَتَقَرَّبُ إِلَيَّ",
          "فَلَا يَتَّكِلِ الْعَامِلُونَ عَلَى أَعْمَالِهِمُ الَّتِي يَعْمَلُونَهَا لِثَوَابِي فَإِنَّهُمْ لَوِ اجْتَهَدُوا وَ أَتْعَبُوا أَنْفُسَهُمْ وَ أَفْنَوْا أَعْمَارَهُمْ فِي عِبَادَتِي كَانُوا مُقَصِّرِينَ غَيْرَ بَالِغِينَ فِي عِبَادَتِهِمْ كُنْهَ عِبَادَتِي فِيمَا يَطْلُبُونَ عِنْدِي مِنْ كَرَامَتِي وَ النَّعِيمِ فِي جَنَّاتِي وَ رَفِيعِ دَرَجَاتِيَ الْعُلَى فِي جِوَارِي وَ لَكِنْ فَبِرَحْمَتِي ",
          "فَلْيَثِقُوا وَ بِفَضْلِي فَلْيَفْرَحُوا وَ إِلَى حُسْنِ الظَّنِّ بِي فَلْيَطْمَئِنُّوا فَإِنَّ رَحْمَتِي عِنْدَ ذَلِكَ تَدَارَكُهُمْ وَ مَنِّي يُبَلِّغُهُمْ رِضْوَانِي وَ مَغْفِرَتِي تُلْبِسُهُمْ عَفْوِي فَإِنِّي أَنَا اللَّهُ الرَّحْمَنُ الرَّحِيمُ وَ بِذَلِكَ تَسَمَّيْتُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from Dawood Al Raqqy, from Abu Ubeyda Al Haza’a, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Said: “From My<sup>azwj</sup> believing servants there are servants whose matters of their Religion cannot be correct for them except with the richness and the capacity, and the health in the body. Therefore, I<sup>azwj</sup> Test them with the riches, and the capacity, and the health of the body in order to Correct upon them the matter of their Religion.",
            "And from My<sup>azwj</sup> believing servants are such servants that the matter of their Religion cannot be correct for them except with the destitution, and the poverty, and the sickness in their bodies. Therefore, I<sup>azwj</sup> Test then with the destitution, and the poverty, and the sickness, in order to Correct upon them the matter of their Religion. And I<sup>azwj</sup> am more Knowing with what is correct upon him in the matter of the Religion of My<sup>azwj</sup> believing servant. ",
            "And that, from My<sup>azwj</sup> believing servants is the one who strive in My<sup>azwj</sup> worship. So he is standing from his mattress and the pleasure of his pillow, and he spends the night in praying <span class=\"iTxt\">Salāt</span> to Me<sup>azwj</sup>, thus tiring himself in My<sup>azwj</sup> worship. So I<sup>azwj</sup> Strike him with the drowsiness for the night and the two nights, as a Consideration from Me<sup>azwj</sup> to him, whether he would remain upon it. But he goes to sleep until the morning. Then he arises, and he is disgusted with himself, upset over it. ",
            "And if I<sup>azwj</sup> were to Leave him alone, between him and what he wants from My<sup>azwj</sup> worship, the self-conceit would enter into him due to that, so he would become self-conceited to the strife by his deed, and there would come to him from that what has destruction in it due to his self-conceitedness by his deeds, and satisfaction from himself, until he would think that he has surpassed the (other) worshippers and has exceeded in My<sup>azwj</sup> worship, the limit of deficiency. Thus, he would be remote from Me<sup>azwj</sup> during that, and he would be thinking that he has come nearer to Me<sup>azwj</sup>.",
            "Thus, the workers should not be reliant upon their deeds which they are performing for My<sup style=\"font-weight: normal\">azwj</sup> Rewards. If they were to strive and exhaust themselves and finish off their lifetime in My<sup style=\"font-weight: normal\">azwj</sup> worship, they would be deficient ones without having reach in My<sup style=\"font-weight: normal\">azwj</sup> worship, that which My<sup style=\"font-weight: normal\">azwj</sup> worship should happen to be regarding what they are seeking from My<sup style=\"font-weight: normal\">azwj</sup> Benevolence and the Bounties in My<sup style=\"font-weight: normal\">azwj</sup> Paradise, and the highest of My<sup style=\"font-weight: normal\">azwj</sup> lofty Levels in My<sup style=\"font-weight: normal\">azwj</sup> vicinity, but (they should be relying upon) My<sup style=\"font-weight: normal\">azwj</sup> Mercy.",
            "So let them be trusting in My<sup style=\"font-weight: normal\">azwj</sup> Grace, so let they be happy and have good thoughts with Me<sup style=\"font-weight: normal\">azwj</sup>, for in My<sup style=\"font-weight: normal\">azwj</sup> Mercy would come to them during that, and from Me<sup style=\"font-weight: normal\">azwj</sup>, My<sup style=\"font-weight: normal\">azwj</sup> Pleasure would reach them, and My<sup style=\"font-weight: normal\">azwj</sup> Forgiveness clothing them in My<sup style=\"font-weight: normal\">azwj</sup> Pardoning. So I<sup style=\"font-weight: normal\">azwj</sup>, I<sup style=\"font-weight: normal\">azwj</sup> am Allah<sup style=\"font-weight: normal\">azwj</sup>, the Beneficent, the Merciful, and with that I<sup style=\"font-weight: normal\">azwj</sup> am Named’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn Mahbub from Dawud al-Riqqiy from ‘Ubayda al-Hadhdha’ from abu Ja’far (a.s.) who has said the following: “The Messenger of Allah has said that Allah, the Most Majestic, the Most Holy, has said, ‘Among My believing servants there are those whose religious lives can only be at their best with wealth, comfort and good health. I try them by means of wealth, comfort and good health and this makes their religious affairs to be in the best condition. Also among My believing servants there are those whose religious lives are only at their best with poverty, destitution and ailing health. I try them by means of poverty, destitution and ailing health and this helps their religious lives to be in the best condition. I know what is good for the religious matters of my believing servants. Among My believing servants there are those who strive to worship Me. They wake up from sleep leaving their comfortable pillow for Tahajjud (special prayer at night). They experiences fatigue and I allow slumber overcome them on one or two nights, a trial from Me to see if he continues, he goes to sleep and wakes up upset and angry over his own self. If I allow him to do the way he wants to worship, he may develop a sense of conceit (unwanted pride) that can lead him to mischief in his deeds. This may bring about his destruction. It can so happen due to his happiness with whatever his soul desires. He may begin to feel as if he has excelled all worshippers and has surpassed the limits of defective worship. In so doing he moves away from Me even though he thinks that he is getting closer to Me. Therefore, they must not rely on their good deeds that they do to receive rewards from Me. Even if they strive hard, tire themselves and finish their lives worshipping Me they fall short, in worshipping Me truly, in their quest for My generous rewards, My bounties in paradise and high positions near Me. They must only trust in My mercy, be happy with My generosity and always be hopeful about Me. In such cases My mercy will reach them as well as my approval and forgiveness and my pardon will provide them cover; I am Allah, the Most Beneficent, the Most Merciful, and thus 1 have taken such names.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/6)"
        ],
        "index": 1575,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/251",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/500",
              "text": "صَفْوَانَ الْجَمَّالِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/762",
              "text": "أَبِي الْحَسَنِ الْأَوَّلِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ صَفْوَانَ الْجَمَّالِ عَنْ أَبِي الْحَسَنِ الْأَوَّلِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:31:5",
        "text": [
          " يَنْبَغِي لِمَنْ عَقَلَ عَنِ اللَّهِ أَنْ لَا يَسْتَبْطِئَهُ فِي رِزْقِهِ وَ لَا يَتَّهِمَهُ فِي قَضَائِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad, Bin Abu Nasr, from Safwan Al Jammal, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup> having said: ‘It is befitting for the one who minds about Allah<sup>azwj</sup> that he does not consider Him<sup>azwj</sup> as being slow regarding his sustenance, nor accuse him regarding His<sup>azwj</sup> Judgement’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad ibn abu Nasr from Safwan al-Jammal from abu al-Hassan, the 1 st ’ recipient of divine supreme covenant, who has said the following: “One who has proper understanding about Allah must not feel that Allah procrastinates in sending his sustenance or accuse Him in His decisions.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/ 8)"
        ],
        "index": 1576,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/576",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/359",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/259",
              "text": "عَلِيِّ بْنِ النُّعْمَانِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1640",
              "text": "عَمْرِو بْنِ نُهَيْكٍ بَيَّاعِ الْهَرَوِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ عَمْرِو بْنِ نُهَيْكٍ بَيَّاعِ الْهَرَوِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:31:6",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَالَ اللَّهُ عَزَّ وَ جَلَّ عَبْدِيَ الْمُؤْمِنَ لَا أَصْرِفُهُ فِي شَيْ‏ءٍ إِلَّا جَعَلْتُهُ خَيْراً لَهُ فَلْيَرْضَ بِقَضَائِي وَ لْيَصْبِرْ عَلَى بَلَائِي وَ لْيَشْكُرْ نَعْمَائِي أَكْتُبْهُ يَا مُحَمَّدُ مِنَ الصِّدِّيقِينَ عِنْدِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Muhammad Bin Ismail, from Ali Bin Al Numan, from Amro Bin Nuheyk Baya’a Al Harwy who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Said: “My<sup>azwj</sup> believing servant, I<sup>azwj</sup> do not Exchange anything from him except that I<sup>azwj</sup> Make it to be better for him. So let him be pleased with My<sup>azwj</sup> Judgement, and let him be patient upon My<sup>azwj</sup> afflictions, and let him be thankful for My<sup>azwj</sup> Bounties. I<sup>azwj</sup> shall Write for him, O Muhammad<sup>saww</sup>, as being from the truthful in My<sup>azwj</sup> Presence’."
          ],
          "en.sarwar": [
            "6. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from Muhammad ibn Isma’il from Ali ibn al-Nu’man from ‘Amr ibn al-Nuhayk Bayya’ al-Harawi who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘Allah, the Most Majestic, the Most Holy, has said, “Whatever conditions I may turn My believing servant to are for his good. He then must agree with My decisions, be patient in My trial and appreciate My favors. I will then, O Muhammad, count him among the truthful ones.”’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/6)"
        ],
        "index": 1577,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:31:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ دَاوُدَ بْنِ فَرْقَدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ فِيمَا أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى مُوسَى بْنِ عِمْرَانَ ( عليه السلام ) يَا مُوسَى بْنَ عِمْرَانَ مَا خَلَقْتُ خَلْقاً أَحَبَّ إِلَيَّ مِنْ عَبْدِيَ الْمُؤْمِنِ فَإِنِّي إِنَّمَا أَبْتَلِيهِ لِمَا هُوَ خَيْرٌ لَهُ وَ أُعَافِيهِ لِمَا هُوَ خَيْرٌ لَهُ وَ أَزْوِي عَنْهُ مَا هُوَ شَرٌّ لَهُ لِمَا هُوَ خَيْرٌ لَهُ وَ أَنَا أَعْلَمُ بِمَا يَصْلُحُ عَلَيْهِ عَبْدِي فَلْيَصْبِرْ عَلَى بَلَائِي وَ لْيَشْكُرْ نَعْمَائِي وَ لْيَرْضَ بِقَضَائِي أَكْتُبْهُ فِي الصِّدِّيقِينَ عِنْدِي إِذَا عَمِلَ بِرِضَائِي وَ أَطَاعَ أَمْرِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Mahboub, from Malik Bin Atiyya, from Dawood Bin Farqad, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>: ‘Among what Allah<sup>azwj</sup> Mighty and Majestic Revealed unto Musa Bin Imran<sup>as</sup> was: “O Musa<sup>as</sup> Bin Imran! I<sup>azwj</sup> have not Created a creature more Beloved to Me<sup>azwj</sup> than My<sup>azwj</sup> believing servant. So I<sup>azwj</sup>, rather, Test him for what is better for him, and Grant him health which is better for him, and Deter from him what is evil for him to what is better for him, and I<sup>azwj</sup> am more Knowing with what is correct upon My<sup>azwj</sup> servant. Therefore, let him be patient upon My<sup>azwj</sup> afflictions, and let him be grateful for My<sup>azwj</sup> Bounties, and let him be pleased with My<sup>azwj</sup> Judgement. I<sup>azwj</sup> shall Write for him to be among the truthful ones in My<sup>azwj</sup> Presence, when he acts by My<sup>azwj</sup> Pleasure and obeys My<sup>azwj</sup> Commands’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Mahbub from Malik ibn ‘Atiyah from Dawud ibn Farqad from abu ‘Abd Allah (a.s.) who has said the following:“Of the revelations that Allah, the Most Majestic, the Most Holy, sent to Moses ibn ‘Imran was as follows: ‘O, Moses, son of ‘Imran, I have not created anything more beloved to Me than My believing servant. I try him only because it is for his good. I give him good health just for his good. I hold back what is evil for him in favor of what is for his good. I know best in what conditions My servant works for his own best interest. He then must bear patience in My trials, appreciate My favors and agree with My decision. I count him among the truthful ones before Me if he acts according to My pleasure and obeys My command.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/ 8)"
        ],
        "index": 1578,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/576",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/173",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/445",
              "text": "فُضَيْلِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/68",
              "text": "ابْنِ أَبِي يَعْفُورٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ فُضَيْلِ بْنِ عُثْمَانَ عَنِ ابْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:31:8",
        "text": [
          " عَجِبْتُ لِلْمَرْءِ الْمُسْلِمِ لَا يَقْضِي اللَّهُ عَزَّ وَ جَلَّ لَهُ قَضَاءً إِلَّا كَانَ خَيْراً لَهُ وَ إِنْ قُرِّضَ بِالْمَقَارِيضِ كَانَ خَيْراً لَهُ وَ إِنْ مَلَكَ مَشَارِقَ الْأَرْضِ وَ مَغَارِبَهَا كَانَ خَيْراً لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Fuzayl Bin Usman, from Ibn Abu Yafour, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘How astounding is the Muslim person. Allah<sup>azwj</sup> Mighty and Majestic does not Judge a Judgement for him except if it was better for him, and if he is indebted with the debts, it would be better for him, and if he was the king of the east of the earth and its west, it would be better for him’."
          ],
          "en.sarwar": [
            "8. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from Fudayl ibn ‘Uthman from ibn abu Ya’fur from abu ‘Abd Allah (a.s.) who has said the following: “The case of a Muslim (believer) man is amazing. There is no decision that Allah, the Most Majestic, the Most Holy, makes about him but that it is in his best interest. Even if he is cut in pieces with scissors, still it is for his good. If he may possess the kingdom of the East and West of the earth, still it is for his good.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/ 8)"
        ],
        "index": 1579,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/265",
              "text": "ابْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1304",
              "text": "صَالِحِ بْنِ عُقْبَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1369",
              "text": "عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ الْجُعْفِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ سِنَانٍ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ الْجُعْفِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:31:9",
        "text": [
          " أَحَقُّ خَلْقِ اللَّهِ أَنْ يُسَلِّمَ لِمَا قَضَى اللَّهُ عَزَّ وَ جَلَّ مَنْ عَرَفَ اللَّهَ عَزَّ وَ جَلَّ وَ مَنْ رَضِيَ بِالْقَضَاءِ أَتَى عَلَيْهِ الْقَضَاءُ وَ عَظَّمَ اللَّهُ أَجْرَهُ وَ مَنْ سَخِطَ الْقَضَاءَ مَضَى عَلَيْهِ الْقَضَاءُ وَ أَحْبَطَ اللَّهُ أَجْرَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Sinan, from Salih Bin Uqba, from Abdullah Bin Muhammad Al Ju’fy, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said ‘The most rightful of the creatures of Allah<sup>azwj</sup> is (one who) submits to whatever Allah<sup>azwj</sup> Mighty and Majestic has Judged. The one who recognises Allah<sup>azwj</sup> Mighty and Majestic, and the one who is satisfied with the Judgement, the Judgement would come upon him anyway, and Allah<sup>azwj</sup> would Magnify his Recompense; and the one who is angry with the Judgement, the Judgement would come upon him anyway, and Allah<sup>azwj</sup> would Drop his Recompense’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn Sinan from Salih ibn ‘Aqaba from ‘Abd Allah ibn Muhammad al-Ja’fi from abu Ja’far (a.s.) who has said the following: “Abu Ja’far (a.s.) has said, ‘The most proper people to agree with the decisions of Allah, the Most Majestic, the Most Holy, are those who have recognized Allah, the Most Majestic, the Most Holy. Whoever agrees with the decision of Allah that is to take place anyway, Allah increases his reward. Whoever disagrees with the decision of Allah, the decision is, inevitably, applied to him but his reward becomes void.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/14)"
        ],
        "index": 1580,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/163",
              "text": "الْقَاسِمِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْمِنْقَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/233",
              "text": "عَلِيِّ بْنِ هَاشِمِ بْنِ الْبَرِيدِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنِ الْمِنْقَرِيِّ عَنْ عَلِيِّ بْنِ هَاشِمِ بْنِ الْبَرِيدِ عَنْ أَبِيهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:31:10",
        "text": [
          " قَالَ لِي عَلِيُّ بْنُ الْحُسَيْنِ صَلَوَاتُ اللَّهِ عَلَيْهِمَا الزُّهْدُ عَشَرَةُ أَجْزَاءٍ أَعْلَى دَرَجَةِ الزُّهْدِ أَدْنَى دَرَجَةِ الْوَرَعِ وَ أَعْلَى دَرَجَةِ الْوَرَعِ أَدْنَى دَرَجَةِ الْيَقِينِ وَ أَعْلَى دَرَجَةِ الْيَقِينِ أَدْنَى دَرَجَةِ الرِّضَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Qasim Bin Muhammad, from Al Minqary, from Ali Bin Hashim Bin Al Bareyd, from his father who said, ",
            "‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said to me: ‘The ascetism has ten parts. The highest level of the ascetism is the lowest level of the piety; and the highest level of the piety is the lowest level of the conviction; and the highest level of the conviction is the lowest level of the satisfaction (from the Judgement of Allah<sup>azwj</sup>)’."
          ],
          "en.sarwar": [
            "10. Ali ibn Ibrahim has narrated from his father from al-Qasim ibn Muhammad from al-Minqari form Ali ibn Hashim ibn al-Burayd from his father who has said the following: “Ali ibn al-Husayn (a.s.) has said, ‘Abstinence from worldly pleasures has ten levels. Its highest level is the lowest level of piety and reserve. The highest level of piety and reserve is the lowest level of certainty. The highest level of certainty is the lowest level of consent to the decision of Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/14)"
        ],
        "index": 1581,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/184",
              "text": "مُحَمَّدِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/92",
              "text": "عَلِيِّ بْنِ أَسْبَاطٍ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/177",
              "text": "ذَكَرَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:31:11",
        "text": [
          " لَقِيَ الْحَسَنُ بْنُ عَلِيٍّ ( عليه السلام ) عَبْدَ اللَّهِ بْنَ جَعْفَرٍ فَقَالَ يَا عَبْدَ اللَّهِ كَيْفَ يَكُونُ الْمُؤْمِنُ مُؤْمِناً وَ هُوَ يَسْخَطُ قِسْمَهُ وَ يُحَقِّرُ مَنْزِلَتَهُ وَ الْحَاكِمُ عَلَيْهِ اللَّهُ وَ أَنَا الضَّامِنُ لِمَنْ لَمْ يَهْجُسْ فِي قَلْبِهِ إِلَّا الرِّضَا أَنْ يَدْعُوَ اللَّهَ فَيُسْتَجَابَ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Ali, from Ali Bin Asbaat, from the one who mentioned it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> met Abdullah Bin Ja’far, so he<sup>asws</sup> said: ‘O Abdullah! How can the <span class=\"iTxt\">Momin</span> happen to be a <span class=\"iTxt\">Momin</span> and he is angry at his distribution, and he belittles his status, and the Ruler upon him is Allah<sup>azwj</sup>? And I<sup>asws</sup> am the guarantor to the one who does not have a notion in his heart except for the satisfaction that he would supplicate to Allah<sup>azwj</sup>, so He<sup>azwj</sup> would Answer to him’."
          ],
          "en.sarwar": [
            "11. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Muhammad ibn Ali from Ali ibn Asbat from those whom he has mentioned from abu ‘Abd Allah (a.s.) who has said the following: “Al-Hassan ibn Ali (a.s.) once met ‘Abd Allah ibn Ja’far and said to him, ‘O, ‘Abd Allah, how can a believer be a believer when he disagrees with the decision of Allah about his share and belittles his position while the nder over him is Allah? I guarantee that Allah accepts the prayer of one in whose heart (mind) no suggestion takes place except agreement with the decisions of Allah).’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/ 8)"
        ],
        "index": 1582,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/226",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/265",
              "text": "ابْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/177",
              "text": "ذَكَرَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَنْهُ عَنْ أَبِيهِ عَنِ ابْنِ سِنَانٍ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:31:12",
        "text": [
          " قُلْتُ لَهُ بِأَيِّ شَيْ‏ءٍ يُعْلَمُ الْمُؤْمِنُ بِأَنَّهُ مُؤْمِنٌ قَالَ بِالتَّسْلِيمِ لِلَّهِ وَ الرِّضَا فِيمَا وَرَدَ عَلَيْهِ مِنْ سُرُورٍ أَوْ سَخَطٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from his father, from Ibn Sinan, from the one who mentioned it, ",
            "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup>, said, ‘I said to him<sup style=\"font-weight: normal\">asws</sup>, ‘By which thing does the <span class=\"iTxt\">Momin</span> know that he is a <span class=\"iTxt\">Momin</span>?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘By the submission to Allah<sup style=\"font-weight: normal\">azwj</sup>, and the satisfaction regarding whatever traspires upon him, from the joy or anger’."
          ],
          "en.sarwar": [
            "12. It is narrated from him from his father from ibn Sinan from those whom he has mentioned from abu ‘Abd Allah (a.s.) who has said the following: “I (the narrator) asked him, (abu ‘Abd Allah, recipient of divine supreme covenant), ‘By what means can a believer know that he is a believer?’ The Imam said, ‘(He can find out) by means of his submitting himself to Allah, and agreeing with whatever happiness or sadness that he may experience.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/15)"
        ],
        "index": 1583,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/226",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/265",
              "text": "ابْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/329",
              "text": "الْحُسَيْنِ بْنِ الْمُخْتَارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/333",
              "text": "عَبْدِ اللَّهِ بْنِ أَبِي يَعْفُورٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَنْهُ عَنْ أَبِيهِ عَنِ ابْنِ سِنَانٍ عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:31:13",
        "text": [
          " لَمْ يَكُنْ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَقُولُ لِشَيْ‏ءٍ قَدْ مَضَى لَوْ كَانَ غَيْرُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ibn Sinan, from Al Husayn Bin Al Mukhtar, from Abdullah in Abu Yafour, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It did not happen that Rasool-Allah<sup>saww</sup> was saying for something which had transpired: ‘If only something else would have happened’’."
          ],
          "en.sarwar": [
            "13. It is narrated from him from his father from ibn Sinan from al-Husayn ibn al- Muhtar from ‘Abd Allah ibn abu Ya’fur from abu ‘Abd Allah (a.s.) who has said the following: “The Messenger of Allah (a.s.) never said about something that had taken place, ‘Would that something else had happened.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:31",
  "kind": "verse_list"
}