{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:2:1", "titles": {"ar": "كتاب الإيمان و الكفر", "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"}}, {"indexed_titles": {"en": "Chapter 32"}, "path": "/books/al-kafi:2:1:32", "titles": {"ar": "بَابُ التَّفْوِيضِ إِلَى اللَّهِ وَ التَّوَكُّلِ عَلَيْهِ", "en": "Chapter 32 – The delegating (of matters) to Allah<sup>azwj</sup> and the reliance upon Him<sup>azwj</sup>"}}], "index": 220, "local_index": 32, "part_type": "Chapter", "path": "/books/al-kafi:2:1:32", "titles": {"ar": "بَابُ التَّفْوِيضِ إِلَى اللَّهِ وَ التَّوَكُّلِ عَلَيْهِ", "en": "Chapter 32 – The delegating (of matters) to Allah<sup>azwj</sup> and the reliance upon Him<sup>azwj</sup>"}, "verse_count": 8, "verse_start_index": 1583, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 1584, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:1:32:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ مُفَضَّلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى دَاوُدَ ( عليه السلام ) مَا اعْتَصَمَ بِي عَبْدٌ مِنْ عِبَادِي دُونَ أَحَدٍ مِنْ خَلْقِي عَرَفْتُ ذَلِكَ مِنْ نِيَّتِهِ ثُمَّ تَكِيدُهُ السَّمَاوَاتُ وَ الْأَرْضُ وَ مَنْ فِيهِنَّ إِلَّا جَعَلْتُ لَهُ الْمَخْرَجَ مِنْ بَيْنِهِنَّ وَ مَا اعْتَصَمَ عَبْدٌ مِنْ عِبَادِي بِأَحَدٍ مِنْ خَلْقِي عَرَفْتُ ذَلِكَ مِنْ نِيَّتِهِ إِلَّا قَطَعْتُ أَسْبَابَ السَّمَاوَاتِ وَ الْأَرْضِ مِنْ يَدَيْهِ وَ أَسَخْتُ الْأَرْضَ مِنْ تَحْتِهِ وَ لَمْ أُبَالِ بِأَيِّ وَادٍ هَلَكَ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Mufazzal, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Revealed unto Dawood<sup>as</sup>: “No servant from My<sup>azwj</sup> servants would hold on to Me<sup>azwj</sup> besides anyone from My<sup>azwj</sup> creatures, recognising that from his intention, then they plot against him, the skies and the earth and the ones in these, except that I<sup>azwj</sup> would Make an exit to be for him from between these; and no servant from My<sup>azwj</sup> servants would hold on to any one from My<sup>azwj</sup> creatures, recognising that from his intention, except that I<sup>azwj</sup> would Cut-off the causes of the skies and the earth from his hands, and I<sup>azwj</sup> shall Harden the earth from beneath him, and I<sup>azwj</sup> would not Care in which valley he perishes’."]}}, {"index": 1585, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:1:32:2", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي حَفْصٍ الْأَعْشَى عَنْ عَمْرِو [عُمَرَ] بْنِ خَالِدٍ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ( صلوات الله عليه )  قَالَ خَرَجْتُ حَتَّى انْتَهَيْتُ إِلَى هَذَا الْحَائِطِ فَاتَّكَأْتُ عَلَيْهِ فَإِذَا رَجُلٌ عَلَيْهِ ثَوْبَانِ أَبْيَضَانِ يَنْظُرُ فِي تُجَاهِ وَجْهِي ثُمَّ قَالَ يَا عَلِيَّ بْنَ الْحُسَيْنِ مَا لِي أَرَاكَ كَئِيباً حَزِيناً أَ عَلَى الدُّنْيَا فَرِزْقُ اللَّهِ حَاضِرٌ لِلْبَرِّ وَ الْفَاجِرِ قُلْتُ مَا عَلَى هَذَا أَحْزَنُ وَ إِنَّهُ لَكَمَا تَقُولُ ", "قَالَ فَعَلَى الْآخِرَةِ فَوَعْدٌ صَادِقٌ يَحْكُمُ فِيهِ مَلِكٌ قَاهِرٌ أَوْ قَالَ قَادِرٌ قُلْتُ مَا عَلَى هَذَا أَحْزَنُ وَ إِنَّهُ لَكَمَا تَقُولُ ", "فَقَالَ مِمَّ حُزْنُكَ قُلْتُ مِمَّا نَتَخَوَّفُ مِنْ فِتْنَةِ ابْنِ الزُّبَيْرِ وَ مَا فِيهِ النَّاسُ ", "قَالَ فَضَحِكَ ثُمَّ قَالَ يَا عَلِيَّ بْنَ الْحُسَيْنِ هَلْ رَأَيْتَ أَحَداً دَعَا اللَّهَ فَلَمْ يُجِبْهُ قُلْتُ لَا قَالَ فَهَلْ رَأَيْتَ أَحَداً تَوَكَّلَ عَلَى اللَّهِ فَلَمْ يَكْفِهِ قُلْتُ لَا قَالَ فَهَلْ رَأَيْتَ أَحَداً سَأَلَ اللَّهَ فَلَمْ يُعْطِهِ قُلْتُ لَا ثُمَّ غَابَ عَنِّي .", "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ مِثْلَهُ"], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Ibn Mahboub, from Abu Hafs Al Ashay, from Amro Umar Bin Khali Abu Hamza Al Sumaly, ", "(It has been narrated) from Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> having said: ‘I<sup>asws</sup> went out until I<sup>asws</sup> ended up to this wall. So I<sup>asws</sup> leaned against it, and there was a man upon whom were two white clothes, looking towards my<sup>asws</sup> face. Then he said, ‘O Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>! What is the matter I see you<sup>asws</sup> as bleak, aggrieved, is it upon the world? But, the sustenance of Allah<sup>azwj</sup> is for the righteous and the immoral’. I<sup>asws</sup> said: ‘It is not upon this that I<sup>asws</sup> grieve, and it is just like you are saying’. ", "He said, ‘So, upon the Hereafter? But the Promise is true. The King (Allah<sup style=\"font-weight: normal\">azwj</sup>) has Judged with regards to it. The King, the Compeller’, or he said, ‘All-Powerful’. I<sup style=\"font-weight: normal\">asws</sup> said: ‘It is not upon this that I<sup style=\"font-weight: normal\">asws</sup> grieve, and it is just like what you are saying’. ", "So he said, ‘From what is your<sup style=\"font-weight: normal\">asws</sup> grief?’ I<sup style=\"font-weight: normal\">asws</sup> said: ‘From what we<sup style=\"font-weight: normal\">asws</sup> are fearing from the strife of Ibn Al-Zubeyr and what the people are indulging in’. ", "He<sup style=\"font-weight: normal\">asws</sup> said: ‘So he laughed, then said, ‘O Ali<sup style=\"font-weight: normal\">asws</sup> Bin Al-Husayn<sup style=\"font-weight: normal\">asws</sup>! Have you<sup style=\"font-weight: normal\">asws</sup> seen anyone who supplicated to Allah<sup style=\"font-weight: normal\">azwj</sup>, but He<sup style=\"font-weight: normal\">azwj</sup> did not Answer him?’ I said, ‘No’. He<sup style=\"font-weight: normal\">asws</sup> said: ‘So have you<sup style=\"font-weight: normal\">asws</sup> seen anyone who relied upon Allah<sup style=\"font-weight: normal\">azwj</sup>, but He<sup style=\"font-weight: normal\">azwj</sup> did no Suffice him?’ I<sup style=\"font-weight: normal\">asws</sup> said: ‘No’. He said, ‘So have you<sup style=\"font-weight: normal\">asws</sup> seen anyone who asked Allah<sup style=\"font-weight: normal\">azwj</sup>, but He<sup style=\"font-weight: normal\">azwj</sup> did not Give him?’ I<sup style=\"font-weight: normal\">asws</sup> said: ‘No’. Then he disappeared’. ", "Ali Bin Ibrahim, from his father, from Ibn Mahboub – similar to it."]}}, {"index": 1586, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:2:1:32:3", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ عَمِّهِ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْغِنَى وَ الْعِزَّ يَجُولَانِ فَإِذَا ظَفِرَا بِمَوْضِعِ التَّوَكُّلِ أَوْطَنَا .", "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ حَسَّانَ مِثْلَهُ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Ali Bin Hassan, from his uncle Abdul Rahman Bin Kaseer, ", "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> having said: ‘The richness and the splendour wander around. When they acquire a trustworthy place, they both settle’. ", "<span style=\"font-size: small\">A number of our companions, from Ahmad Bin Abu Abdullah, from Muhammad Bin Ali, from Ali Bin Hassan </span>– similar to it."]}}, {"index": 1587, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:2:1:32:4", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَيُّمَا عَبْدٍ أَقْبَلَ قِبَلَ مَا يُحِبُّ اللَّهُ عَزَّ وَ جَلَّ أَقْبَلَ اللَّهُ قِبَلَ مَا يُحِبُّ وَ مَنِ اعْتَصَمَ بِاللَّهِ عَصَمَهُ اللَّهُ وَ مَنْ أَقْبَلَ اللَّهُ قِبَلَهُ وَ عَصَمَهُ لَمْ يُبَالِ لَوْ سَقَطَتِ السَّمَاءُ عَلَى الْأَرْضِ أَوْ كَانَتْ نَازِلَةٌ نَزَلَتْ عَلَى أَهْلِ الْأَرْضِ فَشَمِلَتْهُمْ بَلِيَّةٌ كَانَ فِي حِزْبِ اللَّهِ بِالتَّقْوَى مِنْ كُلِّ بَلِيَّةٍ أَ لَيْسَ اللَّهُ عَزَّ وَ جَلَّ يَقُولُ إِنَّ الْمُتَّقِينَ فِي مَقامٍ أَمِينٍ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from Abdullah Bin Sinan, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whichever servant comes forward to accept whatever Allah<sup>azwj</sup> Mighty and Majestic Loves, Allah<sup>azwj</sup> would Come forwards with what he loves; and the one who seeks Allah<sup>azwj</sup>’s Protection, Allah<sup>azwj</sup> will Protect him, and the one who comes forward, Allah<sup>azwj</sup> will Protect him, no matter if the sky were to fall upon the earth, or there was to descend a descent upon the inhabitants of the earth and engulf them in an affliction, he would be in the party of Allah<sup>azwj</sup> with the piety, (safe) from every affliction. Isn’t Allah<sup>azwj</sup> Mighty and Majestic Saying <span class=\"ibTxt\">[44:51] Surely the pious are in a secure place</span>?’"]}}, {"index": 1588, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:2:1:32:5", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ غَيْرِ وَاحِدٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ أَحْمَدَ بْنِ عُمَرَ الْحَلَّالِ عَنْ عَلِيِّ بْنِ سُوَيْدٍ عَنْ أَبِي الْحَسَنِ الْأَوَّلِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ فَقَالَ التَّوَكُّلُ عَلَى اللَّهِ دَرَجَاتٌ مِنْهَا أَنْ تَتَوَكَّلَ عَلَى اللَّهِ فِي أُمُورِكَ كُلِّهَا فَمَا فَعَلَ بِكَ كُنْتَ عَنْهُ رَاضِياً تَعْلَمُ أَنَّهُ لَا يَأْلُوكَ خَيْراً وَ فَضْلًا وَ تَعْلَمُ أَنَّ الْحُكْمَ فِي ذَلِكَ لَهُ فَتَوَكَّلْ عَلَى اللَّهِ بِتَفْوِيضِ ذَلِكَ إِلَيْهِ وَ ثِقْ بِهِ فِيهَا وَ فِي غَيْرِهَا ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from someone else, from Ali Bin Asbaat, from Ahmad Bin Umar Al Hallal, from Ali Bin Suweyd, ", "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup>, said, ‘I asked him<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[65:3] and whoever relies upon Allah, He is sufficient for him</span>. So he<sup>asws</sup> said: ‘The reliance upon Allah<sup>azwj</sup> has levels – from it is that you rely upon Allah<sup>azwj</sup> in your matters, all of them. So whatever He<sup>azwj</sup> Does with you, you should be satisfied from Him<sup>azwj</sup>. You should know that He<sup>azwj</sup> would not Keep away any goodness and Grace from you; and know that the Decision regarding that is for Him<sup>azwj</sup>. Therefore, rely upon Allah<sup>azwj</sup> by delegating that to Him<sup>azwj</sup>, and trust in Him<sup>azwj</sup> regarding it, and in other such matters’."]}}, {"index": 1589, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:2:1:32:6", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنْ يَحْيَى بْنِ الْمُبَارَكِ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ أُعْطِيَ ثَلَاثاً لَمْ يُمْنَعْ ثَلَاثاً مَنْ أُعْطِيَ الدُّعَاءَ أُعْطِيَ الْإِجَابَةَ وَ مَنْ أُعْطِيَ الشُّكْرَ أُعْطِيَ الزِّيَادَةَ وَ مَنْ أُعْطِيَ التَّوَكُّلَ أُعْطِيَ الْكِفَايَةَ ", "ثُمَّ قَالَ أَ تَلَوْتَ كِتَابَ اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ وَ قَالَ لَئِنْ شَكَرْتُمْ لَأَزِيدَنَّكُمْ وَ قَالَ ادْعُونِي أَسْتَجِبْ لَكُمْ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, and Ali Bin Ibrahim, from his father, altogether from Yahya Bin Al Mubarak, ", "(It has been narrated) from Abdullah Bin Jabala, from Muawiya Bin Wahab, from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> having said: ‘The one who gives three (things) would not be denied three (things) – The one who gives the supplication would be Given the answer, and the one gives the thanks would be Given the increase, and the one who gives the reliance would be Given the sufficient’. ", "Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘Did you recite the Book of Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[65:3] and whoever relies upon Allah, He is sufficient for him</span>?’ And he<sup style=\"font-weight: normal\">asws</sup> said: ‘<span class=\"ibTxt\">[14:7] If you are grateful, I would Increase it more for you</span>. And He<sup style=\"font-weight: normal\">azwj</sup> Said <span class=\"ibTxt\">[40:60] And your Lord says: Call upon Me, I will Answer you</span>’."]}}, {"index": 1590, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:2:1:32:7", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَبِي عَلِيٍّ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ عَنِ الْحُسَيْنِ بْنِ رَاشِدٍ عَنِ الْحُسَيْنِ بْنِ عُلْوَانَ قَالَ كُنَّا فِي مَجْلِسٍ نَطْلُبُ فِيهِ الْعِلْمَ وَ قَدْ نَفِدَتْ نَفَقَتِي فِي بَعْضِ الْأَسْفَارِ فَقَالَ لِي بَعْضُ أَصْحَابِنَا مَنْ تُؤَمِّلُ لِمَا قَدْ نَزَلَ بِكَ فَقُلْتُ فُلَاناً فَقَالَ إِذاً وَ اللَّهِ لَا تُسْعَفُ حَاجَتُكَ وَ لَا يَبْلُغُكَ أَمَلُكَ وَ لَا تُنْجَحُ طَلِبَتُكَ قُلْتُ وَ مَا عَلَّمَكَ رَحِمَكَ اللَّهُ", "قَالَ إِنَّ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) حَدَّثَنِي أَنَّهُ قَرَأَ فِي بَعْضِ الْكُتُبِ أَنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى يَقُولُ وَ عِزَّتِي وَ جَلَالِي وَ مَجْدِي وَ ارْتِفَاعِي عَلَى عَرْشِي لَأَقْطَعَنَّ أَمَلَ كُلِّ مُؤَمِّلٍ [مِنَ النَّاسِ] غَيْرِي بِالْيَأْسِ وَ لَأَكْسُوَنَّهُ ثَوْبَ الْمَذَلَّةِ عِنْدَ النَّاسِ وَ لَأُنَحِّيَنَّهُ مِنْ قُرْبِي وَ لَأُبَعِّدَنَّهُ مِنْ فَضْلِي", "أَ يُؤَمِّلُ غَيْرِي فِي الشَّدَائِدِ وَ الشَّدَائِدُ بِيَدِي وَ يَرْجُو غَيْرِي وَ يَقْرَعُ بِالْفِكْرِ بَابَ غَيْرِي وَ بِيَدِي مَفَاتِيحُ الْأَبْوَابِ وَ هِيَ مُغْلَقَةٌ وَ بَابِي مَفْتُوحٌ لِمَنْ دَعَانِي", "فَمَنْ ذَا الَّذِي أَمَّلَنِي لِنَوَائِبِهِ فَقَطَعْتُهُ دُونَهَا وَ مَنْ ذَا الَّذِي رَجَانِي لِعَظِيمَةٍ فَقَطَعْتُ رَجَاءَهُ مِنِّي جَعَلْتُ آمَالَ عِبَادِي عِنْدِي مَحْفُوظَةً فَلَمْ يَرْضَوْا بِحِفْظِي وَ مَلَأْتُ سَمَاوَاتِي مِمَّنْ لَا يَمَلُّ مِنْ تَسْبِيحِي وَ أَمَرْتُهُمْ أَنْ لَا يُغْلِقُوا الْأَبْوَابَ بَيْنِي وَ بَيْنَ عِبَادِي", "فَلَمْ يَثِقُوا بِقَوْلِي أَ لَمْ يَعْلَمْ [أَنَّ] مَنْ طَرَقَتْهُ نَائِبَةٌ مِنْ نَوَائِبِي أَنَّهُ لَا يَمْلِكُ كَشْفَهَا أَحَدٌ غَيْرِي إِلَّا مِنْ بَعْدِ إِذْنِي فَمَا لِي أَرَاهُ لَاهِياً عَنِّي أَعْطَيْتُهُ بِجُودِي مَا لَمْ يَسْأَلْنِي ثُمَّ انْتَزَعْتُهُ عَنْهُ فَلَمْ يَسْأَلْنِي رَدَّهُ وَ سَأَلَ غَيْرِي", "أَ فَيَرَانِي أَبْدَأُ بِالْعَطَاءِ قَبْلَ الْمَسْأَلَةِ ثُمَّ أُسْأَلُ فَلَا أُجِيبُ سَائِلِي أَ بَخِيلٌ أَنَا فَيُبَخِّلُنِي عَبْدِي أَ وَ لَيْسَ الْجُودُ وَ الْكَرَمُ لِي أَ وَ لَيْسَ الْعَفْوُ وَ الرَّحْمَةُ بِيَدِي أَ وَ لَيْسَ أَنَا مَحَلَّ الْآمَالِ فَمَنْ يَقْطَعُهَا دُونِي أَ فَلَا يَخْشَى الْمُؤَمِّلُونَ أَنْ يُؤَمِّلُوا غَيْرِي", "فَلَوْ أَنَّ أَهْلَ سَمَاوَاتِي وَ أَهْلَ أَرْضِي أَمَّلُوا جَمِيعاً ثُمَّ أَعْطَيْتُ كُلَّ وَاحِدٍ مِنْهُمْ مِثْلَ مَا أَمَّلَ الْجَمِيعُ مَا انْتَقَصَ مِنْ مُلْكِي مِثْلَ عُضْوِ ذَرَّةٍ وَ كَيْفَ يَنْقُصُ مُلْكٌ أَنَا قَيِّمُهُ فَيَا بُؤْساً لِلْقَانِطِينَ مِنْ رَحْمَتِي وَ يَا بُؤْساً لِمَنْ عَصَانِي وَ لَمْ يُرَاقِبْنِي ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Abu Ali, from Muhammad Bin Al Hassan, from Al Husayn Bin Rashid, from Al Husayn Bin Ulwan who said, ", "‘We were in a gathering seeking knowledge therein, and my expense monies had been depleted during one of my journeys. So, one of our companions said to me, ‘Who would take care of what has befallen you?’ So I said, ‘So and so’. So he said, ‘Then, by Allah<sup>azwj</sup>, your need would not be relieved, nor would your work be accomplished, nor would your seeking be successful’. I said, ‘And what made you know, may Allah<sup>azwj</sup> have Mercy on you?’ ", "He said, ‘Abu Abdullah<sup>asws</sup> narrated to me that he<sup>asws</sup> read in one of the Books that Allah<sup>azwj</sup> Blessed and High is Saying: ‘By My<sup>azwj</sup> Honour and My<sup>azwj</sup> Majesty, and My<sup>azwj</sup> Glory, and by Exaltedness upon My<sup>azwj</sup> Throne! I<sup>azwj</sup> shall Cut-off the work of every worker (from the people) working for other than Me<sup>azwj</sup>, by the despair, and I<sup>azwj</sup> shall Clothe him in the disgrace in the presence of the people and I<sup>azwj</sup> shall Prevent him to come near to Me<sup>azwj</sup>, and Distance him from My<sup>azwj</sup> Grace.", "Is he working for other than Myself<sup>azwj</sup> during the difficulties, while the difficulties are in My<sup>azwj</sup> Hands? And he is hoping to other than Myself<sup>azwj</sup> and he is knocking with the infidelity, a door other than Mine, and the keys of the doors are in My<sup>azwj</sup> Hands, and it is locked while My<sup>azwj</sup> Door is open for the one who calls Me<sup>azwj</sup>. ", "So who is that who hoped in Me<sup>azwj</sup> for his ravages and I<sup>azwj</sup> Cut him off from it? And who is that who hoped in Me<sup>azwj</sup> for his great hardships and I<sup>azwj</sup> Cut-off his hopes from Me<sup>azwj</sup>? I<sup>azwj</sup> Made the deeds of My<sup>azwj</sup> servants to be preserved in My<sup>azwj</sup> Presence, so I<sup>azwj</sup> was not Pleased with My<sup>azwj</sup> Preservation, and I<sup>azwj</sup> Filled My<sup>azwj</sup> skies from the ones who do not other work than Glorifying Me<sup>azwj</sup>, and I<sup>azwj</sup> Commanded them that they should not be locking the doors between Me<sup>azwj</sup> and My<sup>azwj</sup> servants.", "So why does he not trust in My<sup>azwj</sup> Words? Does he not know that if I<sup>azwj</sup> were to leave someone in a hardship from My<sup>azwj</sup> Hardships, no one would have the power to remove it apart from Myself, except from after My<sup>azwj</sup> Permission? So what is the matter I<sup>azwj</sup> See him mindless from Me<sup>azwj</sup>. I<sup>azwj</sup> Gave to him by My<sup>azwj</sup> Benevolence what he had not even asked Me<sup>azwj</sup> for. Then I<sup>azwj</sup> Snatched it from him, but he did not ask Me<sup>azwj</sup> for its return, and asked others. ", "Does a servant view Me<sup>azwj</sup> that I<sup>azwj</sup> would Given him before the asking even? (if so) then he would be asking, but I<sup>azwj</sup> would not Answer the one who asks Me<sup>azwj</sup>? Am I<sup>azwj</sup> Stingy, so that I<sup>azwj</sup> would be Stingy to My<sup>azwj</sup> servant? Or, is not the Generosity and Benevolence for Me<sup>azwj</sup>? Or is not the Pardoning and the Mercy in My<sup>azwj</sup> Hands? Or am I<sup>azwj</sup> not a Respiter of the deeds? So the one who cuts off besides Me<sup>azwj</sup>, does he not fear the working if he were to work for other than Me<sup>azwj</sup>!", "Thus, if the inhabitants of My<sup style=\"font-weight: normal\">azwj</sup> skies, and the inhabitants of My<sup style=\"font-weight: normal\">azwj</sup> earth were to work altogether, then if I<sup style=\"font-weight: normal\">azwj</sup> were to Give one of them the like of what all of them had worked for, there would be no reduction from My<sup style=\"font-weight: normal\">azwj</sup> Possessions by a part of a particle. And how can there be a reduction of a Kingdom and I<sup style=\"font-weight: normal\">azwj</sup> am its Establisher. So how miserable it is for the despondents from My<sup style=\"font-weight: normal\">azwj</sup> Mercy! And how miserable it is for the ones who disobey Me<sup style=\"font-weight: normal\">azwj</sup> and are not looking at Me<sup style=\"font-weight: normal\">azwj</sup> (in expectation)’."]}}, {"index": 1591, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:2:1:32:8", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحَسَنِ عَنْ بَعْضِ أَصْحَابِنَا عَنْ عَبَّادِ بْنِ يَعْقُوبَ الرَّوَاجِنِيِّ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ كُنْتُ مَعَ مُوسَى بْنِ عَبْدِ اللَّهِ بِيَنْبُعَ وَ قَدْ نَفِدَتْ نَفَقَتِي فِي بَعْضِ الْأَسْفَارِ فَقَالَ لِي بَعْضُ وُلْدِ الْحُسَيْنِ مَنْ تُؤَمِّلُ لِمَا قَدْ نَزَلَ بِكَ فَقُلْتُ مُوسَى بْنَ عَبْدِ اللَّهِ فَقَالَ إِذاً لَا تُقْضَى حَاجَتُكَ ثُمَّ لَا تُنْجَحُ طَلِبَتُكَ قُلْتُ وَ لِمَ ذَاكَ قَالَ لِأَنِّي قَدْ وَجَدْتُ فِي بَعْضِ كُتُبِ آبَائِي أَنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ ثُمَّ ذَكَرَ مِثْلَهُ فَقُلْتُ يَا ابْنَ رَسُولِ اللَّهِ أَمْلِ عَلَيَّ فَأَمْلَاهُ عَلَيَّ فَقُلْتُ لَا وَ اللَّهِ مَا أَسْأَلُهُ حَاجَةً بَعْدَهَا."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Al Hassan, from one of our companions, from Abbad Bin Yaqoub Al Rawwajiny, from Saeed Bin Abdul Rahman who said, ", "‘I was with Musa Bin Abdullah at Yanbu, and my expense monies had depleted in one of the journeys. So one of the sons of Al-Husayn<sup>asws</sup> said to me, ‘Who will take care of what has befallen you?’ So I said, ‘Musa Bin Abdullah’. So he said, ‘Then your need would not be fulfilled. Then your seeking would not be accomplished’. I said, ‘And why is that so?’ He said, ‘Because I have found in one of the Books of my forefathers<sup>asws</sup> that Allah<sup>azwj</sup> Mighty and Majestic is Saying . . .’, and he mentioned similar to it (the above Hadeeth). So I said, ‘O son of Rasool-Allah<sup>saww</sup>! Dictate it to me’. So he dictated it to me. So I said, ‘No, by Allah<sup>azwj</sup>! I will not ask him for a need after it’."]}}]}, "index": "al-kafi:2:1:32", "kind": "verse_list"}