{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:2:1", "titles": {"ar": "كتاب الإيمان و الكفر", "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"}}, {"indexed_titles": {"en": "Chapter 36"}, "path": "/books/al-kafi:2:1:36", "titles": {"ar": "بَابُ الطَّاعَةِ وَ التَّقْوَى", "en": "Chapter 36 – The obedience and the piety"}}], "index": 224, "local_index": 36, "part_type": "Chapter", "path": "/books/al-kafi:2:1:36", "titles": {"ar": "بَابُ الطَّاعَةِ وَ التَّقْوَى", "en": "Chapter 36 – The obedience and the piety"}, "verse_count": 8, "verse_start_index": 1612, "verses": [{"index": 1613, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:1:36:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ مُحَمَّدٍ أَخِي عُرَامٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَا تَذْهَبْ بِكُمُ الْمَذَاهِبُ فَوَ اللَّهِ مَا شِيعَتُنَا إِلَّا مَنْ أَطَاعَ اللَّهَ عَزَّ وَ جَلَّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Muhammad the brother of Uram, from Muhammad Bin Muslim, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Do not (let) the (other) doctrines go with you, for by Allah<sup>azwj</sup>, our<sup>asws</sup> Shia is not except for the one who obeys Allah<sup>azwj</sup> Mighty and Majestic’."}]}, {"index": 1614, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:1:36:2", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ خَطَبَ رَسُولُ اللَّهِ ( عليه السلام ) فِي حَجَّةِ الْوَدَاعِ فَقَالَ يَا أَيُّهَا النَّاسُ وَ اللَّهِ مَا مِنْ شَيْ‏ءٍ يُقَرِّبُكُمْ مِنَ الْجَنَّةِ وَ يُبَاعِدُكُمْ مِنَ النَّارِ إِلَّا وَ قَدْ أَمَرْتُكُمْ بِهِ وَ مَا مِنْ شَيْ‏ءٍ يُقَرِّبُكُمْ مِنَ النَّارِ وَ يُبَاعِدُكُمْ مِنَ الْجَنَّةِ إِلَّا وَ قَدْ نَهَيْتُكُمْ عَنْهُ \nأَلَا وَ إِنَّ الرُّوحَ الْأَمِينَ نَفَثَ فِي رُوعِي أَنَّهُ لَنْ تَمُوتَ نَفْسٌ حَتَّى تَسْتَكْمِلَ رِزْقَهَا فَاتَّقُوا اللَّهَ وَ أَجْمِلُوا فِي الطَّلَبِ وَ لَا يَحْمِلْ أَحَدَكُمْ اسْتِبْطَاءُ شَيْ‏ءٍ مِنَ الرِّزْقِ أَنْ يَطْلُبَهُ بِغَيْرِ حِلِّهِ فَإِنَّهُ لَا يُدْرَكُ مَا عِنْدَ اللَّهِ إِلَّا بِطَاعَتِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Ibn Fazzal, from Aasim Bin Humeyd, from Abu Hamza Al Sumaly, \n(It has been narrated) from Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> having said: ‘Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> addressed (the people) during the farewell Hajj, so he<sup style=\"font-weight: normal\">saww</sup> said: ‘O you people! By Allah<sup style=\"font-weight: normal\">azwj</sup>! There is none from the things which brings you closer to the Paradise and distance you from the Fire except that I<sup style=\"font-weight: normal\">saww</sup> have ordered you with it; and there is none from a thing which brings you closer to the Fire and distances you from the Paradise, except that I<sup style=\"font-weight: normal\">saww</sup> have forbidden you from it. \nIndeed! And the trustworthy spirit (Jibraeel<sup style=\"font-weight: normal\">as</sup>) blew into my<sup style=\"font-weight: normal\">saww</sup> person that not a soul would be dying until its sustenance is completed. Therefore, fear Allah<sup style=\"font-weight: normal\">azwj</sup> and be vigorous in the seeking (of the livelihood), and not one of you should bear indolence for anything from the sustenance if he seeks it without its Permissibility, for whatever is in the Presence of Allah<sup style=\"font-weight: normal\">azwj</sup> cannot be realised except being in His<sup style=\"font-weight: normal\">azwj</sup> obedience’."}]}, {"index": 1615, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:2:1:36:3", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ سَالِمٍ وَ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ جَمِيعاً عَنْ أَحْمَدَ بْنِ النَّضْرِ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ لِي يَا جَابِرُ أَ يَكْتَفِي مَنِ انْتَحَلَ التَّشَيُّعَ أَنْ يَقُولَ بِحُبِّنَا أَهْلَ الْبَيْتِ فَوَ اللَّهِ مَا شِيعَتُنَا إِلَّا مَنِ اتَّقَى اللَّهَ وَ أَطَاعَهُ وَ مَا كَانُوا يُعْرَفُونَ يَا جَابِرُ إِلَّا بِالتَّوَاضُعِ وَ التَّخَشُّعِ وَ الْأَمَانَةِ وَ كَثْرَةِ ذِكْرِ اللَّهِ وَ الصَّوْمِ وَ الصَّلَاةِ وَ الْبِرِّ بِالْوَالِدَيْنِ وَ التَّعَاهُدِ لِلْجِيرَانِ مِنَ الْفُقَرَاءِ وَ أَهْلِ الْمَسْكَنَةِ وَ الْغَارِمِينَ وَ الْأَيْتَامِ وَ صِدْقِ الْحَدِيثِ وَ تِلَاوَةِ الْقُرْآنِ وَ كَفِّ الْأَلْسُنِ عَنِ النَّاسِ إِلَّا مِنْ خَيْرٍ وَ كَانُوا أُمَنَاءَ عَشَائِرِهِمْ فِي الْأَشْيَاءِ \nقَالَ جَابِرٌ فَقُلْتُ يَا ابْنَ رَسُولِ اللَّهِ مَا نَعْرِفُ الْيَوْمَ أَحَداً بِهَذِهِ الصِّفَةِ فَقَالَ يَا جَابِرُ لَا تَذْهَبَنَّ بِكَ الْمَذَاهِبُ حَسْبُ الرَّجُلِ أَنْ يَقُولَ أُحِبُّ عَلِيّاً وَ أَتَوَلَّاهُ ثُمَّ لَا يَكُونَ مَعَ ذَلِكَ فَعَّالًا فَلَوْ قَالَ إِنِّي أُحِبُّ رَسُولَ اللَّهِ فَرَسُولُ اللَّهِ ( صلى الله عليه وآله ) خَيْرٌ مِنْ عَلِيٍّ ( عليه السلام ) ثُمَّ لَا يَتَّبِعُ سِيرَتَهُ وَ لَا يَعْمَلُ بِسُنَّتِهِ مَا نَفَعَهُ حُبُّهُ إِيَّاهُ شَيْئاً \nفَاتَّقُوا اللَّهَ وَ اعْمَلُوا لِمَا عِنْدَ اللَّهِ لَيْسَ بَيْنَ اللَّهِ وَ بَيْنَ أَحَدٍ قَرَابَةٌ أَحَبُّ الْعِبَادِ إِلَى اللَّهِ عَزَّ وَ جَلَّ وَ أَكْرَمُهُمْ عَلَيْهِ أَتْقَاهُمْ وَ أَعْمَلُهُمْ بِطَاعَتِهِ يَا جَابِرُ وَ اللَّهِ مَا يُتَقَرَّبُ إِلَى اللَّهِ تَبَارَكَ وَ تَعَالَى إِلَّا بِالطَّاعَةِ وَ مَا مَعَنَا بَرَاءَةٌ مِنَ النَّارِ وَ لَا عَلَى اللَّهِ لِأَحَدٍ مِنْ حُجَّةٍ مَنْ كَانَ لِلَّهِ مُطِيعاً فَهُوَ لَنَا وَلِيٌّ وَ مَنْ كَانَ لِلَّهِ عَاصِياً فَهُوَ لَنَا عَدُوٌّ وَ مَا تُنَالُ وَلَايَتُنَا إِلَّا بِالْعَمَلِ وَ الْوَرَعِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Salim, and Ahmad Bin Abu Abdullah, from his father, altogether from Ahmad Bin Al Nazar, from Amro Bin Shimr, from Jabir, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘O Jabir! Is he content, the one who is posing as the Shia that he is speaking of his love for us<sup>asws</sup>, the People<sup>asws</sup> of the Household? By Allah<sup>azwj</sup>! He is not our<sup>asws</sup> Shia except for the one who fears Allah<sup>azwj</sup> and obeys Him<sup>azwj</sup>; and they (the Shia) would not be recognised, O Jabir, except with the reverence, and the humbleness, and the trustworthiness, and frequency of the Mention of Allah<sup>azwj</sup>, and the Fasting, and the<span class=\"iTxt\"> Salāt</span>, and the righteousness with the parents, and the commitment with the neighbours from the poor ones, and the destitute, and the indebted ones, and the orphans, and the truthfulness of the narrations, and the recitation of the Quran, and restraining of the tongues from the people except from goodness, and being trusted by their clan regarding the things’. \nJabir said, ‘So I said, ‘O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! We do not recognise today anyone with these characteristics’. So he<sup>asws</sup> said: ‘O Jabir! Do not (let) the (other) doctrines (sects) go away with you. The man reckons that he is speaking the love for Ali<sup>asws</sup>, and being in his<sup>asws</sup> Wilayah, then he does not happen to be with that in deeds. So if he were to say, ‘I love Rasool-Allah<sup>saww</sup>’, so Rasool-Allah<sup>saww</sup> is better than Ali<sup>asws</sup>, then he does not follow his<sup>saww</sup> way, and does not act by his<sup>saww</sup> Sunnah, his love for him<sup>saww</sup> would not benefit him anything. \nTherefore, fear Allah<sup>azwj</sup> and work for what is in the Presence of Allah<sup>azwj</sup>. There is no relationship between Allah<sup>azwj</sup> and anyone. The most Beloved of the servants to Allah<sup>azwj</sup> Mighty and Majestic and the most prestigious to Him<sup>azwj</sup> is the most pious of them the most working of them in His<sup>azwj</sup> obedience. O Jabir! By Allah<sup>azwj</sup>! One cannot get closer to Allah<sup>azwj</sup> Blessed and High except with the obedience. And what is the meaning of the freedom from the Fire, and there is no argument for anyone against Allah<sup>azwj</sup>. The one who was obedient to Allah<sup>azwj</sup> so he would be a friend of ours<sup>asws</sup>, and the one who was disobedient to Allah<sup>azwj</sup>, so he would be an enemy of ours<sup>asws</sup>; and you cannot attain our<sup>asws</sup> Wilayah except with the deeds and the piety’."}]}, {"index": 1616, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:2:1:36:4", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا كَانَ يَوْمُ الْقِيَامَةِ يَقُومُ عُنُقٌ مِنَ النَّاسِ فَيَأْتُونَ بَابَ الْجَنَّةِ فَيَضْرِبُونَهُ فَيُقَالُ لَهُمْ مَنْ أَنْتُمْ فَيَقُولُونَ نَحْنُ أَهْلُ الصَّبْرِ فَيُقَالُ لَهُمْ عَلَى مَا صَبَرْتُمْ فَيَقُولُونَ كُنَّا نَصْبِرُ عَلَى طَاعَةِ اللَّهِ وَ نَصْبِرُ عَنْ مَعَاصِي اللَّهِ فَيَقُولُ اللَّهُ عَزَّ وَ جَلَّ صَدَقُوا أَدْخِلُوهُمُ الْجَنَّةَ وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ إِنَّما يُوَفَّى الصَّابِرُونَ أَجْرَهُمْ بِغَيْرِ حِسابٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether, from Ibn Abu Umeyr, from Hisham Bin Al Hakam, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> havings said: ‘When it will be the Day of Judgement, (some) necks of the people would stand and they would be coming to the Door of the Paradise, and they would be knocking it. So it would be said to them, ‘Who are you?’ So they would be saying, ‘We are the people of patience’. So it would be said to them, ‘What were you patient upon?’ So they would be saying, ‘We were patient upon the obedience of Allah<sup>azwj</sup>, and we were patient from (not) disobeying Allah<sup>azwj</sup>’. So Allah<sup>azwj</sup> Mighty and Majestic would be Saying: “They are speaking the truth. Enter them into the Paradise”. And these are the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[39:10] But rather, it is the patient who will be paid back their Recompense without Reckoning</span>’."}]}, {"index": 1617, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:2:1:36:5", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ فُضَيْلِ بْنِ عُثْمَانَ عَنْ أَبِي عُبَيْدَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه )  يَقُولُ لَا يَقِلُّ عَمَلٌ مَعَ تَقْوَى وَ كَيْفَ يَقِلُّ مَا يُتَقَبَّلُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Fuzayl Bin Usman, from Abu Ubeyda, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> was saying: ‘Do not belittle a deed performed with piety, and how can one belittle what is Accepted?’."}]}, {"index": 1618, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:2:1:36:6", "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبَانٍ عَنْ عَمْرِو بْنِ خَالِدٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ يَا مَعْشَرَ الشِّيعَةِ شِيعَةِ آلِ مُحَمَّدٍ كُونُوا النُّمْرُقَةَ الْوُسْطَى يَرْجِعُ إِلَيْكُمُ الْغَالِي وَ يَلْحَقُ بِكُمُ التَّالِي فَقَالَ لَهُ رَجُلٌ مِنَ الْأَنْصَارِ يُقَالُ لَهُ سَعْدٌ جُعِلْتُ فِدَاكَ مَا الْغَالِي قَالَ قَوْمٌ يَقُولُونَ فِينَا مَا لَا نَقُولُهُ فِي أَنْفُسِنَا فَلَيْسَ أُولَئِكَ مِنَّا وَ لَسْنَا مِنْهُمْ قَالَ فَمَا التَّالِي قَالَ الْمُرْتَادُ يُرِيدُ الْخَيْرَ يُبَلِّغُهُ الْخَيْرَ يُؤْجَرُ عَلَيْهِ\nثُمَّ أَقْبَلَ عَلَيْنَا فَقَالَ وَ اللَّهِ مَا مَعَنَا مِنَ اللَّهِ بَرَاءَةٌ وَ لَا بَيْنَنَا وَ بَيْنَ اللَّهِ قَرَابَةٌ وَ لَا لَنَا عَلَى اللَّهِ حُجَّةٌ وَ لَا نَتَقَرَّبُ إِلَى اللَّهِ إِلَّا بِالطَّاعَةِ فَمَنْ كَانَ مِنْكُمْ مُطِيعاً لِلَّهِ تَنْفَعُهُ وَلَايَتُنَا وَ مَنْ كَانَ مِنْكُمْ عَاصِياً لِلَّهِ لَمْ تَنْفَعْهُ وَلَايَتُنَا وَيْحَكُمْ لَا تَغْتَرُّوا وَيْحَكُمْ لَا تَغْتَرُّوا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from one of his companions, from Aban, from Amro Bin Khalid, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘O group of Shia, the Shia of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>! Take a central position. The exaggerator would return to you and the ‘Ta’aly’ would catch up with you’. So a man from the Helpers called Sa’ad, said, ‘May I be sacrificed for you<sup>asws</sup>! What is the exaggerator?’ He<sup>asws</sup> said: ‘People who are saying regarding us<sup>asws</sup> (that which) we<sup>asws</sup> are not saying regarding ourselves<sup>asws</sup>. So those are not from us<sup>asws</sup> and we<sup>asws</sup> are not from them’. He said, ‘So what is the ‘Ta’aly’?’ He<sup>asws</sup> said: ‘The apostate indenting the goodness. The goodness reaches him and he is Recompensed upon it’.\nThen he<sup style=\"font-weight: normal\">asws</sup> turned to face us and he<sup style=\"font-weight: normal\">asws</sup> said: ‘By Allah<sup style=\"font-weight: normal\">azwj</sup>! There is no freedom (from the Fire) with us<sup style=\"font-weight: normal\">asws</sup> from Allah<sup style=\"font-weight: normal\">azwj</sup>, nor is there between us<sup style=\"font-weight: normal\">asws</sup> and Allah<sup style=\"font-weight: normal\">azwj</sup> a relationship, nor is there an argument for us<sup style=\"font-weight: normal\">asws</sup> against Allah<sup style=\"font-weight: normal\">azwj</sup>, nor do we<sup style=\"font-weight: normal\">asws</sup> get closer to Allah<sup style=\"font-weight: normal\">azwj</sup> except by obedience. So the one from you who was obedient to Allah<sup style=\"font-weight: normal\">azwj</sup>, our<sup style=\"font-weight: normal\">asws</sup> Wilayah would benefit him, and the one from you who was disobedient to Allah<sup style=\"font-weight: normal\">azwj</sup>, our<sup style=\"font-weight: normal\">asws</sup> Wilayah would not benefit him. Woe be unto you! Do not be decieved. Woe be unto you! Do not be deceived’."}]}, {"index": 1619, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:2:1:36:7", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ مُفَضَّلِ بْنِ عُمَرَ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَذَكَرْنَا الْأَعْمَالَ فَقُلْتُ أَنَا مَا أَضْعَفَ عَمَلِي فَقَالَ مَهْ اسْتَغْفِرِ اللَّهَ ثُمَّ قَالَ لِي إِنَّ قَلِيلَ الْعَمَلِ مَعَ التَّقْوَى خَيْرٌ مِنْ كَثِيرِ الْعَمَلِ بِلَا تَقْوَى قُلْتُ كَيْفَ يَكُونُ كَثِيرٌ بِلَا تَقْوَى قَالَ نَعَمْ مِثْلُ الرَّجُلِ يُطْعِمُ طَعَامَهُ وَ يَرْفُقُ جِيرَانَهُ وَ يُوَطِّئُ رَحْلَهُ فَإِذَا ارْتَفَعَ لَهُ الْبَابُ مِنَ الْحَرَامِ دَخَلَ فِيهِ فَهَذَا الْعَمَلُ بِلَا تَقْوَى وَ يَكُونُ الْآخَرُ لَيْسَ عِنْدَهُ فَإِذَا ارْتَفَعَ لَهُ الْبَابُ مِنَ الْحَرَامِ لَمْ يَدْخُلْ فِيهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from usman Bin isa, from Mufazzal Bin Umar who said, \n‘I was in the Presence of Abu Abdullah<sup>asws</sup>, and we mentioned the deeds. So I said, ‘How weak are my deeds’. So he<sup>asws</sup> said: ‘Shh! Seek Forgiveness of Allah<sup>azwj</sup>’. Then he<sup>asws</sup> said to me: ‘The few deeds performed with the piety are better than the abundant deeds performed without piety’. I said, ‘How can a lot happen to be without piety?’ He<sup>asws</sup> said: ‘Yes, like the man who feeds the food, and is kind to his neighbours, and uses his belongings (for others). So when the door of the Prohibition is raised for him (an opportunity of committing sins presents itself to him), he enters into it. So this is the deed performed without piety; and another one can happen to be such that this is not with him, but when the door of the Prohibition is raised for him, he does not enter into it’."}]}, {"index": 1620, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:2:1:36:8", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَبِي دَاوُدَ الْمُسْتَرِقِّ عَنْ مُحَسِّنٍ الْمِيثَمِيِّ عَنْ يَعْقُوبَ بْنِ شُعَيْبٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ مَا نَقَلَ اللَّهُ عَزَّ وَ جَلَّ عَبْداً مِنْ ذُلِّ الْمَعَاصِي إِلَى عِزِّ التَّقْوَى إِلَّا أَغْنَاهُ مِنْ غَيْرِ مَالٍ وَ أَعَزَّهُ مِنْ غَيْرِ عَشِيرَةٍ وَ آنَسَهُ مِنْ غَيْرِ بَشَرٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Abu Dawood Al Mustariq, from Muhassin Al Maysami, from Yaqoub Bin Shuayb who said, \n‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Allah<sup>azwj</sup> Mighty and Majestic does not Transfer a servant from the disgrace of the disobedience to the honour of the piety except He<sup>azwj</sup> would Enrich him from without wealth, and Honour him from without a clan, and Give him companionship from without a person’."}]}]}, "index": "al-kafi:2:1:36", "kind": "verse_list"}