{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 4"
        },
        "path": "/books/al-kafi:2:1:4",
        "titles": {
          "ar": "بَابُ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) أَوَّلُ مَنْ أَجَابَ وَ أَقَرَّ لِلَّهِ عَزَّ وَ جَلَّ بِالرُّبُوبِيَّةِ",
          "en": "Chapter 4 – Rasool-Allah<sup>saww</sup> was the first one to answer and acknowledge to Allah<sup>azwj</sup> Mighty and Majestic with the Lordship"
        }
      }
    ],
    "index": 192,
    "local_index": 4,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 5"
        },
        "path": "/books/al-kafi:2:1:5",
        "titles": {
          "ar": "بَابُ كَيْفَ أَجَابُوا وَ هُمْ ذَرٌّ",
          "en": "Chapter 5 – How did they answer and they were particles"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:2:1:3",
        "titles": {
          "ar": "بَابٌ آخَرُ مِنْهُ",
          "en": "Chapter 3 – Another Chapter from it"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:4",
    "titles": {
      "ar": "بَابُ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) أَوَّلُ مَنْ أَجَابَ وَ أَقَرَّ لِلَّهِ عَزَّ وَ جَلَّ بِالرُّبُوبِيَّةِ",
      "en": "Chapter 4 – Rasool-Allah<sup>saww</sup> was the first one to answer and acknowledge to Allah<sup>azwj</sup> Mighty and Majestic with the Lordship"
    },
    "verse_count": 3,
    "verse_start_index": 1454,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/32)"
        ],
        "index": 1455,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:4:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ صَالِحِ بْنِ سَهْلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ بَعْضَ قُرَيْشٍ قَالَ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) بِأَيِّ شَيْ‏ءٍ سَبَقْتَ الْأَنْبِيَاءَ وَ أَنْتَ بُعِثْتَ آخِرَهُمْ وَ خَاتَمَهُمْ فَقَالَ إِنِّي كُنْتُ أَوَّلَ مَنْ آمَنَ بِرَبِّي وَ أَوَّلَ مَنْ أَجَابَ حَيْثُ أَخَذَ اللَّهُ مِيثَاقَ النَّبِيِّينَ وَ أَشْهَدَهُمْ عَلَى أَنْفُسِهِمْ أَ لَسْتُ بِرَبِّكُمْ فَكُنْتُ أَنَا أَوَّلَ نَبِيٍّ قَالَ بَلَى فَسَبَقْتُهُمْ بِالْإِقْرَارِ بِاللَّهِ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Salih Bin Sahl, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘One of the Qureysh said to Rasool-Allah<sup>saww</sup>, ‘By which thing do you<sup>saww</sup> precede the (other) Prophets<sup>as</sup>, and you<sup>saww</sup> were Sent at the end of them<sup>as</sup>, and as their<sup>as</sup> last?’ So he<sup>saww</sup> said: ‘I<sup>saww</sup> was the first one to believe in my<sup>saww</sup> Lord<sup>azwj</sup>, and the first one to answer when He<sup>azwj</sup> Took the Covenant of the Prophets<sup>as</sup> <span class=\"ibTxt\">[7:172] and made them testify against themselves: Am I not your Lord?</span> So I<sup>saww</sup> was the first Prophet<sup>saww</sup> to say: ‘Yes’. Thus I<sup>saww</sup> preceded them<sup>as</sup> with the acknowledgement in Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al- Hassan ibn Mahbub from Salih ibn Sahl fro abu ‘Abd Allah (a.s.) who has said the following: “Certain persons of Quraysh asked, ‘O messenger of Allah, by what means have you surpassed the prophets in excellence while you are the last and final one among them to come (with Divine message)?’ He replied, ‘I was the first among them to express my belief in my Lord and the first one to answer the call when Allah made a covenant with the prophets. He asked them to bear testimony against their ownselves that they have answered, affirmatively to Allah’s Question, “Am I not your Lord?” I was the first among the prophets to say, “Yes, O Lord, You are the Lord.” By expressing and affirming my belief in Allah, the Majestic, the Glorious, as the first one I surpassed them in excellence.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (33/ 7)"
        ],
        "index": 1456,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:4:2",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ إِنِّي لَأَرَى بَعْضَ أَصْحَابِنَا يَعْتَرِيهِ النَّزَقُ وَ الْحِدَّةُ وَ الطَّيْشُ فَأَغْتَمُّ لِذَلِكَ غَمّاً شَدِيداً وَ أَرَى مَنْ خَالَفَنَا فَأَرَاهُ حَسَنَ السَّمْتِ قَالَ لَا تَقُلْ حَسَنَ السَّمْتِ فَإِنَّ السَّمْتَ سَمْتُ الطَّرِيقِ وَ لَكِنْ قُلْ حَسَنَ السِّيمَاءِ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ سِيماهُمْ فِي وُجُوهِهِمْ مِنْ أَثَرِ السُّجُودِ",
          "قَالَ قُلْتُ فَأَرَاهُ حَسَنَ السِّيمَاءِ وَ لَهُ وَقَارٌ فَأَغْتَمُّ لِذَلِكَ قَالَ لَا تَغْتَمَّ لِمَا رَأَيْتَ مِنْ نَزَقِ أَصْحَابِكَ وَ لِمَا رَأَيْتَ مِنْ حُسْنِ سِيمَاءِ مَنْ خَالَفَكَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى لَمَّا أَرَادَ أَنْ يَخْلُقَ آدَمَ خَلَقَ تِلْكَ الطِّينَتَيْنِ ثُمَّ فَرَّقَهُمَا فِرْقَتَيْنِ فَقَالَ لِأَصْحَابِ الْيَمِينِ كُونُوا خَلْقاً بِإِذْنِي فَكَانُوا خَلْقاً بِمَنْزِلَةِ الذَّرِّ يَسْعَى وَ قَالَ لِأَهْلِ الشِّمَالِ كُونُوا خَلْقاً بِإِذْنِي فَكَانُوا خَلْقاً بِمَنْزِلَةِ الذَّرِّ يَدْرُجُ",
          "ثُمَّ رَفَعَ لَهُمْ نَاراً فَقَالَ ادْخُلُوهَا بِإِذْنِي فَكَانَ أَوَّلَ مَنْ دَخَلَهَا مُحَمَّدٌ ( صلى الله عليه وآله ) ثُمَّ اتَّبَعَهُ أُولُو الْعَزْمِ مِنَ الرُّسُلِ وَ أَوْصِيَاؤُهُمْ وَ أَتْبَاعُهُمْ ثُمَّ قَالَ لِأَصْحَابِ الشِّمَالِ ادْخُلُوهَا بِإِذْنِي فَقَالُوا رَبَّنَا خَلَقْتَنَا لِتُحْرِقَنَا فَعَصَوْا",
          "فَقَالَ لِأَصْحَابِ الْيَمِينِ اخْرُجُوا بِإِذْنِي مِنَ النَّارِ لَمْ تَكْلِمِ النَّارُ مِنْهُمْ كَلْماً وَ لَمْ تُؤَثِّرْ فِيهِمْ أَثَراً فَلَمَّا رَآهُمْ أَصْحَابُ الشِّمَالِ قَالُوا رَبَّنَا نَرَى أَصْحَابَنَا قَدْ سَلِمُوا فَأَقِلْنَا وَ مُرْنَا بِالدُّخُولِ قَالَ قَدْ أَقَلْتُكُمْ فَادْخُلُوهَا",
          "فَلَمَّا دَنَوْا وَ أَصَابَهُمُ الْوَهَجُ رَجَعُوا فَقَالُوا يَا رَبَّنَا لَا صَبْرَ لَنَا عَلَى الِاحْتِرَاقِ فَعَصَوْا فَأَمَرَهُمْ بِالدُّخُولِ ثَلَاثاً كُلَّ ذَلِكَ يَعْصُونَ وَ يَرْجِعُونَ وَ أَمَرَ أُولَئِكَ ثَلَاثاً كُلَّ ذَلِكَ يُطِيعُونَ وَ يَخْرُجُونَ فَقَالَ لَهُمْ كُونُوا طِيناً بِإِذْنِي فَخَلَقَ مِنْهُ آدَمَ",
          "قَالَ فَمَنْ كَانَ مِنْ هَؤُلَاءِ لَا يَكُونُ مِنْ هَؤُلَاءِ وَ مَنْ كَانَ مِنْ هَؤُلَاءِ لَا يَكُونُ مِنْ هَؤُلَاءِ وَ مَا رَأَيْتَ مِنْ نَزَقِ أَصْحَابِكَ وَ خُلُقِهِمْ فَمِمَّا أَصَابَهُمْ مِنْ لَطْخِ أَصْحَابِ الشِّمَالِ وَ مَا رَأَيْتَ مِنْ حُسْنِ سِيمَاءِ مَنْ خَالَفَكُمْ وَ وَقَارِهِمْ فَمِمَّا أَصَابَهُمْ مِنْ لَطْخِ أَصْحَابِ الْيَمِينِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Muhammad Bin Khalid, from one of our companions, from Abdullah Bin Sinan who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! I see one of our companions as being temperamental, and irritable and reckless. So I become gloomy due to that with intense gloom; and I see the one who opposes us, and I see him being on a good way’. He<sup>asws</sup> said: ‘Do not say, ‘good way’, for the السَّمْتَ is the way of the path, but say, ‘good appearance’, for Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\">[48:29] their marks are in their faces because of the effect of prostrations</span>’.",
            "He (the narrator) said, ‘I said, ‘So I see him of the good appearance, and for him is dignity. So, I become gloomy due to that’. He<sup>asws</sup> said: ‘Do not be gloomy due to what you see from the irritability of your companions, and due to what you see from the goodly appearance of the one opposed to you. When Allah<sup>azwj</sup> Blessed and High Intended to Create Adam<sup>as</sup>, Created those two clays, then separated between the two as two parts. So He<sup>azwj</sup> Said to the companions of the right: “Be Created by My<sup>azwj</sup> Permission!” So they became creatures at the status of the particles running around; and He<sup>azwj</sup> Said to the people of the left: “Be Created by My<sup>azwj</sup> Permission!” So they became creatures at the status of the particles toddling around.",
            "Then He<sup>azwj</sup> Raised a fire for them, and He<sup>azwj</sup> Said: ‘Enter into it by My<sup>azwj</sup> Permission!” So the first one to enter it was Muhammad<sup>saww</sup>. Then the Determined ones (<span class=\"iTxt\">Ul Al-Azam</span>) from the Rasools<sup>as</sup> followed him<sup>saww</sup>, and their<sup>as</sup> successors<sup>as</sup>, and their<sup>as</sup> followers. Then He<sup>azwj</sup> Said to the companions of the left: ‘Enter into it by My<sup>azwj</sup> Permission!” So they said, ‘Our Lord<sup>azwj</sup>! You<sup>azwj</sup> Created us to incinerate us?’ So they disobeyed.",
            "So He<sup>azwj</sup> Said to the companions of the right: “Come out by My<sup>azwj</sup> Permission, from the fire!” The fire did not injure any of them with an injury and did not leave any traces of its effects. So when the companions of the left saw them, they said, ‘Our Lord<sup>azwj</sup>! We saw our companions have been saved. So Forgive us and Command us with the entering’. He<sup>azwj</sup> Said: “I<sup>azwj</sup> have Forgiven you, so enter into it!” ",
            "So when they approached and the terror hit them, they returned and they said, ‘O our Lord<sup>azwj</sup>! There is no patience for us upon the burning’, and they disobeyed. So He<sup>azwj</sup> Commanded with the entering, thrice, during each of that they were disobeying and they were returning, and He<sup>azwj</sup> Commanded those ones thrice, during each of that they were obeying and were coming out. So He<sup>azwj</sup> Said to them (all): “Be clay, by My<sup>azwj</sup> Permission!” So He<sup>azwj</sup> Created Adam<sup>as</sup> from it. ",
            "He<sup>asws</sup> said: ‘So the one who was from these would not happen to be from those, and the one who was from those would not happen to be from these, and whatever you see from the irritability of your companion and their mannerisms, so it is from what had hit them from the stains of the companions of the left; and whatever you see from the goodly appearance of the ones opposed to you, and their dignity, so it is from what hit them from the stains of the companions of the right’."
          ],
          "en.sarwar": [
            "2. Ahmad ibn Muhammad has narrated from Muhammad ibn Khalid from certain persons of our people from ‘ Abd Allah ibn Sinan who has said the following: “Once I said to abu ‘Abd Allah (a.s.) ‘May Allah keep my soul in service for your cause, I find certain persons of our people who seem light-minded and very temperamental and this extremely saddens me. On the other hand 1 find certain persons of those who do not accept our belief seem to (have very good Simt) be very dignified.’ The Imam said, ‘Do not call it Simt because Simt means straight path. Call it Dignified appearance because Allah, the Majestic, the Glorious, has said, “They have marks of the effects of frequent prostration on their faces,”’ (48:29). I (the narrator) then said, ‘I see them to be of good appearance and of dignity and this makes me very sad.’ The Imam said, ‘Do not feel sad for what you see of light-mindedness and temperamental conditions of your people and the good appearance of those who do not accept your belief. When Allah, the Most Holy, the Most High, willed to create Adam, He created those two kinds of clay. He then divided them into two portions. To the people of the right hand He said, “Be a creature by My permission.” They became creatures that looked like small particles running around. He then said to the people of the left hand, “Be a creature by My permission.” They became a creature as small particles that crawled. He then started a fire for them and said to them, “Enter therein by My permission.” The first one who entered therein was Muhammad (a.s.) followed by the ‘Ulu al-’Azm messengers, their successors and their followers. He then said to the people of the left hand, “Enter therein by My permission.” They said, “Our Lord, have you created us just to burn?” They disobeyed. He then said to the people of the right hand, “Come out from the fire by My permission” and the fire had caused no injuries to any of them and had left no marks on any one of them. When the people of the left hand saw this they said, “Our Lord, we see our people have come out safe and sound from the fire. Lord, forgive us and command us to enter the fire.” The Lord said, “I Have forgiven you, now you must enter the fire.” They went near the fire but when they felt the heat of the fire they turned back and said, “Our Lord, we are not able to endure the fire burning us and they disobeyed.” He commanded those ones three times to enter into the fire but every time they disobeyed and turned back. He commanded the others three times, each time they obeyed and came out of the fire. He then said to them, “Be a clay by My permission.” He then created Adam therefrom.’ The Imam then said, ‘Whoever is of those will never become of these (people of the right hand) and whoever is from these will never become of those ones (people of the left hand). When you find your people as light-minded ones and it causes sadness to you it is because of their mix with people of the left hand. The good appearance and dignity that you find in those who do not accept your belief is because of their mix with the people of the right hand.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (36/ 7)"
        ],
        "index": 1457,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:4:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ سَعْدَانَ بْنِ مُسْلِمٍ عَنْ صَالِحِ بْنِ سَهْلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سُئِلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِأَيِّ شَيْ‏ءٍ سَبَقْتَ وُلْدَ آدَمَ قَالَ إِنِّي أَوَّلُ مَنْ أَقَرَّ بِرَبِّي إِنَّ اللَّهَ أَخَذَ مِيثَاقَ النَّبِيِّينَ وَ أَشْهَدَهُمْ عَلَى أَنْفُسِهِمْ أَ لَسْتُ بِرَبِّكُمْ قَالُوا بَلَى فَكُنْتُ أَوَّلَ مَنْ أَجَابَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ali Bin Ismail, from Muhammad Bin Ismail, from Sa’dan Bin Muslim, from Salih Bin Sahl, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> was asked, ‘By which thing do you<sup>saww</sup> precede the children of Adam<sup>as</sup>?’ He<sup>saww</sup> said: ‘I<sup>saww</sup> was the first one to acknowledge with my<sup>saww</sup> Lord<sup>azwj</sup>. Allah<sup>azwj</sup> Took the Covenant of the Prophets<sup>as</sup> <span class=\"ibTxt\">[7:172] and made them testify against themselves: Am I not your Lord? They said: Yes!</span> So I<sup>saww</sup> was the first one to answer’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Ali ibn ‘Isma’il from Muhammad ibn ‘Isma’il from Sa’dan ibn Muslim from Salih ibn Sahl from abu ‘Abd Allah (a.s.) who has said the following: “The messenger of Allah was asked, ‘By what means have you surpassed other descendents of Adam?’ He said, ‘I was the first one to affirm my faith in my Lord. Allah established a covenant with the prophets and made them to bear testimony against their own souls when the Lord asked, “Am I not your Lord.” They all said, “Yes, You are the Lord.” I was the first one to answer that question positively.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:4",
  "kind": "verse_list"
}