{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:2:1", "titles": {"ar": "كتاب الإيمان و الكفر", "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"}}, {"indexed_titles": {"en": "Chapter 42"}, "path": "/books/al-kafi:2:1:42", "titles": {"ar": "بَابُ الْعِبَادَةِ", "en": "Chapter 42 – The worship"}}], "index": 230, "local_index": 42, "part_type": "Chapter", "path": "/books/al-kafi:2:1:42", "titles": {"ar": "بَابُ الْعِبَادَةِ", "en": "Chapter 42 – The worship"}, "verse_count": 7, "verse_start_index": 1660, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 1661, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:1:42:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عُمَرَ بْنِ يَزِيدَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي التَّوْرَاةِ مَكْتُوبٌ يَا ابْنَ آدَمَ تَفَرَّغْ لِعِبَادَتِي أَمْلَأُ قَلْبَكَ غِنًى وَ لَا أَكِلْكَ إِلَى طَلَبِكَ وَ عَلَيَّ أَنْ أَسُدَّ فَاقَتَكَ وَ أَمْلَأَ قَلْبَكَ خَوْفاً مِنِّي وَ إِنْ لَا تَفَرَّغْ لِعِبَادَتِي أَمْلَأُ قَلْبَكَ شُغُلًا بِالدُّنْيَا ثُمَّ لَا أَسُدَّ فَاقَتَكَ وَ أَكِلْكَ إِلَى طَلَبِكَ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Ibn Mahboub, from Umar Bin Yazeed, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It is written in the Torah: ‘O son of Adam<sup>as</sup>! Free yourself for My<sup>azwj</sup>worship, I<sup>azwj</sup> shall Fill your heart with riches and will not Fatigue you to your seeking (sustenance), and it would be upon Me<sup>azwj</sup> to Aim to excel you and fill your heart with fear from Me<sup>azwj</sup>, and that if you don’t free yourself for My<sup>azwj</sup> worship, I<sup>azwj</sup> shall fill your heart with a pre-occupation with the world, then I<sup>azwj</sup> will not excel you and will Exhaust you to the seeking (of the livelihood)’."]}}, {"index": 1662, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:1:42:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِي جَمِيلَةَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَالَ اللَّهُ تَبَارَكَ وَ تَعَالَى يَا عِبَادِيَ الصِّدِّيقِينَ تَنَعَّمُوا بِعِبَادَتِي فِي الدُّنْيَا فَإِنَّكُمْ تَتَنَعَّمُونَ بِهَا فِي الْآخِرَةِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Muhammad Bin Isa, from Abu Jameela who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Blessed and High Said: “O My<sup>azwj</sup> servants, the truthful ones! Enjoy with My<sup>azwj</sup> worship in the world, so you would be enjoying with it in the Hereafter’."]}}, {"index": 1663, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:2:1:42:3", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ عَمْرِو بْنِ جُمَيْعٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَفْضَلُ النَّاسِ مَنْ عَشِقَ الْعِبَادَةَ فَعَانَقَهَا وَ أَحَبَّهَا بِقَلْبِهِ وَ بَاشَرَهَا بِجَسَدِهِ وَ تَفَرَّغَ لَهَا فَهُوَ لَا يُبَالِي عَلَى مَا أَصْبَحَ مِنَ الدُّنْيَا عَلَى عُسْرٍ أَمْ عَلَى يُسْرٍ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Amro Bin Jumie, ", "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> having said: ‘Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> said: ‘The most superior of the people is the one who has passion for the worship. So he embraces it, and loves it, and undertakes it with his body and frees himself for it. Thus, he does not care upon what he becomes from the world – upon difficulties or upon ease’."]}}, {"index": 1664, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:2:1:42:4", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ شَاذَانَ بْنِ الْخَلِيلِ قَالَ وَ كَتَبْتُ مِنْ كِتَابِهِ بِإِسْنَادٍ لَهُ يَرْفَعُهُ إِلَى عِيسَى بْنِ عَبْدِ اللَّهِ قَالَ قَالَ عِيسَى بْنُ عَبْدِ اللَّهِ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ مَا الْعِبَادَةُ قَالَ حُسْنُ النِّيَّةِ بِالطَّاعَةِ مِنَ الْوُجُوهِ الَّتِي يُطَاعُ اللَّهُ مِنْهَا أَمَا إِنَّكَ يَا عِيسَى لَا تَكُونُ مُؤْمِناً حَتَّى تَعْرِفَ النَّاسِخَ مِنَ الْمَنْسُوخِ ", "قَالَ قُلْتُ جُعِلْتُ فِدَاكَ وَ مَا مَعْرِفَةُ النَّاسِخِ مِنَ الْمَنْسُوخِ قَالَ فَقَالَ أَ لَيْسَ تَكُونُ مَعَ الْإِمَامِ مُوَطِّناً نَفْسَكَ عَلَى حُسْنِ النِّيَّةِ فِي طَاعَتِهِ فَيَمْضِي ذَلِكَ الْإِمَامُ وَ يَأْتِي إِمَامٌ آخَرُ فَتُوَطِّنُ نَفْسَكَ عَلَى حُسْنِ النِّيَّةِ فِي طَاعَتِهِ قَالَ قُلْتُ نَعَمْ قَالَ هَذَا مَعْرِفَةُ النَّاسِخِ مِنَ الْمَنْسُوخِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Shazaan Bin Al Khaleel who said, ‘And a letter from a letter of his, raising it to Isa Bin Abdullah said, ", "‘Isa Bin Abdullah said to Abu Abdullah<sup>asws</sup>, ‘May I be sacrificed for your<sup>asws</sup>! What is the worship?’ He<sup>asws</sup> said: ‘The good intention in obedience (to Allah<sup>azwj</sup>) from the aspect which Allah<sup>azwj</sup> can be obeyed from. As for you, O Isa, you cannot become a Believer until you recognise the Abrogating from the Abrogated (Verses of the Holy Quran)’. ", "He (the narrator) said, ‘I said, ‘May I be sacrificed for you<sup style=\"font-weight: normal\">asws</sup>! And what is the recognition of the Abrgating from the Abrogated?’ So he<sup style=\"font-weight: normal\">asws</sup> said: ‘Do you not happen to be with the Imam<sup style=\"font-weight: normal\">asws</sup>, placed in your self upon the good intention, being in his<sup style=\"font-weight: normal\">asws</sup> obedience. So that Imam<sup style=\"font-weight: normal\">asws</sup> passes away and another Imam<sup style=\"font-weight: normal\">asws</sup> comes, so you place yourself upon the good intention of being in his<sup style=\"font-weight: normal\">asws</sup> obedience?’ I said, ‘Yes’. He<sup style=\"font-weight: normal\">asws</sup> said: ‘This is the recognition of the Abgrogating and the Abrogated’."]}}, {"index": 1665, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:2:1:42:5", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلٍ عَنْ هَارُونَ بْنِ خَارِجَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْعُبَّادَ ثَلَاثَةٌ قَوْمٌ عَبَدُوا اللَّهَ عَزَّ وَ جَلَّ خَوْفاً فَتِلْكَ عِبَادَةُ الْعَبِيدِ وَ قَوْمٌ عَبَدُوا اللَّهَ تَبَارَكَ وَ تَعَالَى طَلَبَ الثَّوَابِ فَتِلْكَ عِبَادَةُ الْأُجَرَاءِ وَ قَوْمٌ عَبَدُوا اللَّهَ عَزَّ وَ جَلَّ حُبّاً لَهُ فَتِلْكَ عِبَادَةُ الْأَحْرَارِ وَ هِيَ أَفْضَلُ الْعِبَادَةِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Jameel, from Haroun Bin Kharjat, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The worshippers are three (types) – There is a group who are worshipping Allah<sup>azwj</sup> Mighty and Majestic out of fear. So that is the worship of the slaves; and there is a group who is worshipping Allah<sup>azwj</sup> Blessed and High seeking the Rewards. So that is the worship of the employees; and there is a group who is worshipping Allah<sup>azwj</sup> Mighty and Majestic out of love for Him<sup>azwj</sup>. So that is the worship of the free ones, and it is the most superior of the worships’."]}}, {"index": 1666, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:2:1:42:6", "text": ["عَلِيٌّ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَا أَقْبَحَ الْفَقْرَ بَعْدَ الْغِنَى وَ أَقْبَحَ الْخَطِيئَةَ بَعْدَ الْمَسْكَنَةِ وَ أَقْبَحُ مِنْ ذَلِكَ الْعَابِدُ لِلَّهِ ثُمَّ يَدَعُ عِبَادَتَهُ ."], "translations": {"en.hubeali": ["Ali, from his father, from Al Nowfaly, from Al Sakuny, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘How ugly is the poverty after the enrichment, and the ugliness of the sinning after the destitution, and uglier than that is the worship of Allah<sup>azwj</sup>, then leaving His<sup>azwj</sup> worship’."]}}, {"index": 1667, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:2:1:42:7", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي حَمْزَةَ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) قَالَ مَنْ عَمِلَ بِمَا افْتَرَضَ اللَّهُ عَلَيْهِ فَهُوَ مِنْ أَعْبَدِ النَّاسِ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washa, from Aasim Bin Humeyd, from Abu Hamza, ", "(It has been narrated) from Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> having said: ‘The one who act by what Allah<sup>azwj</sup> has Obligated upon him, so he is the most worshipping one of the people’."]}}]}, "index": "al-kafi:2:1:42", "kind": "verse_list"}