{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:2:1", "titles": {"ar": "كتاب الإيمان و الكفر", "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"}}, {"indexed_titles": {"en": "Chapter 44"}, "path": "/books/al-kafi:2:1:44", "titles": {"ar": "بَابٌ", "en": "Chapter 44 – A Chapter"}}], "index": 232, "local_index": 44, "part_type": "Chapter", "path": "/books/al-kafi:2:1:44", "titles": {"ar": "بَابٌ", "en": "Chapter 44 – A Chapter"}, "verse_count": 2, "verse_start_index": 1672, "verses": [{"index": 1673, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:1:44:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنِ الْأَحْوَلِ عَنْ سَلَّامِ بْنِ الْمُسْتَنِيرِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَلَا إِنَّ لِكُلِّ عِبَادَةٍ شِرَّةً ثُمَّ تَصِيرُ إِلَى فَتْرَةٍ فَمَنْ صَارَتْ شِرَّةُ عِبَادَتِهِ إِلَى سُنَّتِي فَقَدِ اهْتَدَى وَ مَنْ خَالَفَ سُنَّتِي فَقَدْ ضَلَّ وَ كَانَ عَمَلُهُ فِي تَبَابٍ أَمَا إِنِّي أُصَلِّي وَ أَنَامُ وَ أَصُومُ وَ أُفْطِرُ وَ أَضْحَكُ وَ أَبْكِي فَمَنْ رَغِبَ عَنْ مِنْهَاجِي وَ سُنَّتِي فَلَيْسَ مِنِّي \nوَ قَالَ كَفَى بِالْمَوْتِ مَوْعِظَةً وَ كَفَى بِالْيَقِينِ غِنًى وَ كَفَى بِالْعِبَادَةِ شُغُلًا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from Al Ahowl, from Sallam Bin Al Mustaneer, \n(It has been narrated) from Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> having said: ‘Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> said: ‘Indeed! Every worship has a vigour, then it comes to the nature. So the one who becomes vigorous in his worship to my<sup style=\"font-weight: normal\">saww</sup> Sunnah, so he has been Guided, and the one who opposes my<sup style=\"font-weight: normal\">saww</sup> Sunnah, so he has strayed, and his deeds would be in ruination. As for me<sup style=\"font-weight: normal\">saww</sup>, I<sup style=\"font-weight: normal\">saww</sup> pray <span class=\"iTxt\">Salāt</span>, and sleep, and Fast, and break the Fast, and smile, and cry. So the one who turns away from my<sup style=\"font-weight: normal\">saww</sup> Manifesto and my<sup style=\"font-weight: normal\">saww</sup> Sunnah, so he is not from me<sup style=\"font-weight: normal\">saww</sup>’.  \nAnd he<sup style=\"font-weight: normal\">asws</sup> said: ‘Suffice with death as an exhortation, and suffice with the conviction as affluence, and suffice with the worship as a pre-occupation’."}]}, {"index": 1674, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:1:44:2", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَجَّالِ عَنْ ثَعْلَبَةَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لِكُلِّ أَحَدٍ شِرَّةٌ وَ لِكُلِّ شِرَّةٍ فَتْرَةٌ فَطُوبَى لِمَنْ كَانَتْ فَتْرَتُهُ إِلَى خَيْرٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Al Hajjal, from Sa’alba who said, \n‘Abu Abdullah<sup>asws</sup> said: ‘For everyone is an enthusiasm, and every enthusiasm has a decline. So ‘<span class=\"iTxt\">Tuba</span>’ (a tree in the Paradise) is for the one whose nature was to goodness’."}]}]}, "index": "al-kafi:2:1:44", "kind": "verse_list"}