{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:2:1", "titles": {"ar": "كتاب الإيمان و الكفر", "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"}}, {"indexed_titles": {"en": "Chapter 47"}, "path": "/books/al-kafi:2:1:47", "titles": {"ar": "بَابُ الصَّبْرِ", "en": "Chapter 47 – The Patience"}}], "index": 235, "local_index": 47, "part_type": "Chapter", "path": "/books/al-kafi:2:1:47", "titles": {"ar": "بَابُ الصَّبْرِ", "en": "Chapter 47 – The Patience"}, "verse_count": 25, "verse_start_index": 1682, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 1683, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنِ ابْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الصَّبْرُ رَأْسُ الْإِيمَانِ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Al Hassan Bin Mahboub, from Ali Bin Raib, from Ibn Abu Yafour, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The patience is the head of the <span class=\"iTxt\">Emān</span>’."]}}, {"index": 1684, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:2", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الْعَلَاءِ بْنِ فُضَيْلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الصَّبْرُ مِنَ الْإِيمَانِ بِمَنْزِلَةِ الرَّأْسِ مِنَ الْجَسَدِ فَإِذَا ذَهَبَ الرَّأْسُ ذَهَبَ الْجَسَدُ كَذَلِكَ إِذَا ذَهَبَ الصَّبْرُ ذَهَبَ الْإِيمَانُ ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Sinan, from Al A’ala Bin Fuzayl, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The patience is from the <span class=\"iTxt\">Emān</span> at the status of the head to the body. So when the head is gone, the body is gone. Similar to that, when the patience goes, the <span class=\"iTxt\">Emān</span> is gone’."]}}, {"index": 1685, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:3", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ جَمِيعاً عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ الْأَصْبَهَانِيِّ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْمِنْقَرِيِّ عَنْ حَفْصِ بْنِ غِيَاثٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا حَفْصُ إِنَّ مَنْ صَبَرَ صَبَرَ قَلِيلًا وَ إِنَّ مَنْ جَزِعَ جَزِعَ قَلِيلًا ", "ثُمَّ قَالَ عَلَيْكَ بِالصَّبْرِ فِي جَمِيعِ أُمُورِكَ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ بَعَثَ مُحَمَّداً ( صلى الله عليه وآله ) فَأَمَرَهُ بِالصَّبْرِ وَ الرِّفْقِ فَقَالَ وَ اصْبِرْ عَلى ما يَقُولُونَ وَ اهْجُرْهُمْ هَجْراً جَمِيلًا وَ ذَرْنِي وَ الْمُكَذِّبِينَ أُولِي النَّعْمَةِ ", "وَ قَالَ تَبَارَكَ وَ تَعَالَى ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ [السَّيِّئَةَ] فَإِذَا الَّذِي بَيْنَكَ وَ بَيْنَهُ عَداوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ وَ ما يُلَقَّاها إِلَّا الَّذِينَ صَبَرُوا وَ ما يُلَقَّاها إِلَّا ذُو حَظٍّ عَظِيمٍ", "فَصَبَرَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) حَتَّى نَالُوهُ بِالْعَظَائِمِ وَ رَمَوْهُ بِهَا فَضَاقَ صَدْرُهُ فَأَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ عَلَيْهِ وَ لَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِما يَقُولُونَ فَسَبِّحْ بِحَمْدِ رَبِّكَ وَ كُنْ مِنَ السَّاجِدِينَ", "ثُمَّ كَذَّبُوهُ وَ رَمَوْهُ فَحَزِنَ لِذَلِكَ فَأَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ قَدْ نَعْلَمُ إِنَّهُ لَيَحْزُنُكَ الَّذِي يَقُولُونَ فَإِنَّهُمْ لا يُكَذِّبُونَكَ وَ لكِنَّ الظَّالِمِينَ بِآياتِ اللَّهِ يَجْحَدُونَ وَ لَقَدْ كُذِّبَتْ رُسُلٌ مِنْ قَبْلِكَ فَصَبَرُوا عَلى ما كُذِّبُوا وَ أُوذُوا حَتَّى أَتاهُمْ نَصْرُنا", "فَأَلْزَمَ النَّبِيُّ ( صلى الله عليه وآله ) نَفْسَهُ الصَّبْرَ فَتَعَدَّوْا فَذَكَرَ اللَّهَ تَبَارَكَ وَ تَعَالَى وَ كَذَّبُوهُ فَقَالَ قَدْ صَبَرْتُ فِي نَفْسِي وَ أَهْلِي وَ عِرْضِي وَ لَا صَبْرَ لِي عَلَى ذِكْرِ إِلَهِي فَأَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ وَ لَقَدْ خَلَقْنَا السَّماواتِ وَ الْأَرْضَ وَ ما بَيْنَهُما فِي سِتَّةِ أَيَّامٍ وَ ما مَسَّنا مِنْ لُغُوبٍ فَاصْبِرْ عَلى ما يَقُولُونَ", "فَصَبَرَ النَّبِيُّ ( صلى الله عليه وآله ) فِي جَمِيعِ أَحْوَالِهِ ثُمَّ بُشِّرَ فِي عِتْرَتِهِ بِالْأَئِمَّةِ وَ وُصِفُوا بِالصَّبْرِ فَقَالَ جَلَّ ثَنَاؤُهُ وَ جَعَلْنا مِنْهُمْ أَئِمَّةً يَهْدُونَ بِأَمْرِنا لَمَّا صَبَرُوا وَ كانُوا بِآياتِنا يُوقِنُونَ", "فَعِنْدَ ذَلِكَ قَالَ ( صلى الله عليه وآله ) الصَّبْرُ مِنَ الْإِيمَانِ كَالرَّأْسِ مِنَ الْجَسَدِ فَشَكَرَ اللَّهُ عَزَّ وَ جَلَّ ذَلِكَ لَهُ فَأَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ وَ تَمَّتْ كَلِمَتُ رَبِّكَ الْحُسْنى عَلى بَنِي إِسْرائِيلَ بِما صَبَرُوا وَ دَمَّرْنا ما كانَ يَصْنَعُ فِرْعَوْنُ وَ قَوْمُهُ وَ ما كانُوا يَعْرِشُونَ", "فَقَالَ ( صلى الله عليه وآله ) إِنَّهُ بُشْرَى وَ انْتِقَامٌ فَأَبَاحَ اللَّهُ عَزَّ وَ جَلَّ لَهُ قِتَالَ الْمُشْرِكِينَ فَأَنْزَلَ اللَّهُ فَاقْتُلُوا الْمُشْرِكِينَ حَيْثُ وَجَدْتُمُوهُمْ وَ خُذُوهُمْ وَ احْصُرُوهُمْ وَ اقْعُدُوا لَهُمْ كُلَّ مَرْصَدٍ وَ اقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُمْ ", "فَقَتَلَهُمُ اللَّهُ عَلَى يَدَيْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ أَحِبَّائِهِ وَ جَعَلَ لَهُ ثَوَابَ صَبْرِهِ مَعَ مَا ادَّخَرَ لَهُ فِي الْآخِرَةِ فَمَنْ صَبَرَ وَ احْتَسَبَ لَمْ يَخْرُجْ مِنَ الدُّنْيَا حَتَّى يُقِرَّ اللَّهُ لَهُ عَيْنَهُ فِي أَعْدَائِهِ مَعَ مَا يَدَّخِرُ لَهُ فِي الْآخِرَةِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, and Ali Bin Muhammad Al Qasany, altogether from Al qasim Bin Muhammad Al Asbahany, from Suleyman Bin Dawood Al Minqary, from Hafs Bin Giyas who said, ", "‘The one who observes patience, is patient (for a) little while, and the one who panics, panics (for a) little while’. ", "Then he<sup>asws</sup> said: ‘Upon you is to be with the patience in the entirety of your affairs, for when Allah<sup>azwj</sup> Mighty and Majestic Sent Muhammad<sup>saww</sup>, He<sup>azwj</sup> Commanded him<sup>saww</sup> with the observance of patience and the gentleness, so He<sup>azwj</sup> Said <span class=\"ibTxt\">[73:10] And bear patiently at what they say and avoid them with a becoming avoidance [73:11] And leave Me and the rejecters, the possessors of ease and plenty</span>. ", "And the Blessed and High Said <span class=\"ibTxt\">[41:34] Refute (evil) with what is best, So if there is enmity between you and him, (he would be) as if he is an intimate friend</span>. <span class=\"ibTxt\">[41:35] And none are made to receive it but those who are patient, and none are made to receive it but those who have a great share</span>. ", "So Rasool-Allah<sup>saww</sup> was patient to the extent that they came to him<sup>saww</sup> with the bones (of the animals) and hit him<sup>saww</sup> with these. So his<sup>saww</sup> chest was constricted, and Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>saww</sup> <span class=\"ibTxt\">[15:97] And We Know that you tend to constrict your chest at what they are saying [15:98] Therefore Glorify with the Praise of your Lord, and become from the Prostrating ones</span>. ", "Then they belied him<sup>saww</sup> and hit him<sup>as</sup>, so he<sup>saww</sup> was grieved due to that. So Allah<sup>azwj</sup> Mighty and Majestic Revealed <span class=\"ibTxt\">[6:33] We know indeed that what they say certainly grieves you, but surely they cannot call you a liar; but the unjust deny the Signs of Allah [6:34] And certainly Rasools before you were belied, but they were patient on being belied and persecuted until Our Help came to them</span>. ", "So the Prophet<sup>saww</sup> necessitated the patience upon himself<sup>saww</sup>. But, they transgressed and mentioned Allah<sup>azwj</sup> Blessed and High and belied Him<sup>azwj</sup>. So he<sup>saww</sup> said: ‘I<sup>saww</sup> have been patient with regards to myself<sup>saww</sup> and my<sup>saww</sup> family and my<sup>saww</sup> honour, and (but) there is no patience for me<sup>saww</sup> upon the mention of my<sup>saww</sup> God. So Allah<sup>azwj</sup> Mighty and Majestic Revealed <span class=\"ibTxt\">[50:38] And We have Created the skies and the earth and what is between them in six days and there touched Us not any fatigue [50:39] Therefore be patient of what they are saying</span>.", "So the Prophet<sup>saww</sup> was patient during the entirety of his<sup>saww</sup> states. Then He<sup>azwj</sup> Gave him<sup>saww</sup> the glad tidings regarding his<sup>saww</sup> offspring with the Imamate, and described it with the patience, so He<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Praise, Said <span class=\"ibTxt\">[32:24] And We Made of them Imams to Guide by Our Command when they were patient, and they were certain of Our Signs</span>.", "So during that, he<sup>saww</sup> said: ‘The patience from the <span class=\"iTxt\">Emān</span> is like the head to the body’. So he<sup>saww</sup> thanked Allah<sup>azwj</sup> Mighty and Majestic for it. So Allah<sup>azwj</sup> Mighty and Majestic Revealed <span class=\"ibTxt\">[7:137] and the Good Word of your Lord was fulfilled in the Children of Israel because they bore up (sufferings) patiently; and We utterly Destroyed what Pharaoh and his people had wrought and what they built</span>. ", "So he<sup>saww</sup> said: ‘It is Glad tidings and a revenge’. So Allah<sup>azwj</sup> Mighty and Majestice Permitted for him to fight against the Polytheists. So Allah<sup>azwj</sup> Revealed <span class=\"ibTxt\">[9:5] So when the Sacred Months have passed away, then fight the Polytheists wherever you find them, and take them captives and besiege them and lie in wait for them in every ambush [2:191] And kill them wherever you find them</span>.", "Thus, Allah<sup style=\"font-weight: normal\">azwj</sup> Killed them upon the hands of Rasool-Allah<sup style=\"font-weight: normal\">saww</sup>, and his<sup style=\"font-weight: normal\">saww</sup> beloved ones, and Made for him<sup style=\"font-weight: normal\">saww</sup> the Rewards of his<sup style=\"font-weight: normal\">saww</sup> patience along with what He<sup style=\"font-weight: normal\">azwj</sup> had Horaded for him<sup style=\"font-weight: normal\">saww</sup> in the Hereafter. Therefore, the one who is patient and is contented, would not exit from the world until Allah<sup style=\"font-weight: normal\">azwj</sup> Delights his eyes along with what He<sup style=\"font-weight: normal\">azwj</sup> has Hoarded for him in the Hereafter’."]}}, {"index": 1686, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:4", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي مُحَمَّدٍ عَبْدِ اللَّهِ السَّرَّاجِ رَفَعَهُ إِلَى عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) قَالَ الصَّبْرُ مِنَ الْإِيمَانِ بِمَنْزِلَةِ الرَّأْسِ مِنَ الْجَسَدِ وَ لَا إِيمَانَ لِمَنْ لَا صَبْرَ لَهُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Abu Muhammad Abdullah Al Sarraj, ", "(It has been narrated) raising it to Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> having said: ‘The patience from the <span class=\"iTxt\">Emān</span> is at the status of the head to the body, and there is no <span class=\"iTxt\">Emān</span> for the one who has no patience for him’."]}}, {"index": 1687, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:5", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيِّ بْنِ عَبْدِ اللَّهِ عَنْ فُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الصَّبْرُ مِنَ الْإِيمَانِ بِمَنْزِلَةِ الرَّأْسِ مِنَ الْجَسَدِ فَإِذَا ذَهَبَ الرَّأْسُ ذَهَبَ الْجَسَدُ كَذَلِكَ إِذَا ذَهَبَ الصَّبْرُ ذَهَبَ الْإِيمَانُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Rabie Bin Abdullah, from Fuzayl Bin Yasaar, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The patience is from the <span class=\"iTxt\">Emān</span> at the status of the head from the body. So when the head goes, the body is gone. Similar to that is when the patience goes, the <span class=\"iTxt\">Emān</span> is gone’."]}}, {"index": 1688, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:6", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ الْحُرَّ حُرٌّ عَلَى جَمِيعِ أَحْوَالِهِ إِنْ نَابَتْهُ نَائِبَةٌ صَبَرَ لَهَا وَ إِنْ تَدَاكَّتْ عَلَيْهِ الْمَصَائِبُ لَمْ تَكْسِرْهُ وَ إِنْ أُسِرَ وَ قُهِرَ وَ اسْتُبْدِلَ بِالْيُسْرِ عُسْراً كَمَا كَانَ يُوسُفُ الصِّدِّيقُ الْأَمِينُ ( صلوات الله عليه )  لَمْ يَضْرُرْ حُرِّيَّتَهُ أَنِ اسْتُعْبِدَ وَ قُهِرَ وَ أُسِرَ وَ لَمْ تَضْرُرْهُ ظُلْمَةُ الْجُبِّ وَ وَحْشَتُهُ وَ مَا نَالَهُ أَنْ مَنَّ اللَّهُ عَلَيْهِ ", "فَجَعَلَ الْجَبَّارَ الْعَاتِيَ لَهُ عَبْداً بَعْدَ إِذْ كَانَ لَهُ مَالِكاً فَأَرْسَلَهُ وَ رَحِمَ بِهِ أُمَّةً وَ كَذَلِكَ الصَّبْرُ يُعَقِّبُ خَيْراً فَاصْبِرُوا وَ وَطِّنُوا أَنْفُسَكُمْ عَلَى الصَّبْرِ تُوجَرُوا ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Ali Bin Al Nu’man, from Abdullah Bin Muskan, from Abu Baseer who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The free one is free upon the entirety of his states. The seeds he plants, the patience springs out of it. And if the difficulties batter him, they would not break him, and if he is made a captive, and conquered, and the ease is replaced by the hardships, just as it was with Yusuf<sup>as</sup>, the truthful, the trustworthy, his<sup>as</sup> freedom did not harm him<sup>as</sup> when he<sup>as</sup> was distanced, and compelled, and imprisoned, and the darkness of the pit did not harm him<sup>as</sup>, and his<sup>as</sup> loneliness and whatever was Bestowed upon him<sup>as</sup> was a Favour of Allah<sup>azwj</sup> upon him<sup>as</sup>. ", "So He<sup>azwj</sup> Made the tyrant to come to him<sup>as</sup> as a slave of his<sup>as</sup> after him having been his<sup>as</sup> king. So he<sup>as</sup> sent him (as a free man) and was merciful with the community. And similar to that is the patience, its end result is good. Therefore be patient and resign yourselves upon the patience, you would be Recompensed’."]}}, {"index": 1689, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:7", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ حَمْزَةَ بْنِ حُمْرَانَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ الْجَنَّةُ مَحْفُوفَةٌ بِالْمَكَارِهِ وَ الصَّبْرِ فَمَنْ صَبَرَ عَلَى الْمَكَارِهِ فِي الدُّنْيَا دَخَلَ الْجَنَّةَ وَ جَهَنَّمُ مَحْفُوفَةٌ بِاللَّذَّاتِ وَ الشَّهَوَاتِ فَمَنْ أَعْطَى نَفْسَهُ لَذَّتَهَا وَ شَهْوَتَهَا دَخَلَ النَّارَ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Abdullah Bin Bukeyr, from Hamza Bin Humran Bin Humran, ", "(It has been narrated) from Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> having said: ‘The (road to) Paradise is surrounded with difficulties and the (observance of) patience. So the one who is patient upon the difficulties in the world would enter the Paradise; and the (road to) Hell is surrounded by the pleasures and the lustful desires. So the one takes his self to its pleasures and its lustful desires, would enter the Fire’."]}}, {"index": 1690, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:8", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ مَرْحُومٍ عَنْ أَبِي سَيَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا دَخَلَ الْمُؤْمِنُ فِي قَبْرِهِ كَانَتِ الصَّلَاةُ عَنْ يَمِينِهِ وَ الزَّكَاةُ عَنْ يَسَارِهِ وَ الْبِرُّ مُطِلٌّ عَلَيْهِ وَ يَتَنَحَّى الصَّبْرُ نَاحِيَةً فَإِذَا دَخَلَ عَلَيْهِ الْمَلَكَانِ اللَّذَانِ يَلِيَانِ مُسَاءَلَتَهُ قَالَ الصَّبْرُ لِلصَّلَاةِ وَ الزَّكَاةِ وَ الْبِرِّ دُونَكُمْ صَاحِبَكُمْ فَإِنْ عَجَزْتُمْ عَنْهُ فَأَنَا دُونَهُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Mahboubn, from Abdullah bin Marhoum, from Abu Sayyar, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When a ‘<span class=\"iTxt\">Momin</span>’ (Believer) enters into his grave, the <span class=\"iTxt\">Salāt</span> would be on his right, and the <span class=\"iTxt\">Zakāt</span> on his left, and the righteousness hovering over him, and the patience would end up by corner. So when the two Angels come over to him, those who would be questioning him, the patience would say to the <span class=\"iTxt\">Salāt</span>, and the <span class=\"iTxt\">Zakāt</span>, and the righteousness, ‘Be with your companion. But, if you are frustrated from (helping) him, so I would be with him’."]}}, {"index": 1691, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:9", "text": ["عَلِيٌّ عَنْ أَبِيهِ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الْأَشْعَرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَيْمُونٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ دَخَلَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه )  الْمَسْجِدَ فَإِذَا هُوَ بِرَجُلٍ عَلَى بَابِ الْمَسْجِدِ كَئِيبٍ حَزِينٍ فَقَالَ لَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) مَا لَكَ قَالَ يَا أَمِيرَ الْمُؤْمِنِينَ أُصِبْتُ بِأَبِي [وَ أُمِّي] وَ أَخِي وَ أَخْشَى أَنْ أَكُونَ قَدْ وَجِلْتُ ", "فَقَالَ لَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) عَلَيْكَ بِتَقْوَى اللَّهِ وَ الصَّبْرِ تَقْدَمْ عَلَيْهِ غَداً وَ الصَّبْرُ فِي الْأُمُورِ بِمَنْزِلَةِ الرَّأْسِ مِنَ الْجَسَدِ فَإِذَا فَارَقَ الرَّأْسُ الْجَسَدَ فَسَدَ الْجَسَدُ وَ إِذَا فَارَقَ الصَّبْرُ الْأُمُورَ فَسَدَتِ الْأُمُورُ ."], "translations": {"en.hubeali": ["Ali, from his father, from Ja’far Bin Muhammad Al Ashary, from Abdullah Bin Maymoun, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> entered the Masjid, and there was a man at the door of the Masjid, gloomy, grief-stricken. So Amir Al-Momineen<sup>asws</sup> said to him: ‘What is the matter with you?’ He said, ‘O Amir Al-Momineen<sup>asws</sup>! I am bereaved with my father (or my mother), and my brother, and I fear that I have become scared’. ", "So Amir Al-Momineen<sup>asws</sup> said to him: ‘Upon you is to be with the fear of Allah<sup>azwj</sup> and the patience. Tomorrow you will be going forward to Him<sup>azwj</sup>, and the patience in the affairs is at the status of the head to the body. So when the head separates from the body, so the body is spoilt (perishes), and when the patience separated from the affairs, the affairs are spoilt (perish)’."]}}, {"index": 1692, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:10", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَمَاعَةَ بْنِ مِهْرَانَ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ قَالَ لِي مَا حَبَسَكَ عَنِ الْحَجِّ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ وَقَعَ عَلَيَّ دَيْنٌ كَثِيرٌ وَ ذَهَبَ مَالِي وَ دَيْنِيَ الَّذِي قَدْ لَزِمَنِي هُوَ أَعْظَمُ مِنْ ذَهَابِ مَالِي فَلَوْ لَا أَنَّ رَجُلًا مِنْ أَصْحَابِنَا أَخْرَجَنِي مَا قَدَرْتُ أَنْ أَخْرُجَ فَقَالَ لِي إِنْ تَصْبِرْ تُغْتَبَطْ وَ إِلَّا تَصْبِرْ يُنْفِذِ اللَّهُ مَقَادِيرَهُ رَاضِياً كُنْتَ أَمْ كَارِهاً ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al hakam, from Sama’at Bin Mihran, ", "(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said: ‘He<sup>asws</sup> said to me: ‘What withheld you from the Hajj?’ I said, ‘May I be sacrificed for you<sup>asws</sup>! A lot of debts occurred upon me, and my wealth is gone, and the debts which are necessitated upon me are greater than the wealth that has gone from me. So if a man from our companions were not to take me out (to go to Hajj), I am unable from going out’. So he<sup>asws</sup> said to me: ‘If you are patient, they would backbite you, or else be patient and Allah<sup>azwj</sup> will Implement His<sup>azwj</sup> Ordainment, whether you were happy with it or reluctant’."]}}, {"index": 1693, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:11", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ سِنَانٍ عَنْ أَبِي الْجَارُودِ عَنِ الْأَصْبَغِ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ صَلَوَاتُ اللَّهِ عَلَيْهِ الصَّبْرُ صَبْرَانِ صَبْرٌ عِنْدَ الْمُصِيبَةِ حَسَنٌ جَمِيلٌ وَ أَحْسَنُ مِنْ ذَلِكَ الصَّبْرُ عِنْدَ مَا حَرَّمَ اللَّهُ عَزَّ وَ جَلَّ عَلَيْكَ وَ الذِّكْرُ ذِكْرَانِ ذِكْرُ اللَّهِ عَزَّ وَ جَلَّ عِنْدَ الْمُصِيبَةِ وَ أَفْضَلُ مِنْ ذَلِكَ ذِكْرُ اللَّهِ عِنْدَ مَا حَرَّمَ عَلَيْكَ فَيَكُونُ حَاجِزاً ."], "translations": {"en.hubeali": ["Muhamad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Sinan, from Abu Al Jaroud, from Al Asbagh who said, ", "‘Amir Al-Momineen<sup>asws</sup> said: ‘The patience is of two (types of) patience – patience during the difficulties is good, beautiful; but (even) better than that is the patience during (abstaining from) what Allah<sup>azwj</sup> Mighty and Majestic has Prohibited upon you. And the Remembrance is of two (types) of Remembrances – The mentioning of Allah<sup>azwj</sup> Mighty and Majestic during the difficulties; but (even) superior than that is the mentioning of Allah<sup>azwj</sup> during what Allah<sup>azwj</sup> has Prohibited upon you. Thus it (the patience) serves as a barrier’."]}}, {"index": 1694, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:12", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنِ الْعَبَّاسِ بْنِ عَامِرٍ عَنِ الْعَرْزَمِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) سَيَأْتِي عَلَى النَّاسِ زَمَانٌ لَا يُنَالُ الْمُلْكُ فِيهِ إِلَّا بِالْقَتْلِ وَ التَّجَبُّرِ وَ لَا الْغِنَى إِلَّا بِالْغَصْبِ وَ الْبُخْلِ وَ لَا الْمَحَبَّةُ إِلَّا بِاسْتِخْرَاجِ الدِّينِ وَ اتِّبَاعِ الْهَوَى ", "فَمَنْ أَدْرَكَ ذَلِكَ الزَّمَانَ فَصَبَرَ عَلَى الْفَقْرِ وَ هُوَ يَقْدِرُ عَلَى الْغِنَى وَ صَبَرَ عَلَى الْبِغْضَةِ وَ هُوَ يَقْدِرُ عَلَى الْمَحَبَّةِ وَ صَبَرَ عَلَى الذُّلِّ وَ هُوَ يَقْدِرُ عَلَى الْعِزِّ آتَاهُ اللَّهُ ثَوَابَ خَمْسِينَ صِدِّيقاً مِمَّنْ صَدَّقَ بِي ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Al Hassan Bin Ali Al Kufy, from Al Abbas Bin Aamir, from Al Arzamy, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘There would be coming such a time period upon the people that they would not be attaining a kingdom except by the killing and the tyranny, nor (attaining) riches except by the usurpation and the stinginess, nor the love except by the removal of the Religion and following of the personal desires. ", "So the one who comes across that time period, and he observes patience upon the poverty despite being able upon the riches, and observes patience upon the hatred despite being able upon the love, and observes patience upon the humiliation despite being able upon the honour, Allah<sup style=\"font-weight: normal\">azwj</sup> would Give him the Rewards of fifty truthful ones from the ones who ratified me<sup style=\"font-weight: normal\">saww</sup>’."]}}, {"index": 1695, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:13", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ دُرُسْتَ بْنِ أَبِي مَنْصُورٍ عَنْ عِيسَى بْنِ بَشِيرٍ عَنْ أَبِي حَمْزَةَ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) لَمَّا حَضَرَتْ أَبِي عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) الْوَفَاةُ ضَمَّنِي إِلَى صَدْرِهِ وَ قَالَ يَا بُنَيَّ أُوصِيكَ بِمَا أَوْصَانِي بِهِ أَبِي حِينَ حَضَرَتْهُ الْوَفَاةُ وَ بِمَا ذَكَرَ أَنَّ أَبَاهُ أَوْصَاهُ بِهِ يَا بُنَيَّ اصْبِرْ عَلَى الْحَقِّ وَ إِنْ كَانَ مُرّاً ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Abu Abdullah, from Ismail Bin Mihran, from Dorost Bin Abu Mansour, from Isa Bin Bashir, from Abu Hamza who said, ", "‘Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> said, when the termination presented itself to my<sup style=\"font-weight: normal\">asws</sup> father<sup style=\"font-weight: normal\">asws</sup> Ali<sup style=\"font-weight: normal\">asws</sup> Bin Al-Husayn<sup style=\"font-weight: normal\">asws</sup>, he<sup style=\"font-weight: normal\">asws</sup> pressed me<sup style=\"font-weight: normal\">asws</sup> to his<sup style=\"font-weight: normal\">asws</sup> chest and said: ‘O my<sup style=\"font-weight: normal\">asws</sup> son<sup style=\"font-weight: normal\">asws</sup>! I<sup style=\"font-weight: normal\">asws</sup> bequeath you<sup style=\"font-weight: normal\">asws</sup> with what my<sup style=\"font-weight: normal\">asws</sup> father<sup style=\"font-weight: normal\">asws</sup> bequeathed to me<sup style=\"font-weight: normal\">asws</sup> when the termination presented itself to him<sup style=\"font-weight: normal\">asws</sup>, and with what he<sup style=\"font-weight: normal\">asws</sup> mentioned that his<sup style=\"font-weight: normal\">asws</sup> father<sup style=\"font-weight: normal\">asws</sup> bequeathed with: ‘O my<sup style=\"font-weight: normal\">asws</sup> son<sup style=\"font-weight: normal\">asws</sup>! Be patience upon the truth, and even though it may be bitter’."]}}, {"index": 1696, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:14", "text": ["عَنْهُ عَنْ أَبِيهِ عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ رَفَعَهُ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ الصَّبْرُ صَبْرَانِ صَبْرٌ عَلَى الْبَلَاءِ حَسَنٌ جَمِيلٌ وَ أَفْضَلُ الصَّبْرَيْنِ الْوَرَعُ عَنِ الْمَحَارِمِ ."], "translations": {"en.hubeali": ["From him, from his father, from Yunus Bin Abdul Rahman, raising it, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The patience is two (types of) patience – Patience upon the affliction is good, beautiful; and (even) superior of the two (types of) patience is the abstinence from the Prohibitions’."]}}, {"index": 1697, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:15", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى قَالَ أَخْبَرَنِي يَحْيَى بْنُ سُلَيْمٍ الطَّائِفِيُّ قَالَ أَخْبَرَنِي عَمْرُو بْنُ شِمْرٍ الْيَمَانِيُّ يَرْفَعُ الْحَدِيثَ إِلَى عَلِيٍّ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الصَّبْرُ ثَلَاثَةٌ صَبْرٌ عِنْدَ الْمُصِيبَةِ وَ صَبْرٌ عَلَى الطَّاعَةِ وَ صَبْرٌ عَنِ الْمَعْصِيَةِ فَمَنْ صَبَرَ عَلَى الْمُصِيبَةِ حَتَّى يَرُدَّهَا بِحُسْنِ عَزَائِهَا كَتَبَ اللَّهُ لَهُ ثَلَاثَمِائَةِ دَرَجَةٍ مَا بَيْنَ الدَّرَجَةِ إِلَى الدَّرَجَةِ كَمَا بَيْنَ السَّمَاءِ إِلَى الْأَرْضِ ", "وَ مَنْ صَبَرَ عَلَى الطَّاعَةِ كَتَبَ اللَّهُ لَهُ سِتَّمِائَةِ دَرَجَةٍ مَا بَيْنَ الدَّرَجَةِ إِلَى الدَّرَجَةِ كَمَا بَيْنَ تُخُومِ الْأَرْضِ إِلَى الْعَرْشِ وَ مَنْ صَبَرَ عَنِ الْمَعْصِيَةِ كَتَبَ اللَّهُ لَهُ تِسْعَمِائَةِ دَرَجَةٍ مَا بَيْنَ الدَّرَجَةِ إِلَى الدَّرَجَةِ كَمَا بَيْنَ تُخُومِ الْأَرْضِ إِلَى مُنْتَهَى الْعَرْشِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Yahya Bin Muslim Bin Suleym Al Taify, from Amro Bin Shimr Al Yamani, ", "(It has been narrated) raising the Hadeeth to Ali<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The patience is of three (types of) patience – Patience during the difficulties, and patience upon the obedience, and patience upon the disobedience. So the one who is patient upon the difficulties until he repels it by goodness of his resolution, Allah<sup>azwj</sup> would Write for him three hundred levels, there being between the level to the level just as what is between the sky and the earth. ", "And the one who is patient upon the obedience, Allah<sup>azwj</sup> would Write for him six hundred levels, there being between the level to the level just as what is between the earth to the Throne. And the one who is patient upon the disobedience, Allah<sup>azwj</sup> would Write for him nine hundred levels, there being between the level to the level just as what is between the edge of the earth to the ultimate point of the Throne’."]}}, {"index": 1698, "local_index": 16, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:16", "text": ["عَنْهُ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ يُونُسَ بْنِ يَعْقُوبَ قَالَ أَمَرَنِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَنْ آتِيَ الْمُفَضَّلَ وَ أُعَزِّيَهُ بِإِسْمَاعِيلَ وَ قَالَ أَقْرِئِ الْمُفَضَّلَ السَّلَامَ وَ قُلْ لَهُ إِنَّا قَدْ أُصِبْنَا بِإِسْمَاعِيلَ فَصَبَرْنَا فَاصْبِرْ كَمَا صَبَرْنَا إِنَّا أَرَدْنَا أَمْراً وَ أَرَادَ اللَّهُ عَزَّ وَ جَلَّ أَمْراً فَسَلَّمْنَا لِأَمْرِ اللَّهِ عَزَّ وَ جَلَّ ."], "translations": {"en.hubeali": ["From him, from Ali Bin Al Hakam, from Yunus Bin Yaqoub who said, ", "‘Abu Abdullah<sup>asws</sup> ordered me that I should go to Al Mufazzal and console him with (the bereavement of) Ismail (a son of the Imam<sup>asws</sup>), and he<sup>asws</sup> said: ‘Convey the greetings to Al-Mufazzal and say to him, ‘We<sup>asws</sup> have been bereaved with Ismail, and we<sup>asws</sup> were patient. Therefore, observe patience just as we<sup>asws</sup> were patient. We tend to want a matter, and Allah<sup>azwj</sup> Mighty and Majestic Wants a matter. So we should submit to the Command of Allah<sup>azwj</sup> Mighty and Majestic’."]}}, {"index": 1699, "local_index": 17, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:17", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَنِ ابْتُلِيَ مِنَ الْمُؤْمِنِينَ بِبَلَاءٍ فَصَبَرَ عَلَيْهِ كَانَ لَهُ مِثْلُ أَجْرِ أَلْفِ شَهِيدٍ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Sayf Bin Amyera, from Abu Hamza Al Sumaly who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘The one from the Believers who is afflicted with an affliction, so he is patient upon it, there would be for him the like of the Recompense of a thousand martyrs’."]}}, {"index": 1700, "local_index": 18, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:18", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَمَّارِ بْنِ مَرْوَانَ عَنْ سَمَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَنْعَمَ عَلَى قَوْمٍ فَلَمْ يَشْكُرُوا فَصَارَتْ عَلَيْهِمْ وَبَالًا وَ ابْتَلَى قَوْماً بِالْمَصَائِبِ فَصَبَرُوا فَصَارَتْ عَلَيْهِمْ نِعْمَةً ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Sinan, from Ammar Bin Marwan, from Sama’at, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Favoured upon a people but they were not grateful, so a plague came upon them; and a people were afflicted with the difficulties, so they were patient, and Bounties came upon them’."]}}, {"index": 1701, "local_index": 19, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:19", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ أَبَانِ بْنِ أَبِي مُسَافِرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ يا أَيُّهَا الَّذِينَ آمَنُوا اصْبِرُوا وَ صابِرُوا قَالَ اصْبِرُوا عَلَى الْمَصَائِبِ", "وَ فِي رِوَايَةِ ابْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ صَابِرُوا عَلَى الْمَصَائِبِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Ibn Abu Umeyr, from Ibrahim Bin Abdul Hameed, from Aban Bin Abu Musafir, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[3:200] O you who believe! Be patient and excel in patience</span>. He<sup>asws</sup> said: ‘Be patient upon the difficulties’. ", "And in a report of Ibn Abu Yafour, from Abu Abdullah<sup>asws</sup> having said: ‘Excel in patience upon the difficulties’."]}}, {"index": 1702, "local_index": 20, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:20", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ مُحَمَّدِ بْنِ أَبِي جَمِيلَةَ عَنْ جَدِّهِ أَبِي جَمِيلَةَ عَنْ بَعْضِ أَصْحَابِهِ قَالَ لَوْ لَا أَنَّ الصَّبْرَ خُلِقَ قَبْلَ الْبَلَاءِ لَتَفَطَّرَ الْمُؤْمِنُ كَمَا تَتَفَطَّرُ الْبَيْضَةُ عَلَى الصَّفَا ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Isa, from Ali Bin Muhammad Bin Abu Jameela, from a grandfather of Abu Jameela, from one of his companions, ", "‘He<sup>asws</sup> said: ‘Had the patience not been Created before the affliction, a ‘<span class=\"iTxt\">Momin</span>’ (Believer), it would have torn the <span class=\"iTxt\">Momin</span> into pieces just as the egg cracks upon the rock’."]}}, {"index": 1703, "local_index": 21, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:21", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ وَ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَالَ اللَّهُ عَزَّ وَ جَلَّ إِنِّي جَعَلْتُ الدُّنْيَا بَيْنَ عِبَادِي قَرْضاً فَمَنْ أَقْرَضَنِي مِنْهَا قَرْضاً أَعْطَيْتُهُ بِكُلِّ وَاحِدَةٍ عَشْراً إِلَى سَبْعِمِائَةِ ضِعْفٍ وَ مَا شِئْتُ مِنْ ذَلِكَ وَ مَنْ لَمْ يُقْرِضْنِي مِنْهَا قَرْضاً فَأَخَذْتُ مِنْهُ شَيْئاً قَسْراً فَصَبَرَ أَعْطَيْتُهُ ثَلَاثَ خِصَالٍ لَوْ أَعْطَيْتُ وَاحِدَةً مِنْهُنَّ مَلَائِكَتِي لَرَضُوا بِهَا مِنِّي ", "قَالَ ثُمَّ تَلَا أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَوْلَ اللَّهِ عَزَّ وَ جَلَّ الَّذِينَ إِذا أَصابَتْهُمْ مُصِيبَةٌ قالُوا إِنَّا لِلَّهِ وَ إِنَّا إِلَيْهِ راجِعُونَ أُولئِكَ عَلَيْهِمْ صَلَواتٌ مِنْ رَبِّهِمْ فَهَذِهِ وَاحِدَةٌ مِنْ ثَلَاثِ خِصَالٍ وَ رَحْمَةٌ اثْنَتَانِ وَ أُولئِكَ هُمُ الْمُهْتَدُونَ ثَلَاثٌ ", "ثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) هَذَا لِمَنْ أَخَذَ اللَّهُ مِنْهُ شَيْئاً قَسْراً ."], "translations": {"en.hubeali": ["Abu Ali Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Is’haq Bin Ammar, and Abdullah Bin Sinan, ", "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> having said: ‘Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> said: ‘Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic Said I<sup style=\"font-weight: normal\">azwj</sup> Made the world to be between My<sup style=\"font-weight: normal\">azwj</sup> servants as a loan. So the one who lends Me<sup style=\"font-weight: normal\">azwj</sup> a loan from it, I<sup style=\"font-weight: normal\">azwj</sup> shall Give him, with every one, ten, up to a multiple of seven hundred, and whatever I<sup style=\"font-weight: normal\">azwj</sup> so Desire from that; and the one who does not lends Me<sup style=\"font-weight: normal\">azwj</sup> a loan from it, so I<sup style=\"font-weight: normal\">azwj</sup> shall Seize something Forcibly from him. But, if he is patient, I<sup style=\"font-weight: normal\">azwj</sup> shall Give him three characteristics, such that if I<sup style=\"font-weight: normal\">azwj</sup> were to Give one of these to My<sup style=\"font-weight: normal\">azwj</sup> Angels, they would be pleased with Me<sup style=\"font-weight: normal\">azwj</sup>’. ", "He (the narrator) said, ‘Then Abu Abdullah<sup>asws</sup> recited the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[2:156] Who, when a difficulty befalls them, say: Surely we are for Allah and to Him we are returning [2:157] Those are they on whom are Blessings and Mercy from their Lord</span>. So this (Blessings) is one from the three characteristics, and Mercy is the second, <span class=\"ibTxt\">and those are the followers of the right course</span> is the third’. ", "Then Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> said: ‘This is for them from whom Allah<sup style=\"font-weight: normal\">azwj</sup> Takes something Forcibly’."]}}, {"index": 1704, "local_index": 22, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:22", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ عَنْ يَحْيَى بْنِ آدَمَ عَنْ شَرِيكٍ عَنْ جَابِرِ بْنِ يَزِيدَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ مُرُوَّةُ الصَّبْرِ فِي حَالِ الْحَاجَةِ وَ الْفَاقَةِ وَ التَّعَفُّفِ وَ الْغِنَى أَكْثَرُ مِنْ مُرُوَّةِ الْإِعْطَاءِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, and Ali Bin Muhammad Al Qasany, from Al Qasim Bin Muhammad, from Suleyman Bin Dawood, from Yahya Bin Adam, from Shareek, from Jabir Bin Yazeed, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Magnanimity of exercising the patience during a state of need, and the destitution, and the abstinence, and the riches, is more than the magnanimity (regarding) the giving (charity etc.)’."]}}, {"index": 1705, "local_index": 23, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:23", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ أَحْمَدَ بْنِ النَّضْرِ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) يَرْحَمُكَ اللَّهُ مَا الصَّبْرُ الْجَمِيلُ قَالَ ذَلِكَ صَبْرٌ لَيْسَ فِيهِ شَكْوَى إِلَى النَّاسِ ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Ahmad Bin Al Nazar, from Amro Bin Shimr, from Jabir who said, ", "‘I said to Abu Ja’far<sup>asws</sup>, ‘May Allah<sup>azwj</sup> have Mercy on you<sup>asws</sup>! What is the beautiful patience?’ He<sup>asws</sup> said: ‘That is a patience wherein is no complaining to the people’."]}}, {"index": 1706, "local_index": 24, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:24", "text": ["حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبَانٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَيَابَةَ عَنْ أَبِي النُّعْمَانِ عَنْ أَبِي عَبْدِ اللَّهِ أَوْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ مَنْ لَا يُعِدَّ الصَّبْرَ لِنَوَائِبِ الدَّهْرِ يَعْجِزْ ."], "translations": {"en.hubeali": ["Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from one of his companions, from Aban, from Abdul Rahman Bin Sayaba, from Abu Al Numan, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> or Abu Ja’far<sup>asws</sup> having said: ‘The one is not prepared to be patient for the ravages of the time would be frustrated’."]}}, {"index": 1707, "local_index": 25, "part_type": "Hadith", "path": "/books/al-kafi:2:1:47:25", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّا صُبُرٌ وَ شِيعَتُنَا أَصْبَرُ مِنَّا قُلْتُ جُعِلْتُ فِدَاكَ كَيْفَ صَارَ شِيعَتُكُمْ أَصْبَرَ مِنْكُمْ قَالَ لِأَنَّا نَصْبِرُ عَلَى مَا نَعْلَمُ وَ شِيعَتُنَا يَصْبِرُونَ عَلَى مَا لَا يَعْلَمُونَ ."], "translations": {"en.hubeali": ["Abu Ali Ashary, from Moalla Bin Muhammad, from Al Washa, from one of his companions, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘We<sup>asws</sup> are patient, and our<sup>asws</sup> Shia are more patient than us<sup>asws</sup>’. I said, ‘May I be sacrificed for you<sup>asws</sup>! How did your<sup>asws</sup> Shia come to be more patient than you<sup>asws</sup>?’ He<sup>asws</sup> said: ‘Because we<sup>asws</sup> are patient upon what we<sup>asws</sup> know, and our<sup>asws</sup> Shiah are being patient upon what they are not (even) knowing’."]}}]}, "index": "al-kafi:2:1:47", "kind": "verse_list"}