{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 6"
        },
        "path": "/books/al-kafi:2:1:6",
        "titles": {
          "ar": "بَابُ فِطْرَةِ الْخَلْقِ عَلَى التَّوْحِيدِ",
          "en": "Chapter 6 – Nature of the creatures is uon the Oneness (Tawheed)"
        }
      }
    ],
    "index": 194,
    "local_index": 6,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 7"
        },
        "path": "/books/al-kafi:2:1:7",
        "titles": {
          "ar": "بَابُ كَوْنِ الْمُؤْمِنِ فِي صُلْبِ الْكَافِرِ",
          "en": "Chapter 7 – Coming into being of the Believer into the back of the disbeliever"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 5"
        },
        "path": "/books/al-kafi:2:1:5",
        "titles": {
          "ar": "بَابُ كَيْفَ أَجَابُوا وَ هُمْ ذَرٌّ",
          "en": "Chapter 5 – How did they answer and they were particles"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:6",
    "titles": {
      "ar": "بَابُ فِطْرَةِ الْخَلْقِ عَلَى التَّوْحِيدِ",
      "en": "Chapter 6 – Nature of the creatures is uon the Oneness (Tawheed)"
    },
    "verse_count": 5,
    "verse_start_index": 1458,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/54)"
        ],
        "index": 1459,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:6:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ فِطْرَتَ اللَّهِ الَّتِي فَطَرَ النَّاسَ عَلَيْها قَالَ التَّوْحِيدُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup>, said, ‘I said, ‘(What about) <span class=\"ibTxt\">[30:30] Then set your face for the upright Religion - the nature made by Allah in which He has Made the people to be upon</span>?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘The Oneness (<span class=\"iTxt\">Tawheed</span>)’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hisham ibn Salim from abu ‘Abd Allah (a.s.) who has said the following: “I asked ( the Imam) about the words of Allah, ‘. . . the invention of Allah (had a certain) nature with which He created all people. . . .’ (30:30) The Imam (a.s.) said, ‘It (invention, Fitrat) refers to belief in Oneness of Allah (belief in Allah only is placed in their nature).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/56)"
        ],
        "index": 1460,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:6:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فِطْرَتَ اللَّهِ الَّتِي فَطَرَ النَّاسَ عَلَيْها مَا تِلْكَ الْفِطْرَةُ قَالَ هِيَ الْإِسْلَامُ فَطَرَهُمُ اللَّهُ حِينَ أَخَذَ مِيثَاقَهُمْ عَلَى التَّوْحِيدِ قَالَ أَ لَسْتُ بِرَبِّكُمْ وَ فِيهِ الْمُؤْمِنُ وَ الْكَافِرُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[30:30] the nature made by Allah in which He has Made the people to be upon</span>, ‘What is that nature?’ He<sup>asws</sup> said: ‘It is Al-<span class=\"iTxt\">Islām</span>. Allah<sup>azwj</sup> Inclined them when He<sup>azwj</sup> Took their Covenant upon the Oneness Saying <span class=\"ibTxt\">[7:172] Am I not your Lord?</span> And included in it were the <span class=\"iTxt\">Momineen (plural of Momin)</span> and the disbelievers’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from Muhammad ibn ‘Isa from Yunus from ‘Abd Allah ibn Sinan from abu ‘Abd Allah (a.s.) who has said the following: “I asked him about the words of Allah, the Majestic, the Glorious, ‘The invention of Allah (had a certain) nature with which He created all people. . . .’ (30:30) What is that creation (and nature)? The Imam said, ‘It is al-Islam. Allah created them with such nature at the time He made a covenant with them to believe in Oneness of Allah as He asked them all, “Am I not your Lord?” when all the believers and the unbelievers were there.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/57)"
        ],
        "index": 1461,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:6:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ زُرَارَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فِطْرَتَ اللَّهِ الَّتِي فَطَرَ النَّاسَ عَلَيْها قَالَ فَطَرَهُمْ جَمِيعاً عَلَى التَّوْحِيدِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahad Bin Muhammad, from Ibn Mahboub, from Ali Bin Raib, from Zurara who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[30:30] the nature made by Allah in which He has Made the people to be upon</span>. He<sup>asws</sup> Said: ‘Inclined the entirety of them upon the Oneness (<span class=\"iTxt\">Tawheed</span>)’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from Ali ibn Ri’ab from Zurara who has said the following: “Once I asked abu ‘Abd Allah (a.s.) about the words of Allah, the Majestic, the Glorious, ‘. . . the creation (and invention) of Allah (had a certain) nature with which He created all people. . . .’ (30:30) The Imam said, ‘He created them and placed belief in Oneness of Allah in the nature of every one of them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/57)"
        ],
        "index": 1462,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:6:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ حُنَفاءَ لِلَّهِ غَيْرَ مُشْرِكِينَ بِهِ قَالَ الْحَنِيفِيَّةُ مِنَ الْفِطْرَةِ الَّتِي فَطَرَ اللَّهُ النَّاسَ عَلَيْهَا لَا تَبْدِيلَ لِخَلْقِ اللَّهِ قَالَ فَطَرَهُمْ عَلَى الْمَعْرِفَةِ بِهِ",
          "قَالَ زُرَارَةُ وَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ إِذْ أَخَذَ رَبُّكَ مِنْ بَنِي آدَمَ مِنْ ظُهُورِهِمْ ذُرِّيَّتَهُمْ وَ أَشْهَدَهُمْ عَلى أَنْفُسِهِمْ أَ لَسْتُ بِرَبِّكُمْ قالُوا بَلى الْآيَةَ قَالَ أَخْرَجَ مِنْ ظَهْرِ آدَمَ ذُرِّيَّتَهُ إِلَى يَوْمِ الْقِيَامَةِ فَخَرَجُوا كَالذَّرِّ فَعَرَّفَهُمْ وَ أَرَاهُمْ نَفْسَهُ وَ لَوْ لَا ذَلِكَ لَمْ يَعْرِفْ أَحَدٌ رَبَّهُ ",
          "وَ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كُلُّ مَوْلُودٍ يُولَدُ عَلَى الْفِطْرَةِ يَعْنِي الْمَعْرِفَةَ بِأَنَّ اللَّهَ عَزَّ وَ جَلَّ خَالِقُهُ كَذَلِكَ قَوْلُهُ وَ لَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَ السَّماواتِ وَ الْأَرْضَ لَيَقُولُنَّ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibn Azina, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[22:31] Being upright for Allah, not associating anything with Him</span>. He<sup>asws</sup> said: ‘The uprightness <span class=\"ibTxt\">[30:30] the nature made by Allah in which He has Made the people; there is no altering of Allah's creation</span>. Allah<sup>azwj</sup> Inclined them upon the recognition of it’. ",
            "Zurara said, ‘And I asked him<sup>asws</sup> abou the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[7:172] And when your Lord brought forth from the Children of Adam, from their backs, their descendants, and made them testify against their own souls: Am I not your Lord? They said: Yes! </span>– the Verse. He<sup>asws</sup> said: ‘Extracted from the back of Adam<sup>as</sup> was his offspring to be up to the Day of Judgement. So they came out like the particles, and He<sup>azwj</sup> Introduced Himself<sup>azwj</sup> to them, and had it not been for that, not one of them would have recognised his Lord<sup>azwj</sup>’. ",
            "And he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘Every newborn is born upon the nature, meaning the recognition that Allah<sup>azwj</sup> Mighty and Majestic Created him. Likewise are His<sup>azwj</sup> Words <span class=\"ibTxt\">[31:25] And if you ask them who Created the skies and the earth, they will be saying: Allah</span>’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Udhayna from Zurara from abu Ja’far (a.s.) who has said the following: “I asked him (a.s.) about the words of Allah, the Majestic, the Glorious, ‘They are humble before Allah and they do not consider anything as partners of Allah.’ The Imam said, ‘Humbleness comes from the nature with which Allah has created all people and there is no change in the creation of Allah.’ The Imam also said, ‘He created them with the ability to know Him.’ Zurara has said, ‘I then asked him about the words of Allah, the Majestic, the Glorious: “(Consider), when your Lord took from the backs of the children of Adam all of their offspring. He asked them to bear a testimony. (Testimony to the fact that) when He asked them all, ‘Am 1 not your Lord?’ They all said, ‘Yes, You are our Lord.’” (7:172) The Imam said, “This happened when Allah took all descendents of Adam - who were to be born to the Day of Judgment - out from his back. They all came out in the form of small particles. He then introduced and showed Himself to them. Had this not happened no one could know his Lord.” The Imam said, “The Messenger of Allah has said, ‘Every newborn is born with the nature (to believe in Allah). ’ It means (He created them) with knowledge that Allah, the Majestic, the Glorious, is his/her Creator and so is His words, ‘When you ask them, “Who has created the heavens and the earth?” They will certainly say, ‘Allah has created them.””” (31:25) Ali ibn Ibrahim has narrated from his father from ibn Faddal from abu Jamila from Muhammad al-Halabi from abu ‘Abd Allah (a.s.) who has said the following: “About the words of Allah, the Majestic, the Glorious, ‘. . . the creation of Allah (had a certain) nature with which He created all people. . . .’ (30:30), the Imam said, ‘He has created them with belief in Oneness of Allah in their nature.’” "
          ]
        }
      },
      {
        "index": 1463,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:6:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ أَبِي جَمِيلَةَ عَنْ مُحَمَّدٍ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فِطْرَتَ اللَّهِ الَّتِي فَطَرَ النَّاسَ عَلَيْها قَالَ فَطَرَهُمْ عَلَى التَّوْحِيدِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Fazzal, from Ibn Abu Jameela, from Muhammad Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[30:30] the nature made by Allah in which He has Made the people</span>. He<sup>asws</sup> said: ‘Inclined them upon the Oneness (<span class=\"iTxt\">Tawheed</span>)’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:6",
  "kind": "verse_list"
}