{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 61"
        },
        "path": "/books/al-kafi:2:1:61",
        "titles": {
          "ar": "بَابُ ذَمِّ الدُّنْيَا وَ الزُّهْدِ فِيهَا",
          "en": "Chapter 61 – Condemning the world and (adopting) the ascetism in it"
        }
      }
    ],
    "index": 249,
    "local_index": 61,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 62"
        },
        "path": "/books/al-kafi:2:1:62",
        "titles": {
          "ar": "بَابٌ",
          "en": "Chapter 62 – A Chapter"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 60"
        },
        "path": "/books/al-kafi:2:1:60",
        "titles": {
          "ar": "بَابُ الْحُبِّ فِي اللَّهِ وَ الْبُغْضِ فِي اللَّهِ",
          "en": "Chapter 60 – The love regarding Allah<sup>azwj</sup> and the hatred regarding Allah<sup>azwj</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:61",
    "titles": {
      "ar": "بَابُ ذَمِّ الدُّنْيَا وَ الزُّهْدِ فِيهَا",
      "en": "Chapter 61 – Condemning the world and (adopting) the ascetism in it"
    },
    "verse_count": 25,
    "verse_start_index": 1885,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/267)"
        ],
        "index": 1886,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنِ الْهَيْثَمِ بْنِ وَاقِدٍ الْحَرِيرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ زَهِدَ فِي الدُّنْيَا أَثْبَتَ اللَّهُ الْحِكْمَةَ فِي قَلْبِهِ وَ أَنْطَقَ بِهَا لِسَانَهُ وَ بَصَّرَهُ عُيُوبَ الدُّنْيَا دَاءَهَا وَ دَوَاءَهَا وَ أَخْرَجَهُ مِنَ الدُّنْيَا سَالِماً إِلَى دَارِ السَّلَامِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Mahboub, from Al Haysam Bin Waqid Al Hareyri, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who is ascetic in the world, Allah<sup>azwj</sup> would Affirm the wisdom in his heart, and he would speak with it by his tongue, and he would have an insight into the faults of the world – its ailments, and its cures; and he would exit from the world safely into the House of Peace’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Mahbub from al-Hatham ibn Waqid al-Hariri from abu ‘Abd Allah (a.s.) who has said the following: “One who abstains from worldly matters Allah establishes wisdom in his heart, makes his tongue speak it, and opens his eyes to see the defects of the world, its sicknesses and the cures for them. He takes him out of the world safely to the house of peace.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (268/ 8)"
        ],
        "index": 1887,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ جَمِيعاً عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْمِنْقَرِيِّ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ جُعِلَ الْخَيْرُ كُلُّهُ فِي بَيْتٍ وَ جُعِلَ مِفْتَاحُهُ الزُّهْدَ فِي الدُّنْيَا ",
          "ثُمَّ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَا يَجِدُ الرَّجُلُ حَلَاوَةَ الْإِيمَانِ فِي قَلْبِهِ حَتَّى لَا يُبَالِيَ مِنْ أَكْلِ الدُّنْيَا ثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) حَرَامٌ عَلَى قُلُوبِكُمْ أَنْ تَعْرِفَ حَلَاوَةَ الْإِيمَانِ حَتَّى تَزْهَدَ فِي الدُّنْيَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and Ali Bin Muhammad Al Qasany, altogether from Al Qasim Bin Muhammad, from Suleyman Bin Dawood Al Minqary, from Hafs Bin Giyas, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘The goodness, all of it, is made to be in a house, and its key has been made to be the ascetism in the world’. ",
            "Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> said: ‘The man will not find the sweetness of the <span class=\"iTxt\">Emān</span> in his heart until he does not care of consuming the world’. Then Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> said: ‘It is Prohibited upon your hearts that you recognise the sweetness of the <span class=\"iTxt\">Emān </span>until you are an ascetic (abstinent) in the world’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father and Ali ibn Muhammad al-Qasani all from al-Qasim ibn Muhammad from Sulayman ibn Dawud al-Minqari from Hafs ibn Ghiyath from abu ‘Abd Allah (a.s.) who has said the following: “I heard abu ‘Abd Allah (a.s.) say, ‘All the good is placed in a house and the key to that house is abstinence from worldly matters.’ The Imam then said, ‘The Messenger of Allah has said, “A man will not sense the sweetness of belief in his heart until he is free of all concerns about worldly matters.”’ The Imam then said, ‘Before abstaining from the worldly things, to sense the sweetness of belief in you is like a prohibited thing.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (269/ 8)"
        ],
        "index": 1888,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِنَّ مِنْ أَعْوَنِ الْأَخْلَاقِ عَلَى الدِّينِ الزُّهْدَ فِي الدُّنْيَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Abu Ayoub Al Khazzaz, from Abu Hamza, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘From the most supportive of manners upon the world is the ascetism in the world’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from abu Ayyub al-Khazzaz from abu Hamza from abu Ja’far (a.s.) who has said the following: “Amir al-Mu’minin (Ali ibn abu Talib) (a.s.) has said, ‘The most supportive, of religious moral behavior, is abstinence from worldly matters.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/269)"
        ],
        "index": 1889,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عَلِيِّ بْنِ مُحَمَّدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْمِنْقَرِيِّ عَنْ عَلِيِّ بْنِ هَاشِمِ بْنِ الْبَرِيدِ عَنْ أَبِيهِ أَنَّ رَجُلًا سَأَلَ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) عَنِ الزُّهْدِ فَقَالَ عَشَرَةُ أَشْيَاءَ فَأَعْلَى دَرَجَةِ الزُّهْدِ أَدْنَى دَرَجَةِ الْوَرَعِ وَ أَعْلَى دَرَجَةِ الْوَرَعِ أَدْنَى دَرَجَةِ الْيَقِينِ وَ أَعْلَى دَرَجَةِ الْيَقِينِ أَدْنَى دَرَجَةِ الرِّضَا أَلَا وَ إِنَّ الزُّهْدَ فِي آيَةٍ مِنْ كِتَابِ اللَّهِ عَزَّ وَ جَلَّ لِكَيْلا تَأْسَوْا عَلى ما فاتَكُمْ وَ لا تَفْرَحُوا بِما آتاكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Ali Bin Muhammad, from Al Qasim Bin Muhammad, from Suleyman Bin Dawood Al Minqary, from Ali Bin Hashim Bin Al Bareyd, ",
            "(It has been narrated) from his father that a man asked Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> about the ascetism. So he<sup>asws</sup> said: ‘(It has) ten levels. So the highest level of the ascetism is the lowest level of the piety, and the highest level of the piety is the lowest level of the conviction, and the highest level of the convition is the lowest level of the satisfaction. Indeed! And the ascetism in a Verse from the Book of Allah<sup>azwj</sup> <span class=\"ibTxt\">[57:23] So that you may not despair over what has escaped you, nor be happy at what He has Given you</span>’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father and Ali ibn Muhammad from al- Qasim ibn Muhammad from Sulayman ibn Dawud al-Minqari from Ali ibn Hashim ibn al-Burayd from his father has said the following: “A man asked Ali ibn al-Husayn (a.s.) about renunciation of worldly matters. The Imam said, ‘It consists of ten issues. The highest degree of renunciation of worldly matters is the lowest stage of abstinence in worldly matters (sins). The highest stage of abstinence in worldly matters is the lowest degree of certainty. The highest stage of certainty is the lowest stage of consent. It is renunciation of worldly matters that is mentioned in the words of Allah, the Most Majestic, the Most Holy, ‘. . . so that you would neither grieve over what you have lost nor become much happy about what Allah has granted to you. . . (57:23) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/271)"
        ],
        "index": 1890,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:5",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ عَنِ الْمِنْقَرِيِّ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ هُوَ يَقُولُ كُلُّ قَلْبٍ فِيهِ شَكٌّ أَوْ شِرْكٌ فَهُوَ سَاقِطٌ وَ إِنَّمَا أَرَادُوا بِالزُّهْدِ فِي الدُّنْيَا لِتَفْرُغَ قُلُوبُهُمْ لِلْآخِرَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Al Minqary, from Sufyan Bin Uyayna who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> and he<sup>asws</sup> saying ‘Every heart wherein is a doubt or an association (Shirk), so it is fallen; and rather what is intended by the ascetism in the world is to free your hearts for the Hereafter’."
          ],
          "en.sarwar": [
            "5. It is reported through the same chain of narrators he has narrated from al-Minqari from Sufyan ibn ‘Uyayna who has said the following: “I heard abu ‘Abd Allah (a.s.) say, ‘Any heart in which there is doubt or that considers anything as a partner of Allah, such heart is a failure. The only purpose for their (servants of Allah’s) renunciation of worldly things is to evacuate them from their heart for the matters of next life.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/272)"
        ],
        "index": 1891,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:6",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِنَّ عَلَامَةَ الرَّاغِبِ فِي ثَوَابِ الْآخِرَةِ زُهْدُهُ فِي عَاجِلِ زَهْرَةِ الدُّنْيَا أَمَا إِنَّ زُهْدَ الزَّاهِدِ فِي هَذِهِ الدُّنْيَا لَا يَنْقُصُهُ مِمَّا قَسَمَ اللَّهُ عَزَّ وَ جَلَّ لَهُ فِيهَا وَ إِنْ زَهِدَ وَ إِنَّ حِرْصَ الْحَرِيصِ عَلَى عَاجِلِ زَهْرَةِ الْحَيَاةِ الدُّنْيَا لَا يَزِيدُهُ فِيهَا وَ إِنْ حَرَصَ فَالْمَغْبُونُ مَنْ حُرِمَ حَظَّهُ مِنَ الْآخِرَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Ibn Mahboub, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘A sign of the one desirous of the Rewards of the Hereater is his ascetism in the present blossoms of the world. But, the ascetism of the ascetic in this world would not reduce for him from whatever Allah<sup>azwj</sup> Mighty and Majestic has Apportioned for him regarding it, and even if he was ascetic; and if he was covetous upon the present blossoms of the life of the world, it would not increase him in it, even if he was covetous. The cheated one is the one who is deprived of his share from the Hereafter’."
          ],
          "en.sarwar": [
            "6. Ali has narrated from his father from ibn Mahbub from al-‘Ala’ ibn Razin from Muhammad ibn Muslim from abu ‘Abd Allah (a.s.) who has said the following: “Amir al-Mu’minin (Ali ibn abu Talib) (a.s.) has said, ‘Of the signs of one’s interest in the rewards of the next life is his renunciation of immediate attraction of worldly matters. Renunciation of worldly matters does not reduce one’s share of what Allah, the Most Majestic, the Most Holy, has assigned for him despite his renunciation of worldly matters. One’s greed in immediate attraction of worldly matters does not increase anything for him even if he exercises greed. The real loser is one who is deprived from his share of the next life.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف كالموثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (273/ 8)"
        ],
        "index": 1892,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى الْخَثْعَمِيِّ عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا أَعْجَبَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) شَيْ‏ءٌ مِنَ الدُّنْيَا إِلَّا أَنْ يَكُونَ فِيهَا جَائِعاً خَائِفاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Yahya Al Khash’amy, from Talha Bin Zayd, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Nothing from the world astounded Rasool-Allah<sup>saww</sup> except if there happened to be hunger and fear in it’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Yahya al-Khath’ami from Talha ibn Zayd from abu ‘Abd Allah (a.s.) who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘Every one of things the Messenger of Allah liked from this world was associated with suffering, hunger or fear.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (274/ 8)"
        ],
        "index": 1893,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:8",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ الْقَاسِمِ بْنِ يَحْيَى عَنْ جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ خَرَجَ النَّبِيُّ ( صلى الله عليه وآله ) وَ هُوَ مَحْزُونٌ فَأَتَاهُ مَلَكٌ وَ مَعَهُ مَفَاتِيحُ خَزَائِنِ الْأَرْضِ فَقَالَ يَا مُحَمَّدُ هَذِهِ مَفَاتِيحُ خَزَائِنِ الْأَرْضِ يَقُولُ لَكَ رَبُّكَ افْتَحْ وَ خُذْ مِنْهَا مَا شِئْتَ مِنْ غَيْرِ أَنْ تُنْقَصَ شَيْئاً عِنْدِي ",
          "فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الدُّنْيَا دَارُ مَنْ لَا دَارَ لَهُ وَ لَهَا يَجْمَعُ مَنْ لَا عَقْلَ لَهُ فَقَالَ الْمَلِكُ وَ الَّذِي بَعَثَكَ بِالْحَقِّ نَبِيّاً لَقَدْ سَمِعْتُ هَذَا الْكَلَامَ مِنْ مَلَكٍ يَقُولُهُ فِي السَّمَاءِ الرَّابِعَةِ حِينَ أُعْطِيتُ الْمَفَاتِيحَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Al Qasim Bin Yahya, from his grandfather Al Hassan Bin Rashid, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> who said: ‘The Prophet<sup style=\"font-weight: normal\">saww</sup> came out and he<sup style=\"font-weight: normal\">saww</sup> was in grief. So an Angel came over to him<sup style=\"font-weight: normal\">saww</sup>, and with him were keys to the treasures of the earth, and he said: ‘O Muhammad<sup style=\"font-weight: normal\">saww</sup>! These are keys to the treasures of the earth. Your<sup style=\"font-weight: normal\">saww</sup> Lord<sup style=\"font-weight: normal\">azwj</sup> is Saying to you<sup style=\"font-weight: normal\">saww</sup> “Open and take from it whatever you<sup style=\"font-weight: normal\">saww</sup> so desire to from without there being a reduction of anything in My Presence”’. ",
            "So Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> said: ‘The world is a house for the one what has no house for him, and for it there is a collection for the one who has no intellect for him’. So the Angel said: ‘By the One<sup style=\"font-weight: normal\">azwj</sup> Who Sent you<sup style=\"font-weight: normal\">saww</sup> with the Truth as a Prophet<sup style=\"font-weight: normal\">saww</sup>, I had heard this speech from an Angel saying it in the fourth sky, when I was given the keys’’."
          ],
          "en.sarwar": [
            "8. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from al-Qasim ibn Yahya from his grandfather al-Hassan ibn Rashid from ‘Abd Allah ibn Sinan from abu ‘Abd Allah (a.s.) who has said the following: “Once, the Holy Prophet came out very depressed. An angel came to him with the key to the treasures of the earth and said, ‘O Muhammad, these are the keys to the treasures of the earth and your Lord says, “Open these treasures and take whatever you want. It will not cause any reduction in your reward with Me.” The Messenger of Allah then said, ‘This world is home for the homeless. Only those who have no power of reason accumulate for this world.’ The angel then said, ‘I swear by the One Who has sent you with truth as a prophet that I heard what you just said from an angel saying it in the fourth heaven at the time these keys were given to me.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (275/ 8)"
        ],
        "index": 1894,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:9",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَرَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِجَدْيٍ أَسَكَّ مُلْقًى عَلَى مَزْبَلَةٍ مَيْتاً فَقَالَ لِأَصْحَابِهِ كَمْ يُسَاوِي هَذَا فَقَالُوا لَعَلَّهُ لَوْ كَانَ حَيّاً لَمْ يُسَاوِ دِرْهَماً فَقَالَ النَّبِيُّ ( صلى الله عليه وآله ) وَ الَّذِي نَفْسِي بِيَدِهِ لَلدُّنْيَا أَهْوَنُ عَلَى اللَّهِ مِنْ هَذَا الْجَدْيِ عَلَى أَهْلِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel Bin Darraj, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> passed by an earless goat who had been thrown upon the rubbish heap, dead. So he<sup>saww</sup> said to his<sup>saww</sup> companions: ‘How much would this one be worth when alive?’ So they said, Perhaps, if he was alive, it would not equate to a Dirham’. So the Prophet<sup>saww</sup> said: ‘By the One<sup>azwj</sup> in Whose Hand is my<sup>saww</sup> soul! This world is worth less to Allah<sup>azwj</sup> than this goat is upon its owners’."
          ],
          "en.sarwar": [
            "9. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Jumayl ibn Darraj from abu ‘Abd Allah (a.s.) who has said the following: “The Messenger of Allah (a.s.) once passed by a kid of a goat that was dead, with ears cut and was thrown on the trash collection site of a people. He asked those people how much it was worth. They replied, ‘Even when alive it was worth less than a dirham.’ The Holy Prophet then said, ‘I swear by the One in whose hand is my soul that this world in the sight of Allah is worth less than this (dead) goat is in the eyes of the people who own it.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/275)"
        ],
        "index": 1895,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:10",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ عَمَّنْ ذَكَرَهُ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا أَرَادَ اللَّهُ بِعَبْدٍ خَيْراً زَهَّدَهُ فِي الدُّنْيَا وَ فَقَّهَهُ فِي الدِّينِ وَ بَصَّرَهُ عُيُوبَهَا وَ مَنْ أُوتِيَهُنَّ فَقَدْ أُوتِيَ خَيْرَ الدُّنْيَا وَ الْآخِرَةِ ",
          "وَ قَالَ لَمْ يَطْلُبْ أَحَدٌ الْحَقَّ بِبَابٍ أَفْضَلَ مِنَ الزُّهْدِ فِي الدُّنْيَا وَ هُوَ ضِدٌّ لِمَا طَلَبَ أَعْدَاءُ الْحَقِّ قُلْتُ جُعِلْتُ فِدَاكَ مِمَّا ذَا قَالَ مِنَ الرَّغْبَةِ فِيهَا ",
          "وَ قَالَ أَ لَا مِنْ صَبَّارٍ كَرِيمٍ فَإِنَّمَا هِيَ أَيَّامٌ قَلَائِلُ أَلَا إِنَّهُ حَرَامٌ عَلَيْكُمْ أَنْ تَجِدُوا طَعْمَ الْإِيمَانِ حَتَّى تَزْهَدُوا فِي الدُّنْيَا .",
          "قَالَ وَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِذَا تَخَلَّى الْمُؤْمِنُ مِنَ الدُّنْيَا سَمَا وَ وَجَدَ حَلَاوَةَ حُبِّ اللَّهِ وَ كَانَ عِنْدَ أَهْلِ الدُّنْيَا كَأَنَّهُ قَدْ خُولِطَ وَ إِنَّمَا خَالَطَ الْقَوْمَ حَلَاوَةُ حُبِّ اللَّهِ فَلَمْ يَشْتَغِلُوا بِغَيْرِهِ .",
          "قَالَ وَ سَمِعْتُهُ يَقُولُ إِنَّ الْقَلْبَ إِذَا صَفَا ضَاقَتْ بِهِ الْأَرْضُ حَتَّى يَسْمُوَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Ali Bin Muhammad Al Qasany, from the one who mentioned it, from the one who mentioned it, from Abdullah Bin Al Qasim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When Allah<sup>azwj</sup> Intends goodness with a servant, He<sup>azwj</sup> Causes him to be an ascetic in the world and to have an understanding regarding the Religion, and to have an insight into its faults, and the one who has been Given these, so he has been given the best of the world and the Hereafter’.",
            "And he<sup style=\"font-weight: normal\">asws</sup> said: ‘No one would (be able to) seek the truth by a door superior than the ascetism in the world, and it is opposite of what the enemies of the truth are seeking’. I said, ‘May I be sacrificed for you<sup style=\"font-weight: normal\">asws</sup>! What is that from?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘From the desire with regards to it’. ",
            "And he<sup style=\"font-weight: normal\">asws</sup> said: ‘Is he not from the prestigious patient ones, as rather, these are (only) a few days (of this worldly life). Indeed! It is Prohibited upon you all that you would find the taste of the <span class=\"iTxt\">Emān</span> until you are ascetic in the world’.",
            "He (the narrator) said, ‘And I heard Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> saying: ‘When a Believer isolates from the world, he would soar and find the sweetness of the love of Allah<sup style=\"font-weight: normal\">azwj</sup>, and in the presence of the people of the world he would be as if he is muddled up, and rather the people are isolated from the sweetness of the love of Allah<sup style=\"font-weight: normal\">azwj</sup>. Therefore, do not pre-occupy yourselves with something else’.",
            "He (the narrator) said, ‘And I heard him<sup>asws</sup> saying: ‘When a heart is cleansed, the earth will look small for him until he gains real height (of the Irfan – recognition of the Divine Mysteries)’."
          ],
          "en.sarwar": [
            "10. Ali ibn Ibrahim has narrated from his father from Muhammad ibn Ali al- Qasani from those he has mentioned (in his book) from ‘Abd Allah ibn al-Qasim from abu ‘Abd Allah (a.s.) who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘When Allah wants good for a servant (of Allah) He makes him reduce his interest in worldly matters, grants him good understanding in religion, and shows him his shortcomings. Whoever receives these things receives the good of both this and the next life.’ The Imam then said, ‘For the seekers of truth no other door is better than abstinence from worldly matters and this is exactly opposite to what the enemies of the truth search for.’ I (the narrator) then asked, ‘May Allah keep my soul in service for your cause, abstinence in what?’ The Imam said, ‘It is abstinence in desire for worldly matters, except one who exercises graceful patience. It (the worldly life) is only few days. It is unlawful for you to sense the test of belief without reducing your interest in worldly things.’ I (the narrator) heard abu ‘Abd Allah (a.s.) saying, ‘When the believer evacuates worldly matters from his self he gains new heights. He then senses the sweetness of the love for Allah and to the people of the world he looks like those whose power of reason is mixed and confused. In fact, they have become mixed with the love of Allah and have cut off all business with the others.’ I (the narrator) heard the Imam saying, ‘When a heart is cleared, the earth will look small for him until he gains real height.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/279)"
        ],
        "index": 1896,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:11",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْمِنْقَرِيِّ عَنْ عَبْدِ الرَّزَّاقِ بْنِ هَمَّامٍ عَنْ مَعْمَرِ بْنِ رَاشِدٍ عَنِ الزُّهْرِيِّ مُحَمَّدِ بْنِ مُسْلِمِ بْنِ شِهَابٍ قَالَ سُئِلَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) أَيُّ الْأَعْمَالِ أَفْضَلُ عِنْدَ اللَّهِ عَزَّ وَ جَلَّ فَقَالَ مَا مِنْ عَمَلٍ بَعْدَ مَعْرِفَةِ اللَّهِ جَلَّ وَ عَزَّ وَ مَعْرِفَةِ رَسُولِهِ ( صلى الله عليه وآله ) أَفْضَلَ مِنْ بُغْضِ الدُّنْيَا وَ إِنَّ لِذَلِكَ لَشُعَباً كَثِيرَةً وَ لِلْمَعَاصِي شُعَباً",
          "فَأَوَّلُ مَا عُصِيَ اللَّهُ بِهِ الْكِبْرُ وَ هِيَ مَعْصِيَةُ إِبْلِيسَ حِينَ أَبَى وَ اسْتَكْبَرَ وَ كَانَ مِنَ الْكَافِرِينَ",
          "وَ الْحِرْصُ وَ هِيَ مَعْصِيَةُ آدَمَ وَ حَوَّاءَ حِينَ قَالَ اللَّهُ عَزَّ وَ جَلَّ لَهُمَا فَكُلا مِنْ حَيْثُ شِئْتُما وَ لا تَقْرَبا هذِهِ الشَّجَرَةَ فَتَكُونا مِنَ الظَّالِمِينَ فَأَخَذَا مَا لَا حَاجَةَ بِهِمَا إِلَيْهِ فَدَخَلَ ذَلِكَ عَلَى ذُرِّيَّتِهِمَا إِلَى يَوْمِ الْقِيَامَةِ وَ ذَلِكَ أَنَّ أَكْثَرَ مَا يَطْلُبُ ابْنُ آدَمَ مَا لَا حَاجَةَ بِهِ إِلَيْهِ",
          "ثُمَّ الْحَسَدُ وَ هِيَ مَعْصِيَةُ ابْنِ آدَمَ حَيْثُ حَسَدَ أَخَاهُ فَقَتَلَهُ فَتَشَعَّبَ مِنْ ذَلِكَ حُبُّ النِّسَاءِ وَ حُبُّ الدُّنْيَا وَ حُبُّ الرِّئَاسَةِ وَ حُبُّ الرَّاحَةِ وَ حُبُّ الْكَلَامِ وَ حُبُّ الْعُلُوِّ وَ الثَّرْوَةِ فَصِرْنَ سَبْعَ خِصَالٍ فَاجْتَمَعْنَ كُلُّهُنَّ فِي حُبِّ الدُّنْيَا فَقَالَ الْأَنْبِيَاءُ وَ الْعُلَمَاءُ بَعْدَ مَعْرِفَةِ ذَلِكَ حُبُّ الدُّنْيَا رَأْسُ كُلِّ خَطِيئَةٍ وَ الدُّنْيَا دُنْيَاءَانِ دُنْيَا بَلَاغٍ وَ دُنْيَا مَلْعُونَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Ali Bin Muhammad Al Qasany, from Al Qasim Bin Muhammad, from Suleyman Bin Dawood Al Minqary, from Abdul Razzaq Bin Hammam, from Moamar Bin Rashid, from Al Zuhry Muhammad Bin Muslim Bin Shihad who said, ",
            "‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> was asked, ‘Which of the deeds is superior in the Presence of Allah<sup>azwj</sup> Might and Majestic?’ So he<sup>asws</sup> said: ‘There is none from the deeds, after the recognition of Allah<sup>azwj</sup> Majestic and Mighty, and recognition of His<sup>azwj</sup> Rasool<sup>saww</sup> more superior than hatred of the world, and in that are a lot of branches, and the disobedience also has branches (as well)’.",
            "So the first of what Allah<sup>azwj</sup> was disobeyed with was the arrogance, and it is the disobedience of Iblees<sup>la</sup> when he<sup>la</sup> refused, and was arrogant, and he<sup>la</sup> was from the disbelievers. ",
            "And greed, it is the disobedience of Adam<sup>as</sup> and Hawwa<sup>as</sup> when Allah<sup>azwj</sup> Mighty and Majestic Said for them<sup>as</sup> <span class=\"ibTxt\">[2:35] and eat from it a plenteous (food) wherever you two wish to and do not approach this tree, for then you will become from the unjust</span>. So they<sup>as</sup> took what there was no need with them to it. Thus, that entered upon their<sup>as</sup> offspring up to the Day of Judgement, and that is the most of what the son of Adam<sup>as</sup> sees is what he does not have a need for it.",
            "Then the envy, and it is a disobedience of the son<sup>la</sup> of Adam<sup>as</sup> where he envied his<sup>la</sup> brother<sup>as</sup>, so he<sup>la</sup> killed him<sup>as</sup>. Thus, from that branched out the love of the women, and the love of the world, and love of the government, and love of the relaxation, and love of the speech, and love of the exaltedness and the wealth. So these came to be seven characteristics, being gathered in the love for the world. Therefore, the Prophets<sup>as</sup>, and the knowledgeable ones<sup>asws</sup> said after recognising that: ‘The love for the world is the head of the sins’. And the world is two (types of) world – the world of the bare necessities and the condemned world ’."
          ],
          "en.sarwar": [
            "11. Ali has narrated (from his father) from Ali ibn Muhammad al-Qasani from al- Qasim ibn Muhammad from Sulayman ibn Dawud al-Minqari from ‘Abd al- Razzaq ibn Hammam from Mu’ammar ibn Rashid from al-Zuhri Muhammad ibn Muslim ibn Shihab who has said the following: “Ali ibn al-Husayn (a.s.) was asked, ‘Which deed is more meritorious in the sight of Allah, the Most Majestic, the Most Holy?’ The Imam said, ‘No deed, after knowing Allah, the Most Majestic, the Most Holy, and the Messenger of Allah is more meritorious than to dislike (and hate) the world. It has many branches. Sins have many branches. The first disobedience to Allah was because of arrogance that Satan committed when he refused boastfully and became of those who reject (the command of Allah). Greed was the sin of Adam and Eve. Allah, the Most Majestic, the Most Holy, has said, ‘We told Adam to stay with his spouse (Eve) in the garden and enjoy the foods therein. We (also) told them to stay away from going near a certain tree lest they might become one of the transgressors.’ (2:35) They took what they did not need and this remains in their descendents to the Day of Judgment. For this reason most of the things that the children of Adam want they do not need. Then it is jealousy because of which the son of Adam committed disobedience and murdered his brother out of jealousy. From this branch comes love for women, love for the world, love for leadership, love for comfort, love to speak, love for higher position and wealth. They are seven characteristics and all of them are gathered together in the love for the world. The prophets and scholars after knowing this have said: ‘Love for the world is the head of all sins.’ There are two worlds: the world of bare necessities and the condemned world.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن موثق كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (281/ 8)"
        ],
        "index": 1897,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:12",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ بُكَيْرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ فِي طَلَبِ الدُّنْيَا إِضْرَاراً بِالْآخِرَةِ وَ فِي طَلَبِ الْآخِرَةِ إِضْرَاراً بِالدُّنْيَا فَأَضِرُّوا بِالدُّنْيَا فَإِنَّهَا أَوْلَى بِالْإِضْرَارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father from Ibn Abu Umeyr, from Ibn Bukeyr, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘In seeking of the world there is loss incurred with the Hereafter and in seeking the Hereafter there is loss incurred with the world. So incur losses with the world for it is more appropriate with the losses’."
          ],
          "en.sarwar": [
            "12. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ibn Bukayr from abu ‘Abd Allah (a.s.) who has said the following: “The Messenger of Allah has said, ‘Seeking worldly benefits amounts to one’s disadvantages of the next world and seeking the advantages of the next world may become losses in the benefits of this world. You must then cause losses to worldly benefits; it is better to suffer worldly losses (than to suffer losses in the next life).’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (285/ 8)"
        ],
        "index": 1898,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:13",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ أَبِي عُبَيْدَةَ الْحَذَّاءِ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) حَدِّثْنِي بِمَا أَنْتَفِعُ بِهِ فَقَالَ يَا أَبَا عُبَيْدَةَ أَكْثِرْ ذِكْرَ الْمَوْتِ فَإِنَّهُ لَمْ يُكْثِرْ إِنْسَانٌ ذِكْرَ الْمَوْتِ إِلَّا زَهِدَ فِي الدُّنْيَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa from Ali Bin Al Hakam, from Abu Ayoub Al Khazzaz, from Abu Ubeyda Al Haza’a who said, ",
            "‘I said to Abu Ja’far<sup style=\"font-weight: normal\">asws</sup>, ‘(Please) Narrate to me with what I can benefit from’. So he<sup style=\"font-weight: normal\">asws</sup> said: ‘O Abu Ubeyda! Frequently remember the death, for a human being would not frequent in remembering the death except that he would be an ascetic in the world’."
          ],
          "en.sarwar": [
            "13. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from abu Ayyub al-Khazzaz from abu ‘Ubaydah al-Hadhdha’ who has said the following: “I asked abu Ja’far (a.s.) ‘(I request you to) teach me a Hadith that can benefit me.’ The Imam said, ‘O abu ‘Ubaydah, speak of death very often. No one speaks of death very often but that it reduces his interest in worldly matters.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (285/ 8)"
        ],
        "index": 1899,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:14",
        "text": [
          "عَنْهُ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْحَكَمِ بْنِ أَيْمَنَ عَنْ دَاوُدَ الْأَبْزَارِيِّ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) مَلَكٌ يُنَادِي كُلَّ يَوْمٍ ابْنَ آدَمَ لِدْ لِلْمَوْتِ وَ اجْمَعْ لِلْفَنَاءِ وَ ابْنِ لِلْخَرَابِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ali Bin Al Hakam, from Al Hakam Bin Ayman, from Dawood Al Abzary who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘An Angels calls out every day: ‘O son of Adam<sup>as</sup>! You are begetting for the death, and amassing for the perishing, and building for the ruination’."
          ],
          "en.sarwar": [
            "14. It is narrated from him (narrator of the Hadith above) from Ali ibn al-Hakam from al-Hakam ibn Ayman from Dawud al-Abzari who has said the following: “Abu Ja’far (a.s.) has said, ‘There is an angel that announces every day, “O sons of Adam, reproduce for death, accumulate for annihilation and build for destruction.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/286)"
        ],
        "index": 1900,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:15",
        "text": [
          "عَنْهُ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عُمَرَ بْنِ أَبَانٍ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ عَلِيُّ بْنُ الْحُسَيْنِ ( صلوات الله عليه )  إِنَّ الدُّنْيَا قَدِ ارْتَحَلَتْ مُدْبِرَةً وَ إِنَّ الْآخِرَةَ قَدِ ارْتَحَلَتْ مُقْبِلَةً وَ لِكُلِّ وَاحِدَةٍ مِنْهُمَا بَنُونَ فَكُونُوا مِنْ أَبْنَاءِ الْآخِرَةِ وَ لَا تَكُونُوا مِنْ أَبْنَاءِ الدُّنْيَا أَلَا وَ كُونُوا مِنَ الزَّاهِدِينَ فِي الدُّنْيَا الرَّاغِبِينَ فِي الْآخِرَةِ أَلَا إِنَّ الزَّاهِدِينَ فِي الدُّنْيَا اتَّخَذُوا الْأَرْضَ بِسَاطاً وَ التُّرَابَ فِرَاشاً وَ الْمَاءَ طِيباً وَ قُرِّضُوا مِنَ الدُّنْيَا تَقْرِيضاً",
          "أَلَا وَ مَنِ اشْتَاقَ إِلَى الْجَنَّةِ سَلَا عَنِ الشَّهَوَاتِ وَ مَنْ أَشْفَقَ مِنَ النَّارِ رَجَعَ عَنِ الْمُحَرَّمَاتِ وَ مَنْ زَهِدَ فِي الدُّنْيَا هَانَتْ عَلَيْهِ الْمَصَائِبُ أَلَا إِنَّ لِلَّهِ عِبَاداً كَمَنْ رَأَى أَهْلَ الْجَنَّةِ فِي الْجَنَّةِ مُخَلَّدِينَ وَ كَمَنْ رَأَى أَهْلَ النَّارِ فِي النَّارِ مُعَذَّبِينَ ",
          "شُرُورُهُمْ مَأْمُونَةٌ وَ قُلُوبُهُمْ مَحْزُونَةٌ أَنْفُسُهُمْ عَفِيفَةٌ وَ حَوَائِجُهُمْ خَفِيفَةٌ صَبَرُوا أَيَّاماً قَلِيلَةً فَصَارُوا بِعُقْبَى رَاحَةٍ طَوِيلَةٍ أَمَّا اللَّيْلَ فَصَافُّونَ أَقْدَامَهُمْ تَجْرِي دُمُوعُهُمْ عَلَى خُدُودِهِمْ وَ هُمْ يَجْأَرُونَ إِلَى رَبِّهِمْ يَسْعَوْنَ فِي فَكَاكِ رِقَابِهِمْ ",
          "وَ أَمَّا النَّهَارَ فَحُلَمَاءُ عُلَمَاءُ بَرَرَةٌ أَتْقِيَاءُ كَأَنَّهُمْ الْقِدَاحُ قَدْ بَرَاهُمُ الْخَوْفُ مِنَ الْعِبَادَةِ يَنْظُرُ إِلَيْهِمُ النَّاظِرُ فَيَقُولُ مَرْضَى وَ مَا بِالْقَوْمِ مِنْ مَرَضٍ أَمْ خُولِطُوا فَقَدْ خَالَطَ الْقَوْمَ أَمْرٌ عَظِيمٌ مِنْ ذِكْرِ النَّارِ وَ مَا فِيهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ali Bin Al Hakam, from Umar Bin Aban, from Abu Hamza, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said: ‘The world is travelling away from you and the Hereafter is travelling towards you, and for each one of the those are (like being) sons (to). So be from the sons of the Hereafter and do not become from the sons of the world; and become from the ascetics in the world desirous for the Hereafter. Indeed! The ascetics in the world are taking the ground as a habitat and the dust as a bedding and the water as a perfurme, and have cut off from the world with a cutting off.",
            "Indeed! The one who is desirous to the Paradise would rein himself from the lustful desires, and the one fearful from the Fire would retract from the Prohibitions, and the one ascetic in the world, the difficulties would become easire upon him. Indeed! For Allah<sup style=\"font-weight: normal\">azwj</sup> there are such servants as if they can see the people of the Paradise being in the Paradise eternally, and like the ones who see the people of the Fire being Punished in the Fire. ",
            "Their wickedness is safe (locked away), and their hearts are grieving, their selves are chaste, and their needs are light. They are observing patience for a few days and they would end up with a prolonged rest. As for the night, so they are forming a row with their feet, their tears flowing upon their cheeks, and they are supplicating to their Lord<sup style=\"font-weight: normal\">azwj</sup> striving to free their necks (from the Fire). ",
            "And as for the day, so they are forbearing, scholarly, righteous, pious, as if like the arrows freed from the fins (slim) due to worship. The beholder would look at them and he would be saying, ‘A sickness’; and (but) there is no sickness with the group or any confusion, for the group has indulged in a great matter from the remembrance of the Fire and whatever is in it’."
          ],
          "en.sarwar": [
            "15. It is narrated from him (narrator of the Hadith above) from Ali ibn al-Hakam from ‘Amr ibn Aban from abu Hamza from abu Ja’far (a.s.) who has said the following: “Ali ibn al-Husayn (a.s.) has said, ‘The world has begun to move backwards and the next world is moving forward. Each world has its sons. Therefore, you must be of the sons of the next world and not the sons of this world. You must be of those who have reduced their interest in worldly matters and of those seriously interested in the next life. You must know that those with reduced interest in worldly matters have taken the earth as their habitat, the soil as their bedding, water as their perfume and have cut themselves off this world in all seriousness.’ “Note that those who are interested in paradise have harnessed their worldly desires and those who are afraid of the fire have turned away from prohibited matters. Whoever reduces his interests in worldly matters, hardships become easy for him. “Note that there are the servants of Allah who are as if they, actually, see the people of paradise in paradise live forever and the people of fire in the fire in huge suffering. Instead of evil coming from them it is absolute peace, the hearts of these servants of Allah are sad, their soul chaste, and their needs are very light. They exercise patience for a few short days followed by a very long lasting comfort. At night they stand up straight with their feet side by side and tears come down their cheeks. They plead before their Lord and struggle to set their neck free (of sins). In the day they are forbearing scholars, very virtuous and pious. They are slim like an arrow without fins; it is caused by their fear (for possible suffering in the next life) during their worship. On looking to them one may think they suffer from illness. They, in fact, have no illness, or any confusion in their reasoning power, but they have plunged into a tremendously great issue; it is the issue of the fire and all that it involves.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (291/ 8)"
        ],
        "index": 1901,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:16",
        "text": [
          "عَنْهُ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ اللَّهِ الْمُؤْمِنِ عَنْ جَابِرٍ قَالَ دَخَلْتُ عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) فَقَالَ يَا جَابِرُ وَ اللَّهِ إِنِّي لَمَحْزُونٌ وَ إِنِّي لَمَشْغُولُ الْقَلْبِ قُلْتُ جُعِلْتُ فِدَاكَ وَ مَا شُغُلُكَ وَ مَا حُزْنُ قَلْبِكَ فَقَالَ يَا جَابِرُ إِنَّهُ مَنْ دَخَلَ قَلْبَهُ صَافِي خَالِصِ دِينِ اللَّهِ شَغَلَ قَلْبَهُ عَمَّا سِوَاهُ يَا جَابِرُ مَا الدُّنْيَا وَ مَا عَسَى أَنْ تَكُونَ الدُّنْيَا هَلْ هِيَ إِلَّا طَعَامٌ أَكَلْتَهُ أَوْ ثَوْبٌ لَبِسْتَهُ أَوِ امْرَأَةٌ أَصَبْتَهَا",
          "يَا جَابِرُ إِنَّ الْمُؤْمِنِينَ لَمْ يَطْمَئِنُّوا إِلَى الدُّنْيَا بِبَقَائِهِمْ فِيهَا وَ لَمْ يَأْمَنُوا قُدُومَهُمُ الْآخِرَةَ يَا جَابِرُ الْآخِرَةُ دَارُ قَرَارٍ وَ الدُّنْيَا دَارُ فَنَاءٍ وَ زَوَالٍ وَ لَكِنْ أَهْلُ الدُّنْيَا أَهْلُ غَفْلَةٍ وَ كَأَنَّ الْمُؤْمِنِينَ هُمُ الْفُقَهَاءُ أَهْلُ فِكْرَةٍ وَ عِبْرَةٍ لَمْ يُصِمَّهُمْ عَنْ ذِكْرِ اللَّهِ جَلَّ اسْمُهُ مَا سَمِعُوا بِآذَانِهِمْ وَ لَمْ يُعْمِهِمْ عَنْ ذِكْرِ اللَّهِ مَا رَأَوْا مِنَ الزِّينَةِ بِأَعْيُنِهِمْ",
          "فَفَازُوا بِثَوَابِ الْآخِرَةِ كَمَا فَازُوا بِذَلِكَ الْعِلْمِ وَ اعْلَمْ يَا جَابِرُ أَنَّ أَهْلَ التَّقْوَى أَيْسَرُ أَهْلِ الدُّنْيَا مَئُونَةً وَ أَكْثَرُهُمْ لَكَ مَعُونَةً تَذْكُرُ فَيُعِينُونَكَ وَ إِنْ نَسِيتَ ذَكَّرُوكَ",
          "قَوَّالُونَ بِأَمْرِ اللَّهِ قَوَّامُونَ عَلَى أَمْرِ اللَّهِ قَطَعُوا مَحَبَّتَهُمْ بِمَحَبَّةِ رَبِّهِمْ وَ وَحَشُوا الدُّنْيَا لِطَاعَةِ مَلِيكِهِمْ وَ نَظَرُوا إِلَى اللَّهِ عَزَّ وَ جَلَّ وَ إِلَى مَحَبَّتِهِ بِقُلُوبِهِمْ وَ عَلِمُوا أَنَّ ذَلِكَ هُوَ الْمَنْظُورُ إِلَيْهِ لِعَظِيمِ شَأْنِهِ",
          "فَأَنْزِلِ الدُّنْيَا كَمَنْزِلٍ نَزَلْتَهُ ثُمَّ ارْتَحَلْتَ عَنْهُ أَوْ كَمَالٍ وَجَدْتَهُ فِي مَنَامِكَ فَاسْتَيْقَظْتَ وَ لَيْسَ مَعَكَ مِنْهُ شَيْ‏ءٌ إِنِّي [إِنَّمَا] ضَرَبْتُ لَكَ هَذَا مَثَلًا لِأَنَّهَا عِنْدَ أَهْلِ اللُّبِّ وَ الْعِلْمِ بِاللَّهِ كَفَيْ‏ءِ الظِّلَالِ",
          "يَا جَابِرُ فَاحْفَظْ مَا اسْتَرْعَاكَ اللَّهُ جَلَّ وَ عَزَّ مِنْ دِينِهِ وَ حِكْمَتِهِ وَ لَا تَسْأَلَنَّ عَمَّا لَكَ عِنْدَهُ إِلَّا مَا لَهُ عِنْدَ نَفْسِكَ فَإِنْ تَكُنِ الدُّنْيَا عَلَى غَيْرِ مَا وَصَفْتُ لَكَ فَتَحَوَّلْ إِلَى دَارِ الْمُسْتَعْتَبِ فَلَعَمْرِي لَرُبَّ حَرِيصٍ عَلَى أَمْرٍ قَدْ شَقِيَ بِهِ حِينَ أَتَاهُ وَ لَرُبَّ كَارِهٍ لِأَمْرٍ قَدْ سَعِدَ بِهِ حِينَ أَتَاهُ وَ ذَلِكَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ لِيُمَحِّصَ اللَّهُ الَّذِينَ آمَنُوا وَ يَمْحَقَ الْكافِرِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ali Bin Al Hakam, from Abu Abdullah Al Momine, from Jabir who said, ",
            "‘I went over to Abu Ja’far<sup>asws</sup>, so he<sup>asws</sup> said: ‘O Jabir! By Allah<sup>azwj</sup> I<sup>asws</sup> am grieved and I<sup>asws</sup> pre-occupied of heart’. I said, ‘May I be sacrificed for you<sup>asws</sup>! What grieves your<sup>asws</sup> heart?’ O Jabir! The one in whose heart enters the purity (and) sincerity for the Religion of Allah<sup>azwj</sup>, it pre-occupies his heart from what is besides it. O Jabir! What is the world and what can the world happen to be? Is it only the food that you eat, or clothes you wear, or a woman you accompany with?",
            "O Jabir! The Believers do not rest assured to the world by their remaining in it, and do not feel secure of their proceeding to the Hereafter. O Jabir! The Hereafter is a house of (permanent) abode and the world is a house of annihilation and decline, but the people of the world are oblivious, and it is as if the Believers, they are the understanding ones, the thinking people, learners. They are not deafened from the Mention of Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Name, what they are hearing by their ears, and they are not blinded from the Remembrance of Allah<sup>azwj</sup>, what they are seeing from the adornments by their eyes. ",
            "Thus, they have been successful with (achieving) the Rewards of the Hereafter just as they were successful with (acquiring) that knowledge. And know, O Jabir, that the people of piety are the people with the smallest of provisions of the world, and they (are the) people who provide the most to you. You mention them and they will be assisting you, and if you forget, they would mention you. ",
            "They are speaking by the Commands of Allah<sup>azwj</sup>, steadfast upon the Commands of Allah<sup>azwj</sup>. Their love (for others) and their desires for the world and their kings is cut-off by their love for their Lord<sup>azwj</sup>, and they are looking towards Allah<sup>azwj</sup> Mighty and Majestic and to His<sup>azwj</sup> Love by their hearts, and they know that the looking towards Him<sup>azwj</sup> is a great affair.",
            "So (for them) the world is a lodge like a lodge they lodge in, then they depart from it, or like wealth you tend to see in your dream, and then you wake up, and there is nothing from it with you. I<sup>asws</sup>, rather struck this example for you because it (the world) in the view of the people of understanding and knowledge with Allah<sup>azwj</sup>, is like a passing shadow. ",
            "O Jabir! Protect whatever Allah<sup>azwj</sup> Mighty and Majestic has Attracted you with from His<sup>azwj</sup> Religion and His<sup>azwj</sup> Wisdom, and do not ask about what there is for you in His<sup>azwj</sup> Presence, except what is there for Him<sup>azwj</sup> in your soul. So if the world happens to be upon other than what I<sup>asws</sup> have described to you, so reconsider it as a house of reproach (blame). So the person is sometimes greedy upon a matter and would be miserable with it when it comes to him, and sometimes he dislikes a matter which he would be happy with it when it comes to him, and these are the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[3:141] And that He may Examine those who believe and wipe out the unbelievers</span>’."
          ],
          "en.sarwar": [
            "16. It is narrated from him (narrator of the Hadith above) from Ali ibn al-Hakam from abu ‘Abd Allah al-Mu’min from Jabir who has said the following: “Once I went to visit abu la’ far (a.s.) and he said, ‘O Jabir, I swear by Allah, I am very sad and my heart is pre-occupied.’ I then asked, ‘May Allah keep my soul in service for your cause, what has pre-occupied your heart and what is the reason for your sadness?’ The Imam said, ‘O Jabir, if the religion of Allah in its pure form may enter one’s heart it preoccupies the heart above everything else. O Jabir, what is the world and what can one think it can be? Is it more than food to eat, clothes to wear and a woman whom you may find?’ “O Jabir, the believers are not satisfied with remaining in it (world) and they do not feel safe from the coming of the next life. O Jabir, the next life is the permanent house and this world is finishing and passing but the people of this world are neglectful. The believers are of deep understanding, people of thinking, of learning lessons and their speaking of Allah, Most Glorious is Whose name, is not silenced by means of what their ears hear. Their eyes are not blinded in speaking of Allah due to what they see of the worldly attractions (around). They have suceeded in gaining the rewards of the next life just as they have succeeded in gaining that knowledge. “O Jabir, you must know that people of piety are of smallest expenses and the most helpful to others. If you speak of them they will assist you and if you forget them they will speak of you. They are the most outspoken for the commands of Allah and steadfast in obeying the orders of Allah. They have discontinued their love (for others) with love for their Lord and they have cut themselves off from the world to obey their owner and king. They look to Allah, the Most Majestic, the Most Holy, and to His love with their hearts, and have learned that this is what they must look at due to its great position. Thus they have considered the world a temporary place to stay and then leave forever, or like a property that one finds in his dream and upon waking finds no trace of it. I give you this example because to people of reason and knowledge of Allah it is like fast-passing shadow. O Jabir, protect what Allah, the Most Majestic, the Most Holy, expects you to protect of His religion and wisdom. Never ask of things that are for you with Him but ask of His things that are with your soul. If the world is other than what I described for you, then consider it a house (a correctional facility) where you can seek to reform yourself. I swear by my life that many are those who are greedy for a certain matter but it makes them miserable when they achieve it and many are those who dislike a certain matter but it makes them fortunate when they find it. This is mentioned in the words of Allah, the Most Majestic, the Most Holy, ‘So that Allah would test the faith of the believers, and deprive the unbelievers of (His) blessings.’” (3:141) Note: “House (correctional facility) and reform” is a reference to verse, 24, 84, 57, 35 and 24 of Chapters, 41, 16, 30, 45 and 41, respectively. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف كالموثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/298)"
        ],
        "index": 1902,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:17",
        "text": [
          "عَنْهُ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُوسَى بْنِ بَكْرٍ عَنْ أَبِي إِبْرَاهِيمَ ( عليه السلام ) قَالَ قَالَ أَبُو ذَرٍّ رَحِمَهُ اللَّهُ جَزَى اللَّهُ الدُّنْيَا عَنِّي مَذَمَّةً بَعْدَ رَغِيفَيْنِ مِنَ الشَّعِيرِ أَتَغَدَّى بِأَحَدِهِمَا وَ أَتَعَشَّى بِالْآخَرِ وَ بَعْدَ شَمْلَتَيِ الصُّوفِ أَتَّزِرُ بِإِحْدَاهُمَا وَ أَتَرَدَّى بِالْأُخْرَى ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ali Bin Al Hakam, from Musa Bin Bakr, ",
            "(It has been narrated) from Abu Ibrahim<sup style=\"font-weight: normal\">asws</sup> (7<sup style=\"font-weight: normal\">th</sup> Imam<sup style=\"font-weight: normal\">asws</sup>) having said: ‘Abu Zarr<sup style=\"font-weight: normal\">ra</sup>, may Allah<sup style=\"font-weight: normal\">azwj</sup> have Mercy on him<sup style=\"font-weight: normal\">ra</sup> said, ‘May Allah<sup style=\"font-weight: normal\">azwj</sup> Condemn the world on my<sup style=\"font-weight: normal\">ra</sup> behalf after two loaves of barley, I<sup style=\"font-weight: normal\">ra</sup> can have lunch with one of them and dinner with the other, and after two woolen clothes I<sup style=\"font-weight: normal\">as</sup> wear as a trouser with one of them, and as a cloak with the other one’."
          ],
          "en.sarwar": [
            "17. It is narrated from him (narrator of the Hadith above) from Ali ibn al-Hakam from Musa ibn Bakr from abu Ibrahim (a.s.) who has said the following: “Abu Dhar, may Allah grant him favors, has said, ‘May Allah renounce the world, on my behalf, except for two loaves of barley bread daily, one for my lunch and the other for my dinner and two woolen pieces of cloth which I use one as a shirt and the other as trousers.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/299)"
        ],
        "index": 1903,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:18",
        "text": [
          "وَ عَنْهُ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْمُثَنَّى عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ أَبُو ذَرٍّ رَضِيَ اللَّهُ عَنْهُ يَقُولُ فِي خُطْبَتِهِ يَا مُبْتَغِيَ الْعِلْمِ كَأَنَّ شَيْئاً مِنَ الدُّنْيَا لَمْ يَكُنْ شَيْئاً إِلَّا مَا يَنْفَعُ خَيْرُهُ وَ يَضُرُّ شَرُّهُ إِلَّا مَنْ رَحِمَ اللَّهُ",
          "يَا مُبْتَغِيَ الْعِلْمِ لَا يَشْغَلُكَ أَهْلٌ وَ لَا مَالٌ عَنْ نَفْسِكَ أَنْتَ يَوْمَ تُفَارِقُهُمْ كَضَيْفٍ بِتَّ فِيهِمْ ثُمَّ غَدَوْتَ عَنْهُمْ إِلَى غَيْرِهِمْ وَ الدُّنْيَا وَ الْآخِرَةُ كَمَنْزِلٍ تَحَوَّلْتَ مِنْهُ إِلَى غَيْرِهِ وَ مَا بَيْنَ الْمَوْتِ وَ الْبَعْثِ إِلَّا كَنَوْمَةٍ نِمْتَهَا ثُمَّ اسْتَيْقَظْتَ مِنْهَا يَا مُبْتَغِيَ الْعِلْمِ قَدِّمْ لِمَقَامِكَ بَيْنَ يَدَيِ اللَّهِ عَزَّ وَ جَلَّ فَإِنَّكَ مُثَابٌ بِعَمَلِكَ كَمَا تَدِينُ تُدَانُ يَا مُبْتَغِيَ الْعِلْمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Ali Bin Al Hakam, from Al Musna, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It was so that Abu Zarr<sup>ra</sup>, may Allah<sup>azwj</sup> be Pleased with him<sup>ra</sup> said in a sermon, ‘O seeker of the knowledge. It is as if something from the world does not happen to be a thing except whatever it benefitted by its goodness and is harmed by its evil, except for the one Allah<sup>azwj</sup> is Merciful to. ",
            "O seeker of knowledge! Neither should the family nor the wealth pre-occupy you from yourself. You are like a guest today sleeping among them, then you would be going away from them to the others; and the world and the Hereafter are like a house you transfer from to another; and what is the death and the Resurrection except like a sleep you sleep, then you wake up from it? O seeker of knowledge! Proceed to your place in front of Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic, for you would be Rewarded for your deeds just as you would reap what you have sown, O seeker of knowledge’."
          ],
          "en.sarwar": [
            "18. It is narrated from him (narrator of the Hadith above) from Ali ibn al-Hakam from al-Muthanna from abu Basir from abu ‘Abd Allah (a.s.) who has said the following: “Abu Dhar, may Allah grant him favors, has said in his sermons, ‘O you who are found of knowledge, consider worldly things as nothing except what is beneficial in it, and its evil is harmful to people except those to whom Allah has done favors. O you who are found of knowledge do not allow your family and property to preoccupy you so you forget all about your soul. One day you will leave them like a mere guest among them does. You then will depart to be with others. This world and the next world are like two places to move from one to the other. Between death and resurrection, it is like a short nap after which you wake up. O you, who are found of knowledge, send forward supplies for yourself before Allah, the Most Majestic, the Most Holy; you will be rewarded for your knowledge. You shall reap as you sow, O you who are found of knowledge.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/301)"
        ],
        "index": 1904,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:19",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ الْقَاسِمِ بْنِ يَحْيَى عَنْ جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَا لِي وَ لِلدُّنْيَا إِنَّمَا مَثَلِي وَ مَثَلُهَا كَمَثَلِ الرَّاكِبِ رُفِعَتْ لَهُ شَجَرَةٌ فِي يَوْمٍ صَائِفٍ فَقَالَ تَحْتَهَا ثُمَّ رَاحَ وَ تَرَكَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Al Qasim Bin Yahya, from his grandfather Al Hassan Bin Rashid, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘What is it to me<sup>saww</sup> and the world. But rather, the likes of me<sup>saww</sup> and it are like an example of the rider, a tree is raised for him during a day of scorching heat, so he goes underneath it (for shade), then rests, and leaves it’."
          ],
          "en.sarwar": [
            "19. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from al-Qasim ibn Yahya from his grand father al-Hassan ibn Rashid from abu ‘Abd Allah (a.s.) who has said the following: “The Messenger of Allah has said, ‘What do 1 have to do with the world. My case with the world is like a traveler who finds a tree in his day of journey and uses its shadow for a short rest and then continues for the rest of his journey, leaving the tree behind.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (302/ 8)"
        ],
        "index": 1905,
        "local_index": 20,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:20",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يَحْيَى بْنِ عُقْبَةَ الْأَزْدِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) مَثَلُ الْحَرِيصِ عَلَى الدُّنْيَا كَمَثَلِ دُودَةِ الْقَزِّ كُلَّمَا ازْدَادَتْ عَلَى نَفْسِهَا لَفّاً كَانَ أَبْعَدَ لَهَا مِنَ الْخُرُوجِ حَتَّى تَمُوتَ غَمّاً",
          "قَالَ وَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كَانَ فِيمَا وَعَظَ بِهِ لُقْمَانُ ابْنَهُ يَا بُنَيَّ إِنَّ النَّاسَ قَدْ جَمَعُوا قَبْلَكَ لِأَوْلَادِهِمْ فَلَمْ يَبْقَ مَا جَمَعُوا وَ لَمْ يَبْقَ مَنْ جَمَعُوا لَهُ وَ إِنَّمَا أَنْتَ عَبْدٌ مُسْتَأْجَرٌ قَدْ أُمِرْتَ بِعَمَلٍ وَ وُعِدْتَ عَلَيْهِ أَجْراً",
          "فَأَوْفِ عَمَلَكَ وَ اسْتَوْفِ أَجْرَكَ وَ لَا تَكُنْ فِي هَذِهِ الدُّنْيَا بِمَنْزِلَةِ شَاةٍ وَقَعَتْ فِي زَرْعٍ أَخْضَرَ فَأَكَلَتْ حَتَّى سَمِنَتْ فَكَانَ حَتْفُهَا عِنْدَ سِمَنِهَا وَ لَكِنِ اجْعَلِ الدُّنْيَا بِمَنْزِلَةِ قَنْطَرَةٍ عَلَى نَهَرٍ جُزْتَ عَلَيْهَا وَ تَرَكْتَهَا وَ لَمْ تَرْجِعْ إِلَيْهَا آخِرَ الدَّهْرِ أَخْرِبْهَا وَ لَا تَعْمُرْهَا فَإِنَّكَ لَمْ تُؤْمَرْ بِعِمَارَتِهَا",
          "وَ اعْلَمْ أَنَّكَ سَتُسْأَلُ غَداً إِذَا وَقَفْتَ بَيْنَ يَدَيِ اللَّهِ عَزَّ وَ جَلَّ عَنْ أَرْبَعٍ شَبَابِكَ فِيمَا أَبْلَيْتَهُ وَ عُمُرِكَ فِيمَا أَفْنَيْتَهُ وَ مَالِكَ مِمَّا اكْتَسَبْتَهُ وَ فِيمَا أَنْفَقْتَهُ فَتَأَهَّبْ لِذَلِكَ وَ أَعِدَّ لَهُ جَوَاباً وَ لَا تَأْسَ عَلَى مَا فَاتَكَ مِنَ الدُّنْيَا فَإِنَّ قَلِيلَ الدُّنْيَا لَا يَدُومُ بَقَاؤُهُ وَ كَثِيرَهَا لَا يُؤْمَنُ بَلَاؤُهُ ",
          "فَخُذْ حِذْرَكَ وَ جِدَّ فِي أَمْرِكَ وَ اكْشِفِ الْغِطَاءَ عَنْ وَجْهِكَ وَ تَعَرَّضْ لِمَعْرُوفِ رَبِّكَ وَ جَدِّدِ التَّوْبَةَ فِي قَلْبِكَ وَ اكْمُشْ فِي فَرَاغِكَ قَبْلَ أَنْ يُقْصَدَ قَصْدُكَ وَ يُقْضَى قَضَاؤُكَ وَ يُحَالَ بَيْنَكَ وَ بَيْنَ مَا تُرِيدُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yahya Bin Uqba Al Azdy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Abu Ja’far<sup>asws</sup> said: ‘And example of the one greedy upon the world is like an example of a silkworm. The more it increases (creating silk) around itself, the more remote it gets from the exiting (from it) until it dies in sorrow.",
            "He (the narrator) said, ‘And Abu Abdullah<sup>asws</sup> said: ‘Among what Luqman<sup>as</sup> advised his<sup>as</sup> son with, was, ‘O my<sup>as</sup> son! The people who were before you had amassed for their children, but whatever they amassed did not remain, nor did they remain, the ones it had been amassed for, and rather, you are a recompensed servant who has been instructed with a work and promised a recompense upon it. ",
            "So fulfil your work and you would be Fulfilled with your Recompense; and do not become in this world at the status of a sheep who falls into a green pasture, so it eats until it fattens, and it is slaughtered (after being) putting on weight. But, make the world to be at the status of a bridge upon a river, passing over it and leaving it, and do not return to it to the end of times. Ruin it and do not repair it, for you have not been ordered with the repairing of it. ",
            "And know that you would be Questioned tomorrow when you pause in front of Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic, about four (matters) – your youth, regarding what you wore it down; and your age, regarding what you spent it; and your wealth, from what (means) did you earn it and on what you spent it. Therefore be alert for that and prepare for it, and do not despair upon what is lost for you from the world, for the little of the world does not remain forever, and its more is not safe from its misfortune. ",
            "Therefore, take your share and struggle in your life, and uncover the covering from your face, and expose yourself to the goodness of your Lord<sup style=\"font-weight: normal\">azwj</sup>, and renew the repentance in your heart, and retract during your being free before your deliberation is deliberated upon and your Ordainment is Ordained (death), and there is a distancing between you and what you intended for’."
          ],
          "en.sarwar": [
            "20. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yahya ibn ‘Aqaba al-Azdi from abu ‘Abd Allah (a.s.) who has said the following: “Abu Ja’far (a.s.) has said, ‘The case of a person who is greedy in worldly matters is like the case of a silkworm. The more it wraps silk around itself the more difficult it becomes for it to get out until at last it dies therein in sorrow.’ The narrator has said that abu ‘Abd Allah (a.s.) then said, ‘Of the advice of Luqman to his son was this: ‘My son, people before you collected for their children but their collection never remained in place, nor were those for whom the collection was made. You are only a servant for hire. You are ordered to perform a deed and receive payment for it. Do your deed and receive payment. Do not be like the sheep who, finds a green farm and keeps eating until fatness kills it. Take the world as a bridge to cross a river and leave it when you are on the other side. Never return to it until the end of time. Destroy it and never repair it; you are not ordered to build it. “Bear in mind that tomorrow you will be questioned before Allah, the Most Majestic, the Most Holy, of four things. You will be asked about your youth, how you made it old, about your life span, how you finished it, and about your properties, how you earned them and how you spent them. Wake up for these questions and prepare the answers. Do not regret for what you have missed of worldly things. The little worldly things do not last very long and more of the worldly things are not without misfortune. Be cautious, work hard in your affairs, remove the curtain before you. Get involved in the lawful matters of your Lord, renew repentance in your heart, work hard when you are free and before you are targeted (by the angel of death) for dying and judgment is issued that separates you from your goal.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (307/ 8)"
        ],
        "index": 1906,
        "local_index": 21,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:21",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ بَعْضِ أَصْحَابِهِ عَنِ ابْنِ أَبِي يَعْفُورٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ فِيمَا نَاجَى اللَّهُ عَزَّ وَ جَلَّ بِهِ مُوسَى ( عليه السلام ) يَا مُوسَى لَا تَرْكَنْ إِلَى الدُّنْيَا رُكُونَ الظَّالِمِينَ وَ رُكُونَ مَنِ اتَّخَذَهَا أَباً وَ أُمّاً يَا مُوسَى لَوْ وَكَلْتُكَ إِلَى نَفْسِكَ لِتَنْظُرَ لَهَا إِذاً لَغَلَبَ عَلَيْكَ حُبُّ الدُّنْيَا وَ زَهْرَتُهَا ",
          "يَا مُوسَى نَافِسْ فِي الْخَيْرِ أَهْلَهُ وَ اسْتَبِقْهُمْ إِلَيْهِ فَإِنَّ الْخَيْرَ كَاسْمِهِ وَ اتْرُكْ مِنَ الدُّنْيَا مَا بِكَ الْغِنَى عَنْهُ وَ لَا تَنْظُرْ عَيْنُكَ إِلَى كُلِّ مَفْتُونٍ بِهَا وَ مُوكَلٍ إِلَى نَفْسِهِ وَ اعْلَمْ أَنَّ كُلَّ فِتْنَةٍ بَدْؤُهَا حُبُّ الدُّنْيَا وَ لَا تَغْبِطْ أَحَداً بِكَثْرَةِ الْمَالِ فَإِنَّ مَعَ كَثْرَةِ الْمَالِ تَكْثُرُ الذُّنُوبُ لِوَاجِبِ الْحُقُوقِ ",
          "وَ لَا تَغْبِطَنَّ أَحَداً بِرِضَى النَّاسِ عَنْهُ حَتَّى تَعْلَمَ أَنَّ اللَّهَ رَاضٍ عَنْهُ وَ لَا تَغْبِطَنَّ مَخْلُوقاً بِطَاعَةِ النَّاسِ لَهُ فَإِنَّ طَاعَةَ النَّاسِ لَهُ وَ اتِّبَاعَهُمْ إِيَّاهُ عَلَى غَيْرِ الْحَقِّ هَلَاكٌ لَهُ وَ لِمَنِ اتَّبَعَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Mahboub, from one of his companions, from Ibn Abu Yafour who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup>: ‘Among what Allah<sup>azwj</sup> Mighty and Majestic Whispered to Musa<sup>as</sup> with, was: “O Musa<sup>as</sup>! Do not incline towards the world like the inclining of the unjust ones, the ones who take it as a father and a mother. O Musa<sup>as</sup>! If I<sup>azwj</sup> were to Leave you<sup>as</sup> to yourself<sup>as</sup> for consideration of it, then the love for the world and its blossoms would overcome upon you<sup>as</sup>.",
            "O Musa<sup>as</sup>! Compete regarding the goodness with its people, and precede them to it, for the goodness is like its name and leave from the world what you<sup>as</sup> are self-sufficient from it, and your<sup>as</sup> eyes should not look towards every one intrigued by it and has allocated himself to it. And know, that every ‘<span class=\"iTxt\">Fitna</span>’ (strife) begins by the love for the world; and do not seek anyone with a lot of wealth, for along with the abundance of wealth are a lot of sins for the Obligatory rights. ",
            "And do not seek anyone by pleasing the people about him until you know that Allah<sup>azwj</sup> is Pleased from him, and do not seek people by obeying the people for him, for in obeying the people for him and seeking them for him upon other than the truth, there would be destruction for him and for the one who sought him”’."
          ],
          "en.sarwar": [
            "21. Ali ibn Ibrahim has narrated from his father from ibn Mahbub from certain individuals of his people from ibn abu Ya’fur who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘Of the things that Allah, the Most Majestic, the Most Holy, spoke to Moses was this: “O Moses, do not rely upon the world like the unjust ones or like those who take it as their parents. O Moses, were I to leave you in the care of your own soul, lover of worldly things and its attraction would overcome you. O Moses, race in good, the people of goodness and compete with them in goodness; goodness is like its name. Leave alone of worldly matters what is beyond the bare necessities. Do not allow your eyes to look to every attractive matter that is left to its own self (considered as worthless). Note that every misfortune emerges from the love for the world. No one of you should feel excited for great wealth; with bigger wealth sins in the obligatory rights may increase. No one must feel happy because of people’s happiness with him until he learns whether Allah is also happy with him or not. No creature must be excited about people obeying him; people’s obeying him and following him on something other than the right thing is destruction for him as well as his followers.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/309)"
        ],
        "index": 1907,
        "local_index": 22,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:22",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ غِيَاثِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ فِي كِتَابِ عَلِيٍّ ( صلوات الله عليه )  إِنَّمَا مَثَلُ الدُّنْيَا كَمَثَلِ الْحَيَّةِ مَا أَلْيَنَ مَسَّهَا وَ فِي جَوْفِهَا السَّمُّ النَّاقِعُ يَحْذَرُهَا الرَّجُلُ الْعَاقِلُ وَ يَهْوِي إِلَيْهَا الصَّبِيُّ الْجَاهِلُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira, from Giyas Bin Ibrahim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘In the Book of Ali<sup>asws</sup> (he<sup>asws</sup> said): ‘But rather an example of the world is like an example of the snake, which is smooth when touching it but from inside it is drenched in the venom. The intellectual man is cautious from it, and the ignorant children are attracted towards it’."
          ],
          "en.sarwar": [
            "22. Ali ibn Ibrahim has narrated from his father from ‘Abd Allah ibn al-Mughirah from Ghiyath ibn Ibrahim from abu ‘Abd Allah (a.s.) who has said the following: “It is in the book of Ali (a.s.) ‘The example of the world is like a snake which is of soft touch and has deadly poison inside. People of reason stay away from it and ignorant children wish to feel it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/310)"
        ],
        "index": 1908,
        "local_index": 23,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:23",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ أَبِي جَمِيلَةَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كَتَبَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِلَى بَعْضِ أَصْحَابِهِ يَعِظُهُ أُوصِيكَ وَ نَفْسِي بِتَقْوَى مَنْ لَا تَحِلُّ مَعْصِيَتُهُ وَ لَا يُرْجَى غَيْرُهُ وَ لَا الْغِنَى إِلَّا بِهِ فَإِنَّ مَنِ اتَّقَى اللَّهَ جَلَّ وَ عَزَّ وَ قَوِيَ وَ شَبِعَ وَ رَوِيَ وَ رُفِعَ عَقْلُهُ عَنْ أَهْلِ الدُّنْيَا",
          "فَبَدَنُهُ مَعَ أَهْلِ الدُّنْيَا وَ قَلْبُهُ وَ عَقْلُهُ مُعَايِنُ الْآخِرَةِ فَأَطْفَأَ بِضَوْءِ قَلْبِهِ مَا أَبْصَرَتْ عَيْنَاهُ مِنْ حُبِّ الدُّنْيَا فَقَذَّرَ حَرَامَهَا وَ جَانَبَ شُبُهَاتِهَا وَ أَضَرَّ وَ اللَّهِ بِالْحَلَالِ الصَّافِي إِلَّا مَا لَا بُدَّ لَهُ مِنْ كِسْرَةٍ مِنْهُ يَشُدُّ بِهَا صُلْبَهُ وَ ثَوْبٍ يُوَارِي بِهِ عَوْرَتَهُ مِنْ أَغْلَظِ مَا يَجِدُ وَ أَخْشَنِهِ",
          "وَ لَمْ يَكُنْ لَهُ فِيمَا لَا بُدَّ لَهُ مِنْهُ ثِقَةٌ وَ لَا رَجَاءٌ فَوَقَعَتْ ثِقَتُهُ وَ رَجَاؤُهُ عَلَى خَالِقِ الْأَشْيَاءِ فَجَدَّ وَ اجْتَهَدَ وَ أَتْعَبَ بَدَنَهُ حَتَّى بَدَتِ الْأَضْلَاعُ وَ غَارَتِ الْعَيْنَانِ فَأَبْدَلَ اللَّهُ لَهُ مِنْ ذَلِكَ قُوَّةً فِي بَدَنِهِ وَ شِدَّةً فِي عَقْلِهِ وَ مَا ذُخِرَ لَهُ فِي الْآخِرَةِ أَكْثَرُ",
          "فَارْفُضِ الدُّنْيَا فَإِنَّ حُبَّ الدُّنْيَا يُعْمِي وَ يُصِمُّ وَ يُبْكِمُ وَ يُذِلُّ الرِّقَابَ فَتَدَارَكْ مَا بَقِيَ مِنْ عُمُرِكَ وَ لَا تَقُلْ غَداً أَوْ بَعْدَ غَدٍ فَإِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكَ بِإِقَامَتِهِمْ عَلَى الْأَمَانِيِّ وَ التَّسْوِيفِ حَتَّى أَتَاهُمْ أَمْرُ اللَّهِ بَغْتَةً وَ هُمْ غَافِلُونَ",
          "فَنُقِلُوا عَلَى أَعْوَادِهِمْ إِلَى قُبُورِهِمُ الْمُظْلِمَةِ الضَّيِّقَةِ وَ قَدْ أَسْلَمَهُمُ الْأَوْلَادُ وَ الْأَهْلُونَ فَانْقَطِعْ إِلَى اللَّهِ بِقَلْبٍ مُنِيبٍ مِنْ رَفْضِ الدُّنْيَا وَ عَزْمٍ لَيْسَ فِيهِ انْكِسَارٌ وَ لَا انْخِزَالٌ أَعَانَنَا اللَّهُ وَ إِيَّاكَ عَلَى طَاعَتِهِ وَ وَفَّقَنَا اللَّهُ وَ إِيَّاكَ لِمَرْضَاتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Abu Jameela who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Amir Al-Mominen<sup>asws</sup> wrote to one of his<sup>asws</sup> companions advising him: ‘I<sup>asws</sup> hereby advise you, and myself<sup>asws</sup> with fearing the One<sup>azwj</sup> the disobedience to Whom is not Permissible. Neither can anyone else be hoped to nor can anyone be self-sufficient except by Him<sup>azwj</sup>, for the one who fears Allah<sup>azwj</sup> Majestic and Mighty would be strong, and satiated and quenched, and his intellect would be higher than the people of the world. ",
            "So his body would be with the people of the world but his heart and mind would be eyeing the Hereafter. Thus, he would extinguish by the illumination of his heart, whatever his eyes visualize from the love of the world. So he considers its Prohibitions as filthy and keeps aside from its doubtful matters, which would harm (him), by Allah<sup>azwj</sup>, with the clear Permissible, except what is inevitable for him from its crumbs, intensifying his backbone with it, and a (piece of) cloth to cover his nakedness with from the most coarse of what he can find and its roughest.",
            "And there does not happen to be for him, regarding what is inevitable for him from it, neither any reliability nor hope. So his reliance and his hopes are upon the Creator of the things, therefore he struggles, and strives, and exhausts his body until his ribs are manifested and his two eyes sink. So Allah<sup>azwj</sup> Exchanges for him, from that, strength in his body, and intensity in his intellect, and whatever He<sup>azwj</sup> has Treasured for him in the Hereafter is more. ",
            "Therefore, reject the world, for the love of the world would blind, and deaf and mute, and would disgrace the necks. So manage whatever is remaining from your life and do not say, ‘Tomorrow’, or ‘After tomorrow’, for rather, destroyed were the ones who were before you by their staying upon their aspirations and their procrastinations until the Command of Allah<sup>azwj</sup> came to them suddenly and they were oblivious. ",
            "So they were transferred upon the planks (of wood) into their graves, the dark, the narrow, and the children and the family members had submitted them. So he was cut-off to Allah<sup>azwj</sup> with a penitent heart from rejecting the world and a determination where was not breakage nor betrayal. May Allah<sup>azwj</sup> Assist us<sup>asws</sup> and you upon obeying Him<sup>azwj</sup>, and may Allah<sup>azwj</sup> Harmonise us<sup>asws</sup> and you to His<sup>azwj</sup> Pleasure’."
          ],
          "en.sarwar": [
            "23. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from abu Jamilah who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘Amir al-Mu’minin (Ali ibn abu Talib) (a.s.) wrote to one of his companions to advise him. “I recommend that you and I be pious before the One whose disobedience is not lawful. Besides Him, in no one else is placing any hope worthwhile. Sufficiency is not achieveable without Him. Whoever is pious before Allah, the Most Majestic, the Most Holy, is strong and satisfied with food and drink, his reason soars above the people of the world. His body is with the people of the world, but his heart and power of reason examine the next life. The light of his heart extinguishes what his eyes see of the love of the world. He considers unlawful things in it filthy and stays away from its doubtful things. He, I swear by Allah, suffers losses in even clean lawful matters except small pieces for the bare necessities that keep him standing to survive and clothes, to cover his privacy, of the roughest and thickest quality that he can find. He did not find anything in which to place his trust and hope in the needed circumstances, so he placed his trust and hope in the Creator of all things. He worked hard and struggled intensely, and suffered fatigue until his ribs appeared and his eyes sunk. Allah, then, in exchange for this, strengthened his body and intensified his power of reason. What He has stored for him in the next life is much greater. Reject the world. Love of the world makes one blind, deaf and dumb and it bends the necks in humiliation. Compensate for what is left of your life and do not leave your task for tomorrow or after tomorrow. Those who were before were destroyed because of their dependence on false hope and temptation, until the command of Allah came suddenly when they were neglectful. They were transferred on (pieces of) wood to their dark and narrow graves. Their children and family abandoned them there. He was then left to Allah with a submissive heart. Those who reject the world with firmness will face no defeat or betrayal. May Allah help us and you in obeying Him, and may Allah give us and you the opportunity to do what He likes.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف كالموثق أو كالحسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/314)"
        ],
        "index": 1909,
        "local_index": 24,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:24",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ وَ غَيْرِهِ عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَثَلُ الدُّنْيَا كَمَثَلِ مَاءِ الْبَحْرِ كُلَّمَا شَرِبَ مِنْهُ الْعَطْشَانُ ازْدَادَ عَطَشاً حَتَّى يَقْتُلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira, and someone else, from Talha Bin Zayd, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘An example of the world is like an example of the water of the ocean. Every time it is drunk from, the thirst increases until it kills him (who drinks it)’."
          ],
          "en.sarwar": [
            "24. Ali ibn Ibrahim has narrated from his father from ‘Abd Allah ibn Mughirah and others from Talha ibn Zayd from abu ‘Abd Allah (a.s.) who has said the following: “The case of the world is like the water of the ocean. The more a thirsty person drinks from it, the thirstier he becomes, consequently, it kills him.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور معتبر    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/314)"
        ],
        "index": 1910,
        "local_index": 25,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:61:25",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ قَالَ سَمِعْتُ الرِّضَا ( عليه السلام ) يَقُولُ قَالَ عِيسَى ابْنُ مَرْيَمَ ( صلوات الله عليه )  لِلْحَوَارِيِّينَ يَا بَنِي إِسْرَائِيلَ لَا تَأْسَوْا عَلَى مَا فَاتَكُمْ مِنَ الدُّنْيَا كَمَا لَا يَأْسَى أَهْلُ الدُّنْيَا عَلَى مَا فَاتَهُمْ مِنْ دِينِهِمْ إِذَا أَصَابُوا دُنْيَاهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washha who said, ",
            "‘I heard Al-Reza<sup>asws</sup> saying: ‘Isa<sup>as</sup> Bin Maryam<sup>as</sup> said to the disciples: ‘O Children of Israel! Do not despair upon what is lost by you from the world, just as the people of the world do not despair upon what is lost by them from their Religion as long as they secure their world’."
          ],
          "en.sarwar": [
            "25. Al-Husayn ibn Muhammad has narrated from Mu’alla ibn Muhammad from al- Washsha’ who has said the following: “I heard al-Rida (a.s.) say, ‘Jesus son of Mary (peace be upon him) said to his disciples, “O Israelites, do not regret for what you may miss of the world, just as the people of the world (who have no religion) do not regret for what they miss of religion when they find their worldly materials.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:61",
  "kind": "verse_list"
}