{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 63"
        },
        "path": "/books/al-kafi:2:1:63",
        "titles": {
          "ar": "بَابُ الْقَنَاعَةِ",
          "en": "Chapter 63 – The Contentment"
        }
      }
    ],
    "index": 251,
    "local_index": 63,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 64"
        },
        "path": "/books/al-kafi:2:1:64",
        "titles": {
          "ar": "بَابُ الْكَفَافِ",
          "en": "Chapter 64 – The Subsistence"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 62"
        },
        "path": "/books/al-kafi:2:1:62",
        "titles": {
          "ar": "بَابٌ",
          "en": "Chapter 62 – A Chapter"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:63",
    "titles": {
      "ar": "بَابُ الْقَنَاعَةِ",
      "en": "Chapter 63 – The Contentment"
    },
    "verse_count": 11,
    "verse_start_index": 1912,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (320/ 8)"
        ],
        "index": 1913,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:63:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَمَّارِ بْنِ مَرْوَانَ عَنْ زَيْدٍ الشَّحَّامِ عَنْ عَمْرِو بْنِ هِلَالٍ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) إِيَّاكَ أَنْ تُطْمِحَ بَصَرَكَ إِلَى مَنْ فَوْقَكَ فَكَفَى بِمَا قَالَ اللَّهُ عَزَّ وَ جَلَّ لِنَبِيِّهِ ( صلى الله عليه وآله ) فَلا تُعْجِبْكَ أَمْوالُهُمْ وَ لا أَوْلادُهُمْ وَ قَالَ وَ لا تَمُدَّنَّ عَيْنَيْكَ إِلى ما مَتَّعْنا بِهِ أَزْواجاً مِنْهُمْ زَهْرَةَ الْحَياةِ الدُّنْيا ",
          "فَإِنْ دَخَلَكَ مِنْ ذَلِكَ شَيْ‏ءٌ فَاذْكُرْ عَيْشَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَإِنَّمَا كَانَ قُوتُهُ الشَّعِيرَ وَ حَلْوَاهُ التَّمْرَ وَ وَقُودُهُ السَّعَفَ إِذَا وَجَدَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Sinan, from Ammar Bin Marwan, from Zay Bin Al Shahham, from Amro Bin Hilal who said, ",
            "Abu Ja’far<sup>asws</sup> said: ‘Beware of aspiring your vision towards the one who is above you, and suffice with what Allah<sup>azwj</sup> Mighty and Majestic Said to His<sup>azwj</sup> Prophet<sup>saww</sup> <span class=\"ibTxt\">[9:55] Let not then their property and their children astound you</span>. And He<sup>azwj</sup> Said <span class=\"ibTxt\">[20:131] And do not stretch your eyes after that with which We have Provided wedded pairs of them, blossoms of the life of the world</span>. ",
            "So if anything from that enters into you, then remember the life of Rasool-Allah<sup>saww</sup>, So rather, his<sup>asws</sup> provision was the barley and the sweetness of the dates, and his<sup>saww</sup> fuel was the firewood, when he<sup>saww</sup> found it’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from ‘Ammar ibn Marwan from Zayd al-Shahham from ‘Amr ibn Hilal who has said the following: “I heard abu Ja’far (a.s.) saying, ‘You must never allow your eyes aim for one who is above you (in worldly matters that may tempt you wish for his opportunity). The words of Allah, the Most Majestic, the Most Holy, to His Messenger are enough evidence to support it. “Let not their property and children tempt you. . . .” (9:55) ‘Do not yearn for other people’s property and wives and do not grieve. . . .’ (15:88) If you sense such a feeling then consider the life of the Messenger of Allah. He lived on barley loaves and sweetness from dates. For fuel he would use palm tree twigs if he could find them.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (323/ 8)"
        ],
        "index": 1914,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:63:2",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدِ بْنِ عَامِرٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ جَمِيعاً عَنِ الْوَشَّاءِ عَنْ أَحْمَدَ بْنِ عَائِذٍ عَنْ أَبِي خَدِيجَةَ سَالِمِ بْنِ مُكْرَمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ سَأَلَنَا أَعْطَيْنَاهُ وَ مَنِ اسْتَغْنَى أَغْنَاهُ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad Bin Aamir, from Moalla Bin Muhammad, and Ali Bin Muhammad, from Salih Bin Abu Hammad, altogether from Al Washha, from Ahmad Bin Aiz, from Abu Khadeeja Ali Bin Mukram, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The one who asked us<sup>saww</sup>, we<sup>asws</sup> gave it to him, and the one who managed without (asking), Allah<sup>azwj</sup> Enriched him’’."
          ],
          "en.sarwar": [
            "2. Al-Husayn ibn Muhammad ibn ‘Amir has narrated from Mu’alla ibn Muhammad from Salih ibn abu Hammad all from al-Washsha’ from Ahmad ibn ‘A’ id from abu Khadijah Salim ibn Mukram from abu ‘Abd Allah (a.s.) who has said the following: “The Messenger of Allah has said, ‘Whoever asks us for help, we help, and whoever shows himself as rich, even though not so in reality, Allah will make him rich.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/323)"
        ],
        "index": 1915,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:63:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنِ الْهَيْثَمِ بْنِ وَاقِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ رَضِيَ مِنَ اللَّهِ بِالْيَسِيرِ مِنَ الْمَعَاشِ رَضِيَ اللَّهُ مِنْهُ بِالْيَسِيرِ مِنَ الْعَمَلِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bi nIsa, from Al Hassan Bin Mahboub, from Al Haysam Bin Waqid, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who was satisfied from Allah<sup>azwj</sup> with the less from the livelihood, Allah<sup>azwj</sup> would be Pleased with him from the less, from the deeds’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Mahbub from al- Haytham ibn Waqid from abu ‘Abd Allah (a.s.) who has said the following: “Whoever is happy with the little sustenance (that Allah has given him), Allah becomes happy with his little good deeds.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (324/ 8)"
        ],
        "index": 1916,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:63:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ عَمْرِو بْنِ أَبِي الْمِقْدَامِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَكْتُوبٌ فِي التَّوْرَاةِ ابْنَ آدَمَ كُنْ كَيْفَ شِئْتَ كَمَا تَدِينُ تُدَانُ مَنْ رَضِيَ مِنَ اللَّهِ بِالْقَلِيلِ مِنَ الرِّزْقِ قَبِلَ اللَّهُ مِنْهُ الْيَسِيرَ مِنَ الْعَمَلِ وَ مَنْ رَضِيَ بِالْيَسِيرِ مِنَ الْحَلَالِ خَفَّتْ مَئُونَتُهُ وَ زَكَتْ مَكْسَبَتُهُ وَ خَرَجَ مِنْ حَدِّ الْفُجُورِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from his father, from Abdullah Bin Al Qasim, from Amro Bin Abu Al Miqdam, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It is written in the Torah: “O son of Adam<sup>as</sup>! Become howsoever you desire to. Just as you sow, so shall you reap”! The one who was pleased from Allah<sup>azwj</sup> with the little from the sustenance, Allah<sup>azwj</sup> would Accept the less deeds from him. The one who was pleased with the less from the Permissible (means), his expenditure would be light, and his earnings would be pure, and he would be outside from the boundary of the immoralities’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from his father from ‘Abd Allah ibn al-Qasim from ‘Amr ibn abu al-Miqdam from abu ‘Abd Allah (a.s.) who has said the following: “It is written in the Torah: ‘O sons of Adam, be as you like to be. You shall reap as you sow. Whoever becomes happy with Allah for a little amount of sustenance, Allah will accept his little good deeds. Whoever becomes happy with the little but lawful, his expenses become light, his earnings pure and he will be out of the limits (environments) of sins.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/324)"
        ],
        "index": 1917,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:63:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ عَرَفَةَ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ مَنْ لَمْ يُقْنِعْهُ مِنَ الرِّزْقِ إِلَّا الْكَثِيرُ لَمْ يَكْفِهِ مِنَ الْعَمَلِ إِلَّا الْكَثِيرُ وَ مَنْ كَفَاهُ مِنَ الرِّزْقِ الْقَلِيلُ فَإِنَّهُ يَكْفِيهِ مِنَ الْعَمَلِ الْقَلِيلُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Muhammad Bin Arafat, ",
            "(It has been narrated) from Abu Al Hassan Al-Reza<sup>asws</sup> having said: ‘The one who is not content from the sustenance except with a lot, would not be sufficed with from the deeds except a lot; and the one who suffices from the little sustenance, so he would be sufficed from the little deeds’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from Muhammad ‘Isa from Muhammad ibn ‘Arafah from abu al-Hassan al-Rida (a.s.) who has said the following: “Whoever is not satisfied with anything but a large quantity of sustenance, his deeds will not be enough unless they are a great deal. Whoever is comfortable with little amount of sustenance, even little good deeds will be sufficient for him.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/325)"
        ],
        "index": 1918,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:63:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه )  يَقُولُ ابْنَ آدَمَ إِنْ كُنْتَ تُرِيدُ مِنَ الدُّنْيَا مَا يَكْفِيكَ فَإِنَّ أَيْسَرَ مَا فِيهَا يَكْفِيكَ وَ إِنْ كُنْتَ إِنَّمَا تُرِيدُ مَا لَا يَكْفِيكَ فَإِنَّ كُلَّ مَا فِيهَا لَا يَكْفِيكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> was saying: ‘If you want from the world what would suffice you, so the least of what is in it would suffice you, and if you, rather, wanted what would not suffice you, so everything what is in it would not suffice you’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hisham ibn Salim from abu ‘Abd Allah (a.s.) who has said the following: “Amir al-Mu’minin (Ali ibn abu Talib) (a.s.) would say, ‘O sons of Adam, if you want from the world that much that is sufficient for you, the little that is there will suffice you. However, if you are not satisfied with basic necessities but want more than the basic needs, then the whole thing that is there will not be sufficient for you. ’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/325)"
        ],
        "index": 1919,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:63:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُحَمَّدٍ الْأَسَدِيِّ عَنْ سَالِمِ بْنِ مُكْرَمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ اشْتَدَّتْ حَالُ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ ( صلى الله عليه وآله ) فَقَالَتْ لَهُ امْرَأَتُهُ لَوْ أَتَيْتَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَسَأَلْتَهُ فَجَاءَ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) فَلَمَّا رَآهُ النَّبِيُّ ( صلى الله عليه وآله ) قَالَ مَنْ سَأَلَنَا أَعْطَيْنَاهُ وَ مَنِ اسْتَغْنَى أَغْنَاهُ اللَّهُ",
          "فَقَالَ الرَّجُلُ مَا يَعْنِي غَيْرِي فَرَجَعَ إِلَى امْرَأَتِهِ فَأَعْلَمَهَا فَقَالَتْ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) بَشَرٌ فَأَعْلِمْهُ فَأَتَاهُ فَلَمَّا رَآهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَالَ مَنْ سَأَلَنَا أَعْطَيْنَاهُ وَ مَنِ اسْتَغْنَى أَغْنَاهُ اللَّهُ حَتَّى فَعَلَ الرَّجُلُ ذَلِكَ ثَلَاثاً",
          "ثُمَّ ذَهَبَ الرَّجُلُ فَاسْتَعَارَ مِعْوَلًا ثُمَّ أَتَى الْجَبَلَ فَصَعِدَهُ فَقَطَعَ حَطَباً ثُمَّ جَاءَ بِهِ فَبَاعَهُ بِنِصْفِ مُدٍّ مِنْ دَقِيقٍ فَرَجَعَ بِهِ فَأَكَلَهُ ثُمَّ ذَهَبَ مِنَ الْغَدِ فَجَاءَ بِأَكْثَرَ مِنْ ذَلِكَ فَبَاعَهُ فَلَمْ يَزَلْ يَعْمَلُ وَ يَجْمَعُ حَتَّى اشْتَرَى مِعْوَلًا ثُمَّ جَمَعَ حَتَّى اشْتَرَى بَكْرَيْنِ وَ غُلَاماً ثُمَّ أَثْرَى حَتَّى أَيْسَرَ",
          "فَجَاءَ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) فَأَعْلَمَهُ كَيْفَ جَاءَ يَسْأَلُهُ وَ كَيْفَ سَمِعَ النَّبِيَّ ( صلى الله عليه وآله ) فَقَالَ النَّبِيُّ ( صلى الله عليه وآله ) قُلْتُ لَكَ مَنْ سَأَلَنَا أَعْطَيْنَاهُ وَ مَنِ اسْتَغْنَى أَغْنَاهُ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Abdul Rahman Bin Muhammad Al Asady, from Alim Bin Mukram, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The (financial) state of a man from the companions of the Prophet<sup>saww</sup> became difficult, so his wife said to him, ‘If only you would go to Rasool-Allah<sup>saww</sup> and ask him<sup>saww</sup>’. So he came over to the Prophet<sup>saww</sup>. So when the Prophet<sup>saww</sup> saw him, said: ‘The one who asks us<sup>saww</sup>, we<sup>saww</sup> give to him, but the one who manages without (asking), Allah<sup>azwj</sup> would Enrich him’. ",
            "So the man said, ‘He<sup>saww</sup> did not mean anyone apart from me’. So he returned to his wife and let her know. So she said ‘Rasool-Allah<sup>saww</sup> is a ‘Bashr’ (person), so let him<sup>saww</sup> know of it’. So he went over to him<sup>saww</sup>. So when Rasool-Allah<sup>saww</sup> saw him, he<sup>saww</sup> said: ‘The one who asks us<sup>saww</sup>, we<sup>saww</sup> give to him, and the one who manages without (asking), Allah<sup>azwj</sup> would Enrich him’, to the extent that the man did that three times.",
            "Then the man went away, and he borrowed a pick-axe, then went to the mountain and ascended it, and cut some firewood. Then he came with it and sold it for half a Mudd (750 gms.) of flour and he returned with it. So he ate it, then went (again) the next day and came with a lot of that, and he sold it. So he did not cease working and gathering (money) until he bought a pick-axe. Then he gathered (money) until he bought two young camels and a slave. Then he was enriched to the extent that he was affluent. ",
            "So he came over to the Prophet<sup style=\"font-weight: normal\">saww</sup> and let him<sup style=\"font-weight: normal\">saww</sup> know how he had come to ask him, and how the Prophet<sup style=\"font-weight: normal\">saww</sup> made him hear (the advice). So the Prophet<sup style=\"font-weight: normal\">saww</sup> said: ‘I<sup style=\"font-weight: normal\">saww</sup> told you, the one who asks us<sup style=\"font-weight: normal\">saww</sup>, we give it to him, but the one who manages (without asking), Allah<sup style=\"font-weight: normal\">azwj</sup> would Enrich him’’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from ‘Abd al-Rahman ibn Muhammad al-Asadi from Salim ibn Mukram from abu ‘Abd Allah (a.s.) who has said the following: “At one time, among the companions of the Messenger of Allah, the financial conditions of one man became very difficult and his wife suggested that he see the Messenger of Allah about it. He went to the Holy Prophet and, when the Holy Prophet saw him, he said, ‘Whoever asks us for help, we help, but whoever appears to be rich when, in fact, he is not so, Allah will make him rich. ’ The man thought the Holy Prophet had addressed him only. He returned to his wife and told her the story. She said, ‘The Messenger of Allah is only a man. Let him know what you need.’ He went back and, when the Messenger of Allah saw him, he said, ‘Whoever asks us for help we help but whoever appears to be rich when, in fact, he is not so, Allah will make him rich. ’ This was repeated with that man three times. Thereafter, he borrowed a pick and went to the mountains, climbed it and cut down a certain amount of firewood. He climbed down and sold the firewood for half a mud (a certain measure) of flour, came home and used it for food. The next day he did the same thing and saved a little on the side until he was able to buy a pick of his own and sometime later he bought two young camels and a slave and then he became rich until he became very affluent. One day he went to see the Holy Prophet. He informed him of his whole story. The Holy Prophet said, ‘I told you, whoever asks us for help we help, but whoever appears to be rich when, in fact, he is not so, Allah will make him rich.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (326/ 8)"
        ],
        "index": 1920,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:63:8",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْحُسَيْنِ بْنِ الْفُرَاتِ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ أَرَادَ أَنْ يَكُونَ أَغْنَى النَّاسِ فَلْيَكُنْ بِمَا فِي يَدِ اللَّهِ أَوْثَقَ مِنْهُ بِمَا فِي يَدِ غَيْرِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ali Bin Al Hakam Bin Al Husayn Bin Al Furat, from Amro Bin Shimr, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The one who wants to be needless of the people, so let him rely upon what is in the Hands of Allah<sup>azwj</sup> rather than what is in the hands of the people’."
          ],
          "en.sarwar": [
            "8. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Ali ibn al-Hakam from al-Husayn ibn al-Farat from ‘Amr ibn Shamir from Jabir from abu Ja’far (a.s.) who has said the following: “The Messenger of Allah has said, ‘Whoever wants to be the richest among the people, what is with Allah should be more reliable to him than what is in the hands of others.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/326)"
        ],
        "index": 1921,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:63:9",
        "text": [
          "عَنْهُ عَنِ ابْنِ فَضَّالٍ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ أَوْ أَبِي عَبْدِ اللَّهِ ( عليهما السلام ) قَالَ مَنْ قَنِعَ بِمَا رَزَقَهُ اللَّهُ فَهُوَ مِنْ أَغْنَى النَّاسِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ibn Fazzal, from Aasim Bin Humeyd, from Abu Hamza, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, or Abu Abdullah<sup>asws</sup> having said: ‘The one who is content with what Allah<sup>azwj</sup> has Graced him, so he is from the richest of the people’."
          ],
          "en.sarwar": [
            "9. It is narrated from him (narrator of the Hadith above) from ibn Faddal from ‘Asim ibn Humayd from abu Hamza from abu Ja’far or abu ‘Abd Allah (a.s.) who has said the following: “Whoever is content with what Allah has given him for his sustenance is the richest person of the people.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/327)"
        ],
        "index": 1922,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:63:10",
        "text": [
          "عَنْهُ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ حَمْزَةَ بْنِ حُمْرَانَ قَالَ شَكَا رَجُلٌ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ يَطْلُبُ فَيُصِيبُ وَ لَا يَقْنَعُ وَ تُنَازِعُهُ نَفْسُهُ إِلَى مَا هُوَ أَكْثَرُ مِنْهُ وَ قَالَ عَلِّمْنِي شَيْئاً أَنْتَفِعْ بِهِ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنْ كَانَ مَا يَكْفِيكَ يُغْنِيكَ فَأَدْنَى مَا فِيهَا يُغْنِيكَ وَ إِنْ كَانَ مَا يَكْفِيكَ لَا يُغْنِيكَ فَكُلُّ مَا فِيهَا لَا يُغْنِيكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "From, from Ibn Fazzal, from Ibn Bakeyr, from Hamza Bin Humran who said, ",
            "‘A man complained to Abu Abdullah<sup>asws</sup> that he seeks, so he attains but is not content and his heart contends with him to what is more than it, and he said, ‘Teach me something I can be content with it’. So Abu Abdullah<sup>asws</sup> said: ‘If it was what suffices you, it would enrich you what is the least of what is in it, and if it was what does not suffice you, it would not enrich you, so (even) whatever is in it (the world) would not suffice you’."
          ],
          "en.sarwar": [
            "10. It is narrated from him (narrator of the Hadith above) from ibn Faddal from ibn Bukayr from Hamza ibn Humran who has said the following: “A man complained before abu ‘Abd Allah (a.s.) that he works and earns but is not content and his soul’s desires compel him to find more. The man asked the Imam to teach him something to benefit him. Abu ‘Abd Allah (a.s.) said, ‘If it (earnings) is enough for your necessities then it should make you rich. Thus, the minimum should suffice you. If this does not suffice then all things that are there will not suffice you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/327)"
        ],
        "index": 1923,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:63:11",
        "text": [
          "عَنْهُ عَنْ عِدَّةٍ مِنْ أَصْحَابِنَا عَنْ حَنَانِ بْنِ سَدِيرٍ رَفَعَهُ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) مَنْ رَضِيَ مِنَ الدُّنْيَا بِمَا يُجْزِيهِ كَانَ أَيْسَرُ مَا فِيهَا يَكْفِيهِ وَ مَنْ لَمْ يَرْضَ مِنَ الدُّنْيَا بِمَا يُجْزِيهِ لَمْ يَكُنْ فِيهَا شَيْ‏ءٌ يَكْفِيهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from a number of our companions, from Hanan Bin Sadeyr, raising it, said, ",
            "‘Amir Al-Momineen<sup>asws</sup> said: ‘The one who is pleased from the world with whatever his apportionment is, the least of what is in it would suffice him; and the one who is not pleased from the world with what his apportionment is, there is nothing in it which would suffice him’."
          ],
          "en.sarwar": [
            "11. It is narrated from him (narrator of the Hadith above) from a number of our people have narrated from Hannan ibn Sadir in a marfu’ manner from Amir al- Mu’minin (Ali ibn abu Talib) (a.s.) who has said the following: “Whoever is content, with worldly matters, with bare necessities, the minimum suffices him. Whoever is not content. with worldly matters, with bare necessities, then nothing will be able to suffice him.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:63",
  "kind": "verse_list"
}