{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:2:1", "titles": {"ar": "كتاب الإيمان و الكفر", "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"}}, {"indexed_titles": {"en": "Chapter 7"}, "path": "/books/al-kafi:2:1:7", "titles": {"ar": "بَابُ كَوْنِ الْمُؤْمِنِ فِي صُلْبِ الْكَافِرِ", "en": "Chapter 7 – Coming into being of the Believer into the back of the disbeliever"}}], "index": 195, "local_index": 7, "part_type": "Chapter", "path": "/books/al-kafi:2:1:7", "titles": {"ar": "بَابُ كَوْنِ الْمُؤْمِنِ فِي صُلْبِ الْكَافِرِ", "en": "Chapter 7 – Coming into being of the Believer into the back of the disbeliever"}, "verse_count": 2, "verse_start_index": 1463, "verses": [{"index": 1464, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:1:7:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ عَلِيِّ بْنِ مَيْسَرَةَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ نُطْفَةَ الْمُؤْمِنِ لَتَكُونُ فِي صُلْبِ الْمُشْرِكِ فَلَا يُصِيبُهُ مِنَ الشَّرِّ شَيْ‏ءٌ حَتَّى إِذَا صَارَ فِي رَحِمِ الْمُشْرِكَةِ لَمْ يُصِبْهَا مِنَ الشَّرِّ شَيْ‏ءٌ حَتَّى تَضَعَهُ فَإِذَا وَضَعَتْهُ لَمْ يُصِبْهُ مِنَ الشَّرِّ شَيْ‏ءٌ حَتَّى يَجْرِيَ عَلَيْهِ الْقَلَمُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan in Ali Al Washa, from Ali Bin Maysara who said, \n‘Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> said: ‘The seed of the Believer may exit in the back of the Polytheist man, so it would not be hit by anything from the evil until it comes to be in a womb of the Polytheist woman, and it would not be hit by anything from the evil until she give his birth. So when she does give him birth, nothing from the evil would hit him until the Pen flows against him’ (until he reaches adulthood and becomes responsible for his acts)."}]}, {"index": 1465, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:1:7:2", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَلِيِّ بْنِ يَقْطِينٍ عَنْ أَبِي الْحَسَنِ مُوسَى ( عليه السلام ) قَالَ قُلْتُ لَهُ إِنِّي قَدْ أَشْفَقْتُ مِنْ دَعْوَةِ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) عَلَى يَقْطِينٍ وَ مَا وَلَدَ فَقَالَ يَا أَبَا الْحَسَنِ لَيْسَ حَيْثُ تَذْهَبُ إِنَّمَا الْمُؤْمِنُ فِي صُلْبِ الْكَافِرِ بِمَنْزِلَةِ الْحَصَاةِ فِي اللَّبِنَةِ يَجِي‏ءُ الْمَطَرُ فَيَغْسِلُ اللَّبِنَةَ وَ لَا يَضُرُّ الْحَصَاةَ شَيْئاً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ali Bin Yaqteen, \n(It has been narrated) from Abu Al-Hassan Musa<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘I pitied from a supplication of Abu Abdullah<sup>asws</sup> against Yaqteen and what he begot’. So he<sup>asws</sup> said: ‘O Abu Al-Hassan! It is not where you are going with it. But rather, the Believer in the back of the disbeliever is at a status of the pebbles among the block. The rain comes and it washes the block, and it does not harm the pebbles anything’."}]}]}, "index": "al-kafi:2:1:7", "kind": "verse_list"}