{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 75"
        },
        "path": "/books/al-kafi:2:1:75",
        "titles": {
          "ar": "بَابُ حَقِّ الْمُؤْمِنِ عَلَى أَخِيهِ وَ أَدَاءِ حَقِّهِ",
          "en": "Chapter 75 – The rights of the Momin upon his brother and the fulfilling of his rights"
        }
      }
    ],
    "index": 263,
    "local_index": 75,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 76"
        },
        "path": "/books/al-kafi:2:1:76",
        "titles": {
          "ar": "بَابُ التَّرَاحُمِ وَ التَّعَاطُفِ",
          "en": "Chapter 76 – The Compassion and the Sympathy"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 74"
        },
        "path": "/books/al-kafi:2:1:74",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابٌ فِي أَنَّ التَّوَاخِيَ</span> لَمْ يَقَعْ عَلَى الدِّينِ وَ إِنَّمَا هُوَ التَّعَارُفُ",
          "en": "Chapter 74 – Regarding, that the brotherhood does not yet occur upon the Religion, and rather it is the recognition (of Al Wilayah)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:75",
    "titles": {
      "ar": "بَابُ حَقِّ الْمُؤْمِنِ عَلَى أَخِيهِ وَ أَدَاءِ حَقِّهِ",
      "en": "Chapter 75 – The rights of the Momin upon his brother and the fulfilling of his rights"
    },
    "verse_count": 16,
    "verse_start_index": 2048,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/27)"
        ],
        "index": 2049,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:75:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ مِنْ حَقِّ الْمُؤْمِنِ عَلَى أَخِيهِ الْمُؤْمِنِ أَنْ يُشْبِعَ جَوْعَتَهُ وَ يُوَارِيَ عَوْرَتَهُ وَ يُفَرِّجَ عَنْهُ كُرْبَتَهُ وَ يَقْضِيَ دَيْنَهُ فَإِذَا مَاتَ خَلَفَهُ فِي أَهْلِهِ وَ وُلْدِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Sayf Bin Ameyra, from Amro Bin Shimr, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘From the rights of a <span class=\"iTxt\">Momin</span> upon his brother <span class=\"iTxt\">Momin</span> is that he satiates his hunger, and cover his nakedness, and relieves him from his distress, and pays-off his debts. So when he dies, takes care of his wife and children’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from Sayf ibn ‘ Amirah from ‘ Amr ibn Shamir from Jabir from abu Ja’far (a.s.) who has said the following: “Of the rights of the believer on his believing brother (in belief) is to satisfy his hunger, provide covering for his privacy, facilitate his hardships and pay off his debts. When he dies, look after his family and children.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/28)"
        ],
        "index": 2050,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:75:2",
        "text": [
          "عَنْهُ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ الْهَجَرِيِّ عَنْ مُعَلَّى بْنِ خُنَيْسٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ مَا حَقُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ قَالَ لَهُ سَبْعُ حُقُوقٍ وَاجِبَاتٍ مَا مِنْهُنَّ حَقٌّ إِلَّا وَ هُوَ عَلَيْهِ وَاجِبٌ إِنْ ضَيَّعَ مِنْهَا شَيْئاً خَرَجَ مِنْ وِلَايَةِ اللَّهِ وَ طَاعَتِهِ وَ لَمْ يَكُنْ لِلَّهِ فِيهِ مِنْ نَصِيبٍ ",
          "قُلْتُ لَهُ جُعِلْتُ فِدَاكَ وَ مَا هِيَ قَالَ يَا مُعَلَّى إِنِّي عَلَيْكَ شَفِيقٌ أَخَافُ أَنْ تُضَيِّعَ وَ لَا تَحْفَظَ وَ تَعْلَمَ وَ لَا تَعْمَلَ قَالَ قُلْتُ لَهُ لَا قُوَّةَ إِلَّا بِاللَّهِ ",
          "قَالَ أَيْسَرُ حَقٍّ مِنْهَا أَنْ تُحِبَّ لَهُ مَا تُحِبُّ لِنَفْسِكَ وَ تَكْرَهَ لَهُ مَا تَكْرَهُ لِنَفْسِكَ وَ الْحَقُّ الثَّانِي أَنْ تَجْتَنِبَ سَخَطَهُ وَ تَتَّبِعَ مَرْضَاتَهُ وَ تُطِيعَ أَمْرَهُ وَ الْحَقُّ الثَّالِثُ أَنْ تُعِينَهُ بِنَفْسِكَ وَ مَالِكَ وَ لِسَانِكَ وَ يَدِكَ وَ رِجْلِكَ ",
          "وَ الْحَقُّ الرَّابِعُ أَنْ تَكُونَ عَيْنَهُ وَ دَلِيلَهُ وَ مِرْآتَهُ وَ الْحَقُّ الْخَامِسُ أَنْ لَا تَشْبَعَ وَ يَجُوعُ وَ لَا تَرْوَى وَ يَظْمَأُ وَ لَا تَلْبَسَ وَ يَعْرَى وَ الْحَقُّ السَّادِسُ أَنْ يَكُونَ لَكَ خَادِمٌ وَ لَيْسَ لِأَخِيكَ خَادِمٌ فَوَاجِبٌ أَنْ تَبْعَثَ خَادِمَكَ فَيَغْسِلَ ثِيَابَهُ وَ يَصْنَعَ طَعَامَهُ وَ يُمَهِّدَ فِرَاشَهُ ",
          "وَ الْحَقُّ السَّابِعُ أَنْ تُبِرَّ قَسَمَهُ وَ تُجِيبَ دَعْوَتَهُ وَ تَعُودَ مَرِيضَهُ وَ تَشْهَدَ جَنَازَتَهُ وَ إِذَا عَلِمْتَ أَنَّ لَهُ حَاجَةً تُبَادِرُهُ إِلَى قَضَائِهَا وَ لَا تُلْجِئُهُ أَنْ يَسْأَلَكَهَا وَ لَكِنْ تُبَادِرُهُ مُبَادَرَةً فَإِذَا فَعَلْتَ ذَلِكَ وَصَلْتَ وَلَايَتَكَ بِوَلَايَتِهِ وَ وَلَايَتَهُ بِوَلَايَتِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ali Bin Al Hakam, from Abdullah Bin Bukeyr Al Hajary, from Moalla Bin Khunays, ",
            "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup>, said, ‘I said to him<sup style=\"font-weight: normal\">asws</sup>, ‘What is the right of the Muslim upon the Muslim?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘For him there are seven Obligatory rights. There is no right from these except and it is Obligatory upon him. If he were to waste anything from these, he would exit from the <span class=\"iTxt\">Wilayah</span> of Allah<sup style=\"font-weight: normal\">azwj</sup> and His<sup style=\"font-weight: normal\">azwj</sup> obedience, and there would not happen to be for Allah<sup style=\"font-weight: normal\">azwj</sup> with regards to it, a share’.",
            "I said to him<sup style=\"font-weight: normal\">asws</sup>, ‘May I be sacrificed for you<sup style=\"font-weight: normal\">asws</sup>! And what is it?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘O Moalla! I<sup style=\"font-weight: normal\">asws</sup> am affectionate upon you. I<sup style=\"font-weight: normal\">asws</sup> fear that you would waste (this) and not preserve, and you would learn but not act (upon it)’. I said to him<sup style=\"font-weight: normal\">asws</sup>, ‘There is no Strength except with Allah<sup style=\"font-weight: normal\">azwj</sup>’. ",
            "He<sup style=\"font-weight: normal\">asws</sup> said: ‘The easiest from it is that you love for him what you love for yourself, and dislike for him what you dislike for yourself. And the second right is that you keep aside from his anger, and follow his pleasure, and obey his instructions. And the third right is that you support him with your ‘self’, and your wealth, and your tongue, and your hands, and your legs. ",
            "And the fourth right is that you become his eye, and his guide, and his mirror. And the fifth right is that you are not satiated while he is hungry, nor you being quenched while he is thirsty, nor you wearing clothes while he is naked. And the sixth right is that if there happens to be a servant for you and there is no servant for your brother, so it is Obligatory that you send your servant, so he would wash his clothes, and make his food, and prepare his bed. ",
            "And the seventh right is that you make good his apportionment, and answer his invitation, and console his sick ones, and attend his funeral, and when you come to know that there is a need for him, you hasten towards fulfilling it, and not wait for him to ask for it, but hasten with a hastening. So when you do that, your <span class=\"iTxt\">Wilayah</span> would be linked with his <span class=\"iTxt\">Wilayah</span>, and his <span class=\"iTxt\">Wilayah</span> with your <span class=\"iTxt\">Wilayah</span>’."
          ],
          "en.sarwar": [
            "2. It is narrated from him (narrator of the Hadith above) from Ali ibn al-Hakam from ‘Abd Allah ibn Bukayr al-Hajari from Mu’alla ibn Khanis from abu ‘Abd Allah (a.s.) who has said the following: “Once I asked the Imam, ‘What are the rights of the Muslim on the Muslim?’ The Imam said, ‘He has seven categories of rights that are obligatory, each of which is compulsory. If he jeopardizes a single one of them he is out of the domain of guardianship ( Walayah ) of Allah and obedience to Him. There will be no share for Allah in him.’ 1 then said, ‘May Allah keep my soul in service for your cause, what are these rights?’ The Imam said, ‘O Mu’alla, I am afraid you may jeopardize them and may not protect them. You learn them but do not act up on them.’ I (the narrator) then said, ‘There is no power without the power of Allah.’ The Imam said, ‘Of those rights the easiest to fulfill is to love for him what you love for yourself and dislike for him what you dislike for yourself. The second right is to avoid (stirring) his anger, follow his wishes and obey his commands. The third right is to support him with your soul, property, tongue, hands and legs. The fourth right is to be his eyes, his guide and his mirror. The fifth right is that you must not be satisfied with food while he is hungry, with drinks while he is thirsty, and that you dress up in finery while he does not have any clothes. The sixth right is not to allow yourself to have a servant while your brother in belief does not have any servant. It then is necessary to send your servant to wash his clothes, prepare food and his bed for him. The seventh right is to keep his share handsomely, accept his invitations, visit him when he is ill, attend his funeral and if he needs something, initiate to fulfill it and do not delay until he asks you for help. You must hurry quickly and when you do so you have connected your guardianship with his guardianship and vice versa.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (32/ 9)"
        ],
        "index": 2051,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:75:3",
        "text": [
          "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ سَيْفٍ عَنْ أَبِيهِ سَيْفٍ عَنْ عَبْدِ الْأَعْلَى بْنِ أَعْيَنَ قَالَ كَتَبَ بَعْضُ أَصْحَابِنَا يَسْأَلُونَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ أَشْيَاءَ وَ أَمَرُونِي أَنْ أَسْأَلَهُ عَنْ حَقِّ الْمُسْلِمِ عَلَى أَخِيهِ فَسَأَلْتُهُ فَلَمْ يُجِبْنِي فَلَمَّا جِئْتُ لِأُوَدِّعَهُ فَقُلْتُ سَأَلْتُكَ فَلَمْ تُجِبْنِي ",
          "فَقَالَ إِنِّي أَخَافُ أَنْ تَكْفُرُوا إِنَّ مِنْ أَشَدِّ مَا افْتَرَضَ اللَّهُ عَلَى خَلْقِهِ ثَلَاثاً إِنْصَافَ الْمَرْءِ مِنْ نَفْسِهِ حَتَّى لَا يَرْضَى لِأَخِيهِ مِنْ نَفْسِهِ إِلَّا بِمَا يَرْضَى لِنَفْسِهِ مِنْهُ وَ مُوَاسَاةَ الْأَخِ فِي الْمَالِ وَ ذِكْرَ اللَّهِ عَلَى كُلِّ حَالٍ لَيْسَ سُبْحَانَ اللَّهِ وَ الْحَمْدُ لِلَّهِ وَ لَكِنْ عِنْدَ مَا حَرَّمَ اللَّهُ عَلَيْهِ فَيَدَعُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Sayf, from his father Sayf, from his father Sayf, from Abdul A’ala Bin Ayn who said, ",
            "‘Some of our companions wrote asking Abu Abdullah<sup>asws</sup> about certain things, and instructed me that I ask him<sup>asws</sup> about the right of the Muslim upon his brother. So I asked him<sup>asws</sup>, but he<sup>asws</sup> did not answer me. So when I went over to bid farewell to him<sup>asws</sup>, so I said, ‘I did ask you<sup>asws</sup>, but you<sup>asws</sup> did not answer me’. ",
            "So he<sup>asws</sup> said: ‘I<sup>asws</sup> feared that you would be disbelieving. From the most difficult of what Allah<sup>azwj</sup> has Imposed upon His<sup>azwj</sup> creatures are three – The fairness of the man from himself until he is not pleased for his brother from himself except with what he is pleased for his own self from him, and equalisation of the brother in the wealth, and remembering Allah<sup>azwj</sup> upon every state, not being (the saying of) ‘Glory be to Allah<sup>azwj</sup>, and the Praise is due to Allah<sup>azwj</sup>’, but during what Allah<sup>azwj</sup> has Prohibited upon him, he leaves it’."
          ],
          "en.sarwar": [
            "3. It is narrated from him (narrator of the Hadith above) from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn Sayf from his father, Sayf from ‘Abd al-‘Ala’ ibn ‘A’Yun who has said the following: “Once certain individual of our people wrote to abu ‘Abd Allah (a.s.) asking him about certain issues and they ordered me to ask the Imam about the rights of the Muslim on his Muslim brother and I asked the Imam but he did not answer me. When I went to say farewell to him I said, ‘I asked you that question but you did not answer me.’ The Imam said, ‘I am afraid you may disregard them. Of the obligations most pressing that Allah has made obligatory upon His creature are three things: a man’s yielding to justice against his own soul so as not to accept for his brother (in belief) what he does not accept for his own self, to assist his brother with his property and speak of Allah in all conditions. I do not mean thereby, saying, ‘Glory belongs to Allah and all praise belongs to Allah. Truly speaking of and remembering Allah is to stay away from whatever He has prohibited.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/33)"
        ],
        "index": 2052,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:75:4",
        "text": [
          "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ جَمِيلٍ عَنْ مُرَازِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا عُبِدَ اللَّهُ بِشَيْ‏ءٍ أَفْضَلَ مِنْ أَدَاءِ حَقِّ الْمُؤْمِنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Jameel, from Murazim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> has not been worshipped with anything more superior than the fulfilling of the rights of the <span class=\"iTxt\">Momin</span>’."
          ],
          "en.sarwar": [
            "4. It is narrated from him (narrator of the Hadith above) from Ahmad ibn Muhammad from al-Hassan ibn Mahbub from Jamil from Marazim from abu ‘Abd Allah (a.s.) who has said the following: “Allah the best way to worship is to fulfil (protect) the rights of the believer.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/33)"
        ],
        "index": 2053,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:75:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ الْيَمَانِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ حَقُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ أَنْ لَا يَشْبَعَ وَ يَجُوعُ أَخُوهُ وَ لَا يَرْوَى وَ يَعْطَشُ أَخُوهُ وَ لَا يَكْتَسِيَ وَ يَعْرَى أَخُوهُ فَمَا أَعْظَمَ حَقَّ الْمُسْلِمِ عَلَى أَخِيهِ الْمُسْلِمِ ",
          "وَ قَالَ أَحِبَّ لِأَخِيكَ الْمُسْلِمِ مَا تُحِبُّ لِنَفْسِكَ وَ إِذَا احْتَجْتَ فَسَلْهُ وَ إِنْ سَأَلَكَ فَأَعْطِهِ لَا تَمَلَّهُ خَيْراً وَ لَا يَمَلَّهُ لَكَ كُنْ لَهُ ظَهْراً فَإِنَّهُ لَكَ ظَهْرٌ إِذَا غَابَ فَاحْفَظْهُ فِي غَيْبَتِهِ وَ إِذَا شَهِدَ فَزُرْهُ وَ أَجِلَّهُ وَ أَكْرِمْهُ فَإِنَّهُ مِنْكَ وَ أَنْتَ مِنْهُ",
          "فَإِنْ كَانَ عَلَيْكَ عَاتِباً فَلَا تُفَارِقْهُ حَتَّى تَسْأَلَ سَمِيحَتَهُ وَ إِنْ أَصَابَهُ خَيْرٌ فَاحْمَدِ اللَّهَ وَ إِنِ ابْتُلِيَ فَاعْضُدْهُ وَ إِنْ تُمُحِّلَ لَهُ فَأَعِنْهُ وَ إِذَا قَالَ الرَّجُلُ لِأَخِيهِ أُفٍّ انْقَطَعَ مَا بَيْنَهُمَا مِنَ الْوَلَايَةِ وَ إِذَا قَالَ أَنْتَ عَدُوِّي كَفَرَ أَحَدُهُمَا فَإِذَا اتَّهَمَهُ انْمَاثَ الْإِيمَانُ فِي قَلْبِهِ كَمَا يَنْمَاثُ الْمِلْحُ فِي الْمَاءِ",
          "وَ قَالَ بَلَغَنِي أَنَّهُ قَالَ إِنَّ الْمُؤْمِنَ لَيَزْهَرُ نُورُهُ لِأَهْلِ السَّمَاءِ كَمَا تَزْهَرُ نُجُومُ السَّمَاءِ لِأَهْلِ الْأَرْضِ وَ قَالَ إِنَّ الْمُؤْمِنَ وَلِيُّ اللَّهِ يُعِينُهُ وَ يَصْنَعُ لَهُ وَ لَا يَقُولُ عَلَيْهِ إِلَّا الْحَقَّ وَ لَا يَخَافُ غَيْرَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibahim, from his father, from Hammad Bin Isa, from Ibrahim Bin Umar Al Yamani, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The right of a Muslim upon a Muslim is that he should not be satiated while his brother is hungry, nor be quenched while his brother is thirsty, nor being clothed while his brother is naked. So how great is the right of a Muslim upon the Muslim’.",
            "And he<sup>asws</sup> said: ‘Love for your Muslim brother what you love for yourself, and when you are needy so ask him, and if he asks you so give him. Neither should you get bored with him nor should he get bored with you. Become a backbone for him, so he would be a backbone for you. When he is absent, so protect him during his absence, and when he is present, so visit him, and exalt him, and honour him, for he is from you and you are from him. ",
            "So if there was an argument between you, so do not separate from him until you ask his forgiveness, and if he attains something good, so Praise Allah<sup>azwj</sup>, and if he is afflicted, so uphold him, and if there is a plot for him, so support him. And when a man says to his brother, ‘Ugh!’ whatever is between the two of them from the <span class=\"iTxt\">Wilayah</span> would be cut off; and when he says, ‘You are my enemy’, one of them would have blasphemed. So when he slanders him, his <span class=\"iTxt\">Emān</span> would dissolve in his heart just as the salt dissolves in the water’.",
            "And he (the narrator) said, ‘It reached me that he<sup style=\"font-weight: normal\">asws</sup> said: ‘A <span class=\"iTxt\">Momin</span>, his light shines to the people of the sky just as the stars shine for the people of the earth’. And he<sup style=\"font-weight: normal\">asws</sup> said: ‘A <span class=\"iTxt\">Momin</span> is a friend of Allah<sup style=\"font-weight: normal\">azwj</sup>. He<sup style=\"font-weight: normal\">azwj</sup> Assists him, and he works for Him<sup style=\"font-weight: normal\">azwj</sup> and he does not say anything upon it except for the truth, nor does he fear anyone apart from Him<sup style=\"font-weight: normal\">azwj</sup>’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Ibrahim ibn ‘Umar al-Yamani from abu ‘Abd Allah (a.s.) who has said the following: “Of the rights of the Muslim on the Muslim is that he must not satisfy himself with food while his Muslim brother is hungry. One must not satisfy himself with water while one’s Muslim brother is thirsty, and one must not dress up in finery while his Muslim brother is in need of clothes. How great is the right of the Muslim on his Muslim brother! The Imam then said, ‘Love for your Muslim brother what you love for yourself. Ask him when you need him and when he needs you, you must help him and do not frustrate him, but be his supporter; he is your supporter. When he is absent protect his interests in his absence and when he is present visit, honor and respect him; you are from him and he is from you. If he is disappointed with you do not keep away from him before asking him to forgive you and if he gains something, thank Allah for it. If he suffers from something then support him. If he is subjected to a plot, assist him. If a man says to his brother, fie up on you, the relation of guardianship between them remains no longer. If he says, ‘You are my enemy, one of them will become an unbeliever. If he accuses him, belief in his heart melts like salt melts in water.’ The narrator has said that it is reported to me that the Imam said, ‘The light of the believer shines to the inhabitants of the heavens like the stars shine to the inhabitants of earth.’ And he said, ‘The believer is the friend of Allah Who helps him and grants him favors. He does not say about Him but the truth and he is not afraid of any one other than Him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق بسندي ه  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (37/ 9)"
        ],
        "index": 2054,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:75:6",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لِلْمُسْلِمِ عَلَى أَخِيهِ الْمُسْلِمِ مِنَ الْحَقِّ أَنْ يُسَلِّمَ عَلَيْهِ إِذَا لَقِيَهُ وَ يَعُودَهُ إِذَا مَرِضَ وَ يَنْصَحَ لَهُ إِذَا غَابَ وَ يُسَمِّتَهُ إِذَا عَطَسَ وَ يُجِيبَهُ إِذَا دَعَاهُ وَ يَتْبَعَهُ إِذَا مَاتَ .",
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Ibn Fazzal, from Ali Bin Uqba, ",
            "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> having said: ‘For a Muslim upon his Muslim brother, from the rights is that he greets him when he meets him, and consoles him when when sick, and advises for him when absent, and Name (say May Allah<sup style=\"font-weight: normal\">azwj</sup> Bless you) when he sneezes, and answer him when he invites him, and follow him (his funeral) when he dies’. ",
            "<span style=\"font-size: small\">A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ibn Fazzal, from Ali Bin Uqba</span> – similar to it."
          ],
          "en.sarwar": [
            "6. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from ibn Faddal from Ali ibn ‘Uqbah from abu ‘Abd Allah (a.s.) who has said the following: “Of the rights of Muslin on a Muslim is to offer him the greeting of peace upon meeting him, visit him when he is ill, protect his interest when he is absent, say, ‘May Allah bless you’ when he sneezes, accept his invitation and take part in the procession for his funeral.” A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ibn Faddal from Ali ibn ‘Uqbah a similar Hadith. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/38)"
        ],
        "index": 2055,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:75:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ أَبِي الْمَأْمُونِ الْحَارِثِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا حَقُّ الْمُؤْمِنِ عَلَى الْمُؤْمِنِ قَالَ إِنَّ مِنْ حَقِّ الْمُؤْمِنِ عَلَى الْمُؤْمِنِ الْمَوَدَّةَ لَهُ فِي صَدْرِهِ وَ الْمُوَاسَاةَ لَهُ فِي مَالِهِ وَ الْخَلَفَ لَهُ فِي أَهْلِهِ وَ النُّصْرَةَ لَهُ عَلَى مَنْ ظَلَمَهُ وَ إِنْ كَانَ نَافِلَةٌ فِي الْمُسْلِمِينَ وَ كَانَ غَائِباً أَخَذَ لَهُ بِنَصِيبِهِ وَ إِذَا مَاتَ الزِّيَارَةَ إِلَى قَبْرِهِ ",
          "وَ أَنْ لَا يَظْلِمَهُ وَ أَنْ لَا يَغُشَّهُ وَ أَنْ لَا يَخُونَهُ وَ أَنْ لَا يَخْذُلَهُ وَ أَنْ لَا يُكَذِّبَهُ وَ أَنْ لَا يَقُولَ لَهُ أُفٍّ وَ إِذَا قَالَ لَهُ أُفٍّ فَلَيْسَ بَيْنَهُمَا وَلَايَةٌ وَ إِذَا قَالَ لَهُ أَنْتَ عَدُوِّي فَقَدْ كَفَرَ أَحَدُهُمَا وَ إِذَا اتَّهَمَهُ انْمَاثَ الْإِيمَانُ فِي قَلْبِهِ كَمَا يَنْمَاثُ الْمِلْحُ فِي الْمَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Mansour Bin Yunus, from Abu Al Mamoun Al Harisy who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘What is the right of a <span class=\"iTxt\">Momin</span> upon a <span class=\"iTxt\">Momin</span>?’ He<sup>asws</sup> said: ‘From the rights of the <span class=\"iTxt\">Momin</span> upon the <span class=\"iTxt\">Momin</span> is (to have) the cordiality for him in his chest, and the equalisation for him in his wealth, and the taking care for him regarding his family, and the helping for him against the one who oppresses him, and if there were spoils (being distributed) among the Muslims and he was absent, take his share for him, and when he dies, the visitation to his grave.",
            "‘And that he should neither oppress him, and that he should not deceive him, and that he should not betray him, and that he should not abandon him, and that he should not bely him, and that he should not be saying for him, ‘Ugh!’. And when he does say, ‘Ugh!’ to him, so there is no <span class=\"iTxt\">Wilayah</span> in between the two of them; and when he says, ‘You are my enemy’, so one of the two has blasphemed; and when he slanders him, the <span class=\"iTxt\">Emān</span> would dissolve in his heart just as the salt dissolves in the water’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Mansur ibn Yunus from abu al-Mamun al-Harithi who has said the following: “Once I asked abu ‘Abd Allah (a.s.) ‘What are the rights of the believer on the believer?’ The Imam said, ‘Of the rights of the believer on the believer is to have compassion for him in his heart, assist him with his property, protect his interests in his absence in the matters of his family and support him against those who do injustice to him. If a benefit is distributed among the Muslims in his absence his believing brother should secure his share thereof. When he dies, he should visit his gravesite, must not do injustice to him, must not deceive him, must not violate his trust, must not betray him, must not call him a liar, must not say to him, ‘Fie upon you.’ If he says fie up on you then no guardianship ( Walayah ) relations will remain between them. If he says, ‘You are my enemy,’ one of them becomes an unbeliever and if he accuses him, belief in his heart will melt as salt melts in water.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (39/ 9)"
        ],
        "index": 2056,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:75:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي عَلِيٍّ صَاحِبِ الْكِلَلِ عَنْ أَبَانِ بْنِ تَغْلِبَ قَالَ كُنْتُ أَطُوفُ مَعَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَعَرَضَ لِي رَجُلٌ مِنْ أَصْحَابِنَا كَانَ سَأَلَنِي الذَّهَابَ مَعَهُ فِي حَاجَةٍ فَأَشَارَ إِلَيَّ فَكَرِهْتُ أَنْ أَدَعَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ أَذْهَبَ إِلَيْهِ فَبَيْنَا أَنَا أَطُوفُ إِذْ أَشَارَ إِلَيَّ أَيْضاً فَرَآهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ يَا أَبَانُ إِيَّاكَ يُرِيدُ هَذَا قُلْتُ نَعَمْ قَالَ فَمَنْ هُوَ قُلْتُ رَجُلٌ مِنْ أَصْحَابِنَا ",
          "قَالَ هُوَ عَلَى مِثْلِ مَا أَنْتَ عَلَيْهِ قُلْتُ نَعَمْ قَالَ فَاذْهَبْ إِلَيْهِ قُلْتُ فَأَقْطَعُ الطَّوَافَ قَالَ نَعَمْ قُلْتُ وَ إِنْ كَانَ طَوَافَ الْفَرِيضَةِ قَالَ نَعَمْ ",
          "قَالَ فَذَهَبْتُ مَعَهُ ثُمَّ دَخَلْتُ عَلَيْهِ بَعْدُ فَسَأَلْتُهُ فَقُلْتُ أَخْبِرْنِي عَنْ حَقِّ الْمُؤْمِنِ عَلَى الْمُؤْمِنِ فَقَالَ يَا أَبَانُ دَعْهُ لَا تَرِدْهُ قُلْتُ بَلَى جُعِلْتُ فِدَاكَ فَلَمْ أَزَلْ أُرَدِّدُ عَلَيْهِ فَقَالَ يَا أَبَانُ تُقَاسِمُهُ شَطْرَ مَالِكَ ",
          "ثُمَّ نَظَرَ إِلَيَّ فَرَأَى مَا دَخَلَنِي فَقَالَ يَا أَبَانُ أَ مَا تَعْلَمُ أَنَّ اللَّهَ عَزَّ وَ جَلَّ قَدْ ذَكَرَ الْمُؤْثِرِينَ عَلَى أَنْفُسِهِمْ قُلْتُ بَلَى جُعِلْتُ فِدَاكَ فَقَالَ أَمَّا إِذَا أَنْتَ قَاسَمْتَهُ فَلَمْ تُؤْثِرْهُ بَعْدُ إِنَّمَا أَنْتَ وَ هُوَ سَوَاءٌ إِنَّمَا تُؤْثِرُهُ إِذَا أَنْتَ أَعْطَيْتَهُ مِنَ النِّصْفِ الْآخَر."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Abu Umeyr, from Abu Ali Sahib Al Kilaly, from Aban Bin Taghlub who said, ",
            "‘I was performing <span class=\"iTxt\">Tawaaf</span> along with Abu Abdullah<sup>asws</sup>, and a man from our companions presented himself to me, and he was asking me to go with him regarding a need. So he gestured to me and I disliked to leave Abu Abdullah<sup>asws</sup> and go to him. So while I was performing <span class=\"iTxt\">Tawaaf</span> he gestured to me again and Abu Abdullah<sup>asws</sup> saw him, so he<sup>asws</sup> said: ‘O Aban! Is it you that this one wants?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘So who is he?’ I said, ‘A man from our companions’. ",
            "He<sup>asws</sup> said: ‘He is upon the like of what you are upon (Al-<span class=\"iTxt\">Wilayah</span>)?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘So go to him’. I said, ‘So I should cut the <span class=\"iTxt\">Tawaaf</span>?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘And even if it was the Obligatory <span class=\"iTxt\">Tawaaf</span>?’ He<sup>asws</sup> said: ‘Yes’.",
            "He (the narrator) said, ‘So I went with him, then came over to him<sup>asws</sup> afterwards and I asked him<sup>asws</sup>, so I said, ‘Inform me about the right of a <span class=\"iTxt\">Momin</span> upon a <span class=\"iTxt\">Momin</span>’. So he<sup>asws</sup> said: ‘O Aban! Leave it. Do not re-iterate it’. I said, ‘Yes, may I be sacrificed for you<sup>asws</sup>’. But I did not cease to re-iterate upon him<sup>asws</sup>, so he<sup>asws</sup> said: ‘O Aban! Would you apportion to him half of your wealth?’ ",
            "Then he<sup>asws</sup> looked at me, and he<sup>asws</sup> saw what had entered into me, so he<sup>asws</sup> said: ‘O Aban! Do you not know that Allah<sup>azwj</sup> Mighty and Majestic has Mentioned the one preferring others over themselves?’ I said, ‘Yes, may I be sacrificed for you<sup>asws</sup>’. So he<sup>asws</sup> said: ‘But, when you apportion to him half, so you have not preferred him afterwards, but rather, you and him would be equal. But rather, preferring him is when you give from more from the other half’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn abu ‘Umayr from abu Ali Sahib al-Kalal from Aban ibn Taghlib who has said the following: “Once I was performing Tawaf (walking seven times around the Ka’ba) along with abu ‘Abd Allah (a.s.) when a man from our people came up asking me to go with him for a certain need and hinted to me for that purpose, but I did not like to leave abu ‘Abd Allah (a.s.) and go with him. I was still performing Tawaf when he made a gesture for the same purpose and abu ‘Abd Allah (a.s.) saw him and said to me, ‘O Aban, does he want you?.’ I said, ‘Yes, he does so.’ The Imam asked, ‘Who is he?’ I said, ‘He is a man from our people.’ The Imam asked, ‘Is he of the belief that you are?’ I said, ‘Yes, he is.’ The Imam said, ‘Then go to him.’ I asked, ‘Should I discontinue Tawaf?’ The Imam said, ‘Yes, do so.’ I asked, ‘Even if it is a compulsory Tawaf?’ The Imam said, ‘Yes, even if it is such.’ I (the narrator) then went with him. Later I went to meet the Imam and I said to him, ‘Please tell me about the rights of the believer on the believer.’ The Imam asked, ‘O Aban, ignore it and do not repeat.’ I said, ‘Yes, may Allah keep my soul in service for your cause, but I still like to bring up the question. The Imam said, ‘O Aban, are you ready to share with him parts of your property?’ He then looked at me and found out what was going on in my mind and he asked, ‘O Aban do you know what Allah, the Most Majestic, the Most Holy, has said about the self-abnegating people?’ I said, ‘Yes, may Allah keep my soul in service for your cause, I know about it.’ The Imam said, ‘If you share with him you have not practiced self- abnegation, but you both are equal. You give him preference only if you give him from the other half also.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (42/ 9)"
        ],
        "index": 2057,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:75:9",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ عُمَرَ بْنِ أَبَانٍ عَنْ عِيسَى بْنِ أَبِي مَنْصُورٍ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَا وَ ابْنُ أَبِي يَعْفُورٍ وَ عَبْدُ اللَّهِ بْنُ طَلْحَةَ فَقَالَ ابْتِدَاءً مِنْهُ يَا ابْنَ أَبِي يَعْفُورٍ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) سِتُّ خِصَالٍ مَنْ كُنَّ فِيهِ كَانَ بَيْنَ يَدَيِ اللَّهِ عَزَّ وَ جَلَّ وَ عَنْ يَمِينِ اللَّهِ فَقَالَ ابْنُ أَبِي يَعْفُورٍ وَ مَا هُنَّ جُعِلْتُ فِدَاكَ قَالَ يُحِبُّ الْمَرْءُ الْمُسْلِمُ لِأَخِيهِ مَا يُحِبُّ لِأَعَزِّ أَهْلِهِ وَ يَكْرَهُ الْمَرْءُ الْمُسْلِمُ لِأَخِيهِ مَا يَكْرَهُ لِأَعَزِّ أَهْلِهِ وَ يُنَاصِحُهُ الْوَلَايَةَ",
          "فَبَكَى ابْنُ أَبِي يَعْفُورٍ وَ قَالَ كَيْفَ يُنَاصِحُهُ الْوَلَايَةَ قَالَ يَا ابْنَ أَبِي يَعْفُورٍ إِذَا كَانَ مِنْهُ بِتِلْكَ الْمَنْزِلَةِ بَثَّهُ هَمَّهُ فَفَرِحَ لِفَرَحِهِ إِنْ هُوَ فَرِحَ وَ حَزِنَ لِحُزْنِهِ إِنْ هُوَ حَزِنَ وَ إِنْ كَانَ عِنْدَهُ مَا يُفَرِّجُ عَنْهُ فَرَّجَ عَنْهُ وَ إِلَّا دَعَا اللَّهَ لَهُ",
          "قَالَ ثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) ثَلَاثٌ لَكُمْ وَ ثَلَاثٌ لَنَا أَنْ تَعْرِفُوا فَضْلَنَا وَ أَنْ تَطَئُوا عَقِبَنَا وَ أَنْ تَنْتَظِرُوا عَاقِبَتَنَا فَمَنْ كَانَ هَكَذَا كَانَ بَيْنَ يَدَيِ اللَّهِ عَزَّ وَ جَلَّ فَيَسْتَضِي‏ءُ بِنُورِهِمْ مَنْ هُوَ أَسْفَلُ مِنْهُمْ وَ أَمَّا الَّذِينَ عَنْ يَمِينِ اللَّهِ فَلَوْ أَنَّهُمْ يَرَاهُمْ مَنْ دُونَهُمْ لَمْ يَهْنِئْهُمُ الْعَيْشُ مِمَّا يَرَوْنَ مِنْ فَضْلِهِمْ ",
          "فَقَالَ ابْنُ أَبِي يَعْفُورٍ وَ مَا لَهُمْ لَا يَرَوْنَ وَ هُمْ عَنْ يَمِينِ اللَّهِ فَقَالَ يَا ابْنَ أَبِي يَعْفُورٍ إِنَّهُمْ مَحْجُوبُونَ بِنُورِ اللَّهِ أَ مَا بَلَغَكَ الْحَدِيثُ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ يَقُولُ إِنَّ لِلَّهِ خَلْقاً عَنْ يَمِينِ الْعَرْشِ بَيْنَ يَدَيِ اللَّهِ وَ عَنْ يَمِينِ اللَّهِ وُجُوهُهُمْ أَبْيَضُ مِنَ الثَّلْجِ وَ أَضْوَأُ مِنَ الشَّمْسِ الضَّاحِيَةِ يَسْأَلُ السَّائِلُ مَا هَؤُلَاءِ فَيُقَالُ هَؤُلَاءِ الَّذِينَ تَحَابُّوا فِي جَلَالِ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Fazalat Bin Ayoub, from Umar Bin Aban, from Isa Bin Abu Mansour who said, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup>, I and Ibn Abu Yafour, and Abdullah Bin Talha. So he<sup>asws</sup> said, initiating him: ‘O Ibn Abu Yafour! Rasool-Allah<sup>saww</sup> said: ‘Six characteristics, the one who has these in him, would be in front of Allah<sup>azwj</sup> Mighty and Majestic and upon the right of (the Throne of) Allah<sup>azwj</sup>’’. So Ibn Abu Yafour said, ‘And what are these, may I be sacrificed for you<sup>asws</sup>?’ He<sup>asws</sup> said: ‘A Muslim person should love for his brother what he loves for the dearest of his family, and a Muslim person should dislike for his brother what he dislikes for the dearest of his family, and advise him for the <span class=\"iTxt\">Wilayah</span>’. ",
            "So Ibn Abu Yafour wept and said, ‘And how should he advise him for the <span class=\"iTxt\">Wilayah</span>?’ He<sup>asws</sup> said ‘O Ibn Abu Yafour! When there was that status from him, his endeavours would be his main concern. So he would be happy for his happiness if he was happy, and grieve for his grief if he was in grief; and if it was so that there was in his presence what could relieve him, so he should relieve him, or else supplicate to Allah<sup>azwj</sup> for him’.",
            "He (the narrator) said, ‘Then Abu Abdullah<sup>asws</sup> said: ‘Three are for you and three are for us<sup>asws</sup> - that you should recognise our<sup>asws</sup> merits, and obediently follow us<sup>asws</sup>, and await our<sup>asws</sup> end result (Al-Qaim<sup>asws</sup>). So the ones who were (observe) like this, would be in front of Allah<sup>azwj</sup> Mighty and Majestic, and they would illuminate by their light the ones who were below them. And as for those on the right of (the Throne of) Allah<sup>azwj</sup>, so if the ones who were below them were to see them, the life would not be welcoming for them due to what they would be seeing from their merits.",
            "So Ibn Abu Yafour said, ‘And what is the matter with them that they would not be seeing them, and the would be on the right (of the Throne) of Allah<sup>azwj</sup>?’ So he<sup>asws</sup> said: ‘O Ibn Abu Yafour! They would be veiled by the Light of Allah<sup>azwj</sup>. Has not the Hadeeth reached you that Rasool-Allah<sup>saww</sup> was saying: ‘For Allah<sup>azwj</sup> there are creatures on the right of the Throne, in front of Allah<sup>azwj</sup>, and on the right of Allah<sup>azwj</sup>. Their faces would be whiter than the snow, and more illuminating than the shining sun. The asking one would ask, ‘What are they?’ So it would be said: ‘They are those who used to love regarding the Majesty of Allah<sup>azwj</sup>’’."
          ],
          "en.sarwar": [
            "9. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father from Fadalah ibn Ayyub from ‘Amr ibn Aban from ‘Isa ibn abu Mansur who has said the following: “Once ibn abu Ya’fur, ‘Abd Allah ibn Talha and I were in the presence of abu ‘Abd Allah (a.s.) who on his own initiation said, ‘O ibn abu Ya’fur, the Messenger of Allah has said, “There are six things that if found in a person, he will be before Allah, the Most Majestic, the Most Holy, to the right of Allah (to the right of the Throne of Allah).”’ Ibn abu Ya’fur then asked, ‘What are those things, may Allah keep my soul in service for your cause?’ The Imam said, ‘A man must love for his Muslim brother what he loves for the most beloved person of his family and dislike for his Muslim brother what he dislikes for the most beloved person of his family and enlighten him in Walayah (the position of people who possess Divine Authority).’ Ibn abu Ya’fur then wept and asked, ‘How does he enlighten about Walayah r T The Imam said, ‘O ibn abu Ya’fur, if he is of the same level (of belief), he should encourage him, show happiness in his happiness and express sadness if he is sad. If he has the means to facilitate him he should do so if not he should pray to Allah for him. ’ “The narrator has said that abu ‘Abd Allah (a.s.) then said, ‘Three things are for you and three things are for us. What is for us is that you must learn about our excellent merits, follow our footsteps and wait for our end results (Divine Kingdom) to take place. Whoever has these facts will be before Allah, the Most Majestic, the Most Holy, and those below them will receive light from their light. On seeing those who will be to the right of Allah, the ones below will not feel happy because of the enviable merits of the persons above.’ Ibn abu Ya’fur then asked, ‘How is it that they will not see when they are on the right of Allah?’ The Imam said, ‘O ibn abu Ya’fur, they are veiled with the light of Allah. Are you not aware of the Hadith that the Messenger of Allah said, ‘Allah has a creature on the right of the Throne before Allah and on the right of Allah their faces are whiter than snow and brighter than the sun of the midday. Someone asks, ‘Who are they?’ It will be said, ‘These are the ones who loved each other in the Glory of Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/45)"
        ],
        "index": 2058,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:75:10",
        "text": [
          "عَنْهُ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ عَجْلَانَ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَدَخَلَ رَجُلٌ فَسَلَّمَ فَسَأَلَهُ كَيْفَ مَنْ خَلَّفْتَ مِنْ إِخْوَانِكَ قَالَ فَأَحْسَنَ الثَّنَاءَ وَ زَكَّى وَ أَطْرَى فَقَالَ لَهُ كَيْفَ عِيَادَةُ أَغْنِيَائِهِمْ عَلَى فُقَرَائِهِمْ فَقَالَ قَلِيلَةٌ قَالَ وَ كَيْفَ مُشَاهَدَةُ أَغْنِيَائِهِمْ لِفُقَرَائِهِمْ قَالَ قَلِيلَةٌ قَالَ فَكَيْفَ صِلَةُ أَغْنِيَائِهِمْ لِفُقَرَائِهِمْ فِي ذَاتِ أَيْدِيهِمْ فَقَالَ إِنَّكَ لَتَذْكُرُ أَخْلَاقاً قَلَّ مَا هِيَ فِيمَنْ عِنْدَنَا قَالَ فَقَالَ فَكَيْفَ تَزْعُمُ هَؤُلَاءِ أَنَّهُمْ شِيعَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Usman Bin Isa, from Muhammad Bin Ajlan who said, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup>, and a man came over. So he greeted, and he<sup>asws</sup> asked him: ‘How are the ones from your brethren whom you left behind?’ So he praised them well, and admired them. So he<sup>asws</sup> said to him: ‘How is the consolation of their rich ones upon their poor ones’. So he said, ‘Little’. He<sup>asws</sup> said: ‘And how is the observation (consideration) of their rich ones to their poor ones?’ He said, ‘Little’. He<sup>asws</sup> said: ‘So how is the helping of their rich ones to their poor ones with regards to what is in their hands?’ So he said, ‘You<sup>asws</sup> are mentioning manners. Little is what it is among the ones in our presence’. So he<sup>asws</sup> said: ‘So how did you claim about them that they are Shia?’"
          ],
          "en.sarwar": [
            "10. It is narrated from him (narrator of the Hadith above) from ‘Uthman ibn ‘Isa from Muhammad ibn ‘Ajlan who has said the following: “Once, I was in the presence of abu ‘Abd Allah (a.s.) when a man came and offered the greeting of peace. The Imam asked, ‘How are your brothers (in belief) whom you have left behind?’ He praised, admired and extolled them. The Imam asked, ‘Do their wealthy ones visit their poor ones?’ He said, ‘It is very rare.’ The Imam asked, ‘Do their rich ones reach out to the poor ones?’ He said, ‘It is very rare.’ “The Imam asked, ‘Do their rich ones maintain good relations with their poor ones financially?’ He said, ‘You are speaking of the moral behavior that is practiced very rarely in our people.’ The narrator has said that the Imam then asked, ‘Why do you then think they are Shi’a (Muslims)?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/45)"
        ],
        "index": 2059,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:75:11",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ أَحْمَدَ بْنِ النَّضْرِ عَنْ أَبِي إِسْمَاعِيلَ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) جُعِلْتُ فِدَاكَ إِنَّ الشِّيعَةَ عِنْدَنَا كَثِيرٌ فَقَالَ فَهَلْ يَعْطِفُ الْغَنِيُّ عَلَى الْفَقِيرِ وَ هَلْ يَتَجَاوَزُ الْمُحْسِنُ عَنِ الْمُسِي‏ءِ وَ يَتَوَاسَوْنَ فَقُلْتُ لَا فَقَالَ لَيْسَ هَؤُلَاءِ شِيعَةً الشِّيعَةُ مَنْ يَفْعَلُ هَذَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Salim, from Ahmad Bin Al Nazar, from Abu Ismail who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! The Shias in our presence are numerous’. So he<sup>asws</sup> said: ‘So are the rich ones being kind upon the poor, and do the righteous ones overlook (the faults) from the sinners, and are they helping each other?’ So I said, ‘No’. So he<sup>asws</sup> said: ‘They are not Shia. The Shia is the one who does this’."
          ],
          "en.sarwar": [
            "11. Abu Ali al-Ash’ari has narrated from Muhammad ibn Salim from Ahmad ibn al- Nadr from abu Isma’il who has said the following: “Once I said to abu Ja’far (a.s.) ‘May Allah keep my soul in service for your cause, there is a great number of Shi’a in our area. The Imam asked, ‘Are their rich ones kind to their poor ones? Do their virtuous ones forgive their sinful ones? Do they assist each other financially?’ I said, ‘No, they do not do so.’ The Imam said, ‘They are not Shi’a. Shi’a are those who do these things.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور معتبر عند ي  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (46/ 9)"
        ],
        "index": 2060,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:75:12",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الْعَلَاءِ بْنِ فُضَيْلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ أَبُو جَعْفَرٍ ( صلوات الله عليه )  يَقُولُ عَظِّمُوا أَصْحَابَكُمْ وَ وَقِّرُوهُمْ وَ لَا يَتَجَهَّمُ بَعْضُكُمْ بَعْضاً وَ لَا تَضَارُّوا وَ لَا تَحَاسَدُوا وَ إِيَّاكُمْ وَ الْبُخْلَ كُونُوا عِبَادَ اللَّهِ الْمُخْلَصِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Sinan, from Al A’ala Bin Fuzayl, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Abu Ja’far<sup>asws</sup> was saying: ‘Magnify your companions and revere them, and neither should some of your scowl at the others, nor harm, nor envy (each other). And beware of the stinginess! Become sincere worshippers of Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "12. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from al-‘Ala’ ibn Fudayl from abu ‘Abd Allah (a.s.) who has said the following: “Abu Ja’far (a.s.) would say, ‘Dignify your people, honor them and do not be aggressive toward each other, do not harm each other and do not be jealous of each other. You must never be miserly and always be sincere servants of Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (46/ 9)"
        ],
        "index": 2061,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:75:13",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ فَضَّالٍ عَنْ عُمَرَ بْنِ أَبَانٍ عَنْ سَعِيدِ بْنِ الْحَسَنِ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) أَ يَجِي‏ءُ أَحَدُكُمْ إِلَى أَخِيهِ فَيُدْخِلَ يَدَهُ فِي كِيسِهِ فَيَأْخُذَ حَاجَتَهُ فَلَا يَدْفَعَهُ فَقُلْتُ مَا أَعْرِفُ ذَلِكَ فِينَا فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) فَلَا شَيْ‏ءَ إِذاً قُلْتُ فَالْهَلَاكُ إِذاً فَقَالَ إِنَّ الْقَوْمَ لَمْ يُعْطَوْا أَحْلَامَهُمْ بَعْدُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Al Jabbar, from Ibn Fazzal, from Umar Bin Aban, from Saeed Bin Al Hassan who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘Does one of you tend to come over to his brother and insert his hand in his pocket and take (out money as per) his need, and he does not repel him?’ So I said, ‘I do not recognise that (to be happening) among us’. So Abu Ja’far<sup>asws</sup> said: ‘So there is nothing, then’. I said, ‘So (it is) the destruction, then?’ So he<sup>asws</sup> said: ‘Surely the people have not been Given their forbearance yet’."
          ],
          "en.sarwar": [
            "13. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from ibn Faddal from ‘Amr ibn Aban from Sa’id ibn al-Hassan who has said the following: “Abu Ja’far (a.s.) once asked me, ‘Does your brother (in belief) come to you, stretch his hand in your pocket and take what he needs and you do not push him aside?’ I said, ‘I do not know that such things happen among us.’ Abu Ja’far (a.s.) then said, ‘There is nothing then.’ I said, ‘It is destruction then.’ The Imam said, ‘The people have not yet recieved their power of reason.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/47)"
        ],
        "index": 2062,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:75:14",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنِ الْحُسَيْنِ بْنِ الْحَسَنِ عَنْ مُحَمَّدِ بْنِ أُورَمَةَ رَفَعَهُ عَنْ مُعَلَّى بْنِ خُنَيْسٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ حَقِّ الْمُؤْمِنِ فَقَالَ سَبْعُونَ حَقّاً لَا أُخْبِرُكَ إِلَّا بِسَبْعَةٍ فَإِنِّي عَلَيْكَ مُشْفِقٌ أَخْشَى أَلَّا تَحْتَمِلَ فَقُلْتُ بَلَى إِنْ شَاءَ اللَّهُ ",
          "فَقَالَ لَا تَشْبَعُ وَ يَجُوعُ وَ لَا تَكْتَسِي وَ يَعْرَى وَ تَكُونُ دَلِيلَهُ وَ قَمِيصَهُ الَّذِي يَلْبَسُهُ وَ لِسَانَهُ الَّذِي يَتَكَلَّمُ بِهِ وَ تُحِبُّ لَهُ مَا تُحِبُّ لِنَفْسِكَ وَ إِنْ كَانَتْ لَكَ جَارِيَةٌ بَعَثْتَهَا لِتُمَهِّدَ فِرَاشَهُ وَ تَسْعَى فِي حَوَائِجِهِ بِاللَّيْلِ وَ النَّهَارِ فَإِذَا فَعَلْتَ ذَلِكَ وَصَلْتَ وَلَايَتَكَ بِوَلَايَتِنَا وَ وَلَايَتَنَا بِوَلَايَةِ اللَّهِ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Al Husayn Bin Al Hassan, from Muhammad Bin Awrama, raising it from Moalla Bin Khunays who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the rights of the <span class=\"iTxt\">Momin</span>. So he<sup>asws</sup> said: ‘(There are) seventy rights. I<sup>asws</sup> shall not inform you of except for seven, for I<sup>asws</sup> am sympathetic upon you, fearing that you will not (be able to) bear it’. So I said, ‘Yes, Allah<sup>azwj</sup> Willing’. ",
            "So he<sup>asws</sup> said: ‘You cannot be satiated while he is hungry, nor be clothed while he is bare, and you should become his guide and his shirt which he wears and his tongue which he speaks by, and you should love for him what you love for yourself; and if there was a maid for you, you should send her to prepare his bed and work with regards to his need at night and day. So when you do that, your <span class=\"iTxt\">Wilayah</span> would be linked with our<sup>asws</sup> <span class=\"iTxt\">Wilayah</span>, and our<sup>asws</sup> <span class=\"iTxt\">Wilayah</span> is (linked) to the <span class=\"iTxt\">Wilayah</span> of Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "14. Ali ibn Ibrahim has narrated from al-Husayn ibn al-Hassan from Muhammad ibn ‘Uramah in a marfu’ manner from Mu’alla ibn Khanis who has said the following: “Once I asked abu ‘Abd Allah (a.s.) about the rights of the believer. The Imam said, ‘There are seventy categories of rights but I will only tell you of seven; I am compassionate for you and I fear you may not be able to bear it.’ I said, ‘Yes, I will bear it, if Allah so wills.’ The Imam said, ‘You must not satisfy yourself with food while he is hungry, you must not dress up in finery while he may not have any clothes. You must be as his guide, as his shirt (a means of protection) that he wears, his tongue with which he speaks and love for him what you love for yourself. If you have a maiden servant, send her to prepare his bed and try to serve him during the day or night. If you do this you have connected your guardianship with our guardianship and with the guardianship of Allah, the Most Majestic, the Most Holy.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/49)"
        ],
        "index": 2063,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:75:15",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي الْمَغْرَاءِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْمُسْلِمُ أَخُو الْمُسْلِمِ لَا يَظْلِمُهُ وَ لَا يَخْذُلُهُ وَ لَا يَخُونُهُ وَ يَحِقُّ عَلَى الْمُسْلِمِينَ الِاجْتِهَادُ فِي التَّوَاصُلِ وَ التَّعَاوُنُ عَلَى التَّعَاطُفِ وَ الْمُوَاسَاةُ لِأَهْلِ الْحَاجَةِ وَ تَعَاطُفُ بَعْضِهِمْ عَلَى بَعْضٍ حَتَّى تَكُونُوا كَمَا أَمَرَكُمُ اللَّهُ عَزَّ وَ جَلَّ رُحَمَاءَ بَيْنَكُمْ مُتَرَاحِمِينَ مُغْتَمِّينَ لِمَا غَابَ عَنْكُمْ مِنْ أَمْرِهِمْ عَلَى مَا مَضَى عَلَيْهِ مَعْشَرُ الْأَنْصَارِ عَلَى عَهْدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Abu Al Magra’a, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Muslim is a brother of the Muslim, neither oppressing him, nor abandoning him, nor betraying him; and there is an entitlement upon the Muslims, the striving in the communicating (with each other), and the assisting upon the sympathy (with each other), and the equalisation to the needy people, and the sympathy of some upon the other until they (all) become just as Allah<sup>azwj</sup> Mighty and Majestic Commanded you for, being Merciful between yourselves, to each other and gloomy due to their absence from you from their affairs, (as it used to be) in the past, as the group of the Helpers were in the era of Rasool-Allah<sup>saww</sup>’."
          ],
          "en.sarwar": [
            "15. A number of our people have narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from abu al-Maghra’ from abu ‘Abd Allah (a.s.) who has said the following: “The Muslim is the brother of the Muslim (in belief). He does not do injustice to him, does not betray him, and does not violate his trust. It is worthwhile for the Muslims to be assiduous in maintaining good relations with each other, be kind to each other, assist the needy ones financially and be compassionate toward each other so that they can be as Allah, the Most Majestic, the Most Holy, has commanded them to be, ‘Compassionate toward each other, ’(48:29) kind to one another and feel sad for their absence from them. You should be just as the group of Ansar (the supporters) was in the lifetime of the Messenger of Allah (a.s.) as mentioned in (48:29).’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (50/ 9)"
        ],
        "index": 2064,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:75:16",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) حَقٌّ عَلَى الْمُسْلِمِ إِذَا أَرَادَ سَفَراً أَنْ يُعْلِمَ إِخْوَانَهُ وَ حَقٌّ عَلَى إِخْوَانِهِ إِذَا قَدِمَ أَنْ يَأْتُوهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘A right upon the Muslim is that whenever he intends to travel, he should let his brethren know, and it is a right upon his Muslim brother to visit him when he returns from the journey’."
          ],
          "en.sarwar": [
            "16. Ali ibn Ibrahim has narrated from his father from al-Nawfali from al-Sakuni from abu ‘Abd Allah (a.s.) who has said the following: “The Messenger of Allah has said, ‘It is a right upon a Muslim to inform his brothers (in belief) of his decision to go on a journey. It is a right upon his Muslim brothers to visit him when he returns from the journey.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:75",
  "kind": "verse_list"
}