{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 78"
        },
        "path": "/books/al-kafi:2:1:78",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الْمُصَافَحَةِ</span>",
          "en": "Chapter 78 – The Handshake"
        }
      }
    ],
    "index": 266,
    "local_index": 78,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 79"
        },
        "path": "/books/al-kafi:2:1:79",
        "titles": {
          "ar": "بَابُ الْمُعَانَقَةِ",
          "en": "Chapter 79 – The Embracing"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 77"
        },
        "path": "/books/al-kafi:2:1:77",
        "titles": {
          "ar": "بَابُ زِيَارَةِ الْإِخْوَانِ",
          "en": "Chapter 77 – Visiting the brethren"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:78",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الْمُصَافَحَةِ</span>",
      "en": "Chapter 78 – The Handshake"
    },
    "verse_count": 21,
    "verse_start_index": 2084,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/61)"
        ],
        "index": 2085,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:78:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ يَحْيَى بْنِ زَكَرِيَّا عَنْ أَبِي عُبَيْدَةَ قَالَ كُنْتُ زَمِيلَ أَبِي جَعْفَرٍ ( عليه السلام ) وَ كُنْتُ أَبْدَأُ بِالرُّكُوبِ ثُمَّ يَرْكَبُ هُوَ فَإِذَا اسْتَوَيْنَا سَلَّمَ وَ سَاءَلَ مُسَاءَلَةَ رَجُلٍ لَا عَهْدَ لَهُ بِصَاحِبِهِ وَ صَافَحَ ",
          "قَالَ وَ كَانَ إِذَا نَزَلَ نَزَلَ قَبْلِي فَإِذَا اسْتَوَيْتُ أَنَا وَ هُوَ عَلَى الْأَرْضِ سَلَّمَ وَ سَاءَلَ مُسَاءَلَةَ مَنْ لَا عَهْدَ لَهُ بِصَاحِبِهِ فَقُلْتُ يَا ابْنَ رَسُولِ اللَّهِ إِنَّكَ لَتَفْعَلُ شَيْئاً مَا يَفْعَلُهُ أَحَدُ مَنْ قِبَلَنَا وَ إِنْ فَعَلَ مَرَّةً فَكَثِيرٌ ",
          "فَقَالَ أَ مَا عَلِمْتَ مَا فِي الْمُصَافَحَةِ إِنَّ الْمُؤْمِنَيْنِ يَلْتَقِيَانِ فَيُصَافِحُ أَحَدُهُمَا صَاحِبَهُ فَلَا تَزَالُ الذُّنُوبُ تَتَحَاتُّ عَنْهُمَا كَمَا يَتَحَاتُّ الْوَرَقُ عَنِ الشَّجَرِ وَ اللَّهُ يَنْظُرُ إِلَيْهَا حَتَّى يَفْتَرِقَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Fazzal, from Sa’alba Bin Maymoun, from Yahya Bin Zakariyya, from Abu Ubeyda who said, ",
            "‘I was a travel companions of Abu Ja’far<sup style=\"font-weight: normal\">asws</sup>, and I used to begin with the riding, then he<sup style=\"font-weight: normal\">asws</sup> would ride. So when we were established (upon the ride), he<sup style=\"font-weight: normal\">asws</sup> greeted and asked questions like a man who had no pact for him with his companion, and shook hands’. ",
            "He (the narrator) said, ‘And it was so that whenever we descended, he<sup style=\"font-weight: normal\">asws</sup> descended before I did. So when we were both established upon the ground, he<sup style=\"font-weight: normal\">asws</sup> greeted and asked questions like the one who had no pact for him with his companion’. So I said, ‘O son<sup style=\"font-weight: normal\">asws</sup> of Rasool-Allah<sup style=\"font-weight: normal\">saww</sup>! You<sup style=\"font-weight: normal\">asws</sup> are doing something which no one has done before us, and if you<sup style=\"font-weight: normal\">asws</sup> were to do it once, so it would be a lot’. ",
            "So he<sup style=\"font-weight: normal\">asws</sup> said: ‘Do you not know what is in the handshake? The <span class=\"iTxt\">Momineen</span>, when two are meeting, so one of them shakes the hand of his companions, so the sins do not cease to erode from them both just as the erosion of the leaves from the tree, and Allah<sup style=\"font-weight: normal\">azwj</sup> Looks at it (the handshake) until they both separate’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from ibn Faddal from Tha’labah ibn Mayamun from Yahya ibn Zakariya from abu ‘Ubaydah who has said the following: “’Ubaydah has said, ‘Once I was a partner of abu Ja’far (a.s.) on a journey. During the journey, first I would take my seat in the carriage set up on the back of the carry animal and then he would take his seat. He after settling down on his place properly would offer me the greeting of peace and ask a question like a person who has never met the other person. He would also shake hands. ’ The narrator has said, ‘He after dismounting would do so before me and after finding our places on the ground he would offer the greeting of peace and ask questions like he had never met me.’ 1 then said, ‘O descendent of the Messenger of Allah, you do things that no one before us has done. Doing (such formalities) only once is more than enough.’ The Imam asked, ‘Do you know what is in a handshake? The believers meet and shake hands, the sins continue falling off of them just like leaves fall off the trees, and Allah looks upon them until they depart from each other.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/62)"
        ],
        "index": 2086,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:78:2",
        "text": [
          "عَنْهُ عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ أَبِي خَالِدٍ الْقَمَّاطِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ الْمُؤْمِنَيْنِ إِذَا الْتَقَيَا وَ تَصَافَحَا أَدْخَلَ اللَّهُ يَدَهُ بَيْنَ أَيْدِيهِمَا فَصَافَحَ أَشَدَّهُمَا حُبّاً لِصَاحِبِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ibn Fazzal, from Ali Bin Uqba, from Abu Khalid Al Qammat, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The <span class=\"iTxt\">Momineen</span>, when two meet and shake hands, Allah<sup>azwj</sup> Inserts His<sup>azwj</sup> Hand in between both of them, and Shakes the Hand of the one with more intense love for his companion’."
          ],
          "en.sarwar": [
            "2. It is narrated from him (narrator of the Hadith above) from ibn Faddal from Ali ibn ‘Uqbah from abu Khalid al-Qammat from abu Ja’far (a.s.) who has said the following: ‘‘When the believing people meet and shake hands Allah inserts His hand between their hands and shakes hands with the one whose love for his brother (in belief) is more intense.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/63)"
        ],
        "index": 2087,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:78:3",
        "text": [
          "ابْنُ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ أَيُّوبَ عَنِ السَّمَيْدَعِ عَنْ مَالِكِ بْنِ أَعْيَنَ الْجُهَنِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ الْمُؤْمِنَيْنِ إِذَا الْتَقَيَا فَتَصَافَحَا أَدْخَلَ اللَّهُ عَزَّ وَ جَلَّ يَدَهُ بَيْنَ أَيْدِيهِمَا وَ أَقْبَلَ بِوَجْهِهِ عَلَى أَشَدِّهِمَا حُبّاً لِصَاحِبِهِ فَإِذَا أَقْبَلَ اللَّهُ عَزَّ وَ جَلَّ بِوَجْهِهِ عَلَيْهِمَا تَحَاتَّتْ عَنْهُمَا الذُّنُوبُ كَمَا يَتَحَاتُّ الْوَرَقُ مِنَ الشَّجَرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Fazzal, from Ali Bin Uqba, from Ayoub, from Al Samyda, from Malik Bin Ayn Al Juhny, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The <span class=\"iTxt\">Momineen</span>, when two meet and shake hands, Allah<sup>azwj</sup> Mighty and Majestic Inserts His<sup>azwj</sup> Hand between their two hands, and Turn by His<sup>azwj</sup> Face towards the one who has more intense love for his companions. So when Allah<sup>azwj</sup> Mighty and Majestic Turns by His<sup>azwj</sup> Face upon them both, the sins erode from both of them just as the leaves erode from the tree’."
          ],
          "en.sarwar": [
            "3. Ibn Faddal has narrated from Ali ibn ‘Uqbah from Ayyub from al-Sumayda’ from Malik ibn ‘A’Yun al-Juhni from abu Ja’far (a.s.) who has said the following: ‘When two believing people meet and shake hands Allah, the Most Majestic, the Most Holy, inserts His hand between their hands and faces the one whose love for his brother (in belief) is more intense. When Allah, the Most Majestic, the Most Holy, turns His face to them their sins begin to fall like leaves from trees.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/64)"
        ],
        "index": 2088,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:78:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عُبَيْدَةَ الْحَذَّاءِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ الْمُؤْمِنَيْنِ إِذَا الْتَقَيَا فَتَصَافَحَا أَقْبَلَ اللَّهُ عَزَّ وَ جَلَّ عَلَيْهِمَا بِوَجْهِهِ وَ تَسَاقَطَتْ عَنْهُمَا الذُّنُوبُ كَمَا يَتَسَاقَطُ الْوَرَقُ مِنَ الشَّجَرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, from Abu Ubeyda Al Haza’a, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The <span class=\"iTxt\">Momineen</span>, when two of them meet and shake hands, Allah<sup>azwj</sup> Mighty and Majestic Turns towards them by His<sup>azwj</sup> Face, and the sins fall off from them both just as the leaves fall of from the tree’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hisham ibn Salim from abu ‘Ubaydah al-Hadhdha’ from abu Ja’far (a.s.) who has said the following: ‘‘When two believing people meet and shake hands Allah, the Most Majestic, the Most Holy, turns His face (direction, aspect) to them and sins began to fall from them like leaves fall from trees.’” "
          ]
        }
      },
      {
        "index": 2089,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:78:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ صَفْوَانَ الْجَمَّالِ عَنْ أَبِي عُبَيْدَةَ الْحَذَّاءِ قَالَ زَامَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) فِي شِقِّ مَحْمِلٍ مِنَ الْمَدِينَةِ إِلَى مَكَّةَ فَنَزَلَ فِي بَعْضِ الطَّرِيقِ فَلَمَّا قَضَى حَاجَتَهُ وَ عَادَ قَالَ هَاتِ يَدَكَ يَا أَبَا عُبَيْدَةَ فَنَاوَلْتُهُ يَدِي فَغَمَزَهَا حَتَّى وَجَدْتُ الْأَذَى فِي أَصَابِعِي ثُمَّ قَالَ يَا أَبَا عُبَيْدَةَ مَا مِنْ مُسْلِمٍ لَقِيَ أَخَاهُ الْمُسْلِمَ فَصَافَحَهُ وَ شَبَّكَ أَصَابِعَهُ فِي أَصَابِعِهِ إِلَّا تَنَاثَرَتْ عَنْهُمَا ذُنُوبُهُمَا كَمَا يَتَنَاثَرُ الْوَرَقُ مِنَ الشَّجَرِ فِي الْيَوْمِ الشَّاتِي ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Safwan Al Jammal, from Abu Ubeyda Al Haza’a who said, ",
            "‘I was a travel companions of Abu Ja’far<sup>asws</sup> in a section of the carriage, from Al-Medina to Makkah. So we descended in one of the roads. So when he<sup>asws</sup> had fulfilled his need and returned, said: ‘Give me your hand, O Abu Ubeyda!’ So he<sup>asws</sup> grabbed my hand and pressed it to the extend that I felt the pain in my fingers, then said: ‘O Abu Ubeyda! There is none from a Muslim who meets his Muslim brother, so he shakes his hand and twines his fingers in his fingers, except that both their sins erode from the both just as the erosion of the leaves from the tree during a day of autumn’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad ibn abu Nasr from Safwan al-Jammal from abu ‘Ubaydah al- Hadhdha’ who has said the following: “Once I was a partner of abu Ja’far (a.s.) on a journey on one side of the carriage on the camel from Madina to Makka. On the way he dismounted for rest and, when he returned, he asked me for a handshake. He squeezed my hand so hard that my fingers began to hurt. He then said, ‘O abu ‘Ubaydah, when two Muslims meet, shake hands and crisscross their fingers, their sins begin to fall from them like leaves fall from trees on a fall day.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (64/ 9)"
        ],
        "index": 2090,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:78:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ يَحْيَى الْحَلَبِيِّ عَنْ مَالِكٍ الْجُهَنِيِّ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) يَا مَالِكُ أَنْتُمْ شِيعَتُنَا أَ لَا تَرَى أَنَّكَ تُفْرِطُ فِي أَمْرِنَا إِنَّهُ لَا يُقْدَرُ عَلَى صِفَةِ اللَّهِ فَكَمَا لَا يُقْدَرُ عَلَى صِفَةِ اللَّهِ كَذَلِكَ لَا يُقْدَرُ عَلَى صِفَتِنَا وَ كَمَا لَا يُقْدَرُ عَلَى صِفَتِنَا كَذَلِكَ لَا يُقْدَرُ عَلَى صِفَةِ الْمُؤْمِنِ ",
          "إِنَّ الْمُؤْمِنَ لَيَلْقَى الْمُؤْمِنَ فَيُصَافِحُهُ فَلَا يَزَالُ اللَّهُ يَنْظُرُ إِلَيْهِمَا وَ الذُّنُوبُ تَتَحَاتُّ عَنْ وُجُوهِهِمَا كَمَا يَتَحَاتُّ الْوَرَقُ مِنَ الشَّجَرِ حَتَّى يَفْتَرِقَا فَكَيْفَ يُقْدَرُ عَلَى صِفَةِ مَنْ هُوَ كَذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Yahya Al Halby, from Malik Al Juhny who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘O Malik! You all are our Shia. Do you not see that you are exaggerating regarding our<sup>asws</sup> matter? It is such that no one is able upon describing Allah<sup>azwj</sup>. So, just as no one is able upon describing Allah<sup>azwj</sup>, similar to that, no one is able upon describing us<sup>asws</sup>. And just as no one is able upon describing us<sup>asws</sup>, similar to that no one is able upon describing the <span class=\"iTxt\">Momin</span>.",
            "The <span class=\"iTxt\">Momin</span> meets the <span class=\"iTxt\">Momin</span> and shakes his hand, and Allah<sup>azwj</sup> Does not cease to Look at them, and the sins erode from their faces just as the leaves erode from the tree until they both separate. So how would one be able upon describing the one who is like that?’"
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from Yahya al-Halabi from Malik al-Juhni who has said the following: “Abu Ja’far (a.s.) once said to me, ‘O Malik, you are of our followers (Shi’a). Are you aware that you go to extremes in our cause? No one is able to describe Allah. Just as no one is able to describe Allah, no one is able to describe us. Just as no one is able to describe us, no one is able to describe the believer. When a believer meets the believer and shakes hands, Allah continues looking at them and sins fall from their faces like leaves fall from trees until they depart each other. How then is one able to describe one who is as such?’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/66)"
        ],
        "index": 2091,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:78:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ مُحَمَّدِ بْنِ فُضَيْلٍ عَنْ أَبِي حَمْزَةَ قَالَ زَامَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) فَحَطَطْنَا الرَّحْلَ ثُمَّ مَشَى قَلِيلًا ثُمَّ جَاءَ فَأَخَذَ بِيَدِي فَغَمَزَهَا غَمْزَةً شَدِيدَةً فَقُلْتُ جُعِلْتُ فِدَاكَ أَ وَ مَا كُنْتُ مَعَكَ فِي الْمَحْمِلِ فَقَالَ أَ مَا عَلِمْتَ أَنَّ الْمُؤْمِنَ إِذَا جَالَ جَوْلَةً ثُمَّ أَخَذَ بِيَدِ أَخِيهِ نَظَرَ اللَّهُ إِلَيْهِمَا بِوَجْهِهِ فَلَمْ يَزَلْ مُقْبِلًا عَلَيْهِمَا بِوَجْهِهِ وَ يَقُولُ لِلذُّنُوبِ تَحَاتَّ عَنْهُمَا فَتَتَحَاتُّ يَا أَبَا حَمْزَةَ كَمَا يَتَحَاتُّ الْوَرَقُ عَنِ الشَّجَرِ فَيَفْتَرِقَانِ وَ مَا عَلَيْهِمَا مِنْ ذَنْبٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Umar Bin Abdul Al Aziz, from Muhammad Bin Fuzayl, from Abu Hamza who said, ",
            "‘I was a travel companion of Abu Ja’far<sup>asws</sup>. So we unloaded our rides, then walked a little. Then he<sup>asws</sup> came over and grabbed my hand, and pressed it with an intense pressing. So I said, ‘May I be sacrificed for you<sup>asws</sup>! Or, was I not with you<sup>asws</sup> in the carriage?’ So he<sup>asws</sup> said: ‘Do you not know that the <span class=\"iTxt\">Momin</span>, when he wanders around, then grabs the hand of his brother, Allah<sup>azwj</sup> Looks at them both, and He<sup>azwj</sup> does not cease to be Facing towards them both by His<sup>azwj</sup> Face, and He<sup>azwj</sup> is Saying to the sins: “Fall off from them both!” So they fall off, O Abu Hamza, just as the leave fall of from the tree. Thus, they would be separating and there would not be upon the both of them, any sin’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ‘Umar ibn ‘Abd al-‘Aziz from Muhammad ibn Fudayl from abu Hamza who has said the following: “Once I was a partner of abu Ja’far (a.s.) on a journey. On the way we unloaded our luggage and he walked a little and came back, held my hand and squeezed it hard. I asked, ‘May Allah keep my soul in service for your cause, ‘Was I not with you in the carriage?’ The Imam asked, ‘Did you not know that when the believer comes around, and holds the hand of his brother (in belief), Allah faces them and looks at them. He continues facing them and says to the sins to fall off of them and they began to fall, O abu Hamza, like leaves that fall from trees. They then depart and there no sins will be left on them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (66/ 9)"
        ],
        "index": 2092,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:78:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ حَدِّ الْمُصَافَحَةِ فَقَالَ دَوْرُ نَخْلَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the limit of the handshake. So he<sup>asws</sup> said: ‘Going round a palm tree’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hisham ibn Salim who has said the following: “Once I asked abu ‘Abd Allah (a.s.) ‘How often is this handshake?’ The Imam said, ‘It is just after going around a palm tree.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور معتبر عند ي  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (66/ 9)"
        ],
        "index": 2093,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:78:9",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَمْرِو بْنِ الْأَفْرَقِ عَنْ أَبِي عُبَيْدَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ يَنْبَغِي لِلْمُؤْمِنَيْنِ إِذَا تَوَارَى أَحَدُهُمَا عَنْ صَاحِبِهِ بِشَجَرَةٍ ثُمَّ الْتَقَيَا أَنْ يَتَصَافَحَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Sinan, from Amro Bin Al Afraq, from Abu Ubeyda, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘It is befitting for the <span class=\"iTxt\">Momineen</span> that, when one of them is left behind from his companions by a tree, then they both meet, they should shake hands’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from ‘Amr ibn al-Afraq from abu ‘Ubaydah from abu Ja’far (a.s.) who has said the following: “It is a good idea for the believers to shake each other’s hands after one of them remains out of sight, even because of a tree in between.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/67)"
        ],
        "index": 2094,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:78:10",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ مُحَمَّدِ بْنِ الْمُثَنَّى عَنْ أَبِيهِ عَنْ عُثْمَانَ بْنِ زَيْدٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِذَا لَقِيَ أَحَدُكُمْ أَخَاهُ فَلْيُسَلِّمْ عَلَيْهِ وَ لْيُصَافِحْهُ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ أَكْرَمَ بِذَلِكَ الْمَلَائِكَةَ فَاصْنَعُوا صُنْعَ الْمَلَائِكَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from one of his companions, from Muhammad Bin Al Msanna, from his father, from Usman Bin Zayd, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘When one of you meets his brother, so let him greet upon him, and let his shake his hand, for Allah<sup>azwj</sup> Mighty and Majestic Prestige the Angels with that, therefore do what the Angels are doing’."
          ],
          "en.sarwar": [
            "10. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from certain individuals of his people from Muhammad ibn al-Muthanna from his father from ‘Uthman ibn Zayd from Jabir from abu Ja’far (a.s.) who has said the following: “The Messenger of Allah has said, ‘Whenever any of you meets his Muslim brother (in belief) he should offer him the greeting of peace and shake his hand; Allah, the Most Majestic, the Most Holy, has honored the angels with it and you should also do what the angels do.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/67)"
        ],
        "index": 2095,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:78:11",
        "text": [
          "عَنْهُ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنِ ابْنِ بَقَّاحٍ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِذَا الْتَقَيْتُمْ فَتَلَاقَوْا بِالتَّسْلِيمِ وَ التَّصَافُحِ وَ إِذَا تَفَرَّقْتُمْ فَتَفَرَّقُوا بِالِاسْتِغْفَارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Muhammad Bin Ali, from Ibn Baqqah, from Sayf Bin Ameyra, from Amro Bin Shimr, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘When you are meeting each other, so meet with the greetings and the handshake; and when you are separating from each other, so separate with the seeking of the Forgiveness’."
          ],
          "en.sarwar": [
            "11. It is narrated from him (narrator of the Hadith above) from Muhammad ibn Ali from abu Baqqah from Sayf ibn ‘Amirah from ‘Amr ibn Shamir from Jabir from abu Ja’far (a.s.) who has said the following: “The Messenger of Allah has said, ‘Whenever you meet, you should do so by offering the greeting of peace and shaking hands and depart each other with a plea to Allah for forgiveness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (67/ 9)"
        ],
        "index": 2096,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:78:12",
        "text": [
          "عَنْهُ عَنْ مُوسَى بْنِ الْقَاسِمِ عَنْ جَدِّهِ مُعَاوِيَةَ بْنِ وَهْبٍ أَوْ غَيْرِهِ عَنْ رَزِينٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ الْمُسْلِمُونَ إِذَا غَزَوْا مَعَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ مَرُّوا بِمَكَانٍ كَثِيرِ الشَّجَرِ ثُمَّ خَرَجُوا إِلَى الْفَضَاءِ نَظَرَ بَعْضُهُمْ إِلَى بَعْضٍ فَتَصَافَحُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Musa Bin Al Qasim, from his grandfather Muawiya Bin Wahab, or someone else, from Razyn, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It was so that whenever the Muslims used to go on a military expedition with Rasool-Allah<sup>saww</sup>, and pass by a place with a lot of trees, then go out to the open sky, some of them used to look at the others and shake their hands’."
          ],
          "en.sarwar": [
            "12. It is narrated from him (narrator of the Hadith above) from Musa ibn al-Qasim from his grandfather, Mu’awiyah ibn Wahab or from others from Razin from abu ‘Abd Allah (a.s.) who has said the following: “During an armed expedition the Muslims, along with the Messenger of Allah, each time after passing through a wooded area on reaching the open would look at each other and shake hands.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (67/ 9)"
        ],
        "index": 2097,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:78:13",
        "text": [
          "عَنْهُ عَنْ أَبِيهِ عَمَّنْ حَدَّثَهُ عَنْ زَيْدِ بْنِ الْجَهْمِ الْهِلَالِيِّ عَنْ مَالِكِ بْنِ أَعْيَنَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِذَا صَافَحَ الرَّجُلُ صَاحِبَهُ فَالَّذِي يَلْزَمُ التَّصَافُحَ أَعْظَمُ أَجْراً مِنَ الَّذِي يَدَعُ أَلَا وَ إِنَّ الذُّنُوبَ لَتَتَحَاتُّ فِيمَا بَيْنَهُمْ حَتَّى لَا يَبْقَى ذَنْبٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from his father, from the one who narrated it, from Zayd Bin Al jahm Al Hilaly, from Malik Bin Ayn, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When the man shakes the hand of his companions, so the one who necessitated the handshake would have greater Recompense than the one who was invited (to it). Indeed! And the sins would erode during what is between them until there does not remain a sin’."
          ],
          "en.sarwar": [
            "13. It is narrated from him (narrator of the Hadith above) from his father from those who narrated to him from Zayd ibn al-Jahm al-Hilali from Malik ibn ‘Ayun from abu Ja’far (a.s.) who has said the following: “When two people shake hands, the one who continues holding his hand will receive greater reward than the one who releases early. However, the sins fall off of them until no sins remain.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (68/ 9)"
        ],
        "index": 2098,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:78:14",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ يَحْيَى بْنِ الْمُبَارَكِ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَنَظَرَ إِلَيَّ بِوَجْهٍ قَاطِبٍ فَقُلْتُ مَا الَّذِي غَيَّرَكَ لِي قَالَ الَّذِي غَيَّرَكَ لِإِخْوَانِكَ بَلَغَنِي يَا إِسْحَاقُ أَنَّكَ أَقْعَدْتَ بِبَابِكَ بَوَّاباً يَرُدُّ عَنْكَ فُقَرَاءَ الشِّيعَةِ فَقُلْتُ جُعِلْتُ فِدَاكَ إِنِّي خِفْتُ الشُّهْرَةَ ",
          "فَقَالَ أَ فَلَا خِفْتَ الْبَلِيَّةَ أَ وَ مَا عَلِمْتَ أَنَّ الْمُؤْمِنَيْنِ إِذَا الْتَقَيَا فَتَصَافَحَا أَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ الرَّحْمَةَ عَلَيْهِمَا فَكَانَتْ تِسْعَةٌ وَ تِسْعُونَ لِأَشَدِّهِمَا حُبّاً لِصَاحِبِهِ فَإِذَا تَوَافَقَا غَمَرَتْهُمَا الرَّحْمَةُ فَإِذَا قَعَدَا يَتَحَدَّثَانِ قَالَ الْحَفَظَةُ بَعْضُهَا لِبَعْضٍ اعْتَزِلُوا بِنَا فَلَعَلَّ لَهُمَا سِرّاً وَ قَدْ سَتَرَ اللَّهُ عَلَيْهِمَا ",
          "فَقُلْتُ أَ لَيْسَ اللَّهُ عَزَّ وَ جَلَّ يَقُولُ ما يَلْفِظُ مِنْ قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ فَقَالَ يَا إِسْحَاقُ إِنْ كَانَتِ الْحَفَظَةُ لَا تَسْمَعُ فَإِنَّ عَالِمَ السِّرِّ يَسْمَعُ وَ يَرَى ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Yahya Bin Al Mubarak, from Abdullah Bin Jabala, from Is’haq Bin Ammar who said, ",
            "‘I went over to Abu Abdullah<sup>asws</sup>. So he<sup>asws</sup> looked at me by his<sup>asws</sup> frowning face’. So I said, ‘What is that which caused you<sup>asws</sup> to change towards me?’ He<sup>asws</sup> said: ‘Due to your changing towards your brethren. It reached me<sup>asws</sup>, O Is’haq, that you have made a doorman to sit at your door repelling from you the poor Shias!’ So I said, ‘May I be sacrificed for you<sup>asws</sup>! I fear the publicity’. ",
            "So he<sup>asws</sup> said: ‘So you are not afraid of the calamities?’ And do you not know that the <span class=\"iTxt\">Momineen</span>, when two meet and shake hands, Allah<sup>azwj</sup> Mighty and Majestic Sends down the Mercy upon them both? And it is so that ninety-nine (per cent) is for the one who more intensely loves his companion. So when they are concordant, the Mercy submerges them. So when they are seated discussing, the preserving Angels say to each other: ‘Let us depart, for perhaps there is a private matter for them, and Allah<sup>azwj</sup> has Veiled upon them’. ",
            "So I said, ‘Isn’t Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic saying <span class=\"ibTxt\">[50:18] He utters not a word but there is by him a watcher at hand</span>?’ So he<sup style=\"font-weight: normal\">asws</sup> said: ‘O Is’haq! If it was so that the preserver (Recording Angel) does not hear, so the Knower of the secrets Hears and Sees’."
          ],
          "en.sarwar": [
            "14. A number of our people have narrated from Sahl ibn Ziyad from Yahya ibn al- Mubarak from ‘Abd Allah ibn Jabalah from Ishaq ibn ‘Ammar who has said the following: “Once I went to see abu ‘Abd Allah (a.s.) and he looked at me frowning. I asked, ‘May I know how I have disappointed you?’ The Imam said, ‘It is that which has changed you toward your brothers (in belief). It has come to my notice, O Ishaq, that you have appointed someone at your door to drive away the poor people of the Shi’a (our followers).’ 1 then said, ‘May Allah keep my soul in service for your cause, I was afraid of publicity.’ The Imam asked, ‘Why did you not fear misfortune? Did you not know that when two believing people meet and shake each other’s hands Allah, the Most Majestic, the Most Holy, sends blessings upon them and ninety-nine parts of the reward go to the one who loves his believing brother (in belief) more intensely. If they love equally blessings (of Allah) encompass them both? When they sit to speak to each other the guardian angels will say to each other, ‘Leave them alone, perhaps they have certain secret matters to discuss, and Allah has provided cover for them.’ I then said, ‘Has Allah not said, ‘. . . since the two scribes are sitting on each of his shoulders, he does not utter a word that is not recorded immediately by the watchful scribes.’ (50:17) The Imam said, ‘O Ishaq, if the scribes do not hear, the One who know all secrets hears and sees.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/70)"
        ],
        "index": 2099,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:78:15",
        "text": [
          "عَنْهُ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ أَيْمَنَ بْنِ مُحْرِزٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا صَافَحَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) رَجُلًا قَطُّ فَنَزَعَ يَدَهُ حَتَّى يَكُونَ هُوَ الَّذِي يَنْزِعُ يَدَهُ مِنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ismail Bin Mihran, from Ayman Bin Muhriz, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>azwj</sup> did not shake the hand of a man at all and removed his<sup>saww</sup> hand away until he was the one who removed his hand from his<sup>saww</sup> (first)’."
          ],
          "en.sarwar": [
            "15. It is narrated from him (narrator of the Hadith above) from Isma’il ibn Mehran from Ayman ibn Muhriz from abu ‘Abd Allah (a.s.) who has said the following: “When shaking hands with people, the Messenger of Allah had never been the first to discontinue the handshake.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (70/ 9)"
        ],
        "index": 2100,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:78:16",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ رِبْعِيٍّ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ إِنَّ اللَّهَ عَزَّ وَ جَلَّ لَا يُوصَفُ وَ كَيْفَ يُوصَفُ وَ قَالَ فِي كِتَابِهِ وَ ما قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ فَلَا يُوصَفُ بِقَدَرٍ إِلَّا كَانَ أَعْظَمَ مِنْ ذَلِكَ ",
          "وَ إِنَّ النَّبِيَّ ( صلى الله عليه وآله ) لَا يُوصَفُ وَ كَيْفَ يُوصَفُ عَبْدٌ احْتَجَبَ اللَّهُ عَزَّ وَ جَلَّ بِسَبْعٍ وَ جَعَلَ طَاعَتَهُ فِي الْأَرْضِ كَطَاعَتِهِ فِي السَّمَاءِ فَقَالَ وَ ما آتاكُمُ الرَّسُولُ فَخُذُوهُ وَ ما نَهاكُمْ عَنْهُ فَانْتَهُوا وَ مَنْ أَطَاعَ هَذَا فَقَدْ أَطَاعَنِي وَ مَنْ عَصَاهُ فَقَدْ عَصَانِي وَ فَوَّضَ إِلَيْهِ ",
          "وَ إِنَّا لَا نُوصَفُ وَ كَيْفَ يُوصَفُ قَوْمٌ رَفَعَ اللَّهُ عَنْهُمُ الرِّجْسَ وَ هُوَ الشَّكُّ ",
          "وَ الْمُؤْمِنُ لَا يُوصَفُ وَ إِنَّ الْمُؤْمِنَ لَيَلْقَى أَخَاهُ فَيُصَافِحُهُ فَلَا يَزَالُ اللَّهُ يَنْظُرُ إِلَيْهِمَا وَ الذُّنُوبُ تَتَحَاتُّ عَنْ وُجُوهِهِمَا كَمَا يَتَحَاتُّ الْوَرَقُ عَنِ الشَّجَرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad, from Rabie, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘Allah<sup>azwj</sup> Mighty and Majestic cannot be described. And how can He<sup>azwj</sup> be described, and He<sup>azwj</sup> Says in His<sup>azwj</sup> Book <span class=\"ibTxt\">[22:74] They are not estimating Allah with the estimation that is due to Him</span>. Thus, He<sup>asws</sup> would not be estimated except that He<sup>azwj</sup> would be Greater than that.",
            "And the Prophet<sup>saww</sup> cannot be described. How can one describe a servant whom Allah<sup>azwj</sup> Mighty and Majestic has Veiled by seven (veils), and Made obedience to him<sup>saww</sup> in the earth like being obedient to Him<sup>azwj</sup> in the sky, so He<sup>azwj</sup> Said <span class=\"ibTxt\">[59:7] and whatever the Rasool gives you, accept it, and from whatever he forbids you, keep back</span>, and the one who obeys this one so he has obeyed Me<sup>azwj</sup>, and the one who disobeys him<sup>saww</sup>, so he has disobeyed Me<sup>azwj</sup>, and Authorised him<sup>saww</sup>.",
            "And we<sup style=\"font-weight: normal\">asws</sup> cannot be described. And how can one describe a group of people whom Allah<sup style=\"font-weight: normal\">azwj</sup> has Kept the filth away from them<sup style=\"font-weight: normal\">asws</sup>, and is there (any) doubt (in it)?.",
            "And a <span class=\"iTxt\">Momin</span> cannot be described. And a <span class=\"iTxt\">Momin</span> meets his brother and shakes his hand, so Allah<sup style=\"font-weight: normal\">azwj</sup> does not Cease looking at them both, and sins erode from their faces just as the leaves erode from the tree’."
          ],
          "en.sarwar": [
            "16. Ali ibn Ibrahim has narrated from his father from Hammad from Rib’i from Zurara who has said the following: “I heard abu Ja’far (a.s.) saying, ‘Allah, the Most Majestic, the Most Holy, cannot be described and how can He be described when He says in His book, “They have not revered (honored and respected) Allah properly. . . .” (22:74) He cannot be described through measurement. He is greater than such measures of respect. The Holy Prophet cannot be described and respected. How can a servant (of Allah) be described whom Allah, the Most Majestic, the Most Holy, has veiled with seven things (no explanation for this seven is available). He has made obedience to him on earth like the obedience to His own self in heavens saying, ‘Take only what the Messenger gives to you and desist from what he forbids you,’ (59:7) whoever obeys him has obeyed Me and whoever disobeys him has disobeyed Me. He (Allah) made him to be the in charge person of the affairs. We also cannot be described and how can a people be described from whom Allah has removed all rijs (uncleanness), which, applies to doubt (doubt is uncleanness). The believing people also cannot be described. When the believer meets his brother (in belief) and they shake hands Allah continues looking at them and the sins fall from their faces like leaves fall off trees.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (72/ 9)"
        ],
        "index": 2101,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:78:17",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ فُضَيْلِ بْنِ عُثْمَانَ عَنْ أَبِي عُبَيْدَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ إِذَا الْتَقَى الْمُؤْمِنَانِ فَتَصَافَحَا أَقْبَلَ اللَّهُ بِوَجْهِهِ عَلَيْهِمَا وَ تَتَحَاتُّ الذُّنُوبُ عَنْ وُجُوهِهِمَا حَتَّى يَفْتَرِقَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Numan, from Fuzayl Bin Usman, from Abu Ubeyda who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘When the two <span class=\"iTxt\">Momineen</span> meet and shake hands, Allah<sup>azwj</sup> Turns by His<sup>azwj</sup> Face towards them both and the sins erode from their faces until they separate’."
          ],
          "en.sarwar": [
            "17. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Nu’man from Fudayl ibn ‘Uthman from abu ‘Ubaydah who has said the following: “I heard abu Ja’far (a.s.) saying, ‘When two believing people meet and shake hands, Allah turns to them with His face and sins began to fall from their faces until they depart from each other.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على الشهر    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/73)"
        ],
        "index": 2102,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:78:18",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تَصَافَحُوا فَإِنَّهَا تَذْهَبُ بِالسَّخِيمَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Shake hands, (surely) it would remove with the grudges’."
          ],
          "en.sarwar": [
            "18. Ali ibn Ibrahim has narrated from his father from al-Nawfali from al-Sakuni from abu ‘Abd Allah (a.s.) who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘Do shake hands, it removes jealousy.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على الشه ر   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/73)"
        ],
        "index": 2103,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:78:19",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الْأَشْعَرِيِّ عَنِ ابْنِ الْقَدَّاحِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَقِيَ النَّبِيُّ ( صلى الله عليه وآله ) حُذَيْفَةَ فَمَدَّ النَّبِيُّ ( صلى الله عليه وآله ) يَدَهُ فَكَفَّ حُذَيْفَةُ يَدَهُ فَقَالَ النَّبِيُّ ( صلى الله عليه وآله ) يَا حُذَيْفَةُ بَسَطْتُ يَدِي إِلَيْكَ فَكَفَفْتَ يَدَكَ عَنِّي فَقَالَ حُذَيْفَةُ يَا رَسُولَ اللَّهِ بِيَدِكَ الرَّغْبَةُ وَ لَكِنِّي كُنْتُ جُنُباً فَلَمْ أُحِبَّ أَنْ تَمَسَّ يَدِي يَدَكَ وَ أَنَا جُنُبٌ فَقَالَ النَّبِيُّ ( صلى الله عليه وآله ) أَ مَا تَعْلَمُ أَنَّ الْمُسْلِمَيْنِ إِذَا الْتَقَيَا فَتَصَافَحَا تَحَاتَّتْ ذُنُوبُهُمَا كَمَا يَتَحَاتُّ وَرَقُ الشَّجَرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ja’far Bin Muhammad Al Ashary, from Ibn Al Qaddah, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Prophet<sup>saww</sup> met Huzayfa. So the Prophet<sup>saww</sup> extended his<sup>saww</sup> hand, but Juzayfa withheld his hand. So the Prophet<sup>saww</sup> said: ‘O Huzayfa! I<sup>saww</sup> extended my<sup>saww</sup> hand towards you, but you withheld your hand from me<sup>saww</sup>?’ So Huzayfa said, ‘O Rasool-Allah<sup>saww</sup>! In you hand is the desire (to greet me), but I was with sexual impurity, so I did not like my hand to touch yours<sup>saww</sup> while I was with sexual impurity’. So the Prophet<sup>saww</sup> said: ‘But, do you not know that the Muslims, when two meet and shake hands, their sins fall off just like the falling off of the leaves of the tree?’"
          ],
          "en.sarwar": [
            "19. A number of our people have narrated from Sahl ibn Ziyad from Ja’far ibn Muhammad al-Ash’ari from ibn al-Qaddah from abu ‘Abd Allah (a.s.) who has said the following: “The Holy Prophet once met Hudhayfah and he extended his hand, but Hudhayfah held his hand back. The Holy Prophet asked, ‘How is it, O Hudhayfah, that I extended my hand to you and you held your hand back?’ Hudhayfah then said, ‘O Messenger of Allah, your hand is attractive but 1 had not taken the shower that was required of me due to carnal relations and I did not like to touch your hand with my hand that is not formally cleansed.’ The Holy Prophet then said, ‘Did you not know that when the Muslims meet and shake hands, their sins fall from them like leaves from trees?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (73/ 9)"
        ],
        "index": 2104,
        "local_index": 20,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:78:20",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ بَكْرِ بْنِ مُحَمَّدٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ اللَّهَ عَزَّ وَ جَلَّ لَا يَقْدِرُ أَحَدٌ قَدْرَهُ وَ كَذَلِكَ لَا يَقْدِرُ قَدْرَ نَبِيِّهِ وَ كَذَلِكَ لَا يَقْدِرُ قَدْرَ الْمُؤْمِنِ إِنَّهُ لَيَلْقَى أَخَاهُ فَيُصَافِحُهُ فَيَنْظُرُ اللَّهُ إِلَيْهِمَا وَ الذُّنُوبُ تَتَحَاتُّ عَنْ وُجُوهِهِمَا حَتَّى يَفْتَرِقَا كَمَا تَتَحَاتُّ الرِّيحَ الشَّدِيدَةَ الْوَرَقُ عَنِ الشَّجَرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Ahmad Bin Is’haq, from Bakr Bin Muhammad, from Is’haq Bin Ammar who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic, no one can estimate His<sup>azwj</sup> Self; and like that, no one can estimate the Self of His<sup>azwj</sup> Prophet<sup>saww</sup>; and like that no one can estimate the worth of the <span class=\"iTxt\">Momin</span>. He (the <span class=\"iTxt\">Momin</span>) meets his brother and shakes his hand, so Allah<sup>azwj</sup> looks at both of them, the sins fall off from their faces until they separate, just as the intense wind causes the leaves to fall off from the tree’."
          ],
          "en.sarwar": [
            "20. Al-Husayn ibn Muhammad has narrated from Ahmad ibn Ishaq from Bakr ibn Muhammad from Ishaq ibn ‘ Ammar who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘No one is able to describe Allah, the Most Majestic, the Most Holy, as He should be described. In the same way His Holy Prophet cannot be described. Also, the importance of the believing people cannot be described. When he meets his brother (in belief) and shakes hands, Allah looks toward them and sins began to fall from their faces like strong wind blows away leaves from trees, until they depart each other.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/74)"
        ],
        "index": 2105,
        "local_index": 21,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:78:21",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ رِفَاعَةَ قَالَ سَمِعْتُهُ يَقُولُ مُصَافَحَةُ الْمُؤْمِنِ أَفْضَلُ مِنْ مُصَافَحَةِ الْمَلَائِكَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Rifa’at who said, ",
            "‘I heard him<sup>asws</sup> saying: ‘The shaking of the hands of the <span class=\"iTxt\">Momin</span> is superior than the shaking of the hands of the Angels’."
          ],
          "en.sarwar": [
            "21. Ali ibn Ibrahim has narrated from his father from Muhammad ibn ‘Isa from Yunus from Rifa’a who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘A handshake of believing people is better than a handshake of angels.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:78",
  "kind": "verse_list"
}