{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 79"
        },
        "path": "/books/al-kafi:2:1:79",
        "titles": {
          "ar": "بَابُ الْمُعَانَقَةِ",
          "en": "Chapter 79 – The Embracing"
        }
      }
    ],
    "index": 267,
    "local_index": 79,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 80"
        },
        "path": "/books/al-kafi:2:1:80",
        "titles": {
          "ar": "بَابُ التَّقْبِيلِ",
          "en": "Chapter 80 – The Kissing"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 78"
        },
        "path": "/books/al-kafi:2:1:78",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ الْمُصَافَحَةِ</span>",
          "en": "Chapter 78 – The Handshake"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:79",
    "titles": {
      "ar": "بَابُ الْمُعَانَقَةِ",
      "en": "Chapter 79 – The Embracing"
    },
    "verse_count": 2,
    "verse_start_index": 2105,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/74)"
        ],
        "index": 2106,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:79:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ الْجُعْفِيِّ عَنْ أَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَا أَيُّمَا مُؤْمِنٍ خَرَجَ إِلَى أَخِيهِ يَزُورُهُ عَارِفاً بِحَقِّهِ كَتَبَ اللَّهُ لَهُ بِكُلِّ خُطْوَةٍ حَسَنَةً وَ مُحِيَتْ عَنْهُ سَيِّئَةٌ وَ رُفِعَتْ لَهُ دَرَجَةٌ وَ إِذَا طَرَقَ الْبَابَ فُتِحَتْ لَهُ أَبْوَابُ السَّمَاءِ ",
          "فَإِذَا الْتَقَيَا وَ تَصَافَحَا وَ تَعَانَقَا أَقْبَلَ اللَّهُ عَلَيْهِمَا بِوَجْهِهِ ثُمَّ بَاهَى بِهِمَا الْمَلَائِكَةَ فَيَقُولُ انْظُرُوا إِلَى عَبْدَيَّ تَزَاوَرَا وَ تَحَابَّا فِيَّ حَقٌّ عَلَيَّ أَلَّا أُعَذِّبَهُمَا بِالنَّارِ بَعْدَ هَذَا الْمَوْقِفِ ",
          "فَإِذَا انْصَرَفَ شَيَّعَهُ الْمَلَائِكَةُ عَدَدَ نَفَسِهِ وَ خُطَاهُ وَ كَلَامِهِ يَحْفَظُونَهُ مِنْ بَلَاءِ الدُّنْيَا وَ بَوَائِقِ الْآخِرَةِ إِلَى مِثْلِ تِلْكَ اللَّيْلَةِ مِنْ قَابِلٍ فَإِنْ مَاتَ فِيمَا بَيْنَهُمَا أُعْفِيَ مِنَ الْحِسَابِ وَ إِنْ كَانَ الْمَزُورُ يَعْرِفُ مِنْ حَقِّ الزَّائِرِ مَا عَرَفَهُ الزَّائِرُ مِنْ حَقِّ الْمَزُورِ كَانَ لَهُ مِثْلُ أَجْرِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail Bin Bazie, from Salih Bin Uqba, from Abdullah Bin Muhammad Al Ju’fy, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup> both having said: ‘Whichever <span class=\"iTxt\">Momin</span> goes out to his brother to visit him, recognising his right, Allah<sup>azwj</sup> would Write a good deed for him for every step taken, and Delete a sin from him, and Raise a level for him. When he knocks on the door, the Doors of the sky would be opened up for him. ",
            "So when they meet and shake hands and embrace, Allah<sup>azwj</sup> Turns towards them by His<sup>azwj</sup> Face, the Prides with the two of them to the Angels, so He<sup>azwj</sup> is Saying: “Look at My<sup>azwj</sup> servants visiting and loving each other regarding Me<sup>azwj</sup>. It is a right upon Me<sup>azwj</sup> that I<sup>azwj</sup> should not Punish the two of them with the Fire after this attitude. ",
            "So when he leaves, he would be escorted by the Angels of the number of his breaths, and his steps, and his words, protecting him from afflictions of the world and the hardships of the Hereafter, up to the like of that the next night. So if he dies during what is between the two, he would be Excused from the Reckoning. And if it was so that the visited on recognised the right of the visitor, what the visitor recognised from the right of the visited, there would be for him the like of his Recompense’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn Isma’il ibn Bazi’ from Salih ibn ‘Aqabah from ‘Abd Allah ibn Muhammad al-Ju’fi from abu Ja’far and abu ‘Abd Allah (a.s.) who has said the following: “Any believer who leaves (his home) to visit his brother (in belief) because of his knowledge of the importance of such person, Allah writes for him, for every step, one good deed, deletes one evil deed, and raises him one degree in meritorious status. When he knocks at his door, the doors to heaven open to him. When they meet, shake hands and hold each other in their arm Allah turns to them with His face and expresses pride because of them to the angels and says, ‘Look at My two servants who are visiting each other and love each other for My sake. It is a right upon Me not to make them suffer in fire in the hereafter. When he returns the angels, numbering equal to the number of his breaths, steps and words, will escort him. They protect him against the misfortunes of this world and the hardships of the hereafter up to a similar night next year. If he dies in between he will be exempt from presenting an account of his deeds. If the person visited would know the importance of the visitor as he knew of his importance, he also will have the same privileges.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/76)"
        ],
        "index": 2107,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:79:2",
        "refs": {
          "Mentions": [
            "/books/quran:50:18"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْمُؤْمِنَيْنِ إِذَا اعْتَنَقَا غَمَرَتْهُمَا الرَّحْمَةُ فَإِذَا الْتَزَمَا لَا يُرِيدَانِ بِذَلِكَ إِلَّا وَجْهَ اللَّهِ وَ لَا يُرِيدَانِ غَرَضاً مِنْ أَغْرَاضِ الدُّنْيَا قِيلَ لَهُمَا مَغْفُوراً لَكُمَا فَاسْتَأْنِفَا ",
          "فَإِذَا أَقْبَلَا عَلَى الْمُسَاءَلَةِ قَالَتِ الْمَلَائِكَةُ بَعْضُهَا لِبَعْضِ تَنَحَّوْا عَنْهُمَا فَإِنَّ لَهُمَا سِرّاً وَ قَدْ سَتَرَ اللَّهُ عَلَيْهِمَا ",
          "قَالَ إِسْحَاقُ فَقُلْتُ جُعِلْتُ فِدَاكَ فَلَا يُكْتَبُ عَلَيْهِمَا لَفْظُهُمَا وَ قَدْ قَالَ اللَّهُ عَزَّ وَ جَلَّ ما يَلْفِظُ مِنْ قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ قَالَ فَتَنَفَّسَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) الصُّعَدَاءَ ثُمَّ بَكَى حَتَّى اخْضَلَّتْ دُمُوعُهُ لِحْيَتَهُ وَ قَالَ يَا إِسْحَاقُ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى إِنَّمَا أَمَرَ الْمَلَائِكَةَ أَنْ تَعْتَزِلَ عَنِ الْمُؤْمِنَيْنِ إِذَا الْتَقَيَا إِجْلَالًا لَهُمَا وَ إِنَّهُ وَ إِنْ كَانَتِ الْمَلَائِكَةُ لَا تَكْتُبُ لَفْظَهُمَا وَ لَا تَعْرِفُ كَلَامَهُمَا فَإِنَّهُ يَعْرِفُهُ وَ يَحْفَظُهُ عَلَيْهِمَا عَالِمُ السِّرِّ وَ أَخْفَى ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his brother, from Safwan Bin Yahya, from Is’haq Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The <span class=\"iTxt\">Momin</span>, when two embrace, they would both be engulfed by the Mercy. So when both of the continue, not intending by that except for the Face of Allah<sup>azwj</sup>, and not intending any purpose from the purposes of the world, it would be Said to both of them: ‘You are both Forgiven your sins, so resume (anew again).",
            "So when they face each other upon the discussion, the Angels say to each other: ‘Leave them alone, for there is a private matter for them, and Allah<sup style=\"font-weight: normal\">azwj</sup> has Veiled upon them’. ",
            "Is’haq (the narrator) said, ‘So I said, ‘May I be sacrificed for you<sup style=\"font-weight: normal\">asws</sup>! So their word would not be written against them, and Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic has Said <span class=\"ibTxt\"><a href=\"/#/books/quran:50#h18\">[50:18]</a> He utters not a word but there is by him a watcher at hand</span>?’ So Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> took a sighing breath, then wept until his<sup style=\"font-weight: normal\">asws</sup> tears moistened his<sup style=\"font-weight: normal\">asws</sup> beard, and said: ‘O Is’haq! Allah<sup style=\"font-weight: normal\">azwj</sup> Blessed and High rather Commands the Angels that they should isolate themselves from the <span class=\"iTxt\">Momineen</span> when they meet due to their majesty; and it is such and if the Angels do not write their words and do not recognise their speech, so it is Recognised and Preserved upon them by the Knower of the secrets and the hidden matters’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from Safwan ibn Y ahya from Ishaq ibn ‘Ammar from abu ‘Abd Allah (a.s.) who has said the following: “When two believing people embrace each other, blessings engulf them. When they hold each other just for the sake of Allah and for no worldly reasons, it then will be said to them, ‘You are forgiven, resume your deeds.’ When they begin asking about each other the angels will say to each other, ‘Keep away from them; they have secret matters and Allah has granted them cover and privacy.’ I (Ishaq) then asked, ‘May Allah keep my soul in service for your cause, how is it that the angels do not write their words when Allah, the Most Majestic, the Most Holy, has said, “. . . he does not utter a word which is not recorded immediately by the watchful scribes”?’ (50: 17) The narrator has said that abu ‘Abd Allah (a.s.) took a breath of sigh and wept so much that his tears drenched his beard, and he said, ‘O Ishaq, Allah, the Most Blessed, the Most High, commands the angels to leave the believing people who meet each other alone just because of respect for them; otherwise, if the angels do not write their words or do not know them, He knows and saves them; He knows all the secrets and the hidden things.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:79",
  "kind": "verse_list"
}