{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:2:1", "titles": {"ar": "كتاب الإيمان و الكفر", "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"}}, {"indexed_titles": {"en": "Chapter 81"}, "path": "/books/al-kafi:2:1:81", "titles": {"ar": "بَابُ تَذَاكُرِ الْإِخْوَانِ", "en": "Chapter 81 – Remembering the brethren"}}], "index": 269, "local_index": 81, "part_type": "Chapter", "path": "/books/al-kafi:2:1:81", "titles": {"ar": "بَابُ تَذَاكُرِ الْإِخْوَانِ", "en": "Chapter 81 – Remembering the brethren"}, "verse_count": 7, "verse_start_index": 2113, "verses": [{"index": 2114, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:1:81:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ شِيعَتُنَا الرُّحَمَاءُ بَيْنَهُمُ الَّذِينَ إِذَا خَلَوْا ذَكَرُوا اللَّهَ إِنَّ ذِكْرَنَا مِنْ ذِكْرِ اللَّهِ إِنَّا إِذَا ذُكِرْنَا ذُكِرَ اللَّهُ وَ إِذَا ذُكِرَ عَدُوُّنَا ذُكِرَ الشَّيْطَانُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Fazalat Bin Ayoub, from Ali Bin Abu Hamza who said, \n‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Our<sup>asws</sup> Shia, there is the compassion between them, those when they are alone, are mentioning Allah<sup>azwj</sup>. Our<sup>asws</sup> mention is from the Mention of Allah<sup>azwj</sup>. Us<sup>asws</sup>, when we<sup>asws</sup> are mentioned, Allah<sup>azwj</sup> is Mentioned, and when our<sup>asws</sup> enemies are mentioned, the Satan<sup>la</sup> is mentioned’."}]}, {"index": 2115, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:1:81:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ يَزِيدَ بْنِ عَبْدِ الْمَلِكِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تَزَاوَرُوا فَإِنَّ فِي زِيَارَتِكُمْ إِحْيَاءً لِقُلُوبِكُمْ وَ ذِكْراً لِأَحَادِيثِنَا وَ أَحَادِيثُنَا تُعَطِّفُ بَعْضَكُمْ عَلَى بَعْضٍ فَإِنْ أَخَذْتُمْ بِهَا رَشَدْتُمْ وَ نَجَوْتُمْ وَ إِنْ تَرَكْتُمُوهَا ضَلَلْتُمْ وَ هَلَكْتُمْ فَخُذُوا بِهَا وَ أَنَا بِنَجَاتِكُمْ زَعِيمٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail Bin Bazie, from Salih Bin Uqba, from Yazeed Bin Abdul Malik, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Visit each other, for in your visitation there is a revival of your hearts; and mention our<sup>asws</sup> Ahadeeth, and (for) our<sup>asws</sup> Ahadeeth would incline you towards each other. So if you were to grab hold of it, you would be Guided and attain salvation, and if you were to neglect these, you would stray and be destroyed. Therefore grab hold of these, and I<sup>asws</sup> would be (personally) responsible for your salvation’."}]}, {"index": 2116, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:2:1:81:3", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْوَشَّاءِ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ عَبَّادِ بْنِ كَثِيرٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي مَرَرْتُ بِقَاصٍّ يَقُصُّ وَ هُوَ يَقُولُ هَذَا الْمَجْلِسُ الَّذِي لَا يَشْقَى بِهِ جَلِيسٌ قَالَ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) هَيْهَاتَ هَيْهَاتَ أَخْطَأَتْ أَسْتَاهُهُمُ الْحُفْرَةَ إِنَّ لِلَّهِ مَلَائِكَةً سَيَّاحِينَ سِوَى الْكِرَامِ الْكَاتِبِينَ فَإِذَا مَرُّوا بِقَوْمٍ يَذْكُرُونَ مُحَمَّداً وَ آلَ مُحَمَّدٍ قَالُوا قِفُوا فَقَدْ أَصَبْتُمْ حَاجَتَكُمْ فَيَجْلِسُونَ فَيَتَفَقَّهُونَ مَعَهُمْ فَإِذَا قَامُوا عَادُوا مَرْضَاهُمْ وَ شَهِدُوا جَنَائِزَهُمْ وَ تَعَاهَدُوا غَائِبَهُمْ فَذَلِكَ الْمَجْلِسُ الَّذِي لَا يَشْقَى بِهِ جَلِيسٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Al Washa’a, from Mansour Bin Yunus, from Abbad Bin Kaseer who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘I passed by a story-teller relating stories and he was saying, ‘This is the gathering which there is no wickedness with its gatherers’. So Abu Abdullah<sup>asws</sup> said: ‘Far be it! Far be it! He erred. Their gathering is the pit. For Allah<sup>azwj</sup> there are Angels who are coming, besides the two Honourable Recorders, so when they pass by a group of people mentioning Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, they are saying: ‘Pause, for you have achieved your need’. So they are being seated, and they are pondering along with them. So when they arise, they console their sick ones, and attend their funerals, and they are committing themselves to their absent ones. Thus, that is the gathering which there is no wickedness with its gatherers’."}]}, {"index": 2117, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:2:1:81:4", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْمُسْتَوْرِدِ النَّخَعِيِّ عَمَّنْ رَوَاهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ مِنَ الْمَلَائِكَةِ الَّذِينَ فِي السَّمَاءِ لَيَطَّلِعُونَ إِلَى الْوَاحِدِ وَ الِاثْنَيْنِ وَ الثَّلَاثَةِ وَ هُمْ يَذْكُرُونَ فَضْلَ آلِ مُحَمَّدٍ قَالَ فَتَقُولُ أَ مَا تَرَوْنَ إِلَى هَؤُلَاءِ فِي قِلَّتِهِمْ وَ كَثْرَةِ عَدُوِّهِمْ يَصِفُونَ فَضْلَ آلِ مُحَمَّدٍ ( صلى الله عليه وآله ) قَالَ فَتَقُولُ الطَّائِفَةُ الْأُخْرَى مِنَ الْمَلَائِكَةِ ذَلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ وَ اللَّهُ ذُو الْفَضْلِ الْعَظِيمِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Al Mustawrid Al Nakhaie, from the one who reported it, \n(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> having said: ‘From the Angels who are in the sky, they come to know of the one, and the two, and the three when they are mentioning the merits of the Progeny<sup style=\"font-weight: normal\">asws</sup> of Muhammad<sup style=\"font-weight: normal\">saww</sup>. So they are saying: ‘But, are you not seeing these who are in their few numbers, and the abundance of their enemies, describing the merits of the Progeny<sup style=\"font-weight: normal\">asws</sup> of Muhammad<sup style=\"font-weight: normal\">saww</sup>?’ So another group of Angels is saying: '<span class=\"ibTxt\">[62:4] That is Allah's Grace; He Grants it to whomsoever He Desires to, and Allah is the Lord of Magnificent Grace</span>’’."}]}, {"index": 2118, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:2:1:81:5", "text": "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ مُسْكَانَ عَنْ مُيَسِّرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ لِي أَ تَخْلُونَ وَ تَتَحَدَّثُونَ وَ تَقُولُونَ مَا شِئْتُمْ فَقُلْتُ إِي وَ اللَّهِ إِنَّا لَنَخْلُو وَ نَتَحَدَّثُ وَ نَقُولُ مَا شِئْنَا فَقَالَ أَمَا وَ اللَّهِ لَوَدِدْتُ أَنِّي مَعَكُمْ فِي بَعْضِ تِلْكَ الْمَوَاطِنِ أَمَا وَ اللَّهِ إِنِّي لَأُحِبُّ رِيحَكُمْ وَ أَرْوَاحَكُمْ وَ إِنَّكُمْ عَلَى دِينِ اللَّهِ وَ دِينِ مَلَائِكَتِهِ فَأَعِينُوا بِوَرَعٍ وَ اجْتِهَادٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Muskan, from Muyassar, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said to me: ‘Are you isolating yourselves, and discussing and saying whatever you so desire to?’ So I said, ‘Yes, by Allah<sup>azwj</sup>! We do isolate ourselves, and we discuss, and we are saying whatever we so desire to’. So he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! I<sup>asws</sup> would love to be with you in one of those places. But, by Allah<sup>azwj</sup>, I<sup>asws</sup> loved your aromas, and your spirits, and you all are upon the Religion of Allah<sup>azwj</sup> and the Religion of His<sup>azwj</sup> Angels, therefore Assist with piety and the striving’."}]}, {"index": 2119, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:2:1:81:6", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ يَحْيَى جَمِيعاً عَنْ عَلِيِّ بْنِ مُحَمَّدِ بْنِ سَعْدٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحْمَدَ بْنِ زَكَرِيَّا عَنْ مُحَمَّدِ بْنِ خَالِدِ بْنِ مَيْمُونٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ غِيَاثِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا اجْتَمَعَ ثَلَاثَةٌ مِنَ الْمُؤْمِنِينَ فَصَاعِداً إِلَّا حَضَرَ مِنَ الْمَلَائِكَةِ مِثْلُهُمْ فَإِنْ دَعَوْا بِخَيْرٍ أَمَّنُوا وَ إِنِ اسْتَعَاذُوا مِنْ شَرٍّ دَعَوُا اللَّهَ لِيَصْرِفَهُ عَنْهُمْ وَ إِنْ سَأَلُوا حَاجَةً تَشَفَّعُوا إِلَى اللَّهِ وَ سَأَلُوهُ قَضَاءَهَا \nوَ مَا اجْتَمَعَ ثَلَاثَةٌ مِنَ الْجَاحِدِينَ إِلَّا حَضَرَهُمْ عَشَرَةُ أَضْعَافِهِمْ مِنَ الشَّيَاطِينِ فَإِنْ تَكَلَّمُوا تَكَلَّمَ الشَّيْطَانُ بِنَحْوِ كَلَامِهِمْ وَ إِذَا ضَحِكُوا ضَحِكُوا مَعَهُمْ وَ إِذَا نَالُوا مِنْ أَوْلِيَاءِ اللَّهِ نَالُوا مَعَهُمْ فَمَنِ ابْتُلِيَ مِنَ الْمُؤْمِنِينَ بِهِمْ فَإِذَا خَاضُوا فِي ذَلِكَ فَلْيَقُمْ وَ لَا يَكُنْ شِرْكَ شَيْطَانٍ وَ لَا جَلِيسَهُ فَإِنَّ غَضَبَ اللَّهِ عَزَّ وَ جَلَّ لَا يَقُومُ لَهُ شَيْ‏ءٌ وَ لَعْنَتَهُ لَا يَرُدُّهَا شَيْ‏ءٌ \nثُمَّ قَالَ ( صلوات الله عليه ) فَإِنْ لَمْ يَسْتَطِعْ فَلْيُنْكِرْ بِقَلْبِهِ وَ لْيَقُمْ وَ لَوْ حَلْبَ شَاةٍ أَوْ فُوَاقَ نَاقَةٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, and Muhammad Bin Yahya, altogether from Ali Bin Muhammad Bin Sa’ad, from Muhammad Bin Muslim, from Ahmad Bin Zakariyya, from Muhammad Bin Khalid Bin Maymoun, from Abdullah Bin Sinan, from Giyas Bin Ibrahim, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There would not gather three <span class=\"iTxt\">Momineen</span> and upwards, except that the Angels the likes of their number would be present. So if they were to supplicate for goodness, they would be saying: ‘Ameen!’ and if they were to seek Refuge from the evil, they would supplicate to Allah<sup>azwj</sup> to Exchange it from them; and if they were to ask for a need, they would intercede to Allah<sup>azwj</sup> and ask Him<sup>azwj</sup> for its fulfilment.\nAnd there would not gather three from the renegades except ten times their number from the Satans<sup style=\"font-weight: normal\">la</sup> would be present. So if they were to speak, the Satan<sup style=\"font-weight: normal\">la</sup> would speak approximate to their speech; and when they laugh, he<sup style=\"font-weight: normal\">la</sup> would laugh along with them, and if they malign the Guardians<sup style=\"font-weight: normal\">asws</sup> of Allah<sup style=\"font-weight: normal\">azwj</sup>, he<sup style=\"font-weight: normal\">la</sup> malign them<sup style=\"font-weight: normal\">asws</sup> along with them. So the one who from the <span class=\"iTxt\">Momineen</span> who is involved with them, and when they indulge in that, so let him arise and do not become a participant with Satan<sup style=\"font-weight: normal\">la</sup>, and not be seated, for if Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic is Wrathful, nothing would be able to withstand it, and nothing can repel His<sup style=\"font-weight: normal\">azwj</sup> Curse’. \nThen he<sup style=\"font-weight: normal\">asws</sup> said: ‘So if he is not able to (arise), so let him deny it in his heart, and let him arise (for a while), and even if it is for a time it takes to milk a sheep, or a hiccup of a camel’."}]}, {"index": 2120, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:2:1:81:7", "text": "وَ بِهَذَا الْإِسْنَادِ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ مُحَمَّدِ بْنِ مَحْفُوظٍ عَنْ أَبِي الْمَغْرَاءِ قَالَ سَمِعْتُ أَبَا الْحَسَنِ ( عليه السلام ) يَقُولُ لَيْسَ شَيْ‏ءٌ أَنْكَى لِإِبْلِيسَ وَ جُنُودِهِ مِنْ زِيَارَةِ الْإِخْوَانِ فِي اللَّهِ بَعْضِهِمْ لِبَعْضٍ قَالَ وَ إِنَّ الْمُؤْمِنَيْنِ يَلْتَقِيَانِ فَيَذْكُرَانِ اللَّهَ ثُمَّ يَذْكُرَانِ فَضْلَنَا أَهْلَ الْبَيْتِ فَلَا يَبْقَى عَلَى وَجْهِ إِبْلِيسَ مُضْغَةُ لَحْمٍ إِلَّا تَخَدَّدُ حَتَّى إِنَّ رُوحَهُ لَتَسْتَغِيثُ مِنْ شِدَّةِ مَا يَجِدُ مِنَ الْأَلَمِ فَتَحُسُّ مَلَائِكَةُ السَّمَاءِ وَ خُزَّانُ الْجِنَانِ فَيَلْعَنُونَهُ حَتَّى لَا يَبْقَى مَلَكٌ مُقَرَّبٌ إِلَّا لَعَنَهُ فَيَقَعُ خَاسِئاً حَسِيراً مَدْحُوراً .", "translations": [{"lang": "en", "name": "hubeali", "text": "And by this chain, from Muhammad Bin Suleyman, from Muhammad Bin Mahfouz, from Abu Al Magra’a who said, \n‘I heard Abu Al-Hassan<sup>asws</sup> saying: ‘There is nothing more horrible to Iblees<sup>la</sup> and his<sup>la</sup> army than the visitation of the brethren visiting each other regarding Allah<sup>azwj</sup>. And if two <span class=\"iTxt\">Momineen</span> are meeting and they are mentioning Allah<sup>azwj</sup>, then they are mentioning our<sup>asws</sup> merits of the People<sup>asws</sup> of the Household, so there would not remain a single lump of flesh upon the face of Iblees<sup>la</sup> except that it would wrinkle, to the extent that his<sup>la</sup> spirit screams for help from the intensity of what he<sup>la</sup> feels from the pain. So the Angels of the sky and the treasurers of the Gardens sense it and they are cursing him<sup>la</sup> until there does not remains a single Angel of Proximity except that he curses him<sup>la</sup>. So he<sup>la</sup> falls down abased, sorrowful, defeated’."}]}]}, "index": "al-kafi:2:1:81", "kind": "verse_list"}