{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 82"
        },
        "path": "/books/al-kafi:2:1:82",
        "titles": {
          "ar": "بَابُ إِدْخَالِ السُّرُورِ عَلَى الْمُؤْمِنِينَ",
          "en": "Chapter 82 – Causing the gladness to enter upon the Momineen"
        }
      }
    ],
    "index": 270,
    "local_index": 82,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 83"
        },
        "path": "/books/al-kafi:2:1:83",
        "titles": {
          "ar": "بَابُ قَضَاءِ حَاجَةِ الْمُؤْمِنِ",
          "en": "Chapter 83 – Fulfilling the need of the Momin"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 81"
        },
        "path": "/books/al-kafi:2:1:81",
        "titles": {
          "ar": "بَابُ تَذَاكُرِ الْإِخْوَانِ",
          "en": "Chapter 81 – Remembering the brethren"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:82",
    "titles": {
      "ar": "بَابُ إِدْخَالِ السُّرُورِ عَلَى الْمُؤْمِنِينَ",
      "en": "Chapter 82 – Causing the gladness to enter upon the Momineen"
    },
    "verse_count": 16,
    "verse_start_index": 2120,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (90/ 9)"
        ],
        "index": 2121,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:82:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى جَمِيعاً عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ سَرَّ مُؤْمِناً فَقَدْ سَرَّنِي وَ مَنْ سَرَّنِي فَقَدْ سَرَّ اللَّهَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, and Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, altogether from Al Hassan Bin Mahboub, from Abu Hamza Al Sumaly who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘Rasool-Allah<sup>saww</sup> said: ‘The one who pleases a <span class=\"iTxt\">Momin</span> so he has pleased me<sup>asws</sup>, and the one who pleases me<sup>saww</sup>, so he has pleased Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad and Muhammad ibn Yahya from Ahmad ibn Muhammad ibn ‘Isa all from al-Hassan ibn Mahbub from abu Hamza al-Thumali who has said the following: “I heard abu Ja’far (a.s.) saying, ‘The messenger of Allah has said, “Whoever pleases a believer has pleased me, and whoever, pleases me has pleased Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (90/ 9)"
        ],
        "index": 2122,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:82:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ رَجُلٍ مِنْ أَهْلِ الْكُوفَةِ يُكَنَّى أَبَا مُحَمَّدٍ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ تَبَسُّمُ الرَّجُلِ فِي وَجْهِ أَخِيهِ حَسَنَةٌ وَ صَرْفُ الْقَذَى عَنْهُ حَسَنَةٌ وَ مَا عُبِدَ اللَّهُ بِشَيْ‏ءٍ أَحَبَّ إِلَى اللَّهِ مِنْ إِدْخَالِ السُّرُورِ عَلَى الْمُؤْمِنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad bin Muhammad Bin Khalid, from his father, from a man from the people of Al Kufa teknonymed as Abu Muhammad, from Amro Bin Shimr, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The smile of the man in the face of his brother is a good deed, and removing the speck from him is a good deed, and a servant will not (be able to) worship Allah<sup>azwj</sup> with something more Beloved to Allah<sup>azwj</sup> than causing the gladness to enter upon the <span class=\"iTxt\">Momin</span>’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father from a man from the people of al-Kufah called abu Muhammad from ‘Amr ibn Shamir from Jabir from abu Ja’far (a.s.) who has said the following: “The smiling of a man for his brother (in belief) is a good deed, so also is removing a speck from him (his eyes). Allah is not worshipped with anything more beloved to Him than bringing joy to the heart of a believer.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/91)"
        ],
        "index": 2123,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:82:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ عُبَيْدِ اللَّهِ بْنِ الْوَلِيدِ الْوَصَّافِيِّ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ إِنَّ فِيمَا نَاجَى اللَّهُ عَزَّ وَ جَلَّ بِهِ عَبْدَهُ مُوسَى ( عليه السلام ) قَالَ إِنَّ لِي عِبَاداً أُبِيحُهُمْ جَنَّتِي وَ أُحَكِّمُهُمْ فِيهَا قَالَ يَا رَبِّ وَ مَنْ هَؤُلَاءِ الَّذِينَ تُبِيحُهُمْ جَنَّتَكَ وَ تُحَكِّمُهُمْ فِيهَا قَالَ مَنْ أَدْخَلَ عَلَى مُؤْمِنٍ سُرُوراً ",
          "ثُمَّ قَالَ إِنَّ مُؤْمِناً كَانَ فِي مَمْلَكَةِ جَبَّارٍ فَوَلَعَ بِهِ فَهَرَبَ مِنْهُ إِلَى دَارِ الشِّرْكِ فَنَزَلَ بِرَجُلٍ مِنْ أَهْلِ الشِّرْكِ فَأَظَلَّهُ وَ أَرْفَقَهُ وَ أَضَافَهُ ",
          "فَلَمَّا حَضَرَهُ الْمَوْتُ أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ وَ عِزَّتِي وَ جَلَالِي لَوْ كَانَ لَكَ فِي جَنَّتِي مَسْكَنٌ لَأَسْكَنْتُكَ فِيهَا وَ لَكِنَّهَا مُحَرَّمَةٌ عَلَى مَنْ مَاتَ بِي مُشْرِكاً وَ لَكِنْ يَا نَارُ هِيدِيهِ وَ لَا تُؤْذِيهِ وَ يُؤْتَى بِرِزْقِهِ طَرَفَيِ النَّهَارِ قُلْتُ مِنَ الْجَنَّةِ قَالَ مِنْ حَيْثُ شَاءَ اللَّهُ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Sinan, from Abdullah Bin Muskan, from Ubeydullah Bin Al Waleed Al Wassafy who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘Among what Allah<sup>azwj</sup> Mighty and Majestic Whispered with to His<sup>azwj</sup> servant Musa<sup>as</sup> was that He<sup>azwj</sup> Said: “For Me<sup>azwj</sup> there are such servant that I<sup>azwj</sup> would be Allotting them My<sup>azwj</sup> Paradise and Making them rulers therein”. He<sup>as</sup> said: ‘O Lord<sup>azwj</sup>! And who are they whom You<sup>azwj</sup> would be Allotting Your<sup>azwj</sup> Paradise to and Making them to rule therein?’ He<sup>azwj</sup> Said: “The one who cause the gladness to enter into the <span class=\"iTxt\">Momin</span>”’. ",
            "Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘There was a <span class=\"iTxt\">Momin</span> who was in the kingdom of a tyrant, and he was scared of it and fled from him to a house (domain) of the Polytheists and lodged with a man from the Polytheist people. So he shaded him, and was kind to him, and entertained him. ",
            "So when the death presented itself to him, Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic Revealed unto him: “By My<sup style=\"font-weight: normal\">azwj</sup> Honour and My<sup style=\"font-weight: normal\">azwj</sup> Majesty! Had there been a dwelling for you in My<sup style=\"font-weight: normal\">azwj</sup> Paradise, I<sup style=\"font-weight: normal\">azwj</sup> would have Settled you therein. But, it is Prohibited upon the one who dies having associated with Me<sup style=\"font-weight: normal\">azwj</sup>. But, O Fire! Settle down and do not harm him!” And they would be coming with his sustenance at the two ends of the day (morning and evening)’. I said, ‘From the Paradise?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘From wherever Allah<sup style=\"font-weight: normal\">azwj</sup> so Desires it’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from ‘Abd Allah ibn Muskan from ‘Ubayd Allah ibn al- Walid al-Wassafi who has said the following: “I heard abu Ja’far (a.s.) saying, ‘Of the private conversations that Allah, the Most Majestic, the Most Holy, made with Moses was this: ‘Of my servants there are those to whom I have allotted my paradise and made them rule it.’ Moses then asked, Lord, ‘Who are these people to whom you have allotted your paradise and made them rule it?’ The Lord said, ‘They are those who bring joy to the heart of a believer.’ He then said, ‘A believing man once lived in the domain of a tyrant and because of fear he moved away from the tyrant into a pagan’s land and he found lodging with a pagan who provided him shadow, came forward with friendly behavior and entertained him as a guest. When death approached the pagan man, Allah, the Most Majestic, the Most Holy, inspired him, ‘I swear by my Majesty and Glory, had I any place for you in my paradise I would have admitted you therein, but it is forbidden for those who die as pagans. However, O fire, calm down and do not hurt him. His sustenance will be provided in both ends of the day.’ I then asked the Imam, ‘(Does it come) from paradise?’ The Imam said, ‘It comes from wherever Allah wishes.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/92)"
        ],
        "index": 2124,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:82:4",
        "text": [
          "عَنْهُ عَنْ بَكْرِ بْنِ صَالِحٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ عَبْدِ اللَّهِ بْنِ إِبْرَاهِيمَ عَنْ عَلِيِّ بْنِ أَبِي عَلِيٍّ عَنْ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ( صلوات الله عليه )  قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ أَحَبَّ الْأَعْمَالِ إِلَى اللَّهِ عَزَّ وَ جَلَّ إِدْخَالُ السُّرُورِ عَلَى الْمُؤْمِنِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Bakr Bin Salih, from Al Hassan Bin Ali, from Abdullah Bin Ibrahim, from Ali Bin Abu Ali, from Abu Ali, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, from his<sup>asws</sup> father<sup>asws</sup>, from Ali<sup>asws</sup> Bin Al Husayn<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The most Beloved of the deeds to Allah<sup>azwj</sup> Mighty and Majestic is causing the gladness to enter upon the <span class=\"iTxt\">Momineen</span>’."
          ],
          "en.sarwar": [
            "4. It is narrated from him (narrator of the Hadith above) from Bakr ibn Salih from al-Hassan ibn Ali from ‘Abd Allah ibn Ibrahim from Ali ibn abu Ali from abu ‘Abd Allah from his father from Ali ibn al-Husayn (a.s.) who has said the following: ‘‘The Messenger of Allah has said, ‘Of the most beloved deed to Allah, the Most Majestic, the Most Holy, is bringing joy to the heart of the believer.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/92)"
        ],
        "index": 2125,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:82:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى دَاوُدَ ( عليه السلام ) إِنَّ الْعَبْدَ مِنْ عِبَادِي لَيَأْتِينِي بِالْحَسَنَةِ فَأُبِيحُهُ جَنَّتِي فَقَالَ دَاوُدُ يَا رَبِّ وَ مَا تِلْكَ الْحَسَنَةُ قَالَ يُدْخِلُ عَلَى عَبْدِيَ الْمُؤْمِنِ سُرُوراً وَ لَوْ بِتَمْرَةٍ قَالَ دَاوُدُ يَا رَبِّ حَقٌّ لِمَنْ عَرَفَكَ أَنْ لَا يَقْطَعَ رَجَاءَهُ مِنْكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> having said: ‘Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic Revealed unto Dawood<sup style=\"font-weight: normal\">as</sup>: “The servant from My<sup style=\"font-weight: normal\">azwj</sup> servants, let him come to Me<sup style=\"font-weight: normal\">azwj</sup> with the good deeds, so I<sup style=\"font-weight: normal\">azwj</sup> can Gift My<sup style=\"font-weight: normal\">azwj</sup> Paradise to him”. So Dawood<sup style=\"font-weight: normal\">as</sup> said: ‘O Lord<sup style=\"font-weight: normal\">azwj</sup>! And what is that deed?’ He<sup style=\"font-weight: normal\">azwj</sup> Said: “Causing the gladness to enter upon My<sup style=\"font-weight: normal\">azwj</sup> believeing servant, and even if it be by a date”. Dawood<sup style=\"font-weight: normal\">as</sup> said: ‘O Lord<sup style=\"font-weight: normal\">azwj</sup>! It is true for the one who recognises You<sup style=\"font-weight: normal\">azwj</sup> that he would not cut off his hopes from You<sup style=\"font-weight: normal\">azwj</sup>’’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ibn Mahbub from ‘Abd Allah ibn Sinan from abu ‘Abd Allah (a.s.) who has said the following: ‘‘Allah, the Most Majestic, the Most Holy, sent revelations to David that said, ‘One of my servants may come to Me with a good deed and I admit him in paradise.’ David asked, ‘Lord, what is that good deed?’ The Lord said, ‘It is bringing joy to the heart of my believing servant even if it is by one piece of date.’ David then said, ‘Lord, it is very true that one who comes to know You must not lose hope of Your kindness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور معتبر عند ي   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/93)"
        ],
        "index": 2126,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:82:6",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ خَلَفِ بْنِ حَمَّادٍ عَنْ مُفَضَّلِ بْنِ عُمَرَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا يَرَى أَحَدُكُمْ إِذَا أَدْخَلَ عَلَى مُؤْمِنٍ سُرُوراً أَنَّهُ عَلَيْهِ أَدْخَلَهُ فَقَطْ بَلْ وَ اللَّهِ عَلَيْنَا بَلْ وَ اللَّهِ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Khalaf Bin Hammad, from Mufazzal Bin Umar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one of you who causes the gladness to enter upon a <span class=\"iTxt\">Momin</span> should not view that he has entered it upon him only. But, by Allah<sup>azwj</sup>, upon us<sup>asws</sup> (as well). By Allah<sup>azwj</sup>! Upon Rasool-Allah<sup>saww</sup> (as well)’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father from Khalaf ibn Hammad from Mufaddal ibn ‘Umar from abu ‘Abd Allah (a.s.) who has said the following: “One of you must not think that when he brings joy to the heart of a believer he has brought joy to his heart only. I swear by Allah, in fact, he has done so to our hearts and also, I swear by Allah, he has done so to (the heart of) the Messenger of Allah.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/93)"
        ],
        "index": 2127,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:82:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ أَبِي الْجَارُودِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ إِنَّ أَحَبَّ الْأَعْمَالِ إِلَى اللَّهِ عَزَّ وَ جَلَّ إِدْخَالُ السُّرُورِ عَلَى الْمُؤْمِنِ شَبْعَةُ مُسْلِمٍ أَوْ قَضَاءُ دَيْنِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazan, altogether from Ibn Abu Umeyr, from Ibrahim Bin Abdul Hameed, from Abu Al Jaroud, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘The most beloved of the deeds to Allah<sup>azwj</sup> Mighty and Majestic is to cause the entering of the gladness upon the <span class=\"iTxt\">Momin</span>, satiating a Muslim, or fulfilling his debts’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Isma’il from Fadl ibn Shadhan all from ibn abu ‘Umayr from Ibrahim ibn ‘Abd al-Hamid from abu al-Jarud from abu Ja’far (a.s.) who has said the following: “I heard abu Ja’far (a.s.) saying, ‘The most beloved of deeds to Allah, the Most Majestic, the Most Holy, is bringing joy to the heart of a believer, by means of satisfying his hunger or paying off his debt.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/93)"
        ],
        "index": 2128,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:82:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ سَدِيرٍ الصَّيْرَفِيِّ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فِي حَدِيثٍ طَوِيلٍ إِذَا بَعَثَ اللَّهُ الْمُؤْمِنَ مِنْ قَبْرِهِ خَرَجَ مَعَهُ مِثَالٌ يَقْدُمُ أَمَامَهُ كُلَّمَا رَأَى الْمُؤْمِنُ هَوْلًا مِنْ أَهْوَالِ يَوْمِ الْقِيَامَةِ قَالَ لَهُ الْمِثَالُ لَا تَفْزَعْ وَ لَا تَحْزَنْ وَ أَبْشِرْ بِالسُّرُورِ وَ الْكَرَامَةِ مِنَ اللَّهِ عَزَّ وَ جَلَّ ",
          "حَتَّى يَقِفَ بَيْنَ يَدَيِ اللَّهِ عَزَّ وَ جَلَّ فَيُحَاسِبُهُ حِسَاباً يَسِيراً وَ يَأْمُرُ بِهِ إِلَى الْجَنَّةِ وَ الْمِثَالُ أَمَامَهُ فَيَقُولُ لَهُ الْمُؤْمِنُ يَرْحَمُكَ اللَّهُ نِعْمَ الْخَارِجُ خَرَجْتَ مَعِي مِنْ قَبْرِي وَ مَا زِلْتَ تُبَشِّرُنِي بِالسُّرُورِ وَ الْكَرَامَةِ مِنَ اللَّهِ حَتَّى رَأَيْتُ ذَلِكَ ",
          "فَيَقُولُ مَنْ أَنْتَ فَيَقُولُ أَنَا السُّرُورُ الَّذِي كُنْتَ أَدْخَلْتَ عَلَى أَخِيكَ الْمُؤْمِنِ فِي الدُّنْيَا خَلَقَنِي اللَّهُ عَزَّ وَ جَلَّ مِنْهُ لِأُبَشِّرَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Mahboub, from Sadeyr Al Sayrafi who said, ",
            "‘Abu Abdullah<sup>asws</sup> said in a lengthy Hadeeth: ‘When Allah<sup>azwj</sup> will Resurrect the <span class=\"iTxt\">Momin</span> from his grave, a resemblance would come out along with him, walking in front of him. Every time the <span class=\"iTxt\">Momin</span> sees a horror from the horrors of the Day of Judgement, the resemblance would say to him, ‘Do not panic, and do not grieve, and receive glad tidings of the gladness and the prestige from Allah<sup>azwj</sup> Mighty and Majestic’. ",
            "Until when he pauses in front of Allah<sup>azwj</sup> Mighty and Majestic, so He<sup>azwj</sup> would Reckon him with an easy Reckoning, and Command with him (to be taken to) the Paradise, and the resemblance would be in front of him. So the <span class=\"iTxt\">Momin</span> would be saying to him, ‘May Allah<sup>azwj</sup> have Mercy on you! It was a good exit that you came out along with me from my grave, and you have not ceased giving me glad tidings with the gladness and the prestige from Allah<sup>azwj</sup> I saw that’. ",
            "And he would (also) be saying, ‘Who are you?’ So it would be saying, ‘I am the gladness which you caused to enter upon your <span class=\"iTxt\">Momin</span> brother in the world. Allah<sup>azwj</sup> Mighty and Majestic Created me from it (the gladness) in order to give you the glad tidings’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Mahbub from Sadir al-Sayrafi who has said the following: “Abu ‘Abd Allah (a.s.) has said in a long Hadith, ‘When Allah raises a believer from his grave along with him, in front, comes out a form. When and wherever the believer faces a frightening scene of the scenes of the Day of Judgment the form says to him, “Do not be afraid or sad. There is good and joyful news of the honor from Allah, the Most Majestic, the Most Holy,” until he is before Allah, the Most Majestic, the Most Holy. He is held accountable very lightly and then is admitted into paradise with the form in front of him. The believer then says to the form, ‘May Allah grant you blessings, you have been a very good companion ever since you came out with me from my grave and continued speaking of joy and honor from Allah until 1 experienced them. Who are you?’ The form will say, ‘I am the joy that you had brought to the heart of your believing brother (in belief) in the worldly life. Allah, the Most Majestic, the Most Holy, created me from it to carry good news to you.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (95/ 9)"
        ],
        "index": 2129,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:82:9",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنِ السَّيَّارِيِّ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ قَالَ كَانَ النَّجَاشِيُّ وَ هُوَ رَجُلٌ مِنَ الدَّهَاقِينِ عَامِلًا عَلَى الْأَهْوَازِ وَ فَارِسَ فَقَالَ بَعْضُ أَهْلِ عَمَلِهِ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ فِي دِيوَانِ النَّجَاشِيِّ عَلَيَّ خَرَاجاً وَ هُوَ مُؤْمِنٌ يَدِينُ بِطَاعَتِكَ فَإِنْ رَأَيْتَ أَنْ تَكْتُبَ لِي إِلَيْهِ كِتَاباً ",
          "قَالَ فَكَتَبَ إِلَيْهِ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ سُرَّ أَخَاكَ يَسُرَّكَ اللَّه. قَالَ فَلَمَّا وَرَدَ الْكِتَابُ عَلَيْهِ دَخَلَ عَلَيْهِ وَ هُوَ فِي مَجْلِسِهِ فَلَمَّا خَلَا نَاوَلَهُ الْكِتَابَ وَ قَالَ هَذَا كِتَابُ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَبَّلَهُ وَ وَضَعَهُ عَلَى عَيْنَيْهِ وَ قَالَ لَهُ مَا حَاجَتُكَ قَالَ خَرَاجٌ عَلَيَّ فِي دِيوَانِكَ فَقَالَ لَهُ وَ كَمْ هُوَ قَالَ عَشَرَةُ آلَافِ دِرْهَمٍ",
          "فَدَعَا كَاتِبَهُ وَ أَمَرَهُ بِأَدَائِهَا عَنْهُ ثُمَّ أَخْرَجَهُ مِنْهَا وَ أَمَرَ أَنْ يُثْبِتَهَا لَهُ لِقَابِلٍ ثُمَّ قَالَ لَهُ سَرَرْتُكَ فَقَالَ نَعَمْ جُعِلْتُ فِدَاكَ ثُمَّ أَمَرَ لَهُ بِمَرْكَبٍ وَ جَارِيَةٍ وَ غُلَامٍ وَ أَمَرَ لَهُ بِتَخْتِ ثِيَابٍ فِي كُلِّ ذَلِكَ يَقُولُ لَهُ هَلْ سَرَرْتُكَ فَيَقُولُ نَعَمْ جُعِلْتُ فِدَاكَ فَكُلَّمَا قَالَ نَعَمْ زَادَهُ حَتَّى فَرَغَ ثُمَّ قَالَ لَهُ احْمِلْ فُرُشَ هَذَا الْبَيْتِ الَّذِي كُنْتَ جَالِساً فِيهِ حِينَ دَفَعْتَ إِلَيَّ كِتَابَ مَوْلَايَ الَّذِي نَاوَلْتَنِي فِيهِ وَ ارْفَعْ إِلَيَّ حَوَائِجَكَ",
          "قَالَ فَفَعَلَ وَ خَرَجَ الرَّجُلُ فَصَارَ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) بَعْدَ ذَلِكَ فَحَدَّثَهُ الرَّجُلُ بِالْحَدِيثِ عَلَى جِهَتِهِ فَجَعَلَ يُسَرُّ بِمَا فَعَلَ فَقَالَ الرَّجُلُ يَا ابْنَ رَسُولِ اللَّهِ كَأَنَّهُ قَدْ سَرَّكَ مَا فَعَلَ بِي فَقَالَ إِي وَ اللَّهِ لَقَدْ سَرَّ اللَّهَ وَ رَسُولَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Al Sayyari, from Muhammad Bin Jamhour who said, ",
            "‘It was so that Al-Najjashy, and he was a man from the land owners, working upon Al Ahvaz and Persia. So one of the people of his workforce said to Abu Abdullah<sup>asws</sup>, ‘In the register of Al-Najjashy is taxation due upon me, and he is a <span class=\"iTxt\">Momin</span> with a Religion in your<sup>asws</sup> obedience. So if you<sup>asws</sup> see (fit), if you<sup>asws</sup> could write for me a letter to him’. ",
            "He (the narrator) said, ‘So Abu Abdullah<sup>asws</sup> wrote to him: ‘In the Name of Allah<sup>azwj</sup> the Beneficent, the Merciful. Cause gladness to your brother, Allah<sup>azwj</sup> will Cause you gladness’. So when the letter was given to him, he went over to him, and he was in his gathering. So when he was alone, he gave him the letter and said, ‘This is a letter of Abu Abdullah<sup>asws</sup>’. So he kissed it and place it upon his eyes, and said to him, ‘What is your need?’ He said, ‘Taxation upon me in your register’. So he said to him, ‘And how much is it?’ He said, ‘Ten thousand Dirhams’. ",
            "So he called over his scribe and instructed him with write it off from him. Then he to him out from it and instructed that it be affirmed for him in the future (no taxes to pay). Then he said to him, ‘Have I gladdened you?’ So he said, ‘Yes, may I be sacrificed for you’. Then he ordered for him with a ride and a maid and a slave, and ordered for him a set of clothes, and during each of that he was saying to him, ‘Have I gladdened you?’ So he was saying, ‘Yes, may I be sacrificed for you’. So, every time he said, ‘Yes’, he increased it for him until he was free. Then he said to him, ‘Carry (take away) this furnishing of the house which you were seated upon where you handed over to me a letter of my Master<sup style=\"font-weight: normal\">asws</sup> which you brought wherein you raise your need to me’. ",
            "He (the narrator) said, ‘So he did and the man went out. So the man came over to Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> after that and narrated to him<sup style=\"font-weight: normal\">asws</sup> of the narration upon its aspect. So he<sup style=\"font-weight: normal\">asws</sup> went on to become joyful with what was done. So the man said, ‘O son<sup style=\"font-weight: normal\">asws</sup> of Rasool-Allah<sup style=\"font-weight: normal\">saww</sup>! It is as if he has cause you<sup style=\"font-weight: normal\">asws</sup> to be glad, what he did with me’. So he<sup style=\"font-weight: normal\">asws</sup> said: ‘Yes, by Allah<sup style=\"font-weight: normal\">azwj</sup>! He has caused Allah<sup style=\"font-weight: normal\">azwj</sup> and His<sup style=\"font-weight: normal\">azwj</sup> Rasool<sup style=\"font-weight: normal\">saww</sup> to be joyful’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Muhammad ibn Ahmad from al- Sayyari from Muhammad ibn Jumhur who has said the following: “Al-Najashiy, is a man of the landlords (community) and an agent in al-Ahwaz and Fars. Certain persons of his workers once said to abu ‘Abd Allah (a.s.) ‘In the office of al-Najashiy taxes are recorded as due by me. He is a believer and believes in obedience to you. If you consider it proper, write for me a letter to him (to relieve me of the taxes).’ Abu ‘Abd Allah (a.s.) wrote him, ‘(I begin) in the name of Allah, the Beneficent the Merciful. Send joy to the heart of your brother, Allah will send joy to your heart.’ ‘‘When the letter came he took it to him in his office. When it was private he gave him the letter and said, ‘This is a letter from abu ‘Abd Allah, recipient of divine supreme covenant.’ He kissed the letter and placed it on his eyes and asked, ‘What do you want?’ He said, ‘Certain taxes are recorded in your office as due by me.’ He then asked, ‘How much are they?’ He said, ‘Ten thousand dirham.’ He then called his secretary and told him to write off all the taxes due by him, and he said not to levy any taxes on him in future. Then he asked, ‘Did I make you happy now?’ He replied, ‘Yes, may I be your servant.’ He then ordered to give him an animal so he could ride, a maid servant, a male servant and a set of dress and for each item he would ask, ‘Did I make you happy?’ He would say, ‘Yes, may I be your servant.’ As long as he said, ‘Yes, he increased his gifts until the last gift. He then said, ‘Take the floor covering of this house wherein you gave me the letter of my master and asked me to help you in your needs. ’ “I (the narrator) did so as I was told and then went to abu ‘Abd Allah (a.s.) and informed him of his story the way it had happened. The Imam enjoyed what he had done. 1 then said, ‘O descendent of the Messenger of Allah, it seems he has made you happy by means of his favors to me. ’ The Imam said, ‘Yes, by Allah, he certainly has made Allah and the Messenger of Allah happy.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول بسندي ه  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (98/ 9)"
        ],
        "index": 2130,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:82:10",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ فَضَّالٍ عَنْ مَنْصُورٍ عَنْ عَمَّارِ بْنِ أَبِي الْيَقْظَانِ عَنْ أَبَانِ بْنِ تَغْلِبَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ حَقِّ الْمُؤْمِنِ عَلَى الْمُؤْمِنِ قَالَ فَقَالَ حَقُّ الْمُؤْمِنِ عَلَى الْمُؤْمِنِ أَعْظَمُ مِنْ ذَلِكَ لَوْ حَدَّثْتُكُمْ لَكَفَرْتُمْ إِنَّ الْمُؤْمِنَ إِذَا خَرَجَ مِنْ قَبْرِهِ خَرَجَ مَعَهُ مِثَالٌ مِنْ قَبْرِهِ يَقُولُ لَهُ أَبْشِرْ بِالْكَرَامَةِ مِنَ اللَّهِ وَ السُّرُورِ فَيَقُولُ لَهُ بَشَّرَكَ اللَّهُ بِخَيْرٍ ",
          "قَالَ ثُمَّ يَمْضِي مَعَهُ يُبَشِّرُهُ بِمِثْلِ مَا قَالَ وَ إِذَا مَرَّ بِهَوْلٍ قَالَ لَيْسَ هَذَا لَكَ وَ إِذَا مَرَّ بِخَيْرٍ قَالَ هَذَا لَكَ فَلَا يَزَالُ مَعَهُ يُؤْمِنُهُ مِمَّا يَخَافُ وَ يُبَشِّرُهُ بِمَا يُحِبُّ حَتَّى يَقِفَ مَعَهُ بَيْنَ يَدَيِ اللَّهِ عَزَّ وَ جَلَّ ",
          "فَإِذَا أَمَرَ بِهِ إِلَى الْجَنَّةِ قَالَ لَهُ الْمِثَالُ أَبْشِرْ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ قَدْ أَمَرَ بِكَ إِلَى الْجَنَّةِ قَالَ فَيَقُولُ مَنْ أَنْتَ رَحِمَكَ اللَّهُ تُبَشِّرُنِي مِنْ حِينِ خَرَجْتُ مِنْ قَبْرِي وَ آنَسْتَنِي فِي طَرِيقِي وَ خَبَّرْتَنِي عَنْ رَبِّي قَالَ فَيَقُولُ أَنَا السُّرُورُ الَّذِي كُنْتَ تُدْخِلُهُ عَلَى إِخْوَانِكَ فِي الدُّنْيَا خُلِقْتُ مِنْهُ لِأُبَشِّرَكَ وَ أُونِسَ وَحْشَتَكَ .",
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Al Hassan Bin Ali Bin Fazzal, from Mansour, from Ammar Bin Abu Al Yaqzaan, from Aban Bin Taghlub who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the rights of the <span class=\"iTxt\">Momin</span> upon the <span class=\"iTxt\">Momin</span>. So he<sup>asws</sup> said: ‘The rights of the <span class=\"iTxt\">Momin</span> upon the <span class=\"iTxt\">Momin</span> are greater than that. If I<sup>asws</sup> were to narrate (these) to you, you would disbelieve. When the <span class=\"iTxt\">Momin</span> will come out from his grave, a resemblance would come out along with him from his grave saying to him, ‘Receive glad tidings with the prestige and the gladness from Allah<sup>azwj</sup>’. So he would be saying to it, ‘May there be glad tidings for you from Allah<sup>azwj</sup> with goodness’. ",
            "He<sup>asws</sup> said: ‘Then it would go with him, giving him glad tidings of the like of what I<sup>asws</sup> said, and whenever he passes by a horror, it would say, ‘This is not for you’; and whenever he passes by a goodness, it would say, ‘This is for you’. So it would not cease to be with him, securing him from whatever he fears, and giving him glad tidings with what he likes, until it would pause with him in front of Allah<sup>azwj</sup> Mighty and Majestic.",
            "So when He<sup style=\"font-weight: normal\">azwj</sup> Commands with him (to go to) the Paradise, the resemblance would say to him, ‘Receive glad tidings, for Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic has Commanded with you to the Paradise’. He would say, ‘May Allah<sup style=\"font-weight: normal\">azwj</sup> have Mercy on you, who are you. You have been giving me glad tidings from when you came out from my grave and comforted me in my way, and informed me about my Lord<sup style=\"font-weight: normal\">azwj</sup>’. So it would be saying, ‘I am the gladness which you used to cause entering upon your brethren in the world. Allah<sup style=\"font-weight: normal\">azwj</sup> Created me from it in order to give you glad tidings, and comfort you in your loneliness’. ",
            "<span style=\"font-size: small\">Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal</span> – similar to it."
          ],
          "en.sarwar": [
            "10. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from al- Hassan ibn Ali ibn Faddal from Mansur from ‘Ammar ibn abu al-Yaqzan from Aban ibn Taghlib who has said the following: “Once I asked abu ‘Abd Allah (a.s.) about the rights of a believer on another believer. He has said that the Imam said, ‘The right of a believer on a believer is greater than that (description). If I tell you about it you will become unbelievers. When a believer comes out of his grave a form comes out with him and says, “There is good news of honor and happiness for you from Allah.” He then says to the form, ‘May Allah give you good news.’ He then moves with him and gives him good news as before and as they come across a frightening scene of the Day of Judgment the form says this is not against you. As they come across a good thing the form says this is for you. The form remains with him, giving him comfort and good news of what he loves until it stands with him before Allah, the Most Majestic, the Most Holy, where He orders for him to be taken to paradise. The form says to him, ‘Good news for you; Allah, the Most Majestic, the Most Holy, has ordered that you be admitted in paradise. ’ “The Imam said, ‘He asks, “Who are you, may Allah grant you favors? You have been giving me good news from the time you came out with me from my grave. On the way you have been giving me comfort and informed me of the decision of my Lord?’” The form then says, ‘I am the joy that you had sent to the heart of your believing brothers (in belief) in the worldly life. I was created from it to give you good news and comfort you in frightening conditions.”’ Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal a similar Hadith. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (99/ 9)"
        ],
        "index": 2131,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:82:11",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَحَبُّ الْأَعْمَالِ إِلَى اللَّهِ سُرُورٌ [الَّذِي] تُدْخِلُهُ عَلَى الْمُؤْمِنِ تَطْرُدُ عَنْهُ جَوْعَتَهُ أَوْ تَكْشِفُ عَنْهُ كُرْبَتَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Malik Bin Atiyya, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The deeds most Beloved to Allah<sup>azwj</sup> is the gladness which you cause to enter upon the <span class=\"iTxt\">Momin</span>, repelling his hunger from him, or relieving his worries from him’."
          ],
          "en.sarwar": [
            "11. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Malik ibn ‘Atiyyah from abu ‘Abd Allah (a.s.) who has said the following: “The Messenger of Allah has said, ‘The most beloved deed to Allah is the joy that you send to the heart of a believer by means of removing his hunger or relieving him of his suffering.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/99)"
        ],
        "index": 2132,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:82:12",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ الْحَكَمِ بْنِ مِسْكِينٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ أَدْخَلَ عَلَى مُؤْمِنٍ سُرُوراً خَلَقَ اللَّهُ عَزَّ وَ جَلَّ مِنْ ذَلِكَ السُّرُورِ خَلْقاً فَيَلْقَاهُ عِنْدَ مَوْتِهِ فَيَقُولُ لَهُ أَبْشِرْ يَا وَلِيَّ اللَّهِ بِكَرَامَةٍ مِنَ اللَّهِ وَ رِضْوَانٍ ",
          "ثُمَّ لَا يَزَالُ مَعَهُ حَتَّى يَدْخُلَهُ قَبْرَهُ [يَلْقَاهُ] فَيَقُولُ لَهُ مِثْلَ ذَلِكَ فَإِذَا بُعِثَ يَلْقَاهُ فَيَقُولُ لَهُ مِثْلَ ذَلِكَ ثُمَّ لَا يَزَالُ مَعَهُ عِنْدَ كُلِّ هَوْلٍ يُبَشِّرُهُ وَ يَقُولُ لَهُ مِثْلَ ذَلِكَ فَيَقُولُ لَهُ مَنْ أَنْتَ رَحِمَكَ اللَّهُ فَيَقُولُ أَنَا السُّرُورُ الَّذِي أَدْخَلْتَهُ عَلَى فُلَانٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Al Hakam Bin Miskeen, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who causes gladness to enter upon the <span class=\"iTxt\">Momin</span>, Allah<sup>azwj</sup> Mighty and Majestic would Create the gladness from that as a creature. So it would meet him during his death and it would be saying to him, ‘Receive glad tidings, O friend of Allah<sup>azwj</sup>, with the prestige from Allah<sup>azwj</sup>, and Pleasure’. ",
            "Then it would not cease to be with him until it enters into his grave (meeting him), and it would be saying to him similar to that. So when he is Resurrected, it would meet him and would be saying to him similar to that. Then it would not cease to be with him during every horror, giving him glad tidings and saying to him similar to that. So he would be saying to it, ‘Who are you? May Allah<sup style=\"font-weight: normal\">azwj</sup> have Mercy on you’. So it would be saying, ‘I am the gladness which you cause to enter upon so and so’."
          ],
          "en.sarwar": [
            "12. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from al- Hakam ibn Miskin from abu ‘Abd Allah (a.s.) who has said the following: “Whoever sends joy to the heart of a believing man, Allah, the Most Majestic, the Most Holy, creates from that joy a creature that meets him at the time of his death and says to him, ‘Good news for you, O friend of Allah, with honor from Allah and His happiness with you. The form (creature) remains with him until he is placed in his grave and speaks to him of similar good tidings. When he is raised out of the grave the form meets him and speaks to him of similar good things and remains with him. On coming across frightening things of the Day of Judgment the form gives him good news. He then asks the form, ‘Who are you, may Allah grant you favors?’ The form says, ‘I am the joy that you sent to the heart of so and so.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/99)"
        ],
        "index": 2133,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:82:13",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ سَعْدَانَ بْنِ مُسْلِمٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ كَانَ رَجُلٌ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَرَأَ هَذِهِ الْآيَةَ وَ الَّذِينَ يُؤْذُونَ الْمُؤْمِنِينَ وَ الْمُؤْمِناتِ بِغَيْرِ مَا اكْتَسَبُوا فَقَدِ احْتَمَلُوا بُهْتاناً وَ إِثْماً مُبِيناً قَالَ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَمَا ثَوَابُ مَنْ أَدْخَلَ عَلَيْهِ السُّرُورَ فَقُلْتُ جُعِلْتُ فِدَاكَ عَشْرُ حَسَنَاتٍ فَقَالَ إِي وَ اللَّهِ وَ أَلْفُ أَلْفِ حَسَنَةٍ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Ahmad Bin Is’haq, from Sa’dan Bin Muslim, from Abdullah Bin Sinan who said, ",
            "‘A man was in the presence of Abu Abdullah<sup>asws</sup>, and he recited this Verse <span class=\"ibTxt\">[33:58] And those who hurt the believing men and the believing women without them being deserving of it, they are guilty indeed of a false accusation and a manifest sin</span>. So Abu Abdullah<sup>asws</sup> said: ‘So what is the Reward for the one who causes the gladness to enter upon him?’ So I said, ‘May I be sacrificed for you<sup>asws</sup>! Ten good deeds’. So he<sup>asws</sup> said: ‘Yes, by Allah<sup>azwj</sup>, and a thousand, thousand (million) good deeds’."
          ],
          "en.sarwar": [
            "13. Al-Husayn ibn Muhammad has narrated from Ahmad ibn Ishaq from Sa’dan ibn Muslim from ‘Abd Allah ibn Sinan who has said the following: “Once a man, in the presence of abu ‘Abd Allah (a.s.) recited this verse of the Holy Quran: ‘Those who annoy the believing men and women without reason will bear the sin for a false accusation, a manifest offense.’ (33:58) The narrator has said that abu ‘Abd Allah (a.s.) then asked, ‘What then is the reward for sending joy to his heart?’ I said, ‘May Allah keep my soul in service for your cause, ten good deeds.’ The Imam said, ‘Yes, by Allah, it is one million good deeds.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (100/ 9)"
        ],
        "index": 2134,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:82:14",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ أُورَمَةَ عَنْ عَلِيِّ بْنِ يَحْيَى عَنِ الْوَلِيدِ بْنِ الْعَلَاءِ عَنِ ابْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ أَدْخَلَ السُّرُورَ عَلَى مُؤْمِنٍ فَقَدْ أَدْخَلَهُ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ مَنْ أَدْخَلَهُ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَدْ وَصَلَ ذَلِكَ إِلَى اللَّهِ وَ كَذَلِكَ مَنْ أَدْخَلَ عَلَيْهِ كَرْباً ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Awrama, from Ali Bin Yahya, from Al Waleed Bin Al A’ala, from Ibn Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who causes the gladness to enter upon a <span class=\"iTxt\">Momin</span>, so he has extended it towards Rasool-Allah<sup>saww</sup>; and the one who enters it upon Rasool-Allah<sup>saww</sup>, so he has linked that to Allah<sup>azwj</sup>. And similar to that is the one who enter the worries upon him (the <span class=\"iTxt\">Momin</span>)’."
          ],
          "en.sarwar": [
            "14. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn ‘Uramah from Ali ibn Yahya from al-Walid ibn al-‘Ala’ from ibn Sinan from abu ‘Abd Allah (a.s.) who has said the following: “Whoever sends joy to the heart of a believer he certainly has sent joy to the heart of the Messenger of Allah. If one sends joy to the heart of the Messenger of Allah such joy reaches Allah. The same is true of causing pain to the heart of a believer.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/101)"
        ],
        "index": 2135,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:82:15",
        "text": [
          "عَنْهُ عَنْ إِسْمَاعِيلَ بْنِ مَنْصُورٍ عَنِ الْمُفَضَّلِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَيُّمَا مُسْلِمٍ لَقِيَ مُسْلِماً فَسَرَّهُ سَرَّهُ اللَّهُ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ismail Bin Mansour, from Al Mufazzal, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whichever Muslim meets a Muslim, so he gladdens him, Allah<sup>azwj</sup> Mighty and Majestic would Gladden him’."
          ],
          "en.sarwar": [
            "15. It is narrated from him (narrator of the Hadith above) from Isma’il ibn Mansur from al-Mufaddal from abu ‘Abd Allah (a.s.) who has said the following: “Any Muslim who, on his meeting another Muslim, sends joy to his heart, Allah, the Most Majestic, the Most Holy, sends joy to his (initiator of joy) heart.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (101/ 9)"
        ],
        "index": 2136,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:82:16",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مِنْ أَحَبِّ الْأَعْمَالِ إِلَى اللَّهِ عَزَّ وَ جَلَّ إِدْخَالُ السُّرُورِ عَلَى الْمُؤْمِنِ إِشْبَاعُ جَوْعَتِهِ أَوْ تَنْفِيسُ كُرْبَتِهِ أَوْ قَضَاءُ دَيْنِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Al Hakam, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The most Beloved of the deeds to Allah<sup>azwj</sup> Mighty and Majestic is the entering of the gladness upon the <span class=\"iTxt\">Momin</span> – satiating his hunger, or relieving his distress, or fulfilling his debts’."
          ],
          "en.sarwar": [
            "16. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hisham ibn al-Hakam from abu ‘Abd Allah (a.s.) who has said the following: “Of the most beloved deeds to Allah, the Most Majestic, the Most Holy, is sending joy to the heart of a believer, by means of satisfying his hunger, relief for his suffering or paying off his debt.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:82",
  "kind": "verse_list"
}