{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:2:1", "titles": {"ar": "كتاب الإيمان و الكفر", "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"}}, {"indexed_titles": {"en": "Chapter 91"}, "path": "/books/al-kafi:2:1:91", "titles": {"ar": "بَابُ الْإِصْلَاحِ بَيْنَ النَّاسِ", "en": "Chapter 91 – The Reconciliation between the people"}}], "index": 279, "local_index": 91, "part_type": "Chapter", "path": "/books/al-kafi:2:1:91", "titles": {"ar": "بَابُ الْإِصْلَاحِ بَيْنَ النَّاسِ", "en": "Chapter 91 – The Reconciliation between the people"}, "verse_count": 7, "verse_start_index": 2206, "verses": [{"index": 2207, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:1:91:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ حَمَّادِ بْنِ أَبِي طَلْحَةَ عَنْ حَبِيبٍ الْأَحْوَلِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ صَدَقَةٌ يُحِبُّهَا اللَّهُ إِصْلَاحُ بَيْنِ النَّاسِ إِذَا تَفَاسَدُوا وَ تَقَارُبُ بَيْنِهِمْ إِذَا تَبَاعَدُوا .\nعَنْهُ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ حُذَيْفَةَ بْنِ مَنْصُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مِثْلَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Sinan, from Hammad Bin Abu Talha, from Habeeb Al Ahowl who said, \n‘I heard Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> saying: ‘A charity which Allah<sup style=\"font-weight: normal\">azwj</sup> Loves is reconciling between the people when their (relationship) is spoilt, and bringing them close when they are distant’.\n<span style=\"font-size: small\">From him, from Muhammad Bin Sinan, from Huzeyfa Bin Mansour,</span> from Abu Abdullah<sup>asws</sup> – similar to it."}]}, {"index": 2208, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:1:91:2", "text": "عَنْهُ عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَأَنْ أُصْلِحَ بَيْنَ اثْنَيْنِ أَحَبُّ إِلَيَّ مِنْ أَنْ أَتَصَدَّقَ بِدِينَارَيْنِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Ibn Mahboub, from Hisham Bin Salim, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘If I<sup>asws</sup> were to reconcile between two, it would be more beloved to me<sup>asws</sup> than if I were to give charity with two Dinars’."}]}, {"index": 2209, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:2:1:91:3", "text": "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ سِنَانٍ عَنْ مُفَضَّلٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا رَأَيْتَ بَيْنَ اثْنَيْنِ مِنْ شِيعَتِنَا مُنَازَعَةً فَافْتَدِهَا مِنْ مَالِي .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Ahmad Bin Muhammad, from Ibn Sinan, from Mufazzal who said, \n‘Abu Abdullah<sup>asws</sup> said: ‘When you see a dispute between two from our<sup>asws</sup> Shia, so redeem it from my<sup>asws</sup> wealth’."}]}, {"index": 2210, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:2:1:91:4", "text": "ابْنُ سِنَانٍ عَنْ أَبِي حَنِيفَةَ سَابِقِ الْحَاجِّ قَالَ مَرَّ بِنَا الْمُفَضَّلُ وَ أَنَا وَ خَتَنِي نَتَشَاجَرُ فِي مِيرَاثٍ فَوَقَفَ عَلَيْنَا سَاعَةً ثُمَّ قَالَ لَنَا تَعَالَوْا إِلَى الْمَنْزِلِ فَأَتَيْنَاهُ فَأَصْلَحَ بَيْنَنَا بِأَرْبَعِمِائَةِ دِرْهَمٍ فَدَفَعَهَا إِلَيْنَا مِنْ عِنْدِهِ حَتَّى إِذَا اسْتَوْثَقَ كُلُّ وَاحِدٍ مِنَّا مِنْ صَاحِبِهِ قَالَ أَمَا إِنَّهَا لَيْسَتْ مِنْ مَالِي وَ لَكِنْ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَمَرَنِي إِذَا تَنَازَعَ رَجُلَانِ مِنْ أَصْحَابِنَا فِي شَيْ‏ءٍ أَنْ أُصْلِحَ بَيْنَهُمَا وَ أَفْتَدِيَهَا مِنْ مَالِهِ فَهَذَا مِنْ مَالِ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ibn Sinan, from Abu Haneefa Sabiq Al Hajj who said, \n‘Al-Mufazzal passed by us and I and my brother in law were quarrelling regarding an inheritance. So he paused by us for a while, then said to us, ‘Come, let us go to the house. So we went with him and he reconciled between us with four hundred Dirhams. So he handed it over from himself until each one of us was confident from his companion. He said, ‘But, it is from my wealth, but Abu Abdullah<sup>asws</sup> ordered me that whenever two men from our Shias dispute with regards to anything, that I should reconcile between them and redeem if from his<sup>asws</sup> wealth. Thus, this is from the wealth of Abu Abdullah<sup>asws</sup>’."}]}, {"index": 2211, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:2:1:91:5", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْمُصْلِحُ لَيْسَ بِكَاذِبٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira, from Muawiya Bin Ammar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The reconciliation is not (supposed to be) with lies’."}]}, {"index": 2212, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:2:1:91:6", "text": "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَلِيِّ بْنِ إِسْمَاعِيلَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ لا تَجْعَلُوا اللَّهَ عُرْضَةً لِأَيْمانِكُمْ أَنْ تَبَرُّوا وَ تَتَّقُوا وَ تُصْلِحُوا بَيْنَ النَّاسِ قَالَ إِذَا دُعِيتَ لِصُلْحٍ بَيْنَ اثْنَيْنِ فَلَا تَقُلْ عَلَيَّ يَمِينٌ أَلَّا أَفْعَلَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali, from his father, from Ibn Abu Umeyr, from Ali Bin Ismail, from Is’haq Bin Amaar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic \n<span class=\"ibTxt\">[2:224] And make not Allah because of your swearing (by Him) an obstacle to your doing good and acting rightly and reconciling between the people</span>. He<sup>asws</sup> said: ‘Whenever you are called to effect reconciliation between two, so do not say, ‘Upon me there is an oath. I will not do it’’."}]}, {"index": 2213, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:2:1:91:7", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ أَوْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَبْلِغْ عَنِّي كَذَا وَ كَذَا فِي أَشْيَاءَ أَمَرَ بِهَا قُلْتُ فَأُبَلِّغُهُمْ عَنْكَ وَ أَقُولُ عَنِّي مَا قُلْتَ لِي وَ غَيْرَ الَّذِي قُلْتَ قَالَ نَعَمْ إِنَّ الْمُصْلِحَ لَيْسَ بِكَذَّابٍ إِنَّمَا هُوَ الصُّلْحُ لَيْسَ بِكَذِبٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ibn Mahboub, from Muawiya Bin Wahab, or Muawiya Bin Ammar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Deliver from me<sup>asws</sup> such and such regarding things I<sup>asws</sup> am ordering with’. I said, ‘So I should deliver them from you<sup>asws</sup>, and can I be saying from me what you<sup>asws</sup> said to me, and other than that which you<sup>asws</sup> said?’ He<sup>asws</sup> said: ‘Yes. The reconciler is not a liar. But rather, it is the reconciliation not being with a lie’."}]}]}, "index": "al-kafi:2:1:91", "kind": "verse_list"}