{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 92"
        },
        "path": "/books/al-kafi:2:1:92",
        "titles": {
          "ar": "بَابٌ فِي إِحْيَاءِ الْمُؤْمِنِ",
          "en": "Chapter 92 – Regarding revival of the Momin"
        }
      }
    ],
    "index": 280,
    "local_index": 92,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 93"
        },
        "path": "/books/al-kafi:2:1:93",
        "titles": {
          "ar": "بَابٌ فِي الدُّعَاءِ لِلْأَهْلِ إِلَى الْإِيمَانِ",
          "en": "Chapter 93 – Regarding the inviting the people to the Emān"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 91"
        },
        "path": "/books/al-kafi:2:1:91",
        "titles": {
          "ar": "بَابُ الْإِصْلَاحِ بَيْنَ النَّاسِ",
          "en": "Chapter 91 – The Reconciliation between the people"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:92",
    "titles": {
      "ar": "بَابٌ فِي إِحْيَاءِ الْمُؤْمِنِ",
      "en": "Chapter 92 – Regarding revival of the Momin"
    },
    "verse_count": 3,
    "verse_start_index": 2213,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/149)"
        ],
        "index": 2214,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:92:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ مَنْ قَتَلَ نَفْساً بِغَيْرِ نَفْسٍ فَكَأَنَّما قَتَلَ النَّاسَ جَمِيعاً وَ مَنْ أَحْياها فَكَأَنَّما أَحْيَا النَّاسَ جَمِيعاً قَالَ مَنْ أَخْرَجَهَا مِنْ ضَلَالٍ إِلَى هُدًى فَكَأَنَّمَا أَحْيَاهَا وَ مَنْ أَخْرَجَهَا مِنْ هُدًى إِلَى ضَلَالٍ فَقَدْ قَتَلَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from Sama’at, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘(What about) the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[5:32] whoever slays a soul, it is as though he slew all the people; and whoever keeps it alive, it is as though he kept alive all the people</span>?’ He<sup>asws</sup> said: ‘The one who extracts it from straying to Guidance, so it is as if he revived it, and the one who extracts it from Guidance to straying, so he has killed it’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ‘Uthman ibn ‘Isa from Sama’a from abu ‘Abd Allah (a.s.) who has said the following: “I asked him about the words of Allah, the Most Majestic, the Most Holy, ‘. . . We made it a law for the children of Israel that the killing of a person for reasons other than legal retaliation or for stopping corruption in the land is as great a sin as murdering all of mankind. However, to save a life would be as great a virtue as to save all of mankind...’ (5:32) “The Imam said, ‘Whoever takes people from straying to guidance, has given them life. Whoever takes people from guidance to straying, it is as if he has murdered all of them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق بسندي ه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/151)"
        ],
        "index": 2215,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:92:2",
        "text": [
          "عَنْهُ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ فُضَيْلِ بْنِ يَسَارٍ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) قَوْلُ اللَّهِ عَزَّ وَ جَلَّ فِي كِتَابِهِ وَ مَنْ أَحْياها فَكَأَنَّما أَحْيَا النَّاسَ جَمِيعاً قَالَ مِنْ حَرَقٍ أَوْ غَرَقٍ قُلْتُ فَمَنْ أَخْرَجَهَا مِنْ ضَلَالٍ إِلَى هُدًى قَالَ ذَاكَ تَأْوِيلُهَا الْأَعْظَمُ .",
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ وَ عَبْدِ اللَّهِ ابْنَيْ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانٍ مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ali Bin Al Hakam, from Aban Bin Usman, from Fuzayl Bin Yasaar who said, ",
            "‘I said to Abu Ja’far<sup style=\"font-weight: normal\">asws</sup>, ‘(What about) the Words of Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic in His<sup style=\"font-weight: normal\">azwj</sup> Book <span class=\"ibTxt\">[5:32] and whoever keeps it alive, it is as though he kept alive all the people</span>?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘From burning or drowning’. I said, ‘So (what about) the one who extracts it from straying to Guidance?’ He<sup style=\"font-weight: normal\">asws</sup> said: ‘That is the magnificent interpretation’. ",
            "<span style=\"font-size: small\">Muhammad Bin Yahya, from Ahmad and Abdullah the two sons of Muhammad Bin Isa, from Ali Bin Al Hakam, from Aban </span>– similar to it."
          ],
          "en.sarwar": [
            "2. It is narrated from him (narrator of the Hadith above) from Ali ibn al-Hakam from Aban ibn ‘Uthman from Fudayl ibn Yasar who has said the following: “I asked abu Ja’far (a.s.) about the words of Allah, the Most Majestic, the Most Holy, in His book, ‘ ... to save a life is as great a virtue as to save all of mankind. . . .’ (5:32) The Imam said, ‘It refers to burning or drowning someone.’ I asked, ‘What if someone takes him out of straying to guidance?’ The Imam said, ‘That is the greatest interpretation of the case in point.’” Muhammad ibn Yahya has narrated from Ahmad and ‘Abd Allah the two sons of Muhammad ibn ‘Isa from Ali ibn al-Hakam from Aban: a similar Hadith. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (151/ 9)"
        ],
        "index": 2216,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:92:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى بْنِ عِمْرَانَ الْحَلَبِيِّ عَنْ أَبِي خَالِدٍ الْقَمَّاطِ عَنْ حُمْرَانَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَسْأَلُكَ أَصْلَحَكَ اللَّهُ فَقَالَ نَعَمْ فَقُلْتُ كُنْتُ عَلَى حَالٍ وَ أَنَا الْيَوْمَ عَلَى حَالٍ أُخْرَى كُنْتُ أَدْخُلُ الْأَرْضَ فَأَدْعُو الرَّجُلَ وَ الِاثْنَيْنِ وَ الْمَرْأَةَ فَيُنْقِذُ اللَّهُ مَنْ شَاءَ وَ أَنَا الْيَوْمَ لَا أَدْعُو أَحَداً ",
          "فَقَالَ وَ مَا عَلَيْكَ أَنْ تُخَلِّيَ بَيْنَ النَّاسِ وَ بَيْنَ رَبِّهِمْ فَمَنْ أَرَادَ اللَّهُ أَنْ يُخْرِجَهُ مِنْ ظُلْمَةٍ إِلَى نُورٍ أَخْرَجَهُ ",
          "ثُمَّ قَالَ وَ لَا عَلَيْكَ إِنْ آنَسْتَ مِنْ أَحَدٍ خَيْراً أَنْ تَنْبِذَ إِلَيْهِ الشَّيْ‏ءَ نَبْذاً قُلْتُ أَخْبِرْنِي عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ أَحْياها فَكَأَنَّما أَحْيَا النَّاسَ جَمِيعاً قَالَ مِنْ حَرَقٍ أَوْ غَرَقٍ ثُمَّ سَكَتَ ثُمَّ قَالَ تَأْوِيلُهَا الْأَعْظَمُ أَنْ دَعَاهَا فَاسْتَجَابَتْ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Khalid, from Al Nazar Bin Suweyd, from Yahya Bin Imran Al Halby, from Abu Khalid Al Qammat, from Humran who said, ",
            "‘I said to Abu Abdullah<sup style=\"font-weight: normal\">asws</sup>, ‘Can I ask you<sup style=\"font-weight: normal\">asws</sup> (something)? May Allah<sup style=\"font-weight: normal\">azwj</sup> Keep you<sup style=\"font-weight: normal\">asws</sup> well!’ So he<sup style=\"font-weight: normal\">asws</sup> said: ‘Yes’. So I said, ‘I was upon a (particular) state, and today I am upon another state. I used to enter the land, so I would invite (to Religion) the man, and the two, and the woman, and Allah<sup style=\"font-weight: normal\">azwj</sup> would Rescue the one whom He<sup style=\"font-weight: normal\">azwj</sup> so Desired to; and today I am not inviting anyone’. ",
            "So he<sup style=\"font-weight: normal\">asws</sup> said: ‘And there is nothing upon you if you were to leave between the people and their Lord<sup style=\"font-weight: normal\">azwj</sup>. So the one whom Allah<sup style=\"font-weight: normal\">azwj</sup> Intends to Extract from darkness to Light, would Extract him’. ",
            "Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘Nor is it upon you if you know of goodness from anyone that you introduce the thing to him with an introduction’. I said, ‘Inform me about the Words of Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[5:32] and whoever keeps it alive, it is as though he kept alive all the people</span>’. He<sup style=\"font-weight: normal\">asws</sup> said: ‘From drowning or burning’. Then he<sup style=\"font-weight: normal\">asws</sup> was silent, then said: ‘Its magnificent interpretation is that you invite him, so he responds to it’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Khalid from al- Nadr ibn Suwayd from Yahya ibn ‘Imran al- Halabi from abu Khalid al-Qammat from Humran who has said the following: “Once I said to abu ‘Abd Allah (a.s.) ‘Can I ask you a question, may Allah keep you well?’ He said, ‘Yes you may do so.’ I said, ‘I was in a particular condition and today I am in another condition. I would go in the land to invite one or two men and women (to our belief) and Allah would save whomever He wanted. Today I do not invite anyone.’ The Imam said, ‘It is no offense to you to leave people to their Lord. Whomever Allah wants to guide and take out of darkness to light He does so.’ The Imam then said, ‘It is not an offense to you if you sense good in someone to introduce an issue.’ 1 then said, ‘Tell me about the words of Allah, the Most Majestic, the Most Holy, ‘. . . to save a life is as great a virtue as to save all of mankind. . . .’ (5:32) The Imam said, ‘It refers to burning or drowning someone. He then remained quiet and then said, ‘Its greatest case in point, is that one is invited (to the truth), and he accepts it.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:92",
  "kind": "verse_list"
}