{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 94"
        },
        "path": "/books/al-kafi:2:1:94",
        "titles": {
          "ar": "بَابٌ فِي تَرْكِ دُعَاءِ النَّاسِ",
          "en": "Chapter 94 – Regarding leaving out inviting the people"
        }
      }
    ],
    "index": 282,
    "local_index": 94,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 95"
        },
        "path": "/books/al-kafi:2:1:95",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ أَنَّ اللَّهَ</span> إِنَّمَا يُعْطِي الدِّينَ مَنْ يُحِبُّهُ",
          "en": "Chapter 95 – Allah<sup>azwj</sup>, rather, Gives the Religion to the one whom He<sup>azwj</sup> Loves"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 93"
        },
        "path": "/books/al-kafi:2:1:93",
        "titles": {
          "ar": "بَابٌ فِي الدُّعَاءِ لِلْأَهْلِ إِلَى الْإِيمَانِ",
          "en": "Chapter 93 – Regarding the inviting the people to the Emān"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:94",
    "titles": {
      "ar": "بَابٌ فِي تَرْكِ دُعَاءِ النَّاسِ",
      "en": "Chapter 94 – Regarding leaving out inviting the people"
    },
    "verse_count": 7,
    "verse_start_index": 2217,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/154)"
        ],
        "index": 2218,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:94:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ كُلَيْبِ بْنِ مُعَاوِيَةَ الصَّيْدَاوِيِّ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِيَّاكُمْ وَ النَّاسَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ إِذَا أَرَادَ بِعَبْدٍ خَيْراً نَكَتَ فِي قَلْبِهِ نُكْتَةً فَتَرَكَهُ وَ هُوَ يَجُولُ لِذَلِكَ وَ يَطْلُبُهُ ",
          "ثُمَّ قَالَ لَوْ أَنَّكُمْ إِذَا كَلَّمْتُمُ النَّاسَ قُلْتُمْ ذَهَبْنَا حَيْثُ ذَهَبَ اللَّهُ وَ اخْتَرْنَا مَنِ اخْتَارَ اللَّهُ وَ اخْتَارَ اللَّهُ مُحَمَّداً وَ اخْتَرْنَا آلَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَ عَلَيْهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Kuleyb Bin Muawiya Al Saydawi who said, ",
            "‘Abu Abdullah<sup>asws</sup> said to me: ‘Beware of the people! Allah<sup>azwj</sup> Mighty and Majestic, whenever He<sup>azwj</sup> Intends good with a servant, Imprints a spot in his heart, but He<sup>azwj</sup> Neglects him, and he wanders around due to that and seeks it (the true Religion)’. ",
            "Then he<sup>asws</sup> said: ‘If you all were to speak to the people, say to them, ‘We go where Allah<sup>azwj</sup> Send us, and we choose whatever Allah<sup>azwj</sup> Chooses (for us), and Allah<sup>azwj</sup> Chose Muhammad<sup>saww</sup> and chose us<sup>asws</sup>, the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Kulayb ibn Mu’awiyah al-Saydawi who has said the following: “Once abu ‘Abd Allah (a.s.) said to me, ‘Beware of people.’ If Allah, the Most Majestic, the Most Holy, wills good for a servant. He places a dot in his heart. He then leaves him alone and for that reason he moves around and searches it (belief).’ The Imam then said, ‘Were you to talk to people, say we have gone where Allah goes, we choose whoever Allah chooses. Allah chose Muhammad and we chose the family of Muhammad, recipients of divine supreme covenant.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/155)"
        ],
        "index": 2219,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:94:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ أَبِي إِسْمَاعِيلَ السَّرَّاجِ عَنِ ابْنِ مُسْكَانَ عَنْ ثَابِتٍ أَبِي سَعِيدٍ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا ثَابِتُ مَا لَكُمْ وَ لِلنَّاسِ كُفُّوا عَنِ النَّاسِ وَ لَا تَدْعُوا أَحَداً إِلَى أَمْرِكُمْ فَوَ اللَّهِ لَوْ أَنَّ أَهْلَ السَّمَاءِ وَ أَهْلَ الْأَرْضِ اجْتَمَعُوا عَلَى أَنْ يُضِلُّوا عَبْداً يُرِيدُ اللَّهُ هُدَاهُ مَا اسْتَطَاعُوا ",
          "كُفُّوا عَنِ النَّاسِ وَ لَا يَقُولُ أَحَدُكُمْ أَخِي وَ ابْنُ عَمِّي وَ جَارِي فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ إِذَا أَرَادَ بِعَبْدٍ خَيْراً طَيَّبَ رُوحَهُ فَلَا يَسْمَعُ بِمَعْرُوفٍ إِلَّا عَرَفَهُ وَ لَا بِمُنْكَرٍ إِلَّا أَنْكَرَهُ ثُمَّ يَقْذِفُ اللَّهُ فِي قَلْبِهِ كَلِمَةً يَجْمَعُ بِهَا أَمْرَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Ismail, from Abu Ismail Al Sarraj, from Ibn Muskan, from Sabit Abu Saeed who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘O Sabit! What is it with you and the people?’ Refrain from the people and do not invite anyone to your matter (Al-Wilayah), for by Allah<sup>azwj</sup>, even if the inhabitants of the sky and the inhabitants of the earth were to gather together upon straying a servant whom Allah<sup>azwj</sup> Intends to Guide, they would not have the capacity for it. ",
            "Refrain from the people and not one of you should be saying, ‘My brother’, and ‘my cousin’, and ‘my neighbour’, for Allah<sup>azwj</sup> Mighty and Majestic, when He<sup>azwj</sup> Intends goodness with a servant, Betters his spirit, so he does not hear a good act except that he would recognise it, nor of a evil deed except that he would deny it. Then Allah<sup>azwj</sup> would Imprint a Word in his heart by which his affairs would be gathered’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Isma’il from abu Isma’il Al- Sarraj from ibn Muskan from Thabit abu Sa’id who has said the following: “Once abu ‘Abd Allah (a.s.) said to me, ‘O Thabit, what do you have to do with people? Leave the people alone and do not invite anyone to your cause (your belief). By Allah, if the inhabitants of heaven and the inhabitants of earth would come together to mislead a servant whom Allah wants to guide, they would not be able to do it. Leave the people alone and no one of you should say: “What about my brother, the son of my Uncle and my neighbor”? When Allah, the Most Majestic, the Most Holy, wills good for a servant. He cleanses his spirit and thereafter he does not listen to any principle but that he recognizes, and acknowledges it and does not hear of a wickedness but that he hates it. Then Allah places a word in his heart that serves as a focal point in his affairs.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/155)"
        ],
        "index": 2220,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:94:3",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مُحَمَّدِ بْنِ مَرْوَانَ عَنِ الْفُضَيْلِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) نَدْعُو النَّاسَ إِلَى هَذَا الْأَمْرِ فَقَالَ يَا فُضَيْلُ إِنَّ اللَّهَ إِذَا أَرَادَ بِعَبْدٍ خَيْراً أَمَرَ مَلَكاً فَأَخَذَ بِعُنُقِهِ حَتَّى أَدْخَلَهُ فِي هَذَا الْأَمْرِ طَائِعاً أَوْ كَارِهاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Muhammad Bin Marwan, from Al Fuzayl who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘We tend to invite the people to this matter (Al-Wilayah)’. So he<sup>asws</sup> said: ‘O Fuzayl! Whenever Allah Intends goodness with a servant, Commands an Angels, so he seizes him by his neck until he enter him into this matter (Al-Wilayah), willingly or unwillingly’."
          ],
          "en.sarwar": [
            "3. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from Muhammad ibn Marwan from al-Fudayl who has said the following: “Once I said to abu ‘Abd Allah (a.s.) ‘Should we invite people to this cause (belief of Shi’a Muslims)?’ The Imam said, ‘O al-Fudayl, it is certain, when Allah wills good for a servant. He commands an angel who holds his neck until he brings him into this cause whether he likes or dislikes it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/155)"
        ],
        "index": 2221,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:94:4",
        "relations": {
          "Mentions": [
            "/books/quran:28:56",
            "/books/quran:10:99"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ أَبِيهِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) اجْعَلُوا أَمْرَكُمْ هَذَا لِلَّهِ وَ لَا تَجْعَلُوهُ لِلنَّاسِ فَإِنَّهُ مَا كَانَ لِلَّهِ فَهُوَ لِلَّهِ وَ مَا كَانَ لِلنَّاسِ فَلَا يَصْعَدُ إِلَى السَّمَاءِ وَ لَا تُخَاصِمُوا بِدِينِكُمُ النَّاسَ فَإِنَّ الْمُخَاصَمَةَ مَمْرَضَةٌ لِلْقَلْبِ ",
          "إِنَّ اللَّهَ عَزَّ وَ جَلَّ قَالَ لِنَبِيِّهِ ( صلى الله عليه وآله ) إِنَّكَ لا تَهْدِي مَنْ أَحْبَبْتَ وَ لكِنَّ اللَّهَ يَهْدِي مَنْ يَشاءُ وَ قَالَ أَ فَأَنْتَ تُكْرِهُ النَّاسَ حَتَّى يَكُونُوا مُؤْمِنِينَ ذَرُوا النَّاسَ فَإِنَّ النَّاسَ أَخَذُوا عَنِ النَّاسِ وَ إِنَّكُمْ أَخَذْتُمْ عَنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ عَلِيٍّ ( عليه السلام ) وَ لَا سَوَاءٌ وَ إِنَّنِي سَمِعْتُ أَبِي يَقُولُ إِذَا كَتَبَ اللَّهُ عَلَى عَبْدٍ أَنْ يُدْخِلَهُ فِي هَذَا الْأَمْرِ كَانَ أَسْرَعَ إِلَيْهِ مِنَ الطَّيْرِ إِلَى وَكْرِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad bin Muhammad Bin Isa, from Ibn Fazzal, from Ali Bin Uqba, from his father who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Make this matter of yours for the sake of Allah<sup>azwj</sup> and do not make it to be for the people for whatever was for the sake of Allah<sup>azwj</sup>, so it is for Allah<sup>azwj</sup>, and whatever was for the people, so it would not ascend to the sky; and do not dispute with the people with your Religion, for the disputing is a sickness of the heart. ",
            "Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic Said to His<sup style=\"font-weight: normal\">azwj</sup> Prophet<sup style=\"font-weight: normal\">saww</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:28#h56\">[28:56]</a> Surely you cannot guide whom you love, but Allah Guides whom He Desires to, and He is more Knowing of the recepients of Guidance</span>. And He<sup style=\"font-weight: normal\">azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:10#h99\">[10:99]</a> will you then force the people until they become Believers?</span> Leave off the people, for the people are taking (their Religion) from the people, and you all are taking from Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> and Ali<sup style=\"font-weight: normal\">asws</sup>, and there is no equation, and I<sup style=\"font-weight: normal\">asws</sup> heard my<sup style=\"font-weight: normal\">asws</sup> father<sup style=\"font-weight: normal\">asws</sup> saying: ‘When Allah<sup style=\"font-weight: normal\">azwj</sup> Ordains for a servant to enter into this matter (Al-Wilayah)), he would be quicker to it than the bird it’s to its nest’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn Faddal from Ali ibn ‘Uqbah from his father who has said the following: “Once abu ‘Abd Allah (a.s.) said, ‘Keep your cause (belief), for the sake of Allah and do not make it for people; what is for Allah is for Allah and what is for people cannot ascend to heaven. Do not argue with people about your religion; argumentation causes sickness to the heart. Allah, the Most Majestic, the Most Holy, has said to His Holy Prophet, ‘(Muhammad), you cannot guide whomever you love, but Allah guides whomever He wants. . . .’ <a href=\"/#/books/quran:28#h56\">[28:56]</a> He has also said, ‘. . . (Muhammad), do you force people to have faith’? <a href=\"/#/books/quran:10#h99\">[10:99]</a>. Leave the people alone; they take it from people and you take it from the Messenger of Allah and from Amir al-Mu’minin (Ali ibn abu Talib), recipients of divine supreme covenant, and this is not equal. I heard my father saying, ‘When Allah writes for a servant to enter into this cause (belief of AM al-Bayt) he rushes to it quicker than a bird to its nest.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/157)"
        ],
        "index": 2222,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:94:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنِ ابْنِ أُذَيْنَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ خَلَقَ قَوْماً لِلْحَقِّ فَإِذَا مَرَّ بِهِمُ الْبَابُ مِنَ الْحَقِّ قَبِلَتْهُ قُلُوبُهُمْ وَ إِنْ كَانُوا لَا يَعْرِفُونَهُ وَ إِذَا مَرَّ بِهِمُ الْبَابُ مِنَ الْبَاطِلِ أَنْكَرَتْهُ قُلُوبُهُمْ وَ إِنْ كَانُوا لَا يَعْرِفُونَهُ وَ خَلَقَ قَوْماً لِغَيْرِ ذَلِكَ فَإِذَا مَرَّ بِهِمُ الْبَابُ مِنَ الْحَقِّ أَنْكَرَتْهُ قُلُوبُهُمْ وَ إِنْ كَانُوا لَا يَعْرِفُونَهُ وَ إِذَا مَرَّ بِهِمُ الْبَابُ مِنَ الْبَاطِلِ قَبِلَتْهُ قُلُوبُهُمْ وَ إِنْ كَانُوا لَا يَعْرِفُونَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Usman, from Ibn Azina, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Created a people for the truth. So when they pass by the door of the truth, their hearts accept it and even if it was so that they are not recognising it; and when they pass by the door of the falsehood, their hearts reject it and even though they are not recognising it. And He<sup>azwj</sup> Created a people for other than that. So whenever they pass by the door of the truth, their hearts reject it and even if they are not recognising it; and when they pass by the door of the falsehood, their hearts accept it, and even if they were not recognising it’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ‘Uthman from ibn ‘Udhaynah from abu ‘Abd Allah (a.s.) who has said the following: “Allah, the Most Majestic, the Most Holy, has created a people for the truth, when they pass by the door of the truth, their hearts accept it, even though they may not know it. When they pass by the door of falsehood, their hearts reject it, even though they may not know it. He has created a people for things other than this. When they pass by the door of the truth, their hearts reject it, even though they may not know it. When they pass by the door of falsehood, their hearts accept it, even though they may not know it.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (157/ 9)"
        ],
        "index": 2223,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:94:6",
        "relations": {
          "Mentions": [
            "/books/quran:6:125"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الْحَمِيدِ بْنِ أَبِي الْعَلَاءِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ إِذَا أَرَادَ بِعَبْدٍ خَيْراً نَكَتَ فِي قَلْبِهِ نُكْتَةً مِنْ نُورٍ فَأَضَاءَ لَهَا سَمْعُهُ وَ قَلْبُهُ حَتَّى يَكُونَ أَحْرَصَ عَلَى مَا فِي أَيْدِيكُمْ مِنْكُمْ وَ إِذَا أَرَادَ بِعَبْدٍ سُوءاً نَكَتَ فِي قَلْبِهِ نُكْتَةً سَوْدَاءَ فَأَظْلَمَ لَهَا سَمْعُهُ وَ قَلْبُهُ ",
          "ثُمَّ تَلَا هَذِهِ الْآيَةَ فَمَنْ يُرِدِ اللَّهُ أَنْ يَهْدِيَهُ يَشْرَحْ صَدْرَهُ لِلْإِسْلامِ وَ مَنْ يُرِدْ أَنْ يُضِلَّهُ يَجْعَلْ صَدْرَهُ ضَيِّقاً حَرَجاً كَأَنَّما يَصَّعَّدُ فِي السَّماءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdul Hameed Bin Abu Al A’ala, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic, when He<sup>azwj</sup> intends goodness with a servant, Imprints a spot of Noor (light) in his heart, so it illuminates his hearing and his heart for him to the extent that he becomes greedy upon what is in your hands (Al-Wilayah) among you; and when He<sup>azwj</sup> Intends evil with a servant, Imprints a black spot in his heart, so it darkens his hearing and his heart to it’. ",
            "Then he<sup style=\"font-weight: normal\">asws</sup> recited this Verse <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h125\">[6:125]</a> Therefore (for) whomsoever Allah Intends that He would Guide him aright, He Expands his chest for Islam, and (for) whomsoever He Intends that He should Let him to err, He makes his chest straitened and narrow as though he were ascending to the sky</span>’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Abd al- Hamid ibn abu al-‘Ala’ from abu ‘Abd Allah (a.s.) who has said the following: “When Allah, the Most Majestic, the Most Holy, wills good for a servant. He places a dot of light in his heart, which shines his ears and heart to the extent that he becomes more eager and protective of this cause than you are. When He wills evil for a servant. He places a black dot in his heart and it darkens his ears and his heart. Then he recited this verse, ‘Allah will open the hearts of whomever He wants to guide to Islam, but He will constrict the chest of one whom He has led astray, as though he were to climb high up into the sky. . . .’” <a href=\"/#/books/quran:6#h125\">[6:125]</a> "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (158/ 9)"
        ],
        "index": 2224,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:94:7",
        "text": [
          "عَنْهُ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ حُمْرَانَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ إِذَا أَرَادَ بِعَبْدٍ خَيْراً نَكَتَ فِي قَلْبِهِ نُكْتَةً بَيْضَاءَ وَ فَتَحَ مَسَامِعَ قَلْبِهِ وَ وَكَّلَ بِهِ مَلَكاً يُسَدِّدُهُ وَ إِذَا أَرَادَ بِعَبْدٍ سُوءاً نَكَتَ فِي قَلْبِهِ نُكْتَةً سَوْدَاءَ وَ سَدَّ مَسَامِعَ قَلْبِهِ وَ وَكَّلَ بِهِ شَيْطَاناً يُضِلُّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from his father, from Ibn Abu Umeyr, from Muhammad Bin Humran, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> having said: ‘Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic, when He<sup style=\"font-weight: normal\">azwj</sup> Intends goodness with a servant, Imprints a white spot in his heart and Opens the ears of his heart, and Allocates an Angel with him guiding him; and when He<sup style=\"font-weight: normal\">azwj</sup> Intends evil with a servant, Imprints a black spot in his heart, and Shuts the ears of his heart, and Allocates a Satan<sup style=\"font-weight: normal\">la</sup> with him to stray him’."
          ],
          "en.sarwar": [
            "7. It is narrated from him (narrator of the Hadith above) from his father from ibn abu ‘Umayr from Muhammad ibn Humran from Muhammad ibn Muslim from abu ‘Abd Allah (a.s.) who has said the following: “When Allah, the Most Majestic, the Most Holy, wills good for a servant. He places a white dot on his heart, opens up his ears and heart and assigns an angel to keep him on the right path. When He wills evil for a servant. He places a black dot in his heart and shuts down his ears and heart and assigns a Satan to mislead him.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:94",
  "kind": "verse_list"
}