{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 96"
        },
        "path": "/books/al-kafi:2:1:96",
        "titles": {
          "ar": "بَابُ سَلَامَةِ الدِّينِ",
          "en": "Chapter 96 – The safety of the Religion"
        }
      }
    ],
    "index": 284,
    "local_index": 96,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 97"
        },
        "path": "/books/al-kafi:2:1:97",
        "titles": {
          "ar": "بَابُ التَّقِيَّةِ",
          "en": "Chapter 97 – The Dissimulation (Taqiyya)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 95"
        },
        "path": "/books/al-kafi:2:1:95",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابُ أَنَّ اللَّهَ</span> إِنَّمَا يُعْطِي الدِّينَ مَنْ يُحِبُّهُ",
          "en": "Chapter 95 – Allah<sup>azwj</sup>, rather, Gives the Religion to the one whom He<sup>azwj</sup> Loves"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:96",
    "titles": {
      "ar": "بَابُ سَلَامَةِ الدِّينِ",
      "en": "Chapter 96 – The safety of the Religion"
    },
    "verse_count": 4,
    "verse_start_index": 2228,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/161)"
        ],
        "index": 2229,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:96:1",
        "refs": {
          "Mentions": [
            "/books/quran:40:45"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ أَيُّوبَ بْنِ الْحُرِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَوَقاهُ اللَّهُ سَيِّئاتِ ما مَكَرُوا فَقَالَ أَمَا لَقَدْ بَسَطُوا عَلَيْهِ وَ قَتَلُوهُ وَ لَكِنْ أَ تَدْرُونَ مَا وَقَاهُ وَقَاهُ أَنْ يَفْتِنُوهُ فِي دِينِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Numan, from Ayoub Bin Al Hurr, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:40#h45\">[40:45]</a> So Allah Saved him from the evil of what they planned</span>. He<sup>asws</sup> said: ‘But, they had extended (their hands) upon him, and killed him, but do you know what He<sup>azwj</sup> Saved him (from)? He<sup>azwj</sup> Saved him from their strife in his Religion’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Nu’man from Ayyub ibn al-Hurr from abu ‘Abd Allah (a.s.) who has said the following: “About the words of Allah, the Most Majestic, the Most Holy, ‘Allah protected him against their evil plans. . . .,’ <a href=\"/#/books/quran:40#h45\">[40:45]</a> the Imam said, ‘In fact, they perpetrated and murdered him but do you know what was protected? He (Allah) protected him against confusion in his religion.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/162)"
        ],
        "index": 2230,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:96:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ أَبِي جَمِيلَةَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كَانَ فِي وَصِيَّةِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) لِأَصْحَابِهِ اعْلَمُوا أَنَّ الْقُرْآنَ هُدَى اللَّيْلِ وَ النَّهَارِ وَ نُورُ اللَّيْلِ الْمُظْلِمِ عَلَى مَا كَانَ مِنْ جَهْدٍ وَ فَاقَةٍ فَإِذَا حَضَرَتْ بَلِيَّةٌ فَاجْعَلُوا أَمْوَالَكُمْ دُونَ أَنْفُسِكُمْ وَ إِذَا نَزَلَتْ نَازِلَةٌ فَاجْعَلُوا أَنْفُسَكُمْ دُونَ دِينِكُمْ ",
          "وَ اعْلَمُوا أَنَّ الْهَالِكَ مَنْ هَلَكَ دِينُهُ وَ الْحَرِيبَ مَنْ حُرِبَ دِينُهُ أَلَا وَ إِنَّهُ لَا فَقْرَ بَعْدَ الْجَنَّةِ أَلَا وَ إِنَّهُ لَا غِنَى بَعْدَ النَّارِ لَا يُفَكُّ أَسِيرُهَا وَ لَا يَبْرَأُ ضَرِيرُهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa Bin Ubeyd, from Abu Jameela who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘It was in the bequest of Amir Al-<span class=\"iTxt\">Momin</span>een<sup>asws</sup> to his<sup>asws</sup> companions: ‘Know, that the Quran is a Guidance, day and night, and a light in the darkness of the night upon whatever was from the stress and destitution. So when an affliction presents itself, so make your wealth to be below your own selves, and when the descent (affliction) descends, so make yourselves to be below your Religion. ",
            "And know, that the destroyed one, is the one whose Religion is destroyed, and the ruined one is the one whose Religion is ruined. Indeed! There is no poverty after the (entry into the) Paradise, nor a richness after (entry into the) Hell. There is neither a freedom for its captives nor is there a cure for its harmed ones’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa ibn ‘Ubayd from abu Jamilah who has said the following: “abu ‘Abd Allah (a.s.) has said, ‘It was in the will of Amir al-Mu’minin (Ali ibn abu Talib) (a.s.) to his companions, “You must know that this Quran is guidance day and night and it is the light in the dark night that is due to hardships and destitution. When misfortune befalls, protect yourselves with your properties. When a misfortune (to religion) befalls, protect your religion with yourselves. You must know that the destroyed, in reality, is the one whose religion is destroyed and looted, in reality, is one whose religion is looted. It is certain that there is no poverty in paradise. It is also certain that there is no prosperity in hellfire, wherein its captives are never freed and there is no cure for its blind.’” "
          ]
        }
      },
      {
        "index": 2231,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:96:3",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيِّ بْنِ عَبْدِ اللَّهِ عَنْ فُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَلَامَةُ الدِّينِ وَ صِحَّةُ الْبَدَنِ خَيْرٌ مِنَ الْمَالِ وَ الْمَالُ زِينَةٌ مِنْ زِينَةِ الدُّنْيَا حَسَنَةٌ .",
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ حَمَّادٍ عَنْ رِبْعِيٍّ عَنِ الْفُضَيْلِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Hammad Bin Isa, from Rabie Bin Abdullah, from Fuzayl Bin Yasaar, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Safety of the Religion and good health of the body is better than the wealth, and the wealth is an adornment from the adornments of the world, an excellence’. ",
            "<span style=\"font-size: small\">Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Hammad, from Rabie, from Al Fuzayl, </span>from Abu Ja’far<sup>asws</sup> – similar to it."
          ],
          "en.sarwar": [
            "3. Ali has narrated from his father from Hammad ibn ‘Isa from Rib’i ibn ‘Abd Allah from Fudayl ibn Yasar from abu Ja’far (a.s.) who has said the following: “Soundness of religion and good health is better than property. Property is a beauty of the worldly beauties and it is a good thing.” Muhammad ibn Isma’il has narrated from Fadl ibn Shadhan from Hammad from Rib’i from al-Fudayl from abu Ja’far (a.s.) a similar Hadith. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/163)"
        ],
        "index": 2232,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:96:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ ابْنِ فَضَّالٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ بَعْضِ أَصْحَابِهِ قَالَ كَانَ رَجُلٌ يَدْخُلُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مِنْ أَصْحَابِهِ فَغَبَرَ زَمَاناً لَا يَحُجُّ فَدَخَلَ عَلَيْهِ بَعْضُ مَعَارِفِهِ فَقَالَ لَهُ فُلَانٌ مَا فَعَلَ قَالَ فَجَعَلَ يُضَجِّعُ الْكَلَامَ يَظُنُّ أَنَّهُ إِنَّمَا يَعْنِي الْمَيْسَرَةَ وَ الدُّنْيَا فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كَيْفَ دِينُهُ فَقَالَ كَمَا تُحِبُّ فَقَالَ هُوَ وَ اللَّهِ الْغِنَى ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ibn Fazzal, from Yunus Bin Yaqoub, from one of his companions who said, ",
            "‘A man from his<sup>asws</sup> used to come over to Abu Abdullah<sup>asws</sup>, but he was absent for a time not performing Hajj. So one of his acquaintances came over to him<sup>asws</sup>. So he<sup>asws</sup> said to him: ‘So and so, what happened?’ So he went on laying down the speech, thinking that he, rather, had become rich, the affluent, and the worldly. So Abu Abdullah<sup>asws</sup> said: ‘How is his Religion?’ So he said, ‘Just as you<sup>asws</sup> love’. So he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! It is the richness’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ibn Faddal from Yunus ibn Ya’qub from certain individuals of his people who has said the following: “A man, of the companions of abu ‘Abd Allah (a.s.) would very often attend the gathering with the Imam. He remained absent for a certain time and did not attend Hajj also. Once a certain individual of his people who knew him came in and the Imam asked, ‘How so and so is doing?’ The narrator has said that the man then began to speak of him in very short expressions thinking that he meant thereby wealth and the world. Abu ‘Abd Allah (a.s.) then asked, ‘How is his religion?’ He said, ‘It is just as you love.’ The Imam said, ‘That, by Allah, is wealth.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:96",
  "kind": "verse_list"
}