{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:2:1", "titles": {"ar": "كتاب الإيمان و الكفر", "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"}}, {"indexed_titles": {"en": "Chapter 97"}, "path": "/books/al-kafi:2:1:97", "titles": {"ar": "بَابُ التَّقِيَّةِ", "en": "Chapter 97 – The Dissimulation (Taqiyya)"}}], "index": 285, "local_index": 97, "part_type": "Chapter", "path": "/books/al-kafi:2:1:97", "titles": {"ar": "بَابُ التَّقِيَّةِ", "en": "Chapter 97 – The Dissimulation (Taqiyya)"}, "verse_count": 23, "verse_start_index": 2232, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 2233, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ وَ غَيْرِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ أُولئِكَ يُؤْتَوْنَ أَجْرَهُمْ مَرَّتَيْنِ بِما صَبَرُوا قَالَ بِمَا صَبَرُوا عَلَى التَّقِيَّةِ وَ يَدْرَؤُنَ بِالْحَسَنَةِ السَّيِّئَةَ قَالَ الْحَسَنَةُ التَّقِيَّةُ وَ السَّيِّئَةُ الْإِذَاعَةُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, and someone else, ", "(It has been narrated) from Abu Abullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[28:54] These shall be Granted their reward twice, because they were patient</span>. He<sup>asws</sup> said: ‘Due to what they were patient upon the dissimulation (<span class=\"iTxt\">Taqiyya</span>) <span class=\"ibTxt\">and they repelled evil with good</span>. He<sup>asws</sup> said: ‘The good deed is the dissimulation (<span class=\"iTxt\">Taqiyya</span>), and the evil is the broadcasting’."]}}, {"index": 2234, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:2", "text": ["ابْنُ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عُمَرَ الْأَعْجَمِيِّ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا أَبَا عُمَرَ إِنَّ تِسْعَةَ أَعْشَارِ الدِّينِ فِي التَّقِيَّةِ وَ لَا دِينَ لِمَنْ لَا تَقِيَّةَ لَهُ وَ التَّقِيَّةُ فِي كُلِّ شَيْ‏ءٍ إِلَّا فِي النَّبِيذِ وَ الْمَسْحِ عَلَى الْخُفَّيْنِ ."], "translations": {"en.hubeali": ["Ibn Abu Umeyr, from Hisham Bin Salim, from Abu Umar Al A’ajamy who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘O Abu Umar! Nine-tenths of the Religion is in dissimulation (<span class=\"iTxt\">Taqiyya</span>), and there is no Religion for the one who does not practice dissimulation (<span class=\"iTxt\">Taqiyya</span>); and the dissimulation (<span class=\"iTxt\">Taqiyya</span>) is regarding everything except regarding Al-Nabeez (an intoxicating drink) and the wiping upon the two socks (during ablution)’."]}}, {"index": 2235, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:3", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) التَّقِيَّةُ مِنْ دِينِ اللَّهِ قُلْتُ مِنْ دِينِ اللَّهِ قَالَ إِي وَ اللَّهِ مِنْ دِينِ اللَّهِ وَ لَقَدْ قَالَ يُوسُفُ ( عليه السلام ) أَيَّتُهَا الْعِيرُ إِنَّكُمْ لَسارِقُونَ وَ اللَّهِ مَا كَانُوا سَرَقُوا شَيْئاً وَ لَقَدْ قَالَ إِبْرَاهِيمُ ( عليه السلام ) إِنِّي سَقِيمٌ وَ اللَّهِ مَا كَانَ سَقِيماً ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from usman Bin Isa, from Sama’at, ", "(It has been narrated) from Abu Baseer who said, ‘Abu Abdullah<sup>asws</sup> said: ‘The dissimulation (<span class=\"iTxt\">Taqiyya</span>) is from the Religion of Allah<sup>azwj</sup>’. I said, ‘From the Religion of Allah<sup>azwj</sup>?’ He<sup>asws</sup> said: ‘Yes, by Allah<sup>azwj</sup>! From the Religion of Allah<sup>azwj</sup>, and Yusuf<sup>as</sup> has said <span class=\"ibTxt\">[12:70] O caravan! You are stealing</span>. By Allah<sup>azwj</sup>! They had not stolen anything. And Ibrahim<sup>as</sup> had said <span class=\"ibTxt\">[37:89] Then he said: I feel sick</span>. By Allah<sup>azwj</sup>! He<sup>as</sup> was not sick’."]}}, {"index": 2236, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:4", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ خَالِدٍ وَ الْحُسَيْنِ بْنِ سَعِيدٍ جَمِيعاً عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى بْنِ عِمْرَانَ الْحَلَبِيِّ عَنْ حُسَيْنِ بْنِ أَبِي الْعَلَاءِ عَنْ حَبِيبِ بْنِ بِشْرِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) سَمِعْتُ أَبِي يَقُولُ لَا وَ اللَّهِ مَا عَلَى وَجْهِ الْأَرْضِ شَيْ‏ءٌ أَحَبَّ إِلَيَّ مِنَ التَّقِيَّةِ يَا حَبِيبُ إِنَّهُ مَنْ كَانَتْ لَهُ تَقِيَّةٌ رَفَعَهُ اللَّهُ يَا حَبِيبُ مَنْ لَمْ تَكُنْ لَهُ تَقِيَّةٌ وَضَعَهُ اللَّهُ يَا حَبِيبُ إِنَّ النَّاسَ إِنَّمَا هُمْ فِي هُدْنَةٍ فَلَوْ قَدْ كَانَ ذَلِكَ كَانَ هَذَا ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Khalid and Al Husayn Bin Saeed altogether from Al Nazar Bin Suweyd, from Yahya Bin Imran Al Halby, from Husayn Bin Abu Al A’ala, from Habeeb Bin Bishr who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘I heard my<sup>asws</sup> father<sup>asws</sup> saying: ‘No, by Allah<sup>azwj</sup>! There is nothing on the face of the earth more beloved to me<sup>asws</sup> than the dissimulation (<span class=\"iTxt\">Taqiyya</span>). O Habeeb! The one who had dissimulation for him, Allah<sup>azwj</sup> would Elevate him. O Habeeb! The one who does not happen to have dissimulation (<span class=\"iTxt\">Taqiyya</span>) for him, Allah<sup>azwj</sup> would Place him down. O Habeeb! The people, rather, they are in a truce (cessation of hostilities). So if that (hostilities) had been there, this (dissimulation) would be there’."]}}, {"index": 2237, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:5", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنِ الْعَبَّاسِ بْنِ عَامِرٍ عَنْ جَابِرٍ الْمَكْفُوفِ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ اتَّقُوا عَلَى دِينِكُمْ فَاحْجُبُوهُ بِالتَّقِيَّةِ فَإِنَّهُ لَا إِيمَانَ لِمَنْ لَا تَقِيَّةَ لَهُ إِنَّمَا أَنْتُمْ فِي النَّاسِ كَالنَّحْلِ فِي الطَّيْرِ لَوْ أَنَّ الطَّيْرَ تَعْلَمُ مَا فِي أَجْوَافِ النَّحْلِ مَا بَقِيَ مِنْهَا شَيْ‏ءٌ إِلَّا أَكَلَتْهُ وَ لَوْ أَنَّ النَّاسَ عَلِمُوا مَا فِي أَجْوَافِكُمْ أَنَّكُمْ تُحِبُّونَّا أَهْلَ الْبَيْتِ لَأَكَلُوكُمْ بِأَلْسِنَتِهِمْ وَ لَنَحَلُوكُمْ فِي السِّرِّ وَ الْعَلَانِيَةِ رَحِمَ اللَّهُ عَبْداً مِنْكُمْ كَانَ عَلَى وَلَايَتِنَا ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Al hassan Bin Ali Al Kufy, from Al Abbas Bin Aamir, from Jabir Al Makouf, from Abdullah Bin Abu Yafour, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Be fearful upon your Religion, and veil upon it with the dissimulation (<span class=\"iTxt\">Taqiyya</span>), for there is no Eman for the one who has not dissimulation (<span class=\"iTxt\">Taqiyya</span>) for him. But rather, you all are among the people like the bees are among the birds. If the birds come to know what is in the interior of the bees, nothing would remain from it except that they would eat it up, and if the people come to know what is in your insides, that you are loving us<sup>asws</sup>, the People<sup>asws</sup> of the Household, they would eat you up with their tongues, and destroy you in private as well as public. May Allah<sup>azwj</sup> be Merciful upon a servant from you all who was upon our<sup>asws</sup> Wilayah’."]}}, {"index": 2238, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:6", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ لا تَسْتَوِي الْحَسَنَةُ وَ لَا السَّيِّئَةُ قَالَ الْحَسَنَةُ التَّقِيَّةُ وَ السَّيِّئَةُ الْإِذَاعَةُ ", "وَ قَوْلُهُ عَزَّ وَ جَلَّ ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ السَّيِّئَةَ قَالَ الَّتِي هِيَ أَحْسَنُ التَّقِيَّةُ فَإِذَا الَّذِي بَيْنَكَ وَ بَيْنَهُ عَداوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Hammad, from Hareyz, from the one who informed him, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[41:34] And the good and the evil are not alike</span>. He<sup>asws</sup> said: ‘The good deed is the dissimulation (<span class=\"iTxt\">Taqiyya</span>), and the evil is the broadcasting’.", "And (about) the Words of the Mighty and Majestic <span class=\"ibTxt\">[41:34] Refute (evil) with what is best</span>. He<sup style=\"font-weight: normal\">asws</sup> said: ‘That which is the best, is the dissimulation (<span class=\"iTxt\">Taqiyya</span>) <span class=\"ibTxt\">So if there is enmity between you and him, as if it is an intimate friend</span>’."]}}, {"index": 2239, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:7", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَمْرٍو الْكِنَانِيِّ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا أَبَا عَمْرٍو أَ رَأَيْتَكَ لَوْ حَدَّثْتُكَ بِحَدِيثٍ أَوْ أَفْتَيْتُكَ بِفُتْيَا ثُمَّ جِئْتَنِي بَعْدَ ذَلِكَ فَسَأَلْتَنِي عَنْهُ فَأَخْبَرْتُكَ بِخِلَافِ مَا كُنْتُ أَخْبَرْتُكَ أَوْ أَفْتَيْتُكَ بِخِلَافِ ذَلِكَ بِأَيِّهِمَا كُنْتَ تَأْخُذُ قُلْتُ بِأَحْدَثِهِمَا وَ أَدَعُ الْآخَرَ", "فَقَالَ قَدْ أَصَبْتَ يَا أَبَا عَمْرٍو أَبَى اللَّهُ إِلَّا أَنْ يُعْبَدَ سِرّاً أَمَا وَ اللَّهِ لَئِنْ فَعَلْتُمْ ذَلِكَ إِنَّهُ لَخَيْرٌ لِي وَ لَكُمْ وَ أَبَى اللَّهُ عَزَّ وَ جَلَّ لَنَا وَ لَكُمْ فِي دِينِهِ إِلَّا التَّقِيَّةَ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Mahboub, from Hisham Bin Salim, from Abu Amro Al Kinany who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘O Abu Amro! What is your view if I<sup>asws</sup> were to narrate to you a Hadeeth or issue a Verdict to you, then you come over to me after that and ask me about it, so I<sup>asws</sup> inform you with different to what I<sup>asws</sup> had informed you beforehand, or issue a verdict different (statement) to that, which of the two would you be taking with?’ I said, ‘With the latest of the two and leave the other one’. ", "So he<sup>asws</sup> said:’ You are correct, O Abu Amro! Allah<sup>azwj</sup> Refused except that He<sup>azwj</sup> be worshipped in secret. But, by Allah<sup>azwj</sup>, if you all were to do that it would be better for me<sup>asws</sup> and for you all; and Allah<sup>azwj</sup> Mighty and Majestic Refused for us<sup>asws</sup> and you all with regards to His<sup>azwj</sup> Religion, except for the dissimulation’."]}}, {"index": 2240, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:8", "text": ["عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ دُرُسْتَ الْوَاسِطِيِّ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَا بَلَغَتْ تَقِيَّةُ أَحَدٍ تَقِيَّةَ أَصْحَابِ الْكَهْفِ إِنْ كَانُوا لَيَشْهَدُونَ الْأَعْيَادَ وَ يَشُدُّونَ الزَّنَانِيرَ فَأَعْطَاهُمُ اللَّهُ أَجْرَهُمْ مَرَّتَيْنِ ."], "translations": {"en.hubeali": ["From him, from Ahmad Bin Muhammad, from Al Hassan Bin Ali, from Dorost Al Wasity who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘No dissimulation (<span class=\"iTxt\">Taqiyya</span>) of any one of you has reached the dissimulation (<span class=\"iTxt\">Taqiyya</span>) of the Companions of the cave (As’hab Al-Kahf). They used to attend the festivals and were tightening the sashes, so Allah<sup>azwj</sup> would be Giving them their Recompense, twice’."]}}, {"index": 2241, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:9", "text": ["عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ فَضَّالٍ عَنْ حَمَّادِ بْنِ وَاقِدٍ اللَّحَّامِ قَالَ اسْتَقْبَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فِي طَرِيقٍ فَأَعْرَضْتُ عَنْهُ بِوَجْهِي وَ مَضَيْتُ فَدَخَلْتُ عَلَيْهِ بَعْدَ ذَلِكَ فَقُلْتُ جُعِلْتُ فِدَاكَ إِنِّي لَأَلْقَاكَ فَأَصْرِفُ وَجْهِي كَرَاهَةَ أَنْ أَشُقَّ عَلَيْكَ فَقَالَ لِي رَحِمَكَ اللَّهُ وَ لَكِنَّ رَجُلًا لَقِيَنِي أَمْسِ فِي مَوْضِعِ كَذَا وَ كَذَا فَقَالَ عَلَيْكَ السَّلَامُ يَا أَبَا عَبْدِ اللَّهِ مَا أَحْسَنَ وَ لَا أَجْمَلَ ."], "translations": {"en.hubeali": ["From him, from Ahmad Bin Muhammad, from Al Hassan Bin Ali Bin Fazzal, from Hammad Bin Waqad Al Lahaam who said, ", "‘I met Abu Abdullah<sup>asws</sup> in a road, but I turned my face away from him<sup>asws</sup> and continued. Then I went over to him<sup>asws</sup> after that, so I said, ‘May I be sacrificed for you<sup>asws</sup>! I met you<sup>asws</sup> but I turned my face away (but I) disliked it that it would be grievous upon you<sup>asws</sup>’. So he<sup>asws</sup> said to me: ‘May Allah<sup>azwj</sup> have Mercy on you! A man met me<sup>asws</sup> yesterday in such and such a place, so he said, ‘Upon you<sup>asws</sup> be the greetings, O Abu Abdullah<sup>asws</sup>!’ How good (is your action), but (his pronouncing it in public was) not beautiful’."]}}, {"index": 2242, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:10", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ قَالَ قِيلَ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ النَّاسَ يَرْوُونَ أَنَّ عَلِيّاً ( عليه السلام ) قَالَ عَلَى مِنْبَرِ الْكُوفَةِ أَيُّهَا النَّاسُ إِنَّكُمْ سَتُدْعَوْنَ إِلَى سَبِّي فَسُبُّونِي ثُمَّ تُدْعَوْنَ إِلَى الْبَرَاءَةِ مِنِّي فَلَا تَبَرَّءُوا مِنِّي فَقَالَ مَا أَكْثَرَ مَا يَكْذِبُ النَّاسُ عَلَى عَلِيٍّ ( عليه السلام ) ", "ثُمَّ قَالَ إِنَّمَا قَالَ إِنَّكُمْ سَتُدْعَوْنَ إِلَى سَبِّي فَسُبُّونِي ثُمَّ سَتُدْعَوْنَ إِلَى الْبَرَاءَةِ مِنِّي وَ إِنِّي لَعَلَى دِينِ مُحَمَّدٍ وَ لَمْ يَقُلْ لَا تَبَرَّءُوا مِنِّي ", "فَقَالَ لَهُ السَّائِلُ أَ رَأَيْتَ إِنِ اخْتَارَ الْقَتْلَ دُونَ الْبَرَاءَةِ فَقَالَ وَ اللَّهِ مَا ذَلِكَ عَلَيْهِ وَ مَا لَهُ إِلَّا مَا مَضَى عَلَيْهِ عَمَّارُ بْنُ يَاسِرٍ حَيْثُ أَكْرَهَهُ أَهْلُ مَكَّةَ وَ قَلْبُهُ مُطْمَئِنٌّ بِالْإِيمَانِ فَأَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ فِيهِ إِلَّا مَنْ أُكْرِهَ وَ قَلْبُهُ مُطْمَئِنٌّ بِالْإِيمانِ فَقَالَ لَهُ النَّبِيُّ ( صلى الله عليه وآله ) عِنْدَهَا يَا عَمَّارُ إِنْ عَادُوا فَعُدْ فَقَدْ أَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ عُذْرَكَ وَ أَمَرَكَ أَنْ تَعُودَ إِنْ عَادُوا ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Haroun Bin Muslim, from Mas’ada Bin Sadaqa who said, ", "‘It was said to Abu Abdullah<sup>asws</sup>, ‘The people are reporting that Ali<sup>asws</sup> said upon the Pulpit of Al-Kufa: ‘O you people! You will be called to insulting me<sup>asws</sup>, so insult me<sup>asws</sup>. Then you would be called to denounce me<sup>asws</sup>, but you will not denounce me<sup>asws</sup>’. So he<sup>asws</sup> said: ‘How frequently the people lie against Ali<sup>asws</sup>’. ", "Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘But rather, he<sup style=\"font-weight: normal\">asws</sup> said: ‘You would be called to insult me<sup style=\"font-weight: normal\">asws</sup>, so insult me<sup style=\"font-weight: normal\">asws</sup>, then you would be called to the disavowment from me<sup style=\"font-weight: normal\">asws</sup>, and I<sup style=\"font-weight: normal\">asws</sup> am upon the Religion of Muhammad<sup style=\"font-weight: normal\">saww</sup>, but he<sup style=\"font-weight: normal\">asws</sup> did not say: ‘Do not disavow from me<sup style=\"font-weight: normal\">asws</sup>’. ", "So the questioner said to him<sup style=\"font-weight: normal\">asws</sup>, ‘What is your view if I choose being killed instead of disavowment?’ So he<sup style=\"font-weight: normal\">asws</sup> said: ‘By Allah<sup style=\"font-weight: normal\">azwj</sup>! That would not be upon him, and what would be for him except what Ammar Bin Yasir passed upon where the people of Makkah coerced him, and his heart was at rest with the Eman? So Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic Revealed with regards to it <span class=\"ibTxt\">[16:106] except the one who is compelled while his heart is at rest on account of faith</span><span class=\"iTxt\">. </span>So the Prophet<sup style=\"font-weight: normal\">saww</sup> said to him during it: ‘O Ammar! If they were to repeat (coercing you), so repeat (what you said before), for Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic has Revealed and Excused you, and Commanded you to repeat if they were to repeat (coeercing you)’."]}}, {"index": 2243, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:11", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ هِشَامٍ الْكِنْدِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِيَّاكُمْ أَنْ تَعْمَلُوا عَمَلًا يُعَيِّرُونَّا بِهِ فَإِنَّ وَلَدَ السَّوْءِ يُعَيَّرُ وَالِدُهُ بِعَمَلِهِ كُونُوا لِمَنِ انْقَطَعْتُمْ إِلَيْهِ زَيْناً وَ لَا تَكُونُوا عَلَيْهِ شَيْناً صَلُّوا فِي عَشَائِرِهِمْ وَ عُودُوا مَرْضَاهُمْ وَ اشْهَدُوا جَنَائِزَهُمْ وَ لَا يَسْبِقُونَكُمْ إِلَى شَيْ‏ءٍ مِنَ الْخَيْرِ فَأَنْتُمْ أَوْلَى بِهِ مِنْهُمْ وَ اللَّهِ مَا عُبِدَ اللَّهُ بِشَيْ‏ءٍ أَحَبَّ إِلَيْهِ مِنَ الْخَبْ‏ءِ قُلْتُ وَ مَا الْخَبْ‏ءُ قَالَ التَّقِيَّةُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Hisham Al Kindy who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Beware of doing a deed we<sup>asws</sup> would be faulted with, for the evil child shames his father with his deed. Become an adornment for the one you cut yourselves off to and do not become a disgrace upon him. Help out among their clan, and console their sick ones, and attend their funerals, and do not let them precede you to the goodness, for you all are closer with it than them, and Allah<sup>azwj</sup> has not been worshipped with anything more Beloved to Him<sup>azwj</sup> that <span class=\"iTxt\">Al-Khab</span>’. I said, ‘And what is <span class=\"iTxt\">Al-Khab</span>?’ He<sup>asws</sup> said: ‘The dissimulation (<span class=\"iTxt\">Taqiyya</span>)’."]}}, {"index": 2244, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:12", "text": ["عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُعَمَّرِ بْنِ خَلَّادٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنِ الْقِيَامِ لِلْوُلَاةِ فَقَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) التَّقِيَّةُ مِنْ دِينِي وَ دِينِ آبَائِي وَ لَا إِيمَانَ لِمَنْ لَا تَقِيَّةَ لَهُ ."], "translations": {"en.hubeali": ["From him, from Ahmad Bin Muhammad, from Moammar Bin Khallad who said, ", "‘I asked Abu Al-Hassan<sup>asws</sup> about the standing up to the ruler. So he<sup>asws</sup> said: ‘Abu Ja’far<sup>asws</sup> said: ‘The dissimulation (<span class=\"iTxt\">Taqiyya</span>) is from my<sup>asws</sup> Religion and the Religion of my<sup>asws</sup> forefathers<sup>asws</sup>, and there is no Eman for the one who has no dissimulation (<span class=\"iTxt\">Taqiyya</span>) for him’."]}}, {"index": 2245, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:13", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ رِبْعِيٍّ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ التَّقِيَّةُ فِي كُلِّ ضَرُورَةٍ وَ صَاحِبُهَا أَعْلَمُ بِهَا حِينَ تَنْزِلُ بِهِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Hammad, from Rabi’e, from Zurara, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The dissimulation (<span class=\"iTxt\">Taqiyya</span>) (is to be done) during every necessity, and its performer is more knowing with it where he should be indulging in it’."]}}, {"index": 2246, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:14", "text": ["عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ مُحَمَّدِ بْنِ مَرْوَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ أَبِي ( عليه السلام ) يَقُولُ وَ أَيُّ شَيْ‏ءٍ أَقَرُّ لِعَيْنِي مِنَ التَّقِيَّةِ إِنَّ التَّقِيَّةَ جُنَّةُ الْمُؤْمِنِ ."], "translations": {"en.hubeali": ["Ali, from his father, from Ibn Mahboub, from Jameel Bin Salih, from Muhammad Bin Marwan, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘My<sup>asws</sup> father<sup>asws</sup> was saying: ‘And which thing is more delighting to my<sup>asws</sup> eyes than the dissimulation (<span class=\"iTxt\">Taqiyya</span>). The dissimulation (<span class=\"iTxt\">Taqiyya</span>) is a shield of the <span class=\"iTxt\">Momin</span>’."]}}, {"index": 2247, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:15", "text": ["عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلٍ عَنْ مُحَمَّدِ بْنِ مَرْوَانَ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَا مُنِعَ مِيثَمٌ رَحِمَهُ اللَّهُ مِنَ التَّقِيَّةِ فَوَ اللَّهِ لَقَدْ عَلِمَ أَنَّ هَذِهِ الْآيَةَ نَزَلَتْ فِي عَمَّارٍ وَ أَصْحَابِهِ إِلَّا مَنْ أُكْرِهَ وَ قَلْبُهُ مُطْمَئِنٌّ بِالْإِيمانِ ."], "translations": {"en.hubeali": ["Ali, from his father, from Ibn Abu Umeyr, from Jameel, from Muhammad Bin Marwan who said, ", "‘Abu Abdullah<sup>asws</sup> said to me: ‘What prevented Meysam, may Allah<sup>azwj</sup> have Mercy on him, from the dissimulation (<span class=\"iTxt\">Taqiyya</span>)? By Allah<sup>azwj</sup>, he had known that this Verse was Revealed regarding Ammar and his companions <span class=\"ibTxt\">[16:106] except the one who is compelled while his heart is at rest on account of faith</span>’."]}}, {"index": 2248, "local_index": 16, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:16", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ شُعَيْبٍ الْحَدَّادِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّمَا جُعِلَتِ التَّقِيَّةُ لِيُحْقَنَ بِهَا الدَّمُ فَإِذَا بَلَغَ الدَّمَ فَلَيْسَ تَقِيَّةٌ ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Shuayb Al Haddad, from Muhammad Bin Muslim, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘But rather, the dissimulation (<span class=\"iTxt\">Taqiyya</span>) has been Made to be for saving the blood by it. So when it comes to the blood (to be spilt anyway), then there would be no dissimulation (<span class=\"iTxt\">Taqiyya</span>)’."]}}, {"index": 2249, "local_index": 17, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:17", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كُلَّمَا تَقَارَبَ هَذَا الْأَمْرُ كَانَ أَشَدَّ لِلتَّقِيَّةِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr, from Muhammad Bin Muslim, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Every time this matter (rising of Al-Qaim<sup>asws</sup>) comes closer, the (need for) dissimulation (<span class=\"iTxt\">Taqiyya</span>) intensifies’."]}}, {"index": 2250, "local_index": 18, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:18", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ إِسْمَاعِيلَ الْجُعْفِيِّ وَ مُعَمَّرِ بْنِ يَحْيَى بْنِ سَامٍ وَ مُحَمَّدِ بْنِ مُسْلِمٍ وَ زُرَارَةَ قَالُوا سَمِعْنَا أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ التَّقِيَّةُ فِي كُلِّ شَيْ‏ءٍ يُضْطَرُّ إِلَيْهِ ابْنُ آدَمَ فَقَدْ أَحَلَّهُ اللَّهُ لَهُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibn Azina, from Ismail Al Ju’fy and Moammar Bin Yahya Bin Sam and Muhammad Bin Muslim and Zurara who all said: ", "‘We heard Abu Ja’far<sup>asws</sup> saying: ‘The dissimulation (<span class=\"iTxt\">Taqiyya</span>) is with regards to everything the son of Adam<sup>as</sup> is compelled to. So Allah<sup>azwj</sup> has Permitted it for him’."]}}, {"index": 2251, "local_index": 19, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:19", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنِ ابْنِ مُسْكَانَ عَنْ حَرِيزٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ التَّقِيَّةُ تُرْسُ اللَّهِ بَيْنَهُ وَ بَيْنَ خَلْقِهِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Ibn Muskan, from Hareyz, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The dissimulation (<span class=\"iTxt\">Taqiyya</span>) is a shield of Allah<sup>azwj</sup>, between Him<sup>azwj</sup> and His<sup>azwj</sup> creatures’."]}}, {"index": 2252, "local_index": 20, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:20", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ أَحْمَدَ بْنِ حَمْزَةَ عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) خَالِطُوهُمْ بِالْبَرَّانِيَّةِ وَ خَالِفُوهُمْ بِالْجَوَّانِيَّةِ إِذَا كَانَتِ الْإِمْرَةُ صِبْيَانِيَّةً ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Jamhour, from Ahmad Bin Hamza, from Al Husayn Bin Al Mukhtar, from Abu Baseer who said, ", "‘Abu Ja’far<sup>asws</sup> said: ‘Mix with them with outwardly (apparent) and oppose them inwardly (hidden) when the ruler is childish’."]}}, {"index": 2253, "local_index": 21, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:21", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ زَكَرِيَّا الْمُؤْمِنِ عَنْ عَبْدِ اللَّهِ بْنِ أَسَدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَطَاءٍ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) رَجُلَانِ مِنْ أَهْلِ الْكُوفَةِ أُخِذَا فَقِيلَ لَهُمَا ابْرَأَا مِنْ أَمِيرِ الْمُؤْمِنِينَ فَبَرِئَ وَاحِدٌ مِنْهُمَا وَ أَبَى الْآخَرُ فَخُلِّيَ سَبِيلُ الَّذِي بَرِئَ وَ قُتِلَ الْآخَرُ فَقَالَ أَمَّا الَّذِي بَرِئَ فَرَجُلٌ فَقِيهٌ فِي دِينِهِ وَ أَمَّا الَّذِي لَمْ يَبْرَأْ فَرَجُلٌ تَعَجَّلَ إِلَى الْجَنَّةِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Zakariyya Al <span class=\"iTxt\">Momin</span>, from Abdullah Bin Asad, from Abdullah Bin Ata’a who said, ", "‘I said to Abu Ja’far<sup>asws</sup>, ‘Two men from the people of Al-Kufa were seized, and it was said to them, ‘Disavow from Amir Al-<span class=\"iTxt\">Momin</span>een<sup>asws</sup>’. So one of the two disavowed and the other one refused. So they freed the way of the one who did disavow and killed the other one’. So he<sup>asws</sup> said: ‘But as for the one who disavowed, so he is an understanding man in his Religion, and as for the one did not disavow, so he is a man who hastened to the Paradise’."]}}, {"index": 2254, "local_index": 22, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:22", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ صَالِحٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) احْذَرُوا عَوَاقِبَ الْعَثَرَاتِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel Bin Salih who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘Beware of the consequences of the slips (of the tongues)’."]}}, {"index": 2255, "local_index": 23, "part_type": "Hadith", "path": "/books/al-kafi:2:1:97:23", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنِ ابْنِ مُسْكَانَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي يَعْفُورٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ التَّقِيَّةُ تُرْسُ الْمُؤْمِنِ وَ التَّقِيَّةُ حِرْزُ الْمُؤْمِنِ وَ لَا إِيمَانَ لِمَنْ لَا تَقِيَّةَ لَهُ إِنَّ الْعَبْدَ لَيَقَعُ إِلَيْهِ الْحَدِيثُ مِنْ حَدِيثِنَا فَيَدِينُ اللَّهَ عَزَّ وَ جَلَّ بِهِ فِيمَا بَيْنَهُ وَ بَيْنَهُ فَيَكُونُ لَهُ عِزّاً فِي الدُّنْيَا وَ نُوراً فِي الْآخِرَةِ وَ إِنَّ الْعَبْدَ لَيَقَعُ إِلَيْهِ الْحَدِيثُ مِنْ حَدِيثِنَا فَيُذِيعُهُ فَيَكُونُ لَهُ ذُلًّا فِي الدُّنْيَا وَ يَنْزِعُ اللَّهُ عَزَّ وَ جَلَّ ذَلِكَ النُّورَ مِنْهُ ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Muhammad Bin Ismail, from Ali Bin Al Numan, from Ibn Muskan, from Abdullah Bin Abu Yafour who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The dissimulation (<span class=\"iTxt\">Taqiyya</span>) is a shield of the <span class=\"iTxt\">Momin</span>, and the dissimulation (<span class=\"iTxt\">Taqiyya</span>) is a protection of the <span class=\"iTxt\">Momin</span>; and there is no <span class=\"iTxt\">Emān</span> for the one who has no dissimulation (<span class=\"iTxt\">Taqiyya</span>) for him. The servant to whom comes the Hadeeth from our<sup>asws</sup> Ahadeeth, so he makes it a Religion of Allah<sup>azwj</sup> Mighty and Majestic with it, in what is between him and Him<sup>azwj</sup>, so there happens to be honour for him in the world and a light in the Hereafter; and the servant to whom comes the Hadeeth from our<sup>asws</sup> Ahadeeth, but he broadcasts it, so there happens to be disgrace for him in the world, and Allah<sup>azwj</sup> Mighty and Majestic Removes that light from him’."]}}]}, "index": "al-kafi:2:1:97", "kind": "verse_list"}