{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 98"
        },
        "path": "/books/al-kafi:2:1:98",
        "titles": {
          "ar": "بَابُ الْكِتْمَانِ",
          "en": "Chapter 98 – The Concealment"
        }
      }
    ],
    "index": 286,
    "local_index": 98,
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:98",
    "titles": {
      "ar": "بَابُ الْكِتْمَانِ",
      "en": "Chapter 98 – The Concealment"
    },
    "verse_count": 16,
    "verse_start_index": 2255,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/186)"
        ],
        "index": 2256,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:98:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ أَبِي حَمْزَةَ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) قَالَ وَدِدْتُ وَ اللَّهِ أَنِّي افْتَدَيْتُ خَصْلَتَيْنِ فِي الشِّيعَةِ لَنَا بِبَعْضِ لَحْمِ سَاعِدِي النَّزَقَ وَ قِلَّةَ الْكِتْمَانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Malik Bin Atiyya, from Abu Hamza, ",
            "(It has been narrated) from Ali<sup class=\"bTxt\">asws</sup> Bin Al-Husayn<sup>asws</sup> having said: ‘By Allah<sup>azwj</sup>! I<sup>asws</sup> wish I<sup>asws</sup> could redeem two characteristics which are in our<sup>asws</sup> Shias with part of the flesh of my<sup>asws</sup> arms – the rashness and scarcity of the concealment’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from Malik ibn ‘Atiyyah from abu Hamza from Ali ibn al-Husayn (a.s.) who has said the following: “I, by Allah, love to bail out two things in my followers with parts of my arms: their rush for quick response and lack of silence and restraint.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (187/ 9)"
        ],
        "index": 2257,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:98:2",
        "text": [
          "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَمَّارِ بْنِ مَرْوَانَ عَنْ أَبِي أُسَامَةَ زَيْدٍ الشَّحَّامِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أُمِرَ النَّاسُ بِخَصْلَتَيْنِ فَضَيَّعُوهُمَا فَصَارُوا مِنْهُمَا عَلَى غَيْرِ شَيْ‏ءٍ الصَّبْرِ وَ الْكِتْمَانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Ammar Bin Marwan, from Abu Asama Zayd Al Shahaam who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The people have been commanded with (having) two characteristics, but they wasted these. Thus, they came to be upon something else. (These two things are – the patience and the concealment)’."
          ],
          "en.sarwar": [
            "2. It is narrated from him (narrator of the Hadith above) from Ahmad ibn Muhammad from Muhammad ibn Sinan from ‘Ammar ibn Marwan from abu ‘Usamah Zayd al-Shahham who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘People were commanded to maintain two characteristics, for the loss of which they involved themselves into something else; they were patience and silent abstinence.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/187)"
        ],
        "index": 2258,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:98:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ يُونُسَ بْنِ عَمَّارٍ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا سُلَيْمَانُ إِنَّكُمْ عَلَى دِينٍ مَنْ كَتَمَهُ أَعَزَّهُ اللَّهُ وَ مَنْ أَذَاعَهُ أَذَلَّهُ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Yunus Bin Ammar, from Suleyman Bin Khalid who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘O Suleyman! You all are upon such a Religion that the one who conceals it, Allah<sup>azwj</sup> Honours him, and the one who broadcasts it, Allah<sup>azwj</sup> Humiliates him’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Yunus ibn ‘Ammar from Sulayman ibn Khalid who has said the following: “Abu ‘Abd Allah (a.s.) once said, ‘O Sulayman, you follow the religion of one for whose silent abstinence Allah grants him honor, but due to his loud publicity, Allah causes his humiliation. ’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (187/ 9)"
        ],
        "index": 2259,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:98:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ رَجُلٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ دَخَلْنَا عَلَيْهِ جَمَاعَةً فَقُلْنَا يَا ابْنَ رَسُولِ اللَّهِ إِنَّا نُرِيدُ الْعِرَاقَ فَأَوْصِنَا فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) لِيُقَوِّ شَدِيدُكُمْ ضَعِيفَكُمْ وَ لْيَعُدْ غَنِيُّكُمْ عَلَى فَقِيرِكُمْ وَ لَا تَبُثُّوا سِرَّنَا وَ لَا تُذِيعُوا أَمْرَنَا وَ إِذَا جَاءَكُمْ عَنَّا حَدِيثٌ فَوَجَدْتُمْ عَلَيْهِ شَاهِداً أَوْ شَاهِدَيْنِ مِنْ كِتَابِ اللَّهِ فَخُذُوا بِهِ وَ إِلَّا فَقِفُوا عِنْدَهُ ثُمَّ رُدُّوهُ إِلَيْنَا حَتَّى يَسْتَبِينَ لَكُمْ ",
          "وَ اعْلَمُوا أَنَّ الْمُنْتَظِرَ لِهَذَا الْأَمْرِ لَهُ مِثْلُ أَجْرِ الصَّائِمِ الْقَائِمِ وَ مَنْ أَدْرَكَ قَائِمَنَا فَخَرَجَ مَعَهُ فَقَتَلَ عَدُوَّنَا كَانَ لَهُ مِثْلُ أَجْرِ عِشْرِينَ شَهِيداً وَ مَنْ قُتِلَ مَعَ قَائِمِنَا كَانَ لَهُ مِثْلُ أَجْرِ خَمْسَةٍ وَ عِشْرِينَ شَهِيداً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Abdullah Bin Bukeyr, from a man, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘We went over to him<sup>asws</sup> as a group, so we said, ‘O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! We want (to go to) Al-Iraq, so advise us’. So Abu Ja’far<sup>asws</sup> said: ‘Let your strong ones strengthen your weak ones, and let your rich ones assist your poor ones, and neither divulge our<sup>asws</sup> secrets nor broadcast our<sup>asws</sup> matter. And, whenever a Hadeeth comes to you from us<sup>asws</sup>, and you find a proof over it, or two proofs from the Book of Allah<sup>azwj</sup>, then take with it, or else, pause during it, then refer it back to us<sup>asws</sup> until it is clarified for you. ",
            "And know that the one awaiting for this matter (rising of Al-Qaim<sup>asws</sup>), for him would be a Recompense like for the Fasting one (during the day), the standing one (for the Salat during the night). And the one who comes across our<sup>asws</sup> Qaim<sup>asws</sup>, so he goes out with him<sup>asws</sup> and kills our<sup>asws</sup> enemies, for him would be a Recompense like for twenty martyrs. And the one who is killed with our<sup>asws</sup> Qaim<sup>asws</sup>, would have for him a Recompense like for twenty five martyrs’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from ‘Abd Allah ibn Bukayr from a man who has said the following: “Once we in a group went to see abu Ja’far (a.s.) and said to him, ‘O descendent of the Messenger of Allah, we intend to travel to Iraq, and request your recommendations.’ Abu Ja’far (a.s.) said, ‘The stronger ones among you must support the weak ones, the well to do among you must reach out to the poor ones among you, do not expose our secrets and do not publicize our cause. When you receive a Hadith from us accept it only if you find sufficient, two or at least one, supporting evidence from the book of Allah, otherwise, keep it on hold and then refer it to us for verification. You must know that those waiting for this matter (coming of Imam al-Mahdi) have a reward like those who fast all the time and pray every night. Whoever will find himself with our al-Qa’im (al-Mahdi) and will come out with him to do away with our enemies he will have a reward equal to that for twenty martyrs and whoever will be killed supporting our al- Qa’im, his reward will be equal to that for fifteen martyrs.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (188/ 9)"
        ],
        "index": 2260,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:98:5",
        "text": [
          "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَبْدِ الْأَعْلَى قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّهُ لَيْسَ مِنِ احْتِمَالِ أَمْرِنَا التَّصْدِيقُ لَهُ وَ الْقَبُولُ فَقَطْ مِنِ احْتِمَالِ أَمْرِنَا سَتْرُهُ وَ صِيَانَتُهُ مِنْ غَيْرِ أَهْلِهِ فَأَقْرِئْهُمُ السَّلَامَ وَ قُلْ لَهُمْ رَحِمَ اللَّهُ عَبْداً اجْتَرَّ مَوَدَّةَ النَّاسِ إِلَى نَفْسِهِ حَدِّثُوهُمْ بِمَا يَعْرِفُونَ وَ اسْتُرُوا عَنْهُمْ مَا يُنْكِرُونَ ",
          "ثُمَّ قَالَ وَ اللَّهِ مَا النَّاصِبُ لَنَا حَرْباً بِأَشَدَّ عَلَيْنَا مَئُونَةً مِنَ النَّاطِقِ عَلَيْنَا بِمَا نَكْرَهُ فَإِذَا عَرَفْتُمْ مِنْ عَبْدٍ إِذَاعَةً فَامْشُوا إِلَيْهِ وَ رُدُّوهُ عَنْهَا فَإِنْ قَبِلَ مِنْكُمْ وَ إِلَّا فَتَحَمَّلُوا عَلَيْهِ بِمَنْ يُثَقِّلُ عَلَيْهِ وَ يَسْمَعُ مِنْهُ ",
          "فَإِنَّ الرَّجُلَ مِنْكُمْ يَطْلُبُ الْحَاجَةَ فَيَلْطُفُ فِيهَا حَتَّى تُقْضَى لَهُ فَالْطُفُوا فِي حَاجَتِي كَمَا تَلْطُفُونَ فِي حَوَائِجِكُمْ فَإِنْ هُوَ قَبِلَ مِنْكُمْ وَ إِلَّا فَادْفِنُوا كَلَامَهُ تَحْتَ أَقْدَامِكُمْ وَ لَا تَقُولُوا إِنَّهُ يَقُولُ وَ يَقُولُ فَإِنَّ ذَلِكَ يُحْمَلُ عَلَيَّ وَ عَلَيْكُمْ أَمَا وَ اللَّهِ لَوْ كُنْتُمْ تَقُولُونَ مَا أَقُولُ لَأَقْرَرْتُ أَنَّكُمْ أَصْحَابِي",
          "هَذَا أَبُو حَنِيفَةَ لَهُ أَصْحَابٌ وَ هَذَا الْحَسَنُ الْبَصْرِيُّ لَهُ أَصْحَابٌ وَ أَنَا امْرُؤٌ مِنْ قُرَيْشٍ قَدْ وَلَدَنِي رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ عَلِمْتُ كِتَابَ اللَّهِ وَ فِيهِ تِبْيَانُ كُلِّ شَيْ‏ءٍ بَدْءِ الْخَلْقِ وَ أَمْرِ السَّمَاءِ وَ أَمْرِ الْأَرْضِ وَ أَمْرِ الْأَوَّلِينَ وَ أَمْرِ الْآخِرِينَ وَ أَمْرِ مَا كَانَ وَ أَمْرِ مَا يَكُونُ كَأَنِّي أَنْظُرُ إِلَى ذَلِكَ نُصْبَ عَيْنِي ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Abdul A’ala who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The bearing of our<sup>asws</sup> matter is not the ratification of it and the acceptance only. From the bearing of our<sup>asws</sup> matter is the veiling it and the safeguarding it from other than its deserving ones. So convey the greetings to them and say to them, ‘May Allah<sup>azwj</sup> have Mercy on a servant who attracts the cordiality of the people to himself, narrating to them with what they are recognising, and concealing from them what they are denying’. ",
            "Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘The Hostile ones (<span class=\"iTxt\">Nasibis</span>) who establish war with weapons against us<sup style=\"font-weight: normal\">asws</sup> are not more difficult upon us<sup style=\"font-weight: normal\">asws</sup> than the speaker upon us<sup style=\"font-weight: normal\">asws</sup> with what we<sup style=\"font-weight: normal\">asws</sup> dislike. So when you recognise a broadcast from a servant, then walk to him and repel him from it. So if he accepts from you (fine), or else load upon him with the one who is heavy upon him, and he would listen from him. ",
            "So if the man from you were to seek the need, then let him be moderate during it until it is fulfilled for him, and therefore you should be moderate regarding my<sup style=\"font-weight: normal\">asws</sup> needs just as you are being moderate regarding your own needs. So if he were to accept from you (fine), or else repulse his words to be under your feet and do not be saying, ‘He is saying, and he is saying’, for that would be loaded upon me<sup style=\"font-weight: normal\">asws</sup> and upon you. But, by Allah<sup style=\"font-weight: normal\">azwj</sup>, if you all were to be saying what I<sup style=\"font-weight: normal\">asws</sup> am saying, I<sup style=\"font-weight: normal\">asws</sup> would have acknowledge that you are my<sup style=\"font-weight: normal\">asws</sup> companions.",
            "This is Abu Haneefa for whom there are companions, and this is Al-Hassan Al-Basry for whom there are companions, and I<sup>asws</sup> am a man from Qureysh who has been born unto Rasool-Allah<sup>saww</sup>, and I<sup>asws</sup> know the Book of Allah<sup>azwj</sup>, and therein is an explanation of everything, the beginning of the creation, and the matters of the sky, and matters of the earth, and matters of the former ones, and matters of the later ones, and matters of what has happened, and matters of what will be happening. It is as if I<sup>asws</sup> am looking at that established in front of my<sup>asws</sup> eyes’."
          ],
          "en.sarwar": [
            "5. It is narrated from him (narrator of the Hadith above) from Ahmad ibn Muhammad from Muhammad ibn Sinan from ‘Abd al-‘Ala’ who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘Just to affirm our cause is not enough to carry it. To bear our cause is to keep it concealed and protect it from those who do not support it. Convey the greeting of peace to them and tell them, “May Allah grant blessings to those who attract people’s love to himself, speak to them (common people) about what they know and conceal from them what they deny.’” The Imam then said, ‘By Allah, our bitter enemy, is not more of a problem bigger for us than those who speak of us things that we dislike. If you hear a servant (of Allah) publicizing (our cause) then walk to him and turn him away from it. If he did not accept your advice then leave him to one who might prove to be heavier for him and he would listen to him. There are those of you who on request meet the needs of a person with kindness. Be kind to me in my needs as you are kind to each other in your needs. If he accepts from you, that is fine, otherwise, bury his words under your feet and do not say, ‘He says so and so.’ This will make it difficult for you and for me. By Allah, were you to say what I say, I could confirm that you are of my companions. This is abu Hanifah and he has companions. This is al-Hassan al-Basri and he has his companions. I am a man from Quraysh of the descendents of the Messenger of Allah. I knew the book of Allah in which there is explanation for everything, the beginning of creation, the matters of heavens, the issues of earth, the matters of those in the past, the issues of the later generations, and issues of things that existed and the matters of the things that will come into existence. To me these all are as if I see them before my eyes.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (190/ 9)"
        ],
        "index": 2261,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:98:6",
        "text": [
          "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الرَّبِيعِ بْنِ مُحَمَّدٍ الْمُسْلِيِّ عَنْ عَبْدِ اللَّهِ بْنِ سُلَيْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ لِي مَا زَالَ سِرُّنَا مَكْتُوماً حَتَّى صَارَ فِي يَدَيْ وُلْدِ كَيْسَانَ فَتَحَدَّثُوا بِهِ فِي الطَّرِيقِ وَ قُرَى السَّوَادِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Al Rabie Bin Muhammad Al Musly, from Abdullah Bin Suleyman, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said to me: ‘Our<sup>asws</sup> secrets have not ceased to be concealed until they came to be in my<sup>asws</sup> hands. The children of Kaysan are narrating with it in the roads and towns of multitude’."
          ],
          "en.sarwar": [
            "6. It is narrated from him (narrator of the Hadith above) from Ahmad ibn Muhammad from Ali ibn al-Hakam from al-Rabi’ ibn Muhammad al-Musalli from ‘Abd Allah ibn Sulayman from abu ‘Abd Allah (a.s.) who has said the following: “Abu ‘Abd Allah (a.s.) once said to me, ‘Our cause had still been hidden until the children of Kisan began to speak of it on the roads, villages and in large places.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (191/ 9)"
        ],
        "index": 2262,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:98:7",
        "text": [
          "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ أَبِي عُبَيْدَةَ الْحَذَّاءِ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ وَ اللَّهِ إِنَّ أَحَبَّ أَصْحَابِي إِلَيَّ أَوْرَعُهُمْ وَ أَفْقَهُهُمْ وَ أَكْتَمُهُمْ لِحَدِيثِنَا وَ إِنَّ أَسْوَأَهُمْ عِنْدِي حَالًا وَ أَمْقَتَهُمْ لَلَّذِي إِذَا سَمِعَ الْحَدِيثَ يُنْسَبُ إِلَيْنَا وَ يُرْوَى عَنَّا فَلَمْ يَقْبَلْهُ اشْمَأَزَّ مِنْهُ وَ جَحَدَهُ وَ كَفَّرَ مَنْ دَانَ بِهِ وَ هُوَ لَا يَدْرِي لَعَلَّ الْحَدِيثَ مِنْ عِنْدِنَا خَرَجَ وَ إِلَيْنَا أُسْنِدَ فَيَكُونَ بِذَلِكَ خَارِجاً عَنْ وَلَايَتِنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ahmad Bin Muhammad, from Ibn Mahboub, from Jameel Bin Salih, from Abu Ubeyda Al Haza’a who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘By Allah<sup>azwj</sup>! The most beloved of my<sup>asws</sup> companions to me<sup>asws</sup> is the most pious of them, and most understanding of the, and the most concealing of them of our<sup>asws</sup> Hadeeth; and the one of the most evil of states of them in my<sup>asws</sup> presence and the most detestable is the one who when he hears the Hadeeth linked to us<sup>asws</sup>, and is being reports as being from us<sup>asws</sup>, but he does not accept it and is constricted from it, and fights against it, and disbelieves from making a Religion with it, and he does not know perhaps the Hadeeth is coming out from us<sup>asws</sup>, and to us<sup>asws</sup> is the link, therefore, due to that, he would happen to exit from our<sup>asws</sup> Wilayah’."
          ],
          "en.sarwar": [
            "7. It is narrated from him (narrator of the Hadith above) from Ahmad ibn Muhammad from ibn Mahbub from Jamil ibn Salih from abu ‘Ubaydah al- Hadhdha’ who has said the following: “I heard abu Ja’far (a.s.) saying, ‘By Allah, the most beloved to me of my companions are most restraining from the worldly attractions (sins), most knowledgeable in Fiqh (laws of Shari’a) and most secretive in our Hadith. Of the worst conditions among them and most disliked is the one who on hearing Hadith ascribes it to us and narrates it from us. Not only does he not accept it, also he abhors it and rejects it. He has made those who follow it turn to disbelief while he does not know. Perhaps the Hadith has come out from us and to us is ascribed and with this he will be out of our Walayah (guardianship).’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (191/ 9)"
        ],
        "index": 2263,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:98:8",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ يَحْيَى عَنْ حَرِيزٍ عَنْ مُعَلَّى بْنِ خُنَيْسٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا مُعَلَّى اكْتُمْ أَمْرَنَا وَ لَا تُذِعْهُ فَإِنَّهُ مَنْ كَتَمَ أَمْرَنَا وَ لَمْ يُذِعْهُ أَعَزَّهُ اللَّهُ بِهِ فِي الدُّنْيَا وَ جَعَلَهُ نُوراً بَيْنَ عَيْنَيْهِ فِي الْآخِرَةِ يَقُودُهُ إِلَى الْجَنَّةِ ",
          "يَا مُعَلَّى مَنْ أَذَاعَ أَمْرَنَا وَ لَمْ يَكْتُمْهُ أَذَلَّهُ اللَّهُ بِهِ فِي الدُّنْيَا وَ نَزَعَ النُّورَ مِنْ بَيْنِ عَيْنَيْهِ فِي الْآخِرَةِ وَ جَعَلَهُ ظُلْمَةً تَقُودُهُ إِلَى النَّارِ ",
          "يَا مُعَلَّى إِنَّ التَّقِيَّةَ مِنْ دِينِي وَ دِينِ آبَائِي وَ لَا دِينَ لِمَنْ لَا تَقِيَّةَ لَهُ ",
          "يَا مُعَلَّى إِنَّ اللَّهَ يُحِبُّ أَنْ يُعْبَدَ فِي السِّرِّ كَمَا يُحِبُّ أَنْ يُعْبَدَ فِي الْعَلَانِيَةِ ",
          "يَا مُعَلَّى إِنَّ الْمُذِيعَ لِأَمْرِنَا كَالْجَاحِدِ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Abdullah Bin Yahya, from Hareyz, from Moalla Bin Khunays who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘O Moalla! Conceal our<sup>asws</sup> matter and do not broadcast it, for the one who conceals our<sup>asws</sup> matter and does not broadcast would be Honoured by Allah<sup>azwj</sup> in the world due to it, and He<sup>azwj</sup> would Make a light to be in between his eyes in the Hereafter, guiding him to the Paradise.",
            "O Moalla! The one who broadcasts our<sup style=\"font-weight: normal\">asws</sup> matter and does not conceal it, Allah<sup style=\"font-weight: normal\">azwj</sup> would Humiliate him in the world due to it, and Remove the light from in between his eyes in the Hereafter, and Make a darkness to be for him, guiding him to the Fire. ",
            "O Moalla! The dissimulation is from my<sup style=\"font-weight: normal\">asws</sup> Religion and the Religion of my<sup style=\"font-weight: normal\">asws</sup> forefathers<sup style=\"font-weight: normal\">asws</sup>; and there is no Religion for the one who has no dissimulation (<span class=\"iTxt\">Taqiyya</span>) for him. ",
            "O Moalla! Allah<sup style=\"font-weight: normal\">azwj</sup> Loves to be worshipped in the privacy just as He<sup style=\"font-weight: normal\">azwj</sup> Loves to be worshipped openly. ",
            "O Moalla! The broadcaster of our<sup style=\"font-weight: normal\">asws</sup> matter is like the rejector of it’."
          ],
          "en.sarwar": [
            "8. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father from ‘Abd Allah ibn Yahya from Hariz from Mu’alla ibn Khanith who has said the following: “Once abu ‘Abd Allah (a.s.) said to me, ‘O Mu’alla, conceal our cause and do not make it public; to those who conceal our cause and do not publicize it, Allah grants honor in this world. He will make it a light between his eyes in the next life and lead him to paradise. O Mu’alla, whoever publicizes our cause and does not conceal it, Allah humiliates him in this world, removes the light between his eyes in the next life and will make darkness to lead him to fire. O Mu’alla, al-Taqiyyah is my religion and the religion of my predecessors. There is no religion for one who does not observe al-Taqiyyah. O Mu’alla, Allah loves to be worshipped secretly just as He loves to be worshipped publicly. O Mu’alla, one who publicizes our cause is like one who rejects it altogather.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/192)"
        ],
        "index": 2264,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:98:9",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ مَرْوَانَ بْنِ مُسْلِمٍ عَنْ عَمَّارٍ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَخْبَرْتَ بِمَا أَخْبَرْتُكَ بِهِ أَحَداً قُلْتُ لَا إِلَّا سُلَيْمَانَ بْنَ خَالِدٍ قَالَ أَحْسَنْتَ أَ مَا سَمِعْتَ قَوْلَ الشَّاعِرِ. فَلَا يَعْدُوَنْ سِرِّي وَ سِرُّكَ ثَالِثاً أَلَا كُلُّ سِرٍّ جَاوَزَ اثْنَيْنِ شَائِعٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Ali, from Marwan Bin Muslim, from Ammar who said, ",
            "‘Abu Abdullah<sup>asws</sup> said to me: ‘Did you inform anyone with what I<sup>asws</sup> informed you with?’ I said, ‘No, except for Suleyman Bin Khalid’. He<sup>asws</sup> said: ‘You have done well. Have you not heard the words of the poet – ‘Do not be repeating my secret and your secret to a third one! Indeed! Every secret exceeding two (has become) common (knowledge)’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al- Hassan ibn Ali from Marwan ibn Muslim from ‘Ammar who has said the following: “Once abu ‘Abd Allah (a.s.) asked me, ‘Did you tell anyone what I told you?’ I said, ‘No, I have not told anyone except Sulayman ibn Khalid.’ The Imam said, ‘Very good. Have you not heard the words of the poet: ‘Do not allow my secret and your secret pass to a third party. Is it not the case that a secret passing two people is public?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/192)"
        ],
        "index": 2265,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:98:10",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ الرِّضَا ( عليه السلام ) عَنْ مَسْأَلَةٍ فَأَبَى وَ أَمْسَكَ ثُمَّ قَالَ لَوْ أَعْطَيْنَاكُمْ كُلَّمَا تُرِيدُونَ كَانَ شَرّاً لَكُمْ وَ أُخِذَ بِرَقَبَةِ صَاحِبِ هَذَا الْأَمْرِ ",
          "قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) وَلَايَةُ اللَّهِ أَسَرَّهَا إِلَى جَبْرَئِيلَ ( عليه السلام ) وَ أَسَرَّهَا جَبْرَئِيلُ إِلَى مُحَمَّدٍ ( صلى الله عليه وآله ) وَ أَسَرَّهَا مُحَمَّدٌ إِلَى عَلِيٍّ ( عليه السلام ) وَ أَسَرَّهَا عَلِيٌّ إِلَى مَنْ شَاءَ اللَّهُ ثُمَّ أَنْتُمْ تُذِيعُونَ ذَلِكَ مَنِ الَّذِي أَمْسَكَ حَرْفاً سَمِعَهُ ",
          "قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) فِي حِكْمَةِ آلِ دَاوُدَ يَنْبَغِي لِلْمُسْلِمِ أَنْ يَكُونَ مَالِكاً لِنَفْسِهِ مُقْبِلًا عَلَى شَأْنِهِ عَارِفاً بِأَهْلِ زَمَانِهِ فَاتَّقُوا اللَّهَ وَ لَا تُذِيعُوا حَدِيثَنَا فَلَوْ لَا أَنَّ اللَّهَ يُدَافِعُ عَنْ أَوْلِيَائِهِ وَ يَنْتَقِمُ لِأَوْلِيَائِهِ مِنْ أَعْدَائِهِ ",
          "أَ مَا رَأَيْتَ مَا صَنَعَ اللَّهُ بِآلِ بَرْمَكَ وَ مَا انْتَقَمَ اللَّهُ لِأَبِي الْحَسَنِ ( عليه السلام ) وَ قَدْ كَانَ بَنُو الْأَشْعَثِ عَلَى خَطَرٍ عَظِيمٍ فَدَفَعَ اللَّهُ عَنْهُمْ بِوَلَايَتِهِمْ لِأَبِي الْحَسَنِ ( عليه السلام ) وَ أَنْتُمْ بِالْعِرَاقِ تَرَوْنَ أَعْمَالَ هَؤُلَاءِ الْفَرَاعِنَةِ وَ مَا أَمْهَلَ اللَّهُ لَهُمْ فَعَلَيْكُمْ بِتَقْوَى اللَّهِ وَ لَا تَغُرَّنَّكُمُ الْحَيَاةُ الدُّنْيَا وَ لَا تَغْتَرُّوا بِمَنْ قَدْ أُمْهِلَ لَهُ فَكَأَنَّ الْأَمْرَ قَدْ وَصَلَ إِلَيْكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ahmad Bin Muhammad Bin Abu Nasr who said, ",
            "‘I asked Abu Al-Hassan Al-Reza<sup>asws</sup> a question, but he<sup>asws</sup> refused (to answer) and withheld, then said: ‘If<sup>asws</sup> were to give you everything what you want, it would (bring about) evil to you and the one (found to be) with this matter would be seized by the neck. ",
            "Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> said: ‘The Wilayah of Allah<sup style=\"font-weight: normal\">azwj</sup> was secrectly conveyed to Jibraeel<sup style=\"font-weight: normal\">as</sup>, and Jibraeel<sup style=\"font-weight: normal\">as</sup> secretly conveyed it to Muhammad<sup style=\"font-weight: normal\">saww</sup>, and Muhammad<sup style=\"font-weight: normal\">saww</sup> secretly conveyed it to Ali<sup style=\"font-weight: normal\">asws</sup>, and Ali<sup style=\"font-weight: normal\">asws</sup> secretly conveyed it to whoever Allah<sup style=\"font-weight: normal\">azwj</sup> so Desired it (to be conveyed to). Then, you all are broadcasting that. Who is the one who has withheld (even) a single word which he heard?’ ",
            "Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> said: ‘In the wisdom of the progeny of Dawood<sup style=\"font-weight: normal\">as</sup> (it is), ‘it is befitting for the Muslim that he happens to be in control of himself, determined upon his affairs, recognising the people of his time period. Therefore fear Allah<sup style=\"font-weight: normal\">azwj</sup> and do not be broadcasting our<sup style=\"font-weight: normal\">asws</sup> Ahadeeth, if not, Allah<sup style=\"font-weight: normal\">azwj</sup> would Defend His<sup style=\"font-weight: normal\">azwj</sup> friends and exact Retribution fromHis<sup style=\"font-weight: normal\">azwj</sup> enemies.",
            "Have you not seen what Allah<sup style=\"font-weight: normal\">azwj</sup> Did with the progeny of Barmak and what Retribution Allah<sup style=\"font-weight: normal\">azwj</sup> Exacted for Abu Al-Hassan<sup style=\"font-weight: normal\">asws</sup>? And it was so that the Clan of Al-Ash’as was upon a great danger, so Allah<sup style=\"font-weight: normal\">azwj</sup> Defended them due to their Wilayah for Abu Al-Hassan<sup style=\"font-weight: normal\">asws</sup>. And you all are in Al-Iraq. You are seeing the deeds of these Pharaohs (tyrants), and what Respite Allah<sup style=\"font-weight: normal\">azwj</sup> has for them. Therefore, it is upon you with the fearing of Allah<sup style=\"font-weight: normal\">azwj</sup>, and neither be deceived by the life of the world nor deceived by the one who has Respite for him, for it is as if the matter (Rising of Al-Qaim<sup style=\"font-weight: normal\">asws</sup>) have (almost) arrived to you’."
          ],
          "en.sarwar": [
            "10. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ahmad ibn Muhammad ibn abu Nasr who has said the following: “Once I asked abu al-Hassan al-Rida (a.s.) a question. He refrained silently and said, ‘If we give you everything you want, it may become evil for you and the neck of the owner of this cause will be caught tight.’ “Abu Ja’far (a.s.) has said, ‘It is the guardianship of Allah, Who told it secretly to Jibril, who secretly told it to Muhammad (a.s.) who secretly told it to Ali (a.s.) who secretly told it to whoever Allah wanted and then you publicize it. Who is he that has heard a word then has held it secretly?’ “Abu Ja’far (a.s.) has said, ‘It is in the wisdom of ‘Ale Dawud (family of David), “It is necessary for a Muslim to have control over his soul, be attentive to his affairs and have foil knowledge of the people of his time.” Be pious before Allah and do not publicize our Hadith. It is a fact that Allah defends his friends and exacts recompense for His friends from His enemies. Have you considered how Allah dealt with Ale Barmak (family of Barmak) and how He recompensed for abu al-Hassan (a.s.) when banu ‘Ash’ath faced the great danger and Allah defended them for their supporting abu al- Hassan, recipient of divine supreme covenant? In Iraq you are well aware of the deeds of those Pharaohs and the respite that Allah has given them. Therefore, you must observe piety before Allah and do not allow the worldly life to deceive you. Do not be confused about those who have been given respite. It is as if the matter (reappearance of al-Mahdi, recipient of divine supreme covenant) is almost within your reach.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/197)"
        ],
        "index": 2266,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:98:11",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ عُمَرَ بْنِ أَبَانٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) طُوبَى لِعَبْدٍ نُوَمَةٍ عَرَفَهُ اللَّهُ وَ لَمْ يَعْرِفْهُ النَّاسُ أُولَئِكَ مَصَابِيحُ الْهُدَى وَ يَنَابِيعُ الْعِلْمِ يَنْجَلِي عَنْهُمْ كُلُّ فِتْنَةٍ مُظْلِمَةٍ لَيْسُوا بِالْمَذَايِيعِ الْبُذُرِ وَ لَا بِالْجُفَاةِ الْمُرَاءِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan Bin Ali Al Washa, from Umar Bin Aban, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘Rasool-Allah<sup>saww</sup> said: ‘Touba (a tree in Paradise) is for the obscure servant. Allah<sup>azwj</sup> Recognises him and the people do not recognise him. They are the lanterns of guidance and fountains of knowledge, every dark strife brightens up. They are not with the broadcasting of the seeding (imparted knowledge), nor are they with the quarrelsome hypocrites’."
          ],
          "en.sarwar": [
            "11. Al-Husayn ibn Muhammad has narrated from Mu’alla ibn Muhammad from al- Hassan ibn Ali al-Washsha’ from ‘Umar ibn Aban from abu Basir who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘The Messenger of Allah has said, “Tuba’ (a tree in paradise) is for a servant who is unknown to people but Allah knows him. Such people are the torches of guidance and the fountains of knowledge. Through them every darkening calamity brightens. They do not publicize undisclosed facts and they are not quarrelsome braggarts.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/198)"
        ],
        "index": 2267,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:98:12",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ أَبِي الْحَسَنِ الْأَصْبَهَانِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) طُوبَى لِكُلِّ عَبْدٍ نُوَمَةٍ لَا يُؤْبَهُ لَهُ يَعْرِفُ النَّاسَ وَ لَا يَعْرِفُهُ النَّاسُ يَعْرِفُهُ اللَّهُ مِنْهُ بِرِضْوَانٍ أُولَئِكَ مَصَابِيحُ الْهُدَى يَنْجَلِي عَنْهُمْ كُلُّ فِتْنَةٍ مُظْلِمَةٍ وَ يُفْتَحُ لَهُمْ بَابُ كُلِّ رَحْمَةٍ لَيْسُوا بِالْبُذُرِ الْمَذَايِيعِ وَ لَا الْجُفَاةِ الْمُرَاءِينَ ",
          "وَ قَالَ قُولُوا الْخَيْرَ تُعْرَفُوا بِهِ وَ اعْمَلُوا الْخَيْرَ تَكُونُوا مِنْ أَهْلِهِ وَ لَا تَكُونُوا عُجُلًا مَذَايِيعَ فَإِنَّ خِيَارَكُمُ الَّذِينَ إِذَا نُظِرَ إِلَيْهِمْ ذُكِرَ اللَّهُ وَ شِرَارُكُمُ الْمَشَّاءُونَ بِالنَّمِيمَةِ الْمُفَرِّقُونَ بَيْنَ الْأَحِبَّةِ الْمُبْتَغُونَ لِلْبُرَآءِ الْمَعَايِبَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Abu Al Hassan Al Isbahany, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-<span class=\"iTxt\">Momin</span>een<sup>asws</sup> said: ‘Touba (a tree in Paradise) is for every obscure servant. It is irrelevant whether the people know him or they do not know him (famous or not). Allah<sup>azwj</sup> does Recognise him from them with Pleasure. They are the lanterns of guidance. Every dark strife brightens up from them, and the door of every Mercy opens up for them. They are neither with the broadcasting of the seeding (imparted knowledge), nor are they with the quarrelsome hypocrites’. ",
            "And he<sup>asws</sup> said: ‘Speak well, you will be recognised by it, and do good works, you would become from its rightful ones, and do not become hasty broadcasters, for the best ones of you are those who whey they are looked at, Allah<sup>azwj</sup> is remembered; and the most evil ones of you are the slanderers with the gossip, the separators between the loved ones, the seekers of the faults of the righteous ones’."
          ],
          "en.sarwar": [
            "12. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from abu al- Hassan al-Asbahani from abu ‘Abd Allah (a.s.) who has said the following: “Amir al-Mu’minin (Ali ibn abu Talib) (a.s.) has said, ‘Tuba’ (a tree in paradise) is for every servant (of Allah) who is unnoticed among the people but knows people and they do not know him. Allah knows him from His side with happiness. They are the torches of guidance. Through them every darkening calamity is removed aside and for them every door to blessing opens. They do not publicize undisclosed facts and they are not quarrelsome braggarts.’ He has also said, ‘Speak of the good so you become known for it. Do good and be of its people and do not be hastening announcers. The best of you are those who on looking up on them one is reminded of Allah and the wicked ones among you are those who publicize undisclosed facts, cause separation among the loved ones and search for faults in the innocent people.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/200)"
        ],
        "index": 2268,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:98:13",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَمَّنْ أَخْبَرَهُ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كُفُّوا أَلْسِنَتَكُمْ وَ الْزَمُوا بُيُوتَكُمْ فَإِنَّهُ لَا يُصِيبُكُمْ أَمْرٌ تَخُصُّونَ بِهِ أَبَداً وَ لَا تَزَالُ الزَّيْدِيَّةُ لَكُمْ وِقَاءً أَبَداً ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from usman Bin Isa, from the one who informed him who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Restrain your tongues and bind (yourselves) to your houses, so no matter would hit you specialising you with it, ever, nor would the Zaidites cease to be shielding you, ever!’"
          ],
          "en.sarwar": [
            "13. A number of our people have narrated from Ahmad ibn Muhammad from ‘Uthman ibn ‘Isa from those he has narrated from and who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘Control your tongues and stay home, no one will ever disturb you in particular. Zaydi people are still a protection for you and they will always be as such.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/200)"
        ],
        "index": 2269,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:98:14",
        "text": [
          "عَنْهُ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ أَبِي الْحَسَنِ ( صلوات الله عليه )  قَالَ إِنْ كَانَ فِي يَدِكَ هَذِهِ شَيْ‏ءٌ فَإِنِ اسْتَطَعْتَ أَنْ لَا تَعْلَمَ هَذِهِ فَافْعَلْ ",
          "قَالَ وَ كَانَ عِنْدَهُ إِنْسَانٌ فَتَذَاكَرُوا الْإِذَاعَةَ فَقَالَ احْفَظْ لِسَانَكَ تُعَزَّ وَ لَا تُمَكِّنِ النَّاسَ مِنْ قِيَادِ رَقَبَتِكَ فَتَذِلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Usman Bin Isa, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> having said: ‘If it was so that this matter (Al-Wilayah) was in your hands and you have the capacity that you do not teach this, then do so’. ",
            "He (the narrator) said, ‘And it was so that in his<sup style=\"font-weight: normal\">asws</sup> presence were some people, and they mentioned the broadcasting, so he<sup style=\"font-weight: normal\">asws</sup> said: ‘Preserve your tongues, you would be honoured, and do not enable the people to sit upon your necks, for you would be disgraced’."
          ],
          "en.sarwar": [
            "14. It is narrated from him (narrator of the Hadith above) from ‘Uthman ibn ‘Isa from abu al-Hassan (a.s.) who has said the following: “When there is something in one of your hands, if you can, do not allow the other hand to know about it.’ The narrator has said that there was a man in his presence and they discussed publicity. The Imam said, ‘Control your tongue and you will find honor and do not allow people to become in control of your neck to humiliate you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/201)"
        ],
        "index": 2270,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:98:15",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ خَالِدِ بْنِ نَجِيحٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ أَمْرَنَا مَسْتُورٌ مُقَنَّعٌ بِالْمِيثَاقِ فَمَنْ هَتَكَ عَلَيْنَا أَذَلَّهُ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Khalid Bin Najeeh, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Our<sup>asws</sup> matter is veiled, masked by the Covenant. So the one who tears (the veil) upon us, Allah<sup>azwj</sup> would Disgrace him’."
          ],
          "en.sarwar": [
            "15. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from Khalid ibn Nujayh from abu ‘Abd Allah (a.s.) who has said the following: “Our cause is hidden and veiled by the (Divine) covenant. Whoever disregards it against us Allah will humiliate him.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/201)"
        ],
        "index": 2271,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:98:16",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ يَحْيَى جَمِيعاً عَنْ عَلِيِّ بْنِ مُحَمَّدِ بْنِ سَعْدٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ مُحَمَّدِ بْنِ سَعِيدِ بْنِ غَزْوَانَ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عُمَرَ بْنِ أَبَانٍ عَنْ عِيسَى بْنِ أَبِي مَنْصُورٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ نَفَسُ الْمَهْمُومِ لَنَا الْمُغْتَمِّ لِظُلْمِنَا تَسْبِيحٌ وَ هَمُّهُ لِأَمْرِنَا عِبَادَةٌ وَ كِتْمَانُهُ لِسِرِّنَا جِهَادٌ فِي سَبِيلِ اللَّهِ ",
          "قَالَ لِي مُحَمَّدُ بْنُ سَعِيدٍ اكْتُبْ هَذَا بِالذَّهَبِ فَمَا كَتَبْتَ شَيْئاً أَحْسَنَ مِنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, and Muhammad Bin Yahya, altogether from Ali Bin Muhammad Bin Sa’ad, from Muhammad Bin Muslim, from Muhammad Bin Saeed Bin Gazwan, from Ali Bin Al Hakam, from Umar Bin Aban, from Isa Bin Abu Mansour who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘A concerned sigh for us<sup>asws</sup> due the grief for the injustices upon us<sup>asws</sup>, is a Glorification, and thinking of our<sup>asws</sup> matter is a worship, and concealment of our<sup>asws</sup> secrets is <span class=\"iTxt\">Jihād</span> in the Way of Allah<sup>azwj</sup>’. ",
            "Muhammad Bin Saeed said to me, ‘Write this in gold, for you will not be writing anything more excellent than it’."
          ],
          "en.sarwar": [
            "16. Al-Husayn ibn Muhammad an Muhammad ibn Yahya all have narrated from Ali ibn Muhammad ibn Sa’d from Muhammad ibn Muslim from Muhammad ibn Sa’id ibn Ghazwan from Ali ibn al-Hakam from ‘Umar ibn Aban from ‘Isa ibn abu Mansur who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘A breath with a sigh of concern and sadness due to injustice done to us is Tasbih (speaking of the glory of Allah) and one’s concern about our cause is worship, his concealing our secret is Jihad (hard work for the cause of Allah).”’ “Muhammad ibn Sa’id told me to write it down with gold. I then did not write anything better than that.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:98",
  "kind": "verse_list"
}