{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 99"
        },
        "path": "/books/al-kafi:2:1:99",
        "titles": {
          "ar": "بَابُ الْمُؤْمِنِ وَ عَلَامَاتِهِ وَ صِفَاتِهِ",
          "en": "Chapter 99 –The Momin, and his signs, and his description"
        }
      }
    ],
    "index": 287,
    "local_index": 99,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 100"
        },
        "path": "/books/al-kafi:2:1:100",
        "titles": {
          "ar": "بَابٌ فِي قِلَّةِ عَدَدِ الْمُؤْمِنِينَ",
          "en": "Chapter 100 – The smallness of the number of the Momineen"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 98"
        },
        "path": "/books/al-kafi:2:1:98",
        "titles": {
          "ar": "بَابُ الْكِتْمَانِ",
          "en": "Chapter 98 – The Concealment"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:2:1",
        "titles": {
          "ar": "كتاب الإيمان و الكفر",
          "en": "THE BOOK OF BELIEF (Emān) AND DISBELIEF (KUFR)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:1:99",
    "titles": {
      "ar": "بَابُ الْمُؤْمِنِ وَ عَلَامَاتِهِ وَ صِفَاتِهِ",
      "en": "Chapter 99 –The Momin, and his signs, and his description"
    },
    "verse_count": 39,
    "verse_start_index": 2271,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/202)"
        ],
        "index": 2272,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1789",
              "text": "مُحَمَّدُ بْنُ جَعْفَرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/339",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1790",
              "text": "عَبْدِ اللَّهِ بْنِ دَاهِرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1791",
              "text": "الْحَسَنِ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1792",
              "text": "قُثَمَ أَبِي قَتَادَةَ الْحَرَّانِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1793",
              "text": "عَبْدِ اللَّهِ بْنِ يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ عَبْدِ اللَّهِ بْنِ دَاهِرٍ عَنِ الْحَسَنِ بْنِ يَحْيَى عَنْ قُثَمَ أَبِي قَتَادَةَ الْحَرَّانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ يُونُسَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:1",
        "text": [
          " قَامَ رَجُلٌ يُقَالُ لَهُ هَمَّامٌ وَ كَانَ عَابِداً نَاسِكاً مُجْتَهِداً إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) وَ هُوَ يَخْطُبُ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ صِفْ لَنَا صِفَةَ الْمُؤْمِنِ كَأَنَّنَا نَنْظُرُ إِلَيْهِ",
          "فَقَالَ يَا هَمَّامُ الْمُؤْمِنُ هُوَ الْكَيِّسُ الْفَطِنُ بِشْرُهُ فِي وَجْهِهِ وَ حُزْنُهُ فِي قَلْبِهِ أَوْسَعُ شَيْ‏ءٍ صَدْراً وَ أَذَلُّ شَيْ‏ءٍ نَفْساً زَاجِرٌ عَنْ كُلِّ فَانٍ حَاضٌّ عَلَى كُلِّ حَسَنٍ لَا حَقُودٌ وَ لَا حَسُودٌ وَ لَا وَثَّابٌ وَ لَا سَبَّابٌ وَ لَا عَيَّابٌ وَ لَا مُغْتَابٌ يَكْرَهُ الرِّفْعَةَ وَ يَشْنَأُ السُّمْعَةَ طَوِيلُ الْغَمِّ بَعِيدُ الْهَمِّ كَثِيرُ الصَّمْتِ وَقُورٌ ذَكُورٌ صَبُورٌ شَكُورٌ مَغْمُومٌ بِفِكْرِهِ مَسْرُورٌ بِفَقْرِهِ سَهْلُ الْخَلِيقَةِ لَيِّنُ الْعَرِيكَةِ رَصِينُ الْوَفَاءِ قَلِيلُ الْأَذَى لَا مُتَأَفِّكٌ وَ لَا مُتَهَتِّكٌ",
          "إِنْ ضَحِكَ لَمْ يَخْرَقْ وَ إِنْ غَضِبَ لَمْ يَنْزَقْ ضِحْكُهُ تَبَسُّمٌ وَ اسْتِفْهَامُهُ تَعَلُّمٌ وَ مُرَاجَعَتُهُ تَفَهُّمٌ كَثِيرٌ عِلْمُهُ عَظِيمٌ حِلْمُهُ كَثِيرُ الرَّحْمَةِ لَا يَبْخَلُ وَ لَا يَعْجَلُ وَ لَا يَضْجَرُ وَ لَا يَبْطَرُ وَ لَا يَحِيفُ فِي حُكْمِهِ وَ لَا يَجُورُ فِي عِلْمِهِ نَفْسُهُ أَصْلَبُ مِنَ الصَّلْدِ وَ مُكَادَحَتُهُ أَحْلَى مِنَ الشَّهْدِ لَا جَشِعٌ وَ لَا هَلِعٌ وَ لَا عَنِفٌ وَ لَا صَلِفٌ وَ لَا مُتَكَلِّفٌ وَ لَا مُتَعَمِّقٌ جَمِيلُ الْمُنَازَعَةِ كَرِيمُ الْمُرَاجَعَةِ عَدْلٌ إِنْ غَضِبَ رَفِيقٌ إِنْ طَلَبَ ",
          "لَا يَتَهَوَّرُ وَ لَا يَتَهَتَّكُ وَ لَا يَتَجَبَّرُ خَالِصُ الْوُدِّ وَثِيقُ الْعَهْدِ وَفِيُّ الْعَقْدِ شَفِيقٌ وَصُولٌ حَلِيمٌ خَمُولٌ قَلِيلُ الْفُضُولِ رَاضٍ عَنِ اللَّهِ عَزَّ وَ جَلَّ مُخَالِفٌ لِهَوَاهُ لَا يَغْلُظُ عَلَى مَنْ دُونَهُ وَ لَا يَخُوضُ فِيمَا لَا يَعْنِيهِ نَاصِرٌ لِلدِّينِ مُحَامٍ عَنِ الْمُؤْمِنِينَ كَهْفٌ لِلْمُسْلِمِينَ لَا يَخْرِقُ الثَّنَاءُ سَمْعَهُ وَ لَا يَنْكِي الطَّمَعُ قَلْبَهُ وَ لَا يَصْرِفُ اللَّعِبُ حُكْمَهُ وَ لَا يُطْلِعُ الْجَاهِلَ عِلْمَهُ",
          "قَوَّالٌ عَمَّالٌ عَالِمٌ حَازِمٌ لَا بِفَحَّاشٍ وَ لَا بِطَيَّاشٍ وَصُولٌ فِي غَيْرِ عُنْفٍ بَذُولٌ فِي غَيْرِ سَرَفٍ لَا بِخَتَّالٍ وَ لَا بِغَدَّارٍ وَ لَا يَقْتَفِي أَثَراً وَ لَا يَحِيفُ بَشَراً رَفِيقٌ بِالْخَلْقِ سَاعٍ فِي الْأَرْضِ عَوْنٌ لِلضَّعِيفِ غَوْثٌ لِلْمَلْهُوفِ لَا يَهْتِكُ سِتْراً وَ لَا يَكْشِفُ سِرّاً كَثِيرُ الْبَلْوَى قَلِيلُ الشَّكْوَى",
          "إِنْ رَأَى خَيْراً ذَكَرَهُ وَ إِنْ عَايَنَ شَرّاً سَتَرَهُ يَسْتُرُ الْعَيْبَ وَ يَحْفَظُ الْغَيْبَ وَ يُقِيلُ الْعَثْرَةَ وَ يَغْفِرُ الزَّلَّةَ لَا يَطَّلِعُ عَلَى نُصْحٍ فَيَذَرَهُ وَ لَا يَدَعُ جِنْحَ حَيْفٍ فَيُصْلِحَهُ أَمِينٌ رَصِينٌ تَقِيٌّ نَقِيٌّ زَكِيٌّ رَضِيٌّ يَقْبَلُ الْعُذْرَ وَ يُجْمِلُ الذِّكْرَ وَ يُحْسِنُ بِالنَّاسِ الظَّنَّ وَ يَتَّهِمُ عَلَى الْعَيْبِ نَفْسَهُ",
          "يُحِبُّ فِي اللَّهِ بِفِقْهٍ وَ عِلْمٍ وَ يَقْطَعُ فِي اللَّهِ بِحَزْمٍ وَ عَزْمٍ لَا يَخْرَقُ بِهِ فَرَحٌ وَ لَا يَطِيشُ بِهِ مَرَحٌ مُذَكِّرٌ لِلْعَالِمِ مُعَلِّمٌ لِلْجَاهِلِ لَا يُتَوَقَّعُ لَهُ بَائِقَةٌ وَ لَا يُخَافُ لَهُ غَائِلَةٌ كُلُّ سَعْيٍ أَخْلَصُ عِنْدَهُ مِنْ سَعْيِهِ وَ كُلُّ نَفْسٍ أَصْلَحُ عِنْدَهُ مِنْ نَفْسِهِ عَالِمٌ بِعَيْبِهِ شَاغِلٌ بِغَمِّهِ لَا يَثِقُ بِغَيْرِ رَبِّهِ غَرِيبٌ وَحِيدٌ جَرِيدٌ حَزِينٌ ",
          "يُحِبُّ فِي اللَّهِ وَ يُجَاهِدُ فِي اللَّهِ لِيَتَّبِعَ رِضَاهُ وَ لَا يَنْتَقِمُ لِنَفْسِهِ بِنَفْسِهِ وَ لَا يُوَالِي فِي سَخَطِ رَبِّهِ مُجَالِسٌ لِأَهْلِ الْفَقْرِ مُصَادِقٌ لِأَهْلِ الصِّدْقِ مُؤَازِرٌ لِأَهْلِ الْحَقِّ عَوْنٌ لِلْقَرِيبِ أَبٌ لِلْيَتِيمِ بَعْلٌ لِلْأَرْمَلَةِ حَفِيٌّ بِأَهْلِ الْمَسْكَنَةِ مَرْجُوٌّ لِكُلِّ كَرِيهَةٍ مَأْمُولٌ لِكُلِّ شِدَّةٍ",
          "هَشَّاشٌ بَشَّاشٌ لَا بِعَبَّاسٍ وَ لَا بِجَسَّاسٍ صَلِيبٌ كَظَّامٌ بَسَّامٌ دَقِيقُ النَّظَرِ عَظِيمُ الْحَذَرِ لَا يَجْهَلُ وَ إِنْ جُهِلَ عَلَيْهِ يَحْلُمُ لَا يَبْخَلُ وَ إِنْ بُخِلَ عَلَيْهِ صَبَرَ عَقَلَ فَاسْتَحْيَا وَ قَنِعَ فَاسْتَغْنَى حَيَاؤُهُ يَعْلُو شَهْوَتَهُ وَ وُدُّهُ يَعْلُو حَسَدَهُ وَ عَفْوُهُ يَعْلُو حِقْدَهُ",
          "لَا يَنْطِقُ بِغَيْرِ صَوَابٍ وَ لَا يَلْبَسُ إِلَّا الِاقْتِصَادِ مَشْيُهُ التَّوَاضُعُ خَاضِعٌ لِرَبِّهِ بِطَاعَتِهِ رَاضٍ عَنْهُ فِي كُلِّ حَالَاتِهِ نِيَّتُهُ خَالِصَةٌ أَعْمَالُهُ لَيْسَ فِيهَا غِشٌّ وَ لَا خَدِيعَةٌ نَظَرُهُ عِبْرَةٌ سُكُوتُهُ فِكْرَةٌ وَ كَلَامُهُ حِكْمَةٌ مُنَاصِحاً مُتَبَاذِلًا مُتَوَاخِياً نَاصِحٌ فِي السِّرِّ وَ الْعَلَانِيَةِ",
          "لَا يَهْجُرُ أَخَاهُ وَ لَا يَغْتَابُهُ وَ لَا يَمْكُرُ بِهِ وَ لَا يَأْسَفُ عَلَى مَا فَاتَهُ وَ لَا يَحْزَنُ عَلَى مَا أَصَابَهُ وَ لَا يَرْجُو مَا لَا يَجُوزُ لَهُ الرَّجَاءُ وَ لَا يَفْشَلُ فِي الشِّدَّةِ وَ لَا يَبْطَرُ فِي الرَّخَاءِ يَمْزُجُ الْحِلْمَ بِالْعِلْمِ وَ الْعَقْلَ بِالصَّبْرِ تَرَاهُ بَعِيداً كَسَلُهُ دَائِماً نَشَاطُهُ قَرِيباً أَمَلُهُ قَلِيلًا زَلَلُهُ",
          "مُتَوَقِّعاً لِأَجَلِهِ خَاشِعاً قَلْبُهُ ذَاكِراً رَبَّهُ قَانِعَةً نَفْسُهُ مَنْفِيّاً جَهْلُهُ سَهْلًا أَمْرُهُ حَزِيناً لِذَنْبِهِ مَيِّتَةً شَهْوَتُهُ كَظُوماً غَيْظَهُ صَافِياً خُلُقُهُ آمِناً مِنْهُ جَارُهُ ضَعِيفاً كِبْرُهُ قَانِعاً بِالَّذِي قُدِّرَ لَهُ مَتِيناً صَبْرُهُ مُحْكَماً أَمْرُهُ كَثِيراً ذِكْرُهُ",
          "يُخَالِطُ النَّاسَ لِيَعْلَمَ وَ يَصْمُتُ لِيَسْلَمَ وَ يَسْأَلُ لِيَفْهَمَ وَ يَتَّجِرُ لِيَغْنَمَ لَا يُنْصِتُ لِلْخَبَرِ لِيَفْجُرَ بِهِ وَ لَا يَتَكَلَّمُ لِيَتَجَبَّرَ بِهِ عَلَى مَنْ سِوَاهُ نَفْسُهُ مِنْهُ فِي عَنَاءٍ وَ النَّاسُ مِنْهُ فِي رَاحَةٍ أَتْعَبَ نَفْسَهُ لآِخِرَتِهِ فَأَرَاحَ النَّاسَ مِنْ نَفْسِهِ إِنْ بُغِيَ عَلَيْهِ صَبَرَ حَتَّى يَكُونَ اللَّهُ الَّذِي يَنْتَصِرُ لَهُ بُعْدُهُ مِمَّنْ تَبَاعَدَ مِنْهُ بُغْضٌ وَ نَزَاهَةٌ وَ دُنُوُّهُ مِمَّنْ دَنَا مِنْهُ لِينٌ وَ رَحْمَةٌ لَيْسَ تَبَاعُدُهُ تَكَبُّراً وَ لَا عَظَمَةً وَ لَا دُنُوُّهُ خَدِيعَةً وَ لَا خِلَابَةً بَلْ يَقْتَدِي بِمَنْ كَانَ قَبْلَهُ مِنْ أَهْلِ الْخَيْرِ فَهُوَ إِمَامٌ لِمَنْ بَعْدَهُ مِنْ أَهْلِ الْبِرِّ ",
          "قَالَ فَصَاحَ هَمَّامٌ صَيْحَةً ثُمَّ وَقَعَ مَغْشِيّاً عَلَيْهِ فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَمَا وَ اللَّهِ لَقَدْ كُنْتُ أَخَافُهَا عَلَيْهِ وَ قَالَ هَكَذَا تَصْنَعُ الْمَوْعِظَةُ الْبَالِغَةُ بِأَهْلِهَا فَقَالَ لَهُ قَائِلٌ فَمَا بَالُكَ يَا أَمِيرَ الْمُؤْمِنِينَ فَقَالَ إِنَّ لِكُلٍّ أَجَلًا لَا يَعْدُوهُ وَ سَبَباً لَا يُجَاوِزُهُ فَمَهْلًا لَا تُعِدْ فَإِنَّمَا نَفَثَ عَلَى لِسَانِكَ شَيْطَانٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ja’far, from Muhammad Bin Ismail, from Abdullah Bin Dahir, from Al Hassan Bin Yahya, from Qusam Abu Qatada Al Harrany, from Abdullah Bin Yunus, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A man called Hammam, and he was a worshipper, a performer of rituals, a striver, stood up to Amir Al <span class=\"iTxt\">Momineen</span><sup>asws</sup> while he<sup>asws</sup> was addressing, and he said, ‘O Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup>! Describe to us the description of the <span class=\"iTxt\">Momin</span> (to the extent), as if we are looking at him’. ",
            "So he<sup>asws</sup> said: ‘O Hammam! The <span class=\"iTxt\">Momin</span>, he is the smart, the intelligent. His happiness is in his face and his grief is in his heart; the expansive thing being the chest and the humble thing being the self; restraining from everything and exhorting upon everything good; neither being spiteful, nor envious, nor leaping (quick to argue), nor abusive, nor a fault-finder, nor slanderous. He dislikes the elevation (status), and inimical to be heard of (fame), lengthy of grief, far from worrying, frequent of the silence, dignity, remembrance, gratefulness; being gloomy due to his thoughts and joyful due to his poverty, of the easygoing nature, soft flexibility, strong of loyalty, little hurtfulness, neither being a liar nor immoral.",
            "If he laughs, he does not burst out, and if he is angered he is not reckless. His laughter is a smile, and his questioning is to learn, and his referring is to understand. Abundant is his knowledge, great is his forbearance, and abundant is his mercy. Neither is he stingy, nor hasty, nor annoying, nor reckless, nor is he prejudicial in his wisdom, nor is he preoccupied in his knowledge. His self is more solid than the slab, and his temperament is sweeter than the honey. He is neither greedy, nor does he panic, nor is he violent, nor arrogant, nor pretentious. He is amicable in disputes, benevolent when referred to, judicial when angry, a friend when sought. ",
            "Neither does he jeopardise, nor does he expose (others), nor is he compulsive, being of sincere cordiality, reliable of the agreement, affectionate, maintainer of relationships, forbearing, calm, of little extravagance, being pleased from Allah<sup>azwj</sup> Mighty and Majestic, opposes his own desires. Neither is he harsh upon the one below him, nor does he engage in what does not concern him. A helper of the Religion, a counsellor of the <span class=\"iTxt\">Momineen</span>, a cave (shelter) for the Muslims. Neither does the praise affect him adversely nor does the greed affect his heart adversely, nor does the sport change his wisdom, nor is the ignorant notified of his knowledge. ",
            "(He is) of good vocabulary, a worker, a knowledgeable one, a prudent one. He is neither with immorality, nor with inconstancy, arriving without arrogance, spending without extravagance. Neither is he with treachery nor with betrayal, nor does he pursue the faults (of others) nor is he unjust to a person, being kind of nature. He strives in the land assisting the weak, and a helper of the helpless. Neither does he tear down a veil (expose anyone), nor does he uncover a secret, being afflicted numerously and is of few complaints. ",
            "If he sees a good, remembers it, and if he views an evil, he hides it, veiling the hidden and preserving the unseen, and he dismisses the stumbles and forgives the slips. He does not walk away from an advice that he can give, nor does he leave the blame of a crime but he corrects it. (He is) trustworthy, thoughtful, pious, pure, honest, agreeable. He accepts the excuse and is beautiful in mentioning (others) and thinks good of the people, and he accuses himself upon the faults.",
            "He loves for the Sake of Allah<sup>azwj</sup> with understanding and knowledge, and he cut off (relationships) for the Sake of Allah<sup>azwj</sup> with firmness and determination. Neither does happiness infringe upon him nor does he get excited with cheerfulness. He is a reminder for the knowledgeable one and a teacher of the ignorant. A disaster is not expected to be a disaster nor is an affliction feared from him. Every striving is more sincere in his presence than his own striving, and every self is more correct in his presence than his own self. He knows his own faults, pre-occupied with his sadness. He does not rely with anyone apart from his Lord<sup>azwj</sup>, a stranger, alone, dispossessed, sad.",
            "He loves for the Sake of Allah<sup>azwj</sup> and he struggles for the Sake of Allah<sup>azwj</sup> in order to pursue His<sup>azwj</sup> Pleasure, and he does not take revenge by himself on his own behalf, nor does he befriend (anyone) by incurring the Anger of his Lord<sup>azwj</sup>. He sits for the poor, being a friend of the truthful, a supporter of the people of the truth; an aider of the near ones (relatives), and a father to the orphans, (like) a husband for the widows (looking after them), a hope for the destitute (for the removal) or every abhorrence, and an aspired one for every difficulty.",
            "(He is) light and happy, neither being with a frown nor with slyness, controlling anger, smiling, having sharp insight, of great caution. He does not ignore, and if he is ignored upon, he forebears. He is not stingy, and if he is being stingy upon, he is patient. He (uses) intellect, so he is bashful and content, therefore he is self-sufficient. His bashfulness is higher than his lustful desires, and his cordiality is higher than his envy, and his pardoning is higher than his malice.  ",
            "He neither speaks without correctness, nor does he wear except for the moderate (clothes). His walking is humble, submissive to his Lord<sup>azwj</sup> in His<sup>azwj</sup> obedience, being pleased from him in every state of his. His intention is sincere and his deed is such that there is neither a fraud or a deception in it. His observation is a lesson, and his silence is thoughtful, and his speech is wise, advising, charitable, brotherly, advising in the private as well as in public. ",
            "He neither forsakes his brother, nor does he backbite him, nor does he plot against him, nor does he despair upon what he loses, nor does he grieve upon whatever hits him, nor does he wish for what is not allowed for him to wish for, nor does he fail in the difficulties, nor is he ungrateful during the prosperity. He blends the forbearance with the knowledge and the intellect with the patience. You will see him distant from laziness, always active, hoping short-term, few of errors. ",
            "There is expectancy from him, his heart is fearful remembering his Lord<sup>azwj</sup>. His self is contented, his ignorance is negated, his affairs are easy, he grieves for his sins, his lustful desires are dead, his anger is suppressed, his manners are clear, his neighbours are safe from him, his arrogance is weak. He is content with that which is Ordained for him, his patience is firm, his affairs are decisive, his remembrance (of Allah<sup>azwj</sup>) is abundant. ",
            "He mixes with the people in order to learn, and he is silent for safety, and he asks to understand, and he trades to earn. He does not listen to the ‘Khabar’ (news – the Ahadeeth) in order to do mischief with, nor does he speak in order to impress those who are in front of him. His own self is tired (due to his hard work) but the people are at rest from him. He exhausts himself for his Hereafter, the people are at rest with himself. If they rebel against him, he is patient until Allah<sup>azwj</sup> happens to be the One Who Provides Help for him. His distancing from the ones who are to be distanced from him by hatred, is by integrity, and his approaching the ones who are approaching him, is by softness and mercy. His distancing is not by arrogance nor by (a feeling of) greatness, nor is his approach a deception nor a plot. But he follows with the ones who are before him, from the good people, so he is a leader for the ones who are after him from the righteous people’.",
            "(The narrator) said, ‘Hamman shrieked, then unconsciousness occurred upon him. So Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup> said: ‘But, by Allah<sup>azwj</sup>, I<sup>asws</sup> had been afraid of it upon him’. And he<sup>asws</sup> said: ‘This is what the delivered advised does to its rightful ones’. So a person said to him<sup>asws</sup>, ‘So what is the matter with you<sup>asws</sup>, O Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup>!’ So he<sup>asws</sup>said: ‘For every term there is no transgressing and a cause which cannot be exceeded. Therefore wait, do not exceed, for rather Satan<sup>la</sup> just blew upon your tongue’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Ja’far has narrated from Muhammad ibn Isma’il from ‘Abd Allah ibn Dahir from al-Hassan ibn Yahya from Qathm abu Qatadah al-Harrani from ‘Abd Allah ibn Yunus from abu ‘Abd Allah (a.s.) who has said the following: “Once a man called Hammam, an assiduous worshipper practicing religious rules and a hardworking man came to Amir al-Mu’minin (Ali ibn abu Talib) (a.s.) during his speech and said, ‘O Amir al-Mu’minin, describe for us the qualities of the believer as if we see him before our eyes.’ “Amir al-Mu’minin (Ali ibn abu Talib) (a.s.) said, ‘O Hammam, a believer is a smart, intelligent one whose delight is on his face and whose sadness is in his heart, his chest is vastly open, his soul is most humble, he criticizes one’s leaning to every mortal, exhorts to go for everything good. He is not hateful, quarrelsome, scandalous, faultfinding or backbiting. He dislikes high positions (of negative nature) and is an enemy of fame and publicity. His sadness remains for a long time, his ambition is far reaching. He very often remains silent, dignified, ever remembering (the Lord), exercising patience, grateful, sad due to his thoughts, happy with his poverty, easy in his nature, kindhearted, of strong loyalty, of very little trouble, not a liar or insulting. “When laughing, he does not burst. When angry he does not msh. His laughing is smiles, his question is to learn, his review is to understand, his knowledge is plentiful, his forbearance is great and his blessing is a great deal. He is not stingy, he does not hasten, irritate or act as an extremist, is not unjust in his judgment, or unfair due to his knowledge. His soul is more solid than a rock, his labor is more sweet than honey. He is not greedy, intolerant, violent, conceited, pretending or exaggerating. He is graceful in disputed matters, of honorable visitation, a man of justice when angry, a friend when asked. He is not adventurous, or insulting and coercive. His love is pure, he is of solid promise, of fulfilling commitment, affectionate, a keeper of good relations, forbearing, calm, of very little that is extraneous, happy with Allah, the Most Majestic, the Most Holy, and opposes his own desires. He is not rough toward his inferiors and does not indulge in what is not his business. He is a supporter of religion, a defender of believers, a stronghold for Muslims, and admiration does not affect him negatively, greed does not hurt his heart, playfulness does not change his judgment and ignorant ones cannot find the limits of his knowledge. “His words are many and he is a determined scholar. He is not abusive or furious. He reaches out without harshness, is generous not a spendthrift, is not deceitful or treacherous, is not a faultfinder or unjust to a human being. He is a friend of the creatures, effortful on earth, assistant of the weak and a helper of the helpless. He does not violate what is hidden or uncover secrets, his trials are a great deal and his complaints very little. He remembers the good that he had seen, covers up the evil that he may observe, hides the defects, safeguards the unseen, corrects slips and forgives mistakes. He does not walk away from an advice that he can give, and he does not give up reforming an unjust instance. He is trustworthy, steadfast, pious, clean, purified and consenting. He accepts excuses, speaks of someone with grace and he is good and expects good from people. “He accuses his soul of defects, loves for the sake of Allah with understanding and knowledge, cuts off relations for the sake of Allah with firmness and determination. Happiness does not trespass upon him and intense happiness does not make him excited. He is a reminder for the scholar and a teacher for the ignorant. He is not expected to cause a calamity. He is not feared for causing a tragedy, every effort to him is more sincere than his own and every soul is more correct than his own. He knows his defects. He is busy with his own sadness. He does not trust anyone except his Lord. He feels a stranger, lonely, dispossessed and sad. He loves for the sake of Allah, strives for the sake of Allah to follow His happiness. He does not revenge by himself for his own self. He does not make friends to make his Lord angry. He sits with the poor, is a friend of the truthful ones, a supporter of the people of truth and an assistant for those near to him. He is like a father for the orphans, like a husband for the widows, the first hope for the destitute, expected to remove every resentful matter and to relieve every difficulty. “He is light and happy, is not frowning or sly, is strong, controlling of anger, smiling, sharp-sighted and greatly cautious. He does not ignore, and if ignored, he is forbearing. He is not stingy and if stinginess, is used against him he exercises patience. He understands, thus he is bashful, is content, independent and is self-sufficient. His bashfulness is higher than his lust, his love is higher than his jealousy and his forgiveness is higher than his hate. He does not speak without correctness and does not dress unless it is economical. He walks humbly, is submissive before his Lord in obedience and is happy with Him in all conditions. His intention is pure and sincere. His deeds are free of fraud and deceit. His observations are good lessons, his silence is thoughtful and his words are wisdom. He is advising, charitable and brotherly. He gives good advice in public and in private. He does not abandon his brother, does not backbite him and does not plot against him. He does not regret what he has missed, and does not become sad for whatever befalls him. He does not hope for what is not lawful. He does not fail in hardships and does not perpetrate in comfort. He mixes forbearance with knowledge and reason with patience. He is not lazy but is always active, of very short longing and of very few slips. (Good) is expected through him, his heart is fearful, he always speaks of his Lord, his soul is content, his ignorance is negative, his affairs are easy, he is sad for his sins, his lust is dead, his anger is controlled and his moral behaviors are lucent. “His neighbors live safely with him, his pride is weak, he is content with whatever is determined for him, his patience is strong, his affair is well established and his remembering (the Lord) is a great deal. He meets people to learn and remains silent for safety, he asks questions to understand, and he trades to earn. He does not remain silent for good to be subjected to injustice, and does not speak to be used in doing injustice to others. His soul is tired of him and people are comfortable with him. He has tired his soul for the gains of the next life and has provided comfort to others by means of his soul. If rebellion is committed against him he exercises patience until Allah finds support for him. His distancing when distancing is needed comes in overlooking and in graceful disregard, and his closeness when closeness is needed comes as kindness and blessings. His distancing is not out of boastfulness or greatness and his closeness is not a plot or deceit. It is because he follows the footsteps of those before him, the people of goodness. Thus, he is the leader for those after him. “The narrator has said that Hammam breathed very deeply and fell down unconscious. Amir al-Mu’minin (Ali ibn abu Talib) (a.s.) said, ‘By Allah I was afraid of its effect for him. This is how effective advice works on people deserving such advice. Someone said, ‘Why does it not apply to you, O Amir al-Mu’minin?’ The Imam said, ‘For everything there is an appointed time that is not surpassed and a cause that does not fail. Wait, and do not transgress. It was a blow that Satan made to flow through your tongue.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/225)"
        ],
        "index": 2273,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/155",
              "text": "جَمِيلِ بْنِ صَالِحٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/666",
              "text": "عَبْدِ اللَّهِ بْنِ غَالِبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ عَبْدِ اللَّهِ بْنِ غَالِبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:2",
        "text": [
          " يَنْبَغِي لِلْمُؤْمِنِ أَنْ يَكُونَ فِيهِ ثَمَانُ خِصَالٍ وَقُورٌ عِنْدَ الْهَزَاهِزِ صَبُورٌ عِنْدَ الْبَلَاءِ شَكُورٌ عِنْدَ الرَّخَاءِ قَانِعٌ بِمَا رَزَقَهُ اللَّهُ لَا يَظْلِمُ الْأَعْدَاءَ وَ لَا يَتَحَامَلُ لِلْأَصْدِقَاءِ بَدَنُهُ مِنْهُ فِي تَعَبٍ وَ النَّاسُ مِنْهُ فِي رَاحَةٍ إِنَّ الْعِلْمَ خَلِيلُ الْمُؤْمِنِ وَ الْحِلْمَ وَزِيرُهُ وَ الصَّبْرَ أَمِيرُ جُنُودِهِ وَ الرِّفْقَ أَخُوهُ وَ اللِّينَ وَالِدُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Jameel Bin Salih, from Abdullah Bin Ghalib, ",
            "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> having said: ‘It is befitting for the <span class=\"iTxt\">Momin</span> that there happen to be worthwhile characteristics in him – dignity during the volatility, patience during the afflictions, gratefulness during the prosperity, contentment with whatever Allah<sup style=\"font-weight: normal\">azwj</sup> has Graced him with, not oppressing the enemies, nor being burdensome upon the friends. His body would be in exhaustion from it and the people would be at rest from him. The knowledge is a friend of the <span class=\"iTxt\">Momin</span> and the forbearance is his Vizier, and the patience an Emir of his army, and the kindness is his brother, and the softness is his father’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn Mahbub from Jamil ibn Salih from ‘Abd Allah ibn Ghalib from abu ‘Abd Allah (a.s.) who has said the following: “It is worthwhile of a believer to have eight qualities: (a) Dignity in volatile conditions, (b) patience on facing a misfortune, (c) gratitude in comfortable conditions, (d) contentment with what Allah has given him for sustenance, (e) justice for enemies, (f) not to be a burden for the friends, (g) that his own body be tired of him and that (h) people be comfortable with him.’ “Knowledge is the friend of the believer, forbearance is his secretary, patience is the commander of his army, courteousness is his brother and speaking softly is his father.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (226/ 9)"
        ],
        "index": 2274,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/259",
              "text": "مَنْصُورِ بْنِ يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/111",
              "text": "أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/161",
              "text": "عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ فَضَّالٍ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ أَبِي حَمْزَةَ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:3",
        "text": [
          " الْمُؤْمِنُ يَصْمُتُ لِيَسْلَمَ وَ يَنْطِقُ لِيَغْنَمَ لَا يُحَدِّثُ أَمَانَتَهُ الْأَصْدِقَاءَ وَ لَا يَكْتُمُ شَهَادَتَهُ مِنَ الْبُعَدَاءِ وَ لَا يَعْمَلُ شَيْئاً مِنَ الْخَيْرِ رِيَاءً وَ لَا يَتْرُكُهُ حَيَاءً إِنْ زُكِّيَ خَافَ مِمَّا يَقُولُونَ وَ يَسْتَغْفِرُ اللَّهَ لِمَا لَا يَعْلَمُونَ لَا يَغُرُّهُ قَوْلُ مَنْ جَهِلَهُ وَ يَخَافُ إِحْصَاءَ مَا عَمِلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Ibn Fazzal, from Mansour Bin Yunus, from Abu Hamza, ",
            "(It has been narrated) from Ali<sup style=\"font-weight: normal\">asws</sup> Bin Al-Husayn<sup style=\"font-weight: normal\">asws</sup> having said: ‘The <span class=\"iTxt\">Momin</span> is silent to be safe, and speaks to benefit. He neither discusses his entrustments of the friends nor does he conceal his testimony from the remote ones, nor does he do anything from the goodness for showing off, nor does he neglect the bashfulness. If he pays <span class=\"iTxt\">Zakāt</span> he fears from what (the people) might be saying, and he seeks Forgiveness of Allah<sup style=\"font-weight: normal\">azwj</sup> for the ones who are not knowing. The words of the ignorant one do not tempt him, and he fears the ‘counting’ of what he does’."
          ],
          "en.sarwar": [
            "3. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from ibn Faddal from Mansur ibn Yunus from abu Hamza from Ali ibn al-Husayn (a.s.) who has said the following: “The believer remains silent for safety and speaks to benefit. He does not speak of his trust to the friends and does not withhold his testimony for the people of distant relationships. He does not do anything good to show off and does not ignore it due to bashfulness. If he cleanses himself he fears what they (people) say, and asks forgiveness for what they do not know. The words (in his praise) of those who do not know do not make him boastful and he is afraid of the sum of his deeds.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (227/ 9)"
        ],
        "index": 2275,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1794",
              "text": "بَعْضِ مَنْ رَوَاهُ"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ إِلَى "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ بَعْضِ مَنْ رَوَاهُ رَفَعَهُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:4",
        "text": [
          " الْمُؤْمِنُ لَهُ قُوَّةٌ فِي دِينٍ وَ حَزْمٌ فِي لِينٍ وَ إِيمَانٌ فِي يَقِينٍ وَ حِرْصٌ فِي فِقْهٍ وَ نَشَاطٌ فِي هُدًى وَ بِرٌّ فِي اسْتِقَامَةٍ وَ عِلْمٌ فِي حِلْمٍ وَ كَيْسٌ فِي رِفْقٍ وَ سَخَاءٌ فِي حَقٍّ وَ قَصْدٌ فِي غِنًى وَ تَجَمُّلٌ فِي فَاقَةٍ وَ عَفْوٌ فِي قُدْرَةٍ وَ طَاعَةٌ لِلَّهِ فِي نَصِيحَةٍ وَ انْتِهَاءٌ فِي شَهْوَةٍ وَ وَرَعٌ فِي رَغْبَةٍ وَ حِرْصٌ فِي جِهَادٍ وَ صَلَاةٌ فِي شُغُلٍ وَ صَبْرٌ فِي شِدَّةٍ وَ فِي الْهَزَاهِزِ وَقُورٌ وَ فِي الْمَكَارِهِ صَبُورٌ وَ فِي الرَّخَاءِ شَكُورٌ ",
          "وَ لَا يَغْتَابُ وَ لَا يَتَكَبَّرُ وَ لَا يَقْطَعُ الرَّحِمَ وَ لَيْسَ بِوَاهِنٍ وَ لَا فَظٍّ وَ لَا غَلِيظٍ وَ لَا يَسْبِقُهُ بَصَرُهُ وَ لَا يَفْضَحُهُ بَطْنُهُ وَ لَا يَغْلِبُهُ فَرْجُهُ وَ لَا يَحْسُدُ النَّاسَ يُعَيَّرُ وَ لَا يُعِيِّرُ وَ لَا يُسْرِفُ يَنْصُرُ الْمَظْلُومَ وَ يَرْحَمُ الْمِسْكِينَ نَفْسُهُ مِنْهُ فِي عَنَاءٍ وَ النَّاسُ مِنْهُ فِي رَاحَةٍ لَا يَرْغَبُ فِي عِزِّ الدُّنْيَا وَ لَا يَجْزَعُ مِنْ ذُلِّهَا ",
          "لِلنَّاسِ هَمٌّ قَدْ أَقْبَلُوا عَلَيْهِ وَ لَهُ هَمٌّ قَدْ شَغَلَهُ لَا يُرَى فِي حُكْمِهِ نَقْصٌ وَ لَا فِي رَأْيِهِ وَهْنٌ وَ لَا فِي دِينِهِ ضَيَاعٌ يُرْشِدُ مَنِ اسْتَشَارَهُ وَ يُسَاعِدُ مَنْ سَاعَدَهُ وَ يَكِيعُ عَنِ الْخَنَا وَ الْجَهْلِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from someone who reported it, ",
            "(It has been narrated) raising it to Abu Abdullah<sup>asws</sup> having said: ‘The <span class=\"iTxt\">Momin</span> has strength for him in Religion, and softness during determination, and <span class=\"iTxt\">Emān</span> during conviction, and greed during his understanding, and activity during guidance, and righteousness during his standing, and knowledge during forbearance, and smartness during friendship, and generosity during truth, and moderation during richness, and gracefulness during destitution, and pardoning during his power, and obedience to Allah<sup>azwj</sup> during advice, and restraint during lustful desires, and piety during wishes, and greed during <span class=\"iTxt\">Jihād</span>, and <span class=\"iTxt\">Salāt</span> during busy times, and patience during difficulties, and during the troubles he is dignified, and patient during coercion, and grateful during the prosperity.",
            "He neither backbites, nor is he arrogant, nor does he cut off relationships, and he is neither with feebleness, nor rudeness, nor harshness, nor stubbornness. And his vision does not precede him, nor does his belly disgrace him, nor does his private part overcome him, nor does he envy the people. He is reproached but (he) does not reproach (others), and he is not extravagant. He helps the oppressed, and he is merciful to the poor. His soul is tired from him but the people are at rest from him. He neither wishes for the honour of the world nor does he suffice from its disgrace.  ",
            "The concerns of the people have turned upon him, and for him there are concerns which pre-occupy him. Neither is a deficiency sees to be in his wisdom nor a weakness in his opinion, nor a wastage in his Religion. He guides the one who cosults him, and he assits the one who wants his assistance, and shuns vulgarities and the ignorance’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from certain individuals who narrated to him in a marfu’ manner from abu ‘Abd Allah (a.s.) who has said the following: “The believer has power in religion. He is of solid determination but with soft words, his belief is in certainty, he has greed in deep understanding, is active in guidance, and virtuous in steadfastness. He has knowledge in forbearance, he is smart in friendliness, and generous in truth, modest in wealth, graceful in poverty, forgiving in power, and obedient to Allah in good advice. His desires are ending, he exsercizes restraint against desires, greed in Jihad (hard work for the cause of Allah), prayer in business, patience in hardships, dignity in volatile conditions, endurance in suffering, and gratefulness in comfortable conditions. He does not backbite or act boastfully, nor does he disregard maintaining good relations with relatives and neither is he neglectful. He is not harsh and stubborn. His eyes are not ahead of him and his stomach does not disgrace him, his private parts do not overpower him. He does not envy people; he measures but is not measured. He is not extravagant, he helps the oppressed, he has blessings for the destitute, his soul is tired of him and people receive comfort from him. He is not interested in worldly honor and does not complain because of worldly humiliation. People look forward to be closer to him but he is preoccupied with his own business. No defect is found in his judgment, no flaw is found in his opinion, and no failure takes place in his religion. He provides instruction for those who consult him and assists those who assist him. He shuns indecency and ignorance.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/233)"
        ],
        "index": 2276,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/18",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/497",
              "text": "أَحَدِهِمَا ( عليهما السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَنْهُ عَنْ بَعْضِ أَصْحَابِنَا رَفَعَهُ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:5",
        "text": [
          " مَرَّ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) بِمَجْلِسٍ مِنْ قُرَيْشٍ فَإِذَا هُوَ بِقَوْمٍ بِيضٍ ثِيَابُهُمْ صَافِيَةٍ أَلْوَانُهُمْ كَثِيرٍ ضِحْكُهُمْ يُشِيرُونَ بِأَصَابِعِهِمْ إِلَى مَنْ يَمُرُّ بِهِمْ",
          "ثُمَّ مَرَّ بِمَجْلِسٍ لِلْأَوْسِ وَ الْخَزْرَجِ فَإِذَا قَوْمٌ بُلِيَتْ مِنْهُمُ الْأَبْدَانُ وَ دَقَّتْ مِنْهُمُ الرِّقَابُ وَ اصْفَرَّتْ مِنْهُمُ الْأَلْوَانُ وَ قَدْ تَوَاضَعُوا بِالْكَلَامِ",
          "فَتَعَجَّبَ عَلِيٌّ ( عليه السلام ) مِنْ ذَلِكَ وَ دَخَلَ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ بِأَبِي أَنْتَ وَ أُمِّي إِنِّي مَرَرْتُ بِمَجْلِسٍ لآِلِ فُلَانٍ ثُمَّ وَصَفَهُمْ وَ مَرَرْتُ بِمَجْلِسٍ لِلْأَوْسِ وَ الْخَزْرَجِ فَوَصَفَهُمْ ثُمَّ قَالَ وَ جَمِيعٌ مُؤْمِنُونَ فَأَخْبِرْنِي يَا رَسُولَ اللَّهِ بِصِفَةِ الْمُؤْمِنِ ",
          "فَنَكَسَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ عِشْرُونَ خَصْلَةً فِي الْمُؤْمِنِ فَإِنْ لَمْ تَكُنْ فِيهِ لَمْ يَكْمُلْ إِيمَانُهُ إِنَّ مِنْ أَخْلَاقِ الْمُؤْمِنِينَ يَا عَلِيُّ الْحَاضِرُونَ الصَّلَاةَ وَ الْمُسَارِعُونَ إِلَى الزَّكَاةِ وَ الْمُطْعِمُونَ الْمِسْكِينَ الْمَاسِحُونَ رَأْسَ الْيَتِيمِ الْمُطَهِّرُونَ أَطْمَارَهُمْ الْمُتَّزِرُونَ عَلَى أَوْسَاطِهِمُ ",
          "الَّذِينَ إِنْ حَدَّثُوا لَمْ يَكْذِبُوا وَ إِذَا وَعَدُوا لَمْ يُخْلِفُوا وَ إِذَا ائْتُمِنُوا لَمْ يَخُونُوا وَ إِذَا تَكَلَّمُوا صَدَقُوا رُهْبَانٌ بِاللَّيْلِ أُسُدٌ بِالنَّهَارِ صَائِمُونَ النَّهَارَ قَائِمُونَ اللَّيْلَ لَا يُؤْذُونَ جَاراً وَ لَا يَتَأَذَّى بِهِمْ جَارٌ الَّذِينَ مَشْيُهُمْ عَلَى الْأَرْضِ هَوْنٌ وَ خُطَاهُمْ إِلَى بُيُوتِ الْأَرَامِلِ وَ عَلَى أَثَرِ الْجَنَائِزِ جَعَلَنَا اللَّهُ وَ إِيَّاكُمْ مِنَ الْمُتَّقِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from one of our companions, raising it, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) having said: ‘Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup> passed by a gathering of Qureysh. So he<sup>asws</sup> was with the group, their clothes were white, their complexion was clear, their laughter was frequent, gesturing with their fingers to the ones who pass by them. ",
            "Then he<sup>asws</sup> passed by a gathering of Al-Aws and Al-Khazraj (two tribes). So he<sup>asws</sup> was with a group, the bodies had worn out from them, and the necks had thinned from them, and the colours had paled from them, and they were humble with the speech. ",
            "So Ali<sup style=\"font-weight: normal\">asws</sup> was astounded from that and came over to Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> and he<sup style=\"font-weight: normal\">asws</sup> said: ‘By my<sup style=\"font-weight: normal\">asws</sup> father<sup style=\"font-weight: normal\">as</sup> and my<sup style=\"font-weight: normal\">asws</sup> mother<sup style=\"font-weight: normal\">as</sup>! I<sup style=\"font-weight: normal\">asws</sup> passed by a gathering of the progeny of so and so’, then he<sup style=\"font-weight: normal\">asws</sup> described them, ‘and I<sup style=\"font-weight: normal\">asws</sup> passed by Al-Aws and Al-Khazraj’, and he<sup style=\"font-weight: normal\">asws</sup> described them. Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘And the entirety of the <span class=\"iTxt\">Momineen</span>. So inform me<sup style=\"font-weight: normal\">asws</sup>, O Rasool-Allah<sup style=\"font-weight: normal\">saww</sup>, with the description of the <span class=\"iTxt\">Momin</span>’. ",
            "So Rasool-Allah<sup style=\"font-weight: normal\">azwj</sup> lowered, then raised his<sup style=\"font-weight: normal\">saww</sup> head, so he<sup style=\"font-weight: normal\">saww</sup> said: ‘There are twenty characteristics in the <span class=\"iTxt\">Momin</span>, so if these do not happen to be in him, his <span class=\"iTxt\">Emān</span> would not be complete. From the mannerism of the <span class=\"iTxt\">Momineen</span>, O Ali<sup style=\"font-weight: normal\">asws</sup> – They are attending the <span class=\"iTxt\">Salāt</span>, and are hastening to the <span class=\"iTxt\">Zakāt</span>, and are feeding the poor, wiping the head of the orphan, cleaning their clothes, having waistbands upon their waists.",
            "Those, if they discuss (anything) are not lying, and when they are promising, are not breaking, and when they are entrusted do not betray, and when they speak, are truthful. They are monks at night and lions by the day. They are Fasting by the day, standing (for <span class=\"iTxt\">Salāt</span>) at night. They are neither harming a neighbour nor does a neighbour experience harm due to them. Those who are walking upon the ground with tranquility, and their footsteps are to the houses of the widows (to assist), and upon the traces of the funerals. May Allah<sup style=\"font-weight: normal\">azwj</sup> Make us<sup style=\"font-weight: normal\">asws</sup> and you all to be from the pious ones’."
          ],
          "en.sarwar": [
            "5. It is narrated from him (narrator of the Hadith above) from certain individuals of his people from in a marfu’ manner from one of them (abu Ja’far or abu ‘Abd Allah (a.s.)) who has said the following: “Amir al-Mu’minin (Ali ibn abu Talib) (a.s.) once passed by a gathering of Quraysh where he found the people in white clothes, of clear complexion, frequently laughing and who pointed out their fingers to whoever passed (near) by. Then he passed by a gathering of al- Aws and Khazraj where he found people of worn out bodies, whose necks were thinning, their colors had turned pale and were very humble in their words. “Amir al-Mu’minin (Ali ibn abu Talib) (a.s.) wondered about his observation, he came to the Messenger of Allah and said, ‘May Allah keep my soul and the souls of my parents in service for your cause, I passed by a gathering of the tribe of so and so.’ He described them for the Holy Prophet. He then said, T also passed by a gathering of al- Aws and al-Khazraj.’ He described them for the Holy Prophet. He then said, ‘They all are believing people. O Messenger of Allah, describe for me the qualities of the believers.’ “The Messenger of Allah bent down his head for a while, then he raised his head and said, ‘There are twenty qualities in a believer without which his belief is not complete. Of the qualities of the believing people, O Ali, is their presence in prayer, quick payment of al-Zakat (charity), feeding the destitute, placing of their hand on the heads of the orphans (to comfort them), cleansing of their clothes, and their tying up their waist with covering. They are those who do not lie when speaking, do not disregard their promise, and do not violate their trust. They tell the truth when they speak up, at night they are monks and are lions during the day. During the days they fast and stand up for worship at night. They do not harm the neighbors and the neighbors do not experience any harm from them. They are those who walk on earth in humble manners, and their steps move to the homes of the widows (to help) and in the procession for funerals. May Allah make us of the pious ones.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/237)"
        ],
        "index": 2277,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/464",
              "text": "الْقَاسِمِ بْنِ عُرْوَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1795",
              "text": "أَبِي الْعَبَّاسِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ الْقَاسِمِ بْنِ عُرْوَةَ عَنْ أَبِي الْعَبَّاسِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:6",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَنْ سَرَّتْهُ حَسَنَتُهُ وَ سَاءَتْهُ سَيِّئَتُهُ فَهُوَ مُؤْمِنٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Al Qasim Bin Gurwa, from Abu Al Abbas who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The one whose good deeds delight him, and his evil deeds disgust him, so he is a <span class=\"iTxt\">Momin</span>’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from al-Qasim ibn ‘Urwah from abu al-‘Abbas who has said that abu ‘Abd Allah (a.s.) has said the following: “Whoever enjoys a virtuous deed and is disgusted with a sin is a believer.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/237)"
        ],
        "index": 2278,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1796",
              "text": "مُحَمَّدِ بْنِ الْحَسَنِ بْنِ زَعْلَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1797",
              "text": "أَبِي إِسْحَاقَ الْخُرَاسَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1798",
              "text": "عَمْرِو بْنِ جُمَيْعٍ الْعَبْدِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ زَعْلَانَ عَنْ أَبِي إِسْحَاقَ الْخُرَاسَانِيِّ عَنْ عَمْرِو بْنِ جُمَيْعٍ الْعَبْدِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:7",
        "text": [
          " شِيعَتُنَا هُمُ الشَّاحِبُونَ الذَّابِلُونَ النَّاحِلُونَ الَّذِينَ إِذَا جَنَّهُمُ اللَّيْلُ اسْتَقْبَلُوهُ بِحُزْنٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Al Hasan Bin Za’lan, from Abu Is’haq Al Khurasany, from Amro Bin Jumi’e Al Abdy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Our<sup>asws</sup> Shia are the pale, the withered, the slender, those, when the night covers them, they welcome it with grief’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn al-Hassan ibn (za)’lan from abu Ishaq al-Khurasani from ‘Amr ibn Jumay’ al-‘Abdi from abu ‘Abd Allah (a.s.) who has said the following: “Our Shi’a (followers) look pale, with parched (lips), slim and they receive the darkening night with sadness.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/238)"
        ],
        "index": 2279,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/132",
              "text": "حَمَّادِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/308",
              "text": "إِبْرَاهِيمَ بْنِ عُمَرَ الْيَمَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/134",
              "text": "رَجُلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ الْيَمَانِيِّ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:8",
        "text": [
          " شِيعَتُنَا أَهْلُ الْهُدَى وَ أَهْلُ التُّقَى وَ أَهْلُ الْخَيْرِ وَ أَهْلُ الْإِيمَانِ وَ أَهْلُ الْفَتْحِ وَ الظَّفَرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Ibrahim Bin Umar Al Yamani, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Our<sup>asws</sup> Shia are the people of guidance, and the people of piety, and the people of goodness, and the people of <span class=\"iTxt\">Emān</span>, and people of victory and triumph’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Ibrahim ibn ‘Umar al-Yamani from a man from abu ‘Abd Allah (a.s.) who has said the following: “Our Shi’a (followers) are people of guidance, of piety, of goodness, of belief and people of victory and triumph.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه ومعتبر عندي    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/239)"
        ],
        "index": 2280,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/339",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1799",
              "text": "مَنْصُورٍ بُزُرْجَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1479",
              "text": "مُفَضَّلٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مَنْصُورٍ بُزُرْجَ عَنْ مُفَضَّلٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:9",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِيَّاكَ وَ السَّفِلَةَ فَإِنَّمَا شِيعَةُ عَلِيٍّ مَنْ عَفَّ بَطْنُهُ وَ فَرْجُهُ وَ اشْتَدَّ جِهَادُهُ وَ عَمِلَ لِخَالِقِهِ وَ رَجَا ثَوَابَهُ وَ خَافَ عِقَابَهُ فَإِذَا رَأَيْتَ أُولَئِكَ فَأُولَئِكَ شِيعَةُ جَعْفَرٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Ismail, from Mansour Buzuj, from Mufazzal who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Beware of the lowliness, for rather, a Shia of Ali<sup>azwj</sup> is one who is chaste of his belly and his private part, and his <span class=\"iTxt\">Jihād</span> is intense, and his deed is for his Creator, and he hopes for His<sup>azwj</sup> Rewards, and fears His<sup>azwj</sup> Punishment. So when you see those, so those are the Shias of Ja’far<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn ‘Isma’il from Mansur Bazarj from Mufaddal who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘Beware of the thoughtless people. Shi’a (followers) of Ali (a.s.) are only those whose stomach and private parts are chaste, and are intensely involved in Jihad. They work for the sake of their Creator in the hope for His rewards and for fear of His punishment. If you see such people they are the Shi’a (followers) of Ja’far ibn Muhammad, recipient of divine supreme covenant.’” "
          ]
        }
      },
      {
        "index": 2281,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/207",
              "text": "عَلِيِّ بْنِ رِئَابٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/66",
              "text": "ابْنِ أَبِي يَعْفُورٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنِ ابْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:10",
        "text": [
          " إِنَّ شِيعَةَ عَلِيٍّ كَانُوا خُمُصَ الْبُطُونِ ذُبُلَ الشِّفَاهِ أَهْلَ رَأْفَةٍ وَ عِلْمٍ وَ حِلْمٍ يُعْرَفُونَ بِالرَّهْبَانِيَّةِ فَأَعِينُوا عَلَى مَا أَنْتُمْ عَلَيْهِ بِالْوَرَعِ وَ الِاجْتِهَادِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ibn Mahboub, from Ali Bin Raib, from Ibn Abu Yafour, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Shia of Ali<sup>asws</sup> were of empty bellies, shrivelled lips, people of clemency, knowledge and forbearance. They were recognised with the monasticism, therefore assist (each other) on what you are upon, with the piety and the striving’."
          ],
          "en.sarwar": [
            "10. A number of our people have narrated from Sahl ibn Ziyad from ibn Mahbub from Ali ibn Ri’ab ibn abu Ya’fur from abu ‘Abd Allah (a.s.) who has said the following: “The Shi’a (followers) of Ali (a.s.) were of slim and lean bellies, and withered lips. They were people of compassion, knowledge, and forbearance. They were known as of monkish practice. You should assist each other in your cause with restraint from worldly attractions (sins) and be very hard working.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (241/ 9)"
        ],
        "index": 2282,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/479",
              "text": "صَفْوَانَ الْجَمَّالِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ صَفْوَانَ الْجَمَّالِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:11",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّمَا الْمُؤْمِنُ الَّذِي إِذَا غَضِبَ لَمْ يُخْرِجْهُ غَضَبُهُ مِنْ حَقٍّ وَ إِذَا رَضِيَ لَمْ يُدْخِلْهُ رِضَاهُ فِي بَاطِلٍ وَ إِذَا قَدَرَ لَمْ يَأْخُذْ أَكْثَرَ مِمَّا لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Safwan Al Jammal who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘But rather, the <span class=\"iTxt\">Momin</span> is the one when he is angry, his anger does not exit him from a truth, and when is please, his pleasure does not enter him into a falsehood, and when he is able, he does not take any more than what is for him’."
          ],
          "en.sarwar": [
            "11. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from Safwan al-Jammal who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘Of believers are only those who even on becoming angry do not deviate from the truth and when they become happy it does not take them into falsehood and when in power they do not take more than what is for them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/241)"
        ],
        "index": 2283,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/245",
              "text": "عَلِيِّ بْنِ النُّعْمَانِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/217",
              "text": "ابْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/176",
              "text": "سُلَيْمَانَ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنِ ابْنِ مُسْكَانَ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:12",
        "text": [
          " قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) يَا سُلَيْمَانُ أَ تَدْرِي مَنِ الْمُسْلِمُ قُلْتُ جُعِلْتُ فِدَاكَ أَنْتَ أَعْلَمُ قَالَ الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَ يَدِهِ ",
          "ثُمَّ قَالَ وَ تَدْرِي مَنِ الْمُؤْمِنُ قَالَ قُلْتُ أَنْتَ أَعْلَمُ قَالَ إِنَّ الْمُؤْمِنَ مَنِ ائْتَمَنَهُ الْمُسْلِمُونَ عَلَى أَمْوَالِهِمْ وَ أَنْفُسِهِمْ وَ الْمُسْلِمُ حَرَامٌ عَلَى الْمُسْلِمِ أَنْ يَظْلِمَهُ أَوْ يَخْذُلَهُ أَوْ يَدْفَعَهُ دَفْعَةً تُعَنِّتُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Numan, from Ibn Muskan, from Suleyman Bin Khalid, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Abu Ja’far<sup>asws</sup> said: ‘O Suleyman! Do you know who is the Muslim?’ I said, ‘May I be sacrificed for you<sup>asws</sup>! You<sup>asws</sup> are more knowing’. He<sup>asws</sup> said: ‘The Muslim is the one from whom the Muslims are safe from his tongue and his hands’. ",
            "Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘And do you know who is the <span class=\"iTxt\">Momin</span>?’ I said, ‘You are more knowing’. He<sup style=\"font-weight: normal\">asws</sup> said: ‘The <span class=\"iTxt\">Momin</span> is the one upon whom the Muslims can trust with their wealth, and their selves; and the Muslim is Prohibited upon the Muslim that he is unjust to him, or abandons him, or drive him away with intransigence’."
          ],
          "en.sarwar": [
            "12. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Nu’man from ibn Muskan from Sulayman ibn Khalid who has said the following: “Once abu Ja’far (a.s.) said to me, ‘O Sulayman, do you know who a Muslim is?’ I said, ‘May Allah keep my soul in service for your cause, you know better. ’ The Imam said, ‘A Muslim is one from whose tongue and hands other Muslims are safe.’ Then the Imam said, ‘Do you know who a believer is?’ I said, ‘You know better.’ The Imam said, ‘A believer is one who is an accepted trustworthy person among the Muslims in their properties and lives. It is unlawful for a Muslim to be unjust toward a Muslim, betray him or push him aside in his helplessness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/242)"
        ],
        "index": 2284,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/362",
              "text": "أَبِي أَيُّوبَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/309",
              "text": "أَبِي عُبَيْدَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ أَبِي عُبَيْدَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:13",
        "text": [
          " إِنَّمَا الْمُؤْمِنُ الَّذِي إِذَا رَضِيَ لَمْ يُدْخِلْهُ رِضَاهُ فِي إِثْمٍ وَ لَا بَاطِلٍ وَ إِذَا سَخِطَ لَمْ يُخْرِجْهُ سَخَطُهُ مِنْ قَوْلِ الْحَقِّ وَ الَّذِي إِذَا قَدَرَ لَمْ تُخْرِجْهُ قُدْرَتُهُ إِلَى التَّعَدِّي إِلَى مَا لَيْسَ لَهُ بِحَقٍّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Abu Ayoub, from Abu Ubeyda, ",
            "(It has been narrated) from Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> having said: ‘But rather, the <span class=\"iTxt\">Momin</span> is the one who when he is pleased, his pleasure does not enter him into a sin, nor a falsehood; and when he is angered, his anger does not exit him from the word of truth; and the one who when he is able, his ability (power) does not exit him to infringe to what is not for him by right’."
          ],
          "en.sarwar": [
            "13. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al- Hassan ibn Mahbub from abu Ayyub from abu ‘Ubaydah from abu Ja’far (a.s.) who has said the following: “A believer is one whose agreement does not lead him into sin or falsehood. When he is angry it does not take him out of speaking the words of truth, when in power it does not lead him to cross over to where he has no right.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (242/ 9)"
        ],
        "index": 2285,
        "local_index": 14,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/130",
              "text": "أَبِي الْبَخْتَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ أَبِي الْبَخْتَرِيِّ رَفَعَهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:14",
        "text": [
          " سَمِعْتُهُ يَقُولُ الْمُؤْمِنُونَ هَيِّنُونَ لَيِّنُونَ كَالْجَمَلِ الْأَنِفِ إِذَا قِيدَ انْقَادَ وَ إِنْ أُنِيخَ عَلَى صَخْرَةٍ اسْتَنَاخَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Abu Al Bakhtary, raising it, said, ",
            "‘I heard him<sup>asws</sup> saying: ‘The <span class=\"iTxt\">Momineen</span> are calm and lenient like the nosed camel when it is towed it goes (wherever guided to), and if it is knelt down upon a rock, it kneels down’."
          ],
          "en.sarwar": [
            "14. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father from abu al-Bakhtari in a marfu’ manner from the Imam who has said the following: ‘‘Believers are of serenity and soft words. They are easy to lead like the camel harnessed by the nose, who does not resist the leader who makes him sit even on a rock.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/244)"
        ],
        "index": 2286,
        "local_index": 15,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/38",
              "text": "النَّوْفَلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/39",
              "text": "السَّكُونِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:15",
        "text": [
          " ثَلَاثَةٌ مِنْ عَلَامَاتِ الْمُؤْمِنِ الْعِلْمُ بِاللَّهِ وَ مَنْ يُحِبُّ وَ مَنْ يَكْرَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Three are from the signs of the <span class=\"iTxt\">Momin</span> – The knowledge in Allah<sup>azwj</sup>, and whom he should love and whom he should dislike’."
          ],
          "en.sarwar": [
            "15. Ali ibn Ibrahim has narrated from his father from al-Nawfali from al-Sakuni from abu ‘Abd Allah Who has said the following: “Three things are of the signs of a believer: having knowledge of the existence of Allah, who to love and who dislike.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (244/ 9)"
        ],
        "index": 2287,
        "local_index": 16,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "بِهَذَا الْإِسْنَادِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِهَذَا الْإِسْنَادِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:16",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْمُؤْمِنُ كَمِثْلِ شَجَرَةٍ لَا يَتَحَاتُّ وَرَقُهَا فِي شِتَاءٍ وَ لَا صَيْفٍ قَالُوا يَا رَسُولَ اللَّهِ وَ مَا هِيَ قَالَ النَّخْلَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, ",
            "‘He<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘The <span class=\"iTxt\">Momin</span> is like a tree who leaves neither fall off in the winter nor in the summer’. They said, ‘O Rasool-Allah<sup>saww</sup>! And what is it?’ He<sup>asws</sup> said: ‘The palm tree’."
          ],
          "en.sarwar": [
            "16. Through the same chain of narrators it is narrated from the Messenger of Allah who has said the following: “A believer is like the tree whose leaves do not fall off in summer or in winter. They asked, ‘O Messenger of Allah, what tree is it?’ He said, ‘It is the palm-tree.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (245/ 9)"
        ],
        "index": 2288,
        "local_index": 17,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/588",
              "text": "مُحَمَّدِ بْنِ أُورَمَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1800",
              "text": "أَبِي إِبْرَاهِيمَ الْأَعْجَمِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/18",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ أُورَمَةَ عَنْ أَبِي إِبْرَاهِيمَ الْأَعْجَمِيِّ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:17",
        "text": [
          " الْمُؤْمِنُ حَلِيمٌ لَا يَجْهَلُ وَ إِنْ جُهِلَ عَلَيْهِ يَحْلُمُ وَ لَا يَظْلِمُ وَ إِنْ ظُلِمَ غَفَرَ وَ لَا يَبْخَلُ وَ إِنْ بُخِلَ عَلَيْهِ صَبَرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Awrama, from Abu Ibrahim Al A’jamy, from one of our companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The <span class=\"iTxt\">Momin</span> is forbearing. Neither does he ignore (anyone), and if he is ignored upon, he forbears, nor does he oppress (anyone), and if he is oppressed, he forgives, nor is he stingy, and if he is been stingy upon, he is patient’."
          ],
          "en.sarwar": [
            "17. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn ‘Uramah from (abu) Ibrahim al-‘A’jami from certain individuals of our people from abu ‘Abd Allah (a.s.) who has said the following: “A believer is forbearing. He is not ignorant and if he is ignored he remains forbearing. He does not do injustice and if he is oppressed he forgives. He is not stingy, if stinginess is exercised against him he exercises patience.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (245/ 9)"
        ],
        "index": 2289,
        "local_index": 18,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/71",
              "text": "إِسْمَاعِيلَ بْنِ مِهْرَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1801",
              "text": "مُنْذِرِ بْنِ جَيْفَرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1802",
              "text": "آدَمَ أَبِي الْحُسَيْنِ اللُّؤْلُؤِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ مُنْذِرِ بْنِ جَيْفَرٍ عَنْ آدَمَ أَبِي الْحُسَيْنِ اللُّؤْلُؤِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:18",
        "text": [
          " الْمُؤْمِنُ مَنْ طَابَ مَكْسَبُهُ وَ حَسُنَتْ خَلِيقَتُهُ وَ صَحَّتْ سَرِيرَتُهُ وَ أَنْفَقَ الْفَضْلَ مِنْ مَالِهِ وَ أَمْسَكَ الْفَضْلَ مِنْ كَلَامِهِ وَ كَفَى النَّاسَ شَرَّهُ وَ أَنْصَفَ النَّاسَ مِنْ نَفْسِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ismail Bin Mihran, from Munzir Bin Ja’far, from Adam Bin Abu Al Husayn Al Lu’lui, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The <span class=\"iTxt\">Momin</span> is the one whose earnings are good (not unlawful), and his mannerisms are excellent, and his conscience is correct, and he spends from the excess of his wealth and withholds from the excess of his words, and the people are spared from his evil, and he dispenses justice to the people from himself’."
          ],
          "en.sarwar": [
            "18. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Isma’il ibn Mehran from Mundhar ibn Jayfar from Adam abu al-Husayn al- LuTu’i from abu ‘Abd Allah (a.s.) who has said the following: “A believer is one whose earning is pleasantly clean, whose moral behavior is excellent and whose conscience is not ill. He gives to charity the extra from his property and holds back the extra of his words. People do not feel threatened by his evil and he yields to justice for people against his own soul.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (246/ 9)"
        ],
        "index": 2290,
        "local_index": 19,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/310",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1512",
              "text": "أَبِي كَهْمَسٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/176",
              "text": "سُلَيْمَانَ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ أَبِي كَهْمَسٍ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:19",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَ لَا أُنَبِّئُكُمْ بِالْمُؤْمِنِ مَنِ ائْتَمَنَهُ الْمُؤْمِنُونَ عَلَى أَنْفُسِهِمْ وَ أَمْوَالِهِمْ أَ لَا أُنَبِّئُكُمْ بِالْمُسْلِمِ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَ يَدِهِ وَ الْمُهَاجِرُ مَنْ هَجَرَ السَّيِّئَاتِ وَ تَرَكَ مَا حَرَّمَ اللَّهُ وَ الْمُؤْمِنُ حَرَامٌ عَلَى الْمُؤْمِنِ أَنْ يَظْلِمَهُ أَوْ يَخْذُلَهُ أَوْ يَغْتَابَهُ أَوْ يَدْفَعَهُ دَفْعَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Al Hassan Bin Ali, from Abu Kahmasy, from Suleyman Bin Khalid, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Shall I<sup>saww</sup> inform you all of the <span class=\"iTxt\">Momin</span>? (He is) the one upon whom the <span class=\"iTxt\">Momineen</span> are trusting with they own selves and their wealth. Shall I<sup>saww</sup> inform you of the Muslim? (He is) the one from whom the Muslims are safe from his tongue and his hands; and the emigrant is the one who emigrates from the evil and leaves whatever Allah<sup>azwj</sup> Prohibited; and the <span class=\"iTxt\">Momin</span> is Prohibited upon the <span class=\"iTxt\">Momin</span> that he oppresses him, or abandons him, or backbites him, or drives him away with a driving’."
          ],
          "en.sarwar": [
            "19. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from al- Hassan ibn Ali from abu Kahmas from Sulayman ibn Khalid from abu Ja’far (a.s.) who has said the following: “The Messenger of Allah has said, ‘Do you want me to tell you about believers? He is one whose trustworthiness believers trust in matters of their lives and properties. Do you want me to tell you who a Muslim is? He is one from whose tongue and hands Muslims are safe. An immigrant is one who migrates from evils and desists from what Allah has prohibited. It is unlawful for believers to be unjust to a believer, betray him, backbite him or push him aside with a harmful push.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور مجهول عند ي   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/248)"
        ],
        "index": 2291,
        "local_index": 20,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/31",
              "text": "مُحَمَّدِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/81",
              "text": "مُفَضَّلِ بْنِ عُمَرَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1803",
              "text": "أَبِي أَيُّوبَ الْعَطَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/181",
              "text": "جَابِرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ مُفَضَّلِ بْنِ عُمَرَ عَنْ أَبِي أَيُّوبَ الْعَطَّارِ عَنْ جَابِرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:20",
        "text": [
          " قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) إِنَّمَا شِيعَةُ عَلِيٍّ الْحُلَمَاءُ الْعُلَمَاءُ الذُّبُلُ الشِّفَاهِ تُعْرَفُ الرَّهْبَانِيَّةُ عَلَى وُجُوهِهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Sinan, from Mufazzal Bin Umar, from Abu Ayoub Al Attar, from Jabir who said, ",
            "‘Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> said: ‘But rather, Shias of Ali<sup style=\"font-weight: normal\">asws</sup> are the forbearing, the knwoledgeable, of shrivelled lips. You can recognise the monasticism upon their faces’."
          ],
          "en.sarwar": [
            "20. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from Mufaddal ibn ‘Umar from abu Ayyub al-‘Attar from Jabir who has said the following: “Abu Ja’far (a.s.) has said, ‘The Shi’a (followers) of Ali (a.s.) are only those who are forbearing, scholars, with parched lips and one can find signs similar to those of the monks on their faces.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/248)"
        ],
        "index": 2292,
        "local_index": 21,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/959",
              "text": "مَعْرُوفِ بْنِ خَرَّبُوذَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ مَعْرُوفِ بْنِ خَرَّبُوذَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:21",
        "text": [
          " صَلَّى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) بِالنَّاسِ الصُّبْحَ بِالْعِرَاقِ فَلَمَّا انْصَرَفَ وَعَظَهُمْ فَبَكَى وَ أَبْكَاهُمْ مِنْ خَوْفِ اللَّهِ ",
          "ثُمَّ قَالَ أَمَا وَ اللَّهِ لَقَدْ عَهِدْتُ أَقْوَاماً عَلَى عَهْدِ خَلِيلِي رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ إِنَّهُمْ لَيُصْبِحُونَ وَ يُمْسُونَ شُعْثاً غُبْراً خُمُصاً بَيْنَ أَعْيُنِهِمْ كَرُكَبِ الْمِعْزَى يَبِيتُونَ لِرَبِّهِمْ سُجَّداً وَ قِيَاماً يُرَاوِحُونَ بَيْنَ أَقْدَامِهِمْ وَ جِبَاهِهِمْ يُنَاجُونَ رَبَّهُمْ وَ يَسْأَلُونَهُ فَكَاكَ رِقَابِهِمْ مِنَ النَّارِ وَ اللَّهِ لَقَدْ رَأَيْتُهُمْ مَعَ هَذَا وَ هُمْ خَائِفُونَ مُشْفِقُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Al Hassan Bin Mahboub, from Abdullah Bin Sinan, from Marouf Bin Kharbouz, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup> prayed <span class=\"iTxt\">Salāt</span> with the people (leading them), in Al-Iraq. So when he<sup>asws</sup> finished, he<sup>asws</sup> preached to them, and he<sup>asws</sup> wept and made them weep from fear of Allah<sup>azwj</sup>.",
            "Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘But, by Allah<sup style=\"font-weight: normal\">azwj</sup>! I<sup style=\"font-weight: normal\">asws</sup> lived with a group of people in the era of my<sup style=\"font-weight: normal\">asws</sup> friend Rasool-Allah<sup style=\"font-weight: normal\">saww</sup>, and they, in the morning and evening, becoming shaggy, dusty, slim-bellied, between their eyes was like the hoof of a goat due to their prostrations to their Lord<sup style=\"font-weight: normal\">azwj</sup>. They were staying awake at nights for their Lord<sup style=\"font-weight: normal\">azwj</sup>, prostrating and standing (for <span class=\"iTxt\">Salāt</span>), rotating between their feet and their foreheads, whispering to their Lord<sup style=\"font-weight: normal\">azwj</sup>, and asking Him<sup style=\"font-weight: normal\">azwj</sup> to Free their necks from the Fire. By Allah<sup style=\"font-weight: normal\">azwj</sup>! I<sup style=\"font-weight: normal\">asws</sup> had seen them being with this, and they were fearful, anxious’."
          ],
          "en.sarwar": [
            "21. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from al-Hassan ibn Mahbub from ‘Abd Allah ibn Sinan from Ma’ruf ibn Kharrabuz from abu Ja’far (a.s.) who has said the following: “Once Amir al-Mu’minin (Ali ibn abu Talib) (a.s.) prayed the morning prayer with people in Iraq. After prayer he gave a speech on having fear of Allah. He wept and made people weep. He then said, ‘By Allah, I lived with a people, in the times of my beloved one, the Messenger of Allah, who were ragged, dusty and slim-bellied. Between their eyes it looked like the hooves of a goat. They spent the night in prostration and in standing position before their Lord, only resting on their feet or forehead. They whispered to their Lord to set their necks free from the fire and, by Allah, I saw them in such condition and they still were afraid and anxious (because of the next life).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/250)"
        ],
        "index": 2293,
        "local_index": 22,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1804",
              "text": "السِّنْدِيِّ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1805",
              "text": "مُحَمَّدِ بْنِ الصَّلْتِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/111",
              "text": "أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/161",
              "text": "عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَنْهُ عَنِ السِّنْدِيِّ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ الصَّلْتِ عَنْ أَبِي حَمْزَةَ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:22",
        "text": [
          " صَلَّى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) الْفَجْرَ ثُمَّ لَمْ يَزَلْ فِي مَوْضِعِهِ حَتَّى صَارَتِ الشَّمْسُ عَلَى قِيدِ رُمْحٍ وَ أَقْبَلَ عَلَى النَّاسِ بِوَجْهِهِ فَقَالَ وَ اللَّهِ لَقَدْ أَدْرَكْتُ أَقْوَاماً يَبِيتُونَ لِرَبِّهِمْ سُجَّداً وَ قِيَاماً يُخَالِفُونَ بَيْنَ جِبَاهِهِمْ وَ رُكَبِهِمْ كَانَ زَفِيرُ النَّارِ فِي آذَانِهِمْ إِذَا ذُكِرَ اللَّهُ عِنْدَهُمْ مَادُوا كَمَا يَمِيدُ الشَّجَرُ كَأَنَّمَا الْقَوْمُ بَاتُوا غَافِلِينَ ",
          "قَالَ ثُمَّ قَامَ فَمَا رُئِيَ ضَاحِكاً حَتَّى قُبِضَ ( صلوات الله عليه ) ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Al Sindy Bin Muhammad, from Muhammad Bin Al Salt, from Abu Hamza, ",
            "(It has been narrated) from Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> having said: ‘Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup> prayed <span class=\"iTxt\">Salāt</span> Al-Fajr, then he<sup>asws</sup> did not cease to be in his<sup>asws</sup> place until the (shadow of the) sun came to be to the length of a spear, and he<sup>asws</sup> turned by his<sup>asws</sup> face towards the people and he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! I<sup>asws</sup> had come across a group of people who were staying awake at night for their Lord<sup>azwj</sup>, prostrating and standing, interchanging between their foreheads and their knees, as if like the exhalation of the Fire (of Hell could be heard) in their ears. Whenever Allah<sup>azwj</sup> was Mentioned in their presence, swaying like the swaying of the trees. It is as if the group of people has spent the nights oblivious (of the world)’. ",
            "He (the narrator) said, ‘Then he<sup style=\"font-weight: normal\">asws</sup> arose, and he<sup style=\"font-weight: normal\">asws</sup> was not seen laughing until he<sup style=\"font-weight: normal\">asws</sup> passed away’."
          ],
          "en.sarwar": [
            "22. It is narrated from him (narrator of the Hadith above) from al-Sindy ibn Muhammad from Muhammad ibn al-Salt from abu Hamza from Ali ibn al- Husayn (a.s.) who has said the following: “Once Amir al-Mu’minin (Ali ibn abu Talib) (a.s.) prayed the morning prayer and remained in his place until the sun rose up to the length of a spear and then turned his face to people and said, ‘By Allah I lived in the times of a people who spent the night prostrating and standing before their Lord, changing positions only to rest on their knees or forehead, as if they could hear the roaring of fire in their ears. Were Allah mentioned they swerved like branches of trees in the wind, as if the people had spent the night totally neglectful (of worship).’ The narrator has said, ‘The Imam (a.s.) thereafter was never seen laughing until he passed away.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (251/ 9)"
        ],
        "index": 2294,
        "local_index": 23,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/595",
              "text": "صَالِحِ بْنِ السِّنْدِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/596",
              "text": "جَعْفَرِ بْنِ بَشِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/226",
              "text": "الْمُفَضَّلِ بْنِ عُمَرَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنِ الْمُفَضَّلِ بْنِ عُمَرَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:23",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا أَرَدْتَ أَنْ تَعْرِفَ أَصْحَابِي فَانْظُرْ إِلَى مَنِ اشْتَدَّ وَرَعُهُ وَ خَافَ خَالِقَهُ وَ رَجَا ثَوَابَهُ وَ إِذَا رَأَيْتَ هَؤُلَاءِ فَهَؤُلَاءِ أَصْحَابِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Salih Bin Al Sindy, from Ja’far Bin Bashir, from Al Mufazzal Bin Umar who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Whenever you want to recognise my<sup>asws</sup> companions, so look at the one who is of most intense piety and fearing his Creator, and wishes for His<sup>azwj</sup> Rewards, and when you see them, so they are my<sup>asws</sup> companions’."
          ],
          "en.sarwar": [
            "23. Ali ibn Ibrahim has narrated from Salih ibn al-Sindy from Ja’far ibn Bashir from al-Mufaddal ibn ‘Umar who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘If you want to see my companions then look to those whose restraining from worldly attraction (sins) is intense, who fear their Creator in the hope for His rewards. If you find such people they are my companions.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (252/ 9)"
        ],
        "index": 2295,
        "local_index": 24,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/621",
              "text": "مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1806",
              "text": "عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْأَشْعَثِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1807",
              "text": "عَبْدِ اللَّهِ بْنِ حَمَّادٍ الْأَنْصَارِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/580",
              "text": "عَمْرِو بْنِ أَبِي الْمِقْدَامِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْأَشْعَثِ عَنْ عَبْدِ اللَّهِ بْنِ حَمَّادٍ الْأَنْصَارِيِّ عَنْ عَمْرِو بْنِ أَبِي الْمِقْدَامِ عَنْ أَبِيهِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:24",
        "text": [
          " قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) شِيعَتُنَا الْمُتَبَاذِلُونَ فِي وَلَايَتِنَا الْمُتَحَابُّونَ فِي مَوَدَّتِنَا الْمُتَزَاوِرُونَ فِي إِحْيَاءِ أَمْرِنَا الَّذِينَ إِنْ غَضِبُوا لَمْ يَظْلِمُوا وَ إِنْ رَضُوا لَمْ يُسْرِفُوا بَرَكَةٌ عَلَى مَنْ جَاوَرُوا سِلْمٌ لِمَنْ خَالَطُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Al Hassan Bin Shamoun, from Abdullah Bin Amro Bin Al Ash’as, from Abdullah Bin Hammad Al Ansary, from Amro bin Abu Al Miqdam, from his father, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-<span class=\"iTxt\">Momineen</span><sup>asws</sup> said: ‘Our<sup>asws</sup> Shia are reciprocating (gifts etc.) regarding our<sup>asws</sup> Wilayah, loving each other regarding our<sup>asws</sup> cordiality, visiting each other reviving our<sup>asws</sup> matters (Ahadeeth), those when they are angry are not oppressive, and if they are pleased, they are not being extravagant. They are a Blessing upon the ones who are their neighbours, a safety for the ones they are mixing with’."
          ],
          "en.sarwar": [
            "24. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Muhammad ibn al-Hassan ibn Shammun from ‘Abd Allah ibn ‘Amr ibn al- Ash’ath from ‘Abd Allah ibn Hammad al-Ansari from ‘Amr ibn abu al-Miqdam from his father from abu Ja’far (a.s.) who has said the following: “Amir al-Mu’minin (Ali ibn abu Talib) (a.s.) has said, ‘Our Shi’a (followers) spend for (the cause of) our Walayah (Divine Authority), love each other for the sake of our love, and visit each other to preserve our cause. They are those who do not commit injustice when angered, and are not excessive when they agree. They are blessings for the neighbors and peace for those who associate with them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/253)"
        ],
        "index": 2296,
        "local_index": 25,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/180",
              "text": "مُحَمَّدِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/31",
              "text": "مُحَمَّدِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1808",
              "text": "عِيسَى النَّهْرِيرِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَنْهُ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عِيسَى النَّهْرِيرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:25",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ عَرَفَ اللَّهَ وَ عَظَّمَهُ مَنَعَ فَاهُ مِنَ الْكَلَامِ وَ بَطْنَهُ مِنَ الطَّعَامِ وَ عَفَا نَفْسَهُ بِالصِّيَامِ وَ الْقِيَامِ ",
          "قَالُوا بِآبَائِنَا وَ أُمَّهَاتِنَا يَا رَسُولَ اللَّهِ هَؤُلَاءِ أَوْلِيَاءُ اللَّهِ قَالَ إِنَّ أَوْلِيَاءَ اللَّهِ سَكَتُوا فَكَانَ سُكُوتُهُمْ ذِكْراً وَ نَظَرُوا فَكَانَ نَظَرُهُمْ عِبْرَةً وَ نَطَقُوا فَكَانَ نُطْقُهُمْ حِكْمَةً وَ مَشَوْا فَكَانَ مَشْيُهُمْ بَيْنَ النَّاسِ بَرَكَةً لَوْ لَا الْآجَالُ الَّتِي قَدْ كُتِبَتْ عَلَيْهِمْ لَمْ تَقِرَّ أَرْوَاحُهُمْ فِي أَجْسَادِهِمْ خَوْفاً مِنَ الْعَذَابِ وَ شَوْقاً إِلَى الثَّوَابِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Muhammad Bin Ali, from Muhammad Bin Sinan, from Isa Al Hureyri, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The one who recognises Allah<sup>azwj</sup> and His<sup>azwj</sup> Magnificence would prevent his mouth from the speech, and his belly from the food, and excuses himself with the Fasting and the standing (for <span class=\"iTxt\">Salāt</span>)’. ",
            "They said, ‘By our fathers and our mothers, O Rasool-Allah<sup style=\"font-weight: normal\">saww</sup>! Are they the friends of Allah<sup style=\"font-weight: normal\">azwj</sup>?’ He<sup style=\"font-weight: normal\">saww</sup> said: ‘The friends of Allah<sup style=\"font-weight: normal\">azwj</sup> observed silence, so their silence was a Remembrance (of Allah<sup style=\"font-weight: normal\">azwj</sup>); and they looked around, so their looking around was a lesson; and they spoke, so their speaking was wisdom; and they walked, so their walking between the people was a Blessing. Had it not been for the term which had been Ordained upon them, their spirits would not have stayed in their bodies out of fear from the Punishment and desire to the Rewards’."
          ],
          "en.sarwar": [
            "25. It is narrated from him (narrator of the Hadith above) from Muhammad ibn Ali from Muhammad ibn Sinan from ‘Isa al-Nahriri from abu ‘Abd Allah (a.s.) who has said the following: “The Messenger of Allah has said, ‘Whoever comes to know Allah and realizes His greatness does not allow his mouth to speak or his stomach to eat. He engages his soul in fasting and standing for prayer until it is clean and exhausted.’ They then said, ‘May Allah keep the souls of our parents in service for your cause, O Messenger of Allah, is it not that such people are close friends of Allah?’ The Messenger of Allah then said, ‘The close friends of Allah kept silent and it was considered speaking of Allah, they looked and it served as a good lesson, they spoke and it was wisdom, they walked and that was blessings among the people. Had it not been for the appointed time of their life span that was written down for them, their spirit would not have remained in their bodies for fear of torment and the desire for rewards.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/258)"
        ],
        "index": 2297,
        "local_index": 26,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1809",
              "text": "بَعْضِ أَصْحَابِهِ مِنَ الْعِرَاقِيِّينَ"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ قَالَ"
            }
          ],
          "text": "عَنْهُ عَنْ بَعْضِ أَصْحَابِهِ مِنَ الْعِرَاقِيِّينَ رَفَعَهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:26",
        "text": [
          " خَطَبَ النَّاسَ الْحَسَنُ بْنُ عَلِيٍّ ( صلوات الله عليه )  فَقَالَ أَيُّهَا النَّاسُ أَنَا أُخْبِرُكُمْ عَنْ أَخٍ لِي كَانَ مِنْ أَعْظَمِ النَّاسِ فِي عَيْنِي وَ كَانَ رَأْسُ مَا عَظُمَ بِهِ فِي عَيْنِي صِغَرَ الدُّنْيَا فِي عَيْنِهِ ",
          "كَانَ خَارِجاً مِنْ سُلْطَانِ بَطْنِهِ فَلَا يَشْتَهِي مَا لَا يَجِدُ وَ لَا يُكْثِرُ إِذَا وَجَدَ كَانَ خَارِجاً مِنْ سُلْطَانِ فَرْجِهِ فَلَا يَسْتَخِفُّ لَهُ عَقْلَهُ وَ لَا رَأْيَهُ كَانَ خَارِجاً مِنْ سُلْطَانِ الْجَهَالَةِ فَلَا يَمُدُّ يَدَهُ إِلَّا عَلَى ثِقَةٍ لِمَنْفَعَةٍ ",
          "كَانَ لَا يَتَشَهَّى وَ لَا يَتَسَخَّطُ وَ لَا يَتَبَرَّمُ كَانَ أَكْثَرَ دَهْرِهِ صَمَّاتاً فَإِذَا قَالَ بَذَّ الْقَائِلِينَ كَانَ لَا يَدْخُلُ فِي مِرَاءٍ وَ لَا يُشَارِكُ فِي دَعْوًى وَ لَا يُدْلِي بِحُجَّةٍ حَتَّى يَرَى قَاضِياً وَ كَانَ لَا يَغْفُلُ عَنْ إِخْوَانِهِ وَ لَا يَخُصُّ نَفْسَهُ بِشَيْ‏ءٍ دُونَهُمْ كَانَ ضَعِيفاً مُسْتَضْعَفاً فَإِذَا جَاءَ الْجِدُّ كَانَ لَيْثاً عَادِياً كَانَ لَا يَلُومُ أَحَداً فِيمَا يَقَعُ الْعُذْرُ فِي مِثْلِهِ حَتَّى يَرَى اعْتِذَاراً كَانَ يَفْعَلُ مَا يَقُولُ وَ يَفْعَلُ مَا لَا يَقُولُ",
          "كَانَ إِذَا ابْتَزَّهُ أَمْرَانِ لَا يَدْرِي أَيُّهُمَا أَفْضَلُ نَظَرَ إِلَى أَقْرَبِهِمَا إِلَى الْهَوَى فَخَالَفَهُ كَانَ لَا يَشْكُو وَجَعاً إِلَّا عِنْدَ مَنْ يَرْجُو عِنْدَهُ الْبُرْءَ وَ لَا يَسْتَشِيرُ إِلَّا مَنْ يَرْجُو عِنْدَهُ النَّصِيحَةَ كَانَ لَا يَتَبَرَّمُ وَ لَا يَتَسَخَّطُ وَ لَا يَتَشَكَّى وَ لَا يَتَشَهَّى وَ لَا يَنْتَقِمُ وَ لَا يَغْفُلُ عَنِ الْعَدُوِّ ",
          "فَعَلَيْكُمْ بِمِثْلِ هَذِهِ الْأَخْلَاقِ الْكَرِيمَةِ إِنْ أَطَقْتُمُوهَا فَإِنْ لَمْ تُطِيقُوهَا كُلَّهَا فَأَخْذُ الْقَلِيلِ خَيْرٌ مِنْ تَرْكِ الْكَثِيرِ وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from one of his companions from the Iraqis, raising it, said, ",
            "‘Al-Hassan<sup style=\"font-weight: normal\">asws</sup> Bin Ali<sup style=\"font-weight: normal\">asws</sup> addressed (the people), so he<sup style=\"font-weight: normal\">asws</sup> said: ‘O you people! I<sup style=\"font-weight: normal\">asws</sup> am informing you of a brother of mine<sup style=\"font-weight: normal\">asws</sup> who was from the greatest of the people in my<sup style=\"font-weight: normal\">asws</sup> eyes, and it was so that the topmost of what made him to be the greatest in my<sup style=\"font-weight: normal\">asws</sup> eyes was his belittling of the world in his eyes. ",
            "He was outside from the grasp of his belly, so he did not desire what he did not find, nor did he frequent it when he did find (it). He was outside the grasp of his private part, so it did not take his intellect and his opinion lightly. He was outside the grasp of the ignorance, so he did not extend his hand except towards a reliable benefit. ",
            "It was so that he was neither lustful, nor angry, nor impatient. Most of his lifetime he was silent. So when he did speak, he surpassed the speakers. He neither entered into disputes nor did he participate in allegations, nor did he cast an argument until he saw a judge, and he was not oblivious from his brethren, nor did he specialise himself with anything besides them. He was weak, weakened, so when there was a seriousness, he was an advancing lion. He did not blame anyone in what the excuse occurred in the likes of it until he saw an apology. He was doing what he was saying and (not do) what he was not saying. ",
            "When two matters presented to him, not knowing which of the two was superior, he look at the one closest to the desires, so he opposed it. He did not complain of a pain except in the presence of the one whom he hoped would have a cure for it, nor did he consult anyone except the one he hoped would have good advice with him. He was neither impatient, nor angry, nor doubtful, nor of lustful desired, nor revengeful, nor was he oblivious from the enemy. ",
            "So, upon you is with the likes of these precious mannerisms if you are strong enough for it. But if you cannot endure all of these, so take the few best ones, leave the more. And there is neither a Might nor a Strength except with Allah<sup style=\"font-weight: normal\">azwj</sup>’."
          ],
          "en.sarwar": [
            "26. It is narrated from him (narrator of the Hadith above) from certain individuals of his people from the people of Iraq in a marfu’ manner who has said the following: “Al-Hassan ibn Ali (a.s.) once addressed the people saying, ‘I like to tell you about one of my friends who was the greatest in my sight. The head of what was the greatest in my sight about him was the worthlessness of the world in his sight. He was free of the control of his stomach, thus, he did not have any appetite for what he could not find; he, however, would not accede when he did find it. He was out of the control of his private parts and it would not weigh his reason and opinion lightly. He was out of the control of ignorance, thus, he would not extend his hands unless he was confident of its benefits. He did not desire, become angry, or disappointed. Most of the time he remained silent, and when he spoke, he surpassed the speakers. He did not enter in arguments or take part in claims. He would not testify without the presence of a judge. He was not unaware of his brothers (in belief) and did not appropriate anything for himself without them. He was the weakest of the weak people but in serious matters he acted as an advancing lion. He did not blame anyone without a good cause. He would do what he said, and would not say what he would not do. When he became attracted to two things that he did not know which is better he would ignore that which he desired most. He would not complain for any pain before anyone unless he had known that one had a cure for it and would not consult anyone unless he had hope for good advice from him. He did not become frustrated, angered, and did not complain, desire, revenge and did not remain neglectful of his enemies. Therefore, you must acquire such noble moral behaviors if you can. You must acquire the little if you cannot bear the whole. There is no means and power without Allah.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/266)"
        ],
        "index": 2298,
        "local_index": 27,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1810",
              "text": "مِهْزَمٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/80",
              "text": "بَعْضُ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/180",
              "text": "مُحَمَّدِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1811",
              "text": "مُحَمَّدِ بْنِ إِسْحَاقَ الْكَاهِلِيِّ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/678",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1066",
              "text": "الْعَبَّاسِ بْنِ عَامِرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1812",
              "text": "رَبِيعِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1813",
              "text": "مِهْزَمٍ الْأَسَدِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ مِهْزَمٍ وَ بَعْضُ أَصْحَابِنَا عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ الْكَاهِلِيِّ وَ أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنِ الْعَبَّاسِ بْنِ عَامِرٍ عَنْ رَبِيعِ بْنِ مُحَمَّدٍ جَمِيعاً عَنْ مِهْزَمٍ الْأَسَدِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:27",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا مِهْزَمُ شِيعَتُنَا مَنْ لَا يَعْدُو صَوْتُهُ سَمْعَهُ وَ لَا شَحْنَاؤُهُ بَدَنَهُ وَ لَا يَمْتَدِحُ بِنَا مُعْلِناً وَ لَا يُجَالِسُ لَنَا عَائِباً وَ لَا يُخَاصِمُ لَنَا قَالِياً إِنْ لَقِيَ مُؤْمِناً أَكْرَمَهُ وَ إِنْ لَقِيَ جَاهِلًا هَجَرَهُ",
          "قُلْتُ جُعِلْتُ فِدَاكَ فَكَيْفَ أَصْنَعُ بِهَؤُلَاءِ الْمُتَشَيِّعَةِ قَالَ فِيهِمُ التَّمْيِيزُ وَ فِيهِمُ التَّبْدِيلُ وَ فِيهِمُ التَّمْحِيصُ تَأْتِي عَلَيْهِمْ سِنُونَ تُفْنِيهِمْ وَ طَاعُونٌ يَقْتُلُهُمْ وَ اخْتِلَافٌ يُبَدِّدُهُمْ شِيعَتُنَا مَنْ لَا يَهِرُّ هَرِيرَ الْكَلْبِ وَ لَا يَطْمَعُ طَمَعَ الْغُرَابِ وَ لَا يَسْأَلُ عَدُوَّنَا وَ إِنْ مَاتَ جُوعاً",
          "قُلْتُ جُعِلْتُ فِدَاكَ فَأَيْنَ أَطْلُبُ هَؤُلَاءِ قَالَ فِي أَطْرَافِ الْأَرْضِ أُولَئِكَ الْخَفِيضُ عَيْشُهُمْ الْمُنْتَقِلَةُ دِيَارُهُمْ إِنْ شَهِدُوا لَمْ يُعْرَفُوا وَ إِنْ غَابُوا لَمْ يُفْتَقَدُوا وَ مِنَ الْمَوْتِ لَا يَجْزَعُونَ وَ فِي الْقُبُورِ يَتَزَاوَرُونَ وَ إِنْ لَجَأَ إِلَيْهِمْ ذُو حَاجَةٍ مِنْهُمْ رَحِمُوهُ لَنْ تَخْتَلِفَ قُلُوبُهُمْ وَ إِنِ اخْتَلَفَ بِهِمُ الدَّارُ",
          "ثُمَّ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَنَا الْمَدِينَةُ وَ عَلِيٌّ الْبَابُ وَ كَذَبَ مَنْ زَعَمَ أَنَّهُ يَدْخُلُ الْمَدِينَةَ لَا مِنْ قِبَلِ الْبَابِ وَ كَذَبَ مَنْ زَعَمَ أَنَّهُ يُحِبُّنِي وَ يُبْغِضُ عَلِيّاً ( صلوات الله عليه ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Mihzam and one our companions, from Muhammad Bin Ali, from Muhammad Bin Is’haq Al Kahily and Abu Ali Al Ashary, from Al Hassan Bin Ali Al Kufy, from Al Abbas Bin Aamir, from Rabie Bin Muhammad, altogether from Mihzam Al Asady who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘O Mihzam! Our Shia is one whose voice does not exceed his own ears, nor does his animosity (exceed) his own body, nor does he praise us<sup>asws</sup> publicly, nor does he (participate in) gatherings finding flaws with us<sup>asws</sup>, nor does he dispute a speaker for us<sup>asws</sup>. If he meets a <span class=\"iTxt\">Momin</span>, he honours him, and if he meets an ignoramus, flees (from him)’.",
            "I said, ‘May I be sacrificed for you<sup>asws</sup>! So how should I deal with these pretentious Shia?’ He<sup>asws</sup> said: ‘Regarding them is the distinction, and regarding them is the variation, and regarding them is the screening. Years come upon them, perishing them, and plagues kill them, and differing scatter them. Our<sup>asws</sup> Shia is the one who does not bark like the barking of the dog, and he does not covet like the greed of the crow, nor does he ask our<sup>asws</sup> enemies and even if he dies of hunger’. ",
            "I said, ‘May I be sacrificed for you<sup>asws</sup>! So when shall I seek these ones?’ He<sup>asws</sup> said: ‘In the outskirts of the land. They are the ones of basic (standards of) living. Their dwellings are temporary (keep changing). If they are present, they are not recognised, and when they are absent, they are not missed, and from the death they are not panicking, and in their graves they are visiting (each other); and if a need one comes over to them they are merciful to him. Their hearts are never differing and even if their houses are different’. ",
            "Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> said: ‘I<sup style=\"font-weight: normal\">saww</sup> am the city and Ali<sup style=\"font-weight: normal\">asws</sup> is the gate; and the one who claims that he can enter the city without (going through) its door has lied, and the one who claims that he loves me<sup style=\"font-weight: normal\">saww</sup> while he hates Ali<sup style=\"font-weight: normal\">asws</sup>’ is a lair."
          ],
          "en.sarwar": [
            "27. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from Mihzam and certain individuals of our people from Muhammad ibn Ali from Muhammad ibn Ishaq al-Kahili and Abu Ali al-Ash’ari from al-Hassan ibn Ali al-Kufi from al- ‘Abbas ibn ‘Amir from Rabi’ ibn Muhammad all from Mehzam al-Asadi who has said the following: “Abu ‘Abd Allah (a.s.) once said, ‘O Mehzam, our Shi’a (followers) are those whose voices do not extend farther than their ears and their animosity do not reach beyond their bodies. They do not praise us openly, associate faultfinders with us and do not argue in our defense against our enemies. When they meet the believers they respect and honor them. When they meet the ignorant they distance themselves from him.’ I (the narrator) then asked the Imam, ‘May Allah keep my soul in service for your cause, how should I deal with these pretending Shi’as?’ The Imam said, ‘With them there are cases of distinguishing, changes and filtrations. Certain years destroy them, plagues kill them, and schisms disintegrate them. Our Shi’a (followers) do not do the barking of a dog or the craving of a crow, do not ask our enemies for help even if he may die of hunger.’ The narrator has said that 1 then asked, ‘May Allah keep my soul in service for your cause, where can I find them?’ The Imam said, ‘You may find them around the world. The standard of living of our Shi’a (followers) is low and their homes are transient. Although present in a place, they are not noticeable, in their absence they are not missed, of death they are not frightened, on the graves they visit each other and on being asked for help they show kindness. Their hearts do not have differences even if their homes might be different.’ The Imam then said, ‘The Messenger of Allah has said, “I am a city and Ali is the door. One who thinks he can enter the city but not through the door is a liar, so also is one who thinks he loves me but he hates Ali, recipient of divine supreme covenant.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/273)"
        ],
        "index": 2299,
        "local_index": 28,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/117",
              "text": "عُثْمَانَ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/287",
              "text": "سَمَاعَةَ بْنِ مِهْرَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ بْنِ مِهْرَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:28",
        "text": [
          " قَالَ مَنْ عَامَلَ النَّاسَ فَلَمْ يَظْلِمْهُمْ وَ حَدَّثَهُمْ فَلَمْ يَكْذِبْهُمْ وَ وَعَدَهُمْ فَلَمْ يُخْلِفْهُمْ كَانَ مِمَّنْ حُرِّمَتْ غِيبَتُهُ وَ كَمَلَتْ مُرُوءَتُهُ وَ ظَهَرَ عَدْلُهُ وَ وَجَبَتْ أُخُوَّتُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from Sama’at Bin Mihran, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whoever in his dealings with people does not do injustice to them, in his speaking does not lie to them and in his promise does not fail to keep it is among those whose backbiting is unlawful, whose kindness is complete, whose justice has become public and it is necessary to establish brotherly relations with him."
          ],
          "en.sarwar": [
            "28. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ‘Uthman ibn ‘Isa from Sama’a ibn Mehran from abu ‘Abd Allah (a.s.) who has said the following: “Whoever in his dealing with people does not do injustice to them, in his speaking does not lie to them and in his promise does not fail to keep it is among those whose backbiting is unlawful, whose kindness is complete, whose justice has become public and it is necessary to establish brotherly relations with him.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/273)"
        ],
        "index": 2300,
        "local_index": 29,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/266",
              "text": "عَاصِمِ بْنِ حُمَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/150",
              "text": "أَبِي حَمْزَةَ الثُّمَالِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1814",
              "text": "عَبْدِ اللَّهِ بْنِ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1815",
              "text": "أُمِّهِ فَاطِمَةَ بِنْتِ الْحُسَيْنِ بْنِ عَلِيٍّ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَنْهُ عَنِ ابْنِ فَضَّالٍ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ عَنْ عَبْدِ اللَّهِ بْنِ الْحَسَنِ عَنْ أُمِّهِ فَاطِمَةَ بِنْتِ الْحُسَيْنِ بْنِ عَلِيٍّ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:29",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) ثَلَاثُ خِصَالٍ مَنْ كُنَّ فِيهِ اسْتَكْمَلَ خِصَالَ الْإِيمَانِ إِذَا رَضِيَ لَمْ يُدْخِلْهُ رِضَاهُ فِي بَاطِلٍ وَ إِذَا غَضِبَ لَمْ يُخْرِجْهُ الْغَضَبُ مِنَ الْحَقِّ وَ إِذَا قَدَرَ لَمْ يَتَعَاطَ مَا لَيْسَ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ibn Fazzal, from Aasim Bin Humeyd, from Abu Hamza Al Sumaly, from Abdullah Bin Al Hassan, ",
            "(It has been narrated) from his mother Fatima<sup>as</sup> the daughter of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Three characteristics, the one in whom these are, the quality of the <span class=\"iTxt\">Emān</span> would be complete – When he is pleased, his pleasure does not enter him into the falsehood, and when he is angry, the anger does not exit him from the truth, and when he is able, he does not exceed to what is not for him’."
          ],
          "en.sarwar": [
            "29. It is narrated from him (narrator of the Hadith above) from ibn Faddal from ‘Asim ibn Humayd from abu Hamza al-Thumali from ‘Abd Allah ibn al-Hassan from his mother, Fatimah bint al-Husayn ibn Ali (a.s.) who has said the following: “The Messenger of Allah has said, ‘Whoever has three qualities, the quality of his belief is complete: if he is happy it does not lead him to falsehood, his anger does not lead him out of the truth and when in power does not take hold of what is not rightfully his.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (274/ 9)"
        ],
        "index": 2301,
        "local_index": 30,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/617",
              "text": "عَبْدِ اللَّهِ بْنِ الْقَاسِمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَنْهُ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:30",
        "text": [
          " قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِنَّ لِأَهْلِ الدِّينِ عَلَامَاتٍ يُعْرَفُونَ بِهَا صِدْقَ الْحَدِيثِ وَ أَدَاءَ الْأَمَانَةِ وَ وَفَاءً بِالْعَهْدِ وَ صِلَةَ الْأَرْحَامِ وَ رَحْمَةَ الضُّعَفَاءِ وَ قِلَّةَ الْمُرَاقَبَةِ لِلنِّسَاءِ أَوْ قَالَ قِلَّةَ الْمُوَاتَاةِ لِلنِّسَاءِ وَ بَذْلَ الْمَعْرُوفِ وَ حُسْنَ الْخُلُقِ وَ سَعَةَ الْخُلُقِ وَ اتِّبَاعَ الْعِلْمِ وَ مَا يُقَرِّبُ إِلَى اللَّهِ عَزَّ وَ جَلَّ زُلْفَى",
          "طُوبَى لَهُمْ وَ حُسْنُ مَآبٍ وَ طُوبَى شَجَرَةٌ فِي الْجَنَّةِ أَصْلُهَا فِي دَارِ النَّبِيِّ مُحَمَّدٍ ( صلى الله عليه وآله ) وَ لَيْسَ مِنْ مُؤْمِنٍ إِلَّا وَ فِي دَارِهِ غُصْنٌ مِنْهَا لَا يَخْطُرُ عَلَى قَلْبِهِ شَهْوَةُ شَيْ‏ءٍ إِلَّا أَتَاهُ بِهِ ذَلِكَ وَ لَوْ أَنَّ رَاكِباً مُجِدّاً سَارَ فِي ظِلِّهَا مِائَةَ عَامٍ مَا خَرَجَ مِنْهُ وَ لَوْ طَارَ مِنْ أَسْفَلِهَا غُرَابٌ مَا بَلَغَ أَعْلَاهَا حَتَّى يَسْقُطَ هَرِماً ",
          "أَلَا فَفِي هَذَا فَارْغَبُوا إِنَّ الْمُؤْمِنَ مِنْ نَفْسِهِ فِي شُغُلٍ وَ النَّاسُ مِنْهُ فِي رَاحَةٍ إِذَا جَنَّ عَلَيْهِ اللَّيْلُ افْتَرَشَ وَجْهَهُ وَ سَجَدَ لِلَّهِ عَزَّ وَ جَلَّ بِمَكَارِمِ بَدَنِهِ يُنَاجِي الَّذِي خَلَقَهُ فِي فَكَاكِ رَقَبَتِهِ أَلَا فَهَكَذَا كُونُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from his father, from Abdullah Bin Al Qasim, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘For the religious people there are signs which they are recognised by – truthful narration, and the paying of the entrustments, and loyalty with the agreements, and helping the relatives, and mercifulness with the weak, and scarcity of expectation from women’, or said, ‘scarcity of the obedience to the women’, ‘and extending the goodness, and good mannerisms, and vastness of morality, and following the knowledge and whatever gets one closed to Allah<sup>azwj</sup> Mighty and Majestic in position.",
            "Tooba is for them, as wells as the excellent end-result, and Tooba is a tree in the Paradise. Its roots are in the house of the Prophet Muhammad<sup style=\"font-weight: normal\">saww</sup>, and there is none from a <span class=\"iTxt\">Momin</span> except that in his house would be a branch from it. Not a desire would occur upon his heart except that they would come to him with that; and if a diligent rider were to run under its shade for a hundred years, he would not exit from it, and if a crow were to fly from its bottom it would not reach its top until it would fall down due to old age. ",
            "Indeed! With regards to this you should be desiring (it). A <span class=\"iTxt\">Momin</span> is pre-occupied with himself and the people are at rest from him. When the night covers upon him, he turns his face and prostrates to Allah<sup>azwj</sup> Mighty and Majestic with the nobility of his body, whispering to the One<sup>azwj</sup> Who Created him, with regards to freeing his neck. Indeed! So this is what (you) should (also) become’."
          ],
          "en.sarwar": [
            "30. It is narrated from him (narrator of the Hadith above) from his father from ‘Abd Allah ibn al-Qasim from abu Basir from abu ‘Abd Allah (a.s.) who has said the following: “Amir al-Mu’minin (Ali ibn abu Talib) (a.s.) has said, ‘Religious people have certain signs by means of which they are recognized. Of such signs are truthfulness in their words, safekeeping of trust, steadfastness in their promise, maintaining good relations with relatives, kindness to weak ones, smaller degree of expectation from women, [or he said, yield to them in smaller degrees], excellence in moral behavior, vastness of moral discipline, following knowledge and that which leads closer to Allah, the Most Majestic, the Most Holy, with distinction. Tuba’ is for them and the good ending. ‘Tuba’ is a tree in paradise that has its roots in the house of the Holy Prophet, Muhammad, recipient of divine supreme covenant. ‘Which quality is more graceful for a man?’ The Imam said. There will be no believer with a home without a branch of that tree. No desire will emerge in their heart but that the branch will provide. A horseman may run under its shadow for a hundred years and the shadow will not end. A crow (with the longest life span in birds) may fly from its trunk upward but before reaching the top of the tree will drop death due to old age. Therefore, you must develop an interest in this. Believers are busy with themselves and people are comfortable with them. When the night grows dark they fix their faces on earth in prostration before Allah, the Most Majestic, the Most Holy, with the noblest parts of their body. They whisper to the the One Who has created them, about setting free of their necks from fire and as such you must also become.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/277)"
        ],
        "index": 2302,
        "local_index": 31,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/71",
              "text": "إِسْمَاعِيلَ بْنِ مِهْرَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/27",
              "text": "سَيْفِ بْنِ عَمِيرَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1816",
              "text": "سُلَيْمَانَ بْنِ عَمْرٍو النَّخَعِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَنْهُ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ سُلَيْمَانَ بْنِ عَمْرٍو النَّخَعِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:31",
        "text": [
          " وَ حَدَّثَنِي الْحُسَيْنُ بْنُ سَيْفٍ عَنْ أَخِيهِ عَلِيٍّ عَنْ سُلَيْمَانَ عَمَّنْ ذَكَرَهُ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سُئِلَ النَّبِيُّ ( صلى الله عليه وآله ) عَنْ خِيَارِ الْعِبَادِ فَقَالَ الَّذِينَ إِذَا أَحْسَنُوا اسْتَبْشَرُوا وَ إِذَا أَسَاءُوا اسْتَغْفَرُوا وَ إِذَا أُعْطُوا شَكَرُوا وَ إِذَا ابْتُلُوا صَبَرُوا وَ إِذَا غَضِبُوا غَفَرُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ismail Bin Mihran, from Sayf Bin Ameyra, from Suleyman Bin Amro Al Nakhaie who said, ‘And Al Husayn Bin Sayf narrated to me from his brother Ali, from Suleyman, from the one who mentioned it, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The Prophet<sup>saww</sup> was asked about the best of the servants, so he<sup>saww</sup> said: ‘Those who, when they do good deed, are joyful, and when they commit sins, seek Forgiveness, and when they are Given (something), they are thankful, and when they are afflicted, they are patient, and when they are angry, they forgive’."
          ],
          "en.sarwar": [
            "31. It is narrated from him (narrator of the Hadith above) from Isma’il ibn Mehran from Sayf ibn ‘Amirah from Sulayman ibn ‘Amr al-Nakha’i who has said that narrated to him al-Husayn ibn Sayf from his brother Ali from Sulayman from those who he mentioned (in his book) from abu Ja’far (a.s.) who has said the following: “The Holy Prophet was asked about the best ones among the servants (of Allah). The Holy Prophet said, ‘They are those who enjoy doing good deeds, and ask forgiveness when they do bad deeds, thank when they are favored, exercise patience when they suffer and forgive when they are subjected to anger.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/278)"
        ],
        "index": 2303,
        "local_index": 32,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1517",
              "text": "بِإِسْنَادِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِإِسْنَادِهِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:32",
        "text": [
          " قَالَ النَّبِيُّ ( صلى الله عليه وآله ) إِنَّ خِيَارَكُمْ أُولُو النُّهَى قِيلَ يَا رَسُولَ اللَّهِ وَ مَنْ أُولُو النُّهَى قَالَ هُمْ أُولُو الْأَخْلَاقِ الْحَسَنَةِ وَ الْأَحْلَامِ الرَّزِينَةِ وَ صَلَةُ الْأَرْحَامِ وَ الْبَرَرَةُ بِالْأُمَّهَاتِ وَ الْآبَاءِ وَ الْمُتَعَاهِدِينَ لِلْفُقَرَاءِ وَ الْجِيرَانِ وَ الْيَتَامَى وَ يُطْعِمُونَ الطَّعَامَ وَ يُفْشُونَ السَّلَامَ فِي الْعَالَمِ وَ يُصَلُّونَ وَ النَّاسُ نِيَامٌ غَافِلُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by his chain, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The Prophet<sup>saww</sup> said: ‘The best of you are the possessors of the ‘<span class=\"iTxt\">Nuha</span>’. It was said, ‘O Rasool-Allah<sup>saww</sup>! Who are the possessors of the ‘<span class=\"iTxt\">Nuha</span>’?’ He<sup>saww</sup> said: ‘The possessors of the excellent morals, and having strong power of reason, and the helpers of the relatives, and the righteous with the mothers and the fathers, and the ones who are committed to (help) the poor, and the neighbours, and the orphans, and are feeding the food, and they are disclosing the greetings (first) in the world, and they are praying <span class=\"iTxt\">Salāt</span> while the people are sleeping being oblivious’."
          ],
          "en.sarwar": [
            "32. Through the same chain of narrators it is narrated from abu Ja’far (a.s.) who has said the following: “The Holy Prophet has said, ‘The best among you are those who possess al-Nuha’.’ He was asked, ‘O Messenger of Allah, who are possessors of al-Nuha’?’ He then said, ‘They are those who possess excellent moral discipline and a heavy power of reason, maintain good relations with relatives, who are kind to mothers and fathers, committed to help the poor, neighbors, orphans, who serve food (to the needy), who spread peace in the world and who pray when people sleep negligently.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/278)"
        ],
        "index": 2304,
        "local_index": 33,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1817",
              "text": "الْهَيْثَمِ النَّهْدِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1818",
              "text": "عَبْدِ الْعَزِيزِ بْنِ عُمَرَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/42",
              "text": "بَعْضِ أَصْحَابِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/519",
              "text": "يَحْيَى بْنِ عِمْرَانَ الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَنْهُ عَنِ الْهَيْثَمِ النَّهْدِيِّ عَنْ عَبْدِ الْعَزِيزِ بْنِ عُمَرَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ يَحْيَى بْنِ عِمْرَانَ الْحَلَبِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:33",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَيُّ الْخِصَالِ بِالْمَرْءِ أَجْمَلُ فَقَالَ وَقَارٌ بِلَا مَهَابَةٍ وَ سَمَاحٌ بِلَا طَلَبِ مُكَافَأَةٍ وَ تَشَاغُلٌ بِغَيْرِ مَتَاعِ الدُّنْيَا ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Al Haysam, from Abdul Aziz Bin Umar, from one of his companions, from Yahya Bin Imran Al Halby who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Which is the most beautiful characteristics of the man?’ So he<sup>asws</sup> said: ‘Dignity without a reverence, and open-handedness without seeking a recompense, and pre-occupation with other than the chattels of the world’."
          ],
          "en.sarwar": [
            "33. It is narrated from him (narrator of the Hadith above) from al-Haytham al-Nahdi from ‘Abd al-‘Aziz ibn ‘Umar from certain individuals of his people from Yahya ibn ‘Imran al-Halabi who has said the following: “Once I asked abu ‘Abd Allah (a.s.) ‘Which quality is more graceful for a man?’ The Imam said, ‘Of such qualities are: reverence that is not a cause for any fear, magnanimity without expecting any recompense, and business, but not in worldly matters.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/279)"
        ],
        "index": 2305,
        "local_index": 34,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1472",
              "text": "أَبِي وَلَّادٍ الْحَنَّاطِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ أَبِي وَلَّادٍ الْحَنَّاطِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:34",
        "text": [
          " كَانَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) يَقُولُ إِنَّ الْمَعْرِفَةَ بِكَمَالِ دِينِ الْمُسْلِمِ تَرْكُهُ الْكَلَامَ فِيمَا لَا يَعْنِيهِ وَ قِلَّةُ مِرَائِهِ وَ حِلْمُهُ وَ صَبْرُهُ وَ حُسْنُ خُلُقِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Mahboub, from Abu Wallad Al Hannat, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> was saying: ‘It was so that Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> was saying: ‘The recognition of the completion of the Religion of a Muslim is in his leaving the speech in what is not befitting for him, and scarcity of his quibbling, and his forbearance, and his patience, and excellence of his manners’."
          ],
          "en.sarwar": [
            "34. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Mahbub from abu Wallad al-Hannat from abu ‘Abd Allah (a.s.) who has said the following: “Ali ibn al-Husayn (a.s.) has said, ‘Signs of perfect religion of a Muslim are his restraining from speaking things that do not concern him, his reduced disagreement, his forbearance, patience and his excellent moral behavior.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/279)"
        ],
        "index": 2306,
        "local_index": 35,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1639",
              "text": "مُحَمَّدِ بْنِ عَرَفَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ مُحَمَّدِ بْنِ عَرَفَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:35",
        "text": [
          " قَالَ النَّبِيُّ ( صلى الله عليه وآله ) أَ لَا أُخْبِرُكُمْ بِأَشْبَهِكُمْ بِي قَالُوا بَلَى يَا رَسُولَ اللَّهِ قَالَ أَحْسَنُكُمْ خُلُقاً وَ أَلْيَنُكُمْ كَنَفاً وَ أَبَرُّكُمْ بِقَرَابَتِهِ وَ أَشَدُّكُمْ حُبّاً لِإِخْوَانِهِ فِي دِينِهِ وَ أَصْبَرُكُمْ عَلَى الْحَقِّ وَ أَكْظَمُكُمْ لِلْغَيْظِ وَ أَحْسَنُكُمْ عَفْواً وَ أَشَدُّكُمْ مِنْ نَفْسِهِ إِنْصَافاً فِي الرِّضَا وَ الْغَضَبِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Muhammad Bin Arafa, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Prophet<sup>saww</sup> said: ‘Shall I<sup>saww</sup> inform you all with the ones most resembling with me<sup>saww</sup>?’ They said, ‘Yes, O Rasool-Allah<sup>saww</sup>!’ He<sup>saww</sup> said: ‘The most excellent of you in manners, and the softest of you in caring, and the most righteous of you with his relatives, and the most intense of you in love for his brethren in his Religion, and the most patient of you upon the truth, and the most swallowing of you of the anger, and the most excellent of you of forgiveness, and the most intense of you from himself in fairness during the happiness and the anger’."
          ],
          "en.sarwar": [
            "35. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from Muhammad ibn ‘Arafah from abu ‘Abd Allah (a.s.) who has said the following: “The Holy Prophet once asked, ‘Do you want me to tell you who is more similar to me? They replied, ‘Yes, O Messenger of Allah.’ The Holy Prophet then said, ‘It is he whose moral behavior is most excellent, whose sheltering for protection is most gentle, who is most virtuous toward his relatives, of the most intense love for his brothers in religion, who bears the most patience for the truth, who suppresses his anger the most, whose forgiveness is most graceful and whose yielding to justice is most strict in both relaxed and irritated conditions.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/280)"
        ],
        "index": 2307,
        "local_index": 36,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1478",
              "text": "مَالِكِ بْنِ عَطِيَّةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/111",
              "text": "أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/161",
              "text": "عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ أَبِي حَمْزَةَ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:36",
        "text": [
          " مِنْ أَخْلَاقِ الْمُؤْمِنِ الْإِنْفَاقُ عَلَى قَدْرِ الْإِقْتَارِ وَ التَّوَسُّعُ عَلَى قَدْرِ التَّوَسُّعِ وَ إِنْصَافُ النَّاسِ وَ ابْتِدَاؤُهُ إِيَّاهُمْ بِالسَّلَامِ عَلَيْهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Malik Bin Atiyya, from Abu Hamza, ",
            "(It has been narrated) from Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> having said: ‘From the mannerisms of the <span class=\"iTxt\">Momin</span> is the spending upon a measurement of the standard of living, and being capacious upon a measurement of the capacity, and fairness to the people, and initiating them with the greetings upon them’."
          ],
          "en.sarwar": [
            "36. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from Malik ibn ‘Atiyyah from abu Hamza from Ali ibn al-Husayn (a.s.) who has said the following: “It is of the moral behavior of believers to spend proportionately to their standard of living, raise such standards to what is possible, fairness to people and initiation in offering the greeting of peace.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (281/ 9)"
        ],
        "index": 2308,
        "local_index": 37,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/249",
              "text": "ابْنِ بُكَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/191",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:37",
        "text": [
          " الْمُؤْمِنُ أَصْلَبُ مِنَ الْجَبَلِ الْجَبَلُ يُسْتَقَلُّ مِنْهُ وَ الْمُؤْمِنُ لَا يُسْتَقَلُّ مِنْ دِينِهِ شَيْ‏ءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Fazzal, from Ibn Bukeyr, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘A <span class=\"iTxt\">Momin</span> is stronger than a mountain. A mountain loses its parts but no loss takes place in the religion of a <span class=\"iTxt\">Momin</span>’."
          ],
          "en.sarwar": [
            "37. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn Faddal from ibn Bukayr from Zurara from abu Ja’far (a.s.) who has said the following: “A believer is stronger than a mountain. A mountain loses its parts but no loss takes place in the religion of a believer.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (281/ 9)"
        ],
        "index": 2309,
        "local_index": 38,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/595",
              "text": "صَالِحِ بْنِ السِّنْدِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/596",
              "text": "جَعْفَرِ بْنِ بَشِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/28",
              "text": "إِسْحَاقَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:38",
        "text": [
          " الْمُؤْمِنُ حَسَنُ الْمَعُونَةِ خَفِيفُ الْمَئُونَةِ جَيِّدُ التَّدْبِيرِ لِمَعِيشَتِهِ لَا يُلْسَعُ مِنْ جُحْرٍ مَرَّتَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Salih Bin Al Sindy, from Ja’far Bin Bashir, from Is’haq Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A <span class=\"iTxt\">Momin</span> is of good assistance, light of provisions, excellent of management for his life (and) does not allow to be bitten twice from the same opening’."
          ],
          "en.sarwar": [
            "38. Ali ibn Ibrahim has narrated from Salih ibn Sindy from Ja’far ibn Bashir from Ishaq ibn ‘Ammar from abu ‘Abd Allah (a.s.) who has said the following: “A believer is of valuable assistance, of very light expenses, of excellent plans for living and does not allow to be bitten twice from the same opening.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/282)"
        ],
        "index": 2310,
        "local_index": 39,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1819",
              "text": "عَلِيُّ بْنُ مُحَمَّدِ بْنِ بُنْدَارَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/655",
              "text": "إِبْرَاهِيمَ بْنِ إِسْحَاقَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1820",
              "text": "سَهْلِ بْنِ الْحَارِثِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1821",
              "text": "الدِّلْهَاثِ مَوْلَى الرِّضَا ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدِ بْنِ بُنْدَارَ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ عَنْ سَهْلِ بْنِ الْحَارِثِ عَنِ الدِّلْهَاثِ مَوْلَى الرِّضَا ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:1:99:39",
        "relations": {
          "Mentions": [
            "/books/quran:72:26",
            "/books/quran:72:27",
            "/books/quran:7:199"
          ]
        },
        "text": [
          " سَمِعْتُ الرِّضَا ( عليه السلام ) يَقُولُ لَا يَكُونُ الْمُؤْمِنُ مُؤْمِناً حَتَّى يَكُونَ فِيهِ ثَلَاثُ خِصَالٍ سُنَّةٌ مِنْ رَبِّهِ وَ سُنَّةٌ مِنْ نَبِيِّهِ وَ سُنَّةٌ مِنْ وَلِيِّهِ ",
          "فَأَمَّا السُّنَّةُ مِنْ رَبِّهِ فَكِتْمَانُ سِرِّهِ قَالَ اللَّهُ عَزَّ وَ جَلَّ عالِمُ الْغَيْبِ فَلا يُظْهِرُ عَلى غَيْبِهِ أَحَداً إِلَّا مَنِ ارْتَضى مِنْ رَسُولٍ",
          "وَ أَمَّا السُّنَّةُ مِنْ نَبِيِّهِ فَمُدَارَاةُ النَّاسِ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ أَمَرَ نَبِيَّهُ ( صلى الله عليه وآله ) بِمُدَارَاةِ النَّاسِ فَقَالَ خُذِ الْعَفْوَ وَ أْمُرْ بِالْعُرْفِ وَ أَمَّا السُّنَّةُ مِنْ وَلِيِّهِ فَالصَّبْرُ فِي الْبَأْسَاءِ وَ الضَّرَّاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad Bin Bundar, from Ibrahim Bin Is’haq, from Sahl Bin Al Haris, ",
            "(It has been narrated) from Al-Dilhat a slave of Al-Reza<sup>asws</sup> who said, ‘I heard Al-Reza<sup>asws</sup> saying: ‘A <span class=\"iTxt\">Momin</span> cannot happen to be (a <span class=\"iTxt\">Momin</span>) until there happen to be three characteristics in him – a Sunnah from his Lord<sup>azwj</sup>, and a Sunnah from His<sup>azwj</sup> Prophet<sup>saww</sup>, and a Sunnah from His<sup>azwj</sup> Guardian<sup>asws</sup>. ",
            "So as for the Sunnah from his Lord<sup style=\"font-weight: normal\">azwj</sup>, so it is the concealment of His<sup style=\"font-weight: normal\">azwj</sup> Secrets. Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic Says <span class=\"ibTxt\"><a href=\"/#/books/quran:72#h26\">[72:26]</a> The Knower of the unseen! So He does not Reveal His secrets to any, <a href=\"/#/books/quran:72#h27\">[72:27]</a> Except to him whom He chooses from the Messenger</span>. ",
            "And as for the Sunnah from His<sup>azwj</sup> Prophet<sup>saww</sup>, so it is the politeness with the people, for Allah<sup>azwj</sup> Mighty and Majestic Commanded His<sup>azwj</sup> Prophet<sup>saww</sup> with being polite with the people, so He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:7#h199\">[7:199]</a> Take to Forgiveness and enjoin good and turn aside from the ignorant</span>. And as for the Sunnah of His<sup>azwj</sup> Guardian<sup>asws</sup>, so it is the patience during the destitution and the adversities’."
          ],
          "en.sarwar": [
            "39. Ali ibn Muhammad ibn Bandar has narrated from Ibrahim ibn Ishaq from Sahl ibn al-Harith from al-Dalhath servant of al-Rida (a.s.) who has said the following: “I heard al-Rida (a.s.) saying, ‘A believer cannot become a believer unless he has three qualities: one tradition from his Lord, one from His Holy Prophet and one from His Waliyy (one who possess Divine Authority). The tradition from his Lord is to hide his secret as Allah, the Most Majestic, the Most Holy, has said, ‘He knows the unseen and He does not allow anyone to know His secrets except those of His Messengers whom He chooses.’ <a href=\"/#/books/quran:72#h26\">[72:26]</a> The tradition from the Holy Prophet is to show kindness to people. Allah, the Most Majestic, the Most Holy, commanded His Holy Prophet to be kind to people saying, ‘Be forgiving, preach the truth, . . .’ <a href=\"/#/books/quran:7#h199\">[7:199]</a> The tradition from His Waliyy is to exercise patience in harsh and difficult conditions.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:1:99",
  "kind": "verse_list"
}