{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 7"}, "path": "/books/al-kafi:7:7", "titles": {"ar": "كِتَابُ الْأَيْمَانِ وَ النُّذُورِ وَ الْكَفَّارَاتِ", "en": "THE BOOK OF OATHS, AND THE VOWS, AND THE EXPIATIONS"}}, {"indexed_titles": {"en": "Chapter 1"}, "path": "/books/al-kafi:7:7:1", "titles": {"ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>اب كَرَاهِيَةِ الْيَمِينِ</span>", "en": "Chapter 1 – Abhorrence for (swearing of) the oaths"}}], "index": 2244, "local_index": 1, "part_type": "Chapter", "path": "/books/al-kafi:7:7:1", "titles": {"ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>اب كَرَاهِيَةِ الْيَمِينِ</span>", "en": "Chapter 1 – Abhorrence for (swearing of) the oaths"}, "verse_count": 6, "verse_start_index": 14529, "verses": [{"index": 14530, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:7:1:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ أَبِي أَيُّوبَ الْخَزَّازِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ لَا تَحْلِفُوا بِاللَّهِ صَادِقِينَ وَ لَا كَاذِبِينَ فَإِنَّهُ عَزَّ وَ جَلَّ يَقُولُ وَ لا تَجْعَلُوا اللَّهَ عُرْضَةً لِأَيْمانِكُمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Usman Bin Isa, from Abu Ayoub Al Khazzaz who said, \n‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Do not swear by Allah<sup>azwj</sup>, neither as a truthful nor as a liar, for Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\">[2:224] And make not Allah an excuse for your swearing</span>’."}]}, {"index": 14531, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:7:1:2", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ أَجَلَّ اللَّهَ أَنْ يَحْلِفَ بِهِ أَعْطَاهُ اللَّهُ خَيْراً مِمَّا ذَهَبَ مِنْهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The one who delays in swearing by Allah<sup>azwj</sup>, Allah<sup>azwj</sup> Gives him better than what would have gone from him (by swearing)’."}]}, {"index": 14532, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:7:7:1:3", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ اجْتَمَعَ الْحَوَارِيُّونَ إِلَى عِيسَى ( عليه السلام ) فَقَالُوا لَهُ يَا مُعَلِّمَ الْخَيْرِ أَرْشِدْنَا فَقَالَ لَهُمْ إِنَّ مُوسَى نَبِيَّ اللَّهِ أَمَرَكُمْ أَنْ لَا تَحْلِفُوا بِاللَّهِ كَاذِبِينَ وَ أَنَا آمُرُكُمْ أَنْ لَا تَحْلِفُوا بِاللَّهِ كَاذِبِينَ وَ لَا صَادِقِينَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Amro Bin Usman, from Abdullah Bin Sinan, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The disciples gathered to Isa<sup>as</sup>, so they said to him<sup>asws</sup>, ‘O teacher of the goodness, guide us aright’. So he<sup>as</sup> said to them: ‘Musa<sup>as</sup>, the Prophet<sup>as</sup> of Allah<sup>azwj</sup> had ordered you all that you should not be swearing by Allah<sup>azwj</sup> as liars, and I<sup>as</sup> am ordering you that you all should not be swearing by Allah<sup>azwj</sup>, neither as liars nor as truthful’."}]}, {"index": 14533, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:7:7:1:4", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ يَحْيَى بْنِ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَبِي سَلَّامٍ الْمُتَعَبِّدِ أَنَّهُ سَمِعَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ لِسَدِيرٍ يَا سَدِيرُ مَنْ حَلَفَ بِاللَّهِ كَاذِباً كَفَرَ وَ مَنْ حَلَفَ بِاللَّهِ صَادِقاً أَثِمَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ وَ لا تَجْعَلُوا اللَّهَ عُرْضَةً لِأَيْمانِكُمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Yahya Bin Ibrahim, form his father, from Abu Sallam Al Mutabbad that, \n‘He heard Abu Abdullah<sup>asws</sup> saying to Sudeyr: ‘O Sudeyr! The one who swears by Allah<sup>azwj</sup> as a liar has disbelieved, and the one who swears by Allah<sup>azwj</sup> as a truthful has sinned, <span class=\"ibTxt\">[2:224] And make not Allah an excuse for your swearing</span>’."}]}, {"index": 14534, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:7:7:1:5", "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ حَدَّثَنِي أَبُو جَعْفَرٍ ( عليه السلام ) أَنَّ أَبَاهُ كَانَتْ عِنْدَهُ امْرَأَةٌ مِنَ الْخَوَارِجِ أَظُنُّهُ قَالَ مِنْ بَنِي حَنِيفَةَ فَقَالَ لَهُ مَوْلًى لَهُ يَا ابْنَ رَسُولِ اللَّهِ إِنَّ عِنْدَكَ امْرَأَةً تَبَرَّأُ مِنْ جَدِّكَ فَقُضِيَ لِأَبِي أَنَّهُ طَلَّقَهَا فَادَّعَتْ عَلَيْهِ صَدَاقَهَا فَجَاءَتْ بِهِ إِلَى أَمِيرِ الْمَدِينَةِ تَسْتَعْدِيهِ فَقَالَ لَهُ أَمِيرُ الْمَدِينَةِ يَا عَلِيُّ إِمَّا أَنْ تَحْلِفَ وَ إِمَّا أَنْ تُعْطِيَهَا [حَقَّهَا] فَقَالَ لِي قُمْ يَا بُنَيَّ فَأَعْطِهَا أَرْبَعَمِائَةِ دِينَارٍ فَقُلْتُ لَهُ يَا أَبَهْ جُعِلْتُ فِدَاكَ أَ لَسْتَ مُحِقّاً قَالَ بَلَى يَا بُنَيَّ وَ لَكِنِّي أَجْلَلْتُ اللَّهَ أَنْ أَحْلِفَ بِهِ يَمِينَ صَبْرٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ali Bin Abu Hamza, from Abu Baseer who said, \n‘Abu Ja’far<sup>asws</sup> narrated to me that his<sup>asws</sup> father<sup>asws</sup>, there was in his<sup>asws</sup> presence a woman from the Kharijites, I believe he<sup>asws</sup> said from the Clan of Haneefa. So a slave of his<sup>asws</sup> said to him<sup>asws</sup>, ‘O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! In your<sup>asws</sup> presence is a woman who disavows from your<sup>asws</sup> grandfather<sup>saww</sup>’. So my<sup>asws</sup> father<sup>asws</sup> judged that he<sup>asws</sup> divorces her’. So she claimed for her dower upon him. So she went over with him<sup>asws</sup> to the Emir of Al-Medina claiming it. So the Emir of Al-Medina said to him<sup>asws</sup>, ‘O Ali (Bin Al-Husayn<sup>asws</sup>)! But, you<sup>asws</sup> either swear an oath or you<sup>asws</sup> giver her, her right’. So he<sup>asws</sup> said to me<sup>asws</sup>: ‘Arise, O my<sup>asws</sup> son<sup>asws</sup>, so give her four hundred Dinars’. So I<sup>asws</sup> said to him<sup>asws</sup>: ‘O Father<sup>asws</sup>! May I be sacrificed for you<sup>asws</sup>! Are you<sup>asws</sup> not rightful?’ He<sup>asws</sup> said: ‘Yes, my<sup>asws</sup> son<sup>asws</sup>! But, I<sup>asws</sup> delayed the swearing of an oath by Allah<sup>azwj</sup> patiently’."}]}, {"index": 14535, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:7:7:1:6", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا ادُّعِيَ عَلَيْكَ مَالٌ وَ لَمْ يَكُنْ لَهُ عَلَيْكَ فَأَرَادَ أَنْ يُحَلِّفَكَ فَإِنْ بَلَغَ مِقْدَارَ ثَلَاثِينَ دِرْهَماً فَأَعْطِهِ وَ لَا تَحْلِفْ وَ إِنْ كَانَ أَكْثَرَ مِنْ ذَلِكَ فَاحْلِفْ وَ لَا تُعْطِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from one of our companions, \nAbu Abdullah<sup>asws</sup> has said: ‘When there is a claim upon you for wealth, and there does not happen to be for him upon you (a right), and he intends that you swear an oath, so if it reaches a valued of thirty Dirhams, so give it to him and do not swear an oath, and if it is more than that, so swear an oath and do not give it to him’."}]}]}, "index": "al-kafi:7:7:1", "kind": "verse_list"}