{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 7"}, "path": "/books/al-kafi:7:7", "titles": {"ar": "كِتَابُ الْأَيْمَانِ وَ النُّذُورِ وَ الْكَفَّارَاتِ", "en": "THE BOOK OF OATHS, AND THE VOWS, AND THE EXPIATIONS"}}, {"indexed_titles": {"en": "Chapter 17"}, "path": "/books/al-kafi:7:7:17", "titles": {"ar": "باب النُّذُورِ", "en": "Chapter 17 – The Vows"}}], "index": 2260, "local_index": 17, "part_type": "Chapter", "path": "/books/al-kafi:7:7:17", "titles": {"ar": "باب النُّذُورِ", "en": "Chapter 17 – The Vows"}, "verse_count": 25, "verse_start_index": 14627, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 14628, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َبُو عَلِيٍّ الْأَشْعَرِيُّ</span> عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ مَنْصُورِ بْنِ حَازِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا قَالَ الرَّجُلُ عَلَيَّ الْمَشْيُ إِلَى بَيْتِ اللَّهِ وَ هُوَ مُحْرِمٌ بِحَجَّةٍ أَوْ عَلَيَّ هَدْيُ كَذَا وَ كَذَا فَلَيْسَ بِشَيْ‏ءٍ حَتَّى يَقُولَ لِلَّهِ عَلَيَّ الْمَشْيُ إِلَى بَيْتِهِ أَوْ يَقُولَ لِلَّهِ عَلَيَّ أَنْ أُحْرِمَ بِحَجَّةٍ أَوْ يَقُولَ لِلَّهِ عَلَيَّ هَدْيُ كَذَا وَ كَذَا إِنْ لَمْ أَفْعَلْ كَذَا وَ كَذَا ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Mansour Bin Hazim, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the mans says, ‘Upon me is the walking to the House of Allah<sup>azwj</sup>’, and he is in <span class=\"iTxt\">Ihraam</span>, or ‘Upon me is making an offering of such and such’, so it is not with anything, until he is saying, ‘For the Sake of Allah<sup>azwj</sup>, upon me is the walking to His<sup>azwj</sup> House’, or is saying, ‘For the Sake of Allah<sup>azwj</sup>, it is upon me that I should be wearing <span class=\"iTxt\">Ihraam</span> for the Hajj’, or is saying, ‘For the Sake of Allah<sup>azwj</sup>, upon me is making a offering of such and such, if I were not to do such and such’."]}}, {"index": 14629, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:2", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ قَالَ عَلَيَّ نَذْرٌ قَالَ لَيْسَ النَّذْرُ بِشَيْ‏ءٍ حَتَّى يُسَمِّيَ شَيْئاً لِلَّهِ صِيَاماً أَوْ صَدَقَةً أَوْ هَدْياً أَوْ حَجّاً."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Muhammad Bin Al Fazeyl, from Abu Al Sabbah Al Kinany who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about a man who says, ‘Upon me is a vow’. He<sup>asws</sup> said: ‘The vow is not with anything until he names something for the Sake of Allah<sup>azwj</sup>, a Fast, or a charity, or an offering, or Hajj’."]}}, {"index": 14630, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:3", "text": ["أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَقُولُ عَلَيَّ نَذْرٌ قَالَ لَيْسَ بِشَيْ‏ءٍ حَتَّى يُسَمِّيَ النَّذْرَ وَ يَقُولَ عَلَيَّ صَوْمٌ لِلَّهِ أَوْ يَتَصَدَّقَ أَوْ يُعْتِقَ أَوْ يُهْدِيَ هَدْياً وَ إِنْ قَالَ الرَّجُلُ أَنَا أُهْدِي هَذَا الطَّعَامَ فَلَيْسَ هَذَا بِشَيْ‏ءٍ إِنَّمَا تُهْدَى الْبُدْنُ ."], "translations": {"en.hubeali": ["Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ali Bin Abu Hamza, from Abu Baseer who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about the man who is saying, ‘Upon me is a vow’. He<sup>asws</sup> said: ‘It is not with anything until he names the vow and is saying, ‘Upon me is a Fast for the Sake of Allah<sup>azwj</sup>, or a charity, or freeing (a slave), or an offering of a gift. And if the man says, ‘I gift this food’, so this is not with anything, but rather the camel is an offering’."]}}, {"index": 14631, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:4", "text": ["أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ جَمِيلِ بْنِ صَالِحٍ قَالَ كَانَتْ عِنْدِي جَارِيَةٌ بِالْمَدِينَةِ فَارْتَفَعَ طَمْثُهَا فَجَعَلْتُ لِلَّهِ عَلَيَّ نَذْراً إِنْ هِيَ حَاضَتْ فَعَلِمْتُ بَعْدُ أَنَّهَا حَاضَتْ قَبْلَ أَنْ أَجْعَلَ النَّذْرَ فَكَتَبْتُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا بِالْمَدِينَةِ فَأَجَابَنِي إِنْ كَانَتْ حَاضَتْ قَبْلَ النَّذْرِ فَلَا عَلَيْكَ وَ إِنْ كَانَتْ حَاضَتْ بَعْدَ النَّذْرِ فَعَلَيْكَ ."], "translations": {"en.hubeali": ["Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad, from Jameel Bin Salih who said, ", "‘There used to be a slave girl with me at Al-Medina, so her menstruations were raised (stopped). So I made a vow upon myself for the Sake of Allah<sup>azwj</sup> if she were to menstruate. So I came to know afterwards that she had menstruated before I had made the (specifics of the) vow. So I wrote to Abu Abdullah<sup>asws</sup>, and I was at Al Medina. So he<sup>asws</sup> answered me: ‘If she has menstruated before the vow, so it is not upon you, and if she has menstruated after the vow, so it is upon you’."]}}, {"index": 14632, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:5", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ صَفْوَانَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي جَعَلْتُ عَلَى نَفْسِي شُكْراً لِلَّهِ رَكْعَتَيْنِ أُصَلِّيهِمَا فِي الْحَضَرِ وَ السَّفَرِ أَ فَأُصَلِّيهِمَا فِي السَّفَرِ بِالنَّهَارِ فَقَالَ نَعَمْ ثُمَّ قَالَ إِنِّي أَكْرَهُ الْإِيجَابَ أَنْ يُوجِبَ الرَّجُلُ عَلَى نَفْسِهِ قُلْتُ إِنِّي لَمْ أَجْعَلْهُمَا لِلَّهِ عَلَيَّ إِنَّمَا جَعَلْتُ ذَلِكَ عَلَى نَفْسِي أُصَلِّيهِمَا شُكْراً لِلَّهِ وَ لَمْ أُوجِبْهُمَا عَلَى نَفْسِي أَ فَأَدَعُهُمَا إِذَا شِئْتُ قَالَ نَعَمْ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Safwan, from Is’haq Bin Ammar who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘I have made it upon myself, a gratefulness for the Sake of Allah<sup>azwj</sup>, two Cycles that I shall be Praying during the staying and the travelling. Shall I Pray these two in the travel by the day?’ So he<sup>asws</sup> said: ‘Yes’. Then he<sup>asws</sup> said: ‘My<sup>asws</sup> father<sup>asws</sup> disliked the obligation if the man obligates upon himself’. I said, ‘I did not make these two (obligatory) upon myself for the Sake of Allah<sup>azwj</sup>. That is upon me to Pray these two as a gratitude for Allah<sup>azwj</sup>, and I did not make these two an obligation upon myself. So, can I fulfill these whenever I so desire to?’ He<sup>asws</sup> said: ‘Yes’."]}}, {"index": 14633, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:6", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) سُئِلَ عَنْ رَجُلٍ نَذَرَ أَنْ يَمْشِيَ إِلَى الْبَيْتِ فَمَرَّ بِمَعْبَرٍ قَالَ فَلْيَقُمْ فِي الْمِعْبَرِ قَائِماً حَتَّى يَجُوزَ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> that Amir Al-Momineen<sup>asws</sup> was asked about a man who vowed that he would walk to the House (Kaaba). So he passed by a crossing. He<sup>asws</sup> said: ‘So let him pause in the crossing, standing, until he is allowed (to cross)’."]}}, {"index": 14634, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:7", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي إِبْرَاهِيمَ ( عليه السلام ) قَالَ قُلْتُ لَهُ رَجُلٌ كَانَتْ عَلَيْهِ حَجَّةُ الْإِسْلَامِ فَأَرَادَ أَنْ يَحُجَّ فَقِيلَ لَهُ تَزَوَّجْ ثُمَّ حُجَّ فَقَالَ إِنْ تَزَوَّجْتُ قَبْلَ أَنْ أَحُجَّ فَغُلَامِي حُرٌّ فَتَزَوَّجَ قَبْلَ أَنْ يَحُجَّ فَقَالَ أُعْتِقَ غُلَامُهُ فَقُلْتُ لَمْ يُرِدْ بِعِتْقِهِ وَجْهَ اللَّهِ فَقَالَ إِنَّهُ نَذْرٌ فِي طَاعَةِ اللَّهِ وَ الْحَجُّ أَحَقُّ مِنَ التَّزْوِيجِ وَ أَوْجَبُ عَلَيْهِ مِنَ التَّزْوِيجِ قُلْتُ فَإِنَّ الْحَجَّ تَطَوُّعٌ قَالَ وَ إِنْ كَانَ تَطَوُّعاً فَهِيَ طَاعَةٌ لِلَّهِ قَدْ أَعْتَقَ غُلَامَهُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Safwan Bin Yahya, from Is’haq Bin Ammar, ", "(It has been narrated) from Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), said, ‘I said to him<sup>asws</sup>, ‘The man, upon him is (performance of) the Hajj of Al-Islam. So he intended for Hajj. So it was said to him, ‘Get married, then go for Hajj’. So he said, ‘If I can get married before I can go for Hajj, so my slave is free’. So he got married before he went for Hajj’. So he<sup>asws</sup> said: ‘He should free his slave’. So I said, ‘He did not intend to free him for the Sake of Allah<sup>azwj</sup>’. So he<sup>asws</sup> said: ‘He had vowed in obedience to Allah<sup>azwj</sup>, and the Hajj is more rightful than the marriage, and it is more Obligatory upon him than the marriage’. I said, ‘Suppose if the Hajj was optional (for him)?’ He<sup>asws</sup> said; ‘Even if it was optional, so it is an obedience to Allah<sup>azwj</sup> which has freed his slave’."]}}, {"index": 14635, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:8", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ خَالِدِ بْنِ جَرِيرٍ عَنْ أَبِي الرَّبِيعِ قَالَ سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَقُولُ لِلشَّيْ‏ءِ يَبِيعُهُ أَنَا أُهْدِيهِ إِلَى بَيْتِ اللَّهِ الْحَرَامِ قَالَ فَقَالَ لَيْسَ بِشَيْ‏ءٍ كَذِبَةٌ كَذَبَهَا ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, form Ibn Mahboub, from Khalid Bin Jareer, from Abu Al Rabie who said, ", "‘Abu Abdullah<sup>asws</sup> was asked about the man who is saying for something which has sold it, ‘I hereby gift it to the House of Allah<sup>azwj</sup>, the Sacred’. So he<sup>asws</sup> said: ‘It is not with anything. It is a lie which he has lied it’."]}}, {"index": 14636, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:9", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنْ قُلْتَ لِلَّهِ عَلَيَّ فَكَفَّارَةُ يَمِينٍ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said, ‘If you were to say, ‘For the Sake of Allah<sup>azwj</sup> it is upon me’, so its expiation is that of an oath’."]}}, {"index": 14637, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:10", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ قَالَ كَتَبَ بُنْدَارُ مَوْلَى إِدْرِيسَ يَا سَيِّدِي نَذَرْتُ أَنْ أَصُومَ كُلَّ يَوْمِ سَبْتٍ فَإِنْ أَنَا لَمْ أَصُمْهُ مَا يَلْزَمُنِي مِنَ الْكَفَّارَةِ فَكَتَبَ وَ قَرَأْتُهُ لَا تَتْرُكْهُ إِلَّا مِنْ عِلَّةٍ وَ لَيْسَ عَلَيْكَ صَوْمُهُ فِي سَفَرٍ وَ لَا مَرَضٍ إِلَّا أَنْ تَكُونَ نَوَيْتَ ذَلِكَ وَ إِنْ كُنْتَ أَفْطَرْتَ مِنْهُ مِنْ غَيْرِ عِلَّةٍ فَتَصَدَّقْ بِعَدَدِ كُلِّ يَوْمٍ لِسَبْعَةِ مَسَاكِينَ نَسْأَلُ اللَّهَ التَّوْفِيقَ لِمَا يُحِبُّ وَ يَرْضَى ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Ali Bin Mahziyar who said, ", "‘Bundaro, a slave of Idrees, wrote, ‘My master! I vowed that I would be Fasting every day of Saturday. So if I were not to Fast it, what necessitates upon me from the expiation?’ So he<sup>asws</sup> wrote, and I read it: ‘Do not leave it except from a reason, and there is no Fasting of it upon you during a journey, nor an illness, except if you had intended that; and if you were to break a Fast from it from without a reason, so give in charity with the number of each day (missed), to seven poor ones. We<sup>asws</sup> ask Allah<sup>azwj</sup> for the inclination to what He<sup>azwj</sup> Loves and is Pleased with’."]}}, {"index": 14638, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:11", "text": ["وَ عَنْهُ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ قَالَ قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) رَجُلٌ جَعَلَ عَلَى نَفْسِهِ نَذْراً إِنْ قَضَى اللَّهُ حَاجَتَهُ أَنْ يَتَصَدَّقَ بِدَرَاهِمَ فَقَضَى اللَّهُ حَاجَتَهُ فَصَيَّرَ الدَّرَاهِمَ ذَهَباً وَ وَجَّهَهَا إِلَيْكَ أَ يَجُوزُ ذَلِكَ أَوْ يُعِيدُ فَقَالَ يُعِيدُ ."], "translations": {"en.hubeali": ["And from him, from Ali Bin Mahziyar who said, ", "‘I said to Abu Al-Hassan<sup>asws</sup>, ‘A man made a vow upon himself, if Allah<sup>azwj</sup> were to Fulfill his need, that he would give in charity with (certain) Dirhams. So Allah<sup>azwj</sup> Fulfilled his need. So he turned the Dirhams as gold and has diverted these to you<sup>asws</sup>. Is that allowed, or should he repeat?’ So he<sup>asws</sup> said: ‘He should repeat’."]}}, {"index": 14639, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:12", "text": ["مُحَمَّدُ بْنُ جَعْفَرٍ الرَّزَّازُ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ مَهْزِيَارَ مِثْلَهُ وَ كَتَبَ إِلَيْهِ يَا سَيِّدِي رَجُلٌ نَذَرَ أَنْ يَصُومَ يَوْمَ الْجُمُعَةِ دَائِماً مَا بَقِيَ فَوَافَقَ ذَلِكَ الْيَوْمُ يَوْمَ عِيدِ فِطْرٍ أَوْ أَضْحًى أَوْ أَيَّامَ التَّشْرِيقِ أَوِ السَّفَرَ أَوْ مَرِضَ هَلْ عَلَيْهِ صَوْمُ ذَلِكَ الْيَوْمِ أَوْ قَضَاؤُهُ أَوْ كَيْفَ يَصْنَعُ يَا سَيِّدِي فَكَتَبَ إِلَيْهِ قَدْ وَضَعَ اللَّهُ عَنْهُ الصِّيَامَ فِي هَذِهِ الْأَيَّامِ كُلِّهَا وَ يَصُومُ يَوْماً بَدَلَ يَوْمٍ إِنْ شَاءَ اللَّهُ ", "وَ كَتَبَ إِلَيْهِ يَسْأَلُهُ يَا سَيِّدِي رَجُلٌ نَذَرَ أَنْ يَصُومَ يَوْماً فَوَقَعَ ذَلِكَ الْيَوْمَ عَلَى أَهْلِهِ مَا عَلَيْهِ مِنَ الْكَفَّارَةِ فَكَتَبَ إِلَيْهِ يَصُومُ يَوْماً بَدَلَ يَوْمٍ وَ تَحْرِيرُ رَقَبَةٍ مُؤْمِنَةٍ."], "translations": {"en.hubeali": ["Muhammad Bin Ja’far Al Razzaz, from Muhammad Bin Isa, from Ali Bin Mahziyar ", "A – similar to it, and he wrote to him<sup>asws</sup>, ‘O my master! A man vowed that he would Fast on the day of Friday, for ever, whatever remains (from his life). So that day matched up with <span class=\"iTxt\">Eid Al Fitr</span>, or <span class=\"iTxt\">Az’ha</span>, or the days of <span class=\"iTxt\">Tashreek</span>, or the journey, or an illness. Is the Fast of that day upon him, or its fulfillment, or how should he deal with it, O my master!’ So he<sup>asws</sup> wrote to him; ‘Allah<sup>azwj</sup> has Placed (Dropped) the Fasting during these days, all of them, and he should be Fasting a day in exchange for a day, Allah<sup>azwj</sup> Willing’. ", "And he wrote to him<sup>asws</sup>, asking him<sup>asws</sup>, ‘O my master! A man vowed that he would be Fasting a day, so that day matched up upon his wife, what is upon him from the expiation’. So he<sup>asws</sup> wrote to him: ‘He should Fast a day in exchange for a day, and free a neck of a Believer’."]}}, {"index": 14640, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:13", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ كَفَّارَةِ النَّذْرِ فَقَالَ كَفَّارَةُ النَّذْرِ كَفَّارَةُ الْيَمِينِ وَ مَنْ نَذَرَ هَدْياً فَعَلَيْهِ نَاقَةٌ يُقَلِّدُهَا وَ يُشْعِرُهَا وَ يَقِفُ بِهَا بِعَرَفَةَ وَ مَنْ نَذَرَ جَزُوراً فَحَيْثُ شَاءَ نَحَرَهُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Al Qasim Bin Muhammad, from Suleyman Bin Dawood, from Hafs Bin Giyas, ", "Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about an expiation of the vow. So he<sup>asws</sup> said: ‘An expiation of the vow is an expiation of the oath. So the one who vows of a an offering, so upon him is a camel, he should collar it, and mark it, and pause with it at Arafaat; and the one who vows a ‘<span class=\"iTxt\">Juzour</span>’, so he can slaughter it wherever he so desires to’."]}}, {"index": 14641, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:14", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنِ الْحَسَنِ بْنِ الْحُسَيْنِ اللُّؤْلُؤِيِّ رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ الرَّجُلُ يَقُولُ عَلَيَّ نَذْرٌ وَ لَا يُسَمِّي شَيْئاً قَالَ كَفٌّ مِنْ بُرٍّ غُلِّظَ عَلَيْهِ أَوْ شُدِّدَ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Al Hassan Bin Al Husayn Al Lului, raising it, ", "Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘The man is saying, ‘Upon me is a vow’, and he does not name anything’. He<sup>asws</sup> said: ‘A palm full of wheat, whether it is hard upon him or difficult’."]}}, {"index": 14642, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:15", "text": ["عَنْهُ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنْ يَحْيَى بْنِ الْمُبَارَكِ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ يَجْعَلُ عَلَيْهِ صِيَاماً فِي نَذْرٍ فَلَا يَقْوَى قَالَ يُعْطِي مَنْ يَصُومُ عَنْهُ فِي كُلِّ يَوْمٍ مُدَّيْنِ ."], "translations": {"en.hubeali": ["From him, from Yaqoub Bin Yazeed, from Yahya Bin Al Mubarka, from Abdullah Bin Jabala, from Is’haq Bin Ammar, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who made Fasts to be upon himself regarding a vow, but he had no strength (for it). He<sup>asws</sup> said: ‘He should give to the one who Fasts on his behalf, for each day, two handfuls’."]}}, {"index": 14643, "local_index": 16, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:16", "text": ["وَ بِهَذَا الْإِسْنَادِ عَنْ عَبْدِ اللَّهِ بْنِ جُنْدَبٍ قَالَ سَأَلَ عَبَّادُ بْنُ مَيْمُونٍ وَ أَنَا حَاضِرٌ عَنْ رَجُلٍ جَعَلَ عَلَى نَفْسِهِ نَذْراً صَوْماً وَ أَرَادَ الْخُرُوجَ إِلَى مَكَّةَ فَقَالَ عَبْدُ اللَّهِ بْنُ جُنْدَبٍ سَمِعْتُ مَنْ رَوَاهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ سُئِلَ عَنْ رَجُلٍ جَعَلَ عَلَى نَفْسِهِ نَذْراً صَوْماً فَحَضَرَتْهُ نِيَّتُهُ فِي زِيَارَةِ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ يَخْرُجُ وَ لَا يَصُومُ فِي الطَّرِيقِ فَإِذَا رَجَعَ قَضَى ذَلِكَ ."], "translations": {"en.hubeali": ["And by this chain, from Abdullah Bin Jundab who said, ", "‘Ubbad Bin Maymoun was asked, and I was present, about a man who made a vow upon himself for Fasting, and the going out to Makkah. So Abdullah Bin Jundab said, ‘I heard from the one who reported it, from Abu Abdullah<sup>asws</sup> having been asked about a man who made a vow upon himself for Fasting. So his intention presented itself with regarding to visiting Abu Abdullah<sup>asws</sup>. He<sup>asws</sup> said: ‘He should go out and not Fast during the road. So when he returns, he can fulfill that’."]}}, {"index": 14644, "local_index": 17, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:17", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ أَبِي الْحَسَنِ مُوسَى ( عليه السلام ) أَنَّهُ قَالَ كُلُّ مَنْ عَجَزَ عَنْ نَذْرٍ نَذَرَهُ فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Mahboub, form Jameel Bin Salih, ", "(It has been narrated) from Abu Al-Hassan Musa<sup>asws</sup> having said: ‘Every one who is frustrated from fulfilling his vow, so his expiation is an expiation of an oath’."]}}, {"index": 14645, "local_index": 18, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:18", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنِ السِّنْدِيِّ بْنِ مُحَمَّدٍ عَنْ صَفْوَانَ الْجَمَّالِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ بِأَبِي أَنْتَ وَ أُمِّي إِنِّي جَعَلْتُ عَلَى نَفْسِي مَشْياً إِلَى بَيْتِ اللَّهِ قَالَ كَفِّرْ يَمِينَكَ فَإِنَّمَا جَعَلْتَ عَلَى نَفْسِكَ يَمِيناً وَ مَا جَعَلْتَهُ لِلَّهِ فَفِ بِهِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Al Sindy Bin Muhammad, from Safwan Al Jammal, ", "Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘May my father be (sacrificed) for you<sup>asws</sup> and my mother! I made it upon myself for walking to the House of Allah<sup>azwj</sup>’. He<sup>asws</sup> said: ‘Expiate your vow, for rather you have made an oath upon yourself, so whatever you have made it to be for the Sake of Allah<sup>azwj</sup>, so fulfill with it’."]}}, {"index": 14646, "local_index": 19, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:19", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ رِفَاعَةَ وَ حَفْصٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ نَذَرَ أَنْ يَمْشِيَ إِلَى بَيْتِ اللَّهِ حَافِياً قَالَ فَلْيَمْشِ فَإِذَا تَعِبَ فَلْيَرْكَبْ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Rafa’at, and Hafs who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about a man who vowed that he walks to the House of Allah<sup>azwj</sup> bare-footed. He<sup>asws</sup> said: ‘So let him walk. So when he is tired, so let him ride’."]}}, {"index": 14647, "local_index": 20, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:20", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ الْعَلَاءِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ [عَنْ أَحَدِهِمَا ع] قَالَ سَأَلْتُهُ عَنْ رَجُلٍ جَعَلَ عَلَيْهِ مَشْياً إِلَى بَيْتِ اللَّهِ وَ لَمْ يَسْتَطِعْ قَالَ يَحُجُّ رَاكِباً ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Al A’ala, from Muhammad Bin Muslim, ", "(It has been narrated) from one of the two (5<sup>th</sup> of 6<sup>th</sup> Imam<sup>asws</sup>), said, ‘I asked him<sup>asws</sup>, ‘A man made it upon himself for walking to the House of Allah<sup>azwj</sup>, and he could not do it’. He<sup>asws</sup> said: ‘He should go to Hajj, riding’."]}}, {"index": 14648, "local_index": 21, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:21", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ رَجُلٍ جَعَلَ عَلَيْهِ الْمَشْيَ إِلَى بَيْتِ اللَّهِ فَلَمْ يَسْتَطِعْ قَالَ فَلْيَحُجَّ رَاكِباً ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Hammad, from Hareyz, from Muhammad Bin Muslim who said, ", "‘I asked Abu Ja’far<sup>asws</sup> about a man who made it upon himself for the walking to the House of Allah<sup>azwj</sup>, but could not do it’. He<sup>asws</sup> said: ‘So let him go to Hajj, riding’."]}}, {"index": 14649, "local_index": 22, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:22", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ سُئِلَ عَنِ الرَّجُلِ يَحْلِفُ بِالنَّذْرِ وَ نِيَّتُهُ فِي يَمِينِهِ الَّتِي حَلَفَ عَلَيْهَا دِرْهَمٌ أَوْ أَقَلُّ قَالَ إِذَا لَمْ يَجْعَلْ لِلَّهِ فَلَيْسَ بِشَيْ‏ءٍ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Haroun Bin Muslim, from Mas’ada Bin Sadaqa who said, ", "‘I heard Abu Abdullah<sup>asws</sup>, and he<sup>asws</sup> had been asked about the man who swore with the vow, and his intention in his oath which he had oathed upon is one Dirham or less. He<sup>asws</sup> said: ‘When he did not make it for the Sake of Allah<sup>azwj</sup>, so it is not with anything’."]}}, {"index": 14650, "local_index": 23, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:23", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى الْخَثْعَمِيِّ قَالَ كُنَّا عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) جَمَاعَةً إِذْ دَخَلَ عَلَيْهِ رَجُلٌ مِنْ مَوَالِي أَبِي جَعْفَرٍ ( عليه السلام ) فَسَلَّمَ عَلَيْهِ ثُمَّ جَلَسَ وَ بَكَى ثُمَّ قَالَ لَهُ جُعِلْتُ فِدَاكَ إِنِّي كُنْتُ أَعْطَيْتُ اللَّهَ عَهْداً إِنْ عَافَانِيَ اللَّهُ مِنْ شَيْ‏ءٍ كُنْتُ أَخَافُهُ عَلَى نَفْسِي أَنْ أَتَصَدَّقَ بِجَمِيعِ مَا أَمْلِكُ وَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ عَافَانِي مِنْهُ وَ قَدْ حَوَّلْتُ عِيَالِي مِنْ مَنْزِلِي إِلَى قُبَّةٍ مِنْ خَرَابِ الْأَنْصَارِ وَ قَدْ حَمَلْتُ كُلَّ مَا أَمْلِكُ فَأَنَا بَائِعٌ دَارِي وَ جَمِيعَ مَا أَمْلِكُ فَأَتَصَدَّقُ بِهِ ", "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) انْطَلِقْ وَ قَوِّمْ مَنْزِلَكَ وَ جَمِيعَ مَتَاعِكَ وَ مَا تَمْلِكُ بِقِيمَةٍ عَادِلَةٍ وَ اعْرِفْ ذَلِكَ ثُمَّ اعْمِدْ إِلَى صَحِيفَةٍ بَيْضَاءَ فَاكْتُبْ فِيهَا جُمْلَةَ مَا قَوَّمْتَ ثُمَّ انْظُرْ إِلَى أَوْثَقِ النَّاسِ فِي نَفْسِكَ فَادْفَعْ إِلَيْهِ الصَّحِيفَةَ وَ أَوْصِهِ وَ مُرْهُ إِنْ حَدَثَ بِكَ حَدَثُ الْمَوْتِ أَنْ يَبِيعَ مَنْزِلَكَ وَ جَمِيعَ مَا تَمْلِكُ فَيَتَصَدَّقَ بِهِ عَنْكَ ثُمَّ ارْجِعْ إِلَى مَنْزِلِكَ وَ قُمْ فِي مَالِكَ عَلَى مَا كُنْتَ فِيهِ فَكُلْ أَنْتَ وَ عِيَالُكَ مِثْلَ مَا كُنْتَ تَأْكُلُ ", "ثُمَّ انْظُرْ بِكُلِّ شَيْ‏ءٍ تَصَدَّقُ بِهِ فِيمَا تَسْتَقْبِلُ مِنْ صَدَقَةٍ أَوْ صِلَةِ قَرَابَةٍ أَوْ فِي وُجُوهِ الْبِرِّ فَاكْتُبْ ذَلِكَ كُلَّهُ وَ أَحْصِهِ فَإِذَا كَانَ رَأْسُ السَّنَةِ فَانْطَلِقْ إِلَى الرَّجُلِ الَّذِي أَوْصَيْتَ إِلَيْهِ فَمُرْهُ أَنْ يُخْرِجَ إِلَيْكَ الصَّحِيفَةَ ثُمَّ اكْتُبْ فِيهَا جُمْلَةَ مَا تَصَدَّقْتَ وَ أَخْرَجْتَ مِنْ صِلَةِ قَرَابَةٍ أَوْ بِرٍّ فِي تِلْكَ السَّنَةِ ثُمَّ افْعَلْ ذَلِكَ فِي كُلِّ سَنَةٍ حَتَّى تَفِيَ لِلَّهِ بِجَمِيعِ مَا نَذَرْتَ فِيهِ وَ يَبْقَى لَكَ مَنْزِلُكَ وَ مَالُكَ إِنْ شَاءَ اللَّهُ ", "قَالَ فَقَالَ الرَّجُلُ فَرَّجْتَ عَنِّي يَا ابْنَ رَسُولِ اللَّهِ جَعَلَنِيَ اللَّهُ فِدَاكَ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Muhammad Bin Yahya Al Khash’amy who said, ", "‘There was a group in the presence of Abu Abdullah<sup>asws</sup>, when a man from the adherents of Abu Ja’far<sup>asws</sup> entered. So he greeted him<sup>asws</sup>, then was seated and cried. Then he said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! I gave a promise to Allah<sup>azwj</sup> that if He<sup>azwj</sup> was to Heal me from something which I was afraid of upon myself, I would give in charity with the entirety of what I own; and Allah<sup>azwj</sup> Mighty and Majestic did cure me from it, and I have transferred my family from my house to a canopy  from the ruins of the Helpers, and have carried every thing what I owned, so I would sell my house, and the entirety of what I own, so I would give in charity with it’. ", "So Abu Abdullah<sup>asws</sup> said: ‘Go and evaluate your house, and the entirety of your belongings, and whatever you own with a just price, and recognise that. Then take to a white parchment and write down in it all of whatever you have evaluated. Then look around to a reliable one of the people with regards to yourself, so hand over the parchment to him, and bequeath to him and instruct him that if there were to occur an event with you, an event of the death, that he should sell your house and the entirety of whatever you own, so he should give it in charity with it on your behalf. Then return to your house, and evaluate upon what was in it. So consume, you and your family, similar what you used to consume. ", "Then consider everything you give in charity with, with regards to what faces you from the charity, or helping the relatives, or in the aspects of righteousness, so write that down, all of it, and count it. So whenever it is the start of the year, so go to the man to whom you had bequeathed to, and instruct him that he should bring the parchment out to you. Then write in it the total of whatever you have given in charity, and the expenses upon your relatives, or righteous deeds during that year. Then keep on doing that during every year until you have fulfilled for Allah<sup>azwj</sup> with the entirety of what you had vowed in it, and there would remain for you, your house, and your wealth, Allah<sup>azwj</sup> Willing’. ", "He (the narrator) said, ‘So the man said, ‘You<sup>asws</sup> have relieved me, O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>, may Allah<sup>azwj</sup> Make me to be sacrificed for you<sup>asws</sup>’."]}}, {"index": 14651, "local_index": 24, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:24", "text": ["عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ زُرَارَةَ قَالَ إِنَّ أُمِّي كَانَتْ جَعَلَتْ عَلَيْهَا نَذْراً نَذَرَتْ لِلَّهِ عَزَّ وَ جَلَّ فِي بَعْضِ وُلْدِهَا فِي شَيْ‏ءٍ كَانَتْ تَخَافُهُ عَلَيْهِ أَنْ تَصُومَ ذَلِكَ الْيَوْمَ الَّذِي تَقَدَّمَ فِيهِ عَلَيْهَا مَا بَقِيَتْ فَخَرَجَتْ مَعَنَا إِلَى مَكَّةَ فَأَشْكَلَ عَلَيْنَا صِيَامُهَا فِي السَّفَرِ فَلَمْ تَدْرِ تَصُومُ أَوْ تُفْطِرُ فَسَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ ذَلِكَ فَقَالَ لَا تَصُومُ فِي السَّفَرِ إِنَّ اللَّهَ عَزَّ وَ جَلَّ قَدْ وَضَعَ عَنْهَا حَقَّهُ فِي السَّفَرِ وَ تَصُومُ هِيَ مَا جَعَلَتْ عَلَى نَفْسِهَا فَقُلْتُ لَهُ فَمَا ذَا إِذَا قَدِمَتْ إِنْ تَرَكَتْ ذَلِكَ قَالَ لَا إِنِّي أَخَافُ أَنْ تَرَى فِي وَلَدِهَا الَّذِي نَذَرَتْ فِيهِ بَعْضَ مَا تَكْرَهُ ."], "translations": {"en.hubeali": ["Ali, from his father, from Ibn Mahboun, from Ali Bin Raib, from Zurara who said, ", "‘My mother had made vow upon herself. She vowed for Allah<sup>azwj</sup> Mighty and Majestic regarding one of her children with regards to something which she had feared over him, that she would be Fasting on that day which had come upon her, for as long as she lived. So she went out with use to Makkah. So that was confusing upon us, for her to be Fasting during the journey. So she did not know when she should be Fasting or breaking it. So I asked Abu Ja’far<sup>asws</sup> about that, so he<sup>asws</sup> said: ‘She should not Fast during the journey. Allah<sup>azwj</sup> Mighty and Majestic has Placed (dropped) it from her, being her right in the journey, and she should be Fasting what she had made it to be upon herself’. So I said to him<sup>asws</sup>, ‘So what would be that when the day comes and she leaves that?’ He<sup>asws</sup> said: ‘No! I<sup>asws</sup> fear that she would see in her child that which she had vowed regarding it, some of what she had left’."]}}, {"index": 14652, "local_index": 25, "part_type": "Hadith", "path": "/books/al-kafi:7:7:17:25", "text": ["عَنْهُ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ مِسْمَعٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) كَانَتْ لِي جَارِيَةٌ حُبْلَى فَنَذَرْتُ لِلَّهِ عَزَّ وَ جَلَّ إِنْ وَلَدَتْ غُلَاماً أَنْ أُحِجَّهُ أَوْ أَحُجَّ عَنْهُ فَقَالَ إِنَّ رَجُلًا نَذَرَ لِلَّهِ عَزَّ وَ جَلَّ فِي ابْنٍ لَهُ إِنْ هُوَ أَدْرَكَ أَنْ يَحُجَّ عَنْهُ أَوْ يُحِجَّهُ فَمَاتَ الْأَبُ وَ أَدْرَكَ الْغُلَامُ بَعْدُ فَأَتَى رَسُولَ اللَّهِ ( صلى الله عليه وآله ) الْغُلَامُ فَسَأَلَهُ عَنْ ذَلِكَ فَأَمَرَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَنْ يُحَجَّ عَنْهُ مِمَّا تَرَكَ أَبُوهُ ."], "translations": {"en.hubeali": ["From him, from his father, from Ibn Mahboub, from Ali Bin Raib, from Misma’a who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘There was a slave girl of mine who was pregnant. So I vowed for Allah<sup>azwj</sup> Mighty and Majestic that if she were to give birth to a boy, I would send him for Hajj, or I would perform Hajj on his behalf’. So he<sup>asws</sup> said: ‘A man vowed for Allah<sup>azwj</sup> Mighty and Majestic regarding a son of his, that when he is mature he would either perform Hajj of his behalf, or send him to Hajj. So the father dies and the boy matured afterwards. So the boy came to Rasool-Allah<sup>saww</sup>, to ask him<sup>saww</sup> about that. So Rasool-Allah<sup>saww</sup> ordered him that he should perform Hajj on his behalf, from what his father had neglected’."]}}]}, "index": "al-kafi:7:7:17", "kind": "verse_list"}