{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 7"
        },
        "path": "/books/al-kafi:7:7",
        "titles": {
          "ar": "كِتَابُ الْأَيْمَانِ وَ النُّذُورِ وَ الْكَفَّارَاتِ",
          "en": "THE BOOK OF OATHS, AND THE VOWS, AND THE EXPIATIONS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:7:7:18",
        "titles": {
          "ar": "باب النَّوَادِرِ",
          "en": "Chapter 18 – The Miscellaneous"
        }
      }
    ],
    "index": 2271,
    "local_index": 18,
    "nav": {
      "prev": {
        "indexed_titles": {
          "en": "Chapter 17"
        },
        "path": "/books/al-kafi:7:7:17",
        "titles": {
          "ar": "باب النُّذُورِ",
          "en": "Chapter 17 – The Vows"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 7"
        },
        "path": "/books/al-kafi:7:7",
        "titles": {
          "ar": "كِتَابُ الْأَيْمَانِ وَ النُّذُورِ وَ الْكَفَّارَاتِ",
          "en": "THE BOOK OF OATHS, AND THE VOWS, AND THE EXPIATIONS"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:7:18",
    "titles": {
      "ar": "باب النَّوَادِرِ",
      "en": "Chapter 18 – The Miscellaneous"
    },
    "verse_count": 21,
    "verse_start_index": 14663,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/351)"
        ],
        "index": 14664,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:7:18:1",
        "refs": {
          "Quran": [
            "/books/quran:20:44"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ قَالَ حَدَّثَنِي شَيْخٌ مِنْ وُلْدِ عَدِيِّ بْنِ حَاتِمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَدِيٍّ وَ كَانَ مَعَ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فِي حُرُوبِهِ أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ فِي يَوْمَ الْتَقَى هُوَ وَ مُعَاوِيَةُ بِصِفِّينَ وَ رَفَعَ بِهَا صَوْتَهُ لِيُسْمِعَ أَصْحَابَهُ وَ اللَّهِ لَأَقْتُلَنَّ مُعَاوِيَةَ وَ أَصْحَابَهُ ثُمَّ يَقُولُ فِي آخِرِ قَوْلِهِ إِنْ شَاءَ اللَّهُ يَخْفِضُ بِهَا صَوْتَهُ وَ كُنْتُ قَرِيباً مِنْهُ ",
          "فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّكَ حَلَفْتَ عَلَى مَا فَعَلْتَ ثُمَّ اسْتَثْنَيْتَ فَمَا أَرَدْتَ بِذَلِكَ فَقَالَ لِي إِنَّ الْحَرْبَ خُدْعَةٌ وَ أَنَا عِنْدَ الْمُؤْمِنِينَ غَيْرُ كَذُوبٍ فَأَرَدْتُ أَنْ أُحَرِّضَ أَصْحَابِي عَلَيْهِمْ كَيْلَا يَفْشَلُوا وَ كَيْ يَطْمَعُوا فِيهِمْ فَأَفْقَهُهُمْ يَنْتَفِعُ بِهَا بَعْدَ الْيَوْمِ إِنْ شَاءَ اللَّهُ ",
          "وَ اعْلَمْ أَنَّ اللَّهَ جَلَّ ثَنَاؤُهُ قَالَ لِمُوسَى ( عليه السلام ) حَيْثُ أَرْسَلَهُ إِلَى فِرْعَوْنَ فَقُولا لَهُ قَوْلًا لَيِّناً لَعَلَّهُ يَتَذَكَّرُ أَوْ يَخْشى وَ قَدْ عَلِمَ أَنَّهُ لَا يَتَذَكَّرُ وَ لَا يَخْشَى وَ لَكِنْ لِيَكُونَ ذَلِكَ أَحْرَصَ لِمُوسَى ( عليه السلام ) عَلَى الذَّهَابِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Haroun Bin Muslim, from Mas’ada Bin Sadaqa, from a Sheykh from the sons of Udayy Bin Hatim, from his father, ",
            "(It has been narrated) from his grandfather Udayy, and he was with Amir Al-Momineen<sup>asws</sup> during his<sup>asws</sup> wars, that Amir Al-Momineen<sup>asws</sup> said during the day he<sup>asws</sup> met Muawiya (in battle) at Siffeen, and the voices were raised by it for his<sup>asws</sup> companions to hear: ‘By Allah<sup>azwj</sup>! I<sup>asws</sup> will kill Muawiya and his companions’, then he<sup>asws</sup> was saying at the end of his<sup>asws</sup> speech: ‘Allah<sup>azwj</sup> Willing’, lowering by it his<sup>asws</sup> voice, and he<sup>asws</sup> was near to it’. ",
            "So I said, ‘O Amir Al-Momineen<sup>asws</sup>! You<sup>asws</sup> swore upon what you<sup>asws</sup> would do, then made the exclusion. So what did you<sup>asws</sup> intend by that?’ So he<sup>asws</sup> said to me: ‘The war is tricky, and I<sup>asws</sup> am not a liar in the presence of the Believers. So I<sup>asws</sup> intended that I<sup>asws</sup> exhort my<sup>asws</sup> companions against them, so perhaps they would not be discouraged, and would be desirous regarding them. So the most understanding of them would benefit by if after today, Allah<sup>azwj</sup> Willing. ",
            "And know, that Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Praise Said to Musa<sup>as</sup> when He<sup>azwj</sup> Sent him<sup>as</sup> to Pharaoh<sup>la</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:20#h44\">[20:44]</a> Then speak to him a gentle word perhaps he may mind or fear</span>, and He<sup>azwj</sup> Knew that he<sup>la</sup> would neither mind nor fear, but that happened to be an encouragement for Musa<sup>as</sup> upon the going (to Pharaoh<sup>la</sup>)’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from Harun ibn Muslim from Mas’adah ibn Sadaqah who has narrated the following: “A Shaykh of the children of ’Adi ibn Hatim narrated from his father from his grandfather who was with ’ Amir al-Mu’minin, Ali, ‘Alayhi al-Salam, in his campaign against his adversaries. He has said that on the day ’Amir al-Mu’minin, Ali, ‘Alayhi al-Salam, met Mu‘awiyah in Siffin, raised his voice to reach his companions and said, ’By Allah I will fight and kill Mu’awiyah and his people’, then said in the end of his words slowly, ‘if Allah wills.’ I was close nearby and I asked, ‘O ’Amir al-Mu’minin, you swore about what you said, then why did you make an exception to what you said?’ He (the Imam) said to me, ‘War is tricky and I am not an untruthful person before the believing people. I wanted to encourage my companions against them so they will not fail and keep an interest in their (enemy’s) defeat. The ones of most understanding among them will benefit thereby after this day, if Allah so wills. You must take notice that Allah, most Majestic, most Glorious, once said to Musa, ‘Alayhi al- Salam, when He sent him to pharaoh, “The two of you speak to him softly so that perhaps he may learn or become afraid.” <a href=\"/#/books/quran:20#h44\">[20:44]</a> He knew that he will not learn or become afraid but He wanted to encourage Musa ‘Alayhi al-Salam, to go.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/352)"
        ],
        "index": 14665,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:7:18:2",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ حَسَّانَ عَنْ أَبِي عِمْرَانَ الْأَرْمَنِيِّ عَنْ عَبْدِ اللَّهِ بْنِ الْحَكَمِ عَنْ عِيسَى بْنِ عَطِيَّةَ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) إِنِّي آلَيْتُ أَنْ لَا أَشْرَبَ مِنْ لَبَنِ عَنْزِي وَ لَا آكُلَ مِنْ لَحْمِهَا فَبِعْتُهَا وَ عِنْدِي مِنْ أَوْلَادِهَا فَقَالَ لَا تَشْرَبْ مِنْ لَبَنِهَا وَ لَا تَأْكُلْ مِنْ لَحْمِهَا فَإِنَّهَا مِنْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Hassan, from Abu Imran Al Arzamy, from Abdullah Bin Al Hakam, from Isa Bin Atiyya who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘I had oathed that I would neither drink from the milk of my goat nor eat from its flesh. So I sold it, and with me are its children’. So he<sup>asws</sup> said: ‘Neither drink from their milk nor eat from their flesh, so these are from him’."
          ],
          "en.sarwar": [
            "2. Abu Ali al-Ash‘ariy has narrated from Muhammad ibn Hassan from abu ‘Imran al-Armaniy from ‘Abd al-Hakam from ‘Isa ibn ‘Atiyah who has narrated the following: “I once said to abu Ja’far, ‘Alayhi al-Salam, that I had taken an oath not to drink from the milk of my goat and not to eat its flesh; so I sold it but its offspring has remained with me. He (the Imam) said, ‘Do not drink from its milk and do not eat from its flesh; it is from that.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/352)"
        ],
        "index": 14666,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:7:18:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ هِلَالٍ عَنْ عُقْبَةَ بْنِ خَالِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ كَانَ لِرَجُلٍ عَلَيْهِ دَيْنٌ فَلَزِمَهُ فَقَالَ الْمَلْزُومُ كُلُّ حِلٍّ عَلَيْهِ حَرَامٌ إِنْ بَرِحَ حَتَّى يُرْضِيَكَ فَخَرَجَ مِنْ قَبْلِ أَنْ يُرْضِيَهُ كَيْفَ يَصْنَعُ وَ لَا يَدْرِي مَا يَبْلُغُ يَمِينُهُ وَ لَيْسَ لَهُ فِيهَا نِيَّةٌ قَالَ لَيْسَ بِشَيْ‏ءٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Abdullah Bin Hilal, from Uqba Bin Khalid, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who had a debt upon him for a man, so he enforced it. So the enforced one said that every Permissible upon him is Prohibited if he continues until he satisfies him. So he went out from him before he had pleased him. How should he deal with it, and he does not know what is the extent of his oath, and there was no intention of his for it?’ He<sup>asws</sup> said: ‘It is not with anything’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn ‘Abd Allah ibn Hilal from ‘Uqbah ibn Khalid who has narrated the following: “An indebted man who was held by his creditor said, ‘All lawful things will be unlawful for me if I leave you, unless you agree to allow me to go.’ However, he then leaves without his creditor agreeing, about this and what he might do because of not knowing the condition of his oath and swearing, when in reality he did not have the intention to swear, he (the Imam) said, ‘It does not have any valid effect.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/353)"
        ],
        "index": 14667,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:7:18:4",
        "refs": {
          "Quran": [
            "/books/quran:2:237"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْقَاسِمِ بْنِ يَحْيَى عَنْ جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ نَجِيَّةَ الْعَطَّارِ قَالَ سَافَرْتُ مَعَ أَبِي جَعْفَرٍ ( عليه السلام ) إِلَى مَكَّةَ فَأَمَرَ غُلَامَهُ بِشَيْ‏ءٍ فَخَالَفَهُ إِلَى غَيْرِهِ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) وَ اللَّهِ لَأَضْرِبَنَّكَ يَا غُلَامُ ",
          "قَالَ فَلَمْ أَرَهُ ضَرَبَهُ فَقُلْتُ جُعِلْتُ فِدَاكَ إِنَّكَ حَلَفْتَ لَتَضْرِبَنَّ غُلَامَكَ فَلَمْ أَرَكَ ضَرَبْتَهُ فَقَالَ أَ لَيْسَ اللَّهُ عَزَّ وَ جَلَّ يَقُولُ وَ أَنْ تَعْفُوا أَقْرَبُ لِلتَّقْوى ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Qasim Bin Yahya, from his grandfather Al Hassan Bin Rashid, from Najiyya Al Attar who said, ",
            "‘I travelled along with Abu Ja’far<sup>asws</sup> to Makkah. So he<sup>asws</sup> ordered his<sup>asws</sup> slave with something, but he opposed him<sup>asws</sup> to something else. So Abu Ja’far<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! I<sup>asws</sup> will strike you, O slave!’ ",
            "He (the narrator) said, ‘But I did not see him<sup>asws</sup> strike him, so I said, ‘May I be sacrificed for you<sup>asws</sup>! You<sup>asws</sup> had sworn to strike your<sup>asws</sup> slave, but I did not see you strike him’. So he<sup>asws</sup> said: ‘Is Allah<sup>azwj</sup> Mighty and Majestic not Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h237\">[2:237]</a> and if you forgive it would be nearer to piety</span>’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Qasim ibn Yahya from his grandfather al-Hassan ibn Rashid from Najiyah al-‘Attar who has narrated the following: “I once travelled with abu Ja‘far, ‘Alayhi al-Salam, to Makkah and he (the Imam) commanded his slave to do something but he disobeyed and abu Ja’far, ‘Alayhi al-Salam, said, ‘By Allah, I will beat you, O ghulam (servant).’ I however, did not see him beating the ghulam, thus, I asked, ‘I pray to Allah to keep my soul in service for your cause, you swore to beat him but I did not see you do so.’ He (the Imam) said, ‘Is it not a fact that Allah, most Majestic, most Glorious, says, “If you forgive it is closer to piety.” <a href=\"/#/books/quran:2#h237\">[2:237]</a>’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/353)"
        ],
        "index": 14668,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:7:18:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِهِ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ عَجَزَ عَنِ الْكَفَّارَةِ الَّتِي تَجِبُ عَلَيْهِ صَوْمٍ أَوْ عِتْقٍ أَوْ صَدَقَةٍ فِي يَمِينٍ أَوْ نَذْرٍ أَوْ قَتْلٍ أَوْ غَيْرِ ذَلِكَ مِمَّا يَجِبُ عَلَى صَاحِبِهِ فِيهِ الْكَفَّارَةُ فَالِاسْتِغْفَارُ لَهُ كَفَّارَةٌ مَا خَلَا يَمِينَ الظِّهَارِ فَإِنَّهُ إِذَا لَمْ يَجِدْ مَا يُكَفِّرُ حَرُمَ عَلَيْهِ أَنْ يُجَامِعَهَا وَ فُرِّقَ بَيْنَهُمَا إِلَّا أَنْ تَرْضَى الْمَرْأَةُ أَنْ تَكُونَ مَعَهُ وَ لَا يُجَامِعَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from one of his companions, from Aasim Bin Humeyd, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who is frustrated from (paying the) expiation which is Obligated upon him, be it a Fast, or emancipating (librating), or a charity with regards to an oath, or a vow, or killing, or other than that from what it Obligated upon its perpetrator the expiation in it, so there is no seeking of Forgiveness is an expiation for him, except for an oath of the <span class=\"iTxt\">Zihaar</span>. So if he, when he does not find what he expiates with, it is Prohibited upon him that he copulates with her, and there would be separation between the two of them, except if the woman is pleased that there be togetherness between him and her’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from certain persons of his people from ‘Asem ibn Hamid ibn Humayd from abu Basir who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has stated this Hadith. ‘If one fails to pay an expiation which is due on him or setting free of a slave or charity because of an oath or a vow and commitment or murder and so forth or causes for which expiation is obligatory on him, then asking forgiveness is his choice in place of paying expiation. However, in the case of an oath due to Zihar, if one cannot find anything to pay as expiation, going to bed with her remains unlawful and they must stay away from each other unless the woman agrees with his living with her without going to bed.’” "
          ]
        }
      },
      {
        "index": 14669,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:7:18:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الظِّهَارُ إِذَا عَجَزَ صَاحِبُهُ عَنِ الْكَفَّارَةِ فَلْيَسْتَغْفِرْ رَبَّهُ وَ يَنْوِي أَنْ لَا يَعُودَ قَبْلَ أَنْ يُوَاقِعَ ثُمَّ لْيُوَاقِعْ وَ قَدْ أَجْزَأَ ذَلِكَ عَنْهُ مِنَ الْكَفَّارَةِ فَإِذَا وَجَدَ السَّبِيلَ إِلَى مَا يُكَفِّرُ يَوْماً مِنَ الْأَيَّامِ فَلْيُكَفِّرْ وَ إِنْ تَصَدَّقَ وَ أَطْعَمَ نَفْسَهُ وَ عِيَالَهُ فَإِنَّهُ يُجْزِئُهُ إِذَا كَانَ مُحْتَاجاً وَ إِنْ لَمْ يَجِدْ ذَلِكَ فَلْيَسْتَغْفِرْ رَبَّهُ وَ يَنْوِي أَنْ لَا يَعُودَ فَحَسْبُهُ ذَلِكَ وَ اللَّهِ كَفَّارَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Safwan Bin Yahya, from Is’haq Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The <span class=\"iTxt\">Zihaar</span>, when its perpetrator is frustrated from the expiation, so let him seek Forgiveness from his Lord<sup>azwj</sup>, and make the intention that he would not repeat before he copulates (with his wife again). Then let him copulate, and that would suffice from him as the expiation. So when he finds the way to what he can expiate with, on a day from the days, so let him expiate, even if it be a charity, and feeding himself and his family, so he has sufficed it, when he is a needy. And if he cannot find that, so let him seek Forgiveness from his Lord<sup>azwj</sup>, and make the intention that he would not repeat it, so that would count, by Allah<sup>azwj</sup>, as an expiation’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from Safwan ibn Yahya from Ishaq ibn ‘Ammar who has narrated the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that in the case of al-Zihar if the man fails to pay the expiation, he must then ask forgiveness from his Lord and keep his intention not to repeat it again before going to bed and then go to bed, it is sufficient for expiation. When he finds a way to pay the expiation in one of the days, he then must pay the expiation. If he pays charity, feeds himself and his family, it is sufficient if he is needy. If he cannot find, then he must ask forgiveness from his Lord and keep his intention not to repeat it again; it then is enough, by Allah as the expiation.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/354)"
        ],
        "index": 14670,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:7:18:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى قَالَ كَتَبَ مُحَمَّدُ بْنُ الْحَسَنِ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) رَجُلٌ حَلَفَ بِالْبَرَاءَةِ مِنَ اللَّهِ وَ مِنْ رَسُولِهِ ( صلى الله عليه وآله ) فَحَنِثَ مَا تَوْبَتُهُ وَ كَفَّارَتُهُ فَوَقَّعَ ( عليه السلام ) يُطْعِمُ عَشَرَةَ مَسَاكِينَ لِكُلِّ مِسْكِينٍ مُدٌّ وَ يَسْتَغْفِرُ اللَّهَ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya said, ",
            "‘Muhammad Bin Al-Hassan wrote to Abu Muhammad<sup>asws</sup>, ‘A man swore with the disavowing from Allah<sup>azwj</sup>, and from His<sup>azwj</sup> Rasool<sup>saww</sup>, then he reneged. So what is his repentance and his expiation?’ So he<sup>asws</sup> wrote: ‘He should feed ten poor ones, for each poor, a handful, and he should seek Forgiveness of Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated the following: “Muhammad ibn al-Hassan once wrote to abu Muhammad, ‘Alayhi al-Salam, that a man has sworn to disown Allah and the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and he then opposed his oath and about what is his repentance and expiation. He (the Imam), ‘Alayhi al-Salam, signed the answer that said, ‘He must feed ten destitute people with one mud (a certain measurement) to each one and ask forgiveness from Allah, most Majestic, most Glorious.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/355)"
        ],
        "index": 14671,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:7:18:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) مَنْ حَلَفَ فَقَالَ لَا وَ رَبِّ الْمُصْحَفِ فَحَنِثَ فَعَلَيْهِ كَفَّارَةٌ وَاحِدَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘The one who swears, so he says, ‘No, by the Lord<sup>azwj</sup> of the Parchment’. So he reneges, so upon him is one expiation’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from his father from af-Nawfaliy from af-Sakuniy who has narrated the following: “Abu ‘Abd Allah, has said that ’Amir al-Mu’minin, Ali, ‘Alayhi al-Salam, has said, ‘If one swears saying, “No, by the Lord of the book”, then opposes it, he must pay one Kaffarah (expiation).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/355)"
        ],
        "index": 14672,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:7:18:9",
        "text": [
          "وَ بِإِسْنَادِهِ قَالَ سُئِلَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) هَلْ يُطْعَمُ الْمَسَاكِينُ فِي كَفَّارَةِ الْيَمِينِ لُحُومَ الْأَضَاحِيِّ فَقَالَ لَا لِأَنَّهُ قُرْبَانٌ لِلَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by his chain, said, ",
            "‘Amir Al-Momineen<sup>asws</sup> was asked, ‘Can one feed the poor with regards to an expiation, the flesh of the sacrifice?’ So he<sup>asws</sup> said ;’No, because it is an offering for Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "9. Through the same chain of narrators as that of the previous Hadith, the following is narrated: “’Amir al-Mu’minin, Ali, ‘Alayhi al-Salam, was asked, ‘Can the Kaffarah (expiation) because of an oath be fed to the destitute from the flesh of the offering animals for al-Hajj?’ He (the Imam) said, ‘No, because it is sacrifice for Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/355)"
        ],
        "index": 14673,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:7:18:10",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ سَهْلٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الرَّجُلُ يَكُونُ عَلَيْهِ الْيَمِينُ فَيُحْلِفُهُ غَرِيمُهُ بِالْأَيْمَانِ الْمُغَلَّظَةِ أَنْ لَا يَخْرُجَ مِنَ الْبَلَدِ إِلَّا يُعْلِمُهُ فَقَالَ لَا يَخْرُجُ حَتَّى يُعْلِمَهُ قُلْتُ إِنْ أَعْلَمَهُ لَمْ يَدَعْهُ قَالَ إِنْ كَانَ عِلْمُهُ ضَرَراً عَلَيْهِ وَ عَلَى عِيَالِهِ فَلْيَخْرُجْ وَ لَا شَيْ‏ءَ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Sahl, from Muhammad Bin Sinan, from Is’haq Bin Ammar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The man happens to have an oath upon him, so his creditor gets him to swear with the harsh oath that he cannot leave from the city except by letting him know’. So he<sup>asws</sup> said: ‘He should not go out until he lets him know’ I said, ‘If he lets him know, he would not leave him’. He<sup>asws</sup> said: ‘If his letting him know is harmful upon him and upon his family, so let him go out, and there is nothing upon him (expiation)’."
          ],
          "en.sarwar": [
            "10. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Sahl from Muhammad ibn Sinan from Ishaq ibn ‘Ammar who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who is under oath and his creditor makes him to take an oath with all seriousness not to leave the town without his knowledge. He (the Imam) said, ‘He must not leave the town without his knowledge.’ I then said that if he informs, he would not allow him to go out. He (the Imam) said, ‘If informing him is harmful to him and his family he can go out and he does not owe anything.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/356)"
        ],
        "index": 14674,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:7:18:11",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ عَلَاءٍ بَيَّاعِ السَّابِرِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ امْرَأَةٍ اسْتَوْدَعَتْ رَجُلًا مَالًا فَلَمَّا حَضَرَهَا الْمَوْتُ قَالَتْ لَهُ إِنَّ الْمَالَ الَّذِي دَفَعْتُهُ إِلَيْكَ لِفُلَانَةَ فَمَاتَتِ الْمَرْأَةُ فَأَتَى أَوْلِيَاؤُهَا الرَّجُلَ فَقَالُوا لَهُ إِنَّهُ كَانَ لِصَاحِبَتِنَا مَالٌ لَا نَرَاهُ إِلَّا عِنْدَكَ فَاحْلِفْ لَنَا مَا لَنَا قِبَلَكَ شَيْ‏ءٌ أَ يَحْلِفُ لَهُمْ قَالَ إِنْ كَانَتْ مَأْمُونَةً عِنْدَهُ فَلْيَحْلِفْ وَ إِنْ كَانَتْ مُتَّهَمَةً عِنْدَهُ فَلَا يَحْلِفُ وَ يَضَعُ الْأَمْرَ عَلَى مَا كَانَ فَإِنَّمَا لَهَا مِنْ مَالِهَا ثُلُثُهُ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Ali Bin Al Noman, from Abdullah Bin Muskan, from Ala’a Bayaa Al Sabiry who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a woman who entrusted a man with some wealth. So when the death preseted itself to her, she said to him, ‘The wealth which I had handed it over to you is for so and so woman’. So the woman died, and her guardians came over to the man so they said to him, ‘There used to be some wealth for our companion, but we do not see it except to be with you, therefore swear an oath for us that there is nothing for us with you, anything’. Should he swear for them?’ He<sup>asws</sup> said: ‘If she (the deceased) was trusted (by her guardians), so let him swear, and if she was an accused (by them) in his presence, so he should not swear, and he should place the matter upon what it used to be. But rather, for her, from her wealth, is a third’."
          ],
          "en.sarwar": [
            "11. Ahmad ibn Muhammad has narrated from al-Husayn ibn Sa‘id from Ali ibn al-Nu’man from ‘Abd Allah ibn Muskan from al-‘Ala’ Bayya’ al-Sabiriy who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a woman who leaves in trust with a man a certain amount of assets; and when the time of her death comes, she tells him that the asset she has left with him belongs to so and so female person. The woman dies and her people come to him and ask him to take an oath that she has not left anything with him. Must he take an oath in such case? He (the Imam) said, Tf he trusts her he can take an oath but if she is accused, he must not take an oath and instead leave the matter as is; only one-third belongs to her, after all.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/356)"
        ],
        "index": 14675,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:7:18:12",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ حَفْصٍ وَ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سُئِلَ عَنِ الرَّجُلِ يُقْسِمُ عَلَى أَخِيهِ قَالَ لَيْسَ عَلَيْهِ شَيْ‏ءٌ إِنَّمَا أَرَادَ إِكْرَامَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ibn Fazzal, from Hafs, and someone else from our companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘He<sup>asws</sup> was asked about the man who swore upon his brother. He<sup>asws</sup> said: ‘There is nothing upon him. But rather he intended to honour him’."
          ],
          "en.sarwar": [
            "12. Ahmad ibn Muhammad has narrated from ibn Faddal from Hafs and from more than one person of our people who has narrated the following: “Once abu ‘ Abd Allah, ‘Alayhi al-Salam, was asked about the case of a man who swears by his brother. He (the Imam) said, ‘It does not have any valid effect on him; he only wanted to honor and respect him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/356)"
        ],
        "index": 14676,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:7:18:13",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنِ الْحَلَبِيِّ قَالَ سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ وَاقَعَ امْرَأَتَهُ وَ هِيَ حَائِضٌ قَالَ إِنْ كَانَ وَاقَعَهَا فِي اسْتِقْبَالِ الدَّمِ فَلْيَسْتَغْفِرِ اللَّهَ وَ لْيَتَصَدَّقْ عَلَى سَبْعَةِ نَفَرٍ مِنَ الْمُؤْمِنِينَ بِقَدْرِ قُوتِ كُلِّ رَجُلٍ مِنْهُمْ لِيَوْمِهِ وَ لَا يَعُدْ وَ إِنْ كَانَ وَاقَعَهَا فِي إِدْبَارِ الدَّمِ فِي آخِرِ أَيَّامِهَا قَبْلَ الْغُسْلِ فَلَا شَيْ‏ءَ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ibn Mahboub, from Ibn Raib, from Al Halby who said, ",
            "‘Abu Abdullah<sup>asws</sup> was asked about a man who copulated with his wife and she was in her menstruation. He<sup>asws</sup> said: ‘If he had copulated with her during the beginning of the blood, so let him seek the Forgiveness of Allah<sup>azwj</sup>, and let him give in charity to seven persons from the Believers in a measurement of a provision for each man among them for his day, and he should not repeat. And if he had copulated with her at the declining of the blood, during the end of her (menstruating) days, before the washing, so there is nothing upon him’."
          ],
          "en.sarwar": [
            "13. Ahmad ibn Muhammad has narrated from ibn Mahbub from ibn Ri’ab from al-Halabiy who has narrated the following: “Once abu ‘Abd Allah, ‘Alayhi al-Salam, was asked about the case of a man who falls on his wife during her experiencing Hayd (menses). He (the Imam) said, Tf he has done so in the beginning of her Hayd (menses) he must ask forgiveness from Allah and give charity, to seven people of the believing ones, of one day’s meals and must not repeat. If it is in the end of her Hayd (menses) before her taking Ghusl (bath), then he does not owe anything.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/357)"
        ],
        "index": 14677,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:7:18:14",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ سُوقَةَ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَيُّ شَيْ‏ءٍ لَا نَذْرَ فِي مَعْصِيَةٍ قَالَ فَقَالَ كُلُّ مَا كَانَ لَكَ فِيهِ مَنْفَعَةٌ فِي دِينٍ أَوْ دُنْيَا فَلَا حِنْثَ عَلَيْكَ فِيهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hafs Bin Sowqat, from Ibn Bukeyr, from Zurara who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Which thing is, ‘there is not vow regarding a disobedience’?’ So he<sup>asws</sup> said: ‘Everything what was for you in which was a benefit regarding Religion or world, so there is no reneging upon you in it’."
          ],
          "en.sarwar": [
            "14. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hafs ibn Sawqah from ibn Bukayr from Zurarah who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the meaning of: ‘there is no vow and commitment in sinful matters’. He (the Imam) said, ‘Whatever is beneficial to you in the worldly matters or the hereafter, there is no violation in it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/357)"
        ],
        "index": 14678,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:7:18:15",
        "refs": {
          "Quran": [
            "/books/quran:4:92"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ وَ ابْنِ أَبِي عُمَيْرٍ جَمِيعاً عَنْ مَعْمَرِ بْنِ يَحْيَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يُظَاهِرُ مِنِ امْرَأَتِهِ يَجُوزُعِتْقُ الْمَوْلُودِ فِي الْكَفَّارَةِ فَقَالَ كُلُّ الْعِتْقِ يَجُوزُ فِيهِ الْمَوْلُودُ إِلَّا فِي كَفَّارَةِ الْقَتْلِ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ فَتَحْرِيرُ رَقَبَةٍ مُؤْمِنَةٍ يَعْنِي بِذَلِكَ مُقِرَّةً قَدْ بَلَغَتِ الْحِنْثَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr and Ibn Abu Umeyr, both together from Ma’mar Bin Yahya, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the man who did ‘<span class=\"iTxt\">Zihaar</span>’ from his wife. Is it allowed to free a new-born (slave) regarding the expiation?’ So he<sup>asws</sup> said: ‘Every emancipation is allowed in which is the new-born except regarding the expiation for the killing, for Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h92\">[4:92]</a> he should free a believing slave</span>, Meaning by that one who has accepted (Al Islam) who has reached the (age of) wrongdoing’."
          ],
          "en.sarwar": [
            "15. Ali ibn Ibrahim has narrated from his father from Ahmad ibn Muhammad from ibn abu Nasr and ibn abu ‘Umayr all from Mu’ammar ibn Yahya who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who involves himself in al- Zihar against his wife; if it is permissible to free a newborn slave for Kaffarah (expiation). He (the Imam) said, ‘Every kind of Kaffarah (expiation) that requires freeing of a slave, freeing of a newborn slave is sufficient for it except for murder; Allah, most Majestic, most Glorious, says, “. . . then set free a believing slave.” <a href=\"/#/books/quran:4#h92\">[4:92]</a> He has meant thereby one who affirms the faith and is of the age of being held responsible for violating an oath.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/358)"
        ],
        "index": 14679,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:7:18:16",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ أَحْمَدَ بْنِ الْحُسَيْنِ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ مُصَدِّقِ بْنِ صَدَقَةَ عَنْ عَمَّارٍ السَّابَاطِيِّ عَنْ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ ( عليه السلام ) فِي رَجُلٍ جَعَلَ عَلَى نَفْسِهِ عِتْقَ رَقَبَةٍ فَأَعْتَقَ أَشَلَّ [أَوْ] أَعْرَجَ قَالَ إِذَا كَانَ مِمَّا يُبَاعُ أَجْزَأَ عَنْهُ إِلَّا أَنْ يَكُونَ سَمَّى فَعَلَيْهِ مَا اشْتَرَطَ وَ سَمَّى ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Ahmad Bin Al Husayn, from Amro Bin Saeed, from Musadda Bin Sadaqa, from Ammar Al Sabity, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> from his<sup>asws</sup> father<sup>asws</sup> regarding a man who made it upon himself to the freeing of a neck, be he paralysed or lame. He<sup>asws</sup> said: ‘If he was from what is being sold, it would suffice from it, except he happened to have specified it, so upon him would be what he had stipulated and specified’."
          ],
          "en.sarwar": [
            "16. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ahmad ibn al-Husayn from ‘Amr ibn Sa‘id from Musaddiq ibn Sadaqah from ‘Ammar al-Sabatiy who has narrated the following: “About the case of a man who makes it upon himself to free a slave then sets free a paralyzed or lame one, abu ‘Abd Allah, ‘Alayhi al-Salam, has said, Tf he is sellable, it is sufficient unless he has specified, in which case he must meet the condition.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/358)"
        ],
        "index": 14680,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:7:18:17",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي رَجُلٍ حَلَفَ تَقِيَّةً قَالَ إِنْ خِفْتَ عَلَى مَالِكَ وَ دَمِكَ فَاحْلِفْ تَرُدُّهُ بِيَمِينِكَ فَإِنْ لَمْ تَرَ أَنَّ ذَلِكَ يَرُدُّ شَيْئاً فَلَا تَحْلِفْ لَهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus, from one of his companions, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) regarding a man who swears in dissimulation. He<sup>asws</sup> said: ‘If you fear upon your wealth, and your blood, so swear in order to repulse it by your oath. So if you see that, that is not repulsing anything, so do not swear for them’."
          ],
          "en.sarwar": [
            "17. Ali ibn Ibrahim has narrated from his father from ’Isma‘il ibn Marrar from Yunus from certain persons of his people who has narrated the following: “About the case of a man who swears because of taqiyah (fear), one of the two Imam, (abu Ja‘far or abu ‘Abd Allah), ‘Alayhim al-Salam, has said, Tf you fear for your belongings or life, you can swear if it can spare it; but if you see that it cannot avert anything, then do not swear.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/358)"
        ],
        "index": 14681,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:7:18:18",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الْأَصَمِّ عَنْ مِسْمَعِ بْنِ عَبْدِ الْمَلِكِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) سُئِلَ عَنْ رَجُلٍ نَذَرَ وَ لَمْ يُسَمِّ شَيْئاً قَالَ إِنْ شَاءَ صَلَّى رَكْعَتَيْنِ وَ إِنْ شَاءَ صَامَ يَوْماً وَ إِنْ شَاءَ تَصَدَّقَ بِرَغِيفٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al Hassan Bin Shamoun, from Abdullah Bin Abdul Rahman Al Asamma, from Misma’a Bin Abdul Malik, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, that Amir Al-Momineen<sup>asws</sup> was asked about a man who vowed and did not specify anything. He<sup>asws</sup> said: ‘If he so desires to, he can Pray two Cycles, and if he so desire to he can Fast for a day, and if he so desires to he can give charity with a loaf (of bread)’."
          ],
          "en.sarwar": [
            "18. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn al-Hassan Shammun from ‘ Abd Allah ibn ‘Abd al- Rahman al-Asamm from Misma‘ ibn ‘Abd al-Malik who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin, Ali, ‘Alayhi al-Salam, was asked about a man who makes a vow and commitment without specifying anything, has said, ‘If he wants he can perform two Rak‘at Salat (prayer) or fast for one day or give one loaf of bread for charity.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/358)"
        ],
        "index": 14682,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:7:18:19",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي رَجُلٍ قِيلَ لَهُ فَعَلْتَ كَذَا وَ كَذَا قَالَ لَا وَ اللَّهِ مَا فَعَلْتُهُ وَ قَدْ فَعَلَهُ فَقَالَ كَذِبَةٌ كَذَبَهَا يَسْتَغْفِرُ اللَّهَ مِنْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said regarding a man to whom it was said, ‘You did such and such’. He said, ‘No, by Allah<sup>azwj</sup>, I did not do it’, and he had done it. So he<sup>asws</sup> said: ‘A lie he has lied it. He should seek Forgiveness of Allah<sup>azwj</sup> from it’."
          ],
          "en.sarwar": [
            "19. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy from al-Sakuniy who has narrated the following: “This is about the case of a man who after being asked, ‘Did you do such and such work?’ says, ‘No, by Allah, I have not done it’ when in fact he has done it. Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ’Amz’r al-Mu’minin, Ali, ‘Alayhi al-Salam, has said, ‘It is a lie that he has spoken and he must ask Allah for forgiveness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/359)"
        ],
        "index": 14683,
        "local_index": 20,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:7:18:20",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ النَّوْفَلِيِّ عَنْ عِيسَى بْنِ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عُمَرَ بْنِ عَلِيٍّ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ كَانَتْ مِنْ أَيْمَانِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) لَا وَ أَسْتَغْفِرُ اللَّهَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Al Nowfaly, from Isa Bin Abdullah Bin Muhammad Bin Umar Bin Ali, from his father, from his grandfather who said, ",
            "‘From am oath of Rasool-Allah<sup>saww</sup> was: ‘No, and I<sup>saww</sup> seek Forgiveness of Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "20. A number of our people have narrated from Sahl ibn Ziyad from al-Nawfaliy from ‘Isa ibn ‘Abd Allah ibn Muhammad ibn ‘Umar ibn Ali from his father from his grandfather who has narrated the following: “Of the oath of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, was his saying, ‘No, and I ask Allah for forgiveness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/359)"
        ],
        "index": 14684,
        "local_index": 21,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:7:18:21",
        "refs": {
          "Quran": [
            "/books/quran:9:25"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِهِ ذَكَرَهُ قَالَ لَمَّا سُمَّ الْمُتَوَكِّلُ نَذَرَ إِنْ عُوفِيَ أَنْ يَتَصَدَّقَ بِمَالٍ كَثِيرٍ فَلَمَّا عُوفِيَ سَأَلَ الْفُقَهَاءَ عَنْ حَدِّ الْمَالِ الْكَثِيرِ فَاخْتَلَفُوا عَلَيْهِ فَقَالَ بَعْضُهُمْ مِائَةُ أَلْفٍ وَ قَالَ بَعْضُهُمْ عَشَرَةُ آلَافٍ فَقَالُوا فِيهِ أَقَاوِيلَ مُخْتَلِفَةً فَاشْتَبَهَ عَلَيْهِ الْأَمْرُ فَقَالَ رَجُلٌ مِنْ نُدَمَائِهِ يُقَالُ لَهُ صَفْعَانُ أَ لَا تَبْعَثُ إِلَى هَذَا الْأَسْوَدِ فَتَسْأَلَ عَنْهُ فَقَالَ لَهُ الْمُتَوَكِّلُ مَنْ تَعْنِي وَيْحَكَ فَقَالَ لَهُ ابْنَ الرِّضَا فَقَالَ لَهُ وَ هُوَ يُحْسِنُ مِنْ هَذَا شَيْئاً فَقَالَ إِنْ أَخْرَجَكَ مِنْ هَذَا فَلِي عَلَيْكَ كَذَا وَ كَذَا وَ إِلَّا فَاضْرِبْنِي مِائَةَ مِقْرَعَةٍ ",
          "فَقَالَ الْمُتَوَكِّلُ قَدْ رَضِيتُ يَا جَعْفَرَ بْنَ مَحْمُودٍ صِرْ إِلَيْهِ وَ سَلْهُ عَنْ حَدِّ الْمَالِ الْكَثِيرِ فَصَارَ جَعْفَرُ بْنُ مَحْمُودٍ إِلَى أَبِي الْحَسَنِ عَلِيِّ بْنِ مُحَمَّدٍ ( عليه السلام ) فَسَأَلَهُ عَنْ حَدِّ الْمَالِ الْكَثِيرِ فَقَالَ الْكَثِيرُ ثَمَانُونَ فَقَالَ لَهُ جَعْفَرٌ يَا سَيِّدِي إِنَّهُ يَسْأَلُنِي عَنِ الْعِلَّةِ فِيهِ فَقَالَ لَهُ أَبُو الْحَسَنِ ( عليه السلام ) إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ لَقَدْ نَصَرَكُمُ اللَّهُ فِي مَواطِنَ كَثِيرَةٍ فَعَدَدْنَا تِلْكَ الْمَوَاطِنَ فَكَانَتْ ثَمَانِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from one of his companions mentioning it, said, ",
            "‘When Al-Mutawakkil specified a vow that if it is fulfilled, he would give a lot of wealth in charity, it was fulfilled, so he asked the jurists about a limit of the ‘lot of wealth’. So they differed over it. Some of them said, ‘One hundred thousand’, and some of them said, ‘ten thousand’. Thus they said differing statements over it confusing the matter. So a man from his barmen called Saf’an said, ‘Why don’t you send (someone) to this blackie to ask from him?’ So Mutawakkil said to him, ‘Whom do you mean, woe be unto you!’ So he said to him, ‘Son<sup>asws</sup> of Al-Reza<sup>asws</sup>’. So he said to him, ‘And he<sup>asws</sup> is better than this thing?’ So he said, ‘If he takes you out from this, so for me upon you would be such and such, or else you can whip me one hundred lashes’. ",
            "So Al-Mutawakkil said, ‘I am pleased. O Ja’far Bin Mahmoud, go to him<sup>asws</sup> and ask him<sup>asws</sup> about a limit of the ‘lot of wealth’’. So Ja’far Bin Mahmoud went to Abu Al-Hassan Ali<sup>asws</sup> Bin Muhammad<sup>asws</sup>, so he asked him<sup>asws</sup> about a limit of the ‘lot of wealth’. So he<sup>asws</sup> said: ‘(The term) ‘a lot’ is eighty’. So Ja’far said to him<sup>asws</sup>, ‘O my master! He would be asking me about the reason with regards to it’. So Abu ",
            "Al-Hassan<sup>asws</sup> said to him: ‘Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:9#h25\">[9:25]</a> Certainly, Allah helped you in a lot of places</span> – so the number of these places were eight’."
          ],
          "en.sarwar": [
            "21. Ali ibn Ibrahim has narrated from his father from certain persons of his people whom he has mentioned who has narrated the following: “Al-Mutawakkil specified a vow and commitment that if he recovers he will give in charity kathir (a great deal of) assets. When he recovered, he asked the scholars of law about the limit of kathir (great deal) but they had different opinions. Certain ones among them said that it is a hundred thousand; others said that it is ten thousand, and they cited different things as proof in the matter. It all became confusing for him. One of his officers called Saf‘an said, ‘Why do you not send this black to ask him about it?’ Al-Mutawakkal asked, ‘Who do you mean thereby? Woe upon you!’ He replied, ‘I mean ibn al-Rida’.’ He asked, ‘Is he good in it?’ He (the officer) replied, ‘If he takes you out of this, you then must pay me so and so much; or you can whip me one hundred times.’ Al-Mutawakkal said, ‘I agree. O Ja‘far ibn Mahmud, go to him and ask him about the limit of kathir (a great deal of asset).’ Ja‘far ibn Mahmud went to abu al-Hassan, Ali ibn Muhammad, ‘Alayhim al-Salam, and asked him about the limit of al-Kathir (great deal of assets). He (the Imam) said, ‘It is eighty.’ Ja‘far asked, ‘O my master, he will ask me for a reason.’ Abu al-Hassan, ‘Alayhi al-Salam, said, ‘Allah, most Majestic, most Glorious, says, ‘We have helped you in Mawatin al-Kathirah (in a great many places)’ and we counted them, they were eighty such places.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:7:18",
  "kind": "verse_list"
}