{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 7"
        },
        "path": "/books/al-kafi:7:7",
        "titles": {
          "ar": "كِتَابُ الْأَيْمَانِ وَ النُّذُورِ وَ الْكَفَّارَاتِ",
          "en": "THE BOOK OF OATHS, AND THE VOWS, AND THE EXPIATIONS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 6"
        },
        "path": "/books/al-kafi:7:7:6",
        "titles": {
          "ar": "باب وُجُوهِ الْأَيْمَانِ",
          "en": "Chapter 6 – Aspects of the oaths"
        }
      }
    ],
    "index": 2259,
    "local_index": 6,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 7"
        },
        "path": "/books/al-kafi:7:7:7",
        "titles": {
          "ar": "باب مَا لَا يَلْزَمُ مِنَ الْأَيْمَانِ وَ النُّذُورِ",
          "en": "Chapter 7 – What does not necessitate, from the oaths and the vows"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 5"
        },
        "path": "/books/al-kafi:7:7:5",
        "titles": {
          "ar": "باب كَرَاهِيَةِ الْيَمِينِ بِالْبَرَاءَةِ مِنَ اللَّهِ وَ رَسُولِهِ ( صلى الله عليه وآله )",
          "en": "Chapter 5 – Abhorrence for (swearing of) the oath with the disavowing from Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 7"
        },
        "path": "/books/al-kafi:7:7",
        "titles": {
          "ar": "كِتَابُ الْأَيْمَانِ وَ النُّذُورِ وَ الْكَفَّارَاتِ",
          "en": "THE BOOK OF OATHS, AND THE VOWS, AND THE EXPIATIONS"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:7:6",
    "titles": {
      "ar": "باب وُجُوهِ الْأَيْمَانِ",
      "en": "Chapter 6 – Aspects of the oaths"
    },
    "verse_count": 1,
    "verse_start_index": 14564,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/314)"
        ],
        "index": 14565,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/45",
              "text": "عَلِيِّ بْنِ حَدِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/18",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:7:6:1",
        "text": [
          " الْأَيْمَانُ ثَلَاثٌ يَمِينٌ لَيْسَ فِيهَا كَفَّارَةٌ وَ يَمِينٌ فِيهَا كَفَّارَةٌ وَ يَمِينٌ غَمُوسٌ تُوجِبُ النَّارَ فَالْيَمِينُ الَّتِي لَيْسَ فِيهَا كَفَّارَةٌ الرَّجُلُ يَحْلِفُ بِاللَّهِ عَلَى بَابِ بِرٍّ أَنْ لَا يَفْعَلَهُ فَكَفَّارَتُهُ أَنْ يَفْعَلَهُ وَ الْيَمِينُ الَّتِي تَجِبُ فِيهَا الْكَفَّارَةُ الرَّجُلُ يَحْلِفُ عَلَى بَابِ مَعْصِيَةٍ أَنْ لَا يَفْعَلَهُ فَيَفْعَلُهُ فَتَجِبُ عَلَيْهِ الْكَفَّارَةُ وَ الْيَمِينُ الْغَمُوسُ الَّتِي تُوجِبُ النَّارَ الرَّجُلُ يَحْلِفُ عَلَى حَقِّ امْرِئٍ مُسْلِمٍ عَلَى حَبْسِ مَالِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Hadeed, from one of our companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The oaths are three – and oath for which there is no expiation in it, and an oath in which there is an expiation, and a calamitous (false) oath Obligating the Fire. So the oath in which there is no expiation, is the man swearing by Allah<sup>azwj</sup> upon the door of righteousness that he did not do it. So his expiation is that he does it; and the oath in which the expiation is Obligated, is the man swearing upon the door of disobedience that he did not do it. So the expiation is Obligated upon him; and the calamitous (false) oath which Obligates the Fire, is the man swearing upon a right of a Muslim person, to withhold his wealth’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn Hadid from certain persons of our people who have narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Swearing is of three kinds. There is one kind of swearing, which does not require expiation, the kind that requires expiation, and the false swearing which causes the fire. The kind, which does not require expiation, is the swearing in which one has sworn by Allah for a good cause not to do it and its expiation is doing such thing. The kind of oath, which requires expiation, is that which a man takes for not to do a sinful deed but he does it, then expiation becomes obligatory. Al-Ghumus oath is that which causes the fire and is that in which a man swears against the right of a Muslim man to withhold his assets.”’ Ali ibn Ibrahim has said the following: “He (the Imam), ‘Alayhi al-Salam, has said that swearing is of three kinds. There is the kind of swearing because of which fire becomes obligatory, the oath, which makes expiation obligatory, and the kind, which does not make the fire or expiation obligatory. The kind of swearing which makes the fire obligatory is the swearing of a man who swears and denies the assets of another. In this way, he takes it away from him or swears against a Muslim man falsely to tangle him or seek the support of Sultan and so on against him in which he succeeds and causes the loss of his life or his assets. For this kind, fire becomes obligatory. The oath because of which expiation becomes obligatory is that which a man takes about a lawful act in the sight of Allah to do it or swears to do something, which is not lawful not to do it, then he repents, in such case expiation becomes obligatory. The kind of oath, which does not require expiation, is that which one takes to cut off good relations with relatives or the Sultan forces him or against his wishes his father or his wife urges him. He swears for an act which is in disobedience to Allah, he swears to do so although he commits a sin, but there is not any expiation on him.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:7:6",
  "kind": "verse_list"
}