{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:2:3",
        "titles": {
          "ar": "كِتَابُ فَضْلِ الْقُرْآنِ",
          "en": "THE BOOK OF MERITS OF THE QURAN"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 1"
        },
        "path": "/books/al-kafi:2:3:1",
        "titles": {
          "en": "Chapter 1 – A Chapter"
        }
      }
    ],
    "index": 458,
    "local_index": 1,
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:3:1",
    "titles": {
      "en": "Chapter 1 – A Chapter"
    },
    "verse_count": 14,
    "verse_start_index": 3459,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول أو ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/474)"
        ],
        "index": 3460,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:1:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ مُحَمَّدٍ</span> عَنْ عَلِيِّ بْنِ الْعَبَّاسِ عَنِ الْحُسَيْنِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ سُفْيَانَ الْحَرِيرِيِّ عَنْ أَبِيهِ عَنْ سَعْدٍ الْخَفَّافِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ يَا سَعْدُ تَعَلَّمُوا الْقُرْآنَ فَإِنَّ الْقُرْآنَ يَأْتِي يَوْمَ الْقِيَامَةِ فِي أَحْسَنِ صُورَةٍ نَظَرَ إِلَيْهَا الْخَلْقُ وَ النَّاسُ صُفُوفٌ عِشْرُونَ وَ مِائَةُ أَلْفِ صَفٍّ ثَمَانُونَ أَلْفَ صَفٍّ أُمَّةُ مُحَمَّدٍ وَ أَرْبَعُونَ أَلْفَ صَفٍّ مِنْ سَائِرِ الْأُمَمِ",
          "فَيَأْتِي عَلَى صَفِّ الْمُسْلِمِينَ فِي صُورَةِ رَجُلٍ فَيُسَلِّمُ فَيَنْظُرُونَ إِلَيْهِ ثُمَّ يَقُولُونَ لَا إِلَهَ إِلَّا اللَّهُ الْحَلِيمُ الْكَرِيمُ إِنَّ هَذَا الرَّجُلَ مِنَ الْمُسْلِمِينَ نَعْرِفُهُ بِنَعْتِهِ وَ صِفَتِهِ غَيْرَ أَنَّهُ كَانَ أَشَدَّ اجْتِهَاداً مِنَّا فِي الْقُرْآنِ فَمِنْ هُنَاكَ أُعْطِيَ مِنَ الْبَهَاءِ وَ الْجَمَالِ وَ النُّورِ مَا لَمْ نُعْطَهُ ",
          "ثُمَّ يُجَاوِزُ حَتَّى يَأْتِيَ عَلَى صَفِّ الشُّهَدَاءِ فَيَنْظُرُونَ إِلَيْهِ الشُّهَدَاءُ ثُمَّ يَقُولُونَ لَا إِلَهَ إِلَّا اللَّهُ الرَّبُّ الرَّحِيمُ إِنَّ هَذَا الرَّجُلَ مِنَ الشُّهَدَاءِ نَعْرِفُهُ بِسَمْتِهِ وَ صِفَتِهِ غَيْرَ أَنَّهُ مِنْ شُهَدَاءِ الْبَحْرِ فَمِنْ هُنَاكَ أُعْطِيَ مِنَ الْبَهَاءِ وَ الْفَضْلِ مَا لَمْ نُعْطَهُ",
          "قَالَ فَيَتَجَاوَزُ حَتَّى يَأْتِيَ عَلَى صَفِّ شُهَدَاءِ الْبَحْرِ فِي صُورَةِ شَهِيدٍ فَيَنْظُرُ إِلَيْهِ شُهَدَاءُ الْبَحْرِ فَيَكْثُرُ تَعَجُّبُهُمْ وَ يَقُولُونَ إِنَّ هَذَا مِنْ شُهَدَاءِ الْبَحْرِ نَعْرِفُهُ بِسَمْتِهِ وَ صِفَتِهِ غَيْرَ أَنَّ الْجَزِيرَةَ الَّتِي أُصِيبَ فِيهَا كَانَتْ أَعْظَمَ هَوْلًا مِنَ الْجَزِيرَةِ الَّتِي أُصِبْنَا فِيهَا فَمِنْ هُنَاكَ أُعْطِيَ مِنَ الْبَهَاءِ وَ الْجَمَالِ وَ النُّورِ مَا لَمْ نُعْطَهُ",
          "ثُمَّ يُجَاوِزُ حَتَّى يَأْتِيَ صَفَّ النَّبِيِّينَ وَ الْمُرْسَلِينَ فِي صُورَةِ نَبِيٍّ مُرْسَلٍ فَيَنْظُرُ النَّبِيُّونَ وَ الْمُرْسَلُونَ إِلَيْهِ فَيَشْتَدُّ لِذَلِكَ تَعَجُّبُهُمْ وَ يَقُولُونَ لَا إِلَهَ إِلَّا اللَّهُ الْحَلِيمُ الْكَرِيمُ إِنَّ هَذَا النَّبِيَّ مُرْسَلٌ نَعْرِفُهُ بِسَمْتِهِ وَ صِفَتِهِ غَيْرَ أَنَّهُ أُعْطِيَ فَضْلًا كَثِيراً",
          "قَالَ فَيَجْتَمِعُونَ فَيَأْتُونَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَيَسْأَلُونَهُ وَ يَقُولُونَ يَا مُحَمَّدُ مَنْ هَذَا فَيَقُولُ لَهُمْ أَ وَ مَا تَعْرِفُونَهُ فَيَقُولُونَ مَا نَعْرِفُهُ هَذَا مِمَّنْ لَمْ يَغْضَبِ اللَّهُ عَلَيْهِ فَيَقُولُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) هَذَا حُجَّةُ اللَّهِ عَلَى خَلْقِهِ فَيُسَلِّمُ",
          "ثُمَّ يُجَاوِزُ حَتَّى يَأْتِيَ عَلَى صَفِّ الْمَلَائِكَةِ فِي سُورَةِ مَلَكٍ مُقَرَّبٍ فَتَنْظُرُ إِلَيْهِ الْمَلَائِكَةُ فَيَشْتَدُّ تَعَجُّبُهُمْ وَ يَكْبُرُ ذَلِكَ عَلَيْهِمْ لِمَا رَأَوْا مِنْ فَضْلِهِ وَ يَقُولُونَ تَعَالَى رَبُّنَا وَ تَقَدَّسَ إِنَّ هَذَا الْعَبْدَ مِنَ الْمَلَائِكَةِ نَعْرِفُهُ بِسَمْتِهِ وَ صِفَتِهِ غَيْرَ أَنَّهُ كَانَ أَقْرَبَ الْمَلَائِكَةِ إِلَى اللَّهِ عَزَّ وَ جَلَّ مَقَاماً فَمِنْ هُنَاكَ أُلْبِسَ مِنَ النُّورِ وَ الْجَمَالِ مَا لَمْ نُلْبَسْ ",
          "ثُمَّ يُجَاوِزُ حَتَّى يَنْتَهِيَ إِلَى رَبِّ الْعِزَّةِ تَبَارَكَ وَ تَعَالَى فَيَخِرُّ تَحْتَ الْعَرْشِ فَيُنَادِيهِ تَبَارَكَ وَ تَعَالَى يَا حُجَّتِي فِي الْأَرْضِ وَ كَلَامِيَ الصَّادِقَ النَّاطِقَ ارْفَعْ رَأْسَكَ وَ سَلْ تُعْطَ وَ اشْفَعْ تُشَفَّعْ ",
          "فَيَرْفَعُ رَأْسَهُ فَيَقُولُ اللَّهُ تَبَارَكَ وَ تَعَالَى كَيْفَ رَأَيْتَ عِبَادِي فَيَقُولُ يَا رَبِّ مِنْهُمْ مَنْ صَانَنِي وَ حَافَظَ عَلَيَّ وَ لَمْ يُضَيِّعْ شَيْئاً وَ مِنْهُمْ مَنْ ضَيَّعَنِي وَ اسْتَخَفَّ بِحَقِّي وَ كَذَّبَ بِي وَ أَنَا حُجَّتُكَ عَلَى جَمِيعِ خَلْقِكَ ",
          "فَيَقُولُ اللَّهُ تَبَارَكَ وَ تَعَالَى وَ عِزَّتِي وَ جَلَالِي وَ ارْتِفَاعِ مَكَانِي لَأُثِيبَنَّ عَلَيْكَ الْيَوْمَ أَحْسَنَ الثَّوَابِ وَ لَأُعَاقِبَنَّ عَلَيْكَ الْيَوْمَ أَلِيمَ الْعِقَابِ ",
          "قَالَ فَيَرْجِعُ الْقُرْآنُ رَأْسَهُ فِي صُورَةٍ أُخْرَى قَالَ فَقُلْتُ لَهُ يَا أَبَا جَعْفَرٍ فِي أَيِّ صُورَةٍ يَرْجِعُ قَالَ فِي صُورَةِ رَجُلٍ شَاحِبٍ مُتَغَيِّرٍ يُبْصِرُهُ أَهْلُ الْجَمْعِ فَيَأْتِي الرَّجُلَ مِنْ شِيعَتِنَا الَّذِي كَانَ يَعْرِفُهُ وَ يُجَادِلُ بِهِ أَهْلَ الْخِلَافِ فَيَقُومُ بَيْنَ يَدَيْهِ فَيَقُولُ مَا تَعْرِفُنِي فَيَنْظُرُ إِلَيْهِ الرَّجُلُ فَيَقُولُ مَا أَعْرِفُكَ يَا عَبْدَ اللَّهِ ",
          "قَالَ فَيَرْجِعُ فِي صُورَتِهِ الَّتِي كَانَتْ فِي الْخَلْقِ الْأَوَّلِ وَ يَقُولُ مَا تَعْرِفُنِي فَيَقُولُ نَعَمْ فَيَقُولُ الْقُرْآنُ أَنَا الَّذِي أَسْهَرْتُ لَيْلَكَ وَ أَنْصَبْتُ عَيْشَكَ سَمِعْتَ الْأَذَى وَ رُجِمْتَ بِالْقَوْلِ فِيَّ أَلَا وَ إِنَّ كُلَّ تَاجِرٍ قَدِ اسْتَوْفَى تِجَارَتَهُ وَ أَنَا وَرَاءَكَ الْيَوْمَ ",
          "قَالَ فَيَنْطَلِقُ بِهِ إِلَى رَبِّ الْعِزَّةِ تَبَارَكَ وَ تَعَالَى فَيَقُولُ يَا رَبِّ يَا رَبِّ عَبْدُكَ وَ أَنْتَ أَعْلَمُ بِهِ قَدْ كَانَ نَصِباً فِيَّ مُوَاظِباً عَلَيَّ يُعَادَى بِسَبَبِي وَ يُحِبُّ فِيَّ وَ يُبْغِضُ فَيَقُولُ اللَّهُ عَزَّ وَ جَلَّ أَدْخِلُوا عَبْدِي جَنَّتِي وَ اكْسُوهُ حُلَّةً مِنْ حُلَلِ الْجَنَّةَ وَ تَوِّجُوهُ بِتَاجٍ",
          "فَإِذَا فُعِلَ بِهِ ذَلِكَ عُرِضَ عَلَى الْقُرْآنِ فَيُقَالُ لَهُ هَلْ رَضِيتَ بِمَا صُنِعَ بِوَلِيِّكَ فَيَقُولُ يَا رَبِّ إِنِّي أَسْتَقِلُّ هَذَا لَهُ فَزِدْهُ مَزِيدَ الْخَيْرِ كُلِّهِ فَيَقُولُ وَ عِزَّتِي وَ جَلَالِي وَ عُلُوِّي وَ ارْتِفَاعِ مَكَانِي لَأَنْحَلَنَّ لَهُ الْيَوْمَ خَمْسَةَ أَشْيَاءَ مَعَ الْمَزِيدِ لَهُ وَ لِمَنْ كَانَ بِمَنْزِلَتِهِ أَلَا إِنَّهُمْ شَبَابٌ لَا يَهْرَمُونَ وَ أَصِحَّاءُ لَا يَسْقُمُونَ وَ أَغْنِيَاءُ لَا يَفْتَقِرُونَ وَ فَرِحُونَ لَا يَحْزَنُونَ وَ أَحْيَاءٌ لَا يَمُوتُونَ ",
          "ثُمَّ تَلَا هَذِهِ الْآيَةَ لا يَذُوقُونَ فِيهَا الْمَوْتَ إِلَّا الْمَوْتَةَ الْأُولى قَالَ قُلْتُ جُعِلْتُ فِدَاكَ يَا أَبَا جَعْفَرٍ وَ هَلْ يَتَكَلَّمُ الْقُرْآنُ فَتَبَسَّمَ ثُمَّ قَالَ رَحِمَ اللَّهُ الضُّعَفَاءَ مِنْ شِيعَتِنَا إِنَّهُمْ أَهْلُ تَسْلِيمٍ ثُمَّ قَالَ نَعَمْ يَا سَعْدُ وَ الصَّلَاةُ تَتَكَلَّمُ وَ لَهَا صُورَةٌ وَ خَلْقٌ تَأْمُرُ وَ تَنْهَى ",
          "قَالَ سَعْدٌ فَتَغَيَّرَ لِذَلِكَ لَوْنِي وَ قُلْتُ هَذَا شَيْ‏ءٌ لَا أَسْتَطِيعُ أَنَا أَتَكَلَّمُ بِهِ فِي النَّاسِ فَقَالَ أَبُو جَعْفَرٍ وَ هَلِ النَّاسُ إِلَّا شِيعَتُنَا فَمَنْ لَمْ يَعْرِفِ الصَّلَاةَ فَقَدْ أَنْكَرَ حَقَّنَا",
          "ثُمَّ قَالَ يَا سَعْدُ أُسْمِعُكَ كَلَامَ الْقُرْآنِ قَالَ سَعْدٌ فَقُلْتُ بَلَى صَلَّى اللَّهُ عَلَيْكَ فَقَالَ .",
          "إِنَّ الصَّلاةَ تَنْهى عَنِ الْفَحْشاءِ وَ الْمُنْكَرِ وَ لَذِكْرُ اللَّهِ أَكْبَرُ ",
          "فَالنَّهْيُ كَلَامٌ وَ الْفَحْشَاءُ وَ الْمُنْكَرُ رِجَالٌ وَ نَحْنُ ذِكْرُ اللَّهِ وَ نَحْنُ أَكْبَرُ"
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Ali Bin Al Abbas, from Al Husayn Bin Abdul Rahman, from Sufyan Al Hareyri, from his father, from Sa’ad Al Khaffaf, ",
            "(It has been narrated) from Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> having said: ‘O Sa’ad! Learn the Quran, for the Quran would come on the Day of Judgment in an excellent image. The creatures would look at it, and the people would be in one hundred and twenty thousand rows – eighty thousand rows being the community of Muhammad<sup style=\"font-weight: normal\">saww</sup>, and forty thousand rows from the rest of the communities. ",
            "So it would come to the rows of the Muslims in an image of a man, and it would greet. So they would be looking at him, then they would be saying, ‘There is no god except Allah<sup style=\"font-weight: normal\">azwj</sup>, the Forbearing, the Benevolent. This man is from the Muslims. We recognise him by his appearance and his description, apart from that he was of a more intense striving than us in the Quran, so from over there he has been Given from the splendour, and the beauty, and the radiance what we have not been Given’.",
            "Then he would cross over until he comes to the rows of the martyrs. So the martyrs would be looking at him, then they would be saying, ‘There is no god except Allah<sup style=\"font-weight: normal\">azwj</sup>, the Lord<sup style=\"font-weight: normal\">azwj</sup>, the Merciful. This man is from the martyrs. We recognise him by his appearance and his qualities, apart from that he is from the martyrs of the sea, for from over there he has been Given from the splendour and the superiority what he was not been Given’. ",
            "He<sup style=\"font-weight: normal\">asws</sup> said: ‘So he would cross over until he comes to the rows of the martyrs of the sea in an image of a martyr. So the martyrs of the sea would look at him and would frequent in wonderment, and they would be saying, ‘This one is from the martyrs of the sea. We recognise him by his appearance and his qualities, apart from that the island in which he was hit would have been of a more grievous terror than the island in which we were hit. So from over there, he was Given from the splendour, and the beauty, and the radiance what we have not been Given’. ",
            "Then he would cross over until he comes to the rows of the Prophets<sup style=\"font-weight: normal\">as</sup> and the <span class=\"iTxt\">Mursil</span> Prophets<sup style=\"font-weight: normal\">as</sup> in an image of a <span class=\"iTxt\">Mursil</span> Prophet<sup style=\"font-weight: normal\">as</sup>. So the Prophets<sup style=\"font-weight: normal\">as</sup> and the <span class=\"iTxt\">Mursil</span> Prophets<sup style=\"font-weight: normal\">as</sup> would be looking at him, and their<sup style=\"font-weight: normal\">as</sup> wonderment would intensify due to that, and they would be saying: ‘There is no god except Allah<sup style=\"font-weight: normal\">azwj</sup>, the Forbearing, the Benevolent. This is a <span class=\"iTxt\">Mursil</span> Prophet. We recognise him by his appearance and his qualities, apart from that he has been Given a lot of merits’. ",
            "So they<sup style=\"font-weight: normal\">as</sup> would be gathering together, and they<sup style=\"font-weight: normal\">as</sup> would be coming to Rasool-Allah<sup style=\"font-weight: normal\">saww</sup>, and they<sup style=\"font-weight: normal\">as</sup> would be asking him<sup style=\"font-weight: normal\">saww</sup>: ‘O Muhammad<sup style=\"font-weight: normal\">saww</sup>! Who is this?’ So he<sup style=\"font-weight: normal\">saww</sup> would be saying to them: ‘Or are you<sup style=\"font-weight: normal\">as</sup> all not recognising him?’ So they<sup style=\"font-weight: normal\">as</sup> would be saying: ‘We<sup style=\"font-weight: normal\">as</sup> do not recognise him. This is from the one whom Allah<sup style=\"font-weight: normal\">azwj</sup> is not Angered upon’. So Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> would be saying: ‘This is a Proof of Allah<sup style=\"font-weight: normal\">azwj</sup> upon His<sup style=\"font-weight: normal\">azwj</sup> creatures, so greet him’. ",
            "Then he would cross over until he comes to the rows of the Angels in an image of an Angel of Proximity. So the Angels would look at him and their wonderment would intensify, and that would be a great thing upon them due to what they see from his merits, and they would be saying: ‘Exalted is our Lord<sup>azwj</sup> and Holy! This is the servant from the Angels. We recognise him by his appearance and his qualities, apart from that he was the closest of the Angels to Allah<sup>azwj</sup> Mighty and Majestic in status, so from over there he was Clothed from the radiance and the beauty what we have not been Clothed in’. ",
            "Then he would cross over until he ends up to the Lord<sup>azwj</sup> of the Might, the Blessed and Exalted. So he would prostrate beneath the Throne. So the Blessed and High would Call out to him: “O My<sup>azwj</sup> Proof in the earth, and My<sup>azwj</sup> Truthful Speech, the Speaker! Raise your head and ask, you will be Given, and interceded, your intercession will be Accepted!” ",
            "So he would raise his head, and Allah<sup>azwj</sup> Blessed and High would be saying: “How did you see My<sup>azwj</sup> servants to be?” So he would be saying: ‘O Lord<sup>azwj</sup>! From them were the ones who safeguarded me and memorised me, and did not waste anything; and from them were the one who wasted me and took lightly with my rights, and belief with me, and I am Your<sup>azwj</sup> Proof upon the entirety of Your<sup>azwj</sup> creatures’. ",
            "So Allah<sup>azwj</sup> Blessed and High would be Saying: “By My<sup>azwj</sup> Might and the Loftiness of My<sup>azwj</sup> Position! Today I<sup>azwj</sup> shall be Rewarding with the most excellent of Rewards based upon you, and today I<sup>azwj</sup> shall be Punishing with the most painful of the Punishments based upon you”. ",
            "He<sup>asws</sup> said: ‘So the Quran would be returning its head to be in another image’. I said to him<sup>asws</sup>, ‘O Abu Ja’far<sup>asws</sup>! In which image would it return to be?’ He<sup>asws</sup> said: ‘In a changed image of a pale man. The people gathered would look at him, and he would go over to a man from our Shias whom he would recognise the one who used to argue by him against the adversaries. So he would pause in front of him and he would be saying: ‘Do you not recognise me?’ So the man would look at him and he would be saying, ‘I do not recognise you, O servant of Allah<sup>azwj</sup>!’ ",
            "He<sup>asws</sup> said: ‘So it would return to be in its image which it used to be among the former creatures, and it would be saying: ‘Do you not recognise me (even now)?’ So he would be saying, ‘Yes (I do now)’. So the Quran would be saying: ‘I am that which you held a vigil with for your nights, and your life was concentrated upon listening to the hurtful things and you were pelted with the words regarding me. Indeed! And every trader would be fulfilled his trade, and I would be your backer today’. ",
            "He<sup>asws</sup> said: ‘So it would go with him to the Lord<sup>azwj</sup> of Might, the Blessed and Exalted, and it would be saying: ‘O Lord<sup>azwj</sup>! O Lord<sup>azwj</sup>! Your<sup>azwj</sup> servant, and You<sup>azwj</sup> are more Knowing with him, he was hard-working regarding me, and had established animosity due to my reason, and he was loving and hating regarding me. So Allah<sup>azwj</sup> Mighty and Majestic would be Saying: “Enter My<sup>azwj</sup> servant into My<sup>azwj</sup> Paradise, and Clothe him with garments and ornaments of the Paradise, and crown him with a crown’. ",
            "So when that would be done with him, he would be displayed to the Quran, so He<sup>azwj</sup> would be Saying to it: ‘Are you pleased with what I<sup>azwj</sup> have done with your friend?’ So it would be saying: ‘O Lord<sup>azwj</sup>! I consider this to be little for him, therefore Increase it more with the goodness, all of it’. So He<sup>azwj</sup> would be Saying: “By My<sup>azwj</sup> Might and My<sup>azwj</sup> Majesty and My<sup>azwj</sup> Exaltedness and the Loftiness of My<sup>azwj</sup> Position! I<sup>azwj</sup> shall Permit five things to be for him, along with the increase for him and for the ones who were at his status. Indeed! He shall be a youth and would not be growing old, and he shall be healthy and would not be getting any sickness, and he shall be rich and would not be impoverished, and he shall be happy and would not be grieving, and he shall live and would not be dying”.",
            "Then the Imam<sup>asws</sup> recited this Verse <span class=\"ibTxt\">[44:56] They shall not taste therein death except for the first death</span>. I said, ‘May I be sacrificed for you<sup>asws</sup>, O Abu Ja’far<sup>asws</sup>! And would the Quran be speaking?’ So he<sup>asws</sup> smiled, then said: ‘May Allah<sup>azwj</sup> be Merciful upon the weak ones (of understanding) from our<sup>asws</sup> Shias. They are people of the submission’. Then he<sup>asws</sup> said: ‘Yes, O Sa’ad! And the <span class=\"iTxt\">Salāt</span> would (also) be speaking, and for it there would be an image, and a shape. It would enjoin and forbid’. ",
            "Sa’ad said, ‘So my colour changed due to that, and I said, ‘This is something I do not have the capacity to speak with among the people’. So Abu Ja’far<sup>asws</sup> said: ‘And are the people except for our<sup>asws</sup> Shias? So the one who does not recognise the <span class=\"iTxt\">Salāt</span>, so he has denied our<sup>asws</sup> rights’. ",
            "Then he<sup>asws</sup> said: ‘O Sa’ad! Shall I<sup>asws</sup> make you hear the speech of the Quran?’ So I said, ‘Yes, O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>!’ So he<sup>asws</sup> said: ",
            "‘<span class=\"ibTxt\">[29:45] surely, Salāt prevents from the immoralities and evil, and the Remembrance of Allah is the greatest</span>. ",
            "So the prevention is a speech, and the immoralities and the evil are (two) men, and we<sup>asws</sup> are the Remembrance of Allah<sup>azwj</sup>, and we<sup>asws</sup> are the greatest’."
          ],
          "en.sarwar": [
            "1. Ali ibn Muhammad has narrated from al-‘Abbas from h n Fadl ibn Shadhan ‘Abd al-Rahman from Sufyan al-Hariri from his father from Sa’d al-Khaffaf from abu Ja’far (a.s.) who has said the following: “O Sa’d, learn the Holy Quran; on the Day of Judgment the Holy Quran will come in the best form that people may have ever seen. People will be present in one hundred thousand and twenty rows: the followers of Prophet Muhammad will form eighty thousand rows. The other forty thousand rows will consist of the followers of the other prophets. The Holy Quran will come to the rows of the Muslims in the form of a well-shaped man, offer them the greeting of peace and they look to him and say to each other, ‘No one deserves to be worshipped except Allah, the forbearing the magnanimous, this man is one of the Muslims whom we know from his picture and qualities, however, he has been striving about the Holy Quran much harder than we, thus, he has been given this beauty, grace and light which we have not received. “He (the Quran in the form of a person) passes toward the row of the martyrs who look at him and say, ‘No one deserves to be worshipped except Allah, the Lord, the Merciful. We know from the signs and qualities he is a martyr, however, he has been of the martyrs at sea, thus, he has received this beauty and grace that is not given to us.’ The Imam said, ‘Then it will pass toward the martyr at sea and the martyrs at sea look at him with astonishment and say, “He is of the martyrs at sea; we know him from his signs and qualities, however, on the island where he suffered must have been much more dangerous than the island where we suffered, thus, he has received this beauty, grace and light.’ “Then he approaches the rows of the prophets and messengers in the form of a messenger prophet. The prophets and messengers look at him and their astonishment increase. They will say, ‘No one deserves to be worshipped except Allah, the Most Forbearing, the Magnanimous, this is a messenger prophet; we know him from his picture and qualities, however, he has been much more virtuous.’ The Imam said, ‘They will come to the Messenger of Allah and ask him, “O Muhammad, who is this?” He then will ask, ‘Do you not know him?’ They will say, ‘We do not know him, however, Allah has not been angry with him.’ The Messenger of Allah will say to them, ‘This is the authority of Allah over His creatures. He offers them greeting of peace and passes thereby to the rows of the angels in the form of a special angel. The angels will look at him and their astonishment increases, his status will seem very great to them. They will say our Lord is Most High, Most Holy. This servant is of the angels. We know him from his picture and qualities, however, he has been more close and special to Allah, the Most Majestic, the Most Holy, thus, he is dressed up with this much light and beauty that we have not received.’ Then he will come before Allah, the Most Majestic, the Most Blessed, the Most High, and will bow down below the Throne. “Allah, the Most Blessed, the Most High, will speak to the Holy Quran saying, ‘My true spoken words and authority on earth, look up and ask for your wishes. Your wishes shall be granted and your intercession shall be accepted. How did you find my servants?’ “The Holy Quran will then say, ‘My Lord, certain ones among them kept me safely protected and did not lose anything from me but others among them lost me and disrespected me and called me lies even though I was Your authority to all of Your creatures.’ Allah, the Most Majestic, the Most Holy, then will say, ‘I swear by My Majesty, Greatness and Highness that I shall give the best reward on this day because of you and shall punish severely because of you.’ “The Imam then continued saying, ‘The Holy Quran will raise his head in another shape.’ I (the narrator) asked the Imam, ‘O abu Ja’far in what shape it will return?’ The Imam said, ‘It will come in the shape of a changed man, slim and tired looking. People in the gathering will see him. Then he will come forward to one of our followers who knew it and would argue with it against the people, opposed to ‘A’immah. The Holy Quran will ask him, ‘Do you know me’? The man will look it (the Holy Quran) and say, ‘O servant of Allah, I do not know you.’ The Holy Quran then will return in his former shape with which it existed among people, and will ask, ‘Do you still not know me’? He will say, ‘Yes, I do know you.’ It will say, ‘I am the Holy Quran for which you kept the whole night awake and faced suffering in your life, hearing disappointing words from people when you spoke from me. Obviously every merchant enjoys the benefit of his trade. Today I am behind you with full support. The Holy Quran will then proceed with him to the Throne of the Lord of Majesty, the Most Blessed, the Most High, and the Quran then will say, ‘Lord, this servant of You was very close to me and very careful about me. He would love others because of me and hate others just because of me.’ “Allah, the Most Majestic, the Most Holy, will then say, ‘Allow my servant enter paradise and allow him be dressed and crowned and then let him come back to see his friend, the Quran.’ When that servant of Allah will be well rewarded he will then come back to see his friend the Holy Quran, Allah, the Most High will ask the Holy Quran, ‘Are you happy with Our rewards given to your friend?’ the Holy Quran will say, ‘Lord, I consider it is not enough and I request that he should receive more of all the good things. Allah then will say, ‘I swear by My Majesty, Honor and Highness, I shall reward him and others like him with five things and more: I shall give them eternal youth, good health free from illness, wealth free from poverty, happiness free from sadness and life free from death.’ “The Imam then read this verse: ‘They will not experience any death other than that which they have already been through.’ ( 44 : 56 ) “I (the narrator) then said to abu Ja’far (a.s.) ‘May Allah keep my soul in service for your cause, does the Holy Quran speak?’ The Imam smiled and said, ‘May Allah grant favors upon our weak Shi’a (followers), they are people of submission.’ Then he said, ‘Yes, O Sa’D, prayer speaks. It has a form and shape. It commands and prohibits.’ Sa’D then said, ‘It changed my color and I said, “I will not be able to speak of this among people.” Abu Ja’far (a.s.) said, ‘Are people anything else besides our Shi’a (followers)? Those who do not know the right of the prayer, they have denied our rights.’ The Imam then said, ‘O Sa’d do you want, I will make you hear the words of the Holy Quran?’ I said, ‘Yes, may Allah grant you favors.’ The Imam said, ‘Prayer prohibits indecency and unlawful matters and speaking of Allah is greater,’ “prohibition” is speaking, (stopping people from going to) “indecency and unlawful matters” (that) are (nothing else but certain) men. We are the Dhikr of Allah, speaking of Allah, and we are greater.’” (The Holy Quran prohibits people from following certain people called indecency and unlawful matters) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/478)"
        ],
        "index": 3461,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:1:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ عَنْ آبَائِهِ ( عليهم السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَيُّهَا النَّاسُ إِنَّكُمْ فِي دَارِ هُدْنَةٍ وَ أَنْتُمْ عَلَى ظَهْرِ سَفَرٍ وَ السَّيْرُ بِكُمْ سَرِيعٌ وَ قَدْ رَأَيْتُمُ اللَّيْلَ وَ النَّهَارَ وَ الشَّمْسَ وَ الْقَمَرَ يُبْلِيَانِ كُلَّ جَدِيدٍ وَ يُقَرِّبَانِ كُلَّ بَعِيدٍ وَ يَأْتِيَانِ بِكُلِّ مَوْعُودٍ فَأَعِدُّوا الْجَهَازَ لِبُعْدِ الْمَجَازِ",
          "قَالَ فَقَامَ الْمِقْدَادُ بْنُ الْأَسْوَدِ فَقَالَ يَا رَسُولَ اللَّهِ وَ مَا دَارُ الْهُدْنَةِ قَالَ دَارُ بَلَاغٍ وَ انْقِطَاعٍ فَإِذَا الْتَبَسَتْ عَلَيْكُمُ الْفِتَنُ كَقِطَعِ اللَّيْلِ الْمُظْلِمِ فَعَلَيْكُمْ بِالْقُرْآنِ فَإِنَّهُ شَافِعٌ مُشَفَّعٌ وَ مَاحِلٌ مُصَدَّقٌ وَ مَنْ جَعَلَهُ أَمَامَهُ قَادَهُ إِلَى الْجَنَّةِ وَ مَنْ جَعَلَهُ خَلْفَهُ سَاقَهُ إِلَى النَّارِ وَ هُوَ الدَّلِيلُ يَدُلُّ عَلَى خَيْرِ سَبِيلٍ",
          "وَ هُوَ كِتَابٌ فِيهِ تَفْصِيلٌ وَ بَيَانٌ وَ تَحْصِيلٌ وَ هُوَ الْفَصْلُ لَيْسَ بِالْهَزْلِ وَ لَهُ ظَهْرٌ وَ بَطْنٌ فَظَاهِرُهُ حُكْمٌ وَ بَاطِنُهُ عِلْمٌ ظَاهِرُهُ أَنِيقٌ وَ بَاطِنُهُ عَمِيقٌ لَهُ نُجُومٌ وَ عَلَى نُجُومِهِ نُجُومٌ لَا تُحْصَى عَجَائِبُهُ وَ لَا تُبْلَى غَرَائِبُهُ ",
          "فِيهِ مَصَابِيحُ الْهُدَى وَ مَنَارُ الْحِكْمَةِ وَ دَلِيلٌ عَلَى الْمَعْرِفَةِ لِمَنْ عَرَفَ الصِّفَةَ فَلْيَجْلُ جَالٍ بَصَرَهُ وَ لْيُبْلِغِ الصِّفَةَ نَظَرَهُ يَنْجُ مِنْ عَطَبٍ وَ يَتَخَلَّصْ مِنْ نَشَبٍ فَإِنَّ التَّفَكُّرَ حَيَاةُ قَلْبِ الْبَصِيرِ كَمَا يَمْشِي الْمُسْتَنِيرُ فِي الظُّلُمَاتِ بِالنُّورِ فَعَلَيْكُمْ بِحُسْنِ التَّخَلُّصِ وَ قِلَّةِ التَّرَبُّصِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, from his<sup>asws</sup> forefathers<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘O you people! You are in a house of truce, and you are upon the back of a journey and the travel is quick with you, and you have seen the night and the day, and the sun and the moon turning every new (thing) into old, and every remote (thing) to be close by, and every promised (thing) has come up, therefore prepare the ship (of life) for the long passageway’. ",
            "So Al-Miqdad Bin al-Aswad<sup>ra</sup> arose and said, ‘O Rasool-Allah<sup>saww</sup>! And what is the house of truce?’ He<sup>saww</sup> said: ‘A house of communication and interruption. So when the strife confuses upon you like the interruption of the dark night, so upon you is to be with the Quran, for it is an interceder who would be interceded with, and an inviter who would be ratified; and the one who makes it to be in front of him, it would Guide him to the Paradise, and the one who makes it to be behind him, it would usher him into the Fire, and it is a pointer upon the best way.",
            "And it is a Book wherein is detail, and explanation, and achievement, and it is the detail not being with the amusement; and for it there is an apparent and a hidden (meaning). So it’s apparent is wisdom, and its hidden is knowledge. Its apparent is profound, and its hidden is bottomless. There are luminaries for it, and upon its luminaries, are (more) luminaries. Neither can its wonderments be counted nor do its marvels wear out. ",
            "Therein are lanterns of guidance, and minarets of wisdom, and it evidences upon the recognition to the one<sup>asws</sup> who understands the capacity, so it brightens the brightness of his insight and lets his look reach the capacity. It rescues from the corruption and finishes off from the entanglements, for the pondering is a revival of the heart of insight just as the enlightened one walks in the darkness with the light. Therefore, it is upon you with the excellent sincerity and without having second thoughts’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father al-Nawfali from al-Sakuni from abu ‘Abd Allah (a.s.) who has said the following: “The Messenger of Allah has said, ‘O people, you live in peacetime during a fast moving journey. You have seen night, day, sun and moon turn every new into old, every far near, and bring the time of every promise near at hand. Prepare the means for a long journey.’ The Imam said, ‘Miqdad ibn Aswad then stood up and asked, “O Messenger of Allah, what is the ‘peace time’?” The Messenger of Allah said, “It is the time to complete (the task) and cut off (from this world). When mischief confuses you like a dark night you must hold to the Holy Quran; it is an intercessor (an associate whose association is beneficial) whose intercession will be accepted and a solicitor whose words are believed. Whoever gives it the lead it will take him to paradise. Whoever leaves it behind (it) will then drive him to the fire. It is a guide that shows the best path. It is the book that contains details and explanations, and accomplishments. It is a criterion and not a useless thing. It has face and hidden meanings. Its face meaning is law and its hidden meaning is knowledge. Its face meaning is unique and its hidden meaning is deep. It has stars and upon its stars there are stars. Its wonders do not end and its rare facts do not become old. In it there is the torch of guidance, and the lighthouses of wisdom. It serves as proof of veracity of knowledge (for one who wants to verfy the truth of his Knowledge) and who has come to know the attribute, permit him brighten his eyes to reach the attribute. It saves from destruction, and protects against danger. Thinking is life for the heart of an intelligent person, just as in darkness one finds the way with help from light. Thus, your freedom (from worldly attractions) must be the best and your delays the shortest.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/479)"
        ],
        "index": 3462,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:1:3",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ سَمَاعَةَ بْنِ مِهْرَانَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ الْعَزِيزَ الْجَبَّارَ أَنْزَلَ عَلَيْكُمْ كِتَابَهُ وَ هُوَ الصَّادِقُ الْبَارُّ فِيهِ خَبَرُكُمْ وَ خَبَرُ مَنْ قَبْلَكُمْ وَ خَبَرُ مَنْ بَعْدَكُمْ وَ خَبَرُ السَّمَاءِ وَ الْأَرْضِ وَ لَوْ أَتَاكُمْ مَنْ يُخْبِرُكُمْ عَنْ ذَلِكَ لَتَعَجَّبْتُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Abdullah Bin Al Mugheira, from Sama’at Bin Mihran who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The Mighty, the Compeller Sent down His<sup>azwj</sup> Book upon you all, and it is the truthful and righteous. Therein is your news, and the news of the ones before you, and news of the ones (to come) after you, and news of the sky and the earth. And if someone were to come to you informing you all about that, it would have astonished you all’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ‘Abd Allah ibn al-Mughirah from Sama’a ibn Mehran who has said the following: “Abu ‘Abd (a.s.) has said, the Majestic, the Almighty, has revealed to you His book. It is truthful and virtuous. In it there is news about you, the news of those before you, the news about those after you, the news about the heaven and earth and if one brings you such news, you are astonished.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/480)"
        ],
        "index": 3463,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:1:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ أَبِي الْجَارُودِ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَنَا أَوَّلُ وَافِدٍ عَلَى الْعَزِيزِ الْجَبَّارِ يَوْمَ الْقِيَامَةِ وَ كِتَابُهُ وَ أَهْلُ بَيْتِي ثُمَّ أُمَّتِي ثُمَّ أَسْأَلُهُمْ مَا فَعَلْتُمْ بِكِتَابِ اللَّهِ وَ بِأَهْلِ بَيْتِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Sinan, from Abu Al Jaroud who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘I<sup>saww</sup> would be the first delegate to the Mighty, the Compeller, on the Day of Judgment, and (and so would be) His<sup>azwj</sup> Book, and the People<sup>asws</sup> of my<sup>saww</sup> Household. Then it would be my<sup>saww</sup> community, then I<sup>saww</sup> would ask them what they did with the Book of Allah<sup>azwj</sup> and with the People<sup>asws</sup> of my<sup>saww</sup> Household’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from abu al-Jarud who has said the following: “Abu Ja’far (a.s.) has said that the Messenger of Allah has said, ‘I will be the first to arrive before the Majestic, the Almighty on the Day of Judgment, His book and my family, then my followers whom I will ask about what they have done to the book of Allah and my family.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف كالموثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/480)"
        ],
        "index": 3464,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:1:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ بْنِ يَحْيَى عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ هَذَا الْقُرْآنَ فِيهِ مَنَارُ الْهُدَى وَ مَصَابِيحُ الدُّجَى فَلْيَجْلُ جَالٍ بَصَرَهُ وَ يَفْتَحُ لِلضِّيَاءِ نَظَرَهُ فَإِنَّ التَّفَكُّرَ حَيَاةُ قَلْبِ الْبَصِيرِ كَمَا يَمْشِي الْمُسْتَنِيرُ فِي الظُّلُمَاتِ بِالنُّورِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ahmad Bin Yahya, from Talha Bin Zayd, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘This Quran, in it are minarets of guidance, and lanterns for the darkness. So let him brighten the brightness of his vision and open his vision for the illumination, for the pondering is a revival for the insight of ‘قَلْبِ’ (wisdom sometimes also translated as the heart) just as the enlightened one would walk in ‘فِي الظُّلُمَاتِ بِالنُّورِ’ the darkness with the light’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn Yahya from Talhah ibn Zayd from abu ‘Abd Allah (a.s.) who has said the following: “In this Quran is the lighthouse of guidance and torches for dankness. One must brighten his eyes and open them in such light; thinking is life for the seeing eyes just as light helps one walking in the dark.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/480)"
        ],
        "index": 3465,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:1:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ أَبِي جَمِيلَةَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كَانَ فِي وَصِيَّةِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) أَصْحَابَهُ اعْلَمُوا أَنَّ الْقُرْآنَ هُدَى النَّهَارِ وَ نُورُ اللَّيْلِ الْمُظْلِمِ عَلَى مَا كَانَ مِنْ جَهْدٍ وَ فَاقَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Abu Jameela who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘It was in the bequest of Amir Al-Momineen<sup>asws</sup> to his<sup>asws</sup> companions: ‘Know that the Quran is a Guidance for the day, and light for the dark night, upon the one who was from a striving one and destitution’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from Muhammad ibn ‘Isa from Yunus from abu Jamilah who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘It is in the will of Amir al-Mu’minin, Ali ibn abu Talib (a.s.) to his companions, “You must know that the Holy Quran is guidance during the day and light in the dark night against the existing hardships and poverty.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/480)"
        ],
        "index": 3466,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:1:7",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ عَنْ آبَائِهِ ( عليهم السلام ) قَالَ شَكَا رَجُلٌ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) وَجَعاً فِي صَدْرِهِ فَقَالَ ( صلى الله عليه وآله ) اسْتَشْفِ بِالْقُرْآنِ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ وَ شِفاءٌ لِما فِي الصُّدُور."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, from his<sup>asws</sup> forefathers<sup>asws</sup> having said: ‘A man complained to the Prophet<sup>saww</sup> of pain in his chest, so he<sup>saww</sup> said: ‘Seek healing with the Quran, for Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\">[10:57] and a Healing for what is in the chests</span>’."
          ],
          "en.sarwar": [
            "7. Ali has narrated from his father from al-Nawfali from al-Sakuni from abu ‘Abd Allah (a.s.) who has said the following: “Once a man complained to the Holy Prophet for having pain in his chest and he (a.s.) said, ‘Seek a cure from the Holy Quran; Allah, the Most Majestic, the Most Holy, says, “It is a cure for that which is in the chest (the heart).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/481)"
        ],
        "index": 3467,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:1:8",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ بَعْضِ أَصْحَابِهِ عَنِ الْخَشَّابِ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَا وَ اللَّهِ لَا يَرْجِعُ الْأَمْرُ وَ الْخِلَافَةُ إِلَى آلِ أَبِي بَكْرٍ وَ عُمَرَ أَبَداً وَ لَا إِلَى بَنِي أُمَيَّةَ أَبَداً وَ لَا فِي وُلْدِ طَلْحَةَ وَ الزُّبَيْرِ أَبَداً وَ ذَلِكَ أَنَّهُمْ نَبَذُوا الْقُرْآنَ وَ أَبْطَلُوا السُّنَنَ وَ عَطَّلُوا الْأَحْكَامَ ",
          "وَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْقُرْآنُ هُدًى مِنَ الضَّلَالِ وَ تِبْيَانٌ مِنَ الْعَمَى وَ اسْتِقَالَةٌ مِنَ الْعَثْرَةِ وَ نُورٌ مِنَ الظُّلْمَةِ وَ ضِيَاءٌ مِنَ الْأَحْدَاثِ وَ عِصْمَةٌ مِنَ الْهَلَكَةِ وَ رُشْدٌ مِنَ الْغَوَايَةِ وَ بَيَانٌ مِنَ الْفِتَنِ وَ بَلَاغٌ مِنَ الدُّنْيَا إِلَى الْآخِرَةِ وَ فِيهِ كَمَالُ دِينِكُمْ وَ مَا عَدَلَ أَحَدٌ عَنِ الْقُرْآنِ إِلَّا إِلَى النَّارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from one of his companions, from Al Khashhab, raising it, said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘No, by Allah<sup>azwj</sup>! Neither will the command nor the Caliphate return to Abu Bakr, and Umar, ever, nor to the Clan of Umayya, ever, nor to be among the children of Talha and Al-Zubeyr, ever, and that is because they discarded the Quran, and invalidated the Sunnah, and disrupted the judgments. ",
            "And Rasool-Allah<sup>saww</sup> said: ‘The Quran is a Guidance from the straying, and is a clarity from the blindness, and a stability from the stumbling, and a light from the darkness, and an illumination from the newly-occurring events, and an infallibility from the destruction, and a reasoning from the temptation, and an explanation from the strife, and an achievement from the world to the Hereafter; and therein is perfection of your Religion, and no one would deviate from the Quran except to the Fire’’."
          ],
          "en.sarwar": [
            "8. Abu Ali al-Ash’ari has narrated from certain individuals of his people from al- Khashshab in a marfu’ manner from the Imam (a.s.) who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘I swear by Allah, Khilafat (leadership after the Holy Prophet) will never return to the family of abu Bakr and ‘Umar. It will never return to descendents of ‘Umayyah, and never to the children of Talhah and al-Zubayr. It is because they abandoned the Holy Quran, cancelled the noble traditions, and suspended the laws. The Messenger of Allah has said, “The Holy Quran is guidance against straying, clarification against blindness, stability against wavering, light against darkness, brightness in incidents, protection against destruction, intelligence against temptation, clear statement against mischief, and completion (of aim) in the world to the hereafter. In it there is your perfect religion. Whoever deviates from the Holy Quran is headed to the fire.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/481)"
        ],
        "index": 3468,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:1:9",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ عَنْ وُهَيْبِ بْنِ حَفْصٍ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ الْقُرْآنَ زَاجِرٌ وَ آمِرٌ يَأْمُرُ بِالْجَنَّةِ وَ يَزْجُرُ عَنِ النَّارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad, from Wuheyb Bin Hafs, from Abu Baseer who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The Quran Prohibits and is a Commander. It Commands with (going to) the Paradise and Prohibits from (going to) the Fire’."
          ],
          "en.sarwar": [
            "9. Hamid has narrated from al-Hassan ibn m h from Wuhayb ibn Hafs from abu Basir who has said the following: “I heard abu ‘Abd Allah (a.s.) saying, ‘The Holy Quran forbids and commands, it commands (people to go) to paradise and prohibits (people from going) to the fire.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/481)"
        ],
        "index": 3469,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:1:10",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنْ سَعْدٍ الْإِسْكَافِ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أُعْطِيتُ السُّوَرَ الطِّوَالَ مَكَانَ التَّوْرَاةِ وَ أُعْطِيتُ الْمِئِينَ مَكَانَ الْإِنْجِيلِ وَ أُعْطِيتُ الْمَثَانِيَ مَكَانَ الزَّبُورِ وَ فُضِّلْتُ بِالْمُفَصَّلِ ثَمَانٌ وَ سِتُّونَ سُورَةً وَ هُوَ مُهَيْمِنٌ عَلَى سَائِرِ الْكُتُبِ وَ التَّوْرَاةُ لِمُوسَى وَ الْإِنْجِيلُ لِعِيسَى وَ الزَّبُورُ لِدَاوُدَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Salih Bin Al Sindy, from Ja’far Bin Bashir, from Sa’ad Al Askaf who said, ",
            "‘Rasool-Allah<sup>saww</sup> said: ‘I<sup>saww</sup> have been Given the lengthy Chapters in place of the Torah, and I<sup>saww</sup> have been Given the (Chapter of) one hundred (Verses) in place of the Evangel, and I<sup>saww</sup> have been Given the Double (Surah Al-Fatiha) in place of the Psalms, and I<sup>saww</sup> have been Preferred with the detail of sixty eight Chapters, and these are the pre-dominant upon the rest of the Book; and the Torah is for Musa<sup>as</sup> and the Evangel is for Isa<sup>as</sup>, and the Psalms is for Dawood<sup>as</sup>’’."
          ],
          "en.sarwar": [
            "10. Ali ibn Ibrahim has narrated from his father from Salih ibn al-Sindy from Ja’far from his father ibn Bashir from Sa’d al-‘Iskaf who has said the following: “The Messenger of Allah has said, ‘The longer chapters of the Holy Quran were given to me as alternative to Torah, the chapters of one hundred verses in place of Injil, al-Mathani (Chapter 1) in place of al-Zabbur, in addition I was favored with sixty eight detailed chapters. It is dominant over other books, Torah was for Moses, Injil for Jesus and al-Zabur for David.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/483)"
        ],
        "index": 3470,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:1:11",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ أَحْمَدَ بْنِ النَّضْرِ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ يَجِي‏ءُ الْقُرْآنُ يَوْمَ الْقِيَامَةِ فِي أَحْسَنِ مَنْظُورٍ إِلَيْهِ صُورَةً فَيَمُرُّ بِالْمُسْلِمِينَ فَيَقُولُونَ هَذَا الرَّجُلُ مِنَّا فَيُجَاوِزُهُمْ إِلَى النَّبِيِّينَ فَيَقُولُونَ هُوَ مِنَّا فَيُجَاوِزُهُمْ إِلَى الْمَلَائِكَةِ الْمُقَرَّبِينَ فَيَقُولُونَ هُوَ مِنَّا حَتَّى يَنْتَهِيَ إِلَى رَبِّ الْعِزَّةِ عَزَّ وَ جَلَّ فَيَقُولُ يَا رَبِّ فُلَانُ بْنُ فُلَانٍ أَظْمَأْتُ هَوَاجِرَهُ وَ أَسْهَرْتُ لَيْلَهُ فِي دَارِ الدُّنْيَا وَ فُلَانُ بْنُ فُلَانٍ لَمْ أُظْمِئْ هَوَاجِرَهُ وَ لَمْ أُسْهِرْ لَيْلَهُ ",
          "فَيَقُولُ تَبَارَكَ وَ تَعَالَى أَدْخِلْهُمُ الْجَنَّةَ عَلَى مَنَازِلِهِمْ فَيَقُومُ فَيَتَّبِعُونَهُ فَيَقُولُ لِلْمُؤْمِنِ اقْرَأْ وَ ارْقَهْ قَالَ فَيَقْرَأُ وَ يَرْقَى حَتَّى يَبْلُغَ كُلُّ رَجُلٍ مِنْهُمْ مَنْزِلَتَهُ الَّتِي هِيَ لَهُ فَيَنْزِلُهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Salim, from Ahmad Bin Al Nazar, from Amro Bin Shimr, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The Quran will come on the Day of Judgment in the best perspective of the image. So it would pass by the Muslims, and they would be saying, ‘This is the man from us’. So it would go past them to the Prophets<sup>as</sup>, and they<sup>as</sup> would be saying: ‘He is from us’. So it would go past them to the Angels of Proximity, and they would be saying: ‘He is from us’; to the extent that it would end up to the Lord<sup>azwj</sup> of the Honour, Mighty and Majestic and it would be saying: ‘O Lord<sup>azwj</sup>! So and so, son of so and so, his mouth was thirsty, and he observed vigils during his nights in the house of the world; and so and so, son of so and so, his mouth was not thirsty and he did not observe vigils during his night’. ",
            "So the Blessed and High would be Saying: “Enter them into the Paradise upon their (relevant) status. So they would be arising and following it. So it would be Saying to the Momin: ‘Recite and ascend’. He<sup style=\"font-weight: normal\">asws</sup> said: ‘So he (the Momin) would recite and ascend until each man from them would reach his dwelling which is for him, so it would lodge him (therein)’."
          ],
          "en.sarwar": [
            "11. Abu Ali al-Ash’ari has narrated from Muhammad ibn Salim from Ahmad ibn al- Nadr from ‘Amr ibn Shimr from Jabir from abu Ja’far (a.s.) who has said the following: “On the Day of Judgment the Holy Quran will come in the best shape and form. He will pass by the Muslims who will say, ‘This man is from us.’ He will pass toward the prophets who will say that he is of us, then he will pass toward the special angels who will say that he is one of us until he is before the Lord of Majesty, the Most Majestic, the Most Holy, and will say, ‘O Lord, so and so son of so and so suffered from thirst, spent the night in vigil in the world so and so son of so and so did not suffer thirst and did not spend his night in vigil (for worship).’ Allah, the Most Blessed, the Most High, will say, ‘Admit them in paradise.’ He will stand up and they will also rise and follow him. The believing people will be told, ‘Read and climb.’ The Imam said that the believing people will read and climb until they will reach their position that is for them and occupy their places.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/483)"
        ],
        "index": 3471,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:1:12",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ يُونُسَ بْنِ عَمَّارٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ الدَّوَاوِينَ يَوْمَ الْقِيَامَةِ ثَلَاثَةٌ دِيوَانٌ فِيهِ النِّعَمُ وَ دِيوَانٌ فِيهِ الْحَسَنَاتُ وَ دِيوَانٌ فِيهِ السَّيِّئَاتُ فَيُقَابَلُ بَيْنَ دِيوَانِ النِّعَمِ وَ دِيوَانِ الْحَسَنَاتِ ",
          "فَتَسْتَغْرِقُ النِّعَمُ عَامَّةَ الْحَسَنَاتِ وَ يَبْقَى دِيوَانُ السَّيِّئَاتِ فَيُدْعَى بِابْنِ آدَمَ الْمُؤْمِنِ لِلْحِسَابِ فَيَتَقَدَّمُ الْقُرْآنُ أَمَامَهُ فِي أَحْسَنِ صُورَةٍ فَيَقُولُ يَا رَبِّ أَنَا الْقُرْآنُ وَ هَذَا عَبْدُكَ الْمُؤْمِنُ قَدْ كَانَ يُتْعِبُ نَفْسَهُ بِتِلَاوَتِي وَ يُطِيلُ لَيْلَهُ بِتَرْتِيلِي وَ تَفِيضُ عَيْنَاهُ إِذَا تَهَجَّدَ فَأَرْضِهِ كَمَا أَرْضَانِي ",
          "قَالَ فَيَقُولُ الْعَزِيزُ الْجَبَّارُ عَبْدِيَ ابْسُطْ يَمِينَكَ فَيَمْلَؤُهَا مِنْ رِضْوَانِ اللَّهِ الْعَزِيزِ الْجَبَّارِ وَ يَمْلَأُ شِمَالَهُ مِنْ رَحْمَةِ اللَّهِ ثُمَّ يُقَالُ هَذِهِ الْجَنَّةُ مُبَاحَةٌ لَكَ فَاقْرَأْ وَ اصْعَدْ فَإِذَا قَرَأَ آيَةً صَعِدَ دَرَجَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and a number of our companions, from Ahmad Bin Muhammad, and Sahl Bin Ziyad, altogether from Ibn Mahboub, from Malik Bin Atiyya, from Yunus Bin Ammar who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The registers on the Day of Judgment would be three registers – a register in which are (recorded) the Bounties, and a register in which are (recorded) the good deeds, and a register in which are (recorded) the evil deeds. ",
            "So the Bounties would generally cover the good deeds, and there would remain the evil deeds. So the son of Adam<sup>as</sup> would be called for the Reckoning, and the Quran would walk in front of him in an excellent image, and it would be saying: ‘O Lord<sup>azwj</sup>! I am the Quran, and this is Your<sup>azwj</sup> servant who used to exhaust himself by my recitation, and prolong his nights by my slow recitation, and flooded his eyes (with tears) when he (prayed the) <span class=\"iTxt\">Tahajjud Salāt</span>, therefore Please him just as You<sup>azwj</sup> have Pleased me’. ",
            "He<sup>asws</sup> said: ‘So the Mighty, the Compeller would be Saying: “My<sup>azwj</sup> servant! Extend your right hand”. So it would be Filled with the Pleasure of Allah<sup>azwj</sup>, the Mighty, the Compeller, and his left hand would be Filled from the Mercy of Allah<sup>azwj</sup>. Then it would be said to him: ‘This is the Paradise, Gifted for you. Therefore recite and ascend. So whenever he recites a Verse, he would ascend a level’."
          ],
          "en.sarwar": [
            "12. Ali ibn Ibrahim has narrated from his father and A number of our people have narrated have narrated from Ahmad ibn Muhammad and Sahl ibn Ziyad all from ibn Mahbub from Malik ibn ‘Atiyyah from Yunus ibn ‘Ammar who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘On the Day of Judgment there will be three books of records: the book of the record of the good deeds, the book of the record of the bounties and the book of the record of the evil deeds. The records of the good deeds and the bounties will be compared and (in a particular case) the record of the bounties overwhelm all the good deeds and the record of the evil deeds will remain for the son of Adam’s accountability, however, the Holy Quran will come forward in the best form and say, “O Lord, this believing servant would tire himself in reciting me and spend long hours during the night reading from me. During his Tahajjud (special prayer at night) his eyes would flood with tears, O Lord, make him happy as he would make me happy.” The Imam said that the Most Majestic, the Almighty, will say, ‘My servant, open your right hand. He fills it up with contentment of Allah, the Most Majestic, the Almighty, his left hand with the favor of Allah and then it will be said to him, ‘This is paradise and it is permissible for you. Read (from the Holy Quran) and climb up.’ On reading a verse he will climb one degree (in happiness).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/484)"
        ],
        "index": 3472,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:1:13",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ جَمِيعاً عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ عَنِ الزُّهْرِيِّ قَالَ قَالَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) لَوْ مَاتَ مَنْ بَيْنَ الْمَشْرِقِ وَ الْمَغْرِبِ لَمَا اسْتَوْحَشْتُ بَعْدَ أَنْ يَكُونَ الْقُرْآنُ مَعِي وَ كَانَ ( عليه السلام ) إِذَا قَرَأَ مالِكِ يَوْمِ الدِّينِ يُكَرِّرُهَا حَتَّى كَادَ أَنْ يَمُوتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Ali Bin Muhammad Al Qasany, altogether, from Al Qasim Bin Muhammad, from Suleyman Bin Dawood, from Sufyan Bin Uyayna, from Al Zuhry who said, ",
            "‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said: ‘(Even) if (all) the ones in the east and the west were to die, I<sup>asws</sup> would not be lonely if the Quran happens to be with me<sup>asws</sup>’. And it was so that whenever he<sup>asws</sup> recited <span class=\"ibTxt\">[1:4] Master of the Day of Judgment </span>he<sup>asws</sup> would keep on repeating it until he<sup>asws</sup> would almost be dying’."
          ],
          "en.sarwar": [
            "13. Ali ibn Ibrahim has narrated from his father and Ali ibn Muhammad al-Qasani all have narrated from al-Qasim ibn Muhammad from Sulayman ibn Dawud from Sufyan ibn ‘Uyayna from al-Zuhri who has said the following: “Ali ibn al-Husayn (a.s.) has said, ‘Having the Holy Quran with me I will have no fear or anxiety, even if everyone between the East and West may all die.’ On reading verse four of Chapter 1, “The owner (of the kingdom) on the Day of Judgment,” repeatedly he seemed as if he were about to die.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/484)"
        ],
        "index": 3473,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:1:14",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ إِسْحَاقَ بْنِ غَالِبٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا جَمَعَ اللَّهُ عَزَّ وَ جَلَّ الْأَوَّلِينَ وَ الْآخِرِينَ إِذَا هُمْ بِشَخْصٍ قَدْ أَقْبَلَ لَمْ يُرَ قَطُّ أَحْسَنُ صُورَةً مِنْهُ فَإِذَا نَظَرَ إِلَيْهِ الْمُؤْمِنُونَ وَ هُوَ الْقُرْآنُ قَالُوا هَذَا مِنَّا هَذَا أَحْسَنُ شَيْ‏ءٍ رَأَيْنَا ",
          "فَإِذَا انْتَهَى إِلَيْهِمْ جَازَهُمْ ثُمَّ يَنْظُرُ إِلَيْهِ الشُّهَدَاءُ حَتَّى إِذَا انْتَهَى إِلَى آخِرِهِمْ جَازَهُمْ فَيَقُولُونَ هَذَا الْقُرْآنُ فَيَجُوزُهُمْ كُلَّهُمْ حَتَّى إِذَا انْتَهَى إِلَى الْمُرْسَلِينَ فَيَقُولُونَ هَذَا الْقُرْآنُ فَيَجُوزُهُمْ حَتَّى يَنْتَهِيَ إِلَى الْمَلَائِكَةِ فَيَقُولُونَ هَذَا الْقُرْآنُ ",
          "فَيَجُوزُهُمْ ثُمَّ يَنْتَهِي حَتَّى يَقِفَ عَنْ يَمِينِ الْعَرْشِ فَيَقُولُ الْجَبَّارُ وَ عِزَّتِي وَ جَلَالِي وَ ارْتِفَاعِ مَكَانِي لَأُكْرِمَنَّ الْيَوْمَ مَنْ أَكْرَمَكَ وَ لَأُهِينَنَّ مَنْ أَهَانَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibrahim Bin Abdul Hameed, from Is’haq Bin Ghalib who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘When Allah<sup>azwj</sup> will Gather the formers ones and the latter ones, they would be with a person who would in front of them. They would not have seen an image better than it, at all. So when the <span class=\"iTxt\">Momineen</span> will look at him, and he would be the Quran, they would be saying, ‘This one is from us. This is the best thing we have seen’. ",
            "So when he ends up to them, he would go past them. Then the martyrs would look at him, until when he ends up to the last of them, and goes past them. So they would be saying: ‘This is the Quran’. So he would go past them until when he ends up to the <span class=\"iTxt\">Mursil</span> Prophets<sup>as</sup>, and they<sup>as</sup> would be saying: ‘This is the Quran’. So he would go past them until he ends up to the Angels, and they would be saying: ‘This is the Quran’. ",
            "So he would be going past them. Then he would end up until he pauses on the right of the Throne. So the Compeller would be Saying: “By My<sup>azwj</sup> Mighty and My<sup>azwj</sup> Majesty, and the Loftiness of My<sup>azwj</sup> Position! Today I<sup>azwj</sup> shall Honour the one whom honoured you, and I<sup>azwj</sup> shall Dishonour the one who dishonoured you”’."
          ],
          "en.sarwar": [
            "14. Ali ibn Ibrahim has narrated from his father ibn abu ‘Umayr from Ibrahim ibn ‘Abd al-Hamid from Ishaq ibn Ghalib who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘When Allah, the Most Majestic, the Most Holy, will gather together all the people of the past and later generation, a person the like of whom in beauty has never been seen will appear. The believing people will look at him (the Holy Quran) and say, ‘This is one of us, the best that we have ever seen. He will come to them and pass them. The martyrs will look at him, and he will pass them until the last one among them and they will say, ‘This is the Holy Quran.’ He will pass all of them toward the messengers who will say, ‘This is the Holy Quran,’ he will pass them toward the angels who will say, ‘This is the Holy Quran,’ and he will pass them until he will approach the right side of the Throne and stand up at that point. The Almighty will say, ‘I swear by my Majesty and Glory, and High status, this day I will honor those who had honored him and bring low those who had disregarded him.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:3:1",
  "kind": "verse_list"
}