{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:2:3",
        "titles": {
          "ar": "كِتَابُ فَضْلِ الْقُرْآنِ",
          "en": "THE BOOK OF MERITS OF THE QURAN"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 10"
        },
        "path": "/books/al-kafi:2:3:10",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابٌ فِيمَنْ يُظْهِرُ</span> الْغَشْيَةَ عِنْدَ قِرَاءَةِ الْقُرْآنِ",
          "en": "Chapter 10 – Regarding the one who manifests the fainting during recitation of the Quran"
        }
      }
    ],
    "index": 467,
    "local_index": 10,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 11"
        },
        "path": "/books/al-kafi:2:3:11",
        "titles": {
          "ar": "بَابٌ فِي كَمْ يُقْرَأُ الْقُرْآنُ وَ يُخْتَمُ",
          "en": "Chapter 11 – In how much (time) should the Quran be recited and completed"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 9"
        },
        "path": "/books/al-kafi:2:3:9",
        "titles": {
          "ar": "بَابُ تَرْتِيلِ الْقُرْآنِ بِالصَّوْتِ الْحَسَنِ",
          "en": "Chapter 9 – Slow clear recitation of the Quran in the beautiful voice"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:2:3",
        "titles": {
          "ar": "كِتَابُ فَضْلِ الْقُرْآنِ",
          "en": "THE BOOK OF MERITS OF THE QURAN"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:3:10",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابٌ فِيمَنْ يُظْهِرُ</span> الْغَشْيَةَ عِنْدَ قِرَاءَةِ الْقُرْآنِ",
      "en": "Chapter 10 – Regarding the one who manifests the fainting during recitation of the Quran"
    },
    "verse_count": 1,
    "verse_start_index": 3523,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف بسندي ه  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/503)"
        ],
        "index": 3524,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:10:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ يَعْقُوبَ بْنِ إِسْحَاقَ الضَّبِّيِّ عَنْ أَبِي عِمْرَانَ الْأَرْمَنِيِّ عَنْ عَبْدِ اللَّهِ بْنِ الْحَكَمِ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قُلْتُ إِنَّ قَوْماً إِذَا ذَكَرُوا شَيْئاً مِنَ الْقُرْآنِ أَوْ حُدِّثُوا بِهِ صَعِقَ أَحَدُهُمْ حَتَّى يُرَى أَنَّ أَحَدَهُمْ لَوْ قُطِعَتْ يَدَاهُ أَوْ رِجْلَاهُ لَمْ يَشْعُرْ بِذَلِكَ فَقَالَ سُبْحَانَ اللَّهِ ذَاكَ مِنَ الشَّيْطَانِ مَا بِهَذَا نُعِتُوا إِنَّمَا هُوَ اللِّينُ وَ الرِّقَّةُ وَ الدَّمْعَةُ وَ الْوَجَلُ .",
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ حَسَّانَ عَنْ أَبِي عِمْرَانَ الْأَرْمَنِيِّ عَنْ عَبْدِ اللَّهِ بْنِ الْحَكَمِ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Yaqoub Bin Is’haq Al Sabiy, from Abu Imran Al Armany, from Abdullah Bin Al Hakam, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup style=\"font-weight: normal\">asws</sup>, said, ‘I said, ‘There is a group of people, when something is mentioned from the Quran or narrated with it, one of them would shriek (scream) to the extent that one of them would view that if his hand or his leg were to be cut off, he would not be aware of that’. So he<sup style=\"font-weight: normal\">asws</sup> said: ‘Glory be to Allah<sup style=\"font-weight: normal\">azwj</sup>! That is from the Satan<sup style=\"font-weight: normal\">la</sup>, what is attributed with this. But rather, it is the softness and the tenderness, and the tears, and the scruples’. ",
            "Abu Ali Al Ashary, from Muhammad Bin Hassan, from Abu Imran Al Armany, from Abdullah Bin Al Hakam, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> – similar to it."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad from Ya’qub ibn Ishaq al-Dabbiy from abu ‘Imran al-Armani from ‘Abd Allah ibn al-Hakam from Jabir who has said the following: “Once I said to abu Ja’far (a.s.) ‘There are people when remembering something from the Holy Quran or is mentioned before them they suffer a shock to the extent that even if their hands or legs are cut they do not realize.’ The Imam said, ‘Glory belongs to Allah. That is from Satan. That is not how believing people are described. It is only softening, tender feelings, a few tears and anxiety.’” Abu Ali al-Ash’ari has narrated from Hassan from abu ‘Imran al-Armani from ‘Abd Allah ibn al-Hakam from Jabir from abu Ja’far (a.s.) a similar Hadith. "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:3:10",
  "kind": "verse_list"
}