{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:2:3",
        "titles": {
          "ar": "كِتَابُ فَضْلِ الْقُرْآنِ",
          "en": "THE BOOK OF MERITS OF THE QURAN"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 11"
        },
        "path": "/books/al-kafi:2:3:11",
        "titles": {
          "ar": "بَابٌ فِي كَمْ يُقْرَأُ الْقُرْآنُ وَ يُخْتَمُ",
          "en": "Chapter 11 – In how much (time) should the Quran be recited and completed"
        }
      }
    ],
    "index": 468,
    "local_index": 11,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:2:3:12",
        "titles": {
          "ar": "بَابُ أَنَّ الْقُرْآنَ يُرْفَعُ كَمَا أُنْزِلَ",
          "en": "Chapter 12 – The Quran would be Raised just as it was Sent down"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 10"
        },
        "path": "/books/al-kafi:2:3:10",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>َابٌ فِيمَنْ يُظْهِرُ</span> الْغَشْيَةَ عِنْدَ قِرَاءَةِ الْقُرْآنِ",
          "en": "Chapter 10 – Regarding the one who manifests the fainting during recitation of the Quran"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:2:3",
        "titles": {
          "ar": "كِتَابُ فَضْلِ الْقُرْآنِ",
          "en": "THE BOOK OF MERITS OF THE QURAN"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:3:11",
    "titles": {
      "ar": "بَابٌ فِي كَمْ يُقْرَأُ الْقُرْآنُ وَ يُخْتَمُ",
      "en": "Chapter 11 – In how much (time) should the Quran be recited and completed"
    },
    "verse_count": 5,
    "verse_start_index": 3524,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق على الظاهر   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/504)"
        ],
        "index": 3525,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/317",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/329",
              "text": "الْحُسَيْنِ بْنِ الْمُخْتَارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/106",
              "text": "مُحَمَّدِ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:11:1",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَقْرَأُ الْقُرْآنَ فِي لَيْلَةٍ قَالَ لَا يُعْجِبُنِي أَنْ تَقْرَأَهُ فِي أَقَلَّ مِنْ شَهْرٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad, from Al Husayn Bin Al Mukhtar, from Muhammad Bin Abdullah who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Can I recite the (whole) Quran in a night?’ He<sup>asws</sup> said: ‘I<sup>asws</sup> do not like it if you were to recite it in less than a month’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Hammad from al-Husayn ibn al-Mukhtar from Muhammad ibn ‘Abd Allah who has said the following: “Once I asked abu ‘Abd Allah (a.s.) ‘Can I read the Holy Quran in one night?’ The Imam said, ‘I do not like your reading it in less than a month’s time.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/504)"
        ],
        "index": 3526,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "بَعْضِ أَصْحَابِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/119",
              "text": "عَلِيِّ بْنِ أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:11:2",
        "text": [
          " دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لَهُ أَبُو بَصِيرٍ جُعِلْتُ فِدَاكَ أَقْرَأُ الْقُرْآنَ فِي شَهْرِ رَمَضَانَ فِي لَيْلَةٍ فَقَالَ لَا قَالَ فَفِي لَيْلَتَيْنِ قَالَ لَا قَالَ فَفِي ثَلَاثٍ قَالَ هَا وَ أَشَارَ بِيَدِهِ ",
          "ثُمَّ قَالَ يَا أَبَا مُحَمَّدٍ إِنَّ لِرَمَضَانَ حَقّاً وَ حُرْمَةً لَا يُشْبِهُهُ شَيْ‏ءٌ مِنَ الشُّهُورِ وَ كَانَ أَصْحَابُ مُحَمَّدٍ ( صلى الله عليه وآله ) يَقْرَأُ أَحَدُهُمُ الْقُرْآنَ فِي شَهْرٍ أَوْ أَقَلَّ إِنَّ الْقُرْآنَ لَا يُقْرَأُ هَذْرَمَةً وَ لَكِنْ يُرَتَّلُ تَرْتِيلًا ",
          "فَإِذَا مَرَرْتَ بِآيَةٍ فِيهَا ذِكْرُ الْجَنَّةِ فَقِفْ عِنْدَهَا وَ سَلِ اللَّهَ عَزَّ وَ جَلَّ الْجَنَّةَ وَ إِذَا مَرَرْتَ بِآيَةٍ فِيهَا ذِكْرُ النَّارِ فَقِفْ عِنْدَهَا وَ تَعَوَّذْ بِاللَّهِ مِنَ النَّارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from one of his companions, from Ali Bin Abu Hamza who said, ",
            "‘I went over to Abu Abdullah<sup>asws</sup>, and Abu Baseer said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Should I recite the (whole) Quran in a Month of Ramazan in a night?’ So he<sup>asws</sup> said: ‘No’. He said, ‘So in two nights?’ He<sup>asws</sup> said: ‘No’. He said, ‘So in three?’ He<sup>asws</sup> said: ‘Ha!’, and gestured by his<sup>asws</sup> hand. ",
            "Then he<sup>asws</sup> said: ‘O Abu Muhammad! For (the Month of) Ramazan there is a right and a sanctity. Nothing resembles it from the (other) months; and it was so that the companions of Muhammad<sup>saww</sup>, one of them would recite the (whole) Quran during a month, or less. The Quran is not to be recited jabbering, but it is to be recited slowly and with clarity (as it ought to be recited). ",
            "So whenever you pass by a Verse wherein is a Mention of the Paradise, so pause at it and ask Allah<sup>azwj</sup> Mighty and Majestic for the Paradise; and whenever you pass by a Verse wherein is Mention of the Fire, so pause at it and seek Refuge with Allah<sup>azwj</sup> from the Fire’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Sahl ibn Ziyad from certain individuals of his people from Ali ibn Hamza who has said the following: “Once I went in the presence of abu ‘Abd Allah (a.s.) and abu Basir said to the Imam, ‘May Allah keep my soul in service for your cause, can I read the Holy Quran in one night in the month of Ramadan?’ The Imam said, ‘No.’ He then asked, ‘Can I read it in two nights?’ The Imam said, ‘No.’ He then asked, ‘Can I read it in three nights?’ The Imam said, ‘Haa’ pointing with his hand meaning, “yes, you can.” The Imam then said, ‘O abu Muhammad, for the month of Ramadan there is respect and rights which is unlike the other months. Among the companions of Muhammad (a.s.) there were those who would read the Holy Quran in one month or less. The Holy Quran is not read in a big rush. It should be read with proper elocution and distinct pronunciations. When you come across a verse that speaks of paradise you should pause and ask Allah, the Most Majestic, the Most Holy, to give it to you and when you come across a verse that speaks of the fire, pause and seek protection with Allah against it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/504)"
        ],
        "index": 3527,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/105",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/259",
              "text": "عَلِيِّ بْنِ النُّعْمَانِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/733",
              "text": "يَعْقُوبَ بْنِ شُعَيْبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2500",
              "text": "حُسَيْنِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ يَعْقُوبَ بْنِ شُعَيْبٍ عَنْ حُسَيْنِ بْنِ خَالِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:11:3",
        "text": [
          " قُلْتُ لَهُ فِي كَمْ أَقْرَأُ الْقُرْآنَ فَقَالَ اقْرَأْهُ أَخْمَاساً اقْرَأْهُ أَسْبَاعاً أَمَا إِنَّ عِنْدِي مُصْحَفاً مُجَزًّى أَرْبَعَةَ عَشَرَ جُزْءاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhamad Bin Al Husayn, from Ali Bin Al Nu’man, from Yaqoub Bin Shuayb, from Husayn Bin Khalid, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘In how much (time) should I recite the (whole) Quran?’ So he<sup>asws</sup> said: ‘Recite it in fifths or sevenths. But, with me<sup>asws</sup> there is a Parchment sectioned upon fourteen parts’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Ali ibn al-Nu’Man from Ya’qub ibn Shu’ayb from Husayn ibn Khalid who has said the following: “Once I asked abu ‘Abd Allah (a.s.) ‘In how many days should one complete reading the Holy Quran?’ The Imam said, ‘You may read it in five or seven days. I, however, have a copy of the Holy Quran that is divided into fourteen parts.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالحسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/505)"
        ],
        "index": 3528,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1639",
              "text": "يَحْيَى بْنِ إِبْرَاهِيمَ بْنِ أَبِي الْبِلَادِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2501",
              "text": "عَلِيِّ بْنِ الْمُغِيرَةِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/373",
              "text": "أَبِي الْحَسَنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ يَحْيَى بْنِ إِبْرَاهِيمَ بْنِ أَبِي الْبِلَادِ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ الْمُغِيرَةِ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:11:4",
        "text": [
          " قُلْتُ لَهُ إِنَّ أَبِي سَأَلَ جَدَّكَ عَنْ خَتْمِ الْقُرْآنِ فِي كُلِّ لَيْلَةٍ فَقَالَ لَهُ جَدُّكَ كُلَّ لَيْلَةٍ فَقَالَ لَهُ فِي شَهْرِ رَمَضَانَ فَقَالَ لَهُ جَدُّكَ فِي شَهْرِ رَمَضَانَ فَقَالَ لَهُ أَبِي نَعَمْ مَا اسْتَطَعْتُ ",
          "فَكَانَ أَبِي يَخْتِمُهُ أَرْبَعِينَ خَتْمَةً فِي شَهْرِ رَمَضَانَ ثُمَّ خَتَمْتُهُ بَعْدَ أَبِي فَرُبَّمَا زِدْتُ وَ رُبَّمَا نَقَصْتُ عَلَى قَدْرِ فَرَاغِي وَ شُغُلِي وَ نَشَاطِي وَ كَسَلِي فَإِذَا كَانَ فِي يَوْمِ الْفِطْرِ جَعَلْتُ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) خَتْمَةً وَ لِعَلِيٍّ ( عليه السلام ) أُخْرَى وَ لِفَاطِمَةَ ( عليها السلام ) أُخْرَى ثُمَّ لِلْأَئِمَّةِ ( عليهم السلام ) حَتَّى انْتَهَيْتُ إِلَيْكَ فَصَيَّرْتُ لَكَ وَاحِدَةً مُنْذُ صِرْتُ فِي هَذَا الْحَالِ فَأَيُّ شَيْ‏ءٍ لِي بِذَلِكَ ",
          "قَالَ لَكَ بِذَلِكَ أَنْ تَكُونَ مَعَهُمْ يَوْمَ الْقِيَامَةِ قُلْتُ اللَّهُ أَكْبَرُ فَلِي بِذَلِكَ قَالَ نَعَمْ ثَلَاثَ مَرَّاتٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Yahya Bin Ibrahim Bin Abu Al Balad, from his father, from Ali Bin Al Mugheira, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘My father asked your<sup>asws</sup> grandfather<sup>asws</sup> about completing the (whole) Quran during every night. So your<sup>asws</sup> grandfather<sup>asws</sup> said to him: ‘Every night?’ So he said to him<sup>asws</sup>, ‘In a Month of Ramazan’. So your<sup>asws</sup> grandfather<sup>asws</sup> said to him: ‘In a Month of Ramazan?’ So my father said to him<sup>asws</sup>, ‘Yes, whatever capacity (I have)’. ",
            "It was so that my father used to complete it, forty completions in a Month of Ramazan. Then I was completing it after my father. So sometimes I would exceed and sometimes I would be deficient, based upon a measurement of my free time, and my occupation, and my activity and my laziness. So whenever it was the day of (Eid) Al-Fitr, I would make one completion to be for Rasool-Allah<sup>saww</sup>, and another one for Ali<sup>asws</sup>, and another for Syeda Fatima<sup>asws</sup>, then another for the Imams<sup>asws</sup> until I would end up with you<sup>asws</sup>. Thus, I have rendered one (completion) to be for you<sup>asws</sup> since I came to be in this state. So which thing would be for me due to that?’ ",
            "He<sup>asws</sup> said: ‘For you, due to that, is that you would happen to be with them<sup>asws</sup> on the Day of Judgment’. I said, ‘Allah<sup>azwj</sup> is the Greatest! So, for me would be that?’ He<sup>asws</sup> said: ‘Yes’, three times’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Yahya ibn Ibrahim ibn abu al-Balad from his father from Ali ibn al- Mughirah who has said the following: “Once I asked abu al-Hassan (a.s.) ‘My father once asked your grandfather about reading all of the Holy Quran in one night.’ ‘(Do you mean it to happen) every night?’ Your grandfather inquired. ‘Yes, in the month of Ramadan.’ My father replied. Your grandfather asked him, ‘In the month of Ramadan?’ My father said, ‘Yes, in the month of Ramadan if I could. ’ My father would read the Holy Quran forty times in the whole month of Ramadan. After my father I would read the Holy Quran sometimes more and sometimes less than he did, as I would get a chance within my work, activities and laziness. On ’id day (after the month of Ramadan) I would assign the reward for reading the Holy Quran once for the Holy prophet, one for Imam Ali, one for Al-Sayyidah Fatimah and one for each Imam until yourself and I assigned the reward for reciting the Holy Quran once for you from the time I am doing this. Will there be anything for me in this? The Imam said, ‘On the Day of Judgment, you will be with them.’ ‘Allah is greater than can be described, this much for me!’ I exclaimed. The Imam (a.s.) said three times, ‘Yes.’” "
          ]
        }
      },
      {
        "index": 3529,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/150",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/119",
              "text": "عَلِيِّ بْنِ أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:11:5",
        "text": [
          " سَأَلَ أَبُو بَصِيرٍ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا حَاضِرٌ فَقَالَ لَهُ جُعِلْتُ فِدَاكَ أَقْرَأُ الْقُرْآنَ فِي لَيْلَةٍ فَقَالَ لَا فَقَالَ فِي لَيْلَتَيْنِ فَقَالَ لَا حَتَّى بَلَغَ سِتَّ لَيَالٍ فَأَشَارَ بِيَدِهِ فَقَالَ هَا ",
          "ثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا أَبَا مُحَمَّدٍ إِنَّ مَنْ كَانَ قَبْلَكُمْ مِنْ أَصْحَابِ مُحَمَّدٍ ( صلى الله عليه وآله ) كَانَ يَقْرَأُ الْقُرْآنَ فِي شَهْرٍ وَ أَقَلَّ إِنَّ الْقُرْآنَ لَا يُقْرَأُ هَذْرَمَةً وَ لَكِنْ يُرَتَّلُ تَرْتِيلًا إِذَا مَرَرْتَ بِآيَةٍ فِيهَا ذِكْرُ النَّارِ وَقَفْتَ عِنْدَهَا وَ تَعَوَّذْتَ بِاللَّهِ مِنَ النَّارِ ",
          "فَقَالَ أَبُو بَصِيرٍ أَقْرَأُ الْقُرْآنَ فِي رَمَضَانَ فِي لَيْلَةٍ فَقَالَ لَا فَقَالَ فِي لَيْلَتَيْنِ فَقَالَ لَا فَقَالَ فِي ثَلَاثٍ فَقَالَ هَا وَ أَوْمَأَ بِيَدِهِ نَعَمْ شَهْرُ رَمَضَانَ لَا يُشْبِهُهُ شَيْ‏ءٌ مِنَ الشُّهُورِ لَهُ حَقٌّ وَ حُرْمَةٌ أَكْثِرْ مِنَ الصَّلَاةِ مَا اسْتَطَعْتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ali Bin Abu Hamza who said, ",
            "‘Abu Baseer asked Abu Abdullah<sup>asws</sup>, and I was present. So he said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Should I recite (the whole) Quran in a night?’ so he<sup>asws</sup> said: ‘No’. So he said, ‘In two nights?’ So he<sup>asws</sup> said: ‘No’. Until it reached six nights. So he<sup>asws</sup> gestured by his<sup>asws</sup> hand, and he<sup>asws</sup> said: ‘Ha!’ ",
            "Then Abu Abdullah<sup>asws</sup> said: ‘O Abu Muhammad! The ones who were before you from the companions of Muhammad<sup>saww</sup> used to recite the (whole) Quran in a month, and less. The Quran is such that it should not be recited by jabbering, but slowly and with clarity (as it ought to be recited). Whenever you pass by a Verse wherein is a Mention of the Fire, pause at it and seek Refuge with Allah<sup>azwj</sup> from the Fire’. ",
            "So Abu Baseer said, ‘Should I recite (the whole) Quran in one night of the Month of Ramazan?’ So he<sup>asws</sup> said: ‘No’. So he said, ‘In two nights?’ So he<sup>asws</sup> said: ‘No’. So he said, ‘In three?’ So he<sup>asws</sup> said: ‘Ha!’, and gestured by his<sup>asws</sup> hand, ‘Yes, the Month of Ramazan is such that nothing resembles it from the (other) months. For it is a right and a sanctity. Frequent from the <span class=\"iTxt\">Salāt</span>, whatever your capacity may be’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Ali ibn abu Hamza who has said the following: “Once, abu Basil’ asked abu ‘Abd Allah (a.s.) when I was also present, ‘May Allah keep my soul in service for your cause, can I read the Holy Quran in one night?’ The Imam said, ‘No.’ He then asked, ‘Can I read it in two nights?’ The Imam said, ‘No,’ until he reached six nights, the Imam (a.s.) made a hand gesture saying ‘Ha’ a,’ (a hint for approval). Then the Imam (a.s.) said, ‘O abu Muhammad, note that among the companions of Muhammad (a.s.) before you, there were those who would read the Holy Quran once in a month or less. The Holy Quran is not read in a big rush but it is read with proper elocution and distinct pronunciation. When you come across a verse that speaks of the fire you pause and ask Allah for protection.’ Abu Basir then asked, ‘Can I read the Holy Quran in the month of Ramadan once every night?’ The Imam said, ‘No.’ He then asked, ‘Can I read it in two nights?’ The Imam said, ‘No.’ He then asked, ‘Can I read it in three nights?’ The Imam said, ‘Ha’ a, ’ with a hand gesture for approval saying, ‘Yes, the month of Ramadan is not like the other months. It has its rights and respect. Increase in prayer as much as you can.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:3:11",
  "kind": "verse_list"
}