{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:2:3", "titles": {"ar": "كِتَابُ فَضْلِ الْقُرْآنِ", "en": "THE BOOK OF MERITS OF THE QURAN"}}, {"indexed_titles": {"en": "Chapter 11"}, "path": "/books/al-kafi:2:3:11", "titles": {"ar": "بَابٌ فِي كَمْ يُقْرَأُ الْقُرْآنُ وَ يُخْتَمُ", "en": "Chapter 11 – In how much (time) should the Quran be recited and completed"}}], "index": 468, "local_index": 11, "part_type": "Chapter", "path": "/books/al-kafi:2:3:11", "titles": {"ar": "بَابٌ فِي كَمْ يُقْرَأُ الْقُرْآنُ وَ يُخْتَمُ", "en": "Chapter 11 – In how much (time) should the Quran be recited and completed"}, "verse_count": 5, "verse_start_index": 3524, "verses": [{"index": 3525, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:3:11:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَقْرَأُ الْقُرْآنَ فِي لَيْلَةٍ قَالَ لَا يُعْجِبُنِي أَنْ تَقْرَأَهُ فِي أَقَلَّ مِنْ شَهْرٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Hammad, from Al Husayn Bin Al Mukhtar, from Muhammad Bin Abdullah who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘Can I recite the (whole) Quran in a night?’ He<sup>asws</sup> said: ‘I<sup>asws</sup> do not like it if you were to recite it in less than a month’."}]}, {"index": 3526, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:3:11:2", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لَهُ أَبُو بَصِيرٍ جُعِلْتُ فِدَاكَ أَقْرَأُ الْقُرْآنَ فِي شَهْرِ رَمَضَانَ فِي لَيْلَةٍ فَقَالَ لَا قَالَ فَفِي لَيْلَتَيْنِ قَالَ لَا قَالَ فَفِي ثَلَاثٍ قَالَ هَا وَ أَشَارَ بِيَدِهِ \nثُمَّ قَالَ يَا أَبَا مُحَمَّدٍ إِنَّ لِرَمَضَانَ حَقّاً وَ حُرْمَةً لَا يُشْبِهُهُ شَيْ‏ءٌ مِنَ الشُّهُورِ وَ كَانَ أَصْحَابُ مُحَمَّدٍ ( صلى الله عليه وآله ) يَقْرَأُ أَحَدُهُمُ الْقُرْآنَ فِي شَهْرٍ أَوْ أَقَلَّ إِنَّ الْقُرْآنَ لَا يُقْرَأُ هَذْرَمَةً وَ لَكِنْ يُرَتَّلُ تَرْتِيلًا \nفَإِذَا مَرَرْتَ بِآيَةٍ فِيهَا ذِكْرُ الْجَنَّةِ فَقِفْ عِنْدَهَا وَ سَلِ اللَّهَ عَزَّ وَ جَلَّ الْجَنَّةَ وَ إِذَا مَرَرْتَ بِآيَةٍ فِيهَا ذِكْرُ النَّارِ فَقِفْ عِنْدَهَا وَ تَعَوَّذْ بِاللَّهِ مِنَ النَّارِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from one of his companions, from Ali Bin Abu Hamza who said, \n‘I went over to Abu Abdullah<sup>asws</sup>, and Abu Baseer said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Should I recite the (whole) Quran in a Month of Ramazan in a night?’ So he<sup>asws</sup> said: ‘No’. He said, ‘So in two nights?’ He<sup>asws</sup> said: ‘No’. He said, ‘So in three?’ He<sup>asws</sup> said: ‘Ha!’, and gestured by his<sup>asws</sup> hand. \nThen he<sup>asws</sup> said: ‘O Abu Muhammad! For (the Month of) Ramazan there is a right and a sanctity. Nothing resembles it from the (other) months; and it was so that the companions of Muhammad<sup>saww</sup>, one of them would recite the (whole) Quran during a month, or less. The Quran is not to be recited jabbering, but it is to be recited slowly and with clarity (as it ought to be recited). \nSo whenever you pass by a Verse wherein is a Mention of the Paradise, so pause at it and ask Allah<sup>azwj</sup> Mighty and Majestic for the Paradise; and whenever you pass by a Verse wherein is Mention of the Fire, so pause at it and seek Refuge with Allah<sup>azwj</sup> from the Fire’."}]}, {"index": 3527, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:2:3:11:3", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ يَعْقُوبَ بْنِ شُعَيْبٍ عَنْ حُسَيْنِ بْنِ خَالِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ فِي كَمْ أَقْرَأُ الْقُرْآنَ فَقَالَ اقْرَأْهُ أَخْمَاساً اقْرَأْهُ أَسْبَاعاً أَمَا إِنَّ عِنْدِي مُصْحَفاً مُجَزًّى أَرْبَعَةَ عَشَرَ جُزْءاً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhamad Bin Al Husayn, from Ali Bin Al Nu’man, from Yaqoub Bin Shuayb, from Husayn Bin Khalid, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘In how much (time) should I recite the (whole) Quran?’ So he<sup>asws</sup> said: ‘Recite it in fifths or sevenths. But, with me<sup>asws</sup> there is a Parchment sectioned upon fourteen parts’."}]}, {"index": 3528, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:2:3:11:4", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ يَحْيَى بْنِ إِبْرَاهِيمَ بْنِ أَبِي الْبِلَادِ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ الْمُغِيرَةِ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ قُلْتُ لَهُ إِنَّ أَبِي سَأَلَ جَدَّكَ عَنْ خَتْمِ الْقُرْآنِ فِي كُلِّ لَيْلَةٍ فَقَالَ لَهُ جَدُّكَ كُلَّ لَيْلَةٍ فَقَالَ لَهُ فِي شَهْرِ رَمَضَانَ فَقَالَ لَهُ جَدُّكَ فِي شَهْرِ رَمَضَانَ فَقَالَ لَهُ أَبِي نَعَمْ مَا اسْتَطَعْتُ \nفَكَانَ أَبِي يَخْتِمُهُ أَرْبَعِينَ خَتْمَةً فِي شَهْرِ رَمَضَانَ ثُمَّ خَتَمْتُهُ بَعْدَ أَبِي فَرُبَّمَا زِدْتُ وَ رُبَّمَا نَقَصْتُ عَلَى قَدْرِ فَرَاغِي وَ شُغُلِي وَ نَشَاطِي وَ كَسَلِي فَإِذَا كَانَ فِي يَوْمِ الْفِطْرِ جَعَلْتُ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) خَتْمَةً وَ لِعَلِيٍّ ( عليه السلام ) أُخْرَى وَ لِفَاطِمَةَ ( عليها السلام ) أُخْرَى ثُمَّ لِلْأَئِمَّةِ ( عليهم السلام ) حَتَّى انْتَهَيْتُ إِلَيْكَ فَصَيَّرْتُ لَكَ وَاحِدَةً مُنْذُ صِرْتُ فِي هَذَا الْحَالِ فَأَيُّ شَيْ‏ءٍ لِي بِذَلِكَ \nقَالَ لَكَ بِذَلِكَ أَنْ تَكُونَ مَعَهُمْ يَوْمَ الْقِيَامَةِ قُلْتُ اللَّهُ أَكْبَرُ فَلِي بِذَلِكَ قَالَ نَعَمْ ثَلَاثَ مَرَّاتٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Yahya Bin Ibrahim Bin Abu Al Balad, from his father, from Ali Bin Al Mugheira, \n(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘My father asked your<sup>asws</sup> grandfather<sup>asws</sup> about completing the (whole) Quran during every night. So your<sup>asws</sup> grandfather<sup>asws</sup> said to him: ‘Every night?’ So he said to him<sup>asws</sup>, ‘In a Month of Ramazan’. So your<sup>asws</sup> grandfather<sup>asws</sup> said to him: ‘In a Month of Ramazan?’ So my father said to him<sup>asws</sup>, ‘Yes, whatever capacity (I have)’. \nIt was so that my father used to complete it, forty completions in a Month of Ramazan. Then I was completing it after my father. So sometimes I would exceed and sometimes I would be deficient, based upon a measurement of my free time, and my occupation, and my activity and my laziness. So whenever it was the day of (Eid) Al-Fitr, I would make one completion to be for Rasool-Allah<sup>saww</sup>, and another one for Ali<sup>asws</sup>, and another for Syeda Fatima<sup>asws</sup>, then another for the Imams<sup>asws</sup> until I would end up with you<sup>asws</sup>. Thus, I have rendered one (completion) to be for you<sup>asws</sup> since I came to be in this state. So which thing would be for me due to that?’ \nHe<sup>asws</sup> said: ‘For you, due to that, is that you would happen to be with them<sup>asws</sup> on the Day of Judgment’. I said, ‘Allah<sup>azwj</sup> is the Greatest! So, for me would be that?’ He<sup>asws</sup> said: ‘Yes’, three times’."}]}, {"index": 3529, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:2:3:11:5", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ سَأَلَ أَبُو بَصِيرٍ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا حَاضِرٌ فَقَالَ لَهُ جُعِلْتُ فِدَاكَ أَقْرَأُ الْقُرْآنَ فِي لَيْلَةٍ فَقَالَ لَا فَقَالَ فِي لَيْلَتَيْنِ فَقَالَ لَا حَتَّى بَلَغَ سِتَّ لَيَالٍ فَأَشَارَ بِيَدِهِ فَقَالَ هَا \nثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا أَبَا مُحَمَّدٍ إِنَّ مَنْ كَانَ قَبْلَكُمْ مِنْ أَصْحَابِ مُحَمَّدٍ ( صلى الله عليه وآله ) كَانَ يَقْرَأُ الْقُرْآنَ فِي شَهْرٍ وَ أَقَلَّ إِنَّ الْقُرْآنَ لَا يُقْرَأُ هَذْرَمَةً وَ لَكِنْ يُرَتَّلُ تَرْتِيلًا إِذَا مَرَرْتَ بِآيَةٍ فِيهَا ذِكْرُ النَّارِ وَقَفْتَ عِنْدَهَا وَ تَعَوَّذْتَ بِاللَّهِ مِنَ النَّارِ \nفَقَالَ أَبُو بَصِيرٍ أَقْرَأُ الْقُرْآنَ فِي رَمَضَانَ فِي لَيْلَةٍ فَقَالَ لَا فَقَالَ فِي لَيْلَتَيْنِ فَقَالَ لَا فَقَالَ فِي ثَلَاثٍ فَقَالَ هَا وَ أَوْمَأَ بِيَدِهِ نَعَمْ شَهْرُ رَمَضَانَ لَا يُشْبِهُهُ شَيْ‏ءٌ مِنَ الشُّهُورِ لَهُ حَقٌّ وَ حُرْمَةٌ أَكْثِرْ مِنَ الصَّلَاةِ مَا اسْتَطَعْتَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ali Bin Abu Hamza who said, \n‘Abu Baseer asked Abu Abdullah<sup>asws</sup>, and I was present. So he said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Should I recite (the whole) Quran in a night?’ so he<sup>asws</sup> said: ‘No’. So he said, ‘In two nights?’ So he<sup>asws</sup> said: ‘No’. Until it reached six nights. So he<sup>asws</sup> gestured by his<sup>asws</sup> hand, and he<sup>asws</sup> said: ‘Ha!’ \nThen Abu Abdullah<sup>asws</sup> said: ‘O Abu Muhammad! The ones who were before you from the companions of Muhammad<sup>saww</sup> used to recite the (whole) Quran in a month, and less. The Quran is such that it should not be recited by jabbering, but slowly and with clarity (as it ought to be recited). Whenever you pass by a Verse wherein is a Mention of the Fire, pause at it and seek Refuge with Allah<sup>azwj</sup> from the Fire’. \nSo Abu Baseer said, ‘Should I recite (the whole) Quran in one night of the Month of Ramazan?’ So he<sup>asws</sup> said: ‘No’. So he said, ‘In two nights?’ So he<sup>asws</sup> said: ‘No’. So he said, ‘In three?’ So he<sup>asws</sup> said: ‘Ha!’, and gestured by his<sup>asws</sup> hand, ‘Yes, the Month of Ramazan is such that nothing resembles it from the (other) months. For it is a right and a sanctity. Frequent from the <span class=\"iTxt\">Salāt</span>, whatever your capacity may be’."}]}]}, "index": "al-kafi:2:3:11", "kind": "verse_list"}