{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:2:3",
        "titles": {
          "ar": "كِتَابُ فَضْلِ الْقُرْآنِ",
          "en": "THE BOOK OF MERITS OF THE QURAN"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 2"
        },
        "path": "/books/al-kafi:2:3:2",
        "titles": {
          "ar": "بَابُ فَضْلِ حَامِلِ الْقُرْآنِ",
          "en": "Chapter 2 – Merits of the bearers (memorisers) of the Quran"
        }
      }
    ],
    "index": 459,
    "local_index": 2,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:2:3:3",
        "titles": {
          "ar": "بَابُ مَنْ يَتَعَلَّمُ الْقُرْآنَ بِمَشَقَّةٍ",
          "en": "Chapter 3 – The one who learns the Quran with difficulty"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 1"
        },
        "path": "/books/al-kafi:2:3:1",
        "titles": {
          "en": "Chapter 1 – A Chapter"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:2:3",
        "titles": {
          "ar": "كِتَابُ فَضْلِ الْقُرْآنِ",
          "en": "THE BOOK OF MERITS OF THE QURAN"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:3:2",
    "titles": {
      "ar": "بَابُ فَضْلِ حَامِلِ الْقُرْآنِ",
      "en": "Chapter 2 – Merits of the bearers (memorisers) of the Quran"
    },
    "verse_count": 11,
    "verse_start_index": 3473,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/485)"
        ],
        "index": 3474,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/103",
              "text": "الْحَسَنِ بْنِ أَبِي الْحُسَيْنِ الْفَارِسِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/178",
              "text": "سُلَيْمَانَ بْنِ جَعْفَرٍ الْجَعْفَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/39",
              "text": "السَّكُونِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ أَبِي الْحُسَيْنِ الْفَارِسِيِّ عَنْ سُلَيْمَانَ بْنِ جَعْفَرٍ الْجَعْفَرِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:2:1",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ أَهْلَ الْقُرْآنِ فِي أَعْلَى دَرَجَةٍ مِنَ الْآدَمِيِّينَ مَا خَلَا النَّبِيِّينَ وَ الْمُرْسَلِينَ فَلَا تَسْتَضْعِفُوا أَهْلَ الْقُرْآنِ حُقُوقَهُمْ فَإِنَّ لَهُمْ مِنَ اللَّهِ الْعَزِيزِ الْجَبَّارِ لَمَكَاناً عَلِيّاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Hassan Bin Abu Al Husayn Al Farsy, from Suleyman Bin Ja’far Al Ja’fary, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The people of the Quran would be in the highest Levels from the human beings except for the Prophets<sup>as</sup> and the <span class=\"iTxt\">Mursil</span>s Prophets<sup>as</sup>. Therefore, you should not consider them weaken in the matter of their rights, for there is for them, from Allah<sup>azwj</sup> the Mighty, the Compeller, a lofty position’’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from al-Hassan ibn abu al-Husayn al-Farsi from Sulayman ibn Ja’far from his father al-Ja’fari from al-Sakuni from abu ‘Abd Allah (a.s.) who has said the following: ‘‘The Messenger of Allah has said, ‘People of the Holy Quran are of the highest degree among men, except the prophets and the messengers of Allah, thus, you should not consider them weak in the matters of their rights; with Allah, the Most Majestic, the Almighty, they have a special status.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/485)"
        ],
        "index": 3475,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "جَمِيلِ بْنِ صَالِحٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/413",
              "text": "الْفُضَيْلِ بْنِ يَسَارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:2:2",
        "text": [
          " الْحَافِظُ لِلْقُرْآنِ الْعَامِلُ بِهِ مَعَ السَّفَرَةِ الْكِرَامِ الْبَرَرَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, and Sahl Bin Ziyad, altogether from Ibn Mahboub, from Jameel Bin Salih, from Al Fuzayl Bin Yasaar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The memoriser of the Quran, the one acting by it, would be with the Ambassadors (<span class=\"iTxt\">Mursil</span> Prophets<sup>as</sup>), the honourable, the righteous’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad from Sahl ibn Ziyad all from ibn Mahbub from Jamil ibn Salih from al-Fudayl ibn Yasar from abu ‘Abd Allah (a.s.) who has said the following: ‘‘One who has memorized the Holy Quran and follows its laws will be with the honorable angels who carry Allah’s messages.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/485)"
        ],
        "index": 3476,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1681",
              "text": "وَ بِإِسْنَادِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِإِسْنَادِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:2:3",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) تَعَلَّمُوا الْقُرْآنَ فَإِنَّهُ يَأْتِي يَوْمَ الْقِيَامَةِ صَاحِبَهُ فِي صُورَةِ شَابٍّ جَمِيلٍ شَاحِبِ اللَّوْنِ فَيَقُولُ لَهُ الْقُرْآنُ أَنَا الَّذِي كُنْتُ أَسْهَرْتُ لَيْلَكَ وَ أَظْمَأْتُ هَوَاجِرَكَ وَ أَجْفَفْتُ رِيقَكَ وَ أَسَلْتُ دَمْعَتَكَ أَؤُولُ مَعَكَ حَيْثُمَا أُلْتَ وَ كُلُّ تَاجِرٍ مِنْ وَرَاءِ تِجَارَتِهِ وَ أَنَا الْيَوْمَ لَكَ مِنْ وَرَاءِ تِجَارَةِ كُلِّ تَاجِرٍ وَ سَيَأْتِيكَ كَرَامَةٌ مِنَ اللَّهِ عَزَّ وَ جَلَّ فَأَبْشِرْ فَيُؤْتَى بِتَاجٍ فَيُوضَعُ عَلَى رَأْسِهِ ",
          "وَ يُعْطَى الْأَمَانَ بِيَمِينِهِ وَ الْخُلْدَ فِي الْجِنَانِ بِيَسَارِهِ وَ يُكْسَى حُلَّتَيْنِ ثُمَّ يُقَالُ لَهُ اقْرَأْ وَ ارْقَهْ فَكُلَّمَا قَرَأَ آيَةً صَعِدَ دَرَجَةً وَ يُكْسَى أَبَوَاهُ حُلَّتَيْنِ إِنْ كَانَا مُؤْمِنَيْنِ ثُمَّ يُقَالُ لَهُمَا هَذَا لِمَا عَلَّمْتُمَاهُ الْقُرْآنَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by his chain, from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Learn the Quran, for it would be coming on the Day of Judgment to its companion in an image of a beautiful youth, radiant, and the Quran would be saying to him: ‘I am the one whom you held a vigil during your night, and your mouth was thirsty, and dried your throat, and your tears flowed. I shall be with you wherever you go to; and every trader is behind his trade, and I am for you today, from behind a trade with every trader, and there shall be coming to you, a Prestige from Allah<sup>azwj</sup> Mighty and Majestic. Therefore, receive glad tidings, for you would be Given a crown upon your head’. ",
            "And he would be Given the (deed of) security in his right hand, and the (deed of) eternal life in the Gardens in his left hand, and he would be Clothed in two garments. Then it would be said to him: ‘Recite and ascend. So every time he recites a Verse, he would ascend a level. And his parents would be Clothed by two Garments, if he was a Momin. Then it would be said to both of them: ‘This is due to both of you teaching him (your son) the Quran’’."
          ],
          "en.sarwar": [
            "3. Through the same chain of narrators it is narrated from abu ‘Abd Allah (a.s.) who has said the following: ‘‘The Messenger of Allah has said, ‘Learn the Holy Quran; on the Day of Judgment it will come to his friends in the form of a most beautiful young person of pale complexion and will speak to his friend saying, “I am the Quran for which you kept awake so often and endured thirst during the heat of midday, dried up your mouth and let your tears flow. I will be with you whenever you will go. Every trader is after his trade. Today I look after the trade of everyone who had a deal with me. Honor will come to you from Allah, the Most Majestic, the Most Holy, as good news for you. The man will receive a crown and peace will be placed on his right hand and eternal life in paradise in his left hand and he will be dressed with two dresses of paradise, then he will be told, ‘Read and climb.’ For each verse that he will read he will climb up one degree and his parents, if they are of the believers, will each receive two dresses of paradise and they will be told that this is for your teaching the Holy Quran to your child.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/486)"
        ],
        "index": 3477,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1349",
              "text": "ابْنُ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1691",
              "text": "مَالِكِ بْنِ عَطِيَّةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2471",
              "text": "مِنْهَالٍ الْقَصَّابِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "ابْنُ مَحْبُوبٍ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ مِنْهَالٍ الْقَصَّابِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:2:4",
        "text": [
          " مَنْ قَرَأَ الْقُرْآنَ وَ هُوَ شَابٌّ مُؤْمِنٌ اخْتَلَطَ الْقُرْآنُ بِلَحْمِهِ وَ دَمِهِ وَ جَعَلَهُ اللَّهُ عَزَّ وَ جَلَّ مَعَ السَّفَرَةِ الْكِرَامِ الْبَرَرَةِ وَ كَانَ الْقُرْآنُ حَجِيزاً عَنْهُ يَوْمَ الْقِيَامَةِ يَقُولُ يَا رَبِّ إِنَّ كُلَّ عَامِلٍ قَدْ أَصَابَ أَجْرَ عَمَلِهِ غَيْرَ عَامِلِي فَبَلِّغْ بِهِ أَكْرَمَ عَطَايَاكَ ",
          "قَالَ فَيَكْسُوهُ اللَّهُ الْعَزِيزُ الْجَبَّارُ حُلَّتَيْنِ مِنْ حُلَلِ الْجَنَّةِ وَ يُوضَعُ عَلَى رَأْسِهِ تَاجُ الْكَرَامَةِ ثُمَّ يُقَالُ لَهُ هَلْ أَرْضَيْنَاكَ فِيهِ فَيَقُولُ الْقُرْآنُ يَا رَبِّ قَدْ كُنْتُ أَرْغَبُ لَهُ فِيمَا هُوَ أَفْضَلُ مِنْ هَذَا فَيُعْطَى الْأَمْنَ بِيَمِينِهِ وَ الْخُلْدَ بِيَسَارِهِ ",
          "ثُمَّ يَدْخُلُ الْجَنَّةَ فَيُقَالُ لَهُ اقْرَأْ وَ اصْعَدْ دَرَجَةً ثُمَّ يُقَالُ لَهُ هَلْ بَلَغْنَا بِهِ وَ أَرْضَيْنَاكَ فَيَقُولُ نَعَمْ ",
          "قَالَ وَ مَنْ قَرَأَهُ كَثِيراً وَ تَعَاهَدَهُ بِمَشَقَّةٍ مِنْ شِدَّةِ حِفْظِهِ أَعْطَاهُ اللَّهُ عَزَّ وَ جَلَّ أَجْرَ هَذَا مَرَّتَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Mahboub, from Malik Bin Atiyya, from Minhal Al Qassab, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who recites the Quran and he is a <span class=\"iTxt\">Momin</span> youth, the Quran would blend with his flesh and his blood, and Allah<sup>azwj</sup> Mighty and Majestic would Make him to be with the Ambassadors (<span class=\"iTxt\">Mursil</span> Prophets<sup>as</sup>), the honourable, the righteous; and it would be so that the Quran would be concerned about him on the Day of Judgment, saying: ‘O Lord<sup>azwj</sup>! Every worker has attained a Recompense apart from my worker, therefore let him reach the most prestigious of Your<sup>azwj</sup> Gifts’. ",
            "He<sup>asws</sup> said: ‘So Allah<sup>azwj</sup> the Mighty, the Compeller would Clothe him with two garments of the Paradise and Place a crown of honour upon his head. The He<sup>azwj</sup> would Say to him (The Quran): “Have I please you with regards to him?” So the Quran would be saying: ‘O Lord<sup>azwj</sup>! I used to wish for him regarding what is superior than this, therefore Grant the (deed of) security in his right hand, and the (deed of) eternal life in his left hand’. ",
            "Then he would enter the Paradise, so it would be said to him: ‘Recite and ascend a level’. The He<sup>azwj</sup> would Say to him: “Have We<sup>azwj</sup> Made him reach it and Please you?” So he (the Quran) would be saying: ‘Yes’. ",
            "He<sup>asws</sup> said: ‘And the one who recites it a lot and approaches it with laboriousness (difficulty) from the difficulties of memorising it, Allah<sup>azwj</sup> Mighty and Majestic would Give him the Recompense of this, twice’."
          ],
          "en.sarwar": [
            "4. Ibn Mahbub has narrated from Malik ibn ‘Atiyyah from Minhal al-Qassab from abu ‘Abd Allah (a.s.) who has said the following: “If a young believing person reads the Holy Quran, it mixes with his flesh and blood. Allah, the Most Majestic, the Most Holy, will include him among the honorable and virtuous carriers of the message of Allah and on the Day of Judgment the Holy Quran will be his supporter. The Holy Quran will say, ‘O Lord, every worker has received the reward for his deeds except my worker. Provide him the most honorable reward.’ Allah will then dress him with two dresses of paradise and crown him with the crown of honor and then ask the Holy Quran, ‘Did We make you happy?’ The Holy Quran will say, ‘Lord, I wished for him better than this.’ Allah will then give peace in his right hand, eternity in his left hand and will say to him read from the Holy Quran one verse and go one degree higher. Then the Holy Quran is asked again, ‘Did we reward him good and make you happy?’ The Holy Quran will say, ‘Yes, Lord.’ “The Imam said, ‘If one reads the Holy Quran very often and faces difficulties to memorize it due to weaker memory, Allah will give him twice as much reward.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/486)"
        ],
        "index": 3478,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/576",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2472",
              "text": "الْحَسَنِ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1565",
              "text": "حُمَيْدُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/748",
              "text": "الْخَشَّابِ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2473",
              "text": "الْحَسَنِ بْنِ عَلِيِّ بْنِ يُوسُفَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1698",
              "text": "مُعَاذِ بْنِ ثَابِتٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1689",
              "text": "عَمْرِو بْنِ جُمَيْعٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ وَ حُمَيْدُ بْنُ زِيَادٍ عَنِ الْخَشَّابِ جَمِيعاً عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ يُوسُفَ عَنْ مُعَاذِ بْنِ ثَابِتٍ عَنْ عَمْرِو بْنِ جُمَيْعٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:2:5",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ أَحَقَّ النَّاسِ بِالتَّخَشُّعِ فِي السِّرِّ وَ الْعَلَانِيَةِ لَحَامِلُ الْقُرْآنِ وَ إِنَّ أَحَقَّ النَّاسِ فِي السِّرِّ وَ الْعَلَانِيَةِ بِالصَّلَاةِ وَ الصَّوْمِ لَحَامِلُ الْقُرْآنِ ",
          "ثُمَّ نَادَى بِأَعْلَى صَوْتِهِ يَا حَامِلَ الْقُرْآنِ تَوَاضَعْ بِهِ يَرْفَعْكَ اللَّهُ وَ لَا تَعَزَّزْ بِهِ فَيُذِلَّكَ اللَّهُ يَا حَامِلَ الْقُرْآنِ تَزَيَّنْ بِهِ لِلَّهِ يُزَيِّنْكَ اللَّهُ بِهِ وَ لَا تَزَيَّنْ بِهِ لِلنَّاسِ فَيَشِينَكَ اللَّهُ بِهِ ",
          "مَنْ خَتَمَ الْقُرْآنَ فَكَأَنَّمَا أُدْرِجَتِ النُّبُوَّةُ بَيْنَ جَنْبَيْهِ وَ لَكِنَّهُ لَا يُوحَى إِلَيْهِ وَ مَنْ جَمَعَ الْقُرْآنَ فَنَوْلُهُ لَا يَجْهَلُ مَعَ مَنْ يَجْهَلُ عَلَيْهِ وَ لَا يَغْضَبُ فِيمَنْ يَغْضَبُ عَلَيْهِ وَ لَا يَحِدُّ فِيمَنْ يَحِدُّ وَ لَكِنَّهُ يَعْفُو وَ يَصْفَحُ وَ يَغْفِرُ وَ يَحْلُمُ لِتَعْظِيمِ الْقُرْآنِ ",
          "وَ مَنْ أُوتِيَ الْقُرْآنَ فَظَنَّ أَنَّ أَحَداً مِنَ النَّاسِ أُوتِيَ أَفْضَلَ مِمَّا أُوتِيَ فَقَدْ عَظَّمَ مَا حَقَّرَ اللَّهُ وَ حَقَّرَ مَا عَظَّمَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al-Ashary, from Al Hassan Bin Ali Bin Abdullah, and Humeyd Bin Ziyad, from Al Khashaab, altogether from Al Hassan Bin Ali Bin Yusuf, from Muaz Bin Sabit, from Amro Bin Jumie, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The most rightful of the people with the humbleness in the private and public, is for the bearer (memoriser) of the Quran; and the mort rightful of the people in the private and public with the <span class=\"iTxt\">Salāt</span> and the Fasting, is for the bearer (memoriser) of the Quran’. ",
            "Then he<sup>saww</sup> called out in a raised voice: ‘O bearer of the Quran! Be humble with it, Allah<sup>azwj</sup> would Raise you, and do not be bold with it for Allah<sup>azwj</sup> would Disgrace you. If you adorn with it for the Sake of Allah<sup>azwj</sup>, Allah<sup>azwj</sup> would Adorn you with it, and do not adorn with it for the people, for Allah<sup>azwj</sup> would Discredit you with it. ",
            "The one who completes the Quran, so it is as if he has inserted the Prophet-hood between his two sides, but there is no Revelation (coming) to him; and the one who collects the Quran, so his Conferment is that he would not be ignorant along with the ones who are ignorant upon it, nor would he be angered regarding the one who would be angered upon him, nor would he be irritable regarding the one who irritates him, but he would be pardoning, and excusing, and forgiving, and forbearing due to the reverence of the Quran.",
            "And the one who has been Given the Quran, if he thinks that anyone else from the people has been Given (anything) more superior than what he has been Given, so he has magnified what Allah<sup>azwj</sup> has Belittled, and belittled what Allah<sup>azwj</sup> has Magnified’."
          ],
          "en.sarwar": [
            "5. Abu Ali al-Ash’ari has narrated from al-Hassan ibn Ali ibn Yusuf from ibn Thabit from ‘Amr ibn Jami’ from abu ‘Abd Allah (a.s.) who has said the following: “The Messenger of Allah has said, ‘The one expected to be the most humble in private and in public is the carrier of the Holy Quran, the one expected the most to perform prayer and fast in private and in public is the carrier of the Holy Quran. Then he called out loud, “O carrier of the Holy Quran, beautify with the Holy Quran for the sake of Allah, Allah will beautify you with it, do not beautify with it for the sake of people; Allah for this will cause you to be shunned. Whoever completes the Holy Quran, it is as if he has saved prophet-hood between his two sides, only divine revelation does not come to him. Whoever collects the Holy Quran has gained handsomely, thus, he toward one who behaves toward him ignorantly, does behave as such, with one who behaves toward him with anger, he does not do as such, and with one who behaves toward him irritably, he does not do so, however, he pardons, ignores, forgives, bears patiently out of respect for the Holy Quran. If one who has received the Holy Quran thinks that what others have received is better than what he has received, he has given significance to what Allah is has made worthless and has considered as worthless what Allah has given greatness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/487)"
        ],
        "index": 3479,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/576",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2472",
              "text": "الْحَسَنِ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/728",
              "text": "عُبَيْسِ بْنِ هِشَامٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ عَنْ عُبَيْسِ بْنِ هِشَامٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:2:6",
        "text": [
          " حَدَّثَنَا صَالِحٌ الْقَمَّاطُ عَنْ أَبَانِ بْنِ تَغْلِبَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ النَّاسُ أَرْبَعَةٌ فَقُلْتُ جُعِلْتُ فِدَاكَ وَ مَا هُمْ فَقَالَ رَجُلٌ أُوتِيَ الْإِيمَانَ وَ لَمْ يُؤْتَ الْقُرْآنَ وَ رَجُلٌ أُوتِيَ الْقُرْآنَ وَ لَمْ يُؤْتَ الْإِيمَانَ وَ رَجُلٌ أُوتِيَ الْقُرْآنَ وَ أُوتِيَ الْإِيمَانَ وَ رَجُلٌ لَمْ يُؤْتَ الْقُرْآنَ وَ لَا الْإِيمَانَ ",
          "قَالَ قُلْتُ جُعِلْتُ فِدَاكَ فَسِّرْ لِي حَالَهُمْ فَقَالَ أَمَّا الَّذِي أُوتِيَ الْإِيمَانَ وَ لَمْ يُؤْتَ الْقُرْآنَ فَمَثَلُهُ كَمَثَلِ التَّمْرَةِ طَعْمُهَا حُلْوٌ وَ لَا رِيحَ لَهَا وَ أَمَّا الَّذِي أُوتِيَ الْقُرْآنَ وَ لَمْ يُؤْتَ الْإِيمَانَ فَمَثَلُهُ كَمَثَلِ الْآسِ رِيحُهَا طَيِّبٌ وَ طَعْمُهَا مُرٌّ وَ أَمَّا مَنْ أُوتِيَ الْقُرْآنَ وَ الْإِيمَانَ فَمَثَلُهُ كَمَثَلِ الْأُتْرُجَّةِ رِيحُهَا طَيِّبٌ وَ طَعْمُهَا طَيِّبٌ وَ أَمَّا الَّذِي لَمْ يُؤْتَ الْإِيمَانَ وَ لَا الْقُرْآنَ فَمَثَلُهُ كَمَثَلِ الْحَنْظَلَةِ طَعْمُهَا مُرٌّ وَ لَا رِيحَ لَهَا."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Asjary, from Al Hassan Bin Ali Bin Abdullah, from Ubeys Bin Hisham who said, ‘Salih Al Qammat narrated to us, from Aban Bin Taghlub, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The people are four (types)’. So I said, ‘May I be sacrificed for you<sup>asws</sup>! And what (types) are they?’ So he<sup>asws</sup> said: ‘A man Given the <span class=\"iTxt\">Eman</span> and not been Given the Quran; and a man Given the Quran and not been Given the <span class=\"iTxt\">Eman</span>; and a man Given the Quran and Given the <span class=\"iTxt\">Eman</span>; and a man not Given the Quran nor the <span class=\"iTxt\">Eman</span>’. ",
            "He (the narrator) said, ‘I said, ‘May I be sacrificed for you<sup>asws</sup>! Explain their states to me’. So he<sup>asws</sup> said: ‘As for the one Given the <span class=\"iTxt\">Eman</span> and not been Given the Quran, so his example it like an example of the date. Its taste is sweet, but there is no aroma for it. And as for the one Given the Quran and not Given the <span class=\"iTxt\">Eman</span>, so his example is like an example of the myrtle. Its smell is aromatic and its taste is bitter. And as for the one Given the Quran and the <span class=\"iTxt\">Eman</span>, so his example it like an example of the citrus. Its smell is aromatic and its taste is good. And as for the one neither Given the <span class=\"iTxt\">Eman</span> nor the Quran, so his example is like an example of the colocynth, its taste is bitter and there is no (aromatic) smell to it’."
          ],
          "en.sarwar": [
            "6. Abu Ali al-Ash’ari has narrated from al-Hassan ibn Ali ibn ‘Abd Allah from ‘Ubays ibn Hisham who has said that Salih ibn al-Qammat has narrated from Aban ibn Taghlib has narrated from abu ‘Abd Allah (a.s.) who has said the following: “People are of four kinds. I (the narrator) then asked, ‘May Allah keep my soul in service for your cause, who are they?’ The Imam said, ‘A man who has received belief but not the Holy Quran, a man who has received the Holy Quran but not belief, a man who has received both belief and the Holy Quran and a man who has received none of then.’ I (the narrator) then said, ‘May Allah keep my soul in service for your cause, explain it to me.’ The Imam said, ‘The one who has received belief but not the Holy Quran is like a fruit that is sweet but has no aroma, the one who has received the Holy Quran but not belief is like pears that has a sweet fragrance but tastes bitter. The one who has received both the Holy Quran and belief is like citrus that tastes sweet and has a sweet fragrance. The one who has received neither the Holy Quran nor belief is like Hanzal (a bitter tasting fruit of a plant that tastes bitter and smells bitter).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/487)"
        ],
        "index": 3480,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/230",
              "text": "عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/163",
              "text": "الْقَاسِمِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1713",
              "text": "سُلَيْمَانَ بْنِ دَاوُدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/193",
              "text": "سُفْيَانَ بْنِ عُيَيْنَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1845",
              "text": "الزُّهْرِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ جَمِيعاً عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ عَنِ الزُّهْرِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:2:7",
        "text": [
          " قُلْتُ لِعَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) أَيُّ الْأَعْمَالِ أَفْضَلُ قَالَ الْحَالُّ الْمُرْتَحِلُ قُلْتُ وَ مَا الْحَالُّ الْمُرْتَحِلُ قَالَ فَتْحُ الْقُرْآنِ وَ خَتْمُهُ كُلَّمَا جَاءَ بِأَوَّلِهِ ارْتَحَلَ فِي آخِرِهِ ",
          "وَ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ أَعْطَاهُ اللَّهُ الْقُرْآنَ فَرَأَى أَنَّ رَجُلًا أُعْطِيَ أَفْضَلَ مِمَّا أُعْطِيَ فَقَدْ صَغَّرَ عَظِيماً وَ عَظَّمَ صَغِيراً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and Ali Bin Muhammad Al Qasany, altogether from Al Qasim Bin Muhammad, from Suleyman Bin Dawood, from Sufyan Bin Uyayna, from Al Zuhry who said,",
            "‘I said to Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, ‘Which of the deeds is the most superior?’ He<sup>asws</sup> said: ‘The state of travelling’. I said, ‘And what is the state of travelling?’ He<sup>asws</sup> said: ‘Opening the Quran and ending it. Every time one comes to the beginning of it, travels to the end of it’. ",
            "And he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘The one whom Allah<sup>azwj</sup> has Given the Quran, so he views that (another) man has been Given superior than what he has been Given, so he has belittled a great (thing), and magnified a little one’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father and Ali ibn Muhammad al-Qasani all have narrated from al-Qasim ibn Muhammad from Sulayman ibn Dawud from Sufyan ibn ‘Uyayna from al-Zuhri who has said the following: “Once I asked Ali ibn al-Husayn (a.s.) ‘What deed is more virtuous?’ He said, ‘Al-Hall al- Murtahal .’ I then asked, ‘What is al-Hall al-MurtahalT The Imam said, ‘It is one who opens the Holy Quran and completes reading, whenever he begins he arrives at the end of the Holy Quran.’ The Imam said that the Messenger of Allah has said, ‘If one who has received the Holy Quran would think that what others have received is better than what he has received, he has considered something very great as insignificant, and something insignificant as very great.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/488)"
        ],
        "index": 3481,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/108",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2474",
              "text": "سُلَيْمَانَ بْنِ رُشَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/143",
              "text": "مُعَاوِيَةَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ سُلَيْمَانَ بْنِ رُشَيْدٍ عَنْ أَبِيهِ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:2:8",
        "text": [
          " قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَنْ قَرَأَ الْقُرْآنَ فَهُوَ غَنِيٌّ وَ لَا فَقْرَ بَعْدَهُ وَ إِلَّا مَا بِهِ غِنًى ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Isa, from Suleyman Bin Rusheyd, from his father, from Muawiya Bin Ammar who said, ",
            "‘Abu Abdullah<sup>asws</sup> said to me: ‘The one who recites the Quran so he is rich, and there is no poverty after it, or else he is not with riches’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Sulayman ibn Rashid from his father from Mu’awiyah ibn ‘Ammar who has said the following: “Abu ‘Abd Allah (a.s.) once said to me, ‘If anyone reads the Holy Quran, he is wealthy and there is no poverty thereafter, otherwise, he will never be wealthy.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/488)"
        ],
        "index": 3482,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/576",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/78",
              "text": "ابْنِ أَبِي نَجْرَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/827",
              "text": "أَبِي جَمِيلَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/185",
              "text": "جَابِرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ أَبِي جَمِيلَةَ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:2:9",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَا مَعَاشِرَ قُرَّاءِ الْقُرْآنِ اتَّقُوا اللَّهَ عَزَّ وَ جَلَّ فِيمَا حَمَّلَكُمْ مِنْ كِتَابِهِ فَإِنِّي مَسْئُولٌ وَ إِنَّكُمْ مَسْئُولُونَ إِنِّي مَسْئُولٌ عَنْ تَبْلِيغِ الرِّسَالَةِ وَ أَمَّا أَنْتُمْ فَتُسْأَلُونَ عَمَّا حُمِّلْتُمْ مِنْ كِتَابِ اللَّهِ وَ سُنَّتِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Ibn Abu Najran, from Abu Jameela, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘O group of reciters of the Quran! Fear Allah<sup>azwj</sup> Mighty and Majestic regarding what you are bearing from His<sup>azwj</sup> Book, for I<sup>saww</sup> would be Questioned and you all would be Questioned. I<sup>saww</sup> would be Questioned about the delivery of the Message, and as for you, so you would be Questioned about what you bore from the Book of Allah<sup>azwj</sup> and my<sup>saww</sup> Sunnah’’."
          ],
          "en.sarwar": [
            "9. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from ibn abu Najran from abu Jamilah from Jabir from abu Ja’far (a.s.) who has said the following: “The Messenger of Allah has said, ‘O community of the readers of the Holy Quran be pious before Allah, the Most Majestic, the Most Holy, in the matters of the responsibility that He has placed upon you toward His book. I will be questioned and you will be questioned. I will be questioned about the preaching of the message and you will be questioned about your responsibility toward the book of Allah and my Sunnah (the laws).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/489)"
        ],
        "index": 3483,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/163",
              "text": "الْقَاسِمِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/164",
              "text": "سُلَيْمَانَ بْنِ دَاوُدَ الْمِنْقَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1848",
              "text": "حَفْصٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْمِنْقَرِيِّ عَنْ حَفْصٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:2:10",
        "relations": {
          "Mentions": [
            "/books/quran:112:1"
          ]
        },
        "text": [
          " سَمِعْتُ مُوسَى بْنَ جَعْفَرٍ ( عليه السلام ) يَقُولُ لِرَجُلٍ أَ تُحِبُّ الْبَقَاءَ فِي الدُّنْيَا فَقَالَ نَعَمْ فَقَالَ وَ لِمَ قَالَ لِقِرَاءَةِ قُلْ هُوَ اللَّهُ أَحَدٌ فَسَكَتَ عَنْهُ فَقَالَ لَهُ بَعْدَ سَاعَةٍ يَا حَفْصُ مَنْ مَاتَ مِنْ أَوْلِيَائِنَا وَ شِيعَتِنَا وَ لَمْ يُحْسِنِ الْقُرْآنَ عُلِّمَ فِي قَبْرِهِ لِيَرْفَعَ اللَّهُ بِهِ مِنْ دَرَجَتِهِ فَإِنَّ دَرَجَاتِ الْجَنَّةِ عَلَى قَدْرِ آيَاتِ الْقُرْآنِ يُقَالُ لَهُ اقْرَأْ وَ ارْقَ فَيَقْرَأُ ثُمَّ يَرْقَى ",
          "قَالَ حَفْصٌ فَمَا رَأَيْتُ أَحَداً أَشَدَّ خَوْفاً عَلَى نَفْسِهِ مِنْ مُوسَى بْنِ جَعْفَرٍ ( عليه السلام ) وَ لَا أَرْجَى النَّاسِ مِنْهُ وَ كَانَتْ قِرَاءَتُهُ حُزْناً فَإِذَا قَرَأَ فَكَأَنَّهُ يُخَاطِبُ إِنْسَاناً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Qasim Bin Muhammad, from Suleyman Bin Dawood, from Hafs who said, ",
            "‘I heard Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup> saying to a man: ‘Would you love to remain in the world?’ So he said, ‘Yes’. So he<sup>asws</sup> said: ‘And why?’ He said, ‘In order to recite <span class=\"ibTxt\"><a href=\"/#/books/quran:112#h1\">[112:1]</a> Say He Allah is One </span>(Chapter 112)’. So he<sup>asws</sup> was silent from him, and said to him after a while: ‘O Hafs! The one from our<sup>asws</sup> friends and our<sup>asws</sup> Shias who dies and is not good (at reciting) the Quran, <span style=\"text-decoration: underline\">would be taught in his grave</span>, in order for Allah<sup>azwj</sup> to Raise his status by it, from his (current) level, for the Levels of the Paradise are upon a measurement of the Verses of the Quran. It would be said to him: ‘Recite and ascend’. So he would recite, then he would ascend’. ",
            "Hafs said, ‘So I did not see anyone more intensely fearful upon himself than Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup>, nor anyone more hopeful of the people than him<sup>asws</sup>, and it was so that his<sup>asws</sup> recitation was (full of) grief. So whenever he<sup>asws</sup> recited, it was as if he<sup>asws</sup> was addressing the people’."
          ],
          "en.sarwar": [
            "10. Ali ibn Ibrahim has narrated from his father from al-Qasim ibn Muhammad from Sulayman ibn Dawud al-Minqari from Hafs who has said the following: “I heard Musa ibn Ja’far (a.s.) asking a man, ‘Do you like to live forever in this world’? The man said, ‘Yes, I do so.’ The Imam asked, ‘Why would you do so?’ The man said, ‘So that I can read Chapter 1 12 of the Holy Quran.’ The Imam (a.s.) remained calm for a while and after an hour said, ‘O Hafs, if any of our Shi’a (followers) do not do good in reading the Holy Quran, in his grave he will receive instruction to read so that Allah will raise him with his proper status; the positions and degrees in paradise are proportionate to the verses of the Holy Quran. One will be told to read and climb. He then reads and climbs up.’ Hafs has said, ‘I never saw anyone more afraid for himself than Musa ibn Ja’far (a.s.) or more hopeful in all people. His reading was full of sadness. When reading the Holy Quran he seemed like addressing (speaking to) a human being.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/489)"
        ],
        "index": 3484,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/57",
              "text": "عَلِيٌّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/38",
              "text": "النَّوْفَلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/39",
              "text": "السَّكُونِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيٌّ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:3:2:11",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) حَمَلَةُ الْقُرْآنِ عُرَفَاءُ أَهْلِ الْجَنَّةِ وَ الْمُجْتَهِدُونَ قُوَّادُ أَهْلِ الْجَنَّةَ وَ الرُّسُلُ سَادَةُ أَهْلِ الْجَنَّةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The bearers of the Quran are the understanding ones of the Paradise, and the strivers are the guides of the people of the Paradise, and the Rasools<sup>as</sup> would be the chiefs of the people of the Paradise’."
          ],
          "en.sarwar": [
            "11. Ali has narrated from his father from al-Nawfali from al-Sakuni from abu ‘Abd Allah (a.s.) who has said the following: “The Messenger of Allah has said, ‘The carriers of the Holy Quran will be the most knowledgeable people of paradise, the assiduously working people will be the leaders in paradise and the messengers will be the masters of the people of paradise.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:3:2",
  "kind": "verse_list"
}