{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:2:3", "titles": {"ar": "كِتَابُ فَضْلِ الْقُرْآنِ", "en": "THE BOOK OF MERITS OF THE QURAN"}}, {"indexed_titles": {"en": "Chapter 4"}, "path": "/books/al-kafi:2:3:4", "titles": {"ar": "بَابُ مَنْ حَفِظَ الْقُرْآنَ ثُمَّ نَسِيَهُ", "en": "Chapter 4 – The one who memorises the Quran, then forgets it"}}], "index": 461, "local_index": 4, "part_type": "Chapter", "path": "/books/al-kafi:2:3:4", "titles": {"ar": "بَابُ مَنْ حَفِظَ الْقُرْآنَ ثُمَّ نَسِيَهُ", "en": "Chapter 4 – The one who memorises the Quran, then forgets it"}, "verse_count": 6, "verse_start_index": 3487, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 3488, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:3:4:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ جَمِيعاً عَنِ ابْنِ فَضَّالٍ عَنْ أَبِي إِسْحَاقَ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ يَعْقُوبَ الْأَحْمَرِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ إِنِّي كُنْتُ قَرَأْتُ الْقُرْآنَ فَفَلَتَ مِنِّي فَادْعُ اللَّهَ عَزَّ وَ جَلَّ أَنْ يُعَلِّمَنِيهِ قَالَ فَكَأَنَّهُ فَزِعَ لِذَلِكَ فَقَالَ عَلَّمَكَ اللَّهُ هُوَ وَ إِيَّانَا جَمِيعاً قَالَ وَ نَحْنُ نَحْوٌ مِنْ عَشَرَةٍ ", "ثُمَّ قَالَ السُّورَةُ تَكُونُ مَعَ الرَّجُلِ قَدْ قَرَأَهَا ثُمَّ تَرَكَهَا فَتَأْتِيهِ يَوْمَ الْقِيَامَةِ فِي أَحْسَنِ صُورَةٍ وَ تُسَلِّمُ عَلَيْهِ فَيَقُولُ مَنْ أَنْتِ فَتَقُولُ أَنَا سُورَةُ كَذَا وَ كَذَا فَلَوْ أَنَّكَ تَمَسَّكْتَ بِي وَ أَخَذْتَ بِي لَأَنْزَلْتُكَ هَذِهِ الدَّرَجَةَ فَعَلَيْكُمْ بِالْقُرْآنِ ", "ثُمَّ قَالَ إِنَّ مِنَ النَّاسِ مَنْ يَقْرَأُ الْقُرْآنَ لِيُقَالَ فُلَانٌ قَارِئٌ وَ مِنْهُمْ مَنْ يَقْرَأُ الْقُرْآنَ لِيَطْلُبَ بِهِ الدُّنْيَا وَ لَا خَيْرَ فِي ذَلِكَ وَ مِنْهُمْ مَنْ يَقْرَأُ الْقُرْآنَ لِيَنْتَفِعَ بِهِ فِي صَلَاتِهِ وَ لَيْلِهِ وَ نَهَارِهِ ."], "translations": {"en.hubeali": ["A number of our companbions, from Ahmad Bin Muhammad, and Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, altogether, from Ibn Fazzal, from Abu Is’haq Sa’alba Bin Maymoun, from Yaqoub Al Ahmar who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! I used to recite the Quran, but it has escaped from me, therefore supplicate to Allah<sup>azwj</sup> Mighty and Majestic that He<sup>azwj</sup> Teaches it (to me)’. He (the narrator) said, ‘So it was as if he<sup>asws</sup> was shocked due to that, and he<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> Teach you it, and us altogether’. He (the narrator) said, ‘And we were approximately ten (people)’. ", "Then he<sup>asws</sup> said: ‘The Chapter (of the Holy Quran) which happens to be with the man, having had recited it, then he neglected it, so it would be coming to him on the Day of Judgment in an excellent image and greet upon him. So he would be saying, ‘Who are you?’ So it would be saying: ‘I am Chapter such and such, so had you attached yourself with me, and taken (to the recitation) with me, I would have catapulted you to this level’. Therefore, it is upon you with the (recitation of the) Quran’. ", "Then he<sup>asws</sup> said: ‘From the people is one who recites the Quran in order for it to be said, ‘So and so is a reciter’; and from them is one who recites the Quran in order to seek the world with it, and there is no goodness in that; and from them is one who recites the Quran in order to benefit with it during his <span class=\"iTxt\">Salāt</span>, and his night, and his day’."]}}, {"index": 3489, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:3:4:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي الْمَغْرَاءِ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَنْ نَسِيَ سُورَةً مِنَ الْقُرْآنِ مُثِّلَتْ لَهُ فِي صُورَةٍ حَسَنَةٍ وَ دَرَجَةٍ رَفِيعَةٍ فِي الْجَنَّةِ فَإِذَا رَآهَا قَالَ مَا أَنْتِ مَا أَحْسَنَكِ لَيْتَكِ لِي فَيَقُولُ أَ مَا تَعْرِفُنِي أَنَا سُورَةُ كَذَا وَ كَذَا وَ لَوْ لَمْ تَنْسَنِي رَفَعْتُكَ إِلَى هَذَا ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abu Al Magra’a, from Abu baser who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘The one who forgets a Chapter from the Quran, it would be resembled for him in a beautiful image, and be in a lofty level in the Paradise. So when he sees it, he would say, ‘What are you? How beautiful! If only you were for me’. So it would be saying: ‘But, do you not recognise me? I am Chapter such and such, and had you not forgotten me, I would have raised you to this (level)’."]}}, {"index": 3490, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:2:3:4:3", "text": ["ابْنُ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ يَعْقُوبَ الْأَحْمَرِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ عَلَيَّ دَيْناً كَثِيراً وَ قَدْ دَخَلَنِي مَا كَانَ الْقُرْآنُ يَتَفَلَّتُ مِنِّي فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) الْقُرْآنَ الْقُرْآنَ إِنَّ الْآيَةَ مِنَ الْقُرْآنِ وَ السُّورَةَ لَتَجِي‏ءُ يَوْمَ الْقِيَامَةِ حَتَّى تَصْعَدَ أَلْفَ دَرَجَةٍ يَعْنِي فِي الْجَنَّةِ فَتَقُولُ لَوْ حَفِظْتَنِي لَبَلَغْتُ بِكَ هَاهُنَا ."], "translations": {"en.hubeali": ["Ibn Abu Umeyr, from Ibrahim Bin Abdul Hameed, from Yaqoub Al Ahmar who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘There are a lot of debts upon me, and what entered me (from the worries). Whatever was of the Quran has escaped from me’. So Abu Abdullah<sup>asws</sup> said: ‘The Quran! The Quran! The Verse from the Quran and the Chapter would be coming on the Day of Judgment until it ascends a thousand Levels, meaning in the Paradise, so it would be saying: ‘Had you memorised me, I would have reached with you to be over here’’."]}}, {"index": 3491, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:2:3:4:4", "text": ["حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنْ مُحَسِّنِ بْنِ أَحْمَدَ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنِ ابْنِ أَبِي يَعْفُورٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ الرَّجُلَ إِذَا كَانَ يَعْلَمُ السُّورَةَ ثُمَّ نَسِيَهَا أَوْ تَرَكَهَا وَ دَخَلَ الْجَنَّةَ أَشْرَفَتْ عَلَيْهِ مِنْ فَوْقٍ فِي أَحْسَنِ صُورَةٍ فَتَقُولُ تَعْرِفُنِي فَيَقُولُ لَا فَتَقُولُ أَنَا سُورَةُ كَذَا وَ كَذَا لَمْ تَعْمَلْ بِي وَ تَرَكْتَنِي أَمَا وَ اللَّهِ لَوْ عَمِلْتَ بِي لَبَلَغْتُ بِكَ هَذِهِ الدَّرَجَةَ وَ أَشَارَتْ بِيَدِهَا إِلَى فَوْقِهَا ."], "translations": {"en.hubeali": ["Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at and a number of our companions, from Ahmad Bin Muhammad, altogether from Muhassin Bin Ahmad, from Aban Bin Usman, from Ibn Abu Yafour who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘When the man learns the Chapter (of the Holy Quran), then forgets it or neglects it, and enters the Paradise, it would display itself upon him from above in a beautiful image, and it would be saying: ‘Do you recognise me?’ So he would be saying, ‘No’. So it would be saying: ‘I am Chapter such and such. You did not act by me and neglected me. But, by Allah<sup>azwj</sup>, had you acted with me, I would have made you reach to this Level’, and it would gesture by its hand to above it’."]}}, {"index": 3492, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:2:3:4:5", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ عَنِ الْعَبَّاسِ بْنِ عَامِرٍ عَنِ الْحَجَّاجِ الْخَشَّابِ عَنْ أَبِي كَهْمَسٍ الْهَيْثَمِ بْنِ عُبَيْدٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ قَرَأَ الْقُرْآنَ ثُمَّ نَسِيَهُ فَرَدَدْتُ عَلَيْهِ ثَلَاثاً أَ عَلَيْهِ فِيهِ حَرَجٌ قَالَ لَا ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Al Hassan Bin Ali Bin Abdullah, from Al Abbas Bin Aamir, from Al Hajjaj Al Khashhab, from Abu Kahmasy Al Haysam Bin Ubeyd who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about a man who recites the Quran, then forgets it’, and I reiterated it to him<sup>asws</sup> three (times), ‘Is there any blame upon him?’ He<sup>asws</sup> said: ‘No’."]}}, {"index": 3493, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:2:3:4:6", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ خَالِدٍ وَ الْحُسَيْنِ بْنِ سَعِيدٍ جَمِيعاً عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ يَعْقُوبَ الْأَحْمَرِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ إِنَّهُ أَصَابَتْنِي هُمُومٌ وَ أَشْيَاءُ لَمْ يَبْقَ شَيْ‏ءٌ مِنَ الْخَيْرِ إِلَّا وَ قَدْ تَفَلَّتَ مِنِّي مِنْهُ طَائِفَةٌ حَتَّى الْقُرْآنِ لَقَدْ تَفَلَّتَ مِنِّي طَائِفَةٌ مِنْهُ ", "قَالَ فَفَزِعَ عِنْدَ ذَلِكَ حِينَ ذَكَرْتُ الْقُرْآنَ ثُمَّ قَالَ إِنَّ الرَّجُلَ لَيَنْسَى السُّورَةَ مِنَ الْقُرْآنِ فَتَأْتِيهِ يَوْمَ الْقِيَامَةِ حَتَّى تُشْرِفَ عَلَيْهِ مِنْ دَرَجَةٍ مِنْ بَعْضِ الدَّرَجَاتِ فَتَقُولُ السَّلَامُ عَلَيْكَ فَيَقُولُ وَ عَلَيْكِ السَّلَامُ مَنْ أَنْتِ فَتَقُولُ أَنَا سُورَةُ كَذَا وَ كَذَا ضَيَّعْتَنِي وَ تَرَكْتَنِي أَمَا لَوْ تَمَسَّكْتَ بِي بَلَغْتُ بِكَ هَذِهِ الدَّرَجَةَ ثُمَّ أَشَارَ بِإِصْبَعِهِ ", "ثُمَّ قَالَ عَلَيْكُمْ بِالْقُرْآنِ فَتَعَلَّمُوهُ فَإِنَّ مِنَ النَّاسِ مَنْ يَتَعَلَّمُ الْقُرْآنَ لِيُقَالَ فُلَانٌ قَارِئٌ وَ مِنْهُمْ مَنْ يَتَعَلَّمُهُ فَيَطْلُبُ بِهِ الصَّوْتَ فَيُقَالُ فُلَانٌ حَسَنُ الصَّوْتِ وَ لَيْسَ فِي ذَلِكَ خَيْرٌ وَ مِنْهُمْ مَنْ يَتَعَلَّمُهُ فَيَقُومُ بِهِ فِي لَيْلِهِ وَ نَهَارِهِ لَا يُبَالِي مَنْ عَلِمَ ذَلِكَ وَ مَنْ لَمْ يَعْلَمْهُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Khalid and Al Husayn Bin Saeed, altogether from Al Nazar Bin Suweyd, from Yahya Al Halby, from Abdullah Bin Muskan, from Yaqoub Al Ahmar who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Worries and other things hit me, and there does not remain anything from the goodness except a section from it has escaped from me, even the Quran, a section from it has escaped from me (as well)’.  ", "He (the narrator) said, ‘So he<sup>asws</sup> was shocked at that when I mentioned the Quran. Then he<sup>asws</sup> said: ‘The man forgets the Chapter from the Quran, so it would come to him on the Day of Judgment until it displays itself upon him from a Level from some of the Levels, and it would be saying: ‘The greetings be upon you’. So he would be saying, ‘And upon you be the greetings. Who are you?’ So it would be saying: ‘I am Chapter such and such. You wasted me and neglected me. But, had you attached yourself with me, I would have caused you to reach to this Level’. Then it would gesture by its fingers. ", "Then he<sup>asws</sup> said: ‘(It is) upon you with the Quran. From the people is one who learns the Quran in order for it to be said, ‘So and so is a reciter’; and from them is the one who learns it, and he seeks the voice by it, so it is said to him, ‘So and so and an excellent voice’, and there is no goodness in that; and from them is the one who learns it, so he stands by it during his night and his day, not caring who knows of that and who does not know of that’."]}}]}, "index": "al-kafi:2:3:4", "kind": "verse_list"}