{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 10"
        },
        "path": "/books/al-kafi:5:3:10",
        "titles": {
          "ar": "باب أَنَّ التَّزْوِيجَ يَزِيدُ فِي الرِّزْقِ ",
          "en": "Chapter 10 – The marriage increases the sustenance"
        }
      }
    ],
    "index": 1381,
    "local_index": 10,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 11"
        },
        "path": "/books/al-kafi:5:3:11",
        "titles": {
          "ar": "باب مَنْ سَعَى فِي التَّزْوِيجِ ",
          "en": "Chapter 11 – The one who strives regarding the marriage"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 9"
        },
        "path": "/books/al-kafi:5:3:9",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب كَرَاهَةِ الْعُزْبَةِ</span> ",
          "en": "Chapter 9 – Abhorrence of the bachelorhood"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:3:10",
    "titles": {
      "ar": "باب أَنَّ التَّزْوِيجَ يَزِيدُ فِي الرِّزْقِ ",
      "en": "Chapter 10 – The marriage increases the sustenance"
    },
    "verse_count": 7,
    "verse_start_index": 9393,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/18)"
        ],
        "index": 9394,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:10:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ حَرِيزٍ عَنْ وَلِيدِ بْنِ صَبِيحٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ تَرَكَ التَّزْوِيجَ مَخَافَةَ الْعَيْلَةِ فَقَدْ أَسَاءَ بِاللَّهِ الظَّنَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Aban Bin usman, from Hareyz, from Waleed Bin Sabeeh, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who neglects the marriage fearing poverty so he has distrusted Allah<sup>azwj</sup> with the conjecture’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Aban ibn ‘Uthman from Hariz from Walid ibn Sabih who has said the following: “One who neglects marriage for fear of failure to feed his family has become distrustful of Allah.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/19)"
        ],
        "index": 9395,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:10:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ وَ عَبْدِ اللَّهِ ابْنَيْ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) فَشَكَا إِلَيْهِ الْحَاجَةَ فَقَالَ تَزَوَّجْ فَتَزَوَّجَ فَوُسِّعَ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad and Abdullah two sones of Isa, from Ali Bin Al Hakam, from Hisham Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A man came over to the Prophet<sup>saww</sup>, so he complained to him<sup>saww</sup> of the destitution (lack of resources), so he<sup>saww</sup> said: ‘Get married’. So he got married, and it (sustenance) was expanded upon him’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad and ‘Abd Allah sons of Muhammad ibn ‘Isa from Ali ibn al-Hakam from Hisham ibn Salim who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Once a man came to the Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and complained about his financial condition. He (the Messenger of Allah) told him to become married and he did so after which he became affluent.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/19)"
        ],
        "index": 9396,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:10:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ [عَنْ أَبِيهِ] عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَتَى رَسُولَ اللَّهِ ( صلى الله عليه وآله ) شَابٌّ مِنَ الْأَنْصَارِ فَشَكَا إِلَيْهِ الْحَاجَةَ فَقَالَ لَهُ تَزَوَّجْ ",
          "فَقَالَ الشَّابُّ إِنِّي لَأَسْتَحْيِي أَنْ أَعُودَ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَلَحِقَهُ رَجُلٌ مِنَ الْأَنْصَارِ فَقَالَ إِنَّ لِي بِنْتاً وَسِيمَةً فَزَوَّجَهَا إِيَّاهُ قَالَ فَوَسَّعَ اللَّهُ عَلَيْهِ [قَالَ] فَأَتَى الشَّابُّ النَّبِيَّ ( صلى الله عليه وآله ) فَأَخْبَرَهُ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَا مَعْشَرَ الشَّبَابِ عَلَيْكُمْ بِالْبَاهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Salih Bin Al Sandy, from Ja’far Bin Basheer, from Ali Bin Abu Hamza, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A youth from the Helpers came over to Rasool-Allah<sup>saww</sup>, so he complained to him of the destitution. So he<sup>saww</sup> said to him: ‘Get married’. ",
            "So the youth said, ‘I am too embarrassed that I should repeat to Rasool-Allah<sup>saww</sup>’. So a man from the Helpers met him and said, ‘I have a beautiful daughter’. So he married her to him. So Allah<sup>azwj</sup> Expanded (sustenance) upon him. So the youth came over to the Prophet<sup>saww</sup> and informed him<sup>saww</sup>. So Rasool-Allah<sup>saww</sup> said: ‘O group of youths! You must get married’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from Salih al-Sindiy from Ja’far ibn Bashir from Ali ibn abu Hamzah from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Once a young man from al-Ansar (people of al- Madinah) came to the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and complained about his needs. He (the Messenger of Allah) told him to become married. The young man said, “I feel shy to come to the Messenger of Allah to ask for help again.” A man from al-Ansar (people of al-Madinah) followed him and said, “I have a beautiful daughter.” He gave her in marriage to him. Allah granted increase in his sustenance. The young man came to the Holy Prophet, informed him of his condition and the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, said, “You, the young people, must get married.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/19)"
        ],
        "index": 9397,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:10:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِي عَبْدِ اللَّهِ الْجَامُورَانِيِّ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنِ الْمُؤْمِنِ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الْحَدِيثُ الَّذِي يَرْوِيهِ النَّاسُ حَقٌّ أَنَّ رَجُلًا أَتَى النَّبِيَّ ( صلى الله عليه وآله ) فَشَكَا إِلَيْهِ الْحَاجَةَ فَأَمَرَهُ بِالتَّزْوِيجِ فَفَعَلَ ثُمَّ أَتَاهُ فَشَكَا إِلَيْهِ الْحَاجَةَ فَأَمَرَهُ بِالتَّزْوِيجِ حَتَّى أَمَرَهُ ثَلَاثَ مَرَّاتٍ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) [نَعَمْ] هُوَ حَقٌّ ثُمَّ قَالَ الرِّزْقُ مَعَ النِّسَاءِ وَ الْعِيَالِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Abu Abdullah Al Jamourany, from Al Hassan Bin Ali Bin Abu Hamza, from Al Momin, from Is’haq Bin Ammar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Is the Hadeeth which the people are reporting, true, that a man came over to the Prophet<sup>saww</sup>, so he complained to him of the destitution, so he<sup>saww</sup> ordered him with the marriage. So he did. Then he came over to him<sup>saww</sup> and complained to him of the destitution, so he<sup>saww</sup> ordered him with the marriage, until he<sup>saww</sup> ordered him three times?’ So Abu Abdullah<sup>asws</sup> said: ‘Yes, it is true’. Then he<sup>asws</sup> said: ‘The sustenance is with the women and the dependants’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from abu ‘Abd Allah al-Jamuraniy from al-Hassan ibn Ali ibn abu Hamzah from al-Mu’min from Ishaq ibn ‘Ammar who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the truth in Hadith which people narrate that a man came to the Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and complained about his financial condition. He (the Messenger of Allah) commanded him to get married. He married but then came to complain again. He (the Messenger of Allah) commanded him to get married and so on up to three times.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Yes, it (Hadith) is true.’ He (the Imam) then said, ’Sustenance is with women and with the dependents to feed.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/20)"
        ],
        "index": 9398,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:10:5",
        "refs": {
          "Mentions": [
            "/books/quran:24:32"
          ]
        },
        "text": [
          "وَ عَنْهُ عَنِ الْجَامُورَانِيِّ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ مُحَمَّدِ بْنِ يُوسُفَ .التَّمِيمِيِّ عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ عَنْ أَبِيهِ عَنْ آبَائِهِ ( عليهم السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ تَرَكَ التَّزْوِيجَ مَخَافَةَ الْعَيْلَةِ فَقَدْ أَسَاءَ ظَنَّهُ بِاللَّهِ عَزَّ وَ جَلَّ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ إِنْ يَكُونُوا فُقَراءَ يُغْنِهِمُ اللَّهُ مِنْ فَضْلِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Al Jamourany, from Al Hassan Bin Ali Bin Abu Hamza, from Muhammad Bin Yusuf Al Taymi, ",
            "(It has been narrated) from Muhammad son of Ja’far<sup>asws</sup>, from his<sup>asws</sup> father<sup>asws</sup>, from his<sup>asws</sup> forefathers<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The one who neglects the marriage fearing the poverty, so he has offended Allah<sup>azwj</sup> Mighty and Majestic with his conjecture. Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:24#h32\">[24:32]</a> if they are poor, Allah would Enrich them out of His Grace</span>’."
          ],
          "en.sarwar": [
            "5. It is narrated from the narrator of the previous Hadith from al-Jamuraniy from al-Hassan ibn Ali ibn abu Hamzah from Muhammad ibn Yusuf al-Tamimiy from Muhammad ibn Ja’far from his father from ancestors who has said the following: “He (the Imam), ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘One who neglects marriage because of his fear to feed his dependents has become cynical about Allah, most Majestic, most Glorious, who has said, “If they are poor Allah makes rich through His generosity.’”” (24: 32) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/20)"
        ],
        "index": 9399,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:10:6",
        "refs": {
          "Mentions": [
            "/books/quran:4:130",
            "/books/quran:4:129",
            "/books/quran:24:32"
          ]
        },
        "text": [
          "وَ عَنْهُ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ حَمْدَوَيْهِ بْنِ عِمْرَانَ عَنِ ابْنِ أَبِي لَيْلَى قَالَ حَدَّثَنِي عَاصِمُ بْنُ حُمَيْدٍ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَأَتَاهُ رَجُلٌ فَشَكَا إِلَيْهِ الْحَاجَةَ فَأَمَرَهُ بِالتَّزْوِيجِ ",
          "قَالَ فَاشْتَدَّتْ بِهِ الْحَاجَةُ فَأَتَى أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَسَأَلَهُ عَنْ حَالِهِ فَقَالَ لَهُ اشْتَدَّتْ بِيَ الْحَاجَةُ فَقَالَ فَفَارِقْ ثُمَّ أَتَاهُ فَسَأَلَهُ عَنْ حَالِهِ فَقَالَ أَثْرَيْتُ وَ حَسُنَ حَالِي",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي أَمَرْتُكَ بِأَمْرَيْنِ أَمَرَ اللَّهُ بِهِمَا قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ أَنْكِحُوا الْأَيامى مِنْكُمْ إِلَى قَوْلِهِ وَ اللَّهُ واسِعٌ عَلِيمٌ وَ قَالَ إِنْ يَتَفَرَّقا يُغْنِ اللَّهُ كُلًّا مِنْ سَعَتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Muhammad Bin Ali, from Hadawiya Bin Imran, from Ibn Abu Layli who said, ‘Aasim Bin Humeyd narrated to me saying, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup>, so a man came over to him<sup>asws</sup> complaining to him<sup>asws</sup> of the destitution. So he<sup>asws</sup> ordered him with the marriage. But his poverty increased. ",
            "He (the narrator) said, ‘So he went over to him<sup>asws</sup> (again) and he<sup>asws</sup> asked him of his state. So he said to him<sup>asws</sup>, ‘The poverty has increased with me’. So he<sup>asws</sup> said: ‘So separate’. Then he came over (again) and he<sup>asws</sup> asked him about his state. So he said, ‘I am enriched and my state is good’. ",
            "So Abu Abdullah<sup>asws</sup> said: ‘I<sup>asws</sup> ordered you with two Commands which Allah<sup>azwj</sup> has Commanded with. Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\"><a href=\"/#/books/quran:24#h32\">[24:32]</a> And marry those among you who are single</span> up to His<sup>azwj</sup> Words<span class=\"ibTxt\">  and Allah is Ample-giving, Knowing</span>; and He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h130\">[4:130]</a> And if they separate, Allah will Make each one self-sufficient out of His Ampleness</span>’."
          ],
          "en.sarwar": [
            "6. It is narrated from the narrator of the previous Hadith from Muhammad ibn Ali from Hamdwayh ibn ‘Imran from ibn abu Layla’ who has said that ‘Asem ibn Humayd narrated to me saying the following: “Once I was with abu ‘ Abd Allah, ‘Alayhi al-Salam, when a man came and complained before him (the Imam) about his financial conditions. He (the Imam) commanded him to get married but his needs became more pressing and he came back again to abu ‘Abd Allah, ‘Alayhi al-Salam, who asked about his conditions. He replied that it has worsened. He (the Imam) told him to separate. The man came back again and he (the Imam) asked about his conditions. The man replied, ‘I have become affluent and my conditions are better.’ He (the Imam) said, ‘I commanded you as I did because of the two commandments with which Allah, most Majestic, most Glorious, has commanded: “Marry the single ones among you and the virtuous of your slaves and slave-girls and if you are poor Allah through His generosity will make you self-sufficient.” <a href=\"/#/books/quran:24#h32\">[24:32]</a> “If they depart each other Allah will make each one self-sufficient through His vast resources.” <a href=\"/#/books/quran:4#h129\">[4:129]</a>’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/20)"
        ],
        "index": 9400,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:10:7",
        "refs": {
          "Mentions": [
            "/books/quran:24:33"
          ]
        },
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ بَعْضِ أَصْحَابِهِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ لْيَسْتَعْفِفِ الَّذِينَ لا يَجِدُونَ نِكاحاً حَتَّى يُغْنِيَهُمُ اللَّهُ مِنْ فَضْلِهِ قَالَ يَتَزَوَّجُوا حَتَّى يُغْنِيَهُمْ مِنْ فَضْلِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from one of his companions, from Safwan Bin Yahya, from Muawiya Bin Wahab, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:24#h33\">[24:33]</a> And let those who do not find the means to marry keep chaste until Allah makes them self-sufficient out of His Grace</span>. He<sup>asws</sup> said: ‘They should keep marrying until Allah<sup>azwj</sup> Enriches them from His<sup>azwj</sup> Grace’."
          ],
          "en.sarwar": [
            "7. Abu Ali al-Ash’ariy has narrated from certain persons of his people from Safwan ibn Yahya from Mu‘awiyah ibn Wahab who has said the following: “About the words of Allah, most Majestic, most Glorious, ‘Those who cannot find marriage must remain chaste until Allah through His generosity makes them self-sufficient,’ <a href=\"/#/books/quran:24#h33\">[24:33]</a> he (the Imam), ‘Alayhi al-Salam, has said, ‘They must become married so that (when) Allah makes them self- sufficient through His generosity.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:3:10",
  "kind": "verse_list"
}