{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:5:3", "titles": {"ar": "كتاب النِّكَاحِ", "en": "THE BOOK OF MARRIAGE"}}, {"indexed_titles": {"en": "Chapter 101"}, "path": "/books/al-kafi:5:3:101", "titles": {"ar": "باب الزِّيَادَةِ فِي الْأَجَلِ", "en": "Chapter 101 – The increment in the term"}}], "index": 1470, "local_index": 101, "part_type": "Chapter", "path": "/books/al-kafi:5:3:101", "titles": {"ar": "باب الزِّيَادَةِ فِي الْأَجَلِ", "en": "Chapter 101 – The increment in the term"}, "verse_count": 3, "verse_start_index": 9883, "verses": [{"index": 9884, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:3:101:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نَجْرَانَ وَ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبِي بَصِيرٍ قَالَ لَا بَأْسَ بِأَنْ تَزِيدَكَ وَ تَزِيدَهَا إِذَا انْقَطَعَ الْأَجَلُ فِيمَا بَيْنَكُمَا تَقُولُ اسْتَحْلَلْتُكِ بِأَجَلٍ آخَرَ بِرِضاً مِنْهَا وَ لَا يَحِلُّ ذَلِكَ لِغَيْرِكَ حَتَّى تَنْقَضِيَ عِدَّتُهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, and Ali Bin Ibrahim, from his father, altogether, from Abdul Rahman Bin Abu Najran, and Ahmad Bin Muhammad Bin Abu Nasr, from Abu Baseer who said, \n‘There is no problem with you increasing it and her increasing it when the term is cut-off between the two of you. She should be saying, ‘I hereby permit you with another term with agreement from it’, and that is not Permissible for other than you, until her waiting period expires’."}]}, {"index": 9885, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:3:101:2", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ إِبْرَاهِيمَ بْنِ الْفَضْلِ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ أَسْلَمَ وَ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ أَسْلَمَ عَنْ إِبْرَاهِيمَ بْنِ الْفَضْلِ الْهَاشِمِيِّ عَنْ أَبَانِ بْنِ تَغْلِبَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ الرَّجُلُ يَتَزَوَّجُ الْمَرْأَةَ مُتْعَةً فَيَتَزَوَّجُهَا عَلَى شَهْرٍ ثُمَّ إِنَّهَا تَقَعُ فِي قَلْبِهِ فَيُحِبُّ أَنْ يَكُونَ شَرْطُهُ أَكْثَرَ مِنْ شَهْرٍ فَهَلْ يَجُوزُ أَنْ يَزِيدَهَا فِي أَجْرِهَا وَ يَزْدَادَ فِي الْأَيَّامِ قَبْلَ أَنْ تَنْقَضِيَ أَيَّامُهُ الَّتِي شَرَطَ عَلَيْهَا فَقَالَ لَا لَا يَجُوزُ شَرْطَانِ فِي شَرْطٍ قُلْتُ فَكَيْفَ يَصْنَعُ قَالَ يَتَصَدَّقُ عَلَيْهَا بِمَا بَقِيَ مِنَ الْأَيَّامِ ثُمَّ يَسْتَأْنِفُ شَرْطاً جَدِيداً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Amro Bin Usman, from Ibrahim Bin Al Fazl, and a number of our companions, from Sahl Bin Ziyad, from Ismail Bin Mihran, from Muhammad Bin Aslam, and from Ahmad Bin Muhammad Bin Khalid, from Muhammad in Ali, from Muhammad Bin Aslam, from Ibrahim Bin Al Fal Al Hashimy, from Aban Bin Taghlub who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! The man marries the woman by <span class=\"iTxt\">Mut’a</span>, so he marries her upon a month. Then it occurs in his heart, so he likes his stipulation to be more than a month. So, is it Permissible that he increases in her recompense and increases in the days before the expiry of day which he had stipulated upon her (beforehand)?’ So he<sup>asws</sup> said: ‘No. Two stipulations are not allowed in one stipulation’. I said, ‘How should he deal with it?’ He<sup>asws</sup> said: ‘He can give a charity upon her with whatever remains from the days, then he resumes with a new stipulation’."}]}, {"index": 9886, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:3:101:3", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَمَّنْ رَوَاهُ قَالَ إِنَّ الرَّجُلَ إِذَا تَزَوَّجَ الْمَرْأَةَ مُتْعَةً كَانَ عَلَيْهَا عِدَّةٌ لِغَيْرِهِ فَإِذَا أَرَادَ هُوَ أَنْ يَتَزَوَّجَهَا لَمْ يَكُنْ عَلَيْهَا مِنْهُ عِدَّةٌ يَتَزَوَّجُهَا إِذَا شَاءَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from the one who reported it, \nHe<sup>asws</sup> said: ‘The man, when he marries the woman by <span class=\"iTxt\">Mut’a</span>, there would be upon her the observance of a waiting period for others. So when he intends to marry her, there would not be an observance of the waiting period upon her from him. He can marry her whenever he so desires to’."}]}]}, "index": "al-kafi:5:3:101", "kind": "verse_list"}