{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 105"
        },
        "path": "/books/al-kafi:5:3:105",
        "titles": {
          "ar": "باب حَبْسِ الْمَهْرِ إِذَا أَخْلَفَتْ",
          "en": "Chapter 104 – Withholding of the dower when she differs"
        }
      }
    ],
    "index": 1476,
    "local_index": 105,
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:3:105",
    "titles": {
      "ar": "باب حَبْسِ الْمَهْرِ إِذَا أَخْلَفَتْ",
      "en": "Chapter 104 – Withholding of the dower when she differs"
    },
    "verse_count": 5,
    "verse_start_index": 9896,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/247)"
        ],
        "index": 9897,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:105:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ عُمَرَ بْنِ أَبَانٍ عَنْ عُمَرَ بْنِ حَنْظَلَةَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَتَزَوَّجُ الْمَرْأَةَ شَهْراً فَتُرِيدُ مِنِّي الْمَهْرَ كَمَلًا وَ أَتَخَوَّفُ أَنْ تُخْلِفَنِي فَقَالَ لَا يَجُوزُ أَنْ تَحْبِسَ مَا قَدَرْتَ عَلَيْهِ فَإِنْ هِيَ أَخْلَفَتْكَ فَخُذْ مِنْهَا بِقَدْرِ مَا تُخْلِفُكَ "
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Umar Bin Aban, from Umar Bin Hanzala who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I married the woman for a month, so she wanted the complete dower from me, and I am fearful that she would differ with me’. So he<sup>asws</sup> said: ‘You are not allowed to withhold what is measured upon it. So if she were to differ, so take from her by a measurement of whatever she has differed with you’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Fadalah abu Ayyub from ‘Umar ibn Aban from ‘Umar ibn Hanzalah who has said the following: “This is concerning my question before abu ‘ Abd Allah, ‘Alayhi al-Salam, about if I marry a woman for one month and she wants all of the mahr (dower) from me, but I am afraid of her acting against me. He (the Imam) said, ‘You cannot withhold the mahr (dower) that is set but when she acts against the terms of marriage then you can take from her what is equal to what she has violated of the mutually agreed conditions.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/248)"
        ],
        "index": 9898,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:105:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا بَقِيَ عَلَيْهِ شَيْ‏ءٌ مِنَ الْمَهْرِ وَ عَلِمَ أَنَّ لَهَا زَوْجاً فَمَا أَخَذَتْهُ فَلَهَا بِمَا اسْتَحَلَّ مِنْ فَرْجِهَا وَ يَحْبِسُ عَنْهَا مَا بَقِيَ عِنْدَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hafs Bin Al Bakhtary, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When there remains upon him something from the dower, and he comes to know that for her is a husband, so whatever she has taken so it is for her due to what she has permitted from her private parts, and he would withhold from her whatever remains with him’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hafs ibn al-Bakhtariy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If something of mahr (dower) remains due on him and he learns that she has a husband, then what she has received belongs to her because of its making his going to bed with her lawful and he can withhold the remaining of mahr (dower).”’ "
          ]
        }
      },
      {
        "index": 9899,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:105:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنْ عُمَرَ بْنِ أَبَانٍ عَنْ عُمَرَ بْنِ حَنْظَلَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ أَتَزَوَّجُ الْمَرْأَةَ شَهْراً فَأَحْبِسُ عَنْهَا شَيْئاً قَالَ نَعَمْ خُذْ مِنْهَا بِقَدْرِ مَا تُخْلِفُكَ إِنْ كَانَ نِصْفَ شَهْرٍ فَالنِّصْفَ وَ إِنْ كَانَ ثُلُثاً فَالثُّلُثَ .",
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عُمَرَ بْنِ حَنْظَلَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Salih Bin Al Sandy, from Ja’far Bin Basheer, from Umar Bin Aban, from Umar Bin Hanzala, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘Can I marry the woman for a month, so I withhold something from her’. He<sup>asws</sup> said: ‘Yes, take from her by a measurement of whatever she has differed. If it was half a month, so the half (dower), and if it was a third, so the third’.",
            "<span style=\"font-size: small\">Muhammad Bin Yahya, from Ahhmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Umar Bin Hanzala,</span> from Abu Abdullah<sup>asws</sup> – similar to it."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from Salih ibn al-Sindiy from Ja’far ibn Bashir from ‘Umar ibn Aban from ‘Umar ibn Hanzalah who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘I marry a woman for one month and withhold a certain amount from her mahr (dower). He (the Imam) said, ‘Yes, you can do so for what is equal to her violation of the condition. If the violation is half of the month you can withhold one-half, if it is one-third then withhold one-third.’ Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from ‘Umar ibn Hanzalah from abu ‘Abd Allah, ‘Alayhi al-Salam, has narrated a similar Hadith.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/249)"
        ],
        "index": 9900,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:105:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) الرَّجُلُ يَتَزَوَّجُ الْمَرْأَةَ مُتْعَةً تَشْتَرِطُ لَهُ أَنْ تَأْتِيَهُ كُلَّ يَوْمٍ حَتَّى تُوَفِّيَهُ شَرْطَهُ أَوْ تَشْتَرِطُ أَيَّاماً مَعْلُومَةً تَأْتِيهِ فِيهَا فَتَغْدِرُ بِهِ فَلَا تَأْتِيهِ عَلَى مَا شَرَطَهُ عَلَيْهَا فَهَلْ يَصْلُحُ لَهُ أَنْ يُحَاسِبَهَا عَلَى مَا لَمْ تَأْتِهِ مِنَ الْأَيَّامِ فَيَحْبِسَ عَنْهَا مِنْ مَهْرِهَا بِحِسَابِ ذَلِكَ ",
          "قَالَ نَعَمْ يَنْظُرُ مَا قَطَعَتْ مِنَ الشَّرْطِ فَيَحْبِسُ عَنْهَا مِنْ مَهْرِهَا بِمِقْدَارِ مَا لَمْ تَفِ لَهُ مَا خَلَا أَيَّامَ الطَّمْثِ فَإِنَّهَا لَهَا فَلَا يَكُونُ لَهُ إِلَّا مَا أَحَلَّ لَهُ فَرْجَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Is’haq Bin Ammar who said, ",
            "‘I said to Abu Al-Hassan<sup>asws</sup>, ‘The man marries the woman by <span class=\"iTxt\">Mut’a</span>. She stipulates to him that she would come to him every day until his stipulation is fulfilled, or she stipulates certain known days during which she would come to him. So she betrays him with it and does not come to him upon what had been stipulated upon her. So is it correct for him that he accounts her upon what she did not come to him from the days, so that he would withhold from her dower by the accounting of that?’ ",
            "He<sup>asws</sup> said: ‘Yes. He would look at what was cut-off from the stipulation, so he would withhold from her from her dower by a measurement of whatever she did not fulfill for him, except for the days she menstruated in, so it would be for her. Thus, there would not happen to be for him except for what was Permissible for him of her private parts’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Ishaq ibn ‘Ammar who has said the following: “About the case of a man who marries a woman in the manner of al-Mut‘ah (advantageous marriage) with the condition that she must come to him every day to comply with the condition, or sets a condition to come to him in certain days; but she asks to be excused and does not come to comply with the condition; if it is proper for him to deduct for the days that she did not come and withhold from her mahr (dower) accordingly. To this question from me abu al-Hassan, ‘Alayhi al-Salam, said, ‘Yes, he can consider how much she has violated, then withhold proportionate to what she has not complied, except the days of her Hayd (menses); they are for her and he cannot have what is not lawful for him in matters of going to bed with her.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/249)"
        ],
        "index": 9901,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:105:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَحْمَدَ بْنِ أَشْيَمَ قَالَ كَتَبَ إِلَيْهِ .الرَّيَّانُ بْنُ شَبِيبٍ يَعْنِي أَبَا الْحَسَنِ ( عليه السلام ) الرَّجُلُ يَتَزَوَّجُ الْمَرْأَةَ مُتْعَةً بِمَهْرٍ إِلَى أَجَلٍ مَعْلُومٍ وَ أَعْطَاهَا بَعْضَ مَهْرِهَا وَ أَخَّرَتْهُ بِالْبَاقِي ثُمَّ دَخَلَ بِهَا وَ عَلِمَ بَعْدَ دُخُولِهِ بِهَا قَبْلَ أَنْ يُوَفِّيَهَا بَاقِيَ مَهْرِهَا أَنَّمَا زَوَّجَتْهُ نَفْسَهَا وَ لَهَا زَوْجٌ مُقِيمٌ مَعَهَا أَ يَجُوزُ لَهُ حَبْسُ بَاقِي مَهْرِهَا أَمْ لَا يَجُوزُ فَكَتَبَ ( عليه السلام ) لَا يُعْطِيهَا شَيْئاً لِأَنَّهَا عَصَتِ اللَّهَ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Ahmad Bin Asheym who said, ",
            "‘Al-Rayyan Bin Shabeeb wrote to him<sup>asws</sup>, meaning Abu Al-Hassan<sup>asws</sup>, ‘The man married the woman by <span class=\"iTxt\">Mut’a</span> to a known term, and gave her part of her dower, and delayed with the remainder. Then he slept with her, and came to know after having slept with her, before he had paid her the remainder of her dower, that she had married herself and there was a husband for her staying with her. Is it allowed for him that he withholds the remainder of her dower or is it not allowed?’ So he<sup>asws</sup> wrote: ‘He should not give her anything because she has disobeyed Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn Ahmad ibn ‘Ushaym who has said the following: “Al-Rayyan ibn Shabib wrote to abu al-Hassan , ‘Alayhi al-Salam, asking about a man who marries in the manner of al-Mut‘ah (advantageous marriage) for a certain amount of mahr (dower) for a certain number of days, pays her a part of her mahr (dower) and withholds the rest, then he goes to bed with her and before paying her the rest, learns that she has a husband who lives with her, if it is permissible for him to withhold the remaining of her mahr (dower) or it is not permissible. He (the Imam) wrote, ‘He must not give her anything because of her disobedience to Allah, most Majestic, most Glorious.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:3:105",
  "kind": "verse_list"
}