{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:5:3", "titles": {"ar": "كتاب النِّكَاحِ", "en": "THE BOOK OF MARRIAGE"}}, {"indexed_titles": {"en": "Chapter 113"}, "path": "/books/al-kafi:5:3:113", "titles": {"ar": "باب اسْتِبْرَاءِ الْأَمَةِ ", "en": "Chapter 113 – Clearing the womb of the slave girl"}}], "index": 1482, "local_index": 113, "part_type": "Chapter", "path": "/books/al-kafi:5:3:113", "titles": {"ar": "باب اسْتِبْرَاءِ الْأَمَةِ ", "en": "Chapter 113 – Clearing the womb of the slave girl"}, "verse_count": 10, "verse_start_index": 9943, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 9944, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:3:113:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ سَأَلْتُهُ عَنْ رَجُلٍ اشْتَرَى جَارِيَةً وَ لَمْ يَكُنْ لَهَا زَوْجٌ أَ يَسْتَبْرِئُ رَحِمَهَا قَالَ نَعَمْ قُلْتُ فَإِنْ كَانَتْ لَمْ تَحِضْ فَقَالَ أَمْرُهَا شَدِيدٌ فَإِنْ هُوَ أَتَاهَا فَلَا يُنْزِلِ الْمَاءَ حَتَّى يَسْتَبِينَ أَ حُبْلَى هِيَ أَمْ لَا قُلْتُ وَ فِي كَمْ تَسْتَبِينُ لَهُ قَالَ فِي خَمْسَةٍ وَ أَرْبَعِينَ يَوْماً ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from Sama’at, said, ", "‘I asked him<sup>asws</sup> about a man who bought a slave girl and there did not happen to be a husband for her. Does he have to clear her womb (make her observe the waiting period)?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘Supposing she does not menstruate?’ So he<sup>asws</sup> said: ‘Her matter is difficult. So if he goes to her, so he should not make the water descend (discharge the seed) until it becomes clear whether she is pregnant or not?’ I said, ‘And in how much (time) would it become clear for him?’ He<sup>asws</sup> said: ‘In forty five days’."]}}, {"index": 9945, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:3:113:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي رَجُلٍ اشْتَرَى جَارِيَةً لَمْ يَكُنْ صَاحِبُهَا يَطَؤُهَا أَ يَسْتَبْرِئُ رَحِمَهَا قَالَ نَعَمْ قُلْتُ جَارِيَةٌ لَمْ تَحِضْ كَيْفَ يُصْنَعُ بِهَا قَالَ أَمْرُهَا شَدِيدٌ غَيْرَ أَنَّهُ إِنْ أَتَاهَا فَلَا يُنْزِلْ عَلَيْهَا حَتَّى يَسْتَبِينَ لَهُ إِنْ كَانَ بِهَا حَبَلٌ قُلْتُ وَ فِي كَمْ يَسْتَبِينُ لَهُ قَالَ فِي خَمْسٍ وَ أَرْبَعِينَ لَيْلَةً ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, form his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said regarding a man who bought a slave girl, there not being a companion of hers sleeping with her. Does he have to clear her womb?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘A slave girl who does not menstruate, how would he deal with it?’ ", "He<sup>asws</sup> said: ‘Her matter is difficult, apart from that if he does go to her, so he should not (make the water) descend to her until it becomes clear for him, if there was a pregnancy for her’. I said, ‘And in how much (time) would it become clear for him?’ He<sup>asws</sup> said: ‘In forty five nights’."]}}, {"index": 9946, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:3:113:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ بُكَيْرٍ عَنْ هِشَامِ بْنِ الْحَارِثِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ أَوْ لِأَبِي جَعْفَرٍ ( عليه السلام ) الْجَارِيَةُ يَشْتَرِيهَا الرَّجُلُ وَ هِيَ لَمْ تُدْرِكْ أَوْ قَدْ يَئِسَتْ مِنَ الْمَحِيضِ قَالَ فَقَالَ لَا بَأْسَ بِأَنْ لَا يَسْتَبْرِئَهَا ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Ibn Bukeyr, from Hisham Bin Al Haris, from Abdullah Bin Amro who said, ", "‘I said to Abu Abdullah<sup>asws</sup> or to Abu Ja’far<sup>asws</sup>, ‘The slave girl whom the man buys, and she has yet to be an adult, or has despaired from the menstruation’. So he<sup>asws</sup> said: ‘There is no problem if he does not clear her womb’."]}}, {"index": 9947, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:5:3:113:4", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي الرَّجُلِ يَشْتَرِي الْأَمَةَ مِنْ رَجُلٍ فَيَقُولُ إِنِّي لَمْ أَطَأْهَا فَقَالَ إِنْ وَثِقَ بِهِ فَلَا بَأْسَ بِأَنْ يَأْتِيَهَا وَ قَالَ فِي رَجُلٍ يَبِيعُ الْأَمَةَ مِنْ رَجُلٍ فَقَالَ عَلَيْهِ أَنْ يَسْتَبْرِئَ مِنْ قَبْلِ أَنْ يَبِيعَ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hafs Bin Al Bakhtary, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said regarding the man who bought the slave girl from a man, so he was saying, ‘I did not sleep with her’. So he<sup>asws</sup> said: ‘If he can be trusted with it, so there is no problem if he were to go to her’. And he<sup>asws</sup> said regarding a man who sells the slave girl to a man, so he<sup>asws</sup> said: ‘Upon him is that he clears her womb before he sells her’."]}}, {"index": 9948, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:5:3:113:5", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ رَبِيعِ بْنِ الْقَاسِمِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْجَارِيَةِ الَّتِي لَمْ تَبْلُغِ الْمَحِيضَ وَ يُخَافُ عَلَيْهَا الْحَبَلُ فَقَالَ يَسْتَبْرِئُ رَحِمَهَا الَّذِي يَبِيعُهَا بِخَمْسٍ وَ أَرْبَعِينَ لَيْلَةً وَ الَّذِي يَشْتَرِيهَا بِخَمْسٍ وَ أَرْبَعِينَ لَيْلَةً ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from one of his companions, form Aban Bin Uman, from Rabie Bin Al Qasim who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about the slave girl who had not reached menstruation, and he feared of the pregnancy upon her. So he<sup>asws</sup> said: ‘He should clear her womb, the one who sold her, by forty five nights, and the one who buys her, by forty five days’."]}}, {"index": 9949, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:5:3:113:6", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ فِي رَجُلٍ ابْتَاعَ جَارِيَةً وَ لَمْ تَطْمَثْ قَالَ إِنْ كَانَتْ صَغِيرَةً وَ لَا يُتَخَوَّفُ عَلَيْهَا الْحَبَلُ فَلَيْسَ بِهِ عَلَيْهَا عِدَّةٌ وَ لْيَطَأْهَا إِنْ شَاءَ وَ إِنْ كَانَتْ قَدْ بَلَغَتْ وَ لَمْ تَطْمَثْ فَإِنَّ عَلَيْهَا الْعِدَّةَ ", "قَالَ وَ سَأَلْتُهُ عَنْ رَجُلٍ اشْتَرَى جَارِيَةً وَ هِيَ حَائِضٌ قَالَ إِذَا طَهُرَتْ فَلْيَمَسَّهَا إِنْ شَاءَ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said regarding a man was sold a slave girl and she did not menstruate. He<sup>asws</sup> said: ‘If she was young and he does not fear the pregnancy upon her, so there is no waiting period upon her with him, and let him go to her if he so desires; and it was such that she had reached puberty and did not menstruate, so upon her would be the waiting period’. ", "He (the narrator) said, ‘And I asked him<sup>asws</sup> about a man who bought a slave girl and she was menstruating. He<sup>asws</sup> said: ‘When she is pure, so let him touch her if he so desires to’."]}}, {"index": 9950, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:5:3:113:7", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَشْتَرِي الْجَارِيَةَ وَ لَمْ تَحِضْ قَالَ يَعْتَزِلُهَا شَهْراً إِنْ كَانَتْ قَدْ مُسَّتْ قَالَ أَ فَرَأَيْتَ إِنِ ابْتَاعَهَا وَ هِيَ طَاهِرٌ وَ زَعَمَ صَاحِبُهَا أَنَّهُ لَمْ يَطَأْهَا مُنْذُ طَهُرَتْ قَالَ إِنْ كَانَ عِنْدَكَ أَمِيناً فَمَسَّهَا وَ قَالَ إِنَّ ذَا الْأَمْرَ شَدِيدٌ فَإِنْ كُنْتَ لَا بُدَّ فَاعِلًا فَتَحَفَّظْ لَا تُنْزِلْ عَلَيْهَا ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Abdullah Bin Sinan who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about the man who buys the slave girl and she does not menstruate. He<sup>asws</sup> said: ‘He would isolate her for a month if she had been touched’. He said, ‘So what is your<sup>asws</sup> view if he would sell her and her owner claimed that he had not slept with her since she was pure?’ He<sup>asws</sup> said: ‘If he was trustworthy with him, so he can touch her’. And he<sup>asws</sup> said: ‘That is the difficult matter. So, if it was inevitable that he does it, so he should be careful he does not let the water descend into her’."]}}, {"index": 9951, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:5:3:113:8", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ أَخِيهِ الْحَسَنِ عَنْ زُرْعَةَ بْنِ مُحَمَّدٍ عَنْ سَمَاعَةَ قَالَ سَأَلْتُهُ عَنْ رَجُلٍ اشْتَرَى جَارِيَةً وَ هِيَ طَامِثٌ أَ يَسْتَبْرِئُ رَحِمَهَا بِحَيْضَةٍ أُخْرَى أَمْ تَكْفِيهِ هَذِهِ الْحَيْضَةُ فَقَالَ لَا بَلْ تَكْفِيهِ هَذِهِ الْحَيْضَةُ فَإِنِ اسْتَبْرَأَهَا بِأُخْرَى فَلَا بَأْسَ هِيَ بِمَنْزِلَةِ فَضْلٍ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from his brother Al Hassan, from Zurara Bin Muhammad, from Sama’at who said, ", "‘I asked about a man who bought a slave girl and she menstruated. Should he clear her womb with another menstruation or would this menstruation suffice?’ So he<sup>asws</sup> said: ‘No, but this menstruation would suffice. But, if he were to clear her woman with another (menstruation), so there is no problem. It would be in a state of preference’."]}}, {"index": 9952, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:5:3:113:9", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُوسَى بْنِ بَكْرٍ عَنْ زُرَارَةَ عَنْ حُمْرَانَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ رَجُلٍ اشْتَرَى أَمَةً هَلْ يُصِيبُ مِنْهَا دُونَ الْغِشْيَانِ وَ لَمْ يَسْتَبْرِئْهَا قَالَ نَعَمْ إِذَا اسْتَوْجَبَهَا وَ صَارَتْ مِنْ مَالِهِ فَإِنْ مَاتَتْ كَانَتْ مِنْ مَالِهِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Musa Bin Bakr, from Zurara, from Humran who said, ", "‘I asked Abu Ja’far<sup>asws</sup> about a man who bought a slave girl. Can he attain from her besides the overwhelming (copulation), and he has not cleared her womb?’ He<sup>asws</sup> said: ‘Yes, when it Obligates her, and she comes to be from his wealth. So if she were to die, it would be from his wealth’."]}}, {"index": 9953, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:5:3:113:10", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ أَحْمَدَ بْنِ الْحَسَنِ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ مُصَدِّقِ بْنِ صَدَقَةَ عَنْ عَمَّارِ بْنِ مُوسَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ اشْتَرَى مِنْ رَجُلٍ جَارِيَةً بِثَمَنٍ مُسَمًّى ثُمَّ افْتَرَقَا قَالَ وَجَبَ الْبَيْعُ وَ لَيْسَ لَهُ أَنْ يَطَأَهَا وَ هِيَ عِنْدَ صَاحِبِهَا حَتَّى يَقْبِضَهَا وَ يُعْلِمَ صَاحِبَهَا وَ الثَّمَنُ إِذَا لَمْ يَكُونَا اشْتَرَطَا فَهُوَ نَقْدٌ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Ahmad Bin Al Hassan, from Amro Bin Saeed, from Musaddaq Bin Sadaqa, from Ammar Bin Musa, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who bought a slave girl from a man with a specified price. Then separated. He<sup>asws</sup> said: ‘The sale is obligated and it is not for him that he sleeps with her and she is (still) with her owner until he takes possession of her, and he lets her owner know; and the price, when it was not stipulated, so it is cash’."]}}]}, "index": "al-kafi:5:3:113", "kind": "verse_list"}