{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:5:3", "titles": {"ar": "كتاب النِّكَاحِ", "en": "THE BOOK OF MARRIAGE"}}, {"indexed_titles": {"en": "Chapter 120"}, "path": "/books/al-kafi:5:3:120", "titles": {"ar": "باب الرَّجُلُ يُزَوِّجُ عَبْدَهُ أَمَتَهُ", "en": "Chapter 120 – The man marries his slave to his slave girl"}}], "index": 1489, "local_index": 120, "part_type": "Chapter", "path": "/books/al-kafi:5:3:120", "titles": {"ar": "باب الرَّجُلُ يُزَوِّجُ عَبْدَهُ أَمَتَهُ", "en": "Chapter 120 – The man marries his slave to his slave girl"}, "verse_count": 3, "verse_start_index": 9978, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 9979, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:3:120:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الرَّجُلُ كَيْفَ يُنْكِحُ عَبْدَهُ أَمَتَهُ قَالَ يَقُولُ قَدْ أَنْكَحْتُكَ فُلَانَةَ وَ يُعْطِيهَا مَا شَاءَ مِنْ قِبَلِهِ أَوْ مِنْ قِبَلِ مَوْلَاهُ وَ لَوْ مُدّاً مِنْ طَعَامٍ أَوْ دِرْهَماً أَوْ نَحْوَ ذَلِكَ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘How can the man marry his slave to his slave girl?’ He<sup>asws</sup> said: ‘He should be saying, ‘I hereby marry you, so and so slave girl’, and give some whatever he so desires to from himself, or on behalf of his slave, though it be a handful of foodstuff, or a Dirham, or approximately that’."]}}, {"index": 9980, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:3:120:2", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي الْمَمْلُوكِ فَتَكُونُ لِمَوْلَاهُ أَوْ لِمَوْلَاتِهِ أَمَةٌ فَيُرِيدُ أَنْ يَجْمَعَ بَيْنَهُمَا أَ يُنْكِحُهُ نِكَاحاً أَوْ يُجْزِئُهُ أَنْ يَقُولَ قَدْ أَنْكَحْتُكَ فُلَانَةَ وَ يُعْطِي مِنْ قِبَلِهِ شَيْئاً أَوْ مِنْ قِبَلِ الْعَبْدِ قَالَ نَعَمْ وَ لَوْ مُدّاً وَ قَدْ رَأَيْتُهُ يُعْطِي الدِّرْهَمَ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Abdullah Bin Muhammad, from Ali Bin Al Hakam, from Aban, from Muhammad Bin Muslim, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the owned slave, so there happens to be for his master or for her mistress, a slave girl. So he intends to gather between the two of them. Would his marriage be a (valid) marriage, or would it suffice him if he is saying, ‘I have married you to so and so woman, and he gives something from himself, or on behalf of the slave?’ He<sup>asws</sup> said: ‘Yes, and even if it is a handful, and it is my<sup>asws</sup> view that he should give the Dirham’."]}}, {"index": 9981, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:3:120:3", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَبِي إِسْحَاقَ الْخَفَّافِ عَنْ مُحَمَّدِ بْنِ أَبِي زَيْدٍ عَنْ أَبِي هَارُونَ الْمَكْفُوفِ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَ يَسُرُّكَ أَنْ يَكُونَ لَكَ قَائِدٌ يَا أَبَا هَارُونَ قَالَ قُلْتُ نَعَمْ جُعِلْتُ فِدَاكَ قَالَ فَأَعْطَانِي ثَلَاثِينَ دِينَاراً فَقَالَ اشْتَرِ خَادِماً كُسُومِيّاً فَاشْتَرَاهُ فَلَمَّا أَنْ حَجَّ دَخَلَ عَلَيْهِ فَقَالَ لَهُ كَيْفَ رَأَيْتَ قَائِدَكَ يَا أَبَا هَارُونَ فَقَالَ خَيْراً ", "فَأَعْطَاهُ خَمْسَةً وَ عِشْرِينَ دِينَاراً فَقَالَ لَهُ اشْتَرِ جَارِيَةً شَبَانِيَّةً فَإِنَّ أَوْلَادَهُنَّ قُرَّةٌ فَاشْتَرَيْتُ جَارِيَةً شَبَانِيَّةً فَزَوَّجْتُهَا مِنْهُ فَأَصَبْتُ ثَلَاثَ بَنَاتٍ فَأَهْدَيْتُ وَاحِدَةً مِنْهُنَّ إِلَى بَعْضِ وُلْدِ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ أَرْجُو أَنْ يَجْعَلَ ثَوَابِي مِنْهَا الْجَنَّةَ وَ بَقِيَتْ بِنْتَانِ مَا يَسُرُّنِي بِهِنَّ أُلُوفٌ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Abu Is’haq Al Khannaf, from Muhammad Bin Abu Zayd, from Abu Haroun Al Makfouf who said, ", "‘Abu Abdullah<sup>asws</sup> said to me: ‘Would it cheer you up if there happened to be a (travel) guide for you, O Abu Haroun! I said, ‘Yes, may I be sacrificed for you<sup>asws</sup>! So he<sup>asws</sup> gave me thirty Dinars and said: ‘Buy a male <span class=\"iTxt\">Kasoumiyya</span> servant’. So I bought him. So when I went to Hajj, I went over to him<sup>asws</sup>. (He (the narrator) said, ‘So he<sup>asws</sup> said to him: ‘How do you see your (travel) guide, O Abu Haroun?’ So he said, ‘Good’. ", "So he<sup>asws</sup> gave him twenty five Dinars and said to him: ‘Buy a slave girl, for her children would be a delight’. So I bought a young slave girl and got her married to him. So she attained three daughters, and I gifted one of them to one of the children of Abu Abdullah<sup>asws</sup>, and hoped that he<sup>asws</sup> would make my Reward from it to be the Paradise, and I remained with two, what made me to be cheerful thousands of times’."]}}]}, "index": "al-kafi:5:3:120", "kind": "verse_list"}