{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:5:3", "titles": {"ar": "كتاب النِّكَاحِ", "en": "THE BOOK OF MARRIAGE"}}, {"indexed_titles": {"en": "Chapter 122"}, "path": "/books/al-kafi:5:3:122", "titles": {"ar": "باب الرَّجُلِ يَشْتَرِي الْجَارِيَةَ وَ لَهَا زَوْجٌ حُرٌّ أَوْ عَبْدٌ", "en": "Chapter 122 – The man buys the slave girl, and for her is a husband, be he free or a slave"}}], "index": 1491, "local_index": 122, "part_type": "Chapter", "path": "/books/al-kafi:5:3:122", "titles": {"ar": "باب الرَّجُلِ يَشْتَرِي الْجَارِيَةَ وَ لَهَا زَوْجٌ حُرٌّ أَوْ عَبْدٌ", "en": "Chapter 122 – The man buys the slave girl, and for her is a husband, be he free or a slave"}, "verse_count": 5, "verse_start_index": 9985, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 9986, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:3:122:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ إِسْمَاعِيلَ</span> عَنِ الْفَضْلِ بْنِ شَاذَانَ وَ أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ جَمِيعاً عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ ابْنِ مُسْكَانَ عَنِ الْحَسَنِ بْنِ زِيَادٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ اشْتَرَى جَارِيَةً يَطَؤُهَا فَبَلَغَهُ أَنَّ لَهَا زَوْجاً قَالَ يَطَؤُهَا فَإِنَّ بَيْعَهَا طَلَاقُهَا وَ ذَلِكَ أَنَّهُمَا لَا يَقْدِرَانِ عَلَى شَيْ‏ءٍ مِنْ أَمْرِهِمَا إِذَا بِيعَا ."], "translations": {"en.hubeali": ["Muhammad Bin Ismail, from Al Fazl Bin Shazaan, and Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, altogether from Safwan Bin Yahya, from Ibn Muskan, from Al Hassan Bin Ziyad who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about a man who bought a slave girl. He slept with her, and (news) reached him that for her is a husband. He<sup>asws</sup> said: ‘He can sleep with her, for her sale is her divorce, and that is because they are both not able upon anything from their matters, when there is a sale’."]}}, {"index": 9987, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:3:122:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيِّ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْأَمَةِ تُبَاعُ وَ لَهَا زَوْجٌ فَقَالَ صَفْقَتُهَا طَلَاقُهَا ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Rabie Bin Abdullah, from Abdul Rahman Bin Abu Abdullah who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about the slave girl who is sold and for her is a husband. So he<sup>asws</sup> said: ‘Her take-over is her divorce’."]}}, {"index": 9988, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:3:122:3", "text": ["عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ بُكَيْرِ بْنِ أَعْيَنَ وَ بُرَيْدِ بْنِ مُعَاوِيَةَ عَنْ أَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَا مَنِ اشْتَرَى مَمْلُوكَةً لَهَا زَوْجٌ فَإِنَّ بَيْعَهَا طَلَاقُهَا فَإِنْ شَاءَ الْمُشْتَرِي فَرَّقَ بَيْنَهُمَا وَ إِنْ شَاءَ تَرَكَهُمَا عَلَى نِكَاحِهِمَا."], "translations": {"en.hubeali": ["Ali, from his father, from Ibn Abu Umeyr, from Ibn Azina, from Bukeyr Bin Ayn, and Bureyd Bin Muawiya, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup> both having said: ‘The one who buys a slave girl who has a husband for her, so her sale is her divorce. So, if the buyer so desires to, he effects separation between them, and if he so desires to he leaves them both upon their marriage’."]}}, {"index": 9989, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:5:3:122:4", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ طَلَاقُ الْأَمَةِ بَيْعُهَا أَوْ بَيْعُ زَوْجِهَا وَ قَالَ فِي الرَّجُلِ يُزَوِّجُ أَمَتَهُ رَجُلًا حُرّاً ثُمَّ يَبِيعُهَا قَالَ هُوَ فِرَاقُ مَا بَيْنَهُمَا إِلَّا أَنْ يَشَاءَ الْمُشْتَرِي أَنْ يَدَعَهُمَا ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Al A'ala Bin Razeyn, from Muhammad Bin Muslim, ", "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup> having said: ‘A divorce of the slave girl is her sale, or sale of her husband’. And he<sup>asws</sup> said regarding the man who married his slave girl to a free man, then sold her. He<sup>asws</sup> said: ‘It is a separation of what is between them unless the buyer so desires to leave them (to be upon their marriage)’."]}}, {"index": 9990, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:5:3:122:5", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنِ الْعَبَّاسِ بْنِ مَعْرُوفٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ عَنْ زُرْعَةَ عَنْ سَمَاعَةَ قَالَ سَأَلْتُهُ عَنْ رَجُلَيْنِ بَيْنَهُمَا أَمَةٌ فَزَوَّجَاهَا مِنْ رَجُلٍ ثُمَّ إِنَّ رَجُلًا اشْتَرَى بَعْضَ السَّهْمَيْنِ قَالَ حَرُمَتْ عَلَيْهِ بِشِرَائِهِ إِيَّاهَا وَ ذَلِكَ أَنَّ بَيْعَهَا طَلَاقُهَا إِلَّا أَنْ يَشْتَرِيَهَا مِنْ جَمِيعِهِمْ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Al Abbas Bin Marouf, from Al Hassan Bin Muhammad, from Zurara, from Sama’at who said, ", "‘I asked him<sup>asws</sup> about two men who had a slave girl between them, so they got her married to a man. Then the man bought part of their shares. He<sup>asws</sup> said: ‘She is Prohibited unto him by his stipulation of her, and that is that her sale is her divorce, unless he buys her from them entirely’."]}}]}, "index": "al-kafi:5:3:122", "kind": "verse_list"}