{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:5:3", "titles": {"ar": "كتاب النِّكَاحِ", "en": "THE BOOK OF MARRIAGE"}}, {"indexed_titles": {"en": "Chapter 125"}, "path": "/books/al-kafi:5:3:125", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الْأَمَةُ تَكُونُ</span> تَحْتَ الْمَمْلُوكِ فَتُعْتَقُ أَوْ يُعْتَقَانِ جَمِيعاً", "en": "Chapter 125 – The slave girl who happens to be under the owned slave, so she is emancipated, or they are both emancipated together"}}], "index": 1494, "local_index": 125, "part_type": "Chapter", "path": "/books/al-kafi:5:3:125", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الْأَمَةُ تَكُونُ</span> تَحْتَ الْمَمْلُوكِ فَتُعْتَقُ أَوْ يُعْتَقَانِ جَمِيعاً", "en": "Chapter 125 – The slave girl who happens to be under the owned slave, so she is emancipated, or they are both emancipated together"}, "verse_count": 6, "verse_start_index": 9996, "verses": [{"index": 9997, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:3:125:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ أَمَةٍ كَانَتْ تَحْتَ عَبْدٍ فَأُعْتِقَتِ الْأَمَةُ قَالَ أَمْرُهَا بِيَدِهَا إِنْ شَاءَتْ تَرَكَتْ نَفْسَهَا مَعَ زَوْجِهَا وَ إِنْ شَاءَتْ نَزَعَتْ نَفْسَهَا مِنْهُ \nوَ ذَكَرَ أَنَّ بَرِيرَةَ كَانَتْ عِنْدَ زَوْجٍ لَهَا وَ هِيَ مَمْلُوكَةٌ فَاشْتَرَتْهَا عَائِشَةُ فَأَعْتَقَتْهَا فَخَيَّرَهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ قَالَ إِنْ شَاءَتْ أَنْ تَقِرَّ عِنْدَ زَوْجِهَا وَ إِنْ شَاءَتْ فَارَقَتْهُ وَ كَانَ مَوَالِيهَا الَّذِينَ بَاعُوهَا اشْتَرَطُوا عَلَى عَائِشَةَ أَنَّ لَهُمْ وَلَاءَهَا فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْوَلَاءُ لِمَنْ أَعْتَقَ \nوَ تُصُدِّقَ عَلَى بَرِيرَةَ بِلَحْمٍ فَأَهْدَتْهُ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَعَلَّقَتْهُ عَائِشَةُ وَ قَالَتْ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) لَا يَأْكُلُ لَحْمَ الصَّدَقَةِ فَجَاءَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ اللَّحْمُ مُعَلَّقٌ فَقَالَ مَا شَأْنُ هَذَا اللَّحْمِ لَمْ يُطْبَخْ فَقَالَتْ يَا رَسُولَ اللَّهِ صُدِّقَ بِهِ عَلَى بَرِيرَةَ وَ أَنْتَ لَا تَأْكُلُ الصَّدَقَةَ فَقَالَ هُوَ لَهَا صَدَقَةٌ وَ لَنَا هَدِيَّةٌ ثُمَّ أَمَرَ بِطَبْخِهِ فَجَاءَ فِيهَا ثَلَاثٌ مِنَ السُّنَنِ . ", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby who said, \n‘I asked Abu Abdullah<sup>asws</sup> about a slave girl who was under a slave, so the slave girl was emancipated. He<sup>asws</sup> said: ‘Her command is in her hands. If she so desires to she leaves herself with her husband, and if she so desires to she removes herself from him’. \nAnd he<sup>asws</sup> mentioned that Bureyra was with a husband of hers, and she was an owned slave. So Ayesha bought her and emancipated her. So Rasool-Allah<sup>saww</sup> gave her a choice and said: ‘If she so desires to she stays with her husband, and if she so desires to, she separates from him’; and it was so that her masters who had sold her had stipulated upon Ayesha that her mastership would be for them. So Rasool-Allah<sup>saww</sup> said: ‘The mastership is for the one who emancipates’.\nAnd some meat was given in charity to Bureyra, so she gifted it to Rasool-Allah<sup>saww</sup>. So Ayesha kept it aside and said, ‘Rasool-Allah<sup>saww</sup> does not eat the charity’. So Rasool-Allah<sup>saww</sup> came over and the meat was kept aside, so he<sup>saww</sup> said: ‘What is the matter with this meat not having been cooked?’ So she said, ‘O Rasool-Allah<sup>saww</sup>! It was given in charity with upon Bureyra and you<sup>saww</sup> do not eat the charity’. So he<sup>saww</sup> said: ‘It is a charity for her, and for us<sup>saww</sup> it is a gift’. Then he<sup>saww</sup> ordered with cooking it. Thus, there flowed three Sunnahs in it’."}]}, {"index": 9998, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:3:125:2", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عِيصِ بْنِ الْقَاسِمِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ بَرِيرَةَ كَانَ لَهَا زَوْجٌ فَلَمَّا أُعْتِقَتْ خُيِّرَتْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Safwan Bin Yahya, from Ays Bin Al Qasim who said, \n‘Abu Abdullah<sup>asws</sup> said: ‘Bureyra had a husband for her. So when she was emancipated, she had a choice (to be with him or not)’."}]}, {"index": 9999, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:3:125:3", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِذَا أَعْتَقْتَ مَمْلُوكَيْكَ رَجُلًا وَ امْرَأَتَهُ فَلَيْسَ بَيْنَهُمَا نِكَاحٌ وَ قَالَ إِنْ أَحْبَبْتَ أَنْ يَكُونَ زَوْجَهَا كَانَ ذَلِكَ بِصَدَاقٍ \nقَالَ وَ سَأَلْتُهُ عَنِ الرَّجُلِ يُنْكِحُ عَبْدَهُ أَمَتَهُ ثُمَّ أَعْتَقَهَا تُخَيَّرُ فِيهِ أَمْ لَا قَالَ نَعَمْ تُخَيَّرُ فِيهِ إِذَا أُعْتِقَتْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Abdullah Bin Sinan who said, \n‘I heard Abu Abdullah<sup>asws</sup> saying: ‘When two owned slaves of yours, a man and his wife, are emancipated, so there is no marriage between them’. And he<sup>asws</sup> said: ‘If she so likes, he can be her husband, and that would be with a dower’.\nHe (the narrator) said, ‘And I asked him<sup>asws</sup> about the man who got his slave to be married to his slave girl. Then he emancipated her. Would she have a choice regarding it or not?’ He<sup>asws</sup> said: ‘Yes, she would have a choice in it (to stay with him or not) when she is emancipated’."}]}, {"index": 10000, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:5:3:125:4", "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانٍ عَمَّنْ حَدَّثَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي بَرِيرَةَ ثَلَاثٌ مِنَ السُّنَنِ حِينَ أُعْتِقَتْ فِي التَّخْيِيرِ وَ فِي الصَّدَقَةِ وَ فِي الْوَلَاءِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Humeyd Bin Ziyad, from Ibn Sama’at, from someone else, from Aban, from the one who narrated it, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘Regarding Bureyra, there are three Sunnahs when she was emancipated – regarding the choice, and regarding the charity, and regarding the mastership’."}]}, {"index": 10001, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:5:3:125:5", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ ذَكَرَ أَنَّ بَرِيرَةَ مَوْلَاةَ عَائِشَةَ كَانَ لَهَا زَوْجٌ عَبْدٌ فَلَمَّا أُعْتِقَتْ قَالَ لَهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) اخْتَارِي إِنْ شِئْتِ أَقَمْتِ مَعَ زَوْجِكِ وَ إِنْ شِئْتِ فَلَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Usman Bin Isa, from Sama’at who said, \n‘(He<sup>asws</sup>) mentioned that Bureyra was a slave of Ayesha and had a husband for her who was a slave. So when she was emancipated, Rasool-Allah<sup>saww</sup> said to her: ‘Choose! If you so desire to you can stay with your husband, and if your so desire to, so no’."}]}, {"index": 10002, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:5:3:125:6", "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ رِبْعِيِّ بْنِ عَبْدِ اللَّهِ عَنْ بُرَيْدِ بْنِ مُعَاوِيَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ زَوْجُ بَرِيرَةَ عَبْداً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Ibn Abu Umeyr, from Rabie Bin Abdullah, from Bureyd Bin Muawiya, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The husband of Bureyra was a slave’."}]}]}, "index": "al-kafi:5:3:125", "kind": "verse_list"}