{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:5:3", "titles": {"ar": "كتاب النِّكَاحِ", "en": "THE BOOK OF MARRIAGE"}}, {"indexed_titles": {"en": "Chapter 130"}, "path": "/books/al-kafi:5:3:130", "titles": {"ar": "باب نَادِرٌ", "en": "Chapter 130 – Miscellaneous"}}], "index": 1499, "local_index": 130, "part_type": "Chapter", "path": "/books/al-kafi:5:3:130", "titles": {"ar": "باب نَادِرٌ", "en": "Chapter 130 – Miscellaneous"}, "verse_count": 1, "verse_start_index": 10012, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 10013, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:3:130:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ دَاوُدَ بْنِ فَرْقَدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَتَى رَجُلٌ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي خَرَجْتُ وَ امْرَأَتِي حَائِضٌ فَرَجَعْتُ وَ هِيَ حُبْلَى فَقَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ تَتَّهِمُ قَالَ أَتَّهِمُ رَجُلَيْنِ قَالَ ائْتِ بِهِمَا فَجَاءَ بِهِمَا فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنْ يَكُ ابْنَ هَذَا فَيَخْرُجُ قَطَطاً كَذَا وَ كَذَا فَخَرَجَ كَمَا قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَجَعَلَ مَعْقُلَتَهُ عَلَى قَوْمِ أُمِّهِ وَ مِيرَاثَهُ لَهُمْ وَ لَوْ أَنَّ إِنْسَاناً قَالَ لَهُ يَا ابْنَ الزَّانِيَةِ يُجْلَدُ الْحَدَّ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from one of his companions, from Dawood Bin Farqad, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A man came over to Rasool-Allah<sup>saww</sup>, so he said, ‘O Rasool-Allah<sup>saww</sup>! I went out and my wife was menstruating. So when I came back, she was pregnant’. So Rasool-Allah<sup>saww</sup> said to him: ‘Whom are you accusing?’ He said, ‘They are two men’. He<sup>saww</sup> said: ‘Come with both of them’. So he came with both of them. So Rasool-Allah<sup>saww</sup> said: ‘If this is his son, it would come out as a cat’. So it came out just as Rasool-Allah<sup>saww</sup> had said. So its mother’s family went out protecting it from the people, and his inheritance is for them; and had it been a human being, and it was said to him, ‘O son of an adulteress’, he (the accuser) would be whipped the legal punishment (<span class=\"iTxt\">Hadd</span>)’."]}}]}, "index": "al-kafi:5:3:130", "kind": "verse_list"}