{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 130"
        },
        "path": "/books/al-kafi:5:3:130",
        "titles": {
          "ar": "باب الرَّجُلِ يَقَعُ عَلَى جَارِيَتِهِ فَيَقَعُ عَلَيْهَا غَيْرُهُ فِي ذَلِكَ الطُّهْرِ فَتَحْبَلُ ",
          "en": "Chapter 128 – The man falls upon his slave girl, and someone else falls upon her during that very pure period, so she becomes pregnant"
        }
      }
    ],
    "index": 1501,
    "local_index": 130,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 131"
        },
        "path": "/books/al-kafi:5:3:131",
        "titles": {
          "ar": "بَابُ الرَّجُلِ يَكُونُ لَهُ الْجَارِيَةُ يَطَؤُهَا فَتَحْبَلُ فَيَتَّهِمُهَا .",
          "en": "Chapter 129 – The man happens to have a slave girl, so he sleeps with her, and she falls pregnant, so he accuses her"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 129"
        },
        "path": "/books/al-kafi:5:3:129",
        "titles": {
          "ar": "باب الرَّجُلُ يَشْتَرِي الْجَارِيَةَ الْحَامِلَ فَيَطَؤُهَا فَتَلِدُ عِنْدَهُ",
          "en": "Chapter 127 – The man buys the pregnant slave girl, so he sleeps with her, and she gives birth with him"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:3:130",
    "titles": {
      "ar": "باب الرَّجُلِ يَقَعُ عَلَى جَارِيَتِهِ فَيَقَعُ عَلَيْهَا غَيْرُهُ فِي ذَلِكَ الطُّهْرِ فَتَحْبَلُ ",
      "en": "Chapter 128 – The man falls upon his slave girl, and someone else falls upon her during that very pure period, so she becomes pregnant"
    },
    "verse_count": 2,
    "verse_start_index": 10009,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 10010,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:130:1",
        "text": [
          " إِنَّ رَجُلًا مِنَ الْأَنْصَارِ أَتَى أَبِي ( عليه السلام ) فَقَالَ إِنِّي ابْتُلِيتُ بِأَمْرٍ عَظِيمٍ إِنَّ لِي جَارِيَةً كُنْتُ أَطَأُهَا فَوَطِئْتُهَا يَوْماً وَ خَرَجْتُ فِي حَاجَةٍ لِي بَعْدَ مَا اغْتَسَلْتُ مِنْهَا وَ نَسِيتُ نَفَقَةً لِي فَرَجَعْتُ إِلَى الْمَنْزِلِ لآِخُذَهَا فَوَجَدْتُ غُلَامِي عَلَى بَطْنِهَا فَعَدَدْتُ لَهَا مِنْ يَوْمِي ذَلِكَ تِسْعَةَ أَشْهُرٍ فَوَلَدَتْ جَارِيَةً ",
          "قَالَ فَقَالَ لَهُ أَبِي ( عليه السلام ) لَا يَنْبَغِي لَكَ أَنْ تَقْرَبَهَا وَ لَا أَنْ تَبِيعَهَا وَ لَكِنْ أَنْفِقْ عَلَيْهَا مِنْ مَالِكَ مَا دُمْتَ حَيّاً ثُمَّ أَوْصِ عِنْدَ مَوْتِكَ أَنْ يُنْفَقَ عَلَيْهَا مِنْ مَالِكَ حَتَّى يَجْعَلَ اللَّهُ لَهَا مَخْرَجاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, form Ahmad Bin Muhammad, and Ali Bin Ibrahim, from his father, altogether from Ibn Mahboub, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A man from the Helpers came over to my<sup>asws</sup> father<sup>asws</sup>, so he said, ‘I am afflicted with a grievous matter. There is a slave girl for me which I had slept with. So, one day I slept with her, and went out regarding a need of mine, after having washed from it, and I forgot my expenses. So returned to the house in order to take it, and I found my slave upon her belly. So I counted for her nine months from that day of mine, and the slave girl gave birth’.",
            "He<sup>asws</sup> said: ‘So my<sup>asws</sup> father<sup>asws</sup> said to me: ‘It is not befitting for you that you go near her, nor that you should sell her, but spend upon her from your wealth for as long as she is alive. Then bequeath at your death that he (your successor) should spend upon her from your wealth until Allah<sup>azwj</sup> Makes a way out for her’."
          ]
        }
      },
      {
        "index": 10011,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1696",
              "text": "مُحَمَّدِ بْنِ عَجْلَانَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ ابْنِ فَضَّالٍ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:130:2",
        "text": [
          " إِنَّ رَجُلًا مِنَ الْأَنْصَارِ أَتَى أَبَا جَعْفَرٍ ( عليه السلام ) فَقَالَ لَهُ إِنِّي قَدِ ابْتُلِيتُ بِأَمْرٍ عَظِيمٍ إِنِّي وَقَعْتُ عَلَى جَارِيَتِي ثُمَّ خَرَجْتُ فِي بَعْضِ حَوَائِجِي فَانْصَرَفْتُ مِنَ الطَّرِيقِ فَأَصَبْتُ غُلَامِي بَيْنَ رِجْلَيِ الْجَارِيَةِ فَاعْتَزَلْتُهَا فَحَبِلَتْ ثُمَّ وَضَعَتْ جَارِيَةً لِعِدَّةِ تِسْعَةِ أَشْهُرٍ ",
          "فَقَالَ لَهُ أَبُو جَعْفَرٍ ( عليه السلام ) احْبِسِ الْجَارِيَةَ لَا تَبِعْهَا وَ أَنْفِقْ عَلَيْهَا حَتَّى تَمُوتَ أَوْ يَجْعَلَ اللَّهُ لَهَا مَخْرَجاً فَإِنْ حَدَثَ بِكَ حَدَثٌ فَأَوْصِ بِأَنْ يُنْفَقَ عَلَيْهَا مِنْ مَالِكَ حَتَّى يَجْعَلَ اللَّهُ لَهَا مَخْرَجاً ",
          "وَ قَالَ إِذَا خَرَجْتَ مِنْ بَيْتِكَ فَقُلْ بِسْمِ اللَّهِ عَلَى دِينِي وَ نَفْسِي وَ وُلْدِي وَ أَهْلِي وَ مَالِي ثَلَاثَ مَرَّاتٍ ثُمَّ قُلِ اللَّهُمَّ بَارِكْ لَنَا فِي قَدَرِكَ وَ رَضِّنَا بِقَضَائِكَ حَتَّى لَا نُحِبَّ تَعْجِيلَ مَا أَخَّرْتَ وَ لَا تَأْخِيرَ مَا عَجَّلْتَ  "
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ibn Fazzal, from Muhammad Bin Ajlan who said that, ",
            "‘A man from the Helpers came over to Abu Ja’far<sup>asws</sup>, so he said to him<sup>asws</sup>, ‘I am afflicted with a grievous matter. I fell upon my slave girl, then I went out regarding one of my needs, and I turned back from the road, so I came across my slave between the two legs of the slave girl. So I isolated her, and she became pregnant. Then I place a waiting period of nine months on the slave girl’.",
            "So Abu Ja’far<sup>asws</sup> said to him: ‘Keep the slave girl and do not pursue her, and spend upon her until she dies, or Allah<sup>azwj</sup> Makes a way out for her. So if there occurs with you an occurrence (of death), so bequeath with the expenditure to be spent upon her from you wealth until Allah<sup>azwj</sup> Makes a way out for her’.",
            "And he (a.s.) said: ‘Whenever you go our from your house so say, ‘In the Name of Allah<sup>azwj</sup> upon myself, and my children, and my wife, and my wealth’ – three times. Then say, ‘O Allah (s.w.t.)! Bless for us in Your (s.w.t.) Measurement, and (Make us to be) Pleased with Your (s.w.t.) Judgement until we do not love the haste in what You (s.w.t.) Delay, nor (do we love) delay in what You (s.w.t.) Hasten’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:3:130",
  "kind": "verse_list"
}