{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:5:3", "titles": {"ar": "كتاب النِّكَاحِ", "en": "THE BOOK OF MARRIAGE"}}, {"indexed_titles": {"en": "Chapter 136"}, "path": "/books/al-kafi:5:3:136", "titles": {"ar": "باب كَرَاهِيَةِ الرَّهْبَانِيَّةِ وَ تَرْكِ الْبَاهِ ", "en": "Chapter 136 – Abhorrence of the monasticism and neglecting the copulation"}}], "index": 1505, "local_index": 136, "part_type": "Chapter", "path": "/books/al-kafi:5:3:136", "titles": {"ar": "باب كَرَاهِيَةِ الرَّهْبَانِيَّةِ وَ تَرْكِ الْبَاهِ ", "en": "Chapter 136 – Abhorrence of the monasticism and neglecting the copulation"}, "verse_count": 6, "verse_start_index": 10028, "verses": [{"index": 10029, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:3:136:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الْأَشْعَرِيِّ عَنِ ابْنِ الْقَدَّاحِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ جَاءَتِ امْرَأَةُ عُثْمَانَ بْنِ مَظْعُونٍ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ عُثْمَانَ يَصُومُ النَّهَارَ وَ يَقُومُ اللَّيْلَ فَخَرَجَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مُغْضَباً يَحْمِلُ نَعْلَيْهِ حَتَّى جَاءَ إِلَى عُثْمَانَ فَوَجَدَهُ يُصَلِّي فَانْصَرَفَ عُثْمَانُ حِينَ رَأَى رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ لَهُ يَا عُثْمَانُ لَمْ يُرْسِلْنِي اللَّهُ تَعَالَى بِالرَّهْبَانِيَّةِ وَ لَكِنْ بَعَثَنِي بِالْحَنِيفِيَّةِ السَّهْلَةِ السَّمْحَةِ أَصُومُ وَ أُصَلِّي وَ أَلْمِسُ أَهْلِي فَمَنْ أَحَبَّ فِطْرَتِي فَلْيَسْتَنَّ بِسُنَّتِي وَ مِنْ سُنَّتِيَ النِّكَاحُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ja’far Bin Muhammad Al Ashary, from Ibn Al Qaddah, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The wife of Usman Bin Mazoun came over to the Prophet<sup>saww</sup>, so she said, ‘O Rasool-Allah<sup>saww</sup>! Usman tends to Fast during the day, and he stands (for the Prayer) during the night’. So Rasool-Allah<sup>saww</sup> went out angered, carrying his<sup>saww</sup> slippers until he<sup>saww</sup> came over to Usman, and he<sup>saww</sup> found him Praying. So when Usman saw Rasool-Allah<sup>saww</sup> he finished it. So he<sup>saww</sup> said: ‘O Usman! Allah<sup>azwj</sup> the Exalted did not Send me<sup>saww</sup> with the monasticism, but He<sup>azwj</sup> Sent me<sup>saww</sup> with the straightness, and the ease, and the tolerance. I<sup>saww</sup> Fast, and I<sup>saww</sup> Pray, and I<sup>saww</sup> touch my<sup>saww</sup> wife. So the one who loves my<sup>saww</sup> nature, so let him adopt a way with my<sup>saww</sup> Sunnah, and from my<sup>saww</sup> Sunnah is the marriage’."}]}, {"index": 10030, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:3:136:2", "text": "جَعْفَرُ بْنُ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ الْقَدَّاحِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ لِرَجُلٍ أَصْبَحْتَ صَائِماً قَالَ لَا قَالَ فَأَطْعَمْتَ مِسْكِيناً قَالَ لَا قَالَ فَارْجِعْ إِلَى أَهْلِكَ فَإِنَّهُ مِنْكَ عَلَيْهِمْ صَدَقَةٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ja’far Bin Muhammad, from Abdullah Bin Al Qaddah, \n(It has been narrated) from Abu Abdullh<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said to a man: ‘Are you Fasting this morning?’ He said, ‘No’. He<sup>saww</sup> said: ‘Have you fed a poor one?’ He said, ‘No’. He<sup>saww</sup> said: ‘So return to your family, for it would be a charity from you, upon them’."}]}, {"index": 10031, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:3:136:3", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَكُونُ مَعَهُ أَهْلُهُ فِي السَّفَرِ لَا يَجِدُ الْمَاءَ أَ يَأْتِي أَهْلَهُ قَالَ مَا أُحِبُّ أَنْ يَفْعَلَ إِلَّا أَنْ يَخَافَ عَلَى نَفْسِهِ قَالَ قُلْتُ طَلَبَ بِذَلِكَ اللَّذَّةَ أَوْ يَكُونُ شَبِقاً إِلَى النِّسَاءِ قَالَ إِنَّ الشَّبِقَ يَخَافُ عَلَى نَفْسِهِ قُلْتُ يَطْلُبُ بِذَلِكَ اللَّذَّةَ قَالَ هُوَ حَلَالٌ \nقُلْتُ فَإِنَّهُ يُرْوَى عَنِ النَّبِيِّ ( صلى الله عليه وآله ) أَنَّ أَبَا ذَرٍّ رَحِمَهُ اللَّهُ سَأَلَهُ عَنْ هَذَا فَقَالَ ائْتِ أَهْلَكَ تُؤْجَرْ فَقَالَ يَا رَسُولَ اللَّهِ آتِيهِمْ وَ أُوجَرُ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كَمَا أَنَّكَ إِذَا أَتَيْتَ الْحَرَامَ أُزِرْتَ فَكَذَلِكَ إِذَا أَتَيْتَ الْحَلَالَ أُوجِرْتَ \nفَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَ لَا تَرَى أَنَّهُ إِذَا خَافَ عَلَى نَفْسِهِ فَأَتَى الْحَلَالَ أُوجِرَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, and Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Is’haq Bin Ammar who said, \n‘I asked Abu Abdullah<sup>asws</sup> about the man who happens to have his wife with him in the journey. He cannot find the water, can he sleep with his wife?’ He<sup>asws</sup> said: ‘I<sup>asws</sup> do not like it if he were to do so, except if he fears upon himsef’. I said, ‘He seeks the pleasure with that or he happens to have craving for the women?’. He<sup>asws</sup> said: ‘The craving is his fear upon himself’. I said, ‘He seeks the pleasure with that?’ He<sup>asws</sup> said: ‘It is Permissible’.\nI said, ‘But is has been reported from the Prophet<sup>saww</sup> that Abu Zarr<sup>as</sup> asked him<sup>saww</sup> about this, so he<sup>saww</sup> said: ‘Go to you wife, you will be Rewarded’. So he<sup>as</sup> said: ‘O Rasool-Allah<sup>saww</sup>! I<sup>as</sup> go to them and I<sup>as</sup> get Rewarded (for it)?’ So Rasool-Allah<sup>saww</sup> said: ‘Just as when you<sup>as</sup> go to the Prohibition, you<sup>as</sup> are burdened, so similar to that, when you go to the Permissible, you will be Rewarded’. \nSo Abu Abdullah<sup>asws</sup> said: ‘Do you not see that he, when he fears upon himself, so he goes to the Permissible, would be Rewarded?’"}]}, {"index": 10032, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:5:3:136:4", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ الْجَوْهَرِيِّ عَنْ إِسْحَاقَ بْنِ إِبْرَاهِيمَ الْجُعْفِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) دَخَلَ بَيْتَ أُمِّ سَلَمَةَ فَشَمَّ رِيحاً طَيِّبَةً فَقَالَ أَتَتْكُمُ الْحَوْلَاءُ فَقَالَتْ هُوَ ذَا هِيَ تَشْكُو زَوْجَهَا فَخَرَجَتْ عَلَيْهِ الْحَوْلَاءُ فَقَالَتْ بِأَبِي أَنْتَ وَ أُمِّي إِنَّ زَوْجِي عَنِّي مُعْرِضٌ فَقَالَ زِيدِيهِ يَا حَوْلَاءُ قَالَتْ مَا أَتْرُكُ شَيْئاً طَيِّباً مِمَّا أَتَطَيَّبُ لَهُ بِهِ وَ هُوَ عَنِّي مُعْرِضٌ فَقَالَ أَمَا لَوْ يَدْرِي مَا لَهُ بِإِقْبَالِهِ عَلَيْكِ قَالَتْ وَ مَا لَهُ بِإِقْبَالِهِ عَلَيَّ فَقَالَ أَمَا إِنَّهُ إِذَا أَقْبَلَ اكْتَنَفَهُ مَلَكَانِ فَكَانَ كَالشَّاهِرِ سَيْفَهُ فِي سَبِيلِ اللَّهِ فَإِذَا هُوَ جَامَعَ تَحَاتُّ عَنْهُ الذُّنُوبُ كَمَا يَتَحَاتُّ وَرَقُ الشَّجَرِ فَإِذَا هُوَ اغْتَسَلَ انْسَلَخَ مِنَ الذُّنُوبِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Abu Abdullah, from his father, from Al Qasim Bin Muhammad Al Jowhary, from Is’haq Bin Ibrahim Al Ju’fy who said, \n‘I heard Abu Abdullah<sup>asws</sup> saying that Rasool-Allah<sup>saww</sup> entered the chamber of Umm Salma<sup>as</sup>, so he<sup>saww</sup> smelt a good aroma. So he<sup>saww</sup> said: ‘Al-Hawla came to you<sup>as</sup>?’ So she<sup>as</sup> said, ‘It is so. She is complaining about her husband’. So Al-Hawla came out to him<sup>saww</sup> and she said, ‘May my father and my mother be sacrificed for you<sup>saww</sup>! My husband has turned away from me’ So he<sup>saww</sup> said: ‘Increase it (the perfuming), O Hawla’. She said, ‘I have not left any perfume from what I perfume myself for him with it, and he turns away from me’. So he<sup>saww</sup> said: ‘But, if only he knew what is for him with his facing towards you’. She said, ‘And what is for him with facing towards me?’ So he<sup>saww</sup> said: ‘But he, when he faces you, two Angels would encircle him, so he would be like the striker of his sword in the Way of Allah<sup>azwj</sup>. So when he copulates, the sins would fall off from him like the falling of the leaves of the tree. So when he bathes, his sins would be pulled away’."}]}, {"index": 10033, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:5:3:136:5", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَبِي دَاوُدَ الْمُسْتَرِقِّ عَنْ بَعْضِ رِجَالِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ ثَلَاثَ نِسْوَةٍ أَتَيْنَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَقَالَتْ إِحْدَاهُنَّ إِنَّ زَوْجِي لَا يَأْكُلُ اللَّحْمَ وَ قَالَتِ الْأُخْرَى إِنَّ زَوْجِي لَا يَشَمُّ الطِّيبَ وَ قَالَتِ الْأُخْرَى إِنَّ زَوْجِي لَا يَقْرَبُ النِّسَاءَ \nفَخَرَجَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَجُرُّ رِدَاءَهُ حَتَّى صَعِدَ الْمِنْبَرَ فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ ثُمَّ قَالَ مَا بَالُ أَقْوَامٍ مِنْ أَصْحَابِي لَا يَأْكُلُونَ اللَّحْمَ وَ لَا يَشَمُّونَ الطِّيبَ وَ لَا يَأْتُونَ النِّسَاءَ أَمَا إِنِّي آكُلُ اللَّحْمَ وَ أَشَمُّ الطِّيبَ وَ آتِي النِّسَاءَ فَمَنْ رَغِبَ عَنْ سُنَّتِي فَلَيْسَ مِنِّي .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Abu Dawood Al Mustaraq, from one of his men, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Three women came over to Rasool-Allah<sup>saww</sup>, so one of them said, ‘My husband does not eat the meat’, and the other one said, ‘My husband does not smell the perfume’, and the other one said, ‘My husband does not go near the women’. \nSo Rasool-Allah<sup>saww</sup> went out dragging his<sup>saww</sup> robe until he<sup>saww</sup> ascended the Pukpit. So he<sup>saww</sup> Praised Allah<sup>azwj</sup> and Extolled Him<sup>azwj</sup>, then said: ‘What is the matter with a group of people from my<sup>saww</sup> companions who are neither eating the meat, nor are the smelling the perfume, nor are they going to the women? But, I<sup>saww</sup> eat the meat, and I<sup>saww</sup> smell the perfume, and I<sup>asws</sup> go to the women. So the one who turns away from my<sup>saww</sup> Sunnah, so he is not from me<sup>saww</sup>’."}]}, {"index": 10034, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:5:3:136:6", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ مِسْمَعٍ أَبِي سَيَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ أَحَبَّ أَنْ يَكُونَ عَلَى فِطْرَتِي فَلْيَسْتَنَّ بِسُنَّتِي وَ إِنَّ مِنْ سُنَّتِيَ النِّكَاحَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al Hassan Bin Shamoun, from Abdullah Bin Abdul Rahman, from Misma’a Abu Sayyar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The one who loves that he happens to be upon my<sup>saww</sup> nature, so let him adopt a way with my<sup>saww</sup> Sunnah, and the marriage is from my<sup>saww</sup> Sunnah’."}]}]}, "index": "al-kafi:5:3:136", "kind": "verse_list"}