{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:5:3", "titles": {"ar": "كتاب النِّكَاحِ", "en": "THE BOOK OF MARRIAGE"}}, {"indexed_titles": {"en": "Chapter 141"}, "path": "/books/al-kafi:5:3:141", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الْقَوْلِ عِنْدَ</span> الْبَاهِ وَ مَا يَعْصِمُ مِنْ مُشَارَكَةِ الشَّيْطَانِ", "en": "Chapter 141 – The words during approaching the wife and what safeguards from the participation of the Satan<sup>la</sup>"}}], "index": 1510, "local_index": 141, "part_type": "Chapter", "path": "/books/al-kafi:5:3:141", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الْقَوْلِ عِنْدَ</span> الْبَاهِ وَ مَا يَعْصِمُ مِنْ مُشَارَكَةِ الشَّيْطَانِ", "en": "Chapter 141 – The words during approaching the wife and what safeguards from the participation of the Satan<sup>la</sup>"}, "verse_count": 6, "verse_start_index": 10051, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 10052, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:3:141:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنِ الْحَلَبِيِّ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فِي الرَّجُلِ إِذَا أَتَى أَهْلَهُ فَخَشِيَ أَنْ يُشَارِكَهُ الشَّيْطَانُ قَالَ يَقُولُ بِسْمِ اللَّهِ وَ يَتَعَوَّذُ بِاللَّهِ مِنَ الشَّيْطَانِ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Al Hassan Bin Mahboub, from Ali Bin Raib, from Al Halby who said, ", "‘Abu Abdllah<sup>asws</sup> said: ‘Regarding the man, when he goes over to his wife, so he fears the participation of the Satan<sup>la</sup>. He<sup>asws</sup> said: ‘He should be saying, ‘In the Name of Allah<sup>azwj</sup>’, and he should be seeking Refuge with Allah<sup>azwj</sup> from the Satan<sup>la</sup>’."]}}, {"index": 10053, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:3:141:2", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ الْوَشَّاءِ عَنْ مُوسَى بْنِ بَكْرٍ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا أَبَا مُحَمَّدٍ أَيَّ شَيْ‏ءٍ يَقُولُ الرَّجُلُ مِنْكُمْ إِذَا دَخَلَتْ عَلَيْهِ امْرَأَتُهُ قُلْتُ جُعِلْتُ فِدَاكَ أَ يَسْتَطِيعُ الرَّجُلُ أَنْ يَقُولَ شَيْئاً فَقَالَ أَ لَا أُعَلِّمُكَ مَا تَقُولُ قُلْتُ بَلَى ", "قَالَ تَقُولُ بِكَلِمَاتِ اللَّهِ اسْتَحْلَلْتُ فَرْجَهَا وَ فِي أَمَانَةِ اللَّهِ أَخَذْتُهَا اللَّهُمَّ إِنْ قَضَيْتَ لِي فِي رَحِمِهَا شَيْئاً فَاجْعَلْهُ بَارّاً تَقِيّاً وَ اجْعَلْهُ مُسْلِماً سَوِيّاً وَ لَا تَجْعَلْ فِيهِ شِرْكاً لِلشَّيْطَانِ ", "قُلْتُ وَ بِأَيِّ شَيْ‏ءٍ يُعْرَفُ ذَلِكَ قَالَ أَ مَا تَقْرَأُ كِتَابَ اللَّهِ عَزَّ وَ جَلَّ ثُمَّ ابْتَدَأَ هُوَ وَ شارِكْهُمْ فِي الْأَمْوالِ وَ الْأَوْلادِ ثُمَّ قَالَ إِنَّ الشَّيْطَانَ لَيَجِي‏ءُ حَتَّى يَقْعُدَ مِنَ الْمَرْأَةِ كَمَا يَقْعُدُ الرَّجُلُ مِنْهَا وَ يُحْدِثُ كَمَا يُحْدِثُ وَ يَنْكِحُ كَمَا يَنْكِحُ قُلْتُ بِأَيِّ شَيْ‏ءٍ يُعْرَفُ ذَلِكَ قَالَ بِحُبِّنَا وَ بُغْضِنَا فَمَنْ أَحَبَّنَا كَانَ نُطْفَةَ الْعَبْدِ وَ مَنْ أَبْغَضَنَا كَانَ نُطْفَةَ الشَّيْطَانِ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moalla Bin Muhammad and a number of our companions, from Ahmad Bin Muhammad, altogether, from Al Washsha, from Muhsa Bin Bakr, from Abu Baseer who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘O Abu Muhammad! Which thing is the man from you saying when he goes over to his wife?’ I said, ‘May I be sacrificed for you<sup>asws</sup>! Does the man have the ability that he should be saying something?’ So he<sup>asws</sup> said: ‘Shall I<sup>asws</sup> teach you what you should be saying?’ I said, ‘Yes’. ", "He<sup>asws</sup> said: ‘You should be saying, ‘With the Words of Allah<sup>azwj</sup> I Permit her private parts, and in the Security of Allah<sup>azwj</sup> that I take her. O Allah<sup>azwj</sup>! If You<sup>azwj</sup> Judge for me anything in her womb, so Make it to be righteous, pious, and Makes it a complete Muslim, and do not Make therein a participation of the Satan<sup>la</sup>’. ", "I said, ‘And by which thing is that recognised?’ He<sup>asws</sup> said: ‘Have you not read the Book of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[17:64] and share with them in wealth and the children</span>’. Then he<sup>asws</sup> said: ‘The Satan<sup>la</sup> comes until he sits upon the woman just as the man sits upon her, and does just as what he does, and copulates just as he copulates’. I said, ‘And by which thing is that recognised?’ He<sup>asws</sup> said: ‘By love for us<sup>asws</sup>, and hatred for us<sup>asws</sup>. So the one who loves us<sup>asws</sup> his was the seed of the servant, and the one who hates us<sup>asws</sup> his was the seed of the Satan<sup>la</sup>’."]}}, {"index": 10054, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:3:141:3", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الْأَشْعَرِيِّ عَنِ ابْنِ الْقَدَّاحِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِذَا جَامَعَ أَحَدُكُمْ فَلْيَقُلْ بِسْمِ اللَّهِ وَ بِاللَّهِ اللَّهُمَّ جَنِّبْنِي الشَّيْطَانَ وَ جَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنِي قَالَ فَإِنْ قَضَى اللَّهُ بَيْنَهُمَا وَلَداً لَا يَضُرُّهُ الشَّيْطَانُ بِشَيْ‏ءٍ أَبَداً ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyiad, from Ja’far Bin Muhammad Al Ashary, from Ibn Al Qaddah, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘When one of you copulates, so let him say, ‘In the Name of Allah<sup>azwj</sup>, and with Allah<sup>azwj</sup>. O Allah<sup>azwj</sup>! Keep the Satan<sup>la</sup> aside from what You<sup>azwj</sup> Grace me’. He<sup>asws</sup> said: ‘So if Allah<sup>azwj</sup> judges a child between the two, the Satan<sup>la</sup> would not harm him with anything, ever!’."]}}, {"index": 10055, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:5:3:141:4", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عَلِيِّ بْنِ حَسَّانَ الْوَاسِطِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) جَالِساً فَذَكَرَ شِرْكَ الشَّيْطَانِ فَعَظَّمَهُ حَتَّى أَفْزَعَنِي قُلْتُ جُعِلْتُ فِدَاكَ فَمَا الْمَخْرَجُ مِنْ ذَلِكَ قَالَ إِذَا أَرَدْتَ الْجِمَاعَ فَقُلْ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ الَّذِي لَا إِلَهَ إِلَّا هُوَ بَدِيعُ السَّمَاوَاتِ وَ الْأَرْضِ اللَّهُمَّ إِنْ قَضَيْتَ مِنِّي فِي هَذِهِ اللَّيْلَةِ خَلِيفَةً فَلَا تَجْعَلْ لِلشَّيْطَانِ فِيهِ شِرْكاً وَ لَا نَصِيباً وَ لَا حَظّاً وَ اجْعَلْهُ مُؤْمِناً مُخْلِصاً مُصَفًّى مِنَ الشَّيْطَانِ وَ رِجْزِهِ جَلَّ ثَنَاؤُكَ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ali Bin Hassan Al Wasity, from Abdul Rahman Bin Kaseer who said, ", "‘I was seated in the presence of Abu Abdullah<sup>asws</sup>, so the participation of the Satan<sup>la</sup> was mentioned. So he<sup>asws</sup> magnified it until it panicked me. I said, ‘May I be sacrificed for you<sup>asws</sup>! So what is the way out from that?’ He<sup>asws</sup> said: ‘Whenever you intend the copulation, so say, ‘In the Name of Allah<sup>azwj</sup> the Beneficent, the Merciful, there being no god except for Him<sup>azwj</sup>, the Initiator of the skies and the earth. O Allah<sup>azwj</sup>! If You<sup>azwj</sup> Judge from me a successor in this night, so do not Make a participation for the Satan<sup>la</sup> in it, nor a share, nor a piece, and Make him to be a Believer, sincere, clean from the Satan<sup>la</sup> and his filth, Majestic is His<sup>azwj</sup> Praise’."]}}, {"index": 10056, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:5:3:141:5", "text": ["وَ عَنْهُ عَنْ أَبِيهِ عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ أَبِي الْوَلِيدِ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا أَبَا مُحَمَّدٍ إِذَا أَتَيْتَ أَهْلَكَ فَأَيَّ شَيْ‏ءٍ تَقُولُ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ وَ أُطِيقُ أَنْ أَقُولَ شَيْئاً قَالَ بَلَى قُلِ اللَّهُمَّ بِكَلِمَاتِكَ اسْتَحْلَلْتُ فَرْجَهَا وَ بِأَمَانَتِكَ أَخَذْتُهَا فَإِنْ قَضَيْتَ فِي رَحِمِهَا شَيْئاً فَاجْعَلْهُ تَقِيّاً زَكِيّاً وَ لَا تَجْعَلْ لِلشَّيْطَانِ فِيهِ شِرْكا ً", "قَالَ قُلْتُ جُعِلْتُ فِدَاكَ وَ يَكُونُ فِيهِ شِرْكٌ لِلشَّيْطَانِ قَالَ نَعَمْ أَ مَا تَسْمَعُ قَوْلَ اللَّهِ عَزَّ وَ جَلَّ فِي كِتَابِهِ وَ شارِكْهُمْ فِي الْأَمْوالِ وَ الْأَوْلادِ إِنَّ الشَّيْطَانَ يَجِي‏ءُ فَيَقْعُدُ كَمَا يَقْعُدُ الرَّجُلُ وَ يُنْزِلُ كَمَا يُنْزِلُ الرَّجُلُ قَالَ قُلْتُ بِأَيِّ شَيْ‏ءٍ يُعْرَفُ ذَلِكَ قَالَ بِحُبِّنَا وَ بُغْضِنَا ."], "translations": {"en.hubeali": ["And from him, from his father, from Hamza Bin Abdullah, from Jameel Bin Darraj, from Abu Al Waleed, from Abu Baseer who said, ", "‘Abu Abdullah<sup>asws</sup> said to me: ‘O Abu Muhammad! Whever you go to your wife, so which thing are you saying?’ I said, ‘May I be sacrificed for you<sup>asws</sup>, and can I endure saying anything?’ He<sup>asws</sup> said: ‘Yes. Say, ‘O Allah<sup>azwj</sup>! With You<sup>azwj</sup> Words do I permit her private parts, and by Your<sup>azwj</sup> Security I take her. So if You<sup>azwj</sup> were to Judge anything for me in her womb, so Make it to be pious, pure, and do not Make a participation for the Satan<sup>la</sup> to be in it’.", "He (Abu Baseer) said, ‘I said, ‘May I be sacrificed for you<sup>asws</sup>! And there happens to be a participation for the Satan<sup>la</sup> therein?’ He<sup>asws</sup> said: ‘Yes. Have you not heard the Words of Allah<sup>azwj</sup> Mighty and Majestic in His<sup>azwj</sup> Book <span class=\"ibTxt\">[17:64] and share with them in wealth and the children</span>. The Satan<sup>la</sup> comes over, so he<sup>la</sup> sits just as the man sits (upon the wife) and descends just as the man descends’. I said, ‘And by which thing is that recognised?’ He<sup>asws</sup> said: ‘By love for us<sup>asws</sup> and hatred for us<sup>asws</sup>’."]}}, {"index": 10057, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:5:3:141:6", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي النُّطْفَتَيْنِ اللَّتَيْنِ لِلْآدَمِيِّ وَ الشَّيْطَانِ إِذَا اشْتَرَكَا فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) رُبَّمَا خُلِقَ مِنْ أَحَدِهِمَا وَ رُبَّمَا خُلِقَ مِنْهُمَا جَمِيعاً ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Hisham Bin Salim, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the two seeds which are for the human being and the Satan<sup>la</sup>, when they are participated together. So Abu Abdullah<sup>asws</sup> said: ‘Sometimes the creation is from one of the two, sometimes the creation is from both of them together’."]}}]}, "index": "al-kafi:5:3:141", "kind": "verse_list"}