{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 143"
        },
        "path": "/books/al-kafi:5:3:143",
        "titles": {
          "ar": "باب الْقَوْلِ عِنْدَ دُخُولِ الرَّجُلِ بِأَهْلِهِ",
          "en": "Chapter 140 – The Words during the copulation of the man with his wife"
        }
      }
    ],
    "index": 1514,
    "local_index": 143,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 144"
        },
        "path": "/books/al-kafi:5:3:144",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الْقَوْلِ عِنْدَ</span> الْبَاهِ وَ مَا يَعْصِمُ مِنْ مُشَارَكَةِ الشَّيْطَانِ",
          "en": "Chapter 141 – The words during approaching the wife and what safeguards from the participation of the Satan<sup>la</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 142"
        },
        "path": "/books/al-kafi:5:3:142",
        "titles": {
          "ar": "باب كَرَاهِيَةِ أَنْ يُوَاقِعَ الرَّجُلُ أَهْلَهُ وَ فِي الْبَيْتِ صَبِيٌّ",
          "en": "Chapter 139 – Abhorrence of the man falling upon his wife, and in the room is a child"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:3:143",
    "titles": {
      "ar": "باب الْقَوْلِ عِنْدَ دُخُولِ الرَّجُلِ بِأَهْلِهِ",
      "en": "Chapter 140 – The Words during the copulation of the man with his wife"
    },
    "verse_count": 5,
    "verse_start_index": 10049,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/310)"
        ],
        "index": 10050,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/434",
              "text": "أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/155",
              "text": "جَمِيلِ بْنِ صَالِحٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ أَبِي بَصِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:143:1",
        "text": [
          " سَمِعْتُ رَجُلًا وَ هُوَ يَقُولُ لِأَبِي جَعْفَرٍ ( عليه السلام ) جُعِلْتُ فِدَاكَ إِنِّي رَجُلٌ قَدْ أَسْنَنْتُ وَ قَدْ تَزَوَّجْتُ امْرَأَةً بِكْراً صَغِيرَةً وَ لَمْ أَدْخُلْ بِهَا وَ أَنَا أَخَافُ أَنَّهَا إِذَا دَخَلَتْ عَلَيَّ تَرَانِي أَنْ تَكْرَهَنِي لِخِضَابِي وَ كِبَرِي ",
          "فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) إِذَا دَخَلَتْ فَمُرْهَا قَبْلَ أَنْ تَصِلَ إِلَيْكَ أَنْ تَكُونَ مُتَوَضِّئَةً ثُمَّ أَنْتَ لَا تَصِلُ إِلَيْهَا حَتَّى تَوَضَّأَ وَ صَلِّ رَكْعَتَيْنِ ثُمَّ مَجِّدِ اللَّهَ وَ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ ثُمَّ ادْعُ وَ مُرْ مَنْ مَعَهَا أَنْ يُؤَمِّنُوا عَلَى دُعَائِكَ وَ قُلِ اللَّهُمَّ ارْزُقْنِي إِلْفَهَا وَ وُدَّهَا وَ رِضَاهَا وَ أَرْضِنِي بِهَا وَ اجْمَعْ بَيْنَنَا بِأَحْسَنِ اجْتِمَاعٍ وَ آنَسِ ائْتِلَافٍ فَإِنَّكَ تُحِبُّ الْحَلَالَ وَ تَكْرَهُ الْحَرَامَ ",
          "ثُمَّ قَالَ وَ اعْلَمْ أَنَّ الْإِلْفَ مِنَ اللَّهِ وَ الْفِرْكَ مِنَ الشَّيْطَانِ لِيُكَرِّهَ مَا أَحَلَّ اللَّهُ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, and a number of our companions, from Ahmad Bin Abu Abdullah, from Ibn Mahboub, from Jameel Bin Salih, from Abu Baseer who said, ",
            "‘I heard a man and he was saying to Abu Ja’far<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! I am a man who had aged, and have married a young virgin woman and have not slept with her, and I fear that when she comes over to me, she would see me and dislike me due to my dyeing, and my old age’. ",
            "Abu Ja’far<sup>asws</sup> said: ‘When she comes over, so instruct her before she arrives to you that she should be in ablution. Then you should not go to her until you have performed ablution and Prayed two Cycles. Then you Glorify Allah<sup>azwj</sup>, and send Blessings upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>. Then supplicate and instruct the ones who are with her that they should say Ameen upon your supplication, and say, ‘O Allah<sup>azwj</sup>! Grace me her kindness, and her cordiality, and her pleasure, and Make me to be pleased with her, and gather us together with the best of the gatherings, with kindly love, for You<sup>azwj</sup> Love the Permissible and Dislike the Prohibited’. ",
            "Then he<sup>asws</sup> said: ‘And know that the kindness is from Allah<sup>azwj</sup>, and the separation is from the Satan<sup>la</sup> disliking what Allah<sup>azwj</sup> Mighty and Majestic has Permitted’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa and A number of our people have narrated from Ahmad ibn abu ‘ Abd Allah from ibn Mahbub from Jamil ibn Salih from abu Basir who has said the following: “I heard a man saying to abu Ja‘far, ‘Alayhi al-Salam, ‘I pray to Allah to keep my soul in service for your cause, I am an aged man. I have married a virgin young woman. I have not gone to bed with her as yet. I am afraid in bed on finding me of such age and the dye on my beard she may dislike me.’ Abu Ja‘far, ‘Alayhi al-Salam, ’When you are there ask her before approaching you to take Wudu’. You also should not approach her before taking Wudu’ and performing two Rak’at Salat (prayer). Thereafter, speak of the glory of Allah and say, “Allahumma Salli ‘Ala Muhammad xva ‘Ali Muhammad (O Allah grant Muhammad and his family a compensation worthy of their serving Your cause).” Thereafter ask her and others present with her to say A’min (O Allah grant his wishes). Thereafter say, ‘O Lord, provide her enough reasons to be kind to me, love me, be happy with me, grant me enough reason to be happy with her, bring us together in the best form of gathering, and the happiest kindness; You love what is lawful and dislike unlawful matters.’ The Imam then said, ‘You must bear in mind that kindness comes from Allah and hate comes from Satan so that people clash and dislike what Allah has made lawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/310)"
        ],
        "index": 10051,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/175",
              "text": "أَبِي أَيُّوبَ الْخَزَّازِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:143:2",
        "text": [
          " إِذَا دَخَلْتَ بِأَهْلِكَ فَخُذْ بِنَاصِيَتِهَا وَ اسْتَقْبِلِ الْقِبْلَةَ وَ قُلِ اللَّهُمَّ بِأَمَانَتِكَ أَخَذْتُهَا وَ بِكَلِمَاتِكَ اسْتَحْلَلْتُهَا فَإِنْ قَضَيْتَ لِي مِنْهَا وَلَداً فَاجْعَلْهُ مُبَارَكاً تَقِيّاً مِنْ شِيعَةِ آلِ مُحَمَّدٍ وَ لَا تَجْعَلْ لِلشَّيْطَانِ فِيهِ شِرْكاً وَ لَا نَصِيباً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abu Ayoub Al Khazzaz, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whenever you sleep with your wife, so grab her forehead and face the Qiblah and say, ‘O Allah<sup>azwj</sup>! With Your<sup>azwj</sup> Security I take her, and with Your<sup>azwj</sup> Words to I permit her, so if You<sup>azwj</sup> have Judged a child to be from her, so Make it a Blessed, pious, a Shias of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and do not Make a participation in it for the Satan<sup>la</sup>, nor a share’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from abu Ayyub al-Khazzaz from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘When you meet your wife hold to her forehead and face al-Qiblah (al-Ka’bah) and say, ‘O Lord, in Your trust I have taken her (in marriage) and with Your words I have made her lawful. If You have destined for me from her a child, then make the child a blessed one, pious, of the Shi ’ah (followers) of the family of Muhammad and you must not make for Satan any share or portion in it (child).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/311)"
        ],
        "index": 10052,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/434",
              "text": "أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/416",
              "text": "الْقَاسِمِ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/417",
              "text": "جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنِ الْقَاسِمِ بْنِ يَحْيَى عَنْ جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ أَبِي بَصِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:143:3",
        "text": [
          " قَالَ لِي أَبُو جَعْفَرٍ ( عليه السلام ) إِذَا تَزَوَّجَ أَحَدُكُمْ كَيْفَ يَصْنَعُ قُلْتُ لَا أَدْرِي قَالَ إِذَا هَمَّ بِذَلِكَ فَلْيُصَلِّ رَكْعَتَيْنِ وَ لْيَحْمَدِ اللَّهَ عَزَّ وَ جَلَّ ثُمَّ يَقُولُ اللَّهُمَّ إِنِّي أُرِيدُ أَنْ أَتَزَوَّجَ فَقَدِّرْ لِي مِنَ النِّسَاءِ أَعَفَّهُنَّ فَرْجاً وَ أَحْفَظَهُنَّ لِي فِي نَفْسِهَا وَ مَالِي وَ أَوْسَعَهُنَّ رِزْقاً وَ أَعْظَمَهُنَّ بَرَكَةً وَ قَدِّرْ لِي وَلَداً طَيِّباً تَجْعَلْهُ خَلَفاً صَالِحاً فِي حَيَاتِي وَ بَعْدَ مَوْتِي ",
          "قَالَ فَإِذَا دَخَلَتْ إِلَيْهِ فَلْيَضَعْ يَدَهُ عَلَى نَاصِيَتِهَا وَ لْيَقُلِ اللَّهُمَّ عَلَى كِتَابِكَ تَزَوَّجْتُهَا وَ فِي أَمَانَتِكَ أَخَذْتُهَا وَ بِكَلِمَاتِكَ اسْتَحْلَلْتُ فَرْجَهَا فَإِنْ قَضَيْتَ لِي فِي رَحِمِهَا شَيْئاً فَاجْعَلْهُ مُسْلِماً سَوِيّاً وَ لَا تَجْعَلْهُ شِرْكَ شَيْطَانٍ قَالَ قُلْتُ وَ كَيْفَ يَكُونُ شِرْكَ شَيْطَانٍ قَالَ إِنْ ذَكَرَ اسْمَ اللَّهِ تَنَحَّى الشَّيْطَانُ وَ إِنْ فَعَلَ وَ لَمْ يُسَمِّ أَدْخَلَ ذَكَرَهُ وَ كَانَ الْعَمَلُ مِنْهُمَا جَمِيعاً وَ النُّطْفَةُ وَاحِدَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, and a number of our companions, from Ahmad Bin Abu Abdullah, from Al Qasim Bin Yahya, from his grandfather Al Hassan Bin Rashid, from Abu Baseer who said, ",
            "‘Abu Ja’far<sup>asws</sup> said to me: ‘Whenever one of you gets married, how does he deal with it?’ I said, ‘I do not know’. He<sup>asws</sup> said: ‘When he thinks of that (getting married), so let him Pray two Cycles, and let him Praise Allah<sup>azwj</sup> Mighty and Majestic, then he should be saying, ‘O Allah<sup>azwj</sup>! I intend to get married, therefore Ordain for me from the women who is the most virtuous of her private parts and the most preserving for me with regards to herself and my wealth, and the most affluent in sustenance and of greatest Blessings, and greatest of them in Blessings; and Ordain for me a good child, Making him to be a righteous successor during my lifetime and after my death’. ",
            "He<sup>asws</sup> said: ‘So whenever she comes over to him, so let him place his hand upon her forehead, and let him say, ‘O Allah<sup>azwj</sup>! Upon Your<sup>azwj</sup> Book I have married her, and in Your<sup>azwj</sup> Security I take her, and with Your<sup>azwj</sup> Words I have permitted her private parts. So, if You<sup>azwj</sup> Judge for me something in her womeb, so Make it a complete Muslim, and do not Make Satan<sup>la</sup> to be a participant’. I said, ‘And how does the participation of Satan<sup>la</sup> take place?’ He<sup>asws</sup> said: ‘If he mentions the Name of Allah<sup>azwj</sup>, Satan<sup>la</sup> get embarrassed, and if he does it and does not say Bismillah, and enters his manhood, and the deed would be together from them both, and the seed would be one’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa and A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from al-Qasim ibn Yahya from his grandfather, al-Hassan ibn Rashid from abu Basir who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, once asked me, ‘When one of you marries, does he know what to do?’ I replied, ‘I do not know.’ He (the Imam) said, ‘When he decides for it (marriage) he must perform two Rak’at Salat (prayer) then say, “O Lord, I want to marry so choose for me of women who is most chaste in matters of her private organs, most protective for me of herself and my assets, of most affluence in sustenance and of greatest blessing. Choose for me a fine child to be a virtuous successor in my lifetime and after my death.’” He (the Imam) said, ‘When you meet her place your hand over her forehead and say, “O Lord, according to Your book I have married her, in Your trust I have taken her (in marriage) and with Your words I have made her (private organs) lawful. If You have destined for me from her womb anything (child), then make the child a Muslim, upright and You must not make for Satan any share or portion in it (child).’ I (the narrator) then asked, ‘How can it be a share of Satan?’ He (the Imam) said, ‘Mention of the name of Allah keeps Satan away. If one goes to bed without mentioning the name of Allah, he sticks his penis, the act is from both of them but the seed is one.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/312)"
        ],
        "index": 10053,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3712",
              "text": "أَبِي يُوسُفَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2495",
              "text": "الْمِيثَمِيِّ"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ قَالَ"
            }
          ],
          "text": "عَنْهُ عَنْ أَبِي يُوسُفَ عَنِ الْمِيثَمِيِّ رَفَعَهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:143:4",
        "text": [
          " أَتَى رَجُلٌ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَ لَهُ إِنِّي تَزَوَّجْتُ فَادْعُ اللَّهَ لِي فَقَالَ قُلِ اللَّهُمَّ بِكَلِمَاتِكَ اسْتَحْلَلْتُهَا وَ بِأَمَانَتِكَ أَخَذْتُهَا اللَّهُمَّ اجْعَلْهَا وَلُوداً وَدُوداً لَا تَفْرَكُ تَأْكُلُ مِمَّا رَاحَ وَ لَا تَسْأَلُ عَمَّا سَرَحَ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Abu Yusuf, from Al Maysami, raising it, said, ",
            "‘A man came over to Amir Al-Momineen<sup>asws</sup>, so he said to him<sup>asws</sup>, ‘I have got married, therefore supplicate to Allah<sup>azwj</sup> for me’. So he<sup>asws</sup> said: ‘Say, ‘O Allah<sup>azwj</sup>! With Your<sup>azwj</sup> words I have permitted her, and with Your<sup>azwj</sup> Security I take her. O Allah<sup>azwj</sup>! Make her child-bearing, cordial, not separating, consuming from what is comfortable, and not asking about what is not available’."
          ],
          "en.sarwar": [
            "4. It is narrated from the narrator of the previous Hadith from abu Yusuf from al-Mithamiy in a marfu’ manner has said the following: “Once, a man came to ’Amir al-Mu’minin, ‘Alayhi al-Salam, and said, ‘I have just married, pray for me to Allah.’ He (the Imam) said, ’Say, 0 Lord, with Your words I have made her marriage lawful and in Your trust I have taken her (in marriage); O Lord, make her child-bearing, loving and not clashing in dislike, use what is found and not ask what to bring home (this and that).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/312)"
        ],
        "index": 10054,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/213",
              "text": "أَبَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2231",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ أَعْيَنَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبَانٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَعْيَنَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:143:5",
        "relations": {
          "Mentions": [
            "/books/quran:2:229"
          ]
        },
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِذَا أَرَادَ الرَّجُلُ أَنْ يَتَزَوَّجَ الْمَرْأَةَ فَلْيَقُلْ أَقْرَرْتُ بِالْمِيثَاقِ الَّذِي أَخَذَ اللَّهُ إِمْسَاكٌ بِمَعْرُوفٍ أَوْ تَسْرِيحٌ بِإِحْسَانٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Aban, from Abdul Rahman Bin Ayn who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Whenever the man intends to get marry the woman, so let him say, ‘I accept with the Covenant which Allah<sup>azwj</sup> has Taken <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h229\">[2:229]</a> then keep (them) in good fellowship or let (them) go with kindness</span>’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Aban from ‘Abd af-Rahman ibn ‘ A‘yan who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ‘When a man wants to marry a woman he should say, “I authenticate my covenant with Allah which is: “maintain in a reasonable way or allow to go with kindness.” <a href=\"/#/books/quran:2#h229\">[2:229]</a>’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:3:143",
  "kind": "verse_list"
}