{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 15"
        },
        "path": "/books/al-kafi:5:3:15",
        "titles": {
          "ar": "باب فَضْلِ الْأَبْكَارِ ",
          "en": "Chapter 15 – Merits of the Virgins"
        }
      }
    ],
    "index": 1386,
    "local_index": 15,
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:3:15",
    "titles": {
      "ar": "باب فَضْلِ الْأَبْكَارِ ",
      "en": "Chapter 15 – Merits of the Virgins"
    },
    "verse_count": 1,
    "verse_start_index": 9413,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن وآخره مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/25)"
        ],
        "index": 9414,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:15:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ وَ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ عَبْدِ الْأَعْلَى بْنِ أَعْيَنَ مَوْلَى آلِ سَامٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) تَزَوَّجُوا الْأَبْكَارَ فَإِنَّهُنَّ أَطْيَبُ شَيْ‏ءٍ أَفْوَاهاً ",
          "وَ فِي حَدِيثٍ آخَرَ وَ أَنْشَفُهُ أَرْحَاماً وَ أَدَرُّ شَيْ‏ءٍ أَخْلَافاً وَ أَفْتَحُ شَيْ‏ءٍ أَرْحَاماً أَ مَا عَلِمْتُمْ أَنِّي أُبَاهِي بِكُمُ الْأُمَمَ يَوْمَ الْقِيَامَةِ حَتَّى بِالسِّقْطِ يَظَلُّ مُحْبَنْطِئاً عَلَى بَابِ الْجَنَّةِ فَيَقُولُ اللَّهُ عَزَّ وَ جَلَّ ادْخُلِ الْجَنَّةَ فَيَقُولُ لَا أَدْخُلُ حَتَّى يَدْخُلَ أَبَوَايَ قَبْلِي فَيَقُولُ اللَّهُ تَبَارَكَ وَ تَعَالَى لِمَلَكٍ مِنَ الْمَلَائِكَةِ ائْتِنِي بِأَبَوَيْهِ فَيَأْمُرُ بِهِمَا إِلَى الْجَنَّةِ فَيَقُولُ هَذَا بِفَضْلِ رَحْمَتِي لَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad and Ahmad Bin Muhammad, from Ibn Mahboub, from Ali Bin Raib, from Abdul A’ala Bin Ayn a slave of the progeny of Saam, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Marry the virgins for they are the finest of the mouths’. ",
            "And in another Hadeeth, ‘He<sup>saww</sup> said): ‘And toughest of the wombs, and roundest of the behinds, and open wombs (for child-birth). Do you not know that I<sup>saww</sup> would be priding with you (among) the communities on the Day of Judgement, even with the miscarried child remaining at the Door of the Paradise. So Allah<sup>azwj</sup> Mighty and Majestic would be Saying: “Enter the Paradise!” So it would be saying, ‘I shall not enter until my parents enter before me’. So Allah<sup>azwj</sup> Blessed and High would be Saying to an Angel from the Angels: “Come to Me<sup>azwj</sup> with its parents”. So He<sup>azwj</sup> would be Commanding with both of them to the Paradise, and He<sup>azwj</sup> would be Saying: “This is by the Grace of My<sup>azwj</sup> Mercy to you”’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad and Ahmad ibn Muhammad from ibn Mahbub from ibn Ri’ab from ‘Abd al-‘ Ala’ ibn ‘ A‘yan Mawla’ Ale Sam who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘Marry virgins; they are of the finest mouth.’ In another Hadith it is said that, their uterus most dry, their posterior most round, and their womb most open. Have you taken notice that I will express pride among the nations on the Day of Judgment even because of a miscarried child who, filled with anger, stands at the door of paradise? Allah, most Majestic, most Glorious, then says, ‘Enter paradise.’ The child says, ‘No, I will not enter until my parents enter before I enter.’ Allah, most Blessed, most High, says to an angel of the angels, ‘Bring to Me his parents.’ He then commands to admit them in paradise, and then He says, ‘This is because of My mercy upon you.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:3:15",
  "kind": "verse_list"
}