{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 153"
        },
        "path": "/books/al-kafi:5:3:153",
        "titles": {
          "ar": "باب مُدَارَاةِ الزَّوْجَةِ",
          "en": "Chapter 150 – Politeness of the wife"
        }
      }
    ],
    "index": 1524,
    "local_index": 153,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 154"
        },
        "path": "/books/al-kafi:5:3:154",
        "titles": {
          "ar": "باب مَا يَجِبُ مِنْ طَاعَةِ الزَّوْجِ عَلَى الْمَرْأَةِ ",
          "en": "Chapter 151 – What is Obligated upon the women from obedience to the husband"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 152"
        },
        "path": "/books/al-kafi:5:3:152",
        "titles": {
          "ar": "باب حَقِّ الْمَرْأَةِ عَلَى الزَّوْجِ",
          "en": "Chapter 149 – The rights of the wife upon the husband"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:3:153",
    "titles": {
      "ar": "باب مُدَارَاةِ الزَّوْجَةِ",
      "en": "Chapter 150 – Politeness of the wife"
    },
    "verse_count": 2,
    "verse_start_index": 10096,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق وآخره مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/327)"
        ],
        "index": 10097,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:153:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َبُو عَلِيٍّ الْأَشْعَرِيُّ</span> عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّمَا مَثَلُ الْمَرْأَةِ مَثَلُ الضِّلْعِ الْمُعْوَجِّ إِنْ تَرَكْتَهُ انْتَفَعْتَ بِهِ وَ إِنْ أَقَمْتَهُ كَسَرْتَهُ ",
          "وَ فِي حَدِيثٍ آخَرَ اسْتَمْتَعْتَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Ishaq Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘But rather, an example of the woman is the crooked rib. If you were to leave it (as it is) you would benefit by it, but if you were to straighten it, you will break it’. ",
            "And in another Hadeeth, ‘(He<sup>saww</sup> said: ‘(If you were to leave it as it is) you will enjoy with it’."
          ],
          "en.sarwar": [
            "1. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan from Ishaq ibn ‘Ammar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘Women are like crooked ribs from which you can benefit by leaving it alone (the way it is); but on trying to straighten one only causes it to snap and break a part. 5 In another Hadith is said, ‘You can benefit thereby.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/328)"
        ],
        "index": 10098,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:153:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانٍ الْأَحْمَرِ عَنْ مُحَمَّدٍ الْوَاسِطِيِّ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ إِبْرَاهِيمَ ( عليه السلام ) شَكَا إِلَى اللَّهِ عَزَّ وَ جَلَّ مَا يَلْقَى مِنْ سُوءِ خُلُقِ سَارَةَ فَأَوْحَى اللَّهُ تَعَالَى إِلَيْهِ إِنَّمَا مَثَلُ الْمَرْأَةِ مَثَلُ الضِّلْعِ الْمُعْوَجِ إِنْ أَقَمْتَهُ كَسَرْتَهُ وَ إِنْ تَرَكْتَهُ اسْتَمْتَعْتَ بِهِ اصْبِرْ عَلَيْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Aban Al Ahmar, from Muhammad Al Wasity who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Ibrahim<sup>as</sup> complained to Allah<sup>azwj</sup> Mighty and Majestic from what he<sup>as</sup> faced from the evil manners of Sarah<sup>as</sup>. So Allah<sup>azwj</sup> Revealed unto him<sup>as</sup>: “But rather, and example of the woman is the example of the crooked rib. If you<sup>as</sup> were to straighten it, you will break it, but if you were to leave it (as it is), you<sup>as</sup> will enjoy with it. Be patient upon her”’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Aban al-Ahmar from Muhammad al-Wasitiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Ibrahim, ‘Alayhi al-Salam once complained before Allah, most Majestic, most Glorious, because of the wicked moral behavior of Sarah and Allah most High, sent him revelation that said, ‘Women are like crooked ribs, on trying to straighten you only cause it to snap and break apart but you can benefit by leaving it alone (the way it is), so you must exercise patience.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:3:153",
  "kind": "verse_list"
}