{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 160"
        },
        "path": "/books/al-kafi:5:3:160",
        "titles": {
          "ar": "باب مَا يَحِلُّ النَّظَرُ إِلَيْهِ مِنَ الْمَرْأَةِ ",
          "en": "Chapter 157 – What is Permissible to look at from the woman"
        }
      }
    ],
    "index": 1531,
    "local_index": 160,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 161"
        },
        "path": "/books/al-kafi:5:3:161",
        "titles": {
          "ar": "باب الْقَوَاعِدِ مِنَ النِّسَاءِ",
          "en": "Chapter 158 – Rules for women"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 159"
        },
        "path": "/books/al-kafi:5:3:159",
        "titles": {
          "ar": "باب النَّهْيِ عَنْ خِلَالٍ تُكْرَهُ لَهُنَّ ",
          "en": "Chapter 156 – The forbidding from the haristyles being disliked for them"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:3:160",
    "titles": {
      "ar": "باب مَا يَحِلُّ النَّظَرُ إِلَيْهِ مِنَ الْمَرْأَةِ ",
      "en": "Chapter 157 – What is Permissible to look at from the woman"
    },
    "verse_count": 5,
    "verse_start_index": 10135,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/340)"
        ],
        "index": 10136,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:160:1",
        "refs": {
          "Mentions": [
            "/books/quran:24:31",
            "/books/quran:24:32"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الذِّرَاعَيْنِ مِنَ الْمَرْأَةِ أَ هُمَا مِنَ الزِّينَةِ الَّتِي قَالَ اللَّهُ تَبَارَكَ وَ تَعَالَى وَ لا يُبْدِينَ زِينَتَهُنَّ إِلَّا لِبُعُولَتِهِنَّ قَالَ نَعَمْ وَ مَا دُونَ الْخِمَارِ مِنَ الزِّينَةِ وَ مَا دُونَ السِّوَارَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from Jameel Bin Darraj, from Al Fuzayl Bin Yasaar who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the two arms from the woman, are these two from the ornaments which Allah<sup>azwj</sup> Blessed and High Speaks of <span class=\"ibTxt\"><a href=\"/#/books/quran:24#h31\">[24:31]</a> and not display their ornaments except to their husbands</span>?’ He<sup>asws</sup> said: ‘Yes, and whatever is besides the scarf is from the adornment, and whatever is besides the two bracelets’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn Mahbub from Jamil ibn Darraj from Fudayl ibn Yasar who has said the following: “This is concerning my question before abu ‘ Abd Allah, ‘Alayhi al-Salam, about the arms of women if they are of beautification about which Allah, most Blessed, most High, has said, . . they must not expose their beauty except for their husband.’ <a href=\"/#/books/quran:24#h32\">[24:32]</a> He (the Imam) said, ’Yes, whatever must be covered with the scarf is of their beauty and whatever is above their bracelet is of their beauty.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/341)"
        ],
        "index": 10137,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:160:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مَرْوَكِ بْنِ عُبَيْدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ مَا يَحِلُّ لِلرَّجُلِ أَنْ يَرَى مِنَ الْمَرْأَةِ إِذَا لَمْ يَكُنْ مَحْرَماً قَالَ الْوَجْهُ وَ الْكَفَّانِ وَ الْقَدَمَانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Marwak Bin Ubeyd, from one of our companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘What is Permissible for the man that he sees from the woman, when he does not happen to be with sanctity?’ He<sup>asws</sup> said: ‘The face, and the two palms, and the two feet’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Marwak ibn ‘Ubayd from certain persons of our people who has said the following: “I once asked abu ’Abd Allah, ‘Alayhi al-Salam, about how much of the body of a woman who is not of one’s relatives one can look at. He (the Imam) said, ‘It is her face, both hands (from wrist down) and both feet (from the ankles down).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/341)"
        ],
        "index": 10138,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:160:3",
        "refs": {
          "Mentions": [
            "/books/quran:24:31"
          ]
        },
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ خَالِدٍ وَ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ عُرْوَةَ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ تَبَارَكَ وَ تَعَالَى إِلَّا ما ظَهَرَ مِنْها قَالَ الزِّينَةُ الظَّاهِرَةُ الْكُحْلُ وَ الْخَاتَمُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Khalid, and Al Husayn Bin Saeed, from Al Qasim Bin Urwat, from Abdullah Bin Bukeyr, from Zurara, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Blessed and High <span class=\"ibTxt\"><a href=\"/#/books/quran:24#h31\">[24:31]</a> except what appears thereof</span>. He<sup>asws</sup> said: The apparent adornment, the kohl and the ring’."
          ],
          "en.sarwar": [
            "3. Ahmad ibn Muhammad ibn ‘Isa has narrated from Muhammad ibn Khalid and al-Husayn ibn Sa‘id from al-Qasim ibn al-‘Urwah from ‘Abd Allah ibn Bukayr from Zurarah who has said the following: “About the words of Allah, most Blessed, most High, ’. . . except what is exposed,’ abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘The exposed beauty is kohl and rings.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/341)"
        ],
        "index": 10139,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:160:4",
        "refs": {
          "Mentions": [
            "/books/quran:24:31",
            "/books/quran:24:32"
          ]
        },
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ سَعْدَانَ بْنِ مُسْلِمٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ تَعَالَى وَ لا يُبْدِينَ زِينَتَهُنَّ إِلَّا ما ظَهَرَ مِنْها قَالَ الْخَاتَمُ وَ الْمَسَكَةُ وَ هِيَ الْقُلْبُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Ahmad Bin Is’haq, from Sa’dan Bin Muslim, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the Words of Allah<sup>azwj</sup> the Exalted <span class=\"ibTxt\"><a href=\"/#/books/quran:24#h31\">[24:31]</a> and do not display their ornaments except what appears thereof</span>. He<sup>asws</sup> said: ‘The ring, and the bracelet and the anklet’."
          ],
          "en.sarwar": [
            "4. Al-Husayn from Muhammad has narrated from Ahmad ibn Ishaq from Sa‘dan ibn Muslim from abu Basir who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the words of Allah, most High, ‘. . . they must not show off their beauty except for what is exposed.’ <a href=\"/#/books/quran:24#h32\">[24:32]</a> He (the Imam) said, ‘It is the items like ring, anklet and bracelet.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/343)"
        ],
        "index": 10140,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:160:5",
        "refs": {
          "Mentions": [
            "/books/quran:24:30",
            "/books/quran:24:31"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ سَعْدٍ الْإِسْكَافِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ اسْتَقْبَلَ شَابٌّ مِنَ الْأَنْصَارِ امْرَأَةً بِالْمَدِينَةِ وَ كَانَ النِّسَاءُ يَتَقَنَّعْنَ خَلْفَ آذَانِهِنَّ فَنَظَرَ إِلَيْهَا وَ هِيَ مُقْبِلَةٌ فَلَمَّا جَازَتْ نَظَرَ إِلَيْهَا وَ دَخَلَ فِي زُقَاقٍ قَدْ سَمَّاهُ بِبَنِي فُلَانٍ فَجَعَلَ يَنْظُرُ خَلْفَهَا وَ اعْتَرَضَ وَجْهَهُ عَظْمٌ فِي الْحَائِطِ أَوْ زُجَاجَةٌ فَشَقَّ وَجْهَهُ فَلَمَّا مَضَتِ الْمَرْأَةُ نَظَرَ فَإِذَا الدِّمَاءُ تَسِيلُ عَلَى صَدْرِهِ وَ ثَوْبِهِ فَقَالَ وَ اللَّهِ لآَتِيَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) وَ لَأُخْبِرَنَّهُ ",
          "قَالَ فَأَتَاهُ فَلَمَّا رَآهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَالَ لَهُ مَا هَذَا فَأَخْبَرَهُ فَهَبَطَ جَبْرَئِيلُ ( عليه السلام ) بِهَذِهِ الْآيَةِ قُلْ لِلْمُؤْمِنِينَ يَغُضُّوا مِنْ أَبْصارِهِمْ وَ يَحْفَظُوا فُرُوجَهُمْ ذلِكَ أَزْكى لَهُمْ إِنَّ اللَّهَ خَبِيرٌ بِما يَصْنَعُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al hakam, from Sayf Bin Ameyra, from Sa’ad Al Askaf, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘A youth from the Helpers faced a woman in Al-Medina, and the women used to wear their scarves behind their ears. So he looked at her and he was facing him. So when she passed by he kept looking at her, and she entered into an alleyway which had been named by the Clan of so and so. So he went on looking at her behind, and his face scaped against a sharp bone in the wall, or a piece of glass, and his face was cut. So when the woman went away, he looked and saw that the blood was flowing upon his chest and his clothes. So he said, ‘By Allah<sup>azwj</sup>! I shall go over to Rasool-Allah<sup>saww</sup> and inform him<sup>saww</sup>’.",
            "He<sup>asws</sup> said: ‘So he came over to him<sup>saww</sup>. So when Rasool-Allah<sup>saww</sup> saw him, said to him: ‘What is this?’ So he informed him<sup>saww</sup>. So Jibraeel<sup>as</sup> descended with this Verse <span class=\"ibTxt\"><a href=\"/#/books/quran:24#h30\">[24:30]</a> Say to the believing men that they should cast down their looks and guard their private parts; that is purer for them; surely Allah is Aware of what they are doing</span>’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Sayf ibn ‘Amirah from Sa‘d al-Iskaf who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘Once a young man from al-Ansar (people of al-Madinah) came face to face with a woman in al-Madinah. Women would wear their scarf behind their ears. He looked at her when she was coming, and when she passed by he kept looking, and she entered in an alley that he called alley of so and so people. He kept looking behind her until his face hit a piece of bone or glass in the wall which caused a deep cut on his face. When the woman went away he found blood flowing on his chest and clothes and he said, ‘By Allah, I will go and tell it to the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause.’ He (the Imam) said that he went to him (the Messenger of Allah) and when he (the Messenger of Allah) saw him, he (the Messenger of Allah) asked, ‘What has happened to you?’ He inform him (the Messenger of Allah) and Jibril came with this verse, ‘Tell the believers to cast down their eyes and protect their genital organs (against indecent acts), it is more clean for them; Allah is well aware of what they do.’” <a href=\"/#/books/quran:24#h31\">[24:31]</a> "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:3:160",
  "kind": "verse_list"
}