{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:5:3", "titles": {"ar": "كتاب النِّكَاحِ", "en": "THE BOOK OF MARRIAGE"}}, {"indexed_titles": {"en": "Chapter 164"}, "path": "/books/al-kafi:5:3:164", "titles": {"ar": "باب صِفَةِ مُبَايَعَةِ النَّبِيِّ ( صلى الله عليه وآله ) النِّسَاءَ", "en": "Chapter 164 – Description of the pledging of the allegiances to the Prophet<sup>saww</sup> by the women"}}], "index": 1533, "local_index": 164, "part_type": "Chapter", "path": "/books/al-kafi:5:3:164", "titles": {"ar": "باب صِفَةِ مُبَايَعَةِ النَّبِيِّ ( صلى الله عليه وآله ) النِّسَاءَ", "en": "Chapter 164 – Description of the pledging of the allegiances to the Prophet<sup>saww</sup> by the women"}, "verse_count": 2, "verse_start_index": 10151, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 10152, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:3:164:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ أَسْلَمَ الْجَبَلِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَالِمٍ الْأَشَلِّ عَنِ الْمُفَضَّلِ بْنِ عُمَرَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) كَيْفَ مَاسَحَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) النِّسَاءَ حِينَ بَايَعَهُنَّ قَالَ دَعَا بِمِرْكَنِهِ الَّذِي كَانَ يَتَوَضَّأُ فِيهِ فَصَبَّ فِيهِ مَاءً ثُمَّ غَمَسَ يَدَهُ الْيُمْنَى فَكُلَّمَا بَايَعَ وَاحِدَةً مِنْهُنَّ قَالَ اغْمِسِي يَدَكِ فَتَغْمِسُ كَمَا غَمَسَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَكَانَ هَذَا مُمَاسَحَتَهُ إِيَّاهُنَّ .", "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مِثْلَهُ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Ali, from Muhammad Bin Aslam Al Jably, from Abdul Rahman Bin Salim Al Ashal, from Al Mufazzal Bin Umar who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘How did Rasool-Allah<sup>saww</sup> touch the hands of the women when they pledged their allegiances to him<sup>saww</sup>?’ He<sup>asws</sup> said: ‘He<sup>saww</sup> called for his<sup>saww</sup> bowl which he<sup>saww</sup> used to perform his<sup>saww</sup> ablution in, so he<sup>saww</sup> poured water in it, then immersed his<sup>saww</sup> right hand therein. So every time one of them pledged her allegiance, he<sup>saww</sup> said: ‘Immerse your hand’. So she would immerse just as Rasool-Allah<sup>saww</sup> had immersed. Thus, this was his<sup>saww</sup> ‘touching’ of their hands’.", "Ali Bin Ibrahim, from his father, from one of his companions, ", "from Abu Abdullah<sup>asws</sup>, similar to it."]}}, {"index": 10153, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:3:164:2", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ سَعْدَانَ بْنِ مُسْلِمٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَ تَدْرِي كَيْفَ بَايَعَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) النِّسَاءَ قُلْتُ اللَّهُ أَعْلَمُ وَ ابْنُ رَسُولِهِ أَعْلَمُ قَالَ جَمَعَهُنَّ حَوْلَهُ ثُمَّ دَعَا بِتَوْرِ بَرَامٍ فَصَبَّ فِيهِ نَضُوحاً ثُمَّ غَمَسَ يَدَهُ فِيهِ ثُمَّ قَالَ اسْمَعْنَ يَا هَؤُلَاءِ أُبَايِعُكُنَّ عَلَى أَنْ لَا تُشْرِكْنَ بِاللَّهِ شَيْئاً وَ لَا تَسْرِقْنَ وَ لَا تَزْنِينَ وَ لَا تَقْتُلْنَ أَوْلَادَكُنَّ وَ لَا تَأْتِينَ بِبُهْتَانٍ تَفْتَرِينَهُ بَيْنَ أَيْدِيكُنَّ وَ أَرْجُلِكُنَّ وَ لَا تَعْصِينَ بُعُولَتَكُنَّ فِي مَعْرُوفٍ أَقْرَرْتُنَّ قُلْنَ نَعَمْ ", "فَأَخْرَجَ يَدَهُ مِنَ التَّوْرِ ثُمَّ قَالَ لَهُنَّ اغْمِسْنَ أَيْدِيَكُنَّ فَفَعَلْنَ فَكَانَتْ يَدُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) الطَّاهِرَةُ أَطْيَبَ مِنْ أَنْ يَمَسَّ بِهَا كَفَّ أُنْثَى لَيْسَتْ لَهُ بِمَحْرَمٍ ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Ahmad Bin Is’haq, from Sa’dan Bin Muslim who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘Do you know how Rasool-Allah<sup>saww</sup> accepted the allegiances of the women?’ I said, ‘Allah<sup>azwj</sup> Knows and the son<sup>asws</sup> of His<sup>azwj</sup> Rasool<sup>saww</sup> knows’. He<sup>asws</sup> said: ‘He<sup>saww</sup> gathered them around him<sup>saww</sup>, then called for a <span class=\"iTxt\">Baram</span> bowl, so he<sup>saww</sup> poured a little water into it, then immersed his<sup>saww</sup> hand in it, then said: ‘Listen all of you! You are pledging allegiance upon a stipulation that you will not be associating anything with Allah<sup>azwj</sup>, nor would you be stealing, nor committing adultery, nor kill your children, nor be coming with false accusations forged by your hands and your feet, and you will not be disobeying your husbands regarding the good. Do you agree?’ They said, ‘Yes’. ", "So he<sup>saww</sup> extracted his<sup>saww</sup>hand from the bowl, then said to them: ‘Immerse your hands’. So they did it. So the hand of Rasool-Allah<sup>saww</sup> was the pure, the good, from it having been touched by the palm of a female who had no sanctity with him<sup>saww</sup>’."]}}]}, "index": "al-kafi:5:3:164", "kind": "verse_list"}