{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 173"
        },
        "path": "/books/al-kafi:5:3:173",
        "titles": {
          "ar": "باب حَدِّ الْجَارِيَةِ الصَّغِيرَةِ الَّتِي يَجُوزُ أَنْ تُقَبَّلَ",
          "en": "Chapter 170 – Limit of the young girl who he is allowed to be kissed"
        }
      }
    ],
    "index": 1544,
    "local_index": 173,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 174"
        },
        "path": "/books/al-kafi:5:3:174",
        "titles": {
          "ar": "باب فِي نَحْوِ ذَلِكَ ",
          "en": "Chapter 171 – Regarding approximate to that"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 172"
        },
        "path": "/books/al-kafi:5:3:172",
        "titles": {
          "ar": "باب مَتَى يَجِبُ عَلَى الْجَارِيَةِ الْقِنَاعُ ",
          "en": "Chapter 169 – When is the scarf Obligatory upon the girl"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:3:173",
    "titles": {
      "ar": "باب حَدِّ الْجَارِيَةِ الصَّغِيرَةِ الَّتِي يَجُوزُ أَنْ تُقَبَّلَ",
      "en": "Chapter 170 – Limit of the young girl who he is allowed to be kissed"
    },
    "verse_count": 3,
    "verse_start_index": 10173,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/371)"
        ],
        "index": 10174,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:173:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَبْدِ اللَّهِ بْنِ يَحْيَى الْكَاهِلِيِّ عَنْ أَبِي أَحْمَدَ الْكَاهِلِيِّ وَ أَظُنُّنِي قَدْ حَضَرْتُهُ قَالَ سَأَلْتُهُ عَنْ جُوَيْرِيَةٍ لَيْسَ بَيْنِي وَ بَيْنَهَا مَحْرَمٌ تَغْشَانِي فَأَحْمِلُهَا فَأُقَبِّلُهَا فَقَالَ إِذَا أَتَى عَلَيْهَا سِتُّ سِنِينَ فَلَا تَضَعْهَا عَلَى حَجْرِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Abdullah Bin Yahya Al Kahily, from Abu Ahmad Al Kahily, and I think I have seen him, said, ",
            "‘I asked him<sup>asws</sup> about a girl, there not been a sanctity between me and her, and she dazes me, so I carry her and I kiss her. So he<sup>asws</sup> said: ‘When there come upon her six years, so do not place her upon your lap’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from ‘Abd Allah ibn Yahya al-Kahiliy from abu Ahmad al-Kahiliy -I think I met him who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about a girl who is not a relative to me who holds me and I carry her and kiss her. He (the Imam) said, ‘When she becomes six years old then you must not place her in your lap.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/371)"
        ],
        "index": 10175,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:173:2",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَحْيَى عَنْ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ إِذَا بَلَغَتِ الْجَارِيَةُ الْحُرَّةُ سِتَّ سِنِينَ فَلَا يَنْبَغِي لَكَ أَنْ تُقَبِّلَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from someone else, from Aban Bin Usman, from Abdul Rahman Bin Yahya, from Zurara, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the free girl reaches six years, so it is not befitting for you that you kiss her’."
          ],
          "en.sarwar": [
            "2. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad ibn Sama‘ah from more than one person from Aban ibn ‘Uthman from ‘Abd al-Rahman ibn Yahya from Zurarah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘When a free girl becomes six years old then it is not proper for you to kiss her.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/371)"
        ],
        "index": 10176,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:173:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ بَعْضِ رِجَالِهِ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) أَنَّ بَعْضَ بَنِي هَاشِمٍ دَعَاهُ مَعَ جَمَاعَةٍ مِنْ أَهْلِهِ فَأَتَى بِصَبِيَّةٍ لَهُ فَأَدْنَاهَا أَهْلُ الْمَجْلِسِ جَمِيعاً إِلَيْهِمْ فَلَمَّا دَنَتْ مِنْهُ سَأَلَ عَنْ سِنِّهَا فَقِيلَ خَمْسٌ فَنَحَّاهَا عَنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Haroun Bin Muslim, from one of his men, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup> that one of the Clan of Hashim<sup>as</sup> invited him<sup>asws</sup> along with a group of his<sup>asws</sup> family members. So he came over with a young girl of his, and he made her go near the people of the gathering each of them. So when she approached him<sup>asws</sup>, he<sup>asws</sup> asked about her age. So it was said, ‘Five’. So he<sup>asws</sup> forbade her from it’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from Harun ibn Muslim from certain persons of his narrators who have said the following: “A certain person of banu Hashim once invited abu al-Hassan, al-Rida’, ‘Alayhi al-Salam, along with a group of his people and a girl was brought in the gathering. People called her one by one and when she was brought near him (the Imam) he asked, ‘How old is she ? 5 It was said that she was five years old. He (the Imam) then asked her to stand back.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:3:173",
  "kind": "verse_list"
}