{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:5:3", "titles": {"ar": "كتاب النِّكَاحِ", "en": "THE BOOK OF MARRIAGE"}}, {"indexed_titles": {"en": "Chapter 18"}, "path": "/books/al-kafi:5:3:18", "titles": {"ar": "باب أَنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى خَلَقَ لِلنَّاسِ شَكْلَهُمْ", "en": "Chapter 18 – Allah<sup>azwj</sup> Blessed and High Created for the people their forms"}}], "index": 1387, "local_index": 18, "part_type": "Chapter", "path": "/books/al-kafi:5:3:18", "titles": {"ar": "باب أَنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى خَلَقَ لِلنَّاسِ شَكْلَهُمْ", "en": "Chapter 18 – Allah<sup>azwj</sup> Blessed and High Created for the people their forms"}, "verse_count": 1, "verse_start_index": 9422, "verses": [{"index": 9423, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:3:18:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ مُحَمَّدٍ</span> عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ بُرَيْدِ بْنِ مُعَاوِيَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَتَى النَّبِيَّ ( صلى الله عليه وآله ) رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَحْمِلُ أَعْظَمَ مَا يَحْمِلُ الرِّجَالُ فَهَلْ يَصْلُحُ لِي أَنْ آتِيَ بَعْضَ مَا لِي مِنَ الْبَهَائِمِ نَاقَةً أَوْ حِمَارَةً فَإِنَّ النِّسَاءَ لَا يَقْوَيْنَ عَلَى مَا عِنْدِي فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى لَمْ يَخْلُقْكَ حَتَّى خَلَقَ لَكَ مَا يَحْتَمِلُكَ مِنْ شَكْلِكَ \nفَانْصَرَفَ الرَّجُلُ وَ لَمْ يَلْبَثْ أَنْ عَادَ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ لَهُ مِثْلَ مَقَالَتِهِ فِي أَوَّلِ مَرَّةٍ فَقَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَأَيْنَ أَنْتَ مِنَ السَّوْدَاءِ العَنَطْنَطَةِ قَالَ فَانْصَرَفَ الرَّجُلُ فَلَمْ يَلْبَثْ أَنْ عَادَ فَقَالَ يَا رَسُولَ اللَّهِ أَشْهَدُ أَنَّكَ رَسُولُ اللَّهِ حَقّاً إِنِّي طَلَبْتُ مَا أَمَرْتَنِي بِهِ فَوَقَعْتُ عَلَى شَكْلِي مِمَّا يَحْتَمِلُنِي وَ قَدْ أَقْنَعَنِي ذَلِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from Salih Bin Abu Hammad, from Haroun Bin Muslim, from Bureyd Bin Muawiya, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A man came over to the Prophet<sup>saww</sup>, so he said, ‘O Rasool-Allah<sup>saww</sup>! I bear greater than what the men bear, so is it correct for me that I go to some of what is for me from the beasts, a she-camel or a donkey, for the women are not strong enough upon what is with me?’ Rasool-Allah<sup>saww</sup> said: Allah<sup>azwj</sup> Blessed and High did not Create you until He<sup>azwj</sup> Created for you from your shape, what can bear you’. \nSo the man left and it was not long before he returned to Rasool-Allah<sup>saww</sup>, so he said to him similar to what his words were the first time. So Rasool-Allah<sup>saww</sup> said to him: ‘So where are you from the black (woman), the long-necked one and a healthy body?’ He<sup>asws</sup> said: ‘So the man left, and it was not long before he returned, so he said, ‘O Rasool-Allah<sup>saww</sup>! I hereby testify that you<sup>saww</sup> are Rasool-Allah<sup>saww</sup>, truly! I sought what you<sup>saww</sup> had ordered me with, so she happened to be upon my shape from what could bear me, and that has sufficed me’."}]}]}, "index": "al-kafi:5:3:18", "kind": "verse_list"}