{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:5:3", "titles": {"ar": "كتاب النِّكَاحِ", "en": "THE BOOK OF MARRIAGE"}}, {"indexed_titles": {"en": "Chapter 182"}, "path": "/books/al-kafi:5:3:182", "titles": {"ar": "باب اللِّوَاطِ", "en": "Chapter 182 - The Sodomy"}}], "index": 1551, "local_index": 182, "part_type": "Chapter", "path": "/books/al-kafi:5:3:182", "titles": {"ar": "باب اللِّوَاطِ", "en": "Chapter 182 - The Sodomy"}, "verse_count": 10, "verse_start_index": 10214, "verses": [{"index": 10215, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:3:182:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ حُرْمَةُ الدُّبُرِ أَعْظَمُ مِنْ حُرْمَةِ الْفَرْجِ إِنَّ اللَّهَ أَهْلَكَ أُمَّةً بِحُرْمَةِ الدُّبُرِ وَ لَمْ يُهْلِكْ أَحَداً بِحُرْمَةِ الْفَرْجِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus, from one of our companions, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘The sanctity of the anus is greater that the sanctity of the vagina. Allah<sup>azwj</sup> Destoyed communities due to the (violation of the) sanctity of the anus but did not destroy anyone due to the (violation of the) sanctity of the vagina’."}]}, {"index": 10216, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:3:182:2", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ جَامَعَ غُلَاماً جَاءَ جُنُباً يَوْمَ الْقِيَامَةِ لَا يُنَقِّيهِ مَاءُ الدُّنْيَا وَ غَضِبَ اللَّهُ عَلَيْهِ وَ لَعَنَهُ وَ أَعَدَّ لَهُ جَهَنَّمَ وَ سَاءَتْ مَصِيراً \nثُمَّ قَالَ إِنَّ الذَّكَرَ لَيَرْكَبُ الذَّكَرَ فَيَهْتَزُّ الْعَرْشُ لِذَلِكَ وَ إِنَّ الرَّجُلَ لَيُؤْتَى فِي حَقَبِهِ فَيَحْبِسُهُ اللَّهُ عَلَى جِسْرِ جَهَنَّمَ حَتَّى يَفْرُغَ مِنْ حِسَابِ الْخَلَائِقِ ثُمَّ يُؤْمَرُ بِهِ إِلَى جَهَنَّمَ فَيُعَذَّبُ بِطَبَقَاتِهَا طَبَقَةً طَبَقَةً حَتَّى يُرَدَّ إِلَى أَسْفَلِهَا وَ لَا يَخْرُجُ مِنْهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abu Bakr Al Hazramy, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>asws</sup> said: ‘The one who copulates with the boys would come sexually impure on the Day of Judgement, the water of the world not having purified him, and Allah<sup>azwj</sup> would be Wrathful upon him, and would Curse him, and Prepare Hell for him, and it is an evil destination’. \nThen he<sup>asws</sup> said: ‘When the man rides upon the man, so the Throne trembles due to that, and if the man is come to in his hole, so Allah<sup>azwj</sup> would Reckon him upon a bridge of Hell until He<sup>azwj</sup> is Free from the Reckoning of the people.Then He<sup>azwj</sup> would Command with him to be taken to the Hell, so he would be Punished with its Layers, Layer after Layer until he is returned to its lowest, and he would not come out from it’."}]}, {"index": 10217, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:3:182:3", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) اللِّوَاطُ مَا دُونَ الدُّبُرِ وَ الدُّبُرُ هُوَ الْكُفْرُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘The sodomy is what is less than the (entering the) behind, and the (entering the) behind, it is the blasphemy’."}]}, {"index": 10218, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:5:3:182:4", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي قَوْمِ لُوطٍ ( عليه السلام ) إِنَّكُمْ لَتَأْتُونَ الْفاحِشَةَ ما سَبَقَكُمْ بِها مِنْ أَحَدٍ مِنَ الْعالَمِينَ فَقَالَ إِنَّ إِبْلِيسَ أَتَاهُمْ فِي صُورَةٍ حَسَنَةٍ فِيهِ تَأْنِيثٌ عَلَيْهِ ثِيَابٌ حَسَنَةٌ فَجَاءَ إِلَى شَبَابٍ مِنْهُمْ فَأَمَرَهُمْ أَنْ يَقَعُوا بِهِ فَلَوْ طَلَبَ إِلَيْهِمْ أَنْ يَقَعَ بِهِمْ لَأَبَوْا عَلَيْهِ وَ لَكِنْ طَلَبَ إِلَيْهِمْ أَنْ يَقَعُوا بِهِ فَلَمَّا وَقَعُوا بِهِ الْتَذُّوهُ ثُمَّ ذَهَبَ عَنْهُمْ وَ تَرَكَهُمْ فَأَحَالَ بَعْضَهُمْ عَلَى بَعْضٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Aban Bin Usman, from Abu Baseer, \n(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) regarding the people of Lut<sup>as</sup> <span class=\"ibTxt\">[7:80] You are commiting an indecency, which no one in the worlds has done before you?</span> So he<sup>asws</sup> said: ‘Iblees<sup>la</sup> came to them in an image of beauty wherein was femininity, upon him<sup>la</sup> were beautiful clothes. So he<sup>la</sup> came over to the youths from them and instructed them that they should fall upon him<sup>la</sup>. Had he<sup>la</sup> sought to them that he<sup>la</sup> should fall upon them, they would have refused to him<sup>la</sup>, but he<sup>la</sup> sought to them that they should shall upon him<sup>la</sup>. So when they did it, they attained pleasure. Then he<sup>la</sup> went away from them and left them, so they fell upon each other’."}]}, {"index": 10219, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:5:3:182:5", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ سَعِيدٍ قَالَ أَخْبَرَنِي زَكَرِيَّا بْنُ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ عَمْرٍو عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كَانَ قَوْمُ لُوطٍ مِنْ أَفْضَلِ قَوْمٍ خَلَقَهُمُ اللَّهُ فَطَلَبَهُمْ إِبْلِيسُ الطَّلَبَ الشَّدِيدَ وَ كَانَ مِنْ فَضْلِهِمْ وَ خِيَرَتِهِمْ أَنَّهُمْ إِذَا خَرَجُوا إِلَى الْعَمَلِ خَرَجُوا بِأَجْمَعِهِمْ وَ تَبْقَى النِّسَاءُ خَلْفَهُمْ فَلَمْ يَزَلْ إِبْلِيسُ يَعْتَادُهُمْ فَكَانُوا إِذَا رَجَعُوا خَرَّبَ إِبْلِيسُ مَا يَعْمَلُونَ فَقَالَ بَعْضُهُمْ لِبَعْضٍ تَعَالَوْا نَرْصُدْ هَذَا الَّذِي يُخَرِّبُ مَتَاعَنَا فَرَصَدُوهُ فَإِذَا هُوَ غُلَامٌ أَحْسَنُ مَا يَكُونُ مِنَ الْغِلْمَانِ فَقَالُوا لَهُ أَنْتَ الَّذِي تُخَرِّبُ مَتَاعَنَا مَرَّةً بَعْدَ مَرَّةٍ\nفَاجْتَمَعَ رَأْيُهُمْ عَلَى أَنْ يَقْتُلُوهُ فَبَيَّتُوهُ عِنْدَ رَجُلٍ فَلَمَّا كَانَ اللَّيْلُ صَاحَ فَقَالَ لَهُ مَا لَكَ فَقَالَ كَانَ أَبِي يُنَوِّمُنِي عَلَى بَطْنِهِ فَقَالَ لَهُ تَعَالَ فَنَمْ عَلَى بَطْنِي قَالَ فَلَمْ يَزَلْ يَدْلُكُ الرَّجُلَ حَتَّى عَلَّمَهُ أَنَّهُ يَفْعَلُ بِنَفْسِهِ فَأَوَّلًا عَلَّمَهُ إِبْلِيسُ وَ الثَّانِيَةَ عَلَّمَهُ هُوَ ثُمَّ انْسَلَّ فَفَرَّ مِنْهُمْ\nوَ أَصْبَحُوا فَجَعَلَ الرَّجُلُ يُخْبِرُ بِمَا فَعَلَ بِالْغُلَامِ وَ يُعَجِّبُهُمْ مِنْهُ وَ هُمْ لَا يَعْرِفُونَهُ فَوَضَعُوا أَيْدِيَهُمْ فِيهِ حَتَّى اكْتَفَى الرِّجَالُ بِالرِّجَالِ بَعْضُهُمْ بِبَعْضٍ ثُمَّ جَعَلُوا يَرْصُدُونَ مَارَّةَ الطَّرِيقِ فَيَفْعَلُونَ بِهِمْ حَتَّى تَنَكَّبَ مَدِينَتَهُمُ النَّاسُ ثُمَّ تَرَكُوا نِسَاءَهُمْ وَ أَقْبَلُوا عَلَى الْغِلْمَانِ\nفَلَمَّا رَأَى أَنَّهُ قَدْ أَحْكَمَ أَمْرَهُ فِي الرِّجَالِ جَاءَ إِلَى النِّسَاءِ فَصَيَّرَ نَفْسَهُ امْرَأَةً فَقَالَ إِنَّ رِجَالَكُنَّ يَفْعَلُ بَعْضُهُمْ بِبَعْضٍ قَالُوا نَعَمْ قَدْ رَأَيْنَا ذَلِكَ وَ كُلَّ ذَلِكَ يَعِظُهُمْ لُوطٌ وَ يُوصِيهِمْ وَ إِبْلِيسُ يُغْوِيهِمْ حَتَّى اسْتَغْنَى النِّسَاءُ بِالنِّسَاءِ\nفَلَمَّا كَمَلَتْ عَلَيْهِمُ الْحُجَّةُ بَعَثَ اللَّهُ جَبْرَئِيلَ وَ مِيكَائِيلَ وَ إِسْرَافِيلَ ( عليهم السلام ) فِي زِيِّ غِلْمَانٍ عَلَيْهِمْ أَقْبِيَةٌ فَمَرُّوا بِلُوطٍ وَ هُوَ يَحْرُثُ فَقَالَ أَيْنَ تُرِيدُونَ مَا رَأَيْتُ أَجْمَلَ مِنْكُمْ قَطُّ قَالُوا إِنَّا أَرْسَلَنَا سَيِّدُنَا إِلَى رَبِّ هَذِهِ الْمَدِينَةِ قَالَ أَ وَ لَمْ يَبْلُغْ سَيِّدَكُمْ مَا يَفْعَلُ أَهْلُ هَذِهِ الْمَدِينَةِ يَا بَنِيَّ إِنَّهُمْ وَ اللَّهِ يَأْخُذُونَ الرِّجَالَ فَيَفْعَلُونَ بِهِمْ حَتَّى يَخْرُجَ الدَّمُ فَقَالُوا أَمَرَنَا سَيِّدُنَا أَنْ نَمُرَّ وَسَطَهَا قَالَ فَلِي إِلَيْكُمْ حَاجَةٌ قَالُوا وَ مَا هِيَ قَالَ تَصْبِرُونَ هَاهُنَا إِلَى اخْتِلَاطِ الظَّلَامِ\nقَالَ فَجَلَسُوا قَالَ فَبَعَثَ ابْنَتَهُ فَقَالَ جِيئِي لَهُمْ بِخُبْزٍ وَ جِيئِي لَهُمْ بِمَاءٍ فِي الْقُرْعَةِ وَ جِيئِي لَهُمْ عَبَاءً يَتَغَطَّوْنَ بِهَا مِنَ الْبَرْدِ فَلَمَّا أَنْ ذَهَبَتِ الِابْنَةُ أَقْبَلَ الْمَطَرُ وَ الْوَادِي فَقَالَ لُوطٌ السَّاعَةَ يَذْهَبُ بِالصِّبْيَانِ الْوَادِي قُومُوا حَتَّى نَمْضِيَ وَ جَعَلَ لُوطٌ يَمْشِي فِي أَصْلِ الْحَائِطِ وَ جَعَلَ جَبْرَئِيلُ وَ مِيكَائِيلُ وَ إِسْرَافِيلُ يَمْشُونَ وَسَطَ الطَّرِيقِ فَقَالَ يَا بَنِيَّ امْشُوا هَاهُنَا فَقَالُوا أَمَرَنَا سَيِّدُنَا أَنْ نَمُرَّ فِي وَسَطِهَا وَ كَانَ لُوطٌ يَسْتَغْنِمُ الظَّلَامَ\nوَ مَرَّ إِبْلِيسُ فَأَخَذَ مِنْ حِجْرِ امْرَأَةٍ صَبِيّاً فَطَرَحَهُ فِي الْبِئْرِ فَتَصَايَحَ أَهْلُ الْمَدِينَةِ كُلُّهُمْ عَلَى بَابِ لُوطٍ فَلَمَّا أَنْ نَظَرُوا إِلَى الْغِلْمَانِ فِي مَنْزِلِ لُوطٍ قَالُوا يَا لُوطُ قَدْ دَخَلْتَ فِي عَمَلِنَا فَقَالَ هَؤُلَاءِ ضَيْفِي فَلَا تَفْضَحُونِ فِي ضَيْفِي قَالُوا هُمْ ثَلَاثَةٌ خُذْ وَاحِداً وَ أَعْطِنَا اثْنَيْنِ\nقَالَ فَأَدْخَلَهُمُ الْحُجْرَةَ وَ قَالَ لَوْ أَنَّ لِي أَهْلَ بَيْتٍ يَمْنَعُونِّي مِنْكُمْ قَالَ وَ تَدَافَعُوا عَلَى الْبَابِ وَ كَسَرُوا بَابَ لُوطٍ وَ طَرَحُوا لُوطاً فَقَالَ لَهُ جَبْرَئِيلُ إِنَّا رُسُلُ رَبِّكَ لَنْ يَصِلُوا إِلَيْكَ فَأَخَذَ كَفّاً مِنْ بَطْحَاءَ فَضَرَبَ بِهَا وُجُوهَهُمْ وَ قَالَ شَاهَتِ الْوُجُوهُ فَعَمِيَ أَهْلُ الْمَدِينَةِ كُلُّهُمْ وَ قَالَ لَهُمْ لُوطٌ يَا رُسُلَ رَبِّي فَمَا أَمَرَكُمْ رَبِّي فِيهِمْ قَالُوا أَمَرَنَا أَنْ نَأْخُذَهُمْ بِالسَّحَرِ\nقَالَ فَلِي إِلَيْكُمْ حَاجَةٌ قَالُوا وَ مَا حَاجَتُكَ قَالَ تَأْخُذُونَهُمُ السَّاعَةَ فَإِنِّي أَخَافُ أَنْ يَبْدُوَ لِرَبِّي فِيهِمْ فَقَالُوا يَا لُوطُ إِنَّ مَوْعِدَهُمُ الصُّبْحُ أَ لَيْسَ الصُّبْحُ بِقَرِيبٍ لِمَنْ يُرِيدُ أَنْ يَأْخُذَ فَخُذْ أَنْتَ بَنَاتِكَ وَ امْضِ وَ دَعِ امْرَأَتَكَ\nفَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) رَحِمَ اللَّهُ لُوطاً لَوْ يَدْرِي مَنْ مَعَهُ فِي الْحُجْرَةِ لَعَلِمَ أَنَّهُ مَنْصُورٌ حَيْثُ يَقُولُ لَوْ أَنَّ لِي بِكُمْ قُوَّةً أَوْ آوِي إِلى رُكْنٍ شَدِيدٍ أَيُّ رُكْنٍ أَشَدُّ مِنْ جَبْرَئِيلَ مَعَهُ فِي الْحُجْرَةِ\nفَقَالَ اللَّهُ عَزَّ وَ جَلَّ لِمُحَمَّدٍ ( صلى الله عليه وآله ) وَ ما هِيَ مِنَ الظَّالِمِينَ بِبَعِيدٍ مِنْ ظَالِمِي أُمَّتِكَ إِنْ عَمِلُوا مَا عَمِلَ قَوْمُ لُوطٍ قَالَ وَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ أَلَحَّ فِي وَطْيِ الرِّجَالِ لَمْ يَمُتْ حَتَّى يَدْعُوَ الرِّجَالَ إِلَى نَفْسِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Saeed who said, ‘Zakariyya Bin Muhammad informed me, from his father, from Amro, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The people of Lut<sup>as</sup> were from the best of the people Created by Allah<sup>azwj</sup>. So Iblees<sup>la</sup> sought them with an intense seeking, and from their merits and their goodness was that whenever they went to the work, they went out altogether, and the women would remain behind them. So Iblees<sup>la</sup> would not cease to transgress them, So when they would return, Iblees<sup>la</sup> would have spoil whatever they had worked. So some of them said to the others, ‘Come, let us observe this one who is spoiling our provisions. So they observed, and there was a boy as good looking as can be from the boys. So they said to him, ‘You are the one who is spoiling our provisions time after time’.\nSo they formed a consensus upon killing him. So they lodged him for the night with a man. So when it was the night, he shrieked. So the man said, ‘What is the matter with you?’ So he said, ‘My father used to sleep me upon his belly’. So he said to him, ‘Come, so sleep upon my belly’. So he did not cease to massage the man until he taught him that he should do it with himself. Thus the first one to do it was Iblees<sup>la</sup>, and the second one to do it was him. Then he crept away and fled from them.\nAnd the morning came, so the man went over informing with what he had done with the boy and he astounded them from it, and they were not understanding it. So they placed their hands in it, indulging in it, until the men sufficed themselves with the men, with each other. Then they went on looking out for the passers by on the road, so they would be doing it with them until they had plagued the people of their cities. Then they neglected their women and faced towards the boys.\nSo when he<sup>la</sup> saw that his<sup>la</sup> matter had prevailed among the men, he<sup>la</sup> went to the women. So he<sup>la</sup> changed himself<sup>la</sup> into a woman, so he<sup>la</sup> said, ‘Your men are doing it to each other’. They said, ‘Yes, we have seen that’. And everytime Lut<sup>as</sup> advised them, Iblees<sup>la</sup> would stray them until the women sufficed themselves with the women.  \nSo when the argument was completed upon them, Allah<sup>azwj</sup> Sent Jibraeel<sup>as</sup> and Mikaeel<sup>as</sup>, and Israfeel<sup>as</sup> in the form of boys wearing gowns. So they<sup>as</sup> passed by Lut<sup>as</sup> and he<sup>as</sup> was farming, so he<sup>as</sup> said: ‘Where are you<sup>as</sup> intending to go. I<sup>as</sup> have not seen anyone more good-looking than you<sup>as</sup>’. They<sup>as</sup> said, ‘Our<sup>as</sup> Master<sup>azwj</sup> has Sent us<sup>as</sup> to the lord of this city’. He<sup>as</sup> said: ‘Has it not reached your<sup>as</sup> Master<sup>azwj</sup> of what the people of this city are doing? O my<sup>as</sup> sons! By Allah<sup>azwj</sup>, they are taking to the men, so they are doing it with them until the blood comes out’. Our<sup>as</sup> Master<sup>azwj</sup> has Commanded us<sup>as</sup> that we<sup>as</sup> pass through the middle of it’. He<sup>as</sup> said: ‘There is a need of mine<sup>as</sup> to you<sup>as</sup>’. They said, ‘And what is it?’ He<sup>as</sup> said: ‘Await over here until the crossing over of the darkness’. \nHe<sup>asws</sup> said: ‘So they were seated. So he<sup>as</sup> sent for his<sup>as</sup> daughter saying, ‘Come to me with some bread for them, and come to me with some water for them in the gourd, and come to me with a cloak for them to cover themselves with from the cold’. So when the daughter went, and they faced the rain and the valley. So Lut<sup>as</sup> said: ‘(This is) the time they go with the young boys of the valley. Arise until we pass by’, and Lut<sup>as</sup> went on to walk in the base of the wall, and Jibraeel<sup>as</sup> and Mikaeel<sup>as</sup> and Israfeel<sup>as</sup> were walking in the middle of the road. So he<sup>as</sup> said: ‘O my<sup>as</sup> sons, walk over here’. So they<sup>as</sup> said: ‘Our<sup>as</sup> Master<sup>azwj</sup> has Commanded us<sup>as</sup> to walk in the middle of it’. And Lut<sup>as</sup> wanted to benefit from the darkness.\nAnd Iblees<sup>la</sup> passed by and seized a child from the lap of a woman and dropped it in the well. So the people of the city gathered, all of them at the door of Lut<sup>as</sup>. So when they looked at the boys in the house of Lut<sup>as</sup>, they said, ‘O Lut<sup>as</sup>! You<sup>as</sup> have (also) entered into our deeds’. So he<sup>as</sup> said: ‘<span class=\"ibTxt\">[15:68] He said: Surely these are my guests, therefore do not disgrace me</span> regarding my<sup>as</sup> guests’. They said, ‘They are three of them, so take one and give us two’.\nHe<sup>asws</sup> said: ‘So he<sup>as</sup> entered them into the chamber and said, ‘If there was a family for me<sup>as</sup>, they would have defended me<sup>as</sup> from you all’. He<sup>asws</sup> said: ‘And they shoved upon the door and broke the door of Lut<sup>as</sup>, and floored Lut<sup>as</sup>. So Jibraeel<sup>as</sup> said to him<sup>as</sup>: ‘<span class=\"ibTxt\">[11:81] We are the Messengers of your Lord; they will never be able to reach you</span>’, So he<sup>as</sup> took a handful of soil from Bat’ha and sturk their faces with it, and said: ‘The faces be ugly!’ So the people of the city became blind, all of them, and Lut<sup>as</sup> said to them<sup>as</sup>: ‘O messengers of my<sup>as</sup> Lord<sup>azwj</sup>! So what did my<sup>as</sup> Lord<sup>azwj</sup> Command you<sup>as</sup> with regarding them?’ They said, ‘He<sup>azwj</sup> Commanded us<sup>asws</sup> that we<sup>as</sup> should seize them at dawn’. \nHe<sup>as</sup> said: ‘There is a need of mine<sup>as</sup> to you all<sup>as</sup>’. They said, ‘And what is your<sup>as</sup> need’. He<sup>as</sup> said: ‘Seize them at this time, for I<sup>as</sup> fear that my<sup>as</sup> Lord<sup>azwj</sup> may Change (His<sup>azwj</sup> Command) regarding them’. So they said: ‘O Lut<sup>as</sup>! <span class=\"ibTxt\">[11:81] surely their appointed time is the morning; is not the morning near </span>for the one whom He<sup>azwj</sup> Intends to Seize? Take your<sup>as</sup> daughters but leave your<sup>as</sup> wife (as she will be among those who will be punished)’.\nSo Abu Ja’far<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> have Mercy on Lut<sup>as</sup>. Had he<sup>as</sup> known the ones who were with him<sup>as</sup> in the chamber, he<sup>as</sup> would have known that he<sup>as</sup> is Supported, where he<sup>as</sup> was saying <span class=\"ibTxt\">[11:80] He said: Ah! If only I had power to suppress you, rather I shall have recourse to a strong support</span>’ i.e., strong recourse from Jibraeel<sup>as</sup> with him<sup>as</sup> in the chamber. \nSo Allah<sup>azwj</sup> Mighty and Majestic Said to Muhammad<sup>asws</sup> <span class=\"ibTxt\">[11:83] and it is not far off from the unjust</span> from the unjust ones of your<sup>as</sup> community that they should known what the people of Lut<sup>as</sup> did. And Rasool-Allah<sup>asws</sup> said: ‘The one who persists in copulating with the men will not died until he invites the men to himself’."}]}, {"index": 10220, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:5:3:182:6", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ فَضَّالٍ عَنْ دَاوُدَ بْنِ فَرْقَدٍ عَنْ أَبِي يَزِيدَ الْحَمَّارِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ بَعَثَ أَرْبَعَةَ أَمْلَاكٍ فِي إِهْلَاكِ قَوْمِ لُوطٍ جَبْرَئِيلَ وَ مِيكَائِيلَ وَ إِسْرَافِيلَ وَ كَرُوبِيلَ فَمَرُّوا بِإِبْرَاهِيمَ ( عليه السلام ) وَ هُمْ مُعْتَمُّونَ فَسَلَّمُوا عَلَيْهِ فَلَمْ يَعْرِفْهُمْ وَ رَأَى هَيْئَةً حَسَنَةً فَقَالَ لَا يَخْدُمُ هَؤُلَاءِ إِلَّا أَنَا بِنَفْسِي وَ كَانَ صَاحِبَ ضِيَافَةٍ\nفَشَوَى لَهُمْ عِجْلًا سَمِيناً حَتَّى أَنْضَجَهُ ثُمَّ قَرَّبَهُ إِلَيْهِمْ فَلَمَّا وَضَعَهُ بَيْنَ أَيْدِيهِمْ رَأى أَيْدِيَهُمْ لا تَصِلُ إِلَيْهِ نَكِرَهُمْ وَ أَوْجَسَ مِنْهُمْ خِيفَةً فَلَمَّا رَأَى ذَلِكَ جَبْرَئِيلُ حَسَرَ الْعِمَامَةَ عَنْ وَجْهِهِ فَعَرَفَهُ إِبْرَاهِيمُ فَقَالَ أَنْتَ هُوَ قَالَ نَعَمْ وَ مَرَّتْ سَارَةُ امْرَأَتُهُ فَبَشَّرَهَا بِإِسْحَاقَ وَ مِنْ وَرَاءِ إِسْحَاقَ يَعْقُوبَ فَقَالَتْ مَا قَالَ اللَّهُ عَزَّ وَ جَلَّ فَأَجَابُوهَا بِمَا فِي الْكِتَابِ \nفَقَالَ لَهُمْ إِبْرَاهِيمُ لِمَا ذَا جِئْتُمْ قَالُوا فِي إِهْلَاكِ قَوْمِ لُوطٍ فَقَالَ لَهُمْ إِنْ كَانَ فِيهِمْ مِائَةٌ مِنَ الْمُؤْمِنِينَ أَ تُهْلِكُونَهُمْ فَقَالَ جَبْرَئِيلُ لَا قَالَ فَإِنْ كَانَ فِيهَا خَمْسُونَ قَالَ لَا قَالَ فَإِنْ كَانَ فِيهَا ثَلَاثُونَ قَالَ لَا قَالَ فَإِنْ كَانَ فِيهَا عِشْرُونَ قَالَ لَا قَالَ فَإِنْ كَانَ فِيهَا عَشَرَةٌ قَالَ لَا قَالَ فَإِنْ كَانَ فِيهَا خَمْسَةٌ قَالَ لَا قَالَ فَإِنْ كَانَ فِيهَا وَاحِدٌ قَالَ لَا قَالَ فَإِنَّ فِيها لُوطاً قالُوا نَحْنُ أَعْلَمُ بِمَنْ فِيها لَنُنَجِّيَنَّهُ وَ أَهْلَهُ إِلَّا امْرَأَتَهُ كانَتْ مِنَ الْغابِرِينَ", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Fazzal, from Dawood Bin Farqad, from Abu Yazeed Al Hammar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Sent four Angels regarding the destruction of the people of Lut<sup>as</sup> – Jibraeel<sup>as</sup>, and Mikaeel<sup>as</sup>, and Israfeel<sup>as</sup>, and Karoubil<sup>as</sup>. So they<sup>as</sup> passed by Ibrahim<sup>as</sup> and they were wearing turbans. So they<sup>as</sup> greeted him<sup>as</sup>, but he<sup>as</sup> did not recognise them<sup>as</sup>, and he<sup>as</sup> saw them of good physical build. So he<sup>as</sup> said: ‘None shall serve them except I<sup>asws</sup> myself<sup>as</sup>’; and he<sup>as</sup> was a frequented with guests. \nSo he roasted a fat calf for them<sup>as</sup> until it was cooked, then he placed it near to them<sup>as</sup>. So when it was placed in front of them<sup>as</sup>, <span class=\"ibTxt\">[11:70] he saw that their hands were not extended towards it, he deemed them strange and conceived fear of them</span>. So when Jibraeel<sup>as</sup> saw that, he<sup>as</sup> removed the turban from his<sup>as</sup> face, and Ibrahim<sup>as</sup> recognised him<sup>as</sup>, so he<sup>as</sup> said: ‘You<sup>as</sup> are him<sup>as</sup>!’ He<sup>as</sup> said: ‘Yes’. And Sarah<sup>as</sup>, his<sup>as</sup> wife, passed by <span class=\"ibTxt\">[11:71] then We Gave her the good news of Is’haq and after Is’haq of Yaqoub</span>. So she<sup>as</sup> said what Allah<sup>azwj</sup> Mighty and Majestic Said. So they<sup>as</sup> answered her<sup>as</sup> with what is in the Book (Quran).\nSo Ibrahim<sup>as</sup> said to them<sup>as</sup>: ‘What is that you<sup>as</sup> have come for?’ They<sup>as</sup> said: ‘Regarding the destruction of the people of Lut<sup>as</sup>’. So he<sup>as</sup> said: ‘Supposing there are one hundred among them from the Believers, would you<sup>as</sup> destroy them?’ So Jibraeel<sup>as</sup> said: ‘No’. He<sup>as</sup> said: ‘Supposing there were fifty among them?’ He<sup>as</sup> said: ‘No’. He<sup>as</sup> said: ‘Supposing there were thirty among them?’ He<sup>as</sup> said: ‘No’. He<sup>as</sup> said: ‘Supposing there were twenty among them?’ He<sup>as</sup>: ‘No’. He<sup>as</sup> said: ‘Supposing there were ten among them?’ He<sup>as</sup> said: ‘No’. He<sup>as</sup> said: ‘Supposing there were five among them?’ He<sup>as</sup> Said: ‘No’. He<sup>as</sup> said: ‘Supposing there was one among them?’ He<sup>as</sup> said: ‘No’. <span class=\"ibTxt\">[29:32] He said: Surely in it is Lut. They said: We know very well who is in it; we shall rescue him and his followers, except for his wife; she shall be of those who remain behind</span>’."}]}, {"index": 10221, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:5:3:182:7", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ أَبِي حَمْزَةَ عَنْ يَعْقُوبَ بْنِ شُعَيْبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ لُوطٍ ( عليه السلام ) هؤُلاءِ بَناتِي هُنَّ أَطْهَرُ لَكُمْ قَالَ عَرَضَ عَلَيْهِمُ التَّزْوِيجَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muhammad Bin Abu Hamza, from Yaqoub Bin Shuayb, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the words of Lut<sup>as</sup> <span class=\"ibTxt\">[11:78] These are my daughters (nation’s daughters)- they are purer for you</span>. He<sup>asws</sup> said: ‘He<sup>as</sup> presented to them for the marriage’."}]}, {"index": 10222, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:5:3:182:8", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِيَّاكُمْ وَ أَوْلَادَ الْأَغْنِيَاءِ وَ الْمُلُوكِ الْمُرْدَ فَإِنَّ فِتْنَتَهُمْ أَشَدُّ مِنْ فِتْنَةِ الْعَذَارَى فِي خُدُورِهِنَّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>asws</sup> said: ‘Beware of the children of the rich and the kings, the tyrants, for their strife is more intense than the strife of the virgins in their dens (private chambers)’."}]}, {"index": 10223, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:5:3:182:9", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عُثْمَانَ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ مَيْمُونٍ الْبَانِ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقُرِئَ عِنْدَهُ آيَاتٌ مِنْ هُودٍ فَلَمَّا بَلَغَ وَ أَمْطَرْنا عَلَيْها حِجارَةً مِنْ سِجِّيلٍ مَنْضُودٍ مُسَوَّمَةً عِنْدَ رَبِّكَ وَ ما هِيَ مِنَ الظَّالِمِينَ بِبَعِيدٍ قَالَ فَقَالَ مَنْ مَاتَ مُصِرّاً عَلَى اللِّوَاطِ لَمْ يَمُتْ حَتَّى يَرْمِيَهُ اللَّهُ بِحَجَرٍ مِنْ تِلْكَ الْحِجَارَةِ تَكُونُ فِيهِ مَنِيَّتُهُ وَ لَا يَرَاهُ أَحَدٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Usman Bin Saeed, from Muhammad Bin Suleyman, from Maymoun Al Baan who said, \n‘I was in the presence of Abu Abdullah<sup>asws</sup>, so a Verse from (the Chapter) Hud was recited in his<sup>asws</sup> presence. So when it reached <span class=\"ibTxt\">[11:82] and Rained down upon them stones of clay, of what had been decreed, one after another [11:83] Marked (for Punishment) with your Lord and it is not far off from the unjust</span>, so he<sup>asws</sup> said: ‘The one who dies persisting upon Sodomy would not die until Allah<sup>azwj</sup> Pelts him with a stone from those stones in which his death takes place, but no one sees it’."}]}, {"index": 10224, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:5:3:182:10", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ قَبَّلَ غُلَاماً مِنْ شَهْوَةٍ أَلْجَمَهُ اللَّهُ يَوْمَ الْقِيَامَةِ بِلِجَامٍ مِنْ نَارٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Yahya, from Talha Bin Zayd, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>asws</sup> said: ‘The one who kisses a boy out of lustful desire, Allah<sup>azwj</sup> would Bridle him on the Day of Juddgement with a bridle of Fire’."}]}]}, "index": "al-kafi:5:3:182", "kind": "verse_list"}