{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:5:3", "titles": {"ar": "كتاب النِّكَاحِ", "en": "THE BOOK OF MARRIAGE"}}, {"indexed_titles": {"en": "Chapter 184"}, "path": "/books/al-kafi:5:3:184", "titles": {"ar": "باب السَّحْقِ", "en": "Chapter 184 – The Lesbianism"}}], "index": 1553, "local_index": 184, "part_type": "Chapter", "path": "/books/al-kafi:5:3:184", "titles": {"ar": "باب السَّحْقِ", "en": "Chapter 184 – The Lesbianism"}, "verse_count": 4, "verse_start_index": 10234, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 10235, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:3:184:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َبُو عَلِيٍّ الْأَشْعَرِيُّ</span> عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنْ عُبَيْسِ بْنِ هِشَامٍ عَنْ حُسَيْنِ بْنِ أَحْمَدَ الْمِنْقَرِيِّ عَنْ هِشَامٍ الصَّيْدَنَانِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلَهُ رَجُلٌ عَنْ هَذِهِ الْآيَةِ كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَ أَصْحابُ الرَّسِّ فَقَالَ بِيَدِهِ هَكَذَا فَمَسَحَ إِحْدَاهُمَا بِالْأُخْرَى فَقَالَ هُنَّ اللَّوَاتِي بِاللَّوَاتِي يَعْنِي النِّسَاءَ بِالنِّسَاءِ ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Al Hassan Bin Ali Al Kufy, from Ubeys Bin Hisham, from Husayn Bin Ahmad Al Minqary, from Hisham Al Saydani, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘A man asked him<sup>asws</sup> about this Verse <span class=\"ibTxt\"> [50:12] (Others) before them rejected (prophets): the people of Nuh and the dwellers of Ar-Rass</span>. So he<sup>asws</sup> said by (gesturing with) his<sup>asws</sup> hands: ‘Like this’, and he<sup>asws</sup> wiped one of them with the other, and he<sup>asws</sup> said: ‘They were the lesbians with the lesbians, meaning the women with the women’."]}}, {"index": 10236, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:3:184:2", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ إِسْحَاقَ بْنِ جَرِيرٍ قَالَ سَأَلَتْنِي امْرَأَةٌ أَنْ أَسْتَأْذِنَ لَهَا عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَأَذِنَ لَهَا فَدَخَلَتْ وَ مَعَهَا مَوْلَاةٌ لَهَا فَقَالَتْ يَا أَبَا عَبْدِ اللَّهِ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ زَيْتُونَةٍ لا شَرْقِيَّةٍ وَ لا غَرْبِيَّةٍ مَا عَنَى بِهَذَا فَقَالَ أَيَّتُهَا الْمَرْأَةُ إِنَّ اللَّهَ لَمْ يَضْرِبِ الْأَمْثَالَ لِلشَّجَرِ إِنَّمَا ضَرَبَ الْأَمْثَالَ لِبَنِي آدَمَ سَلِي عَمَّا تُرِيدِينَ", "فَقَالَتْ أَخْبِرْنِي عَنِ اللَّوَاتِي مَعَ اللَّوَاتِي مَا حَدُّهُنَّ فِيهِ قَالَ حَدُّ الزِّنَا إِنَّهُ إِذَا كَانَ يَوْمُ الْقِيَامَةِ يُؤْتَى بِهِنَّ قَدْ أُلْبِسْنَ مُقَطَّعَاتٍ مِنْ نَارٍ وَ قُنِّعْنَ بِمَقَانِعَ مِنْ نَارٍ وَ سُرْوِلْنَ مِنَ النَّارِ وَ أُدْخِلَ فِي أَجْوَافِهِنَّ إِلَى رُءُوسِهِنَّ أَعْمِدَةٌ مِنْ نَارٍ وَ قُذِفَ بِهِنَّ فِي النَّارِ أَيَّتُهَا الْمَرْأَةُ إِنَّ أَوَّلَ مَنْ عَمِلَ هَذَا الْعَمَلَ قَوْمُ لُوطٍ فَاسْتَغْنَى الرِّجَالُ بِالرِّجَالِ فَبَقِيَ النِّسَاءُ بِغَيْرِ رِجَالٍ فَفَعَلْنَ كَمَا فَعَلَ رِجَالُهُنَّ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Is’haq Bin Jareer who said, ", "‘A woman asked me to get her permission to see Abu Abdullah<sup>asws</sup>. So I got the permission for her. She came over and with her was a slave girl of hers, so she said, ‘O Abu Abdullah<sup>asws</sup>! (What about) the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[24:35] lit from a blessed olive-tree, neither eastern nor western</span>, what is Meant by this?’ So he<sup>asws</sup> said: ‘O you woman! Allah<sup>azwj</sup> does not Strike the examples of the tree, but rather He<sup>azwj</sup> Stikes the examples for the children of Adam<sup>as</sup>. Ask whatever you are intending for’. ", "So she said, ‘Inform me about the lesbian with the lesbian, what is their Legal Punishments (<span class=\"iTxt\">Hadd</span>) with regards to it?’ He<sup>asws</sup> said:’ The Legal Punishment (<span class=\"iTxt\">Hadd</span>) of the adultery. When it will be the Day of Judgement, they would come with them wearing the clothing cut out from the Fire, and veiled by the veils of Fire, and their trousers would be from the Fire, and pillars of Fire would be entered into their insides up to the heads, and they would be thrown into the Fire. O you woman! The first ones who did this act were the people of Lut<sup>as</sup>. The men sufficed themselves with the men, so the women remained without men, so they did as their men had done’."]}}, {"index": 10237, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:3:184:3", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ يَزِيدَ النَّخَعِيِّ عَنْ بَشِيرٍ النَّبَّالِ قَالَ رَأَيْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) رَجُلًا فَقَالَ لَهُ جُعِلْتُ فِدَاكَ مَا تَقُولُ فِي اللَّوَاتِي مَعَ اللَّوَاتِي فَقَالَ لَهُ لَا أُخْبِرُكَ حَتَّى تَحْلِفَ لَتُخْبِرَنَّ بِمَا أُحَدِّثُكَ بِهِ النِّسَاءَ قَالَ فَحَلَفَ لَهُ ", "قَالَ فَقَالَ هُمَا فِي النَّارِ وَ عَلَيْهِمَا سَبْعُونَ حُلَّةً مِنْ نَارٍ فَوْقَ تِلْكَ الْحُلَلِ جِلْدٌ جَافٌّ غَلِيظٌ مِنْ نَارٍ عَلَيْهِمَا نِطَاقَانِ مِنْ نَارٍ وَ تَاجَانِ مِنْ نَارٍ فَوْقَ تِلْكَ الْحُلَلِ وَ خُفَّانِ مِنْ نَارٍ وَ هُمَا فِي النَّارِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Amro Bin Usman, from Yazeed Al Nakhaie, from Basheer Al Nabbal who said, ", "‘I saw a man in the presence of Abu Abdullah<sup>asws</sup> saying to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! What are you<sup>asws</sup> saying regarding the lesbian with the lesbian?’ So he<sup>asws</sup> said: ‘I<sup>asws</sup> will not inform you until you swear an oath that you will inform the women with what I am informing you with’. So she swore an oath for him<sup>asws</sup>.", "He (the narrator) said, ‘So he<sup>asws</sup> said: ‘They would both be in the Fire, and upon them would be seventy garments of Fire. Above those garments would be a dehydrated thick skin of Fire, and upon them both would be belts of Fire, and crowns of Fire above those garments, and two shoes of Fire, and they would both be in the Fire’."]}}, {"index": 10238, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:5:3:184:4", "text": ["عَنْهُ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ الْقَاسِمِ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ زِيَادٍ عَنْ يَعْقُوبَ بْنِ جَعْفَرٍ قَالَ سَأَلَ رَجُلٌ أَبَا عَبْدِ اللَّهِ أَوْ أَبَا إِبْرَاهِيمَ ( عليه السلام ) عَنِ الْمَرْأَةِ تُسَاحِقُ الْمَرْأَةَ وَ كَانَ مُتَّكِئاً فَجَلَسَ فَقَالَ مَلْعُونَةٌ الرَّاكِبَةُ وَ الْمَرْكُوبَةُ وَ مَلْعُونَةٌ حَتَّى تَخْرُجَ مِنْ أَثْوَابِهَا الرَّاكِبَةُ وَ الْمَرْكُوبَةُ فَإِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى وَ الْمَلَائِكَةَ وَ أَوْلِيَاءَهُ يَلْعَنُونَهُمَا وَ أَنَا وَ مَنْ بَقِيَ فِي أَصْلَابِ الرِّجَالِ وَ أَرْحَامِ النِّسَاءِ فَهُوَ وَ اللَّهِ الزِّنَا الْأَكْبَرُ وَ لَا وَ اللَّهِ مَا لَهُنَّ تَوْبَةٌ قَاتَلَ اللَّهُ لَاقِيسَ بِنْتَ إِبْلِيسَ مَا ذَا جَاءَتْ بِهِ ", "فَقَالَ الرَّجُلُ هَذَا مَا جَاءَ بِهِ أَهْلُ الْعِرَاقِ فَقَالَ وَ اللَّهِ لَقَدْ كَانَ عَلَى عَهْدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) قَبْلَ أَنْ يَكُونَ الْعِرَاقُ وَ فِيهِنَّ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَعَنَ اللَّهُ الْمُتَشَبِّهَاتِ بِالرِّجَالِ مِنَ النِّسَاءِ وَ لَعَنَ اللَّهُ الْمُتَشَبِّهِينَ مِنَ الرِّجَالِ بِالنِّسَاءِ ."], "translations": {"en.hubeali": ["From him, from his father, from Ali Bin Al Qasim, from Ja’far Bin Muhammad, from Al Husayn Bin Ziyad, from Yaqoub Bin Ja’far who said, ", "‘A man asked Abu Abdullah<sup>asws</sup> or Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) about the woman performing lesbian acts with the woman; and he<sup>asws</sup> was reclining, so he<sup>asws</sup> sat up and said: ‘Accursed! The rider as well as the ridden, until she comes out from their clothes, the rider as well as the ridden one, for Allah<sup>azwj</sup> Blessed and High, and the Angels, and the Guardians<sup>asws</sup> are cursing them both, and myself<sup>asws</sup>, and the ones who remain in the loins of the men and the wombs of the women, for by Allah<sup>azwj</sup> it is the greatest adultery, and by Allah<sup>azwj</sup>, there is no repentance for them. May Allah<sup>azwj</sup> Kill Laqys daughter of Iblees<sup>la</sup> with what she came up with’.", "So the man said, ‘This is what the people of Al-Iraq are coming up with’. So he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! It was happening upon the era of Rasool-Allah<sup>asws</sup> before the existence of Al-Iraq, and regarding them Rasool-Allah<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> Curse the women resembling themselves with the men, and may Allah<sup>azwj</sup> Curse the men resembling themselves with the women’."]}}]}, "index": "al-kafi:5:3:184", "kind": "verse_list"}