{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 186"
        },
        "path": "/books/al-kafi:5:3:186",
        "titles": {
          "ar": "باب اللِّوَاطِ",
          "en": "Chapter 182 - The Sodomy"
        }
      }
    ],
    "index": 1557,
    "local_index": 186,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 187"
        },
        "path": "/books/al-kafi:5:3:187",
        "titles": {
          "ar": "باب مَنْ أَمْكَنَ مِنْ نَفْسِهِ ",
          "en": "Chapter 183 – The one who enables (others) unto himself"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 185"
        },
        "path": "/books/al-kafi:5:3:185",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الزَّانِيَةِ </span>",
          "en": "Chapter 181 – The Adulteress"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:3:186",
    "titles": {
      "ar": "باب اللِّوَاطِ",
      "en": "Chapter 182 - The Sodomy"
    },
    "verse_count": 10,
    "verse_start_index": 10217,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/389)"
        ],
        "index": 10218,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:186:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ حُرْمَةُ الدُّبُرِ أَعْظَمُ مِنْ حُرْمَةِ الْفَرْجِ إِنَّ اللَّهَ أَهْلَكَ أُمَّةً بِحُرْمَةِ الدُّبُرِ وَ لَمْ يُهْلِكْ أَحَداً بِحُرْمَةِ الْفَرْجِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus, from one of our companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘The sanctity of the anus is greater that the sanctity of the vagina. Allah<sup>azwj</sup> Destoyed communities due to the (violation of the) sanctity of the anus but did not destroy anyone due to the (violation of the) sanctity of the vagina’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ‘Isma’il ibn Marrar from Yunus from certain persons of his people who has said the following: “I once heard abu ‘ Abd Allah, ‘Alayhi al-Salam, saying, The unlawfulness of homosexual unlawful sexual intercourse is more serious than unlawful heterosexual sexual intercourse; Allah destroyed a whole nation because of homosexual sexual intercourse but He has not destroyed as such because of heterosexual unlawful sexual intercourse.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/389)"
        ],
        "index": 10219,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:186:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ جَامَعَ غُلَاماً جَاءَ جُنُباً يَوْمَ الْقِيَامَةِ لَا يُنَقِّيهِ مَاءُ الدُّنْيَا وَ غَضِبَ اللَّهُ عَلَيْهِ وَ لَعَنَهُ وَ أَعَدَّ لَهُ جَهَنَّمَ وَ سَاءَتْ مَصِيراً ",
          "ثُمَّ قَالَ إِنَّ الذَّكَرَ لَيَرْكَبُ الذَّكَرَ فَيَهْتَزُّ الْعَرْشُ لِذَلِكَ وَ إِنَّ الرَّجُلَ لَيُؤْتَى فِي حَقَبِهِ فَيَحْبِسُهُ اللَّهُ عَلَى جِسْرِ جَهَنَّمَ حَتَّى يَفْرُغَ مِنْ حِسَابِ الْخَلَائِقِ ثُمَّ يُؤْمَرُ بِهِ إِلَى جَهَنَّمَ فَيُعَذَّبُ بِطَبَقَاتِهَا طَبَقَةً طَبَقَةً حَتَّى يُرَدَّ إِلَى أَسْفَلِهَا وَ لَا يَخْرُجُ مِنْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abu Bakr Al Hazramy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>asws</sup> said: ‘The one who copulates with the boys would come sexually impure on the Day of Judgement, the water of the world not having purified him, and Allah<sup>azwj</sup> would be Wrathful upon him, and would Curse him, and Prepare Hell for him, and it is an evil destination’. ",
            "Then he<sup>asws</sup> said: ‘When the man rides upon the man, so the Throne trembles due to that, and if the man is come to in his hole, so Allah<sup>azwj</sup> would Reckon him upon a bridge of Hell until He<sup>azwj</sup> is Free from the Reckoning of the people.Then He<sup>azwj</sup> would Command with him to be taken to the Hell, so he would be Punished with its Layers, Layer after Layer until he is returned to its lowest, and he would not come out from it’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from abu Bakr al-Hadramiy who has said the following: Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘One who engages in sexual intercourse with a boy, on the Day of Judgment will rise with the filth of such act and water of the world does not clean him, Allah becomes angry with him and condemns him, prepares hell for him and it is an evil destination.’ He (the Imam) said, ‘If a male engages in sexual intercourse with another male, Allah’s throne trembles because of it. A man who allows anal sexual intercourse will be held byAllah on the bridge over the hell until He will complete the accounts of the creatures: then He will command to send him to hell in the levels of which he will suffer one after the other until he arrives in the lowest level from which he cannot come out.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/390)"
        ],
        "index": 10220,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:186:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) اللِّوَاطُ مَا دُونَ الدُّبُرِ وَ الدُّبُرُ هُوَ الْكُفْرُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘The sodomy is what is less than the (entering the) behind, and the (entering the) behind, it is the blasphemy’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from af-Nawfafiy from af-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin has said, ‘Homosexuality is other than anal sex, anal sex is disbelief.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/390)"
        ],
        "index": 10221,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:186:4",
        "relations": {
          "Mentions": [
            "/books/quran:7:80"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي قَوْمِ لُوطٍ ( عليه السلام ) إِنَّكُمْ لَتَأْتُونَ الْفاحِشَةَ ما سَبَقَكُمْ بِها مِنْ أَحَدٍ مِنَ الْعالَمِينَ فَقَالَ إِنَّ إِبْلِيسَ أَتَاهُمْ فِي صُورَةٍ حَسَنَةٍ فِيهِ تَأْنِيثٌ عَلَيْهِ ثِيَابٌ حَسَنَةٌ فَجَاءَ إِلَى شَبَابٍ مِنْهُمْ فَأَمَرَهُمْ أَنْ يَقَعُوا بِهِ فَلَوْ طَلَبَ إِلَيْهِمْ أَنْ يَقَعَ بِهِمْ لَأَبَوْا عَلَيْهِ وَ لَكِنْ طَلَبَ إِلَيْهِمْ أَنْ يَقَعُوا بِهِ فَلَمَّا وَقَعُوا بِهِ الْتَذُّوهُ ثُمَّ ذَهَبَ عَنْهُمْ وَ تَرَكَهُمْ فَأَحَالَ بَعْضَهُمْ عَلَى بَعْضٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Aban Bin Usman, from Abu Baseer, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) regarding the people of Lut<sup>as</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:7#h80\">[7:80]</a> You are commiting an indecency, which no one in the worlds has done before you?</span> So he<sup>asws</sup> said: ‘Iblees<sup>la</sup> came to them in an image of beauty wherein was femininity, upon him<sup>la</sup> were beautiful clothes. So he<sup>la</sup> came over to the youths from them and instructed them that they should fall upon him<sup>la</sup>. Had he<sup>la</sup> sought to them that he<sup>la</sup> should fall upon them, they would have refused to him<sup>la</sup>, but he<sup>la</sup> sought to them that they should shall upon him<sup>la</sup>. So when they did it, they attained pleasure. Then he<sup>la</sup> went away from them and left them, so they fell upon each other’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from Ahmad ibn Muhammad from ibn abu Nasr from Aban bin ‘Uthman from abu Basir who has said the following: “One of the two Imam, (abu Ja’far or abu ‘Abd Allah), ‘Alayhim al-Salam, has said, ‘In the case of the people of Lot mentioned in the Quran: “You engage in such indecent acts in which no one of the people of the world before had ever engaged,”’ He (the Imam) said, ‘Iblis (Satan) came to them in the form of a good looking person with femininity, with good looking clothes and he came to their young ones and asked them to have sex in his anus. Had he asked them to allow him have sex in their anus they would refuse but he did the opposite and when they did as he wanted them to do they enjoyed it. He went away and left them to engage in such indecent act with each other.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/390)"
        ],
        "index": 10222,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:186:5",
        "relations": {
          "Mentions": [
            "/books/quran:11:81",
            "/books/quran:11:83",
            "/books/quran:11:80",
            "/books/quran:15:68"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ سَعِيدٍ قَالَ أَخْبَرَنِي زَكَرِيَّا بْنُ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ عَمْرٍو عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كَانَ قَوْمُ لُوطٍ مِنْ أَفْضَلِ قَوْمٍ خَلَقَهُمُ اللَّهُ فَطَلَبَهُمْ إِبْلِيسُ الطَّلَبَ الشَّدِيدَ وَ كَانَ مِنْ فَضْلِهِمْ وَ خِيَرَتِهِمْ أَنَّهُمْ إِذَا خَرَجُوا إِلَى الْعَمَلِ خَرَجُوا بِأَجْمَعِهِمْ وَ تَبْقَى النِّسَاءُ خَلْفَهُمْ فَلَمْ يَزَلْ إِبْلِيسُ يَعْتَادُهُمْ فَكَانُوا إِذَا رَجَعُوا خَرَّبَ إِبْلِيسُ مَا يَعْمَلُونَ فَقَالَ بَعْضُهُمْ لِبَعْضٍ تَعَالَوْا نَرْصُدْ هَذَا الَّذِي يُخَرِّبُ مَتَاعَنَا فَرَصَدُوهُ فَإِذَا هُوَ غُلَامٌ أَحْسَنُ مَا يَكُونُ مِنَ الْغِلْمَانِ فَقَالُوا لَهُ أَنْتَ الَّذِي تُخَرِّبُ مَتَاعَنَا مَرَّةً بَعْدَ مَرَّةٍ",
          "فَاجْتَمَعَ رَأْيُهُمْ عَلَى أَنْ يَقْتُلُوهُ فَبَيَّتُوهُ عِنْدَ رَجُلٍ فَلَمَّا كَانَ اللَّيْلُ صَاحَ فَقَالَ لَهُ مَا لَكَ فَقَالَ كَانَ أَبِي يُنَوِّمُنِي عَلَى بَطْنِهِ فَقَالَ لَهُ تَعَالَ فَنَمْ عَلَى بَطْنِي قَالَ فَلَمْ يَزَلْ يَدْلُكُ الرَّجُلَ حَتَّى عَلَّمَهُ أَنَّهُ يَفْعَلُ بِنَفْسِهِ فَأَوَّلًا عَلَّمَهُ إِبْلِيسُ وَ الثَّانِيَةَ عَلَّمَهُ هُوَ ثُمَّ انْسَلَّ فَفَرَّ مِنْهُمْ",
          "وَ أَصْبَحُوا فَجَعَلَ الرَّجُلُ يُخْبِرُ بِمَا فَعَلَ بِالْغُلَامِ وَ يُعَجِّبُهُمْ مِنْهُ وَ هُمْ لَا يَعْرِفُونَهُ فَوَضَعُوا أَيْدِيَهُمْ فِيهِ حَتَّى اكْتَفَى الرِّجَالُ بِالرِّجَالِ بَعْضُهُمْ بِبَعْضٍ ثُمَّ جَعَلُوا يَرْصُدُونَ مَارَّةَ الطَّرِيقِ فَيَفْعَلُونَ بِهِمْ حَتَّى تَنَكَّبَ مَدِينَتَهُمُ النَّاسُ ثُمَّ تَرَكُوا نِسَاءَهُمْ وَ أَقْبَلُوا عَلَى الْغِلْمَانِ",
          "فَلَمَّا رَأَى أَنَّهُ قَدْ أَحْكَمَ أَمْرَهُ فِي الرِّجَالِ جَاءَ إِلَى النِّسَاءِ فَصَيَّرَ نَفْسَهُ امْرَأَةً فَقَالَ إِنَّ رِجَالَكُنَّ يَفْعَلُ بَعْضُهُمْ بِبَعْضٍ قَالُوا نَعَمْ قَدْ رَأَيْنَا ذَلِكَ وَ كُلَّ ذَلِكَ يَعِظُهُمْ لُوطٌ وَ يُوصِيهِمْ وَ إِبْلِيسُ يُغْوِيهِمْ حَتَّى اسْتَغْنَى النِّسَاءُ بِالنِّسَاءِ",
          "فَلَمَّا كَمَلَتْ عَلَيْهِمُ الْحُجَّةُ بَعَثَ اللَّهُ جَبْرَئِيلَ وَ مِيكَائِيلَ وَ إِسْرَافِيلَ ( عليهم السلام ) فِي زِيِّ غِلْمَانٍ عَلَيْهِمْ أَقْبِيَةٌ فَمَرُّوا بِلُوطٍ وَ هُوَ يَحْرُثُ فَقَالَ أَيْنَ تُرِيدُونَ مَا رَأَيْتُ أَجْمَلَ مِنْكُمْ قَطُّ قَالُوا إِنَّا أَرْسَلَنَا سَيِّدُنَا إِلَى رَبِّ هَذِهِ الْمَدِينَةِ قَالَ أَ وَ لَمْ يَبْلُغْ سَيِّدَكُمْ مَا يَفْعَلُ أَهْلُ هَذِهِ الْمَدِينَةِ يَا بَنِيَّ إِنَّهُمْ وَ اللَّهِ يَأْخُذُونَ الرِّجَالَ فَيَفْعَلُونَ بِهِمْ حَتَّى يَخْرُجَ الدَّمُ فَقَالُوا أَمَرَنَا سَيِّدُنَا أَنْ نَمُرَّ وَسَطَهَا قَالَ فَلِي إِلَيْكُمْ حَاجَةٌ قَالُوا وَ مَا هِيَ قَالَ تَصْبِرُونَ هَاهُنَا إِلَى اخْتِلَاطِ الظَّلَامِ",
          "قَالَ فَجَلَسُوا قَالَ فَبَعَثَ ابْنَتَهُ فَقَالَ جِيئِي لَهُمْ بِخُبْزٍ وَ جِيئِي لَهُمْ بِمَاءٍ فِي الْقُرْعَةِ وَ جِيئِي لَهُمْ عَبَاءً يَتَغَطَّوْنَ بِهَا مِنَ الْبَرْدِ فَلَمَّا أَنْ ذَهَبَتِ الِابْنَةُ أَقْبَلَ الْمَطَرُ وَ الْوَادِي فَقَالَ لُوطٌ السَّاعَةَ يَذْهَبُ بِالصِّبْيَانِ الْوَادِي قُومُوا حَتَّى نَمْضِيَ وَ جَعَلَ لُوطٌ يَمْشِي فِي أَصْلِ الْحَائِطِ وَ جَعَلَ جَبْرَئِيلُ وَ مِيكَائِيلُ وَ إِسْرَافِيلُ يَمْشُونَ وَسَطَ الطَّرِيقِ فَقَالَ يَا بَنِيَّ امْشُوا هَاهُنَا فَقَالُوا أَمَرَنَا سَيِّدُنَا أَنْ نَمُرَّ فِي وَسَطِهَا وَ كَانَ لُوطٌ يَسْتَغْنِمُ الظَّلَامَ",
          "وَ مَرَّ إِبْلِيسُ فَأَخَذَ مِنْ حِجْرِ امْرَأَةٍ صَبِيّاً فَطَرَحَهُ فِي الْبِئْرِ فَتَصَايَحَ أَهْلُ الْمَدِينَةِ كُلُّهُمْ عَلَى بَابِ لُوطٍ فَلَمَّا أَنْ نَظَرُوا إِلَى الْغِلْمَانِ فِي مَنْزِلِ لُوطٍ قَالُوا يَا لُوطُ قَدْ دَخَلْتَ فِي عَمَلِنَا فَقَالَ هَؤُلَاءِ ضَيْفِي فَلَا تَفْضَحُونِ فِي ضَيْفِي قَالُوا هُمْ ثَلَاثَةٌ خُذْ وَاحِداً وَ أَعْطِنَا اثْنَيْنِ",
          "قَالَ فَأَدْخَلَهُمُ الْحُجْرَةَ وَ قَالَ لَوْ أَنَّ لِي أَهْلَ بَيْتٍ يَمْنَعُونِّي مِنْكُمْ قَالَ وَ تَدَافَعُوا عَلَى الْبَابِ وَ كَسَرُوا بَابَ لُوطٍ وَ طَرَحُوا لُوطاً فَقَالَ لَهُ جَبْرَئِيلُ إِنَّا رُسُلُ رَبِّكَ لَنْ يَصِلُوا إِلَيْكَ فَأَخَذَ كَفّاً مِنْ بَطْحَاءَ فَضَرَبَ بِهَا وُجُوهَهُمْ وَ قَالَ شَاهَتِ الْوُجُوهُ فَعَمِيَ أَهْلُ الْمَدِينَةِ كُلُّهُمْ وَ قَالَ لَهُمْ لُوطٌ يَا رُسُلَ رَبِّي فَمَا أَمَرَكُمْ رَبِّي فِيهِمْ قَالُوا أَمَرَنَا أَنْ نَأْخُذَهُمْ بِالسَّحَرِ",
          "قَالَ فَلِي إِلَيْكُمْ حَاجَةٌ قَالُوا وَ مَا حَاجَتُكَ قَالَ تَأْخُذُونَهُمُ السَّاعَةَ فَإِنِّي أَخَافُ أَنْ يَبْدُوَ لِرَبِّي فِيهِمْ فَقَالُوا يَا لُوطُ إِنَّ مَوْعِدَهُمُ الصُّبْحُ أَ لَيْسَ الصُّبْحُ بِقَرِيبٍ لِمَنْ يُرِيدُ أَنْ يَأْخُذَ فَخُذْ أَنْتَ بَنَاتِكَ وَ امْضِ وَ دَعِ امْرَأَتَكَ",
          "فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) رَحِمَ اللَّهُ لُوطاً لَوْ يَدْرِي مَنْ مَعَهُ فِي الْحُجْرَةِ لَعَلِمَ أَنَّهُ مَنْصُورٌ حَيْثُ يَقُولُ لَوْ أَنَّ لِي بِكُمْ قُوَّةً أَوْ آوِي إِلى رُكْنٍ شَدِيدٍ أَيُّ رُكْنٍ أَشَدُّ مِنْ جَبْرَئِيلَ مَعَهُ فِي الْحُجْرَةِ",
          "فَقَالَ اللَّهُ عَزَّ وَ جَلَّ لِمُحَمَّدٍ ( صلى الله عليه وآله ) وَ ما هِيَ مِنَ الظَّالِمِينَ بِبَعِيدٍ مِنْ ظَالِمِي أُمَّتِكَ إِنْ عَمِلُوا مَا عَمِلَ قَوْمُ لُوطٍ قَالَ وَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ أَلَحَّ فِي وَطْيِ الرِّجَالِ لَمْ يَمُتْ حَتَّى يَدْعُوَ الرِّجَالَ إِلَى نَفْسِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Saeed who said, ‘Zakariyya Bin Muhammad informed me, from his father, from Amro, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The people of Lut<sup>as</sup> were from the best of the people Created by Allah<sup>azwj</sup>. So Iblees<sup>la</sup> sought them with an intense seeking, and from their merits and their goodness was that whenever they went to the work, they went out altogether, and the women would remain behind them. So Iblees<sup>la</sup> would not cease to transgress them, So when they would return, Iblees<sup>la</sup> would have spoil whatever they had worked. So some of them said to the others, ‘Come, let us observe this one who is spoiling our provisions. So they observed, and there was a boy as good looking as can be from the boys. So they said to him, ‘You are the one who is spoiling our provisions time after time’.",
            "So they formed a consensus upon killing him. So they lodged him for the night with a man. So when it was the night, he shrieked. So the man said, ‘What is the matter with you?’ So he said, ‘My father used to sleep me upon his belly’. So he said to him, ‘Come, so sleep upon my belly’. So he did not cease to massage the man until he taught him that he should do it with himself. Thus the first one to do it was Iblees<sup>la</sup>, and the second one to do it was him. Then he crept away and fled from them.",
            "And the morning came, so the man went over informing with what he had done with the boy and he astounded them from it, and they were not understanding it. So they placed their hands in it, indulging in it, until the men sufficed themselves with the men, with each other. Then they went on looking out for the passers by on the road, so they would be doing it with them until they had plagued the people of their cities. Then they neglected their women and faced towards the boys.",
            "So when he<sup>la</sup> saw that his<sup>la</sup> matter had prevailed among the men, he<sup>la</sup> went to the women. So he<sup>la</sup> changed himself<sup>la</sup> into a woman, so he<sup>la</sup> said, ‘Your men are doing it to each other’. They said, ‘Yes, we have seen that’. And everytime Lut<sup>as</sup> advised them, Iblees<sup>la</sup> would stray them until the women sufficed themselves with the women.  ",
            "So when the argument was completed upon them, Allah<sup>azwj</sup> Sent Jibraeel<sup>as</sup> and Mikaeel<sup>as</sup>, and Israfeel<sup>as</sup> in the form of boys wearing gowns. So they<sup>as</sup> passed by Lut<sup>as</sup> and he<sup>as</sup> was farming, so he<sup>as</sup> said: ‘Where are you<sup>as</sup> intending to go. I<sup>as</sup> have not seen anyone more good-looking than you<sup>as</sup>’. They<sup>as</sup> said, ‘Our<sup>as</sup> Master<sup>azwj</sup> has Sent us<sup>as</sup> to the lord of this city’. He<sup>as</sup> said: ‘Has it not reached your<sup>as</sup> Master<sup>azwj</sup> of what the people of this city are doing? O my<sup>as</sup> sons! By Allah<sup>azwj</sup>, they are taking to the men, so they are doing it with them until the blood comes out’. Our<sup>as</sup> Master<sup>azwj</sup> has Commanded us<sup>as</sup> that we<sup>as</sup> pass through the middle of it’. He<sup>as</sup> said: ‘There is a need of mine<sup>as</sup> to you<sup>as</sup>’. They said, ‘And what is it?’ He<sup>as</sup> said: ‘Await over here until the crossing over of the darkness’. ",
            "He<sup>asws</sup> said: ‘So they were seated. So he<sup>as</sup> sent for his<sup>as</sup> daughter saying, ‘Come to me with some bread for them, and come to me with some water for them in the gourd, and come to me with a cloak for them to cover themselves with from the cold’. So when the daughter went, and they faced the rain and the valley. So Lut<sup>as</sup> said: ‘(This is) the time they go with the young boys of the valley. Arise until we pass by’, and Lut<sup>as</sup> went on to walk in the base of the wall, and Jibraeel<sup>as</sup> and Mikaeel<sup>as</sup> and Israfeel<sup>as</sup> were walking in the middle of the road. So he<sup>as</sup> said: ‘O my<sup>as</sup> sons, walk over here’. So they<sup>as</sup> said: ‘Our<sup>as</sup> Master<sup>azwj</sup> has Commanded us<sup>as</sup> to walk in the middle of it’. And Lut<sup>as</sup> wanted to benefit from the darkness.",
            "And Iblees<sup>la</sup> passed by and seized a child from the lap of a woman and dropped it in the well. So the people of the city gathered, all of them at the door of Lut<sup>as</sup>. So when they looked at the boys in the house of Lut<sup>as</sup>, they said, ‘O Lut<sup>as</sup>! You<sup>as</sup> have (also) entered into our deeds’. So he<sup>as</sup> said: ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:15#h68\">[15:68]</a> He said: Surely these are my guests, therefore do not disgrace me</span> regarding my<sup>as</sup> guests’. They said, ‘They are three of them, so take one and give us two’.",
            "He<sup>asws</sup> said: ‘So he<sup>as</sup> entered them into the chamber and said, ‘If there was a family for me<sup>as</sup>, they would have defended me<sup>as</sup> from you all’. He<sup>asws</sup> said: ‘And they shoved upon the door and broke the door of Lut<sup>as</sup>, and floored Lut<sup>as</sup>. So Jibraeel<sup>as</sup> said to him<sup>as</sup>: ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:11#h81\">[11:81]</a> We are the Messengers of your Lord; they will never be able to reach you</span>’, So he<sup>as</sup> took a handful of soil from Bat’ha and sturk their faces with it, and said: ‘The faces be ugly!’ So the people of the city became blind, all of them, and Lut<sup>as</sup> said to them<sup>as</sup>: ‘O messengers of my<sup>as</sup> Lord<sup>azwj</sup>! So what did my<sup>as</sup> Lord<sup>azwj</sup> Command you<sup>as</sup> with regarding them?’ They said, ‘He<sup>azwj</sup> Commanded us<sup>asws</sup> that we<sup>as</sup> should seize them at dawn’. ",
            "He<sup>as</sup> said: ‘There is a need of mine<sup>as</sup> to you all<sup>as</sup>’. They said, ‘And what is your<sup>as</sup> need’. He<sup>as</sup> said: ‘Seize them at this time, for I<sup>as</sup> fear that my<sup>as</sup> Lord<sup>azwj</sup> may Change (His<sup>azwj</sup> Command) regarding them’. So they said: ‘O Lut<sup>as</sup>! <span class=\"ibTxt\"><a href=\"/#/books/quran:11#h81\">[11:81]</a> surely their appointed time is the morning; is not the morning near </span>for the one whom He<sup>azwj</sup> Intends to Seize? Take your<sup>as</sup> daughters but leave your<sup>as</sup> wife (as she will be among those who will be punished)’.",
            "So Abu Ja’far<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> have Mercy on Lut<sup>as</sup>. Had he<sup>as</sup> known the ones who were with him<sup>as</sup> in the chamber, he<sup>as</sup> would have known that he<sup>as</sup> is Supported, where he<sup>as</sup> was saying <span class=\"ibTxt\"><a href=\"/#/books/quran:11#h80\">[11:80]</a> He said: Ah! If only I had power to suppress you, rather I shall have recourse to a strong support</span>’ i.e., strong recourse from Jibraeel<sup>as</sup> with him<sup>as</sup> in the chamber. ",
            "So Allah<sup>azwj</sup> Mighty and Majestic Said to Muhammad<sup>asws</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:11#h83\">[11:83]</a> and it is not far off from the unjust</span> from the unjust ones of your<sup>as</sup> community that they should known what the people of Lut<sup>as</sup> did. And Rasool-Allah<sup>asws</sup> said: ‘The one who persists in copulating with the men will not died until he invites the men to himself’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Muhammad ibn Sa‘id who has said, that informed me Zakariya ibn Muhammad from his father from ‘Amr who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘People of Lot were of the excellent people Allah had created. Iblis persuaded them very intensely. Due to their excellent manners, they would go to work together in groups and leave women behind at home. Iblis (Satan) would come to them every day and in their absence Iblis (Satan) would destroy their work accomplished in a day. One of them suggested keeping watch and seeing who destroys their work accomplished. They remained on their guard and found him out to be a very good looking boy. They said, ‘So it is you who destroys our work every time.’ They decided to kill him. They left him with a man for the night. During the night he cried and the man asked, ’What is the matter?’ He replied, ‘My father would allow me to sleep on his belly.’ The man said, ‘Fine, come and sleep on my belly.’ He (the boy) began to mb the man until he taught him how to engage in anal sexual intercourse with him. The first to teach the indecent act was Iblis (Satan) and the second was this man. He then ran away and in the morning the man told everyone about what he had experienced with the boy and they liked it. They did not know it (the indecent act) before. They learned it and man began to practice the indecent act with another man. Thereafter, they even ambushed by-passers and engaged with them in the indecent act until their city failed the people. They neglected their women and turned to young boys. When he, Iblis (Satan), found out that his plan has worked and it has become strong among men he then turned to women in the form of a woman and said, ‘Your men engage in sexual intercourse with each other.’ They replied, ‘Yes, we know it.’ Lot all the time preached to them against it and Iblis (Satan) deceived them until women totally turned to women and men turned to men for sexual satisfaction. When Allah’s point was established against them He sent Jibril, Michael and Israfil (three angels) in the form of young boys wearing gowns. They passed by Lot who was tilling the land. He asked, ‘Where do you want to go? I have never seen any boys more beautiful than you.’ They replied, ‘Our master has sent us to the chief of this city.’ He then asked, ‘Is your master not informed that the people of this city commit indecent acts? O my sons, they by Allah take men and engage in anal sexual intercourse with them until they make them bleed.’ They said, ‘Our master has commanded us to pass through their middle.’ He then said, ‘I have one wish before you.’ They asked, ‘What is your wish?’ He replied, ‘You wait here until it is dark.’ He (the Imam) said, ‘They waited.’ He (the Imam) said, ‘He sent his daughter to bring them bread, water in a water-sack, and a gown for cover against cold. When his daughter went rain came in the valley and Lot said that now flood washes away the children thus, (you must) get up so we can move away to seek shelter of the wall. So Jibril, Michael and Israfil began to walk in the middle of the road. He said, ‘Children, walk here.’ They replied, ‘Our master has commanded us to walk in their middle.’ Lot was trying to benefit from the darkness. Iblis (Satan) took a child from the arms of a woman and threw him in a well and all people of the city came at the door of Lot for help. When they saw the young boys in his home they said, ‘O Lot, this proves that you also do what we do’ He said, ‘They are my guests so you must not disgrace me about my guests.’ They said, ‘There are three of them. Take one and give two of them to us.’ He (the Imam) said, ‘He took them inside a room and said, ‘I wish I had a family to defend me against you.’ He (the Imam) said, ‘The crowd began to press at the door, broke through the door of Lot and flattened Lot on the ground. Jibril said, ‘We are the messengers of your Lord and they cannot reach you.’ He took a handful of soil from Batha’ and threw it against their faces and said, ‘Ugly faces.’ All people of the city became blind.’ Lot said, ‘O messengers of my Lord, what has my Lord commanded you to do about them?’ They replied, ‘He has commanded us to seize them in the morning.’ He said, ‘I have one wish before you.’ They asked, ‘What is your wish?’ He replied, ‘I request you to seize them now because I am afraid bada’ (change of plan) may take place with my Lord.’ They said, ‘O Lot, the appointed time for them is the morning, is not the morning very near, for one who wants to seize them? Take your daughters and move away but depart your wife.’” “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘May Allah grant mercy to Lot! If he knew who were with him in the room he would become certain of his victory when he said, ‘I wish I had power against you or a strong support’, what kind of support is stronger than Jibril who was in the room with him? Allah, most Majestic, most Glorious, said, to Muhammad, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, “ . . . from the unjust it is not far away,” from the unjust ones in your followers if they do what people of Lot did.’ He (the Imam) said that the Messenger of Allah has said, ‘One who insists in engaging for anal sexual intercourse with men will not die before calling men to engage in anal sexual intercourse with him.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/392)"
        ],
        "index": 10223,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:186:6",
        "relations": {
          "Mentions": [
            "/books/quran:29:32",
            "/books/quran:11:70",
            "/books/quran:11:71"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ فَضَّالٍ عَنْ دَاوُدَ بْنِ فَرْقَدٍ عَنْ أَبِي يَزِيدَ الْحَمَّارِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ بَعَثَ أَرْبَعَةَ أَمْلَاكٍ فِي إِهْلَاكِ قَوْمِ لُوطٍ جَبْرَئِيلَ وَ مِيكَائِيلَ وَ إِسْرَافِيلَ وَ كَرُوبِيلَ فَمَرُّوا بِإِبْرَاهِيمَ ( عليه السلام ) وَ هُمْ مُعْتَمُّونَ فَسَلَّمُوا عَلَيْهِ فَلَمْ يَعْرِفْهُمْ وَ رَأَى هَيْئَةً حَسَنَةً فَقَالَ لَا يَخْدُمُ هَؤُلَاءِ إِلَّا أَنَا بِنَفْسِي وَ كَانَ صَاحِبَ ضِيَافَةٍ",
          "فَشَوَى لَهُمْ عِجْلًا سَمِيناً حَتَّى أَنْضَجَهُ ثُمَّ قَرَّبَهُ إِلَيْهِمْ فَلَمَّا وَضَعَهُ بَيْنَ أَيْدِيهِمْ رَأى أَيْدِيَهُمْ لا تَصِلُ إِلَيْهِ نَكِرَهُمْ وَ أَوْجَسَ مِنْهُمْ خِيفَةً فَلَمَّا رَأَى ذَلِكَ جَبْرَئِيلُ حَسَرَ الْعِمَامَةَ عَنْ وَجْهِهِ فَعَرَفَهُ إِبْرَاهِيمُ فَقَالَ أَنْتَ هُوَ قَالَ نَعَمْ وَ مَرَّتْ سَارَةُ امْرَأَتُهُ فَبَشَّرَهَا بِإِسْحَاقَ وَ مِنْ وَرَاءِ إِسْحَاقَ يَعْقُوبَ فَقَالَتْ مَا قَالَ اللَّهُ عَزَّ وَ جَلَّ فَأَجَابُوهَا بِمَا فِي الْكِتَابِ ",
          "فَقَالَ لَهُمْ إِبْرَاهِيمُ لِمَا ذَا جِئْتُمْ قَالُوا فِي إِهْلَاكِ قَوْمِ لُوطٍ فَقَالَ لَهُمْ إِنْ كَانَ فِيهِمْ مِائَةٌ مِنَ الْمُؤْمِنِينَ أَ تُهْلِكُونَهُمْ فَقَالَ جَبْرَئِيلُ لَا قَالَ فَإِنْ كَانَ فِيهَا خَمْسُونَ قَالَ لَا قَالَ فَإِنْ كَانَ فِيهَا ثَلَاثُونَ قَالَ لَا قَالَ فَإِنْ كَانَ فِيهَا عِشْرُونَ قَالَ لَا قَالَ فَإِنْ كَانَ فِيهَا عَشَرَةٌ قَالَ لَا قَالَ فَإِنْ كَانَ فِيهَا خَمْسَةٌ قَالَ لَا قَالَ فَإِنْ كَانَ فِيهَا وَاحِدٌ قَالَ لَا قَالَ فَإِنَّ فِيها لُوطاً قالُوا نَحْنُ أَعْلَمُ بِمَنْ فِيها لَنُنَجِّيَنَّهُ وَ أَهْلَهُ إِلَّا امْرَأَتَهُ كانَتْ مِنَ الْغابِرِينَ"
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Fazzal, from Dawood Bin Farqad, from Abu Yazeed Al Hammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Sent four Angels regarding the destruction of the people of Lut<sup>as</sup> – Jibraeel<sup>as</sup>, and Mikaeel<sup>as</sup>, and Israfeel<sup>as</sup>, and Karoubil<sup>as</sup>. So they<sup>as</sup> passed by Ibrahim<sup>as</sup> and they were wearing turbans. So they<sup>as</sup> greeted him<sup>as</sup>, but he<sup>as</sup> did not recognise them<sup>as</sup>, and he<sup>as</sup> saw them of good physical build. So he<sup>as</sup> said: ‘None shall serve them except I<sup>asws</sup> myself<sup>as</sup>’; and he<sup>as</sup> was a frequented with guests. ",
            "So he roasted a fat calf for them<sup>as</sup> until it was cooked, then he placed it near to them<sup>as</sup>. So when it was placed in front of them<sup>as</sup>, <span class=\"ibTxt\"><a href=\"/#/books/quran:11#h70\">[11:70]</a> he saw that their hands were not extended towards it, he deemed them strange and conceived fear of them</span>. So when Jibraeel<sup>as</sup> saw that, he<sup>as</sup> removed the turban from his<sup>as</sup> face, and Ibrahim<sup>as</sup> recognised him<sup>as</sup>, so he<sup>as</sup> said: ‘You<sup>as</sup> are him<sup>as</sup>!’ He<sup>as</sup> said: ‘Yes’. And Sarah<sup>as</sup>, his<sup>as</sup> wife, passed by <span class=\"ibTxt\"><a href=\"/#/books/quran:11#h71\">[11:71]</a> then We Gave her the good news of Is’haq and after Is’haq of Yaqoub</span>. So she<sup>as</sup> said what Allah<sup>azwj</sup> Mighty and Majestic Said. So they<sup>as</sup> answered her<sup>as</sup> with what is in the Book (Quran).",
            "So Ibrahim<sup>as</sup> said to them<sup>as</sup>: ‘What is that you<sup>as</sup> have come for?’ They<sup>as</sup> said: ‘Regarding the destruction of the people of Lut<sup>as</sup>’. So he<sup>as</sup> said: ‘Supposing there are one hundred among them from the Believers, would you<sup>as</sup> destroy them?’ So Jibraeel<sup>as</sup> said: ‘No’. He<sup>as</sup> said: ‘Supposing there were fifty among them?’ He<sup>as</sup> said: ‘No’. He<sup>as</sup> said: ‘Supposing there were thirty among them?’ He<sup>as</sup> said: ‘No’. He<sup>as</sup> said: ‘Supposing there were twenty among them?’ He<sup>as</sup>: ‘No’. He<sup>as</sup> said: ‘Supposing there were ten among them?’ He<sup>as</sup> said: ‘No’. He<sup>as</sup> said: ‘Supposing there were five among them?’ He<sup>as</sup> Said: ‘No’. He<sup>as</sup> said: ‘Supposing there was one among them?’ He<sup>as</sup> said: ‘No’. <span class=\"ibTxt\"><a href=\"/#/books/quran:29#h32\">[29:32]</a> He said: Surely in it is Lut. They said: We know very well who is in it; we shall rescue him and his followers, except for his wife; she shall be of those who remain behind</span>’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ibn Faddal from Dawud ibn Farqad from Abu Yazid al- Hammar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Allah, most Majestic, most Glorious, sent four angels for the destruction of the people of Lot: Jibril, Michael, Israfil and Karubil. They visited Ibrahim ‘Alayhi al-Salam wearing turbans on them. They offered him Salam (the phrase of offering greeting of peace) but he could not recognize them, and he found them in a very good appearance and said, ‘No one will serve them other than myself.’ Ibrahim liked serving guests very much; so he prepared for them and roasted a very meaty calf. When it was ready, he served them and brought it for them, ‘He saw that their hands do not reach the food: he could not recognize them and he began to feel afraid of them’ but when Jibril noticed he removed the turban from his face and he (Ibrahim) recognized him and asked, ‘Are you he (jibril)?’ He replied, ‘Yes, I am he.’ His wife Sarah, passed by and he gave her the good news of the birth of Ishaq (Isaac) who will be succeeded by Ya’qub. She asked, ‘What has Allah, most Majestic, most Glorious, said?’ They answered her by what the Quran has said. Ibrahim then asked, ‘What for have you come?’ They replied, ‘We have come for the destruction of the people of Lot.’ Ibrahim then asked, ‘Will you destroy them even if there are one hundred believing people among them?’ Jibril replied, ‘No, we will not do so.’ Ibrahim asked, ‘Will you destroy them if there are fifty believing people among them?’ Jibril replied, ‘No, we will not do so.’ He then asked, ‘Will you destroy them if there are thirty believing people among them?’ Jibril replied, ‘No, we will not do so.’ Ibrahim then asked, ‘Will you destroy them if there are twenty believing people among them?’ He replied, ‘No, we will not do so.’ He then asked, ‘Will you destroy them if there are ten believing people among them?’ He replied, ‘No, we will not do so.’ He then asked, ‘Will you destroy them if there are five people among them?’ He replied, ‘No, we will not do so.’ He then asked, ‘Will you destroy if there is one believing person among them?’ he replied, ‘No, we will not do so.’ Ibrahim then said, ‘But Lot is there among them.’ They replied, ‘We know more about who is there. We will save him and his family, except his wife, who will be of those who remain behind.’ “Al-Hassan ibn Ali has said, ‘What I know of the story is that Ibrahim tried to save them as it is mentioned in the words of Allah, most Majestic, most Glorious, ‘He argued with us about the people of Lot.’ They (angels) came to Lot when he was in a farm near the town. They offered him Salam (the phrase of offering greeting of peace) and they were wearing turbans. When he saw their good appearance in white dresses and white turbans he asked, ‘Do you want the house?’ They replied, ‘Yes, we want the house.’ He led them and they walked behind him. He then regretted to offer them the house and said, ‘What is it that I have done? I am bringing them to a people whom I know how they are.’ He turned back to them and said, ‘You are coming to the wicked creatures of Allah.’ Jibril said, ‘We are not in a hurry about them until he testifies against them three times’ and he said, ‘This is one.’ He then walked for an hour then turned back to them and said, ‘You are coming to the wicked creatures of Allah.’ Jibril said, ‘These are two testimonies.’ He then walked and when he arrived in the city he turned to them and said, ‘You are coming to the wicked creatures of Allah.’ Jibril said, ‘This is the third testimony.’ He entered and they entered with him until they entered his house. When his wife saw them in good appearance she climbed on the roof and clapped which they did not hear. She then started a fire and when they saw the smoke they came to the door running until they reached at the door and she came down to them and said, ‘There are people with him the like of whom I have never seen in beauty and good appearance.’ They came to the door to enter. When Lot saw them he stood up in front of them and said to them, ‘O my people, have fear of Allah and do not humiliate me before my guests. Is there no man of reason among you?’ He then said, ’These are my daughters and they are more clean for you’; he called them to the lawful matter.’ They said, ‘We have no right on your daughters and you know what we want.’ He said to them, ‘I wish I had enough power against you or a strong support’. Jibril then said, ‘I wish he knew what kind of power he had with him?’ He (the Imam) said, ‘They overwhelmed him and entered the house. Jibril called them aloud to halt and he said, ‘O Lot, allow them to come in. When they came in Jibril pointed his finger to them and they all turned blind as it is mentioned in the words of Allah, most Majestic, most Glorious, ‘We turned their eyes blind.’ Jibril called him and told him, ‘I am the messenger of your Lord. Their hands will not reach you. Move with your family during a part of the night.’ Jibril then said, ‘We are sent to destroy them.’ He said, ‘O Jibril, do it quickly.’ Jibril said, ‘Their appointed time is in the morning, is the morning not near enough?’ He commanded him and those with him to move away except his wife. He then picked it-the city- with his wing with ten layers of the land, then raised it until those in the heaven above the earth could hear the barking of their dogs, and crowing of their rosters. He then turned it upside down and made it to rain down on it (city) and those around the city with stones of sijjil (baked clay).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/396)"
        ],
        "index": 10224,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:186:7",
        "relations": {
          "Mentions": [
            "/books/quran:11:78"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ أَبِي حَمْزَةَ عَنْ يَعْقُوبَ بْنِ شُعَيْبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ لُوطٍ ( عليه السلام ) هؤُلاءِ بَناتِي هُنَّ أَطْهَرُ لَكُمْ قَالَ عَرَضَ عَلَيْهِمُ التَّزْوِيجَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muhammad Bin Abu Hamza, from Yaqoub Bin Shuayb, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the words of Lut<sup>as</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:11#h78\">[11:78]</a> These are my daughters (nation’s daughters)- they are purer for you</span>. He<sup>asws</sup> said: ‘He<sup>as</sup> presented to them for the marriage’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Muhammad ibn abu Hamzah from Ya’qub bin Shu’ayb who has said the following: “About the words of Lot, ‘These are my daughters and they are cleaner and pure,’ <a href=\"/#/books/quran:11#h78\">[11:78]</a> abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘He offered them for marriage.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/396)"
        ],
        "index": 10225,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:186:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِيَّاكُمْ وَ أَوْلَادَ الْأَغْنِيَاءِ وَ الْمُلُوكِ الْمُرْدَ فَإِنَّ فِتْنَتَهُمْ أَشَدُّ مِنْ فِتْنَةِ الْعَذَارَى فِي خُدُورِهِنَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>asws</sup> said: ‘Beware of the children of the rich and the kings, the tyrants, for their strife is more intense than the strife of the virgins in their dens (private chambers)’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘You must remain on your guard against the children of the affluent people and the tyrant kings because their mischief is more intense than the mischief of the virgins in their private chambers.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/396)"
        ],
        "index": 10226,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:186:9",
        "relations": {
          "Mentions": [
            "/books/quran:11:83",
            "/books/quran:11:82",
            "/books/quran:11:78"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عُثْمَانَ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ مَيْمُونٍ الْبَانِ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقُرِئَ عِنْدَهُ آيَاتٌ مِنْ هُودٍ فَلَمَّا بَلَغَ وَ أَمْطَرْنا عَلَيْها حِجارَةً مِنْ سِجِّيلٍ مَنْضُودٍ مُسَوَّمَةً عِنْدَ رَبِّكَ وَ ما هِيَ مِنَ الظَّالِمِينَ بِبَعِيدٍ قَالَ فَقَالَ مَنْ مَاتَ مُصِرّاً عَلَى اللِّوَاطِ لَمْ يَمُتْ حَتَّى يَرْمِيَهُ اللَّهُ بِحَجَرٍ مِنْ تِلْكَ الْحِجَارَةِ تَكُونُ فِيهِ مَنِيَّتُهُ وَ لَا يَرَاهُ أَحَدٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Usman Bin Saeed, from Muhammad Bin Suleyman, from Maymoun Al Baan who said, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup>, so a Verse from (the Chapter) Hud was recited in his<sup>asws</sup> presence. So when it reached <span class=\"ibTxt\"><a href=\"/#/books/quran:11#h82\">[11:82]</a> and Rained down upon them stones of clay, of what had been decreed, one after another <a href=\"/#/books/quran:11#h83\">[11:83]</a> Marked (for Punishment) with your Lord and it is not far off from the unjust</span>, so he<sup>asws</sup> said: ‘The one who dies persisting upon Sodomy would not die until Allah<sup>azwj</sup> Pelts him with a stone from those stones in which his death takes place, but no one sees it’."
          ],
          "en.sarwar": [
            "9. Ali ibn Ibrahim has narrated from his father from ‘Uthman bin Sa‘id from Muhammad bin Sulayman from Maymun al-Ban who has said the following: “Once I was with abu ‘Abd Allah, ‘Alayhi al-Salam, when certain verses of Chapter 11 of the Quran were read, ‘. . . We rained down upon them piles of stones which were marked before your Lord and it is not far away from the unjust,’ <a href=\"/#/books/quran:11#h78\">[11:78]</a> he (the Imam) said, ‘Whoever dies insisting on engaging in anal sexual intercourse will not die until Allah shoots him with one of those stones by which his death takes place but no one sees it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالموثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/396)"
        ],
        "index": 10227,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:186:10",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ قَبَّلَ غُلَاماً مِنْ شَهْوَةٍ أَلْجَمَهُ اللَّهُ يَوْمَ الْقِيَامَةِ بِلِجَامٍ مِنْ نَارٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Yahya, from Talha Bin Zayd, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>asws</sup> said: ‘The one who kisses a boy out of lustful desire, Allah<sup>azwj</sup> would Bridle him on the Day of Juddgement with a bridle of Fire’."
          ],
          "en.sarwar": [
            "10. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Yahya from Talhah bin Zayd who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘One who kisses a boy with lust, Allah on the Day of Judgment will harness him with a harness of fire.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:3:186",
  "kind": "verse_list"
}