{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 191"
        },
        "path": "/books/al-kafi:5:3:191",
        "titles": {
          "ar": "بَابُ تَفْسِيرِ مَا يَحِلُّ مِنَ النِّكَاحِ وَ مَا يَحْرُمُ وَ الْفَرْقِ بَيْنَ النِّكَاحِ وَ السِّفَاحِ وَ الزِّنَى وَ هُوَ مِنْ كَلَامِ يُونُس‏",
          "en": "191. Explanation of Lawful and Unlawful Matters in Marriage, Indecency and Fornication"
        }
      }
    ],
    "index": 1562,
    "local_index": 191,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 192"
        },
        "path": "/books/al-kafi:5:3:192",
        "titles": {
          "ar": "باب",
          "en": "Chapter 187 – A Chapter"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 190"
        },
        "path": "/books/al-kafi:5:3:190",
        "titles": {
          "ar": "باب نَوَادِرَ",
          "en": "Chapter 190 – The Miscellaneous"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:3:191",
    "titles": {
      "ar": "بَابُ تَفْسِيرِ مَا يَحِلُّ مِنَ النِّكَاحِ وَ مَا يَحْرُمُ وَ الْفَرْقِ بَيْنَ النِّكَاحِ وَ السِّفَاحِ وَ الزِّنَى وَ هُوَ مِنْ كَلَامِ يُونُس‏",
      "en": "191. Explanation of Lawful and Unlawful Matters in Marriage, Indecency and Fornication"
    },
    "verse_count": 0,
    "verse_start_index": 10307,
    "verse_translations": [
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول موقو ف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/429)"
        ],
        "part_type": "Hadith",
        "text": [
          "1- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ وَغَيْرِهِ عَنْ يُونُسَ قَالَ كُلُّ زِنًى سِفَاحٌ وَلَيْسَ كُلُّ سِفَاحٍ زِنًى لأنَّ مَعْنَى الزِّنَى فِعْلُ حَرَامٍ مِنْ كُلِّ جِهَةٍ لَيْسَ فِيهِ شَيْ‏ءٌ مِنْ وُجُوهِ الْحَلالِ فَلَمَّا كَانَ هَذَا الْفِعْلُ بِكُلِّيَّتِهِ حَرَاماً مِنْ كُلِّ وَجْهٍ كَانَتْ تِلْكَ الْعِلَّةُ رَأْسَ كُلِّ فَاحِشَةٍ وَرَأْسَ كُلِّ حَرَامٍ حَرَّمَهُ اللهُ مِنَ الْفُرُوجِ كُلِّهَا وَإِنْ كَانَ قَدْ يَكُونُ فِعْلُ الزِّنَى عَنْ تَرَاضٍ مِنَ الْعِبَادِ وَأَجْرٍ مُسَمًّى وَمُؤَاتَاةٍ مِنْهُمْ عَلَى ذَلِكَ الْفِعْلِ فَلَيْسَ ذَلِكَ التَّرَاضِي مِنْهُمْ إِذَا تَرَاضَوْا عَلَيْهِ مِنْ إِعْطَاءِ الأجْرِ مِنَ الْمُؤَاتَاةِ عَلَى الْمُوَاقَعَةِ حَلالا وَأَنْ يَكُونَ ذَلِكَ الْفِعْلُ مِنْهُمْ للهِ عَزَّ وَجَلَّ رِضًا أَوْ أَمَرَهُمْ بِهِ فَلَمَّا كَانَ هَذَا الْفِعْلُ غَيْرَ مَأْمُورٍ بِهِ مِنْ كُلِّ جِهَةٍ كَانَ حَرَاماً كُلُّهُ وَكَانَ اسْمُهُ زِنًى مُحْصَناً لأنَّهُ مَعْصِيَةٌ مِنْ كُلِّ جِهَةٍ مَعْرُوفٌ ذَلِكَ عِنْدَ جَمِيعِ الْفِرَقِ وَالْمِلَلِ إِنَّهُ عِنْدَهُمْ حَرَامٌ مُحَرَّمٌ غَيْرُ مَأْمُورٍ بِهِ وَنَظِيرُ ذَلِكَ الْخَمْرُ بِعَيْنِهَا إِنَّهَا رَأْسُ كُلِّ مُسْكِرٍ وَإِنَّهَا إِنَّمَا صَارَتْ خَالِصَةً خَمْراً لأنَّهَا انْقَلَبَتْ مِنْ جَوْهَرِهَا بِلا مِزَاجٍ مِنْ غَيْرِهَا صَارَتْ خَمْراً وَصَارَتْ رَأْسَ كُلِّ مُسْكِرٍ مِنْ غَيْرِهَا وَلَيْسَ سَائِرُ الأشْرِبَةِ كَذَلِكَ لأنَّ كُلَّ جِنْسٍ مِنَ الأشْرِبَةِ الْمُسْكِرَةِ فَمَشُوبَةٌ مَمْزُوجٌ الْحَلالُ بِالْحَرَامِ وَمُسْتَخْرَجٌ مِنْهَا الْحَرَامُ نَظِيرُهُ الْمَاءُ الْحَلالُ الْمَمْزُوجُ بِالتَّمْرِ الْحَلالِ وَالزَّبِيبِ وَالْحِنْطَةِ وَالشَّعِيرِ وَغَيْرِ ذَلِكَ الَّذِي يَخْرُجُ مِنْ بَيْنِهَا شَرَابٌ حَرَامٌ وَلَيْسَ الْمَاءُ الَّذِي حَرَّمَهُ اللهُ وَلا التَّمْرُ وَلا الزَّبِيبُ وَغَيْرُ ذَلِكَ إِنَّمَا حَرَّمَهُ انْقِلابُهُ عِنْدَ امْتِزَاجِ كُلِّ وَاحِدٍ بِخِلافِهِ حَتَّى غَلَى وَانْقَلَبَ وَالْخَمْرُ غَلَتْ بِنَفْسِهَا لا بِخِلافِهَا فَاشْتَرَكَ جَمِيعُ الْمُسْكِرِ فِي اسْمِ الْخَمْرِ وَكَذَلِكَ شَارَكَ السِّفَاحَ الزِّنَى فِي مَعْنَى السِّفَاحِ وَلَمْ يُشَارِكِ السِّفَاحُ فِي مَعْنَى الزِّنَى أَنَّهُ زِنًى وَلا فِي اسْمِهِ فَأَمَّا مَعْنَى السِّفَاحِ الَّذِي هُوَ غَيْرُ الزِّنَى وَهُوَ مُسْتَحِقٌّ لاسْمِ السِّفَاحِ وَمَعْنَاهُ فَالَّذِي هُوَ مِنْ وَجْهِ النِّكَاحِ مَشُوبٌ بِالْحَرَامِ وَإِنَّمَا صَارَ سِفَاحاً لأنَّهُ نِكَاحٌ حَرَامٌ مَنْسُوبٌ إِلَى الْحَلالِ وَ هُوَ مِنْ وَجْهِ الْحَرَامِ فَلَمَّا كَانَ وَجْهٌ مِنْهُ حَلالا وَوَجْهٌ حَرَاماً كَانَ اسْمُهُ سِفَاحاً لأنَّ الْغَالِبَ عَلَيْهِ نِكَاحُ تَزْوِيجٍ إِلا أَنَّهُ مَشُوبٌ ذَلِكَ التَّزْوِيجُ بِوَجْهٍ مِنْ وُجُوهِ الْحَرَامِ غَيْرُ خَالِصٍ فِي مَعْنَى الْحَرَامِ بِالْكُلِّ وَلا خَالِصٌ فِي وَجْهِ الْحَلالِ بِالْكُلِّ أَمَّا أَنْ يَكُونَ الْفِعْلُ مِنْ وَجْهِ الْفَسَادِ وَالْقَصْدِ إِلَى غَيْرِ مَا أَمَرَ اللهُ عَزَّ وَجَلَّ فِيهِ مِنْ وَجْهِ التَّأْوِيلِ وَالْخَطَإِ وَالاسْتِحْلالِ بِجِهَةِ التَّأْوِيلِ وَالتَّقْلِيدِ نَظِيرُ الَّذِي يَتَزَوَّجُ ذَوَاتِ الْمَحَارِمِ الَّتِي ذَكَرَ اللهُ عَزَّ وَجَلَّ فِي كِتَابِهِ تَحْرِيمَهَا فِي الْقُرْآنِ مِنَ الأمَّهَاتِ وَالْبَنَاتِ إِلَى آخِرِ الآيَةِ كُلُّ ذَلِكَ حَلالٌ فِي جِهَةِ التَّزْوِيجِ حَرَامٌ مِنْ جِهَةِ مَا نَهَى اللهُ عَزَّ وَجَلَّ عَنْهُ وَكَذَلِكَ الَّذِي يَتَزَوَّجُ الْمَرْأَةَ فِي عِدَّتِهَا مُسْتَحِلا لِذَلِكَ فَيَكُونُ تَزْوِيجُهُ ذَلِكَ سِفَاحاً مِنْ وَجْهَيْنِ مِنْ وَجْهِ الاسْتِحْلالِ وَمِنْ وَجْهِ التَّزْوِيجِ فِي الْعِدَّةِ إِلا أَنْ يَكُونَ جَاهِلا غَيْرَ مُتَعَمِّدٍ لِذَلِكَ وَنَظِيرُ الَّذِي يَتَزَوَّجُ الْحُبْلَى مُتَعَمِّداً بِعِلْمٍ وَالَّذِي يَتَزَوَّجُ الْمُحْصَنَةَ الَّتِي لَهَا زَوْجٌ بِعِلْمٍ وَالَّذِي يَنْكِحُ الْمَمْلُوكَةَ مِنَ الْفَيْ‏ءِ قَبْلَ الْمَقْسَمِ وَالَّذِي يَنْكِحُ الْيَهُودِيَّةَ وَالنَّصْرَانِيَّةَ وَالْمَجُوسِيَّةَ وَعَبَدَةَ الأوْثَانِ عَلَى الْمُسْلِمَةِ الْحُرَّةِ وَالَّذِي يَقْدِرُ عَلَى الْمُسْلِمَةِ فَيَتَزَوَّجُ الْيَهُودِيَّةَ أَوْ غَيْرَهَا مِنْ أَهْلِ الْمِلَلِ تَزْوِيجاً دَائِماً بِمِيرَاثٍ وَالَّذِي يَتَزَوَّجُ الأمَةَ عَلَى الْحُرَّةِ وَالَّذِي يَتَزَوَّجُ الأمَةَ بِغَيْرِ إِذْنِ مَوَالِيهَا وَالْمَمْلُوكُ يَتَزَوَّجُ أَكْثَرَ مِنْ حُرَّتَيْنِ وَالْمَمْلُوكُ يَكُونُ عِنْدَهُ أَكْثَرُ مِنْ أَرْبَعِ إِمَاءٍ تَزْوِيجاً صَحِيحاً وَالَّذِي يَتَزَوَّجُ أَكْثَرَ مِنْ أَرْبَعِ حَرَائِرَ وَالَّذِي لَهُ أَرْبَعُ نِسْوَةٍ فَيُطَلِّقُ وَاحِدَةً تَطْلِيقَةً وَاحِدَةً بَائِنَةً ثُمَّ يَتَزَوَّجُ قَبْلَ أَنْ تَنْقَضِيَ عِدَّةُ الْمُطَلَّقَةِ مِنْهُ وَالَّذِي يَتَزَوَّجُ الْمَرْأَةَ الْمُطَلَّقَةَ مِنَ بَعْدِ تِسْعِ تَطْلِيقَاتٍ بِتَحْلِيلٍ مِنْ أَزْوَاجٍ وَهِيَ لا تَحِلُّ لَهُ أَبَداً وَالَّذِي يَتَزَوَّجُ الْمَرْأَةَ الْمُطَلَّقَةَ بِغَيْرِ وَجْهِ الطَّلاقِ الَّذِي أَمَرَ اللهُ عَزَّ وَجَلَّ بِهِ فِي كِتَابِهِ وَالَّذِي يَتَزَوَّجُ وَهُوَ مُحْرِمٌ فَهَؤُلاءِ كُلُّهُمْ تَزْوِيجُهُمْ مِنْ جِهَةِ التَّزْوِيجِ حَلالٌ حَرَامٌ فَاسِدٌ مِنَ الْوَجْهِ الآخَرِ لأنَّهُ لَمْ يَكُنْ يَنْبَغِي لَهُ أَنْ يَتَزَوَّجَ إِلا مِنَ الْوَجْهِ الَّذِي أَمَرَ اللهُ عَزَّ وَجَلَّ فَلِذَلِكَ صَارَ سِفَاحاً مَرْدُوداً ذَلِكَ كُلُّهُ غَيْرُ جَائِزٍ الْمُقَامُ عَلَيْهِ وَلا ثَابِتٍ لَهُمُ التَّزْوِيجُ بَلْ يُفَرِّقُ الإمَامُ بَيْنَهُمْ وَلا يَكُونُ نِكَاحُهُمْ زِنًى وَلا أَوْلادُهُمْ مِنْ. هَذَا الْوَجْهِ أَوْلادَ زِنًى وَمَنْ قَذَفَ الْمَوْلُودَ مِنْ هَؤُلاءِ الَّذِينَ وُلِدُوا مِنْ هَذَا الْوَجْهِ جُلِدَ الْحَدَّ لأنَّهُ مَوْلُودٌ بِتَزْوِيجِ رِشْدَةٍ وَإِنْ كَانَ مُفْسِداً لَهُ بِجِهَةٍ مِنَ الْجِهَاتِ الْمُحَرَّمَةِ وَالْوَلَدُ مَنْسُوبٌ إِلَى الأبِ مَوْلُودٌ بِتَزْوِيجِ رِشْدَةٍ عَلَى نِكَاحِ مِلَّةٍ مِنَ الْمِلَلِ خَارِجٌ مِنْ حَدِّ الزِّنَا وَلَكِنَّهُ مُعَاقَبٌ عُقُوبَةَ الْفِرْقَةِ وَالرُّجُوعِ إِلَى الاسْتِئْنَافِ بِمَا يَحِلُّ وَيَجُوزُ فَإِنْ قَالَ قَائِلٌ إِنَّهُ مِنْ أَوْلادِ السِّفَاحِ عَلَى صِحَّةِ مَعْنَى السِّفَاحِ لَمْ يَأْثَمْ إِلا أَنْ يَكُونَ يَعْنِي أَنَّ مَعْنَى السِّفَاحِ هُوَ الزِّنَا وَوَجْهٌ آخَرُ مِنْ وُجُوهِ السِّفَاحِ مَنْ أَتَى امْرَأَتَهُ وَهِيَ مُحْرِمَةٌ أَوْ أَتَاهَا وَهِيَ صَائِمَةٌ أَوْ أَتَاهَا وَهِيَ فِي دَمِ حَيْضِهَا أَوْ أَتَاهَا فِي حَالِ صَلاتِهَا وَكَذَلِكَ الَّذِي يَأْتِي الْمَمْلُوكَةَ قَبْلَ أَنْ يُوَاجِهَ صَاحِبَهَا وَالَّذِي يَأْتِي الْمَمْلُوكَةَ وَهِيَ حُبْلَى مِنْ غَيْرِهِ وَالَّذِي يَأْتِي الْمَمْلُوكَةَ تُسْبَى عَلَى غَيْرِ وَجْهِ السِّبَاءِ وَتُسْبَى وَلَيْسَ لَهُمْ أَنْ يُسْبَوْا وَمَنْ تَزَوَّجَ يَهُودِيَّةً أَوْ نَصْرَانِيَّةً أَوْ عَابِدَةَ وَثَنٍ وَكَانَ التَّزْوِيجُ فِي مِلَّتِهِمْ تَزْوِيجاً صَحِيحاً إِلا أَنَّهُ شَابَ ذَلِكَ فَسَادٌ بِالتَّوَجُّهِ إِلَى آلِهَتِهِمُ اللاتِي بِتَحْلِيلِهِمُ اسْتَحَلُّوا التَّزْوِيجَ فَكُلُّ هَؤُلاءِ أَبْنَاؤُهُمْ أَبْنَاءُ سِفَاحٍ إِلا أَنَّ ذَلِكَ هُوَ أَهْوَنُ مِنَ الصِّنْفِ الأوَّلِ وَإِنَّمَا إِتْيَانُ هَؤُلاءِ السِّفَاحِ إِمَّا مِنْ فَسَادِ التَّوَجُّهِ إِلَى غَيْرِ اللهِ تَعَالَى أَوْ فَسَادِ بَعْضِ هَذِهِ الْجِهَاتِ وَإِتْيَانُهُنَّ حَلالٌ وَلَكِنْ مُحَرَّفٌ مِنْ حَدِّ الْحَلالِ وَسِفَاحٌ فِي وَقْتِ الْفِعْلِ بِلا زِنًى وَلا يُفَرَّقُ بَيْنَهُمَا إِذَا دَخَلا فِي الإسْلامِ وَلا إِعَادَةَ اسْتِحْلالٍ جَدِيدٍ وَكَذَلِكَ الَّذِي يَتَزَوَّجُ بِغَيْرِ مَهْرٍ فَتَزْوِيجُهُ جَائِزٌ لا إِعَادَةَ عَلَيْهِ وَلا يُفَرَّقُ بَيْنَهُ وَبَيْنَ امْرَأَتِهِ وَهُمَا عَلَى تَزْوِيجِهِمَا الأوَّلِ إِلا أَنَّ الإسْلامَ يَقْرُبُ مِنْ كُلِّ خَيْرٍ وَمِنْ كُلِّ حَقٍّ وَلا يَبْعُدُ مِنْهُ وَكَمَا جَازَ أَنْ يَعُودَ إِلَى أَهْلِهِ بِلا تَزْوِيجٍ جَدِيدٍ أَكْثَرَ مِنَ الرُّجُوعِ إِلَى الإسْلامِ فَكُلُّ هَؤُلاءِ ابْتِدَاءُ نِكَاحِهِمْ نِكَاحٌ صَحِيحٌ فِي مِلَّتِهِمْ وَإِنْ كَانَ إِتْيَانُهُنَّ فِي تِلْكَ الأوْقَاتِ حَرَاماً لِلْعِلَلِ الَّتِي وَصَفْنَاهَا وَالْمَوْلُودُ مِنْ هَذِهِ الْجِهَاتِ أَوْلادُ رِشْدَةٍ لا أَوْلادُ زِنًى وَأَوْلادُهُمْ أَطْهَرُ مِنْ أَوْلادِ الصِّنْفِ الأوَّلِ مِنْ أَهْلِ السِّفَاحِ وَمَنْ قَذَفَ مِنْ هَؤُلاءِ فَقَدْ أَوْجَبَ عَلَى نَفْسِهِ حَدَّ الْمُفْتَرِي لِعِلَّةِ التَّزْوِيجِ الَّذِي كَانَ وَإِنْ كَانَ مَشُوباً بِشَيْ‏ءٍ مِنَ السِّفَاحِ الْخَفِيِّ مِنْ أَيِّ مِلَّةٍ كَانَ أَوْ فِي أَيِّ دِينٍ كَانَ إِذَا كَانَ نِكَاحُهُمْ تَزْوِيجاً فَعَلَى الْقَاذِفِ لَهُمْ مِنَ الْحَدِّ مِثْلُ الْقَاذِفِ لِلْمُتَزَوِّجِ فِي الإسْلامِ تَزْوِيجاً صَحِيحاً لا فَرْقَ بَيْنَهُمَا فِي الْحَدِّ وَإِنَّمَا الْحَدُّ لِعِلَّةِ التَّزْوِيجِ لا لِعِلَّةِ الْكُفْرِ وَالإيمَانِ. وَ أَمَّا وَجْهُ النِّكَاحِ الصَّحِيحِ السَّلِيمِ الْبَرِي‏ءِ مِنَ الزِّنَا وَالسِّفَاحِ هُوَ الَّذِي غَيْرُ مَشُوبٍ بِشَيْ‏ءٍ مِنْ وُجُوهِ الْحَرَامِ أَوْ وُجُوهِ الْفَسَادِ فَهُوَ النِّكَاحُ الَّذِي أَمَرَ اللهُ عَزَّ وَجَلَّ بِهِ عَلَى حَدِّ مَا أَمَرَ اللهُ أَنْ يُسْتَحَلَّ بِهِ الْفَرْجُ التَّزْوِيجِ وَالتَّرَاضِي عَلَى مَا تَرَاضَوْا عَلَيْهِ مِنَ الْمَهْرِ الْمَعْرُوفِ الْمَفْرُوضِ وَالتَّسْمِيَةِ لِلْمَهْرِ وَالْفِعْلِ فَذَلِكَ نِكَاحٌ حَلالٌ غَيْرُ سِفَاحٍ وَلا مَشُوبٍ بِوَجْهٍ مِنَ الْوُجُوهِ الَّتِي ذَكَرْنَا الْمُفْسِدَاتِ لِلنِّكَاحِ وَهُوَ خَالِصٌ مُخَلَّصٌ مُطَهَّرٌ مُبَرَّأٌ مِنَ الأدْنَاسِ وَهُوَ الَّذِي أَمَرَ اللهُ عَزَّ وَجَلَّ بِهِ وَالَّذِي تَنَاكَحَتْ عَلَيْهِ أَنْبِيَاءُ اللهِ وَحُجَجُهُ وَصَالِحُ الْمُؤْمِنِينَ مِنْ أَتْبَاعِهِمْ وَأَمَّا الَّذِي يَتَزَوَّجُ مِنْ مَالٍ غَصَبَهُ وَيَشْتَرِي مِنْهُ جَارِيَةً أَوْ مِنْ مَالِ سَرِقَةٍ أَوْ خِيَانَةٍ أَوْ كَذِبٍ فِيهِ أَوْ مِنْ كَسْبٍ حَرَامٍ بِوَجْهٍ مِنَ الْحَرَامِ فَتَزَوَّجَ مِنْ ذَلِكَ الْمَالِ تَزْوِيجاً مِنْ جِهَةِ مَا أَمَرَ اللهُ عَزَّ وَجَلَّ بِهِ فَتَزْوِيجُهُ حَلالٌ وَوَلَدُهُ وَلَدُ حَلالٍ غَيْرُ زَانٍ وَلا سِفَاحٍ وَذَلِكَ أَنَّ الْحَرَامَ فِي هَذَا الْوَجْهِ فِعْلُهُ الأوَّلُ بِمَا فَعَلَ فِي وَجْهِ الاكْتِسَابِ الَّذِي اكْتَسَبَهُ مِنْ غَيْرِ وَجْهٍ وَفِعْلُهُ فِي وَجْهِ الإنْفَاقِ فِعْلٌ يَجُوزُ الإنْفَاقُ فِيهِ وَذَلِكَ أَنَّ الإنْسَانَ إِنَّمَا يَكُونُ مَحْمُوداً أَوْ مَذْمُوماً عَلَى فِعْلِهِ وَتَقَلُّبِهِ لا عَلَى جَوْهَرِ الدِّرْهَمِ أَوْ جَوْهَرِ الْفَرْجِ وَالْحَلالُ حَلالٌ فِي نَفْسِهِ وَالْحَرَامُ حَرَامٌ فِي نَفْسِهِ أَيِ الْفِعْلُ لا الْجَوْهَرُ لا يُفْسِدُ الْحَرَامُ الْحَلالَ وَالتَّزْوِيجُ مِنْ هَذِهِ الْوُجُوهِ كُلِّهَا حَلالٌ مُحَلَّلٌ وَنَظِيرُ ذَلِكَ نَظِيرُ رَجُلٍ سَرَقَ دِرْهَماً فَتَصَدَّقَ بِهِ فَفِعْلُهُ سَرِقَةٌ حَرَامٌ وَفِعْلُهُ فِي الصَّدَقَةِ حَلالٌ لأنَّهُمَا فِعْلانِ مُخْتَلِفَانِ لا يُفْسِدُ أَحَدُهُمَا الآخَرَ إِلا أَنَّهُ غَيْرُ مَقْبُولٍ فِعْلُهُ ذَلِكَ الْحَلالُ لِعِلَّةِ مُقَامِهِ عَلَى الْحَرَامِ حَتَّى يَتُوبَ وَيَرْجِعَ فَيَكُونُ مَحْسُوباً لَهُ فِعْلُهُ فِي الصَّدَقَةِ وَكَذَلِكَ كُلُّ فِعْلٍ يَفْعَلُهُ الْمُؤْمِنُ وَالْكَافِرُ مِنْ أَفَاعِيلِ الْبِرِّ أَوِ الْفَسَادِ فَهُوَ مَوْقُوفٌ لَهُ حَتَّى يُخْتَمَ لَهُ عَلَى أَيِّ الأمْرَيْنِ يَمُوتُ فَيَخْلُوا بِهِ فِعْلُهُ للهِ عَزَّ وَجَلَّ أَكَانَ لِغَيْرِهِ إِنْ خَيْراً فَخَيْراً وَإِنْ شَرّاً فَشَرّاً. "
        ],
        "translations": {
          "en.sarwar": [
            "1. (It is of words of Yunus) Ali ibn Ibrahim has narrated from his father from ‘Isma’il ibn Marrar and others from Yunus who has said the following: (This passage is of the words of Yunus, not a Hadith from ’A’immah ‘Alayhim al-Salam, thus, it is not translated.) "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:3:191",
  "kind": "verse_list"
}