{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:5:3", "titles": {"ar": "كتاب النِّكَاحِ", "en": "THE BOOK OF MARRIAGE"}}, {"indexed_titles": {"en": "Chapter 21"}, "path": "/books/al-kafi:5:3:21", "titles": {"ar": "باب أَنَّ الْمُؤْمِنَ كُفْوُ الْمُؤْمِنَةِ ", "en": "Chapter 21 – The Believing man is a match for the Believing woman"}}], "index": 1390, "local_index": 21, "part_type": "Chapter", "path": "/books/al-kafi:5:3:21", "titles": {"ar": "باب أَنَّ الْمُؤْمِنَ كُفْوُ الْمُؤْمِنَةِ ", "en": "Chapter 21 – The Believing man is a match for the Believing woman"}, "verse_count": 2, "verse_start_index": 9437, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 9438, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:3:21:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ قَالَ كُنْتُ عِنْدَ أَبِي جَعْفَرٍ ( عليه السلام ) إِذِ اسْتَأْذَنَ عَلَيْهِ رَجُلٌ فَأَذِنَ لَهُ فَدَخَلَ عَلَيْهِ فَسَلَّمَ فَرَحَّبَ بِهِ أَبُو جَعْفَرٍ ( عليه السلام ) وَ أَدْنَاهُ وَ سَاءَلَهُ فَقَالَ الرَّجُلُ جُعِلْتُ فِدَاكَ إِنِّي خَطَبْتُ إِلَى مَوْلَاكَ فُلَانِ بْنِ أَبِي رَافِعٍ ابْنَتَهُ فُلَانَةَ فَرَدَّنِي وَ رَغِبَ عَنِّي وَ ازْدَرَأَنِي لِدَمَامَتِي وَ حَاجَتِي وَ غُرْبَتِي وَ قَدْ دَخَلَنِي مِنْ ذَلِكَ غَضَاضَةٌ هَجْمَةٌ غُضَّ لَهَا قَلْبِي تَمَنَّيْتُ عِنْدَهَا الْمَوْتَ", "فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) اذْهَبْ فَأَنْتَ رَسُولِي إِلَيْهِ وَ قُلْ لَهُ يَقُولُ لَكَ مُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحُسَيْنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ ( عليه السلام ) زَوِّجْ مُنْجِحَ بْنَ رَبَاحٍ مَوْلَايَ ابْنَتَكَ فُلَانَةَ وَ لَا تَرُدَّهُ قَالَ أَبُو حَمْزَةَ فَوَثَبَ الرَّجُلُ فَرِحاً مُسْرِعاً بِرِسَالَةِ أَبِي جَعْفَرٍ ( عليه السلام )", "فَلَمَّا أَنْ تَوَارَى الرَّجُلُ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) إِنَّ رَجُلًا كَانَ مِنْ أَهْلِ الْيَمَامَةِ يُقَالُ لَهُ جُوَيْبِرٌ أَتَى رَسُولَ اللَّهِ ( صلى الله عليه وآله ) مُنْتَجِعاً لِلْإِسْلَامِ فَأَسْلَمَ وَ حَسُنَ إِسْلَامُهُ وَ كَانَ رَجُلًا قَصِيراً دَمِيماً مُحْتَاجاً عَارِياً وَ كَانَ مِنْ قِبَاحِ السُّودَانِ فَضَمَّهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِحَالِ غُرْبَتِهِ وَ عَرَاهُ وَ كَانَ يُجْرِي عَلَيْهِ طَعَامَهُ صَاعاً مِنْ تَمْرٍ بِالصَّاعِ الْأَوَّلِ وَ كَسَاهُ شَمْلَتَيْنِ وَ أَمَرَهُ أَنْ يَلْزَمَ الْمَسْجِدَ وَ يَرْقُدَ فِيهِ بِاللَّيْلِ", "فَمَكَثَ بِذَلِكَ مَا شَاءَ اللَّهُ حَتَّى كَثُرَ الْغُرَبَاءُ مِمَّنْ يَدْخُلُ فِي الْإِسْلَامِ مِنْ أَهْلِ الْحَاجَةِ بِالْمَدِينَةِ وَ ضَاقَ بِهِمُ الْمَسْجِدُ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى نَبِيِّهِ ( صلى الله عليه وآله ) أَنْ طَهِّرْ مَسْجِدَكَ وَ أَخْرِجْ مِنَ الْمَسْجِدِ مَنْ يَرْقُدُ فِيهِ بِاللَّيْلِ وَ مُرْ بِسَدِّ أَبْوَابِ مَنْ كَانَ لَهُ فِي مَسْجِدِكَ بَابٌ إِلَّا بَابَ عَلِيٍّ ( عليه السلام ) وَ مَسْكَنَ فَاطِمَةَ ( عليها السلام ) وَ لَا يَمُرَّنَّ فِيهِ جُنُبٌ وَ لَا يَرْقُدْ فِيهِ غَرِيبٌ", "قَالَ فَأَمَرَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِسَدِّ أَبْوَابِهِمْ إِلَّا بَابَ عَلِيٍّ ( عليه السلام ) وَ أَقَرَّ مَسْكَنَ فَاطِمَةَ ( عليها السلام ) عَلَى حَالِهِ قَالَ ثُمَّ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) أَمَرَ أَنْ يُتَّخَذَ لِلْمُسْلِمِينَ سَقِيفَةٌ فَعُمِلَتْ لَهُمْ وَ هِيَ الصُّفَّةُ ثُمَّ أَمَرَ الْغُرَبَاءَ وَ الْمَسَاكِينَ أَنْ يَظَلُّوا فِيهَا نَهَارَهُمْ وَ لَيْلَهُمْ فَنَزَلُوهَا وَ اجْتَمَعُوا فِيهَا فَكَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَتَعَاهَدُهُمْ بِالْبُرِّ وَ التَّمْرِ وَ الشَّعِيرِ وَ الزَّبِيبِ إِذَا كَانَ عِنْدَهُ وَ كَانَ الْمُسْلِمُونَ يَتَعَاهَدُونَهُمْ وَ يَرِقُّونَ عَلَيْهِمْ لِرِقَّةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ يَصْرِفُونَ صَدَقَاتِهِمْ إِلَيْهِمْ", "فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) نَظَرَ إِلَى جُوَيْبِرٍ ذَاتَ يَوْمٍ بِرَحْمَةٍ مِنْهُ لَهُ وَ رِقَّةٍ عَلَيْهِ فَقَالَ لَهُ يَا جُوَيْبِرُ لَوْ تَزَوَّجْتَ امْرَأَةً فَعَفَفْتَ بِهَا فَرْجَكَ وَ أَعَانَتْكَ عَلَى دُنْيَاكَ وَ آخِرَتِكَ فَقَالَ لَهُ جُوَيْبِرٌ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَ أُمِّي مَنْ يَرْغَبُ فِيَّ فَوَ اللَّهِ مَا مِنْ حَسَبٍ وَ لَا نَسَبٍ وَ لَا مَالٍ وَ لَا جَمَالٍ فَأَيَّةُ امْرَأَةٍ تَرْغَبُ فِيَّ ", "فَقَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَا جُوَيْبِرُ إِنَّ اللَّهَ قَدْ وَضَعَ بِالْإِسْلَامِ مَنْ كَانَ فِي الْجَاهِلِيَّةِ شَرِيفاً وَ شَرَّفَ بِالْإِسْلَامِ مَنْ كَانَ فِي الْجَاهِلِيَّةِ وَضِيعاً وَ أَعَزَّ بِالْإِسْلَامِ مَنْ كَانَ فِي الْجَاهِلِيَّةِ ذَلِيلًا وَ أَذْهَبَ بِالْإِسْلَامِ مَا كَانَ مِنْ نَخْوَةِ الْجَاهِلِيَّةِ وَ تَفَاخُرِهَا بِعَشَائِرِهَا وَ بَاسِقِ أَنْسَابِهَا فَالنَّاسُ الْيَوْمَ كُلُّهُمْ أَبْيَضُهُمْ وَ أَسْوَدُهُمْ وَ قُرَشِيُّهُمْ وَ عَرَبِيُّهُمْ وَ عَجَمِيُّهُمْ مِنْ آدَمَ وَ إِنَّ آدَمَ خَلَقَهُ اللَّهُ مِنْ طِينٍ وَ إِنَّ أَحَبَّ النَّاسِ إِلَى اللَّهِ عَزَّ وَ جَلَّ يَوْمَ الْقِيَامَةِ أَطْوَعُهُمْ لَهُ وَ أَتْقَاهُمْ وَ مَا أَعْلَمُ يَا جُوَيْبِرُ لِأَحَدٍ مِنَ الْمُسْلِمِينَ عَلَيْكَ الْيَوْمَ فَضْلًا إِلَّا لِمَنْ كَانَ أَتْقَى لِلَّهِ مِنْكَ وَ أَطْوَعَ ", "ثُمَّ قَالَ لَهُ انْطَلِقْ يَا جُوَيْبِرُ إِلَى زِيَادِ بْنِ لَبِيدٍ فَإِنَّهُ مِنْ أَشْرَفِ بَنِي بَيَاضَةَ حَسَباً فِيهِمْ فَقُلْ لَهُ إِنِّي رَسُولُ رَسُولِ اللَّهِ إِلَيْكَ وَ هُوَ يَقُولُ لَكَ زَوِّجْ جُوَيْبِراً ابْنَتَكَ الذَّلْفَاءَ", "قَالَ فَانْطَلَقَ جُوَيْبِرٌ بِرِسَالَةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) إِلَى زِيَادِ بْنِ لَبِيدٍ وَ هُوَ فِي مَنْزِلِهِ وَ جَمَاعَةٌ مِنْ قَوْمِهِ عِنْدَهُ فَاسْتَأْذَنَ فَأُعْلِمَ فَأَذِنَ لَهُ فَدَخَلَ وَ سَلَّمَ عَلَيْهِ ثُمَّ قَالَ يَا زِيَادَ بْنَ لَبِيدٍ إِنِّي رَسُولُ رَسُولِ اللَّهِ إِلَيْكَ فِي حَاجَةٍ لِي فَأَبُوحُ بِهَا أَمْ أُسِرُّهَا إِلَيْكَ فَقَالَ لَهُ زِيَادٌ بَلْ بُحْ بِهَا فَإِنَّ ذَلِكَ شَرَفٌ لِي وَ فَخْرٌ", "فَقَالَ لَهُ جُوَيْبِرٌ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) يَقُولُ لَكَ زَوِّجْ جُوَيْبِراً ابْنَتَكَ الذَّلْفَاءَ فَقَالَ لَهُ زِيَادٌ أَ رَسُولُ اللَّهِ أَرْسَلَكَ إِلَيَّ بِهَذَا فَقَالَ لَهُ نَعَمْ مَا كُنْتُ لِأَكْذِبَ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ لَهُ زِيَادٌ إِنَّا لَا نُزَوِّجُ فَتَيَاتِنَا إِلَّا أَكْفَاءَنَا مِنَ الْأَنْصَارِ فَانْصَرِفْ يَا جُوَيْبِرُ حَتَّى أَلْقَى رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَأُخْبِرَهُ بِعُذْرِي", "فَانْصَرَفَ جُوَيْبِرٌ وَ هُوَ يَقُولُ وَ اللَّهِ مَا بِهَذَا نَزَلَ الْقُرْآنُ وَ لَا بِهَذَا ظَهَرَتْ نُبُوَّةُ مُحَمَّدٍ ( صلى الله عليه وآله ) فَسَمِعَتْ مَقَالَتَهُ الذَّلْفَاءُ بِنْتُ زِيَادٍ وَ هِيَ فِي خِدْرِهَا فَأَرْسَلَتْ إِلَى أَبِيهَا ادْخُلْ إِلَيَّ فَدَخَلَ إِلَيْهَا فَقَالَتْ لَهُ مَا هَذَا الْكَلَامُ الَّذِي سَمِعْتُهُ مِنْكَ تُحَاوِرُ بِهِ جُوَيْبِراً فَقَالَ لَهَا ذَكَرَ لِي أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) أَرْسَلَهُ وَ قَالَ يَقُولُ لَكَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) زَوِّجْ جُوَيْبِراً ابْنَتَكَ الذَّلْفَاءَ فَقَالَتْ لَهُ وَ اللَّهِ مَا كَانَ جُوَيْبِرٌ لِيَكْذِبَ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) بِحَضْرَتِهِ فَابْعَثِ الْآنَ رَسُولًا يَرُدُّ عَلَيْكَ جُوَيْبِراً", "فَبَعَثَ زِيَادٌ رَسُولًا فَلَحِقَ جُوَيْبِراً فَقَالَ لَهُ زِيَادٌ يَا جُوَيْبِرُ مَرْحَباً بِكَ اطْمَئِنَّ حَتَّى أَعُودَ إِلَيْكَ ثُمَّ انْطَلَقَ زِيَادٌ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ لَهُ بِأَبِي أَنْتَ وَ أُمِّي إِنَّ جُوَيْبِراً أَتَانِي بِرِسَالَتِكَ وَ قَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) يَقُولُ لَكَ زَوِّجْ جُوَيْبِراً ابْنَتَكَ الذَّلْفَاءَ فَلَمْ أَلِنْ لَهُ بِالْقَوْلِ وَ رَأَيْتُ لِقَاءَكَ وَ نَحْنُ لَا نَتَزَوَّجُ إِلَّا أَكْفَاءَنَا مِنَ الْأَنْصَارِ فَقَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَا زِيَادُ جُوَيْبِرٌ مُؤْمِنٌ وَ الْمُؤْمِنُ كُفْوٌ لِلْمُؤْمِنَةِ وَ الْمُسْلِمُ كُفْوٌ لِلْمُسْلِمَةِ فَزَوِّجْهُ يَا زِيَادُ وَ لَا تَرْغَبْ عَنْهُ", "قَالَ فَرَجَعَ زِيَادٌ إِلَى مَنْزِلِهِ وَ دَخَلَ عَلَى ابْنَتِهِ فَقَالَ لَهَا مَا سَمِعَهُ مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَتْ لَهُ إِنَّكَ إِنْ عَصَيْتَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَفَرْتَ فَزَوِّجْ جُوَيْبِراً فَخَرَجَ زِيَادٌ فَأَخَذَ بِيَدِ جُوَيْبِرٍ ثُمَّ أَخْرَجَهُ إِلَى قَوْمِهِ فَزَوَّجَهُ عَلَى سُنَّةِ اللَّهِ وَ سُنَّةِ رَسُولِهِ ( صلى الله عليه وآله ) وَ ضَمِنَ صَدَاقَهُ", "قَالَ فَجَهَّزَهَا زِيَادٌ وَ هَيَّئُوهَا ثُمَّ أَرْسَلُوا إِلَى جُوَيْبِرٍ فَقَالُوا لَهُ أَ لَكَ مَنْزِلٌ فَنَسُوقَهَا إِلَيْكَ فَقَالَ وَ اللَّهِ مَا لِي مِنْ مَنْزِلٍ قَالَ فَهَيَّئُوهَا وَ هَيَّئُوا لَهَا مَنْزِلًا وَ هَيَّئُوا فِيهِ فِرَاشاً وَ مَتَاعاً وَ كَسَوْا جُوَيْبِراً ثَوْبَيْنِ وَ أُدْخِلَتِ الذَّلْفَاءُ فِي بَيْتِهَا وَ أُدْخِلَ جُوَيْبِرٌ عَلَيْهَا مُعَتِّماً فَلَمَّا رَآهَا نَظَرَ إِلَى بَيْتٍ وَ مَتَاعٍ وَ رِيحٍ طَيِّبَةٍ قَامَ إِلَى زَاوِيَةِ الْبَيْتِ فَلَمْ يَزَلْ تَالِياً لِلْقُرْآنِ رَاكِعاً وَ سَاجِداً حَتَّى طَلَعَ الْفَجْرُ", "فَلَمَّا سَمِعَ النِّدَاءَ خَرَجَ وَ خَرَجَتْ زَوْجَتُهُ إِلَى الصَّلَاةِ فَتَوَضَّأَتْ وَ صَلَّتِ الصُّبْحَ فَسُئِلَتْ هَلْ مَسَّكِ فَقَالَتْ مَا زَالَ تَالِياً لِلْقُرْآنِ وَ رَاكِعاً وَ سَاجِداً حَتَّى سَمِعَ النِّدَاءَ فَخَرَجَ فَلَمَّا كَانَتِ اللَّيْلَةُ الثَّانِيَةُ فَعَلَ مِثْلَ ذَلِكَ وَ أَخْفَوْا ذَلِكَ مِنْ زِيَادٍ فَلَمَّا كَانَ الْيَوْمُ الثَّالِثُ فَعَلَ مِثْلَ ذَلِكَ فَأُخْبِرَ بِذَلِكَ أَبُوهَا فَانْطَلَقَ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ لَهُ بِأَبِي أَنْتَ وَ أُمِّي يَا رَسُولَ اللَّهِ أَمَرْتَنِي بِتَزْوِيجِ جُوَيْبِرٍ وَ لَا وَ اللَّهِ مَا كَانَ مِنْ مَنَاكِحِنَا وَ لَكِنْ طَاعَتُكَ أَوْجَبَتْ عَلَيَّ تَزْوِيجَهُ", "فَقَالَ لَهُ النَّبِيُّ ( صلى الله عليه وآله ) فَمَا الَّذِي أَنْكَرْتُمْ مِنْهُ قَالَ إِنَّا هَيَّأْنَا لَهُ بَيْتاً وَ مَتَاعاً وَ أُدْخِلَتِ ابْنَتِيَ الْبَيْتَ وَ أُدْخِلَ مَعَهَا مُعَتِّماً فَمَا كَلَّمَهَا وَ لَا نَظَرَ إِلَيْهَا وَ لَا دَنَا مِنْهَا بَلْ قَامَ إِلَى زَاوِيَةِ الْبَيْتِ فَلَمْ يَزَلْ تَالِياً لِلْقُرْآنِ رَاكِعاً وَ سَاجِداً حَتَّى سَمِعَ النِّدَاءَ فَخَرَجَ ثُمَّ فَعَلَ مِثْلَ ذَلِكَ فِي اللَّيْلَةِ الثَّانِيَةِ وَ مِثْلَ ذَلِكَ فِي الثَّالِثَةِ وَ لَمْ يَدْنُ مِنْهَا وَ لَمْ يُكَلِّمْهَا إِلَى أَنْ جِئْتُكَ وَ مَا نَرَاهُ يُرِيدُ النِّسَاءَ فَانْظُرْ فِي أَمْرِنَا", "فَانْصَرَفَ زِيَادٌ وَ بَعَثَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِلَى جُوَيْبِرٍ فَقَالَ لَهُ أَ مَا تَقْرَبُ النِّسَاءَ فَقَالَ لَهُ جُوَيْبِرٌ أَ وَ مَا أَنَا بِفَحْلٍ بَلَى يَا رَسُولَ اللَّهِ إِنِّي لَشَبِقٌ نَهِمٌ إِلَى النِّسَاءِ فَقَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَدْ خُبِّرْتُ بِخِلَافِ مَا وَصَفْتَ بِهِ نَفْسَكَ قَدْ ذُكِرَ لِي أَنَّهُمْ هَيَّئُوا لَكَ بَيْتاً وَ فِرَاشاً وَ مَتَاعاً وَ أُدْخِلَتْ عَلَيْكَ فَتَاةٌ حَسْنَاءُ عَطِرَةٌ وَ أَتَيْتَ مُعَتِّماً فَلَمْ تَنْظُرْ إِلَيْهَا وَ لَمْ تُكَلِّمْهَا وَ لَمْ تَدْنُ مِنْهَا فَمَا دَهَاكَ إِذَنْ", "فَقَالَ لَهُ جُوَيْبِرٌ يَا رَسُولَ اللَّهِ دَخَلْتُ بَيْتاً وَاسِعاً وَ رَأَيْتُ فِرَاشاً وَ مَتَاعاً وَ فَتَاةً حَسْنَاءَ عَطِرَةً وَ ذَكَرْتُ حَالِيَ الَّتِي كُنْتُ عَلَيْهَا وَ غُرْبَتِي وَ حَاجَتِي وَ وَضِيعَتِي وَ كِسْوَتِي مَعَ الْغُرَبَاءِ وَ الْمَسَاكِينِ فَأَحْبَبْتُ إِذْ أَوْلَانِي اللَّهُ ذَلِكَ أَنْ أَشْكُرَهُ عَلَى مَا أَعْطَانِي وَ أَتَقَرَّبُ إِلَيْهِ بِحَقِيقَةِ الشُّكْرِ فَنَهَضْتُ إِلَى جَانِبِ الْبَيْتِ فَلَمْ أَزَلْ فِي صَلَاتِي تَالِياً لِلْقُرْآنِ رَاكِعاً وَ سَاجِداً أَشْكُرُ اللَّهَ حَتَّى سَمِعْتُ النِّدَاءَ فَخَرَجْتُ فَلَمَّا أَصْبَحْتُ رَأَيْتُ أَنْ أَصُومَ ذَلِكَ الْيَوْمَ فَفَعَلْتُ ذَلِكَ ثَلَاثَةَ أَيَّامٍ وَ لَيَالِيَهَا وَ رَأَيْتُ ذَلِكَ فِي جَنْبِ مَا أَعْطَانِي اللَّهُ يَسِيراً وَ لَكِنِّي سَأُرْضِيهَا وَ أُرْضِيهِمُ اللَّيْلَةَ إِنْ شَاءَ اللَّهُ", "فَأَرْسَلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِلَى زِيَادٍ فَأَتَاهُ فَأَعْلَمَهُ مَا قَالَ جُوَيْبِرٌ فَطَابَتْ أَنْفُسُهُمْ قَالَ وَ وَفَى لَهَا جُوَيْبِرٌ بِمَا قَالَ ثُمَّ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) خَرَجَ فِي غَزْوَةٍ لَهُ وَ مَعَهُ جُوَيْبِرٌ فَاسْتُشْهِدَ رَحِمَهُ اللَّهُ تَعَالَى فَمَا كَانَ فِي الْأَنْصَارِ أَيِّمٌ أَنْفَقُ مِنْهَا بَعْدَ جُوَيْبِرٍ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Mahboub, from Malik Bin Atiyya, from Abu Hamza Al Sumaly who said, ", "‘I was in the presence of Abu Ja’far<sup>asws</sup> when a man sought permission to see him<sup>asws</sup>. So he<sup>asws</sup> permitted him and he came over to him<sup>asws</sup>, and greeted him<sup>asws</sup>. So Abu Ja’far<sup>asws</sup> welcomed him and went near to him and asked about him. So the man said, ‘May I be sacrificed for you<sup>asws</sup>! I addressed to so and so friend of yours<sup>asws</sup>, son of Abu Raf’a about his so and so daughter, but he rejected me and turned away from me, and showed disdain for me due to my physical ugliness, and my destitution, and my poverty, and due to that there has entered into me a derogatory attack upon my heart that I am coveting the death as a result’. ", "So Abu Ja’far<sup>asws</sup> said: ‘Go, for you are my<sup>asws</sup> messenger to him, and say to him, ‘Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> Bin Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> is saying to you: ‘Marry your so and so daughter to Munjih Bin Rabah, my<sup>asws</sup> friend, and do not reject him’. Abu Hamza said, ‘So the man leapt up in joy, delighted with the message of Abu Ja’far<sup>asws</sup>’. ", "So when the man went out of sight, Abu Ja’far<sup>asws</sup> said: ‘There was a man from the people of Al-Yamama called Juweybir, who came seeking success from Al-Islam. So he became a Muslim and his Islam was good, and he was a short ugly man, needy, of scarce clothing, and he was from the ugly ones of Sudan. So Rasool-Allah<sup>saww</sup> undertook his responsibility due to his poor state, and his nakedness, and would give him food, a Sa’a (four handfuls) of dates with the first Sa’a (of dates available, and clothed him with two garments, and ordered him that he should stay in the Masjid, and lie down there at night. ", "So he remained like that for as long as Allah<sup>azwj</sup> so Desired, until the strangers were many, from the ones who entered into Al-Islam from the needy people in Al-Medina, and the Masjid was constrained by them. So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto His<sup>azwj</sup> Prophet<sup>saww</sup> that he<sup>saww</sup> should purify the Masjid and exit from the Masjid the ones who were lying there at night, and Commanded with the closure of the doors of the one who had such a door for him in his<sup>saww</sup> Masjid except for the door of Ali<sup>asws</sup>, and the dwelling of Fatima<sup>asws</sup>, and to (ensure that no) one of sexual impurities should neither pass by in it, nor a strange to lie down in it.", "He<sup>asws</sup> said: ‘So Rasool-Allah<sup>saww</sup> ordered for the closure of their doors except for the door of Ali<sup>asws</sup>, and agreed for the door of the dwelling of Fatima<sup>asws</sup> to be upon its state (open). Then Rasool-Allah<sup>saww</sup> ordered that a pavilion be set up for the Muslims, so it was set up for them, and it is the platform. Then he<sup>saww</sup> ordered for the strangers, and the poor that they should shade themselves therein during their days and their nights. So they lodged in it and gathered therein. So Rasool-Allah<sup>saww</sup> was gifting them with the wheat, and the dates, and the barley, and the raisins, whenever these were with him<sup>saww</sup>, and the Muslims were (also) gifting them and were being kind to them due to the kindness of Rasool-Allah<sup>saww</sup> and were spending their charities upon them. ", "So, one day Rasool-Allah<sup>saww</sup> looked at Juweybir with mercy from him<sup>saww</sup> for him, and kindness upon him, so he<sup>saww</sup> said to him: ‘O Juweybir! If only you would marry a woman, so you would protect your chastity by her and she would support you upon your world and your Hereafter’. So Juweybir said to him<sup>saww</sup>, ‘O Rasool-Allah<sup>saww</sup>! May my father and my mother be sacrificed for you<sup>saww</sup>! Who would desire me, for by Allah<sup>azwj</sup>, I am neither with a lineage, nor from a nobility, nor wealth, nor beauty. So which woman would desire me?’ ", "So Rasool-Allah<sup>saww</sup> said to him: ‘O Juweybir! Allah<sup>azwj</sup> has Placed nobility by Al-Islam upon the one who was noble during the pre-Islamic period, and enrobed by Al-Islam the one who was ignoble, and Honoured by Al-Islam the one who disgraced during the pre-Islamic period, and Removed by Al-Islam was what from the haughtiness of the pre-Islamic period and its pride with their clans, and loftiness with their lineages. Thus, the people today, their white ones, and their black ones, and their Qureysh ones, and their Arab ones, and their non-Arab ones, are all from Adam<sup>as</sup>, and that Adam<sup>as</sup>, Allah<sup>azwj</sup> Created him<sup>as</sup> from clay, and that the most Beloved of people to Allah<sup>azwj</sup> Mighty and Majestic on the Day of Judgement would be their most obedient ones, and their most pious ones, and I<sup>saww</sup> do not know, O Juweybir, of anyone from the Muslims today to have preference over you except for the one who was more pious than you, and more obedient (to Allah<sup>azwj</sup>)’. ", "Then he<sup>saww</sup> said to him: ‘Go, O Juweybir, to Ziyad Bin Labeyd, for he is from the most noble ones of the clan of Bayza among them, and say to him, ‘I am a messenger of Rasool-Allah<sup>saww</sup> to you, and he<sup>saww</sup> is saying to you: ‘Marry your daughter Zulfa to Juweybir’. ", "He<sup>asws</sup> said: ‘So Juweybir went with the message of Rasool-Allah<sup>saww</sup> to Ziyad Bin Labeyd, and he was in his house and there was a group of his people in his presence. So he sought permission, and he was granted permission to see him. So he entered and greeted him, then said, ‘O Ziyad Bin Labeyd! I am a messenger of Rasool-Allah<sup>saww</sup> to you, regarding a need of mine, so either I announce with it or I divulge it to you in privacy’. So Ziyad said to him, ‘But, announce it, for that is more honourable for me and a matter of pride’. ", "So Juweybir said to him, ‘Rasool-Allah<sup>saww</sup> is saying to you: ‘Marry your daughter Zulfa to Juweybir’. So Ziyad said to him, ‘Did Rasool-Allah<sup>saww</sup> send you to me with this?’ So he said to him, ‘Yes. I am not one to lie upon Rasool-Allah<sup>saww</sup>’. So Ziyad said to him, ‘We do not marry (our daughters to) our youths except if they are a match from the Helpers, therefore leave, O Juweybir, until I meet up with Rasool-Allah<sup>saww</sup>, and I inform him of my excuse’. ", "So Juweybir left and he was saying, ‘By Allah<sup>azwj</sup>! Neither was the Quran Revealed with this, nor by this did the Prophet-hood of Muhammad<sup>saww</sup> appear’. So Zulfa daughter of Ziyad heard his words and she was behind her curtain. So she sent for her father to come over to her. So he went over to her, and she said to him, ‘What is this speech which I heard from you agitating Juweybir with it?’ So he said to her, ‘He mentioned to me that Rasool-Allah<sup>saww</sup> had sent him and he said, ‘Rasool-Allah<sup>saww</sup> is saying to you: ‘Marry your daughter Zulfa to Juweybir’. So she said to him, ‘By Allah<sup>azwj</sup>! It is not for Juweybir that he would lie upon Rasool-Allah<sup>saww</sup> in his<sup>saww</sup> presence, so send a messenger right now to return Juweybir back to you’. ", "So Ziyad sent a messenger who met up with Juweybir, and Ziyad said to him, ‘O Juweybir! Welcome to you. Rest assured until I return to you’. Then Ziyad went to Rasool-Allah<sup>saww</sup> and said to him<sup>saww</sup>, ‘May my father and my mother be sacrificed for you<sup>saww</sup>! Juweybir came over to me with your<sup>saww</sup> message and said, ‘Rasool-Allah<sup>saww</sup> is saying to you: ‘Marry your daughter Zulfa to Juweybir’. So I was not soft to him with the words, and I view that I should meet up with you<sup>saww</sup>, and we do not tend to marry except for our peers from the Helpers’. So Rasool-Allah<sup>saww</sup> said to him: ‘O Ziyad! Juweybir is a Believer, and the Believing man is a match for the Believing woman, and the Muslim man is a match for the Muslim woman, therefore marry (your daughter to him) O Ziyad, and do not turn away from him’. ", "He<sup>asws</sup> said: ‘So Ziyad returned to his house and went over to his daughter and told her what he had heard from Rasool-Allah<sup>saww</sup>. So she said to him, ‘If you were to disobey Rasool-Allah<sup>saww</sup>, you would be a disbeliever, therefore, get me to be married to Juweybir’. So Ziyad went out and grabbed a hand of Juweybir, then brought him out to his people, and got him married upon a Sunnah of Allah<sup>azwj</sup> and a Sunnah of His<sup>azwj</sup> Rasool<sup>saww</sup>, and guaranteed his dowry.", "So Ziyad got her ready and adorned her, then sent a message to Juweybir and said to him, ‘Is there a house for you, so we can escort her to you?’ So he said, ‘By Allah<sup>azwj</sup>! There is no house for me’. He<sup>asws</sup> said: ‘So they prepared for her and furnished a house for her, and prepared a bed therein, and chattels, and clothed Juweybir with two garments, and Zulfa entered into her house, and Juweybir went to her downcast. So when he saw her, he looked at the house and the chattels, and the aromatic perfumes, he stood to a corner of the house, and did not cease to recite the Quran whilst bowing and prostrating until the dawn emerged. ", "So when he heard the call (<span class=\"iTxt\">Azaan</span>), he and his wife went out to the Prayer. So they both performed the ablution and Prayed the morning Prayer. So she was asked, ‘Has he touched you?’ So she said, ‘He did not cease to recite the Quran, and Bowing and Prostrating until he heard the call (<span class=\"iTxt\">Azaan</span>), so he went out. So when it was the second night, he did similar to that, and that was concealed from Ziyad. So when it was the third day, he did similar to that. So her father came to know, and he went to Rasool-Allah<sup>saww</sup> and said to him<sup>saww</sup>, ‘May my father and my mother be sacrificed for you<sup>asws</sup>, O Rasool-Allah<sup>saww</sup>! You<sup>saww</sup> ordered me with the marriage of Juweybir, and by Allah<sup>azwj</sup>, he was not from the ones we would have married, but I obeyed you<sup>saww</sup>. It was Obligatory upon me to marry to him’. ", "So the Prophet<sup>saww</sup> said to him: ‘So what it is that you are denying from it?’ He said, ‘We prepared a house for him, and chattels, and I entered my daughter into the house, and I entered chattels along with her, but he neither spoke to her nor looked at her, not did he approach her, but he stood by a corner of the house and did not cease to recite the Quran bowing and prostrating until he heard the call (<span class=\"iTxt\">Azaan</span>), and he went out. The he did similar to that during the second night, and similar to that during the third, and did not approach her, and did not speak to her until I came over to you<sup>saww</sup>, and we do not see him as wanting the women. Therefore, look into our matter’. ", "So Ziyad left, and Rasool-Allah<sup>saww</sup> sent for Juweybir, so he<sup>saww</sup> said to him: ‘Do you not go near the women?’ So Juweyir said to him<sup>saww</sup>, ‘Or am I not a stallion? Yes, O Rasool-Allah<sup>saww</sup>! I have intense craving for the women’. So Rasool-Allah<sup>saww</sup> said to him: ‘I<sup>saww</sup> have been informed opposite to what you are describing yourself with. It has been mentioned to me<sup>saww</sup> that they prepared a house for you, and a bed, and chattels, and entered upon you a beautiful young girl, perfumed, and you were downcast and did not look at her, and did not speak to her, and did not approach her. So what is your wisdom then?’ ", "So Juweybir said to him<sup>saww</sup>, ‘O Rasool-Allah<sup>saww</sup>! I entered a spacious house, and I saw a bed, and chattels, and a beautiful young girl, perfumed, and I remembered my state which I used to be upon, and my poverty, and my destitution, and my place, and my clothes along with the poor ones and the needy, so I loved it that I should give preference to Allah<sup>azwj</sup> for that and thank Him<sup>azwj</sup> upon what He<sup>azwj</sup> had Given me, and wanted to be closer to Him<sup>azwj</sup> with the reality of the gratefulness, therefore I went to a side of the house, and did not cease in my Prayer, reciting the Quran bowing and prostrating, thanking Allah<sup>azwj</sup> until I heard the call (<span class=\"iTxt\">Azaan</span>). So I went out. So when it was the morning, I viewed that I should be Fasting for that day. So I did that for three days and nights, and I viewed that compared to Allah<sup>azwj</sup> had Given me, is little, but I will be pleasing her, and pleasing them tonight, Allah<sup>azwj</sup> Willing’. ", "So Rasool-Allah<sup>saww</sup> sent for Ziyad, so he came over to him<sup>saww</sup>. So he<sup>saww</sup> let him know of what Juweybir had said. So they gladdened themselves’. He<sup>asws</sup> said: ‘And Juweybir was loyal with what he had said. Then Rasool-Allah<sup>saww</sup> went out regarding a military expedition of his<sup>saww</sup>, and with him<sup>saww</sup> was Juweybir. So he was martyred, may Allah<sup>azwj</sup> the Exalted have Mercy upon him. So there was no woman more in demand than her among the Helpers, after Juweybir’."]}}, {"index": 9439, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:3:21:2", "text": ["بَعْضُ أَصْحَابِنَا عَنْ عَلِيِّ بْنِ الْحُسَيْنِ بْنِ صَالِحٍ التَّيْمُلِيِّ عَنْ أَيُّوبَ بْنِ نُوحٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَتَى رَجُلٌ النَّبِيَّ ( صلى الله عليه وآله ) فَقَالَ يَا رَسُولَ اللَّهِ عِنْدِي مَهِيرَةُ الْعَرَبِ وَ أَنَا أُحِبُّ أَنْ تَقْبَلَهَا وَ هِيَ ابْنَتِي قَالَ فَقَالَ قَدْ قَبِلْتُهَا قَالَ فَأُخْرَى يَا رَسُولَ اللَّهِ قَالَ وَ مَا هِيَ قَالَ لَمْ يَضْرِبْ عَلَيْهَا صُدْغٌ قَطُّ قَالَ لَا حَاجَةَ لِي فِيهَا وَ لَكِنْ زَوِّجْهَا مِنْ جِلْبِيبٍ ", "قَالَ فَسَقَطَ رِجْلَا الرَّجُلِ مِمَّا دَخَلَهُ ثُمَّ أَتَى أُمَّهَا فَأَخْبَرَهَا الْخَبَرَ فَدَخَلَهَا مِثْلُ مَا دَخَلَهُ فَسَمِعَتِ الْجَارِيَةُ مَقَالَتَهُ وَ رَأَتْ مَا دَخَلَ أَبَاهَا فَقَالَتْ لَهُمَا ارْضَيَا لِي مَا رَضِيَ اللَّهُ وَ رَسُولُهُ لِي ", "قَالَ فَتَسَلَّى ذَلِكَ عَنْهُمَا وَ أَتَى أَبُوهَا النَّبِيَّ ( صلى الله عليه وآله ) فَأَخْبَرَهُ الْخَبَرَ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَدْ جَعَلْتُ مَهْرَهَا الْجَنَّةَ ", "وَ زَادَ فِيهِ صَفْوَانُ قَالَ فَمَاتَ عَنْهَا حِلْبِيبٌ فَبَلَغَ مَهْرُهَا بَعْدَهُ مِائَةَ أَلْفِ دِرْهَمٍ ."], "translations": {"en.hubeali": ["One of our companions, from Ali Bin Al Husayn Bin Salih Al Taymuly, from Ayoub Bin Nuh, from Muhammad Bin Sinan, from a man, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A man came over to the Prophet<sup>saww</sup>, so he said, ‘O Rasool-Allah<sup>saww</sup>! With me is a woman of the highest dower of the Arabs, and I would love it if you<sup>saww</sup> were to accept her, and she is my daughter’. So he<sup>saww</sup> said: ‘I<sup>saww</sup> have accepted her’. He said, ‘So (I have) another, O Rasool-Allah<sup>saww</sup>!’. He<sup>saww</sup> said: ‘And what is she?’ He said, ‘She has not been struck upon her forehead at all (with any hardship)’. He<sup>saww</sup> said: ‘There is no need for me regarding her, but marry her to Jilbeeb’.  ", "He<sup>asws</sup> said: ‘So the legs of the man failed from what entered into him. Then her mother came over, so he informed her of the news, so there entered into her similar to what had entered into him. So the girl heard his speech and saw what had entered into her parents, so she said to them, ‘Be pleased for me with whatever Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup> are pleased with for me’. ", "He<sup>asws</sup> said: ‘So that consoled both of them, and her father came over to the Prophet<sup>saww</sup> and informed him<sup>saww</sup> of the news. So Rasool-Allah<sup>saww</sup> said: ‘I<sup>saww</sup> have made her dowry to be the Paradise’. ", "And Safwan (a narrator) has an increased in it saying, ‘So Jilbeeb died from her and her dower reached one hundred thousand Dirhams’."]}}]}, "index": "al-kafi:5:3:21", "kind": "verse_list"}