{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:5:3", "titles": {"ar": "كتاب النِّكَاحِ", "en": "THE BOOK OF MARRIAGE"}}, {"indexed_titles": {"en": "Chapter 22"}, "path": "/books/al-kafi:5:3:22", "titles": {"ar": "باب آخَرُ مِنْهُ ", "en": "Chapter 22 – Another chapter from it"}}], "index": 1391, "local_index": 22, "part_type": "Chapter", "path": "/books/al-kafi:5:3:22", "titles": {"ar": "باب آخَرُ مِنْهُ ", "en": "Chapter 22 – Another chapter from it"}, "verse_count": 4, "verse_start_index": 9439, "verses": [{"index": 9440, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:3:22:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ فَضَّالٍ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ عُمَرَ بْنِ أَبِي بَكَّارٍ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) زَوَّجَ مِقْدَادَ بْنَ الْأَسْوَدِ ضُبَاعَةَ ابْنَةَ الزُّبَيْرِ بْنِ عَبْدِ الْمُطَّلِبِ وَ إِنَّمَا زَوَّجَهُ لِتَتَّضِعَ الْمَنَاكِحُ وَ لِيَتَأَسَّوْا بِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ لِيَعْلَمُوا أَنَّ أَكْرَمَهُمْ عِنْدَ اللَّهِ أَتْقَاهُمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Al Hassan Bin Ali Bin Fazzal, from Sa’alba Bin Maymoun, from Umar Bin Abu Bakaar, from Abu Bakr Al Hazramy, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said that Rasool-Allah<sup>saww</sup> got Miqdad Bin Al-Aswad<sup>as</sup> married to Zuba’at daughter of Al Zubeyr Bin Abdul Muttalib, and rather he<sup>saww</sup> got him<sup>as</sup> married in order to set the rules of the marriage and (for people) to follow the footsteps of Rasool-Allah<sup>saww</sup>, and to let them know that the most prestigious of them in the Presence of Allah<sup>azwj</sup> is the most pious of them’."}]}, {"index": 9441, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:3:22:2", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ أَبِي عَبْدِ اللَّهِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُحَمَّدٍ عَنْ يَزِيدَ بْنِ حَاتِمٍ قَالَ كَانَ لِعَبْدِ الْمَلِكِ بْنِ مَرْوَانَ عَيْنٌ بِالْمَدِينَةِ يَكْتُبُ إِلَيْهِ بِأَخْبَارِ مَا يَحْدُثُ فِيهَا وَ إِنَّ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) أَعْتَقَ جَارِيَةً ثُمَّ تَزَوَّجَهَا فَكَتَبَ الْعَيْنُ إِلَى عَبْدِ الْمَلِكِ فَكَتَبَ عَبْدُ الْمَلِكِ إِلَى عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) أَمَّا بَعْدُ فَقَدْ بَلَغَنِي تَزْوِيجُكَ مَوْلَاتَكَ وَ قَدْ عَلِمْتُ أَنَّهُ كَانَ فِي أَكْفَائِكَ مِنْ قُرَيْشٍ مَنْ تَمَجَّدُ بِهِ فِي الصِّهْرِ وَ تَسْتَنْجِبُهُ فِي الْوَلَدِ فَلَا لِنَفْسِكَ نَظَرْتَ وَ لَا عَلَى وُلْدِكَ أَبْقَيْتَ وَ السَّلَامُ\nفَكَتَبَ إِلَيْهِ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) أَمَّا بَعْدُ فَقَدْ بَلَغَنِي كِتَابُكَ تُعَنِّفُنِي بِتَزْوِيجِي مَوْلَاتِي وَ تَزْعُمُ أَنَّهُ كَانَ فِي نِسَاءِ قُرَيْشٍ مَنْ أَتَمَجَّدُ بِهِ فِي الصِّهْرِ وَ أَسْتَنْجِبُهُ فِي الْوَلَدِ وَ أَنَّهُ لَيْسَ فَوْقَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مُرْتَقاً فِي مَجْدٍ وَ لَا مُسْتَزَادٌ فِي كَرَمٍ وَ إِنَّمَا كَانَتْ مِلْكَ يَمِينِي خَرَجَتْ مَتَى أَرَادَ اللَّهُ عَزَّ وَ جَلَّ مِنِّي بِأَمْرٍ أَلْتَمِسُ بِهِ ثَوَابَهُ ثُمَّ ارْتَجَعْتُهَا عَلَى سُنَّةٍ وَ مَنْ كَانَ زَكِيّاً فِي دِينِ اللَّهِ فَلَيْسَ يُخِلُّ بِهِ شَيْ‏ءٌ مِنْ أَمْرِهِ وَ قَدْ رَفَعَ اللَّهُ بِالْإِسْلَامِ الْخَسِيسَةَ وَ تَمَّمَ بِهِ النَّقِيصَةَ وَ أَذْهَبَ اللُّؤْمَ فَلَا لُؤْمَ عَلَى امْرِئٍ مُسْلِمٍ إِنَّمَا اللُّؤْمُ لُؤْمُ الْجَاهِلِيَّةِ وَ السَّلَامُ \nفَلَمَّا قَرَأَ الْكِتَابَ رَمَى بِهِ إِلَى ابْنِهِ سُلَيْمَانَ فَقَرَأَهُ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ لَشَدَّ مَا فَخَرَ عَلَيْكَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) فَقَالَ يَا بُنَيَّ لَا تَقُلْ ذَلِكَ فَإِنَّهُ أَلْسَنُ بَنِي هَاشِمٍ الَّتِي تَفْلِقُ الصَّخْرَ وَ تَغْرِفُ مِنْ بَحْرٍ إِنَّ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) يَا بُنَيَّ يَرْتَفِعُ مِنْ حَيْثُ يَتَّضِعُ النَّاسُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Abu Abdullah, from Abdul Rahman Bin Muhammad, from Yazeed Bin hatim who said, \n‘There used to be a spy for Abdul Malik Bin Marwan in Al-Medina who used to write to him with the news of whatever transpired therein, and Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> emancipated (liberated) a slave girl, then married her. So the spy wrote to Abdul Malik, and Abdul Malik wrote to Ali Bin Al-Husayn<sup>asws</sup>, ‘Thereafter, it has reached me that you<sup>asws</sup> married your<sup>asws</sup> slave girl, and you<sup>asws</sup> know that there are matches for you<sup>asws</sup> from Qureysh, one you<sup>asws</sup> can glorify with regarding the relationship and have excellence regarding the children, but you<sup>asws</sup> did not consider for yourself<sup>asws</sup> nor upon your<sup>asws</sup> children to remain. Greetings!’\nSo Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> wrote to him: ‘Thereafter, your letter has reached me<sup>asws</sup> chiding me<sup>asws</sup> due to my<sup>asws</sup> marrying my<sup>asws</sup> slave girl, and you alleged that there are women among Qureysh ones I<sup>asws</sup> can glorify with regarding the relationship, and have excellence regarding the children, and there is no higher level than that of Rasool-Allah<sup>saww</sup> with regards to glory, nor any more in benevolence. But rather, she was a possession of my<sup>asws</sup> right hand. When Allah<sup>azwj</sup> Mighty and Majestic Intended a matter from me<sup>asws</sup>, I shought His<sup>azwj</sup> Rewards by it. Then I<sup>asws</sup> returned her upon a Sunnah. And whoever was more pure in the Religion of Allah<sup>azwj</sup>, so there is nothing which can isolate him from His<sup>azwj</sup> Commad, and Allah<sup>azwj</sup> has Raised by Al-Islam the despicability and completed the short-comings with it, and removed the blames. Thus, there is no blame upon a Muslim person, but rather the blame is upon the ignorance. Greetings!’ \nSo when he read the letter, he threw it to his son Suleyman, so he read it, and he said, ‘O commander of the faithful! How intense is what Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> has prided over you!’ So he said, ‘O my son! Do not say that, for it is the tongues of the Clan of Hashim<sup>as</sup> which splits the rocks and scoops from an ocean. It is Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, O my son, who rises from where the people are humbled’."}]}, {"index": 9442, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:3:22:3", "text": "الْحُسَيْنُ بْنُ الْحَسَنِ الْهَاشِمِيُّ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ الْأَحْمَرِ وَ عَلِيُّ بْنُ مُحَمَّدِ بْنِ بُنْدَارَ عَنِ السَّيَّارِيِّ عَنْ بَعْضِ الْبَغْدَادِيِّينَ عَنْ عَلِيِّ بْنِ بِلَالٍ قَالَ لَقِيَ هِشَامَ بْنَ الْحَكَمِ بَعْضُ الْخَوَارِجِ فَقَالَ يَا هِشَامُ مَا تَقُولُ فِي الْعَجَمِ يَجُوزُ أَنْ يَتَزَوَّجُوا فِي الْعَرَبِ قَالَ نَعَمْ قَالَ فَالْعَرَبُ يَتَزَوَّجُوا مِنْ قُرَيْشٍ قَالَ نَعَمْ قَالَ فَقُرَيْشٌ يَتَزَوَّجُ فِي بَنِي هَاشِمٍ قَالَ نَعَمْ قَالَ عَمَّنْ أَخَذْتَ هَذَا قَالَ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ سَمِعْتُهُ يَقُولُ أَ تَتَكَافَأُ دِمَاؤُكُمْ وَ لَا تَتَكَافَأُ فُرُوجُكُمْ \nقَالَ فَخَرَجَ الْخَارِجِيُّ حَتَّى أَتَى أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ إِنِّي لَقِيتُ هِشَاماً فَسَأَلْتُهُ عَنْ كَذَا فَأَخْبَرَنِي بِكَذَا وَ كَذَا وَ ذَكَرَ أَنَّهُ سَمِعَهُ مِنْكَ قَالَ نَعَمْ قَدْ قُلْتُ ذَلِكَ فَقَالَ الْخَارِجِيُّ فَهَا أَنَا ذَا قَدْ جِئْتُكَ خَاطِباً فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّكَ لَكُفْوٌ فِي دَمِكَ وَ حَسَبِكَ فِي قَوْمِكَ وَ لَكِنَّ اللَّهَ عَزَّ وَ جَلَّ صَانَنَا عَنِ الصَّدَقَةِ وَ هِيَ أَوْسَاخُ أَيْدِي النَّاسِ فَنَكْرَهُ أَنْ نُشْرِكَ فِيمَا فَضَّلَنَا اللَّهُ بِهِ مَنْ لَمْ يَجْعَلِ اللَّهُ لَهُ مِثْلَ مَا جَعَلَ اللَّهُ لَنَا \nفَقَامَ الْخَارِجِيُّ وَ هُوَ يَقُولُ تَاللَّهِ مَا رَأَيْتُ رَجُلًا مِثْلَهُ قَطُّ رَدَّنِي وَ اللَّهِ أَقْبَحَ رَدٍّ وَ مَا خَرَجَ مِنْ قَوْلِ صَاحِبِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Al Hassan Al Hashimy, from Ibrahim Bin Is’haq Al Ahmar and Ali Bin Muhammad Bin Bundar, from Al Sayyari, from one of the Baghdadis, from Ali Bin Bilal who said, \n‘Hisham Bin Al-Hakam met one of the foreigners, so he said, ‘O Hisham! What are you saying regarding the non-Arabs, are they allowed to marry among the Arabs?’ He said, ‘Yes’. He said, ‘So the Arabs can marry from Qureysh?’ He said, ‘Yes’. He said, ‘So the Qureysh can marry in the Clan of Hashim<sup>as</sup>?’ He said, ‘Yes’. He said, ‘From where did you take this?’ He said, ‘From Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>. I heard him<sup>asws</sup> saying: ‘Your blood is matching but your reproductive organs cannot?’ \nHe (the narrator) said, ‘So the foreigner went out until he came over to Abu Abdullah<sup>asws</sup>, so he said, ‘I met Hisham, and I asked him about such, so he informed me with such and such, and he mentioned that he had heard it from you<sup>asws</sup>’. He<sup>asws</sup> said: ‘Yes, I<sup>asws</sup> have said that’. So the foreigner said, ‘So here I am with a marriage proposal’. So Abu Abdullah<sup>asws</sup> said to him: ‘You are a match regarding your blood, but your nobility among your people, but Allah<sup>azwj</sup> Mighty and Majestic Safeguarded us<sup>asws</sup> from the charity, and it is a dirt from the hands of the people. Thus, we<sup>asws</sup> abhor that we<sup>asws</sup> associate you in what Allah<sup>azwj</sup> has Preferred us<sup>asws</sup> with, (as you are) the one whom Allah<sup>azwj</sup> has not Made for you the like of what Allah<sup>azwj</sup> has Made for us’. \nSo the foreigner arose and he was saying, ‘By Allah<sup>azwj</sup>! I have not seen a man like him<sup>asws</sup> at all! He<sup>asws</sup> repulsed me, by Allah<sup>azwj</sup>, with the ugliest of repulsions, but still without contradicting his<sup>asws</sup> companion’."}]}, {"index": 9443, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:5:3:22:4", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ فَضَّالٍ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَمَّنْ يَرْوِي عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) تَزَوَّجَ سُرِّيَّةً كَانَتْ لِلْحَسَنِ بْنِ عَلِيٍّ ( عليه السلام ) فَبَلَغَ ذَلِكَ عَبْدَ الْمَلِكِ بْنِ مَرْوَانَ فَكَتَبَ إِلَيْهِ فِي ذَلِكَ كِتَاباً أَنَّكَ صِرْتَ بَعْلَ الْإِمَاءِ فَكَتَبَ إِلَيْهِ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) أَنَّ اللَّهَ رَفَعَ بِالْإِسْلَامِ الْخَسِيسَةَ وَ أَتَمَّ بِهِ النَّاقِصَةَ فَأَكْرَمَ بِهِ مِنَ اللُّؤْمِ فَلَا لُؤْمَ عَلَى مُسْلِمٍ إِنَّمَا اللُّؤْمُ لُؤْمُ الْجَاهِلِيَّةِ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) أَنْكَحَ عَبْدَهُ وَ نَكَحَ أَمَتَهُ \nفَلَمَّا انْتَهَى الْكِتَابُ إِلَى عَبْدِ الْمَلِكِ قَالَ لِمَنْ عِنْدَهُ خَبِّرُونِي عَنْ رَجُلٍ إِذَا أَتَى مَا يَضَعُ النَّاسَ لَمْ يَزِدْهُ إِلَّا شَرَفاً قَالُوا ذَاكَ أَمِيرُ الْمُؤْمِنِينَ قَالَ لَا وَ اللَّهِ مَا هُوَ ذَاكَ قَالُوا مَا نَعْرِفُ إِلَّا أَمِيرَ الْمُؤْمِنِينَ قَالَ فَلَا وَ اللَّهِ مَا هُوَ بِأَمِيرِ الْمُؤْمِنِينَ وَ لَكِنَّهُ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Fazzal, from Sa’albat Bin Maymoun, from the one who reported it, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> that Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> married a slave-girl who was for Al-Hassan Bin Ali<sup>asws</sup>. So (the news of) that reached Abdul Malik Bin Marwan. So he wrote to him<sup>asws</sup> a letter regarding that, ‘You<sup>asws</sup> have become a husband of the slave girl’. So Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> wrote to him: ‘Allah<sup>azwj</sup> has Raised by Al-Islam the despicability (evil) and completed the short-comings with it, and exonerated the blames by it. Thus, there is no blame upon a Muslim person, but rather the blame is upon the ignorance. Rasool-Allah<sup>saww</sup> got his slave married, and married his<sup>saww</sup> slave girl’.\nSo when the letter ended up to Abdul Malik Bin Marwan, he said to the ones in his presence, ‘Inform me about a man, when there comes upon him what humbles the people, it does not increase him except in nobility’. They said, ‘That is the commander of the faithful’. He said, ‘No, by Allah<sup>azwj</sup>, he is not that’. They said, ‘We do not know (of such a person) except for the commander of the faithful’. He said, ‘No, by Allah<sup>azwj</sup>! He is not the commander of the faithful, but he is Ali<sup>asws</sup> Bin Al Husayn<sup>asws</sup>’."}]}]}, "index": "al-kafi:5:3:22", "kind": "verse_list"}