{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 22"
        },
        "path": "/books/al-kafi:5:3:22",
        "titles": {
          "ar": "باب آخَرُ مِنْهُ ",
          "en": "Chapter 22 – Another chapter from it"
        }
      }
    ],
    "index": 1393,
    "local_index": 22,
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:3:22",
    "titles": {
      "ar": "باب آخَرُ مِنْهُ ",
      "en": "Chapter 22 – Another chapter from it"
    },
    "verse_count": 6,
    "verse_start_index": 9440,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/38)"
        ],
        "index": 9441,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:22:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ فَضَّالٍ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ عُمَرَ بْنِ أَبِي بَكَّارٍ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) زَوَّجَ مِقْدَادَ بْنَ الْأَسْوَدِ ضُبَاعَةَ ابْنَةَ الزُّبَيْرِ بْنِ عَبْدِ الْمُطَّلِبِ وَ إِنَّمَا زَوَّجَهُ لِتَتَّضِعَ الْمَنَاكِحُ وَ لِيَتَأَسَّوْا بِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ لِيَعْلَمُوا أَنَّ أَكْرَمَهُمْ عِنْدَ اللَّهِ أَتْقَاهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Hassan Bin Ali Bin Fazzal, from Sa’alba Bin Maymoun, from Umar Bin Abu Bakaar, from Abu Bakr Al Hazramy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said that Rasool-Allah<sup>saww</sup> got Miqdad Bin Al-Aswad<sup>as</sup> married to Zuba’at daughter of Al Zubeyr Bin Abdul Muttalib, and rather he<sup>saww</sup> got him<sup>as</sup> married in order to set the rules of the marriage and (for people) to follow the footsteps of Rasool-Allah<sup>saww</sup>, and to let them know that the most prestigious of them in the Presence of Allah<sup>azwj</sup> is the most pious of them’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from al-Hassan ibn Ali ibn Faddal from Tha’Iabah ibn Maymun from ‘Umar ibn abu Bakkar from ibn abu Bakr af-Hadramiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, arranged a marriage between Miqdad ibn al-Aswad and Duba‘ah daughter of al-Zubayr ibn ‘ Abd al-Muttalib. He (the Messenger of Allah) did so only to explain the rules of marriage so that people follow the foot- steps of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and take notice that the most excellent in the sight of Allah are the most pious people.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/38)"
        ],
        "index": 9442,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:22:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللهِ (عَلَيْهِ السَّلام) أَنَّ رَسُولَ اللهِ (صَلَّى اللهُ عَلَيْهِ وَآلِه) زَوَّجَ الْمِقْدَادَ بْنَ أَسْوَدَ ضُبَاعَةَ بِنْتَ الزُّبَيْرِ بْنِ عَبْدِ الْمُطَّلِبِ ثُمَّ قَالَ إِنَّمَا زَوَّجَهَا الْمِقْدَادَ لِتَتَّضِعَ الْمَنَاكِحُ وَلِيَتَأَسَّوْا بِرَسُولِ اللهِ (صَلَّى اللهُ عَلَيْهِ وَآلِه) وَلِتَعْلَمُوا أَنَّ أَكْرَمَكُمْ عِنْدَ اللهِ أَتْقَاكُمْ وَكَانَ الزُّبَيْرُ أَخَا عَبْدِ اللهِ وَأَبِي طَالِبٍ لأبِيهِمَا وَأُمِّهِمَا."
        ],
        "translations": {
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from Hisham ibn Salim from a man who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, arranged a marriage between Miqdad ibn al-Aswad and Duba‘ah daughter of al-Zubayr ibn ‘Abd al-Muttalib.’ He (the Imam) then said, ‘He (the Messenger of Allah) arranged this marriage for Miqdad only to explain the rules of marriage so that people follow the foot-steps of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and take notice that the most excellent in the sight of Allah are the most pious people. Al-Zubayr was brother of ‘Abd Allah and abu Talib from both father and mother’s side.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/38)"
        ],
        "index": 9443,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:22:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَعَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ فَضَّالٍ عَنْ عَبْدِ اللهِ بْنِ بُكَيْرٍ عَنْ زُرَارَةَ بْنِ أَعْيَنَ عَنْ أَبِي جَعْفَرٍ (عَلَيْهِ السَّلام) قَالَ مَرَّ رَجُلٌ مِنْ أَهْلِ الْبَصْرَةِ شَيْبَانِيٌّ يُقَالُ لَهُ عَبْدُ الْمَلِكِ بْنُ حَرْمَلَةَ عَلَى عَلِيِّ بْنِ الْحُسَيْنِ (عَلَيْهِما السَّلام) فَقَالَ لَهُ عَلِيُّ بْنُ الْحُسَيْنِ (عَلَيْهِما السَّلام) أَلَكَ أُخْتٌ قَالَ نَعَمْ قَالَ فَتُزَوِّجُنِيهَا قَالَ نَعَمْ قَالَ فَمَضَى الرَّجُلُ وَتَبِعَهُ رَجُلٌ مِنْ أَصْحَابِ عَلِيِّ بْنِ الْحُسَيْنِ (عَلَيْهِما السَّلام) حَتَّى انْتَهَى إِلَى مَنْزِلِهِ فَسَأَلَ عَنْهُ فَقِيلَ لَهُ فُلانُ بْنُ فُلانٍ وَهُوَ سَيِّدُ قَوْمِهِ ثُمَّ رَجَعَ إِلَى عَلِيِّ بْنِ الْحُسَيْنِ (عَلَيْهِما السَّلام) فَقَالَ لَهُ يَا أَبَا الْحَسَنِ سَأَلْتُ عَنْ صِهْرِكَ هَذَا الشَّيْبَانِيِّ فَزَعَمُوا أَنَّهُ سَيِّدُ قَوْمِهِ فَقَالَ لَهُ عَلِيُّ بْنُ الْحُسَيْنِ (عَلَيْهِما السَّلام) إِنِّي لأبْدِيكَ يَا فُلانُ عَمَّا أَرَى وَعَمَّا أَسْمَعُ أَمَا عَلِمْتَ أَنَّ اللهَ عَزَّ وَجَلَّ رَفَعَ بِالإسْلامِ الْخَسِيسَةَ وَأَتَمَّ بِهِ النَّاقِصَةَ وَأَكْرَمَ بِهِ اللُّؤْمَ فَلا لُؤْمَ عَلَى الْمُسْلِمِ إِنَّمَا اللُّؤْمُ لُؤْمُ الْجَاهِلِيَّةِ."
        ],
        "translations": {
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad and Ali ibn Ibrahim has narrated from his father from all from al- Hassan ibn Ali from ibn Faddal from ‘Abd Allah ibn Bukayr from Zurarah ibn ‘A‘yan who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘Once a man from Basrah, a Shaybaniy man called ‘Abd al- Malik ibn Harmalah visited Ali ibn al-Husayn, ‘Alayhi al-Salam. Ali ibn al-Husayn, ‘Alayhi al-Salam, asked, ‘Do you have a sister? He replied, ‘Yes, I have a sister.’ He (the Imam) then asked, ‘Will you give her in marriage to me?’ He replied, ‘Yes, I agree.’ The man left and a man of the companions of Ali ibn Al-Husayn, ‘Alayhi al-Salam, followed him to his house, asked about him and it was said that he is so and so, the master of his tribe. He returned to Ali ibn al-Husayn, ‘Alayhi al-Salam, and said, ‘Your brother in-law to be appears to be the master of his tribe.’ Ali ibn al-Husayn, ‘Alayhi al-Salam, said, ‘I can explain to you, O so and so about what I see and what I hear. Have you not taken notice that Allah, most Majestic, most Glorious, through Islam has removed the lowliness and has completed the shortcomings, has honored with it those blamed before Islam, thus there is no blame on a Muslim; the only blame is the blame of the time of ignorance.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/38)"
        ],
        "index": 9444,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:22:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ أَبِي عَبْدِ اللَّهِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُحَمَّدٍ عَنْ يَزِيدَ بْنِ حَاتِمٍ قَالَ كَانَ لِعَبْدِ الْمَلِكِ بْنِ مَرْوَانَ عَيْنٌ بِالْمَدِينَةِ يَكْتُبُ إِلَيْهِ بِأَخْبَارِ مَا يَحْدُثُ فِيهَا وَ إِنَّ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) أَعْتَقَ جَارِيَةً ثُمَّ تَزَوَّجَهَا فَكَتَبَ الْعَيْنُ إِلَى عَبْدِ الْمَلِكِ فَكَتَبَ عَبْدُ الْمَلِكِ إِلَى عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) أَمَّا بَعْدُ فَقَدْ بَلَغَنِي تَزْوِيجُكَ مَوْلَاتَكَ وَ قَدْ عَلِمْتُ أَنَّهُ كَانَ فِي أَكْفَائِكَ مِنْ قُرَيْشٍ مَنْ تَمَجَّدُ بِهِ فِي الصِّهْرِ وَ تَسْتَنْجِبُهُ فِي الْوَلَدِ فَلَا لِنَفْسِكَ نَظَرْتَ وَ لَا عَلَى وُلْدِكَ أَبْقَيْتَ وَ السَّلَامُ",
          "فَكَتَبَ إِلَيْهِ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) أَمَّا بَعْدُ فَقَدْ بَلَغَنِي كِتَابُكَ تُعَنِّفُنِي بِتَزْوِيجِي مَوْلَاتِي وَ تَزْعُمُ أَنَّهُ كَانَ فِي نِسَاءِ قُرَيْشٍ مَنْ أَتَمَجَّدُ بِهِ فِي الصِّهْرِ وَ أَسْتَنْجِبُهُ فِي الْوَلَدِ وَ أَنَّهُ لَيْسَ فَوْقَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مُرْتَقاً فِي مَجْدٍ وَ لَا مُسْتَزَادٌ فِي كَرَمٍ وَ إِنَّمَا كَانَتْ مِلْكَ يَمِينِي خَرَجَتْ مَتَى أَرَادَ اللَّهُ عَزَّ وَ جَلَّ مِنِّي بِأَمْرٍ أَلْتَمِسُ بِهِ ثَوَابَهُ ثُمَّ ارْتَجَعْتُهَا عَلَى سُنَّةٍ وَ مَنْ كَانَ زَكِيّاً فِي دِينِ اللَّهِ فَلَيْسَ يُخِلُّ بِهِ شَيْ‏ءٌ مِنْ أَمْرِهِ وَ قَدْ رَفَعَ اللَّهُ بِالْإِسْلَامِ الْخَسِيسَةَ وَ تَمَّمَ بِهِ النَّقِيصَةَ وَ أَذْهَبَ اللُّؤْمَ فَلَا لُؤْمَ عَلَى امْرِئٍ مُسْلِمٍ إِنَّمَا اللُّؤْمُ لُؤْمُ الْجَاهِلِيَّةِ وَ السَّلَامُ ",
          "فَلَمَّا قَرَأَ الْكِتَابَ رَمَى بِهِ إِلَى ابْنِهِ سُلَيْمَانَ فَقَرَأَهُ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ لَشَدَّ مَا فَخَرَ عَلَيْكَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) فَقَالَ يَا بُنَيَّ لَا تَقُلْ ذَلِكَ فَإِنَّهُ أَلْسَنُ بَنِي هَاشِمٍ الَّتِي تَفْلِقُ الصَّخْرَ وَ تَغْرِفُ مِنْ بَحْرٍ إِنَّ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) يَا بُنَيَّ يَرْتَفِعُ مِنْ حَيْثُ يَتَّضِعُ النَّاسُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Abu Abdullah, from Abdul Rahman Bin Muhammad, from Yazeed Bin hatim who said, ",
            "‘There used to be a spy for Abdul Malik Bin Marwan in Al-Medina who used to write to him with the news of whatever transpired therein, and Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> emancipated (liberated) a slave girl, then married her. So the spy wrote to Abdul Malik, and Abdul Malik wrote to Ali Bin Al-Husayn<sup>asws</sup>, ‘Thereafter, it has reached me that you<sup>asws</sup> married your<sup>asws</sup> slave girl, and you<sup>asws</sup> know that there are matches for you<sup>asws</sup> from Qureysh, one you<sup>asws</sup> can glorify with regarding the relationship and have excellence regarding the children, but you<sup>asws</sup> did not consider for yourself<sup>asws</sup> nor upon your<sup>asws</sup> children to remain. Greetings!’",
            "So Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> wrote to him: ‘Thereafter, your letter has reached me<sup>asws</sup> chiding me<sup>asws</sup> due to my<sup>asws</sup> marrying my<sup>asws</sup> slave girl, and you alleged that there are women among Qureysh ones I<sup>asws</sup> can glorify with regarding the relationship, and have excellence regarding the children, and there is no higher level than that of Rasool-Allah<sup>saww</sup> with regards to glory, nor any more in benevolence. But rather, she was a possession of my<sup>asws</sup> right hand. When Allah<sup>azwj</sup> Mighty and Majestic Intended a matter from me<sup>asws</sup>, I shought His<sup>azwj</sup> Rewards by it. Then I<sup>asws</sup> returned her upon a Sunnah. And whoever was more pure in the Religion of Allah<sup>azwj</sup>, so there is nothing which can isolate him from His<sup>azwj</sup> Commad, and Allah<sup>azwj</sup> has Raised by Al-Islam the despicability and completed the short-comings with it, and removed the blames. Thus, there is no blame upon a Muslim person, but rather the blame is upon the ignorance. Greetings!’ ",
            "So when he read the letter, he threw it to his son Suleyman, so he read it, and he said, ‘O commander of the faithful! How intense is what Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> has prided over you!’ So he said, ‘O my son! Do not say that, for it is the tongues of the Clan of Hashim<sup>as</sup> which splits the rocks and scoops from an ocean. It is Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, O my son, who rises from where the people are humbled’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Ahmad ibn Muhammad from ibn Khalid from his father from ‘Abd al-Rahman ibn Muhammad from Yazid ibn Hatim who has said the following: “‘Abd al-Malik ibn Marwan had a spy in al-Madinah who reported to him from time to time about things that happened there. Ali ibn al-Husayn, ‘Alayhi al-Salam, set free one of his slave-girls and then married with her. The spy reported this to ‘Abd al-Malik who wrote to Ali ibn al-Husayn, ‘Alayhi al-Salam, in a letter that said, ‘Thereafter, it has been reported to me that you have married one of your slave-girls, when you know very well that among Quraysh there are your match for whose marital relation; one can take pride and privilege and give birth to noble offspring. You have neglected yourself as well as your offspring, and al-Salam (greeting of peace).’ Ali ibn al-Husayn, ‘Alayhi al-Salam, wrote to him in answer a letter that said, ‘Thereafter, I received your letter in which you have used harsh words against me because of my marriage to my slave-girl and you think that among Quraysh there are women for whose marital relation one can assume pride and privilege because of their giving birth to noble children. (You must take notice) that no one can ever have a glorious position higher than that of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, or any more grace. She was in my possession and went out of my possession when Allah, most Majestic, most Glorious, wanted me to set her free for the sake of good rewards from Him. I then returned her according to the Sunnah. Whoever is clean in the religion of Allah, nothing is able to disturb him in any of his affairs. Allah through Islam has removed lowliness, has completed the shortcomings and has taken away the blame. So there is no blame on a Muslim man and the only blame is the blame of ignorance.’ When he read the letter he threw it to his son Sulayman who read it and said, ‘O ’Amir al-Mu’minin, Ali ibn al- Husayn, ‘Alayhi al-Salam, has strengthened his pride over you.’ ‘Abd al-Malik said, ‘My son do not say that; it is the tongues of banu Hashim that can tear down rocks and scoop the sea. My son, Ali ibn al-Husayn, ‘Alayhi al-Salam, rises where people go down.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/40)"
        ],
        "index": 9445,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:22:5",
        "text": [
          "الْحُسَيْنُ بْنُ الْحَسَنِ الْهَاشِمِيُّ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ الْأَحْمَرِ وَ عَلِيُّ بْنُ مُحَمَّدِ بْنِ بُنْدَارَ عَنِ السَّيَّارِيِّ عَنْ بَعْضِ الْبَغْدَادِيِّينَ عَنْ عَلِيِّ بْنِ بِلَالٍ قَالَ لَقِيَ هِشَامَ بْنَ الْحَكَمِ بَعْضُ الْخَوَارِجِ فَقَالَ يَا هِشَامُ مَا تَقُولُ فِي الْعَجَمِ يَجُوزُ أَنْ يَتَزَوَّجُوا فِي الْعَرَبِ قَالَ نَعَمْ قَالَ فَالْعَرَبُ يَتَزَوَّجُوا مِنْ قُرَيْشٍ قَالَ نَعَمْ قَالَ فَقُرَيْشٌ يَتَزَوَّجُ فِي بَنِي هَاشِمٍ قَالَ نَعَمْ قَالَ عَمَّنْ أَخَذْتَ هَذَا قَالَ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ سَمِعْتُهُ يَقُولُ أَ تَتَكَافَأُ دِمَاؤُكُمْ وَ لَا تَتَكَافَأُ فُرُوجُكُمْ ",
          "قَالَ فَخَرَجَ الْخَارِجِيُّ حَتَّى أَتَى أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ إِنِّي لَقِيتُ هِشَاماً فَسَأَلْتُهُ عَنْ كَذَا فَأَخْبَرَنِي بِكَذَا وَ كَذَا وَ ذَكَرَ أَنَّهُ سَمِعَهُ مِنْكَ قَالَ نَعَمْ قَدْ قُلْتُ ذَلِكَ فَقَالَ الْخَارِجِيُّ فَهَا أَنَا ذَا قَدْ جِئْتُكَ خَاطِباً فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّكَ لَكُفْوٌ فِي دَمِكَ وَ حَسَبِكَ فِي قَوْمِكَ وَ لَكِنَّ اللَّهَ عَزَّ وَ جَلَّ صَانَنَا عَنِ الصَّدَقَةِ وَ هِيَ أَوْسَاخُ أَيْدِي النَّاسِ فَنَكْرَهُ أَنْ نُشْرِكَ فِيمَا فَضَّلَنَا اللَّهُ بِهِ مَنْ لَمْ يَجْعَلِ اللَّهُ لَهُ مِثْلَ مَا جَعَلَ اللَّهُ لَنَا ",
          "فَقَامَ الْخَارِجِيُّ وَ هُوَ يَقُولُ تَاللَّهِ مَا رَأَيْتُ رَجُلًا مِثْلَهُ قَطُّ رَدَّنِي وَ اللَّهِ أَقْبَحَ رَدٍّ وَ مَا خَرَجَ مِنْ قَوْلِ صَاحِبِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Al Hassan Al Hashimy, from Ibrahim Bin Is’haq Al Ahmar and Ali Bin Muhammad Bin Bundar, from Al Sayyari, from one of the Baghdadis, from Ali Bin Bilal who said, ",
            "‘Hisham Bin Al-Hakam met one of the foreigners, so he said, ‘O Hisham! What are you saying regarding the non-Arabs, are they allowed to marry among the Arabs?’ He said, ‘Yes’. He said, ‘So the Arabs can marry from Qureysh?’ He said, ‘Yes’. He said, ‘So the Qureysh can marry in the Clan of Hashim<sup>as</sup>?’ He said, ‘Yes’. He said, ‘From where did you take this?’ He said, ‘From Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>. I heard him<sup>asws</sup> saying: ‘Your blood is matching but your reproductive organs cannot?’ ",
            "He (the narrator) said, ‘So the foreigner went out until he came over to Abu Abdullah<sup>asws</sup>, so he said, ‘I met Hisham, and I asked him about such, so he informed me with such and such, and he mentioned that he had heard it from you<sup>asws</sup>’. He<sup>asws</sup> said: ‘Yes, I<sup>asws</sup> have said that’. So the foreigner said, ‘So here I am with a marriage proposal’. So Abu Abdullah<sup>asws</sup> said to him: ‘You are a match regarding your blood, but your nobility among your people, but Allah<sup>azwj</sup> Mighty and Majestic Safeguarded us<sup>asws</sup> from the charity, and it is a dirt from the hands of the people. Thus, we<sup>asws</sup> abhor that we<sup>asws</sup> associate you in what Allah<sup>azwj</sup> has Preferred us<sup>asws</sup> with, (as you are) the one whom Allah<sup>azwj</sup> has not Made for you the like of what Allah<sup>azwj</sup> has Made for us’. ",
            "So the foreigner arose and he was saying, ‘By Allah<sup>azwj</sup>! I have not seen a man like him<sup>asws</sup> at all! He<sup>asws</sup> repulsed me, by Allah<sup>azwj</sup>, with the ugliest of repulsions, but still without contradicting his<sup>asws</sup> companion’."
          ],
          "en.sarwar": [
            "5. Al-Husayn ibn al-Hassan al-Hashimiy has narrated from Ibrahim ibn Ishaq al-Ahmar and Ali ibn Muhammad ibn Bandar from al- Sayyariy from certain person of Baghdad from Ali Bilal, who has said the following: ’’Hisham ibn al-Hakam once met a man of Khawarij (a certain sect) who said, ‘O Hisham, what do you say if al-‘Ajam (non- Arab) marries from Arab?’ Hisham said, ‘Yes, they can marry.’ He asked, ‘Can Arabs marry from Quraysh?’ He replied, ‘Yes, they can marry.’ He then asked, ‘Can Quraysh marry from banu Hashim?’ He replied, ‘Yes, they can marry.’ He then asked, ‘From whom have you taken this?’ He replied, ‘I have taken this from Ja’far ibn Muhammad, ‘Alayhi al-Salam. I heard him (the Imam) saying, “How can it be (accepted) that your lives match as equals but not your reproductive organs?”’ He (the narrator) has said that the Kharijiy man left and went to abu ‘Abd Allah, ‘Alayhi al- Salam, and said, ‘I met Hisham and asked him so and so questions and he answered me so and so, saying that he has heard it from you.’ He (the Imam) said, ‘Yes, I have said so.’ He then said, ‘Here I have come with a marriage proposal.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘You are a match of members of your community in matters of life and social issues. Allah, most Majestic, most Glorious, however, has protected us from charity which is the dirt of the hands of people and we dislike to share what preference Allah has given to us with those to whom Allah has not given such preference as He has set it for us.’ The Kharijiy man left saying, ‘By Allah, I have never seen any man like him. He repulsed me with a disgracing response and without contradicting his companion.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/41)"
        ],
        "index": 9446,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:22:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ فَضَّالٍ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَمَّنْ يَرْوِي عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) تَزَوَّجَ سُرِّيَّةً كَانَتْ لِلْحَسَنِ بْنِ عَلِيٍّ ( عليه السلام ) فَبَلَغَ ذَلِكَ عَبْدَ الْمَلِكِ بْنِ مَرْوَانَ فَكَتَبَ إِلَيْهِ فِي ذَلِكَ كِتَاباً أَنَّكَ صِرْتَ بَعْلَ الْإِمَاءِ فَكَتَبَ إِلَيْهِ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) أَنَّ اللَّهَ رَفَعَ بِالْإِسْلَامِ الْخَسِيسَةَ وَ أَتَمَّ بِهِ النَّاقِصَةَ فَأَكْرَمَ بِهِ مِنَ اللُّؤْمِ فَلَا لُؤْمَ عَلَى مُسْلِمٍ إِنَّمَا اللُّؤْمُ لُؤْمُ الْجَاهِلِيَّةِ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) أَنْكَحَ عَبْدَهُ وَ نَكَحَ أَمَتَهُ ",
          "فَلَمَّا انْتَهَى الْكِتَابُ إِلَى عَبْدِ الْمَلِكِ قَالَ لِمَنْ عِنْدَهُ خَبِّرُونِي عَنْ رَجُلٍ إِذَا أَتَى مَا يَضَعُ النَّاسَ لَمْ يَزِدْهُ إِلَّا شَرَفاً قَالُوا ذَاكَ أَمِيرُ الْمُؤْمِنِينَ قَالَ لَا وَ اللَّهِ مَا هُوَ ذَاكَ قَالُوا مَا نَعْرِفُ إِلَّا أَمِيرَ الْمُؤْمِنِينَ قَالَ فَلَا وَ اللَّهِ مَا هُوَ بِأَمِيرِ الْمُؤْمِنِينَ وَ لَكِنَّهُ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Fazzal, from Sa’albat Bin Maymoun, from the one who reported it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> married a slave-girl who was for Al-Hassan Bin Ali<sup>asws</sup>. So (the news of) that reached Abdul Malik Bin Marwan. So he wrote to him<sup>asws</sup> a letter regarding that, ‘You<sup>asws</sup> have become a husband of the slave girl’. So Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> wrote to him: ‘Allah<sup>azwj</sup> has Raised by Al-Islam the despicability (evil) and completed the short-comings with it, and exonerated the blames by it. Thus, there is no blame upon a Muslim person, but rather the blame is upon the ignorance. Rasool-Allah<sup>saww</sup> got his slave married, and married his<sup>saww</sup> slave girl’.",
            "So when the letter ended up to Abdul Malik Bin Marwan, he said to the ones in his presence, ‘Inform me about a man, when there comes upon him what humbles the people, it does not increase him except in nobility’. They said, ‘That is the commander of the faithful’. He said, ‘No, by Allah<sup>azwj</sup>, he is not that’. They said, ‘We do not know (of such a person) except for the commander of the faithful’. He said, ‘No, by Allah<sup>azwj</sup>! He is not the commander of the faithful, but he is Ali<sup>asws</sup> Bin Al Husayn<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn Faddal from Tha’labah ibn Maymun from those who narrated to him who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Ali ibn al-Husayn, ‘Alayhi al-Salam, married a slave-girl who belonged to al-Hassan ibn Ali ‘Alayhi al-Salam, and ‘Abd al-Malik ibn Marwan was informed about it. He wrote a letter to him (the Imam) that said, ‘I have heard that you have become the husband of a slave-girl!’ Ali ibn al-Husayn wrote back to him saying, ‘With Islam Allah has removed the lowliness and has completed the shortcomings, exonerated of the blame and there is no blame on a Muslim. Blame certainly is the blame of ignorance. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, arranged marriage for his male slave and married with his slave-girl.’ When the letter reached ‘Abd al-Malik he asked those near him, ‘Tell me who is such a man that when something that makes people low and humiliating, comes to him it increases for him nothing other than honor?’ They replied, ‘That is ’Amir al-Mu’minin (‘Abd al-Malik).’ He (‘Abd al-Malik) said, ‘No, by Allah that is not it.’ They then said, ‘We do not know anyone to be as such except ’Amir al-Mu’minin.’ He said, ‘No, by Allah, he is not ’Amir al-Mu’minin but he is Ali ibn al-Husayn, ‘Alayhi a/-Sa/am.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:3:22",
  "kind": "verse_list"
}