{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:5:3:3",
        "titles": {
          "ar": "باب أَصْنَافِ النِّسَاءِ ",
          "en": "Chapter 3 – The types of women"
        }
      }
    ],
    "index": 1374,
    "local_index": 3,
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:3:3",
    "titles": {
      "ar": "باب أَصْنَافِ النِّسَاءِ ",
      "en": "Chapter 3 – The types of women"
    },
    "verse_count": 4,
    "verse_start_index": 9362,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/8)"
        ],
        "index": 9363,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:3:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَوْ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) النِّسَاءُ أَرْبَعٌ جَامِعٌ مُجْمِعٌ وَ رَبِيعٌ مُرْبِعٌ وَ كَرْبٌ مُقْمِعٌ وَ غُلٌّ قَمِلٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: (it was said) either by ‘Rasool-Allah<sup>saww</sup> or ‘Amir Al-Momineen<sup>asws</sup>: ‘Four features are amalgamated in women, the goodness, and a desire for children, and a tint of anguish, and the dominance’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from af-Nawfafiy from af-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, or ‘Amir al- Mu’minin has said, ‘Women are of four kinds: a universal goodness, a fountain of breeding, an oppressive over-burdening or feed for parasites.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/8)"
        ],
        "index": 9364,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:3:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ مُحَمَّدِ بْنِ الصَّبَّاحِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ عَبْدِ اللَّهِ بْنِ مُصْعَبٍ الزُّبَيْرِيِّ قَالَ سَمِعْتُ أَبَا الْحَسَنِ مُوسَى بْنَ جَعْفَرٍ ( عليه السلام ) وَ جَلَسْنَا إِلَيْهِ فِي مَسْجِدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَتَذَاكَرْنَا أَمْرَ النِّسَاءِ فَأَكْثَرْنَا الْخَوْضَ وَ هُوَ سَاكِتٌ لَا يَدْخُلُ فِي حَدِيثِنَا بِحَرْفٍ ",
          "فَلَمَّا سَكَتْنَا قَالَ أَمَّا الْحَرَائِرُ فَلَا تَذْكُرُوهُنَّ وَ لَكِنْ  خَيْرُ الْجَوَارِي مَا كَانَ لَكَ فِيهَا هَوًى وَ كَانَ لَهَا عَقْلٌ وَ أَدَبٌ فَلَسْتَ تَحْتَاجُ إِلَى أَنْ تَأْمُرَ وَ لَا تَنْهَى ",
          "وَ دُونَ ذَلِكَ مَا كَانَ لَكَ فِيهَا هَوًى وَ لَيْسَ لَهَا أَدَبٌ فَأَنْتَ تَحْتَاجُ إِلَى الْأَمْرِ وَ النَّهْيِ وَ دُونَهَا مَا كَانَ لَكَ فِيهَا هَوًى وَ لَيْسَ لَهَا عَقْلٌ وَ لَا أَدَبٌ فَتَصْبِرُ عَلَيْهَا لِمَكَانِ هَوَاكَ فِيهَا وَ جَارِيَةٌ لَيْسَ لَكَ فِيهَا هَوًى وَ لَيْسَ لَهَا عَقْلٌ وَ لَا أَدَبٌ فَتَجْعَلُ فِيمَا بَيْنَكَ وَ بَيْنَهَا الْبَحْرَ الْأَخْضَرَ ",
          "قَالَ فَأَخَذْتُ بِلِحْيَتِي أُرِيدُ أَنْ أُضْرِطَ فِيهَا لِكَثْرَةِ خَوْضِنَا لِمَا لَمْ نَقُمْ فِيهِ عَلَى شَيْ‏ءٍ وَ لِجَمْعِهِ الْكَلَامَ فَقَالَ لِي مَهْ إِنْ فَعَلْتَ لَمْ أُجَالِسْكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Asbaat, from Muhammad Bin Al Sabbah, from Abdul Rahman Bin Al Hajjaj, from Abdullah Bin Mus’ab Al Zubeyri who said, ",
            "‘I heard Abu Al-Hassan Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup>, and we were seated with him<sup>asws</sup> in the Masjid of Rasool-Allah<sup>saww</sup>, so we mentioned the matter of the women. So we discussed a lot and he<sup>asws</sup> was silent, not entering in our discussion with a single word. ",
            "So when we were silent, he<sup>asws</sup> said: ‘As for the free ones, so you should not be mentioning them, but the best of the slave girls is the one whom you love and for her is an intellect, and manners, so you would neither be needy to instruct her nor prohibit her.",
            "And lower than that is the one whom you love but she does not have oral discipline and you need to command and prohibit; and lower than her is the one whom you do not love and there is no intellect for her nor any manners, so you observe patience upon her in place of your passion regarding her; and a slave girl for whom there is no passion for you regarding her, and there is no intellect for her, nor any manners, so you should make the green ocean to be between you and her’.",
            "He (the narrator) said, ‘So I grabbed my beard intending that I make a loud sound (via mouth an arrogant/stupid call) because of the abundance of our discussion and not standing therein upon anything, and due to his<sup>asws</sup> comprehensive speech’. So he<sup>asws</sup> said to me: ‘Shh! If you do it, I would not sit with you’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Asbat from Muhammad ibn al-Sabbah from ‘Abd al-Rahman ibn al-Hajjaj from ‘Abd Allah ibn Mus’ab al-Zubayriy who has said the following: “I once I heard abu al-Hassan, Musa ibn Ja‘far, ‘Alayhi al-Salam - while we were sitting in the Masjid of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause - discussing issues about women and we delved in it a great deal but he (the Imam) was quiet and did not enter in our discussion not even with one word; but when we became quiet then I heard him (the Imam) saying, ‘As far as free ones are concerned you must not speak about them, however, the best slave-girl is one whom you love, who has power of reason and moral discipline so you do not need to command or prohibit. Next to this is the one whom you love but does not have moral discipline and you need to command and prohibit. Next to this is the one whom you love but who does not have the power of reason and moral discipline and you have to exercise patience because of your love. Next to this is the slave-girl whom you do not love, she does not have the power of reason or moral discipline and you keep between yourself and her, the green ocean.’ He (the narrator) has said, ‘I then held my beard and wanted to make the sound of loud flatus because of our so much delving and without reaching any meaningful point and for his comprehensive words. He (the Imam) said, ‘Hold it, if you did it I will not sit with you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/9)"
        ],
        "index": 9365,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:3:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ إِبْرَاهِيمَ الْكَرْخِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ صَاحِبَتِي هَلَكَتْ وَ كَانَتْ لِي مُوَافِقَةً وَ قَدْ هَمَمْتُ أَنْ أَتَزَوَّجَ فَقَالَ لِيَ انْظُرْ أَيْنَ تَضَعُ نَفْسَكَ وَ مَنْ تُشْرِكُهُ فِي مَالِكَ وَ تُطْلِعُهُ عَلَى دِينِكَ وَ سِرِّكَ فَإِنْ كُنْتَ لَا بُدَّ فَاعِلًا فَبِكْراً تُنْسَبُ إِلَى الْخَيْرِ وَ إِلَى حُسْنِ الْخُلُقِ ",
          "وَ اعْلَمْ أَنَّهُنَّ كَمَا قَالَ .أَلَا إِنَّ النِّسَاءَ خُلِقْنَ شَتَّى فَمِنْهُنَّ الْغَنِيمَةُ وَ الْغَرَامُ‏ وَ مِنْهُنَّ الْهِلَالُ إِذَا تَجَلَّى لِصَاحِبِهِ وَ مِنْهُنَّ الظَّلَامُ‏ فَمَنْ يَظْفَرْ بِصَالِحِهِنَّ يَسْعَدْ وَ مَنْ يُغْبَنْ فَلَيْسَ لَهُ انْتِقَامُوَ",
          "هُنَّ ثَلَاثٌ فَامْرَأَةٌ وَلُودٌ وَدُودٌ تُعِينُ زَوْجَهَا عَلَى دَهْرِهِ لِدُنْيَاهُ وَ آخِرَتِهِ وَ لَا تُعِينُ الدَّهْرَ عَلَيْهِ وَ امْرَأَةٌ عَقِيمَةٌ لَا ذَاتُ جَمَالٍ وَ لَا خُلُقٍ وَ لَا تُعِينُ زَوْجَهَا عَلَى خَيْرٍ وَ امْرَأَةٌ صَخَّابَةٌ وَلَّاجَةٌ هَمَّازَةٌ تَسْتَقِلُّ الْكَثِيرَ وَ لَا تَقْبَلُ الْيَسِيرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad and Ahmad Bin Muhammad altogether, from Ibn Mahboub, from Ibrahim Al Karkhy who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘My female companion died and she was compatible for me and I have thought about getting married’. So he<sup>asws</sup> said to me: ‘Consider where you are placing yourself and the one you are associating in your wealth, and aspiring to be upon your Religion, and your secrets. So if it was inevitable to do, so (get married to) a virgin who has been linked to goodness, and to good mannerisms.",
            "And know that they (women) are as just as if has been said, ‘Indeed! The women are of various etiquettes – so from them is the beneficial, and the loss maker, and from them is the crescent shining for her companion, and from them is the darkness. So the one who succeeds with a righteous one would be fortunate, and the one who is cheated so it is not for him that he takes revenge.",
            "They are three (types) – A child bearing woman of cordiality and supportive of her husband all the time for his world and his Hereafter, and she does not spend time against him; and a sterile (barren) woman, not with any beauty nor manners, and she does not assist her husband upon goodness; and a vociferous (loud) woman, a fault-finder, belittling the lot, and not accepting the little’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad Ahmad ibn Muhammad from Ahmad ibn Muhammad from all ibn Mahbub from Ibrahim al-Karkhiy who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘My wife who lived in complete harmony with me has died and I want to marry.’ He (the Imam) said, ‘Think where you want to place yourself and whom you are making your partner in your assets, inform of your religion and secrets. If you must marry find a virgin who is spoken of with goodness and of good moral discipline. You must take notice that women are as it is said: ‘Women are of various moral manners; among them are gains and losses. Among them are lawful when she shines for her companion and among them is darkness. Whoever succeeds in finding the righteous among them is a sure fortunate but one who is cheated cannot revenge. ‘They are of three kinds; one kind is a child bearing and loving who helps her husband all the time in the worldly as well as the matters of the hereafter and the world does not work against her. The other kind is woman who is barren without beauty and moral manners and does not help her husband in anything good, she is loud and noisy, roaming around and faultfinding who considers a great deal very little and does not accept things of lesser amount.’” "
          ]
        }
      },
      {
        "index": 9366,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:3:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنْ سُلَيْمَانَ بْنِ سَمَاعَةَ عَنِ الْحَذَّاءِ عَنْ عَمِّهِ عَاصِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) النِّسَاءُ أَرْبَعٌ جَامِعٌ مُجْمِعٌ وَ رَبِيعٌ مُرْبِعٌ وَ خَرْقَاءُ مُقْمِعٌ وَ غُلٌّ قَمِلٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Salma Bin Al Khattab, from Suleyman Bin Sama’at, from Al Haza’a, from his uncle Aasim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The women are four (types) – An all inclusive goodness, and a child-bearing fountain, and a careless destructive one, and a feed for parasite’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Safmah ibn al-Khattab from Sulayman ibn Sama‘ah from al-Hadhdha’ from his uncle, ‘Asem who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ’Women are of four kinds: Goodness in all respects, a child bearing fountain, a dimwitted destructive one and feed for parasites.”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:3:3",
  "kind": "verse_list"
}