{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 34"
        },
        "path": "/books/al-kafi:5:3:34",
        "titles": {
          "ar": "باب الْحُرِّ يَتَزَوَّجُ الْأَمَةَ ",
          "en": "Chapter 33 – The free man marries the slave girl"
        }
      }
    ],
    "index": 1405,
    "local_index": 34,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 35"
        },
        "path": "/books/al-kafi:5:3:35",
        "titles": {
          "ar": "باب نِكَاحِ الشِّغَارِ",
          "en": "Chapter 34 – The Shighaar (exchange) marriage"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 33"
        },
        "path": "/books/al-kafi:5:3:33",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب نِكَاحِ الذِّمِّيَّةِ</span>",
          "en": "Chapter 32 – Marriage of the Zimmy woman (under the responsibility)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:3:34",
    "titles": {
      "ar": "باب الْحُرِّ يَتَزَوَّجُ الْأَمَةَ ",
      "en": "Chapter 33 – The free man marries the slave girl"
    },
    "verse_count": 9,
    "verse_start_index": 9502,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/70)"
        ],
        "index": 9503,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:34:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الْحُرِّ يَتَزَوَّجُ الْأَمَةَ قَالَ لَا بَأْسَ إِذَا اضْطُرَّ إِلَيْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Usman Bin Isa, from Sama’at, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the free man marrying the slave girl. He<sup>asws</sup> said: ‘There is no problem when he is desperate to her’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from ‘Uthman ibn ‘Isa from Sama‘ah from abu Basir who has said the following: “About the case of a free man who marries a slave-girl, abu ‘ Abd Allah, ‘Alayhi al-Salam, has said, ’It is not unlawful if it is an emergency.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/71)"
        ],
        "index": 9504,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:34:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تَزَوَّجِ الْحُرَّةَ عَلَى الْأَمَةِ وَ لَا تَزَوَّجِ الْأَمَةَ عَلَى الْحُرَّةِ وَ مَنْ تَزَوَّجَ أَمَةً عَلَى حُرَّةٍ فَنِكَاحُهُ بَاطِلٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘You can marry the free woman upon the slave girl (as an additional wife), but you cannot marry the slave girl (as an additional wife) upon the free woman; and the one who marries the slave girl (as an additional wife) upon a free woman, so his marriage is void’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “Abu ’Abd Allah, ‘Alayhi al-Salam, has said, ‘A free woman can become a second wife, the first wife being a slave-girl; but a slave-girl cannot become a second wife, the first wife being a free woman. If one marries a slave-girl as a second wife, the first being a free woman, such marriage is invalid.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/71)"
        ],
        "index": 9505,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:34:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ نِكَاحِ الْأَمَةِ قَالَ يَتَزَوَّجُ الْحُرَّةَ عَلَى الْأَمَةِ وَ لَا تُتَزَوَّجُ الْأَمَةُ عَلَى الْحُرَّةِ وَ نِكَاحُ الْأَمَةِ عَلَى الْحُرَّةِ بَاطِلٌ وَ إِنِ اجْتَمَعَتْ عِنْدَكَ حُرَّةٌ وَ أَمَةٌ فَلِلْحُرَّةِ يَوْمَانِ وَ لِلْأَمَةِ يَوْمٌ لَا يَصْلُحُ نِكَاحُ الْأَمَةِ إِلَّا بِإِذْنِ مَوَالِيهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad, from Ali Bin Abu Hamza, from Abu Baseer who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about marrying the slave girl. He<sup>asws</sup> said: ‘The free woman can be married (as an additional wife) upon the slave girl, but the slave girl cannot be married (as an additional wife) upon the free woman; and the marriage of the slave girl (as an additional wife) upon the free woman is void; and if there gather together with you, a free woman and a slave girl, so for the free woman would be two days and for the slave girl would be one day. It is not correct to marry the slave girl except with the permission of her master’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa‘id from al-Qasim ibn Muhammad from Ali ibn abu Hamzah from abu Basir who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the marriage with a slave-girl. He (the Imam) said, ‘One can marry a free woman as a second wife, the first being a slave- girl, but he cannot marry a slave-girl as a second wife, the first being a free woman, and the marriage contract of slave-girl as a second wife, the first being a free woman, is invalid. If you have a free and a slave-girl wife, for the free wife are two days and for the slave-girl one day and it is not proper to marry a slave-girl without the permission of the master.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/71)"
        ],
        "index": 9506,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:34:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ يَحْيَى اللَّحَّامِ عَنْ سَمَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ تَزَوَّجَ امْرَأَةً حُرَّةً وَ لَهُ امْرَأَةٌ أَمَةٌ وَ لَمْ تَعْلَمِ الْحُرَّةُ أَنَّ لَهُ امْرَأَةً أَمَةً قَالَ إِنْ شَاءَتِ الْحُرَّةُ أَنْ تُقِيمَ مَعَ الْأَمَةِ أَقَامَتْ وَ إِنْ شَاءَتْ ذَهَبَتْ إِلَى أَهْلِهَا ",
          "قَالَ قُلْتُ لَهُ فَإِنْ لَمْ تَرْضَ بِذَلِكَ وَ ذَهَبَتْ إِلَى أَهْلِهَا أَ فَلَهُ عَلَيْهَا سَبِيلٌ إِذَا لَمْ تَرْضَ بِالْمَقَامِ قَالَ لَا سَبِيلَ لَهُ عَلَيْهَا إِذَا لَمْ تَرْضَ حِينَ تَعْلَمُ قُلْتُ فَذَهَابُهَا إِلَى أَهْلِهَا هُوَ طَلَاقُهَا قَالَ نَعَمْ إِذَا خَرَجَتْ مِنْ مَنْزِلِهِ اعْتَدَّتْ ثَلَاثَةَ أَشْهُرٍ أَوْ ثَلَاثَةَ قُرُوءٍ ثُمَّ تَزَوَّجُ إِنْ شَاءَتْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Yahya Al Lahaam, from Sama’at, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who marries a free woman and for him is a slave wife, and the free woman does not know that for him is a slave wife. He<sup>asws</sup> said: ‘If she so desires to, she can stay with the slave girl with a staying, and if she so desires to she goes back to her family’. ",
            "He (the narrator) said, ‘I said to him<sup>asws</sup>, ‘Supposing she is not happy with that and she goes back to her family, is there a way for him upon her when she is not happy with the staying?’ He<sup>asws</sup> said: ‘There is no way for him upon her when she is not happy when she comes to know’. I said, ‘So she goes back to her family, he has (been deemed to have) divorced her?’ He<sup>asws</sup> said: ‘Yes. When she goes out from his house, she would observe the waiting period of three months, or three menses-free periods, then she can marry (someone else) if she so desires to’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn Mahbub from Yahya al-Lahham from Sama‘ah who has said the following: “About the case of a man who marries a free woman and he has a wife who is a slave-girl and the free woman does not know that he has a slave-girl wife, abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If the free woman wants to live with his slave-girl wife, she can do so and if she wants she can go to her family.’ I then asked, ‘If she did not like to live with his slave-girl wife and went to her family, is there a way for him to bring her back?’ He (the Imam) said, ‘He has no way to bring her back if she does not agree when she finds out.’ I then asked, ‘Is her going to her family her divorce?’ He (the Imam) said, ‘Yes, when she goes out of his house, she commences her waiting period for three months or three cycles of menses then she can marry if she so chooses.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/72)"
        ],
        "index": 9507,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:34:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) هَلْ لِلرَّجُلِ أَنْ يَتَزَوَّجَ النَّصْرَانِيَّةَ عَلَى الْمُسْلِمَةِ وَ الْأَمَةَ عَلَى الْحُرَّةِ فَقَالَ لَا تُتَزَوَّجُ وَاحِدَةٌ مِنْهُمَا عَلَى الْمُسْلِمَةِ وَ تُتَزَوَّجُ الْمُسْلِمَةُ عَلَى الْأَمَةِ وَ النَّصْرَانِيَّةِ وَ لِلْمُسْلِمَةِ الثُّلُثَانِ وَ لِلْأَمَةِ وَ النَّصْرَانِيَّةِ الثُّلُثُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, form Abdullah Bin Muhammad, from Ali Bin Al Hakam, from Aban Bin Usman, from Abdul Rahman Bin Abu Abdullah who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup>, ‘Is it for the man that he marries the Christian woman (as an additional wife) upon the Muslim woman, and the slave girl (as an additional wife) upon the free woman?’ So he<sup>asws</sup> said: ‘No. He cannot marry any one of the two upon the Muslim woman, and he can marry the Muslim woman (as an additional wife) upon the slave girl, and the Christian woman; and for the Muslim woman would be two thirds (of the husband’s time), and for the slave girl and the Christian woman would be the one-third’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from ‘Abd Allah ibn Muhammad from Ali ibn al-Hakam from Aban ibn ‘Uthman from ‘Abd al- Rahman ibn abu ‘Abd Allah who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, if a man can marry a Christian woman as a second wife, the first being a Muslim woman or a slave-girl as a second wife, the first being a free woman. He (the Imam) said, ‘He cannot marry anyone of them as a second wife, the first being a Muslim woman. One can marry a Muslim woman as a second wife, the first being a slave-girl or a Christian woman. The Muslim woman will have two-thirds of the time, the slave-girl and the Christian woman one-third of the time.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/72)"
        ],
        "index": 9508,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:34:6",
        "text": [
          "أَبَانٌ عَنْ زُرَارَةَ بْنِ أَعْيَنَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُ عَنِ الرَّجُلِ يَتَزَوَّجُ الْأَمَةَ قَالَ لَا إِلَّا أَنْ يُضْطَرَّ إِلَى ذَلِكَ."
        ],
        "translations": {
          "en.hubeali": [
            "Aban, from Zurara Bin Ayn, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked about the man who marries the slave girl. He<sup>asws</sup> said: ‘No, except if he is desperate to that’."
          ],
          "en.sarwar": [
            "6. Aban has narrated from Zurarah ibn ‘A‘yan who has said the following: “I once asked abu Ja’far, ‘Alayhi al-Salam, about the marriage of a slave-girl. He (the Imam) said, ‘No, unless it is an emergency.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/72)"
        ],
        "index": 9509,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:34:7",
        "refs": {
          "Mentions": [
            "/books/quran:4:25"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا يَنْبَغِي أَنْ يَتَزَوَّجَ الرَّجُلُ الْحُرُّ الْمَمْلُوكَةَ الْيَوْمَ إِنَّمَا كَانَ ذَلِكَ حَيْثُ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ مَنْ لَمْ يَسْتَطِعْ مِنْكُمْ طَوْلًا وَ الطَّوْلُ الْمَهْرُ وَ مَهْرُ الْحُرَّةِ الْيَوْمَ مَهْرُ الْأَمَةِ أَوْ أَقَلُّ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Iibn Fazal, from Ibn Bukeyr, from one of our companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It is not befitting that the free man marries the slave woman today. But rather, that was where Allah<sup>azwj</sup> Mighty and Majestic Says <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h25\">[4:25]</a> And whoever among you has not within his power ampleness of means</span>, and the ampleness of means is the dower, and a dower of the free woman today is a dower of the slave girl or even less’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from ibn Bukayr from certain persons of our people who have said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘It is not proper today for a free man to marry a slave- girl. It was permissible as Allah, most Majestic, most Glorious, has said, ‘If one cannot find resources. . . .’ <a href=\"/#/books/quran:4#h25\">[4:25]</a> Resources is a reference to mahr (dower). Today mahr (dower) is like the mahr (dower) of slave-girls or less.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/76)"
        ],
        "index": 9510,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:34:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ وَ غَيْرِهِ عَنْ يُونُسَ عَنْهُمْ ( عليهم السلام ) قَالَ لَا يَنْبَغِي لِلْمُسْلِمِ الْمُوسِرِ أَنْ يَتَزَوَّجَ الْأَمَةَ إِلَّا أَنْ لَا يَجِدَ حُرَّةً فَكَذَلِكَ لَا يَنْبَغِي لَهُ أَنْ يَتَزَوَّجَ امْرَأَةً مِنْ أَهْلِ الْكِتَابِ إِلَّا فِي حَالِ الضَّرُورَةِ حَيْثُ لَا يَجِدُ مُسْلِمَةً حُرَّةً وَ لَا أَمَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ismail Bin Marrar and someone else, ",
            "(It has been narrated) from Yunus, from them (one of the Imams<sup>asws</sup>) having said: ‘It is not befitting for the affluent Muslim that he marries the slave girl except if he cannot find a free woman. Thus, similar to that, it is not befitting for him that he marries a woman from the People of the Book except during a state of necessity when he cannot find a Muslim woman, neither a free one nor a slave girl’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from his father from ‘Isma’il ibn Marrar and others from Yunus from ‘A’immah who has said the following: “He (the Imam), ‘Alayhi al-Salam, has said, ‘It is not proper for an affluent Muslim man to marry a slave-girl unless he cannot find a free woman. So also, it is not proper for him to marry a woman from the people of the book unless it is an emergency when he cannot find a free Muslim woman or a slave- girl.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/76)"
        ],
        "index": 9511,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:34:9",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا يَنْبَغِي لِلْحُرِّ أَنْ يَتَزَوَّجَ الْأَمَةَ وَ هُوَ يَقْدِرُ عَلَى الْحُرَّةِ وَ لَا يَنْبَغِي أَنْ يَتَزَوَّجَ الْأَمَةَ عَلَى الْحُرَّةِ وَ لَا بَأْسَ أَنْ يَتَزَوَّجَ الْحُرَّةَ عَلَى الْأَمَةِ فَإِنْ تَزَوَّجَ الْحُرَّةَ عَلَى الْأَمَةِ فَلِلْحُرَّةِ يَوْمَانِ وَ لِلْأَمَةِ يَوْمٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus, from Ibn Muskan, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It is not befitting for the free man that he marries the slave girl and he is able upon (marrying) the free woman, and it is not befitting that he marries the slave girl (as an additional wife) upon the free woman; and there is no problem if he marries the free woman (as an additional wife) upon the slave girl. So if he were to marry the free woman (as an additional wife) upon the slave girls, so for the free woman would be two days, and for the slave girl would be one day’."
          ],
          "en.sarwar": [
            "9. Ali ibn Ibrahim has narrated from his father from ‘Isma’il ibn Marrar from Yunus from ibn Muskan from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘It is not proper for a free man to marry a slave-girl when he is able to marry a free woman, and it is not proper for him to marry a slave-girl as a second wife, the first being a free woman but it is not unlawful to marry a free woman as a second wife, the first being a slave-girl; and if he did so, two days of time is for the free woman and one day for the slave-girl.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:3:34",
  "kind": "verse_list"
}