{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:5:3", "titles": {"ar": "كتاب النِّكَاحِ", "en": "THE BOOK OF MARRIAGE"}}, {"indexed_titles": {"en": "Chapter 35"}, "path": "/books/al-kafi:5:3:35", "titles": {"ar": "باب الرَّجُلِ يَتَزَوَّجُ الْمَرْأَةَ وَ يَتَزَوَّجُ أُمَّ وَلَدِ أَبِيهَا", "en": "Chapter 35 – The man marries the woman, and he marries the mother of the child of her father"}}], "index": 1404, "local_index": 35, "part_type": "Chapter", "path": "/books/al-kafi:5:3:35", "titles": {"ar": "باب الرَّجُلِ يَتَزَوَّجُ الْمَرْأَةَ وَ يَتَزَوَّجُ أُمَّ وَلَدِ أَبِيهَا", "en": "Chapter 35 – The man marries the woman, and he marries the mother of the child of her father"}, "verse_count": 6, "verse_start_index": 9511, "verses": [{"index": 9512, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:3:35:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يَتَزَوَّجُ الْمَرْأَةَ وَ يَتَزَوَّجُ أُمَّ وَلَدِ أَبِيهَا فَقَالَ لَا بَأْسَ بِذَلِكَ فَقُلْتُ لَهُ بَلَغَنَا عَنْ أَبِيكَ أَنَّ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) تَزَوَّجَ ابْنَةَ الْحَسَنِ بْنِ عَلِيٍّ ( عليه السلام ) وَ أُمَّ وَلَدِ الْحَسَنِ وَ ذَلِكَ أَنَّ رَجُلًا مِنْ أَصْحَابِنَا سَأَلَنِي أَنْ أَسْأَلَكَ عَنْهَا \nفَقَالَ لَيْسَ هَكَذَا إِنَّمَا تَزَوَّجَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) ابْنَةَ الْحَسَنِ وَ أُمَّ وَلَدٍ لِعَلِيِّ بْنِ الْحُسَيْنِ الْمَقْتُولِ عِنْدَكُمْ فَكَتَبَ بِذَلِكَ إِلَى عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ فَعَابَ عَلَى عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) فَكَتَبَ إِلَيْهِ فِي ذَلِكَ فَكَتَبَ إِلَيْهِ الْجَوَابَ فَلَمَّا قَرَأَ الْكِتَابَ قَالَ إِنَّ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) يَضَعُ نَفْسَهُ وَ إِنَّ اللَّهَ يَرْفَعُهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, \n(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the man who married the woman and he married a mother of the children of her father. So he<sup>asws</sup> said: ‘There is no problem with that’. So I said to him<sup>asws</sup>, ‘It has reached me from your<sup>asws</sup> father<sup>asws</sup> that Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> married the daughter of Al-Hassan<sup>asws</sup> Bin Ali<sup>asws</sup> and a mother of the children of Al-Hassan<sup>asws</sup>, and that is that a man from our companions asked me that I should asked you<sup>asws</sup> about it’. \nSo he<sup>asws</sup> said: ‘It is not like this. But rather, Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> married a daughter of Al-Hassan<sup>asws</sup> and a mother of the children of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, the one who was murdered with you. So that was written about to Abdul Malik Bin Marwan, so he criticized upon Ali Bin Al-Husayn<sup>asws</sup>. So he<sup>asws</sup> wrote to him the answer regarding that. So when he read the letter, he said, ‘Surely, Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> humbles himself<sup>asws</sup> but Allah<sup>azwj</sup> Raises him<sup>asws</sup>’."}]}, {"index": 9513, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:3:35:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يَتَزَوَّجُ الْمَرْأَةَ وَ يَتَزَوَّجُ أُمَّ وَلَدٍ لِأَبِيهَا قَالَ لَا بَأْسَ بِذَلِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Sinan, \n(It has been narrated) from Abu Al Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the man who married the woman and he married a mother of the children of her father. He<sup>asws</sup> said: ‘There is no problem with that’."}]}, {"index": 9514, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:3:35:3", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يَهَبُ لِزَوْجِ ابْنَتِهِ الْجَارِيَةَ وَ قَدْ وَطِئَهَا أَ يَطَؤُهَا زَوْجُ ابْنَتِهِ قَالَ لَا بَأْسَ بِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Al Hassan Bin Ali Al Kufy, from Abu Abdullah Bin Jabala, from Is’haq Bin Ammar, \n(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the man who gifted the slave girl to the husband of his daughter (son-in-law), and he had copulated with her. Can his son-in-law copulate with her?’ He<sup>asws</sup> said: ‘There is no problem with it’."}]}, {"index": 9515, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:5:3:35:4", "text": "عَنْهُ عَنْ عِمْرَانَ بْنِ مُوسَى عَنْ مُحَمَّدِ بْنِ عَبْدِ الْحَمِيدِ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ قَالَ كُنْتُ عِنْدَ الرِّضَا ( عليه السلام ) فَسَأَلَهُ صَفْوَانُ عَنْ رَجُلٍ تَزَوَّجَ ابْنَةَ رَجُلٍ وَ لِلرَّجُلِ امْرَأَةٌ وَ أُمُّ وَلَدٍ فَمَاتَ أَبُو الْجَارِيَةِ أَ يَحِلُّ لِلرَّجُلِ الْمُتَزَوِّجِ امْرَأَتُهُ وَ أُمُّ وَلَدِهِ قَالَ لَا بَأْسَ بِهِ", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Imran Bin Musa, from Muhammad Bin Abdul Hameed from Muhammad Bin Al Fuzayl who said, \n‘I was in the presence of Al-Reza<sup>asws</sup>, so Safwan asked him<sup>asws</sup> about a man who married a daughter of a man and for the man was a wife and a mother of the children. So the father of the girl died, is it Permissible for the man to marry his wife and a mother of his children?’ He<sup>asws</sup> said: ‘There is no problem with it."}]}, {"index": 9516, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:5:3:35:5", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنْ عُبَيْسِ بْنِ هِشَامٍ عَنْ مُحَمَّدِ بْنِ أَبِي حَمْزَةَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا تَقُولُ فِي رَجُلٍ تَزَوَّجَ امْرَأَةً فَأَهْدَى لَهَا أَبُوهَا جَارِيَةً كَانَ يَطَؤُهَا أَ يَحِلُّ لِزَوْجِهَا أَنْ يَطَأَهَا قَالَ نَعَمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Al Al Ashary, from Al Hassan Bin Ali Al Kufy, from Ubeys Bin Hisham, from Muhammad Bin Abu Hamza who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘What are you<sup>asws</sup> saying regarding a man who marries a woman, so her father gifts to her a slave girl he had copulated with. Is it Permissible for her husband that he copulates with her?’ He<sup>asws</sup> said: ‘Yes’."}]}, {"index": 9517, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:5:3:35:6", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ سَمَاعَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ تَزَوَّجَ أُمَّ وَلَدٍ كَانَتْ لِرَجُلٍ فَمَاتَ عَنْهَا سَيِّدُهَا وَ لِلْمَيِّتِ وَلَدٌ مِنْ غَيْرِ أُمِّ وَلَدِهِ أَ رَأَيْتَ إِنْ أَرَادَ الَّذِي تَزَوَّجَ أُمَّ الْوَلَدِ أَنْ يَتَزَوَّجَ ابْنَةَ سَيِّدِهَا الَّذِي أَعْتَقَهَا فَيَجْمَعَ بَيْنَهَا وَ بَيْنَ بِنْتِ سَيِّدِهَا الَّذِي أَعْتَقَهَا قَالَ لَا بَأْسَ بِذَلِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Abu Ayoub, from Sama’at who said, \n‘I asked Abu Abdullah<sup>asws</sup> about a man who married a mother of the children of a man. So her master died from her, and for the deceased was a child from other than the mother of his children. What is your<sup>asws</sup> view if the one who married the mother of the children if he were to marry the daughter of her master who had emancipated her, so that he would gather between her and the daughter of her master who had emancipated her?’ He<sup>asws</sup> said: ‘There is no problem with that’."}]}]}, "index": "al-kafi:5:3:35", "kind": "verse_list"}