{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 37"
        },
        "path": "/books/al-kafi:5:3:37",
        "titles": {
          "ar": "باب فِيمَا أَحَلَّهُ اللَّهُ عَزَّ وَ جَلَّ مِنَ النِّسَاءِ",
          "en": "Chapter 36 – Regarding what Allah<sup>azwj</sup> Mighty and Majestic has Permitted from the women"
        }
      }
    ],
    "index": 1408,
    "local_index": 37,
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:3:37",
    "titles": {
      "ar": "باب فِيمَا أَحَلَّهُ اللَّهُ عَزَّ وَ جَلَّ مِنَ النِّسَاءِ",
      "en": "Chapter 36 – Regarding what Allah<sup>azwj</sup> Mighty and Majestic has Permitted from the women"
    },
    "verse_count": 2,
    "verse_start_index": 9520,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/80)"
        ],
        "index": 9521,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:37:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ نُوحِ بْنِ شُعَيْبٍ وَ مُحَمَّدِ بْنِ الْحَسَنِ قَالَ سَأَلَ ابْنُ أَبِي الْعَوْجَاءِ هِشَامَ بْنَ الْحَكَمِ فَقَالَ لَهُ أَ لَيْسَ اللَّهُ حَكِيماً قَالَ بَلَى وَ هُوَ أَحْكَمُ الْحَاكِمِينَ قَالَ فَأَخْبِرْنِي عَنْ قَوْلِهِ عَزَّ وَ جَلَّ فَانْكِحُوا ما طابَ لَكُمْ مِنَ النِّساءِ مَثْنى وَ ثُلاثَ وَ رُباعَ فَإِنْ خِفْتُمْ أَلَّا تَعْدِلُوا فَواحِدَةً أَ لَيْسَ هَذَا فَرْضاً قَالَ بَلَى قَالَ فَأَخْبِرْنِي عَنْ قَوْلِهِ عَزَّ وَ جَلَّ وَ لَنْ تَسْتَطِيعُوا أَنْ تَعْدِلُوا بَيْنَ النِّساءِ وَ لَوْ حَرَصْتُمْ فَلا تَمِيلُوا كُلَّ الْمَيْلِ أَيُّ حَكِيمٍ يَتَكَلَّمُ بِهَذَا ",
          "فَلَمْ يَكُنْ عِنْدَهُ جَوَابٌ فَرَحَلَ إِلَى الْمَدِينَةِ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ يَا هِشَامُ فِي غَيْرِ وَقْتِ حَجٍّ وَ لَا عُمْرَةٍ قَالَ نَعَمْ جُعِلْتُ فِدَاكَ لِأَمْرٍ أَهَمَّنِي إِنَّ ابْنَ أَبِي الْعَوْجَاءِ سَأَلَنِي عَنْ مَسْأَلَةٍ لَمْ يَكُنْ عِنْدِي فِيهَا شَيْ‏ءٌ قَالَ وَ مَا هِيَ قَالَ فَأَخْبَرَهُ بِالْقِصَّةِ",
          "فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَمَّا قَوْلُهُ عَزَّ وَ جَلَّ فَانْكِحُوا ما طابَ لَكُمْ مِنَ النِّساءِ مَثْنى وَ ثُلاثَ وَ رُباعَ فَإِنْ خِفْتُمْ أَلَّا تَعْدِلُوا فَواحِدَةً يَعْنِي فِي النَّفَقَةِ وَ أَمَّا قَوْلُهُ وَ لَنْ تَسْتَطِيعُوا أَنْ تَعْدِلُوا بَيْنَ النِّساءِ وَ لَوْ حَرَصْتُمْ فَلا تَمِيلُوا كُلَّ الْمَيْلِ فَتَذَرُوها كَالْمُعَلَّقَةِ يَعْنِي فِي الْمَوَدَّةِ",
          "قَالَ فَلَمَّا قَدِمَ عَلَيْهِ هِشَامٌ بِهَذَا الْجَوَابِ وَ أَخْبَرَهُ قَالَ وَ اللَّهِ مَا هَذَا مِنْ عِنْدِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Nuh Bin Shuayb and Muhammad Bin Al Hassan who said, ",
            "‘Ibn Abu Al-Ajwa asked Hisham Bin Al-Hakam, so he said to him, ‘Is Allah<sup>azwj</sup> not All-Wise?’ He said, ‘Yes, and He<sup>azwj</sup> is the most Decisive of the Judges’. He said, ‘So inform me about the Words of the Mighty and Majestic <span class=\"ibTxt\">[4:3] then marry such women as seem good to you, two and three and four; but if you fear that you will not do justice (between them), then (marry) only one</span>, is this not an Obligation?’ He said, ‘Yes’. He said, ‘So inform me about the Words of the Mighty and Majestic <span class=\"ibTxt\">[4:129] And you have it not in your power to do justice between wives, even though you may wish (it), but be not disinclined (from one) with total disinclination</span>. Which Wise One would speak with this?’ ",
            "So there did not happen to be an answer with him. So he went to Al-Medina to Abu Abdullah<sup>asws</sup>, so he<sup>asws</sup> said: ‘O Hisham! (You have come) at such a time which is neither of Hajj nor of Umrah?’ He said, ‘Yes, May I be sacrificed for you<sup>asws</sup>! It has concerned me that Ibn Abu Al-Awja asked me a question for which there was no answer with me with regards to it’. He<sup>asws</sup> said: ‘And what is it?’ He said, ‘So I informed him<sup>asws</sup> of the story’. ",
            "So Abu Abdullah<sup>asws</sup> said: ‘As for the Words of the Mighty and Majestic <span class=\"ibTxt\">[4:3] then marry such women as seem good to you, two and three and four; but if you fear that you will not do justice (between them), then (marry) only one</span>, Meaning regarding the expenditure. And as for His<sup>azwj</sup> Words <span class=\"ibTxt\">[4:3] then marry such women as seem good to you, two and three and four; but if you fear that you will not do justice (between them), then (marry) only one</span>, <span class=\"ibTxt\">so that you leave her as it were in suspense</span>, so it is regarding the cordiality’. ",
            "He (the narrator) said, ‘So when Hisham proceeded to him with the answer and informed him, he said, ‘By Allah<sup>azwj</sup>! This is not from yourself’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Nuh ibn Shu’ayb and Muhammad ibn al-Hassan who has said the following: “Once, ibn abu al-‘Awja’ asked Hisham ibn al-Hakam, ’Is not Allah wise?’ Hisham ibn al-Hakam replied, ’Yes, He is. He is the most firm of the judges.’ He (ibn abu al-’Awja’) then asked, ’Tell me about the words of Allah, most Majestic, most Glorious, “Marry whomever of women you like, two, three or four and if you fear of failure to maintain justice then marry only one.” (4:3) Is not it obligatory?’ He replied, ‘Yes, it is.’ He then asked, ‘Tell me about the words of Allah, most Majestic, most Glorious, “You can never maintain justice among women no matter how strongly you desire, so do not incline completely to a particular side.” (4:128) What kind of a wise person makes such statements?’ Hisham ibn al-Hakam did not have an answer for it so he traveled to al-Madinah to abu ‘Abd Allah, ‘Alayhi al-Salam. He (the Imam) asked, ’O Hisham, this is not the season of Hajj or ‘Umrah.’ Hisham replied, ‘Yes, I pray to Allah to keep my soul in service for your cause, I have come for what is very important for me. Ibn abu al-‘Awja’ asked me a question and I did not have any answer to it.’ He (the Imam) asked, ‘What is the question?’ He explained the story and abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘The words of Allah, most Majestic, most Glorious, “Marry whomever of women you like, two, three or four and if you fear of failure to maintain justice then marry only one,” (4:3) are about maintenance and expenses and the words of Allah, most Majestic, most Glorious, “You can never maintain justice among women no matter how strongly you desire, so do not incline completely to a particular side to leave her in suspense,” (4:128) are about love.’ He (the narrator) has said that when Hisham ibn al-Hakam came back with this answer he (ibn abu al-‘Awja’) said, ‘By Allah, this is not from you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح موقوف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/80)"
        ],
        "index": 9522,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:37:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ هِشَامِ بْنِ الْحَكَمِ قَالَ إِنَّ اللَّهَ تَعَالَى أَحَلَّ الْفَرْجَ لِعِلَلِ مَقْدُرَةِ الْعِبَادِ فِي الْقُوَّةِ عَلَى الْمَهْرِ وَ الْقُدْرَةِ عَلَى الْإِمْسَاكِ فَقَالَ فَانْكِحُوا ما طابَ لَكُمْ مِنَ النِّساءِ مَثْنى وَ ثُلاثَ وَ رُباعَ فَإِنْ خِفْتُمْ أَلَّا تَعْدِلُوا فَواحِدَةً أَوْ ما مَلَكَتْ أَيْمانُكُمْ وَ قَالَ وَ مَنْ لَمْ يَسْتَطِعْ مِنْكُمْ طَوْلًا أَنْ يَنْكِحَ الْمُحْصَناتِ الْمُؤْمِناتِ فَمِنْ ما مَلَكَتْ أَيْمانُكُمْ مِنْ فَتَياتِكُمُ الْمُؤْمِناتِ وَ قَالَ فَمَا اسْتَمْتَعْتُمْ بِهِ مِنْهُنَّ فَآتُوهُنَّ أُجُورَهُنَّ فَرِيضَةً وَ لا جُناحَ عَلَيْكُمْ فِيما تَراضَيْتُمْ بِهِ مِنْ بَعْدِ الْفَرِيضَةِ",
          "فَأَحَلَّ اللَّهُ الْفَرْجَ لِأَهْلِ الْقُوَّةِ عَلَى قَدْرِ قُوَّتِهِمْ عَلَى إِعْطَاءِ الْمَهْرِ وَ الْقُدْرَةِ عَلَى الْإِمْسَاكِ أَرْبَعَةً لِمَنْ قَدَرَ عَلَى ذَلِكَ وَ لِمَنْ دُونَهُ بِثَلَاثٍ وَ اثْنَتَيْنِ وَ وَاحِدَةٍ وَ مَنْ لَمْ يَقْدِرْ عَلَى وَاحِدَةٍ تَزَوَّجَ مِلْكَ الْيَمِينِ وَ إِذَا لَمْ يَقْدِرْ عَلَى إِمْسَاكِهَا وَ لَمْ يَقْدِرْ عَلَى تَزْوِيجِ الْحُرَّةِ وَ لَا عَلَى شِرَاءِ الْمَمْلُوكَةِ فَقَدْ أَحَلَّ اللَّهُ تَزْوِيجَ الْمُتْعَةِ بِأَيْسَرِ مَا يَقْدِرُ عَلَيْهِ مِنَ الْمَهْرِ وَ لَا لُزُومِ نَفَقَةٍ",
          "وَ أَغْنَى اللَّهُ كُلَّ فَرِيقٍ مِنْهُمْ بِمَا أَعْطَاهُمْ مِنَ الْقُوَّةِ عَلَى إِعْطَاءِ الْمَهْرِ وَ الْجِدَةِ فِي النَّفَقَةِ عَنِ الْإِمْسَاكِ وَ عَنِ الْإِمْسَاكِ عَنِ الْفُجُورِ وَ إِلَّا يُؤْتَوْا مِنْ قِبَلِ اللَّهِ عَزَّ وَ جَلَّ فِي حُسْنِ الْمَعُونَةِ وَ إِعْطَاءِ الْقُوَّةِ وَ الدَّلَالَةِ عَلَى وَجْهِ الْحَلَالِ لَمَا أَعْطَاهُمْ مَا يَسْتَعِفُّونَ بِهِ عَنِ الْحَرَامِ فِيمَا أَعْطَاهُمْ وَ أَغْنَاهُمْ عَنِ الْحَرَامِ وَ بِمَا أَعْطَاهُمْ وَ بَيَّنَ لَهُمْ",
          "فَعِنْدَ ذَلِكَ وَضَعَ عَلَيْهِمُ الْحُدُودَ مِنَ الضَّرْبِ وَ الرَّجْمِ وَ اللِّعَانِ وَ الْفُرْقَةِ وَ لَوْ لَمْ يُغْنِ اللَّهُ كُلَّ فِرْقَةٍ مِنْهُمْ بِمَا جَعَلَ لَهُمُ السَّبِيلَ إِلَى وُجُوهِ الْحَلَالِ لَمَا وَضَعَ عَلَيْهِمْ حَدّاً مِنْ هَذِهِ الْحُدُودِ فَأَمَّا وَجْهُ التَّزْوِيجِ الدَّائِمِ وَ وَجْهُ مِلْكِ الْيَمِينِ فَهُوَ بَيِّنٌ وَاضِحٌ فِي أَيْدِي النَّاسِ لِكَثْرَةِ مُعَامَلَتِهِمْ بِهِ فِيمَا بَيْنَهُمْ وَ أَمَّا أَمْرُ الْمُتْعَةِ فَأَمْرٌ غَمَضَ عَلَى كَثِيرٍ لِعِلَّةِ نَهْيِ مَنْ نَهَى عَنْهُ وَ تَحْرِيمِهِ لَهَا وَ إِنْ كَانَتْ مَوْجُودَةً فِي التَّنْزِيلِ وَ مَأْثُورَةً فِي السُّنَّةِ الْجَامِعَةِ لِمَنْ طَلَبَ عِلَّتَهَا وَ أَرَادَ ذَلِكَ",
          "فَصَارَ تَزْوِيجُ الْمُتْعَةِ حَلَالًا لِلْغَنِيِّ وَ الْفَقِيرِ لِيَسْتَوِيَا فِي تَحْلِيلِ الْفَرْجِ كَمَا اسْتَوَيَا فِي قَضَاءِ نُسُكِ الْحَجِّ مُتْعَةِ الْحَجِّ فَمَا اسْتَيْسَرَ مِنَ الْهَدْيِ لِلْغَنِيِّ وَ الْفَقِيرِ فَدَخَلَ فِي هَذَا التَّفْسِيرِ الْغَنِيُّ لِعِلَّةِ الْفَقِيرِ وَ ذَلِكَ أَنَّ الْفَرَائِضَ إِنَّمَا وُضِعَتْ عَلَى أَدْنَى الْقَوْمِ قُوَّةً لِيَسَعَ الْغَنِيَّ وَ الْفَقِيرَ وَ ذَلِكَ لِأَنَّهُ غَيْرُ جَائِزٍ أَنْ يُفْرَضَ الْفَرَائِضُ عَلَى قَدْرِ مَقَادِيرِ الْقَوْمِ فَلَا يُعْرَفُ قُوَّةُ الْقَوِيِّ مِنْ ضَعْفِ الضَّعِيفِ وَ لَكِنْ وُضِعَتْ عَلَى قُوَّةِ أَضْعَفِ الضُّعَفَاءِ",
          "ثُمَّ رَغِبَ الْأَقْوِيَاءُ فَسَارَعُوا فِي الْخَيْرَاتِ بِالنَّوَافِلِ بِفَضْلِ الْقُوَّةِ فِي الْأَنْفُسِ وَ الْأَمْوَالِ وَ الْمُتْعَةُ حَلَالٌ لِلْغَنِيِّ وَ الْفَقِيرِ لِأَهْلِ الْجِدَةِ مِمَّنْ لَهُ أَرْبَعٌ وَ مِمَّنْ لَهُ مِلْكُ الْيَمِينِ مَا شَاءَ كَمَا هِيَ حَلَالٌ لِمَنْ يَجِدُ إِلَّا بِقَدْرِ مَهْرِ الْمُتْعَةِ وَ الْمَهْرُ مَا تَرَاضَيَا عَلَيْهِ فِي حُدُودِ التَّزْوِيجِ لِلْغَنِيِّ وَ الْفَقِيرِ قَلَّ أَوْ كَثُرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Hisham Bin Al Hakam who said, ",
            "‘He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> the High Permitted the private parts based upon the ability of the servant with regards to the strength upon (payment of) the dower, and the ability upon the keeping, so He<sup>azwj</sup> Said: ‘<span class=\"ibTxt\">[4:3] then marry such women as seem good to you, two and three and four; but if you fear that you will not do justice (between them), then (marry) only one or what your right hands possess</span>; and He<sup>azwj</sup> Said: ‘<span class=\"ibTxt\">[4:25] And whoever among you has not within his power ampleness of means to marry free believing women, then (he may marry) of those whom your right hands possess from among your believing maidens</span>; and Said <span class=\"ibTxt\">[4:24] Then as to those whom you enjoy with, give them their dowries as appointed; and there is no blame on you about what you mutually agree after what is appointed</span>.",
            "Thus, Allah<sup>azwj</sup> Permitted the private parts for the people of the (financial) strength upon the ability of their strength for giving the dower and the ability upon the keeping four (wives) for the one who is able upon that; and for the one who is below that, with three, and the two, and the one; and the one who is not able upon one (wife) he should marry the possession of the right hand (slave girl). And when he is not able upon keeping her and is not able upon marrying the free woman nor upon buying the slave girl, so Allah<sup>azwj</sup> has Permitted the temporary marriage with its ease of what it can be abled upon, from the dower, and the expenditure is not necessitated.",
            "And Allah<sup>azwj</sup> Makes self-sufficient each group from them with whatever they give them from the livelihood upon giving the dower and the ability regarding the expenses about the keeping (a wife), and from the restrain from the immoralities, otherwise they would be Given from Allah<sup>azwj</sup> Mighty and Majestic with regards to the goodly Assistance, and would be Given the (financial) strength, and they would be Pointed towards the Permissible aspect due to what He<sup>azwj</sup> Gives them what would make them chaste by it from the Prohibitions in what He<sup>azwj</sup> has Gvien them and Made them to be needless from the Prohibitions, and Clarified that for them.",
            "Thus, during that, He<sup>azwj</sup> Placed the Legal punishments (<span class=\"iTxt\">Hadd</span>) upon them, from the whipping, and the stoning, and the Cursing, and the separation; and had Allah<sup>azwj</sup> not Made self-sufficient each group from them with what He<sup>azwj</sup> has Made a way to be for them to the Permissible aspect he would not have Placed a Legal punishment (<span class=\"iTxt\">Hadd</span>) from these Legal punishments upon them. So, as for the aspect of the permanent marriage and the aspect of the possession of the right hand (slave girl), so its proof is clear in the hands of the people due to the frequency of their dealing with it with regards to what is between them. And as for the matter of the temporary marriage, so it is an ambiguous upon a lot (of people) due to the reason of the forbidding of the one who forbid from it (Umar Bin Al-Khattab), and prohibited for it even though it existed in the Revelation and Ahadeeth in the universal Sunnah, for the one who seeks its reasons and intends that.",
            "Therefore, the temporary marriage came to be Permissible for the rich and the poor, having been equalized regarding the Permissibility of the private parts just as they were equalized with regards to the rituals of the Hajj, the Mut’a of Hajj, thus whatever is easier from the sacrifice for the rich and the poor. Thus, the rich got included in this interpretation due to the reason of the poor ones, and that is that the Obligations, rather, have been Placed upon the lowest of the people in strength giving leeway to the rich and the poor; and that is because it is not allowed that an Obligation be Obligated based upon the strength of the people, as the strengths of the individual people cannot be recognized, the strength of the strong from the strength of the weak, but these have been Placed based upon the strength of the weakest of the weak.",
            "Then the strong ones were urged, so they rushed regarding the goodness with the optional (Prayers) due to their being with extra strength in themselves, and the wealth. And the temporary marriage is Permissible for the rich and the poor, for the people of the strength from the ones for whom are four wives, and from the ones for his is the possession of the right hand (slave girl), whoever desires so, just as it is Permissible for the one who cannot find except for the strength for a dower for the temporary marriage, and the dower is whatever she is pleased upon within the limits of the marriage, for the rich and the poor, be it little or more’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from Hisham ibn al-Hakam who has said the following: “He (the Imam), ‘Alayhi al-Salam, has said, ‘Allah, most High has made marriage lawful on the basis of His servants’ ability to pay mahr (dower) and their ability to provide maintenance, so He has said, “Marry whomever of women you like, two, three or four and if you fear of failure to maintain justice then marry only one or a slave-girl that you own.” (4:3) Allah has also said, “Anyone of you who is not able to pay mahr (dower) to marry chaste believing woman he can marry of the slave-girls that you own of the young believing woman.” (4:128) Allah has said, “If you seek advantage from the women then pay their compensation as an obligation and it is not unlawful if you settle among yourselves.” (4:24) Allah has made marriage lawful for those who are able to pay mahr (dower) according to their financial resources and their ability to provide maintenance for four or for three or two or just one. Those who cannot provide expenses for one they can marry slave-girls whom they own. If one cannot maintain women, marry free women or buy a slave-girl; Allah has made al-Mut‘ah lawful by means of whatever is easy of mahr (dower) to pay in which providing maintenance and all expenses is not necessary. Allah makes each one self-sufficient by means of whatever He has given them in the form of their abilities to pay mahr (dower) with (or without) constraint in expenses for maintenance and the ability to refrain from indecent activities and the ability to refrain. From Allah, most Majestic, most Glorious, are good resources, capabilities and guidance to lawful goals by means of what He has given them so they can maintain chastity, remain away from unlawful matters by means of what He has given them and has made them free of needing unlawful matters and by whatever He has given them and has explained to them. Thus He has set limits upon them, like punishment by lashing and stoning, Li ‘an (condemnation) and separation. Had Allah not met the needs of each group by the resources that are made available to them and the lawful ways He would not set any of such limitation upon them. “The permanent manner of marriage and owning slave-girls are well-known among people because of being practiced so often. The issue of al-Mut‘ah is not clear for many people because of the prohibition of the One who prohibited it even though permission for it exists in the revelation (al- Quran) and is mentioned in the universal Sunnah for those who may like to find the reason and like to know it. Marriage in the manner of al-Mut‘ah is permissible for rich and poor with equal measure of lawfulness of marriage as they are equal in completing the obligation of al-Hajj and al-Mut‘ah in al- Hajj. The offering animal is for both rich and poor to offer. In this respect rich and poor are equal. It is because obligatory matters are sanctioned on the basis of the ability of those with the least amount of abilities to include both rich and poor. It is not fair to sanction obligatory matters on the basis of the abilities of people, otherwise, weakness and strength become confused. They are sanctioned on the basis of the least amount of abilities, thereafter the stronger ones are exhorted to compete in good deeds in optional matters because of their strength in their persons and wealth. Al-Mut‘ah is lawful for rich and poor, for those with limited abilities and for those with four wives or those who are married with slave-girls, if one likes. It is lawful for those who can only find enough for mahr (dower) of al- Mut‘ah and mahr (dower) is whatever they agree on within the limits of marriage for rich and poor regardless of being very little or a great deal.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:3:37",
  "kind": "verse_list"
}