{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 44"
        },
        "path": "/books/al-kafi:5:3:44",
        "titles": {
          "ar": "باب خُطَبِ النِّكَاحِ",
          "en": "Chapter 43 – Sermon of the marriage"
        }
      }
    ],
    "index": 1415,
    "local_index": 44,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 45"
        },
        "path": "/books/al-kafi:5:3:45",
        "titles": {
          "ar": "باب السُّنَّةِ فِي الْمُهُورِ ",
          "en": "Chapter 44 – The Sunnah regarding the dowries"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 43"
        },
        "path": "/books/al-kafi:5:3:43",
        "titles": {
          "ar": "باب التَّزْوِيجِ بِغَيْرِ خُطْبَةٍ",
          "en": "Chapter 42 – The marriage without a sermon"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:3:44",
    "titles": {
      "ar": "باب خُطَبِ النِّكَاحِ",
      "en": "Chapter 43 – Sermon of the marriage"
    },
    "verse_count": 9,
    "verse_start_index": 9541,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/88)"
        ],
        "index": 9542,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:44:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ جَمَاعَةً مِنْ بَنِي أُمَيَّةَ فِي إِمَارَةِ عُثْمَانَ اجْتَمَعُوا فِي مَسْجِدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فِي يَوْمِ جُمُعَةٍ وَ هُمْ يُرِيدُونَ أَنْ يُزَوِّجُوا رَجُلًا مِنْهُمْ وَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) قَرِيبٌ مِنْهُمْ فَقَالَ بَعْضُهُمْ لِبَعْضٍ هَلْ لَكُمْ أَنْ نُخْجِلَ عَلِيّاً السَّاعَةَ نَسْأَلُهُ أَنْ يَخْطُبَ بِنَا وَ نَتَكَلَّمُ فَإِنَّهُ يَخْجَلُ وَ يَعْيَا بِالْكَلَامِ فَأَقْبَلُوا إِلَيْهِ فَقَالُوا يَا أَبَا الْحَسَنِ إِنَّا نُرِيدُ أَنْ نُزَوِّجَ فُلَاناً فُلَانَةَ وَ نَحْنُ نُرِيدُ أَنْ تَخْطُبَ بِنَا فَقَالَ فَهَلْ تَنْتَظِرُونَ أَحَداً فَقَالُوا لَا",
          "فَوَ اللَّهِ مَا لَبِثَ حَتَّى قَالَ الْحَمْدُ لِلَّهِ الْمُخْتَصِّ بِالتَّوْحِيدِ الْمُتَقَدِّمِ بِالْوَعِيدِ الْفَعَّالِ لِمَا يُرِيدُ الْمُحْتَجِبِ بِالنُّورِ دُونَ خَلْقِهِ ذِي الْأُفُقِ الطَّامِحِ وَ الْعِزِّ الشَّامِخِ وَ الْمُلْكِ الْبَاذِخِ الْمَعْبُودِ بِالْآلَاءِ رَبِّ الْأَرْضِ وَ السَّمَاءِ أَحْمَدُهُ عَلَى حُسْنِ الْبَلَاءِ وَ فَضْلِ الْعَطَاءِ وَ سَوَابِغِ النَّعْمَاءِ وَ عَلَى مَا يَدْفَعُ رَبُّنَا مِنَ الْبَلَاءِ حَمْداً يَسْتَهِلُّ لَهُ الْعِبَادُ وَ يَنْمُو بِهِ الْبِلَادُ وَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَمْ يَكُنْ شَيْ‏ءٌ قَبْلَهُ وَ لَا يَكُونُ شَيْ‏ءٌ بَعْدَهُ",
          "وَ أَشْهَدُ أَنَّ مُحَمَّداً ( صلى الله عليه وآله ) عَبْدُهُ وَ رَسُولُهُ اصْطَفَاهُ بِالتَّفْضِيلِ وَ هَدَى بِهِ مِنَ التَّضْلِيلِ اخْتَصَّهُ لِنَفْسِهِ وَ بَعَثَهُ إِلَى خَلْقِهِ بِرِسَالَاتِهِ وَ بِكَلَامِهِ يَدْعُوهُمْ إِلَى عِبَادَتِهِ وَ تَوْحِيدِهِ وَ الْإِقْرَارِ بِرُبُوبِيَّتِهِ وَ التَّصْدِيقِ بِنَبِيِّهِ ( صلى الله عليه وآله ) بَعَثَهُ عَلَى حِينِ فَتْرَةٍ مِنَ الرُّسُلِ وَ صَدْفٍ عَنِ الْحَقِّ وَ جَهَالَةٍ بِالرَّبِّ وَ كُفْرٍ بِالْبَعْثِ وَ الْوَعِيدِ فَبَلَّغَ رِسَالَاتِهِ وَ جَاهَدَ فِي سَبِيلِهِ وَ نَصَحَ لِأُمَّتِهِ وَ عَبَدَهُ حَتَّى أَتَاهُ الْيَقِينُ صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ وَ سَلَّمَ كَثِيراً  ",
          "أُوصِيكُمْ وَ نَفْسِي بِتَقْوَى اللَّهِ الْعَظِيمِ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ قَدْ جَعَلَ لِلْمُتَّقِينَ الْمَخْرَجَ مِمَّا يَكْرَهُونَ وَ الرِّزْقَ مِنْ حَيْثُ لَا يَحْتَسِبُونَ فَتَنَجَّزُوا مِنَ اللَّهِ مَوْعُودَهُ وَ اطْلُبُوا مَا عِنْدَهُ بِطَاعَتِهِ وَ الْعَمَلِ بِمَحَابِّهِ فَإِنَّهُ لَا يُدْرَكُ الْخَيْرُ إِلَّا بِهِ وَ لَا يُنَالُ مَا عِنْدَهُ إِلَّا بِطَاعَتِهِ وَ لَا تُكْلَانَ فِيمَا هُوَ كَائِنٌ إِلَّا عَلَيْهِ وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ",
          "أَمَّا بَعْدُ فَإِنَّ اللَّهَ أَبْرَمَ الْأُمُورَ وَ أَمْضَاهَا عَلَى مَقَادِيرِهَا فَهِيَ غَيْرُ مُتَنَاهِيَةٍ عَنْ مَجَارِيهَا دُونَ بُلُوغِ غَايَاتِهَا فِيمَا قَدَّرَ وَ قَضَى مِنْ ذَلِكَ وَ قَدْ كَانَ فِيمَا قَدَّرَ وَ قَضَى مِنْ أَمْرِهِ الْمَحْتُومِ وَ قَضَايَاهُ الْمُبْرَمَةِ مَا قَدْ تَشَعَّبَتْ بِهِ الْأَخْلَافُ وَ جَرَتْ بِهِ الْأَسْبَابُ وَ قَضَى مِنْ تَنَاهِي الْقَضَايَا بِنَا وَ بِكُمْ إِلَى حُضُورِ هَذَا الْمَجْلِسِ الَّذِي خَصَّنَا اللَّهُ وَ إِيَّاكُمْ لِلَّذِي كَانَ مِنْ تَذَكُّرِنَا آلَاءَهُ وَ حُسْنَ بَلَائِهِ وَ تَظَاهُرَ نَعْمَائِهِ",
          "فَنَسْأَلُ اللَّهَ لَنَا وَ لَكُمْ بَرَكَةَ مَا جَمَعَنَا وَ إِيَّاكُمْ عَلَيْهِ وَ سَاقَنَا وَ إِيَّاكُمْ إِلَيْهِ ثُمَّ إِنَّ فُلَانَ بْنَ فُلَانٍ ذَكَرَ فُلَانَةَ بِنْتَ فُلَانٍ وَ هُوَ فِي الْحَسَبِ مَنْ قَدْ عَرَفْتُمُوهُ وَ فِي النَّسَبِ مَنْ لَا تَجْهَلُونَهُ وَ قَدْ بَذَلَ لَهَا مِنَ الصَّدَاقِ مَا قَدْ عَرَفْتُمُوهُ فَرُدُّوا خَيْراً تُحْمَدُوا عَلَيْهِ وَ تُنْسَبُوا إِلَيْهِ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ آلِهِ وَ سَلَّمَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from Ali Bin Raib, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A group from the Clan of Umayyad, during the emirate of Usman, gathered together in the Masjid of Rasool-Allah<sup>saww</sup> on the day of Friday, and they wanted to solemnise the marriage of a man from them, and Amir Al-Momineen<sup>asws</sup> was nearby them. So some of them said to the others, ‘Is it ok with you all if we go to shame Ali<sup>asws</sup> at this time, asking him<sup>asws</sup> that he addresses us, and we would keep on talking, so he<sup>asws</sup> would be thwarted from the speaking?’ So they agreed and came over to him<sup>asws</sup> and they said, ‘O Abu Al-Hassan<sup>asws</sup>! We want to solemnize the marriage of so and so man to so and so woman, and we wanted that you<sup>asws</sup> should address us’. So he<sup>asws</sup> said: ‘Are you awaiting anyone (else)?’ They said, ‘No’. ",
            "So, by Allah<sup>azwj</sup>, it was not long until he<sup>asws</sup> said: ‘The Praise is for Allah<sup>azwj</sup>, the One Particularised with the Oneness. He<sup>azwj</sup> Proceeds with the Warning, the Doer of whatever He<sup>azwj</sup> so Wants to, the One Veiled by the Light from His<sup>azwj</sup> Creatures, The One with Lofty Horizons, and the Powerful Esteem, and the luxurious Kingdom worshipped for its Bounties, the Lord<sup>azwj</sup> of the earth and the sky. I<sup>asws</sup> Praise Him<sup>azwj</sup> upon the beauty of the afflictions, and the Grace of the Grants, and the Opulent Bounties, and upon what our Lord<sup>azwj</sup> has Defended us all from the afflictions; with a Praise which the servants are Permitted for and the cities thrive, and I<sup>asws</sup> testify that there is no god except for Allah<sup>azwj</sup>, One, there being no associates for Him<sup>azwj</sup>. There was never a thing before Him<sup>azwj</sup> nor would they be anything after Him<sup>azwj</sup>.",
            "And I<sup>asws</sup> testify that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Rasool<sup>saww</sup>, having Chosen him<sup>saww</sup> with the preference, and Guided by him<sup>saww</sup> from the darkness, having Chosen him<sup>saww</sup> Himself<sup>azwj</sup>, and Sent him<sup>saww</sup> to His<sup>azwj</sup> creatures with His<sup>azwj</sup> Message and with His<sup>azwj</sup> Speech Inviting them to His<sup>azwj</sup> worship, and His<sup>azwj</sup> Oneness, and the acceptance with His<sup>azwj</sup> Lordship, and the ratification with his<sup>saww</sup> Prohet-hood having Sent him<sup>saww</sup> after an interval from the Rasools<sup>as</sup>, (to people) having turned away from the Truth and being ignorant with the Lord<sup>azwj</sup> and disbelieved with the Sending and the Promised threat. So, he<sup>saww</sup> delivered His<sup>azwj</sup> Message and strived in His<sup>azwj</sup> Way, and advised his<sup>saww</sup> community and His<sup>azwj</sup> servants until the conviction came to them. May Blessings be upon him<sup>saww</sup> and his<sup>saww</sup> Progeny<sup>asws</sup>, and abundant greetings.",
            "I<sup>asws</sup> hereby advise you all and myself<sup>asws</sup> with the fear of Allah<sup>azwj</sup> the Magnificent, for Allah<sup>azwj</sup> Mighty and Majestic has Made the way out for the pious ones from what they are disliking, and the sustenance from where there are not reckoning. Therefore, accomplish from Allah<sup>azwj</sup>, His<sup>azwj</sup> Promise, and seek what is with Him<sup>azwj</sup> with being obedient to Him<sup>azwj</sup> and the deeds which He<sup>azwj</sup> Loves, for the goodness cannot be realised except with Him<sup>azwj</sup>, nor can it be attained, that which is with Him<sup>azwj</sup>, except with being obedient to Him<sup>azwj</sup>; and there is no reliance (for Protection) regarding what is going to transpire except upon Him<sup>azwj</sup>, and there is neither Might nor Strength except with Allah<sup>azwj</sup>.",
            "Thereafter, so Allah<sup>azwj</sup> Endorsed the matters and Placed them upon their measurement, so it cannot be that they would end up in their flowing besides reaching its peak regarding what has been Measured (for it) and Judged from that. And it is such from what has been Measured and Judged, from His<sup>azwj</sup> Definite matters and His<sup>azwj</sup> Endorsed Judgement, what the successors<sup>asws</sup> branched out with, and the causes flowed with; and a Judgement which reached conclusion is the Judgement with us<sup>asws</sup> and you all to be present in this gathering which Allah<sup>azwj</sup> has Specialised us<sup>asws</sup> and you all from which we<sup>asws</sup> would be mentioning Him<sup>azwj</sup>, and the beauty of His<sup>azwj</sup> Trials, and the manifestation His<sup>azwj</sup> Bounties.",
            "Thus, we<sup>asws</sup> ask Allah<sup>azwj</sup> for us<sup>asws</sup> and for you all, for it being a Blessing, having Gathered us<sup>asws</sup> and you to, and Drove us<sup>asws</sup> and you to. Then, so and so male, son of so and so, and so and so female, daughter of so and so, and he is in the lineage which you have recognised and in the nobility which you are not ignorant of, and the dower having extended to him, what you have recognised, so may there be goodness be upon it and be linked to it. May Blessings be upon Muhammad<sup>saww</sup> and his<sup>saww</sup> Progeny<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn Mahbub from ibn Ri’ab who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that one day a group of banu ‘Umayyah during the time of the government of ‘Uthman came together in Masjid of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, on a Friday and they wanted to solemnize marriage for one of their people and ’Amir al-Mu’minin, Alayhi al-Salam, was nearby. They said to each other. If you want to embarrass Ali, call him now to give a speech and we will keep talking. He will feel embarrassed and will not be able to speak. They went to him (the Imam) and said, ‘O abu al-Hassan we want you to deliver for us a speech.’ He (the Imam) asked, ’Are you waiting for someone?’ They replied, ’No, we are not waiting for anyone.’ He (the Imam) by Allah, without delay said, ‘All praise belongs to Allah who is special in oneness, who advances with warning, who does whatever He wants, who is curtained with light from His creatures, who has aspiring horizon, who in mystification is lofty, whose Kingdom is high and is worshipped for His bounties, Lord of the earth and sky. I praise Him for His good trial, generous charity, and abundant favor and for our Lord’s diverting afflictions from us. I praise Him in a way that servants worship Him, lands become fertile and I testify that no one deserves worship except Allah alone who has no partner. There was nothing before Him and there will be nothing after Him. I testify that Muhammad, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, is His servant and His Messenger whom He chose with excellence and guided through him people from straying. He chose him especially for Himself and sent him to His creatures with His message, and statements. He calls people to worship Him, believe in His oneness, and acknowledge that He is the Lord and confirm that he is His Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, whom He has sent at a time of lapse of the presence of the messengers of Allah among people, when people had turned away from the truth, had become ignorant about their Lord, denied the resurrection and warnings. He delivered His message, strove hard for His cause, gave good advice to his followers and worshipped Him until death approached him, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, a great deal. I advise you and myself to become pious before Allah, most Great. Allah, most Majestic, most Glorious, has assigned a way out for the pious ones out of what they dislike, and sustenance from sources that they do not expect. So complete the promise of Allah and seek what is with Him through worshipping Him and working for what He loves because goodness cannot be achieved without Him and nothing that is with Him can be achieved without obeying Him. There is no protection against the creatures except His protection and there is no means and power without the power of Allah. ‘Thereafter, Allah has settled things and has approved them in measures and they do not stop in their channels without reaching their goals as they are determined for them. Of the things He had determined of His inevitable issues and His decisions measured and determined is that the successors come in branches and the means continue. He has determined the end of issues to take place about us and you to be present here in this gathering for which He has given us the opportunity that we speak of His bounties and of His good trial and describe His blessings. We ask blessings from Allah for you and for us. It is the blessing which has made us to come together here for its benefits. Thereafter, so and so has mentioned so and so and he as far as his status is as you know him and as matters of genealogy is not unknown to you. He has paid mahr (dower) of an amount that you know so return good, you will be praised for it and ascribe to it (good), O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/90)"
        ],
        "index": 9543,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:44:2",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ أَيْمَنَ بْنِ مُحْرِزٍ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ زَوَّجَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) امْرَأَةً مِنْ بَنِي عَبْدِ الْمُطَّلِبِ وَ كَانَ يَلِي أَمْرَهَا فَقَالَ الْحَمْدُ لِلَّهِ الْعَزِيزِ الْجَبَّارِ الْحَلِيمِ الْغَفَّارِ الْوَاحِدِ الْقَهَّارِ الْكَبِيرِ الْمُتَعَالِ سَواءٌ مِنْكُمْ مَنْ أَسَرَّ الْقَوْلَ وَ مَنْ جَهَرَ بِهِ وَ مَنْ هُوَ مُسْتَخْفٍ بِاللَّيْلِ وَ سارِبٌ بِالنَّهارِ ",
          "أَحْمَدُهُ وَ أَسْتَعِينُهُ وَ أُومِنُ بِهِ وَ أَتَوَكَّلُ عَلَيْهِ وَ كَفَى بِاللَّهِ وَكِيلًا مَنْ يَهْدِ اللَّهُ فَهُوَ الْمُهْتَدِي وَ لَا مُضِلَّ لَهُ وَ مَنْ يُضْلِلْ فَلَا هَادِيَ لَهُ وَ لَنْ تَجِدَ مِنْ دُونِهِ وَلِيّاً مُرْشِداً ",
          "وَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَ لَهُ الْحَمْدُ وَ هُوَ عَلَى كُلِّ شَيْ‏ءٍ قَدِيرٌ وَ أَشْهَدُ أَنَّ مُحَمَّداً ( صلى الله عليه وآله ) عَبْدُهُ وَ رَسُولُهُ بَعَثَهُ بِكِتَابِهِ حُجَّةً عَلَى عِبَادِهِ مَنْ أَطَاعَهُ أَطَاعَ اللَّهَ وَ مَنْ عَصَاهُ عَصَى اللَّهَ ",
          "صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ وَ سَلَّمَ كَثِيراً إِمَامُ الْهُدَى وَ النَّبِيُّ الْمُصْطَفَى ثُمَّ إِنِّي أُوصِيكُمْ بِتَقْوَى اللَّهِ فَإِنَّهَا وَصِيَّةُ اللَّهِ فِي الْمَاضِينَ وَ الْغَابِرِينَ ثُمَّ تَزَوَّجَ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ismail Bin Mihran, from Ayman Bin Muhraz, from Amro Bin Shimr, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> solemnised the marriage of a woman from the Clan of Abdul Muttalib<sup>as</sup>, and he<sup>asws</sup> was in charge of her matter, so he<sup>asws</sup> said: ‘The Praise is for Allah<sup>azwj</sup>, the Mighty, the Compeller, the Lenient, the Forgiver, and One, the Subduer, the Great, the Limitless. It is the same from you all, the one who speaks secretly and the one who publicises with it, and the one who is concealed at night, and the one is visible by the day. ",
            "I<sup>asws</sup> Praise Him<sup>azwj</sup>, and seek His<sup>azwj</sup> Support, and believe in Him<sup>azwj</sup>, and rely upon Him<sup>azwj</sup>, and suffice with Allah<sup>azwj</sup> as a Representative. The one whom Allah<sup>azwj</sup> Guides, so he is the guided one and there is no straying for him, and the one who He<sup>azwj</sup> Lets to stray, so there is no guidance for him. And you will never find besides Him<sup>azwj</sup>, a Guardian, and a Guide.  ",
            "And I<sup>asws</sup> testify that there is no god except for Allah<sup>azwj</sup>, One, there being no associates for Him<sup>azwj</sup>. For Him<sup>azwj</sup> is the Kingdom, and for Him<sup>azwj</sup> is the Praise, and He<sup>azwj</sup> is Able upon everything. And I<sup>asws</sup> testify that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Rasool<sup>saww</sup>, having Sent him<sup>saww</sup> with His<sup>azwj</sup> Book, a proof upon His<sup>azwj</sup> servants. The one who obeys him<sup>saww</sup> would have obeyed Allah<sup>azwj</sup>, and the one who disobeys him<sup>saww</sup> would have disobeyed Allah<sup>azwj</sup>. ",
            "Blessings me upon him<sup>saww</sup> and his<sup>saww</sup> Progeny<sup>asws</sup>, and abundant greetings, and Imam<sup>asws</sup> of the Guidance, and the Chosen Prophet<sup>saww</sup>. Then, I<sup>asws</sup> hereby advise you all with the fear of Allah<sup>azwj</sup>, for it was an Advice of Allah<sup>azwj</sup> in the past and the bygone (days)’. Then he<sup>asws</sup> solemnised the marriage’."
          ],
          "en.sarwar": [
            "2. Ahmad ibn Muhammad has narrated from ‘Isma’il ibn Mehran from ’Ayman ibn Muhriz from ‘Amr ibn Shamir from Jabir who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin once gave a woman from banu ‘ Abd al-Muttalib in marriage, solemnized her marriage and said, ‘All praise belongs to Allah, most Majestic, most Powerful, the Forbearing, the Forgiving, the one Dominant, the most Great, most High - no matter whatever anyone of you says of words in secrecy or in public, when hidden in the night or conspicuous in the day - 1 praise Him, ask assistance from Him, believe in Him, and place my trust with Him; Allah is sufficient legal representative. Whomever Allah guides no one is able to mislead him and whomever Allah causes to go astray, no one is able to guide him and you can never find anyone other than Him as true guide. I testify that no one deserves worship except Allah alone who has no partners, the kingdom belongs to Him and all praise and He has power over all things. I testify that Muhammad, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, is His servant and His Messenger whom He sent with His book and Authority over His servants. Whoever obeys him has obeyed Allah and one has disobeyed Allah if he has disobeyed him, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and peace a great deal. He is the Imam of guidance and the chosen prophet. I thereafter advise you to become pious before Allah; it is the advice from Allah in the past and bygone.’ Then he (the Imam) pronounced them wife and husband.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/90)"
        ],
        "index": 9544,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:44:3",
        "text": [
          "أَحْمَدُ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي الْحَارِثِ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ خَطَبَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) بِهَذِهِ الْخُطْبَةِ فَقَالَ الْحَمْدُ لِلَّهِ أَحْمَدُهُ وَ أَسْتَعِينُهُ وَ أَسْتَغْفِرُهُ وَ أَسْتَهْدِيهِ وَ أُومِنُ بِهِ وَ أَتَوَكَّلُ عَلَيْهِ وَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَشْهَدُ أَنَّ مُحَمَّداً ( صلى الله عليه وآله ) عَبْدُهُ وَ رَسُولُهُ أَرْسَلَهُ بِالْهُدَى وَ دِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ دَلِيلًا عَلَيْهِ وَ دَاعِياً إِلَيْهِ ",
          "فَهَدَمَ أَرْكَانَ الْكُفْرِ وَ أَنَارَ مَصَابِيحَ الْإِيمَانِ مَنْ يُطِعِ اللَّهَ وَ رَسُولَهُ يَكُنْ سَبِيلُ الرَّشَادِ سَبِيلَهُ وَ نُورُ التَّقْوَى دَلِيلَهُ وَ مَنْ يَعْصِ اللَّهَ وَ رَسُولَهُ يُخْطِئِ السَّدَادَ كُلَّهُ وَ لَنْ يَضُرَّ إِلَّا نَفْسَهُ ",
          "أُوصِيكُمْ عِبَادَ اللَّهِ بِتَقْوَى اللَّهِ وَصِيَّةَ مَنْ نَاصَحَ وَ مَوْعِظَةَ مَنْ أَبْلَغَ وَ اجْتَهَدَ أَمَّا بَعْدُ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ جَعَلَ الْإِسْلَامَ صِرَاطاً مُنِيرَ الْأَعْلَامِ مُشْرِقَ الْمَنَارِ فِيهِ تَأْتَلِفُ الْقُلُوبُ وَ عَلَيْهِ تَآخَى الْإِخْوَانُ وَ الَّذِي بَيْنَنَا وَ بَيْنَكُمْ مِنْ ذَلِكَ ثَابِتٌ وُدُّهُ وَ قَدِيمٌ عَهْدُهُ مَعْرِفَةٌ مِنْ كُلٍّ لِكُلٍّ لِجَمِيعِ الَّذِي نَحْنُ عَلَيْهِ يَغْفِرُ اللَّهُ لَنَا وَ لَكُمْ وَ السَّلَامُ عَلَيْكُمْ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad, from Ismail Bin Mihran who said, ‘Abdul Malik Bin Abu Al Haris narrated to us, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> addressed with this sermon, so he<sup>asws</sup> said: ‘The Praise is for Allah<sup>azwj</sup>. I<sup>asws</sup> Praise Him<sup>asws</sup>, and seek His<sup>azwj</sup> Support, and seek His<sup>azwj</sup> Forgiveness, and seek His<sup>azwj</sup> Guidance, and believe in Him<sup>azwj</sup>, and rely upon Him<sup>saww</sup>. And I<sup>asws</sup> testify that there is no god except for Allah<sup>azwj</sup>, One, there being no associates for Him<sup>azwj</sup>. And I<sup>asws</sup> testify that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Rasool<sup>saww</sup>, having Sent him<sup>saww</sup> with the Guidance and the True Religion, in order to Make it to prevail over the Religions, all of them, evidencing to Him<sup>azwj</sup>, and calling to Him<sup>azwj</sup>. ",
            "So He<sup>azwj</sup> Pulverised the pillars of the disbelief and Illuminated the lanterns of the belief. The one who obeys Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>, his way would become the way of true guidance and the light of piety would be his evidence; and the one who disobeys Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>, would miss the paths altogether and would never harm anyone except for himself. ",
            "I<sup>asws</sup> hereby advise you, servants of Allah<sup>azwj</sup>, with the fear of Allah<sup>asws</sup>, being an advice of an adviser, and a preaching of the one who delivers and strives. Thereafter, Allah<sup>azwj</sup> Mighty and Majestic Made Al-Islam as the enlightened path wherein are sparkling flags<sup>asws</sup>. The hearts gather therein and upon it the brethren become brothers; and that which is between us<sup>asws</sup> and you from that, is constant cordiality, and an ancient Covenant. Everyone recognises everyone to the entirety of that which we<sup>asws</sup> are upon. May Allah<sup>azwj</sup> Forgive us<sup>asws</sup> and you, and the greetings to you all, and Mercy of Allah<sup>azwj</sup> and His<sup>azwj</sup> Blessings’."
          ],
          "en.sarwar": [
            "3. Ahmad ibn ‘Isma’il ibn Mehran has said that narrated to us ‘Abd al-Malik ibn abu al-Harith from Jabir who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin, ‘Alayhi al-Salam, once addressed with the following speech: ‘All praise belongs to Allah, I praise Him, beg assistance from Him, ask forgiveness from Him, seek His guidance, believe in Him and place my trust with Him and I testify that no one deserves worship except Allah alone who has no partners and I testify that Muhammad, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, is His servant and His Messenger. He sent him with guidance and true religion to make it dominant over all other religions, as a guide to Him and calling to Him. So he destroyed the pillars of disbelief and lit up the beacon of belief. Whoever obeys Allah and the Messenger of Allah, the right guidance becomes his path and the light of piety becomes his guide. Whoever disobeys Allah and His Messenger misses the straight path altogether and harms no one except himself. I recommend you, O servants of Allah, to become pious before Allah with an advice from an adviser and a preaching of one who delivers and strives. Thereafter, Allah, most Majestic, most Glorious, has made Islam the bright landmarks with shining light houses. In it hearts come together and on its basis are brotherhood and what is between us and you, of such facts are to love Him and old memories among us and everyone knowing everyone else of that on which we are based. May Allah forgive us and you and peace be with you and the blessing of Allah and His kindness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/91)"
        ],
        "index": 9545,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:44:4",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ ابْنِ الْعَزْرَمِيِّ عَنْ أَبِيهِ قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِذَا أَرَادَ أَنْ يُزَوِّجَ قَالَ الْحَمْدُ لِلَّهِ أَحْمَدُهُ وَ أَسْتَعِينُهُ وَ أُومِنُ بِهِ وَ أَتَوَكَّلُ عَلَيْهِ وَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ أَرْسَلَهُ بِالْهُدَى وَ دِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَ لَوْ كَرِهَ الْمُشْرِكُونَ وَ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ آلِهِ وَ السَّلَامُ عَلَيْكُمْ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ ",
          "أُوصِيكُمْ عِبَادَ اللَّهِ بِتَقْوَى اللَّهِ وَلِيِّ النِّعْمَةِ وَ الرَّحْمَةِ خَالِقِ الْأَنَامِ وَ مُدَبِّرِ الْأُمُورِ فِيهَا بِالْقُوَّةِ عَلَيْهَا وَ الْإِتْقَانِ لَهَا فَإِنَّ اللَّهَ لَهُ الْحَمْدُ عَلَى غَابِرِ مَا يَكُونُ وَ مَاضِيهِ وَ لَهُ الْحَمْدُ مُفْرَداً وَ الثَّنَاءُ مُخْلَصاً بِمَا مِنْهُ كَانَتْ لَنَا نِعْمَةً مُونِقَةً وَ عَلَيْنَا مُجَلِّلَةً وَ إِلَيْنَا مُتَزَيِّنَةً خَالِقٌ مَا أَعْوَزَ وَ مُذِلٌّ مَا اسْتَصْعَبَ وَ مُسَهِّلٌ مَا اسْتُوعِرَ وَ مُحَصِّلٌ مَا اسْتَيْسَرَ",
          "مُبْتَدِئُ الْخَلْقِ بَدْءاً أَوَّلًا يَوْمَ ابْتَدَعَ السَّمَاءَ وَ هِيَ دُخَانٌ فَقالَ لَها وَ لِلْأَرْضِ ائْتِيا طَوْعاً أَوْ كَرْهاً قالَتا أَتَيْنا طائِعِينَ فَقَضَيهُنَّ سَبْعَ سَمَاوَاتٍ فِي يَوْمَيْنِ وَ لَا يَعُورُهُ شَدِيدٌ وَ لَا يَسْبِقُهُ هَارِبٌ وَ لَا يَفُوتُهُ مُزَائِلٌ يَوْمَ تُوَفَّى كُلُّ نَفْسٍ ما كَسَبَتْ وَ هُمْ لا يُظْلَمُونَ ثُمَّ إِنَّ فُلَانَ بْنَ فُلَانٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, form Obn Al Azramy, from his father who said, ",
            "‘Whenever Amir Al-Momineen<sup>asws</sup> intended to solemnise a marriage, said: ‘The Praise is for Allah<sup>azwj</sup>! I<sup>asws</sup> Praise Him<sup>azwj</sup> and seek His<sup>azwj</sup> support, and believe in Him<sup>azwj</sup>, and reply upon Him<sup>azwj</sup>, and I<sup>asws</sup> testify that there is no god except for Allah<sup>azwj</sup>, One, there being no associates for Him<sup>azwj</sup>. And I<sup>asws</sup> testify that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Rasool<sup>saww</sup>, having Sent Him<sup>azwj</sup> with the Guidance and the true Religion, in order to Make it to prevail over the Religions, all of them, even though the Polytheists may dislike it. And Blessings be upon Muhammad<sup>saww</sup> and his<sup>saww</sup> Progeny<sup>asws</sup>, and greetings be to you all and His<sup>azwj</sup> Mercy and His<sup>azwj</sup> Blessings.",
            "I<sup>asws</sup> advise you, servants of Allah<sup>azwj</sup>, with the fear of Allah<sup>azwj</sup>, Protector of the Bounties and the Mercy, Creator of the people, and Manager of the affairs with Power over it and Mastery for it. Therefore, for Allah<sup>azwj</sup> is the Praise upon the occurrences which are to transpire and what has passed, and for Him<sup>azwj</sup> is the sole Praise being for Him<sup>azwj</sup>, and the sincere Extollation with whatever is from Him<sup>azwj</sup> which would be a Grace to us and a covering upon us and an adornment to us; Creator of what is honourable and a disgrace, what is difficult and what is easy, what is hard and what is soft.",
            "He<sup>azwj</sup> Initiated the creation with an initiation on the first day, initiating the sky, and it was smoke, so He<sup>azwj</sup> Said to it and the earth: “Either come willingly or unwillingly”. They both said: ‘We come willingly’. Thus, He<sup>azwj</sup> Judged them both as seven skies in two days; and neither were its resources severe nor could the fleer precede Him<sup>azwj</sup> nor is a perishable thing lost from Him<sup>azwj</sup>. The Day in which every soul shall be paid what it had earned and they would not be oppressed. Thereafter, so and so ...... (are to be married)’."
          ],
          "en.sarwar": [
            "4. Ahmad ibn Muhammad has narrated from ibn al-‘Arzamiy from his father who has said the following: “When ’Amir al-Mu’minin, ‘Alayhi al-Salam, wanted to solemnize a marriage he would say, ‘All praise belongs to Allah, I praise Him, beg assistance from Him, believe in Him and place my trust with Him and I testify that no one deserves worship except Allah alone who has no partners and I testify that Muhammad, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, is His servant and His Messenger. He sent him with guidance and true religion to make it dominant over all other religions, even though the pagans dislike it. O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, may peace and blessings of Allah be with you. I recommend you, O servants of Allah, to become pious before Allah, who is the Owner of bounties and mercy, the Creator of the people and the Planner of all issues in it with power over it and firmness, to Allah, belongs all praise for the matters of the past and the bygone. All praise belongs to Allah alone and glorification is purely for Him for His favor that He has done to us as a beautiful bounty on us with grace and has beautified it to us. He is the Creator that never runs out of resources, humbles down all difficult issues, softens what is hard and achieves with ease. He is the Inventor of the creation which He began first on the day He created the sky when it was smoke and said to it and the earth, “Come voluntarily or by force.” They responded, “We come voluntarily.” Then He made them seven heavens in two days. He never runs out of resources and no runaway can go faster than Him and no perishing thing is lost for Him. There will be the day when every soul will receive what it has earned without any injustice being done to it. Thereafter so and so . . .’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/93)"
        ],
        "index": 9546,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:44:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى قَالَ حَدَّثَنِي الْعَبَّاسُ بْنُ مُوسَى الْبَغْدَادِيُّ رَفَعَهُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) جَوَابٌ فِي خُطْبَةِ النِّكَاحِ الْحَمْدُ لِلَّهِ مُصْطَفِي الْحَمْدِ وَ مُسْتَخْلِصِهِ لِنَفْسِهِ مَجَّدَ بِهِ ذِكْرَهُ وَ أَسْنَى بِهِ أَمْرَهُ نَحْمَدُهُ غَيْرَ شَاكِّينَ فِيهِ نَرَى مَا نَعُدُّهُ رَجَاءَ نَجَاحِهِ وَ مِفْتَاحَ رَبَاحِهِ وَ نَتَنَاوَلُ بِهِ الْحَاجَاتِ مِنْ عِنْدِهِ وَ نَسْتَهْدِي اللَّهَ بِعِصَمِ الْهُدَى وَ وَثَائِقِ الْعُرَى وَ عَزَائِمِ التَّقْوَى وَ نَعُوذُ بِاللَّهِ مِنَ الْعَمَى بَعْدَ الْهُدَى وَ الْعَمَلِ فِي مَضَلَّاتِ الْهَوَى",
          "وَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ عَبْدٌ لَمْ يَعْبُدْ أَحَداً غَيْرَهُ اصْطَفَاهُ بِعِلْمِهِ وَ أَمِيناً عَلَى وَحْيِهِ وَ رَسُولًا إِلَى خَلْقِهِ فَصَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ ",
          "أَمَّا بَعْدُ فَقَدْ سَمِعْنَا مَقَالَتَكُمْ وَ أَنْتُمُ الْأَحْيَاءُ الْأَقْرَبُونَ نَرْغَبُ فِي مُصَاهَرَتِكُمْ وَ نُسْعِفُكُمْ بِحَاجَتِكُمْ وَ نَضَنُّ بِإِخَائِكُمْ فَقَدْ شَفَّعْنَا شَافِعَكُمْ وَ أَنْكَحْنَا خَاطِبَكُمْ عَلَى أَنَّ لَهَا مِنَ الصَّدَاقِ مَا ذَكَرْتُمْ نَسْأَلُ اللَّهَ الَّذِي أَبْرَمَ الْأُمُورَ بِقُدْرَتِهِ أَنْ يَجْعَلَ عَاقِبَةَ مَجْلِسِنَا هَذَا إِلَى مَحَابِّهِ إِنَّهُ وَلِيُّ ذَلِكَ وَ الْقَادِرُ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa who said, ‘Al Abbas Bin Musa Al Baghdady narrated to us, ",
            "(It has been narrated) raising it to Abu Abdullah<sup>asws</sup>, in answer to a sermon of the marriage: ‘The Praise is for Allah<sup>azwj</sup>, the Chosen for the Praise, sincerely for Himself<sup>saww</sup>, His<sup>azwj</sup> Mention being Glorified by Him<sup>azwj</sup>, and His<sup>azwj</sup> Command being Radiated by Him<sup>azwj</sup>. We<sup>asws</sup> Praise Him<sup>azwj</sup> without being in doubt. We<sup>asws</sup> see what we<sup>asws</sup> prepare hoping for its success and as keys to its benefits, and we<sup>asws</sup> attain the needs by it from His<sup>azwj</sup> Presence. And we<sup>asws</sup> seek Guidance of Allah<sup>azwj</sup> with the impeccable Guidance, and firm Security, and determined piety. And we seek Refuge with Allah<sup>azwj</sup> from the blindness after the Guidance, and the actions during straying desires. ",
            "And I<sup>asws</sup> testify that there is no god except for Allah<sup>azwj</sup>, One, there being no associates for Him<sup>azwj</sup>, and I<sup>asws</sup> testify that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Rasool<sup>saww</sup>, a servant such that he<sup>saww</sup> never worshipped anyone apart from Him<sup>azwj</sup>. He<sup>azwj</sup> Chose him<sup>saww</sup> with His<sup>azwj</sup> Knowledge, and a trustworthy upon His<sup>azwj</sup> Revelation, and a Rasool<sup>saww</sup> to His<sup>azwj</sup> creatures. So, may Allah<sup>azwj</sup> Send His<sup>azwj</sup> Blessings upon him<sup>saww</sup> and his<sup>saww</sup> Progeny<sup>asws</sup>.",
            "Thereafter, so we<sup>asws</sup> have heard your speeches, and you are the neighbours, the nearest ones we<sup>asws</sup> wish to be in your alliance, and assisting you in your needs, and desiring to be your brethren. So we<sup>asws</sup> have accepted the intercession of your interceders, and we<sup>asws</sup> hereby marry to your proposer upon a stipulation that for her would be from the dower what you have mentioned. We<sup>asws</sup> ask Allah<sup>azwj</sup> Who Endorsed the affairs with His<sup>azwj</sup> Measurement, that He<sup>azwj</sup> Makes the end result of this gathering of ours to be what He<sup>azwj</sup> Loves, Him<sup>azwj</sup> being the Guardian of that and the One Able over it’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa who has said that narrated to me al-‘Abbas ibn Musa al- Baghdadiy in a marfu’ manner has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, as response in Khutbah for marriage has said, ‘All praise belongs to Allah who chooses praise especially for Himself, glorified is thereby His mention and facilitated thereby is His command. We praise Him without any doubt in it; we see what we prepare in the hope for success and as key to its benefit. We receive what we need from Him and we seek guidance from Allah, a safe guidance and strong means of safety and the determination for piety. We seek protection with Allah against blindness after guidance and against working in misleading desires. I testify that no one other than Allah alone, who has no partners, deserves worship and I testify that Muhammad is His servant and His Messenger, a servant who never worshipped anyone other than Him. He chose him by His knowledge and entrusted him with His revelation, as a messenger to His creatures, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. Thereafter, we have heard your words and you are the nearest generation with whom we like to have marital relationship and assist you in your needs. We are greedy for your brotherhood. We have accepted the mediation of your mediator and given in marriage to the one from you who have proposed for marriage for the designated mahr (dower) and we ask Allah who decides all issues with His power to make the consequences of our meeting towards His love; He is the guardian thereof and has power thereat.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/94)"
        ],
        "index": 9547,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:44:6",
        "relations": {
          "Mentions": [
            "/books/quran:25:56",
            "/books/quran:13:39",
            "/books/quran:25:54",
            "/books/quran:24:32"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عَبْدِ الْعَظِيمِ بْنِ عَبْدِ اللَّهِ قَالَ سَمِعْتُ أَبَا الْحَسَنِ ( عليه السلام ) يَخْطُبُ بِهَذِهِ الْخُطْبَةِ الْحَمْدُ لِلَّهِ الْعَالِمِ بِمَا هُوَ كَائِنٌ مِنْ قَبْلِ أَنْ يَدِينَ لَهُ مِنْ خَلْقِهِ دَائِنٌ فَاطِرِ السَّمَاوَاتِ وَ الْأَرْضِ مُؤَلِّفِ الْأَسْبَابِ بِمَا جَرَتْ بِهِ الْأَقْلَامُ وَ مَضَتْ بِهِ الْأَحْتَامُ مِنْ سَابِقِ عِلْمِهِ وَ مُقَدَّرِ حُكْمِهِ أَحْمَدُهُ عَلَى نِعَمِهِ وَ أَعُوذُ بِهِ مِنْ نِقَمِهِ وَ أَسْتَهْدِي اللَّهَ الْهُدَى وَ أَعُوذُ بِهِ مِنَ الضَّلَالَةِ وَ الرَّدَى مَنْ يَهْدِهِ اللَّهُ فَقَدِ اهْتَدَى وَ سَلَكَ الطَّرِيقَةَ الْمُثْلَى وَ غَنِمَ الْغَنِيمَةَ الْعُظْمَى وَ مَنْ يُضْلِلِ اللَّهُ فَقَدْ حَارَ عَنِ الْهُدَى وَ هَوَى إِلَى الرَّدَى",
          "وَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ الْمُصْطَفَى وَ وَلِيُّهُ الْمُرْتَضَى وَ بَعِيثُهُ بِالْهُدَى أَرْسَلَهُ عَلَى حِينِ فَتْرَةٍ مِنَ الرُّسُلِ وَ اخْتِلَافٍ مِنَ الْمِلَلِ وَ انْقِطَاعٍ مِنَ السُّبُلِ وَ دُرُوسٍ مِنَ الْحِكْمَةِ وَ طُمُوسٍ مِنْ أَعْلَامِ الْهُدَى وَ الْبَيِّنَاتِ",
          "فَبَلَّغَ رِسَالَةَ رَبِّهِ وَ صَدَعَ بِأَمْرِهِ وَ أَدَّى الْحَقَّ الَّذِي عَلَيْهِ وَ تُوُفِّيَ فَقِيداً مَحْمُوداً ( صلى الله عليه وآله ) ثُمَّ إِنَّ هَذِهِ الْأُمُورَ كُلَّهَا بِيَدِ اللَّهِ تَجْرِي إِلَى أَسْبَابِهَا وَ مَقَادِيرِهَا فَأَمْرُ اللَّهِ يَجْرِي إِلَى قَدَرِهِ وَ قَدَرُهُ يَجْرِي إِلَى أَجَلِهِ وَ أَجَلُهُ يَجْرِي إِلَى كِتَابِهِ وَ لِكُلِّ أَجَلٍ كِتابٌ يَمْحُوا اللَّهُ ما يَشاءُ وَ يُثْبِتُ وَ عِنْدَهُ أُمُّ الْكِتابِ",
          "أَمَّا بَعْدُ فَإِنَّ اللَّهَ جَلَّ وَ عَزَّ جَعَلَ الصِّهْرَ مَأْلَفَةً لِلْقُلُوبِ وَ نِسْبَةَ الْمَنْسُوبِ أَوْشَجَ بِهِ الْأَرْحَامَ وَ جَعَلَهُ رَأْفَةً وَ رَحْمَةً إِنَّ فِي ذلِكَ لَآياتٍ لِلْعالِمِينَ وَ قَالَ فِي مُحْكَمِ كِتَابِهِ وَ هُوَ الَّذِي خَلَقَ مِنَ الْماءِ بَشَراً فَجَعَلَهُ نَسَباً وَ صِهْراً وَ قَالَ وَ أَنْكِحُوا الْأَيامى مِنْكُمْ وَ الصَّالِحِينَ مِنْ عِبادِكُمْ وَ إِمائِكُمْ",
          "وَ إِنَّ فُلَانَ بْنَ فُلَانٍ مِمَّنْ قَدْ عَرَفْتُمْ مَنْصِبَهُ فِي الْحَسَبِ وَ مَذْهَبَهُ فِي الْأَدَبِ وَ قَدْ رَغِبَ فِي مُشَارَكَتِكُمْ وَ أَحَبَّ مُصَاهَرَتَكُمْ وَ أَتَاكُمْ خَاطِباً فَتَاتَكُمْ فُلَانَةَ بِنْتَ فُلَانٍ وَ قَدْ بَذَلَ لَهَا مِنَ الصَّدَاقِ كَذَا وَ كَذَا الْعَاجِلُ مِنْهُ كَذَا وَ الْآجِلُ مِنْهُ كَذَا فَشَفِّعُوا شَافِعَنَا وَ أَنْكِحُوا خَاطِبَنَا وَ رُدُّوا رَدّاً جَمِيلًا وَ قُولُوا قَوْلًا حَسَناً وَ أَسْتَغْفِرُ اللَّهَ لِي وَ لَكُمْ وَ لِجَمِيعِ الْمُسْلِمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Abdul Azeem Bin Abdullah who said, ",
            "‘I heard Abu Al-Hassan<sup>asws</sup> address with this sermon: ‘The Praise is for Allah<sup>azwj</sup>, the Knower with what is to occur before anyone from His<sup>azwj</sup> creatures realises it. The Originator of the skies and the earth. The Composer of the causes with what the Pens flow with, and the Ordained matters occur from the precedence of His<sup>azwj</sup> Knowledge, and a measurement of His<sup>azwj</sup> Wisdom. I<sup>asws</sup> Praise Him<sup>azwj</sup> upon His<sup>azwj</sup> Bounties, and I<sup>asws</sup> seek Refuge with Him<sup>azwj</sup> His<sup>azwj</sup> Vengeance, seeking Guidance of Allah<sup>azwj</sup>, and I<sup>asws</sup> seek Refuge with Him<sup>azwj</sup> from the straying and the destruction. The one whom Allah<sup>azwj</sup> Guides, so he has travelled upon the ideal road, and has acquired the best of the booties; and the one who Allah<sup>azwj</sup> Lets to stray, so he is perplexed from the guidance and collapsed into the destruction. ",
            "And I testify that there is no god except for Allah<sup>azwj</sup>, One, there being no associates for Him<sup>azwj</sup>, and that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Rasool<sup>saww</sup>, the Chosen one, and His<sup>azwj</sup> Guardian with whom He<sup>azwj</sup> is Pleased with, and Sent him<sup>saww</sup> with the Guidance. He<sup>azwj</sup> Sent him<sup>saww</sup> upon where there was an interval from the Rasools<sup>as</sup> and there was differing among the nations, and there was an interruption from the ways and the teachings from the Wisdom, and obscurities from the banners of the Guidance and the proofs. ",
            "So he<sup>saww</sup> delivered the Message of his<sup>saww</sup> Lord<sup>azwj</sup>, and implemented His<sup>azwj</sup> Commands and fulfilled the Truth which he<sup>saww</sup> was upon, and he<sup>saww</sup> passed away and the Praiser<sup>saww</sup> is very much missed. Then, these matters are in the Hands of Allah<sup>azwj</sup>, all of them, Causing them to flow to its reasons and its measurements. So Allah<sup>azwj</sup> Commanded that these flow by His<sup>azwj</sup> Measurement, and Measured it to flow to its term, and flowing it to its prescribed time, and for every term there is a prescribed time. <span class=\"ibTxt\"><a href=\"/#/books/quran:13#h39\">[13:39]</a> Allah Obliterates whatever He so Desires to and Establishes, and with Him is the Mother of the Book</span>.",
            "Thereafter, Allah<sup>azwj</sup> Mighty and Majestic as a cordiality for the hearts, and as a link linking it to the womb relationships, and Made it a kindness and a mercy, and in that are signs for the worlds. And He<sup>azwj</sup> Said in the Decisive of His<sup>azwj</sup> Book <span class=\"ibTxt\"><a href=\"/#/books/quran:25#h54\">[25:54]</a> And He it is Who Created a mortal from the water, so He Made for him relationships of lineage and marriage</span>; and He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:24#h32\">[24:32]</a> And marry those among you who are single and those who are fit among your male slaves and your female slaves</span>.",
            "And, so and so, son of so and so is from the ones whom you know of his nobility and his lineage, and his doctrine in the etiquettes, and he has desired regarding participating with you and loves to be related to you, and has given you a proposal for your so and so young girl, daughter of so and so, and has extended to her such and such from the dower, the immdieate being such and such, and the delayed being such and such (amount). Therefore accept our intercession and marry our proposer, and return him with a beautiful returning, and say beautiful words, and seek Forgiveness of Allah<sup>azwj</sup> for me<sup>asws</sup> and for you all, and for the entirety of the Muslims’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Ahmad ibn Muhammad from ibn Khalid from ‘Abd al-‘Azim ibn ‘Abd Allah who has said the following: “I heard abu al-Hassan, ‘Alayhi al-Salam, give the following as Khutbah (sermon) when solemnizing a marriage: ‘All praise belongs to Allah who knows what is to come into being before anyone of His creatures with the ability to recognize (and know) can recognize it (the being that is to come into being). He is the Inventor of the skies and earth, harmonizer of the means about which the Pen has moved and the determination has been made in His knowledge of the past and measures of His wisdom. I praise Him for His bounties, and seek protection with Him against His dislikes, appeal before Allah for guidance, seek His protection against straying and destruction. Whomever Allah guides has found guidance, has walked on the right path and has earned the great benefit. Whomever Allah causes to go astray, misses guidance and is headed to destruction. I testify that no one other than Allah alone, who has no partners, deserves worship and I testify that Muhammad is His servant and His chosen messenger and His friend with whom He is pleased, His Messenger with guidance whom He sent at a time of lapse of the existence of His Messengers, when differences among nations were a great deal, cutting off of the roads, decadence of wisdom, wiped out landmarks of guidance and clear signs, were all everywhere. He preached and delivered the message of his Lord, executed His commands, fulfilled the right he owed and left this world and he is very much missed. O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. ‘All issues are in the hands of Allah. He allows them to run by their means and measures. The command of Allah applies to His measures and His measures work to the appointed time and His appointed time works to His record; for every appointed time there is a record. Allah deletes whatever He wants and establishes whatever He wants; He has the original record and ‘Umm al-Kitab (mother book). Thereafter, Allah, most Majestic, most Glorious, has made marriage to bring the hearts close together and a relation for the relationship, to interlace a relationship among relatives. He has made it for compassion and kindness and in this there are signs (of existence of Allah) for the worlds. He in His firmly established book has said, “It is He who has created man from water and has designed them for marriage and offspring.” <a href=\"/#/books/quran:25#h56\">[25:56]</a> He has also said, “Arrange marriage for your unmarried ones and the virtuous ones of your servants and slave-girls.” <a href=\"/#/books/quran:24#h32\">[24:32]</a> So and so is of those whom you know for his status, position, religion and discipline and he is interested in your participation and likes to establish marital relationship with you and has come with marriage proposal to the young lady from you so and so daughter of so and so and has offered a mahr (dower) of such and such amount for immediate payment and such and such amount payable on credit. Accept our mediation and give in marriage to our proposing gentleman who has arrived at a beautiful arriving place, and say to him good words and I ask Allah to grant forgiveness to me and you and all Muslims.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق وسنده الثاني أيضا موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/95)"
        ],
        "index": 9548,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:44:7",
        "relations": {
          "Mentions": [
            "/books/quran:25:54",
            "/books/quran:24:32"
          ]
        },
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ مُعَاوِيَةَ بْنِ حُكَيْمٍ قَالَ خَطَبَ الرِّضَا ( عليه السلام ) هَذِهِ الْخُطْبَةَ الْحَمْدُ لِلَّهِ الَّذِي حَمِدَ فِي الْكِتَابِ نَفْسَهُ وَ افْتَتَحَ بِالْحَمْدِ كِتَابَهُ وَ جَعَلَ الْحَمْدَ أَوَّلَ جَزَاءِ مَحَلِّ نِعْمَتِهِ وَ آخِرَ دَعْوَى أَهْلِ جَنَّتِهِ وَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ شَهَادَةً أُخْلِصُهَا لَهُ وَ أَدَّخِرُهَا عِنْدَهُ",
          "وَ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ خَاتَمِ النُّبُوَّةِ وَ خَيْرِ الْبَرِيَّةِ وَ عَلَى آلِهِ آلِ الرَّحْمَةِ وَ شَجَرَةِ النِّعْمَةِ وَ مَعْدِنِ الرِّسَالَةِ وَ مُخْتَلَفِ الْمَلَائِكَةِ وَ الْحَمْدُ لِلَّهِ الَّذِي كَانَ فِي عِلْمِهِ السَّابِقِ وَ كِتَابِهِ النَّاطِقِ وَ بَيَانِهِ الصَّادِقِ أَنَّ أَحَقَّ الْأَسْبَابِ بِالصِّلَةِ وَ الْأَثَرَةِ وَ أَوْلَى الْأُمُورِ بِالرَّغْبَةِ فِيهِ سَبَبٌ أَوْجَبَ سَبَباً وَ أَمْرٌ أَعْقَبَ غِنًى ",
          "فَقَالَ جَلَّ وَ عَزَّ وَ هُوَ الَّذِي خَلَقَ مِنَ الْماءِ بَشَراً فَجَعَلَهُ نَسَباً وَ صِهْراً وَ كانَ رَبُّكَ قَدِيراً وَ قَالَ وَ أَنْكِحُوا الْأَيامى مِنْكُمْ وَ الصَّالِحِينَ مِنْ عِبادِكُمْ وَ إِمائِكُمْ إِنْ يَكُونُوا فُقَراءَ يُغْنِهِمُ اللَّهُ مِنْ فَضْلِهِ وَ اللَّهُ واسِعٌ عَلِيمٌ",
          "وَ لَوْ لَمْ يَكُنْ فِي الْمُنَاكَحَةِ وَ الْمُصَاهَرَةِ آيَةٌ مُحْكَمَةٌ وَ لَا سُنَّةٌ مُتَّبَعَةٌ وَ لَا أَثَرٌ مُسْتَفِيضٌ لَكَانَ فِيمَا جَعَلَ اللَّهُ مِنْ بِرِّ الْقَرِيبِ وَ تَقْرِيبِ الْبَعِيدِ وَ تَأْلِيفِ الْقُلُوبِ وَ تَشْبِيكِ الْحُقُوقِ وَ تَكْثِيرِ الْعَدَدِ وَ تَوْفِيرِ الْوَلَدِ لِنَوَائِبِ الدَّهْرِ وَ حَوَادِثِ الْأُمُورِ مَا يَرْغَبُ فِي دُونِهِ الْعَاقِلُ اللَّبِيبُ وَ يُسَارِعُ إِلَيْهِ الْمُوَفَّقُ الْمُصِيبُ وَ يَحْرِصُ عَلَيْهِ الْأَدِيبُ الْأَرِيبُ",
          "فَأَوْلَى النَّاسِ بِاللَّهِ مَنِ اتَّبَعَ أَمْرَهُ وَ أَنْفَذَ حُكْمَهُ وَ أَمْضَى قَضَاءَهُ وَ رَجَا جَزَاءَهُ وَ فُلَانُ بْنُ فُلَانٍ مَنْ قَدْ عَرَفْتُمْ حَالَهُ وَ جَلَالَهُ دَعَاهُ رِضَا نَفْسِهِ وَ أَتَاكُمْ إِيثَاراً لَكُمْ وَ اخْتِيَاراً لِخِطْبَةِ فُلَانَةَ بِنْتِ فُلَانٍ كَرِيمَتِكُمْ وَ بَذَلَ لَهَا مِنَ الصَّدَاقِ كَذَا وَ كَذَا فَتَلَقُّوهُ بِالْإِجَابَةِ وَ أَجِيبُوهُ بِالرَّغْبَةِ وَ اسْتَخِيرُوا اللَّهَ فِي أُمُورِكُمْ يَعْزِمْ لَكُمْ عَلَى رُشْدِكُمْ إِنْ شَاءَ اللَّهُ ",
          "نَسْأَلُ اللَّهَ أَنْ يُلْحِمَ مَا بَيْنَكُمْ بِالْبِرِّ وَ التَّقْوَى وَ يُؤَلِّفَهُ بِالْمَحَبَّةِ وَ الْهَوَى وَ يَخْتِمَهُ بِالْمُوَافَقَةِ وَ الرِّضَا إِنَّهُ سَمِيعُ الدُّعَاءِ لَطِيفٌ لِمَا يَشَاءُ .",
          "بَعْضُ أَصْحَابِنَا عَنْ عَلِيِّ بْنِ الْحَسَنِ بْنِ فَضَّالٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ سَمِعْتُ أَبَا الْحَسَنِ الرِّضَا ( عليه السلام ) يَقُولُ ثُمَّ ذَكَرَ الْخُطْبَةَ كَمَا ذَكَرَ مُعَاوِيَةُ بْنُ حُكَيْمٍ مِثْلَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "<span style=\"font-size: small\">Ahmad Bin Muhammad, from Muawiya Bin Hukeym who said, ‘Al Reza</span><sup>asws</sup><span style=\"font-size: small\"> addressed this sermon: </span>",
            "‘The Praise is for Allah<sup>azwj</sup> Who Praised Himself<sup>azwj</sup> in His<sup>azwj</sup> Book, and Opened with the Praise of His<sup>azwj</sup> Book, and Made the Praise (الْحَمْدَ) as the first for Placing His<sup>azwj</sup> Bounties and the last of the calls of the inhabitants of the Paradise. And I<sup>asws</sup> testify that there is no god except for Allah<sup>azwj</sup>, One, there being no associates for Him<sup>azwj</sup>, with a sincere testimony for Him<sup>azwj</sup>, and I<sup>asws</sup> keep it as a treasure with Him<sup>azwj</sup>.",
            "And Blessings be upon Muhammad<sup>saww</sup>, the finality of the Prophet-hood, and the best of the created beings, and upon his<sup>saww</sup> Progeny<sup>asws</sup>, being the Progeny<sup>asws</sup> of mercy, and the Bountiful tree, and a mine of the Message, and the interchange of the Angels. And the Praise is for Allah<sup>azwj</sup> which was in His<sup>azwj</sup> Pre-Knowledge, and His<sup>azwj</sup> speaking Book, and the truthful explanation, that the most rightful with the good relationships and the preference, and the highest of the matters with the desiring is wherein is a cause Obligating causes and a matter which results in self-sufficiency.",
            "So Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\"><a href=\"/#/books/quran:25#h54\">[25:54]</a> And He it is Who Created a mortal from the water, so He Made for him relationships of lineage and marriage, and your Lord is ever Powerful</span>; and Said <span class=\"ibTxt\"><a href=\"/#/books/quran:24#h32\">[24:32]</a> And marry those among you who are single and those who are fit among your male slaves and your female slaves; if they are needy, Allah will Make them free from want out of His Grace; and Allah is Ample-giving, Knowing</span>. ",
            "And had there not been with regarding to the marriages and the inter-marriages, a Decisive Verse, nor a Sunnah to be followed, nor a Hadeeth to benefit from, it would have been such that the remote would have been nearby and the nearby remote. And it is such that the hearts are brought together, and the rights are interlaced, and the number (populations) become numerous, and a provision for the boys for the ravages of the time, and the newly-occurring matters; and besides it, the intellectuals desire it without saying a word, and the wise ones hasten towards it, and the educated are greedy for it.",
            "So the closest of the people with Allah<sup>azwj</sup> are the one who follow His<sup>azwj</sup> Commands, and implement His<sup>azwj</sup> Decisions, and approve His<sup>azwj</sup> Judgements, and desire for His<sup>azwj</sup> Recompense. And so and so, son of so and so, is one whom you have recognised his state, and his majesty. His soul was pleased with himself giving preference to you, and chose to propose so and so daughter of so and so, your honourable one, and extended to her such and such from the dower. Therefore, welcome him with the (positive) answer, and respond to him with the desire, and choose Allah<sup>azwj</sup> (perform <span class=\"iTxt\">Istikhaara</span>) with regards to your matter, that He<sup>azwj</sup> would Make you determined upon your right way, Allah<sup>azwj</sup> Willing. ",
            "We<sup>asws</sup> ask Allah<sup>azwj</sup> that He<sup>azwj</sup> Merges what is between you with the righteousness and the piety, with the love and the desire, and Seal it with the harmony and the pleasure. He<sup>azwj</sup> is the Hearer of the supplications, Kind to whoever He<sup>azwj</sup> so Desires to’.",
            "One of our companions, from Ali Bin Al-Hassan Bin Fazzal, from Ismail Bin Mihran, form Ahmad Bin Muhammad Bin Abu Nasr who said, ‘I heard Abu Al-Hassan Al-Reza<sup>asws</sup> saying, then he mentioned the sermon just as Muawiya Bin Hukeym had mentioned, similar to it’."
          ],
          "en.sarwar": [
            "7. Ahmad ibn Muhammad has narrated from Mu‘awiyah ibn Hakim who has said the following: “Al-Rida’, ‘Alayhi al-Salam, once read the following as Khutbah (sermon) when solemnizing a marriage: ‘All praise belongs to Allah who has praised Himself in the book and has opened His book with it, has made it the first reward of the recipient of His bounties and the last words of the dwellers of His paradise. I testify that no one other than Allah alone, who has no partners, deserves worship, a testimony that I present purely for Him and save in reserve with Him. O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. He is the last in the line of prophets and the best of the people, and his family is the family of mercy and kindness, the tree of bounties, the source of Divine message, the junction of coming and going of the angels. All praise belongs to Allah who had it in His eternal knowledge and in His speaking book and true statements that the most deserving means, for compensation and preference and the foremost issue to be interested in is the means that involves a means and issue that is followed by freedom from want. Allah, most Majestic, most Glorious, has said, “It is He who has created the human being from water to have relationships of both lineage and wedlock. Your Lord has all power.” <a href=\"/#/books/quran:25#h54\">[25:54]</a> “Marry the single people among you and the righteous slaves and slave-girls. If you are poor, Allah will make you rich through His favor; He is Bountiful and All-knowing.” <a href=\"/#/books/quran:24#h32\">[24:32]</a> Had there been no clear verse of the Quran about marriage or texts of Sunnah which are followed or any other source of law unanimously accepted, it (marriage) would have been of what Allah has made of the very close and nearby good deeds and of the facts that bring far away things close and bring the hearts near together, to intermingle rights and to multiply numbers of children to help in difficult conditions of time and happenings of issues. It is of the facts in which people of reason are interested, fortunate people strive to achieve and skillful people of the field of discipline feel greedy about. People close to Allah are those who obey His command, execute His orders, approve His decision and hope for His reward. So and so son of so and so is one whose condition and excellence are well known to you. His soul has agreed to give preference to you over the others and to choose proposing marriage to so and so daughter of so and so, your graceful daughter and has decided to pay such and such amount as mahr (dower), so please welcome him with acceptance, respond to him with interest and ask Allah to show what is in your interest and well-being in your affairs. He will decide for you what is reasonable, if Allah so wills and we ask Allah to bring harmony among you by means of piety and virtuous manners, bring him close with affection and love and complete for him with agreement and pleasure; He listens to the prayers and is subtle in what He wishes.”’ Certain persons of our people have narrated from Ali ibn al-Hassan ibn Faddal from ‘Isma’il ibn Mehran from Ahmad ibn Muhammad from ibn abu Nasr who has narrated the following: “I heard abu al-Hassan, al-Rida’, ‘Alayhi al-Salam, saying, . . he then has mentioned this sermon just as Mu‘awiyah ibn Hakam has narrated, which is a similar sermon.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/98)"
        ],
        "index": 9549,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:44:8",
        "relations": {
          "Mentions": [
            "/books/quran:25:54"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ أَحْمَدَ عَنْ بَعْضِ أَصْحَابِنَا قَالَ كَانَ الرِّضَا ( عليه السلام ) يَخْطُبُ فِي النِّكَاحِ الْحَمْدُ لِلَّهِ إِجْلَالًا لِقُدْرَتِهِ وَ لَا إِلَهَ إِلَّا اللَّهُ خُضُوعاً لِعِزَّتِهِ وَ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ آلِهِ عِنْدَ ذِكْرِهِ إِنَّ اللَّهَ خَلَقَ مِنَ الْماءِ بَشَراً فَجَعَلَهُ نَسَباً وَ صِهْراً إِلَى آخِرِ الْآيَةِ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ahmad, from one of our companions who said, ",
            "‘Al-Reza<sup>asws</sup> addressed regarding the marriage: ‘The Praise is for Allah<sup>azwj</sup>, to Glorify His<sup>azwj</sup> Power, and there is no god except for Allah<sup>azwj</sup> in particular, and Blessings be upon Muhammad<sup>saww</sup> and his<sup>saww</sup> progeny<sup>asws</sup>’, and mentioned in his<sup>asws</sup> mention <span class=\"ibTxt\"><a href=\"/#/books/quran:25#h54\">[25:54]</a> And He it is Who Created a mortal from the water, so He Made for him relationships of lineage and marriage</span> – up to the end of the Verse’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Ahmad has narrated from certain persons of our people who have said the following: “Al-Rida’, ‘Alayhi al-Salam, when solemnizing a marriage would read a Khutbah as follows: "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/98)"
        ],
        "index": 9550,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:44:9",
        "text": [
          "بَعْضُ أَصْحَابِنَا عَنْ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا أَرَادَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَنْ يَتَزَوَّجَ خَدِيجَةَ بِنْتَ خُوَيْلِدٍ أَقْبَلَ أَبُو طَالِبٍ فِي أَهْلِ بَيْتِهِ وَ مَعَهُ نَفَرٌ مِنْ قُرَيْشٍ حَتَّى دَخَلَ عَلَى وَرَقَةَ بْنِ نَوْفَلٍ عَمِّ خَدِيجَةَ فَابْتَدَأَ أَبُو طَالِبٍ بِالْكَلَامِ فَقَالَ الْحَمْدُ لِرَبِّ هَذَا الْبَيْتِ الَّذِي جَعَلَنَا مِنْ زَرْعِ إِبْرَاهِيمَ وَ ذُرِّيَّةِ إِسْمَاعِيلَ وَ أَنْزَلَنَا حَرَماً آمِناً وَ جَعَلَنَا الْحُكَّامَ عَلَى النَّاسِ وَ بَارَكَ لَنَا فِي بَلَدِنَا الَّذِي نَحْنُ فِيهِ ",
          "ثُمَّ إِنَّ ابْنَ أَخِي هَذَا يَعْنِي رَسُولَ اللَّهِ ( صلى الله عليه وآله ) مِمَّنْ لَا يُوزَنُ بِرَجُلٍ مِنْ قُرَيْشٍ إِلَّا رُجِّحَ بِهِ وَ لَا يُقَاسُ بِهِ رَجُلٌ إِلَّا عَظُمَ عَنْهُ وَ لَا عِدْلَ لَهُ فِي الْخَلْقِ وَ إِنْ كَانَ مُقِلًّا فِي الْمَالِ فَإِنَّ الْمَالَ رِفْدٌ جَارٍ وَ ظِلٌّ زَائِلٌ ",
          "وَ لَهُ فِي خَدِيجَةَ رَغْبَةٌ وَ لَهَا فِيهِ رَغْبَةٌ وَ قَدْ جِئْنَاكَ لِنَخْطُبَهَا إِلَيْكَ بِرِضَاهَا وَ أَمْرِهَا وَ الْمَهْرُ عَلَيَّ فِي مَالِيَ الَّذِي سَأَلْتُمُوهُ عَاجِلُهُ وَ آجِلُهُ وَ لَهُ وَ رَبِّ هَذَا الْبَيْتِ حَظٌّ عَظِيمٌ وَ دِينٌ شَائِعٌ وَ رَأْيٌ كَامِلٌ",
          "ثُمَّ سَكَتَ أَبُو طَالِبٍ وَ تَكَلَّمَ عَمُّهَا وَ تَلَجْلَجَ وَ قَصَرَ عَنْ جَوَابِ أَبِي طَالِبٍ وَ أَدْرَكَهُ الْقُطْعُ وَ الْبُهْرُ وَ كَانَ رَجُلًا مِنَ الْقِسِّيسِينَ فَقَالَتْ خَدِيجَةُ مُبْتَدِئَةً يَا عَمَّاهْ إِنَّكَ وَ إِنْ كُنْتَ أَوْلَى بِنَفْسِي مِنِّي فِي الشُّهُودِ فَلَسْتَ أَوْلَى بِي مِنْ نَفْسِي قَدْ زَوَّجْتُكَ يَا مُحَمَّدُ نَفْسِي وَ الْمَهْرُ عَلَيَّ فِي مَالِي فَأْمُرْ عَمَّكَ فَلْيَنْحَرْ نَاقَةً فَلْيُولِمْ بِهَا وَ ادْخُلْ عَلَى أَهْلِكَ",
          "قَالَ أَبُو طَالِبٍ اشْهَدُوا عَلَيْهَا بِقَبُولِهَا مُحَمَّداً وَ ضَمَانِهَا الْمَهْرَ فِي مَالِهَا فَقَالَ بَعْضُ قُرَيْشٍ يَا عَجَبَاهْ الْمَهْرُ عَلَى النِّسَاءِ لِلرِّجَالِ فَغَضِبَ أَبُو طَالِبٍ غَضَباً شَدِيداً وَ قَامَ عَلَى قَدَمَيْهِ وَ كَانَ مِمَّنْ يَهَابُهُ الرِّجَالُ وَ يُكْرَهُ غَضَبُهُ فَقَالَ إِذَا كَانُوا مِثْلَ ابْنِ أَخِي هَذَا طُلِبَتِ الرِّجَالُ بِأَغْلَى الْأَثْمَانِ وَ أَعْظَمِ الْمَهْرِ وَ إِذَا كَانُوا أَمْثَالَكُمْ لَمْ يُزَوَّجُوا إِلَّا بِالْمَهْرِ الْغَالِي ",
          "وَ نَحَرَ أَبُو طَالِبٍ نَاقَةً وَ دَخَلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِأَهْلِهِ وَ قَالَ رَجُلٌ مِنْ قُرَيْشٍ يُقَالُ لَهُ عَبْدُ اللَّهِ بْنُ غَنْمٍ . هَنِيئاً مَرِيئاً يَا خَدِيجَةُ قَدْ جَرَتْ لَكِ الطَّيْرُ فِيمَا كَانَ مِنْكِ بِأَسْعَدِتَزَوَّجْتِهِ خَيْرَ الْبَرِيَّةِ كُلِّهَا وَ مَنْ ذَا الَّذِي فِي النَّاسِ مِثْلُ مُحَمَّدِوَ بَشَّرَ بِهِ الْبَرَّانِ عِيسَى ابْنُ مَرْيَمَ وَ مُوسَى بْنُ عِمْرَانَ فَيَا قُرْبَ مَوْعِدِأَقَرَّتْ بِهِ الْكُتَّابُ قِدْماً بِأَنَّهُ رَسُولٌ مِنَ الْبَطْحَاءِ هَادٍ وَ مُهْتَدٍ"
        ],
        "translations": {
          "en.hubeali": [
            "One of our companions, from Ali Bin Al husayn, from Ali Bin Hassan, from Abdul Rahman Bin Kaseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When Rasool-Allah<sup>saww</sup> intended to marry Khadeeja<sup>as</sup> daughter of Khuwaylid, Abu Talib<sup>as</sup> went and with him<sup>saww</sup> were a number of Qureysh, until they came over to Waraqa Bin Nowfal, an uncle of Khadeeja<sup>as</sup>. So Abu Talib<sup>as</sup> began with the speech, so he<sup>as</sup> said: ‘The Praise is for the Lord<sup>azwj</sup> of this House (Kaaba) who Made us to be from the offspring of Ibrahim<sup>as</sup> and offspring of Ismail<sup>as</sup>, and Sent down to us a secured Sanctuary, and Made us the rulers upon the people, and Blessed for us in our city which we are in. ",
            "Then, this son<sup>saww</sup> of my<sup>as</sup> brother<sup>as</sup>’ meaning Rasool-Allah<sup>saww</sup>, ‘is from the one who cannot be equalled with a man from Qureysh except that he<sup>saww</sup> would be better with it, nor can he be compared with a man except that he<sup>saww</sup> would be greater than him, nor is there any equal of his among the people, even though he may be wealthier with the wealth, for the wealth is a flowing thing and it declines, and is transient.",
            "And for him<sup>saww</sup> is desire for Khadeeja<sup>as</sup>, and for her<sup>as</sup> is desire in him<sup>saww</sup>, and we have come to you in order to propose to you with her<sup>as</sup> agreement, and her instructions, and the dower is upon me<sup>as</sup> in my<sup>as</sup> wealth, whatever that you may ask for, for immediate payment and for delayed payment, and for him<sup>saww</sup>, by the Lord<sup>azwj</sup> of the House (Kabah), is a great share, and a popular Religion, and a complete view’. ",
            "Then Abu Talib<sup>as</sup> was silent, and her<sup>as</sup> uncle spoke, and hesitated, and was deficient from answering Abu Talib<sup>as</sup>, and his words were disconnected, and he used to be a man from the clergymen. So Khadeeja<sup>as</sup> said, initiating: ‘O Uncle! You, even though you are higher than me<sup>as</sup> with the witnessing, but you are not higher than me<sup>as</sup> from myself<sup>as</sup>, for I<sup>as</sup> have married you<sup>saww</sup>, O Muhammad<sup>saww</sup>, myself<sup>as</sup>, and the dower is upon me<sup>as</sup> in my<sup>as</sup> wealth. Therefore, instruct your<sup>saww</sup> uncle<sup>as</sup>, so let him<sup>as</sup> sacrifice a she-camel, in order to prepare a wedding feast (Waleema) with it, and enter upon your<sup>saww</sup> family’. ",
            "Abu Talib<sup>as</sup> said: ‘Bear witness upon it with her<sup>as</sup> words for Muhammad<sup>as</sup> and her<sup>as</sup> taking the responsibility of the dower in her<sup>as</sup> wealth’. So, some of the Qureysh said, ‘How strange! The dower is upon the women for the men?’ So Abu Talib<sup>as</sup> was angered with an intense anger, and stood upon his<sup>as</sup> feet, and he<sup>as</sup> was from the ones who awed the men and disliked the anger, so he<sup>as</sup> said: ‘When one is the likes this son<sup>saww</sup> of my<sup>as</sup> brother<sup>as</sup>, the men would be sought with the most expensive of the prices, and the greatest of the dowers, and when one is the like of you all, they would not be getting married except by paying the expensive dower’. ",
            "And Abu Talib<sup>as</sup> sacrificed a she-camel, and Rasool-Allah<sup>saww</sup> entered with her<sup>as</sup> family, and a man from the Qureysh called Abdullah Bin Ghanam, said, ‘Congratulations! Welcome, O Khadeeja<sup>as</sup>, for the bird (of fortune) has flown for you<sup>as</sup>, regarding what was from you<sup>as</sup> with your<sup>as</sup> marrying him<sup>saww</sup>, the best of the Created beings, all of them. And who is that among the people the likes of Muhammad<sup>saww</sup>? The righteous have heralded his<sup>saww</sup> good news, Isa<sup>as</sup> Bin Maryam<sup>as</sup>, and Musa<sup>as</sup> Bin Imran<sup>as</sup>, for close by is the time which the golden Books have foretold that there would be a Rasool<sup>saww</sup> from Al-Bat’ha for Guidance, being well-Guided’."
          ],
          "en.sarwar": [
            "9. Certain persons of our people have narrated from Ali ibn al-Husayn from Ali ibn Hassan from ‘Abd al-Rahman ibn Kathir who has said the following: “When the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, decided to marry Khadijah daughter of Khuwaylid, abu Talib with his family and certain individuals of Quraysh went to the house of Waraqah ibn Nawfal, uncle of Khadijah. Abu Talib began speaking and said, ‘All praise belongs to the Lord of this House, (al- Ka’bah) who has made us of the offspring of Ibrahim and ‘Isma’il and has given us accommodation in the secure sanctuary, has made us judges for people and has blessed for us our land in which we live. The son of my brother, this one, meaning the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, is as such that he cannot be compared with any man from Quraysh, He is above them and he is greater (in excellence) than whomever he is compared with. There is no one as his equal among the creatures even though he is not wealthy because wealth is a favor (from Allah) that comes and goes. He is interested in Khadijah and she is interested in him and we have come to you to propose (on his behalf) marriage (to Khadijah) if she agrees. Her order and mahr (dower) for her is on my assets of whatever amount you ask for advance payment and on credit. His share (the share of the Messenger of Allah) by the Lord of this House is great, his religion is publicly known and his opinion is perfect.’ Abu Talib then remained quiet and her uncle began to speak but he stuttered and could not give complete answer to abu Talib, his words became disconnected and he was overwhelmed. He was a clergyman. Khadijah then began saying, ‘Uncle, even though you are my guardian in public, I have more control of myself. O Muhammad, I have given myself in marriage to you and mahr (dower) is on me from my assets. Ask your uncle to slaughter a camel for the wedding ceremony and you can join your family (wife).’ Abu Talib then said, ‘O people, bear witness to her accepting Muhammad (as her husband) and her taking responsibility of mahr (dower) from her wealth.’ A certain person from Quraysh said, ‘This is strange. Mahr (dower) is paid by women for men! ’ It made abu Talib very much upset and he stood up on his feet. People feared his anger and he said, ‘If they were like the son of my brother such people are sought with the highest price and the greatest amount of mahr (dower), and if they are of the like of your kind they cannot marry without paying a large amount for mahr (dower).’ Abu Talib slaughtered a she-camel for the wedding ceremony and the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, joined his family (wife). A man from Quraysh, called ‘Abd Allah ibn Ghanm, composed the following lines: ‘Congratulations and blessings! O Khadijah, the bird (of your good luck) has flown for you to the one happier than you. You have married the best of all the people. There is no one among people like Muhammad (in excellence). Happy news about him was given to all people by Jesus son of Mary as well as by Moses, son of ‘Imran and how close the promised time is! Writers of long ago in time had determined that from al-Batha there will come a messenger (of Allah) for guidance well guided.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:3:44",
  "kind": "verse_list"
}