{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:5:3", "titles": {"ar": "كتاب النِّكَاحِ", "en": "THE BOOK OF MARRIAGE"}}, {"indexed_titles": {"en": "Chapter 58"}, "path": "/books/al-kafi:5:3:58", "titles": {"ar": "باب الْمَرْأَةِ يُزَوِّجُهَا وَلِيَّانِ غَيْرُ الْأَبِ وَ الْجَدِّ كُلُّ وَاحِدٍ مِنْ رَجُلٍ آخَرَ", "en": "Chapter 58 – The woman is married off by two guardians, apart from the father and the grand-father, each one to another man"}}], "index": 1427, "local_index": 58, "part_type": "Chapter", "path": "/books/al-kafi:5:3:58", "titles": {"ar": "باب الْمَرْأَةِ يُزَوِّجُهَا وَلِيَّانِ غَيْرُ الْأَبِ وَ الْجَدِّ كُلُّ وَاحِدٍ مِنْ رَجُلٍ آخَرَ", "en": "Chapter 58 – The woman is married off by two guardians, apart from the father and the grand-father, each one to another man"}, "verse_count": 3, "verse_start_index": 9632, "verses": [{"index": 9633, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:3:58:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي امْرَأَةٍ أَنْكَحَهَا أَخُوهَا رَجُلًا ثُمَّ أَنْكَحَتْهَا أُمُّهَا بَعْدَ ذَلِكَ رَجُلًا وَ خَالُهَا أَوْ أَخٌ لَهَا صَغِيرٌ فَدُخِلَ بِهَا فَحَبِلَتْ فَاحْتَكَمَا فِيهَا فَأَقَامَ الْأَوَّلُ الشُّهُودَ فَأَلْحَقَهَا بِالْأَوَّلِ وَ جَعَلَ لَهَا الصَّدَاقَيْنِ جَمِيعاً وَ مَنَعَ زَوْجَهَا الَّذِي حُقَّتْ لَهُ أَنْ يَدْخُلَ بِهَا حَتَّى تَضَعَ حَمْلَهَا ثُمَّ أَلْحَقَ الْوَلَدَ بِأَبِيهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Najran, from Aasim Bin Humeyd, from Muhammad Bin Qays, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> judged regarding a woman whose brother got her married to a man, then her mother got her married after that to a (another) man, and her maternal uncle, or a brother of her’s was young. So he (the second husband) copulated with her, and she fell pregnant. So he<sup>asws</sup> judged between the two of them. So the first one established witnesses, so he<sup>asws</sup> attached her with the first one, and made two dowers to be for her, altogether, and forbade her husband who justified it that he should copulate with her until she places her burden (gives birth). Then he<sup>asws</sup> attached the child with its father’."}]}, {"index": 9634, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:3:58:2", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنْ صَفْوَانَ عَنِ ابْنِ مُسْكَانَ عَنْ وَلِيدٍ بَيَّاعِ الْأَسْفَاطِ قَالَ سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا عِنْدَهُ عَنْ جَارِيَةٍ كَانَ لَهَا أَخَوَانِ زَوَّجَهَا الْأَكْبَرُ بِالْكُوفَةِ وَ زَوَّجَهَا الْأَصْغَرُ بِأَرْضٍ أُخْرَى قَالَ الْأَوَّلُ بِهَا أَوْلَى إِلَّا أَنْ يَكُونَ الْآخَرُ قَدْ دَخَلَ بِهَا فَإِنْ دَخَلَ بِهَا فَهِيَ امْرَأَتُهُ وَ نِكَاحُهُ جَائِزٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan altogether, from Safwan, from Ibn Muskan, from Waleed Baya Al Asfaat who said, \n‘Abu Abdullah<sup>asws</sup> was asked and I was in his<sup>asws</sup> presence, about a girl who had brothers, and the elder one got her married in Al-Kufa, and the younger one got her married in another land. He<sup>asws</sup> said: ‘The first is one who is higher with her, except if it so happened that the later one had copulated with her. So if he had copulated with her, so she is his wife, and his marriage is allowed’."}]}, {"index": 9635, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:3:58:3", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ قَالَ سَأَلَهُ رَجُلٌ عَنْ رَجُلٍ مَاتَ وَ تَرَكَ أَخَوَيْنِ وَ الْبِنْتَ وَ الِابْنَةُ صَغِيرَةٌ فَعَمَدَ أَحَدُ الْأَخَوَيْنِ الْوَصِيُّ فَزَوَّجَ الِابْنَةَ مِنِ ابْنِهِ ثُمَّ مَاتَ أَبُو الِابْنِ الْمُزَوَّجِ فَلَمَّا أَنْ مَاتَ قَالَ الْآخَرُ أَخِي لَمْ يُزَوِّجْ ابْنَهُ فَزَوَّجَ الْجَارِيَةَ مِنِ ابْنِهِ فَقِيلَ لِلْجَارِيَةِ أَيُّ الزَّوْجَيْنِ أَحَبُّ إِلَيْكِ الْأَوَّلُ أَوِ الْآخَرُ قَالَتِ الْآخَرُ ثُمَّ إِنَّ الْأَخَ الثَّانِيَ مَاتَ وَ لِلْأَخِ الْأَوَّلِ ابْنٌ أَكْبَرُ مِنَ الِابْنِ الْمُزَوَّجِ فَقَالَ لِلْجَارِيَةِ اخْتَارِي أَيُّهُمَا أَحَبُّ إِلَيْكِ الزَّوْجُ الْأَوَّلُ أَوِ الزَّوْجُ الْآخَرُ \nفَقَالَ الرِّوَايَةُ فِيهَا أَنَّهَا لِلزَّوْجِ الْأَخِيرِ وَ ذَلِكَ أَنَّهَا [تَكُونُ] قَدْ كَانَتْ أَدْرَكَتْ حِينَ زَوَّجَهَا وَ لَيْسَ لَهَا أَنْ تَنْقُضَ مَا عَقَدَتْهُ بَعْدَ إِدْرَاكِهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail Bin Bazie who said, \n‘A man asked him<sup>asws</sup> about a man who died and left two brothers and the daughter, and the daughter was young. So one of the brothers was the executor of the will, so he got the daughter married to his own son. Then the father who got the son married, died. So when he died, the other brother said, ‘He did not get his son married, so he got the girl married to his own son. So it was said to the girl, which of the two husbands is more beloved to you, the former or the later?’ She said, ‘The later’. Then the second brother died, and for the first brother was son older than the son of the one who had given in marriage. So he said to the girl, ‘Choose which of the two is more beloved to you, the first husband or the last?’ \nSo he (the narrator) said, ‘The report has in it that she is for the later husband, and that is because she had happened to have reached adulthood when she was married off, and it is not for her that she breaks what she had bonded to, after her adulthood’.<a id=\"_ftnref1483\"></a><sup>[1483]</sup> (p.s. – This is not a Hadeeth)"}]}]}, "index": "al-kafi:5:3:58", "kind": "verse_list"}