{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 59"
        },
        "path": "/books/al-kafi:5:3:59",
        "titles": {
          "ar": "باب الْمَرْأَةِ يُزَوِّجُهَا وَلِيَّانِ غَيْرُ الْأَبِ وَ الْجَدِّ كُلُّ وَاحِدٍ مِنْ رَجُلٍ آخَرَ",
          "en": "Chapter 58 – The woman is married off by two guardians, apart from the father and the grand-father, each one to another man"
        }
      }
    ],
    "index": 1430,
    "local_index": 59,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 60"
        },
        "path": "/books/al-kafi:5:3:60",
        "titles": {
          "ar": "باب الْمَرْأَةِ تُوَلِّي أَمْرَهَا رَجُلًا لِيُزَوِّجَهَا مِنْ رَجُلٍ فَزَوَّجَهَا مِنْ غَيْرِهِ",
          "en": "Chapter 59 – The woman turn her affair to a man to get her married off to a man, but he marries her off to someone else"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 58"
        },
        "path": "/books/al-kafi:5:3:58",
        "titles": {
          "ar": "باب الرَّجُلُ يُرِيدُ أَنْ يُزَوِّجَ ابْنَتَهُ وَ يُرِيدُ أَبُوهُ أَنْ يُزَوِّجَهَا رَجُلًا آخَرَ",
          "en": "Chapter 57 – The man wants to get married off, and his father wants her to get married to another man"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:3:59",
    "titles": {
      "ar": "باب الْمَرْأَةِ يُزَوِّجُهَا وَلِيَّانِ غَيْرُ الْأَبِ وَ الْجَدِّ كُلُّ وَاحِدٍ مِنْ رَجُلٍ آخَرَ",
      "en": "Chapter 58 – The woman is married off by two guardians, apart from the father and the grand-father, each one to another man"
    },
    "verse_count": 3,
    "verse_start_index": 9635,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/134)"
        ],
        "index": 9636,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:59:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي امْرَأَةٍ أَنْكَحَهَا أَخُوهَا رَجُلًا ثُمَّ أَنْكَحَتْهَا أُمُّهَا بَعْدَ ذَلِكَ رَجُلًا وَ خَالُهَا أَوْ أَخٌ لَهَا صَغِيرٌ فَدُخِلَ بِهَا فَحَبِلَتْ فَاحْتَكَمَا فِيهَا فَأَقَامَ الْأَوَّلُ الشُّهُودَ فَأَلْحَقَهَا بِالْأَوَّلِ وَ جَعَلَ لَهَا الصَّدَاقَيْنِ جَمِيعاً وَ مَنَعَ زَوْجَهَا الَّذِي حُقَّتْ لَهُ أَنْ يَدْخُلَ بِهَا حَتَّى تَضَعَ حَمْلَهَا ثُمَّ أَلْحَقَ الْوَلَدَ بِأَبِيهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Najran, from Aasim Bin Humeyd, from Muhammad Bin Qays, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> judged regarding a woman whose brother got her married to a man, then her mother got her married after that to a (another) man, and her maternal uncle, or a brother of her’s was young. So he (the second husband) copulated with her, and she fell pregnant. So he<sup>asws</sup> judged between the two of them. So the first one established witnesses, so he<sup>asws</sup> attached her with the first one, and made two dowers to be for her, altogether, and forbade her husband who justified it that he should copulate with her until she places her burden (gives birth). Then he<sup>asws</sup> attached the child with its father’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu Najran from ‘Asem ibn Hamid from Muhammad ibn Qays who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin, ‘Alayhi al-Salam, issued a judgment. It was about the case of a woman whose brother gave her in marriage to one man and her mother gave her in marriage to another man, her maternal uncle or her brother were younger. He went to bed with her and she became pregnant and the two men sought judgment in the case. The first presented witnesses so she was joined with the first man. Two mahr (dowers) were assigned for her altogether; the Imam stopped the husband who won from going to bed with her until the birth of the child and related the child to the father (the winner of the case).’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/134)"
        ],
        "index": 9637,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:59:2",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنْ صَفْوَانَ عَنِ ابْنِ مُسْكَانَ عَنْ وَلِيدٍ بَيَّاعِ الْأَسْفَاطِ قَالَ سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا عِنْدَهُ عَنْ جَارِيَةٍ كَانَ لَهَا أَخَوَانِ زَوَّجَهَا الْأَكْبَرُ بِالْكُوفَةِ وَ زَوَّجَهَا الْأَصْغَرُ بِأَرْضٍ أُخْرَى قَالَ الْأَوَّلُ بِهَا أَوْلَى إِلَّا أَنْ يَكُونَ الْآخَرُ قَدْ دَخَلَ بِهَا فَإِنْ دَخَلَ بِهَا فَهِيَ امْرَأَتُهُ وَ نِكَاحُهُ جَائِزٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan altogether, from Safwan, from Ibn Muskan, from Waleed Baya Al Asfaat who said, ",
            "‘Abu Abdullah<sup>asws</sup> was asked and I was in his<sup>asws</sup> presence, about a girl who had brothers, and the elder one got her married in Al-Kufa, and the younger one got her married in another land. He<sup>asws</sup> said: ‘The first is one who is higher with her, except if it so happened that the later one had copulated with her. So if he had copulated with her, so she is his wife, and his marriage is allowed’."
          ],
          "en.sarwar": [
            "2. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar and Muhammad ibn ‘Isma’il has narrated from al-Fadl ibn Shadhan from all from Safwan from ibn Muskan from Walid Bayya’ al-Asfat who has said the following: “Once abu ‘Abd Allah, ‘Alayhi al-Salam, was asked about the case of a girl, when I was present, who had several brothers. The elder brother gave her in marriage in al-Kufah and the younger brother gave her in marriage in another land and he (the Imam) said, ‘The first has priority unless the other one has gone to bed with her, and if he has gone to bed she is his wife and his marriage is binding.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/135)"
        ],
        "index": 9638,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:59:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ قَالَ سَأَلَهُ رَجُلٌ عَنْ رَجُلٍ مَاتَ وَ تَرَكَ أَخَوَيْنِ وَ الْبِنْتَ وَ الِابْنَةُ صَغِيرَةٌ فَعَمَدَ أَحَدُ الْأَخَوَيْنِ الْوَصِيُّ فَزَوَّجَ الِابْنَةَ مِنِ ابْنِهِ ثُمَّ مَاتَ أَبُو الِابْنِ الْمُزَوَّجِ فَلَمَّا أَنْ مَاتَ قَالَ الْآخَرُ أَخِي لَمْ يُزَوِّجْ ابْنَهُ فَزَوَّجَ الْجَارِيَةَ مِنِ ابْنِهِ فَقِيلَ لِلْجَارِيَةِ أَيُّ الزَّوْجَيْنِ أَحَبُّ إِلَيْكِ الْأَوَّلُ أَوِ الْآخَرُ قَالَتِ الْآخَرُ ثُمَّ إِنَّ الْأَخَ الثَّانِيَ مَاتَ وَ لِلْأَخِ الْأَوَّلِ ابْنٌ أَكْبَرُ مِنَ الِابْنِ الْمُزَوَّجِ فَقَالَ لِلْجَارِيَةِ اخْتَارِي أَيُّهُمَا أَحَبُّ إِلَيْكِ الزَّوْجُ الْأَوَّلُ أَوِ الزَّوْجُ الْآخَرُ ",
          "فَقَالَ الرِّوَايَةُ فِيهَا أَنَّهَا لِلزَّوْجِ الْأَخِيرِ وَ ذَلِكَ أَنَّهَا [تَكُونُ] قَدْ كَانَتْ أَدْرَكَتْ حِينَ زَوَّجَهَا وَ لَيْسَ لَهَا أَنْ تَنْقُضَ مَا عَقَدَتْهُ بَعْدَ إِدْرَاكِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail Bin Bazie who said, ",
            "‘A man asked him<sup>asws</sup> about a man who died and left two brothers and the daughter, and the daughter was young. So one of the brothers was the executor of the will, so he got the daughter married to his own son. Then the father who got the son married, died. So when he died, the other brother said, ‘He did not get his son married, so he got the girl married to his own son. So it was said to the girl, which of the two husbands is more beloved to you, the former or the later?’ She said, ‘The later’. Then the second brother died, and for the first brother was son older than the son of the one who had given in marriage. So he said to the girl, ‘Choose which of the two is more beloved to you, the first husband or the last?’ ",
            "So he (the narrator) said, ‘The report has in it that she is for the later husband, and that is because she had happened to have reached adulthood when she was married off, and it is not for her that she breaks what she had bonded to, after her adulthood’.<a id=\"_ftnref1483\"></a><sup>[1483]</sup> (p.s. – This is not a Hadeeth)"
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ‘Isma’il ibn Bazi’ who has said the following: “Once a man asked him (the Imam), ‘Alayhi al-Salam, about the case of a man who dies and leaves behind two brothers and a daughter who is small. One brother becomes the executor of the will and gives the girl in marriage to his son. The father of the boy married to the girl dies and thereafter the other brother says that his brother did not give the girl in marriage to his son so he gives the girl in marriage to his son and the girl is asked, ‘Which one of the (two) husbands is more beloved to you?’ She says, ‘The other one (son of the second brother) is more beloved to me.’ Then the second brother dies and the other brother has left behind another son older than the son who was married to the girl. He asks the girl to choose whichever of the two she likes. He (the narrator) has said that Hadith about this case says that she is for the second husband because she at that time was able to discern when she was given in marriage and it is not lawful for her to disregard the marriage which is formed after her gaining the ability to discern.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:3:59",
  "kind": "verse_list"
}