{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:5:3", "titles": {"ar": "كتاب النِّكَاحِ", "en": "THE BOOK OF MARRIAGE"}}, {"indexed_titles": {"en": "Chapter 62"}, "path": "/books/al-kafi:5:3:62", "titles": {"ar": "باب الرَّجُلِ يَتَزَوَّجُ الْمَرْأَةَ وَ يَتَزَوَّجُ ابْنُهُ ابْنَتَهَا", "en": "Chapter 62 – The man marries the woman, and his son marries her daughter"}}], "index": 1431, "local_index": 62, "part_type": "Chapter", "path": "/books/al-kafi:5:3:62", "titles": {"ar": "باب الرَّجُلِ يَتَزَوَّجُ الْمَرْأَةَ وَ يَتَزَوَّجُ ابْنُهُ ابْنَتَهَا", "en": "Chapter 62 – The man marries the woman, and his son marries her daughter"}, "verse_count": 4, "verse_start_index": 9641, "verses": [{"index": 9642, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:3:62:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َبُو عَلِيٍّ الْأَشْعَرِيُّ</span> عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عِيصِ بْنِ الْقَاسِمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يُطَلِّقُ امْرَأَتَهُ ثُمَّ خَلَفَ عَلَيْهَا رَجُلٌ بَعْدُ فَوَلَدَتْ لِلْآخَرِ هَلْ يَحِلُّ وَلَدُهَا مِنَ الْآخَرِ لِوَلَدِ الْأَوَّلِ مِنْ غَيْرِهَا قَالَ نَعَمْ \nقَالَ وَ سَأَلْتُهُ عَنْ رَجُلٍ أَعْتَقَ سُرِّيَّةً لَهُ ثُمَّ خَلَفَ عَلَيْهَا رَجُلٌ بَعْدَهُ ثُمَّ وَلَدَتْ لِلْآخَرِ هَلْ يَحِلُّ وَلَدُهَا لِوَلَدِ الَّذِي أَعْتَقَهَا قَالَ نَعَمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Ays Bin Al Qasim, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the man who divorced his wife, then she was married by a man afterwards, so she gave birth for the later one. Are her children from the later one Permissible unto the children of the former one, from other than herself?’ He<sup>asws</sup> said: ‘Yes’. \nHe (the narrator) said, ‘And I asked him<sup>asws</sup> about a man who freed a concubine of his, then she was married by a man afterwards, then she gave birth for the later one. Are her children Permissible for the one who freed her?’ He<sup>asws</sup> said: ‘Yes’."}]}, {"index": 9643, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:3:62:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ وَ أَحْمَدُ بْنُ مُحَمَّدٍ الْعَاصِمِيُّ عَنْ عَلِيِّ بْنِ الْحَسَنِ بْنِ فَضَّالٍ عَنِ الْعَبَّاسِ بْنِ عَامِرٍ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ شُعَيْبٍ الْعَقَرْقُوفِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَكُونُ لَهُ الْجَارِيَةُ يَقَعُ عَلَيْهَا يَطْلُبُ وَلَدَهَا فَلَمْ يُرْزَقْ مِنْهَا وَلَداً فَوَهَبَهَا لِأَخِيهِ أَوْ بَاعَهَا فَوَلَدَتْ لَهُ أَوْلَاداً أَ يُزَوِّجُ وَلَدَهُ مِنْ غَيْرِهَا وَلَدَ أَخِيهِ مِنْهَا فَقَالَ أَعِدْ عَلَيَّ فَأَعَدْتُ عَلَيْهِ فَقَالَ لَا بَأْسَ بِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwa, and Ahmad Bin Muhammad Al Asimy, form Ali Bin Al Hassan Bin Fazzal, from Al Abbas Bin Aamir, from Safwan Bin Yahya, from Shuayb Al Aqarquqy who said, \n‘I asked Abu Abdullah<sup>asws</sup> about the man who happened to have the slave girl for him. He fell upon her seeking her child, but was not Graced with a child from her. So he gifted her to his brother, or sold her, so she gave birth to children for him. Can his children from other than her marry the children of his brother from her?’ So he<sup>asws</sup> said: ‘He<sup>asws</sup> told me to repeat it, so I repeated it to him<sup>asws</sup>. So he<sup>asws</sup> said : ‘There is no problem with it’."}]}, {"index": 9644, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:3:62:3", "text": "وَ عَنْهُ عَنِ الْحُسَيْنِ بْنِ خَالِدٍ الصَّيْرَفِيِّ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنْ هَذِهِ الْمَسْأَلَةِ فَقَالَ كَرِّرْهَا عَلَيَّ قُلْتُ لَهُ إِنَّهُ كَانَتْ لِي جَارِيَةٌ فَلَمْ تُرْزَقْ مِنِّي وَلَداً فَبِعْتُهَا فَوَلَدَتْ مِنْ غَيْرِي وَلَداً وَ لِي وَلَدٌ مِنْ غَيْرِهَا فَأُزَوِّجُ وَلَدِي مِنْ غَيْرِهَا وَلَدَهَا قَالَ تُزَوِّجُ مَا كَانَ لَهَا مِنْ وَلَدٍ قَبْلَكَ يَقُولُ قَبْلَ أَنْ يَكُونَ لَكَ", "translations": [{"lang": "en", "name": "hubeali", "text": "And from him, from Al Husayn Bin Khalid Al Sayrafi who said, \n‘I asked Abu Al-Hassan<sup>asws</sup> about this problem, so he<sup>asws</sup> said: ‘Repeat it to me<sup>asws</sup>’. I said to him<sup>asws</sup>, ‘There used to be a slave girl for me, but she was not Graced with a child from me. So I sold her, and she gave birth to children from someone else, and for me are children from other than her. So, can I give my children from other than her in marriage to her children?’ He<sup>asws</sup> said: ‘You can give in marriage to what was for her from the children before you, before she came to be for you’."}]}, {"index": 9645, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:5:3:62:4", "text": "وَ عَنْهُ عَنْ زَيْدِ بْنِ الْجُهَيْمِ الْهِلَالِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَتَزَوَّجُ الْمَرْأَةَ وَ يُزَوِّجُ ابْنَهُ ابْنَتَهَا فَقَالَ إِنْ كَانَتِ الِابْنَةُ لَهَا قَبْلَ أَنْ يَتَزَوَّجَ بِهَا فَلَا بَأْسَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "And from him, from Zayd Bin Al Juhaym Al Hilaly who said, \n‘I asked Abu Abdullah<sup>asws</sup> about the man who married the woman, and his son married her daughter. So he<sup>asws</sup> said: ‘If the daughter was for her before he married her, so there is no problem’."}]}]}, "index": "al-kafi:5:3:62", "kind": "verse_list"}