{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 63"
        },
        "path": "/books/al-kafi:5:3:63",
        "titles": {
          "ar": "باب الرَّجُلِ يَتَزَوَّجُ الْمَرْأَةَ وَ يَتَزَوَّجُ ابْنُهُ ابْنَتَهَا",
          "en": "Chapter 62 – The man marries the woman, and his son marries her daughter"
        }
      }
    ],
    "index": 1434,
    "local_index": 63,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 64"
        },
        "path": "/books/al-kafi:5:3:64",
        "titles": {
          "ar": "باب تَزْوِيجِ الصِّبْيَانِ ",
          "en": "Chapter 63 – Marriage of the children"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 62"
        },
        "path": "/books/al-kafi:5:3:62",
        "titles": {
          "ar": "باب الْحَدِّ الَّذِي يُدْخَلُ بِالْمَرْأَةِ فِيهِ ",
          "en": "Chapter 61 – The (age) limit which the woman can be copulated with"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:3:63",
    "titles": {
      "ar": "باب الرَّجُلِ يَتَزَوَّجُ الْمَرْأَةَ وَ يَتَزَوَّجُ ابْنُهُ ابْنَتَهَا",
      "en": "Chapter 62 – The man marries the woman, and his son marries her daughter"
    },
    "verse_count": 4,
    "verse_start_index": 9644,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/138)"
        ],
        "index": 9645,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/576",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/173",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2146",
              "text": "عِيصِ بْنِ الْقَاسِمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عِيصِ بْنِ الْقَاسِمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:63:1",
        "text": [
          " سَأَلْتُهُ عَنِ الرَّجُلِ يُطَلِّقُ امْرَأَتَهُ ثُمَّ خَلَفَ عَلَيْهَا رَجُلٌ بَعْدُ فَوَلَدَتْ لِلْآخَرِ هَلْ يَحِلُّ وَلَدُهَا مِنَ الْآخَرِ لِوَلَدِ الْأَوَّلِ مِنْ غَيْرِهَا قَالَ نَعَمْ ",
          "قَالَ وَ سَأَلْتُهُ عَنْ رَجُلٍ أَعْتَقَ سُرِّيَّةً لَهُ ثُمَّ خَلَفَ عَلَيْهَا رَجُلٌ بَعْدَهُ ثُمَّ وَلَدَتْ لِلْآخَرِ هَلْ يَحِلُّ وَلَدُهَا لِوَلَدِ الَّذِي أَعْتَقَهَا قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Ays Bin Al Qasim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the man who divorced his wife, then she was married by a man afterwards, so she gave birth for the later one. Are her children from the later one Permissible unto the children of the former one, from other than herself?’ He<sup>asws</sup> said: ‘Yes’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about a man who freed a concubine of his, then she was married by a man afterwards, then she gave birth for the later one. Are her children Permissible for the one who freed her?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            "1. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from ‘Is ibn al-Qasim who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who divorces his wife who marries another man and gives birth from the second man; if her children from the second husband are lawful for the children of the first husband from his wife other than her. He (the Imam) said, ‘Yes, it is lawful. 5 I then asked him about the case of a man who frees his slave- girl who marries another man and gives birth from the second man; if her children are lawful for the children of the man who freed her. He (the Imam) said, ‘Yes, they are lawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/138)"
        ],
        "index": 9646,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/105",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/749",
              "text": "صَفْوَانَ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3809",
              "text": "أَحْمَدُ بْنُ مُحَمَّدٍ الْعَاصِمِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4467",
              "text": "عَلِيِّ بْنِ الْحَسَنِ بْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1135",
              "text": "الْعَبَّاسِ بْنِ عَامِرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/173",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "شُعَيْبٍ الْعَقَرْقُوفِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ وَ أَحْمَدُ بْنُ مُحَمَّدٍ الْعَاصِمِيُّ عَنْ عَلِيِّ بْنِ الْحَسَنِ بْنِ فَضَّالٍ عَنِ الْعَبَّاسِ بْنِ عَامِرٍ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ شُعَيْبٍ الْعَقَرْقُوفِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:63:2",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَكُونُ لَهُ الْجَارِيَةُ يَقَعُ عَلَيْهَا يَطْلُبُ وَلَدَهَا فَلَمْ يُرْزَقْ مِنْهَا وَلَداً فَوَهَبَهَا لِأَخِيهِ أَوْ بَاعَهَا فَوَلَدَتْ لَهُ أَوْلَاداً أَ يُزَوِّجُ وَلَدَهُ مِنْ غَيْرِهَا وَلَدَ أَخِيهِ مِنْهَا فَقَالَ أَعِدْ عَلَيَّ فَأَعَدْتُ عَلَيْهِ فَقَالَ لَا بَأْسَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwa, and Ahmad Bin Muhammad Al Asimy, form Ali Bin Al Hassan Bin Fazzal, from Al Abbas Bin Aamir, from Safwan Bin Yahya, from Shuayb Al Aqarquqy who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man who happened to have the slave girl for him. He fell upon her seeking her child, but was not Graced with a child from her. So he gifted her to his brother, or sold her, so she gave birth to children for him. Can his children from other than her marry the children of his brother from her?’ So he<sup>asws</sup> said: ‘He<sup>asws</sup> told me to repeat it, so I repeated it to him<sup>asws</sup>. So he<sup>asws</sup> said : ‘There is no problem with it’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Safwan and Ahmad ibn Muhammad from al-‘Asemiy from Ali ibn al-Hassan Faddal from al-‘Abbas ibn ‘Amir from Safwan ibn Yahya from Shu’ayb al-‘Aqarqufiy who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who has a slave-girl with whom he goes to bed seeking to have a child, but does not become fortunate to have a child and gives her to his brother as a gift or sells her and she gives birth to several children; if his children from a woman other than her can marry the children of his brother from her. He (the Imam) asked me to say it again. I said it again and he (the Imam) said, ‘Yes, it is not unlawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/139)"
        ],
        "index": 9647,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "وَ عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4478",
              "text": "الْحُسَيْنِ بْنِ خَالِدٍ الصَّيْرَفِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ عَنْهُ عَنِ الْحُسَيْنِ بْنِ خَالِدٍ الصَّيْرَفِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:63:3",
        "text": [
          " سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنْ هَذِهِ الْمَسْأَلَةِ فَقَالَ كَرِّرْهَا عَلَيَّ قُلْتُ لَهُ إِنَّهُ كَانَتْ لِي جَارِيَةٌ فَلَمْ تُرْزَقْ مِنِّي وَلَداً فَبِعْتُهَا فَوَلَدَتْ مِنْ غَيْرِي وَلَداً وَ لِي وَلَدٌ مِنْ غَيْرِهَا فَأُزَوِّجُ وَلَدِي مِنْ غَيْرِهَا وَلَدَهَا قَالَ تُزَوِّجُ مَا كَانَ لَهَا مِنْ وَلَدٍ قَبْلَكَ يَقُولُ قَبْلَ أَنْ يَكُونَ لَكَ"
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Al Husayn Bin Khalid Al Sayrafi who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about this problem, so he<sup>asws</sup> said: ‘Repeat it to me<sup>asws</sup>’. I said to him<sup>asws</sup>, ‘There used to be a slave girl for me, but she was not Graced with a child from me. So I sold her, and she gave birth to children from someone else, and for me are children from other than her. So, can I give my children from other than her in marriage to her children?’ He<sup>asws</sup> said: ‘You can give in marriage to what was for her from the children before you, before she came to be for you’."
          ],
          "en.sarwar": [
            "3. It is narrated from the narrator of the previous Hadith from al-Husayn ibn Khalid al-Sayrafiy who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about this case and he asked me to say it again and I said, ‘I had a slave-girl and I was not fortunate to have a child from her so I sold her and she give birth to a child from someone other than me and I have a child from a woman other than her; if I can give in marriage my child from another woman to her child.’ He (the Imam) said, ‘You can give in marriage to her children who were before you, before she became yours.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/139)"
        ],
        "index": 9648,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "وَ عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4479",
              "text": "زَيْدِ بْنِ الْجُهَيْمِ الْهِلَالِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ عَنْهُ عَنْ زَيْدِ بْنِ الْجُهَيْمِ الْهِلَالِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:63:4",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَتَزَوَّجُ الْمَرْأَةَ وَ يُزَوِّجُ ابْنَهُ ابْنَتَهَا فَقَالَ إِنْ كَانَتِ الِابْنَةُ لَهَا قَبْلَ أَنْ يَتَزَوَّجَ بِهَا فَلَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Zayd Bin Al Juhaym Al Hilaly who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man who married the woman, and his son married her daughter. So he<sup>asws</sup> said: ‘If the daughter was for her before he married her, so there is no problem’."
          ],
          "en.sarwar": [
            "4. It is narrated from the narrator of the previous Hadith from Zayd ibn al-Juhaym al-Hilaliy who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who marries a woman and his son marries the daughter of that woman. He (the Imam) said, ‘If her daughter was there before she married him, it is not unlawful.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:3:63",
  "kind": "verse_list"
}