{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 65"
        },
        "path": "/books/al-kafi:5:3:65",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الرَّجُلِ يَهْوَى</span> امْرَأَةً وَ يَهْوَى أَبَوَاهُ غَيْرَهَا",
          "en": "Chapter 64 – The man desires a woman, and his parents desire (him to marry) someone else"
        }
      }
    ],
    "index": 1436,
    "local_index": 65,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 66"
        },
        "path": "/books/al-kafi:5:3:66",
        "titles": {
          "ar": "باب الشَّرْطِ فِي النِّكَاحِ وَ مَا يَجُوزُ مِنْهُ وَ مَا لَا يَجُوزُ",
          "en": "Chapter 65 – The stipulation regarding the marriage, and what is allowed from it, and what is not allowed"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 64"
        },
        "path": "/books/al-kafi:5:3:64",
        "titles": {
          "ar": "باب تَزْوِيجِ الصِّبْيَانِ ",
          "en": "Chapter 63 – Marriage of the children"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:3:65",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الرَّجُلِ يَهْوَى</span> امْرَأَةً وَ يَهْوَى أَبَوَاهُ غَيْرَهَا",
      "en": "Chapter 64 – The man desires a woman, and his parents desire (him to marry) someone else"
    },
    "verse_count": 2,
    "verse_start_index": 9652,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/142)"
        ],
        "index": 9653,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:65:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ح</span>ُمَيْدُ بْنُ زِيَادٍ</span> عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ عَلِيِّ بْنِ الْحَسَنِ بْنِ رِبَاطٍ عَنْ حَبِيبٍ الْخَثْعَمِيِّ عَنِ ابْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ إِنِّي أُرِيدُ أَنْ أَتَزَوَّجَ امْرَأَةً وَ إِنَّ أَبَوَيَّ أَرَادَا غَيْرَهَا قَالَ تَزَوَّجِ الَّتِي هَوِيتَ وَ دَعِ الَّتِي يَهْوَى أَبَوَاكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from Ali Bin Al Hassan Bin Rabaat, from Habeeb Al Khash’amy, from Ibn Abu Yafour, ",
            "Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘I want to marry a woman, and my parents want someone else’. He<sup>asws</sup> said: ‘Marry the one who (you) desire and leave the one whom your parents desire’."
          ],
          "en.sarwar": [
            "1. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad ibn Sama‘ah from al-Hassan Ribat from Habib ai-Khath’amiy from ibn abu Ya’fur who has said the foiiowing: “I once said to abu ‘ Abd Allah, ‘Alayhi al-Salam, ‘I want to marry with a woman but my father wants another one. He (the Imam) said, ‘Marry the one you love, not the one your parents love.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/142)"
        ],
        "index": 9654,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:65:2",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ إِسْمَاعِيلَ بْنِ سَهْلٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الْحَضْرَمِيِّ عَنِ الْكَاهِلِيِّ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّهُ سُئِلَ عَنْ رَجُلٍ  زَوَّجَتْهُ أُمُّهُ وَ هُوَ غَائِبٌ قَالَ النِّكَاحُ جَائِزٌ إِنْ شَاءَ الْمُتَزَوِّجُ قَبِلَ وَ إِنْ شَاءَ تَرَكَ فَإِنْ تَرَكَ الْمُتَزَوِّجُ تَزْوِيجَهُ فَالْمَهْرُ لَازِمٌ لِأُمِّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Ismail Bin Sahl, from Al Hassan Bin Muhammad Al Hazramy, from Al Kahily, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having been asked about a man whose mother got him married and he was absent. He<sup>asws</sup> said : ‘The marriage is allowed. If he so desires to, the married one can accept, but if he so desires to he leaves. So, if the married one were to leave his marriage, so the dower would be necessitated upon his mother’."
          ],
          "en.sarwar": [
            "2. Abu Ali ai-Ash’ariy has narrated from Muhammad ibn ‘Abd af-Jabbar from ‘Isma’ii ibn Sahf from al-Hassan ibn Muhammad ai- Hadramy from al-Kahiiy from Muhammad ibn Musfim who has said the foiiowing: “Once, abu Ja’far, ‘Alayhi al-Salam, was asked about the case of a man whose mother arranged marriage for him in his absence. He (the Imam) said, ‘Marriage is permissible, the husband may agree or disagree; and if he disagrees payment of mahr (dower) becomes due on his mother.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:3:65",
  "kind": "verse_list"
}