{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 68"
        },
        "path": "/books/al-kafi:5:3:68",
        "titles": {
          "ar": "باب الرَّجُلِ يُدَلِّسُ نَفْسَهُ وَ الْعِنِّينِ",
          "en": "Chapter 67 – The man who cheats and the impotent"
        }
      }
    ],
    "index": 1439,
    "local_index": 68,
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:3:68",
    "titles": {
      "ar": "باب الرَّجُلِ يُدَلِّسُ نَفْسَهُ وَ الْعِنِّينِ",
      "en": "Chapter 67 – The man who cheats and the impotent"
    },
    "verse_count": 11,
    "verse_start_index": 9682,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/158)"
        ],
        "index": 9683,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:68:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي امْرَأَةٍ حُرَّةٍ دَلَّسَ لَهَا عَبْدٌ فَنَكَحَهَا وَ لَمْ تَعْلَمْ إِلَّا أَنَّهُ حُرٌّ قَالَ يُفَرَّقُ بَيْنَهُمَا إِنْ شَاءَتِ الْمَرْأَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Najran, from Aasim Bin Humeyd, from Muhammad Bin Qays, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> judged regarding a free woman, a slave cheated her, so he married her and she did not know except that he was a free man. He<sup>asws</sup> said: ‘Separation would be effected between the two of them if the woman so desires it’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu Najran from ‘Asem ibn Hamid from Muhammad ibn Qays who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin, ‘Alayhi al-Salam, issued a judgment about the case of a free woman who was cheated by a slave who married her and she did not know him to be other than a free man. He (the Imam) said, ‘They must be separated if the woman so wanted.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/159)"
        ],
        "index": 9684,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:68:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ امْرَأَةٍ حُرَّةٍ تَزَوَّجَتْ مَمْلُوكاً عَلَى أَنَّهُ حُرٌّ فَعَلِمَتْ بَعْدُ أَنَّهُ مَمْلُوكٌ قَالَ هِيَ أَمْلَكُ بِنَفْسِهَا إِنْ شَاءَتْ أَقَرَّتْ مَعَهُ وَ إِنْ شَاءَتْ فَلَا فَإِنْ كَانَ دَخَلَ بِهَا فَلَهَا الصَّدَاقُ وَ إِنْ لَمْ يَكُنْ دَخَلَ بِهَا فَلَيْسَ لَهَا شَيْ‏ءٌ فَإِنْ هُوَ دَخَلَ بِهَا بَعْدَ مَا عَلِمَتْ أَنَّهُ مَمْلُوكٌ وَ أَقَرَّتْ بِذَلِكَ فَهُوَ أَمْلَكُ بِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about a free woman who married a slave upon a stipulation that he was a free man. So she came to know afterwards that he was a slave. He<sup>asws</sup> said: ‘She is in control of herself. If she so desires to, she can stay with him, and if she so desires it, so no. So if he had copulated with her, then for her would be the dower, and if he had not happened to have copulated with her, so there would be nothing for her. So, if he were to copulated with her after she had come to know that he was a slave, and she was in agreement with that, so he would be more in control over her’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from al-‘Ala’ ibn Razin from Muhammad ibn Muslim who has said the following: “This is concerning my question before abu Ja‘far, ‘Alayhi al-Salam, about the case of a woman who is free and marries a slave thinking that he is free and then finds out that he is a slave. He (the Imam) said, ‘She has all the control of herself; if she wants she can stay with him or not stay with him. If he has gone to be bed with her she has the mahr (dower) and if he has not gone to bed with her she does not have any mahr (dower). If he goes to bed with her after her knowing that he is a slave and confirms it then he has more of her control.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/159)"
        ],
        "index": 9685,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:68:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنِ ابْنِ بُكَيْرٍ عَنْ أَبِيهِ عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي خَصِيٍّ دَلَّسَ نَفْسَهُ لِامْرَأَةٍ مُسْلِمَةٍ فَتَزَوَّجَهَا قَالَ فَقَالَ يُفَرَّقُ بَيْنَهُمَا إِنْ شَاءَتِ الْمَرْأَةُ وَ يُوجَعُ رَأْسُهُ وَ إِنْ رَضِيَتْ بِهِ وَ أَقَامَتْ مَعَهُ لَمْ يَكُنْ لَهَا بَعْدَ رِضَاهَا بِهِ أَنْ تَأْبَاهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad and Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, form Ali Bin Raib, from Ibn Bukeyr, from his father, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) regarding a eunuch who deceived a Muslim woman, so she married him. So he<sup>asws</sup> said: ‘Separation would be effected between the two of them if the woman so desires it, and his head would be pained, and if she is pleased with it and stays with him, it would not be for her, after her agreement with it, that she refuses him’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from and Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hassan ibn Mahbub from ibn Ri’ab from ibn Bukayr from his father who has said the following: “About the case of a castrated man who cheats and marries a Muslim woman, one of the two Imam, (abu Ja’far or abu ‘Abd Allah), ‘Alayhim al-Salam, has said, ‘They are separated from each other if she wants and he will have a headache, but if she agrees and stays with him, after her agreement she cannot deny him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/159)"
        ],
        "index": 9686,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:68:4",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ أَبَانٍ عَنْ عَبَّادٍ الضَّبِّيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي الْعِنِّينِ إِذَا عُلِمَ أَنَّهُ عِنِّينٌ لَا يَأْتِي النِّسَاءَ  فُرِّقَ بَيْنَهُمَا وَ إِذَا وَقَعَ عَلَيْهَا وَقْعَةً وَاحِدَةً لَمْ يُفَرَّقْ بَيْنَهُمَا وَ الرَّجُلُ لَا يُرَدُّ مِنْ عَيْبٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Aban, from Abbad Al Zabby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Regarding the impotent, when it is known that he is impotent, not coming to the women, separation would be effected between the two, and when he has fallen upon her with one falling, there would not be a separation between the two, and the man would not be rejected from a fault’."
          ],
          "en.sarwar": [
            "4. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from Aban from ‘Abbad al-Dabbiy who has said the following: “About the case of a man who is impotent, abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘When it is found out that he is impotent and cannot sleep with women, they are separated from each other; and if he goes to bed with her even once then they are not separated from each other; man is not turned away because of defect.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح وآخره مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/160)"
        ],
        "index": 9687,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:68:5",
        "text": [
          "عَنْهُ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ امْرَأَةٍ ابْتُلِيَ زَوْجُهَا فَلَا يَقْدِرُ عَلَى الْجِمَاعِ أَ تُفَارِقُهُ قَالَ نَعَمْ إِنْ شَاءَتْ ",
          "قَالَ ابْنُ مُسْكَانَ وَ فِي حَدِيثٍ آخَرَ تَنْتَظِرُ سَنَةً فَإِنْ أَتَاهَا وَ إِلَّا فَارَقَتْهُ فَإِنْ أَحَبَّتْ أَنْ تُقِيمَ مَعَهُ فَلْتُقِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Safwan Bin Yahya, from Ibn Muskan, from Abu Baseer who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a woman who tried her husband, but he was not able upon the copulation, can she separate from him?’ He<sup>asws</sup> said: ‘Yes, if she so desires it’. ",
            "Ibn Muskan (the narrator) said, ‘And in another Hadeeth, ‘(He<sup>asws</sup> said): ‘She would wait for a year. So if he comes to her, or else she separates from him. But, if she loves to stay with him, so let her stay’."
          ],
          "en.sarwar": [
            "5. It is narrated from the narrator of the previous Hadith from Safwan ibn Yahya from ibn Muskan from abu Basir who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a woman who tries her husband but he is not able to go to bed with her; if they must be separated from each other. He (the Imam) said, ‘Yes, if she wants separation.’ Ibn Muskan has said that in another Hadith he (the Imam) has said that she must wait for one year and if he still is not able to go to bed with her, she can leave him, but if she likes to stay with him she can do so.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/160)"
        ],
        "index": 9688,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:68:6",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ أَخِيهِ الْحَسَنِ عَنْ زُرْعَةَ بْنِ مُحَمَّدٍ عَنْ سَمَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ خَصِيّاً دَلَّسَ نَفْسَهُ لِامْرَأَةٍ قَالَ يُفَرَّقُ بَيْنَهُمَا وَ تَأْخُذُ الْمَرْأَةُ مِنْهُ صَدَاقَهَا وَ يُوجَعُ ظَهْرُهُ كَمَا دَلَّسَ نَفْسَهُ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from his brother Al Hassan, from Zur’at Bin Muhammad, from Sama’at, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> if a eunuch deceived the woman. He<sup>asws</sup> said: ‘Separation would be effected between the two, and the woman would take her dower from him, and his back would be pained just as he had deceived himself’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Ahmad ibn Muhammad from al-Hassan ibn Sa‘id from his brother al-Hassan ibn Zur’ah ibn Muhammad ibn Sanaa ‘ah who has said the following: “About the case of a man who is castrated but he cheats and marries a woman, abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘They are separated from each other and the women takes her mahr (dower) from him and he will have a backache (punishment) because of his cheating.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/161)"
        ],
        "index": 9689,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:68:7",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ أَبِي حَمْزَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ إِذَا تَزَوَّجَ الرَّجُلُ الْمَرْأَةَ الثَّيِّبَ الَّتِي قَدْ تَزَوَّجَتْ زَوْجاً غَيْرَهُ فَزَعَمَتْ أَنَّهُ لَمْ يَقْرَبْهَا مُنْذُ دَخَلَ بِهَا فَإِنَّ الْقَوْلَ فِي ذَلِكَ قَوْلُ الرَّجُلِ وَ عَلَيْهِ أَنْ يَحْلِفَ بِاللَّهِ لَقَدْ جَامَعَهَا لِأَنَّهَا الْمُدَّعِيَةُ ",
          "قَالَ فَإِنْ تَزَوَّجَهَا وَ هِيَ بِكْرٌ فَزَعَمَتْ أَنَّهُ لَمْ يَصِلْ إِلَيْهَا فَإِنَّ مِثْلَ هَذَا يَعْرِفُ النِّسَاءُ فَلْيَنْظُرْ إِلَيْهَا مَنْ يُوثَقُ بِهِ مِنْهُنَّ فَإِذَا ذَكَرَتْ أَنَّهَا عَذْرَاءُ فَعَلَى الْإِمَامِ أَنْ يُؤَجِّلَهُ سَنَةً فَإِنْ وَصَلَ إِلَيْهَا وَ إِلَّا فَرَّقَ بَيْنَهُمَا وَ أُعْطِيَتْ نِصْفَ الصَّدَاقِ وَ لَا عِدَّةَ عَلَيْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, and Muhammad Bin yahya, from Ahmad Bin Muhammad altogether, from Al Hassan Bin Mahboub, from Ali Bin Raib, from Abu Hamza who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘When the man marries the divorced/widowed woman who had married a husband other than him, so she alleges that he did not come near her since she had copulated beforehand. So the (final) word regarding that would be the word of the man, and upon him is that he swears an oath by Allah<sup>azwj</sup> that he has copulated with her, because she is the plaintiff’. ",
            "He<sup>asws</sup> said: ‘So if he had married her and she was a virgin, and she claims that he has not arrived to her, so in an situation like this are the good women, so let her be examined by the one who is reliable with it from them. So when she mentions that she is (still) a virgin, so it is upon the Imam<sup>asws</sup> that he respites her for a year. So if he arrives to her, or else there would be a separation between the two, and she would be given half the dower, and there would be no waiting period upon her’."
          ],
          "en.sarwar": [
            "7. A number of our people have narrated from Sahl ibn Ziyad and Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad all from ibn Mahbub from ibn Ri’ab from abu Hamzah who has said the following: “I once heard abu Ja‘far, ‘Alayhi al-Salam, saying, ‘If a man marries a woman who was married before to another man and she alleges that the man has not come close to her from the time he entered with her in such case, the words of the man are accepted on oath by Allah that he has gone to bed with her because she is a plaintiff. 5 He (the Imam) has said, ‘If he marries her as a virgin and she alleges that he never approached her, it then is the job of trustworthy women who can examine her and if they say that she is virgin then the Imam gives him one year’s time during which if he is able to reach her, otherwise, they are separated from each other and she is given half of the mahr (dower) and no waiting period is required.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/161)"
        ],
        "index": 9690,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:68:8",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ الْهَاشِمِيِّ عَنْ بَعْضِ مَشِيخَتِهِ قَالَ قَالَتِ امْرَأَةٌ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ سَأَلَهُ رَجُلٌ عَنْ رَجُلٍ تَدَّعِي عَلَيْهِ امْرَأَتُهُ أَنَّهُ عِنِّينٌ وَ يُنْكِرُ الرَّجُلُ قَالَ تَحْشُوهَا الْقَابِلَةُ بِالْخَلُوقِ وَ لَا تُعْلِمُ الرَّجُلَ وَ يَدْخُلُ عَلَيْهَا الرَّجُلُ فَإِنْ خَرَجَ وَ عَلَى ذَكَرِهِ الْخَلُوقُ صَدَقَ وَ كَذَبَتْ وَ إِلَّا صَدَقَتْ وَ كَذَبَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Abdullah Bin Al Fazl Al Hashimy, from one of his elders who said, ",
            "‘A woman said to Abu Abdullah<sup>asws</sup>, and a man had asked about a man whose wife had claimed upon him that he is impotent, and the man denied it. He<sup>asws</sup> said: ‘The midwife would apply <span class=\"iTxt\">Al Kahlouq</span> (a perfume) on her and not let the man know, and the man would go over to her. So if he comes out, and <span class=\"iTxt\">Al Khalouq</span> is upon his manhood, he would be ratified, and she would be belied, or else she would be ratified, and he would be belied’."
          ],
          "en.sarwar": [
            "8. A number of our people have narrated from Ahmad ibn Muhammad from ibn Khalid from his father from ‘Abd Allah ibn al-Fadl al- Hashimiy from certain persons of his teachers who have said the following: “It is about the case of a woman before abu ‘Abd Allah, ‘Alayhi al-Salam, when a man asked him (the Imam) about a man against whom his wife alleges that he is impotent but the man denies it, abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘She must allow the nurse to fill her with al-Khaluq (a certain perfume) without allowing the man to know. He then goes to bed with her; if perfume is found on his penis he has told the truth, otherwise, she has spoken the truth and he has lied.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/162)"
        ],
        "index": 9691,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:68:9",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ الْحَسَنِ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ مُصَدِّقِ بْنِ صَدَقَةَ عَنْ عَمَّارِ بْنِ مُوسَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ سُئِلَ عَنْ رَجُلٍ أُخِّذَ عَنِ امْرَأَتِهِ فَلَا يَقْدِرُ عَلَى إِتْيَانِهَا فَقَالَ إِنْ كَانَ لَا يَقْدِرُ عَلَى إِتْيَانِ غَيْرِهَا مِنَ النِّسَاءِ فَلَا يُمْسِكْهَا إِلَّا بِرِضَاهَا بِذَلِكَ وَ إِنْ كَانَ يَقْدِرُ عَلَى غَيْرِهَا فَلَا بَأْسَ بِإِمْسَاكِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ahmad Bin Al Hassan, from Amro Bin Saeed, from Musaddaq Bin Sadaqa, form Ammar Bin Musa, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having been asked about a man who is seized from his wife, so he is not able upon going to her. So he<sup>asws</sup> said: ‘If it was such that he was not able upon going to other than her from the women, so he should not keep her except with her agreement with that; and if it was such that he was able upon other than her, so there is no problem with keeping her’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ahmad ibn al-Hassan from ‘Amr ibn Sa‘id from Musaddiq ibn Sadaqah from ‘Ammar ibn Musa who has said the following: “Once abu ‘Abd Allah, ‘Alayhi al-Salam, was asked about the case of a man who is held back (by magic) and cannot go to bed with his wife. He (the Imam) said, ‘If he cannot go to bed with other woman also, he must not keep her on hold without her consent; but if he is able to go to bed with other women then it is not unlawful to keep her.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/162)"
        ],
        "index": 9692,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:68:10",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) مَنْ أَتَى امْرَأَتَهُ مَرَّةً وَاحِدَةً ثُمَّ أُخِّذَ عَنْهَا فَلَا خِيَارَ لَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, form his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘The one who goes to his wife once, then he is seized from it, so there is no choice for her’."
          ],
          "en.sarwar": [
            "10. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin, ‘Alayhi al-Salam, has said, ‘If a man only once goes to bed with his wife then is held back (by magic), no choice then remains for her (to revoke the marriage).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/162)"
        ],
        "index": 9693,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:68:11",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ حَمْدَانَ الْقَلَانِسِيِّ عَنْ إِسْحَاقَ بْنِ بُنَانٍ عَنِ ابْنِ بَقَّاحٍ عَنْ غِيَاثِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ ادَّعَتِ امْرَأَةٌ عَلَى زَوْجِهَا عَلَى عَهْدِ أَمِيرِ الْمُؤْمِنِينَ صَلَوَاتُ اللَّهِ عَلَيْهِ أَنَّهُ لَا يُجَامِعُهَا وَ ادَّعَى أَنَّهُ يُجَامِعُهَا فَأَمَرَهَا أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَنْ تَسْتَذْفِرَ بِالزَّعْفَرَانِ ثُمَّ يَغْسِلَ ذَكَرَهُ فَإِنْ خَرَجَ الْمَاءُ أَصْفَرَ صَدَّقَهُ وَ إِلَّا أَمَرَهُ بِطَلَاقِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Hamdan Al qalanasy, from Is’haq Bin Bunan, from Ibn Baqqah, from Giyas Bin Ibrahim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A woman claimed upon her husband, in the era of Amir Al-Momineen<sup>asws</sup> that he does not copulate with her, but he denied it. So Amir Al-Momineen<sup>asws</sup> ordered her that she should apply herself with saffron, then he should wash his manhood, so if the water comes to be yellow, he would be ratified, or else he<sup>asws</sup> ordered with divorcing her’."
          ],
          "en.sarwar": [
            "11. Al-Husayn from Muhammad has narrated from Hamdan al-Qalanisiy from Ishaq ibn Bunan from ibn Baqqah from Ghiyath ibn Ibrahim who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that during the time of ’Amir al-Mu’minin, ‘Alayhi al- Salam, a woman alleged that her husband is not able to go to bed with her and he denied it. ’Amir al- Mu’minin commanded her to fill up herself with saffron and that he then washes his penis; if the water takes the color of saffron his words are accepted, otherwise, he is commanded to divorce her.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:3:68",
  "kind": "verse_list"
}