{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 74"
        },
        "path": "/books/al-kafi:5:3:74",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الرَّجُلِ يَفْجُرُ</span> بِالْمَرْأَةِ فَيَتَزَوَّجُ أُمَّهَا أَوِ ابْنَتَهَا أَوْ يَفْجُرُ بِأُمِّ امْرَأَتِهِ أَوِ ابْنَتِهَا",
          "en": "Chapter 73 – The man is immoral with the woman, so he marries her mother, or her daughter, or he is immoral with a mother of his wife, or her daughter"
        }
      }
    ],
    "index": 1445,
    "local_index": 74,
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:3:74",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الرَّجُلِ يَفْجُرُ</span> بِالْمَرْأَةِ فَيَتَزَوَّجُ أُمَّهَا أَوِ ابْنَتَهَا أَوْ يَفْجُرُ بِأُمِّ امْرَأَتِهِ أَوِ ابْنَتِهَا",
      "en": "Chapter 73 – The man is immoral with the woman, so he marries her mother, or her daughter, or he is immoral with a mother of his wife, or her daughter"
    },
    "verse_count": 10,
    "verse_start_index": 9703,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/168)"
        ],
        "index": 9704,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:74:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) أَنَّهُ سُئِلَ عَنِ الرَّجُلِ يَفْجُرُ بِالْمَرْأَةِ أَ يَتَزَوَّجُ ابْنَتَهَا قَالَ لَا وَ لَكِنْ إِنْ كَانَتْ عِنْدَهُ امْرَأَةٌ ثُمَّ فَجَرَ بِأُمِّهَا أَوِ ابْنَتِهَا أَوْ أُخْتِهَا لَمْ تَحْرُمْ عَلَيْهِ امْرَأَتُهُ إِنَّ الْحَرَامَ لَا يُفْسِدُ الْحَلَالَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) having been asked about the man who was immoral with the woman, can he marry her daughter?’ He<sup>asws</sup> said: ‘No, but if the woman was with him (as his wife), then he was immoral with her mother, or her daughter, or her sister, his wife would not be Prohibited unto him. The Prohibited does not spoil the Permissible’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from al-‘Ala’ ibn Razin from Muhammad ibn Muslim who has said the following: “One of the two Imam, (abu Ja’far or abu ‘Abd Allah), ‘Alayhim al-Salam, was asked about the case of a man who went to bed with a woman out of wedlock; if he could marry her daughter. He (the Imam) said, ‘No, however, if a woman is his wife and he goes to bed with her mother or her daughter or sister, his wife does not become unlawful for him because unlawful does not destroy what is lawful. 5 ” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/168)"
        ],
        "index": 9705,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:74:2",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عِيصِ بْنِ الْقَاسِمِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ بَاشَرَ امْرَأَةً وَ قَبَّلَ غَيْرَ أَنَّهُ لَمْ يُفْضِ إِلَيْهَا ثُمَّ تَزَوَّجَ ابْنَتَهَا قَالَ إِذَا لَمْ يَكُنْ أَفْضَى إِلَى الْأُمِّ فَلَا بَأْسَ وَ إِنْ كَانَ أَفْضَى إِلَيْهَا فَلَا يَتَزَوَّجِ ابْنَتَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, and Muhammad Bin Ismail, from Al Fazl Bin Shazan, altogether from Safwan Bin Yahya, from Ays Bin Al Qasim who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who spent time with a woman and kissed, apart from it that he did not copulate with her. Then he married her daughter. He<sup>asws</sup> said: ‘When he did not happen to have copulated with the mother, so there is no problem, but if it was such that he had copulated with her, so she cannot marry her daughter’."
          ],
          "en.sarwar": [
            "2. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar and Muhammad ibn ‘Isma’il has narrated from al-Fadl ibn Shadhan from all from Safwan ibn Yahya from ‘Is ibn al-Qasim who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who associates with a woman and kisses her but does not go to bed with her; if he can marry her daughter. He (the Imam) said, ‘If he has not gone to bed with the mother, it is not unlawful to marry her but if he has gone to bed with her mother then he must not marry her (the daughter).’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/169)"
        ],
        "index": 9706,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:74:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ تَزَوَّجَ جَارِيَةً فَدَخَلَ بِهَا ثُمَّ ابْتُلِيَ بِهَا فَفَجَرَ بِأُمِّهَا أَ تَحْرُمُ عَلَيْهِ امْرَأَتُهُ فَقَالَ لَا إِنَّهُ لَا يُحَرِّمُ الْحَلَالَ الْحَرَامُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who married a girl, so he went to bed with her. Then due to wickedness he goes to bed with her mother. Would his wife be prohibited unto him?’ So he<sup>asws</sup> said: ‘No. The Permissible cannot be Prohibited by the Prohibition’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “About the case of a man who marries a girl then goes to bed with her, then due to wickedness goes to bed with her mother; if she becomes unlawful for him, abu Ja‘far, ‘Alayhi al-Salam, has said, ‘His wife does not become unlawful for him.’ He (the Imam) then said, ‘Unlawful never makes a lawful thing unlawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/169)"
        ],
        "index": 9707,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:74:4",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّهُ قَالَ فِي رَجُلٍ زَنَى بِأُمِّ امْرَأَتِهِ أَوْ بِابْنَتِهَا أَوْ بِأُخْتِهَا فَقَالَ لَا يُحَرِّمُ ذَلِكَ عَلَيْهِ امْرَأَتَهُ ثُمَّ قَالَ مَا حَرَّمَ حَرَامٌ قَطُّ حَلَالًا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Ibn Abu Umer, from Umar Bin Azina, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said regarding a man who committed adultery with the mother of his wife, or with her daughter, or with her sister. So he<sup>asws</sup> said: ‘They would not make his wife to be Prohibited unto him’. Then he<sup>asws</sup> said: ‘A Prohibition cannot Prohibit a Permissible at all’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ibn ‘Udhaynah from Zurarah who has said the following: “About the case of a man who goes to bed with his mother-in-law or his stepdaughter or her sister, abu Ja’far ‘Alayhi al-Salam, has said, ‘This does not make his wife unlawful for him.’ He (the Imam) then said, ‘Unlawful does not make a lawful thing unlawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/169)"
        ],
        "index": 9708,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:74:5",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ مَنْصُورِ بْنِ حَازِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ كَانَ بَيْنَهُ وَ بَيْنَ امْرَأَةٍ فُجُورٌ فَهَلْ يَتَزَوَّجُ ابْنَتَهَا فَقَالَ إِنْ كَانَ مِنْ قُبْلَةٍ أَوْ شِبْهِهَا فَلْيَتَزَوَّجِ ابْنَتَهَا وَ إِنْ كَانَ جِمَاعاً فَلَا يَتَزَوَّجِ ابْنَتَهَا وَ لْيَتَزَوَّجْهَا هِيَ إِنْ شَاءَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Mansour Bin Hazim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man between him and a woman was an immorality, so can he marry her daughter?’ So he<sup>asws</sup> said: ‘If it was from kissing or such like, so let him marry his daughter, and if it was copulation, so he cannot marry her daughter, and let him marry her (the mother) if he so desires to’."
          ],
          "en.sarwar": [
            "5. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan from Mansur ibn Hazim who has said the following: “About the case of a man and a woman who are involved in sinful activities; if he can marry her daughter, abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If such activities are in the form of kissing or similar things he can marry her daughter; but if it is sexual intercourse then he must not marry her daughter, he can, however, marry the woman if he wants.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/169)"
        ],
        "index": 9709,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:74:6",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ زُرَارَةَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ رَجُلٍ زَنَى بِأُمِّ امْرَأَتِهِ أَوْ بِأُخْتِهَا فَقَالَ لَا يُحَرِّمُ ذَلِكَ عَلَيْهِ امْرَأَتَهُ إِنَّ الْحَرَامَ لَا يُفْسِدُ الْحَلَالَ وَ لَا يُحَرِّمُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ibn Mahboub, from Ali Bin Raib, from Zurara who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about a man who committed adultery with the mother of his wife, or with her sister. So he<sup>asws</sup> said: ‘That would not make his wife to be Prohibited unto him. The Prohibited does not spoil the permissible, nor does it Prohibit it’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Sahl ibn Ziyad from ibn Mahbub from ibn Ri’ab from Zurarah who has said the following: “This is concerning my question before abu Ja‘far, ‘Alayhi al-Salam, about the case of a man who goes to bed with the mother of his wife or her sister. He (the Imam) said, ‘This does not make his wife unlawful for him; unlawful does not destroy or make lawful ones unlawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/169)"
        ],
        "index": 9710,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:74:7",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ مَنْصُورِ بْنِ حَازِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ كَانَ بَيْنَهُ وَ بَيْنَ امْرَأَةٍ فُجُورٌ فَقَالَ إِنْ كَانَ قُبْلَةً أَوْ شِبْهَهَا فَلْيَتَزَوَّجِ ابْنَتَهَا إِنْ شَاءَ وَ إِنْ كَانَ جِمَاعاً فَلَا يَتَزَوَّجِ ابْنَتَهَا وَ لْيَتَزَوَّجْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from one of his companions, from Aban Bin Usman, from Mansour Bin Hazim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man between him and a woman was immorality. So he<sup>asws</sup> said: ‘If it was kissing or such like, so let him marry her daughter if he so desires to, but if it was copulation, so he cannot marry her daughter, and let him marry her (the mother)’."
          ],
          "en.sarwar": [
            "7. Al-Husayn from Muhammad has narrated from Mu’alla’ ibn Muhammad from certain persons of his people from Aban ibn ‘Uthman from Mansur ibn Hazim who has said the following: “This is concerning my question before abu ‘ Abd Allah, ‘Alayhi al-Salam, about the case of a man and a woman who are involved in sinful acts. He (the Imam) said, Tf such activities are in the form of kissing or similar things he can marry her daughter; but if it is sexual intercourse then he must not marry her daughter, he can, however, marry the woman if he wants.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/169)"
        ],
        "index": 9711,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:74:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ فَجَرَ بِامْرَأَةٍ أَ يَتَزَوَّجُ أُمَّهَا مِنَ الرَّضَاعَةِ أَوِ ابْنَتَهَا قَالَ لَا .",
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who was immoral with a woman, can he marry her mother from the breastfeeding, or her daughter?’ He<sup>asws</sup> said: ‘No’. ",
            "<span style=\"font-size: small\">Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Al A’ala Bin Razeyn, form Muhammad Bin Muslim,</span> from Abu Ja’far<sup>asws</sup> – similar to it."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from al-‘Ala’ ibn Razin from Muhammad ibn Muslim who has said the following: “I once asked one of the two Imam, (abu Ja’far or abu ‘Abd Allah), ‘Alayhim al-Salam, about the case of a man who had committed sinful acts with a woman if he could marry her breastfeeding mother or daughter. He (the Imam) said, ‘No, he cannot do so.’ Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from al-‘Ala’ ibn Razin from Muhammad ibn Muslim a similar Hadith.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/170)"
        ],
        "index": 9712,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:74:9",
        "text": [
          "ابْنُ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ يَزِيدَ الْكُنَاسِيِّ قَالَ إِنَّ رَجُلًا مِنْ أَصْحَابِنَا تَزَوَّجَ امْرَأَةً فَقَالَ لِي أُحِبُّ أَنْ تَسْأَلَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ تَقُولَ لَهُ إِنَّ رَجُلًا مِنْ أَصْحَابِنَا تَزَوَّجَ امْرَأَةً قَدْ زَعَمَ أَنَّهُ كَانَ يُلَاعِبُ أُمَّهَا وَ يُقَبِّلُهَا مِنْ غَيْرِ أَنْ يَكُونَ أَفْضَى إِلَيْهَا قَالَ  فَسَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لِي كَذَبَ مُرْهُ فَلْيُفَارِقْهَا ",
          "قَالَ فَرَجَعْتُ مِنْ سَفَرِي فَأَخْبَرْتُ الرَّجُلَ بِمَا قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَوَ اللَّهِ مَا دَفَعَ ذَلِكَ عَنْ نَفْسِهِ وَ خَلَّى سَبِيلَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Mahboub, from Hisham Bin Salim, from Yazeed Al Kunasy who said, ",
            "‘A man from our companions married a woman. So he said to me, ‘I would love it if you could ask Abu Abdullah<sup>asws</sup> and say to him, ‘A man from our companion married a woman, and he is claiming that he had played with her mother, and kissed her from without copulation taking place with her’. So I asked Abu Abdullah<sup>asws</sup>, and he<sup>asws</sup> said to me: ‘He has lied! Let him separate her’. ",
            "He said, ‘So I returned from my journey and informed the man with was Abu Abdullah<sup>asws</sup> had said. By Allah<sup>azwj</sup>, he did not defend that from himself, and freed her way (divorced her)’."
          ],
          "en.sarwar": [
            "9. Ibn Mahbub has narrated from Hisham ibn Salim from Yazid al-Kunnasiy who has said the following: “A certain person of our people married a woman and said to me, ‘I like if you ask abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man from our people who has married a woman and thinks that he may have played with her mother like kissing without sexual intercourse.’ He (the narrator) has said, ‘I asked abu ‘Abd Allah, ‘Alayhi al-Salam, about it and he said, ‘He has lied. Tell him to separate from her.’ I returned from my journey and informed the man of what abu ‘Abd Allah, ‘Alayhi al- Salam, had said. By Allah, he did not defend himself and sent her to go away.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/170)"
        ],
        "index": 9713,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:74:10",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي أَيُّوبَ الْخَرَّازِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلَ رَجُلٌ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا جَالِسٌ عَنْ رَجُلٍ نَالَ مِنْ خَالَتِهِ فِي شَبَابِهِ ثُمَّ ارْتَدَعَ أَ يَتَزَوَّجُ ابْنَتَهَا فَقَالَ لَا قُلْتُ إِنَّهُ لَمْ يَكُنْ أَفْضَى إِلَيْهَا إِنَّمَا كَانَ شَيْ‏ءٌ دُونَ شَيْ‏ءٍ فَقَالَ لَا يُصَدَّقُ وَ لَا كَرَامَةَ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abu Ayoub Al Khazzaz, from Muhammad Bin Muslim who said, ",
            "‘A man asked Abu Abdullah<sup>asws</sup>, and I was seated, about a man who had attained from his maternal aunt during his youth. Then he restrained. Can he marry her daughter?’ So he<sup>asws</sup> said: ‘No’. I said, ‘He did not happen to have copulated with her. But rather, something less than a thing’. So he<sup>asws</sup> said: ‘No, his words are not accepted, and it is not honourable’."
          ],
          "en.sarwar": [
            "10. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from abu Ayyub al-Khazzaz from Muhammad ibn Muslim who has said the following: “Once, a man asked abu ‘Abd Allah, ‘Alayhi al-Salam, when I was sitting, about the case of a man who when young was involved with his maternal aunt then refrained, if he could marry her daughter. He (the Imam) said, ‘No, he cannot do so.’ He then asked, ‘What happens if there was no sexual intercourse, but it was something near the thing?’ He (the Imam) said, ‘No, his words are not accepted, and it is not honorable.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:3:74",
  "kind": "verse_list"
}