{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 95"
        },
        "path": "/books/al-kafi:5:3:95",
        "titles": {
          "ar": "باب أَنَّهُنَّ بِمَنْزِلَةِ الْإِمَاءِ وَ لَيْسَتْ مِنَ الْأَرْبَعِ",
          "en": "Chapter 94 – They (wives of Mut’a) are at the status of slave girls, and are not from the four (wives allowed)"
        }
      }
    ],
    "index": 1466,
    "local_index": 95,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 96"
        },
        "path": "/books/al-kafi:5:3:96",
        "titles": {
          "ar": "باب أَنَّهُ يَجِبُ أَنْ يَكُفَّ عَنْهَا مَنْ كَانَ مُسْتَغْنِياً",
          "en": "Chapter 95 – It (Mut’a) should be restrained from by the one who is needless from it"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 94"
        },
        "path": "/books/al-kafi:5:3:94",
        "titles": {
          "ar": "أَبْوَابُ الْمُتْعَةِ ",
          "en": "Chapter 93 – Chapters of the Mut’a (temporary marriage)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:5:3",
        "titles": {
          "ar": "كتاب النِّكَاحِ",
          "en": "THE BOOK OF MARRIAGE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:3:95",
    "titles": {
      "ar": "باب أَنَّهُنَّ بِمَنْزِلَةِ الْإِمَاءِ وَ لَيْسَتْ مِنَ الْأَرْبَعِ",
      "en": "Chapter 94 – They (wives of Mut’a) are at the status of slave girls, and are not from the four (wives allowed)"
    },
    "verse_count": 7,
    "verse_start_index": 9851,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/230)"
        ],
        "index": 9852,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:95:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ كَمْ تَحِلُّ مِنَ الْمُتْعَةِ قَالَ فَقَالَ هُنَّ بِمَنْزِلَةِ الْإِمَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said, ‘How many (wives) are Permissible from the <span class=\"iTxt\">Mut’a</span>?’ So he<sup>asws</sup> said: ‘They are at the status of the slave girls (no limit)’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ‘Udhaynah who has said the following: “This is concerning my question before abu ‘ Abd Allah, ‘Alayhi al-Salam, about how many are lawful for al-Mut‘ah (advantageous marriage). He (the Imam) said, ‘Their case is similar to slave-girls.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/231)"
        ],
        "index": 9853,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:95:2",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ الْأَشْعَرِيِّ عَنْ بَكْرِ بْنِ مُحَمَّدٍ الْأَزْدِيِّ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنِ الْمُتْعَةِ أَ هِيَ مِنَ الْأَرْبَعِ فَقَالَ لَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Ahmad Bin Is’haq Al Ashary, from Bakr Bin Muhammad Al Azdy who said, ",
            "‘I asked Abu Al-Hassan about the <span class=\"iTxt\">Mut’a</span>, is she from the four (allowable wives)?’ So he<sup>asws</sup> said: ‘No’."
          ],
          "en.sarwar": [
            "2. AI-Husayn from Muhammad has narrated from Ahmad ibn Ishaq al-Ash’ariy from Bakr ibn Muhammad af-Azdiy who has said the following: “In response to my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about al-Mut‘ah (advantageous marriage) if it is one of the four, he (the Imam) said, ‘No, it is not one of the four.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/231)"
        ],
        "index": 9854,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:95:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ زُرَارَةَ بْنِ أَعْيَنَ قَالَ قُلْتُ مَا يَحِلُّ مِنَ الْمُتْعَةِ قَالَ كَمْ شِئْتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Ibn Raib, from Zurara Bin Ayn who said, ",
            "‘I said, ‘What is Permissible from the <span class=\"iTxt\">Mut’a</span>?’ He<sup>asws</sup> said: ‘As many as you so desire to’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from ibn Ri’ab from Zurarah ibn ‘A‘yan who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, ‘How many is lawful for al-Mut‘ah (advantageous marriage)?’ He (the Imam) said, ‘It is as many as you wish.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/231)"
        ],
        "index": 9855,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:95:4",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ أَبِي بَصِيرٍ قَالَ سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْمُتْعَةِ أَ هِيَ مِنَ الْأَرْبَعِ فَقَالَ لَا وَ لَا مِنَ السَّبْعِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan Bin Ali, from Hammad Bin Usman, from Abu Baseer who said, ",
            "‘Abu Abdullah<sup>asws</sup> was asked about the <span class=\"iTxt\">Mut’a</span>, is she from the four (allowable wives)?’ So he<sup>asws</sup> said: ‘No, nor from the seventy (i.e. as many as you so desire to)’."
          ],
          "en.sarwar": [
            "4. Al-Husayn from Muhammad has narrated from Mu’alla’ ibn Muhammad from al-Hassan ibn Ali from Hammad ibn ‘Uthaman from abu Basir who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, if al-Mut‘ah (advantageous marriage) is of four. He (the Imam) said, ‘No, even seventy is not unlawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/231)"
        ],
        "index": 9856,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:95:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ وَ مُحَمَّدِ بْنِ خَالِدٍ الْبَرْقِيِّ عَنِ الْقَاسِمِ بْنِ عُرْوَةَ عَنْ عَبْدِ الْحَمِيدِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي الْمُتْعَةِ قَالَ لَيْسَتْ مِنَ الْأَرْبَعِ لِأَنَّهَا لَا تُطَلَّقُ وَ لَا تَرِثُ وَ إِنَّمَا هِيَ مُسْتَأْجَرَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, and Muhammad Bin Khalid Al Barqy, from Al Qasim Bin Urwat, from Abdul Hameed, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the <span class=\"iTxt\">Mut’a</span>. He<sup>asws</sup> said: ‘She is not from the four (allowable wives) because she is not divorced, and does not inherit. But rather, she is only hired’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa‘id Ahmad ibn Muhammad from Muhammad ibn Khalid al-Barqiy from al-Qasim ibn ‘Urwah from ‘Abd al-Hamid from Muhammad ibn Muslim who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘Al-Mut‘ah (advantageous marriage) is not of four because it has no divorce or inheritance; she is only hired.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/231)"
        ],
        "index": 9857,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:95:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ إِسْمَاعِيلَ بْنِ الْفَضْلِ الْهَاشِمِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْمُتْعَةِ فَقَالَ الْقَ عَبْدَ الْمَلِكِ بْنَ جُرَيْجٍ فَسَلْهُ عَنْهَا فَإِنَّ عِنْدَهُ مِنْهَا عِلْماً فَلَقِيتُهُ فَأَمْلَى عَلَيَّ مِنْهَا شَيْئاً كَثِيراً فِي اسْتِحْلَالِهَا فَكَانَ فِيمَا رَوَى لِيَ ابْنُ جُرَيْجٍ قَالَ لَيْسَ فِيهَا وَقْتٌ وَ لَا عَدَدٌ إِنَّمَا هِيَ بِمَنْزِلَةِ الْإِمَاءِ يَتَزَوَّجُ مِنْهُنَّ كَمْ شَاءَ وَ صَاحِبُ الْأَرْبَعِ نِسْوَةٍ يَتَزَوَّجُ مِنْهُنَّ مَا شَاءَ بِغَيْرِ وَلِيٍّ وَ لَا شُهُودٍ فَإِذَا انْقَضَى الْأَجَلُ بَانَتْ مِنْهُ بِغَيْرِ طَلَاقٍ وَ يُعْطِيهَا الشَّيْ‏ءَ الْيَسِيرَ وَ عِدَّتُهَا حَيْضَتَانِ وَ إِنْ كَانَتْ لَا تَحِيضُ فَخَمْسَةٌ وَ أَرْبَعُونَ يَوْماً ",
          "فَأَتَيْتُ بِالْكِتَابِ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَعَرَضْتُ عَلَيْهِ فَقَالَ صَدَقَ وَ أَقَرَّ بِهِ ",
          "قَالَ ابْنُ أُذَيْنَةَ وَ كَانَ زُرَارَةُ بْنُ أَعْيَنَ يَقُولُ هَذَا وَ يَحْلِفُ أَنَّهُ الْحَقُّ إِلَّا أَنَّهُ كَانَ يَقُولُ إِنْ كَانَتْ تَحِيضُ فَحَيْضَةٌ وَ إِنْ كَانَتْ لَا تَحِيضُ فَشَهْرٌ وَ نِصْفٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Ismail Bin Al Fazl Al hashimy who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the <span class=\"iTxt\">Mut’a</span>, so he<sup>asws</sup> said: ‘Meet Abdul Malik Bin Jureyh and ask him about it, for with him is knowledge about it (from me<sup>asws</sup>)’. So I met up with him and he dictated to me many things with regards to its Permissibility. So, among what Ibn Jureyh reported to me was that he said, ‘There is no time limit nor a number in it. But rather, she is at the status of the slave girl. He can marry from them as many as he so desires to, and the one with the four wives can (also) marry from them as many as he so desires to, without a guardian nor witnesses. So when the term expires, she becomes irrevocably divorced from him without a divorce, and he can give her something little, and her waiting period is of two menstruations. But if she does not menstruate, so it would be of forty five days’. ",
            "So I came over with the writing to Abu Abdullah<sup>asws</sup> and presented it to him<sup>asws</sup>. So he<sup>asws</sup> said: ‘True, and I<sup>asws</sup> agree with it’. ",
            "Ibn Azina said, ‘And Zurara Bin Ayn was saying this, and he swore that it is the Truth, except that he was saying, ‘If she menstruates so it (waiting period) would be one menstruation, but if she did not menstruate, so it (waiting period) would be a month and a half’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ‘Udhaynah from ‘Isma’il ibn al-Fadl al-Hashimiy who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about al-Mut‘ah (advantageous marriage). He (the Imam) said, ‘Meet ‘Abd al-Malik ibn Jurayh and ask him about it; he has information about it.’ I met him and he dictated a great deal of issues about its lawfulness. Among the matters that ibn Jurayh narrated to me was that he said, ‘There is no particular time limit for it or a particular number. The case is similar to that of the slave-girls. One may marry as many as he wishes and one with four wives can marry in this manner, as many as he wishes, without the presence of guardian or witness. When the time expires she becomes a stranger to him without divorce and he may give her something very little. Her waiting period is two cycles of menses but if she does not experience Hayd (menses) her waiting period is forty five days.’ I brought the book to abu ‘Abd Allah, ‘Alayhi al-Salam, and displayed it before him (the Imam). He (the Imam) said, ‘He has spoken the truth and has made it easy.’ Ibn ‘Udhaynah has said, that Zurarah ibn ‘A‘yan would say so and swear that it is true except that he would say, ‘If she experiences Hayd (menses) her waiting period is one cycle of Hayd (menses) and if she does not experience Hayd (menses) her waiting period is one and a half month.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/232)"
        ],
        "index": 9858,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:3:95:7",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ سَعْدَانَ بْنِ مُسْلِمٍ عَنْ عُبَيْدِ بْنِ زُرَارَةَ عَنْ أَبِيهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ ذَكَرْتُ لَهُ الْمُتْعَةَ أَ هِيَ مِنَ الْأَرْبَعِ فَقَالَ تَزَوَّجْ مِنْهُنَّ أَلْفاً فَإِنَّهُنَّ مُسْتَأْجَرَاتٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Ahmad Bin Is’haq, from Sa’dan Bin Muslim, from Ubeyd Bin Zurara, from his father, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I mentioned the <span class=\"iTxt\">Mut’a</span> to him<sup>asws</sup>, is she from the four (allowable wives)?’ So he<sup>asws</sup> said: ‘You can take (by way of Mut’a) a thousand from them, so they are recompensed’."
          ],
          "en.sarwar": [
            "7. Al-Husayn from Muhammad has narrated from Ahmad ibn Ishaq from Sa‘dan ibn Muslim from ‘Ubayd ibn Zurarah from his father who has said the following: “I once mentioned al-Mut‘ah (advantageous marriage) before abu ‘Abd Allah, ‘Alayhi al-Salam, and asked if it is one of four (wives). He (the Imam) said, ’You may marry a thousand of them; they are on hire. 5 ” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:3:95",
  "kind": "verse_list"
}