{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:3:3:12",
        "titles": {
          "ar": "باب أَنَّ الْمُؤْمِنَ لَا يَكْرَهُ عَلَى قَبْضِ رُوحِهِ",
          "en": "Chapter 12 – The Believer does not dislike the capture of his soul"
        }
      }
    ],
    "index": 584,
    "local_index": 12,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:3:3:13",
        "titles": {
          "ar": "باب مَا يُعَايِنُ الْمُؤْمِنُ وَ الْكَافِرُ",
          "en": "Chapter 13 – What the Believer and the Infidel see"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 11"
        },
        "path": "/books/al-kafi:3:3:11",
        "titles": {
          "ar": "باب تَوْجِيهِ الْمَيِّتِ إِلَى الْقِبْلَةِ",
          "en": "Chapter 11 – Diverting the deceased to face the Qiblah"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:3:12",
    "titles": {
      "ar": "باب أَنَّ الْمُؤْمِنَ لَا يَكْرَهُ عَلَى قَبْضِ رُوحِهِ",
      "en": "Chapter 12 – The Believer does not dislike the capture of his soul"
    },
    "verse_count": 2,
    "verse_start_index": 4285,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/284)"
        ],
        "index": 4286,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:12:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َبُو عَلِيٍّ الْأَشْعَرِيُّ</span> عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ أَبِي مُحَمَّدٍ الْأَنْصَارِيِّ قَالَ وَ كَانَ خَيِّراً قَالَ حَدَّثَنِي أَبُو الْيَقْظَانِ عَمَّارٌ الْأَسَدِيُّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَوْ أَنَّ مُؤْمِناً أَقْسَمَ عَلَى رَبِّهِ أَنْ لَا يُمِيتَهُ مَا أَمَاتَهُ أَبَداً وَ لَكِنْ إِذَا كَانَ ذَلِكَ أَوْ إِذَا حَضَرَ أَجَلُهُ بَعَثَ اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ رِيحَيْنِ رِيحاً يُقَالُ لَهَا الْمُنْسِيَةُ وَ رِيحاً يُقَالُ لَهَا الْمُسَخِّيَةُ فَأَمَّا الْمُنْسِيَةُ فَإِنَّهَا تُنْسِيهِ أَهْلَهُ وَ مَالَهُ وَ أَمَّا الْمُسَخِّيَةُ فَإِنَّهَا تُسَخِّي نَفْسَهُ عَنِ الدُّنْيَا حَتَّى يَخْتَارَ مَا عِنْدَ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Abu Muhammad Al Ansary who said, and he was good, saying, ",
            "‘Abu Al-Yaqzaan Ammar Al-Asady narrated to me, from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘If a Believer were to swear upon his Lord<sup>azwj</sup> that He<sup>azwj</sup> should not Cause him to die, He<sup>azwj</sup> would not Cause him to die, ever. But, when it was that, or when his term approaches (its end), Allah<sup>azwj</sup> Mighty and Majestic Sends two aromas to him, an aroma called Al-Munsiyya and an aroma called Musakhhiya. So, as for the Munsiyya, so it would cause him to forget his family and his wealth; and as for Al-Musakhhiya, so it would cause him to be generous upon (giving up) the world until he chooses what is in the Presence of Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "1. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from abu Muhammad al-Ansariy who - a good person - has narrated from abu Yaqdan ‘Ammar al-Asadiy who said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah has said, ‘If a believing person appeals before his Lord for a guarantee not to cause him to die He will never cause him to die. However, when it is the time for him to die Allah, the Majestic, the Glorious, sends two fragrances; one is called causing forgetfulness and the other is called generous. The forgetfulness-causing fragrance makes him to forget his family and property. The generous one causes him to give up all worldly issues and choose what is with Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/285)"
        ],
        "index": 4287,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:12:2",
        "relations": {
          "Mentions": [
            "/books/quran:89:27",
            "/books/quran:89:29",
            "/books/quran:89:28",
            "/books/quran:89:30"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ أَبِيهِ عَنْ سَدِيرٍ الصَّيْرَفِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ يَا ابْنَ رَسُولِ اللَّهِ هَلْ يَكْرَهُ الْمُؤْمِنُ عَلَى قَبْضِ رُوحِهِ قَالَ لَا وَ اللَّهِ إِنَّهُ إِذَا أَتَاهُ مَلَكُ الْمَوْتِ لِقَبْضِ رُوحِهِ جَزِعَ عِنْدَ ذَلِكَ فَيَقُولُ لَهُ مَلَكُ الْمَوْتِ يَا وَلِيَّ اللَّهِ لَا تَجْزَعْ فَوَ الَّذِي بَعَثَ مُحَمَّداً ( صلى الله عليه وآله ) لَأَنَا أَبَرُّ بِكَ وَ أَشْفَقُ عَلَيْكَ مِنْ وَالِدٍ رَحِيمٍ لَوْ حَضَرَكَ افْتَحْ عَيْنَكَ فَانْظُرْ ",
          "قَالَ وَ يُمَثَّلُ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ أَمِيرُ الْمُؤْمِنِينَ وَ فَاطِمَةُ وَ الْحَسَنُ وَ الْحُسَيْنُ وَ الْأَئِمَّةُ مِنْ ذُرِّيَّتِهِمْ ( عليهم السلام ) فَيُقَالُ لَهُ هَذَا رَسُولُ اللَّهِ وَ أَمِيرُ الْمُؤْمِنِينَ وَ فَاطِمَةُ وَ الْحَسَنُ وَ الْحُسَيْنُ وَ الْأَئِمَّةُ ( عليهم السلام ) رُفَقَاؤُكَ ",
          "قَالَ فَيَفْتَحُ عَيْنَهُ فَيَنْظُرُ فَيُنَادِي رُوحَهُ مُنَادٍ مِنْ قِبَلِ رَبِّ الْعِزَّةِ فَيَقُولُ يا أَيَّتُهَا النَّفْسُ الْمُطْمَئِنَّةُ إِلَى مُحَمَّدٍ وَ أَهْلِ بَيْتِهِ ارْجِعِي إِلى رَبِّكِ راضِيَةً بِالْوَلَايَةِ مَرْضِيَّةً بِالثَّوَابِ فَادْخُلِي فِي عِبادِي يَعْنِي مُحَمَّداً وَ أَهْلَ بَيْتِهِ وَ ادْخُلِي جَنَّتِي فَمَا شَيْ‏ءٌ أَحَبَّ إِلَيْهِ مِنِ اسْتِلَالِ رُوحِهِ وَ اللُّحُوقِ بِالْمُنَادِي ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of companions, from Sahl Bin Ziyad, from Muhammad Bin Suleyman, from his father, from Sadeyr Al Sayrafi who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>, O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! Does the Believer dislike it, upon the capture of his soul?’ He<sup>asws</sup> said: ‘No. By Allah<sup>azwj</sup>, when the Angel of death comes over to him in order to capture his soul, he panics during that. So the Angel of death is saying to him: ‘O friend of Allah<sup>azwj</sup>, do not panic! By the One<sup>azwj</sup> Who Send Muhammad<sup>saww</sup>, I will be more good to you and more kind upon you than a merciful parent, if he was present with you. Open your eyes and look!’",
            "He<sup>asws</sup>, and he would make resemblaces for him of Rasool-Allah<sup>saww</sup>, and Amir Al-Momineen<sup>asws</sup>, and Fatima<sup>asws</sup>, and Al-Hassan<sup>asws</sup>, and Al-Husayn<sup>asws</sup>, and the Imams<sup>asws</sup> from their<sup>asws</sup> offspring, and he would say to him: ‘This is Rasool-Allah<sup>saww</sup>, and Amir Al-Momineen<sup>asws</sup>, and Fatima<sup>asws</sup>, and Al-Hassan<sup>asws</sup>, and Al-Husayn<sup>asws</sup>, and the Imams<sup>asws</sup>, your friends’. ",
            "He<sup>asws</sup> said: ‘So he would open his eyes and looks, and a Caller Calls our to his soul, from the Lord<sup>azwj</sup> of Might saying: ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:89#h27\">[89:27]</a> O soul that art at rest!</span> Upon Muhammad<sup>saww</sup> and the People<sup>asws</sup> of his<sup>saww</sup> Household<span class=\"ibTxt\"> <a href=\"/#/books/quran:89#h28\">[89:28]</a> Return to your Lord, well-pleased </span>with the Wilayah,<span class=\"ibTxt\"> well-pleasing</span> with the Rewards<span class=\"ibTxt\"> <a href=\"/#/books/quran:89#h29\">[89:29]</a> So enter among My servants</span>, Meaning Muhammad<sup>saww</sup> and the People<sup>asws</sup> of his<sup>saww</sup> Household<span class=\"ibTxt\"> <a href=\"/#/books/quran:89#h30\">[89:30]</a> And enter into My garden</span>’. So there would be nothing more beloved to him than the extraction of his sould, and be attached with the Caller’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn Sulayman from his father from Sadir al-Sayrafiy who has said the following: “Once I said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘May Allah keep my soul in the service of your cause, O child of the Messenger of Allah, is a believing person forced to die?’ He said, ‘No, by Allah, but when the angel of death comes to take his soul away, he is frightened; and the angel of death then says to him, “O friend of Allah, do not be frightened. I swear by the One who has sent Muhammad, O Allah grant compensation to Muhammad and his family worthy of their services to Your cause, I am more kind and caring to you than a kind-hearted father ready (to help). Open your eyes and look.’” He said, ‘Figures of the Messenger of Allah, ’Amir al-Mu’minin, Fatimah, al-Hassan and al-Husayn, ‘Alayhim al-Salam, and all ’A’immah, from their descendents appear before him, and it is said to him, “There are the Messenger of Allah, ’Amir al-Mu’minin, Ali, Fatimah, al-Hassan, al-Husayn and all ’A’immah, ‘Alayhim al-Salam, your friends.’” He (the Imam) then said, ‘He then opens his eyes, and looks and his soul is called by a caller from the Lord of Majesty saying, “O peaceful soul, [in the company of Muhammad and his family] come back to your Lord with pleasure [under the guardianship of Muhammad and his family] and pleased [with the rewards from your Lord]. Enter in the company of My servants [Muhammad and his family] in paradise.” There is then nothing more beloved to him than allowing his soul to go and join the caller.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:3:12",
  "kind": "verse_list"
}