{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:3:3", "titles": {"ar": "كِتَابُ الْجَنَائِزِ", "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "}}, {"indexed_titles": {"en": "Chapter 13"}, "path": "/books/al-kafi:3:3:13", "titles": {"ar": "باب مَا يُعَايِنُ الْمُؤْمِنُ وَ الْكَافِرُ", "en": "Chapter 13 – What the Believer and the Infidel see"}}], "index": 585, "local_index": 13, "part_type": "Chapter", "path": "/books/al-kafi:3:3:13", "titles": {"ar": "باب مَا يُعَايِنُ الْمُؤْمِنُ وَ الْكَافِرُ", "en": "Chapter 13 – What the Believer and the Infidel see"}, "verse_count": 16, "verse_start_index": 4287, "verses": [{"index": 4288, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:3:13:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ أَبِيهِ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا عُقْبَةُ لَا يَقْبَلُ اللَّهُ مِنَ الْعِبَادِ يَوْمَ الْقِيَامَةِ إِلَّا هَذَا الْأَمْرَ الَّذِي أَنْتُمْ عَلَيْهِ وَ مَا بَيْنَ أَحَدِكُمْ وَ بَيْنَ أَنْ يَرَى مَا تَقَرُّ بِهِ عَيْنُهُ إِلَّا أَنْ تَبْلُغَ نَفْسُهُ إِلَى هَذِهِ ثُمَّ أَهْوَى بِيَدِهِ إِلَى الْوَرِيدِ ثُمَّ اتَّكَأَ وَ كَانَ مَعِيَ الْمُعَلَّى فَغَمَزَنِي أَنْ أَسْأَلَهُ فَقُلْتُ يَا ابْنَ رَسُولِ اللَّهِ فَإِذَا بَلَغَتْ نَفْسُهُ هَذِهِ أَيَّ شَيْ‏ءٍ يَرَى فَقُلْتُ لَهُ بِضْعَ عَشْرَةَ مَرَّةً أَيَّ شَيْ‏ءٍ فَقَالَ فِي كُلِّهَا يَرَى وَ لَا يَزِيدُ عَلَيْهَا\nثُمَّ جَلَسَ فِي آخِرِهَا فَقَالَ يَا عُقْبَةُ فَقُلْتُ لَبَّيْكَ وَ سَعْدَيْكَ فَقَالَ أَبَيْتَ إِلَّا أَنْ تَعْلَمَ فَقُلْتُ نَعَمْ يَا ابْنَ رَسُولِ اللَّهِ إِنَّمَا دِينِي مَعَ دِينِكَ فَإِذَا ذَهَبَ دِينِي كَانَ ذَلِكَ كَيْفَ لِي بِكَ يَا ابْنَ رَسُولِ اللَّهِ كُلَّ سَاعَةٍ وَ بَكَيْتُ فَرَقَّ لِي فَقَالَ يَرَاهُمَا وَ اللَّهِ فَقُلْتُ بِأَبِي وَ أُمِّي مَنْ هُمَا\nقَالَ ذَلِكَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ عَلِيٌّ ( عليه السلام ) يَا عُقْبَةُ لَنْ تَمُوتَ نَفْسٌ مُؤْمِنَةٌ أَبَداً حَتَّى تَرَاهُمَا قُلْتُ فَإِذَا نَظَرَ إِلَيْهِمَا الْمُؤْمِنُ أَ يَرْجِعُ إِلَى الدُّنْيَا فَقَالَ لَا يَمْضِي أَمَامَهُ إِذَا نَظَرَ إِلَيْهِمَا مَضَى أَمَامَهُ فَقُلْتُ لَهُ يَقُولَانِ شَيْئاً قَالَ نَعَمْ يَدْخُلَانِ جَمِيعاً عَلَى الْمُؤْمِنِ فَيَجْلِسُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عِنْدَ رَأْسِهِ وَ عَلِيٌّ ( عليه السلام ) عِنْدَ رِجْلَيْهِ\nفَيُكِبُّ عَلَيْهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَيَقُولُ يَا وَلِيَّ اللَّهِ أَبْشِرْ أَنَا رَسُولُ اللَّهِ إِنِّي خَيْرٌ لَكَ مِمَّا تَرَكْتَ مِنَ الدُّنْيَا ثُمَّ يَنْهَضُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَيَقُومُ عَلِيٌّ ( عليه السلام ) حَتَّى يُكِبَّ عَلَيْهِ فَيَقُولُ يَا وَلِيَّ اللَّهِ أَبْشِرْ أَنَا عَلِيُّ بْنُ أَبِي طَالِبٍ الَّذِي كُنْتَ تُحِبُّهُ أَمَا لَأَنْفَعَنَّكَ\nثُمَّ قَالَ إِنَّ هَذَا فِي كِتَابِ اللَّهِ عَزَّ وَ جَلَّ قُلْتُ أَيْنَ جَعَلَنِيَ اللَّهُ فِدَاكَ هَذَا مِنْ كِتَابِ اللَّهِ قَالَ فِي يُونُسَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ هَاهُنَا الَّذِينَ آمَنُوا وَ كانُوا يَتَّقُونَ. لَهُمُ الْبُشْرى فِي الْحَياةِ الدُّنْيا وَ فِي الْآخِرَةِ لا تَبْدِيلَ لِكَلِماتِ اللَّهِ ذلِكَ هُوَ الْفَوْزُ الْعَظِيمُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ibn Fazzal, from Ali Bin Uqba, from his father who said, \n‘Abu Abdullah<sup>asws</sup> said to me: ‘O Uqba! Allah<sup>azwj</sup> will not Accept from the servant on the Day of Judgement except for this matter (Al-Wilayah) which you are upon, and there is nothing between one of you and him seeing what his eyes would be delighted with except for his soul to reach upto this’, and he<sup>asws</sup> gestured by his<sup>asws</sup> to the jugular (vein), then he<sup>asws</sup> reclined. And Mualla was with me, so he winked at me that I should ask him<sup>asws</sup>, so I said, ‘O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! So when his soul reaches to this, which thing would he see?’ And I said it to him<sup>asws</sup> ten times, ‘Which thing?’, and every time he<sup>asws</sup> said: ‘He sees’, and would not increase upon it.\nThen he<sup>asws</sup> sat up during the last of it and he<sup>asws</sup> said: ‘O Uqba!’ So I said, ‘At your<sup>asws</sup> service and your<sup>asws</sup> assistance!’ So he<sup>asws</sup> said: ‘You refuse except that I<sup>asws</sup> teach you?’. So I said, ‘Yes, O Rasool-Allah<sup>saww</sup>! But rather, my Religion is with your<sup>asws</sup> Religion. So when my Religion goes away to what it was beforehand, how would it be for me with you<sup>asws</sup>, O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>, every moment?’ And I cried, so he<sup>asws</sup> was sympathetic to me, and he<sup>asws</sup> said: ‘He sees them both, by Allah<sup>azwj</sup>’. So I said, ‘May my father and my mother be sacrifice for you<sup>asws</sup>! Who are the two (he would be seeing)?’ \nHe<sup>asws</sup> said: ‘That would be Rasool-Allah<sup>saww</sup> and Ali<sup>asws</sup>. O Uqba! Never would a Believer be drying, ever, until he sees them both<sup>asws</sup>’. I said, ‘So when the Believer looks at them<sup>asws</sup> both, would he return to the world?’ So he<sup>asws</sup> said: ‘No, he would go ahead when he looks at them<sup>asws</sup> in front of him’. So I said to him<sup>asws</sup>, ‘Would they<sup>asws</sup> be saying anything?’ He<sup>asws</sup> said: ‘Yes. They<sup>asws</sup> would both be coming over to the Believer, so Rasool-Allah<sup>saww</sup> would be seatd by his head, and Ali<sup>asws</sup> by his feet. \nSo Rasool-Allah<sup>saww</sup> would lean over and he<sup>saww</sup> would be saying: ‘O friend of Allah<sup>azwj</sup>! Receive glad tidings. I<sup>saww</sup> am Rasool-Allah<sup>saww</sup>. I<sup>saww</sup> am better for you than whatever you left from the world’. Then Rasool-Allah<sup>saww</sup> would get up and Ali<sup>asws</sup> would stand until he<sup>asws</sup> leans over him, and he<sup>asws</sup> would be saying: ‘O friend of Allah<sup>azwj</sup>! Receive glad tidings. I<sup>asws</sup> am Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> whom you used to love, I<sup>asws</sup> shall benefitting me’. \nThen he<sup>asws</sup> said: ‘This is in the Book of Allah<sup>azwj</sup>, Mighty and Majestic’. I said, ‘May I be sacrificed for you<sup>asws</sup>! Where is this from the Book of Allah<sup>azwj</sup>?’ He<sup>asws</sup> said: ‘In (Surah) Yunus<sup>as</sup> (Chapter 10), the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[10:63] Those who had believed and were pious [10:64] For them is good news in the life of the world and in the Hereafter; there is no changing the Words of Allah; that is the mighty achievement</span>’."}]}, {"index": 4289, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:3:13:2", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ خَالِدِ بْنِ عُمَارَةَ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا حِيلَ بَيْنَهُ وَ بَيْنَ الْكَلَامِ أَتَاهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ مَنْ شَاءَ اللَّهُ فَجَلَسَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَنْ يَمِينِهِ وَ الْآخَرُ عَنْ يَسَارِهِ فَيَقُولُ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَمَّا مَا كُنْتَ تَرْجُو فَهُوَ ذَا أَمَامَكَ وَ أَمَّا مَا كُنْتَ تَخَافُ مِنْهُ فَقَدْ أَمِنْتَ مِنْهُ \nثُمَّ يُفْتَحُ لَهُ بَابٌ إِلَى الْجَنَّةِ فَيَقُولُ هَذَا مَنْزِلُكَ مِنَ الْجَنَّةِ فَإِنْ شِئْتَ رَدَدْنَاكَ إِلَى الدُّنْيَا وَ لَكَ فِيهَا ذَهَبٌ وَ فِضَّةٌ فَيَقُولُ لَا حَاجَةَ لِي فِي الدُّنْيَا فَعِنْدَ ذَلِكَ يَبْيَضُّ لَوْنُهُ وَ يَرْشَحُ جَبِينُهُ وَ تَقَلَّصُ شَفَتَاهُ وَ تَنْتَشِرُ مَنْخِرَاهُ وَ تَدْمَعُ عَيْنُهُ الْيُسْرَى فَأَيَّ هَذِهِ الْعَلَامَاتِ رَأَيْتَ فَاكْتَفِ بِهَا\nفَإِذَا خَرَجَتِ النَّفْسُ مِنَ الْجَسَدِ فَيُعْرَضُ عَلَيْهَا كَمَا عُرِضَ عَلَيْهِ وَ هِيَ فِي الْجَسَدِ فَتَخْتَارُ الْآخِرَةَ فَتُغَسِّلُهُ فِيمَنْ يُغَسِّلُهُ وَ تُقَلِّبُهُ فِيمَنْ يُقَلِّبُهُ فَإِذَا أُدْرِجَ فِي أَكْفَانِهِ وَ وُضِعَ عَلَى سَرِيرِهِ خَرَجَتْ رُوحُهُ تَمْشِي بَيْنَ أَيْدِي الْقَوْمِ قُدُماً وَ تَلْقَاهُ أَرْوَاحُ الْمُؤْمِنِينَ يُسَلِّمُونَ عَلَيْهِ وَ يُبَشِّرُونَهُ بِمَا أَعَدَّ اللَّهُ لَهُ جَلَّ ثَنَاؤُهُ مِنَ النَّعِيمِ \nفَإِذَا وُضِعَ فِي قَبْرِهِ رُدَّ إِلَيْهِ الرُّوحُ إِلَى وَرِكَيْهِ ثُمَّ يُسْأَلُ عَمَّا يَعْلَمُ فَإِذَا جَاءَ بِمَا يَعْلَمُ فُتِحَ لَهُ ذَلِكَ الْبَابُ الَّذِي أَرَاهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَيَدْخُلُ عَلَيْهِ مِنْ نُورِهَا وَ ضَوْئِهَا وَ بَرْدِهَا وَ طِيبِ رِيحِهَا \nقَالَ قُلْتُ جُعِلْتُ فِدَاكَ فَأَيْنَ ضَغْطَةُ الْقَبْرِ فَقَالَ هَيْهَاتَ مَا عَلَى الْمُؤْمِنِينَ مِنْهَا شَيْ‏ءٌ وَ اللَّهِ إِنَّ هَذِهِ الْأَرْضَ لَتَفْتَخِرُ عَلَى هَذِهِ فَيَقُولُ وَطِئَ عَلَى ظَهْرِي مُؤْمِنٌ وَ لَمْ يَطَأْ عَلَى ظَهْرِكِ مُؤْمِنٌ وَ تَقُولُ لَهُ الْأَرْضُ وَ اللَّهِ لَقَدْ كُنْتُ أُحِبُّكَ وَ أَنْتَ تَمْشِي عَلَى ظَهْرِي فَأَمَّا إِذَا وُلِّيتُكَ فَسَتَعْلَمُ مَا ذَا أَصْنَعُ بِكَ فَتَفْسَحُ لَهُ مَدَّ بَصَرِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Kjalid Bin Umara, from Abu Baseer who said, \n‘Abu Abdullah<sup>asws</sup> said: ‘When there is a cessation between him and the speech, Rasool-Allah<sup>saww</sup> comes over to him along with the one whom Allah<sup>azwj</sup> Desires. So Rasool-Allah<sup>saww</sup> would get seated on his right, and the other one<sup>asws</sup> on his left, and Rasool-Allah<sup>saww</sup> would be saying to him: ‘As for what you were desiring for, so it is in front of you, and as for what you used to fear from, so you are safe from it’.\nThen the Door to the Paradise is opened up for him, and they<sup>asws</sup> would be saying: ‘This is your house from the Paradise, and if you so desire to, we<sup>asws</sup> can return you to the world and for you would be gold and silver therein’. So he would be saying, ‘There is no need for me with regards to the world’. Thus, during that, his colour would whiten, and his forehead would drip, his lips would shrivel, and his nostrils would spread, and his left eye would fill up with tears. So whichever of these signs you see, suffice with it.\nSo when the soul comes out from the body, it (the world and the Hereafter) would be displayed to it just as it had been displayed to him when it was in the body, and he would choose the Hereafter. So you would wash him among the ones who wash him, and turn him over among the ones who turn him over. So when he is enshrouded in his shroud and placed upon his bed, his soul comes out walking in front of the people ahead, and the souls of the Believers meet him, greeting him, and giving him glad tidings with what Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Praise has Prepared for him, from the Bounties.\nSo when he is placed in his grave, the soul is returned to him up to his knees. Then he is asked about what he knows. So when he comes with what he knows, that Door which Rasool-Allah<sup>saww</sup> had shown would be opened up for him, and there would enter upon him, its light, and its illumiation, and its coolness, and its aromatic fragrances’. \nHe (the narrator) said, ‘I said, ‘May I be sacrificed for you<sup>asws</sup>! So where is the squeezing of the grave?’ So he<sup>asws</sup> said: ‘Far be it! There is nothing upon the Believers from it. This earth would pride upon this, and it would be saying, ‘A Believer trod upon my back and a Believer did not tread upon you’, and the earth would be saying to it, ‘By Allah<sup>azwj</sup>! I used to love you when you were walking upon my back. So when I loved you, then you shall soon come to know what I would be doing with you’. So it expands for him to the extent of his vision’."}]}, {"index": 4290, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:3:13:3", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ فَضَّالٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ سَعِيدِ بْنِ يَسَارٍ أَنَّهُ حَضَرَ أَحَدَ ابْنَيْ سَابُورَ وَ كَانَ لَهُمَا فَضْلٌ وَ وَرَعٌ وَ إِخْبَاتٌ فَمَرِضَ أَحَدُهُمَا وَ مَا أَحْسَبُهُ إِلَّا زَكَرِيَّا بْنَ سَابُورَ قَالَ فَحَضَرْتُهُ عِنْدَ مَوْتِهِ فَبَسَطَ يَدَهُ ثُمَّ قَالَ ابْيَضَّتْ يَدِي يَا عَلِيُّ \nقَالَ فَدَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ عِنْدَهُ مُحَمَّدُ بْنُ مُسْلِمٍ قَالَ فَلَمَّا قُمْتُ مِنْ عِنْدِهِ ظَنَنْتُ أَنَّ مُحَمَّداً يُخْبِرُهُ بِخَبَرِ الرَّجُلِ فَأَتْبَعَنِي بِرَسُولٍ فَرَجَعْتُ إِلَيْهِ فَقَالَ أَخْبِرْنِي عَنْ هَذَا الرَّجُلِ الَّذِي حَضَرْتَهُ عِنْدَ الْمَوْتِ أَيَّ شَيْ‏ءٍ سَمِعْتَهُ يَقُولُ قَالَ قُلْتُ بَسَطَ يَدَهُ ثُمَّ قَالَ ابْيَضَّتْ يَدِي يَا عَلِيُّ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ اللَّهِ رَآهُ وَ اللَّهِ رَآهُ وَ اللَّهِ رَآهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Fazzal, from Yunus Bin Yaqoub, \n(It has been narrated) from Saeed Bin Yasaar that he was present with one of the two sons of Sabour, and for them was merit, and piety, and sincerity. So one of them became sick, and I do not reckon except that it was Zakariyya Bin Sabour. He said, ‘So I was present with him during his death, and he extended his hand, then said, ‘My hands have whitened, O Ali’. \nHe (the narrator) said, ‘So I went over to Abu Abdullah<sup>asws</sup>, and in his<sup>asws</sup> presence was Muhammad Bin Muslim. So when I arose from his<sup>asws</sup> presence, I think that Muhammad informed him<sup>asws</sup> with the news of the man. So a messenger pursued me and I returned back to him<sup>asws</sup>. So he<sup>asws</sup> said: ‘Inform me about this man whom you were present with during his death. Which thing did you hear him saying?’ I said, ‘He extended his hand, then said, ‘My hands have whitened, O Ali’. So Abu Abdullah<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>, he saw him<sup>saww</sup>! By Allah<sup>azwj</sup>, he saw him<sup>saww</sup>! By Allah<sup>azwj</sup>, he saw him<sup>saww</sup>!’."}]}, {"index": 4291, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:3:3:13:4", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَمَّارِ بْنِ مَرْوَانَ قَالَ حَدَّثَنِي مَنْ سَمِعَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ مِنْكُمْ وَ اللَّهِ يُقْبَلُ وَ لَكُمْ وَ اللَّهِ يُغْفَرُ إِنَّهُ لَيْسَ بَيْنَ أَحَدِكُمْ وَ بَيْنَ أَنْ يَغْتَبِطَ وَ يَرَى السُّرُورَ وَ قُرَّةَ الْعَيْنِ إِلَّا أَنْ تَبْلُغَ نَفْسُهُ هَاهُنَا وَ أَوْمَأَ بِيَدِهِ إِلَى حَلْقِهِ\nثُمَّ قَالَ إِنَّهُ إِذَا كَانَ ذَلِكَ وَ احْتُضِرَ حَضَرَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ عَلِيٌّ ( عليه السلام ) وَ جَبْرَئِيلُ وَ مَلَكُ الْمَوْتِ ( عليه السلام ) فَيَدْنُو مِنْهُ عَلِيٌّ ( عليه السلام ) فَيَقُولُ يَا رَسُولَ اللَّهِ إِنَّ هَذَا كَانَ يُحِبُّنَا أَهْلَ الْبَيْتِ فَأَحِبَّهُ وَ يَقُولُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَا جَبْرَئِيلُ إِنَّ هَذَا كَانَ يُحِبُّ اللَّهَ وَ رَسُولَهُ وَ أَهْلَ بَيْتِ رَسُولِهِ فَأَحِبَّهُ وَ يَقُولُ جَبْرَئِيلُ لِمَلَكِ الْمَوْتِ إِنَّ هَذَا كَانَ يُحِبُّ اللَّهَ وَ رَسُولَهُ وَ أَهْلَ بَيْتِ رَسُولِهِ فَأَحِبَّهُ وَ ارْفُقْ بِهِ \nفَيَدْنُو مِنْهُ مَلَكُ الْمَوْتِ فَيَقُولُ يَا عَبْدَ اللَّهِ أَخَذْتَ فَكَاكَ رَقَبَتِكَ أَخَذْتَ أَمَانَ بَرَاءَتِكَ تَمَسَّكْتَ بِالْعِصْمَةِ الْكُبْرَى فِي الْحَيَاةِ الدُّنْيَا قَالَ فَيُوَفِّقُهُ اللَّهُ عَزَّ وَ جَلَّ فَيَقُولُ نَعَمْ فَيَقُولُ وَ مَا ذَلِكَ فَيَقُولُ وَلَايَةُ عَلِيِّ بْنِ أَبِي طَالِبٍ ( عليه السلام ) فَيَقُولُ صَدَقْتَ أَمَّا الَّذِي كُنْتَ تَحْذَرُهُ فَقَدْ آمَنَكَ اللَّهُ مِنْهُ وَ أَمَّا الَّذِي كُنْتَ تَرْجُوهُ فَقَدْ أَدْرَكْتَهُ أَبْشِرْ بِالسَّلَفِ الصَّالِحِ مُرَافَقَةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ عَلِيٍّ وَ فَاطِمَةَ ( عليها السلام )\nثُمَّ يَسُلُّ نَفْسَهُ سَلًّا رَفِيقاً ثُمَّ يَنْزِلُ بِكَفَنِهِ مِنَ الْجَنَّةِ وَ حَنُوطِهِ مِنَ الْجَنَّةِ بِمِسْكٍ أَذْفَرَ فَيُكَفَّنُ بِذَلِكَ الْكَفَنِ وَ يُحَنَّطُ بِذَلِكَ الْحَنُوطِ ثُمَّ يُكْسَى حُلَّةً صَفْرَاءَ مِنْ حُلَلِ الْجَنَّةِ فَإِذَا وُضِعَ فِي قَبْرِهِ فُتِحَ لَهُ بَابٌ مِنْ أَبْوَابِ الْجَنَّةِ يَدْخُلُ عَلَيْهِ مِنْ رَوْحِهَا وَ رَيْحَانِهَا ثُمَّ يُفْسَحُ لَهُ عَنْ أَمَامِهِ مَسِيرَةَ شَهْرٍ وَ عَنْ يَمِينِهِ وَ عَنْ يَسَارِهِ ثُمَّ يُقَالُ لَهُ نَمْ نَوْمَةَ الْعَرُوسِ عَلَى فِرَاشِهَا أَبْشِرْ بِرَوْحٍ وَ رَيْحَانٍ وَ جَنَّةِ نَعِيمٍ وَ رَبٍّ غَيْرِ غَضْبَانَ \nثُمَّ يَزُورُ آلَ مُحَمَّدٍ فِي جِنَانِ رَضْوَى فَيَأْكُلُ مَعَهُمْ مِنْ طَعَامِهِمْ وَ يَشْرَبُ مِنْ شَرَابِهِمْ وَ يَتَحَدَّثُ مَعَهُمْ فِي مَجَالِسِهِمْ حَتَّى يَقُومَ قَائِمُنَا أَهْلَ الْبَيْتِ فَإِذَا قَامَ قَائِمُنَا بَعَثَهُمُ اللَّهُ فَأَقْبَلُوا مَعَهُ يُلَبُّونَ زُمَراً زُمَراً \nفَعِنْدَ ذَلِكَ يَرْتَابُ الْمُبْطِلُونَ وَ يَضْمَحِلُّ الْمُحِلُّونَ وَ قَلِيلٌ مَا يَكُونُونَ هَلَكَتِ الْمَحَاضِيرُ وَ نَجَا الْمُقَرَّبُونَ مِنْ أَجْلِ ذَلِكَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِعَلِيٍّ ( عليه السلام ) أَنْتَ أَخِي وَ مِيعَادُ مَا بَيْنِي وَ بَيْنَكَ وَادِي السَّلَامِ\nقَالَ وَ إِذَا احْتُضِرَ الْكَافِرُ حَضَرَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ عَلِيٌّ ( عليه السلام ) وَ جَبْرَئِيلُ ( عليه السلام ) وَ مَلَكُ الْمَوْتِ ( عليه السلام ) فَيَدْنُو مِنْهُ عَلِيٌّ ( عليه السلام ) فَيَقُولُ يَا رَسُولَ اللَّهِ إِنَّ هَذَا كَانَ يُبْغِضُنَا أَهْلَ الْبَيْتِ فَأَبْغِضْهُ وَ يَقُولُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَا جَبْرَئِيلُ إِنَّ هَذَا كَانَ يُبْغِضُ اللَّهَ وَ رَسُولَهُ وَ أَهْلَ بَيْتِ رَسُولِهِ فَأَبْغِضْهُ فَيَقُولُ جَبْرَئِيلُ يَا مَلَكَ الْمَوْتِ إِنَّ هَذَا كَانَ يُبْغِضُ اللَّهَ وَ رَسُولَهُ وَ أَهْلَ بَيْتِ رَسُولِهِ فَأَبْغِضْهُ وَ اعْنُفْ عَلَيْهِ\nفَيَدْنُو مِنْهُ مَلَكُ الْمَوْتِ فَيَقُولُ يَا عَبْدَ اللَّهِ أَخَذْتَ فَكَاكَ رِهَانِكَ أَخَذْتَ أَمَانَ بَرَاءَتِكَ تَمَسَّكْتَ بِالْعِصْمَةِ الْكُبْرَى فِي الْحَيَاةِ الدُّنْيَا فَيَقُولُ لَا فَيَقُولُ أَبْشِرْ يَا عَدُوَّ اللَّهِ بِسَخَطِ اللَّهِ عَزَّ وَ جَلَّ وَ عَذَابِهِ وَ النَّارِ أَمَّا الَّذِي كُنْتَ تَحْذَرُهُ فَقَدْ نَزَلَ بِكَ ثُمَّ يَسُلُّ نَفْسَهُ سَلًّا عَنِيفاً ثُمَّ يُوَكِّلُ بِرُوحِهِ ثَلَاثَمِائَةِ شَيْطَانٍ كُلُّهُمْ يَبْزُقُ فِي وَجْهِهِ وَ يَتَأَذَّى بِرُوحِهِ فَإِذَا وُضِعَ فِي قَبْرِهِ فُتِحَ لَهُ بَابٌ مِنْ أَبْوَابِ النَّارِ فَيَدْخُلُ عَلَيْهِ مِنْ قَيْحِهَا وَ لَهَبِهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Ammar Bin Marwan who said, \n‘It was narrated to me by the one who heard Abu Abdullah<sup>asws</sup> saying: ‘By Allah<sup>azwj</sup>, there would be Acceptance from you, and by Allah<sup>azwj</sup> there would be Forgiveness for you! There is nothing between one of you and his exultation, and him seeing the joy and the delight of his eyes, except the reaching of his soul to over here’, and he<sup>asws</sup> gestured with his<sup>asws</sup> hand to his<sup>asws</sup> throat.\nThen he<sup>asws</sup> said: ‘When it would be like that, and he is about to die, Rasool-Allah<sup>saww</sup> and Ali<sup>asws</sup> and Jibraeel<sup>as</sup> and the Angel of death attend him, and Ali<sup>asws</sup> would approach him and he<sup>asws</sup> would be saying: ‘O Rasool-Allah<sup>saww</sup>! This one used to love us<sup>asws</sup>, the People<sup>asws</sup> of the Household, so love him. And Rasool-Allah<sup>saww</sup> would be saying: ‘O Jibraeel<sup>as</sup>! This one used to love Allah<sup>azwj</sup>, and His<sup>azwj</sup> Rasool<sup>saww</sup>, and the People<sup>asws</sup> of the Household of His<sup>azwj</sup> Rasool<sup>saww</sup>, so love him. And Jibraeel<sup>as</sup> would be saying to the Angel of death: ‘This one used to love Allah<sup>azwj</sup>, and His<sup>azwj</sup> Rasool<sup>saww</sup> and the People<sup>asws</sup> of the Household of His<sup>azwj</sup> Rasool<sup>saww</sup>, so I<sup>as</sup> love him and be kind with him. \nSo the Angel of death approaches him and would be saying to him: ‘O servant of Allah<sup>azwj</sup>! Did you take the redemption of your neck (from the Fire)? Did you take the deed of security of your freedom (from the Fire), attaching with the greatest immunity in the life of the world?’ So Allah<sup>azwj</sup> would Cause him to speak and he would be saying, ‘Yes’. So he (the Angel of death) would be saying: ‘And what is that?’ So he (the deceased) would be saying, ‘The Wilayah of Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>’. He would be saying, ‘You have spoken the truth. As for that which you were cautious of, so Allah<sup>azwj</sup> has Secured you from it, and as for that which you were wishing for, so will realise it. Receive glad tidings to be with the righteous ancestors as friends of Rasool-Allah<sup>saww</sup> and Ali<sup>asws</sup> and Fatima<sup>asws</sup>’. \nThen his soul would flow (out of his body) with a gentle flowing. Then they would descend with his shroud from the Paradise, and his embalming from the Paradise with the saffron musk, so he would be enshrouded with that shroud and embalmed with that embalming. Then he would be clothed with a yellow garment from the garments of the Paradise. So when he would be placed in his grave, a Door from the Doors of the Paradise would be opened up for him, and there would be entering upon him its breezes and its fragrances. Then there would be expanded for him, from ahead of him, a travel distance of a year, and from his right and from his left. Then it would be said to him: ‘Sleep the sleep of a newly wedded bride upon her bed. Receive glad tidings with the breezes and the fragrances and a blissful garden and a Lord<sup>azwj</sup> not Angered’.\nThen he would be visiting the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> in Gardens of Pleasure, so he would eat with them<sup>asws</sup> from their<sup>asws</sup> meals, and drink from their<sup>asws</sup> drinks, and would be discussing with them<sup>asws</sup> in their<sup>asws</sup> gatherings until the rising of our<sup>asws</sup> Qaim<sup>asws</sup> of the People<sup>asws</sup> of the Household. So when our<sup>asws</sup> Qaim<sup>asws</sup> rises, Allah<sup>azwj</sup> would Send for them, and they would meet up with him<sup>asws</sup> exclaiming <span class=\"iTxt\">Talbiyya</span> (Here I am, Here I am), in groups and groups. \nTherefore, during that, the doubters would be invalidated, and be destroyed by an annihilation, and very few of the cautioning ones (of the appearance of Al-Qaim<sup>asws</sup>) would happen to perish, and the ones speaking of its nearness (of the appearance of Al-Qaim<sup>asws</sup>) would attain salvation. Due to that, Rasool-Allah<sup>saww</sup> said to Ali<sup>asws</sup>: ‘You<sup>asws</sup> are my<sup>saww</sup> brother<sup>asws</sup>, and an appointment between me<sup>saww</sup> and you<sup>asws</sup> is in the Valley of Peace’. \nWhen the infidel is near to dying, Rasool-Allah<sup>saww</sup> and Ali<sup>asws</sup> and Jibraeel<sup>as</sup> and the Angel of death come over to him. So Ali<sup>asws</sup> approaches him and would be saying: ‘O Rasool-Allah<sup>saww</sup>! This one used to hate the People<sup>asws</sup> of the Household, so hate him’. And Rasool-Allah<sup>saww</sup> would be saying: ‘O Jibraeel<sup>as</sup>! This one used to hate Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>, and the People<sup>asws</sup> of the Household of His<sup>azwj</sup> Rasool<sup>saww</sup>, so hate him’. So Jibraeel<sup>as</sup> would be saying: ‘O Angel of death! This is one who used to hate Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup> and the People<sup>asws</sup> of his<sup>saww</sup> Household, so hate him and be fierce upon him.\nSo the Angel of death approaches him and would be saying to him: ‘O servant of Allah<sup>azwj</sup>! Did you take the redemption of your neck (from the Fire)? Did you take the deed of security of your freedom (from the Fire), attaching with the greatest immunity in the life of the world?’ So he would say, ‘No’. So he would be saying, ‘Receive news, O enemy of Allah<sup>azwj</sup> Mighty and Majestic, of His<sup>azwj</sup> Punishment and the Fire. As for that which you were scared of, so it would descend unto you’. Then his soul would flow (out from his body) with a rough flowing. Then three hundred devils would be allocated with him, all of them spitting in his face, and hurting his soul. So when he is placed in his grave, a Door from the Doors of the Fire would be opened up for him, and there would enter upon him its pus and its flames’."}]}, {"index": 4292, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:3:3:13:5", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنِ ابْنِ مُسْكَانَ عَنْ عَبْدِ الرَّحِيمِ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) حَدَّثَنِي صَالِحُ بْنُ مِيثَمٍ عَنْ عَبَايَةَ الْأَسَدِيِّ أَنَّهُ سَمِعَ عَلِيّاً ( عليه السلام ) يَقُولُ وَ اللَّهِ لَا يُبْغِضُنِي عَبْدٌ أَبَداً يَمُوتُ عَلَى بُغْضِي إِلَّا رَآنِي عِنْدَ مَوْتِهِ حَيْثُ يَكْرَهُ وَ لَا يُحِبُّنِي عَبْدٌ أَبَداً فَيَمُوتُ عَلَى حُبِّي إِلَّا رَآنِي عِنْدَ مَوْتِهِ حَيْثُ يُحِبُّ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) نَعَمْ وَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِالْيَمِينِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Yaya Al Halby, from Ibn Muskan, from Abdul Raheem who said, \n‘I said to Abu Ja’far<sup>asws</sup>, ‘Salih Bin Maysam narrated to me from Abayat Al-Asady, that he heard Ali<sup>asws</sup> saying: ‘By Allah<sup>azwj</sup>! No servant would hate me<sup>asws</sup> ever, dying on hatred, except that he would see me<sup>asws</sup> during his death abhorring it, and no servant would love me<sup>asws</sup> ever, dying upon my<sup>asws</sup> love, except that he would see me<sup>asws</sup> during his death loving it’. So Abu Ja’far<sup>asws</sup> said: ‘Yes, and with Rasool-Allah<sup>saww</sup> upon his right’."}]}, {"index": 4293, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:3:3:13:6", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ عَنْ يَحْيَى بْنِ سَابُورٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ فِي الْمَيِّتِ تَدْمَعُ عَيْنُهُ عِنْدَ الْمَوْتِ فَقَالَ ذَلِكَ عِنْدَ مُعَايَنَةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَيَرَى مَا يَسُرُّهُ ثُمَّ قَالَ أَ مَا تَرَى الرَّجُلَ يَرَى مَا يَسُرُّهُ وَ مَا يُحِبُّ فَتَدْمَعُ عَيْنُهُ لِذَلِكَ وَ يَضْحَكُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Muawiya Bin Wahab, from Yahya Bin Sabour who said, \n‘I heard Abu Abdullah<sup>asws</sup> saying regarding the deceased, tears flowing form his eyes: ‘That is during him seeing Rasool-Allah<sup>saww</sup>, so he sees what overjoys him’. Then he<sup>asws</sup> said: ‘Have you not seen the man seeing what overjoys him and what he loves, so his eyes fill up with tears due to that, and he laughs?’"}]}, {"index": 4294, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:3:3:13:7", "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الْكِنْدِيِّ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ جُذَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ إِنَّ النَّفْسَ إِذَا وَقَعَتْ فِي الْحَلْقِ أَتَاهُ مَلَكٌ فَقَالَ لَهُ يَا هَذَا أَوْ يَا فُلَانُ أَمَّا مَا كُنْتَ تَرْجُو فَأْيَسْ مِنْهُ وَ هُوَ الرُّجُوعُ إِلَى الدُّنْيَا وَ أَمَّا مَا كُنْتَ تَخَافُ فَقَدْ أَمِنْتَ مِنْهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Al Kindy, from someone else, from AbanBin Usman, from Aamir Bin Abdullah Bin Juza’at, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘When the soul comes to be in the throat, an Angel comes over to him and says to him: ‘O you!’, or ‘O so and so! As for what you were hoping for, so despair from it’, and it is the returning to the world, ‘And as for what you were fearing, so you are (now) secured from it’."}]}, {"index": 4295, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:3:3:13:8", "text": "أَبَانُ بْنُ عُثْمَانَ عَنْ عُقْبَةَ أَنَّهُ سَمِعَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ الرَّجُلَ إِذَا وَقَعَتْ نَفْسُهُ فِي صَدْرِهِ يَرَى قُلْتُ جُعِلْتُ فِدَاكَ وَ مَا يَرَى قَالَ يَرَى رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَيَقُولُ لَهُ رَسُولُ اللَّهِ أَنَا رَسُولُ اللَّهِ أَبْشِرْ ثُمَّ يَرَى عَلِيَّ بْنَ أَبِي طَالِبٍ ( عليه السلام ) فَيَقُولُ أَنَا عَلِيُّ بْنُ أَبِي طَالِبٍ الَّذِي كُنْتَ تُحِبُّهُ تُحِبُّ أَنْ أَنْفَعَكَ الْيَوْمَ \nقَالَ قُلْتُ لَهُ أَ يَكُونُ أَحَدٌ مِنَ النَّاسِ يَرَى هَذَا ثُمَّ يَرْجِعُ إِلَى الدُّنْيَا قَالَ قَالَ لَا إِذَا رَأَى هَذَا أَبَداً مَاتَ وَ أَعْظَمَ ذَلِكَ قَالَ وَ ذَلِكَ فِي الْقُرْآنِ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ الَّذِينَ آمَنُوا وَ كانُوا يَتَّقُونَ. لَهُمُ الْبُشْرى فِي الْحَياةِ الدُّنْيا وَ فِي الْآخِرَةِ لا تَبْدِيلَ لِكَلِماتِ اللَّهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Aban Bin Usman, \n(It has been narrated) from Uqba who heard Abu Abdullah<sup>asws</sup> saying: ‘The man, when his soul comes up to be in his chest, sees’. I said, ‘May I be sacrificed for you<sup>asws</sup>! And what does he see?’ He<sup>asws</sup> said: ‘He sees Rasool-Allah<sup>saww</sup>, and Rasool-Allah<sup>saww</sup> is saying to him: ‘Receive glad tidings!’ The he sees Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, and he<sup>asws</sup> is saying to him: ‘I<sup>asws</sup> am Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, whom you used to love. Your love would benefit you today’. \nHe (the narrator) said, ‘I said to him<sup>asws</sup>, ‘Can it happen for anyone from the people when he sees this, then he would return to the world?’ He<sup>asws</sup> said: ‘No. When he sees this, he would be dead forever, and that is a great thing. And that is in the Quran, the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[10:64] For them is good news in the life of the world and in the Hereafter; there is no changing the Words of Allah</span>’."}]}, {"index": 4296, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:3:3:13:9", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ الْعَزِيزِ الْعَبْدِيِّ عَنِ ابْنِ أَبِي يَعْفُورٍ قَالَ كَانَ خَطَّابٌ الْجُهَنِيُّ خَلِيطاً لَنَا وَ كَانَ شَدِيدَ النَّصْبِ لآِلِ مُحَمَّدٍ ( عليهم السلام ) وَ كَانَ يَصْحَبُ نَجْدَةَ الْحَرُورِيَّةَ قَالَ فَدَخَلْتُ عَلَيْهِ أَعُودُهُ لِلْخُلْطَةِ وَ التَّقِيَّةِ فَإِذَا هُوَ مُغْمًى عَلَيْهِ فِي حَدِّ الْمَوْتِ فَسَمِعْتُهُ يَقُولُ مَا لِي وَ لَكَ يَا عَلِيُّ فَأَخْبَرْتُ بِذَلِكَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) رَآهُ وَ رَبِّ الْكَعْبَةِ رَآهُ وَ رَبِّ الْكَعْبَةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ibn Mahboub, from Abdul Aziz Al Abdy, from Ibn Abu Yafour who said, \n‘Khattab Al-Juhny used to blend in with us and he was extremely hostile to the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and he was a companions of Najdat Al-Harouriyya. So I went over to him for a short visit (during his death) due to his blending in with us and the (observance of) dissimulation. So when he was gloomy upon it during a limit of the death, I heard him saying, ‘What is the matter with me and you, (i.e., ‘Why am I against you’) O Ali?’ So I informed Abu Abdullah<sup>asws</sup> about that. So Abu Abdullah<sup>asws</sup> said: ‘He saw him<sup>saww</sup>, by the Lord<sup>azwj</sup> of the Kabah! He saw him<sup>saww</sup>, by the Lord<sup>azwj</sup> of the Kabah!’"}]}, {"index": 4297, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:3:3:13:10", "text": "سَهْلُ بْنُ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ عَبْدِ الْحَمِيدِ بْنِ عَوَّاضٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِذَا بَلَغَتْ نَفْسُ أَحَدِكُمْ هَذِهِ قِيلَ لَهُ أَمَّا مَا كُنْتَ تَحْذَرُ مِنْ هَمِّ الدُّنْيَا وَ حُزْنِهَا فَقَدْ أَمِنْتَ مِنْهُ وَ يُقَالُ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ عَلِيٌّ ( عليه السلام ) وَ فَاطِمَةُ ( عليها السلام ) أَمَامَكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Hammad Bin Usman, from Abdul Hameed Bin Awwaz who said, \n‘I heard Abu Abdullah<sup>asws</sup> saying: ‘When a soul of one of you reaches this (point), it is said to him: ‘As for what you were cautious of from the worries of the world and its grief, so you are safe from it’; and it is said to him: ‘Rasool-Allah<sup>saww</sup> and Ali<sup>asws</sup> and Fatima<sup>asws</sup> are in front of you’."}]}, {"index": 4298, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:3:3:13:11", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ إِنَّ آيَةَ الْمُؤْمِنِ إِذَا حَضَرَهُ الْمَوْتُ يَبْيَاضُّ وَجْهُهُ أَشَدَّ مِنْ بَيَاضِ لَوْنِهِ وَ يَرْشَحُ جَبِينُهُ وَ يَسِيلُ مِنْ عَيْنَيْهِ كَهَيْئَةِ الدُّمُوعِ فَيَكُونُ ذَلِكَ خُرُوجَ نَفْسِهِ وَ إِنَّ الْكَافِرَ تَخْرُجُ نَفْسُهُ سَلًّا مِنْ شِدْقِهِ كَزَبَدِ الْبَعِيرِ أَوْ كَمَا تَخْرُجُ نَفْسُ الْبَعِيرِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Ali, from Muhammad Bin Al Fuzayl, from Abu Hamza who said, \n‘I heard Abu Ja’far<sup>asws</sup> saying: ‘A sign of the Believer when the death presents itself (is that) his face whitens more intensely than the whitening of his colour, and his forehead sweats, and (water) flows from his eyes like tears, so that would happen during the exit of his soul; and the Infidel, his soul flows from the angle of his mouth like the foam of the camel, or just as the exiting of the soul of the camel’."}]}, {"index": 4299, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:3:3:13:12", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ وَ الْحُسَيْنِ بْنِ سَعِيدٍ جَمِيعاً عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَبْدِ الصَّمَدِ بْنِ بَشِيرٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ أَصْلَحَكَ اللَّهُ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَ مَنْ أَبْغَضَ لِقَاءَ اللَّهِ أَبْغَضَ اللَّهُ لِقَاءَهُ قَالَ نَعَمْ قُلْتُ فَوَ اللَّهِ إِنَّا لَنَكْرَهُ الْمَوْتَ فَقَالَ لَيْسَ ذَلِكَ حَيْثُ تَذْهَبُ إِنَّمَا ذَلِكَ عِنْدَ الْمُعَايَنَةِ إِذَا رَأَى مَا يُحِبُّ فَلَيْسَ شَيْ‏ءٌ أَحَبَّ إِلَيْهِ مِنْ أَنْ يَتَقَدَّمَ وَ اللَّهُ تَعَالَى يُحِبُّ لِقَاءَهُ وَ هُوَ يُحِبُّ لِقَاءَ اللَّهِ حِينَئِذٍ وَ إِذَا رَأَى مَا يَكْرَهُ فَلَيْسَ شَيْ‏ءٌ أَبْغَضَ إِلَيْهِ مِنْ لِقَاءِ اللَّهِ وَ اللَّهُ يُبْغِضُ لِقَاءَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Khalid and Al Husayn Bin Saeed, altogether from Al Qasim Bin Muhammad, from Abdul Samad Bin Basheer, from one of his companions, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! The one who loves to meet Allah<sup>azwj</sup>, Allah<sup>azwj</sup> Loves to meet him, and the one who hates meeting Allah<sup>azwj</sup>, Allah<sup>azwj</sup> would Hate to meet him?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘By Allah<sup>azwj</sup>! I dislike the death’. So he<sup>asws</sup> said: ‘That is not where you are going with it. But rather, that is during the eye-witnessing when he sees what he loves. So there would be nothing more beloved to him than him proceeding, and Allah<sup>azwj</sup> the Exalted would Love to meet him, and he would love to meet Allah<sup>azwj</sup>, then and there. And when he sees what he dislikes, so there would be nothing more hateful to him than meeting Allah<sup>azwj</sup> and Allah<sup>azwj</sup> would Hate to meet him’."}]}, {"index": 4300, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:3:3:13:13", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ أَبِي الْمُسْتَهِلِّ عَنْ مُحَمَّدِ بْنِ حَنْظَلَةَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ حَدِيثٌ سَمِعْتُهُ مِنْ بَعْضِ شِيعَتِكَ وَ مَوَالِيكَ يَرْوِيهِ عَنْ أَبِيكَ قَالَ وَ مَا هُوَ قُلْتُ زَعَمُوا أَنَّهُ كَانَ يَقُولُ أَغْبَطُ مَا يَكُونُ امْرُؤٌ بِمَا نَحْنُ عَلَيْهِ إِذَا كَانَتِ النَّفْسُ فِي هَذِهِ فَقَالَ نَعَمْ إِذَا كَانَ ذَلِكَ أَتَاهُ نَبِيُّ اللَّهِ وَ أَتَاهُ عَلِيٌّ وَ أَتَاهُ جَبْرَئِيلُ وَ أَتَاهُ مَلَكُ الْمَوْتِ ( عليه السلام ) فَيَقُولُ ذَلِكَ الْمَلَكُ لِعَلِيٍّ ( عليه السلام ) يَا عَلِيُّ إِنَّ فُلَاناً كَانَ مُوَالِياً لَكَ وَ لِأَهْلِ بَيْتِكَ فَيَقُولُ نَعَمْ كَانَ يَتَوَلَّانَا وَ يَتَبَرَّأُ مِنْ عَدُوِّنَا فَيَقُولُ ذَلِكَ نَبِيُّ اللَّهِ لِجَبْرَئِيلَ فَيَرْفَعُ ذَلِكَ جَبْرَئِيلُ إِلَى اللَّهِ عَزَّ وَ جَلَّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Abu Al Mustahil, from Muhammad Bin Hanzala who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! A Hadeeth which I heard from one of your<sup>asws</sup> Shia and the one in your<sup>asws</sup> Wilayah, reporting it from your<sup>asws</sup> father<sup>asws</sup>’. He<sup>asws</sup> said: ‘And what is it?’ I said, ‘He was claiming that he<sup>asws</sup> had said: ‘Overjoyed is what a person would happen to be with what we<sup>asws</sup> are upon, when the soul was in this (point)’. So he<sup>asws</sup> said: ‘Yes. When it would be that, the Prophet<sup>saww</sup> of Allah<sup>azwj</sup> would come to him, and Ali<sup>asws</sup> would come to him, and Jibraeel<sup>as</sup> would come to him, and the Angel of death would come to him. So that Angel would be saying to Ali<sup>asws</sup>: ‘O Ali<sup>asws</sup>! Was so and so in your<sup>asws</sup> Wilayah and of the People<sup>asws</sup> of your<sup>asws</sup> Household?’ So he<sup>asws</sup> would be saying: ‘Yes, he used to be with our<sup>asws</sup> Wilayah, and used to disavow from our<sup>asws</sup> enemies’. And Rasool-Allah<sup>azwj</sup> would be saying that to Jibraeel<sup>as</sup>, and Jibraeel<sup>as</sup> would raise that to Allah<sup>azwj</sup> Mighty and Majestic’."}]}, {"index": 4301, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:3:3:13:14", "text": "وَ عَنْهُ عَنْ صَفْوَانَ عَنْ جَارُودِ بْنِ الْمُنْذِرِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِذَا بَلَغَتْ نَفْسُ أَحَدِكُمْ هَذِهِ وَ أَوْمَأَ بِيَدِهِ إِلَى حَلْقِهِ قَرَّتْ عَيْنُهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "And from him, from Safwan, from Jaroud Bin Al Munzar who said, \n‘I heard Abu Abdullah<sup>asws</sup> saying: ‘When the soul of one of you reaches this (point)’, and he<sup>asws</sup> gestured with his<sup>asws</sup> hand to his<sup>asws</sup> throat, his eyes would be delighted’."}]}, {"index": 4302, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:3:3:13:15", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ عَنْ أَبِي بَصِيرٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَوْلُهُ عَزَّ وَ جَلَّ فَلَوْ لا إِذا بَلَغَتِ الْحُلْقُومَ إِلَى قَوْلِهِ إِنْ كُنْتُمْ صادِقِينَ فَقَالَ إِنَّهَا إِذَا بَلَغَتِ الْحُلْقُومَ ثُمَّ أُرِيَ مَنْزِلَهُ مِنَ الْجَنَّةِ فَيَقُولُ رُدُّونِي إِلَى الدُّنْيَا حَتَّى أُخْبِرَ أَهْلِي بِمَا أَرَى فَيُقَالُ لَهُ لَيْسَ إِلَى ذَلِكَ سَبِيلٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Yahya Al Halby, from Suleyman Bin Dawood, from Abu Baseer who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘(What about) the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[56:83] So why is it not then that when it (soul) comes up to the throat </span>– up to His<sup>azwj</sup> Words<span class=\"ibTxt\"> [56:87] That you do not send it back, if you are truthful?</span> So he<sup>asws</sup> said: ‘When it (soul) reaches the throat, then he sees his house from the Paradise, so he is saying, ‘Return me to the world until I inform my family with what I see’. So it is said to him: ‘There is no way to that’."}]}, {"index": 4303, "local_index": 16, "part_type": "Hadith", "path": "/books/al-kafi:3:3:13:16", "text": "سَهْلُ بْنُ زِيَادٍ عَنْ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِنَا قَالَ قَالَ إِذَا رَأَيْتَ الْمَيِّتَ قَدْ شَخَصَ بِبَصَرِهِ وَ سَالَتْ عَيْنُهُ الْيُسْرَى وَ رَشَحَ جَبِينُهُ وَ تَقَلَّصَتْ شَفَتَاهُ وَ انْتَشَرَتْ مَنْخِرَاهُ فَأَيَّ شَيْ‏ءٍ رَأَيْتَ مِنْ ذَلِكَ فَحَسْبُكَ بِهَا .\nوَ فِي رِوَايَةٍ أُخْرَى وَ إِذَا ضَحِكَ أَيْضاً فَهُوَ مِنَ الدَّلَالَةِ قَالَ وَ إِذَا رَأَيْتَهُ قَدْ خَمَصَ وَجْهُهُ وَ سَالَتْ عَيْنُهُ الْيُمْنَى فَاعْلَمْ أَنَّهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Sahl Bin Ziyad, from someone else from our companions who said, \n‘He<sup>asws</sup> said: ‘When you see the decease to have fixed his gaze, and his left eye flows (with tears), and his forehead sweats, and his lips shrivel, and his nostrils expand, so whichever thing you see from that, it would suffice you with it (of his salvation)’. \nAnd in another report, (He<sup>asws</sup> said): ‘And when he laughs as well, so it is from the evidence (of the salvation). And when you see his face to have frowned and his right eye to have flowed (with tears), so know that he . . .(perished)’."}]}]}, "index": "al-kafi:3:3:13", "kind": "verse_list"}