{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:3:3:13",
        "titles": {
          "ar": "باب مَا يُعَايِنُ الْمُؤْمِنُ وَ الْكَافِرُ",
          "en": "Chapter 13 – What the Believer and the Infidel see"
        }
      }
    ],
    "index": 585,
    "local_index": 13,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:3:3:14",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب إِخْرَاجِ رُوحِ</span> الْمُؤْمِنِ وَ الْكَافِرِ",
          "en": "Chapter 14 – The extraction of the soul of the Believer and the Infidel"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:3:3:12",
        "titles": {
          "ar": "باب أَنَّ الْمُؤْمِنَ لَا يَكْرَهُ عَلَى قَبْضِ رُوحِهِ",
          "en": "Chapter 12 – The Believer does not dislike the capture of his soul"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:3:13",
    "titles": {
      "ar": "باب مَا يُعَايِنُ الْمُؤْمِنُ وَ الْكَافِرُ",
      "en": "Chapter 13 – What the Believer and the Infidel see"
    },
    "verse_count": 16,
    "verse_start_index": 4287,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/286)"
        ],
        "index": 4288,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/318",
              "text": "عَلِيِّ بْنِ عُقْبَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ أَبِيهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:13:1",
        "relations": {
          "Mentions": [
            "/books/quran:10:64",
            "/books/quran:10:63"
          ]
        },
        "text": [
          " قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا عُقْبَةُ لَا يَقْبَلُ اللَّهُ مِنَ الْعِبَادِ يَوْمَ الْقِيَامَةِ إِلَّا هَذَا الْأَمْرَ الَّذِي أَنْتُمْ عَلَيْهِ وَ مَا بَيْنَ أَحَدِكُمْ وَ بَيْنَ أَنْ يَرَى مَا تَقَرُّ بِهِ عَيْنُهُ إِلَّا أَنْ تَبْلُغَ نَفْسُهُ إِلَى هَذِهِ ثُمَّ أَهْوَى بِيَدِهِ إِلَى الْوَرِيدِ ثُمَّ اتَّكَأَ وَ كَانَ مَعِيَ الْمُعَلَّى فَغَمَزَنِي أَنْ أَسْأَلَهُ فَقُلْتُ يَا ابْنَ رَسُولِ اللَّهِ فَإِذَا بَلَغَتْ نَفْسُهُ هَذِهِ أَيَّ شَيْ‏ءٍ يَرَى فَقُلْتُ لَهُ بِضْعَ عَشْرَةَ مَرَّةً أَيَّ شَيْ‏ءٍ فَقَالَ فِي كُلِّهَا يَرَى وَ لَا يَزِيدُ عَلَيْهَا",
          "ثُمَّ جَلَسَ فِي آخِرِهَا فَقَالَ يَا عُقْبَةُ فَقُلْتُ لَبَّيْكَ وَ سَعْدَيْكَ فَقَالَ أَبَيْتَ إِلَّا أَنْ تَعْلَمَ فَقُلْتُ نَعَمْ يَا ابْنَ رَسُولِ اللَّهِ إِنَّمَا دِينِي مَعَ دِينِكَ فَإِذَا ذَهَبَ دِينِي كَانَ ذَلِكَ كَيْفَ لِي بِكَ يَا ابْنَ رَسُولِ اللَّهِ كُلَّ سَاعَةٍ وَ بَكَيْتُ فَرَقَّ لِي فَقَالَ يَرَاهُمَا وَ اللَّهِ فَقُلْتُ بِأَبِي وَ أُمِّي مَنْ هُمَا",
          "قَالَ ذَلِكَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ عَلِيٌّ ( عليه السلام ) يَا عُقْبَةُ لَنْ تَمُوتَ نَفْسٌ مُؤْمِنَةٌ أَبَداً حَتَّى تَرَاهُمَا قُلْتُ فَإِذَا نَظَرَ إِلَيْهِمَا الْمُؤْمِنُ أَ يَرْجِعُ إِلَى الدُّنْيَا فَقَالَ لَا يَمْضِي أَمَامَهُ إِذَا نَظَرَ إِلَيْهِمَا مَضَى أَمَامَهُ فَقُلْتُ لَهُ يَقُولَانِ شَيْئاً قَالَ نَعَمْ يَدْخُلَانِ جَمِيعاً عَلَى الْمُؤْمِنِ فَيَجْلِسُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عِنْدَ رَأْسِهِ وَ عَلِيٌّ ( عليه السلام ) عِنْدَ رِجْلَيْهِ",
          "فَيُكِبُّ عَلَيْهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَيَقُولُ يَا وَلِيَّ اللَّهِ أَبْشِرْ أَنَا رَسُولُ اللَّهِ إِنِّي خَيْرٌ لَكَ مِمَّا تَرَكْتَ مِنَ الدُّنْيَا ثُمَّ يَنْهَضُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَيَقُومُ عَلِيٌّ ( عليه السلام ) حَتَّى يُكِبَّ عَلَيْهِ فَيَقُولُ يَا وَلِيَّ اللَّهِ أَبْشِرْ أَنَا عَلِيُّ بْنُ أَبِي طَالِبٍ الَّذِي كُنْتَ تُحِبُّهُ أَمَا لَأَنْفَعَنَّكَ",
          "ثُمَّ قَالَ إِنَّ هَذَا فِي كِتَابِ اللَّهِ عَزَّ وَ جَلَّ قُلْتُ أَيْنَ جَعَلَنِيَ اللَّهُ فِدَاكَ هَذَا مِنْ كِتَابِ اللَّهِ قَالَ فِي يُونُسَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ هَاهُنَا الَّذِينَ آمَنُوا وَ كانُوا يَتَّقُونَ. لَهُمُ الْبُشْرى فِي الْحَياةِ الدُّنْيا وَ فِي الْآخِرَةِ لا تَبْدِيلَ لِكَلِماتِ اللَّهِ ذلِكَ هُوَ الْفَوْزُ الْعَظِيمُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ibn Fazzal, from Ali Bin Uqba, from his father who said, ",
            "‘Abu Abdullah<sup>asws</sup> said to me: ‘O Uqba! Allah<sup>azwj</sup> will not Accept from the servant on the Day of Judgement except for this matter (Al-Wilayah) which you are upon, and there is nothing between one of you and him seeing what his eyes would be delighted with except for his soul to reach upto this’, and he<sup>asws</sup> gestured by his<sup>asws</sup> to the jugular (vein), then he<sup>asws</sup> reclined. And Mualla was with me, so he winked at me that I should ask him<sup>asws</sup>, so I said, ‘O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! So when his soul reaches to this, which thing would he see?’ And I said it to him<sup>asws</sup> ten times, ‘Which thing?’, and every time he<sup>asws</sup> said: ‘He sees’, and would not increase upon it.",
            "Then he<sup>asws</sup> sat up during the last of it and he<sup>asws</sup> said: ‘O Uqba!’ So I said, ‘At your<sup>asws</sup> service and your<sup>asws</sup> assistance!’ So he<sup>asws</sup> said: ‘You refuse except that I<sup>asws</sup> teach you?’. So I said, ‘Yes, O Rasool-Allah<sup>saww</sup>! But rather, my Religion is with your<sup>asws</sup> Religion. So when my Religion goes away to what it was beforehand, how would it be for me with you<sup>asws</sup>, O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>, every moment?’ And I cried, so he<sup>asws</sup> was sympathetic to me, and he<sup>asws</sup> said: ‘He sees them both, by Allah<sup>azwj</sup>’. So I said, ‘May my father and my mother be sacrifice for you<sup>asws</sup>! Who are the two (he would be seeing)?’ ",
            "He<sup>asws</sup> said: ‘That would be Rasool-Allah<sup>saww</sup> and Ali<sup>asws</sup>. O Uqba! Never would a Believer be drying, ever, until he sees them both<sup>asws</sup>’. I said, ‘So when the Believer looks at them<sup>asws</sup> both, would he return to the world?’ So he<sup>asws</sup> said: ‘No, he would go ahead when he looks at them<sup>asws</sup> in front of him’. So I said to him<sup>asws</sup>, ‘Would they<sup>asws</sup> be saying anything?’ He<sup>asws</sup> said: ‘Yes. They<sup>asws</sup> would both be coming over to the Believer, so Rasool-Allah<sup>saww</sup> would be seatd by his head, and Ali<sup>asws</sup> by his feet. ",
            "So Rasool-Allah<sup>saww</sup> would lean over and he<sup>saww</sup> would be saying: ‘O friend of Allah<sup>azwj</sup>! Receive glad tidings. I<sup>saww</sup> am Rasool-Allah<sup>saww</sup>. I<sup>saww</sup> am better for you than whatever you left from the world’. Then Rasool-Allah<sup>saww</sup> would get up and Ali<sup>asws</sup> would stand until he<sup>asws</sup> leans over him, and he<sup>asws</sup> would be saying: ‘O friend of Allah<sup>azwj</sup>! Receive glad tidings. I<sup>asws</sup> am Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> whom you used to love, I<sup>asws</sup> shall benefitting me’. ",
            "Then he<sup>asws</sup> said: ‘This is in the Book of Allah<sup>azwj</sup>, Mighty and Majestic’. I said, ‘May I be sacrificed for you<sup>asws</sup>! Where is this from the Book of Allah<sup>azwj</sup>?’ He<sup>asws</sup> said: ‘In (Surah) Yunus<sup>as</sup> (Chapter 10), the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:10#h63\">[10:63]</a> Those who had believed and were pious <a href=\"/#/books/quran:10#h64\">[10:64]</a> For them is good news in the life of the world and in the Hereafter; there is no changing the Words of Allah; that is the mighty achievement</span>’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad from ibn Faddal from Ali ibn ‘Uqbah from his father who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, once said, ‘O ‘Uqbah, Allah, on the Day of Judgment, will not accept anything other than what you believe in (following Ahl al-Bayt). No other thing stands between anyone of you, and the delight of the hearts, other than the time when one’s soul reaches this’ ( He (the Imam) pointed his hand toward his jugular vein). He then leaned against a pillow. Mu‘alla’ was with me and he made a gesture to ask the Imam more questions. I then said, ‘O child of the Messenger of Allah, when the soul reaches here, then what is it that the patient sees?’ I said it about ten times, ‘What?’ Every time he replied, ‘He sees’ and would not add anything more. At last he sat straight and said, ‘O ‘Uqbah.’ I replied, ‘Yes, here I am paying full attention.’ He said, ‘Is it necessary for you to know?’ I said, ‘Yes, O child of the Messenger of Allah, I must know. My religion is with your religion. If my religion is gone, how can I then live every hour?’ I wept and he sympathized and said, ‘He will see both of them.’ I then asked, ‘May Allah keep my soul in the service of your cause, who are the two of them?’ He replied, ‘The two are the Messenger of Allah and Ali, ‘Alayhim al-Salam, O ‘Uqbah, there is never a believing soul who does not see them.’ I then asked, ‘When a believing person sees them, does he then come back to the worldly life?’ He replied, ‘No, but he moves forward, when he sees them he moves forward.’ I then asked, ‘Do they say anything?’ He replied, ‘Yes, they both come to the believing person. The Messenger of Allah sits near his head and Ali near his feet. The Messenger of Allah leans over him and says, “O friend of Allah, good news for you. I am the Messenger of Allah and I am better for you than all that you have left in the world.” The Messenger of Allah then stands up and Ali, ‘Alayhi al-Salam, leans over him saying, “O friend of Allah, good news for you. I am Ali, ibn abu Talib, whom you loved. I am certainly to benefit you.” The Imam then said, ‘This is in the book of Allah, the Majestic, the Glorious.’ I then asked, ‘May Allah keep my soul in the service of your cause, is this from the book of Allah?’ He said, ‘It is in Yunus Surah ten where the words of Allah, the Majestic, the Glorious, say, “Those who have believed and have observed rules of faithfulness, there is good news for them in the worldly life and in the hereafter, there is no change in the words of Allah and this is the great success.’””( 10:64) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/288)"
        ],
        "index": 4289,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2455",
              "text": "خَالِدِ بْنِ عُمَارَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ خَالِدِ بْنِ عُمَارَةَ عَنْ أَبِي بَصِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:13:2",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا حِيلَ بَيْنَهُ وَ بَيْنَ الْكَلَامِ أَتَاهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ مَنْ شَاءَ اللَّهُ فَجَلَسَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَنْ يَمِينِهِ وَ الْآخَرُ عَنْ يَسَارِهِ فَيَقُولُ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَمَّا مَا كُنْتَ تَرْجُو فَهُوَ ذَا أَمَامَكَ وَ أَمَّا مَا كُنْتَ تَخَافُ مِنْهُ فَقَدْ أَمِنْتَ مِنْهُ ",
          "ثُمَّ يُفْتَحُ لَهُ بَابٌ إِلَى الْجَنَّةِ فَيَقُولُ هَذَا مَنْزِلُكَ مِنَ الْجَنَّةِ فَإِنْ شِئْتَ رَدَدْنَاكَ إِلَى الدُّنْيَا وَ لَكَ فِيهَا ذَهَبٌ وَ فِضَّةٌ فَيَقُولُ لَا حَاجَةَ لِي فِي الدُّنْيَا فَعِنْدَ ذَلِكَ يَبْيَضُّ لَوْنُهُ وَ يَرْشَحُ جَبِينُهُ وَ تَقَلَّصُ شَفَتَاهُ وَ تَنْتَشِرُ مَنْخِرَاهُ وَ تَدْمَعُ عَيْنُهُ الْيُسْرَى فَأَيَّ هَذِهِ الْعَلَامَاتِ رَأَيْتَ فَاكْتَفِ بِهَا",
          "فَإِذَا خَرَجَتِ النَّفْسُ مِنَ الْجَسَدِ فَيُعْرَضُ عَلَيْهَا كَمَا عُرِضَ عَلَيْهِ وَ هِيَ فِي الْجَسَدِ فَتَخْتَارُ الْآخِرَةَ فَتُغَسِّلُهُ فِيمَنْ يُغَسِّلُهُ وَ تُقَلِّبُهُ فِيمَنْ يُقَلِّبُهُ فَإِذَا أُدْرِجَ فِي أَكْفَانِهِ وَ وُضِعَ عَلَى سَرِيرِهِ خَرَجَتْ رُوحُهُ تَمْشِي بَيْنَ أَيْدِي الْقَوْمِ قُدُماً وَ تَلْقَاهُ أَرْوَاحُ الْمُؤْمِنِينَ يُسَلِّمُونَ عَلَيْهِ وَ يُبَشِّرُونَهُ بِمَا أَعَدَّ اللَّهُ لَهُ جَلَّ ثَنَاؤُهُ مِنَ النَّعِيمِ ",
          "فَإِذَا وُضِعَ فِي قَبْرِهِ رُدَّ إِلَيْهِ الرُّوحُ إِلَى وَرِكَيْهِ ثُمَّ يُسْأَلُ عَمَّا يَعْلَمُ فَإِذَا جَاءَ بِمَا يَعْلَمُ فُتِحَ لَهُ ذَلِكَ الْبَابُ الَّذِي أَرَاهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَيَدْخُلُ عَلَيْهِ مِنْ نُورِهَا وَ ضَوْئِهَا وَ بَرْدِهَا وَ طِيبِ رِيحِهَا ",
          "قَالَ قُلْتُ جُعِلْتُ فِدَاكَ فَأَيْنَ ضَغْطَةُ الْقَبْرِ فَقَالَ هَيْهَاتَ مَا عَلَى الْمُؤْمِنِينَ مِنْهَا شَيْ‏ءٌ وَ اللَّهِ إِنَّ هَذِهِ الْأَرْضَ لَتَفْتَخِرُ عَلَى هَذِهِ فَيَقُولُ وَطِئَ عَلَى ظَهْرِي مُؤْمِنٌ وَ لَمْ يَطَأْ عَلَى ظَهْرِكِ مُؤْمِنٌ وَ تَقُولُ لَهُ الْأَرْضُ وَ اللَّهِ لَقَدْ كُنْتُ أُحِبُّكَ وَ أَنْتَ تَمْشِي عَلَى ظَهْرِي فَأَمَّا إِذَا وُلِّيتُكَ فَسَتَعْلَمُ مَا ذَا أَصْنَعُ بِكَ فَتَفْسَحُ لَهُ مَدَّ بَصَرِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Kjalid Bin Umara, from Abu Baseer who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘When there is a cessation between him and the speech, Rasool-Allah<sup>saww</sup> comes over to him along with the one whom Allah<sup>azwj</sup> Desires. So Rasool-Allah<sup>saww</sup> would get seated on his right, and the other one<sup>asws</sup> on his left, and Rasool-Allah<sup>saww</sup> would be saying to him: ‘As for what you were desiring for, so it is in front of you, and as for what you used to fear from, so you are safe from it’.",
            "Then the Door to the Paradise is opened up for him, and they<sup>asws</sup> would be saying: ‘This is your house from the Paradise, and if you so desire to, we<sup>asws</sup> can return you to the world and for you would be gold and silver therein’. So he would be saying, ‘There is no need for me with regards to the world’. Thus, during that, his colour would whiten, and his forehead would drip, his lips would shrivel, and his nostrils would spread, and his left eye would fill up with tears. So whichever of these signs you see, suffice with it.",
            "So when the soul comes out from the body, it (the world and the Hereafter) would be displayed to it just as it had been displayed to him when it was in the body, and he would choose the Hereafter. So you would wash him among the ones who wash him, and turn him over among the ones who turn him over. So when he is enshrouded in his shroud and placed upon his bed, his soul comes out walking in front of the people ahead, and the souls of the Believers meet him, greeting him, and giving him glad tidings with what Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Praise has Prepared for him, from the Bounties.",
            "So when he is placed in his grave, the soul is returned to him up to his knees. Then he is asked about what he knows. So when he comes with what he knows, that Door which Rasool-Allah<sup>saww</sup> had shown would be opened up for him, and there would enter upon him, its light, and its illumiation, and its coolness, and its aromatic fragrances’. ",
            "He (the narrator) said, ‘I said, ‘May I be sacrificed for you<sup>asws</sup>! So where is the squeezing of the grave?’ So he<sup>asws</sup> said: ‘Far be it! There is nothing upon the Believers from it. This earth would pride upon this, and it would be saying, ‘A Believer trod upon my back and a Believer did not tread upon you’, and the earth would be saying to it, ‘By Allah<sup>azwj</sup>! I used to love you when you were walking upon my back. So when I loved you, then you shall soon come to know what I would be doing with you’. So it expands for him to the extent of his vision’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from Muhammad ‘Isa from Yunus from Khalid ibn ‘Umarah from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that when a dying person loses the ability to speak, the Messenger of Allah comes to him along with whomever Allah wants. The Messenger of Allah sits near his right side and the other on his left side. The Messenger of Allah then says, ‘What you hoped for is in front of you, you are safe from that of which you were afraid.’ Then he opens for him a door to paradise saying, ‘This is your dwelling place in paradise. However, if you like I can send you back to the worldly life where you can have gold and silver.’ He will then say, ‘I do not want the worldly things.’ At this time his color whitens, his forehead sweats, his lips shrink, his nostrils expand and his left eye tears up (moistons with tears). Whichever of these signs you see is enough. When the soul departs the body, it is given the choice again as when in the body but it chooses the life hereafter. He is then washed among those who wash him and is turned side to side among those who turn him side to side. When he is wrapped up in the shroud and is placed on the stretcher, his spirit comes out and begins to walk before the people. The spirits of believing people meet him with greetings of peace and good news of whatever bounties Allah, to whom belongs the Glorious praise, has prepared for him. When he is placed in his grave his spirit is returned to him down to his thighs and is asked of what he knows. If he then comes up with what he knows, that door which the Messenger of Allah had shown to him is opened, light, brightness, coolness, goodness and sweet smelling fragrance comes to him from there.’ The narrator has said that I then asked, ‘What about the strong pressure that grave applies?’ The Imam replied, ‘Never, a thing as such ever happens to believing people. By Allah, this earth feels proud of him saying, “Look, a believing person walks upon me but no believing person walks upon you.” The earth says to him, “I loved you when you walked upon my back and when I love, you can see what I will do for you.” It opens up as far and wide as his eyes can see.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/289)"
        ],
        "index": 4290,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/550",
              "text": "يُونُسَ بْنِ يَعْقُوبَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1604",
              "text": "سَعِيدِ بْنِ يَسَارٍ"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ فَضَّالٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ سَعِيدِ بْنِ يَسَارٍ أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:13:3",
        "text": [
          "هُ حَضَرَ أَحَدَ ابْنَيْ سَابُورَ وَ كَانَ لَهُمَا فَضْلٌ وَ وَرَعٌ وَ إِخْبَاتٌ فَمَرِضَ أَحَدُهُمَا وَ مَا أَحْسَبُهُ إِلَّا زَكَرِيَّا بْنَ سَابُورَ قَالَ فَحَضَرْتُهُ عِنْدَ مَوْتِهِ فَبَسَطَ يَدَهُ ثُمَّ قَالَ ابْيَضَّتْ يَدِي يَا عَلِيُّ ",
          "قَالَ فَدَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ عِنْدَهُ مُحَمَّدُ بْنُ مُسْلِمٍ قَالَ فَلَمَّا قُمْتُ مِنْ عِنْدِهِ ظَنَنْتُ أَنَّ مُحَمَّداً يُخْبِرُهُ بِخَبَرِ الرَّجُلِ فَأَتْبَعَنِي بِرَسُولٍ فَرَجَعْتُ إِلَيْهِ فَقَالَ أَخْبِرْنِي عَنْ هَذَا الرَّجُلِ الَّذِي حَضَرْتَهُ عِنْدَ الْمَوْتِ أَيَّ شَيْ‏ءٍ سَمِعْتَهُ يَقُولُ قَالَ قُلْتُ بَسَطَ يَدَهُ ثُمَّ قَالَ ابْيَضَّتْ يَدِي يَا عَلِيُّ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ اللَّهِ رَآهُ وَ اللَّهِ رَآهُ وَ اللَّهِ رَآهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Fazzal, from Yunus Bin Yaqoub, ",
            "(It has been narrated) from Saeed Bin Yasaar that he was present with one of the two sons of Sabour, and for them was merit, and piety, and sincerity. So one of them became sick, and I do not reckon except that it was Zakariyya Bin Sabour. He said, ‘So I was present with him during his death, and he extended his hand, then said, ‘My hands have whitened, O Ali’. ",
            "He (the narrator) said, ‘So I went over to Abu Abdullah<sup>asws</sup>, and in his<sup>asws</sup> presence was Muhammad Bin Muslim. So when I arose from his<sup>asws</sup> presence, I think that Muhammad informed him<sup>asws</sup> with the news of the man. So a messenger pursued me and I returned back to him<sup>asws</sup>. So he<sup>asws</sup> said: ‘Inform me about this man whom you were present with during his death. Which thing did you hear him saying?’ I said, ‘He extended his hand, then said, ‘My hands have whitened, O Ali’. So Abu Abdullah<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>, he saw him<sup>saww</sup>! By Allah<sup>azwj</sup>, he saw him<sup>saww</sup>! By Allah<sup>azwj</sup>, he saw him<sup>saww</sup>!’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn Faddal from Yunus ibn Ya’qub from Sa’id ibn Yasar who has said the following: “I was present at the time of the death of one of the sons of Sabur - both being people of merits, piety and great sincerity in their belief. One of them became ill and I think he was Zachariah ibn Sabur. I visited him in his dying condition. He stretched his hand and then said, ‘O Ali, my hands have become white.’ I then visited abu ‘Abd Allah, ‘Alayhi al-Salam, when Muhammad ibn Muslim was also there. When I stood up to leave, thinking that Muhammad would inform him about the case of the man (Zachariah ibn Sabur), he sent someone after me and I returned. He said, ‘Tell me about the man in whose dying condition you were present. What did you hear from him?’ I replied, ‘He stretched his hand and then said, “O Ali, my hands have become white!” Abu ‘Abd Allah, ‘Alayhi al-Salam, then said, ‘By Allah he saw him, by Allah he saw him, by Allah he saw him! ’” "
          ]
        }
      },
      {
        "index": 4291,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/31",
              "text": "مُحَمَّدِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/703",
              "text": "عَمَّارِ بْنِ مَرْوَانَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ حَدَّثَنِي "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1590",
              "text": "مَنْ سَمِعَ أَبَا عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " يَقُولُ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَمَّارِ بْنِ مَرْوَانَ قَالَ حَدَّثَنِي مَنْ سَمِعَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:13:4",
        "text": [
          " مِنْكُمْ وَ اللَّهِ يُقْبَلُ وَ لَكُمْ وَ اللَّهِ يُغْفَرُ إِنَّهُ لَيْسَ بَيْنَ أَحَدِكُمْ وَ بَيْنَ أَنْ يَغْتَبِطَ وَ يَرَى السُّرُورَ وَ قُرَّةَ الْعَيْنِ إِلَّا أَنْ تَبْلُغَ نَفْسُهُ هَاهُنَا وَ أَوْمَأَ بِيَدِهِ إِلَى حَلْقِهِ",
          "ثُمَّ قَالَ إِنَّهُ إِذَا كَانَ ذَلِكَ وَ احْتُضِرَ حَضَرَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ عَلِيٌّ ( عليه السلام ) وَ جَبْرَئِيلُ وَ مَلَكُ الْمَوْتِ ( عليه السلام ) فَيَدْنُو مِنْهُ عَلِيٌّ ( عليه السلام ) فَيَقُولُ يَا رَسُولَ اللَّهِ إِنَّ هَذَا كَانَ يُحِبُّنَا أَهْلَ الْبَيْتِ فَأَحِبَّهُ وَ يَقُولُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَا جَبْرَئِيلُ إِنَّ هَذَا كَانَ يُحِبُّ اللَّهَ وَ رَسُولَهُ وَ أَهْلَ بَيْتِ رَسُولِهِ فَأَحِبَّهُ وَ يَقُولُ جَبْرَئِيلُ لِمَلَكِ الْمَوْتِ إِنَّ هَذَا كَانَ يُحِبُّ اللَّهَ وَ رَسُولَهُ وَ أَهْلَ بَيْتِ رَسُولِهِ فَأَحِبَّهُ وَ ارْفُقْ بِهِ ",
          "فَيَدْنُو مِنْهُ مَلَكُ الْمَوْتِ فَيَقُولُ يَا عَبْدَ اللَّهِ أَخَذْتَ فَكَاكَ رَقَبَتِكَ أَخَذْتَ أَمَانَ بَرَاءَتِكَ تَمَسَّكْتَ بِالْعِصْمَةِ الْكُبْرَى فِي الْحَيَاةِ الدُّنْيَا قَالَ فَيُوَفِّقُهُ اللَّهُ عَزَّ وَ جَلَّ فَيَقُولُ نَعَمْ فَيَقُولُ وَ مَا ذَلِكَ فَيَقُولُ وَلَايَةُ عَلِيِّ بْنِ أَبِي طَالِبٍ ( عليه السلام ) فَيَقُولُ صَدَقْتَ أَمَّا الَّذِي كُنْتَ تَحْذَرُهُ فَقَدْ آمَنَكَ اللَّهُ مِنْهُ وَ أَمَّا الَّذِي كُنْتَ تَرْجُوهُ فَقَدْ أَدْرَكْتَهُ أَبْشِرْ بِالسَّلَفِ الصَّالِحِ مُرَافَقَةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ عَلِيٍّ وَ فَاطِمَةَ ( عليها السلام )",
          "ثُمَّ يَسُلُّ نَفْسَهُ سَلًّا رَفِيقاً ثُمَّ يَنْزِلُ بِكَفَنِهِ مِنَ الْجَنَّةِ وَ حَنُوطِهِ مِنَ الْجَنَّةِ بِمِسْكٍ أَذْفَرَ فَيُكَفَّنُ بِذَلِكَ الْكَفَنِ وَ يُحَنَّطُ بِذَلِكَ الْحَنُوطِ ثُمَّ يُكْسَى حُلَّةً صَفْرَاءَ مِنْ حُلَلِ الْجَنَّةِ فَإِذَا وُضِعَ فِي قَبْرِهِ فُتِحَ لَهُ بَابٌ مِنْ أَبْوَابِ الْجَنَّةِ يَدْخُلُ عَلَيْهِ مِنْ رَوْحِهَا وَ رَيْحَانِهَا ثُمَّ يُفْسَحُ لَهُ عَنْ أَمَامِهِ مَسِيرَةَ شَهْرٍ وَ عَنْ يَمِينِهِ وَ عَنْ يَسَارِهِ ثُمَّ يُقَالُ لَهُ نَمْ نَوْمَةَ الْعَرُوسِ عَلَى فِرَاشِهَا أَبْشِرْ بِرَوْحٍ وَ رَيْحَانٍ وَ جَنَّةِ نَعِيمٍ وَ رَبٍّ غَيْرِ غَضْبَانَ ",
          "ثُمَّ يَزُورُ آلَ مُحَمَّدٍ فِي جِنَانِ رَضْوَى فَيَأْكُلُ مَعَهُمْ مِنْ طَعَامِهِمْ وَ يَشْرَبُ مِنْ شَرَابِهِمْ وَ يَتَحَدَّثُ مَعَهُمْ فِي مَجَالِسِهِمْ حَتَّى يَقُومَ قَائِمُنَا أَهْلَ الْبَيْتِ فَإِذَا قَامَ قَائِمُنَا بَعَثَهُمُ اللَّهُ فَأَقْبَلُوا مَعَهُ يُلَبُّونَ زُمَراً زُمَراً ",
          "فَعِنْدَ ذَلِكَ يَرْتَابُ الْمُبْطِلُونَ وَ يَضْمَحِلُّ الْمُحِلُّونَ وَ قَلِيلٌ مَا يَكُونُونَ هَلَكَتِ الْمَحَاضِيرُ وَ نَجَا الْمُقَرَّبُونَ مِنْ أَجْلِ ذَلِكَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِعَلِيٍّ ( عليه السلام ) أَنْتَ أَخِي وَ مِيعَادُ مَا بَيْنِي وَ بَيْنَكَ وَادِي السَّلَامِ",
          "قَالَ وَ إِذَا احْتُضِرَ الْكَافِرُ حَضَرَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ عَلِيٌّ ( عليه السلام ) وَ جَبْرَئِيلُ ( عليه السلام ) وَ مَلَكُ الْمَوْتِ ( عليه السلام ) فَيَدْنُو مِنْهُ عَلِيٌّ ( عليه السلام ) فَيَقُولُ يَا رَسُولَ اللَّهِ إِنَّ هَذَا كَانَ يُبْغِضُنَا أَهْلَ الْبَيْتِ فَأَبْغِضْهُ وَ يَقُولُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَا جَبْرَئِيلُ إِنَّ هَذَا كَانَ يُبْغِضُ اللَّهَ وَ رَسُولَهُ وَ أَهْلَ بَيْتِ رَسُولِهِ فَأَبْغِضْهُ فَيَقُولُ جَبْرَئِيلُ يَا مَلَكَ الْمَوْتِ إِنَّ هَذَا كَانَ يُبْغِضُ اللَّهَ وَ رَسُولَهُ وَ أَهْلَ بَيْتِ رَسُولِهِ فَأَبْغِضْهُ وَ اعْنُفْ عَلَيْهِ",
          "فَيَدْنُو مِنْهُ مَلَكُ الْمَوْتِ فَيَقُولُ يَا عَبْدَ اللَّهِ أَخَذْتَ فَكَاكَ رِهَانِكَ أَخَذْتَ أَمَانَ بَرَاءَتِكَ تَمَسَّكْتَ بِالْعِصْمَةِ الْكُبْرَى فِي الْحَيَاةِ الدُّنْيَا فَيَقُولُ لَا فَيَقُولُ أَبْشِرْ يَا عَدُوَّ اللَّهِ بِسَخَطِ اللَّهِ عَزَّ وَ جَلَّ وَ عَذَابِهِ وَ النَّارِ أَمَّا الَّذِي كُنْتَ تَحْذَرُهُ فَقَدْ نَزَلَ بِكَ ثُمَّ يَسُلُّ نَفْسَهُ سَلًّا عَنِيفاً ثُمَّ يُوَكِّلُ بِرُوحِهِ ثَلَاثَمِائَةِ شَيْطَانٍ كُلُّهُمْ يَبْزُقُ فِي وَجْهِهِ وَ يَتَأَذَّى بِرُوحِهِ فَإِذَا وُضِعَ فِي قَبْرِهِ فُتِحَ لَهُ بَابٌ مِنْ أَبْوَابِ النَّارِ فَيَدْخُلُ عَلَيْهِ مِنْ قَيْحِهَا وَ لَهَبِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Ammar Bin Marwan who said, ",
            "‘It was narrated to me by the one who heard Abu Abdullah<sup>asws</sup> saying: ‘By Allah<sup>azwj</sup>, there would be Acceptance from you, and by Allah<sup>azwj</sup> there would be Forgiveness for you! There is nothing between one of you and his exultation, and him seeing the joy and the delight of his eyes, except the reaching of his soul to over here’, and he<sup>asws</sup> gestured with his<sup>asws</sup> hand to his<sup>asws</sup> throat.",
            "Then he<sup>asws</sup> said: ‘When it would be like that, and he is about to die, Rasool-Allah<sup>saww</sup> and Ali<sup>asws</sup> and Jibraeel<sup>as</sup> and the Angel of death attend him, and Ali<sup>asws</sup> would approach him and he<sup>asws</sup> would be saying: ‘O Rasool-Allah<sup>saww</sup>! This one used to love us<sup>asws</sup>, the People<sup>asws</sup> of the Household, so love him. And Rasool-Allah<sup>saww</sup> would be saying: ‘O Jibraeel<sup>as</sup>! This one used to love Allah<sup>azwj</sup>, and His<sup>azwj</sup> Rasool<sup>saww</sup>, and the People<sup>asws</sup> of the Household of His<sup>azwj</sup> Rasool<sup>saww</sup>, so love him. And Jibraeel<sup>as</sup> would be saying to the Angel of death: ‘This one used to love Allah<sup>azwj</sup>, and His<sup>azwj</sup> Rasool<sup>saww</sup> and the People<sup>asws</sup> of the Household of His<sup>azwj</sup> Rasool<sup>saww</sup>, so I<sup>as</sup> love him and be kind with him. ",
            "So the Angel of death approaches him and would be saying to him: ‘O servant of Allah<sup>azwj</sup>! Did you take the redemption of your neck (from the Fire)? Did you take the deed of security of your freedom (from the Fire), attaching with the greatest immunity in the life of the world?’ So Allah<sup>azwj</sup> would Cause him to speak and he would be saying, ‘Yes’. So he (the Angel of death) would be saying: ‘And what is that?’ So he (the deceased) would be saying, ‘The Wilayah of Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>’. He would be saying, ‘You have spoken the truth. As for that which you were cautious of, so Allah<sup>azwj</sup> has Secured you from it, and as for that which you were wishing for, so will realise it. Receive glad tidings to be with the righteous ancestors as friends of Rasool-Allah<sup>saww</sup> and Ali<sup>asws</sup> and Fatima<sup>asws</sup>’. ",
            "Then his soul would flow (out of his body) with a gentle flowing. Then they would descend with his shroud from the Paradise, and his embalming from the Paradise with the saffron musk, so he would be enshrouded with that shroud and embalmed with that embalming. Then he would be clothed with a yellow garment from the garments of the Paradise. So when he would be placed in his grave, a Door from the Doors of the Paradise would be opened up for him, and there would be entering upon him its breezes and its fragrances. Then there would be expanded for him, from ahead of him, a travel distance of a year, and from his right and from his left. Then it would be said to him: ‘Sleep the sleep of a newly wedded bride upon her bed. Receive glad tidings with the breezes and the fragrances and a blissful garden and a Lord<sup>azwj</sup> not Angered’.",
            "Then he would be visiting the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> in Gardens of Pleasure, so he would eat with them<sup>asws</sup> from their<sup>asws</sup> meals, and drink from their<sup>asws</sup> drinks, and would be discussing with them<sup>asws</sup> in their<sup>asws</sup> gatherings until the rising of our<sup>asws</sup> Qaim<sup>asws</sup> of the People<sup>asws</sup> of the Household. So when our<sup>asws</sup> Qaim<sup>asws</sup> rises, Allah<sup>azwj</sup> would Send for them, and they would meet up with him<sup>asws</sup> exclaiming <span class=\"iTxt\">Talbiyya</span> (Here I am, Here I am), in groups and groups. ",
            "Therefore, during that, the doubters would be invalidated, and be destroyed by an annihilation, and very few of the cautioning ones (of the appearance of Al-Qaim<sup>asws</sup>) would happen to perish, and the ones speaking of its nearness (of the appearance of Al-Qaim<sup>asws</sup>) would attain salvation. Due to that, Rasool-Allah<sup>saww</sup> said to Ali<sup>asws</sup>: ‘You<sup>asws</sup> are my<sup>saww</sup> brother<sup>asws</sup>, and an appointment between me<sup>saww</sup> and you<sup>asws</sup> is in the Valley of Peace’. ",
            "When the infidel is near to dying, Rasool-Allah<sup>saww</sup> and Ali<sup>asws</sup> and Jibraeel<sup>as</sup> and the Angel of death come over to him. So Ali<sup>asws</sup> approaches him and would be saying: ‘O Rasool-Allah<sup>saww</sup>! This one used to hate the People<sup>asws</sup> of the Household, so hate him’. And Rasool-Allah<sup>saww</sup> would be saying: ‘O Jibraeel<sup>as</sup>! This one used to hate Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>, and the People<sup>asws</sup> of the Household of His<sup>azwj</sup> Rasool<sup>saww</sup>, so hate him’. So Jibraeel<sup>as</sup> would be saying: ‘O Angel of death! This is one who used to hate Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup> and the People<sup>asws</sup> of his<sup>saww</sup> Household, so hate him and be fierce upon him.",
            "So the Angel of death approaches him and would be saying to him: ‘O servant of Allah<sup>azwj</sup>! Did you take the redemption of your neck (from the Fire)? Did you take the deed of security of your freedom (from the Fire), attaching with the greatest immunity in the life of the world?’ So he would say, ‘No’. So he would be saying, ‘Receive news, O enemy of Allah<sup>azwj</sup> Mighty and Majestic, of His<sup>azwj</sup> Punishment and the Fire. As for that which you were scared of, so it would descend unto you’. Then his soul would flow (out from his body) with a rough flowing. Then three hundred devils would be allocated with him, all of them spitting in his face, and hurting his soul. So when he is placed in his grave, a Door from the Doors of the Fire would be opened up for him, and there would enter upon him its pus and its flames’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from ‘Ammar ibn Marwan from a person who had who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam say, ‘Only from you, by Allah, it (good deeds) is accepted and only your sins are forgiven. There is nothing between any one of you and bliss, joy and the delight of heart, except the time when the soul reaches here’ - pointing to his throat he continued - ‘and when that time comes the Messenger of Allah, Ali, Gabriel and the angel of death come to visit him. Ali comes near him and says, ‘O Messenger of Allah, this person loved us (Ahl al-Bayt), thus please, love him.’ The Messenger of Allah, then says, ‘O Gabriel, this person loved Allah, His Messenger, and the family of His Messenger, thus please love him.’ Gabriel then says, ‘O angel of death, this person loved Allah, His Messenger, and the family of His Messenger, thus please love him and be kind to him.’ The angel of death then comes near him and says, ‘O servant of Allah, have you freed your neck (from punishment), acquired the certificate of exoneration (from sins) and established your hold to the greatest source of protection in the worldly life?”’ The Imam then said, ‘Allah, the Majestic, the Glorious, then grants him power to say, “Yes, I have done so.’” The angel asks, “What is it?” He replies, “It is (my accepting) the guardianship, the Divine Authority of Ali ibn abu Talib, ‘Alayhi al- Salam .” The angel then says, “You have spoken the truth. Allah has now granted you safety from whatever you feared and all of your wishes that you wanted have come true. There is good news for you along with the virtuous ancestors to be in the company of the Messenger of Allah, Ali and Fatimah, ‘Alayhim al-Salam .” Then he gently separates his soul from his body. Then his shroud is brought from paradise and a special (hunut) perfume in the form of Adhfar Musk. He then is dressed up with that shroud, and that hunut is used. In addition, he is dressed up with a yellow dress of the dresses of paradise. When he is placed in the grave, a door from paradise is opened, through which breeze and fragrance come to him. Thereafter, a space of the distance of one month’s journey is opened in front and on both of his sides. Then it is said to him, “Rest like a bridegroom in his bed with good news of the delightful breeze, fragrance, bountiful paradise and the pleasure of the Lord.” He then visits the family of Muhammad in Rizwan paradise, and is served food and drink with them. He speaks to them in their gatherings until the reappearance of al-Qa’im from Ahl al-Bayt. When al- Qa’im reappears, Allah resurrects them and they come along with him wholeheartedly in groups and formations. The unbelievers at this time become worthless, and disrespectful ones are destroyed but they are very few. People who want the reappearance of Al-Qa’im very quickly vanish and those who believe it (reappearance) is near gain their salvation. For this reason the Messenger of Allah said to Ali, ‘Alayhi al-Salam, “You are my brother and the place for us to meet is the valley of Peace.’” The Imam then said, ‘When it is time for an unbeliever to die, the Messenger of Allah, Ali, Gabriel and the angel of death visit him. Ali comes closer to him and says, “O Messenger of Allah, this person disliked us (Ahl al-Bayt), thus dislike him.” The Messenger of Allah then says, “O Gabriel, this person disliked Allah, His Messenger and the family of His Messenger (Ahl al-Bayt), thus please, dislike him.” Gabriel then says, “O angel of death, this person disliked Allah, His Messenger, and the family of His Messenger, thus you should also dislike him and be firm with him.” The angel of death then comes near him and says, “O servant of Allah, have you freed your neck from punishment, acquired the certificate of exoneration from sins and established a secure hold to the source of safety in the worldly life?” He then says, “No.” The angel then says, “O enemy of Allah, the Majestic, the Glorious, His anger, punishment and hell await you. Whatever you were afraid of has come upon you”; and then he separates his soul from his body in a very harsh manner. Three hundred devils are then assigned over his soul who spit on his face and torture his soul. When he is placed in his grave a door of the doors of hell, whereby pus and flames enter in his grave, is opened.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/293)"
        ],
        "index": 4292,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "النَّضْرِ بْنِ سُوَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/233",
              "text": "يَحْيَى الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/217",
              "text": "ابْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2456",
              "text": "عَبْدِ الرَّحِيمِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنِ ابْنِ مُسْكَانَ عَنْ عَبْدِ الرَّحِيمِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:13:5",
        "text": [
          " قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) حَدَّثَنِي صَالِحُ بْنُ مِيثَمٍ عَنْ عَبَايَةَ الْأَسَدِيِّ أَنَّهُ سَمِعَ عَلِيّاً ( عليه السلام ) يَقُولُ وَ اللَّهِ لَا يُبْغِضُنِي عَبْدٌ أَبَداً يَمُوتُ عَلَى بُغْضِي إِلَّا رَآنِي عِنْدَ مَوْتِهِ حَيْثُ يَكْرَهُ وَ لَا يُحِبُّنِي عَبْدٌ أَبَداً فَيَمُوتُ عَلَى حُبِّي إِلَّا رَآنِي عِنْدَ مَوْتِهِ حَيْثُ يُحِبُّ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) نَعَمْ وَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِالْيَمِينِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Yaya Al Halby, from Ibn Muskan, from Abdul Raheem who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘Salih Bin Maysam narrated to me from Abayat Al-Asady, that he heard Ali<sup>asws</sup> saying: ‘By Allah<sup>azwj</sup>! No servant would hate me<sup>asws</sup> ever, dying on hatred, except that he would see me<sup>asws</sup> during his death abhorring it, and no servant would love me<sup>asws</sup> ever, dying upon my<sup>asws</sup> love, except that he would see me<sup>asws</sup> during his death loving it’. So Abu Ja’far<sup>asws</sup> said: ‘Yes, and with Rasool-Allah<sup>saww</sup> upon his right’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd, from Yahya al-Halabiy from ibn Muskan from ’Abd al-Rahim who has said the following: “Once I said to abu Ja‘far, ‘Alayhi al-Salam, that Salih ibn Mitham narrated to me from ‘Abayah al- Asadi who had heard Ali, ‘Alayhi al-Salam, say the following: ‘By Allah, everyone who dislikes me and dies in such condition, can see me at the time of his death but with dislike. Everyone who loves me and dies in such condition, can see me at the time of his death with love.’ Abu Ja‘far, ‘Alayhi al- Salam, then said, ‘Yes, and the Messenger of Allah on his right side.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/293)"
        ],
        "index": 4293,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/165",
              "text": "مُعَاوِيَةَ بْنِ وَهْبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2457",
              "text": "يَحْيَى بْنِ سَابُورٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ عَنْ يَحْيَى بْنِ سَابُورٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:13:6",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ فِي الْمَيِّتِ تَدْمَعُ عَيْنُهُ عِنْدَ الْمَوْتِ فَقَالَ ذَلِكَ عِنْدَ مُعَايَنَةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَيَرَى مَا يَسُرُّهُ ثُمَّ قَالَ أَ مَا تَرَى الرَّجُلَ يَرَى مَا يَسُرُّهُ وَ مَا يُحِبُّ فَتَدْمَعُ عَيْنُهُ لِذَلِكَ وَ يَضْحَكُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Muawiya Bin Wahab, from Yahya Bin Sabour who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying regarding the deceased, tears flowing form his eyes: ‘That is during him seeing Rasool-Allah<sup>saww</sup>, so he sees what overjoys him’. Then he<sup>asws</sup> said: ‘Have you not seen the man seeing what overjoys him and what he loves, so his eyes fill up with tears due to that, and he laughs?’"
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Mu‘awiyah ibn Wahab from Yahya ibn Sabur who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, say about a dying person, ‘His eye tears up (moistens with tears) at the time of his death.’ He then said, ‘This happens upon seeing the Messenger of Allah. He sees what makes him happy.’ He then said, ‘Is it not a fact that when a person sees someone whom he loves his eye tears up (moistens with tears) and he laughs?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل مختلف فيه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/293)"
        ],
        "index": 4294,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1407",
              "text": "حُمَيْدُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2337",
              "text": "الْحَسَنِ بْنِ مُحَمَّدٍ الْكِنْدِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/212",
              "text": "غَيْرِ وَاحِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/257",
              "text": "أَبَانِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2183",
              "text": "عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ جُذَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الْكِنْدِيِّ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ جُذَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:13:7",
        "text": [
          " سَمِعْتُهُ يَقُولُ إِنَّ النَّفْسَ إِذَا وَقَعَتْ فِي الْحَلْقِ أَتَاهُ مَلَكٌ فَقَالَ لَهُ يَا هَذَا أَوْ يَا فُلَانُ أَمَّا مَا كُنْتَ تَرْجُو فَأْيَسْ مِنْهُ وَ هُوَ الرُّجُوعُ إِلَى الدُّنْيَا وَ أَمَّا مَا كُنْتَ تَخَافُ فَقَدْ أَمِنْتَ مِنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Al Kindy, from someone else, from AbanBin Usman, from Aamir Bin Abdullah Bin Juza’at, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘When the soul comes to be in the throat, an Angel comes over to him and says to him: ‘O you!’, or ‘O so and so! As for what you were hoping for, so despair from it’, and it is the returning to the world, ‘And as for what you were fearing, so you are (now) secured from it’."
          ],
          "en.sarwar": [
            "7. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad al-Kindiy from more than one person from Aban ibn ‘Uthman from ‘Amir ibn ‘Abd Allah ibn Judha‘ah who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘When a soul reaches the throat, an angel comes and says to him, “O you, - or so and so - what you had hoped for, be certain, is of no avail to you, meaning returning to the worldly life, but you have become safe from whatever you were afraid of.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل كالحسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/294)"
        ],
        "index": 4295,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2458",
              "text": "أَبَانُ بْنُ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1400",
              "text": "عُقْبَةَ"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "أَبَانُ بْنُ عُثْمَانَ عَنْ عُقْبَةَ أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:13:8",
        "relations": {
          "Mentions": [
            "/books/quran:10:64"
          ]
        },
        "text": [
          "هُ سَمِعَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ الرَّجُلَ إِذَا وَقَعَتْ نَفْسُهُ فِي صَدْرِهِ يَرَى قُلْتُ جُعِلْتُ فِدَاكَ وَ مَا يَرَى قَالَ يَرَى رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَيَقُولُ لَهُ رَسُولُ اللَّهِ أَنَا رَسُولُ اللَّهِ أَبْشِرْ ثُمَّ يَرَى عَلِيَّ بْنَ أَبِي طَالِبٍ ( عليه السلام ) فَيَقُولُ أَنَا عَلِيُّ بْنُ أَبِي طَالِبٍ الَّذِي كُنْتَ تُحِبُّهُ تُحِبُّ أَنْ أَنْفَعَكَ الْيَوْمَ ",
          "قَالَ قُلْتُ لَهُ أَ يَكُونُ أَحَدٌ مِنَ النَّاسِ يَرَى هَذَا ثُمَّ يَرْجِعُ إِلَى الدُّنْيَا قَالَ قَالَ لَا إِذَا رَأَى هَذَا أَبَداً مَاتَ وَ أَعْظَمَ ذَلِكَ قَالَ وَ ذَلِكَ فِي الْقُرْآنِ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ الَّذِينَ آمَنُوا وَ كانُوا يَتَّقُونَ. لَهُمُ الْبُشْرى فِي الْحَياةِ الدُّنْيا وَ فِي الْآخِرَةِ لا تَبْدِيلَ لِكَلِماتِ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Aban Bin Usman, ",
            "(It has been narrated) from Uqba who heard Abu Abdullah<sup>asws</sup> saying: ‘The man, when his soul comes up to be in his chest, sees’. I said, ‘May I be sacrificed for you<sup>asws</sup>! And what does he see?’ He<sup>asws</sup> said: ‘He sees Rasool-Allah<sup>saww</sup>, and Rasool-Allah<sup>saww</sup> is saying to him: ‘Receive glad tidings!’ The he sees Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, and he<sup>asws</sup> is saying to him: ‘I<sup>asws</sup> am Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, whom you used to love. Your love would benefit you today’. ",
            "He (the narrator) said, ‘I said to him<sup>asws</sup>, ‘Can it happen for anyone from the people when he sees this, then he would return to the world?’ He<sup>asws</sup> said: ‘No. When he sees this, he would be dead forever, and that is a great thing. And that is in the Quran, the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:10#h64\">[10:64]</a> For them is good news in the life of the world and in the Hereafter; there is no changing the Words of Allah</span>’."
          ],
          "en.sarwar": [
            "8. Aban ibn ‘Uthman has narrated from ‘Uqbah who had heard abu ‘Abd Allah, ‘Alayhi al-Salam, saying the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘When a man’s soul reaches his chest he then sees.’ I then asked, ‘May Allah keep my soul in the service of your cause, what does he see?’ The Imam said, ‘He sees the Messenger of Allah and he says, “I am the Messenger of Allah. I have good news for you.” He then sees Ali ibn abu Talib, ‘Alayhi al-Salam, who says, “I am Ali ibn abu Talib, whom you loved. He loves to benefit you today.’” I then asked, ‘Can anyone who sees them come back to this life?’ He said, ‘No, when one sees them, he then can never return back to this life.’ He considered it a great thing. He said this is in the Quran in the words of Allah, the Majestic, the Glorious, ‘Those who believe, who were faithful to their belief, receive good news in this world and in the next life and there is no change in the words of Allah.’” <a href=\"/#/books/quran:10#h64\">[10:64]</a> "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/294)"
        ],
        "index": 4296,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/657",
              "text": "عَبْدِ الْعَزِيزِ الْعَبْدِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/66",
              "text": "ابْنِ أَبِي يَعْفُورٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ الْعَزِيزِ الْعَبْدِيِّ عَنِ ابْنِ أَبِي يَعْفُورٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:13:9",
        "text": [
          " كَانَ خَطَّابٌ الْجُهَنِيُّ خَلِيطاً لَنَا وَ كَانَ شَدِيدَ النَّصْبِ لآِلِ مُحَمَّدٍ ( عليهم السلام ) وَ كَانَ يَصْحَبُ نَجْدَةَ الْحَرُورِيَّةَ قَالَ فَدَخَلْتُ عَلَيْهِ أَعُودُهُ لِلْخُلْطَةِ وَ التَّقِيَّةِ فَإِذَا هُوَ مُغْمًى عَلَيْهِ فِي حَدِّ الْمَوْتِ فَسَمِعْتُهُ يَقُولُ مَا لِي وَ لَكَ يَا عَلِيُّ فَأَخْبَرْتُ بِذَلِكَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) رَآهُ وَ رَبِّ الْكَعْبَةِ رَآهُ وَ رَبِّ الْكَعْبَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ibn Mahboub, from Abdul Aziz Al Abdy, from Ibn Abu Yafour who said, ",
            "‘Khattab Al-Juhny used to blend in with us and he was extremely hostile to the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and he was a companions of Najdat Al-Harouriyya. So I went over to him for a short visit (during his death) due to his blending in with us and the (observance of) dissimulation. So when he was gloomy upon it during a limit of the death, I heard him saying, ‘What is the matter with me and you, (i.e., ‘Why am I against you’) O Ali?’ So I informed Abu Abdullah<sup>asws</sup> about that. So Abu Abdullah<sup>asws</sup> said: ‘He saw him<sup>saww</sup>, by the Lord<sup>azwj</sup> of the Kabah! He saw him<sup>saww</sup>, by the Lord<sup>azwj</sup> of the Kabah!’"
          ],
          "en.sarwar": [
            "9. A number of our people have narrated from Sahl ibn Ziyad from ibn Mahbub from ‘Abd al-‘Aziz al-‘Abdiy from ibn abu Ya‘fur who has said the following: “Khattab al-Juhniy was one of our associates and he was a hardheaded adversary of the family of Muhammad, ‘Alayhim al-Salam. He was a companion of Najdah al-Harawriyyah. I once went to visit him to maintain social relations and due to fear. I found him fainted in dying condition and heard him say, ‘What did I have to do against you, O Ali?’ I informed abu ‘Abd Allah, ‘Alayhi al-Salam, about it and he said, ‘By the Lord of al-Ka‘bah, he saw him! By the Lord of al-Ka‘bah, he saw him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/295)"
        ],
        "index": 4297,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1052",
              "text": "سَهْلُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/239",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/73",
              "text": "حَمَّادِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2459",
              "text": "عَبْدِ الْحَمِيدِ بْنِ عَوَّاضٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "سَهْلُ بْنُ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ عَبْدِ الْحَمِيدِ بْنِ عَوَّاضٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:13:10",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِذَا بَلَغَتْ نَفْسُ أَحَدِكُمْ هَذِهِ قِيلَ لَهُ أَمَّا مَا كُنْتَ تَحْذَرُ مِنْ هَمِّ الدُّنْيَا وَ حُزْنِهَا فَقَدْ أَمِنْتَ مِنْهُ وَ يُقَالُ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ عَلِيٌّ ( عليه السلام ) وَ فَاطِمَةُ ( عليها السلام ) أَمَامَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Hammad Bin Usman, from Abdul Hameed Bin Awwaz who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘When a soul of one of you reaches this (point), it is said to him: ‘As for what you were cautious of from the worries of the world and its grief, so you are safe from it’; and it is said to him: ‘Rasool-Allah<sup>saww</sup> and Ali<sup>asws</sup> and Fatima<sup>asws</sup> are in front of you’."
          ],
          "en.sarwar": [
            "10. Sahl ibn Ziyad has narrated from Ahmad ibn Muhammad ibn abu Nasr from Hammad ibn ‘Uthman from ‘Abd al-‘Aziz ibn ‘Awwad who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘When the soul of any one of you reaches this point, he is told, “You are now safe from the anxiety and sadness of the worldly matters.’” It is also said to him, ‘The Messenger of Allah, Ali and Fatimah, ‘Alayhim al-Salam, are in front of you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/295)"
        ],
        "index": 4298,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/180",
              "text": "مُحَمَّدِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/459",
              "text": "مُحَمَّدِ بْنِ الْفُضَيْلِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/111",
              "text": "أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:13:11",
        "text": [
          " سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ إِنَّ آيَةَ الْمُؤْمِنِ إِذَا حَضَرَهُ الْمَوْتُ يَبْيَاضُّ وَجْهُهُ أَشَدَّ مِنْ بَيَاضِ لَوْنِهِ وَ يَرْشَحُ جَبِينُهُ وَ يَسِيلُ مِنْ عَيْنَيْهِ كَهَيْئَةِ الدُّمُوعِ فَيَكُونُ ذَلِكَ خُرُوجَ نَفْسِهِ وَ إِنَّ الْكَافِرَ تَخْرُجُ نَفْسُهُ سَلًّا مِنْ شِدْقِهِ كَزَبَدِ الْبَعِيرِ أَوْ كَمَا تَخْرُجُ نَفْسُ الْبَعِيرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Ali, from Muhammad Bin Al Fuzayl, from Abu Hamza who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘A sign of the Believer when the death presents itself (is that) his face whitens more intensely than the whitening of his colour, and his forehead sweats, and (water) flows from his eyes like tears, so that would happen during the exit of his soul; and the Infidel, his soul flows from the angle of his mouth like the foam of the camel, or just as the exiting of the soul of the camel’."
          ],
          "en.sarwar": [
            "11. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn Ali from Muhammad ibn al-Fudayl from abu Hamzah who has said the following: “I heard abu Ja‘far, ‘Alayhi al-Salam, say, ‘One of the signs of belief in a person is that at the time of his death his face turns more white than normal, his forehead sweats, something like tears flow from his eyes and that is the time for coming out of his soul from his body. The soul of an unbeliever comes out of his body as if forced out of his mouth with bubbles like the coming out of the soul of a camel.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/295)"
        ],
        "index": 4299,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/129",
              "text": "مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/162",
              "text": "الْقَاسِمِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/400",
              "text": "عَبْدِ الصَّمَدِ بْنِ بَشِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/42",
              "text": "بَعْضِ أَصْحَابِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ وَ الْحُسَيْنِ بْنِ سَعِيدٍ جَمِيعاً عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَبْدِ الصَّمَدِ بْنِ بَشِيرٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:13:12",
        "text": [
          " قُلْتُ أَصْلَحَكَ اللَّهُ مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَ مَنْ أَبْغَضَ لِقَاءَ اللَّهِ أَبْغَضَ اللَّهُ لِقَاءَهُ قَالَ نَعَمْ قُلْتُ فَوَ اللَّهِ إِنَّا لَنَكْرَهُ الْمَوْتَ فَقَالَ لَيْسَ ذَلِكَ حَيْثُ تَذْهَبُ إِنَّمَا ذَلِكَ عِنْدَ الْمُعَايَنَةِ إِذَا رَأَى مَا يُحِبُّ فَلَيْسَ شَيْ‏ءٌ أَحَبَّ إِلَيْهِ مِنْ أَنْ يَتَقَدَّمَ وَ اللَّهُ تَعَالَى يُحِبُّ لِقَاءَهُ وَ هُوَ يُحِبُّ لِقَاءَ اللَّهِ حِينَئِذٍ وَ إِذَا رَأَى مَا يَكْرَهُ فَلَيْسَ شَيْ‏ءٌ أَبْغَضَ إِلَيْهِ مِنْ لِقَاءِ اللَّهِ وَ اللَّهُ يُبْغِضُ لِقَاءَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Khalid and Al Husayn Bin Saeed, altogether from Al Qasim Bin Muhammad, from Abdul Samad Bin Basheer, from one of his companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! The one who loves to meet Allah<sup>azwj</sup>, Allah<sup>azwj</sup> Loves to meet him, and the one who hates meeting Allah<sup>azwj</sup>, Allah<sup>azwj</sup> would Hate to meet him?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘By Allah<sup>azwj</sup>! I dislike the death’. So he<sup>asws</sup> said: ‘That is not where you are going with it. But rather, that is during the eye-witnessing when he sees what he loves. So there would be nothing more beloved to him than him proceeding, and Allah<sup>azwj</sup> the Exalted would Love to meet him, and he would love to meet Allah<sup>azwj</sup>, then and there. And when he sees what he dislikes, so there would be nothing more hateful to him than meeting Allah<sup>azwj</sup> and Allah<sup>azwj</sup> would Hate to meet him’."
          ],
          "en.sarwar": [
            "12. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn Khalid and al-Husayn ibn Sa‘id all from al-Qasim ibn Muhammad from ‘Abd al-Samad ibn Bashir from certain persons of his people who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ‘May Allah grant you wellbeing, is it true that whoever loves to meet Allah, He loves to meet him, and whoever dislikes to meet Allah He dislikes to meet him?’ He said, ‘Yes, that is true.’ I then said, ‘By Allah, we dislike death.’ The Imam then said, ‘It is not the way you think it is. That happens upon observation. When one sees what he loves, then there is nothing more beloved to him than to advance forward and Allah, the Most High, loves to meet him and he loves to meet Allah at such time. When one sees things that he does not like, then there is nothing more to his dislike than meeting Allah and Allah dislikes meeting him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/296)"
        ],
        "index": 4300,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/170",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2460",
              "text": "أَبِي الْمُسْتَهِلِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2461",
              "text": "مُحَمَّدِ بْنِ حَنْظَلَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ أَبِي الْمُسْتَهِلِّ عَنْ مُحَمَّدِ بْنِ حَنْظَلَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:13:13",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ حَدِيثٌ سَمِعْتُهُ مِنْ بَعْضِ شِيعَتِكَ وَ مَوَالِيكَ يَرْوِيهِ عَنْ أَبِيكَ قَالَ وَ مَا هُوَ قُلْتُ زَعَمُوا أَنَّهُ كَانَ يَقُولُ أَغْبَطُ مَا يَكُونُ امْرُؤٌ بِمَا نَحْنُ عَلَيْهِ إِذَا كَانَتِ النَّفْسُ فِي هَذِهِ فَقَالَ نَعَمْ إِذَا كَانَ ذَلِكَ أَتَاهُ نَبِيُّ اللَّهِ وَ أَتَاهُ عَلِيٌّ وَ أَتَاهُ جَبْرَئِيلُ وَ أَتَاهُ مَلَكُ الْمَوْتِ ( عليه السلام ) فَيَقُولُ ذَلِكَ الْمَلَكُ لِعَلِيٍّ ( عليه السلام ) يَا عَلِيُّ إِنَّ فُلَاناً كَانَ مُوَالِياً لَكَ وَ لِأَهْلِ بَيْتِكَ فَيَقُولُ نَعَمْ كَانَ يَتَوَلَّانَا وَ يَتَبَرَّأُ مِنْ عَدُوِّنَا فَيَقُولُ ذَلِكَ نَبِيُّ اللَّهِ لِجَبْرَئِيلَ فَيَرْفَعُ ذَلِكَ جَبْرَئِيلُ إِلَى اللَّهِ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Abu Al Mustahil, from Muhammad Bin Hanzala who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! A Hadeeth which I heard from one of your<sup>asws</sup> Shia and the one in your<sup>asws</sup> Wilayah, reporting it from your<sup>asws</sup> father<sup>asws</sup>’. He<sup>asws</sup> said: ‘And what is it?’ I said, ‘He was claiming that he<sup>asws</sup> had said: ‘Overjoyed is what a person would happen to be with what we<sup>asws</sup> are upon, when the soul was in this (point)’. So he<sup>asws</sup> said: ‘Yes. When it would be that, the Prophet<sup>saww</sup> of Allah<sup>azwj</sup> would come to him, and Ali<sup>asws</sup> would come to him, and Jibraeel<sup>as</sup> would come to him, and the Angel of death would come to him. So that Angel would be saying to Ali<sup>asws</sup>: ‘O Ali<sup>asws</sup>! Was so and so in your<sup>asws</sup> Wilayah and of the People<sup>asws</sup> of your<sup>asws</sup> Household?’ So he<sup>asws</sup> would be saying: ‘Yes, he used to be with our<sup>asws</sup> Wilayah, and used to disavow from our<sup>asws</sup> enemies’. And Rasool-Allah<sup>azwj</sup> would be saying that to Jibraeel<sup>as</sup>, and Jibraeel<sup>as</sup> would raise that to Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "13. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from abu al-Mustahal from Muhammad ibn Hanzalah who has said the following: “Once I said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘May Allah keep my soul in the service of your cause, I have heard a Hadith from your followers and servants who narrate from your father.’ He then asked, ’What is it?’ I replied, ‘They think that he said, “One should be proud of his affairs being as what we believe in when his soul reaches here.’” He (the Imam) said, ‘Yes, when that happens, the Holy Prophet of Allah comes, Ali comes, Gabriel comes and the angel of death comes. That angel then asks Ali, ‘Alayhi al-Salam, “O Ali, did so and so love you and your family?” He says, “Yes, he loved us and denounced our enemies.” Then the Holy Prophet says this to Gabriel and Gabriel raises this to Allah, the Majestic, the Glorious.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/296)"
        ],
        "index": 4301,
        "local_index": 14,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/603",
              "text": "صَفْوَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2462",
              "text": "جَارُودِ بْنِ الْمُنْذِرِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ عَنْهُ عَنْ صَفْوَانَ عَنْ جَارُودِ بْنِ الْمُنْذِرِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:13:14",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِذَا بَلَغَتْ نَفْسُ أَحَدِكُمْ هَذِهِ وَ أَوْمَأَ بِيَدِهِ إِلَى حَلْقِهِ قَرَّتْ عَيْنُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Safwan, from Jaroud Bin Al Munzar who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘When the soul of one of you reaches this (point)’, and he<sup>asws</sup> gestured with his<sup>asws</sup> hand to his<sup>asws</sup> throat, his eyes would be delighted’."
          ],
          "en.sarwar": [
            "14. It is narrated from him (narrator of the above Hadith) from Safwan from Jarud ibn al-Mundhir who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘When the soul of one of you reaches here’ - pointing to his throat - ‘his eyes become delightful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/296)"
        ],
        "index": 4302,
        "local_index": 15,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "النَّضْرِ بْنِ سُوَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/233",
              "text": "يَحْيَى الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1542",
              "text": "سُلَيْمَانَ بْنِ دَاوُدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ عَنْ أَبِي بَصِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:13:15",
        "relations": {
          "Mentions": [
            "/books/quran:56:83",
            "/books/quran:56:87"
          ]
        },
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَوْلُهُ عَزَّ وَ جَلَّ فَلَوْ لا إِذا بَلَغَتِ الْحُلْقُومَ إِلَى قَوْلِهِ إِنْ كُنْتُمْ صادِقِينَ فَقَالَ إِنَّهَا إِذَا بَلَغَتِ الْحُلْقُومَ ثُمَّ أُرِيَ مَنْزِلَهُ مِنَ الْجَنَّةِ فَيَقُولُ رُدُّونِي إِلَى الدُّنْيَا حَتَّى أُخْبِرَ أَهْلِي بِمَا أَرَى فَيُقَالُ لَهُ لَيْسَ إِلَى ذَلِكَ سَبِيلٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Yahya Al Halby, from Suleyman Bin Dawood, from Abu Baseer who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘(What about) the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:56#h83\">[56:83]</a> So why is it not then that when it (soul) comes up to the throat </span>– up to His<sup>azwj</sup> Words<span class=\"ibTxt\"> <a href=\"/#/books/quran:56#h87\">[56:87]</a> That you do not send it back, if you are truthful?</span> So he<sup>asws</sup> said: ‘When it (soul) reaches the throat, then he sees his house from the Paradise, so he is saying, ‘Return me to the world until I inform my family with what I see’. So it is said to him: ‘There is no way to that’."
          ],
          "en.sarwar": [
            "15. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from Yahya al-Halabiy from Sulayman ibn Dawud from abu Basir who has said the following: “Once I said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘These are the words of Allah, the Majestic, the Glorious, “When it (the soul) reaches the throat. ... if you are truthful.’” (56: 82- 87) The Imam said, ‘When it reaches the throat then it sees its dwelling in paradise and says, “Return me to the worldly life so I can inform my family of what I have seen.’” It then is said, ‘There is no way for that to happen.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/200)"
        ],
        "index": 4303,
        "local_index": 16,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1052",
              "text": "سَهْلُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2119",
              "text": "غَيْرِ وَاحِدٍ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "سَهْلُ بْنُ زِيَادٍ عَنْ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِنَا قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:13:16",
        "text": [
          " قَالَ إِذَا رَأَيْتَ الْمَيِّتَ قَدْ شَخَصَ بِبَصَرِهِ وَ سَالَتْ عَيْنُهُ الْيُسْرَى وَ رَشَحَ جَبِينُهُ وَ تَقَلَّصَتْ شَفَتَاهُ وَ انْتَشَرَتْ مَنْخِرَاهُ فَأَيَّ شَيْ‏ءٍ رَأَيْتَ مِنْ ذَلِكَ فَحَسْبُكَ بِهَا .",
          "وَ فِي رِوَايَةٍ أُخْرَى وَ إِذَا ضَحِكَ أَيْضاً فَهُوَ مِنَ الدَّلَالَةِ قَالَ وَ إِذَا رَأَيْتَهُ قَدْ خَمَصَ وَجْهُهُ وَ سَالَتْ عَيْنُهُ الْيُمْنَى فَاعْلَمْ أَنَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl Bin Ziyad, from someone else from our companions who said, ",
            "‘He<sup>asws</sup> said: ‘When you see the decease to have fixed his gaze, and his left eye flows (with tears), and his forehead sweats, and his lips shrivel, and his nostrils expand, so whichever thing you see from that, it would suffice you with it (of his salvation)’. ",
            "And in another report, (He<sup>asws</sup> said): ‘And when he laughs as well, so it is from the evidence (of the salvation). And when you see his face to have frowned and his right eye to have flowed (with tears), so know that he . . .(perished)’."
          ],
          "en.sarwar": [
            "16. Sahl ibn Ziyad has narrated from more than one person of our people who has said the following: “He (the Imam) has said, ‘If you see a dying person’s eyes fixed upon something and tears come out of the left eye, his forehead sweats, his lips shrink and his nostrils expand, then whatever of such things you find with him is sufficient (proof of his salvation).’ In another Hadith it says, ‘And if he laughs also it then is proof.’ He also said, ‘If you find his face frowning and his right eye tear up (shed tears) then you should note that it is (otherwise).”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:3:13",
  "kind": "verse_list"
}