{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 15"
        },
        "path": "/books/al-kafi:3:3:15",
        "titles": {
          "ar": "باب تَعْجِيلِ الدَّفْنِ",
          "en": "Chapter 15 – Hastening the burial"
        }
      }
    ],
    "index": 587,
    "local_index": 15,
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:3:15",
    "titles": {
      "ar": "باب تَعْجِيلِ الدَّفْنِ",
      "en": "Chapter 15 – Hastening the burial"
    },
    "verse_count": 2,
    "verse_start_index": 4306,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/301)"
        ],
        "index": 4307,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:15:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َبُو عَلِيٍّ الْأَشْعَرِيُّ</span> عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ أَحْمَدَ بْنِ النَّضْرِ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَا مَعْشَرَ النَّاسِ لَا أُلْفِيَنَّ رَجُلًا مَاتَ لَهُ مَيِّتٌ فَانْتَظَرَ بِهِ الصُّبْحَ وَ لَا رَجُلًا مَاتَ لَهُ مَيِّتٌ نَهَاراً فَانْتَظَرَ بِهِ اللَّيْلَ لَا تَنْتَظِرُوا بِمَوْتَاكُمْ طُلُوعَ الشَّمْسِ وَ لَا غُرُوبَهَا عَجِّلُوا بِهِمْ إِلَى مَضَاجِعِهِمْ يَرْحَمُكُمُ اللَّهُ فَقَالَ النَّاسُ وَ أَنْتَ يَا رَسُولَ اللَّهِ يَرْحَمُكَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Salim, from Ahmad bin Al Nazar, from Amro Bin Shimr, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘O group of people! He should not delay, a man from whom there is a deceased, so that he waits with him for the morning, nor a man for whom there is a deceased by the day so he await with him for the night; and do not wait with your dead ones for the emergence of the sun, nor for its setting. Hasten with them to their sleeping places. May Allah<sup>azwj</sup> have Mercy on you’. So the people said, ‘And you<sup>saww</sup>, O Rasool-Allah<sup>saww</sup>, may Allah<sup>azwj</sup> have Mercy on you (as well)’."
          ],
          "en.sarwar": [
            "1. Abu Ali al-Ash’ariy has narrated from Muhammad ibn Salim from Ahmad ibn al-Nadr from ‘Amr ibn Shimr from Jabir who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said that the Messenger of Allah has said, ‘O people, a man in whose home a death takes place, should not wait for burial until morning or wait until night, if it takes place during the day. Do not wait for the burial of your dead people until sunrise or until sunset. Expedite their burial, may Allah grant you blessings, and people said, “May Allah grant you blessings, O Messenger of Allah. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/301)"
        ],
        "index": 4308,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:15:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنِ الْعَبَّاسِ بْنِ مَعْرُوفٍ عَنِ الْيَعْقُوبِيِّ عَنْ مُوسَى بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ مُيَسِّرٍ عَنْ هَارُونَ بْنِ الْجَهْمِ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِذَا مَاتَ الْمَيِّتُ أَوَّلَ النَّهَارِ فَلَا يَقِيلُ إِلَّا فِي قَبْرِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Al Abbas Bin Marouf, from Al Yaqouby, from Musa Bin Isa, from Muhammad Bin Muyassar, from Haroun Bin Al Jahm, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘When the dying one dies at the beginning of the day, he should not snooze except in his grave’ (spend night in the grave – so should be buried during the day)."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Muhammad ibn Ahmad from al-‘ Abbas ibn Ma’ruf from al-Ya‘qubiy from Musa ibn ‘Isa from Muhammad ibn Muyassir from Harun ibn al-Jahm from al-Sakuniy who has said the following: “Abu ’Abd Allah, ‘Alayhi al-Salam, has said that if one dies in the beginning of the day, he cannot have a nap anywhere other than his grave.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:3:15",
  "kind": "verse_list"
}