{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:3:3:18",
        "titles": {
          "ar": "باب غُسْلِ مَيِّتٍ",
          "en": "Chapter 18 – Washing the deceased"
        }
      }
    ],
    "index": 590,
    "local_index": 18,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 19"
        },
        "path": "/books/al-kafi:3:3:19",
        "titles": {
          "ar": "باب تَحْنِيطِ الْمَيِّتِ وَ تَكْفِينِهِ",
          "en": "Chapter 19 – Embalming the deceased and his enshrouding"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 17"
        },
        "path": "/books/al-kafi:3:3:17",
        "titles": {
          "ar": "باب الْحَائِضِ تُمَرِّضُ الْمَرِيضَ",
          "en": "Chapter 17 – The menstruating woman looking after the sick"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:3:18",
    "titles": {
      "ar": "باب غُسْلِ مَيِّتٍ",
      "en": "Chapter 18 – Washing the deceased"
    },
    "verse_count": 6,
    "verse_start_index": 4310,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/303)"
        ],
        "index": 4311,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/300",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/168",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:18:1",
        "text": [
          " إِذَا أَرَدْتَ غُسْلَ الْمَيِّتِ فَاجْعَلْ بَيْنَكَ وَ بَيْنَهُ ثَوْباً يَسْتُرُ عَنْكَ عَوْرَتَهُ إِمَّا قَمِيصٌ وَ إِمَّا غَيْرُهُ ثُمَّ تَبْدَأُ بِكَفَّيْهِ وَ رَأْسِهِ ثَلَاثَ مَرَّاتٍ بِالسِّدْرِ ثُمَّ سَائِرِ جَسَدِهِ وَ ابْدَأْ بِشِقِّهِ الْأَيْمَنِ ",
          "فَإِذَا أَرَدْتَ أَنْ تَغْسِلَ فَرْجَهُ فَخُذْ خِرْقَةً نَظِيفَةً فَلُفَّهَا عَلَى يَدِكَ الْيُسْرَى ثُمَّ أَدْخِلْ يَدَكَ مِنْ تَحْتِ الثَّوْبِ الَّذِي عَلَى فَرْجِ الْمَيِّتِ فَاغْسِلْهُ مِنْ غَيْرِ أَنْ تَرَى عَوْرَتَهُ فَإِذَا فَرَغْتَ مِنْ غُسْلِهِ بِالسِّدْرِ فَاغْسِلْهُ مَرَّةً أُخْرَى بِمَاءٍ وَ كَافُورٍ وَ شَيْ‏ءٍ مِنْ حَنُوطِهِ ثُمَّ اغْسِلْهُ بِمَاءٍ بَحْتٍ غَسْلَةً أُخْرَى حَتَّى إِذَا فَرَغْتَ مِنْ ثَلَاثٍ جَعَلْتَهُ فِي ثَوْبٍ ثُمَّ جَفَّفْتَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When you want to wash the deceased, so make a cloth to be between you and him to veil his private part from you, whether it is a shirt or something else. Then begin with his palm and his head (washing it) three times with the lotus (leaves), then the rest of his body, and beginning with the right hand side. ",
            "So when you intend to wash his private part, then take a clean rag and wrap it around your right hand, then enter your hand from beneath the cloth which is upon the private part of the deceased, and wash it from without seeing his nakedness. So when you are free from washing him with the lotus (leaves), then wash him again with water and camphor, and something from his embalming. Then wash him with pure water with another washing until when you are free from the three (washings), then make him to be in a cloth, then enshroud him’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “Abu ’Abd Allah, ‘Alayhi al-Salam, has said, ‘When you decide to give Ghusl (bath) to a dead body, you must keep a piece of cloth between yourself and the private parts of the dead body, like a shirt or similar. You should begin to wash the palms (hands) and the head of the dead body three times with water mixed with Sidr (berry leaves), then the rest of the body, first the right side. When you decide to wash the private parts, you must take a clean piece of fabric, wrap your left hand with it, then enter your hand under the piece of cloth with which it is covered, then wash the private parts of the dead body without seeing them. When you complete Ghusl (bath) with water mixed with Sidr (berry leaves), wash it a second time with water mixed with camphor and something with which Hunut is done; and thereafter wash the dead body with pure water. After completing all three Ghusl (baths) place the dead body on a piece of fabric and dry it up.’” (Ahadith 2-3 are best explained in the form of fatwa.) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/304)"
        ],
        "index": 4312,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/129",
              "text": "مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "النَّضْرِ بْنِ سُوَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/217",
              "text": "ابْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ وَ مُحَمَّدِ بْنِ خَالِدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:18:2",
        "text": [
          " سَأَلْتُهُ عَنْ غُسْلِ الْمَيِّتِ فَقَالَ اغْسِلْهُ بِمَاءٍ وَ سِدْرٍ ثُمَّ اغْسِلْهُ عَلَى أَثَرِ ذَلِكَ غَسْلَةً أُخْرَى بِمَاءٍ وَ كَافُورٍ وَ ذَرِيرَةٍ إِنْ كَانَتْ وَ اغْسِلْهُ الثَّالِثَةَ بِمَاءٍ قَرَاحٍ ",
          "قُلْتُ ثَلَاثَ غَسَلَاتٍ لِجَسَدِهِ كُلِّهِ قَالَ نَعَمْ قُلْتُ يَكُونُ عَلَيْهِ ثَوْبٌ إِذَا غُسِّلَ قَالَ إِنِ اسْتَطَعْتَ أَنْ يَكُونَ عَلَيْهِ قَمِيصٌ فَغَسِّلْهُ مِنْ تَحْتِهِ وَ قَالَ أُحِبُّ لِمَنْ غَسَّلَ الْمَيِّتَ أَنْ يَلُفَّ عَلَى يَدِهِ الْخِرْقَةَ حِينَ يُغَسِّلُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed and Muhammad Bin Khalid, from Al Naar Bin Suweyd, from Ibn Muskan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about washing the deceased, so he<sup>asws</sup> said: ‘Wash him with water and lotus (leaves). Then wash him upon the footsteps of that with another washing with water and camphor and fragrant powder if there was, and wash him for the third washing with clear water’. ",
            "I said, ‘Three washings for his body, all of it?’ He<sup>asws</sup> said: ‘Yes’’. I said, ‘There would happen to be a cloth upon him when he is washed?’ He<sup>asws</sup> said: ‘If there is capacity that there happens to be a shirt upon him, so wash him from beneath it’. And he<sup>asws</sup> said: ‘I would love it for the one who wash the deceased if he wraps a rag upon his hand when he washes him’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Al-Husayn ibn Sa’id and Muhammad ibn Khalid from al- Nadr ibn Suwayd from ibn Muskan who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about Ghusl (bath) for a dead body. He (the Imam) said, ‘You must give it a Ghusl (bath) with water mixed with Sidr, (Lotus tree leaves), thereafter one more Ghusl (bath) with water mixed with camphor and Dharirah (a certain herb or incense from India), if available, then you must give it one Ghusl (bath) with pure water.’ I (the narrator) then asked, ‘Is it necessary to give three Ghusl (baths) to all of the body?’ He (the Imam) said, ‘Yes, that is correct.’ I (the narrator) then asked, ‘Is it necessary to keep a piece of cloth on it during Ghusl (bath)?’ He (the Imam) said, ‘Yes, it is necessary; if possible, there must be a shirt on it so you can give it Ghusl (bath) under the shirt. He (the Imam) said, ‘I would like that one who gives Ghusl (bath) wrap his or her hand with a piece of fabric when giving Ghusl (bath) to a dead body.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/305)"
        ],
        "index": 4313,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/207",
              "text": "عَلِيِّ بْنِ رِئَابٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/168",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنِ الْحَلَبِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:18:3",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يُغَسَّلُ الْمَيِّتُ ثَلَاثَ غَسَلَاتٍ مَرَّةً بِالسِّدْرِ وَ مَرَّةً بِالْمَاءِ يُطْرَحُ فِيهِ الْكَافُورُ وَ مَرَّةً أُخْرَى بِالْمَاءِ الْقَرَاحِ ثُمَّ يُكَفَّنُ ",
          "وَ قَالَ إِنَّ أَبِي كَتَبَ فِي وَصِيَّتِهِ أَنْ أُكَفِّنَهُ فِي ثَلَاثَةِ أَثْوَابٍ أَحَدُهَا رِدَاءٌ لَهُ حِبَرَةٌ وَ ثَوْبٌ آخَرُ وَ قَمِيصٌ قُلْتُ وَ لِمَ كَتَبَ هَذَا قَالَ مَخَافَةَ قَوْلِ النَّاسِ وَ عَصَّبْنَاهُ بَعْدَ ذَلِكَ بِعِمَامَةٍ وَ شَقَقْنَا لَهُ الْأَرْضَ مِنْ أَجْلِ أَنَّهُ كَانَ بَادِناً وَ أَمَرَنِي أَنْ أَرْفَعَ الْقَبْرَ مِنَ الْأَرْضِ أَرْبَعَ أَصَابِعَ مُفَرَّجَاتٍ وَ ذَكَرَ أَنَّ رَشَّ الْقَبْرِ بِالْمَاءِ حَسَنٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Al Hassan Bin Mahboub, from Ali Bin Raib, from Al Halby who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The deceased should be washed with three washings – once with the lotus (leaves), and once with the pure water where is camphor, and once more with clear water. Then he should be enshrouded’. ",
            "And he<sup>asws</sup> said: ‘My<sup>asws</sup> father<sup>asws</sup> wrote in his<sup>asws</sup> bequest that I<sup>asws</sup> should enshroud him<sup>asws</sup> in three clothes – one of them being a cloak of his<sup>asws</sup> as a veil, and another cloth, and a shirt’. I said, ‘And why did he<sup>asws</sup> write this?’ He<sup>asws</sup> said: ‘Fearing the words of the people, and we placed a turban on him<sup>asws</sup> after that, and we<sup>asws</sup> cleaved the ground for him for the reason that he<sup>asws</sup> was hefty, and had instructed me<sup>asws</sup> that I<sup>asws</sup> raise the grave from the ground by four thin fingers, and he<sup>asws</sup> mentioned that sprinkling the grave with the water is good’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from al-Hassan ibn Mahbub from ibn Ri’ab from al-Halabiy who has narrated the following: “‘Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that a dead body must be given three Ghusl (baths). One Ghusl (bath) with water mixed with Lotus tree leaves, one Ghusl (bath) with water mixed with camphor, and one Ghusl (bath) with pure water. Thereafter, the dead body must be wrapped in the shroud. He (the Imam) said, ‘My father made a will that required me to shroud him with three pieces of cloth. One piece was a gown which was made in Hibrah, one more piece of cloth, and a shirt.’ I then asked, ‘Why did he say it in his will?’ He (the Imam) said that he (the Imam) did it so that people will have no objection. We then prepared a turban for him. We then dug the soil like a cut in the earth for him because his body was of a large frame. He had commanded me to raise the surface of his grave from the ground by about four inches.’ He (the Imam) mentioned that it is good to sprinkle water on the grave.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/305)"
        ],
        "index": 4314,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/31",
              "text": "مُحَمَّدِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1064",
              "text": "عَبْدِ اللَّهِ الْكَاهِلِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَنْهُ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَبْدِ اللَّهِ الْكَاهِلِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:18:4",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ غُسْلِ الْمَيِّتِ فَقَالَ اسْتَقْبِلْ بِبَاطِنِ قَدَمَيْهِ الْقِبْلَةَ حَتَّى يَكُونَ وَجْهُهُ مُسْتَقْبِلَ الْقِبْلَةِ ثُمَّ تُلَيِّنُ مَفَاصِلَهُ فَإِنِ امْتَنَعَتْ عَلَيْكَ فَدَعْهَا ثُمَّ ابْدَأْ بِفَرْجِهِ بِمَاءِ السِّدْرِ وَ الْحُرُضِ فَاغْسِلْهُ ثَلَاثَ غَسَلَاتٍ وَ أَكْثِرْ مِنَ الْمَاءِ وَ امْسَحْ بَطْنَهُ مَسْحاً رَفِيقاً",
          "ثُمَّ تَحَوَّلْ إِلَى رَأْسِهِ وَ ابْدَأْ بِشِقِّهِ الْأَيْمَنِ مِنْ لِحْيَتِهِ وَ رَأْسِهِ ثُمَّ ثَنِّ بِشِقِّهِ الْأَيْسَرِ مِنْ رَأْسِهِ وَ لِحْيَتِهِ وَ وَجْهِهِ وَ اغْسِلْهُ بِرِفْقٍ وَ إِيَّاكَ وَ الْعُنْفَ وَ اغْسِلْهُ غَسْلًا نَاعِماً ثُمَّ أَضْجِعْهُ عَلَى شِقِّهِ الْأَيْسَرِ لِيَبْدُوَ لَكَ الْأَيْمَنُ ثُمَّ اغْسِلْهُ مِنْ قَرْنِهِ إِلَى قَدَمَيْهِ وَ امْسَحْ يَدَكَ عَلَى ظَهْرِهِ وَ بَطْنِهِ ثَلَاثَ غَسَلَاتٍ ثُمَّ رُدَّهُ إِلَى جَنْبِهِ الْأَيْمَنِ حَتَّى يَبْدُوَ لَكَ الْأَيْسَرُ فَاغْسِلْهُ مَا بَيْنَ قَرْنِهِ إِلَى قَدَمَيْهِ وَ امْسَحْ يَدَكَ عَلَى ظَهْرِهِ وَ بَطْنِهِ ثَلَاثَ غَسَلَاتٍ",
          "ثُمَّ رُدَّهُ إِلَى قَفَاهُ فَابْدَأْ بِفَرْجِهِ بِمَاءِ الْكَافُورِ فَاصْنَعْ كَمَا صَنَعْتَ أَوَّلَ مَرَّةٍ اغْسِلْهُ ثَلَاثَ غَسَلَاتٍ بِمَاءِ الْكَافُورِ وَ الْحُرُضِ وَ امْسَحْ يَدَكَ عَلَى بَطْنِهِ مَسْحاً رَفِيقاً ثُمَّ تَحَوَّلْ إِلَى رَأْسِهِ فَاصْنَعْ كَمَا صَنَعْتَ أَوَّلًا بِلِحْيَتِهِ مِنْ جَانِبَيْهِ كِلَيْهِمَا وَ رَأْسِهِ وَ وَجْهِهِ بِمَاءِ الْكَافُورِ ثَلَاثَ غَسَلَاتٍ",
          "ثُمَّ رُدَّهُ إِلَى الْجَانِبِ الْأَيْسَرِ حَتَّى يَبْدُوَ لَكَ الْأَيْمَنُ فَاغْسِلْهُ مِنْ قَرْنِهِ إِلَى قَدَمَيْهِ ثَلَاثَ غَسَلَاتٍ ثُمَّ رُدَّهُ إِلَى الْجَانِبِ الْأَيْمَنِ حَتَّى يَبْدُوَ لَكَ الْأَيْسَرُ فَاغْسِلْهُ مِنْ قَرْنِهِ إِلَى قَدَمَيْهِ ثَلَاثَ غَسَلَاتٍ وَ أَدْخِلْ يَدَكَ تَحْتَ مَنْكِبَيْهِ وَ ذِرَاعَيْهِ وَ يَكُونُ الذِّرَاعُ وَ الْكَفُّ مَعَ جَنْبِهِ طَاهِرَةً كُلَّمَا غَسَلْتَ شَيْئاً مِنْهُ أَدْخَلْتَ يَدَكَ تَحْتَ مَنْكِبَيْهِ وَ فِي بَاطِنِ ذِرَاعَيْهِ",
          "ثُمَّ رُدَّهُ إِلَى ظَهْرِهِ ثُمَّ اغْسِلْهُ بِمَاءٍ قَرَاحٍ كَمَا صَنَعْتَ أَوَّلًا تَبْدَأُ بِالْفَرْجِ ثُمَّ تَحَوَّلْ إِلَى الرَّأْسِ وَ اللِّحْيَةِ وَ الْوَجْهِ حَتَّى تَصْنَعَ كَمَا صَنَعْتَ أَوَّلًا بِمَاءٍ قَرَاحٍ ثُمَّ أَزِّرْهُ بِالْخِرْقَةِ وَ يَكُونُ تَحْتَهَا الْقُطْنُ تُذْفِرُهُ بِهِ إِذْفَاراً قُطْناً كَثِيراً ثُمَّ تَشُدُّ فَخِذَيْهِ عَلَى الْقُطْنِ بِالْخِرْقَةِ شَدّاً شَدِيداً حَتَّى لَا تَخَافَ أَنْ يَظْهَرَ شَيْ‏ءٌ وَ إِيَّاكَ أَنْ تُقْعِدَهُ أَوْ تَغْمِزَ بَطْنَهُ وَ إِيَّاكَ أَنْ تَحْشُوَ فِي مَسَامِعِهِ شَيْئاً فَإِنْ خِفْتَ أَنْ يَظْهَرَ مِنَ الْمَنْخِرَيْنِ شَيْ‏ءٌ فَلَا عَلَيْكَ أَنْ تُصَيِّرَ ثَمَّ قُطْناً وَ إِنْ لَمْ تَخَفْ فَلَا تَجْعَلْ فِيهِ شَيْئاً وَ لَا تُخَلِّلْ أَظَافِيرَهُ وَ كَذَلِكَ غُسْلُ الْمَرْأَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Muhammad Bin Sinan, from Abullah Al Kahily who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about washing the deceased, so he<sup>asws</sup> said: ‘Face the undersoles of his feet towards the Qiblah until his face happens to be facing the Qiblah. Then soften the joints, and if it is not possible for you, then leave it. Then begin with his private part with water of lotus (leaves) and potash, so wash him with three washings and frequent from the water, and wipe his body with gentle wiping. ",
            "Then turn around to his head and begin with his right side from his beard and his head. Then deal with his left side from his head, and his beard, and his face, and wash him with gentleness, and beware of the roughness and wash him with a gentle washing. Then lie him down upon his left side for the right side to be exposed to you. Then wash him from his head to his feed and wipe your hand upon his back and his belly with three washings. Then return him to his right side until the left side is exposed to you, so wash it what is between his head up to his feet, and wipe your hand upon his back and his belly with three washings.",
            "Then return him to his back and begin with his private parts with water (with) camphor and deal with him just as you dealt the first times, washing him with three washings – with the water with camphor and the fragrant powder, and wipe your hand upon his belly with a gentle wiping. Then turn towards his head and deal with it just as you dealt firstly, with his beard from both its sides, and his head, and his face, with the water with camphor with three washings. ",
            "Then return him to the left side until the right side is exposed to you, so wash him from his head up to his feet with three washings. Then return him to the right side until the left side is exposed to you, so wash him from his head up to his feet with three washings, and enter your hand under his shoulders and his forearms, and make the forearms, and the palms, along with his side, to be clean. Every time you wash anything from it, enter your hand under his shoulder and in the inside of his forearms.",
            "Then return him to his back, then wash him with clear water just as you did at first, beginning with the private part. Then turn towards the head and the beard and the face until you do just as you did firstly with clear water. Then put on a loin cloth on him with a cloth and place the cotton to be under it to pad him with a lot of cotton. Then tighten his thighs upon the cotton with the cloth with an intense tightening until you do not fear that anything might become apparent (from his private part). And beware of sitting him up or pressing his belly, and beware of placing anything in his ears. So if you were to fear that something might become apparent from his nostrils, so it is not upon you that you stuff is with cotton, and if you do not fear such, so do not make anything to be in it, and do not clean (under) his nails. Similar to that is the washing of the woman’."
          ],
          "en.sarwar": [
            "4. It is a narration from him (narrator of previous Hadith) by Muhammad ibn Sinan from ‘Abd Allah al-Kahiliy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about Ghusl (bath) for a dead body. He (the Imam) said, Turn the bottom of the sole of the dead body’s feet toward al-Qiblah (al-Ka‘bah) which makes the dead body facing al-Qiblah (al-Ka‘bah). Thereafter, soften the joints of the bones of the dead body if possible; if not then leave them alone. First wash the private parts with water mixed with Sidr (berry leaves) and al-Huruz. (saltwort), You must give it three Ghusl (baths). Use plenty of water. Rub the belly of the dead body gently. Turn to the head. Begin with the right side of the beard and head, then the left side of the head, beard and face gently and avoid roughing it up. Wash with softness. Then make it lie down on the left side, so the right side is exposed to you. Wash it from head to the toes and rub gently the back and belly, wash it three times; then turn it on its right side to expose the left side to wash it from the head to the toes; rub its back and belly gently and wash it three times. Reach out to its underarms, arms and shoulder with your hand and make its side clean. Whenever you wash, reach with your hand under his shoulders and the inside of his arms. Thereafter make the dead body lie down on its back; then begin with the private parts with water mixed with camphor and do as you did before. Wash it three times with water mixed with camphor and al-Huruz (saltwort) and rub the belly of the dead body gently. You must then turn to the head and face and do as you did before on both sides, the head and face with water mixed with camphor three times. You must then turn it on its left side, so its right side is exposed. You must then wash it from head to the toes three times. Thereafter you must turn it on its right side to expose its left side. You must then wash it from its head to its toes three times, and push your hand under the shoulder bones of the dead body and arms. The arms and hands must be cleansed along with the sides. Whenever you wash anything, push your hand under the shoulder bones of the dead body and inside of the arms. You must then turn it on its back. You must then wash it with pure water as you did before. You must begin with the private parts, then turn to the head, beard and face to do what you did before with pure water. You must then wrap it with a piece of fabric from the waist down with a great deal of cotton underneath. You must then tie the thighs with a piece of fabric tightly, so nothing can come out. You must not make the dead body sit up or press its belly. You must not fill up the ears with something but if you are afraid of something coming out of the nostrils, you may fill it with cotton; but if you are not afraid do not fill it up with anything. Do not clean underneath the nails of the dead body: and so also is Ghusl (bath) for women.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/307)"
        ],
        "index": 4315,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1236",
              "text": "رِجَالِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2466",
              "text": "يُونُسَ عَنْهُمْ ( عليهم السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ رِجَالِهِ عَنْ يُونُسَ عَنْهُمْ ( عليهم السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:18:5",
        "text": [
          " إِذَا أَرَدْتَ غُسْلَ الْمَيِّتِ فَضَعْهُ عَلَى الْمُغْتَسَلِ مُسْتَقْبِلَ الْقِبْلَةِ فَإِنْ كَانَ عَلَيْهِ قَمِيصٌ فَأَخْرِجْ يَدَهُ مِنَ الْقَمِيصِ وَ اجْمَعْ قَمِيصَهُ عَلَى عَوْرَتِهِ وَ ارْفَعْهُ مِنْ رِجْلَيْهِ إِلَى فَوْقِ الرُّكْبَةِ وَ إِنْ لَمْ يَكُنْ عَلَيْهِ قَمِيصٌ فَأَلْقِ عَلَى عَوْرَتِهِ خِرْقَةً وَ اعْمِدْ إِلَى السِّدْرِ فَصَيِّرْهُ فِي طَسْتٍ وَ صُبَّ عَلَيْهِ الْمَاءَ وَ اضْرِبْهُ بِيَدِكَ حَتَّى تَرْتَفِعَ رَغْوَتُهُ وَ اعْزِلِ الرَّغْوَةَ فِي شَيْ‏ءٍ وَ صُبَّ الْآخَرَ فِي الْإِجَّانَةِ الَّتِي فِيهَا الْمَاءُ",
          "ثُمَّ اغْسِلْ يَدَيْهِ ثَلَاثَ مَرَّاتٍ كَمَا يَغْتَسِلُ الْإِنْسَانُ مِنَ الْجَنَابَةِ إِلَى نِصْفِ الذِّرَاعِ ثُمَّ اغْسِلْ فَرْجَهُ وَ نَقِّهِ ثُمَّ اغْسِلْ رَأْسَهُ بِالرَّغْوَةِ وَ بَالِغْ فِي ذَلِكَ وَ اجْتَهِدْ أَنْ لَا يَدْخُلَ الْمَاءُ مَنْخِرَيْهِ وَ مَسَامِعَهُ ثُمَّ أَضْجِعْهُ عَلَى جَانِبِهِ الْأَيْسَرِ وَ صُبَّ الْمَاءَ مِنْ نِصْفِ رَأْسِهِ إِلَى قَدَمَيْهِ ثَلَاثَ مَرَّاتٍ وَ ادْلُكْ بَدَنَهُ دَلْكاً رَفِيقاً وَ كَذَلِكَ ظَهْرَهُ وَ بَطْنَهُ ثُمَّ أَضْجِعْهُ عَلَى جَانِبِهِ الْأَيْمَنِ وَ افْعَلْ بِهِ مِثْلَ ذَلِكَ",
          "ثُمَّ صُبَّ ذَلِكَ الْمَاءَ مِنَ الْإِجَّانَةِ وَ اغْسِلِ الْإِجَّانَةَ بِمَاءٍ قَرَاحٍ وَ اغْسِلْ يَدَيْكَ إِلَى الْمِرْفَقَيْنِ ثُمَّ صُبَّ الْمَاءَ فِي الْآنِيَةِ وَ أَلْقِ فِيهِ حَبَّاتِ كَافُورٍ وَ افْعَلْ بِهِ كَمَا فَعَلْتَ فِي الْمَرَّةِ الْأُولَى ابْدَأْ بِيَدَيْهِ ثُمَّ بِفَرْجِهِ وَ امْسَحْ بَطْنَهُ مَسْحاً رَفِيقاً فَإِنْ خَرَجَ شَيْ‏ءٌ فَأَنْقِهِ ثُمَّ اغْسِلْ رَأْسَهُ ثُمَّ أَضْجِعْهُ عَلَى جَنْبِهِ الْأَيْسَرِ وَ اغْسِلْ جَنْبَهُ الْأَيْمَنَ وَ ظَهْرَهُ وَ بَطْنَهُ ثُمَّ أَضْجِعْهُ عَلَى جَنْبِهِ الْأَيْمَنِ وَ اغْسِلْ جَنْبَهُ الْأَيْسَرَ كَمَا فَعَلْتَ أَوَّلَ مَرَّةٍ ",
          "ثُمَّ اغْسِلْ يَدَيْكَ إِلَى الْمِرْفَقَيْنِ وَ الْآنِيَةَ وَ صُبَّ فِيهَا الْمَاءَ الْقَرَاحَ وَ اغْسِلْهُ بِمَاءٍ قَرَاحٍ كَمَا غَسَلْتَهُ فِي الْمَرَّتَيْنِ الْأَوَّلَتَيْنِ ثُمَّ نَشِّفْهُ بِثَوْبٍ طَاهِرٍ وَ اعْمِدْ إِلَى قُطْنٍ فَذُرَّ عَلَيْهِ شَيْئاً مِنْ حَنُوطٍ وَ ضَعْهُ عَلَى فَرْجِهِ قُبُلٍ وَ دُبُرٍ وَ احْشُ الْقُطْنَ فِي دُبُرِهِ لِئَلَّا يَخْرُجَ مِنْهُ شَيْ‏ءٌ وَ خُذْ خِرْقَةً طَوِيلَةً عَرْضُهَا شِبْرٌ فَشُدَّهَا مِنْ حَقْوَيْهِ وَ ضُمَّ فَخِذَيْهِ ضَمّاً شَدِيداً وَ لُفَّهَا فِي فَخِذَيْهِ ",
          "ثُمَّ أَخْرِجْ رَأْسَهَا مِنْ تَحْتِ رِجْلَيْهِ إِلَى جَانِبِ الْأَيْمَنِ وَ أَغْرِزْهَا فِي الْمَوْضِعِ الَّذِي لَفَفْتَ فِيهِ الْخِرْقَةَ وَ تَكُونُ الْخِرْقَةُ طَوِيلَةً تَلُفُّ فَخِذَيْهِ مِنْ حَقْوَيْهِ إِلَى رُكْبَتَيْهِ لَفّاً شَدِيداً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from his men, from Yunus, ",
            "(It has been narrated) from them<sup>asws</sup> having said: ‘When you want to wash the deceased, so place him upon the washing place facing the Qiblah. So if there was a shirt upon him, then extract his hand from the shirt, and gather his shirt to be upon his private part, and raise it from his legs up to above the knees. And if there does not happen to be a shirt upon him, so cast a cloth to be upon his private part and pour water on to the chest, and make some of it to be in a utensil and pour the water upon it, and pat it with your hand until its foam raises and isolate the foam into something and pour the latter into the bucket in which is the water. ",
            "Then wash his hands three times just as the person would do so from the sexual impurity, up to the half forearm. Then wash his private part and clean it. Then wash his head with the foam and be thorough in that, and strive that the water should not enter his nostrils and his hearing. Then turn him upon his left side and pour the water from half of his head to his feet, three times, and rub his body gently, and similar to that his back and his belly. Then turn him upon his right side and do with him similar to that. ",
            "The pour out that water from the bucket and wash the bucket with clear water and wash your hands (up) to the two elbows. Then pour the water into a utensil and throw some seeds of camphor into it and do with him just as you did in the first time, beginning with his hands, then with his private parts, and wipe his belly with a gentle wiping. So if something were to come out, so clean it. Then wash his head. Then turn him upon his left side and wash his right side, and his back and his belly. Then turn him upon his right side and wash his left side just as you did the first time.",
            "Then wash your hands up to the two elbows and the bucket, and pour clear water into it and wash him with clear water just as you washed him the two times beforehand. Then wipe him with a clean cloth and deliberate to cotton (pads), and scatter something from the camphor upon him, and place it upon his private part and behind, and tamp the cotton in his behind, lest something might come out from him, and take a long cloth of a palms width, so tighten it from his loins and his thighs with an intense tightening, and wrap it in his thighs. ",
            "Then bring out its top end from under his legs up to the right hand side, and push it into the place which the cloth had been wrapped it, and the cloth should happen to be long enveloping his thighs from his loins down to his two knees with a tight enveloping’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from his people from Yunus from ’A’immah, ‘Alayhim al-Salam, who have said the following: “When you decide to give Ghusl (bath) to a dead body, place it on the platform for Ghusl (bath), facing al-Qiblah (al-Ka‘bah). Remove his hands from the shirt if any, and pull it down over the private parts. Pull it up above his knees. If shirt is not there, cover his private parts with a piece of fabric. Find Sidr (berry leaves). Place them in a pail and pour water on them. Stir with your hand until foam rises. Remove the foam in something and pour the rest in a container with water. Wash his hands three times, half way up to the elbows, just as one washes them because of sexual relation. Then wash his private parts and clean them. Then wash his head with foam thoroughly and do not allow water to enter his nostrils or ears. Then place him on the platform for Ghusl (bath) on his left side, and pour water on one half of his head down to his toes three times. Rub his body gently as well as his back and belly. Then place him on his right side on the platform for Ghusl (bath). Do as you did with the left side. You must then throw away the water from the water container. You must wash it with pure water and wash your hands up to your elbows. You must then pour water in the pail and place a piece of camphor in it and do as you did before with Sidr (berry leaves). Begin with his hands, then his private parts, then rub his belly gently, and if something comes out, clean it. Then wash his head. Then place him on his left side and wash his right side, his back and belly. Then place him on his right side and wash his left side as you did before. Then wash your hands up to the elbows and the water pail with pure water. Give him Ghusl (bath) with pure water just as you did in the other two Ghusl (bath). Then dry him up with a piece of clean cloth. Then find cotton, spread a certain amount of Hunut (camphor) on it and fill it in his private parts front and back. Fill his buttocks with cotton so that nothing can come out. Then find a long piece of fabric about a foot wide and tie it tightly around him from waist down to his knees by sending one end underneath to the right side, wrapping it around tightly, and push its end underneath the end where it had started tight.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/308)"
        ],
        "index": 4316,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/612",
              "text": "الْعَمْرَكِيِّ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/613",
              "text": "عَلِيِّ بْنِ جَعْفَرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1223",
              "text": "أَخِيهِ أَبِي الْحَسَنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنِ الْعَمْرَكِيِّ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَخِيهِ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:18:6",
        "text": [
          " سَأَلْتُهُ عَنِ الْمَيِّتِ هَلْ يُغَسَّلُ فِي الْفَضَاءِ قَالَ لَا بَأْسَ وَ إِنْ سُتِرَ بِسِتْرٍ فَهُوَ أَحَبُّ إِلَيَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Al Amraky Bin Ali, ",
            "(It has been narrated) from Ali son of Ja’far<sup>asws</sup>, from his brother<sup>asws</sup> Abu Al-Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the deceased, ‘Can he be washed in the open?’ He<sup>asws</sup> said: ‘There is no problem, and if he were to be veiled with a curtain, so it would be more beloved to me<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from al-‘Amrakiy from Ali ibn Ali ibn Ja‘far from his brother, abu al-Hassan, ‘Alayhi al-Salam, who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, Is it permissible to give Ghusl (bath) to a dead body in the open? He (the Imam) said, ‘It is not harmful, but I prefer that it is covered with a covering.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:3:18",
  "kind": "verse_list"
}