{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 2"
        },
        "path": "/books/al-kafi:3:3:2",
        "titles": {
          "ar": "باب ثَوَابِ الْمَرَضِ",
          "en": "Chapter 2 – Rewards of the sick one"
        }
      }
    ],
    "index": 574,
    "local_index": 2,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:3:3:3",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب آخَرُ مِنْهُ</span>",
          "en": "Chapter 3 – Another chapter from it"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 1"
        },
        "path": "/books/al-kafi:3:3:1",
        "titles": {
          "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>اب عِلَلِ الْمَوْتِ</span> وَ أَنَّ الْمُؤْمِنَ يَمُوتُ بِكُلِّ مِيتَةٍ",
          "en": "Chapter 1 – Causes of the death, and that the Believer dies with every (type of) death"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:3:2",
    "titles": {
      "ar": "باب ثَوَابِ الْمَرَضِ",
      "en": "Chapter 2 – Rewards of the sick one"
    },
    "verse_count": 10,
    "verse_start_index": 4229,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/262)"
        ],
        "index": 4230,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:2:1",
        "text": [
          " إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) رَفَعَ رَأْسَهُ إِلَى السَّمَاءِ فَتَبَسَّمَ فَقِيلَ لَهُ يَا رَسُولَ اللَّهِ رَأَيْنَاكَ رَفَعْتَ رَأْسَكَ إِلَى السَّمَاءِ فَتَبَسَّمْتَ قَالَ نَعَمْ عَجِبْتُ لِمَلَكَيْنِ هَبَطَا مِنَ السَّمَاءِ إِلَى الْأَرْضِ يَلْتَمِسَانِ عَبْداً مُؤْمِناً صَالِحاً فِي مُصَلًّى كَانَ يُصَلِّي فِيهِ لِيَكْتُبَا لَهُ عَمَلَهُ فِي يَوْمِهِ وَ لَيْلَتِهِ فَلَمْ يَجِدَاهُ فِي مُصَلَّاهُ فَعَرَجَا إِلَى السَّمَاءِ ",
          "فَقَالَا رَبَّنَا عَبْدُكَ الْمُؤْمِنُ فُلَانٌ الْتَمَسْنَاهُ فِي مُصَلَّاهُ لِنَكْتُبَ لَهُ عَمَلَهُ لِيَوْمِهِ وَ لَيْلَتِهِ فَلَمْ نُصِبْهُ فَوَجَدْنَاهُ فِي حِبَالِكَ فَقَالَ اللَّهُ عَزَّ وَ جَلَّ اكْتُبَا لِعَبْدِي مِثْلَ مَا كَانَ يَعْمَلُهُ فِي صِحَّتِهِ مِنَ الْخَيْرِ فِي يَوْمِهِ وَ لَيْلَتِهِ مَا دَامَ فِي حِبَالِي فَإِنَّ عَلَيَّ أَنْ أَكْتُبَ لَهُ أَجْرَ مَا كَانَ يَعْمَلُهُ فِي صِحَّتِهِ إِذَا حَبَسْتُهُ عَنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Mahboub, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> raised his<sup>saww</sup> head towards the sky and he<sup>saww</sup> smiled. So it was said to him<sup>saww</sup>, ‘O Rasool-Allah<sup>saww</sup>! We saw you<sup>saww</sup> raising your<sup>saww</sup> head towards the sky’. So he<sup>saww</sup> smiled and said: ‘Yes. I<sup>saww</sup> was astounded at two Angels who had descended from the sky to the earth, seeking a righteous believing servant in a Prayer mat which he used to pray <span class=\"iTxt\">Salaat</span> in, in order to record his deeds for him for his day and his night. But they did not find him to be on his Prayer mat. ",
            "So they ascended to the sky and said: ‘Our Lord<sup>azwj</sup>! Your<sup>azwj</sup> believing servant, so and so, we sought him on his prayer-mat in order for us to record his deeds for him for his day and his night, but we did not come across him, and we found him in Your<sup>azwj</sup> ropes (i.e. tied down by illness)’. So Allah<sup>azwj</sup> Mighty and Majestic Said: “Write down for My<sup>azwj</sup> servant the likes of what he would have doing during his well-being, from the goodness during his day and his night, for as long as he is in My<sup>azwj</sup> ropes (Illness from Me<sup>azwj</sup>), for it is upon Me<sup>azwj</sup> that I<sup>azwj</sup> Write for him a Recompense of what he would have done during his well-being when I<sup>azwj</sup> Reckon from him”’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from ibn Mahbub from ‘Abd Allah ibn Sinan who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that once the Messenger of Allah raised his head to the heaven and smiled. He was asked, ‘O Messenger of Allah, we saw you. Why did you raise your head to the heaven and smile?’ He then replied, ‘I was amazed when I saw two angels come down from the heaven looking for a believing, virtuous servant (of Allah) in the place he performs his prayers, so they can record his deeds of that day and night but they could not find him there. They then ascended to the heaven saying, “Lord, we looked for Your so and so believing servant in the place of his prayer to record the deeds of his day and night, but could not find him there. However, we found him (tied down) with Your ropes.’” Allah, the Majestic, the Glorious, said, “Write down for My servant (a reward) equal to that of his good deeds that he normally did in his day and night when free of (illness due to) My ropes. Do so as long as he is tied down with My ropes; I must write down for him when tied down with My ropes (suffering from illness) a reward equal to the reward of the good deeds that he did when in good health.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/263)"
        ],
        "index": 4231,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/11",
              "text": "عَمْرِو بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1142",
              "text": "الْمُفَضَّلِ بْنِ صَالِحٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/181",
              "text": "جَابِرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنِ الْمُفَضَّلِ بْنِ صَالِحٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:2:2",
        "text": [
          " قَالَ النَّبِيُّ ( صلى الله عليه وآله ) إِنَّ الْمُسْلِمَ إِذَا غَلَبَهُ ضَعْفُ الْكِبَرِ أَمَرَ اللَّهُ عَزَّ وَ جَلَّ الْمَلَكَ أَنْ يَكْتُبَ لَهُ فِي حَالِهِ تِلْكَ مِثْلَ مَا كَانَ يَعْمَلُ وَ هُوَ شَابٌّ نَشِيطٌ صَحِيحٌ وَ مِثْلَ ذَلِكَ إِذَا مَرِضَ وَكَّلَ اللَّهُ بِهِ مَلَكاً يَكْتُبُ لَهُ فِي سُقْمِهِ مَا كَانَ يَعْمَلُ مِنَ الْخَيْرِ فِي صِحَّتِهِ حَتَّى يَرْفَعَهُ اللَّهُ وَ يَقْبِضَهُ",
          "وَ كَذَلِكَ الْكَافِرُ إِذَا اشْتَغَلَ بِسُقْمٍ فِي جَسَدِهِ كَتَبَ اللَّهُ لَهُ مَا كَانَ يَعْمَلُ مِنَ الشَّرِّ فِي صِحَّتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Amro Bin Usman, from Al Mufazzal Bin Salih, ",
            "(It has been narrated) from Jabir, from Abu Ja’far<sup>asws</sup> having said: ‘The Prophet<sup>saww</sup> said: ‘When the Muslim is overcome by weakness of the old age, Allah<sup>azwj</sup> Mighty and Majestic Commands the Angel that he should record for him during that state of his, similar to what he would have done had he been young, energetic, healthy. And similar to that is when he is sick, Allah<sup>azwj</sup> Allocates two Angels with him, to write for him during his sickness what he would have done from the goodness during his good health, until Allah<sup>azwj</sup> Raises him, and Captures him (death). ",
            "And similar to that is the Infidel, when he labours with sickness in his body, Allah<sup>azwj</sup> Writes down for him what he would have done, from the evil (deeds), during his well-being’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ‘Amr ibn ‘Uthman from al-Mufaddal ibn Salih from Jabir who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said that the Holy Prophet has said, ‘When a Muslim is weakened due to old age, Allah, the Majestic, the Glorious, commands an angel to write down for him of good deeds equal to what he did when young, vigorous and in good health. Similarly, when he becomes ill, Allah commands an angel to write down for him during his illness of good deeds equal to what he performed in good health up to the time Allah raises him and takes him (away) from this life. In the case of an unbeliever, in his illness Allah writes down against him of evil deeds equal to what he would commit when in good health.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/263)"
        ],
        "index": 4232,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/201",
              "text": "عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:2:3",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَقُولُ اللَّهُ عَزَّ وَ جَلَّ لِلْمَلَكِ الْمُوَكَّلِ بِالْمُؤْمِنِ إِذَا مَرِضَ اكْتُبْ لَهُ مَا كُنْتَ تَكْتُبُ لَهُ فِي صِحَّتِهِ فَإِنِّي أَنَا الَّذِي صَيَّرْتُهُ فِي حِبَالِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic is Saying to the Angel Allocated with the Believer when he is sick: “Write for him what you would have written for him during his good health, for it is I<sup>azwj</sup> Who have Caused him to be in My<sup>azwj</sup> ropes (tied down by illness)’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ‘Abd Allah ibn al-Mughirah from ‘Abd Allah ibn Sinan who has said the following: “This is a narration of abu ‘Abd Allah, ‘Alayhi al-Salam, from the Messenger of Allah. He (the Messenger of Allah) has said, ‘Allah, the Majestic, the Glorious, says to the angel guarding a believing person in his illness, “Write down for him (of good deeds) what you would write down for him of good deeds in his good health; it is I who have tied him down with My rope.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/264)"
        ],
        "index": 4233,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/55",
              "text": "عَلِيٌّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/201",
              "text": "عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/589",
              "text": "أَبِي الصَّبَّاحِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيٌّ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ أَبِي الصَّبَّاحِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:2:4",
        "text": [
          " قَالَ أَبُو جَعْفَرٍ  ( عليه السلام ) سَهَرُ لَيْلَةٍ مِنْ مَرَضٍ أَفْضَلُ مِنْ عِبَادَةِ سَنَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Abdullah Bin Al Mugheira, from Abu Al Sabbah who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘Staying awake for one night out of sickness is superior than the worship for a year’."
          ],
          "en.sarwar": [
            "4. Ali has narrated from his father from ‘Abd Allah ibn al-Mughirah from abu al-Sabbah who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘Passing a sleepless night due to an illness is more rewarding than a whole year worshipping.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/264)"
        ],
        "index": 4234,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2441",
              "text": "عَبْدِ الْحَمِيدِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ الْحَمِيدِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:2:5",
        "text": [
          " إِذَا صَعِدَ مَلَكَا الْعَبْدِ الْمَرِيضِ إِلَى السَّمَاءِ عِنْدَ كُلِّ مَسَاءٍ يَقُولُ الرَّبُّ تَبَارَكَ وَ تَعَالَى مَا ذَا كَتَبْتُمَا لِعَبْدِي فِي مَرَضِهِ فَيَقُولَانِ الشِّكَايَةَ فَيَقُولُ مَا أَنْصَفْتُ عَبْدِي إِنْ حَبَسْتُهُ فِي حَبْسٍ مِنْ حَبْسِي ثُمَّ أَمْنَعُهُ الشِّكَايَةَ فَيَقُولُ اكْتُبَا لِعَبْدِي مِثْلَ مَا كُنْتُمَا تَكْتُبَانِ لَهُ مِنَ الْخَيْرِ فِي صِحَّتِهِ وَ لَا تَكْتُبَا عَلَيْهِ سَيِّئَةً حَتَّى أُطْلِقَهُ مِنْ حَبْسِي فَإِنَّهُ فِي حَبْسٍ مِنْ حَبْسِي ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ibn Mahboub, from Abdul Hameed, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the two Angels Allocated to the sick person ascend to the sky during every evening, the Lord<sup>azwj</sup> Blessed and High is Saying: “What is that which the two of you have written for My<sup>azwj</sup> servant during his illness?” So they are saying: ‘The complaints’. So He<sup>azwj</sup> is Saying: “There would not be justice for My<sup>azwj</sup> servant if I<sup>azwj</sup> were to Imprison him in a prison of My<sup>azwj</sup> prisons, then Forbid him from complaining. Write down for My<sup>azwj</sup> servant the like of what you two would have written for him from the goodness during his good health, and do not write sins against him until I<sup>azwj</sup> Release him from My<sup>azwj</sup> prison, for he is in a prison from My<sup>azwj</sup> prisons”’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Sahl ibn Ziyad from ibn Mahbub from ‘Abd al-Hamid who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that when the two guard angels of a person suffering from illness ascend to heavens every evening, the Lord, Most Holy, Most Blessed, asks them, ‘What did you write down for My servant in his illness?’ They will say, ‘We wrote down his complaints.’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/264)"
        ],
        "index": 4235,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "النَّضْرِ بْنِ سُوَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/53",
              "text": "دُرُسْتَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/191",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/497",
              "text": "أَحَدِهِمَا ( عليهما السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ دُرُسْتَ عَنْ زُرَارَةَ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:2:6",
        "text": [
          " سَهَرُ لَيْلَةٍ مِنْ مَرَضٍ أَوْ وَجَعٍ أَفْضَلُ وَ أَعْظَمُ أَجْراً مِنْ عِبَادَةِ سَنَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Dorost, from Zurara, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup> having said: ‘Staying awake at night due to illness or pain is superior and with greater Recompense than worship for a year’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from Durust from Zurarah who has said the following: “One of the two Imam, ‘Alayhim al-Salam, has said that passing a sleepless night due to an illness or pain is more excellent and of greater reward than worshipping for a whole year.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/264)"
        ],
        "index": 4236,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/177",
              "text": "أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/239",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/53",
              "text": "دُرُسْتَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَنْهُ عَنْ أَحْمَدَ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ دُرُسْتَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:2:7",
        "text": [
          " سَمِعْتُ أَبَا إِبْرَاهِيمَ ( عليه السلام ) يَقُولُ إِذَا مَرِضَ الْمُؤْمِنُ أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى صَاحِبِ الشِّمَالِ لَا تَكْتُبْ عَلَى عَبْدِي مَا دَامَ فِي حَبْسِي وَ وَثَاقِي ذَنْباً وَ يُوحِي إِلَى صَاحِبِ الْيَمِينِ أَنِ اكْتُبْ لِعَبْدِي مَا كُنْتَ تَكْتُبُهُ فِي صِحَّتِهِ مِنَ الْحَسَنَاتِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ahmad, from Ahmad Bin Muhammad Bin Abu Nasr, from Dorost who said, ",
            "‘I heard Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) saying: ‘When the Believer is sick, Allah<sup>azwj</sup> Mighty and Majestic Reveals unto the companion (Angel) on the left hand side: “Do not write (bad deeds) against My<sup>azwj</sup> servant for as long as he is in My<sup>azwj</sup> prison and My<sup>azwj</sup> fetters”; and He<sup>azwj</sup> Reveals unto the companion (Angel) of the right hand side: “Write for My<sup>azwj</sup> servant what you would have written for him during his good health, from the good deeds”’."
          ],
          "en.sarwar": [
            "7. It is narrated from the narrator above from Ahmad from Ahmad ibn Muhammad ibn abu Nasr from Durust who has said the following: “I heard abu Ibrahim, ‘Alayhi al-Salam, say, ’When a believing person becomes ill, Allah, the Majestic, the Glorious, sends revelation to the guard angel on his left side that says, “Do not write any evil thing against My servant until he is in My prison and is tied down in My heavy impediment.” He then sends revelation to the guard angel on his right side that says, “Write down for My servant of good deeds equal to what he would perform when in good health.”’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/265)"
        ],
        "index": 4237,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/164",
              "text": "حَفْصِ بْنِ غِيَاثٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2442",
              "text": "حَجَّاجٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ حَجَّاجٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:2:8",
        "text": [
          " الْجَسَدُ إِذَا لَمْ يَمْرَضْ أَشِرَ وَ لَا خَيْرَ فِي جَسَدٍ لَا يَمْرَضُ بِأَشَرٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Mahboub, from Hafs Bin Giyaas, from Hajjaj, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The body is joyful when it does not get sick, and there is no goodness in a body which does not get sick by a bit’."
          ],
          "en.sarwar": [
            "8. A number of our people have narrated from Ahmad ibn Muhammad, from ibn Mahbub from Hafs ibn Ghiyath from Hajjaj who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘If one’s body does not become ill, he is vigorously happy. There is nothing good in a body that never becomes ill even by a strong (reason for) illness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/265)"
        ],
        "index": 4238,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/25",
              "text": "مُحَمَّدِ بْنِ حَسَّانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/180",
              "text": "مُحَمَّدِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/459",
              "text": "مُحَمَّدِ بْنِ الْفُضَيْلِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/111",
              "text": "أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ حَسَّانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:2:9",
        "text": [
          " حُمَّى لَيْلَةٍ تَعْدِلُ عِبَادَةَ سَنَةٍ وَ حُمَّى لَيْلَتَيْنِ تَعْدِلُ عِبَادَةَ سَنَتَيْنِ وَ حُمَّى ثَلَاثٍ تَعْدِلُ عِبَادَةَ سَبْعِينَ سَنَةً ",
          "قَالَ قُلْتُ فَإِنْ لَمْ يَبْلُغْ سَبْعِينَ سَنَةً قَالَ فَلِأُمِّهِ وَ أَبِيهِ قَالَ قُلْتُ فَإِنْ لَمْ يَبْلُغَا قَالَ فَلِقَرَابَتِهِ قَالَ قُلْتُ فَإِنْ لَمْ يَبْلُغْ قَرَابَتُهُ قَالَ فَلِجِيرَانِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Hassan, from Muhammad Bin Ali, from Muhammad Bin Al Fuzayl, from Abu Hamza, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Fever for a night equates to worship for a year, and fever for two nights equates to worship for two years, and fever for three (nights) equates to worship for seventy years’.",
            "He (the narrator) said, ‘I said, ‘Supposing he does not reach (to the age of) seventy years?’ He<sup>asws</sup> said: ‘So it would be for his mother and his father’. I said, ‘Supposing they both don’t reach (to that)’. He<sup>asws</sup> said: ‘So it would be for his relatives’. I said, ‘Supposing his relatives don’t reach to that?’ He<sup>asws</sup> said: ‘So it would be for his neighbours’."
          ],
          "en.sarwar": [
            "9. Abu Ali al-Ash’ariy has narrated from Muhammad ibn Hassan from Muhammad ibn Ali from Muhammad ibn al-Fudayl from abu Hamzah who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘One night’s suffering from fever is equal in reward to worshipping for a whole year, suffering from a fever for two nights is more rewarding than worshipping for two years, and the reward for suffering from fever for three nights is greater than the reward for worshipping up to seventy years. I then asked, ‘What happens if one does not live for seventy years?’ The Imam said, ‘Then it is for his mother and father.’ I then asked, ‘What happens if they do not live for seventy years?’ The Imam said, ‘Then it is for his relatives.’ I then asked, ‘What happens if they do not live for seventy years?’ The Imam said, ‘Then it is for his neighbors.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/266)"
        ],
        "index": 4239,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/104",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/789",
              "text": "الْحَكَمِ بْنِ مِسْكِينٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/547",
              "text": "مُحَمَّدِ بْنِ مَرْوَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنِ الْحَكَمِ بْنِ مِسْكِينٍ عَنْ مُحَمَّدِ بْنِ مَرْوَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:2:10",
        "text": [
          " حُمَّى لَيْلَةٍ كَفَّارَةٌ لِمَا قَبْلَهَا وَ لِمَا بَعْدَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husay, from Al Hakam Bin Miskeen, from Muhammad Bin Marwan, ",
            "from Abu Abdullah<sup>asws</sup> having said: ‘Fever for a night is an expiation for his previous and future (sins)."
          ],
          "en.sarwar": [
            "10. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from al-Hakam ibn Miskin from Muhammad ibn Marwan who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that suffering from fever for one night is expiation (for the sins) before and thereafter.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:3:2",
  "kind": "verse_list"
}