{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 32"
        },
        "path": "/books/al-kafi:3:3:32",
        "titles": {
          "ar": "باب الْعِلَّةِ فِي غُسْلِ الْمَيِّتِ غُسْلَ الْجَنَابَةِ",
          "en": "Chapter 32 – The reason regarding washing the deceased and washing from the sexual impurity"
        }
      }
    ],
    "index": 604,
    "local_index": 32,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 33"
        },
        "path": "/books/al-kafi:3:3:33",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب ثَوَابِ مَنْ غَسَّلَ</span> مُؤْمِناً",
          "en": "Chapter 33 – Rewards of the one who washes a Believer"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 31"
        },
        "path": "/books/al-kafi:3:3:31",
        "titles": {
          "ar": "باب غُسْلِ مَنْ غَسَّلَ الْمَيِّتَ وَ مَنْ مَسَّهُ وَ هُوَ حَارٌّ وَ مَنْ مَسَّهُ وَ هُوَ بَارِدٌ",
          "en": "Chapter 31 – Washing of the one who washes the deceased, and the one who touches him while he is hot, and the one who touches him while he is cold"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:3:32",
    "titles": {
      "ar": "باب الْعِلَّةِ فِي غُسْلِ الْمَيِّتِ غُسْلَ الْجَنَابَةِ",
      "en": "Chapter 32 – The reason regarding washing the deceased and washing from the sexual impurity"
    },
    "verse_count": 3,
    "verse_start_index": 4404,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/344)"
        ],
        "index": 4405,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/33",
              "text": "عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/655",
              "text": "إِبْرَاهِيمَ بْنِ إِسْحَاقَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/35",
              "text": "مُحَمَّدِ بْنِ سُلَيْمَانَ الدَّيْلَمِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ الدَّيْلَمِيِّ عَنْ أَبِيهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:32:1",
        "relations": {
          "Mentions": [
            "/books/quran:20:55",
            "/books/quran:20:57"
          ]
        },
        "text": [
          " دَخَلَ عَبْدُ اللَّهِ بْنُ قَيْسٍ الْمَاصِرُ عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) فَقَالَ أَخْبِرْنِي عَنِ الْمَيِّتِ لِمَ يُغَسَّلُ غُسْلَ الْجَنَابَةِ فَقَالَ لَهُ أَبُو جَعْفَرٍ ( عليه السلام ) لَا أُخْبِرُكَ فَخَرَجَ مِنْ عِنْدِهِ فَلَقِيَ بَعْضَ الشِّيعَةِ فَقَالَ لَهُ الْعَجَبُ لَكُمْ يَا مَعْشَرَ الشِّيعَةِ تَوَلَّيْتُمْ هَذَا الرَّجُلَ وَ أَطَعْتُمُوهُ وَ لَوْ دَعَاكُمْ إِلَى عِبَادَتِهِ لَأَجَبْتُمُوهُ وَ قَدْ سَأَلْتُهُ عَنْ مَسْأَلَةٍ فَمَا كَانَ عِنْدَهُ فِيهَا شَيْ‏ءٌ",
          "فَلَمَّا كَانَ مِنْ قَابِلٍ دَخَلَ عَلَيْهِ أَيْضاً فَسَأَلَهُ عَنْهَا فَقَالَ لَا أُخْبِرُكَ بِهَا فَقَالَ عَبْدُ اللَّهِ بْنُ قَيْسٍ لِرَجُلٍ مِنْ أَصْحَابِهِ انْطَلِقْ إِلَى الشِّيعَةِ فَاصْحَبْهُمْ وَ أَظْهِرْ عِنْدَهُمْ مُوَالَاتَكَ إِيَّاهُمْ وَ لَعْنَتِي وَ التَّبَرِّيَ مِنِّي فَإِذَا كَانَ وَقْتُ الْحَجِّ فَأْتِنِي حَتَّى أَدْفَعَ إِلَيْكَ مَا تَحُجُّ بِهِ وَ سَلْهُمْ أَنْ يُدْخِلُوكَ عَلَى مُحَمَّدِ بْنِ عَلِيٍّ فَإِذَا صِرْتَ إِلَيْهِ فَاسْأَلْهُ عَنِ الْمَيِّتِ لِمَ يُغَسَّلُ غُسْلَ الْجَنَابَةِ",
          "فَانْطَلَقَ الرَّجُلُ إِلَى الشِّيعَةِ فَكَانَ مَعَهُمْ إِلَى وَقْتِ الْمَوْسِمِ فَنَظَرَ إِلَى دِينِ الْقَوْمِ فَقَبِلَهُ بِقَبُولِهِ وَ كَتَمَ ابْنَ قَيْسٍ أَمْرَهُ مَخَافَةَ أَنْ يُحْرَمَ الْحَجَّ فَلَمَّا كَانَ وَقْتُ الْحَجِّ أَتَاهُ فَأَعْطَاهُ حَجَّةً وَ خَرَجَ فَلَمَّا صَارَ بِالْمَدِينَةِ قَالَ لَهُ أَصْحَابُهُ تَخَلَّفْ فِي الْمَنْزِلِ حَتَّى نَذْكُرَكَ لَهُ وَ نَسْأَلَهُ لِيَأْذَنَ لَكَ",
          "فَلَمَّا صَارُوا إِلَى أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَهُمْ أَيْنَ صَاحِبُكُمْ مَا أَنْصَفْتُمُوهُ قَالُوا لَمْ نَعْلَمْ مَا يُوَافِقُكَ مِنْ ذَلِكَ فَأَمَرَ بَعْضَ مَنْ حَضَرَ أَنْ يَأْتِيَهُ بِهِ فَلَمَّا دَخَلَ عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَهُ مَرْحَباً كَيْفَ رَأَيْتَ مَا أَنْتَ فِيهِ الْيَوْمَ مِمَّا كُنْتَ فِيهِ قَبْلُ فَقَالَ يَا ابْنَ رَسُولِ اللَّهِ لَمْ أَكُنْ فِي شَيْ‏ءٍ",
          "فَقَالَ صَدَقْتَ أَمَا إِنَّ عِبَادَتَكَ يَوْمَئِذٍ كَانَتْ أَخَفَّ عَلَيْكَ مِنْ عِبَادَتِكَ الْيَوْمَ لِأَنَّ الْحَقَّ ثَقِيلٌ وَ الشَّيْطَانَ مُوَكَّلٌ بِشِيعَتِنَا لِأَنَّ سَائِرَ النَّاسِ قَدْ كَفَوْهُ أَنْفُسَهُمْ إِنِّي سَأُخْبِرُكَ بِمَا قَالَ لَكَ ابْنُ قَيْسٍ الْمَاصِرُ قَبْلَ أَنْ تَسْأَلَنِي عَنْهُ وَ أُصَيِّرُ الْأَمْرَ فِي تَعْرِيفِهِ إِيَّاهُ إِلَيْكَ إِنْ شِئْتَ أَخْبَرْتَهُ وَ إِنْ شِئْتَ لَمْ تُخْبِرْهُ",
          "إِنَّ اللَّهَ تَعَالَى خَلَقَ خَلَّاقِينَ فَإِذَا أَرَادَ أَنْ يَخْلُقَ خَلْقاً أَمَرَهُمْ فَأَخَذُوا مِنَ التُّرْبَةِ الَّتِي قَالَ فِي كِتَابِهِ مِنْها خَلَقْناكُمْ وَ فِيها نُعِيدُكُمْ وَ مِنْها نُخْرِجُكُمْ تارَةً أُخْرى فَعَجَنَ النُّطْفَةَ بِتِلْكَ التُّرْبَةِ الَّتِي يَخْلُقُ مِنْهَا بَعْدَ أَنْ أَسْكَنَهَا الرَّحِمَ أَرْبَعِينَ لَيْلَةً فَإِذَا تَمَّتْ لَهَا أَرْبَعَةُ أَشْهُرٍ قَالُوا يَا رَبِّ نَخْلُقُ مَا ذَا فَيَأْمُرُهُمْ بِمَا يُرِيدُ مِنْ ذَكَرٍ أَوْ أُنْثَى أَبْيَضَ أَوْ أَسْوَدَ فَإِذَا خَرَجَتِ الرُّوحُ مِنَ الْبَدَنِ خَرَجَتْ هَذِهِ النُّطْفَةُ بِعَيْنِهَا مِنْهُ كَائِناً مَا كَانَ صَغِيراً أَوْ كَبِيراً ذَكَراً أَوْ أُنْثَى فَلِذَلِكَ يُغَسَّلُ الْمَيِّتُ غُسْلَ الْجَنَابَةِ ",
          "فَقَالَ الرَّجُلُ يَا ابْنَ رَسُولِ اللَّهِ لَا وَ اللَّهِ مَا أُخْبِرُ ابْنَ قَيْسٍ الْمَاصِرَ بِهَذَا أَبَداً فَقَالَ ذَلِكَ إِلَيْكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad Bin Abdullah, from Ibrahim Bin Is’haq, from Muhammad Bin Suleyman Al Daylami, from his father, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said, ‘Abdullah Bin Qays Al-Masir came over to Abu Ja’far<sup>asws</sup> and he said, ‘Inform me about the deceased, why does he have to be washed with a washing for the sexual impurity?’ So Abu Ja’far<sup>asws</sup> said to him: ‘I<sup>asws</sup> will not inform you’. So he went out from his<sup>asws</sup> presence and met one of his<sup>asws</sup> Shias and he said, ‘I wonder at you, O group of Shias. You are in the Wilayah of this man<sup>asws</sup> and obeying him<sup>asws</sup>, and if he<sup>asws</sup> were to invite you to worship him<sup>asws</sup>, you would respond to him<sup>asws</sup>; and I had asked him<sup>asws</sup> a question, but there was nothing with him<sup>asws</sup> with regards to it!’ ",
            "So when it was in the future, he (again) went over to him<sup>asws</sup> and asked him<sup>asws</sup> about it, and he<sup>asws</sup> said: ‘I<sup>asws</sup> will not inform you with it’. So Abdullah Bin Qays said to a man from his companions, ‘Go to the Shias and be their companions, and display your Wilayah with them in their presence and curse me and disavow from me. So when it would be the time for Hajj, come over to me and I shall hand over to you (the expense money) what you would need for it, and ask them that they should let you go to Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>. So when you arrive to him<sup>asws</sup>, ask him<sup>asws</sup> about the deceased, why does he have to be washed with a washing for the sexual impurity’. ",
            "So the man went to the Shias, and was with them until the time of the season (of Hajj). So he looked at the Religion of the group and accepted it with its acceptance, and concealed the matter from Ibn Qays fearing that he would prevent the Hajj (not pay for it). So when it was the time for the Hajj, he went over to him, and he gave him (the expenses for) Hajj, and he went out. So when he arrived in Al-Medina, his companions said to him, ‘Stay behind in the house until we mention you to him<sup>asws</sup>, and we ask him for permission for you’. ",
            "So when they arrived to Abu Ja’far<sup>asws</sup>, he<sup>asws</sup> said to them: ‘Where is your companion? You have not been just to him’. They said, ‘We did not know what your<sup>asws</sup> acceptance would be from that’. So he<sup>asws</sup> ordered one of those present that he should come with him. So when he came over to Abu Ja’far<sup>asws</sup>, he<sup>asws</sup> said to him: ‘Welcome! How is your view of what you are in today, from what you were in beforehand?’ So he said, ‘O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! I wasn’t in anything (before)’. ",
            "So he<sup>asws</sup> said: ‘You speak the truth. As for your worship in those days, it was lighter upon you than your worship today, because the truth is heavy, and the Satan<sup>la</sup> is allocated with our<sup>asws</sup> Shias, because the rest of the people he<sup>la</sup> has sufficed with their selves. I<sup>asws</sup> shall be informing you with what Ibn Qays Al-Masir said to you, before you even ask me<sup>asws</sup> about it; and relating the matter in presenting it to him, it is up to you, if you so desire it, inform him, and if you so desire, do not inform him. ",
            "Allah<sup>azwj</sup> the Exalted, Created creators. So whenever He<sup>azwj</sup> Intends to create a creature, He<sup>azwj</sup> Commands them. So they take from the dust which Allah<sup>azwj</sup> has Spoken on in His<sup>azwj</sup> Book <span class=\"ibTxt\"><a href=\"/#/books/quran:20#h55\">[20:55]</a> From it We Created you and into it We shall be Sending you back and from it will We Bring you out once again</span>. So the seed is kneaded with that dust which he would be created from after having settled in the womb for forty nights. So when four months are completed for him, they are saying: ‘O Lord<sup>azwj</sup>! What is that to be?’ So He<sup>azwj</sup> is Commanding them with whatever He<sup>azwj</sup> so Intends, whether a male or a female, white or black. So when the soul comes out from the body, this exact seed comes out from it, as it was before, from the young or old, male or female. Thus, it is due to that, the deceased is washed with a washing for the sexual impurity’. ",
            "So the man said, ‘O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! No, by Allah<sup>azwj</sup>! I will not inform Ibn Qays Al-Masir with this, ever!’. So he<sup>asws</sup> said: ‘That is up to you’."
          ],
          "en.sarwar": [
            "1. Ali ibn Muhammad ibn ‘Abd Allah has narrated from Ibrahim ibn ‘Ishaq from Muhammad ibn Sulayman al-Daylamiy from his father who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that once ‘Abd Allah ibn Qays al-Masir visited abu Ja’far, ‘Alayhi al-Salam, and said, ‘Tell me why a dead body is given Ghusl (bath) because of carnal activities?’ Abu Ja’far, ‘Alayhi al-Salam, said, ‘I do not want to tell you.’ He then left and thereafter found someone of the followers of the Imam. He said to him, ‘It is very strange of you Shi‘ah people. You consider this man as Divine guardian, obey him even if he asks you to worship him. I asked him a question but he had no answer for it.’ A few days later he visited the Imam again, asked the same question and he (the Imam) said, ‘I do not want to tell you.’ ‘Abd Allah ibn Qays then asked one of his people, ‘Join the Shi‘ah and pretend among them to be one of those who love the Imam. Condemn and denounce me. When it is time to perform Hajj come to me so I pay for your expenses; and then ask them to help you visit him (their Imam) Muhammad ibn Ali. When you are there, then ask him about why a dead person is given Ghusl (bath) because of carnal reasons.’ The man joined the Shi‘ah people until it was time to perform Hajj. During this time, he had observed the religious conditions of these people and had already accepted their belief, but did not tell ibn al-Qays about it for fear of being deprived of performing Hajj. When it was time for Hajj, he went to ibn al-Qays who provided him the expenses for Hajj. When he arrived in al-Madinah, his friends told him to stay behind until they informed the Imam about him and asked him for permission for a meeting. When they went to see abu Ja‘far, ‘Alayhi al-Salam, he asked them, ‘Where is your companion? You have not treated him with fairness.’ They said, ‘We did not know if you agreed to see him or not.’ He then sent someone to bring him for a meeting. Abu Ja‘far, ‘Alayhi al-Salam, welcomed him. He (the Imam) asked, ‘How do you feel comparing what you have found with what you had before?’ He replied, ‘O child of the Messenger of Allah, I did not have anything.’ He said, ‘You have spoken the truth. Your worships in those days were easier than what they are today; truth is heavy and Satan is assigned to work hard against our Shi ‘ah but other people themselves work for him. I, however, will tell you about the question of al- Qays al-Masir before even you ask me about it and will leave it for you to decide whether to explain it to him or not. Allah, Most High, has created creative agents. When He decides to create a creature, He commands them (agents) to get something from the soil, which He has mentioned in His book. “From it (soil) We created you and to that soil We return you and take you out of that at another time.” <a href=\"/#/books/quran:20#h57\">[20:57]</a> Seed is then mixed with that soil from which they are created later after settling in the womb for forty nights. When four months are complete they (agents) ask, “Lord, what do you want to create out of it?” He then commands them to do what He wants to be done as regards the gender of the fetus being white or black. When the spirit comes out from the body, the seed comes out from that person just as it was, regardless of being young or grown up, male or female. For this reason the dead body is washed (just as) it is washed for carnal activities. He said, ‘O child of the Messenger of Allah, I will never tell it to al-Qays al-Masir.’ He said, ‘It is up to you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/345)"
        ],
        "index": 4406,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/38",
              "text": "النَّوْفَلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/39",
              "text": "السَّكُونِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:32:2",
        "text": [
          " سُئِلَ مَا بَالُ الْمَيِّتِ يُمْنِي قَالَ النُّطْفَةُ الَّتِي خُلِقَ مِنْهَا يَرْمِي بِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘He<sup>asws</sup> was asked, ‘What is the matter, the deceased tends to discharge semen?’ He<sup>asws</sup> said: ‘The seed which he was Created from, is thrown out with’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy, from al-Sakuniy who has said the following: “Once, a person asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘Why does a dying person discharge (semen)?’ He said, ‘It is the seed from which he is created that he throws out.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/345)"
        ],
        "index": 4407,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/80",
              "text": "بَعْضُ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1871",
              "text": "عَلِيِّ بْنِ الْحَسَنِ الْمِيثَمِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/659",
              "text": "هَارُونَ بْنِ حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/18",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/161",
              "text": "عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "بَعْضُ أَصْحَابِنَا عَنْ عَلِيِّ بْنِ الْحَسَنِ الْمِيثَمِيِّ عَنْ هَارُونَ بْنِ حَمْزَةَ عَنْ بَعْضِ أَصْحَابِنَا عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:32:3",
        "text": [
          " قَالَ إِنَّ الْمَخْلُوقَ لَا يَمُوتُ حَتَّى تَخْرُجَ مِنْهُ النُّطْفَةُ الَّتِي خُلِقَ مِنْهَا مِنْ فِيهِ أَوْ مِنْ عَيْنِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "One of our companions, from Ali Bin Al Hassan Al Maysami, from Haroun Bin Hamza, from one of our companions, ",
            "(It has been narrated) from Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> having said: ‘The creature is not dying until the seed comes out from him, that which he was Created from, either from his mouth, or from his eyes’."
          ],
          "en.sarwar": [
            "3. Certain persons of our people have narrated from Ali ibn al-Hassan al-Mithamiy from Harun ibn Hamzah from certain persons of our people who has said the following: “Ali ibn al-Husayn, ‘Alayhi al-Salam, has said that a creature does not die until the seed from which it is created comes out through his mouth or his eye.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:3:32",
  "kind": "verse_list"
}