{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:3:3", "titles": {"ar": "كِتَابُ الْجَنَائِزِ", "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "}}, {"indexed_titles": {"en": "Chapter 33"}, "path": "/books/al-kafi:3:3:33", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب ثَوَابِ مَنْ غَسَّلَ</span> مُؤْمِناً", "en": "Chapter 33 – Rewards of the one who washes a Believer"}}], "index": 605, "local_index": 33, "part_type": "Chapter", "path": "/books/al-kafi:3:3:33", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب ثَوَابِ مَنْ غَسَّلَ</span> مُؤْمِناً", "en": "Chapter 33 – Rewards of the one who washes a Believer"}, "verse_count": 4, "verse_start_index": 4407, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 4408, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:3:33:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ غَالِبٍ عَنْ سَعْدٍ الْإِسْكَافِ عَنْ أَبِي جَعْفَرٍ قَالَ أَيُّمَا مُؤْمِنٍ غَسَّلَ مُؤْمِناً فَقَالَ إِذَا قَلَّبَهُ اللَّهُمَّ إِنَّ هَذَا بَدَنُ عَبْدِكَ الْمُؤْمِنِ قَدْ أَخْرَجْتَ رُوحَهُ مِنْهُ وَ فَرَّقْتَ بَيْنَهُمَا فَعَفْوَكَ عَفْوَكَ غَفَرَ اللَّهُ لَهُ ذُنُوبَ سَنَةٍ إِلَّا الْكَبَائِرَ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Al Hassan Bin Mahboub, from Abdullah Bin Ghalib, from Sa’ad Al Iskaf, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Whichever Believer washes a Believer and he says when facing him, ‘O Allah<sup>azwj</sup>! This is a body of Your<sup>azwj</sup> Believing servant. His soul has come out from him, and there is a separation between the two. Your<sup>azwj</sup> Forgiveness, Your<sup>azwj</sup> Forgiveness (for him)’, Allah<sup>azwj</sup> would Forgive for him sixty years of sins except for the major sins’."]}}, {"index": 4409, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:3:33:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ سَعْدِ بْنِ طَرِيفٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ مَنْ غَسَّلَ مَيِّتاً فَأَدَّى فِيهِ الْأَمَانَةَ غَفَرَ اللَّهُ لَهُ قُلْتُ وَ كَيْفَ يُؤَدِّي فِيهِ الْأَمَانَةَ قَالَ لَا يُحَدِّثُ بِمَا يَرَى ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Sa’ad Bin Tareyf, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The one who washes a deceased and fulfills the entrustments with regards to him, Allah<sup>azwj</sup> would Forgive him’. I said, ‘And would he fulfill the entrustments with regards to him?’ He<sup>asws</sup> said: ‘He would not narrate with what he saw’."]}}, {"index": 4410, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:3:33:3", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا مِنْ مُؤْمِنٍ يُغَسِّلُ مُؤْمِناً وَ يَقُولُ وَ هُوَ يُغَسِّلُهُ رَبِّ عَفْوَكَ عَفْوَكَ إِلَّا عَفَا اللَّهُ عَنْهُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Ibrahim Bin Umar, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There is none from a Believer who washes a Believer and is saying while washing him, ‘Lord<sup>azwj</sup>! Your Forgiveness, Your<sup>azwj</sup> Forgiveness (for him)’, except that Allah<sup>azwj</sup> would Forgive him’."]}}, {"index": 4411, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:3:3:33:4", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ سِنَانٍ عَنْ أَبِي الْجَارُودِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كَانَ فِيمَا نَاجَى اللَّهَ بِهِ مُوسَى قَالَ يَا رَبِّ مَا لِمَنْ غَسَّلَ الْمَوْتَى فَقَالَ أَغْسِلُهُ مِنْ ذُنُوبِهِ كَمَا وَلَدَتْهُ أُمُّهُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Mhammad, from Ibn Sinan, from Abu Al Jaroud, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Among what Musa<sup>as</sup> whispered to Allah<sup>azwj</sup> with, was: ‘O Lord<sup>azwj</sup>! What is for the one who washes the dead?’ So He<sup>azwj</sup> Said: “I<sup>azwj</sup> would Wash him from his sins to just as he was when his mother gave birth to him’."]}}]}, "index": "al-kafi:3:3:33", "kind": "verse_list"}