{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 36"
        },
        "path": "/books/al-kafi:3:3:36",
        "titles": {
          "ar": "باب حَدِّ حَفْرِ الْقَبْرِ وَ اللَّحْدِ وَ الشَّقِّ وَ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) لُحِدَ لَهُ",
          "en": "Chapter 36 – Limit of the pit (depth) of the grave, and the sepulchre (Lahad), and the chasm (length)"
        }
      }
    ],
    "index": 608,
    "local_index": 36,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 37"
        },
        "path": "/books/al-kafi:3:3:37",
        "titles": {
          "ar": "باب أَنَّ الْمَيِّتَ يُؤْذَنُ بِهِ النَّاسُ",
          "en": "Chapter 37 – The deceased, the people should be proclaimed with it (his news of death)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 35"
        },
        "path": "/books/al-kafi:3:3:35",
        "titles": {
          "ar": "باب ثَوَابِ مَنْ حَفَرَ لِمُؤْمِنٍ قَبْراً",
          "en": "Chapter 35 – Rewards of the one who digs a grave for a Believer"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:3:36",
    "titles": {
      "ar": "باب حَدِّ حَفْرِ الْقَبْرِ وَ اللَّحْدِ وَ الشَّقِّ وَ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) لُحِدَ لَهُ",
      "en": "Chapter 36 – Limit of the pit (depth) of the grave, and the sepulchre (Lahad), and the chasm (length)"
    },
    "verse_count": 4,
    "verse_start_index": 4413,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/2)"
        ],
        "index": 4414,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1119",
              "text": "سَهْلُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "سَهْلُ بْنُ زِيَادٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:36:1",
        "text": [
          " رَوَى أَصْحَابُنَا أَنَّ حَدَّ الْقَبْرِ إِلَى التَّرْقُوَةِ وَ قَالَ بَعْضُهُمْ إِلَى الثَّدْيِ وَ قَالَ بَعْضُهُمْ قَامَةِ الرَّجُلِ حَتَّى يُمَدَّ الثَّوْبُ عَلَى رَأْسِ مَنْ فِي الْقَبْرِ وَ أَمَّا اللَّحْدُ فَبِقَدْرِ مَا يُمْكِنُ فِيهِ الْجُلُوسُ قَالَ وَ لَمَّا حَضَرَ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) الْوَفَاةُ أُغْمِيَ عَلَيْهِ فَبَقِيَ سَاعَةً ثُمَّ رُفِعَ عَنْهُ الثَّوْبُ ثُمَّ قَالَ الْحَمْدُ لِلَّهِ الَّذِي أَوْرَثَنَا الْجَنَّةَ نَتَبَوَّأُ مِنْهَا حَيْثُ نَشَاءُ فَنِعْمَ أَجْرُ الْعَامِلِينَ ثُمَّ قَالَ احْفِرُوا لِي وَ ابْلُغُوا إِلَى الرَّشْحِ قَالَ ثُمَّ مُدَّ الثَّوْبُ عَلَيْهِ فَمَاتَ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl Bin Ziyad said, ",
            "‘Our companions reported that a limit of the grave is up to the clavicle, and some of them said, The standing of the man until the cloth can be extended upon the head of the one who is in the grave, and as for the chasm, so it is of a measurement of what is possible to sit in. So when the death presented itself to Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, unconsciousness came over him<sup>asws</sup>, then raised the cloth from him<sup>asws</sup>, then said: ‘The Praise is for Allah<sup>azwj</sup> Who Made us<sup>asws</sup> the inheritors of the Paradise, so we<sup>asws</sup> can dwell in it wherever we<sup>asws</sup> so desire to. Thus, the best of the Recompense is for the workers’. Then he<sup>asws</sup> said: ‘Dig (the grave) for me<sup>asws</sup> and deliver its sprinkling (of the water)’. He (the narrator) said, ‘Then he<sup>asws</sup> pulled the sheet upon him<sup>asws</sup>, and he<sup>asws</sup> passed away’."
          ],
          "en.sarwar": [
            "1. Sahl ibn Ziyad has said that according to the narration of our people:the depth of the grave is up to one’s collarbones. Certain ones have said that it is up to one’s chest and still others say that it is up to the whole height of a man, so one can pull the sheet over the head of those in the grave. The depth of Lahad is as high as one can sit straight inside. He (the narrator) has said that when Ali ibn al-Husayn, ‘Alayhi al-Salam, was about to die, he fainted for a while and then he removed the cloth and said, ‘All praise belongs to Allah who has made us heirs of paradise. We can live wherever we like and this is good reward for those who do good deeds.’ He (the Imam) then said, ‘Dig for me (a grave) and sprinkle water properly.’ He (the narrator) has said that he (the Imam), ‘Alayhi al-Salam, then pulled the sheet over his face and passed away.’” (Shahid al-Thani has said that fainting of the Imam in this Hadith is not in a literal sense; as long as an Imam is alive he is responsible and in a fainting condition one is not responsible). (Lahad is a prepared room horizontally at the bottom of the grave as opposed to a vertical ditch in the center of the grave) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/2)"
        ],
        "index": 4415,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/406",
              "text": "سَهْلٌ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "بَعْضِ أَصْحَابِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2312",
              "text": "أَبِي هَمَّامٍ إِسْمَاعِيلَ بْنِ هَمَّامٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/93",
              "text": "أَبِي الْحَسَنِ الرِّضَا ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "سَهْلٌ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي هَمَّامٍ إِسْمَاعِيلَ بْنِ هَمَّامٍ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:36:2",
        "text": [
          " قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) حِينَ احْتُضِرَ إِذَا أَنَا مِتُّ فَاحْفِرُوا لِي وَ شُقُّوا لِي شَقّاً فَإِنْ قِيلَ لَكُمْ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) لُحِدَ لَهُ فَقَدْ صَدَقُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl, from one of his companions, frpom Abu Hammam Ismail Bin Hammam, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup> having said: ‘Abu Ja’far<sup>asws</sup> said when he<sup>asws</sup> was passing away: ‘When I<sup>asws</sup> pass away, so dig out for me<sup>asws</sup> and dig for me<sup>asws</sup> a grave. So if they say to you that Rasool-Allah<sup>saww</sup>, there was a dug out for him<sup>asws</sup>, so they would have spoken the truth’."
          ],
          "en.sarwar": [
            "2. Sahl has narrated from certain persons of his people from abu Hammam ’Isma‘il ibn Hammad who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, when about to leave this world said, ‘When I die dig a grave for me as a straight cut in the ground, as opposed to digging straight and then digging horizontally a passage to accommodate the body which is called Lahad. If people say that the Messenger of Allah was place in Lahad, accept it as true.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/3)"
        ],
        "index": 4416,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:36:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) لَحَدَ لَهُ أَبُو طَلْحَةَ الْأَنْصَارِيُّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, form Hammad Bin Usman Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that Rasool-Allah<sup>saww</sup>, the one who dug out the chasm for him<sup>saww</sup> was Abu Talha Al-Ansaryy’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad ibn ‘Uthman from al-Halabiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Abu Talhah al-Ansariy prepared Lahad for the Messenger of Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/3)"
        ],
        "index": 4417,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:36:4",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ النَّبِيَّ ( صلى الله عليه وآله ) نَهَى أَنْ يُعَمَّقَ الْقَبْرُ فَوْقَ ثَلَاثَةِ أَذْرُعٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Al Nowfaly, from Al Sakny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that the Prophet<sup>saww</sup> forbade from a depth of the grave to be above three cubits’ (6 feet)."
          ],
          "en.sarwar": [
            "4. Ali has narrated from his father from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Holy prophet, prohibited digging the grave deeper than three hands (yards).” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:3:36",
  "kind": "verse_list"
}