{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 42"
        },
        "path": "/books/al-kafi:3:3:42",
        "titles": {
          "ar": "باب مَنْ يَتْبَعُ جَنَازَةً ثُمَّ يَرْجِعُ",
          "en": "Chapter 42 – The one who follows a coffin, then returns"
        }
      }
    ],
    "index": 614,
    "local_index": 42,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 43"
        },
        "path": "/books/al-kafi:3:3:43",
        "titles": {
          "ar": "باب ثَوَابِ مَنْ مَشَى مَعَ جَنَازَةٍ",
          "en": "Chapter 43- Rewards of the one who walks with a coffin"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 41"
        },
        "path": "/books/al-kafi:3:3:41",
        "titles": {
          "ar": "باب كَرَاهِيَةِ الرُّكُوبِ مَعَ الْجَنَازَةِ",
          "en": "Chapter 41 – Abhorrence of the riding with the coffin"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:3:42",
    "titles": {
      "ar": "باب مَنْ يَتْبَعُ جَنَازَةً ثُمَّ يَرْجِعُ",
      "en": "Chapter 42 – The one who follows a coffin, then returns"
    },
    "verse_count": 3,
    "verse_start_index": 4436,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/17)"
        ],
        "index": 4437,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/207",
              "text": "عَلِيِّ بْنِ رِئَابٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/191",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ زُرَارَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:42:1",
        "text": [
          " كُنْتُ مَعَ أَبِي جَعْفَرٍ ( عليه السلام ) فِي جِنَازَةٍ لِبَعْضِ قَرَابَتِهِ فَلَمَّا أَنْ صَلَّى عَلَى الْمَيِّتِ قَالَ وَلِيُّهُ لِأَبِي جَعْفَرٍ ( عليه السلام ) ارْجِعْ يَا أَبَا جَعْفَرٍ مَأْجُوراً وَ لَا تَعَنَّى لِأَنَّكَ تَضْعُفُ عَنِ الْمَشْيِ فَقُلْتُ أَنَا لِأَبِي جَعْفَرٍ ( عليه السلام ) قَدْ أَذِنَ لَكَ فِي الرُّجُوعِ فَارْجِعْ وَ لِيَ حَاجَةٌ أُرِيدُ أَنْ أَسْأَلَكَ عَنْهَا ",
          "فَقَالَ لِي أَبُو جَعْفَرٍ ( عليه السلام ) إِنَّمَا هُوَ فَضْلٌ وَ أَجْرٌ فَبِقَدْرِ مَا يَمْشِي مَعَ الْجَنَازَةِ يُؤْجَرُ الَّذِي يَتْبَعُهَا فَأَمَّا بِإِذْنِهِ فَلَيْسَ بِإِذْنِهِ جِئْنَا وَ لَا بِإِذْنِهِ نَرْجِعُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Al Hassan Bin Mahboub, from Ali Bin Raib, from Zurara who said, ",
            "‘I was with Abu Ja’far<sup>asws</sup> during a funeral of one of his<sup>asws</sup> relatives. So when he<sup>asws</sup> had Prayed <span class=\"iTxt\">Salaat</span> over the deceased, his guardian said to Abu Ja’far<sup>asws</sup>, ‘Return, O Abu Ja’far<sup>asws</sup>, having been Recompensed, and do not tire (yourself<sup>asws</sup>) because you<sup>asws</sup> are too weak to walk’. So I said to Abu Ja’far<sup>asws</sup>, ‘There is permission for you<sup>asws</sup> with regards to the returning, so return, and for me is a need which I want to ask you<sup>asws</sup> about it’. ",
            "So Abu Ja’far<sup>asws</sup> said to me: ‘But rather it is a merit and there is a Recompense, therefore he who is able upon walking with the coffin would be Recompensed in accordance with that which he had walked. So, as for his permission, so it was not with his permission that we came over, and it is not with his permission that we would return’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad from al-Hassan ibn Mahbub from Ali ibn Ri’ab from Zurarah who has said the following: “Once I was in the presence of abu Ja’far, ‘Alayhi al-Salam, in a funeral procession of one of his relatives. When he completed the prayer for a deceased, the guardian of the deceased said to abu Ja’far, ‘Alayhi al-Salam, ’Please return home. May Allah grant you the reward. Please do not become tired. You are not strong enough to walk. 5 I then said to abu Ja’far, ‘Alayhi al-Salam, ’He has given you permission to return. I am in need of something and I want to ask you about it.’ Abu Ja’far, "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/17)"
        ],
        "index": 4438,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2489",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي عَبْدِ اللَّهِ رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:42:2",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَمِيرَانِ وَ لَيْسَا بِأَمِيرَيْنِ لَيْسَ لِمَنْ تَبِعَ جَنَازَةً أَنْ يَرْجِعَ حَتَّى يُدْفَنَ أَوْ يُؤْذَنَ لَهُ وَ رَجُلٌ يَحُجُّ مَعَ امْرَأَةٍ فَلَيْسَ لَهُ أَنْ يَنْفِرَ حَتَّى تَقْضِيَ نُسُكَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Abu Abdullah, ",
            "(It has been narrated) raising it from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Two Emirs (ones with command) are not with two commands – it is not for the one who follows a coffin that he returns until it is permitted for him, and a man who performs Hajj with a woman, so it is not for him that he flees (abandons her) until she has fulfilled her rituals’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad ibn abu ‘Abd Allah in a marfu‘ manner who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah has said, ‘Two kinds of commanders have no command. One is he who joins a funeral procession. He has no command to return home before the burial is complete, or he is given permission to return. The other is a man who performs Hajj along with a woman. He has no command to leave her alone before she completes all activities of her Hajj.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/18)"
        ],
        "index": 4439,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/207",
              "text": "عَلِيِّ بْنِ رِئَابٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/191",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ زُرَارَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:42:3",
        "text": [
          " حَضَرَ أَبُو جَعْفَرٍ ( عليه السلام ) جَنَازَةَ رَجُلٍ مِنْ قُرَيْشٍ وَ أَنَا مَعَهُ وَ كَانَ فِيهَا عَطَاءٌ فَصَرَخَتْ صَارِخَةٌ فَقَالَ عَطَاءٌ لَتَسْكُتِنَّ أَوْ لَنَرْجِعَنَّ قَالَ فَلَمْ تَسْكُتْ فَرَجَعَ عَطَاءٌ قَالَ فَقُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) إِنَّ عَطَاءً قَدْ رَجَعَ قَالَ وَ لِمَ قُلْتُ صَرَخَتْ هَذِهِ الصَّارِخَةُ فَقَالَ لَهَا لَتَسْكُتِنَّ أَوْ لَنَرْجِعَنَّ فَلَمْ تَسْكُتْ فَرَجَعَ فَقَالَ امْضِ بِنَا فَلَوْ أَنَّا إِذَا رَأَيْنَا شَيْئاً مِنَ الْبَاطِلِ مَعَ الْحَقِّ تَرَكْنَا لَهُ الْحَقَّ لَمْ نَقْضِ حَقَّ مُسْلِمٍ",
          "قَالَ فَلَمَّا صَلَّى عَلَى الْجِنَازَةِ قَالَ وَلِيُّهَا لِأَبِي جَعْفَرٍ ( عليه السلام ) ارْجِعْ مَأْجُوراً رَحِمَكَ اللَّهُ فَإِنَّكَ لَا تَقْوَى عَلَى الْمَشْيِ فَأَبَى أَنْ يَرْجِعَ قَالَ فَقُلْتُ لَهُ قَدْ أَذِنَ لَكَ فِي الرُّجُوعِ وَ لِي حَاجَةٌ أُرِيدُ أَنْ أَسْأَلَكَ عَنْهَا فَقَالَ امْضِ فَلَيْسَ بِإِذْنِهِ جِئْنَا وَ لَا بِإِذْنِهِ نَرْجِعُ إِنَّمَا هُوَ فَضْلٌ وَ أَجْرٌ طَلَبْنَاهُ فَبِقَدْرِ مَا يَتْبَعُ الْجَنَازَةَ الرَّجُلُ يُؤْجَرُ عَلَى ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Ali Bin Raib, from Zurara who said, ",
            "‘Abu Ja’far<sup>asws</sup> attended a funeral of a man from Qureysh and I was with him<sup>asws</sup>, and Ata’a was in it. So a woman shrieked, and Ata’a said in order to calm her, ‘Or should we return?’ But she did not calm down, so Ata’a returned. So I said to Abu Ja’far<sup>asws</sup>, ‘Ata’a has returned’. He<sup>asws</sup> said: ‘And why?’ I said, ‘This woman shrieked, so he said to her, ‘Will you calm down or should we return?’ But she did not calm down, so he returned. So he<sup>asws</sup> said: ‘Come with us<sup>asws</sup>, so if we<sup>asws</sup> were to see something from the falsehood along with the Truth, we<sup>asws</sup> leave the right for it, we<sup>asws</sup> would not be fulfilling a right of a Muslim’. ",
            "He (the narrator) said, ‘So when he<sup>asws</sup> had prayed <span class=\"iTxt\">Salaat</span> over the deceased, his guardian said to Abu Ja’far<sup>asws</sup>, ‘Return, having been Recompensed, may Allah<sup>azwj</sup> have Mercy on you<sup>asws</sup>, for you<sup>asws</sup> are not strong enough upon the walking’. But he<sup>asws</sup> refused to return. So I said to him<sup>asws</sup>, ‘He has permitted for you<sup>asws</sup> with regards to the returning, and for me there is a need which I want to ask you<sup>asws</sup> about it’. So he<sup>asws</sup> said: ‘Continue (with what we are doing), for it is not with his permission that we came, and it is not with his permission that we would be returning. But rather, it is a merit, and there is a Recompense we are seeking, for it is in accordance with what the man follows a coffin that he would be Recompensed upon that’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn Mahbub from Ali ibn Ri’ab from Zurarah who has said the following: “Once abu Ja’far, ‘Alayhi al-Salam, joined a funeral procession for a man from Quraysh while I was with him. ‘ Ata’ (ibn Rabah) was also there. A woman began to cry loudly. ‘ Ata’ said, ‘You should calm down or I must leave.’ She did not calm down and ‘Ata’ returned. I then said to abu Ja’far, ‘Alayhi al-Salam, that ’Ata’ has returned.’ He asked, ‘Why did he do so?’ I said, ‘A woman began to cry loudly. ‘Ata’ asked her, “Calm down or I return.” She did not calm down thus he returned.’ He (the Imam) said, ‘Allow us to continue. If we saw falsehood alongside the truth and for that reason returned, we would not be yielding to the rights of a Muslim.’ The narrator has said, ‘When prayer for the deceased was performed, the guardian of the deceased came to abu Ja’far, ‘Alayhi al-Salam, and said, “Please return home. May Allah grant you good rewards and favors for your efforts. You are not strong enough to walk.’” The Imam refused to return. I then said, ‘He has given you permission to return. I need something and I want to ask you about it.’ He said, ‘Allow us to continue. We did not join the funeral procession by his permission, nor will we return by his permission. It is a matter of virtue and reward we seek, and such reward is proportionate to the amount of walking in the procession.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:3:42",
  "kind": "verse_list"
}