{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 45"
        },
        "path": "/books/al-kafi:3:3:45",
        "titles": {
          "ar": "باب جَنَائِزِ الرِّجَالِ وَ النِّسَاءِ وَ الصِّبْيَانِ وَ الْأَحْرَارِ وَ الْعَبِيدِ",
          "en": "Chapter 45 – The funerals of the men, and the women, and the children, and the free ones, and the slaves"
        }
      }
    ],
    "index": 617,
    "local_index": 45,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 46"
        },
        "path": "/books/al-kafi:3:3:46",
        "titles": {
          "ar": "باب نَادِرٌ",
          "en": "Chapter 46 – Miscellaneous"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 44"
        },
        "path": "/books/al-kafi:3:3:44",
        "titles": {
          "ar": "باب ثَوَابِ مَنْ حَمَلَ جَنَازَةً",
          "en": "Chapter 44 – Rewards for the one who carries a coffin"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:3:45",
    "titles": {
      "ar": "باب جَنَائِزِ الرِّجَالِ وَ النِّسَاءِ وَ الصِّبْيَانِ وَ الْأَحْرَارِ وَ الْعَبِيدِ",
      "en": "Chapter 45 – The funerals of the men, and the women, and the children, and the free ones, and the slaves"
    },
    "verse_count": 6,
    "verse_start_index": 4450,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/25)"
        ],
        "index": 4451,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/239",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/6",
              "text": "الْعَلَاءِ بْنِ رَزِينٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:45:1",
        "text": [
          " سَأَلْتُهُ كَيْفَ يُصَلَّى عَلَى الرِّجَالِ وَ النِّسَاءِ قَالَ يُوضَعُ الرَّجُلُ مِمَّا يَلِي الرِّجَالَ وَ النِّسَاءُ خَلْفَ الرِّجَالِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about how to pray <span class=\"iTxt\">Salaat</span> upon the (deceased) men, and the women. He<sup>asws</sup> said: ‘They would place the (deceased) men in front and the (deceased) women behind the men’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad Ahmad ibn Muhammad from ibn abu Nasr from al-‘Ala’ ibn Razin from Muhammad ibn Muslim who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about performing Salah (prayer) for the dead bodies of men and women. He (the Imam) said, ’The dead bodies of men are placed near men and those of women behind the (dead) men.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/25)"
        ],
        "index": 4452,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/964",
              "text": "مُحَمَّدِ بْنِ أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/748",
              "text": "أَحْمَدَ بْنِ الْحَسَنِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/749",
              "text": "عَمْرِو بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/750",
              "text": "مُصَدِّقِ بْنِ صَدَقَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/751",
              "text": "عَمَّارٍ السَّابَاطِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " فِي"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ أَحْمَدَ بْنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ مُصَدِّقِ بْنِ صَدَقَةَ عَنْ عَمَّارٍ السَّابَاطِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:45:2",
        "text": [
          " الرَّجُلِ يُصَلِّي عَلَى مَيِّتَيْنِ أَوْ ثَلَاثَةِ أَمْوَاتٍ كَيْفَ يُصَلِّي عَلَيْهِمْ قَالَ إِنْ كَانَ ثَلَاثَةً أَوِ اثْنَيْنِ أَوْ عَشَرَةً أَوْ أَكْثَرَ مِنْ ذَلِكَ فَلْيُصَلِّ عَلَيْهِمْ صَلَاةً وَاحِدَةً يُكَبِّرُ عَلَيْهِمْ خَمْسَ تَكْبِيرَاتٍ كَمَا يُصَلِّي عَلَى مَيِّتٍ وَاحِدٍ وَ قَدْ صَلَّى عَلَيْهِمْ جَمِيعاً ",
          "يَضَعُ مَيِّتاً وَاحِداً ثُمَّ يَجْعَلُ الْآخَرَ إِلَى أَلْيَةِ الْأَوَّلِ ثُمَّ يَجْعَلُ رَأْسَ الثَّالِثِ إِلَى أَلْيَةِ الثَّانِي شِبْهَ الْمَدْرَجِ حَتَّى يَفْرُغَ مِنْهُمْ كُلِّهِمْ مَا كَانُوا فَإِذَا سَوَّاهُمْ هَكَذَا قَامَ فِي الْوَسَطِ فَكَبَّرَ خَمْسَ تَكْبِيرَاتٍ يَفْعَلُ كَمَا يَفْعَلُ إِذَا صَلَّى عَلَى مَيِّتٍ وَاحِدٍ ",
          "سُئِلَ فَإِنْ كَانَ الْمَوْتَى رِجَالًا وَ نِسَاءً قَالَ يَبْدَأُ بِالرِّجَالِ فَيَجْعَلُ رَأْسَ الثَّانِي إِلَى أَلْيَةِ الْأَوَّلِ حَتَّى يَفْرُغَ مِنَ الرِّجَالِ كُلِّهِمْ ثُمَّ يَجْعَلُ رَأْسَ الْمَرْأَةِ إِلَى أَلْيَةِ الرَّجُلِ الْأَخِيرِ ثُمَّ يَجْعَلُ رَأْسَ الْمَرْأَةِ الْأُخْرَى إِلَى أَلْيَةِ الْمَرْأَةِ الْأُولَى حَتَّى يَفْرُغَ مِنْهُمْ كُلِّهِمْ ",
          "فَإِذَا سَوَّى هَكَذَا قَامَ فِي الْوَسَطِ وَسَطِ الرِّجَالِ فَكَبَّرَ وَ صَلَّى عَلَيْهِمْ كَمَا يُصَلِّي عَلَى مَيِّتٍ وَاحِدٍ ",
          "وَ سُئِلَ عَنْ مَيِّتٍ صُلِّيَ عَلَيْهِ فَلَمَّا سَلَّمَ الْإِمَامُ فَإِذَا الْمَيِّتُ مَقْلُوبٌ رِجْلَاهُ إِلَى مَوْضِعِ رَأْسِهِ قَالَ يُسَوَّى وَ تُعَادُ الصَّلَاةُ عَلَيْهِ وَ إِنْ كَانَ قَدْ حُمِلَ مَا لَمْ يُدْفَنْ فَإِنْ كَانَ قَدْ دُفِنَ فَقَدْ مَضَتِ الصَّلَاةُ لَا يُصَلَّى عَلَيْهِ وَ هُوَ مَدْفُونٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Ahmad Bin Al Hassan Bin Ali, from Amro Bin Saeed, from Musaddaq Bin Sadaqa, from Ammar Al Sabaty, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the man who (wants to) pray <span class=\"iTxt\">Salaat</span> over two dead bodies, or three dead bodies, how should he pray <span class=\"iTxt\">Salaat</span> over them. He<sup>asws</sup> said: ‘If there were three, or two, or ten, or more than that, so let his pray <span class=\"iTxt\">Salaat</span> over them as one <span class=\"iTxt\">Salaat</span>, exclaiming five <span class=\"iTxt\">Takbeer</span>s upon them just as he would pray upon one deceased, and he would have prayed over them altogether. ",
            "He should place one dead body, them make the other one to be parallel to the first, then make the head of the third one parallel to the second like a staircase, until he is free from all of them, whatever (their number) would be. So when he has arranged them like this, he should stand in the middle and exclaim five <span class=\"iTxt\">Takbeer</span>s, doing just as he would do when he prays <span class=\"iTxt\">Salaat</span> over one dead body’. ",
            "He<sup>asws</sup> was asked, ‘Supposing the deceased were men and women?’ He<sup>asws</sup> said: ‘He should begin with the men, and place the head of the second one parallel to the first until he was free from the men, all of them. Then he should make the head of the woman to be parallel to the last man, then make the head of the next woman to be parallel to the first woman, until he is free from them, all of them. ",
            "So when he has arranged like this, he should stand in the middle, the middle of the men, and he should exclaim <span class=\"iTxt\">Takbeer</span>s and pray <span class=\"iTxt\">Salaat</span> over them just as he would pray upon one deceased’.",
            "And he<sup>asws</sup> was asked about a deceased who had been prayed upon, so when the prayer leader concluded, it was so that its feet were in place of its head. He<sup>asws</sup> said: ‘It should be corrected and the <span class=\"iTxt\">Salaat</span> would be repeated upon him, and even if he had been carried, so long as he had not been buried yet. So if it was so that he had been buried, so the <span class=\"iTxt\">Salaat</span> would have expired, and he would not be prayed upon and he is already buried’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Muhammad ibn Ahmad from Ahmad ibn al-Husayn from Ali ibn ‘Amr ibn Sa‘id from Musaddiq ibn Sadaqah from ‘Ammar al-Sabatiy who has said the following: “I once asked abu ’Abd Allah, ‘Alayhi al-Salam, about the case of one who performs Salah (prayer) for one or two or three dead bodies, how is he to perform them. He (the Imam) said, ‘If there are three or two or ten or less or more, he performs one Salah (prayer) with five Takbir (Allah is great beyond description) just as it is done for one deceased, and in so doing one has performed Salah (prayer) for all of them. The body of one deceased man is placed on the ground, the other is placed parallel to the hips of the first one and the head of the third is placed parallel to the hips of the second one similar to a ladder, until all of them are in place. When this is done, he then stands up in the middle and says five Takbir (Allah is great beyond description) doing what is done for one deceased person.’ It then was asked, ‘How Salah (prayer) is performed if there are the dead bodies of both men and women. He (the Imam) said, ‘First, the bodies of men are arranged by placing the head of the second dead body parallel to the hips of the first one. When all the bodies of men are arranged in this way, then the head of the dead body of the first woman is placed parallel to the hips of the dead body of the last man, then the head of the other woman parallel to the hips of the first woman until all of them are arranged in this way. Then he stands in the middle, the middle of men, says Takbir (Allah is great beyond description) and performs Salah (prayer) for them just as performing Salah (prayer) for one deceased person.’ He (the Imam) was asked about the case of a dead body that was found after Salah (prayer) with his head in place of his leg. He (the Imam) said, ‘It is corrected and Salah (prayer) is performed again, even if the body is carried away but is not buried yet. Once the body is buried, time of Salah (prayer) is passed, and Salah (prayer) is not performed after burial.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/28)"
        ],
        "index": 4453,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/31",
              "text": "مُحَمَّدِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/200",
              "text": "طَلْحَةَ بْنِ زَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:45:3",
        "text": [
          " كَانَ إِذَا صَلَّى عَلَى الْمَرْأَةِ وَ الرَّجُلِ قَدَّمَ الْمَرْأَةَ وَ أَخَّرَ الرَّجُلَ وَ إِذَا صَلَّى عَلَى الْعَبْدِ وَ الْحُرِّ قَدَّمَ الْعَبْدَ وَ أَخَّرَ الْحُرَّ وَ إِذَا صَلَّى عَلَى الْكَبِيرِ وَ الصَّغِيرِ قَدَّمَ الصَّغِيرَ وَ أَخَّرَ الْكَبِيرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Sinan, from Talha Bin Zayd, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whenever you pray <span class=\"iTxt\">Salaat</span> upon the woman and the man, so precede the woman and delay the man; and when you pray <span class=\"iTxt\">Salaat</span> upon the slave and the free one, so preceded the slave and delay the free one; and when you pray <span class=\"iTxt\">Salaat</span> upon the old and the young, so precede the young and delay the old’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn Sinan from Talhah ibn Zayd who has said the following: “When abu ‘Abd Allah, ‘Alayhi al-Salam, performed Salah (prayer) for a deceased man and a deceased woman, he (the Imam) would set forward woman, then the man. In the case of a slave and a free person, he (the Imam) would set forward the slave, then the free: and in the case of grown up and a minor, he set forward the minor then the grown up.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/29)"
        ],
        "index": 4454,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/170",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1409",
              "text": "الْعَلَاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/497",
              "text": "أَحَدِهِمَا ( عليهما السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ الْعَلَاءِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:45:4",
        "text": [
          " سَأَلْتُهُ عَنِ الرِّجَالِ وَ النِّسَاءِ كَيْفَ يُصَلَّى عَلَيْهِمْ قَالَ الرِّجَالُ أَمَامَ النِّسَاءِ مِمَّا يَلِي الْإِمَامَ يُصَفُّ بَعْضُهُمْ عَلَى أَثَرِ بَعْضٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Al A’ala, from Muhammad Bin Muslim, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>), said, ‘I asked him<sup>asws</sup> about the men and the women, how to pray <span class=\"iTxt\">Salaat</span> upon them. He<sup>asws</sup> said: ‘The men in front of the women from what is parallel to the prayer leader. They would be placed in a row following each other’."
          ],
          "en.sarwar": [
            "4. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from al-‘Ala’ from Muhammad ibn Muslim who has said the following: “I once asked one of the two Imam, (abu Ja‘far or abu ‘Abd Allah), ‘Alayhim al-Salam, about the case of deceased men and women as to how Salah (prayer) is performed for them. He (the Imam) said, ‘Men are placed before women from the side of the Imam in a queue one after the other.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/29)"
        ],
        "index": 4455,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/249",
              "text": "ابْنِ بُكَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/42",
              "text": "بَعْضِ أَصْحَابِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " فِي"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:45:5",
        "text": [
          " جَنَائِزِ الرِّجَالِ وَ الصِّبْيَانِ وَ النِّسَاءِ قَالَ يَضَعُ النِّسَاءَ مِمَّا يَلِي الْقِبْلَةَ وَ الصِّبْيَانَ دُونَهُمْ وَ الرِّجَالَ دُونَ ذَلِكَ وَ يَقُومُ الْإِمَامُ مِمَّا يَلِي الرِّجَالَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Fazzal, from Ibn Bukeyr, from one of his companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the funerals of the men, and the children, and the women. He<sup>asws</sup> said: ‘The (deceased) women would be placed parallel to the Qiblah, and the children besides them, and the men besides that, and the prayer leader would stand from what is parallel to the men’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn Faddal from ibn Bukayr from certain persons of his people who has said the following: “About the case of the dead bodies of men, children and women, abu ’Abd Allah, ‘Alayhi al-Salam, has said, ‘Women are placed first from the direction of al-Qiblah (al-Ka‘bah). Then the children, and then men are placed, and the Imam stands next to the dead bodied of men.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل كالموثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/29)"
        ],
        "index": 4456,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1407",
              "text": "حُمَيْدُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1408",
              "text": "الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/212",
              "text": "غَيْرِ وَاحِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/257",
              "text": "أَبَانِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/785",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:45:6",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ جَنَائِزِ الرِّجَالِ وَ النِّسَاءِ إِذَا اجْتَمَعَتْ فَقَالَ يُقَدَّمُ الرِّجَالُ فِي كِتَابِ عَلِيٍّ ( عليه السلام )."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from someone else, from Aban Bin Usman, from Abdul Rahman Bin Abdullah who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the funerals of the men and the women when they are together. So he<sup>asws</sup> said: ‘The men are preceded with, (it is so) in the Book of Ali<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "6. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad ibn Sama‘ah from more than one person from Aban ibn ‘Uthman from ‘Abd al-Rahman ibn abu ‘Abd Allah who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of the dead bodies of men and women collected together. He (the Imam) said, ‘The dead bodied of men are placed first, according to the book of Ali, ‘Alayhi al-Salam.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:3:45",
  "kind": "verse_list"
}