{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 54"
        },
        "path": "/books/al-kafi:3:3:54",
        "titles": {
          "ar": "باب الصَّلَاةِ عَلَى الْمُؤْمِنِ وَ التَّكْبِيرِ وَ الدُّعَاءِ",
          "en": "Chapter 54 – The Salaat upon the Believer, and the exclamation of the Takbeer and the supplication"
        }
      }
    ],
    "index": 626,
    "local_index": 54,
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:3:54",
    "titles": {
      "ar": "باب الصَّلَاةِ عَلَى الْمُؤْمِنِ وَ التَّكْبِيرِ وَ الدُّعَاءِ",
      "en": "Chapter 54 – The Salaat upon the Believer, and the exclamation of the Takbeer and the supplication"
    },
    "verse_count": 6,
    "verse_start_index": 4484,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/51)"
        ],
        "index": 4485,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:54:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ أُورَمَةَ عَنْ زُرْعَةَ بْنِ مُحَمَّدٍ عَنْ سَمَاعَةَ قَالَ سَأَلْتُهُ عَنِ الصَّلَاةِ عَلَى الْمَيِّتِ فَقَالَ تُكَبِّرُ خَمْسَ تَكْبِيرَاتٍ تَقُولُ أَوَّلَ مَا تُكَبِّرُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ عَلَى الْأَئِمَّةِ الْهُدَاةِ وَ اغْفِرْ لَنَا وَ لِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَ لَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِلَّذِينَ آمَنُوا ",
          "رَبَّنَا إِنَّكَ رَءُوفٌ رَحِيمٌ اللَّهُمَّ اغْفِرْ لِأَحْيَائِنَا وَ أَمْوَاتِنَا مِنَ الْمُؤْمِنِينَ وَ الْمُؤْمِنَاتِ وَ أَلِّفْ قُلُوبَنَا عَلَى قُلُوبِ أَخْيَارِنَا وَ اهْدِنَا لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ ",
          "فَإِنْ قَطَعَ عَلَيْكَ التَّكْبِيرَةُ الثَّانِيَةُ فَلَا يَضُرُّكَ تَقُولُ اللَّهُمَّ عَبْدُكَ ابْنُ عَبْدِكَ وَ ابْنُ أَمَتِكَ أَنْتَ أَعْلَمُ بِهِ مِنِّي افْتَقَرَ إِلَى رَحْمَتِكَ وَ اسْتَغْنَيْتَ عَنْهُ اللَّهُمَّ فَتَجَاوَزْ عَنْ سَيِّئَاتِهِ وَ زِدْ فِي إِحْسَانِهِ وَ اغْفِرْ لَهُ وَ ارْحَمْهُ وَ نَوِّرْ لَهُ فِي قَبْرِهِ وَ لَقِّنْهُ حُجَّتَهُ وَ أَلْحِقْهُ بِنَبِيِّهِ ( صلى الله عليه وآله ) وَ لَا تَحْرِمْنَا أَجْرَهُ وَ لَا تَفْتِنَّا بَعْدَهُ ",
          "تَقُولُ هَذَا حَتَّى تَفْرُغَ مِنْ خَمْسِ تَكْبِيرَاتٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Awrama, from Zur’at Bin Muhammad, from Sama’at who said, ",
            "‘I asked him<sup>asws</sup> about the <span class=\"iTxt\">Salaat</span> upon the deceased, so he<sup>asws</sup> said: ‘Exclaim five <span class=\"iTxt\">Takbeer</span>s saying in the first of the <span class=\"iTxt\">Takbeer</span>s, ‘I testify that there is no God except for Allah<sup>azwj</sup>, Alone, there being no associates to him, and I testify that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Rasool<sup>saww</sup>. O Allah<sup>azwj</sup>, Send Blessings upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> and upon the Imams<sup>asws</sup> of Guidance, and Forgive us and our brethren who preceded us with the faith, and do not Make rancor to be in our hears for those who believe. ",
            "Our Lord<sup>azwj</sup>! You<sup>azwj</sup> are Gracious, Merciful. O Allah<sup>azwj</sup>! Forgive our living ones and our dead ones from the beliving men and the believing women, and Make our hearts to be fond upon the hearts of our good ones, and Guide us to what we are differing in, from the Truth, by Your<sup>azwj</sup> Permission. You<sup>azwj</sup> Guide whoever You<sup>azwj</sup> so Desire to the Straight Path’. ",
            "So if the second exclamation of <span class=\"iTxt\">Takbeer</span> cuts off upon you, it would not harm you. You should be saying, ‘O Allah<sup>azwj</sup>! (This is) Your<sup>azwj</sup> servant, son of Your<sup>azwj</sup> servant, and son of Your<sup>azwj</sup> Maid. You<sup>azwj</sup> are more Knowing of him than I am. He is needy to Your<sup>azwj</sup> Mercy and You<sup>azwj</sup> are Needless from him. O Allah<sup>azwj</sup>! Overlook from his sins and Increase in his good deeds and Forgive him, and be Merciful to him, and Illuminate for him in his grave, and Cause him to meet his Proof<sup>asws</sup> and meet up with his Prophet<sup>saww</sup>, and do not Deprive us from its Recompense and not do Try us after him’. ",
            "You should be saying this until you are free from the five <span class=\"iTxt\">Takbeer</span>s’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn ’Uramah from Zur‘ah, from Muhammad ibn Sanaa ‘ah in a Muzmar manner has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about Salah (prayer) for a deceased. He (the Imam) said, ‘You must say five Takbir (Allah is great beyond description) in this Salah (prayer). After first Takbir (Allah is great beyond description) say, “I testify that only Allah deserves worship, He is one and has no partners and I testify that Muhammad is His servant and Messenger. O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause and to ’A’immah who provide right guidance and forgive us, our brothers who were believers before us and do not allow jealousy against the believers to enter our hearts. O Lord, You are compassionate and merciful. O Lord grant forgiveness to our living people, to those who have died of the male, female believing people, place kindness in our hearts, those of the virtuous ones among us and grant us guidance in the disputed matters of the issues of truth by Your permission; You guide, whomever You will, to the right path.” If the second Takbir is said (before you complete the above sayings), it is not harmful.You then say, “O Lord, this is Your servant, son of Your male and female servants. You know better than I about him do. He needs to receive mercy from You and You do not need him. O Lord forgive his sins, increase his good deeds, forgive him, have mercy upon him, lightup his grave, dictate to him his good argument, join him with his Holy prophet, do not deprive us of receiving rewards because of him and do not put us to trials after him.” Say this until you complete all five Takbir.’” (According to this Hadith there are five Takbir and after every Takbir there are the above recitations, which consist of the two testimonies, Salawat (O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause), prayer for the believers and prayer for the deceased). "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/54)"
        ],
        "index": 4486,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:54:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الصَّلَاةِ عَلَى الْمَيِّتِ قَالَ تُكَبِّرُ ثُمَّ تُصَلِّي عَلَى النَّبِيِّ ( صلى الله عليه وآله ) ثُمَّ تَقُولُ اللَّهُمَّ عَبْدُكَ ابْنُ عَبْدِكَ ابْنُ أَمَتِكَ لَا أَعْلَمُ مِنْهُ إِلَّا خَيْراً وَ أَنْتَ أَعْلَمُ بِهِ مِنِّي اللَّهُمَّ إِنْ كَانَ مُحْسِناً فَزِدْ فِي إِحْسَانِهِ وَ تَقَبَّلْ مِنْهُ وَ إِنْ كَانَ مُسِيئاً فَاغْفِرْ لَهُ ذَنْبَهُ وَ ارْحَمْهُ وَ افْسَحْ لَهُ فِي قَبْرِهِ وَ اجْعَلْهُ مِنْ رُفَقَاءِ مُحَمَّدٍ ( صلى الله عليه وآله ) ",
          "ثُمَّ تُكَبِّرُ الثَّانِيَةَ وَ تَقُولُ اللَّهُمَّ إِنْ كَانَ زَاكِياً فَزَكِّهِ وَ إِنْ كَانَ خَاطِئاً فَاغْفِرْ لَهُ ",
          "ثُمَّ تُكَبِّرُ الثَّالِثَةَ وَ تَقُولُ اللَّهُمَّ لَا تَحْرِمْنَا أَجْرَهُ وَ لَا تَفْتِنَّا بَعْدَهُ ",
          "ثُمَّ تُكَبِّرُ الرَّابِعَةَ وَ تَقُولُ اللَّهُمَّ اكْتُبْهُ عِنْدَكَ فِي عِلِّيِّينَ وَ اخْلُفْ عَلَى عَقِبِهِ فِي الْغَابِرِينَ وَ اجْعَلْهُ مِنْ رُفَقَاءِ مُحَمَّدٍ ( صلى الله عليه وآله ) ",
          "ثُمَّ تُكَبِّرُ الْخَامِسَةَ وَ انْصَرِفْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, from Zurara, ",
            "from Abu Abdullah<sup>asws</sup> regarding the <span class=\"iTxt\">Salaat</span> upon the deceased. He<sup>asws</sup> said: ‘You should exclaim <span class=\"iTxt\">Takbeer</span>, then send Blessings upon the Prophet<sup>saww</sup>, then you should be saying, ‘O Allah<sup>azwj</sup>! (This is) Your<sup>azwj</sup> servant, son of Your<sup>azwj</sup> servant, son of Your<sup>azwj</sup> maid. I do not know from him except for the goodness and You<sup>azwj</sup> are more Knowing of him than I am. O Allah<sup>azwj</sup>! If he was a good doer, so Increase in his good deeds and Accept from him; and if he was an evil doer, so Forgive his sins for him and be Merciful to him, and Expand his grave for him and Make him to be from the friends of Muhammad<sup>saww</sup>’. ",
            "Then you should exclaim the second <span class=\"iTxt\">Takbeer</span> and say, ‘O Allah<sup>azwj</sup>! If he was pure, so Purify him (more), and if he was erroneous, so Forgive him’. ",
            "Then you should exclaim the third <span class=\"iTxt\">Takbeer</span> and say, ‘O Allah<sup>azwj</sup>! Do not Deprive us of its Recompense and do not Try us after him’. ",
            "Then you should exclaim the fourth <span class=\"iTxt\">Takbeer</span> and say, ‘O Allah<sup>azwj</sup>! Write Your<sup>azwj</sup> servant in the Illiyeen and Replace him in his offspring among the ancients and Make him to be among the friends of Muhammad<sup>saww</sup>’. ",
            "Then exclaim the fifth <span class=\"iTxt\">Takbeer</span> and leave’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy from Zurarah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘In Salah (prayer) for a deceased say Takbir (Allah is great beyond description), then say, “O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause,” then say, “O Lord, this is Your servant the son of Your male and a female servant. I do not know about him except good but You know more about him than I know. O Lord if he is a person of good deeds, increase his good deeds, but if he is a person of bad deeds, forgive his sins, grant him mercy, make his grave spacious and make him of the friends of Muhammad, O Allah grant compensation to Muhammad and his family worthy of their services to Your cause.” Then say the second Takbir (Allah is great beyond description). Then say, “O Lord, if he is a person of purity, purify him but if he is a sinner forgive him.” Then say the third Takbir (Allah is great beyond description) and say, “O Lord, do not deprive us of receiving rewards because of him and do not put us to trial after him.” Then say the fourth Takbir (Allah is great beyond description). Then say, “O Lord, write him (his name) with You among those of high status and replace him in his children whom he has left behind and make him of the friends of Muhammad, O Allah grant compensation to Muhammad and his family worthy of their services to Your cause.” Then say the fifth Takbir (Allah is great beyond description) and end the Salah (prayer).’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/58)"
        ],
        "index": 4487,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:54:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي وَلَّادٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ التَّكْبِيرِ عَلَى الْمَيِّتِ فَقَالَ خَمْسٌ تَقُولُ فِي أُولَيهُنَّ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ ",
          "ثُمَّ تَقُولُ اللَّهُمَّ إِنَّ هَذَا الْمُسَجَّى قُدَّامَنَا عَبْدُكَ وَ ابْنُ عَبْدِكَ وَ قَدْ قَبَضْتَ رُوحَهُ إِلَيْكَ وَ قَدِ احْتَاجَ إِلَى رَحْمَتِكَ وَ أَنْتَ غَنِيٌّ عَنْ عَذَابِهِ اللَّهُمَّ إِنَّا لَا نَعْلَمُ مِنْ ظَاهِرِهِ إِلَّا خَيْراً وَ أَنْتَ أَعْلَمُ بِسَرِيرَتِهِ اللَّهُمَّ إِنْ كَانَ مُحْسِناً فَزِدْ فِي إِحْسَانِهِ وَ إِنْ كَانَ مُسِيئاً فَتَجَاوَزْ عَنْ سَيِّئَاتِهِ ",
          "ثُمَّ تُكَبِّرُ الثَّانِيَةَ وَ تَفْعَلُ ذَلِكَ فِي كُلِّ تَكْبِيرَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and a number of our companions, from Sahl Bin Ziyad, altogether from Ibn Mahboub, from Abu Wallad who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the exclamations of <span class=\"iTxt\">Takbeer</span> upon the deceased, so he<sup>asws</sup> said: ‘Five. You should be saying in the first of these, ‘I testify that there is no God except for Allah<sup>azwj</sup>, Alone, there being no associates for him. O Allah<sup>azwj</sup>! Send Blessings upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad’. ",
            "Then you should be saying, ‘O Allah<sup>azwj</sup>! This enshrouded one in front of us is Your<sup>azwj</sup> servant, and a son of Your<sup>azwj</sup> servant, and his sould has been Captured to (come) to You<sup>azwj</sup>, and he is needy to Your<sup>azwj</sup> Mercy and You<sup>azwj</sup> Needless from Punishing him. O Allah<sup>azwj</sup>! We deo not know from his apparent except for goodness and You<sup>azwj</sup> are more Knowing of his secrets. O Allah<sup>azwj</sup>! If he was a good doer, so Increase in his good eeds; and if he was an evil doer, so Overlook from his sins’. ",
            "Then exclaim the second <span class=\"iTxt\">Takbeer</span> and you should do that during each <span class=\"iTxt\">Takbeer</span>’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from a number of our people have narrated from Sahl ibn Ziyad all from ibn Mahbub from abu Wallad who has said the following: “I once asked abu ’Abd Allah, ‘Alayhi al-Salam, about Takbir over a deceased person. He (the Imam) said, ‘There are five Takbir. In the first one say, “I testify that only Allah deserves worship, He is one and has no partners and I testify that Muhammad is His servant and Messenger. O Allah, I pray to You to grant compensation to Muhammad and his family worthy of their services to Your cause.” Then say, “O Lord, this person, shrouded in front of us, is your servant and the son of Your servant whose soul You have taken to Yourself, and he is in need for your mercy and You do not need his being punished. O Lord, if he is a person of good deeds, increase his good deeds; if he is a person of bad deeds, forgive his sins.” Then say the second Takbir and do the same after every Takbir.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/58)"
        ],
        "index": 4488,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:54:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تُكَبِّرُ ثُمَّ تَشَهَّدُ ثُمَّ تَقُولُ إِنَّا لِلَّهِ وَ إِنَّا إِلَيْهِ رَاجِعُونَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ رَبِّ الْمَوْتِ وَ الْحَيَاةِ صَلِّ عَلَى مُحَمَّدٍ وَ أَهْلِ بَيْتِهِ جَزَى اللَّهُ عَنَّا مُحَمَّداً خَيْرَ الْجَزَاءِ بِمَا صَنَعَ بِأُمَّتِهِ وَ بِمَا بَلَّغَ مِنْ رِسَالَاتِ رَبِّهِ ",
          "ثُمَّ تَقُولُ اللَّهُمَّ عَبْدُكَ ابْنُ عَبْدِكَ ابْنُ أَمَتِكَ نَاصِيَتُهُ بِيَدِكَ خَلَا مِنَ الدُّنْيَا وَ احْتَاجَ إِلَى رَحْمَتِكَ وَ أَنْتَ غَنِيٌّ عَنْ عَذَابِهِ اللَّهُمَّ إِنَّا لَا نَعْلَمُ مِنْهُ إِلَّا خَيْراً وَ أَنْتَ أَعْلَمُ بِهِ اللَّهُمَّ إِنْ كَانَ مُحْسِناً فَزِدْ فِي إِحْسَانِهِ وَ تَقَبَّلْ مِنْهُ وَ إِنْ كَانَ مُسِيئاً فَاغْفِرْ لَهُ ذَنْبَهُ وَ ارْحَمْهُ وَ تَجَاوَزْ عَنْهُ بِرَحْمَتِكَ ",
          "اللَّهُمَّ أَلْحِقْهُ بِنَبِيِّكَ وَ ثَبِّتْهُ بِالْقَوْلِ الثَّابِتِ فِي الْحَيَاةِ الدُّنْيَا وَ فِي الْآخِرَةِ اللَّهُمَّ اسْلُكْ بِنَا وَ بِهِ سَبِيلَ الْهُدَى وَ اهْدِنَا وَ إِيَّاهُ صِرَاطَكَ الْمُسْتَقِيمَ اللَّهُمَّ عَفْوَكَ عَفْوَكَ ",
          "ثُمَّ تُكَبِّرُ الثَّانِيَةَ وَ تَقُولُ مِثْلَ مَا قُلْتَ حَتَّى تَفْرُغَ مِنْ خَمْسِ تَكْبِيرَاتٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "from Abu Abdullah<sup>asws</sup> having said: ‘You should exclaim <span class=\"iTxt\">Takbeer</span>, then you should testify, then you should be saying, ‘We are from Allah<sup>azwj</sup> and to Him<sup>azwj</sup> we are returning. The Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds, Lord<sup>azwj</sup> of the death and the life. Send Blessings upon Muhammad<sup>azwj</sup> and the People<sup>asws</sup> of His<sup>azwj</sup> Household. O Allah<sup>azwj</sup>! Recompense Muhammad<sup>saww</sup> with the best of the Recompense due to what he<sup>saww</sup> did with his<sup>saww</sup> community, and due to what he<sup>saww</sup> delivered from the Message of his<sup>saww</sup> Lord<sup>azwj</sup>’. ",
            "Then you should be saying, ‘O Allah<sup>azwj</sup>! (This here is) Your<sup>azwj</sup> servant, a son of Your<sup>azwj</sup> servant, a son of Your<sup>azwj</sup> maid. His forehead is in Your<sup>azwj</sup> Hands, having vacated from the world and is needy to Your<sup>azwj</sup> Mercy, and You<sup>azwj</sup> are Needless from Punishing him. O Allah<sup>azwj</sup>! We do not know from him except for goodness and You<sup>azwj</sup> are more Knowing with him. O Allah<sup>azwj</sup>! If he was a good does, so Increase in his good deeds, and Accept from him; and if he was an evil doers, so Forgive his sins for him and be Merciful to him, and Overlook (his faults) from him by Your<sup>azwj</sup> Mercy. ",
            "O Allah<sup>azwj</sup>! Attach him with Your<sup>azwj</sup> Prophet<sup>saww</sup> and Affirm him with the firm Words in the life of the world and in the Hereafter. O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> by us and by him, the Way of Guidance, and Guide us and him to Your<sup>azwj</sup> Straight Path. O Allah<sup>azwj</sup>! Your<sup>azwj</sup> Forgiveness! Your<sup>azwj</sup> Forgiveness!’",
            "Then exclaim the second <span class=\"iTxt\">Takbeer</span> and you should be saying the like of what you said, until you are free from five <span class=\"iTxt\">Takbeer</span>s’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘ Umayr from Hammad from al-Halabiy who has said the following: Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘In Salah (prayer) for a deceased say Takbir (Allah is great beyond description) and the testimony and say, “We are from Allah and to Allah we return. All praise belongs to Allah, Lord of the worlds, Lord of death and life. O Allah, I pray to You to grant compensation to Muhammad and his family worthy of their services to Your cause. O Allah I pray to You to grant Muhammad the best of rewards for his favors to his followers and for his preaching the message of his Lord.” Then say, “O Lord, this is Your servant, the son of Your male and a female servant. His forehead is in Your control. He has left this world, he is in need of Your mercy, and You do not need his being punished. O Lord, we do not know about him anything except good; but You know more about him than we know. O Lord, if he is a person of good deeds, increase his good deeds. If he is a person of bad deeds, forgive his sins, grant him mercy, forgive him through your mercy, join him with your Holy prophet, and keep him on the unchangeable word in the worldly life and in the hereafter. O Lord, make us to walk on the path of guidance and guide him and us to the right path. O Lord, grant (us) forgiveness, O Lord grant (us) forgiveness.” Then say the second Takbir. Repeat what you have said after every Takbir (Allah is great beyond description) until you say all five Takbir (Allah is great beyond description).’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/61)"
        ],
        "index": 4489,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:54:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ قَالَ سَأَلْتُ الرِّضَا ( عليه السلام ) قُلْتُ جُعِلْتُ فِدَاكَ إِنَّ النَّاسَ يَرْفَعُونَ أَيْدِيَهُمْ فِي التَّكْبِيرِ عَلَى الْمَيِّتِ فِي التَّكْبِيرَةِ الْأُولَى وَ لَا يَرْفَعُونَ فِيمَا بَعْدَ ذَلِكَ فَأَقْتَصِرُ عَلَى التَّكْبِيرَةِ الْأُولَى كَمَا يَفْعَلُونَ أَوْ أَرْفَعُ يَدَيَّ فِي كُلِّ تَكْبِيرَةٍ فَقَالَ ارْفَعْ يَدَكَ فِي كُلِّ تَكْبِيرَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Isa, from Yunus who said, ",
            "‘I asked Al Reza<sup>asws</sup> saying, ‘May I be sacrificed for you<sup>asws</sup>! The people are raising their hands during the exclamations of the <span class=\"iTxt\">Takbeer</span> upon the deceased during the first <span class=\"iTxt\">Takbeer</span> (only) and are not raising their hand in what is after that (the other four <span class=\"iTxt\">Takbeer</span>s). So, shall I restrict myself upon the first <span class=\"iTxt\">Takbeer</span> just as they are doing, or shall I raise my hands during every <span class=\"iTxt\">Takbeer</span>?’ So he<sup>asws</sup> said: ‘Raise your hands during every <span class=\"iTxt\">Takbeer</span>’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn ‘Isa from Yunus who has said the following: “I once asked al-Rida’, ‘Alayhi al-Salam, saying, ‘I pray to Allah to keep my soul in service for your cause. People raise their hands during the first Takbir (Allah is great beyond description) in Salah (prayer) for a deceased but not in the rest of Takbir and if should I raise my hand in the first Takbir only or in all Takbir. He (the Imam) said, ‘Raise your hand in all Takbir.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/61)"
        ],
        "index": 4490,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:54:6",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَسَنِ عَنْ أَحْمَدَ بْنِ عَبْدِ الرَّحِيمِ أَبِي الصَّخْرِ عَنْ إِسْمَاعِيلَ بْنِ عَبْدِ الْخَالِقِ بْنِ عَبْدِ رَبِّهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الصَّلَاةِ عَلَى الْجَنَائِزِ تَقُولُ اللَّهُمَّ أَنْتَ خَلَقْتَ هَذِهِ النَّفْسَ وَ أَنْتَ أَمَتَّهَا تَعْلَمُ سِرَّهَا وَ عَلَانِيَتَهَا أَتَيْنَاكَ شَافِعِينَ فِيهَا فَشَفِّعْنَا اللَّهُمَّ وَلِّهَا مَنْ تَوَلَّتْ وَ احْشُرْهَا مَعَ مَنْ أَحَبَّتْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Ali Bin Al Hassan, from Ahmad Bin Abdul Raheem Abu Al Sakhar, from Ismail Bin Abdul Khaliq Bin Abd Rabbih, ",
            "from Abu Abdullah<sup>asws</sup>: ‘Regarding the <span class=\"iTxt\">Salaat</span> upon the deceased, you should be saying, ‘O Allah<sup>azwj</sup>! You<sup>azwj</sup> Created this self and You<sup>azwj</sup> Caused it to die. You<sup>azwj</sup> Know its secrets and its public matters. We come to you inteceding with regards to it, therefore, Accept out intercession. O Allah<sup>azwj</sup>! Let it be governed by the ones it accepted as rulers and Resurrect it along with the ones it loved’."
          ],
          "en.sarwar": [
            "6. Ali ibn Muhammad has narrated from Ali ibn al-Hassan from Ahmad ibn ‘Abd al-Rahim abu al-Sakhr from ’Isma‘il ibn ‘Abd al- Khaliq ibn ‘Abd Rabbihi who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘In Salah (prayer) for a deceased say, ‘O Lord, You have created this soul and You have caused it to die. You know all of its secret and public matters. We have come to You to mediate before You in his favor, so accept our intercession. O Lord, entrust it with those whom it took as supreme power and raise it with those whom it loved.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:3:54",
  "kind": "verse_list"
}