{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 57"
        },
        "path": "/books/al-kafi:3:3:57",
        "titles": {
          "ar": "باب الصَّلَاةِ عَلَى الْمُسْتَضْعَفِ وَ عَلَى مَنْ لَا يَعْرِفُ",
          "en": "Chapter 57 – The Salaat upon the weak ones (of understanding) and upon the one who did not recognise (the Wilayah)"
        }
      }
    ],
    "index": 629,
    "local_index": 57,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 58"
        },
        "path": "/books/al-kafi:3:3:58",
        "titles": {
          "ar": "باب الصَّلَاةِ عَلَى النَّاصِبِ",
          "en": "Chapter 58 – The Salaat upon the Hostile one (Nasibi)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 56"
        },
        "path": "/books/al-kafi:3:3:56",
        "titles": {
          "ar": "باب مَنْ زَادَ عَلَى خَمْسِ تَكْبِيرَاتٍ",
          "en": "Chapter 56 – The one who exceeds upon the five Takbeers"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:3:57",
    "titles": {
      "ar": "باب الصَّلَاةِ عَلَى الْمُسْتَضْعَفِ وَ عَلَى مَنْ لَا يَعْرِفُ",
      "en": "Chapter 57 – The Salaat upon the weak ones (of understanding) and upon the one who did not recognise (the Wilayah)"
    },
    "verse_count": 6,
    "verse_start_index": 4496,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/67)"
        ],
        "index": 4497,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:57:1",
        "refs": {
          "Mentions": [
            "/books/quran:40:8",
            "/books/quran:40:7"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ الصَّلَاةُ عَلَى الْمُسْتَضْعَفِ وَ الَّذِي لَا يَعْرِفُ الصَّلَاةُ عَلَى النَّبِيِّ ( صلى الله عليه وآله ) وَ الدُّعَاءُ لِلْمُؤْمِنِينَ وَ الْمُؤْمِنَاتِ تَقُولُ رَبَّنَا اغْفِرْ لِلَّذِينَ تابُوا وَ اتَّبَعُوا سَبِيلَكَ وَ قِهِمْ عَذابَ الْجَحِيمِ إِلَى آخِرِ الْآيَتَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, from Muhammad Bin Muslim, ",
            "from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) having said: ‘The <span class=\"iTxt\">Salaat</span> upon the one of weak understanding and those who do not recognise the sending of Blessings upon the Prophet<sup>saww</sup> and the supplication for the believing men and the believing women, you should be saying, ‘Our Lord<sup>azwj</sup>! <span class=\"ibTxt\"><a href=\"/#/books/quran:40#h7\">[40:7]</a> Grant Forgiveness to those who repent and follow Your Way, and save them from the Punishment of the Blazing Fire </span>– up to the end of the two Verses’. (<span class=\"ibTxt\"><a href=\"/#/books/quran:40#h8\">[40:8]</a> Our Lord! And Make them enter the Gardens of Eden which You have Promised to them and those who do good of their fathers and their wives and their offspring, surely You are the Mighty, the Wise</span>)."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz from Muhammad ibn Muslim who has said the following: “One of the two Imam, ‘Alayhim al-Salam, has stated this Hadith: ‘There are people of weak understanding who do not understand prayer for the Holy prophet, and for the believing people - male and female. In Salah (prayer) for such people you should say, “Our Lord, forgive those who repent and follow your path and save them from the fire of hell. . .” Read to the end of verse 8 of Surah 40 of the Holy Quran.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/69)"
        ],
        "index": 4498,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:57:2",
        "refs": {
          "Mentions": [
            "/books/quran:40:7"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ فُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِذَا صَلَّيْتَ عَلَى الْمُؤْمِنِ فَادْعُ لَهُ وَ اجْتَهِدْ لَهُ فِي الدُّعَاءِ وَ إِنْ كَانَ وَاقِفاً مُسْتَضْعَفاً فَكَبِّرْ وَ قُلِ اللَّهُمَّ اغْفِرْ لِلَّذِينَ تَابُوا وَ اتَّبَعُوا سَبِيلَكَ وَ قِهِمْ عَذَابَ الْجَحِيمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Fuzayl Bin Yasaar, ",
            "from Abu Ja’far<sup>asws</sup> having said: ‘Whenever you pray <span class=\"iTxt\">Salaat</span> upon the (deceased) believer, so supplicate for him and strive for him in the supplication; and if he was precautionary, of weak understanding, so exclaim <span class=\"iTxt\">Takbeer</span> and say, ‘O Allah<sup>azwj</sup>! <span class=\"ibTxt\"><a href=\"/#/books/quran:40#h7\">[40:7]</a> Grant Forgiveness to those who repent and follow Your Way, and save them from the Punishment of the Blazing Fire</span>’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ’Udhaynah from Fudayl ibn Yasar who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘When you perform Salah (prayer) for a believing person, pray for him and strive in your appeal in favor of the deceased person. If he is of those who keep matters on hold (of waqifiy belief) or of weak understanding say, ‘Takbir (Allah is great beyond description) and, O Lord, forgive those who have repented, followed your path and protect them against the suffering of the hell fire.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/69)"
        ],
        "index": 4499,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:57:3",
        "refs": {
          "Mentions": [
            "/books/quran:40:7"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنْ كَانَ مُسْتَضْعَفاً فَقُلِ اللَّهُمَّ اغْفِرْ لِلَّذِينَ تَابُوا وَ اتَّبَعُوا سَبِيلَكَ وَ قِهِمْ عَذَابَ الْجَحِيمِ وَ إِذَا كُنْتَ لَا تَدْرِي مَا حَالُهُ فَقُلِ اللَّهُمَّ إِنْ كَانَ يُحِبُّ الْخَيْرَ وَ أَهْلَهُ فَاغْفِرْ لَهُ وَ ارْحَمْهُ وَ تَجَاوَزْ عَنْهُ وَ إِنْ كَانَ الْمُسْتَضْعَفُ مِنْكَ بِسَبِيلٍ فَاسْتَغْفِرْ لَهُ عَلَى وَجْهِ الشَّفَاعَةِ لَا عَلَى وَجْهِ الْوَلَايَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad Bin Usman, from Al Halby, ",
            "from Abu Abdullah<sup>asws</sup> having said: ‘If he (the deceased) was of weak understanding, so say, ‘O Allah<sup>azwj</sup>! <span class=\"ibTxt\"><a href=\"/#/books/quran:40#h7\">[40:7]</a> Grant Forgiveness to those who repent and follow Your Way, and save them from the Punishment of the Blazing Fire</span>’. And when you do not know what his state is, so say, ‘O Allah<sup>azwj</sup>! If he used to love the good and its people<sup>asws</sup>, so Forgive him, and be Merciful to him, and Overlook (his sins) from him; and if he was of weaker understanding than yours in the Way (of Allah<sup>azwj</sup>), so seek Forgiveness for him upon the aspect of intercession, not upon the aspect of the <span class=\"iTxt\">Wilayah</span>’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad ibn ‘Uthaman from al-Halabiy who has said the following: “Abu ‘Abd Allah, Alayhi al-Salam, has said, ‘If the deceased is a person of weak understanding, say, “O Lord, forgive those who have repented and followed Your path and protect them against suffering of the hell fire.” If you do not know the condition of the deceased, then say, “O Lord, if this deceased is of those who love good and people of goodness, then forgive him, have mercy on him and ignore his shortcomings.” If the deceased is a person of weak understanding, ask forgiveness for him in the form of intercession, not because of his right upon you as believing in Divine Authority of ’A’immah, Alayhim al-Salam.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/70)"
        ],
        "index": 4500,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:57:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ فَضَّالٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ التَّرَحُّمُ عَلَى جِهَتَيْنِ جِهَةِ الْوَلَايَةِ وَ جِهَةِ الشَّفَاعَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Fazzal, from one of his companions, ",
            "from Abu Abdullah<sup>asws</sup> having said: ‘The (Divine) Mercy is upon two aspects – the aspect of <span class=\"iTxt\">Wilayah</span> and the aqspect of intercession’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn Faddal from certain persons of his people who has said the following: “Abu ‘Abd Allah, Alayhi al-Salam, has said, ‘Expressing kindness and compassion has two aspects: The aspect of al-Walayah (guardianship) and that of intercession.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/70)"
        ],
        "index": 4501,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:57:5",
        "refs": {
          "Mentions": [
            "/books/quran:40:7"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ رَجُلٍ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تَقُولُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَشْهَدُ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ عَبْدِكَ وَ رَسُولِكَ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ تَقَبَّلْ شَفَاعَتَهُ وَ بَيِّضْ وَجْهَهُ وَ أَكْثِرْ تَبَعَهُ ",
          "اللَّهُمَّ اغْفِرْ لِي وَ ارْحَمْنِي وَ تُبْ عَلَيَّ اللَّهُمَّ اغْفِرْ لِلَّذِينَ تَابُوا وَ اتَّبَعُوا سَبِيلَكَ وَ قِهِمْ عَذَابَ الْجَحِيمِ فَإِنْ كَانَ مُؤْمِناً دَخَلَ فِيهَا وَ إِنْ كَانَ لَيْسَ بِمُؤْمِنٍ خَرَجَ مِنْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira, from a man, from Suleyman Bin Khalid, ",
            "from Abu Abdullah<sup>asws</sup> having said: ‘You should be saying, ‘I testify that there is no God except for Allah<sup>azwj</sup>, and I testify that Muhammad<sup>saww</sup> is Rasool-Allah<sup>azwj</sup>. O Allah<sup>azwj</sup>! Send Blessings upon Muhammad<sup>saww</sup>, Your<sup>azwj</sup> servant and Your<sup>azwj</sup> Rasool<sup>saww</sup>. O Allah<sup>azwj</sup> Send Blessings upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and Accept his intercession, and Whiten his<sup>saww</sup> face and Multiply his<sup>saww</sup> followers. ",
            "O Allah<sup>azwj</sup>! Forgive me, and be Merciful to me, and Turn towards me. O Allah<sup>azwj</sup>! <span class=\"ibTxt\"><a href=\"/#/books/quran:40#h7\">[40:7]</a> Grant Forgiveness to those who repent and follow Your Way, and save them from the Punishment of the Blazing Fire</span>’. So if he was a believer, he would be included in it, and if was not a believer, he would be out from it’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ‘Abd Allah ibn al-Mughirah from a man from Sulayman ibn Khalid who has said the following: “Abu ‘Abd Allah, Alayhi al-Salam, has said to say this, ‘(I testify that only Allah deserves worship, He is one and has no partners and I testify that Muhammad is His servant and Messenger). O Allah, I pray to You to grant compensation to Muhammad and his family worthy of their services to Your cause. O Lord, accept his intercession, brighten his face and increase the number of his followers. O Lord, forgive me, grant me mercy and accept my repentance. O Lord, forgive those who repent, follow your path and save them from the fire of hell. . . .’ <a href=\"/#/books/quran:40#h7\">[40:7]</a> If the deceased is a believing person, he goes to paradise; if he is not a believer, he goes out of it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/71)"
        ],
        "index": 4502,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:57:6",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ غَالِبٍ عَنْ ثَابِتٍ أَبِي الْمِقْدَامِ قَالَ كُنْتُ مَعَ أَبِي جَعْفَرٍ ( عليه السلام ) فَإِذَا بِجَنَازَةٍ لِقَوْمٍ مِنْ جِيرَتِهِ فَحَضَرَهَا وَ كُنْتُ قَرِيباً مِنْهُ فَسَمِعْتُهُ يَقُولُ اللَّهُمَّ إِنَّكَ أَنْتَ خَلَقْتَ هَذِهِ النُّفُوسَ وَ أَنْتَ تُمِيتُهَا وَ أَنْتَ تُحْيِيهَا وَ أَنْتَ أَعْلَمُ بِسَرَائِرِهَا وَ عَلَانِيَتِهَا مِنَّا وَ مُسْتَقَرِّهَا وَ مُسْتَوْدَعِهَا ",
          "اللَّهُمَّ وَ هَذَا عَبْدُكَ وَ لَا أَعْلَمُ مِنْهُ شَرّاً وَ أَنْتَ أَعْلَمُ بِهِ وَ قَدْ جِئْنَاكَ شَافِعِينَ لَهُ بَعْدَ مَوْتِهِ فَإِنْ كَانَ مُسْتَوْجِباً فَشَفِّعْنَا فِيهِ وَ احْشُرْهُ مَعَ مَنْ كَانَ يَتَوَلَّاهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Al Hassan Bin Mahboub, from Abdullah Bin Ghalib, from Sabit Abu Al Miqdam who said, ",
            "‘I was with Abu Ja’far<sup>asws</sup> and there was a funeral prayer of someone from his<sup>asws</sup> neighbourhood. So they presented it, and I was nearby him<sup>asws</sup> and I heard him<sup>asws</sup> saying: ‘O Allah<sup>azwj</sup>! You<sup>azwj</sup> Created this soul and You<sup>azwj</sup> Caused it to die, and You<sup>azwj</sup> You<sup>azwj</sup> would be Reviving it, and You<sup>azwj</sup> are more Knowing of its secrets and its apparent than we are, and the permannace (of his faith) and its temporariness. ",
            "O Allah<sup>azwj</sup>! And this is Your<sup>azwj</sup> servant and I<sup>asws</sup> do not know of any evil from his and You<sup>azwj</sup> are more Knowing of him, and we have come over inteceding for him after his death. So if he was deserving, so Accept our intercession regarding him and Resurrect him along with the ones whom he used to befriend’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Sahl ibn Ziyad from al-Hassan ibn Mahbub from ‘Abd Allah ibn Ghalib from Thabit abu al-Miqdam who has said the following: “Once I was with abu Ja’far, ‘Alayhi al-Salam, when a deceased from the people who believe in predestination was brought; and I was near him (the Imam) and heard him (the Imam) say, ‘O Lord, it is You who have created these souls and You cause them to die and give them life. You know their secrets and their public affairs better than we know. You know the permanent and temporary ones among them. O Lord, this is Your servant. I do not know anything evil about him and You know better about him. We have come to intercede in his favor after his death. If he deserves, accept our intercession in his favor and raise him with those whom he loves.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:3:57",
  "kind": "verse_list"
}