{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:3:3", "titles": {"ar": "كِتَابُ الْجَنَائِزِ", "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "}}, {"indexed_titles": {"en": "Chapter 58"}, "path": "/books/al-kafi:3:3:58", "titles": {"ar": "باب الصَّلَاةِ عَلَى النَّاصِبِ", "en": "Chapter 58 – The Salaat upon the Hostile one (Nasibi)"}}], "index": 630, "local_index": 58, "part_type": "Chapter", "path": "/books/al-kafi:3:3:58", "titles": {"ar": "باب الصَّلَاةِ عَلَى النَّاصِبِ", "en": "Chapter 58 – The Salaat upon the Hostile one (Nasibi)"}, "verse_count": 7, "verse_start_index": 4502, "verses": [{"index": 4503, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:3:58:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا مَاتَ عَبْدُ اللَّهِ بْنُ أُبَيِّ بْنِ سَلُولٍ حَضَرَ النَّبِيُّ ( صلى الله عليه وآله ) جَنَازَتَهُ فَقَالَ عُمَرُ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) يَا رَسُولَ اللَّهِ أَ لَمْ يَنْهَكَ اللَّهُ أَنْ تَقُومَ عَلَى قَبْرِهِ فَسَكَتَ فَقَالَ يَا رَسُولَ اللَّهِ أَ لَمْ يَنْهَكَ اللَّهُ أَنْ تَقُومَ عَلَى قَبْرِهِ فَقَالَ لَهُ وَيْلَكَ وَ مَا يُدْرِيكَ مَا قُلْتُ إِنِّي قُلْتُ اللَّهُمَّ احْشُ جَوْفَهُ نَاراً وَ امْلَأْ قَبْرَهُ نَاراً وَ أَصْلِهِ نَاراً \nقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَأَبْدَى مِنْ رَسُولِ اللَّهِ مَا كَانَ يَكْرَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad Bin Usman, from Al Halby, \nfrom Abu Abdullah<sup>asws</sup> having said: ‘When Abdullah Bin Abu Saloul died, the Prophet<sup>saww</sup> was present at his funeral. So Umar said to Rasool-Allah<sup>saww</sup>, ‘O Rasool-Allah<sup>saww</sup>! Hasn’t Allah<sup>azwj</sup> Forbidden you<sup>saww</sup> from standing at his grave?’ So he<sup>saww</sup> was silent, and he said, ‘O Rasool-Allah<sup>saww</sup>! Hasn’t Allah<sup>azwj</sup> Forbidden you<sup>saww</sup> from standing at his grave?’ So he<sup>saww</sup> said to him: ‘Woe be unto you! And what would you know what I<sup>saww</sup> said? I<sup>saww</sup> said: ‘O Allah<sup>azwj</sup>! Tamp his inside with fire and fill upon his grave with fire, and his origin with fire’. \nAbu Abdullah<sup>asws</sup> said: ‘Thus he exposed from Rasool-Allah<sup>saww</sup> what he<sup>saww</sup> disliked (to expose)’."}]}, {"index": 4504, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:3:58:2", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ زِيَادِ بْنِ عِيسَى عَنْ عَامِرِ بْنِ السِّمْطِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ رَجُلًا مِنَ الْمُنَافِقِينَ مَاتَ فَخَرَجَ الْحُسَيْنُ بْنُ عَلِيٍّ ( صلوات الله عليه ) يَمْشِي مَعَهُ فَلَقِيَهُ مَوْلًى لَهُ فَقَالَ لَهُ الْحُسَيْنُ ( عليه السلام ) أَيْنَ تَذْهَبُ يَا فُلَانُ قَالَ فَقَالَ لَهُ مَوْلَاهُ أَفِرُّ مِنْ جِنَازَةِ هَذَا الْمُنَافِقِ أَنْ أُصَلِّيَ عَلَيْهَا فَقَالَ لَهُ الْحُسَيْنُ ( عليه السلام ) انْظُرْ أَنْ تَقُومَ عَلَى يَمِينِي فَمَا تَسْمَعُنِي أَقُولُ فَقُلْ مِثْلَهُ\nفَلَمَّا أَنْ كَبَّرَ عَلَيْهِ وَلِيُّهُ قَالَ الْحُسَيْنُ ( عليه السلام ) اللَّهُ أَكْبَرُ اللَّهُمَّ الْعَنْ فُلَاناً عَبْدَكَ أَلْفَ لَعْنَةٍ مُؤْتَلِفَةٍ غَيْرِ مُخْتَلِفَةٍ اللَّهُمَّ أَخْزِ عَبْدَكَ فِي عِبَادِكَ وَ بِلَادِكَ وَ أَصْلِهِ حَرَّ نَارِكَ وَ أَذِقْهُ أَشَدَّ عَذَابِكَ فَإِنَّهُ كَانَ يَتَوَلَّى أَعْدَاءَكَ وَ يُعَادِي أَوْلِيَاءَكَ وَ يُبْغِضُ أَهْلَ بَيْتِ نَبِيِّكَ ( صلى الله عليه وآله ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad and Ali Bin Ibrahim, from his father, altogether from Ibn Mahboub, from Ziyad Bin Isa, from Aamir Bin Al Simt, \nfrom Abu Abdullah<sup>asws</sup> that: ‘A man from the hypocrites died, So Al Hassan Bin Ali<sup>asws</sup> went out walking with him and came across a slave of his. So Al Husayn<sup>asws</sup> said to him: ‘Where are you going, O so and so?’ So his slave said to him<sup>asws</sup>, ‘I am fleeing from the funeral of this hypocrite that I would have to pray <span class=\"iTxt\">Salaat</span> over him’. So Al Husayn<sup>asws</sup> said to him: ‘Wait, and stand upon my<sup>asws</sup> right. So whatever you hear me<sup>asws</sup> saying, so say similar to it’. \nSo when his guardian (of the deceased) exclaimed <span class=\"iTxt\">Takbeer</span> upon him, Al Husayn<sup>asws</sup> said: ‘Allah<sup>azwj</sup> is the Greatest! O Allah<sup>azwj</sup>! Curse so and so, Your<sup>azwj</sup> servant with a thousand Curses, combined without a separation. O Allah<sup>azwj</sup>! Withhold Your<sup>azwj</sup> servant among Your<sup>azwj</sup> servants and Your<sup>azwj</sup> city and Make the heat of Your<sup>azwj</sup> Fire arrive to him, and Make his Taste the intensity of Your<sup>azwj</sup> Punishment, for he used to befriend Your<sup>azwj</sup> enemies and was inimical towards Your<sup>azwj</sup> friends, and used to hate the People<sup>asws</sup> of the Household of Your<sup>azwj</sup> Prophet<sup>saww</sup>’."}]}, {"index": 4505, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:3:58:3", "text": "سَهْلٌ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ صَفْوَانَ الْجَمَّالِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَاتَ رَجُلٌ مِنَ الْمُنَافِقِينَ فَخَرَجَ الْحُسَيْنُ ( عليه السلام ) يَمْشِي فَلَقِيَ مَوْلًى لَهُ فَقَالَ لَهُ إِلَى أَيْنَ تَذْهَبُ فَقَالَ أَفِرُّ مِنْ جِنَازَةِ هَذَا الْمُنَافِقِ أَنْ أُصَلِّيَ عَلَيْهِ فَقَالَ لَهُ الْحُسَيْنُ ( عليه السلام ) قُمْ إِلَى جَنْبِي فَمَا سَمِعْتَنِي أَقُولُ فَقُلْ مِثْلَهُ \nقَالَ فَرَفَعَ يَدَيْهِ فَقَالَ اللَّهُمَّ أَخْزِ عَبْدَكَ فِي عِبَادِكَ وَ بِلَادِكَ اللَّهُمَّ أَصْلِهِ حَرَّ نَارِكَ اللَّهُمَّ أَذِقْهُ أَشَدَّ عَذَابِكَ فَإِنَّهُ كَانَ يَتَوَلَّى أَعْدَاءَكَ وَ يُعَادِي أَوْلِيَاءَكَ وَ يُبْغِضُ أَهْلَ بَيْتِ نَبِيِّكَ ( صلى الله عليه وآله ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "Sahl, from Ibn Abu Najran, from Safwan Al Jammal, \nfrom Abu Abdullah<sup>asws</sup> having said: ‘A man from the hypocrites died, so Al Husayn<sup>asws</sup> went out walking, and he<sup>asws</sup> came across a slave of his. So he<sup>asws</sup> said to him: ‘Where are you going to?’ So he said, ‘I am fleeing from the funeral of this hypocrite that I would have to pray <span class=\"iTxt\">Salaat</span> upon him’. So Al Husayn<sup>asws</sup> said to him: ‘Stand by my<sup>asws</sup> side, and whatever you hear from me<sup>asws</sup>, so say the like of it’. \nHe<sup>asws</sup> said: ‘So he<sup>asws</sup> raised his<sup>asws</sup> hands and said: ‘O Allah<sup>azwj</sup>! Withhold Your<sup>azwj</sup> servant among Your<sup>azwj</sup> servants and Your<sup>azwj</sup> city. O Allah<sup>azwj</sup>! Cause the heat of Your<sup>azwj</sup> Fire to arrive to him. O Allah<sup>azwj</sup>! Make his tase the intensity of Your<sup>azwj</sup> Punishment, for he used to befriend Your<sup>azwj</sup> enemies, and was inimical to Your<sup>azwj</sup> friends, and used to hat the People<sup>asws</sup> of the Household of Your<sup>azwj</sup> Prophet<sup>saww</sup>’."}]}, {"index": 4506, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:3:3:58:4", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا صَلَّيْتَ عَلَى عَدُوِّ اللَّهِ فَقُلِ اللَّهُمَّ إِنَّ فُلَاناً لَا نَعْلَمُ مِنْهُ إِلَّا أَنَّهُ عَدُوٌّ لَكَ وَ لِرَسُولِكَ اللَّهُمَّ فَاحْشُ قَبْرَهُ نَاراً وَ احْشُ جَوْفَهُ نَاراً وَ عَجِّلْ بِهِ إِلَى النَّارِ فَإِنَّهُ كَانَ يَتَوَلَّى أَعْدَاءَكَ وَ يُعَادِي أَوْلِيَاءَكَ وَ يُبْغِضُ أَهْلَ بَيْتِ نَبِيِّكَ اللَّهُمَّ ضَيِّقْ عَلَيْهِ قَبْرَهُ \nفَإِذَا رُفِعَ فَقُلِ اللَّهُمَّ لَا تَرْفَعْهُ وَ لَا تُزَكِّهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, \nfrom Abu Abdullah<sup>asws</sup> having said: ‘Whenever you (have to) pray <span class=\"iTxt\">Salaat</span> upon an enemy of Allah<sup>azwj</sup>, so say, ‘O Allah<sup>azwj</sup>! So and so, we do not know from him except that he is an enemy of Yours(s.w.t.) and of Your<sup>azwj</sup> Rasool<sup>saww</sup>. Therefore Tamp his grave with fire, and Tamp his inside with fire, and Hasten with him to the Fire, for he used to befriend Your<sup>azwj</sup> enemies and was inimical to Your<sup>azwj</sup> friends, and was Hating the People<sup>asws</sup> of the Household of Your<sup>azwj</sup> Prophet<sup>saww</sup>. O Allah<sup>azwj</sup>! Straiten his grave upon him’. \nSo when he (the deceased) is raised, say, ‘O Allah<sup>azwj</sup>! Neither Raise him (his levels), nor Purify him (by Forgiving his sins)’."}]}, {"index": 4507, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:3:3:58:5", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ إِنْ كَانَ جَاحِداً لِلْحَقِّ فَقُلِ اللَّهُمَّ امْلَأْ جَوْفَهُ نَاراً وَ قَبْرَهُ نَاراً وَ سَلِّطْ عَلَيْهِ الْحَيَّاتِ وَ الْعَقَارِبَ وَ ذَلِكَ قَالَهُ أَبُو جَعْفَرٍ ( عليه السلام ) لِامْرَأَةِ سَوْءٍ مِنْ بَنِي أُمَيَّةَ صَلَّى عَلَيْهَا أَبِي وَ قَالَ هَذِهِ الْمَقَالَةَ وَ اجْعَلِ الشَّيْطَانَ لَهَا قَرِيناً \nقَالَ مُحَمَّدُ بْنُ مُسْلِمٍ فَقُلْتُ لَهُ لِأَيِّ شَيْ‏ءٍ يَجْعَلُ الْحَيَّاتِ وَ الْعَقَارِبَ فِي قَبْرِهَا فَقَالَ إِنَّ الْحَيَّاتِ يَعْضَضْنَهَا وَ الْعَقَارِبَ يَلْسَعْنَهَا وَ الشَّيَاطِينَ تُقَارِنُهَا فِي قَبْرِهَا قُلْتُ تَجِدُ أَلَمَ ذَلِكَ قَالَ نَعَمْ شَدِيداً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, from Muhammad Bin Muslim,\nfrom one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup> having said: ‘If he (deceased) was one who fought against the Trtuh, so say, ‘O Allah<sup>azwj</sup>! Fill his inside with fire, and his grave with fire, and Make the snakes and the scorpions to arrive to him’, and that is what Abu Ja’far<sup>asws</sup> said for an evil woman of the Clan of Umayya. My<sup>asws</sup> father<sup>asws</sup> prayed <span class=\"iTxt\">Salaat</span> over her and said these words: ‘And Make the devils as her companions’’. \nMuhammad Bin Muslim said, ‘So I said to him<sup>asws</sup>, ‘For which thing were the snakes and the scorpions to be in her grave?’ So he<sup>asws</sup> said: ‘The snakes would bite her and the scorpions would sting her and the devils would accompany her in her grave’. I said, ‘Would she find the pain of that?’ He<sup>asws</sup> said: ‘Yes, intense’."}]}, {"index": 4508, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:3:3:58:6", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ تَقُولُ اللَّهُمَّ أَخْزِ عَبْدَكَ فِي عِبَادِكَ وَ بِلَادِكَ اللَّهُمَّ أَصْلِهِ نَارَكَ وَ أَذِقْهُ أَشَدَّ عَذَابِكَ فَإِنَّهُ كَانَ يُعَادِي أَوْلِيَاءَكَ وَ يُوَالِي أَعْدَاءَكَ وَ يُبْغِضُ أَهْلَ بَيْتِ نَبِيِّكَ ( صلى الله عليه وآله ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr who said, \n‘You should be saying, ‘O Allah<sup>azwj</sup>! Humiliate Your<sup>azwj</sup> servant among Your<sup>azwj</sup> servants and Your<sup>azwj</sup> city. O Allah<sup>azwj</sup>! Make Your<sup>azwj</sup> fire to arrive to him and Make him tase the intensity of Your<sup>azwj</sup> Punishment, for he used to be inimical to Your<sup>azwj</sup> friends and used to befriend Your<sup>azwj</sup> enemies, and used to hate the People<sup>asws</sup> of the Household of Your<sup>azwj</sup> Prophet<sup>saww</sup>’."}]}, {"index": 4509, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:3:3:58:7", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ الْحَجَّالِ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَوْ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَاتَتِ امْرَأَةٌ مِنْ بَنِي أُمَيَّةَ فَحَضَرْتُهَا فَلَمَّا صَلَّوْا عَلَيْهَا وَ رَفَعُوهَا وَ صَارَتْ عَلَى أَيْدِي الرِّجَالِ قَالَ اللَّهُمَّ ضَعْهَا وَ لَا تَرْفَعْهَا وَ لَا تُزَكِّهَا \nقَالَ وَ كَانَتْ عَدُوَّةً لِلَّهِ قَالَ وَ لَا أَعْلَمُهُ إِلَّا قَالَ وَ لَنَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Abdullah Al Hajjal, from Hammad Bin Usman, \nfrom Abu Abdullah<sup>asws</sup>, or from the one who mentioned it, from Abu Abdullah<sup>asws</sup> having said: ‘A woman from the Clan of Umayya died, so I attended her (funeral). So when <span class=\"iTxt\">Salaat</span> had been prayed over her, and she was raised, and came to be in the hands of the men (for the burial), he<sup>asws</sup> said: ‘O Allah<sup>azwj</sup>! Place her down and do not Raise her, and do not Purify her’. \nHe (the narrator) said, ‘Amd she was an enemy of Allah<sup>azwj</sup>, and I do not know it except that he<sup>asws</sup> said: ‘And (an enemy of) ours<sup>asws</sup>’."}]}]}, "index": "al-kafi:3:3:58", "kind": "verse_list"}