{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 61"
        },
        "path": "/books/al-kafi:3:3:61",
        "titles": {
          "ar": "باب نَادِرٌ",
          "en": "Chapter 61 – Miscellaneous"
        }
      }
    ],
    "index": 633,
    "local_index": 61,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 62"
        },
        "path": "/books/al-kafi:3:3:62",
        "titles": {
          "ar": "باب دُخُولِ الْقَبْرِ وَ الْخُرُوجِ مِنْهُ",
          "en": "Chapter 62 – Entering the grave and the exiting from it"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 60"
        },
        "path": "/books/al-kafi:3:3:60",
        "titles": {
          "ar": "باب فِي وَضْعِ الْجَنَازَةِ دُونَ الْقَبْرِ",
          "en": "Chapter 60 – Regarding placing of the deceased besides the grave"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:3:61",
    "titles": {
      "ar": "باب نَادِرٌ",
      "en": "Chapter 61 – Miscellaneous"
    },
    "verse_count": 2,
    "verse_start_index": 4512,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/82)"
        ],
        "index": 4513,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:61:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى بْنِ عِمْرَانَ الْحَلَبِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ زُرَارَةَ قَالَ كُنْتُ عِنْدَ أَبِي جَعْفَرٍ ( عليه السلام ) وَ عِنْدَهُ رَجُلٌ مِنَ الْأَنْصَارِ فَمَرَّتْ بِهِ جَنَازَةٌ فَقَامَ الْأَنْصَارِيُّ وَ لَمْ يَقُمْ أَبُو جَعْفَرٍ ( عليه السلام ) فَقَعَدْتُ مَعَهُ وَ لَمْ يَزَلِ الْأَنْصَارِيُّ قَائِماً حَتَّى مَضَوْا بِهَا ثُمَّ جَلَسَ ",
          "فَقَالَ لَهُ أَبُو جَعْفَرٍ ( عليه السلام ) مَا أَقَامَكَ قَالَ رَأَيْتُ الْحُسَيْنَ بْنَ عَلِيٍّ ( عليه السلام ) يَفْعَلُ ذَلِكَ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) وَ اللَّهِ مَا فَعَلَهُ الْحُسَيْنُ ( عليه السلام ) وَ لَا قَامَ لَهَا أَحَدٌ مِنَّا أَهْلَ الْبَيْتِ قَطُّ فَقَالَ الْأَنْصَارِيُّ شَكَّكْتَنِي أَصْلَحَكَ اللَّهُ قَدْ كُنْتُ أَظُنُّ أَنِّي رَأَيْتُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Yahya Bin Imran Al Halby, from Abdullah Bin Muskan, from Zurara who said, ",
            "‘I was in the presence of Abu Ja’far<sup>asws</sup>, and in his<sup>asws</sup> presence was a man from the Ansaar, and a coffin passed by. So the Ansary stood up and Abu Ja’far<sup>asws</sup> did not stand up. So I remained seated along with him<sup>asws</sup>, and the Ansary did not remain standing until they had passed with it. Then he sat down.",
            "So Abu Ja’far<sup>asws</sup> said to him: ‘What made you stand up?’ He said, ‘I saw Al Husayn Bin Ali<sup>asws</sup> do that (before)’. So Abu Ja’far<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! Neither did Al Husayn<sup>asws</sup> stand up for it nor did anyone else from us<sup>asws</sup>, the People<sup>asws</sup> of the Household, at all’. So the Ansaary said, ‘You<sup>asws</sup> have placed me in doubt, may Allah<sup>azwj</sup> Keep you<sup>asws</sup> well. I thought, I had seen him<sup>asws</sup> do so’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Nadr ibn al-Suwayd from Yahya ibn ‘Imran al-Halabiy from ‘Abd Allah ibn Muskan from Zurarah who has said the following: “Once I was with of abu Ja‘far, ‘Alayhi al-Salam, when a man from Ansar was also there. A funeral procession passed by and the Ansariy man stood up; but abu Ja’far, ‘Alayhi al-Salam, did not do so, and I remained sitting with him. The Ansariy remained standing until the procession passed by and then he sat down. The Imam asked, ’What made you stand up?’ He replied, ‘I saw al-Husayn ibn Ali do as I did.’ Abu Ja’far, ‘Alayhi al-Salam, said, ’By Allah, al-Husayn did not do so and no one from us (Ahl al-Bayt) has ever done so.’ The Ansariy then said, ‘What you just said has placed me in doubt. I thought I had seen him (al-Husayn) doing so.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/84)"
        ],
        "index": 4514,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:61:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ مُثَنًّى الْحَنَّاطِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ الْحُسَيْنُ بْنُ عَلِيٍّ ( عليه السلام ) جَالِساً فَمَرَّتْ عَلَيْهِ جَنَازَةٌ فَقَامَ النَّاسُ حِينَ طَلَعَتِ الْجَنَازَةُ فَقَالَ الْحُسَيْنُ ( عليه السلام ) مَرَّتْ جَنَازَةُ يَهُودِيٍّ وَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَلَى طَرِيقِهَا جَالِساً فَكَرِهَ أَنْ تَعْلُوَ رَأْسَهُ جَنَازَةُ يَهُودِيٍّ فَقَامَ لِذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ibn Abu Najran, from Musanna Al Hannat, ",
            "from Abu Absdullah<sup>asws</sup> having said: ‘Al Husayn Bin Ali<sup>asws</sup> was seated, and a funeral coffin passed by him. So the people stood up when the coffin emerged. So Al Husayn<sup>asws</sup> said: ‘A funeral coffin of a Jew passed by and Rasool-Allah<sup>saww</sup> was upon its road, seated. So he<sup>saww</sup> disliked that the head of the deceased Jew be higher than his<sup>saww</sup>, therefore he<sup>saww</sup> stood up for that’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Sahl ibn Ziyad from ibn abu Najran from Muthanna al-Hannat who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Ali ibn Al-Husayn, ‘Alayhi al-Salam, was sitting when (people with) the dead body passed by. People stood up when the dead body appeared. Ali ibn Al-Husayn, ‘Alayhi al-Salam, said, ‘Once, (people with) the dead body of a Jewish person passed by; the Messenger of Allah was sitting on (the side of) way. He did not like the dead body of Jewish person higher over his head and to avoid this he stood up.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:3:61",
  "kind": "verse_list"
}