{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 64"
        },
        "path": "/books/al-kafi:3:3:64",
        "titles": {
          "ar": "باب سَلِّ الْمَيِّتِ وَ مَا يُقَالُ عِنْدَ دُخُولِ الْقَبْرِ",
          "en": "Chapter 64 – Placing the deceased and what is said during entering the grave"
        }
      }
    ],
    "index": 636,
    "local_index": 64,
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:3:64",
    "titles": {
      "ar": "باب سَلِّ الْمَيِّتِ وَ مَا يُقَالُ عِنْدَ دُخُولِ الْقَبْرِ",
      "en": "Chapter 64 – Placing the deceased and what is said during entering the grave"
    },
    "verse_count": 11,
    "verse_start_index": 4527,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/92)"
        ],
        "index": 4528,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:64:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا أَتَيْتَ بِالْمَيِّتِ الْقَبْرَ فَسُلَّهُ مِنْ قِبَلِ رِجْلَيْهِ فَإِذَا وَضَعْتَهُ فِي الْقَبْرِ فَاقْرَأْ آيَةَ الْكُرْسِيِّ وَ قُلْ بِسْمِ اللَّهِ وَ فِي سَبِيلِ اللَّهِ وَ عَلَى مِلَّةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) اللَّهُمَّ افْسَحْ لَهُ فِي قَبْرِهِ وَ أَلْحِقْهُ بِنَبِيِّهِ ( صلى الله عليه وآله ) وَ قُلْ كَمَا قُلْتَ فِي الصَّلَاةِ عَلَيْهِ مَرَّةً وَاحِدَةً مِنْ عِنْدِ اللَّهُمَّ إِنْ كَانَ مُحْسِناً فَزِدْ فِي إِحْسَانِهِ وَ إِنْ كَانَ مُسِيئاً فَاغْفِرْ لَهُ وَ ارْحَمْهُ وَ تَجَاوَزْ عَنْهُ وَ اسْتَغْفِرْ لَهُ مَا اسْتَطَعْتَ ",
          "قَالَ وَ كَانَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) إِذَا أَدْخَلَ الْمَيِّتَ الْقَبْرَ قَالَ اللَّهُمَّ جَافِ الْأَرْضَ عَنْ جَنْبَيْهِ وَ صَاعِدْ عَمَلَهُ وَ لَقِّهِ مِنْكَ رِضْوَاناً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn AbuUmeyr, from Hammad, from Al Halby, ",
            "from Abu Abdullah<sup>asws</sup> having said: ‘When they come with the deceased to the grave, so place him from the direction of his legs, So when you place him in the grace, recite <span class=\"iTxt\">Ayat Al Kursy</span> (Chapter 2:255) and say, ‘In the Name of Allah<sup>azwj</sup>’, and say just as you said during the <span class=\"iTxt\">Salaat</span> upon him, once in his presence, ‘O Allah<sup>azwj</sup>! If he was a good doer, so Increase in his good deeds, and if he was an evil doer, so Forgive him, and be Merciful to him, and Overlook (his sins) from him’. And seek Forgiveness for him , and Forgive him whatever whatever you are able to’. ",
            "He<sup>asws</sup> said: ‘And it was so that whenever Ali Bin Al Husayn<sup>asws</sup> entered the deceased into the grave, said: ‘O Allah<sup>azwj</sup>! Expand the ground from both his sides and Ascend his deeds, and Assign him the Pleasure from You<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “Abu ’Abd Allah, ‘Alayhi al-Salam, has said that you should place a deceased, after his arrival near the grave, in it from the side where you intend to place his feet. When the deceased is placed in the grave, read Ayatu al-Kursiy and say, ’(I begin) in the name of Allah, in the way of Allah and on the path of the Messenger of Allah. O Allah, make his grave comfortably spacious and join him with his prophet, who with his family are ‘Alayhim al-Salam .’ Then say what you have just said in Salah (prayer) for the deceased only once nearby, ‘O Allah, if he is a person of good deed, increase his good deeds and if he is a person of bad deeds, please forgive him, have mercy on him and ignore his sins.’ You should ask forgiveness for him as much as possible. The Imam said, ‘Ali ibn al-Husayn, Alayhi al-Salam, at the time of placing a deceased in the grave would say, “O Allah make his place spacious on both sides, accept his good deeds and grant him happiness from Your side.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/94)"
        ],
        "index": 4529,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:64:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ وَ مُحَمَّدِ بْنِ خَالِدٍ جَمِيعاً عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى بْنِ عِمْرَانَ عَنْ هَارُونَ بْنِ خَارِجَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا سَلَلْتَ الْمَيِّتَ فَقُلْ بِسْمِ اللَّهِ وَ بِاللَّهِ وَ عَلَى مِلَّةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) اللَّهُمَّ إِلَى رَحْمَتِكَ لَا إِلَى عَذَابِكَ فَإِذَا وَضَعْتَهُ فِي اللَّحْدِ فَضَعْ يَدَكَ عَلَى أُذُنِهِ فَقُلِ اللَّهُ رَبُّكَ وَ الْإِسْلَامُ دِينُكَ وَ مُحَمَّدٌ نَبِيُّكَ وَ الْقُرْآنُ كِتَابُكَ وَ عَلِيٌّ إِمَامُكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed and Muhammad Bin Khalid, altogether from Al Nazar Bin Suweyd, from Yahya Bin Imran, from Haroun Bin Kharja, from Abu Baseer, ",
            "from Abu Abdullah<sup>asws</sup> having said: ‘When you bring forth the deceased, so say, ‘In the Name of Allah<sup>azwj</sup>, and by Allah<sup>azwj</sup>, and upon the Religion of Rasool-Allah<sup>saww</sup>. O Allah<sup>azwj</sup>! To Your<sup>azwj</sup> Mercy, not to Your<sup>azwj</sup> Punishment’. So when you place him into the chasm (<span class=\"iTxt\">Lahad</span>), so place your hand upon his ear and say, ‘Allah<sup>azwj</sup> is your Lord<sup>azwj</sup>, and Al Islam is your Religion, and Muhammad<sup>saww</sup> is your Prophet<sup>saww</sup>, and the Quran is your Book, and Ali<sup>asws</sup> is your Imam<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa‘id and Muhammad ibn Khalid, all from al-Nadr ibn al-Suwayd from Yahya ibn ‘Imran from Harun ibn Kharijah from abu Basir who has said the following: “Abu ‘Abd Allah, Alayhi al-Salam, has said to say this, when you place a deceased in the grave, ‘(I begin) in the name of Allah, with Allah and on the path of the Messenger of Allah. O Allah, take him to Your mercy and not to Your punishment.’ Say, when the deceased is placed in the grave, with your hand on his ear, ‘Allah is your Lord, al-Islam is your religion, Muhammad is your prophet, Quran is your book and Ali is your Imam.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/95)"
        ],
        "index": 4530,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:64:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَحَدَهُمَا ( عليهما السلام ) عَنِ الْمَيِّتِ فَقَالَ تَسُلُّهُ مِنْ قِبَلِ الرِّجْلَيْنِ وَ تُلْزِقُ الْقَبْرَ بِالْأَرْضِ إِلَى قَدْرِ أَرْبَعِ أَصَابِعَ مُفَرَّجَاتٍ وَ تُرَبِّعُ قَبْرَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Al Hassan Bin Mahboub, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim who said, ",
            "‘I asked one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup> about the deceased, so he<sup>asws</sup> said: ‘Place him from the direction of the two legs, and paste the grave with the earth by a measurement of four open fingers (in height), and square his grave (make it four cornered)’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from al-Hassan ibn Mahbub from al-‘Ala’ ibn Razin from Muhammad ibn Muslim who has said the following: “I asked one of the two Imam, Alayhim al-Salam, about a deceased. He said, ‘Place him in the grave from the side of the feet. Keep the grave above the ground by four open fingers and make it four cornered.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/96)"
        ],
        "index": 4531,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:64:4",
        "text": [
          "سَهْلُ بْنُ زِيَادٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سُلَّهُ سَلًّا رَفِيقاً فَإِذَا وَضَعْتَهُ فِي لَحْدِهِ فَلْيَكُنْ أَوْلَى النَّاسِ مِمَّا يَلِي رَأْسَهُ لِيَذْكُرَ اسْمَ اللَّهِ عَلَيْهِ وَ يُصَلِّيَ عَلَى النَّبِيِّ ( صلى الله عليه وآله ) وَ يَتَعَوَّذَ مِنَ الشَّيْطَانِ وَ لْيَقْرَأْ فَاتِحَةَ الْكِتَابِ وَ الْمُعَوِّذَتَيْنِ وَ قُلْ هُوَ اللَّهُ أَحَدٌ وَ آيَةَ الْكُرْسِيِّ وَ إِنْ قَدَرَ أَنْ يَحْسِرَ عَنْ خَدِّهِ وَ يُلْزِقَهُ بِالْأَرْضِ فَعَلَ وَ يَشْهَدُ وَ يَذْكُرُ مَا يَعْلَمُ حَتَّى يَنْتَهِيَ إِلَى صَاحِبِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl Bin Ziyad, from Muhammad Bin Sinan, from Muhammad Bin Ajlan, ",
            "from Abu Abdullah<sup>asws</sup> having said: ‘Place him with a gentle placing. So when you place him in his chasm (<span class=\"iTxt\">Lahad</span>), so let the the closest of the people from what follows his head mention the Name of Allah<sup>azwj</sup> upon him, and he should send Blessings upon the Prophet<sup>saww</sup>, and seek Refuge from the Satan<sup>la</sup>, and let him recite the <span class=\"iTxt\">Opening of the Book</span> (Chapter 1), and the <span class=\"iTxt\">Maw’azatayn</span> (Chapters 113 & 114), and <span class=\"iTxt\">Ayat Al Kursy</span> (Chapter 2:255). And if he is able to bare his cheek (of the deceased) and paste his cheek with the ground, so he should do so, and he should testify and mention whatever he knows until he ends up to his companion’."
          ],
          "en.sarwar": [
            "4. Sahl ibn Ziyad has narrated from Muhammad ibn Sinan from Muhammad ibn ‘Ajlan who has said the following: “Abu ‘Abd Allah, Alayhi al-Salam, has said to place a deceased gently in the grave. The person from the side of his head, when he is placed in the grave, should speak of the names of Allah. He should also say ‘Allahumma Salli ‘Ala Muhammad wa ‘Ali Muhammad (O Allah grant Muhammad and his family a compensation worthy of their serving Your cause).’ He should ask protection with Allah against Satan; read al-Fatihah al-Kitab, chapters 113, 114, 112 of the Holy Quran and Ayatu al-Kursiy. If possible, one should place the side of his face on the soil without covering, say the testimonies, and speak of Allah whatever he knows until he is in the presence of his guardian (Imam al-Mahdi).” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/97)"
        ],
        "index": 4532,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:64:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ مَحْفُوظٍ الْإِسْكَافِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا أَرَدْتَ أَنْ تَدْفِنَ الْمَيِّتَ فَلْيَكُنْ أَعْقَلُ مَنْ يَنْزِلُ فِي قَبْرِهِ عِنْدَ رَأْسِهِ وَ لْيَكْشِفْ خَدَّهُ الْأَيْمَنَ حَتَّى يُفْضِيَ بِهِ إِلَى الْأَرْضِ وَ يُدْنِي فَمَهُ إِلَى سَمْعِهِ وَ يَقُولُ اسْمَعْ افْهَمْ ثَلَاثَ مَرَّاتٍ اللَّهُ رَبُّكَ وَ مُحَمَّدٌ نَبِيُّكَ وَ الْإِسْلَامُ دِينُكَ وَ فُلَانٌ إِمَامُكَ اسْمَعْ وَ افْهَمْ وَ أَعِدْهَا عَلَيْهِ ثَلَاثَ مَرَّاتٍ هَذَا التَّلْقِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ismail, from Ali Bin Al Hakam, from Muhammad Bin Sinan, from Mahfouz Al Iskaaf, ",
            "from Abu Abdullah<sup>asws</sup> having said: ‘Whenever you want to bury the deceased, so let the wisest one enter into his grave to be by his head, and let him uncover his right cheek until it is exposed to the ground and go near his mouth to his ear and he should be saying, ‘Listen, understand!’ – three times, ‘Allah<sup>azwj</sup> is your Lord<sup>azwj</sup>, and Muhammad<sup>saww</sup> is your Prophet<sup>saww</sup>, and Al Islam is your Religion, and so and so is your Imam<sup>asws</sup>. Listen and understand’; and repeat it to him three times, this indoctrination (<span class=\"iTxt\">Talqeen</span>)’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Muhammad ibn Isma’il from Ali ibn al-Hakam from Muhammad ibn Sinan from Mahfuz al- Iskaf who has said the following: “Abu ‘Abd Allah, Alayhi al-Salam, has said that the person nearest in kinship to the deceased should enter the grave for burial near his head, remove the shroud from the right side of his face, place it on earth, with his mouth near the ear of the deceased, say three times, ‘Listen and understand.’ Allah is your Lord, Muhammad is your prophet, al-Islam is your religion, so and so is your Imam. Listen and understand. He should repeat this dictation three times.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/98)"
        ],
        "index": 4533,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:64:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ إِذَا وُضِعَ الْمَيِّتُ فِي لَحْدِهِ فَقُلْ بِسْمِ اللَّهِ وَ فِي سَبِيلِ اللَّهِ وَ عَلَى مِلَّةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) عَبْدُكَ ابْنُ عَبْدِكَ نَزَلَ بِكَ وَ أَنْتَ خَيْرُ مَنْزُولٍ بِهِ اللَّهُمَّ افْسَحْ لَهُ فِي قَبْرِهِ وَ أَلْحِقْهُ بِنَبِيِّهِ اللَّهُمَّ إِنَّا لَا نَعْلَمُ مِنْهُ إِلَّا خَيْراً وَ أَنْتَ أَعْلَمُ بِهِ ",
          "فَإِذَا وَضَعْتَ عَلَيْهِ اللَّبِنَ فَقُلِ اللَّهُمَّ صِلْ وَحْدَتَهُ وَ آنِسْ وَحْشَتَهُ وَ أَسْكِنْ إِلَيْهِ مِنْ رَحْمَتِكَ رَحْمَةً تُغْنِيهِ عَنْ رَحْمَةِ مَنْ سِوَاكَ ",
          "فَإِذَا خَرَجْتَ مِنْ قَبْرِهِ فَقُلْ إِنَّا لِلَّهِ وَ إِنَّا إِلَيْهِ رَاجِعُونَ وَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ اللَّهُمَّ ارْفَعْ دَرَجَتَهُ فِي أَعْلَى عِلِّيِّينَ وَ اخْلُفْ عَلَى عَقِبِهِ فِي الْغَابِرِينَ يَا رَبَّ الْعَالَمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, from Muhammad Bin Muslim, ",
            "from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) having said: ‘When the deceased is placed in his chasm (<span class=\"iTxt\">Lahad</span>), so say, ‘In the Name of Allah<sup>azwj</sup> and in the Way of Allah<sup>azwj</sup>, and upon the Religion of Rasool-Allah<sup>saww</sup>. Your<sup>azwj</sup> servant, son of Your<sup>azwj</sup> servfant has lodged with You<sup>azwj</sup> and You<sup>azwj</sup> are the best of the Hosts with him. O Allah<sup>azwj</sup>! Expand for him in his grave, and Attach him with Your<sup>azwj</sup> Prophet<sup>azwj</sup>. O Allah<sup>azwj</sup>! We do not know from him except for goodness, and Your<sup>azwj</sup> are more Knowing with him. ",
            "So when the slab is placed upon him, say, ‘O Allah<sup>azwj</sup>! (Grant) companionship for his loneliness, and calmness for his fear, and Setlle upon him a Mercy from Your<sup>azwj</sup> Mercies which would suffice him from (all) mercies besides Yours<sup>saww</sup>’. ",
            "So when you come out from his grave, say, ‘We are from Allah<sup>azwj</sup> to Him<sup>azwj</sup> are we returning, and the Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds. O Allah<sup>azwj</sup>! Raise his leves in the high Illiyeen and Make a successor to be among his remaining offspring, O Lord<sup>azwj</sup> of the worlds’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz from Muhammad ibn Muslim from one of the two Imam the following: “The Imam, ‘Alayhi al-Salam, said, ‘When a deceased is placed in the grave you should say, “(I begin) in the name of Allah, in the way of Allah and according to the traditions of the Messenger of Allah. (O Allah), this, Your servant, son of Your servant has become Your guest and You are the best host. O Allah, make his grave spacious and join him with his prophet. O Allah, all we know of him is good but You are more knowledgeable about him than we are.” When you place the slab, (to cover his grave) say, “O Allah, find connections for his loneliness and comfort for his dread. Settle with him from Your mercy a mercy that will suffice him of the mercy of those other than Yourself.” When coming out of the grave say, “We are for Allah and to Him we return. All praise belongs to Allah, Lord of the worlds. O Allah, raise his position in the highest of high places, make a successor among those whom he has left behind, who suffer grief, O Lord of the worlds.”’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/99)"
        ],
        "index": 4534,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:64:7",
        "text": [
          "عَنْهُ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ زُرَارَةَ قَالَ إِذَا وَضَعْتَ الْمَيِّتَ فِي لَحْدِهِ قَرَأْتَ آيَةَ الْكُرْسِيِّ وَ اضْرِبْ يَدَكَ عَلَى مَنْكِبِهِ الْأَيْمَنِ ثُمَّ قُلْ يَا فُلَانُ قُلْ رَضِيتُ بِاللَّهِ رَبّاً وَ بِالْإِسْلَامِ دِيناً وَ بِمُحَمَّدٍ ( صلى الله عليه وآله ) نَبِيّاً وَ بِعَلِيٍّ ( عليه السلام ) إِمَاماً وَ سَمِّ إِمَامَ زَمَانِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from his father, from Hammad, from Hareyz, from Zurara, ",
            "‘He<sup>asws</sup> said: ‘When you place the deceased in his chasm (<span class=\"iTxt\">Lahad</span>), recite <span class=\"iTxt\">Ayat Al Kursy</span> (Chapter 2:255), and strike your hand upon his right shoulder, then say, ‘O so and so! Say, ‘I am pleased with Allah<sup>azwj</sup> as Lord<sup>azwj</sup>, and with Al Islam as Religion, and with Muhammad<sup>saww</sup> as Prophet<sup>saww</sup>, and with Ali<sup>asws</sup> as Imam<sup>asws</sup>’, and name the Imam<sup>asws</sup> of his time’."
          ],
          "en.sarwar": [
            "7. It is a narration from him (narrator of previous Hadith) by his father from Hammad from Hariz from Zurarah who has said the following: “He (the Imam), ‘Alayhi al-Salam, has said, that when you place a deceased in his grave, read Ayatu al-Kursiy and hold his right shoulder with your hand, then say, ‘O so and so say, “I accept Allah as the Lord, al-Islam as the religion, Muhammad as the prophet and Ali as the Imam.” Then mention the Imam of his time.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/100)"
        ],
        "index": 4535,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:64:8",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ سَمَاعَةَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا أَقُولُ إِذَا أَدْخَلْتُ الْمَيِّتَ مِنَّا قَبْرَهُ قَالَ قُلِ اللَّهُمَّ هَذَا عَبْدُكَ فُلَانٌ وَ ابْنُ عَبْدِكَ قَدْ نَزَلَ بِكَ وَ أَنْتَ خَيْرُ مَنْزُولٍ بِهِ وَ قَدِ احْتَاجَ إِلَى رَحْمَتِكَ اللَّهُمَّ وَ لَا نَعْلَمُ مِنْهُ إِلَّا خَيْراً وَ أَنْتَ أَعْلَمُ بِسَرِيرَتِهِ وَ نَحْنُ الشُّهَدَاءُ بِعَلَانِيَتِهِ ",
          "اللَّهُمَّ فَجَافِ الْأَرْضَ عَنْ جَنْبَيْهِ وَ لَقِّنْهُ حُجَّتَهُ وَ اجْعَلْ هَذَا الْيَوْمَ خَيْرَ يَوْمٍ أَتَى عَلَيْهِ وَ اجْعَلْ هَذَا الْقَبْرَ خَيْرَ بَيْتٍ نَزَلَ فِيهِ وَ صَيِّرْهُ إِلَى خَيْرٍ مِمَّا كَانَ فِيهِ وَ وَسِّعْ لَهُ فِي مَدْخَلِهِ وَ آنِسْ وَحْشَتَهُ وَ اغْفِرْ ذَنْبَهُ وَ لَا تَحْرِمْنَا أَجْرَهُ وَ لَا تُضِلَّنَا بَعْدَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Ibn Mahboub, from Abu Ayoub, from Sama’at who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘What should I be saying when I enter into the grave of a deceased of ours?’ He<sup>asws</sup> said: ‘Say, ‘This is Your<sup>azwj</sup> servant, so and so, and a son of Your<sup>azwj</sup> servant who had lodged with You<sup>azwj</sup> and You<sup>azwj</sup> are the best of the Hosts with him, and he is needy to Your<sup>azwj</sup> Mercy. O Allah<sup>azwj</sup>! And we do not know from him except for goodness and You<sup>azwj</sup> are more Knowing with his secrets, and we are the witnesses of the apparent. ",
            "O Allah<sup>azwj</sup>! Expand the ground from his two sides, and let him meet his Proof<sup>asws</sup> and Make this day to be the best day to come upon him, and Make this grave to be the best house he had lodged in, and for him to come to be into goodness from what he used to be in, and Expand for him in his entrance, and Comfort his fear, and Forgive his sins, and do not Deprive us of its Recompense, nor Let us stray after him’."
          ],
          "en.sarwar": [
            "8. A number of our people have narrated from Sahl ibn Ziyad and Muhammad ibn Yahya from Ahmad ibn Muhammad all from ibn Mahbub from abu Ayyub from Sanaa ‘ah who has said the following: “I asked abu ’Abd Allah, ‘Alayhi al-Salam, ‘What should we say when placing a deceased from us in the grave?’ He said to say, ‘O Allah, this is Your servant so and so son of Your servant who has become Your guest and You are the best host. He is in need of Your mercy. O Allah, all we know from him is good. You know his secrets. We are only witnesses about his appearances. O Allah, make the earth spacious on his both sides. Dictate to him the statement of authority (that he needs) and make this day the best of days that he has ever lived. Make this grave the best house where he has ever lived. Place him in the best of what he has ever experienced. Make his entrance spacious, comfort his dread, forgive his sins and do not deprive us of the reward (because of him) and do not make us to go astray thereafter.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/100)"
        ],
        "index": 4536,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:64:9",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ يُشَقُّ الْكَفَنُ مِنْ عِنْدِ رَأْسِ الْمَيِّتِ إِذَا أُدْخِلَ قَبْرَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from someone else from our companions, ",
            "from Abu Abdullah<sup>asws</sup> having said: ‘Tear (slightly) the shroud from the head of the deceased when you enter his grave’."
          ],
          "en.sarwar": [
            "9. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from more than one person of our people who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that a shroud should be cut open from where the head of the deceased is when he is placed in the grave.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/101)"
        ],
        "index": 4537,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:64:10",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبَانٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَيَابَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سُلَّ الْمَيِّتَ سَلًّا ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from one of his companions, from Aban, from Abdul Rahman Bin Sayaba, ",
            "from Abu Abdullah<sup>asws</sup> having said: ‘Placed the deceased with a gentle placing (in his grave)’."
          ],
          "en.sarwar": [
            "10. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad ibn Sama‘ah from certain individuals of his people from Aban from ‘Abd al- Rahman ibn Sayabah from abu ‘Abd Allah, who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘You should place the deceased in the grave gently.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/101)"
        ],
        "index": 4538,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:64:11",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا وَضَعْتَ الْمَيِّتَ فِي الْقَبْرِ قُلْتَ اللَّهُمَّ هَذَا عَبْدُكَ وَ ابْنُ عَبْدِكَ وَ ابْنُ أَمَتِكَ نَزَلَ بِكَ وَ أَنْتَ خَيْرُ مَنْزُولٍ بِهِ ",
          "فَإِذَا سَلَلْتَهُ مِنْ قِبَلِ الرِّجْلَيْنِ وَ دَلَّيْتَهُ قُلْتَ بِسْمِ اللَّهِ وَ بِاللَّهِ وَ عَلَى مِلَّةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) اللَّهُمَّ إِلَى رَحْمَتِكَ لَا إِلَى عَذَابِكَ اللَّهُمَّ افْسَحْ لَهُ فِي قَبْرِهِ وَ لَقِّنْهُ حُجَّتَهُ وَ ثَبِّتْهُ بِالْقَوْلِ الثَّابِتِ وَ قِنَا وَ إِيَّاهُ عَذَابَ الْقَبْرِ ",
          "وَ إِذَا سَوَّيْتَ عَلَيْهِ التُّرَابَ قُلِ اللَّهُمَّ جَافِ الْأَرْضَ عَنْ جَنْبَيْهِ وَ أَصْعِدْ رُوحَهُ إِلَى أَرْوَاحِ الْمُؤْمِنِينَ فِي عِلِّيِّينَ وَ أَلْحِقْهُ بِالصَّالِحِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Usman Bin Isa, from Sama’at, ",
            "from Abu Abdullah<sup>asws</sup> having said: ‘When you place the deceased in the grave, you should say, ‘O Allah<sup>azwj</sup>! This is Your<sup>azwj</sup> and a son of Your<sup>azwj</sup> servant and a son of Your<sup>azwj</sup> maid. He is lodged with You<sup>azwj</sup> and You<sup>azwj</sup> are the best of the Host with him’. ",
            "So when you place him from the direction of his left and dangle him, say, ‘In the Name of Allah<sup>azwj</sup> and by Allah<sup>azwj</sup> and upon the Religion of Rasool-Allah<sup>saww</sup>. O Allah<sup>azwj</sup>! To Your<sup>azwj</sup> Mercy, not to Your<sup>azwj</sup> Punishment. O Allah<sup>azwj</sup>! Expand his grave for him, and let him meet his Proof<sup>asws</sup> and Affirm him with the firm words, and Save us and him from the Punishment of the grave’. ",
            "And when you even the soil upon him, say, ‘O Allah<sup>azwj</sup>! Expand the ground from his two sides and Ascend him to the souls of the Believers in Illiyeen, and Join him with the righteous ones’."
          ],
          "en.sarwar": [
            "11. A number of our people have narrated from Ahmad ibn Muhammad from ‘Uthman ibn ‘Isa from Sama‘ah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that when you place a deceased in the grave say, ‘O Allah [this is] Your servant son of a male servant and a female servant who has become Your guest and You are the best host.’ When you send the body upward from where the feet are to be placed to the place for the head say, ‘(I begin) in the name of Allah, with Allah and according to the tradition of the Messenger of Allah. O Allah, (send him) to Your mercy but not to Your punishment. O Allah, make his grave spacious, dictate him the statement of his authority, make him steadfast upon the solid words, protect him and us against the torment of fire.’ When earth is leveled upon him say, ‘O Allah, make the earth spacious on his both sides. Raise his spirit toward the spirits of the believing people in the high places and join him with righteous ones.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:3:64",
  "kind": "verse_list"
}