{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 74"
        },
        "path": "/books/al-kafi:3:3:74",
        "titles": {
          "ar": "باب الْغَرِيقِ وَ الْمَصْعُوقِ",
          "en": "Chapter 74 – The drowned and the one struck by lightning"
        }
      }
    ],
    "index": 646,
    "local_index": 74,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 75"
        },
        "path": "/books/al-kafi:3:3:75",
        "titles": {
          "ar": "باب الْقَتْلَى",
          "en": "Chapter 75 – The killed"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 73"
        },
        "path": "/books/al-kafi:3:3:73",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب غُسْلِ الْأَطْفَالِ</span> وَ الصِّبْيَانِ وَ الصَّلَاةِ عَلَيْهِمْ",
          "en": "Chapter 73 – Washing the children and boys, and the Salaat upon them"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:3:74",
    "titles": {
      "ar": "باب الْغَرِيقِ وَ الْمَصْعُوقِ",
      "en": "Chapter 74 – The drowned and the one struck by lightning"
    },
    "verse_count": 6,
    "verse_start_index": 4585,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/141)"
        ],
        "index": 4586,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:74:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي الْحَسَنِ الْأَوَّلِ ( عليه السلام ) فِي الْمَصْعُوقِ وَ الْغَرِيقِ قَالَ يُنْتَظَرُ بِهِ ثَلَاثَةَ أَيَّامٍ إِلَّا أَنْ يَتَغَيَّرَ قَبْلَ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Al Hakam, ",
            "from Abu Al Hassan<sup>asws</sup> the 1<sup>st</sup> regarding the one struck by lightning and the drowned. He<sup>asws</sup> said: ‘They would be awaited with for three days except if (their state) were to alter before that’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hisham ibn al-Hakam who has said the following: “About people found dead because of a sudden shock or drowned, abu al-Hassan, ‘Alayhi al-Salam, has said to wait three days unless a change in their condition takes place earlier.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/142)"
        ],
        "index": 4587,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:74:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ سَأَلْتُهُ عَنِ الْغَرِيقِ أَ يُغَسَّلُ قَالَ نَعَمْ وَ يُسْتَبْرَأُ قُلْتُ وَ كَيْفَ يُسْتَبْرَأُ قَالَ يُتْرَكُ ثَلَاثَةَ أَيَّامٍ قَبْلَ أَنْ يُدْفَنَ وَ كَذَلِكَ أَيْضاً صَاحِبُ الصَّاعِقَةِ فَإِنَّهُ رُبَّمَا ظَنُّوا أَنَّهُ مَاتَ وَ لَمْ يَمُتْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Sayf Bin Umeyra, from Is’haq Bin Ammar who said, ",
            "‘I asked him<sup>asws</sup> about the drowned, would he be washed (prior to burial)?’ He<sup>asws</sup> said: ‘Yes, and he would be absolved’. I said, ‘And how would he be absolved?’ He<sup>asws</sup> said: ‘He would be left for three days before he is buried; and similar to that is the one struck by lightning, for he, perhaps they think he is dead and he has not died’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from Sayf ibn ‘Amirah from Ishaq ibn ‘Ammar who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, if there is Ghusl (bath) for one who has died because of drowning. He (the Imam) said, ‘Yes, there is Ghusl (bath) and he is freed (of doubtful condition).’ I then asked, ‘How is he freed?’ He (the Imam) said, ‘He is left for three days before burial and so also is the case of one found dead because of a sudden shock. People think he is dead, perhaps he is not dead.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/142)"
        ],
        "index": 4588,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:74:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) يَقُولُ الْغَرِيقُ يُغَسَّلُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al Momineen<sup>asws</sup> was saying: ‘The drowned one would be washed (prior to burial)’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin, ‘Alayhi al-Salam, has said, ‘Ghusl (bath) of one who has died because of drowning is necessary.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/142)"
        ],
        "index": 4589,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:74:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ أَحْمَدَ بْنِ الْحَسَنِ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ مُصَدِّقِ بْنِ صَدَقَةَ عَنْ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْغَرِيقُ يُحْبَسُ حَتَّى يَتَغَيَّرَ وَ يُعْلَمَ أَنَّهُ قَدْ مَاتَ ثُمَّ يُغَسَّلُ وَ يُكَفَّنُ ",
          "قَالَ وَ سُئِلَ عَنِ الْمَصْعُوقِ فَقَالَ إِذَا صُعِقَ حُبِسَ يَوْمَيْنِ ثُمَّ يُغَسَّلُ وَ يُكَفَّنُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Ahmad Bin Al Hassan, from Amro Bin Saeed, from Musaddaq Bin Sadaqa, from Ammar, ",
            "from Abu Abdullah<sup>asws</sup> having said: ‘The drowned one would be withheld until his (state) changes, and it is known that he is dead. Then he would be washed and enshrouded’. ",
            "He (the narrator) said, ‘And he<sup>asws</sup> was asked about the one struck by lightning, so he<sup>asws</sup> said: ‘He would be withheld for two days, then he would be washed and enshrouded’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Muhammad ibn Ahmad ibn al-Hassan from ‘Amr ibn Sa‘id from Musaddiq ibn Sadaqah from ‘Ammar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘One who has died because of drowning is kept until there is a change and his death becomes certain; then his Ghusl (bath) and shroud are done.’ He (the narrator) has said that he (the Imam) was asked about one who has died because of a sudden shock. He (the Imam) said, ‘If it (death) is because of sudden shock, he is kept for two days, then his Ghusl (bath) and shroud are done.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح على الظاهر</span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/143)"
        ],
        "index": 4590,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:74:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ إِسْمَاعِيلَ بْنِ عَبْدِ الْخَالِقِ أَخِي شِهَابِ بْنِ عَبْدِ رَبِّهِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) خَمْسٌ يُنْتَظَرُ بِهِمْ إِلَّا أَنْ يَتَغَيَّرُوا الْغَرِيقُ وَ الْمَصْعُوقُ وَ الْمَبْطُونُ وَ الْمَهْدُومُ وَ الْمُدَخَّنُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Ismail Bin Abdul Khaliq a brother of Shihaab Bin Abd Rabbih who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Five would be awaited with them unless they alter – (the one who) drowned, and the onestruck by lightning, and the one suffering from intenstinal ailments, and the one crushed, and one subjected to fumes’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from ’Isma‘il ibn ‘Abd Allah al-Khaliq, brother of Shihab ibn ‘Abd Rabbihi who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Burial is delayed, unless there is a change, because of five kinds of reasons for death: Death because of drowning, sudden shock, internal (illness pain), crushed and smoke (fumigation).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/143)"
        ],
        "index": 4591,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:74:6",
        "text": [
          "أَحْمَدُ بْنُ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ أَصَابَ النَّاسَ بِمَكَّةَ سَنَةً مِنَ السِّنِينَ صَوَاعِقُ كَثِيرَةٌ مَاتَ مِنْ ذَلِكَ خَلْقٌ كَثِيرٌ فَدَخَلْتُ عَلَى أَبِي إِبْرَاهِيمَ ( عليه السلام ) فَقَالَ مُبْتَدِئاً مِنْ غَيْرِ أَنْ أَسْأَلَهُ يَنْبَغِي لِلْغَرِيقِ وَ الْمَصْعُوقِ أَنْ يُتَرَبَّصَ بِهِ ثَلَاثاً لَا يُدْفَنُ إِلَّا أَنْ تَجِي‏ءَ مِنْهُ رِيحٌ تَدُلُّ عَلَى مَوْتِهِ قُلْتُ جُعِلْتُ فِدَاكَ كَأَنَّكَ تُخْبِرُنِي أَنَّهُ قَدْ دُفِنَ نَاسٌ كَثِيرٌ أَحْيَاءً فَقَالَ نَعَمْ يَا عَلِيُّ قَدْ دُفِنَ نَاسٌ كَثِيرٌ أَحْيَاءً مَا مَاتُوا إِلَّا فِي قُبُورِهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Muhammad Bin Ali, from Ali Bin Abu Hamza who said, ",
            "‘The people at Makkah were hit by a lot of lightning during a year from the year. A lot of people died from that. So I went over to Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), and he<sup>asws</sup> said initiating from without me asking him<sup>asws</sup>: ‘It is befitting for the drowned one and the one struck by lightning that they should be awaited with for three (days) not being buried exept if a smell comes out from him evidencing upon his death’. I said, ‘May I be sacrificed for you<sup>asws</sup>! It is as if you<sup>asws</sup> are informing me that a lot of the people have been buried alive!’. So he<sup>asws</sup> said: ‘Yes, O Ali! A lot of people have been buried alive. They did not died except inside their graves’."
          ],
          "en.sarwar": [
            "6. Ahmad ibn Mehran has narrated from Muhammad ibn Ali from Ali ibn abu Hamzah who has said the following: “In one of the years many people in Makkah died because of a great deal of lightning and thunder. I visited abu Ibrahim, ‘Alayhi al-Salam, and he, without asking, initiated stating, ‘It is proper to delay for three days the burial of one who has died because of drowning and sudden shock unless the spread of smell proves his death.’ I then said, ‘I pray to Allah to keep my soul in service for your cause, are you telling me that many people are buried alive? He (the Imam) said, ‘Yes, O Ali, many people were buried alive and they did not die but in their graves.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:3:74",
  "kind": "verse_list"
}