{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 81"
        },
        "path": "/books/al-kafi:3:3:81",
        "titles": {
          "ar": "باب التَّعَزِّي",
          "en": "Chapter 81 – The condolences"
        }
      }
    ],
    "index": 653,
    "local_index": 81,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 82"
        },
        "path": "/books/al-kafi:3:3:82",
        "titles": {
          "ar": "باب الصَّبْرِ وَ الْجَزَعِ وَ الِاسْتِرْجَاعِ",
          "en": "Chapter 82– The patience, and the panic, and the saying of [2:156] Surely we are for Allah and to Him we are returning"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 80"
        },
        "path": "/books/al-kafi:3:3:80",
        "titles": {
          "ar": "باب الْمُصِيبَةِ بِالْوَلَدِ",
          "en": "Chapter 80 – The bereavement with the son"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:3:81",
    "titles": {
      "ar": "باب التَّعَزِّي",
      "en": "Chapter 81 – The condolences"
    },
    "verse_count": 8,
    "verse_start_index": 4627,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/174)"
        ],
        "index": 4628,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:81:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سُلَيْمَانَ بْنِ عَمْرٍو النَّخَعِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ أُصِيبَ بِمُصِيبَةٍ فَلْيَذْكُرْ مُصَابَهُ بِالنَّبِيِّ ( صلى الله عليه وآله ) فَإِنَّهُ مِنْ أَعْظَمِ الْمَصَائِبِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Al Hakam, from Suleyman Bin Amro and Al Nakhai’e, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who is hit with a bereavement, so let him recall his bereavement with that of the Prophet<sup>saww</sup>, for it is the greatest of the bereavements’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn al-Hakam from Sulayman ibn ‘Amr al-Nakha’i who has said the following: “Abu ’Abd Allah, ‘Alayhi al-Salam, has said that if one experiences grief and sorrow due to someone’s death, he should compare this with that which one has experienced due to the death of the Holy Prophet.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/174)"
        ],
        "index": 4629,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:81:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَمَّارِ بْنِ مَرْوَانَ عَنْ زَيْدٍ الشَّحَّامِ عَنْ عَمْرِو بْنِ سَعِيدٍ الثَّقَفِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ إِنْ أُصِبْتَ بِمُصِيبَةٍ فِي نَفْسِكَ أَوْ فِي مَالِكَ أَوْ فِي وُلْدِكَ فَاذْكُرْ مُصَابَكَ بِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَإِنَّ الْخَلَائِقَ لَمْ يُصَابُوا بِمِثْلِهِ قَطُّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Sinan, from Ammar Bin Marwan, from Zayd Al Shahaam, from Amro Bin Saeed Al Saqafy, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘If you are hit by a difficulty with regards to yourself, or regarding your wealth, or regarding your children, so recall your difficulty (bereavement) with (that of) Rasool-Allah<sup>saww</sup>, for the creatures would never be hit by (a bereavement) the likes of him<sup>saww</sup>, at all!’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from ‘Ammar ibn Marwan from Zayd al-Shahham from ‘Amr ibn Sa‘id al-Thaqafiy who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘If you suffer sorrow and grief about yourself, your property or children, then remind yourself of the sorrow and grief you have suffered due to the death of the Messenger of Allah; creatures have never suffered any grief as this (death of the Messenger of Allah).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/175)"
        ],
        "index": 4630,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:81:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ عَبْدِ اللَّهِ بْنِ الْوَلِيدِ الْجُعْفِيِّ عَنْ رَجُلٍ عَنْ أَبِيهِ قَالَ لَمَّا أُصِيبَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) نَعَى الْحَسَنُ إِلَى الْحُسَيْنِ ( عليهما السلام ) وَ هُوَ بِالْمَدَائِنِ فَلَمَّا قَرَأَ الْكِتَابَ قَالَ يَا لَهَا مِنْ مُصِيبَةٍ مَا أَعْظَمَهَا مَعَ أَنَّ رَسُولَ اللَّهِ  ( صلى الله عليه وآله ) قَالَ مَنْ أُصِيبَ مِنْكُمْ بِمُصِيبَةٍ فَلْيَذْكُرْ مُصَابَهُ بِي فَإِنَّهُ لَنْ يُصَابَ بِمُصِيبَةٍ أَعْظَمَ مِنْهَا وَ صَدَقَ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ismail Bin Mihran, from Sayf Bin Ameyra, from Amro Bin Shimr, from Abdullah Bin Al Waleed Al Ju’fy, from a man, from his father who said, ",
            "‘When Amir Al-Momineen<sup>asws</sup> passed away, Al-Hassan<sup>asws</sup> notified Al-Husayn<sup>asws</sup>, and he<sup>asws</sup> was in Al-Medina. So when he<sup>asws</sup> recited the letter, said: ‘O what a calamity! How great it is along with that Rasool-Allah<sup>saww</sup> said: ‘The one among you who is hit with a difficulty (bereavement), so let him recall his bereavement with me<sup>saww</sup>, for he would never be hit by a calamity greater than it’, and he<sup>saww</sup> spoke the truth’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Isma’il ibn Mehran from Sayf ibn ‘Amirah from ‘Amr ibn Shimr from ‘Abd Allah ibn al-Walid al-Ju’fiy from a man from his father who has said the following: “When ’Amir al-Mu’minin, Ali passed away, al-Hassan informed Al-Husayn, ‘Alayhim al-Salam, about it. He was in al-Mada’in (a place near Baghdad) at that time. When he read the letter, he said, ‘How intense and great is this sorrow! Even though the Messenger of Allah has said that if you experience grief and sorrow, remind yourself of your sorrow and grief about me. It is very true that no sorrow and grief is more intense and greater than the sorrow and grief for him, he has certainly spoken the truth.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/175)"
        ],
        "index": 4631,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:81:4",
        "refs": {
          "Quran": [
            "/books/quran:3:185"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا مَاتَ النَّبِيُّ ( صلى الله عليه وآله ) سَمِعُوا صَوْتاً وَ لَمْ يَرَوْا شَخْصاً يَقُولُ كُلُّ نَفْسٍ ذائِقَةُ الْمَوْتِ وَ إِنَّما تُوَفَّوْنَ أُجُورَكُمْ يَوْمَ الْقِيامَةِ فَمَنْ زُحْزِحَ عَنِ النَّارِ وَ أُدْخِلَ الْجَنَّةَ فَقَدْ فازَ ",
          "وَ قَالَ إِنَّ فِي اللَّهِ خَلَفاً مِنْ كُلِّ هَالِكٍ وَ عَزَاءً مِنْ كُلِّ مُصِيبَةٍ وَ دَرَكاً مِمَّا فَاتَ فَبِاللَّهِ فَثِقُوا وَ إِيَّاهُ فَارْجُوا وَ إِنَّمَا الْمَحْرُومُ مَنْ حُرِمَ الثَّوَابَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the Prophet<sup>saww</sup> passed away, a voice was heard, and the person was not seen, saying: ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:3#h185\">[3:185]</a> Every self shall taste the death, but rather you shall only be paid fully your Reward on the Day of Judgement; then whoever is removed far away from the Fire and is made to enter the Paradise he indeed has succeeded</span>’.",
            "And he<sup>asws</sup> said: ‘In the Presence of Allah<sup>azwj</sup> is a replacement from every dying one, and a condolence from every bereavement, and a compensation for what is lost. Thus, on Allah<sup>azwj</sup> you should be relying, and to Him<sup>azwj</sup> should you be hoping, and rather the deprived one is the one deprived of the Rewards’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hisham ibn Salim who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that when the Messenger of Allah passed away they (people) heard a voice, but did not see anyone in person, saying, ‘Every soul is to experience the taste of death. You will certainly receive your reward on the Day of Judgment. Whoever is saved from the fire and is admitted in paradise, has become successful indeed.’ It also said, ‘In (the mercy of) Allah are good consequences for everyone who dies, solace for all forms of sorrow and compensation for every loss. In Allah, you must trust and in Him only place your hope. Deprived person, in reality, is one who is deprived of the rewards from Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/177)"
        ],
        "index": 4632,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:81:5",
        "refs": {
          "Quran": [
            "/books/quran:3:185"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنْ سُلَيْمَانَ بْنِ سَمَاعَةَ عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا قُبِضَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) جَاءَهُمْ جَبْرَئِيلُ ( عليه السلام ) وَ النَّبِيُّ مُسَجًّى وَ فِي الْبَيْتِ عَلِيٌّ وَ فَاطِمَةُ وَ الْحَسَنُ وَ الْحُسَيْنُ ( عليهم السلام ) فَقَالَ السَّلَامُ عَلَيْكُمْ يَا أَهْلَ بَيْتِ الرَّحْمَةِ كُلُّ نَفْسٍ ذائِقَةُ الْمَوْتِ وَ إِنَّما تُوَفَّوْنَ أُجُورَكُمْ يَوْمَ الْقِيامَةِ فَمَنْ زُحْزِحَ عَنِ النَّارِ وَ أُدْخِلَ الْجَنَّةَ فَقَدْ فازَ وَ مَا الْحَياةُ الدُّنْيا إِلَّا مَتاعُ الْغُرُورِ ",
          "إِنَّ فِي اللَّهِ عَزَّ وَ جَلَّ عَزَاءً مِنْ كُلِّ مُصِيبَةٍ وَ خَلَفاً مِنْ كُلِّ هَالِكٍ وَ دَرَكاً لِمَا فَاتَ فَبِاللَّهِ فَثِقُوا وَ إِيَّاهُ فَارْجُوا فَإِنَّ الْمُصَابَ مَنْ حُرِمَ الثَّوَابَ هَذَا آخِرُ وَطْئِي مِنَ الدُّنْيَا قَالُوا فَسَمِعْنَا الصَّوْتَ وَ لَمْ نَرَ الشَّخْصَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Salama Bin Al Khattab, from Suleyman Bin Sama’at, from Al Husayn Bin Al Mukhtar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When Rasool-Allah<sup>saww</sup> passed away, Jibraeel<sup>as</sup> came over to them<sup>asws</sup>, and the Prophet<sup>saww</sup> was enshrouded and was in the house of Ali<sup>asw</sup><sup>s</sup>, and Syeda Fatima<sup>asws</sup>, and Al-Hassan<sup>asws</sup>, and Al-Husayn<sup>asws</sup>. So he<sup>as</sup> said: ‘O People<sup>asws</sup> of the House of Mercy! <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h185\">[3:185]</a> Every self shall taste the death, but rather you shall only be paid fully your Reward on the Day of Judgement; then whoever is removed far away from the Fire and is made to enter the Paradise he indeed has succeeded</span>. And what is the life of the world except a provision of deception.",
            "In the Presence of Allah<sup>azwj</sup> Mighty and Majestic is a condolence from every difficulty (bereavement), and a replacement for every dying one, and a compensation for whatever is lost. Thus, in Allah<sup>azwj</sup> you should be relying, and to Him<sup>azwj</sup> should you be hoping, for the one in difficulty is the one who is deprived of the Rewards of this Recompense of having set foot from the world’. So they said, ‘We heard the voice but we did not see the person’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Salmah ibn al-Khattab from Sulayman ibn Sama‘ah from Al-Husayn ibn al-Mukhtar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that when the Messenger of Allah passed away, Jibril (the archangel) came to them when the Holy Prophet was covered with a sheet of cloth, and in the house there were Ali, Fatimah, al-Hassan and Al-Husayn, ‘Alayhim al-Salam. He said, ‘Assalamu ‘Alaykum’ (you are ‘Alayhim al-Salam ), O family of the house of mercy. Every soul must experience the taste of death. You will receive your reward (from Allah) on the Day of Judgment only. Those who are saved from fire and are admitted into paradise are indeed successful. The worldly life is only a deceitful means. In Allah, the Most Majestic, the Most Glorious, alone is solace for all kinds of sorrow, good consequences for everyone who dies and proper compensation for all kinds of losses. In Allah, you must trust and in Him alone you must place your hopes. A truly deprived person is one who is deprived of rewards from Allah. This is the last time for my coming to this world.’ They said, ‘We heard his voice but did not see his person.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/179)"
        ],
        "index": 4633,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:81:6",
        "refs": {
          "Quran": [
            "/books/quran:3:185"
          ]
        },
        "text": [
          "عَنْهُ عَنْ سَلَمَةَ عَنْ عَلِيِّ بْنِ سَيْفٍ عَنْ أَبِيهِ عَنْ أَبِي أُسَامَةَ زَيْدٍ الشَّحَّامِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا قُبِضَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) جَاءَتِ التَّعْزِيَةُ أَتَاهُمْ آتٍ يَسْمَعُونَ حِسَّهُ وَ لَا يَرَوْنَ شَخْصَهُ فَقَالَ السَّلَامُ عَلَيْكُمْ أَهْلَ الْبَيْتِ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ كُلُّ نَفْسٍ ذائِقَةُ الْمَوْتِ وَ إِنَّما تُوَفَّوْنَ أُجُورَكُمْ يَوْمَ الْقِيامَةِ فَمَنْ زُحْزِحَ عَنِ النَّارِ وَ أُدْخِلَ الْجَنَّةَ فَقَدْ فازَ وَ مَا الْحَياةُ الدُّنْيا إِلَّا مَتاعُ الْغُرُورِ ",
          "فِي اللَّهِ عَزَّ وَ جَلَّ عَزَاءٌ مِنْ كُلِّ مُصِيبَةٍ وَ خَلَفٌ مِنْ كُلِّ هَالِكٍ وَ دَرَكٌ لِمَا فَاتَ فَبِاللَّهِ فَثِقُوا وَ إِيَّاهُ فَارْجُوا فَإِنَّ الْمَحْرُومَ مَنْ حُرِمَ الثَّوَابَ وَ السَّلَامُ عَلَيْكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ssalma, from Ali Bin Sayf, from his father, from Abu Asama Zayd Al Shahaam, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When Rasool-Allah<sup>saww</sup> passed away the condolences came with a comer whose (Jibraeel<sup>as</sup>’s voice they (people) heard but they<sup>asws</sup> did not see this<sup>as</sup> person. So he<sup>as</sup> said: ‘Greetings be upon you<sup>asws</sup>, People<sup>asws</sup> of the Household, and the Mercy of Allah<sup>azwj</sup> and His<sup>azwj</sup> Blessings. <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h185\">[3:185]</a> Every self shall taste the death, but rather you shall only be paid fully your Reward on the Day of Judgement; then whoever is removed far away from the Fire and is made to enter the Paradise he indeed has succeeded</span>. And what is the life of the world except for a provision of deception.",
            "In the Presence of Allah<sup>azwj</sup> Mighty and Majestic is a condolence for every difficulty (bereavement) and a replacement for every dying one, and a compensation for whatever is lost. Thus, on Allah<sup>azwj</sup> you should be relying, and to Him<sup>azwj</sup> should you be hoping, for the deprived one is the one who is deprive of the Rewards; and the greetings be upon you<sup>asws</sup>’’."
          ],
          "en.sarwar": [
            "6. It is narrated from him (narrator of above Hadith) from Salmah from Ali ibn Sayf from his father from abu ‘Usamah Zayd al-Shahham who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that when the Messenger of Allah passed away condolences were offered. Someone came to them and they felt his presence but did not see his person. He said, ‘Assalamu ‘Alaykum’ (you are ‘Alayhim al-Salam ), O people of the house and may Allah grant you favors and blessings. Every soul must experience the taste of death. You will receive your reward (from Allah) on the Day of Judgment only. Those who are saved from fire and are admitted into paradise are indeed successful. The worldly life is only a means of deceit. In Allah, the Most Majestic, the Most Glorious, alone is solace for all kinds of sorrow, good consequences for everyone who dies and proper compensation for all kinds of losses. In Allah, you must trust and in Him alone, you must place your hopes. A truly deprived person is one who is deprived of rewards from Allah. ‘al-Salamu ‘Alaykum’ (you are ‘Alayhim al-Salam ), [O people of the house and may Allah grant you favors and blessings].”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/180)"
        ],
        "index": 4634,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:81:7",
        "text": [
          "عَنْهُ عَنْ عَلِيِّ بْنِ سَيْفٍ عَنْ أَبِيهِ عَنْ أَبِي الْجَارُودِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) مِثْلَهُ وَ زَادَ فِيهِ قُلْتُ مَنْ كَانَ فِي الْبَيْتِ قَالَ عَلِيٌّ وَ فَاطِمَةُ وَ الْحَسَنُ وَ الْحُسَيْنُ ( عليهم السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ali Bin Sayf, from his father, from Abu Al Jaroud, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> – similar to it, and there is an increase in it – ‘I said, ‘Who were the ones in the house?’ He<sup>asws</sup> said: ‘Ali<sup>asws</sup>, and Fatima<sup>asws</sup>, and Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "7. It is narrated from him (narrator of above Hadith) from Ali ibn Sayf from his father from abu al-Jarud who has said the following: “He (the narrator) has narrated a similar Hadith from abu Ja’far, ‘Alayhi al-Salam, with this addition. ‘I asked, who were in the house?’ He replied, ‘They were Ali, Fatimah, al-Hassan and Al-Husayn, ‘Alayhim al-Salam.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/180)"
        ],
        "index": 4635,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:81:8",
        "refs": {
          "Quran": [
            "/books/quran:3:185"
          ]
        },
        "text": [
          "عَنْهُ عَنْ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ عِيسَى الْأَرْمَنِيِّ عَنِ الْحُسَيْنِ بْنِ عُلْوَانَ عَنْ عَبْدِ اللَّهِ بْنِ الْوَلِيدِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَمَّا قُبِضَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَتَاهُمْ آتٍ فَوَقَفَ بِبَابِ الْبَيْتِ فَسَلَّمَ عَلَيْهِمْ ثُمَّ قَالَ السَّلَامُ عَلَيْكُمْ يَا آلَ مُحَمَّدٍ كُلُّ نَفْسٍ ذائِقَةُ الْمَوْتِ وَ إِنَّما تُوَفَّوْنَ أُجُورَكُمْ يَوْمَ الْقِيامَةِ فَمَنْ زُحْزِحَ عَنِ النَّارِ وَ أُدْخِلَ الْجَنَّةَ فَقَدْ فازَ وَ مَا الْحَياةُ الدُّنْيا إِلَّا مَتاعُ الْغُرُورِ ",
          "فِي اللَّهِ عَزَّ وَ جَلَّ خَلَفٌ مِنْ كُلِّ هَالِكٍ وَ عَزَاءٌ مِنْ كُلِّ مُصِيبَةٍ وَ دَرَكٌ لِمَا فَاتَ فَبِاللَّهِ فَثِقُوا وَ عَلَيْهِ فَتَوَكَّلُوا وَ بِنَصْرِهِ لَكُمْ عِنْدَ الْمُصِيبَةِ فَارْضَوْا فَإِنَّمَا الْمُصَابُ مَنْ حُرِمَ الثَّوَابَ وَ السَّلَامُ عَلَيْكُمْ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ وَ لَمْ يَرَوْا أَحَداً ",
          "فَقَالَ بَعْضُ مَنْ فِي الْبَيْتِ هَذَا مَلَكٌ مِنَ السَّمَاءِ بَعَثَهُ اللَّهُ عَزَّ وَ جَلَّ إِلَيْكُمْ لِيُعَزِّيَكُمْ وَ قَالَ بَعْضُهُمْ هَذَا الْخَضِرُ ( عليه السلام ) جَاءَكُمْ يُعَزِّيكُمْ بِنَبِيِّكُمْ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Salma, from Muhammad Bin Isa Al Armany, from Al Husayn Bin Ulwan, from Abdullah Bin Al waleed, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When Rasool-Allah<sup>saww</sup> passed away, a comer came to them<sup>asws</sup> and paused by the door of the house. So he<sup>as</sup> greeted them<sup>asws</sup>, then said: ‘The greeting be upon you<sup>asws</sup>, O Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>! <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h185\">[3:185]</a> Every self shall taste the death, but rather you shall only be paid fully your Reward on the Day of Judgement; then whoever is removed far away from the Fire and is made to enter the Paradise he indeed has succeeded</span>. ",
            "In the Presence of Allah<sup>azwj</sup> Mighty and Majestic is a condolence from every difficulty (bereavement) and a replacement from every dying one, and a compensation for whatever is lost. Thus, on Allah<sup>azwj</sup> you<sup>asws</sup> should be trusting and upon Him<sup>azwj</sup> should you<sup>asws</sup> be relying and in His<sup>azwj</sup> Help for you<sup>asws</sup> during the difficulties, and be pleased, for the one in difficulty is the one who is deprived of the Rewards. And the greetings be upon you<sup>asws</sup>, and His<sup>azwj</sup> Mercy and His<sup>azwj</sup> Blessings.",
            "So someone from the ones in the house said: ‘This is an Angel from the sky. Allah<sup>azwj</sup> Mighty and Majestic Sent him to you<sup>asws</sup> in order to console you<sup>asws</sup>, and one of them said: ‘This is Khizr<sup>as</sup>, coming to you<sup>asws</sup> with condolences of your<sup>asws</sup> Prophet<sup>saww</sup>’."
          ],
          "en.sarwar": [
            "8. It is narrated from him (narrator of above Hadith) from Salmah from Muhammad ibn ‘Isa al-Armaniy from Al-Husayn ibn ‘Ulwan from ‘Abd Allah ibn al-Walid who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, when the Holy Prophet passed away, someone came to them and stood at door of the house. He offered them greeting of peace and then said, ‘O family of Muhammad, every soul must experience the taste of death. You will receive your reward (from Allah) on the Day of Judgment only. Those who are saved from fire and are admitted into paradise are indeed successful. The worldly life is only a means of deceit. In Allah, the Most Majestic, the Most Glorious, alone is solace for all kinds of sorrow, good consequences for everyone who dies and proper compensation for all kinds of losses. In Allah, you must trust and assign Him alone to be the person in charge of your affairs; and with His support for you alone, you must in grief and sorrow, agree. A truly affected person is one who is deprived of the rewards from Allah. Assalamu ‘Alaykum (you are ‘Alayhim al-Salam ) and may Allah grant you favors and blessings.’ No one saw him. Someone in the family said, ‘This is an angel from heaven. Allah, the Most Majestic, the Most Glorious, has sent him to you to offer you condolences.’ Someone else said, ‘He was al-Khadhiru who came to offer you condolences on the death of your Prophet.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:3:81",
  "kind": "verse_list"
}