{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 86"
        },
        "path": "/books/al-kafi:3:3:86",
        "titles": {
          "ar": "باب أَنَّ الْمَيِّتَ يَزُورُ أَهْلَهُ",
          "en": "Chapter 86 – The deceased visits his family"
        }
      }
    ],
    "index": 658,
    "local_index": 86,
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:3:86",
    "titles": {
      "ar": "باب أَنَّ الْمَيِّتَ يَزُورُ أَهْلَهُ",
      "en": "Chapter 86 – The deceased visits his family"
    },
    "verse_count": 5,
    "verse_start_index": 4666,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/195)"
        ],
        "index": 4667,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:86:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْمُؤْمِنَ لَيَزُورُ أَهْلَهُ فَيَرَى مَا يُحِبُّ وَ يُسْتَرُ عَنْهُ مَا يَكْرَهُ وَ إِنَّ الْكَافِرَ لَيَزُورُ أَهْلَهُ فَيَرَى مَا يَكْرَهُ وَ يُسْتَرُ عَنْهُ مَا يُحِبُّ ",
          "قَالَ وَ مِنْهُمْ مَنْ يَزُورُ كُلَّ جُمْعَةٍ وَ مِنْهُمْ مَنْ يَزُورُ عَلَى قَدْرِ عَمَلِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hafs Bin Al Bakhtary, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The (deceased) Believer visits his family, so he sees what he loves, and it is veiled from him what he dislikes from it; and the Infidel visits his family, so he sees what he dislikes, and it is veiled from him what he loves’.",
            "He<sup>asws</sup> said: ‘And from them is one who visits every Friday, and from them is one who visits upon the measurement of his (good) deeds’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘ Umayr from Hafs ibn af-Bakhtariy who has said the following: “Abu ’Abd Allah, ‘Alayhi al-Salam, has said that a believing deceased person visits his family. He observes such matters that he loves and what he dislikes is kept hidden from him. A deceased unbeliever person also visits his family but observes what he dislikes and things that he loves are kept hidden from him. Certain ones of these people visit his family every Friday and others visit proportionate to their deeds.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/196)"
        ],
        "index": 4668,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:86:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا مِنْ مُؤْمِنٍ وَ لَا كَافِرٍ إِلَّا وَ هُوَ يَأْتِي أَهْلَهُ عِنْدَ زَوَالِ الشَّمْسِ فَإِذَا رَأَى أَهْلَهُ يَعْمَلُونَ بِالصَّالِحَاتِ حَمِدَ اللَّهَ عَلَى ذَلِكَ وَ إِذَا رَأَى الْكَافِرُ أَهْلَهُ يَعْمَلُونَ بِالصَّالِحَاتِ كَانَتْ عَلَيْهِ حَسْرَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ali Bin Abu Hamza, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There is none from a Believer, nor an Infidel except that he comes over to his family at the (start of the) decline of the sun. So when he sees his family doing righteous deeds, he Praises Allah<sup>azwj</sup> upon that; and when the Infidel sees his family doing righteous deeds, there would be regret upon him’ (for his lost opportunity)."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Ali ibn abu Hamzah from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that every believing and unbeliever person visits his family everyday just after midday. If he finds his family performing good deeds, he praises and thanks Allah for this. When an unbeliever finds his family in good deeds, he laments and regrets (for his lost opportunities).” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/196)"
        ],
        "index": 4669,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:86:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي الْحَسَنِ الْأَوَّلِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الْمَيِّتِ يَزُورُ أَهْلَهُ قَالَ نَعَمْ فَقُلْتُ فِي كَمْ يَزُورُ قَالَ فِي الْجُمْعَةِ وَ فِي الشَّهْرِ وَ فِي السَّنَةِ عَلَى قَدْرِ مَنْزِلَتِهِ فَقُلْتُ فِي أَيِّ صُورَةٍ يَأْتِيهِمْ قَالَ فِي صُورَةِ طَائِرٍ لَطِيفٍ يَسْقُطُ عَلَى جُدُرِهِمْ وَ يُشْرِفُ عَلَيْهِمْ فَإِنْ رَآهُمْ بِخَيْرٍ فَرِحَ وَ إِنْ رَآهُمْ بِشَرٍّ وَ حَاجَةٍ حَزِنَ وَ اغْتَمَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ibn Mahboub, from Is’haq Bin Ammar, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup>, said, ‘I asked him<sup>asws</sup> about the deceased visiting his family. He<sup>asws</sup> said: ‘Yes’. So I said, ‘In how many visitations?’ He<sup>asws</sup> said: ‘(Once) during the Friday, and (once) during the month, and (once) during the year, in accordance with his status’. So I said, ‘In which image does he come over to them?’ He<sup>asws</sup> said: ‘In the image of a nice bird, falling upon their walls, and looking upon them. So if he sees them with goodness, he is happy; and if he sees them with evil and needy, he is with grief and gloom’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from ibn Mahbub from Ishaq ibn ‘Ammar who has said the following: “I (the narrator) asked abu al-Hassan al-Awwal, ‘Alayhi al-Salam, about a deceased person’s visiting his family. He replied, ‘Yes, (this is a fact).’ I then asked, ‘How often do such visits take place?’ He replied, ‘In a Friday (week), in a month and in a year, depending upon his status.’ I then asked, ‘In what form does he visit his family?’ He replied, ‘He visits them in the form of a fine bird. He drops on their walls and oversees them. If he finds them in good deeds, he becomes happy, and if he finds them in evil deeds or in need, he becomes depressed and sorrowful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/197)"
        ],
        "index": 4670,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:86:4",
        "text": [
          "عَنْهُ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ دُرُسْتَ الْوَاسِطِيِّ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ عَبْدِ الرَّحِيمِ الْقَصِيرِ قَالَ قُلْتُ لَهُ الْمُؤْمِنُ يَزُورُ أَهْلَهُ فَقَالَ نَعَمْ يَسْتَأْذِنُ رَبَّهُ فَيَأْذَنُ لَهُ فَيَبْعَثُ مَعَهُ مَلَكَيْنِ فَيَأْتِيهِمْ فِي بَعْضِ صُوَرِ الطَّيْرِ يَقَعُ فِي دَارِهِ يَنْظُرُ إِلَيْهِمْ وَ يَسْمَعُ كَلَامَهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ismail Bin Mihran, from Dorost Al Wasity, from Is’haq Bin Ammar, from Abdul Rahman who said, ",
            "‘I said to him<sup>asws</sup>, ‘The Believer visits his family?’ So he<sup>asws</sup> said: ‘Yes. He seeks Permission of his Lord<sup>azwj</sup>, so it is Permitted for him. So He<sup>azwj</sup> Sends two Angels along with him, and they come over to them in one of the images of the birds, falling upon his wall, looking at them, and hears their speech’."
          ],
          "en.sarwar": [
            "4. It is narrated from him (narrator of above Hadith) from Isma’il ibn Mehran from Durust ibn abu Mansur al-Wasitiy from Ishaq ibn ‘Ammar from ‘Abd al- Rahim al-Qasir who has said the following: “I asked the Imam, ‘Alayhi al-Salam, ‘Does a deceased believing person visit his family?’ He replied, ‘Yes, he asks his Lord for permission; then by His permission with two angels he comes to his family in the form of some kind of a bird. He turns arround his house and observes his family and hears whatever they say.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/197)"
        ],
        "index": 4671,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:86:5",
        "text": [
          "عَنْهُ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ قُلْتُ لِأَبِي الْحَسَنِ الْأَوَّلِ ( عليه السلام ) يَزُورُ الْمُؤْمِنُ أَهْلَهُ فَقَالَ نَعَمْ فَقُلْتُ فِي كَمْ قَالَ عَلَى قَدْرِ فَضَائِلِهِمْ مِنْهُمْ مَنْ يَزُورُ فِي كُلِّ يَوْمٍ وَ مِنْهُمْ مَنْ يَزُورُ فِي كُلِّ يَوْمَيْنِ وَ مِنْهُمْ مَنْ يَزُورُ فِي كُلِّ ثَلَاثَةِ أَيَّامٍ قَالَ ثُمَّ رَأَيْتُ فِي مَجْرَى كَلَامِهِ أَنَّهُ يَقُولُ أَدْنَاهُمْ مَنْزِلَةً يَزُورُ كُلَّ جُمْعَةٍ ",
          "قَالَ قُلْتُ فِي أَيِّ سَاعَةٍ قَالَ عِنْدَ زَوَالِ الشَّمْسِ وَ مِثْلِ ذَلِكَ قَالَ قُلْتُ فِي أَيِّ صُورَةٍ قَالَ فِي صُورَةِ الْعُصْفُورِ أَوْ أَصْغَرَ مِنْ ذَلِكَ فَيَبْعَثُ اللَّهُ تَعَالَى مَعَهُ مَلَكاً فَيُرِيهِ مَا يَسُرُّهُ وَ يَسْتُرُ عَنْهُ مَا يَكْرَهُ فَيَرَى مَا يَسُرُّهُ وَ يَرْجِعُ إِلَى قُرَّةِ عَيْنٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Muhammad Bin Sinan, from Is’haq Bin Ammar who said, ",
            "‘I said to Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup>, ‘Does the (deceased) Believer visit his family?’ So he<sup>asws</sup> said: ‘Yes’. So I said, ‘How often?’ He<sup>asws</sup> said: ‘Upon a measurement of their merits. From them is one who visits during every day, and from them is one who visits during every two days, and from them is one who visits during every three days’. He (the narrator) said, ‘Then I saw in the flow of his<sup>asws</sup> speech and he<sup>asws</sup> is saying: ‘The lowest of them (in status) visits every Friday’. ",
            "He (the narrator) said, ‘I said, ‘During which time?’ He<sup>asws</sup> said: ‘At the (start of the) decline of the sun, and the likes of that’. I said, ‘In which image?’ He<sup>asws</sup> said: ‘In the image of the sparrows, or smaller than that. So Allah<sup>azwj</sup> the High Sends two Angels with him, so they show him what delights him and veil from him what he dislikes. Thus, he sees what makes him joyful and returns with delighted eyes’."
          ],
          "en.sarwar": [
            "5. It is narrated from him (narrator of above Hadith) from Muhammad ibn Sinan from Ishaq ibn ‘Ammar who has said the following: “I asked abu al-Hassan al-Awwal, ‘Alayhi al-Salam, ‘Does a believing deceased person visit his family?’ He replied, ‘Yes, he does.’ I then asked, ‘How often does he visit them?’ He replied, ‘It depends upon their merits. Certain ones among them visit every day, others visit every other day, and still others among them visit after every three days.’ I then found in the course of his conversation indications that said, ‘The least among them in merits visit their family once every Friday.’ I then asked, ‘What time of the day do such visits take place?’ He replied, ‘It takes place very soon after midday or so.’ I then asked, ‘In what form does he come?’ He replied, ‘He comes in the form of a sparrow or smaller than a sparrow. Allah sends with him an angel who shows what he likes and hides from him what he dislikes. He then observes what makes him happy and returns very much delighted.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:3:86",
  "kind": "verse_list"
}