{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 87"
        },
        "path": "/books/al-kafi:3:3:87",
        "titles": {
          "ar": "باب أَنَّ الْمَيِّتَ يُمَثَّلُ لَهُ مَالُهُ وَ وَلَدُهُ وَ عَمَلُهُ قَبْلَ مَوْتِهِ",
          "en": "Chapter 87 – The deceased, a resemblance is made for him, of his wealth, and his children, and his deeds before his death"
        }
      }
    ],
    "index": 659,
    "local_index": 87,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 88"
        },
        "path": "/books/al-kafi:3:3:88",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الْمَسْأَلَةِ فِي</span> الْقَبْرِ وَ مَنْ يُسْأَلُ وَ مَنْ لَا يُسْأَلُ",
          "en": "Chapter 88 – The questioning in the grave, and the one who would be questioned and the one who would not be questioned"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 86"
        },
        "path": "/books/al-kafi:3:3:86",
        "titles": {
          "ar": "باب أَنَّ الْمَيِّتَ يَزُورُ أَهْلَهُ",
          "en": "Chapter 86 – The deceased visits his family"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:3:87",
    "titles": {
      "ar": "باب أَنَّ الْمَيِّتَ يُمَثَّلُ لَهُ مَالُهُ وَ وَلَدُهُ وَ عَمَلُهُ قَبْلَ مَوْتِهِ",
      "en": "Chapter 87 – The deceased, a resemblance is made for him, of his wealth, and his children, and his deeds before his death"
    },
    "verse_count": 4,
    "verse_start_index": 4671,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 4672,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/11",
              "text": "عَمْرِو بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/251",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2848",
              "text": "الْحَسَنُ بْنُ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2849",
              "text": "أَبِي جَمِيلَةَ مُفَضَّلِ بْنِ صَالِحٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/185",
              "text": "جَابِرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/441",
              "text": "عَبْدِ الْأَعْلَى"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/108",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/152",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/407",
              "text": "إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/441",
              "text": "عَبْدِ الْأَعْلَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2850",
              "text": "سُوَيْدِ بْنِ غَفَلَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ عُثْمَانَ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ وَ الْحَسَنُ بْنُ عَلِيٍّ جَمِيعاً عَنْ أَبِي جَمِيلَةَ مُفَضَّلِ بْنِ صَالِحٍ عَنْ جَابِرٍ عَنْ عَبْدِ الْأَعْلَى وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ الْأَعْلَى عَنْ سُوَيْدِ بْنِ غَفَلَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:87:1",
        "relations": {
          "Mentions": [
            "/books/quran:25:24",
            "/books/quran:56:94",
            "/books/quran:14:27",
            "/books/quran:56:93",
            "/books/quran:14:26",
            "/books/quran:25:26"
          ]
        },
        "text": [
          " قَالَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) إِنَّ ابْنَ آدَمَ إِذَا كَانَ فِي آخِرِ يَوْمٍ مِنْ أَيَّامِ الدُّنْيَا وَ أَوَّلِ يَوْمٍ مِنْ أَيَّامِ الْآخِرَةِ مُثِّلَ لَهُ مَالُهُ وَ وَلَدُهُ وَ عَمَلُهُ فَيَلْتَفِتُ إِلَى مَالِهِ فَيَقُولُ وَ اللَّهِ إِنِّي كُنْتُ عَلَيْكَ حَرِيصاً شَحِيحاً فَمَا لِي عِنْدَكَ فَيَقُولُ خُذْ مِنِّي كَفَنَكَ ",
          "قَالَ فَيَلْتَفِتُ إِلَى وَلَدِهِ فَيَقُولُ وَ اللَّهِ إِنِّي كُنْتُ لَكُمْ مُحِبّاً وَ إِنِّي كُنْتُ عَلَيْكُمْ مُحَامِياً فَمَا ذَا لِي عِنْدَكُمْ فَيَقُولُونَ نُؤَدِّيكَ إِلَى حُفْرَتِكَ نُوَارِيكَ فِيهَا",
          "قَالَ فَيَلْتَفِتُ إِلَى عَمَلِهِ فَيَقُولُ وَ اللَّهِ إِنِّي كُنْتُ فِيكَ لَزَاهِداً وَ إِنْ كُنْتَ عَلَيَّ لَثَقِيلًا فَمَا ذَا عِنْدَكَ فَيَقُولُ أَنَا قَرِينُكَ فِي قَبْرِكَ وَ يَوْمِ نَشْرِكَ حَتَّى أُعْرَضَ أَنَا وَ أَنْتَ عَلَى رَبِّكَ ",
          "قَالَ فَإِنْ كَانَ لِلَّهِ وَلِيّاً أَتَاهُ أَطْيَبُ النَّاسِ رِيحاً وَ أَحْسَنُهُمْ مَنْظَراً وَ أَحْسَنُهُمْ رِيَاشاً فَقَالَ أَبْشِرْ بِرَوْحٍ وَ رَيْحَانٍ وَ جَنَّةِ نَعِيمٍ وَ مَقْدَمُكَ خَيْرُ مَقْدَمٍ فَيَقُولُ لَهُ مَنْ أَنْتَ فَيَقُولُ أَنَا عَمَلُكَ الصَّالِحُ ارْتَحِلْ مِنَ الدُّنْيَا إِلَى الْجَنَّةِ ",
          "وَ إِنَّهُ لَيَعْرِفُ غَاسِلَهُ وَ يُنَاشِدُ حَامِلَهُ أَنْ يُعَجِّلَهُ فَإِذَا أُدْخِلَ قَبْرَهُ أَتَاهُ مَلَكَا الْقَبْرِ يَجُرَّانِ أَشْعَارَهُمَا وَ يَخُدَّانِ الْأَرْضَ بِأَقْدَامِهِمَا أَصْوَاتُهُمَا كَالرَّعْدِ الْقَاصِفِ وَ أَبْصَارُهُمَا كَالْبَرْقِ الْخَاطِفِ فَيَقُولَانِ لَهُ مَنْ رَبُّكَ وَ مَا دِينُكَ وَ مَنْ نَبِيُّكَ فَيَقُولُ اللَّهُ رَبِّي وَ دِينِيَ الْإِسْلَامُ وَ نَبِيِّي مُحَمَّدٌ ( صلى الله عليه وآله ) فَيَقُولَانِ لَهُ ثَبَّتَكَ اللَّهُ فِيمَا تُحِبُّ وَ تَرْضَى وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا بِالْقَوْلِ الثَّابِتِ فِي الْحَياةِ الدُّنْيا وَ فِي الْآخِرَةِ",
          "ثُمَّ يَفْسَحَانِ لَهُ فِي قَبْرِهِ مَدَّ بَصَرِهِ ثُمَّ يَفْتَحَانِ لَهُ بَاباً إِلَى الْجَنَّةِ ثُمَّ يَقُولَانِ لَهُ نَمْ قَرِيرَ الْعَيْنِ نَوْمَ الشَّابِّ النَّاعِمِ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ أَصْحابُ الْجَنَّةِ يَوْمَئِذٍ خَيْرٌ مُسْتَقَرًّا وَ أَحْسَنُ مَقِيلًا",
          "قَالَ وَ إِنْ كَانَ لِرَبِّهِ عَدُوّاً فَإِنَّهُ يَأْتِيهِ أَقْبَحُ مَنْ خَلَقَ اللَّهُ زِيّاً وَ رُؤْيَا وَ أَنْتَنُهُ رِيحاً فَيَقُولُ لَهُ أَبْشِرْ بِنُزُلٍ مِنْ حَمِيمٍ وَ تَصْلِيَةِ جَحِيمٍ وَ إِنَّهُ لَيَعْرِفُ غَاسِلَهُ وَ يُنَاشِدُ حَمَلَتَهُ أَنْ يَحْبِسُوهُ فَإِذَا أُدْخِلَ الْقَبْرَ أَتَاهُ مُمْتَحِنَا الْقَبْرِ فَأَلْقَيَا عَنْهُ أَكْفَانَهُ ثُمَّ يَقُولَانِ لَهُ مَنْ رَبُّكَ وَ مَا دِينُكَ وَ مَنْ نَبِيُّكَ فَيَقُولُ لَا أَدْرِي فَيَقُولَانِ لَا دَرَيْتَ وَ لَا هَدَيْتَ فَيَضْرِبَانِ يَافُوخَهُ بِمِرْزَبَةٍ مَعَهُمَا ضَرْبَةً مَا خَلَقَ اللَّهُ عَزَّ وَ جَلَّ مِنْ دَابَّةٍ إِلَّا وَ تَذْعَرُ لَهَا مَا خَلَا الثَّقَلَيْنِ",
          "ثُمَّ يَفْتَحَانِ لَهُ بَاباً إِلَى النَّارِ ثُمَّ يَقُولَانِ لَهُ نَمْ بِشَرِّ حَالٍ فِيهِ مِنَ الضَّيْقِ مِثْلُ مَا فِيهِ الْقَنَا مِنَ الزُّجِّ حَتَّى إِنَّ دِمَاغَهُ لَيَخْرُجُ مِنْ بَيْنِ ظُفُرِهِ وَ لَحْمِهِ وَ يُسَلِّطُ اللَّهُ عَلَيْهِ حَيَّاتِ الْأَرْضِ وَ عَقَارِبَهَا وَ هَوَامَّهَا فَتَنْهَشُهُ حَتَّى يَبْعَثَهُ اللَّهُ مِنْ قَبْرِهِ وَ إِنَّهُ لَيَتَمَنَّى قِيَامَ السَّاعَةِ فِيمَا هُوَ فِيهِ مِنَ الشَّرِّ",
          "وَ قَالَ جَابِرٌ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) قَالَ النَّبِيُّ ( صلى الله عليه وآله ) إِنِّي كُنْتُ أَنْظُرُ إِلَى الْإِبِلِ وَ الْغَنَمِ وَ أَنَا أَرْعَاهَا وَ لَيْسَ مِنْ نَبِيٍّ إِلَّا وَ قَدْ رَعَى الْغَنَمَ وَ كُنْتُ أَنْظُرُ إِلَيْهَا قَبْلَ النُّبُوَّةِ وَ هِيَ مُتَمَكِّنَةٌ فِي الْمَكِينَةِ مَا حَوْلَهَا شَيْ‏ءٌ يُهَيِّجُهَا حَتَّى تَذْعَرَ فَتَطِيرَ فَأَقُولُ مَا هَذَا وَ أَعْجَبُ حَتَّى حَدَّثَنِي جَبْرَئِيلُ ( عليه السلام ) أَنَّ الْكَافِرَ يُضْرَبُ ضَرْبَةً مَا خَلَقَ اللَّهُ شَيْئاً إِلَّا سَمِعَهَا وَ يَذْعَرُ لَهَا إِلَّا الثَّقَلَيْنِ فَقُلْتُ ذَلِكَ لِضَرْبَةِ الْكَافِرِ فَنَعُوذُ بِاللَّهِ مِنْ عَذَابِ الْقَبْرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Amro Bin Usman, and a number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, and Al Hassan Bin Ali, altogether from Abu Jameela Mufazzal Bin Salih, from Jabir, from Abdul A’ala and Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Ibrahim, from Abdul A’ala, from Suweyd Bin Ghafala who said, ",
            "‘Amir Al-Momineen<sup>asws</sup> said: ‘The son of Adam<sup>as</sup>, when he is in the last day from the days of the world, and the first day from the days of the Hereafter, a resemblance is made for him, of his wealth, and his children, and his deeds. So he turns towards his wealth, and he is saying, ‘By Allah<sup>azwj</sup>! I was greedy upon you, tight-fisted, so what is for me, with you?’ So it is saying, ‘Take your shroud from me’. ",
            "He<sup>asws</sup> said: ‘So he turns towards his children, and he is saying, ‘By Allah<sup>azwj</sup>! I was loving you, and I was a protector over you, so what is that which is for me, with you?’ So they are saying, ‘We shall accompany you to your pit and cast you in it’.",
            "He<sup>asws</sup> said: ‘So he is turning to his deeds, and he is saying, ‘I was abstaining from you and you were heavy upon me, so what is that (for me), with you?’ So these are saying, ‘We are your pair in your grave and on the Day you are Resurrected until us and you are presented to your Lord<sup>azwj</sup>’. ",
            "He<sup>asws</sup> said: ‘So if he was a friend of Allah<sup>azwj</sup>, there would come to him a person with the most aromatic of fragrances, and best of the looks, and best of the feathers (wings), so he says, ‘Receive glad tidings of the cool breezes and the aromas, and the Garden of Bliss, and your future is the best of the futures’. So he is saying to him, ‘Who are you?’ So he is saying, ‘I am your righteous deeds, having migrated from the world to the Paradise’.",
            "And he recognises the one who washes him, and calls upon his bearers to hasten him. So when he enters into his grave, two Angels of the grave comes over to him, their hair flowing and piercing the ground with their feet, their voices being like the echoing thunder, and their eyes being like the rapid lightning. So they are saying to him: ‘Who is your Lord<sup>azwj</sup>, and what is your Religion, and who is your Prophet<sup>as</sup>?’ So he is saying, ‘Allah<sup>azwj</sup> is my Lord<sup>azwj</sup>, and my Religion is Islam, and my Prophet<sup>saww</sup> is Muhammad<sup>saww</sup>’. So they are saying to him, ‘May Allah<sup>azwj</sup> Affirm your feet in what you love and are pleased with’, and these are the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:14#h27\">[14:27]</a> Allah Affirms those who believe with the firm Word in the life of the world and in the Hereafter</span>.",
            "Then they are expanding for him in his grave to the extent of his vision. Then they are opening for him a door to the Paradise, then they are saying to him: ‘Sleep with delighted eyes, the sleep of the sleeping youth, for Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:25#h24\">[25:24]</a> The dwellers of the Paradise shall on that day be in a goodly home and a better resting-place</span>.",
            "He<sup>asws</sup> said: ‘And if he was an enemy of his Lord<sup>azwj</sup>, so there would come to him the ugliest of the ones Created by Allah<sup>azwj</sup> in apparel and looks, and the most pungent of smells, and he would be saying to him: ‘Receive the news <span class=\"ibTxt\"><a href=\"/#/books/quran:56#h93\">[56:93]</a> He shall descend from the boiling water, <a href=\"/#/books/quran:56#h94\">[56:94]</a> And arrive in the Blazing Fire</span>. And he recognises the one who washes him, and calls out to his bearers that that should withhold him. So when he does enter into his grave, two examiners of the grave come over to him, so they remove his shroud from him, they are saying to him: ‘Who is your Lord<sup>azwj</sup>, and what is your Religion, and who is your Prophet<sup>saww</sup>’. So he is saying, ‘I do not know’. So they are saying: ‘You neither know nor did you have any guidance’. So they strike him on his forehead with a hammer with them with such a strike that there would not be a creature of Allah<sup>azwj</sup> Mighty and Majestic, from the animals, except that it would be frightened by it, except for the human beings and the Jinn.",
            "Then they are opening for him a door to the Fire (of Hell), then they are saying to him: ‘Sleep in an evil state wherein is the straitness like what is in the arrow stick into the arrow head’, until his brain would come out from between his nails and his flesh. And Allah<sup>azwj</sup> would Make the snakes of the earth, and its scorpions, and its vermins to overcome him. So they would be ravaging him until Allah<sup>azwj</sup> Resurrects him from his grave, and he would be longing from the establishment of the House, due to what he would be in, from the evil’. ",
            "And Jabir (the narrator) said, ‘Abu Ja’far<sup>asws</sup> said: ‘The Prophet<sup>saww</sup> said: ‘I<sup>saww</sup> used to look at the camels and the sheep and I<sup>saww</sup> was pasturing them - and there is none from a Prophet<sup>as</sup> except that he<sup>as</sup> had pastured the sheep – and I<sup>saww</sup> used to look at them before the Prophet-hood and they were calm in their enclosure, there not being anything around them, suddenly get irritated and panic, frightened. So I<sup>saww</sup> said: ‘What is this, and how strange it is? Until Jibraeel<sup>as</sup> narrated to me<sup>saww</sup> that the Infidel is struck with such a strike, there is no creature Created by Allah<sup>azwj</sup> except that it hears it and is frightened by it, except for the human beings and the Jinn’. So I<sup>saww</sup> said: ‘(If) that is due to one strike upon the Infidel, so we seek Refuge with Allah<sup>azwj</sup> from the Punishment of the grave’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ‘Amr ibn ‘Uthman and a number of our people, from Sahl ibn Ziyad from Ahmad ibn Muhammad ibn abu Nasr and al-Hassan ibn Ali all from abu Jamilah Mufaddal ibn Salih from Jabir from ‘Abd al-‘A’la’ and Ali ibn Ibrahim from Muhammad ibn ‘Isa from Yunus from Ibrahim from ‘Abd al-‘A’la’ from Suwayd ibn Ghafalah who has said the following: “Amir al-Mu’minin, ‘Alayhi al-Salam, has said, ‘When a child of Adam finds himself in the first day of his next life and the last day of his worldly life, his property, children and deeds are pictured before him. He then turns to his property and says, “By Allah, I was very greedy and stingy about you. In what ways can you help me?” It will say, “All you can do is to take your shroud from me.” He then turns to his children saying, “I loved you, protected you all the time. In what ways can you help me?” They will say, “We can take you to your grave and bury you therein.” He then turns to his deeds and asks, “By Allah, I had very little inclination to perform you and felt burdened because of you. In what ways can you help me now?” His deed will say, “I am your companion in your grave up to the day you will be resurrected, until we both will be brought before your Lord.’” The Imam then said, ‘If he is a friend of Allah, a person, the best of people with fragrance, the best in beauty, and in the best of dresses comes to him and says, “I have brought you the happiness and fragrance of paradise of blessings and you are most welcome.” He will then ask, “Who are you?” The person says, “I am your good deeds. You now move from the worldly life to paradise.” He knows those who wash his body for burial and begs those who carry his coffin to hurry up. When he is placed in his grave, two angels will come with their hairs dragging on the ground and tearing the earth with their feet, with thunderous sounds and their eyes like swift lightening. They will ask, “Who is your Lord? What is your religion and who is your prophet?” He will reply, “Allah is my Lord, Islam is my religion and Muhammad, O Allah grant compensation to Muhammad and his family worthy of their services to Your cause, is my prophet.” The two angels will then say, “May Allah keep you steadfast in what you love and are happy therewith.” This is a reference to the words of Allah, most Majestic, most Glorious, “Allah keeps the believers steadfast in the unchanging words, in this world and in the next life” <a href=\"/#/books/quran:14#h26\">[14:26]</a>. The two angels then open up his grave as far as his eyes can see, and a door to paradise and then say to him, “Rest delightfully like a blessed young person,” because Allah, the Most Majestic, the Most Glorious, has said, “People of paradise, on that day will have the best station and resting place” <a href=\"/#/books/quran:25#h26\">[25:26]</a>. The Imam then said, ‘If he is an enemy of his Lord, Allah’s ugliest creatures with the ugliest dress, appearance and smell will come to him and say, “Your place is boiling water and to suffer heat.” He knows people who wash his body for burial and begs those who carry his body to his grave to hold him back. When he is placed in his grave, the two examiners will come to him, remove his shroud away and ask him, “Who is your Lord? What is your religion and who is your prophet?” He will say, “I do not know.” They will say, “You did not know and you never had any guidance.” They will strike him at the front part of his head with a crashing hammer that they carry. The sound of this strike will frighten all creatures of Allah, the Most Majestic, the Most Glorious, except man and Jinn. They then open a door to hell for him and say to him, “Lie down here in worst condition, due to lack of space, as if squeezed like the iron spike into the tip of spears.” It will force his brain to squirt out of his toe and fingernails through the tissues of his flesh. Allah then gives his control to the snakes, scorpions and the creatures of earth that keep biting him until Allah will resurrect him from his grave. He will wish for the coming of the Day of Judgment because of suffering in his wicked condition.’” Jabir has said that abu Ja‘far has said that the Holy Prophet has said, ‘When watching the camels and sheep graze, before being commissioned as a prophet - there is no prophet who did not shepherd sheep - 1 could see them, while in safe and protected place and nothing around them, suddenly become excited and jump around frightened. I would say, “What is this strange phenomenon?” Once, Jibril (Gabriel) told me that when an unbeliever in his grave is struck on his head by the interrogating angels, all creatures of Allah, except man and Jinn, hear the sound of that (horrifying) strike and become frightened. I then said, “This is because of only one strike on the head of a disbeliever. I seek refuge with Allah against the (rest of the) torments in the grave.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/204)"
        ],
        "index": 4673,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1119",
              "text": "سَهْلُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/327",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/139",
              "text": "بَشِيرٍ الدَّهَّانِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/108",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/152",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/827",
              "text": "أَبِي جَمِيلَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/185",
              "text": "جَابِرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1633",
              "text": "جَابِرِ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "سَهْلُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ بَشِيرٍ الدَّهَّانِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ أَبِي جَمِيلَةَ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:87:2",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِذَا حُمِلَ عَدُوُّ اللَّهِ إِلَى قَبْرِهِ نَادَى حَمَلَتَهُ أَ لَا تَسْمَعُونَ يَا إِخْوَتَاهْ أَنِّي أَشْكُو إِلَيْكُمْ مَا وَقَعَ فِيهِ أَخُوكُمُ الشَّقِيُّ أَنَّ عَدُوَّ اللَّهِ خَدَعَنِي فَأَوْرَدَنِي ثُمَّ لَمْ يُصْدِرْنِي وَ أَقْسَمَ لِي أَنَّهُ نَاصِحٌ لِي فَغَشَّنِي",
          "وَ أَشْكُو إِلَيْكُمْ دُنْيَا غَرَّتْنِي حَتَّى إِذَا اطْمَأْنَنْتُ إِلَيْهَا صَرَعَتْنِي وَ أَشْكُو إِلَيْكُمْ أَخِلَّاءَ الْهَوَى مَنَّوْنِي ثُمَّ تَبَرَّءُوا مِنِّي وَ خَذَلُونِي وَ أَشْكُو إِلَيْكُمْ أَوْلَاداً حَمَيْتُ عَنْهُمْ وَ آثَرْتُهُمْ عَلَى نَفْسِي فَأَكَلُوا مَالِي وَ أَسْلَمُونِي وَ أَشْكُو إِلَيْكُمْ مَالًا مَنَعْتُ مِنْهُ حَقَّ اللَّهِ فَكَانَ وَبَالُهُ عَلَيَّ وَ كَانَ نَفْعُهُ لِغَيْرِي وَ أَشْكُو إِلَيْكُمْ دَاراً أَنْفَقْتُ عَلَيْهَا حَرِيبَتِي وَ صَارَ سَاكِنُهَا غَيْرِي",
          "وَ أَشْكُو إِلَيْكُمْ طُولَ الثَّوَاءِ فِي قَبْرِي يُنَادِي أَنَا بَيْتُ الدُّودِ أَنَا بَيْتُ الظُّلْمَةِ وَ الْوَحْشَةِ وَ الضَّيْقِ يَا إِخْوَتَاهْ فَاحْبِسُونِي مَا اسْتَطَعْتُمْ وَ احْذَرُوا مِثْلَ مَا لَقِيتُ فَإِنِّي قَدْ بُشِّرْتُ بِالنَّارِ وَ بِالذُّلِّ وَ الصَّغَارِ وَ غَضَبِ الْعَزِيزِ الْجَبَّارِ وَا حَسْرَتَاهْ عَلَى مَا فَرَّطْتُ فِي جَنْبِ اللَّهِ وَ يَا طُولَ عَوْلَتَاهْ فَمَا لِي مِنْ شَفِيعٍ يُطَاعُ وَ لَا صَدِيقٍ يَرْحَمُنِي فَلَوْ أَنَّ لِي كَرَّةً فَأَكُونَ مِنَ الْمُؤْمِنِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl Bin Ziyad, from Al Hassan Bin Ali, from Bashir Al Dahhan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, ",
            "and Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Abu Jameela, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, from Jabir Bin Abdullah who said, ‘Rasool-Allah<sup>saww</sup> said: ‘When an enemy of Allah<sup>azwj</sup> is carried to his grave, he calls out to his pallbearers, ‘Are you not hearing me, O my brethren? I am complaining to you what your wretched brother has fallen into. The enemy of Allah<sup>azwj</sup> deceived me, so he imprisoned me and did not release me, and swore to me that he is an advisor to me, and so he overwhelmed me.",
            "And I complain to you of the world which deceived me until when I was greedy to it, it knocked me down. And I complain to you of the selfish friends who gave me hope, then disavowed from me and abandoned me. And I complain to you of the children whom I protected and preferred them over myself, so they consumed my wealth, and betrayed me. And I complain to you of wealth which I prevented from it the Right of Allah<sup>azwj</sup>, so its (bad) consequences were upon me and its benefits were for others. And I complain to you of a house which I spent upon it my earnings and it became a dwelling for others. ",
            "And I complain to you of the prolonged boarding in my grave calling out to me: ‘I am a house of insects! I am a house of darkness, and the loneliness, and the straitness! O brothers! Withhold me whatever you are able to and be cautioned of the likes of what I face, for I have received news of the Fire, and the disgrace, and the belittling, and the Wrath of the Almighty, the Compeller. O my regret upon what I neglected regarding the Side of Allah<sup>azwj</sup> (Amir Al-Momineen<sup>asws</sup>)! And O prolonged wailing! So there is not for me a sympathetic intercessor to be merciful to me. So, if there was a possibility of return for me I would be from the Believers’."
          ],
          "en.sarwar": [
            "2. Sahl ibn Ziyad has narrated from al-Hassan ibn Ali from Bashir al-Dahhan from abu ‘Abd Allah, ‘Alayhi al-Salam, and Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa, from Yunus from abu Jamilah from Jabir, abu Ja’far from Jabir ibn ‘Abd Allah who has said the following: “The Messenger of Allah has said that when an enemy of Allah is taken to his grave, he keeps saying to those who carry his coffin, ‘Why do you not listen to me, O my brethren, I complain before you about what has happened to me, one of your wicked brethren. The enemy of Allah (Satan) deceived me. He placed me in trouble but did not help me to escape. He swore before me that he was my good advisor but betrayed me. I complain before you against the worldly attractions that made me a conceited person, so much so that I felt satisfied with them; they destroyed me. I complain before you against friends of worldly desires who promised me great favors, but then denounced and betrayed me. I complain before you against my children whom I protected and gave preference over my own self, who consumed my properties but abandoned me. I complain before you against the properties from which I did not pay Allah’s dues and the responsibility for which was left upon me, but its profits went to the others. I complain before you against the house on which I spent all of my earnings, but it became a dwelling of the others. I complain before you against my long stay in my grave from which I hear, “I am a dwelling full of worms, a dwelling which is very dark, frightening and very congested.” O brethren, hold me back as long as you can and avoid facing what I have faced. I have been given the news of my suffering, the heat of fire that burns me, the humiliation and lowliness, and the anger of the Most Majestic, the Almighty Lord. How great is the loss of being careless and unconcerned about Allah and His chosen people! How lengthy is the time of crying and moaning! I have no one whose intercession for me is accepted. I have no friend who may feel pity about me. I wish I had a chance to become one of the believing people.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/205)"
        ],
        "index": 4674,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/105",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/11",
              "text": "عَمْرِو بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/185",
              "text": "جَابِرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2837",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام ) مِثْلَهُ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2851",
              "text": "زَادَ فِيهِ فَمَا يَفْتُرُ يُنَادِي حَتَّى يُدْخَلَ قَبْرَهُ فَإِذَا دَخَلَ حُفْرَتَهُ رُدَّتِ الرُّوحُ فِي جَسَدِهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2852",
              "text": "جَاءَهُ مَلَكَا الْقَبْرِ فَامْتَحَنَاهُ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) مِثْلَهُ وَ زَادَ فِيهِ فَمَا يَفْتُرُ يُنَادِي حَتَّى يُدْخَلَ قَبْرَهُ فَإِذَا دَخَلَ حُفْرَتَهُ رُدَّتِ الرُّوحُ فِي جَسَدِهِ وَ جَاءَهُ مَلَكَا الْقَبْرِ فَامْتَحَنَاهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:87:3",
        "text": [
          " وَ كَانَ أَبُو جَعْفَرٍ ( عليه السلام ) يَبْكِي إِذَا ذَكَرَ هَذَا الْحَدِيثَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Amro Bin Usman, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, similar to it, and there is an increase in it: ‘So he does not stop calling out until he enters into his grave. So when he enters into his pit, the soul return to his body and the two Angels of the grave come over to him, so they test him’. He (the narrator) said, ‘And Abu Ja’far<sup>asws</sup> wept when he mentioned this Hadeeth’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from ‘Amr ibn ‘Uthman from Jabir from abu Ja‘far ‘Alayhi al- Salam, a similar Hadith with the following addition: “He continues pleading (and crying) until he is placed in his grave. When he is placed in his grave, his spirit is then returned to his body and the two angels come to his grave and examine him.” “The narrator has that abu Ja‘far, ‘Alayhi al-Salam, would weep whenever this Hadith was mentioned.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/205)"
        ],
        "index": 4675,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/108",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/152",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/210",
              "text": "عَمْرِو بْنِ شِمْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/185",
              "text": "جَابِرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:87:4",
        "text": [
          " قَالَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) مَا نَدْرِي كَيْفَ نَصْنَعُ بِالنَّاسِ إِنْ حَدَّثْنَاهُمْ بِمَا سَمِعْنَا مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ضَحِكُوا وَ إِنْ سَكَتْنَا لَمْ يَسَعْنَا",
          "قَالَ فَقَالَ ضَمْرَةُ بْنُ مَعْبَدٍ حَدِّثْنَا فَقَالَ هَلْ تَدْرُونَ مَا يَقُولُ عَدُوُّ اللَّهِ إِذَا حُمِلَ عَلَى سَرِيرِهِ قَالَ فَقُلْنَا لَا قَالَ فَإِنَّهُ يَقُولُ لِحَمَلَتِهِ أَ لَا تَسْمَعُونَ أَنِّي أَشْكُو إِلَيْكُمْ عَدُوَّ اللَّهِ خَدَعَنِي وَ أَوْرَدَنِي ثُمَّ لَمْ يُصْدِرْنِي وَ أَشْكُو إِلَيْكُمْ إِخْوَاناً وَاخَيْتُهُمْ فَخَذَلُونِي وَ أَشْكُو إِلَيْكُمْ أَوْلَاداً حَامَيْتُ عَنْهُمْ فَخَذَلُونِي وَ أَشْكُو إِلَيْكُمْ دَاراً أَنْفَقْتُ فِيهَا حَرِيبَتِي فَصَارَ سُكَّانُهَا غَيْرِي فَارْفُقُوا بِي وَ لَا تَسْتَعْجِلُوا",
          "قَالَ فَقَالَ ضَمْرَةُ يَا أَبَا الْحَسَنِ إِنْ كَانَ هَذَا يَتَكَلَّمُ بِهَذَا الْكَلَامِ يُوشِكُ أَنْ يَثِبَ عَلَى أَعْنَاقِ الَّذِينَ يَحْمِلُونَهُ قَالَ فَقَالَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) اللَّهُمَّ إِنْ كَانَ ضَمْرَةُ هَزِئَ مِنْ حَدِيثِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَخُذْهُ أَخْذَةَ أَسَفٍ",
          "قَالَ فَمَكَثَ أَرْبَعِينَ يَوْماً ثُمَّ مَاتَ فَحَضَرَهُ مَوْلًى لَهُ قَالَ فَلَمَّا دُفِنَ أَتَى عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) فَجَلَسَ إِلَيْهِ فَقَالَ لَهُ مِنْ أَيْنَ جِئْتَ يَا فُلَانُ قَالَ مِنْ جِنَازَةِ ضَمْرَةَ فَوَضَعْتُ وَجْهِي عَلَيْهِ حِينَ سُوِّيَ عَلَيْهِ فَسَمِعْتُ صَوْتَهُ وَ اللَّهِ أَعْرِفُهُ كَمَا كُنْتُ أَعْرِفُهُ وَ هُوَ حَيٌّ يَقُولُ وَيْلَكَ يَا ضَمْرَةَ بْنَ مَعْبَدٍ الْيَوْمَ خَذَلَكَ كُلُّ خَلِيلٍ وَ صَارَ مَصِيرُكَ إِلَى الْجَحِيمِ فِيهَا مَسْكَنُكَ وَ مَبِيتُكَ وَ الْمَقِيلُ ",
          "قَالَ فَقَالَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) أَسْأَلُ اللَّهَ الْعَافِيَةَ هَذَا جَزَاءُ مَنْ يَهْزَأُ مِنْ حَدِيثِ رَسُولِ اللَّهِ ( صلى الله عليه وآله) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Amro Bin Shimr, from Jabir who said, ",
            "‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said: ‘We<sup>asws</sup> do not know how to deal with the people. If we narrate to them with what we<sup>asws</sup> heard from Rasool-Allah<sup>saww</sup>, they are laughing (in jest), and if we<sup>asws</sup> observe silence, we<sup>asws</sup> have no leeway (for that). ",
            "He (the narrator) said, ‘So Zamrato Bin Ma’bad said, ‘Narrate to us’. So he<sup>asws</sup> said: ‘Do you know what the enemy of Allah<sup>azwj</sup> is saying when he is carried upon his coffin?’ So we said, ‘No’. He<sup>asws</sup> said: ‘So he is saying to his pallbearers, ‘Are you not hearing that I am complaining to you? The enemy of Allah<sup>azwj</sup> deceived me, and imprisoned me and did not release me. And I complain to you of brothers whom I established brotherhood with, so they abandoned me. I complain to you of children I protected, so they abandoned me. And I complain to you of a house which I spend upon my earning, so it became a dwelling for others. So, be kind to me and do not hasten.",
            "He (the narrator) said, ‘So Zamrat said, ‘O Abu Al-Hassan<sup>asws</sup>! If it was this speech he speaks with, (as if) he is about to pounce upon the necks of those that are carrying him’. So Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said: ‘O Allah<sup>azwj</sup>! If it was so that Zamrat has ridiculed a Hadeeth of Rasool-Allah<sup>saww</sup>, so Seize him with an unfortunate Seizing’. ",
            "He (the narrator) said, So he remained for forty days, then died, and a slave of his was present with him. So when he had been buried, he came over to Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, and (after) offering a seat to him, Imam<sup>asws</sup> asked him: ‘Where are you coming from, O so and so?’ He said, ‘From the funeral of Zamrat, and I placed my face upon him when they evened (the soil) upon him, and I heard his voice. By Allah<sup>azwj</sup>! I recognised it just as I had recognised it (beforehand) when he was alive. He was saying, ‘O woe be unto you, O Zamrat Bin Ma’bad! Today every friend has abandoned you, and your destination has become the Blazing Fire wherein is you dwelling, and your overnight stay, and the daytime stay’. ",
            "He (the narrator) said, ‘So Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said: ‘I<sup>asws</sup> ask Allah<sup>azwj</sup> for the well-being. This is a Recompense of the one who ridicules from the Ahadeeth of Rasool-Allah<sup>saww</sup>’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from ‘Amr ibn Shimr from Jabir who has said the following: “Ali ibn al-Husayn, ‘Alayhi al-Salam, has said, ‘We do not know how to deal with people. If we tell them that we have heard (such and such Hadith) from the Messenger of Allah, they laugh, and to remain silent (to neglect our mission) is not possible for us.’ The narrator has said that Damrah ibn Ma‘bad then said, ‘You then should narrate to us (of such) Ahadith.’ The Imam, ‘Alayhi al-Salam, then said, ‘Do you know what an enemy of Allah says when his body is placed on the stretcher?’ We replied, ’No, we do not know.’ The Imam then said, ’He says to those who carry his coffin, “Why is it that you do not listen to my complaints against Allah’s enemy who deceived me in taking me to wickedness and then did not help me to escape there-from? I complain before you against those with whom I established brotherly relations but they all betrayed me. I complain before you against the children whom I protected all the time but they also abandoned me. I complain before you against the house upon which I spent all my earnings but other people began to dwell therein. Please be kind and gentle to me and do not rush me up to my grave.’” Damrah then said, ’O abu al-Hassan, if this man can say such things, he then may almost stand up on the shoulders of those who carry him.’ The narrator has said that Ali ibn al-Husayn, ‘Alayhi al-Salam, then said, ‘O Allah, if Damrah has made fun of Hadith of the Messenger of Allah, then hold him like an angry person does.’ The narrator has said that after forty days he died. He had a servant who after his burial came to Ali ibn al-Husayn, ‘Alayhi al-Salam. He sat next to the Imam who asked, ‘Wherefrom are you coming O so and so?’ He replied, ’I have come from the burial of Damrah. I placed my face over him (his grave) when he was buried and I heard his voice which I recognized. It was just as I knew it was in his lifetime. I heard him saying, “Woe is upon you, O Damrah ibn Ma’bad. Today all friends have abandoned you and your destination has become hell, wherein is your dwelling, a place of rest at night and in the morning.” The narrator has said that Ali ibn al-Husayn, ‘Alayhi al-Salam, then said, ‘I plead before Allah for safety. Such is the recompense for those who make fun of the Ahadith of the Messenger of Allah.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:3:87",
  "kind": "verse_list"
}