{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:3:3", "titles": {"ar": "كِتَابُ الْجَنَائِزِ", "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "}}, {"indexed_titles": {"en": "Chapter 89"}, "path": "/books/al-kafi:3:3:89", "titles": {"ar": "باب مَا يَنْطِقُ بِهِ مَوْضِعُ الْقَبْرِ", "en": "Chapter 89 – What the place of the grave speaks with"}}], "index": 661, "local_index": 89, "part_type": "Chapter", "path": "/books/al-kafi:3:3:89", "titles": {"ar": "باب مَا يَنْطِقُ بِهِ مَوْضِعُ الْقَبْرِ", "en": "Chapter 89 – What the place of the grave speaks with"}, "verse_count": 3, "verse_start_index": 4693, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 4694, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:3:89:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي هَاشِمٍ عَنْ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا مِنْ مَوْضِعِ قَبْرٍ إِلَّا وَ هُوَ يَنْطِقُ كُلَّ يَوْمٍ ثَلَاثَ مَرَّاتٍ أَنَا بَيْتُ التُّرَابِ أَنَا بَيْتُ الْبَلَاءِ أَنَا بَيْتُ الدُّودِ قَالَ فَإِذَا دَخَلَهُ عَبْدٌ مُؤْمِنٌ قَالَ مَرْحَباً وَ أَهْلًا أَمَا وَ اللَّهِ لَقَدْ كُنْتُ أُحِبُّكَ وَ أَنْتَ تَمْشِي عَلَى ظَهْرِي فَكَيْفَ إِذَا دَخَلْتَ بَطْنِي فَسَتَرَى ذَلِكَ قَالَ فَيُفْسَحُ لَهُ مَدَّ الْبَصَرِ وَ يُفْتَحُ لَهُ بَابٌ يَرَى مَقْعَدَهُ مِنَ الْجَنَّةِ", "قَالَ وَ يَخْرُجُ مِنْ ذَلِكَ رَجُلٌ لَمْ تَرَ عَيْنَاهُ شَيْئاً قَطُّ أَحْسَنَ مِنْهُ فَيَقُولُ يَا عَبْدَ اللَّهِ مَا رَأَيْتُ شَيْئاً قَطُّ أَحْسَنَ مِنْكَ فَيَقُولُ أَنَا رَأْيُكَ الْحَسَنُ الَّذِي كُنْتَ عَلَيْهِ وَ عَمَلُكَ الصَّالِحُ الَّذِي كُنْتَ تَعْمَلُهُ قَالَ ثُمَّ تُؤْخَذُ رُوحُهُ فَتُوضَعُ فِي الْجَنَّةِ حَيْثُ رَأَى مَنْزِلَهُ ثُمَّ يُقَالُ لَهُ نَمْ قَرِيرَ الْعَيْنِ فَلَا يَزَالُ نَفْحَةٌ مِنَ الْجَنَّةِ تُصِيبُ جَسَدَهُ يَجِدُ لَذَّتَهَا وَ طِيبَهَا حَتَّى يُبْعَثَ ", "قَالَ وَ إِذَا دَخَلَ الْكَافِرُ قَالَ لَا مَرْحَباً بِكَ وَ لَا أَهْلًا أَمَا وَ اللَّهِ لَقَدْ كُنْتُ أُبْغِضُكَ وَ أَنْتَ تَمْشِي عَلَى ظَهْرِي فَكَيْفَ إِذَا دَخَلْتَ بَطْنِي سَتَرَى ذَلِكَ قَالَ فَتَضُمُّ عَلَيْهِ فَتَجْعَلُهُ رَمِيماً وَ يُعَادُ كَمَا كَانَ وَ يُفْتَحُ لَهُ بَابٌ إِلَى النَّارِ فَيَرَى مَقْعَدَهُ مِنَ النَّارِ", "ثُمَّ قَالَ ثُمَّ إِنَّهُ يَخْرُجُ مِنْهُ رَجُلٌ أَقْبَحُ مَنْ رَأَى قَطُّ قَالَ فَيَقُولُ يَا عَبْدَ اللَّهِ مَنْ أَنْتَ مَا رَأَيْتُ شَيْئاً أَقْبَحَ مِنْكَ قَالَ فَيَقُولُ أَنَا عَمَلُكَ السَّيِّئُ الَّذِي كُنْتَ تَعْمَلُهُ وَ رَأْيُكَ الْخَبِيثُ", "قَالَ ثُمَّ تُؤْخَذُ رُوحُهُ فَتُوضَعُ حَيْثُ رَأَى مَقْعَدَهُ مِنَ النَّارِ ثُمَّ لَمْ تَزَلْ نَفْخَةٌ مِنَ النَّارِ تُصِيبُ جَسَدَهُ فَيَجِدُ أَلَمَهَا وَ حَرَّهَا فِي جَسَدِهِ إِلَى يَوْمِ يُبْعَثُ وَ يُسَلِّطُ اللَّهُ عَلَى رُوحِهِ تِسْعَةً وَ تِسْعِينَ تِنِّيناً تَنْهَشُهُ لَيْسَ فِيهَا تِنِّينٌ يَنْفُخُ عَلَى ظَهْرِ الْأَرْضِ فَتُنْبِتَ شَيْئاً."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Abdul Rahman Bin Abu Hashim, from Salim, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There is none from a place of a grave except it speaks three times every day: ‘I am a house of the dust! I am a house of affliction! I am a house of the vermins!’ So when a believing servant enters (into it), it says: ‘You are most welcome! By Allah<sup>azwj</sup>! I used to love when you were walking upon my back, then why should I not love you when you are into my belly. So you shall soon see that’. So it expands for him to the extent of his vision, and there is opened for him a Door from which he can see his seat from the Paradise.", "He<sup>asws</sup> said: ‘And there comes out from that, a man such that his eyes had never seen before at all more handsome than him, so he is saying, ‘O servant of Allah<sup>azwj</sup>! I have not seen anyone more handsome than you, at all’. So he is saying, ‘I am your good opinion which you were upon, and your righteous deeds which you were doing’. Then he takes his soul and places it in the Paradise where he can see his house. Then he says to him, ‘Sleep with delighted eyes’. So the aroma from the Paradise does not cease to hit his body, renewing its pleasure and its fragrance until he is Resurrected’.", "He<sup>asws</sup> said: ‘And when the Infidel enters (the grave), it says: ‘You are not welcome at all!. But, by Allah<sup>azwj</sup>, I used to hate you walking upon my back, so it is more so when you enter into my belly? You shall soon see that (how much I hate you)’. So it squeezes upon him and makes him into decayed dust, and he returns to what he used to be, and there is opened for him a Door to the Fire, so he sees his seat from the Fire’.", "Then he<sup>asws</sup> said: ‘Then there comes out from it the ugliest man ever seen at all, so he is saying, ‘O servant of Allah<sup>azwj</sup>! Who are you? I have not seen anything more ugly than you’. So he is saying: ‘I am your evil deeds which you were performing and your bad opinion’. ", "He<sup>asws</sup> said: ‘Then he seizes his soul and places it where he can see his seat from the Fire. Then he does not cease to be hit by the blowings’ of the Fire hitting his body, and he finds its pain and its heat in his body until he is Resurrected, and makes his soul to be overcome by ninety-nine dragons ravaging him, there not being a dragon who would blow upon the surface of the earth, and anything would grow (after it)’."]}}, {"index": 4695, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:3:89:2", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ غَالِبِ بْنِ عُثْمَانَ عَنْ بَشِيرٍ الدَّهَّانِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ لِلْقَبْرِ كَلَاماً فِي كُلِّ يَوْمٍ يَقُولُ أَنَا بَيْتُ الْغُرْبَةِ أَنَا بَيْتُ الْوَحْشَةِ أَنَا بَيْتُ الدُّودِ أَنَا الْقَبْرُ أَنَا رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ أَوْ حُفْرَةٌ مِنْ حُفَرِ النَّارِ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Al Hassan Bin Ali, from Ghalib Bin usman, from Bashir Al Dahhan, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘For the grave there is speech during every day. It is saying: ‘I am a house of estrangement! I am a house of loneliness! I am a house of the vermin! I am the grave! I am a garden from the Gardens of the Paradise, or a pit from the pits of the Fire’."]}}, {"index": 4696, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:3:89:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَمَّادٍ عَنْ عَمْرِو بْنِ يَزِيدَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي سَمِعْتُكَ وَ أَنْتَ تَقُولُ كُلُّ شِيعَتِنَا فِي الْجَنَّةِ عَلَى مَا كَانَ فِيهِمْ قَالَ صَدَقْتُكَ كُلُّهُمْ وَ اللَّهِ فِي الْجَنَّةِ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ إِنَّ الذُّنُوبَ كَثِيرَةٌ كِبَارٌ فَقَالَ أَمَّا فِي الْقِيَامَةِ فَكُلُّكُمْ فِي الْجَنَّةِ بِشَفَاعَةِ النَّبِيِّ الْمُطَاعِ أَوْ وَصِيِّ النَّبِيِّ وَ لَكِنِّي وَ اللَّهِ أَتَخَوَّفُ عَلَيْكُمْ فِي الْبَرْزَخِ قُلْتُ وَ مَا الْبَرْزَخُ قَالَ الْقَبْرُ مُنْذُ حِينِ مَوْتِهِ إِلَى يَوْمِ الْقِيَامَةِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Isa, from Ahmad Bin Muhammad, from Abdul Rahman Bin Hammad, from Amro Bin Yazeed who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘I heard you<sup>asws</sup> and you<sup>asws</sup> were saying: ‘All of our<sup>asws</sup> Shias are in the Paradise upon what they used to be in’. He<sup>asws</sup> said: ‘You speak the truth. All of them, by Allah<sup>azwj</sup>, would be in the Paradise’. I said, ‘May I be sacrificed for you<sup>asws</sup>! If there are a lot of major sins?’ So he<sup>asws</sup> said: ‘But, during the Day of Judgement, so all of them would be in the Paradise by the intercession of the obeyed Prophet<sup>saww</sup> or a successor<sup>asws</sup> of the Prophet<sup>saww</sup>, but, by Allah<sup>azwj</sup>, I<sup>asws</sup> am afraid upon you during the purgatory’. I said, ‘And what is the purgatory?’ He<sup>asws</sup> said: ‘The (period of the) grave since his death, up to the Day of Judgement’."]}}]}, "index": "al-kafi:3:3:89", "kind": "verse_list"}