{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:3:3", "titles": {"ar": "كِتَابُ الْجَنَائِزِ", "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "}}, {"indexed_titles": {"en": "Chapter 9"}, "path": "/books/al-kafi:3:3:9", "titles": {"ar": "باب تَلْقِينِ الْمَيِّتِ", "en": "Chapter 9 – Indoctrination (Talqeen) of the deceased"}}], "index": 581, "local_index": 9, "part_type": "Chapter", "path": "/books/al-kafi:3:3:9", "titles": {"ar": "باب تَلْقِينِ الْمَيِّتِ", "en": "Chapter 9 – Indoctrination (Talqeen) of the deceased"}, "verse_count": 10, "verse_start_index": 4267, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 4268, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:3:9:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا حَضَرْتَ الْمَيِّتَ قَبْلَ أَنْ يَمُوتَ فَلَقِّنْهُ شَهَادَةَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When you attend to be with the deceased before he dies, so indoctrinate him with the testimony that there is no god except for Allah<sup>azwj</sup> Alone and there is no associate for Him<sup>azwj</sup>, and that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Rasool<sup>saww</sup>’."]}}, {"index": 4269, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:3:9:2", "text": ["عَنْهُ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي أَيُّوبَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) وَ حَفْصِ بْنِ الْبَخْتَرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّكُمْ تُلَقِّنُونَ مَوْتَاكُمْ عِنْدَ الْمَوْتِ لَا إِلَهَ إِلَّا اللَّهُ وَ نَحْنُ نُلَقِّنُ مَوْتَانَا مُحَمَّدٌ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) ."], "translations": {"en.hubeali": ["From him, from his father, from Ibn Abu Umeyr, from Abu Ayoub, from Muhammad Bin Muslim, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup>, and Hafs Bin Al-Bakhtary from Abu Abdullah<sup>asws</sup> having said: ‘You should be indoctrinating your dying ones during the death, ‘There is no god except for Allah<sup>azwj</sup>’, and we<sup>asws</sup> are indoctrinating our<sup>asws</sup> dying ones, ‘Muhammad<sup>saww</sup> is Rasool-Allah<sup>saww</sup>’’."]}}, {"index": 4270, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:3:9:3", "text": ["عَلِيٌّ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِذَا أَدْرَكْتَ الرَّجُلَ عِنْدَ النَّزْعِ فَلَقِّنْهُ كَلِمَاتِ الْفَرَجِ لَا إِلَهَ إِلَّا اللَّهُ الْحَلِيمُ الْكَرِيمُ لَا إِلَهَ إِلَّا اللَّهُ الْعَلِيُّ الْعَظِيمُ سُبْحَانَ اللَّهِ رَبِّ السَّمَاوَاتِ السَّبْعِ وَ رَبِّ الْأَرَضِينَ السَّبْعِ وَ مَا فِيهِنَّ وَ مَا بَيْنَهُنَّ وَ مَا تَحْتَهُنَّ وَ رَبِّ الْعَرْشِ الْعَظِيمِ وَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ", "قَالَ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) لَوْ أَدْرَكْتُ عِكْرِمَةَ عِنْدَ الْمَوْتِ لَنَفَعْتُهُ فَقِيلَ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) بِمَا ذَا كَانَ يَنْفَعُهُ قَالَ يُلَقِّنُهُ مَا أَنْتُمْ عَلَيْهِ ."], "translations": {"en.hubeali": ["Ali, from his father, from Hammad Bin Isa, from Hareyz, from Zurara, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When you see the man during the agony (of death), so indoctrinate him the words of relief, ‘There is no god except for Allah<sup>azwj</sup>, the Forbearing. There is no god except for Allah<sup>azwj</sup>, the Lofty, the Magnificent. Glorious is Allah<sup>azwj</sup> Lord<sup>azwj</sup> of the seven skies and Lord<sup>azwj</sup> of the seven firmaments, and whatever is within them and whatever is between them and whatever is beneath them; and Lord<sup>azwj</sup> of the Magnificent Throne, and the Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds’.", "He (the narrator) said, ‘So Abu Ja’far<sup>asws</sup> said: ‘Had you seen Ikrama during the death, you would have benefitted him’. It was said to Abu Abdullah<sup>asws</sup>, ‘With what would he have benefitted him?’ He<sup>asws</sup> said: ‘He could have been indoctrinated with what you are upon (Al-Wilayah)’."]}}, {"index": 4271, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:3:3:9:4", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ دَاوُدَ بْنِ سُلَيْمَانَ الْكُوفِيِّ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ قَالَ مَرِضَ رَجُلٌ مِنْ أَهْلِ بَيْتِي فَأَتَيْتُهُ عَائِداً فَقُلْتُ لَهُ يَا ابْنَ أَخِي إِنَّ لَكَ عِنْدِي نَصِيحَةً أَ تَقْبَلُهَا فَقَالَ نَعَمْ فَقُلْتُ قُلْ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ فَشَهِدَ بِذَلِكَ فَقُلْتُ إِنَّ هَذَا لَا تَنْتَفِعُ بِهِ إِلَّا أَنْ يَكُونَ مِنْكَ عَلَى يَقِينٍ فَذَكَرَ أَنَّهُ مِنْهُ عَلَى يَقِينٍ ", "فَقُلْتُ قُلْ أَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ فَشَهِدَ بِذَلِكَ فَقُلْتُ إِنَّ هَذَا لَا تَنْتَفِعُ بِهِ حَتَّى يَكُونَ مِنْكَ عَلَى يَقِينٍ فَذَكَرَ أَنَّهُ مِنْهُ عَلَى يَقِينٍ ", "فَقُلْتُ قُلْ أَشْهَدُ أَنَّ عَلِيّاً وَصِيُّهُ وَ هُوَ الْخَلِيفَةُ مِنْ بَعْدِهِ وَ الْإِمَامُ الْمُفْتَرَضُ الطَّاعَةِ مِنْ بَعْدِهِ فَشَهِدَ بِذَلِكَ فَقُلْتُ لَهُ إِنَّكَ لَنْ تَنْتَفِعَ بِذَلِكَ حَتَّى يَكُونَ مِنْكَ عَلَى يَقِينٍ فَذَكَرَ أَنَّهُ مِنْهُ عَلَى يَقِينٍ ثُمَّ سَمَّيْتُ الْأَئِمَّةَ رَجُلًا رَجُلًا فَأَقَرَّ بِذَلِكَ وَ ذَكَرَ أَنَّهُ عَلَى يَقِينٍ ", "فَلَمْ يَلْبَثِ الرَّجُلُ أَنْ تُوُفِّيَ فَجَزِعَ أَهْلُهُ عَلَيْهِ جَزَعاً شَدِيداً قَالَ فَغِبْتُ عَنْهُمْ ثُمَّ أَتَيْتُهُمْ بَعْدَ ذَلِكَ فَرَأَيْتُ عَرَاءً حَسَناً فَقُلْتُ كَيْفَ تَجِدُونَكُمْ كَيْفَ عَزَاؤُكِ أَيَّتُهَا الْمَرْأَةُ فَقَالَتْ وَ اللَّهِ لَقَدْ أُصِبْنَا بِمُصِيبَةٍ عَظِيمَةٍ بِوَفَاةِ فُلَانٍ رَحِمَهُ اللَّهُ وَ كَانَ مِمَّا سَخَا بِنَفْسِي لِرُؤْيَا رَأَيْتُهَا اللَّيْلَةَ فَقُلْتُ وَ مَا تِلْكَ الرُّؤْيَا قَالَتْ رَأَيْتُ فُلَاناً تَعْنِي الْمَيِّتَ حَيّاً سَلِيماً فَقُلْتُ فُلَانٌ قَالَ نَعَمْ فَقُلْتُ لَهُ أَ مَا كُنْتَ مِتَّ فَقَالَ بَلَى وَ لَكِنْ نَجَوْتُ بِكَلِمَاتٍ لَقَّنِّيهَا أَبُو بَكْرٍ وَ لَوْ لَا ذَلِكَ لَكِدْتُ أَهْلِكُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Dawood Bin Suleyman Al Kufy, from Abu Bakr Al Hazramy who said, ", "‘A man from my family became sick, so I went over to him as a visitor. I said to him, ‘O son of my brother! There is an advice with me for you, will you accept it?’. So he said, Yes’. So I said, ‘Say, ‘I testify that there is no god except for Allah<sup>azwj</sup> Alone, there being no associates for Him<sup>azwj</sup>’’. So he testified with that. I said, ‘This, you will not benefit by it unless it happens from you upon conviction’. So he mentioned that he was upon conviction of it.", "So I said, ‘Say, ‘I testify that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Rasool<sup>saww</sup>’. So he testified with that. So I said, ‘This, you will not benefit by it unless it happens from you upon conviction’. So he mentioned that he was upon conviction of it.", "So I said, ‘Say, ‘I testify that Ali<sup>asws</sup> is his<sup>saww</sup> successor and he<sup>asws</sup> is the Caliph from after him<sup>saww</sup>, and the Imam<sup>asws</sup> of Obligatory obedience from after him<sup>saww</sup>’. So he testified with that. So I said to him, ‘You will never benefit with that until it happens from you upon conviction’. So he mentioned that he was upon conviction of it. Then I named the Imams<sup>asws</sup>, man by man, and he acknowledged with that and mentioned that he was upon conviction.", "It was not long before the man died and his family panicked upon him with an intense panic. So I was absent from them, then went over to them after that, and saw them in good condition. So I said, ‘How come I am finding you all (like this). How was your grieving, O woman?’ So she said, ‘By Allah<sup>azwj</sup>! We have been hit by great difficulty by the death of so and so, may Allah<sup>azwj</sup> have Mercy on him, and he was generous with myself due to a dream I dreamt last night’. So I said, ‘And what is that dream?’ She said, ‘I saw so and so, meaning the deceased, as alive, safe. So I said, ‘(Are you) So and so?’ He said, ‘Yes’. So I said to him, ‘Had you not died?’ So he said, ‘Yes, but I was salvaged by the words which Abu Bak (the narrator) indoctrinated with, and had it not been for that, I was almost destroyed’."]}}, {"index": 4272, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:3:3:9:5", "text": ["عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كُنَّا عِنْدَهُ وَ عِنْدَهُ حُمْرَانُ إِذْ دَخَلَ عَلَيْهِ مَوْلًى لَهُ فَقَالَ جُعِلْتُ فِدَاكَ هَذَا عِكْرِمَةُ فِي الْمَوْتِ وَ كَانَ يَرَى رَأْيَ الْخَوَارِجِ وَ كَانَ مُنْقَطِعاً إِلَى أَبِي جَعْفَرٍ ( عليه السلام ) فَقَالَ لَنَا أَبُو جَعْفَرٍ ( عليه السلام ) أَنْظِرُونِي حَتَّى أَرْجِعَ إِلَيْكُمْ فَقُلْنَا نَعَمْ ", "فَمَا لَبِثَ أَنْ رَجَعَ فَقَالَ أَمَا إِنِّي لَوْ أَدْرَكْتُ عِكْرِمَةَ قَبْلَ أَنْ تَقَعَ النَّفْسُ مَوْقِعَهَا لَعَلَّمْتُهُ كَلِمَاتٍ يَنْتَفِعُ بِهَا وَ لَكِنِّي أَدْرَكْتُهُ وَ قَدْ وَقَعَتِ النَّفْسُ مَوْقِعَهَا قُلْتُ جُعِلْتُ فِدَاكَ وَ مَا ذَاكَ الْكَلَامُ قَالَ هُوَ وَ اللَّهِ مَا أَنْتُمْ عَلَيْهِ فَلَقِّنُوا مَوْتَاكُمْ عِنْدَ الْمَوْتِ شَهَادَةَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ الْوَلَايَةَ ."], "translations": {"en.hubeali": ["From him, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad, from Ali Bin Abu Hamza, from Abu Baseer, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘We were in his<sup>asws</sup> presence, and in his<sup>asws</sup> presence was Humran, when a slave of his<sup>asws</sup> came over, and he said, ‘May I be sacrificed for you<sup>asws</sup>! This Ikrama is in (pangs of) death, and he views with the views of the Kharijites, and he was (also) devoted to Abu Ja’far<sup>asws</sup>’. So Abu Ja’far<sup>asws</sup> said to us: ‘Wait for me<sup>asws</sup> until I<sup>asws</sup> return to you’. So we said, ‘Yes’. ", "So it was not long before he<sup>asws</sup> returned, and he<sup>asws</sup> said: ‘But, had I<sup>asws</sup> seen Ikrama before the soul had reached its place, I<sup>asws</sup> would have taught him ceratin words he would have benefitted by. But I<sup>asws</sup> saw him, and the soul had already reached its place’. I said, ‘And what is that speech?’ He<sup>asws</sup> said: ‘It is, by Allah<sup>azwj</sup>, what you all are upon, therefore indoctrinate your dying ones during the death, the testimony that there is no god except for Allah<sup>azwj</sup>, and the Wilayah’."]}}, {"index": 4273, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:3:3:9:6", "text": ["عَلِيُّ بْنُ مُحَمَّدِ بْنِ بُنْدَارَ عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي هَاشِمٍ عَنْ أَبِي خَدِيجَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا مِنْ أَحَدٍ يَحْضُرُهُ الْمَوْتُ إِلَّا وَكَّلَ بِهِ إِبْلِيسُ مِنْ شَيْطَانِهِ أَنْ يَأْمُرَهُ بِالْكُفْرِ وَ يُشَكِّكَهُ فِي دِينِهِ حَتَّى تَخْرُجَ نَفْسُهُ فَمَنْ كَانَ مُؤْمِناً لَمْ يَقْدِرْ عَلَيْهِ فَإِذَا حَضَرْتُمْ مَوْتَاكُمْ فَلَقِّنُوهُمْ شَهَادَةَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً رَسُولُهُ ( صلى الله عليه وآله ) حَتَّى يَمُوتَ ", "وَ فِي رِوَايَةٍ أُخْرَى قَالَ فَلَقِّنْهُ كَلِمَاتِ الْفَرَجِ وَ الشَّهَادَتَيْنِ وَ تُسَمِّي لَهُ الْإِقْرَارَ بِالْأَئِمَّةِ ( عليهم السلام ) وَاحِداً بَعْدَ وَاحِدٍ حَتَّى يَنْقَطِعَ عَنْهُ الْكَلَامُ ."], "translations": {"en.hubeali": ["Ali Bin Muhammad Bin Bundar, from Ahmad Bin Abu Abdullah, from Muhammad Bin Ali, from Abdul Rahman Bin Abu Hashim, from Abu Khadeeja, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said, ‘There is no one to whom death presents itself except that Iblees<sup>as</sup> allocates one of his<sup>la</sup> devils instructing him with the infidelity, and making him doubt in his Religion until his soul exits. So the one who was a Believer, he<sup>la</sup> would not be able over him. Thus, whenever death presents to your dying ones, indoctrinate them with the testimony, ‘There is no god except for Allah<sup>azwj</sup>, and that Muhammad<sup>saww</sup> is His<sup>azwj</sup> Rasool<sup>saww</sup>’, until he dies’.", "And in another report, ‘He<sup>asws</sup> said: ‘Indoctrinate him with the words of relief, and the two testimonies, and specify for him the acknowledgement in the Imams<sup>asws</sup>, one after one, until the speech is cut off from him’."]}}, {"index": 4274, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:3:3:9:7", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الْأَشْعَرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَيْمُونٍ الْقَدَّاحِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِذَا حَضَرَ أَحَداً مِنْ أَهْلِ بَيْتِهِ الْمَوْتُ قَالَ لَهُ قُلْ لَا إِلَهَ إِلَّا اللَّهُ الْعَلِيُّ الْعَظِيمُ سُبْحَانَ اللَّهِ رَبِّ السَّمَاوَاتِ السَّبْعِ وَ رَبِّ الْأَرَضِينَ السَّبْعِ وَ مَا بَيْنَهُمَا وَ رَبِّ الْعَرْشِ الْعَظِيمِ وَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ فَإِذَا قَالَهَا الْمَرِيضُ قَالَ اذْهَبْ فَلَيْسَ عَلَيْكَ بَأْسٌ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Ja’far Bin Muhammad Al Ashary, from Abdullah Bin Maymoun Al Qaddah, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘When the death presents itself for anyone from his family, so he should say to him, ‘Say, ‘There is no god except for Allah<sup>azwj</sup>, the Lofty, the Magnificent. Glorious is Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the seven skies and Lord<sup>azwj</sup> of the seven firmaments and whatever is between them, and Lord<sup>azwj</sup> of the Magnificent Throne; and the Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds’. So when the patient says it, he<sup>asws</sup> said: ‘So go, for there is no problem upon him’."]}}, {"index": 4275, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:3:3:9:8", "text": ["سَهْلُ بْنُ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ اللَّهِ لَوْ أَنَّ عَابِدَ وَثَنٍ وَصَفَ مَا تَصِفُونَ عِنْدَ خُرُوجِ نَفْسِهِ مَا طَعِمَتِ النَّارُ مِنْ جَسَدِهِ شَيْئاً أَبَداً ."], "translations": {"en.hubeali": ["Sohl Bin Ziyad, from Muhammad Bin Al Hassan Bin Shamoun, from Abdullah Bin Abdul Rahman, from Abdullah Bin Al Qasim, from Abu Bakr Al Hazramy who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! Even if an idol worshipper were to describe what you are describe during the exit of his soul, the Fire would not consume anything from his body, ever!’."]}}, {"index": 4276, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:3:3:9:9", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) دَخَلَ عَلَى رَجُلٍ مِنْ بَنِي هَاشِمٍ وَ هُوَ يَقْضِي فَقَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قُلْ لَا إِلَهَ إِلَّا اللَّهُ الْعَلِيُّ الْعَظِيمُ لَا إِلَهَ إِلَّا اللَّهُ الْحَلِيمُ الْكَرِيمُ سُبْحَانَ اللَّهِ رَبِّ السَّمَاوَاتِ السَّبْعِ وَ رَبِّ الْأَرَضِينَ السَّبْعِ وَ مَا بَيْنَهُنَّ وَ رَبِّ الْعَرْشِ الْعَظِيمِ وَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ فَقَالَهَا فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْحَمْدُ لِلَّهِ الَّذِي اسْتَنْقَذَهُ مِنَ النَّارِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> that Rasool-Allah<sup>saww</sup> went over to a man from the Clan of Hashim<sup>as</sup> and he was expiring. So Rasool-Allah<sup>saww</sup> said to him: ‘Say, ‘There is not god except for Allah<sup>azwj</sup>, the Lofty, the Magnificent. There is no god except for Allah<sup>azwj</sup>, the Forbearing, the Benevolent. Glory be to the Lord<sup>azwj</sup> of the seven skies and the seven firmaments, and whatever is between them, and Lord<sup>azwj</sup> of the Magnificent Throne. And the Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds’. So he said it, and Rasool-Allah<sup>saww</sup> said: ‘The Praise is for Allah<sup>azwj</sup> Who Rescued him from the Fire’’."]}}, {"index": 4277, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:3:3:9:10", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي هَاشِمٍ عَنْ سَالِمِ بْنِ أَبِي سَلَمَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ حَضَرَ رَجُلًا الْمَوْتُ فَقِيلَ يَا رَسُولَ اللَّهِ إِنَّ فُلَاناً قَدْ حَضَرَهُ الْمَوْتُ فَنَهَضَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ مَعَهُ أُنَاسٌ مِنْ أَصْحَابِهِ حَتَّى أَتَاهُ وَ هُوَ مُغْمًى عَلَيْهِ قَالَ فَقَالَ يَا مَلَكَ الْمَوْتِ كُفَّ عَنِ الرَّجُلِ حَتَّى أَسْأَلَهُ فَأَفَاقَ الرَّجُلُ ", "فَقَالَ النَّبِيُّ ( صلى الله عليه وآله ) مَا رَأَيْتَ قَالَ رَأَيْتُ بَيَاضاً كَثِيراً وَ سَوَاداً كَثِيراً قَالَ فَأَيُّهُمَا كَانَ أَقْرَبَ إِلَيْكَ فَقَالَ السَّوَادُ فَقَالَ النَّبِيُّ ( صلى الله عليه وآله ) قُلِ اللَّهُمَّ اغْفِرْ لِيَ الْكَثِيرَ مِنْ مَعَاصِيكَ وَ اقْبَلْ مِنِّي الْيَسِيرَ مِنْ طَاعَتِكَ فَقَالَهُ ", "ثُمَّ أُغْمِيَ عَلَيْهِ فَقَالَ يَا مَلَكَ الْمَوْتِ خَفِّفْ عَنْهُ حَتَّى أَسْأَلَهُ فَأَفَاقَ الرَّجُلُ فَقَالَ مَا رَأَيْتَ قَالَ رَأَيْتُ بَيَاضاً كَثِيراً وَ سَوَاداً كَثِيراً قَالَ فَأَيُّهُمَا كَانَ أَقْرَبَ إِلَيْكَ فَقَالَ الْبَيَاضُ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) غَفَرَ اللَّهُ لِصَاحِبِكُمْ ", "قَالَ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا حَضَرْتُمْ مَيِّتاً فَقُولُوا لَهُ هَذَا الْكَلَامَ لِيَقُولَهُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Abdul Rahman Bin Abu Hashim, from Salim Bin Abu Salama, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The death presented itself to a man, so it was said, ‘O Rasool-Allah<sup>saww</sup>! The death has presented itself to so and so’. So Rasool-Allah<sup>saww</sup> stood up, and with him<sup>saww</sup> were some people from his<sup>saww</sup> companions, and went until he<sup>saww</sup> came over to him, and there was unconsciousness upon him. So he<sup>saww</sup> said: ‘O Angel of death, restrain from the man until I<sup>saww</sup> question him’. So the man woke up. ", "So the Prophet<sup>saww</sup> said: ‘What did you see?’ He said, ‘I saw a lot of whiteness and a lot of darkness’. He<sup>saww</sup> said: ‘So which of the two was nearer to you?’ So he said, ‘The darkness’. So the Prophet<sup>saww</sup> said: ‘Say, ‘O Allah<sup>azwj</sup>! Forgive me the abudance of my disobedience to You<sup>azwj</sup>, and Accept from the little from my obedience to You<sup>azwj</sup>’. So he said it’. ", "Then unconsciousness came upon him, so he<sup>saww</sup> said: ‘O Angel of death! Lighten from him until I question him’. So the man awoke, and he<sup>saww</sup> said: ‘What did you see?’ I saw a lot of whiteness and a lot of darkness’. He<sup>saww</sup> said: ‘So which of the two was nearer to you?’ So he said, The whiteness’. So Rasool-Allah<sup>saww</sup> said: ‘Allah<sup>azwj</sup> has Forgiven your companion’. ", "He (the narrator) said, ‘So Abu Abdullah<sup>asws</sup> said: ‘Whenever you are present with a dying one, so you should be saying to him these words, for him to be saying it’."]}}]}, "index": "al-kafi:3:3:9", "kind": "verse_list"}