{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 90"
        },
        "path": "/books/al-kafi:3:3:90",
        "titles": {
          "ar": "باب فِي أَرْوَاحِ الْمُؤْمِنِينَ",
          "en": "Chapter 90 – Regarding the souls of the Believers"
        }
      }
    ],
    "index": 662,
    "local_index": 90,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 91"
        },
        "path": "/books/al-kafi:3:3:91",
        "titles": {
          "ar": "باب آخَرُ فِي أَرْوَاحِ الْمُؤْمِنِينَ",
          "en": "Chapter 91 – Another chapter regarding the souls of the Believers"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 89"
        },
        "path": "/books/al-kafi:3:3:89",
        "titles": {
          "ar": "باب مَا يَنْطِقُ بِهِ مَوْضِعُ الْقَبْرِ",
          "en": "Chapter 89 – What the place of the grave speaks with"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:3:3",
        "titles": {
          "ar": "كِتَابُ الْجَنَائِزِ",
          "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:3:90",
    "titles": {
      "ar": "باب فِي أَرْوَاحِ الْمُؤْمِنِينَ",
      "en": "Chapter 90 – Regarding the souls of the Believers"
    },
    "verse_count": 2,
    "verse_start_index": 4696,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/218)"
        ],
        "index": 4697,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/88",
              "text": "عَلِيِّ بْنِ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1484",
              "text": "الْحُسَيْنِ بْنِ رَاشِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2550",
              "text": "الْمُرْتَجِلِ بْنِ مَعْمَرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/744",
              "text": "ذَرِيحٍ الْمُحَارِبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2551",
              "text": "عُبَادَةَ الْأَسَدِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2552",
              "text": "حَبَّةَ الْعُرَنِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَسَنِ عَنِ الْحُسَيْنِ بْنِ رَاشِدٍ عَنِ الْمُرْتَجِلِ بْنِ مَعْمَرٍ عَنْ ذَرِيحٍ الْمُحَارِبِيِّ عَنْ عُبَادَةَ الْأَسَدِيِّ عَنْ حَبَّةَ الْعُرَنِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:90:1",
        "text": [
          " خَرَجْتُ مَعَ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) إِلَى الظَّهْرِ فَوَقَفَ بِوَادِي السَّلَامِ كَأَنَّهُ مُخَاطِبٌ لِأَقْوَامٍ فَقُمْتُ بِقِيَامِهِ حَتَّى أَعْيَيْتُ ثُمَّ جَلَسْتُ حَتَّى مَلِلْتُ ثُمَّ قُمْتُ حَتَّى نَالَنِي مِثْلُ مَا نَالَنِي أَوَّلًا ثُمَّ جَلَسْتُ حَتَّى مَلِلْتُ ",
          "ثُمَّ قُمْتُ وَ جَمَعْتُ رِدَائِي فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ إِنِّي قَدْ أَشْفَقْتُ عَلَيْكَ مِنْ طُولِ الْقِيَامِ فَرَاحَةَ سَاعَةٍ ثُمَّ طَرَحْتُ الرِّدَاءَ لِيَجْلِسَ عَلَيْهِ فَقَالَ لِي يَا حَبَّةُ إِنْ هُوَ إِلَّا مُحَادَثَةُ مُؤْمِنٍ أَوْ مُؤَانَسَتُهُ قَالَ قُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ وَ إِنَّهُمْ لَكَذَلِكَ قَالَ نَعَمْ وَ لَوْ كُشِفَ لَكَ لَرَأَيْتَهُمْ حَلَقاً حَلَقاً مُحْتَبِينَ يَتَحَادَثُونَ فَقُلْتُ أَجْسَامٌ أَمْ أَرْوَاحٌ فَقَالَ أَرْوَاحٌ وَ مَا مِنْ مُؤْمِنٍ يَمُوتُ فِي بُقْعَةٍ مِنْ بِقَاعِ الْأَرْضِ إِلَّا قِيلَ لِرُوحِهِ الْحَقِي بِوَادِي السَّلَامِ وَ إِنَّهَا لَبُقْعَةٌ مِنْ جَنَّةِ عَدْنٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Ali Bin Al Hassan, from Al Husayn Bin Rashid, from Al Murtahal Bin Ma’mar, from Zareeh Al Muharaby, from Ubadat Al Asady, from Habbat Al Urany who said, ",
            "‘I went out along with Amir Al-Momineen<sup>asws</sup> to the back (of Al-Kufa), so he<sup>asws</sup> paused at the valley of peace (a graveyard) as if addressing a group of people. So I stood due to his<sup>asws</sup> standing until I was exhausted. Then I sat until I was tired. Then I stood until there came to me the likes of what came to me the first time. Then I sat down until I was tired.",
            "Then I stood and gathered my robe and I said, ‘O Amir Al-Momineen<sup>asws</sup>! I sympathise with you<sup>asws</sup> from the long standing, so rest for a while’. Then I spread the robe in order for him<sup>asws</sup> to sit upon it. So he<sup>asws</sup> said to me: ‘O Habbat! It was only a discussion with a Believer, or comforting him’. I said, ‘O Amir Al-Momineen<sup>asws</sup>! And they are like that?’ He<sup>asws</sup> said: ‘Yes, and if the covering is uncovered for you, you would see them in groups and groups discussing’. So I said, ‘Bodily or in spirit form?’ So he<sup>asws</sup> said: ‘The souls. There is none from a Believer who dies in a spot from the spots of the earth, except that it is said to his soul: ‘Join at the valley of peace, and it is a spot from the Garden of Eden’."
          ],
          "en.sarwar": [
            "1. Ali ibn Muhammad has narrated from Ali ibn al-Hassan from al-Husayn ibn Rashid, from al-Murtajil ibn Mu’ammar from Dharih al- Muharibiy, from ‘Ubadah al-Asadiy from Habbah al-‘Uraniy who has said the following: “Once I went out along with ’Amir al-Mu’minin toward the backside of the city of Kufah. He stood on Wadiy al-Salam (valley of peace). He seemed like speaking to certain people. I stood as he was until I became tired. I then sat down until I became bored. I then stood up until I began to feel as it happened before. I then sat down until I became bored again. I then stood up and pulled my gown together and said, ‘O ’Amir al-Mu’minin, I have become concerned about your standing for so long. You should rest for a while.’ I then spread my gown so he could sit on it. He then said to me, ‘O Habbah, it was only a conversation with Mu’min (believer) or feeling comfortable with.’ I then asked, ‘Are they such, O ’Amir al-Mu’minin?’ He replied, ‘Yes, were it to be revealed to you, you could have seen them in groups and circles in Ihtiba’ position, speaking to each other.’ I then asked, ‘Are they in the form of spirits or do they have bodily shapes?’ He replied, ‘They are in the form of spirits. Whenever and wherever any believing person dies his spirit is told to leave for Wadi al-Salam. It is a piece of paradise of Eden.’” (Ihtiba’ is when one sits with his thighs against his belly and forms a ring with a piece of cloth for support around his trunk and knees or holds them against his belly with his hands). "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/220)"
        ],
        "index": 4698,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/310",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/664",
              "text": "أَحْمَدَ بْنِ عُمَرَ"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ أَحْمَدَ بْنِ عُمَرَ رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:3:90:2",
        "text": [
          " قُلْتُ لَهُ إِنَّ أَخِي بِبَغْدَادَ وَ أَخَافُ أَنْ يَمُوتَ بِهَا فَقَالَ مَا تُبَالِي حَيْثُمَا مَاتَ أَمَا إِنَّهُ لَا يَبْقَى مُؤْمِنٌ فِي شَرْقِ الْأَرْضِ وَ غَرْبِهَا إِلَّا حَشَرَ اللَّهُ رُوحَهُ إِلَى وَادِي السَّلَامِ قُلْتُ لَهُ وَ أَيْنَ وَادِي السَّلَامِ قَالَ ظَهْرُ الْكُوفَةِ أَمَا إِنِّي كَأَنِّي بِهِمْ حَلَقٌ حَلَقٌ قُعُودٌ يَتَحَدَّثُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Al Hassan Bin Ali, from Ahmad Bin Umar, raising it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘My brother is in Baghdad and I am afraid he would be dying in it’. So he<sup>asws</sup> said: ‘You should not care where so ever he dies, as there would not remain a single Believer in the east of the earth or the west of it, except that Allah<sup>azwj</sup> would Resurrect his soul to ‘وَادِي السَّلَامِ’ the valley of peace’. I said, ‘And where is the valley of peace?’ He<sup>asws</sup> said: ‘At the back of Al-Kufa. But it is as if I<sup>asws</sup> see them, in groups and groups, sitting, discussing’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Sahl ibn Ziyad from al-Hassan ibn Ali from Ahmad ibn ‘Umar in marfu‘ manner from abu ‘Abd Allah, the following: “I said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘My brother is in Baghdad and I am afraid that he may die there.’ He said, ‘Why should you worry about wherever he dies? Indeed, Allah sends to Wadi al- Salam the soul of every believing person who dies in the east or west of the earth.’ I then asked, ‘Where is Wadi al-Salam?’ ‘It is behind the city of Kufah,’ He (the Imam) replied. ‘It is as if I see them in circles and circles, sitting and talking to each other,’ the Imam explained.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:3:90",
  "kind": "verse_list"
}