{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:3:3", "titles": {"ar": "كِتَابُ الْجَنَائِزِ", "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "}}, {"indexed_titles": {"en": "Chapter 91"}, "path": "/books/al-kafi:3:3:91", "titles": {"ar": "باب آخَرُ فِي أَرْوَاحِ الْمُؤْمِنِينَ", "en": "Chapter 91 – Another chapter regarding the souls of the Believers"}}], "index": 663, "local_index": 91, "part_type": "Chapter", "path": "/books/al-kafi:3:3:91", "titles": {"ar": "باب آخَرُ فِي أَرْوَاحِ الْمُؤْمِنِينَ", "en": "Chapter 91 – Another chapter regarding the souls of the Believers"}, "verse_count": 7, "verse_start_index": 4698, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 4699, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:3:91:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ أَبِي وَلَّادٍ الْحَنَّاطِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ جُعِلْتُ فِدَاكَ يَرْوُونَ أَنَّ أَرْوَاحَ الْمُؤْمِنِينَ فِي حَوَاصِلِ طُيُورٍ خُضْرٍ حَوْلَ الْعَرْشِ فَقَالَ لَا الْمُؤْمِنُ أَكْرَمُ عَلَى اللَّهِ مِنْ أَنْ يَجْعَلَ رُوحَهُ فِي حَوْصَلَةِ طَيْرٍ وَ لَكِنْ فِي أَبْدَانٍ كَأَبْدَانِهِمْ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Al Hassan Bin Mahboub, from Abu Wallad Al Hannat, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! They (people) are reporting that the souls of the Believers are in the craw of green birds around the Throne’. So he<sup>asws</sup> said: ‘No. The Believers are more prestigious to Allah<sup>azwj</sup> than for Him<sup>azwj</sup> to Make his soul to be in craws of a bird, but they are in bodies like their own bodies’."]}}, {"index": 4700, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:3:91:2", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نَجْرَانَ عَنْ مُثَنًّى الْحَنَّاطِ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ أَرْوَاحَ الْمُؤْمِنِينَ لَفِي شَجَرَةٍ مِنَ الْجَنَّةِ يَأْكُلُونَ مِنْ طَعَامِهَا وَ يَشْرَبُونَ مِنْ شَرَابِهَا وَ يَقُولُونَ رَبَّنَا أَقِمِ السَّاعَةَ لَنَا وَ أَنْجِزْ لَنَا مَا وَعَدْتَنَا وَ أَلْحِقْ آخِرَنَا بِأَوَّلِنَا ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Abdul Rahman Bin Abu Najran, from Musanna Hannat, from Abu Baseer who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘The souls of the Believers are in a tree from the Paradise, eating from its food, and they are drinking from its drinks and they are saying, ‘Our Lord<sup>azwj</sup>! Establish the Hour for us and Accomplish for us what You<sup>azwj</sup> Promised us, and join our later ones with our former ones’."]}}, {"index": 4701, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:3:91:3", "text": ["سَهْلُ بْنُ زِيَادٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ دُرُسْتَ بْنِ أَبِي مَنْصُورٍ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْأَرْوَاحَ فِي صِفَةِ الْأَجْسَادِ فِي شَجَرَةٍ فِي الْجَنَّةِ تَعَارَفُ وَ تَسَاءَلُ فَإِذَا قَدِمَتِ الرُّوحُ عَلَى الْأَرْوَاحِ يَقُولُ دَعُوهَا فَإِنَّهَا قَدْ أَفْلَتَتْ مِنْ هَوْلٍ عَظِيمٍ ثُمَّ يَسْأَلُونَهَا مَا فَعَلَ فُلَانٌ وَ مَا فَعَلَ فُلَانٌ فَإِنْ قَالَتْ لَهُمْ تَرَكْتُهُ حَيّاً ارْتَجَوْهُ وَ إِنْ قَالَتْ لَهُمْ قَدْ هَلَكَ قَالُوا قَدْ هَوَى هَوَى ."], "translations": {"en.hubeali": ["Sahl Bin Ziyad, from Ismail Bin Mihran, from Dorost Bin Abu Mansour, from Ibn Muskan, from Abu Baseer, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The souls are in bodily representations in a tree in the Paradise, recognising (each other) and asking (about others). So when the soul proceeds upon the souls, they are saying, ‘Leave it alone, for it has just escaped from a great terror’. Then they are questioning it, ‘What happened to so and so?’ So if it says to them, ‘I left him alive’, they are hopeful for him, and if it says to them, ‘He died’, they say, ‘He has perished! Perished!’."]}}, {"index": 4702, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:3:3:91:4", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ عُثْمَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ أَرْوَاحِ الْمُؤْمِنِينَ فَقَالَ فِي حُجُرَاتٍ فِي الْجَنَّةِ يَأْكُلُونَ مِنْ طَعَامِهَا وَ يَشْرَبُونَ مِنْ شَرَابِهَا وَ يَقُولُونَ رَبَّنَا أَقِمِ السَّاعَةَ لَنَا وَ أَنْجِزْ لَنَا مَا وَعَدْتَنَا وَ أَلْحِقْ آخِرَنَا بِأَوَّلِنَا ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muhammad Bin Usman, from Abu Baseer, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked Abu Abdullah<sup>asws</sup> about the souls of the Believers, so he<sup>asws</sup> said: ‘(They are) in chambers in the Paradise, eating from its food and drinking from its drinks, and they are saying, ‘Our Lord<sup>azwj</sup>! Establish the Hour for us and Accomplish for us what You<sup>azwj</sup> Promised us, and Join our later ones with our former ones’."]}}, {"index": 4703, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:3:3:91:5", "text": ["عَلِيٌّ عَنْ أَبِيهِ عَنْ مُحَسِّنِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ حَمَّادٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا مَاتَ الْمَيِّتُ اجْتَمَعُوا عِنْدَهُ يَسْأَلُونَهُ عَمَّنْ مَضَى وَ عَمَّنْ بَقِيَ فَإِنْ كَانَ مَاتَ وَ لَمْ يَرِدْ عَلَيْهِمْ قَالُوا قَدْ هَوَى هَوَى وَ يَقُولُ بَعْضُهُمْ لِبَعْضٍ دَعُوهُ حَتَّى يَسْكُنَ مِمَّا مَرَّ عَلَيْهِ مِنَ الْمَوْتِ ."], "translations": {"en.hubeali": ["Ali, from his father, from Muhsin Bin Ahmad, from Muhammad Bin Hammad, from Yunush Bin Yaqoub, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the deceased dies, they (souls of the Believers) gather in his presence asking him about the ones who passed away and the ones who remain. So if one had died and did not come to them, they are saying, ‘Perished! Perished! And some of them are saying to the others, ‘Leave it until it settles from what has passed upon it, from the (experience of) death’."]}}, {"index": 4704, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:3:3:91:6", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ أَحْمَدَ عَنْ يُونُسَ بْنِ ظَبْيَانَ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ مَا يَقُولُ النَّاسُ فِي أَرْوَاحِ الْمُؤْمِنِينَ فَقُلْتُ يَقُولُونَ تَكُونُ فِي حَوَاصِلِ طُيُورٍ خُضْرٍ فِي قَنَادِيلَ تَحْتَ الْعَرْشِ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) سُبْحَانَ اللَّهِ الْمُؤْمِنُ أَكْرَمُ عَلَى اللَّهِ مِنْ أَنْ يَجْعَلَ رُوحَهُ فِي حَوْصَلَةِ طَيْرٍ ", "يَا يُونُسُ إِذَا كَانَ ذَلِكَ أَتَاهُ مُحَمَّدٌ ( صلى الله عليه وآله ) وَ عَلِيٌّ وَ فَاطِمَةُ وَ الْحَسَنُ وَ الْحُسَيْنُ ( عليهم السلام ) وَ الْمَلَائِكَةُ الْمُقَرَّبُونَ ( عليهم السلام ) فَإِذَا قَبَضَهُ اللَّهُ عَزَّ وَ جَلَّ صَيَّرَ تِلْكَ الرُّوحَ فِي قَالَبٍ كَقَالَبِهِ فِي الدُّنْيَا فَيَأْكُلُونَ وَ يَشْرَبُونَ فَإِذَا قَدِمَ عَلَيْهِمُ الْقَادِمُ عَرَفُوهُ بِتِلْكَ الصُّورَةِ الَّتِي كَانَتْ فِي الدُّنْيَا ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Khalid, from Al Qasim Bin Muhammad, from Al Husayn Bin Ahmad, from Yunus Bin Zabyan who said, ", "‘I was in the presence of Abu Abdullah<sup>asws</sup>, so he<sup>asws</sup> said: ‘What are the people saying regarding the souls of the Believers?’ So I said, ‘They are saying, ‘They happen to be in the craws of green birds in a lamp beneath the Throne’. So Abu Abdullah<sup>asws</sup> said: ‘Glory be to Allah<sup>azwj</sup>! The Believer is more prestigious to Allah<sup>azwj</sup> than for Him<sup>azwj</sup> to Make his soul to be in a craw of a bird.", "O Yunus! When it was that, there come to him Muhammad<sup>saww</sup>, and Ali<sup>asws</sup>, and Syeda Fatima<sup>asws</sup>, and Al-Hassan<sup>asws</sup>, and Al-Husayn<sup>asws</sup>, and the Angels of Proximity. So when Allah<sup>azwj</sup> Mighty and Majestic Captures him, that comes to be in a mould like his own mould used to be in the world. So they are eating and drinking, and when the comer comes over to them, they recognise him by that very image which he used to have in the world’."]}}, {"index": 4705, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:3:3:91:7", "text": ["مُحَمَّدٌ عَنْ أَحْمَدَ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ أَخِيهِ الْحَسَنِ عَنْ زُرْعَةَ عَنْ أَبِي بَصِيرٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّا نَتَحَدَّثُ عَنْ أَرْوَاحِ الْمُؤْمِنِينَ أَنَّهَا فِي حَوَاصِلِ طُيُورٍ خُضْرٍ تَرْعَى فِي الْجَنَّةِ وَ تَأْوِي إِلَى قَنَادِيلَ تَحْتَ الْعَرْشِ فَقَالَ لَا إِذاً مَا هِيَ فِي حَوَاصِلِ طَيْرٍ قُلْتُ فَأَيْنَ هِيَ قَالَ فِي رَوْضَةٍ كَهَيْئَةِ الْأَجْسَادِ فِي الْجَنَّةِ ."], "translations": {"en.hubeali": ["Muhammad, from Ahmad, from Al Husayn Bin Saeed, from his brother Al Hassan, from Zur’at, from Abu Baseer who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘We are narrating about the souls of the Believer that they are in the craws of green birds grazing in the Paradise, and sheltering to the lamps beneath the Throne’. So he<sup>asws</sup> said: ‘No. Then, what is in the craws of birds?’ I said, ‘So where are they?’ He<sup>asws</sup> said: ‘In a Garden like in the (shape of) bodies in the Paradise’."]}}]}, "index": "al-kafi:3:3:91", "kind": "verse_list"}