{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:3:3", "titles": {"ar": "كِتَابُ الْجَنَائِزِ", "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "}}, {"indexed_titles": {"en": "Chapter 93"}, "path": "/books/al-kafi:3:3:93", "titles": {"ar": "باب جَنَّةِ الدُّنْيَا", "en": "Chapter 93 – Garden of the world"}}], "index": 665, "local_index": 93, "part_type": "Chapter", "path": "/books/al-kafi:3:3:93", "titles": {"ar": "باب جَنَّةِ الدُّنْيَا", "en": "Chapter 93 – Garden of the world"}, "verse_count": 2, "verse_start_index": 4710, "verses": [{"index": 4711, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:3:93:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ ضُرَيْسٍ الْكُنَاسِيِّ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) أَنَّ النَّاسَ يَذْكُرُونَ أَنَّ فُرَاتَنَا يَخْرُجُ مِنَ الْجَنَّةِ فَكَيْفَ هُوَ وَ هُوَ يُقْبِلُ مِنَ الْمَغْرِبِ وَ تُصَبُّ فِيهِ الْعُيُونُ وَ الْأَوْدِيَةُ قَالَ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) وَ أَنَا أَسْمَعُ إِنَّ لِلَّهِ جَنَّةً خَلَقَهَا اللَّهُ فِي الْمَغْرِبِ وَ مَاءَ فُرَاتِكُمْ يَخْرُجُ مِنْهَا وَ إِلَيْهَا تَخْرُجُ أَرْوَاحُ الْمُؤْمِنِينَ مِنْ حُفَرِهِمْ عِنْدَ كُلِّ مَسَاءٍ\nفَتَسْقُطُ عَلَى ثِمَارِهَا وَ تَأْكُلُ مِنْهَا وَ تَتَنَعَّمُ فِيهَا وَ تَتَلَاقَى وَ تَتَعَارَفُ فَإِذَا طَلَعَ الْفَجْرُ هَاجَتْ مِنَ الْجَنَّةِ فَكَانَتْ فِي الْهَوَاءِ فِيمَا بَيْنَ السَّمَاءِ وَ الْأَرْضِ تَطِيرُ ذَاهِبَةً وَ جَائِيَةً وَ تَعْهَدُ حُفَرَهَا إِذَا طَلَعَتِ الشَّمْسُ وَ تَتَلَاقَى فِي الْهَوَاءِ وَ تَتَعَارَفُ\nقَالَ وَ إِنَّ لِلَّهِ نَاراً فِي الْمَشْرِقِ خَلَقَهَا لِيُسْكِنَهَا أَرْوَاحَ الْكُفَّارِ وَ يَأْكُلُونَ مِنْ زَقُّومِهَا وَ يَشْرَبُونَ مِنْ حَمِيمِهَا لَيْلَهُمْ فَإِذَا طَلَعَ الْفَجْرُ هَاجَتْ إِلَى وَادٍ بِالْيَمَنِ يُقَالُ لَهُ بَرَهُوتُ أَشَدُّ حَرّاً مِنْ نِيرَانِ الدُّنْيَا كَانُوا فِيهَا يَتَلَاقَوْنَ وَ يَتَعَارَفُونَ فَإِذَا كَانَ الْمَسَاءُ عَادُوا إِلَى النَّارِ فَهُمْ كَذَلِكَ إِلَى يَوْمِ الْقِيَامَةِ\nقَالَ قُلْتُ أَصْلَحَكَ اللَّهُ فَمَا حَالُ الْمُوَحِّدِينَ الْمُقِرِّينَ بِنُبُوَّةِ مُحَمَّدٍ ( صلى الله عليه وآله ) مِنَ الْمُسْلِمِينَ الْمُذْنِبِينَ الَّذِينَ يَمُوتُونَ وَ لَيْسَ لَهُمْ إِمَامٌ وَ لَا يَعْرِفُونَ وَلَايَتَكُمْ فَقَالَ أَمَّا هَؤُلَاءِ فَإِنَّهُمْ فِي حُفْرَتِهِمْ لَا يَخْرُجُونَ مِنْهَا فَمَنْ كَانَ مِنْهُمْ لَهُ عَمَلٌ صَالِحٌ وَ لَمْ يُظْهِرْ مِنْهُ عَدَاوَةً فَإِنَّهُ يُخَدُّ لَهُ خَدٌّ إِلَى الْجَنَّةِ الَّتِي خَلَقَهَا اللَّهُ فِي الْمَغْرِبِ فَيَدْخُلُ عَلَيْهِ مِنْهَا الرُّوحُ فِي حُفْرَتِهِ إِلَى يَوْمِ الْقِيَامَةِ فَيَلْقَى اللَّهَ فَيُحَاسِبُهُ بِحَسَنَاتِهِ وَ سَيِّئَاتِهِ\nفَإِمَّا إِلَى الْجَنَّةِ وَ إِمَّا إِلَى النَّارِ فَهَؤُلَاءِ مَوْقُوفُونَ لِأَمْرِ اللَّهِ قَالَ وَ كَذَلِكَ يَفْعَلُ اللَّهُ بِالْمُسْتَضْعَفِينَ وَ الْبُلْهِ وَ الْأَطْفَالِ وَ أَوْلَادِ الْمُسْلِمِينَ الَّذِينَ لَمْ يَبْلُغُوا الْحُلُمَ فَأَمَّا النُّصَّابُ مِنْ أَهْلِ الْقِبْلَةِ فَإِنَّهُمْ يُخَدُّ لَهُمْ خَدٌّ إِلَى النَّارِ الَّتِي خَلَقَهَا اللَّهُ فِي الْمَشْرِقِ فَيَدْخُلُ عَلَيْهِمْ مِنْهَا اللَّهَبُ وَ الشَّرَرُ وَ الدُّخَانُ وَ فَوْرَةُ الْحَمِيمِ إِلَى يَوْمِ الْقِيَامَةِ \nثُمَّ مَصِيرُهُمْ إِلَى الْحَمِيمِ ثُمَّ فِي النَّارِ يُسْجَرُونَ ثُمَّ قِيلَ لَهُمْ أَيْنَمَا كُنْتُمْ تَدْعُونَ مِنْ دُونِ اللَّهِ أَيْنَ إِمَامُكُمُ الَّذِي اتَّخَذْتُمُوهُ دُونَ الْإِمَامِ الَّذِي جَعَلَهُ اللَّهُ لِلنَّاسِ إِمَاماً .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad and Sahl Bin Ziyad, and Ali Bin Ibrahim, from his father, altogether from Ibn Mahboub, from Ali Bin Raib, from Zureys Al Kunasy who said, \n‘I asked Abu Ja’far<sup>asws</sup> that the people are mentioning that our (river) Euphrates comes out from the Paradise. So how can it be so and it is flowing from the west and there pour into it the springs and (it flows by) the valleys?’ So Abu Ja’far<sup>asws</sup> said, and I heard it, that: ‘For Allah<sup>azwj</sup> is a garden which Allah<sup>azwj</sup> Created in the west, and the water of your Euphrates comes out from it, and to it go (for outing) the souls of the Believers from their pits (graves) during each evening. \nSo they fall upon its fruits and eat from it, and they are in bliss therein, and they meet and recognise each other. So when the dawn emerges, they break out from the garden, so they are in the atmosphere in what is between the sky and the earth, flying around, going and coming, and return to their graves when the sun emerges, meeting each other in the atmosphere and introducing each other’. \nHe<sup>asws</sup> said: ‘And for Allah<sup>azwj</sup> there is a fire in the east which He<sup>azwj</sup> Created to Settle therein the souls of the Infidels, and they are eating from its bitter fruits and are drinking from its boiling water during their night. So when the dawn emerges, they break out to the valley in Al-Yemen called Barhout, which is more intense in heat than the fires of the world. Therein they are meeting and recognising each other. So when it is the evening, they are returning to the fire. Thus, they would be like that up to the Day of Judgement’. \nHe (the narrator) said, I said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! So what is the state of the Monotheist, the acknowledger with the Prophet-hood of Muhammad<sup>saww</sup>, from the (general) Muslims, the sinners, who are dying and there is no Imam<sup>asws</sup> for them, nor are they recognising your<sup>asws</sup> Wilayah?’ So he<sup>asws</sup> said: ‘As for them, so they would be in their graves, not coming out from these. So the one from them who had righteous deeds for him, and there does not appear from him enmity (towards us<sup>asws</sup>), so a furrow would be grooved out for them to the garden which Allah<sup>azwj</sup> has Created in the west. So there would come over to them the breeze from it into his grave up to the Day of Judgement, and he would meet Allah<sup>azwj</sup>, and He<sup>azwj</sup> would Reckon him by his good deeds and his evil deeds.\nSo either they would go to the Paradise or they would go to the Fire, as they would be pausing for the Command of Allah<sup>azwj</sup>. And similar to that will Allah<sup>azwj</sup> Deal with the weak ones (of understanding), and the foolish, and the children, and the children of the Muslims who did not reach the puberty. So as for the Hostile ones (<span class=\"iTxt\">Nasibis</span>) from the people of the Qiblah (general Muslims), so a furrow would be grooved for them to the fire which Allah<sup>azwj</sup> has Created in the east. So there would come over to them, from it, the flames, and the sparks, and the smoke, and bursts of boiling water, up to the Day of Judgement.\nThen their destination would be to the boiling water, then into the Fire to be heated up. Then it would be said to them: ‘Wherever you were you were calling from besides Allah<sup>azwj</sup>. Where is your imam whom you were taking to besides the Imam<sup>asws</sup> whom Allah<sup>azwj</sup> Made to be for the people as an Imam<sup>asws</sup>?’."}]}, {"index": 4712, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:3:93:2", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنِ الْحُسَيْنِ بْنِ مُيَسِّرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ جَنَّةِ آدَمَ ( عليه السلام ) فَقَالَ جَنَّةٌ مِنْ جِنَانِ الدُّنْيَا تَطْلُعُ فِيهَا الشَّمْسُ وَ الْقَمَرُ وَ لَوْ كَانَتْ مِنْ جِنَانِ الْآخِرَةِ مَا خَرَجَ مِنْهَا أَبَداً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Al Husayn Bin Maysay who said, \n‘I asked Abu Abdullah<sup>asws</sup> about the Garden of Adam<sup>as</sup>. So he<sup>asws</sup> said: ‘It was a garden from the gardens of the world, wherein the sun emerged, and the moon, and had it been from the Gardens of the Paradise, he<sup>as</sup> would not have come out from it, ever!’."}]}]}, "index": "al-kafi:3:3:93", "kind": "verse_list"}