{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:3:3", "titles": {"ar": "كِتَابُ الْجَنَائِزِ", "en": "<a id=\"_Toc452651144\"></a>THE BOOK OF FUNERALS "}}, {"indexed_titles": {"en": "Chapter 95"}, "path": "/books/al-kafi:3:3:95", "titles": {"ar": "باب النَّوَادِرِ", "en": "Chapter 95 – The Miscellaneous"}}], "index": 667, "local_index": 95, "part_type": "Chapter", "path": "/books/al-kafi:3:3:95", "titles": {"ar": "باب النَّوَادِرِ", "en": "Chapter 95 – The Miscellaneous"}, "verse_count": 46, "verse_start_index": 4720, "verses": [{"index": 4721, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ نُوحِ بْنِ شُعَيْبٍ عَنْ شِهَابِ بْنِ عَبْدِ رَبِّهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الْجُنُبِ يُغَسِّلُ الْمَيِّتَ أَوْ مَنْ غَسَّلَ مَيِّتاً لَهُ أَنْ يَأْتِيَ أَهْلَهُ ثُمَّ يَغْتَسِلَ فَقَالَ سَوَاءٌ لَا بَأْسَ بِذَلِكَ إِذَا كَانَ جُنُباً غَسَلَ يَدَهُ وَ تَوَضَّأَ وَ غَسَّلَ الْمَيِّتَ فَإِنْ غَسَّلَ مَيِّتاً ثُمَّ تَوَضَّأَ ثُمَّ أَتَى أَهْلَهُ يُجْزِئُهُ غُسْلٌ وَاحِدٌ لَهُمَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Nuh Bin Shuayb, from Shihab Bin Abd Rabbih, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the one with sexual impurity washing the deceased, or the one who does wash a deceased, is it for him that he goes to his wife, then washes?’ So he<sup>asws</sup> said: ‘It is the same. There is no problem with that. When he is with sexual impurity, he would wash his hands, and perform ablution and wash the deceased. So if he has washed the deceased, then performs ablution, then goes to his wife, one washing would suffice for him for the two’."}]}, {"index": 4722, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:2", "text": "عَلِيٌّ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْمَيِّتَ إِذَا حَضَرَهُ الْمَوْتُ أَوْثَقَهُ مَلَكُ الْمَوْتِ وَ لَوْ لَا ذَلِكَ مَا اسْتَقَرَّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali, from his father, from Abdullah Bin Al Mugheira, from Al Sakuny, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The dying one, when death presents itself to him, the Angel of death ties him down, and had it not been for that, he would not be calm’."}]}, {"index": 4723, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:3", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ أَبِي مُحَمَّدٍ الْهُذَلِيِّ عَنْ إِبْرَاهِيمَ بْنِ خَالِدٍ الْقَطَّانِ عَنْ مُحَمَّدِ بْنِ مَنْصُورٍ الصَّيْقَلِ عَنْ أَبِيهِ قَالَ شَكَوْتُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَجْداً وَجَدْتُهُ عَلَى ابْنٍ لِي هَلَكَ حَتَّى خِفْتُ عَلَى عَقْلِي فَقَالَ إِذَا أَصَابَكَ مِنْ هَذَا شَيْ‏ءٌ فَأَفِضْ مِنْ دُمُوعِكَ فَإِنَّهُ يَسْكُنُ عَنْكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Abu Muhammad Al Huzaly, from Ibrahim Bin Khalid Al Qattan, from Muhammad Bin Mansour Al Sayqal, from his father who said, \n‘I complained to Abu Abdullah<sup>asws</sup> of grief which I found to be in upon the death of a son of mine, to the extent that I feared upon my mind. So he<sup>asws</sup> said: ‘If something from this hits you, allow your tears to flow for it would you give you relief’."}]}, {"index": 4724, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:4", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ رَفَعَهُ قَالَ لَمَّا مَاتَ ذَرُّ بْنُ أَبِي ذَرٍّ مَسَحَ أَبُو ذَرٍّ الْقَبْرَ بِيَدِهِ ثُمَّ قَالَ رَحِمَكَ اللَّهُ يَا ذَرُّ وَ اللَّهِ إِنْ كُنْتَ بِي بَارّاً وَ لَقَدْ قُبِضْتَ وَ إِنِّي عَنْكَ لَرَاضٍ أَمَا وَ اللَّهِ مَا بِي فَقْدُكَ وَ مَا عَلَيَّ مِنْ غَضَاضَةٍ وَ مَا لِي إِلَى أَحَدٍ سِوَى اللَّهِ مِنْ حَاجَةٍ وَ لَوْ لَا هَوْلُ الْمُطَّلَعِ لَسَرَّنِي أَنْ أَكُونَ مَكَانَكَ وَ لَقَدْ شَغَلَنِي الْحُزْنُ لَكَ عَنِ الْحُزْنِ عَلَيْكَ وَ اللَّهِ مَا بَكَيْتُ لَكَ وَ لَكِنْ بَكَيْتُ عَلَيْكَ فَلَيْتَ شِعْرِي مَا ذَا قُلْتَ وَ مَا ذَا قِيلَ لَكَ \nثُمَّ قَالَ اللَّهُمَّ إِنِّي قَدْ وَهَبْتُ لَهُ مَا افْتَرَضْتَ عَلَيْهِ مِنْ حَقِّي فَهَبْ لَهُ مَا افْتَرَضْتَ عَلَيْهِ مِنْ حَقِّكَ فَأَنْتَ أَحَقُّ بِالْجُودِ مِنِّي .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, raising it, said, \n‘When Zharr son of Abu Zarr<sup>as</sup> died, Abu Zarr<sup>as</sup> wiped the grave with his<sup>as</sup> hand, then said: ‘May Allah<sup>azwj</sup> have Mercy on you, O Zharr! By Allah<sup>azwj</sup>! You were righteous with me<sup>as</sup>, and you have died and I<sup>as</sup> am pleased with you.  However, by Allah<sup>azwj</sup>, I am not disappointed due to your death and I do not need anyone beside Allah<sup>azwj</sup>.  Had it not been for fear from the next life I would have been happy to be in your place.  My sadness for you (my concern for you in the next life) has kept me from sadness due to your death.  By Allah<sup>azwj</sup>, I do not weep because of your death but I weep for you because of what you may face in the next life.  I do not know what I have said about you and what is said about you. \nThen he<sup>ra</sup> said: ‘O Allah<sup>azwj</sup>! I<sup>ra</sup> have gifted to him whatever was necessitated upon him from my rights, therefore Gift to him whatever was necessitated upon him from Your<sup>azwj</sup> Rights, for You<sup>azwj</sup> are more rightful with the Benevolence than I<sup>as</sup> am’."}]}, {"index": 4725, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:5", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ عِدَّةٍ مِنْ أَصْحَابِنَا قَالَ لَمَّا قُبِضَ أَبُو جَعْفَرٍ ( عليه السلام ) أَمَرَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) بِالسِّرَاجِ فِي الْبَيْتِ الَّذِي كَانَ يَسْكُنُهُ حَتَّى قُبِضَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) ثُمَّ أَمَرَ أَبُو الْحَسَنِ ( عليه السلام ) بِمِثْلِ ذَلِكَ فِي بَيْتِ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) حَتَّى خَرَجَ بِهِ إِلَى الْعِرَاقِ ثُمَّ لَا أَدْرِي مَا كَانَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Usman Bin Isa, from a number of our companions who said, \n‘When Abu Ja’far<sup>asws</sup> passed away, Abu Abdullah<sup>asws</sup> ordered (his<sup>asws</sup> people) with the lantern in the house where he<sup>asws</sup> had dwelled in until Abu Abdullah<sup>asws</sup> passed away. Then Abu Al-Hassan<sup>asws</sup> ordered with similar to that in the house of Abu Abdullah<sup>asws</sup>, until he<sup>asws</sup> went out with it to Al-Iraq. Then I do not know what happened’."}]}, {"index": 4726, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:6", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ أَوَّلِ مَنْ جُعِلَ لَهُ النَّعْشُ فَقَالَ فَاطِمَةُ ( عليها السلام ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the first one for whom the casket (coffin) was made to be. So he<sup>asws</sup> said: ‘ Syeda Fatima<sup>asws</sup>’."}]}, {"index": 4727, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:7", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ أَحْمَدَ بْنِ الْحَسَنِ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ مُصَدِّقِ بْنِ صَدَقَةَ عَنْ عَمَّارِ بْنِ مُوسَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سُئِلَ عَنِ الْمَيِّتِ يَبْلَى جَسَدُهُ قَالَ نَعَمْ حَتَّى لَا يَبْقَى لَهُ لَحْمٌ وَ لَا عَظْمٌ إِلَّا طِينَتُهُ الَّتِي خُلِقَ مِنْهَا فَإِنَّهَا لَا تُبْلَى تَبْقَى فِي الْقَبْرِ مُسْتَدِيرَةً حَتَّى يُخْلَقَ مِنْهَا كَمَا خُلِقَ أَوَّلَ مَرَّةٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Ahmad Bin Al Hassan, from Amro Bin Saeed, from Musaddiq Bin Sadaqa, from Ammar Bin Musa, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘He<sup>asws</sup> was asked about the deceased, whether his body would decay. He<sup>asws</sup> said: ‘To the extent that there would neither remain any flesh for him nor any bones, except for his essence which he was Created from, for it would not decay. It would remain in the grave circulating, until he is Created from it just as he had been Created the first time’."}]}, {"index": 4728, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:8", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ أَحْمَدُ بْنُ مُحَمَّدٍ الْكُوفِيُّ عَنْ بَعْضِ أَصْحَابِهِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ يَزِيدَ بْنِ خَلِيفَةَ الْخَوْلَانِيِّ وَ هُوَ يَزِيدُ بْنُ خَلِيفَةَ الْحَارِثِيُّ قَالَ سَأَلَ عِيسَى بْنُ عَبْدِ اللَّهِ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا حَاضِرٌ فَقَالَ تَخْرُجُ النِّسَاءُ إِلَى الْجَنَازَةِ وَ كَانَ ( عليه السلام ) مُتَّكِئاً فَاسْتَوَى جَالِساً ثُمَّ قَالَ إِنَّ الْفَاسِقَ عَلَيْهِ لَعْنَةُ اللَّهِ آوَى عَمَّهُ الْمُغِيرَةَ بْنَ أَبِي الْعَاصِ وَ كَانَ مِمَّنْ هَدَرَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) دَمَهُ فَقَالَ لِابْنَةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) لَا تُخْبِرِي أَبَاكِ بِمَكَانِهِ كَأَنَّهُ لَا يُوقِنُ أَنَّ الْوَحْيَ يَأْتِي مُحَمَّداً \nفَقَالَتْ مَا كُنْتُ لِأَكْتُمَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) عَدُوَّهُ فَجَعَلَهُ بَيْنَ مِشْجَبٍ لَهُ وَ لَحَفَهُ بِقَطِيفَةٍ فَأَتَى رَسُولَ اللَّهِ ( صلى الله عليه وآله ) الْوَحْيُ فَأَخْبَرَهُ بِمَكَانِهِ فَبَعَثَ إِلَيْهِ عَلِيّاً ( عليه السلام ) وَ قَالَ اشْتَمِلْ عَلَى سَيْفِكَ ائْتِ بَيْتَ ابْنَةِ ابْنِ عَمِّكَ فَإِنْ ظَفِرْتَ بِالْمُغِيرَةِ فَاقْتُلْهُ \nفَأَتَى الْبَيْتَ فَجَالَ فِيهِ فَلَمْ يَظْفَرْ بِهِ فَرَجَعَ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَأَخْبَرَهُ فَقَالَ يَا رَسُولَ اللَّهِ لَمْ أَرَهُ فَقَالَ إِنَّ الْوَحْيَ قَدْ أَتَانِي فَأَخْبَرَنِي أَنَّهُ فِي الْمِشْجَبِ وَ دَخَلَ عُثْمَانُ بَعْدَ خُرُوجِ عَلِيٍّ ( عليه السلام ) فَأَخَذَ بِيَدِ عَمِّهِ فَأَتَى بِهِ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) فَلَمَّا رَآهُ أَكَبَّ عَلَيْهِ وَ لَمْ يَلْتَفِتْ إِلَيْهِ وَ كَانَ نَبِيُّ اللَّهِ ( صلى الله عليه وآله ) حَيِيّاً كَرِيماً فَقَالَ يَا رَسُولَ اللَّهِ هَذَا عَمِّي هَذَا الْمُغِيرَةُ بْنُ أَبِي الْعَاصِ وَفَدَ وَ الَّذِي بَعَثَكَ بِالْحَقِّ آمَنْتَهُ \nقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ كَذَبَ وَ الَّذِي بَعَثَهُ بِالْحَقِّ مَا آمَنَهُ فَأَعَادَهَا ثَلَاثاً وَ أَعَادَهَا أَبُو عَبْدِ اللَّهِ ( عليه السلام ) ثَلَاثاً أَنَّى آمَنَهُ إِلَّا أَنَّهُ يَأْتِيهِ عَنْ يَمِينِهِ ثُمَّ يَأْتِيهِ عَنْ يَسَارِهِ فَلَمَّا كَانَ فِي الرَّابِعَةِ رَفَعَ رَأْسَهُ إِلَيْهِ فَقَالَ لَهُ قَدْ جَعَلْتُ لَكَ ثَلَاثاً فَإِنْ قَدَرْتُ عَلَيْهِ بَعْدَ ثَالِثَةٍ قَتَلْتُهُ\nفَلَمَّا أَدْبَرَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) اللَّهُمَّ الْعَنِ الْمُغِيرَةَ بْنَ أَبِي الْعَاصِ وَ الْعَنْ مَنْ يُؤْوِيهِ وَ الْعَنْ مَنْ يَحْمِلُهُ وَ الْعَنْ مَنْ يُطْعِمُهُ وَ الْعَنْ مَنْ يَسْقِيهِ وَ الْعَنْ مَنْ يُجَهِّزُهُ وَ الْعَنْ مَنْ يُعْطِيهِ سِقَاءً أَوْ حِذَاءً أَوْ رِشَاءً أَوْ وِعَاءً وَ هُوَ يَعُدُّهُنَّ بِيَمِينِهِ وَ انْطَلَقَ بِهِ عُثْمَانُ فَآوَاهُ وَ أَطْعَمَهُ وَ سَقَاهُ وَ حَمَلَهُ وَ جَهَّزَهُ حَتَّى فَعَلَ جَمِيعَ مَا لَعَنَ عَلَيْهِ النَّبِيُّ ( صلى الله عليه وآله ) مَنْ يَفْعَلُهُ بِهِ\nثُمَّ أَخْرَجَهُ فِي الْيَوْمِ الرَّابِعِ يَسُوقُهُ فَلَمْ يَخْرُجْ مِنْ أَبْيَاتِ الْمَدِينَةِ حَتَّى أَعْطَبَ اللَّهُ رَاحِلَتَهُ وَ نُقِبَ حِذَاهُ وَ وَرِمَتْ قَدَمَاهُ فَاسْتَعَانَ بِيَدَيْهِ وَ رُكْبَتَيْهِ وَ أَثْقَلَهُ جَهَازُهُ حَتَّى وَجَسَ بِهِ فَأَتَى شَجَرَةً فَاسْتَظَلَّ بِهَا لَوْ أَتَاهَا بَعْضُكُمْ مَا أَبْهَرَهُ ذَلِكَ\nفَأَتَى رَسُولَ اللَّهِ ( صلى الله عليه وآله ) الْوَحْيُ فَأَخْبَرَهُ بِذَلِكَ فَدَعَا عَلِيّاً ( عليه السلام ) فَقَالَ خُذْ سَيْفَكَ وَ انْطَلِقْ أَنْتَ وَ عَمَّارٌ وَ ثَالِثٌ لَهُمْ فَأْتِ الْمُغِيرَةَ بْنَ أَبِي الْعَاصِ تَحْتَ شَجَرَةِ كَذَا وَ كَذَا فَأَتَاهُ عَلِيٌّ ( عليه السلام ) فَقَتَلَهُ فَضَرَبَ عُثْمَانُ بِنْتَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ قَالَ أَنْتِ أَخْبَرْتِ أَبَاكِ بِمَكَانِهِ\nفَبَعَثَتْ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) تَشْكُو مَا لَقِيَتْ فَأَرْسَلَ إِلَيْهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) اقْنَيْ حَيَاءَكِ مَا أَقْبَحَ بِالْمَرْأَةِ ذَاتِ حَسَبٍ وَ دِينٍ فِي كُلِّ يَوْمٍ تَشْكُو زَوْجَهَا فَأَرْسَلَتْ إِلَيْهِ مَرَّاتٍ كُلَّ ذَلِكَ يَقُولُ لَهَا ذَلِكَ فَلَمَّا كَانَ فِي الرَّابِعَةِ دَعَا عَلِيّاً ( عليه السلام ) وَ قَالَ خُذْ سَيْفَكَ وَ اشْتَمِلْ عَلَيْهِ ثُمَّ ائْتِ بَيْتَ ابْنَةِ ابْنِ عَمِّكَ فَخُذْ بِيَدِهَا فَإِنْ حَالَ بَيْنَكَ وَ بَيْنَهَا أَحَدٌ فَاحْطِمْهُ بِالسَّيْفِ\nوَ أَقْبَلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كَالْوَالِهِ مِنْ مَنْزِلِهِ إِلَى دَارِ عُثْمَانَ فَأَخْرَجَ عَلِيٌّ ( عليه السلام ) ابْنَةَ رَسُولِ اللَّهِ فَلَمَّا نَظَرَتْ إِلَيْهِ رَفَعَتْ صَوْتَهَا بِالْبُكَاءِ وَ اسْتَعْبَرَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ بَكَى ثُمَّ أَدْخَلَهَا مَنْزِلَهُ وَ كَشَفَتْ عَنْ ظَهْرِهَا فَلَمَّا أَنْ رَأَى مَا بِظَهْرِهَا قَالَ ثَلَاثَ مَرَّاتٍ مَا لَهُ قَتَلَكِ قَتَلَهُ اللَّهُ وَ كَانَ ذَلِكَ يَوْمَ الْأَحَدِ وَ بَاتَ عُثْمَانُ مُلْتَحِفاً بِجَارِيَتِهَا\nفَمَكَثَ الْإِثْنَيْنَ وَ الثَّلَاثَاءَ وَ مَاتَتْ فِي الْيَوْمِ الرَّابِعِ فَلَمَّا حَضَرَ أَنْ يَخْرُجَ بِهَا أَمَرَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَاطِمَةَ ( عليها السلام ) فَخَرَجَتْ ( عليها السلام ) وَ نِسَاءُ الْمُؤْمِنِينَ مَعَهَا وَ خَرَجَ عُثْمَانُ يُشَيِّعُ جَنَازَتَهَا فَلَمَّا نَظَرَ إِلَيْهِ النَّبِيُّ ( صلى الله عليه وآله ) قَالَ مَنْ أَطَافَ الْبَارِحَةَ بِأَهْلِهِ أَوْ بِفَتَاتِهِ فَلَا يَتْبَعَنَّ جَنَازَتَهَا قَالَ ذَلِكَ ثَلَاثاً فَلَمْ يَنْصَرِفْ\nفَلَمَّا كَانَ فِي الرَّابِعَةِ قَالَ لَيَنْصَرِفَنَّ أَوْ لَأُسَمِّيَنَّ بِاسْمِهِ فَأَقْبَلَ عُثْمَانُ مُتَوَكِّئاً عَلَى مَوْلًى لَهُ مُمْسِكاً بِبَطْنِهِ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَشْتَكِي بَطْنِي فَإِنْ رَأَيْتَ أَنْ تَأْذَنَ لِي أَنْصَرِفُ قَالَ انْصَرِفْ وَ خَرَجَتْ فَاطِمَةُ ( عليها السلام ) وَ نِسَاءُ الْمُؤْمِنِينَ وَ الْمُهَاجِرِينَ فَصَلَّيْنَ عَلَى الْجِنَازَةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father and Ahmad Bin Muhammad Al Kufy, from one of his companions, from Safwan Bin Yahya, from Yazeed Bin Khalifa Al Khowlany, and he is Yazeed Bin Khalifa Al Harsy who said, \n‘Isa Bin Abdullah asked Abu Abdullah<sup>asws</sup>, and I was present, so he said, ‘The women are going out to the funeral’. And he<sup>asws</sup> was reclining, so he<sup>asws</sup> sat upright, then said: ‘The evil-doer, may the Curse of Allah<sup>azwj</sup> be upon him. Al-Mugheira Bin Abu Al-A’as, his uncle sheltered him, and he was from the ones Rasool-Allah<sup>saww</sup> permitted his<sup>saww</sup> blood to be spilled (killed). He (his uncle) said to a daughter of Rasool-Allah<sup>saww</sup>, ‘Do not inform your father<sup>saww</sup> of his (Mugheira’s) whereabouts’. It was as if he had no conviction that the Revelation comes to Muhammad<sup>saww</sup>.\nSo she said, ‘I was not one to conceal from Rasool-Allah<sup>saww</sup> the whereabouts of his<sup>saww</sup> enemy’. So he made him (the evil-doer) to be inside a cupboard of his and wrapped him in a velvet cloth. So Revelation came to Rasool-Allah<sup>saww</sup>, and he<sup>saww</sup> was informed of his (hiding) place. So he<sup>saww</sup> sent Ali<sup>asws</sup> to him and said: ‘Wrap up upon your<sup>asws</sup> sword, go to the house of the daughter of your cousin, and if you get hold of Al-Mugheira, so kill him’. \nSo he<sup>asws</sup> went to the house and looked around in it but did not come across him. So he<sup>asws</sup> returned to Rasool-Allah<sup>as</sup> and informed him<sup>saww</sup>, and he<sup>asws</sup> said: ‘O Rasool-Allah<sup>saww</sup>, I<sup>asws</sup> did not see him’. So he<sup>saww</sup> said: ‘The Revelation had come to me<sup>saww</sup> and informed me<sup>saww</sup> that he is in the cupboard. And Usman came over after the exit of Ali<sup>asws</sup>, so he grabbed the hand of his uncle and came over with him to the Prophet<sup>saww</sup>. So when he<sup>saww</sup> saw him, he<sup>saww</sup> stumbled upon him and did not turn towards him. And the Prophet<sup>saww</sup> was bashful, benevolent. So he said, ‘O Rasool-Allah<sup>saww</sup>! This is my uncle. This is Al-Mugheira Bin Abu Al-A’as who has come. By the One<sup>azwj</sup> Who Sent you<sup>saww</sup>! You<sup>saww</sup> have granted him safety’.\nAbu Abdullah<sup>asws</sup> said: ‘And he (Usman) lied, by the One<sup>azwj</sup> Who Sent him<sup>saww</sup> with the Truth, he<sup>saww</sup> did not grant him safety. So he repeated it three times, and Abu Abdullah<sup>asws</sup> repeated it three times: ‘I<sup>asws</sup> believe him except that he came to him<sup>saww</sup> from his<sup>saww</sup> right, then came to him<sup>saww</sup> from his<sup>saw</sup> left. So when it was during the fourth time, he<sup>saww</sup> raised his<sup>saww</sup> head and said to him: ‘I<sup>saww</sup> give you three days, so if I<sup>saww</sup> were to find him after three days, he would be killed’. \nSo when he turned around Rasool-Allah<sup>saww</sup> said: ‘O Allah<sup>azwj</sup>! Curse Al-Mugheira Bin Abu Al-A’as, and Curse the one who shelters him, and Curse the one who carries him, and Curse the one who feeds him, and Curse the one who quenches him, and Curse the one who equips him, and Curse the one who gives him a drink, or shoes, or clothes, or plates, and gives him with his right hand. \nAnd Usman went with him, so he sheltered him, and fed him, and quenched him, and carried him, and equipped him until he had done the entirety of what the Prophet<sup>saww</sup> had cursed upon for the one who did so with him.\nThen he (Usman) brought him out during the fourth day, ushering him (behind him). So he had not come out from the houses of Al-Medina until Allah<sup>azwj</sup> Damaged his ride, and Punctured his shoes, and his feet swelled up. So he took assistance by his hands and his knees, and his supplied weighted him down until he became afraid of his life. So he went over to a tree to seek the shade with it. If one of you had gone to it, he would not have missed him (as his condition was miserable). \nSo Revelation came unto Rasool-Allah<sup>saww</sup> and he<sup>saww</sup> was informed with that. So he<sup>saww</sup> called Ali<sup>asws</sup> and said: ‘Take your<sup>asws</sup> sword and go, you<sup>asws</sup> and Ammar, and a third person, so go to Al-Mugheira Bin Abu Al-A’as (who is) beneath such and such a tree. So Ali<sup>asws</sup> went over to him and killed him. So (later on) Usman struck a (step) daughter of Rasool-Allah<sup>saww</sup> and said: ‘You informed your father<sup>saww</sup> of his whereabouts. \nSo she sent a message to Rasool-Allah<sup>saww</sup> complaining of what she faced. So Rasool-Allah<sup>saww</sup> sent a message to her: ‘Cover your shame. How ugly of the woman with a (good) lineage and Religion during every day complaining of her husband’. So she sent a message to him<sup>saww</sup> many times, during each of that he<sup>saww</sup> was saying that to her. So when it was during the fourth time, he<sup>saww</sup> called Ali<sup>asws</sup> and said: ‘Take your<sup>asws</sup> sword and cover upon it, then go to the house of the daughter of your<sup>asws</sup> cousin, and take her by the hand. So if anyone were to come between you<sup>asws</sup> and her, break him with the sword’. \nAnd Rasool-Allah<sup>saww</sup> came over flustered from his<sup>saww</sup> house to the house of Usman. So Ali<sup>asws</sup> brought out the (step) daughter of Rasool-Allah<sup>saww</sup>. So when she looked at him<sup>saww</sup>, she raised her voice with the wailing, and Rasool-Allah<sup>saww</sup> burst into tears and cried. Then he<sup>saww</sup> took her to his<sup>saww</sup> own house, and she uncovered her backside. So when he<sup>saww</sup> saw what had appeared on her (marks of the beating), said three times: ‘What is the matter with him hitting you? May Allah<sup>azwj</sup> Kill him’. And that was during the day of Sunday, and Usman spent the night covered with his slave girl.\nSo he remained (like that) for Monday and Tuesday, and she died on the fourth day. So when he came to take her out, Rasool-Allah<sup>saww</sup> instructed Syeda Fatima<sup>asws</sup>. So she<sup>asws</sup> went out, and the womenfolk of the Believers were with her<sup>asws</sup>, and Usman went out escorting her funeral. So when the Prophet<sup>saww</sup> saw him, he<sup>saww</sup> said: ‘The one who went to his wife last night or with his slave girl, so he should not follow her funeral’. He<sup>saww</sup> said that three (times). But he did not leave.\nSo when it was the fourth time, he<sup>saww</sup> said: ‘Will you leave or shall I<sup>saww</sup> mention his name?’ So Usman came over leaning upon a slave of his, holding his belly, and he said, ‘O Rasool-Allah<sup>saww</sup>! I complain of my bellyache. So if you<sup>saww</sup> see fit, permit me to leave’. He<sup>saww</sup> said: ‘Leave!’ And Syeda Fatima<sup>asws</sup> came out, and the womenfolk of the Believers, and the Emigrants, so they prayed <span class=\"iTxt\">Salaat</span> upon the deceased’."}]}, {"index": 4729, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:9", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا أَعَدَّ الرَّجُلُ كَفَنَهُ فَهُوَ مَأْجُورٌ كُلَّمَا نَظَرَ إِلَيْهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the man prepares his own shroud, so he is Recompesed every time he looks towards it’."}]}, {"index": 4730, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:10", "text": "وَ بِهَذَا الْإِسْنَادِ أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) اشْتَكَى عَيْنُهُ فَعَادَهُ النَّبِيُّ ( صلى الله عليه وآله ) فَإِذَا هُوَ يَصِيحُ فَقَالَ النَّبِيُّ ( صلى الله عليه وآله ) أَ جَزَعاً أَمْ وَجَعاً فَقَالَ يَا رَسُولَ اللَّهِ مَا وَجِعْتُ وَجَعاً قَطُّ أَشَدَّ مِنْهُ فَقَالَ يَا عَلِيُّ إِنَّ مَلَكَ الْمَوْتِ إِذَا نَزَلَ لِقَبْضِ رُوحِ الْكَافِرِ نَزَلَ مَعَهُ سَفُّودٌ مِنْ نَارٍ فَيَنْزِعُ رُوحَهُ بِهِ فَتَصِيحُ جَهَنَّمُ \nفَاسْتَوَى عَلِيٌّ ( عليه السلام ) جَالِساً فَقَالَ يَا رَسُولَ اللَّهِ أَعِدْ عَلَيَّ حَدِيثَكَ فَلَقَدْ أَنْسَانِي وَجَعِي مَا قُلْتَ ثُمَّ قَالَ هَلْ يُصِيبُ ذَلِكَ أَحَداً مِنْ أُمَّتِكَ قَالَ نَعَمْ حَاكِمٌ جَائِرٌ وَ آكِلُ مَالِ الْيَتِيمِ ظُلْماً وَ شَاهِدُ زُورٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "And by this chain, \n‘Amir Al-Momineen<sup>asws</sup> complained of his<sup>asws</sup> eyes, so the Prophet<sup>as</sup> visited him<sup>asws</sup>. So when he<sup>asws</sup> screamed (with pain), the Prophet<sup>saww</sup> said: ‘Is it panic or pain?’ So he<sup>asws</sup> said: ‘O Rasool-Allah<sup>saww</sup>! I<sup>asws</sup> have not experience a pain at all more intense than it’. So he<sup>saww</sup> said: ‘O Ali<sup>asws</sup>! When the Angel of death descends to capture the soul of the Infidel, a skewer of fire descends along with him. So he removes his soul with it, and the Hell shrieks out’. \nSo Ali<sup>asws</sup> sat up straight and said: ‘O Rasool-Allah<sup>saww</sup>! Repeat your<sup>saww</sup> Hadeeth to me<sup>asws</sup>, for it has made me<sup>asws</sup> forget my<sup>asws</sup> pain what you<sup>saww</sup> said’. Then he<sup>asws</sup> said: ‘Would anyone from your<sup>saww</sup> community be hit by that?’ He<sup>saww</sup> said: ‘Yes, an unjust ruler, and the consumer of the wealth of the orphan unjustly, and the false testifier’."}]}, {"index": 4731, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:11", "text": "وَ بِهَذَا الْإِسْنَادِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ النَّبِيُّ ( صلى الله عليه وآله ) مُسْتَرِيحٌ وَ مُسْتَرَاحٌ مِنْهُ أَمَّا الْمُسْتَرِيحُ فَالْعَبْدُ الصَّالِحُ اسْتَرَاحَ مِنْ غَمِّ الدُّنْيَا وَ مَا كَانَ فِيهِ مِنَ الْعِبَادَةِ إِلَى الرَّاحَةِ وَ نَعِيمِ الْآخِرَةِ وَ أَمَّا الْمُسْتَرَاحُ مِنْهُ فَالْفَاجِرُ يَسْتَرِيحُ مِنْهُ الْمَلَكَانِ اللَّذَانِ يَحْفَظَانِ عَلَيْهِ وَ خَادِمُهُ وَ أَهْلُهُ وَ الْأَرْضُ الَّتِي كَانَ يَمْشِي عَلَيْهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "And by this chain, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Prophet<sup>saww</sup> said: ‘There is a relieved one and the one relieved from. As for the relieved one, so it is the righteous servant relieved from the sorrow of the world and whatever was therein from the worship to the rest and bliss of the Hereafter; and as for the one relieved from, so it is the evil-doer from whom are relieved the two Angels who were recording his deeds against him, and his servants, and his family, and the ground which he used to walk upon’."}]}, {"index": 4732, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:12", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا أَعَدَّ الرَّجُلُ كَفَنَهُ فَهُوَ مَأْجُورٌ كُلَّمَا نَظَرَ إِلَيْهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Al Nowfaly, from Al Sakuny, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the man prepares his shroud, so he would be Recompensed every time he looks towards it’."}]}, {"index": 4733, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:13", "text": "سَهْلُ بْنُ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ قَالَ سَمِعْتُ أَبَا الْحَسَنِ الْأَوَّلَ ( عليه السلام ) يَقُولُ إِذَا مَاتَ الْمُؤْمِنُ بَكَتْ عَلَيْهِ الْمَلَائِكَةُ وَ بِقَاعُ الْأَرْضِ الَّتِي كَانَ يَعْبُدُ اللَّهَ عَلَيْهَا وَ أَبْوَابُ السَّمَاءِ الَّتِي كَانَ يُصْعَدُ أَعْمَالُهُ فِيهَا وَ ثُلِمَ ثُلْمَةٌ فِي الْإِسْلَامِ لَا يَسُدُّهَا شَيْ‏ءٌ لِأَنَّ الْمُؤْمِنِينَ حُصُونُ الْإِسْلَامِ كَحُصُونِ سُورِ الْمَدِينَةِ لَهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Sahl Bin Ziyad and Ali Bin Ibrahim, from his father, altogether from Ibn Mahboub, from Ali Bin Raib who said, \n‘I heard Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup> saying: ‘When the Believer dies, the Angels weep over him, and the spot of the earth in which he used to worship Allah<sup>azwj</sup> upon it, and the doors of the sky through which his deeds used to ascend; and a gap appears in Al-Islam which nothing can fill, because the Believers are the fortresses of Al-Islam like the protective walls around the city’."}]}, {"index": 4734, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:14", "text": "سَهْلُ بْنُ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ إِسْمَاعِيلَ بْنِ يَسَارٍ عَنْ عَمْرِو بْنِ يَزِيدَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا حَضَرَ الْمَيِّتَ أَرْبَعُونَ رَجُلًا فَقَالُوا اللَّهُمَّ إِنَّا لَا نَعْلَمُ مِنْهُ إِلَّا خَيْراً قَالَ اللَّهُ عَزَّ وَ جَلَّ قَدْ قَبِلْتُ شَهَادَتَكُمْ وَ غَفَرْتُ لَهُ مَا عَلِمْتُ مِمَّا لَا تَعْلَمُونَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Sahl Bin Ziyad, from Muhammad Bin Ali, from Ismail Bin Yasaar, from Amro Bin Yazeed, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When forty men are present for the deceased and they are saying, ‘O Allah<sup>azwj</sup>! We do not know from him except for the goodness’, Allah Mighty and Majestic Says: “I<sup>azwj</sup> have Accepted your testimonies and Forgiven for him what I<sup>azwj</sup> Know from what you do not know’."}]}, {"index": 4735, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:15", "text": "سَهْلٌ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ كَانَ عَلَى قَبْرِ إِبْرَاهِيمَ ابْنِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) عَذْقٌ يُظِلُّهُ مِنَ الشَّمْسِ يَدُورُ حَيْثُ دَارَتِ الشَّمْسُ فَلَمَّا يَبِسَ الْعَذْقُ دَرَسَ الْقَبْرُ فَلَمْ يُعْلَمْ مَكَانُهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Sahl, from Ahmad Bin Muhammad Bin Abu Nasr, from Hammad Bin Usman, from Aamir Bin Abdullah who said, \n‘I heard Abu Abdullah<sup>asws</sup> saying: ‘There was upon the grave of Ibrahim<sup>as</sup> the son<sup>as</sup> of Rasool-Allah<sup>saww</sup> a tree which used to shade him<sup>as</sup> from the sun, circling wherever the sun circled. So when the tree dried out, the grave was obscured, so its place was no longer known’."}]}, {"index": 4736, "local_index": 16, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:16", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ الْبَرَاءُ بْنُ مَعْرُورٍ التَّمِيمِيُّ الْأَنْصَارِيُّ بِالْمَدِينَةِ وَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِمَكَّةَ وَ إِنَّهُ حَضَرَهُ الْمَوْتُ وَ كَانَ رَسُولُ اللَّهِ  ( صلى الله عليه وآله ) وَ الْمُسْلِمُونَ يُصَلُّونَ إِلَى بَيْتِ الْمَقْدِسِ فَأَوْصَى الْبَرَاءُ إِذَا دُفِنَ أَنْ يَجْعَلَ وَجْهَهُ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) إِلَى الْقِبْلَةِ فَجَرَتْ بِهِ السُّنَّةُ وَ أَنَّهُ أَوْصَى بِثُلُثِ مَالِهِ فَنَزَلَ بِهِ الْكِتَابُ وَ جَرَتْ بِهِ السُّنَّةُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Abdullah Bin Aamir, from Ali Bin Mahziyar, from Hammad Bin Isa, from Muawiya Bin Ammar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Al-Bara’a Bin Marour Al-Tamimy Al-Ansary was in Al-Medina, and Rasool-Allah<sup>saww</sup> was in Makkah, and the death presented itself to him, and Rasool-Allah<sup>saww</sup> and the Muslims were praying <span class=\"iTxt\">Salaat</span> (facing) towards Bayt Al-Maqdis. So Bara’a bequeathed that when he is buried, his face be made towards Rasool-Allah<sup>saww</sup> , towards the Qiblah. So the Sunnah flowed with it, and he bequeathed with a third of his wealth, and the Book Revealed with it and the Sunnah flowed with it’."}]}, {"index": 4737, "local_index": 17, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:17", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ جَاءَ جَبْرَئِيلُ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) فَقَالَ يَا مُحَمَّدُ عِشْ مَا شِئْتَ فَإِنَّكَ مَيِّتٌ وَ أَحْبِبْ مَنْ شِئْتَ فَإِنَّكَ مُفَارِقُهُ وَ اعْمَلْ مَا شِئْتَ فَإِنَّكَ لَاقِيهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Jibraeel<sup>as</sup> came over to the Prophet<sup>saww</sup> and he<sup>as</sup> said: ‘O Muhammad<sup>saww</sup>! Live as you<sup>saww</sup> wish but you<sup>saww</sup> will certainly die; love whoever you<sup>saww</sup> wish, but you<sup>saww</sup> will certainly depart from him, and act as you<sup>saww</sup> wish but one day you<sup>saww</sup> will face your deeds.’."}]}, {"index": 4738, "local_index": 18, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:18", "text": "ابْنُ أَبِي عُمَيْرٍ عَنْ أَيُّوبَ عَنْ أَبِي عُبَيْدَةَ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) حَدِّثْنِي مَا أَنْتَفِعُ بِهِ فَقَالَ يَا أَبَا عُبَيْدَةَ أَكْثِرْ ذِكْرَ الْمَوْتِ فَإِنَّهُ لَمْ يُكْثِرْ ذِكْرَهُ إِنْسَانٌ إِلَّا زَهِدَ فِي الدُّنْيَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ibn Abu Umyer, from Ayoub, from Abu Ubeyday who said, \n‘I said to Abu Ja’far<sup>asws</sup>, ‘Narrate to me what I can benefit with’. So he<sup>asws</sup> said: ‘O Abu Ubeyda! Frequently remember the death, for a person would not mention it frequently except that he would be an ascetic in the world’."}]}, {"index": 4739, "local_index": 19, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:19", "text": "ابْنُ أَبِي عُمَيْرٍ عَنِ الْحَكَمِ بْنِ أَيْمَنَ عَنْ دَاوُدَ الْأَبْزَارِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ مُنَادٍ يُنَادِي فِي كُلِّ يَوْمٍ ابْنَ آدَمَ لِدْ لِلْمَوْتِ وَ اجْمَعْ لِلْفَنَاءِ وَ ابْنِ لِلْخَرَابِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ibn Abu Umeyr, from Al Hakam Bin Ayman, from Dawood Al Abzary, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘A Caller Calls out during every day: ‘Son of Adam<sup>as</sup> gives birth for the death, and amasses for the annihilation, and builds for the ruination’."}]}, {"index": 4740, "local_index": 20, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:20", "text": "ابْنُ أَبِي عُمَيْرٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ شَكَوْتُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) الْوَسْوَاسَ فَقَالَ يَا أَبَا مُحَمَّدٍ اذْكُرْ تَقَطُّعَ أَوْصَالِكَ فِي قَبْرِكَ وَ رُجُوعَ أَحْبَابِكَ عَنْكَ إِذَا دَفَنُوكَ فِي حُفْرَتِكَ وَ خُرُوجَ بَنَاتِ الْمَاءِ مِنْ مَنْخِرَيْكَ وَ أَكْلَ الدُّودِ لَحْمَكَ فَإِنَّ ذَلِكَ يُسَلِّي عَنْكَ مَا أَنْتَ فِيهِ \nقَالَ أَبُو بَصِيرٍ فَوَ اللَّهِ مَا ذَكَرْتُهُ إِلَّا سَلَّى عَنِّي مَا أَنَا فِيهِ مِنْ هَمِّ الدُّنْيَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ibn Abu Umeyr, from Ali Bin Abu Hamza, from Abu Baseer who said, \n‘I complained to Abu Abdullah<sup>asws</sup> of the temptations (in my mind), so he<sup>asws</sup> said: ‘O Abu Muhammad! Remember the breaking of your bones in your grave, and the return of your loves ones from you when they bury you in your pit (grave), and the exit of drops of the water from your nostrils, and the insects eating your flesh. This will help you to overcome temptations’. \nAbu Baseer said, ‘By Allah<sup>azwj</sup>! I did not remember it except it eased from me what I was in, from the stress of the world’."}]}, {"index": 4741, "local_index": 21, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:21", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ أَسْبَاطِ بْنِ سَالِمٍ مَوْلَى أَبَانٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ يَعْلَمُ مَلَكُ الْمَوْتِ بِقَبْضِ مَنْ يَقْبِضُ قَالَ لَا إِنَّمَا هِيَ صِكَاكٌ تَنْزِلُ مِنَ السَّمَاءِ اقْبِضْ نَفْسَ فُلَانِ بْنِ فُلَانٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali AL Ashary, from Muhammad Bin Abdul Jabbar, from Ibn Fazzal, from Ali Bin Uqba, from Asbaat Bin Salim, a slave of Aban who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Does the Angel of death know of whom (whose soul) he has to capture?’ He<sup>asws</sup> said: ‘No. But rather, it is a deed which descends from the sky: ‘Capture the soul of so and so!’’."}]}, {"index": 4742, "local_index": 22, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:22", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَا مِنْ أَهْلِ بَيْتِ شَعْرٍ وَ لَا وَبَرٍ إِلَّا وَ مَلَكُ الْمَوْتِ يَتَصَفَّحُهُمْ فِي كُلِّ يَوْمٍ خَمْسَ مَرَّاتٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim who said, \n‘Abu Abdullah<sup>asws</sup> said: ‘There is none from the people of a house of fur or wool, except that the Angel of death browses them five times during every day’."}]}, {"index": 4743, "local_index": 23, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:23", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ كَانَ مَعَهُ كَفَنُهُ فِي بَيْتِهِ لَمْ يُكْتَبْ مِنَ الْغَافِلِينَ وَ كَانَ مَأْجُوراً كُلَّمَا نَظَرَ إِلَيْهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from the one who informed him, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who was with his shroud in his house would never be written as being from the oblivious ones, and he would be Recompensed every time he looks towards it’."}]}, {"index": 4744, "local_index": 24, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:24", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنِ الْمُفَضَّلِ بْنِ صَالِحٍ عَنْ زَيْدٍ الشَّحَّامِ قَالَ سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَنْ مَلَكِ الْمَوْتِ يُقَالُ الْأَرْضُ بَيْنَ يَدَيْهِ كَالْقَصْعَةِ يَمُدُّ يَدَهُ مِنْهَا حَيْثُ يَشَاءُ قَالَ نَعَمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Amro Bin Usman, from Al Mufazzal Bin Salih, from Zayd Al Shihaam who said, \n‘Abu Abdullah<sup>asws</sup> was asked about the Angel of death, it is said that the earth is in front of him like the bowl. He extends his hand from it wheresoever he so desire to. He<sup>asws</sup> said: ‘Yes’."}]}, {"index": 4745, "local_index": 25, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:25", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ أَبِي الْمَغْرَاءِ قَالَ حَدَّثَنِي يَعْقُوبُ الْأَحْمَرُ قَالَ دَخَلْنَا عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) نُعَزِّيهِ بِإِسْمَاعِيلَ فَتَرَحَّمَ عَلَيْهِ ثُمَّ قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ نَعَى إِلَى نَبِيِّهِ ( صلى الله عليه وآله ) نَفْسَهُ فَقَالَ إِنَّكَ مَيِّتٌ وَ إِنَّهُمْ مَيِّتُونَ وَ قَالَ كُلُّ نَفْسٍ ذائِقَةُ الْمَوْتِ\nثُمَّ أَنْشَأَ يُحَدِّثُ فَقَالَ إِنَّهُ يَمُوتُ أَهْلُ الْأَرْضِ حَتَّى لَا يَبْقَى أَحَدٌ ثُمَّ يَمُوتُ أَهْلُ السَّمَاءِ حَتَّى لَا يَبْقَى أَحَدٌ إِلَّا مَلَكُ الْمَوْتِ وَ حَمَلَةُ الْعَرْشِ وَ جَبْرَئِيلُ وَ مِيكَائِيلُ ( عليهم السلام ) قَالَ فَيَجِي‏ءُ مَلَكُ الْمَوْتِ ( عليه السلام ) حَتَّى يَقُومَ بَيْنَ يَدَيِ اللَّهِ عَزَّ وَ جَلَّ فَيُقَالُ لَهُ مَنْ بَقِيَ وَ هُوَ أَعْلَمُ فَيَقُولُ يَا رَبِّ لَمْ يَبْقَ إِلَّا مَلَكُ الْمَوْتِ وَ حَمَلَةُ الْعَرْشِ وَ جَبْرَئِيلُ وَ مِيكَائِيلُ ( عليهم السلام )\nفَيُقَالُ لَهُ قُلْ لِجَبْرَئِيلَ وَ مِيكَائِيلَ فَلْيَمُوتَا فَتَقُولُ الْمَلَائِكَةُ عِنْدَ ذَلِكَ يَا رَبِّ رَسُولَيْكَ وَ أَمِينَيْكَ فَيَقُولُ إِنِّي قَدْ قَضَيْتُ عَلَى كُلِّ نَفْسٍ فِيهَا الرُّوحُ الْمَوْتَ\nثُمَّ يَجِي‏ءُ مَلَكُ الْمَوْتِ حَتَّى يَقِفَ بَيْنَ يَدَيِ اللَّهِ عَزَّ وَ جَلَّ فَيُقَالُ لَهُ مَنْ بَقِيَ وَ هُوَ أَعْلَمُ فَيَقُولُ يَا رَبِّ لَمْ يَبْقَ إِلَّا مَلَكُ الْمَوْتِ وَ حَمَلَةُ الْعَرْشِ فَيَقُولُ قُلْ لِحَمَلَةِ الْعَرْشِ فَلْيَمُوتُوا\nقَالَ ثُمَّ يَجِي‏ءُ كَئِيباً حَزِيناً لَا يَرْفَعُ طَرْفَهُ فَيُقَالُ مَنْ بَقِيَ فَيَقُولُ يَا رَبِّ لَمْ يَبْقَ إِلَّا مَلَكُ الْمَوْتِ فَيُقَالُ لَهُ مُتْ يَا مَلَكَ الْمَوْتِ فَيَمُوتُ \nثُمَّ يَأْخُذُ الْأَرْضَ بِيَمِينِهِ وَ السَّمَاوَاتِ بِيَمِينِهِ وَ يَقُولُ أَيْنَ الَّذِينَ كَانُوا يَدْعُونَ مَعِي شَرِيكاً أَيْنَ الَّذِينَ كَانُوا يَجْعَلُونَ مَعِي إِلَهاً آخَرَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Abu Al Magra’a who said, \n‘Yaqoub Al-Ahmar narrated to me saying, ‘We went over to Abu Abdullah<sup>asws</sup> to console him<sup>asws</sup> for his<sup>asws</sup> son Ismail (who had died). So he<sup>asws</sup> expressed mercy upon him, then said: ‘Allah<sup>azwj</sup> Mighty and Majestic Announced the death to His<sup>azwj</sup> Prophet<sup>saww</sup> Himself<sup>azwj</sup>, so He<sup>azwj</sup> Said: “You<sup>saww</sup> would be passing away and they (the people) would be dying”. And He<sup>azwj</sup> Said <span class=\"ibTxt\">[29:57] Every soul must taste of death</span>.\nThen he<sup>asws</sup> commenced narrating, so he<sup>asws</sup> said: ‘The inhabitants of the earth would be dying until there does not remain anyone. Then the inhabitants of the sky would be dying until there does not remain anyone except for the Angel of death, and the bearers of the Throne, and Jibraeel, and Mikaeel. So the Angel of death would come until he stands in front of Allah<sup>azwj</sup> Mighty and Majestic, so He<sup>azwj</sup> would say to him: “Who remains?”, and He<sup>azwj</sup> is more Knowing. So he would be saying: ‘O Lord<sup>azwj</sup>! There does not remain except the Angel of death, and the bearers of the Throne, and Jibraeel and Mikaeel’. \nSo He<sup>azwj</sup> would be Sayiing: “Say to Jibraeel and Mikaeel, so let them both die’. So the Angels would be saying during that: ‘O Lord<sup>azwj</sup>! They are Your<sup>azwj</sup> Messengers and Your<sup>azwj</sup> Trusted ones!’ So He<sup>azwj</sup> would be Saying: “I<sup>azwj</sup> have Ordained the death to be upon every self wherein is the soul!”\nThen the Angel of death would come until he pauses in front of Allah<sup>azwj</sup> Mighty and Majestic, and He<sup>azwj</sup> would Say to him: “Who remains?”, and He<sup>azwj</sup> is more Knowing’. So he would say: ‘O Lord<sup>azwj</sup>! There does not remain except for the Angel of death and the bearers of the Throne’. So He<sup>azwj</sup> would be Saying: “Say to the bearers of the Throne, so let them die”. \nHe<sup>asws</sup> said: ‘Then he would come bleak, said, not raising an eyebrow. So He<sup>azwj</sup> would be Saying to him: “Who remains?” So he would say: ‘O Lord<sup>azwj</sup>! There does not remain anyone except for the Angel of death’. So He<sup>azwj</sup> would be Saying to him: “Die, O Angel of death!” So he would be dying. \nThen He<sup>azwj</sup> would Seize the earth by His<sup>azwj</sup> Right, and the skies by His<sup>azwj</sup> Left and He<sup>azwj</sup> would be Saying: “Where are those who were claiming as being associates with Me<sup>azwj</sup>? Where are those who were made to be as gods besides Me<sup>azwj</sup>?”’."}]}, {"index": 4746, "local_index": 26, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:26", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ مُفَضَّلِ بْنِ صَالِحٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَخْبَرَنِي جَبْرَئِيلُ ( عليه السلام ) أَنَّ مَلَكاً مِنْ مَلَائِكَةِ اللَّهِ كَانَتْ لَهُ عِنْدَ اللَّهِ عَزَّ وَ جَلَّ مَنْزِلَةٌ عَظِيمَةٌ فَتُعُتِّبَ عَلَيْهِ فَأُهْبِطَ مِنَ السَّمَاءِ إِلَى الْأَرْضِ فَأَتَى إِدْرِيسَ ( عليه السلام ) فَقَالَ إِنَّ لَكَ مِنَ اللَّهِ مَنْزِلَةً فَاشْفَعْ لِي عِنْدَ رَبِّكَ \nفَصَلَّى ثَلَاثَ لَيَالٍ لَا يَفْتُرُ وَ صَامَ أَيَّامَهَا لَا يُفْطِرُ ثُمَّ طَلَبَ إِلَى اللَّهِ تَعَالَى فِي السَّحَرِ فِي الْمَلَكِ فَقَالَ الْمَلَكُ إِنَّكَ قَدْ أُعْطِيتَ سُؤْلَكَ وَ قَدْ أُطْلِقَ لِي جَنَاحِي وَ أَنَا أُحِبُّ أَنْ أُكَافِيَكَ فَاطْلُبْ إِلَيَّ حَاجَةً فَقَالَ تُرِينِي مَلَكَ الْمَوْتِ لَعَلِّي آنَسُ بِهِ فَإِنَّهُ لَيْسَ يَهْنِئُنِي مَعَ ذِكْرِهِ شَيْ‏ءٌ فَبَسَطَ جَنَاحَهُ ثُمَّ قَالَ ارْكَبْ فَصَعِدَ بِهِ يَطْلُبُ مَلَكَ الْمَوْتِ فِي السَّمَاءِ الدُّنْيَا \nفَقِيلَ لَهُ اصْعَدْ فَاسْتَقْبَلَهُ بَيْنَ السَّمَاءِ الرَّابِعَةِ وَ الْخَامِسَةِ فَقَالَ الْمَلَكُ يَا مَلَكَ الْمَوْتِ مَا لِي أَرَاكَ قَاطِباً قَالَ الْعَجَبُ إِنِّي تَحْتَ ظِلِّ الْعَرْشِ حَيْثُ أُمِرْتُ أَنْ أَقْبِضَ رُوحَ آدَمِيٍّ بَيْنَ السَّمَاءِ الرَّابِعَةِ وَ الْخَامِسَةِ فَسَمِعَ إِدْرِيسُ ( عليه السلام ) فَامْتَعَضَ فَخَرَّ مِنْ جَنَاحِ الْمَلَكِ فَقُبِضَ رُوحُهُ مَكَانَهُ وَ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ رَفَعْناهُ مَكاناً عَلِيًّا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Amro Bin Usman, from Mufazzal Bin Salih, from Jabir, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Jibraeel informed me that an Angel from the Angels of Allah<sup>azwj</sup> who would have for him a great status in the Presence of Allah<sup>azwj</sup>, but it transgressed, so he was descended from the sky to the earth. So he went to Idrees<sup>as</sup> and said: ‘For you<sup>as</sup> is a status from Allah<sup>azwj</sup>, therefore intercede for me in the Presence of your<sup>as</sup> Lord<sup>azwj</sup>’.\nSo he<sup>as</sup> prayed <span class=\"iTxt\">Salaat</span> for three nights unwavering, and Fasted its days, not breaking a Fast. Then he sought to Allah<sup>azwj</sup> the Exalted during the pre-dawn with regards to the (fallen) Angel. So the Angel said: ‘You<sup>as</sup> have been Granted your request, and my wings have been released for me, and I would love to suffice you<sup>as</sup>, therefore seek a need to me’. So he<sup>as</sup> said: ‘Show me the Angel of death, perhaps I<sup>as</sup> derive comfort with it, for nothing seems welcoming along with his mentioned’. So he spread his wings, then said: ‘Ride!’ So he<sup>as</sup> ascended upon him seeking the Angel of death in the sky of the world.\nSo it was said to him: ‘Ascend’. So he came across him in between the fourth and the fifth sky. So He said: ‘O Angel of death! What is the matter I see you frowning?’ He said: ‘Strange. I was beneath the shade of the Throne where I was Commanded to capture the soul of a human being between the fourth and the fifth sky. So Idrees<sup>as</sup> heard and resented, and he<sup>as</sup> fell down from the wing of the Angel, and his soul was captured at that spot; and Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\">[19:57] And We Elevated him to a High place</span>’."}]}, {"index": 4747, "local_index": 27, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:27", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنِ ابْنِ مُسْكَانَ عَنْ دَاوُدَ بْنِ فَرْقَدٍ أَبِي يَزِيدَ عَنِ ابْنِ أَبِي شَيْبَةَ الزُّهْرِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْمَوْتَ الْمَوْتَ أَلَا وَ لَا بُدَّ مِنَ الْمَوْتِ جَاءَ الْمَوْتُ بِمَا فِيهِ جَاءَ بِالرَّوْحِ وَ الرَّاحَةِ وَ الْكَرَّةِ الْمُبَارَكَةِ إِلَى جَنَّةٍ عَالِيَةٍ لِأَهْلِ دَارِ الْخُلُودِ الَّذِينَ كَانَ لَهَا سَعْيُهُمْ وَ فِيهَا رَغْبَتُهُمْ وَ جَاءَ الْمَوْتُ بِمَا فِيهِ بِالشِّقْوَةِ وَ النَّدَامَةِ وَ بِالْكَرَّةِ الْخَاسِرَةِ إِلَى نَارٍ حَامِيَةٍ لِأَهْلِ دَارِ الْغُرُورِ الَّذِينَ كَانَ لَهَا سَعْيُهُمْ وَ فِيهَا رَغْبَتُهُمْ \nثُمَّ قَالَ وَ قَالَ إِذَا اسْتَحَقَّتْ وَلَايَةُ اللَّهِ وَ السَّعَادَةُ جَاءَ الْأَجَلُ بَيْنَ الْعَيْنَيْنِ وَ ذَهَبَ الْأَمَلُ وَرَاءَ الظَّهْرِ وَ إِذَا اسْتَحَقَّتْ وَلَايَةُ الشَّيْطَانِ وَ الشَّقَاوَةُ جَاءَ الْأَمَلُ بَيْنَ الْعَيْنَيْنِ وَ ذَهَبَ الْأَجَلُ وَرَاءَ الظَّهْرِ \nقَالَ وَ سُئِلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَيُّ الْمُؤْمِنِينَ أَكْيَسُ فَقَالَ أَكْثَرُهُمْ ذِكْراً لِلْمَوْتِ وَ أَشَدُّهُمْ لَهُ اسْتِعْدَاداً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhamad, from Ali Bin Al Numan, from Ibn Muskan, from Dawod Bin Farqad Abu Yazeed, from Ibn Abu Shayba Al Zuhry, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The death! The death! Indeed, and the death is inevitable. The death comes with what is in it. It comes with the cool breeze and the rest, and the Blessed delight to the Lofty Paradise for the people of the eternal abode which they were striving for, and therein was their interest. And the death come with what is in it with the misery, and the regret, and with the turning to the loss to the Blazing Fire for the people of the house of deception which they were striving for, and therein was their interest.\nThen he<sup>asws</sup> said: ‘And he<sup>saww</sup> said:\n‘To those who deserve Wilayah (Guardianship) and the Protection of Allah<sup>azwj</sup> and Salvation, the death comes as it is in front of the eyes and the worldly ambitions are kept backward; but if one is under the wilayah (guardianship) of Satan, in his case misfortune and worldly ambitions come before his eyes, and the reality of the death is kept backward’. \nAnd He<sup>asws</sup> (the Imam<sup>asws</sup>) said that Rasool-Allah<sup>saww</sup> was asked, ‘Which one of the Believers is the most intelligent?’ So he<sup>saww</sup> said: ‘The one who most frequently remembers the death, and the one who is most intense in preparing for it’."}]}, {"index": 4748, "local_index": 28, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:28", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي حَمْزَةَ قَالَ سَمِعْتُ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) يَقُولُ عَجَبٌ كُلُّ الْعَجَبِ لِمَنْ أَنْكَرَ الْمَوْتَ وَ هُوَ يَرَى مَنْ يَمُوتُ كُلَّ يَوْمٍ وَ لَيْلَةٍ وَ الْعَجَبُ كُلُّ الْعَجَبِ لِمَنْ أَنْكَرَ النَّشْأَةَ الْأُخْرَى وَ هُوَ يَرَى النَّشْأَةَ الْأُولَى .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, from Abu Hamza who said, \n‘I heard Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> saying: ‘The case of one who denies death is very odd indeed, while he sees people die every day and night. So also is the case of the one who denies the next life but he observes the present life (and what has grown from the dead)’."}]}, {"index": 4749, "local_index": 29, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:29", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنِ الْحُسَيْنِ بْنِ إِسْحَاقَ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ سَعْدَانَ عَنْ عَجْلَانَ أَبِي صَالِحٍ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا أَبَا صَالِحٍ إِذَا أَنْتَ حَمَلْتَ جَنَازَةً فَكُنْ كَأَنَّكَ أَنْتَ الْمَحْمُولُ وَ كَأَنَّكَ سَأَلْتَ رَبَّكَ الرُّجُوعَ إِلَى الدُّنْيَا فَفَعَلَ فَانْظُرْ مَا ذَا تَسْتَأْنِفُ \nقَالَ ثُمَّ قَالَ عَجَبٌ لِقَوْمٍ حُبِسَ أَوَّلُهُمْ عَنْ آخِرِهِمْ ثُمَّ نُودِيَ فِيهِمُ الرَّحِيلُ وَ هُمْ يَلْعَبُونَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Al Husayn Bin Is’haq, from Ali Bin Mahziyar, from Fazalat Bin Ayoub, from Sa’dan, from Ajlan Abu Salih who said, \n‘Abu Abdullah<sup>asws</sup> said to me: ‘O Abu Salih! Whenever you carry the coffin so become as if you are the carried one, and as if you are asking your Lord<sup>azwj</sup> for the return to the world and it is done. So look around, what is that which you would (like to) resume’. \nHe (the narrator) said, ‘Then he<sup>asws</sup> said: ‘I<sup>asws</sup> wonder at the people whose former ones have been withheld from (returning to) their later ones, then the departure is announced among them and they are playing’."}]}, {"index": 4750, "local_index": 30, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:30", "text": "عَنْهُ عَنْ فَضَالَةَ عَنْ إِسْمَاعِيلَ بْنِ أَبِي زِيَادٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) مَا أَنْزَلَ الْمَوْتَ حَقَّ مَنْزِلَتِهِ مَنْ عَدَّ غَداً مِنْ أَجَلِهِ قَالَ \nوَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) مَا أَطَالَ عَبْدٌ الْأَمَلَ إِلَّا أَسَاءَ الْعَمَلَ \nوَ كَانَ يَقُولُ لَوْ رَأَى الْعَبْدُ أَجَلَهُ وَ سُرْعَتَهُ إِلَيْهِ لَأَبْغَضَ الْعَمَلَ مِنْ طَلَبِ الدُّنْيَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Fazalat, from Ismail Bin Abu Ziyad, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘The death has not descended with its true descent on the one who counts tomorrow as being his term (death)’. \nAnd Amir Al-Momineen<sup>asws</sup>: ‘A servant desiring for the (pleasures of the world) would end up committing bad deeds’. \nAnd he<sup>asws</sup> was saying: ‘If the servant were to see his death at its quick approach towards him, he would hate the deeds of seeking the world’."}]}, {"index": 4751, "local_index": 31, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:31", "text": "مُحَمَّدٌ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْحُسَيْنِ بْنِ عُلْوَانَ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ لَحْظَةِ مَلَكِ الْمَوْتِ قَالَ أَ مَا رَأَيْتَ النَّاسَ يَكُونُونَ جُلُوساً فَتَعْتَرِيهِمُ السَّكْتَةُ فَمَا يَتَكَلَّمُ أَحَدٌ مِنْهُمْ فَتِلْكَ لَحْظَةُ مَلَكِ الْمَوْتِ حَيْثُ يَلْحَظُهُمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Ahmad, from Al Husayn Bin Saeed, from Al Husayn Bin Ulwan, from Amro Bin Shimr, from Jabir, \n(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the instant of the Angel of death. He<sup>asws</sup> said: ‘Have you not seen the people becoming seated, and you see them with cardiac failure, so not one of them is (able upon) speaking? So that is the instant of the Angel of death where he notices them’."}]}, {"index": 4752, "local_index": 32, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:32", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنِ الْمُفَضَّلِ بْنِ صَالِحٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ تَبَارَكَ وَ تَعَالَى وَ قِيلَ مَنْ راقٍ وَ ظَنَّ أَنَّهُ الْفِراقُ قَالَ فَإِنَّ ذَلِكَ ابْنُ آدَمَ إِذَا حَلَّ بِهِ الْمَوْتُ قَالَ هَلْ مِنْ طَبِيبٍ إِنَّهُ الْفِرَاقُ أَيْقَنَ بِمُفَارَقَةِ الْأَحِبَّةِ قَالَ وَ الْتَفَّتِ السَّاقُ بِالسَّاقِ الْتَفَّتِ الدُّنْيَا بِالْآخِرَةِ ثُمَّ إِلى رَبِّكَ يَوْمَئِذٍ الْمَساقُ قَالَ الْمَصِيرُ إِلَى رَبِّ الْعَالَمِينَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Amro Bin Usman, from Al Mufazzal Bin Salih, from Jabir, \n(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Blessed and High <span class=\"ibTxt\">[75:27] And it will be Said: Who cast a spell on you?</span> and it is thought that it is the separation’. He<sup>asws</sup> said: ‘So if it was that, the death comes upon the son of Adam<sup>as</sup>, he says, ‘Is there one who is a healer (physician)?’ <span class=\"ibTxt\">[75:28] And he would think he has separated </span>He would be convinced of separating from the loved ones <span class=\"ibTxt\">[75:29] And affliction turns to an </span>affliction. He<sup>asws</sup> said: ‘The world turns to the Hereafter’.<span class=\"ibTxt\"> [75:30] To your Lord on that day shall be the driving</span>. He<sup>asws</sup> said: ‘To the Lord<sup>azwj</sup> of the worlds is the destination’."}]}, {"index": 4753, "local_index": 33, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:33", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنِ الْحُسَيْنِ بْنِ إِسْحَاقَ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنْ عَلِيِّ بْنِ إِسْمَاعِيلَ الْمِيثَمِيِّ عَنْ عَبْدِ الْأَعْلَى مَوْلَى آلِ سَامٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَوْلُ اللَّهِ عَزَّ وَ جَلَّ إِنَّما نَعُدُّ لَهُمْ عَدًّا قَالَ مَا هُوَ عِنْدَكَ قُلْتُ عَدَدُ الْأَيَّامِ قَالَ إِنَّ الْآبَاءَ وَ الْأُمَّهَاتِ يُحْصُونَ ذَلِكَ لَا وَ لَكِنَّهُ عَدَدُ الْأَنْفَاسِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Al Husayn Bin Is’haq, from Ali Bin Mahziyar, from Ali Bin Ismail Al Maysami, from Abdul A’ala a slave of the family of Saam who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘(What about) the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[19:84] but rather We only Number out to them a number</span>?’ He<sup>asws</sup> said: ‘What is it (meaning) with you?’ I said, ‘The number of the days’. He<sup>asws</sup> said: ‘The fathers and the mother are counting that. No, but it is the number of the breaths’."}]}, {"index": 4754, "local_index": 34, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:34", "text": "عَنْهُ عَنْ فَضَالَةَ عَنْ مُوسَى بْنِ بَكْرٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ الْحَيَاةُ وَ الْمَوْتُ خَلْقَانِ مِنْ خَلْقِ اللَّهِ فَإِذَا جَاءَ الْمَوْتُ فَدَخَلَ فِي الْإِنْسَانِ لَمْ يَدْخُلْ فِي شَيْ‏ءٍ إِلَّا وَ قَدْ خَرَجَتْ مِنْهُ الْحَيَاةُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Fazalat, from Musa Bin Bakr, from Zurara, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The life and the death are two creatures from the creatures of Allah<sup>azwj</sup>, So when the death comes and enters into the human being, it does not enter into anything except that the live exits from it’."}]}, {"index": 4755, "local_index": 35, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:35", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ مُحَمَّدِ بْنِ سُكَيْنٍ قَالَ سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَقُولُ اسْتَأْثَرَ اللَّهُ بِفُلَانٍ فَقَالَ ذَا مَكْرُوهٌ فَقِيلَ فُلَانٌ يَجُودُ بِنَفْسِهِ فَقَالَ لَا بَأْسَ أَ مَا تَرَاهُ يَفْتَحُ فَاهُ عِنْدَ مَوْتِهِ مَرَّتَيْنِ أَوْ ثَلَاثَةً فَذَلِكَ حِينَ يَجُودُ بِهَا لِمَا يَرَى مِنْ ثَوَابِ اللَّهِ عَزَّ وَ جَلَّ وَ قَدْ كَانَ بِهَذَا ضَنِيناً .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from one of his companions, from Muhammad Bin Sukeyn who said, \n‘Abu Abdullah<sup>asws</sup> was asked about the man saying, ‘Allah<sup>azwj</sup> Preferred so and so (over me)’. So he<sup>asws</sup> said: ‘That is abhorred’. It was said, ‘(If he says) ‘So and so has been generous with himself’?’ So he<sup>asws</sup> said: ‘There is no problem. Have you not see him opening his mouth during his death, two or three times? So that is where he is generous with it when he sees from the Rewards of Allah<sup>azwj</sup> Mighty and Majestic, and he used to be niggardly with this’."}]}, {"index": 4756, "local_index": 36, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:36", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ قَوْماً فِيمَا مَضَى قَالُوا لِنَبِيٍّ لَهُمْ ادْعُ لَنَا رَبَّكَ يَرْفَعُ عَنَّا الْمَوْتَ فَدَعَا لَهُمْ فَرَفَعَ اللَّهُ عَنْهُمُ الْمَوْتَ فَكَثُرُوا حَتَّى ضَاقَتْ عَلَيْهِمُ الْمَنَازِلُ وَ كَثُرَ النَّسْلُ وَ يُصْبِحُ الرَّجُلُ يُطْعِمُ أَبَاهُ وَ جَدَّهُ وَ أُمَّهُ وَ جَدَّ جَدِّهِ وَ يُوَضِّيهِمْ وَ يَتَعَاهَدُهُمْ فَشَغَلُوا عَنْ طَلَبِ الْمَعَاشِ فَقَالُوا سَلْ لَنَا رَبَّكَ أَنْ يَرُدَّنَا إِلَى حَالِنَا الَّتِي كُنَّا عَلَيْهَا فَسَأَلَ نَبِيُّهُمْ رَبَّهُ فَرَدَّهُمْ إِلَى حَالِهِمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn AbuUmeyr, from Hisham Bin Salim, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A people from the past said to a Prophet<sup>as</sup> of theirs, ‘Supplicate to your<sup>as</sup> Lord<sup>azwj</sup> for us to Raise the death from us’. So he<sup>as</sup> supplicated for them, and Allah<sup>azwj</sup> Raised the death. So they became numerous to the extent that the houses became contrained upon them; and the people became so numerous that in the morning the man had to feed his father, and his grandfather, and his mother, and grandfather of his grandfather, frequently looking after them. So he was too pre-occupied from seeking the livelihood. So they said, ‘Ask your<sup>as</sup> Lord<sup>azwj</sup> for us that He<sup>azwj</sup> should Return us to our state which we were upon’. So their Prophet<sup>as</sup> asked his<sup>as</sup> Lord<sup>azwj</sup>, and He<sup>azwj</sup> Returned them to their (former) state’."}]}, {"index": 4757, "local_index": 37, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:37", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ رَبِيعِ بْنِ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ سُلَيْمٍ الْعَامِرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ عِيسَى ابْنَ مَرْيَمَ جَاءَ إِلَى قَبْرِ يَحْيَى بْنِ زَكَرِيَّا ( عليهم السلام ) وَ كَانَ سَأَلَ رَبَّهُ أَنْ يُحْيِيَهُ لَهُ فَدَعَاهُ فَأَجَابَهُ وَ خَرَجَ إِلَيْهِ مِنَ الْقَبْرِ فَقَالَ لَهُ مَا تُرِيدُ مِنِّي فَقَالَ لَهُ أُرِيدُ أَنْ تُؤْنِسَنِي كَمَا كُنْتَ فِي الدُّنْيَا فَقَالَ لَهُ يَا عِيسَى مَا سَكَنَتْ عَنِّي حَرَارَةُ الْمَوْتِ وَ أَنْتَ تُرِيدُ أَنْ تُعِيدَنِي إِلَى الدُّنْيَا وَ تَعُودَ عَلَيَّ حَرَارَةُ الْمَوْتِ فَتَرَكَهُ فَعَادَ إِلَى قَبْرِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from one of our companions, from Ali Bin Al Hakam, from Rabie Bin Muhammad, from Abdullah Bin Suleym Al Aamiry, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Isa Bin Maryam<sup>as</sup> came to the grave of Yahya Bin Zakariyya<sup>as</sup>, and he<sup>as</sup> had asked his<sup>as</sup> Lord<sup>azwj</sup> to Revive him<sup>as</sup> for him<sup>as</sup>. So he<sup>as</sup> called out to him<sup>as</sup>, and he<sup>as</sup> answered him<sup>as</sup> and came out to him<sup>as</sup> from the grave, and said to him<sup>as</sup>, ‘What do you<sup>as</sup> want from me<sup>as</sup>?’ So he<sup>as</sup> said to him<sup>as</sup>: ‘I<sup>as</sup> want you<sup>as</sup> to comfort me<sup>as</sup> just as you<sup>as</sup> used to in the world’. So he<sup>as</sup> said: ‘O Isa<sup>as</sup>!’ The heat of death has yet to settle from me<sup>as</sup> and you<sup>as</sup> want to return me<sup>as</sup> to the world, and the heat of death to return upon me<sup>as</sup>(again)?’ So he<sup>as</sup> left him<sup>as</sup>, so he<sup>as</sup> returned to his<sup>as</sup> grave’."}]}, {"index": 4758, "local_index": 38, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:38", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ يَزِيدَ الْكُنَاسِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ فِتْيَةً مِنْ أَوْلَادِ مُلُوكِ بَنِي إِسْرَائِيلَ كَانُوا مُتَعَبِّدِينَ وَ كَانَتِ الْعِبَادَةُ فِي أَوْلَادِ مُلُوكِ بَنِي إِسْرَائِيلَ وَ إِنَّهُمْ خَرَجُوا يَسِيرُونَ فِي الْبِلَادِ لِيَعْتَبِرُوا فَمَرُّوا بِقَبْرٍ عَلَى ظَهْرِ الطَّرِيقِ قَدْ سَفَى عَلَيْهِ السَّافِي لَيْسَ يُبَيَّنُ مِنْهُ إِلَّا رَسْمُهُ \nفَقَالُوا لَوْ دَعَوْنَا اللَّهَ السَّاعَةَ فَيَنْشُرُ لَنَا صَاحِبَ هَذَا الْقَبْرِ فَسَاءَلْنَاهُ كَيْفَ وَجَدَ طَعْمَ الْمَوْتِ فَدَعَوُا اللَّهَ وَ كَانَ دُعَاؤُهُمُ الَّذِي دَعَوُا اللَّهَ بِهِ أَنْتَ إِلَهُنَا يَا رَبَّنَا لَيْسَ لَنَا إِلَهٌ غَيْرُكَ وَ الْبَدِيعُ الدَّائِمُ غَيْرُ الْغَافِلِ وَ الْحَيُّ الَّذِي لَا يَمُوتُ لَكَ فِي كُلِّ يَوْمٍ شَأْنٌ تَعْلَمُ كُلَّ شَيْ‏ءٍ بِغَيْرِ تَعْلِيمٍ انْشُرْ لَنَا هَذَا الْمَيِّتَ بِقُدْرَتِكَ \nقَالَ فَخَرَجَ مِنْ ذَلِكَ الْقَبْرِ رَجُلٌ أَبْيَضُ الرَّأْسِ وَ اللِّحْيَةِ يَنْفُضُ رَأْسَهُ مِنَ التُّرَابِ فَزِعاً شَاخِصاً بَصَرَهُ إِلَى السَّمَاءِ فَقَالَ لَهُمْ مَا يُوقِفُكُمْ عَلَى قَبْرِي فَقَالُوا دَعَوْنَاكَ لِنَسْأَلَكَ كَيْفَ وَجَدْتَ طَعْمَ الْمَوْتِ فَقَالَ لَهُمْ لَقَدْ سَكَنْتُ فِي قَبْرِي تِسْعَةً وَ تِسْعِينَ سَنَةً مَا ذَهَبَ عَنِّي أَلَمُ الْمَوْتِ وَ كَرْبُهُ وَ لَا خَرَجَ مَرَارَةُ طَعْمِ الْمَوْتِ مِنْ حَلْقِي \nفَقَالُوا لَهُ مِتَّ يَوْمَ مِتَّ وَ أَنْتَ عَلَى مَا نَرَى أَبْيَضُ الرَّأْسِ وَ اللِّحْيَةِ قَالَ لَا وَ لَكِنْ لَمَّا سَمِعْتُ الصَّيْحَةَ اخْرُجْ اجْتَمَعَتْ تُرْبَةُ عِظَامِي إِلَى رُوحِي فَبَقِيَتْ فِيهِ فَخَرَجْتُ فَزِعاً شَاخِصاً بَصَرِي مُهْطِعاً إِلَى صَوْتِ الدَّاعِي فَابْيَضَّ لِذَلِكَ رَأْسِي وَ لِحْيَتِي .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Abu Ayoub, from Yazeed Al Kunasy, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Youths from the children of the kings from the Children of Israel were (devout) worshippers, and the worshipping used to be prevalent among the children of the kings from the Children of Israel; and they went out travelling in the country in order to learn. So they passed by a grave upon the back of the road nothing being apparent from it except for its markings.\nSo they said, ‘If only we would supplicate to Allah<sup>saww</sup> now to Resurrect for us the inhabitant of this grave, so we can ask him how he found the food of death’. So they supplicated to Allah<sup>azwj</sup>, and their supplication which they supplicated to Allah<sup>azwj</sup> with, was,’Our God! O our Lord<sup>azwj</sup>! There is no god for us apart from You<sup>azwj</sup>, the Permanent, the Eternal, not Oblivious, and the Living Who does not die. For You<sup>azwj</sup>, during every day, is Glory. You<sup>azwj</sup> Know every thing without being taught. Resurrect this deceased for us by Your<sup>azwj</sup> Power’. \nHe<sup>asws</sup> said: ‘So a man came out from that grave, being of white hair on his head and beard, shaking his head from the soil, shuddering, gazing towards the sky, and he said to them, ‘Why are you pausing at my grave?’ So they said, ‘We called you over in order to ask you how you found the food of death’. So he said to them, ‘I had settled in my grave for ninety nine years, but neither the pain of death went away from me, nor its stress, nor has the bitterness of death come out from my throat’. \nSo they said to him, ‘You died on the day you died and you were upon what we see as being of white hair and beard?’ He said, ‘No, but when I heard the shriek: ‘Come out!’ the dust of my bones gathered together to my soul and remained in it. So I came out in a panic, shuddering, gazing with my eyes, obedient to the voice of my caller, so due to that my hair and my beard whitened’."}]}, {"index": 4759, "local_index": 39, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:39", "text": "عَلِيٌّ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ النَّبِيُّ ( صلى الله عليه وآله ) مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يَفْشُوَ الْفَالِجُ وَ مَوْتُ الْفَجْأَةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali, from his father, from Al Nowfaly, from Al Sakuny, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Prophet<sup>saww</sup> said: ‘From the conditions of the Hour is the spread of paralysis and the sudden death’."}]}, {"index": 4760, "local_index": 40, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:40", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ رَفَعَهُ قَالَ جَاءَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِلَى الْأَشْعَثِ بْنِ قَيْسٍ يُعَزِّيهِ بِأَخٍ لَهُ يُقَالُ لَهُ عَبْدُ الرَّحْمَنِ فَقَالَ لَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِنْ جَزِعْتَ فَحَقَّ الرَّحِمِ أَتَيْتَ وَ إِنْ صَبَرْتَ فَحَقَّ اللَّهِ أَدَّيْتَ عَلَى أَنَّكَ إِنْ صَبَرْتَ جَرَى عَلَيْكَ الْقَضَاءُ وَ أَنْتَ مَحْمُودٌ وَ إِنْ جَزِعْتَ جَرَى عَلَيْكَ الْقَضَاءُ وَ أَنْتَ مَذْمُومٌ \nفَقَالَ لَهُ الْأَشْعَثُ إِنَّا لِلَّهِ وَ إِنَّا إِلَيْهِ رَاجِعُونَ فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَ تَدْرِي مَا تَأْوِيلُهَا فَقَالَ الْأَشْعَثُ لَا أَنْتَ غَايَةُ الْعِلْمِ وَ مُنْتَهَاهُ فَقَالَ لَهُ أَمَّا قَوْلُكَ إِنَّا لِلَّهِ فَإِقْرَارٌ مِنْكَ بِالْمُلْكِ وَ أَمَّا قَوْلُكَ وَ إِنَّا إِلَيْهِ رَاجِعُونَ فَإِقْرَارٌ مِنْكَ بِالْهَلَاكِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Salih Bin Abu Hammad, raising it, said, \n‘Amir Al-Momineen came over to Al-Ash’as Bin Qays consoling him for (the demise of) a brother of his called Abdul Rahman. So Amir Al-Momineen<sup>asws</sup> said to him: ‘If you were to panic, you would have given the right of the womb (relationship), and if you were to be patient, so you would have paid the Right of Allah<sup>azwj</sup>. On top of that, if you were to be patient, the Ordained matter would flow upon you and you would be a praised one, and if you were to panic, the Ordained matter would flow upon you (anyway) and you would be a condemned one’. \nSo Al-Ash’as said to him<sup>asws</sup>, ‘<span class=\"ibTxt\">[2:156] Surely we are for Allah and to Him we are returning</span>;. So Amir Al-Momineen<sup>asws</sup> said: ‘Do you know what its interpretation is?’ So Al-Ash’as said, ‘No. You<sup>asws</sup> are the peak of knowledge and its limit’. So he<sup>asws</sup> said to him: ‘<span class=\"ibTxt\">We are for Allah</span> – so it is the acknowledgement from you of the King. And as for your words <span class=\"ibTxt\">and to Him we are returning</span> – so it is the acknowledgement from you of the death’."}]}, {"index": 4761, "local_index": 41, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:41", "text": "مُحَمَّدُ بْنُ يَحْيَى يَرْفَعُهُ عَنْ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ دَعَا نَبِيٌّ مِنَ الْأَنْبِيَاءِ عَلَى قَوْمِهِ فَقِيلَ لَهُ أُسَلِّطُ عَلَيْهِمْ عَدُوَّهُمْ فَقَالَ لَا فَقِيلَ لَهُ فَالْجُوعَ فَقَالَ لَا فَقِيلَ لَهُ مَا تُرِيدُ فَقَالَ مَوْتٌ دَفِيقٌ يَحْزُنُ الْقَلْبَ وَ يُقِلُّ الْعَدَدَ فَأُرْسِلَ إِلَيْهِمُ الطَّاعُونُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, \n(It has been narrated) raising it from Amir Al-Momineen<sup>asws</sup> having said: ‘A Prophet<sup>as</sup> from the Prophets<sup>as</sup> supplicated against his<sup>as</sup> people. So it was said to him<sup>as</sup>, ‘Get their enemies to overcome upon them’. But he<sup>as</sup> said: No’. So it was said to him<sup>as</sup>, ‘Then, the hunger’. But he<sup>as</sup> said: ‘No’. So it was said to him<sup>as</sup>, ‘What do you<sup>as</sup> want?’ So he<sup>as</sup> said: ‘A hidden death which would grieve the heart, and it would reduce the numbers’. So the plague was Sent to them’."}]}, {"index": 4762, "local_index": 42, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:42", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ رَفَعَهُ قَالَ كَانَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ عِنْدَ الْمُصِيبَةِ الْحَمْدُ لِلَّهِ الَّذِي لَمْ يَجْعَلْ مُصِيبَتِي فِي دِينِي وَ الْحَمْدُ لِلَّهِ الَّذِي لَوْ شَاءَ أَنْ يَجْعَلَ مُصِيبَتِي أَعْظَمَ مِمَّا كَانَتْ وَ الْحَمْدُ لِلَّهِ عَلَى الْأَمْرِ الَّذِي شَاءَ أَنْ يَكُونَ فَكَانَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Asbaat, raising it, said, \n‘Abu Abdullah<sup>asws</sup> was saying during the difficulty (bereavement): ‘The Praise is for Allah<sup>azwj</sup> Who did not Make my<sup>asws</sup> difficulty to be in my<sup>asws</sup> Religion. And the Praise is for Allah<sup>azwj</sup> Who, had He<sup>azwj</sup> so Desired to, would have Made my<sup>asws</sup> difficulty to be greater than what it was. And the Praise is for Allah<sup>azwj</sup> upon the matter which had He<sup>azwj</sup> so Desired, would have happened’."}]}, {"index": 4763, "local_index": 43, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:43", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنِ الْقَاسِمِ بْنِ سُلَيْمَانَ عَنْ عَبْدِ الْحَمِيدِ بْنِ أَبِي جَعْفَرٍ الْفَرَّاءِ قَالَ إِنَّ أَبَا جَعْفَرٍ ( عليه السلام ) انْقَلَعَ ضِرْسٌ مِنْ أَضْرَاسِهِ فَوَضَعَهُ فِي كَفِّهِ ثُمَّ قَالَ الْحَمْدُ لِلَّهِ ثُمَّ قَالَ يَا جَعْفَرُ إِذَا أَنَا مِتُّ وَ دَفَنْتَنِي فَادْفِنْهُ مَعِي ثُمَّ مَكَثَ بَعْدَ حِينٍ ثُمَّ انْقَلَعَ أَيْضاً آخَرُ فَوَضَعَهُ عَلَى كَفِّهِ ثُمَّ قَالَ الْحَمْدُ لِلَّهِ يَا جَعْفَرُ إِذَا مِتُّ فَادْفِنْهُ مَعِي .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Al Nazar Bin Suweyd, from Al Qasim Bin Suleyman, from Abdul Hameed Bin Abu Ja’far Al Farra’a who said, \n‘Abu Ja’far<sup>asws</sup>, a tooth from his<sup>asws</sup> teeth came out. So he<sup>asws</sup> placed it in his<sup>asws</sup> palm, then said: ‘The Praise is for Allah<sup>azwj</sup>’. Then he<sup>asws</sup> said: ‘O Ja’far<sup>asws</sup>! When I<sup>asws</sup> pass away and you<sup>asws</sup> bury me<sup>asws</sup>, so bury it with me<sup>asws</sup>’. Then it remained so for a while. Then another one came off as well. So he<sup>asws</sup> placed it upon him<sup>asws</sup> palm, then said: ‘The Praise is for Allah<sup>azwj</sup>. O Ja’far<sup>asws</sup>! When I<sup>asws</sup> pass away, so bury it with me<sup>asws</sup>’."}]}, {"index": 4764, "local_index": 44, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:44", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَكْرِ بْنِ مُحَمَّدٍ الْأَزْدِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْمَوْتَ الَّذِي تَفِرُّونَ مِنْهُ فَإِنَّهُ مُلاقِيكُمْ إِلَى قَوْلِهِ تَعْمَلُونَ قَالَ تَعُدُّ السِّنِينَ ثُمَّ تَعُدُّ الشُّهُورَ ثُمَّ تَعُدُّ الْأَيَّامَ ثُمَّ تَعُدُّ السَّاعَاتِ ثُمَّ تَعُدُّ النَّفَسَ فَإِذا جاءَ أَجَلُهُمْ لا يَسْتَأْخِرُونَ ساعَةً وَ لا يَسْتَقْدِمُونَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Bakr Bin Muhammad Al Azdy, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘<span class=\"ibTxt\">[62:8] Say: (As for) the death from which you are fleeing from, so it will surely meet you</span> up to His<sup>azwj</sup> Words<span class=\"ibTxt\"> (then you shall be sent back to the Knower of the hidden and the apparent, and He will inform you of that which) you had done</span>. The years are numbered, then the months are numbered, then the days are numbered, then the hours are numbered, then the breaths are numbered. So when their death comes, they would neither be delayed for a moment nor would they be quickened’."}]}, {"index": 4765, "local_index": 45, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:45", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنِ ابْنِ الْقَدَّاحِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعَ النَّبِيُّ ( صلى الله عليه وآله ) امْرَأَةً حِينَ مَاتَ عُثْمَانُ بْنُ مَظْعُونٍ وَ هِيَ تَقُولُ هَنِيئاً لَكَ يَا أَبَا السَّائِبِ الْجَنَّةُ فَقَالَ النَّبِيُّ ( صلى الله عليه وآله ) وَ مَا عِلْمُكِ حَسْبُكِ أَنْ تَقُولِي كَانَ يُحِبُّ اللَّهَ عَزَّ وَ جَلَّ وَ رَسُولَهُ \nفَلَمَّا مَاتَ إِبْرَاهِيمُ ابْنُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) هَمَلَتْ عَيْنُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) بِالدُّمُوعِ ثُمَّ قَالَ النَّبِيُّ ( صلى الله عليه وآله ) تَدْمَعُ الْعَيْنُ وَ يَحْزَنُ الْقَلْبُ وَ لَا نَقُولُ مَا يُسْخِطُ الرَّبَّ وَ إِنَّا بِكَ يَا إِبْرَاهِيمُ لَمَحْزُونُونَ \nثُمَّ رَأَى النَّبِيُّ ( صلى الله عليه وآله ) فِي قَبْرِهِ خَلَلًا فَسَوَّاهُ بِيَدِهِ ثُمَّ قَالَ إِذَا عَمِلَ أَحَدُكُمْ عَمَلًا فَلْيُتْقِنْ ثُمَّ قَالَ الْحَقْ بِسَلَفِكَ الصَّالِحِ عُثْمَانَ بْنِ مَظْعُونٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ja’far Bin Muhammad, from Ibn Qaddah, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Prophet<sup>as</sup> heard a woman, when Usman Bin Mazoun died, and she was saying, ‘Congratulations to you, O Abu Al-Saib, of the Paradise!’ So the Prophet<sup>saww</sup> said: ‘And what is your knowledge? It would suffice you to that you should be saying, ‘He used to love Allah<sup>azwj</sup> Mighty and Majestic and His<sup>azwj</sup> Rasool<sup>saww</sup>’. \nSo when Ibrahim<sup>as</sup>, son<sup>as</sup> of Rasool-Allah<sup>saww</sup> passed away, the eyes of Rasool-Allah<sup>saww</sup> filled with tears. Then the Prophet<sup>saww</sup> said: ‘The eyes are tearful and the heart is grieving and we<sup>saww</sup> are not saying what would Anger the Lord<sup>azwj</sup>, and I<sup>saww</sup> am with you<sup>as</sup>, O Ibrahim<sup>as</sup>, grieving’. \nThen the Prophet<sup>saww</sup> saw a flaw in his<sup>as</sup> grave, so he<sup>saww</sup> evened it with his<sup>saww</sup> hand, then said: ‘When one of you does something, so let him be proficient in it’. Then he<sup>saww</sup> said: ‘Join with your<sup>as</sup> righteous ancestor Usman Bin Mazoun’."}]}, {"index": 4766, "local_index": 46, "part_type": "Hadith", "path": "/books/al-kafi:3:3:95:46", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ قَالَ كَتَبَ إِلَى أَبِي جَعْفَرٍ ( عليه السلام ) رَجُلٌ يَشْكُو إِلَيْهِ مُصَابَهُ بِوَلَدٍ لَهُ وَ شِدَّةَ مَا يَدْخُلُهُ فَقَالَ وَ كَتَبَ ( عليه السلام ) إِلَيْهِ أَ مَا عَلِمْتَ أَنَّ اللَّهَ عَزَّ وَ جَلَّ يَخْتَارُ مِنْ مَالِ الْمُؤْمِنِ وَ مِنْ وُلْدِهِ أَنْفَسَهُ لِيَأْجُرَهُ عَلَى ذَلِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Mahziyar who said, \n‘A man wrote to Abu Ja’far<sup>asws</sup> complaining to him<sup>asws</sup> of his difficulty (bereavement) with a child of his, and the intensity of what had entered into him. So he<sup>asws</sup> wrote to him: ‘Do you not know that Allah<sup>azwj</sup> Mighty and Majestic Chooses from the wealth of the Believer and from his children, his most beloved, in order to Recompense him upon that’."}]}, {"part_type": "Heading", "text": "هَذَا آخِرُ كِتَابِ الْجَنَائِزِ مِنْ كِتَابِ الْكَافِي لِأَبِي جَعْفَرٍ مُحَمَّدِ بْنِ يَعْقُوبَ الْكُلَيْنِيِّ رَحِمَهُ اللَّهُ وَ الْحَمْدُ لِلَّهِ وَحْدَهُ وَ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ آلِهِ أَجْمَعِينَ وَ يَتْلُوهُ كِتَابُ الصَّلَاةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "This is the end of the Book of Funerals from the book Al Kafi of Abu Ja’far Muhammad Bin Yaqoub Al Kulayni, may Allah<sup>azwj</sup> have Mercy upon him, and the Prais is for Allah<sup>azwj</sup> Alone, and Blessings be upon Muhammad<sup>saww</sup> and the enteirety of his<sup>saww</sup> Progeny<sup>asws</sup>, and it would be followed by the Book of <span class=\"iTxt\">Salaat</span>."}]}]}, "index": "al-kafi:3:3:95", "kind": "verse_list"}