{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:3:1",
        "titles": {
          "ar": "كِتَابُ الطَّهَارَةِ",
          "en": "THE BOOK OF CLEANLINESS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 24"
        },
        "path": "/books/al-kafi:3:1:24",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الرَّجُلِ يَطَأُ</span> عَلَى الْعَذِرَةِ أَوْ غَيْرِهَا مِنَ الْقَذَرِ",
          "en": "Chapter 24 – The man treads upon the faeces or other than it, from the filth"
        }
      }
    ],
    "index": 525,
    "local_index": 24,
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:1:24",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الرَّجُلِ يَطَأُ</span> عَلَى الْعَذِرَةِ أَوْ غَيْرِهَا مِنَ الْقَذَرِ",
      "en": "Chapter 24 – The man treads upon the faeces or other than it, from the filth"
    },
    "verse_count": 5,
    "verse_start_index": 3967,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/121)"
        ],
        "index": 3968,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:24:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنِ الْأَحْوَلِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي الرَّجُلِ يَطَأُ عَلَى الْمَوْضِعِ الَّذِي لَيْسَ بِنَظِيفٍ ثُمَّ يَطَأُ بَعْدَهُ مَكَاناً نَظِيفاً قَالَ لَا بَأْسَ إِذَا كَانَ خَمْسَةَ عَشَرَ ذِرَاعاً أَوْ نَحْوَ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Jameel Bin Salih, from Al Ahowl, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said regarding the man who trod upon the place which was not with cleanliness, then he trod after it in a clean place, he<sup>asws</sup> said: ‘There is no problem when it was fifteen cubits away or approximate to that (i.e. sufficient walking would purify it)’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn abu ‘Umayr from Jamil ibn Salih from al-Ahwal who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If one steps on a spot which is unclean, then steps on a clean spot, it is not harmful after walking a distance of fifteen yards or so.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/121)"
        ],
        "index": 3969,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:24:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ كُنْتُ مَعَ أَبِي جَعْفَرٍ ( عليه السلام ) إِذْ مَرَّ عَلَى عَذِرَةٍ يَابِسَةٍ فَوَطِئَ عَلَيْهَا فَأَصَابَتْ ثَوْبَهُ فَقُلْتُ جُعِلْتُ فِدَاكَ قَدْ وَطِئْتَ عَلَى عَذِرَةٍ فَأَصَابَتْ ثَوْبَكَ فَقَالَ أَ لَيْسَ هِيَ يَابِسَةً فَقُلْتُ بَلَى فَقَالَ لَا بَأْسَ إِنَّ الْأَرْضَ تُطَهِّرُ بَعْضُهَا بَعْضاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad, from Hareyz, from Muhammad Bin Muslim who said, ",
            "‘I was with Abu Ja’far<sup>asws</sup> when he<sup>asws</sup> passed upon a dry excrement, so he<sup>asws</sup> trod upon it, and it hit his<sup>asws</sup> cloth. So I said, ‘May I be sacrificed for you<sup>asws</sup>! You have trod upon a filth and it hit your<sup>asws</sup> clothes’. So he<sup>asws</sup> said: ‘Was it not dry?’ So I said, ‘Yes’. So he<sup>asws</sup> said: ‘There is no problem. Part of the ground (soil) cleans part of it’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father, from Hammad, from Hariz from Muhammad ibn Muslim who has said the following: “Once I was in the company of abu Ja‘far, ‘Alayhi al-Salam, and on passing (stepping on) some dried up human feces, certain pieces came in contact with his clothes. I informed him about it and he (the Imam) asked, ‘Was it not dried up?’ I said, ‘Yes, it was dried up.’ He (the Imam) said, ‘It (touching) then is not harmful. Certain parts of earth cleanse other parts.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالموثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/122)"
        ],
        "index": 3970,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:24:3",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ مُحَمَّدٍ الْحَلَبِيِّ قَالَ نَزَلْنَا فِي مَكَانٍ بَيْنَنَا وَ بَيْنَ الْمَسْجِدِ زُقَاقٌ قَذَرٌ فَدَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ أَيْنَ نَزَلْتُمْ فَقُلْتُ نَزَلْنَا فِي دَارِ فُلَانٍ فَقَالَ إِنَّ بَيْنَكُمْ وَ بَيْنَ الْمَسْجِدِ زُقَاقاً قَذَراً أَوْ قُلْنَا لَهُ إِنَّ بَيْنَنَا وَ بَيْنَ الْمَسْجِدِ زُقَاقاً قَذَراً فَقَالَ لَا بَأْسَ الْأَرْضُ تُطَهِّرُ بَعْضُهَا بَعْضاً قُلْتُ وَ السِّرْقِينُ الرَّطْبُ أَطَأُ عَلَيْهِ فَقَالَ لَا يَضُرُّكَ مِثْلُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Safwan, from Is’haq Bin Ammar, from Muhammad Al Halby who said, ",
            "‘We lodged in a place and between us and the Masjid was a dirty alleyway. So I went over to Abu Abdullah<sup>asws</sup>, and he<sup>asws</sup> said: ‘Where are you encamped?’ So I said, ‘We are lodged in the house of so and so’. So he<sup>asws</sup> said: ‘Between you and the Masjid there is a dirty alleyway’, or we said to him<sup>asws</sup>, ‘Between us and the Masjid is a dirty alleyway’. So he<sup>asws</sup> said: ‘There is no problem. The earth (soil), parts of it purify the (other) parts’. I said, ‘And (what about) the wet manure I tread upon?’ So he<sup>asws</sup> said: ‘The likes of that does not harm you’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan from Ishaq ibn ‘Ammar from Muhammad al-Halabiy who has said the following: “Once we found lodging in a place. Between this place and the Masjid there were dirty passageways. I visited abu ‘Abd Allah, ‘Alayhi al-Salam. He (the Imam) asked, ‘Where have you found lodging?’ I replied, ‘It is the house of so and so.’ He (the Imam) or we said, ‘Between that house and Masjid there are unclean passageways.’ He (the Imam) said, ‘It is not harmful, certain parts of earth cleanse other parts.’ I (the narrator) asked, ‘What happens if I step on wet dung?’ He (the Imam) said, ‘Such things are not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور وآخره مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/123)"
        ],
        "index": 3971,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:24:4",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الرَّجُلِ يَطَأُ فِي الْعَذِرَةِ أَوِ الْبَوْلِ أَ يُعِيدُ الْوُضُوءَ قَالَ لَا وَ لَكِنْ يَغْسِلُ مَا أَصَابَهُ .",
          "وَ فِي رِوَايَةٍ أُخْرَى إِذَا كَانَ جَافّاً فَلَا يَغْسِلُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Muhammad Bin Sinan, from Ibn Muskan, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the man who treads upon the excrement, or the urine, should he be repeating the Ablution <span class=\"iTxt\">(Wudhu)</span>?’ He<sup>asws</sup> said: ‘No, but he should wash whatever it hit’.",
            "And in another report, ‘(He<sup>asws</sup> said): ‘When it was dehydrated, so he may not wash it’."
          ],
          "en.sarwar": [
            "4. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Muhammad ibn Sinan from ibn Muskan from al-Halabiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of one who steps on feces or urine whether he must take Wudu’ again?’ He (the Imam) replied, ‘No, but one must wash the polluted area clean.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/123)"
        ],
        "index": 3972,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:24:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنِ الْمُعَلَّى بْنِ خُنَيْسٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْخِنْزِيرِ يَخْرُجُ مِنَ الْمَاءِ فَيَمُرُّ عَلَى الطَّرِيقِ فَيَسِيلُ مِنْهُ الْمَاءُ أَمُرُّ عَلَيْهِ حَافِياً فَقَالَ أَ لَيْسَ وَرَاءَهُ شَيْ‏ءٌ جَافٌّ قُلْتُ بَلَى قَالَ فَلَا بَأْسَ إِنَّ الْأَرْضَ تُطَهِّرُ بَعْضُهَا بَعْضاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel Bin Darraj, from Al Moalla Bin Khunay who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the pig coming out from the water, so it passes upon the road, and the water flows from it, ‘Can I pass upon it bare-footed?’ So he<sup>asws</sup> said: ‘Is there not something dry around it?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘So there is no problem. The earth (soil), parts of it purify the (other) parts’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Jamil ibn Darraj from al-Mu‘alla’ ibn Khunays who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the swine which comes out of water and passes on the road while water falls from it. What happens if I walk bare foot over such areas? He (the Imam) asked. ‘Are not there certain dry spots behind it?’ I replied, ‘Yes, there are such spots.’ He (the Imam) said, ‘It is not harmful. Certain parts of earth cleanse other parts.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:1:24",
  "kind": "verse_list"
}