{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:3:1", "titles": {"ar": "كِتَابُ الطَّهَارَةِ", "en": "THE BOOK OF CLEANLINESS"}}, {"indexed_titles": {"en": "Chapter 25"}, "path": "/books/al-kafi:3:1:25", "titles": {"ar": "باب الْمَذْيِ وَ الْوَدْيِ", "en": "Chapter 25 – The seminal fluid and the semen"}}], "index": 526, "local_index": 25, "part_type": "Chapter", "path": "/books/al-kafi:3:1:25", "titles": {"ar": "باب الْمَذْيِ وَ الْوَدْيِ", "en": "Chapter 25 – The seminal fluid and the semen"}, "verse_count": 4, "verse_start_index": 3972, "verses": [{"index": 3973, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:1:25:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنْ سَالَ مِنْ ذَكَرِكَ شَيْ‏ءٌ مِنْ مَذْيٍ أَوْ وَدْيٍ وَ أَنْتَ فِي الصَّلَاةِ فَلَا تَغْسِلْهُ وَ لَا تَقْطَعِ الصَّلَاةَ وَ لَا تَنْقُضْ لَهُ الْوُضُوءَ وَ إِنْ بَلَغَ عَقِيبَكَ فَإِنَّمَا ذَلِكَ بِمَنْزِلَةِ النُّخَامَةِ وَ كُلُّ شَيْ‏ءٍ يَخْرُجُ مِنْكَ بَعْدَ الْوُضُوءِ فَإِنَّهُ مِنَ الْحَبَائِلِ أَوْ مِنَ الْبَوَاسِيرِ وَ لَيْسَ بِشَيْ‏ءٍ فَلَا تَغْسِلْهُ مِنْ ثَوْبِكَ إِلَّا أَنْ تُقْذِرَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Hammad, from Hareyz, from Zurara, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘If something were to flow from your manhood, either from seminal fluid prostatic fluid, and you are in the <span class=\"iTxt\">Salaat</span>, so do not wash it, and do not cut off your <span class=\"iTxt\">Salaat</span>, nor would the Ablution <span class=\"iTxt\">(Wudhu)</span> break for it, and even if it reaches your behind. So rather, that is with a status of the phlegm; and everything, which comes out from you after the Ablution <span class=\"iTxt\">(Wudhu)</span>, so it is from the sexual veins, or from the haemorrhoids, and it is not with anything. Therefore, do not wash it from your clothes except if it dirties it’."}]}, {"index": 3974, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:1:25:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ عُمَرَ بْنِ حَنْظَلَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْمَذْيِ فَقَالَ مَا هُوَ وَ النُّخَامَةُ إِلَّا سَوَاءٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr, from Umar Bin Hanzala who said, \n‘I asked Abu Abdullah<sup>asws</sup> about the seminal fluid, so he<sup>asws</sup> said: ‘It and the phlegm is nothing but equal’."}]}, {"index": 3975, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:1:25:3", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ بُرَيْدِ بْنِ مُعَاوِيَةَ قَالَ سَأَلْتُ أَحَدَهُمَا ( عليهما السلام ) عَنِ الْمَذْيِ فَقَالَ لَا يَنْقُضُ الْوُضُوءَ وَ لَا يُغْسَلُ مِنْهُ ثَوْبٌ وَ لَا جَسَدٌ إِنَّمَا هُوَ بِمَنْزِلَةِ الْمُخَاطِ وَ الْبُزَاقِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Bureyd Bin Muawiya who said, \n‘I asked one of the two (5<sup>th</sup> or the 6<sup>th</sup> Imam<sup>asws</sup>) about the seminal fluid, so he<sup>asws</sup> said: ‘It does not break the Ablution <span class=\"iTxt\">(Wudhu)</span>, and one neither has to wash the clothes from it nor the body. But rather, it is at the status of the mucus and the saliva’."}]}, {"index": 3976, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:3:1:25:4", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الْمَذْيِ يَسِيلُ حَتَّى يُصِيبَ الْفَخِذَ فَقَالَ لَا يَقْطَعُ صَلَاتَهُ وَ لَا يَغْسِلُهُ مِنْ فَخِذِهِ إِنَّهُ لَمْ يَخْرُجْ مِنْ مَخْرَجِ الْمَنِيِّ إِنَّمَا هُوَ بِمَنْزِلَةِ النُّخَامَةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Hammad, from Hareyz, from Muhammad Bin Muslim who said, \n‘I asked Abu Ja’far<sup>asws</sup> about the seminal fluid flowing until it hits the thigh. So he<sup>asws</sup> said: ‘One would neither cut off the <span class=\"iTxt\">Salaat</span> nor wash it from his thigh. It has not come out from the exit of the semen. It is at the status of the mucus’."}]}]}, "index": "al-kafi:3:1:25", "kind": "verse_list"}