{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:3:1",
        "titles": {
          "ar": "كِتَابُ الطَّهَارَةِ",
          "en": "THE BOOK OF CLEANLINESS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 4"
        },
        "path": "/books/al-kafi:3:1:4",
        "titles": {
          "ar": "باب الْبِئْرِ وَ مَا يَقَعُ فِيهَا",
          "en": "Chapter 4 – The water well and what falls into it"
        }
      }
    ],
    "index": 505,
    "local_index": 4,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 5"
        },
        "path": "/books/al-kafi:3:1:5",
        "titles": {
          "ar": "باب الْبِئْرِ تَكُونُ إِلَى جَنْبِ الْبَالُوعَةِ",
          "en": "Chapter 5 – The well which happens to be to the side of the cesspool"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:3:1:3",
        "titles": {
          "ar": "باب الْمَاءِ الَّذِي تَكُونُ فِيهِ قِلَّةٌ وَ الْمَاءِ الَّذِي فِيهِ الْجِيَفُ وَ الرَّجُلُ يَأْتِي الْمَاءَ وَ يَدُهُ قَذِرَةٌ",
          "en": "Chapter 3 – The water which happens to be little, and the water wherein is the carcass, and the man goes to the water and his hands are dirty"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:3:1",
        "titles": {
          "ar": "كِتَابُ الطَّهَارَةِ",
          "en": "THE BOOK OF CLEANLINESS"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:1:4",
    "titles": {
      "ar": "باب الْبِئْرِ وَ مَا يَقَعُ فِيهَا",
      "en": "Chapter 4 – The water well and what falls into it"
    },
    "verse_count": 12,
    "verse_start_index": 3806,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/22)"
        ],
        "index": 3807,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:4:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ قَالَ كَتَبْتُ إِلَى رَجُلٍ أَسْأَلُهُ أَنْ يَسْأَلَ أَبَا الْحَسَنِ الرِّضَا ( عليه السلام ) عَنِ الْبِئْرِ تَكُونُ فِي الْمَنْزِلِ لِلْوُضُوءِ فَتَقْطُرُ فِيهَا قَطَرَاتٌ مِنْ بَوْلٍ أَوْ دَمٍ أَوْ يَسْقُطُ فِيهَا شَيْ‏ءٌ مِنْ عَذِرَةٍ كَالْبَعْرَةِ وَ نَحْوِهَا مَا الَّذِي يُطَهِّرُهَا حَتَّى يَحِلَّ الْوُضُوءُ مِنْهَا لِلصَّلَاةِ فَوَقَّعَ ( عليه السلام ) بِخَطِّهِ فِي كِتَابِي تَنْزَحُ مِنْهَا دِلَاءً."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Ismail Bin Bazie who said, ",
            "‘I wrote to a man requesting him to ask Abu Al-Hassan Al-Reza<sup>asws</sup> about the well which happens to be in the house for the Ablution <span class=\"iTxt\">(Wudhu)</span>, so the drops of urine fall into it, or blood, or something falls into it from filth like animal dung and such like. What is that which can clean it until the performance of the Ablution <span class=\"iTxt\">(Wudhu)</span> for the <span class=\"iTxt\">Salaat</span> is Permissible from it?’ So he<sup>asws</sup> wrote by his<sup>asws</sup> own handwriting in his<sup>asws</sup> letter: ‘Remove some buckets from it’ (then use it)."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from Muhammad ibn ’Isma‘il ibn Bazi‘ who has said the following: “I once wrote to a person to write to abu al-Hassan al-Rida, ‘Alayhi al-Salam, to ask him about a well in one’s house for Wudu’. If some drops of urine, or blood, or animal dung and so forth fall in it, then how can it be cleansed so one can take Wudu’ with water from such a well for Salah (prayer). He (the Imam) sent the answer with his signature that said, ’Draw a few buckets of water from it and dispose such water away.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/25)"
        ],
        "index": 3808,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:4:2",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ قَالَ مَاءُ الْبِئْرِ وَاسِعٌ لَا يُفْسِدُهُ شَيْ‏ءٌ إِلَّا أَنْ يَتَغَيَّرَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, ",
            "‘He<sup>asws</sup> said: ‘The water of the large well, nothing would pollute it except if it is changed by it (the filth)’."
          ],
          "en.sarwar": [
            "2. Through the same chain of narrators as the previous Hadith the following is stated: “He (the Imam) ‘Alayhi al-Salam, said, ‘Well water is vast. It does not become polluted until it is changed.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/25)"
        ],
        "index": 3809,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:4:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ أَبِي أُسَامَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الْفَأْرَةِ وَ السِّنَّوْرِ وَ الدَّجَاجَةِ وَ الطَّيْرِ وَ الْكَلْبِ قَالَ مَا لَمْ يَتَفَسَّخْ أَوْ يَتَغَيَّرْ طَعْمُ الْمَاءِ فَيَكْفِيكَ خَمْسُ دِلَاءٍ فَإِنْ تَغَيَّرَ الْمَاءُ فَخُذْ مِنْهُ حَتَّى يَذْهَبَ الرِّيحُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel Bin Darraj, from Abu Asama, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the rats, and the cats, and the birds, and the dogs (falling into the well). He<sup>asws</sup> said: ‘For as long as they have not decomposed, or the taste of the water has not changed, so (removing) five buckets would suffice you; and if the water has changed, so keep taking out from it until the smell goes away’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Jamil ibn Darraj from abu ‘Usamah who has said the following: “This is about the case of a rat, cat, chicken, bird and dog in a well. Abu ’Abd Allah, ‘Alayhi al-Salam, has said, ‘As long as they have not disintegrated or water’s taste is not changed, take out five buckets of water thereof, but if there is a change in the water then continue drawing out the water until the smell is gone.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/26)"
        ],
        "index": 3810,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:4:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا يُفْسِدُ الْمَاءَ إِلَّا مَا كَانَ لَهُ نَفْسٌ سَائِلَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, ",
            "(It has been narrated) raising it from Abu Abdullah<sup>asws</sup> having said: ‘It would not pollute the water except if it has a spurting blood for it (warm blooded mammal)’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya in a marfu‘ manner has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Water does not become polluted because of the living things which do not have spurting blood when a cut is made in its body.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/26)"
        ],
        "index": 3811,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:4:5",
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ أَحْمَدَ بْنِ النَّضْرِ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي السَّامِّ أَبْرَصَ يَقَعُ فِي الْبِئْرِ قَالَ لَيْسَ بِشَيْ‏ءٍ حَرِّكِ الْمَاءَ بِالدَّلْوِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Salim, from Ahmad Bin Al Nazar, from Amro Bin Shimr, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the poisonous snake falling into the well. He<sup>asws</sup> said: ‘It is not with anything. Stir the water with the bucket’."
          ],
          "en.sarwar": [
            "5. Ahmad ibn Idris has narrated from Muhammad ibn Salim from Ahmad ibn al-Nadr from ‘Amr ibn Shimr from Jabir who has said the following: “This is about the case of al-Sam al-Abras (a poisonous snake) that falls in the well. Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘It is not harmful. Just stir the water with the bucket.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/27)"
        ],
        "index": 3812,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:4:6",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ ابْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَمَّا يَقَعُ فِي الْآبَارِ فَقَالَ أَمَّا الْفَأْرَةُ وَ أَشْبَاهُهَا فَيُنْزَحُ مِنْهَا سَبْعُ دِلَاءٍ إِلَّا أَنْ يَتَغَيَّرَ الْمَاءُ فَيُنْزَحَ حَتَّى يَطِيبَ فَإِنْ سَقَطَ فِيهَا كَلْبٌ فَقَدَرْتَ أَنْ تَنْزَحَ مَاءَهَا فَافْعَلْ وَ كُلُّ شَيْ‏ءٍ وَقَعَ فِي الْبِئْرِ لَيْسَ لَهُ دَمٌ مِثْلُ الْعَقْرَبِ وَ الْخَنَافِسِ وَ أَشْبَاهِ ذَلِكَ فَلَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Ibn Sinan, from Ibn Muskan, from Abu Baseer who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about what falls into the wells, so he<sup>asws</sup> said: ‘As for the rat and it’s like, so withdraw seven buckets from it, except if the water has changed (due to it), so you keep withdrawing until it is clean. So if a dog falls into it, and if you are able to withdraw its water, so do it; and everything which falls into the well, not having blood for it, like the scorpion, and the beetles and the likes of that, so there is no problem’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from ibn Sinan from ibn Muskan from abu Basir who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about things that fall into the wells. He (the Imam) said, ‘Because of rats and similar things, seven buckets of water must be drawn out, unless the water is changed, in which case drawing water out must continue until it becomes clean. If a dog falls in it, if you can, draw all of the water out. Falling in a well of anything without blood like a scorpion or beetle and similar things is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/27)"
        ],
        "index": 3813,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:4:7",
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنِ ابْنِ مُسْكَانَ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا سَقَطَ فِي الْبِئْرِ شَيْ‏ءٌ صَغِيرٌ فَمَاتَ فِيهَا فَانْزَحْ مِنْهَا دِلَاءً وَ إِنْ وَقَعَ فِيهَا جُنُبٌ فَانْزَحْ مِنْهَا سَبْعَ دِلَاءٍ فَإِنْ مَاتَ فِيهَا بَعِيرٌ أَوْ صُبَّ فِيهَا خَمْرٌ فَلْيُنْزَحْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, from Safwan, from Ibn Muskaan, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When something small falls into the well and dies in it, so withdraw a bucket from it; and if a sexually impure person were to fall into it, so withdraw seven buckets from it. But if a camel were to die in it, or wine is poured into it, so let it be withdrawn (all of it)’."
          ],
          "en.sarwar": [
            "7. Ahmad ibn Idris has narrated from Muhammad ‘Abd al-Jabbar from Safwan from ibn Muskan from al-Halabiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If something small falls in a well and dies, then take a few buckets of water out. If a person involved in sexual activities (because of which Ghusl (bath) is obligatory) falls in it, you must draw seven buckets of water out thereof. If a camel dies in it or wine is poured in it then you must draw out all of the water.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/28)"
        ],
        "index": 3814,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:4:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنِ الْعَمْرَكِيِّ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَخِيهِ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ ذَبَحَ شَاةً فَاضْطَرَبَتْ وَ وَقَعَتْ فِي بِئْرِ مَاءٍ وَ أَوْدَاجُهَا تَشْخُبُ دَماً هَلْ يُتَوَضَّأُ مِنْ تِلْكَ الْبِئْرِ قَالَ يُنْزَحُ مِنْهَا مَا بَيْنَ الثَّلَاثِينَ إِلَى الْأَرْبَعِينَ دَلْواً ثُمَّ يُتَوَضَّأُ مِنْهَا وَ لَا بَأْسَ بِهِ ",
          "قَالَ وَ سَأَلْتُهُ عَنْ رَجُلٍ ذَبَحَ دَجَاجَةً أَوْ حَمَامَةً فَوَقَعَتْ فِي بِئْرٍ هَلْ يَصْلُحُ أَنْ يُتَوَضَّأَ مِنْهَا قَالَ يُنْزَحُ مِنْهَا دِلَاءٌ يَسِيرَةٌ ثُمَّ يُتَوَضَّأُ مِنْهَا ",
          "وَ سَأَلْتُهُ عَنْ رَجُلٍ يَسْتَقِي مِنْ بِئْرٍ فَيَرْعُفُ فِيهَا هَلْ يُتَوَضَّأُ مِنْهَا قَالَ يُنْزَحُ مِنْهَا دِلَاءٌ يَسِيرَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Al Amraky Bin Ali, ",
            "(It has been narrated) from Ali son of Ja’far<sup>asws</sup>, from his brother<sup>asws</sup> Abu Al-Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who slaughters a sheep, so it becomes restless and falls into a water well, and blood was gushing from its arteries. Can one perform Ablution <span class=\"iTxt\">(Wudhu)</span> from that well?’ He<sup>asws</sup> said: ‘Withdraw from it what is between thirty and forty buckets, then he can perform Ablution <span class=\"iTxt\">(Wudhu)</span> from it, and there would be no problem with it’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about a man who slaughters a chicken, or a dove, so it falls into a well. Is it correct for him to perform Ablution <span class=\"iTxt\">(Wudhu)</span> from it?’ He<sup>asws</sup> said: ‘He should withdraw a few buckets from it, then he can perform Ablution <span class=\"iTxt\">(Wudhu)</span> from it’. ",
            "And I asked him<sup>asws</sup> about a man who quenches from a well, but his nose-bleed (falls) into it, ‘Can he perform Ablution <span class=\"iTxt\">(Wudhu)</span> from it?’ He<sup>asws</sup> said: ‘He should withdraw a few buckets from it’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from al-‘Amrakiy ibn Ali from Ali ibn Ja‘far who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about a man who slaughters a sheep and due to the shock it falls into the water well with blood gushing from its veins. Can one take Wudu’ from such well? He (the Imam) said, ’One must draw out thirty to forty buckets of water, then one can take Wudu’ with its water and it is not harmful.’ I then asked about a man who slaughters a chicken or pigeon and it falls into the well. Can one take Wudu’ with water from such well? He (the Imam) said, ‘A few buckets of water must be taken out, then one can take Wudu’.’ I then asked about someone from whose nostril blood falls into the well can one then take Wudu’ with water from such well? He (the Imam) said, ‘A few buckets of water must be taken out.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/29)"
        ],
        "index": 3815,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:4:9",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ بِئْرٌ يُخْرَجُ فِي مَائِهَا قِطَعُ جُلُودٍ قَالَ لَيْسَ بِشَيْ‏ءٍ إِنَّ الْوَزَغَ رُبَّمَا طَرَحَ جِلْدَهُ وَ قَالَ يَكْفِيكَ دَلْوٌ مِنْ مَاءٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira, from the one who mentioned it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said, ‘A well, there comes out from its water, pieces of skin’. He<sup>asws</sup> said: ‘It is not with anything. The salamander, sometimes it sheds it skin’. And he<sup>asws</sup> said: ‘It would suffice you (to withdraw) a bucket of water’ (before using it)."
          ],
          "en.sarwar": [
            "9. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ’Abd Allah ibn al-Mughirah from those whom he has mentioned who have said the following: “I once said to abu ’Abd Allah, ‘Alayhi al-Salam, that there is a water-well and with its water pieces of skin come out. He (the Imam) said, ‘It is not anything. Perhaps a frog sheds its skin.’ He (the Imam) said that one bucket of water is sufficient for you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/29)"
        ],
        "index": 3816,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:4:10",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الْحَبْلِ يَكُونُ مِنْ شَعْرِ الْخِنْزِيرِ يُسْتَقَى بِهِ الْمَاءُ مِنَ الْبِئْرِ هَلْ يُتَوَضَّأُ مِنْ ذَلِكَ الْمَاءِ قَالَ لَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Ibn Ra’ib, from Zurara, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the rope which happens to be from the pig, the water from the well being withdrawn by it. Can one perform Ablution <span class=\"iTxt\">(Wudhu)</span> from that water?’ He<sup>asws</sup> said: ‘There is no problem’."
          ],
          "en.sarwar": [
            "10. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from ibn Ri’ab from Zurarah who has said the following: “I once asked abu ‘Abd Allah, Alayhi al-Salam, about a rope made of the hairs of hogs which is used to take out water from the well. Can Wudu’ be made with such water? He (the Imam) said, ‘It is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/29)"
        ],
        "index": 3817,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:4:11",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْعَذِرَةِ تَقَعُ فِي الْبِئْرِ قَالَ يُنْزَحُ مِنْهَا عَشَرَةُ دِلَاءٍ فَإِنْ ذَابَتْ فَأَرْبَعُونَ أَوْ خَمْسُونَ دَلْواً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad, from Ali Bin Abu Hamza who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the faeces falling into the well. He<sup>asws</sup> said: ‘Withdraw ten buckets from it. But, if it has melted, so forty or fifty buckets’."
          ],
          "en.sarwar": [
            "11. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Qasim ibn Muhammad from Ali ibn abu Hamzah who has said the following: “I once asked abu ‘Abd Allah, Alayhi al-Salam, about the falling of feces into a well. He (the Imam) said, ‘Ten buckets of water must be taken out and if it has disintegrated then forty or fifty buckets of water must be taken out.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/30)"
        ],
        "index": 3818,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:4:12",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ عَبْدِ الْكَرِيمِ عَنْ أَبِي بَصِيرٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) بِئْرٌ يُسْتَقَى مِنْهَا وَ يُتَوَضَّأُ بِهِ وَ يُغْسَلُ مِنْهُ الثِّيَابُ وَ يُعْجَنُ بِهِ ثُمَّ يُعْلَمُ أَنَّهُ كَانَ فِيهَا مَيِّتٌ قَالَ فَقَالَ لَا بَأْسَ وَ لَا يُغْسَلُ مِنْهُ الثَّوْبُ وَ لَا تُعَادُ مِنْهُ الصَّلَاةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl, from Ahmad Bin Muhammad Bin Abu Nasr, from Abdul Kareem, from Abu Baseer who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘A well, one quenches from it, and performs Ablution <span class=\"iTxt\">(Wudhu)</span> with it, and washes the clothes from it, and kneads with it. Then one comes to know that there is a carcass in it’. So he<sup>asws</sup> said: ‘There is no problem, and he should neither wash the clothes from it (again) nor repeat the <span class=\"iTxt\">Salaat</span> due to it’."
          ],
          "en.sarwar": [
            "12. Ali ibn Muhammad has narrated from Sahl from Ahmad ibn Muhammad from ibn abu Nasr from ‘Abd al-Karim from abu Basir who has said the following: “I once said to abu ‘Abd Allah, Alayhi al-Salam, that there was a well from which people drank, took Wudu’, washed their clothes and flour was made into dough with its water, and then a dead body was found in it. He (the Imam) said, ‘It does not matter, there is no need to wash clothes or perform Salah (prayer) again.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:1:4",
  "kind": "verse_list"
}