{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:3:1",
        "titles": {
          "ar": "كِتَابُ الطَّهَارَةِ",
          "en": "THE BOOK OF CLEANLINESS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 45"
        },
        "path": "/books/al-kafi:3:1:45",
        "titles": {
          "ar": "باب الْكَسِيرِ وَ الْمَجْدُورِ وَ مَنْ بِهِ الْجِرَاحَاتُ وَ تُصِيبُهُمُ الْجَنَابَةُ",
          "en": "Chapter 45 – The one with a broken (limb), and the one with pockmarks, and the one with the injuries, and they are hit by the sexual impurity"
        }
      }
    ],
    "index": 546,
    "local_index": 45,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 46"
        },
        "path": "/books/al-kafi:3:1:46",
        "titles": {
          "ar": "باب النَّوَادِرِ",
          "en": "Chapter 46 – Miscellaneous"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 44"
        },
        "path": "/books/al-kafi:3:1:44",
        "titles": {
          "ar": "باب التَّيَمُّمِ بِالطِّينِ",
          "en": "Chapter 44 – The Tayammum with the clay"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:3:1",
        "titles": {
          "ar": "كِتَابُ الطَّهَارَةِ",
          "en": "THE BOOK OF CLEANLINESS"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:1:45",
    "titles": {
      "ar": "باب الْكَسِيرِ وَ الْمَجْدُورِ وَ مَنْ بِهِ الْجِرَاحَاتُ وَ تُصِيبُهُمُ الْجَنَابَةُ",
      "en": "Chapter 45 – The one with a broken (limb), and the one with pockmarks, and the one with the injuries, and they are hit by the sexual impurity"
    },
    "verse_count": 5,
    "verse_start_index": 4104,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/186)"
        ],
        "index": 4105,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:45:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الرَّجُلِ يَكُونُ بِهِ الْقَرْحُ وَ الْجِرَاحَةُ يُجْنِبُ قَالَ لَا بَأْسَ بِأَنْ لَا يَغْتَسِلَ وَ يَتَيَمَّمَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Abu Ayoub Al Khazzaz, from Muhammad Bin Muslim who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the man who happens to be with the sores and the injuries, experiences the sexual impurity. He<sup>asws</sup> said: ‘There is no problem with it if he does not wash, and he performs <span class=\"iTxt\">Tayammum</span>’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from abu Ayyub al-Khazzaz from Muhammad ibn Muslim who has said the following: “I once asked Abu Ja‘far, ‘Alayhi al-Salam, about a man on whose body there are dimples or wounds and experiences sexual relation. He (the Imam) said, ‘It is not harmful if one does not take Ghusl (bath) in such condition, instead takes Tayammum.’’’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/186)"
        ],
        "index": 4106,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:45:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ يَتَيَمَّمُ الْمَجْدُورُ وَ الْكَسِيرُ بِالتُّرَابِ إِذَا أَصَابَتْهُ الْجَنَابَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from one of his companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one with pockmarks and with the broken limb would perform <span class=\"iTxt\">Tayammum</span> with the dust when the sexual impurity hits him’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from certain persons of his people who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘One with smallpox or broken bones has permission to take Tayammum with soil after experiencing sexual relation.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/187)"
        ],
        "index": 4107,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:45:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَحْمَدَ رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ مَجْدُورٍ أَصَابَتْهُ جَنَابَةٌ قَالَ إِنْ كَانَ أَجْنَبَ هُوَ فَلْيَغْتَسِلْ وَ إِنْ كَانَ احْتَلَمَ فَلْيَتَيَمَّمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Ahmad, raising it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the one with pockmarks hit by the sexual impurity. He<sup>asws</sup> said: ‘If he was with sexual impurity, so let him wash, and if he had bed-wet, so let him perform <span class=\"iTxt\">Tayammum</span>’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad from Muhammad ibn Ali from Ahmad who in a marfu‘ manner has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about one with a condition of smallpox who experiences sexual relation. He (the Imam) said, ‘If one has experienced sexual relation, he must take Ghusl (bath), but if it is wet dream, there is Tayammum for it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/187)"
        ],
        "index": 4108,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:45:4",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ بَكْرِ بْنِ صَالِحٍ وَ ابْنِ فَضَّالٍ عَنْ عَبْدِ اللَّهِ بْنِ إِبْرَاهِيمَ الْغِفَارِيِّ عَنْ جَعْفَرِ بْنِ إِبْرَاهِيمَ الْجَعْفَرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ النَّبِيَّ ( صلى الله عليه وآله ) ذُكِرَ لَهُ أَنَّ رَجُلًا أَصَابَتْهُ جَنَابَةٌ عَلَى جُرْحٍ كَانَ بِهِ فَأُمِرَ بِالْغُسْلِ فَاغْتَسَلَ فَكُزَّ فَمَاتَ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَتَلُوهُ قَتَلَهُمُ اللَّهُ إِنَّمَا كَانَ دَوَاءُ الْعِيِّ السُّؤَالَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Bakr Bin Salih and Ibn Fazzal, from Abdullah Bin Ibrahim Al Ghifary, from Ja’far Bin Ibrahim Al Ja’fary, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said that the Prophet<sup>saww</sup>, it was mentioned to him<sup>saww</sup> that a man was hit by the sexual impurity upon a wound which he was with, so he was instructed with the washing. So he washed, and it got infected, so he died. So Rasool-Allah<sup>saww</sup> said: ‘They killed him, may Allah<sup>azwj</sup> Kill them. But rather the cure was prevented by the asking (for it)’."
          ],
          "en.sarwar": [
            "4. Ahmad ibn Muhammad has narrated from Bakr ibn Salih and ibn Faddal from ‘Abd Allah ibn Ibrahim al-Ghifariy from Ja‘far ibn Ibrahim al-Ja‘fariy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that once the case of a man on whose body there was a wound and had experienced sexual relation was mentioned before the Holy prophet and that they compelled him to take Ghusl (bath). It shriveled him with complications, which caused his death. The Messenger of Allah said, ‘They killed him, may Allah cause them to die. Only asking is medicine for ignorance.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/187)"
        ],
        "index": 4109,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:45:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ سُكَيْنٍ وَ غَيْرِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قِيلَ لَهُ إِنَّ فُلَاناً أَصَابَتْهُ جَنَابَةٌ وَ هُوَ مَجْدُورٌ فَغَسَّلُوهُ فَمَاتَ فَقَالَ قَتَلُوهُ أَلَّا سَأَلُوا أَلَّا يَمَّمُوهُ إِنَّ شِفَاءَ الْعِيِّ السُّؤَالُ ",
          "قَالَ وَ رُوِيَ ذَلِكَ فِي الْكَسِيرِ وَ الْمَبْطُونِ يَتَيَمَّمُ وَ لَا يَغْتَسِلُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muhammad Bin Sukeyn, and someone else, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘It was said to him<sup>asws</sup>, ‘So and so was hit by the sexual impurity and he was with pockmarks. So he washed, and he died’. So he<sup>asws</sup> said: ‘They killed him. Why did they not ask? He could have performed <span class=\"iTxt\">Tayammum</span>. The healing is prevented by the asking (for it)’. ",
            "He (the narrator) said, ‘And that is reported regarding the one with a broken limb, and the internal illness that they should be performing <span class=\"iTxt\">Tayammum</span> and should not be washing’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Muhammad ibn Sukayn and others who has said the following: “It was said to abu ‘Abd Allah, ‘Alayhi al-Salam, that so and so had smallpox and had experienced sexual relation. They gave him Ghusl (bath) which caused him to die. He (the Imam) said, ‘They killed him. Why did they not ask about giving him Tayammum? Only asking is medicine for ignorance.’” It applies also to one with broken bones and internal illness (causing discharge from the buttocks) who must do Tayammum instead of Ghusl (bath). "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:1:45",
  "kind": "verse_list"
}