{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:3:1",
        "titles": {
          "ar": "كِتَابُ الطَّهَارَةِ",
          "en": "THE BOOK OF CLEANLINESS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 46"
        },
        "path": "/books/al-kafi:3:1:46",
        "titles": {
          "ar": "باب النَّوَادِرِ",
          "en": "Chapter 46 – Miscellaneous"
        }
      }
    ],
    "index": 547,
    "local_index": 46,
    "nav": {
      "prev": {
        "indexed_titles": {
          "en": "Chapter 45"
        },
        "path": "/books/al-kafi:3:1:45",
        "titles": {
          "ar": "باب الْكَسِيرِ وَ الْمَجْدُورِ وَ مَنْ بِهِ الْجِرَاحَاتُ وَ تُصِيبُهُمُ الْجَنَابَةُ",
          "en": "Chapter 45 – The one with a broken (limb), and the one with pockmarks, and the one with the injuries, and they are hit by the sexual impurity"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:3:1",
        "titles": {
          "ar": "كِتَابُ الطَّهَارَةِ",
          "en": "THE BOOK OF CLEANLINESS"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:1:46",
    "titles": {
      "ar": "باب النَّوَادِرِ",
      "en": "Chapter 46 – Miscellaneous"
    },
    "verse_count": 17,
    "verse_start_index": 4109,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/188)"
        ],
        "index": 4110,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/33",
              "text": "عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/34",
              "text": "إِبْرَاهِيمَ بْنِ إِسْحَاقَ الْأَحْمَرِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/131",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ الْأَحْمَرِ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:46:1",
        "relations": {
          "Mentions": [
            "/books/quran:18:110"
          ]
        },
        "text": [
          " دَخَلْتُ عَلَى الرِّضَا ( عليه السلام ) وَ بَيْنَ يَدَيْهِ إِبْرِيقٌ يُرِيدُ أَنْ يَتَهَيَّأَ مِنْهُ لِلصَّلَاةِ فَدَنَوْتُ مِنْهُ لِأَصُبَّ عَلَيْهِ فَأَبَى ذَلِكَ وَ قَالَ مَهْ يَا حَسَنُ فَقُلْتُ لَهُ لِمَ تَنْهَانِي أَنْ أَصُبَّ عَلَى يَدِكَ تَكْرَهُ أَنْ أُوجَرَ قَالَ تُؤْجَرُ أَنْتَ وَ أُوزَرُ أَنَا ",
          "فَقُلْتُ لَهُ وَ كَيْفَ ذَلِكَ فَقَالَ أَ مَا سَمِعْتَ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ فَمَنْ كانَ يَرْجُوا لِقاءَ رَبِّهِ فَلْيَعْمَلْ عَمَلًا صالِحاً وَ لا يُشْرِكْ بِعِبادَةِ رَبِّهِ أَحَداً وَ هَا أَنَا ذَا أَتَوَضَّأُ لِلصَّلَاةِ وَ هِيَ الْعِبَادَةُ فَأَكْرَهُ أَنْ يَشْرَكَنِي فِيهَا أَحَدٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad Bin Abdullah, from Ibrahim Bin Is’haq Al Ahmar, from Al Hassan Bin Ali Al Washa who said, ",
            "I went over to Al-Reza<sup>asws</sup> and in front of him<sup>asws</sup> was a jug intending to prepare from it for the <span class=\"iTxt\">Salaat</span>. So I approached him<sup>asws</sup> to pour it upon him<sup>asws</sup>, but he<sup>asws</sup> refused that and said: ‘No, O Hassan!’ So I said to him<sup>asws</sup>, ‘Why are you<sup>asws</sup> forbidding be to pour upon your<sup>asws</sup> hand? Do you<sup>asws</sup> dislike for me to be Recompensed (for it)?’ He<sup>asws</sup> said: ‘You will be Recompensed and I<sup>asws</sup> would be burdened’. ",
            "So I said to him<sup>asws</sup>, ‘And how can that be?’ So he<sup>asws</sup> said: ‘Have you not heard Allah<sup>azwj</sup> Mighty and Majestic Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:18#h110\">[18:110]</a> therefore whoever hopes to meet his Lord, so he should do righteous deeds, and not associate anyone in the worship of his Lord</span>, and here I<sup>asws</sup> am performing Ablution <span class=\"iTxt\">(Wudhu)</span> for the <span class=\"iTxt\">Salaat</span>, and it is the (act of) worship, therefore I<sup>asws</sup> dislike for anyone to participate with me therein’."
          ],
          "en.sarwar": [
            "1. Ali ibn Muhammad ibn ‘Abd Allah has narrated from Ibrahim ibn Ishaq al-Ahmar from al-Hassan ibn Ali al-Washsha’ who has said the following: “Once I visited Ali al-Rida, ‘Alayhi al-Salam. There was a water jug in front of him and he was about to take Wudu’ for Salah (prayer). I went closer to pour water to help him to take Wudu’. He said, ‘Hold it, O Hassan.’ I then asked, ‘Why do you stop me from pouring water so you take Wudu’ and I can receive rewards for it?’ He replied, ‘You will receive rewards, but I will be burdened.’ I then asked, ‘How can that happen?’ He replied, ‘Have you not heard the words of Allah, the Most Majestic, the Most Glorious, “Those who wish to meet (receive mercy from) their Lord should do good deeds and not allow anyone else to share in (their) worshipping their Lord.” <a href=\"/#/books/quran:18#h110\">[18:110]</a> I am about to take Wudu’ for Salah (prayer). I do not want anyone to share with me my act of worship.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/189)"
        ],
        "index": 4111,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/51",
              "text": "جَعْفَرِ بْنِ مُحَمَّدٍ الْأَشْعَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/154",
              "text": "الْقَدَّاحِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الْأَشْعَرِيِّ عَنِ الْقَدَّاحِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:46:2",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) افْتِتَاحُ الصَّلَاةِ الْوُضُوءُ وَ تَحْرِيمُهَا التَّكْبِيرُ وَ تَحْلِيلُهَا التَّسْلِيمُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Ja’far Bin Muhammad Al Ashary, from Al Qaddah, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Begin the <span class=\"iTxt\">Salaat</span> is the Ablution <span class=\"iTxt\">(Wudhu)</span> and its sanctity is the exclamation of the Takbeer, and its legalization is the greetings (ending the <span class=\"iTxt\">Salaat</span>)’."
          ],
          "en.sarwar": [
            "2. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Ja‘far ibn Muhammad al-Ash’ariy from al-Qaddah from abu ‘Abd Allah, who has said the following: “The Messenger of Allah has said, ‘Wudu’ is the opening of Salah (prayer), Takbir marks the field of Salah (prayer) and Taslim marks the end of the field of Salah (prayer).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/189)"
        ],
        "index": 4112,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/595",
              "text": "صَالِحِ بْنِ السِّنْدِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/596",
              "text": "جَعْفَرِ بْنِ بَشِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2184",
              "text": "صَبَّاحٍ الْحَذَّاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/143",
              "text": "أَبِي أُسَامَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنْ صَبَّاحٍ الْحَذَّاءِ عَنْ أَبِي أُسَامَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:46:3",
        "text": [
          " كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَسَأَلَهُ رَجُلٌ مِنَ الْمُغِيرِيَّةِ عَنْ شَيْ‏ءٍ مِنَ السُّنَنِ فَقَالَ مَا مِنْ شَيْ‏ءٍ يَحْتَاجُ إِلَيْهِ أَحَدٌ مِنْ وُلْدِ آدَمَ إِلَّا وَ قَدْ جَرَتْ فِيهِ مِنَ اللَّهِ وَ مِنْ رَسُولِهِ سُنَّةٌ عَرَفَهَا مَنْ عَرَفَهَا وَ أَنْكَرَهَا مَنْ أَنْكَرَهَا",
          "فَقَالَ رَجُلٌ فَمَا السُّنَّةُ فِي دُخُولِ الْخَلَاءِ قَالَ تَذْكُرُ اللَّهَ وَ تَتَعَوَّذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ وَ إِذَا فَرَغْتَ قُلْتَ الْحَمْدُ لِلَّهِ عَلَى مَا أَخْرَجَ مِنِّي مِنَ الْأَذَى فِي يُسْرٍ وَ عَافِيَةٍ ",
          "قَالَ الرَّجُلُ فَالْإِنْسَانُ يَكُونُ عَلَى تِلْكَ الْحَالِ وَ لَا يَصْبِرُ حَتَّى يَنْظُرَ إِلَى مَا يَخْرُجُ مِنْهُ قَالَ إِنَّهُ لَيْسَ فِي الْأَرْضِ آدَمِيٌّ إِلَّا وَ مَعَهُ مَلَكَانِ مُوَكَّلَانِ بِهِ فَإِذَا كَانَ عَلَى تِلْكَ الْحَالِ ثَنَيَا بِرَقَبَتِهِ ثُمَّ قَالَا يَا ابْنَ آدَمَ انْظُرْ إِلَى مَا كُنْتَ تَكْدَحُ لَهُ فِي الدُّنْيَا إِلَى مَا هُوَ صَائِرٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Salih Bin Al Sandy, from Ja’far Bin Bashir, from Sabbahh Al Haza’a, from Abu Asama who said, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup>, and a man from the Mugheira clan asked him<sup>asws</sup> about something from the Sunnah, so he<sup>asws</sup> said: ‘There is nothing which anyone from the children of Adam<sup>as</sup> would be needy to except that there has flowed a Sunnah from Allah<sup>azwj</sup> and a Sunnah from His<sup>azwj</sup> Rasool<sup>saww</sup> with regards to it. The one who recognises it recognises it, and the one who denies it, denies it’.",
            "So the man said, ‘So what is the Sunnah regarding entering the toilet?’ He<sup>asws</sup> said: ‘Mentioning Allah<sup>azwj</sup> and seeking refuge with Allah<sup>azwj</sup> from the Satan<sup>la</sup>, the Pelted one. And when you are free, you should say, ‘The Praise is for Allah<sup>azwj</sup> upon what exited from me from the harm, in ease and good health’. ",
            "Then man said, ‘So the human being who happens to be in that state (excreting) and he cannot be patient until he looks at what comes out from him’. He<sup>asws</sup> said: ‘There is no person in the earth except with him are two Angels Allocated with him. So when he was upon that state, they bend his neck, then they say: ‘O son of Adam<sup>as</sup>! Look at what you were toiling for in the world, to what it has become’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from Salih ibn al-Sindiy from Ja‘far ibn Bashir from Sabah al-Hadhdh’a from abu ‘Usamah who has said the following: “Once I was in the presence of abu ‘Abd Allah, ‘Alayhi al-Salam, when a man of the followers of al- Mughirah asked him about matters of tradition (the Sunnah). The Imam replied, ‘There a tradition is set about everything that a son of Adam may need from Allah and His Messenger. There are those who have recognized such traditions and there are those who have rejected them.’ The man then asked, ‘What is the tradition about using the restroom?’ The Imam replied, ‘Speak of Allah and seek protection with Allah against Satan, the one condemned to be stoned. When you finish using a restroom you should say this. “All praise belongs to Allah who has relieved me of the discomfort with ease and good health.’” The man then asked, ‘Should one say such expressions in such a condition before looking back at what has come out?’ The Imam replied, ‘To every man on earth there are two angels assigned. When he is in such a condition, they bend his neck down saying, “O son of Adam, look down to the thing for which you have been struggling, into what kind of thing it has turned.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/190)"
        ],
        "index": 4113,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/325",
              "text": "سَلَمَةَ بْنِ الْخَطَّابِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1192",
              "text": "إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الثَّقَفِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1193",
              "text": "عَلِيِّ بْنِ الْمُعَلَّى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2414",
              "text": "إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ حُمْرَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الثَّقَفِيِّ عَنْ عَلِيِّ بْنِ الْمُعَلَّى عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ حُمْرَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:46:4",
        "text": [
          " مَنْ تَوَضَّأَ فَتَمَنْدَلَ كَانَتْ لَهُ حَسَنَةٌ وَ إِنْ تَوَضَّأَ وَ لَمْ يَتَمَنْدَلْ حَتَّى يَجِفَّ وَضُوؤُهُ كَانَتْ لَهُ ثَلَاثُونَ حَسَنَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Salma Bin Al Khattab, from Ibrahim Bin Muhammad Al Saqafy, from Ali Bin Al Moalla, from Ibrahim Bin Muhammad Bin Humran, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who performs Ablution <span class=\"iTxt\">(Wudhu)</span> and wipes with a towel, for him would be one Reward; but if he performs Ablution <span class=\"iTxt\">(Wudhu)</span> and does not wipe with a towel, (letting it naturally) dry his Ablution <span class=\"iTxt\">(Wudhu)</span> (upon himself), for him would be thirty Rewards’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Salmah ibn al-Khattab from Ibrahim ibn Muhammad al-Thaqafiy from Ali ibn al-Mu‘alla’ from Ibrahim ibn Muhammad ibn Humran who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘For taking Wudu’, then using a towel, one gains a good deed. Instead of using a towel if one allows the moisture from Wudu’ to dry up, one gains thirty good deeds.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/190)"
        ],
        "index": 4114,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/11",
              "text": "عَمْرِو بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2415",
              "text": "جَرَّاحٍ الْحَذَّاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/287",
              "text": "سَمَاعَةَ بْنِ مِهْرَانَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ جَرَّاحٍ الْحَذَّاءِ عَنْ سَمَاعَةَ بْنِ مِهْرَانَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:46:5",
        "text": [
          " قَالَ أَبُو الْحَسَنِ مُوسَى ( عليه السلام ) مَنْ تَوَضَّأَ لِلْمَغْرِبِ كَانَ وُضُوؤُهُ ذَلِكَ كَفَّارَةً لِمَا مَضَى مِنْ ذُنُوبِهِ فِي نَهَارِهِ مَا خَلَا الْكَبَائِرَ وَ مَنْ تَوَضَّأَ لِصَلَاةِ الصُّبْحِ كَانَ وُضُوؤُهُ ذَلِكَ كَفَّارَةً لِمَا مَضَى مِنْ ذُنُوبِهِ فِي لَيْلَتِهِ إِلَّا الْكَبَائِرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Amro Bin Usman, from Jarrah Al Haza’a, from Sama’at Bin Mihran who said, ",
            "‘Abu Al-Hassan Musa<sup>asws</sup> said: ‘The one who performs Ablution <span class=\"iTxt\">(Wudhu)</span> for the Maghrib (evening <span class=\"iTxt\">Salaat</span>), that Ablution <span class=\"iTxt\">(Wudhu)</span> of his would be an expiation for what is past from his sins during his day, except the major sins; and the one who performs Ablution <span class=\"iTxt\">(Wudhu)</span> for the morning <span class=\"iTxt\">Salaat</span>, that Ablution <span class=\"iTxt\">(Wudhu)</span> of his would be an expiation for what is past from his sins during his night, except the major sins’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ‘Amr ibn ‘Uthman from Jarrah al-Hadhdha’ from Sama‘ah ibn Mehran who has said the following. “Abu al-Hassan, Musa, ‘Alayhi al-Salam, has said, ‘If one takes Wudu’ for Maghrib Salah (prayer), this Wudu’ is expiation for the sins committed during the day that has just passed, except the major sins. If one takes Wudu’ for morning Salah (prayer), this Wudu’ is expiation for the sins committed during the night that has just passed, except the major sins.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/190)"
        ],
        "index": 4115,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2416",
              "text": "قَاسِمٍ الْخَزَّازِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/460",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ قَاسِمٍ الْخَزَّازِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:46:6",
        "text": [
          " بَيْنَا أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) قَاعِدٌ وَ مَعَهُ ابْنُهُ مُحَمَّدٌ إِذْ قَالَ يَا مُحَمَّدُ ائْتِنِي بِإِنَاءٍ مِنْ مَاءٍ فَأَتَاهُ بِهِ فَصَبَّهُ بِيَدِهِ الْيُمْنَى عَلَى يَدِهِ الْيُسْرَى ثُمَّ قَالَ الْحَمْدُ لِلَّهِ الَّذِي جَعَلَ الْمَاءَ طَهُوراً وَ لَمْ يَجْعَلْهُ نَجِساً ",
          "ثُمَّ اسْتَنْجَى فَقَالَ اللَّهُمَّ حَصِّنْ فَرْجِي وَ أَعِفَّهُ وَ اسْتُرْ عَوْرَتِي وَ حَرِّمْهَا عَلَى النَّارِ ",
          "ثُمَّ اسْتَنْشَقَ فَقَالَ اللَّهُمَّ لَا تُحَرِّمْ عَلَيَّ رِيحَ الْجَنَّةِ وَ اجْعَلْنِي مِمَّنْ يَشَمُّ رِيحَهَا وَ طِيبَهَا وَ رَيْحَانَهَا ",
          "ثُمَّ تَمَضْمَضَ فَقَالَ اللَّهُمَّ أَنْطِقْ لِسَانِي بِذِكْرِكَ وَ اجْعَلْنِي مِمَّنْ تَرْضَى عَنْهُ ",
          "ثُمَّ غَسَلَ وَجْهَهُ فَقَالَ اللَّهُمَّ بَيِّضْ وَجْهِي يَوْمَ تَسْوَدُّ فِيهِ الْوُجُوهُ وَ لَا تُسَوِّدْ وَجْهِي يَوْمَ تَبْيَضُّ فِيهِ الْوُجُوهُ ",
          "ثُمَّ غَسَلَ يَمِينَهُ فَقَالَ اللَّهُمَّ أَعْطِنِي كِتَابِي بِيَمِينِي وَ الْخُلْدَ بِيَسَارِي ",
          "ثُمَّ غَسَلَ شِمَالَهُ فَقَالَ اللَّهُمَّ لَا تُعْطِنِي كِتَابِي بِشِمَالِي وَ لَا تَجْعَلْهَا مَغْلُولَةً إِلَى عُنُقِي وَ أَعُوذُ بِكَ مِنْ مُقَطَّعَاتِ النِّيرَانِ ",
          "ثُمَّ مَسَحَ رَأْسَهُ فَقَالَ اللَّهُمَّ غَشِّنِي بِرَحْمَتِكَ وَ بَرَكَاتِكَ وَ عَفْوِكَ ",
          "ثُمَّ مَسَحَ عَلَى رِجْلَيْهِ فَقَالَ اللَّهُمَّ ثَبِّتْ قَدَمَيَّ عَلَى الصِّرَاطِ يَوْمَ تَزِلُّ فِيهِ الْأَقْدَامُ وَ اجْعَلْ سَعْيِي فِيمَا يُرْضِيكَ عَنِّي ",
          "ثُمَّ الْتَفَتَ إِلَى مُحَمَّدٍ فَقَالَ يَا مُحَمَّدُ مَنْ تَوَضَّأَ بِمِثْلِ مَا تَوَضَّأْتُ وَ قَالَ مِثْلَ مَا قُلْتُ خَلَقَ اللَّهُ لَهُ مِنْ كُلِّ قَطْرَةٍ مَلَكاً يُقَدِّسُهُ وَ يُسَبِّحُهُ وَ يُكَبِّرُهُ وَ يُهَلِّلُهُ وَ يَكْتُبُ لَهُ ثَوَابَ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Qasim Al Khazzaz, from Abdul Rahman Bin Kaseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘While Amir Al-Momineen<sup>asws</sup> was seated and with him<sup>asws</sup> was his<sup>asws</sup> son Muhammad, when he<sup>asws</sup> said: ‘O Muhammad! Bring me a container of water’. So he gave it to him<sup>asws</sup>, and he<sup>asws</sup> poured by his<sup>asws</sup> right hand upon his<sup>asws</sup> hand, then said: ‘The Praise is for Allah<sup>azwj</sup> Who Made the water as a purifier and did not Make it unclean’. ",
            "Then he<sup>asws</sup> cleaned his<sup>asws</sup> private part and he<sup>asws</sup> said: ‘O Allah<sup>azwj</sup>! Fortify my<sup>asws</sup> private part and Keep it chaste, and conceal my<sup>asws</sup> nakedness and Prohibit it upon the Fire’. ",
            "Then he<sup>asws</sup> inhaled and he<sup>asws</sup> said: ‘O Allah<sup>azwj</sup>! Do no Prohibit the aroma of the Paradise upon me<sup>asws</sup> and Make me<sup>asws</sup> to be from the one who smell its aroma, and its perfume, and its fragrances’. ",
            "Then he rinsed his<sup>asws</sup> mouth and he<sup>asws</sup> said: ‘O Allah<sup>azwj</sup>! Cause my<sup>asws</sup> tongue to speak with Your<sup>azwj</sup> Mention, and Make me to be from the ones You<sup>azwj</sup> are Pleased with’. ",
            "Then he<sup>asws</sup> washed his<sup>asws</sup> face and he<sup>asws</sup> said: ‘O Allah<sup>azwj</sup>! Whiten my<sup>asws</sup> face on the Day in which the faces would be Blackened, and do not Blacken my<sup>asws</sup> face on the Day in which faces would be Whitened’. ",
            "Then he<sup>asws</sup> washed his<sup>asws</sup> right hand and he<sup>asws</sup> said: ‘O Allah<sup>azwj</sup>! Give me<sup>asws</sup> my Book (Register of deeds) in my<sup>asws</sup> right hand and the eternity (the eternal life) to be in my<sup>asws</sup> left hand’.",
            "Then he<sup>asws</sup> washed his<sup>asws</sup> left hand and he<sup>asws</sup> said: ‘O Allah<sup>azwj</sup>! Do not Give me<sup>asws</sup> my<sup>asws</sup> Book (Register of deeds) in my<sup>asws</sup> left hand, nor Make it to be a tied to my<sup>asws</sup> neck, and I<sup>asws</sup> hereby seek Refuge with You<sup>azwj</sup> from the pieces of the Fires’.",
            "Then he<sup>asws</sup> wiped his<sup>asws</sup> head and said: ‘O Allah<sup>azwj</sup>! Overwhelm me<sup>asws</sup> with Your<sup>azwj</sup> Mercy and Your<sup>azwj</sup> Forgiveness’. ",
            "Then he<sup>asws</sup> wiped upon his<sup>asws</sup> feet and he<sup>asws</sup> said: ‘O Allah<sup>azwj</sup>! Affirm my<sup>asws</sup> feet upon the Bridge on the Day on which the feet would waver upon it, and Make my<sup>asws</sup> striving to be in what Pleases You<sup>azwj</sup> about me<sup>asws</sup>’. ",
            "Then he<sup>asws</sup> turned towards Muhammad, so he<sup>asws</sup> said: ‘O Muhammad! The one who performs Ablution <span class=\"iTxt\">(Wudhu)</span> with the likes of what I<sup>asws</sup> performed the Ablution <span class=\"iTxt\">(Wudhu)</span> and says the like of what I<sup>asws</sup> said, Allah<sup>azwj</sup> would Create for him and Angel from every drop, Extolling Him<sup>azwj</sup>, and Glorifying Him<sup>azwj</sup>, and Exclaiming His<sup>azwj</sup> Greatness, and Extolling His<sup>azwj</sup> Holiness, and Write for him the Rewards of that’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from Qasim af-Khazzaz, from ’Abd af-Rahman ibn Kathir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that once, ’Amir al-Mu’minin, ‘Alayhi al-Salam, while Muhammad, his son was present, asked him to bring water for Wudu’. He brought water and he (’Amir al-Mu’minin) poured with his right hand onto his left hand and said, ‘All praise belongs to Allah who has made water purifying and has not made it impure.’ He then used water to clean his private parts and said, ‘O Lord, protect my private parts and keep them chaste, cover the parts of my body to be concealed and save them from the fire.’ He then cleansed his nostrils and said, ‘O Lord, do not deprive me of the fragrance of paradise; make me of those who enjoy the fragrance, goodness and delight of paradise.’ He then rinsed his mouth and said, ‘O Lord, allow my tongue to speak of You and make me of those with whom You are happy.’ He then washed his face and said, ‘O Lord, make my face white on the Day when faces turn black and do not make my face black on the Day when faces turn white.’ He then washed his right hand and said, ‘O Lord, please give the book of the record of my deeds in my right hand and eternity in my left hand.’ He then washed his left hand and said, ‘O Lord, do not give the book of the record of my deeds in my left hand and do not chain it to my neck. I seek protection with You against the cutting sections of hell.’ He then wiped his head and said, ‘O Lord, cover me up with Your mercy, blessings and forgiveness.’ He then wiped his feet and said, ‘O Lord, keep my foot firm on the bridge on the Day when feet slip and make my deeds gain Your happiness in my favor.’ He then turned to Muhammad and said, ‘O Muhammad, if one takes Wudu’ the way I did and says what I said, Allah creates from every drop of water an angel who glorifies, says Tasbih, Takbir and Tahlil of Allah and the reward for this is written in favor of the person taking Wudu’.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح على الظاهر    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/198)"
        ],
        "index": 4116,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/355",
              "text": "ابْنِ رِئَابٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1661",
              "text": "مُحَمَّدِ بْنِ قَيْسٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:46:7",
        "text": [
          " سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ وَ هُوَ يُحَدِّثُ النَّاسَ بِمَكَّةَ صَلَّى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْفَجْرَ ثُمَّ جَلَسَ مَعَ أَصْحَابِهِ حَتَّى طَلَعَتِ الشَّمْسُ فَجَعَلَ يَقُومُ الرَّجُلُ بَعْدَ الرَّجُلِ حَتَّى لَمْ يَبْقَ مَعَهُ إِلَّا رَجُلَانِ أَنْصَارِيٌّ وَ ثَقَفِيٌّ فَقَالَ لَهُمَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَدْ عَلِمْتُ أَنَّ لَكُمَا حَاجَةً وَ تُرِيدَانِ أَنْ تَسْأَلَا عَنْهَا فَإِنْ شِئْتُمَا أَخْبَرْتُكُمَا بِحَاجَتِكُمَا قَبْلَ أَنْ تَسْأَلَانِي وَ إِنْ شِئْتُمَا فَاسْأَلَا عَنْهَا قَالَا بَلْ تُخْبِرُنَا قَبْلَ أَنْ نَسْأَلَكَ عَنْهَا فَإِنَّ ذَلِكَ أَجْلَى لِلْعَمَى وَ أَبْعَدُ مِنَ الِارْتِيَابِ وَ أَثْبَتُ لِلْإِيمَانِ ",
          "فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَمَّا أَنْتَ يَا أَخَا ثَقِيفٍ فَإِنَّكَ جِئْتَ أَنْ تَسْأَلَنِي عَنْ وُضُوئِكَ وَ صَلَاتِكَ مَا لَكَ فِي ذَلِكَ مِنَ الْخَيْرِ أَمَّا وُضُوؤُكَ فَإِنَّكَ إِذَا وَضَعْتَ يَدَكَ فِي إِنَائِكَ ثُمَّ قُلْتَ بِسْمِ اللَّهِ تَنَاثَرَتْ مِنْهَا مَا اكْتَسَبَتْ مِنَ الذُّنُوبِ فَإِذَا غَسَلْتَ وَجْهَكَ تَنَاثَرَتِ الذُّنُوبُ الَّتِي اكْتَسَبَتْهَا عَيْنَاكَ بِنَظَرِهِمَا وَ فُوكَ فَإِذَا غَسَلْتَ ذِرَاعَيْكَ تَنَاثَرَتِ الذُّنُوبُ عَنْ يَمِينِكَ وَ شِمَالِكَ فَإِذَا مَسَحْتَ رَأْسَكَ وَ قَدَمَيْكَ تَنَاثَرَتِ الذُّنُوبُ الَّتِي مَشَيْتَ إِلَيْهَا عَلَى قَدَمَيْكَ فَهَذَا لَكَ فِي وُضُوئِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Mahboub, from Ibn Raib, from Muhammad Bin Qays who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying, and he<sup>asws</sup> was narrating to the people in Makkah: ‘Rasool-Allah<sup>saww</sup> prayed the Fajr <span class=\"iTxt\">Salaat</span>, then sat along with his<sup>saww</sup> companions until the sun emerged. So the man after the man arose until there did not remain with him<sup>saww</sup> anyone except for two man, one from the ‘Helpers’ and one from ‘Saqeef’. So Rasool-Allah<sup>saww</sup> said to them both: ‘I<sup>saww</sup> know that there is a need for the two of you that you would like to ask about it. So if you two want I<sup>saww</sup> can inform both of you before you even ask me<sup>saww</sup>, and if you want you can both ask me yourselves about it’. They both said, ‘But, inform us before we ask you about it, for that is more clarifying for the blindness, and more remote from the doubts, and more affirming for the faith’.",
            "Rasool-Allah<sup>saww</sup> said: ‘As for you, O brother of Saqeef, so you came over to ask me<sup>saww</sup> about your Ablution <span class=\"iTxt\">(Wudhu)</span> and your <span class=\"iTxt\">Salaat</span>, what there is for you regarding that from the goodness. As for your Ablution <span class=\"iTxt\">(Wudhu)</span>, so you, when you place your hand into your container, then you say, ‘In the Name of Allah<sup>azwj</sup>’, there scatter from it what you accumulated from the sins. So when you wash your face, the sins which your eyes had accumulated with their looks, scatter away from you and are lost. So when you wash your arms, the sins which your right hand and your left hand had accumulated, scatter away from you. So when you wipe your head and your feet, the sins which you walked towards upon your feet scatter away from you. So this is for you from your Ablution <span class=\"iTxt\">(Wudhu)</span>’."
          ],
          "en.sarwar": [
            "7. A number of our people have narrated from Ahmad ibn Muhammad from ibn Mahbub from ibn Ri’ab from Muhammad ibn Qays who has said the following: “I heard abu Ja‘far, ‘Alayhi al-Salam, say while speaking to people in Makkah, ‘One day the Messenger of Allah completed his Salah (prayer) of the morning and sat in the Masjid with his companions until sunrise. Thereafter, people one by one left the Masjid except two men, one from the people of Ansar and the other from Thaqif. The Messenger of Allah then said to them, “I understand you need to ask me questions. You may ask if you like and I will answer. If you like, I can tell you what your questions are before you ask. If you wish, you may ask me.” They said, “Please inform us before we ask you our questions; it is more enlightening, frees us from doubts and strengthens our belief more.” The Messenger of Allah then said, “You, gentleman from Thaqif, have come to ask me about your Wudu’ and Salah (prayer) regarding what is good for you in them. You should keep in mind that when you place your hand in your water container and say ‘In the name of Allah’ the sins that your hands may have committed scatter away from you. The sins that your eyes and mouth may have committed scatter away from you when you wash your face. When you wash your arms to your elbows, the sins from your left and right scatter away from you. When you wipe your head and feet the sins into which you may have walked scatter away from you. This is what you gain from your Wudu’.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/198)"
        ],
        "index": 4117,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/38",
              "text": "النَّوْفَلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/39",
              "text": "السَّكُونِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:46:8",
        "text": [
          " الْوُضُوءُ شَطْرُ الْإِيمَانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "(Please note that the full Hadeeth is to be found in Al Kafi – V 4 – The Book of Hajj Ch 28 H 37, for the answer to the second man)",
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Ablution <span class=\"iTxt\">(Wudhu)</span> is part of the <span class=\"iTxt\">Emaan</span> (faith)’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Wudu’ is part of belief.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/198)"
        ],
        "index": 4118,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/18",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/71",
              "text": "إِسْمَاعِيلَ بْنِ مِهْرَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2184",
              "text": "صَبَّاحٍ الْحَذَّاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/305",
              "text": "سَمَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ بَعْضِ أَصْحَابِنَا عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ صَبَّاحٍ الْحَذَّاءِ عَنْ سَمَاعَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:46:9",
        "text": [
          " كُنْتُ عِنْدَ أَبِي الْحَسَنِ ( عليه السلام ) فَصَلَّى الظُّهْرَ وَ الْعَصْرَ بَيْنَ يَدَيَّ وَ جَلَسْتُ عِنْدَهُ حَتَّى حَضَرَتِ الْمَغْرِبُ فَدَعَا بِوَضُوءٍ فَتَوَضَّأَ لِلصَّلَاةِ ثُمَّ قَالَ لِي تَوَضَّأْ فَقُلْتُ جُعِلْتُ فِدَاكَ أَنَا عَلَى وُضُوئِي فَقَالَ وَ إِنْ كُنْتَ عَلَى وُضُوءٍ إِنَّ مَنْ تَوَضَّأَ لِلْمَغْرِبِ كَانَ وُضُوؤُهُ ذَلِكَ كَفَّارَةً لِمَا مَضَى مِنْ ذُنُوبِهِ فِي يَوْمِهِ إِلَّا الْكَبَائِرَ وَ مَنْ تَوَضَّأَ لِلصُّبْحِ كَانَ وُضُوؤُهُ ذَلِكَ كَفَّارَةً لِمَا مَضَى مِنْ ذُنُوبِهِ فِي لَيْلَتِهِ إِلَّا الْكَبَائِرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from one of our companions, from Ismail Bin Mihran, from Sabbah Al Haza’a, from Sama’at who said, ",
            "‘I was in the presence of Abu Al-Hassan<sup>asws</sup>. So he<sup>asws</sup> prayed Al-Zohar and Al-Asr <span class=\"iTxt\">Salaat</span>s in front of me, and I sat in his<sup>asws</sup> present until the Maghrib <span class=\"iTxt\">Salaat</span> presented itself. So he<sup>asws</sup> called for the Ablution <span class=\"iTxt\">(Wudhu)</span> and he<sup>asws</sup> performed the Ablution <span class=\"iTxt\">(Wudhu)</span> for the <span class=\"iTxt\">Salaat</span>, then said to me: ‘Perform Ablution <span class=\"iTxt\">(Wudhu)</span>’. So I said, ‘May I be sacrificed for you<sup>asws</sup>! I am already upon my Ablution <span class=\"iTxt\">(Wudhu)</span>’’. So he<sup>asws</sup> said: ‘And even if you were upon an Ablution <span class=\"iTxt\">(Wudhu)</span>. It is from the reverence of the Maghrib (<span class=\"iTxt\">Salaat</span>) is its Ablution <span class=\"iTxt\">(Wudhu)</span>. That would be an expiation for whatever has passed from his sins during his day, except for the major sins. And the one who perform Ablution <span class=\"iTxt\">(Wudhu)</span> for the morning (<span class=\"iTxt\">Salaat</span>), that Ablution <span class=\"iTxt\">(Wudhu)</span> of his would be an expiation for whatever had passed from his sins during his night except for the major sins’."
          ],
          "en.sarwar": [
            "9. Abu Ali al-Ash’ariy has narrated from certain persons of our people from ’Isma‘il ibn Mehran from Sabbah al-ffadhdha’ from Sama‘ah who has said the following: “I once was in the presence of abu al-Hassan, ‘Alayhi al-Salam, and he (the Imam) performed al-Dhuhr and al-‘Asr Salah (prayer) before me. I remained in his presence until al-Maghrib. He (the Imam) asked for Wudu’ (water) and he took Wudu’ for al-Maghrib Salah (prayer), then said to me, ‘You need to take Wudu’. 5 I said, ‘I pray to Allah to keep my soul in service for your cause, my Wudu’ is still valid.’ He (the Imam) said, ‘Even so you should take Wudu’; to those who take Wudu’ for al-Maghrib it serves as expiation for the sins that they may have done during that day except the major sins. Taking Wudu’ in the morning serves as expiation for the sins that one had committed during the night before except the major sins.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/199)"
        ],
        "index": 4119,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/16",
              "text": "أَحْمَدُ بْنُ إِدْرِيسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/140",
              "text": "أَحْمَدَ بْنِ إِسْحَاقَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/539",
              "text": "سَعْدَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/42",
              "text": "بَعْضِ أَصْحَابِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى وَ أَحْمَدُ بْنُ إِدْرِيسَ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ سَعْدَانَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:46:10",
        "text": [
          " الطُّهْرُ عَلَى الطُّهْرِ عَشْرُ حَسَنَاتٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya and Ahmad bin Idrees, from Ahmad Bin Is’haq, from Sa’dan, from one of his companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The purification upon the purity has ten Rewards’."
          ],
          "en.sarwar": [
            "10. Muhammad ibn Yahya and Ahmad ibn Idris have narrated from Ahmad ibn Ishaq from Sa‘dan from certain persons of his people who have said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘For having al-Tuhr (cleansing) over al-Tuhr one receives a reward for ten good deeds.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/199)"
        ],
        "index": 4120,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/75",
              "text": "مُحَمَّدُ بْنُ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/109",
              "text": "غَيْرُهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2417",
              "text": "سَهْلِ بْنِ زِيَادٍ بِإِسْنَادِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ الْحَسَنِ وَ غَيْرُهُ عَنْ سَهْلِ بْنِ زِيَادٍ بِإِسْنَادِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:46:11",
        "text": [
          " إِذَا فَرَغَ أَحَدُكُمْ مِنْ وُضُوئِهِ فَلْيَأْخُذْ كَفّاً مِنْ مَاءٍ فَلْيَمْسَحْ بِهِ قَفَاهُ يَكُونُ ذَلِكَ فَكَاكَ رَقَبَتِهِ مِنَ النَّارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Hassan, and someone else from Sahl Bin Ziyad, by his chain, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When one of you is free from his Ablution <span class=\"iTxt\">(Wudhu)</span>, so let him take a handful of water, so let him wipe his wrist for that would happen to be the freedom of his neck from the Fire’."
          ],
          "en.sarwar": [
            "11. Muhammad ibn al-Hassan and others have narrated from Sahl ibn Ziyad through the chain of his narrators who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘When anyone of you completes his Wudu’, he must take water in his palm and wipe with it his back; it will free his neck from the fire.’” (This perhaps is because of Taqiyah) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/199)"
        ],
        "index": 4121,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/351",
              "text": "أَبِي الْحَسَنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:46:12",
        "text": [
          " قُلْتُ لَهُ الرَّجُلُ يَغْتَسِلُ بِمَاءِ الْوَرْدِ وَ يَتَوَضَّأُ بِهِ لِلصَّلَاةِ قَالَ لَا بَأْسَ بِذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Muhammad Bin Isa, from Yunus, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘The man washes with the rose water and performs Ablution <span class=\"iTxt\">(Wudhu)</span> with it for the <span class=\"iTxt\">Salaat</span>’. He<sup>asws</sup> said: ‘There is no problem with that’."
          ],
          "en.sarwar": [
            "12. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Muhammad ibn ‘Isa from Yunus who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about a man who takes Wudu’ with water of roses for Salah (prayer). He (the Imam) said, ‘It is not harmful.’” (Fatwa best explains this Hadith.) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/200)"
        ],
        "index": 4122,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/603",
              "text": "صَفْوَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2418",
              "text": "عَبْدِ الْوَهَّابِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1968",
              "text": "مُحَمَّدِ بْنِ أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/110",
              "text": "هِشَامِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1422",
              "text": "إِسْمَاعِيلَ الْجُعْفِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ عَبْدِ الْوَهَّابِ عَنْ مُحَمَّدِ بْنِ أَبِي حَمْزَةَ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ إِسْمَاعِيلَ الْجُعْفِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:46:13",
        "text": [
          " سَأَلْتُهُ عَمَّنْ مَسَّ عَظْمَ الْمَيِّتِ قَالَ إِذَا كَانَ سَنَةٌ فَلَيْسَ بِهِ بَأْسٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Abdul Wahhab, from Muhammad Bin Abu Hamza, from Hisham Bin Salim, from Ismail Al Ju’fy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the one who touches a bone of a deceased. He<sup>asws</sup> said: ‘When it was a year old, so there is no problem with it’."
          ],
          "en.sarwar": [
            "13. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan from ‘Abd al-Wahhab from Muhammad ibn abu Hamzah from Hisham ibn Salim from ’Isma‘il al-Ju’fiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about touching the bones of a dead person. He (the Imam) said, ‘If it is after one year, it is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/200)"
        ],
        "index": 4123,
        "local_index": 14,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/111",
              "text": "أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى رَفَعَهُ عَنْ أَبِي حَمْزَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:46:14",
        "text": [
          " قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) إِذَا كَانَ الرَّجُلُ نَائِماً فِي الْمَسْجِدِ الْحَرَامِ أَوْ مَسْجِدِ الرَّسُولِ ( صلى الله عليه وآله ) فَاحْتَلَمَ فَأَصَابَتْهُ جَنَابَةٌ فَلْيَتَيَمَّمْ وَ لَا يَمُرَّ فِي الْمَسْجِدِ إِلَّا مُتَيَمِّماً حَتَّى يَخْرُجَ مِنْهُ ثُمَّ يَغْتَسِلَ وَ كَذَلِكَ الْحَائِضُ إِذَا أَصَابَهَا الْحَيْضُ تَفْعَلُ كَذَلِكَ وَ لَا بَأْسَ أَنْ يَمُرَّا فِي سَائِرِ الْمَسَاجِدِ وَ لَا يَجْلِسَانِ فِيهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, raising it, from Abu Hamza who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘When a man was asleep in the Sacred Masjid or Masjid of the Rasool<sup>saww</sup> and he bed-wets and is hit by the sexual impurity, so let him perform <span class=\"iTxt\">Tayammum</span>, and he should not pass in the Masjid except while being in <span class=\"iTxt\">Tayammum</span> until he exits from it, then he should wash. And similar to that is the menstruating woman when the menstruation hits her, she should do like that; and there is not problem if he were to pass by in the rest of the Masjids and does not sit in it’."
          ],
          "en.sarwar": [
            "14. Muhammad ibn Yahya has narrated in a marfu‘ manner from abu Hamzah who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘If one sleeps in Masjid al-Haram or Masjid of the Messenger of Allah and experiences wet dream, one must take Tayammum and must not pass through the Masjid without Tayammum until one is out of the Masjid, then take Ghusl (bath). This applies to one experiencing Hayd (menses) also and she must take Tayammum as mentioned. In the case of other Masjid, passing through them in such conditions is permissible but such people must not sit in them with such conditions.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/201)"
        ],
        "index": 4124,
        "local_index": 15,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/104",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/504",
              "text": "وُهَيْبِ بْنِ حَفْصٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ وُهَيْبِ بْنِ حَفْصٍ عَنْ أَبِي بَصِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:46:15",
        "text": [
          " سَأَلْتُهُ عَنْ حَيَّةٍ دَخَلَتْ حُبّاً فِيهِ مَاءٌ وَ خَرَجَتْ مِنْهُ قَالَ إِنْ وَجَدَ مَاءً غَيْرَهُ فَلْيُهَرِقْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Wuheyb Bin Hafs, from Abu Baseer who said, ",
            "‘I asked him<sup>asws</sup> about a snake which enters into a container of water and exits from it. He<sup>asws</sup> said: ‘If you can find water other than it, so spill it’."
          ],
          "en.sarwar": [
            "15. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Wuhayb ibn Hafs from abu Basir who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about the case of a snake that enters in a Hub (large water container) which has water in it and then comes out. He (the Imam) said, ‘If one can find other water it should be spilled away.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/201)"
        ],
        "index": 4125,
        "local_index": 16,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/612",
              "text": "الْعَمْرَكِيِّ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/613",
              "text": "عَلِيِّ بْنِ جَعْفَرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1223",
              "text": "أَخِيهِ أَبِي الْحَسَنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنِ الْعَمْرَكِيِّ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَخِيهِ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:46:16",
        "text": [
          " سَأَلْتُهُ عَنْ رَجُلٍ رَعَفَ فَامْتَخَطَ فَصَارَ بَعْضُ ذَلِكَ الدَّمِ قِطَعاً صِغَاراً فَأَصَابَ إِنَاءَهُ هَلْ يَصْلُحُ لَهُ الْوُضُوءُ مِنْهُ فَقَالَ إِنْ لَمْ يَكُنْ شَيْ‏ءٌ يَسْتَبِينُ فِي الْمَاءِ فَلَا بَأْسَ وَ إِنْ كَانَ شَيْئاً بَيِّناً فَلَا يَتَوَضَّأْ مِنْهُ ",
          "قَالَ وَ سَأَلْتُهُ عَنْ رَجُلٍ رَعَفَ وَ هُوَ يَتَوَضَّأُ فَيَقْطُرُ قَطْرَةٌ فِي إِنَائِهِ هَلْ يَصْلُحُ الْوُضُوءُ مِنْهُ قَالَ لَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Al Amraky Bin Ali, ",
            "(It has been narrated) from Ali son of Ja’far<sup>asws</sup>, from his brother<sup>asws</sup> Abu Al-Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man with nose bleed, so he cleared it by blowing, so some of that blood came to be in small pieces and hit a water container. Is it correct for him to perform Ablution <span class=\"iTxt\">(Wudhu)</span> from it?’ So he<sup>asws</sup> said: ‘If there does not happen to be anything which is apparent in the water, so there is no problem; but if there was something apparent, so he should not perform Ablution <span class=\"iTxt\">(Wudhu)</span> from it’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about a man with nose bleed, and he is performing Ablution <span class=\"iTxt\">(Wudhu)</span>, so a drop drops into his water container. Is it correct to do the Ablution <span class=\"iTxt\">(Wudhu)</span> from it?’ He<sup>asws</sup> said: ‘No’."
          ],
          "en.sarwar": [
            "16. Muhammad ibn Yahya has narrated from al-‘Amrakiy ibn Ali from Ali ibn Ja‘far from his brother abu al-Hassan, ‘Alayhi al-Salam has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about the case of one who had a nosebleed; then he blew his nose and parts of it became small segments which came in contact with his water container. Can he take Wudu’ with such water? He (the Imam) said, ’If nothing is visible in the water container it is not harmful. However, if things show in it he must not use it for Wudu’. 5 I (the narrator) then asked him (the Imam) about a man who has nosebleed while taking Wudu’ and a drop falls in his water container. Can he take Wudu 5 with such water? He (the Imam) said, ‘No, he cannot take Wudu’ with such water.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/201)"
        ],
        "index": 4126,
        "local_index": 17,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/566",
              "text": "الْبَرْقِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/565",
              "text": "سَعْدِ بْنِ سَعْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/603",
              "text": "صَفْوَانَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْبَرْقِيِّ عَنْ سَعْدِ بْنِ سَعْدٍ عَنْ صَفْوَانَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:1:46:17",
        "text": [
          " سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنْ رَجُلٍ احْتَاجَ إِلَى الْوُضُوءِ لِلصَّلَاةِ وَ هُوَ لَا يَقْدِرُ عَلَى الْمَاءِ فَوَجَدَ بِقَدْرِ مَا يَتَوَضَّأُ بِهِ بِمِائَةِ دِرْهَمٍ أَوْ بِأَلْفِ دِرْهَمٍ وَ هُوَ وَاجِدٌ لَهَا يَشْتَرِي وَ يَتَوَضَّأُ أَوْ يَتَيَمَّمُ قَالَ لَا بَلْ يَشْتَرِي قَدْ أَصَابَنِي مِثْلُ ذَلِكَ فَاشْتَرَيْتُ وَ تَوَضَّأْتُ وَ مَا يُشْتَرَى بِذَلِكَ مَالٌ كَثِيرٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Barqy, from Sa’ad Bin Sa’ad, from Safwan who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about a man who is needy to the Ablution <span class=\"iTxt\">(Wudhu)</span> for the <span class=\"iTxt\">Salaat</span>, and he is not able upon the water. So he finds it of a measurement of what he can perform Ablution <span class=\"iTxt\">(Wudhu)</span> with for one hundred Dirhams or for a thousand Dirhams, and he can find (the money) for it. Should he buy and perform Ablution <span class=\"iTxt\">(Wudhu)</span> or perform <span class=\"iTxt\">Tayammum</span>?’ He<sup>asws</sup> said: ‘No, but he should buy. I<sup>asws</sup> had come across the like of that, so I<sup>asws</sup> bought and performed Ablution <span class=\"iTxt\">(Wudhu)</span>; and whatever he buys with that wealth, is a lot’."
          ],
          "en.sarwar": [
            "17. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Barqiy from Sa‘d ibn Sa‘d from Safwan who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about a man who needs to take Wudu’ for Salah (prayer). However, he is not able to find water. He finds a certain amount of water which is enough for his Wudu’ but it costs one hundred dirham or one thousand dirham. He has that much dirham to buy and take Wudu’, should he buy the water or instead take Tayammum? He (the Imam) said, ‘No, he must buy. This kind of thing has happened to me and I bought water to take Wudu’. What is bought (in this case) is a great deal.’” (For such Ahadith about an act or issue of the five categories of deeds the qualities such as Wujub, (Obligatory), Hurmat (Prohibited), Istihbab (Preference), Kirahat (Detestability) or Ibahah (Permissibility) one must consult fatwas of one’s Mujtahid.) "
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "هَذَا آخِرُ كِتَابِ الطَّهَارَةِ مِنْ كِتَابِ الْكَافِي وَ هُوَ خَمْسَةٌ وَ أَرْبَعُونَ بَاباً وَ يَتْلُوهُ كِتَابُ الْحَيْضِ إِنْ شَاءَ اللَّهُ تَعَالَى."
        ],
        "translations": {
          "en.hubeali": [
            "The is the end of the Book of Cleanliness from the Book Al Kafi, and it is of forty six Chapters, and it would be followed by the Book of Menstruation, Allah<sup>azwj</sup> Willing."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:1:46",
  "kind": "verse_list"
}