{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:2:4", "titles": {"ar": "كِتَابُ الْعِشْرَةِ", "en": "THE BOOK OF SOCIAL RELATIONSHIPS"}}, {"indexed_titles": {"en": "Chapter 11"}, "path": "/books/al-kafi:2:4:11", "titles": {"ar": "بَابُ التَّسْلِيمِ عَلَى أَهْلِ الْمِلَلِ", "en": "Chapter 11 – The greeting (السَّلَامُ) upon the people of the (other) Religions"}}], "index": 482, "local_index": 11, "part_type": "Chapter", "path": "/books/al-kafi:2:4:11", "titles": {"ar": "بَابُ التَّسْلِيمِ عَلَى أَهْلِ الْمِلَلِ", "en": "Chapter 11 – The greeting (السَّلَامُ) upon the people of the (other) Religions"}, "verse_count": 12, "verse_start_index": 3643, "verses": [{"index": 3644, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:4:11:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ دَخَلَ يَهُودِيٌّ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ عَائِشَةُ عِنْدَهُ فَقَالَ السَّامُ عَلَيْكُمْ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَلَيْكُمْ ثُمَّ دَخَلَ آخَرُ فَقَالَ مِثْلَ ذَلِكَ فَرَدَّ عَلَيْهِ كَمَا رَدَّ عَلَى صَاحِبِهِ ثُمَّ دَخَلَ آخَرُ فَقَالَ مِثْلَ ذَلِكَ فَرَدَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كَمَا رَدَّ عَلَى صَاحِبَيْهِ \nفَغَضِبَتْ عَائِشَةُ فَقَالَتْ عَلَيْكُمُ السَّامُ وَ الْغَضَبُ وَ اللَّعْنَةُ يَا مَعْشَرَ الْيَهُودِ يَا إِخْوَةَ الْقِرَدَةِ وَ الْخَنَازِيرِ فَقَالَ لَهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَا عَائِشَةُ إِنَّ الْفُحْشَ لَوْ كَانَ مُمَثَّلًا لَكَانَ مِثَالَ سَوْءٍ إِنَّ الرِّفْقَ لَمْ يُوضَعْ عَلَى شَيْ‏ءٍ قَطُّ إِلَّا زَانَهُ وَ لَمْ يُرْفَعْ عَنْهُ قَطُّ إِلَّا شَانَهُ \nقَالَتْ يَا رَسُولَ اللَّهِ أَ مَا سَمِعْتَ إِلَى قَوْلِهِمْ السَّامُ عَلَيْكُمْ فَقَالَ بَلَى أَ مَا سَمِعْتِ مَا رَدَدْتُ عَلَيْهِمْ قُلْتُ عَلَيْكُمْ فَإِذَا سَلَّمَ عَلَيْكُمْ مُسْلِمٌ فَقُولُوا سَلَامٌ عَلَيْكُمْ وَ إِذَا سَلَّمَ عَلَيْكُمْ كَافِرٌ فَقُولُوا عَلَيْكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from IbnAzina, from Zurara, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘A Jew came over to Rasool-Allah<sup>saww</sup>, and Ayesha was in his<sup>saww</sup> presence. So he said, ‘<span class=\"iTxt\">Al-Saam Alaykum</span>!’ (The poison be upon you). So Rasool-Allah<sup>saww</sup> said: ‘Upon you (as well)’. Then another (Jew) came over and said similar to that. So he<sup>saww</sup> replied to him just as he<sup>saww</sup> has replied upon his companion. Then another came over, and he said similar to that’. So Rasool-Allah<sup>saww</sup> replied just as he<sup>saww</sup> had replied upon his two companions.\nSo Ayesha got angered and she said, ‘And upon you be the posion, and the Wrath, and the Curse, O community of the Jews, O brethren of the monkeys and the pigs!’. So Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> said to her: ‘O Ayesha! If there was a resemblance of the obscenity, it would have been an evil resemblance. The kindness is not placed upon anything at all except that it would adorn it, and it would not be raised from it at all except that it would dishonour it’. \nShe said, ‘O Rasool-Allah<sup style=\"font-weight: normal\">saww</sup>! Did you<sup style=\"font-weight: normal\">saww</sup> not listen to their speech, ‘The poison be upon you!?’ So he<sup style=\"font-weight: normal\">saww</sup> said: ‘Yes, I<sup style=\"font-weight: normal\">saww</sup> did. But, did you not listen to what I<sup style=\"font-weight: normal\">saww</sup> replied upon them? I<sup style=\"font-weight: normal\">saww</sup> said: ‘Upon you (as well)’. So, whenever a Muslim greets upon you, so be saying, ‘<span class=\"iTxt\">Salaam Alaykum</span>’, and when a disbeliever greets upon you, so be saying, ‘<span class=\"iTxt\">Alayka</span>’ (the same Upon you)’."}]}, {"index": 3645, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:4:11:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ غِيَاثِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) لَا تَبْدَءُوا أَهْلَ الْكِتَابِ بِالتَّسْلِيمِ وَ إِذَا سَلَّمُوا عَلَيْكُمْ فَقُولُوا وَ عَلَيْكُمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammd Bin Isa, from Muhammad Bin Yahya, from Giyas Bin Ibrahim, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘Do not initiate the People of the Book (Jews and Christians) with the greeting (السَّلَامُ); and when they greet upon you, so (you should) be saying, ‘<span class=\"iTxt\">Wa Alaykum</span>’ (And upon you)’."}]}, {"index": 3646, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:2:4:11:3", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْيَهُودِيِّ وَ النَّصْرَانِيِّ وَ الْمُشْرِكِ إِذَا سَلَّمُوا عَلَى الرَّجُلِ وَ هُوَ جَالِسٌ كَيْفَ يَنْبَغِي أَنْ يَرُدَّ عَلَيْهِمْ فَقَالَ يَقُولُ عَلَيْكُمْ.", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from usman Bin Isa, from Sama’at who said, \n‘I asked Abu Abdullah<sup>asws</sup> about the Jews and the Christians, and the Polytheists, when they greet upon the man while he is seated, how it is befitting that he replies upon them?’ So he<sup>asws</sup> said: ‘He should be saying, ‘<span class=\"iTxt\">Alaykum</span>’ (Upon you)’."}]}, {"index": 3647, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:2:4:11:4", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ بُرَيْدِ بْنِ مُعَاوِيَةَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا سَلَّمَ عَلَيْكَ الْيَهُودِيُّ وَ النَّصْرَانِيُّ وَ الْمُشْرِكُ فَقُلْ عَلَيْكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr, from Bureyd Bin Muawiya, from Muhammad Bin Muslim, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whenever the Jew and the Christian, and the Polytheist greets upon you, so say, ‘<span class=\"iTxt\">Alayk</span>’ (Upon you)’."}]}, {"index": 3648, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:2:4:11:5", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ أَقْبَلَ أَبُو جَهْلِ بْنُ هِشَامٍ وَ مَعَهُ قَوْمٌ مِنْ قُرَيْشٍ فَدَخَلُوا عَلَى أَبِي طَالِبٍ فَقَالُوا إِنَّ ابْنَ أَخِيكَ قَدْ آذَانَا وَ آذَى آلِهَتَنَا فَادْعُهُ وَ مُرْهُ فَلْيَكُفَّ عَنْ آلِهَتِنَا وَ نَكُفُّ عَنْ إِلَهِهِ قَالَ فَبَعَثَ أَبُو طَالِبٍ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَدَعَاهُ \nفَلَمَّا دَخَلَ النَّبِيُّ ( صلى الله عليه وآله ) لَمْ يَرَ فِي الْبَيْتِ إِلَّا مُشْرِكاً فَقَالَ السَّلَامُ عَلَى مَنِ اتَّبَعَ الْهُدَى ثُمَّ جَلَسَ فَخَبَّرَهُ أَبُو طَالِبٍ بِمَا جَاءُوا لَهُ فَقَالَ أَ وَ هَلْ لَهُمْ فِي كَلِمَةٍ خَيْرٍ لَهُمْ مِنْ هَذَا يَسُودُونَ بِهَا الْعَرَبَ وَ يَطَئُونَ أَعْنَاقَهُمْ \nفَقَالَ أَبُو جَهْلٍ نَعَمْ وَ مَا هَذِهِ الْكَلِمَةُ فَقَالَ تَقُولُونَ لَا إِلَهَ إِلَّا اللَّهُ \nقَالَ فَوَضَعُوا أَصَابِعَهُمْ فِي آذَانِهِمْ وَ خَرَجُوا هُرَّاباً وَ هُمْ يَقُولُونَ ما سَمِعْنا بِهذا فِي الْمِلَّةِ الْآخِرَةِ إِنْ هذا إِلَّا اخْتِلاقٌ فَأَنْزَلَ اللَّهُ تَعَالَى فِي قَوْلِهِمْ ص وَ الْقُرْآنِ ذِي الذِّكْرِ إِلَى قَوْلِهِ إِلَّا اخْتِلاقٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Salim, from Ahmad Bin Muhammad Bin Abu Nasr, from Amro Bin Shimr, from Jabir, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Abu Jahl Bin Hisham, and with him were a group from Qureysh, came over to Abu Talib<sup>as</sup>, and they said, ‘The son<sup>saww</sup> of your<sup>as</sup> brother<sup>as</sup> has harmed us and harmed our gods, therefore instruct him<sup>as</sup> to restrain from our gods, and we would restrain from his<sup>saww</sup> God<sup>azwj</sup>’. So Abu Talib<sup>as</sup> sent a message to Rasool-Allah<sup>saww</sup>, to call him<sup>saww</sup> over.\nSo when the Prophet<sup>saww</sup> came over, he<sup>saww</sup> did not see in the room except for the Polytheists. So he<sup>saww</sup> said: ‘Greetings be upon the one who follows the Guidance!’. Then he<sup>saww</sup> was seated. So Abu Talib<sup>as</sup> informed him<sup>saww</sup> with what (proposal) they had come over with to him<sup>as</sup>. So he<sup>saww</sup> said: ‘Or shall I<sup>saww</sup> give a solution for them in a statement (There is no god except Allah<sup>azwj</sup>), which is good for them, by which they would be prevailing upon the Arabs and treading on their necks?’ \nSo Abu Jahl said, ‘Yes, and what is this statement?’ So he<sup style=\"font-weight: normal\">saww</sup> said: ‘You should be saying, ‘There is no god except Allah<sup style=\"font-weight: normal\">azwj</sup>’’. \nHe<sup>asws</sup> said: ‘So they placed their fingers in their ears and went out fleeing, and they were saying, ‘We were not made to hear this in the former nations. This is nothing except for a fabrication’. So Allah<sup>azwj</sup> the Exalted Revealed regarding their words <span class=\"ibTxt\">[38:1] Saad. I Swear by the Quran, full of Remembrance</span> – up to His<sup>azwj</sup> Words <span class=\"ibTxt\">[38:7] this is nothing but a fabrication</span>’."}]}, {"index": 3649, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:2:4:11:6", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تَقُولُ فِي الرَّدِّ عَلَى الْيَهُودِيِّ وَ النَّصْرَانِيِّ سَلَامٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Abdullah Bin Muhammad, from Ali Bin Al Hakam, from Aban Bin usman, from Zurara, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘You should be saying in reply upon the (greeting of the) Jew and the Christian, ‘(السَّلَامُ)’."}]}, {"index": 3650, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:2:4:11:7", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ قُلْتُ لِأَبِي الْحَسَنِ مُوسَى ( عليه السلام ) أَ رَأَيْتَ إِنِ احْتَجْتُ إِلَى مُتَطَبِّبٍ وَ هُوَ نَصْرَانِيٌّ أُسَلِّمُ عَلَيْهِ وَ أَدْعُو لَهُ قَالَ نَعَمْ إِنَّهُ لَا يَنْفَعُهُ دُعَاؤُكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajaj who said, \n‘I said to Abu Al-Hassan Musa<sup>asws</sup>, ‘What is your<sup>asws</sup> view, if I was needy to a physician and he was a Christian, should I greet upon him and supplicate for him?’ He<sup>asws</sup> said: ‘Yes, (but) your supplication will not benefit him’."}]}, {"index": 3651, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:2:4:11:8", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ قُلْتُ لِأَبِي الْحَسَنِ مُوسَى ( عليه السلام ) أَ رَأَيْتَ إِنِ احْتَجْتُ إِلَى الطَّبِيبِ وَ هُوَ نَصْرَانِيٌّ أَنْ أُسَلِّمَ عَلَيْهِ وَ أَدْعُوَ لَهُ قَالَ نَعَمْ إِنَّهُ لَا يَنْفَعُهُ دُعَاؤُكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from Abdul Rahman Bin Al Hajjaj who said, \n‘I said to Abu Al-Hassan Musa<sup>asws</sup>, ‘What is your<sup>asws</sup> view if I was needy to the physician and he was a Christian, should I greet (السَّلَامُ) upon him and supplicate for him?’ He<sup>asws</sup> said: ‘Yes, (but) your supplication will not benefit him’."}]}, {"index": 3652, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:2:4:11:9", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ مُحَمَّدِ بْنِ عَرَفَةَ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ قِيلَ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) كَيْفَ أَدْعُو لِلْيَهُودِيِّ وَ النَّصْرَانِيِّ قَالَ تَقُولُ لَهُ بَارَكَ اللَّهُ لَكَ فِي الدُّنْيَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Isa Bin Ubeyd, from Muhammad Bin Arafa, \n(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup> having said: ‘It was said to Abu Abdullah<sup>asws</sup>, ‘How should I supplicate for the Jew and the Christian?’ He<sup>asws</sup> said: ‘You should be saying to him, ‘May Allah<sup>azwj</sup> Bless you in the world’’."}]}, {"index": 3653, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:2:4:11:10", "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ عَنْ وُهَيْبِ بْنِ حَفْصٍ عَنْ أَبِي بَصِيرٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي مُصَافَحَةِ الْمُسْلِمِ الْيَهُودِيَّ وَ النَّصْرَانِيَّ قَالَ مِنْ وَرَاءِ الثَّوْبِ فَإِنْ صَافَحَكَ بِيَدِهِ فَاغْسِلْ يَدَكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad, from Wuheyb Bin Hafs, from Abu Baseer, \n(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup> regarding the handshake of the Muslim for the Jew and the Christian. He<sup>asws</sup> said: ‘From behind a (piece of) cloth. So if he was to shake your hand, so wash your hand’."}]}, {"index": 3654, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:2:4:11:11", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنْ عَبَّاسِ بْنِ عَامِرٍ عَنْ عَلِيِّ بْنِ مَعْمَرٍ عَنْ خَالِدٍ الْقَلَانِسِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَلْقَى الذِّمِّيَّ فَيُصَافِحُنِي قَالَ امْسَحْهَا بِالتُّرَابِ وَ بِالْحَائِطِ قُلْتُ فَالنَّاصِبَ قَالَ اغْسِلْهَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Al Hassan Bin Ali Al Kufy, from Abbas Bin Aamir, from Ali Bin Ma’mar, from Khalid Al Qalanasy who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘I met the <span class=\"iTxt\">Zimmy</span> (Christian or Jew under the responsibility of the Islamic government), so he shook my hand’. He<sup>asws</sup> said: ‘Wipe it with the dust and with the wall’. I said, ‘So (what about) the <span class=\"iTxt\">Nasibi</span> (Hostile one)?’ Wash it’."}]}, {"index": 3655, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:2:4:11:12", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي رَجُلٍ صَافَحَ رَجُلًا مَجُوسِيّاً قَالَ يَغْسِلُ يَدَهُ وَ لَا يَتَوَضَّأُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding a man who shook the hand of a <span class=\"iTxt\">Majusi</span> (Magian) man. He<sup>asws</sup> said: ‘He should wash his hand and he does not have to perform ablution’."}]}]}, "index": "al-kafi:2:4:11", "kind": "verse_list"}