{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:2:4",
        "titles": {
          "ar": "كِتَابُ الْعِشْرَةِ",
          "en": "THE BOOK OF SOCIAL RELATIONSHIPS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 11"
        },
        "path": "/books/al-kafi:2:4:11",
        "titles": {
          "ar": "بَابُ التَّسْلِيمِ عَلَى أَهْلِ الْمِلَلِ",
          "en": "Chapter 11 – The greeting (السَّلَامُ) upon the people of the (other) Religions"
        }
      }
    ],
    "index": 482,
    "local_index": 11,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:2:4:12",
        "titles": {
          "ar": "بَابُ مُكَاتَبَةِ أَهْلِ الذِّمَّةِ",
          "en": "Chapter 12 – Contracts of the people under the responsibility (Ahl Al-Zimma)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 10"
        },
        "path": "/books/al-kafi:2:4:10",
        "titles": {
          "ar": "بَابُ التَّسْلِيمِ عَلَى النِّسَاءِ",
          "en": "Chapter 10 – The greeting upon the women"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:2:4",
        "titles": {
          "ar": "كِتَابُ الْعِشْرَةِ",
          "en": "THE BOOK OF SOCIAL RELATIONSHIPS"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:4:11",
    "titles": {
      "ar": "بَابُ التَّسْلِيمِ عَلَى أَهْلِ الْمِلَلِ",
      "en": "Chapter 11 – The greeting (السَّلَامُ) upon the people of the (other) Religions"
    },
    "verse_count": 12,
    "verse_start_index": 3643,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/545)"
        ],
        "index": 3644,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:11:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ دَخَلَ يَهُودِيٌّ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ عَائِشَةُ عِنْدَهُ فَقَالَ السَّامُ عَلَيْكُمْ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَلَيْكُمْ ثُمَّ دَخَلَ آخَرُ فَقَالَ مِثْلَ ذَلِكَ فَرَدَّ عَلَيْهِ كَمَا رَدَّ عَلَى صَاحِبِهِ ثُمَّ دَخَلَ آخَرُ فَقَالَ مِثْلَ ذَلِكَ فَرَدَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كَمَا رَدَّ عَلَى صَاحِبَيْهِ ",
          "فَغَضِبَتْ عَائِشَةُ فَقَالَتْ عَلَيْكُمُ السَّامُ وَ الْغَضَبُ وَ اللَّعْنَةُ يَا مَعْشَرَ الْيَهُودِ يَا إِخْوَةَ الْقِرَدَةِ وَ الْخَنَازِيرِ فَقَالَ لَهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَا عَائِشَةُ إِنَّ الْفُحْشَ لَوْ كَانَ مُمَثَّلًا لَكَانَ مِثَالَ سَوْءٍ إِنَّ الرِّفْقَ لَمْ يُوضَعْ عَلَى شَيْ‏ءٍ قَطُّ إِلَّا زَانَهُ وَ لَمْ يُرْفَعْ عَنْهُ قَطُّ إِلَّا شَانَهُ ",
          "قَالَتْ يَا رَسُولَ اللَّهِ أَ مَا سَمِعْتَ إِلَى قَوْلِهِمْ السَّامُ عَلَيْكُمْ فَقَالَ بَلَى أَ مَا سَمِعْتِ مَا رَدَدْتُ عَلَيْهِمْ قُلْتُ عَلَيْكُمْ فَإِذَا سَلَّمَ عَلَيْكُمْ مُسْلِمٌ فَقُولُوا سَلَامٌ عَلَيْكُمْ وَ إِذَا سَلَّمَ عَلَيْكُمْ كَافِرٌ فَقُولُوا عَلَيْكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from IbnAzina, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘A Jew came over to Rasool-Allah<sup>saww</sup>, and Ayesha was in his<sup>saww</sup> presence. So he said, ‘<span class=\"iTxt\">Al-Saam Alaykum</span>!’ (The poison be upon you). So Rasool-Allah<sup>saww</sup> said: ‘Upon you (as well)’. Then another (Jew) came over and said similar to that. So he<sup>saww</sup> replied to him just as he<sup>saww</sup> has replied upon his companion. Then another came over, and he said similar to that’. So Rasool-Allah<sup>saww</sup> replied just as he<sup>saww</sup> had replied upon his two companions.",
            "So Ayesha got angered and she said, ‘And upon you be the posion, and the Wrath, and the Curse, O community of the Jews, O brethren of the monkeys and the pigs!’. So Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> said to her: ‘O Ayesha! If there was a resemblance of the obscenity, it would have been an evil resemblance. The kindness is not placed upon anything at all except that it would adorn it, and it would not be raised from it at all except that it would dishonour it’. ",
            "She said, ‘O Rasool-Allah<sup style=\"font-weight: normal\">saww</sup>! Did you<sup style=\"font-weight: normal\">saww</sup> not listen to their speech, ‘The poison be upon you!?’ So he<sup style=\"font-weight: normal\">saww</sup> said: ‘Yes, I<sup style=\"font-weight: normal\">saww</sup> did. But, did you not listen to what I<sup style=\"font-weight: normal\">saww</sup> replied upon them? I<sup style=\"font-weight: normal\">saww</sup> said: ‘Upon you (as well)’. So, whenever a Muslim greets upon you, so be saying, ‘<span class=\"iTxt\">Salaam Alaykum</span>’, and when a disbeliever greets upon you, so be saying, ‘<span class=\"iTxt\">Alayka</span>’ (the same Upon you)’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ibn ‘Udhaynah from Zurara from abu Ja’far (a.s.) who has said the following: “Once, a Jewish person went in the presence of the Messenger of Allah while ‘A’ishah was with him. The Jewish person said, ‘Sam ‘Alaykum instead of ‘ Salamun ‘Alaykum. ’ The Messenger of Allah said, Alaykum. ’ Then another Jewish person came and said the same thing as the one before and the Messenger of Allah responded just as before. Then a third Jewish person came. He also said what the other two had said before and the Messenger of Allah responded just as that to the other two before. ‘A’ishah became angry and said, Alaykum al-Sam (wrath and condemnation) O Jewish group, brethren of monkeys and swine.’ The Messenger of Allah said to her, ‘O ‘A’ishah, if name-calling were to appear with a shape and form it would have a very evil shape. Wherever gentleness is placed it beautifies it and removing it is only to make it despised. ’ “‘A’ishah then asked, ‘O the Messenger of Allah, did you not hear their words: ’al-Sam Alaykuml’ The Messenger of Allah said, ‘I heard them but did you not note what I said? I said, ‘Alaykum’. Whenever a Muslim offers you the greeting of peace say, ‘ Salamun ‘Alaykum,’ but when a non-Muslim says something in their manners, just say, Alaykum’, meaning the same to you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/546)"
        ],
        "index": 3645,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:11:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ غِيَاثِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) لَا تَبْدَءُوا أَهْلَ الْكِتَابِ بِالتَّسْلِيمِ وَ إِذَا سَلَّمُوا عَلَيْكُمْ فَقُولُوا وَ عَلَيْكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammd Bin Isa, from Muhammad Bin Yahya, from Giyas Bin Ibrahim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘Do not initiate the People of the Book (Jews and Christians) with the greeting (السَّلَامُ); and when they greet upon you, so (you should) be saying, ‘<span class=\"iTxt\">Wa Alaykum</span>’ (And upon you)’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Yahya from Ghiyath ibn Ibrahim from abu ‘Abd Allah (a.s.) who has said the following: “Amir al-Mu’minin, Ali ibn abu Talib (a.s.) has said, ‘Do not initiate the offering of the greeting of peace to people of the Book, but if they offered just say, “wa ‘Alaykum’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/546)"
        ],
        "index": 3646,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:11:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْيَهُودِيِّ وَ النَّصْرَانِيِّ وَ الْمُشْرِكِ إِذَا سَلَّمُوا عَلَى الرَّجُلِ وَ هُوَ جَالِسٌ كَيْفَ يَنْبَغِي أَنْ يَرُدَّ عَلَيْهِمْ فَقَالَ يَقُولُ عَلَيْكُمْ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from usman Bin Isa, from Sama’at who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Jews and the Christians, and the Polytheists, when they greet upon the man while he is seated, how it is befitting that he replies upon them?’ So he<sup>asws</sup> said: ‘He should be saying, ‘<span class=\"iTxt\">Alaykum</span>’ (Upon you)’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ‘Uthman ibn ‘Isa from Sama’a who has said the following: “Once I asked abu ‘Abd Allah (a.s.) about Jewish, Christians and pagans’ greetings to one sitting, how should he respond? The Imam said, ‘He will say, ‘ ‘Alaykum’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/546)"
        ],
        "index": 3647,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:11:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ بُرَيْدِ بْنِ مُعَاوِيَةَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا سَلَّمَ عَلَيْكَ الْيَهُودِيُّ وَ النَّصْرَانِيُّ وَ الْمُشْرِكُ فَقُلْ عَلَيْكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr, from Bureyd Bin Muawiya, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whenever the Jew and the Christian, and the Polytheist greets upon you, so say, ‘<span class=\"iTxt\">Alayk</span>’ (Upon you)’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from ibn Bukayr from Barid ibn Mu’awiyah from Muhammad ibn Muslim from abu ‘Abd Allah (a.s.) who has said the following: “When a Jew, Christian or a pagan greets you with peace just say, ‘ ‘Alayka’ meaning, ‘the same to you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/547)"
        ],
        "index": 3648,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:11:5",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ أَقْبَلَ أَبُو جَهْلِ بْنُ هِشَامٍ وَ مَعَهُ قَوْمٌ مِنْ قُرَيْشٍ فَدَخَلُوا عَلَى أَبِي طَالِبٍ فَقَالُوا إِنَّ ابْنَ أَخِيكَ قَدْ آذَانَا وَ آذَى آلِهَتَنَا فَادْعُهُ وَ مُرْهُ فَلْيَكُفَّ عَنْ آلِهَتِنَا وَ نَكُفُّ عَنْ إِلَهِهِ قَالَ فَبَعَثَ أَبُو طَالِبٍ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَدَعَاهُ ",
          "فَلَمَّا دَخَلَ النَّبِيُّ ( صلى الله عليه وآله ) لَمْ يَرَ فِي الْبَيْتِ إِلَّا مُشْرِكاً فَقَالَ السَّلَامُ عَلَى مَنِ اتَّبَعَ الْهُدَى ثُمَّ جَلَسَ فَخَبَّرَهُ أَبُو طَالِبٍ بِمَا جَاءُوا لَهُ فَقَالَ أَ وَ هَلْ لَهُمْ فِي كَلِمَةٍ خَيْرٍ لَهُمْ مِنْ هَذَا يَسُودُونَ بِهَا الْعَرَبَ وَ يَطَئُونَ أَعْنَاقَهُمْ ",
          "فَقَالَ أَبُو جَهْلٍ نَعَمْ وَ مَا هَذِهِ الْكَلِمَةُ فَقَالَ تَقُولُونَ لَا إِلَهَ إِلَّا اللَّهُ ",
          "قَالَ فَوَضَعُوا أَصَابِعَهُمْ فِي آذَانِهِمْ وَ خَرَجُوا هُرَّاباً وَ هُمْ يَقُولُونَ ما سَمِعْنا بِهذا فِي الْمِلَّةِ الْآخِرَةِ إِنْ هذا إِلَّا اخْتِلاقٌ فَأَنْزَلَ اللَّهُ تَعَالَى فِي قَوْلِهِمْ ص وَ الْقُرْآنِ ذِي الذِّكْرِ إِلَى قَوْلِهِ إِلَّا اخْتِلاقٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Salim, from Ahmad Bin Muhammad Bin Abu Nasr, from Amro Bin Shimr, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Abu Jahl Bin Hisham, and with him were a group from Qureysh, came over to Abu Talib<sup>as</sup>, and they said, ‘The son<sup>saww</sup> of your<sup>as</sup> brother<sup>as</sup> has harmed us and harmed our gods, therefore instruct him<sup>as</sup> to restrain from our gods, and we would restrain from his<sup>saww</sup> God<sup>azwj</sup>’. So Abu Talib<sup>as</sup> sent a message to Rasool-Allah<sup>saww</sup>, to call him<sup>saww</sup> over.",
            "So when the Prophet<sup>saww</sup> came over, he<sup>saww</sup> did not see in the room except for the Polytheists. So he<sup>saww</sup> said: ‘Greetings be upon the one who follows the Guidance!’. Then he<sup>saww</sup> was seated. So Abu Talib<sup>as</sup> informed him<sup>saww</sup> with what (proposal) they had come over with to him<sup>as</sup>. So he<sup>saww</sup> said: ‘Or shall I<sup>saww</sup> give a solution for them in a statement (There is no god except Allah<sup>azwj</sup>), which is good for them, by which they would be prevailing upon the Arabs and treading on their necks?’ ",
            "So Abu Jahl said, ‘Yes, and what is this statement?’ So he<sup style=\"font-weight: normal\">saww</sup> said: ‘You should be saying, ‘There is no god except Allah<sup style=\"font-weight: normal\">azwj</sup>’’. ",
            "He<sup>asws</sup> said: ‘So they placed their fingers in their ears and went out fleeing, and they were saying, ‘We were not made to hear this in the former nations. This is nothing except for a fabrication’. So Allah<sup>azwj</sup> the Exalted Revealed regarding their words <span class=\"ibTxt\">[38:1] Saad. I Swear by the Quran, full of Remembrance</span> – up to His<sup>azwj</sup> Words <span class=\"ibTxt\">[38:7] this is nothing but a fabrication</span>’."
          ],
          "en.sarwar": [
            "5. Abu Ali al-Ash’ari has narrated from Muhammad ibn Salim from Ahmad ibn Muhammad ibn abu Nasr from ‘Amr ibn Shimr from Jabir from abu Ja’far (a.s.) who has said the following: “Once abu Jahl along with a people from Quraysh went to abu Talib and said, ‘Your cousin has offended us and has harmed our idols, call him and command him to stop bothering our gods and we will stop bothering his Lord.’ “The Imam said, ‘Abu Talib sent for the Messenger of Allah. He was called and he came. He did not see in the house but pagans and he said, ‘(I offer) greetings of peace to those who follow guidance.’ He sat down and abu Talib informed him of what the people had said. The Messenger of Allah asked, ‘What if I instruct them with a word of goodness that will be better for them than this and with which they can rule the Arabs and subdue their stiff necks?’ Abu Jahl then asked, ‘What is that word?’ The Messenger of Allah advised him to say, ‘No one deserves to be worshipped except Allah.’ They placed their fingers in their ears and fled saying, ‘We have not heard anything like this in other religions. This is only something falsely invented.’ Allah, the Most High, then sent this: ‘Sad. I swear by the Quran, which is full of reminders of Allah (that you are a Messenger) (38:1). In fact, the unbelievers are the ones who are boastful and quarrelsome (38:2). How many ancient generations did We destroy? (On facing Our torment) they cried out for help, but it was too late for them to escape.’ (38:3) ‘It seems strange to the pagans that a man from their own people should come to them as a prophet. The unbelievers have said, ‘He is only a lying magician’ (38:4). They ask, ‘Has he condemned all other gods but One? This is certainly strange.’ (38:5) ‘A group of the pagans walked out of a meeting with the Prophet and told the others, ‘Let us walk away. Be steadfast in the worship of your gods. This man wants to dominate you (38:6). We have heard nothing like this in the latest religion. This is only his own false invention.”” (38:7) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/547)"
        ],
        "index": 3649,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:11:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تَقُولُ فِي الرَّدِّ عَلَى الْيَهُودِيِّ وَ النَّصْرَانِيِّ سَلَامٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Abdullah Bin Muhammad, from Ali Bin Al Hakam, from Aban Bin usman, from Zurara, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘You should be saying in reply upon the (greeting of the) Jew and the Christian, ‘(السَّلَامُ)’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from ‘Abd Allah ibn Muhammad from Ali ibn al-Hakam from Aban ibn ‘Uthman from Zurara from abu ‘Abd Allah (a.s.) who has said the following: ‘‘In response to a Jew or Christian You should say, ‘ Salam ’, meaning peace be upon us or whoever deserves it.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/547)"
        ],
        "index": 3650,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:11:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ قُلْتُ لِأَبِي الْحَسَنِ مُوسَى ( عليه السلام ) أَ رَأَيْتَ إِنِ احْتَجْتُ إِلَى مُتَطَبِّبٍ وَ هُوَ نَصْرَانِيٌّ أُسَلِّمُ عَلَيْهِ وَ أَدْعُو لَهُ قَالَ نَعَمْ إِنَّهُ لَا يَنْفَعُهُ دُعَاؤُكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajaj who said, ",
            "‘I said to Abu Al-Hassan Musa<sup>asws</sup>, ‘What is your<sup>asws</sup> view, if I was needy to a physician and he was a Christian, should I greet upon him and supplicate for him?’ He<sup>asws</sup> said: ‘Yes, (but) your supplication will not benefit him’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Abd al- Rahman ibn al-Hajjaj who has said the following: ‘‘Once I asked abu al-Hassan Musa (a.s.) ‘If I needed to visit a Christian physician, can I offer the greeting of peace and pray for him?’ The Imam said, ‘Yes, but your prayer will not benefit him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/548)"
        ],
        "index": 3651,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:11:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ قُلْتُ لِأَبِي الْحَسَنِ مُوسَى ( عليه السلام ) أَ رَأَيْتَ إِنِ احْتَجْتُ إِلَى الطَّبِيبِ وَ هُوَ نَصْرَانِيٌّ أَنْ أُسَلِّمَ عَلَيْهِ وَ أَدْعُوَ لَهُ قَالَ نَعَمْ إِنَّهُ لَا يَنْفَعُهُ دُعَاؤُكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from Abdul Rahman Bin Al Hajjaj who said, ",
            "‘I said to Abu Al-Hassan Musa<sup>asws</sup>, ‘What is your<sup>asws</sup> view if I was needy to the physician and he was a Christian, should I greet (السَّلَامُ) upon him and supplicate for him?’ He<sup>asws</sup> said: ‘Yes, (but) your supplication will not benefit him’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn Mahbub from ‘Abd al-Rahman ibn al-Hajjaj who has said the following: “Once I asked abu al-Hassan Musa (a.s.) ‘If 1 needed to visit a Christian physician, can I offer him the greeting of peace and pray for him?’ The Imam said, ‘Yes, but your prayer will not benefit him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/548)"
        ],
        "index": 3652,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:11:9",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ مُحَمَّدِ بْنِ عَرَفَةَ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ قِيلَ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) كَيْفَ أَدْعُو لِلْيَهُودِيِّ وَ النَّصْرَانِيِّ قَالَ تَقُولُ لَهُ بَارَكَ اللَّهُ لَكَ فِي الدُّنْيَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Isa Bin Ubeyd, from Muhammad Bin Arafa, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup> having said: ‘It was said to Abu Abdullah<sup>asws</sup>, ‘How should I supplicate for the Jew and the Christian?’ He<sup>asws</sup> said: ‘You should be saying to him, ‘May Allah<sup>azwj</sup> Bless you in the world’’."
          ],
          "en.sarwar": [
            "9. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Muhammad ibn ‘Isa ibn ‘Ubayd from Muhammad ibn ‘Arafah from abu al- Hassan al-Rida (a.s.) who has said the following: “It was asked from abu ‘Abd Allah (a.s.) ‘How do I pray for a Jew or a Christian?’ He had said, ‘Say, “May Allah grant you blessing in this world.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/548)"
        ],
        "index": 3653,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:11:10",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ عَنْ وُهَيْبِ بْنِ حَفْصٍ عَنْ أَبِي بَصِيرٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي مُصَافَحَةِ الْمُسْلِمِ الْيَهُودِيَّ وَ النَّصْرَانِيَّ قَالَ مِنْ وَرَاءِ الثَّوْبِ فَإِنْ صَافَحَكَ بِيَدِهِ فَاغْسِلْ يَدَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad, from Wuheyb Bin Hafs, from Abu Baseer, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup> regarding the handshake of the Muslim for the Jew and the Christian. He<sup>asws</sup> said: ‘From behind a (piece of) cloth. So if he was to shake your hand, so wash your hand’."
          ],
          "en.sarwar": [
            "10. Hamid ibn Ziyad has narrated from al-Hassan ibn Muhammad from Wahab ibn Hafs from abu Basir from one of the two Imam (a.s.) who has said the following: “About shaking hands with a Jew or a Christian he had said, ‘Shake hands with them from behind clothes and if you shook their hand without clothes then you must wash your hands.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/548)"
        ],
        "index": 3654,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:11:11",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنْ عَبَّاسِ بْنِ عَامِرٍ عَنْ عَلِيِّ بْنِ مَعْمَرٍ عَنْ خَالِدٍ الْقَلَانِسِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَلْقَى الذِّمِّيَّ فَيُصَافِحُنِي قَالَ امْسَحْهَا بِالتُّرَابِ وَ بِالْحَائِطِ قُلْتُ فَالنَّاصِبَ قَالَ اغْسِلْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Al Hassan Bin Ali Al Kufy, from Abbas Bin Aamir, from Ali Bin Ma’mar, from Khalid Al Qalanasy who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I met the <span class=\"iTxt\">Zimmy</span> (Christian or Jew under the responsibility of the Islamic government), so he shook my hand’. He<sup>asws</sup> said: ‘Wipe it with the dust and with the wall’. I said, ‘So (what about) the <span class=\"iTxt\">Nasibi</span> (Hostile one)?’ Wash it’."
          ],
          "en.sarwar": [
            "11. Abu Ali al-Ash’ari has narrated from al-Hassan ibn Ali al-Kufi from al-‘ Abbas ibn ‘Amir from Ali ibn Mu’ammar from Khalid al-Qalanisi who has said the following: “Once I asked abu ‘Abd Allah (a.s.) ‘What should I do if I meet a tax paying non-Muslim and he shakes my hand?’ The Imam said, ‘Wipe it with soil or against a wall.’ I asked, ‘What about one who is abusive of ‘A’immahV The Imam said, ‘Wash it (your hand).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/548)"
        ],
        "index": 3655,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:11:12",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي رَجُلٍ صَافَحَ رَجُلًا مَجُوسِيّاً قَالَ يَغْسِلُ يَدَهُ وَ لَا يَتَوَضَّأُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding a man who shook the hand of a <span class=\"iTxt\">Majusi</span> (Magian) man. He<sup>asws</sup> said: ‘He should wash his hand and he does not have to perform ablution’."
          ],
          "en.sarwar": [
            "12. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan from al-‘Ala’ ibn Razin from Muhammad ibn Muslim from abu Ja’far (a.s.) who has said the following: “About a man who had shaken hand with Majusi (Zoroastrian), the Imam said, ‘He must wash it but he does not need to perform wuzu again.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:4:11",
  "kind": "verse_list"
}