{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 2"}, "path": "/books/al-kafi:2", "titles": {"ar": "الجزء الثاني‏", "en": "Volume Two"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:2:4", "titles": {"ar": "كِتَابُ الْعِشْرَةِ", "en": "THE BOOK OF SOCIAL RELATIONSHIPS"}}, {"indexed_titles": {"en": "Chapter 12"}, "path": "/books/al-kafi:2:4:12", "titles": {"ar": "بَابُ مُكَاتَبَةِ أَهْلِ الذِّمَّةِ", "en": "Chapter 12 – Contracts of the people under the responsibility (Ahl Al-Zimma)"}}], "index": 483, "local_index": 12, "part_type": "Chapter", "path": "/books/al-kafi:2:4:12", "titles": {"ar": "بَابُ مُكَاتَبَةِ أَهْلِ الذِّمَّةِ", "en": "Chapter 12 – Contracts of the people under the responsibility (Ahl Al-Zimma)"}, "verse_count": 2, "verse_start_index": 3655, "verses": [{"index": 3656, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:2:4:12:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َحْمَدُ بْنُ مُحَمَّدٍ</span> الْكُوفِيُّ عَنْ عَلِيِّ بْنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ عَمِّهِ يَعْقُوبَ بْنِ سَالِمٍ عَنْ أَبِي بَصِيرٍ قَالَ سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَكُونُ لَهُ الْحَاجَةُ إِلَى الْمَجُوسِيِّ أَوْ إِلَى الْيَهُودِيِّ أَوْ إِلَى النَّصْرَانِيِّ أَوْ أَنْ يَكُونَ عَامِلًا أَوْ دِهْقَاناً مِنْ عُظَمَاءِ أَهْلِ أَرْضِهِ فَيَكْتُبُ إِلَيْهِ الرَّجُلُ فِي الْحَاجَةِ الْعَظِيمَةِ أَ يَبْدَأُ بِالْعِلْجِ وَ يُسَلِّمُ عَلَيْهِ فِي كِتَابِهِ وَ إِنَّمَا يَصْنَعُ ذَلِكَ لِكَيْ تُقْضَى حَاجَتُهُ \nقَالَ أَمَّا أَنْ تَبْدَأَ بِهِ فَلَا وَ لَكِنْ تُسَلِّمُ عَلَيْهِ فِي كِتَابِكَ فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَدْ كَانَ يَكْتُبُ إِلَى كِسْرَى وَ قَيْصَرَ.", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Muhammad Al Kufy, from Ali Bin Al Hassan Bin Ali, from Ali Bin Asbaat, from his uncle Yaqoub Bin Salim, from Abu Baseer who said, \n‘Abu Abdullah<sup>asws</sup> was asked about the man who happened to have the need for him to the Magian, or to the Jew, or to the Christian, or if he happens to be an office bearer or a manager of the great people of his land. So the man has to write to him regarding the need. Should he begin by his request and greet upon him in his letter, and rather he is doing that, so that perhaps he would fulfil his need?’ \nHe<sup>asws</sup> said: ‘As for beginning with it, so no, but you can greet upon him in your letter, for Rasool-Allah<sup>saww</sup> had written to Chosroe (of Persia) and Caesar (of Rome)’."}]}, {"index": 3657, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:2:4:12:2", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَكْتُبُ إِلَى رَجُلٍ مِنْ عُظَمَاءِ عُمَّالِ الْمَجُوسِ فَيَبْدَأُ بِاسْمِهِ قَبْلَ اسْمِهِ فَقَالَ لَا بَأْسَ إِذَا فَعَلَ لِاخْتِيَارِ الْمَنْفَعَةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ismail Bin marrar, from Yunus, from Abdullah Bin Sinan, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> about the man who writes to a man from the greats ones he works for from the Magians. So he begins by his name before his own name. So he<sup>asws</sup> said, ‘There is no problem when he does that to choose the benefit’."}]}]}, "index": "al-kafi:2:4:12", "kind": "verse_list"}