{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:2:4",
        "titles": {
          "ar": "كِتَابُ الْعِشْرَةِ",
          "en": "THE BOOK OF SOCIAL RELATIONSHIPS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 15"
        },
        "path": "/books/al-kafi:2:4:15",
        "titles": {
          "ar": "بَابُ الْعُطَاسِ وَ التَّسْمِيتِ",
          "en": "Chapter 15 – The sneezing and the Naming (of Allah<sup>azwj</sup>)"
        }
      }
    ],
    "index": 486,
    "local_index": 15,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 16"
        },
        "path": "/books/al-kafi:2:4:16",
        "titles": {
          "ar": "بَابُ وُجُوبِ إِجْلَالِ ذِي الشَّيْبَةِ الْمُسْلِمِ",
          "en": "Chapter 16 – The Obligation of respecting the Muslim with old age"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:2:4:14",
        "titles": {
          "ar": "بَابٌ نَادِرٌ",
          "en": "Chapter 14 - Miscellaneous"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:2:4",
        "titles": {
          "ar": "كِتَابُ الْعِشْرَةِ",
          "en": "THE BOOK OF SOCIAL RELATIONSHIPS"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:4:15",
    "titles": {
      "ar": "بَابُ الْعُطَاسِ وَ التَّسْمِيتِ",
      "en": "Chapter 15 – The sneezing and the Naming (of Allah<sup>azwj</sup>)"
    },
    "verse_count": 27,
    "verse_start_index": 3664,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/552)"
        ],
        "index": 3665,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنِ الْقَاسِمِ بْنِ سُلَيْمَانَ عَنْ جَرَّاحٍ الْمَدَائِنِيِّ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لِلْمُسْلِمِ عَلَى أَخِيهِ مِنَ الْحَقِّ أَنْ يُسَلِّمَ عَلَيْهِ إِذَا لَقِيَهُ وَ يَعُودَهُ إِذَا مَرِضَ وَ يَنْصَحَ لَهُ إِذَا غَابَ وَ يُسَمِّتَهُ إِذَا عَطَسَ يَقُولَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ لَا شَرِيكَ لَهُ وَ يَقُولَ لَهُ يَرْحَمُكَ اللَّهُ فَيُجِيبَهُ فَيَقُولَ لَهُ يَهْدِيكُمُ اللَّهُ وَ يُصْلِحُ بَالَكُمْ وَ يُجِيبَهُ إِذَا دَعَاهُ وَ يَتْبَعَهُ إِذَا مَاتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Al Qasim Bin Suelyman, from Jarrah Al Madainy who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘For the Muslim upon his brother, from the rights, is that he greets upon him when he meets him, and he consoles him when he is sick, and he advises for him when he is absent, and he should Name Allah<sup>azwj</sup> when he sneezes by saying, ‘The Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> or the worlds, there being no associate for Him<sup>azwj</sup>’, and he should be saying to him, ‘May Allah<sup>azwj</sup> be Merciful to You’. So he would answer him saying to him, ‘May Allah Guide you and Correct your affairs’, and he should answer him when he invites him, and should follow him (his funeral) when he dies’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa’id from al-Nadr ibn Suwayd from al-Qasim ibn Sulayman from Jarrah al-Mad’ini who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘Of the rights of a Muslim on his brother (in belief) is that on meeting him he should offer him the greeting of peace, visit him when he is ill, look after his interests in his absence and respond to his sneezing. On sneezing one should say: “All praise belongs to Allah, Lord of the worlds, who has no partner.” In response to sneezing one should say, “May Allah grant you favors.” The sneezing person should reply back by saying, “May Allah guide you, and look after your concerns.” Of such rights is to accept his invitation and attend his funeral.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/553)"
        ],
        "index": 3666,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِذَا عَطَسَ الرَّجُلُ فَسَمِّتُوهُ وَ لَوْ كَانَ مِنْ وَرَاءِ جَزِيرَةٍ وَ فِي رِوَايَةٍ أُخْرَى وَ لَوْ مِنْ وَرَاءِ الْبَحْرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Haroun Bin Muslim, from Mas’ada Bin Sadaqa, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘When the man sneezes, so Name (Allah<sup>azwj</sup> respond to his sneeze) for him, and even if he was behind an island’. And in another report, ‘And even if he was behind the sea’’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from Harun ibn Muslim from Mas’adah ibn Sadaqah from abu ‘Abd Allah (a.s.) who has said the following: “The Messenger of Allah has said, ‘You should respond to one’s sneezing even if he is behind the island. In another Hadith it is said, ‘Even if it (response) is from behind the ocean.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/553)"
        ],
        "index": 3667,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:3",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ مُثَنًّى عَنْ إِسْحَاقَ بْنِ يَزِيدَ وَ مُعَمَّرِ بْنِ أَبِي زِيَادٍ وَ ابْنِ رِئَابٍ قَالُوا كُنَّا جُلُوساً عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِذْ عَطَسَ رَجُلٌ فَمَا رَدَّ عَلَيْهِ أَحَدٌ مِنَ الْقَوْمِ شَيْئاً حَتَّى ابْتَدَأَ هُوَ فَقَالَ سُبْحَانَ اللَّهِ أَ لَا سَمَّتُّمْ إِنَّ مِنْ حَقِّ الْمُسْلِمِ عَلَى الْمُسْلِمِ أَنْ يَعُودَهُ إِذَا اشْتَكَى وَ أَنْ يُجِيبَهُ إِذَا دَعَاهُ وَ أَنْ يَشْهَدَهُ إِذَا مَاتَ وَ أَنْ يُسَمِّتَهُ إِذَا عَطَسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan Bin Ali, from Musna, from Is’haq Bin Yazeed, and Moammar Bin Abu Ziyad, and Ibn Raib who all said, ",
            "‘We were seated in the presence of Abu Abdullah<sup>asws</sup> when a man sneezed. So, no one from the group responded upon it with anything, until he<sup>asws</sup> initiated, so he<sup>asws</sup> said: ‘Glory be to Allah<sup>azwj</sup>! Are you not Naming (Allah<sup>azwj</sup>)? From a right of the Muslim upon the Muslim is that he visits him when he complains (of an illness), and that he answers him when he invites him, and he attends (his funeral) when he dies, and that he Names (Allah<sup>azwj</sup>) when he sneezes’."
          ],
          "en.sarwar": [
            "3. Al-Husayn ibn Muhammad has narrated from Mu’Alla ibn Muhammad from al- Hassan ibn Ali from Muthanna from Ishaq ibn Yazid and Mu’ammar ibn abu Ziyad ibn Ri’ab who have said the following: “Once we were in the presence of abu ‘Abd Allah (a.s.) when a man sneezed and no one from the group responded until he (the Imam) initiated saying: ‘Glory belongs to Allah, why did no one respond? It is of the rights of a Muslim upon the Muslim to visit him when he is ill, accept his invitation, attend his funeral and respond to his sneezing.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/553)"
        ],
        "index": 3668,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ صَفْوَانَ بْنِ يَحْيَى قَالَ كُنْتُ عِنْدَ الرِّضَا ( عليه السلام ) فَعَطَسَ فَقُلْتُ لَهُ صَلَّى اللَّهُ عَلَيْكَ ثُمَّ عَطَسَ فَقُلْتُ صَلَّى اللَّهُ عَلَيْكَ ثُمَّ عَطَسَ فَقُلْتُ صَلَّى اللَّهُ عَلَيْكَ وَ قُلْتُ لَهُ جُعِلْتُ فِدَاكَ إِذَا عَطَسَ مِثْلُكَ نَقُولُ لَهُ كَمَا يَقُولُ بَعْضُنَا لِبَعْضٍ يَرْحَمُكَ اللَّهُ أَوْ كَمَا نَقُولُ ",
          "قَالَ نَعَمْ أَ لَيْسَ تَقُولُ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ قُلْتُ بَلَى قَالَ ارْحَمْ مُحَمَّداً وَ آلَ مُحَمَّدٍ قَالَ بَلَى وَ قَدْ صَلَّى اللَّهُ عَلَيْهِ وَ رَحِمَهُ وَ إِنَّمَا صَلَوَاتُنَا عَلَيْهِ رَحْمَةٌ لَنَا وَ قُرْبَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Safwan Bin Yahya who said, ",
            "‘I was in the presence of Al-Reza<sup>asws</sup>, so he<sup>asws</sup> sneezed. So I said to him<sup>asws</sup>, ‘May Allah<sup>azwj</sup> Send <span class=\"iTxt\">Salawāt</span> upon you<sup>asws</sup>’. Then he<sup>asws</sup> sneezed, so I said, ‘May Allah<sup>azwj</sup> Send <span class=\"iTxt\">Salawāt</span> upon you<sup>asws</sup>’. Then he<sup>asws</sup> sneezed, so I said, ‘May Allah<sup>azwj</sup> Send <span class=\"iTxt\">Salawāt</span> upon you<sup>asws</sup>’, and I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! When the likes of you<sup>asws</sup> sneezes, should we be saying just as we are saying for each other, ‘May Allah<sup>azwj</sup> have Mercy on you’, or just as we are saying?’ ",
            "He<sup>asws</sup> said: ‘Yes. Are you not saying, ‘May Allah<sup>azwj</sup> Send <span class=\"iTxt\">Salawāt</span> upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>’?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘Mercy be upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>. Yes, Allah<sup>azwj</sup> has Sent <span class=\"iTxt\">Salawāt</span> upon him<sup>saww</sup> and been Merciful to him<sup>saww</sup>, and rather, our<sup>asws</sup> <span class=\"iTxt\">Salawāt</span> upon him<sup>saww</sup> is a Mercy for us<sup>asws</sup>, and a (means) of nearness (to Him<sup>azwj</sup>)’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Safwan ibn Yahya who has said the following: “Once I was in the presence of al-Rida (a.s.) and he sneezed. I said, ‘May Allah grant you al-Salat (favors).’ He sneezed again, and said, ‘May Allah grant you favors.’ He sneezed again and I said, ‘May Allah grant you favors.’ I then said, ‘May Allah keep my soul in service for your cause, if one like you (Imam) would sneeze should we say what we say to each other like: “May Allah grant you mercy? Or should we say what I just said, ‘(May Allah grant you al- Salat ’ ?’” The Imam said, ‘Yes, do you not say, “O Lord, grant al- Salat upon Muhammad and the Ahl al-Bayt, family of Muhammad?”’ I said, ‘Yes, we do.’ The Imam said, ‘Do you not say, “(O Lord,) be merciful to Muhammad and the Ahl al-Bayt, family of Muhammad?”’ Then the Imam said, ‘Yes, Allah grants al-Salat to him and has been merciful to him. Our saying, “May Allah grant him al-Salat is a blessing for us and a way of our seeking nearness to Allah (thereby).””’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/554)"
        ],
        "index": 3669,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:5",
        "text": [
          "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ سَمِعْتُ الرِّضَا ( عليه السلام ) يَقُولُ التَّثَاؤُبُ مِنَ الشَّيْطَانِ وَ الْعَطْسَةُ مِنَ اللَّهِ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ahmad Bin Muhammad Bin Isa, from Ahmad Bin Muhammad Bin Abu Nasr who said, ",
            "‘I heard Al-Reza<sup>asws</sup> saying: ‘The yawning is from the Satan<sup>la</sup> and the sneeze is from Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "5. It is narrated from him (narrator of the Hadith above) from Ahmad ibn Muhammad ibn ‘Isa from Ahmad ibn Muhammad ibn abu Nasr who has said the following: “Once I heard al-Rida (a.s.) saying, ‘Yawning is from Satan and sneezing is from Allah.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/554)"
        ],
        "index": 3670,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:6",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ قَالَ سَأَلْتُ الْعَالِمَ ( عليه السلام ) عَنِ الْعَطْسَةِ وَ مَا الْعِلَّةُ فِي الْحَمْدِ لِلَّهِ عَلَيْهَا فَقَالَ إِنَّ لِلَّهِ نِعَماً عَلَى عَبْدِهِ فِي صِحَّةِ بَدَنِهِ وَ سَلَامَةِ جَوَارِحِهِ وَ إِنَّ الْعَبْدَ يَنْسَى ذِكْرَ اللَّهِ عَزَّ وَ جَلَّ عَلَى ذَلِكَ وَ إِذَا نَسِيَ أَمَرَ اللَّهُ الرِّيحَ فَتَجَاوَزَ فِي بَدَنِهِ ثُمَّ يُخْرِجُهَا مِنْ أَنْفِهِ فَيَحْمَدُ اللَّهَ عَلَى ذَلِكَ فَيَكُونُ حَمْدُهُ عِنْدَ ذَلِكَ شُكْراً لِمَا نَسِيَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali bin Muhammad, from Salih Bin Abu Hammad who said, ",
            "‘I asked the knowledgeable one<sup style=\"font-weight: normal\">asws</sup> about the sneezing and what is the reason in (saying), ‘The Praise is for Allah<sup style=\"font-weight: normal\">azwj</sup>’, upon it. So he<sup style=\"font-weight: normal\">asws</sup> said: ‘For Allah<sup style=\"font-weight: normal\">azwj</sup> has Favoured upon His<sup style=\"font-weight: normal\">azwj</sup> servant regarding the health in his body and safety of his body parts, and the servant tends to forget the Mention of Allah<sup style=\"font-weight: normal\">azwj</sup> Mighty and Majestic upon that; and when he does forget, Allah<sup style=\"font-weight: normal\">azwj</sup> Commands the wind, so it goes through his body, then exits from his nose, so he Praises Allah<sup style=\"font-weight: normal\">azwj</sup> upon that, and that praise of his during that would happen to be a thankfulness to what he had forgotten’."
          ],
          "en.sarwar": [
            "6. Ali ibn Muhammad has narrated from Salih ibn abu Hammad who has said the following: “Once I asked the scholar about sneezing and the reason for praising Allah thereafter. The Imam said, ‘From Allah there are bounties in His servant, in his good health for his body and soundness of his limbs. The servant forgets remembering Allah, the Most Majestic, the Most Holy, for such bounties. When he forgets Allah commands the air to pass through his body and come out of his nose. He then praises Allah for it and his praising at such time is thanking that he had forgotten.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/555)"
        ],
        "index": 3671,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:7",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ ابْنِ فَضَّالٍ عَنْ جَعْفَرِ بْنِ يُونُسَ عَنْ دَاوُدَ بْنِ الْحُصَيْنِ قَالَ كُنَّا عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَأَحْصَيْتُ فِي الْبَيْتِ أَرْبَعَةَ عَشَرَ رَجُلًا فَعَطَسَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَمَا تَكَلَّمَ أَحَدٌ مِنَ الْقَوْمِ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَ لَا تُسَمِّتُونَ أَ لَا تُسَمِّتُونَ مِنْ حَقِّ الْمُؤْمِنِ عَلَى الْمُؤْمِنِ إِذَا مَرِضَ أَنْ يَعُودَهُ وَ إِذَا مَاتَ أَنْ يَشْهَدَ جَنَازَتَهُ وَ إِذَا عَطَسَ أَنْ يُسَمِّتَهُ أَوْ قَالَ يُشَمِّتَهُ وَ إِذَا دَعَاهُ أَنْ يُجِيبَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ibn Fazzal, from Ja’far Bin Yunus, from Dawood Bin Al Husayn who said, ",
            "‘We were in the presence of Abu Abdullah<sup>asws</sup>, and I counted in the room, there were fourteen men. So Abu Abdullah<sup>asws</sup> sneezed, and no one from the group spoke (a word)’. So Abu Abdullah<sup>asws</sup> said: ‘Are you not Naming (Allah<sup>azwj</sup>)? Are you not Naming (Allah<sup>azwj</sup>)? From the rights of the <span class=\"iTxt\">Momin</span> upon the <span class=\"iTxt\">Momin</span> is that when he is sick, that you should visit him, and when he dies, that you should attend his funeral, and when he sneezes, that you should Name (Allah<sup>azwj</sup>)’. Or he<sup>asws</sup> said: ‘Yushammituhu’ (be glad for him)’, ‘And when he invites you, that you answer him’."
          ],
          "en.sarwar": [
            "7. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Faddal from Ja’far ibn Yunus from Dawud ibn al-Hosayn who has said the following: “Once we were in the presence of abu ‘Abd Allah, recipient of divine supreme covenant. I counted that the people present were fourteen. Abu ‘Abd Allah (a.s.) sneezed and no one from the people said anything. Abu ‘Abd Allah (a.s.) then asked, ‘You did not respond. Why did you not respond? It is of the rights of a believing person on the other believing person to visit him in his illness, attend his funeral, and respond to his sneezing, or he said, yusammithu (response to his sneezing) and when he invites accept his invitation.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/555)"
        ],
        "index": 3672,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:8",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ أَحْمَدَ بْنِ النَّضْرِ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) نِعْمَ الشَّيْ‏ءُ الْعَطْسَةُ تَنْفَعُ فِي الْجَسَدِ وَ تُذَكِّرُ بِاللَّهِ عَزَّ وَ جَلَّ قُلْتُ إِنَّ عِنْدَنَا قَوْماً يَقُولُونَ لَيْسَ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) فِي الْعَطْسَةِ نَصِيبٌ فَقَالَ إِنْ كَانُوا كَاذِبِينَ فَلَا نَالَهُمْ شَفَاعَةُ مُحَمَّدٍ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Ashary, from Muhammad Bin Salim, from Ahmad Bin Al Nazar, from Amro Bin Shimr, from Jabir who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘The sneezing is a good thing. It is beneficial for the body, and reminds you of Allah<sup>azwj</sup> Mighty and Majestic’. I said, ‘In our presence there is a group of people who are saying, ‘There is no share for Rasool-Allah<sup>saww</sup> in the sneezing’. So he<sup>asws</sup> said: ‘If they were lying, so may they not attain the intercession of Muhammad<sup>saww</sup>’’."
          ],
          "en.sarwar": [
            "8. Abu Ali al-Ash’ari has narrated from Muhammad ibn Salim from Ahmad ibn al- Nadr from ‘Amr ibn Shimr from Jabir who has said the following: “Abu Ja’far (a.s.) has said, ‘Sneezing is a good thing. It benefits the body and reminds one of Allah, the Most Majestic, the Most Holy.’ I then said, ‘Nearby to us there are people who say, “There is nothing in sneezing for the Messenger of Allah.” The Imam said, ‘If they are lying, the intercession of Muhammad will not avail them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/555)"
        ],
        "index": 3673,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:9",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ بَعْضِ أَصْحَابِهِ قَالَ عَطَسَ رَجُلٌ عِنْدَ أَبِي جَعْفَرٍ ( عليه السلام ) فَقَالَ الْحَمْدُ لِلَّهِ فَلَمْ يُسَمِّتْهُ أَبُو جَعْفَرٍ ( عليه السلام ) وَ قَالَ نَقَصَنَا حَقَّنَا ثُمَّ قَالَ إِذَا عَطَسَ أَحَدُكُمْ فَلْيَقُلِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ وَ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ أَهْلِ بَيْتِهِ قَالَ فَقَالَ الرَّجُلُ فَسَمَّتَهُ أَبُو جَعْفَرٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from one of his companions who said, ",
            "‘A man sneezed in the presence of Abu Ja’far<sup>asws</sup>, so he said, ‘The Praise is for Allah<sup>azwj</sup>’, so Abu Ja’far<sup>asws</sup> did not respond (Allah<sup>azwj</sup>) and said: ‘You have been deficient of our<sup>asws</sup> rights’. Then he<sup>asws</sup> said: ‘Whenever one of you sneezes, so let him say, ‘The Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds, and may Allah<sup>azwj</sup> Send <span class=\"iTxt\">Salawāt</span> upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and the People<sup>asws</sup> of his<sup>saww</sup> Household’. So the man said it, and Abu Ja’far<sup>asws</sup> responded (by Naming Allah<sup>azwj</sup>)’."
          ],
          "en.sarwar": [
            "9. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from certain individuals of his people from who has said the following: “Once a man sneezed in the presence of abu Ja’far (a.s.) and he said, ‘All praise belongs to Allah.’ Abu Ja’far (a.s.) did not respond and said, ‘Our rights are reduced.’ Then he said, ‘Whenever anyone of you sneezes he should say, “All praise belongs to Allah, Lord of the worlds and Allah has granted al- Salat (favors) upon Muhammad and the AM al-Bay (family of Muhammad).”’ The narrator has said that the man then said it and abu Ja’far (a.s.) responded.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/555)"
        ],
        "index": 3674,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:10",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِسْمَاعِيلَ الْبَصْرِيِّ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) إِنَّ النَّاسَ يَكْرَهُونَ الصَّلَاةَ عَلَى مُحَمَّدٍ وَ آلِهِ فِي ثَلَاثَةِ مَوَاطِنَ عِنْدَ الْعَطْسَةِ وَ عِنْدَ الذَّبِيحَةِ وَ عِنْدَ الْجِمَاعِ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) مَا لَهُمْ وَيْلَهُمْ نَافَقُوا لَعَنَهُمُ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Ibn Abu Umeyr, from Ismail Al Basry, from Al Fuzayl Bin Yasaar who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘The people are disliking the (sending of) <span class=\"iTxt\">Salawāt</span> upon Muhammad<sup>saww</sup> and his<sup>azwj</sup> Progeny<sup>asws</sup> in three places – during the sneezing, and during the slaughtering, and during the copulation’. So Abu Ja’far<sup>asws</sup> said: ‘What is matter with them? Woe be unto them! They have become hypocrites, may Allah<sup>azwj</sup> Curse them!’."
          ],
          "en.sarwar": [
            "10. Ali has narrated from his father from ibn abu ‘Umayr from Isma’il al-Basri from al-Fudayl ibn Yasar who has said the following: “Once I said to abu Ja’far (a.s.) ‘People do not like saying, “O Allah grant al-Salat, (favors) upon Muhammad and the AM al-Bay (family of Muhammad),” in three conditions: when sneezing, when slaughtering an animal and at the time of having intimate relations with their spouses.’ Abu Ja’far (a.s.) said, ‘What is wrong with them, woe upon them! It is due to their hypocrisy, may Allah condemn them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/555)"
        ],
        "index": 3675,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:11",
        "text": [
          "عَنْهُ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ سَعْدِ بْنِ أَبِي خَلَفٍ قَالَ كَانَ أَبُو جَعْفَرٍ ( عليه السلام ) إِذَا عَطَسَ فَقِيلَ لَهُ يَرْحَمُكَ اللَّهُ قَالَ يَغْفِرُ اللَّهُ لَكُمْ وَ يَرْحَمُكُمْ وَ إِذَا عَطَسَ عِنْدَهُ إِنْسَانٌ قَالَ يَرْحَمُكَ اللَّهُ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from his father, from Ibn Abu Umeyr, from Sa’ad Bin Abu Khalaf who said, ",
            "‘It was so that whenever Abu Ja’far<sup>asws</sup> sneezed, so it was said to him<sup>asws</sup>, ‘May Allah<sup>azwj</sup> have Mercy on you<sup>asws</sup>’. He<sup>asws</sup> would say: ‘May Allah<sup>azwj</sup> Forgive you and have Mercy on you’. And whenever a person sneezed in his<sup>asws</sup> presence, he<sup>asws</sup> would say: ‘May Allah<sup>azwj</sup> Mighty and Majestic have Mercy on you’."
          ],
          "en.sarwar": [
            "11. It is narrated from him (narrator of the Hadith above) from ibn abu ‘Umayr from Sa’d ibn abu Khalaf who has said the following: “Whenever abu la’ far (a.s.) would sneeze in response it was said, ‘May Allah be kind to you,’ and he would say, ‘May Allah grant you forgiveness and be kind to you. ’ When anyone sneezed in his presence he would say, ‘May Allah, the Most Majestic, the Most Holy, grant you forgiveness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/556)"
        ],
        "index": 3676,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:12",
        "text": [
          "عَنْهُ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ أَوْ غَيْرِهِ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ عَطَسَ غُلَامٌ لَمْ يَبْلُغِ الْحُلُمَ عِنْدَ النَّبِيِّ ( صلى الله عليه وآله ) فَقَالَ الْحَمْدُ لِلَّهِ فَقَالَ لَهُ النَّبِيُّ ( صلى الله عليه وآله ) بَارَكَ اللَّهُ فِيكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from his father, from Al Nowfaly, or someone else, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> having said: ‘A boy who had yet to reach puberty, sneezed in the presence of the Prophet<sup style=\"font-weight: normal\">saww</sup>, and he said, ‘The Praise is for Allah<sup style=\"font-weight: normal\">azwj</sup>’. So the Prophet<sup style=\"font-weight: normal\">saww</sup> said to him: ‘May Allah<sup style=\"font-weight: normal\">azwj</sup> Place Blessings in you’."
          ],
          "en.sarwar": [
            "12. It is narrated from him (narrator of the Hadith above) from his father from al- Nawfali from al-Sakuni from abu ‘Abd Allah (a.s.) who has said the following: “A young boy who had not yet reached puberty once sneezed in the presence of the Holy Prophet and said, ‘All praise belongs to Allah.’ The Holy Prophet said, ‘May Allah place blessings in you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/556)"
        ],
        "index": 3677,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:13",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِذَا عَطَسَ الرَّجُلُ فَلْيَقُلِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ لَا شَرِيكَ لَهُ وَ إِذَا سَمَّتَ الرَّجُلُ فَلْيَقُلْ يَرْحَمُكَ اللَّهُ وَ إِذَا رَدَدْتَ فَلْيَقُلْ يَغْفِرُ اللَّهُ لَكَ وَ لَنَا فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) سُئِلَ عَنْ آيَةٍ أَوْ شَيْ‏ءٍ فِيهِ ذِكْرُ اللَّهِ فَقَالَ كُلُّمَا ذُكِرَ اللَّهُ فِيهِ فَهُوَ حَسَنٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Abdullah Bin Muhammad, from Ali Bin Al Hakam, from Aban Bin Usman, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Whenever a man sneezes, so let one say, ‘The Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds, there being no associate for Him<sup>azwj</sup>’ and when the man Names (Allah<sup>azwj</sup> in response to the sneeze), so let him say, ‘May Allah<sup>azwj</sup> have Mercy on you’; and when he responds, so let him say, ‘May Allah<sup>azwj</sup> Forgive you and us’, for Rasool-Allah<sup>saww</sup> was asked about a Verse or something wherein was a Mention of Allah<sup>azwj</sup>. So he<sup>saww</sup> said: ‘Everywhere Allah<sup>azwj</sup> is Mentioned therein, so it is excellent’."
          ],
          "en.sarwar": [
            "13. Muhammad ibn Yahya has narrated from ‘Abd Allah ibn Muhammad from Ali ibn al-Hakam from Aban ibn ‘Uthman from Muhammad ibn Muslim from abu Ja’far (a.s.) who has said the following: “When a man sneezes he should say, ‘All praise belongs to Allah [Lord of the worlds] who has no partner. ’ In response one should say, ‘May Allah grant you blessings.’ If it is repeated then one should say, ‘May Allah forgive you and forgive us.’ The Messenger of Allah was asked if there was a special verse of the Holy Quran about it or something with a mention of Allah. He said, ‘Anything in which there is a mention of Allah is good.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/556)"
        ],
        "index": 3678,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:14",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الْحُسَيْنِ بْنِ نُعَيْمٍ عَنْ مِسْمَعِ بْنِ عَبْدِ الْمَلِكِ قَالَ عَطَسَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ثُمَّ جَعَلَ إِصْبَعَهُ عَلَى أَنْفِهِ فَقَالَ رَغِمَ أَنْفِي لِلَّهِ رَغْماً دَاخِراً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Al Husayn Bin Nuaym, from Misma’a Bin Abdul Malik who said, ",
            "‘Once Abu Abdullah<sup>asws</sup> sneezed, so he<sup>asws</sup> said: ‘The Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds’, then made his<sup>asws</sup> fingers to be upon his nose, and he<sup>asws</sup> said: ‘I<sup>asws</sup> rub my<sup>asws</sup> nose for Allah<sup>azwj</sup>, a humble rubbing’."
          ],
          "en.sarwar": [
            "14. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from al-Husayn ibn Nu’aym from Misma’ ibn ‘Abd al- Malik who has said the following: “Once abu ‘Abd Allah (a.s.) sneezed and said, ‘All praise belongs to Allah, Lord of the worlds,’ then he placed his finger over his nose and said, ‘Humble is my nose before Allah with complete humility.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/557)"
        ],
        "index": 3679,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:15",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ أَحْمَدَ بْنِ النَّضْرِ عَنْ مُحَمَّدِ بْنِ مَرْوَانَ رَفَعَهُ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) مَنْ قَالَ إِذَا عَطَسَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ عَلَى كُلِّ حَالٍ لَمْ يَجِدْ وَجَعَ الْأُذُنَيْنِ وَ الْأَضْرَاسِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Salim, from Ahmad Bin Al Nazar, from Muhammad Bin Marwan, raising it, said, ",
            "‘Amir Al-Momineen<sup>asws</sup> said: ‘The one who says when he sneezes, ‘The Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds, upon every state’, would not find pain of the ears and the teeth, (ever)’."
          ],
          "en.sarwar": [
            "15. Abu Ali al-Ash’ari has narrated from Muhammad ibn Salim from Ahmad ibn al- Nadr from Muhammad ibn Marwan in a marfu’ manner from Amir al-Mu’minin, Ali ibn abu Talib (a.s.) who has said the following: “Amir al-Mu’minin, Ali ibn abu Talib (a.s.) has said, ‘Whoever upon sneezing says, “All praise belongs to Allah, Lord of the worlds, in all conditions, will not suffer from pain in his ears and teeth.”’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/557)"
        ],
        "index": 3680,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:16",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ أَوْ غَيْرِهِ عَنِ ابْنِ فَضَّالٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي وَجَعِ الْأَضْرَاسِ وَ وَجَعِ الْآذَانِ إِذَا سَمِعْتُمْ مَنْ يَعْطِسُ فَابْدَءُوهُ بِالْحَمْدِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, or someone else, from Ibn Fazzal, from one of his companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said regarding pain of the teeth and pain of the ears: ‘Whenever he Names (Allah<sup>azwj</sup>), the one who sneezes, so he should begin with the Praise (Al-Hamd)’."
          ],
          "en.sarwar": [
            "16. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad and others from ibn Faddal from certain individuals of his people from abu ‘Abd Allah (a.s.) who has said the following: “For a tooth and earache when you hear a person sneeze, you should first say, ‘All praise belongs to Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/557)"
        ],
        "index": 3681,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:17",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنْ عُثْمَانَ عَنْ أَبِي أُسَامَةَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَنْ سَمِعَ عَطْسَةً فَحَمِدَ اللَّهَ عَزَّ وَ جَلَّ وَ صَلَّى عَلَى النَّبِيِّ ( صلى الله عليه وآله ) وَ أَهْلِ بَيْتِهِ لَمْ يَشْتَكِ عَيْنَيْهِ وَ لَا ضِرْسَهُ ",
          "ثُمَّ قَالَ إِنْ سَمِعْتَهَا فَقُلْهَا وَ إِنْ كَانَ بَيْنَكَ وَ بَيْنَهُ الْبَحْرُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Salih Bin Al Sindy, from Ja’far Bin Bashir, from Usman, from Abu Asama who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The one who Names (Allah<sup>azwj</sup> in response) to a sneeze, so he should Praise Allah<sup>azwj</sup> Mighty and Majestic and send <span class=\"iTxt\">Salawāt</span> upon the Prophet<sup>saww</sup> and the People<sup>asws</sup> of his<sup>saww</sup> Household, he would not be complaining of his eyes, nor his teeth (pain)’. ",
            "Then he<sup>asws</sup> said: ‘If you hear it (the sneeze), so say it (the Naming of Allah<sup>azwj</sup>), and even if there is the ocean in between you and him’."
          ],
          "en.sarwar": [
            "17. Ali ibn Ibrahim has narrated from his father from Salih ibn al-Sindi from Ja’far ibn Bashir from ‘Uthman from abu ‘Usamah who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘If one hears a person’s sneezing and praises Allah, the Most Majestic, the Most Holy, and asks Allah to grant al-Salat (favors) upon Muhammad and the Ahl al-Bayt (family of Muhammad), he will not suffer from a toothache or eye trouble.’ The Imam then said, ‘When you hear it (sneezing) respond to it even if there is an ocean between you and the person sneezing.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/557)"
        ],
        "index": 3682,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:18",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ بَعْضِ أَصْحَابِهِ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ عَطَسَ رَجُلٌ نَصْرَانِيٌّ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لَهُ الْقَوْمُ هَدَاكَ اللَّهُ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَقُولُوا يَرْحَمُكَ اللَّهُ فَقَالُوا لَهُ إِنَّهُ نَصْرَانِيٌّ فَقَالَ لَا يَهْدِيهِ اللَّهُ حَتَّى يَرْحَمَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from one of his companions, from Ibn Abu Najran, from one of our companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A Christian man sneezed in the presence of Abu Abdullah<sup>asws</sup>. So the people said to him, ‘May Allah<sup>azwj</sup> Guide you’. So Abu Abdullah<sup>asws</sup> said: ‘You should be saying, ‘May Allah<sup>azwj</sup> have Mercy on you’’. So they said to him<sup>asws</sup>, ‘He is a Christian’. So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> will not Guide him until He<sup>azwj</sup> has Mercy on him’."
          ],
          "en.sarwar": [
            "18. Abu Ali al-Ash’ari has narrated from certain individuals of his people from ibn abu Najran from certain individuals of our people from abu ‘ Abd Allah (a.s.) who has said the following: “Once a Christian man sneezed in the presence of abu ‘Abd Allah (a.s.) and the people said, ‘May Allah guide you.’ Abu ‘Abd Allah (a.s.) said, ‘Say, “May Allah grant you mercy.’” They said, ‘He is a Christian.’ The Imam said, ‘Allah will not guide him until He grants him mercy.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/557)"
        ],
        "index": 3683,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:19",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِذَا عَطَسَ الْمَرْءُ الْمُسْلِمُ ثُمَّ سَكَتَ لِعِلَّةٍ تَكُونُ بِهِ قَالَتِ الْمَلَائِكَةُ عَنْهُ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ فَإِنْ قَالَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ قَالَتِ الْمَلَائِكَةُ يَغْفِرُ اللَّهُ لَكَ  ",
          "قَالَ وَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْعُطَاسُ لِلْمَرِيضِ دَلِيلُ الْعَافِيَةِ وَ رَاحَةٌ لِلْبَدَنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Haroun Bin Muslim, from Mas’ada Bin Sadawa, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘When the Muslim man sneezes, then is silent due to an illness which happens to be with him, the Angels say on his behalf: ‘The Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds’. So if he does say, ‘The Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds’, then Angels would say: ‘May Allah<sup>azwj</sup> Forgive (your sins) for you’’. ",
            "He<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘A sneeze of the sick one is evidence of the well-being and the rest for the body’."
          ],
          "en.sarwar": [
            "19. Ali ibn Ibrahim has narrated from his father from Harun ibn Muslim from Mas’adah ibn Sadaqah from abu ‘Abd Allah (a.s.) who has said the following: “The Messenger of Allah has said, ‘When a Muslim person sneezes and remains silent for reasons of illness, the angels say for him, “All praise belongs to Allah, Lord of the worlds,” if he would say, ‘All praise belongs to Allah, Lord of the worlds the angels will say, “May Allah forgive you. ’’’’The narrator has said that the Holy Prophet has said, ‘Sneezing in a person suffering illness is an indication of good health and bodily comfort.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول أو ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/558)"
        ],
        "index": 3684,
        "local_index": 20,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:20",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ مُوسَى عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ عَبْدِ الصَّمَدِ بْنِ بَشِيرٍ عَنْ حُذَيْفَةَ بْنِ مَنْصُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ الْعُطَاسُ يَنْفَعُ فِي الْبَدَنِ كُلِّهِ مَا لَمْ يَزِدْ عَلَى الثَّلَاثِ فَإِذَا زَادَ عَلَى الثَّلَاثِ فَهُوَ دَاءٌ وَ سُقْمٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Musa, from Yaqoub Bi Yazeed, from Usman Bin Isa, from Abdul Samad Bin Bashir, from Huzeyfa Bin Mansour, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A sneeze is beneficial in the body, all of it, for as long as it does not increase upon the three (sneezes). So when it does exceed upon the three, so it is an illness and a disease’."
          ],
          "en.sarwar": [
            "20. Muhammad ibn Yahya has narrated from Muhammad ibn Musa from Ya’qub ibn Yazid from ‘Uthman ibn ‘Isa from ‘Abd al-Samad ibn Bash ‘Amir from Hudhayfah ibn Mansur from abu ‘Abd Allah (a.s.) who has said the following: “Sneezing is beneficial to all parts of the body if it is not more than three times, if it is more than three times then it is an illness and disease.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/558)"
        ],
        "index": 3685,
        "local_index": 21,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:21",
        "refs": {
          "Mentions": [
            "/books/quran:31:19"
          ]
        },
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ الْكُوفِيُّ عَنْ عَلِيِّ بْنِ الْحَسَنِ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ عَمِّهِ يَعْقُوبَ بْنِ سَالِمٍ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّ أَنْكَرَ الْأَصْواتِ لَصَوْتُ الْحَمِيرِ قَالَ الْعَطْسَةُ الْقَبِيحَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad Al Kufy, from Ali Bin Al Hassan, from Ali Bin Asbaat, from his uncle Yaqoub Bin Salim, from Abu Bakr Al Hazramy who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:31#h19\">[31:19]</a> surely the most hateful of voices is the voice of the donkeys</span>. He<sup>asws</sup> said: ‘The ugly sneezing’."
          ],
          "en.sarwar": [
            "21. Ahmad ibn Muhammad al-Kufi has narrated from Ali ibn al-Hassan from Ali ibn b t from his Uncle, Ya’qub n Salim from abu Bakr al-Hadrami who has said the following: “Once I asked abu ‘Abd Allah (a.s.) about the words of Allah, the Most Majestic, the Most Holy, ‘The most undesirable voice is the voice of donkeys.’ <a href=\"/#/books/quran:31#h19\">[31:19]</a> The Imam said, ‘It is a bad sneezing.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/558)"
        ],
        "index": 3686,
        "local_index": 22,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:22",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْقَاسِمِ بْنِ يَحْيَى عَنْ جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ عَطَسَ ثُمَّ وَضَعَ يَدَهُ عَلَى قَصَبَةِ أَنْفِهِ ثُمَّ قَالَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ الْحَمْدُ لِلَّهِ حَمْداً كَثِيراً كَمَا هُوَ أَهْلُهُ وَ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ النَّبِيِّ وَ آلِهِ وَ سَلَّمَ خَرَجَ مِنْ مَنْخِرِهِ الْأَيْسَرِ طَائِرٌ أَصْغَرُ مِنَ الْجَرَادِ وَ أَكْبَرُ مِنَ الذُّبَابِ حَتَّى يَسِيرَ تَحْتَ الْعَرْشِ يَسْتَغْفِرُ اللَّهَ لَهُ إِلَى يَوْمِ الْقِيَامَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Qasim Bin Yahya, from his grandfather Al Hassan Bin Rashid, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who sneezes, then places his hand upon a nostril of his nose, then says, ‘The Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds, abundant Praise just as He<sup>azwj</sup> is Rightful of it, and <span class=\"iTxt\">Salawāt</span> of Allah<sup>azwj</sup> be upon Muhammad<sup>saww</sup> the Prophet<sup>saww</sup> and his<sup>saww</sup> Progeny<sup>asws</sup>, and greetings’, there would come out from his left nostril, a bird smaller than the locust, and larger than the fly, until it travels to be beneath the Throne, seeking Forgiveness of Allah<sup>azwj</sup> for him up to the Day of Judgment’."
          ],
          "en.sarwar": [
            "22. Muhammad ibn Y ahya has narrated from Ahmad ibn Muhammad from al-Qasim ibn Yahya from his grandfather al-Hassan ibn Rashid from abu ‘Abd Allah (a.s.) who has said the following: “If one sneezes, places his hand over his nose and says, ‘All praise belongs to Allah, Lord of the worlds, (all praise belongs to Allah), a great deal of praise, as He deserves, Allah has granted al-Salat (favors) and peace upon Muhammad, His Holy Prophet, and the Ahl al-Bay (family of Muhammad), a small flying thing, smaller than a grasshopper and larger than a fly, will come out of his left nostril until it reaches beneath the Throne and asks for him forgiveness from Allah to the Day of Judgment.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف أو مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/558)"
        ],
        "index": 3687,
        "local_index": 23,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:23",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِهِ رَوَاهُ عَنْ رَجُلٍ مِنَ الْعَامَّةِ قَالَ كُنْتُ أُجَالِسُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَلَا وَ اللَّهِ مَا رَأَيْتُ مَجْلِساً أَنْبَلَ مِنْ مَجَالِسِهِ قَالَ فَقَالَ لِي ذَاتَ يَوْمٍ مِنْ أَيْنَ تَخْرُجُ الْعَطْسَةُ فَقُلْتُ مِنَ الْأَنْفِ فَقَالَ لِي أَصَبْتَ الْخَطَأَ فَقُلْتُ جُعِلْتُ فِدَاكَ مِنْ أَيْنَ تَخْرُجُ فَقَالَ مِنْ جَمِيعِ الْبَدَنِ كَمَا أَنَّ النُّطْفَةَ تَخْرُجُ مِنْ جَمِيعِ الْبَدَنِ وَ مَخْرَجُهَا مِنَ الْإِحْلِيلِ ",
          "ثُمَّ قَالَ أَ مَا رَأَيْتَ الْإِنْسَانَ إِذَا عَطَسَ نُفِضَ أَعْضَاؤُهُ وَ صَاحِبُ الْعَطْسَةِ يَأْمَنُ الْمَوْتَ سَبْعَةَ أَيَّامٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from one of his companions, reporting it from a man from the general Muslims having said, ",
            "‘I used to sit in a gathering of Abu Abdullah<sup>asws</sup>, so, by Allah<sup>azwj</sup>, I had not seen a gathering nobler than his<sup>asws</sup> gathering. He<sup>asws</sup> said to me one day, ‘From where does the sneeze come out?’ So I said, ‘From the nose’. So he<sup>asws</sup> said to me: ‘You are wrong’. So I said, ‘May I be sacrificed for you<sup>asws</sup>! From where does it come out?’ So he<sup>asws</sup> said: ‘From the entire body, just as the sperm comes out from the entire body, and its exit is from the urethra’. ",
            "Then he<sup style=\"font-weight: normal\">asws</sup> said: ‘Have you not seen the person when he sneezes, his body parts shake? And the sneezer is safe from the death for seven days’."
          ],
          "en.sarwar": [
            "23. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from certain individuals of his people from a man of ‘Ammah (non-Shi ’a) who has said the following: “I would sit in the meeting place of abu ‘Abd Allah (a.s.) I swear by Allah that I had not seen any meeting place nobler than his meeting place. One day he asked me, ‘Where from does sneeze come?’ I said, ‘It comes out of the nose.’ He said, ‘You have got it wrong.’ I then said, ‘May Allah keep my soul in service for your cause, from where does it come?’ The Imam said, ‘It comes from the whole body, just as a reproductive seed comes out of the whole body and its exit is through penis.’ The Imam then asked, ‘Have you noted that when one sneezes his whole body moves and a person sneezing is safe from death for seven days?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/559)"
        ],
        "index": 3688,
        "local_index": 24,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:24",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) تَصْدِيقُ الْحَدِيثِ عِنْدَ الْعُطَاسِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘is sneezing is a sign of the truthfulness (of a speaker)’."
          ],
          "en.sarwar": [
            "24. Ali ibn Ibrahim has narrated from his father from al-Nawfali from al-Sakuni from abu ‘Abd Allah (a.s.) who has said the following: ‘‘The Messenger of Allah has said, ‘Sneezing is a sign of truthfulness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/559)"
        ],
        "index": 3689,
        "local_index": 25,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:25",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِذَا كَانَ الرَّجُلُ يَتَحَدَّثُ بِحَدِيثٍ فَعَطَسَ عَاطِسٌ فَهُوَ شَاهِدُ حَقٍّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘When the man was narrating with a Hadeeth, so a sneezer sneezes, so it is a testimony of truthfulness’."
          ],
          "en.sarwar": [
            "25. Ali ibn Ibrahim has narrated from his father from al-Nawfali from al-Sakuni from abu ‘Abd Allah (a.s.) who has said the following: ‘‘The Messenger of Allah has said, ‘If a man is speaking about something and someone sneezes, this is evidence of the truth.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/559)"
        ],
        "index": 3690,
        "local_index": 26,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:26",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الْأَشْعَرِيِّ عَنِ ابْنِ الْقَدَّاحِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) تَصْدِيقُ الْحَدِيثِ عِنْدَ الْعُطَاسِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ja’far Bin Muhammad Al Ashary, from Ibn Al Qaddah, from Ibn Abu Umeyr, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The sneezing is the ratification of truthfulness of a person’s words’."
          ],
          "en.sarwar": [
            "26. A number of our people have narrated from Sahl ibn Ziyad from Ja’far ibn Muhammad al-Ash’ari from ibn al-Qaddah from ibn abu ‘Umayr from abu ‘Abd Allah (a.s.) who has said the following: ‘‘The Messenger of Allah has said, ‘Sneezing is verification of the truthfulness of a person’s words.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/559)"
        ],
        "index": 3691,
        "local_index": 27,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:15:27",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَسِّنِ بْنِ أَحْمَدَ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِذَا عَطَسَ الرَّجُلُ ثَلَاثاً فَسَمِّتْهُ ثُمَّ اتْرُكْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Muhassin Bin Ahmad, from Aban Bin usman, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When a man sneezes three (times), so Name (Allah<sup>azwj</sup> in response) and leave him (if he sneezes any more)’."
          ],
          "en.sarwar": [
            "27. A number of our people have narrated from Ahmad ibn Muhammad from Muhsin ibn Ahmad from Aban ibn ‘Uthman from Zurara from abu Ja’far (a.s.) who has said the following: “If one sneezes three times, the special expressions for this purpose should be said only up to three times and thereafter should be left alone.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:4:15",
  "kind": "verse_list"
}