{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:2:4",
        "titles": {
          "ar": "كِتَابُ الْعِشْرَةِ",
          "en": "THE BOOK OF SOCIAL RELATIONSHIPS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 2"
        },
        "path": "/books/al-kafi:2:4:2",
        "titles": {
          "ar": "بَابُ حُسْنِ الْمُعَاشَرَةِ",
          "en": "Chapter 2 – Excellent social relations"
        }
      }
    ],
    "index": 473,
    "local_index": 2,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:2:4:3",
        "titles": {
          "ar": "بَابُ مَنْ يَجِبُ مُصَادَقَتُهُ وَ مُصَاحَبَتُهُ",
          "en": "Chapter 3 – The one whose friendship and companionship is Obligated"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 1"
        },
        "path": "/books/al-kafi:2:4:1",
        "titles": {
          "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>َابُ مَا يَجِبُ مِنَ</span> الْمُعَاشَرَةِ",
          "en": "Chapter 1 – What is Obligated from the Social Relations"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:2:4",
        "titles": {
          "ar": "كِتَابُ الْعِشْرَةِ",
          "en": "THE BOOK OF SOCIAL RELATIONSHIPS"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:4:2",
    "titles": {
      "ar": "بَابُ حُسْنِ الْمُعَاشَرَةِ",
      "en": "Chapter 2 – Excellent social relations"
    },
    "verse_count": 5,
    "verse_start_index": 3588,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/529)"
        ],
        "index": 3589,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:2:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) مَنْ خَالَطْتَ فَإِنِ اسْتَطَعْتَ أَنْ تَكُونَ يَدُكَ الْعُلْيَا عَلَيْهِمْ فَافْعَلْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad, from Hareyz, from Mhammad Bin Muslim who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘The one who inter-mingles (with the people), so if you can maintain an upper hand (more giving than receiving), then do so’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Hammad from Hariz from Muhammad ibn Muslim who has said the following: “Whoever you associate with, if you can maintain an upper hand (in your dealings with him) do so (be more beneficial).” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/529)"
        ],
        "index": 3590,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:2:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ حَفْصٍ عَنْ أَبِي الرَّبِيعِ الشَّامِيِّ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ الْبَيْتُ غَاصٌّ بِأَهْلِهِ فِيهِ الْخُرَاسَانِيُّ وَ الشَّامِيُّ وَ مِنْ أَهْلِ الْآفَاقِ فَلَمْ أَجِدْ مَوْضِعاً أَقْعُدُ فِيهِ فَجَلَسَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ كَانَ مُتَّكِئاً ",
          "ثُمَّ قَالَ يَا شِيعَةَ آلِ مُحَمَّدٍ اعْلَمُوا أَنَّهُ لَيْسَ مِنَّا مَنْ لَمْ يَمْلِكْ نَفْسَهُ عِنْدَ غَضَبِهِ وَ مَنْ لَمْ يُحْسِنْ صُحْبَةَ مَنْ صَحِبَهُ وَ مُخَالَقَةَ مَنْ خَالَقَهُ وَ مُرَافَقَةَ مَنْ رَافَقَهُ وَ مُجَاوَرَةَ مَنْ جَاوَرَهُ وَ مُمَالَحَةَ مَنْ مَالَحَهُ يَا شِيعَةَ آلِ مُحَمَّدٍ اتَّقُوا اللَّهَ مَا اسْتَطَعْتُمْ وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ismail Bin Mihran, from Muhammad Bin Jafs, from Abu Al Rabi’e Al Shamy who said, ",
            "‘I went over to Abu Abdullah<sup>asws</sup> and the room was crowded with his<sup>asws</sup> family members. Among them were (people from) Khurasan, and (people from) Syria, and from the people of the outskirts (of the city). So I could not find a place to sit in, and Abu Abdullah<sup>asws</sup> was seated, and reclining. ",
            "Then he<sup>asws</sup> said: ‘O Shias of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>! Know, that he is not from us<sup>asws</sup>, the one who does not control his own self during his anger, and the one who is not a good companion with his companions, and (of good) manners with the ones who display good mannerisms with him, and (of good) friendship with the one who is a friend of his, and (of goodly) neighbourliness with his neighbour, and (of good) table manners with the ones who eat with him. O Shias of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>! Fear Allah<sup>azwj</sup> whatever your capacity is, and there is neither Might nor Strength except with Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Isma’il ibn Mehran from Muhammad ibn Hafs from abu al-Rabi’ al-Shami who has said the following: “Once I went in the presence of abu ‘Abd Allah (a.s.) and the house was full of people. There were people from Khurasan, from al-Sham and from various horizons and I could not find a place to sit. Abu ‘Abd Allah (a.s.) sat in his place and he was leaning against a pillow. He said, ‘O Shi’a (followers) of the family of Muhammad (a.s.) bear in mind that one who is not able to control his soul when angry is not from us, and so also is one who does not better his association with his associates, show proper behavior with those who exercise proper behavior, befriend those who befriend him, provide protection to those who protect him, observe proper table manners with those who share with him the table. O Shi’a (followers) of the family of Muhammad (a.s.) be pious before Allah to the best of your abilities. There are no means and no power without Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/530)"
        ],
        "index": 3591,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:2:3",
        "refs": {
          "Quran": [
            "/books/quran:12:36"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّا نَراكَ مِنَ الْمُحْسِنِينَ قَالَ كَانَ يُوَسِّعُ الْمَجْلِسَ وَ يَسْتَقْرِضُ لِلْمُحْتَاجِ وَ يُعِينُ الضَّعِيفَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from the one who mentioned it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:12#h36\">[12:36]</a> we see you to be of the doers of good</span>. He<sup>asws</sup> said: ‘He<sup>as</sup> (Prophet Yusuf<sup>as</sup>), used to make space (for others) in the gatherings, and lend to the needy, and assist the weak ones’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from those whom he has mentioned (in his book) from abu ‘Abd Allah (a.s.) who has said the following: “About the words of Allah, the Most Majestic, the Most Holy, ‘We believe you to be a righteous person,’ <a href=\"/#/books/quran:12#h36\">[12:36]</a> the Imam said, ‘He would make room for others in a gathering, lend money to the needy and assist the weak.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/530)"
        ],
        "index": 3592,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:2:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَلَاءِ بْنِ الْفُضَيْلِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ أَبُو جَعْفَرٍ ( عليه السلام ) يَقُولُ عَظِّمُوا أَصْحَابَكُمْ وَ وَقِّرُوهُمْ وَ لَا يَتَهَجَّمْ بَعْضُكُمْ عَلَى بَعْضٍ وَ لَا تَضَارُّوا وَ لَا تَحَاسَدُوا وَ إِيَّاكُمْ وَ الْبُخْلَ كُونُوا عِبَادَ اللَّهِ الْمُخْلَصِينَ الصَّالِحِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Ala’a Bin Al Fuzayl, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Abu Ja’far<sup>asws</sup> was saying: ‘Venerate your companions and dignify them, and you should neither attack each other, nor harm, nor envy (each other); and beware of the stinginess. Become the servants of Allah<sup>azwj</sup>, the sincere, the righteous’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from ‘Ala’ ibn al-Fudayl from abu ‘Abd Allah (a.s.) who has said the following: “Abu Ja’far (a.s.) would say, ‘Show respect for your friends and dignify them. Do not be aggressive to each other, do not harm or envy each other. Beware of stinginess and be sincere and righteous servants of Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/530)"
        ],
        "index": 3593,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:2:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَجَّالِ عَنْ دَاوُدَ بْنِ أَبِي يَزِيدَ وَ ثَعْلَبَةَ وَ عَلِيِّ بْنِ عُقْبَةَ عَنْ بَعْضِ مَنْ رَوَاهُ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ الِانْقِبَاضُ مِنَ النَّاسِ مَكْسَبَةٌ لِلْعَدَاوَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hajjal, from Dawood Bin Abu Yazeed and Sa’alba, and Ali Bin Uqba, from someone of reported it, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) having said: ‘The seizing (faulting everything someone says) from the people, earns the animosity’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hajjal from Dawud ibn abu Yazid and Tha’Labah and Ali ibn ‘Aqabah from certain individuals who narrated to him from one of the two Imam (a.s.) who has said the following: “Restraint from associating people brings in their animosity.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:4:2",
  "kind": "verse_list"
}