{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:2:4",
        "titles": {
          "ar": "كِتَابُ الْعِشْرَةِ",
          "en": "THE BOOK OF SOCIAL RELATIONSHIPS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:2:4:3",
        "titles": {
          "ar": "بَابُ مَنْ يَجِبُ مُصَادَقَتُهُ وَ مُصَاحَبَتُهُ",
          "en": "Chapter 3 – The one whose friendship and companionship is Obligated"
        }
      }
    ],
    "index": 474,
    "local_index": 3,
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:4:3",
    "titles": {
      "ar": "بَابُ مَنْ يَجِبُ مُصَادَقَتُهُ وَ مُصَاحَبَتُهُ",
      "en": "Chapter 3 – The one whose friendship and companionship is Obligated"
    },
    "verse_count": 6,
    "verse_start_index": 3593,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/530)"
        ],
        "index": 3594,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:3:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ حُسَيْنِ بْنِ الْحَسَنِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَمَّارِ بْنِ مُوسَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) لَا عَلَيْكَ أَنْ تَصْحَبَ ذَا الْعَقْلِ وَ إِنْ لَمْ تَحْمَدْ كَرَمَهُ وَ لَكِنِ انْتَفِعْ بِعَقْلِهِ وَ احْتَرِسْ مِنْ سَيِّئِ أَخْلَاقِهِ وَ لَا تَدَعَنَّ صُحْبَةَ الْكَرِيمِ وَ إِنْ لَمْ تَنْتَفِعْ بِعَقْلِهِ وَ لَكِنِ انْتَفِعْ بِكَرَمِهِ بِعَقْلِكَ وَ افْرِرْ كُلَّ الْفِرَارِ مِنَ اللَّئِيمِ الْأَحْمَقِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Husayn Bin Al Hassan, from Muhammad Bin Sinan, from Ammar Bin Musa, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup>said: ‘It is upon you that you accompany the one with the intellect and even though you may not consider his benevolences as praiseworthy, but you can benefit by his intellect, and watch out from his evil mannerisms; and do not leave the company of the benevolent and even though you may not benefit by his intellect, but you would benefit from his benevolence by your own intellect; but flee very far away from a lowly and an idiot’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from Husayn ibn al-Hassan from Muhammad ibn Sinan from ‘Ammar ibn Musa from abu ‘Abd Allah (a.s.) who has said the following: “Amir al-Mu’minin, Ali ibn abu Talib (a.s.) has said, ‘It is not against you to associate with a person of reason even though you may not appreciate his generosity but you can benefit from his reason. However, you must avoid his immoral manners. Do not ignore the association of a magnanimous person, even though you may not benefit from his reason but you can benefit from his magnanimity by the help of your own reason. Flee, very far away from a power- hungry, irrational person.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/531)"
        ],
        "index": 3595,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:3:2",
        "text": [
          "عَنْهُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نَجْرَانَ عَنْ مُحَمَّدِ بْنِ الصَّلْتِ عَنْ أَبَانٍ عَنْ أَبِي الْعُدَيْسِ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) يَا صَالِحُ اتَّبِعْ مَنْ يُبْكِيكَ وَ هُوَ لَكَ نَاصِحٌ وَ لَا تَتَّبِعْ مَنْ يُضْحِكُكَ وَ هُوَ لَكَ غَاشٌّ وَ سَتَرِدُونَ عَلَى اللَّهِ جَمِيعاً فَتَعْلَمُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Abdul Rahman Bin Abu Najran, from Muhammad Bin Al Salt, from Aban, from Abu Al Udays who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘O Salih! Follow the one makes you cry and he is an adviser to you, and do not follow the one who makes you laugh and he is a swindler to you, and all of you would be returning to Allah<sup>azwj</sup> and will find out’."
          ],
          "en.sarwar": [
            "2. It is narrated from him (narrator of the Hadith above) from ‘Abd al-Rahman ibn abu Najran from Muhammad ibn al-Salt from Aban from abu al-’Udays who has said the following: “O Salih, follow the one who makes you cry while providing good advice and do not follow the one who makes you laugh but is cheating. You will all return to Allah and will find out.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول أو ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/531)"
        ],
        "index": 3596,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:3:3",
        "text": [
          "عَنْهُ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُوسَى بْنِ يَسَارٍ الْقَطَّانِ عَنِ الْمَسْعُودِيِّ عَنْ أَبِي دَاوُدَ عَنْ ثَابِتِ بْنِ أَبِي صَخْرَةَ عَنْ أَبِي الزَّعْلَى قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) انْظُرُوا مَنْ تُحَادِثُونَ فَإِنَّهُ لَيْسَ مِنْ أَحَدٍ يَنْزِلُ بِهِ الْمَوْتُ إِلَّا مُثِّلَ لَهُ أَصْحَابُهُ إِلَى اللَّهِ إِنْ كَانُوا خِيَاراً فَخِيَاراً وَ إِنْ كَانُوا شِرَاراً فَشِرَاراً وَ لَيْسَ أَحَدٌ يَمُوتُ إِلَّا تَمَثَّلْتُ لَهُ عِنْدَ مَوْتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Muhammad Bin Ali, from Musa Bin Yasaar Al qataan, from Al Masoudy, from Abu Dawood, from Sabit Bin Abu Sakhra, from Abu Al Za’ly who said, ",
            "‘Amir Al-Momineen<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘Consider the ones you are talking to (associating with), for there is no one who dies except an image of his (associate) is presented to him by Allah<sup>azwj</sup> – if he was good, so good, and if he was evil, so evil; and there is no one who is dying except I<sup>asws</sup> come to him (in person) during his death’."
          ],
          "en.sarwar": [
            "3. It is narrated from him (narrator of the Hadith above) from Muhammad ibn Ali from Musa ibn Yasar al-Qattan from al-Mas’udi from Dawud from Thabit ibn abu Sakhrah from abu al-Za’Li who has said the following: “Amir al-Mu’minin, Ali ibn abu Talib (a.s.) has said that the Messenger of Allah has said, ‘Consider who you talk to (make friendship). Everyone after death will find the forms of his associates in the presence of Allah; these forms follow the worldly origins. A good form is from a good origin and an evil form is from an evil origin. At the time of his death everyone observes me in my person.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/531)"
        ],
        "index": 3597,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:3:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ بَعْضِ الْحَلَبِيِّينَ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ رَجُلٍ مِنْ أَهْلِ الْجَبَلِ لَمْ يُسَمِّهِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَلَيْكَ بِالتِّلَادِ وَ إِيَّاكَ وَ كُلَّ مُحْدَثٍ لَا عَهْدَ لَهُ وَ لَا أَمَانَ وَ لَا ذِمَّةَ وَ لَا مِيثَاقَ وَ كُنْ عَلَى حَذَرٍ مِنْ أَوْثَقِ النَّاسِ عِنْدَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from one of the (people of) Al Halab, from Abdullah Bin Muskan, from a man from the people of the mountains, not being named, who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘(It is) upon you (to maintain) good relations with your old associates and friends, be cautious about a new one who does not have any commitment, responsibility or protection and always avoid (observe caution) from the most reliable of the people in your presence’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from certain individuals from al-Halab from ‘Abd Allah ibn Muskan from a man from people of al-Jabal whose name is not mentioned and who has said the following: “You should maintain good relations with your old associates and friends, be cautious about a new one who does not have any protection, responsibility, or commitment and always avoid (caution) the one whom you trust the most.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/532)"
        ],
        "index": 3598,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:3:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ رَفَعَهُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَحَبُّ إِخْوَانِي إِلَيَّ مَنْ أَهْدَى إِلَيَّ عُيُوبِي ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, ",
            "(It has been narrated) raising it to Abu Abdullah<sup>asws</sup> having said: ‘The most beloved of my brethren to me is the one who points out to me my faults’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Ahmad ibn Muhammad in a marfu’ manner from abu ‘Abd Allah (a.s.) who has said the following: “To me, the most beloved of my brethren (friends) is the one who most points out my defects to me.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/532)"
        ],
        "index": 3599,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:3:6",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ عَنْ عُبَيْدِ اللَّهِ الدِّهْقَانِ عَنْ أَحْمَدَ بْنِ عَائِذٍ عَنْ عُبَيْدِ اللَّهِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا تَكُونُ الصَّدَاقَةُ إِلَّا بِحُدُودِهَا فَمَنْ كَانَتْ فِيهِ هَذِهِ الْحُدُودُ أَوْ شَيْ‏ءٌ مِنْهَا فَانْسُبْهُ إِلَى الصَّدَاقَةِ وَ مَنْ لَمْ يَكُنْ فِيهِ شَيْ‏ءٌ مِنْهَا فَلَا تَنْسُبْهُ إِلَى شَيْ‏ءٍ مِنَ الصَّدَاقَةِ ",
          "فَأَوَّلُهَا أَنْ تَكُونَ سَرِيرَتُهُ وَ عَلَانِيَتُهُ لَكَ وَاحِدَةً وَ الثَّانِي أَنْ يَرَى زَيْنَكَ زَيْنَهُ وَ شَيْنَكَ شَيْنَهُ وَ الثَّالِثَةُ أَنْ لَا تُغَيِّرَهُ عَلَيْكَ وِلَايَةٌ وَ لَا مَالٌ وَ الرَّابِعَةُ أَنْ لَا يَمْنَعَكَ شَيْئاً تَنَالُهُ مَقْدُرَتُهُ وَ الْخَامِسَةُ وَ هِيَ تَجْمَعُ هَذِهِ الْخِصَالَ أَنْ لَا يُسْلِمَكَ عِنْدَ النَّكَبَاتِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Al Hassan, from Ubeydullah Al Dihqan, from Ahmad Bin A’iz, from Ubeydullah Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The friendship cannot happen to be except by its limits. So the one in whom there were these limits, or something from these, so join his friendship; and the one who does not happen to have anything from these, so do not establish any (form of) friendship with him. ",
            "So the first of these is that his private and his public (behaviour) to you should happen to be one (and the same); and the second is that he would see your goodness as being his goodness, and your fault (troubles) as being his fault (troubles); and the third is that he would neither be at variance with you, neither due to authority nor wealth; and the fourth is that he would not deprive you of anything - that would benefit you which is in his ability; and the fifth, and it is the summary of these qualities, is that he would not abandon you during the calamities’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Ahmad ibn Muhammad from Muhammad ibn al-Hassan from ‘Ubayd Allah al-Dehqan from Ahmad ibn ‘A’idh from ‘Ubayd Allah al-Halabi from abu ‘Abd Allah (a.s.) who has said the following: “There can be no friendship without its rules. You may call one a friend only when he follows such rules and those who do not follow such rules cannot be called a friend. First of all a friend must be the same inside and outside. Secondly, he must consider your beauty his own beauty and your flaw as his flaw. Thirdly that he does not change because of high position and wealth. Fourth, that he does not hold back from you what is within his capabilities. Fifth, with the above, he does not leave you out in unfortunate circumstances.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:4:3",
  "kind": "verse_list"
}