{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 2"
        },
        "path": "/books/al-kafi:2",
        "titles": {
          "ar": "الجزء الثاني‏",
          "en": "Volume Two"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:2:4",
        "titles": {
          "ar": "كِتَابُ الْعِشْرَةِ",
          "en": "THE BOOK OF SOCIAL RELATIONSHIPS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 4"
        },
        "path": "/books/al-kafi:2:4:4",
        "titles": {
          "ar": "بَابُ مَنْ تُكْرَهُ مُجَالَسَتُهُ وَ مُرَافَقَتُهُ",
          "en": "Chapter 4 – The one whose association and friendship is disliked"
        }
      }
    ],
    "index": 475,
    "local_index": 4,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 5"
        },
        "path": "/books/al-kafi:2:4:5",
        "titles": {
          "ar": "بَابُ التَّحَبُّبِ إِلَى النَّاسِ وَ التَّوَدُّدِ إِلَيْهِمْ",
          "en": "Chapter 5 – Endearment to the people and the cordiality towards them"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:2:4:3",
        "titles": {
          "ar": "بَابُ مَنْ يَجِبُ مُصَادَقَتُهُ وَ مُصَاحَبَتُهُ",
          "en": "Chapter 3 – The one whose friendship and companionship is Obligated"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:2:4",
        "titles": {
          "ar": "كِتَابُ الْعِشْرَةِ",
          "en": "THE BOOK OF SOCIAL RELATIONSHIPS"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:2:4:4",
    "titles": {
      "ar": "بَابُ مَنْ تُكْرَهُ مُجَالَسَتُهُ وَ مُرَافَقَتُهُ",
      "en": "Chapter 4 – The one whose association and friendship is disliked"
    },
    "verse_count": 11,
    "verse_start_index": 3599,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/533)"
        ],
        "index": 3600,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:4:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ سَالِمٍ الْكِنْدِيِّ عَمَّنْ حَدَّثَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِذَا صَعِدَ الْمِنْبَرَ قَالَ يَنْبَغِي لِلْمُسْلِمِ أَنْ يَتَجَنَّبَ مُوَاخَاةَ ثَلَاثَةٍ الْمَاجِنِ الْفَاجِرِ وَ الْأَحْمَقِ وَ الْكَذَّابِ ",
          "فَأَمَّا الْمَاجِنُ الْفَاجِرُ فَيُزَيِّنُ لَكَ فِعْلَهُ وَ يُحِبُّ أَنَّكَ مِثْلُهُ وَ لَا يُعِينُكَ عَلَى أَمْرِ دِينِكَ وَ مَعَادِكَ وَ مُقَارَبَتُهُ جَفَاءٌ وَ قَسْوَةٌ وَ مَدْخَلُهُ وَ مَخْرَجُهُ عَارٌ عَلَيْكَ ",
          "وَ أَمَّا الْأَحْمَقُ فَإِنَّهُ لَا يُشِيرُ عَلَيْكَ بِخَيْرٍ وَ لَا يُرْجَى لِصَرْفِ السُّوءِ عَنْكَ وَ لَوْ أَجْهَدَ نَفْسَهُ وَ رُبَّمَا أَرَادَ مَنْفَعَتَكَ فَضَرَّكَ فَمَوْتُهُ خَيْرٌ مِنْ حَيَاتِهِ وَ سُكُوتُهُ خَيْرٌ مِنْ نُطْقِهِ وَ بُعْدُهُ خَيْرٌ مِنْ قُرْبِهِ ",
          "وَ أَمَّا الْكَذَّابُ فَإِنَّهُ لَا يَهْنِئُكَ مَعَهُ عَيْشٌ يَنْقُلُ حَدِيثَكَ وَ يَنْقُلُ إِلَيْكَ الْحَدِيثَ كُلَّمَا أَفْنَى أُحْدُوثَةً مَطَرَهَا بِأُخْرَى مِثْلِهَا حَتَّى إِنَّهُ يُحَدِّثُ بِالصِّدْقِ فَمَا يُصَدَّقُ وَ يُفَرِّقُ بَيْنَ النَّاسِ بِالْعَدَاوَةِ فَيُنْبِتُ السَّخَائِمَ فِي الصُّدُورِ ",
          "فَاتَّقُوا اللَّهَ عَزَّ وَ جَلَّ وَ انْظُرُوا لِأَنْفُسِكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Imran Bin Usman, from Muhammad Bin Salim Al Kindy, from the one who narrated it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It was so that when Amir Al-Momineen<sup>asws</sup> ascended the Pulpit, said: ‘It is befitting for the Muslim that he keeps aside from establishing brotherhood with three – the shameless immoral, and the idiot, and the liar. ",
            "So, as for the shameless immoral one, so he would decorate his deed to you and he would love it if you were like him, and he would not assist you upon a matter of your Religion and your Hereafter; and his closeness is aversion, and harshness, and his entry and his exit (from your presence) would be a discredit upon you.",
            "And as for the idiot, so he would neither indicate upon you with goodness, nor would he hope for the repelling of the evil from you; and if he were to exert himself and sometimes intends to benefit you, so he would harm you (instead). Thus, his death would be better than his life, and his silence would be better than his speaking, and his remoteness would be better than his closeness.",
            "And as for the liar, for the life would not be pleasant with him. He would transmit your narration (to others) and he would bring the narrations (of the others) to you. Every time his discussion runs out, he would mingle it with another one similar to it, to the extent that (when) he does narrate with the truthfulness, so he would not be believed, and he would (end up) effecting separation between the people with the enmity, as he would be sowing the hatred in the chests.  ",
            "Therefore, fear Allah<sup>azwj</sup> Mighty and Majestic, and watch out for yourselves’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ‘Amr Aban ibn ‘Uthman ‘Uthman from Muhammad ibn Salim al-Kindy from those whom he has mentioned (in his book) from abu ‘Abd Allah (a.s.) who has said the following: “When Amir al-Mu’minin, Ali ibn abu Talib (a.s.) were to take his place on the pulpit he would say, ‘A Muslim, must avoid friendship with three kinds of people: A bold-faced indecent, an idiot and a liar. A bold-faced- indecent person attempts to make his acts seem attractive to you and loves that you behave like he does. Fie does not assist you in your religious matters and the matters of the hereafter. Closeness to him is injustice, hardheartedness, and his coming and going is disgrace for you. ‘An idiotic person does not indicate anything good for you, nor is there any hope in him to remove any bit of evil from you even if he may try his best. Perhaps he may want to benefit you, instead he only harms you. His death is better than his living, his silence is better than his speaking, and his being at a distance is better than his being nearby. ‘The liar is one with whom you can never have a happy life. Fie carries your words out and others’ words in to you. Whenever he may run out of words he then mixes them with others so much so that even when speaking the truth is not believed and he causes differences among people with animosity to sow envy in the hearts. You must be pious before Allah, the Most Majestic, the Most Floly, and look after your own souls.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/533)"
        ],
        "index": 3601,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:4:2",
        "text": [
          "وَ فِي رِوَايَةِ عَبْدِ الْأَعْلَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) لَا يَنْبَغِي لِلْمَرْءِ الْمُسْلِمِ أَنْ يُوَاخِيَ الْفَاجِرَ فَإِنَّهُ يُزَيِّنُ لَهُ فِعْلَهُ وَ يُحِبُّ أَنْ يَكُونَ مِثْلَهُ وَ لَا يُعِينُهُ عَلَى أَمْرِ دُنْيَاهُ وَ لَا أَمْرِ مَعَادِهِ وَ مَدْخَلُهُ إِلَيْهِ وَ مَخْرَجُهُ مِنْ عِنْدِهِ شَيْنٌ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And in a report of Abdul A’ala, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘It is not befitting for the Muslim man that he establishes brotherhood with the immoral one for he would decorate his own deed to him, and he would love it if he would happen to be like him, and he would not assist him upon the matter of his world, nor a matter of his Hereafter; and his entry and his exit from his presence would be a disgrace upon him’."
          ],
          "en.sarwar": [
            "2. In the Hadith of ‘Abd al-‘Ala’ from abu ‘Abd Allah (a.s.) it is said that Amir al-Mu’minin, Ali ibn abu Talib (a.s.) said: “It is not proper for a Muslim man to become a friend of an indecent person; he tries to make his deeds seem attractive to him and loves that one to behave like him (indecent). He does not assist him in his religious matters or the matters of the hereafter. The coming and going of an indecent person is a disgrace to one.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/533)"
        ],
        "index": 3602,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:4:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ يُوسُفَ عَنْ مُيَسِّرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا يَنْبَغِي لِلْمَرْءِ الْمُسْلِمِ أَنْ يُوَاخِيَ الْفَاجِرَ وَ لَا الْأَحْمَقَ وَ لَا الْكَذَّابَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Usman Bin Isa, from Muhammad Bin Yusuf, from Muyassar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It is not befitting for the Muslim man that he establishes brotherhood with an immoral, nor an idiot, nor a liar’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad from ‘Uthman ibn ‘Isa from Muhammad ibn Yusuf from Maysir from abu ‘Abd Allah (a.s.) who has said the following: “It is not proper for a Muslim man to become friends with an indecent, an idiot and a liar.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/534)"
        ],
        "index": 3603,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:4:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ قَالَ عِيسَى ابْنُ مَرْيَمَ ( عليه السلام ) إِنَّ صَاحِبَ الشَّرِّ يُعْدِي وَ قَرِينَ السَّوْءِ يُرْدِي فَانْظُرْ مَنْ تُقَارِنُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of his companions, from Sahl Bin Ziyad, from Ali Bin Asbaat, from one of his companions, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> having said: ‘Isa<sup>as</sup> Bin Maryam<sup>as</sup> said: ‘The owner of the evil, infects, and an evil partner destroys, therefore consider (carefully) the one whom you associate with’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Asbat from certain individuals of his people from abu al-Hassan (a.s.) who has said the following: “Jesus, son of Mary has said, ‘An evil companion commits injustice and an evil friend brings destruction. Consider who to become friends with.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/534)"
        ],
        "index": 3604,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:4:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَمَّارِ بْنِ مُوسَى قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا عَمَّارُ إِنْ كُنْتَ تُحِبُّ أَنْ تَسْتَتِبَّ لَكَ النِّعْمَةُ وَ تَكْمُلَ لَكَ الْمُرُوءَةُ وَ تَصْلُحَ لَكَ الْمَعِيشَةُ فَلَا تُشَارِكِ الْعَبِيدَ وَ السَّفِلَةَ فِي أَمْرِكَ فَإِنَّكَ إِنِ ائْتَمَنْتَهُمْ خَانُوكَ وَ إِنْ حَدَّثُوكَ كَذَبُوكَ وَ إِنْ نُكِبْتَ خَذَلُوكَ وَ إِنْ وَعَدُوكَ أَخْلَفُوكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad and Muhammad Bin Al Husayn, from Muhammad Bin Sinan, from Ammar Bin Musa who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘O Ammar! If you love that the Bounties are delightful to you and the magnanimity be completed for you, and the life is corrected for you, so you should not associate with the slave and the lowly ones in your affairs, for if you were to entrust them, they would betray you, and if they narrate to you, they would lie to you, and if you are afflicted, they would abandon you, and if they promise you, they would break it’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad and Muhammad ibn al-Husayn from Muhammad ibn Sinan from ‘Ammar ibn Musa who has said the following: “Abu ‘Abd Allah (a.s.) once said to me, ‘O ‘Ammar, if you like bounties bring you delight, kindness becomes complete, and the affairs of life well- organized you then should not associate with the slaves and the lowly persons. If you trust them, they betray you, if they speak, they lie to you. If you may suffer a misfortune, they leave you out. If they promise you, they disregard it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح على الظاهر   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/534)"
        ],
        "index": 3605,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:4:6",
        "text": [
          "قَالَ وَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ حُبُّ الْأَبْرَارِ لِلْأَبْرَارِ ثَوَابٌ لِلْأَبْرَارِ وَ حُبُّ الْفُجَّارِ لِلْأَبْرَارِ فَضِيلَةٌ لِلْأَبْرَارِ وَ بُغْضُ الْفُجَّارِ لِلْأَبْرَارِ زَيْنٌ لِلْأَبْرَارِ وَ بُغْضُ الْأَبْرَارِ لِلْفُجَّارِ خِزْيٌ عَلَى الْفُجَّارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "He (the above narrator) said, ‘And I heard Abu Abdullah<sup>asws</sup> saying: ‘The love of the righteous for the righteous is a Reward for the righteous, and the love of the immoral for the righteous, is a merit for the righteous one, and hatred of the immoral for the righteous one is an adornment for the righteous one, and hatred of the righteous for the immoral is a disgrace upon the immoral one’."
          ],
          "en.sarwar": [
            "6. He has also said, ‘I heard abu ‘Abd Allah (a.s.) saying: “The virtuous ones’ love of other virtuous ones is a rewarding deed for them. Indecent ones loving the virtuous ones is a credit for the virtuous ones. Indecent ones’ hating the virtuous ones beautifies the virtuous ones. Virtuous one’s hating the indecent ones is a loss to the indecent ones.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/535)"
        ],
        "index": 3606,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:4:7",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ عُذَافِرٍ عَنْ بَعْضِ أَصْحَابِهِمَا عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ وَ أَبِي حَمْزَةَ عَنْ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ ( عليهما السلام ) قَالَ قَالَ لِي أَبِي عَلِيُّ بْنُ الْحُسَيْنِ صَلَوَاتُ اللَّهِ عَلَيْهِمَا يَا بُنَيَّ انْظُرْ خَمْسَةً فَلَا تُصَاحِبْهُمْ وَ لَا تُحَادِثْهُمْ وَ لَا تُرَافِقْهُمْ فِي طَرِيقٍ فَقُلْتُ يَا أَبَتِ مَنْ هُمْ عَرِّفْنِيهِمْ",
          "قَالَ إِيَّاكَ وَ مُصَاحَبَةَ الْكَذَّابِ فَإِنَّهُ بِمَنْزِلَةِ السَّرَابِ يُقَرِّبُ لَكَ الْبَعِيدَ وَ يُبَعِّدُ لَكَ الْقَرِيبَ وَ إِيَّاكَ وَ مُصَاحَبَةَ الْفَاسِقِ فَإِنَّهُ بَائِعُكَ بِأُكْلَةٍ أَوْ أَقَلَّ مِنْ ذَلِكَ وَ إِيَّاكَ وَ مُصَاحَبَةَ الْبَخِيلِ فَإِنَّهُ يَخْذُلُكَ فِي مَالِهِ أَحْوَجَ مَا تَكُونُ إِلَيْهِ وَ إِيَّاكَ وَ مُصَاحَبَةَ الْأَحْمَقِ فَإِنَّهُ يُرِيدُ أَنْ يَنْفَعَكَ فَيَضُرُّكَ",
          "وَ إِيَّاكَ وَ مُصَاحَبَةَ الْقَاطِعِ لِرَحِمِهِ فَإِنِّي وَجَدْتُهُ مَلْعُوناً فِي كِتَابِ اللَّهِ عَزَّ وَ جَلَّ فِي ثَلَاثَةِ مَوَاضِعَ قَالَ اللَّهُ عَزَّ وَ جَلَّ فَهَلْ عَسَيْتُمْ إِنْ تَوَلَّيْتُمْ أَنْ تُفْسِدُوا فِي الْأَرْضِ وَ تُقَطِّعُوا أَرْحامَكُمْ أُولئِكَ الَّذِينَ لَعَنَهُمُ اللَّهُ فَأَصَمَّهُمْ وَ أَعْمى أَبْصارَهُمْ",
          "وَ قَالَ عَزَّ وَ جَلَّ الَّذِينَ يَنْقُضُونَ عَهْدَ اللَّهِ مِنْ بَعْدِ مِيثاقِهِ وَ يَقْطَعُونَ ما أَمَرَ اللَّهُ بِهِ أَنْ يُوصَلَ وَ يُفْسِدُونَ فِي الْأَرْضِ أُولئِكَ لَهُمُ اللَّعْنَةُ وَ لَهُمْ سُوءُ الدَّارِ ",
          "وَ قَالَ فِي الْبَقَرَةِ الَّذِينَ يَنْقُضُونَ عَهْدَ اللَّهِ مِنْ بَعْدِ مِيثاقِهِ وَ يَقْطَعُونَ ما أَمَرَ اللَّهُ بِهِ أَنْ يُوصَلَ وَ يُفْسِدُونَ فِي الْأَرْضِ أُولئِكَ هُمُ الْخاسِرُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad and Ali Bin Ibrahim, from his father, altoghether from Amro Bin Usman, from Muhammad Bin Uzafir, from one of their companions, from Muhammad Bin Muslim and Abu Hamza, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, from his<sup>asws</sup> father<sup>asws</sup> having said: ‘My<sup>asws</sup> father<sup>asws</sup> Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said to me<sup>asws</sup>: ‘O my<sup>asws</sup> son<sup>asws</sup>! Look at five (kinds of people) and do not befriend them, nor discuss with them, nor have accompany with them on a road’. I<sup>asws</sup> said: ‘O father<sup>asws</sup>! Who are they? Introduce them’. ",
            "He<sup>asws</sup> said: ‘Beware of befriending the liar, for he is at the status of the mirage. He would draw closer for you the remote, and distance for you the close by. And beware of befriending the immoral, for he would sell you for a meal, or less than that. And beware of befriending the stingy one, for he would abandon you regarding his wealth – at a time when you need him the most. And beware of befriending the idiot, for he would intend to benefit you, but he would harm you (instead). ",
            "And beware of befriending the severer of the relationships, for I<sup>asws</sup> have found him to be an accursed one in the Book of Allah<sup>azwj</sup> Mighty and Majestic, in three places. Allah<sup>azwj</sup> Says <span class=\"ibTxt\">[47:22] But if you held command, you were sure to make mischief in the land and cut off the ties of kinship! [47:23] Those it is whom Allah has Cursed so He has made them deaf and blinded their eyes</span><span class=\"iTxt\">.</span>",
            "And the Mighty and Majestic Said <span class=\"ibTxt\">[13:25] And those who break the promise with Allah after its Covenant and are cutting asunder that which Allah has Commanded to be joined and making mischief in the land; they, for them is the Curse, and for them is the evil abode</span>. ",
            "And He<sup>azwj</sup> Said in (Surah) Al-Baqarah <span class=\"ibTxt\">[2:27] Who break the Covenant of Allah after its confirmation and cut asunder what Allah has Commanded to be joined, and make mischief in the land; these it is that are the losers</span>’."
          ],
          "en.sarwar": [
            "7. A number of our people have narrated from Sahl ibn Ziyad and Ali ibn Ibrahim has narrated from his father all from ‘Amr ibn ‘Uthman from Muhammad ibn ‘Adhafir from certain individuals of their people from Muhammad ibn Muslim and abu Hamza from abu ‘Abd Allah and his father (a.s.) who has said the following: “My father, Ali ibn al-Husayn (a.s.) once said to me, ‘My son, look for five kinds of people. Do not befriend them, speak to or accompany them on a road.’ 1 then asked, ‘O father, who are they? Define them for me.’ He said, ‘Never befriend a liar; he is like a mirage. He shows what is far very near and what is near, in fact, very far. Never befriend a sinful person; he may sell you for a meal or even less. Never befriend a stingy person; he betrays you in the matter of his property at a time when you need help urgently. Never befriend an idiotic person; he may intend to benefit you, instead he causes you injuries. Never befriend one who has failed to maintain good relations with relatives; I have found him condemned in the book of Allah, the Most Majestic, the Most Holy, in three places. Allah, the Most Majestic, the Most Holy, has said: “If you ignore the commands of Allah, would you then also spread evil in the land and sever the ties of kinship? (47:22) Allah has condemned these people and made them deaf, dumb, and blind.” (47:23) ‘Allah, the Most Majestic, the Most Holy, has said, “Those who disregard their covenant with Allah after He has taken such a pledge from them, who sever the proper relations that Allah has commanded them to establish, and those who spread evil in the land will have Allah’s condemnation instead of reward and will face the most terrible end.” (13:25) ‘Allah, the Most Majestic, the Most Holy, has said, “. . . who break their established covenant with Him and the relations He has commanded to be kept and who spread evil in the land. These are the ones who lose a great deal.”’” (2:27) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/535)"
        ],
        "index": 3607,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:4:8",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُوسَى بْنِ الْقَاسِمِ قَالَ سَمِعْتُ الْمُحَارِبِيَّ يَرْوِي عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) عَنْ آبَائِهِ ( عليهم السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) ثَلَاثَةٌ مُجَالَسَتُهُمْ تُمِيتُ الْقَلْبَ الْجُلُوسُ مَعَ الْأَنْذَالِ وَ الْحَدِيثُ مَعَ النِّسَاءِ وَ الْجُلُوسُ مَعَ الْأَغْنِيَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Musa Bin Al Qasim who said, ",
            "‘I heard Al-Muhariby report, from Abu Abdullah<sup>asws</sup>, from his<sup>asws</sup> forefathers<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘There are three (types of people), sitting with them deadens the heart – sitting with the scoundrel, and speaking with the women, and the sitting with the wealthy’."
          ],
          "en.sarwar": [
            "8. A number of our people have narrated from Ahmad ibn Muhammad from Musa ibn al-Qasim who has said the following: “I heard al-Muharibi narrate from abu ‘Abd Allah (a.s.) from his ancestors (a.s.) who has said, ‘The Messenger of Allah has said, “Association with three kinds of people deadens the heart (reason): association with the lowly, speaking to women and sitting with the wealthy.”’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/536)"
        ],
        "index": 3608,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:4:9",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِهِ عَنْ إِبْرَاهِيمَ بْنِ أَبِي الْبِلَادِ عَمَّنْ ذَكَرَهُ قَالَ قَالَ لُقْمَانُ ( عليه السلام ) لِابْنِهِ يَا بُنَيَّ لَا تَقْتَرِبْ فَتَكُونَ أَبْعَدَ لَكَ وَ لَا تَبْعُدْ فَتُهَانَ كُلُّ دَابَّةٍ تُحِبُّ مِثْلَهَا وَ إِنَّ ابْنَ آدَمَ يُحِبُّ مِثْلَهُ ",
          "وَ لَا تَنْشُرْ بَزَّكَ إِلَّا عِنْدَ بَاغِيهِ كَمَا لَيْسَ بَيْنَ الذِّئْبِ وَ الْكَبْشِ خُلَّةٌ كَذَلِكَ لَيْسَ بَيْنَ الْبَارِّ وَ الْفَاجِرِ خُلَّةٌ مَنْ يَقْتَرِبْ مِنَ الزِّفْتِ يَعْلَقْ بِهِ بَعْضُهُ كَذَلِكَ مَنْ يُشَارِكِ الْفَاجِرَ يَتَعَلَّمْ مِنْ طُرُقِهِ ",
          "مَنْ يُحِبَّ الْمِرَاءَ يُشْتَمْ وَ مَنْ يَدْخُلْ مَدَاخِلَ السُّوءِ يُتَّهَمْ وَ مَنْ يُقَارِنْ قَرِينَ السَّوْءِ لَا يَسْلَمْ وَ مَنْ لَا يَمْلِكْ لِسَانَهُ يَنْدَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from one of his companions, from Ibrahim Bin Abu Al Balaad, from the one who mentioned it, ",
            "‘He<sup>asws</sup> said: ‘Luqman<sup>as</sup> said to his<sup>as</sup> son: ‘O my<sup>as</sup> son! Do not go closer (to the people), for they would become distant to you, neither be (too) remote, for you would be humiliated. Every animal loves its kind, and the son of Adam<sup>as</sup> loves his like (fellow human being). ",
            "And do not spread your righteousness except in the presence of its needy one. Just as there is no friendship between the wolf and the ram, similar to that, there is no friendship between the righteous one and the immoral one. The one who goes near the asphalt, parts of it would attach to him, similar to that, the one who associates with the immoral one would lean towards his ways. ",
            "The one who loves to dispute would be insulted; and the one who enters the places of evil would be accused; and the one who pairs with an evil pairing would not remain safe; and the one who does not control his tongue would regret’."
          ],
          "en.sarwar": [
            "9. Ali ibn Ibrahim has narrated from his father from certain individuals of his people from Ibrahim ibn abu al-Balad from those whom he has mentioned (in his book) who has said the following: “Luqman (mentioned in Chapter 3 1 of the Holy Quran), peace be upon him, said to his son, ‘Do not become very close (to people), lest you become the farthest from them (frequent involvement may cause friction and disturbance) and do not keep very far in total isolation and oblivion. Every moving thing loves its kind and the sons of Adam love their kind. Do not spread your goods when there is demand. Just as there is no friendship between the wolf and the sheep so also there is no friendship between a virtuous person and an evildoer. Whoever moves close to asphalt and tar, it will smear him out so also is association with an evildoer whose manners may spread to his associates. Whoever likes to dispute will be abused. Whoever enters places of evil activities will be accused (of evil doing). Whoever associates with an evildoer will not remain safe. Whoever does not control his tongue will regret.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> سكت عنه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/536)"
        ],
        "index": 3609,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:4:10",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عُمَرَ بْنِ يَزِيدَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ لَا تَصْحَبُوا أَهْلَ الْبِدَعِ وَ لَا تُجَالِسُوهُمْ فَتَصِيرُوا عِنْدَ النَّاسِ كَوَاحِدٍ مِنْهُمْ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْمَرْءُ عَلَى دِينِ خَلِيلِهِ وَ قَرِينِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Ibn Abu Najran, from Umar Bin Yazeed, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Do not befriend the people of the innovation, nor sit with them (in a gathering), for you would become, in the presence of the people, like one of them’. Rasool-Allah<sup>saww</sup> said: ‘The man is upon the Religion of his friend and his associates’."
          ],
          "en.sarwar": [
            "10. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from ibn abu Najran from ‘Umar ibn Yazid from abu ‘Abd Allah (a.s.) who has said the following: “Do not befriend blasphemers and do not associate with them; people may consider you as one of them. The Messenger of Allah has said, ‘A man follows the religion of his friend and associates.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> سكت عنه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/536)"
        ],
        "index": 3610,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:2:4:4:11",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ الْحَجَّالِ عَنْ عَلِيِّ بْنِ يَعْقُوبَ الْهَاشِمِيِّ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ عُبَيْدِ بْنِ زُرَارَةَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِيَّاكَ وَ مُصَادَقَةَ الْأَحْمَقِ فَإِنَّكَ أَسَرَّ مَا تَكُونُ مِنْ نَاحِيَتِهِ أَقْرَبُ مَا يَكُونُ إِلَى مَسَاءَتِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Al Hajal, from Ali Bin Yaqoub Al Hashimy, from Haroun Bin Muslim, from Ubeyd Bin Zurara who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Beware of befriending an idiot, the closer you get to him (for his pleasure) the closer you would be to your misfortune’."
          ],
          "en.sarwar": [
            "11. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from al- Hajjal from Ali ibn Ya’qub al-Hashimi from Harun ibn Muslim from ‘Ubayd ibn Zurara who has said the following: “Abu ‘Abd Allah (a.s.) has said, ‘Never befriend an idiotic person; the more delightful you may become from his side the closer it will get to your misfortune.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:2:4:4",
  "kind": "verse_list"
}