{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 1"
        },
        "path": "/books/al-kafi:5:2:1",
        "titles": {
          "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>اب دُخُولِ الصُّوفِيَّةِ</span> عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ احْتِجَاجِهِمْ عَلَيْهِ فِيمَا يَنْهَوْنَ النَّاسَ عَنْهُ مِنْ طَلَبِ الرِّزْقِ",
          "en": "Chapter 1 – The coming of the Sufis to Abu Abdullah<sup>asws</sup> and their argumentations against him<sup>asws</sup> regarding what the people are being forbidden from it, from seeking of the livelihood"
        }
      }
    ],
    "index": 1213,
    "local_index": 1,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 2"
        },
        "path": "/books/al-kafi:5:2:2",
        "titles": {
          "ar": "باب مَعْنَى الزُّهْدِ ",
          "en": "Chapter 2 – Meaning of the Ascetism"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:1",
    "titles": {
      "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>اب دُخُولِ الصُّوفِيَّةِ</span> عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ احْتِجَاجِهِمْ عَلَيْهِ فِيمَا يَنْهَوْنَ النَّاسَ عَنْهُ مِنْ طَلَبِ الرِّزْقِ",
      "en": "Chapter 1 – The coming of the Sufis to Abu Abdullah<sup>asws</sup> and their argumentations against him<sup>asws</sup> regarding what the people are being forbidden from it, from seeking of the livelihood"
    },
    "verse_count": 1,
    "verse_start_index": 8297,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/5)"
        ],
        "index": 8298,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:1:1",
        "relations": {
          "Mentions": [
            "/books/quran:17:29",
            "/books/quran:12:74",
            "/books/quran:59:10",
            "/books/quran:76:8",
            "/books/quran:12:56",
            "/books/quran:7:31",
            "/books/quran:25:67",
            "/books/quran:17:31",
            "/books/quran:59:9",
            "/books/quran:12:55"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ قَالَ دَخَلَ سُفْيَانُ الثَّوْرِيُّ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَرَأَى عَلَيْهِ ثِيَابَ بِيضٍ كَأَنَّهَا غِرْقِئُ الْبَيْضِ فَقَالَ لَهُ إِنَّ هَذَا اللِّبَاسَ لَيْسَ مِنْ لِبَاسِكَ فَقَالَ لَهُ اسْمَعْ مِنِّي وَ عِ مَا أَقُولُ لَكَ فَإِنَّهُ خَيْرٌ لَكَ عَاجِلًا وَ آجِلًا إِنْ أَنْتَ مِتَّ عَلَى السُّنَّةِ وَ الْحَقِّ وَ لَمْ تَمُتْ عَلَى بِدْعَةٍ ",
          "أُخْبِرُكَ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ فِي زَمَانٍ مُقْفِرٍ جَدْبٍ فَأَمَّا إِذَا أَقْبَلَتِ الدُّنْيَا فَأَحَقُّ أَهْلِهَا بِهَا أَبْرَارُهَا لَا فُجَّارُهَا وَ مُؤْمِنُوهَا لَا مُنَافِقُوهَا وَ مُسْلِمُوهَا لَا كُفَّارُهَا فَمَا أَنْكَرْتَ يَا ثَوْرِيُّ فَوَ اللَّهِ إِنَّنِي لَمَعَ مَا تَرَى مَا أَتَى عَلَيَّ مُذْ عَقَلْتُ صَبَاحٌ وَ لَا مَسَاءٌ وَ لِلَّهِ فِي مَالِي حَقٌّ أَمَرَنِي أَنْ أَضَعَهُ مَوْضِعاً إِلَّا وَضَعْتُهُ ",
          "قَالَ فَأَتَاهُ قَوْمٌ مِمَّنْ يُظْهِرُونَ الزُّهْدَ وَ يَدْعُونَ النَّاسَ أَنْ يَكُونُوا مَعَهُمْ عَلَى مِثْلِ الَّذِي هُمْ عَلَيْهِ مِنَ التَّقَشُّفِ فَقَالُوا لَهُ إِنَّ صَاحِبَنَا حَصِرَ عَنْ كَلَامِكَ وَ لَمْ تَحْضُرْهُ حُجَجُهُ فَقَالَ لَهُمْ فَهَاتُوا حُجَجَكُمْ فَقَالُوا لَهُ إِنَّ حُجَجَنَا مِنْ كِتَابِ اللَّهِ فَقَالَ لَهُمْ فَأَدْلُوا بِهَا فَإِنَّهَا أَحَقُّ مَا اتُّبِعَ وَ عُمِلَ بِهِ",
          "فَقَالُوا يَقُولُ اللَّهُ تَبَارَكَ وَ تَعَالَى مُخْبِراً عَنْ قَوْمٍ مِنْ أَصْحَابِ النَّبِيِّ ( صلى الله عليه وآله ) وَ يُؤْثِرُونَ عَلى أَنْفُسِهِمْ وَ لَوْ كانَ بِهِمْ خَصاصَةٌ وَ مَنْ يُوقَ شُحَّ نَفْسِهِ فَأُولئِكَ هُمُ الْمُفْلِحُونَ فَمَدَحَ فِعْلَهُمْ وَ قَالَ فِي مَوْضِعٍ آخَرَ وَ يُطْعِمُونَ الطَّعامَ عَلى حُبِّهِ مِسْكِيناً وَ يَتِيماً وَ أَسِيراً فَنَحْنُ نَكْتَفِي بِهَذَا فَقَالَ رَجُلٌ مِنَ الْجُلَسَاءِ إِنَّا رَأَيْنَاكُمْ تَزْهَدُونَ فِي الْأَطْعِمَةِ الطَّيِّبَةِ وَ مَعَ ذَلِكَ تَأْمُرُونَ النَّاسَ بِالْخُرُوجِ مِنْ أَمْوَالِهِمْ حَتَّى تَمَتَّعُوا أَنْتُمْ مِنْهَا ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) دَعُوا عَنْكُمْ مَا لَا تَنْتَفِعُونَ بِهِ أَخْبِرُونِي أَيُّهَا النَّفَرُ أَ لَكُمْ عِلْمٌ بِنَاسِخِ الْقُرْآنِ مِنْ مَنْسُوخِهِ وَ مُحْكَمِهِ مِنْ مُتَشَابِهِهِ الَّذِي فِي مِثْلِهِ ضَلَّ مَنْ ضَلَّ وَ هَلَكَ مَنْ هَلَكَ مِنْ هَذِهِ الْأُمَّةِ فَقَالُوا لَهُ أَوْ بَعْضِهِ فَأَمَّا كُلُّهُ فَلَا",
          "فَقَالَ لَهُمْ فَمِنْ هُنَا أُتِيتُمْ وَ كَذَلِكَ أَحَادِيثُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَأَمَّا مَا ذَكَرْتُمْ مِنْ إِخْبَارِ اللَّهِ عَزَّ وَ جَلَّ إِيَّانَا فِي كِتَابِهِ عَنِ الْقَوْمِ الَّذِينَ أَخْبَرَ عَنْهُمْ بِحُسْنِ فَعَالِهِمْ فَقَدْ كَانَ مُبَاحاً جَائِزاً وَ لَمْ يَكُونُوا نُهُوا عَنْهُ وَ ثَوَابُهُمْ مِنْهُ عَلَى اللَّهِ عَزَّ وَ جَلَّ ",
          "وَ ذَلِكَ أَنَّ اللَّهَ جَلَّ وَ تَقَدَّسَ أَمَرَ بِخِلَافِ مَا عَمِلُوا بِهِ فَصَارَ أَمْرُهُ نَاسِخاً لِفِعْلِهِمْ وَ كَانَ نَهَى اللَّهُ تَبَارَكَ وَ تَعَالَى رَحْمَةً مِنْهُ لِلْمُؤْمِنِينَ وَ نَظَراً لِكَيْلَا يُضِرُّوا بِأَنْفُسِهِمْ وَ عِيَالَاتِهِمْ مِنْهُمُ الضَّعَفَةُ الصِّغَارُ وَ الْوِلْدَانُ وَ الشَّيْخُ الْفَانِي وَ الْعَجُوزُ الْكَبِيرَةُ الَّذِينَ لَا يَصْبِرُونَ عَلَى الْجُوعِ فَإِنْ تَصَدَّقْتُ بِرَغِيفِي وَ لَا رَغِيفَ لِي غَيْرُهُ ضَاعُوا وَ هَلَكُوا جُوعاً",
          "فَمِنْ ثَمَّ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) خَمْسُ تَمَرَاتٍ أَوْ خَمْسُ قُرَصٍ أَوْ دَنَانِيرُ أَوْ دَرَاهِمُ يَمْلِكُهَا الْإِنْسَانُ وَ هُوَ يُرِيدُ أَنْ يُمْضِيَهَا فَأَفْضَلُهَا مَا أَنْفَقَهُ الْإِنْسَانُ عَلَى وَالِدَيْهِ ثُمَّ الثَّانِيَةُ عَلَى نَفْسِهِ وَ عِيَالِهِ ثُمَّ الثَّالِثَةُ عَلَى قَرَابَتِهِ الْفُقَرَاءِ ثُمَّ الرَّابِعَةُ عَلَى جِيرَانِهِ الْفُقَرَاءِ ثُمَّ الْخَامِسَةُ فِي سَبِيلِ اللَّهِ وَ هُوَ أَخَسُّهَا أَجْر",
          "اًوَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِلْأَنْصَارِيِّ حِينَ أَعْتَقَ عِنْدَ مَوْتِهِ خَمْسَةً أَوْ سِتَّةً مِنَ الرَّقِيقِ وَ لَمْ يَكُنْ يَمْلِكُ غَيْرَهُمْ وَ لَهُ أَوْلَادٌ صِغَارٌ لَوْ أَعْلَمْتُمُونِي أَمْرَهُ مَا تَرَكْتُكُمْ تَدْفِنُوهُ مَعَ الْمُسْلِمِينَ يَتْرُكُ صِبْيَةً صِغَاراً يَتَكَفَّفُونَ النَّاسَ ",
          "ثُمَّ قَالَ حَدَّثَنِي أَبِي أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ ابْدَأْ بِمَنْ تَعُولُ الْأَدْنَى فَالْأَدْنَى ثُمَّ هَذَا مَا نَطَقَ بِهِ الْكِتَابُ رَدّاً لِقَوْلِكُمْ وَ نَهْياً عَنْهُ مَفْرُوضاً مِنَ اللَّهِ الْعَزِيزِ الْحَكِيمِ قَالَ وَ الَّذِينَ إِذا أَنْفَقُوا لَمْ يُسْرِفُوا وَ لَمْ يَقْتُرُوا وَ كانَ بَيْنَ ذلِكَ قَواماً",
          "أَ فَلَا تَرَوْنَ أَنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى قَالَ غَيْرَ مَا أَرَاكُمْ تَدْعُونَ النَّاسَ إِلَيْهِ مِنَ الْأَثَرَةِ عَلَى أَنْفُسِهِمْ وَ سَمَّى مَنْ فَعَلَ مَا تَدْعُونَ النَّاسَ إِلَيْهِ مُسْرِفاً وَ فِي غَيْرِ آيَةٍ مِنْ كِتَابِ اللَّهِ يَقُولُ إِنَّهُ لا يُحِبُّ الْمُسْرِفِينَ فَنَهَاهُمْ عَنِ الْإِسْرَافِ وَ نَهَاهُمْ عَنِ التَّقْتِيرِ وَ لَكِنْ أَمْرٌ بَيْنَ أَمْرَيْنِ لَا يُعْطِي جَمِيعَ مَا عِنْدَهُ ثُمَّ يَدْعُو اللَّهَ أَنْ يَرْزُقَهُ",
          "فَلَا يَسْتَجِيبُ لَهُ لِلْحَدِيثِ الَّذِي جَاءَ عَنِ النَّبِيِّ ( صلى الله عليه وآله ) إِنَّ أَصْنَافاً مِنْ أُمَّتِي لَا يُسْتَجَابُ لَهُمْ دُعَاؤُهُمْ رَجُلٌ يَدْعُو عَلَى وَالِدَيْهِ وَ رَجُلٌ يَدْعُو عَلَى غَرِيمٍ ذَهَبَ لَهُ بِمَالٍ فَلَمْ يَكْتُبْ عَلَيْهِ وَ لَمْ يُشْهِدْ عَلَيْهِ وَ رَجُلٌ يَدْعُو عَلَى امْرَأَتِهِ وَ قَدْ جَعَلَ اللَّهُ عَزَّ وَ جَلَّ تَخْلِيَةَ سَبِيلِهَا بِيَدِهِ",
          "وَ رَجُلٌ يَقْعُدُ فِي بَيْتِهِ وَ يَقُولُ رَبِّ ارْزُقْنِي وَ لَا يَخْرُجُ وَ لَا يَطْلُبُ الرِّزْقَ فَيَقُولُ اللَّهُ عَزَّ وَ جَلَّ لَهُ عَبْدِي أَ لَمْ أَجْعَلْ لَكَ السَّبِيلَ إِلَى الطَّلَبِ وَ الضَّرْبِ فِي الْأَرْضِ بِجَوَارِحَ صَحِيحَةٍ فَتَكُونَ قَدْ أُعْذِرْتَ فِيمَا بَيْنِي وَ بَيْنَكَ فِي الطَّلَبِ لِاتِّبَاعِ أَمْرِي وَ لِكَيْلَا تَكُونَ كَلًّا عَلَى أَهْلِكَ فَإِنْ شِئْتُ رَزَقْتُكَ وَ إِنْ شِئْتُ قَتَّرْتُ عَلَيْكَ وَ أَنْتَ غَيْرُ مَعْذُورٍ عِنْدِي",
          "وَ رَجُلٌ رَزَقَهُ اللَّهُ مَالًا كَثِيراً فَأَنْفَقَهُ ثُمَّ أَقْبَلَ يَدْعُو يَا رَبِّ ارْزُقْنِي فَيَقُولُ اللَّهُ عَزَّ وَ جَلَّ أَ لَمْ أَرْزُقْكَ رِزْقاً وَاسِعاً فَهَلَّا اقْتَصَدْتَ فِيهِ كَمَا أَمَرْتُكَ وَ لِمَ تُسْرِفُ وَ قَدْ نَهَيْتُكَ عَنِ الْإِسْرَافِ وَ رَجُلٌ يَدْعُو فِي قَطِيعَةِ رَحِمٍ",
          "ثُمَّ عَلَّمَ اللَّهُ عَزَّ وَ جَلَّ نَبِيَّهُ ( صلى الله عليه وآله ) كَيْفَ يُنْفِقُ وَ ذَلِكَ أَنَّهُ كَانَتْ عِنْدَهُ أُوقِيَّةٌ مِنَ الذَّهَبِ فَكَرِهَ أَنْ يَبِيتَ عِنْدَهُ فَتَصَدَّقَ بِهَا فَأَصْبَحَ وَ لَيْسَ عِنْدَهُ شَيْ‏ءٌ وَ جَاءَهُ مَنْ يَسْأَلُهُ فَلَمْ يَكُنْ عِنْدَهُ مَا يُعْطِيهِ فَلَامَهُ السَّائِلُ وَ اغْتَمَّ هُوَ حَيْثُ لَمْ يَكُنْ عِنْدَهُ مَا يُعْطِيهِ وَ كَانَ رَحِيماً رَقِيقاً",
          "فَأَدَّبَ اللَّهُ تَعَالَى نَبِيَّهُ ( صلى الله عليه وآله ) بِأَمْرِهِ فَقَالَ وَ لا تَجْعَلْ يَدَكَ مَغْلُولَةً إِلى عُنُقِكَ وَ لا تَبْسُطْها كُلَّ الْبَسْطِ فَتَقْعُدَ مَلُوماً مَحْسُوراً يَقُولُ إِنَّ النَّاسَ قَدْ يَسْأَلُونَكَ وَ لَا يَعْذِرُونَكَ فَإِذَا أَعْطَيْتَ جَمِيعَ مَا عِنْدَكَ مِنَ الْمَالِ كُنْتَ قَدْ حَسَرْتَ مِنَ الْمَالِ ",
          "فَهَذِهِ أَحَادِيثُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) يُصَدِّقُهَا الْكِتَابُ وَ الْكِتَابُ يُصَدِّقُهُ أَهْلُهُ مِنَ الْمُؤْمِنِينَ وَ قَالَ أَبُو بَكْرٍ عِنْدَ مَوْتِهِ حَيْثُ قِيلَ لَهُ أَوْصِ فَقَالَ أُوصِي بِالْخُمُسِ وَ الْخُمُسُ كَثِيرٌ فَإِنَّ اللَّهَ تَعَالَى قَدْ رَضِيَ بِالْخُمُسِ فَأَوْصَى بِالْخُمُسِ وَ قَدْ جَعَلَ اللَّهُ عَزَّ وَ جَلَّ لَهُ الثُّلُثَ عِنْدَ مَوْتِهِ وَ لَوْ عَلِمَ أَنَّ الثُّلُثَ خَيْرٌ لَهُ أَوْصَى بِهِ ",
          "ثُمَّ مَنْ قَدْ عَلِمْتُمْ بَعْدَهُ فِي فَضْلِهِ وَ زُهْدِهِ سَلْمَانُ وَ أَبُو ذَرٍّ رَضِيَ اللَّهُ عَنْهُمَا فَأَمَّا سَلْمَانُ فَكَانَ إِذَا أَخَذَ عَطَاهُ رَفَعَ مِنْهُ قُوتَهُ لِسَنَتِهِ حَتَّى يَحْضُرَ عَطَاؤُهُ مِنْ قَابِلٍ فَقِيلَ لَهُ يَا أَبَا عَبْدِ اللَّهِ أَنْتَ فِي زُهْدِكَ تَصْنَعُ هَذَا وَ أَنْتَ لَا تَدْرِي لَعَلَّكَ تَمُوتُ الْيَوْمَ أَوْ غَداً فَكَانَ جَوَابَهُ أَنْ قَالَ مَا لَكُمْ لَا تَرْجُونَ لِيَ الْبَقَاءَ كَمَا خِفْتُمْ عَلَيَّ الْفَنَاءَ أَ مَا عَلِمْتُمْ يَا جَهَلَةُ أَنَّ النَّفْسَ قَدْ تَلْتَاثُ عَلَى صَاحِبِهَا إِذَا لَمْ يَكُنْ لَهَا مِنَ الْعَيْشِ مَا يَعْتَمِدُ عَلَيْهِ فَإِذَا هِيَ أَحْرَزَتْ مَعِيشَتَهَا اطْمَأَنَّتْ",
          "وَ أَمَّا أَبُو ذَرٍّ فَكَانَتْ لَهُ نُوَيْقَاتٌ وَ شُوَيْهَاتٌ يَحْلُبُهَا وَ يَذْبَحُ مِنْهَا إِذَا اشْتَهَى أَهْلُهُ اللَّحْمَ أَوْ نَزَلَ بِهِ ضَيْفٌ أَوْ رَأَى بِأَهْلِ الْمَاءِ الَّذِينَ هُمْ مَعَهُ خَصَاصَةٌ نَحَرَ لَهُمُ الْجَزُورَ أَوْ مِنَ الشِّيَاهِ عَلَى قَدْرِ مَا يَذْهَبُ عَنْهُمْ بِقَرَمِ اللَّحْمِ فَيَقْسِمُهُ بَيْنَهُمْ وَ يَأْخُذُ هُوَ كَنَصِيبِ وَاحِدٍ مِنْهُمْ لَا يَتَفَضَّلُ عَلَيْهِمْ وَ مَنْ أَزْهَدُ مِنْ هَؤُلَاءِ وَ قَدْ قَالَ فِيهِمْ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَا قَالَ وَ لَمْ يَبْلُغْ مِنْ أَمْرِهِمَا أَنْ صَارَا لَا يَمْلِكَانِ شَيْئاً الْبَتَّةَ كَمَا تَأْمُرُونَ النَّاسَ بِإِلْقَاءِ أَمْتِعَتِهِمْ وَ شَيْئِهِمْ وَ يُؤْثِرُونَ بِهِ عَلَى أَنْفُسِهِمْ وَ عِيَالَاتِهِمْ",
          "وَ اعْلَمُوا أَيُّهَا النَّفَرُ أَنِّي سَمِعْتُ أَبِي يَرْوِي عَنْ آبَائِهِ ( عليهم السلام ) أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ يَوْماً مَا عَجِبْتُ مِنْ شَيْ‏ءٍ كَعَجَبِي مِنَ الْمُؤْمِنِ إِنَّهُ إِنْ قُرِّضَ جَسَدُهُ فِي دَارِ الدُّنْيَا بِالْمَقَارِيضِ كَانَ خَيْراً لَهُ وَ إِنْ مَلَكَ مَا بَيْنَ مَشَارِقِ الْأَرْضِ وَ مَغَارِبِهَا كَانَ خَيْراً لَهُ وَ كُلُّ مَا يَصْنَعُ اللَّهُ عَزَّ وَ جَلَّ بِهِ فَهُوَ خَيْرٌ لَهُ ",
          "فَلَيْتَ شِعْرِي هَلْ يَحِيقُ فِيكُمْ مَا قَدْ شَرَحْتُ لَكُمْ مُنْذُ الْيَوْمِ أَمْ أَزِيدُكُمْ أَ مَا عَلِمْتُمْ أَنَّ اللَّهَ عَزَّ وَ جَلَّ قَدْ فَرَضَ عَلَى الْمُؤْمِنِينَ فِي أَوَّلِ الْأَمْرِ أَنْ يُقَاتِلَ الرَّجُلُ مِنْهُمْ عَشَرَةً مِنَ الْمُشْرِكِينَ ",
          "لَيْسَ لَهُ أَنْ يُوَلِّيَ وَجْهَهُ عَنْهُمْ وَ مَنْ وَلَّاهُمْ يَوْمَئِذٍ دُبُرَهُ فَقَدْ تَبَوَّأَ مَقْعَدَهُ مِنَ النَّارِ ثُمَّ حَوَّلَهُمْ عَنْ حَالِهِمْ رَحْمَةً مِنْهُ لَهُمْ فَصَارَ الرَّجُلُ مِنْهُمْ عَلَيْهِ أَنْ يُقَاتِلَ رَجُلَيْنِ مِنَ الْمُشْرِكِينَ تَخْفِيفاً مِنَ اللَّهِ عَزَّ وَ جَلَّ لِلْمُؤْمِنِينَ فَنَسَخَ الرَّجُلَانِ الْعَشَرَةَ ",
          "وَ أَخْبِرُونِي أَيْضاً عَنِ الْقُضَاةِ أَ جَوَرَةٌ هُمْ حَيْثُ يَقْضُونَ عَلَى الرَّجُلِ مِنْكُمْ نَفَقَةَ امْرَأَتِهِ إِذَا قَالَ إِنِّي زَاهِدٌ وَ إِنِّي لَا شَيْ‏ءَ لِي فَإِنْ قُلْتُمْ جَوَرَةٌ ظَلَّمَكُمْ أَهْلُ الْإِسْلَامِ وَ إِنْ قُلْتُمْ بَلْ عُدُولٌ خَصَمْتُمْ أَنْفُسَكُمْ وَ حَيْثُ تَرُدُّونَ صَدَقَةَ مَنْ تَصَدَّقَ عَلَى الْمَسَاكِينِ عِنْدَ الْمَوْتِ بِأَكْثَرَ مِنَ الثُّلُثِ ",
          "أَخْبِرُونِي لَوْ كَانَ النَّاسُ كُلُّهُمْ كَالَّذِينَ تُرِيدُونَ زُهَّاداً لَا حَاجَةَ لَهُمْ فِي مَتَاعِ غَيْرِهِمْ فَعَلَى مَنْ كَانَ يُتَصَدَّقُ بِكَفَّارَاتِ الْأَيْمَانِ وَ النُّذُورِ وَ الصَّدَقَاتِ مِنْ فَرْضِ الزَّكَاةِ مِنَ الذَّهَبِ وَ الْفِضَّةِ وَ التَّمْرِ وَ الزَّبِيبِ وَ سَائِرِ مَا وَجَبَ فِيهِ الزَّكَاةُ مِنَ الْإِبِلِ وَ الْبَقَرِ وَ الْغَنَمِ وَ غَيْرِ ذَلِكَ ",
          "إِذَا كَانَ الْأَمْرُ كَمَا تَقُولُونَ لَا يَنْبَغِي لِأَحَدٍ أَنْ يَحْبِسَ شَيْئاً مِنْ عَرَضِ الدُّنْيَا إِلَّا قَدَّمَهُ وَ إِنْ كَانَ بِهِ خَصَاصَةٌ فَبِئْسَمَا ذَهَبْتُمْ إِلَيْهِ وَ حَمَلْتُمُ النَّاسَ عَلَيْهِ مِنَ الْجَهْلِ بِكِتَابِ اللَّهِ عَزَّ وَ جَلَّ وَ سُنَّةِ نَبِيِّهِ ( صلى الله عليه وآله ) وَ أَحَادِيثِهِ الَّتِي يُصَدِّقُهَا الْكِتَابُ الْمُنْزَلُ وَ رَدِّكُمْ إِيَّاهَا بِجَهَالَتِكُمْ وَ تَرْكِكُمُ النَّظَرَ فِي غَرَائِبِ الْقُرْآنِ مِنَ التَّفْسِيرِ بِالنَّاسِخِ مِنَ الْمَنْسُوخِ وَ الْمُحْكَمِ وَ الْمُتَشَابِهِ وَ الْأَمْرِ وَ النَّهْيِ ",
          "وَ أَخْبِرُونِي أَيْنَ أَنْتُمْ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ ( عليه السلام ) حَيْثُ سَأَلَ اللَّهَ مُلْكاً لَا يَنْبَغِي لِأَحَدٍ مِنْ بَعْدِهِ فَأَعْطَاهُ اللَّهُ جَلَّ اسْمُهُ ذَلِكَ وَ كَانَ يَقُولُ الْحَقَّ وَ يَعْمَلُ بِهِ ثُمَّ لَمْ نَجِدِ اللَّهَ عَزَّ وَ جَلَّ عَابَ عَلَيْهِ ذَلِكَ وَ لَا أَحَداً مِنَ الْمُؤْمِنِينَ وَ دَاوُدَ النَّبِيِّ ( صلوات الله عليه ) قَبْلَهُ فِي مُلْكِهِ وَ شِدَّةِ سُلْطَانِهِ",
          "ثُمَّ يُوسُفَ النَّبِيِّ ( عليه السلام ) حَيْثُ قَالَ لِمَلِكِ مِصْرَ اجْعَلْنِي عَلى خَزائِنِ الْأَرْضِ إِنِّي حَفِيظٌ عَلِيمٌ فَكَانَ مِنْ أَمْرِهِ الَّذِي كَانَ أَنِ اخْتَارَ مَمْلَكَةَ الْمَلِكِ وَ مَا حَوْلَهَا إِلَى الْيَمَنِ وَ كَانُوا يَمْتَارُونَ الطَّعَامَ مِنْ عِنْدِهِ لِمَجَاعَةٍ أَصَابَتْهُمْ وَ كَانَ يَقُولُ الْحَقَّ وَ يَعْمَلُ بِهِ فَلَمْ نَجِدْ أَحَداً عَابَ ذَلِكَ عَلَيْهِ",
          "ثُمَّ ذُو الْقَرْنَيْنِ عَبْدٌ أَحَبَّ اللَّهَ فَأَحَبَّهُ اللَّهُ وَ طَوَى لَهُ الْأَسْبَابَ وَ مَلَّكَهُ مَشَارِقَ الْأَرْضِ وَ مَغَارِبَهَا وَ كَانَ يَقُولُ الْحَقَّ وَ يَعْمَلُ بِهِ ثُمَّ لَمْ نَجِدْ أَحَداً عَابَ ذَلِكَ عَلَيْهِ",
          "فَتَأَدَّبُوا أَيُّهَا النَّفَرُ بِآدَابِ اللَّهِ عَزَّ وَ جَلَّ لِلْمُؤْمِنِينَ وَ اقْتَصِرُوا عَلَى أَمْرِ اللَّهِ وَ نَهْيِهِ وَ دَعُوا عَنْكُمْ مَا اشْتَبَهَ عَلَيْكُمْ مِمَّا لَا عِلْمَ لَكُمْ بِهِ وَ رُدُّوا الْعِلْمَ إِلَى أَهْلِهِ تُوجَرُوا وَ تُعْذَرُوا عِنْدَ اللَّهِ تَبَارَكَ وَ تَعَالَى ",
          "وَ كُونُوا فِي طَلَبِ عِلْمِ نَاسِخِ الْقُرْآنِ مِنْ مَنْسُوخِهِ وَ مُحْكَمِهِ مِنْ مُتَشَابِهِهِ وَ مَا أَحَلَّ اللَّهُ فِيهِ مِمَّا حَرَّمَ فَإِنَّهُ أَقْرَبُ لَكُمْ مِنَ اللَّهِ وَ أَبْعَدُ لَكُمْ مِنَ الْجَهْلِ وَ دَعُوا الْجَهَالَةَ لِأَهْلِهَا فَإِنَّ أَهْلَ الْجَهْلِ كَثِيرٌ وَ أَهْلَ الْعِلْمِ قَلِيلٌ وَ قَدْ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ فَوْقَ كُلِّ ذِي عِلْمٍ عَلِيمٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "The Book of Jihad from Al-Kafi is completed, and it would be followed by the Book of Commerce.",
            "Ali Bin Ibrahim, from Haroun Bin Muslim, from Mas’ada Bin Sadaqa who said, ",
            "‘Sufyan Al-Sowry came over to Abu Abdullah<sup>asws</sup>, so he saw white clothes upon him<sup>asws</sup>, as if they were the albumin of the egg, so he said to him<sup>asws</sup>, ‘This attire is not from your<sup>asws</sup> attires’. So he<sup>asws</sup> said: ‘Listen from me<sup>asws</sup> attentively what I<sup>asws</sup> am going to say to you, for it would be better for you now and in the future, that you should die upon the Sunnah, and not die upon an innovation. ",
            "I<sup>asws</sup> hereby inform you that Rasool-Allah<sup>saww</sup> was in an era which was desolate (barren) and waterless. So when the world turns, so the most deserving of its inhabitants with it are its righteous ones (but) not its immoral ones, and its Believers not its hypocrites, and its Muslims not its Infidels. So what are you criticizing, O Sowry, for by Allah<sup>azwj</sup>, I<sup>asws</sup> am with what you see. By Allah<sup>azwj</sup>! There has never come upon me a morning nor an evening such that there is a right for Allah<sup>azwj</sup> in my<sup>asws</sup> wealth which He<sup>azwj</sup> had Commanded me<sup>asws</sup> to place it in a (particular) place, except that I<sup>asws</sup> did place it’. ",
            "He (the narrator) said (in the meantime), ‘So a group came over to him<sup>asws</sup>, from the ones who were manifesting the asceticism and calling the people that they should come to be with them upon the likes which they were upon, from the austerities (restrain). So they said to him<sup>asws</sup>, ‘Our companion was tongue-tied from your<sup>asws</sup> speech and could not present his arguments’. So he<sup>asws</sup> said: ‘So you give your arguments’. So they said to him<sup>asws</sup>, ‘Our argument is from the Book of Allah<sup>azwj</sup>’. So he<sup>asws</sup> said to them: ‘So indicate it, for it is most rightful of what is to be followed and acted by’. ",
            "So they said, ‘Allah<sup>azwj</sup> Blessed and High is Saying, Informing about a group of companions of the Prophet<sup>saww</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:59#h9\">[59:9]</a> and they prefer (others) before themselves though poverty may afflict them, and whoever is preserved from the niggardliness of his soul, these are the ones who are the successful ones</span>. Thus, He<sup>azwj</sup> Complimented their deeds and Said in another place <span class=\"ibTxt\"><a href=\"/#/books/quran:76#h8\">[76:8]</a> And they give food out of love for Him to the poor and the orphan and the captive</span>. Therefore, we are content with this’. So a man from the gathering said, ‘I am seeing you all manifesting ascetism in you all being fed the good food, and along with that you are instructing the people with the taking out from their wealth to the extent that you all are enjoying from it’.",
            "So Abu Abdullah<sup>asws</sup> said: ‘Leave from yourselves what you are no benefitting with. Inform me<sup>asws</sup>, O you group! Is there anyone of you knowledgeable with the Abrogating (Verses) of the Quran from its Abrogated ones, and its Decisive from its Allegorical, those regarding the likes of which strayed the one who strayed, and destroyed was the one who was destroyed, from this community?’ So they said to him<sup>asws</sup>, ‘Of some of it. As for all of it (the Holy Verses), so no’. ",
            "So he<sup>asws</sup> said to them; ‘So from over here you are coming (to the reality). And similar to that are the Ahadeeth of Rasool-Allah<sup>saww</sup>. So as for what you have mentioned from the News of Allah<sup>azwj</sup> Mighty and Majestic, it is regarding us<sup>asws</sup> in His<sup>azwj</sup> Book, about the people who can inform about these with goodness of their<sup>asws</sup> deeds. So it was neutral, allowed, and it was not Forbidden from, and their Rewards from it is upon Allah<sup>azwj</sup> Mighty and Majestic.",
            "And that is that Allah<sup>azwj</sup> Sanctified a matter with opposite to what they (people) had been doing with, so His<sup>azwj</sup> Commanded came to be Abrogating of their deeds. And the Prohibition of Allah<sup>azwj</sup> Blessed and High is a Mercy from it for the Believers, and a Consideration that perhaps they may harm themselves and their families among whom would be the weak, and the young, and the parents, and the dying old man, and the aged woman, those who cannot be patient upon the hunger. So if I<sup>asws</sup> were to give my<sup>asws</sup> bread in charity, and there was no bread other than it with me<sup>asws</sup>, they (family) would waste away and die of hunger. ",
            "Thus, Rasool-Allah<sup>saww</sup> said: ‘Five dates, or five discs (of bread), or five Dinars or Dirhams which the human being owns, and he wants to spend these, so the most superior of what the human being can spend upon are his parents. Then secondly upon himself and his family. Then thirdly upon his poor relatives. Then fourthly upon his poor neighbours. Then fifthly in the Way of Allah<sup>azwj</sup>, and it is of the lowest Recompense.",
            "Rasool-Allah<sup>saww</sup> said to the (one of the) ‘Ansar’ (the Helpers in Madina) when he freed, at the time of his death, five or six of his slaves, and he did not own other than them, and for him were young children: ‘Had you let me<sup>saww</sup> know, I<sup>saww</sup> would have ordered you all not to bury him with the Muslims. He left young children to spread their hands to the people?’ ",
            "Then he<sup>asws</sup> said: ‘My<sup>asws</sup> father<sup>asws</sup> narrated to me<sup>asws</sup> that Rasool-Allah<sup>saww</sup> said: ‘Begin with the ones reliant (upon you), so the closest one, then the next closest one’. Then this what the Book Speaks with is a rebuttal to your words, and Forbidden from it being an Obligation from Allah<sup>azwj</sup>, the Mighty, the Wise. He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:25#h67\">[25:67]</a> And they who when they spend, are neither extravagant nor stingy, and between that by stature (status)</span>.",
            "Are you not seeing that Allah<sup>azwj</sup> Blessed and High Says other than what you all are showing, calling the people towards it from the preferring of (others) over their own selves, and Named the one who does what you are calling the people towards as being extravagant? And in another Verse from the Book of Allah<sup>azwj</sup> He<sup>azwj</sup> is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:7#h31\">[7:31]</a> surely He does not Love the extravagant</span>. So He<sup>azwj</sup> has Forbidden them from the extravagance, and Forbidden them from the miserliness, but has Commanded between the two matters, that one should not give away the entirety of what is in his presence, then he supplicates to Allah<sup>azwj</sup> that He<sup>azwj</sup> Grace him. ",
            "So it would not be Answered to him due to the Hadeeth which has come from the Prophet<sup>saww</sup> that: ‘A category (of people) from my<sup>saww</sup> community, their supplication would not be Answered to them – a man who supplicates against his parents; and a man who supplicates against a creditor who went away with his wealth and he had no written agreement against him and did not have a witness upon him; and a man who supplicates against his wife and Allah<sup>azwj</sup> Mighty and Majestic has Made an freeing of the way (divorce) to be in his hands; ",
            "and a man who sits in his house and is saying, ‘Lord<sup>azwj</sup>! Grant me sustenance’, and he neither goes out nor seeks the livelihood. So Allah<sup>azwj</sup> Mighty and Majestic is Saying: “My<sup>azwj</sup> servant! Did I<sup>azwj</sup> not Make the way for you to the seeking and the going around in the land with healthy limbs? So you have become paralysed in what is between Me<sup>azwj</sup> and you with regards to the seeking in following My<sup>azwj</sup> Command, and perhaps you would become a burden upon your family. So if I<sup>azwj</sup> so Desire to I<sup>azwj</sup> would Grace you, and if I<sup>azwj</sup> so Desire to be Straiten upon you, and you would be without an excuse in my Presence”.",
            "And a man whom Allah<sup>azwj</sup> had Graced with abundant wealth, so he spends it (all), then turns supplicating, ‘O Lord<sup>azwj</sup>! Grace me”. So Allah<sup>azwj</sup> Mighty and Majestic is Saying: “Did I<sup>azwj</sup> not Grace you extensive sustenance? So you were not moderate in it as I<sup>azwj</sup> had Commanded you, and why were you extravagant and I<sup>azwj</sup> had Forbidden you from the extravagance?” And a man who supplicates regarding a cutting-off of a relationship.",
            "Then Allah<sup>azwj</sup> Taught His<sup>azwj</sup> Prophet<sup>saww</sup> how he<sup>saww</sup> should spend, and that is once he<sup>saww</sup> had an Owqiya (unit of measurement) of gold, so he<sup>saww</sup> disliked that it should be with him<sup>saww</sup> overnight. So he<sup>saww</sup> gave in charity with it. So in the morning there was nothing with him<sup>saww</sup>, and there came a beggar asking him<sup>saww</sup>, but there did not happen to be anything with him<sup>saww</sup> what he<sup>saww</sup> could give him. So the beggar accused him<sup>saww</sup>, and he<sup>saww</sup> was saddened that there did not happen to be anything with him<sup>saww</sup> what he<sup>saww</sup> could give him, as he<sup>saww</sup> was merciful, gentle. ",
            "So Allah<sup>azwj</sup> the Exalted Educated His<sup>azwj</sup> Prophet<sup>saww</sup> with His<sup>azwj</sup> Command, so He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:17#h29\">[17:29]</a> And do not make your hand to be shackled to your neck nor extend it to its limit, lest you should become blameworthy, destitute</span>. He<sup>azwj</sup> is Saying that the people have asked you<sup>saww</sup> and will not excuse you<sup>saww</sup>. So if you<sup>saww</sup> were to give away the entirety of what is with you<sup>saww</sup> from the wealth, you<sup>saww</sup> would be regretful from the wealth (unable to help anymore).",
            "Thus, these are the Ahadeeth of Rasool-Allah<sup>saww</sup> ratifying the Book (Quran) and the Book Ratifies its people from the Believers. And Abu Bakr said at the time of his death when it was said to him, ‘Bequeath’. So he said, ‘I bequeath with the fifth, and the fifth is a lot, for Allah<sup>azwj</sup> the Exalted is Pleased with the fifth’. So he bequeathed with the fifth, and Allah<sup>azwj</sup> Mighty and Majestic had Made the third to be for him at the time of his death, and had he known that the third is better for him, he would have bequeathed with it.",
            "Then the ones you know of after him in their merits and their ascetism, Salman<sup>ra</sup> and Abu Zarr<sup>ra</sup>, may Allah<sup>azwj</sup> be Pleased with both of them<sup>ra</sup>. So as for Salman<sup>ra</sup>, whenever he<sup>ra</sup> took his<sup>ra</sup> contribution, extracted from it a provision for his year until his contribution comes up the following year. So it was said to him<sup>as</sup>, ‘O servant of Allah<sup>azwj</sup>! You<sup>ra</sup> in your<sup>ra</sup> ascetism are doing this, and you<sup>as</sup> do not know perhaps you<sup>as</sup> would be dying today or tomorrow?’. So his<sup>ra</sup> answer was that he<sup>ra</sup> said: ‘What is the matter with you that you are not hoping that I<sup>as</sup> would remain, just as you are fearing the death upon me<sup>ra</sup>? Do you not know, O ignoramus, that the self becomes lethargic (restless) upon its owner when there does not happen to be the subsistence for it what he can depend upon. So when the subsistence is present, it is tranquil (peace of mind)?’ ",
            "And as for Abu Zarr<sup>ra</sup>, so there used to be for him<sup>ra</sup> camels and sheep for milking them, and he<sup>ra</sup> used to slaughter from them whenever his<sup>ra</sup> family desired the meat, or if a guest were to lodge with him<sup>ra</sup>, or if he<sup>ra</sup> saw the people of the water who were with him<sup>ra</sup> as destitute, he<sup>ra</sup> would sacrifice the camel for them or from the sheep upon a measurement of what would remove the craving of the menat from them. So he<sup>ra</sup> would distribute between them, and he<sup>ra</sup> himself would take one share from them, not preferring himself upon them. And who is more ascetic that them (Salman<sup>ra</sup> and Abu Zarr<sup>ra</sup>), and Rasool-Allah<sup>saww</sup> has said regarding them what he<sup>saww</sup> said? And it (news) has not reached from the affairs of them both<sup>ra</sup> that they<sup>ra</sup> came to be in a state of not owning anything. In no way it is as you are instructing the people with, the throwing away of their belongings and their things and preferring others by it upon their own selves, and their families.",
            "And know, O you group! I<sup>asws</sup> heard my<sup>asws</sup> father<sup>asws</sup> reporting from his<sup>asws</sup> forefathers<sup>asws</sup> that Rasool-Allah<sup>saww</sup> said one day: ‘I<sup>saww</sup> am not astounded (amazed) from anything like I<sup>saww</sup> am astounded from the Believer. If his body is cut into pieces in the house of the world with the scissors it would be good for him, and if he owns whatever is between the east of the earth and its west, it would be good for him, and everything what Allah<sup>azwj</sup> Mighty and Majestic Does with him, so it is good for him’. ",
            "So I<sup>asws</sup> am not aware, whether it has had any effect among you what I<sup>asws</sup> have commented to you today, or whether I<sup>asws</sup> should increase for you all. Do you not know that Allah<sup>azwj</sup> Mighty and Majestic has Obligated upon the Believers at first that the man among them should fight against ten from the Polytheists? ",
            "It was not for him that he should be turning his face away from them, and the one who turned back on his heels in those days, so he has reserved his seat in the Fire. Then He<sup>azwj</sup> Changed for them about their situation out of Mercy from Him<sup>azwj</sup>, so that man from them came to be Obligated that he fights two men from the Polytheists, being a Lightening from Allah<sup>azwj</sup> Mighty and Majestic for the Believers. So the (Command) of two men Abrogated the (Command of) the ten.",
            "And inform me<sup>asws</sup> as well about the judges. Would they be unjust when they are judging upon the man among you for payment of the expenses to his wife, if you were to say, ‘I am an ascetic. I am such that there is nothing for me’. If you were to say they are inequitable, the people of Al-Islam would call you as unjust. And if you were to say they have been just with you, you would be disputing against yourselves. And where would you be able to refute a charity given by the one who gives it to the poor at the time of his death, with more than a third?",
            "Inform me<sup>asws</sup>, if the people, all of them were to be like what you want them to be, as ascetics, there would not be any need for them regarding the belongings for others, so upon whom would they give charity with an expiation of the oaths, and the vows, and the charities from the Obligatory Zakat from the gold, and the silver, and the dates, and the raisins, and the rest of what is Obligated regarding it, the Zakat from the camels, and the cows, and the sheep, and other such when the matter was as you are saying it to be.",
            "If the matter was as you are saying it to be, that it is not befitting for anyone that he should withhold anything from the goods of the world except that he should send it forward (for the Hereafter), even though he may become a destitute by it, so evil it is what you are taking (the people) towards and carrying the people upon, due to your ignorance of the Book of Allah<sup>azwj</sup> Mighty and Majestic, and a Sunnah of His<sup>azwj</sup> Prophet<sup>saww</sup>, and the Ahadeth which are ratified by the Revealed Book, and you are rejecting these by your ignorance, and forsaking the consideratioin in the strangeness of the Quran from the interpretation of the Abrogating (Verses) from the Abrogated, and the Decisive and the Allegorical, and the Commands and the Prohibitions.",
            "And inform me<sup>asws</sup>, where are you (saying) about Suleyman<sup>as</sup> Bin Dawood<sup>as</sup>, where he<sup>as</sup> asked Allah<sup>azwj</sup> for a kingdom which would not be befitting for anyone (else) from after him<sup>as</sup>? So Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Name, Granted him<sup>as</sup> that, and he<sup>as</sup> was speaking the rightfulness and was acting by it. Then we do not find Allah<sup>azwj</sup> Mighty and Majestic Faulting him<sup>as</sup> over that, nor anyone from the Believers. And the Prophet Dawood<sup>as</sup> before him<sup>as</sup> regarding his<sup>as</sup> kingdom and the force of his<sup>as</sup> authority. ",
            "Then the Prophet Yusuf<sup>as</sup> when he<sup>as</sup> said to the king of Egypt <span class=\"ibTxt\"><a href=\"/#/books/quran:12#h55\">[12:55]</a> Place me (in authority) over the treasures of the land, I am a good keeper, knowing well</span>. So, from his<sup>as</sup> matter was that he<sup>as</sup> chose a kingdom of the king and what was around it up to Al-Yemen. And they (people) used to get their provisions from him<sup>as</sup> due to them being hit by the famine, and he<sup>as</sup> was speaking the truth and acting by it. So we do not find anyone faulting that upon him<sup>as</sup>.",
            "Then Zulqarnayn, a righteous one who loved Allah<sup>azwj</sup>, so Allah<sup>azwj</sup> Loved him and Rolled up his causes for him and Made him a king of the east of the earth and its west, and he was speaking the truth and was acting by it. Then we do not find anyone faulting that upon him. ",
            "So educate yourselves, O group, by the Education of Allah<sup>azwj</sup> Mighty and Majestic for the Believers, and moderate yourselves upon the Commands of Allah<sup>azwj</sup>, and His<sup>azwj</sup> Prohibitions, and leave from yourselves what is doubtful upon you, from what there is no knowledge for you of it, and refer the knowledge to its rightful ones, so you would be Recompensed, and Excused in the Presence of Allah<sup>azwj</sup> Blessed and High. ",
            "And become the seekers of the knowledge of the Abrogating (Verses) of the Quran from its Abrogated, and its Decisive from its Allegorical, and what Allah<sup>azwj</sup> has Permitted regarding it from what is Prohibited. Thus, it would take you all closer to Allah<sup>azwj</sup> and remote from the ignorance. And leave the ignorance to its people, for the people of the ignorance are many, and the people of the knowledge are a few. And Allah<sup>azwj</sup> Mighty and Majestic has Said <span class=\"ibTxt\"><a href=\"/#/books/quran:12#h74\">[12:74]</a> and above every one possessed of knowledge, is the All-knowing one</span>’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Harun ibn Muslim Mas’adah ibn Sadaqah who has said the following: “Once, Sufyan al-Thawriy visited abu ‘ Abd Allah, ‘Alayhi al-Salam. He saw the Imam wearing a cloth that was pure white like the membrane between an egg shell and its contents. He then said to the Imam, ‘This is not the kind of cloth you should wear.’ He (the Imam) said, ‘Listen to me and pay proper attention to what I say; it is good for you now and in future if you like to die following the Sunnah and truth and not in heresy. I can tell you that the Messenger of Allah lived at a time when poverty was rampant. When living conditions improve the people most deserving to benefit from the worldly facilities are the virtuous people and not the sinful ones, the believing people and not the hypocrites, the Muslims and not those who reject Islam. What then is it that you, O Thawriy, dislike? When you see me in this condition, you must take notice that, I swear by Allah, from the time I reached the age of maturity, there has never been an evening or morning when Allah had a right in my properties that He had commanded me to payoff and I had not already paid it off.’ He (the narrator) has said that then a group of people who showed themselves to people to be abstaining from the worldly matters and called people to become like them in treating their bodies with harshness said to the Imam, ‘Our fellow companion has become tonguetied before you and is unable to present his argument properly.’ He (the Imam) then asked them, ‘What is the argument that you think you have?’ They replied, ‘It is from the book of Allah.’ He (the Imam) then said, ‘You then must present it; it is the most rightful fact to follow and upon which one must act.’ They said, ‘Allah, most Blessed, most High, speaking of a group of people of the companions of the Holy Prophet has said, “They give preference to others over their own-selves even though they particularly are in need of what they give away to the needy. Whoever controls the greed of his soul is of those who find true happiness.” <a href=\"/#/books/quran:59#h10\">[59:10]</a> He has praised their deeds and in another passage He has said, “They offer food for His love to the destitute, the orphan and captives. . . .” <a href=\"/#/books/quran:76#h8\">[76:8]</a> We think this much from the Holy Quran is enough to support our argument.’ A man from among the people present then said, ‘We know that you abstain from good food but at the same time ask people to give away from their properties so that you in turn benefit from such properties given away.’ “Abu ‘Abd Allah, ‘Alayhi al-Salam, then said, ‘You should leave alone the matters that do not benefit you. You however must tell me this. Do you have the knowledge of the abrogating and abrogated matters of the Holy Quran; what are the unequivocal and ambiguous matters in which strayed those who strayed and faced destruction, those who were doomed to face destruction of the members of this nation?’ They or certain ones among them replied, ‘We do not know all of such matters.’ He (the Imam) then said, ‘This is where you have difficulties. The same case applies to Ahadith of the Messenger of Allah. However, what you mentioned of the matters that Allah, most Majestic, most Glorious, has spoken to us in His book about a people and their good deeds, you must take notice, such deeds were permissible and lawful. It was not prohibited for them, and their reward for such deeds is with Allah, most Majestic, most Glorious. (It was not obligatory on them) because Allah, most Holy, has commanded to do what is opposite to what they had done. Therefore, His prohibition was abrogating their practice; Allah, most Blessed, most High, out of His mercy toward the believing people, stopped them from harming themselves, their dependents, the weak ones, the small ones like children, the old men and women who are not able to bear hunger. If the loaf of my bread is given away while I have no other loaf of bread, then the lives of such ones (of my dependents) are jeopardized because of hunger. For this reason the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “If one has five dates in his possession or five loaves and he wants to give charity, the best charity to give is to spend it on one’s parents, then on his own self and dependents, thirdly on his relatives, fourthly on his neighbors, fifthly he should spend it in the way of Allah which is of the lowest degree of rewards.” The Messenger of Allah once, when one of the people of al-Ansar at the time of his death had set free five or six of his slaves and had no other possession and had left behind small children, said, “Had you informed me before about what he has done, I would not have given you permission to bury him in the graveyard of the Muslims due to his leaving behind small children with their hands spread before people for help.’” He (the Imam) then said, ‘My father has narrated to me that the Messenger of Allah has said, “Begin, when giving charity, with your dependents, the nearest ones first and so on.” Allah, most Majestic, most Wise, has also said, “. . . those who when giving charity do not exceed proper limits and nor do they act stringently, but give charity in a moderate manner.” <a href=\"/#/books/quran:25#h67\">[25:67]</a> Is it not true that Allah, most Blessed, most High, has said what is other than what I see you call people to do and to give others preference over their own selves, while He has called what you want people to do as exceeding the proper limits in spending? In more than a verse of His book He says, “He does not love those who exceed proper limits in spending.” (6:141 and 7:31) He has prohibited from acting as exceeding proper limits in spending and acting very stringently. He has told them to act moderately in between the two manners of spending. One must not give away all of his belongings and then begin to pray to Allah to grant him sustenance. His prayer then is not answered as it is mentioned in a Hadith, narrated from the Holy Prophet, ‘Alayhi al-Salam, that says, “The prayers of certain individuals of my followers are not answered. Of such people is one who prays against his parents, one who prays against his debtor who borrowed money without writing down for the record and appointing two witnesses for what he has borrowed, one who prays against his wife when Allah, most Majestic, most Glorious, in His laws has already authorized him to dissolve the contract of his marriage and one who sits at home without work, then prays to Allah, most Majestic, most Glorious, for sustenance but does not go out to work for a living. Allah, most Majestic, most Glorious, says to him, “My servant, have I not made ways for you to seek means of living and go around in the land by the help of your healthy bodily abilities so that you would not leave any excuse between Me and yourself in matters of your seeking to make a living and in obedience to My command and to avoid becoming a burden on your family? Now you have no excuse. I may grant you sustenance or make you suffer stringent conditions.” Another person is a wealthy one who spends all of his wealth and then begins to pray to Allah for his sustenance. Allah, most Majestic, most Glorious, says, “Had I not given you a great wealth? Why did you not act moderately as I had commanded you to do and avoid exceeding the proper limits of spending manners? I had already prohibited you to do so.” Yet there is another person who prays against good relationships with his relatives. Allah, most Majestic, most Glorious, then taught his Prophet how to spend in charity. Once there were a few Awqiyyah (certain units of measurement) of gold and he did not like to keep them with him for the night while they are not given away to deserving people. So he gave them away and in the morning there was nothing left with him. A person came to him asking for help but he had nothing to give him. The person asking for help blamed him for his inability to provide any help and he became sad; nothing was left there with him to help and he was a very kindhearted person. Allah most High, disciplined His prophet, by means of commanding him, “You must not keep your hands tied up to your neck and you must not expand them altogether so much so that you then remain blamed and unable to provide any help.” <a href=\"/#/books/quran:17#h31\">[17:31]</a> He says, “People ask you for help and they do not accept your excuses. If you give away all the properties you remain unable to help the needy.” These are of the Ahadith of the Messenger of Allah verified by the book which is confirmed by the believing people of the book. Abu Bakr at the time of his death, when asked to make a will, made a will about one-fifth of his legacy saying, “One-fifth is a great deal.” Allah, most High, has approved wills about one-fifth. So he made a will about one-fifth. Allah, most Majestic, most Glorious, had given the right to make a will about one-third of one’s legacy at the time of one’s death. If he knew that one-third is better for him he would have made a will for one-third. People other than abu Bakr, as you know their excellence and restraint from the worldly matters, were Salman and abu Dharr, may Allah be happy with them. Salman’s manners were such that whenever he received a gift he would keep aside one year’s expenses thereof until receiving his gift of the coming year. It was said to him, “O abu ‘ Abd Allah, why is it that with all the restraint you exercise in the worldly matters and you do not know whether you will die today or tomorrow, you still keep one year’s amount of your expenses aside from the gift you receive?” His answer was as follows, “Why do you not wish for me one more year of living instead of fearing for my death within a year?”’ He (the Imam) then said, ‘O ignorant people, have you not noticed that one’s soul becomes lazy and weak (in worship) when he does not have dependable means of living but when he gains his means of living his soul gains comfort. Abu Dharr owned camels and sheep. He would get milk from them and also use their meat for food whenever he wanted for his family and for his guests or for the people from whom he received water. Whenever he thought they desired he would slaughter for them a camel for food or of the sheep to satisfy their desire for meat. He would distribute the meat among them and himself would get one share without anything more than others. Who is more restraining from the worldly matters than these people? The Messenger of Allah has said about them all that he has said but he has not mentioned anything about their dispossessing themselves altogether of their belongings by giving away everything in charity, just as you command people to give away all of their belongings to give preference to others over themselves and families. ‘O people, you must take notice that I heard my father narrating from his ancestors, ‘Alayhim al- Salam, from the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, who one day said, “No other thing is as astonishing to me as the condition of a believing person. If his body is cut into pieces by scissors, it is because it is for his good and if everything between the east and west is made to become of his belongings is because it is for his good. Everything that Allah, most Majestic, most Glorious, does for him is for his good.” I like to know what I have said to you today had any effect on you or I increase my sayings. Have you not noticed that Allah, most Majestic, most Glorious, at the beginning of Islam had made it compulsory on the Muslims to fight each one against ten pagans without turning his back to the enemy and those who did so would have filled his seat with hellfire. He then changed their condition out of mercy and kindness to them and told them to fight each one of them against two men of the pagans. It was a measure of relief in favor of the believers from Allah, most Majestic, most Glorious. This was an abrogation of one Muslims’ fighting against ten pagans. ‘You should tell me about the judges who rule against one of you to pay the expenses of his wife. Are they unjust judges if the defendant said, “I am a zahid (one who restrains from worldly matters) and I do not possess anything?” If you said such judges are unjust people, Islam will call you unjust, and if you said they are judges of justice, then you have defeated yourselves. By what means will you reject the validity of the will that leaves more than one-third for the poor out of the legacy of a deceased? You must answer to me about this. If all people were Zuhhad (restraining from worldly matters) as you like them to be without needing anything from the worldly matters, then who would receive the charities, expiation for disregard of one’s swearing and vows and charities like Zakat of gold, silver, dates, raisin and other items subject to Zakat like camel, cow, sheep and other goods? If it were as you say that no one should keep anything of the worldly things but instead send it as his supplies for the next life even though he may urgently need such items, what you maintain is bad and you have made people to follow what you follow due to ignorance of the book of Allah, most Majestic, most Glorious, the Sunnah of the Holy Prophet of Allah and his Ahadith (sayings) which are verified by the divinely revealed book, and you have rejected them due to your ignorance and your disregard of the unique passages of the Holy Quran, the explanation of abrogating and abrogated matters, the unequivocal and ambiguous, the command and prohibitions therein. You must tell me if you know about Sulayman (the prophet) son of Dawud ‘Alayhi al-Salam, when he asked Allah to give him a kingdom which no one after him would ever have. Allah, most Majestic, most Glorious, gave him such kingdom. He spoke the truth and acted thereupon. We do not find Allah, most Majestic, most Glorious, blaming him for possessing such kingdom, neither any of the believing people have ever blamed him for possessing such a kingdom. Before him lived Dawud, the prophet with great kingdom and strong control. There is Joseph, the prophet, ‘Alayhi al-Salam, who said to the king of Egypt, “Appoint me a supervisor of the treasures of the land; I am a knowledgeable keeper.” <a href=\"/#/books/quran:12#h56\">[12:56]</a> He became the person in charge of the kingdom of the king up to Yemen. People would come for food supplies to him during food shortages and famine. We do not find any one to blame him for it. Dhul Qarnayn was a servant of Allah who loved Allah and Allah loved him. He prepared for him means and made him to possess the east and west of the land. He spoke the truth and acted thereupon. We do not find any one to blame him for it. You people must discipline yourselves by the disciplines of Allah, most Majestic, most Glorious, for the believing people. Follow the commands and prohibitions of Allah, and leave alone what has become confusing for you and you have no knowledge thereof. Leave issues of knowledge to the people of knowledge; you will be rewarded and excused before Allah, most Blessed, most High. You must seek to learn the knowledge of abrogating and abrogated matters of the Holy Quran, its unequivocal and ambiguous matters thereof. You must learn what Allah has made lawful and what He has made unlawful. This takes you closer to Allah and farther from ignorance. You must leave alone ignorance to its people. People of ignorance are many and people of knowledge are fewer. Allah, most Majestic, most Glorious, has said, “Over every person of knowledge there is one more knowledgeable. ” (12: 76)’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:1",
  "kind": "verse_list"
}