{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 100"
        },
        "path": "/books/al-kafi:5:2:100",
        "titles": {
          "ar": "باب آخَرُ مِنْهُ ",
          "en": "Chapter 99 – Another chapter from it"
        }
      }
    ],
    "index": 1312,
    "local_index": 100,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 101"
        },
        "path": "/books/al-kafi:5:2:101",
        "titles": {
          "ar": "باب الْغَنَمِ تُعْطَى بِالضَّرِيبَةِ ",
          "en": "Chapter 100 – The sheep given out (for pasture) with the tribute payment"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 99"
        },
        "path": "/books/al-kafi:5:2:99",
        "titles": {
          "ar": "باب السَّلَمِ فِي الرَّقِيقِ وَ غَيْرِهِ مِنَ الْحَيَوَانِ",
          "en": "Chapter 98 – The submission of advance payment regarding the slave and others from the animals"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:100",
    "titles": {
      "ar": "باب آخَرُ مِنْهُ ",
      "en": "Chapter 99 – Another chapter from it"
    },
    "verse_count": 3,
    "verse_start_index": 8939,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/256)"
        ],
        "index": 8940,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:100:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُعَاوِيَةَ بْنِ حُكَيْمٍ عَنْ مُحَمَّدِ بْنِ حُبَابٍ الْجَلَّابِ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يَشْتَرِي مِائَةَ شَاةٍ عَلَى أَنْ يُبْدِلَ مِنْهَا كَذَا وَ كَذَا قَالَ لَا يَجُوزُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companion, from Ahmad Bin Muhammad Bin Isa, from Muawiya Bin Hukeym, from Muhammad Bin Hubab Al Jallab, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the man who buys one hundred sheep upon a stipulation if he can exchange from it such and such. He<sup>asws</sup> said: ‘Not allowed’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from Mu‘awiyah ibn Hakim from Muhammad ibn Hubab al-Jallab who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about the case of a man who bought one hundred sheep; if so and so many of them were changed. He (the Imam) said, ‘It is not permissible and it is not lawful. 5 ” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/259)"
        ],
        "index": 8941,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:100:2",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ مِنْهَالٍ الْقَصَّابِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَشْتَرِي الْغَنَمَ أَوْ يَشْتَرِي الْغَنَمَ جَمَاعَةٌ ثُمَّ تُدْخَلُ دَاراً ثُمَّ يَقُومُ رَجُلٌ عَلَى الْبَابِ فَيَعُدُّ وَاحِداً وَ اثْنَيْنِ وَ ثَلَاثَةً وَ أَرْبَعَةً وَ خَمْسَةً ثُمَّ يُخْرِجُ السَّهْمَ قَالَ لَا يَصْلُحُ هَذَا إِنَّمَا يَصْلُحُ السِّهَامُ إِذَا عُدِلَتِ الْقِسْمَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ibn Abu Umer, from Abdul Rahman Bin Al Hajjaj, from Minhal Al Qassab who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I buy the sheep, or a group buys the sheep, then they enter a house, then a man stands upon the door, so he number one, and two, and three, and four, and five, then he specifies it as one share’. He<sup>asws</sup> said: ‘This is not correct. But rather shares are correct only when distribution is just’."
          ],
          "en.sarwar": [
            "2. Ahmad ibn Muhammad has narrated from ibn abu ‘Umayr from ‘Abd al-Rahman ibn al-Hajjaj from Minhal al-Qassab who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of my buying sheep or a group’s buying sheep saying, ‘They enter a house, then a man stands at the door counts one, two, three, four, and five, then calls it one share.’ He (the Imam) said, ‘It is not valid. Shares are valid only when they are equal.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/260)"
        ],
        "index": 8942,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:100:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ زَيْدٍ الشَّحَّامِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ يَشْتَرِي سِهَامَ الْقَصَّابِينَ مِنْ قَبْلِ أَنْ يَخْرُجَ السَّهْمُ فَقَالَ لَا يَشْتَرِي شَيْئاً حَتَّى يَعْلَمَ مِنْ أَيْنَ يَخْرُجُ السَّهْمُ فَإِنِ اشْتَرَى شَيْئاً فَهُوَ بِالْخِيَارِ إِذَا خَرَجَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad and Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Zayd Al Shahham who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who buys the shares of the butchers prior to the shares are allotted. So he<sup>asws</sup> said: ‘He should not buy anything until he knows from were the shares were drawn. So if he were to buy like this he has the choice to buy or not to (buy it), when the share comes out’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad and Ahmad ibn Muhammad from al-Hassan ibn Mahbub from Zayd al- Shahham who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who bought the shares of butchers before the shares were taken out. He (the Imam) said, ‘Nothing can be purchased until it is known where the shares come. If he buys like this he has the choice to buy or not to buy it.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:100",
  "kind": "verse_list"
}