{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 104"
        },
        "path": "/books/al-kafi:5:2:104",
        "titles": {
          "ar": "باب شِرَاءِ السَّرِقَةِ وَ الْخِيَانَةِ ",
          "en": "Chapter 103 – Buying the stolen (goods) and the betrayal"
        }
      }
    ],
    "index": 1316,
    "local_index": 104,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 105"
        },
        "path": "/books/al-kafi:5:2:105",
        "titles": {
          "ar": "باب مَنِ اشْتَرَى طَعَامَ قَوْمٍ وَ هُمْ لَهُ كَارِهُونَ",
          "en": "Chapter 104 – The one who buys the food of a people and they are compelled to it"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 103"
        },
        "path": "/books/al-kafi:5:2:103",
        "titles": {
          "ar": "باب جَامِعٌ فِيمَا يَحِلُّ الشِّرَاءُ وَ الْبَيْعُ مِنْهُ وَ مَا لَا يَحِلُّ",
          "en": "Chapter 102 – The summary regarding what is Permissible for the buying and the selling from it, and what is not Permissible"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:104",
    "titles": {
      "ar": "باب شِرَاءِ السَّرِقَةِ وَ الْخِيَانَةِ ",
      "en": "Chapter 103 – Buying the stolen (goods) and the betrayal"
    },
    "verse_count": 7,
    "verse_start_index": 8964,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/268)"
        ],
        "index": 8965,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:104:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ وَ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَحَدَهُمَا ( عليهما السلام ) عَنْ شِرَاءِ الْخِيَانَةِ وَ السَّرِقَةِ فَقَالَ لَا إِلَّا أَنْ يَكُونَ قَدِ اخْتَلَطَ مَعَهُ غَيْرُهُ فَأَمَّا السَّرِقَةُ بِعَيْنِهَا فَلَا إِلَّا أَنْ تَكُونَ مِنْ مَتَاعِ السُّلْطَانِ فَلَا بَأْسَ بِذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, and Ahmad Bin Muhammad, altogether from Ibn Mahboub, from Abu Ayoub, from Abu Baseer who said, ",
            "‘I asked one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) about buying the (goods of) betrayal and the stolen (goods). So he<sup>asws</sup> said: ‘No, except if there happens to have mixed up something else along with it. So as for the stolen (goods) exactly, so no, except if there happens to be goods of the Sultan (ruling authority), so there is no problem with it’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad and Ahmad ibn Muhammad all from ibn Mahbub from abu Ayyub from abu Basir who has said the following: “I once asked one of the two Imam, (abu Ja’far or abu ‘Abd Allah), ‘Alayhim al-Salam, about buying goods from cheating and stealing. He (the Imam) said, ‘No, it is not lawful unless it is mixed with other goods. The very substance of stolen goods cannot be purchased unless it is of the properties of the sultan in which case it is not unlawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/269)"
        ],
        "index": 8966,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:104:2",
        "text": [
          "ابْنُ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عُبَيْدَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ مِنَّا يَشْتَرِي مِنَ السُّلْطَانِ مِنْ إِبِلِ الصَّدَقَةِ وَ غَنَمِ الصَّدَقَةِ وَ هُوَ يَعْلَمُ أَنَّهُمْ يَأْخُذُونَ مِنْهُمْ أَكْثَرَ مِنَ الْحَقِّ الَّذِي يَجِبُ عَلَيْهِمْ قَالَ فَقَالَ مَا الْإِبِلُ وَ الْغَنَمُ إِلَّا مِثْلَ الْحِنْطَةِ وَ الشَّعِيرِ وَ غَيْرِ ذَلِكَ لَا بَأْسَ بِهِ حَتَّى تَعْرِفَ الْحَرَامَ بِعَيْنِهِ ",
          "قِيلَ لَهُ فَمَا تَرَى فِي مُصَدِّقٍ يَجِيئُنَا فَيَأْخُذُ صَدَقَاتِ أَغْنَامِنَا فَنَقُولُ بِعْنَاهَا فَيَبِيعُنَاهَا فَمَا تَرَى فِي شِرَائِهَا مِنْهُ قَالَ إِنْ كَانَ قَدْ أَخَذَهَا وَ عَزَلَهَا فَلَا بَأْسَ ",
          "قِيلَ لَهُ فَمَا تَرَى فِي الْحِنْطَةِ وَ الشَّعِيرِ يَجِيئُنَا الْقَاسِمُ فَيَقْسِمُ لَنَا حَظَّنَا وَ يَأْخُذُ حَظَّهُ فَيَعْزِلُهُ بِكَيْلٍ فَمَا تَرَى فِي شِرَاءِ ذَلِكَ الطَّعَامِ مِنْهُ فَقَالَ إِنْ كَانَ قَبَضَهُ بِكَيْلٍ وَ أَنْتُمْ حُضُورُ ذَلِكَ الْكَيْلِ فَلَا بَأْسَ بِشِرَاهُ مِنْهُ بِغَيْرِ كَيْلٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Mahboub, from Hisham Bin Salim, from Abu Ubeyda, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the man from us buying from the Sultan (ruling authority), from the camels of charity (Zakat) and sheep of charity (Zakat), and he knew that they are taking from them (masses) more than the rightful which is obligated upon them. So he<sup>asws</sup> said: ‘The camel and sheep are likes of the wheat and the barley, and other than that. There is no problem with it until he recognises the Prohibition exactly’. ",
            "It was said to him<sup>asws</sup>, ‘So what is your<sup>asws</sup> view regarding a charity (Zakat) collector who comes to us, so he takes the charities (Zakat) of our sheep. So we are saying, ‘Sell these back to us’. So what is your<sup>asws</sup> view regarding buying these from him?’ He<sup>asws</sup> said: ‘If he has taken them (away) and segregated them, so there is no problem’. ",
            "It was said to him<sup>asws</sup>, ‘So what is your<sup>asws</sup> view regarding the wheat and the barley. The apportioner (for charity) comes to us, so he apportions our share, and he takes his share and segregates it with a measurement. So what is your<sup>asws</sup> view regarding buying that foodstuff from him?’ So he<sup>asws</sup> said: ‘If he had taken possession of it with a measurement, and you were present during that measurement, so there is no problem with buying it from him without measuring it (again)’."
          ],
          "en.sarwar": [
            "2. Ibn Mahbub has narrated from Hisham ibn Salim from abu ‘Ubayd who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about the case of one of our men who bought from the sultan of the camels of charity and sheep of charity and he knew that they took more than what is rightly due on them. He (the Imam) said, ‘Camels and sheep are just like wheat and barley and other goods. It is not unlawful unless he recognizes the very substance of what is unlawful.’ It was asked, ‘What do you say about the charity collectors who come to us, collect the charity from our sheep, then we ask them to sell them to us and they sell them? What do you say about buying from them? He (the Imam) said, ‘If he has taken them away, then it is not unlawful.’ It was asked, ‘What do you say about wheat and barley which the charity collector takes from us with his measurement and keeps it to one side: if we buy such foodstuff from him?’ He (the Imam) said, ‘If he has taken possession with a certain measurement, then it is not unlawful to buy from him without measuring.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/270)"
        ],
        "index": 8967,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:104:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ أَبَانٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يَشْتَرِي مِنَ الْعَامِلِ وَ هُوَ يَظْلِمُ قَالَ يَشْتَرِي مِنْهُ مَا لَمْ يَعْلَمْ أَنَّهُ ظَلَمَ فِيهِ أَحَداً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Ali, from Aban, from Is’haq Bin Ammar who said,",
            "‘I asked him<sup>asws</sup> about the man who buys from the office bearer, and he is an unjust one. He<sup>asws</sup> said: ‘He can buy from him for as long as he does not know that he has been unjust to anyone in it’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hassan ibn Ali from Aban from Ishaq ibn ‘Ammar who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who bought from a charity collector who committed injustice. He (the Imam) said, ‘He can buy from him unless he learns that he has done injustice in collecting those goods.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/270)"
        ],
        "index": 8968,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:104:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنِ الْقَاسِمِ بْنِ سُلَيْمَانَ عَنْ جَرَّاحٍ الْمَدَائِنِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا يَصْلُحُ شِرَاءُ السَّرِقَةِ وَ الْخِيَانَةِ إِذَا عُرِفَتْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Al Qasim Bin Suleyman, from Jarrah Al Madainy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It is not correct to buy the stolen (goods), and the (goods of) betrayal, when it is recognised as such’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from al-Qasim ibn Sulayman from Jarrah al-Mada’iniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Buying and selling of goods obtained by cheating and stealing are not valid and not lawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/270)"
        ],
        "index": 8969,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:104:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ صَالِحٍ قَالَ أَرَادُوا بَيْعَ تَمْرِ عَيْنِ أَبِي زِيَادٍ فَأَرَدْتُ أَنْ أَشْتَرِيَهُ ثُمَّ قُلْتُ حَتَّى أَسْتَأْمِرَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَأَمَرْتُ مُعَاذاً فَسَأَلَهُ فَقَالَ قُلْ لَهُ يَشْتَرِيهِ فَإِنَّهُ إِنْ لَمْ يَشْتَرِهِ اشْتَرَاهُ غَيْرُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Jameel Bin Salih who said, ",
            "‘I wanted to sell the dates of Abu Ziyad (a plantation), so I wanted to buy it. Then I said (to myself), ‘(I shall wait) until Abu Abdullah<sup>asws</sup> instructs me so’. So I instructed Moaz, so he asked him<sup>asws</sup>. He<sup>asws</sup> said: ‘Say to him, ‘Buy it’, for if he does not buy it, someone else will buy it’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn abu ‘Umayr from Jamil ibn Salih who has said the following: “They wanted to sell the dates of ‘ Ayn of abu Ziyad (name of a place with farms that belonged to abu ‘Abd Allah, ‘Alayhi al-Salam), and I wanted to buy it but then I decided to ask permission from abu ‘Abd Allah, ‘Alayhi al-Salam, so I asked Mu‘adh and he asked him (the Imam) about it and he (the Imam) said, ‘He can buy it because if he does not buy it someone else will buy it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/271)"
        ],
        "index": 8970,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:104:6",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنِ النَّهْدِيِّ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنِ اشْتَرَى سَرِقَةً وَ هُوَ يَعْلَمُ فَقَدْ شَرِكَ فِي عَارِهَا وَ إِثْمِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Al Nahdy, from Ibn Abu Najran, from one of his companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who buys stolen (goods) and he knows, so he has participated in its shame and in its sin’."
          ],
          "en.sarwar": [
            "6. Al-Husayn ibn Muhammad has narrated from al-Nahdiy from ibn abu Najran from certain persons of his people who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Whoever buys stolen goods when he knows it, he shares its shame and sin.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/271)"
        ],
        "index": 8971,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:104:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنِ الْحُسَيْنِ بْنِ أَبِي الْعَلَاءِ عَنْ أَبِي عُمَرَ السَّرَّاجِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الرَّجُلِ يُوجَدُ عِنْدَهُ السَّرِقَةُ قَالَ هُوَ غَارِمٌ إِذَا لَمْ يَأْتِ عَلَى بَائِعِهَا بِشُهُودٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Salih, Bin Al Sandy, from Ja’far Bin Basheer, from Al Husayn Bin Abu Al A’ala, from Abu Umar Al Sarraj, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the man in whose presence stolen goods were found’. He<sup>asws</sup> said: ‘He suffers the loss unless he comes up with witnesses against his seller (who has sold those to him without his knowledge about the goods)’."
          ],
          "en.sarwar": [
            "7. Ali has narrated from Salih al-Sindiy from Ja‘far ibn Bashir from al-Husayn ibn abu al-‘Ala’ from abu ‘Umar al-Sarraj who has said the following: “About the case of a man with whom stolen goods were found, abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘He is held responsible unless he presents testimony against the seller such as witnesses.”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:104",
  "kind": "verse_list"
}