{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:5:2", "titles": {"ar": "كتاب الْمَعِيشَةِ", "en": "THE BOOK OF SUBSISTENCE"}}, {"indexed_titles": {"en": "Chapter 106"}, "path": "/books/al-kafi:5:2:106", "titles": {"ar": "باب بَيْعِ الْعَصِيرِ وَ الْخَمْرِ", "en": "Chapter 106 – Selling the juice and the wine"}}], "index": 1317, "local_index": 106, "part_type": "Chapter", "path": "/books/al-kafi:5:2:106", "titles": {"ar": "باب بَيْعِ الْعَصِيرِ وَ الْخَمْرِ", "en": "Chapter 106 – Selling the juice and the wine"}, "verse_count": 14, "verse_start_index": 8973, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 8974, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:2:106:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ وَ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام) عَنْ بَيْعِ الْعَصِيرِ فَيَصِيرُ خَمْراً قَبْلَ أَنْ يُقْبَضَ الثَّمَنُ قَالَ فَقَالَ لَوْ بَاعَ ثَمَرَتَهُ مِمَّنْ يَعْلَمُ أَنَّهُ يَجْعَلُهُ حَرَاماً لَمْ يَكُنْ بِذَلِكَ بَأْسٌ فَأَمَّا إِذَا كَانَ عَصِيراً فَلَا يُبَاعُ إِلَّا بِالنَّقْدِ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, and Ahmad Bin Muhammad Bin Isa, from Ahmad Bin Muhammad Bin Abu Nasr who said, ", "‘I asked Abu Al-Hassan<sup>asws</sup> about selling the juice, so it becomes wine before he takes possession of the price’. So he<sup>asws</sup> said: ‘If he sold its fruit to the one he known that he would make to be something Prohibited, there would not happen to be a problem with that, so when it was juice, so he should not sell it except with a cash transcation’."]}}, {"index": 8975, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:2:106:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ تَرَكَ غُلَاماً لَهُ فِي كَرْمٍ لَهُ يَبِيعُهُ عِنَباً أَوْ عَصِيراً فَانْطَلَقَ الْغُلَامُ فَعَصَرَ خَمْراً ثُمَّ بَاعَهُ قَالَ لَا يَصْلُحُ ثَمَنُهُ ", "ثُمَّ قَالَ إِنَّ رَجُلًا مِنْ ثَقِيفٍ أَهْدَى إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) رَاوِيَتَيْنِ مِنْ خَمْرٍ فَأَمَرَ بِهِمَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَأُهَرِيقَتَا وَ قَالَ إِنَّ الَّذِي حَرَّمَ شُرْبَهَا حَرَّمَ ثَمَنَهَا ثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ أَفْضَلَ خِصَالِ هَذِهِ الَّتِي بَاعَهَا الْغُلَامُ أَنْ يُتَصَدَّقَ بِثَمَنِهَا ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, from Muhammad Bin Muslim, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who left a slave of his in a vineyard of his for selling grapes or juice. So the slave went and made wine, then sold it. He<sup>asws</sup> said: ‘It is not correct (to take) its price’. ", "Then he<sup>asws</sup> said: ‘A man from Saqeef gifted to Rasool-Allah<sup>saww</sup> two caskets of wine. So Rasool-Allah<sup>saww</sup> ordered with both of them to be destroyed, and said: ‘The drinking of which is Prohibited, its price is Prohibited’. The most preferable action for this which the slave had sold is for him, to give it in charity equivlant to its price’."]}}, {"index": 8976, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:2:106:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ ثَمَنِ الْعَصِيرِ قَبْلَ أَنْ يَغْلِيَ لِمَنْ يَبْتَاعُهُ لِيَطْبُخَهُ أَوْ يَجْعَلَهُ خَمْراً قَالَ إِذَا بِعْتَهُ قَبْلَ أَنْ يَكُونَ خَمْراً وَ هُوَ حَلَالٌ فَلَا بَأْسَ ."], "translations": {"en.hubeali": ["Muhamman Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad, from Ali Bin Abu Hamza, ", "(It has been narrated) from Abu Baseer who said, ‘I asked Abu Abdullah<sup>asws</sup> about the price of the juice before it boils for the one who cooks it or make it into wine. He<sup>asws</sup> said: ‘If he were to sell it before it becomes wine and it is Permissible, so there is no problem’."]}}, {"index": 8977, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:5:2:106:4", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنِ ابْنِ مُسْكَانَ عَنْ يَزِيدَ بْنِ خَلِيفَةَ قَالَ كَرِهَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) بَيْعَ الْعَصِيرِ بِتَأْخِيرٍ ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Ibn Muskan, from Yazeed Bin Khaleefa who said, ", "‘Abu Abdullah<sup>asws</sup> disliked selling the juice with a delay (on credit, lest it turns into wine)’."]}}, {"index": 8978, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:5:2:106:5", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ مُعَاوِيَةَ بْنِ سَعْدٍ عَنِ الرِّضَا ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ نَصْرَانِيٍّ أَسْلَمَ وَ عِنْدَهُ خَمْرٌ وَ خَنَازِيرُ وَ عَلَيْهِ دَيْنٌ هَلْ يَبِيعُ خَمْرَهُ وَ خَنَازِيرَهُ فَيَقْضِيَ دَيْنَهُ فَقَالَ لَا ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Najran, from Muhammad Bin Sinan, from Muawiya Bin Sa’ad, ", "(It has been narrated) from Al-Reza<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a Christian who became a Muslim, and with him was wine, and pigs, and upon him were debts. Can he sell his wine and his pigs so he can fulfill his debts?’ So he<sup>asws</sup> said: ‘No’."]}}, {"index": 8979, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:5:2:106:6", "text": ["صَفْوَانُ عَنِ ابْنِ مُسْكَانَ عَنْ مُحَمَّدٍ الْحَلَبِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ بَيْعِ عَصِيرِ الْعِنَبِ مِمَّنْ يَجْعَلُهُ حَرَاماً فَقَالَ لَا بَأْسَ بِهِ تَبِيعُهُ حَلَالًا فَيَجْعَلُهُ [ذَاكَ] حَرَاماً فَأَبْعَدَهُ اللَّهُ وَ أَسْحَقَهُ ."], "translations": {"en.hubeali": ["Safwan Bin Muskan, from Muhammad Al Halby who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about selling the juice of the grapes to the one who makes it into a Prohibited (substance). So he<sup>asws</sup> said: ‘There is no problem with it. You can sell its as a Permissible (substance), so he makes that into a Prohibited (substance). May Allah<sup>azwj</sup> Distance him and Break him’."]}}, {"index": 8980, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:5:2:106:7", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ أَبَانٍ عَنْ أَبِي أَيُّوبَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) رَجُلٌ أَمَرَ غُلَامَهُ أَنْ يَبِيعَ كَرْمَهُ عَصِيراً فَبَاعَهُ خَمْراً ثُمَّ أَتَاهُ بِثَمَنِهِ فَقَالَ إِنَّ أَحَبَّ الْأَشْيَاءِ إِلَيَّ أَنْ يُتَصَدَّقَ بِثَمَنِهِ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan Bin Ali, from Aban, from Abu Ayoub who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘A man ordered his slave to sell his grapes as juice, but he sold it as wine, then came over with its price’. So he<sup>asws</sup> said: ‘The most beloved of things to me is that he should give its price in charity’."]}}, {"index": 8981, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:5:2:106:8", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ قَالَ كَتَبْتُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَسْأَلُهُ عَنْ رَجُلٍ لَهُ كَرْمٌ أَ يَبِيعُ الْعِنَبَ وَ التَّمْرَ مِمَّنْ يَعْلَمُ أَنَّهُ يَجْعَلُهُ خَمْراً أَوْ سَكَراً فَقَالَ إِنَّمَا بَاعَهُ حَلَالًا فِي الْإِبَّانِ الَّذِي يَحِلُّ شُرْبُهُ أَوْ أَكْلُهُ فَلَا بَأْسَ بِبَيْعِهِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina who said, ", "‘I wrote to Abu Abdullah<sup>asws</sup> asking him<sup>asws</sup> about a man for whom is a vineyard. Can he sell the grapes and the dates to the one whom he knows that he would make it into wine, or an intoxicant?’ So he<sup>asws</sup> said: ‘But rather, selling it is Permissible in a timely manner when the drinking of it is Permissible, or eating it. Thus, there is no problem with selling it’."]}}, {"index": 8982, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:5:2:106:9", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي رَجُلٍ كَانَتْ لَهُ عَلَى رَجُلٍ دَرَاهِمُ فَبَاعَ خَمْراً أَوْ خَنَازِيرَ وَ هُوَ يَنْظُرُ فَقَضَاهُ فَقَالَ لَا بَأْسَ بِهِ أَمَّا لِلْمُقْتَضِي فَحَلَالٌ وَ أَمَّا لِلْبَائِعِ فَحَرَامٌ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, form Hammad, from Hareyz, from Muhammad Bin Muslim, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding a man who had some Dirhams (as a debt) upon a man, so he sold wine, or pigs and he (the creditor) was waiting, so he paid him off. So he<sup>asws</sup> said: ‘There is no problem with it. As for the creditor, it is Permissible, and as for the seller, so it is Prohibited’."]}}, {"index": 8983, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:5:2:106:10", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ مَنْصُورٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) لِي عَلَى رَجُلٍ ذِمِّيٍّ دَرَاهِمُ فَيَبِيعُ الْخَمْرَ وَ الْخِنْزِيرَ وَ أَنَا حَاضِرٌ فَيَحِلُّ لِي أَخْذُهَا فَقَالَ إِنَّمَا لَكَ عَلَيْهِ دَرَاهِمُ فَقَضَاكَ دَرَاهِمَكَ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Yunus Bin Yaqoub, from Mansour who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘There are some Dirhams for me upon a Zimmy man (as a debt). So he sells the wine and the prigs, and I am present. Is it Permissible fo me to take it (my money)?’ So he<sup>asws</sup> said: ‘But rather, for you upon him were Dirhams (to be paid), therefore fulfill your Dirhams’."]}}, {"index": 8984, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:5:2:106:11", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الرَّجُلِ يَكُونُ لِي عَلَيْهِ الدَّرَاهِمُ فَيَبِيعُ بِهَا خَمْراً وَ خِنْزِيراً ثُمَّ يَقْضِي عَنْهَا قَالَ لَا بَأْسَ أَوْ قَالَ خُذْهَا ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibn Azina, from Zurara, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the man upon whom were Dirhams (as a debt) for me. So he sells wine and pigs, then fulfils from it (clears the debt)’. He<sup>asws</sup> said: ‘There is no problem’, or said: ‘Take it (your money)’."]}}, {"index": 8985, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:5:2:106:12", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ حَنَانٍ عَنْ أَبِي كَهْمَسٍ قَالَ سَأَلَ رَجُلٌ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْعَصِيرِ فَقَالَ لِي كَرْمٌ وَ أَنَا أَعْصِرُهُ كُلَّ سَنَةٍ وَ أَجْعَلُهُ فِي الدِّنَانِ وَ أَبِيعُهُ قَبْلَ أَنْ يَغْلِيَ قَالَ لَا بَأْسَ بِهِ فَإِنْ غَلَى فَلَا يَحِلُّ بَيْعُهُ ثُمَّ قَالَ هُوَ ذَا نَحْنُ نَبِيعُ تَمْرَنَا مِمَّنْ نَعْلَمُ أَنَّهُ يَصْنَعُهُ خَمْراً ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail Bin Bazie, from Hanaan, from Abu Kahma who said, ", "‘A man asked Abu Abdullah<sup>asws</sup> about the juice, so he said, ‘There is a vineyard for me and I make juice of it every year, and I make it to be in the jugs and I sell these before it boils’. He<sup>asws</sup> said: ‘There is no problem with it. But, if it were to boil, so it is not Permissible to sell it’. Then he<sup>asws</sup> said: ‘It is that we<sup>asws</sup> sell our<sup>asws</sup> dates to the ones we<sup>asws</sup> know that he makes it as wine’."]}}, {"index": 8986, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:5:2:106:13", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ فِي مَجُوسِيٍّ بَاعَ خَمْراً أَوْ خَنَازِيرَ إِلَى أَجَلٍ مُسَمًّى ثُمَّ أَسْلَمَ قَبْلَ أَنْ يَحِلَّ الْمَالُ قَالَ لَهُ دَرَاهِمُهُ وَ قَالَ إِنْ أَسْلَمَ رَجُلٌ وَ لَهُ خَمْرٌ وَ خَنَازِيرُ ثُمَّ مَاتَ وَ هِيَ فِي مِلْكِهِ وَ عَلَيْهِ دَيْنٌ قَالَ يَبِيعُ دُيَّانُهُ أَوْ وَلِيٌّ لَهُ غَيْرُ مُسْلِمٍ خَمْرَهُ وَ خَنَازِيرَهُ وَ يَقْضِي دَيْنَهُ وَ لَيْسَ لَهُ أَنْ يَبِيعَهُ وَ هُوَ حَيٌّ وَ لَا يُمْسِكَهُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus, ‘Regarding a Magian who sells wine or pigs to a named term, then he became a Muslim before the wealth was released. ", "He<sup>asws</sup> said: ‘For him are his Dirhams’. And he<sup>asws</sup> said: ‘If the man becomes a Muslim and for him was wine and pigs, then he dies, and these were in his ownership, and upon him were debts, his creditor or his guardian can sell to a non-Muslim, his wine and his pigs and fulfill his debts, but it is not for him to sell it and he is alive, nor to keep it’."]}}, {"index": 8987, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:5:2:106:14", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ بَعْضِ أَصْحَابِنَا عَنِ الرِّضَا ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ نَصْرَانِيٍّ أَسْلَمَ وَ عِنْدَهُ خَمْرٌ وَ خَنَازِيرُ وَ عَلَيْهِ دَيْنٌ هَلْ يَبِيعُ خَمْرَهُ وَ خَنَازِيرَهُ وَ يَقْضِي دَيْنَهُ قَالَ لَا ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from one of our companions, ", "(It has been narrated) from Al-Reza<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a Christian who became a Muslim and with him was wine and pigs, and upon him were debts. Can he sell his wine and his pigs and fulfil his debts?’ He<sup>asws</sup> said: ‘No’."]}}]}, "index": "al-kafi:5:2:106", "kind": "verse_list"}