{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 110"
        },
        "path": "/books/al-kafi:5:2:110",
        "titles": {
          "ar": "باب الِاخْتِلَافِ فِي الرَّهْنِ ",
          "en": "Chapter 109 – The differing regarding the mortgage"
        }
      }
    ],
    "index": 1322,
    "local_index": 110,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 111"
        },
        "path": "/books/al-kafi:5:2:111",
        "titles": {
          "ar": "باب ضَمَانِ الْعَارِيَّةِ وَ الْوَدِيعَةِ ",
          "en": "Chapter 110 – The guarantee of the loan and the entrustment"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 109"
        },
        "path": "/books/al-kafi:5:2:109",
        "titles": {
          "ar": "باب الرَّهْنِ ",
          "en": "Chapter 108 – The Mortgage"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:110",
    "titles": {
      "ar": "باب الِاخْتِلَافِ فِي الرَّهْنِ ",
      "en": "Chapter 109 – The differing regarding the mortgage"
    },
    "verse_count": 4,
    "verse_start_index": 9011,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالموثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/285)"
        ],
        "index": 9012,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1565",
              "text": "حُمَيْدُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/560",
              "text": "الْحَسَنِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/219",
              "text": "غَيْرِ وَاحِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/220",
              "text": "أَبَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/68",
              "text": "ابْنِ أَبِي يَعْفُورٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانٍ عَنِ ابْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:110:1",
        "text": [
          " إِذَا اخْتَلَفَا فِي الرَّهْنِ فَقَالَ أَحَدُهُمَا رَهَنْتَهُ بِأَلْفِ دِرْهَمٍ وَ قَالَ الْآخَرُ بِمِائَةِ دِرْهَمٍ فَقَالَ يُسْأَلُ صَاحِبُ الْأَلْفِ الْبَيِّنَةَ فَإِنْ لَمْ يَكُنْ لَهُ بَيِّنَةٌ حَلَفَ صَاحِبُ الْمِائَةِ ",
          "وَ إِنْ كَانَ الرَّهْنُ أَقَلَّ مِمَّا رُهِنَ أَوْ أَكْثَرَ وَ اخْتَلَفَا فَقَالَ أَحَدُهُمَا هُوَ رَهْنٌ وَ قَالَ الْآخَرُ هُوَ عِنْدَكَ وَدِيعَةٌ فَقَالَ يُسْأَلُ صَاحِبُ الْوَدِيعَةِ الْبَيِّنَةَ فَإِنْ لَمْ يَكُنْ لَهُ بَيِّنَةٌ حَلَفَ صَاحِبُ الرَّهْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad, from someone else, from Aban, from Ibn Abu Yafour, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When there is a differing regarding the mortgage, so one of the two says, ‘I mortgaged it with a thousand Dirhams’, and the other one says, ‘It was with one hundred Dirhams’, so he<sup>asws</sup> said: ‘The owner of the thousand would be asked for the proof. So if there does not happen to be any proof for him, the owner of the one hundred would be made to swear an oath. ",
            "And if it was such that the mortgage item was less than the security held, or more, and they both differed, so one of the two says, ‘It is a security deposit’, and the other one says, ‘It was a trust with you’, so he<sup>asws</sup> said: ‘The owner of the entrustment would be asked for the proof. So if there does not happen to be any proof for him, the owner of the mortgage would be made to swear an oath’."
          ],
          "en.sarwar": [
            "1. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad from more than one person from Aban from ibn abu Ya’fur who has said the foiiowing: “About the case of a dispute between the parties if one says that the amount of al-Rahn (security deposit) is one thousand dirham and the other says that it is one hundred dirham, abu ‘ Abd Allah, ‘Alayhi al-Salam, has said, ‘The one who claims it to be one thousand dirham is asked to present proof and testimony. If he fails to do so, then the other party is asked to take an oath.’ If the amount of al- Rahn (security deposit) is more or less but one party claims it to be al-Rahn (security deposit) and the party claims it to be Wadi‘ah (safe deposit), abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘The party who claims it to be Wadi ‘ah (safe deposit) is asked to present proof and testimony and upon his failure the other party is then asked to take an oath (to settle the dispute).’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/286)"
        ],
        "index": 9013,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/105",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/150",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/6",
              "text": "الْعَلَاءِ بْنِ رَزِينٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4260",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام ) فِي رَجُلٍ يَرْهَنُ عِنْدَ صَاحِبِهِ رَهْناً لَا بَيِّنَةَ بَيْنَهُمَا فِيهِ فَادَّعَى الَّذِي عِنْدَهُ الرَّهْنُ أَنَّهُ بِأَلْفٍ فَقَالَ صَاحِبُ الرَّهْنِ إِنَّمَا هُوَ بِمِائَةٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي رَجُلٍ يَرْهَنُ عِنْدَ صَاحِبِهِ رَهْناً لَا بَيِّنَةَ بَيْنَهُمَا فِيهِ فَادَّعَى الَّذِي عِنْدَهُ الرَّهْنُ أَنَّهُ بِأَلْفٍ فَقَالَ صَاحِبُ الرَّهْنِ إِنَّمَا هُوَ بِمِائَةٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:110:2",
        "text": [
          " الْبَيِّنَةُ عَلَى الَّذِي عِنْدَهُ الرَّهْنُ أَنَّهُ بِأَلْفٍ وَ إِنْ لَمْ يَكُنْ لَهُ بَيِّنَةٌ فَعَلَى الرَّاهِنِ الْيَمِينُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ali Bin Al Hakam, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding a man who mortgaged something with his companions. There was no proof between the two of them with regards to it. So the one with whom was the mortgaged item claimed that it was with a thousand, and the owner of the mortgaged item said, ‘But rather, it is with one hundred’. He<sup>asws</sup> said: ‘(The burden) of proof is upon the one with whom is the mortgaged item that it is with a thousand; and if there does not happen to be a proof for him, so it is upon the depositor to swear the oath’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Muhammad ibn af-Husayn from Afi ibn ai-Hakam from ai-‘Ala’ ibn Razin from Muhammad ibn Musfim who has said the following: “It is the case of the parties of al-Rahn (security deposit) who dispute and there is no proof and testimony available for the parties involved. Al-Rahn (security deposit) holder claims it to be one thousand and the owner of al-Rahn (security deposit) claims it to be one hundred. Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘Al-Rahn (security deposit) holder who claims it to be one thousand is required to present proof and testimony and if he fails then the other party takes an oath.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/287)"
        ],
        "index": 9014,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/745",
              "text": "الْحُسَيْنِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/28",
              "text": "إِسْحَاقَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4191",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ الْحُسَيْنِ بْنِ عُثْمَانَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:110:3",
        "text": [
          " لِرَجُلٍ لِي عَلَيْكَ أَلْفُ دِرْهَمٍ فَقَالَ الرَّجُلُ لَا وَ لَكِنَّهَا وَدِيعَةٌ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) الْقَوْلُ قَوْلُ صَاحِبِ الْمَالِ مَعَ يَمِينِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Al Husayn Bin Usman, from Is’haq Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who said to a man, ‘For me, upon you is a thousand Dirham’. So the man said, ‘No, but it is an entrustment’. So Abu Abdullah<sup>asws</sup> said: ‘The (final) word is the word of the owner of the wealth, along with swearing of his oath’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn abu ‘Umayr from al-Husayn ibn ‘Uthman from Ishaq ibn ‘Ammar who has said the following: “It is a case where one says that he is owed one thousand dirham and the other party says that it is Wadi‘ah (safe deposit). Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘The words of the owner of the asset are accepted in addition to his taking oath.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/287)"
        ],
        "index": 9015,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2073",
              "text": "عَبَّادِ بْنِ صُهَيْبٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبَّادِ بْنِ صُهَيْبٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:110:4",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ مَتَاعٍ فِي يَدِ رَجُلَيْنِ أَحَدُهُمَا يَقُولُ اسْتَوْدَعْتُكَهُ وَ الْآخَرُ يَقُولُ هُوَ رَهْنٌ قَالَ فَقَالَ الْقَوْلُ قَوْلُ الَّذِي يَقُولُ أَنَّهُ رَهْنٌ عِنْدِي إِلَّا أَنْ يَأْتِيَ الَّذِي ادَّعَى أَنَّهُ أَوْدَعَهُ بِشُهُودٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Abbad Bin Suheyb who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about some goods in the hands of two men. One of the two is saying, ‘I had entrusted it to you’, and the other is saying, ‘It is a mortgaged item’. So he<sup>asws</sup> said: ‘The (final) word is the word of those who is saying, ‘It is a mortgaged item with me’, unless if the one who claims that he had entrusted it were to come with witnesses’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from ‘Abbad ibn Suhayb who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of two men who disputed about an asset. One said that it was a Wadi ‘ah (safe deposit) and the other said that it was al-Rahn (security deposit). Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘The words of one who says that it is al-Rahn (security deposit) are accepted unless the other party presents witnesses who testify that it is Wadi ‘ah (safe deposit).”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:110",
  "kind": "verse_list"
}