{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 115"
        },
        "path": "/books/al-kafi:5:2:115",
        "titles": {
          "ar": "باب الصُّرُوفِ ",
          "en": "Chapter 114 – The exchange"
        }
      }
    ],
    "index": 1327,
    "local_index": 115,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 116"
        },
        "path": "/books/al-kafi:5:2:116",
        "titles": {
          "ar": "باب آخَرُ ",
          "en": "Chapter 115 – Another Chapter"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 114"
        },
        "path": "/books/al-kafi:5:2:114",
        "titles": {
          "ar": "باب ضَمَانِ الْجَمَّالِ وَ الْمُكَارِي وَ أَصْحَابِ السُّفُنِ",
          "en": "Chapter 113 – The liability of the cameleer, and the hirer (of animals), and the owners of the ships"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:115",
    "titles": {
      "ar": "باب الصُّرُوفِ ",
      "en": "Chapter 114 – The exchange"
    },
    "verse_count": 33,
    "verse_start_index": 9048,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/301)"
        ],
        "index": 9049,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3467",
              "text": "يَحْيَى بْنِ الْحَجَّاجِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3464",
              "text": "خَالِدِ بْنِ الْحَجَّاجِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يَحْيَى بْنِ الْحَجَّاجِ عَنْ خَالِدِ بْنِ الْحَجَّاجِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:1",
        "text": [
          " سَأَلْتُهُ عَنْ رَجُلٍ كَانَتْ لِي عَلَيْهِ مِائَةُ دِرْهَمٍ عَدَداً قَضَانِيهَا مِائَةَ دِرْهَمٍ وَزْناً قَالَ لَا بَأْسَ مَا لَمْ يَشْتَرِطْ قَالَ وَ قَالَ جَاءَ الرِّبَا مِنْ قِبَلِ الشُّرُوطِ إِنَّمَا تُفْسِدُهُ الشُّرُوطُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Isa, from Yahya Bin Al Hajjaj, from Khalid Bin Al Hajjaj who said, ",
            "‘I asked him<sup>asws</sup> about a man who had (a debt) upon him for me of one hundred Dirhams numberwise, so he paid it with one hundred Dirhams by weight. He<sup>asws</sup> said: ‘There is no problem with what had not been stipulated’. And he<sup>asws</sup> said: ‘The usury comes before the stipulations. But rather the stipulations spoil it’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn ‘Isa from Yahya ibn al-Hajjaj from Khalid ibn al-Hajjaj who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about the case of a man who owed me a hundred dirham in numbers and he paid me by weight. He (the Imam) said, ‘It is not unlawful if it is not stipulated . 5 He (the Imam) said, ‘Riba’ comes from stipulation; only stipulation destroys it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/302)"
        ],
        "index": 9050,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/28",
              "text": "إِسْحَاقَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:2",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) يَكُونُ لِلرَّجُلِ عِنْدِيَ الدَّرَاهِمُ الْوَضَحُ فَيَلْقَانِي فَيَقُولُ لِي كَيْفَ سِعْرُ الْوَضَحِ الْيَوْمَ فَأَقُولُ لَهُ كَذَا وَ كَذَا فَيَقُولُ أَ لَيْسَ لِي عِنْدَكَ كَذَا وَ كَذَا أَلْفَ دِرْهَمٍ وَضَحاً فَأَقُولُ بَلَى فَيَقُولُ لِي حَوِّلْهَا إِلَى دَنَانِيرَ بِهَذَا السِّعْرِ وَ أَثْبِتْهَا لِي عِنْدَكَ فَمَا تَرَى فِي هَذَا ",
          "فَقَالَ لِي إِذَا كُنْتَ قَدِ اسْتَقْصَيْتَ لَهُ السِّعْرَ يَوْمَئِذٍ فَلَا بَأْسَ بِذَلِكَ فَقُلْتُ إِنِّي لَمْ أُوَازِنْهُ وَ لَمْ أُنَاقِدْهُ إِنَّمَا كَانَ كَلَامٌ بَيْنِي وَ بَيْنَهُ فَقَالَ أَ لَيْسَ الدَّرَاهِمُ مِنْ عِنْدِكَ وَ الدَّنَانِيرُ مِنْ عِنْدِكَ قُلْتُ بَلَى قَالَ فَلَا بَأْسَ بِذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, and Sahl Bin Ziyad, from Ibn Mahboub, from Is’haq Bin Ammar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘There happened to be some clear Dirhams with me for a man. So he met up with me and he said to me, ‘What is the price of the clear (Dirhams) today?’ So I said to him, ‘Such and such’. So he said, ‘Isn’t there such and such thousand clear Dirhams with you for me?’ So I said, ‘Yes’. So he said to me, ‘Change these to Dinars with this price and affirm these for me with you’. So what is your<sup>asws</sup> view regarding this?’ ",
            "So he<sup>asws</sup> said to me: ‘When it was such that the price (rate of exchange) on that day was checked for him, so there is no problem with that’. So I said, ‘I did not weigh it and did not cash it, but rather it was a speech between me and him’. So he<sup>asws</sup> said: ‘Is it not that the Dirhams were with you and the Dinars were with you?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘So there is no problem with that’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad from and Sahl ibn Ziyad from ibn Mahbub from Ishaq ibn ‘Ammar who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘A man had a certain amount of clear dirhams with me and in a meeting asked me about the rates of clear dirham on that day and I said, ‘It is so and so much today . 5 He asked if he had so and so much thousand clear dirhams with me and I said that he was right and he asked me to change them with dinars with such rate and keep them with me. I wish to have your word about it. He (the Imam) said to me, ‘If you checked the rate thoroughly for him on that day it is not unlawful . 5 I then said that I did not weigh or actually exchange them; it was only exchange of words between us. He (the Imam) asked, ‘Is it not the case that dirhams are with you as well as dinars ? 5 I replied, ‘Yes, that is right . 5 He (the Imam) said, ‘It is not unlawful . 555 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/303)"
        ],
        "index": 9051,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2942",
              "text": "عَبْدِ الْمَلِكِ بْنِ عُتْبَةَ الْهَاشِمِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَبْدِ الْمَلِكِ بْنِ عُتْبَةَ الْهَاشِمِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:3",
        "text": [
          " سَأَلْتُ أَبَا الْحَسَنِ مُوسَى ( عليه السلام ) عَنْ رَجُلٍ يَكُونُ عِنْدَهُ دَنَانِيرُ لِبَعْضِ خُلَطَائِهِ فَيَأْخُذُ مَكَانَهَا وَرِقاً فِي حَوَائِجِهِ وَ هُوَ يَوْمَ قُبِضَتْ سَبْعَةٌ وَ سَبْعَةٌ وَ نِصْفٌ بِدِينَارٍ وَ قَدْ يَطْلُبُ صَاحِبُ الْمَالِ بَعْضَ الْوَرِقِ وَ لَيْسَتْ بِحَاضِرَةٍ فَيَبْتَاعَهَا لَهُ مِنَ الصَّيْرَفِيِّ بِهَذَا السِّعْرِ وَ نَحْوِهِ ثُمَّ يَتَغَيَّرُ السِّعْرُ قَبْلَ أَنْ يَحْتَسِبَا حَتَّى صَارَتِ الْوَرِقُ اثْنَيْ عَشَرَ دِرْهَماً بِدِينَارٍ فَهَلْ يَصْلُحُ ذَلِكَ لَهُ وَ إِنَّمَا هِيَ بِالسِّعْرِ الْأَوَّلِ حِينَ قَبَضَ كَانَتْ سَبْعَةٌ وَ سَبْعَةٌ وَ نِصْفٌ بِدِينَارٍ ",
          "قَالَ إِذَا دَفَعَ إِلَيْهِ الْوَرِقَ بِقَدْرِ الدَّنَانِيرِ فَلَا يَضُرُّهُ كَيْفَ الصُّرُوفُ وَ لَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Abdul Malik Bin Utba Al hashimy who said, ",
            "‘I asked Abu Al-Hassan Musa<sup>asws</sup> about a man who happened to have Dinars with him for one of his associates. So he took paper (silver Dirhams) in place of it regarding his needs, and it (the exchange rate) on the day he took possession of it was seven and seven and a half for one Dinar, and the owner of the wealth had sought some of the silver (Dirhams) and it was not present, so he gave it to him from a money-changer with this price, and near to it. Then the price (rate) changed before he accounted until the silver (Dirhams) came to be twelve Dirhams for a Dinar. So, is that correct for him, and rather it is with the former price when he took possession of it of a seven and seven and a half for a Dinar?’ ",
            "He<sup>asws</sup> said: ‘When the silver (Dirhams) were handed over to him in accordance with the Dinars, so it does not harm him how it was changed, and there is no problem’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from ‘Abd al-Malik ibn ‘Utbah al-Hashimiy who has said the following: “I once asked abu al-Hassan, Musa, ‘Alayhi al-Salam, about the case of a man who had with him a certain amount of dinars that belonged to a person of his associates for which he took wariq (dirham) from him for his needs; and the rate on that day was seven and seven and a half dirham for dinar. The owner of the asset asked for a certain amount of wariq (dirham) for his needs and it was not present and he bought them for him from a money changer with this rate or so then the rate changed before they finalized the account until the wariq (dirham) became twelve dirhams for one dinar; if he could settle it with him and it was with the rate as it was at the beginning when he took possession which was seven and seven and a half for a dinar. He (the Imam) said, ‘When he gave wariq (dirham) to him equal to the amount of dinars it is not harmful how the rates are and it is not harmful . 555 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/303)"
        ],
        "index": 9052,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/300",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/168",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:4",
        "text": [
          " سَأَلْتُهُ عَنِ الرَّجُلِ تَكُونُ عَلَيْهِ دَنَانِيرُ قَالَ لَا بَأْسَ أَنْ يَأْخُذَ قِيمَتَهَا دَرَاهِمَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the man who happened to have Dinars upon him. He<sup>asws</sup> said: ‘There is no problem if he was to take its value in Dirhams’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who owed dinars. He (the Imam) said, ‘It is not unlawful if he takes its price in the form of dirhams . 555 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/303)"
        ],
        "index": 9053,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/132",
              "text": "حَمَّادِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/190",
              "text": "حَرِيزٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:5",
        "text": [
          " سَأَلْتُهُ عَنْ رَجُلٍ كَانَتْ لَهُ عَلَى رَجُلٍ دَنَانِيرُ فَأَحَالَ عَلَيْهِ رَجُلًا آخَرَ بِالدَّنَانِيرِ أَ يَأْخُذُهَا دَرَاهِمَ بِسِعْرِ الْيَوْمِ قَالَ نَعَمْ إِنْ شَاءَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from hammad Bin Isa, from Hareyz, from Muhammad Bin Muslim who said, ",
            "‘I asked him<sup>asws</sup> about a man who had some Dinars for him upon a man, so he assigned another man with the Dinars. Can he take it as Dirham with the (exchange) rate on the day?’ He<sup>asws</sup> said: ‘Yes, if he so desires it’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz from Muhammad ibn Muslim who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about the case of a man to whom another man owed a certain amount of dinars and he assigned another man to collect it from him; if he could take it in the form of dirhams for the current rate. He (the Imam) said, ‘Yes, if he wanted . 555 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/304)"
        ],
        "index": 9054,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/603",
              "text": "صَفْوَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/217",
              "text": "ابْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/168",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنِ ابْنِ مُسْكَانَ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:6",
        "text": [
          " سَأَلْتُهُ عَنِ الرَّجُلِ يَكُونُ لَهُ الدَّيْنُ دَرَاهِمُ مَعْلُومَةٌ إِلَى أَجَلٍ فَجَاءَ الْأَجَلُ وَ لَيْسَ عِنْدَ الرَّجُلِ الَّذِي عَلَيْهِ الدَّرَاهِمُ فَقَالَ خُذْ مِنِّي دَنَانِيرَ بِصَرْفِ الْيَوْمِ قَالَ لَا بَأْسَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Ibn Muskan, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the man who happened to have the debt of known Dirhams upon him to a specified term. So the term came up and there were no Dirhams with the man upon whom was the debt. So he said, ‘Take Dinars from me with the exchange rate of the day’. He<sup>asws</sup> said: ‘There is no problem with it’."
          ],
          "en.sarwar": [
            "6. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan from ibn Muskan from al-Halabiy who has said the following: “This is concerning my question before abu ‘ Abd Allah, ‘Alayhi al-Salam, about the case of a man who owed a certain amount of dirham and the party asked him to accept from him in the form of dinar at the current rate. He (the Imam) said, Tt is not unlawful. 5 ” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/304)"
        ],
        "index": 9055,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/170",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/28",
              "text": "إِسْحَاقَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:7",
        "text": [
          " سَأَلْتُ أَبَا إِبْرَاهِيمَ ( عليه السلام ) عَنِ الرَّجُلِ يَبِيعُنِي الْوَرِقَ بِالدَّنَانِيرِ وَ أَتَّزِنُ مِنْهُ فَأَزِنُ لَهُ حَتَّى أَفْرُغَ فَلَا يَكُونُ بَيْنِي وَ بَيْنَهُ عَمَلٌ إِلَّا أَنَّ فِي وَرِقِهِ نُفَايَةً وَ زُيُوفاً وَ مَا لَا يَجُوزُ فَيَقُولُ انْتَقِدْهَا وَ رُدَّ نُفَايَتَهَا "
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Is’haq Bin Ammar who said, ",
            "‘I asked Abu Ibrahim<sup>asws</sup> about the man who sold me the silver (Dirhams) with the Dinars, and I weighed from it. So I weighed for him until I was free, and there was no work between me and him except regarding his silver (Dirhams) were spoilt and weak (coins) and what is not allowed (invalid coins). So he said, ‘Cash these and return the invalid ones’. ",
            "فَقَالَ لَيْسَ بِهِ بَأْسٌ وَ لَكِنْ لَا تُؤَخِّرْ ذَلِكَ أَكْثَرَ مِنْ يَوْمٍ أَوْ يَوْمَيْنِ فَإِنَّمَا هُوَ الصَّرْفُ قُلْتُ فَإِنْ وَجَدْتُ فِي وَرِقِهِ فَضْلًا مِقْدَارَ مَا فِيهَا مِنَ النُّفَايَةِ فَقَالَ هَذَا احْتِيَاطٌ هَذَا أَحَبُّ إِلَيَّ .",
            "So he<sup>asws</sup> said: ‘There is no probem with it, but you should not delay that for more than one day or two days, for this, rather is the exchange’. I said, ‘Supposing if he were to find in his silver (dirhams) excess of the measurement of whatever was therein from the invalid (coins)?’ So he<sup>asws</sup> said: ‘This is a precaution. This is more beloved to me<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "7. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from Ishaq ibn ‘Ammar who has said the following: “I once asked abu Ibrahim, ‘Alayhi al-Salam, about the case of a man who sold to me wariq (dirham) for dinar and I weighed it from him. I weighed it for him until it was complete and there was no other work between us, except that his wariq (dirham) had invalid and unreal pieces, and what was not permissible in them. He asked me to find and return such pieces. He (the Imam) said, Tt is not unlawful; however, you must not delay it more than one day or two, because it is exchange . 5 I then asked, ’What happens if I find extra in them equal to the amount of invalid ones ? 5 He (the Imam) said, ‘This is precautionary measure and I like it more . 555 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/306)"
        ],
        "index": 9056,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/3099",
              "text": "صَفْوَانُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/28",
              "text": "إِسْحَاقَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "صَفْوَانُ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:8",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الدَّرَاهِمُ بِالدَّرَاهِمِ وَ الرَّصَاصِ فَقَالَ الرَّصَاصُ بَاطِلٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Safwan, from Is’haq Bin Ammar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The Dirhams by the Dirhams and the lead?’ So he<sup>asws</sup> said: ‘The lead is invalid’."
          ],
          "en.sarwar": [
            "8. Safwan has narrated from Ishaq ibn ‘Ammar who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, if exchange of dirham for dirham and lead was permissible. He (the Imam) said, ‘Lead is not valid . 555 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/306)"
        ],
        "index": 9057,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/104",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/603",
              "text": "صَفْوَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/206",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:9",
        "text": [
          " سَأَلْتُهُ عَنِ الصَّرْفِ فَقُلْتُ لَهُ الرِّفْقَةُ رُبَّمَا عَجِلَتْ فَخَرَجَتْ فَلَمْ نَقْدِرْ عَلَى الدِّمَشْقِيَّةِ وَ الْبَصْرِيَّةِ وَ إِنَّمَا تَجُوزُ بِسَابُورَ الدِّمَشْقِيَّةُ وَ الْبَصْرِيَّةُ فَقَالَ وَ مَا الرِّفْقَةُ فَقُلْتُ الْقَوْمُ يَتَرَافَقُونَ وَ يَجْتَمِعُونَ لِلْخُرُوجِ فَإِذَا عَجِلُوا فَرُبَّمَا لَمْ نَقْدِرْ عَلَى الدِّمَشْقِيَّةِ وَ الْبَصْرِيَّةِ فَبَعَثْنَا بِالْغِلَّةِ فَصَرَفُوا أَلْفاً وَ خَمْسِينَ دِرْهَماً مِنْهَا بِأَلْفٍ مِنَ الدِّمَشْقِيَّةِ وَ الْبَصْرِيَّةِ فَقَالَ لَا خَيْرَ فِي هَذَا أَ فَلَا تَجْعَلُونَ فِيهَا ذَهَباً لِمَكَانِ زِيَادَتِهَا ",
          "فَقُلْتُ لَهُ أَشْتَرِي أَلْفَ دِرْهَمٍ وَ دِينَاراً بِأَلْفَيْ دِرْهَمٍ فَقَالَ لَا بَأْسَ بِذَلِكَ  إِنَّ أَبِي ( عليه السلام ) كَانَ أَجْرَى عَلَى أَهْلِ الْمَدِينَةِ مِنِّي وَ كَانَ يَقُولُ هَذَا فَيَقُولُونَ إِنَّمَا هَذَا الْفِرَارُ لَوْ جَاءَ رَجُلٌ بِدِينَارٍ لَمْ يُعْطَ أَلْفَ دِرْهَمٍ وَ لَوْ جَاءَ بِأَلْفِ دِرْهَمٍ لَمْ يُعْطَ أَلْفَ دِينَارٍ وَ كَانَ يَقُولُ لَهُمْ نِعْمَ الشَّيْ‏ءُ الْفِرَارُ مِنَ الْحَرَامِ إِلَى الْحَلَالِ .",
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى وَ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ مِثْلَهُ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan, from Abdul Rahman Bin Al Hajjaj who said, ",
            "‘I asked him<sup>asws</sup> about the exchange and I said to him<sup>asws</sup>, ‘Sometimes the friends hurry and go out, so we are not able (to acquire) the Damascus (Dirhams) and the Basran (Dihrams), and rather they only allow with a <span class=\"iTxt\">Sabour</span> of Damascus and the Basran (<span class=\"iTxt\">Sabour</span>)’. So he<sup>asws</sup> said:’And what are the friends?’ So I said, ‘The group of people who are associating and they are gathering for the going out. So when they make haste, and sometimes were are not able upon (acquiring) the Damascus and the Basran (Dirham). So we send with the proceeds and they exchange it at a thousand and fifty Dirhams from it with a thousand from the Dasmascus and the Basran (Dirhams)’. So he<sup>asws</sup> said: ‘There is no goodness in this. Why are you not placing gold in place of its excess?’ ",
            "So I said to him<sup>asws</sup>, ‘Can I buy a thousand Dirhams and Dinars with two thousand Dirhams’. So he<sup>asws</sup> said: ‘There is no problem with that. My<sup>asws</sup> father<sup>asws</sup> used to be more accomplishing upon the people of Al-Medina that I<sup>asws</sup> was, and he<sup>asws</sup> was saying this. So they were saying, ‘But rather, this is fleeing’. If a man would come with Dinars, he<sup>asws</sup> would not give a thousand Dirham, and if he came with a thousand Dirhams, he<sup>asws</sup> would give a thousand Dinars, and he<sup>asws</sup> was saying to them: ‘The best thing is to flee from the Prohibitions to the Permissibles’.",
            "<span style=\"font-size: small\">Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Safwaan  Bin Yahya, and Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajjaj</span> – similar to it’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Safwan from ‘Abd al- Rahman ibn al-Hajjaj who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about currency exchange saying, ‘The comrades perhaps hurry and I go with them but cannot find al-Dimishqiyah (dirham) or al-Basriyah; they only allow only Sabur of al-Dimishqiyah and al-Basriyah. He (the Imam) asked, ‘What is comrade ? 5 I replied, ‘A group of people get together to travel and when they hurry we may not find al-Dimishqiyah and al-Basriyah; then we send invalid dirham and they exchange it one thousand and fifteen for one thousand al-Dimishqiyah and al-Basriyah . 5 He (the Imam) said, ‘There is nothing good in it. Why you do not place gold instead of the extra ? 5 I then asked, ‘Can I buy one thousand dinar for two thousand dirhams ? 5 He (the Imam) said, Tt is not unlawful. My father was more influential than me among the people of al-Madinah and he would say this. People would say it is running away. If a man comes with dinar he does not give it for a thousand dirham, and if he comes with one thousand dirham, he does not give one thousand dinar. He (the Imam) would say to them, ‘Yes, running away from unlawful matters to lawful ones is the best policy . 555 Ali ibn Ibrahim has narrated from his father and Muhammad ibn ‘Isma’il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya and ibn abu ‘Umayr from ‘Abd al-Rahman, a similar Hadith. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/307)"
        ],
        "index": 9058,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/206",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:10",
        "text": [
          " كَانَ مُحَمَّدُ بْنُ الْمُنْكَدِرِ يَقُولُ لِأَبِي يَا أَبَا جَعْفَرٍ رَحِمَكَ اللَّهُ وَ اللَّهِ إِنَّا لَنَعْلَمُ أَنَّكَ لَوْ أَخَذْتَ دِينَاراً وَ الصَّرْفُ بِثَمَانِيَةَ عَشَرَ فَدُرْتَ الْمَدِينَةَ عَلَى أَنْ تَجِدَ مَنْ يُعْطِيكَ عِشْرِينَ مَا وَجَدْتَهُ وَ مَا هَذَا إِلَّا فِرَاراً وَ كَانَ أَبِي يَقُولُ صَدَقْتَ وَ اللَّهِ وَ لَكِنَّهُ فِرَارٌ مِنْ بَاطِلٍ إِلَى حَقٍّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajjaj, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Muhammad Bin Al-Munkadar was saying to my father, ‘O Abu Ja’far<sup>asws</sup>, may Allah<sup>azwj</sup> have Mercy on you<sup>asws</sup>! We know that if you<sup>asws</sup> were to take Dinars and the exchange rate was with eighteen, so you<sup>asws</sup> would go around Al-Medina upon that if you<sup>asws</sup> would find one who would give you<sup>asws</sup> twenty, you<sup>asws</sup> would not find him, and what is this except for the fleeing?’ And my<sup>asws</sup> father was saying: ‘You speak the truth, by Allah<sup>azwj</sup>, but, fleeing it from falsehood to the truth’."
          ],
          "en.sarwar": [
            "10. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Abd al-Rahman ibn al-Hajjaj who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Muhammad ibn al-Munkadir would say to my father, ‘O abu Ja‘far, Allah has granted you kindness, by Allah, we know, if you take a dinar and the rate is eighteen and you go around the whole of al-Madinah to find one who would give you twenty, you will not find and this is no more than running away. My father would say, ‘You are right, by Allah, however, it is running away from falsehood to the truth . 555 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/307)"
        ],
        "index": 9059,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/603",
              "text": "صَفْوَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/217",
              "text": "ابْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1099",
              "text": "مُحَمَّدٍ الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنِ ابْنِ مُسْكَانَ عَنْ مُحَمَّدٍ الْحَلَبِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:11",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَسْتَبْدِلُ الْكُوفِيَّةَ بِالشَّامِيَّةِ وَزْناً بِوَزْنٍ فَيَقُولُ الصَّيْرَفِيُّ لَا أُبَدِّلُ لَكَ حَتَّى تُبَدِّلَ لِي يُوسُفِيَّةً بِغِلَّةٍ وَزْناً بِوَزْنٍ فَقَالَ لَا بَأْسَ فَقُلْنَا إِنَّ الصَّيْرَفِيَّ إِنَّمَا طَلَبَ فَضْلَ الْيُوسُفِيَّةِ عَلَى الْغِلَّةِ فَقَالَ لَا بَأْسَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Ibn Muskan, from Muhammad Al halby who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man who exchanges the Kufiyan (coin) with the Syrian (coin), weight by weight. So the money-changer is saying, ‘I will not change for you until you change for me a Yusufiyya with a price with a profit, weight by weight. So he<sup>asws</sup> said: ‘There is no problem’. So we said, ‘But rather the money-changer sought the extra Yusufiyya upon the profit’. So he<sup>asws</sup> said: ‘There is no problem with it’."
          ],
          "en.sarwar": [
            "11. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan from ibn Muskan from Muhammad al-Halabiy who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who exchanged al-Kufiy (dirham) for al-Shamiy in equal weight, and the exchanger said, ‘I will not exchange it for you unless you exchange for me invalid Yusufiyah in equal weight . 5 He (the Imam) said, ‘It is not unlawful . 5 We then said, ‘The exchanger asked for the extra of invalid al-Yusufiyah only . 5 He (the Imam) said, ‘It is not unlawful . 555 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/307)"
        ],
        "index": 9060,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/339",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/259",
              "text": "مَنْصُورِ بْنِ يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/28",
              "text": "إِسْحَاقَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/267",
              "text": "عُبَيْدِ بْنِ زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ عُبَيْدِ بْنِ زُرَارَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:12",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَكُونُ لِي عِنْدَهُ دَرَاهِمُ فَآتِيهِ فَأَقُولُ حَوِّلْهَا دَنَانِيرَ مِنْ غَيْرِ أَنْ أَقْبِضَ شَيْئاً قَالَ لَا بَأْسَ قُلْتُ يَكُونُ لِي عِنْدَهُ دَنَانِيرُ فَآتِيهِ فَأَقُولُ حَوِّلْهَا لِي دَرَاهِمَ وَ أَثْبِتْهَا عِنْدَكَ وَ لَمْ أَقْبِضْ مِنْهُ شَيْئاً قَالَ لَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Mansour Bin Yunus, from Is’haq Bin Ammar, from Ubeyd Bin Zurara who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man happened to have some Dirhams with him, for me. So I went over to him and I said, ‘Change these Dinars without me having taken possession of anything’. He<sup>asws</sup> said: ‘There is no problem’. I said, ‘There happens to be Dinars for me, so I go over to him and said, ‘Change these for me into Dirhams and keep these established with you’, and I do not take anything from it?’ He<sup>asws</sup> said: ‘There is no problem’."
          ],
          "en.sarwar": [
            "12. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ‘Isma’il from Mansur ibn Yunus from Ishaq ibn ‘Ammar from ‘Ubayd ibn Zurarah who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man with whom I had a certain amount of dinars; I asked him to change them to dirhams and keep them with himself. I did not take possession of any of them . 5 He (the Imam) said, ‘It is not unlawful . 555 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/308)"
        ],
        "index": 9061,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/300",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/168",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:13",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ ابْتَاعَ مِنْ رَجُلٍ بِدِينَارٍ فَأَخَذَ بِنِصْفِهِ بَيْعاً وَ بِنِصْفِهِ وَرِقاً قَالَ لَا بَأْسَ بِهِ ",
          "وَ سَأَلْتُهُ هَلْ يَصْلُحُ أَنْ يَأْخُذَ بِنِصْفِهِ وَرِقاً أَوْ بَيْعاً وَ يَتْرُكَ نِصْفَهُ حَتَّى يَأْتِيَ بَعْدُ فَيَأْخُذَ  بِهِ وَرِقاً أَوْ بَيْعاً قَالَ مَا أُحِبُّ أَنْ أَتْرُكَ مِنْهُ شَيْئاً حَتَّى آخُذَهُ جَمِيعاً فَلَا يَفْعَلْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who bought with Dinars from a man, so he took half as goods and half as silver (Dirhams)’. He<sup>asws</sup> said: ‘There is no problem with it’. ",
            "And I asked him<sup>asws</sup>, ‘Is it correct that he takes half as silver (Dirhams) or goods, and leave half of it until he comes over afterwards, so he takes silver (Dirhams) or goods with it?’ He<sup>asws</sup> said: ‘I<sup>asws</sup> do not like it that he leaves something from it until he takes it entirely, so he should not do it’."
          ],
          "en.sarwar": [
            "13. Ali ibn Ibrahim has narrated from his father from ibn abu ‘ Umayr from Hammad from al-Halabiy who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who bought from another man with a dinar; half in the form of certain goods, and with the half in the form of dirham. He (the Imam) said, ‘It is not unlawful . 5 I then asked, ‘Can he take half in the form of goods or dirham and leave the rest until he comes back and takes it in the form of dirham or goods ? 5 He (the Imam) said, ‘I do not like his leaving anything without taking it all at once . 555 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/308)"
        ],
        "index": 9062,
        "local_index": 14,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/603",
              "text": "صَفْوَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/28",
              "text": "إِسْحَاقَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:14",
        "text": [
          " سَأَلْتُ أَبَا إِبْرَاهِيمَ ( عليه السلام ) عَنِ الرَّجُلِ يَأْتِينِي بِالْوَرِقِ فَأَشْتَرِيهَا مِنْهُ بِالدَّنَانِيرِ فَأَشْتَغِلُ عَنْ تَعْيِيرِ وَزْنِهَا وَ انْتِقَادِهَا وَ فَضْلِ مَا بَيْنِي وَ بَيْنَهُ فِيهَا فَأُعْطِيهِ الدَّنَانِيرَ وَ أَقُولُ لَهُ إِنَّهُ لَيْسَ بَيْنِي وَ بَيْنَكَ بَيْعٌ فَإِنِّي قَدْ نَقَضْتُ الَّذِي بَيْنِي وَ بَيْنَكَ مِنَ الْبَيْعِ وَ وَرِقُكَ عِنْدِي قَرْضٌ وَ دَنَانِيرِي عِنْدَكَ قَرْضٌ حَتَّى تَأْتِيَنِي مِنَ الْغَدِ وَ أُبَايِعَهُ قَالَ لَيْسَ بِهِ بَأْسٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad in Abdul Jabbar,f rom Safwan, from Is’haq Bin Ammar who said, ",
            "‘I asked Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) about the man who came to me with the silver (Dirhams), so I bought these from him with the Dinars. So I got busy from checking its weight, and quibbling about it, and whatever the excess was between me and him therein, so I gave it as Dinars and I said to him, ‘It is not a sale between me and you for I have reversed between me and you from the sale, and the silver (Dirhams) with me is a loan, and the my Dinars with you is a loan, until you come to me tomorrow and I shall sell it to you’. He<sup>asws</sup> said: ‘There is no problem with it’."
          ],
          "en.sarwar": [
            "14. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan from Ishaq ibn ‘Ammar who has said the following: “I once asked abu Ibrahim, ‘Alayhi al-Salam, about the case of a man who came to me with dirham and I bought them from him with dinars; then I because of manner of weighing, cashing and the difference in between, I gave him dinars and said, ‘It is not a sale between us; I change what is between us in the form of sale. Your dirham with me is in the form of loan and my dinar with you is in the form of loan until you come tomorrow, then I sell . 5 He (the Imam) said, ‘It is not unlawful . 555 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/308)"
        ],
        "index": 9063,
        "local_index": 15,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/121",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/206",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " فِي"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:15",
        "text": [
          " الْأُسْرُبِّ يُشْتَرَى بِالْفِضَّةِ قَالَ إِنْ كَانَ الْغَالِبُ عَلَيْهِ الْأُسْرُبَّ فَلَا بَأْسَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether, from Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajjaj, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the lead (dirhams) bought with the silver (dirhams). He<sup>asws</sup> said: ‘If the lead was predominant upon it, so there is no problem with it’."
          ],
          "en.sarwar": [
            "15. Ali ibn Ibrahim has narrated from his father and Muhammad ibn ‘Isma’il has narrated from al-Fadl ibn Shadhan from all from ibn abu ‘Umayr from ‘Abd al-Rahman ibn al-Hajjaj who has said the following: “About the case of buying al-Asrub with silver, abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If al- Asrub is more prevalent then it is not unlawful . 555 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/309)"
        ],
        "index": 9064,
        "local_index": 16,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/603",
              "text": "صَفْوَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/28",
              "text": "إِسْحَاقَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:16",
        "text": [
          " سَأَلْتُ أَبَا إِبْرَاهِيمَ ( عليه السلام ) عَنِ الرَّجُلِ يَكُونُ لِي عَلَيْهِ الْمَالُ فَيَقْضِي بَعْضاً دَنَانِيرَ وَ بَعْضاً دَرَاهِمَ فَإِذَا جَاءَ يُحَاسِبُنِي لِيُوَفِّيَنِي كَمَا يَكُونُ قَدْ تَغَيَّرَ سِعْرُ الدَّنَانِيرِ أَيَّ السِّعْرَيْنِ أَحْسُبُ لَهُ الَّذِي كَانَ يَوْمَ أَعْطَانِي الدَّنَانِيرَ أَوْ سِعْرَ يَوْمِيَ الَّذِي أُحَاسِبُهُ قَالَ سِعْرَ يَوْمَ أَعْطَاكَ الدَّنَانِيرَ لِأَنَّكَ حَبَسْتَ مَنْفَعَتَهَا عَنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Is’haq Bin Ammar who said, ",
            "‘I asked Abu Ibrahim<sup>asws</sup> about the man who happens to have the goods for me (as a debt) upon him, so he paid some as Dinars and some as Dirhams. So when he came to account with me in order to fulfill to me as it used to be, for the rate of the Dinars had changed, i.e. both the rates. Shall I account for him (the rate) which was on the day he gave me the Dinars, or the rate on the day which he came to (finalise his) account with me?’ He<sup>asws</sup> said: ‘The rate on the day he gave you the Dinars, because you locked its profits from it’."
          ],
          "en.sarwar": [
            "16. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan from Ishaq ibn ‘Ammar who has said the following: “I once asked abu Ibrahim, ‘Alayhi al-Salam, about the case of a man who owed me a certain amount of assets and paid me back a certain amount in dinars and others in dirhams. He came to finalize the account to pay me the difference because of the exchange in rate of dinar. Was it necessary to pay according to the rate in the day he paid me dinars or the day of accounting? He (the Imam) said, ‘He must pay you according to the rate of the day he gave you dinars because you counted the profit from that day . 555 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/309)"
        ],
        "index": 9065,
        "local_index": 17,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/3099",
              "text": "صَفْوَانُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/28",
              "text": "إِسْحَاقَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "صَفْوَانُ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:17",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الرَّجُلُ يَجِيئُنِي بِالْوَرِقِ يَبِيعُنِيهَا يُرِيدُ بِهَا وَرِقاً عِنْدِي فَهُوَ الْيَقِينُ أَنَّهُ لَيْسَ يُرِيدُ الدَّنَانِيرَ لَيْسَ يُرِيدُ إِلَّا الْوَرِقَ وَ لَا يَقُومُ حَتَّى يَأْخُذَ وَرِقِي فَأَشْتَرِي مِنْهُ الدَّرَاهِمَ بِالدَّنَانِيرِ فَلَا يَكُونُ دَنَانِيرُهُ عِنْدِي كَامِلَةً فَأَسْتَقْرِضُ لَهُ مِنْ جَارِي فَأُعْطِيهِ كَمَالَ دَنَانِيرِهِ وَ لَعَلِّي لَا أُحْرِزُ وَزْنَهَا فَقَالَ أَ لَيْسَ يَأْخُذُ وَفَاءَ الَّذِي لَهُ قُلْتُ بَلَى قَالَ لَيْسَ بِهِ بَأْسٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Safwan, from Is’haq Bin Ammar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The man came to me with the silver (Dirhams) to sell to me wanting by it the silver (Dirhams) which I had on me. So it is certain that he did not want the Dinars, not wanting except for the silver (Dirhams), and he did not arise (to leave) until he took my silver (Dirhams). So I bought the Dirhams for him with the Dinars, and his dinars were not with me completely, and I borrowed from him from my neighbour, and I gave it to him to complete his Dinars and maybe I did not achieve its weight’. So he<sup>asws</sup> said: ‘Is it not that he took the total of that which was for him?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘There is no problem with it’."
          ],
          "en.sarwar": [
            "17. Safwan has narrated from Ishaq ibn ‘Ammar who has said the following: “This is concerning my question before abu ‘ Abd Allah, ‘Alayhi al-Salam, about the case of a man who came to me with dirham to sell them to me for the dirhams with me. He certainly did not want dinars but he wanted the dirham and he did not leave until he took my dirham. I bought from him dirham in exchange for dinars. His dinars were not with me in complete form so I borrowed from my neighbor and gave to him and perhaps I did not pay attention how much it weighed. He (the Imam) said, Ts it not the case that he takes it to offset what belongs to him?’ I replied, ‘Yes, that is true. He (the Imam) said, ‘It is not unlawful/” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/310)"
        ],
        "index": 9066,
        "local_index": 18,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/300",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/168",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:18",
        "text": [
          " أَبِي اشْتَرَى أَرْضاً وَ اشْتَرَطَ عَلَى صَاحِبِهَا أَنْ يُعْطِيَهُ وَرِقاً كُلُّ دِينَارٍ بِعَشَرَةِ دَرَاهِمَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘My<sup>asws</sup> father<sup>asws</sup> bought a land and stipulated upon its owner that he<sup>asws</sup> would give him silver (Dirhams), every Dinar with ten Dirhams’."
          ],
          "en.sarwar": [
            "18. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Um ay r from Hammad from al-Halabiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘My father purchased a piece of land and stipulated with the owner to pay him wariq (dirham) and dinar for ten dirham.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/310)"
        ],
        "index": 9067,
        "local_index": 19,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/724",
              "text": "فَضَالَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/304",
              "text": "أَبِي الْمَغْرَاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ عَنْ أَبِي الْمَغْرَاءِ عَنْ أَبِي بَصِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:19",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) آتِي الصَّيْرَفِيَّ بِالدَّرَاهِمِ أَشْتَرِي مِنْهُ الدَّنَانِيرَ فَيَزِنُ لِي بِأَكْثَرَ مِنْ حَقِّي ثُمَّ أَبْتَاعُ مِنْهُ مَكَانِي بِهَا دَرَاهِمَ قَالَ لَيْسَ بِهَا بَأْسٌ وَ لَكِنْ لَا تَزِنْ أَقَلَّ مِنْ حَقِّكَ "
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazala, from Abu Al Magra, from Abu Baseer who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I went to a money-changer and I bought the Dinars from him, so he weighed for me with more than my right. Then I bought Dirhams from him instantly’. He<sup>asws</sup> said: ‘There is no problem with it, but you do not weight less than your right’."
          ],
          "en.sarwar": [
            "19. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Fadalah from abu al-Mighra’ from abu Basir who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘I go to the money changer with dirhams and buy from him dinars. He weighs for me more than my right. I then at the same place buy from him with it dirhams. He (the Imam) said, ‘It is not unlawful but do not weigh less than your right.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/310)"
        ],
        "index": 9068,
        "local_index": 20,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/339",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/459",
              "text": "مُحَمَّدِ بْنِ الْفُضَيْلِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/592",
              "text": "أَبِي الصَّبَّاحِ الْكِنَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:20",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَقُولُ لِلصَّائِغِ صُغْ لِي هَذَا الْخَاتَمَ وَ أُبَدِّلَ لَكَ دِرْهَماً طَازَجاً بِدِرْهَمٍ غِلَّةٍ قَالَ لَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Muhammad Bin Al Fazeyl, from Abu Al Sabbah Al Kinany who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man who said to the jeweller, ‘Make this ring for me and I shall change for you one new Dirham with an old one’. He<sup>asws</sup> said: ‘There is no problem’."
          ],
          "en.sarwar": [
            "20. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ‘Isma’il from Muhammad ibn al-Fudayl from abu al-Sabbah al-Kinaniy who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who said to a jeweler, ‘Make for me this ring in exchange for one fresh dirham with one mixed dirham.’ He (the Imam) said, ‘It is not unlawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/311)"
        ],
        "index": 9069,
        "local_index": 21,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/201",
              "text": "عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:21",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ شِرَاءِ الذَّهَبِ فِيهِ الْفِضَّةُ وَ الزِّيْبَقُ وَ التُّرَابُ بِالدَّنَانِيرِ وَ الْوَرِقِ فَقَالَ لَا تُصَارِفْهُ إِلَّا بِالْوَرِقِ ",
          "قَالَ وَ سَأَلْتُهُ عَنْ شِرَاءِ الْفِضَّةِ فِيهَا الرَّصَاصُ وَ الْوَرِقُ إِذَا خَلَصَتْ نَقَصَتْ مِنْ كُلِّ عَشَرَةٍ دِرْهَمَيْنِ أَوْ ثَلَاثَةً قَالَ لَا يَصْلُحُ إِلَّا بِالذَّهَبِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Al Mugheira, from Abdullah Bin Sinan who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about buying the gold wherein is the silver, and the mercury and the dirt, with the Dinars and the silver (Dirhams)’. So he<sup>asws</sup> said: ‘Do not exchange it except with the silver (Dirhams)’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about buying the silver wherein is the lead, and the silver when it is pure being two or three Dirhams deficient from every ten Dirhams. He<sup>asws</sup> said: ‘It is not correct except with the gold’."
          ],
          "en.sarwar": [
            "21. Ali ibn Ibrahim has narrated from his father from ‘Abd Allah ibn al-Mughirah from ‘Abd Allah ibn Sinan who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about buying gold in which there was silver, mercury and soil in exchange for dinars and wariq (dirham). He (the Imam) said, ‘You must not change except with wariq (dirham).’ I then asked him (the Imam) about buying silver in which there was lead and wariq (dirham). If it was pure it was reduced by two or three dirhams of each ten. He (the Imam) said, ‘It is not valid except for gold.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/312)"
        ],
        "index": 9070,
        "local_index": 22,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/273",
              "text": "عَبْدِ اللَّهِ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/217",
              "text": "ابْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3502",
              "text": "أَبِي عَبْدِ اللَّهِ مَوْلَى عَبْدِ رَبِّهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ عَبْدِ اللَّهِ بْنِ يَحْيَى عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي عَبْدِ اللَّهِ مَوْلَى عَبْدِ رَبِّهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:22",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْجَوْهَرِ الَّذِي يُخْرَجُ مِنَ الْمَعْدِنِ وَ فِيهِ ذَهَبٌ وَ فِضَّةٌ وَ صُفْرٌ جَمِيعاً كَيْفَ نَشْتَرِيهِ فَقَالَ تَشْتَرِيهِ بِالذَّهَبِ وَ الْفِضَّةِ جَمِيعاً ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Abdullah Bin Yahya, from Ibn Muskan, from Abu Abdullah, a slave of Abd Rabbih who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the gems which are extracted from the mines and therein is gold, and silver, and brass altogether, how to buy it?’ So he<sup>asws</sup> said: ‘You should buy it with the gold and the silver entirely’."
          ],
          "en.sarwar": [
            "22. A number of our people have narrated from Ahmad ibn Muhammad from al-FIusayn ibn Sa‘id from ‘Abd Allah ibn Yahya from ibn Muskan from abu ‘Abd Allah, Mawla “Abd Rabbihi who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a substance that was taken from the mine in which there were gold, silver and zinc. How could we buy it? He (the Imam) said, ‘You can buy it with both gold and silver.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/312)"
        ],
        "index": 9071,
        "local_index": 23,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/555",
              "text": "أَحْمَدُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/132",
              "text": "حَمَّادِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/518",
              "text": "شُعَيْبٍ الْعَقَرْقُوفِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ شُعَيْبٍ الْعَقَرْقُوفِيِّ عَنْ أَبِي بَصِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:23",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ بَيْعِ السَّيْفِ الْمُحَلَّى بِالنَّقْدِ فَقَالَ لَا بَأْسَ بِهِ ",
          "قَالَ وَ سَأَلْتُهُ عَنْ بَيْعِهِ بِالنَّسِيئَةِ فَقَالَ إِذَا نَقَدَ مِثْلَ مَا فِي فِضَّتِهِ فَلَا بَأْسَ بِهِ أَوْ لَيُعْطِي الطَّعَامَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Hammad Bin Isa, from Shuayb Al Aqarquqy, from Abu Baseer who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about selling the ornamented sword with the cash. So he<sup>asws</sup> said: ‘There is no problem with it’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about selling it on credit. So he<sup>asws</sup> said: ‘When the cash is similar to what is in its silver, so there is no problem with it, or let him give the foodstuff (as barter)’."
          ],
          "en.sarwar": [
            "23. Ahmad ibn Muhammad has narrated from al-Husayn ibn Sa‘id from Hammad ibn ‘Isa from Shu’ayb al-‘Aqarqufiy from abu Basir who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about selling the sword decorated with cash (gold or silver). He (the Imam) said, ‘It is not unlawful.’ I then asked about selling on credit. He (the Imam) said, ‘If what is sold for cash is like what it is for its silver, then is not unlawful; or give foodstuff.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/312)"
        ],
        "index": 9072,
        "local_index": 24,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/434",
              "text": "أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/45",
              "text": "عَلِيِّ بْنِ حَدِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3153",
              "text": "عَلِيِّ بْنِ مَيْمُونٍ الصَّائِغِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ عَلِيِّ بْنِ مَيْمُونٍ الصَّائِغِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:24",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَمَّا يُكْنَسُ مِنَ التُّرَابِ فَأَبِيعُهُ فَمَا أَصْنَعُ بِهِ قَالَ تَصَدَّقْ بِهِ فَإِمَّا لَكَ وَ إِمَّا لِأَهْلِهِ قَالَ قُلْتُ فَإِنَّ فِيهِ ذَهَباً وَ فِضَّةً وَ حَدِيداً فَبِأَيِّ شَيْ‏ءٍ أَبِيعُهُ قَالَ بِعْهُ بِطَعَامٍ قُلْتُ فَإِنْ كَانَ لِي قَرَابَةٌ مُحْتَاجٌ أُعْطِيهِ مِنْهُ قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Ali Bin Hadeed, from Ali Bin Maymoun Al Sa’ig who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about what is swept from the dirt, and I sell it. So what shall I do with it (the money)?’ He<sup>asws</sup> said: ‘Give it in charity with it, for either it is yours or it is for its rightful one’. I said, ‘Supposing therein is gold and silver and iron, so for which thing shall I sell it?’ He<sup>asws</sup> said: ‘Sell it with foodstuff (as barter)’. I said, ‘Supposing there are relatives for him who are needy, can I give it to them from it?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            "24. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from Ali ibn Hadid from Ali ibn Maymun al-Sa‘igh who has said the following: “I (jewelry maker) once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about what was swept from the soil (in his shop) and I sold it and what to do about it. He (the Imam) said, ‘Give it as charity; it is your thing or that of your family.’ I then said, ‘There is gold, silver and iron in it. How should I sell?’ He (the Imam) said, ‘Sell it in exchange for foodstuff.’ I then asked, ‘Can I give it to my needy relatives?’ He (the Imam) said, ‘Yes, you can do so.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالموثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/313)"
        ],
        "index": 9073,
        "local_index": 25,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1407",
              "text": "حُمَيْدُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1408",
              "text": "الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/212",
              "text": "غَيْرِ وَاحِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/257",
              "text": "أَبَانِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/288",
              "text": "مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ مُحَمَّدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:25",
        "text": [
          " سُئِلَ عَنِ السَّيْفِ الْمُحَلَّى وَ السَّيْفِ الْحَدِيدِ الْمُمَوَّهِ يَبِيعُهُ بِالدَّرَاهِمِ قَالَ نَعَمْ وَ بِالذَّهَبِ وَ قَالَ إِنَّهُ يُكْرَهُ أَنْ يَبِيعَهُ بِنَسِيئَةٍ وَ قَالَ إِذَا كَانَ الثَّمَنُ أَكْثَرَ مِنَ الْفِضَّةِ فَلَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from someone else, from Aban Bin Usman, from Muhammad who said, ",
            "‘He<sup>asws</sup> was asked about the ornamented sword, and the iron sword which was gilded exactly, can it be sold for the Dirhams?’ He<sup>asws</sup> said: ‘Yes, and with the gold’. And he<sup>asws</sup> said: ‘It is disliked that it should be sold on credit’. And he<sup>asws</sup> said: ‘When the price was more than the gold (in the decor), so there is no problem’."
          ],
          "en.sarwar": [
            "25. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad ibn Sama‘ah from more than one person from Aban ibn ‘Uthman from Muhammad who has said the following: “Once he (the Imam), ‘Alayhi al-Salam, was asked about the decorated sword and sword of iron which was gilded and was sold for dirhams. He (the Imam) said, ‘Yes, and it can be sold for gold also.’ He (the Imam) said, ‘It is Makruh (detestable) to sell it on credit.’ He (the Imam) said, ‘If the price is more than silver, it is not unlawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/313)"
        ],
        "index": 9074,
        "local_index": 26,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/318",
              "text": "عَلِيِّ بْنِ عُقْبَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3503",
              "text": "حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3504",
              "text": "إِبْرَاهِيمَ بْنِ هِلَالٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ حَمْزَةَ عَنْ إِبْرَاهِيمَ بْنِ هِلَالٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:26",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جَامٌ فِيهِ ذَهَبٌ وَ فِضَّةٌ أَشْتَرِيهِ بِذَهَبٍ أَوْ فِضَّةٍ فَقَالَ إِنْ كَانَ تَقْدِرُ عَلَى تَخْلِيصِهِ فَلَا وَ إِنْ لَمْ تَقْدِرْ عَلَى تَخْلِيصِهِ فَلَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Fazzal, from Ali Bin Uqba, from Hamza, from Ibrahim Bin Hilal who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘A goblet wherein is gold and silver, can it be bought with gold or silver?’ So he<sup>asws</sup> said: ‘If you are able upon purifying it, so no, and if you are no able upon purifying it, so there is no problem’."
          ],
          "en.sarwar": [
            "26. Ali ibn Ibrahim has narrated from his father from ibn Faddal from Ali ibn ‘Uqbah from Hamzah from Ibrahim ibn Hilal who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about a bowl in which there were gold and silver; if I could buy it with gold or silver. He (the Imam) said, ‘If you can purify it, it is not lawful; but if you cannot purify, then it is lawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/313)"
        ],
        "index": 9075,
        "local_index": 27,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/964",
              "text": "مُحَمَّدِ بْنِ أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/117",
              "text": "عُثْمَانَ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/28",
              "text": "إِسْحَاقَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:27",
        "text": [
          " قُلْتُ لَهُ تَجِيئُنِي الدَّرَاهِمُ بَيْنَهَا الْفَضْلُ فَنَشْتَرِيهِ بِالْفُلُوسِ فَقَالَ لَا يَجُوزُ وَ لَكِنِ انْظُرْ فَضْلَ مَا بَيْنَهُمَا فَزِنْ نُحَاساً وَ زِنِ الْفَضْلَ فَاجْعَلْهُ مَعَ الدَّرَاهِمِ الْجِيَادِ وَ خُذْ وَزْناً بِوَزْنٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Muhammad Bin Isa, from Usman Bin Isa, from Is’haq Bin Ammar who said, ",
            "‘I said to him<sup>asws</sup>, ‘There come to us the Dirhams between which are the remnants, for we tend to buy it with the money’. So he<sup>asws</sup> said: ‘It is not allowed, but look at the remnants what is between the two, to weight brass and weight the silver (remnants), so make it to be with the good Dirhams, and take weight by weight’."
          ],
          "en.sarwar": [
            "27. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ‘Isa from ‘Uthman ibn ‘Isa from Ishaq ibn ‘Ammar who has said the following: “I once said to him (the Imam), ‘Alayhi al-Salam, ‘We receive dirhams of different weight, then we buy them with al-Fulus,’ He (the Imam) said, ‘It is not lawful. Find the difference, then weigh copper and the difference then place it in good dirhams then take in equal weight.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/314)"
        ],
        "index": 9076,
        "local_index": 28,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/313",
              "text": "إِسْمَاعِيلَ بْنِ مَرَّارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3505",
              "text": "مُعَاوِيَةَ أَوْ غَيْرِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ مُعَاوِيَةَ أَوْ غَيْرِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:28",
        "text": [
          " سَأَلْتُهُ عَنْ جَوْهَرِ الْأُسْرُبِّ وَ هُوَ إِذَا خَلَصَ كَانَ فِيهِ فِضَّةٌ أَ يَصْلُحُ أَنْ يُسَلِّمَ الرَّجُلُ فِيهِ الدَّرَاهِمَ الْمُسَمَّاةَ فَقَالَ إِذَا كَانَ الْغَالِبُ عَلَيْهِ اسْمَ الْأُسْرُبِّ فَلَا بَأْسَ بِذَلِكَ يَعْنِي لَا يُعْرَفُ إِلَّا بِالْأُسْرُبِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus, from Muawiya, or someone else, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the lead jewels, and when it was pure it had silver in it. Is it correct that the man should submit an advance payment of a known amount of Dirhams with regards to it?’ So he<sup>asws</sup> said: ‘When it was such that the name of the lead overwhelmed it, so there is no problem with that, meaning it cannot be recognised except with the lead’."
          ],
          "en.sarwar": [
            "28. Ali ibn Ibrahim has narrated from his father from ‘Isma’il ibn Marrar from Yunus from Mu‘awiyah or others who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of the substance of al-’Usrub which when purified had silver in it; if one could buy it for advance payment for a known amount of dirhams. He (the Imam) said, ‘If people know it as al-‘Usrub only then it is not unlawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/314)"
        ],
        "index": 9077,
        "local_index": 29,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/121",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/603",
              "text": "صَفْوَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/206",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنْ صَفْوَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:29",
        "text": [
          " سَأَلْتُهُ عَنِ السُّيُوفِ الْمُحَلَّاةِ فِيهَا الْفِضَّةُ تُبَاعُ بِالذَّهَبِ إِلَى أَجَلٍ مُسَمًّى فَقَالَ إِنَّ النَّاسَ لَمْ يَخْتَلِفُوا فِي النَّسَاءِ أَنَّهُ الرِّبَا إِنَّمَا اخْتَلَفُوا فِي الْيَدِ بِالْيَدِ فَقُلْتُ لَهُ فَيَبِيعُهُ بِدَرَاهِمَ بِنَقْدٍ فَقَالَ كَانَ أَبِي يَقُولُ يَكُونُ مَعَهُ عَرْضٌ أَحَبُّ إِلَيَّ فَقُلْتُ لَهُ إِذَا كَانَتِ الدَّرَاهِمُ الَّتِي تُعْطَى أَكْثَرَ مِنَ الْفِضَّةِ الَّتِي فِيهَا فَقَالَ وَ كَيْفَ لَهُمْ بِالِاحْتِيَاطِ بِذَلِكَ قُلْتُ لَهُ فَإِنَّهُمْ يَزْعُمُونَ أَنَّهُمْ يَعْرِفُونَ ذَلِكَ فَقَالَ إِنْ كَانُوا يَعْرِفُونَ ذَلِكَ فَلَا بَأْسَ وَ إِلَّا فَإِنَّهُمْ يَجْعَلُونَ مَعَهُ الْعَرْضَ أَحَبُّ إِلَيَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Safwan, from Abdul Rahman Bin Al Hajjaj who said, ",
            "‘I asked him<sup>asws</sup> about the ornamented swords wherein is the silver, can it be sold with the gold to a specified term?’ So he<sup>asws</sup> said: ‘The people are not differing regarding the credit that it is the usury. But rather, they are differing regarding the hand to hand (transaction)’. So I said to him<sup>asws</sup>, ‘So can it be sold with the Dirhams in cash?’ So he<sup>asws</sup> said: ‘My<sup>asws</sup> father<sup>asws</sup> was saying: ‘If there was something along with it, it would be more beloved to me<sup>asws</sup>’. So I said to him<sup>asws</sup>, ‘When the Dirhams which are given are more than the silver which is therein?’ So he<sup>asws</sup> said: ‘And how would be the precaution for them with that?’ I said to him<sup>asws</sup>, ‘But they are claiming that they are recognising that’. So he<sup>asws</sup> said: ‘If they were recognising that, so there is no problem, or else if they were making something else to be along with it, it would be more beloved to me<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "29. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar and Muhammad ibn ‘Isma’il has narrated from al-Fadl ibn Shadhan from all from Safwan from ‘Abd al- Rahman ibn al-Hajjaj who has said the following: “I once asked him (the Imam); ‘Alayhi al-Salam, about the case of decorated swords in which there was silver sold for gold for an appointed time. He (the Imam) said, ‘People do not differ that on credit; it is Riba ’ (unlawful additional payment). They differ about the deal of hand in hand.’ I then asked, ‘Can he buy it with dirhams in cash?’ He (the Imam) said, ‘My father would say, “I like it to be along with something.’” I then asked, ‘What happens if dirhams given are more than the silver in it?’ He (the Imam) said, ‘How can they maintain precaution in it?’ I said that they think they know it. He (the Imam) said, ‘If they know it then it is not unlawful, otherwise, if they include something else along with it, is more desirable to me.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/315)"
        ],
        "index": 9078,
        "local_index": 30,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/964",
              "text": "مُحَمَّدِ بْنِ أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2454",
              "text": "أَبِي مُحَمَّدٍ الْأَنْصَارِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِي مُحَمَّدٍ الْأَنْصَارِيِّ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:30",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الرَّجُلُ يَكُونُ لِي عَلَيْهِ الدَّرَاهِمُ فَيُعْطِينِي الْمُكْحُلَةَ فَقَالَ الْفِضَّةُ بِالْفِضَّةِ وَ مَا كَانَ مِنْ كُحْلٍ فَهُوَ دَيْنٌ عَلَيْهِ حَتَّى يَرُدَّهُ عَلَيْكَ يَوْمَ الْقِيَامَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Muhammad Bin Isa, from Abu Muhammad Al Ansary, from Abdullah Bin Sinan who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The man happens to have the Dirhams (as a debt) upon him for me, so he gives me the Kohl’. So he<sup>asws</sup> said: ‘The silver is with the silver, and whatever was from Kohl, so it is a debt upon him until he returns it to you on the Day of Judgement’."
          ],
          "en.sarwar": [
            "30. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ‘Isa from abu Muhammad al-Ansariy from ‘ Abd Allah ibn Sinan who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who owed me a certain amount of dirham and gave me a container of al-Kohl. He (the Imam) said, ‘Silver is for silver and al-Kohl in it is a debt on him until he returns it to you on the Day of Judgment.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/316)"
        ],
        "index": 9079,
        "local_index": 31,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/76",
              "text": "ابْنِ أَبِي نَجْرَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/266",
              "text": "عَاصِمِ بْنِ حُمَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1661",
              "text": "مُحَمَّدِ بْنِ قَيْسٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:31",
        "text": [
          " قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) لَا يَبْتَاعُ رَجُلٌ فِضَّةً بِذَهَبٍ إِلَّا يَداً بِيَدٍ وَ لَا يَبْتَاعُ ذَهَباً بِفِضَّةٍ إِلَّا يَداً بِيَدٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, form Ibn Abu Najran, from Aasim Bin Humeyd, from Muhammad Bin Qays, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘A man should not sell silver with gold except in a hand to hand (transaction), and he should not sell gold with silver except in a hand to hand (transaction)’."
          ],
          "en.sarwar": [
            "31. Ali ibn Ibrahim has narrated from his father from ibn abu Najran from ‘Asim ibn Humayd from Muhammad ibn Qays who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin has said, ‘One must not sell silver for gold unless it is in a hand in hand deal; and gold is not sold in exchange for silver unless it is in a hand in hand deal.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/316)"
        ],
        "index": 9080,
        "local_index": 32,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/121",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/170",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/206",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:32",
        "text": [
          " سَأَلْتُهُ عَنِ الرَّجُلِ يَشْتَرِي مِنَ الرَّجُلِ الدَّرَاهِمَ بِالدَّنَانِيرِ فَيَزِنُهَا وَ يَنْقُدُهَا وَ يَحْسُبُ ثَمَنَهَا كَمْ هُوَ دِينَاراً ثُمَّ يَقُولُ أَرْسِلْ غُلَامَكَ مَعِي حَتَّى أُعْطِيَهُ الدَّنَانِيرَ فَقَالَ مَا أُحِبُّ أَنْ يُفَارِقَهُ حَتَّى يَأْخُذَ الدَّنَانِيرَ ",
          "فَقُلْتُ إِنَّمَا هُوَ فِي دَارٍ وَحْدَهُ وَ أَمْكِنَتُهُمْ قَرِيبَةٌ بَعْضُهَا مِنْ بَعْضٍ وَ هَذَا يَشُقُّ عَلَيْهِمْ فَقَالَ إِذَا فَرَغَ مِنْ وَزْنِهَا وَ إِنْقَادِهَا فَلْيَأْمُرِ الْغُلَامَ الَّذِي يُرْسِلُهُ أَنْ يَكُونَ هُوَ الَّذِي يُبَايِعُهُ وَ يَدْفَعُ إِلَيْهِ الْوَرِقَ وَ يَقْبِضُ مِنْهُ الدَّنَانِيرَ حَيْثُ يَدْفَعُ إِلَيْهِ الْوَرِقَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, and Muhammad Bin Ismail, from Al Fazl Bin Shazan altogether, from Safwan Bin Yahya, from Abdul lRahman Bin Al Hajjaj who said, ",
            "‘I asked him<sup>asws</sup> about the man who bought the Dirhams from the man with the Dinars. So he weighed them, and cashed them, and counted its price how many Dinars it was. Then he said, ‘Send your slave with me until I give him the Dinars’. So he<sup>asws</sup> said: ‘I<sup>asws</sup> do not like it that he separates until he takes the Dinars’. ",
            "So I said, ‘But rather, it is in one house, and it is possible nearby to each other, and this is grievous upon them’. So he<sup>asws</sup> said: ‘When they are free from weighing it and cashing it, so let him instruct the slave who is sent that he is the one who would become the one selling it, and he would hand over the silver and take possession of the Dinars from him when he hand the silver over to him’."
          ],
          "en.sarwar": [
            "32. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar Ahmad ibn Muhammad from Muhammad ibn ‘Isma’il has narrated from al-Fadl ibn Shadhan from all from Safwan ibn Yahya from ‘Abd al-Rahman ibn al-Hajjaj who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about the case of a man who bought dirhams in exchange for dinars; then weighed them, cashed them and counted their prices to find the amount of dinar, then said to him to send his slave so he gave him dinars. He (the Imam) said, ‘I do not like his separation before taking dinars.’ I then said, ‘It is only in the same house and their places are close to each other and this becomes difficult for them.’ He (the Imam) said, ‘When he completes weighing and cashing he must instruct the slave that he wants to send, to become the seller and give the wariq (dirham) to him and receive dinars from him as he delivers to him the wariq (dirham).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل كالموثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/317)"
        ],
        "index": 9081,
        "local_index": 33,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1407",
              "text": "حُمَيْدُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/532",
              "text": "الْحَسَنِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/212",
              "text": "غَيْرِ وَاحِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/257",
              "text": "أَبَانِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/785",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:115:33",
        "text": [
          " سَأَلْتُهُ عَنْ بَيْعِ الذَّهَبِ بِالدَّرَاهِمِ فَيَقُولُ أَرْسِلْ رَسُولًا فَيَسْتَوْفِيَ لَكَ ثَمَنَهُ فَيَقُولُ هَاتِ وَ هَلُمَّ وَ يَكُونُ رَسُولُكَ مَعَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad, from someone else, from Aban Bin Usman, from Abdul Rahman Bin Abu Abdullah, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>,said, ‘I asked him<sup>asws</sup> about selling the gold with the Dirhams, so he<sup>asws</sup> said: ‘Send a messenger so he would fulfill its price for you, and he should be saying, ‘Give and take’, and your messenger would happen to be with him’."
          ],
          "en.sarwar": [
            "33. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad from more than one person from Aban ibn ‘Uthman from ‘Abd al- Rahman ibn abu ‘Abd Allah who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about selling gold in exchange for dirham. He (the Imam) said, ‘Send a messenger to receive the price saying, ‘Give that and take this.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:115",
  "kind": "verse_list"
}