{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 121"
        },
        "path": "/books/al-kafi:5:2:121",
        "titles": {
          "ar": "باب رُكُوبِ الْبَحْرِ لِلتِّجَارَةِ ",
          "en": "Chapter 120 – Sailing the sea for the business"
        }
      }
    ],
    "index": 1333,
    "local_index": 121,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 122"
        },
        "path": "/books/al-kafi:5:2:122",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب أَنَّ مِنَ السَّعَادَةِ</span> أَنْ يَكُونَ مَعِيشَةُ الرَّجُلِ فِي بَلَدِهِ",
          "en": "Chapter 121 – It is from the good fortune that there happens to be livelihood for the man in his own city"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 120"
        },
        "path": "/books/al-kafi:5:2:120",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الرَّجُلِ يُعْطِي</span> الدَّرَاهِمَ ثُمَّ يَأْخُذُهَا بِبَلَدٍ آخَرَ",
          "en": "Chapter 119 – The man gives the Dirhams, then takes them in another city"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:121",
    "titles": {
      "ar": "باب رُكُوبِ الْبَحْرِ لِلتِّجَارَةِ ",
      "en": "Chapter 120 – Sailing the sea for the business"
    },
    "verse_count": 6,
    "verse_start_index": 9100,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/324)"
        ],
        "index": 9101,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:121:1",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ ابْنِ أَبِي نَجْرَانَ عَنِ الْعَلَاءِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُمَا كَرِهَا رُكُوبَ الْبَحْرِ لِلتِّجَارَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companion, from Ahmad Bin Muhammad Bin Khalid, from Ibn Abu Najran, from Al A’ala, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup> both having disliked sailing the sea for the business’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from ibn Khalid from ibn abu Najran from al-‘Ala’ from Muhammad ibn Muslim who has said the following: “Abu Ja‘far, and abu ‘ Abd Allah, ‘Alayhim al-Salam, have said, ‘We dislike sailing on the sea for business.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/320)"
        ],
        "index": 9102,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/253",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ رَفَعَهُ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ رَفَعَهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:121:2",
        "text": [
          " قَالَ عَلِيٌّ ( عليه السلام ) مَا أَجْمَلَ فِي الطَّلَبِ مَنْ رَكِبَ الْبَحْرَ لِلتِّجَارَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, raising it, said: ",
            "‘Amir Al-Momineen<sup>asws</sup> said: ‘What is more nicer regarding the seeking (the earnings rather than) the one who sails the sea for the business’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated in a marfu’ manner the following: “Amir al-Mu’minin, Ali, ‘Alayhi al-Salam, ‘has said, ‘How beautiful is the quest for trade to sail on the sea!”’ [Note: H 9118 and H 9119 appear to occur during two different eras, perhaps of safe and unsafe sailing times] "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/325)"
        ],
        "index": 9103,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/92",
              "text": "عَلِيِّ بْنِ أَسْبَاطٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:121:3",
        "relations": {
          "Mentions": [
            "/books/quran:43:14",
            "/books/quran:43:13"
          ]
        },
        "text": [
          " كُنْتُ حَمَلْتُ مَعِي مَتَاعاً إِلَى مَكَّةَ فَبَارَ عَلَيَّ فَدَخَلْتُ بِهِ الْمَدِينَةَ عَلَى أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) وَ قُلْتُ لَهُ إِنِّي حَمَلْتُ مَتَاعاً قَدْ بَارَ عَلَيَّ وَ قَدْ عَزَمْتُ عَلَى أَنْ أَصِيرَ إِلَى مِصْرَ فَأَرْكَبُ بَرّاً أَوْ بَحْراً فَقَالَ مِصْرُ الْحُتُوفِ يُقَيَّضُ لَهَا أَقْصَرُ النَّاسِ أَعْمَاراً وَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَا أَجْمَلَ فِي الطَّلَبِ مَنْ رَكِبَ الْبَحْرَ",
          "ثُمَّ قَالَ لِي لَا عَلَيْكَ أَنْ تَأْتِيَ قَبْرَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَتُصَلِّيَ عِنْدَهُ رَكْعَتَيْنِ فَتَسْتَخِيرَ اللَّهَ مِائَةَ مَرَّةٍ فَمَا عَزَمَ لَكَ عَمِلْتَ بِهِ فَإِنْ رَكِبْتَ الظَّهْرَ فَقُلِ الْحَمْدُ لِلَّهِ الَّذِي سَخَّرَ لَنَا هَذَا وَ مَا كُنَّا لَهُ مُقْرِنِينَ وَ إِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ ",
          "وَ إِنْ رَكِبْتَ الْبَحْرَ فَإِذَا صِرْتَ فِي السَّفِينَةِ فَقُلْ بِسْمِ اللَّهِ مَجْرَيهَا وَ مُرْسَيهَا إِنَّ رَبِّي لَغَفُورٌ رَحِيمٌ فَإِذَا هَاجَتْ عَلَيْكَ الْأَمْوَاجُ فَاتَّكِ عَلَى يَسَارِكَ وَ أَوْمِ إِلَى الْمَوْجَةِ بِيَمِينِكَ وَ قُلْ قِرِّي بِقَرَارِ اللَّهِ وَ اسْكُنِي بِسَكِينَةِ اللَّهِ وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ [الْعَلِيِّ الْعَظِيمِ] ",
          "قَالَ عَلِيُّ بْنُ أَسْبَاطٍ فَرَكِبْتُ الْبَحْرَ فَكَانَتِ الْمَوْجَةُ تَرْتَفِعُ فَأَقُولُ مَا قَالَ فَتَتَقَشَّعُ كَأَنَّهَا لَمْ تَكُنْ ",
          "قَالَ عَلِيُّ بْنُ أَسْبَاطٍ وَ سَأَلْتُهُ فَقُلْتُ جُعِلْتُ فِدَاكَ مَا السَّكِينَةُ قَالَ رِيحٌ مِنَ الْجَنَّةِ لَهَا وَجْهٌ كَوَجْهِ الْإِنْسَانِ أَطْيَبُ رَائِحَةً مِنَ الْمِسْكِ وَ هِيَ الَّتِي أَنْزَلَهَا اللَّهُ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) بِحُنَيْنٍ فَهَزَمَ الْمُشْرِكِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ali Bin Asbaat who said, ",
            "‘I was carrying merchandise with me to Makkah but it was ruined upon me (incurred losses). So I entered the city with it to go to Abu Al-Hassan Al-Reza<sup>asws</sup> and said to him<sup>asws</sup>, ‘I carried merchandise which incurred losses upon me and I have resolved that I shall travel to Egypt. So, shall I travel the land or sea?’ So he<sup>asws</sup> said: ‘Egypt is the death, it worsely affects the youngest in age; and Rasool-Allah<sup>saww</sup> said: ‘What is nicer regarding the seeking (than) one who sails the sea’.",
            "Then he<sup>asws</sup> said to me: ‘It (Egypt) would not be against you if you were to go to the grave of Rasool-Allah<sup>saww</sup>, and Pray two Cycles in his<sup>saww</sup> presence, and ask Allah<sup>azwj</sup> hundred times (your wishes) and to Choose for you (the best) one (Istikhara). So whatever is resolved for you, work by it. So if you were to ride the back (of the animal), so say, ‘Said <span class=\"ibTxt\"><a href=\"/#/books/quran:43#h13\">[43:13]</a> Glory be to Him Who Made this subservient to us and we were not able to do it <a href=\"/#/books/quran:43#h14\">[43:14]</a> And surely to our Lord we must return</span>’.",
            "And if you were to sail the sea, so when you come to be in the ship, so say, ‘In the Name of Allah<sup>azwj</sup> Who Makes it to flow and sail. Surely, my Lord<sup>azwj</sup> is Forgiving, Merciful’. So if the waves were to heave upon you, so lean upon your left and gesture towards the wave with your right hand, and say, ‘Settle with the Settling of Allah<sup>azwj</sup> and be tranquil by the Tranquility of Allah<sup>azwj</sup>, and there is neither a might nor any strength except with Allah<sup>azwj</sup>, the Exalted, the Magnificent’. ",
            "Ali Bin Asbaat (the narrator) said, ‘So I sailed the sea, and whenever the wave raised itself, so I was saying what he<sup>asws</sup> had told me to say. So they used to break up as if it had never been.",
            "Ali Bin Asbaat (the narrator) said, ‘And I asked him<sup>asws</sup>, ‘My I be sacrificed for you<sup>asws</sup>! What is the tranquillity?’ He<sup>asws</sup> said: ‘A wind from the Paradise. For it is a face like the face of the human being. Its aroma is more fragrance than the Musk, and it is which Allah<sup>azwj</sup> Send down upon Rasool-Allah<sup>saww</sup> at (the battle of) Hunayn. Thus, the Polytheists were defeated’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from Ali ibn Asbat who has said the following: “I had carried goods with me to Makkah. I faced severe competition there so I went to visit abu al- Hassan, al-Rida’, ‘Alayhi al-Salam, and told him (the Imam) that I had carried goods to Makkah but I faced competition and I decided to travel to Egypt. Should I travel by land or by sea? He (the Imam) said, ’Egypt is destructive. It wrecks the youngest in age. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “How beautiful is sailing on the sea in quest for trade.’” He (the Imam) said, ‘It will not be against you if you go to the shrine of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, perform near him two Rak’at Salat (prayer) and ask Allah for what is good, one hundred times; then whatever decision comes to your mind follow that decision. When you ride say, “All praise belongs to Allah who has made it possible for us when we were not able to reach it. To our Lord, we return.” After you sail on the sea in the ship say, “In the name of Allah who has made it to flow and sail. My Lord is forgiving and merciful.” If waves agitate on you, lean to your left and make a gesture to your right to the waves and say, “Calm down through the calmness of Allah and be tranquil through tranquility of Allah. There is no means and power except the power and means of Allah, the most High, most Great.’” “Ali ibn Asbat has said, ‘I sailed on the sea and waves rose. I would say what I was told to say. It would break into pieces as if there was nothing.’ Ali ibn Asbat has said, ‘I asked him (the Imam) saying I pray to Allah to keep my soul in service for your cause, what is al-Sakinah ?’ He (the Imam) said, ‘It is a wind from paradise with a face like the face of the human being, more sweet smelling than musk, and it is the one Allah sent to the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, in Hunayn (name of a place) which defeated the pagans.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/326)"
        ],
        "index": 9104,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/460",
              "text": "أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/317",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/195",
              "text": "حَرِيزٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/426",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّهُ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:121:4",
        "text": [
          " فِي رُكُوبِ الْبَحْرِ لِلتِّجَارَةِ يُغَرِّرُ الرَّجُلُ بِدِينِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from his father, from Hammad, from Hareyz, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said regarding sailing the sea for the business: ‘The man is deceived in his Religion’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from his father from Hammad from Hariz from Muhammad ibn Muslim who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘In sailing on the sea for trade one is deceived in his religion.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/326)"
        ],
        "index": 9105,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/226",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/749",
              "text": "صَفْوَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1680",
              "text": "مُعَلًّى أَبِي عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1861",
              "text": "مُعَلَّى بْنِ خُنَيْسٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَنْهُ عَنْ أَبِيهِ عَنْ صَفْوَانَ عَنْ مُعَلًّى أَبِي عُثْمَانَ عَنْ مُعَلَّى بْنِ خُنَيْسٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:121:5",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يُسَافِرُ فَيَرْكَبُ الْبَحْرَ فَقَالَ إِنَّ أَبِي كَانَ يَقُولُ إِنَّهُ يُضِرُّ بِدِينِكَ هُوَ ذَا النَّاسُ يُصِيبُونَ أَرْزَاقَهُمْ وَ مَعِيشَتَهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from his father, from Safwan, from moalla Abu Usman, from Moalla Bin Khunays who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man who journeyed, so he sailed the sea. So he<sup>asws</sup> said: ‘My<sup>asws</sup> father<sup>asws</sup> was saying: ‘It is harmful to your body. It is that the people are attaining their sustenance and their livelihood’."
          ],
          "en.sarwar": [
            "5. It is narrated from him from his father from Safwan from Mu’alla’ abu ‘ Uthman from Mu’alla’ ibn al-Khunayth who has said the following: “This is concerning my question before abu ‘ Abd Allah, ‘Alayhi al-Salam, about the case of a man who traveled and sailed on the sea. He (the Imam) said, ‘My father would say that it causes harms to one’s religion. There are people who find their livelihood and sustenance.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/326)"
        ],
        "index": 9106,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:121:6",
        "text": [
          "عَنْهُ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي هَاشِمٍ عَنْ حُسَيْنِ بْنِ أَبِي الْعَلَاءِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ رَجُلًا أَتَى أَبَا جَعْفَرٍ ( عليه السلام ) فَقَالَ إِنَّا نَتَّجِرُ إِلَى هَذِهِ الْجِبَالِ فَنَأْتِي مِنْهَا عَلَى أَمْكِنَةٍ لَا نَقْدِرُ أَنْ نُصَلِّيَ إِلَّا عَلَى الثَّلْجِ فَقَالَ أَلَّا تَكُونُ مِثْلَ فُلَانٍ يَرْضَى بِالدُّونِ وَ لَا يَطْلُبُ تِجَارَةً لَا يَسْتَطِيعُ أَنْ يُصَلِّيَ إِلَّا عَلَى الثَّلْجِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Muhammad Bin Ali, from Abdul Rahman Bin Abu Hashim, from Husayn Bin Abu Al A’ala, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that a man came to Abu Ja’far<sup>asws</sup>, so he said, ‘We do business to these mountains, so we come to places where we are not able to Pray except upon the snow’. So he<sup>asws</sup> said: ‘Can’t you become like so and so who is pleased with the less and he does not seek business where he is not able to Pray except upon the snow?’"
          ],
          "en.sarwar": [
            "6. It is narrated from him from Muhammad ibn Ali from ‘Abd al-Rahman ibn abu Hashim from Husayn ibn abu al-‘Ala’ who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that once a man came to abu Ja‘far, ‘Alayhi al-Salam, and said, ‘We work for business in these mountains and come upon areas where we cannot perform Salat (prayer) except on snow. He (the Imam) said, ‘Why can you not be like so and so who is happy with less and does not demand such things because of which he cannot performing Salat (prayer) except on snow.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:121",
  "kind": "verse_list"
}