{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 125"
        },
        "path": "/books/al-kafi:5:2:125",
        "titles": {
          "ar": "باب آخَرُ ",
          "en": "Chapter 124 – Another Chapter"
        }
      }
    ],
    "index": 1337,
    "local_index": 125,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 126"
        },
        "path": "/books/al-kafi:5:2:126",
        "titles": {
          "ar": "باب مَا يُقَالُ عِنْدَ الزَّرْعِ وَ الْغَرْسِ ",
          "en": "Chapter 125 – What is to be said during the cultivation and the planting"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 124"
        },
        "path": "/books/al-kafi:5:2:124",
        "titles": {
          "ar": "باب فَضْلِ الزِّرَاعَةِ",
          "en": "Chapter 123 – Preference of the agriculture"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:125",
    "titles": {
      "ar": "باب آخَرُ ",
      "en": "Chapter 124 – Another Chapter"
    },
    "verse_count": 2,
    "verse_start_index": 9124,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/335)"
        ],
        "index": 9125,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/345",
              "text": "سَلَمَةَ بْنِ الْخَطَّابِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2044",
              "text": "إِبْرَاهِيمَ بْنِ عُقْبَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4286",
              "text": "صَالِحِ بْنِ عَلِيِّ بْنِ عَطِيَّةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4287",
              "text": "رَجُلٍ ذَكَرَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ عَنْ صَالِحِ بْنِ عَلِيِّ بْنِ عَطِيَّةَ عَنْ رَجُلٍ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:125:1",
        "text": [
          " مَرَّ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) بِنَاسٍ مِنَ الْأَنْصَارِ وَ هُمْ يَحْرُثُونَ فَقَالَ لَهُمُ احْرُثُوا فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ يُنْبِتُ اللَّهُ بِالرِّيحِ كَمَا يُنْبِتُ بِالْمَطَرِ قَالَ فَحَرَثُوا فَجَادَتْ زُرُوعُهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Salma Bin Al Khattab, from Ibrahim Bin Uqba, from Salih Bin Ali Bin Atiyya, from a man who mentioned it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said: ‘Abu Abdullah<sup>asws</sup> passed by a people from the Helpers and they were farming, so he<sup>asws</sup> said to them: ‘Keep farming, for Rasool-Allah<sup>saww</sup> said: ‘Allah<sup>azwj</sup> would Cause it to grow by the wind as He<sup>azwj</sup> Causes it to grow by the rain’. He (the narrator) said, ‘They farmed, and their cultivation was better’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Salmah ibn al-Khattab from Ibrahim ibn ‘Uqbah from Salih ibn Ali ibn ‘Atiyyah from a whom he has mentioned who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, once passed by a people of al-Ansar who were farming and he (the Imam) said to them, ‘Continue farming; the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “Allah causes it to grow by wind as He does so by water.’” They farmed and their farm turned out good.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/335)"
        ],
        "index": 9126,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/31",
              "text": "مُحَمَّدِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/224",
              "text": "ابْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/639",
              "text": "سَدِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ سَدِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:125:2",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ بَنِي إِسْرَائِيلَ أَتَوْا مُوسَى ( عليه السلام ) فَسَأَلُوهُ أَنْ يَسْأَلَ اللَّهَ عَزَّ وَ جَلَّ أَنْ يُمْطِرَ السَّمَاءَ عَلَيْهِمْ إِذَا أَرَادُوا وَ يَحْبِسَهَا إِذَا أَرَادُوا فَسَأَلَ اللَّهَ عَزَّ وَ جَلَّ ذَلِكَ لَهُمْ فَقَالَ اللَّهُ عَزَّ وَ جَلَّ ذَلِكَ لَهُمْ يَا مُوسَى فَأَخْبَرَهُمْ مُوسَى فَحَرَثُوا وَ لَمْ يَتْرُكُوا شَيْئاً إِلَّا زَرَعُوهُ ",
          "ثُمَّ اسْتَنْزَلُوا الْمَطَرَ عَلَى إِرَادَتِهِمْ وَ حَبَسُوهُ عَلَى إِرَادَتِهِمْ فَصَارَتْ زُرُوعُهُمْ كَأَنَّهَا الْجِبَالُ وَ الْآجَامُ ثُمَّ حَصَدُوا وَ دَاسُوا وَ ذَرَّوْا فَلَمْ يَجِدُوا شَيْئاً فَضَجُّوا إِلَى مُوسَى ( عليه السلام ) وَ قَالُوا إِنَّمَا سَأَلْنَاكَ أَنْ تَسْأَلَ اللَّهَ أَنْ يُمْطِرَ السَّمَاءَ عَلَيْنَا إِذَا أَرَدْنَا فَأَجَابَنَا ثُمَّ صَيَّرَهَا عَلَيْنَا ضَرَراً ",
          "فَقَالَ يَا رَبِّ إِنَّ بَنِي إِسْرَائِيلَ ضَجُّوا مِمَّا صَنَعْتَ بِهِمْ فَقَالَ وَ مِمَّ ذَاكَ يَا مُوسَى قَالَ سَأَلُونِي أَنْ أَسْأَلَكَ أَنْ تُمْطِرَ السَّمَاءَ إِذَا أَرَادُوا وَ تَحْبِسَهَا إِذَا أَرَادُوا فَأَجَبْتَهُمْ ثُمَّ صَيَّرْتَهَا عَلَيْهِمْ ضَرَراً فَقَالَ يَا مُوسَى أَنَا كُنْتُ الْمُقَدِّرَ لِبَنِي إِسْرَائِيلَ فَلَمْ يَرْضَوْا بِتَقْدِيرِي فَأَجَبْتُهُمْ إِلَى إِرَادَتِهِمْ فَكَانَ مَا رَأَيْتَ"
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Ibn Muskan, from Sadeyr who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying that: ‘The Children of Israel came over to Musa<sup>as</sup>, so they asked him<sup>as</sup> that he<sup>as</sup> should ask Allah<sup>azwj</sup> Mighty and Majestic to Cause the sky to rain upon them whenever they so wanted it to, and Withhold it whenever they so want it to’. So he<sup>as</sup> asked Allah<sup>azwj</sup> Mighty and Majestic for that to be for them. So Allah<sup>azwj</sup> Mighty and Majestic Said: “That is for them, O Musa<sup>as</sup>!” So Musa<sup>as</sup> informed them, and they did not leave anything except that they cultivated it.",
            "Then the rain would descend upon their intentions and be withheld upon their intentions. Thus, their plantations came to be like the mountains and the forests. Then they harvested and threshed and scattered it, but they did not find anything (grains). So they raised a clamout to Musa<sup>as</sup> and said, ‘But rather we asked you<sup>as</sup> that you<sup>as</sup> should ask Allah<sup>azwj</sup> that He<sup>azwj</sup> Causes the sky to rain upon us whenever we so wanted it to. So He<sup>azwj</sup> Answered us. Then it came to be harmful upon us!’. ",
            "So he<sup>as</sup> said: ‘O Lord<sup>azwj</sup>! The Children of Israel are raising a clamour from what has been done with them’. So He<sup>azwj</sup> Said: “And why is that so, O Musa<sup>as</sup>?” He<sup>as</sup> said: ‘They asked me<sup>as</sup> to ask You<sup>azwj</sup> that the sky should rain whenever they so wanted it to, and withhold whenever they so wanted it to, so You<sup>azwj</sup> Answered them. Then it came to be harmful upon them’. So He<sup>azwj</sup> Said: “O Musa<sup>as</sup>! I<sup>azwj</sup> had Measured out for the Children of Israel, but they were not pleased with My<sup>azwj</sup> Measurement. So I<sup>azwj</sup> Left it to them to their will (as they can only see superficially upon the growth), and it turned out to what you<sup>as</sup> saw”’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from ibn Muskan from Sadir who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ‘The Israelites went to Moses and asked him to ask Allah to make the sky rain on them only when they wanted and stop it from raining when they wanted. Moses asked Allah, most Majestic, most Glorious, and Allah, most Majestic, most Glorious, said, ‘O Moses, they can have it as they wanted.’ Moses informed them about it and they cultivated and farmed all they wanted. They then asked for rain whenever they wanted and stopped it as they wanted. Their farms grew like mountains and thick brushwood. They then harvested, threshed and exposed it to the wind (to separate the grain from the hay) but did not find anything. They expressed their anger to Moses and said, ‘We only asked you to ask Allah to send rain for us when we wanted and He agreed, but then He made it harmful to us.’ Moses then said, ‘O Lord, the Israelites have shown exasperation for what You have done to them.’ Allah asked, ‘What is it that I have done to them, O Moses?’ Moses said, ‘They asked me to ask You to send rain on them only when they wanted and stop it when they wanted. You agreed but then made it harmful to them.’ Allah said, ‘O Moses, I was measuring it for the Israelites but they were not happy with My measurement for them, then I agreed to leave it to their will, then it happened as you have seen.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:125",
  "kind": "verse_list"
}