{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 126"
        },
        "path": "/books/al-kafi:5:2:126",
        "titles": {
          "ar": "باب مَا يُقَالُ عِنْدَ الزَّرْعِ وَ الْغَرْسِ ",
          "en": "Chapter 125 – What is to be said during the cultivation and the planting"
        }
      }
    ],
    "index": 1338,
    "local_index": 126,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 127"
        },
        "path": "/books/al-kafi:5:2:127",
        "titles": {
          "ar": "باب مَا يَجُوزُ أَنْ يُؤَاجَرَ بِهِ الْأَرْضُ وَ مَا لَا يَجُوزُ",
          "en": "Chapter 126 – What is allowed if you rent out the land and what is not allowed"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 125"
        },
        "path": "/books/al-kafi:5:2:125",
        "titles": {
          "ar": "باب آخَرُ ",
          "en": "Chapter 124 – Another Chapter"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:126",
    "titles": {
      "ar": "باب مَا يُقَالُ عِنْدَ الزَّرْعِ وَ الْغَرْسِ ",
      "en": "Chapter 125 – What is to be said during the cultivation and the planting"
    },
    "verse_count": 9,
    "verse_start_index": 9126,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/336)"
        ],
        "index": 9127,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:126:1",
        "relations": {
          "Mentions": [
            "/books/quran:56:64",
            "/books/quran:56:63"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنِ ابْنِ بُكَيْرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا أَرَدْتَ أَنْ تَزْرَعَ زَرْعاً فَخُذْ قَبْضَةً مِنَ الْبَذْرِ وَ اسْتَقْبِلِ الْقِبْلَةَ وَ قُلْ أَ فَرَأَيْتُمْ ما تَحْرُثُونَ أَ أَنْتُمْ تَزْرَعُونَهُ أَمْ نَحْنُ الزَّارِعُونَ ثَلَاثَ مَرَّاتٍ ثُمَّ تَقُولُ بَلِ اللَّهُ الزَّارِعُ ثَلَاثَ مَرَّاتٍ ثُمَّ قُلِ اللَّهُمَّ اجْعَلْهُ حَبّاً مُبَارَكاً وَ ارْزُقْنَا فِيهِ السَّلَامَةَ ثُمَّ انْثُرِ الْقَبْضَةَ الَّتِي فِي يَدِكَ فِي الْقَرَاحِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibn Azina, from Ibn Bukeyr who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Whenever you intend to cultivate a farm, so grab a handful of the seeds and face towards the Qiblah and say <span class=\"ibTxt\"><a href=\"/#/books/quran:56#h63\">[56:63]</a> Have you considered what you cultivate? <a href=\"/#/books/quran:56#h64\">[56:64]</a> Is it you who cause it to grow, or are We the Causers of its growth?</span> – three times. Then you should be saying, ‘But, Allah<sup>azwj</sup> is the Grower’ – three times. Then say, ‘O Allah<sup>azwj</sup>! Make it to be as Blessed seeds and Grace us security therein’. Then scatter the handful (of seeds) which are in your hand in the clear ground’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ibn ‘Udhaynah from ibn Bukayr who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said, ‘When you like to plant something, take a handful of seed, face al-Qiblah (al-Ka’bah) and say, “Have you seen what you cultivate? Do you cultivate it or We are the ones who cultivate.” (56:62-63) Then say, “In fact Allah is the cultivator” three times then say, “O Lord, make it blessed grain and provide us safety in it.” Then spread the handful from your hand on the plain ground.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/336)"
        ],
        "index": 9128,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:126:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ شُعَيْبٍ الْعَقَرْقُوفِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ لِي إِذَا بَذَرْتَ فَقُلِ اللَّهُمَّ قَدْ بَذَرْتُ وَ أَنْتَ الزَّارِعُ فَاجْعَلْهُ حَبّاً مُتَرَاكِماً ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ali Bin Al Hakam, from Shuayb Al Aqarquqy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘He<sup>asws</sup> said to me: ‘Whenever you sow, so say, ‘O Allah<sup>azwj</sup>! I have sowed and You<sup>azwj</sup> are the Cultivator, therefore Make it an increased growth’’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Ali ibn al-Hakam from Shu’ayb al-‘Aqarqufiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘At the time of spreading seed say, “O Lord, I have spread the seed and You are the cultivator; so make it to produce plentiful grains.”’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/336)"
        ],
        "index": 9129,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:126:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ أَحْمَدَ بْنِ عُمَرَ الْجَلَّابِ عَنِ الْحُضَيْنِيِّ عَنِ ابْنِ عَرَفَةَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَنْ أَرَادَ أَنْ يُلْقِحَ النَّخِيلَ إِذَا كَانَتْ لَا يَجُودُ حَمْلُهَا وَ لَا يَتَبَعَّلُ النَّخْلُ فَلْيَأْخُذْ حِيتَاناً صِغَاراً يَابِسَةً فَلْيَدُقَّهَا بَيْنَ الدَّقَّيْنِ ثُمَّ يَذُرُّ فِي كُلِّ طَلْعَةٍ مِنْهَا قَلِيلًا وَ يَصُرُّ الْبَاقِيَ فِي صُرَّةٍ نَظِيفَةٍ ثُمَّ يَجْعَلُ فِي قَلْبِ النَّخْلَةِ يَنْفَعُ بِإِذْنِ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Muhammad Bin Isa, from Ahmad Bin Umar Al Jallab, from Al Huzayni, from Ibn Arafat who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The one who wants to pollinate the palm tree, when it was such that it would not bear (fruit) nor irrigate, so let him take two small dried fish, and let him grind these between the two grinding plates. Then he should sow a little of it in every sprout from it, and he should keep the remainder in a clean bundle, then make it to be in the heart (centre) of the palm tree. He would benefit, Allah<sup>azwj</sup> Willing’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ‘Isa from Ahmad ‘Umar al-Jallab from al- Hudayniy from ibn ‘Arfah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If one wants to pollinate palm trees which are not good in their conception and do not accept pollens, he can take small fish, crush them between the two grinding plates and place a little of it in every sprouting element, keep the remaining in a bag and place in the center of the tree, it will be useful by the permission of ‘Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/337)"
        ],
        "index": 9130,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:126:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ صَالِحِ بْنِ عُقْبَةَ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَدْ رَأَيْتُ حَائِطَكَ فَغَرَسْتَ فِيهِ شَيْئاً بَعْدُ قَالَ قُلْتُ قَدْ أَرَدْتُ أَنْ آخُذَ مِنْ حِيطَانِكَ وَدِيّاً قَالَ أَ فَلَا أُخْبِرُكَ بِمَا هُوَ خَيْرٌ لَكَ مِنْهُ وَ أَسْرَعُ قُلْتُ بَلَى قَالَ إِذَا أَيْنَعَتِ الْبُسْرَةُ وَ هَمَّتْ أَنْ تُرْطِبَ فَاغْرِسْهَا فَإِنَّهَا تُؤَدِّي إِلَيْكَ مِثْلَ الَّذِي غَرَسْتُهَا سَوَاءً فَفَعَلْتُ ذَلِكَ فَنَبَتَتْ مِثْلَهُ سَوَاءً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail, from Salih Bin Uqba who said, ",
            "‘Abu Abdullah<sup>asws</sup> said to me: ‘I<sup>asws</sup> saw your garden, so have you planted anything in it afterwards?’ I said, ‘I intended to take stems from your<sup>asws</sup> garden (and plant these)’. He<sup>asws</sup> said: ‘Shall I<sup>asws</sup> inform you with what is better for you than it and quicker?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘‘When dates ripen and you are about to pick them as fresh dates, plant them, it (the crop) will produce just like what you planted. So I did that and it grew as the same like it’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn ‘Isma’il from Salih ibn ‘Uqbah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, once said to me, ‘I saw your garden, have you planted anything in it yet?’ I said, ‘I wanted to take small stems from your garden and plant them.’ He (the Imam) said, ‘Allow me to tell you what is better than this and quicker.’ I replied, ‘Yes please do so.’ He (the Imam) said, ‘When dates ripen and you are about to pick them as fresh dates, plant them, it (the crop) will produce just like what you planted.’ I followed the instruction and it (the crop) grew exactly like it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/337)"
        ],
        "index": 9131,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:126:5",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ رَفَعَهُ قَالَ قَالَ ( عليه السلام ) إِذَا غَرَسْتَ غَرْساً أَوْ نَبْتاً فَاقْرَأْ عَلَى كُلِّ عُودٍ أَوْ حَبَّةٍ سُبْحَانَ الْبَاعِثِ الْوَارِثِ فَإِنَّهُ لَا يَكَادُ يُخْطِئُ إِنْ شَاءَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, raising it, said, ",
            "‘He<sup>asws</sup> said: ‘Whenever you plant a tree or vegetation, so recite upon every twig or seed, ‘Glorious is the Resurrector, the Inheritor’, so it would almost never be wrong, Allah<sup>azwj</sup> Willing’."
          ],
          "en.sarwar": [
            "5. Ali ibn Muhammad has narrated from in a marfu’ manner the following: “He (the Imam), ‘Alayhi al-Salam, has said, ‘When you plant a tree or plantation, say with every twig or deed, “Free of all defect is One who raises and inherits”, it then cannot fail, by the will of Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/337)"
        ],
        "index": 9132,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:126:6",
        "relations": {
          "Mentions": [
            "/books/quran:14:25",
            "/books/quran:14:24"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى رَفَعَهُ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ تَقُولُ إِذَا غَرَسْتَ أَوْ زَرَعْتَ وَ مَثَلُ كَلِمَةً طَيِّبَةً كَشَجَرَةٍ طَيِّبَةٍ أَصْلُها ثابِتٌ وَ فَرْعُها فِي السَّماءِ تُؤْتِي أُكُلَها كُلَّ حِينٍ بِإِذْنِ رَبِّها ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, raising it, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) having said: ‘You should be saying, whenever you plant or sow, <span class=\"ibTxt\"><a href=\"/#/books/quran:14#h24\">[14:24]</a> Have you not considered how Allah Sets forth a parable of a good word (being) like a good tree, whose root is firm and whose branches are in the sky <a href=\"/#/books/quran:14#h25\">[14:25]</a> Yielding its fruit in every season by the permission of its Lord?</span>’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from in a marfu’ manner the following: “One of the two Imam, (abu Ja’far or abu ‘Abd Allah), ‘Alayhim al-Salam, has said, ‘When you plant or cultivate read, “The likeness of the blessed word is like that of a blessed tree with firmly established roots and branches that rise into the sky. It produces fruits all the time, by the will of its Lord.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/338)"
        ],
        "index": 9133,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:126:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنْ قَطْعِ السِّدْرِ فَقَالَ سَأَلَنِي رَجُلٌ مِنْ أَصْحَابِكَ عَنْهُ فَكَتَبْتُ إِلَيْهِ قَدْ قَطَعَ أَبُو الْحَسَنِ ع سِدْراً وَ غَرَسَ مَكَانَهُ عِنَباً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ahmad Bin Muhammad Bin Abu Nasr who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about cutting the lote (lotus) tree, so he<sup>asws</sup> said: ‘A man from your companions did ask me<sup>asws</sup> about it, so I<sup>asws</sup> wrote to him: ‘Abu Al-Hassan<sup>asws</sup> had cut a lote tree and planted a grape-vines in its place’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ahmad ibn Muhammad from ibn abu Nasr who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about cutting down a lotus tree. He (the Imam) said, ‘One of your people asked me about it and I wrote to him that abu al-Hassan, ‘Alayhi al-Salam, once cut down a lotus tree and planted in its place grape-vines.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/338)"
        ],
        "index": 9134,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:126:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ أَحْمَدَ بْنِ الْحَسَنِ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ مُصَدِّقِ بْنِ صَدَقَةَ عَنْ عَمَّارِ بْنِ مُوسَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ مَكْرُوهٌ قَطْعُ النَّخْلِ ",
          "وَ سُئِلَ عَنْ قَطْعِ الشَّجَرَةِ قَالَ لَا بَأْسَ قُلْتُ فَالسِّدْرِ قَالَ لَا بَأْسَ بِهِ إِنَّمَا يُكْرَهُ قَطْعُ السِّدْرِ بِالْبَادِيَةِ لِأَنَّهُ بِهَا قَلِيلٌ وَ أَمَّا هَاهُنَا فَلَا يُكْرَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Ahmad Bin Al Hassan, from Amro Bin Saeed, from Musaddaq Bin Sadaqa, from Ammar Bin Musa, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It is abhorrent, cutting the palm tree’. ",
            "And he<sup>asws</sup> was asked about cutting the tree. He<sup>asws</sup> said: ‘There is no problem’. I said, ‘So (what about) the lote tree?’ He<sup>asws</sup> said: ‘There is no problem with it. But rather it is disliked to cut the lote tree in the wilderness because these are scarce with it, and as for over here, so it is not disliked’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Muhammad ibn Ahmad from Ahmad ibn al-Hassan from ‘Amr ibn Sa‘id from Musaddiq ibn Sadaqah from ‘Ammar ibn Musa who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that cutting down of palm trees is detestable. He (the Imam) was asked about cutting down of trees. He (the Imam) replied, ‘It is not unlawful.’ I then asked about cutting down of lotus trees. He (the Imam) said, ‘It is not unlawful. It is detestable to cut them down in the wilderness because it is very rare there, however, here it is plentiful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/338)"
        ],
        "index": 9135,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:126:9",
        "text": [
          "عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ الْحُسَيْنِ بْنِ بَشِيرٍ عَنِ ابْنِ مُضَارِبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا تَقْطَعُوا الثِّمَارَ فَيَبْعَثَ اللَّهُ عَلَيْكُمُ الْعَذَابَ صَبّاً."
        ],
        "translations": {
          "en.hubeali": [
            "From Ibn Abu Umeyr, from Al Husayn Bin Basheer, from Ibn Muzarib, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Do not cut down the fruit-bearing trees, for Allah<sup>azwj</sup> would Send upon you a difficult Punishment’."
          ],
          "en.sarwar": [
            "9. It is narrated from ibn abu ‘Umayr from Al-Husayn ibn Bashir from ibn Mudarib who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘You must not cut down a fruit bearing tree; Allah will send on you a great suffering.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:126",
  "kind": "verse_list"
}