{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 135"
        },
        "path": "/books/al-kafi:5:2:135",
        "titles": {
          "ar": "باب بَيْعِ الْمَرَاعِي",
          "en": "Chapter 134 – Selling the pastures"
        }
      }
    ],
    "index": 1347,
    "local_index": 135,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 136"
        },
        "path": "/books/al-kafi:5:2:136",
        "titles": {
          "ar": "باب بَيْعِ الْمَاءِ وَ مَنْعِ فُضُولِ الْمَاءِ مِنَ الْأَوْدِيَةِ وَ السُّيُولِ",
          "en": "Chapter 135 – Selling the water and prevention of wasting the water from the valleys and the streams"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 134"
        },
        "path": "/books/al-kafi:5:2:134",
        "titles": {
          "ar": "باب بَيْعِ الزَّرْعِ الْأَخْضَرِ وَ الْقَصِيلِ وَ أَشْبَاهِهِ",
          "en": "Chapter 133 – Selling the green plants, and the straw, and such like"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:135",
    "titles": {
      "ar": "باب بَيْعِ الْمَرَاعِي",
      "en": "Chapter 134 – Selling the pastures"
    },
    "verse_count": 5,
    "verse_start_index": 9185,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/363)"
        ],
        "index": 9186,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/330",
              "text": "إِسْمَاعِيلَ بْنِ مَرَّارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/152",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/50",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:135:1",
        "text": [
          " سَأَلْتُهُ عَنِ الرَّجُلِ الْمُسْلِمِ تَكُونُ لَهُ الضَّيْعَةُ فِيهَا جَبَلٌ مِمَّا يُبَاعُ يَأْتِيهِ أَخُوهُ الْمُسْلِمُ وَ لَهُ غَنَمٌ قَدِ احْتَاجَ إِلَى جَبَلٍ يَحِلُّ لَهُ أَنْ يَبِيعَهُ الْجَبَلَ كَمَا يَبِيعُ مِنْ غَيْرِهِ أَوْ يَمْنَعَهُ مِنَ الْجَبَلِ إِنْ طَلَبَهُ بِغَيْرِ ثَمَنٍ وَ كَيْفَ حَالُهُ فِيهِ وَ مَا يَأْخُذُهُ قَالَ لَا يَجُوزُ لَهُ بَيْعُ جَبَلِهِ مِنْ أَخِيهِ لِأَنَّ الْجَبَلَ لَيْسَ جَبَلَهُ إِنَّمَا يَجُوزُ لَهُ الْبَيْعُ مِنْ غَيْرِ الْمُسْلِمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus, from one of our companions, ",
            "from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the Muslim man who happened to have the place for him wherein is a mountain from what he sells (his pasture). His Muslim brother comes over to him and for him are sheep, being needy to a mountain. Is it Permissible for him that he sells him the mountain (pasture) just as he had sold it to others, or should he prevent him from the mountain if he seeks it without a price? And how would be his state in it, and what can he take?’ He<sup>asws</sup> said: ‘It is not allowed for him that he sells his mountain (for pasture) to his brother, because the mountain is not his mountain. But rather, it is allowed for him the selling to a non-Muslim’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ‘Isma’il ibn Marrar from Yunus from certain persons of our people who has said the following: “Regarding my question before abu ‘ Abd Allah, ‘Alayhi al-Salam, about the case of a man who is Muslim and has an asset in the mountains which is sold and his Muslim brother comes who has sheep and needs a mountain, if it is lawful to sell the mountain as he sells to others or deny him use of the mountain if he asks without payment and how is his condition and what he takes. He (the Imam) said, ‘It is not lawful for him to sell his mountain to his brother because the mountain is not his mountain, he can only sell it to non-Muslims.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/364)"
        ],
        "index": 9187,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4316",
              "text": "سَهْلِ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/251",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3476",
              "text": "إِدْرِيسَ بْنِ زَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/373",
              "text": "أَبِي الْحَسَنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ سَهْلِ بْنُ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ إِدْرِيسَ بْنِ زَيْدٍ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:135:2",
        "text": [
          " سَأَلْتُهُ وَ قُلْتُ جُعِلْتُ فِدَاكَ إِنَّ لَنَا ضِيَاعاً وَ لَهَا حُدُودٌ وَ فِيهَا مَرَاعِي وَ لِلرَّجُلِ مِنَّا غَنَمٌ وَ إِبِلٌ وَ يَحْتَاجُ إِلَى تِلْكَ الْمَرَاعِي لِإِبِلِهِ وَ غَنَمِهِ أَ يَحِلُّ لَهُ أَنْ يَحْمِيَ الْمَرَاعِيَ لِحَاجَتِهِ إِلَيْهَا فَقَالَ إِذَا كَانَتِ الْأَرْضُ أَرْضَهُ فَلَهُ أَنْ يَحْمِيَ وَ يُصَيِّرَ ذَلِكَ إِلَى مَا يَحْتَاجُ إِلَيْهِ ",
          "قَالَ وَ قُلْتُ لَهُ الرَّجُلُ يَبِيعُ الْمَرَاعِيَ فَقَالَ إِذَا كَانَتِ الْأَرْضُ أَرْضَهُ فَلَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, and Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Idrees Bin Zayd, ",
            "from Abu Al Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! There is a place for us and for it are boundaries, and therein is a pasture field, and for the man from us there as sheep, and camels, and he is needy to that pasture for his camels and his sheep. Is it Permissible for him that he reserves the pasture for his needs to it?’ So he<sup>asws</sup> said: ‘If the land was his land, so it would be for him to reserve and that would come to be for what he needs it for’. ",
            "He (the narrator) said, ‘And I said to him<sup>asws</sup>, ‘The man sells the pasture?’ So he<sup>asws</sup> said: ‘If the land was his land, so there is no problem’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad from and Sahl ibn Ziyad from Ahmad ibn Muhammad from ibn abu Nasr from Idris ibn Zayd who has said the following: “Regarding my question before abu al-Hassan, ‘Alayhi al-Salam, - after saying, ‘I pray to Allah to keep my soul in service for your cause, we have a property that has boundaries and a pasture - about a man from us who has sheep and camel. He needs those pastures for his camel and sheep if it is permissible for him to preserve and protect the pastures for his needs.’ He (the Imam) said, ‘If the land is his land he has the right to reserve and keep it for his needs.’ I then asked, ‘Can the man sell the pastures?’ He (the Imam) said, ‘If the land is his land, it is not unlawful to do so.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/364)"
        ],
        "index": 9188,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/3621",
              "text": "أَحْمَدُ بْنُ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/106",
              "text": "مُحَمَّدِ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:135:3",
        "text": [
          " سَأَلْتُ الرِّضَا ( عليه السلام ) عَنِ الرَّجُلِ تَكُونُ لَهُ الضَّيْعَةُ وَ تَكُونُ لَهَا حُدُودٌ تَبْلُغُ حُدُودُهَا عِشْرِينَ مِيلًا وَ أَقَلَّ وَ أَكْثَرَ يَأْتِيهِ الرَّجُلُ فَيَقُولُ لَهُ أَعْطِنِي مِنْ مَرَاعِي ضَيْعَتِكَ وَ أُعْطِيَكَ كَذَا وَ كَذَا دِرْهَماً فَقَالَ إِذَا كَانَتِ الضَّيْعَةُ لَهُ فَلَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad Bin Abu Nasr, from Muhammad Bin Abdullah who said, ",
            "‘I asked Al Reza<sup>asws</sup> about the man who happened to have the place for him, and it happened to have some boundaries for it of twenty miles, and less and more. The man comes to him, so he is saying to him, ‘Give me from the pasture of your place, and I shall give you such and such amount of Dirhams’. So he<sup>asws</sup> said: ‘If it was that the place was his, so there is no problem’."
          ],
          "en.sarwar": [
            "3. Ahmad ibn Muhammad from ibn abu Nasr has narrated from Muhammad ibn ‘Abd Allah who has said the following: “This is concerning my question before al-Rida’, ‘Alayhi al-Salam, about the case of a man who has a property which has boundaries that extend for about twenty miles or less or more and a man comes and says, ‘If you give to me from your pastures I will give you so and so amount of dirham. He (the Imam) said, ‘If the property is his property it is not unlawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/364)"
        ],
        "index": 9189,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1565",
              "text": "حُمَيْدُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1566",
              "text": "الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/218",
              "text": "جَعْفَرِ بْنِ سَمَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/220",
              "text": "أَبَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1736",
              "text": "إِسْمَاعِيلَ بْنِ الْفَضْلِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ جَعْفَرِ بْنِ سَمَاعَةَ عَنْ أَبَانٍ عَنْ إِسْمَاعِيلَ بْنِ الْفَضْلِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:135:4",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ بَيْعِ الْكَلَإِ إِذَا كَانَ سَيْحاً فَيَعْمِدُ الرَّجُلُ إِلَى مَائِهِ فَيَسُوقُهُ إِلَى الْأَرْضِ فَيَسْقِيهِ الْحَشِيشَ وَ هُوَ الَّذِي حَفَرَ النَّهَرَ وَ لَهُ الْمَاءُ يَزْرَعُ بِهِ مَا شَاءَ فَقَالَ إِذَا كَانَ الْمَاءُ لَهُ فَلْيَزْرَعْ بِهِ مَا شَاءَ وَ يَبِيعُهُ بِمَا أَحَبَّ ",
          "قَالَ وَ سَأَلْتُهُ عَنْ بَيْعِ حَصَائِدِ الْحِنْطَةِ وَ الشَّعِيرِ وَ سَائِرِ الْحَصَائِدِ فَقَالَ حَلَالٌ فَلْيَبِعْهُ إِنْ شَاءَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from Ja’far Bin Sama’at, from Aban, from Ismail Bin Al Fazl who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about selling the pasture when it was dry. So the man endeavoured to water it, so he irrigated the land, and irrigated the grass, and he is the who dug out the river, and for him is the water to pasture with whatever he so desires to. So he<sup>asws</sup> said: ‘When the water was for him, so let him pasture with it whatever he so desires to, and sell it for whatever he so desires to’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about selling the wheat and the barley, and the rest of the harvest. So he<sup>asws</sup> said: ‘Permissible, so let him sell it if he so desires to’."
          ],
          "en.sarwar": [
            "4. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad ibn Sama‘ah from Ja’far ibn Sama‘ah from Aban from ‘Isma’il ibn al-Fadl who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about a man’s selling pastures which needs watering. He works to provide water for its grass and he is the one who has dug the well and canal and he has water for the plantation of whatever he likes to cultivate. He (the Imam) said, ‘If water belongs to him he can cultivate whatever he likes and sell to whoever he likes.’ I then asked him (the Imam) about selling the remaining portions of wheat or barley stems after harvest. He (the Imam) said, ‘It is lawful, thus, he can sell if he wants.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/365)"
        ],
        "index": 9190,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/54",
              "text": "عُبَيْدِ اللَّهِ الدِّهْقَانِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4317",
              "text": "مُوسَى بْنِ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/373",
              "text": "أَبِي الْحَسَنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عُبَيْدِ اللَّهِ الدِّهْقَانِ عَنْ مُوسَى بْنِ إِبْرَاهِيمَ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:135:5",
        "text": [
          " سَأَلْتُهُ عَنْ بَيْعِ الْكَلَإِ وَ الْمَرَاعِي فَقَالَ لَا بَأْسَ بِهِ قَدْ حَمَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) النَّقِيعَ لِخَيْلِ الْمُسْلِمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ubeydullah Al Dahqan, from Musa Bin Ibrahim, ",
            "from Abu Al Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about selling the pasture, and the meadow, so he<sup>asws</sup> said: ‘There is no problem with it. Rasool-Allah<sup>saww</sup> had reserved Al Naqie (name of a place) for the Muslim cavalry horses’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Sahl ibn Ziyad from ‘Ubayd Allah al-Dihqan from Musa ibn Ibrahim who has said the following: “This is concerning my question before abu al-Hassan, ‘Alayhi al-Salam, about selling grass and pastures. He (the Imam) said, ‘It is not unlawful, the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, had reserved al-Naqi‘ (name of a place) for the horses of the Muslims.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:135",
  "kind": "verse_list"
}