{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:5:2:14",
        "titles": {
          "ar": "باب الْكَسْبِ الْحَلَالِ ",
          "en": "Chapter 14 – Earning the Permissible"
        }
      }
    ],
    "index": 1226,
    "local_index": 14,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 15"
        },
        "path": "/books/al-kafi:5:2:15",
        "titles": {
          "ar": "باب إِحْرَازِ الْقُوتِ ",
          "en": "Chapter 15 – Saving the foodstuff"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:5:2:13",
        "titles": {
          "ar": "باب مَنْ كَدَّ عَلَى عِيَالِهِ ",
          "en": "Chapter 13 – One who toils for his family"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:14",
    "titles": {
      "ar": "باب الْكَسْبِ الْحَلَالِ ",
      "en": "Chapter 14 – Earning the Permissible"
    },
    "verse_count": 2,
    "verse_start_index": 8384,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/38)"
        ],
        "index": 8385,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:14:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) جُعِلْتُ فِدَاكَ أَدْعُو اللَّهَ عَزَّ وَ جَلَّ أَنْ يَرْزُقَنِي الْحَلَالَ فَقَالَ أَ تَدْرِي مَا الْحَلَالُ فَقُلْتُ جُعِلْتُ فِدَاكَ أَمَّا الَّذِي عِنْدَنَا فَالْكَسْبُ الطَّيِّبُ فَقَالَ كَانَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) يَقُولُ الْحَلَالُ قُوتُ الْمُصْطَفَيْنَ وَ لَكِنْ قُلْ أَسْأَلُكَ مِنْ رِزْقِكَ الْوَاسِعِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ahmad Bin Muhammad Bin Abu Nasr who said, ",
            "‘I said to Abu Al-Hassan<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Supplicato to Allah<sup>azwj</sup> Mighty and Majestic that He<sup>azwj</sup> should Grace me the Permissible sustenance’. So he<sup>asws</sup> said: ‘Do you know what is the Permissible (sustenance)?’ So I said, ‘May I be sacrificed for you<sup>asws</sup>! As for which is with of the goodly earnings’. So he<sup>asws</sup> said: ‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> was saying: ‘The Permissible livelihood is the food of the ‘Chosen Ones’ (only the Prophets<sup>as</sup> and the Imams<sup>as</sup>), but say, ‘I ask You<sup>azwj</sup> from the extensive sustenance’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from Ahmad ibn abu Nasr who has said the following: “Once I asked abu al-Hassan, ‘Alayhi al-Salam, saying, ‘I pray to Allah to keep my soul in service for your cause, please pray for me to Allah, most Majestic, most Glorious, so He grants me lawful sustenance.’ He (the Imam) asked, ‘Do you know what lawful sustenance is?’ I replied, ‘I pray to Allah to keep my soul in service for your cause, according to our information it is clean earning.’ He (the Imam) said, ‘Ali ibn Al-Husayn, ‘Alayhi al-Salam, would say, ‘Lawful sustenance is the sustenance of the chosen ones.’ You, however, should say, ‘I pray to You to grant me wide-ranging sustenance.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/38)"
        ],
        "index": 8386,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:14:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُعَمَّرِ بْنِ خَلَّادٍ وَ عَلِيُّ بْنُ مُحَمَّدِ بْنِ بُنْدَارَ عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ عِيسَى جَمِيعاً عَنْ مُعَمَّرِ بْنِ خَلَّادٍ عَنْ أَبِي الْحَسَنِ الثَّانِي ( عليه السلام ) قَالَ نَظَرَ أَبُو جَعْفَرٍ ( عليه السلام ) إِلَى رَجُلٍ وَ هُوَ يَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ رِزْقِكَ الْحَلَالِ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) سَأَلْتَ قُوتَ النَّبِيِّينَ قُلِ اللَّهُمَّ إِنِّي أَسْأَلُكَ رِزْقاً وَاسِعاً طَيِّباً مِنْ رِزْقِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Moammar Bin Khallad and Ali Bin Muhammad Bin Bundar, from Ahmad Bin Abu Abdullah, from Muhammad Bin Isa, altogether from Moammar Bin Khallad, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> the 2<sup>nd</sup> having said: ‘Abu Ja’far<sup>asws</sup> looked at a man and he was saying, ‘O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> of the Permissible sustenance’. So Abu Ja’far<sup>asws</sup> said: ‘You ask for the food of the Prophets<sup>as</sup>. Say, ‘O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> for extensive goodly sustenance from Your<sup>azwj</sup> sustenances’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Mu’ammar ibn Khallad and Ali ibn Muhammad ibn Bandar from Ahmad ibn abu ‘Abd Allah from Muhammad ibn ‘Isa all from Mu’ammar ibn Khallad from abu al-Hassan, al-Thani, who has said the following: “Once abu Ja‘far, ‘Alayhi al-Salam, looked at a man who said, ‘O Lord, I pray to You to grant me lawful sustenance.’ Abu Ja‘far, ‘Alayhi al-Salam, said, ‘You have asked of the kind of sustenance of the prophets. Say, “O Lord, grant me of Your extended and clean sustenance.’”” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:14",
  "kind": "verse_list"
}