{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:5:2", "titles": {"ar": "كتاب الْمَعِيشَةِ", "en": "THE BOOK OF SUBSISTENCE"}}, {"indexed_titles": {"en": "Chapter 142"}, "path": "/books/al-kafi:5:2:142", "titles": {"ar": "باب الِاسْتِحْطَاطِ بَعْدَ الصَّفْقَةِ", "en": "Chapter 142 – The bargaining after the deal"}}], "index": 1353, "local_index": 142, "part_type": "Chapter", "path": "/books/al-kafi:5:2:142", "titles": {"ar": "باب الِاسْتِحْطَاطِ بَعْدَ الصَّفْقَةِ", "en": "Chapter 142 – The bargaining after the deal"}, "verse_count": 2, "verse_start_index": 9229, "verses": [{"index": 9230, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:2:142:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ الْكَرْخِيِّ قَالَ اشْتَرَيْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جَارِيَةً فَلَمَّا ذَهَبْتُ أَنْقُدُهُمُ الدَّرَاهِمَ قُلْتُ أَسْتَحِطُّهُمْ قَالَ لَا إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) نَهَى عَنِ الِاسْتِحْطَاطِ بَعْدَ الصَّفْقَةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibrahim Al Karkhy who said, \n‘I bought a slave girl for Abu Abdullah<sup>asws</sup>. So when I went to fetch the Dirhams, I said, ‘Can I ask for a reduction?’ He<sup>asws</sup> said: ‘No. Rasool-Allah<sup>ajwj</sup> forbade from the reduction after the (conclusion of) the deal’."}]}, {"index": 9231, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:2:142:2", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ زَيْدٍ الشَّحَّامِ قَالَ أَتَيْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) بِجَارِيَةٍ أَعْرِضُهَا فَجَعَلَ يُسَاوِمُنِي وَ أُسَاوِمُهُ ثُمَّ بِعْتُهَا إِيَّاهُ فَضَمَّ عَلَى يَدِي قُلْتُ جُعِلْتُ فِدَاكَ إِنَّمَا سَاوَمْتُكَ لِأَنْظُرَ الْمُسَاوَمَةُ تَنْبَغِي أَوْ لَا تَنْبَغِي وَ قُلْتُ قَدْ حَطَطْتُ عَنْكَ عَشَرَةَ دَنَانِيرَ \nفَقَالَ هَيْهَاتَ أَلَّا كَانَ هَذَا قَبْلَ الضَّمَّةِ أَ مَا بَلَغَكَ قَوْلُ النَّبِيِّ ( صلى الله عليه وآله ) الْوَضِيعَةُ بَعْدَ الضَّمَّةِ حَرَامٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from one of our companions, from Muawiya Bin Ammar, from Zayd Al Shahaam who said, \n‘A number of our companions, from Ahmad Bin Muhammad, from one of our companions, from Muawiya Bin Ammar, from Zayd Al Shahaam who said, ‘I went over to Abu Abdullah<sup>asws</sup> with a slave girl. I presented her, so he<sup>asws</sup> went on to bargain with me and I bargained with him<sup>asws</sup>. Then I sold her to him<sup>asws</sup>. So he<sup>asws</sup> joined his<sup>asws</sup> hand upon mine (as a gesture of conclusion of the deal). I said, ‘May I be sacrificed for you<sup>asws</sup>! But rather, I bargained with you<sup>asws</sup> in order to see whether the bargaining befits me or does not befit me’. And I said, ‘I have dropped (the price) from you<sup>asws</sup> by ten Dinars’. \nSo he<sup>asws</sup> said: ‘Far be it! Indeed, this is before the clasping of the arms. Have the words of Rasool-Allah<sup>saww</sup> not reached you: ‘The reduction after the clasping of the arms (conclusion of the deal) is Prohibited?’"}]}]}, "index": "al-kafi:5:2:142", "kind": "verse_list"}