{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 143"
        },
        "path": "/books/al-kafi:5:2:143",
        "titles": {
          "ar": "باب الِاسْتِحْطَاطِ بَعْدَ الصَّفْقَةِ",
          "en": "Chapter 142 – The bargaining after the deal"
        }
      }
    ],
    "index": 1355,
    "local_index": 143,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 144"
        },
        "path": "/books/al-kafi:5:2:144",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب حَزْرِ الزَّرْعِ</span> ",
          "en": "Chapter 143 – Estimating the produce"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 142"
        },
        "path": "/books/al-kafi:5:2:142",
        "titles": {
          "ar": "باب مُشَارَكَةِ الذِّمِّيِّ ",
          "en": "Chapter 141 – Partnership with the Zimmy (non-Muslim taxpayer)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:143",
    "titles": {
      "ar": "باب الِاسْتِحْطَاطِ بَعْدَ الصَّفْقَةِ",
      "en": "Chapter 142 – The bargaining after the deal"
    },
    "verse_count": 2,
    "verse_start_index": 9230,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/383)"
        ],
        "index": 9231,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:143:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ الْكَرْخِيِّ قَالَ اشْتَرَيْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جَارِيَةً فَلَمَّا ذَهَبْتُ أَنْقُدُهُمُ الدَّرَاهِمَ قُلْتُ أَسْتَحِطُّهُمْ قَالَ لَا إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) نَهَى عَنِ الِاسْتِحْطَاطِ بَعْدَ الصَّفْقَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibrahim Al Karkhy who said, ",
            "‘I bought a slave girl for Abu Abdullah<sup>asws</sup>. So when I went to fetch the Dirhams, I said, ‘Can I ask for a reduction?’ He<sup>asws</sup> said: ‘No. Rasool-Allah<sup>ajwj</sup> forbade from the reduction after the (conclusion of) the deal’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Ibrahim al-Kharkhiy who has said the following: “I once bought a slave-girl for abu ‘ Abd Allah, ‘Alayhi al-Salam, and went to get dirhams and I asked him (the Imam), ‘Can I ask to reduce the price ? 5 He (the Imam) said, ‘No, because the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, prohibited asking for reduction after the deal is finalized.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/383)"
        ],
        "index": 9232,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:143:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ زَيْدٍ الشَّحَّامِ قَالَ أَتَيْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) بِجَارِيَةٍ أَعْرِضُهَا فَجَعَلَ يُسَاوِمُنِي وَ أُسَاوِمُهُ ثُمَّ بِعْتُهَا إِيَّاهُ فَضَمَّ عَلَى يَدِي قُلْتُ جُعِلْتُ فِدَاكَ إِنَّمَا سَاوَمْتُكَ لِأَنْظُرَ الْمُسَاوَمَةُ تَنْبَغِي أَوْ لَا تَنْبَغِي وَ قُلْتُ قَدْ حَطَطْتُ عَنْكَ عَشَرَةَ دَنَانِيرَ ",
          "فَقَالَ هَيْهَاتَ أَلَّا كَانَ هَذَا قَبْلَ الضَّمَّةِ أَ مَا بَلَغَكَ قَوْلُ النَّبِيِّ ( صلى الله عليه وآله ) الْوَضِيعَةُ بَعْدَ الضَّمَّةِ حَرَامٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from one of our companions, from Muawiya Bin Ammar, from Zayd Al Shahaam who said, ",
            "‘A number of our companions, from Ahmad Bin Muhammad, from one of our companions, from Muawiya Bin Ammar, from Zayd Al Shahaam who said, ‘I went over to Abu Abdullah<sup>asws</sup> with a slave girl. I presented her, so he<sup>asws</sup> went on to bargain with me and I bargained with him<sup>asws</sup>. Then I sold her to him<sup>asws</sup>. So he<sup>asws</sup> joined his<sup>asws</sup> hand upon mine (as a gesture of conclusion of the deal). I said, ‘May I be sacrificed for you<sup>asws</sup>! But rather, I bargained with you<sup>asws</sup> in order to see whether the bargaining befits me or does not befit me’. And I said, ‘I have dropped (the price) from you<sup>asws</sup> by ten Dinars’. ",
            "So he<sup>asws</sup> said: ‘Far be it! Indeed, this is before the clasping of the arms. Have the words of Rasool-Allah<sup>saww</sup> not reached you: ‘The reduction after the clasping of the arms (conclusion of the deal) is Prohibited?’"
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad from certain persons of our people from Mu‘awiyah ibn ‘Ammar from Zayd al-Shahham who has said the following: “I once took a slave-girl to abu ‘Abd Allah, Alayhi al-Salam. He (the Imam) bargained and I also bargained very hard. I then sold her to him (the Imam) and he (the Imam) shook my hand and I said, ‘I pray to Allah to keep my soul in service for your cause, I bargained hard to see if it was permissible or not and I said, “I reduce the price by ten dinar.’” He (the Imam) said, ‘Never, however, this could have happened before shaking hands. Have you not heard the words of the Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, “Asking for reduction after handshake is unlawful”?”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:143",
  "kind": "verse_list"
}