{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 145"
        },
        "path": "/books/al-kafi:5:2:145",
        "titles": {
          "ar": "باب إِجَارَةِ الْأَجِيرِ وَ مَا يَجِبُ عَلَيْهِ ",
          "en": "Chapter 144 – Wages of the employee and what is obligated upon it"
        }
      }
    ],
    "index": 1357,
    "local_index": 145,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 146"
        },
        "path": "/books/al-kafi:5:2:146",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب كَرَاهَةِ اسْتِعْمَالِ</span> الْأَجِيرِ قَبْلَ مُقَاطَعَتِهِ عَلَى أُجْرَتِهِ وَ تَأْخِيرِ إِعْطَائِهِ بَعْدَ الْعَمَلِ",
          "en": "Chapter 145 – Abhorrence of utilising the employee before agreeing his wages and delay giving it to him after the work"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 144"
        },
        "path": "/books/al-kafi:5:2:144",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب حَزْرِ الزَّرْعِ</span> ",
          "en": "Chapter 143 – Estimating the produce"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:145",
    "titles": {
      "ar": "باب إِجَارَةِ الْأَجِيرِ وَ مَا يَجِبُ عَلَيْهِ ",
      "en": "Chapter 144 – Wages of the employee and what is obligated upon it"
    },
    "verse_count": 3,
    "verse_start_index": 9233,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/384)"
        ],
        "index": 9234,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:145:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َبُو عَلِيٍّ الْأَشْعَرِيُّ</span> عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ سَأَلْتُ أَبَا إِبْرَاهِيمَ ( عليه السلام ) عَنِ الرَّجُلِ يَسْتَأْجِرُ الرَّجُلَ بِأُجْرَةٍ مَعْلُومَةٍ فَيَبْعَثُهُ فِي ضَيْعَةٍ فَيُعْطِيهِ رَجُلٌ آخَرُ دَرَاهِمَ وَ يَقُولُ اشْتَرِ بِهَذَا كَذَا وَ كَذَا وَ مَا رَبِحْتَ بَيْنِي وَ بَيْنَكَ فَقَالَ إِذَا أَذِنَ لَهُ الَّذِي اسْتَأْجَرَهُ فَلَيْسَ بِهِ بَأْسٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from safwan, from Is’hhaq Bin Ammar who said, ",
            "‘I asked Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) about the man who employs the man with a known wage, so he sends him in a place. Then he (employee) gives Dirhams to another man and is saying, ‘Buy such and such, and whatever profit there is would be between me and you’. So he<sup>asws</sup> said: ‘When the one who employed him allows it for him, so there is no problem’."
          ],
          "en.sarwar": [
            "1. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan from Ishaq ibn ‘Ammar who has said the following: “This is concerning my question before abu Ibrahim, ‘Alayhi al-Salam, about the case of a man who hires a man for a certain amount of wages and sends him to work; but he gives dirhams to another man and asks him, ‘Buy such and such things; we will share the profit.’ He (the Imam) said, ‘If the one who has hired gives permission, it is not unlawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/385)"
        ],
        "index": 9235,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:145:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْعَبَّاسِ بْنِ مُوسَى عَنْ يُونُسَ عَنْ سُلَيْمَانَ بْنِ سَالِمٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنْ رَجُلٍ اسْتَأْجَرَ رَجُلًا بِنَفَقَةٍ وَ دَرَاهِمَ مُسَمَّاةٍ عَلَى أَنْ يَبْعَثَهُ إِلَى أَرْضٍ فَلَمَّا أَنْ قَدِمَ أَقْبَلَ رَجُلٌ مِنْ أَصْحَابِهِ يَدْعُوهُ إِلَى مَنْزِلِهِ الشَّهْرَ وَ الشَّهْرَيْنِ فَيُصِيبُ عِنْدَهُ مَا يُغْنِيهِ عَنْ نَفَقَةِ الْمُسْتَأْجِرِ فَنَظَرَ الْأَجِيرُ إِلَى مَا كَانَ يُنْفِقُ عَلَيْهِ فِي الشَّهْرِ إِذَا هُوَ لَمْ يَدْعُهُ فَكَافَأَهُ الَّذِي يَدْعُوهُ فَمِنْ مَالِ مَنْ تِلْكَ الْمُكَافَأَةُ أَ مِنْ مَالِ الْأَجِيرِ أَوْ مِنْ مَالِ الْمُسْتَأْجِرِ قَالَ إِنْ كَانَ فِي مَصْلَحَةِ الْمُسْتَأْجِرِ فَهُوَ مِنْ مَالِهِ وَ إِلَّا فَهُوَ عَلَى الْأَجِيرِ",
          "وَ عَنْ رَجُلٍ اسْتَأْجَرَ رَجُلًا بِنَفَقَةٍ  مُسَمَّاةٍ وَ لَمْ يُفَسِّرْ شَيْئاً عَلَى أَنْ يَبْعَثَهُ إِلَى أَرْضٍ أُخْرَى فَمَا كَانَ مِنْ مَئُونَةِ الْأَجِيرِ مِنْ غَسْلِ الثِّيَابِ وَ الْحَمَّامِ فَعَلَى مَنْ قَالَ عَلَى الْمُسْتَأْجِرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Abbas Bin Musa, from Yunus, from Suleyman Bin Salim who said, ",
            "‘I asked Abu Al Hassan<sup>asws</sup> about a man who employs a man with expenses and a specified amount of Dirhams upon a stipulation that he would send him to a land. So when he arrived, a man from his companions welcomed him and invited him to his house for the month or two months. So he attained with him what made him needless from the expenditure (provided by the) employer. So the employee looked at what he would have spent upon him during the month if he (his companion) had not invited him. So the one who had invited him had sufficed him. So from whose wealth would be that sufficient expenditure, from the wealth of the employee or from the wealth of the employer?’ He<sup>asws</sup> said: ‘If it was in the interest of the employer so it would be from his wealth, or else so it is upon the employee’. ",
            "(He the narrator said), ‘And (I asked) about a man who employed a man with a specified expenditure and did not explain anything that he would be sending him to another land. So whatever was from the privisions of the employee, from washing the clothes and the bathing, so upon whom (would it be)?’ He<sup>asws</sup> said: ‘Upon the employer’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-‘Abbas ibn Musa from Yunus from Sulayman ibn Salim who has said the following: “This is concerning my question before abu al-Hassan, ‘Alayhi al-Salam, about the case of a man who hires another man for a certain amount of wages and dirham to send him to a certain land. When he arrives in that land one of his friends invites him with who he stays for one or two months where he does not need to spend from the supplies of his employer. After calculating he finds out that the amount his employer had provided is not enough and that his expenses have been taken care of by the resources of his friend; if the shortages in his expenses is the responsibility of the employee or the employer. He (the Imam) said, ‘It is on the employer if it serves his interests, but if it does not serve his interest then it is on the employee.’ I then asked about the case of a man who hired another man for a certain amount of wages and did not explain anything about his sending him (the employee) to another land, and then whose responsibility was his expenses such as washing clothes and bathing? He (the Imam) said, ‘It is the responsibility of the employer.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح على الظاهر   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/386)"
        ],
        "index": 9236,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:145:3",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَلِيِّ بْنِ إِسْمَاعِيلَ بْنِ عَمَّارٍ عَنْ عُبَيْدِ بْنِ زُرَارَةَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الرَّجُلُ يَأْتِي الرَّجُلَ فَيَقُولُ اكْتُبْ لِي بِدَرَاهِمَ فَيَقُولُ لَهُ آخُذُ مِنْكَ وَ أَكْتُبُ لَكَ [بَيْنَ يَدَيْهِ] قَالَ فَقَالَ لَا بَأْسَ ",
          "قَالَ وَ سَأَلْتُهُ عَنْ رَجُلٍ اسْتَأْجَرَ مَمْلُوكاً فَقَالَ الْمَمْلُوكُ أَرْضِ مَوْلَايَ بِمَا شِئْتَ وَ لِي عَلَيْكَ كَذَا وَ كَذَا دَرَاهِمَ مُسَمَّاةً فَهَلْ يَلْزَمُ الْمُسْتَأْجِرَ وَ هَلْ يَحِلُّ لِلْمَمْلُوكِ قَالَ لَا يَلْزَمُ الْمُسْتَأْجِرَ وَ لَا يَحِلُّ لِلْمُلُوكِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Ali Bin Ismail Bin Ammar, from Ubeyd Bin Zurara who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The man comes over to the man so he is saying, ‘Write out (a promissory note) for me with the Dirhams’. So he is saying to him, ‘I shall take from you and (then) I shall write for you’, in front of him’. So he<sup>asws</sup> said; ‘There is no problem’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about a man who employs an owned slave, so the slave said, ‘Ask my master with whatever you so desire to, and for me, upon you would be such and such specified amount of Dirhams. So, does it obligate the employer, and is it Permissible for the owned slave?’ He<sup>asws</sup> said: ‘Neither does it obligate the employer nor is it Permissible for the slave’."
          ],
          "en.sarwar": [
            "3. Ahmad ibn Muhammad has narrated from ibn abu ‘Umayr from Ali ibn ‘Isma’il ibn ‘Ammar from ‘Ubayd ibn Zurarah who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who comes to another man and says, ‘Write for me for a few dirham.’ He says, ‘I take from you and write (in your presence).’ He (the Imam) said, ‘It is not unlawful.’ I then asked about a man who hires a slave who says, ‘Make my master agree for whatever amount you like but so and so much dirham will be for me’, if this becomes binding upon the employer and if it is lawful for the slave. He (the Imam) said, ‘It does not become binding upon the employer and it is not lawful for the slave.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:145",
  "kind": "verse_list"
}