{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:5:2", "titles": {"ar": "كتاب الْمَعِيشَةِ", "en": "THE BOOK OF SUBSISTENCE"}}, {"indexed_titles": {"en": "Chapter 146"}, "path": "/books/al-kafi:5:2:146", "titles": {"ar": "باب الرَّجُلِ يَكْتَرِي الدَّابَّةَ فَيُجَاوِزُ بِهَا الْحَدَّ أَوْ يَرُدُّهَا قَبْلَ الِانْتِهَاءِ إِلَى الْحَدِّ", "en": "Chapter 146 – The man hires the animal, so he exceeds the limit with it, or returns it before ending up to the limit"}}], "index": 1357, "local_index": 146, "part_type": "Chapter", "path": "/books/al-kafi:5:2:146", "titles": {"ar": "باب الرَّجُلِ يَكْتَرِي الدَّابَّةَ فَيُجَاوِزُ بِهَا الْحَدَّ أَوْ يَرُدُّهَا قَبْلَ الِانْتِهَاءِ إِلَى الْحَدِّ", "en": "Chapter 146 – The man hires the animal, so he exceeds the limit with it, or returns it before ending up to the limit"}, "verse_count": 7, "verse_start_index": 9239, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 9240, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:2:146:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنِ الْحَسَنِ الصَّيْقَلِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا تَقُولُ فِي رَجُلٍ اكْتَرَى دَابَّةً إِلَى مَكَانٍ مَعْلُومٍ فَجَاوَزَهُ قَالَ يُحْسَبُ لَهُ الْأَجْرُ بِقَدْرِ مَا جَاوَزَ وَ إِنْ عَطِبَ الْحِمَارُ فَهُوَ ضَامِنٌ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan Bin Ali, from Aban Bin Usman, from Al Hassan Al Sayqal who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘What are you<sup>asws</sup> saying regarding a man who hires an animal to a known place, so he exceeds it’. He<sup>asws</sup> said: ‘The rent would be accounted for him in accordance with whatever he has exceeded with, and if the donkey is injured, so he would be resonsible’."]}}, {"index": 9241, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:2:146:2", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْعَلَاءِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يَكْتَرِي الدَّابَّةَ فَيَقُولُ اكْتَرَيْتُهَا مِنْكَ إِلَى مَكَانِ كَذَا وَ كَذَا فَإِنْ جَاوَزْتُهُ فَلَكَ كَذَا وَ كَذَا زِيَادَةً وَ يُسَمِّي ذَلِكَ قَالَ لَا بَأْسَ بِهِ كُلِّهِ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Al A’ala, from Muhammad Bin Muslim, from Abu Hamza, ", "from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the man who hires the animal, so he is saying, ‘I am hiring it from you up to such and such a place. So if I were to exceed it, for you would be such and such increase (of hire charges)’, and he specifies that’. He<sup>asws</sup> said: ‘There is no problem with it, all of it’."]}}, {"index": 9242, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:2:146:3", "text": ["أَحْمَدُ بْنُ مُحَمَّدٍ [عَنْ رَجُلٍ] عَنْ أَبِي الْمَغْرَاءِ عَنِ الْحَلَبِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ تَكَارَى دَابَّةً إِلَى مَكَانٍ مَعْلُومٍ فَنَفَقَتِ الدَّابَّةُ قَالَ إِنْ كَانَ جَازَ الشَّرْطَ فَهُوَ ضَامِنٌ وَ إِنْ دَخَلَ وَادِياً لَمْ يُوثِقْهَا فَهُوَ ضَامِنٌ وَ إِنْ سَقَطَتْ فِي بِئْرٍ فَهُوَ ضَامِنٌ لِأَنَّهُ لَمْ يَسْتَوْثِقْ مِنْهَا ."], "translations": {"en.hubeali": ["Ahmad Bin Muhammad, from a man, from Abu Al Magra, from Al Halby who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about the man who hired an animal up to a known place. So the animal died’. He<sup>asws</sup> said: ‘If he had exceeded the stipulation, so he is responsible, and if he entered a valley not trusting it (for safety), so he is responsible, and if it falls into a well, so he is responsible, because he was not ensured from it’."]}}, {"index": 9243, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:5:2:146:4", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ عَنِ الْعَلَاءِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ كُنْتُ جَالِساً عِنْدَ قَاضٍ مِنْ قُضَاةِ الْمَدِينَةِ فَأَتَاهُ رَجُلَانِ فَقَالَ أَحَدُهُمَا إِنِّي تَكَارَيْتُ هَذَا يُوَافِي بِيَ السُّوقَ يَوْمَ كَذَا وَ كَذَا وَ إِنَّهُ لَمْ يَفْعَلْ قَالَ فَقَالَ لَيْسَ لَهُ كِرَاءٌ قَالَ فَدَعَوْتُهُ وَ قُلْتُ يَا عَبْدَ اللَّهِ لَيْسَ لَكَ أَنْ تَذْهَبَ بِحَقِّهِ وَ قُلْتُ لِلْآخَرِ لَيْسَ لَكَ أَنْ تَأْخُذَ كُلَّ الَّذِي عَلَيْهِ اصْطَلِحَا فَتَرَادَّا بَيْنَكُمَا ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan, from Al A’ala, from Muhammad Bin Muslim, ", "from Abu Ja’far<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘I<sup>asws</sup> I was seated in the presence of a judge from the judges of Al Medina, so two men came over to him. So one of the two said, ‘I hired this one to meet with me in the market on such and such a day, and he did not do it’. So he said, ‘There is no fee for him’. He<sup>asws</sup> said: ‘So I<sup>asws</sup> called him over and said, ‘O servant of Allah<sup>ajwj</sup>! It is not for you that you go away with his right’. And I<sup>asws</sup> said to the other one: ‘It is not for you that you take everything which was upon him. Reconcile, so returns (some fees) between you two’."]}}, {"index": 9244, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:5:2:146:5", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ مُحَمَّدٍ الْحَلَبِيِّ قَالَ كُنْتُ قَاعِداً عِنْدَ قَاضٍ مِنَ الْقُضَاةِ وَ عِنْدَهُ أَبُو جَعْفَرٍ ( عليه السلام ) جَالِسٌ فَأَتَاهُ رَجُلَانِ فَقَالَ أَحَدُهُمَا إِنِّي تَكَارَيْتُ إِبِلَ هَذَا الرَّجُلِ لِيَحْمِلَ لِي مَتَاعاً إِلَى بَعْضِ الْمَعَادِنِ فَاشْتَرَطْتُ عَلَيْهِ أَنْ يُدْخِلَنِي الْمَعْدِنَ يَوْمَ كَذَا وَ كَذَا لِأَنَّهَا سُوقٌ أَتَخَوَّفُ أَنْ يَفُوتَنِي فَإِنِ احْتُبِسْتُ عَنْ ذَلِكَ حَطَطْتُ مِنَ الْكِرَى لِكُلِّ يَوْمٍ أُحْتَبَسُهُ كَذَا وَ كَذَا وَ إِنَّهُ حَبَسَنِي عَنْ ذَلِكَ الْوَقْتِ كَذَا وَ كَذَا يَوْماً ", "فَقَالَ الْقَاضِي هَذَا شَرْطٌ فَاسِدٌ وَفِّهِ كِرَاهُ فَلَمَّا قَامَ الرَّجُلُ أَقْبَلَ إِلَيَّ أَبُو جَعْفَرٍ ( عليه السلام ) فَقَالَ شَرْطُهُ هَذَا جَائِزٌ مَا لَمْ يَحُطَّ بِجَمِيعِ كِرَاهُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Mansour Bin Yunus, from Muhammad Al Halby who said, ", "‘I was seated in the presence of a judge from the judges and seated in his presence was Abu Ja’far<sup>asws</sup>. So two me came over to him, and one of the two said, ‘I hire the camel of this man to carry some goods for me to one of the mines, and I stipulated upon him that he comes over to me into the mine on such and such a day because it was a market day, fearing that I would miss it. So if he were to withhold from that, I would reduce from the hire charge, for each days he withholds, by such and such, and he withheld mefrom that time for such and such days’. ", "So the judge said, ‘This is an invalid stipulation. Fulfil his hire charges’. So when the man arose, Abu Ja’far<sup>asws</sup> turned towards me, so he<sup>asws</sup> said: ‘This stipulation of his is allowed for as long as he does not drop the entirety of his hire charges’."]}}, {"index": 9245, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:5:2:146:6", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي وَلَّادٍ الْحَنَّاطِ قَالَ اكْتَرَيْتُ بَغْلًا إِلَى قَصْرِ ابْنِ هُبَيْرَةَ ذَاهِباً وَ جَائِياً بِكَذَا وَ كَذَا وَ خَرَجْتُ فِي طَلَبِ غَرِيمٍ لِي فَلَمَّا صِرْتُ قُرْبَ قَنْطَرَةِ الْكُوفَةِ خُبِّرْتُ أَنَّ صَاحِبِي تَوَجَّهَ إِلَى النِّيلِ فَتَوَجَّهْتُ نَحْوَ النِّيلِ فَلَمَّا أَتَيْتُ النِّيلَ خُبِّرْتُ أَنَّ صَاحِبِي تَوَجَّهَ إِلَى بَغْدَادَ فَاتَّبَعْتُهُ وَ ظَفِرْتُ بِهِ وَ فَرَغْتُ مِمَّا بَيْنِي وَ بَيْنَهُ وَ رَجَعْنَا إِلَى الْكُوفَةِ وَ كَانَ ذَهَابِي وَ مَجِيئِي خَمْسَةَ عَشَرَ يَوْماً", "فَأَخْبَرْتُ صَاحِبَ الْبَغْلِ بِعُذْرِي وَ أَرَدْتُ أَنْ أَتَحَلَّلَ مِنْهُ مِمَّا صَنَعْتُ وَ أُرْضِيَهُ فَبَذَلْتُ لَهُ خَمْسَةَ عَشَرَ دِرْهَماً فَأَبَى أَنْ يَقْبَلَ فَتَرَاضَيْنَا بِأَبِي حَنِيفَةَ فَأَخْبَرْتُهُ بِالْقِصَّةِ وَ أَخْبَرَهُ الرَّجُلُ فَقَالَ لِي وَ مَا صَنَعْتَ بِالْبَغْلِ فَقُلْتُ قَدْ دَفَعْتُهُ إِلَيْهِ سَلِيماً قَالَ نَعَمْ بَعْدَ خَمْسَةَ عَشَرَ يَوْماً فَقَالَ مَا تُرِيدُ مِنَ الرَّجُلِ قَالَ أُرِيدُ كِرَى بَغْلِي فَقَدْ حَبَسَهُ عَلَيَّ خَمْسَةَ عَشَرَ يَوْماً فَقَالَ مَا أَرَى لَكَ حَقّاً لِأَنَّهُ اكْتَرَاهُ إِلَى قَصْرِ ابْنِ  هُبَيْرَةَ فَخَالَفَ وَ رَكِبَهُ إِلَى النِّيلِ وَ إِلَى بَغْدَادَ فَضَمِنَ قِيمَةَ الْبَغْلِ وَ سَقَطَ الْكِرَى فَلَمَّا رَدَّ الْبَغْلَ سَلِيماً وَ قَبَضْتَهُ لَمْ يَلْزَمْهُ الْكِرَى ", "قَالَ فَخَرَجْنَا مِنْ عِنْدِهِ وَ جَعَلَ صَاحِبُ الْبَغْلِ يَسْتَرْجِعُ فَرَحِمْتُهُ مِمَّا أَفْتَى بِهِ أَبُو حَنِيفَةَ فَأَعْطَيْتُهُ شَيْئاً وَ تَحَلَّلْتُ مِنْهُ فَحَجَجْتُ تِلْكَ السَّنَةَ فَأَخْبَرْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) بِمَا أَفْتَى بِهِ أَبُو حَنِيفَةَ فَقَالَ فِي مِثْلِ هَذَا الْقَضَاءِ وَ شِبْهِهِ تَحْبِسُ السَّمَاءُ مَاءَهَا وَ تَمْنَعُ الْأَرْضُ بَرَكَتَهَا", "قَالَ فَقُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَمَا تَرَى أَنْتَ قَالَ أَرَى لَهُ عَلَيْكَ مِثْلَ كِرَى بَغْلٍ ذَاهِباً مِنَ الْكُوفَةِ إِلَى النِّيلِ وَ مِثْلَ كِرَى بَغْلٍ رَاكِباً مِنَ النِّيلِ إِلَى بَغْدَادَ وَ مِثْلَ كِرَى بَغْلٍ مِنْ بَغْدَادَ إِلَى الْكُوفَةِ تُوَفِّيهِ إِيَّاهُ قَالَ فَقُلْتُ جُعِلْتُ فِدَاكَ إِنِّي قَدْ عَلَفْتُهُ بِدَرَاهِمَ فَلِي عَلَيْهِ عَلَفُهُ فَقَالَ لَا لِأَنَّكَ غَاصِبٌ", "فَقُلْتُ أَ رَأَيْتَ لَوْ عَطِبَ الْبَغْلُ وَ نَفَقَ أَ لَيْسَ كَانَ يَلْزَمُنِي قَالَ نَعَمْ قِيمَةُ بَغْلٍ يَوْمَ خَالَفْتَهُ قُلْتُ فَإِنْ أَصَابَ الْبَغْلَ كَسْرٌ أَوْ دَبَرٌ أَوْ غَمْزٌ فَقَالَ عَلَيْكَ قِيمَةُ مَا بَيْنَ الصِّحَّةِ وَ الْعَيْبِ يَوْمَ تَرُدُّهُ عَلَيْهِ قُلْتُ فَمَنْ يَعْرِفُ ذَلِكَ قَالَ أَنْتَ وَ هُوَ إِمَّا أَنْ يَحْلِفَ هُوَ عَلَى الْقِيمَةِ فَتَلْزَمَكَ فَإِنْ رَدَّ الْيَمِينَ عَلَيْكَ فَحَلَفْتَ عَلَى الْقِيمَةِ لَزِمَهُ ذَلِكَ أَوْ يَأْتِيَ صَاحِبُ الْبَغْلِ بِشُهُودٍ يَشْهَدُونَ أَنَّ قِيمَةَ الْبَغْلِ حِينَ أَكْرَى كَذَا وَ كَذَا فَيَلْزَمَكَ", "قُلْتُ إِنِّي كُنْتُ أَعْطَيْتُهُ دَرَاهِمَ وَ رَضِيَ بِهَا وَ حَلَّلَنِي فَقَالَ إِنَّمَا رَضِيَ بِهَا وَ حَلَّلَكَ حِينَ قَضَى عَلَيْهِ أَبُو حَنِيفَةَ بِالْجَوْرِ وَ الظُّلْمِ وَ لَكِنِ ارْجِعْ إِلَيْهِ فَأَخْبِرْهُ بِمَا أَفْتَيْتُكَ بِهِ فَإِنْ جَعَلَكَ فِي حِلٍّ بَعْدَ مَعْرِفَتِهِ فَلَا شَيْ‏ءَ عَلَيْكَ بَعْدَ ذَلِكَ ", "قَالَ أَبُو وَلَّادٍ فَلَمَّا انْصَرَفْتُ مِنْ وَجْهِي ذَلِكَ لَقِيتُ الْمُكَارِيَ فَأَخْبَرْتُهُ بِمَا أَفْتَانِي بِهِ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ قُلْتُ لَهُ قُلْ مَا شِئْتَ حَتَّى أُعْطِيَكَهُ فَقَالَ قَدْ حَبَّبْتَ إِلَيَّ جَعْفَرَ بْنَ مُحَمَّدٍ ( عليه السلام ) وَ وَقَعَ فِي قَلْبِي لَهُ التَّفْضِيلُ وَ أَنْتَ فِي حِلٍّ وَ إِنْ أَحْبَبْتَ أَنْ أَرُدَّ عَلَيْكَ الَّذِي أَخَذْتُ مِنْكَ فَعَلْتُ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Ibn Maboub, from Abu Wallad Al Hannat who said, ", "‘I hired a mule to Qasr Ibn Hubeyra, going and coming, for such and such (amount), and I went out in seeking the debs (collectible) for me. So when I got near to the arch of Al Kufa, I was informed that my companions had gone to the Nile. So I diverted towards the Nile. So when I got to the Nile, I was informed that my companions had gone to Baghdad. So I pursued him, and I was successfull with it, and I was free from what was between me and him, and we returned to Al Kufa, and the going and coming was of (a duration of) fifteen days’. ", "So I informed my companion with my excuse if he permits from it from what I had done, and I pleased him, so I extended to him fifteen Dirhams. But, he refused to accept. So we both agreed with (going to) Abu Haneefa (for a judgement). So I informed him with the story and the man informed him of it. So he said to me, ‘And what did you do with the mule?’ So I said, ‘I have handed it over to him, safely’. He (the owner of the mule) said, ‘Yes, after fifteen days!’. So he (Abu Haneefa) said, ‘And what do you want with the man?’ He said, ‘I want the hire charges for my mule withheld from me for fifteen days’. So he said, ‘I do not see for you a right, because he had hired it to Qas Ibn Hubeyra, so he differed and rode it to the Nile, and to Baghdad. So he is responsible for the price of the mule and the hire charges are dropped. So when he returned the mule safely and you took possession of it, the hire charges are not obligated upon him’.", "He (the narrator) said, ‘So we came out from his presence and the owner of the mule went on to say ‘We are from Allah<sup>ajwj</sup> and to Him<sup>asws</sup> we are returning’, due to what Fatwa Abu Haneefa had issued with. So I gave him something, and freed myself from him. Then I went on Hajj during that year. So I informed Abu Abdullah<sup>asws</sup> with what Fatwa Abu Haneefa had issued with. So he<sup>asws</sup> said: ‘It is due to these (types of) judgements and what resembles these that the sky withholds its water and the earth prevents its Blessings’. ", "He (the narrator) said, ‘I said to Abu Abdullah<sup>asws</sup>, ‘So what is your<sup>asws</sup> view?’ He<sup>asws</sup> said: ‘I<sup>asws</sup> view for him, upon you, similar hire charges of a mule going from Al Kufa to the Nile, and similar hire charges of a mule riding from the Nile to Baghdad, and a similar hire charges of a mule from Baghdad to Al Kufa. Pay it to him’. So I said, ‘May I be sacrificed for you<sup>asws</sup>! I had fed it with Dirhams, so for me, upon him, would be its feeding (to reduce from the hire charges)’. So he<sup>asws</sup> said: ‘No, because you are a usurper’. ", "So I said, ‘What is your<sup>asws</sup> view, if the mule had been injured and died, would not that have been obligated upon me?’ He<sup>asws</sup> said: ‘Yes, a price of a mule on the day you opposed him’. I said, ‘Supposing the mule had been affected by a fracture, or injury, or disease?’ So he<sup>asws</sup> said: ‘Upon you would be its price what is between the healthy and the faulty on the day you returned it to him’. I said, ‘And who would recognise that (difference)?’ He<sup>asws</sup> said: ‘You and him, and either he swears an oath upon the price, so it would be necessitated upon you. So if he were to return the swearing of the oath upon you, and you swear upon the price, that would necessitate upon him, or else the owner of the mule would come with witnesses who would be testifying that the price of the mule when it was hire was such and such, so it would be necessitated upon you’. ", "I said, ‘I had given him some Dirhams and pleased him with it, and he freed me’. So he<sup>asws</sup> said: ‘But rather, he was pleased with it and freed you when Abu haneefa judged against him with the inequity and the injustice, but return to him and inform him with what Fatwa I<sup>asws</sup> have issued with. So if he were to make you to be free after recognising it, so there would not be anything upon you after that’. ", "Abu Wallad (the narrator) said, ‘So when I left from that direction of mine to meet the hirer, I informed him with what Fatwa Abu Abdullah<sup>asws</sup> had issued to me with, and I said to him, ‘Say whatever you so desire to and I shall give it to you’. So he said, ‘Ja’far Bin Muhammad<sup>asws</sup> has become beloved to me and there has occurred the preference for him<sup>asws</sup> in my heart, and you are free, and if you so like that I return to you that which I have taken from you, I would do so’."]}}, {"index": 9246, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:5:2:146:7", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنِ الْعَمْرَكِيِّ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَخِيهِ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ اسْتَأْجَرَ دَابَّةً فَأَعْطَاهَا غَيْرَهُ فَنَفَقَتْ مَا عَلَيْهِ فَقَالَ إِنْ كَانَ شَرَطَ أَنْ لَا يَرْكَبَهَا غَيْرُهُ فَهُوَ ضَامِنٌ لَهَا وَ إِنْ لَمْ يُسَمِّ فَلَيْسَ عَلَيْهِ شَيْ‏ءٌ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Al Amraky Bin Ali, ", "from Ali son of Ja’far<sup>asws</sup>, from his brother Abu Al Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who hired an animal, so he gave it to someone else, and it died upon him. So he<sup>asws</sup> said: ‘If it had been stipulated that no one else would ride upon it, he would be responsible for it, and if it had not been specified, so there is nothing upon him’."]}}]}, "index": "al-kafi:5:2:146", "kind": "verse_list"}