{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 146"
        },
        "path": "/books/al-kafi:5:2:146",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب كَرَاهَةِ اسْتِعْمَالِ</span> الْأَجِيرِ قَبْلَ مُقَاطَعَتِهِ عَلَى أُجْرَتِهِ وَ تَأْخِيرِ إِعْطَائِهِ بَعْدَ الْعَمَلِ",
          "en": "Chapter 145 – Abhorrence of utilising the employee before agreeing his wages and delay giving it to him after the work"
        }
      }
    ],
    "index": 1358,
    "local_index": 146,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 147"
        },
        "path": "/books/al-kafi:5:2:147",
        "titles": {
          "ar": "باب الرَّجُلِ يَكْتَرِي الدَّابَّةَ فَيُجَاوِزُ بِهَا الْحَدَّ أَوْ يَرُدُّهَا قَبْلَ الِانْتِهَاءِ إِلَى الْحَدِّ",
          "en": "Chapter 146 – The man hires the animal, so he exceeds the limit with it, or returns it before ending up to the limit"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 145"
        },
        "path": "/books/al-kafi:5:2:145",
        "titles": {
          "ar": "باب إِجَارَةِ الْأَجِيرِ وَ مَا يَجِبُ عَلَيْهِ ",
          "en": "Chapter 144 – Wages of the employee and what is obligated upon it"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:146",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب كَرَاهَةِ اسْتِعْمَالِ</span> الْأَجِيرِ قَبْلَ مُقَاطَعَتِهِ عَلَى أُجْرَتِهِ وَ تَأْخِيرِ إِعْطَائِهِ بَعْدَ الْعَمَلِ",
      "en": "Chapter 145 – Abhorrence of utilising the employee before agreeing his wages and delay giving it to him after the work"
    },
    "verse_count": 4,
    "verse_start_index": 9236,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/386)"
        ],
        "index": 9237,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/178",
              "text": "سُلَيْمَانَ بْنِ جَعْفَرٍ الْجَعْفَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ بْنِ جَعْفَرٍ الْجَعْفَرِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:146:1",
        "text": [
          " كُنْتُ مَعَ الرِّضَا ( عليه السلام ) فِي بَعْضِ الْحَاجَةِ فَأَرَدْتُ أَنْ أَنْصَرِفَ إِلَى مَنْزِلِي فَقَالَ لِيَ انْصَرِفْ مَعِي فَبِتْ عِنْدِيَ اللَّيْلَةَ فَانْطَلَقْتُ مَعَهُ فَدَخَلَ إِلَى دَارِهِ مَعَ الْمُعَتِّبِ فَنَظَرَ إِلَى غِلْمَانِهِ يَعْمَلُونَ بِالطِّينِ أَوَارِيَ الدَّوَابِّ وَ غَيْرَ ذَلِكَ وَ إِذاً مَعَهُمْ أَسْوَدُ لَيْسَ مِنْهُمْ فَقَالَ مَا هَذَا الرَّجُلُ مَعَكُمْ فَقَالُوا يُعَاوِنُنَا وَ نُعْطِيهِ شَيْئاً قَالَ قَاطَعْتُمُوهُ عَلَى أُجْرَتِهِ فَقَالُوا لَا هُوَ يَرْضَى مِنَّا بِمَا نُعْطِيهِ ",
          "فَأَقْبَلَ عَلَيْهِمْ يَضْرِبُهُمْ بِالسَّوْطِ وَ غَضِبَ لِذَلِكَ غَضَباً شَدِيداً فَقُلْتُ جُعِلْتُ فِدَاكَ لِمَ تُدْخِلُ عَلَى نَفْسِكَ فَقَالَ إِنِّي قَدْ نَهَيْتُهُمْ عَنْ مِثْلِ هَذَا غَيْرَ مَرَّةٍ أَنْ يَعْمَلَ مَعَهُمْ أَحَدٌ حَتَّى يُقَاطِعُوهُ أُجْرَتَهُ وَ اعْلَمْ أَنَّهُ مَا مِنْ أَحَدٍ يَعْمَلُ لَكَ شَيْئاً بِغَيْرِ مُقَاطَعَةٍ ثُمَّ زِدْتَهُ لِذَلِكَ الشَّيْ‏ءِ ثَلَاثَةَ أَضْعَافٍ عَلَى أُجْرَتِهِ إِلَّا ظَنَّ أَنَّكَ قَدْ نَقَصْتَهُ أُجْرَتَهُ وَ إِذَا قَاطَعْتَهُ ثُمَّ أَعْطَيْتَهُ أُجْرَتَهُ حَمِدَكَ عَلَى الْوَفَاءِ  فَإِنْ زِدْتَهُ حَبَّةً عَرَفَ ذَلِكَ لَكَ وَ رَأَى أَنَّكَ قَدْ زِدْتَهُ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Suleyman Bin Ja’far Al Ja’fary who said, ",
            "‘I was with Al Reza<sup>asws</sup> regarding one of the needs, and I intended to leave to go to my house. So he<sup>asws</sup> said to me: ‘Come with me<sup>asws</sup> and spend the night in my<sup>asws</sup> presence’. So I went with him<sup>asws</sup> and entered into his<sup>asws</sup> house along with Al Mo’tab. So he<sup>asws</sup> looked at his<sup>asws</sup> servants who were working with the clay in the animal enclosure, and other such work, and there was a black man with them who was not from them. So he<sup>asws</sup> said: ‘Who is this man with you?’ So they said, ‘He is helping us and we would give him something’. He<sup>asws</sup> said: ‘Have you agreed his wages with him?’ So they said, ‘No. He would be pleased from us with whatever we give him’. ",
            "So he<sup>asws</sup> faced towards them to strike them with the whip, and was angered due to that with an intense anger. So I said, ‘May I be sacrificed for you<sup>asws</sup>! Why are you taking it upon yourself<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘I<sup>asws</sup> have forbidden them from the likes of this many a time, to make anyone work with them until they agree his wages beforehand. And know that there is no one who would work for you anything without an agreed wages, and then you increase something for him three times over upon his wages, he would still thing that you have been deficient in his wages; and when you agree his wages beforehand, then give his wages to him, he would praise you upon the loyalty. So if you were to increase it even by a grain, he would recognise that for you and view that you have given him more’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Sulayman ibn Ja’far al-Ja’fariy who has said the following: “I once was with al-Rida’, ‘Alayhi al-Salam, because of a certain work and I wanted to leave for my home but he (the Imam) said, ‘Come with me and stay for the night with me/ I went with him (the Imam), he entered in his house with al-Mu‘attib and looked at his slaves who worked with clay, in the animal barn and other things and with them there was a black man who was not one of them. He (the Imam) asked, ‘Who is this man with you?’ They replied, ‘He is helping us and we will give him something.’ He (the Imam) then asked, ‘Have you determined how much you must pay him?’ They replied, ‘No, because he will agree with whatever we will give him.’ He (the Imam) turned upon them using a whip, expressing intense anger. I then said, ‘I pray to Allah to keep my soul in service for your cause, please do not take it upon yourself.’ He (the Imam) said, ‘I have prohibited them many times from allowing anyone to work with them without determining his wages. I know that there is no one who works for you in anything without determining his wages; then you pay him three times more than what his work is worth for, he still thinks that you have paid him less than his wages; but if you determine his wages first, then pay his wages he will be grateful to you for keeping your promise and if you increase even by one grain he will recognize it as your favor and see that you have paid him extra.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/387)"
        ],
        "index": 9238,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/44",
              "text": "هِشَامِ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4327",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الْحَمَّالِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4328",
              "text": "الْأَجِيرِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الْحَمَّالِ وَ الْأَجِيرِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:146:2",
        "text": [
          " لَا يَجِفُّ عَرَقُهُ حَتَّى تُعْطِيَهُ أُجْرَتَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Al Hakam, ",
            "from Abu Abdullah(a.s.) regarding the carriers and the employees, having said: ‘His sweat should not dry up until you give him his wages’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hisham ibn al-Hakam who has said the following: “About the case of porters and a man working for hire, abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘You must pay him before his perspiration dries up.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/388)"
        ],
        "index": 9239,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/359",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1176",
              "text": "حَنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/250",
              "text": "شُعَيْبٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ حَنَانٍ عَنْ شُعَيْبٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:146:3",
        "text": [
          " تَكَارَيْنَا لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَوْماً يَعْمَلُونَ فِي بُسْتَانٍ لَهُ وَ كَانَ أَجَلُهُمْ إِلَى الْعَصْرِ فَلَمَّا فَرَغُوا قَالَ لِمُعَتِّبٍ أَعْطِهِمْ أُجُورَهُمْ قَبْلَ أَنْ يَجِفَّ عَرَقُهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Hanaan, from Shuayb who said, ",
            "‘We hired for Abu Abdullah<sup>asws</sup>, a group of people working for him<sup>asws</sup> in an orchard of his, and their term was until the mid-afternoon. So when they were free, he<sup>asws</sup> said to Mo’tab: ‘Give them their wages before their sweat dries up’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ‘Isma’il from Hanan from Shu’ayb who has said the following: “We once hired a people for abu ‘Abd Allah, ‘Alayhi al-Salam, to work in his garden and they were suppose to work until the time of al-‘Al-‘Asr. When they finished, he (the Imam) said to Mu‘attib, ‘Pay them their wages before their perspiration dries up.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/388)"
        ],
        "index": 9240,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/291",
              "text": "هَارُونَ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/292",
              "text": "مَسْعَدَةَ بْنِ صَدَقَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:146:4",
        "text": [
          " مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَ الْيَوْمِ الْآخِرِ فَلَا يَسْتَعْمِلَنَّ أَجِيراً حَتَّى يُعْلِمَهُ مَا أَجْرُهُ وَ مَنِ اسْتَأْجَرَ أَجِيراً ثُمَّ حَبَسَهُ عَنِ الْجُمُعَةِ يَبُوءُ بِإِثْمِهِ وَ إِنْ هُوَ لَمْ يَحْبِسْهُ اشْتَرَكَا فِي الْأَجْرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Haroun Bin Muslim, from Mas’ada Bin Sadaqa, ",
            "from Abu Abdullah<sup>asws</sup> having said: ‘The one who was a believer in Allah<sup>ajwj</sup> and the Last Day, so he should not utilise an employee until he lets him know what his wages are, and the one who employs an employee, then withholds him from the Friday (Prayer) would be responsible for his sin, and if he does not withhold him, he would be a participant in the Recompense’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from Harun ibn Muslim from Mas’adah ibn Sadaqah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Whoever believes in Allah and on Day of Judgment must not make a person work for him on hire until he knows how much his wages are, and if one hires a person and keeps him from Friday, he is held responsible for his sin; and if he allows him to attend Friday they will share the reward.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:146",
  "kind": "verse_list"
}