{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 149"
        },
        "path": "/books/al-kafi:5:2:149",
        "titles": {
          "ar": "باب الضِّرَارِ ",
          "en": "Chapter 148 – The Damages"
        }
      }
    ],
    "index": 1361,
    "local_index": 149,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 150"
        },
        "path": "/books/al-kafi:5:2:150",
        "titles": {
          "ar": "باب جَامِعٌ فِي حَرِيمِ الْحُقُوقِ ",
          "en": "Chapter 149 – Comprehensive chapter regarding the sanctity of rights"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 148"
        },
        "path": "/books/al-kafi:5:2:148",
        "titles": {
          "ar": "باب الرَّجُلِ يَتَكَارَى الْبَيْتَ وَ السَّفِينَةَ ",
          "en": "Chapter 147 – The man rents the house and the ship"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:149",
    "titles": {
      "ar": "باب الضِّرَارِ ",
      "en": "Chapter 148 – The Damages"
    },
    "verse_count": 8,
    "verse_start_index": 9249,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف كالموثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/394)"
        ],
        "index": 9250,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:149:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ الْجَارَ كَالنَّفْسِ غَيْرُ مُضَارٍّ وَ لَا آثِمٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Yahya, from Talha Bin Zayd, ",
            "from Abu Abdullah<sup>asws</sup> having said: ‘The neighbour is like the self, without having caused harm nor a sin (fault)’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Yahya from Talhah ibn Zayd who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said, ‘A neighbor (in matters of immunity) is like a soul which is not harmed or has not committed sins.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/394)"
        ],
        "index": 9251,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:149:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ سَمُرَةَ بْنَ جُنْدَبٍ كَانَ لَهُ عَذْقٌ فِي حَائِطٍ لِرَجُلٍ مِنَ الْأَنْصَارِ وَ كَانَ مَنْزِلُ الْأَنْصَارِيِّ بِبَابِ الْبُسْتَانِ وَ كَانَ يَمُرُّ بِهِ إِلَى نَخْلَتِهِ وَ لَا يَسْتَأْذِنُ فَكَلَّمَهُ الْأَنْصَارِيُّ أَنْ يَسْتَأْذِنَ إِذَا جَاءَ فَأَبَى سَمُرَةُ ",
          "فَلَمَّا تَأَبَّى جَاءَ الْأَنْصَارِيُّ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَشَكَا إِلَيْهِ وَ خَبَّرَهُ الْخَبَرَ فَأَرْسَلَ إِلَيْهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ خَبَّرَهُ بِقَوْلِ الْأَنْصَارِيِّ وَ مَا شَكَا وَ قَالَ إِنْ أَرَدْتَ الدُّخُولَ فَاسْتَأْذِنْ فَأَبَى فَلَمَّا أَبَى سَاوَمَهُ حَتَّى بَلَغَ بِهِ مِنَ الثَّمَنِ مَا شَاءَ اللَّهُ فَأَبَى أَنْ يَبِيعَ فَقَالَ لَكَ بِهَا عَذْقٌ يُمَدُّ لَكَ فِي الْجَنَّةِ فَأَبَى أَنْ يَقْبَلَ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِلْأَنْصَارِيِّ  اذْهَبْ فَاقْلَعْهَا وَ ارْمِ بِهَا إِلَيْهِ فَإِنَّهُ لَا ضَرَرَ وَ لَا ضِرَارَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Abdullah Bin Bukeyr, from Zurara, ",
            "from Abu Ja’far<sup>asws</sup> having said: ‘Samurat Bin Jundab had a tree in a garden of a man from the Helpers, and the house of the Helper was at the gate of the garden, and he (Samurat) used to pass by it to his palm tree, and he would not seek permission. So the Helper spoke to him that he should seek permission whenever he comes. But, Samurat refused. ",
            "So when the Helper went over to Rasool-Allah<sup>saww</sup>, he complained to him<sup>saww</sup> and informed him<sup>saww</sup> of the news. So Rasool-Allah<sup>saww</sup> sent a messenger to him and informed him with the words of the Helper, and what he had complained with, and said: ‘If you intend the entry, so seek permission’. But he refused. So when he refused, he<sup>saww</sup> bargained with him until it reached from the price what Allah<sup>ajwj</sup> so Desired. But he (still) refused to sell it. So he<sup>saww</sup> said: ‘For you would be a tree extended to you in the Paradise if you accept’. But he refused. So Rasool-Allah<sup>saww</sup> said to the Helper: ‘Go and uproot it and throw it at him, for there should neither be harm nor a harm caused’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad from ibn Khalid from his father from ‘Abd Allah ibn Bukayr from Zurarah who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘Samrah ibn Jundab had a fruit bearing palm tree in the garden of another man from al-Ansar whose house was at the door of the garden and he (Samrah) would pass by when going to his palm tree without permission. The man from al-Ansar spoke to him and asked him to ask for permission whenever he comes. Samrah refused to do so. When he refused the man from al-Ansar went to the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, complained before him and informed him of the condition. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, sent someone to call Samrah, informed him of the complaints of the man from al-Ansar and asked him to ask permission whenever going to his palm tree but he refused. When he refused, he (the Messenger of Allah) bargained with him and offered him a huge price but he still refused. He (the Messenger of Allah) then said, “In exchange for this you can have a fruit bearing palm trees in paradise”, but he refused to accept. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, then asked the man from al-Ansar to go, uproot that palm tree and throw it to him; harming and leading to harm is not lawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/395)"
        ],
        "index": 9252,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:149:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ حَفْصٍ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْمٍ كَانَتْ لَهُمْ عُيُونٌ فِي أَرْضٍ قَرِيبَةٍ بَعْضُهَا مِنْ بَعْضٍ فَأَرَادَ الرَّجُلُ أَنْ يَجْعَلَ عَيْنَهُ أَسْفَلَ مِنْ مَوْضِعِهَا الَّتِي كَانَتْ عَلَيْهِ وَ بَعْضُ الْعُيُونِ إِذَا فُعِلَ ذَلِكَ أَضَرَّ بِالْبَقِيَّةِ مِنَ الْعُيُونِ وَ بَعْضٌ لَا يُضِرُّ مِنْ شِدَّةِ الْأَرْضِ ",
          "قَالَ فَقَالَ مَا كَانَ فِي مَكَانٍ شَدِيدٍ فَلَا يُضِرُّ وَ مَا كَانَ فِي أَرْضٍ رِخْوَةٍ بَطْحَاءَ فَإِنَّهُ يُضِرُّ وَ إِنْ عَرَضَ عَلَى جَارِهِ أَنْ يَضَعَ عَيْنَهُ كَمَا وَضَعَهَا وَ هُوَ عَلَى مِقْدَارٍ وَاحِدٍ قَالَ إِنْ تَرَاضَيَا فَلَا يَضُرُّ وَ قَالَ يَكُونُ بَيْنَ الْعَيْنَيْنِ أَلْفُ ذِرَاعٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Muhammad Bin Hafs, from a man, ",
            "from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a group of people who had springs for them in a land nearby to each other. So the man intended that he makes his spring to be lower than its place which its was upon, and if he were to do that, some of the remaining springs would be harmed and some of the springs would not be harmed due to the solidity of the land’. ",
            "He (the narrator) said: ‘So he<sup>asws</sup> said: ‘Whatever was in a solid place, so it would not be harmed, and whatever was in a soft sandy land would be harmed. And he should ask his neighbour if he could place his spring just as he has placed it, and it would be upon a measurement of one. If he pleases him, so there is no harm done’. And he<sup>asws</sup> said: ‘There should happen to be between the two springs (a distance of) a thousand cubits’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from Muhammad ibn Hafs from a man who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a people whose water fountains in a land are near each other, one of them decides to make his fountain below its original place in which case is harmful to the other fountains but certain ones do not harm due to solidity of earth. He (the Imam) said, ‘Whatever is in solid land it does not harm but whatever is in soft land and sandy, it harms. One can ask his neighbor to keep his fountain at the same level as his and if they agreed it does not harm.’ He (the Imam) said, ‘The distance between two fountains must be kept at one thousand Dhira‘ (hands or arms length).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/396)"
        ],
        "index": 9253,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:149:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ يَزِيدَ بْنِ إِسْحَاقَ شَعِرٍ عَنْ هَارُونَ بْنِ حَمْزَةَ الْغَنَوِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ شَهِدَ بَعِيراً مَرِيضاً وَ هُوَ يُبَاعُ فَاشْتَرَاهُ رَجُلٌ بِعَشَرَةِ دَرَاهِمَ فَجَاءَ وَ أَشْرَكَ فِيهِ رَجُلًا بِدِرْهَمَيْنِ بِالرَّأْسِ وَ الْجِلْدِ فَقُضِيَ أَنَّ الْبَعِيرَ بَرَأَ فَبَلَغَ ثَمَنُهُ دَنَانِيرَ قَالَ فَقَالَ لِصَاحِبِ الدِّرْهَمَيْنِ خُذْ خُمُسَ مَا بَلَغَ فَأَبَى قَالَ أُرِيدُ الرَّأْسَ وَ الْجِلْدَ فَقَالَ لَيْسَ لَهُ ذَلِكَ هَذَا الضِّرَارُ وَ قَدْ أُعْطِيَ حَقَّهُ إِذَا أُعْطِيَ الْخُمُسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Yazeed Bin Is’haq Shair, from Haroun Bin Hama Al Ghanawy, ",
            "from Abu Abdullah<sup>asws</sup> regarding a man who saw a sick camel and it was being sold. So a man bought it with ten Dirhams. So he went an associated a man in it for two Dirhams for the head and the skin. It so happened that the camel was cured, so its price reached (some) Dinars. So he said to the owner of the two Dirhams, ‘Take a fifth of what (its price has) reached’. But he refused saying, ‘I want the head and the skin’. So he<sup>asws</sup> said: ‘That is not for him. This is the harm, and hir right had been given to him when he was given the fifth’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from af-Husayn ibn Muhammad from Yazid ibn Ishaq, Sha‘Ir from Harun ibn Hamzah af- Ghanaviy who has said the following: “About the case of a man who found a sick camel for sale and bought it for ten dirham, then another man came and asked to share for the head and skin for two dirham, but then it was found that the camel was fine and not sick and its price reached many dinars. He then asked the owner of two dirham to take one-fifth of the price, but he refused and said that he wanted the head and skin. Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘He does not have such right; it is harming. His right was made available when one-fifth was offered to him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/397)"
        ],
        "index": 9254,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:149:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ قَالَ كَتَبْتُ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) رَجُلٌ كَانَتْ لَهُ قَنَاةٌ فِي قَرْيَةٍ فَأَرَادَ رَجُلٌ أَنْ يَحْفِرَ قَنَاةً أُخْرَى إِلَى قَرْيَةٍ لَهُ كَمْ يَكُونُ بَيْنَهُمَا فِي الْبُعْدِ حَتَّى لَا يُضِرَّ بِالْأُخْرَى فِي الْأَرْضِ إِذَا كَانَتْ صُلْبَةً أَوْ رِخْوَةً فَوَقَّعَ ( عليه السلام ) عَلَى حَسَبِ أَنْ لَا يُضِرَّ إِحْدَاهُمَا بِالْأُخْرَى إِنْ شَاءَ اللَّهُ",
          "قَالَ وَ كَتَبْتُ إِلَيْهِ ( عليه السلام ) رَجُلٌ كَانَتْ لَهُ رَحًى عَلَى نَهَرِ قَرْيَةٍ وَ الْقَرْيَةُ لِرَجُلٍ فَأَرَادَ صَاحِبُ الْقَرْيَةِ أَنْ يَسُوقَ إِلَى قَرْيَتِهِ الْمَاءَ فِي غَيْرِ هَذَا النَّهَرِ وَ يُعَطِّلَ هَذِهِ الرَّحَى أَ لَهُ ذَلِكَ أَمْ لَا فَوَقَّعَ ( عليه السلام ) يَتَّقِي اللَّهَ وَ يَعْمَلُ فِي ذَلِكَ بِالْمَعْرُوفِ وَ لَا يَضُرُّ أَخَاهُ الْمُؤْمِنَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn who said, ",
            "‘I wrote to Abu Muhammad<sup>asws</sup>, ‘A man had a canal for him in a town, so a man intended that he digs out another canal to town of his. How much should there be between the two regarding the remoteness until they do not harm with the other in the land when it was solid or soft?’ So he<sup>asws</sup> signed: ‘Upon a reckoning that one of the two would not harm the others, if Allah<sup>ajwj</sup> so Desires’. ",
            "He (the narrator) said, ‘And I wrote to him<sup>asws</sup>, ‘A man had a flour mill upon a river of a town, and the town was for (another) man. So the owner of the town intended that he would divert the water to his town to be in other than this river, and disrupt the flour mill. Is that for him or not? ‘So he<sup>asws</sup> signed: ‘He should fear Allah<sup>ajwj</sup> and work with regards to that with the goodness and he should not harm his Believing brother’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn who has said the following: “I once wrote to abu Muhammad, ‘Alayhi al-Salam, and asked, ‘A man had a canal in a village and another man wanted to dig another canal in a village that belonged to him. How much distance is required between the two so that they do not harm each other when the land is solid or soft? He (the Imam) signed the answer that said, ‘It is according to a measure that does not cause one to harm the other, by the will of Allah.’ I wrote to him (the Imam), ‘Alayhi al-Salam, about a man who had a flour mill on the canal of a village that belonged to a man and the owner of the village wanted to divert the water to his village in another canal and put the flour mill out of work; if he can do so. He (the Imam), ‘Alayhi al-Salam, signed the answer that said, ‘He must be pious before Allah and act according to what is acceptable among people and must not cause harm to his believing brother.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/397)"
        ],
        "index": 9255,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:149:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ هِلَالٍ عَنْ عُقْبَةَ بْنِ خَالِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَضَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بَيْنَ أَهْلِ الْمَدِينَةِ فِي مَشَارِبِ النَّخْلِ أَنَّهُ لَا يُمْنَعُ نَفْعُ الشَّيْ‏ءِ وَ قَضَى ( صلى الله عليه وآله ) بَيْنَ أَهْلِ الْبَادِيَةِ أَنَّهُ لَا يُمْنَعُ فَضْلُ مَاءٍ لِيُمْنَعَ بِهِ فَضْلُ كَلَإٍ وَ قَالَ لَا ضَرَرَ وَ لَا ضِرَارَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Abdullah Bin Hilal, from Uqba Bin Khalid, ",
            "from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> judged between the people of Al Medina regarding fountains of the palm trees that nothing beneficial should be prevented, and Ali<sup>asws</sup> judged between the people of Al Badiya that the excess water should not be prevented in order to prevent the Grace, and said: ‘Neither harm nor let harm be caused’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn ‘Abd Allah ibn Hilal from ‘Uqbah ibn Khalid al-Husayn from Muhammad who has said the following: “About the case of a man who dug a canal in a hill and it dried up another canal, abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘They can divide and find out which one is harming the other by closing the flow of water of each canal and leave the other open and alternate by one night between the two (to measure the difference of increase and decrease of the level of water in each one).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/398)"
        ],
        "index": 9256,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:149:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ هِلَالٍ عَنْ عُقْبَةَ بْنِ خَالِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ أَتَى جَبَلًا فَشَقَّ فِيهِ قَنَاةً فَذَهَبَتْ قَنَاةُ الْأُخْرَى بِمَاءِ قَنَاةِ الْأُولَى قَالَ فَقَالَ يَتَقَاسَمَانِ بِحَقَائِبِ الْبِئْرِ لَيْلَةً لَيْلَةً فَيُنْظَرُ أَيُّهُمَا أَضَرَّتْ بِصَاحِبَتِهَا فَإِنْ رُئِيَتِ الْأَخِيرَةُ أَضَرَّتْ بِالْأُولَى فَلْتُعَوَّرْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Abdullah Bin Hilal, from Uqba Bin Khalid, ",
            "from Abu Abdullah<sup>asws</sup> regarding a man who came to a mountain, so he cleaved a canal therein. So another canal dried up by the water of the first canal. So he<sup>asws</sup> said: ‘They should divided the barriers of the well, night by night (alternatively), so they would look at which of the two is harming its companion. So if the irrigation of other one is being harmed by the first one, so let it be closed down’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Muhammad ibn Al-Husayn from Muhammad ibn ‘Abd Allah ibn Hilal from ‘Uqbah ibn Khalid who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that if a man digs a well (a canal) in a hill which reduces the water of an existing well or canal, they must be examined closely. Such tests must be conducted every night to find out which one reduces the water of the other. If it is found out that the second one reduces the water of the existing, one then it must be closed.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/399)"
        ],
        "index": 9257,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:149:8",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدِ بْنِ بُنْدَارَ عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِنَا عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ سَمُرَةَ بْنَ جُنْدَبٍ كَانَ لَهُ عَذْقٌ وَ كَانَ طَرِيقُهُ إِلَيْهِ فِي جَوْفِ مَنْزِلِ رَجُلٍ مِنَ الْأَنْصَارِ فَكَانَ يَجِي‏ءُ وَ يَدْخُلُ إِلَى عَذْقِهِ بِغَيْرِ إِذْنٍ مِنَ الْأَنْصَارِيِّ فَقَالَ لَهُ الْأَنْصَارِيُّ يَا سَمُرَةُ لَا تَزَالُ تُفَاجِئُنَا عَلَى حَالٍ لَا نُحِبُّ أَنْ تُفَاجِئَنَا عَلَيْهَا فَإِذَا دَخَلْتَ فَاسْتَأْذِنْ فَقَالَ لَا أَسْتَأْذِنُ فِي طَرِيقٍ وَ هُوَ طَرِيقِي إِلَى عَذْقِي ",
          "قَالَ فَشَكَا الْأَنْصَارِيُّ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَأَرْسَلَ إِلَيْهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَأَتَاهُ فَقَالَ لَهُ إِنَّ فُلَاناً قَدْ شَكَاكَ وَ زَعَمَ أَنَّكَ تَمُرُّ عَلَيْهِ وَ عَلَى أَهْلِهِ بِغَيْرِ إِذْنِهِ فَاسْتَأْذِنْ عَلَيْهِ إِذَا أَرَدْتَ أَنْ تَدْخُلَ فَقَالَ يَا رَسُولَ اللَّهِ أَسْتَأْذِنُ فِي طَرِيقِي إِلَى عَذْقِي فَقَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) خَلِّ عَنْهُ وَ لَكَ مَكَانَهُ عَذْقٌ فِي مَكَانِ كَذَا وَ كَذَا فَقَالَ لَا قَالَ فَلَكَ اثْنَانِ قَالَ لَا أُرِيدُ",
          "فَلَمْ يَزَلْ يَزِيدُهُ حَتَّى بَلَغَ عَشَرَةَ أَعْذَاقٍ فَقَالَ لَا قَالَ فَلَكَ عَشَرَةٌ فِي مَكَانِ كَذَا وَ كَذَا فَأَبَى فَقَالَ خَلِّ عَنْهُ وَ لَكَ مَكَانَهُ عَذْقٌ فِي الْجَنَّةِ قَالَ لَا أُرِيدُ فَقَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّكَ رَجُلٌ مُضَارٌّ وَ لَا ضَرَرَ وَ لَا ضِرَارَ عَلَى مُؤْمِنٍ ",
          "قَالَ ثُمَّ أَمَرَ بِهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَقُلِعَتْ ثُمَّ رُمِيَ بِهَا إِلَيْهِ وَ قَالَ لَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) انْطَلِقْ فَاغْرِسْهَا حَيْثُ شِئْتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad Bin Bundar, from Ahmad Bin Abu Abdullah, from his father, from one of our companions, from Abdullah Bin Muskan, from Zurara, ",
            "from Abu Ja’far<sup>asws</sup> having said: ‘Samurat Bin Jundab had a tree for him, and its pathway to it was in the middle of a house of a man from the Helpers. So he used to come and entered to his tree without permission from the Helper. So the Helper said to him, ‘O Samurat! You do not cease to surprise us upon a state which we do not like to be surprised upon. So whenever you enter, seek permission’. So he said, ‘I will not seek permission regarding a pathway and it is my pathway to my tree’.",
            "He<sup>asws</sup> said: ‘So the Helper complained to Raool-Allah<sup>saww</sup>. So Rasool-Allah<sup>saww</sup> sent for him, so he came over to him<sup>saww</sup>. So he<sup>saww</sup> said to him: ‘So and so has complained and alleges that you are trespassing upon him and his family without permission. So seek permission to him whenever you intend to enter’. So he said, ‘O Rasool-Allah<sup>saww</sup>! I have to seek permission regarding my pathway to my tree?’ So Rasool-Allah<sup>saww</sup> said to him: ‘Leave it alon and for you would be a tree in its replacement in such and such a place’. So he said, ‘No’. He<sup>saww</sup> said: ‘For you would be two’. He said, ‘I do not want it’. ",
            "So he<sup>saww</sup> did not cease to increase upon him until it reached ten trees. But he said, ‘No’. He<sup>saww</sup> said: ‘For you would would be ten in such and such a place’. But, he refused’. So he<sup>saww</sup> said: ‘And for you, in its place, would be a tree in the Paradise’. He said, ‘I do not want it’. So Rasool-Allah<sup>saww</sup> said to him: ‘You are a harmful man, and there should neither be a harm nor a harm caused upon a Believer’.",
            "He<sup>asws</sup> said: ‘Then Rasool-Allah<sup>saww</sup> ordered with it, so it was uprooted, then it was thrown with it at him, and Rasool-Allah<sup>saww</sup> said to him: ‘Go, and plant it wherever you so desire to’."
          ],
          "en.sarwar": [
            "8. Ali ibn Muhammad ibn Bandar has narrated from Ahmad ibn abu ‘Abd Allah from his father from certain persons of his people from ‘Abd Allah ibn Muskan from Zurarah who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘Samrah ibn Jundab had a fruit bearing palm tree and his path way was through the inside section of the house of a man from al-Ansar. He would come and enter to go to his palm tree without permission. The man from al-Ansar said to him, ‘O Samrah, you continue to take us off guard in a condition that we do not like you to take us off guard. Please, when you come ask for permission. He said, ‘I do not need permission for the path that is the path to my palm tree.’ He (the Imam) said that the man from al-Ansar went to the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, complained before him and informed him of the condition. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, sent someone to call Samrah, informed him that so and so complains and thinks that you pass by him and his family without permission so you must ask for permission when you want to go to your palm tree.’ He said, ‘O Messenger of Allah, why must I ask permission for the pathway of my palm tree?’ The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, said, ‘Leave that palm tree in exchange for a palm tree in such and such place.’ He said, ‘No, I do not want to exchange.’ He (the Messenger of Allah) said, ‘Exchange for two.’ He said, ‘No.’ He (the Messenger of Allah) went on up to offering ten palm trees and he refused to accept. He (the Messenger of Allah) said, ‘Exchange it for ten palm trees in so and so place.’ He refused. He (the Messenger of Allah) said, ‘Exchange it for a palm tree in paradise.’ He refused and said, ‘I do not want it.’ The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, then said, ‘You are a harmful man. Harming and causing to lead to harm is not lawful against a believing man.’ He (the Imam) said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, commanded to uproot that palm tree and threw it to him. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, said to him, ‘Go plant it wherever you want.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:149",
  "kind": "verse_list"
}