{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 156"
        },
        "path": "/books/al-kafi:5:2:156",
        "titles": {
          "ar": "باب ضَمَانِ مَا يُفْسِدُ الْبَهَائِمُ مِنَ الْحَرْثِ وَ الزَّرْعِ",
          "en": "Chapter 155 – Responsibility of what the animals spoil, from the farm and the vegetation"
        }
      }
    ],
    "index": 1368,
    "local_index": 156,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 157"
        },
        "path": "/books/al-kafi:5:2:157",
        "titles": {
          "ar": "باب آخَرُ ",
          "en": "Chapter 156 – Another chapter"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 155"
        },
        "path": "/books/al-kafi:5:2:155",
        "titles": {
          "ar": "باب آخَرُ مِنْهُ فِي حِفْظِ الْمَالِ وَ كَرَاهَةِ الْإِضَاعَةِ",
          "en": "Chapter 154 – Another chapter from it regarding protection of the wealth and abhorrence of the wastage"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:156",
    "titles": {
      "ar": "باب ضَمَانِ مَا يُفْسِدُ الْبَهَائِمُ مِنَ الْحَرْثِ وَ الزَّرْعِ",
      "en": "Chapter 155 – Responsibility of what the animals spoil, from the farm and the vegetation"
    },
    "verse_count": 3,
    "verse_start_index": 9284,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/411)"
        ],
        "index": 9285,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:156:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ يَزِيدَ بْنِ إِسْحَاقَ شَعِرٍ عَنْ هَارُونَ بْنِ حَمْزَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْبَقَرِ وَ الْغَنَمِ وَ الْإِبِلِ يَكُونُ فِي الرَّعْيِ فَتُفْسِدُ شَيْئاً هَلْ عَلَيْهَا ضَمَانٌ فَقَالَ إِنْ أَفْسَدَتْ نَهَاراً فَلَيْسَ عَلَيْهَا ضَمَانٌ مِنْ أَجْلِ أَنَّ أَصْحَابَهُ يَحْفَظُونَهُ وَ إِنْ أَفْسَدَتْ لَيْلًا فَإِنَّ عَلَيْهَا ضَمَانٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muammad Bin Al Husayn, from Yazeed Bin Is’haq Shair, from Haroun Bin Hamza who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the cow and the sheep and the camel who happen to be in the pasture, so it spoils something. Is there any responsibility upon it?’ So he<sup>asws</sup> said: ‘If it spoils during the day, so there is no responsibility upon it (the Shepherd) due to the reason that its (pasture’s) owner should have protected it; and if it spoils at night, so upon it is the responsibility (of the animal owner)’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Yazid ibn Ishaq Sha‘ir from Harun ibn Hamzah who has said the following: “This is concerning my question before abu ‘ Abd Allah, ‘Alayhi al-Salam, about the case of cows, sheep and camels in a pasture which destroy certain things; if anyone is held responsible for anything. He (the Imam) said, ‘If they destroy during the day there is no responsibility; the owners must protect them (their belongings); but if they destroy during the night then the owner of cattle is held responsibility.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/411)"
        ],
        "index": 9286,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:156:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنِ الْمُعَلَّى أَبِي عُثْمَانَ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ داوُدَ وَ سُلَيْمانَ إِذْ يَحْكُمانِ فِي الْحَرْثِ إِذْ نَفَشَتْ فِيهِ غَنَمُ الْقَوْمِ فَقَالَ لَا يَكُونُ النَّفَشُ إِلَّا بِاللَّيْلِ إِنَّ عَلَى صَاحِبِ الْحَرْثِ أَنْ يَحْفَظَ الْحَرْثَ بِالنَّهَارِ وَ لَيْسَ عَلَى صَاحِبِ الْمَاشِيَةِ حِفْظُهَا بِالنَّهَارِ ",
          "وَ إِنَّمَا رَعْيُهَا بِالنَّهَارِ وَ أَرْزَاقُهَا فَمَا أَفْسَدَتْ فَلَيْسَ عَلَيْهَا وَ عَلَى أَصْحَابِ الْمَاشِيَةِ حِفْظُ الْمَاشِيَةِ بِاللَّيْلِ عَنْ حَرْثِ النَّاسِ فَمَا أَفْسَدَتْ بِاللَّيْلِ فَقَدْ ضَمِنُوا وَ هُوَ النَّفَشُ وَ إِنَّ دَاوُدَ ( عليه السلام ) حَكَمَ لِلَّذِي أَصَابَ زَرْعَهُ رِقَابَ الْغَنَمِ وَ حَكَمَ سُلَيْمَانُ ( عليه السلام ) الرِّسْلَ وَ الثَّلَّةَ وَ هُوَ اللَّبَنُ وَ الصُّوفُ فِي ذَلِكَ الْعَامِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from one of our companions, from Al Moalla Abu Usman, ",
            "(It has been narrated) from Abu Baseer who said, ‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic<span class=\"ibTxt\">  [21:78] And Dawood and Sulaiman when they both gave judgement concerning the field when the people's sheep pastured therein</span>. So he<sup>asws</sup> said: ‘The pasturing did not happen except at night, and that it is upon the one who ploughed (the owner of the field) to protect it during the day, and it was not upon the owner of the cattle to protect it during the day. ",
            "But rather, the grazing was during the day as well as the pasturing. So whatever got spoilt, there was no blame for it. And it was upon the owners of the cattle to protect the cattle from the fields of the people, so whatever was spoilt during the night, they were responsible for it, and that Dawood<sup>as</sup> gave the judgement in favour of the owner of the plantation, the necks of the sheep; and Sulayman<sup>as</sup> judged for the milk, and the wool (of the sheep) for that year as compensation to the owners of the plantation’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from certain persons of our people from Mu’alla’ abu ‘Uthman from abu Basir who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the words of Allah, most Majestic, most Glorious, ‘. . . and Dawud and Sulayman who judged about the plantation which was damaged by the sheep of the people.’ (21:78) Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Such damage can happen only during the night. It is the responsibility of the owner of plantation to protect it during the day. The owner of cattle is not required to protect them during the day. During the day it is grazing and feeding. What is damaged is not the responsibility of its owner. The owner of the cattle is responsible to guard them during the night against destroying the people’s plantation. Whatever they may destroy during the night is the responsibility of the owner of cattle and that is what is called al-Nafsh (grazing). Dawud issued judgment in favor of the one whose plantation was damaged against the owner of sheep. Sulayman issued his judgment to pay for the damage in the form of one year’s milk and wool of the sheep to the owner of the plantation.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/412)"
        ],
        "index": 9287,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:156:3",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ عَبْدِ اللَّهِ بْنِ بَحْرٍ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ داوُدَ وَ سُلَيْمانَ إِذْ يَحْكُمانِ فِي الْحَرْثِ قُلْتُ حِينَ حَكَمَا فِي الْحَرْثِ كَانَتْ قَضِيَّةً وَاحِدَةً فَقَالَ إِنَّهُ كَانَ أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى النَّبِيِّينَ قَبْلَ دَاوُدَ إِلَى أَنْ بَعَثَ اللَّهُ دَاوُدَ أَيُّ غَنَمٍ نَفَشَتْ فِي الْحَرْثِ فَلِصَاحِبِ الْحَرْثِ رِقَابُ الْغَنَمِ وَ لَا يَكُونُ النَّفَشُ إِلَّا بِاللَّيْلِ فَإِنَّ عَلَى صَاحِبِ الزَّرْعِ أَنْ يَحْفَظَهُ بِالنَّهَارِ وَ عَلَى صَاحِبِ الْغَنَمِ حِفْظُ الْغَنَمِ بِاللَّيْلِ ",
          "فَحَكَمَ دَاوُدُ ( عليه السلام ) بِمَا حَكَمَتْ بِهِ الْأَنْبِيَاءُ ( عليهم السلام ) مِنْ قَبْلِهِ وَ أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى سُلَيْمَانَ ( عليه السلام ) أَيُّ غَنَمٍ نَفَشَتْ فِي زَرْعٍ فَلَيْسَ لِصَاحِبِ الزَّرْعِ إِلَّا مَا خَرَجَ مِنْ بُطُونِهَا وَ كَذَلِكَ جَرَتِ السُّنَّةُ بَعْدَ سُلَيْمَانَ ( عليه السلام ) وَ هُوَ قَوْلُ اللَّهِ تَعَالَى وَ كُلًّا آتَيْنا حُكْماً وَ عِلْماً فَحَكَمَ كُلُّ وَاحِدٍ مِنْهُمَا بِحُكْمِ اللَّهِ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Abdullah Bin Bahr, from Ibn Muskan, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘The Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[21:78] And Dawood and Sulaiman when they both gave judgement concerning the field</span>. When they<sup>asws</sup> both judged regarding the field, was it one judgement?’ So he<sup>asws</sup> said: ‘It is what Allah<sup>azwj</sup> Mighty and Majestic had Revealed to the Prophets<sup>as</sup> before Dawood<sup>as</sup> up to (the time when) Allah<sup>azwj</sup> Sent Dawood<sup>as</sup> that whichever sheep spoils in the field, so for the owner of the field would be a neck of the sheep, and the spoiling does not happen except at night. Thus, it would be upon the owner of the plantation that he protects it during the day, and upon the owner of the sheep to guard them at night.",
            "So Dawood<sup>as</sup> judged with what the Prophets<sup>as</sup> had judged with from before him<sup>as</sup>, and Allah<sup>azwj</sup> Mighty and Majestic Revealed unto Suleyman<sup>as</sup> that whichever sheep spoils the plantation, so it is not upon the owner of the plantation except what comes out from its belly, and like that flowed the Sunnah after Suleyman<sup>as</sup>, and these are the Words of Allah<sup>azwj</sup> the Exalted <span class=\"ibTxt\">[21:79] and to each one We gave Wisdom and Knowledge</span> So each one of the two<sup>asws</sup> judged by the Judgement of Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "3. Ahmad ibn Muhammad from has narrated from ‘Isa from al-Husayn ibn Sa‘id from ‘Abd Allah ibn Bahr from ibn Muskan from abu Basir who has said the following: “I once said abu ‘Abd Allah, ‘Alayhi al-Salam, ‘What is the meaning of the words of Allah, most Majestic, most Glorious, “Dawud and Sulayman who issued judgment about the plantation.’” I asked, ‘Was it one issue about which they gave judgment?’ He (the Imam) said, ‘Allah, most Majestic, most Glorious, had sent revelation to the prophets before Dawud about such issue. To Dawud Allah revealed that whatever of sheep graze on a plantation, the owner of the plantation receives the necks of the sheep and such grazing must be that which takes place during the night; the owner of the plantation must protect it during the day; and the owner of the sheep must guard them during the night, therefore, Dawud judged as the prophets had judged before. To Sulayman Allah, most Majestic, most Glorious, sent revelation that required the owner of the plantation to ask only for what comes out of the belly of the sheep. This tradition continued after Sulayman and that is mentioned in the words of Allah, most High, “To everyone of them We give command and knowledge,” (22:79) thus, everyone of them judged according to the command of Allah, most Majestic, most Glorious.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:156",
  "kind": "verse_list"
}