{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 19"
        },
        "path": "/books/al-kafi:5:2:19",
        "titles": {
          "ar": "باب الدَّيْنِ ",
          "en": "Chapter 19 – The Debts"
        }
      }
    ],
    "index": 1231,
    "local_index": 19,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 20"
        },
        "path": "/books/al-kafi:5:2:20",
        "titles": {
          "ar": "باب قَضَاءِ الدَّيْنِ ",
          "en": "Chapter 20 – Fulfilment of the Debt"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:5:2:18",
        "titles": {
          "ar": "باب شِرَاءِ الْعَقَارَاتِ وَ بَيْعِهَا ",
          "en": "Chapter 18 – Buying real estate and selling it"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:19",
    "titles": {
      "ar": "باب الدَّيْنِ ",
      "en": "Chapter 19 – The Debts"
    },
    "verse_count": 10,
    "verse_start_index": 8402,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/42)"
        ],
        "index": 8403,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:19:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تَعَوَّذُوا بِاللَّهِ مِنْ غَلَبَةِ الدَّيْنِ وَ غَلَبَةِ الرِّجَالِ وَ بَوَارِ الْأَيِّمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ibn Mahboub, from Abdul Rahman Bin Al Hajjaj, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Seek Refuge with Allah<sup>azwj</sup> from overwhelming by the debts and the overwhelming of the men and ruination of the widow’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad from ibn Mahbub from ‘Abd al-Rahman ibn Hajjaj from who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘You must seek protection with Allah against over- powering debts, dominating (increasing) number of men and single women.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/43)"
        ],
        "index": 8404,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:19:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُوسَى بْنِ بَكْرٍ قَالَ قَالَ لِي أَبُو الْحَسَنِ ( عليه السلام ) مَنْ طَلَبَ هَذَا الرِّزْقَ مِنْ حِلِّهِ لِيَعُودَ بِهِ عَلَى نَفْسِهِ وَ عِيَالِهِ كَانَ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ عَزَّ وَ جَلَّ ",
          "فَإِنْ غُلِبَ عَلَيْهِ فَلْيَسْتَدِنْ عَلَى اللَّهِ وَ عَلَى رَسُولِهِ مَا يَقُوتُ بِهِ عِيَالَهُ فَإِنْ مَاتَ وَ لَمْ يَقْضِهِ كَانَ عَلَى الْإِمَامِ قَضَاؤُهُ فَإِنْ لَمْ يَقْضِهِ كَانَ عَلَيْهِ وِزْرُهُ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ إِنَّمَا الصَّدَقاتُ لِلْفُقَراءِ وَ الْمَساكِينِ وَ الْعامِلِينَ عَلَيْها إِلَى قَوْلِهِ وَ الْغارِمِينَ فَهُوَ فَقِيرٌ مِسْكِينٌ مُغْرَمٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Musa Bin Bakr who said, ",
            "‘Abu Al-Hassan<sup>asws</sup> said to me: ‘The one who seeks this sustenance from its Permissible means in order to assist by it upon himself and his family would be like the combatant in the Way of Allah<sup>azwj</sup> Mighty and Majestic. ",
            "So if he is overwhelmed upon (by poverty), so let him borrow upon Allah<sup>azwj</sup> and upon His<sup>azwj</sup> Rasool<sup>saww</sup> what he can provide with for his family. So if he were to die and he has not paid it back, it would be upon the Imam<sup>asws</sup> to fulfil it. So if he<sup>asws</sup> does not fulfil it, its burden would be upon him<sup>asws</sup>. Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\">[9:60] But rather, the charities are only for the poor and the needy, and the officials (appointed) over them</span> – up to His<sup>azwj</sup> Words -<span class=\"ibTxt\"> and those in debts</span>, so he is the poor, needy, in debt’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from Yahya al- Halabiy for Mu‘awiyah ibn Wahab who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘We are told that a man from al-Ansar died while he owed two dinar to pay. The Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, did not perform Salat (prayer) on his dead body and said, “You must perform Salat (prayer) on the dead body of your companion.” (It was the case) until someone of his relatives guaranteed to pay the two dinars on his behalf.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘That is the right.’ He (the Imam) said, ‘The Messenger of Allah did so to teach people a lesson to pay back the debts they owe to each other and must not take the issue of debts lightly. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, passed away while he owed payable debts, al-Hassan, ‘Alayhi al-Salam, died while he owed payable debts and Al-Husayn, ‘Alayhi al-Salam, was murdered while he owed payable debts.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/44)"
        ],
        "index": 8405,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:19:3",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ حَمْدَانَ بْنِ إِبْرَاهِيمَ الْهَمْدَانِيِّ رَفَعَهُ إِلَى بَعْضِ الصَّادِقِينَ ( عليهما السلام ) قَالَ إِنِّي لَأُحِبُّ لِلرَّجُلِ أَنْ يَكُونَ عَلَيْهِ دَيْنٌ يَنْوِي قَضَاءَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Hamdan Bin Ibrahim Al Hamdany, ",
            "(It has been narrated) raising it to one of the two truthful ones (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) having said: ‘I<sup>asws</sup> love it for the man there happen to be debts upon him, intending its fulfilment (payment)’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Musa ibn Bakr who has said the following: “Abu al-Hassan, ‘Alayhi al-Salam, said to me, ‘Whoever works to provide sustenance for himself and his family is considered a Mujahid (fighter) for the cause of Allah, most Majestic, most Glorious. If poverty over-powers him, he then should borrow upon the responsibility of Allah and His Messenger for his sustenance and his family. If he dies and cannot pay back, it then becomes the responsibility of the Imam to pay it. If he did not do so, he will be held responsible. Allah, most Majestic, most Glorious, says, ‘Charities are for the poor, destitute and the charity (tax) collectors . . . ., and those suffering bankruptcy.’ (9:61) He is poor, destitute and bankrupt.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/44)"
        ],
        "index": 8406,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:19:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ رَجُلٍ مِنْ أَهْلِ الْجَزِيرَةِ يُكَنَّى أَبَا مُحَمَّدٍ قَالَ سَأَلَ الرِّضَا ( عليه السلام ) رَجُلٌ وَ أَنَا أَسْمَعُ فَقَالَ لَهُ جُعِلْتُ فِدَاكَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ وَ إِنْ كانَ ذُو عُسْرَةٍ فَنَظِرَةٌ إِلى مَيْسَرَةٍ أَخْبِرْنِي عَنْ هَذِهِ النَّظِرَةِ الَّتِي ذَكَرَهَا اللَّهُ عَزَّ وَ جَلَّ فِي كِتَابِهِ لَهَا حَدٌّ يُعْرَفُ إِذَا صَارَ هَذَا الْمُعْسِرُ إِلَيْهِ لَا بُدَّ لَهُ مِنْ أَنْ  يُنْتَظَرَ وَ قَدْ أَخَذَ مَالَ هَذَا الرَّجُلِ وَ أَنْفَقَهُ عَلَى عِيَالِهِ وَ لَيْسَ لَهُ غَلَّةٌ يُنْتَظَرُ إِدْرَاكُهَا وَ لَا دَيْنٌ يُنْتَظَرُ مَحِلُّهُ وَ لَا مَالٌ غَائِبٌ يُنْتَظَرُ قُدُومُهُ ",
          "قَالَ نَعَمْ يُنْتَظَرُ بِقَدْرِ مَا يَنْتَهِي خَبَرُهُ إِلَى الْإِمَامِ فَيَقْضِي عَنْهُ مَا عَلَيْهِ مِنْ سَهْمِ الْغَارِمِينَ إِذَا كَانَ أَنْفَقَهُ فِي طَاعَةِ اللَّهِ عَزَّ وَ جَلَّ فَإِنْ كَانَ قَدْ أَنْفَقَهُ فِي مَعْصِيَةِ اللَّهِ فَلَا شَيْ‏ءَ لَهُ عَلَى الْإِمَامِ ",
          "قُلْتُ فَمَا لِهَذَا الرَّجُلِ الَّذِي ائْتَمَنَهُ وَ هُوَ لَا يَعْلَمُ فِيمَا أَنْفَقَهُ فِي طَاعَةِ اللَّهِ أَمْ فِي مَعْصِيَتِهِ قَالَ يَسْعَى لَهُ فِي مَالِهِ فَيَرُدُّهُ عَلَيْهِ وَ هُوَ صَاغِرٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Suleyman, from a man from the people of Al Jazeera (Algeria) teknonymed as Abu Muhammad who said, ",
            "‘A man asked Al-Reza<sup>asws</sup> and I was listening, so he said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\">[2:280] And if (the debtor) is in straitness, then let there be postponement until (he is in) ease</span>. Inform me about this postponement which Allah<sup>azwj</sup> Mighty and Majestic has Mentioned it in His<sup>azwj</sup> Book. Is there a limit by which it can be recognised until when this one can postpone upon the straitened one, and he has taken the wealth of this man, and spent it upon his family, and there is produce he is waiting for its harvest, nor a debt awaiting its term of collection, nor any unknown wealth he is waiting to come to him?’ ",
            "He<sup>asws</sup> said: ‘Yes. He should postpone by a measurement of what its news would end up to the Imam<sup>asws</sup>, so he<sup>asws</sup> would pay it on his behalf whatever is upon him, from the share of the creditors, if he had spent it in obedience to Allah<sup>azwj</sup> Mighty and Majestic. So if he had spent it in disobedience to Allah<sup>azwj</sup>, so there is nothing for him upon the Imam<sup>asws</sup>’. ",
            "I said, ‘So what is for this man who entrusted him, and he does not know regarding what he has spent it, in obedience to Allah<sup>azwj</sup> or in the disobedience to Him<sup>azwj</sup>?’ He<sup>asws</sup> said: ‘He has to work regarding his wealth, so he would return it to him, and he is belittled’."
          ],
          "en.sarwar": [
            "4. Ahmad ibn Muhammad from has narrated from Hamdan ibn Ibrahim al- Hamadaniy in a in a marfu’ manner from the truthful ones who has narrated the following: “He (the Imam), ‘Alayhi al-Salam, has said, ‘I like for a man, who is indebted, to sincerely have the intention of paying it off.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/44)"
        ],
        "index": 8407,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:19:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ [عَنِ ابْنِ أَبِي عُمَيْرٍ] عَنْ حَنَانِ بْنِ سَدِيرٍ عَنْ أَبِيهِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كُلُّ ذَنْبٍ يُكَفِّرُهُ الْقَتْلُ فِي سَبِيلِ اللَّهِ عَزَّ وَ جَلَّ إِلَّا الدَّيْنَ لَا كَفَّارَةَ لَهُ إِلَّا أَدَاؤُهُ أَوْ يَقْضِيَ صَاحِبُهُ أَوْ يَعْفُوَ الَّذِي لَهُ الْحَقُّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hanan Bin Sadeyr, from his father, ",
            "(It has been narrated) from Ibn Ja’far<sup>asws</sup> having said: ‘Every sin is expiated by being killed in the Way of Allah<sup>azwj</sup> Mighty and Majestic except for the debts. There is no expiation for it except its payment, or the debtor fulfils it, or he excuses it, the one for whom is the right’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Muhammad ibn Al-Husayn from Muhammad ibn Sulayman from a man of the people of al- Jazirah called abu Muhammad who has said the following: “A man asked al-Rida’, ‘Alayhi al-Salam, when I was listening, ‘I pray to Allah to keep my soul in service for your cause, Allah, most Majestic, most Glorious, says, “If one has difficulty to pay his debts, he should be given respite until he is able to pay.” (2:281) Explain to me the limits of this “respite” of which Allah, most Majestic, most Glorious, has spoken in His book. When a person with such difficulties is required to pay back? He has taken from the properties of the lender to spend on his family. He does not have any farm to wait for the harvest season, has not lent money to anyone to wait for payment time or an amount of lost property that he hopes will be found.’ He (the Imam) said, ‘He is given respite until the Imam is informed about his condition who will pay on his behalf of the share of the bankrupt people, if he has spent what he has borrowed in obedience to Allah, most Majestic, most Glorious. If he has spent in disobedience to Allah, then the Imam is not responsible for his debts.’ I (the narrator) then asked, ‘What happens if the lender who trusted him and did not know if he (borrower) spends it in obedience or disobedience to the command of Allah?’ He (the Imam) said, ‘He can try to get back what he has lent from the properties of the borrowers who must yield.” (Fatwa best explains the last part of the above case.) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/45)"
        ],
        "index": 8408,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:19:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْعَبَّاسِ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْإِمَامُ يَقْضِي عَنِ الْمُؤْمِنِينَ الدُّيُونَ مَا خَلَا مُهُورَ النِّسَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Abbas, from the one who mentioned it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Imam<sup>asws</sup> fulfils from the Believer what they are owing, except for the dowries of the women’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from [ibn abu ‘Umayr] from Hanan ibn Sadir from his father who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘Being killed for the cause of Allah, most Majestic, most Glorious, serves as expiation for all kinds of sins except debts, for which there is no expiation other than paying it back or those liable pay or the owner of the lending right waives it in favor of the borrower.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/45)"
        ],
        "index": 8409,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:19:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْوَلِيدِ بْنِ صَبِيحٍ قَالَ جَاءَ رَجُلٌ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) يَدَّعِي عَلَى الْمُعَلَّى بْنِ خُنَيْسٍ دَيْناً عَلَيْهِ فَقَالَ ذَهَبَ بِحَقِّي فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) ذَهَبَ بِحَقِّكَ الَّذِي قَتَلَهُ ثُمَّ قَالَ لِلْوَلِيدِ قُمْ إِلَى الرَّجُلِ فَاقْضِهِ مِنْ حَقِّهِ فَإِنِّي أُرِيدُ أَنْ أُبَرِّدَ عَلَيْهِ جِلْدَهُ الَّذِي كَانَ بَارِداً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad Bin Usman, from Al Waleed Bin Sabeeh who said, ",
            "‘A man came over to Abu Abdullah<sup>asws</sup> demanding a debt which was upon Al-Moalla Bin Khunays, so he said, ‘He has gone away with my right’. So Abu Abdullah<sup>asws</sup> said to him: ‘It was the one who killed him that went away with your right’. Then he<sup>asws</sup> said to Al-Waleed: ‘Stand up to the man, so fulfil his right, for I<sup>asws</sup> wanted that his skin be cooled upon him which was already cold’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-‘ Abbas the one whom he has mentioned (in his book) who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘The Imam pays off the debts of the believing people except Muhur (dowry) of women.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/45)"
        ],
        "index": 8410,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:19:8",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ عُثْمَانَ بْنِ سَعِيدٍ عَنْ عَبْدِ الْكَرِيمِ مِنْ أَهْلِ هَمَدَانَ عَنْ أَبِي ثُمَامَةَ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ الثَّانِي ( عليه السلام ) إِنِّي أُرِيدُ أَنْ أَلْزَمَ مَكَّةَ أَوِ الْمَدِينَةَ وَ عَلَيَّ دَيْنٌ فَمَا تَقُولُ فَقَالَ ارْجِعْ فَأَدِّهِ إِلَى مُؤَدَّى دَيْنِكَ وَ انْظُرْ أَنْ تَلْقَى اللَّهَ تَعَالَى وَ لَيْسَ عَلَيْكَ دَيْنٌ إِنَّ الْمُؤْمِنَ لَا يَخُونُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Muhammad Bin Isa, from Usman Bin Saeed, from Abdul Kareem, from the people of Hamdan, fro, Abu Samama who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup>, ‘I want to reside in Makkah or Al-Medina, and upon me are debts. So what are you<sup>asws</sup> saying?’ So he<sup>asws</sup> said: ‘Return and pay your debt to the demander, and wait, and meet Allah<sup>azwj</sup> the Exalted and there is no debt upon you. A Believer does not betray’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad ibn ‘Isa from al-Walid ibn Sabih who has said the following: “Once a man came to abu ‘Abd Allah, ‘Alayhi al-Salam, saying that al-Mu‘alla’ ibn Khunays owed him a certain amount and said, ‘He has destroyed my rights.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘Your rights are destroyed by the one who murdered him (al-Mu‘alla’).’ He (the Imam) then told al- Walid to pay back his rights, ‘I like to cool down his skin which was cool already.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/45)"
        ],
        "index": 8411,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:19:9",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ إِسْحَاقَ بْنِ مُحَمَّدٍ النَّخَعِيِّ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ فَضَالَةَ عَنْ مُوسَى بْنِ بَكْرٍ قَالَ مَا أُحْصِي مَا سَمِعْتُ أَبَا الْحَسَنِ مُوسَى ( عليه السلام ) يُنْشِدُ  فَإِنْ يَكُ يَا أُمَيْمُ عَلَيَّ دَيْنٌ فَعِمْرَانُ بْنُ مُوسَى يَسْتَدِينُ "
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Is’haq Bin Muhammad Al Nakhaie, from Muhammad Bin Jamhour, from Fazalat, from Musa Bin Bakr who said, ",
            "‘I heard Abu Al-Hassan Musa<sup>asws</sup> reciting a prose: ‘O mother! If I<sup>asws</sup> were to be with debts upon me<sup>asws</sup>, so Imran<sup>as</sup>, his<sup>as</sup> son<sup>as</sup> Musa<sup>as</sup> was indebted’."
          ],
          "en.sarwar": [
            "9. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from Muhammad ibn ‘Isa from ‘Uthman ibn Sa‘id from ‘Abd al-karim, of the people of Hamadan from abu Thumamah who has said the following: “I once said to abu Ja‘far, al-Thaniy, ‘Alayhi al-Salam, ‘I like to reside in Makkah or al-Madinah, but there is a certain amount of debt that I must pay. What do you advise me to do?’ He (the Imam) said, ‘You must return to pay off what you owe, and bear in mind that you must go before Allah, most High, when there is no debts due on you. A believing person does not commit treachery.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/46)"
        ],
        "index": 8412,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:19:10",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الْأَشْعَرِيِّ عَنِ ابْنِ الْقَدَّاحِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) عَنْ آبَائِهِ عَنْ عَلِيٍّ ( عليه السلام ) قَالَ إِيَّاكُمْ وَ الدَّيْنَ فَإِنَّهُ مَذَلَّةٌ بِالنَّهَارِ وَ مَهَمَّةٌ بِاللَّيْلِ وَ قَضَاءٌ فِي الدُّنْيَا وَ قَضَاءٌ فِي الْآخِرَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ja’far Bin Muhammad Al Ashary, from Ibn Al Qaddah, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> from his<sup>asws</sup> forefathers<sup>asws</sup>, from Ali<sup>asws</sup> having said: ‘Beware of the debts, for these are a humiliation during the day and a stress during the night, and has to be paid for in the world and in the Hereafter’."
          ],
          "en.sarwar": [
            "10. Ali ibn Muhammad has narrated from Ishaq ibn Muhammad al-Nakha’iy from Muhammad ibn Jumhur from Fadalah from Musa ibn Bakr who has said the following: “I heard abu al-Hassan, Musa, ‘Alayhi al-Salam, read the following: ‘O mother, if I may become indebted (consider) that Moses son of ‘Imran would also borrow.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/46)"
        ],
        "part_type": "Hadith",
        "text": [
          "11- عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الأشْعَرِيِّ عَنِ ابْنِ الْقَدَّاحِ عَنْ أَبِي عَبْدِ اللهِ (عَلَيْهِ السَّلام) عَنْ آبَائِهِ عَنْ عَلِيٍّ (عَلَيْهِ السَّلام) قَالَ إِيَّاكُمْ وَالدَّيْنَ فَإِنَّهُ مَذَلَّةٌ بِالنَّهَارِ وَمَهَمَّةٌ بِاللَّيْلِ وَقَضَاءٌ فِي الدُّنْيَا وَقَضَاءٌ فِي الآخِرَةِ. "
        ],
        "translations": {
          "en.sarwar": [
            "11. A number of our people have narrated from Sahl ibn Ziyad from Ja’far ibn Muhammad al-Ash’ariy from ibn al-Qaddah who has said the following: “Abu ‘Abd Allah, from his ancestors from Ali, ‘Alayhi al-Salam, has stated this Hadith. ‘Beware of debts; it humiliates during the day and causes sadness during the night and it is payable both in this world and in the hereafter.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:19",
  "kind": "verse_list"
}