{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 29"
        },
        "path": "/books/al-kafi:5:2:29",
        "titles": {
          "ar": "باب الْكَفَالَةِ وَ الْحَوَالَةِ ",
          "en": "Chapter 29 – The Warranty and the Assignment"
        }
      }
    ],
    "index": 1241,
    "local_index": 29,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 30"
        },
        "path": "/books/al-kafi:5:2:30",
        "titles": {
          "ar": "باب عَمَلِ السُّلْطَانِ وَ جَوَائِزِهِمْ ",
          "en": "Chapter 30 – Office-bearers for the Sultan (ruling authority) and their recompense"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 28"
        },
        "path": "/books/al-kafi:5:2:28",
        "titles": {
          "ar": "باب هَدِيَّةِ الْغَرِيمِ",
          "en": "Chapter 28 – Gifting by the creditor"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:29",
    "titles": {
      "ar": "باب الْكَفَالَةِ وَ الْحَوَالَةِ ",
      "en": "Chapter 29 – The Warranty and the Assignment"
    },
    "verse_count": 6,
    "verse_start_index": 8444,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/58)"
        ],
        "index": 8445,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/123",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/525",
              "text": "حَفْصِ بْنِ الْبَخْتَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:29:1",
        "text": [
          " أَبْطَأْتُ عَنِ الْحَجِّ فَقَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَا أَبْطَأَ بِكَ عَنِ الْحَجِّ فَقُلْتُ جُعِلْتُ فِدَاكَ تَكَفَّلْتُ بِرَجُلٍ فَخَفَرَ بِي فَقَالَ مَا لَكَ وَ الْكَفَالَاتِ  أَ مَا عَلِمْتَ أَنَّهَا أَهْلَكَتِ الْقُرُونَ الْأُولَى ",
          "ثُمَّ قَالَ إِنَّ قَوْماً أَذْنَبُوا ذُنُوباً كَثِيرَةً فَأَشْفَقُوا مِنْهَا وَ خَافُوا خَوْفاً شَدِيداً وَ جَاءَ آخَرُونَ فَقَالُوا ذُنُوبُكُمْ عَلَيْنَا فَأَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ عَلَيْهِمُ الْعَذَابَ ثُمَّ قَالَ تَبَارَكَ وَ تَعَالَى خَافُونِي وَ اجْتَرَأْتُمْ عَلَيَّ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim from his father, and Muhammad Bin Ismail from Al Fazl, altogether from Ibn Abu Umeyr, from Hafs Bin Al Bakhtary who said, ",
            "‘I was delayed about the Hajj, so Abu Abdullah<sup>asws</sup> said to me: ‘What is the delay with you about the Hajj?’ So I said, ‘May I be sacrificed for you<sup>asws</sup>! I guaranteed (money) for a man, but he shamed me (did not fulfil his responsibility)’. So he<sup>asws</sup> said: ‘What is it to you and the guarantee? Do you not know that it has destroyed the former generations?’ ",
            "Then he<sup>asws</sup> said: ‘A people sinned with numerous sins, so some of them felt pity and they feared with an intense fearing, and the others came over, so they said, ‘Your sins are upon us’. So Allah<sup>azwj</sup> Mighty and Majestic Sent down the Punishment upon them. Then the Blessed and High Said: “You are fearing Me<sup>azwj</sup> and are being audacious (disrespectful) to Me<sup>azwj</sup>?”’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father and Muhammad ibn ‘Isma’il has narrated from af-Fadf ibn Shadhan all from ibn abu ‘Umayr from Hafs ibn al-Bakhtariy who has said the following: “I once remained behind from performing al-Hajj and abu ‘ Abd Allah, ‘Alayhi al-Salam, asked, ’What caused you to remain behind from performing al-Hajj ? 5 I replied, ’I pray to Allah to keep my soul in service for your cause, I bailed out a person but he violated his responsibility . 5 He (the Imam) said, ‘What do you have to do with bailsman-ship? Did you not know that people of the centuries before were destroyed ? 5 He (the Imam) then said, ‘A people committed a great many sins. They then became severely afraid. Another people came to them and said, ‘Your sins are upon us . 5 Allah, most Majestic, most Glorious, sent upon them suffering and He most Blessed, most High, said, ‘You were afraid of Me, then you defied Me . 555 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن والثاني ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/58)"
        ],
        "index": 8446,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/153",
              "text": "جَمِيلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/196",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4075",
              "text": "أَحَدِهِمَا ( عليهما السلام ) فِي الرَّجُلِ يُحِيلُ الرَّجُلَ بِمَالٍ كَانَ لَهُ عَلَى رَجُلٍ آخَرَ فَيَقُولُ لَهُ الَّذِي احْتَالَ بَرِئْتَ مِمَّا لِي عَلَيْكَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلٍ عَنْ زُرَارَةَ عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي الرَّجُلِ يُحِيلُ الرَّجُلَ بِمَالٍ كَانَ لَهُ عَلَى رَجُلٍ آخَرَ فَيَقُولُ لَهُ الَّذِي احْتَالَ بَرِئْتَ مِمَّا لِي عَلَيْكَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:29:2",
        "text": [
          " إِذَا أَبْرَأَهُ فَلَيْسَ لَهُ أَنْ يَرْجِعَ عَلَيْهِ وَ إِنْ لَمْ يُبْرِئْهُ فَلَهُ أَنْ يَرْجِعَ عَلَى الَّذِي أَحَالَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, form his father, from Ibn Abu Umeyr, from Jameel, from Zurara, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) regarding the man who transmitted the wealth of the man which was for him, to another man. So the one was owed the money said to him, ‘You are free (of responsibility) with what was for me, upon you’. He<sup>asws</sup> said: ‘When he freed him (from responsibility), so it is not for him that he should retract against him, and if he did not free him (from responsibility), so it would be for him that he has recourse upon the one whom transmitted it’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Jamil from Zurarah who has said the following: “About the case of an assignment if the assignee says to the debtor, ‘I wave in your favor what you owe me because of the assignment, one of the two Imam 5 , (abu Ja’far or abu ‘Abd Allah), ‘Alayhim al- Salam, has said, ‘If the assignee waves it in favor of the debtor he (assignee) loses the right to ask the debtor for any payment; but if he (the assignee) does not wave it in favor of the debtor, he (assignee) has the right to ask the assignor for payment . 555 Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn Hadid from Jamil from Zurarah has narrated from a similar Hadith. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/59)"
        ],
        "index": 8447,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:29:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ جَمِيلٍ عَنْ زُرَارَةَ عَنْ أَحَدِهِمَا ( عليهما السلام ) مِثْلَهُ .",
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الْكِنْدِيِّ عَنْ أَحْمَدَ بْنِ الْحَسَنِ الْمِيثَمِيِّ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي الْعَبَّاسِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) رَجُلٌ كَفَلَ لِرَجُلٍ بِنَفْسِ رَجُلٍ فَقَالَ إِنْ جِئْتَ بِهِ وَ إِلَّا عَلَيْكَ خَمْسُمِائَةِ دِرْهَمٍ قَالَ عَلَيْهِ نَفْسُهُ وَ لَا شَيْ‏ءَ عَلَيْهِ مِنَ الدَّرَاهِمِ فَإِنْ قَالَ عَلَيَّ خَمْسُمِائَةِ دِرْهَمٍ إِنْ لَمْ أَدْفَعْهُ إِلَيْكَ قَالَ تَلْزَمُهُ الدَّرَاهِمُ إِنْ لَمْ يَدْفَعْهُ إِلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "<span style=\"font-size: small\">Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Hadeed, from Jameel, from Zurara</span> (It has been narrated) - from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>), similar to it.",
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Al Kindy, from Ahmad Bin Al Hassan Al Maysami, from Aban Bin Usman, from Abu Al Abbas who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘A man guaranteed for a man, in the person (on behalf) of a man, so he said, ‘You either come up with him or else upon you would be five hundred Dirhams’. He<sup>asws</sup> said: ‘Upon him is (coming up) with him and there is nothing upon him from the Dirhams. So if he had said, ‘Upon me is five hundred Dirhams if I do not hand him over to you, the Dirhams would be necessitated upon him if he did not hand him over to him’."
          ],
          "en.sarwar": [
            "3. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad al-Kindiy from Ahmad ibn al-Hassan al-Mithamiy from Aban ibn ‘Uthman from abu al-‘Abbas who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who bails out a person assigning his own person as security, and the bailee says, ‘If you did not bring the bailed out person you must pay five hundred dirham . 5 He (the Imam) said, ‘The guarantor is required only to present himself and there is no dirham due on him. However, if the bailsman says, “I on failing to bring the bailed out person, will pay five hundred dirham , 55 payment of dirham becomes binding upon him if he does not present the bailed out person . 555 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/60)"
        ],
        "index": 8448,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2767",
              "text": "حُمَيْدٌ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/560",
              "text": "الْحَسَنِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/218",
              "text": "جَعْفَرِ بْنِ سَمَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/220",
              "text": "أَبَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/191",
              "text": "مَنْصُورِ بْنِ حَازِمٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "حُمَيْدٌ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ سَمَاعَةَ عَنْ أَبَانٍ عَنْ مَنْصُورِ بْنِ حَازِمٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:29:4",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يُحِيلُ عَلَى الرَّجُلِ بِالدَّرَاهِمِ أَ يَرْجِعُ عَلَيْهِ قَالَ لَا يَرْجِعُ عَلَيْهِ أَبَداً إِلَّا أَنْ يَكُونَ قَدْ أَفْلَسَ قَبْلَ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd, from Al Hassan Bin Muhammad, from Ja’far Bin Sama’at, from Aban, from Mansour Bin Hazim who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man who assigned upon the man with the Dirhams, can he retract against him?’ He<sup>asws</sup> said: ‘He cannot retract against him, ever, except if had become bankrupt before that’."
          ],
          "en.sarwar": [
            "4. Humayd has narrated from al-Hassan ibn Muhammad from Ja’far ibn Sama‘ah from Aban from Mansur ibn Hazim who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who assigns another man to collect a certain amount of dirham from his debtor; if the assignee can demand payment from the assignor. He (the Imam) said, ‘No, he can never do so unless the debtor was bankrupt before assignment . 555 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/60)"
        ],
        "index": 8449,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/50",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/30",
              "text": "الْحَسَنِ بْنِ عَلِيِّ بْنِ يَقْطِينٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/80",
              "text": "الْحُسَيْنِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ بَعْضِ أَصْحَابِنَا عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ يَقْطِينٍ عَنِ الْحُسَيْنِ بْنِ خَالِدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:29:5",
        "text": [
          " قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) جُعِلْتُ فِدَاكَ قَوْلُ النَّاسِ الضَّامِنُ غَارِمٌ قَالَ فَقَالَ لَيْسَ عَلَى الضَّامِنِ غُرْمٌ الْغُرْمُ عَلَى مَنْ أَكَلَ الْمَالَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from one of our companions, from Al Hassan Bin Ali Bin Yaqteen, from Al Husayn Bin Khalid who said, ",
            "‘I said to Abu Al-Hassan<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! The people are saying the guarantor is a loser’. So he<sup>asws</sup> said: ‘It is not upon the guarantor, a loss of the creditor, the loss is upon the one who ate the wealth’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from certain persons of our people from al-Hassan ibn Ali ibn Yaqtin from ibn Khalid who has said the following: “I once said to abu al-Hassan, ‘Alayhi al-Salam, I pray to Allah to keep my soul in service for your cause, what do you say about people’s saying, ‘The bailsman suffers loss . 5 He (the Imam) said, ‘The bailsman is not responsible for any loss. The one who has consumed the asset is responsible for the loss.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/60)"
        ],
        "index": 8450,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1976",
              "text": "عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:29:6",
        "text": [
          " أُتِيَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) بِرَجُلٍ تَكَفَّلَ بِنَفْسِ رَجُلٍ فَحَبَسَهُ فَقَالَ اطْلُبْ صَاحِبَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘They came to Amir Al-Momineen<sup>asws</sup> with a man who had guaranteed in person for a man. So he<sup>asws</sup> imprisoned him, and said: ‘Seek out your companion (the one whom he had guaranteed to present)’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from ‘Ammar who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that once a man who had presented his person to bail out another man was brought before ‘Amir al-Mu’minin who placed him in custody and commanded him to present the man whom he had bailed out.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:29",
  "kind": "verse_list"
}