{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 30"
        },
        "path": "/books/al-kafi:5:2:30",
        "titles": {
          "ar": "باب عَمَلِ السُّلْطَانِ وَ جَوَائِزِهِمْ ",
          "en": "Chapter 30 – Office-bearers for the Sultan (ruling authority) and their recompense"
        }
      }
    ],
    "index": 1242,
    "local_index": 30,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 31"
        },
        "path": "/books/al-kafi:5:2:31",
        "titles": {
          "ar": "باب شَرْطِ مَنْ أُذِنَ لَهُ فِي أَعْمَالِهِمْ ",
          "en": "Chapter 31 – The stipulations for the one who is allowed to be in their (government) workforce"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 29"
        },
        "path": "/books/al-kafi:5:2:29",
        "titles": {
          "ar": "باب الْكَفَالَةِ وَ الْحَوَالَةِ ",
          "en": "Chapter 29 – The Warranty and the Assignment"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:30",
    "titles": {
      "ar": "باب عَمَلِ السُّلْطَانِ وَ جَوَائِزِهِمْ ",
      "en": "Chapter 30 – Office-bearers for the Sultan (ruling authority) and their recompense"
    },
    "verse_count": 15,
    "verse_start_index": 8450,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/61)"
        ],
        "index": 8451,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/89",
              "text": "عَلِيِّ بْنِ أَسْبَاطٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1461",
              "text": "مُحَمَّدِ بْنِ عُذَافِرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ مُحَمَّدِ بْنِ عُذَافِرٍ عَنْ أَبِيهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:30:1",
        "text": [
          " قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا عُذَافِرُ إِنَّكَ تُعَامِلُ أَبَا أَيُّوبَ وَ الرَّبِيعَ فَمَا حَالُكَ إِذَا نُودِيَ بِكَ فِي أَعْوَانِ الظَّلَمَةِ ",
          "قَالَ فَوَجَمَ أَبِي فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَمَّا رَأَى مَا أَصَابَهُ أَيْ عُذَافِرُ إِنَّمَا خَوَّفْتُكَ بِمَا خَوَّفَنِي اللَّهُ عَزَّ وَ جَلَّ بِهِ ",
          "قَالَ مُحَمَّدٌ فَقَدِمَ أَبِي فَلَمْ يَزَلْ مَغْمُوماً مَكْرُوباً حَتَّى مَاتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Asbaat, from Muhammad Bin Uzafir, from his father who said, ",
            "‘Abu Abdullah<sup>asws</sup> said to me: ‘O Uzafir! You are dealing (co-operating) with Abu Ayoub and Al-Rabie, so what would your situation be when you are Called with among the supporters of the unjust ones?’",
            "He (the narrator) said, ‘My father was dumbfounded. So Abu Abdullah<sup>asws</sup> said to him when he<sup>asws</sup> saw what had hit him: ‘Yes, Uzafir! But rather, I<sup>asws</sup> have scared you with what Allah<sup>azwj</sup> Mighty and Majestic has Scared me<sup>asws</sup> with’.",
            "Muhammad (the narrator) said, ‘My father went forth and he did not cease to be gloomy, distressed, until he died’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Asbat from Muhammad ibn ‘Adha’fir from his father who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, once said to me, ‘O ‘Adha’fir, you cooperate with abu Ayyub and al-Rabi‘, how will your condition be when you will be called along with the helpers of unjust ones? He (the narrator) has said that my father became extremely depressed and abu ‘Abd Allah, ‘Alayhi al- Salam, upon seeing the condition of my father said, ‘O ‘Adha’fir, I alarmed you the way Allah, most Majestic, most Glorious, has alarmed me.’ Muhammad has said, ‘My father came home and continued to remain depressed until he died.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/61)"
        ],
        "index": 8452,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/110",
              "text": "هِشَامِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/345",
              "text": "مُحَمَّدِ بْنِ حُمْرَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1032",
              "text": "الْوَلِيدِ بْنِ صَبِيحٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ وَ مُحَمَّدِ بْنِ حُمْرَانَ عَنِ الْوَلِيدِ بْنِ صَبِيحٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:30:2",
        "text": [
          " دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَاسْتَقْبَلَنِي زُرَارَةُ خَارِجاً مِنْ عِنْدِهِ فَقَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا وَلِيدُ أَ مَا تَعْجَبُ مِنْ زُرَارَةَ سَأَلَنِي عَنْ أَعْمَالِ هَؤُلَاءِ أَيَّ شَيْ‏ءٍ كَانَ يُرِيدُ أَ يُرِيدُ أَنْ أَقُولَ لَهُ لَا فَيَرْوِيَ ذَلِكَ عَنِّي",
          "ثُمَّ قَالَ يَا وَلِيدُ مَتَى كَانَتِ الشِّيعَةُ تَسْأَلُ عَنْ أَعْمَالِهِمْ إِنَّمَا كَانَتِ الشِّيعَةُ تَقُولُ يُؤْكَلُ مِنْ طَعَامِهِمْ وَ يُشْرَبُ مِنْ شَرَابِهِمْ وَ يُسْتَظَلُّ بِظِلِّهِمْ مَتَى كَانَتِ الشِّيعَةُ تَسْأَلُ عَنْ هَذَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, and Muhammad Bin Humran, from Al Waleed Bin Sabeeh who said, ",
            "‘I went over to Abu Abdullah<sup>asws</sup>, so Zurara met me coming out from his<sup>asws</sup> presence. So Abu Abdullah<sup>asws</sup> said to me: ‘O Waleed! How strange of Zurara to ask me<sup>asws</sup> about being their (governmental) office-bearers! Which thing does he want? Does he want me<sup>asws</sup> to say no to him so he can report that from me<sup>asws</sup>?’.",
            "Then he<sup>asws</sup> said: ‘O Waleed! When did the Shiah (ever) asked about being their office-bearers? But rather, the Shiah were saying, ‘One can eat from their food, and drink from their drinks, and shelter by their shelters. When did the Shiah (ever) ask about this?’"
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hisham ibn Salim and Muhammad ibn Humran from al-Walid ibn Sabih who has said the following: “I once went to visit abu ‘Abd Allah, ‘Alayhi al-Salam, and I met Zurarah who received me when he was coming out of the presence of the Imam. He (the Imam) said to me, ‘O Walid, is it not strange to you that Zurarah asks me about working for these people? What does he want me to say? Does he want me to say no, so that he can narrate it from me?’ He (the Imam) then said, ‘O Walid, when did the Shi ’ah ask about working for them? The Shi ’ah would only say, ‘You can eat their food, use their drink and live under their protection.’ When did the Shi‘ah ask about it (working for them)?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/61)"
        ],
        "index": 8453,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2117",
              "text": "حَدِيدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ حَدِيدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:30:3",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ اتَّقُوا اللَّهَ وَ صُونُوا دِينَكُمْ بِالْوَرَعِ وَ قَوُّوهُ بِالتَّقِيَّةِ وَ الِاسْتِغْنَاءِ بِاللَّهِ عَزَّ وَ جَلَّ إِنَّهُ مَنْ خَضَعَ لِصَاحِبِ سُلْطَانٍ وَ لِمَنْ يُخَالِفُهُ عَلَى دِينِهِ طَلَباً لِمَا فِي يَدَيْهِ مِنْ دُنْيَاهُ  أَخْمَلَهُ اللَّهُ عَزَّ وَ جَلَّ وَ مَقَّتَهُ عَلَيْهِ وَ وَكَلَهُ إِلَيْهِ فَإِنْ هُوَ غَلَبَ عَلَى شَيْ‏ءٍ مِنْ دُنْيَاهُ فَصَارَ إِلَيْهِ مِنْهُ شَيْ‏ءٌ نَزَعَ اللَّهُ جَلَّ وَ عَزَّ اسْمُهُ الْبَرَكَةَ مِنْهُ وَ لَمْ يَأْجُرْهُ عَلَى شَيْ‏ءٍ يُنْفِقُهُ فِي حَجٍّ وَ لَا عِتْقِ [رَقَبَةٍ] وَ لَا بِرٍّ . "
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ibn Mahboub, from Hadeed who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Fear Allah<sup>azwj</sup>! Maintain your Religion with the piety, and strengthen it with the dissimulation and the self-sufficiency with Allah<sup>azwj</sup> Mighty and Majestic. The one who humbles himself in the company of the Sultan (ruling authority) and to the ones who oppose him upon his Religion, seeking thereby what is in their hands for his worldly (needs), Allah<sup>azwj</sup> Mighty and Majestic would Suppress him and Detest him, and Leave him to himself. However, if he were to succeed (in securing) something for his world, and something from it (from the enimies of Ahl Al-Bayt<sup>asws</sup>) comes over to him, Allah<sup>azwj</sup>, Majestic and Mighty is His<sup>azwj</sup> Name, would Snatch the Blessings from it, and would not Recompense him upon anything he spends upon regarding a Hajj, nor freeing of a neck, nor a righteous deed’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from ibn Mahbub from Hadid who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ‘You must maintain piety before Allah and protect your religion by means of restraint from sins and strengthen your religion by means of taqiyah (caution), and self-sufficiency with Allah, most Majestic, most Glorious. Whoever is submissive before al-Sultan and those who oppose one’s religion seeking thereby the worldly things in their hands, Allah, most Majestic, most Glorious, suppresses his mention and hates him and leaves him to his own self. If he finds something of the worldly things Allah will take away blessings thereof and will not reward him for anything that he may spend thereof for al-Hajj, setting free slaves or for any good cause.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/62)"
        ],
        "index": 8454,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1819",
              "text": "عَلِيُّ بْنُ مُحَمَّدِ بْنِ بُنْدَارَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/655",
              "text": "إِبْرَاهِيمَ بْنِ إِسْحَاقَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/656",
              "text": "عَبْدِ اللَّهِ بْنِ حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/118",
              "text": "عَلِيِّ بْنِ أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدِ بْنِ بُنْدَارَ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ عَنْ عَبْدِ اللَّهِ بْنِ حَمَّادٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:30:4",
        "text": [
          " كَانَ لِي صَدِيقٌ مِنْ كُتَّابِ بَنِي أُمَيَّةَ فَقَالَ لِي اسْتَأْذِنْ لِي عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَاسْتَأْذَنْتُ لَهُ عَلَيْهِ فَأَذِنَ لَهُ فَلَمَّا أَنْ دَخَلَ سَلَّمَ وَ جَلَسَ ثُمَّ قَالَ جُعِلْتُ فِدَاكَ إِنِّي كُنْتُ فِي دِيوَانِ هَؤُلَاءِ الْقَوْمِ فَأَصَبْتُ مِنْ دُنْيَاهُمْ مَالًا كَثِيراً وَ أَغْمَضْتُ فِي مَطَالِبِهِ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَوْ لَا أَنَّ بَنِي أُمَيَّةَ وَجَدُوا مَنْ يَكْتُبُ لَهُمْ وَ يَجْبِي لَهُمُ الْفَيْ‏ءَ وَ يُقَاتِلُ عَنْهُمْ وَ يَشْهَدُ جَمَاعَتَهُمْ لَمَا سَلَبُونَا حَقَّنَا وَ لَوْ تَرَكَهُمُ النَّاسُ وَ مَا فِي أَيْدِيهِمْ مَا وَجَدُوا شَيْئاً إِلَّا مَا وَقَعَ فِي أَيْدِيهِمْ.",
          "قَالَ فَقَالَ الْفَتَى جُعِلْتُ فِدَاكَ فَهَلْ لِي مَخْرَجٌ مِنْهُ قَالَ إِنْ قُلْتُ لَكَ تَفْعَلُ قَالَ أَفْعَلُ قَالَ لَهُ فَاخْرُجْ مِنْ جَمِيعِ مَا اكْتَسَبْتَ فِي دِيوَانِهِمْ فَمَنْ عَرَفْتَ مِنْهُمْ رَدَدْتَ عَلَيْهِ مَالَهُ وَ مَنْ لَمْ تَعْرِفْ تَصَدَّقْتَ بِهِ وَ أَنَا أَضْمَنُ لَكَ عَلَى اللَّهِ عَزَّ وَ جَلَّ الْجَنَّةَ قَالَ فَأَطْرَقَ الْفَتَى رَأْسَهُ طَوِيلًا ثُمَّ قَالَ قَدْ فَعَلْتُ جُعِلْتُ فِدَاكَ ",
          "قَالَ ابْنُ أَبِي حَمْزَةَ فَرَجَعَ الْفَتَى مَعَنَا إِلَى الْكُوفَةِ فَمَا تَرَكَ شَيْئاً عَلَى وَجْهِ الْأَرْضِ إِلَّا خَرَجَ مِنْهُ حَتَّى ثِيَابِهِ الَّتِي كَانَتْ عَلَى بَدَنِهِ قَالَ فَقَسَمْتُ لَهُ قِسْمَةً وَ اشْتَرَيْنَا لَهُ ثِيَاباً وَ بَعَثْنَا إِلَيْهِ بِنَفَقَةٍ قَالَ فَمَا أَتَى عَلَيْهِ إِلَّا أَشْهُرٌ قَلَائِلُ حَتَّى مَرِضَ فَكُنَّا نَعُودُهُ قَالَ فَدَخَلْتُ عَلَيْهِ يَوْماً وَ هُوَ فِي السَّوْقِ قَالَ فَفَتَحَ عَيْنَيْهِ ثُمَّ قَالَ لِي يَا عَلِيُّ وَفَى لِي وَ اللَّهِ صَاحِبُكَ قَالَ ثُمَّ مَاتَ ",
          "فَتَوَلَّيْنَا أَمْرَهُ فَخَرَجْتُ حَتَّى دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَلَمَّا نَظَرَ إِلَيَّ قَالَ يَا عَلِيُّ وَفَيْنَا وَ اللَّهِ لِصَاحِبِكَ قَالَ فَقُلْتُ صَدَقْتَ جُعِلْتُ فِدَاكَ هَكَذَا وَ اللَّهِ قَالَ لِي عِنْدَ مَوْتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad Bin Bundar, from Ibrahim Bin Is’haq, from Abdullah Bin Hammad, from Ali Bin Abu Hamza who said,",
            "‘There used to be a friend for me from the scribes (clerks) of the Clan of Umayya, so he said to me, ‘Get me permission to see Abu Abdullah<sup>asws</sup>’. So I sought permission for him to see him<sup>asws</sup>, and he<sup>asws</sup> permitted him. So when he came over, he greeted and was seated, then said, ‘May I be sacrificed for you<sup>asws</sup>! I was in the offices of these people (the Clan of Umayya), so I achieved a lot of wealth from their world, and I closed my eyes regarding their demands’. So Abu Abdullah<sup>asws</sup> said: ‘Had the Clan of Umayya not found the ones who could write for them, and obligate <span class=\"iTxt\">Al-Fey</span> for them, and fight on their behalf, and bearers of witness for their groups to what they have confiscated from us<sup>asws</sup> of our<sup>asws</sup> rights, and had the people neglected them and what is in their hands, they would not have found anything except for what falls into their hands’. ",
            "He (the narrator) said, ‘So the youth said, ‘May I be sacrificed for you<sup>asws</sup>! Is there any way out from it for me?’ He<sup>asws</sup> said, ‘If I<sup>asws</sup> were to tell you to do (something) would you do it?’ He said, ‘I would do it’. He<sup>asws</sup> said to him: ‘So take out the entirety of whatever you have earned in their offices. So for the one whom you recognise, return his wealth to him, and the one you do not recognise, give in charity with it, and I<sup>asws</sup> guarantee the Paradise for you, upon (the Guarantee of) Allah<sup>azwj</sup> Mighty and Majestic’. So the youth kept his head lowered for a long time, then said, ‘I will do it, may I be sacrificed for you<sup>asws</sup>’. ",
            "Ibn Abu Hamza (the narrator) said, ‘So the youth returned with us to Al-Kufa, and he did not leave anything upon the face of the earth except that he extracted from it, even his clothes which were upon his body. So I apportioned a share for him and we bought some clothes for him and send these over to him along with expenses. So there did not come upon him except for a few months until he fell sick, and we used to go to console him. So I went over to him one day and he was in the transit (about to die). So he opened his eyes, then said to me, ‘O Ali! By Allah<sup>azwj</sup>, your Master<sup>asws</sup> has kept his<sup>asws</sup> promise to me’. Then he died.",
            "So we looked after his affairs (funeral etc.) and I came out until I went over to Abu Abdullah<sup>asws</sup>. So when he<sup>asws</sup> looked at me, he<sup>asws</sup> said: ‘O Ali! By Allah<sup>azwj</sup>, we<sup>asws</sup> have kept our<sup>asws</sup> promise to your companion’. So I said, ‘You<sup>asws</sup> have spoken the truth, may I be sacrificed for you<sup>asws</sup>! By Allah<sup>azwj</sup>, this is how he said to me at the time of his death’."
          ],
          "en.sarwar": [
            "4. Ali ibn Muhammad ibn Bandar has narrated from Ibrahim ibn Ishaq from ‘Abd Allah ibn Hammad from Ali ibn abu Hamzah who has said the following: “I had a young friend who worked as clerk for Amawide rulers. He asked me to ask permission for a meeting with abu ‘Abd Allah, ‘Alayhi al-Salam, I asked for permission and it was granted. He came for the meeting, offered greeting of peace and sat down. He then said, ‘I pray to Allah to keep my soul in service for your cause, I worked in the offices of these people (Amawide rules) and I received from their world a large amount of wealth. I did not object to what he demanded.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, then said, ‘If the Amawides did not find people who would work for them as clerks, collect taxes for them, fight for them and join their community, our rights would not have been taken away from us. Had people left them alone with what they have in their hands, they would not find more than what they had.’” He (the narrator) has said, “The young man then asked, ‘I pray to Allah to keep my soul in service for your cause, is there a way for me to safety?’ He (the Imam) asked, ‘If I said, “Yes, there is a way” will you then follow?’ He replied, ‘Yes, I will follow.’ He (the Imam) said, ‘Come out of all that you have gained from their offices. Return all the properties of those people whom you can find and give in charity on behalf of those whom you cannot find. I guarantee for you paradise from Allah, most Majestic, most Glorious.’” He (the narrator) has said, “The young man bent down his head for a long time and then said, T have done it, I pray to Allah to keep my soul in service for your cause.’” Ibn abu Hamzah has said, “The young man returned with us to al-kufah. He did not leave anything on earth without moving himself away therefrom even clothes that he wore.” He (the narrator) has said “I then assigned a share for him. We bought clothes for him and provided him provisions. After a few months he became ill and we would visit him during his illness. After one day when he was about to die, he opened his eyes and then said to me, ‘O Ali, by Allah, your friend has kept his promise to me.’” He (the narrator) has said, “He died and we took care of his funeral. I then left to visit abu ‘Abd Allah, ‘Alayhi al-Salam. He (the Imam) looked at me and said, ‘O Ali, we by Allah fulfilled our commitment to your friend.’ He (the narrator) has said, T then said, “You have spoken the truth, I pray to Allah to keep my soul in service for your cause. This is what exactly he said at the time of his death.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/63)"
        ],
        "index": 8455,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/110",
              "text": "هِشَامِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي بَصِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:30:5",
        "text": [
          " سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ أَعْمَالِهِمْ فَقَالَ لِي يَا أَبَا مُحَمَّدٍ لَا وَ لَا مَدَّةَ قَلَمٍ إِنَّ أَحَدَهُمْ لَا يُصِيبُ مِنْ دُنْيَاهُمْ شَيْئاً إِلَّا أَصَابُوا مِنْ دِينِهِ مِثْلَهُ أَوْ قَالَ حَتَّى يُصِيبُوا مِنْ دِينِهِ مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, from Abu Baseer who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about being their (Clan of Umayya’s) office bearers, so he<sup>asws</sup> said to me: ‘O Abu Muhammad! No, and not (even) for a circumflex (a mark on a letter like <span class=\"iTxt\">Fatah</span>, <span class=\"iTxt\">Kisra</span> etc.) of a pen. One of you would not attain anything from their world except he would lose from his Religion similar to it’, or said: ‘Until he loses from his Religion, similar to it’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ibn abu ‘ Umayr from Hisham ibn Salim from abu Basir who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about working for them (sultans). He (the Imam) said, ‘O abu Muhammad, no, not even for moving a pen. For whatever one finds from them of the worldly things, one’s religion is harmed proportionately or that he (the Imam) said that until his religion is harmed; - uncertainty is from ibn abu ‘Umayr.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/63)"
        ],
        "index": 8456,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1520",
              "text": "ابْنُ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/110",
              "text": "هِشَامِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "ابْنُ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:30:6",
        "text": [
          " كُنْتُ قَاعِداً عِنْدَ أَبِي جَعْفَرٍ ( عليه السلام ) عَلَى بَابِ دَارِهِ بِالْمَدِينَةِ فَنَظَرَ إِلَى النَّاسِ يَمُرُّونَ أَفْوَاجاً فَقَالَ لِبَعْضِ مَنْ عِنْدَهُ حَدَثَ بِالْمَدِينَةِ أَمْرٌ فَقَالَ جُعِلْتُ فِدَاكَ وُلِّيَ الْمَدِينَةَ وَالٍ فَغَدَا النَّاسُ يُهَنِّئُونَهُ فَقَالَ إِنَّ الرَّجُلَ لَيُغْدَى عَلَيْهِ بِالْأَمْرِ تَهَنَّأَ بِهِ وَ إِنَّهُ لَبَابٌ مِنْ أَبْوَابِ النَّارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Abu Umeyr, from Hisham Bin Salim, from Muhammad Bin Muslim who said, ",
            "‘I was seated in the presence of Abu Ja’far<sup>asws</sup> at the door of his<sup>asws</sup> house at Al-Medina, so he<sup>asws</sup> looked at the people passing by in droves. So he<sup>asws</sup> said to someone in his<sup>asws</sup> presence: ‘Has an event occurred in Al-Medina?’ So he said, ‘May I be sacrificed for you<sup>asws</sup>! A (new) governor has been appointed, so the people are attending lunch to welcome him’. So he<sup>asws</sup> said: ‘The man is feeding for a matter to be congratulated by, and he is at the door from doors of the Fire’."
          ],
          "en.sarwar": [
            "6. Ibn abu ‘Umayr has narrated from Hisham ibn Salim who has said the following: “I once was sitting in the presence of abu Ja‘far, ‘Alayhi al-Salam, near the door of his house and he (the Imam) looked at the people passing in throngs and mobs. He (the Imam) asked someone near him, ‘Has anything happened in al-Madinah?’ He replied, ‘I pray to Allah to keep my soul in service for your cause, a new governor is assigned for al-Madinah and people are served lunch to welcome and congratulate him.’ He (the Imam) said, ‘The man serves people lunch to receive their congratulation and he is a door of the doors of the fire.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/63)"
        ],
        "index": 8457,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1520",
              "text": "ابْنُ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1706",
              "text": "بَشِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/66",
              "text": "ابْنِ أَبِي يَعْفُورٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "ابْنُ أَبِي عُمَيْرٍ عَنْ بَشِيرٍ عَنِ ابْنِ أَبِي يَعْفُورٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:30:7",
        "text": [
          " كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِذْ دَخَلَ عَلَيْهِ رَجُلٌ مِنْ أَصْحَابِنَا فَقَالَ لَهُ أَصْلَحَكَ اللَّهُ إِنَّهُ رُبَّمَا أَصَابَ الرَّجُلَ مِنَّا الضَّيْقُ أَوِ الشِّدَّةُ فَيُدْعَى إِلَى الْبِنَاءِ يَبْنِيهِ أَوِ النَّهَرِ يَكْرِيهِ أَوِ الْمُسَنَّاةِ يُصْلِحُهَا فَمَا تَقُولُ فِي ذَلِكَ ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَا أُحِبُّ أَنِّي عَقَدْتُ لَهُمْ عُقْدَةً أَوْ وَكَيْتُ لَهُمْ وِكَاءً وَ إِنَّ لِي مَا بَيْنَ لَابَتَيْهَا لَا وَ لَا مَدَّةً بِقَلَمٍ إِنَّ أَعْوَانَ الظَّلَمَةِ يَوْمَ الْقِيَامَةِ فِي سُرَادِقٍ مِنْ نَارٍ حَتَّى يَحْكُمَ اللَّهُ بَيْنَ الْعِبَادِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Abu Umeyr, from Basheer, from Ibn Abu Yafour who said, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup> when a man came over from our companions, so he said to him<sup>asws</sup>, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! Sometimes the man from among us is hit by the (financial) straitness, or the difficulty, and he is summoned (by the unjust governor) to the construction which he builds, or the canal which he digs, or the dam which he corrects. So what are you<sup>asws</sup> saying regarding that?’ ",
            "So Abu Abdullah<sup>asws</sup> said: ‘I<sup>asws</sup> do not like it that I<sup>asws</sup> should tie a knot for them, or tie up a bag for them, and that for me<sup>asws</sup> is what is between its final (end result). No, and not (even) for a circumflex (a mark on a letter like <span class=\"iTxt\">Fatah</span>, <span class=\"iTxt\">Kisra</span> etc.) with a pen. The supporters of the unjust, on the Day of Judgement, would be in pavilions of Fire until Allah<sup>azwj</sup> has Judged between the (other) servants’."
          ],
          "en.sarwar": [
            "7. Ibn abu ‘Umayr has narrated from Bashir from ibn abu Ya’fur who has said the following: “Once I was in the presence of abu ‘Abd Allah, ‘Alayhi al-Salam, when a certain man of our people came and said, ‘I pray to Allah to keep you well, one of us may face hardship and straitened conditions and is called to construct a building, work a canal or a dam. What is your decision in such case? He (the Imam) replied, ‘I do not like it. I have knotted for them a knot and tied down the opening end of the bag of ‘no’. It is no and not even the moving of a pen. The helpers of the unjust ones on the Day of Judgment will be kept in chambers of fire until Allah will judge all of His servants.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/63)"
        ],
        "index": 8458,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/31",
              "text": "مُحَمَّدِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3384",
              "text": "يَحْيَى بْنِ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ يَحْيَى بْنِ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:30:8",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) فُلَانٌ يُقْرِئُكَ السَّلَامَ وَ فُلَانٌ وَ فُلَانٌ فَقَالَ وَ عَلَيْهِمُ السَّلَامُ قُلْتُ يَسْأَلُونَكَ الدُّعَاءَ فَقَالَ وَ مَا لَهُمْ قُلْتُ حَبَسَهُمْ أَبُو جَعْفَرٍ فَقَالَ وَ مَا لَهُمْ وَ مَا لَهُ قُلْتُ اسْتَعْمَلَهُمْ فَحَبَسَهُمْ فَقَالَ وَ مَا لَهُمْ وَ مَا لَهُ أَ لَمْ أَنْهَهُمْ أَ لَمْ أَنْهَهُمْ أَ لَمْ أَنْهَهُمْ هُمُ النَّارُ هُمُ النَّارُ هُمُ النَّارُ ",
          "قَالَ ثُمَّ قَالَ اللَّهُمَّ اخْدَعْ عَنْهُمْ سُلْطَانَهُمْ قَالَ فَانْصَرَفْتُ مِنْ مَكَّةَ فَسَأَلْتُ عَنْهُمْ فَإِذَا هُمْ قَدْ أُخْرِجُوا بَعْدَ هَذَا الْكَلَامِ بِثَلَاثَةِ أَيَّامٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Yahya Bin Ibrahim Bin Muhajir who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘So and so conveys the greetings, and so and so, and so and so’. So he<sup>asws</sup> said: ‘And the greetings be upon them’. I said, ‘They are asking you<sup>asws</sup> for the supplication’. So he<sup>asws</sup> said: ‘And what is the matter with them?’ I said, ‘Abu Ja’far (Mansour the Caliph) has imprisoned them’. So he<sup>asws</sup> said: ‘And what is it with them and him?’ I said, ‘He employed them, and he imprisoned them’. So he<sup>asws</sup> said: ‘And what is it with them and him? Did I<sup>asws</sup> not forbid them? Did I<sup>asws</sup> not forbid them? Did I<sup>asws</sup> not forbid them? Torment of the Fire! Torment of the Fire! Torment of the Fire!’ ",
            "He (the narrator) said, ‘Then he<sup>asws</sup> said: ‘O Allah<sup>azwj</sup>! Decieve their Sultan (ruling authority) from them!’ So I left from Makkah. I asked around about them, so they had come out (of the prison) three days after that speech’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from Yahya ibn Ibrahim ibn Muhajir who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘So and so has offered you Salam (greeting of peace) and so also is so and so.’ He (the Imam) said, ‘Greeting of peace is upon them.’ I then said, ‘They request you to pray for them.’ He (the Imam) asked, ‘What is the matter with them?’ I said, ‘Abu Ja‘far, (Abbaside ruler) has imprisoned them.’ He (the Imam) then asked, ‘What they had to do with him and what had he to do with them?’ I replied, ‘He appointed them as his agents and then imprisoned them.’ ‘What is the matter with them and what is the matter with him? Had I not prohibited them, had I not prohibited, had I not prohibited them from the fire, from fire, from fire?’ He (the Imam) then said, ‘O Lord, plan for them against their ruler.’ I (the narrator) then left Makkah and asked about them and found out that they were released three days after (my) conversation (with him (the Imam)).” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/64)"
        ],
        "index": 8459,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/854",
              "text": "دَاوُدَ بْنِ زُرْبِيٍّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ دَاوُدَ بْنِ زُرْبِيٍّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:30:9",
        "text": [
          " أَخْبَرَنِي  مَوْلًى لِعَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) قَالَ كُنْتُ بِالْكُوفَةِ فَقَدِمَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) الْحِيرَةَ فَأَتَيْتُهُ فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ لَوْ كَلَّمْتَ دَاوُدَ بْنَ عَلِيٍّ أَوْ بَعْضَ هَؤُلَاءِ فَأَدْخُلَ فِي بَعْضِ هَذِهِ الْوِلَايَاتِ فَقَالَ مَا كُنْتُ لِأَفْعَلَ",
          "قَالَ فَانْصَرَفْتُ إِلَى مَنْزِلِي فَتَفَكَّرْتُ فَقُلْتُ مَا أَحْسَبُهُ مَنَعَنِي إِلَّا مَخَافَةَ أَنْ أَظْلِمَ أَوْ أَجُورَ وَ اللَّهِ لآَتِيَنَّهُ وَ لَأُعْطِيَنَّهُ الطَّلَاقَ وَ الْعَتَاقَ وَ الْأَيْمَانَ الْمُغَلَّظَةَ أَلَّا أَظْلِمَ أَحَداً وَ لَا أَجُورَ وَ لَأَعْدِلَنَّ ",
          "قَالَ فَأَتَيْتُهُ فَقُلْتُ جُعِلْتُ فِدَاكَ إِنِّي فَكَّرْتُ فِي إِبَائِكَ عَلَيَّ فَظَنَنْتُ أَنَّكَ إِنَّمَا مَنَعْتَنِي وَ كَرِهْتَ ذَلِكَ مَخَافَةَ أَنْ أَجُورَ أَوْ أَظْلِمَ وَ إِنَّ كُلَّ امْرَأَةٍ لِي طَالِقٌ وَ كُلَّ مَمْلُوكٍ لِي حُرٌّ عَلَيَّ وَ عَلَيَّ إِنْ ظَلَمْتُ أَحَداً أَوْ جُرْتُ عَلَيْهِ وَ إِنْ لَمْ أَعْدِلْ قَالَ كَيْفَ قُلْتَ قَالَ فَأَعَدْتُ عَلَيْهِ الْأَيْمَانَ فَرَفَعَ رَأْسَهُ إِلَى السَّمَاءِ فَقَالَ تَنَاوُلُ السَّمَاءِ أَيْسَرُ عَلَيْكَ مِنْ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, ",
            "(It has been narrated) from Dawood Bin Zurby a slave of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> who said, ‘I was at Al-Kufa, so Abu Abdullah<sup>asws</sup> proceded to Al-Hira. So I went over to him<sup>asws</sup> and said to him, ‘May I be sacrificed for you<sup>asws</sup>! If you<sup>asws</sup> could speak to Dawood Bin Ali or one of them, so that I could enter in one of these governorships’. So he<sup>asws</sup> said: ‘I<sup>asws</sup> will never do it’. ",
            "He (the narrator) said, ‘So I left to go to my house, and I thought about it. I said (to myself), ‘What I reckon is that he<sup>asws</sup> did not forbid me<sup>asws</sup> except out of fear that I would be unjust, or tyrannical. By Allah<sup>azwj</sup>! I shall go to him<sup>asws</sup>, and I shall (swear) with the divorce and the freeing (of slaves) and the harshest of the oaths that I will not be unjust to anyone nor be tyrannical, and I will do justice’. ",
            "He (the narrator) said, ‘So I went over to him<sup>asws</sup> and I said, ‘May I be sacrificed for you<sup>asws</sup>! I pondered over your refusal to me, so I thought that you<sup>asws</sup>, rather forbade me and disliked that out of fear that I would be tyrannical, or be unjust, and that I (swear) that every woman of mine be divorced, and every owned slave of mine be freed upon me if I were to be unjust to anyone, or be tyrannical upon him, and if I do not do justice’. He<sup>asws</sup> said: ‘How can you say (that)?’ So I repeated the oath upon him<sup>asws</sup>, so he<sup>asws</sup> raised his<sup>asws</sup> head towards the sky and said: ‘Attaining the sky is easier upon you from (being able to do) that (what you are claiming to do)’."
          ],
          "en.sarwar": [
            "9. Ali ibn Ibrahim has narrated from his father from ibn abu ‘ Umayr from Dawud ibn Zurbiy who has said the following: “A Mawla’ (servant or friend) of Ali ibn al-Husayn, ‘Alayhi al-Salam, told me, ‘I was in al-Kufah when abu ‘Abd Allah, ‘Alayhi al-Salam, came to al-Hirah and I went to see him. I said to him (the Imam), ‘I pray to Allah to keep my soul in service for your cause, can you speak to Dawud ibn Ali or others of these people to admit me in anyone of these states (government)?’ He (the Imam) said, ‘I will never do so.’ I then returned home and thought about it and said to myself that he (the Imam) did not refuse except for fear that I may do injustice and transgress. By Allah I will go to him and provide all kinds of guarantees and swear extremely seriously, like divorce, freeing slaves and so on, not to do injustice and transgression. I then went to him (the Imam) and said, ‘I pray to Allah to keep my soul in service for your cause, I thought about your refusal to speak for me and I thought you have refused and disliked it just because of your fear of my doing injustice and transgression against someone instead of acting with justice.’ He (the Imam) said, ‘Why did you say that?’ I then repeated my demand and swearing. He (the Imam) raised his head to the sky and said, ‘Your reaching the sky is easier than what you want me to do for you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/64)"
        ],
        "index": 8460,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/110",
              "text": "هِشَامِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2600",
              "text": "جَهْمِ بْنِ حُمَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ جَهْمِ بْنِ حُمَيْدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:30:10",
        "text": [
          " قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَ مَا تَغْشَى سُلْطَانَ هَؤُلَاءِ قَالَ قُلْتُ لَا قَالَ وَ لِمَ قُلْتُ فِرَاراً بِدِينِي قَالَ فَعَزَمْتَ عَلَى ذَلِكَ قُلْتُ نَعَمْ فَقَالَ لِي الْآنَ سَلِمَ لَكَ دِينُكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, from Jahm Bin Humeyd who said, ",
            "‘Abu Abdullah<sup>asws</sup> said to me: ‘Do you not take protection of their Sultan (ruling authorities)?’ I said, ‘No’. He<sup>asws</sup> said: ‘And why (not)?’ I said, ‘My Religion would flee from me’. He<sup>asws</sup> said: ‘So are you determined upon that?’ I said, ‘Yes’. So he<sup>asws</sup> said to me: ‘Now, your Religion is safe for you’."
          ],
          "en.sarwar": [
            "10. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hisham ibn Salim from Jahm ibn Humayd who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, once said to me, ‘Do you use the power of these people for cover?’ I replied, ‘No, I do not do so.’ He (the Imam) asked, ‘Why do you not do so?’ I replied, ‘It is because of my running away with my religion.’ He (the Imam) asked, ‘Are you determined in this issue?’ I replied, ‘Yes, I am determined.’ He (the Imam) said, ‘Now your religion is safe for you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/65)"
        ],
        "index": 8461,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/222",
              "text": "عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/162",
              "text": "الْقَاسِمِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1510",
              "text": "سُلَيْمَانَ الْمِنْقَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2085",
              "text": "فُضَيْلِ بْنِ عِيَاضٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ الْمِنْقَرِيِّ عَنْ فُضَيْلِ بْنِ عِيَاضٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:30:11",
        "relations": {
          "Mentions": [
            "/books/quran:6:45"
          ]
        },
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ أَشْيَاءَ مِنَ الْمَكَاسِبِ فَنَهَانِي عَنْهَا فَقَالَ يَا فُضَيْلُ وَ اللَّهِ لَضَرَرُ هَؤُلَاءِ عَلَى هَذِهِ الْأُمَّةِ أَشَدُّ مِنْ ضَرَرِ التُّرْكِ وَ الدَّيْلَمِ ",
          "قَالَ وَ سَأَلْتُهُ عَنِ الْوَرَعِ مِنَ النَّاسِ قَالَ الَّذِي يَتَوَرَّعُ عَنْ مَحَارِمِ اللَّهِ عَزَّ وَ جَلَّ وَ يَجْتَنِبُ هَؤُلَاءِ وَ إِذَا لَمْ يَتَّقِ الشُّبُهَاتِ وَقَعَ فِي الْحَرَامِ وَ هُوَ لَا يَعْرِفُهُ وَ إِذَا رَأَى الْمُنْكَرَ فَلَمْ يُنْكِرْهُ وَ هُوَ يَقْدِرُ عَلَيْهِ فَقَدْ أَحَبَّ أَنْ يُعْصَى اللَّهُ عَزَّ وَ جَلَّ وَ مَنْ أَحَبَّ أَنْ يُعْصَى اللَّهُ فَقَدْ بَارَزَ اللَّهَ عَزَّ وَ جَلَّ بِالْعَدَاوَةِ وَ مَنْ أَحَبَّ بَقَاءَ الظَّالِمِينَ فَقَدْ أَحَبَّ أَنْ يُعْصَى اللَّهُ ",
          "إِنَّ اللَّهَ تَعَالَى حَمِدَ نَفْسَهُ عَلَى هَلَاكِ الظَّالِمِينَ فَقَالَ فَقُطِعَ دابِرُ الْقَوْمِ الَّذِينَ ظَلَمُوا وَ الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Ali Bin Muhammad Al Qasany, from Al Qasim Bin Muhammad, from Suleyman Al Minqary, from Fuzayl Bin Iyaz who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about certain things from the earning, so he<sup>asws</sup> forbade me from these saying: ‘O Fuzayl! By Allah<sup>azwj</sup>! The harm of these (ruling authorities) upon this community is more severe that the harm of the Turks and the Daylam’. ",
            "He (the narrator) said, ‘And I asked about the abstention from the people. He<sup>asws</sup> said: ‘The one who abstains from the Prohibitions of Allah<sup>azwj</sup> Mighty and Majestic and keeps away from these (ruling authorities), and when he does not fear (refrain) the doubtful matters, he falls into the Prohibitions and he does not recognise it; and when he sees the evil so he does not deny it whereas he is able over it, so he loves to disobey Allah<sup>azwj</sup> Mighty and Majestic; and the one who loves to disobey Allah<sup>azwj</sup> so he has duelled against Allah<sup>azwj</sup> Mighty and Majestic with the enmity; and the one who loves the survival of the unjust ones so he has loved to disobey Allah<sup>azwj</sup>. ",
            "Allah<sup>azwj</sup> the Exalted has Praised Himself<sup>azwj</sup> upon the destruction of the unjust ones so He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h45\">[6:45]</a> So the roots of the people who were unjust were cut off; and all Praise is due to Allah, the Lord of the Worlds</span>’."
          ],
          "en.sarwar": [
            "11. Ali ibn Ibrahim has narrated from his father from and Ali ibn Muhammad al-Qasaniy from al-Qasim ibn Muhammad from Sulayman al-Minqariy from Fudayl ibn ‘Iyad who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about several issues of earning. He (the Imam) prohibited and said, ‘O Fudayl, the losses these people cause to this nation are more severe than the losses that Turks and Daylam may cause.’ He (the narrator) has said, ‘I then asked him (the Imam) about abstaining from people.’ He (the Imam) said, ‘Restraining (to stay away from sin) are those who restrain from committing what Allah, most Majestic, most Glorious, has made unlawful and to stay away from these people. If one does not stay away from doubtful matters, he becomes involved in unlawful matters. These people know it. When one sees an unlawful matter and does not dislike when he is able to do so, he has loved to disobey Allah, most Majestic, most Glorious, and one who loves to disobey Allah, has defied Allah, most Majestic, most Glorious, with animosity, and one who loves to see the unjust survive has loved to disobey Allah. Allah, most Blessed, most High, has praised Himself because of His destroying the unjust, ‘He then cut down the end of the people who had committed injustice, all praise belongs to Allah, cherisher of the worlds.’” ( 6 : 45 ) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/65)"
        ],
        "index": 8462,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " فِي قَوْلِ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:30:12",
        "relations": {
          "Mentions": [
            "/books/quran:11:13",
            "/books/quran:11:113"
          ]
        },
        "text": [
          " اللَّهِ عَزَّ وَ جَلَّ وَ لا تَرْكَنُوا إِلَى الَّذِينَ ظَلَمُوا فَتَمَسَّكُمُ النَّارُ قَالَ هُوَ الرَّجُلُ يَأْتِي السُّلْطَانَ  فَيُحِبُّ بَقَاءَهُ إِلَى أَنْ يُدْخِلَ يَدَهُ إِلَى كِيسِهِ فَيُعْطِيَهُ . "
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, ",
            "(It has been narrated) raising it from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:11#h113\">[11:113]</a> And do not incline towards those who are unjust, so the Fire would touch you</span>, he<sup>asws</sup> said: ‘He is the man who goes over to the Sultan (ruling authority), so he loves his remaining until such times as he (the ruler) enters his hand into his bag and gives him something’."
          ],
          "en.sarwar": [
            "12. A number of our people have narrated from Sahl ibn Ziyad in a marfu’ manner the following: “About the words of Allah, most Majestic, most Glorious, ‘You must not take sides with the unjust ones; consequently the fire will touch you,’ <a href=\"/#/books/quran:11#h13\">[11:13]</a> he (the Imam), ‘Alayhi al-Salam, has said, ‘This is a man who works with the sultan and loves his remaining in power so that he can have a hand in his achievements and receive grants from him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول وآخره مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/65)"
        ],
        "index": 8463,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "النَّضْرِ بْنِ سُوَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1555",
              "text": "مُحَمَّدِ بْنِ هِشَامٍ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1148",
              "text": "أَخْبَرَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ مُحَمَّدِ بْنِ هِشَامٍ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:30:13",
        "text": [
          " إِنَّ قَوْماً مِمَّنْ آمَنَ بِمُوسَى ( عليه السلام ) قَالُوا لَوْ أَتَيْنَا عَسْكَرَ فِرْعَوْنَ وَ كُنَّا فِيهِ وَ نِلْنَا مِنْ دُنْيَاهُ فَإِذَا كَانَ الَّذِي نَرْجُوهُ مِنْ ظُهُورِ مُوسَى ( عليه السلام ) صِرْنَا إِلَيْهِ فَفَعَلُوا ",
          "فَلَمَّا تَوَجَّهَ مُوسَى ( عليه السلام ) وَ مَنْ مَعَهُ إِلَى الْبَحْرِ هَارِبِينَ مِنْ فِرْعَوْنَ رَكِبُوا دَوَابَّهُمْ وَ أَسْرَعُوا فِي السَّيْرِ لِيَلْحَقُوا بِمُوسَى ( عليه السلام ) وَ عَسْكَرِهِ فَيَكُونُوا مَعَهُمْ فَبَعَثَ اللَّهُ عَزَّ وَ جَلَّ مَلَكاً فَضَرَبَ وُجُوهَ دَوَابِّهِمْ فَرَدَّهُمْ إِلَى عَسْكَرِ فِرْعَوْنَ فَكَانُوا فِيمَنْ غَرِقَ مَعَ فِرْعَوْنَ .",
          "وَ رَوَاهُ عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ حَقٌّ عَلَى اللَّهِ عَزَّ وَ جَلَّ أَنْ تَصِيرُوا مَعَ مَنْ عِشْتُمْ مَعَهُ فِي دُنْيَاهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin saeed, from Al Naar Bin Suweyd, from Muhammad Bin Hisham, from the one who informed him, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A group from the ones who believed in Musa<sup>as</sup> said, ‘If only we would go to the army of Pharaoh<sup>la</sup> and we could be in it, we would achieve from his<sup>la</sup> world. So when we see from the victory of Musa<sup>as</sup> we would go to him<sup>as</sup>’. So they did it.",
            "So when Musa<sup>as</sup> diverted along with the ones who were with him<sup>as</sup> fleeing towards the sea from Pharaoh<sup>la</sup>, they rode their animals and hastened in the riding in order to meet up with Musa<sup>as</sup> and his<sup>as</sup> army so that they could be with them. Allah<sup>azwj</sup> Mighty and Majestic Sent an Angel who struck the faces of their animals and returned them towards the army of Pharaoh<sup>la</sup>. Thus, they became from the ones who drowned along with Pharaoh<sup>la</sup>’.",
            "And it is reported from Ibn Fazzal, from Ali Bin Uqba, from one of our companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It is a right upon Allah<sup>azwj</sup> Mighty and Majestic that you come to be (in the Hereafter) along with the ones you lived with in his world’."
          ],
          "en.sarwar": [
            "13. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from Muhammad ibn Hisham from those whom he has mentioned who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said, ‘A people of those who believed in Musa, ‘Alayhi al- Salam decided to join the army of Pharaoh so that they can benefit from their worldly gains and if Musa ‘Alayhi al-Salam succeeded to join him. They did as they had decided to do. When Musa ‘Alayhi al-Salam and his followers went to the sea running away from Pharaoh, those people also rode their stumpers and rushed to join Musa ‘Alayhi al-Salam and his army to remain with them but Allah, most Majestic, most Glorious, sent an angel who turned the faces of their stumpers toward the Pharaoh and his army, as a result, they drowned along with those who drowned.”’ Ibn Faddal has narrated from Ali ibn ‘Uqbah from certain persons of our people who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘It is a right on Allah, most Majestic, most Glorious, to make you with those whom you loved in the world.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/65)"
        ],
        "index": 8464,
        "local_index": 14,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/114",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3385",
              "text": "عَلِيِّ بْنِ أَبِي رَاشِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2814",
              "text": "إِبْرَاهِيمَ بْنِ السِّنْدِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1563",
              "text": "يُونُسَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ عَلِيِّ بْنِ أَبِي رَاشِدٍ عَنْ إِبْرَاهِيمَ بْنِ السِّنْدِيِّ عَنْ يُونُسَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:30:14",
        "text": [
          " وَصَفْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَنْ يَقُولُ بِهَذَا الْأَمْرِ مِمَّنْ يَعْمَلُ عَمَلَ السُّلْطَانِ فَقَالَ إِذَا وَلُوكُمْ يُدْخِلُونَ عَلَيْكُمُ الرِّفْقَ وَ يَنْفَعُونَكُمْ فِي حَوَائِجِكُمْ قَالَ قُلْتُ مِنْهُمْ مَنْ يَفْعَلُ ذَلِكَ وَ مِنْهُمْ مَنْ لَا يَفْعَلُ قَالَ مَنْ لَمْ يَفْعَلْ ذَلِكَ مِنْهُمْ فَابْرَءُوا مِنْهُ بَرِئَ اللَّهُ مِنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Al Barqy, from Ali Bin Abu Rashid, from Ibrahim Bin Al Sandy, from Yunus Bin Ammar who said, ",
            "‘I described to Abu Abdullah<sup>asws</sup> the ones who are speaking with this matter (<span class=\"iTxt\">Wilayah</span>) from the ones who are office-bearers of the Sultan (ruling authority), so he<sup>asws</sup> said: ‘When they rule over you they would be including the leniency over you and they would be benefitting you regarding your needs’. I said, ‘Among them are the ones who do that and among them are ones who don’t’. He<sup>asws</sup> said: ‘The one who does not do that so disavow from him by the Disavowing of Allah<sup>azwj</sup> from him’."
          ],
          "en.sarwar": [
            "14. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad al-Barqiy from Ali ibn abu Rashid from Ibrahim ibn al-Sindiy from Yunus ibn Hammad who has said the following: “I once spoke to abu ‘Abd Allah, ‘Alayhi al-Salam, about certain people who believe in Divine Authority of ‘A’immah, ‘Alayhim al-Salam, but work for the Sultan. He (the Imam) said, ‘They have achieved authority, therefore, they benefit you and help you.’ I (the narrator) then said, ‘Certain ones among them do so and certain others do not do so. ‘He (the Imam) said, ‘You must denounce those of them who do not help and benefit you as Allah has denounced them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/66)"
        ],
        "index": 8465,
        "local_index": 15,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/300",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1112",
              "text": "حُمَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ حَمَّادٍ عَنْ حُمَيْدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:30:15",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي وُلِّيتُ عَمَلًا فَهَلْ لِي مِنْ ذَلِكَ مَخْرَجٌ فَقَالَ مَا أَكْثَرَ مَنْ طَلَبَ الْمَخْرَجَ مِنْ ذَلِكَ فَعَسُرَ عَلَيْهِ قُلْتُ فَمَا تَرَى قَالَ أَرَى أَنْ تَتَّقِيَ اللَّهَ عَزَّ وَ جَلَّ وَ لَا تَعُدْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Hammad, from Humeyd who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I am a government worker, so is there a way out for me from that?’ So he<sup>asws</sup> said: ‘How many are the ones who seek the way out from that but it is difficult upon them’. I said, ‘So what is your<sup>asws</sup> view?’ He<sup>asws</sup> said: ‘I<sup>asws</sup> see that you should be fearing Allah<sup>azwj</sup> Mighty and Majestic and not repeat it (working for the government)’."
          ],
          "en.sarwar": [
            "15. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from Hammad from Hamid who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about my becoming the in charge person of a certain work (for the sultan), if there is a way for me out of it. He (the Imam) said, ‘How many are those who want a way out but it becomes difficult for them.’ I then asked, ‘What is your decision? He (the Imam) said, ‘I say that you must remain pious before Allah, most Majestic, most Glorious, and do not go back to such work.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:30",
  "kind": "verse_list"
}