{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:5:2", "titles": {"ar": "كتاب الْمَعِيشَةِ", "en": "THE BOOK OF SUBSISTENCE"}}, {"indexed_titles": {"en": "Chapter 31"}, "path": "/books/al-kafi:5:2:31", "titles": {"ar": "باب شَرْطِ مَنْ أُذِنَ لَهُ فِي أَعْمَالِهِمْ ", "en": "Chapter 31 – The stipulations for the one who is allowed to be in their (government) workforce"}}], "index": 1242, "local_index": 31, "part_type": "Chapter", "path": "/books/al-kafi:5:2:31", "titles": {"ar": "باب شَرْطِ مَنْ أُذِنَ لَهُ فِي أَعْمَالِهِمْ ", "en": "Chapter 31 – The stipulations for the one who is allowed to be in their (government) workforce"}, "verse_count": 7, "verse_start_index": 8465, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 8466, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:2:31:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ الْحَسَنِ</span> الْهَاشِمِيُّ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ زِيَادِ بْنِ أَبِي سَلَمَةَ قَالَ دَخَلْتُ عَلَى أَبِي الْحَسَنِ مُوسَى ( عليه السلام ) فَقَالَ لِي يَا زِيَادُ إِنَّكَ لَتَعْمَلُ عَمَلَ  السُّلْطَانِ قَالَ قُلْتُ أَجَلْ قَالَ لِي وَ لِمَ قُلْتُ أَنَا رَجُلٌ لِي مُرُوءَةٌ وَ عَلَيَّ عِيَالٌ وَ لَيْسَ وَرَاءَ ظَهْرِي شَيْ‏ءٌ فَقَالَ لِي يَا زِيَادُ لَأَنْ أَسْقُطَ مِنْ حَالِقٍ فَأَتَقَطَّعَ قِطْعَةً قِطْعَةً أَحَبُّ إِلَيَّ مِنْ أَنْ أَتَوَلَّى لِأَحَدٍ مِنْهُمْ عَمَلًا أَوْ أَطَأَ بِسَاطَ أَحَدِهِمْ إِلَّا لِمَا ذَا قُلْتُ لَا أَدْرِي جُعِلْتُ فِدَاكَ ", "فَقَالَ إِلَّا لِتَفْرِيجِ كُرْبَةٍ عَنْ مُؤْمِنٍ أَوْ فَكِّ أَسْرِهِ أَوْ قَضَاءِ دَيْنِهِ يَا زِيَادُ إِنَّ أَهْوَنَ مَا يَصْنَعُ اللَّهُ بِمَنْ تَوَلَّى لَهُمْ عَمَلًا أَنْ يُضْرَبَ عَلَيْهِ سُرَادِقٌ مِنْ نَارٍ إِلَى أَنْ يَفْرُغَ اللَّهُ مِنْ حِسَابِ الْخَلَائِقِ ", "يَا زِيَادُ فَإِنْ وُلِّيتَ شَيْئاً مِنْ أَعْمَالِهِمْ فَأَحْسِنْ إِلَى إِخْوَانِكَ فَوَاحِدَةٌ بِوَاحِدَةٍ وَ اللَّهُ مِنْ وَرَاءِ ذَلِكَ يَا زِيَادُ أَيُّمَا رَجُلٍ مِنْكُمْ تَوَلَّى لِأَحَدٍ مِنْهُمْ عَمَلًا ثُمَّ سَاوَى بَيْنَكُمْ وَ بَيْنَهُمْ فَقُولُوا لَهُ أَنْتَ مُنْتَحِلٌ كَذَّابٌ يَا زِيَادُ إِذَا ذَكَرْتَ مَقْدُرَتَكَ عَلَى النَّاسِ فَاذْكُرْ مَقْدُرَةَ اللَّهِ عَلَيْكَ غَداً وَ نَفَادَ مَا أَتَيْتَ إِلَيْهِمْ عَنْهُمْ وَ بَقَاءَ مَا أَتَيْتَ إِلَيْهِمْ عَلَيْكَ ."], "translations": {"en.hubeali": ["Al Husayn Bin Al Hassan Al Hashimy, from Salih Bin Abu Hammad, from Muhammad Bin Khalid, from Ziyad Bin Abu Salma who said, ", "‘I went over to Abu Al-Hassan Musa<sup>asws</sup>, so he<sup>asws</sup> said to me: ‘O Ziyad! You are working as an office-bearer of the Sultan (ruling authority)?’ I said, ‘Yes’. He<sup>asws</sup> said to me: ‘And why?’ I said, ‘I am a man with magnanimity for me, and upon me are dependents, and there is nothing upon my back (no wealth)’. So he<sup>asws</sup> said to me: ‘O Ziyad! If I<sup>asws</sup> were to fall down from a high mountain and be cut into pieces and pieces, it would be more beloved to me<sup>asws</sup> than I<sup>asws</sup> govern for anyone from them as an office-bearer, or roll out a carpet for one of them, except for that’ I said, ‘I do not understand, may I be sacrificed for you<sup>asws</sup>’.  ", "So he<sup>asws</sup> said: ‘Except for relieving the suffering of a Believer, or freeing his chains, or paying off his debts. O Ziyad! The easiest of what Allah<sup>azwj</sup> would Deal with the one who rules for them as an office-bearer is that He<sup>azwj</sup> would Set up over them pavilions of Fire until Allah<sup>azwj</sup> is Free from Reckoning the creatures.", "O Ziyad! So if you were to govern anything from their works, so reckon to your brethren, one with one (equal terms), and Allah<sup>azwj</sup> is from behind that (Backer). O Ziyad! Whichever man from you governs for anyone from them (government), so he treats equally between you and them, so say to him, ‘You are an impersonating liar’. O Ziyad! When you remember your power over the people so remember the Power of Allah<sup>azwj</sup> upon you tomorrow, and it will deplete what you give to them from them (government), and it would remain upon you what you give to them’."]}}, {"index": 8467, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:2:31:2", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ أَبِي نَجْرَانَ عَنِ ابْنِ سِنَانٍ عَنْ حَبِيبٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ ذُكِرَ عِنْدَهُ رَجُلٌ مِنْ هَذِهِ الْعِصَابَةِ قَدْ وُلِّيَ وَلَايَةً فَقَالَ كَيْفَ صَنِيعَتُهُ إِلَى إِخْوَانِهِ قَالَ قُلْتُ لَيْسَ عِنْدَهُ خَيْرٌ فَقَالَ أُفٍّ يَدْخُلُونَ فِيمَا لَا يَنْبَغِي لَهُمْ وَ لَا يَصْنَعُونَ إِلَى إِخْوَانِهِمْ خَيْراً ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Ibn Abu Najran, from Ibn Sinan, from Habeeb, from Abu Baseer, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It was mentioned in his<sup>asws</sup> presence, a man from this group who had become in charge of governmental affairs. So he<sup>asws</sup> said: ‘How does he deal with his brethren?’ I said, ‘There is no goodness in his presence’. So he<sup>asws</sup> said: ‘Uff! They are entering into what is not befitting for them and they are not doing anything good for their brethren!’"]}}, {"index": 8468, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:2:31:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَمَّنْ ذَكَرَهُ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ إِبْرَاهِيمَ بْنِ أَبِي مَحْمُودٍ عَنْ عَلِيِّ بْنِ يَقْطِينٍ قَالَ قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) مَا تَقُولُ فِي أَعْمَالِ هَؤُلَاءِ قَالَ إِنْ كُنْتَ لَا بُدَّ فَاعِلًا فَاتَّقِ أَمْوَالَ الشِّيعَةِ ", "قَالَ فَأَخْبَرَنِي عَلِيٌّ أَنَّهُ كَانَ يَجْبِيهَا مِنَ الشِّيعَةِ عَلَانِيَةً وَ يَرُدُّهَا عَلَيْهِمْ فِي السِّرِّ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from the one who mentioned it, from Ali Bin Asbat, from Ibrahim Bin Abu Mahmoud, from Ali Bin Yaqteen who said, ", "‘I said to Abu Al-Hassan<sup>asws</sup>, ‘What are you<sup>asws</sup> saying regarding being of their (governmental) workforce?’ He<sup>asws</sup> said: ‘If it was inevitable, so do it, but fear the wealth of the Shiah (for the government)’. ", "He (the narrator) said, ‘So Ali (Bin Al-Yaqteen) informed me that he would collect from the Shiah in the open, and was returning to them in the secrecy’."]}}, {"index": 8469, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:5:2:31:4", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْحَسَنِ بْنِ الْحُسَيْنِ الْأَنْبَارِيِّ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ كَتَبْتُ إِلَيْهِ أَرْبَعَةَ عَشَرَ سَنَةً أَسْتَأْذِنُهُ فِي عَمَلِ السُّلْطَانِ فَلَمَّا كَانَ فِي آخِرِ كِتَابٍ كَتَبْتُهُ إِلَيْهِ أَذْكُرُ أَنِّي أَخَافُ عَلَى خَبْطِ عُنُقِي وَ أَنَّ السُّلْطَانَ يَقُولُ لِي إِنَّكَ رَافِضِيٌّ وَ لَسْنَا نَشُكُّ فِي أَنَّكَ تَرَكْتَ الْعَمَلَ لِلسُّلْطَانِ لِلرَّفْضِ ", "فَكَتَبَ إِلَيَّ أَبُو الْحَسَنِ ( عليه السلام ) قَدْ فَهِمْتُ كِتَابَكَ وَ مَا ذَكَرْتَ مِنَ الْخَوْفِ عَلَى نَفْسِكَ فَإِنْ كُنْتَ تَعْلَمُ أَنَّكَ إِذَا وُلِّيتَ عَمِلْتَ فِي عَمَلِكَ بِمَا أَمَرَ بِهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) ثُمَّ تُصَيِّرُ أَعْوَانَكَ وَ كُتَّابَكَ أَهْلَ مِلَّتِكَ فَإِذَا صَارَ إِلَيْكَ شَيْ‏ءٌ وَاسَيْتَ بِهِ فُقَرَاءَ الْمُؤْمِنِينَ حَتَّى تَكُونَ وَاحِداً مِنْهُمْ كَانَ ذَا بِذَا وَ إِلَّا فَلَا ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, form Ali Bin Al Hakam, from Al Hassan Bin Al Husayn Al Anbary, ", "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup>, said, ‘I wrote to him<sup>asws</sup> for fourteen years seeking permission regarding working for the Sultan (ruling authorities). So when it my last letter to him<sup>asws</sup>, I mentioned that I am fearing of the strike upon my neck and that the ruling authorities are saying to me, ‘You are a rejector (<span class=\"iTxt\">Rafizy</span>), and we have no doubts that you are neglecting the working for the Sultan due to the rejection (of our beliefs)’. ", "So Abu Al-Hassan<sup>asws</sup> wrote back to me: ‘I<sup>asws</sup> have understood your letter and what you mentioned from the fear upon yourself. So if you know (for certain) that when you are with authority you would work in your work with what Rasool-Allah<sup>saww</sup> had ordered with, then you would be taking on employees and your officers from the people of your Religion. So when something (wealth) comes to you, you would help the poor Believers until one of them would be with the same as that, or else, so (the answer is) no’."]}}, {"index": 8470, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:5:2:31:5", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ أَحْمَدَ بْنِ الْحُسَيْنِ عَنْ أَبِيهِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ مِهْرَانَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ مَا مِنْ جَبَّارٍ إِلَّا وَ مَعَهُ مُؤْمِنٌ يَدْفَعُ اللَّهُ بِهِ عَنِ الْمُؤْمِنِينَ وَ هُوَ أَقَلُّهُمْ حَظّاً فِي الْآخِرَةِ يَعْنِي أَقَلَّ الْمُؤْمِنِينَ حَظّاً لِصُحْبَةِ الْجَبَّارِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Ahmad Bin Al Husayn, from his father, from Usman Bin Isa, from Mihran Bin Muhammad Bin Abu Nasr, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘There is no one from a tyrant except with him is a Believer by whom Allah<sup>azwj</sup> Defends the Believers and he would be with the smallest of the portions in the Hereafter – meaning having the lowest of the portions of the Believers due to his association with the tyrant’."]}}, {"index": 8471, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:5:2:31:6", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنِ السَّيَّارِيِّ عَنْ أَحْمَدَ بْنِ زَكَرِيَّا الصَّيْدَلَانِيِّ عَنْ رَجُلٍ مِنْ بَنِي حَنِيفَةَ مِنْ أَهْلِ بُسْتَ وَ سِجِسْتَانَ قَالَ رَافَقْتُ أَبَا جَعْفَرٍ ( عليه السلام ) فِي السَّنَةِ الَّتِي حَجَّ فِيهَا فِي أَوَّلِ خِلَافَةِ الْمُعْتَصِمِ فَقُلْتُ لَهُ وَ أَنَا مَعَهُ عَلَى الْمَائِدَةِ وَ هُنَاكَ جَمَاعَةٌ مِنْ أَوْلِيَاءِ السُّلْطَانِ إِنَّ وَالِيَنَا جُعِلْتُ فِدَاكَ رَجُلٌ يَتَوَلَّاكُمْ أَهْلَ الْبَيْتِ وَ يُحِبُّكُمْ وَ عَلَيَّ فِي دِيوَانِهِ خَرَاجٌ فَإِنْ رَأَيْتَ جَعَلَنِيَ اللَّهُ فِدَاكَ أَنْ تَكْتُبَ إِلَيْهِ كِتَاباً بِالْإِحْسَانِ إِلَيَّ فَقَالَ لِي لَا أَعْرِفُهُ", "فَقُلْتُ جُعِلْتُ فِدَاكَ إِنَّهُ عَلَى مَا قُلْتُ مِنْ مُحِبِّيكُمْ أَهْلَ الْبَيْتِ وَ كِتَابُكَ يَنْفَعُنِي عِنْدَهُ فَأَخَذَ الْقِرْطَاسَ وَ كَتَبَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ أَمَّا بَعْدُ فَإِنَّ مُوصِلَ كِتَابِي هَذَا ذَكَرَ عَنْكَ مَذْهَباً جَمِيلًا وَ إِنَّ مَا لَكَ مِنْ عَمَلِكَ مَا أَحْسَنْتَ فِيهِ فَأَحْسِنْ إِلَى إِخْوَانِكَ وَ اعْلَمْ أَنَّ اللَّهَ عَزَّ وَ جَلَّ سَائِلُكَ عَنْ مَثَاقِيلِ الذَّرِّ وَ الْخَرْدَلِ ", "قَالَ فَلَمَّا وَرَدْتُ سِجِسْتَانَ سَبَقَ الْخَبَرُ إِلَى الْحُسَيْنِ بْنِ عَبْدِ اللَّهِ النَّيْسَابُورِيِّ وَ هُوَ الْوَالِي فَاسْتَقْبَلَنِي عَلَى فَرْسَخَيْنِ مِنَ الْمَدِينَةِ فَدَفَعْتُ إِلَيْهِ الْكِتَابَ  فَقَبَّلَهُ وَ وَضَعَهُ عَلَى عَيْنَيْهِ ثُمَّ قَالَ لِي مَا حَاجَتُكَ فَقُلْتُ خَرَاجٌ عَلَيَّ فِي دِيوَانِكَ ", "قَالَ فَأَمَرَ بِطَرْحِهِ عَنِّي وَ قَالَ لِي لَا تُؤَدِّ خَرَاجاً مَا دَامَ لِي عَمَلٌ ثُمَّ سَأَلَنِي عَنْ عِيَالِي فَأَخْبَرْتُهُ بِمَبْلَغِهِمْ فَأَمَرَ لِي وَ لَهُمْ بِمَا يَقُوتُنَا وَ فَضْلًا فَمَا أَدَّيْتُ فِي عَمَلِهِ خَرَاجاً مَا دَامَ حَيّاً وَ لَا قَطَعَ عَنِّي صِلَتَهُ حَتَّى مَاتَ . "], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Al Sayyari, from Ahmad Bin Zakariyya Al Sydalany, from a man from the Clan of Haneefa from the people of Bust and Sajistan who said, ", "‘I accompanied Abu Ja’far<sup>asws</sup> in the year in which he<sup>asws</sup> performed Hajj during the inception of the caliphate of Al-Mu’tasim, so I said to him<sup>asws</sup> while I was with him<sup>asws</sup> upon the meal, and over there was a group from the governors of the Sultan (ruling authorities): ‘May I be sacrificed for you<sup>asws</sup>! Our governor is a man who befriends you<sup>asws</sup> the People<sup>asws</sup> of the Household and loves you<sup>asws</sup>, and upon me in his office is a tax, so if you<sup>asws</sup> see fit, may I be sacrificed for you<sup>asws</sup>, if you<sup>asws</sup> could write a letter to him with the favour to me’. He<sup>asws</sup> said: ‘I<sup>asws</sup> do not recognise him’. ", "So I said, ‘May I be sacrificed for you<sup>asws</sup>! He is upon what I said from love for you<sup>asws</sup> the People<sup>asws</sup> of the Household, and your<sup>asws</sup> letter would benefit me in his presence’. So he<sup>asws</sup> grabbed the paper and wrote: ‘In the Name of Allah<sup>azwj</sup> the Beneficent, the Merficul. After this, so the bearer of this letter of mine<sup>asws</sup> has mentioned about you being with a beautiful doctrine, and that what is for you from your work is what you would be Reckoned with regards to it. Therefore, be good to your brethren and know that Allah<sup>azwj</sup> Mighty and Majestic would Question you about (your deeds of) the weight of particles and mustard seeds’.", "He (the narrator) said, ‘So when I came to the outskirts of Sajistan, the news preceded to Al-Husayn Bin Abdullah Al-Neyshpouri, and he was the governor. So he welcomed me at two Farsakhs from the city. So I handed over the letter to him, and he kissed it and placed it upon his eyes, then said to me, ‘What is your need?’ So I said, ‘Tax upon me in your office’. ", "He (the narrator) said, ‘So he ordered with the staving off from me and said to me, ‘You will not have to pay any tax for as long as I am in office’. Then he asked me about my dependants, so I informed him of their ages. So he ordered for me and for them with what was our provision, and extra. So I did not pay any tax during his term in office for as long as he was alive, and his maintenance was not cuf off from me until he died’."]}}, {"index": 8472, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:5:2:31:7", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ عَلِيِّ بْنِ يَقْطِينٍ قَالَ قَالَ لِي أَبُو الْحَسَنِ ( عليه السلام ) إِنَّ لِلَّهِ عَزَّ وَ جَلَّ مَعَ السُّلْطَانِ أَوْلِيَاءَ يَدْفَعُ بِهِمْ عَنْ أَوْلِيَائِهِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from one of our companions, from Ali Bin Yaqteen who said, ", "‘Abu Al Hassan<sup>asws</sup> said to me: ‘Allah<sup>azwj</sup> Mighty and Majestic as firends with the Sultan (ruling authority) by whom He<sup>azwj</sup> Defends His<sup>azwj</sup> friends’."]}}]}, "index": "al-kafi:5:2:31", "kind": "verse_list"}