{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 32"
        },
        "path": "/books/al-kafi:5:2:32",
        "titles": {
          "ar": "باب بَيْعِ السِّلَاحِ مِنْهُمْ ",
          "en": "Chapter 32 – Selling of the weapons among them (Ruling authorites)"
        }
      }
    ],
    "index": 1244,
    "local_index": 32,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 33"
        },
        "path": "/books/al-kafi:5:2:33",
        "titles": {
          "ar": "باب الصِّنَاعَاتِ ",
          "en": "Chapter 33 – The Professions"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 31"
        },
        "path": "/books/al-kafi:5:2:31",
        "titles": {
          "ar": "باب شَرْطِ مَنْ أُذِنَ لَهُ فِي أَعْمَالِهِمْ ",
          "en": "Chapter 31 – The stipulations for the one who is allowed to be in their (government) workforce"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:32",
    "titles": {
      "ar": "باب بَيْعِ السِّلَاحِ مِنْهُمْ ",
      "en": "Chapter 32 – Selling of the weapons among them (Ruling authorites)"
    },
    "verse_count": 4,
    "verse_start_index": 8472,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/69)"
        ],
        "index": 8473,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:32:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ قَالَ دَخَلْنَا عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لَهُ حَكَمٌ السَّرَّاجُ مَا تَرَى فِيمَنْ يَحْمِلُ السُّرُوجَ إِلَى الشَّامِ وَ أَدَاتَهَا فَقَالَ لَا بَأْسَ أَنْتُمُ الْيَوْمَ بِمَنْزِلَةِ أَصْحَابِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) إِنَّكُمْ فِي هُدْنَةٍ فَإِذَا كَانَتِ الْمُبَايَنَةُ حَرُمَ عَلَيْكُمْ أَنْ تَحْمِلُوا إِلَيْهِمُ السُّرُوجَ وَ السِّلَاحَ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Sayf Bin Ameyra, from Abu Bakr Al Hazramy who said, ",
            "‘We went over to Abu Abdullah<sup>asws</sup>, so Hakam Al-Sarraj said to him<sup>asws</sup>, ‘What do you<sup>asws</sup> see regarding the one who bears the saddles and their equipments to Syria?’ So he<sup>asws</sup> said: ‘There is no problem. Today you all are at the status of the companions of Rasool-Allah<sup>saww</sup>. You are in a truce, so if you were in the conflicts, it would have been Prohibited upon you that you should be carrying the saddles and the weapons to them’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Sayf ibn ‘Amirah from Abu Bakr al-Hadramiy who has said the following: “Once, we visited abu ‘ Abd Allah, ‘Alayhi al-Salam, and Hakam ibn al-Sarraj asked him (the Imam), ‘What is your decision about carrying saddles and things related to al-Sham (Syria)?’ He (the Imam) said, ‘It is not harmful. Today you are like the companions of the Messenger of Allah. You live in peace time. When there is hostility, then it is unlawful for you to carry to them saddles and arms to them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/70)"
        ],
        "index": 8474,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:32:2",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ الْحَسَنِ بْنِ رِبَاطٍ عَنْ أَبِي سَارَةَ عَنْ هِنْدٍ السَّرَّاجِ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) أَصْلَحَكَ اللَّهُ إِنِّي كُنْتُ أَحْمِلُ السِّلَاحَ إِلَى أَهْلِ الشَّامِ فَأَبِيعُهُ مِنْهُمْ فَلَمَّا أَنْ عَرَّفَنِيَ اللَّهُ هَذَا الْأَمْرَ ضِقْتُ بِذَلِكَ وَ قُلْتُ لَا أَحْمِلُ إِلَى أَعْدَاءِ اللَّهِ فَقَالَ احْمِلْ إِلَيْهِمْ فَإِنَّ اللَّهَ يَدْفَعُ بِهِمْ عَدُوَّنَا وَ عَدُوَّكُمْ يَعْنِي الرُّومَ وَ بِعْهُمْ فَإِذَا كَانَتِ الْحَرْبُ بَيْنَنَا فَلَا تَحْمِلُوا فَمَنْ حَمَلَ إِلَى عَدُوِّنَا سِلَاحاً يَسْتَعِينُونَ بِهِ عَلَيْنَا فَهُوَ مُشْرِكٌ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, form Ibn Mahboub, from Ali Bin Al Hassan Bin Rabaat, from Abu Sarah, from Hind Al Sarraj who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! I used to carry the weapons to the people of Syria, so I would sell it to them. So when Allah<sup>azwj</sup> Made me recognise this matter (<span class=\"iTxt\">Al-Wilayah</span>), I was constricted by that, and I said, ‘I will not carry to the enemies of Allah<sup>azwj</sup>’. So he<sup>asws</sup> said: ‘Carry to them, for Allah<sup>azwj</sup> would Repulse by them our<sup>asws</sup> enemies and your enemies, meaning the Romans; and sell it to them, so when there is the war between us, so do not carry, for the one who carries weapons to our<sup>asws</sup> enemies, for them to be assited with against us<sup>asws</sup>, so he is a Polytheist’."
          ],
          "en.sarwar": [
            "2. Ahmad ibn Muhammad has narrated from ibn Mahbub from Ali ibn al-Hassan ibn Ribat from abu Sarah from Hind ibn Faddal-Sarraj who has said the following: “I once asked abu Ja’far, ‘Alayhi al-Salam, saying, ‘I pray to Allah to keep you well, I used to carry arms to sell to people of al-Sham. Ever since Allah has helped me to recognize the matter (Divine Authority of ‘A’immah) it bothers me, and I think I must not deliver arms to the enemies of Allah.’ He (the Imam) said, ‘You can do so because Allah repels through them our enemy and your enemy- the Romans - and sell it to them. When there is war among us, then do not carry arms to them. Those who carry arms to our enemies which help them against us, such people are like pagans.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/70)"
        ],
        "index": 8475,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:32:3",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْفِئَتَيْنِ تَلْتَقِيَانِ مِنْ أَهْلِ الْبَاطِلِ أَ نَبِيعُهُمَا السِّلَاحَ قَالَ بِعْهُمَا مَا يَكُنُّهُمَا كَالدِّرْعِ وَ الْخُفَّيْنِ وَ نَحْوِ هَذَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Hisham Bin Salim, from Muhammad Bin Qays who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the two parties from the people of the falsehood who meet in battle, can I sell the weapons to these two?’ He<sup>asws</sup> said: ‘You can sell to both of them what is defensive for them, like the armours, and the shoes, and (items) such as these’."
          ],
          "en.sarwar": [
            "3. Ahmad ibn Muhammad has narrated from Ali ibn al-Hakam from Hisham ibn Salim from Muhammad ibn Qays who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the two groups of falsehood who fight each other; if I can sell arms to them. He (the Imam) said, ‘You can sell to them protective materials, like shields and shoes and so on.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/71)"
        ],
        "index": 8476,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:32:4",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ أَبِي عَبْدِ اللَّهِ الْبَرْقِيِّ عَنِ السَّرَّادِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ إِنِّي أَبِيعُ السِّلَاحَ قَالَ لَا تَبِعْهُ فِي فِتْنَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, form Abu Abdullah Al barqy, from Al Sarrad, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘I sell the weapons’. He<sup>asws</sup> said: ‘You cannot sell during the tribulations (trouble times)’."
          ],
          "en.sarwar": [
            "4. Ahmad ibn Muhammad from abu ‘Abd Allah al-Barqiy from al-Sarrad who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, that I sell arms. He (the Imam) said, ‘You must not sell them in times of mischief.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:32",
  "kind": "verse_list"
}