{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 33"
        },
        "path": "/books/al-kafi:5:2:33",
        "titles": {
          "ar": "باب الصِّنَاعَاتِ ",
          "en": "Chapter 33 – The Professions"
        }
      }
    ],
    "index": 1245,
    "local_index": 33,
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:33",
    "titles": {
      "ar": "باب الصِّنَاعَاتِ ",
      "en": "Chapter 33 – The Professions"
    },
    "verse_count": 7,
    "verse_start_index": 8476,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف وآخره مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/71)"
        ],
        "index": 8477,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:33:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْقَاسِمِ بْنِ يَحْيَى عَنْ جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِنَّ اللَّهَ عَزَّ وَ جَلَّ يُحِبُّ الْمُحْتَرِفَ الْأَمِينَ وَ فِي رِوَايَةٍ أُخْرَى إِنَّ اللَّهَ تَعَالَى يُحِبُّ الْمُؤْمِنَ الْمُحْتَرِفَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, form Ahmad Bin Muhammad, from Al Qasim Bin Yahya, from his grandfather Al Hassan Bin Rashid, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said that Allah<sup>azwj</sup> Mighty and Majestic Loves ‘الْمُؤْمِنَ الْمُحْتَرِفَ’ ‘the Believer who has a skill (profession)’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from al-Qasim ibn Yahya from his grandfather, al-Hassan ibn Rashid from Muhammad ibn Muslim from abu ‘ Abd Allah, ‘Alayhi al-Salam, who has said the following: “Amir al-Mu’minin, ‘Alayhi al-Salam, has said, ‘Allah, most Majestic, most Glorious, loves persons who are trustworthy and possess technical skills/” In another Hadith it is said, ‘Allah, most High, loves the skillful believer.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/71)"
        ],
        "index": 8478,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:33:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنْ خَالِدِ بْنِ عُمَارَةَ عَنْ سَدِيرٍ الصَّيْرَفِيِّ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) حَدِيثٌ بَلَغَنِي عَنِ الْحَسَنِ الْبَصْرِيِّ فَإِنْ كَانَ حَقّاً فَإِنَّا لِلَّهِ وَ إِنَّا إِلَيْهِ رَاجِعُونَ قَالَ وَ مَا هُوَ قُلْتُ بَلَغَنِي أَنَّ الْحَسَنَ الْبَصْرِيَّ كَانَ يَقُولُ لَوْ غَلَى دِمَاغُهُ مِنْ حَرِّ الشَّمْسِ مَا اسْتَظَلَّ بِحَائِطِ صَيْرَفِيٍّ وَ لَوْ تَفَرَّثَ كَبِدُهُ عَطَشاً لَمْ يَسْتَسْقِ مِنْ دَارِ صَيْرَفِيٍّ مَاءً وَ هُوَ عَمَلِي وَ تِجَارَتِي وَ فِيهِ نَبَتَ لَحْمِي وَ دَمِي وَ مِنْهُ حَجِّي وَ عُمْرَتِي ",
          "فَجَلَسَ ثُمَّ قَالَ كَذَبَ الْحَسَنُ خُذْ سَوَاءً وَ أَعْطِ سَوَاءً فَإِذَا حَضَرَتِ الصَّلَاةُ  فَدَعْ مَا بِيَدِكَ وَ انْهَضْ إِلَى الصَّلَاةِ أَ مَا عَلِمْتَ أَنَّ أَصْحَابَ الْكَهْفِ كَانُوا صَيَارِفَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Salih Bin Al Sandy, from Ja’far Bin Basheer, from Khalid Bin Umarat, from Sadeyr Al Sayrafi who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘A Hadeeth has reached me from Al-Hassan Al-Basry, so if it was true, so we are for Allah<sup>azwj</sup> to Him<sup>azwj</sup> we are returning’. He<sup>asws</sup> said: ‘And what is it?’ I said, ‘It has reached me that Al-Hassan Al-Basry was saying, ‘(Even) if his brain were to boil from the heat of the sun, he would (still) not shade himself by a wall of a money-changer, and (even) if his liver were to burst out of thirst, he would not quench himself with water from the house of a money-changer, and it is my work and my business, and by it my flesh has been built and my blood, and from it I have performed my Hajj and my Umrah’. ",
            "So he<sup>asws</sup> sat up, then said: ‘Al-Hassan has lied! Take equally (in fairness) and give equally (in fairness), so when the Prayer presents itself, leave what is in your hands and rise to the Prayer. Do you not know that the companions of the cave (As’haab Al-Kahf) were money-changers?’"
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from Salih ibn al-Sindiy from Ja’far ibn Bashir from Khalid ibn ‘ Urn a rah from Sadir al- Sayrafiy who has said the following: “I once said to abu Ja‘far, ‘Alayhi al-Salam, ‘A Hadith has reached me from al-Hassan al-Basriy. If it is a true Hadith then, ‘We are for Allah and to Him we return.’ He (the Imam) asked, ‘What does it say?’ ‘I am told that al-Hassan al-Basriy would say that even if his brain comes to a boiling point due to the hot sun, he will not seek shelter of the shadow of a wall that belongs to a money changer. Even if his liver cracks down because of thirst he will not use the water that comes from the house of a money changer.’ This is my business and profession. With this business my flesh and blood have grown. With this business I have performed Hajj and ‘Umrah.’ He (the Imam) sat straight and said, ‘Al-Hassan has spoken a lie. Take with fairness and give with fairness. When it is time for Salat (prayer), stop doing business and rise for Salat (prayer). Did you know that people of the cave were Say ar if ah (money exchangers)?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/72)"
        ],
        "index": 8479,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:33:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ قَالَ سَمِعْتُ رَجُلًا يَسْأَلُ أَبَا الْحَسَنِ الرِّضَا ( عليه السلام ) فَقَالَ إِنِّي أُعَالِجُ الدَّقِيقَ وَ أَبِيعُهُ وَ النَّاسُ يَقُولُونَ لَا يَنْبَغِي فَقَالَ لَهُ الرِّضَا ( عليه السلام ) وَ مَا بَأْسُهُ كُلُّ شَيْ‏ءٍ مِمَّا يُبَاعُ إِذَا اتَّقَى اللَّهَ فِيهِ الْعَبْدُ فَلَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal who said, ",
            "‘I heard a man ask Abu Al-Hassan Al-Reza<sup>asws</sup>, so he said, ‘I cure (by) the flour and I sell it (my portion), and the people are saying that it is not befitting for me’. So Al-Reza<sup>asws</sup> said to me: ‘And what is the problem with it? Everything from what is sold when the servant fears Allah<sup>azwj</sup> , so there is no problem’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal who has said the following: “I heard a man asking abu al-Hassan, al-Rida, ‘Alayhi al-Salam, saying, ‘I prepare (special kind of flour) and sell it but people say that it should not be done.’ Al-Rida, ‘Alayhi al-Salam, said to him, ‘What is wrong with it? There is no offense in selling things in which a servant maintains piety before Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/72)"
        ],
        "index": 8480,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:33:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ يَحْيَى الْخُزَاعِيِّ عَنْ أَبِيهِ يَحْيَى بْنِ أَبِي الْعَلَاءِ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَخَبَّرْتُهُ أَنَّهُ وُلِدَ لِي غُلَامٌ فَقَالَ أَ لَا سَمَّيْتَهُ مُحَمَّداً قَالَ قُلْتُ قَدْ فَعَلْتُ قَالَ فَلَا تَضْرِبْ مُحَمَّداً وَ لَا تَسُبَّهُ جَعَلَهُ اللَّهُ قُرَّةَ عَيْنٍ لَكَ فِي حَيَاتِكَ وَ خَلَفَ صِدْقٍ مِنْ بَعْدِكَ فَقُلْتُ ",
          "جُعِلْتُ فِدَاكَ فِي أَيِّ الْأَعْمَالِ أَضَعُهُ قَالَ إِذَا عَدَلْتَهُ عَنْ خَمْسَةِ أَشْيَاءَ فَضَعْهُ حَيْثُ شِئْتَ لَا تُسْلِمْهُ صَيْرَفِيّاً فَإِنَّ الصَّيْرَفِيَّ لَا يَسْلَمُ مِنَ الرِّبَا وَ لَا تُسْلِمْهُ بَيَّاعَ الْأَكْفَانِ فَإِنَّ صَاحِبَ الْأَكْفَانِ يَسُرُّهُ الْوَبَاءُ إِذَا كَانَ وَ لَا تُسْلِمْهُ بَيَّاعَ الطَّعَامِ فَإِنَّهُ لَا يَسْلَمُ مِنَ الِاحْتِكَارِ وَ لَا تُسْلِمْهُ جَزَّاراً فَإِنَّ الْجَزَّارَ تُسْلَبُ مِنْهُ الرَّحْمَةُ وَ لَا تُسْلِمْهُ نَخَّاساً فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ شَرُّ النَّاسِ مَنْ بَاعَ النَّاسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ja’far Bin Yahya Al Khazaie, from his father Yahya Bin Abu Al A’ala, from Is’haq Bin Ammar who said, ",
            "‘I went over to Abu Abdullah<sup>asws</sup>, so I informed him<sup>asws</sup> that a son had been born unto me. So he<sup>asws</sup> said: ‘Did you not name him as Muhammad?’ I said, ‘I have done it’. He<sup>asws</sup> said: ‘So neither beat Muhammad, nor insult him. Allah<sup>azwj</sup> has Made him a delight for your eye during your lifetime and a true successor from after you’. ",
            "May I be sacrificed for you<sup>asws</sup>! Into which profession shall I place him?’ He<sup>asws</sup> said: ‘If you keep him adjust him away from five things, so you can place him wherever you so desire to. Do not submit him as a money-changer, for the money-changer is not safe from the usury; and do not submit him as a seller of the coffins for the owner of the coffins is joyful during the plague when there was one; and do not submit him as a food trader for he would not be safe from the monopolization (hoarding); and do not make him to be a butcher, for the butcher, his mercy is confiscated from him; and do make him as a slave trader, for Rasool-Allah<sup>saww</sup> said: ‘The most evil of the people is the one who sells the people’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Muhammad ibn Ja’far ibn Yahya al-Khuza’iy from his father, Yahya ibn abu al-‘Ala’ from Ishaq ibn ‘Ammar who has said the following: “I once visited abu ‘Abd Allah, ‘Alayhi al-Salam, and informed him of the birth of my son. He asked, ‘Why do you not name him Muhammad?’ I replied, ‘I have already done so.’ He (the Imam) then said, ‘You must not beat up a Muhammad and do not abuse him. Allah will make him the delight to your eyes during your life time as well as a truthful successor for you.’ I then asked, ‘I pray to Allah to keep my soul in service for your cause, in what kind of profession should I involve him?’ He (the Imam) said, ‘If you keep him away from five kinds of professions then instruct him in whatever you like. You must not train him in money changing business; he will not remain safe from unlawful interest. You must not teach him selling coffins; such people become happy with the coming of plague when such disease is around. You must not teach him in selling foods; they do not remain safe from stockpiling (hoarding) food. Do not instruct him as a butcher; it reduces his kindness. You must not instruct him in how to sell slaves; the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “The worst people are people sellers.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف كالموثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/72)"
        ],
        "index": 8481,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:33:5",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ اللَّهِ جَعْفَرِ بْنِ مُحَمَّدٍ ( عليه السلام ) قَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ إِنِّي أَعْطَيْتُ خَالَتِي غُلَاماً وَ نَهَيْتُهَا أَنْ تَجْعَلَهُ قَصَّاباً أَوْ حَجَّاماً أَوْ صَائِغاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Muhammad Bin Yahya, from Talha Bin Zayd, ",
            "(It has been narrated) from Abu Adullah Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup> having said that Rasool-Allah<sup>saww</sup> said: ‘I gave a boy to my maternal aunt and forbade her that she should make him a butcher, or a cupper, or a goldsmith’."
          ],
          "en.sarwar": [
            "5. Ahmad ibn Muhammad has narrated from Muhammad ibn Yahya from Talhah ibn Zayd who has said the following: “This is a narration of abu ‘Abd Allah, Ja’far ibn Muhammad, ‘Alayhi al-Salam, from the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. He (the Messenger of Allah) has said, ‘I gave a boy to my aunt and prohibited her from making him a butcher, cupping person or a jewelry carver.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/73)"
        ],
        "index": 8482,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:33:6",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدِ بْنِ بُنْدَارَ عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنِ الْقَاسِمِ بْنِ إِسْحَاقَ بْنِ إِبْرَاهِيمَ عَنْ مُوسَى بْنِ زَنْجَوَيْهِ التَّفْلِيسِيِّ عَنْ أَبِي عُمَرَ الْحَنَّاطِ عَنْ إِسْمَاعِيلَ الصَّيْقَلِ الرَّازِيِّ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ مَعِي ثَوْبَانِ فَقَالَ لِي يَا أَبَا إِسْمَاعِيلَ يَجِيئُنِي مِنْ قِبَلِكُمْ أَثْوَابٌ كَثِيرَةٌ وَ لَيْسَ يَجِيئُنِي مِثْلُ هَذَيْنِ الثَّوْبَيْنِ اللَّذَيْنِ تَحْمِلُهُمَا أَنْتَ فَقُلْتُ جُعِلْتُ فِدَاكَ تَغْزِلُهُمَا أُمُّ إِسْمَاعِيلَ وَ أَنْسِجُهُمَا أَنَا فَقَالَ لِي حَائِكٌ قُلْتُ نَعَمْ فَقَالَ لَا تَكُنْ حَائِكاً قُلْتُ فَمَا أَكُونُ قَالَ كُنْ صَيْقَلًا وَ كَانَتْ مَعِي مِائَتَا دِرْهَمٍ فَاشْتَرَيْتُ بِهَا سُيُوفاً وَ مَرَايَا عُتُقاً وَ قَدِمْتُ بِهَا الرَّيَّ فَبِعْتُهَا بِرِبْحٍ كَثِيرٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad Bin Bundar, from Ahmad Bin Abu Abdullah, from Al Qasim Bin Is’haq Bin Ibrahim, from Musa Bin Zanjawiya Al Tafleysi, from Abu Umar Al Hannat, from Ismail Al Sayqal Al Razy who said, ",
            "‘I went over to Abu Abdullah<sup>asws</sup> and with me were two clothes. So he<sup>asws</sup> said to me: ‘O Abu Ismail! The ones before you have come to me<sup>asws</sup> with numerous clothes and they did not come to me<sup>asws</sup> with the likes of these two clothes which you are carrying’. So I said, ‘May I be sacrificed for you<sup>asws</sup>! The mother of Ismail spun these two, and I weaved these two’. So he<sup>asws</sup> said to me: ‘(You are) a weaver?’ I said, ‘Yes’. So he<sup>asws</sup> said: ‘Do not become a weaver’. I said, ‘So what should I become?’ He<sup>asws</sup> said: ‘Become a polisher’. And there were two hundred Dirhams with me, so I bought swords with it, and old mirrors, and proceded with these to Al-Rayy, and I sold these (after polishing them) for a lot of profit’."
          ],
          "en.sarwar": [
            "6. Ali ibn Muhammad ibn Bandar has narrated from Ahmad ibn abu ‘ Abd Allah from al-Qasim ibn Ishaq ibn Ibrahim from Musa ibn Zanjawayh al-Taflisiy from abu ‘Amr al-Hannat from ‘Isma’il al-Sayqal al-Raziy who has said the following: “Once I visited abu ’Abd Allah, Alayhi al-Salam. I had two pieces of fabric materials with me. He (the Imam) said, ‘O abu Tsma’il, from your area people bring us many kinds of fabrics but not like these two pieces that you carry.’ I said, T pray to Allah to keep my soul in service for your cause, the mother of Tsma’il prepares threads and I weave them.’ He (the Imam) asked, ’Are you a weaver?’ I replied, ’Yes, I am a weaver.’ He (the Imam) said, ‘You must not be a weaver.’ I then asked, ‘What kind of work then I should do?’ He (the Imam) said, ’Work as a sword polisher.’ I had two hundred dirhams with me with which I purchased swords and sold. I took them to al-Rayy, sold them and made a large profit.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/73)"
        ],
        "index": 8483,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:33:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ قَالَ حَدَّثَنِي شَيْخٌ مِنْ أَصْحَابِنَا الْكُوفِيِّينَ قَالَ دَخَلَ عِيسَى بْنُ شَفَقِيٍّ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ كَانَ سَاحِراً يَأْتِيهِ النَّاسُ وَ يَأْخُذُ عَلَى ذَلِكَ الْأَجْرَ فَقَالَ لَهُ جُعِلْتُ فِدَاكَ أَنَا رَجُلٌ كَانَتْ صِنَاعَتِيَ السِّحْرَ وَ كُنْتُ آخُذُ عَلَى ذَلِكَ الْأَجْرَ وَ كَانَ مَعَاشِي وَ قَدْ حَجَجْتُ مِنْهُ وَ مَنَّ اللَّهُ عَلَيَّ بِلِقَائِكَ وَ قَدْ تُبْتُ إِلَى اللَّهِ عَزَّ وَ جَلَّ فَهَلْ لِي فِي شَيْ‏ءٍ مِنْ ذَلِكَ مَخْرَجٌ قَالَ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) حُلَّ وَ لَا تَعْقِدْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from a Sheykh from our Kufian companions who said, ",
            "‘Isa Bin Shafaqiyya went over to Abu Abdullah<sup>asws</sup> and he was a magician. The people were coming to him and he would take the payment upon that. So he said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! I a man who used to do magic, and I used to take the payment upon that, and it was my livelihood, and I have performed Hajj from it, and Allah<sup>azwj</sup> has Favoured upon me with meeting you<sup>asws</sup>, and I have repented to Allah<sup>azwj</sup> Mighty and Majestic. So is there for me in anything from that, a way out?’ So Abu Abdullah<sup>asws</sup> said to him: ‘Loosen it, and do not tie it (Break the spells and do not make them)’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from who has said that a Shaykh from our people of al-Kufah has said following: ‘Once ‘Isa ibn Shafaqiy visited abu ‘Abd Allah, Alayhi al-Salam. He was a magician. People would come to him and he charged them a certain amount for wages. He said, ‘I pray to Allah to keep my soul in service for your cause, I work as a magician and I charge a certain amount as my wages to earn for my living. From such incomes I have performed Hajj and Allah has granted me the opportunity to visit you. I have repented before Allah, most Majestic, most Glorious. Is there a way out to safety for me from this?’ He (the Imam) said, ‘Open it up (turn it ineffective) but do not tie down (make it effective).”’ (Fatwa best explains this hadith and the following Chapters. Please consult Fatwa.) "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:33",
  "kind": "verse_list"
}