{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 35"
        },
        "path": "/books/al-kafi:5:2:35",
        "titles": {
          "ar": "باب كَسْبِ النَّائِحَةِ ",
          "en": "Chapter 35 – Earnings of the lamenting woman"
        }
      }
    ],
    "index": 1247,
    "local_index": 35,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 36"
        },
        "path": "/books/al-kafi:5:2:36",
        "titles": {
          "ar": "باب كَسْبِ الْمَاشِطَةِ وَ الْخَافِضَةِ ",
          "en": "Chapter 36 – Earnings of the female hairdresser and the female circumciser"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 34"
        },
        "path": "/books/al-kafi:5:2:34",
        "titles": {
          "ar": "باب كَسْبِ الْحَجَّامِ ",
          "en": "Chapter 34 – Earnings of the cupper"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:35",
    "titles": {
      "ar": "باب كَسْبِ النَّائِحَةِ ",
      "en": "Chapter 35 – Earnings of the lamenting woman"
    },
    "verse_count": 4,
    "verse_start_index": 8488,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/75)"
        ],
        "index": 8489,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:35:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ لِي أَبِي يَا جَعْفَرُ أَوْقِفْ لِي مِنْ مَالِي كَذَا وَ كَذَا لِنَوَادِبَ تَنْدُبُنِي عَشْرَ سِنِينَ بِمِنًى أَيَّامَ مِنًى ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al hakam, from Yunus Bin Yaqoub, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘My<sup>asws</sup> father<sup>asws</sup> said to me<sup>asws</sup>: ‘O Ja’far<sup>asws</sup>! Dedicate to me<sup>asws</sup> from my<sup>asws</sup> such and such wealth for the lamenters to lament me<sup>asws</sup> for ten years at Mina in the days of Mina’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Yunus ibn Ya’qub who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘My father said to me, ‘O Ja‘far, assign a certain amount from my so and so properties as endowment, so payments can be made to people who will eulogize to mourn for me in Mina for ten years.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/76)"
        ],
        "index": 8490,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:35:2",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ مَاتَ الْوَلِيدُ بْنُ الْمُغِيرَةِ فَقَالَتْ أُمُّ سَلَمَةَ لِلنَّبِيِّ ( صلى الله عليه وآله ) إِنَّ آلَ الْمُغِيرَةِ قَدْ أَقَامُوا مَنَاحَةً فَأَذْهَبُ إِلَيْهِمْ فَأَذِنَ لَهَا فَلَبِسَتْ ثِيَابَهَا وَ تَهَيَّأَتْ وَ كَانَتْ مِنْ حُسْنِهَا كَأَنَّهَا جَانٌّ وَ كَانَتْ إِذَا قَامَتْ فَأَرْخَتْ شَعْرَهَا جَلَّلَ جَسَدَهَا وَ عَقَدَتْ بِطَرَفَيْهِ خَلْخَالَهَا ",
          "فَنَدَبَتِ ابْنَ عَمِّهَا بَيْنَ يَدَيْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَتْ .أَنْعَى الْوَلِيدَ بْنَ الْوَلِيدِ أَبَا الْوَلِيدِ فَتَى الْعَشِيرَهْ‏ حَامِي الْحَقِيقَةِ مَاجِدٌ يَسْمُو إِلَى طَلَبِ الْوَتِيرَهْ‏ قَدْ كَانَ غَيْثاً فِي السِّنِينَ وَ جَعْفَراً غَدَقاً وَ مِيرَهْ ",
          "قَالَ فَمَا عَابَ ذَلِكَ عَلَيْهَا النَّبِيُّ ( صلى الله عليه وآله ) وَ لَا قَالَ شَيْئاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Mlik Bin Atiyya, from Abu Hamza, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Al-Waleed Bin Al-Mugheira died, so Umm Salma<sup>as</sup> said to the Prophet<sup>saww</sup>: ‘The progeny of Al-Mugheira have established a lamentation, so I<sup>as</sup> want to go to them’. So he<sup>saww</sup> permitted her<sup>as</sup>. So she<sup>as</sup> wore her<sup>as</sup> clothes and prepared herself<sup>as</sup>, and it was from her<sup>as</sup> beauty that she was like a fairy, and she<sup>as</sup> was such that whenever she<sup>as</sup> stood up, so her<sup>as</sup> hair flowed till the top part of her<sup>as</sup> body got covered, and she<sup>as</sup> tied her<sup>as</sup> ornaments at the ends of it. ",
            "So she<sup>as</sup> eulogised the son of her<sup>as</sup> uncle in front of Rasool-Allah<sup>saww</sup>, so she<sup>as</sup> said: ‘I<sup>as</sup> state that Al-Waleed Bin Al-Waleed Abu Al-Waleed was a youth of the family, a patron of the realities; a glorious one transcending to the frequently of its seeking; a quencher during the years, a spring of fresh water and its provisions’. ",
            "He<sup>asws</sup> said: ‘So the Prophet<sup>saww</sup> did not refuse that to her, nor did he<sup>saww</sup> say anything’."
          ],
          "en.sarwar": [
            "2. Ahmad ibn Muhammad has narrated from Ali ibn al-Hakam from Malik ibn ‘Atiyah from abu Hamzah who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘When al-Walid ibn al-Mughirah died, ‘Umm Salamah asked the Holy Prophet, for permission. She said, “The family of al-Mughirah has organized a gathering to mourn for al-Walid. Can I also attend their gathering?” The Holy Prophet granted her permission. She dressed up. She was beautiful like a fairy. When standing she released her hairs and it covered her body. She tied her khalkhal on both sides. She then eulogized her cousin before the Messenger of Allah saying: “I announce passing away of al-Walid ibn al-Walid, abu al-Walid, the young man of the family, protector of truth, with glory and rising for good manners. He was a thirst-quenching rain for years, a crystal clear brook and supplies.”’ He (the narrator) has said that the Holy Prophet did not disapprove her eulogies and did not say anything.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/76)"
        ],
        "index": 8491,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:35:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ إِسْمَاعِيلَ جَمِيعاً عَنْ حَنَانِ بْنِ سَدِيرٍ قَالَ كَانَتِ امْرَأَةٌ مَعَنَا فِي الْحَيِّ وَ لَهَا جَارِيَةٌ نَائِحَةٌ فَجَاءَتْ إِلَى أَبِي فَقَالَتْ يَا عَمِّ أَنْتَ تَعْلَمُ أَنَّ مَعِيشَتِي مِنَ اللَّهِ عَزَّ وَ جَلَّ ثُمَّ مِنْ هَذِهِ الْجَارِيَةِ النَّائِحَةِ وَ قَدْ أَحْبَبْتُ أَنْ تَسْأَلَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ ذَلِكَ فَإِنْ كَانَ حَلَالًا وَ إِلَّا بِعْتُهَا وَ أَكَلْتُ مِنْ ثَمَنِهَا حَتَّى يَأْتِيَ اللَّهُ بِالْفَرَجِ فَقَالَ لَهَا أَبِي وَ اللَّهِ إِنِّي لَأُعْظِمُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) أَنْ أَسْأَلَهُ عَنْ هَذِهِ الْمَسْأَلَةِ ",
          "قَالَ فَلَمَّا قَدِمْنَا عَلَيْهِ أَخْبَرْتُهُ أَنَا بِذَلِكَ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَ تُشَارِطُ قُلْتُ وَ اللَّهِ مَا أَدْرِي تُشَارِطُ أَمْ لَا فَقَالَ قُلْ لَهَا لَا تُشَارِطُ وَ تَقْبَلُ مَا أُعْطِيَتْ . "
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Ismail altogether, from Hanaan Bin Sadeyr who said, ",
            "‘There was a woman with us in Al-Hayy, and for her is a slave girl, a lamenter. So she came over to my father and said, ‘O uncle! You know that my livelihood is from Allah<sup>azwj</sup> Mighty and Majestic, then from this slave girl, the lamenter, and I would love it if you could ask Abu Abdullah<sup>asws</sup> about that. So if it was Permissible (fine), or else I would sell her and eat from her price until such time as Allah<sup>azwj</sup> Grants me with the relief (alternative source of income)’. So my father said to her, ‘I consider it a big thing that I should ask Abu Abdullah<sup>asws</sup> about this question’. ",
            "He (the narrator) said, ‘So when we proceded to him<sup>asws</sup>, I informed him<sup>asws</sup> with that, so Abu Abdullah<sup>asws</sup> said: ‘Does she stipulate (a price beforehand)?’ I said, ‘By Allah<sup>azwj</sup>! I do not know whether she stipulates or not’. So he<sup>asws</sup> said: ‘Tell her not to stipulate, and she can accept whatever is given’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isma’il all from Hanan ibn Sadir who has said the following: “In our neighborhood there was a woman who had a slave-girl who sang eulogies. She came to my father and said, ‘O Uncle, you know about my means of living from Allah, most Majestic, most Glorious, and then it is from this slave-girl’s singing eulogies. I like if you ask abu ‘Abd Allah, ‘Alayhi al-Salam, for me about it if it is lawful; otherwise, I will sell her and use the funds from selling her until Allah opens up a door for me.’ My father said to her, ‘I consider abu ‘Abd Allah, ‘Alayhi al-Salam, greatly exalted and cannot ask such things from him.’ He (the narrator) has said that when we visited him (the Imam) I informed him (the Imam) about it and abu ‘Abd Allah, ‘Alayhi al- Salam, asked, ‘Does she set a condition?’ I replied, ‘By Allah, I do not know if she does or does not do.’ He (the Imam) said, ‘Tell her not to set up a condition for payment but accept whatever is given to you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/77)"
        ],
        "index": 8492,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:35:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ الْحَسَنِ بْنِ عَطِيَّةَ عَنْ عُذَافِرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ قَدْ سُئِلَ عَنْ كَسْبِ النَّائِحَةِ قَالَ تَسْتَحِلُّهُ بِضَرْبِ إِحْدَى يَدَيْهَا عَلَى الْأُخْرَى "
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, form Ibn Abu Umeyr, from Al Hassan Bin Atiyya, from Uzafir who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> and he<sup>asws</sup> had been asked about earnings of the female lamenter, he<sup>asws</sup> said: ‘It is Permissible for her to strike with one hand upon the other’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from al-Hassan ibn ‘Atiyyah from ‘ Adhafir who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, saying, when he was asked about the income from eulogies, ‘She can make it lawful by tapping one of her hands against the other.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:35",
  "kind": "verse_list"
}