{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:5:2", "titles": {"ar": "كتاب الْمَعِيشَةِ", "en": "THE BOOK OF SUBSISTENCE"}}, {"indexed_titles": {"en": "Chapter 36"}, "path": "/books/al-kafi:5:2:36", "titles": {"ar": "باب كَسْبِ الْمَاشِطَةِ وَ الْخَافِضَةِ ", "en": "Chapter 36 – Earnings of the female hairdresser and the female circumciser"}}], "index": 1247, "local_index": 36, "part_type": "Chapter", "path": "/books/al-kafi:5:2:36", "titles": {"ar": "باب كَسْبِ الْمَاشِطَةِ وَ الْخَافِضَةِ ", "en": "Chapter 36 – Earnings of the female hairdresser and the female circumciser"}, "verse_count": 4, "verse_start_index": 8492, "verses": [{"index": 8493, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:2:36:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ هَارُونَ بْنِ الْجَهْمِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا هَاجَرَتِ النِّسَاءُ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) هَاجَرَتْ فِيهِنَّ امْرَأَةٌ يُقَالُ لَهَا أُمُّ حَبِيبٍ وَ كَانَتْ خَافِضَةً تَخْفِضُ الْجَوَارِيَ فَلَمَّا رَآهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَالَ لَهَا يَا أُمَّ حَبِيبٍ الْعَمَلُ الَّذِي كَانَ فِي يَدِكِ هُوَ فِي يَدِكِ الْيَوْمَ قَالَتْ نَعَمْ يَا رَسُولَ اللَّهِ إِلَّا أَنْ يَكُونَ حَرَاماً فَتَنْهَانِي عَنْهُ فَقَالَ لَا بَلْ حَلَالٌ فَادْنِي مِنِّي حَتَّى أُعَلِّمَكِ\nقَالَتْ فَدَنَوْتُ مِنْهُ فَقَالَ يَا أُمَّ حَبِيبٍ إِذَا أَنْتِ فَعَلْتِ فَلَا تَنْهَكِي أَيْ لَا تَسْتَأْصِلِي وَ أَشِمِّي فَإِنَّهُ أَشْرَقُ لِلْوَجْهِ وَ أَحْظَى عِنْدَ الزَّوْجِ \nقَالَ وَ كَانَ لِأُمِّ حَبِيبٍ أُخْتٌ يُقَالُ لَهَا أُمُّ عَطِيَّةَ وَ كَانَتْ مُقَيِّنَةً يَعْنِي مَاشِطَةً فَلَمَّا انْصَرَفَتْ أُمُّ حَبِيبٍ إِلَى أُخْتِهَا أَخْبَرَتْهَا بِمَا قَالَ لَهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَأَقْبَلَتْ أُمُّ عَطِيَّةَ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) فَأَخْبَرَتْهُ بِمَا قَالَتْ لَهَا أُخْتُهَا فَقَالَ لَهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) ادْنِي مِنِّي يَا أُمَّ عَطِيَّةَ إِذَا أَنْتِ قَيَّنْتِ الْجَارِيَةَ فَلَا تَغْسِلِي وَجْهَهَا بِالْخِرْقَةِ فَإِنَّ الْخِرْقَةَ تَشْرَبُ مَاءَ الْوَجْهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ahmad Bin Muhammad Bin Abu Nasr, from Haroun Bin Al Jaham, from Muhammad Bini Muslim, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the women emigrated to Rasool-Allah<sup>saww</sup>, a woman called Umm Habbeb emigrated along with them, and she was a female circumciser, circumcising the girls. So when Rasool-Allah<sup>saww</sup> saw her, said to her: ‘O Umm Habeeb! The work which has been in your hands, is it in your hands today (as well)?’ She said, ‘Yes, O Rasool-Allah<sup>saww</sup>, unless it happens to be Prohibited, so forbid me from it’. So he<sup>saww</sup> said: ‘No, but (it is) Permissible, so approach me<sup>saww</sup> until I<sup>saww</sup> teach you’. \nShe said, ‘So I approached him<sup>saww</sup>, so he<sup>saww</sup> said: ‘O Umm Habeeb! Whenever you perform it, so do not overdo it, i.e., do not uproot it (entirely) but to rather scrape it, for it is brightening for the surface and more pleasurable in the presence of the husband’. \nHe<sup>asws</sup> said: ‘And there was a sister for Umm Habeeb called Umm Atiyya, and she was a ladies maid, meaning a hairdresser. So when Umm Habeeb left to go to her sister, she informed her with what Rasool-Allah<sup>saww</sup> had said to her. So Umm Atiyya came over to the Prophet<sup>saww</sup> and informed him<sup>saww</sup> with what her sister had said to her. So Rasool-Allah<sup>saww</sup> said to her: ‘Approach me<sup>saww</sup>, O Umm Atiyya! Whenever you attend to the girl, so do not wash her face with a rag, for the rag absorbs the water of the face’."}]}, {"index": 8494, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:2:36:2", "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَحْمَدَ بْنِ أَشْيَمَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ دَخَلَتْ مَاشِطَةٌ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ لَهَا هَلْ تَرَكْتِ عَمَلَكِ أَوْ أَقَمْتِ عَلَيْهِ فَقَالَتْ يَا رَسُولَ اللَّهِ أَنَا أَعْمَلُهُ إِلَّا أَنْ تَنْهَانِي عَنْهُ فَأَنْتَهِيَ عَنْهُ فَقَالَ لَهَا افْعَلِي فَإِذَا مَشَطْتِ فَلَا تَجْلِي الْوَجْهَ بِالْخِرَقِ فَإِنَّهَا تَذْهَبُ بِمَاءِ الْوَجْهِ وَ لَا تَصِلِي الشَّعْرَ بِالشَّعْرِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Muhammad, from Ali Bin Ahmad Bin Asheym, from Ibn Abu Umeyr, from a man, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A female hairdresser went over to Rasool-Allah<sup>saww</sup>, so he<sup>saww</sup> said to her: ‘Have you left your work or are you still established upon it?’ So she said, ‘O Rasool-Allah<sup>saww</sup>! I am doing it unless if you<sup>saww</sup> forbid me from it, so I shall keep away from it’. So he<sup>saww</sup> said to her: ‘So whenever you comb hair, do not polish the face with the rag, for it removes the water of the face, and do not attach the hair (of someone) with the hair (of another one)’."}]}, {"index": 8495, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:2:36:3", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي هَاشِمٍ عَنْ سَالِمِ بْنِ مُكْرَمٍ عَنْ سَعْدٍ الْإِسْكَافِ قَالَ سُئِلَ أَبُو جَعْفَرٍ ( عليه السلام ) عَنِ الْقَرَامِلِ الَّتِي تَضَعُهَا النِّسَاءُ فِي رُءُوسِهِنَّ يَصِلْنَهُ بِشُعُورِهِنَّ فَقَالَ لَا بَأْسَ عَلَى الْمَرْأَةِ بِمَا تَزَيَّنَتْ بِهِ لِزَوْجِهَا \nقَالَ فَقُلْتُ لَهُ بَلَغَنَا أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) لَعَنَ الْوَاصِلَةَ وَ الْمَوْصُولَةَ فَقَالَ لَيْسَ هُنَاكَ إِنَّمَا لَعَنَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْوَاصِلَةَ الَّتِي تَزْنِي فِي شَبَابِهَا فَلَمَّا كَبِرَتْ قَادَتِ النِّسَاءَ إِلَى الرِّجَالِ فَتِلْكَ الْوَاصِلَةُ وَ الْمَوْصُولَةُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Abdul Rahman Bin Abu Hashim, from Salim Bin Mukram, from Sa’ad Al Iskaf who said, \n‘Abu Ja’far<sup>asws</sup> was asked about the ribbons which the women place in their heads attached to their hairs, so he<sup>asws</sup> said: ‘There is no problem for the woman with whatever she adorns herself with for her husband’. \nHe (the narrator) said, ‘So I said to him<sup>asws</sup>, ‘It has reached us that Rasool-Allah<sup>saww</sup> cursed the connector (hair dresser) and the connected (client)’. So he<sup>asws</sup> said: ‘It is not over there (what you are thinking it to be). But rather, Rasool-Allah<sup>saww</sup> cursed the connector (hair dresser) who used to commit adultery during her youth, so when she grew older, she led the women to the men (for adultery), so that is the connector and the connected (who are cursed)’."}]}, {"index": 8496, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:5:2:36:4", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ خَلَفِ بْنِ حَمَّادٍ عَنْ عَمْرِو بْنِ ثَابِتٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَتِ امْرَأَةٌ يُقَالُ لَهَا أُمُّ طَيْبَةَ تَخْفِضُ الْجَوَارِيَ فَدَعَاهَا النَّبِيُّ ( صلى الله عليه وآله ) فَقَالَ لَهَا يَا أُمَّ طَيْبَةَ إِذَا خَفَضْتِ الْجَوَارِيَ فَأَشِمِّي وَ لَا تُجْحِفِي فَإِنَّهُ أَصْفَى لِلَوْنِ الْوَجْهِ وَ أَحْظَى عِنْدَ الْبَعْلِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Asbaat, from Khalaf Bin Hammad, from Amro Bin Sabit, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There used to be a woman called Umm Tayba who used to circumcise the girls. So the Prophet<sup>saww</sup> called her over and said to her: ‘O Umm Tayba! Whenever you circumcise the girls, so scrape (a little) and not not overdo it, for it is cleaner for the surface complexion and more pleasurable in presence of the husband’."}]}]}, "index": "al-kafi:5:2:36", "kind": "verse_list"}