{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 4"
        },
        "path": "/books/al-kafi:5:2:4",
        "titles": {
          "ar": "باب مَا يَجِبُ مِنَ الِاقْتِدَاءِ بِالْأَئِمَّةِ ( عليهم السلام ) فِي التَّعَرُّضِ لِلرِّزْقِ",
          "en": "Chapter 4 – What is Obligated from the emulating the Imams<sup>asws</sup> regarding the vulnerability of the livelihood"
        }
      }
    ],
    "index": 1216,
    "local_index": 4,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 5"
        },
        "path": "/books/al-kafi:5:2:5",
        "titles": {
          "ar": "باب الْحَثِّ عَلَى الطَّلَبِ وَ التَّعَرُّضِ لِلرِّزْقِ ",
          "en": "Chapter 5 – The urging upon seeking and the embarking for the livelihood"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:5:2:3",
        "titles": {
          "ar": "باب الِاسْتِعَانَةِ بِالدُّنْيَا عَلَى الْآخِرَةِ ",
          "en": "Chapter 3 – The utilization of the world upon (attaining) the Hereafter"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:4",
    "titles": {
      "ar": "باب مَا يَجِبُ مِنَ الِاقْتِدَاءِ بِالْأَئِمَّةِ ( عليهم السلام ) فِي التَّعَرُّضِ لِلرِّزْقِ",
      "en": "Chapter 4 – What is Obligated from the emulating the Imams<sup>asws</sup> regarding the vulnerability of the livelihood"
    },
    "verse_count": 16,
    "verse_start_index": 8316,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/16)"
        ],
        "index": 8317,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:4:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ مُحَمَّدَ بْنَ الْمُنْكَدِرِ كَانَ يَقُولُ مَا كُنْتُ أَرَى أَنَّ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) يَدَعُ خَلَفاً أَفْضَلَ مِنْهُ حَتَّى رَأَيْتُ ابْنَهُ مُحَمَّدَ بْنَ عَلِيٍّ ( عليه السلام ) فَأَرَدْتُ أَنْ أَعِظَهُ فَوَعَظَنِي فَقَالَ لَهُ أَصْحَابُهُ بِأَيِّ شَيْ‏ءٍ وَعَظَكَ",
          "قَالَ خَرَجْتُ إِلَى بَعْضِ نَوَاحِي الْمَدِينَةِ فِي سَاعَةٍ حَارَّةٍ فَلَقِيَنِي أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ عَلِيٍّ وَ كَانَ رَجُلًا بَادِناً ثَقِيلًا وَ هُوَ مُتَّكِئٌ عَلَى غُلَامَيْنِ أَسْوَدَيْنِ أَوْ مَوْلَيَيْنِ فَقُلْتُ فِي نَفْسِي سُبْحَانَ اللَّهِ شَيْخٌ مِنْ أَشْيَاخِ قُرَيْشٍ فِي هَذِهِ السَّاعَةِ عَلَى هَذِهِ الْحَالِ فِي طَلَبِ الدُّنْيَا أَمَا لَأَعِظَنَّهُ",
          "فَدَنَوْتُ مِنْهُ فَسَلَّمْتُ عَلَيْهِ فَرَدَّ عَلَيَّ السَّلَامَ بِنَهْرٍ وَ هُوَ يَتَصَابُّ عَرَقاً فَقُلْتُ أَصْلَحَكَ اللَّهُ شَيْخٌ مِنْ أَشْيَاخِ قُرَيْشٍ فِي هَذِهِ السَّاعَةِ عَلَى هَذِهِ الْحَالِ فِي طَلَبِ الدُّنْيَا أَ رَأَيْتَ لَوْ جَاءَ أَجَلُكَ وَ أَنْتَ عَلَى هَذِهِ الْحَالِ مَا كُنْتَ تَصْنَعُ فَقَالَ لَوْ جَاءَنِي الْمَوْتُ وَ أَنَا عَلَى هَذِهِ الْحَالِ جَاءَنِي وَ أَنَا فِي [طَاعَةٍ مِنْ] طَاعَةِ اللَّهِ عَزَّ وَ جَلَّ أَكُفُّ بِهَا نَفْسِي وَ عِيَالِي عَنْكَ وَ عَنِ النَّاسِ وَ إِنَّمَا كُنْتُ أَخَافُ أَنْ لَوْ جَاءَنِي الْمَوْتُ وَ أَنَا عَلَى مَعْصِيَةٍ مِنْ مَعَاصِي اللَّهِ ",
          "فَقُلْتُ صَدَقْتَ يَرْحَمُكَ اللَّهُ أَرَدْتُ أَنْ أَعِظَكَ فَوَعَظْتَنِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Ibn Abu Umery, from Abdul Rahman Bin Al Hajjan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Muhammad Bin Al-Munkadir was saying, ‘I did not view that Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> would leave behind someone better than him<sup>asws</sup> until I saw his<sup>asws</sup> son<sup>asws</sup> Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>. So I intended to advise him<sup>asws</sup>, but he<sup>asws</sup> advised me instead’. So his companions said to him, ‘With which thing did he<sup>asws</sup> advise you?’  ",
            "He said, ‘I went out to one of the areas of Al-Medina in a time of heat, so I met Abu Ja’far Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup>, and he<sup>asws</sup> was a man of a hefty body, and he<sup>asws</sup> was leaning upon two black slaves, or two friends. So I said to myself, ‘Glory be to Allah<sup>azwj</sup>! A Sheykh from the Sheykhs of Qureysh, in this time, upon this state, in seeking the world. I shall advise him<sup>asws</sup>’. ",
            "So I approached him<sup>asws</sup> and greeted him<sup>asws</sup>. So he<sup>asws</sup> returned the greeting with a rebuke. So I said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! A Sheykh from the Sheykhs of Qureysh in this time, upon this state, in seeking the world. What is your<sup>asws</sup> view if your death were to come and you<sup>asws</sup> were upon this state, what would you<sup>asws</sup> do?’ So he<sup>asws</sup> said: ‘If the death comes to me<sup>asws</sup> and I<sup>asws</sup> upon this state, it would come to me<sup>asws</sup> while I<sup>asws</sup> was in the obedience from Allah<sup>azwj</sup> Mighty and Majestic. I<sup>asws</sup> would restrain by it myself<sup>asws</sup>, and my<sup>asws</sup> family from you and from the people. But rather, I<sup>asws</sup> was fearing if the death were to come to me<sup>asws</sup>, and I<sup>asws</sup> was upon disobedience from Allah<sup>azwj</sup>’. ",
            "So I said, ‘You<sup>asws</sup> speak the truth, may Allah<sup>azwj</sup> have Mercy on you<sup>asws</sup>. I intended to advise you<sup>asws</sup>, but you<sup>asws</sup> have advised me instead’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father and Muhammad ibn ‘Isma’il from al-Fadl ibn Shadhan all from ibn abu ‘Umayr from ‘ Abd al- Rahman ibn al-Hajjaj who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Muhammad ibn al-Munkadir has said, ‘I did not think Ali ibn Al-Husayn, ‘Alayhi al-Salam, might leave behind a successor better than his own-self. Time passed and I one day saw his son, Muhammad ibn Ali, ‘Alayhi al-Salam. I decided to give him certain words of good advice but I, instead, learned a lesson from him.’ His people then asked him, ‘How did he make you learn a lesson?’ He replied, ‘One day I went outside the city of al-Madinah when it was very hot and I met Muhammad ibn Ali, ‘Alayhi al-Salam, who was a person of a large body frame and heavy. Two of his black slaves or friends were supporting him. I thought, Allah is free of all defects, here is this old man from Quraysh in this hot time of the day in this condition in search of the worldly gains, thus I must give him certain words of good advice. I went nearer to him and offered him greeting of peace. He responded with somewhat frowning face, and his perspiration drops were falling a great deal. I then said, ‘May Allah keep you well. You are a Shaykh of the Shaykhs of Quraysh. Why should you in such a hot hour of the day in such condition strive for the worldly gains? Suppose if death approached you in this condition what would you do?’ He (the Imam) replied, ‘If death approaches me in this condition it finds me obeying the commandment of Allah, most Majestic, most Glorious. It finds me safeguarding my dignity, and my family from people like you and others. I should be afraid if death approaches me when I am in a condition of disobeying Allah.’ I then said, ‘You have spoken the truth. I pray to Allah to keep you well. I wanted to give you good advice; instead I learned a lesson from you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/17)"
        ],
        "index": 8318,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:4:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ شَرِيفِ بْنِ سَابِقٍ عَنِ الْفَضْلِ بْنِ أَبِي قُرَّةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ صَلَوَاتُ اللَّهِ عَلَيْهِ يَضْرِبُ بِالْمَرِّ وَ يَسْتَخْرِجُ الْأَرَضِينَ وَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَمَصُّ النَّوَى بِفِيهِ وَ يَغْرِسُهُ فَيَطْلُعُ مِنْ سَاعَتِهِ وَ إِنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) أَعْتَقَ أَلْفَ مَمْلُوكٍ مِنْ مَالِهِ وَ كَدِّ يَدِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Shareef Bin Sabiq, from Al Fazl Bin Abu Qurra, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> used to strike with the shovel and extract the lands (digging), and Rasool-Allah<sup>saww</sup> used to such the dates with his<sup>saww</sup> mouth, and he<sup>saww</sup> plant it (seed), so it would sprout within an hour; and that Amir Al-Momineen<sup>asws</sup> freed one thousand owned slaves from his<sup>asws</sup> own wealth, and the toil of his<sup>asws</sup> own hands’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from Sharif Sabiq formal-Fadl ibn abu Qurrah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Amir al-Mu’minin, ‘Alayhi al-Salam, would work with a shovel and dig the soil. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, placed date stones in his mouth and then planted it and it would sprout in the same hour. Amir al-Mu’minin, ‘Alayhi al-Salam, had set free one thousand slaves for which he paid from his own properties and his own labor.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/17)"
        ],
        "index": 8319,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:4:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَبْدِ اللَّهِ بْنِ الدِّهْقَانِ عَنْ دُرُسْتَ عَنْ عَبْدِ الْأَعْلَى مَوْلَى آلِ سَامٍ قَالَ اسْتَقْبَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فِي بَعْضِ طُرُقِ الْمَدِينَةِ فِي يَوْمٍ صَائِفٍ شَدِيدِ الْحَرِّ فَقُلْتُ جُعِلْتُ فِدَاكَ حَالُكَ عِنْدَ اللَّهِ عَزَّ وَ جَلَّ وَ قَرَابَتُكَ مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ أَنْتَ تُجْهِدُ لِنَفْسِكَ فِي مِثْلِ هَذَا الْيَوْمِ فَقَالَ يَا عَبْدَ الْأَعْلَى خَرَجْتُ فِي طَلَبِ الرِّزْقِ لِأَسْتَغْنِيَ عَنْ مِثْلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Abdullah Bin Al Dahqan, from Dorost, from Abdul A’ala a slave of the progeny of Saam who said, ",
            "‘I came across Abu Abdullah in one of the streets of Al-Medina during a scorching day of intense heat. So I said, ‘May I be sacrificed for you<sup>asws</sup>! Your<sup>asws</sup> have a (prominent) status with Allah<sup>azwj</sup> Mighty and Majestic and nearness to Rasool-Allah<sup>saww</sup>, and you<sup>asws</sup> are striving for yourself<sup>asws</sup> in a day like this?’ So he<sup>asws</sup> said: ‘O Abdul A’ala! I<sup>asws</sup> have come out regarding seeking the livelihood in order to be needless from the likes of you’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from ‘Abd Allah al-Dihqan from Durust from ‘Abd al-A’la’, Mawla’ Ale Sam who has said the following: “I once came face to face with abu ‘Abd Allah, ‘Alayhi al-Salam, in one of the streets of al-Madinah on a very hot summer day. I said, ‘I pray to Allah to keep my soul in service for your cause, you have a prominent position before Allah, most Majestic, most Glorious, and you are of very close relatives of the Messenger of Allah and you are (not to be) striving in a day like this.’ He (the Imam) said, ‘O ‘Abd al-‘A‘la’, I came out in search for my sustenance so that I would not need to spread my hands before you (your fellow) humankind for help.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/17)"
        ],
        "index": 8320,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:4:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ سَيْفِ بْنِ عَمِيرَةَ وَ سَلَمَةَ صَاحِبِ السَّابِرِيِّ عَنْ أَبِي أُسَامَةَ زَيْدٍ الشَّحَّامِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) أَعْتَقَ أَلْفَ مَمْلُوكٍ مِنْ كَدِّ يَدِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, form Ibn Abu Umeyr, from Sayf Bin Ameyra, and Salma Sahib Al Sabiry, from Abu Asama Zayd Al Shahaam, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that Amir Al-Momineen<sup>asws</sup> freed a thousand owned slaves from the toil of his<sup>asws</sup> own hands’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Sayf ibn ‘Amirah and Salmah Sahib al-Sabiriy from abu ‘Usamah Zayd al-Shahham who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin, ‘Alayhi al-Salam, had set free one thousand slaves by means of what he had earned with his own hands.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/18)"
        ],
        "index": 8321,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:4:5",
        "text": [
          "أَحْمَدُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ شَرِيفِ بْنِ سَابِقٍ عَنِ الْفَضْلِ بْنِ أَبِي قُرَّةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى دَاوُدَ ( عليه السلام ) أَنَّكَ نِعْمَ الْعَبْدُ لَوْ لَا أَنَّكَ تَأْكُلُ مِنْ بَيْتِ الْمَالِ وَ لَا تَعْمَلُ بِيَدِكَ شَيْئاً ",
          "قَالَ فَبَكَى دَاوُدُ ( عليه السلام ) أَرْبَعِينَ صَبَاحاً فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى الْحَدِيدِ أَنْ لِنْ لِعَبْدِي دَاوُدَ فَأَلَانَ اللَّهُ عَزَّ وَ جَلَّ لَهُ الْحَدِيدَ فَكَانَ يَعْمَلُ كُلَّ يَوْمٍ دِرْعاً فَيَبِيعُهَا بِأَلْفِ دِرْهَمٍ فَعَمِلَ ثَلَاثَمِائَةٍ وَ سِتِّينَ دِرْعاً فَبَاعَهَا بِثَلَاثِمِائَةٍ وَ سِتِّينَ أَلْفاً وَ اسْتَغْنَى عَنْ بَيْتِ الْمَالِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Abu Abdullah, from Sahreef Bin Sabiq, from Al Fazl Bin Abu Qurra, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that Amir Al-Momineen<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Revealed unto Dawood<sup>as</sup>: “You<sup>as</sup> would be the best of the servants had it not been your<sup>as</sup> consuming from the public treasury and not doing any work with your<sup>as</sup> own hands’. ",
            "He<sup>asws</sup> said: ‘So Dawood<sup>as</sup> wept for forty mornings. So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto the iron: “Soften yourself for My<sup>azwj</sup> servant!” Thus, Allah<sup>azwj</sup> Mighty and Majestic Softened the iron for him<sup>as</sup>, and he<sup>as</sup> used to make an armour every day and he<sup>as</sup> would sell it for a thousand Dirhams. So he<sup>as</sup> made three hundred and sixty armours and sold them for three hundred and sixty thousand, and became needless of the public treasury’."
          ],
          "en.sarwar": [
            "5. Ahmad ibn abu ‘ Abd Allah has narrated from Sharif ibn Sabiq from al-Fadl ibn abu Qurrah who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin, has said, ‘Allah, most Majestic, most Glorious, sent revelations to Dawud, ‘Alayhi al-Salam that said, ‘You are a very good servant had you not been spending on yourself from the public treasury while doing no work with your own hands.’ He (the Imam) said, ‘Dawud ‘Alayhi al-Salam wept for forty mornings. Allah, most Majestic, most Glorious, then inspired Iron, “You must become soft for My servant, Dawud.” Allah, most Majestic, most Glorious, softened Iron for him. Everyday he would make one coat of arms and sell it for one thousand dirham. He made three hundred sixty coats of arm and sold them for three hundred sixty thousand dirham. Thereafter he did not need anything from the public treasury.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/18)"
        ],
        "index": 8322,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:4:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَقِيَ رَجُلٌ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) وَ تَحْتَهُ وَسْقٌ مِنْ نَوًى فَقَالَ لَهُ مَا هَذَا يَا أَبَا الْحَسَنِ تَحْتَكَ فَقَالَ مِائَةُ أَلْفِ عَذْقٍ إِنْ شَاءَ اللَّهُ قَالَ فَغَرَسَهُ فَلَمْ يُغَادَرْ مِنْهُ نَوَاةٌ وَاحِدَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘A man came across Amir Al-Momineen<sup>asws</sup> and under him<sup>asws</sup> was a pile of date stones. So he said to him<sup>asws</sup>, ‘What is this underneath you<sup>asws</sup>, O Abu Al-Hassan<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘One hundred thousand clusters (of dates) Allah<sup>azwj</sup> Willing’. He<sup>asws</sup> (Abu Abdullah<sup>asws</sup>) said: ‘He<sup>asws</sup> planted them, so not a single stone from it failed to sprout’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from ibn Bukayr from Zurarah who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said that a man once visited Amir al-Mu’minin, ‘Alayhi al-Salam, and found him sitting on a camel-load of date stones. He asked, ‘What is it on which you are sitting, O abu al-Hassan?’ He (the Imam) replied, ‘It is a hundred thousand palm trees, by the will of Allah.’ He planted them and not one date stone failed sprouting.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/18)"
        ],
        "index": 8323,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:4:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي الْمَغْرَاءِ عَنْ عَمَّارٍ السِّجِسْتَانِيِّ عَنْ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ ( عليه السلام ) أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) وَضَعَ حَجَراً عَلَى الطَّرِيقِ يَرُدُّ الْمَاءَ عَنْ أَرْضِهِ فَوَ اللَّهِ مَا نَكَبَ بَعِيراً وَ لَا إِنْسَاناً حَتَّى السَّاعَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from IBn Abu Umeyr, from Abu Al Magra, from Ammar Al Sajastany, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, from his<sup>asws</sup> father<sup>asws</sup> that Rasool-Allah<sup>saww</sup> placed a rock upon the path to divert the water, from his<sup>saww</sup> land, so by Allah<sup>azwj</sup>, neither has a camel nor a human being has moved it until this time’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from ibn abu ‘ Umayr from Abu al-Maghra’ from ‘Am mar al-Sajistaniy from abu ‘Abd Allah, from his father, ‘Alayhi al-Salam, who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, once placed a piece of stone on the waterway to prevent it from flowing into his land. By Allah, until this day no human being or camel has moved it away.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/18)"
        ],
        "index": 8324,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:4:8",
        "refs": {
          "Quran": [
            "/books/quran:24:36",
            "/books/quran:24:37"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَسْبَاطِ بْنِ سَالِمٍ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَسَأَلَنَا عَنْ عُمَرَ بْنِ مُسْلِمٍ مَا فَعَلَ فَقُلْتُ صَالِحٌ وَ لَكِنَّهُ قَدْ تَرَكَ التِّجَارَةَ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَمَلُ الشَّيْطَانِ ثَلَاثاً أَ مَا عَلِمَ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) اشْتَرَى عِيراً أَتَتْ مِنَ الشَّامِ فَاسْتَفْضَلَ فِيهَا مَا قَضَى دَيْنَهُ وَ قَسَمَ فِي قَرَابَتِهِ ",
          "يَقُولُ اللَّهُ عَزَّ وَ جَلَّ رِجالٌ لا تُلْهِيهِمْ تِجارَةٌ وَ لا بَيْعٌ عَنْ ذِكْرِ اللَّهِ إِلَى آخِرِ الْآيَةِ يَقُولُ الْقُصَّاصُ إِنَّ الْقَوْمَ لَمْ يَكُونُوا يَتَّجِرُونَ كَذَبُوا وَ لَكِنَّهُمْ لَمْ يَكُونُوا يَدَعُونَ الصَّلَاةَ فِي مِيقَاتِهَا وَ هُوَ أَفْضَلُ مِمَّنْ حَضَرَ الصَّلَاةَ وَ لَمْ يَتَّجِرْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Asbaat Bin Salim who said, ",
            "‘I went over to Abu Abdullah<sup>asws</sup>, so he<sup>asws</sup> asked about Umar Bin Muslim, what he does. So I said, ‘A righteous man but, he neglects the business. So Abu Abdullah<sup>asws</sup> said: ‘The work of Satan<sup>la</sup>’, (saying it) three times. ‘Does he not know that Rasool-Allah<sup>azwj</sup> bought a caravan of camels which came from Syria, so he<sup>saww</sup> saved in it what paid off his<sup>saww</sup> debts, and distributed among his<sup>saww</sup> relatives? ",
            "Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:24#h37\">[24:37]</a> Men whom neither merchandise nor selling diverts from the Remembrance of Allah </span>– up to the end of the Verse. The story-tellers are saying these are the people who did not become merchants. They are lying. But, they did not becoming fulfillers of the Prayer during its (prescribed) timings, and it is superior than the one who attends the Prayer and does not trade’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Asbat ibn Salim who has said the following: “I once visited abu ‘Abd Allah, ‘Alayhi al-Salam. He (the Imam) asked us about ‘Umar ibn Muslim and about what he has done. I replied, ‘He is a virtuous man but has given up doing business works.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, said three times: It is the work of Satan. Did he not know that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, once bought a caravan that had come from al-Sham (Syria) in which he saved enough money to pay off his debts and distributed the extra among his relatives? Allah, most Majestic, most Glorious, says, “There are men who are not distracted by selling and buying from speaking of Allah. . . .” <a href=\"/#/books/quran:24#h36\">[24:36]</a> Story tellers say, “These people (mentioned in this verse) did not involve themselves in trading and in business works.” These story tellers speak lies. The fact is that those people did not perform Salat (prayer) in (more virtuous) times and such people are more virtuous than those who attend Salat (prayer) and ignore trade and business work.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/19)"
        ],
        "index": 8325,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:4:9",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) كَانَ يَخْرُجُ وَ مَعَهُ أَحْمَالُ النَّوَى فَيُقَالُ لَهُ يَا أَبَا الْحَسَنِ مَا هَذَا مَعَكَ فَيَقُولُ نَخْلٌ إِنْ شَاءَ اللَّهُ فَيَغْرِسُهُ فَلَمْ يُغَادَرْ مِنْهُ وَاحِدَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ibn Mahboub, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said that Amir Al-Momineen<sup>asws</sup> went out and with him<sup>asws</sup> was a load of date stones. So it was said to him<sup>asws</sup>, ‘O Abu Al-Hassan<sup>asws</sup>! What is this with you<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘Palm trees, Allah<sup>azwj</sup> Willing’. So he<sup>asws</sup> planted them, and not a single one of them failed to sprout’."
          ],
          "en.sarwar": [
            "9. A number of our people have narrated from Sahl ibn Ziyad from Ibn Mahbub from ‘Abd Allah ibn Sinan who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin, ‘Alayhi al-Salam, would go to work with large quantities of date stones. He was asked, ‘What are these, O abu al-Hassan?’ He (the Imam) replied, ‘They are palm trees, by the will of Allah.’ He then planted them and not a single piece failed sprouting.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/19)"
        ],
        "index": 8326,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:4:10",
        "text": [
          "سَهْلُ بْنُ زِيَادٍ عَنِ الْجَامُورَانِيِّ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِيهِ قَالَ رَأَيْتُ أَبَا الْحَسَنِ ( عليه السلام ) يَعْمَلُ فِي أَرْضٍ لَهُ قَدِ اسْتَنْقَعَتْ قَدَمَاهُ فِي الْعَرَقِ فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ أَيْنَ الرِّجَالُ فَقَالَ يَا عَلِيُّ قَدْ عَمِلَ بِالْيَدِ مَنْ هُوَ خَيْرٌ مِنِّي فِي أَرْضِهِ وَ مِنْ أَبِي فَقُلْتُ لَهُ وَ مَنْ هُوَ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ أَمِيرُ الْمُؤْمِنِينَ وَ آبَائِي ( عليهم السلام ) كُلُّهُمْ كَانُوا قَدْ عَمِلُوا بِأَيْدِيهِمْ وَ هُوَ مِنْ عَمَلِ النَّبِيِّينَ وَ الْمُرْسَلِينَ وَ الْأَوْصِيَاءِ وَ الصَّالِحِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl Bin Ziyad, from Al Jamourany, from Al Hassan Bin Ali Bin Abu Hamza, from his father who said, ",
            "‘(The narrator says) I saw Abu Al-Hassan<sup>asws</sup> working in a land of his<sup>asws</sup>. His<sup>asws</sup> feet were drenched in the sweat, so I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Where are the men (workers)?’ So he<sup>asws</sup> said: ‘O Ali! There have worked by their hands in their land, the ones who were better than I<sup>asws</sup> and my<sup>asws</sup> father<sup>asws</sup>’. So I said to him<sup>asws</sup>, ‘Who are they?’ So he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> and Amir Al-Momineen<sup>asws</sup>, and my<sup>asws</sup> forefathers<sup>asws</sup>, all of them<sup>asws</sup> had worked by their<sup>asws</sup> hands, and it is from the deeds of the Prophets<sup>as</sup>, and the Mursil Prophets<sup>as</sup>, and the successors<sup>as</sup>, and the righteous ones’."
          ],
          "en.sarwar": [
            "10. Sahl ibn Ziyad has narrated from al-Jamuraniy from al-Hassan ibn Ali ibn abu Hamzah from his father who has said the following: “I once saw abu al-Hassan, ‘Alayhi al-Salam, working in his land and his feet were drenched in perspiration. I asked, ‘I pray to Allah to keep my soul in service for your cause, where are men (workers)?’ He (the Imam) replied, ‘O Ali, people better than my father and I worked in their land.’ I then asked, ‘Who were they?’ He (the Imam) replied, ‘They were the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and ’Amir al- Mu’minin, and my ancestors, Alayhim al-Salam, all of them worked with their hands and it is of the practice of the prophets, messengers, the executors of the wills and the virtuous people.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/19)"
        ],
        "index": 8327,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:4:11",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ سِنَانٍ عَنْ إِسْمَاعِيلَ بْنِ جَابِرٍ قَالَ أَتَيْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ إِذَا هُوَ فِي حَائِطٍ لَهُ بِيَدِهِ مِسْحَاةٌ وَ هُوَ يَفْتَحُ بِهَا الْمَاءَ وَ عَلَيْهِ قَمِيصٌ شِبْهَ الْكَرَابِيسِ كَأَنَّهُ مَخِيطٌ عَلَيْهِ مِنْ ضِيقِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Sinan, from Ismail Bin Jabir who said, ",
            "‘I went over to Abu Abdullah<sup>asws</sup>, and he<sup>asws</sup> was by a wall of his<sup>asws</sup> and in his<sup>asws</sup> hand was a spade, and he<sup>asws</sup> was opening the water (way) with it, and upon him<sup>asws</sup> was a shirt of cotton threads, as if it was stitched upon him<sup>asws</sup> due to its tightness."
          ],
          "en.sarwar": [
            "11. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Sinan from ‘Isma’il ibn Jabir who has said the following: “I once visited abu ‘Abd Allah, ‘Alayhi al-Salam, and found him inside his walls with a shovel in his hand. He was opening the waterway. His shirt was of a fabric made of thick cotton threads (karabis) which was of very small size for him.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/20)"
        ],
        "index": 8328,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:4:12",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ مُحَمَّدِ بْنِ عُذَافِرٍ عَنْ أَبِيهِ قَالَ أَعْطَى أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَبِي أَلْفاً وَ سَبْعَمِائَةِ دِينَارٍ فَقَالَ لَهُ اتَّجِرْ بِهَا ثُمَّ قَالَ أَمَا إِنَّهُ لَيْسَ لِي رَغْبَةٌ فِي رِبْحِهَا وَ إِنْ كَانَ الرِّبْحُ مَرْغُوباً فِيهِ وَ لَكِنِّي أَحْبَبْتُ أَنْ يَرَانِيَ اللَّهُ جَلَّ وَ عَزَّ مُتَعَرِّضاً لِفَوَائِدِهِ",
          "قَالَ فَرَبِحْتُ لَهُ فِيهَا مِائَةَ دِينَارٍ ثُمَّ لَقِيتُهُ فَقُلْتُ لَهُ قَدْ رَبِحْتُ لَكَ فِيهَا مِائَةَ دِينَارٍ قَالَ فَفَرِحَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) بِذَلِكَ فَرَحاً شَدِيداً فَقَالَ لِي أَثْبِتْهَا فِي رَأْسِ مَالِي",
          "قَالَ فَمَاتَ أَبِي وَ الْمَالُ عِنْدَهُ فَأَرْسَلَ إِلَيَّ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَكَتَبَ عَافَانَا اللَّهُ وَ إِيَّاكَ إِنَّ لِي عِنْدَ أَبِي مُحَمَّدٍ أَلْفاً وَ ثَمَانَمِائَةِ دِينَارٍ أَعْطَيْتُهُ يَتَّجِرُ بِهَا فَادْفَعْهَا إِلَى عُمَرَ بْنِ يَزِيدَ ",
          "قَالَ فَنَظَرْتُ فِي كِتَابِ أَبِي فَإِذاً فِيهِ لِأَبِي مُوسَى عِنْدِي أَلْفٌ وَ سَبْعُمِائَةِ دِينَارٍ وَ اتُّجِرَ لَهُ فِيهَا مِائَةُ دِينَارٍ عَبْدُ اللَّهِ بْنُ سِنَانٍ وَ عُمَرُ بْنُ يَزِيدَ يَعْرِفَانِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Asbaat, from Muhammad Bin Uzafir, from his father who said, ",
            "‘Abu Abdullah<sup>asws</sup> gave my father one thousand and seven hundred Dinars, so he<sup>asws</sup> said to him: ‘Trade with these’. Then he<sup>asws</sup> said: ‘There is no real interest for me<sup>asws</sup> in its profits, although the profits are desireable in it, but I<sup>asws</sup> it that Allah<sup>azwj</sup> Majestic and Mighty Sees me<sup>asws</sup> working for its benefits’.",
            "He (the narrator) said, ‘So I made a gain of one hundred Dinars for him in it. Then I met up with him<sup>asws</sup>, so I said to him<sup>asws</sup>, ‘I have made a gain for you in it, of one hundred Dinars’. So Abu Abdullah<sup>asws</sup> was happy with that with an intense happiness, and he<sup>asws</sup> said to me: ‘Corroborate it in the capital of my<sup>asws</sup> wealth’. ",
            "He (the narrator) said, ‘So my father dies and the wealth was with him. So Abu Abdullah<sup>asws</sup> sent a message to me, writing: ‘May Allah<sup>azwj</sup> Grant us<sup>asws</sup> and you good health. There is for me<sup>asws</sup> with your father Muhammad, one thousand and eight hundred Dinars, I<sup>asws</sup> had given him to trade with. So hand it over to Umar Bin Yazeed’. ",
            "He (the narrator) said, ‘So I looked in the book of my father, so there was in it for Abu Musa<sup>asws</sup>, with me, a thousand and seven hundred Dinars, and I had profited for him<sup>asws</sup> in it by one hundred Dinars which Abdullah Bin Sinan and Umar Bin Yazeed both knew of it’."
          ],
          "en.sarwar": [
            "12. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Asbat from Muhammad ibn ‘Adhafir from his father who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, once gave my father one thousand seven hundred dinars and told him to use them in business. He (the Imam) then said, ‘I am not interested in its profits, even though profits are desirable. I love, however, that Allah, most Majestic, most Glorious, see me work to make profits.’ He (the narrator) has said, ‘I then made one hundred dinar profit for him. I met him and informed him about the one hundred dinar profits.’ He (the narrator) has said that abu ‘Abd Allah, ‘Alayhi al-Salam, became very happy about it and told me to keep it with his capital. He (the narrator) has said that my father passed away and goods were with him. Abu ‘Abd Allah, ‘Alayhi al-Salam, then wrote to me, ‘May Allah grant to us and to you good health. There is my one thousand eight hundred dinar with abu Muhammad which I had given him to use in business. You must give this amount to ‘Umar ibn Yazid.’ He (the narrator) has said, that I then checked the record of my father and found that one thousand seven hundred dinars were due in favor of abu Musa, ‘Alayhi al-Salam, and I had earned one hundred dinars profit, ‘Abd Allah ibn Sinan and ‘Umar ibn Yazid knew him.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/20)"
        ],
        "index": 8329,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:4:13",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنِ الْقَاسِمِ بْنِ سُلَيْمَانَ قَالَ حَدَّثَنِي جَمِيلُ بْنُ صَالِحٍ عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ قَالَ رَأَيْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ بِيَدِهِ مِسْحَاةٌ وَ عَلَيْهِ إِزَارٌ غَلِيظٌ يَعْمَلُ فِي حَائِطٍ لَهُ وَ الْعَرَقُ يَتَصَابُّ عَنْ ظَهْرِهِ فَقُلْتُ جُعِلْتُ فِدَاكَ أَعْطِنِي أَكْفِكَ فَقَالَ لِي إِنِّي أُحِبُّ أَنْ يَتَأَذَّى الرَّجُلُ بِحَرِّ الشَّمْسِ فِي طَلَبِ الْمَعِيشَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from his father, from Al Nazar Bin Suweyd, from Al Qasim Bin Suleyman, from Jameel Bin Salih, from Abu Amro Al Shaybani who said, ",
            "‘I saw Abu Abdullah<sup>asws</sup>, and in his<sup>asws</sup> hand was a shovel, and upon him<sup>asws</sup> was a coarse trouser, working in a wall of his<sup>asws</sup>, and the sweat was running from his<sup>asws</sup> back. So I said, ‘May I be sacrificed for you<sup>asws</sup>! Give it to me, I shall suffice for you<sup>asws</sup>’. So he<sup>asws</sup> said to me: ‘I<sup>asws</sup> love it that the man should be hurt by the heat of the sun in seeking the livelihood’."
          ],
          "en.sarwar": [
            "13. A number of our people have narrated from Ahmad ibn ‘Abd Allah from his father from al-Nadr ibn Suwayd from al-Qasim ibn Muhammad ibn Sulayman who has said that narrated to him Jamil ibn Salih from abu ‘Amr al-Shaybaniy who has said the following: “I once saw abu ‘Abd Allah, ‘Alayhi al-Salam, with a shovel in his hand wearing a very thick dress working inside his walls and his back drenched in perspiration. I then asked, I pray to Allah to keep my soul in service for your cause, allow me to help you.’ He said to me, ‘I Love that man endures hardships in the hot sun to make a living.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/21)"
        ],
        "index": 8330,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:4:14",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ زُرَارَةَ قَالَ إِنَّ رَجُلًا أَتَى أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ إِنِّي لَا أُحْسِنُ أَنْ أَعْمَلَ عَمَلًا بِيَدِي وَ لَا أُحْسِنُ أَنْ أَتَّجِرَ وَ أَنَا مُحَارَفٌ مُحْتَاجٌ فَقَالَ اعْمَلْ فَاحْمِلْ عَلَى رَأْسِكَ وَ اسْتَغْنِ عَنِ النَّاسِ فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَدْ حَمَلَ حَجَراً عَلَى عَاتِقِهِ فَوَضَعَهُ فِي حَائِطٍ لَهُ مِنْ حِيطَانِهِ وَ إِنَّ الْحَجَرَ لَفِي مَكَانِهِ وَ لَا يُدْرَى كَمْ عُمْقُهُ إِلَّا أَنَّهُ ثَمَّ [بِمُعْجِزَتِهِ] ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from IBn Abu Umeyr, from Umar Bin Azina, from Zurara, that, ",
            "‘A man came over to Abu Abdullah<sup>asws</sup>, so he said, ‘I am not good at doing manual work with my hands, and I am not good at trading, and I am deprived, needy’. So he<sup>asws</sup> said: ‘Work, so carry upon your head, and be needless from the people, for Rasool-Allah<sup>saww</sup> had carried rocks upon his<sup>saww</sup> shoulders, and he<sup>saww</sup> placed then in a wall from the walls of his<sup>saww</sup>, and the rock is (still) in its place, and it is not known how much its depth is, except that it is there (by a miracle)’."
          ],
          "en.sarwar": [
            "14. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ‘Udhaynah from Zurarah who has said the following: “Once a man came to abu ‘Abd Allah, ‘Alayhi al-Salam, and said, ‘I am not good in working with my hands and I am not good in doing business, thus I am deprived and needy.’ He (the Imam) said, ‘You must work and carry it on your head and set yourself free from asking people for help. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, carried a stone on his shoulder to place it in a certain place of his walls. The stone is still in its place, and it is not known how large it is, but it is there [by his miracle]”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/21)"
        ],
        "index": 8331,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:4:15",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنِّي لَأَعْمَلُ فِي بَعْضِ ضِيَاعِي حَتَّى أَعْرَقَ وَ إِنَّ لِي مَنْ يَكْفِينِي لِيَعْلَمَ اللَّهُ عَزَّ وَ جَلَّ أَنِّي أَطْلُبُ الرِّزْقَ الْحَلَالَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin saeed, from Al Qasim Bin Muhammad, from Ali Bin Abu Hamza, from Abu Baseer who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘I<sup>asws</sup> tend to work in a site of mine<sup>asws</sup> until I<sup>asws</sup> sweat, altthough there are for me<sup>asws</sup> ones who can suffice for me<sup>asws</sup>, in order for Allah<sup>azwj</sup> to Know that I<sup>asws</sup> seek the Permissible livelihood’."
          ],
          "en.sarwar": [
            "15. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa‘id from al-Qasim ibn Muhammad from Ali ibn abu Hamzah from abu Basir from who has said the following: “I once heard abu ‘ Abd Allah, ‘Alayhi al-Salam, saying, T work in a certain site of my work to perspire, even though there are people who can do all the work instead of me but I work so Allah, most Majestic, most Glorious, finds me striving to find lawful sustenance.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/21)"
        ],
        "index": 8332,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:4:16",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ عُذَافِرٍ عَنْ أَبِيهِ قَالَ دَفَعَ إِلَيَّ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) سَبْعَمِائَةِ دِينَارٍ وَ قَالَ يَا عُذَافِرُ اصْرِفْهَا فِي شَيْ‏ءٍ أَمَّا عَلَى ذَاكَ مَا بِي شَرَهٌ وَ لَكِنْ أَحْبَبْتُ أَنْ يَرَانِيَ اللَّهُ عَزَّ وَ جَلَّ مُتَعَرِّضاً لِفَوَائِدِهِ ",
          "قَالَ عُذَافِرٌ فَرَبِحْتُ فِيهَا مِائَةَ دِينَارٍ فَقُلْتُ لَهُ فِي الطَّوَافِ جُعِلْتُ فِدَاكَ قَدْ رَزَقَ اللَّهُ عَزَّ وَ جَلَّ فِيهَا مِائَةَ دِينَارٍ فَقَالَ أَثْبِتْهَا فِي رَأْسِ مَالِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Ahmad Bin Abu Abdullah, from Muhammad Bin Ismail, from Muhammad Bin Uzafir, from his father who said, ",
            "‘Abu Abdullah<sup>asws</sup> handed over seven hundred Dinars to me and said, ‘O Uzafir! Spend it in something, but upon that is not greed for me<sup>asws</sup>, but I<sup>asws</sup> love it that Allah<sup>azwj</sup> Mighty and Majestic would See me<sup>asws</sup> striving for its benefits’. ",
            "Uzafir said, ‘So I made a gain in it of one hundred Dinars, so I said to him<sup>asws</sup> during the ‘الطَّوَافِ’ circumambulation, ‘May I be sacrificed for you<sup>asws</sup>! Allah<sup>azwj</sup> Mighty and Majestic has Graced one hundred Dinars in it’. So he<sup>asws</sup> said: ‘Corroborate (include) it in the capital of my<sup>asws</sup> wealth’."
          ],
          "en.sarwar": [
            "16. Ali ibn Muhammad has narrated from Ahmad ibn abu ‘Abd Allah from Muhammad ibn ‘Isma’il from Muhammad ibn ‘Adha’fir from his father who has said the following: “Once abu ‘Abd Allah, ‘Alayhi al-Salam, gave me seven hundred dinars and said, ‘O ‘Adha’fir you can spend it; I do not have any desire for it but I loved that Allah, most Majestic, most Glorious, finds me working for its profits.’ ‘Adha’fir has said, ‘I made one hundred dinar profit with it. During al- Tawaf I said to him, “I pray to Allah to keep my soul in service for your cause, Allah, most Majestic, most Glorious, has granted one hundred dinar profit.’” He (the Imam) said, ‘Add it to my capital money.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:4",
  "kind": "verse_list"
}