{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 43"
        },
        "path": "/books/al-kafi:5:2:43",
        "titles": {
          "ar": "باب أَكْلِ مَالِ الْيَتِيمِ ",
          "en": "Chapter 43 – Devouring the wealth of the orphans"
        }
      }
    ],
    "index": 1255,
    "local_index": 43,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 44"
        },
        "path": "/books/al-kafi:5:2:44",
        "titles": {
          "ar": "باب مَا يَحِلُّ لِقَيِّمِ مَالِ الْيَتِيمِ مِنْهُ",
          "en": "Chapter 44 – What is Permissible for the custodian from the wealth of the orphans"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 42"
        },
        "path": "/books/al-kafi:5:2:42",
        "titles": {
          "ar": "باب السُّحْتِ",
          "en": "Chapter 42 – The Ill-gotten Gains"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:43",
    "titles": {
      "ar": "باب أَكْلِ مَالِ الْيَتِيمِ ",
      "en": "Chapter 43 – Devouring the wealth of the orphans"
    },
    "verse_count": 5,
    "verse_start_index": 8536,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/94)"
        ],
        "index": 8537,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:43:1",
        "relations": {
          "Mentions": [
            "/books/quran:4:9",
            "/books/quran:4:11"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَوْعَدَ اللَّهُ عَزَّ وَ جَلَّ فِي مَالِ الْيَتِيمِ بِعُقُوبَتَيْنِ إِحْدَاهُمَا عُقُوبَةُ الْآخِرَةِ النَّارُ وَ أَمَّا عُقُوبَةُ الدُّنْيَا فَقَوْلُهُ عَزَّ وَ جَلَّ وَ لْيَخْشَ الَّذِينَ لَوْ تَرَكُوا مِنْ خَلْفِهِمْ ذُرِّيَّةً ضِعافاً خافُوا عَلَيْهِمْ الْآيَةَ يَعْنِي لِيَخْشَ أَنْ أَخْلُفَهُ فِي ذُرِّيَّتِهِ كَمَا صَنَعَ بِهَؤُلَاءِ الْيَتَامَى ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Usman Bin Is, from Sama’at who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic has Prepared with regards to the wealth of the orphans, two Punishments, one of the two being the Fire in the Hereafter; and as for the Punishment in the world, so these are the Words of the Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h9\">[4:9]</a> And let those fear who, should they leave behind them weakly offspring, would fear on their account</span> – the Verse; Meaning, let him fear that if he leaves behind his offspring they would be treated by them like the orphans’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from ‘Uthman ibn ‘Isa from Sama‘ah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Allah, most Majestic, most Glorious, has issued two kinds of warnings about consuming properties of orphans. One is the suffering by the fire in the next life. The punishment in this life is mentioned in the words of Allah, most Majestic, most Glorious, “Those who leave behind weak offspring for whom he is afraid. . . .” <a href=\"/#/books/quran:4#h11\">[4:11]</a> It means that one must be afraid of leaving behind weak offspring who will be treated as he has treated the orphans.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/95)"
        ],
        "index": 8538,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:43:2",
        "relations": {
          "Mentions": [
            "/books/quran:4:10",
            "/books/quran:4:12"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ عَجْلَانَ أَبِي صَالِحٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ أَكْلِ مَالِ الْيَتِيمِ فَقَالَ هُوَ كَمَا قَالَ اللَّهُ عَزَّ وَ جَلَّ إِنَّ الَّذِينَ يَأْكُلُونَ أَمْوالَ الْيَتامى ظُلْماً إِنَّما يَأْكُلُونَ فِي بُطُونِهِمْ ناراً وَ سَيَصْلَوْنَ سَعِيراً ",
          "ثُمَّ قَالَ ( عليه السلام ) مِنْ غَيْرِ أَنْ أَسْأَلَهُ مَنْ عَالَ يَتِيماً حَتَّى يَنْقَطِعَ يُتْمُهُ أَوْ يَسْتَغْنِيَ بِنَفْسِهِ أَوْجَبَ اللَّهُ عَزَّ وَ جَلَّ لَهُ الْجَنَّةَ كَمَا أَوْجَبَ النَّارَ لِمَنْ أَكَلَ مَالَ الْيَتِيمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, from Ajlan Abu Salih who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about devouring the wealth of the orphans, so he<sup>asws</sup> said: ‘It is as Allah<sup>azwj</sup> Mighty and Majestic has Said that <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h10\">[4:10]</a> (As for) those who swallow the property of the orphans unjustly, but rather they only swallow fire into their bellies and they shall arriving at the Blazing Fire</span>’.",
            "Then he<sup>asws</sup> said without I having asked him<sup>asws</sup>: ‘The one who shelters an orphan until his orphan-hood is cut off, or he becomes self-sufficient, Allah<sup>azwj</sup> Mighty and Majestic would Obligate the Paradise for him just as He<sup>azwj</sup> Obligated the Fire for the one who devours the wealth of the orphans’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hisham ibn Salim from ‘Ajlan abu Salih who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who consumes the properties of orphans. He (the Imam) said, ‘It is as Allah, most Majestic, most Glorious, has said, “Those who consume the properties of orphans unjustly, they only consume fire in their bellies and will feel the heat of the fire.” <a href=\"/#/books/quran:4#h12\">[4:12]</a>’ He (the Imam), ‘Alayhi al-Salam, then said without my asking, ‘Whoever provides an orphan until his condition as an orphan is over and becomes self-sufficient Allah, most Majestic, most Glorious, makes paradise certain for him as He makes the fire definite for those who consume the properties of orphans.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/95)"
        ],
        "index": 8539,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:43:3",
        "relations": {
          "Mentions": [
            "/books/quran:4:10",
            "/books/quran:4:12"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنِ الرَّجُلِ يَكُونُ فِي يَدِهِ مَالٌ لِأَيْتَامٍ فَيَحْتَاجُ إِلَيْهِ فَيَمُدُّ يَدَهُ فَيَأْخُذُهُ وَ يَنْوِي أَنْ يَرُدَّهُ فَقَالَ لَا يَنْبَغِي لَهُ أَنْ يَأْكُلَ إِلَّا الْقَصْدَ لَا يُسْرِفُ فَإِنْ كَانَ مِنْ نِيَّتِهِ أَنْ لَا يَرُدَّهُ عَلَيْهِمْ فَهُوَ بِالْمَنْزِلِ الَّذِي قَالَ اللَّهُ عَزَّ وَ جَلَّ إِنَّ الَّذِينَ يَأْكُلُونَ أَمْوالَ الْيَتامى ظُلْماً ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr who said, ",
            "‘I asked Abu Al Hassan<sup>asws</sup> about the man who happens to have the wealth of the orphan in his hands, so he is needy to it and he extends his hand and takes it, and he intends to return it, so he<sup>asws</sup> said: ‘It is not befitting for him that he consumes except in moderation not being extravagant. So if it was from his intention that he would not be returning it upon them, so he would be at the status of those for whom Allah<sup>azwj</sup> Mighty and Majestic Says <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h10\">[4:10]</a> (As for) those who swallow the property of the orphans unjustly</span>’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad from ibn abu Nasr who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about the case of a man who in his hand has properties of orphans and is needy. He extends his hand to take a certain amount with the intention to return. He (the Imam) said, ‘It is not proper for him to consume it, except with moderation and without excess; but if his intention is not to return, he then is like the one about whom Allah, most Majestic, most Glorious, has said, “Those who consume the properties of orphans unjustly. . . .” <a href=\"/#/books/quran:4#h12\">[4:12]</a>’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/96)"
        ],
        "index": 8540,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:43:4",
        "relations": {
          "Mentions": [
            "/books/quran:2:220"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَبْدِ اللَّهِ بْنِ يَحْيَى الْكَاهِلِيِّ قَالَ قِيلَ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّا نَدْخُلُ عَلَى أَخٍ لَنَا فِي بَيْتِ أَيْتَامٍ وَ مَعَهُمْ خَادِمٌ لَهُمْ فَنَقْعُدُ عَلَى بِسَاطِهِمْ وَ نَشْرَبُ مِنْ مَائِهِمْ وَ يَخْدُمُنَا خَادِمُهُمْ وَ رُبَّمَا طَعِمْنَا فِيهِ الطَّعَامَ مِنْ عِنْدِ صَاحِبِنَا وَ فِيهِ مِنْ طَعَامِهِمْ فَمَا تَرَى فِي ذَلِكَ فَقَالَ إِنْ كَانَ فِي دُخُولِكُمْ عَلَيْهِمْ مَنْفَعَةٌ لَهُمْ فَلَا بَأْسَ وَ إِنْ كَانَ فِيهِ ضَرَرٌ فَلَا ",
          "وَ قَالَ ( عليه السلام ) بَلِ الْإِنْسانُ عَلى نَفْسِهِ بَصِيرَةٌ فَأَنْتُمْ لَا يَخْفَى عَلَيْكُمْ وَ قَدْ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ إِنْ تُخالِطُوهُمْ فَإِخْوانُكُمْ فِي الدِّينِ وَ اللَّهُ يَعْلَمُ الْمُفْسِدَ مِنَ الْمُصْلِحِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al hakam, from Abdullah Bin Yahya Al kahily who said, ",
            "‘I was said to Abu Abdullah<sup>asws</sup>, ‘We tend to go over to a brother of ours in a house of orphans, and with them is a servant of their. So we sit on their furnishings, and we drink from their water, and their servant serves us, and something we eat the meal therein with our companions, and therein is from their food (as well). So what is your<sup>asws</sup> view regarding that?’ So he<sup>asws</sup> said: ‘If in their going over to them is beneficial for them (orphans), so there is no problem, and if there was harm in it, so no!’",
            "And he<sup>asws</sup> said: ‘But the human being is an overlooker upon himself, and it is not concealed upon you all and Allah<sup>azwj</sup> Mighty and Majestic has Said <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h220\">[2:220]</a> and if you intermingle with them, so they are your brethren; and Allah Knows the mischief-maker from the righteous</span>’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from ‘Abd Allah ibn Yahya al-Kahily who has said the following: “Once it was said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘We visit a brother in belief in the house of orphans with their servant. We sit on their furnishings, drink from their water and their servant serves us and perhaps eat of the food of our friend in which there is the orphans’ food also. What do you say about it? He (the Imam) said, ‘If your visit is beneficial for them, it is not harmful and if it is harmful it is not permissible.’ He (the Imam), ‘Alayhi al-Salam, said, ‘Man is well aware of his own-self. It is not hidden from you that Allah, most Majestic, most Glorious, has said, “If you mix with them they are your brothers in belief and Allah knows who is corrupt and who is improving and a peacemaker.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/96)"
        ],
        "index": 8541,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:43:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ ذُبْيَانَ بْنِ حَكِيمٍ الْأَوْدِيِّ عَنْ عَلِيِّ بْنِ الْمُغِيرَةِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ لِيَ ابْنَةَ أَخٍ يَتِيمَةً فَرُبَّمَا أُهْدِيَ لَهَا الشَّيْ‏ءُ فَآكُلُ مِنْهُ ثُمَّ أُطْعِمُهَا بَعْدَ ذَلِكَ الشَّيْ‏ءَ مِنْ مَالِي فَأَقُولُ يَا رَبِّ هَذَا بِهَذَا فَقَالَ ( عليه السلام ) لَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, form Muhammad Bin Al Husayn, from Zubyan Bin hakeem Al Awdy, from Ali Bin Al Mugheira who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘With me is a  daughter of my brother who is an orphan, so sometimes something is gifted to her, so I eat from it. Then I feed her something after that from my wealth, so I am saying, ‘O Lord<sup>azwj</sup>! This is for this!’ So he<sup>asws</sup> said: ‘There is no problem’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Dhubyan ibn Hakim al-Awdiy from Ali ibn al-Mughirah who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘I have an orphan girl of my brother. At certain times gifts are given to her and I eat a certain amount thereof. Thereafter I feed her a certain amount from my properties and I say, “O Lord, this is for what I have used.” He (the Imam), ‘Alayhi al-Salam, said, ‘It is not harmful.”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:43",
  "kind": "verse_list"
}