{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:5:2", "titles": {"ar": "كتاب الْمَعِيشَةِ", "en": "THE BOOK OF SUBSISTENCE"}}, {"indexed_titles": {"en": "Chapter 46"}, "path": "/books/al-kafi:5:2:46", "titles": {"ar": "باب أَدَاءِ الْأَمَانَةِ ", "en": "Chapter 46 – Paying back the entrustments"}}], "index": 1257, "local_index": 46, "part_type": "Chapter", "path": "/books/al-kafi:5:2:46", "titles": {"ar": "باب أَدَاءِ الْأَمَانَةِ ", "en": "Chapter 46 – Paying back the entrustments"}, "verse_count": 9, "verse_start_index": 8555, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 8556, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:2:46:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ الْحُسَيْنِ بْنِ مُصْعَبٍ الْهَمْدَانِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ ثَلَاثَةٌ لَا عُذْرَ لِأَحَدٍ فِيهَا أَدَاءُ الْأَمَانَةِ إِلَى الْبَرِّ وَ الْفَاجِرِ وَ الْوَفَاءُ بِالْعَهْدِ إِلَى الْبَرِّ وَ الْفَاجِرِ وَ بِرُّ الْوَالِدَيْنِ بَرَّيْنِ كَانَا أَوْ فَاجِرَيْنِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Al Husayn Bin Mus’ab Al Hamdany who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘There are three (matters) in which no one has an excuse therein – the paying back the entrustment to the righteous as well as the immoral; and the loyalty with the covenant to the righteous as well as the immoral; and the righteousness with the parents, be they both righteous or both immoral’."]}}, {"index": 8557, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:2:46:2", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ ابْنِ بُكَيْرٍ عَنِ الْحُسَيْنِ الشَّيْبَانِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ رَجُلٌ مِنْ مَوَالِيكَ يَسْتَحِلُّ مَالَ بَنِي أُمَيَّةَ وَ دِمَاءَهُمْ وَ إِنَّهُ وَقَعَ لَهُمْ عِنْدَهُ وَدِيعَةٌ فَقَالَ أَدُّوا الْأَمَانَاتِ إِلَى أَهْلِهَا وَ إِنْ كَانُوا مَجُوسِيّاً فَإِنَّ ذَلِكَ لَا يَكُونُ حَتَّى يَقُومَ قَائِمُنَا أَهْلَ الْبَيْتِ ( عليه السلام ) فَيُحِلَّ وَ يُحَرِّمَ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ibn Bukeyr, from Al Husayn Al Shaybani, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘A man from those in your<sup>asws</sup> Wilayah is permitting the wealth of the Clan of Umayya and their blood, and there have occurred some deposits with him which are from them’. So he<sup>asws</sup> said: ‘Repay the entrustments to its rightful ones even though they may be Magians, for that would not be happening until the rising of our<sup>asws</sup> Qaim<sup>asws</sup> of the People<sup>asws</sup> of the Household, so he<sup>asws</sup> would be Permitting and Prohbiting’."]}}, {"index": 8558, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:2:46:3", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ الْقَاسِمِ بْنِ يَحْيَى عَنْ جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) أَدُّوا الْأَمَانَةَ وَ لَوْ إِلَى قَاتِلِ وُلْدِ الْأَنْبِيَاءِ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Al Qasim Bin yahya, from his grandfather Al Hassan Bin Rashid, from Muhammad Bin Muslim, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘Repay the entrustments even though it be to a murderer of the children of the Prophets<sup>as</sup>’."]}}, {"index": 8559, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:5:2:46:4", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ عُمَرَ بْنِ أَبِي حَفْصٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ اتَّقُوا اللَّهَ وَ عَلَيْكُمْ بِأَدَاءِ الْأَمَانَةِ إِلَى مَنِ ائْتَمَنَكُمْ وَ لَوْ أَنَّ قَاتِلَ عَلِيِّ بْنِ أَبِي طَالِبٍ ( عليه السلام ) ائْتَمَنَنِي عَلَى أَمَانَةٍ لَأَدَّيْتُهَا إِلَيْهِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus, from Umar Bin Abu Hafs who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Fear Allah<sup>azwj</sup>! And upon you is with the repaying of the entrustments to the one who entrusted you, and even if the murderer of Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> had entrusted me upon an entrustment, I<sup>asws</sup> would have repaid it to him<sup>la</sup>’."]}}, {"index": 8560, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:5:2:46:5", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَمَّارِ بْنِ مَرْوَانَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فِي وَصِيَّةٍ لَهُ اعْلَمْ أَنَّ ضَارِبَ عَلِيٍّ ( عليه السلام ) بِالسَّيْفِ وَ قَاتِلَهُ لَوِ ائْتَمَنَنِي وَ اسْتَنْصَحَنِي وَ اسْتَشَارَنِي ثُمَّ قَبِلْتُ ذَلِكَ مِنْهُ لَأَدَّيْتُ إِلَيْهِ الْأَمَانَةَ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Ammar Bin Marwan who said, ", "‘Abu Abdullah<sup>asws</sup> said in a bequest of him<sup>asws</sup>: ‘Know that if the striker upon Ali<sup>asws</sup> with the sword and his<sup>asws</sup> killer were to entrust me<sup>asws</sup> and seek guidance from me<sup>asws</sup> and consult me<sup>asws</sup>, I<sup>asws</sup> would have repaid the entrustment to him<sup>la</sup>’ if I<sup>asws</sup> had accepted that from him<sup>la</sup>."]}}, {"index": 8561, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:5:2:46:6", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ حَفْصِ بْنِ قُرْطٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) امْرَأَةٌ بِالْمَدِينَةِ كَانَ النَّاسُ يَضَعُونَ عِنْدَهَا الْجَوَارِيَ فَتُصْلِحُهُنَّ وَ قُلْنَا مَا رَأَيْنَا مِثْلَ مَا صُبَّ عَلَيْهَا مِنَ الرِّزْقِ فَقَالَ إِنَّهَا صَدَقَتِ الْحَدِيثَ وَ أَدَّتِ الْأَمَانَةَ وَ ذَلِكَ يَجْلِبُ الرِّزْقَ . ", "قَالَ صَفْوَانُ وَ سَمِعْتُهُ مِنْ حَفْصٍ بَعْدَ ذَلِكَ ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Is’haq Bin Ammar, from Hafs Bin Qurt who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘A woman at Al-Medina, the people were placing the slave girls with her in order to train them, and we said, ‘We have not seen the likes of what is poured upon her from the livelihood!’. So he<sup>asws</sup> said: ‘She was truthful in the discussions, and repaid the entrustments, and that brings the livelihood’. ", "Safwan (the narrator) said, ‘And I heard it (directly) from Hafs, after that’."]}}, {"index": 8562, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:5:2:46:7", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَيْسَ مِنَّا مَنْ أَخْلَفَ بِالْأَمَانَةِ ", "وَ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْأَمَانَةُ تَجْلِبُ الرِّزْقَ وَ الْخِيَانَةُ تَجْلِبُ الْفَقْرَ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘He is not from us<sup>asws</sup>, the one who reneges with an entrustment’. ", "And he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘The trustworthiness brings the livelihood and the betrayal brings the poverty’."]}}, {"index": 8563, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:5:2:46:8", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ الْقَاسِمِ قَالَ سَأَلْتُ أَبَا الْحَسَنِ يَعْنِي مُوسَى ( عليه السلام ) عَنْ رَجُلٍ اسْتَوْدَعَ رَجُلًا مَالًا لَهُ قِيمَةٌ وَ الرَّجُلُ الَّذِي عَلَيْهِ الْمَالُ رَجُلٌ مِنَ الْعَرَبِ يَقْدِرُ عَلَى أَنْ لَا يُعْطِيَهُ شَيْئاً وَ لَا يَقْدِرُ لَهُ عَلَى شَيْ‏ءٍ وَ الرَّجُلُ الَّذِي اسْتَوْدَعَهُ خَبِيثٌ خَارِجِيٌّ فَلَمْ أَدَعْ شَيْئاً فَقَالَ لِي قُلْ لَهُ رُدَّهُ عَلَيْهِ فَإِنَّهُ ائْتَمَنَهُ عَلَيْهِ بِأَمَانَةِ اللَّهِ عَزَّ وَ جَلَّ "], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Khalid, from Al Qasim Bin Muhammad, from Muhammad Bin Al Qasim who said, ", "‘I asked Abu Al-Hassan<sup>asws</sup>, meaning Musa<sup>asws</sup>, about a man who entrusted a man with some valuable wealth of his, and man upon whom is the wealth is a man from the Arabs powerful enough that he does not give him back anything, and he (the entruster) is not able upon him with anything, and the man who entrusted him is a wicked foreigner. So he did not give him anything’. So he<sup>asws</sup> said to me: ‘Say to him, ‘Return it to him, for he had entrusted him with an entrustment of Allah<sup>azwj</sup> Mighty and Majestic’."]}}, {"index": 8564, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:5:2:46:9", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ النَّهْدِيِّ عَنْ كَثِيرِ بْنِ يُونُسَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَيَابَةَ قَالَ لَمَّا هَلَكَ أَبِي سَيَابَةُ جَاءَ رَجُلٌ مِنْ إِخْوَانِهِ إِلَيَّ فَضَرَبَ الْبَابَ عَلَيَّ فَخَرَجْتُ إِلَيْهِ فَعَزَّانِي وَ قَالَ لِي هَلْ تَرَكَ أَبُوكَ شَيْئاً فَقُلْتُ لَهُ لَا فَدَفَعَ إِلَيَّ كِيساً فِيهِ أَلْفُ دِرْهَمٍ وَ قَالَ لِي أَحْسِنْ حِفْظَهَا وَ كُلْ فَضْلَهَا فَدَخَلْتُ إِلَى أُمِّي وَ أَنَا فَرِحٌ فَأَخْبَرْتُهَا ", "فَلَمَّا كَانَ بِالْعَشِيِّ أَتَيْتُ صَدِيقاً كَانَ لِأَبِي فَاشْتَرَى لِي بَضَائِعَ سَابِرِيٍّ وَ جَلَسْتُ فِي حَانُوتٍ فَرَزَقَ اللَّهُ جَلَّ وَ عَزَّ فِيهَا خَيْراً كَثِيراً وَ حَضَرَ الْحَجُّ فَوَقَعَ فِي قَلْبِي فَجِئْتُ إِلَى أُمِّي وَ قُلْتُ لَهَا إِنَّهَا قَدْ وَقَعَ فِي قَلْبِي أَنْ أَخْرُجَ إِلَى مَكَّةَ فَقَالَتْ لِي فَرُدَّ دَرَاهِمَ فُلَانٍ عَلَيْهِ فَهَاتِهَا وَ جِئْتُ بِهَا إِلَيْهِ فَدَفَعْتُهَا إِلَيْهِ فَكَأَنِّي وَهَبْتُهَا لَهُ فَقَالَ لَعَلَّكَ اسْتَقْلَلْتَهَا فَأَزِيدَكَ قُلْتُ لَا وَ لَكِنْ قَدْ وَقَعَ فِي قَلْبِيَ الْحَجُّ فَأَحْبَبْتُ أَنْ يَكُونَ شَيْئُكَ عِنْدَكَ ", "ثُمَّ خَرَجْتُ فَقَضَيْتُ نُسُكِي ثُمَّ رَجَعْتُ إِلَى الْمَدِينَةِ فَدَخَلْتُ مَعَ النَّاسِ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ كَانَ يَأْذَنُ إِذْناً عَامّاً فَجَلَسْتُ فِي مَوَاخِيرِ النَّاسِ وَ كُنْتُ حَدَثاً فَأَخَذَ النَّاسُ يَسْأَلُونَهُ وَ يُجِيبُهُمْ فَلَمَّا خَفَّ النَّاسُ عَنْهُ أَشَارَ إِلَيَّ فَدَنَوْتُ إِلَيْهِ فَقَالَ لِي أَ لَكَ حَاجَةٌ فَقُلْتُ جُعِلْتُ فِدَاكَ أَنَا عَبْدُ الرَّحْمَنِ بْنُ سَيَابَةَ فَقَالَ لِي مَا فَعَلَ أَبُوكَ فَقُلْتُ هَلَكَ قَالَ فَتَوَجَّعَ وَ تَرَحَّمَ", "قَالَ ثُمَّ قَالَ لِي أَ فَتَرَكَ شَيْئاً قُلْتُ لَا قَالَ فَمِنْ أَيْنَ حَجَجْتَ قَالَ فَابْتَدَأْتُ فَحَدَّثْتُهُ بِقِصَّةِ الرَّجُلِ قَالَ فَمَا تَرَكَنِي أَفْرُغُ مِنْهَا حَتَّى قَالَ لِي فَمَا فَعَلْتَ فِي الْأَلْفِ قَالَ قُلْتُ رَدَدْتُهَا عَلَى صَاحِبِهَا قَالَ فَقَالَ لِي قَدْ أَحْسَنْتَ وَ قَالَ لِي أَ لَا أُوصِيكَ قُلْتُ بَلَى جُعِلْتُ فِدَاكَ فَقَالَ عَلَيْكَ بِصِدْقِ الْحَدِيثِ وَ أَدَاءِ الْأَمَانَةِ تَشْرَكُ النَّاسَ فِي أَمْوَالِهِمْ هَكَذَا وَ جَمَعَ بَيْنَ أَصَابِعِهِ ", "قَالَ فَحَفِظْتُ ذَلِكَ عَنْهُ فَزَكَّيْتُ ثَلَاثَمِائَةِ أَلْفِ دِرْهَمٍ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Muhammad Bin Ahmad Al Nahdy, from Kaseer Bin Yunus, from Abdul Rahman Bin Sabaya who said, ", "‘When my father Sayaba died, a man from his brethren came over to me. So he knocked the door upon me, and I went out to him, so he offered his condolences to me and said to me, ‘Did your father leave anything?’ So I said to him, ‘No’. So he handed over a bag to me in which were one thousand Dirhams, and said to me, ‘Look after it well and eat from its excess (profits)’. So I went over to my mother, and I was happy, and I informed her of it.", "So when it was the evening, a friend of my father came over, so I bought for myself Sabiriyya goods and sat in a shop. So Allah<sup>azwj</sup> Majestic and Mighty Graced me a lot of goodness in it, and (the season) for Hajj presented itself, so it occurred in my heart. I went over to my mother and said to her that it has occurred in my heart that I should go out to Makkah. So she said to me, ‘Return the Dirhams of so and so to him’. So she gave it to me and I went with it to him and handed these over to him, so it was as if I had gifted it to him. He said, ‘Perhaps I have given you little, so I shall increase it for you’. I said, ‘No, but performing the Hajj has occurred in my heart, therefore I loved it that your thing should be with you’.", "Then I went out and fulfilled my rituals. Then I returned to Al-Medina, so I went over to Abu Abdullah<sup>asws</sup> along with the people, and he<sup>asws</sup> had permitted with a general permission. So I sat among the back rows of the people, and I was young. So the people went on asking him<sup>asws</sup>, and he<sup>asws</sup> kept answering them. So when the people were less from him<sup>asws</sup>, he<sup>asws</sup> gestured towards me. So I approached him<sup>asws</sup>, and he<sup>asws</sup> said to me: ‘Is there a need for you?’ So I said, ‘May I be sacrificed for you<sup>asws</sup>! I am Abdul Rahman Bin Sabaya’. So he<sup>asws</sup> said to me: ‘What work does your father do?’ So I said, ‘He died’. So he<sup>asws</sup> expressed condolences and mercy. ", "He (the narrator) said, ‘Then he<sup>asws</sup> said to me: ‘Did he leave anything?’ I said, ‘No’. He<sup>asws</sup> said: ‘So from where did you perform Hajj?’ So I initiated and narrated to him with the story of the man. So he<sup>asws</sup> did not leave me to be free from it until he<sup>asws</sup> said to me: ‘So what did you do regarding the one thousand (Dirhams)?’ I said, ‘I returned it to its owner’. So he<sup>asws</sup> said to me: ‘You have done well’. And he<sup>asws</sup> said to me: ‘Shall I<sup>asws</sup> advise you?’ I said, ‘Yes, may I be sacrificed for you<sup>asws</sup>! So he<sup>asws</sup> said: ‘Upon you is with the truthfulness of the discussion and the repayment of the entrustment. You would share the people in their wealth like this!’ – and he<sup>asws</sup> gathered his<sup>asws</sup> two fingers together. ", "He (the narrator) said, ‘So I memorised that from him<sup>asws</sup>, and I attained three hundred thousand Dirhams’."]}}]}, "index": "al-kafi:5:2:46", "kind": "verse_list"}