{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 47"
        },
        "path": "/books/al-kafi:5:2:47",
        "titles": {
          "ar": "باب الرَّجُلِ يَأْخُذُ مِنْ مَالِ وَلَدِهِ وَ الْوَلَدِ يَأْخُذُ مِنْ مَالِ أَبِيهِ",
          "en": "Chapter 47 – The man takes from the wealth of his son and the son takes from the wealth of his father"
        }
      }
    ],
    "index": 1259,
    "local_index": 47,
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:47",
    "titles": {
      "ar": "باب الرَّجُلِ يَأْخُذُ مِنْ مَالِ وَلَدِهِ وَ الْوَلَدِ يَأْخُذُ مِنْ مَالِ أَبِيهِ",
      "en": "Chapter 47 – The man takes from the wealth of his son and the son takes from the wealth of his father"
    },
    "verse_count": 6,
    "verse_start_index": 8564,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/104)"
        ],
        "index": 8565,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:47:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ لِابْنِهِ مَالٌ فَيَحْتَاجُ إِلَيْهِ الْأَبُ قَالَ يَأْكُلُ مِنْهُ فَأَمَّا الْأُمُّ فَلَا تَأْكُلُ مِنْهُ إِلَّا قَرْضاً عَلَى نَفْسِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad, from Hareyz, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who had some wealth for his son, so the father had a need to it. He<sup>asws</sup> said: ‘He can eat from it. So as for the mother, so she cannot eat from it except as a loan upon herself’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Hammad from Hariz from Muhammad ibn Muslim who has said the following: “This is concerning my question before abu ‘ Abd Allah, ‘Alayhi al-Salam, about a man whose son owned a certain amount of wealth and his father was needy. He (the Imam) replied, ‘He has permission to use such wealth for food; however, a mother does not have such permission but she can borrow on her own responsibility.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/105)"
        ],
        "index": 8566,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:47:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَبِي إِبْرَاهِيمَ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يَأْكُلُ مِنْ مَالِ وَلَدِهِ قَالَ لَا إِلَّا أَنْ يُضْطَرَّ إِلَيْهِ فَيَأْكُلَ مِنْهُ بِالْمَعْرُوفِ وَ لَا يَصْلُحُ لِلْوَلَدِ أَنْ يَأْخُذَ مِنْ مَالِ وَالِدِهِ شَيْئاً إِلَّا أَنْ يَأْذَنَ وَالِدُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Asbat, ",
            "(It has been narrated) from Ali son of Ja’far<sup>asws</sup>, from Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), said, ‘I asked him<sup>asws</sup> about the man who eats from the wealth of his son. He<sup>asws</sup> said: ‘No, except if he is desperate to it, so he can eat from it with the reasonableness, and it is not correct for the son that he takes anything from the wealth of his father except if his father alows him’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Asbat from Ali ibn Ja’far who has said the following: “I once asked abu Ibrahim, ‘Alayhi al-Salam, about a man who used the properties of his sons for food. He (the Imam) replied, ‘No, unless he is compelled by pressing needs, in which case he spends in a fair manner but it is not proper for the sons to spend the properties of their father without the permission of the father.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/105)"
        ],
        "index": 8567,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:47:3",
        "text": [
          "سَهْلُ بْنُ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِرَجُلٍ أَنْتَ وَ مَالُكَ لِأَبِيكَ ثُمَّ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) وَ مَا أُحِبُّ لَهُ أَنْ يَأْخُذَ مِنْ مَالِ ابْنِهِ إِلَّا مَا احْتَاجَ إِلَيْهِ مِمَّا لَا بُدَّ مِنْهُ إِنَّ اللَّهَ عَزَّ وَ جَلَّ لَا يُحِبُّ الْفَسَادَ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl Bin Ziyad, from Ibn Mahboub, from Abu Hamza Al Sumaly, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said to a man: ‘You and your wealth is for your father’. Then Abu Ja’far<sup>asws</sup> said: ‘And I<sup>asws</sup> do not like it for him that he should take from the wealth of his son except what he is needy to it, from what is a must from it. Allah<sup>azwj</sup> Mighty does not Love the mischief’."
          ],
          "en.sarwar": [
            "3. Sahl ibn Ziyad has narrated from ibn Mahbub from abu Hamzah al-Thumaliy who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, once said to a man, ‘You and your property belong to your father.’ Abu Ja’far, ‘Alayhi al-Salam, then said, ‘I do not like his spending from the property of his son more than what he needs for his bare necessities; Allah, most Majestic, most Glorious, does not love destruction.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/106)"
        ],
        "index": 8568,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:47:4",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنْ عُبَيْسِ بْنِ هِشَامٍ عَنْ عَبْدِ الْكَرِيمِ عَنِ ابْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الرَّجُلِ يَكُونُ لِوَلَدِهِ مَالٌ فَأَحَبَّ أَنْ يَأْخُذَ مِنْهُ قَالَ فَلْيَأْخُذْ فَإِنْ كَانَتْ أُمُّهُ حَيَّةً فَمَا أُحِبُّ أَنْ تَأْخُذَ مِنْهُ شَيْئاً إِلَّا قَرْضاً عَلَى نَفْسِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Al Hassan Bin Ali Al Kufy, from Ubeys Bin Hisham, from Abdul Kareem, from Ibn Abu Yafour, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the man who happens to have some wealth for his son, so he would like to take from it’. He<sup>asws</sup> said: ‘So let him take. So if his mother is alive, I<sup>asws</sup> would not like it that she takes anything from it except as a loan upon herself’."
          ],
          "en.sarwar": [
            "4. Abu Ali al-Ash’ariy has narrated from al-Hassan ibn Ali al-Kufiy from ‘Ubays ibn Hisham from “Abd al-Karim from ibn abu Ya’fur who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about a man whose son owned a certain amount of wealth and liked to take something from it. He (the Imam) replied, ‘He has permission to do so; however, were his mother alive I would not like her taking anything from his property except as a loan on her own responsibility.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/106)"
        ],
        "index": 8569,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:47:5",
        "text": [
          "سَهْلُ بْنُ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يَحْتَاجُ إِلَى مَالِ ابْنِهِ قَالَ يَأْكُلُ مِنْهُ مَا شَاءَ مِنْ غَيْرِ سَرَفٍ ",
          "وَ قَالَ فِي كِتَابِ عَلِيٍّ ( عليه السلام ) إِنَّ الْوَلَدَ لَا يَأْخُذُ مِنْ مَالِ وَالِدِهِ شَيْئاً إِلَّا بِإِذْنِهِ وَ الْوَالِدَ يَأْخُذُ مِنْ مَالِ ابْنِهِ مَا شَاءَ وَ لَهُ أَنْ يَقَعَ عَلَى جَارِيَةِ ابْنِهِ إِذَا لَمْ يَكُنِ الِابْنُ وَقَعَ عَلَيْهَا وَ ذَكَرَ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ لِرَجُلٍ أَنْتَ وَ مَالُكَ لِأَبِيكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl Bin Ziyad, from Ibn Mahboub, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the man who is needy to some wealth of his son. He<sup>asws</sup> said: ‘He can eat from it whatever he so desires to from without being extravagant’. ",
            "And he<sup>asws</sup> said: ‘In the Book of Ali<sup>asws</sup> (it is written): ‘The son shall not take anything from the wealth of his father except by his permission, but the father can take from the wealth of his son whatever he so desires to, and for him (father) is that he can fall upon a slave girl of his son, when his son has not fallen upon her (copulated)’. And he<sup>asws</sup> mentioned that Rasool-Allah<sup>saww</sup> said to a man: ‘You and your wealth are for your father’."
          ],
          "en.sarwar": [
            "5. Sahl ibn Ziyad has narrated from ibn Mahbub from al-‘ Ala’ ibn Razin from Muhammad ibn Muslim who has said the following: “I once asked abu Ja’far, ‘Alayhi al-Salam, about a man who needed to spend from the property of his son. He (the Imam) replied, ‘He has permission to use the property of his son for food as much as he wants but without excess.’ He (the Imam) said, ‘It is in the book of Ali, ‘Alayhi al-Salam, that a son does not have permission to spend from the property of his father anything unless his father grants him permission. A father has permission to take from the property of his sons as he wants. He may also have carnal relations with the slave-girl of his son if his son has not yet engaged in carnal relations with her.’ He (the Imam) also mentioned that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, once said to a man, ‘You and your property belong to your father.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/106)"
        ],
        "index": 8570,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:47:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْحُسَيْنِ بْنِ أَبِي الْعَلَاءِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا يَحِلُّ لِلرَّجُلِ مِنْ مَالِ وَلَدِهِ قَالَ قُوتُهُ بِغَيْرِ سَرَفٍ إِذَا اضْطُرَّ إِلَيْهِ ",
          "قَالَ فَقُلْتُ لَهُ فَقَوْلُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) لِلرَّجُلِ الَّذِي أَتَاهُ فَقَدَّمَ أَبَاهُ فَقَالَ لَهُ أَنْتَ وَ مَالُكَ لِأَبِيكَ فَقَالَ إِنَّمَا جَاءَ بِأَبِيهِ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) فَقَالَ يَا رَسُولَ اللَّهِ هَذَا أَبِي وَ قَدْ ظَلَمَنِي مِيرَاثِي مِنْ أُمِّي فَأَخْبَرَهُ الْأَبُ أَنَّهُ قَدْ أَنْفَقَهُ عَلَيْهِ وَ عَلَى نَفْسِهِ فَقَالَ أَنْتَ وَ مَالُكَ لِأَبِيكَ وَ لَمْ يَكُنْ عِنْدَ الرَّجُلِ شَيْ‏ءٌ أَ فَكَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَحْبِسُ الْأَبَ لِلِابْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Abdullah Bin Muhammad, from Ali Bin Al Hakam, from Al Husayn Bin Abu Al A’ala who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘What is Permissible for the man from the wealth of his son?’ He<sup>asws</sup> said: ‘Subsistence without extravagance when he is desperate to it’. ",
            "He (the narrator) said, ‘So I said to him<sup>asws</sup>, ‘So (what about) the words of Rasool-Allah<sup>saww</sup> to the man who came over to him<sup>saww</sup> and presented his father, so he<sup>saww</sup> said to him: ‘You and your wealth are for your father’. So he<sup>asws</sup> said: ‘But rather he came with his father to the Prophet<sup>saww</sup>, so he said, ‘O Rasool-Allah<sup>saww</sup>! This is my father who has been unjust to me in my inheritance from my mother. So the father informed him<sup>asws</sup> and he had spend upon him and upon himself. So he<sup>saww</sup> said: ‘You and your wealth are for your father’, and there did not happen to be anything with the man; would Rasool-Allah<sup>saww</sup> have withheld the father for the (sake of his) son?’"
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from ‘Abd Allah ibn Muhammad from Ali ibn al-Hakam from Al-Husayn ibn al-‘Ala’ who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, ‘How much can a father spend from the property of his sons?’ He (the Imam) replied, ‘He can take for his basic necessities without excess when pressing needs compel him.’ I (the narrator) then asked about the words of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, to a man who came to him and had brought his father also. The Messenger of Allah said to him, ‘You and your property belong to your father’ He (the Imam) replied, ‘He brought his father before the Holy Prophet saying, “O Messenger of Allah, he has done injustice to me in the matters of the legacy of my mother.” The father informed him of his spending her legacy on the son and for his own expenses. Then he (the Messenger of Allah) said, “You and your property belong to your father.” The man did not own anything. Should the Messenger of Allah stop the father benefiting from the son?’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:47",
  "kind": "verse_list"
}