{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 48"
        },
        "path": "/books/al-kafi:5:2:48",
        "titles": {
          "ar": "باب الرَّجُلِ يَأْخُذُ مِنْ مَالِ امْرَأَتِهِ وَ الْمَرْأَةِ تَأْخُذُ مِنْ مَالِ زَوْجِهَا",
          "en": "Chapter 48 – The man takes from the wealth of his wife and the wife takes from the wealth of her husband"
        }
      }
    ],
    "index": 1260,
    "local_index": 48,
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:48",
    "titles": {
      "ar": "باب الرَّجُلِ يَأْخُذُ مِنْ مَالِ امْرَأَتِهِ وَ الْمَرْأَةِ تَأْخُذُ مِنْ مَالِ زَوْجِهَا",
      "en": "Chapter 48 – The man takes from the wealth of his wife and the wife takes from the wealth of her husband"
    },
    "verse_count": 2,
    "verse_start_index": 8570,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/107)"
        ],
        "index": 8571,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:48:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَعِيدِ بْنِ يَسَارٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ امْرَأَةٌ دَفَعَتْ إِلَى زَوْجِهَا مَالًا مِنْ مَالِهَا لِيَعْمَلَ بِهِ وَ قَالَتْ لَهُ حِينَ دَفَعَتْ إِلَيْهِ أَنْفِقْ مِنْهُ فَإِنْ حَدَثَ بِكَ حَدَثٌ فَمَا أَنْفَقْتَ مِنْهُ حَلَالًا طَيِّباً فَإِنْ حَدَثَ بِي حَدَثٌ فَمَا أَنْفَقْتَ مِنْهُ فَهُوَ حَلَالٌ طَيِّبٌ ",
          "فَقَالَ أَعِدْ عَلَيَّ يَا سَعِيدُ الْمَسْأَلَةَ فَلَمَّا ذَهَبْتُ أُعِيدُ الْمَسْأَلَةَ عَلَيْهِ اعْتَرَضَ فِيهَا صَاحِبُهَا وَ كَانَ مَعِي حَاضِراً فَأَعَادَ عَلَيْهِ مِثْلَ ذَلِكَ فَلَمَّا فَرَغَ أَشَارَ بِإِصْبَعِهِ إِلَى صَاحِبِ الْمَسْأَلَةِ فَقَالَ يَا هَذَا إِنْ كُنْتَ تَعْلَمُ أَنَّهَا قَدْ أَفْضَتْ بِذَلِكَ إِلَيْكَ فِيمَا بَيْنَكَ وَ بَيْنَهَا وَ بَيْنَ اللَّهِ عَزَّ وَ جَلَّ فَحَلَالٌ طَيِّبٌ ثَلَاثَ مَرَّاتٍ ثُمَّ قَالَ يَقُولُ اللَّهُ جَلَّ اسْمُهُ فِي كِتَابِهِ فَإِنْ طِبْنَ لَكُمْ عَنْ شَيْ‏ءٍ مِنْهُ نَفْساً فَكُلُوهُ هَنِيئاً مَرِيئاً ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Usman Bin Isa, from Saeed Bin Yasaar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! A woman handed over some wealth from her own wealth to her husband for him to work with and said to him when she handed it over to him, ‘Spend from it, so if there occurs with you an event (of death), so whatever you would have spent from it would be Permissible and good, and if there occurs with me an event (of death), so whatever I would have spent from it, so it would be Permissible, good’.",
            "So he<sup>asws</sup> said: ‘O Saeed! Repeat the question to me<sup>asws</sup>’. So when I went on to repeat the question to him<sup>asws</sup>, the person involved in it intervened, and he was present with me, so he repeated to him<sup>asws</sup> similar to that. So when he was free, he<sup>asws</sup> pointed with his<sup>asws</sup> finger to the person involved in the question, and he<sup>asws</sup> said: ‘O you! If you knew that she delegated it to you with regards to what is between you and her and Allah<sup>azwj</sup> Mighty and Majestic, so it is Permissible, good’ – three times. Then he<sup>asws</sup> said: ‘Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Name is Saying in His<sup>azwj</sup> Book <span class=\"ibTxt\">[4:4] but if they of themselves be pleased to give up to you a portion of it, then eat it with enjoyment and with wholesome result</span>’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from ‘Uthman ibn ’Isa from Sa‘d ibn Yasar who has said the following: “This is concerning my question before abu ‘ Abd Allah, ‘Alayhi al-Salam, saying, T pray to Allah to keep my soul in service for your cause, a woman gave a certain amount of property to her husband from her own property so he can use in business and she said to him upon the delivery, “You can spend from it and if something happens to you, it is lawful for you and if something happens to me and whatever you may spend is lawfully clean for you.’” He (the Imam) asked, ‘Say it again, O Sa‘id.’ When I wanted to repeat the question the person involved in the case was present so he repeated the same question. When he completed the question, he (the Imam) pointed with his finger to the person involved in the case saying, ‘If you know that she has left it up to your decision which you make before Allah, most Majestic, most Glorious, then it is lawfully clean for you’- he said it three times. He (the Imam) then said, ‘Allah, most Majestic is whose name, has said in His book, “If they (the wives) agree about something of it (their property) for your spending thereof you may consume it in good health and pleasure.” (4:4)’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/107)"
        ],
        "index": 8572,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:48:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَمَّا يَحِلُّ لِلْمَرْأَةِ أَنْ تَتَصَدَّقَ بِهِ مِنْ بَيْتِ زَوْجِهَا بِغَيْرِ إِذْنِهِ قَالَ الْمَأْدُومُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about what is Permissible for the woman that she can give in charity with from the house of her husband without his permission. He<sup>asws</sup> said: ‘The food (sauces etc.)’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from ibn Bukayr who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about how much is lawful for a woman to give as charity from the house of her husband without his permission. He (the Imam) replied, ‘It is al-Ma’dum (sauce, curry or gravy).”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:48",
  "kind": "verse_list"
}