{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 50"
        },
        "path": "/books/al-kafi:5:2:50",
        "titles": {
          "ar": "باب الْهَدِيَّةِ ",
          "en": "Chapter 50 – The Gift"
        }
      }
    ],
    "index": 1262,
    "local_index": 50,
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:50",
    "titles": {
      "ar": "باب الْهَدِيَّةِ ",
      "en": "Chapter 50 – The Gift"
    },
    "verse_count": 13,
    "verse_start_index": 8589,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/116)"
        ],
        "index": 8590,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:50:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْهَدِيَّةُ عَلَى ثَلَاثَةِ أَوْجُهٍ هَدِيَّةُ مُكَافَأَةٍ وَ هَدِيَّةُ مُصَانَعَةٍ وَ هَدِيَّةٌ لِلَّهِ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The gifts are upon three aspects – A gift as a reward, and a gift for getting some work done, and a gift for (the Sake of) Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from af-Nawfafiy from af-Sakuniy, who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘Gifts are of three kinds: One is a gift to compensate a favor, another is a gift for understanding (bribing) someone, and another gift is a gift from Allah, most Majestic, most Glorious.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/116)"
        ],
        "index": 8591,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:50:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ إِبْرَاهِيمَ الْكَرْخِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ تَكُونُ لَهُ الضَّيْعَةُ الْكَبِيرَةُ فَإِذَا كَانَ يَوْمُ الْمِهْرَجَانِ أَوِ النَّيْرُوزِ أَهْدَوْا إِلَيْهِ الشَّيْ‏ءَ لَيْسَ هُوَ عَلَيْهِمْ يَتَقَرَّبُونَ بِذَلِكَ إِلَيْهِ ",
          "فَقَالَ أَ لَيْسَ هُمْ مُصَلِّينَ قُلْتُ بَلَى قَالَ فَلْيَقْبَلْ هَدِيَّتَهُمْ وَ لْيُكَافِهِمْ فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ لَوْ أُهْدِيَ إِلَيَّ كُرَاعٌ لَقَبِلْتُ وَ كَانَ ذَلِكَ مِنَ الدِّينِ وَ لَوْ أَنَّ كَافِراً أَوْ مُنَافِقاً أَهْدَى إِلَيَّ  وَسْقاً مَا قَبِلْتُ وَ كَانَ ذَلِكَ مِنَ الدِّينِ أَبَى اللَّهُ عَزَّ وَ جَلَّ لِي زَبْدَ الْمُشْرِكِينَ وَ الْمُنَافِقِينَ وَ طَعَامَهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, and Ahmad Bin Muhammad, altogether from Ibn Mahboub, from Ibrahim Al Karkhy who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man who happened to have a big place for him. So whenever it was the day of Al-Mihrjaan or Neyrouz, they would gift him something. It was not upon them (to do so) but they wanted to be closer to him with that’. ",
            "So he<sup>asws</sup> said: ‘Are they not from the Praying ones?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘So let him accept their gifts, and suffice them, for Rasool-Allah<sup>saww</sup> said: ‘(Even) if a limb of an animal was to be gifted to me<sup>saww</sup>, I<sup>saww</sup> would accept it, and that was always from the Religion; and if an Infidel or a hypocrite were to gift to me<sup>saww</sup> a load, I<sup>saww</sup> would not accept it, and that was always from the Religion. Allah<sup>azwj</sup> Mighty and Majestic Refused to me<sup>saww</sup> the scum of the Polytheists and the hypocrites, and their meals’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Sahl ibn Ziyad and Ahmad ibn Muhammad from all from ibn Mahbub from Ibrahim al- Karkhiy who has said the following: “I asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who possesses a great deal of goods. On the times of festivities or the day of Nawroz, they give him as gifts which they did not have to give him but they wanted to become nearer to him. He (the Imam) asked, ‘Are they not the ones who perform prayers?’ I (the narrator) replied, ‘Yes, they perform prayer.’ He (the Imam) said, ‘He must accept their gift and reciprocate. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “Even if a foot of sheep is given to me as a gift I accept it. It is part of the discipline of religion. On the other hand, if an unbeliever or hypocrite gives me as gift, a whole load of goods, I do not accept. It is of the discipline of religion. Allah, most Majestic, most Glorious, disdains my accepting gifts of unbelievers and hypocrites.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/117)"
        ],
        "index": 8592,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:50:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ أَبِي جَرِيرٍ الْقُمِّيِّ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) فِي الرَّجُلِ يُهْدِي بِالْهَدِيَّةِ إِلَى ذِي قَرَابَتِهِ يُرِيدُ الثَّوَابَ وَ هُوَ سُلْطَانٌ فَقَالَ مَا كَانَ لِلَّهِ عَزَّ وَ جَلَّ وَ لِصِلَةِ الرَّحِمِ فَهُوَ جَائِزٌ وَ لَهُ أَنْ يَقْبِضَهَا إِذَا كَانَ لِلثَّوَابِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ismail Bin Mihran, from Abu Jareer Al Qummy, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> regarding the man who gifts with the gift to his near relatives intending the Rewards, and he is a Sultan (ruling authority). So he<sup>asws</sup> said: ‘Whatever was for the Sake of Allah<sup>azwj</sup> Mighty and Majestic and for maintenance of good relationships, so it is allowed, and for him is that he takes it when it was for the Rewards’."
          ],
          "en.sarwar": [
            "3. Ibn Mahbub has narrated from Sayf ibn ‘ Amirah from abu Bakr al-Hadramiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Arabs during pre-Islamic age of ignorance were of two groups. One was al-Hull and the other al-Hums. Al-Hums were Quraysh and al-Hull was the rest of Arabs. Everyone of al-Hull group had to have a protector from al-Hums people; otherwise, they could not perform Tawaf except in a naked condition. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, was the protector of ‘Iyad ibn Himar al-Mujashi‘iy. ‘Iyad was a person of great importance. He was a judge for the people in ‘Ukaz during the age of ignorance. When visiting Makkah ‘Iyad removed his dress of sins and filth. He dressed up with the dress of the Messenger of Allah for being clean. He dressed up and performed Tawaf around the house, then returned them to him after completing Tawaf. When the Messenger of Allah declared his mission, ‘Iyad brought a gift for him. The Messenger of Allah refused to accept it saying, ‘O ‘Iyad, if you accept Islam I accept your gift. Allah, most Majestic, most Glorious, disdains my accepting gifts from pagans.’ ‘Iyad then afterwards accepted Islam and made it to be good. He then gave a gift to the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and he accepted his gift.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/118)"
        ],
        "index": 8593,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:50:4",
        "text": [
          "سَهْلُ بْنُ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ قَالَ لَهُ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْقُمِّيُّ إِنَّ لَنَا ضِيَاعاً فِيهَا بُيُوتُ النِّيرَانِ تُهْدِي إِلَيْهَا الْمَجُوسُ الْبَقَرَ وَ الْغَنَمَ وَ الدَّرَاهِمَ فَهَلْ لِأَرْبَابِ الْقُرَى أَنْ يَأْخُذُوا ذَلِكَ وَ لِبُيُوتِ نِيرَانِهِمْ قُوَّامٌ يَقُومُونَ  عَلَيْهَا قَالَ لِيَأْخُذْهُ صَاحِبُ الْقُرَى لَيْسَ بِهِ بَأْسٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl Bin Ziyad, from Ahmad Bin Muhammad, from Abdullah Bin Al Mugheira, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said: ‘Muhammad Bin Abdullah Al-Qummy said to him<sup>asws</sup>, ‘We have an estate wherein are house of fire-worship, the Magians tend to gift to it the cows, and the sheep and the Dirhams. So is it Permissible for the lords of the town that they should be taking that, and for the houses of the fire-worship there are people who are standing (in charge) over it?’ He<sup>asws</sup> said: ‘Let the masters of the town take it. There is no problem with it’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Sahl ibn Ziyad from ii; ibn Mehran from abu Jarir al-Qummiy who has said the following: “I once, about the case of a man who gifts something to a relative who is a sultan but he seeks thawab (reward from Allah), asked abu al-Hassan, ‘Alayhi al-Salam. He (the Imam) replied, ‘What is for Allah, most Majestic, most Glorious, and to keep good relations with relatives is permissible. He must accept the gift if it is for thawab.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/119)"
        ],
        "index": 8594,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:50:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَمَّنْ حَدَّثَهُ عَنْ يَحْيَى بْنِ الْمُبَارَكِ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ قُلْتُ لَهُ الرَّجُلُ الْفَقِيرُ يُهْدِي إِلَيَّ الْهَدِيَّةَ يَتَعَرَّضُ لِمَا عِنْدِي فَأَخَذَهَا وَ لَا أُعْطِيهِ شَيْئاً أَ يَحِلُّ لِي قَالَ نَعَمْ هِيَ لَكَ حَلَالٌ وَ لَكِنْ لَا تَدَعْ أَنْ تُعْطِيَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from the one who narrated it, from Yahya Bin Al Mubarak, from Abdullah Bin Jabala, from Is’haq Bin Ammar who said, ",
            "‘I said to him, ‘The poor man gifts the gift to me, to be exposed to what is in my presence. So I take it and I do not give him anything. Is it Perissible for me?’ He<sup>asws</sup> said: ‘Yes, it is Permissible for you, but do not leave out giving him’."
          ],
          "en.sarwar": [
            "5. Sahl ibn Ziyad has narrated from Ahmad ibn Muhammad from ‘Abd Allah ibn al-Mughirah who has said the following: “Muhammad ibn ‘Abd Allah al-Qummiy once said to abu al-Hassan, ‘Alayhi al-Salam, ‘On our land there are facilities that house firehouses of al-Majus (Zoroastrians) who offer cows and sheep and dirham. Can the owners of these villages receive such things and these facilities have keepers who maintain them?’ He (the Imam) said, ‘The owners of these villages must take it and there is no offense in it.’” (Consult Fatwa also) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/119)"
        ],
        "index": 8595,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:50:6",
        "text": [
          "عِدَّة مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَأْكُلُ الْهَدِيَّةَ وَ لَا يَأْكُلُ الصَّدَقَةَ وَ يَقُولُ تَهَادَوْا فَإِنَّ الْهَدِيَّةَ تَسُلُّ السَّخَائِمَ وَ تُجْلِي ضَغَائِنَ الْعَدَاوَةِ وَ الْأَحْقَادِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ismail Bin  Mihran, form Sayf Bin Ameyra, from Amro Bin Shimr, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> used to eat the gift but he<sup>saww</sup> did not eat the charity, and he<sup>saww</sup> was saying: ‘Give gifts, for the gift removes the resentmens and the clears out the misgivings, and the enmities, and the grudges’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from those whom he has mentioned from Yahya al-Mubarak from ‘Abd Allah ibn Jabalah from Ishaq ibn ‘Ammar who has said the following: “I once asked him (the Imam) about a poor man who presents to me a gift seeking nearness to me thereby and I accept it and do not give him anything as a gift. Is this lawful for me?’ He (the Imam) replied, ‘It is lawful for you, however, you must not neglect to give him something.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/120)"
        ],
        "index": 8596,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:50:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مِنْ تَكْرِمَةِ الرَّجُلِ لِأَخِيهِ الْمُسْلِمِ أَنْ يَقْبَلَ تُحْفَتَهُ وَ يُتْحِفَهُ بِمَا عِنْدَهُ وَ لَا يَتَكَلَّفَ لَهُ شَيْئاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, form his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘From the honouring of the man to his Muslim brother is that he accepts his gifts and gifts him with what is with him, and he does not burden anything for him’."
          ],
          "en.sarwar": [
            "7. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ‘Isma’il ibn Mehran from Sayf ibn ‘Amirah from ‘Amr ibn Shamir from Jabir who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, would use gifts for food but not charity and he would say, “You must exchange gifts, it gently removes resentment and clears grudges due to animosity and malice.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/120)"
        ],
        "index": 8597,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:50:8",
        "text": [
          "وَ بِإِسْنَادِهِ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَوْ أُهْدِيَ إِلَيَّ كُرَاعٌ لَقَبِلْتُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by his chain, ",
            "He<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘If an animal limb is gifted to me<sup>asws</sup>, I<sup>saww</sup> would accept it’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy from al-Sakuniy, , who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘Of a believer’s upholding the honor of his Muslim brother is to accept his gifts and present him a gift of whatever is possible for him without over-burdening himself.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/120)"
        ],
        "index": 8598,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:50:9",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبَانٍ عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ جُلَسَاءُ الرَّجُلِ شُرَكَاؤُهُ فِي الْهَدِيَّةِ "
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, form Ahmad Bin Muhammad, form one of his companions, from Aban, from Ibrahim Bin Umar, from Muhammad Bin Muslim who said, ",
            "‘The ones sitting around the man are participants in the gift’."
          ],
          "en.sarwar": [
            "9. Through the same chain of narrators as the previous Hadith he has said the following: “The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘Even if a gift as small as the foot of a sheep is presented to me I accept it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/120)"
        ],
        "index": 8599,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:50:10",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى رَفَعَهُ قَالَ إِذَا أُهْدِيَ إِلَى الرَّجُلِ هَدِيَّةُ طَعَامٍ وَ عِنْدَهُ قَوْمٌ فَهُمْ شُرَكَاؤُهُ فِيهَا الْفَاكِهَةُ وَ غَيْرُهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Usman Bin Isa, raising it, ",
            "‘He<sup>asws</sup> having said: ‘When a gift of food is gifted to the man, and in his presence is a group, so they are his participants in it, the fruits and other such items’."
          ],
          "en.sarwar": [
            "10. Ali ibn Muhammad has narrated from Ahmad ibn Muhammad from certain persons of his people from Aban from Ibrahim ibn ‘Umar from Muhammad ibn Muslim in a Maqtu’ manner who have said the following: “He (the Imam), ‘Alayhi al-Salam, has said, ‘People in the meeting with the recipient of a gift all have a share in that gift.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/121)"
        ],
        "index": 8600,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:50:11",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) لَأَنْ أُهْدِيَ لِأَخِي الْمُسْلِمِ هَدِيَّةً تَنْفَعُهُ أَحَبُّ إِلَيَّ مِنْ أَنْ أَتَصَدَّقَ بِمِثْلِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, form his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘If I<sup>asws</sup> were to gift to my Muslim brother a gift which is beneficial to him, it would be more beloved to me<sup>asws</sup> than if I<sup>asws</sup> were to give in charity with similar to it’."
          ],
          "en.sarwar": [
            "11. Ahmad ibn Muhammad from has narrated from ‘Uthman ibn ’Isa in a marfu’ manner who has said the following: “He (the Imam), ‘Alayhi al-Salam, has said, ‘If one receives a gift such as food or fruits and so on, during a meeting with people around him they also have a share in such gift.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/121)"
        ],
        "index": 8601,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:50:12",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ الْكُوفِيِّ عَنِ الْحُسَيْنِ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) تَهَادَوْا بِالنَّبِقِ تَحْيَا الْمَوَدَّةُ وَ الْمُوَالَاةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Ja’far Bin Muhammad, from Abdul Rahman Bin Muhammad, from Muhammad Bin Ibrahim Al Kufy, from Al Husayn Bin Zayd, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Giving gifts with the fruit-bearing trees revives the cordiality and the loyalty’."
          ],
          "en.sarwar": [
            "12. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Al-Nawfaliy from al-Sakuniy, who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Amir al-Mu’minin, ‘Alayhi al-Salam, has said, ‘Presenting a gift to my Muslim brother which can benefit him is more beloved to me than giving charity.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/121)"
        ],
        "index": 8602,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:50:13",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) تَهَادَوْا تَحَابُّوا تَهَادَوْا فَإِنَّهَا تَذْهَبُ بِالضَّغَائِنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, form Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Give gifts, you would find love. Give gifts, you would remove the malice’."
          ],
          "en.sarwar": [
            "13. Al-Husayn ibn Muhammad has narrated from Ja’far ibn Muhammad from ‘Abd al-Rahman ibn Muhammad from Muhammad ibn Ibrahim al-Kufiy from Al-Husayn ibn Zayd who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘You should exchange gifts of berries; it revives affection and friendship.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/121)"
        ],
        "part_type": "Hadith",
        "text": [
          "14- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللهِ (عَلَيْهِ السَّلام) قَالَ قَالَ رَسُولُ اللهِ (صَلَّى اللهُ عَلَيْهِ وَآلِه) تَهَادَوْا تَحَابُّوا تَهَادَوْا فَإِنَّهَا تَذْهَبُ بِالضَّغَائِنِ. "
        ],
        "translations": {
          "en.sarwar": [
            "14. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy from al-Sakuniy, who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘You should exchange gifts; you will find affection. You should exchange gifts; it removes malice.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:50",
  "kind": "verse_list"
}