{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 57"
        },
        "path": "/books/al-kafi:5:2:57",
        "titles": {
          "ar": "باب مَنْ ذَكَرَ اللَّهَ تَعَالَى فِي السُّوقِ ",
          "en": "Chapter 57 – The one who remembers Allah<sup>azwj</sup> the Exalted in the marketplace"
        }
      }
    ],
    "index": 1269,
    "local_index": 57,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 58"
        },
        "path": "/books/al-kafi:5:2:58",
        "titles": {
          "ar": "باب الْقَوْلِ عِنْدَ مَا يُشْتَرَى لِلتِّجَارَةِ ",
          "en": "Chapter 58 – The words during what one buys for the business"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 56"
        },
        "path": "/books/al-kafi:5:2:56",
        "titles": {
          "ar": "باب السَّبْقِ إِلَى السُّوقِ ",
          "en": "Chapter 56 – The preceding to the marketplace"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:57",
    "titles": {
      "ar": "باب مَنْ ذَكَرَ اللَّهَ تَعَالَى فِي السُّوقِ ",
      "en": "Chapter 57 – The one who remembers Allah<sup>azwj</sup> the Exalted in the marketplace"
    },
    "verse_count": 2,
    "verse_start_index": 8656,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/142)"
        ],
        "index": 8657,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/359",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1176",
              "text": "حَنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ حَنَانٍ عَنْ أَبِيهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:57:1",
        "text": [
          " قَالَ لِي أَبُو جَعْفَرٍ ( عليه السلام ) يَا أَبَا الْفَضْلِ أَ مَا لَكَ مَكَانٌ تَقْعُدُ فِيهِ فَتُعَامِلَ النَّاسَ قَالَ قُلْتُ بَلَى قَالَ مَا مِنْ رَجُلٍ مُؤْمِنٍ يَرُوحُ أَوْ يَغْدُو إِلَى مَجْلِسِهِ أَوْ سُوقِهِ فَيَقُولُ حِينَ يَضَعُ رِجْلَهُ فِي السُّوقِ اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِهَا وَ خَيْرِ أَهْلِهَا إِلَّا وَكَّلَ اللَّهُ عَزَّ وَ جَلَّ بِهِ مَنْ يَحْفَظُهُ وَ يَحْفَظُ عَلَيْهِ حَتَّى يَرْجِعَ إِلَى مَنْزِلِهِ فَيَقُولُ لَهُ قَدْ أُجِرْتَ مِنْ شَرِّهَا وَ شَرِّ أَهْلِهَا يَوْمَكَ هَذَا بِإِذْنِ اللَّهِ عَزَّ وَ جَلَّ وَ قَدْ رُزِقْتَ خَيْرَهَا وَ خَيْرَ أَهْلِهَا فِي يَوْمِكَ هَذَا ",
          "‘اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِهَا وَ خَيْرِ أَهْلِهَا’ ",
          "فَإِذَا جَلَسَ مَجْلِسَهُ قَالَ حِينَ يَجْلِسُ ",
          "‘أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ حَلَالًا طَيِّباً وَ أَعُوذُ بِكَ مِنْ أَنْ أَظْلِمَ أَوْ أُظْلَمَ وَ أَعُوذُ بِكَ مِنْ صَفْقَةٍ خَاسِرَةٍ وَ يَمِينٍ كَاذِبَةٍ’",
          "فَإِذَا قَالَ ذَلِكَ قَالَ لَهُ الْمَلَكُ الْمُوَكَّلُ بِهِ أَبْشِرْ فَمَا فِي سُوقِكَ الْيَوْمَ أَحَدٌ أَوْفَرَ مِنْكَ حَظّاً قَدْ تَعَجَّلْتَ الْحَسَنَاتِ وَ مُحِيَتْ عَنْكَ السَّيِّئَاتُ وَ سَيَأْتِيكَ مَا قَسَمَ اللَّهُ لَكَ مُوَفَّراً حَلَالًا طَيِّباً مُبَارَكاً فِيهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Hanaan, from his father wo said, ",
            "‘Abu Ja’far<sup>asws</sup> said to me: ‘O Abu Al-Fazl! Is there any place for you whereby you can sit in and do business with the people?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘There is none from a Believing man who goes or comes to his gathering or his marketplace, so he is saying when he places his foot in the marketplace,",
            "‘O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> from its goodness and the goodness of its people’, except that Allah<sup>azwj</sup> Mighty and Majestic would Allcoate with him one (Angel) who would protect him, and guard him until he returns to his house. So he (the Angel) would be saying to him: ‘I have rescued you from its evil and the evil of its people on this day of yours by the Permission of Allah<sup>azwj</sup> Mighty and Majestic, and I have graced its goodness and the goodness of its people to you in this day of yours’. ",
            "So when he sits is his seat, he says when he sits, ",
            "‘I testify that there is no god except for Allah<sup>azwj</sup>, One, not having any associates for Him<sup>azwj</sup>, and I testify that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Rasool<sup>saww</sup>. O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> from Your<sup>azwj</sup> Grace, Permissible, good, and I seek Refuge with You<sup>azwj</sup> from being unjust and suffering injustice; and I seek Refuge with You<sup>azwj</sup> from loss-making deals and false oaths’. ",
            "So when he says that, the Angel who is Allocated with him, says to him: ‘Receive glad tidings! There is no one in your market which is more ampler than you in a share. The good has been hastened and the evil has been obliterated from you, and you will be receiving what Allah<sup>azwj</sup> has Apportioned for you with ampleness, Permissible, good, with Blessings therein’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ‘Isma’il from Hanan from his father who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, once said to me, ‘O abu al-Fadl, do you have a place where you can sit and do business with people ? 5 I replied, ‘Yes, I have such a place . 5 He (the Imam) then said, ‘Whoever of believing people during the morning or evening goes to his market-place and says this when setting foot in the market-place, “O Allah, I pray to You to grant me goodness thereby and from its people 55 , Allah, most Majestic, most Glorious, assigns someone to protect him and guard him until he returns to his home; and then says to him, “This day you were protected from the evil of that place and its people by the permission of Allah, most Majestic, most Glorious. This day you were granted goodness thereby and from its people . 55 If one takes his place and says, “I testify that no one, other than Allah who is one only and has no partner, deserves worship and I testify that Muhammad is His servant and Messenger. O Allah, I pray to You to grant me of your extra favor, in lawful manners and clean. I seek protection with You against my doing injustice or suffer injustice by others. I seek protection with You against losing transactions and false swearing . 55 When he says this the angel assigned with him says, “There is glad news for you about your market place. Today there is no one more fortunate than you in it. You were quick to perform good deeds and delete evil ones. What Allah has made your share will come to you a great deal, lawful, clean and with blessings in it . 55 5 55 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/143)"
        ],
        "index": 8658,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/143",
              "text": "مُعَاوِيَةَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:57:2",
        "text": [
          " إِذَا دَخَلْتَ سُوقَكَ فَقُلِ اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِهَا وَ خَيْرِ أَهْلِهَا وَ أَعُوذُ بِكَ مِنْ شَرِّهَا وَ شَرِّ أَهْلِهَا اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ أَنْ أَظْلِمَ أَوْ أُظْلَمَ أَوْ أَبْغِيَ أَوْ يُبْغَى عَلَيَّ أَوْ أَعْتَدِيَ أَوْ يُعْتَدَى عَلَيَّ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ إِبْلِيسَ وَ جُنُودِهِ وَ شَرِّ فَسَقَةِ الْعَرَبِ وَ الْعَجَمِ وَ حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَ هُوَ رَبُّ الْعَرْشِ الْعَظِيمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Mahboub, from Muawiya Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whenever you enter your marketplace, so say, ‘O Allah<sup>azwj</sup>! I ask You<sup>asws</sup> from its goodness and the goodness of its people, and I seek Refuge with you from its evil and the evil of its people! O Allah<sup>azwj</sup> I seek Refuge with You<sup>azwj</sup> from being unjust or suffering injustice, or rebelling or being rebelled against, or exceeding or being exceeded against. O Allah<sup>azwj</sup>! I seek Refuge with You<sup>azwj</sup> from the evil of Iblees<sup>la</sup> and his<sup>la</sup> army, and evil of the wickeds ones of the Arabs and the non-Arabs; and Sufficient is Allah<sup>azwj</sup> for me, there being no god except for Him<sup>azwj</sup>, and upon Him<sup>azwj</sup> do I rely, and He<sup>azwj</sup> is the Lord<sup>azwj</sup> of the Magnificent Throne’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad from ibn Mahbub from Mu‘awiyah ibn ‘Ammar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘When you enter your market-place you should say this, ‘O Allah, I pray to You to grant me of its (market-place) good things and its good people. I seek protection with You against its evil and the evil of its people. O Allah, I seek protection with You against my own injustice and injustice done to me, against my own transgression and the transgression committed against me, against my own excess and excess acts against me. O Allah, I seek protection with You against the evil of Satan and his armies, against the criminal ones of Arab and none-Arab people. Allah is sufficient for me. No one, except Allah, deserves worship. I entrust Him with my affairs and He is the Lord of the great Throne . 555 "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:57",
  "kind": "verse_list"
}