{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 61"
        },
        "path": "/books/al-kafi:5:2:61",
        "titles": {
          "ar": "باب الْغِشِّ ",
          "en": "Chapter 61 – The Cheating"
        }
      }
    ],
    "index": 1273,
    "local_index": 61,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 62"
        },
        "path": "/books/al-kafi:5:2:62",
        "titles": {
          "ar": "باب الْحَلْفِ فِي الشِّرَاءِ وَ الْبَيْعِ ",
          "en": "Chapter 62 – The oath during the buying and the selling"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 60"
        },
        "path": "/books/al-kafi:5:2:60",
        "titles": {
          "ar": "باب الْوَفَاءِ وَ الْبَخْسِ ",
          "en": "Chapter 60 – Fulfilment and the undervalutation (of measuring and weighing)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:61",
    "titles": {
      "ar": "باب الْغِشِّ ",
      "en": "Chapter 61 – The Cheating"
    },
    "verse_count": 7,
    "verse_start_index": 8675,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/148)"
        ],
        "index": 8676,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:61:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَيْسَ مِنَّا مَنْ غَشَّنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Ibn Abu Umeyr, from Hisham Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘He is not from us<sup>asws</sup> the one who cheats us<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from and Muhammad ibn Yahya from Ahmad ibn Muhammad from all from ibn abu ‘Umayr from Hisham ibn Salim who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘One who cheats is not of our people.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/148)"
        ],
        "index": 8677,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:61:2",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِرَجُلٍ يَبِيعُ التَّمْرَ يَا فُلَانُ أَ مَا عَلِمْتَ أَنَّهُ لَيْسَ مِنَ الْمُسْلِمِينَ مَنْ غَشَّهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said to a man selling dates: ‘O so and so! Do you not know that he is not from the Muslims, the one who cheats them?’"
          ],
          "en.sarwar": [
            "2. Through the same chain of narrators as the previous it narrated who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, once said to a man who sold dates, ‘O master so and so, do you know that one who cheats Muslims is not one of them?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/149)"
        ],
        "index": 8678,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:61:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ بَعْضِ أَصْحَابِنَا عَنْ سِجَادَةَ عَنْ مُوسَى بْنِ بَكْرٍ قَالَ كُنَّا عِنْدَ أَبِي الْحَسَنِ ( عليه السلام ) فَإِذَا دَنَانِيرُ مَصْبُوبَةٌ بَيْنَ يَدَيْهِ فَنَظَرَ إِلَى دِينَارٍ فَأَخَذَهُ بِيَدِهِ ثُمَّ قَطَعَهُ بِنِصْفَيْنِ ثُمَّ قَالَ لِي أَلْقِهِ فِي الْبَالُوعَةِ حَتَّى لَا يُبَاعَ شَيْ‏ءٌ فِيهِ غِشٌّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from one of our companions, from Sajada, from Musa Bin Bakr who said, ",
            "‘We were in the presence of Abu Al-Hassan<sup>asws</sup>, and there were some Dinars in front of him<sup>asws</sup>. So he<sup>asws</sup> looked at a Dinar, took it in his<sup>asws</sup> hand, then broke it into two halves, then said to me: ‘Throw it in the sewer until something in which is cheating would not be sold (again)’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from certain persons of our people from Sajdah from Musa ibn Bukayr who has said the following: “Once we were in the presence of abu al-Hassan, ‘Alayhi al-Salam, while in front of him there were certain pieces of dinars. He (the Imam) looked at one piece and picked it up and broke it into two pieces. He (the Imam) said to me, ‘Throw it in the trash so an adulterated thing is not purchased anymore.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/149)"
        ],
        "index": 8679,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:61:4",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ عَنْ عُبَيْسِ بْنِ هِشَامٍ عَنْ رَجُلٍ مِنْ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ دَخَلَ عَلَيْهِ رَجُلٌ يَبِيعُ الدَّقِيقَ فَقَالَ إِيَّاكَ وَ الْغِشَّ فَإِنَّ مَنْ غَشَّ غُشَّ فِي مَالِهِ فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ غُشَّ فِي أَهْلِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Al Hassan Bin Ali Bin Abdullah, from Ubeys Bin Hisham, from a man from his companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘A man came over to him<sup>asws</sup> selling the flour, so he<sup>asws</sup> said: ‘Beware of the cheating, for the one who cheats, would himself be cheated in his wealth. So if there does not happen to be wealth for him, he would be cheated in his family’."
          ],
          "en.sarwar": [
            "4. Abu Ali al-Ash’ariy has narrated from al-Hassan ibn Ali ibn ‘Abd Allah from ‘Ubays ibn Hisham from a man of his people who has said the following: “Once, a man who sold flour came before abu ‘Abd Allah, ‘Alayhi al-Salam. He (the Imam) said to him, ‘Beware of cheating; one who cheats in matters of properties, cheating takes place in his properties, if he does not have any property cheating takes place in his family (wife).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/149)"
        ],
        "index": 8680,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:61:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ نَهَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَنْ أَنْ يُشَابَ اللَّبَنُ بِالْمَاءِ لِلْبَيْعِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>azwj</sup> forbade from the milk be mixed with the water for the selling’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from al-Nawfaliy from al-Sakuniy, who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, prohibited mixing of milk with water to sell.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/149)"
        ],
        "index": 8681,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:61:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ الْحَكَمِ قَالَ كُنْتُ أَبِيعُ السَّابِرِيَّ فِي الظِّلَالِ فَمَرَّ بِي أَبُو الْحَسَنِ مُوسَى ( عليه السلام ) فَقَالَ لِي يَا هِشَامُ إِنَّ الْبَيْعَ فِي الظِّلِّ غِشٌّ وَ إِنَّ الْغِشَّ لَا يَحِلُّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Al Hakam who said, ",
            "‘I was selling Al-Sabiriyya (a fabric) in the shade, so Abu Al-Hassan Musa<sup>asws</sup> passed by me, so he<sup>asws</sup> said to me: ‘O Hisham! The selling in the shade (in darkness) is cheating, and that cheating is not Permissible’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hisham ibn al-Hakam who has said the following: “Once when I was selling al-Sabiriy (a certain kind of fabric) in the shade, abu al-Hassan, ‘Alayhi al- Salam, passed by and said to me, ‘O Hisham, selling in shade is cheating and cheating is not lawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/149)"
        ],
        "index": 8682,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:61:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي جَمِيلَةَ عَنْ سَعْدٍ الْإِسْكَافِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ مَرَّ النَّبِيُّ ( صلى الله عليه وآله ) فِي سُوقِ الْمَدِينَةِ بِطَعَامٍ فَقَالَ لِصَاحِبِهِ مَا أَرَى طَعَامَكَ إِلَّا طَيِّباً وَ سَأَلَهُ عَنْ سِعْرِهِ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ أَنْ يَدُسَّ يَدَيْهِ فِي الطَّعَامِ فَفَعَلَ فَأَخْرَجَ طَعَاماً رَدِيّاً فَقَالَ لِصَاحِبِهِ مَا أَرَاكَ إِلَّا وَ قَدْ جَمَعْتَ خِيَانَةً وَ غِشّاً لِلْمُسْلِمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibn Mahboub, from Abu Jameela, from Sa’ad Al Askaaf, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The Prophet<sup>saww</sup> passed in a food market stall of Al-Medina, so he<sup>saww</sup> said to its owner: ‘I<sup>saww</sup> do not see your food except as good’, and he<sup>saww</sup> asked him about its price. So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>saww</sup> that he<sup>saww</sup> should insert his<sup>saww</sup> hand in the food. So he<sup>saww</sup> did it, and there came out food which had perished. So he<sup>saww</sup> said to its owner: ‘I<sup>saww</sup> do not see you except as having gathered betrayal and cheating for the Muslims’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ibn Mahbub from abu Jamilah from Sa‘d al-Iskaf who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘Once, in the market place of al-Madinah, the Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, passed by a place where food was sold. The Holy Prophet said, to the owner, “I can see your food is good.” He then asked about its price. Allah, most Majestic, most Glorious, sent revelation and told him to check the lower levels of the food for sale. When he checked a bad quality of food came out. He then said to the owner, “Now I can see you have collected betrayal and cheating for the Muslims.’”” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:61",
  "kind": "verse_list"
}