{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 62"
        },
        "path": "/books/al-kafi:5:2:62",
        "titles": {
          "ar": "باب الْحَلْفِ فِي الشِّرَاءِ وَ الْبَيْعِ ",
          "en": "Chapter 62 – The oath during the buying and the selling"
        }
      }
    ],
    "index": 1274,
    "local_index": 62,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 63"
        },
        "path": "/books/al-kafi:5:2:63",
        "titles": {
          "ar": "باب الْأَسْعَارِ ",
          "en": "Chapter 63 – The Inflation"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 61"
        },
        "path": "/books/al-kafi:5:2:61",
        "titles": {
          "ar": "باب الْغِشِّ ",
          "en": "Chapter 61 – The Cheating"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:62",
    "titles": {
      "ar": "باب الْحَلْفِ فِي الشِّرَاءِ وَ الْبَيْعِ ",
      "en": "Chapter 62 – The oath during the buying and the selling"
    },
    "verse_count": 4,
    "verse_start_index": 8682,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/150)"
        ],
        "index": 8683,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/202",
              "text": "أَحْمَدَ بْنِ النَّضْرِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3453",
              "text": "أَبِي جَعْفَرٍ الْفَزَارِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ أَحْمَدَ بْنِ النَّضْرِ عَنْ أَبِي جَعْفَرٍ الْفَزَارِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:62:1",
        "text": [
          " دَعَا أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَوْلًى لَهُ يُقَالُ لَهُ مُصَادِفٌ فَأَعْطَاهُ أَلْفَ دِينَارٍ وَ قَالَ لَهُ تَجَهَّزْ حَتَّى تَخْرُجَ إِلَى مِصْرَ فَإِنَّ عِيَالِي قَدْ كَثُرُوا ",
          "قَالَ فَتَجَهَّزَ بِمَتَاعٍ وَ خَرَجَ مَعَ التُّجَّارِ إِلَى مِصْرَ فَلَمَّا دَنَوْا مِنْ مِصْرَ اسْتَقْبَلَتْهُمْ قَافِلَةٌ خَارِجَةٌ مِنْ مِصْرَ فَسَأَلُوهُمْ عَنِ الْمَتَاعِ الَّذِي مَعَهُمْ مَا حَالُهُ فِي الْمَدِينَةِ وَ كَانَ مَتَاعَ الْعَامَّةِ فَأَخْبَرُوهُمْ أَنَّهُ لَيْسَ بِمِصْرَ مِنْهُ شَيْ‏ءٌ فَتَحَالَفُوا وَ تَعَاقَدُوا عَلَى أَنْ لَا يَنْقُصُوا مَتَاعَهُمْ مِنْ رِبْحِ الدِّينَارِ دِينَاراً ",
          "فَلَمَّا قَبَضُوا أَمْوَالَهُمْ وَ انْصَرَفُوا إِلَى الْمَدِينَةِ فَدَخَلَ مُصَادِفٌ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ مَعَهُ كِيسَانِ فِي كُلِّ وَاحِدٍ أَلْفُ دِينَارٍ فَقَالَ جُعِلْتُ فِدَاكَ هَذَا رَأْسُ الْمَالِ وَ هَذَا الْآخَرُ رِبْحٌ فَقَالَ إِنَّ هَذَا الرِّبْحَ كَثِيرٌ وَ لَكِنْ مَا صَنَعْتَهُ فِي الْمَتَاعِ فَحَدَّثَهُ كَيْفَ صَنَعُوا وَ كَيْفَ تَحَالَفُوا ",
          "فَقَالَ سُبْحَانَ اللَّهِ تَحْلِفُونَ عَلَى قَوْمٍ مُسْلِمِينَ أَلَّا تَبِيعُوهُمْ إِلَّا رِبْحَ الدِّينَارِ دِينَاراً ثُمَّ أَخَذَ أَحَدَ الْكِيسَيْنِ فَقَالَ هَذَا رَأْسُ مَالِي وَ لَا حَاجَةَ  لَنَا فِي هَذَا الرِّبْحِ ثُمَّ قَالَ يَا مُصَادِفُ مُجَادَلَةُ السُّيُوفِ أَهْوَنُ مِنْ طَلَبِ الْحَلَالِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Ahmad Bin Al Nazar, from Abu Ja’far Al Fazary who said, ",
            "‘Abu Abdullah called over a slave of his<sup>asws</sup> called Musadif. So he<sup>asws</sup> gave him a thousand Dinars and said to him: ‘Equip yourself until you go out to Egypt, for my<sup>asws</sup> dependents have multiplied’. ",
            "He said, ‘So I equipped myself with belongings and went out along with the merchants to Egypt. So when we approached Egypt, a caravan met them outside of Egypt. So they asked them (Egyptians) about the belongings which were with them, what was its state in the city, and the belongings were general (items). So they (Egyptians) informed them that there was nothing from it available in Egypt. So they vowed and agreed upon that they would not draw out their belongings of a Dinar for a profit less than a Dinar (100% mark-up). ",
            "So when they grabbed their wealth (profits) and left to go to Al-Medina, Musadif came over to Abu Abdullah<sup>asws</sup> and with him were two bags, in each of the bags being a thousand Dinars. So he said, ‘May I be sacrificed for you<sup>asws</sup>! This is the capital of the wealth, and this is another, a profit’. So he<sup>asws</sup> said: ‘This profit is a lot, but what did you do regarding the goods?’ So he narrated to him<sup>asws</sup> how he had dealt and how they had all oathed (for doubling of the price).",
            "So he<sup>asws</sup> said: ‘Glory be to Allah<sup>azwj</sup>! They were oathing against a group of Muslims that they would not be selling to them except for a profit of a Dinar with the Dinar?’ Then he<sup>asws</sup> took one of the bags, so he<sup>asws</sup> said: ‘This is the capital of my<sup>asws</sup> wealth, and there is no need for us<sup>asws</sup> with regards to this profit’. Then he<sup>asws</sup> said: ‘O Musadif! A dispute of the swords is easier than seeking the Permissible’."
          ],
          "en.sarwar": [
            "1. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Ahmad ibn abu Nadr from abu Ja’far al-Fazariy who has said the following: “Once abu Ja‘far, ‘Alayhi al-Salam, called one of his servants named Musadif and gave him a thousand dinar. He (the Imam) told him to prepare for traveling to Egypt and added, ‘The number of my dependents has increased.’ He (the narrator) has said that the servant prepared certain items of merchandise along with the traders to go for trade to Egypt. When they arrived near Egypt they met a caravan coming out of Egypt. They asked the outgoing caravan with regards to the condition of their merchandise, which was of general nature, in the city. The outgoing people informed them that no such merchandise was available in the city. They (people of the incoming caravan) made an agreement among themselves on oath not to sell their merchandise for less than a profit of one dinar for each dinar worth of merchandise. After taking possession of their belongings, they returned to al-Madinah and Musadif came to abu ‘Abd Allah, ‘Alayhi al-Salam, with two bagfuls of dinars, each of which had a thousand dinars. He said, ‘I pray to Allah to keep my soul in service for your cause, this is the capital and this is the profit.’ He (the Imam) said, ‘This is a great deal of profit. However, what did you do with the merchandise?’ He (Musadif) told the story of their agreement on oath. He (the Imam) said, ‘Allah is free of all defects. Why do you make an agreement on oath against a Muslim people not to sell for less than a profit of one dinar for each dinar worth of merchandise?’ He (the Imam) then took the two bags and said, ‘This is my capital and we do not need this profit.’ He (the Imam) said, ‘O Musadif, settling with sword is easier than earning by lawful ways.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/151)"
        ],
        "index": 8684,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/678",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/679",
              "text": "عُبَيْسِ بْنِ هِشَامٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/124",
              "text": "أَبَانِ بْنِ تَغْلِبَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/111",
              "text": "أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ قَالَ"
            }
          ],
          "text": "وَ عَنْهُ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنْ عُبَيْسِ بْنِ هِشَامٍ عَنْ أَبَانِ بْنِ تَغْلِبَ عَنْ أَبِي حَمْزَةَ رَفَعَهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:62:2",
        "text": [
          " قَامَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) عَلَى دَارِ ابْنِ أَبِي مُعَيْطٍ وَ كَانَ يُقَامُ فِيهَا الْإِبِلُ فَقَالَ يَا مَعَاشِرَ السَّمَاسِرَةِ أَقِلُّوا الْأَيْمَانَ فَإِنَّهَا مَنْفَقَةٌ لِلسِّلْعَةِ مَمْحَقَةٌ لِلرِّبْحِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Al Hassan Bin Ali Al Kufy, from Ubeys Bin Hisham, from Aban Bin Taghlub, from Abu Hamza, raising it, said, ",
            "‘Amir Al-Momineen<sup>asws</sup> stood at the door of Ibn Abu Mueet, and the camels used to stand therein, so he<sup>asws</sup> said: ‘O group of middlemen! Lessen the oaths, for (although) these are more profitable for the price, (but) are (eventually) destructive for the profits’."
          ],
          "en.sarwar": [
            "2. Through the same chain of narrators as the previous one is the following Hadith from al-Hassan ibn Ali al-Kufiy from ‘Ubays ibn Hisham from Aban ibn Taghlib from abu Hamzah in a marfu’ manner’ has said, the following: “Amir al-Mu’minin, ‘Alayhi al-Salam, once stood on the house of ibn abu Mu‘ayt where camel men stayed, and said, ‘O middlemen people, you must reduce swearing; it makes a merchandise easily marketable but destroys the profit.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/151)"
        ],
        "index": 8685,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/52",
              "text": "عُبَيْدِ اللَّهِ الدِّهْقَانِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/182",
              "text": "دُرُسْتَ بْنِ أَبِي مَنْصُورٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/54",
              "text": "إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/128",
              "text": "أَبِي الْحَسَنِ مُوسَى ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ عُبَيْدِ اللَّهِ الدِّهْقَانِ عَنْ دُرُسْتَ بْنِ أَبِي مَنْصُورٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ أَبِي الْحَسَنِ مُوسَى ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:62:3",
        "text": [
          " ثَلَاثَةٌ لَا يَنْظُرُ اللَّهُ تَعَالَى إِلَيْهِمْ يَوْمَ الْقِيَامَةِ أَحَدُهُمْ رَجُلٌ اتَّخَذَ اللَّهَ بِضَاعَةً لَا يَشْتَرِي إِلَّا بِيَمِينٍ وَ لَا يَبِيعُ إِلَّا بِيَمِينٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Isa, from Ubeydullah Al Dahqaan, from Dorost Bin Abu mansour, from Ibrahim Bin Abdul Hameed, ",
            "(It has been narrated) from Abu Al-Hassan Musa<sup>asws</sup> having said: ‘Three (types of people), Allah<sup>azwj</sup> the Exalted would not be Considering them on the Day of Judgement – one of them is a man who takes Allah<sup>azwj</sup> with a commodity. He neither buys except with an oath, and he does not sell except with an oath’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Muhammad ibn Tsa from ‘Ubayd Allah al- Dihqan from Durust ibn abu Mansur from Ibrahim ibn ‘Abd al-Hamid who has said the following: “Abu al-Hassan, Musa, ‘Alayhi al-Salam, has said, ‘On the Day of Judgment, Allah, most High, will not look to three kinds of people. Of such people one kind is a man who does not buy or sell anything without swearing.’” "
          ]
        }
      },
      {
        "index": 8686,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3062",
              "text": "مُحَمَّدِ بْنِ الْحَسَنِ زَعْلَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1697",
              "text": "أَبِي إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/279",
              "text": "أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ الْحَسَنِ زَعْلَانَ عَنْ أَبِي إِسْمَاعِيلَ رَفَعَهُ عَنْ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:62:4",
        "text": [
          "هُ كَانَ يَقُولُ إِيَّاكُمْ وَ الْحَلْفَ فَإِنَّهُ يُنَفِّقُ السِّلْعَةَ وَ يَمْحَقُ الْبَرَكَةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Al Hassan Za’laan, from Abu Ismail, ",
            "(It has been narrated) raising it from Amir Al-Momineen<sup>asws</sup> that he<sup>asws</sup> was saying: ‘Beware of swearing the oath, for it frees up the price and it obliterates the Blessings’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn Tsa from Muhammad ibn al-Hassan Za’lan from abu Tsma’il; in a marfu’ manner’ has said, the following: “Amir al-Mu’minin, ‘Alayhi al-Salam, would say, ‘Beware of swearing; it may make a merchandise easily sell, but it destroys the blessings.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:62",
  "kind": "verse_list"
}