{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 63"
        },
        "path": "/books/al-kafi:5:2:63",
        "titles": {
          "ar": "باب الْأَسْعَارِ ",
          "en": "Chapter 63 – The Inflation"
        }
      }
    ],
    "index": 1275,
    "local_index": 63,
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:63",
    "titles": {
      "ar": "باب الْأَسْعَارِ ",
      "en": "Chapter 63 – The Inflation"
    },
    "verse_count": 7,
    "verse_start_index": 8686,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/152)"
        ],
        "index": 8687,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:63:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنِ الْغِفَارِيِّ عَنِ الْقَاسِمِ بْنِ إِسْحَاقَ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَلَامَةُ رِضَا اللَّهِ تَعَالَى فِي خَلْقِهِ عَدْلُ سُلْطَانِهِمْ وَ رُخْصُ أَسْعَارِهِمْ وَ عَلَامَةُ غَضَبِ اللَّهِ تَبَارَكَ وَ تَعَالَى عَلَى خَلْقِهِ جَوْرُ سُلْطَانِهِمْ وَ غَلَاءُ أَسْعَارِهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Yaqoub Bin Yazeed, from Al Ghufary, from Al Qasim Bin Is’haq, from his father, from his grandfather who said, ",
            "‘Rasool-Allah<sup>saww</sup> said: ‘A sign of Pleasure of Allah<sup>azwj</sup> the exalted among His<sup>azwj</sup> creatures is the justice of their Sultan (ruling authority), and cheapness of their prices (low inflation); and a Sign of the Anger of Allah<sup>azwj</sup> Blessed and High upon His<sup>azwj</sup> creatures is the inequity of their Sultan (ruling authority) and the expensiveness of their prices (high inflation)’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Muhammad ibn Ahmad from Ya’qub Yazid from al-Ghifariy from al-Qasim ibn Muhammad ibn Ishaq from his father from his grandfather who has said the following: “He (the Imam), ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘Of the signs of happiness of Allah, most High, with His creatures is the existence of a just ruler and low prices. Of the signs of unhappiness of Allah, most High with His creatures is the existence of an unjust ruler and high prices.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/152)"
        ],
        "index": 8688,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:63:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنْ مُحَمَّدِ بْنِ أَسْلَمَ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ جَلَّ وَ عَزَّ وَكَّلَ بِالسِّعْرِ مَلَكاً فَلَنْ يَغْلُوَ مِنْ قِلَّةٍ وَ لَا يَرْخُصَ مِنْ كَثْرَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Yaqoub Bin Yazeed, from Muhammad Bin Aslam, from the one who mentioned it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Majestic and Mighty has Allocated an Angel to (regulate) the prices, so these would never be high from scarcity, nor would be be low from abundance’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Sahl ibn Ziyad from Ya’qub ibn Yazid from Muhammad ibn Aslam from those whom he has mentioned who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Allah, most Majestic, most Glorious, has assigned an angel on prices. Prices do not go high because of shortages and do not lower because of bounteousness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/152)"
        ],
        "index": 8689,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:63:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنِ الْعَبَّاسِ بْنِ مَعْرُوفٍ عَنِ الْحَجَّالِ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ وَكَّلَ بِالسِّعْرِ مَلَكاً يُدَبِّرُهُ بِأَمْرِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Al Abbas Bin marouf, from Al Hajjal, from one of his companions, from Abu Hamza Al Sumaly, ",
            "(It has been narrated) from Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic has Allocated an Angel with the prices, managing these by His<sup>azwj</sup> Command’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn al-‘Abbas ibn Ma’ruf from al-Hajjal from certain persons of his people from abu Hamzah al-Thumaliy who has said the following: “Ali ibn Al-Husayn, ‘Alayhi al-Salam, has said, ‘Allah, most Majestic, most Glorious, has assigned an angel who regulates prices by His command.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/152)"
        ],
        "index": 8690,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:63:4",
        "text": [
          "سَهْلُ بْنُ زِيَادٍ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ وَكَّلَ بِالْأَسْعَارِ مَلَكاً يُدَبِّرُهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl Bin Ziyad, from Yaqoub Bin Yazeed, from the one who mentioned it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic has Allocated an Angel with the prices, to manage it’."
          ],
          "en.sarwar": [
            "4. Sahl ibn Ziyad has narrated from Ya’qub ibn Yazid from those whom he has mentioned who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Allah, most Majestic, most Glorious, has assigned an angel on prices who regulates them (as needed).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/152)"
        ],
        "index": 8691,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:63:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَمَّادٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ سَعْدٍ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا صَارَتِ الْأَشْيَاءُ لِيُوسُفَ بْنِ يَعْقُوبَ ( عليهما السلام ) جَعَلَ الطَّعَامَ فِي بُيُوتٍ وَ أَمَرَ بَعْضَ وُكَلَائِهِ فَكَانَ يَقُولُ بِعْ بِكَذَا وَ كَذَا وَ السِّعْرُ قَائِمٌ فَلَمَّا عَلِمَ أَنَّهُ يَزِيدُ فِي ذَلِكَ الْيَوْمِ كَرِهَ أَنْ يَجْرِيَ الْغَلَاءُ عَلَى لِسَانِهِ فَقَالَ لَهُ اذْهَبْ فَبِعْ وَ لَمْ يُسَمِّ لَهُ سِعْراً ",
          "فَذَهَبَ الْوَكِيلُ غَيْرَ بَعِيدٍ ثُمَّ رَجَعَ إِلَيْهِ فَقَالَ لَهُ اذْهَبْ فَبِعْ وَ كَرِهَ أَنْ يَجْرِيَ الْغَلَاءُ عَلَى لِسَانِهِ فَذَهَبَ الْوَكِيلُ فَجَاءَ أَوَّلُ مَنِ اكْتَالَ فَلَمَّا بَلَغَ دُونَ مَا كَانَ بِالْأَمْسِ بِمِكْيَالٍ قَالَ الْمُشْتَرِي حَسْبُكَ إِنَّمَا أَرَدْتُ بِكَذَا وَ كَذَا فَعَلِمَ الْوَكِيلُ أَنَّهُ قَدْ غَلَا بِمِكْيَالٍ ",
          "ثُمَّ جَاءَهُ آخَرُ فَقَالَ لَهُ كِلْ لِي فَكَالَ فَلَمَّا بَلَغَ دُونَ الَّذِي كَالَ لِلْأَوَّلِ بِمِكْيَالٍ قَالَ لَهُ الْمُشْتَرِي حَسْبُكَ إِنَّمَا أَرَدْتُ بِكَذَا وَ كَذَا فَعَلِمَ الْوَكِيلُ أَنَّهُ قَدْ غَلَا بِمِكْيَالٍ حَتَّى صَارَ إِلَى وَاحِدٍ بِوَاحِدٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Abdul Rahman Bin Hammad, from Yunus Bin Yaqoub, from Sa’ad, from a man, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the things came to be for Yusuf<sup>as</sup> Bin Yaqoub<sup>as</sup>, he<sup>as</sup> made the good to be in the houses (granaries) and ordered one of his representatives, so he<sup>as</sup> was saying: ‘Sell for such and such’, and the price was fixed. So when he<sup>as</sup> came to know that it had increased during that day, he<sup>as</sup> dislike that he speak of the high prices upon his<sup>as</sup> tongue, so he<sup>as</sup> said to him: ‘Go and sell’, but did not name the price for him.",
            "So the representative did not go far, then returned to him<sup>as</sup>. So he<sup>asws</sup> said to him: ‘Go and sell’, and he<sup>asws</sup> did not speak of the high price upon his<sup>as</sup> tongue. So the representative went. So the first (buyer) came for the measurement. So when it reached less that what was the day before with the measurement, the buyer said, ‘But rather, I wanted with such and such’. So the representative came to that he had priced it high with the measurement.",
            "Then another one came other, so he said to him, ‘Measure out for me’. So he measure out. So when it reached less than that which he had measured out for the first one, the buyer said to him, ‘Sufficient for you! But rather, I wanted with such and such’. So the representative came to know that he had priced it high (by giving out less measure) with the measurement, to the extent that it (prices came down) to one with one’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ‘Abd al- Rahman ibn Hammad from Yunus ibn Ya’qub from Sa‘d from a man who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘When things were given in the control of Joseph ibn Ya’qub, ‘Alayhi al-Salam, he placed the grain in houses (storage) and issued an order to his servants to sell for a price of such and such amount. Prices were fixed. When he learned that prices are high he disliked to speak of high prices and then said, ‘Go and sell without mentioning prices.’ The agent before going far away returned to him. He said, ‘Go and sell.’ He disliked speaking of high prices. The agent went back and the first buyer came. The agent measured for him and when it was still less than the amount of the previous day by one measurement the buyer said, ‘It is enough; I only wanted this much for this much.’ The agent realized that prices are still high. Then another buyer came and asked him to measure for him. He measured for him and it still was one less than the measurement for the previous buyer when this buyer said, ‘This much is enough. I only wanted this much (grain) for this much (money).’ The agent realized that prices are still high and so on until it came down to one for one.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/154)"
        ],
        "index": 8692,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:63:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ أَبِي إِسْمَاعِيلَ السَّرَّاجِ عَنْ حَفْصِ بْنِ عُمَرَ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ غَلَاءُ السِّعْرِ يُسِي‏ءُ الْخُلُقَ وَ يُذْهِبُ الْأَمَانَةَ وَ يُضْجِرُ الْمَرْءَ الْمُسْلِمَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahman Bin Muhammad, from Muhammad Bin Ismail, from Abu Ismail Al Sarraj, from Hafs Bin Umar, from a man, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The high prices worsens the manners, and removes the trustworthiness, and wears out the magnanimity of the Muslim’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ‘Isma’il al-Sarraj from Hafs ibn ‘Umar from a man who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘High prices worsens moral discipline, destroy trust and cause suffering to the Muslims.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/154)"
        ],
        "index": 8693,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:63:7",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِهِ رَفَعَهُ فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنِّي أَراكُمْ بِخَيْرٍ قَالَ كَانَ سِعْرُهُمْ رَخِيصاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from one of his companions, raising it, ",
            "‘Regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[11:84] surely I see you with properity</span>, he<sup>asws</sup> said: ‘Their prices used to be low’."
          ],
          "en.sarwar": [
            "7. Ahmad ibn Muhammad from has narrated from certain persons of his people in a marfu’ manner’ who have said the following: “About the words of Allah, most Majestic, most Glorious, ‘I see you in goodness . . . (11:84) He (the Imam) said, ‘It is a reference to their prices.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:63",
  "kind": "verse_list"
}