{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 72"
        },
        "path": "/books/al-kafi:5:2:72",
        "titles": {
          "ar": "باب إِذَا اخْتَلَفَ الْبَائِعُ وَ الْمُشْتَرِي",
          "en": "Chapter 72 – When the seller and the buyer differ"
        }
      }
    ],
    "index": 1284,
    "local_index": 72,
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:72",
    "titles": {
      "ar": "باب إِذَا اخْتَلَفَ الْبَائِعُ وَ الْمُشْتَرِي",
      "en": "Chapter 72 – When the seller and the buyer differ"
    },
    "verse_count": 2,
    "verse_start_index": 8735,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/170)"
        ],
        "index": 8736,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:72:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الرَّجُلِ يَبِيعُ الشَّيْ‏ءَ فَيَقُولُ الْمُشْتَرِي هُوَ بِكَذَا وَ كَذَا بِأَقَلِّ مَا قَالَ الْبَائِعُ قَالَ الْقَوْلُ قَوْلُ الْبَائِعِ مَعَ يَمِينِهِ إِذَا كَانَ الشَّيْ‏ءُ قَائِماً بِعَيْنِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "<span style=\"font-size: small\">A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from one of his companions, from Abu Abdullah</span><sup>asws</sup><span style=\"font-size: small\"> regarding the man who sells the thing, so the buyer is saying, </span>",
            "‘It is for such and such’, being less than what the seller said. He<sup>asws</sup> said: ‘The (final) word is the word of the seller along with his oath, when the thing still remained standing exactly as it was’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad ibn abu Nasr who has said the following: “About the case of a man who sells something and the buyers says, ‘I pay so and so’ which is less than what the seller wants, abu ‘ Abd Allah, ‘Alayhi al-Salam, has said, The words of seller are accepted on oath if the merchandise still exists.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/171)"
        ],
        "index": 8737,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:72:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنِ الْحُسَيْنِ بْنِ عُمَرَ بْنِ يَزِيدَ عَنْ أَبِيهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِذَا التَّاجِرَانِ صَدَقَا بُورِكَ لَهُمَا فَإِذَا كَذَبَا وَ خَانَا لَمْ يُبَارَكْ لَهُمَا وَ هُمَا بِالْخِيَارِ مَا لَمْ يَفْتَرِقَا فَإِنِ اخْتَلَفَا فَالْقَوْلُ قَوْلُ رَبِّ السِّلْعَةِ أَوْ يَتَتَارَكَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Al Husayn Bin Umar Bin Yazeed, from his father, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘When the two merchants (buyer and seller) are both truthful, there would be Blessings for both of them. So when they are both liars, and betrayers, there would be no Blessings for both of them, and they are both with the choice (not to transact) for as long as they do not separate (from each other). So if they differ, so the (final) word is the word of the owner of the item, or they both leave it’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Al-Husayn ‘Umar ibn Yazid from his father, who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If the two business people speak the truth the transaction is a blessing for them; but if they speak lies and cheat, it does not become a blessing for them. They have the choice to keep or dismiss the transaction as long as they you must not depart each other. After they depart the words of the owner of merchandise are accepted or they can mutually agree to dismiss the transaction.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:72",
  "kind": "verse_list"
}