{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 73"
        },
        "path": "/books/al-kafi:5:2:73",
        "titles": {
          "ar": "باب بَيْعِ الثِّمَارِ وَ شِرَائِهَا ",
          "en": "Chapter 73 – Selling of the fruits and its buying"
        }
      }
    ],
    "index": 1285,
    "local_index": 73,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 74"
        },
        "path": "/books/al-kafi:5:2:74",
        "titles": {
          "ar": "باب شِرَاءِ الطَّعَامِ وَ بَيْعِهِ ",
          "en": "Chapter 74 – Buying the food and selling it"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 72"
        },
        "path": "/books/al-kafi:5:2:72",
        "titles": {
          "ar": "باب إِذَا اخْتَلَفَ الْبَائِعُ وَ الْمُشْتَرِي",
          "en": "Chapter 72 – When the seller and the buyer differ"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:73",
    "titles": {
      "ar": "باب بَيْعِ الثِّمَارِ وَ شِرَائِهَا ",
      "en": "Chapter 73 – Selling of the fruits and its buying"
    },
    "verse_count": 17,
    "verse_start_index": 8737,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/171)"
        ],
        "index": 8738,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/457",
              "text": "الْحَجَّالِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/463",
              "text": "ثَعْلَبَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/558",
              "text": "بُرَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَجَّالِ عَنْ ثَعْلَبَةَ عَنْ بُرَيْدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:73:1",
        "text": [
          " سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الرَّطْبَةِ تُبَاعُ قِطْعَةً أَوْ قِطْعَتَيْنِ أَوْ ثَلَاثَ قِطَعَاتٍ فَقَالَ لَا بَأْسَ قَالَ وَ أَكْثَرْتُ السُّؤَالَ عَنْ أَشْبَاهِ هَذِهِ فَجَعَلَ يَقُولُ لَا بَأْسَ بِهِ فَقُلْتُ لَهُ أَصْلَحَكَ اللَّهُ اسْتِحْيَاءً مِنْ كَثْرَةِ مَا سَأَلْتُهُ وَ قَوْلِهِ لَا بَأْسَ بِهِ إِنَّ مَنْ يَلِينَا يُفْسِدُونَ عَلَيْنَا هَذَا كُلَّهُ فَقَالَ أَظُنُّهُمْ سَمِعُوا حَدِيثَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فِي النَّخْلِ ",
          "ثُمَّ حَالَ بَيْنِي وَ بَيْنَهُ رَجُلٌ فَسَكَتَ فَأَمَرْتُ مُحَمَّدَ بْنَ مُسْلِمٍ أَنْ يَسْأَلَ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ قَوْلِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فِي النَّخْلِ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) خَرَجَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَسَمِعَ ضَوْضَاءً فَقَالَ مَا هَذَا فَقِيلَ لَهُ تَبَايَعَ النَّاسُ بِالنَّخْلِ فَقَعَدَ النَّخْلُ الْعَامَ  فَقَالَ ( صلى الله عليه وآله ) أَمَّا إِذَا فَعَلُوا فَلَا يَشْتَرُوا النَّخْلَ الْعَامَ حَتَّى يَطْلُعَ فِيهِ شَيْ‏ءٌ وَ لَمْ يُحَرِّمْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hajjal, from Sa’alba, from Bureyd who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the dates which are sold by one lot, or two lots, or three lots. So he<sup>asws</sup> said: ‘There is no problem’. And I asked many question about things resembling these, so he<sup>asws</sup> went on saying: ‘There is no problem with it’. So I said to him<sup>asws</sup>, being embarrassed from the many which I had asked him<sup>asws</sup> and his<sup>asws</sup> words: ‘There is no problem with it’, ‘May Allah<sup>saww</sup> Keep you<sup>asws</sup> well! Those around us would be spoiling all of these upon us’. So he<sup>asws</sup> said: ‘I<sup>asws</sup> think they have heard a Hadeeth of Rasool-Allah<sup>saww</sup> regarding the palm trees’. ",
            "Then a man interposed between me and him<sup>asws</sup>, so I kept quiet. Then I instructed Muhammad Bin Muslim that he asks Abu Ja’far<sup>asws</sup>  about the words of Rasool-Allah<sup>saww</sup> regarding the palm tree. So Abu Ja’far<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> came out and he<sup>saww</sup> heard commotion, so he<sup>saww</sup> said: ‘What is this?’ So it was said to him<sup>saww</sup>, ‘The people are buying and selling the palm tree, and the palm tree would sit (awaiting fruits) for the year (forward buying & selling)’. So he<sup>saww</sup> said: ‘But when they do it, they must buy the fruits of the coming year when something of such fruits appears, and they must not make it unlawful."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hajjal from Tha’labah from Burayd who has said the following: “I once asked abu Ja’far. ‘Alayhi al-Salam, about al-Ratbah (a grass, cattle feed) which is sold in the form of one, two or three crops. He (the Imam) said, ‘There is no offense in it.’ I asked many such questions and every time he (the Imam) said, ‘There is no offense in it. 5 I then said, ‘May Allah keep you well’ - because of feeling shy due to my numerous questions and his words, ‘There is no offense in it’- those nearby may spoil for us all of this. He (the Imam) said, ‘I think they have heard the Hadith of the Messenger of Allah about palm trees.’ At this time someone caused an interruption and I remained quiet. I then asked Muhammad ibn Muslim to ask abu Ja‘far, ‘Alayhi al-Salam, about the words of the Messenger of Allah in regard to palm trees. Abu Ja‘far, ‘Alayhi al-Salam, said, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, once came out and heard a great deal of noise. He (the Messenger of Allah) asked about it. It was said to him, “People buy fruits of the coming year of palm trees in exchange for dates.” The Messenger of Allah said, “If they do so they must buy the fruits of the coming year when something of such fruits appears, and they must not make it unlawful.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/172)"
        ],
        "index": 8739,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/73",
              "text": "حَمَّادِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/168",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْحَلَبِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:73:2",
        "text": [
          " سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَنْ شِرَاءِ النَّخْلِ وَ الْكَرْمِ وَ الثِّمَارِ ثَلَاثَ سِنِينَ أَوْ أَرْبَعَ سِنِينَ قَالَ لَا بَأْسَ بِهِ يَقُولُ إِنْ لَمْ يُخْرِجْ فِي هَذِهِ السَّنَةِ أَخْرَجَ فِي قَابِلٍ وَ إِنِ اشْتَرَيْتَهُ فِي سَنَةٍ وَاحِدَةٍ فَلَا تَشْتَرِهِ حَتَّى يَبْلُغَ فَإِنِ اشْتَرَيْتَهُ ثَلَاثَ سِنِينَ قَبْلَ أَنْ يَبْلُغَ فَلَا بَأْسَ ",
          "وَ سُئِلَ عَنِ الرَّجُلِ يَشْتَرِي الثَّمَرَةَ الْمُسَمَّاةَ مِنْ أَرْضٍ فَهَلَكَ ثَمَرَةُ تِلْكَ الْأَرْضِ كُلُّهَا فَقَالَ قَدِ اخْتَصَمُوا فِي ذَلِكَ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَكَانُوا يَذْكُرُونَ ذَلِكَ فَلَمَّا رَآهُمْ لَا يَدَعُونَ الْخُصُومَةَ نَهَاهُمْ عَنْ ذَلِكَ الْبَيْعِ حَتَّى تَبْلُغَ الثَّمَرَةُ وَ لَمْ يُحَرِّمْهُ وَ لَكِنْ فَعَلَ ذَلِكَ مِنْ أَجْلِ خُصُومَتِهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad Bin Usman, form Al Halby who said, ",
            "‘Abu Abdullah<sup>asws</sup> was asked about buying the palm tree and the orchard, and the fruits for the next three years or four years. He<sup>asws</sup> said: ‘There is no problem with it. They are saying that if these do not come out in this year, they would come in the following year, and if it is bought in one year, so do not buy it until it ripens. So if it is bought for three years before the ripening, so there is no problem’. ",
            "And he<sup>asws</sup> was asked about the man who buys the fruits of the season from a land, so all of the fruits of that particular land perish. So he<sup>asws</sup> said: ‘They had disputed regarding that to Rasool-Allah<sup>saww</sup> and they were mentioning that. So when he<sup>saww</sup> saw them that they are not leaving the dispute, he<sup>saww</sup> forbade them from that transaction until the fruits ripened, and he<sup>saww</sup> did no Prohibit it, but he<sup>saww</sup> did that due to the reason of their dispute’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad ibn ‘Uthman from al-Halabiy who has said the following: “Someone once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about buying dates, grapes and fruits of three or four years. He (the Imam) said, ‘There is no offense in it. He (the buyer) can say, “If fruits will not grow this year they will do so next year.” If you buy the fruits of one year only then you must not do so until they are ripe. If you buy them before three years there is no offense in it if the deal takes place before they are ripe.’ Someone asked about buying a certain fruit of a certain land but the fruit of all of that land is ruined. He (the Imam) said, ‘There was dispute about it and it was brought before the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and they kept speaking about it. When he found out that they do not stop disputing, he prohibited them from such transactions until ripening of fruits and did not make it unlawful. However, he did so because of their disputes.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/173)"
        ],
        "index": 8740,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/59",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/62",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/131",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:73:3",
        "text": [
          " سَأَلْتُ الرِّضَا ( عليه السلام ) هَلْ يَجُوزُ بَيْعُ النَّخْلِ إِذَا حَمَلَ فَقَالَ يَجُوزُ بَيْعُهُ حَتَّى يَزْهُوَ فَقُلْتُ وَ مَا الزَّهْوُ جُعِلْتُ فِدَاكَ قَالَ يَحْمَرُّ وَ يَصْفَرُّ وَ شِبْهُ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan Bin Ali Al Washa who said, ",
            "‘I asked Al-Reza<sup>asws</sup>, ‘Is it allowed to sell the palm tree when it is born (sprouts)?’ So he<sup>asws</sup> said: ‘It is allowed until it is in splendour’. So I said, ‘And what is ‘the splendour’, may I be sacrificed for you<sup>asws</sup>?’ He<sup>asws</sup> said: ‘When it becomes red, and yellow, and similar to that’."
          ],
          "en.sarwar": [
            "3. Al-Husayn ibn Muhammad has narrated from Mu’alla’ ibn Muhammad from al-Hassan ibn al-Washsha’ who has said the following: “I once asked al-Rida’, ‘Alayhi al-Salam, ‘Is buying dates permissible when they are formed?’ He (the Imam) replied, ‘It is permissible when they Yazhu.’ I then asked, ‘What is Yazhu?’ He (the Imam) replied, ‘It is when they turn red, yellow and so on.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/173)"
        ],
        "index": 8741,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/121",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/501",
              "text": "رِبْعِيٍّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ رِبْعِيٍّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:73:4",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ لِي نَخْلًا بِالْبَصْرَةِ فَأَبِيعُهُ وَ أُسَمِّي الثَّمَنَ وَ أَسْتَثْنِي الْكُرَّ مِنَ التَّمْرِ أَوْ أَكْثَرَ أَوِ الْعِذْقَ مِنَ النَّخْلِ قَالَ لَا بَأْسَ قُلْتُ جُعِلْتُ فِدَاكَ بَيْعُ السَّنَتَيْنِ قَالَ لَا بَأْسَ قُلْتُ جُعِلْتُ فِدَاكَ إِنَّ ذَا عِنْدَنَا عَظِيمٌ قَالَ أَمَّا إِنَّكَ إِنْ قُلْتَ ذَاكَ لَقَدْ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَحَلَّ ذَلِكَ فَتَظَالَمُوا فَقَالَ ( عليه السلام ) لَا تُبَاعُ الثَّمَرَةُ حَتَّى يَبْدُوَ صَلَاحُهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazal Bin Shazaan, from Ibn Abu Umeyr, from Rabie who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘There is a palm tree for me at Al-Basra. So I sell it, and I name (determine) the fruits, and exclude Al-Kurra (a unit of measurement) from the fruits, or more, or a cluster of the dates’. He<sup>asws</sup> said: ‘There is no problem’. I said, ‘May I be sacrificed for you<sup>asws</sup>! Can I sell it (yield) for the two years?’ He<sup>asws</sup> said: ‘There is no problem’. I said, ‘May I be sacrificed for you<sup>asws</sup>! That is a great matter among us’. He<sup>asws</sup> said: ‘But you, if you are saying that, so Rasool-Allah<sup>saww</sup> had Permitted that, but they were unjust to each other, so he<sup>saww</sup> said: ‘You must not buy it until fruits appear and are out of danger (of dying)’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn ‘Isma’il has narrated from al-Fadl ibn Shadhan from ibn abu ‘Umayr from Rib’iy who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘I have palm tree fruits in Basrah. I sell them for a certain price excluding one Kur (a certain measurement) of the dates or more or the cluster of dates.’ He (the Imam) said, ‘There is no offense in it.’ I then said, ‘I pray to Allah to keep my soul in service for your cause, what do you say about selling for two years?’ He (the Imam) said, ‘There is no offense in it.’ I then said, ‘I pray to Allah to keep my soul in service for your cause, this is great among us.’ He (the Imam) said, ‘As you mentioned it, the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, had made it permissible but they wronged each other. He, ‘Alayhi al-Salam, then said, ‘You must not buy it until fruits appear and are out of danger.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/174)"
        ],
        "index": 8742,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/104",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/603",
              "text": "صَفْوَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/682",
              "text": "يَعْقُوبَ بْنِ شُعَيْبٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ عَنْ يَعْقُوبَ بْنِ شُعَيْبٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:73:5",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا كَانَ الْحَائِطُ فِيهِ ثِمَارٌ مُخْتَلِفَةٌ فَأَدْرَكَ بَعْضُهَا فَلَا بَأْسَ بِبَيْعِهَا جَمِيعاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan, from Yaqoub Bin Shuayb who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘If there was a wall in which there were different fruits, and some of them had ripened, so there is no problem with selling them in their entirety’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Muhammad ibn Al-Husayn from Safwan from Ya’qub ibn Shu’ayb who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If inside the walls there are different fruits and certain kinds are ripe, then there is no offense in buying all of it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل كالموثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/174)"
        ],
        "index": 8743,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1407",
              "text": "حُمَيْدُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1368",
              "text": "ابْنِ سَمَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/212",
              "text": "غَيْرِ وَاحِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1565",
              "text": "إِسْمَاعِيلَ بْنِ الْفَضْلِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ إِسْمَاعِيلَ بْنِ الْفَضْلِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:73:6",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ بَيْعِ الثَّمَرَةِ قَبْلَ أَنْ تُدْرِكَ فَقَالَ إِذَا كَانَ فِي تِلْكَ الْأَرْضِ بَيْعٌ لَهُ غَلَّةٌ قَدْ أَدْرَكَتْ فَبَيْعُ ذَلِكَ كُلِّهِ حَلَالٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Ibn Sama’at, from someone else, from Ismail Bin Al Fazl who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about selling the fruits before they ripen, so he<sup>asws</sup> said: ‘If it was such that in that particular land, selling of it is (like selling) a crop which has ripened, so selling all of that is Permissible’."
          ],
          "en.sarwar": [
            "6. Humayd ibn Ziyad has narrated from ibn Sama’ah from more than one person from ‘Isma’il ibn al-Fadl who has said the following: “I once asked him (the Imam) about selling fruits. ‘Is it permissible to buy fruits before they are formed?’ He (the Imam) replied, ‘If in that area such deals are made and they are profitable which is achieved then there is no offense in such transaction.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/174)"
        ],
        "index": 8744,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/117",
              "text": "عُثْمَانَ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/305",
              "text": "سَمَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:73:7",
        "text": [
          " سَأَلْتُهُ عَنْ بَيْعِ الثَّمَرَةِ هَلْ يَصْلُحُ شِرَاؤُهَا قَبْلَ أَنْ يَخْرُجَ طَلْعُهَا فَقَالَ لَا إِلَّا أَنْ يَشْتَرِيَ مَعَهَا شَيْئاً غَيْرَهَا رَطْبَةً أَوْ بَقْلًا فَيَقُولَ أَشْتَرِي مِنْكَ هَذِهِ الرُّطْبَةَ وَ هَذَا النَّخْلَ وَ هَذَا الشَّجَرَ بِكَذَا وَ كَذَا فَإِنْ لَمْ تَخْرُجِ الثَّمَرَةُ كَانَ رَأْسُ مَالِ الْمُشْتَرِي فِي الرُّطْبَةِ وَ الْبَقْلِ ",
          "وَ سَأَلْتُهُ عَنِ وَرَقِ الشَّجَرِ هَلْ يَصْلُحُ شِرَاؤُهُ ثَلَاثَ خَرَطَاتٍ أَوْ أَرْبَعَ خَرَطَاتٍ فَقَالَ إِذَا رَأَيْتَ الْوَرَقَ فِي شَجَرَةٍ فَاشْتَرِ فِيهِ مَا شِئْتَ مِنْ خَرْطَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from Sama’at who said,",
            "‘I asked him<sup>asws</sup> about selling the fruit, is buying it correct before they sprout?’ So he<sup>asws</sup> said: ‘No, except if you buy something else along with it, dates or vegetables, so you should be saying, ‘I hereby buy these dates, and this palm tree, and this tree with such and such (a price). So if the fruits have not come out yet, the capital wealth of the buyer would be in the dates, and the vegetables’.",
            "And I asked him<sup>asws</sup> about the leaves of the tree, is its buying correct for three crops or four crops?’ So he<sup>asws</sup> said: ‘When you see the leaf in a tree, so you can buy regarding it whatever you so desire to, from a crop’."
          ],
          "en.sarwar": [
            "7. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ‘Uthman ibn ’Isa from Sama’ah who has said the following: “I once asked him (the Imam) about selling fruits. ‘Is it permissible to buy fruits before they are formed?’ He (the Imam) replied, ‘No, it is not permissible unless something else alongside is also purchased, like animal feed or vegetables when the buyer says, ‘I buy this much animal feed and dates from you and this tree in exchange for so and so prices.’ In case, if no fruits appeared the buyers’ capital remains with animal feed or vegetables.’ I then asked him (the Imam) about buying tree leaves. Is it permissible to buy them in three or four kharatat (crops)?’ He (the Imam) said, ‘If you can see leaves on the tree you can buy it for whatever number of cropping you may like.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/174)"
        ],
        "index": 8745,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/600",
              "text": "الْقَاسِمِ بْنِ مُحَمَّدٍ الْجَوْهَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/118",
              "text": "عَلِيِّ بْنِ أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ الْجَوْهَرِيِّ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:73:8",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ اشْتَرَى بُسْتَاناً فِيهِ نَخْلٌ وَ شَجَرٌ مِنْهُ مَا قَدْ أَطْعَمَ وَ مِنْهُ مَا لَمْ يُطْعِمْ قَالَ لَا بَأْسَ بِهِ إِذَا كَانَ فِيهِ مَا قَدْ أَطْعَمَ ",
          "قَالَ وَ سَأَلْتُهُ عَنْ رَجُلٍ اشْتَرَى بُسْتَاناً فِيهِ نَخْلٌ لَيْسَ فِيهِ غَيْرُ بُسْرٍ أَخْضَرَ فَقَالَ لَا حَتَّى يَزْهُوَ قُلْتُ وَ مَا الزَّهْوُ قَالَ حَتَّى يَتَلَوَّنَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husay Bin Saeed, from Al Qasim Bin Muhammad Al Jowhary, from Ali Bin Abu Hamza who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who bought an orchard wherein were palm trees, and trees from it were what could be eaten from, and from it were (trees) what could not be eaten from. He<sup>asws</sup> said: ‘There is no problem with it if therein were (trees) what could be eaten from’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about a man who bought an orchard wherein were palm trees, there was not on it apart from green (unripened dates)’. So he<sup>asws</sup> said: ‘No, until they splendour’. I said, ‘And what is the splendour?’ He<sup>asws</sup> said: ‘Until they colour’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn from al-Qasim ibn Muhammad al-Jawhariy from Ali ibn abu Hamzah who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who buys a garden with palm trees and trees in it of which certain ones have become edible and others are not edible yet. He (the Imam) said, ‘It is not harmful when there are edible ones.’ I then asked him (the Imam) about the case of a man who buys a garden with palm trees in it which does not have anything yet except green dates. He (the Imam) said, ‘No, until they Yazhu.’ I then asked, ‘What is yazhu?’ He (the Imam) said, ‘It is when their color changes.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/175)"
        ],
        "index": 8746,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/104",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/170",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/682",
              "text": "يَعْقُوبَ بْنِ شُعَيْبٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ يَعْقُوبَ بْنِ شُعَيْبٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:73:9",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ قُلْتُ لَهُ أُعْطِي الرَّجُلَ لَهُ الثَّمَرَةُ عِشْرِينَ دِينَاراً عَلَى أَنِّي أَقُولُ لَهُ إِذَا قَامَتْ ثَمَرَتُكَ بِشَيْ‏ءٍ فَهِيَ لِي بِذَلِكَ الثَّمَنِ إِنْ رَضِيتَ أَخَذْتُ وَ إِنْ كَرِهْتَ تَرَكْتُ فَقَالَ مَا تَسْتَطِيعُ أَنْ تُعْطِيَهُ وَ لَا تَشْتَرِطَ شَيْئاً قُلْتُ جُعِلْتُ فِدَاكَ لَا يُسَمِّي شَيْئاً وَ اللَّهُ يَعْلَمُ مِنْ نِيَّتِهِ ذَلِكَ قَالَ لَا يَصْلُحُ إِذَا كَانَ مِنْ نِيَّتِهِ [ذَلِكَ] ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from safwan Bin Yahya, from Yaqoub Bin Shuayb who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> and I said to him<sup>asws</sup>, ‘I gave twenty Dinars to the man who had fruits, upon (a stipulation) I said to him, ‘When your fruits are established with anything, so it is for me with that price. If I am pleased I shall take, and if I dislike, I shall leave it’. So he<sup>asws</sup> said: ‘You have no leeway that you give him nor stipulate anything’. I said, ‘May I be sacrificed for you<sup>asws</sup>! He did not name anything, and Allah<sup>saww</sup> Knows from his intention of that’. He<sup>asws</sup> said: ‘It is not correct when that was an intention of his’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Safwan ibn Yahya from Ya’qub ibn Shu’ayb who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man whom I gave twenty dinar for his fruits saying that when your fruits become fruits these dinars are payments, if then I will like I will take the fruits, and if I will not like I will not take them. He (the Imam) said, ‘You cannot give him or stipulate for anything.’ I said, ‘I pray to Allah to keep my soul in service for your cause, he does not say anything and Allah knows his intention.’ He (the Imam) said, ‘It is not valid if it is in his intention (the merchandise must exist).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/175)"
        ],
        "index": 8747,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/300",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/168",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:73:10",
        "text": [
          " قَالَ فِي رَجُلٍ قَالَ لآِخَرَ بِعْنِي ثَمَرَةَ نَخْلِكَ هَذَا الَّذِي فِيهَا بِقَفِيزَيْنِ مِنْ تَمْرٍ أَوْ أَقَلَّ أَوْ أَكْثَرَ يُسَمِّي مَا شَاءَ فَبَاعَهُ فَقَالَ لَا بَأْسَ بِهِ وَ قَالَ التَّمْرُ وَ الْبُسْرُ مِنْ نَخْلَةٍ وَاحِدَةٍ لَا بَأْسَ بِهِ فَأَمَّا أَنْ يَخْلِطَ التَّمْرَ الْعَتِيقَ أَوِ الْبُسْرَ فَلَا يَصْلُحُ وَ الزَّبِيبُ وَ الْعِنَبُ مِثْلُ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said regarding a man who said to another, ‘Sell to me the fruits of your palm tree, this one in which there is, with two Qafeyz (a unit of measurement) of dates, or less, or more’, naming whatever he so likes to, so he sells it’. So he<sup>asws</sup> said: ‘There is no problem with it’. And he<sup>asws</sup> said: ‘The dates and the half-ripened from one tree, there is no problem with it. But if you were to mix the old dates, or half-ripened, so it is not correct; and the raisins and the grapes are similar to that’."
          ],
          "en.sarwar": [
            "10. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “This is about the case of a man who says to another man, ‘Sell to me fruits of your palm tree for two Qafiz (a certain measurement) of dates or less or more...’ specifying the amount as he likes and he sells it. He (the Imam) said, ‘It is not harmful. 5 He (the Imam) said, ‘Dates and half ripe dates of a palm tree are the same and it is not harmful. Mixing old dates and half ripe fresh dates is not valid and so also is true for raisins and grapes.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/176)"
        ],
        "index": 8748,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/239",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2694",
              "text": "مُعَاوِيَةَ بْنِ مَيْسَرَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ مُعَاوِيَةَ بْنِ مَيْسَرَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:73:11",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ بَيْعِ النَّخْلِ سَنَتَيْنِ قَالَ لَا بَأْسَ بِهِ قُلْتُ فَالرُّطْبَةُ يَبِيعُهَا هَذِهِ الْجِزَّةَ وَ كَذَا وَ كَذَا جِزَّةً بَعْدَهَا قَالَ لَا بَأْسَ بِهِ ثُمَّ قَالَ قَدْ كَانَ أَبِي يَبِيعُ الْحِنَّاءَ كَذَا وَ كَذَا خَرْطَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Muawiya Bin Maysara who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about selling the palm tree (yield) of two years. He<sup>asws</sup> said: ‘There is no problem with it’. I said, ‘So the dates can be sold for this picking, and such and such a picking after it?’ He<sup>asws</sup> said: ‘There is no problem with it’. Then he<sup>asws</sup> said: ‘My<sup>asws</sup> father<sup>asws</sup> had sold the henna (yield) of such and such a harvest’."
          ],
          "en.sarwar": [
            "11. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad from ibn abu Nasr from Mu‘awiyah ibn Muyassir who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about selling palm trees for two years. He (the Imam) said, ‘It is not harmful.’ I then asked if fresh dates can be sold in the form of one or several pickings fresh from the trees each time they ripen. He (the Imam) said, ‘It is not harmful.’ He (the Imam) then said, ‘My father would sell the plant of henna in the manner of several harvests.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل كالموثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/176)"
        ],
        "index": 8749,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1407",
              "text": "حُمَيْدُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1408",
              "text": "الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/212",
              "text": "غَيْرِ وَاحِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/257",
              "text": "أَبَانِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2181",
              "text": "يَحْيَى بْنِ أَبِي الْعَلَاءِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ يَحْيَى بْنِ أَبِي الْعَلَاءِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:73:12",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَنْ بَاعَ نَخْلًا قَدْ لَقِحَ فَالثَّمَرَةُ لِلْبَائِعِ إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُ قَضَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِذَلِكَ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from someone else, from Aban Bin Usman, from Yahya Bin Abu Al A’ala who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The one who sells a palm tree which had pollinated, so the fruits are for the seller, except if the buyer had stipulated otherwise. Rasool-Allah<sup>saww</sup> had judged with that’."
          ],
          "en.sarwar": [
            "12. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad ibn Sama‘ah from more than one person from Aban ibn ‘Uthman from Yahya ibn abu al-‘Ala’ who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If one sells palm trees which are pollinated, the fruit then belongs to the seller unless the buyer has stipulated otherwise. This is how the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, judged a case.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/177)"
        ],
        "index": 8750,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/300",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/168",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " فِي"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:73:13",
        "text": [
          " شِرَاءِ الثَّمَرَةِ قَالَ إِذَا سَاوَتْ شَيْئاً فَلَا بَأْسَ بِشِرَائِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding buying the fruit. He<sup>asws</sup> said: ‘When something is unspoilt, so there is no problem with buying it’."
          ],
          "en.sarwar": [
            "13. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “About the case of buying fruits, abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘When it becomes something buying it is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/177)"
        ],
        "index": 8751,
        "local_index": 14,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/241",
              "text": "مُحَمَّدِ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1637",
              "text": "غِيَاثِ بْنِ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ غِيَاثِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:73:14",
        "text": [
          " قَالَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) مَنْ بَاعَ نَخْلًا قَدْ أَبَّرَهُ فَثَمَرَتُهُ لِلْبَائِعِ إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُ ثُمَّ قَالَ عَلِيٌّ ( عليه السلام ) قَضَى بِهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله )."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa,, from Muhammad Bin Yahya, from Giyas Bin Ibrahim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘The one who sells a palm tree which had pollinated, so its fruit is for the seller except if the buyer had stipulated otherwise’."
          ],
          "en.sarwar": [
            "14. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Yahya from Ghiyath ibn Ibrahim who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin has said, ‘If one sells palm trees which he has pollinated, its dates belong to the seller unless the buyer stipulates otherwise. Ali, ‘Alayhi al-Salam, then said that this is how the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, judged a case.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/177)"
        ],
        "index": 8752,
        "local_index": 15,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1892",
              "text": "إِبْرَاهِيمَ الْكَرْخِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ إِبْرَاهِيمَ الْكَرْخِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:73:15",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) قُلْتُ لَهُ إِنِّي كُنْتُ بِعْتُ رَجُلًا نَخْلًا كَذَا وَ كَذَا نَخْلَةً بِكَذَا وَ كَذَا دِرْهَماً وَ النَّخْلُ فِيهِ ثَمَرٌ فَانْطَلَقَ الَّذِي اشْتَرَاهُ مِنِّي فَبَاعَهُ مِنْ رَجُلٍ آخَرَ بِرِبْحٍ وَ لَمْ يَكُنْ نَقَدَنِي وَ لَا قَبَضَهُ مِنِّي قَالَ فَقَالَ لَا بَأْسَ بِذَلِكَ أَ لَيْسَ قَدْ كَانَ ضَمِنَ لَكَ الثَّمَنَ قُلْتُ نَعَمْ قَالَ فَالرِّبْحُ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Ibrahim Al Karkhy who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> saying to him<sup>asws</sup>, ‘I had sold such and such a palm tree to a man for such and such Dirhams, and the palm tree had fruits in it. So the one who had bought it from me went on to sell it to a another man with a profit, and he did not pay me anything nor had he taken possession from me’. So he<sup>asws</sup> said: ‘There is no problem with that. Had he not taken the responsibility to you for the price?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘So the profits is for him’."
          ],
          "en.sarwar": [
            "15. Ali ibn Ibrahim has narrated from his father from ‘Isma’il ibn Marrar from Yunus who has said the following: “The explanation of the words of the Holy Prophet, ‘People of the city must not sell to the people of countryside’ is that fruits and all kinds of grains which are transported from countryside to the market place, it (their sale) then is not permissible for the people of the market place to buy such items from them to sell to the people. The transporting ones from the countryside and wilderness must sell them. However, those who transport such items from one city to another city can sell them because it is like trading.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/177)"
        ],
        "index": 8753,
        "local_index": 16,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/104",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2676",
              "text": "مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ هِلَالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2860",
              "text": "عُقْبَةَ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ هِلَالٍ عَنْ عُقْبَةَ بْنِ خَالِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:73:16",
        "text": [
          " قَضَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَنَّ ثَمَرَ النَّخْلِ لِلَّذِي أَبَّرَهَا إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Abdullah Bin Hilal, from Uqba Bin Khalid, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> judged that the fruits of the palm tree is for the one who had pollinated it (seller) except if the buyer stipulates otherwise’."
          ],
          "en.sarwar": [
            "16. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from Ibrahim al-Karkhiy who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, that I had sold palm trees each for such and such number of dirham. The palm trees had fruits on them. The buyer then sold them to another man for a certain amount of profit but he had not paid me anything and had not received any delivery from me. He (the Imam) said, Tt is not harmful. Had he not taken responsibility for payment? 5 I replied, ‘Yes, he had done so. He (the Imam) said, ‘The profit then belongs to him. 5 ” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/178)"
        ],
        "index": 8754,
        "local_index": 17,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/964",
              "text": "مُحَمَّدِ بْنِ أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/972",
              "text": "أَحْمَدَ بْنِ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/749",
              "text": "عَمْرِو بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/750",
              "text": "مُصَدِّقِ بْنِ صَدَقَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2295",
              "text": "عَمَّارِ بْنِ مُوسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ أَحْمَدَ بْنِ الْحَسَنِ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ مُصَدِّقِ بْنِ صَدَقَةَ عَنْ عَمَّارِ بْنِ مُوسَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:73:17",
        "text": [
          " سَأَلْتُهُ عَنِ الْكَرْمِ مَتَى يَحِلُّ بَيْعُهُ قَالَ إِذَا عَقَدَ وَ صَارَ عُرُوقاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Ahmad Bin Al Hassan, from Amro Bin Saeed, from Musaddaq Bin Sadaqa, from Ammar Bin Musa, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the vineyard, when it is Permissible to sell it? He<sup>asws</sup> said: ‘When it intertwines and becomes vines’."
          ],
          "en.sarwar": [
            "17. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn ‘Abd Allah ibn Hilal from ‘Uqbah ibn Khalid who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, had judged that the fruits of the palm trees pollinated belong to the seller unless the buyer stipulates otherwise.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/178)"
        ],
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "18- "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/964",
              "text": "مُحَمَّدِ بْنِ أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/972",
              "text": "أَحْمَدَ بْنِ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/749",
              "text": "عَمْرِو بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/750",
              "text": "مُصَدِّقِ بْنِ صَدَقَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2295",
              "text": "عَمَّارِ بْنِ مُوسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3301",
              "text": "أَبِي عَبْدِ اللهِ (عَلَيْهِ السَّلام)"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "18- مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ أَحْمَدَ بْنِ الْحَسَنِ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ مُصَدِّقِ بْنِ صَدَقَةَ عَنْ عَمَّارِ بْنِ مُوسَى عَنْ أَبِي عَبْدِ اللهِ (عَلَيْهِ السَّلام) قَالَ"
        },
        "part_type": "Hadith",
        "text": [
          " سَأَلْتُهُ عَنِ الْكَرْمِ مَتَى يَحِلُّ بَيْعُهُ قَالَ إِذَا عَقَدَ وَصَارَ عُرُوقاً. "
        ],
        "translations": {
          "en.sarwar": [
            "18. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ahmad ibn al-Hassan from ‘Amr ibn Sa‘id from Musaddiq ibn Sadaqah from ‘Ammar ibn Musa who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about vines when it is permissible to sell them. He (the Imam) said, Tt is permissible when they form into vines.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:73",
  "kind": "verse_list"
}