{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 74"
        },
        "path": "/books/al-kafi:5:2:74",
        "titles": {
          "ar": "باب شِرَاءِ الطَّعَامِ وَ بَيْعِهِ ",
          "en": "Chapter 74 – Buying the food and selling it"
        }
      }
    ],
    "index": 1286,
    "local_index": 74,
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:74",
    "titles": {
      "ar": "باب شِرَاءِ الطَّعَامِ وَ بَيْعِهِ ",
      "en": "Chapter 74 – Buying the food and selling it"
    },
    "verse_count": 9,
    "verse_start_index": 8754,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/179)"
        ],
        "index": 8755,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:74:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ سَأَلْتُهُ عَنْ شِرَاءِ الطَّعَامِ مِمَّا يُكَالُ أَوْ يُوزَنُ هَلْ يَصْلُحُ شِرَاهُ بِغَيْرِ كَيْلٍ وَ لَا وَزْنٍ فَقَالَ أَمَّا أَنْ تَأْتِيَ رَجُلًا فِي طَعَامٍ قَدِ اكْتِيلَ أَوْ وُزِنَ فَيَشْتَرِيَ مِنْهُ مُرَابَحَةً فَلَا بَأْسَ إِنْ أَنْتَ اشْتَرَيْتَهُ وَ لَمْ تَكِلْهُ أَوْ تَزِنْهُ إِذَا كَانَ الْمُشْتَرِي الْأَوَّلُ قَدْ أَخَذَهُ بِكَيْلٍ أَوْ وَزْنٍ فَقُلْتَ عِنْدَ الْبَيْعِ إِنِّي أُرْبِحُكَ فِيهِ كَذَا وَ كَذَا وَ قَدْ رَضِيتُ بِكَيْلِكَ أَوْ وَزْنِكَ فَلَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Usman Bin Isa, from Sama’at who said, ",
            "‘I asked him about buying the foodstuff, from what is measure or weighed, is buying it correct without a measurement or weighing?’ So he<sup>asws</sup> said: ‘If you go over to a man regarding food which had already been measured or weighed, so you buy it from him with a profit, so there is no problem if you were to buy it and do not measure it or weigh it, when it was such that the former buyer had taken it with a measurement or weight. So you should say when buying, ‘I give you such and such amount of profit, and I am pleased with your measurement or your weighing’, so there is no problem’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from ‘Uthman ibn ‘Isa from Sama‘ah who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about buying food which is exchanged by means of weighing or measuring, if such items can be bought without weighing or measuring. He (the Imam) said, ‘If you find a man with food which he has weighed or measured and it is bought from him with profit for him, it is not harmful if you buy it without weighing and measuring. If the first buyer had bought it by weighing and measurement and you say when buying, “I give you such and such amount of profit and I accept your weighing and measuring then it is not harmful.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/181)"
        ],
        "index": 8756,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:74:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ فِي الرَّجُلِ يَبْتَاعُ الطَّعَامَ ثُمَّ يَبِيعُهُ قَبْلَ أَنْ يُكَالَ قَالَ لَا يَصْلُحُ لَهُ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said regarding the man who bought some foodstuff, then sold it before weighing. He<sup>asws</sup> said: ‘That is not correct for him’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “About the case of a man who buys a certain amount of food then sells it without weighing or measurement, he (the Imam) said, ‘It is not a valid deal.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/180)"
        ],
        "index": 8757,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:74:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الرَّجُلِ يَشْتَرِي الطَّعَامَ ثُمَّ يَبِيعُهُ قَبْلَ أَنْ يَقْبِضَهُ قَالَ لَا بَأْسَ وَ يُوَكِّلُ الرَّجُلُ الْمُشْتَرِيَ مِنْهُ بِقَبْضِهِ وَ كَيْلِهِ قَالَ لَا بَأْسَ [بِذَلِكَ] ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Hadeed, from Jameel Bin Darraj, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the man who buys the foodstuff, then sells it before he takes possession of it’. He<sup>asws</sup> said: ‘There is no problem’. (I said), ‘Can the buyer from him appoint the man (another one) to take possession of it and have it measured?’ He<sup>asws</sup> said: ‘There is no problem (with that)’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn Hadid from Jamil ibn Darraj who has said the following: “About the case of a man who buys food then sells it before receiving delivery, he (the Imam) said, ‘It is not harmful.’ ‘Can he appoint the second buyer as his agent to receive delivery?’ He (the Imam) said, ‘It is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/180)"
        ],
        "index": 8758,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:74:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ اشْتَرَى مِنْ رَجُلٍ طَعَاماً عِدْلًا بِكَيْلٍ مَعْلُومٍ ثُمَّ إِنَّ صَاحِبَهُ قَالَ لِلْمُشْتَرِي ابْتَعْ مِنِّي هَذَا الْعِدْلَ الْآخَرَ بِغَيْرِ كَيْلٍ فَإِنَّ فِيهِ مِثْلَ مَا فِي الْآخَرِ الَّذِي ابْتَعْتَهُ قَالَ لَا يَصْلُحُ إِلَّا أَنْ يَكِيلَ ",
          "وَ قَالَ مَا كَانَ مِنْ طَعَامٍ سَمَّيْتَ فِيهِ كَيْلًا فَإِنَّهُ لَا يَصْلُحُ مُجَازَفَةً هَذَا مَا يُكْرَهُ مِنْ بَيْعِ الطَّعَامِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, form Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who buys some foodstuff from a man a package of a known weight. Then its owner says to the buyer, ‘Buy this other one from me without measurement, for therein is similar to what was in the other one which you have bought’. He<sup>asws</sup> said: ‘That is not correct except if he measures it out’. ",
            "And he<sup>asws</sup> said: ‘Whatever was from the foodstuffs wherein a measurement was mentioned, so it is not correct for an estimation. This is what is abhorred from selling of the foodstuffs’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “About the case of a man who buys food from another man, a package by means of known measurement then the party asks the buyer to buy from him another similar package without measurement, because it is similar to the other package already bought. He (the Imam) said, ‘It is not valid without measurement.’ He (the Imam) said, ‘Venturous estimation in food items which are exchanged by measurement is not valid and it is of undesirable matters in food items.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل كالموثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/181)"
        ],
        "index": 8759,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:74:5",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ عَلَيْهِ كُرٌّ مِنْ طَعَامٍ فَاشْتَرَى كُرّاً مِنْ رَجُلٍ آخَرَ فَقَالَ لِلرَّجُلِ انْطَلِقْ فَاسْتَوْفِ كُرَّكَ قَالَ لَا بَأْسَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from someone else, from Aban Bin Usman, from Abdul Rahman Bin Abu Abdullah, said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man upon whom (is a debt of) one Kurra (a unit of measurement) of foodstuff. So he buys one Kurra from another man. So he says to the man, ‘Go and fulfil your (debt upon me) of one Kurr (from that man)’. He<sup>asws</sup> said: ‘There is no problem with it’."
          ],
          "en.sarwar": [
            "5. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad ibn Sama‘ah from more than one person from Aban ibn ‘Uthman from ‘Abd al-Rahman ibn abu ‘Abd Allah who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who owes one kur (a certain amount) of food. He then buys one kur of food from another man and asks his creditor to come to receive the Kur of food owed to him. He (the Imam) said, ‘Such a transaction is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/181)"
        ],
        "index": 8760,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:74:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي الْعُطَارِدِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَشْتَرِي الطَّعَامَ فَأَضَعُ فِي أَوَّلِهِ وَ أَرْبَحُ فِي آخِرِهِ فَأَسْأَلُ صَاحِبِي أَنْ يَحُطَّ عَنِّي فِي كُلِّ كُرٍّ كَذَا وَ كَذَا فَقَالَ هَذَا لَا خَيْرَ فِيهِ وَ لَكِنْ يَحُطُّ عَنْكَ جُمْلَةً قُلْتُ فَإِنْ حَطَّ عَنِّي أَكْثَرَ مِمَّا وَضِعْتُ قَالَ لَا بَأْسَ بِهِ قُلْتُ فَأُخْرِجُ الْكُرَّ وَ الْكُرَّيْنِ فَيَقُولُ الرَّجُلُ أَعْطِنِيهِ بِكَيْلِكَ فَقَالَ إِذَا ائْتَمَنَكَ فَلَيْسَ بِهِ بَأْسٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan Bin Yahya, from Is’haq Bin Ammar, from Abu Al Utarad who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I buy some foodstuff, so I lose in the beginning of it and I profit in the end of it. So I ask my companions that he drops (the price) from me with each Kurra (a unit of measurement) by such and such (an amount)’. So he<sup>asws</sup> said: ‘This, there is no goodness in it, but he should drop from you from the whole’. I said, ‘Supposing if he drop from the more that what I have lost?’ He<sup>asws</sup> said: ‘There is no problem with it’. I said, ‘So if I were to extract one Kurra and two Kurras (units of measurement), so the man is saying, ‘I give it by your measurement’. So he<sup>asws</sup> said: ‘If he trusts you, so there is no problem with it’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Safwan ibn Yahya from Ishaq ibn ‘Ammar from abu al-‘Atarud who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, that I buy food in a deal in the beginning of which I lose and in the end I gain profit. I then ask my friend to reduce a certain amount on each kur. He (the Imam) said, ‘There is nothing good in it, however, he can reduce a certain sum.’ I then asked, ‘Can he reduce more than I have lost?’ He (the Imam) said, ‘It is not harmful.’ I then asked if I can keep aside one or two kur and the man asks me to give him according to my measurement. He (the Imam) said, ‘It is not harmful if he can trust you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/182)"
        ],
        "index": 8761,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:74:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ أَبِي سَعِيدٍ الْمُكَارِي عَنْ عَبْدِ الْمَلِكِ بْنِ عَمْرٍو قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَشْتَرِي الطَّعَامَ فَأَكْتَالُهُ وَ مَعِي مَنْ قَدْ شَهِدَ الْكَيْلَ وَ إِنَّمَا اكْتَلْتُهُ لِنَفْسِي فَيَقُولُ بِعْنِيهِ فَأَبِيعُهُ إِيَّاهُ بِذَلِكَ الْكَيْلِ الَّذِي كِلْتُهُ قَالَ لَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan Bin Yahya, from Abu Saeed Al Mukarayy, from Abdul Malik Bin Amro who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I buy the foodstuff, so I measure it out and with me is one who witnesses the measuring, but rather I weigh it out for myself. So he is saying, ‘Sell it’. So I sell it to him with that measurement which I measured out’. He<sup>asws</sup> said: ‘There is no problem’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Safwan ibn Yahya from abu Sa‘id al-Mukariy from ‘Abd al-Malik ibn ‘Amr who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about food that I buy and I measure it when someone witnesses my measuring but I measure it for myself. He then says, ‘Sell it to me.’ I then sell it to him by means of the same measurement that I made for myself. He (the Imam) said, ‘It is not harmful.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/182)"
        ],
        "index": 8762,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:74:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) اشْتَرَى رَجُلٌ تِبْنَ بَيْدَرٍ كُلَّ كُرٍّ بِشَيْ‏ءٍ مَعْلُومٍ فَيَقْبِضُ التِّبْنَ وَ يَبِيعُهُ قَبْلَ أَنْ يُكَالَ الطَّعَامُ قَالَ لَا بَأْسَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘A man buys threshing hay, each Kurra with a known thing. So he takes possession of the hay and sells it before he measures the (animal) feed’. He<sup>asws</sup> said: ‘There is no problem with it’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Jamil who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who buys hay which is on the threshing floor, each kur for a certain amount. He receives delivery of hay and sells it before measuring the hay. He (the Imam) said, ‘It is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح على الظاهر   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/183)"
        ],
        "index": 8763,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:74:9",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ عَنِ ابْنِ مُسْكَانَ عَنْ إِسْحَاقَ الْمَدَائِنِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْقَوْمِ يَدْخُلُونَ السَّفِينَةَ يَشْتَرُونَ الطَّعَامَ فَيَتَسَاوَمُونَ بِهَا ثُمَّ يَشْتَرِي رَجُلٌ مِنْهُمْ فَيَتَسَاءَلُونَهُ فَيُعْطِيهِمْ مَا يُرِيدُونَ مِنَ الطَّعَامِ فَيَكُونُ صَاحِبُ الطَّعَامِ هُوَ الَّذِي يَدْفَعُهُ إِلَيْهِمْ وَ يَقْبِضُ الثَّمَنَ قَالَ لَا بَأْسَ مَا أَرَاهُمْ إِلَّا وَ قَدْ شَرِكُوهُ فَقُلْتُ إِنَّ صَاحِبَ الطَّعَامِ يَدْعُو كَيَّالًا فَيَكِيلُهُ لَنَا وَ لَنَا أُجَرَاءُ فَيُعَيِّرُونَهُ فَيَزِيدُ وَ يَنْقُصُ قَالَ لَا بَأْسَ مَا لَمْ يَكُنْ شَيْ‏ءٌ كَثِيرٌ غَلَطٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan, from Ibn Muskann, from Is’haq Al Madainy who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the people who are entering the ship, so they are buying the foodstuff, and they are haggling with it. Then a man from them buys it, so they are asking him whatever that want from the foodstuff. So he becomes the owner of the food, the one handed it over to them and took the price’. He<sup>asws</sup> said: ‘There is no problem. I<sup>asws</sup> do not see them except that they had participated him’. So I said, ‘If the owner of the food invites a measurer, so he measures it out for us, and for us are employees who are conducting it, so there are increases and decreases’. He<sup>asws</sup> said: ‘There is no problem for as long as there are not many errors’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Safwan from ibn Muskan from Ishaq al-Mad’iniy who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a people who embark in a ship and buy food and bargain about it. Then one man buys from them. They ask him and he gives them what they ask for of food. So he who collects payment and gives them food becomes the owner of food. He (the Imam) said, ‘It is not harmful. I do not see anything else except that they were partners.’ I then said, ‘The owner of food asks a measuring person who measures for us and we have workers who examine and finds increases and decreases. He (the Imam) said, ‘It is not harmful if errors are not many.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:74",
  "kind": "verse_list"
}