{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 75"
        },
        "path": "/books/al-kafi:5:2:75",
        "titles": {
          "ar": "باب الرَّجُلِ يَشْتَرِي الطَّعَامَ فَيَتَغَيَّرُ سِعْرُهُ قَبْلَ أَنْ يَقْبِضَهُ",
          "en": "Chapter 75 – The man buys the foodstuff, so he changes its price before it is captured"
        }
      }
    ],
    "index": 1287,
    "local_index": 75,
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:75",
    "titles": {
      "ar": "باب الرَّجُلِ يَشْتَرِي الطَّعَامَ فَيَتَغَيَّرُ سِعْرُهُ قَبْلَ أَنْ يَقْبِضَهُ",
      "en": "Chapter 75 – The man buys the foodstuff, so he changes its price before it is captured"
    },
    "verse_count": 3,
    "verse_start_index": 8763,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/183)"
        ],
        "index": 8764,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:75:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ ابْتَاعَ مِنْ رَجُلٍ طَعَاماً بِدَرَاهِمَ فَأَخَذَ نِصْفَهُ وَ تَرَكَ نِصْفَهُ ثُمَّ جَاءَ بَعْدَ ذَلِكَ وَ قَدِ ارْتَفَعَ الطَّعَامُ أَوْ نَقَصَ قَالَ إِنْ كَانَ يَوْمَ ابْتَاعَهُ سَاعَرَهُ أَنَّ لَهُ كَذَا وَ كَذَا فَإِنَّمَا لَهُ سِعْرُهُ وَ إِنْ كَانَ إِنَّمَا أَخَذَ بَعْضاً وَ تَرَكَ بَعْضاً وَ لَمْ يُسَمِّ سِعْراً فَإِنَّمَا لَهُ سِعْرُ يَوْمِهِ الَّذِي يَأْخُذُ فِيهِ مَا كَانَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who bought foodstuff from a man with Dirhams. So he took half of it and left half of it. Then he came over after that and the foodstuff had been raised (in price) or reduced. He<sup>asws</sup> said: ‘If on the day he bought it, it had been price for such and such, so rather his price would be for him, and if he had rather taken some and left some, and a price had not been named (determined), so rather for him would be the price on the day in which he takes it, whatever it was’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “About the case of a man who buys food for a few dirham of which he takes one-half and leaves the other half. Thereafter he comes back when prices have risen or have fallen down, Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said, ‘If on the day of purchase he prices them and determines the amount then such price is what it is, but if he has taken a certain amount and has left the rest without pricing he must pay the price of the day that he takes whatever it is.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/184)"
        ],
        "index": 8765,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:75:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ اشْتَرَى طَعَاماً كُلَّ كُرٍّ بِشَيْ‏ءٍ مَعْلُومٍ فَارْتَفَعَ الطَّعَامُ أَوْ نَقَصَ وَ قَدِ اكْتَالَ بَعْضَهُ فَأَبَى صَاحِبُ الطَّعَامِ أَنْ يُسَلِّمَ لَهُ مَا بَقِيَ وَ قَالَ إِنَّمَا لَكَ مَا قَبَضْتَ فَقَالَ إِنْ كَانَ يَوْمَ اشْتَرَاهُ سَاعَرَهُ عَلَى أَنَّهُ لَهُ فَلَهُ مَا بَقِيَ وَ إِنْ كَانَ إِنَّمَا اشْتَرَاهُ وَ لَمْ يَشْتَرِطْ ذَلِكَ فَإِنَّ لَهُ بِقَدْرِ مَا نَقَدَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who bought some foodstuff, each Kurra (a unit of measurement) with a known thing. So the foodstuff (price) was raised or reduced, and some of it had been measure out. So the owner of the foodstuff refused to submit to him what remained (for the old price), and said, ‘But rather, for you is what you captured (took possession of)’. So he<sup>asws</sup> said: ‘If it was on the day he bought for his price, upon (a stipulation) that it (same price) would be for him, so for him would be what remained (at the same price); and if it was such that he had bought it and did not stipulate that, so for him would be in accordance with what he settled in cash’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Jamil who has said the following: “About the case of a man who buys food, every kur (a certain amount) for a certain price, then prices rise or fall when he has measured only a certain part, and the owner of food refuses to deliver to him the rest, abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If on the day of purchase he has priced the food and that the food is his, then the remaining food is also his; but if he had only bought without any condition then only what he has paid for is his.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/184)"
        ],
        "index": 8766,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:75:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى قَالَ كَتَبَ مُحَمَّدُ بْنُ الْحَسَنِ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) رَجُلٌ اسْتَأْجَرَ أَجِيراً يَعْمَلُ لَهُ بِنَاءً أَوْ غَيْرَهُ وَ جَعَلَ يُعْطِيهِ طَعَاماً وَ قُطْناً وَ غَيْرَ ذَلِكَ ثُمَّ تَغَيَّرَ الطَّعَامُ وَ الْقُطْنُ مِنْ سِعْرِهِ الَّذِي كَانَ أَعْطَاهُ إِلَى نُقْصَانٍ أَوْ زِيَادَةٍ أَ يَحْتَسِبُ لَهُ بِسِعْرِ يَوْمَ أَعْطَاهُ أَوْ بِسِعْرِ يَوْمَ حَاسَبَهُ فَوَقَّعَ ( عليه السلام ) يَحْتَسِبُ لَهُ بِسِعْرِ يَوْمٍ شَارَطَهُ فِيهِ إِنْ شَاءَ اللَّهُ",
          "وَ أَجَابَ ( عليه السلام ) فِي الْمَالِ يَحِلُّ عَلَى الرَّجُلِ فَيُعْطِي بِهِ طَعَاماً عِنْدَ مَحِلِّهِ وَ لَمْ يُقَاطِعْهُ ثُمَّ تَغَيَّرَ السِّعْرُ فَوَقَّعَ ( عليه السلام ) لَهُ سِعْرُ يَوْمَ أَعْطَاهُ الطَّعَامَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya who said, ",
            "‘Muhammad Bin Al-Hassan wrote to Abu Muhammad<sup>asws</sup>, ‘A man employed and employee to work for him for a building or something else, and went on to give him foodstuff, and cotton, and other than that. Then the price of the foodstuff and the cottong changes in price from which it was when he had given it, to either a reduction or an increase. Can he count for him with a price on the day he gave it or with a price on the day of his accounting?’ So he<sup>asws</sup> signed: ‘He should account for him with a price of the day he stipulated to him, Allah<sup>saww</sup> Willing’. ",
            "And he<sup>asws</sup> answered regarding the wealth which is released upon the man, so he is given foodstuff with it during his release, and he is not cut off (his services). Then the price changes. So he<sup>asws</sup> signed: ‘For him is a price on the day he was given the foodstuff’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated the following: “Muhammad ibn al-Hassan once wrote to abu Muhammad, ‘Alayhi al-Salam, asking, ‘A man has hired another man to work and build a structure for another person and he gives the worker food, cotton and other things; then the prices of food and cotton rise or fall and change from the day he gave him, if he can count on him with the price of the day of delivery or the price of the day of finalizing the account. He (the Imam) signed the answer, ‘He must pay according to the prices of the day he set mutual conditions (prices, work and so on) if Allah so wills.’ He (the Imam), ‘Alayhi al-Salam, about the question of goods that one receives and pays food for it without determining prices which then change, signed the answer, ‘Prices are that of the day he has given the food.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:75",
  "kind": "verse_list"
}