{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 76"
        },
        "path": "/books/al-kafi:5:2:76",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب فَضْلِ الْكَيْلِ</span> وَ الْمَوَازِينِ ",
          "en": "Chapter 76 – Preference of the measuring and the weighings"
        }
      }
    ],
    "index": 1288,
    "local_index": 76,
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:76",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب فَضْلِ الْكَيْلِ</span> وَ الْمَوَازِينِ ",
      "en": "Chapter 76 – Preference of the measuring and the weighings"
    },
    "verse_count": 4,
    "verse_start_index": 8766,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/185)"
        ],
        "index": 8767,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:76:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَلِيِّ بْنِ عَطِيَّةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) قُلْتُ إِنَّا نَشْتَرِي الطَّعَامَ مِنَ السُّفُنِ ثُمَّ نَكِيلُهُ فَيَزِيدُ فَقَالَ لِي وَ رُبَّمَا نَقَصَ عَلَيْكُمْ قُلْتُ نَعَمْ قَالَ فَإِذَا نَقَصَ يَرُدُّونَ عَلَيْكُمْ قُلْتُ لَا قَالَ لَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ali Bin Atiyya who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> saying, ‘We buy the foodstuff from the ships, then we measure it, so it is more’. So he<sup>asws</sup> said to me: ‘And sometimes it is less upon you’. I said, ‘Yes’. He<sup>asws</sup> said: ‘So when it is less, do they return you the deficiency?’ I said, ‘No’. He<sup>asws</sup> said: ‘There is no problem (with the increase as well)’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr ibn ‘ Atiyyah who has said the following: “This is concerning my question before abu ‘ Abd Allah, ‘Alayhi al-Salam, about the case of our buying food from ships. We then measure and find extra amount. He (the Imam) said, ‘Perhaps you find it to be less also.’ I replied, ‘Yes, that also happens.’ He (the Imam) then asked, ‘Do they give you the deficit?’ I replied, ‘No, they do not give the deficit. He (the Imam) said, ‘It is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/185)"
        ],
        "index": 8768,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:76:2",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ فُضُولِ الْكَيْلِ وَ الْمَوَازِينِ فَقَالَ إِذَا لَمْ يَكُنْ تَعَدِّياً فَلَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajjaj who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the measurements and the weights, so he<sup>asws</sup> said: ‘When there does not happen to be an infringement, so there is no problem’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn ‘Isma’il has narrated from al-Fadl ibn Shadhan from ibn abu ‘Umayr from ‘Abd al-Rahman ibn al-Hajjaj who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the extra in measurement and weighing. He (the Imam) said, ‘If it is not excessive, it is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/185)"
        ],
        "index": 8769,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:76:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ إِنِّي أَمُرُّ عَلَى الرَّجُلِ فَيَعْرِضُ عَلَيَّ الطَّعَامَ فَيَقُولُ قَدْ أَصَبْتُ طَعَاماً مِنْ حَاجَتِكَ فَأَقُولُ لَهُ أَخْرِجْهُ أُرْبِحْكَ فِي الْكُرِّ كَذَا وَ كَذَا فَإِذَا أَخْرَجَهُ نَظَرْتُ إِلَيْهِ فَإِنْ كَانَ مِنْ حَاجَتِي أَخَذْتُهُ وَ إِنْ لَمْ يَكُنْ مِنْ حَاجَتِي تَرَكْتُهُ قَالَ هَذِهِ الْمُرَاوَضَةُ لَا بَأْسَ بِهَا ",
          "قُلْتُ فَأَقُولُ لَهُ اعْزِلْ مِنْهُ خَمْسِينَ كُرّاً أَوْ أَقَلَّ أَوْ أَكْثَرَ بِكَيْلِهِ فَيَزِيدُ وَ يَنْقُصُ وَ أَكْثَرُ ذَلِكَ مَا يَزِيدُ لِمَنْ هِيَ قَالَ هِيَ لَكَ ",
          "ثُمَّ قَالَ ( عليه السلام ) إِنِّي بَعَثْتُ مُعَتِّباً أَوْ سَلَّاماً فَابْتَاعَ لَنَا طَعَاماً فَزَادَ عَلَيْنَا بِدِينَارَيْنِ فَقُتْنَا بِهِ عِيَالَنَا بِمِكْيَالٍ قَدْ عَرَفْنَاهُ فَقُلْتُ لَهُ قَدْ عَرَفْتَ صَاحِبَهُ قَالَ نَعَمْ فَرَدَدْنَا عَلَيْهِ ",
          "فَقُلْتُ رَحِمَكَ اللَّهُ تُفْتِينِي بِأَنَّ الزِّيَادَةَ لِي وَ أَنْتَ تَرُدُّهَا قَدْ عَلِمْتَ أَنَّ ذَلِكَ كَانَ لَهُ قَالَ نَعَمْ إِنَّمَا ذَلِكَ غَلَطُ النَّاسِ لِأَنَّ الَّذِي ابْتَعْنَا بِهِ إِنَّمَا كَانَ ذَلِكَ بِثَمَانِيَةِ دَرَاهِمَ أَوْ تِسْعَةٍ ثُمَّ قَالَ وَ لَكِنِّي أَعُدُّ عَلَيْهِ الْكَيْلَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ali Bin Al Hakam, from Al A’ala Bin Razeyn, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘I passed by the man so he presented the foodstuff to me, and he was saying, ‘You have come across the foodstuff what you needed’. So I am saying to him, ‘Bring it out, I shall give you such and such a price per Kurra (a unit of measurement). So when you bring it out, I shall look at it, so it is was as per my requirement, I shall take it, and if does not happen to be from my requirements, I shall leave it’. He<sup>asws</sup> said: ‘This is haggling. There is no problem with it’. ",
            "I said, ‘So I say to him, ‘Isolate fifty Kurra from it’, or less or more by his measurement, so it is (sometimes) more, and (sometimes) less, and more often it is more. Fo whom it is?’ He<sup>asws</sup> said: ‘It is for you’. ",
            "Then he<sup>asws</sup> said: ‘I<sup>asws</sup> sent Mo’tab or Sallama, so they buy for some foodstuff for us<sup>asws</sup>, and it came to me more upon us<sup>asws</sup> with two Dinars. So we fed our<sup>asws</sup> families by it with a measure which we<sup>asws</sup> recognised’. So I said to him<sup>asws</sup>, ‘Did you<sup>asws</sup> know its owner?’ He<sup>asws</sup> said: ‘Yes. We<sup>asws</sup> returned (the extra from) it to him’. ",
            "So I said, ‘May Allah<sup>saww</sup> have Mercy on you<sup>asws</sup>! You<sup>asws</sup> are issuing a Verdict to me that the increase is for me, but you<sup>asws</sup> have returned (the extra from) it to the seller because you<sup>asws</sup> knew that it belongs to him’ He<sup>asws</sup> said: ‘Yes. But rather, that is an error of the people, because that which we<sup>asws</sup> bought with, rather that was with eight Dirhams, or nine’. Then he<sup>asws</sup> said: ‘however, in our<sup>asws</sup> it was measured again (so it was confirmed that there came extra from the seller)’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Ali ibn al-Hakam from al-‘Ala’ ibn Razin who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, that I may pass by a man and he speaks to me about food and says, ‘You have found the kind of foodstuff that you need.’ I then ask him to show me and I will give such and such amount of profit for each kur, but when he shows it to me, I look at it and if I need I take it, if not I leave it. He (the Imam) said, ‘It is bargaining and it is not harmful.’ I then said that I then ask him to keep aside for me fifty kur or less or more according to his measurement then it comes extra or less and mostly it is extra. To whom the extra belongs? He (the Imam) said, ‘It belongs to you.’ He (the Imam) then said, ‘I once sent Mu‘attib or Salam who bought food for us and it came extra for two dinars and our family used it by the measurement that we knew.’ I then asked, ‘Did you find out who the seller was?’ He (the Imam) replied, ‘Yes, and we returned the extra to him.’ I then said, ‘May Allah be kind to you. In my case your fatwa is that the extra belongs to me and yourself return it to the seller because you knew that it belongs to him.’ He (the Imam) said, ‘Yes; it is a mistake that people make because what we bought was for eight or nine dirham.’ He (the Imam) then said, ‘In our case we, however, measured it again.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/187)"
        ],
        "index": 8770,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:76:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ حَنَانٍ قَالَ كُنْتُ جَالِساً عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لَهُ مُعَمَّرٌ الزَّيَّاتُ إِنَّا نَشْتَرِي الزَّيْتَ فِي زِقَاقِهِ فَيُحْسَبُ لَنَا نُقْصَانٌ فِيهِ لِمَكَانِ الزِّقَاقِ فَقَالَ إِنْ كَانَ يَزِيدُ وَ يَنْقُصُ فَلَا بَأْسَ وَ إِنْ كَانَ يَزِيدُ وَ لَا يَنْقُصُ فَلَا تَقْرَبْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Hanaan who said, ",
            "‘I was seated in the presence of Abu Abdullah<sup>asws</sup>, so Moamar the oil merchant said to him<sup>asws</sup>, ‘We buy the oil in its alley way, so he measures it out for us with a deficiency in it due to the placing of the alleyway’. So he<sup>asws</sup> said: ‘If it was (sometimes) excess and deficient, so there is no problem; and if it was excess and not (never) deficient, so do not go near it’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ‘Isma’il from Hanan who has said the following: “Once I was sitting in the presence of abu ‘Abd Allah, ‘Alayhi al-Salam, when Mu’ammar al-Zayyat said, ‘We buy oil in Ziqaq (a certain container), they compensate it for deficit because of Ziqaq. He (the Imam) said, ‘If it comes extra as well as in deficit, it is not harmful but if it comes extra and no deficit, then you must not go close to it.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:76",
  "kind": "verse_list"
}