{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 89"
        },
        "path": "/books/al-kafi:5:2:89",
        "titles": {
          "ar": "باب الْعِينَةِ",
          "en": "Chapter 88 – The buy-back"
        }
      }
    ],
    "index": 1301,
    "local_index": 89,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 90"
        },
        "path": "/books/al-kafi:5:2:90",
        "titles": {
          "ar": "باب الشَّرْطَيْنِ فِي الْبَيْعِ ",
          "en": "Chapter 89 – The two stipulations regarding the sale"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 88"
        },
        "path": "/books/al-kafi:5:2:88",
        "titles": {
          "ar": "باب فَضْلِ الشَّيْ‏ءِ الْجَيِّدِ الَّذِي يُبَاعُ ",
          "en": "Chapter 87 – Preference of the good quality of that which is sold"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:5:2",
        "titles": {
          "ar": "كتاب الْمَعِيشَةِ",
          "en": "THE BOOK OF SUBSISTENCE"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:2:89",
    "titles": {
      "ar": "باب الْعِينَةِ",
      "en": "Chapter 88 – The buy-back"
    },
    "verse_count": 12,
    "verse_start_index": 8858,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/223)"
        ],
        "index": 8859,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3410",
              "text": "حَفْصِ بْنِ سُوقَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4205",
              "text": "الْحُسَيْنِ بْنِ الْمُنْذِرِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ سُوقَةَ عَنِ الْحُسَيْنِ بْنِ الْمُنْذِرِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:89:1",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) يَجِيئُنِي الرَّجُلُ فَيَطْلُبُ الْعِينَةَ فَأَشْتَرِي لَهُ الْمَتَاعَ مُرَابَحَةً ثُمَّ أَبِيعُهُ إِيَّاهُ ثُمَّ أَشْتَرِيهِ مِنْهُ مَكَانِي قَالَ فَقَالَ إِذَا كَانَ بِالْخِيَارِ إِنْ شَاءَ بَاعَ وَ إِنْ شَاءَ لَمْ يَبِعْ وَ كُنْتَ أَنْتَ أَيْضاً بِالْخِيَارِ إِنْ شِئْتَ اشْتَرَيْتَ وَ إِنْ شِئْتَ لَمْ تَشْتَرِ فَلَا بَأْسَ ",
          "قَالَ قُلْتُ فَإِنَّ أَهْلَ الْمَسْجِدِ يَزْعُمُونَ أَنَّ هَذَا فَاسِدٌ وَ يَقُولُونَ إِنْ جَاءَ بِهِ بَعْدَ أَشْهُرٍ صَلَحَ فَقَالَ إِنَّ هَذَا تَقْدِيمٌ وَ تَأْخِيرٌ فَلَا بَأْسَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ibn Abu Umeyr, from Hafs Bin Sowqat, from Al Husayn Bin Al Munzar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The man comes over to me seeking the buy-back (الْعِينَةَ). So I buy the goods (from someone else) for him with a profit, then I sell these to him, then I buy these back from him in my place (instantly – takin back the returned goods)’. So he<sup>asws</sup> said: ‘When he was with the choice, if he so desires to he sells or if he so desires to he does not sell, and you as well were with the choice, if you so desire to you buy, and if you so desire to you do not buy, so there is no problem’. ",
            "He (the narrator) said, ‘I said, ‘But the people of the Masjid are alleging that this is invalid, and they are saying that if he comes with it after some months, it would be correct’. So he<sup>asws</sup> said: ‘This is preceding and delaying, so there is no problem with it’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn abu ‘Umayr from Hafs ibn Suwqah from al- Husayn ibn al-Mundhir who has said the following: “I once said to abu ‘ Abd Allah, ‘Alayhi al-Salam, ‘A man comes to me and asks for ‘Aynah. I then buy for him the merchandise in the manner of Murabahah (capital plus profit) then sell it to him, then buy it from him at the same place. He (the Imam) said, Tf he has the choice to sell if he likes or not to sell and you also have the choice to buy if you like or do not buy if you do not like, it is not unlawful.’ I then said, ‘People of the Masjid think it is not valid. They say, “If he brings it after few months it is valid.’” He (the Imam) said, ‘This is making early what is later and late what is early and it is not unlawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/223)"
        ],
        "index": 8860,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/589",
              "text": "أَحْمَدُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/150",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2420",
              "text": "إِسْمَاعِيلَ بْنِ عَبْدِ الْخَالِقِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ إِسْمَاعِيلَ بْنِ عَبْدِ الْخَالِقِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:89:2",
        "text": [
          " سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنِ الْعِينَةِ وَ قُلْتُ إِنَّ عَامَّةَ تُجَّارِنَا الْيَوْمَ يُعْطُونَ الْعِينَةَ فَأَقُصُّ عَلَيْكَ كَيْفَ تُعْمَلُ قَالَ هَاتِ قُلْتُ يَأْتِينَا الرَّجُلُ الْمُسَاوِمُ يُرِيدُ الْمَالَ فَيُسَاوِمُنَا وَ لَيْسَ عِنْدَنَا مَتَاعٌ فَيَقُولُ أُرْبِحُكَ دَهْ يَازْدَهْ وَ أَقُولُ أَنَا دَهْ دَوَازْدَهْ فَلَا نَزَالُ نَتَرَاوَضُ حَتَّى نَتَرَاوَضَ عَلَى أَمْرٍ ",
          "فَإِذَا فَرَغْنَا قُلْتُ لَهُ أَيُّ مَتَاعٍ أَحَبُّ إِلَيْكَ أَنْ أَشْتَرِيَ لَكَ فَيَقُولُ الْحَرِيرُ لِأَنَّهُ لَا نَجِدُ شَيْئاً أَقَلَّ وَضِيعَةً مِنْهُ فَأَذْهَبُ وَ قَدْ قَاوَلْتُهُ مِنْ غَيْرِ مُبَايَعَةٍ فَقَالَ أَ لَيْسَ إِنْ شِئْتَ لَمْ تُعْطِهِ وَ إِنْ شَاءَ لَمْ يَأْخُذْ مِنْكَ قُلْتُ بَلَى",
          "قَالَ فَأَذْهَبُ فَأَشْتَرِي لَهُ ذَلِكَ الْحَرِيرَ وَ أُمَاكِسُ بِقَدْرِ جُهْدِي ثُمَّ أَجِي‏ءُ بِهِ إِلَى بَيْتِي فَأُبَايِعُهُ فَرُبَّمَا ازْدَدْتُ عَلَيْهِ الْقَلِيلَ عَلَى الْمُقَاوَلَةِ وَ رُبَّمَا أَعْطَيْتُهُ عَلَى مَا قَاوَلْتُهُ وَ رُبَّمَا تَعَاسَرْنَا فَلَمْ يَكُنْ شَيْ‏ءٌ فَإِذَا اشْتَرَى مِنِّي لَمْ يَجِدْ أَحَداً أَغْلَى بِهِ مِنَ الَّذِي اشْتَرَيْتُهُ مِنْهُ فَيَبِيعُهُ مِنْهُ فَيَجِي‏ءُ ذَلِكَ فَيَأْخُذُ الدَّرَاهِمَ فَيَدْفَعُهَا إِلَيْهِ وَ رُبَّمَا جَاءَ لِيُحِيلَهُ عَلَيَّ فَقَالَ لَا تَدْفَعْهَا إِلَّا إِلَى صَاحِبِ الْحَرِيرِ",
          "قُلْتُ وَ رُبَّمَا لَمْ يَتَّفِقْ بَيْنِي وَ بَيْنَهُ الْبَيْعُ بِهِ وَ أَطْلُبُ إِلَيْهِ فَيَقْبَلُهُ مِنِّي فَقَالَ أَ وَ لَيْسَ إِنْ شَاءَ لَمْ يَفْعَلْ وَ إِنْ شِئْتَ أَنْتَ لَمْ تَرُدَّ قُلْتُ بَلَى لَوْ أَنَّهُ هَلَكَ فَمِنْ مَالِي قَالَ لَا بَأْسَ بِهَذَا إِذَا أَنْتَ لَمْ تَعْدُ هَذَا فَلَا بَأْسَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ismail Bin Abdul Khaliq who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about the buy-back (الْعِينَةَ) and I said, ‘The merchants these days are giving the buy-back (الْعِينَةَ)’. So I can relate to you how we deal’. He<sup>asws</sup> said: ‘Give it (explanation)’. I said, ‘The haggling man comes over to us wanting the goods, so we haggle and there are no goods with us. So he is saying, ‘I will profit you ten/eleven (Persian)’, and I am saying, ‘And I, ten/eleven (as well)’. So we do not cease to bargain until we agree upon one bargain.",
            "So when we are free, I say, ‘Which goods are beloved to you that I should buy for you?’ So he is saying, ‘The silk, because we cannot find anything less in wastage than it’. So I go, having given my word without having sold’. So he<sup>asws</sup> said: ‘Is it not that if you so desire to, you do not give it, and if he so desires to, he does not take from you?’ I said, ‘Yes’. ",
            "He (the narrator) said, ‘So I go and I buy that silk for him, and I bargain in accordance to my striving. Then I come over with it to my house, and I sell it to him. So, sometimes I increase it (the price) a little bit upon him over the oral contract, and sometimes I give it to him upon what I had orally contracted, and sometimes we get into difficulties, so nothing happens. So when he buys from me, and he does not find anyone more expensive with it than that the one whom I had bought it from, so he sells it to him. So he comes and takes the Dirhams, and he hands it over to him; and sometimes he comes in order to assign it upon me’. So he<sup>asws</sup> said: ‘You cannot hand it over to anyone except the owner of the silk’. ",
            "I said, ‘And sometimes there is no concordance between me and him to sell with, and I seek to him, and he accepts from me’. So he<sup>asws</sup> said: ‘Or is it not that if he so desires to he does not do it, and if you so desire to, you do not return it?’ I said, ‘Yes. If he were to dies, so it would be from my wealth’. He<sup>asws</sup> said: ‘There is no problem with this. When you do not exceed this, so there is no problem with it’."
          ],
          "en.sarwar": [
            "2. Ahmad ibn Muhammad has narrated from Ali ibn al-Hakam from ‘Isma’il ibn ‘Abd al-Khaliq who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about ‘Aynah saying, ‘Our merchants in general these days provide ‘Aynah. I like to explain how it is done. He (the Imam) said, ‘Go on and explain.’ I said, ‘A man comes who works in Musaxvamah (fixed price regardless of capital) who wants merchandise on the basis of Musawamah but we do not have any goods and he says, “I give you a profit of dah yazdah” and I say “I give dah dawazdah.” He continues bargaining and we also do so. When we complete I say to him, “Which merchandise you want me to buy for you?” He says, “I like silk because we do not find anything else less depreciating than silk.” I agree and form a contract without selling.’ He (the Imam) said, ‘Is it possible that if you did not like you can refuse to give him and if he does not like he does not take from you?’ I replied, ‘Yes, it is possible. I then go and buy for him that silk and then bargain as much as I can and then I come to my home then sell it to him perhaps with an increase a little more than what is contracted, or perhaps give him for what is contracted, and perhaps we become difficult then nothing happens. ‘Then if he buys from me he cannot find anyone else asking higher price than the one, from whom I bought it, to sell to him. He comes and takes the dirhams and gives it to him or perhaps he comes with an assignment on me.’ He (the Imam) said, ‘You must not give it to anyone else beside the owner of silk.’ I then said, ‘Perhaps the sale does not take place between us. I ask him and he agrees.’ He (the Imam) said, ‘Is it possible that if he likes, he does not do so and if you want you do not return?’ I replied, ‘Yes, it is possible. If he dies it is from my assets.’ He (the Imam) said, ‘It is lawful; if you do not violate the condition, then it is not unlawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/225)"
        ],
        "index": 8861,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/150",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/27",
              "text": "سَيْفِ بْنِ عَمِيرَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/191",
              "text": "مَنْصُورِ بْنِ حَازِمٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ مَنْصُورِ بْنِ حَازِمٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:89:3",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام) عَنْ رَجُلٍ طَلَبَ مِنْ رَجُلٍ ثَوْباً بِعِينَةٍ فَقَالَ لَيْسَ عِنْدِي وَ هَذِهِ دَرَاهِمُ فَخُذْهَا فَاشْتَرِ بِهَا فَأَخَذَهَا وَ اشْتَرَى ثَوْباً كَمَا يُرِيدُ ثُمَّ جَاءَ بِهِ لِيَشْتَرِيَهُ مِنْهُ فَقَالَ أَ لَيْسَ إِنْ ذَهَبَ الثَّوْبُ فَمِنْ مَالِ الَّذِي أَعْطَاهُ الدَّرَاهِمَ قُلْتُ بَلَى فَقَالَ إِنْ شَاءَ اشْتَرَى وَ إِنْ شَاءَ لَمْ يَشْتَرِهِ قَالَ فَقَالَ لَا بَأْسَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Sayf Bin Umeyra, from Mansour Bin Hazim who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who seeks a cloth from a man, with a buy-back (بِعِينَةٍ). So he says, ‘It is not with me, and these are Dirhams, so take these and buy with these’. So he takes them and buys some cloth just as he wanted, then comes over with it in order for him to buy from it’. So he<sup>asws</sup> said: ‘Is it not that if the cloth were to go away (deteriorate), so it would be from the wealth of the one who gave him the Dirhams?’ I said, ‘Yes’. So he<sup>asws</sup> said: ‘If he so desires to he buys, and if he so desires to, he does not buy, then there is no problem with it’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Sayf ibn ‘Amirah from Mansur ibn Hazim who has said the following: “This is concerning my question before abu ‘ Abd Allah, ‘Alayhi al-Salam, about the case of a man who asks another man for a cloth on the basis of ‘Aynah and he says, ‘I do not have it but take these dirhams and buy the cloth.’ He takes the dirhams and buys a cloth as he wants, then comes to him so that he buys it from him. He (the Imam) said, Ts it the case that if the cloth is lost it is from the assets of the one who gives dirham?’ I replied, ‘Yes, that is the case.’ He (the Imam) asked, ‘If it is possible that if he wants he buys it, if he does not want he does not buy, then it is not unlawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/225)"
        ],
        "index": 8862,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/589",
              "text": "أَحْمَدُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/150",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/27",
              "text": "سَيْفِ بْنِ عَمِيرَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/697",
              "text": "أَبِي بَكْرٍ الْحَضْرَمِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:89:4",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) رَجُلٌ يُعَيَّنُ ثُمَّ حَلَّ دَيْنُهُ فَلَمْ يَجِدْ مَا يَقْضِي أَ يَتَعَيَّنُ مِنْ صَاحِبِهِ الَّذِي عَيَّنَهُ وَ يَقْضِيهِ قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Sayf Bin Umeyra, from Abu Bakr Al Hazramy who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘A man contracted a buy-back deal (يُعَيَّنُ), then his debt was due, but he could not find what he could fulfil it with, can he do (another) buy-back from his companion whom he had contracted the (first) buy-back with, and fulfil it (the first deal)?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            "4. Ahmad ibn Muhammad has narrated from Ali ibn al-Hakam from Sayf ibn ‘ Amirah from abu Bakr af-Hadramiy who has said the foifowing: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, ‘A man who is engaged in an al- ’Aynah deal and the payment date has become due but he cannot find anything to pay back his debt; if he can arrange another al- ’Aynah with the same creditor again.’ He (the Imam) said, ‘Yes, he can do so again.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/226)"
        ],
        "index": 8863,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/589",
              "text": "أَحْمَدُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/604",
              "text": "عَلِيِّ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/697",
              "text": "أَبِي بَكْرٍ الْحَضْرَمِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَلِيِّ بْنِ إِسْمَاعِيلَ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:89:5",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) يَكُونُ لِي عَلَى الرَّجُلِ الدَّرَاهِمُ فَيَقُولُ لِي بِعْنِي شَيْئاً أَقْضِيكَ فَأَبِيعُهُ الْمَتَاعَ ثُمَّ أَشْتَرِيهِ مِنْهُ وَ أَقْبِضُ مَالِي قَالَ لَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Ali Bin Ismail, from Abu Bakr Al Hazramy who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘There happens to be some Dirhams for me upon the man, so he is saying to me, ‘Sell me something to pay you back’. So I sell the goods to him, then buy these back from him, and I take possession of my wealth’. He<sup>asws</sup> said: ‘There is no problem’."
          ],
          "en.sarwar": [
            "5. Ahmad ibn Muhammad has narrated from ibn abu ‘Umayr from Aii ibn ‘Isma’ii abu Bakr al-Hadramiy who has said the foliowing: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘A man owes me a certain amount of dirhams and he says, “Sell to me certain goods so I can pay what I owe to you.” I then sell to him certain goods, then buy it from him and take what he owes me.’ He (the Imam) said, ‘It is not unlawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/226)"
        ],
        "index": 8864,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/896",
              "text": "حَنَانِ بْنِ سَدِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ حَنَانِ بْنِ سَدِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:89:6",
        "text": [
          " كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لَهُ جَعْفَرُ بْنُ حَنَانٍ مَا تَقُولُ فِي الْعِينَةِ فِي رَجُلٍ يُبَايِعُ رَجُلًا فَيَقُولُ لَهُ أُبَايِعُكَ بِدَهْ دَوَازْدَهْ وَ بِدَهْ يَازْدَهْ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) هَذَا فَاسِدٌ وَ لَكِنْ يَقُولُ أَرْبَحُ عَلَيْكَ فِي جَمِيعِ الدَّرَاهِمِ كَذَا وَ كَذَا وَ يُسَاوِمُهُ عَلَى هَذَا فَلَيْسَ بِهِ بَأْسٌ ",
          "وَ قَالَ أُسَاوِمُهُ وَ لَيْسَ عِنْدِي مَتَاعٌ قَالَ لَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Hanan Bin Sadeyr who said, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup>, so Ja’far Bin Hannan said to him<sup>asws</sup>, ‘What are you<sup>asws</sup> saying regarding the buy back (الْعِينَةِ) regarding a man who sells to a man so he is saying to him, ‘I sell to you with ten, twelve (in Persian), and with ten, eleven (in Persian)’. So Abu Abdullah<sup>asws</sup> said: ‘This is invalid, but he should be saying, ‘I profit upon you regading the entirety of the Dirham, such and such, and he should fix it upon this, so there would be no problem with it’. ",
            "And he (the narrator) said: ‘I fixt it and there are no goods with me?’ He<sup>asws</sup> said: ‘There is no problem’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Hanan ibn Sadir who has said the following: “Once I was with abu ‘Abd Allah, ‘Alayhi al-Salam, when Ja’far ibn Hanan asked him (the Imam), ‘What do you say about al- ’Aynah in the case of a man who sells certain goods to a man and says, “I sell to you bah dah dawazdah and bah dahyazdahT” Abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘This is not valid. He must, however, say, “For all dirhams I give you so and so amount of dirham profit in the form of Musawamah (fixed price regardless of capital) in this deal;” then it is not unlawful.’ He then asked, ‘Can I make a deal in the form of Musawamah (fixed price regardless of capital) and I do not have any assets?’ He (the Imam) said, ‘It is not unlawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/226)"
        ],
        "index": 8865,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/206",
              "text": "عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:89:7",
        "text": [
          " سَأَلْتُهُ عَنْ رَجُلٍ لِي عَلَيْهِ مَالٌ وَ هُوَ مُعْسِرٌ فَأَشْتَرِي بَيْعاً مِنْ رَجُلٍ إِلَى أَجَلٍ عَلَى أَنْ أَضْمَنَ ذَلِكَ عَنْهُ لِلرَّجُلِ وَ يَقْضِيَنِي الَّذِي عَلَيْهِ قَالَ لَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man upon whom there is some wealth for me, and he is insolvent. So I buy an item for sale from a man to a specified term upon a stipulation that I guarantee that from him for the man, and he fulfils me that which is upon him?’ He<sup>asws</sup> said: ‘There is no problem’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from ‘Abd Allah ibn al-Mughirah from ‘Abd Allah ibn Sinan who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who owes a certain amount of debts and he is a Mu‘sir (unable to pay). Can I arrange for him to buy something from a man for an appointed time and guarantee in his favor so he can pay his debts (with the item just purchased for him) to me and then pay back what he owes? He (the Imam) said, ‘It is lawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/227)"
        ],
        "index": 8866,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/576",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/173",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/884",
              "text": "هَارُونَ بْنِ خَارِجَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ هَارُونَ بْنِ خَارِجَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:89:8",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) عَيَّنْتُ رَجُلًا عِينَةً فَقُلْتُ لَهُ اقْضِنِي فَقَالَ لَيْسَ عِنْدِي فَعَيِّنِّي حَتَّى أَقْضِيَكَ قَالَ عَيِّنْهُ حَتَّى يَقْضِيَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Haroun Bin Kharjat who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I do a buy-back deal (عَيَّنْتُ) with a man, so I say to him, ‘Pay me’. So he says, ‘There is nothing with me, so keep on doing buy-back deal with me (rolling it over) until I pay you’. He<sup>asws</sup> said: ‘Keep buying back (عَيِّنْهُ) with him until he pays you’."
          ],
          "en.sarwar": [
            "8. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from Harun ibn Kharijah who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘I made an al-’ Aynah deal with a man. I then asked him to pay back what he owes because of the deal. He replied, “I do not have anything to pay you back unless you arrange another al-’ Aynah so I can pay you back.’” He (the Imam) said, ‘You can arrange another al- ’Aynah for him so he can pay you back.’” "
          ]
        }
      },
      {
        "index": 8867,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4206",
              "text": "عَلِيِّ بْنِ الْحَدِيدِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/933",
              "text": "مُحَمَّدِ بْنِ إِسْحَاقَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَدِيدِ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:89:9",
        "text": [
          " قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) إِنَّ سَلْسَبِيلَ طَلَبَتْ مِنِّي مِائَةَ أَلْفِ دِرْهَمٍ عَلَى أَنْ تُرْبِحَنِي عَشَرَةَ آلَافٍ فَأَقْرَضْتُهُا تِسْعِينَ أَلْفاً وَ أَبِيعُهَا ثَوْباً وَشِيّاً تُقَوَّمُ عَلَيَّ بِأَلْفِ دِرْهَمٍ بِعَشَرَةِ آلَافِ دِرْهَمٍ قَالَ لَا بَأْسَ ",
          "وَ فِي رِوَايَةٍ أُخْرَى لَا بَأْسَ بِهِ أَعْطِهَا مِائَةَ أَلْفٍ وَ بِعْهَا الثَّوْبَ بِعَشَرَةِ آلَافٍ وَ اكْتُبْ عَلَيْهَا كِتَابَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hadeed, from Muhammad Bin Is’haq Bin Ammar who said, ",
            "‘I said to Abu Al-Hassan<sup>asws</sup>, ‘Salsabeel sought one hundred thousand Dirhams from me upon a stipulation that she would profit me ten thousand Dirham. So I left her ninety thousand, and I sold her a cloth and something the value of which stood upon me with a thousand Dirhams, for ten thousand Dirhams’. He<sup>asws</sup> said: ‘There is no problem’. ",
            "And in another report, ‘(He<sup>asws</sup> said): ‘There is no problem with giving her one hundred thousand and sell her the cloth for ten thousand, and write upon her with two written agreements’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn Hadid from Muhammad ibn Ishaq ibn ‘Ammar who has said the following: “I once said to abu al-Hassan, ‘Alayhi al-Salam, ‘Salsabil has asked me for a hundred thousand dirham which she will pay back with a ten thousand dirham profit. I gave her ninety thousand dirham loan with the sale of a cloth and something else worth a thousand dirham for ten thousand dirham (she now owes a total of one hundred thousand dirham).’ He (the Imam) said, ’It is not unlawful.’ In another Hadith it is said, ‘It is not unlawful if you give her a hundred thousand and sell to her a cloth for ten thousand and write two contracts.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/228)"
        ],
        "index": 8868,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/576",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2472",
              "text": "الْحَسَنِ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4207",
              "text": "عَمِّهِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/933",
              "text": "مُحَمَّدِ بْنِ إِسْحَاقَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ عَنْ عَمِّهِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:89:10",
        "text": [
          " قُلْتُ لِلرِّضَا ( عليه السلام ) الرَّجُلُ يَكُونُ لَهُ الْمَالُ قَدْ حَلَّ عَلَى صَاحِبِهِ يَبِيعُهُ لُؤْلُؤَةً تَسْوَى مِائَةَ دِرْهَمٍ بِأَلْفِ دِرْهَمٍ وَ يُؤَخِّرُ عَنْهُ الْمَالَ إِلَى وَقْتٍ قَالَ لَا بَأْسَ قَدْ أَمَرَنِي أَبِي فَفَعَلْتُ ذَلِكَ ",
          "وَ زَعَمَ أَنَّهُ سَأَلَ أَبَا الْحَسَنِ ( عليه السلام ) عَنْهَا فَقَالَ لَهُ مِثْلَ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Al Hassan Bin Ali Bin Abdullah, from his uncle Muhammad Bin Abdullah, from Muhammad Bin Is’haq Bin Ammar who said, ",
            "‘I said to Al-Reza<sup>asws</sup>, ‘The man who happens to have the wealth for him which had become due upon his companions. Can he sell him a pearl at a fixed price of one hundred Dirham for a thousand Dirhams, and he delays the wealth from him to a specified time?’ He<sup>asws</sup> said: ‘There is no problem. My<sup>asws</sup> father<sup>asws</sup> had instructed me<sup>asws</sup> such, so I<sup>asws</sup> did that’. ",
            "And he (the narrator) claimed that he had asked Abu Al-Hassan<sup>asws</sup> about it, so he<sup>asws</sup> said to him similar to that’."
          ],
          "en.sarwar": [
            "10. Abu Ali al-Ash’ariy has narrated from al-Hassan ibn ‘Abd Allah from his uncle, Muhammad ibn ‘Abd Allah from Muhammad ibn Ishaq ibn ‘Ammar who has said the following: “I once asked al-Rida’, ‘Alayhi al-Salam, about the case of a man to whom someone owes a certain amount of goods and payback time becomes due. His party sells to him a pearl worth a hundred dirham for a thousand dirham and extends the payback time to another appointed time. He (the Imam) said, ‘It is not unlawful. My father commanded me to do so and did such a deal.’ He (the narrator) thinks that he had asked abu al-Hassan, ‘Alayhi al-Salam, about it and he (the Imam) had given a similar answer.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/228)"
        ],
        "index": 8869,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/933",
              "text": "مُحَمَّدِ بْنِ إِسْحَاقَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:89:11",
        "text": [
          " قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) يَكُونُ لِي عَلَى الرَّجُلِ دَرَاهِمُ فَيَقُولُ أَخِّرْنِي بِهَا وَ أَنَا أُرْبِحُكَ فَأَبِيعُهُ جُبَّةً تُقَوَّمُ عَلَيَّ بِأَلْفِ دِرْهَمٍ بِعَشَرَةِ آلَافِ دِرْهَمٍ أَوْ قَالَ بِعِشْرِينَ أَلْفاً وَ أُؤَخِّرُهُ بِالْمَالِ قَالَ لَا بَأْسَ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Muhammad Bin Is’haq Bin Ammar who said, ",
            "‘I said to Abu Al-Hassan<sup>asws</sup>, ‘There happens to be some Dirhams for me upon the man, so he is saying, ‘Delay it (payment) with it and I shall profit you. So I sold him a garment which stood upon me with a thousand Dirhms, for ten thousand Dirhams’, or said, ‘for twenty thousand Dirhams’, and I delay the wealth for him’. He<sup>asws</sup> said: ‘There is no problem’."
          ],
          "en.sarwar": [
            "11. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn abu ‘Umayr from Muhammad ibn Ishaq ibn ‘Ammar who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about the case of a man who owes me a certain amount of dirham and says to me, ‘Extend the payback time and I will give you profit’. I then sell to him a gown worth a thousand dirham for ten thousand dirhams - or that he said, twenty thousand dirhams - and extend the payback time. He (the Imam) said, ‘It is not unlawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/228)"
        ],
        "index": 8870,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/150",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2596",
              "text": "عَبْدِ الْمَلِكِ بْنِ عُتْبَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَبْدِ الْمَلِكِ بْنِ عُتْبَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:2:89:12",
        "text": [
          " سَأَلْتُهُ عَنِ الرَّجُلِ أُرِيدُ أَنْ أُعَيِّنَهُ الْمَالَ وَ يَكُونُ لِي عَلَيْهِ مَالٌ قَبْلَ ذَلِكَ فَيَطْلُبُ مِنِّي مَالًا أَزِيدُهُ عَلَى مَالِيَ الَّذِي لِي عَلَيْهِ أَ يَسْتَقِيمُ أَنْ أَزِيدَهُ مَالًا وَ أَبِيعَهُ لُؤْلُؤَةً تُسَاوِي مِائَةَ دِرْهَمٍ بِأَلْفِ دِرْهَمٍ فَأَقُولَ أَبِيعُكَ هَذِهِ اللُّؤْلُؤَةَ بِأَلْفِ دِرْهَمٍ عَلَى أَنْ أُؤَخِّرَكَ بِثَمَنِهَا وَ بِمَالِي عَلَيْكَ كَذَا وَ كَذَا شَهْراً قَالَ لَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Abdul Malik Bin Utba who said, ",
            "‘I asked him<sup>asws</sup> about the man wanting that I do a buy-back deal (أُعَيِّنَهُ) with him for the wealth, and there happened to be some wealth for me upon him before than. So he sought some (more) wealth from me that I should increase my wealth upon him which was (already) for me upon him. Would it be correct if I were to increase the wealth and I sell him a pearl of one hundred Dirhams for a thousand Dirhams so I am saying, ‘I hereby sell you this pearl for a thousand Dirhams upon a stipulation that I delay you with its price and with my such and such wealth which is upon you, for a month’. He<sup>asws</sup> said: ‘There is no problem’."
          ],
          "en.sarwar": [
            "12. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from ‘Abd al-Malik ibn ‘Utbah who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about the case of a man with whom I like to arrange an al-’Aynah. He already owes me a certain amount of goods. He asks me for additional goods. Is it right to provide him additional goods and sell to him a pearl worth a hundred dirham for a thousand dirham and I say, ‘I sell to you this pearl for a thousand dirham so I can extend the payback time for this and what you already owe to me up to so and so many months.’ He (the Imam) said, ‘It is not unlawful.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:2:89",
  "kind": "verse_list"
}