{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:5:2", "titles": {"ar": "كتاب الْمَعِيشَةِ", "en": "THE BOOK OF SUBSISTENCE"}}, {"indexed_titles": {"en": "Chapter 92"}, "path": "/books/al-kafi:5:2:92", "titles": {"ar": "باب شِرَاءِ الرَّقِيقِ ", "en": "Chapter 92 – Buying the slave"}}], "index": 1303, "local_index": 92, "part_type": "Chapter", "path": "/books/al-kafi:5:2:92", "titles": {"ar": "باب شِرَاءِ الرَّقِيقِ ", "en": "Chapter 92 – Buying the slave"}, "verse_count": 18, "verse_start_index": 8877, "verses": [{"index": 8878, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:2:92:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ مُوسَى ( عليه السلام ) عَنْ رَجُلٍ بَيْنِي وَ بَيْنَهُ قَرَابَةٌ مَاتَ وَ تَرَكَ أَوْلَاداً صِغَاراً وَ تَرَكَ مَمَالِيكَ غِلْمَاناً وَ جَوَارِيَ وَ لَمْ يُوصِ فَمَا تَرَى فِيمَنْ يَشْتَرِي مِنْهُمُ الْجَارِيَةَ يَتَّخِذُهَا أُمَّ وَلَدٍ وَ مَا تَرَى فِي بَيْعِهِمْ قَالَ فَقَالَ إِنْ كَانَ لَهُمْ وَلِيٌّ يَقُومُ بِأَمْرِهِمْ بَاعَ عَلَيْهِمْ وَ نَظَرَ لَهُمْ وَ كَانَ مَأْجُوراً فِيهِمْ\nقُلْتُ فَمَا تَرَى فِيمَنْ يَشْتَرِي مِنْهُمُ الْجَارِيَةَ فَيَتَّخِذُهَا أُمَّ وَلَدٍ قَالَ لَا بَأْسَ بِذَلِكَ إِذَا بَاعَ عَلَيْهِمُ الْقَيِّمُ لَهُمُ النَّاظِرُ لَهُمْ فِيمَا يُصْلِحُهُمْ فَلَيْسَ لَهُمْ أَنْ يَرْجِعُوا فِيمَا صَنَعَ الْقَيِّمُ لَهُمُ  النَّاظِرُ [لَهُمْ] فِيمَا يُصْلِحُهُمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companion, from Sahl Bin Ziyad, from Ibn Mahboub, from Ibn Ra’ib who said, \n‘I asked Abu Al-Hassan Musa<sup>asws</sup> about a man who was a close relative, died and left young children, and left owned slave boys and girls, and he had not bequeathed. So what is your<sup>asws</sup> view regarding the one who buys the slave girls from them. Can he take her as a mother for (his) children, and what is your<sup>asws</sup> view regarding selling them?’ He (the narrator) said, ‘So he<sup>asws</sup> said: ‘If there was a guardian for them who would stand with their affairs, selling upon them, and looking out for them, and he would be Recompensed with regards to them’.\nI said, ‘So what is your view regarding the one who buys the slave girl from them, so he takes her as a mother of a child (of his)’. He<sup>asws</sup> said: ‘There is no problem with that. When the custodian sells upon them being considerate for them regarding what is correct for them, so it is not for them that they should retract regarding what the custodian has done for them, having been considerate for them regarding what is correct for them’."}]}, {"index": 8879, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:2:92:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ قَالَ مَاتَ رَجُلٌ مِنْ أَصْحَابِنَا وَ لَمْ يُوصِ فَرُفِعَ أَمْرُهُ إِلَى قَاضِي الْكُوفَةِ فَصَيَّرَ عَبْدَ الْحَمِيدِ الْقَيِّمَ بِمَالِهِ وَ كَانَ الرَّجُلُ خَلَّفَ وَرَثَةً صِغَاراً وَ مَتَاعاً وَ جَوَارِيَ فَبَاعَ عَبْدُ الْحَمِيدِ الْمَتَاعَ فَلَمَّا أَرَادَ بَيْعَ الْجَوَارِي ضَعُفَ قَلْبُهُ فِي بَيْعِهِنَّ إِذْ لَمْ يَكُنِ الْمَيِّتُ صَيَّرَ إِلَيْهِ الْوَصِيَّةَ وَ كَانَ قِيَامُهُ فِيهَا بِأَمْرِ الْقَاضِي لِأَنَّهُنَّ فُرُوجٌ \nقَالَ فَذَكَرْتُ ذَلِكَ لِأَبِي جَعْفَرٍ ( عليه السلام ) وَ قُلْتُ لَهُ يَمُوتُ الرَّجُلُ مِنْ أَصْحَابِنَا وَ لَا يُوصِي إِلَى أَحَدٍ وَ يُخَلِّفُ جَوَارِيَ فَيُقِيمُ الْقَاضِي رَجُلًا مِنَّا لِيَبِيعَهُنَّ أَوْ قَالَ يَقُومُ بِذَلِكَ رَجُلٌ مِنَّا فَيَضْعُفُ قَلْبُهُ لِأَنَّهُنَّ فُرُوجٌ فَمَا تَرَى فِي ذَلِكَ قَالَ فَقَالَ إِذَا كَانَ الْقَيِّمُ بِهِ مِثْلَكَ وَ مِثْلَ عَبْدِ الْحَمِيدِ فَلَا بَأْسَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail who said, \n‘A man from our companions died and did not bequeath, and his matter was raised to a judge of Al-Kufa. So Abdul Hameed became the custodian of his wealth, and the man had left behind young inheritors, and goods, and slave girls. Abdul Hameed sold the goods, but when he intended to sell the slave girls, his heart weakened regarding their sale since the deceased had not made the bequest to him, and his custodianship in it was by the order of the judge, (and) because of their chastity’. \nHe (the narrator) said, ‘So I mentioned that to Abu Ja’far<sup>asws</sup> and I said to him<sup>asws</sup>, ‘The man from our companions died and did not bequeath to anyone, and he left behind slave girls. So the judge made a man from us to be a custodian in order to sell them’, or said, ‘A man from us was made a custodian with that, but his heart weakened, because of their chastity. So what is your<sup>asws</sup> view regarding that?’ So he<sup>asws</sup> said: ‘If it was such that the custodian was like you and like Abdul Hameed, so there is no problem’."}]}, {"index": 8880, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:2:92:3", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يَشْتَرِي الْعَبْدَ وَ هُوَ آبِقٌ مِنْ أَهْلِهِ فَقَالَ لَا يَصْلُحُ إِلَّا أَنْ يَشْتَرِيَ مَعَهُ شَيْئاً آخَرَ فَيَقُولَ أَشْتَرِي مِنْكَ هَذَا الشَّيْ‏ءَ وَ عَبْدَكَ بِكَذَا وَ كَذَا فَإِنْ لَمْ يَقْدِرْ عَلَى الْعَبْدِ كَانَ ثَمَنُهُ الَّذِي نَقَدَ فِي الشَّيْ‏ءِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Usman Bin Isa, from Sama’at who said, \n‘I asked him<sup>asws</sup> about the man who bought a slave and he was the abdsconder from his family. So he<sup>asws</sup> said: ‘It is not correct except if he were to buy another thing along with it, so he would be saying, ‘I hereby buy this thing from you, and your slave, with such and such (a price)’. So if he was not able upon the slave (to take him), his price would be the cash regarding the thing’."}]}, {"index": 8881, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:5:2:92:4", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ رِفَاعَةَ النَّخَّاسِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَقُلْتُ سَاوَمْتُ رَجُلًا بِجَارِيَةٍ لَهُ فَبَاعَنِيهَا بِحُكْمِي فَقَبَضْتُهَا مِنْهُ عَلَى ذَلِكَ ثُمَّ بَعَثْتُ إِلَيْهِ بِأَلْفِ دِرْهَمٍ وَ قُلْتُ لَهُ هَذِهِ الْأَلْفُ حُكْمِي عَلَيْكَ فَأَبَى أَنْ يَقْبَلَهَا مِنِّي وَ قَدْ كُنْتُ مَسِسْتُهَا قَبْلَ أَنْ أَبْعَثَ إِلَيْهِ بِأَلْفِ دِرْهَمٍ \nقَالَ فَقَالَ أَرَى أَنْ تُقَوَّمَ الْجَارِيَةُ بِقِيمَةٍ عَادِلَةٍ فَإِنْ كَانَ ثَمَنُهَا أَكْثَرَ مِمَّا بَعَثْتَ إِلَيْهِ كَانَ عَلَيْكَ أَنْ تَرُدَّ إِلَيْهِ مَا نَقَصَ مِنَ الْقِيمَةِ وَ إِنْ كَانَتْ قِيمَتُهَا أَقَلَّ مِمَّا بَعَثْتَ بِهِ إِلَيْهِ فَهُوَ لَهُ \nقَالَ فَقُلْتُ أَ رَأَيْتَ إِنْ أَصَبْتُ بِهَا عَيْباً بَعْدَ مَا مَسِسْتُهَا قَالَ لَيْسَ لَكَ أَنْ تَرُدَّهَا وَ لَكَ أَنْ تَأْخُذَ قِيمَةَ مَا بَيْنَ الصِّحَّةِ وَ الْعَيْبِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad and Ahmad Bin Muhammad altogether, from Al Hassan Bin Mahboub, from Rafa’at Al Nakhhas who said, \n‘I asked Abu Abdullah<sup>asws</sup>, so I said, ‘A man had a slave girl who he sold to me with my order. So I took possession of her from him, upon that. Then I sent over a thousand Dirhams to him and I said to him, ‘This thousand is for my order upon you’. But, he refused to accept it from me, and I had already touched her before I sent the thousand Dirhams to him’.\nHe (the narrator) said, ‘So he<sup>asws</sup> said: ‘I<sup>asws</sup> view that you should evaluate the slave girl with a fair price. So if it was that her value was more than what you had sent to him, it would be upon you to return to him whatever was deficient from the value; and if it was that her value was less than what you had sent to him, so it is for him’. \nHe (the narrator) said, ‘What is your view if I were to find a defact with her after having touched her?’ He<sup>asws</sup> said: ‘It is not for you to return her, and for you would be to take what is between the correct and the defact (a discount)’."}]}, {"index": 8882, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:5:2:92:5", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ فِي الْمَمْلُوكِ يَكُونُ بَيْنَ شُرَكَاءَ فَيَبِيعُ أَحَدُهُمْ نَصِيبَهُ فَيَقُولُ صَاحِبُهُ أَنَا أَحَقُّ بِهِ أَ لَهُ ذَلِكَ قَالَ نَعَمْ إِذَا كَانَ وَاحِداً فَقِيلَ فِي الْحَيَوَانِ شُفْعَةٌ فَقَالَ لَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, \nfrom Abu Abdullah<sup>asws</sup>, said, ‘With regards to the owned slave who happens to be between the partners, so one of them sells him, and his companion says, ‘I am more rightful with it’. Would that be for him?’ He<sup>asws</sup> said: ‘Yes, when there was one (partner)’. So it was said, is there any right of ‘شُفْعَةٌ’ (preference to the sale to the near ones) regarding animals?’ So he<sup>asws</sup> said: ‘No’."}]}, {"index": 8883, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:5:2:92:6", "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) فِي شِرَاءِ الرُّومِيَّاتِ قَالَ اشْتَرِهِنَّ وَ بِعْهُنَّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Ibn Abu Umeyr, from Ibrahim Bin Abdul Hameed, \n(It has been narrated) from Abu Al-Hassan<sup>asws</sup> regarding the Roman women (slaves). He<sup>asws</sup> said: ‘Buy them and sell them’."}]}, {"index": 8884, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:5:2:92:7", "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ إِسْمَاعِيلَ بْنِ الْفَضْلِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ شِرَاءِ مَمْلُوكِي أَهْلِ الذِّمَّةِ إِذَا أَقَرُّوا لَهُمْ بِذَلِكَ فَقَالَ إِذَا أَقَرُّوا لَهُمْ بِذَلِكَ فَاشْتَرِ وَ انْكِحْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from someone else, from Aban Bin Usman, from Ismail Bin Al Fazl who said, \n‘I asked Abu Abdullah<sup>asws</sup> about buying the owned slaves of the people under the responsibility (<span class=\"iTxt\">Ahl Al-Zimma</span>), when there is an endorsement for them with that (from the Islamic government). So he<sup>asws</sup> said: ‘When there is an endorsement for them with that, so buy and marry’."}]}, {"index": 8885, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:5:2:92:8", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سَهْلٍ عَنْ زَكَرِيَّا بْنِ آدَمَ قَالَ سَأَلْتُ الرِّضَا ( عليه السلام ) عَنْ قَوْمٍ مِنَ الْعَدُوِّ صَالَحُوا ثُمَّ خَفَرُوا وَ لَعَلَّهُمْ إِنَّمَا خَفَرُوا لِأَنَّهُ لَمْ يُعْدَلْ عَلَيْهِمْ أَ يَصْلُحُ أَنْ يُشْتَرَى مِنْ سَبْيِهِمْ فَقَالَ إِنْ كَانَ مِنْ عَدُوٍّ قَدِ اسْتَبَانَ عَدَاوَتُهُمْ فَاشْتَرِ مِنْهُمْ وَ إِنْ كَانَ قَدْ نَفَرُوا وَ ظَلَمُوا فَلَا تَبْتَعْ مِنْ سَبْيِهِمْ \nقَالَ وَ سَأَلْتُهُ عَنْ سَبْيِ الدَّيْلَمِ يَسْرِقُ بَعْضُهُمْ مِنْ بَعْضٍ وَ يُغِيرُ الْمُسْلِمُونَ عَلَيْهِمْ بِلَا إِمَامٍ أَ يَحِلُّ شِرَاؤُهُمْ قَالَ إِذَا أَقَرُّوا بِالْعُبُودِيَّةِ فَلَا بَأْسَ بِشِرَائِهِمْ \nقَالَ وَ سَأَلْتُهُ عَنْ قَوْمٍ مِنْ أَهْلِ الذِّمَّةِ أَصَابَهُمْ جُوعٌ فَأَتَاهُ رَجُلٌ بِوَلَدِهِ فَقَالَ هَذَا لَكَ فَأَطْعِمْهُ وَ هُوَ لَكَ عَبْدٌ فَقَالَ لَا تَبْتَعْ حُرّاً فَإِنَّهُ لَا يَصْلُحُ لَكَ وَ لَا مِنْ أَهْلِ الذِّمَّةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Sahl, from Zakariyya Bin Adam who said, \n‘I asked Al-Reza<sup>asws</sup> about a people from the enemies who reconcile (sign a peace treaty), then they breach it, and perhaps they breach it because justice had not been done upon them. Is it correct to buy from their captives?’ So he<sup>asws</sup> said: ‘If it was from the enemies who had manifested their enmity, so buy from them (their captives), and if it was a number who were alienated and had been unjust, so do not buy from their captives’.\nHe (the narrator) said, ‘And I asked him<sup>asws</sup> about a captive of Al Daylam who had stolen from each other and the Muslims had attacked them without an Imam<sup>asws</sup>, is buying them Permissible?’ He<sup>asws</sup> said: ‘When they had been endorsed with the slavery so there is no problem with buying them’. \nHe (the narrator) said, ‘And I asked him<sup>asws</sup> about a people from the ones under the responsibility (<span class=\"iTxt\">Ahl Al-Zimma</span>) who have been hit by hunger (famine), so a man comes over with his son, so he says, ‘This is for you, so feed him, and he would be a slave for you’. So he<sup>asws</sup> said: ‘You cannot sell the free, for it is not correct for you, nor from the people under the responsibility (<span class=\"iTxt\">Ahl Al-Zimma</span>)’."}]}, {"index": 8886, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:5:2:92:9", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ رِفَاعَةَ النَّخَّاسِ قَالَ قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) إِنَّ الرُّومَ يُغِيرُونَ عَلَى الصَّقَالِبَةِ فَيَسْرِقُونَ أَوْلَادَهُمْ مِنَ الْجَوَارِي وَ الْغِلْمَانِ فَيَعْمِدُونَ إِلَى الْغِلْمَانِ فَيَخْصُونَهُمْ ثُمَّ يَبْعَثُونَ بِهِمْ إِلَى بَغْدَادَ إِلَى التُّجَّارِ فَمَا تَرَى فِي شِرَائِهِمْ وَ نَحْنُ نَعْلَمُ أَنَّهُمْ قَدْ سُرِقُوا وَ إِنَّمَا أَغَارُوا عَلَيْهِمْ مِنْ غَيْرِ حَرْبٍ كَانَتْ بَيْنَهُمْ فَقَالَ لَا بَأْسَ بِشِرَائِهِمْ إِنَّمَا أَخْرَجُوهُمْ مِنَ الشِّرْكِ إِلَى دَارِ الْإِسْلَامِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, and Ahmad Bin Muhammad, altogether from Ibn Mahboub, from Rafa’at Al Nakhhas who said, \n‘I said to Abu Al-Hassan<sup>asws</sup>, ‘The Romans are invading upon Al-Saqaliba (between Turkey and Bulgaria). So they are stealing their children, from the slave-girls and the slave-boys. So they are deliberating to the boys and castrating them, then they are sending them to Baghdad to the merchants. So what is your<sup>asws</sup> view regarding buying them, and we know that they have been stolen, but rather they were invaded upon from other than a war which was between them’. So he<sup>asws</sup> said: ‘It not unlawful to buy them as they are taken out of the Polytheism and (brought) into the house of Al-Islam’."}]}, {"index": 8887, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:5:2:92:10", "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَقِيقِ أَهْلِ الذِّمَّةِ أَشْتَرِي مِنْهُمْ شَيْئاً فَقَالَ اشْتَرِ إِذَا أَقَرُّوا لَهُمْ بِالرِّقِّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from someone else, from Aban, from Abdul Rahman Bin Abu Abdullah, said, \n‘I asked Abu Abdullah<sup>asws</sup> about a slave of the people under the responsibility (Ahl Al-Zimma), can I buy some of them? He<sup>asws</sup> said: ‘Buy, when they have been endorsed with the slavery’."}]}, {"index": 8888, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:5:2:92:11", "text": "أَبَانٌ عَنْ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ اشْتَرَى جَارِيَةً بِثَمَنٍ مُسَمًّى ثُمَّ بَاعَهَا فَرَبِحَ فِيهَا قَبْلَ أَنْ يَنْقُدَ صَاحِبَهَا الَّذِي هِيَ لَهُ فَأَتَاهُ صَاحِبُهَا يَتَقَاضَاهُ وَ لَمْ يَنْقُدْ مَالَهُ فَقَالَ صَاحِبُ الْجَارِيَةِ لِلَّذِينَ بَاعَهُمْ اكْفُونِي غَرِيمِي هَذَا وَ الَّذِي رَبِحْتُ عَلَيْكُمْ فَهُوَ لَكُمْ قَالَ لَا بَأْسَ.", "translations": [{"lang": "en", "name": "hubeali", "text": "Aban, from Zurara, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who bought a slave girl with a named price. Then he sells her (on credit), and he profits in her before he settles the cash to her master who she is for. So her master comes for the earnings but he does not settle his wealth. So the master of the slave girl says to those who she had been sold to, ‘Fulfil this payment of mine and that which has been profited upon you, so it is for you’. He<sup>asws</sup> said: ‘There is no problem’."}]}, {"index": 8889, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:5:2:92:12", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) فِي وَلِيدَةٍ بَاعَهَا ابْنُ سَيِّدِهَا وَ أَبُوهُ غَائِبٌ فَاسْتَوْلَدَهَا الَّذِي اشْتَرَاهَا فَوَلَدَتْ مِنْهُ غُلَاماً ثُمَّ جَاءَ سَيِّدُهَا الْأَوَّلُ فَخَاصَمَ سَيِّدَهَا الْآخَرَ فَقَالَ وَلِيدَتِي بَاعَهَا ابْنِي بِغَيْرِ إِذْنِي \nفَقَالَ الْحُكْمُ أَنْ يَأْخُذَ وَلِيدَتَهُ وَ ابْنَهَا فَنَاشَدَهُ الَّذِي اشْتَرَاهَا فَقَالَ لَهُ خُذِ ابْنَهُ الَّذِي بَاعَكَ الْوَلِيدَةَ حَتَّى يَنْقُدَ لَكَ الْبَيْعَ فَلَمَّا أَخَذَهُ قَالَ لَهُ أَبُوهُ أَرْسِلْ ابْنِي قَالَ لَا وَ اللَّهِ لَا أُرْسِلُ إِلَيْكَ ابْنَكَ حَتَّى تُرْسِلَ ابْنِي فَلَمَّا رَأَى ذَلِكَ سَيِّدُ الْوَلِيدَةِ أَجَازَ بَيْعَ ابْنِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Najran, from Aasim Bin Humeyd, from Muhammad Bin qays, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> judged regarding a mother of a child who was sold by a son of her master, and his father was absent. So she gave birth for the one who had bought her, giving birth to a boy. Then her former master came over, so he disputed with her later master, saying, ‘The mother of my son was sold by my son without my permission’.\nSo he<sup>asws</sup> said: ‘The judgement was that he takes the mother of his child and her son. So the one who had bought her begged and pleaded before him<sup>asws</sup> (for assistance in this matter), so he<sup>asws</sup> said to him: ‘Take his son who had sold the mother of his child to you, until he settles the sale in cash to you’. So when he took him, his father said, ‘Send my son back to me’. He said, ‘No, by Allah<sup>azwj</sup>! I will not send your son back to you until you send my son back to me (from the slave girl)’. So when the master of the mother of his son saw that, he allowed the sale (made) by his son’."}]}, {"index": 8890, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:5:2:92:13", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ حَمْزَةَ بْنِ حُمْرَانَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَدْخُلُ السُّوقَ أُرِيدُ أَنْ أَشْتَرِيَ جَارِيَةً فَتَقُولُ لِي إِنِّي حُرَّةٌ فَقَالَ اشْتَرِهَا إِلَّا أَنْ تَكُونَ لَهَا بَيِّنَةٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel Bin Darraj, from Hamza Bin Humran who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘I entered a market intending to buy a slave girl, so she was saying to me, ‘I am free’. So he<sup>asws</sup> said: ‘Buy her except if there happens to be a proof for her’."}]}, {"index": 8891, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:5:2:92:14", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ زُرَارَةَ قَالَ كُنْتُ جَالِساً عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَدَخَلَ عَلَيْهِ رَجُلٌ وَ مَعَهُ ابْنٌ لَهُ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَا تِجَارَةُ ابْنِكَ فَقَالَ التَّنَخُّسُ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَا تَشْتَرِيَنَّ شَيْناً وَ لَا عَيْباً وَ إِذَا اشْتَرَيْتَ رَأْساً فَلَا تُرِيَنَّ ثَمَنَهُ فِي كِفَّةِ الْمِيزَانِ فَمَا مِنْ رَأْسٍ رَأَى ثَمَنَهُ فِي كِفَّةِ الْمِيزَانِ فَأَفْلَحَ وَ إِذَا اشْتَرَيْتَ رَأْساً فَغَيِّرِ اسْمَهُ وَ أَطْعِمْهُ شَيْئاً حُلْواً إِذَا مَلَكْتَهُ وَ تَصَدَّقْ عَنْهُ بِأَرْبَعَةِ دَرَاهِمَ ", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Zurara who said, \n‘I was seated in the presence of Abu Abdullah<sup>asws</sup>, so a man came over to him<sup>asws</sup> and with him was a son of his’. So Abu Abdullah<sup>asws</sup> said to him: ‘What is the business of your son?’ So he said, ‘A slave trader’. So Abu Abdullah<sup>asws</sup> said to him: ‘Do not buy a disfigured one nor the one with defects (physical/mental); and whenever you buy a head, so do not display his price in the pan of the scale, for there is none from a head whose price was displayed in a pan of the scale has (ever) succeeded; and whenever you buy a head, so change his name and feed him something sweet when you own him, and give in charity with four Dirhams about him’."}]}, {"index": 8892, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:5:2:92:15", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ عَنْ مُحَمَّدِ بْنِ مُيَسِّرٍ عَنْ أَبِيهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ نَظَرَ إِلَى ثَمَنِهِ وَ هُوَ يُوزَنُ لَمْ يُفْلِحْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ibrahim Bin Uqba, from Muhammad Bin Mysar, from his father, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who looks at his price and he is being weighed, would not succeed’."}]}, {"index": 8893, "local_index": 16, "part_type": "Hadith", "path": "/books/al-kafi:5:2:92:16", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ رِفَاعَةَ قَالَ سَأَلْتُ أَبَا الْحَسَنِ مُوسَى ( عليه السلام ) عَنْ رَجُلٍ شَارَكَ رَجُلًا فِي جَارِيَةٍ لَهُ وَ قَالَ إِنْ رَبِحْنَا فِيهَا فَلَكَ نِصْفُ الرِّبْحِ وَ إِنْ كَانَتْ وَضِيعَةٌ فَلَيْسَ عَلَيْكَ شَيْ‏ءٌ فَقَالَ لَا أَرَى بِهَذَا بَأْساً إِذَا طَابَتْ نَفْسُ صَاحِبِ الْجَارِيَةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Rafa’at who said,\n‘I asked Abu Al-Hassan Musa<sup>asws</sup> about a man who participated with a man regarding a slave girl of his and said, ‘If we profit in her, so half of the profit would be for you, but if there was a loss, so there would not be anything upon you’. So he<sup>asws</sup> said: ‘I<sup>asws</sup> do not view any problem with this, when the master of the slave girl himself was agreeable’."}]}, {"index": 8894, "local_index": 17, "part_type": "Hadith", "path": "/books/al-kafi:5:2:92:17", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الشَّرْطِ فِي الْإِمَاءِ أَلَّا تُبَاعَ وَ لَا تُورَثَ وَ لَا تُوهَبَ فَقَالَ يَجُوزُ ذَلِكَ غَيْرَ الْمِيرَاثِ فَإِنَّهَا تُورَثُ وَ كُلُّ شَرْطٍ خَالَفَ كِتَابَ اللَّهِ فَهُوَ رَدٌّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the stipulation regarding the slave girl that she can neither be sold, nor inherited, nor gifted. So he<sup>asws</sup> said: ‘That is allowed apart from the inheritance, for she can be inherited, and every stipulation which opposes the Book of Allah<sup>azwj</sup>, so it is rejected’."}]}, {"index": 8895, "local_index": 18, "part_type": "Hadith", "path": "/books/al-kafi:5:2:92:18", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْحَمِيدِ عَنْ أَبِي جَمِيلَةَ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لِي يَا شَابُّ أَيَّ شَيْ‏ءٍ تُعَالِجُ فَقُلْتُ الرَّقِيقَ فَقَالَ أُوصِيكَ بِوَصِيَّةٍ فَاحْفَظْهَا لَا تَشْتَرِيَنَّ شَيْناً وَ لَا عَيْباً وَ اسْتَوْثِقْ مِنَ الْعُهْدَةِ.", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Muhammad Bin Abdul Hameed, from Abu Jameela who said, \n‘I went over to Abu Abdullah<sup>asws</sup>, so he<sup>asws</sup> said to me: ‘O youth! Which thing is your profession?’ So I said, ‘The slaves’. So he<sup>asws</sup> said: ‘I<sup>asws</sup> advise you with an adive, so memorise it. Neither buy anything with a deformity, nor a defact, and affirm the contracts’."}]}]}, "index": "al-kafi:5:2:92", "kind": "verse_list"}