{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:5:2", "titles": {"ar": "كتاب الْمَعِيشَةِ", "en": "THE BOOK OF SUBSISTENCE"}}, {"indexed_titles": {"en": "Chapter 96"}, "path": "/books/al-kafi:5:2:96", "titles": {"ar": "باب التَّفْرِقَةِ بَيْنَ ذَوِي الْأَرْحَامِ مِنَ الْمَمَالِيكِ ", "en": "Chapter 96 – The separation between the relatives from the owned slaves"}}], "index": 1307, "local_index": 96, "part_type": "Chapter", "path": "/books/al-kafi:5:2:96", "titles": {"ar": "باب التَّفْرِقَةِ بَيْنَ ذَوِي الْأَرْحَامِ مِنَ الْمَمَالِيكِ ", "en": "Chapter 96 – The separation between the relatives from the owned slaves"}, "verse_count": 5, "verse_start_index": 8917, "verses": [{"index": 8918, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:2:96:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ أُتِيَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِسَبْيٍ مِنَ الْيَمَنِ فَلَمَّا بَلَغُوا الْجُحْفَةَ نَفِدَتْ نَفَقَاتُهُمْ فَبَاعُوا جَارِيَةً مِنَ السَّبْيِ كَانَتْ أُمُّهَا مَعَهُمْ فَلَمَّا قَدِمُوا عَلَى النَّبِيِّ ( صلى الله عليه وآله ) سَمِعَ بُكَاءَهَا فَقَالَ مَا هَذِهِ الْبُكَاءُ فَقَالُوا يَا رَسُولَ اللَّهِ احْتَجْنَا إِلَى نَفَقَةٍ فَبِعْنَا ابْنَتَهَا فَبَعَثَ بِثَمَنِهَا فَأُتِيَ بِهَا وَ قَالَ بِيعُوهُمَا جَمِيعاً أَوْ أَمْسِكُوهُمَا جَمِيعاً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Ibn Abu Umeyr, from Muawiya Bin Ammar who said, \n‘I heard Abu Abdullah<sup>asws</sup> saying: ‘They came to Rasool-Allah<sup>saww</sup> with captives from Al-Yemen. So when they reached Al-Juhfa, their expenditure (money) ran out. So they sold a girl from the captives, whose mother was with them. So when they proceded to the Prophet<sup>saww</sup>, he<sup>saww</sup> heard her wailing. So he<sup>saww</sup> said: ‘What is this wailing?’ They said, ‘O Rasool-Allah<sup>saww</sup>! We became needy to the spending money, so we sold her daughter’. So he<sup>saww</sup> sent (someone) with her price who came back with her, and he<sup>saww</sup> said: ‘Either sell them both together or keep both of them together’."}]}, {"index": 8919, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:2:96:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ سَأَلْتُهُ عَنْ أَخَوَيْنِ مَمْلُوكَيْنِ هَلْ يُفَرَّقُ بَيْنَهُمَا وَ عَنِ الْمَرْأَةِ وَ وَلَدِهَا قَالَ لَا هُوَ حَرَامٌ إِلَّا أَنْ يُرِيدُوا ذَلِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Usman Bin Isa, from Sama’at who said, \n‘I asked him<sup>asws</sup> about two brothers who are owned slaves, is effecting a separation between the two Permissible, and about the woman and her child?’ He<sup>asws</sup> said: ‘No, it is Prohibited, except if they want that’."}]}, {"index": 8920, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:2:96:3", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ اشْتُرِيَتْ لَهُ جَارِيَةٌ مِنَ الْكُوفَةِ قَالَ فَذَهَبَ لِتَقُومَ فِي بَعْضِ الْحَاجَةِ فَقَالَتْ يَا أُمَّاهْ فَقَالَ لَهَا أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَ لَكِ أُمٌّ قَالَتْ نَعَمْ فَأَمَرَ بِهَا فَرُدَّتْ فَقَالَ مَا آمَنْتُ لَوْ حَبَسْتُهَا أَنْ أَرَى فِي وُلْدِي مَا أَكْرَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Ibn Abu Umeyr, from Hisham Bin Al Hakam, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, a slave girl having been bought for him<sup>asws</sup> from Al-Kufa. So he<sup>asws</sup> went on to stand regarding one of the needs, so she said, ‘O mother!’ So Abu Abdullah<sup>asws</sup> said: ‘Is there a mother for you?’ She said, ‘Yes’. So he<sup>asws</sup> ordered with her to be returned, and said: ‘I<sup>asws</sup> do not feel safe if I<sup>asws</sup> were to keep her, from seeing in my<sup>asws</sup> children what I<sup>asws</sup> dislike’."}]}, {"index": 8921, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:5:2:96:4", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْعَبَّاسِ بْنِ مُوسَى عَنْ يُونُسَ عَنْ عَمْرِو بْنِ أَبِي نَصْرٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الْجَارِيَةُ الصَّغِيرَةُ يَشْتَرِيهَا الرَّجُلُ فَقَالَ إِنْ كَانَتْ قَدِ اسْتَغْنَتْ عَنْ أَبَوَيْهَا فَلَا بَأْسَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Abbas Bin Musa, from Yunus, from Amro Bin Abu Nasr who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘The young slave girl, the man buys her’. So he<sup>asws</sup> said: ‘If she has become needless from her parents, so there is no problem’."}]}, {"index": 8922, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:5:2:96:5", "text": "مُحَمَّدٌ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنِ ابْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ فِي الرَّجُلِ يَشْتَرِي الْغُلَامَ أَوِ الْجَارِيَةَ وَ لَهُ أَخٌ أَوْ أُخْتٌ أَوْ أَبٌ أَوْ أُمٌّ بِمِصْرٍ مِنَ الْأَمْصَارِ قَالَ لَا يُخْرِجْهُ إِلَى مِصْرٍ آخَرَ إِنْ كَانَ صَغِيراً وَ لَا يَشْتَرِهِ فَإِنْ كَانَتْ لَهُ أُمٌّ فَطَابَتْ نَفْسُهَا وَ نَفْسُهُ فَاشْتَرِهِ إِنْ شِئْتَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Ibn Sinan, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said regarding the man who buys the slave or the slave girl, and for him is a brother, or a sister, or a father, or a mother in a city from the cities. He<sup>asws</sup> said: ‘Do not make him go out to another city if he was young, and do not buy him. So if there was a mother for him, so she agrees herself, and (he agrees) himself, so buy him if you so desire to’."}]}]}, "index": "al-kafi:5:2:96", "kind": "verse_list"}