{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 100"
        },
        "path": "/books/al-kafi:3:4:100",
        "titles": {
          "ar": "باب النَّوَادِرِ",
          "en": "Chapter 100 – The Miscellaneous"
        }
      }
    ],
    "index": 767,
    "local_index": 100,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 101"
        },
        "path": "/books/al-kafi:3:4:101",
        "titles": {
          "ar": "باب مَسَاجِدِ الْكُوفَةِ",
          "en": "Chapter 101 – Masjids of Al-Kufa"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 99"
        },
        "path": "/books/al-kafi:3:4:99",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب صَلَاةِ مَنْ أَرَادَ</span> أَنْ يَدْخُلَ بِأَهْلِهِ وَ مَنْ أَرَادَ أَنْ يَتَزَوَّجَ",
          "en": "Chapter 99 – Salāt of the one who intends to sleep with his wife, and the one who intends to get married"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:4:100",
    "titles": {
      "ar": "باب النَّوَادِرِ",
      "en": "Chapter 100 – The Miscellaneous"
    },
    "verse_count": 15,
    "verse_start_index": 5657,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/468)"
        ],
        "index": 5658,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/260",
              "text": "ابْنِ أُذَيْنَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:100:1",
        "relations": {
          "Mentions": [
            "/books/quran:112:1",
            "/books/quran:112:4",
            "/books/quran:112:3",
            "/books/quran:97:1",
            "/books/quran:112:2"
          ]
        },
        "text": [
          " قَالَ مَا تَرْوِي هَذِهِ النَّاصِبَةُ فَقُلْتُ جُعِلْتُ فِدَاكَ فِيمَا ذَا فَقَالَ فِي أَذَانِهِمْ وَ رُكُوعِهِمْ وَ سُجُودِهِمْ فَقُلْتُ إِنَّهُمْ يَقُولُونَ إِنَّ أُبَيَّ بْنَ كَعْبٍ رَآهُ فِي النَّوْمِ فَقَالَ كَذَبُوا فَإِنَّ دِينَ اللَّهِ عَزَّ وَ جَلَّ أَعَزُّ مِنْ أَنْ يُرَى فِي النَّوْمِ",
          "قَالَ فَقَالَ لَهُ سَدِيرٌ الصَّيْرَفِيُّ جُعِلْتُ فِدَاكَ فَأَحْدِثْ لَنَا مِنْ ذَلِكَ ذِكْراً فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ اللَّهَ عَزَّ وَ جَلَّ لَمَّا عَرَجَ بِنَبِيِّهِ ( صلى الله عليه وآله ) إِلَى سَمَاوَاتِهِ السَّبْعِ أَمَّا أُولَاهُنَّ فَبَارَكَ عَلَيْهِ وَ الثَّانِيَةَ عَلَّمَهُ فَرْضَهُ فَأَنْزَلَ اللَّهُ مَحْمِلًا مِنْ نُورٍ فِيهِ أَرْبَعُونَ نَوْعاً مِنْ أَنْوَاعِ النُّورِ كَانَتْ مُحْدِقَةً بِعَرْشِ اللَّهِ تَغْشَى أَبْصَارَ النَّاظِرِينَ",
          "أَمَّا وَاحِدٌ مِنْهَا فَأَصْفَرُ فَمِنْ أَجْلِ ذَلِكَ اصْفَرَّتِ الصُّفْرَةُ وَ وَاحِدٌ مِنْهَا أَحْمَرُ فَمِنْ أَجْلِ ذَلِكَ احْمَرَّتِ الْحُمْرَةُ وَ وَاحِدٌ مِنْهَا أَبْيَضُ فَمِنْ أَجْلِ ذَلِكَ ابْيَضَّ الْبَيَاضُ وَ الْبَاقِي عَلَى سَائِرِ عَدَدِ الْخَلْقِ مِنَ النُّورِ وَ الْأَلْوَانِ فِي ذَلِكَ الْمَحْمِلِ حَلَقٌ وَ سَلَاسِلُ مِنْ فِضَّةٍ",
          "ثُمَّ عَرَجَ بِهِ إِلَى السَّمَاءِ فَنَفَرَتِ الْمَلَائِكَةُ إِلَى أَطْرَافِ السَّمَاءِ وَ خَرَّتْ سُجَّداً وَ قَالَتْ سُبُّوحٌ قُدُّوسٌ مَا أَشْبَهَ هَذَا النُّورَ بِنُورِ رَبِّنَا فَقَالَ جَبْرَئِيلُ ( عليه السلام ) اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ ثُمَّ فُتِحَتْ أَبْوَابُ السَّمَاءِ وَ اجْتَمَعَتِ الْمَلَائِكَةُ فَسَلَّمَتْ عَلَى النَّبِيِّ ( صلى الله عليه وآله ) أَفْوَاجاً وَ قَالَتْ يَا مُحَمَّدُ كَيْفَ أَخُوكَ إِذَا نَزَلْتَ فَأَقْرِئْهُ السَّلَامَ قَالَ النَّبِيُّ ( صلى الله عليه وآله ) أَ فَتَعْرِفُونَهُ قَالُوا وَ كَيْفَ لَا نَعْرِفُهُ وَ قَدْ أُخِذَ مِيثَاقُكَ وَ مِيثَاقُهُ مِنَّا وَ مِيثَاقُ شِيعَتِهِ إِلَى يَوْمِ الْقِيَامَةِ عَلَيْنَا وَ إِنَّا لَنَتَصَفَّحُ وُجُوهَ شِيعَتِهِ فِي كُلِّ يَوْمٍ وَ لَيْلَةٍ خَمْساً يَعْنُونَ فِي كُلِّ وَقْتِ صَلَاةٍ وَ إِنَّا لَنُصَلِّي عَلَيْكَ وَ عَلَيْهِ ",
          "قَالَ ثُمَّ زَادَنِي رَبِّي أَرْبَعِينَ نَوْعاً مِنْ أَنْوَاعِ النُّورِ لَا يُشْبِهُ النُّورَ الْأَوَّلَ وَ زَادَنِي حَلَقاً وَ سَلَاسِلَ وَ عَرَجَ بِي إِلَى السَّمَاءِ الثَّانِيَةِ فَلَمَّا قَرِبْتُ مِنْ بَابِ السَّمَاءِ الثَّانِيَةِ نَفَرَتِ الْمَلَائِكَةُ إِلَى أَطْرَافِ السَّمَاءِ وَ خَرَّتْ سُجَّداً وَ قَالَتْ سُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلَائِكَةِ وَ الرُّوحِ مَا أَشْبَهَ هَذَا النُّورَ بِنُورِ رَبِّنَا فَقَالَ جَبْرَئِيلُ ( عليه السلام ) أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ فَاجْتَمَعَتِ الْمَلَائِكَةُ وَ قَالَتْ يَا جَبْرَئِيلُ مَنْ هَذَا مَعَكَ قَالَ هَذَا مُحَمَّدٌ ( صلى الله عليه وآله ) قَالُوا وَ قَدْ بُعِثَ قَالَ نَعَمْ",
          "قَالَ النَّبِيُّ ( صلى الله عليه وآله ) فَخَرَجُوا إِلَيَّ شِبْهَ الْمَعَانِيقِ فَسَلَّمُوا عَلَيَّ وَ قَالُوا أَقْرِئْ أَخَاكَ السَّلَامَ قُلْتُ أَ تَعْرِفُونَهُ قَالُوا وَ كَيْفَ لَا نَعْرِفُهُ وَ قَدْ أُخِذَ مِيثَاقُكَ وَ مِيثَاقُهُ وَ مِيثَاقُ شِيعَتِهِ إِلَى يَوْمِ الْقِيَامَةِ عَلَيْنَا وَ إِنَّا لَنَتَصَفَّحُ وُجُوهَ شِيعَتِهِ فِي كُلِّ يَوْمٍ وَ لَيْلَةٍ خَمْساً يَعْنُونَ فِي كُلِّ وَقْتِ صَلَاةٍ",
          "قَالَ ثُمَّ زَادَنِي رَبِّي أَرْبَعِينَ نَوْعاً مِنْ أَنْوَاعِ النُّورِ لَا تُشْبِهُ الْأَنْوَارَ الْأُولَى ثُمَّ عَرَجَ بِي إِلَى السَّمَاءِ الثَّالِثَةِ فَنَفَرَتِ الْمَلَائِكَةُ وَ خَرَّتْ سُجَّداً وَ قَالَتْ سُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلَائِكَةِ وَ الرُّوحِ مَا هَذَا النُّورُ الَّذِي يُشْبِهُ نُورَ رَبِّنَا فَقَالَ جَبْرَئِيلُ ( عليه السلام ) أَشْهَدُ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ قَالَ فَاجْتَمَعَتِ الْمَلَائِكَةُ وَ قَالَتْ مَرْحَباً بِالْأَوَّلِ وَ مَرْحَباً بِالْآخِرِ وَ مَرْحَباً بِالْحَاشِرِ وَ مَرْحَباً بِالنَّاشِرِ مُحَمَّدٌ خَيْرُ النَّبِيِّينَ وَ عَلِيٌّ خَيْرُ الْوَصِيِّينَ",
          "قَالَ النَّبِيُّ ( صلى الله عليه وآله ) ثُمَّ سَلَّمُوا عَلَيَّ وَ سَأَلُونِي عَنْ أَخِي قُلْتُ هُوَ فِي الْأَرْضِ أَ فَتَعْرِفُونَهُ قَالُوا وَ كَيْفَ لَا نَعْرِفُهُ وَ قَدْ نَحُجُّ الْبَيْتَ الْمَعْمُورَ كُلَّ سَنَةٍ وَ عَلَيْهِ رَقٌّ أَبْيَضُ فِيهِ اسْمُ مُحَمَّدٍ وَ اسْمُ عَلِيٍّ وَ الْحَسَنِ وَ الْحُسَيْنِ وَ الْأَئِمَّةِ ( عليهم السلام ) وَ شِيعَتِهِمْ إِلَى يَوْمِ الْقِيَامَةِ وَ إِنَّا لَنُبَارِكُ عَلَيْهِمْ كُلَّ يَوْمٍ وَ لَيْلَةٍ خَمْساً يَعْنُونَ فِي وَقْتِ كُلِّ صَلَاةٍ وَ يَمْسَحُونَ رُءُوسَهُمْ بِأَيْدِيهِمْ ",
          "قَالَ ثُمَّ زَادَنِي رَبِّي أَرْبَعِينَ نَوْعاً مِنْ أَنْوَاعِ النُّورِ لَا تُشْبِهُ تِلْكَ الْأَنْوَارَ الْأُولَى ثُمَّ عَرَجَ بِي حَتَّى انْتَهَيْتُ إِلَى السَّمَاءِ الرَّابِعَةِ فَلَمْ تَقُلِ الْمَلَائِكَةُ شَيْئاً وَ سَمِعْتُ دَوِيّاً كَأَنَّهُ فِي الصُّدُورِ فَاجْتَمَعَتِ الْمَلَائِكَةُ فَفُتِحَتْ أَبْوَابُ السَّمَاءِ وَ خَرَجَتْ إِلَيَّ شِبْهَ الْمَعَانِيقِ فَقَالَ جَبْرَئِيلُ ( عليه السلام ) ",
          "حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الْفَلَاحِ حَيَّ عَلَى الْفَلَاحِ فَقَالَتِ الْمَلَائِكَةُ صَوْتَانِ مَقْرُونَانِ مَعْرُوفَانِ فَقَالَ جَبْرَئِيلُ ( عليه السلام ) قَدْ قَامَتِ الصَّلَاةُ قَدْ قَامَتِ الصَّلَاةُ فَقَالَتِ الْمَلَائِكَةُ هِيَ لِشِيعَتِهِ إِلَى يَوْمِ الْقِيَامَةِ",
          "ثُمَّ اجْتَمَعَتِ الْمَلَائِكَةُ وَ قَالَتْ كَيْفَ تَرَكْتَ أَخَاكَ فَقُلْتُ لَهُمْ وَ تَعْرِفُونَهُ قَالُوا نَعْرِفُهُ وَ شِيعَتَهُ وَ هُمْ نُورٌ حَوْلَ عَرْشِ اللَّهِ وَ إِنَّ فِي الْبَيْتِ الْمَعْمُورِ لَرَقّاً مِنْ نُورٍ فِيهِ كِتَابٌ مِنْ نُورٍ فِيهِ اسْمُ مُحَمَّدٍ وَ عَلِيٍّ وَ الْحَسَنِ وَ الْحُسَيْنِ وَ الْأَئِمَّةِ وَ شِيعَتِهِمْ إِلَى يَوْمِ الْقِيَامَةِ لَا يَزِيدُ فِيهِمْ رَجُلٌ وَ لَا يَنْقُصُ مِنْهُمْ رَجُلٌ وَ إِنَّهُ لَمِيثَاقُنَا وَ إِنَّهُ لَيُقْرَأُ عَلَيْنَا كُلَّ يَوْمِ جُمُعَةٍ ",
          "ثُمَّ قِيلَ لِي ارْفَعْ رَأْسَكَ يَا مُحَمَّدُ فَرَفَعْتُ رَأْسِي فَإِذَا أَطْبَاقُ السَّمَاءِ قَدْ خُرِقَتْ وَ الْحُجُبُ قَدْ رُفِعَتْ ثُمَّ قَالَ لِي طَأْطِئْ رَأْسَكَ انْظُرْ مَا تَرَى فَطَأْطَأْتُ رَأْسِي فَنَظَرْتُ إِلَى بَيْتٍ مِثْلِ بَيْتِكُمْ هَذَا وَ حَرَمٍ مِثْلِ حَرَمِ هَذَا الْبَيْتِ لَوْ أَلْقَيْتُ شَيْئاً مِنْ يَدِي لَمْ يَقَعْ إِلَّا عَلَيْهِ",
          "فَقِيلَ لِي يَا مُحَمَّدُ إِنَّ هَذَا الْحَرَمُ وَ أَنْتَ الْحَرَامُ وَ لِكُلِّ مِثْلٍ مِثَالٌ ثُمَّ أَوْحَى اللَّهُ إِلَيَّ يَا مُحَمَّدُ ادْنُ مِنْ صَادٍ فَاغْسِلْ مَسَاجِدَكَ وَ طَهِّرْهَا وَ صَلِّ لِرَبِّكَ",
          "فَدَنَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مِنْ صَادٍ وَ هُوَ مَاءٌ يَسِيلُ مِنْ سَاقِ الْعَرْشِ الْأَيْمَنِ فَتَلَقَّى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْمَاءَ بِيَدِهِ الْيُمْنَى فَمِنْ أَجْلِ ذَلِكَ صَارَ الْوُضُوءُ بِالْيَمِينِ",
          "ثُمَّ أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ أَنِ اغْسِلْ وَجْهَكَ فَإِنَّكَ تَنْظُرُ إِلَى عَظَمَتِي ثُمَّ اغْسِلْ ذِرَاعَيْكَ الْيُمْنَى وَ الْيُسْرَى فَإِنَّكَ تَلَقَّى بِيَدِكَ كَلَامِي ثُمَّ امْسَحْ رَأْسَكَ بِفَضْلِ مَا بَقِيَ فِي يَدَيْكَ مِنَ الْمَاءِ وَ رِجْلَيْكَ إِلَى كَعْبَيْكَ فَإِنِّي أُبَارِكُ عَلَيْكَ وَ أُوطِئُكَ مَوْطِئاً لَمْ يَطَأْهُ أَحَدٌ غَيْرُكَ فَهَذَا عِلَّةُ الْأَذَانِ وَ الْوُضُوءِ ",
          "ثُمَّ أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ يَا مُحَمَّدُ اسْتَقْبِلِ الْحَجَرَ الْأَسْوَدَ وَ كَبِّرْنِي عَلَى عَدَدِ حُجُبِي فَمِنْ أَجْلِ ذَلِكَ صَارَ التَّكْبِيرُ سَبْعاً لِأَنَّ الْحُجُبَ سَبْعٌ فَافْتَتِحْ عِنْدَ انْقِطَاعِ الْحُجُبِ فَمِنْ أَجْلِ ذَلِكَ صَارَ الِافْتِتَاحُ سُنَّةً وَ الْحُجُبُ مُتَطَابِقَةٌ بَيْنَهُنَّ بِحَارُ النُّورِ وَ ذَلِكَ النُّورُ الَّذِي أَنْزَلَهُ اللَّهُ عَلَى مُحَمَّدٍ ( صلى الله عليه وآله ) فَمِنْ أَجْلِ ذَلِكَ صَارَ الِافْتِتَاحُ ثَلَاثَ مَرَّاتٍ لِافْتِتَاحِ الْحُجُبِ ثَلَاثَ مَرَّاتٍ فَصَارَ التَّكْبِيرُ سَبْعاً وَ الِافْتِتَاحُ ثَلَاثاً ",
          "فَلَمَّا فَرَغَ مِنَ التَّكْبِيرِ وَ الِافْتِتَاحِ أَوْحَى اللَّهُ إِلَيْهِ سَمِّ بِاسْمِي فَمِنْ أَجْلِ ذَلِكَ جُعِلَ بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ فِي أَوَّلِ السُّورَةِ ثُمَّ أَوْحَى اللَّهُ إِلَيْهِ أَنِ احْمَدْنِي فَلَمَّا قَالَ الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ قَالَ النَّبِيُّ فِي نَفْسِهِ شُكْراً فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ قَطَعْتَ حَمْدِي فَسَمِّ بِاسْمِي فَمِنْ أَجْلِ ذَلِكَ جُعِلَ فِي الْحَمْدِ الرَّحْمنِ الرَّحِيمِ مَرَّتَيْنِ",
          "فَلَمَّا بَلَغَ وَ لَا الضَّالِّينَ قَالَ النَّبِيُّ ( صلى الله عليه وآله ) الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ شُكْراً فَأَوْحَى اللَّهُ إِلَيْهِ قَطَعْتَ ذِكْرِي فَسَمِّ بِاسْمِي فَمِنْ أَجْلِ ذَلِكَ جُعِلَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ فِي أَوَّلِ السُّورَةِ",
          "ثُمَّ أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ اقْرَأْ يَا مُحَمَّدُ نِسْبَةَ رَبِّكَ تَبَارَكَ وَ تَعَالَى قُلْ هُوَ اللَّهُ أَحَدٌ. اللَّهُ الصَّمَدُ. لَمْ يَلِدْ وَ لَمْ يُولَدْ. وَ لَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ ثُمَّ أَمْسَكَ عَنْهُ الْوَحْيَ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْوَاحِدُ الْأَحَدُ الصَّمَدُ فَأَوْحَى اللَّهُ إِلَيْهِ لَمْ يَلِدْ وَ لَمْ يُولَدْ. وَ لَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ .",
          "ثُمَّ أَمْسَكَ عَنْهُ الْوَحْيَ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كَذَلِكَ اللَّهُ كَذَلِكَ اللَّهُ رَبُّنَا فَلَمَّا قَالَ ذَلِكَ أَوْحَى اللَّهُ إِلَيْهِ ارْكَعْ لِرَبِّكَ يَا مُحَمَّدُ فَرَكَعَ فَأَوْحَى اللَّهُ إِلَيْهِ وَ هُوَ رَاكِعٌ قُلْ سُبْحَانَ رَبِّيَ الْعَظِيمِ فَفَعَلَ ذَلِكَ ثَلَاثاً",
          "ثُمَّ أَوْحَى اللَّهُ إِلَيْهِ أَنِ ارْفَعْ رَأْسَكَ يَا مُحَمَّدُ فَفَعَلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَقَامَ مُنْتَصِباً فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ أَنِ اسْجُدْ لِرَبِّكَ يَا مُحَمَّدُ فَخَرَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) سَاجِداً فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ قُلْ سُبْحَانَ رَبِّيَ الْأَعْلَى فَفَعَلَ ذَلِكَ ثَلَاثاً",
          "ثُمَّ أَوْحَى اللَّهُ إِلَيْهِ اسْتَوِ جَالِساً يَا مُحَمَّدُ فَفَعَلَ فَلَمَّا رَفَعَ رَأْسَهُ مِنْ سُجُودِهِ وَ اسْتَوَى جَالِساً نَظَرَ إِلَى عَظَمَتِهِ تَجَلَّتْ لَهُ فَخَرَّ سَاجِداً مِنْ تِلْقَاءِ نَفْسِهِ لَا لِأَمْرٍ أُمِرَ بِهِ فَسَبَّحَ أَيْضاً ثَلَاثاً فَأَوْحَى اللَّهُ إِلَيْهِ انْتَصِبْ قَائِماً فَفَعَلَ فَلَمْ يَرَ مَا كَانَ رَأَى مِنَ الْعَظَمَةِ فَمِنْ أَجْلِ ذَلِكَ صَارَتِ الصَّلَاةُ رَكْعَةً وَ سَجْدَتَيْنِ",
          "ثُمَّ أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ اقْرَأْ بِالْحَمْدِ لِلَّهِ فَقَرَأَهَا مِثْلَ مَا قَرَأَ أَوَّلًا ثُمَّ أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ اقْرَأْ إِنَّا أَنْزَلْنَاهُ فَإِنَّهَا نِسْبَتُكَ وَ نِسْبَةُ أَهْلِ بَيْتِكَ إِلَى يَوْمِ الْقِيَامَةِ وَ فَعَلَ فِي الرُّكُوعِ مِثْلَ مَا فَعَلَ فِي الْمَرَّةِ الْأُولَى ثُمَّ سَجَدَ سَجْدَةً وَاحِدَةً فَلَمَّا رَفَعَ رَأْسَهُ تَجَلَّتْ لَهُ الْعَظَمَةُ فَخَرَّ سَاجِداً مِنْ تِلْقَاءِ نَفْسِهِ لَا لِأَمْرٍ أُمِرَ بِهِ فَسَبَّحَ أَيْضاً",
          "ثُمَّ أَوْحَى اللَّهُ إِلَيْهِ ارْفَعْ رَأْسَكَ يَا مُحَمَّدُ ثَبَّتَكَ رَبُّكَ فَلَمَّا ذَهَبَ لِيَقُومَ قِيلَ يَا مُحَمَّدُ اجْلِسْ فَجَلَسَ فَأَوْحَى اللَّهُ إِلَيْهِ يَا مُحَمَّدُ إِذَا مَا أَنْعَمْتُ عَلَيْكَ فَسَمِّ بِاسْمِي فَأُلْهِمَ أَنْ قَالَ بِسْمِ اللَّهِ وَ بِاللَّهِ وَ لَا إِلَهَ إِلَّا اللَّهُ وَ الْأَسْمَاءُ الْحُسْنَى كُلُّهَا لِلَّهِ",
          "ثُمَّ أَوْحَى اللَّهُ إِلَيْهِ يَا مُحَمَّدُ صَلِّ عَلَى نَفْسِكَ وَ عَلَى أَهْلِ بَيْتِكَ فَقَالَ صَلَّى اللَّهُ عَلَيَّ وَ عَلَى أَهْلِ بَيْتِي وَ قَدْ فَعَلَ ثُمَّ الْتَفَتَ فَإِذَا بِصُفُوفٍ مِنَ الْمَلَائِكَةِ وَ الْمُرْسَلِينَ وَ النَّبِيِّينَ فَقِيلَ يَا مُحَمَّدُ سَلِّمْ عَلَيْهِمْ فَقَالَ السَّلَامُ عَلَيْكُمْ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ ",
          "فَأَوْحَى اللَّهُ إِلَيْهِ أَنَّ السَّلَامَ وَ التَّحِيَّةَ وَ الرَّحْمَةَ وَ الْبَرَكَاتِ أَنْتَ وَ ذُرِّيَّتُكَ ",
          "ثُمَّ أَوْحَى اللَّهُ إِلَيْهِ أَنْ لَا يَلْتَفِتَ يَسَاراً وَ أَوَّلُ آيَةٍ سَمِعَهَا بَعْدَ قُلْ هُوَ اللَّهُ أَحَدٌ وَ إِنَّا أَنْزَلْنَاهُ آيَةُ أَصْحَابِ الْيَمِينِ وَ أَصْحَابِ الشِّمَالِ فَمِنْ أَجْلِ ذَلِكَ كَانَ السَّلَامُ وَاحِدَةً تُجَاهَ الْقِبْلَةِ وَ مِنْ أَجْلِ ذَلِكَ كَانَ التَّكْبِيرُ فِي السُّجُودِ شُكْراً وَ قَوْلُهُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ لِأَنَّ النَّبِيَّ ( صلى الله عليه وآله ) سَمِعَ ضَجَّةَ الْمَلَائِكَةِ بِالتَّسْبِيحِ وَ التَّحْمِيدِ وَ التَّهْلِيلِ فَمِنْ أَجْلِ ذَلِكَ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ وَ مِنْ أَجْلِ ذَلِكَ صَارَتِ الرَّكْعَتَانِ الْأُولَيَانِ كُلَّمَا أَحْدَثَ فِيهِمَا حَدَثاً كَانَ عَلَى صَاحِبِهِمَا إِعَادَتُهُمَا فَهَذَا الْفَرْضُ الْأَوَّلُ فِي صَلَاةِ الزَّوَالِ يَعْنِي صَلَاةَ الظُّهْرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibn Azina, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘What are these Hostile Ones (Nasibis) reporting?’ So I said, ‘May I be sacrificed for you<sup>asws</sup>! With regards to what?’ So he<sup>asws</sup> said: Regarding their <span class=\"iTxt\">Azans</span>, and their <span class=\"iTxt\">Rukū</span> and their <span class=\"iTxt\">Sajud (plural of Sajdah)</span>’. So I said, ‘They are saying that Abayy Bin Ka’ab saw it during the sleep (dream)’. So he<sup>asws</sup> said: ‘They are lying, for the Religion of Allah<sup>azwj</sup> Mighty and Majestic is more Honourable than for it to be seen during the sleep (dream)’.",
            "He (the narrator) said, ‘So Sudeyr Al-Sayrafi said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! So narrate to us a reminder of that’. So Abu Abdullah<sup>asws</sup> said: ‘When Allah<sup>azwj</sup> Mighty and Majestic Ascended His<sup>azwj</sup> Prophet<sup>saww</sup> to the seven skies, so as for the first of these, He<sup>azwj</sup> Blessed upon him<sup>saww</sup>, and (in) the second, Taught him<sup>saww</sup> his<sup>saww</sup> Obligations. So Allah<sup>azwj</sup> Sent down a carriage of Light wherein were forty varieties from the varieties of Light which engulf the Throne of Allah<sup>azwj</sup>, overwhelming the sights of the onlookers. ",
            "As for one of these, so it was yellow, and due to that is the yellowness of the yellow; and one of these was red, and due to that is the redness of the red; and one of these was white, and due to that is the whiteness of the white; and the remainder were upon the number of the rest of the creatures of light; and the colours in that carriage, the ring, and the chain were from silver.",
            "Then he<sup>saww</sup> was ascended with to the sky, so the Angels alienated towards the horizons of the sky and fell down in <span class=\"iTxt\">Sajdah</span> and said, ‘Glorious One! Holy One! How resembling is this light with the Light of our Lord<sup>azwj</sup>!’ So Jibraeel<sup>as</sup> said: ‘Allah<sup>azwj</sup> is the Greatest!’ Then the door of the sky were opened and the Angels gathered around. So they greeted upon the Prophet<sup>saww</sup> in droves, and said, ‘O Muhammad<sup>saww</sup>! How is your<sup>saww</sup> brother<sup>as</sup>? When you<sup>saww</sup> descend, so convey the greetings to him<sup>asws</sup>’. The Prophet<sup>saww</sup> said: ‘Do you all recognise him<sup>asws</sup>?’ They said, ‘And how can we not recognise him<sup>asws</sup>, and he<sup>asws</sup> has taken your<sup>saww</sup> Covenant and his<sup>saww</sup> own Covenant from us, and the Covenant of his<sup>asws</sup> Shias upon us up to the Day of Judgement, and we browse through the faces of his<sup>asws</sup> Shias five times during every day and night, meaning during every time for <span class=\"iTxt\">Salāt</span>, and we send Blessings upon you<sup>saww</sup> and upon him<sup>asws</sup>’. ",
            "He<sup>saww</sup> said: ‘Then my<sup>saww</sup> Lord<sup>azwj</sup> Increased for me<sup>saww</sup> forty types from the verities of the Light, non resembling the earlier Lights (Given to me<sup>saww</sup> before), and Increased me<sup>saww</sup> with a ring, and chain, and Ascended with me to the second sky. So when I<sup>saww</sup> was near to the door of the second sky, the Angels alienated towards the horizons of the sky and fell down in <span class=\"iTxt\">Sajdah</span>, and said: ‘Glorious One! Holy One! Lord<sup>azwj</sup> of the Angels and the Spirit! How resembling is this light with the Light of our Lord<sup>azwj</sup>!’ So Jibraeel<sup>as</sup> said: ‘I testify that there is no god except for Allah<sup>azwj</sup>’. So the Angels gathered around and said, ‘O Jibraeel<sup>as</sup>! Who is this one with you<sup>as</sup>?’ He<sup>as</sup> said: ‘This is Muhammad<sup>saww</sup>’. They said: ‘And he<sup>saww</sup> has (already) been sent (with the Prophet-hood)?’ He<sup>as</sup> said: ‘Yes’. ",
            "The Prophet<sup>saww</sup> said: ‘So they came out towards me<sup>saww</sup> resembling the swarms. So they greeted upon me<sup>saww</sup> and said: ‘Convey the greetings to your<sup>saww</sup> brother<sup>asws</sup>’. I<sup>saww</sup> said: ‘Do you all recognise him<sup>asws</sup>?’ They said: ‘How can we not recognise him<sup>asws</sup>, and he<sup>asws</sup> has taken your<sup>saww</sup> Covenant, and his<sup>asws</sup> own Covenant, and the Covenant of his<sup>asws</sup> Shias upon us up to the Day of Judgement, and we browse through the faces of the Shias five times during every day and night, meaning during every time for <span class=\"iTxt\">Salāt</span>’. ",
            "He<sup>saww</sup> said: ‘Then my<sup>saww</sup> Lord<sup>azwj</sup> Increased me with forty types from the varieties of the Light, non resembling the earlier Lights (Given to me<sup>saww</sup> before). Then I<sup>saww</sup> was ascended with to the third sky. So the Angels alienated and fell down <span class=\"iTxt\">Sajdah</span>, and said: ‘Glorious One! Holy One! Lord<sup>azwj</sup> of the Angels and the Spirit! What is this light which resembles the Light of our Lord<sup>azwj</sup>?’ So Jibraeel<sup>as</sup> said: ‘I<sup>as</sup> testify that Muhammad<sup>saww</sup> is Rasool-Allah<sup>saww</sup>! I<sup>as</sup> testify that Muhammad<sup>saww</sup> is Rasool-Allah<sup>saww</sup>! So the Angels gathered around and said: ‘Welcome to the first one! And welcome to the last one! And welcome to the Resurrector (of souls)! And welcome to the Publisher (of the deeds), Muhammad<sup>saww</sup>, the best of the Prophets<sup>as</sup>, and Ali<sup>asws</sup> the best of the successors<sup>as</sup>’. ",
            "The Prophet<sup>saww</sup> said: ‘Then they greeted upon me<sup>saww</sup> and asked me<sup>asws</sup> about my<sup>saww</sup> brother<sup>asws</sup>. I<sup>saww</sup> said: ‘He<sup>asws</sup> is in the earth. Do you all recognise him<sup>asws</sup>?’ They said: ‘And how can we not recognise him<sup>asws</sup> and we perform the Hajj of the Bayt Al-Mamour (The Oft-frequented House) every year, and upon it is a while Parchment wherein is the name of Muhammad<sup>saww</sup>, and name of Ali<sup>asws</sup>, and Al-Hassan<sup>asws</sup>, and Al-Husayn<sup>asws</sup>, and the Imams<sup>asws</sup>, and their<sup>asws</sup> Shias up to the Day of Judgement, and we Bless upon them five times during every day and night, during the time for every <span class=\"iTxt\">Salāt</span>, and we wipe their heads by their hands’ (while performing <span class=\"iTxt\">Wuzu</span>).",
            "He<sup>saww</sup> said: ‘Then my<sup>saww</sup> Lord<sup>azwj</sup> Increased for me forty types from the varieties of Light non resembling the earlier Lights (Given to me<sup>saww</sup> before). Then I<sup>saww</sup> was ascended with to the sky until I<sup>saww</sup> ended up to the fourth sky. Where the Angels were quiet, and I heard a vibration as if it is in the chests. So the Angels gathered around, and the doors of the sky were open, and they came out towards me<sup>saww</sup> resembling the hordes. So Jibraeel<sup>as</sup> said: ",
            "‘Hasten to the <span class=\"iTxt\">Salāt</span>! Hasten to the <span class=\"iTxt\">Salāt</span>! Hasten to the success! Hasten to the success!’. So the Angels said: ‘These two voices are paired and well-known’. So Jibraeel<sup>as</sup> said: ‘The <span class=\"iTxt\">Salāt</span> has been established! The <span class=\"iTxt\">Salāt</span> has been established!’ So the Angels said: ‘It is for his<sup>saww</sup> Shias up to the Day of Judgement’. ",
            "The Angels gathered around and said: ‘How did you<sup>saww</sup> leave your<sup>saww</sup> brother<sup>asws</sup>?’ So I<sup>saww</sup> said to them: ‘And you all recognise him<sup>asws</sup>?’ They said: ‘We recognise him<sup>asws</sup>, and his<sup>asws</sup> Shias when they were lights around the Throne of Allah<sup>azwj</sup>, and in the Bayt Al-Mamour (The Oft-Frequented House) is a Parchment of light wherein is writing of light, in which are names of Muhammad<sup>saww</sup>, and Ali<sup>asws</sup>, and Al-Hassan<sup>asws</sup>, and Al-Husayn<sup>asws</sup>, and the Imam<sup>asws</sup>, after the Imam<sup>asws</sup>, and their<sup>asws</sup> Shias up to the Day of Judgement. Neither is a man increased among them nor is a man reduced from them; and it is our Covenant which is read out to us every Friday’.",
            "Then it was Said to me<sup>saww</sup>: “O Muhammad<sup>saww</sup>! Raise your<sup>saww</sup> head!” So I<sup>saww</sup> raised my<sup>saww</sup> head, and there were the layers of the sky which had been pierced and the veils had been raised. Then He<sup>azwj</sup> Said to me<sup>saww</sup>: “Lower your<sup>saww</sup> head, look! What do you<sup>saww</sup> see?” So I<sup>saww</sup> lowered my<sup>saww</sup> head and looked at a house similar to these houses of yours, and a Sanctuary like the Sanctuary of this House (Kabah). If I<sup>saww</sup> had thrown something from my<sup>saww</sup> hand, it would not have fallen except upon it.",
            "So it was Said to me<sup>saww</sup>: “O Muhammad<sup>saww</sup>! This is the Sanctuary and you<sup>saww</sup> are the sanctimonious, and for every like there is a like”. Then Allah<sup>azwj</sup> Revealed unto me<sup>saww</sup>: “O Muhammad<sup>saww</sup>! Approach Sa’ad (a river) and wash your<sup>saww</sup> places of <span class=\"iTxt\">Sajdah</span>, and clean these, and pray <span class=\"iTxt\">Salāt</span> to your<sup>saww</sup> Lord<sup>azwj</sup>”. ",
            "So Rasool-Allah<sup>saww</sup> approached Sa’ad (a river), and it is water which flows from the right Pillar of the Throne. So Rasool-Allah<sup>saww</sup> scooped the water with his<sup>saww</sup> right hand, and due to that the <span class=\"iTxt\">Wuzu</span> came to be performed with the right hand.",
            "Then Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>saww</sup>: “Wash your<sup>saww</sup> face for you<sup>saww</sup> would be looking at My<sup>azwj</sup> Magnificence. Then wash your<sup>saww</sup> right arm and the left for you<sup>saww</sup> would be receiving My<sup>azwj</sup> Speech with your<sup>saww</sup> hands. Then wipe your head with the remnants of what remain in your hands from the water, and the feet up to your ankles, for I<sup>azwj</sup> would Bless upon you<sup>saww</sup>, and Make you<sup>saww</sup> to tread upon a place where not one had trod upon before apart from you”. Thus this is the reason for the <span class=\"iTxt\">Azan </span>and the <span class=\"iTxt\">Wuzu</span>’. ",
            "Then Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>saww</sup>: “O Muhammad<sup>saww</sup>! Face the Black Stone and exclaim My<sup>azwj</sup> Greatness upon the number of My<sup>azwj</sup> Veils”. So due to that, the exclamations of <span class=\"iTxt\">Takbīr’</span> came to be seven, because the Veils are seven. So he<sup>saww</sup> commenced at the intermission of the Veils, and due to that the commencement came to be a Sunnah; and the Veils are layered, there being oceans of Light between them, and that is the Light which descended unto Muhammad<sup>saww</sup>, and due to that, the commencement is three times because of the opening of the Veils three times. Thus the exclamations of the <span class=\"iTxt\">Takbīr’s</span> (altogether before commencement) came to be seven, and the commencement, three.",
            "So when you are free from the exclamations of <span class=\"iTxt\">Takbīr’</span> and the commencement, Allah<sup>azwj</sup> Revealed unto him<sup>saww</sup>: “Name Me<sup>azwj</sup> by My<sup>azwj</sup> Name”. So due to that, ‘In the Name of Allah<sup>azwj</sup> the Beneficent, the Merciful’ is in the first Chapter. Then Allah<sup>azwj</sup> Revealed unto him<sup>saww</sup>: “Praise Me<sup>azwj</sup>”. So when he<sup>saww</sup> said: ‘The Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds’, the Prophet<sup>saww</sup> said within himself<sup>saww</sup>: ‘Thanks’. So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>saww</sup>: “Now you discontinued speaking of Me<sup>azwj</sup>. Call Me<sup>azwj</sup> by My<sup>azwj</sup> Name”. So due to that ‘The Beneficent, the Merciful’ was Made to be twice in Al-Hamd (Chapter 1).",
            "So when he<sup>saww</sup> reached ‘nor of those who has strayed’, the Prophet<sup>saww</sup> said: ‘The Praise is for Allah<sup>azwj</sup> the Lord<sup>azwj</sup> of the worlds, thanks’. So Allah<sup>azwj</sup> Revealed unto him<sup>saww</sup>: “Revealed unto him<sup>saww</sup>: “Now you discontinued speaking of Me<sup>azwj</sup>. Call Me<sup>azwj</sup> by My<sup>azwj</sup> Name”. So due to that, ‘In the Name of Allah<sup>azwj</sup> the Beneficent, the Merciful was made to be in the first Chapter. ",
            "Then Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>saww</sup>: “Read, O Muhammad<sup>saww</sup>, a Relationship of your<sup>saww</sup> Lord<sup>azwj</sup> Blessed and High. Read <span class=\"ibTxt\"><a href=\"/#/books/quran:112#h1\">[112:1]</a> Say: He, Allah, is One. <a href=\"/#/books/quran:112#h2\">[112:2]</a> Allah is He on Whom all depend. <a href=\"/#/books/quran:112#h3\">[112:3]</a> He begets not, nor is He begotten. <a href=\"/#/books/quran:112#h4\">[112:4]</a> And none is like Him</span>”. Then the <span class=\"iTxt\">Wahi</span> (Revelation) was Withheld from him, so Rasool-Allah<sup>saww</sup> said: ‘The Alone, the One, the Depended’. So Allah<sup>azwj</sup> Revealed until him<sup>saww</sup>: “<span class=\"ibTxt\"><a href=\"/#/books/quran:112#h1\">[112:1]</a> Say: He, Allah, is One. <a href=\"/#/books/quran:112#h2\">[112:2]</a> Allah is He on Whom all depend. <a href=\"/#/books/quran:112#h3\">[112:3]</a> He begets not, nor is He begotten. <a href=\"/#/books/quran:112#h4\">[112:4]</a> And none is like Him</span>”. ",
            "Then the <span class=\"iTxt\">Wali </span>(Revelation) was Withheld from him<sup>saww</sup>, so Rasool-Allah<sup>saww</sup> said: ‘Like that is our Lord<sup>azwj</sup>! Like that is our Lord<sup>azwj</sup>!’. So when he<sup>saww</sup> said that, Allah<sup>azwj</sup> Revealed unto him<sup>saww</sup>: “Perform <span class=\"iTxt\">Rukū</span> to your<sup>saww</sup> Lord<sup>azwj</sup>, O Muhammad<sup>saww</sup>!” So he<sup>saww</sup> went down into <span class=\"iTxt\">Rukū</span>, and Allah<sup>azwj</sup> Revealed unto him<sup>saww</sup>: “Say Glorious is my<sup>saww</sup> Lord<sup>azwj</sup>, the Magnificent”. So he<sup>saww</sup> did that three (times). ",
            "Then Allah<sup>azwj</sup> Revealed unto him<sup>saww</sup>: “Raise your<sup>saww</sup> head, O Muhammad<sup>saww</sup>!” So Rasool-Allah<sup>saww</sup> stood upright and Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>saww</sup>: “ Perform <span class=\"iTxt\">Sajdah</span> to your<sup>saww</sup> Lord<sup>azwj</sup>, O Muhammad<sup>saww</sup>!” So Rasool-Allah<sup>saww</sup> fell down in <span class=\"iTxt\">Sajdah</span>, and Allah<sup>azwj</sup> Mighty and Majestic Revealed onto him<sup>saww</sup>: “Say: Glorious is my<sup>saww</sup> Lord<sup>azwj</sup>, the Exalted”. So he<sup>saww</sup> did that three (times). ",
            "Then Allah<sup>azwj</sup> Revealed unto him<sup>saww</sup>: “Sit upright, O Muhammad<sup>saww</sup>!” So he<sup>saww</sup> did. So when he<sup>saww</sup> raised his<sup>saww</sup> head from his <span class=\"iTxt\">Sajdah</span> and sat upright, he<sup>saww</sup> looked at His<sup>azwj</sup> Magnificence being Manifested to him<sup>saww</sup>, so he<sup>saww</sup> fell down in <span class=\"iTxt\">Sajdah</span> from his own self, not to a Command he<sup>saww</sup> been Commanded with, and he Glorified three (times) as well. So Allah<sup>azwj</sup> Revealed unto him<sup>as</sup>: “Stand upright!” So he<sup>saww</sup> did, but could not see what he<sup>saww</sup> had seen from the Magnificence. Thus, from the reason of that, the <span class=\"iTxt\">Salāt</span> came to be with one <span class=\"iTxt\">Rukū</span> and two <span class=\"iTxt\">Sajdud (plural of Sajdah)</span>.",
            "Then Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>saww</sup>: “Read the Praise for Allah<sup>azwj</sup>”. So he<sup>saww</sup> recited it similar to what he<sup>saww</sup> had recited firstly. Then Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him: “Read <span class=\"ibTxt\"><a href=\"/#/books/quran:97#h1\">[97:1]</a> We have indeed revealed it</span> (Chapter 97), for it is your<sup>saww</sup> relationship and the relationship of the People<sup>asws</sup> of your<sup>saww</sup> Household, up to the Day of Judgement”. And he<sup>saww</sup> did in the <span class=\"iTxt\">Rukū</span> the like of what he<sup>saww</sup> had done the first time. Then he went down (and performed) one <span class=\"iTxt\">Sajdah</span>. So when he<sup>saww</sup> raised his<sup>saww</sup> head, the Magnificence Manifested to him<sup>saww</sup>, so he<sup>saww</sup> fell down in <span class=\"iTxt\">Sajdah</span> from his<sup>saww</sup> own self, not to a Command he<sup>saww</sup> had been Commanded with. So he<sup>saww</sup> Glorified, as well. ",
            "Then Allah<sup>azwj</sup> Revealed unto him<sup>saww</sup>: “Raise your<sup>saww</sup> head, O Muhammad<sup>saww</sup>, your<sup>saww</sup> Lord<sup>azwj</sup> has Affirmed you<sup>saww</sup>”. So when he<sup>saww</sup> went on to stand, He<sup>azwj</sup> Said: “O Muhammad<sup>saww</sup>! Be seated”. So he<sup>saww</sup> sat, and Allah<sup>azwj</sup> Revealed unto him<sup>saww</sup>: “O Muhammad<sup>saww</sup>! Whenever I<sup>azwj</sup> Favour upon you<sup>saww</sup>, so Name Me<sup>azwj</sup> by My<sup>azwj</sup> Name”. So he<sup>saww</sup> was inspired that he<sup>saww</sup> should say: ‘In the Name of Allah<sup>azwj</sup>, and by Allah<sup>azwj</sup>, and there is no god except for Allah<sup>azwj</sup>, and the beautiful Names, all of them are for Allah<sup>azwj</sup>’. ",
            "Then Allah<sup>azwj</sup> Revealed unto him<sup>saww</sup>: “O Muhammad<sup>saww</sup>! Send Blessings upon yourself<sup>saww</sup> and upon the People<sup>asws</sup> of your<sup>saww</sup> Household”. So he<sup>saww</sup> said: ‘May Allah<sup>azwj</sup> Send Blessings upon me<sup>saww</sup> and upon the People<sup>asws</sup> of my<sup>saww</sup> Household’, and it had been done. Then he<sup>saww</sup> turned, and he<sup>saww</sup> was with rows of Angels, and the Mursil Prophets<sup>as</sup>, and the Prophets<sup>as</sup>. So it was said: “O Muhammad<sup>saww</sup>! Greet upon them!” So he<sup>saww</sup> said: ‘The greetings be upon you, and the Mercy of Allah<sup>azwj</sup> and His<sup>azwj</sup> Blessings’. ",
            "So Allah<sup>azwj</sup> Revealed unto him<sup>saww</sup>: “The greetings, and the salutation, and the Mercy, and the Blessings, are you<sup>saww</sup> and your<sup>saww</sup> children<sup>asws</sup>”.",
            "Then Allah<sup>azwj</sup> Revealed unto him<sup>saww</sup>: “Do not turn towards the left!”; and the first Verse he<sup>saww</sup> heard after <span class=\"ibTxt\"><a href=\"/#/books/quran:112#h1\">[112:1]</a> Say He Allah is One</span> (Chapter 112) and <span class=\"ibTxt\"><a href=\"/#/books/quran:97#h1\">[97:1]</a> We have indeed revealed it</span> (Chapter 97), was the Verse of the companions of the right and the companions of the left (Chapter 56).Thus, it was due to that, the <span class=\"iTxt\">Salām</span> is one with you facing the Qiblah, and due to that the exclamation of <span class=\"iTxt\">Takbīr’</span> in the <span class=\"iTxt\">Sajdah</span> is the thanks, and His<sup>azwj</sup> Words: “Allah<sup>azwj</sup> Hears the one who Praise Him<sup>azwj</sup>”, is because the Prophet<sup>saww</sup> heard the sounds of the Angels with the Glorifications, and the Praises, and the Extolation of Holiness. Thus, it was due to that He<sup>azwj</sup> Said: “Allah<sup>azwj</sup> Hears the one who Praises Him<sup>azwj</sup>; and it was due to that the first two Rak’at of <span class=\"iTxt\">Salāt</span> came to be such that every time your <span class=\"iTxt\">Wuzu</span> breaks in these two, it would be upon its performer that he repeats it. So this is the first necessity during <span class=\"iTxt\">Salāt</span> of midday, meaning <span class=\"iTxt\">Salāt </span>Al-Zohr’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ibn ’Udhaynah who has said the following: “Abu ’Abd Allah, ‘Alayhi al-Salam, asked me, ‘What does the enemy narrate?’ I then asked, ‘I pray to Allah to keep my soul in service for your cause, what kind of narration do you mean?’ He said, ‘It is about their Adhan, Ruku‘, and sajdah?’ I then said, ‘They say, “Ubay ibn Ka‘b has seen them in a dream.’” The Imam said, ‘They have spoken a lie. The religion of Allah, the Most Majestic, the Most Glorious, is by far more exalted than being seen in a dream.’ The narrator has said that Sadir al- Sayrafiy then said, ‘I pray to Allah to keep my soul in service for your cause, please enlighten us about it.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, then said, ‘When Allah, the most Majestic, the most Glorious, took His prophet for a journey to His seven heavens, in the first heaven He granted him blessing and in the second one He taught him his obligations. Allah sent down a carriage that was made of light with forty kinds of the kinds of light therein, surrounded by the Throne of Allah that covers the eyesight of the on-lookers. One of those lights is yellow from which yellowness is yellow. Another one is red because of which redness is red, yet another one is white because of which whiteness is white. The rest of them are like the number of the creatures in the form of light and colors. In that carriage, there are rings and chains of silver. Thereafter He took him up in the heaven. The angels moved in all directions of the heaven and fell down in prostration saying, “He is free of all defects and Most Holy. How similar is this light to the light of our Lord!”’ Jibril (Gabriel) then said, ‘Allah is greater than can be described, Allah is greater than can be described.’ Then the doors of the heaven opened, the angels gathered and saluted to the Holy Prophet in large groups saying, “O Muhammad, how is your brother? When you go back to earth tell that we salute him.” The Holy Prophet asked them, “Do you know him?” They replied, “How can we forget him. We were made (by Allah) to establish a covenant and commitment to (follow and) support him; support you and his followers until the Day of Judgment. We look on the faces of his followers five times every day - meaning thereby during the five times Salah (prayer). We say, ‘Allahumma Salli ‘Ala Muhammad wa ‘Ali Muhammad (O Allah grant Muhammad and his family a compensation worthy of their serving Your cause).”’ The Messenger of Allah thereafter has said, “Then my Lord granted me forty kinds of kinds of light of which no one resembled the ones given to me before. He gave me more rings and chains and took me to the second heaven. When I arrived near the second heaven’s door, the angels moved to all directions of the heaven and fell down in prostration saying, ‘Free of all defects and Most Holy is the Lord of the angels and the spirit. How similar is this light to the light of our Lord!’ Jibril then said, ‘I testify that no one, other than Allah, deserves to be worshipped.’ The angels then gathered asking, ‘O Jibril, who is this with you?’ He replied, ‘This is Muhammad.’ They then asked, ‘Is he already commissioned to serve as the Messenger of Allah?’ He replied, ‘Yes, he is commissioned.’” The Holy Prophet has said that they then came to me, welcoming with salutations and saying, “Tell your brother we salute him.” I asked them, “Do you know him?” They replied, “How can we forget him? We were made (by Allah) to establish a covenant and commitment to (follow and) support him; support you and his followers until the Day of Judgment. We look on the faces of his followers five times every day” - meaning thereby during the five times Salah (prayer). “The Messenger of Allah has said, “My Lord then gave me another forty kinds of the kinds of light of which no one was similar to the light given to me before, and increased the number of rings and chains. Then He took me up to the second heaven. The angels moved to all directions in the heaven and fell down in prostration saying, ‘Free of all defects and Most Holy is the Lord of the angels and the spirit. What is this light that is so similar to the light of our Lord?’ Jibril then said twice, ‘I testify that only Allah deserves worship. The angels gathered and said, ‘O Jibril, who is he with you?’ He (Jibril) replied, ‘He is Muhammad.’ They asked, ‘Is he commissioned (as messenger of Allah)?’ Jibril answered, ‘Yes, he is commissioned.’” The Holy prophet, has said, “They (angels) came to me as if wanting to hold me in their arms and saluted me and said, ‘Convey our salutations to you brother.’ I asked, ‘Do you know him?’ They replied, ‘Why we would not know him? We are made to establish a solemn covenant of support in your favor, in his favor and in favor of his followers until the Day of Judgment. We look at the faces of his followers five times every day and night.’ They meant thereby the times of each of five daily Salah (prayer).” The Messenger of Allah has said, “My Lord then gave me another forty kinds of the kinds of light of which no one was similar to the light given to me before. Then He took me up to the third heaven. The angels moved to all directions in the heaven and fell down in prostration saying, ‘Free of all defects and Most Holy is the Lord of the angels and the spirit. What is this light that is so similar to the light of our Lord?’ Jibril then said twice, ‘I testify that Muhammad is the Messenger of Allah.’ The angels all gathered and said, ‘Welcome, we greet you, O the first. Welcome, O the last, welcome, O the one who brings about resurrection and welcome the one who brings about distribution (distributor of heavens and hell (one of the title of Imam AJi)), Muhammad is the best of the prophets and Ali is the best of the executors of the wills of the prophets of Allah.’” “The Holy Prophet has said, “They then saluted me and asked about my brother and I said, ‘He is on earth. Do you know him?’ They replied, ‘How can we forget him? We every year perform Hajj of Bayt al-Ma‘mur where there is a white board on which there are the names of Muhammad, Ali, al-Hassan, al-Husayn, all A’immah and their followers till the Day of Judgment. We congratulate them every day and night five times’ - meaning thereby the five times Salah (prayer) - ‘and they wipe their heads with their hands.’” The Holy Prophet has said, “My Lord then increased the number of the kinds of lights for me by another forty kinds of light of which no one resembled the ones given to me before. He then took me higher until I reached the fourth heaven where the angels did not say anything. I heard a low intensity sound as if vibrating inside the chests. The angels then gathered, the doors of the heaven opened and they came to welcome me. Jibril then said, ‘Come for Salah (prayer), come for Salah (prayer). Come to wellbeing, come to wellbeing.’ The angels then said, ‘They are two very familiar sounds.’ Jibril then said, ‘Salah (prayer) is about to be performed, Salah (prayer) is about to be performed.’ The angels said, ‘It is for his followers until the Day of Judgment.’ The angels then gathered and asked, ‘How is your brother?’ I replied, ‘Do you know him?’ They replied, ‘We know him and his followers. They are lights around the Throne of Allah and in al-Bayt al-Ma‘mur, there is a board of light [on which there is a writing of light] and in this writing there are the names of Muhammad, Ali, al-Hassan, al-Husayn, all ’A’immah and their followers until the Day of Judgment from whom not even one man is increased or decreased. This (written document) is our covenant and a document of commitment which is read to us every Friday.’ Thereafter it was said to me, ‘Raise your head, O Muhammad.’ I raised my head, I saw the levels of the heaven opened up, and the curtains rose. I then was told, ‘Look downward.’ I looked downward and I saw a house like your house, this one, a sacred precinct like this holy precinct. If I were to drop something down from my hand, it would only fall on this house but not on another place. It then was said to me, ‘O Muhammad, this is the holy place and you are the Holy person; for every similitude there is something similar.’ Allah then sent Wahy to me, ‘O Muhammad go near the S’ ad (a fountain at the foot of the Throne) wash the parts of your body that are used during sajdah, cleanse them and perform Salah (prayer) for the sake of your Lord.’” The Messenger of Allah then went near the S’ ad, water that flows at the right foot of the Throne. The Messenger of Allah touched the water with his right hand and for this reason Wudu’ is with the right hand. Allah, the Most Majestic, the Most Glorious, then sent Wahy to him (Muhammad), “Wash your face; you look to My greatness, then wash your right arm and then your left arm; you receive My words (book) in your hand. Thereafter wipe your head with your hand while still moist with the water of Wudu’ and your feet up to your ankles; I like to bless you and allow you to step where no one, other than you, has ever stepped.” This is the reason for Adhan and Wudu’. Then Allah, the Most Majestic, the Most Glorious, sent Wahy to him, “O Muhammad, face the direction of the black-stone and speak of My greatness an equal number of times as the number of My curtains.” For this reason, the number of Takbir is seven, equal to the number of seven curtains. At the end of the curtains, he commenced Salah (prayer) and for this reason, commencement became a Sunnah (a noble tradition). The curtains are of parallel levels and in between every two level, there are oceans of light. This is the light, which Allah sent to Muhammad, O Allah grant compensation to Muhammad and his family worthy of their services to Your cause. For this reason, the number of (Takbir for) commencement is three because of the opening of the curtains three times. The number of Takbir, (altogether before commencement), are seven and the number of commencement three times. When he completed all Takbir and (takbir of) commencement, Allah sent him Wahy to call Him by His name and for this reason, the phrase “In the name of Allah, the Beneficent, the Merciful” is placed before every Chapter of the Holy Quran. Then Allah sent him Wahy to praise Him. When he said, “All praise belongs to Allah, Lord of the worlds,” the Holy Prophet to himself said, “My thanks (to Allah).” Allah, the Most Majestic, the Most Glorious, sent him Wahy saying, “You just discontinued My praise. Call Me by My name.” For this reason the phrase “most Beneficent, most Merciful” has come twice in al-Hamd (Chapter 1 of the Quran). When the Holy Prophet reached the last word in al-Hamd’ he said, “All praise belongs to Allah, Lord of the worlds and all thanks.” Allah then sent him Wahy, “You discontinued speaking of Me. Call Me by My name.” For this reason, at the beginning of every Chapter there is the phrase, “In the name of Allah, the Beneficent, the Merciful.” Thereafter Allah, the Most Majestic, the Most Glorious, sent him Wahy, “O Muhammad, read about the relationship of your Lord, the most Holy, the most High. “(I begin) in the Name of Allah, the Beneficent, the Merciful. <a href=\"/#/books/quran:112#h1\">[112:1]</a> (O Muhammad,) you must say, \"He is Allah, Who is one only <a href=\"/#/books/quran:112#h2\">[112:2]</a>. Allah is Absolute <a href=\"/#/books/quran:112#h3\">[112:3]</a>. He does not have any child nor is He a child of others <a href=\"/#/books/quran:112#h4\">[112:4]</a>. There is no one equal to Him. <a href=\"/#/books/quran:112#h5\">[112:5]</a>.” “Then Wahy was held back from him and the Messenger of Allah said, “One the only One who is self- sufficient.” Allah then sent him Wahy, “He does not have any child nor is He a child of others <a href=\"/#/books/quran:112#h4\">[112:4]</a>. There is no one equal to Him. <a href=\"/#/books/quran:112#h5\">[112:5]</a>.” Then Wahy was held back from him and the Messenger of Allah said, “Thus is Allah. Thus is Allah, our Lord.” When he said this Allah sent him Wahy, “Kneel down for Ruku‘ for the sake of your Lord, O Muhammad.” He knelt down for RukuL Allah then sent Wahy, while he was in Ruku‘ position, to say, “My Lord, the great, is free of all defects.” He said this three times, Then Allah sent him Wahy, “Raise your head, O Muhammad.” The Messenger of Allah did as he was told to do and stood up straight. Allah, the Most Majestic, the Most Glorious, sent Wahy, “Bow down in prostration for the sake of your Lord, O Muhammad.” The Messenger of Allah bowed down in prostration, then Allah, the Most Majestic, the Most Glorious, sent Wahy, say, “My Lord, the most High, is free of all defects.” He said it three times. Then Allah sent Wahy, “Sit upright, O Muhammad.” He did as he was told. When he sat upright he looked at (signs of) His greatness that appeared to him, then, on his own he bowed down in prostration without anyone’s command. He said three times, “Allah is free of all defects.” Allah then sent Wahy that said, “Stand up straight.” He obeyed but he did not see (of the signs) of greatness that had seen before and for this reason in Salah (prayer) every Rak‘at has one Ruku‘ and two sajdah. Allah, the Most Majestic, the Most Glorious, then sent Wahy, “Read All praise belong to Allah, Cherisher of the worlds” (the first Chapter of the Holy Quran) and he read as he had done before. Allah, the Most Majestic, the Most Glorious, then sent Wahy, “Read Chapter 97 of the Holy Quran; this Chapter speaks, of your relationship and the relationship of your family, until the Day of Judgment.” In Ruku‘ he did just as he had done before, then he did one sajdah. When he raised his head (signs of) greatness appeared to him, he then bowed down in prostration by his own choice, without anyone’s command and again he said, “Allah is free of all defects.” Allah sent Wahy, “Raise your head, O Muhammad, your Lord has made you steadfast.” When he wanted to stand up, he was told, “Sit down in your place, O Muhammad.” He then sat down. Allah sent Wahy, “O Muhammad, when I grant you a favor, you should call Me by My name.” He was inspired to say, “In the name of Allah, with (the help of) Allah, no one, other than Allah, deserves to be worshipped, and all beautiful names belong to Allah.” Then Allah sent Wahy, “O Muhammad, ask compensation for yourself and say, ‘ Allahumma Salli ‘Ala Muhammad wa ‘Ali Muhammad (O Allah grant Muhammad and his family a compensation worthy of their serving Your cause),”’ which he did as he was told. He then noticed rows of angels and messenger and prophets of Allah and it was said to him, “O Muhammad, salute them.” He then said, “I pray to Allah to grant you peace, mercy and blessings.” Allah then sent Wahy, “You and your descendants are the peace, salutations, mercy and blessing.” Allah then sent Wahy, “Do not pay any attention to the left.” The first verse that he heard after Chapter 112 and 97 of the Holy Quran was the verse about the people of the right hand and people of the left hand. For this reason one salutation is toward the direction of Qiblah and for this reason there is Shukr (expression of thanks) in sajdah for Takbir and his saying, “Allah listens to all those who praise Him” because the Holy Prophet heard a great deal of voices of angels saying al- Tasbih, al-Tahmid and al-Tahlil. For this reason he said, “Allah listens to all of those who praise Him.” For this reason, in the first and second Rak‘at if something invalidating Wudu’ takes place, one needs to perform them all over again. This is the first obligation in the prayer at noontime, that is, Salah (prayer) at noontime.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/480)"
        ],
        "index": 5659,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/18",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/568",
              "text": "رَبِيعِ بْنِ مُحَمَّدٍ الْمُسْلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/569",
              "text": "عَبْدِ اللَّهِ بْنِ سُلَيْمَانَ الْعَامِرِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ رَبِيعِ بْنِ مُحَمَّدٍ الْمُسْلِيِّ عَنْ عَبْدِ اللَّهِ بْنِ سُلَيْمَانَ الْعَامِرِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:100:2",
        "text": [
          " لَمَّا عُرِجَ بِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) نَزَلَ بِالصَّلَاةِ عَشْرَ رَكَعَاتٍ رَكْعَتَيْنِ رَكْعَتَيْنِ فَلَمَّا وُلِدَ الْحَسَنُ وَ الْحُسَيْنُ زَادَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) سَبْعَ رَكَعَاتٍ شُكْراً لِلَّهِ فَأَجَازَ اللَّهُ لَهُ ذَلِكَ وَ تَرَكَ الْفَجْرَ لَمْ يَزِدْ فِيهَا لِضِيقِ وَقْتِهَا لِأَنَّهُ تَحْضُرُهَا مَلَائِكَةُ اللَّيْلِ وَ مَلَائِكَةُ النَّهَارِ ",
          "فَلَمَّا أَمَرَهُ اللَّهُ بِالتَّقْصِيرِ فِي السَّفَرِ وَضَعَ عَنْ أُمَّتِهِ سِتَّ رَكَعَاتٍ وَ تَرَكَ الْمَغْرِبَ لَمْ يَنْقُصْ مِنْهَا شَيْئاً وَ إِنَّمَا يَجِبُ السَّهْوُ فِيمَا زَادَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَمَنْ شَكَّ فِي أَصْلِ الْفَرْضِ فِي الرَّكْعَتَيْنِ الْأَوَّلَتَيْنِ اسْتَقْبَلَ صَلَاتَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from one of our companions, from Ali Bin Al-Hakam, from Rabi’e Bin Muhammad Al-Muslay, from Abdullah Bin Suleyman Al-Aamiry, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When they ascended with Rasool-Allah<sup>saww</sup>, the <span class=\"iTxt\">Wahi</span> (Revelation) came with the <span class=\"iTxt\">Salāt</span> as being ten Rak’at - two Rak’at, two Rak’at (five times). So when (Ahl Al-Bayt<sup>asws</sup>) were Blessed with Al-Hassan<sup>asws</sup>and Al-Husayn<sup>asws</sup>, Rasool-Allah<sup>saww</sup> increased seven Rak’at as gratefulness to Allah<sup>azwj</sup>. So Allah<sup>azwj</sup> Allowed that for him<sup>saww</sup>; and he<sup>saww</sup> left Al-Fajr (as was) and did not increase in it due to the time constraint in it, because it is attended by the Angels of the night and the Angels of the day. ",
            "So when Allah<sup>azwj</sup> Commanded him<sup>saww</sup> with the reduction during the journey, he<sup>saww</sup> dropped six Rak’at for his<sup>saww</sup> community, and left Al-Maghrib as it was, not reducing anything from it; and rather, the omission can be whatever Rasool-Allah<sup>saww</sup> increased. Thus, the one who doubts in the original Obligation during the first two Rak’at, would re-commence his <span class=\"iTxt\">Salāt</span>’."
          ],
          "en.sarwar": [
            "2. Ali ibn Muhammad has narrated from certain individuals of our people from Ali ibn al-Hakam from Rabi’ ibn Muhammad al-Musliy from ’Abd Allah ibn Sulayman al-‘ Amiriy who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘When the Messenger of Allah was taken up (to heavens) he was commanded to perform Salah (prayer) and he returned with ten Rak‘at Salah (prayer) for every day. Each Salah (prayer) consisted of two Rak‘at. When al-Hassan and al-Husayn, ‘Alayhim al-Salam, were born, the Messenger of Allah increased seven more Rak‘at in thanksgiving to Allah and Allah granted him permission to do so. He did not increase anything to the Morning Salah (prayer) due to the short duration of its time in which time the angels of the night and day also attend it. When Allah commanded him to shorten Salah (prayer) while on a journey, he decreased six Rak‘at and did not decrease anything from Maghrib (soon after sunset) Salah (prayer). The rules of how to deal with mistakes in Salah (prayer) apply to the Rak‘at that was increased by the Messenger of Allah. Thus, if one faces doubts during the first and second Rak‘at, he has to redo his Salah (prayer) from the beginning.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/480)"
        ],
        "index": 5660,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/123",
              "text": "جَمِيلِ بْنِ دَرَّاجٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2758",
              "text": "عَائِذٍ الْأَحْمَسِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ عَائِذٍ الْأَحْمَسِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:100:3",
        "text": [
          " دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا أُرِيدُ أَنْ أَسْأَلَهُ عَنْ صَلَاةِ اللَّيْلِ فَقُلْتُ السَّلَامُ عَلَيْكَ يَا ابْنَ رَسُولِ اللَّهِ فَقَالَ وَ عَلَيْكَ السَّلَامُ إِي وَ اللَّهِ إِنَّا لَوُلْدُهُ وَ مَا نَحْنُ بِذَوِي قَرَابَتِهِ ثَلَاثَ مَرَّاتٍ قَالَهَا ثُمَّ قَالَ مِنْ غَيْرِ أَنْ أَسْأَلَهُ إِذَا لَقِيتَ اللَّهَ بِالصَّلَوَاتِ الْخَمْسِ الْمَفْرُوضَاتِ لَمْ يَسْأَلْكَ عَمَّا سِوَى ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel Bin Darraj, from Aiz Al-Ahmasy who said, ",
            "‘I went over to Abu Abdullah<sup>asws</sup> and I wanted to ask him<sup>asws</sup> about the night <span class=\"iTxt\">Salāt</span>. So I said, ‘The greetings be upon you<sup>asws</sup>, O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>!’ So he<sup>asws</sup> said: ‘And upon you be the greetings. Yes, by Allah<sup>azwj</sup>! I<sup>asws</sup> am indeed of his<sup>saww</sup> sons<sup>asws</sup>, and we<sup>asws</sup> are not with his<sup>saww</sup> relatives’ – three times he<sup>asws</sup> said it. Then he<sup>asws</sup> said without me asking him<sup>asws</sup>: ‘When you meet Allah<sup>azwj</sup> with (having prayed) the five Obligatory <span class=\"iTxt\">Salāt</span>s, He<sup>azwj</sup> would not ask you of besides that’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Jamil ibn Darraj from al-‘ Ai’dh af-Ahmasiy who has said the following: “Once I visited abu ’Abd Allah, and I wanted to ask him a question about Salah (prayer) during the night and I said, ‘You are a ‘Alayhi al-Salam, O son of the Messenger of Allah.’ The Imam said, ‘Wa ‘Alayka al-Salam, yes, by Allah, we are his sons, not of his other relatives.’ He said it three times. Then without any initiation from me he said, ‘If you come in the presence of Allah with five daily obligatory Salah (prayer), He will not ask you about anything other than these.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/481)"
        ],
        "index": 5661,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/339",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/720",
              "text": "أَبِي إِسْمَاعِيلَ السَّرَّاجِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/818",
              "text": "هَارُونَ بْنِ خَارِجَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ أَبِي إِسْمَاعِيلَ السَّرَّاجِ عَنْ هَارُونَ بْنِ خَارِجَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:100:4",
        "text": [
          " ذَكَرْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) رَجُلًا مِنْ أَصْحَابِنَا فَأَحْسَنْتُ عَلَيْهِ الثَّنَاءَ فَقَالَ لِي كَيْفَ صَلَاتُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Abu Ismai Al-Sarraj, from Haroun Bin Kharjat who said, ",
            "‘I mentioned to Abu Abdullah<sup>asws</sup>, a man from our companions, and I praised him well. So he<sup>asws</sup> said to me: ‘What is the status of his <span class=\"iTxt\">Salāt</span>?’"
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Isma’if from abu Isma’if af-Sarraj from Harun ibn Kharijah who has said the following: “Once I spoke before abu ‘Abd Allah, ‘Alayhi al-Salam, about a man of our people and I praised him well. The Imam asked, ‘How is his Salah (prayer)?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/481)"
        ],
        "index": 5662,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/964",
              "text": "مُحَمَّدِ بْنِ أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1014",
              "text": "السَّيَّارِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/185",
              "text": "الْفَضْلِ بْنِ أَبِي قُرَّةَ"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنِ السَّيَّارِيِّ عَنِ الْفَضْلِ بْنِ أَبِي قُرَّةَ رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:100:5",
        "text": [
          " سُئِلَ عَنِ الْخَمْسِينَ وَ الْوَاحِدِ رَكْعَةً فَقَالَ إِنَّ سَاعَاتِ النَّهَارِ اثْنَتَا عَشْرَةَ سَاعَةً وَ سَاعَاتِ اللَّيْلِ اثْنَتَا عَشْرَةَ سَاعَةً وَ مِنْ طُلُوعِ الْفَجْرِ إِلَى طُلُوعِ الشَّمْسِ سَاعَةٌ وَ مِنْ غُرُوبِ الشَّمْسِ إِلَى غُرُوبِ الشَّفَقِ غَسَقٌ وَ لِكُلِّ سَاعَةٍ رَكْعَتَانِ وَ لِلْغَسَقِ رَكْعَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Al-Sayyari, from Al-Fazl Bin Abu Qurra, raising it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘He<sup>asws</sup> was asked about the fifty one Rak’at (of daily <span class=\"iTxt\">Salāt</span>). So he<sup>asws</sup> said: ‘The hours of the day are twelve hours, and the hours of the night are twelve hours; and from the emergence of the dawn to the emergence of the sun is an hour, and from the setting of the sun to the setting of the twilight is darkness, and for every two hours are two Rak’at, and for the darkness, one Rak’at’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Muhammad ibn Ahmad from af-Sayyariy from af-Fadf ibn abu Qurrah in a in a marfu‘ manner who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, was asked about fifty-one Rak‘at Salah (prayer) daily. He replied, ‘There are twelve hours in the day and twelve in the night. There is one hour between dawn and sunrise. From sunset to disappearing of western brightness is darkness. For every hour there are two Rak‘at and one Rak‘at for darkness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/481)"
        ],
        "index": 5663,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ رَفَعَهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:100:6",
        "text": [
          " قِيلَ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) لِمَ صَارَ الرَّجُلُ يَنْحَرِفُ فِي الصَّلَاةِ إِلَى الْيَسَارِ فَقَالَ لِأَنَّ لِلْكَعْبَةِ سِتَّةَ حُدُودٍ أَرْبَعَةٌ مِنْهَا عَنْ يَسَارِكَ وَ اثْنَانِ مِنْهَا عَلَى يَمِينِكَ فَمِنْ أَجْلِ ذَلِكَ وَقَعَ التَّحْرِيفُ إِلَى الْيَسَارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, raising it, said, ",
            "‘It was said to Abu Abdullah<sup>asws</sup>, ‘Why did it become so that the man should be inclining towards the left during the <span class=\"iTxt\">Salāt</span>?’ So he<sup>asws</sup> said: ‘Because for the Kabah there are six limits (boundaries) – four of these are on your left, and two of these are upon your right. Thus, it is due to that, the inclination occurs towards the left’."
          ],
          "en.sarwar": [
            "6. Ali ibn Muhammad has narrated in a marfu‘ manner the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, was asked this question: ‘Why is man told to incline toward the left when facing the direction of Qiblah?’ He replied, ‘Ka’bah has six limits, four on the left and two on the right; for this reason inclination is toward the left.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/482)"
        ],
        "index": 5664,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/38",
              "text": "النَّوْفَلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/39",
              "text": "السَّكُونِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:100:7",
        "text": [
          " مَنْ تَنَفَّلَ مَا بَيْنَ الْجُمُعَةِ إِلَى الْجُمُعَةِ خَمْسَمِائَةِ رَكْعَةٍ فَلَهُ عِنْدَ اللَّهِ مَا شَاءَ إِلَّا أَنْ يَتَمَنَّى مُحَرَّماً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al-Nowfaly, from Al-Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who voluntarily prays five hundred Rak’at of <span class=\"iTxt\">Salāt</span> between the Friday to the (next) Friday, so for him, in the Presence of Allah<sup>azwj</sup>, would be whatever he so desires for, except if he were to covet a Prohibition’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father who has narrated from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that whoever performs five hundred Rak‘at optional Salah (prayer) from one Friday to the next Friday, he can ask Allah whatever he wants except a wish for unlawful matters.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/482)"
        ],
        "index": 5665,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/76",
              "text": "ابْنِ أَبِي نَجْرَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:100:8",
        "text": [
          " إِنَّ الْعَبْدَ يَقُومُ فَيَقْضِي النَّافِلَةَ فَيُعَجِّبُ الرَّبُّ مَلَائِكَتَهُ مِنْهُ فَيَقُولُ يَا مَلَائِكَتِي عَبْدِي يَقْضِي مَا لَمْ أَفْتَرِضْ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Abu Najran, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘If the servant stand to fulfil (outstanding) Optional <span class=\"iTxt\">Salāt</span>, so the Lord<sup>azwj</sup> is Astounded to His<sup>azwj</sup> Angels due to it, so He<sup>azwj</sup> is Saying: “O My<sup>azwj</sup> Angels! My<sup>azwj</sup> servant is fulfilling what I<sup>azwj</sup> did not Obligate upon him”’."
          ],
          "en.sarwar": [
            "8. A number of our people have narrated from Ahmad ibn Muhammad from ibn abu Najran from ‘Abd Allah ibn Sinan who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that a servant of Allah may rise to perform Qada’ (compensatory prayer for) an optional Salah (prayer) that was missed in its proper time. The Lord then expresses surprise before the angels saying, ‘My angels, look at My servant who makes up for the optional Salah (prayer) missed in time, when I have not even made it obligatory for him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/482)"
        ],
        "index": 5666,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/140",
              "text": "أَحْمَدَ بْنِ إِسْحَاقَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/141",
              "text": "سَعْدَانَ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ سَعْدَانَ بْنِ مُسْلِمٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:100:9",
        "text": [
          " شَرَفُ الْمُؤْمِنِ صَلَاتُهُ بِاللَّيْلِ وَ عِزُّ الْمُؤْمِنِ كَفُّهُ عَنْ أَعْرَاضِ النَّاسِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Is’haq, from Sa’dan Bin Muslim, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A nobility of the Believer is his <span class=\"iTxt\">Salāt</span> at night, and an honour of the Believer is his restraint from the vanities of the people’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Ahmad ibn Ishaq from Sa‘dan ibn Muslim from ‘Abd Allah ibn Sinan who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that nobility of a man is in his Salah (prayer) during the night and his honor is in his keeping away from unsettling people’s confidentiality.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/482)"
        ],
        "index": 5667,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/170",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/818",
              "text": "هَارُونَ بْنِ خَارِجَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ هَارُونَ بْنِ خَارِجَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:100:10",
        "text": [
          " الصَّلَاةُ وُكِّلَ بِهَا مَلَكٌ لَيْسَ لَهُ عَمَلٌ غَيْرُهَا فَإِذَا فُرِغَ مِنْهَا قَبَضَهَا ثُمَّ صَعِدَ بِهَا فَإِنْ كَانَتْ مِمَّا تُقْبَلُ قُبِلَتْ وَ إِنْ كَانَتْ مِمَّا لَا تُقْبَلُ قِيلَ لَهُ رُدَّهَا عَلَى عَبْدِي فَيَنْزِلُ بِهَا حَتَّى يَضْرِبَ بِهَا وَجْهَهُ ثُمَّ يَقُولُ أُفٍّ لَكَ مَا يَزَالُ لَكَ عَمَلٌ يَعْنِينِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al-Ashary, from Muhammad in Abdul Jabbar, from Safwan Bin Yahya, from Haroun Bin Kharjat, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The <span class=\"iTxt\">Salāt</span> is such that an Angel has been Allocated with it, not having any work for him apart from it. So when he (the one praying it) is free from it, he (the Angel) captures it, then ascends with it. So if it was from what is acceptable, it is Accepted, and if it was from what is not acceptable, it is said to him: ‘Return it to My<sup>azwj</sup> servant!. So he descend with it until he strikes with it upon his face, then he is saying: ‘Uff to you! You do not cease to produce (those) deeds which only tire me’."
          ],
          "en.sarwar": [
            "10. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from Harun ibn Kharijah who has said the following: “Abu ’Abd Allah, ‘Alayhi al-Salam, has said that for Salah (prayer) an angel is assigned and he has no other task to perform. When one completes a Salah (prayer), the angel takes it and ascends to heaven. If it is of the kind that is accepted, it then is accepted, but if it is of unacceptable kind, it then is said to him, ‘Return it to My servant.’ He then descends down with that Salah (prayer) and strikes it against his face saying, “Woe is upon you. You continue to have such deeds that make me tired.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/483)"
        ],
        "index": 5668,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/75",
              "text": "مُحَمَّدُ بْنُ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/51",
              "text": "جَعْفَرِ بْنِ مُحَمَّدٍ الْأَشْعَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/154",
              "text": "الْقَدَّاحِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الْأَشْعَرِيِّ عَنِ الْقَدَّاحِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:100:11",
        "text": [
          " جَاءَ رَجُلٌ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) فَقَالَ يَا رَسُولَ اللَّهِ أَوْصِنِي فَقَالَ لَا تَدَعِ الصَّلَاةَ مُتَعَمِّداً فَإِنَّ مَنْ تَرَكَهَا مُتَعَمِّداً فَقَدْ بَرِئَتْ مِنْهُ مِلَّةُ الْإِسْلَامِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al-Hassan, from Sahl Bin Ziyad, from Ja’far Bin Muhammad Al-Ashary, from Al-Qaddah, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A man came over to the Prophet<sup>saww</sup>, so he said, ‘O Rasool-Allah<sup>saww</sup>! Advise me’. So he<sup>saww</sup> said: ‘Do not leave the <span class=\"iTxt\">Salāt</span> deliberately, for the one who neglects it deliberately, so the nation of Al-Islam is disavowed from him’."
          ],
          "en.sarwar": [
            "11. Muhammad ibn al-Hassan has narrated from Sahl ibn Ziyad from Ja‘far ibn Muhammad al-Ash’ariy from al-Qaddah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that a man came to the Holy Prophet asking, ‘O Messenger of Allah, give me a good advice.’ He said, ‘You must not give up Salah (prayer) intentionally; the community of Islam is free from all obligations toward one who gives up Salah (prayer) intentionally.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/483)"
        ],
        "index": 5669,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/104",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/89",
              "text": "عَلِيِّ بْنِ أَسْبَاطٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2759",
              "text": "مُحَمَّدِ بْنِ عَلِيِّ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/351",
              "text": "أَبِي الْحَسَنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " فِي قَوْلِ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) فِي قَوْلِ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:100:12",
        "relations": {
          "Mentions": [
            "/books/quran:57:27"
          ]
        },
        "text": [
          " اللَّهِ عَزَّ وَ جَلَّ رَهْبانِيَّةً ابْتَدَعُوها ما كَتَبْناها عَلَيْهِمْ إِلَّا ابْتِغاءَ رِضْوانِ اللَّهِ قَالَ صَلَاةُ اللَّيْلِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al-Husayn, from Ali Bin Asbaar, from Muhammad Bin Ali Bin Abdullah, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:57#h27\">[57:27]</a> and (as for) monasticism, they innovated it - We did not prescribe it to them - only to seek Allah's pleasure</span>. He<sup>asws</sup> said: ‘The night <span class=\"iTxt\">Salāt</span>’."
          ],
          "en.sarwar": [
            "12. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Ali ibn Asbat from Muhammad ibn Ali ibn abu ‘Abd Allah from abu al-Hassan, ‘Alayhi al-Salam, who has said the following: “About the words of Allah, the Most Majestic, the Most Glorious, ‘They invented monkish manners, even though We had not made it obligatory on them, except to seek the pleasure of Allah’ (57: 26), the Imam said that it (pleasure of Allah) is a reference to Salah (prayer) during the night.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/484)"
        ],
        "index": 5670,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/104",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2760",
              "text": "بَعْضِ الطَّالِبِيِّينَ يُلَقَّبُ بِرَأْسِ الْمَدَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ بَعْضِ الطَّالِبِيِّينَ يُلَقَّبُ بِرَأْسِ الْمَدَرِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:100:13",
        "text": [
          " سَمِعْتُ الرِّضَا ( عليه السلام ) يَقُولُ أَفْضَلُ مَوْضِعِ الْقَدَمَيْنِ لِلصَّلَاةِ النَّعْلَانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Muhammad Bin Al-Husayn, from one of the students teknonymed as Rais Al-Madary who said, ",
            "‘I heard Al-Reza<sup>asws</sup> saying: ‘The best place for the two feet for the <span class=\"iTxt\">Salāt</span> is the two slippers’ (clean Arabic shoes)."
          ],
          "en.sarwar": [
            "13. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Muhammad ibn al-Husayn from certain individuals of Talibiyin, also called R’as al-Madariy who has said the following: “I heard abu al-Hassan al-Rida, ‘Alayhi al-Salam, say, ‘The best place for the feet, during Salah (prayer) is one’s shoes (clean Arabic shoes).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/484)"
        ],
        "index": 5671,
        "local_index": 14,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/181",
              "text": "جَابِرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:100:14",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِجَبْرَئِيلَ ( عليه السلام ) يَا جَبْرَئِيلُ أَيُّ الْبِقَاعِ أَحَبُّ إِلَى اللَّهِ عَزَّ وَ جَلَّ قَالَ الْمَسَاجِدُ وَ أَحَبُّ أَهْلِهَا إِلَى اللَّهِ أَوَّلُهُمْ دُخُولًا وَ آخِرُهُمْ خُرُوجاً مِنْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said to Jibraeel<sup>as</sup>: ‘O Jibraeel<sup>as</sup>! Which spot is the most Beloved to Allah<sup>azwj</sup> Mighty and Majestic?’ He<sup>as</sup> said: ‘The Masjid, and the most Beloved of its people to Allah<sup>azwj</sup> is the first of them to enter it and the last of them to exit from it’."
          ],
          "en.sarwar": [
            "14. A number of our people have narrated from Ahmad ibn Muhammad from ibn abu ‘Umayr from Jabir who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘The Messenger of Allah asked Jibril (Gabriel), “Which places are more beloved to Allah, the Most Majestic, the Most Glorious?” He replied, “It is Masjids and most beloved to Allah of its people are those who enter them first and leave last.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/484)"
        ],
        "index": 5672,
        "local_index": 15,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/621",
              "text": "مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/583",
              "text": "عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:100:15",
        "text": [
          " مَا مِنْ يَوْمِ سَحَابٍ يَخْفَى فِيهِ عَلَى النَّاسِ وَقْتُ الزَّوَالِ إِلَّا كَانَ مِنَ الْإِمَامِ لِلشَّمْسِ زَجْرَةٌ حَتَّى تَبْدُوَ فَيُحْتَجَّ عَلَى أَهْلِ كُلِّ قَرْيَةٍ مَنِ اهْتَمَّ بِصَلَاتِهِ وَ مَنْ ضَيَّعَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Muhammad Bin Al-Hassan Bin Shamoun, from Abdullah Bin Abdul Rahman, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There is none from a cloudy day during which the time of midday is concealed from the people, except that there would be a rebuke by the Imam<sup>asws</sup> to the sun until it appears, so it would be a proof upon the people of every town, the ones who attend its <span class=\"iTxt\">Salāt</span> and the ones who waste it’."
          ],
          "en.sarwar": [
            "15. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Muhammad ibn al-Hassan ibn Shammun from ‘Abd Allah ibn ‘Abd al- Rahman from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that even on cloudy days when the time for noon Salah (prayer) may remain obscure to people, the Imam knows about the sun. (He (the Imam) knows) what is unseen to people, so he always has the proof which town’s people pay attention to the timing of Salah (prayer) and which town’s people ignore it.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:4:100",
  "kind": "verse_list"
}