{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:3:4", "titles": {"ar": "كِتَابُ الصَّلَاةِ", "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "}}, {"indexed_titles": {"en": "Chapter 103"}, "path": "/books/al-kafi:3:4:103", "titles": {"ar": "باب مَسْجِدِ السَّهْلَةِ", "en": "Chapter 103 – Masjid Al-Sahla"}}], "index": 770, "local_index": 103, "part_type": "Chapter", "path": "/books/al-kafi:3:4:103", "titles": {"ar": "باب مَسْجِدِ السَّهْلَةِ", "en": "Chapter 103 – Masjid Al-Sahla"}, "verse_count": 3, "verse_start_index": 5684, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 5685, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:4:103:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ أَبِي دَاوُدَ عَنْ عَبْدِ اللَّهِ بْنِ أَبَانٍ قَالَ دَخَلْنَا عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَسَأَلَنَا أَ فِيكُمْ أَحَدٌ عِنْدَهُ عِلْمُ عَمِّي زَيْدِ بْنِ عَلِيٍّ فَقَالَ رَجُلٌ مِنَ الْقَوْمِ أَنَا عِنْدِي عِلْمٌ مِنْ عِلْمِ عَمِّكَ كُنَّا عِنْدَهُ ذَاتَ لَيْلَةٍ فِي دَارِ مُعَاوِيَةَ بْنِ إِسْحَاقَ الْأَنْصَارِيِّ إِذْ قَالَ انْطَلِقُوا بِنَا نُصَلِّي فِي مَسْجِدِ السَّهْلَةِ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ فَعَلَ فَقَالَ لَا جَاءَهُ أَمْرٌ فَشَغَلَهُ عَنِ الذَّهَابِ ", "فَقَالَ أَمَا وَ اللَّهِ لَوْ أَعَاذَ اللَّهَ بِهِ حَوْلًا لَأَعَاذَهُ أَ مَا عَلِمْتَ أَنَّهُ مَوْضِعُ بَيْتِ إِدْرِيسَ النَّبِيِّ ( عليه السلام ) وَ الَّذِي كَانَ يَخِيطُ فِيهِ وَ مِنْهُ سَارَ إِبْرَاهِيمُ ( عليه السلام ) إِلَى الْيَمَنِ بِالْعَمَالِقَةِ وَ مِنْهُ سَارَ دَاوُدُ إِلَى جَالُوتَ وَ إِنَّ فِيهِ لَصَخْرَةً خَضْرَاءَ فِيهَا مِثَالُ كُلِّ نَبِيٍّ وَ مِنْ تَحْتِ تِلْكَ الصَّخْرَةِ أُخِذَتْ طِينَةُ كُلِّ نَبِيٍّ وَ إِنَّهُ لَمُنَاخُ الرَّاكِبِ قِيلَ وَ مَنِ الرَّاكِبُ قَالَ الْخَضِرُ ( عليه السلام )."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Ahmad Bin Abu Dawood, from Abdullah Bin Aban who said, ", "‘We went over to Abu Abdullah<sup>asws</sup>, so he<sup>asws</sup> asked us: ‘Is there anyone among you who has knowledge with him of my<sup>asws</sup> uncle Ziyad Bin Ali?’ So a man from the group said, ‘I do. With me is knowledge from the knowledge of your<sup>asws</sup> uncle. We were with him one night by the door of Muawiya Bin Is’haq Al-Ansary when he said, ‘Come with me so that we pray <span class=\"iTxt\">Salāt</span> in Masjid Al-Sahla’. So Abu Abdullah<sup>asws</sup> said: ‘And did he?’ So he said, ‘No. A matter came up, so it pre-occupied him from the going’. ", "So he<sup>asws</sup> said: ‘But, by Allah<sup>azwj</sup>! Had he sought refuge with Allah<sup>azwj</sup> with it for a year, He<sup>azwj</sup> would have Sheltered him. But, do you not know that it is the place of the house of Idrees<sup>as</sup> the Prophet<sup>as</sup>, and in which he<sup>as</sup> used to sew? And from it did Ibrahim<sup>as</sup> go to Al-Yemen with Al-Amaaliqa, and from it did Dawood<sup>as</sup> go against Goliath; and that in it is the green stone in which is a resemblance of every Prophet<sup>as</sup>; and it is from beneath that very stone the clay of every Prophet<sup>as</sup> was taken, and it is a disembarkation of the rider’. It was said, ‘And who is the rider?’ He<sup>asws</sup> said: ‘Al-Khizr<sup>as</sup>’."]}}, {"index": 5686, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:4:103:2", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ عَلِيِّ بْنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ عُثْمَانَ عَنْ صَالِحِ بْنِ أَبِي الْأَسْوَدِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ ذَكَرَ مَسْجِدَ السَّهْلَةِ فَقَالَ أَمَا إِنَّهُ مَنْزِلُ صَاحِبِنَا إِذَا قَامَ بِأَهْلِهِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ali Bin Al-Hassan Bin Ali, from Usman, from Salih Bin Abu Aswad who said, ", "‘Abu Abdullah<sup>asws</sup> said, and Masjid Al-Sahla was mentioned, he<sup>asws</sup> said: ‘But, it would an encampment for our<sup>asws</sup> companions (Al-Qaim<sup>asws</sup>) when he<sup>asws</sup> arises with his<sup>asws</sup> people’."]}}, {"index": 5687, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:4:103:3", "text": ["عَنْهُ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ حُسَيْنِ بْنِ بَكْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعِيدٍ الْخَزَّازِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ بِالْكُوفَةِ مَسْجِدٌ يُقَالُ لَهُ مَسْجِدُ السَّهْلَةِ لَوْ أَنَّ عَمِّي زَيْداً أَتَاهُ فَصَلَّى فِيهِ وَ اسْتَجَارَ اللَّهَ لَأَجَارَهُ عِشْرِينَ سَنَةً فِيهِ مُنَاخُ الرَّاكِبِ وَ بَيْتُ إِدْرِيسَ النَّبِيِّ ( عليه السلام ) وَ مَا أَتَاهُ مَكْرُوبٌ قَطُّ فَصَلَّى فِيهِ بَيْنَ الْعِشَاءَيْنِ وَ دَعَا اللَّهَ إِلَّا فَرَّجَ اللَّهُ كُرْبَتَهُ .", "وَ رُوِيَ أَنَّ مَسْجِدَ السَّهْلَةِ حَدُّهُ إِلَى الرَّوْحَاءِ ."], "translations": {"en.hubeali": ["From him, from Amro Bin Usman, from Husayn Bin Bakr, from Abdul Rahman Bin Saeed Al-Khazzaz, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘In Al-Kufa there is a Masjid called Masjid Al-Sahla. Had my<sup>asws</sup> uncle Zayd gone over to it and prayed <span class=\"iTxt\">Salāt</span> therein and sought the Shelter of Allah<sup>azwj</sup>, He<sup>azwj</sup> would have Sheltered him for twenty years. In it is a disembarkation of the rider (Prophet Khizr<sup>as</sup>), and a house of Idrees<sup>as</sup>, the Prophet<sup>as</sup>; and not worried one would come over to it at all and pray <span class=\"iTxt\">Salāt</span> therein between the two Isha (<span class=\"iTxt\">Salāt</span>s), and supplicate to Allah<sup>azwj</sup>, except that Allah<sup>azwj</sup> would Relieve him from his worries’.", "And it is reported that Masjid Al-Sahla, its boundary it up to Al-Rawha."]}}]}, "index": "al-kafi:3:4:103", "kind": "verse_list"}