{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:3:4:12",
        "titles": {
          "ar": "باب مَنْ نَامَ عَنِ الصَّلَاةِ أَوْ سَهَا عَنْهَا",
          "en": "Chapter 12 – The one who sleeps through the Salāt, or forgets about it"
        }
      }
    ],
    "index": 679,
    "local_index": 12,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:3:4:13",
        "titles": {
          "ar": "باب بِنَاءِ مَسْجِدِ النَّبِيِّ ص",
          "en": "Chapter 13 – Construction of Masjid of the Prophet<sup>saww</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 11"
        },
        "path": "/books/al-kafi:3:4:11",
        "titles": {
          "ar": "باب التَّطَوُّعِ فِي وَقْتِ الْفَرِيضَةِ وَ السَّاعَاتِ الَّتِي لَا يُصَلَّى فِيهَا",
          "en": "Chapter 11 – The Optional Salāt during the time of the Obligatory (Salāts), and the timings in which you cannot pray these"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:4:12",
    "titles": {
      "ar": "باب مَنْ نَامَ عَنِ الصَّلَاةِ أَوْ سَهَا عَنْهَا",
      "en": "Chapter 12 – The one who sleeps through the Salāt, or forgets about it"
    },
    "verse_count": 9,
    "verse_start_index": 4871,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/59)"
        ],
        "index": 4872,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/339",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/132",
              "text": "حَمَّادِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/190",
              "text": "حَرِيزٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/191",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:12:1",
        "text": [
          " إِذَا نَسِيتَ صَلَاةً أَوْ صَلَّيْتَهَا بِغَيْرِ وُضُوءٍ وَ كَانَ عَلَيْكَ قَضَاءُ صَلَوَاتٍ فَابْدَأْ بِأَوَّلِهِنَّ فَأَذِّنْ لَهَا وَ أَقِمْ ثُمَّ صَلِّهَا ثُمَّ صَلِّ مَا بَعْدَهَا بِإِقَامَةٍ إِقَامَةٍ لِكُلِّ صَلَاةٍ ",
          "وَ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) وَ إِنْ كُنْتَ قَدْ صَلَّيْتَ الظُّهْرَ وَ قَدْ فَاتَتْكَ الْغَدَاةُ فَذَكَرْتَهَا فَصَلِّ الْغَدَاةَ أَيَّ سَاعَةٍ ذَكَرْتَهَا وَ لَوْ بَعْدَ الْعَصْرِ وَ مَتَى مَا ذَكَرْتَ صَلَاةً فَاتَتْكَ صَلَّيْتَهَا",
          "وَ قَالَ إِنْ نَسِيتَ الظُّهْرَ حَتَّى صَلَّيْتَ الْعَصْرَ فَذَكَرْتَهَا وَ أَنْتَ فِي الصَّلَاةِ أَوْ بَعْدَ فَرَاغِكَ فَانْوِهَا الْأُولَى ثُمَّ صَلِّ الْعَصْرَ فَإِنَّمَا هِيَ أَرْبَعٌ مَكَانَ أَرْبَعٍ فَإِنْ ذَكَرْتَ أَنَّكَ لَمْ تُصَلِّ الْأُولَى وَ أَنْتَ فِي صَلَاةِ الْعَصْرِ وَ قَدْ صَلَّيْتَ مِنْهَا رَكْعَتَيْنِ فَانْوِهَا الْأُولَى ثُمَّ صَلِّ الرَّكْعَتَيْنِ الْبَاقِيَتَيْنِ وَ قُمْ فَصَلِّ الْعَصْرَ",
          "وَ إِنْ كُنْتَ قَدْ ذَكَرْتَ أَنَّكَ لَمْ تُصَلِّ الْعَصْرَ حَتَّى دَخَلَ وَقْتُ الْمَغْرِبِ وَ لَمْ تَخَفْ فَوْتَهَا فَصَلِّ الْعَصْرَ ثُمَّ صَلِّ الْمَغْرِبَ وَ إِنْ كُنْتَ قَدْ صَلَّيْتَ الْمَغْرِبَ فَقُمْ فَصَلِّ الْعَصْرَ وَ إِنْ كُنْتَ قَدْ صَلَّيْتَ مِنَ الْمَغْرِبِ رَكْعَتَيْنِ ثُمَّ ذَكَرْتَ الْعَصْرَ فَانْوِهَا الْعَصْرَ ثُمَّ قُمْ فَأَتِمَّهَا رَكْعَتَيْنِ ثُمَّ سَلِّمْ ثُمَّ تُصَلِّي الْمَغْرِبَ ",
          "فَإِنْ كُنْتَ قَدْ صَلَّيْتَ الْعِشَاءَ الْآخِرَةَ وَ نَسِيتَ الْمَغْرِبَ فَقُمْ فَصَلِّ الْمَغْرِبَ وَ إِنْ كُنْتَ ذَكَرْتَهَا وَ قَدْ صَلَّيْتَ مِنَ الْعِشَاءِ الْآخِرَةِ رَكْعَتَيْنِ أَوْ قُمْتَ فِي الثَّالِثَةِ فَانْوِهَا الْمَغْرِبَ ثُمَّ سَلِّمْ ثُمَّ قُمْ فَصَلِّ الْعِشَاءَ الْآخِرَةَ",
          "وَ إِنْ كُنْتَ قَدْ نَسِيتَ الْعِشَاءَ الْآخِرَةَ حَتَّى صَلَّيْتَ الْفَجْرَ فَصَلِّ الْعِشَاءَ الْآخِرَةَ وَ إِنْ كُنْتَ ذَكَرْتَهَا وَ أَنْتَ فِي رَكْعَةِ الْأُولَى أَوْ فِي الثَّانِيَةِ مِنَ الْغَدَاةِ فَانْوِهَا الْعِشَاءَ ثُمَّ قُمْ فَصَلِّ الْغَدَاةَ وَ أَذِّنْ وَ أَقِمْ",
          "وَ إِنْ كَانَتِ الْمَغْرِبُ وَ الْعِشَاءُ الْآخِرَةُ قَدْ فَاتَتَاكَ جَمِيعاً فَابْدَأْ بِهِمَا قَبْلَ أَنْ تُصَلِّيَ الْغَدَاةَ ابْدَأْ بِالْمَغْرِبِ ثُمَّ الْعِشَاءِ الْآخِرَةِ فَإِنْ خَشِيتَ أَنْ تَفُوتَكَ الْغَدَاةُ إِنْ بَدَأْتَ بِهِمَا فَابْدَأْ بِالْمَغْرِبِ ثُمَّ بِالْغَدَاةِ ثُمَّ صَلِّ الْعِشَاءَ فَإِنْ خَشِيتَ أَنْ تَفُوتَكَ الْغَدَاةُ إِنْ بَدَأْتَ بِالْمَغْرِبِ فَصَلِّ الْغَدَاةَ ثُمَّ صَلِّ الْمَغْرِبَ وَ الْعِشَاءَ ابْدَأْ بِأَوَّلِهِمَا لِأَنَّهُمَا جَمِيعاً قَضَاءٌ أَيَّهُمَا ذَكَرْتَ فَلَا تُصَلِّهِمَا إِلَّا بَعْدَ شُعَاعِ الشَّمْسِ ",
          "قَالَ قُلْتُ لِمَ ذَاكَ قَالَ لِأَنَّكَ لَسْتَ تَخَافُ فَوْتَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter character-a\">A</span>li Bin Ibrahim, from</span> his father and Miuhammad Bin Ismail, from Al Faszl Bin ShAzan, altogether from Hammad Bin Isa, from Hareyz, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘If you forget a <span class=\"iTxt\">Salāt</span> or your pray it without <span class=\"iTxt\">Wuzu</span> (an ablution), and there are outstanding <span class=\"iTxt\">Salāts</span> upon you, so begin with the first of these. So recite an Azan for it and an <span class=\"iTxt\">Iqamah</span>, then pray it. Then pray whatever is after it with an <span class=\"iTxt\">Iqamah</span>, an <span class=\"iTxt\">Iqamah</span> for each <span class=\"iTxt\">Salāt</span>’. ",
            "And he (the narrator) said, ‘And Abu Ja’far<sup>asws</sup> said: ‘And you have already prayed Al-Zohr and the morning <span class=\"iTxt\">Salāt</span> has been missed by you, and you remember it, so pray the morning <span class=\"iTxt\">Salāt</span> whichever time you remember it, and even though it may be after Al-Asr; and whenever you remember a <span class=\"iTxt\">Salāt</span> having been missed out, pray it’. ",
            "And he<sup>asws</sup> said: ‘If you forget Al-Zohr until you have prayed Al-Asr, so you remember it while you are in the <span class=\"iTxt\">Salāt</span>, or your being free from it, so intend it first, then pray Al-Asr, for rather it is four (<span class=\"iTxt\">Rak’at</span>) in place of four (<span class=\"iTxt\">Rak’at</span>). So if you remember that you did not pray the first one and you are in <span class=\"iTxt\">Salāt</span> Al-Asr, and you have already prayed two <span class=\"iTxt\">Rak’at</span> from it, so intend it as the first one, then pray the two remaining <span class=\"iTxt\">Rak’at</span>, and stand and pray Al-Asr.",
            "And if (you) remember that you did not pray Al-Asr until the time for Al-Maghrib enters, and you do not fear missing it, so pray Al-Asr, then pray Al-Maghrib. And if you had already prayed Al-Maghrib, so stand and pray Al-Asr. And if you had already prayed two <span class=\"iTxt\">Rak’at</span> from Al-Maghrib, then you remember Al-Asr, so intend it as Al-Asr, then stand and complete it with two <span class=\"iTxt\">Rak’at</span>, then greet (<span class=\"iTxt\">Salām</span>), then pray Al-Maghrib. ",
            "So if you already prayed Al-Isha the last, and forgot Al-Maghrib, so stand and pray Al-Maghrib. And if you remembered it and you have already prayed two <span class=\"iTxt\">Rak’at</span> from the Al-Isha the last, or are standing during the third (<span class=\"iTxt\">Rak’at</span>), so intend it as Al-Maghrib, then greet (<span class=\"iTxt\">Salām</span>), then stand and pray Al-Isha the last.",
            "And if you forgot Al-Isha the last until you prayed Al-Fajr, so pray Al-Isha the last. So if you remember it while you are in the first <span class=\"iTxt\">Rak’at</span> or during the second one from the morning (<span class=\"iTxt\">Salāt</span>), so intend it as Al-Isha, then stand and pray the morning (<span class=\"iTxt\">Salāt</span>), and recite an Azan and an <span class=\"iTxt\">Iqamah</span>. ",
            "And if Al-Maghrib and Al-Isha the last had been missed out on together, so begin with these two before you pray the morning (<span class=\"iTxt\">Salāt</span>). Begin with Al-Maghrib, then Al-Isha the last. So if you were to fear that you would be missing the morning (<span class=\"iTxt\">Salāt</span>) if you were to begin with these two, so begin with Al-Maghrib, then with the morning, then pray Al-Isha. So if you were to fear that you would be missing the morning (<span class=\"iTxt\">Salāt</span>) if you were to begin with Al-Maghrib, so pray the morning (<span class=\"iTxt\">Salāt</span>), then pray Al-Maghrib and Al-Isha. Begin with the first of the two, because they are both outstanding, whichever of the two you remember, so do not pray these two except after the rays of the sun’. ",
            "He (the narrator) said, ‘I said, ‘Why is that so?’ He<sup>asws</sup> said: ‘Because you are not fearing it being missed out on’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from and Muhammad ibn ’Isma‘il from al-Fadl ibn Shadhan all from Hammad ibn ‘Isa from Hariz from Zurarah who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘If you forget to perform Salah (prayer) or perform it without Wudu’ and miss Salah (prayers) which you must perform, begin with what is first. Say Adhan and ’Iqamah, then perform it, thereafter perform what is after this with just ‘Iqamah for every Salah (prayer).’ Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘If you have already performed al-Dhuhr, then remembered that you have missed the morning Salah (prayer), perform the morning Salah (prayer) in whatever hour you remember even if it is after al-‘Asr. Whenever you remember a Salah (prayer) that you have missed, perform it.’ Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘If you forget to perform al-Dhuhr until you perform al-‘Asr, then remember in the middle of Salah (prayer) or after you complete a Salah (prayer) consider it the first one (al-Dhuhr which is missed). Then perform al-‘Asr; it is a four Rak‘at in place of another four Rak‘at. If you remember that you have not performed the first one and you are in the middle of al-‘Asr from which you have performed only two Rak‘at consider it the first (al-Dhuhr), then perform the two remaining Rak‘at. Then stand up and perform al-‘Asr. If you remember that you have not performed al-‘Asr until it is time of al-Maghrib and you are not afraid of running short of its time, perform al-‘Asr, thereafter perform al-Maghrib. If you have performed al-Maghrib, stand up to perform al-‘Asr. If you have performed two Rak‘at of al-Maghrib, then you remember that you have missed al-‘Asr; consider it al-‘Asr then complete it with another two Rak‘at, say Salam and thereafter perform al-Maghrib. If you have performed al-‘Isha’ al-Akhirah, but you have forgotten al-Maghrib, stand up to perform al-Maghrib. If you remember when you have performed two Rak‘at of al-‘Isha’ al-Akhirah or you just have stood up for the third Rak‘at, consider it al-Maghrib then say Salam and thereafter perform al-‘Isha’ al-Akhirah. If you forget al-‘Isha’ al-Akhirah until you perform the morning Salah (prayer), perform al-‘Isha’ al-Akhirah thereafter. If you remember in the first Rak‘at or in the second Rak‘at of the morning Salah (prayer), consider it al-‘Isha’, thereafter perform the morning Salah (prayer), say Adhan and ‘Iqamah. If both al-Maghrib and al-‘Isha’ al-Akhirah are missed, begin with these ones first before the morning Salah (prayer), first al-Maghrib and then al-‘Isha’ al-Akhirah. If you are afraid of the running short of the time of the morning Salah (prayer) if you perform the two first, begin with al-Maghrib, then morning Salah (prayer), then al-‘Isha’. If you are afraid of running short of the time of the morning Salah (prayer), if you begin with al-Maghrib, begin with the morning Salah (prayer) then al-Maghrib and al-‘Isha’. Begin with the first one because it is a Qada’ (make-up for). Start whichever you want. You must not perform except after the rising of sun rays.’ I (the narrator) then asked, ‘Why is that?’ He (the Imam) said, ‘Because you are not afraid of missing them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/62)"
        ],
        "index": 4873,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/31",
              "text": "مُحَمَّدِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/217",
              "text": "ابْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:12:2",
        "text": [
          " سَأَلْتُهُ عَنْ رَجُلٍ نَسِيَ الظُّهْرَ حَتَّى دَخَلَ وَقْتُ الْعَصْرِ قَالَ يَبْدَأُ بِالظُّهْرِ وَ كَذَلِكَ الصَّلَوَاتُ تَبْدَأُ بِالَّتِي نَسِيتَ إِلَّا أَنْ تَخَافَ أَنْ يَخْرُجَ وَقْتُ الصَّلَاةِ فَتَبْدَأُ بِالَّتِي أَنْتَ فِي وَقْتِهَا ثُمَّ تُصَلِّي الَّتِي نَسِيتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Muhammad Bin Sinan, from Ibn Muskaan, from Abu Baseer who said, ",
            "‘I asked him<sup>asws</sup> about a man who forgets Al-Zohr until the time for Al-Asr enters. He<sup>asws</sup> said: ‘He should begin with Al-Zohr; and similar to that, the <span class=\"iTxt\">Salāt</span> to begin with is that which you forgot except if you fear upon the time for the <span class=\"iTxt\">Salāt</span> expiring, so you should begin with that which you are within its timing, then pray that which you forgot’."
          ],
          "en.sarwar": [
            "2. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Muhammad ibn Sinan from ibn Muskan from abu Basir from who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about a man who forgets al-Dhuhr until it is time of al-‘Asr. He (the Imam) said, ‘He begins with al-Dhuhr and so also one begins with Salah (prayer) which is forgotten, unless one is afraid of the running short of the time of Salah (prayer), in which case one begins with that for which there is still time, thereafter performs what one has forgotten.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/62)"
        ],
        "index": 4874,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/260",
              "text": "ابْنِ أُذَيْنَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/191",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:12:3",
        "text": [
          "هُ سُئِلَ عَنْ رَجُلٍ صَلَّى بِغَيْرِ طَهُورٍ أَوْ نَسِيَ صَلَوَاتٍ لَمْ يُصَلِّهَا أَوْ نَامَ عَنْهَا فَقَالَ يَقْضِيهَا إِذَا ذَكَرَهَا فِي أَيِّ سَاعَةٍ ذَكَرَهَا مِنْ لَيْلٍ أَوْ نَهَارٍ فَإِذَا دَخَلَ وَقْتُ الصَّلَاةِ وَ لَمْ يُتِمَّ مَا قَدْ فَاتَهُ فَلْيَقْضِ مَا لَمْ يَتَخَوَّفْ أَنْ يَذْهَبَ وَقْتُ هَذِهِ الصَّلَاةِ الَّتِي قَدْ حَضَرَتْ وَ هَذِهِ أَحَقُّ بِوَقْتِهَا فَلْيُصَلِّهَا فَإِذَا قَضَاهَا فَلْيُصَلِّ مَا فَاتَهُ مِمَّا قَدْ مَضَى وَ لَا يَتَطَوَّعْ بِرَكْعَةٍ حَتَّى يَقْضِيَ الْفَرِيضَةَ كُلَّهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibn Azina, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having been asked about a man who prayed <span class=\"iTxt\">Salāt</span> without cleanliness, or forgot a <span class=\"iTxt\">Salāt</span>, not having prayed it, or slept during its (time). So he<sup>asws</sup> said: ‘He should fulfil it when he remembers it, whichever time he remembers it, be it from the night or day. So when the time for the (current) <span class=\"iTxt\">Salāt</span> enters and he has not completed what he had missed out on, so let him fulfil what he is not fearing the departure of this present <span class=\"iTxt\">Salāt</span>, and it is more deserving with its timing. Therefore, let him fulfil this. So when he has fulfilled it, so let him pray what had been missed out on from what has passed, and he should not perform an Optional (<span class=\"iTxt\">Salāt</span>) by (even) on <span class=\"iTxt\">Rak’at</span>, until he has fulfilled the Obligatory ones, all of them’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ibn ’Udhaynah from Zurarah who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, was once asked about a man who performs Salah (prayer) without Tahur (cleansing) or forgets it (Salah (prayer)) or goes to sleep. He (the Imam) said, ’He performs its Qada’ (compensatory prayer) in whatever hour he remembers during the night or day. If the time for a Salah (prayer) comes and he has not yet completed what he was to perform as Qada’ (compensatory prayer) he completes what he is to do unless is afraid of running short of the time of Salah (prayer) of present time. Such Salah (prayer) is of greater priority in matters of its time thus, he performs it and when this is complete, he performs that which was missed in the past, and he does not perform any optional Salah (prayer) even one Rak’at, until completion of all obligatory ones.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/63)"
        ],
        "index": 4875,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/129",
              "text": "مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/464",
              "text": "الْقَاسِمِ بْنِ عُرْوَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/267",
              "text": "عُبَيْدِ بْنِ زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ وَ مُحَمَّدِ بْنِ خَالِدٍ جَمِيعاً عَنِ الْقَاسِمِ بْنِ عُرْوَةَ عَنْ عُبَيْدِ بْنِ زُرَارَةَ عَنْ أَبِيهِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:12:4",
        "relations": {
          "Mentions": [
            "/books/quran:20:14"
          ]
        },
        "text": [
          " إِذَا فَاتَتْكَ صَلَاةٌ فَذَكَرْتَهَا فِي وَقْتِ أُخْرَى فَإِنْ كُنْتَ تَعْلَمُ أَنَّكَ إِذَا صَلَّيْتَ الَّتِي فَاتَتْكَ كُنْتَ مِنَ الْأُخْرَى فِي وَقْتٍ فَابْدَأْ بِالَّتِي فَاتَتْكَ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ أَقِمِ الصَّلاةَ لِذِكْرِي وَ إِنْ كُنْتَ تَعْلَمُ أَنَّكَ إِذَا صَلَّيْتَ الَّتِي فَاتَتْكَ فَاتَتْكَ الَّتِي بَعْدَهَا فَابْدَأْ بِالَّتِي أَنْتَ فِي وَقْتِهَا فَصَلِّهَا ثُمَّ أَقِمِ الْأُخْرَى ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed and Muhammad Bin Khalid, altogether from Al Qasim Bin Urwa, from Ubeyd Bin Zurara, from his father, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘So when a <span class=\"iTxt\">Salāt</span> is missed out by you and you remember it during another time, so if you know that if you were to pray that which is missed out, you would still be within the time, so begin by that which was missed out by you, for Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:20#h14\">[20:14]</a> and establish the Prayer for My Remembrance</span>. And if you were to know that if you were to pray that which was missed out by you, the one after it would be missed out by you, so begin by which you are within its timing. So pray it, then establish the other one’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id and Muhammad ibn Khalid all from al- Qasim ibn ‘Urwah from ‘Ubayd ibn Zurarah from his father who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has sad, ’You may miss a Salah (prayer) and remember it in another time. If you think you can perform Qada’ (compensatory prayer) for the one missed when there is still enough time left to perform the present Salah (prayer), begin to do so. Allah, most Majestic, most Glorious, says, “Perform Salah (prayer) to remember (speak of) Me” but if you know that with performing Qada’ (compensatory prayer) for what you have missed, the time for the present one will end, then begin with the present Salah (prayer). Thereafter perform Qada’ (compensatory prayer) for the one missed in the past.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/64)"
        ],
        "index": 4876,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/145",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/62",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/63",
              "text": "الْوَشَّاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/257",
              "text": "أَبَانِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/785",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:12:5",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ نَسِيَ صَلَاةً حَتَّى دَخَلَ وَقْتُ صَلَاةٍ أُخْرَى فَقَالَ إِذَا نَسِيَ الصَّلَاةَ أَوْ نَامَ عَنْهَا صَلَّى حِينَ يَذْكُرُهَا فَإِذَا ذَكَرَهَا وَ هُوَ فِي صَلَاةٍ بَدَأَ بِالَّتِي نَسِيَ وَ إِنْ ذَكَرَهَا مَعَ إِمَامٍ فِي صَلَاةِ الْمَغْرِبِ أَتَمَّهَا بِرَكْعَةٍ ثُمَّ صَلَّى الْمَغْرِبَ ثُمَّ صَلَّى الْعَتَمَةَ بَعْدَهَا وَ إِنْ كَانَ صَلَّى الْعَتَمَةَ وَحْدَهُ فَصَلَّى مِنْهَا رَكْعَتَيْنِ ثُمَّ ذَكَرَ أَنَّهُ نَسِيَ الْمَغْرِبَ أَتَمَّهَا بِرَكْعَةٍ فَيَكُونُ صَلَاةُ الْمَغْرِبِ ثَلَاثَ رَكَعَاتٍ ثُمَّ يُصَلِّي الْعَتَمَةَ بَعْدَ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad Al Ashary, from Moalla Bin Muhammad, from Al Washa, from Aban Bin Usman, from Abdul Rahman Bin Abu Abdullah who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who forgot a <span class=\"iTxt\">Salāt</span> until the time for another <span class=\"iTxt\">Salāt</span> entered. So he<sup>asws</sup> said: ‘When he forgets the <span class=\"iTxt\">Salāt</span>, or sleeps over it, he should pray when he remembers it. So when he remembers it, and he is during a <span class=\"iTxt\">Salāt</span>, he should begin by that which he forgot. And if he were to remember it with a prayer leader during Al-Maghrib <span class=\"iTxt\">Salāt</span>, he should complete it by one <span class=\"iTxt\">Rak’at</span>, then pray Al-Maghrib, then pray Al-Isha after it. And if he had already prayed Al-Isha alone, so he had prayed two <span class=\"iTxt\">Rak’at</span> from it, then remembers that he had forgotten Al-Maghrib, she should complete it with one <span class=\"iTxt\">Rak’at</span>, so Al-Maghrib <span class=\"iTxt\">Salāt</span> would happen to be of three <span class=\"iTxt\">Rak’at</span>. Then he should pray Al-Isha after that’."
          ],
          "en.sarwar": [
            "5. Al-Husayn ibn Muhammad has narrated from Muhammad al-Ash’ariy from Mu‘alla’ ibn Muhammad from al-Washsha’ from Aban ibn ‘Uthman from ‘Abd al- Rahman ibn abu ‘Abd Allah who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who has forgotten a Salah (prayer) until the time for next Salah (prayer). He (the Imam) said, ‘If one misses a Salah (prayer) because of forgetting or sleep, he must perform it as soon as he remembers. If he remembers it during performing another Salah (prayer), he begins with that which is forgotten. If he remembers while performing Salah (prayer) of al-Maghrib behind an Imam, he completes it with an additional Rak’at, thereafter performs al-Maghrib and then al-‘Atmah, (al-Tsha 5 al-Akhirah) thereafter. If he is performing al-’Atmah alone and two Rak’at of it are complete when he remembers that he has forgotten al-Maghrib, he completes it with one more Rak’at to finish its three Rak’at for al-Maghrib, then performs al-’Atmah thereafter.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/64)"
        ],
        "index": 4877,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/121",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/170",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/351",
              "text": "أَبِي الْحَسَنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:12:6",
        "text": [
          " سَأَلْتُهُ عَنْ رَجُلٍ نَسِيَ الظُّهْرَ حَتَّى غَرَبَتِ الشَّمْسُ وَ قَدْ كَانَ صَلَّى الْعَصْرَ فَقَالَ كَانَ أَبُو جَعْفَرٍ ( عليه السلام ) أَوْ كَانَ أَبِي ( عليه السلام ) يَقُولُ إِنْ أَمْكَنَهُ أَنْ يُصَلِّيَهَا قَبْلَ أَنْ يَفُوتَهُ الْمَغْرِبُ بَدَأَ بِهَا وَ إِلَّا صَلَّى الْمَغْرِبَ ثُمَّ صَلَّاهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin ShAzan, from Safwan Bin Yahya, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who forgot Al-Zohr until the sun set, and he had prayed Al-Asr. So he<sup>asws</sup> said: ‘Abu Ja’far<sup>asws</sup>’, or said: ‘My<sup>asws</sup> father<sup>asws</sup> was saying that if you are able to pray it before missing out on Al-Maghrib, begin with it, or else pray Al-Maghrib, then pray it (Al-Zohr)’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about a man who forgets al-Dhuhr until it is sunset and has performed al-‘Asr. He (the Imam) said, ‘Abu Ja’far, ‘Alayhi al-Salam, or my father would say, “If he can perform Qada’ (compensatory prayer) for it before the time for al-Maghrib ends, he must do so, otherwise, he performs al-Maghrib then Qada’ (compensatory prayer) for that which is missed.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/64)"
        ],
        "index": 4878,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/300",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/168",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:12:7",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ أَمَّ قَوْماً فِي الْعَصْرِ فَذَكَرَ وَ هُوَ يُصَلِّي أَنَّهُ لَمْ يَكُنْ صَلَّى الْأُولَى قَالَ فَلْيَجْعَلْهَا الْأُولَى الَّتِي فَاتَتْهُ وَ لْيَسْتَأْنِفْ بَعْدُ صَلَاةَ الْعَصْرِ وَ قَدْ مَضَى الْقَوْمُ بِصَلَاتِهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man leading a group in Al-Asr <span class=\"iTxt\">Salāt</span>, so he remembers while he is praying that he had not prayed the former <span class=\"iTxt\">Salāt</span>. He<sup>asws</sup> said: ‘So let him make it to be the former which had been missed out, and let him resume after Al-Asr <span class=\"iTxt\">Salāt</span>, and the people proceeded with their <span class=\"iTxt\">Salāts</span>’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from ibn abu ‘ Umayr from Hammad from al-Halabiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who leads people for al-‘Asr, then he remembers during Salah (prayer) that he has not performed the one before. He (the Imam) said, ‘He considers it (Salah (prayer) he is performing) as the one before which is missed and thereafter perform al-‘Asr again and the people proceed with their Salah (prayer).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/65)"
        ],
        "index": 4879,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/300",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/190",
              "text": "حَرِيزٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/191",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/502",
              "text": "الْفُضَيْلِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " فِي قَوْلِ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ زُرَارَةَ وَ الْفُضَيْلِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:12:8",
        "relations": {
          "Mentions": [
            "/books/quran:4:103"
          ]
        },
        "text": [
          " اللَّهِ تَبَارَكَ اسْمُهُ إِنَّ الصَّلاةَ كانَتْ عَلَى الْمُؤْمِنِينَ كِتاباً مَوْقُوتاً قَالَ يَعْنِي مَفْرُوضاً وَ لَيْسَ يَعْنِي وَقْتَ فَوْتِهَا إِذَا جَازَ ذَلِكَ الْوَقْتُ ثُمَّ صَلَّاهَا لَمْ تَكُنْ صَلَاتُهُ هَذِهِ مُؤَدَّاةً وَ لَوْ كَانَ ذَلِكَ لَهَلَكَ سُلَيْمَانُ بْنُ دَاوُدَ ( عليه السلام ) حِينَ صَلَّاهَا لِغَيْرِ وَقْتِهَا وَ لَكِنَّهُ مَتَى مَا ذَكَرَهَا صَلَّاهَا ",
          "قَالَ ثُمَّ قَالَ وَ مَتَى اسْتَيْقَنْتَ أَوْ شَكَكْتَ فِي وَقْتِهَا أَنَّكَ لَمْ تُصَلِّهَا أَوْ فِي وَقْتِ فَوْتِهَا أَنَّكَ لَمْ تُصَلِّهَا صَلَّيْتَهَا فَإِنْ شَكَكْتَ بَعْدَ مَا خَرَجَ وَقْتُ الْفَوْتِ فَقَدْ دَخَلَ حَائِلٌ فَلَا إِعَادَةَ عَلَيْكَ مِنْ شَكٍّ حَتَّى تَسْتَيْقِنَ فَإِنِ اسْتَيْقَنْتَ فَعَلَيْكَ أَنْ تُصَلِّيَهَا فِي أَيِّ حَالٍ كُنْتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Hareyz, from Zurara and Al Fuzayl, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup>, Blessed is His<sup>azwj</sup> Name <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h103\">[4:103]</a> surely prayer is a timed ordinance upon the Believers</span>. He<sup>asws</sup> said: ‘It Means Obligatory and does not mean a time being missed out. When that timing is exceeded, then he prays, his <span class=\"iTxt\">Salāt</span> would not happen to be rendered. And had it been for that, Suleyman<sup>as</sup> Bin Dawood<sup>as</sup> would have been destroyed when he<sup>as</sup> prayed it during other than its time. But, when he<sup>as</sup> remembered it, prayed it’. ",
            "He (the narrator) said, ‘Then he<sup>asws</sup> said: ‘When you are convinced or doubt with regards to its timing that you have not prayed it, or you are within a timing of it being missed out, that you did not pray it, pray it. So if you were to doubt after the expiry of the time of it being missed out on, so an obstacle has entered. Therefore there is no repeating upon you from a doubt until you are convinced. So if you are convinced, then upon you is that you pray it in whichever state you were’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ‘Uthman ibn ‘Isa from Sama‘ah ibn Mehran who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about a man who forgets to perform the morning Salah (prayer) until it is sunrise. He (the Imam) said, ’He performs it whenever he remembers. The Messenger of Allah remained sleeping during the time for the morning Salah (prayer) until sunrise, then he performed it Qada’ (compensatory prayer) when he woke up but moved away from his place, then performed Salah (prayer).’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/65)"
        ],
        "index": 4880,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/201",
              "text": "عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/113",
              "text": "حَدَّثَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " فِي"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَمَّنْ حَدَّثَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:12:9",
        "text": [
          " رَجُلٍ نَامَ عَنِ الْعَتَمَةِ فَلَمْ يَقُمْ إِلَّا بَعْدَ انْتِصَافِ اللَّيْلِ قَالَ يُصَلِّيهَا وَ يُصْبِحُ صَائِماً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira, from the one who narrated it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who slept through the Isha <span class=\"iTxt\">Salāt</span>. So he did not arise until after midnight. He<sup>asws</sup> said: ‘He should pray it and Fast till the morning’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Nu‘man from Sa‘id al-‘Araj who has said the following: “I once heard abu ’Abd Allah, ‘Alayhi al-Salam, say, ‘The Messenger of Allah remained sleeping during the time of the morning Salah (prayer) and Allah, most Majestic, most Glorious, made him to remain sleeping until sunrise and this was a blessing from Him for the people. Consider, when one remains sleeping until sunrise, people reproach him saying, “You do not avoid sins in matters of Salah (prayer).” This became a Sunnah, tradition and guideline. If one man says to another man, “You remained sleeping during the time of Salah (prayer), he can respond saying, ‘the Messenger of Allah also remained sleeping.’” Thus, it became a Sunnah and guideline and a blessing, which Allah, most Glorious, granted this nation.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/66)"
        ],
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/456",
              "text": "10ـ عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/300",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/190",
              "text": "حَرِيزٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2591",
              "text": "زُرَارَةَ وَالْفُضَيْلِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2592",
              "text": "أَبِي جَعْفَرٍ (عَلَيْهِ الْسَّلام)"
            },
            {
              "kind": "plain",
              "text": " فِي قَوْلِ"
            }
          ],
          "text": "10ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ زُرَارَةَ وَالْفُضَيْلِ عَنْ أَبِي جَعْفَرٍ (عَلَيْهِ الْسَّلام) فِي قَوْلِ"
        },
        "part_type": "Hadith",
        "relations": {
          "Mentions": [
            "/books/quran:4:103"
          ]
        },
        "text": [
          " الله تَبَارَكَ اسْمُهُ إِنَّ الصَّلاةَ كانَتْ عَلَى الْمُؤْمِنِينَ كِتاباً مَوْقُوتاً قَالَ يَعْنِي مَفْرُوضاً وَلَيْسَ يَعْنِي وَقْتَ فَوْتِهَا إِذَا جَازَ ذَلِكَ الْوَقْتُ ثُمَّ صَلاَّهَا لَمْ تَكُنْ صَلاَتُهُ هَذِهِ مُؤَدَّاةً وَلَوْ كَانَ ذَلِكَ لَهَلَكَ سُلَيْمَانُ بْنُ دَاوُدَ (عَلَيْهِما الْسَّلام) حِينَ صَلاَّهَا لِغَيْرِ وَقْتِهَا وَلَكِنَّهُ مَتَى مَا ذَكَرَهَا صَلاَّهَا قَالَ ثُمَّ قَالَ وَمَتَى اسْتَيْقَنْتَ أَوْ شَكَكْتَ فِي وَقْتِهَا أَنَّكَ لَمْ تُصَلِّهَا أَوْ فِي وَقْتِ فَوْتِهَا أَنَّكَ لَمْ تُصَلِّهَا صَلَّيْتَهَا فَإِنْ شَكَكْتَ بَعْدَ مَا خَرَجَ وَقْتُ الْفَوْتِ فَقَدْ دَخَلَ حَائِلٌ فَلاَ إِعَادَةَ عَلَيْكَ مِنْ شَكٍّ حَتَّى تَسْتَيْقِنَ فَإِنِ اسْتَيْقَنْتَ فَعَلَيْكَ أَنْ تُصَلِّيَهَا فِي أَيِّ حَالٍ كُنْتَ."
        ],
        "translations": {
          "en.sarwar": [
            "10. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from Hariz from Zurarah and Fudayl who has said the following: “This is about the words of Allah, most Blessed is whose name, ‘Salah (prayer) was written as obligatory upon people.’ <a href=\"/#/books/quran:4#h103\">[4:103]</a> Abu Ja’far, ‘Alayhi al-Salam, has said, ‘It means that it was obligatory, not that it is obligatory for a limited time so that if it is performed after the limited time, it does not fulfill the obligation. Had it been so Sulayman son of Dawud would have been destroyed when he performed his Salah (prayer) in a time, which was other than the time of that Salah (prayer). However, he performed when he remembered.’ He (the Imam) then said, ‘If you are certain or have doubts in its time that you did not perform, you must perform it again. If you face a doubt after its time has ended, there has an obstacle come into existence, so a repeat is not required from you because of doubt, unless you are certain. If you become certain you must perform in whatever condition you are.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/67)"
        ],
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2593",
              "text": "11ـ عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2594",
              "text": "عَبْدِ الله بْنِ الْمُغِيرَةِ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/113",
              "text": "حَدَّثَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2595",
              "text": "أَبِي عَبْدِ الله (عَلَيْهِ الْسَّلام)"
            },
            {
              "kind": "plain",
              "text": " فِي"
            }
          ],
          "text": "11ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ الله بْنِ الْمُغِيرَةِ عَمَّنْ حَدَّثَهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ الْسَّلام) فِي"
        },
        "part_type": "Hadith",
        "text": [
          " رَجُلٍ نَامَ عَنِ الْعَتَمَةِ فَلَمْ يَقُمْ إِلاَّ بَعْدَ انْتِصَافِ اللَّيْلِ قَالَ يُصَلِّيهَا وَيُصْبِحُ صَائِماً. "
        ],
        "translations": {
          "en.sarwar": [
            "11. Ali ibn Ibrahim has narrated from his father from ‘Abd Allah ibn al-Mughirah from those who m he has mentioned who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who remains sleeping during the time of al-‘Atmah and does not wake up until after midnight. He (the Imam) said, ‘He performs that Salah (prayer) and remains fasting until the morning.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:4:12",
  "kind": "verse_list"
}