{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:3:4:13",
        "titles": {
          "ar": "باب بِنَاءِ مَسْجِدِ النَّبِيِّ ص",
          "en": "Chapter 13 – Construction of Masjid of the Prophet<sup>saww</sup>"
        }
      }
    ],
    "index": 680,
    "local_index": 13,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:3:4:14",
        "titles": {
          "ar": "باب مَا يَسْتَتِرُ بِهِ الْمُصَلِّي مِمَّنْ يَمُرُّ بَيْنَ يَدَيْهِ",
          "en": "Chapter 14 – What the praying one can veil with from the ones who are passing in front of him"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:3:4:12",
        "titles": {
          "ar": "باب مَنْ نَامَ عَنِ الصَّلَاةِ أَوْ سَهَا عَنْهَا",
          "en": "Chapter 12 – The one who sleeps through the Salāt, or forgets about it"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:4:13",
    "titles": {
      "ar": "باب بِنَاءِ مَسْجِدِ النَّبِيِّ ص",
      "en": "Chapter 13 – Construction of Masjid of the Prophet<sup>saww</sup>"
    },
    "verse_count": 3,
    "verse_start_index": 4880,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/67)"
        ],
        "index": 4881,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/77",
              "text": "مُحَمَّدُ بْنُ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/251",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/206",
              "text": "عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:13:1",
        "text": [
          " سَمِعْتُهُ يَقُولُ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) بَنَى مَسْجِدَهُ بِالسَّمِيطِ ثُمَّ إِنَّ الْمُسْلِمِينَ كَثُرُوا فَقَالُوا يَا رَسُولَ اللَّهِ لَوْ أَمَرْتَ بِالْمَسْجِدِ فَزِيدَ فِيهِ فَقَالَ نَعَمْ ",
          "فَأَمَرَ بِهِ فَزِيدَ فِيهِ وَ بَنَاهُ بِالسَّعِيدَةِ ثُمَّ إِنَّ الْمُسْلِمِينَ كَثُرُوا فَقَالُوا يَا رَسُولَ اللَّهِ لَوْ أَمَرْتَ بِالْمَسْجِدِ فَزِيدَ فِيهِ فَقَالَ نَعَمْ فَأَمَرَ بِهِ فَزِيدَ فِيهِ وَ بَنَى جِدَارَهُ بِالْأُنْثَى وَ الذَّكَرِ ثُمَّ اشْتَدَّ عَلَيْهِمُ الْحَرُّ فَقَالُوا يَا رَسُولَ اللَّهِ لَوْ أَمَرْتَ بِالْمَسْجِدِ فَظُلِّلَ فَقَالَ نَعَمْ ",
          "فَأَمَرَ بِهِ فَأُقِيمَتْ فِيهِ سَوَارٍ مِنْ جُذُوعِ النَّخْلِ ثُمَّ طُرِحَتْ عَلَيْهِ الْعَوَارِضُ وَ الْخَصَفُ وَ الْإِذْخِرُ فَعَاشُوا فِيهِ حَتَّى أَصَابَتْهُمُ الْأَمْطَارُ فَجَعَلَ الْمَسْجِدُ يَكِفُ عَلَيْهِمْ فَقَالُوا يَا رَسُولَ اللَّهِ لَوْ أَمَرْتَ بِالْمَسْجِدِ فَطُيِّنَ فَقَالَ لَهُمْ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَا عَرِيشٌ كَعَرِيشِ مُوسَى ( عليه السلام )",
          "فَلَمْ يَزَلْ كَذَلِكَ حَتَّى قُبِضَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ كَانَ جِدَارُهُ قَبْلَ أَنْ يُظَلَّلَ قَامَةً فَكَانَ إِذَا كَانَ الْفَيْ‏ءُ ذِرَاعاً وَ هُوَ قَدْرُ مَرْبِضِ عَنْزٍ صَلَّى الظُّهْرَ وَ إِذَا كَانَ ضِعْفَ ذَلِكَ صَلَّى الْعَصْرَ ",
          "وَ قَالَ السَّمِيطُ لَبِنَةٌ لَبِنَةٌ وَ السَّعِيدَةُ لَبِنَةٌ وَ نِصْفٌ وَ الذَّكَرُ وَ الْأُنْثَى لَبِنَتَانِ مُخَالِفَتَانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad and Muhammad Bin Al Hassan, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, and Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘Rasool-Allah<sup>saww</sup>, his<sup>saww</sup> Masjid was built in <span class=\"iTxt\">Al-Sameyt</span> manner (brick by brick). Then the Muslims became numerous, so they said, ‘O Rasool-Allah<sup>saww</sup>! If only you<sup>saww</sup> would order with the Masjid so there would be an increase in it’. So he<sup>saww</sup> said: ‘Yes’. ",
            "So he<sup>saww</sup> ordered with it, and there was an increase in it, and it was built <span class=\"iTxt\">Al-Saeedat</span> manner (a brick by half brick). Then the Muslims became numerous, and they said, ‘O Rasool-Allah<sup>saww</sup>! If only you<sup>saww</sup> would order with the Masjid so there can be an increase in it’. So he<sup>saww</sup> said: ‘Yes’. So he<sup>saww</sup> ordered with it, and there was an increase in it, and its walls were built in the male and female manner (Zakr bil Unsa – i.e. two opposite sides). Then the heat became intense upon them, so they said, ‘O Rasool-Allah<sup>saww</sup>! If only you<sup>saww</sup> would order with the Masjid, so there can be shade’. So he<sup>saww</sup> said: ‘Yes’. ",
            "So he<sup>saww</sup> ordered with it, and the straps from palm trunks were placed therein. Then the beams and the baskets, and the grass was thrown on top of it. So they lived therein (under the shade) until the rain hit them. So the Masjid became inappropriate for them, and they said, ‘O Rasool-Allah<sup>saww</sup>! If only you<sup>saww</sup> would order us, so we would apply clay upon it’. So Rasool-Allah<sup>saww</sup> said to them: ‘There shall be no shafts like the shafts of Musa<sup>as</sup>’.",
            "So it did not cease to be like that until Rasool-Allah<sup>saww</sup> passed away, and its wall was such that it would shade an upright person. When it (the shadow) was on one cubit, and it was like the crouching goat, Al-Zohr <span class=\"iTxt\">Salāt</span> was prayed, and when it was double that, Al-Asr was prayed’. ",
            "And he<sup>asws</sup> said: ‘Al-Sameyt, is a brick by brick, and Al-Saeeda is a brick and a half brick, and Al-Zakr Bil Unsa is building two opposite sides’."
          ],
          "en.sarwar": [
            "1. Ali ibn Muhammad and Muhammad ibn al-Hassan have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad from ibn abu Nasr and Ali ibn Ibrahim has narrated from his father from ‘Abd Allah ibn al-Mughirah from ‘Abd Allah ibn Sinan who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘The Messenger of Allah built his Masjid with an arrangement of one brick. The number of Muslims increased and they asked, “O Messenger of Allah, issue a command to expand the Masjid.” He responded positively and commanded to expand it and it was expanded. It was built with an arrangement of one and a half bricks. Then Muslims became greater in number and they asked the Messenger of Allah to expand the Masjid again. He agreed and commanded to increase the size of the Masjid and this time, the walls were built with an arrangement of bricks. (The arrangements of bricks, as mentioned, apply more clearly to the width of the wall). When during the warm season it became hot, they asked the Messenger of Allah to provide shadow. He agreed and commanded them to do so, they placed beams of palm tree trunks over which branches and bushes were placed. They remained until it rained and water leaked down upon them. They asked, “O Messenger of Allah, we wish you command to cover the roof of the Masjid with clay.” The Messenger of Allah said to them, “There must be no trellises like the trellis of Moses.” It remained in that form until the Holy prophet passed away. The height of the walls before placing the roof was of the size of the height of a man. When the length of its shadow would become of the size of one yard, which is of the size of a goat, they would perform Salah (prayer) soon after noontime. When its length doubled, they would perform ‘Al-‘Asr Salah (prayer).’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/68)"
        ],
        "index": 4882,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/133",
              "text": "حَمَّادِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/171",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:13:2",
        "relations": {
          "Mentions": [
            "/books/quran:9:108"
          ]
        },
        "text": [
          " سَأَلْتُهُ عَنِ الْمَسْجِدِ الَّذِي أُسِّسَ عَلَى التَّقْوَى قَالَ مَسْجِدُ قُبَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad Bin Isa, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about <span class=\"ibTxt\"><a href=\"/#/books/quran:9#h108\">[9:108]</a> a Masjid founded on piety</span>. He<sup>asws</sup> said: ‘Masjid Quba’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad ibn ‘Isa from al-Halabiy who has said the following: “I asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the Masjid which was built for a pious purpose. He (the Imam) replied, ‘It is Masjid al-Quba”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول أو حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/68)"
        ],
        "index": 4883,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/16",
              "text": "أَحْمَدُ بْنُ إِدْرِيسَ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/110",
              "text": "غَيْرُهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/604",
              "text": "عَلِيِّ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2748",
              "text": "مُحَمَّدِ بْنِ عَمْرِو بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ حَدَّثَنِي "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2916",
              "text": "مُوسَى بْنُ أُكَيْلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/392",
              "text": "عَبْدِ الْأَعْلَى مَوْلَى آلِ سَامٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ إِدْرِيسَ وَ غَيْرُهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ سَعِيدٍ قَالَ حَدَّثَنِي مُوسَى بْنُ أُكَيْلٍ عَنْ عَبْدِ الْأَعْلَى مَوْلَى آلِ سَامٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:13:3",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) كَمْ كَانَ مَسْجِدُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) قَالَ كَانَ ثَلَاثَةِ آلَافٍ وَ سِتَّمِائَةِ ذِرَاعٍ تَكْسِيراً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees and someone else, from Ahmad Bin Muhammad, from Ali Bin Ismail, from Muhammad Bin Amro Bin Saeed who said, ‘Musa Bin Akeyl narrated to me, from Abdul A’la, a slave of the family of Saam who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘How much was (the size of) the Masjid of Rasool-Allah<sup>saww</sup>?’ He<sup>asws</sup> said: ‘It was of three thousand and six hundred cubits squared’."
          ],
          "en.sarwar": [
            "3. Ahmad ibn Idris and other people have narrated from Ahmad ibn Muhammad from Ali ibn ’Isma‘il from Muhammad ibn ‘Amr ibn Sa‘id who has said that Musa ibn ‘Ukayl narrated from ‘Abd al-‘A’la’ from Mawla Ala Sam who has said the following: “I asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘What was the size of Masjid of the Messenger of Allah?’ He (the Imam) replied, ‘It was three thousand and six hundred square yards.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:4:13",
  "kind": "verse_list"
}