{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:3:4", "titles": {"ar": "كِتَابُ الصَّلَاةِ", "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "}}, {"indexed_titles": {"en": "Chapter 15"}, "path": "/books/al-kafi:3:4:15", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الْمَرْأَةِ تُصَلِّي</span> بِحِيَالِ الرَّجُلِ وَ الرَّجُلِ يُصَلِّي وَ الْمَرْأَةُ بِحِيَالِهِ", "en": "Chapter 15 – The woman prays Salāt parallel with the man, and the man prays Salāt and the woman is parallel to him"}}], "index": 682, "local_index": 15, "part_type": "Chapter", "path": "/books/al-kafi:3:4:15", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الْمَرْأَةِ تُصَلِّي</span> بِحِيَالِ الرَّجُلِ وَ الرَّجُلِ يُصَلِّي وَ الْمَرْأَةُ بِحِيَالِهِ", "en": "Chapter 15 – The woman prays Salāt parallel with the man, and the man prays Salāt and the woman is parallel to him"}, "verse_count": 7, "verse_start_index": 4887, "verses": [{"index": 4888, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:4:15:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الْمَرْأَةِ تُصَلِّي إِلَى جَنْبِ الرَّجُلِ قَرِيباً مِنْهُ فَقَالَ إِذَا كَانَ بَيْنَهُمَا مَوْضِعُ رَحْلٍ فَلَا بَأْسَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Hammad, from Hareyz, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the woman who prays <span class=\"iTxt\">Salāt</span> to the side of the man, near to him. So he<sup>asws</sup> said: ‘When there was a place between the two of them of one saddle-bag (cubit), so there is no problem’."}]}, {"index": 4889, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:4:15:2", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يُصَلِّي وَ الْمَرْأَةُ بِحِذَاهُ يَمْنَةً أَوْ يَسْرَةً قَالَ لَا بَأْسَ بِهِ إِذَا كَانَتْ لَا تُصَلِّي .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washa, from Aban Bin Usman, \n(It has been narrated) from Abdul Rahman Bin Abu Abdullah<sup>asws</sup>, said, ‘I asked Abu Abdullah<sup>asws</sup> about the man who is praying and the woman is by his right side, or left. He<sup>asws</sup> said: ‘There is no problem with it when she was not praying <span class=\"iTxt\">Salāt</span>’."}]}, {"index": 4890, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:4:15:3", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الرَّجُلِ وَ الْمَرْأَةِ يُصَلِّيَانِ فِي وَقْتٍ وَاحِدٍ الْمَرْأَةُ عَنْ يَمِينِ الرَّجُلِ بِحِذَاهُ قَالَ لَا إِلَّا أَنْ يَكُونَ بَيْنَهُمَا شِبْرٌ أَوْ ذِرَاعٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Sahl Bin Ziyad, from Ibn Sinan, from Ibn Muskan, from Abu Baseer, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the man and the woman both praying <span class=\"iTxt\">Salāt</span> at one time, the woman being on the right of the man by his side. He<sup>asws</sup> said: ‘No, unless if there happens to be one shibr (open palm’s width) or one cubit between the two of them’."}]}, {"index": 4891, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:3:4:15:4", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنِ الْعَلَاءِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يُصَلِّي فِي زَاوِيَةِ الْحُجْرَةِ وَ امْرَأَتُهُ أَوِ ابْنَتُهُ تُصَلِّي بِحِذَاهُ فِي الزَّاوِيَةِ الْأُخْرَى فَقَالَ لَا يَنْبَغِي لَهُ ذَلِكَ فَإِنْ كَانَ بَيْنَهُمَا شِبْرٌ أَجْزَأَهُ \nقَالَ وَ سَأَلْتُهُ عَنِ الرَّجُلِ وَ الْمَرْأَةِ يَتَزَامَلَانِ فِي الْمَحْمِلِ يُصَلِّيَانِ جَمِيعاً فَقَالَ لَا وَ لَكِنْ يُصَلِّي الرَّجُلُ فَإِذَا صَلَّى صَلَّتِ الْمَرْأَةُ.", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Al A’ala, from Muhammad Bin Muslim, \n(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the man who is praying <span class=\"iTxt\">Salāt</span> in a corner of the room, and his wife or his daughter is praying <span class=\"iTxt\">Salāt</span> by his side in the other corner. So he<sup>asws</sup> said: ‘That is not befitting for him. But if there was one palm’s width (of distance between the two, so it would suffice him’. \nHe (the narrator) said, ‘And I asked him<sup>asws</sup> about the man and the woman accompanying each other in the carriage, praying <span class=\"iTxt\">Salāt</span> together. So he<sup>asws</sup> said: ‘No, but the man should pray <span class=\"iTxt\">Salāt</span> (first). So when he has prayed, the woman would pray <span class=\"iTxt\">Salāt</span>’."}]}, {"index": 4892, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:3:4:15:5", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ إِدْرِيسَ بْنِ عَبْدِ اللَّهِ الْقُمِّيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يُصَلِّي وَ بِحِيَالِهِ امْرَأَةٌ قَائِمَةٌ عَلَى فِرَاشِهَا جَنْبَتِهِ فَقَالَ إِنْ كَانَتْ قَاعِدَةً فَلَا يَضُرُّهُ وَ إِنْ كَانَتْ تُصَلِّي فَلَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ja’far Bin Basheer, from Hammad Bin Usman, from Idrees Bin Abdullah Al Qummy who said, \n‘I asked Abu Abdullah<sup>asws</sup> about the man is praying <span class=\"iTxt\">Salāt</span> and parallel to is his wife, standing upon her bed, by his side. So he<sup>asws</sup> said: ‘If she was seated, so it would not harm him, and if she was praying <span class=\"iTxt\">Salāt</span>, so no’."}]}, {"index": 4893, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:3:4:15:6", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ الْحَسَنِ بْنِ رِبَاطٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يُصَلِّي وَ عَائِشَةُ نَائِمَةٌ مُعْتَرِضَةٌ بَيْنَ يَدَيْهِ وَ هِيَ لَا تُصَلِّي .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ali Bin Al Hassan Bin Rabaat, from one of our companions, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> was praying <span class=\"iTxt\">Salāt</span>, and Ayesha was sleeping sideways in front of him<sup>saww</sup>, and she was not praying <span class=\"iTxt\">Salāt</span>’."}]}, {"index": 4894, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:3:4:15:7", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَمَّنْ رَوَاهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الرَّجُلِ يُصَلِّي وَ الْمَرْأَةُ تُصَلِّي بِحِذَاهُ أَوْ إِلَى جَانِبِهِ فَقَالَ إِذَا كَانَ سُجُودُهَا مَعَ رُكُوعِهِ فَلَا بَأْسَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazal, from Ibn Bukeyr, from the one who reported it, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the man who is praying <span class=\"iTxt\">Salāt</span> and the woman is praying <span class=\"iTxt\">Salāt</span> parallel to him or to his side. So he<sup>asws</sup> said: ‘If she was performing <span class=\"iTxt\">Sajdah</span> along with his <span class=\"iTxt\">Rukū</span>, so there is no problem’."}]}]}, "index": "al-kafi:3:4:15", "kind": "verse_list"}