{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 2"
        },
        "path": "/books/al-kafi:3:4:2",
        "titles": {
          "ar": "باب مَنْ حَافَظَ عَلَى صَلَاتِهِ أَوْ ضَيَّعَهَا",
          "en": "Chapter 2 – The one who preserves upon his Salāt or wastes it"
        }
      }
    ],
    "index": 669,
    "local_index": 2,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:3:4:3",
        "titles": {
          "ar": "باب فَرْضِ الصَّلَاةِ",
          "en": "Chapter 3 – Obligation of the Salāt"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 1"
        },
        "path": "/books/al-kafi:3:4:1",
        "titles": {
          "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>اب فَضْلِ الصَّلَاةِ</span>",
          "en": "Chapter 1 – The merit of (Salāt)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:4:2",
    "titles": {
      "ar": "باب مَنْ حَافَظَ عَلَى صَلَاتِهِ أَوْ ضَيَّعَهَا",
      "en": "Chapter 2 – The one who preserves upon his Salāt or wastes it"
    },
    "verse_count": 16,
    "verse_start_index": 4779,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/11)"
        ],
        "index": 4780,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:2:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ أَبَانِ بْنِ تَغْلِبَ قَالَ كُنْتُ صَلَّيْتُ خَلْفَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) بِالْمُزْدَلِفَةِ فَلَمَّا انْصَرَفَ الْتَفَتَ إِلَيَّ فَقَالَ يَا أَبَانُ الصَّلَوَاتُ الْخَمْسُ الْمَفْرُوضَاتُ مَنْ أَقَامَ حُدُودَهُنَّ وَ حَافَظَ عَلَى مَوَاقِيتِهِنَّ لَقِيَ اللَّهَ يَوْمَ الْقِيَامَةِ وَ لَهُ عِنْدَهُ عَهْدٌ يُدْخِلُهُ بِهِ الْجَنَّةَ وَ مَنْ لَمْ يُقِمْ حُدُودَهُنَّ وَ لَمْ يُحَافِظْ عَلَى مَوَاقِيتِهِنَّ لَقِيَ اللَّهَ وَ لَا عَهْدَ لَهُ إِنْ شَاءَ عَذَّبَهُ وَ إِنْ شَاءَ غَفَرَ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus Bin Abdul Rahman, from Abdul Rahman Bin Al hakkan, from Aban Bin Taghlub who said, ",
            "‘I was praying <span class=\"iTxt\">Salāt</span> behind Abu Abdullah<sup>asws</sup> at Al-Muzdalifa. So when he<sup>asws</sup> finished, he<sup>asws</sup> turned around to me and said: ‘O Aban! The five <span class=\"iTxt\">Salāts</span> are Obligatory. The one who establishes their limits and preserves upon their (Prescribed) timings would meet Allah<sup>azwj</sup> on the Day of Judgement, and for him would be, in His<sup>azwj</sup> Presence, a deed he would be entering the Paradise with; but the one who does not establish its limits and does not preserve upon its (Prescribed) timings, would meet Allah<sup>azwj</sup> and there would be no deed for him. If He<sup>azwj</sup> so Desires to, He<sup>azwj</sup> would Punish him, and if He<sup>azwj</sup> so Desires to, He<sup>azwj</sup> would Forgive him’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus ibn ‘Abd al-Rahman from ‘Abd al-Rahman ibn af-Hajjaj from Aban ibn Taghlib who has said the following: “Once I performed Salah (prayer) with abu ‘Abd Allah, ‘Alayhi al-Salam, in Muzdalifah (a place in Makkah). When he completed Salah (prayer) he turned to me and said, ‘O Aban, the five times Salah (prayer) every day is obligatory. Those who properly observe the rules about these prayers and perform them in their designated times they, on the Day of Judgment, will come in the presence of Allah with their established covenant before Him, because of which they will be admitted in paradise. Those who ignore the rules about Salah (prayer) and ignore the times designated for them, they will come in the presence of Allah without having any established covenant with Him. He then will decide about them. He may punish or forgive them as He will wish.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/12)"
        ],
        "index": 4781,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:2:2",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ أَبَانِ بْنِ تَغْلِبَ قَالَ صَلَّيْتُ مَعَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) الْمَغْرِبَ بِالْمُزْدَلِفَةِ فَلَمَّا انْصَرَفَ أَقَامَ الصَّلَاةَ وَ صَلَّى الْعِشَاءَ الْآخِرَةَ لَمْ يَرْكَعْ بَيْنَهُمَا ",
          "ثُمَّ صَلَّيْتُ مَعَهُ بَعْدَ ذَلِكَ بِسَنَةٍ فَصَلَّى الْمَغْرِبَ ثُمَّ قَامَ فَتَنَفَّلَ بِأَرْبَعِ رَكَعَاتٍ ثُمَّ أَقَامَ فَصَلَّى الْعِشَاءَ الْآخِرَةَ ثُمَّ الْتَفَتَ إِلَيَّ فَقَالَ يَا أَبَانُ هَذِهِ الصَّلَوَاتُ الْخَمْسُ الْمَفْرُوضَاتُ مَنْ أَقَامَهُنَّ وَ حَافَظَ عَلَى مَوَاقِيتِهِنَّ لَقِيَ اللَّهَ يَوْمَ الْقِيَامَةِ وَ لَهُ عِنْدَهُ عَهْدٌ يُدْخِلُهُ بِهِ الْجَنَّةَ وَ مَنْ لَمْ يُصَلِّهِنَّ لِمَوَاقِيتِهِنَّ وَ لَمْ يُحَافِظْ عَلَيْهِنَّ فَذَاكَ إِلَيْهِ إِنْ شَاءَ غَفَرَ لَهُ وَ إِنْ شَاءَ عَذَّبَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad Al Ashary, from Abdullah Bin Aamir, from Ali Bin Mahziyar, from Ibn Abu Umeyr, from Abdul Rahman Bin Al hajjaj, from Aban Bin Taghlub who said, ",
            "‘I prayed Maghrib <span class=\"iTxt\">Salāt</span> with Abu Abdullah<sup>asws</sup> at Al-Muzdalifa. So when he<sup>asws</sup> finished, he<sup>asws</sup> recited <span class=\"iTxt\">Iqamah</span> of the <span class=\"iTxt\">Salāt</span> and prayed the last Isha, not praying even one <span class=\"iTxt\">Rak’at</span> between the two. ",
            "Then I prayed <span class=\"iTxt\">Salāt</span> with him<sup>asws</sup> a year after that, so he<sup>asws</sup> prayed Al-Maghrib, then recited Iqaama and optionally prayed four <span class=\"iTxt\">Rak’at </span>(<span class=\"iTxt\">Rak’at</span>s). Then he<sup>asws</sup> recited <span class=\"iTxt\">Iqamah</span> and he<sup>asws</sup> prayed the last Isha. Then he<sup>asws</sup> turned around to me and he<sup>asws</sup> said: ‘O Aban! These five <span class=\"iTxt\">Salāts</span> are Obligatory. The one who establishes these and preserves upon their (Prescribed) timings, will meet Allah<sup>azwj</sup> on the Day of Judgement, and for him would be, in His<sup>azwj</sup> Presence, a deed he would be entering the Paradise with; but the one who does not pray these in their (Prescribed) timings and does not preserve upon these, so that would be up to Him<sup>azwj</sup>. If He<sup>azwj</sup> so Desires to He<sup>azwj</sup> would Forgive him, and if He<sup>azwj</sup> so Desires to, He<sup>azwj</sup> would Punish him’."
          ],
          "en.sarwar": [
            "2. AI-Husayn ibn Muhammad al-Ash’ariy has narrated from ‘Abd Allah ibn ‘Amir from Ali ibn Mahziyar ibn abu ‘Umayr from ‘Abd al- Rahman ibn al-Hajjaj from Aban ibn Taghlib who has said the following: “Once I performed Maghrib (evening) Salah (prayer) with abu ‘Abd Allah, ‘Alayhi al-Salam, in Muzdalifah. When he completed, he called for Salah (prayer) and performed al-‘Isha’ (late evening) prayer without any delay between the two prayers (evening and late evening). One year later I performed Salah (prayer) with him. He prayed Maghrib then he stood up for Nafl (optional) Salah (prayer). He performed four Rak‘at, then he said Iqamah (called for Salah (prayer) and prayed al-Tsha prayer (late evening),) and then he turned to me saying, ‘O Aban, these five times Salah (prayers) are obligatory. Those who perform them and do not ignore their designated times, they will come in the presence of Allah, on the Day of Judgment, with an established covenant before Him, because of which they will be admitted in paradise. Those who do not perform them in their designated times and ignore the rules about them, then it will be up to Him. He may forgive them or punish them as He will wish.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/13)"
        ],
        "index": 4782,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:2:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ يُونُسَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قِيلَ لَهُ وَ أَنَا حَاضِرٌ الرَّجُلُ يَكُونُ فِي صَلَاتِهِ خَالِياً فَيَدْخُلُهُ الْعُجْبُ فَقَالَ إِذَا كَانَ أَوَّلَ صَلَاتِهِ بِنِيَّةٍ يُرِيدُ بِهَا رَبَّهُ فَلَا يَضُرُّهُ مَا دَخَلَهُ بَعْدَ ذَلِكَ فَلْيَمْضِ فِي صَلَاتِهِ وَ لْيَخْسَأِ الشَّيْطَانَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhmmad Bin Isa, from Yunus Bin Abdul Rahman, from Yunus Bin Ammar, ",
            "from Abu Abdullah<sup>asws</sup>, said, ‘It was said to him<sup>asws</sup> and I was present, ‘The man happens to be in his <span class=\"iTxt\">Salāt</span> devoid (of negative feelings), and the ego enters into him’. So he<sup>asws</sup> said: ‘When it was the beginning of the <span class=\"iTxt\">Salāt</span> his intention being intending for his Lord<sup>azwj</sup>, so whatever enters into him after that, it would not harm him. So let him continue in his <span class=\"iTxt\">Salāt</span> and let him debase Satan<sup>la</sup>’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus ibn ‘Abd al-Rahman from Yunus ibn ‘Ammar who has said the following: “Someone asked abu ‘Abd Allah, ‘Alayhi al-Salam, while I was present, ‘What is the rule about a man who is in Salah (prayer) free of negative feelings but then he feels self-importance?’ Imam replied, ‘If in the beginning his intention was only for his Lord, then such feeling does not affect his prayer negatively, he should continue his Salah (prayer) and Satan is humiliated.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/13)"
        ],
        "index": 4783,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:2:4",
        "text": [
          "جَمَاعَةٌ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ عَنْ حُسَيْنِ بْنِ عُثْمَانَ عَنْ سَمَاعَةَ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ كُلُّ سَهْوٍ فِي الصَّلَاةِ يُطْرَحُ مِنْهَا غَيْرَ أَنَّ اللَّهَ تَعَالَى يُتِمُّ بِالنَّوَافِلِ إِنَّ أَوَّلَ مَا يُحَاسَبُ بِهِ الْعَبْدُ الصَّلَاةُ فَإِنْ قُبِلَتْ قُبِلَ مَا سِوَاهَا ",
          "إِنَّ الصَّلَاةَ إِذَا ارْتَفَعَتْ فِي أَوَّلِ وَقْتِهَا رَجَعَتْ إِلَى صَاحِبِهَا وَ هِيَ بَيْضَاءُ مُشْرِقَةٌ تَقُولُ حَفِظْتَنِي حَفِظَكَ اللَّهُ وَ إِذَا ارْتَفَعَتْ فِي غَيْرِ وَقْتِهَا بِغَيْرِ حُدُودِهَا رَجَعَتْ إِلَى صَاحِبِهَا وَ هِيَ سَوْدَاءُ مُظْلِمَةٌ تَقُولُ ضَيَّعْتَنِي ضَيَّعَكَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A group, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Fazalat, from Husayn Bin Usman, from Sama’at, from Abu Baseer who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘Every mistake in the <span class=\"iTxt\">Salāt</span> is dropped from it, apart from that Allah<sup>azwj</sup> the Exalted would Completed it with the optional (<span class=\"iTxt\">Salāt</span>). The first of what the servant would be Reckoned with is the <span class=\"iTxt\">Salāt</span>, so if it is Accepted, what is besides it would be Accepted.",
            "The <span class=\"iTxt\">Salāt</span>, when it is raised during the beginning of its (Prescribed) timing, returns to its owner and it is white, shining, saying: ‘You preserved me, may Allah<sup>azwj</sup> Protect you’; and when it is raised during other than its (prescribed) timing, without its limits, return to its owner at it is black, dark, saying: ‘You wasted me, may Allah<sup>azwj</sup> Waste you (your efforts)’."
          ],
          "en.sarwar": [
            "4. A group of our people has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa‘id from Fadalah from Husayn ibn ‘Uthman from Sama‘ah from abu Basir who has said the following: “I heard abu Ja’far, ‘Alayhi al-Salam, say, ‘Every mistake in Salah (prayer) is dropped thereby except that Allah, the Most High, completes it with optional prayers. The first item of deeds with which one is judged is Salah (prayer). If Salah (prayer) is accepted, other deeds are also accepted. If Salah (prayer) is raised in the beginning of its designated time, it comes to the person prayed it all white and radiant, saying, “You preserved me, may Allah protect you.” If Salah (prayer) is raised in other times without observance of the rules about it Salah (prayer) returns back to the person who has performed it, all black and dark, saying, “You wasted me away, may Allah lay you waste.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/14)"
        ],
        "index": 4784,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:2:5",
        "refs": {
          "Mentions": [
            "/books/quran:107:5"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ قَالَ سَأَلْتُ عَبْداً صَالِحاً ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ الَّذِينَ هُمْ عَنْ صَلاتِهِمْ ساهُونَ قَالَ هُوَ التَّضْيِيعُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad in Muhammad, from Al Husayn, from Muhammad Bin Al Fuzayl who said, ",
            "‘I asked Abd Al-Salih<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:107#h5\">[107:5]</a> Who are unmindful of their Salāts</span>. He<sup>asws</sup> said: ‘It is the wasting (of the Salāt)’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn from Muhammad ibn al-Fudayl who has said the following: “I asked the pious servant of Allah about the words of Allah, the Most Majestic, the Most Glorious, ‘Those who make mistakes in their prayer.’ Imam replied, ‘It means loss of prayer.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/14)"
        ],
        "index": 4785,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:2:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ بَيْنَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) جَالِسٌ فِي الْمَسْجِدِ إِذْ دَخَلَ رَجُلٌ فَقَامَ يُصَلِّي فَلَمْ يُتِمَّ رُكُوعَهُ وَ لَا سُجُودَهُ فَقَالَ ( صلى الله عليه وآله ) نَقَرَ كَنَقْرِ الْغُرَابِ لَئِنْ مَاتَ هَذَا وَ هَكَذَا صَلَاتُهُ لَيَمُوتَنَّ عَلَى غَيْرِ دِينِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘While Rasool-Allah<sup>saww</sup> was seated in the Masjid when a man entered. So he stood and prayed <span class=\"iTxt\">Salāt</span>, and he<sup>saww</sup> neither completed his <span class=\"iTxt\">Rukū</span> nor his <span class=\"iTxt\">Sajdah</span>. So he<sup>saww</sup> said: ‘He pecks the like pecking of the crow. If this one were to die and this is how his <span class=\"iTxt\">Salāt</span> is, he would have died upon other than my<sup>saww</sup> Religion’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ’Udhaynah from Zurarah who has said the following: “A man entered the Masjid when the Messenger of Allah was present. He began to perform Salah (prayer) without properly doing Ruku‘ and Sajdah. He (the Messenger of Allah) said, ‘He acted like a crow picking up grain from the ground. If he dies with his Salah (prayer) of such condition he dies in a religion other than my religion.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/15)"
        ],
        "index": 4786,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:2:7",
        "text": [
          "عَنْهُ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ لَا تَتَهَاوَنْ بِصَلَاتِكَ فَإِنَّ النَّبِيَّ ( صلى الله عليه وآله ) قَالَ عِنْدَ مَوْتِهِ لَيْسَ مِنِّي مَنِ اسْتَخَفَّ بِصَلَاتِهِ لَيْسَ مِنِّي مَنْ شَرِبَ مُسْكِراً لَا يَرِدُ عَلَيَّ الْحَوْضَ لَا وَ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from his father, from Hammad, from Hareyz, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Do not be careless with your <span class=\"iTxt\">Salāt</span>, for the Prophet<sup>saww</sup> said during his<sup>saww</sup> passing away: ‘He is not from me<sup>saww</sup>, the one who belittles with his <span class=\"iTxt\">Salāt</span>; he is not from me<sup>saww</sup>, the one who drinks an intoxicant. He would not be returning to me<sup>asws</sup> at the Fountain, no by Allah<sup>azwj</sup>, (he won’t)’."
          ],
          "en.sarwar": [
            "7. It is a narration from him (narrator of previous Hadith) by his father from Hammad from Hariz from Zurarah who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘You must not consider your Salah (prayer) insignificant; the Holy Prophet said when he was about to pass away, “Those who consider their Salah (prayer) insignificant are not of my people, as well as those who drink intoxicating liquor. They will not be able to come to me at the pond of al-Kawthar, no by Allah (they will not be able to do so).””’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/15)"
        ],
        "index": 4787,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:2:8",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَا يَزَالُ الشَّيْطَانُ ذَعِراً مِنَ الْمُؤْمِنِ مَا حَافَظَ عَلَى الصَّلَوَاتِ الْخَمْسِ فَإِذَا ضَيَّعَهُنَّ تَجَرَّأَ عَلَيْهِ فَأَدْخَلَهُ فِي الْعَظَائِم."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that Rasool-Allah<sup>saww</sup> said: ‘The Satan<sup>la</sup> does not cease to be alarmed from the Believer who has preserved upon the five (daily) <span class=\"iTxt\">Salāt</span>. So when he wastes them, he<sup>la</sup> is audacious upon him, and he<sup>la</sup> enters him into the major sins’."
          ],
          "en.sarwar": [
            "8. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah has said, ‘Satan continues to be afraid of a believing person as long as he protects his five times daily Salah (prayers), but when he loses them, Satan becomes daring, then he takes him into great sins.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/15)"
        ],
        "index": 4788,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:2:9",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ الْعِيصِ بْنِ الْقَاسِمِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ اللَّهِ إِنَّهُ لَيَأْتِي عَلَى الرَّجُلِ خَمْسُونَ سَنَةً وَ مَا قَبِلَ اللَّهُ مِنْهُ صَلَاةً وَاحِدَةً فَأَيُّ شَيْ‏ءٍ أَشَدُّ مِنْ هَذَا وَ اللَّهِ إِنَّكُمْ لَتَعْرِفُونَ مِنْ جِيرَانِكُمْ وَ أَصْحَابِكُمْ مَنْ لَوْ كَانَ يُصَلِّي لِبَعْضِكُمْ مَا قَبِلَهَا مِنْهُ لِاسْتِخْفَافِهِ بِهَا إِنَّ اللَّهَ عَزَّ وَ جَلَّ لَا يَقْبَلُ إِلَّا الْحَسَنَ فَكَيْفَ يَقْبَلُ مَا يُسْتَخَفُّ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Safwan Bin Yahya, from Al Ays Bin Al Qasim who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! There could come upon the man, fifty years (of age) and not a <span class=\"iTxt\">Salāt</span> is Accepted from him. So which thing is more difficult than this? By Allah<sup>azwj</sup>! You know the ones in your neighbourhood and your companions, the one who, were to pray <span class=\"iTxt\">Salāt </span>from one of you, it would not be Accepted from him due to his belittling with it. Allah<sup>azwj</sup> Mighty and Majestic does not Accept but only pure, so how would He<sup>azwj</sup> Accept what is belittled with?’"
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa‘id from Safwan ibn Yahya from al-‘is ibn al-Qasim who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘A man may become fifty years old, but Allah has accepted not even one Salah (prayer) from him. What can be more serious than this? By Allah, you may also find someone in your neighborhood who performs Salah (prayer) with you, but is not accepted from him due to his considering it insignificant. Allah, the Most Majestic, the Most Glorious, does not accept anything other than what is good. How then He will accept what he considers insignificant?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/15)"
        ],
        "index": 4789,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:2:10",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا قَامَ الْعَبْدُ فِي الصَّلَاةِ فَخَفَّفَ صَلَاتَهُ قَالَ اللَّهُ تَبَارَكَ وَ تَعَالَى لِمَلَائِكَتِهِ أَ مَا تَرَوْنَ إِلَى عَبْدِي كَأَنَّهُ يَرَى أَنَّ قَضَاءَ حَوَائِجِهِ بِيَدِ غَيْرِي أَ مَا يَعْلَمُ أَنَّ قَضَاءَ حَوَائِجِهِ بِيَدِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Hisham Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When a servant stands regarding his <span class=\"iTxt\">Salāt</span>, so he takes his <span class=\"iTxt\">Salāt</span> lightly, Allah<sup>azwj</sup> Blessed and High Says to His<sup>azwj</sup> Angels: “Are you not looking at My<sup>azwj</sup> servant? It is as if he is seeing the fulfilment of his needs to be in a hand other than Mine<sup>azwj</sup>. Does he not know that the fulfilment of his needs are in My<sup>azwj</sup> Hand?’"
          ],
          "en.sarwar": [
            "10. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Hisham ibn Salim who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that when a man stands up for Salah (prayer) but considers it insignificant, Allah, the Most Holy, the Most High, says to His angels, ‘Look at this servant of Mine. It seems as if he thinks someone other than Me is a person in charge of fulfilling his needs. Does he not know that I am the One who fulfills all of his needs by My own hand?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/16)"
        ],
        "index": 4790,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:2:11",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِذَا مَا أَدَّى الرَّجُلُ صَلَاةً وَاحِدَةً تَامَّةً قُبِلَتْ جَمِيعُ صَلَاتِهِ وَ إِنْ كُنَّ غَيْرَ تَامَّاتٍ وَ إِنْ أَفْسَدَهَا كُلَّهَا لَمْ يُقْبَلْ مِنْهُ شَيْ‏ءٌ مِنْهَا وَ لَمْ يُحْسَبْ لَهُ نَافِلَةٌ وَ لَا فَرِيضَةٌ وَ إِنَّمَا تُقْبَلُ النَّافِلَةُ بَعْدَ قَبُولِ الْفَرِيضَةِ وَ إِذَا لَمْ يُؤَدِّ الرَّجُلُ الْفَرِيضَةَ لَمْ يُقْبَلْ مِنْهُ النَّافِلَةُ وَ إِنَّمَا جُعِلَتِ النَّافِلَةُ لِيَتِمَّ بِهَا مَا أُفْسِدَ مِنَ الْفَرِيضَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad and Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Hammad Bin Isa, from Hareyz, from Zuurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When a man completes (the rituals) of a <span class=\"iTxt\">Salāt</span> properly, all of his other <span class=\"iTxt\">Salāt</span> would be accepted; even though those may not be complete; and if he spoils all of them, nothing would be Accepted from these, and they would not be Reckoned for him, neither an optional nor an Obligatory one; and rather, an optional is (only accepted) after the Acceptance of the Obligatory (Salāt). And when the man does not fulfil the Obligatory (<span class=\"iTxt\">Salāt</span>), the optional one would not be Accepted from him; and rather, they are to complete therewith the shortcomings of the obligatory ones."
          ],
          "en.sarwar": [
            "11. Ali ibn Ibrahim has narrated from his father from Hammad and Muhammad ibn Yahya from Ahmad ibn Muhammad from Hammad ibn ‘Isa from Hariz from Zurarah who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘When a man completes one Salah (prayer) properly, all of his other prayers are accepted; even though they may not be complete. If he loses them, altogether, none of his Salah (prayer) is accepted, and not even his optional or obligatory prayers are counted. Optional Salah (prayer) are accepted only after obligatory prayers are accepted. If one does not perform obligatory prayers, optional prayers are not accepted; they are to complete therewith the shortcomings of the obligatory ones.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/17)"
        ],
        "index": 4791,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:2:12",
        "refs": {
          "Mentions": [
            "/books/quran:23:9",
            "/books/quran:70:23"
          ]
        },
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ عَنْ حَرِيزٍ عَنِ الْفُضَيْلِ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ الَّذِينَ هُمْ عَلى صَلَواتِهِمْ يُحافِظُونَ قَالَ هِيَ الْفَرِيضَةُ قُلْتُ الَّذِينَ هُمْ عَلى صَلاتِهِمْ دائِمُونَ قَالَ هِيَ النَّافِلَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Hareyz, from Al Fuzayl who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:23#h9\">[23:9]</a> And those who preserve their Prayers</span>. He<sup>asws</sup> said: ‘It is the Obligatory (<span class=\"iTxt\">Salāt</span>)’. I said, ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:70#h23\">[70:23]</a> Those who are constant at their Salāt</span>?’ He<sup>asws</sup> said: ‘It is the optional’."
          ],
          "en.sarwar": [
            "12. It narrated through the same chain of narrators from Hariz from af-Fudayl who has said the following: “I asked abu Ja’far, ‘Alayhi al-Salam, about the words of Allah, the Most Majestic, the Most Glorious, ‘Those who are protective of their Salah (prayers)” <a href=\"/#/books/quran:23#h9\">[23:9]</a>. The Imam said, It means obligatory prayer.’ I then asked about, ‘Those who are ever observing their prayer’ <a href=\"/#/books/quran:70#h23\">[70:23]</a>. The Imam said, It means optional prayers.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/17)"
        ],
        "index": 4792,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:2:13",
        "refs": {
          "Mentions": [
            "/books/quran:19:60",
            "/books/quran:4:105",
            "/books/quran:4:103",
            "/books/quran:19:59"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ دَاوُدَ بْنِ فَرْقَدٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَوْلُهُ تَعَالَى إِنَّ الصَّلاةَ كانَتْ عَلَى الْمُؤْمِنِينَ كِتاباً مَوْقُوتاً قَالَ كِتَاباً ثَابِتاً وَ لَيْسَ إِنْ عَجَّلْتَ قَلِيلًا أَوْ أَخَّرْتَ قَلِيلًا بِالَّذِي يَضُرُّكَ مَا لَمْ تُضَيِّعْ تِلْكَ الْإِضَاعَةَ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ لِقَوْمٍ أَضاعُوا الصَّلاةَ وَ اتَّبَعُوا الشَّهَواتِ فَسَوْفَ يَلْقَوْنَ غَيًّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Dawood Bin Farqad who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The Words of the Exalted <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h103\">[4:103]</a> surely the Salāt is a timed Ordinance for the Believers</span>. He<sup>asws</sup> said: ‘An affirmed Prescription, and it cannot be hastened a little nor delayed a little by which it would harm you for as long as you do not waste these with a wasting (not praying at all), for Allah<sup>azwj</sup> Mighty and Majestic is Saying to a people who wasted the <span class=\"iTxt\">Salāt </span><span class=\"ibTxt\"><a href=\"/#/books/quran:19#h59\">[19:59]</a> But there came after them an evil generation, who neglected Prayers and followed the lustful desires, so they will be meeting Ghayya</span> (a revolving yellow (sulphuric) mountain in Hell)’."
          ],
          "en.sarwar": [
            "13. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Fadalah ibn Ayyub from Dawud ibn Farqad who has said the following: “I asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the words of Allah, ‘Salah (prayer) was made obligatory in designated times’ <a href=\"/#/books/quran:4#h105\">[4:105]</a>. The Imam replied, It is an established obligation. If you performed earlier or delayed a little, it is not harmful as long as you did not lose them altogether. Allah, the Most Majestic, the Most Glorious, says about a people, “They lost Salah (prayer) and followed their lustful desires so they face deviation” <a href=\"/#/books/quran:19#h60\">[19:60]</a>.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/18)"
        ],
        "index": 4793,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:2:14",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ أَيُّمَا مُؤْمِنٍ حَافَظَ عَلَى الصَّلَوَاتِ الْمَفْرُوضَةِ فَصَلَّاهَا لِوَقْتِهَا فَلَيْسَ هَذَا مِنَ الْغَافِلِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father from Ibn Mahboub, from Jameel Bin Darraj, from one of his companions, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Whichever Believers is preserving upon the Obligatory <span class=\"iTxt\">Salāt</span>, so he prays these upon their (Prescribed) timings, so this one is not from the oblivious (unaware) ones’."
          ],
          "en.sarwar": [
            "14. Ali ibn Ibrahim has narrated from his father from ibn Mahbub from Jamil ibn Darraj from certain persons of his people who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘Whoever of the believers preserves his obligatory Salah (prayers) and performs them in time, he is not of the neglectful people.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح على الظاهر   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/18)"
        ],
        "index": 4794,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:2:15",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ أَبِي إِسْمَاعِيلَ السَّرَّاجِ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ أَبُو الْحَسَنِ الْأَوَّلُ ( عليه السلام ) إِنَّهُ لَمَّا حَضَرَ أَبِيَ الْوَفَاةُ قَالَ لِي يَا بُنَيَّ إِنَّهُ لَا يَنَالُ شَفَاعَتَنَا مَنِ اسْتَخَفَّ بِالصَّلَاةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Abu Ismail Al Sarraj, from Ibn Muskan, from Abu Baseer who said, ",
            "‘Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup> said: ‘When the death presented itself to my<sup>asws</sup> father<sup>asws</sup>, he<sup>asws</sup> said to me<sup>asws</sup>: ‘We<sup>asws</sup> will not extend our<sup>asws</sup> intercession towards the one who takes <span class=\"iTxt\">Salāt</span>’ lightly."
          ],
          "en.sarwar": [
            "15. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ’Isma‘il from abu ’Isma‘il al-Sarraj from ibn Muskan from abu Basir who has said the following: “Abu al-Hassan the first, ‘Alayhi al-Salam, has said, ‘When my father was about to pass away he said, “My son, those who consider Salah (prayers) insignificant will not be able to benefit from our intercession.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/18)"
        ],
        "index": 4795,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:2:16",
        "text": [
          "مُحَمَّدٌ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ جَعْفَرٍ عَنْ أَبِيهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِكُلِّ شَيْ‏ءٍ وَجْهٌ وَ وَجْهُ دِينِكُمُ الصَّلَاةُ فَلَا يَشِينَنَّ أَحَدُكُمْ وَجْهَ دِينِهِ وَ لِكُلِّ شَيْ‏ءٍ أَنْفٌ وَ أَنْفُ الصَّلَاةِ التَّكْبِيرُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad, from Sahl, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Ja’far<sup>asws</sup>, from his<sup>asws</sup> father<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘For everything there is a face, and a face of your Religion is the <span class=\"iTxt\">Salāt</span>, none of you should deface his Religion; and for everything there is a nose (pride), and a nose (pride) of the <span class=\"iTxt\">Salāt</span> is the exclamation of <span class=\"iTxt\">Takbīr</span>’."
          ],
          "en.sarwar": [
            "16. Muhammad has narrated from Sahl ibn Ziyad from al-Nawfaliy from al-Sakuniy from Ja‘far from his father who has said the following: “The Messenger of Allah has said, ‘Everything has a face. The face of your religion is Salah (prayer), no one of you, therefore, must deface his religion. Everything has a nose. The nose of Salah (prayer) is al-Takbir (saying, “Allah is greater than can be described”).”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:4:2",
  "kind": "verse_list"
}