{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 20"
        },
        "path": "/books/al-kafi:3:4:20",
        "titles": {
          "ar": "باب افْتِتَاحِ الصَّلَاةِ وَ الْحَدِّ فِي التَّكْبِيرِ وَ مَا يُقَالُ عِنْدَ ذَلِكَ",
          "en": "Chapter 20 – Commencing the Salāt and the limit regarding the exclamations of Takbīr, and what is to be said during that"
        }
      }
    ],
    "index": 687,
    "local_index": 20,
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:4:20",
    "titles": {
      "ar": "باب افْتِتَاحِ الصَّلَاةِ وَ الْحَدِّ فِي التَّكْبِيرِ وَ مَا يُقَالُ عِنْدَ ذَلِكَ",
      "en": "Chapter 20 – Commencing the Salāt and the limit regarding the exclamations of Takbīr, and what is to be said during that"
    },
    "verse_count": 8,
    "verse_start_index": 4947,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/97)"
        ],
        "index": 4948,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:20:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ زُرَارَةَ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ تَرْفَعُ يَدَيْكَ فِي افْتِتَاحِ الصَّلَاةِ قُبَالَةَ وَجْهِكَ وَ لَا تَرْفَعْهُمَا كُلَّ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel Bin Darraj, from Zurara, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) having said: ‘Raise your hands during the opening of the <span class=\"iTxt\">Salāt</span> opposite your face but do not raise them all the way’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Jamil ibn Darraj from Zurarah who has said the following: “One of the two Imam, ‘Alayhim al-Salam, has said, ‘Raise your hands when commencing Salah (prayer) on the sides of your face and do not raise them all the way farther.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/98)"
        ],
        "index": 4949,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:20:2",
        "text": [
          "وَ عَنْهُ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِذَا قُمْتَ فِي الصَّلَاةِ فَكَبَّرْتَ فَارْفَعْ يَدَيْكَ وَ لَا تُجَاوِزْ بِكَفَّيْكَ أُذُنَيْكَ أَيْ حِيَالَ خَدَّيْكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from his father, from Hammad, from Hareyz, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When you stand regarding the <span class=\"iTxt\">Salāt</span> and you exclaim <span class=\"iTxt\">Takbīr</span>, so raise your hands, and your palms should not exceed your ears, i.e. parallel to your cheeks’."
          ],
          "en.sarwar": [
            "2. It is a narration from him (narrator of previous Hadith) by his father from Hammad from Hariz from Zurarah who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘When you stand up for Salah (prayer) say Takbir (Allah is great beyond description) and raise your hands. Do not allow your palms (hands) to rise higher than your ears. Keep them on the sides of your face.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/98)"
        ],
        "index": 4950,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:20:3",
        "text": [
          "عَنْهُ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ قَالَ أَدْنَى مَا يُجْزِئُ مِنَ التَّكْبِيرِ فِي التَّوَجُّهِ تَكْبِيرَةٌ وَاحِدَةٌ وَ ثَلَاثُ تَكْبِيرَاتٍ أَحْسَنُ وَ سَبْعٌ أَفْضَلُ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from his father, from Hammad Bin Isa, from Hareyz, from Zurara who said, ",
            "‘The lowest of what would suffice from the exclamation of <span class=\"iTxt\">Takbīr</span> during the direction, is one <span class=\"iTxt\">Takbīr</span>; and three <span class=\"iTxt\">Takbīr</span>s are better, and seven would be superior’."
          ],
          "en.sarwar": [
            "3. It is a narration from him (narrator of previous Hadith) by his father Hammad ibn ‘Isa from Hariz from Zurarah who has said the following: “He (the Imam), ‘Alayhi al-Salam, has said, ‘The least for Takbir (Allah is great beyond description) facing (al-Qiblah (al-Ka‘bah)) is to say it once. Three times is good and seven times is better.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/99)"
        ],
        "index": 4951,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:20:4",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا كُنْتَ إِمَاماً أَجْزَأَتْكَ تَكْبِيرَةٌ وَاحِدَةٌ لِأَنَّ مَعَكَ ذَا الْحَاجَةِ وَ الضَّعِيفَ وَ الْكَبِيرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Sh<span class=\"iTxt\">Azān</span>, from Hammad Bin Isa, from Muawiya Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whenever you are a prayer-leader, one exclamation of <span class=\"iTxt\">Takbīr</span> would suffice you, because there would be with you ones with the need, and the weakness, and the old age’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from Hammad ibn ‘Isa from Mu‘awiyah ibn ‘Ammar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If you are leading others in Salah (prayer) one Takbir (Allah is great beyond description) is sufficient; with you there can be people who need to go after their needs, weak people and the old ones.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/99)"
        ],
        "index": 4952,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:20:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ التَّكْبِيرُ فِي صَلَاةِ الْفَرْضِ الْخَمْسِ الصَّلَوَاتِ خَمْسٌ وَ تِسْعُونَ تَكْبِيرَةً مِنْهَا تَكْبِيرَاتُ الْقُنُوتِ خَمْسَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muawiya Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The exclamation of <span class=\"iTxt\">Takbīr</span> regarding the five Obligatory <span class=\"iTxt\">Salāt</span>s are ninety five exclamations of <span class=\"iTxt\">Takbīr</span>s – from these, the <span class=\"iTxt\">Takbīr</span>s for the <span class=\"iTxt\">Qunoot</span> are five’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Mu‘awiyah ibn ‘Ammar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘The number of Takbir (Allah is great beyond description) in all five obligatory Salah (prayer) is ninety-five of which are Takbir (Allah is great beyond description) during five Qunut.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/99)"
        ],
        "index": 4953,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:20:6",
        "text": [
          "وَ رَوَاهُ أَيْضاً عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ وَ فَسَّرَهُنَّ فِي الظُّهْرِ إِحْدَى وَ عِشْرِينَ تَكْبِيرَةً وَ فِي الْعَصْرِ إِحْدَى وَ عِشْرِينَ تَكْبِيرَةً وَ فِي الْمَغْرِبِ سِتَّ عَشْرَةَ تَكْبِيرَةً وَ فِي الْعِشَاءِ الْآخِرَةِ إِحْدَى وَ عِشْرِينَ تَكْبِيرَةً وَ فِي الْفَجْرِ إِحْدَى عَشْرَةَ تَكْبِيرَةً وَ خَمْسَ تَكْبِيرَاتِ الْقُنُوتِ فِي خَمْسِ صَلَوَاتٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "And it is reported as well, from his father, from Abdullah Bin Al-Mugheira, ‘And he<sup>asws</sup> explained these – In Al-Zohr there are twenty one exclamations of <span class=\"iTxt\">Takbīr</span>, and in Al-Asr there are twenty one exclamations of <span class=\"iTxt\">Takbīr</span>, and in Al-Maghrib there are sixteen exclamations of <span class=\"iTxt\">Takbīr</span>, and in Al-Isha the last there are twenty one exclamations of <span class=\"iTxt\">Takbīr</span>, and in Al-Fajr there are eleven exclamations of <span class=\"iTxt\">Takbīr</span>, and there are five <span class=\"iTxt\">Takbīr</span>s of the <span class=\"iTxt\">Qunoot</span> in the five <span class=\"iTxt\">Salāt</span>s’."
          ],
          "en.sarwar": [
            "6. He (Ali ibn Ibrahim) has narrated it also from his father from ‘Abd Allah ibn al-Mughirah. In explaining he has said that in al-Dhuhr there are twenty-one, in al-‘Asr twenty-one, in al-Maghrib sixteen, in al-‘Isha’ al-Akhirah twenty-one and in the morning Salah (prayer) there are eleven and in the five Qunut there are five Takbir (Allah is great beyond description). "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/99)"
        ],
        "index": 4954,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:20:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ بْنِ هَاشِمٍ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا افْتَتَحْتَ الصَّلَاةَ فَارْفَعْ كَفَّيْكَ ثُمَّ ابْسُطْهُمَا بَسْطاً ثُمَّ كَبِّرْ ثَلَاثَ تَكْبِيرَاتٍ ثُمَّ قُلِ اللَّهُمَّ أَنْتَ الْمَلِكُ الْحَقُّ لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي ذَنْبِي إِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ ",
          "ثُمَّ تُكَبِّرُ تَكْبِيرَتَيْنِ ثُمَّ قُلْ لَبَّيْكَ وَ سَعْدَيْكَ وَ الْخَيْرُ فِي يَدَيْكَ وَ الشَّرُّ لَيْسَ إِلَيْكَ وَ الْمَهْدِيُّ مَنْ هَدَيْتَ لَا مَلْجَأَ مِنْكَ إِلَّا إِلَيْكَ سُبْحَانَكَ وَ حَنَانَيْكَ تَبَارَكْتَ وَ تَعَالَيْتَ سُبْحَانَكَ رَبَّ الْبَيْتِ ",
          "ثُمَّ تُكَبِّرُ تَكْبِيرَتَيْنِ ثُمَّ تَقُولُ وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَاوَاتِ وَ الْأَرْضَ عَالِمِ الْغَيْبِ وَ الشَّهَادَةِ حَنِيفاً مُسْلِماً وَ مَا أَنَا مِنَ الْمُشْرِكِينَ إِنَّ صَلَاتِي وَ نُسُكِي وَ مَحْيَايَ وَ مَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ لَا شَرِيكَ لَهُ وَ بِذَلِكَ أُمِرْتُ وَ أَنَا مِنَ الْمُسْلِمِينَ ",
          "ثُمَّ تَعَوَّذْ مِنَ الشَّيْطَانِ الرَّجِيمِ ثُمَّ اقْرَأْ فَاتِحَةَ الْكِتَابِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim Bin Hashim, from his father, from Ibn Abu Umeyr, from Hammad Bin Usman, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When you open the <span class=\"iTxt\">Salāt</span>, so raise your palms, then extend them with an extension. Then exclaim three <span class=\"iTxt\">Takbīr</span>s, then say, ‘O Allah<sup>azwj</sup>! You<sup>azwj</sup> are the King, the Truth. There is no god except for You<sup>azwj</sup>. Glory be to You<sup>azwj</sup>. I have been unjust to myself, therefore Forgive my sins for me, for no one forgives the sins except for You<sup>azwj</sup>’.  ",
            "Then exclaim two <span class=\"iTxt\">Takbīr</span>s, then say, ‘Here I am and at Your<sup>azwj</sup> service, and the goodness is in Your<sup>azwj</sup> Hands, and the evil is not to You<sup>azwj</sup>, and the Guided one is the one whom You<sup>azwj</sup> Guide. There is no Shelter (apart) from You<sup>azwj</sup> except to You<sup>azwj</sup>. Glory be to You<sup>azwj</sup>, and Tender are You<sup>azwj</sup>, and Blessed, and Exalted. Glory be to You<sup>azwj</sup>, Lord<sup>azwj</sup> of the House!’",
            "Then exclaim two <span class=\"iTxt\">Takbīr</span>s, then you should be saying, ‘I divert my face to the One Who Originated the skies and the earth, Knower of the unseen and the seen, with uprightness and submissiveness, and I am not from the Polytheists. My <span class=\"iTxt\">Salāt</span>, and my rituals, and my life, and my death are for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds. There is no associate for You<sup>azwj</sup>, and by that I am Commanded, and I am from the Muslims’. ",
            "Then seek Refuge from the Pelted Satan<sup>la</sup>, then recite the Opening of the Book (Chapter 1)’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim ibn Hashim has narrated from his father from ibn abu ‘Umayr from Hammad ibn ‘Uthman from al-Halabiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that as introduction for prayer raise your hands and open them, then say three times, ‘Allah is great and then say, ‘O Lord, You are the true owner. No one other than You deserves to be worshipped. You are free of all defects. I have wronged myself so forgive my sins; no one other than You is able to forgive sins.’ Then say two times, ‘Allah is great.’ Then say, ‘(O Lord), here I am to obey Your command and asking help from You (to accomplish my duty); all good is in Your hands and evil has no way toward You. Guided are those whom You have granted guidance. There is no place of refuge from You (Your anger) except in Your presence. You are free of all defects and compassionate, the most Blessed, the most High. You are free of all defects and You are the Lord of the House.’ Then say two times, ‘Allah is great.’ Then say. ‘I have turned my face toward the One who has created the skies and the earth. He has knowledge of the unseen and seen. I am humble before and submitted to the will of Allah and I am not one of the pagans. My Salah (prayer), my practices, my life and my death are all for the sake of Allah, Cherisher of the worlds. He has no partner. I am commanded to speak as such and I am the first Muslim.’ Then seek refuge with Allah against Satan, who is subject to stoning and then read al-Fatihah.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/101)"
        ],
        "index": 4955,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:20:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَوْماً يَا حَمَّادُ تُحْسِنُ أَنْ تُصَلِّيَ قَالَ فَقُلْتُ يَا سَيِّدِي أَنَا أَحْفَظُ كِتَابَ حَرِيزٍ فِي الصَّلَاةِ فَقَالَ لَا عَلَيْكَ يَا حَمَّادُ قُمْ فَصَلِّ قَالَ فَقُمْتُ بَيْنَ يَدَيْهِ مُتَوَجِّهاً إِلَى الْقِبْلَةِ فَاسْتَفْتَحْتُ الصَّلَاةَ فَرَكَعْتُ وَ سَجَدْتُ فَقَالَ يَا حَمَّادُ لَا تُحْسِنُ أَنْ تُصَلِّيَ مَا أَقْبَحَ بِالرَّجُلِ مِنْكُمْ يَأْتِي عَلَيْهِ سِتُّونَ سَنَةً أَوْ سَبْعُونَ سَنَةً فَلَا يُقِيمُ صَلَاةً وَاحِدَةً بِحُدُودِهَا تَامَّةً",
          "قَالَ حَمَّادٌ فَأَصَابَنِي فِي نَفْسِي الذُّلُّ فَقُلْتُ جُعِلْتُ فِدَاكَ فَعَلِّمْنِي الصَّلَاةَ فَقَامَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مُسْتَقْبِلَ الْقِبْلَةِ مُنْتَصِباً فَأَرْسَلَ يَدَيْهِ جَمِيعاً عَلَى فَخِذَيْهِ قَدْ ضَمَّ أَصَابِعَهُ وَ قَرَّبَ بَيْنَ قَدَمَيْهِ حَتَّى كَانَ بَيْنَهُمَا قَدْرُ ثَلَاثِ أَصَابِعَ مُنْفَرِجَاتٍ وَ اسْتَقْبَلَ بِأَصَابِعِ رِجْلَيْهِ جَمِيعاً الْقِبْلَةَ لَمْ يُحَرِّفْهُمَا عَنِ الْقِبْلَةِ وَ قَالَ بِخُشُوعٍ اللَّهُ أَكْبَرُ",
          "ثُمَّ قَرَأَ الْحَمْدَ بِتَرْتِيلٍ وَ قُلْ هُوَ اللَّهُ أَحَدٌ ثُمَّ صَبَرَ هُنَيَّةً بِقَدْرِ مَا يَتَنَفَّسُ وَ هُوَ قَائِمٌ ثُمَّ رَفَعَ يَدَيْهِ حِيَالَ وَجْهِهِ وَ قَالَ اللَّهُ أَكْبَرُ وَ هُوَ قَائِمٌ",
          "ثُمَّ رَكَعَ وَ مَلَأَ كَفَّيْهِ مِنْ رُكْبَتَيْهِ مُنْفَرِجَاتٍ وَ رَدَّ رُكْبَتَيْهِ إِلَى خَلْفِهِ حَتَّى اسْتَوَى ظَهْرُهُ حَتَّى لَوْ صُبَّ عَلَيْهِ قَطْرَةٌ مِنْ مَاءٍ أَوْ دُهْنٍ لَمْ تَزُلْ لِاسْتِوَاءِ ظَهْرِهِ وَ مَدَّ عُنُقَهُ وَ غَمَّضَ عَيْنَيْهِ ثُمَّ سَبَّحَ ثَلَاثاً بِتَرْتِيلٍ فَقَالَ ",
          "سُبْحَانَ رَبِّيَ الْعَظِيمِ وَ بِحَمْدِهِ",
          "ثُمَّ اسْتَوَى قَائِماً فَلَمَّا اسْتَمْكَنَ مِنَ الْقِيَامِ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ثُمَّ كَبَّرَ وَ هُوَ قَائِمٌ وَ رَفَعَ يَدَيْهِ حِيَالَ وَجْهِهِ",
          "ثُمَّ سَجَدَ وَ بَسَطَ كَفَّيْهِ مَضْمُومَتَيِ الْأَصَابِعِ بَيْنَ يَدَيْ رُكْبَتَيْهِ حِيَالَ وَجْهِهِ فَقَالَ ",
          "سُبْحَانَ رَبِّيَ الْأَعْلَى وَ بِحَمْدِهِ ",
          "ثَلَاثَ مَرَّاتٍ وَ لَمْ يَضَعْ شَيْئاً مِنْ جَسَدِهِ عَلَى شَيْ‏ءٍ مِنْهُ",
          "وَ سَجَدَ عَلَى ثَمَانِيَةِ أَعْظُمٍ الْكَفَّيْنِ وَ الرُّكْبَتَيْنِ وَ أَنَامِلِ إِبْهَامَيِ الرِّجْلَيْنِ وَ الْجَبْهَةِ وَ الْأَنْفِ وَ قَالَ سَبْعَةٌ مِنْهَا فَرْضٌ يُسْجَدُ عَلَيْهَا وَ هِيَ الَّتِي ذَكَرَهَا اللَّهُ فِي كِتَابِهِ فَقَالَ وَ أَنَّ الْمَساجِدَ لِلَّهِ فَلا تَدْعُوا مَعَ اللَّهِ أَحَداً وَ هِيَ الْجَبْهَةُ وَ الْكَفَّانِ وَ الرُّكْبَتَانِ وَ الْإِبْهَامَانِ وَ وَضْعُ الْأَنْفِ عَلَى الْأَرْضِ سُنَّةٌ",
          "ثُمَّ رَفَعَ رَأْسَهُ مِنَ السُّجُودِ فَلَمَّا اسْتَوَى جَالِساً قَالَ ",
          "اللَّهُ أَكْبَرُ ",
          "ثُمَّ قَعَدَ عَلَى فَخِذِهِ الْأَيْسَرِ وَ قَدْ وَضَعَ ظَاهِرَ قَدَمِهِ الْأَيْمَنِ عَلَى بَطْنِ قَدَمِهِ الْأَيْسَرِ وَ قَالَ ",
          "أَسْتَغْفِرُ اللَّهَ رَبِّي وَ أَتُوبُ إِلَيْهِ",
          "ثُمَّ كَبَّرَ وَ هُوَ جَالِسٌ وَ سَجَدَ السَّجْدَةَ الثَّانِيَةَ وَ قَالَ كَمَا قَالَ فِي الْأُولَى وَ لَمْ يَضَعْ شَيْئاً مِنْ بَدَنِهِ عَلَى شَيْ‏ءٍ مِنْهُ فِي رُكُوعٍ وَ لَا سُجُودٍ وَ كَانَ مُجَّنِّحاً وَ لَمْ يَضَعْ ذِرَاعَيْهِ عَلَى الْأَرْضِ ",
          "فَصَلَّى رَكْعَتَيْنِ عَلَى هَذَا وَ يَدَاهُ مَضْمُومَتَا الْأَصَابِعِ وَ هُوَ جَالِسٌ فِي التَّشَهُّدِ فَلَمَّا فَرَغَ مِنَ التَّشَهُّدِ سَلَّمَ فَقَالَ يَا حَمَّادُ هَكَذَا صَلِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa who said, ",
            "‘Abu Abdullah<sup>asws</sup> said to me one day: ‘O Hammad! Are you good in your <span class=\"iTxt\">Salāt</span>?’ So I said, ‘I have memorised the book of Hareyz (a companion) regarding the <span class=\"iTxt\">Salāt</span>’. So he<sup>asws</sup> said: ‘(That) is not upon you, O Hammad! Stand and pray <span class=\"iTxt\">Salāt</span>’. So I stood in front of him, facing towards the Qiblah, and I commenced the <span class=\"iTxt\">Salāt</span>, and I performed <span class=\"iTxt\">Rukū</span> and I performed <span class=\"iTxt\">Sajdah</span>. So he<sup>asws</sup> said: ‘O Hammad! You are not good in your <span class=\"iTxt\">Salāt</span>. How ugly it is with the man from you, sixty or seventy years having had come upon him, and he does not establish (even) one <span class=\"iTxt\">Salāt</span> along with its complete limits’. ",
            "Hammad said, ‘So I was hit with disgrace within myself, so I said, ‘May I be sacrificed for you<sup>asws</sup>! So teach me the <span class=\"iTxt\">Salāt</span>’. So Abu Abdullah<sup>asws</sup> arose facing the Qiblah upright, and he<sup>asws</sup> sent both his<sup>asws</sup> hands to be upon his<sup>asws</sup> thighs having had joined his<sup>asws</sup> fingers and brought his<sup>asws</sup> feet closer to the extent that there was between the two feet a measurement of three fingers diverged, and faced the toes of his<sup>asws</sup> legs towards the Qiblah together, not turning these away from Qiblah, and said with humbleness: ‘Allah<sup>azwj</sup> is the Greatest!’",
            "Then he<sup>asws</sup> recited Al-Hamd (Chapter 1) with clarity, and ‘Say He<sup>azwj</sup> Allah<sup>azwj</sup> is One’ (Chapter 112). Then he<sup>asws</sup> waited for a moment by a measurement of what it takes to breathe, and he<sup>asws</sup> was standing. Then he<sup>asws</sup> raised his<sup>asws</sup> hands parallel to his<sup>asws</sup> face and said: ‘Allah<sup>azwj</sup> is the Greatest!’, and he<sup>asws</sup> was standing. ",
            "Then he<sup>asws</sup> performed <span class=\"iTxt\">Rukū</span> and filled his<sup>asws</sup> palms with his<sup>asws</sup> two knees being divergent and returned his two knees backwards until his<sup>asws</sup> back was even, to the extent that if a drop of water or oil were to be poured upon it, it would not spill due to the evenness of his<sup>asws</sup> back; and he<sup>asws</sup> extended his<sup>asws</sup> neck (forward) and lowered his<sup>asws</sup> eyes, then Glorified three times with clarity, so he<sup>asws</sup> said: ",
            "‘Glorious is my<sup>asws</sup> Lord<sup>azwj</sup> the Magnificent and by His<sup>azwj</sup> Praise’.",
            "Then he<sup>asws</sup> stood upright. So when he<sup>asws</sup> was standing straight, he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Hears the one who Praises Him<sup>azwj</sup>’. Then he<sup>asws</sup> exclaimed a <span class=\"iTxt\">Takbīr</span> and he<sup>asws</sup> was standing, and raised his<sup>asws</sup> hands parallel to his<sup>asws</sup> face. ",
            "Then he<sup>asws</sup> performed <span class=\"iTxt\">Sajdah</span> and extended his<sup>asws</sup> neck and extended his<sup>asws</sup> palms, the finger being closed in front of his<sup>asws</sup> knees, parallel to his<sup>asws</sup> face, and he<sup>asws</sup> said:",
            "‘Glorious is my<sup>asws</sup> Lord<sup>azwj</sup>, the Exalted, and by His<sup>azwj</sup> Praise’",
            "– Three times, and did not place anything from his<sup>asws</sup> body upon anything from it.",
            "And he<sup>asws</sup> performed <span class=\"iTxt\">Sajdah</span> upon eight body parts – the two palms, and the two knees, and the two big toes of the two feet, and the forehead, and the nose, and said: ‘Seven of these are Obligatory for one to perform <span class=\"iTxt\">Sajdah</span> upon, and these are which Allah<sup>azwj</sup> has Mentioned in His<sup>azwj</sup> Book, so He<sup>azwj</sup> Said <span class=\"ibTxt\">[72:18] And that the Masjids (places of Sajdah) are Allah's, therefore call not upon any one with Allah</span> – and these are the forehead, and the two palms, and the two knees, and the two big toes, and placing of the nose upon the ground is a Sunnah’. ",
            "Then he<sup>asws</sup> raised his<sup>asws</sup> head from the <span class=\"iTxt\">Sajdah</span>. So when he<sup>asws</sup> sat up straight, said:",
            "‘Allah<sup>azwj</sup> is the Greatest!’ ",
            "Then he<sup>asws</sup> sat upon his left thigh, and he<sup>asws</sup> placed the back of his<sup>asws</sup> right foot upon the inside of his<sup>asws</sup> left foot, and said: ",
            "‘I<sup>asws</sup> seek Forgiveness of Allah<sup>azwj</sup>, my<sup>asws</sup> Lord<sup>azwj</sup>, and I<sup>asws</sup> repent to Him<sup>azwj</sup>’. ",
            "Then he<sup>asws</sup> exclaimed <span class=\"iTxt\">Takbīr</span> and he<sup>asws</sup> was seated, and he<sup>asws</sup> performed <span class=\"iTxt\">Sajdah</span> the second <span class=\"iTxt\">Sajdah</span> and said just as he<sup>asws</sup> had said during the first, and did not place anything from his<sup>asws</sup> body upon anything from it, neither during <span class=\"iTxt\">Rukū</span> nor a <span class=\"iTxt\">Sajdah</span>, and he<sup>asws</sup> was winged (i.e. his<sup>asws</sup> arms being in a posture as if they were two wings), and he<sup>asws</sup> did not place his<sup>asws</sup> arms (but only palms) upon the ground. ",
            "So he prayed <span class=\"iTxt\">Salāt</span> upon this, and his<sup>asws</sup> two hands were with closed fingers, and he<sup>asws</sup> was seated during the bearing of the testimonies (<span class=\"iTxt\">Tashahhud</span>). So when he<sup>asws</sup> was free from the <span class=\"iTxt\">Tashahhud</span>, he<sup>asws</sup> greeted (offered <span class=\"iTxt\">Salām</span>). Then he<sup>asws</sup> said: ‘O Hammad! This is how <span class=\"iTxt\">Salāt</span> is prayed’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, one day asked me, ‘Do you know how to perform Salah (prayer) properly?’ I said, ‘I keep the book of Hariz with me in Salah (prayer).’ The Imam said, ‘Nevermind, O Hammad. Stand up and perform Salah (prayer).’ The narrator has said, ‘I then stood up in his presence, facing the direction of Qiblah (Makkah). I began performing Salah (prayer), with Ruku‘ and Sajdah.’ He then said, “O Hammad, you do not know how to perform Salah (prayer) properly. It is a shame for a man of your people who at the age of sixty or seventy cannot even perform one Salah (prayer) according to its complete rules and manners.’ Hammad has said, ‘I belittled myself very much at this point. I then asked him saying, “I pray to Allah to keep my soul in service for your cause teach me how to perform Salah (prayer) properly.’” Abu ‘Abd Allah, ‘Alayhi al-Salam, stood up straight facing the direction of Qiblah. He allowed his hands to rest on his thighs, with his fingers close side by side, kept his feet near each other, only leaving between them a distance of three fingers opened up, with his toes facing the direction of Qiblah without allowing them to deviate from this direction and with humbleness said, ‘Allah is great.’ He then recited al-Hamd (the first Chapter of the Holy Quran) with clarity and fluency and Chapter 112 of the Holy Quran. He then paused for a breath while still standing and raised his hands up to the sides of his face and said, ‘Allah is great,’ while still standing. He then bent down for Ruku‘ (kneeling). He then placed his palms over his knees allowing them to be filled up with his knees that were separate from each other, and pressed them backward until his back became so straightly level that even if there had been a drop of water or oil it would not flow to any side. He stretched his neck forward, lowered his eyes and then said with clarity and fluency three times, ‘I praise my Lord, the Great, Who is free of all defects.’ He then stood up straight. While standing straight he said, ‘Allah hears all those who praise Him.’ He then while standing raised his hands up to the sides of his face and said, ‘Allah is great.’ Then he bowed down for sajdah. He opened his palms with his fingers close side by side, placed them near his knees on the sides next to his face and said, ‘I praise my Lord, the most High who is free of all defects,’ three times. He did not place any other part of his body on any other part thereof. He performed sajdah on eight parts of his bones: his palms, knees, big toes of his feet, his forehead and his nose. He (the Imam) said, ‘Placing seven parts of these bones on the ground is obligatory during sajdah but one of them (the nose) is not obligatory. This is what Allah has spoken of in the Quran, “The parts of the body to be placed on the ground during sajdah belong to Allah, you then must not worship anyone other than Allah.” (72:17) Such parts are forehead, palms, knees and big toes of feet. Placing one’s nose on the ground is optional.’ He then raised his head from sajdah. When he sat up straight, he then said, ‘Allah is great.’ He then sat on his left thigh placing the back of his right foot over the sole of his left foot and then said, ‘I seek forgiveness from Allah, my Lord and turn to Him in repentance.’ He then said, ‘Allah is great.’ Then he bowed down for second sajdah, saying therein what he said in the first sajdah. He did not place any other part of his body on any other part during Ruku‘ or sajdah. He spread his elbows and did not place his arms on the ground. In this way, he performed two Rak‘ats of Salah (prayer). He (the Imam) kept the fingers of his hands close side by side when saying the two testimonies in a sitting position. When he finished saying the testimonies, he then read Sal am and said, ‘O Hammad, you must perform Salah (prayer) like this.’” (Ahadith 2-7 are best explained by fatwa.) "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:4:20",
  "kind": "verse_list"
}