{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 25"
        },
        "path": "/books/al-kafi:3:4:25",
        "titles": {
          "ar": "باب السُّجُودِ وَ التَّسْبِيحِ وَ الدُّعَاءِ فِيهِ فِي الْفَرَائِضِ وَ النَّوَافِلِ وَ مَا يُقَالُ بَيْنَ السَّجْدَتَيْنِ",
          "en": "Chapter 25 – The Sajdah, and the Glorifications, and the supplications during the Obligatory and the Optional (Salāts), and what is to be said between the two Sajdah"
        }
      }
    ],
    "index": 692,
    "local_index": 25,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 26"
        },
        "path": "/books/al-kafi:3:4:26",
        "titles": {
          "ar": "باب أَدْنَى مَا يُجْزِئُ مِنَ التَّسْبِيحِ فِي الرُّكُوعِ وَ السُّجُودِ وَ أَكْثَرِهِ",
          "en": "Chapter 26 – The least of what would suffice from the Glorification (Tasbīḥ) during the Rukū  and the Sajdah, and the most of it"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 24"
        },
        "path": "/books/al-kafi:3:4:24",
        "titles": {
          "ar": "باب الرُّكُوعِ وَ مَا يُقَالُ فِيهِ مِنَ التَّسْبِيحِ وَ الدُّعَاءِ فِيهِ وَ إِذَا رَفَعَ الرَّأْسَ مِنْهُ",
          "en": "Chapter 24 – The Rukū and what is said during it from the Glorification, and the supplication during it, and when the head is raised from it"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:4:25",
    "titles": {
      "ar": "باب السُّجُودِ وَ التَّسْبِيحِ وَ الدُّعَاءِ فِيهِ فِي الْفَرَائِضِ وَ النَّوَافِلِ وَ مَا يُقَالُ بَيْنَ السَّجْدَتَيْنِ",
      "en": "Chapter 25 – The Sajdah, and the Glorifications, and the supplications during the Obligatory and the Optional (Salāts), and what is to be said between the two Sajdah"
    },
    "verse_count": 25,
    "verse_start_index": 5000,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/127)"
        ],
        "index": 5001,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/73",
              "text": "حَمَّادِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/168",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:1",
        "relations": {
          "Mentions": [
            "/books/quran:28:24"
          ]
        },
        "text": [
          " إِذَا سَجَدْتَ فَكَبِّرْ وَ قُلِ اللَّهُمَّ لَكَ سَجَدْتُ وَ بِكَ آمَنْتُ وَ لَكَ أَسْلَمْتُ وَ عَلَيْكَ تَوَكَّلْتُ وَ أَنْتَ رَبِّي سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ وَ شَقَّ سَمْعَهُ وَ بَصَرَهُ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ تَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ ",
          "ثُمَّ قُلْ سُبْحَانَ رَبِّيَ الْأَعْلَى وَ بِحَمْدِهِ ثَلَاثَ مَرَّاتٍ فَإِذَا رَفَعْتَ رَأْسَكَ فَقُلْ بَيْنَ السَّجْدَتَيْنِ اللَّهُمَّ اغْفِرْ لِي وَ ارْحَمْنِي وَ أَجِرْنِي وَ ادْفَعْ عَنِّي إِنِّي لِمَا أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ تَبَارَكَ اللَّهُ رَبُّ الْعَالَمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad Bin Usman, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When you perform <span class=\"iTxt\">Sajdah</span>, so exclaim a <span class=\"iTxt\">Takbīr</span> and say, ‘O Allah<sup>azwj</sup>! To You<sup>azwj</sup> I perform <span class=\"iTxt\">Sajdah</span>, and in You<sup>azwj</sup> I believe, and to You<sup>azwj</sup> I submit, and upon You<sup>azwj</sup> I rely, and You<sup>azwj</sup> are my Lord<sup>azwj</sup>. My face perform <span class=\"iTxt\">Sajdah</span>s to the One<sup>azwj</sup> Who Created it, and Cleaved its hearing and its vision. The Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds. Blessed is Allah<sup>azwj</sup>, the best of the creators’. ",
            "Then say, Glorious is my Lord<sup>azwj</sup> the Exalted and by His<sup>azwj</sup> Praise’ – three times. So when you raise your head, say in between the two <span class=\"iTxt\">Sajdah</span>, ‘O Allah<sup>azwj</sup>! Forgive me, and be Merciful to me, and Recompense me, and Defend me <span class=\"ibTxt\"><a href=\"/#/books/quran:28#h24\">[28:24]</a> Surely I stand in need of whatever good You may Send down upon me</span>. Blessed is Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad ibn ‘Uthman from al-Halabiy who has said the following: “Abu ’Abd Allah, ‘Alayhi al-Salam, has said that when you bow down for sajdah say, ‘Allah is great. then say, ‘ 0 Lord, I have bowed down to prostrate before You, I believe in You, submitted myself to You, have appealed to You to be my attorney and You are my Lord. My face has prostrated before the One who has created it, who has cut out for it a hearing means and a seeing means (ears and eyes). All praise belongs to Allah, the Lord of the worlds. Allah is most Blessed and the best Creator. Then say, ‘My Lord, the most High, is free of all defects. three times. While sitting straight between the two prostrations, say, ‘O Lord, forgive me, grant me mercy, grant me protection, and defend me against my enemies. I am in great need of the good that You have sent to me. Blessed is Allah, Lord of the worlds.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/128)"
        ],
        "index": 5002,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2571",
              "text": "جَمَاعَةٌ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/196",
              "text": "فَضَالَةَ بْنِ أَيُّوبَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2625",
              "text": "حَفْصٍ الْأَعْوَرِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "جَمَاعَةٌ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ حَفْصٍ الْأَعْوَرِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:2",
        "text": [
          " كَانَ عَلِيٌّ ( صلوات الله عليه ) إِذَا سَجَدَ يَتَخَوَّى كَمَا يَتَخَوَّى الْبَعِيرُ الضَّامِرُ يَعْنِي بُرُوكَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A group, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Abdullah Bin Sinan, from Hafs Al Awr, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It was so that whenever Ali<sup>asws</sup> performed <span class=\"iTxt\">Sajdah</span>, he<sup>asws</sup> postured (went down) like the posture of the slender camel, meaning his<sup>asws</sup> going down’."
          ],
          "en.sarwar": [
            "2. A group of people has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Fadalah ibn Ayyub from ‘Abd Allah ibn Sinan from Hafs al-‘A’war who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Imam Ali, ‘Alayhi al-Salam, when prostrating would place his chest also on the ground like a skinny being.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/128)"
        ],
        "index": 5003,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/59",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2372",
              "text": "عَبْدِ اللَّهِ بْنِ عَامِرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/904",
              "text": "عَلِيِّ بْنِ مَهْزِيَارَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/339",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:3",
        "text": [
          " رَأَيْتُ أَبَا الْحَسَنِ ( عليه السلام ) إِذَا سَجَدَ يُحَرِّكُ ثَلَاثَ أَصَابِعَ مِنْ أَصَابِعِهِ وَاحِدَةً بَعْدَ وَاحِدَةٍ تَحْرِيكاً خَفِيفاً كَأَنَّهُ يَعُدُّ التَّسْبِيحَ ثُمَّ رَفَعَ رَأْسَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Abdullah Bin Aamir, from Ali Bin Mahziyar, from Muhammad Bin Ismail who said, ",
            "‘I saw Abu Al-Hassan<sup>asws</sup> when he<sup>asws</sup> performed <span class=\"iTxt\">Sajdah</span>, moved three fingers from his<sup>asws</sup> fingers, one after the other, with a slight movement as if he<sup>asws</sup> was counting the Glorifications, then raised his<sup>asws</sup> head’."
          ],
          "en.sarwar": [
            "3. Al-Husayn ibn Muhammad has narrated from ‘Abd Allah ibn ‘Amir from Ali ibn Mahziyar from Muhammad ibn Isma’il who has said the following: “I saw abu al-Hassan, ‘Alayhi al-Salam, when prostrating, move three of his fingers one after the other slightly as if counting rosary and then raise his head from prostration.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/128)"
        ],
        "index": 5004,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/104",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/194",
              "text": "أَبِي جَعْفَرٍ الْأَحْوَلِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/159",
              "text": "أَبِي عُبَيْدَةَ الْحَذَّاءِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ أَبِي جَعْفَرٍ الْأَحْوَلِ عَنْ أَبِي عُبَيْدَةَ الْحَذَّاءِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:4",
        "text": [
          " سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ وَ هُوَ سَاجِدٌ أَسْأَلُكَ بِحَقِّ حَبِيبِكَ مُحَمَّدٍ إِلَّا بَدَّلْتَ سَيِّئَاتِي حَسَنَاتٍ وَ حَاسَبْتَنِي حِسَاباً يَسِيراً ",
          "ثُمَّ قَالَ فِي الثَّانِيَةِ أَسْأَلُكَ بِحَقِّ حَبِيبِكَ مُحَمَّدٍ إِلَّا كَفَيْتَنِي مَئُونَةَ الدُّنْيَا وَ كُلَّ هَوْلٍ دُونَ الْجَنَّةِ ",
          "وَ قَالَ فِي الثَّالِثَةِ أَسْأَلُكَ بِحَقِّ حَبِيبِكَ مُحَمَّدٍ لَمَّا غَفَرْتَ لِيَ الْكَثِيرَ مِنَ الذُّنُوبِ وَ الْقَلِيلَ وَ قَبِلْتَ مِنِّي عَمَلِيَ الْيَسِيرَ ",
          "ثُمَّ قَالَ فِي الرَّابِعَةِ أَسْأَلُكَ بِحَقِّ حَبِيبِكَ مُحَمَّدٍ لَمَّا أَدْخَلْتَنِي الْجَنَّةَ وَ جَعَلْتَنِي مِنْ سُكَّانِهَا وَ لَمَّا نَجَّيْتَنِي مِنْ سَفَعَاتِ النَّارِ بِرَحْمَتِكَ وَ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ آلِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, and Muhammad Bin Al Husayn, from Al Hassan Bin Mahboub, from Abu Ja’far Al Ahowl, from Abu Ubeyda Al Haza’a who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying while he<sup>asws</sup> was in <span class=\"iTxt\">Sajdah</span>: ‘I ask You<sup>azwj</sup> by the right of Your<sup>azwj</sup> Beloved Muhammad<sup>saww</sup> to Exchange my (Shias’) sins to Rewards and Reckon me with an easy Reckoning’. ",
            "Then he<sup>asws</sup> said during the second (<span class=\"iTxt\">Sajdah</span>): ‘I ask You<sup>azwj</sup> by the right of Your<sup>azwj</sup> Beloved Muhammad<sup>saww</sup> to Suffice me with the provisions of the world and (from) every horror before the Paradise’. ",
            "And he<sup>asws</sup> said during the third: ‘I ask You<sup>azwj</sup> by the right of Your<sup>azwj</sup> Beloved Muhammad<sup>saww</sup> to Forgive the numerous of the sins of my (Shias) and the little ones, and Accept from me my deeds easily’. ",
            "Then he<sup>asws</sup> said during the fourth: ‘I ask You<sup>azwj</sup> by the right of Your<sup>azwj</sup> Muhammad<sup>saww</sup> to Enter me into the Paradise, and Make me to be from its dwellers, and Rescue my (Shias) from the blasts of the Fire by Your<sup>azwj</sup> Mercy. And Blessings of Allah<sup>azwj</sup> be upon Muhammad<sup>saww</sup> and his<sup>saww</sup> Progeny<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad and Muhammad ibn al-Husayn from al-Hassan ibn Mahbub from, abu Ja‘far al-Ahwal from abu ‘Ubaydah al-Hadhdha’ who has said the following: “I heard abu Ja’far, ‘Alayhi al-Salam, say when prostrating, ‘(O Lord,) I plead before You through the right of Muhammad, Your beloved one, to change my bad deeds to good ones and hold my accountability very little. In the second prostration said, ‘(O Lord,) I plead before You through the right of Muhammad, Your beloved one, to suffice me in (my) needs in this world and all frightening matters up to paradise. In the third sajdah said, ‘(O Lord,) I plead before You through the right of Muhammad, Your beloved one, to forgive my sins, be it a great deal or a smaller amount and accept my very few (good deeds). In the fourth sajdah he said, ‘(O Lord,) I plead before You through the right of Muhammad, Your beloved one, to admit me in paradise, make me of its dwellers, save me from the effect of fire through Your mercy, and, O Allah, grant Muhammad and his family a compensation worthy of their serving Your cause.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> سكت عنه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/129)"
        ],
        "index": 5005,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2571",
              "text": "جَمَاعَةٌ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "النَّضْرِ بْنِ سُوَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/258",
              "text": "عَبْدِ اللَّهِ بْنِ سُلَيْمَانَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "جَمَاعَةٌ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ عَبْدِ اللَّهِ بْنِ سُلَيْمَانَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:5",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَذْكُرُ النَّبِيَّ ( صلى الله عليه وآله ) وَ هُوَ فِي الصَّلَاةِ الْمَكْتُوبَةِ إِمَّا رَاكِعاً وَ إِمَّا سَاجِداً فَيُصَلِّي عَلَيْهِ وَ هُوَ عَلَى تِلْكَ الْحَالِ فَقَالَ نَعَمْ إِنَّ الصَّلَاةَ عَلَى نَبِيِّ اللَّهِ ( صلى الله عليه وآله ) كَهَيْئَةِ التَّكْبِيرِ وَ التَّسْبِيحِ وَ هِيَ عَشْرُ حَسَنَاتٍ يَبْتَدِرُهَا ثَمَانِيَةَ عَشَرَ مَلَكاً أَيُّهُمْ يُبَلِّغُهَا إِيَّاهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A group, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Abdullah Bin Sinan, from Abdullah Bin Suleyman who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man who remembers the Prophet<sup>saww</sup> and it was during the Prescribed <span class=\"iTxt\">Salāt</span>, either while in the Rukū, or while prostrating, whether he can send Blessings upon him<sup>saww</sup> and he is upon that state’. So he<sup>asws</sup> said: ‘Yes. The sending of Blessings upon the Prophet<sup>saww</sup> of Allah<sup>azwj</sup> is like the exclamation of <span class=\"iTxt\">Takbīr</span> and the Glorification, and it is with ten Rewards. Eighteen Angels manage it to deliver it to him<sup>saww</sup>’."
          ],
          "en.sarwar": [
            "5. A group has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from ‘Abd Allah ibn Sinan from ‘Abd Allah ibn Sulayman who has said the following: “I asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who whenever mentioning the Holy Prophet during his Ruku‘ or sajdah in obligatory Salah (prayer), would say, ‘O Allah grant Muhammad and his family a compensation worthy of their serving Your cause. The Imam said, ‘Yes, saying such words, after the mention the name of the Holy Prophet is like saying, “Allah is great,” “Allah is free of all defects.” There is a reward for ten good deeds for it and eighteen angels rush forward to take it up to deliver to him.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/130)"
        ],
        "index": 5006,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/555",
              "text": "أَحْمَدُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/724",
              "text": "فَضَالَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/213",
              "text": "أَبَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1545",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ سَيَابَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ عَنْ أَبَانٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَيَابَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:6",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَدْعُو وَ أَنَا سَاجِدٌ فَقَالَ نَعَمْ فَادْعُ لِلدُّنْيَا وَ الْآخِرَةِ فَإِنَّهُ رَبُّ الدُّنْيَا وَ الْآخِرَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat, from Aban, from Abdul Rahman Bin Sayabat who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Can I supplicate while I am in a <span class=\"iTxt\">Sajdah</span>?’ So he<sup>asws</sup> said: ‘Yes, supplicate for the world and the Hereafter, for He<sup>azwj</sup> is the Lord<sup>azwj</sup> of the world and the Hereafter’."
          ],
          "en.sarwar": [
            "6. Ahmad ibn Muhammad from has narrated from al-Husayn ibn Sa‘id from Fadalah from Aban from ‘Abd al-Rahman ibn Sayabah who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘Can I plead (before Allah) in Sajdah (prostration)?’ He (the Imam) said, ‘Yes, you can do so. Plead for the worldly and the hereafter; He is the Lord of the world and the Lord of the life to come.’” (Hadith 6 is best explained by fatwa.) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/130)"
        ],
        "index": 5007,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/121",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/123",
              "text": "جَمِيلِ بْنِ دَرَّاجٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:7",
        "text": [
          " أَقْرَبُ مَا يَكُونُ الْعَبْدُ مِنْ رَبِّهِ إِذَا دَعَا رَبَّهُ وَ هُوَ سَاجِدٌ فَأَيَّ شَيْ‏ءٍ تَقُولُ إِذَا سَجَدْتَ قُلْتُ عَلِّمْنِي جُعِلْتُ فِدَاكَ مَا أَقُولُ قَالَ قُلْ ",
          "يَا رَبَّ الْأَرْبَابِ وَ يَا مَلِكَ الْمُلُوكِ وَ يَا سَيِّدَ السَّادَاتِ وَ يَا جَبَّارَ الْجَبَابِرَةِ وَ يَا إِلَهَ الْآلِهَةِ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ افْعَلْ بِي كَذَا وَ كَذَا",
          "ثُمَّ قُلْ فَإِنِّي عَبْدُكَ نَاصِيَتِي فِي قَبْضَتِكَ ثُمَّ ادْعُ بِمَا شِئْتَ وَ اسْأَلْهُ فَإِنَّهُ جَوَادٌ وَ لَا يَتَعَاظَمُهُ شَيْ‏ءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Sh<span class=\"iTxt\">Azān</span>, from Ibn Abu Umeyr, from Jameel Bin Darraj, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The closest of what the servant can happen to be to his Lord<sup>azwj</sup> is when he supplicates to his Lord<sup>azwj</sup> while he performs <span class=\"iTxt\">Sajdah</span> (perform <span class=\"iTxt\">Sajdah</span>s). So, which thing are you saying when you perform <span class=\"iTxt\">Sajdah</span>?’ I said, ‘Teach me, may I be sacrificed for you<sup>asws</sup>!’ He<sup>asws</sup> said: ‘Say, ",
            "‘O Lord<sup>azwj</sup> of the lords, and O King of the kings, and O Chief of the chiefs, and O Compeller of the compellers, and O God of the gods! Send Blessings upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and Do such and such with me’. ",
            "Then say, ‘I am Your<sup>azwj</sup> servant, my forelock being in Your<sup>azwj</sup> Grip’. Then supplicate with whatever you so desire to, and ask Him<sup>azwj</sup>, for He<sup>azwj</sup> is the most Benevolent. Nothing is too big for Him<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn ’Isma‘il has narrated from Fadl ibn Shadan from ibn abu ‘Umayr from Jamil ibn Darraj who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, once said that a position nearest to Allah during one’s prayer is the position of prostration. ‘What do you say during your prostration?’ I said, ‘May Allah keep my soul in service for your cause; teach me what I should say.’ The Imam told me to say, ‘O Lord of lords, O King of kings, O Master of masters, O Mightier than mighty ones, and O Lord of those who are worshipped, O Allah grant Muhammad and his family a compensation worthy of their serving Your cause, please grant my such and such wishes.’ Then say, ‘I am your servant and my forehead is in your control’; then ask for your wishes that you like; He is generous and nothing seems great before him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/130)"
        ],
        "index": 5008,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/110",
              "text": "هِشَامِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:8",
        "text": [
          " صَلَّى بِنَا أَبُو بَصِيرٍ فِي طَرِيقِ مَكَّةَ فَقَالَ وَ هُوَ سَاجِدٌ وَ قَدْ كَانَتْ ضَلَّتْ نَاقَةٌ لِجَمَّالِهِمْ اللَّهُمَّ رُدَّ عَلَى فُلَانٍ نَاقَتَهُ ",
          "قَالَ مُحَمَّدٌ فَدَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَأَخْبَرْتُهُ قَالَ وَ فَعَلَ قُلْتُ نَعَمْ قَالَ وَ فَعَلَ قُلْتُ نَعَمْ قَالَ فَسَكَتَ قُلْتُ فَأُعِيدُ الصَّلَاةَ قَالَ لَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Hisham Bin Salim, from Muhammad Bin Muslim who said, ",
            "‘Abu Baseer prayed <span class=\"iTxt\">Salāt</span> with us in a street of Makkah, and he said while he was prostrating, and a she-camel of their cameleer had strayed, ‘O Allah<sup>azwj</sup>! Return to so and so, his camel’. ",
            "Muhammad (the narrator) said, ‘So I went over to Abu Abdullah<sup>asws</sup> and informed him<sup>asws</sup>. He<sup>asws</sup> said: ‘And he did so?’ I said, ‘Yes’. So he<sup>asws</sup> remained silent. I said, ‘So, should he repeat the <span class=\"iTxt\">Salāt</span>?’ He<sup>asws</sup> said: ‘No’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn abu ‘Umayr from Hisham ibn Salim from Muhammad ibn Muslim who has said the following: “Abu Basir once on the way to Makkah performed Salah (prayer) with us as the leader and while in Sajdah (prostration) said, ‘O Lord, - a camel of their camel man was lost-, return to so and so his camel.’ Muhammad has said that I then went to visit abu ‘Abd Allah, ‘Alayhi al-Salam, and informed him (about what abu Basir had said in Sajdah (prostration)). He (the Imam) asked, ‘Did he do so? I replied, ‘Yes, he did.’ He (the Imam) remained quiet. I then asked, ‘Must I perform Salah (prayer) again?’ He (the Imam) replied, ‘No, (it is not necessary).”’ (Hadith 8 is best explained in the form of fatwa.) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/130)"
        ],
        "index": 5009,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/16",
              "text": "أَحْمَدُ بْنُ إِدْرِيسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/28",
              "text": "إِسْحَاقَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:9",
        "text": [
          " قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي كُنْتُ أُمَهِّدُ لِأَبِي فِرَاشَهُ فَأَنْتَظِرُهُ حَتَّى يَأْتِيَ فَإِذَا أَوَى إِلَى فِرَاشِهِ وَ نَامَ قُمْتُ إِلَى فِرَاشِي وَ إِنَّهُ أَبْطَأَ عَلَيَّ ذَاتَ لَيْلَةٍ فَأَتَيْتُ الْمَسْجِدَ فِي طَلَبِهِ وَ ذَلِكَ بَعْدَ مَا هَدَأَ النَّاسُ ",
          "فَإِذَا هُوَ فِي الْمَسْجِدِ سَاجِدٌ وَ لَيْسَ فِي الْمَسْجِدِ غَيْرُهُ فَسَمِعْتُ حَنِينَهُ وَ هُوَ يَقُولُ سُبْحَانَكَ اللَّهُمَّ أَنْتَ رَبِّي حَقّاً حَقّاً سَجَدْتُ لَكَ يَا رَبِّ تَعَبُّداً وَ رِقّاً اللَّهُمَّ إِنَّ عَمَلِي ضَعِيفٌ فَضَاعِفْهُ لِي اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ وَ تُبْ عَلَيَّ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Ahmad Bin Muhammad, from Ibn Mahboub, from Is’haq Bin Ammar who said, ",
            "‘Abu Abdullah<sup>asws</sup> said to me: ‘I<sup>asws</sup> used to even out the bed for my<sup>asws</sup> father<sup>asws</sup> until he<sup>asws</sup> would come. So when he<sup>asws</sup> would lie down upon his<sup>asws</sup> bed and sleep, I<sup>asws</sup> would arise to go to my<sup>asws</sup> own bed. One night he<sup>asws</sup> was delayed, so I<sup>asws</sup> went over to the Masjid seeking him<sup>asws</sup>, and that was after the people had dispersed. ",
            "So there he<sup>asws</sup> was in the Masjid, prostrating, and there was no one in the Masjid apart from him<sup>asws</sup>, and I<sup>asws</sup> heard his<sup>asws</sup> yearning and he<sup>asws</sup> was saying: ‘O Allah<sup>azwj</sup>! You<sup>azwj</sup> are my Lord<sup>azwj</sup>, truly, truly. I<sup>asws</sup> am prostrating to You<sup>azwj</sup>, O Lord<sup>azwj</sup>, as a servant and a slave. O Allah<sup>azwj</sup>! My<sup>asws</sup> deeds are weak, so Increase these for me<sup>asws</sup>. O Allah<sup>azwj</sup>! Save me<sup>asws</sup> (my<sup>asws</sup> Shias) from Your<sup>azwj</sup> Punishment on the Day You<sup>azwj</sup> will be Resurrecting Your<sup>azwj</sup> servants, and Turn towards me (with Mercy) for You<sup>azwj</sup> are the Oft-Turning, Merciful’."
          ],
          "en.sarwar": [
            "9. Ahmad ibn Idris has narrated from Ahmad ibn Muhammad from ibn Mahbub from Ishaq ibn ‘Ammar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘I would prepare the bed for my father and wait for his coming until he would go to sleep; then I would leave to go to bed. One night he delayed and I went to the Masjid to search him. This was the time when people had already left and it was quite calm out there. I found him in the Masjid prostrating and there was no one in the Masjid except him. I heard his affectionate plea saying, “(O Lord,) You are free of all defects, You are my Lord, in all truth, there is no doubt. I have prostrated before You, my Lord as (Your) slave and a sole servant. O Lord, my deeds are weak, so please increase them for me. O Lord, save me from Your punishment on the Day when Your servants are resurrected and turn to me to accept my repentance. You accept repentance and grant mercy.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/131)"
        ],
        "index": 5010,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/793",
              "text": "أَحْمَدُ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2626",
              "text": "أَبِي جَرِيرٍ الرَّوَّاسِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي جَرِيرٍ الرَّوَّاسِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:10",
        "text": [
          " سَمِعْتُ أَبَا الْحَسَنِ مُوسَى ( عليه السلام ) وَ هُوَ يَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ الرَّاحَةَ عِنْدَ الْمَوْتِ وَ الْعَفْوَ عِنْدَ الْحِسَابِ يُرَدِّدُهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad, from Ibn Mahboub, from Abu Jareer Al Rawwasy who said, ",
            "‘I heard Abu Al-Hassan Musa<sup>asws</sup>, and he<sup>asws</sup> was saying: ‘O Allah<sup>azwj</sup>! I<sup>asws</sup> ask You<sup>azwj</sup> for the rest during the death, and Pardoning during the Reckoning’ – repeatedly’."
          ],
          "en.sarwar": [
            "10. Ahmad has narrated from ibn Mahbub from abu Jarir al-Rawasiy who has said the following: “I heard abu al-Hassan Musa, ‘Alayhi al-Salam, say, ‘O Lord, I pray to You to grant me comfort at the time of death and forgiveness at the time of issuing judgments repeatedly.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/131)"
        ],
        "index": 5011,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/457",
              "text": "الْحَجَّالِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/148",
              "text": "عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/301",
              "text": "ثَعْلَبَةَ بْنِ مَيْمُونٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2627",
              "text": "عَبْدِ اللَّهِ بْنِ هِلَالٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَجَّالِ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ عَبْدِ اللَّهِ بْنِ هِلَالٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:11",
        "text": [
          " شَكَوْتُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) تَفَرُّقَ أَمْوَالِنَا وَ مَا دَخَلَ عَلَيْنَا فَقَالَ عَلَيْكَ بِالدُّعَاءِ وَ أَنْتَ سَاجِدٌ فَإِنَّ أَقْرَبَ مَا يَكُونُ الْعَبْدُ إِلَى اللَّهِ وَ هُوَ سَاجِدٌ ",
          "قَالَ قُلْتُ فَأَدْعُو فِي الْفَرِيضَةِ وَ أُسَمِّي حَاجَتِي فَقَالَ نَعَمْ قَدْ فَعَلَ ذَلِكَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَدَعَا عَلَى قَوْمٍ بِأَسْمَائِهِمْ وَ أَسْمَاءِ آبَائِهِمْ وَ فَعَلَهُ عَلِيٌّ ( عليه السلام ) بَعْدَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hajjal, from Abdullah Bin Muhammad, from Sa’albat Bin Maymoun, from Abdullah Bin Hilal who said, ",
            "‘I complained to Abu Abdullah<sup>asws</sup> of the separation of our wealth and what had entered upon us (as a result of it)’. So he<sup>asws</sup> said: ‘It is upon you with the supplication while you are prostrating, for the closest of what the servant can happen to be to Allah<sup>azwj</sup> is when he is prostrating’. ",
            "He (the narrator) said, ‘I said, ‘So shall I supplicate during the Obligatory (<span class=\"iTxt\">Salāt</span>) and specify my need?’ So he<sup>asws</sup> said: ‘Yes. Rasool-Allah<sup>saww</sup> had done that, and he<sup>saww</sup> supplicated against a people with their names and the names of their fathers; and Ali<sup>asws</sup> did so after him<sup>saww</sup>’."
          ],
          "en.sarwar": [
            "11. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hajjal from ‘Abd Allah ibn Muhammad from Tha’labah ibn Maymun from ‘Abd Allah ibn Hilal who has said the following: “I once complained before abu ‘Abd Allah, ‘Alayhi al-Salam, about the difficulties we faced and deprivation from our belongings. He (the Imam) said, ‘You must plead (before Allah) when you are in Sajdah (prostration) position; the nearest position to Allah for a servant of Allah is one’s position in Sajdah (prostration).’ I then asked, ‘Can I plead (before Allah) in obligatory Salah (prayer) and mention my needs?’ He (the Imam) replied, ‘Yes, you can do so; the Messenger of Allah had done so. He pleaded (before Allah) against a people and mentioned their names and the names of their fathers. After him Ali, ‘Alayhi al-Salam, also had done so.’” (Hadith 11 is best explained in the form of fatwa.) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/132)"
        ],
        "index": 5012,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/47",
              "text": "جَمَاعَةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/162",
              "text": "الْقَاسِمِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/118",
              "text": "عَلِيِّ بْنِ أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "جَمَاعَةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:12",
        "text": [
          " كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عِنْدَ عَائِشَةَ ذَاتَ لَيْلَةٍ فَقَامَ يَتَنَفَّلُ فَاسْتَيْقَظَتْ عَائِشَةُ فَضَرَبَتْ بِيَدِهَا فَلَمْ تَجِدْهُ فَظَنَّتْ أَنَّهُ قَدْ قَامَ إِلَى جَارِيَتِهَا فَقَامَتْ تَطُوفُ عَلَيْهِ فَوَطِئَتْ عُنُقَهُ ( صلى الله عليه وآله ) وَ هُوَ سَاجِدٌ بَاكٍ يَقُولُ سَجَدَ لَكَ سَوَادِي وَ خَيَالِي وَ آمَنَ بِكَ فُؤَادِي أَبُوءُ إِلَيْكَ بِالنِّعَمِ وَ أَعْتَرِفُ لَكَ بِالذَّنْبِ الْعَظِيمِ عَمِلْتُ سُوءاً وَ ظَلَمْتُ نَفْسِي ",
          "فَاغْفِرْ لِي إِنَّهُ لَا يَغْفِرُ الذَّنْبَ الْعَظِيمَ إِلَّا أَنْتَ أَعُوذُ بِعَفْوِكَ مِنْ عُقُوبَتِكَ وَ أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ وَ أَعُوذُ بِرَحْمَتِكَ مِنْ نَقِمَتِكَ وَ أَعُوذُ بِكَ مِنْكَ لَا أَبْلُغُ مَدْحَكَ وَ الثَّنَاءَ عَلَيْكَ أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ أَسْتَغْفِرُكَ وَ أَتُوبُ إِلَيْكَ ",
          "فَلَمَّا انْصَرَفَ قَالَ يَا عَائِشَةُ لَقَدْ أَوْجَعْتِ عُنُقِي أَيَّ شَيْ‏ءٍ خَشِيتِ أَنْ أَقُومَ إِلَى جَارِيَتِكِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A group of our companions, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad, from Ali Bin Abu Hamza, ",
            "(It has been narrated) from Abu Baseer, from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> was with Ayesha one night, and he<sup>saww</sup> arose to pray the Optional <span class=\"iTxt\">Salāt</span>. So Ayesha woke up and she struck by her hand, but did not find him<sup>saww</sup>. So she thought that he<sup>asws</sup> had gone to her slave girl. So she stood up circling upon him<sup>saww</sup> and she trampled upon his<sup>saww</sup> neck, and he<sup>saww</sup> was prostrating, weeping, saying: ‘I<sup>saww</sup> perform <span class=\"iTxt\">Sajdah</span> to You<sup>saww</sup> in my<sup>saww</sup> mourning garments and my<sup>saww</sup> views, and I<sup>saww</sup> believe in You<sup>azwj</sup> with my<sup>saww</sup> heart acknowledging to You<sup>azwj</sup> of my<sup>saww</sup> Blessings, and acknowledging to You<sup>azwj</sup> with the great sin, evil deed and being unjust to myself<sup>saww</sup>’ (on behalf of my<sup>saww</sup> nation). ",
            "Therefore, Forgive my<sup>asws</sup> (nation) there being no Forgiver of the great sins except for You<sup>azwj</sup>. I<sup>saww</sup> hereby seek Refuge with Your<sup>azwj</sup> Pardoning, and I<sup>saww</sup> seek Refuge with Your<sup>azwj</sup> Pleasure from Your<sup>azwj</sup> Anger, and I<sup>saww</sup> seek Refuge with Your<sup>azwj</sup> Mercy from Your<sup>azwj</sup> Curse, and I<sup>saww</sup> seek Refuge with You<sup>azwj</sup> from You<sup>azwj</sup>. I<sup>saww</sup> cannot deservingly deliver Your<sup>azwj</sup> Praise and Laudation upon You<sup>azwj</sup> . You<sup>azwj</sup> are as You<sup>azwj</sup> Praised upon Yourself<sup>saww</sup>. I seek Forgiveness from You<sup>azwj</sup> and I<sup>saww</sup> turn to You<sup>azwj</sup>’. ",
            "So when he<sup>saww</sup> finished, said: ‘O Ayesha! You have inflicted pain upon my<sup>saww</sup> neck. Which thing did you fear, that I<sup>saww</sup> have stood up to go to your slave girl?’"
          ],
          "en.sarwar": [
            "12. A group of our people has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa‘id from al-Qasim ibn Muhammad from Ali ibn abu Hamzah from abu Basir who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘Once, the Holy Prophet, when he was with ‘A’ishah, during the night decided to perform optional Salah (prayer). ‘A’ishah woke up and searched around for him with her hand but did not find him. She thought he might have gone to her slave girl. She got up searching around and stepped on his neck when he was prostrating, weeping and saying, ‘(O Lord,) my person and my imagination have prostrated before You and my heart believes in You. I come to You with bounties and confess my great sin. I have done a bad deed. I have done injustice to myself so forgive me; no one forgives a great sin except You. I seek refuge with Your pardon from Your punishment, I seek refuge with Your pleasure from Your anger, I seek refuge with Your mercy from Your punishment and I seek refuge with You from You. I can never praise or admire You sufficiently. You are as You have praised Yourself. I ask forgiveness from You and turn to You in repentance.’ When he came back he asked, “A’ishah, why did you hurt my neck? Were you afraid that I might go to your slave girl?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/134)"
        ],
        "index": 5013,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/173",
              "text": "ذَكَرَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1968",
              "text": "مُحَمَّدِ بْنِ أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَمَّنْ ذَكَرَهُ عَنْ مُحَمَّدِ بْنِ أَبِي حَمْزَةَ عَنْ أَبِيهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:13",
        "text": [
          " قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) مَنْ قَالَ فِي رُكُوعِهِ وَ سُجُودِهِ وَ قِيَامِهِ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ كَتَبَ اللَّهُ لَهُ بِمِثْلِ الرُّكُوعِ وَ السُّجُودِ وَ الْقِيَامِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from his father, from the one who mentioned it, from Muhammad Bin Abu Hamza, from his father who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘The one who says in his <span class=\"iTxt\">Rukū</span> (bowing) and his <span class=\"iTxt\">Sajdah</span>, and his standing: ‘May Allah<sup>azwj</sup> Send Blessings upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>’, Allah<sup>azwj</sup> would Write for him (Rewards) the like of his <span class=\"iTxt\">Rukū</span>, and his <span class=\"iTxt\">Sajdah</span>, and the standing’."
          ],
          "en.sarwar": [
            "13. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from his father from the one whom he has mentioned from Muhammad ibn abu Hamzah from his father who has said the following: “If one says during his Ruku‘, sajdah or standing position, ‘Allahumma Salli ‘Ala Muhammad wa ‘Ali Muhammad (O Allah grant Muhammad and his family a compensation worthy of their serving Your cause),’ Allah writes for him the reward for a sajdah, Ruku‘ or standing for worship.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/134)"
        ],
        "index": 5014,
        "local_index": 14,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2628",
              "text": "جَعْفَرِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَعْفَرِ بْنِ عَلِيٍّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:14",
        "text": [
          " رَأَيْتُ أَبَا الْحَسَنِ ( عليه السلام ) وَ قَدْ سَجَدَ بَعْدَ الصَّلَاةِ فَبَسَطَ ذِرَاعَيْهِ عَلَى الْأَرْضِ وَ أَلْصَقَ جُؤْجُؤَهُ بِالْأَرْضِ فِي دُعَائِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ja’far Bin Ali who said, ",
            "‘I saw Abu Al-Hassan<sup>asws</sup> and he<sup>asws</sup> was prostrating after the <span class=\"iTxt\">Salāt</span>. So he<sup>asws</sup> spread out his<sup>asws</sup> arms upon the ground and paste his<sup>asws</sup> chest upon the ground’."
          ],
          "en.sarwar": [
            "14. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Ja‘far ibn Ali who has said the following: “I saw abu al-Hassan, ‘Alayhi al-Salam, doing sajdah for after Salah (prayer), his arms spread on the ground and his chest and belly placed on the ground when praying.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/134)"
        ],
        "index": 5015,
        "local_index": 15,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2629",
              "text": "يَحْيَى بْنِ عَبْدِ الرَّحْمَنِ بْنِ خَاقَانَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ يَحْيَى بْنِ عَبْدِ الرَّحْمَنِ بْنِ خَاقَانَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:15",
        "text": [
          " رَأَيْتُ أَبَا الْحَسَنِ الثَّالِثَ ( عليه السلام ) سَجَدَ سَجْدَةَ الشُّكْرِ فَافْتَرَشَ ذِرَاعَيْهِ فَأَلْصَقَ جُؤْجُؤَهُ وَ بَطْنَهُ بِالْأَرْضِ فَسَأَلْتُهُ عَنْ ذَلِكَ فَقَالَ كَذَا نُحِبُّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Yahya Bin Abdul Rahman Bin Khaqan who said, ",
            "‘I saw Abu Al-Hassan<sup>asws</sup> the 3<sup>rd</sup> prostrating the <span class=\"iTxt\">Sajdah</span> of gratitude, and he<sup>asws</sup> spread out his<sup>asws</sup> arms and touched his<sup>asws</sup> chest and his<sup>asws</sup> belly with the ground. So I asked him<sup>asws</sup> about that, and he<sup>asws</sup> said: ‘Such is how we<sup>asws</sup> love to do’."
          ],
          "en.sarwar": [
            "15. Ali ibn Ibrahim has narrated from Yahya ibn ‘Abd al-Rahman ibn Khaqan who has said the following: “I saw abu al-Hassan, the third doing sajdah for Shukr (thanksgiving), his arms spread on the ground and his chest and belly placed on the ground. I asked him about it and he said, ‘This is what we like.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/134)"
        ],
        "index": 5016,
        "local_index": 16,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/450",
              "text": "سَهْلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2630",
              "text": "أَحْمَدَ بْنِ عَبْدِ الْعَزِيزِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ حَدَّثَنِي "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/80",
              "text": "بَعْضُ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلٍ عَنْ أَحْمَدَ بْنِ عَبْدِ الْعَزِيزِ قَالَ حَدَّثَنِي بَعْضُ أَصْحَابِنَا قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:16",
        "relations": {
          "Mentions": [
            "/books/quran:51:17",
            "/books/quran:51:18"
          ]
        },
        "text": [
          " كَانَ أَبُو الْحَسَنِ الْأَوَّلُ ( عليه السلام ) إِذَا رَفَعَ رَأْسَهُ مِنْ آخِرِ رَكْعَةِ الْوَتْرِ قَالَ هَذَا مَقَامُ مَنْ حَسَنَاتُهُ نِعْمَةٌ مِنْكَ وَ شُكْرُهُ ضَعِيفٌ وَ ذَنْبُهُ عَظِيمٌ وَ لَيْسَ لَهُ إِلَّا دَفْعُكَ وَ رَحْمَتُكَ فَإِنَّكَ قُلْتَ فِي كِتَابِكَ الْمُنْزَلِ عَلَى نَبِيِّكَ الْمُرْسَلِ ( صلى الله عليه وآله ) كانُوا قَلِيلًا مِنَ اللَّيْلِ ما يَهْجَعُونَ وَ بِالْأَسْحارِ هُمْ يَسْتَغْفِرُونَ طَالَ هُجُوعِي وَ قَلَّ قِيَامِي وَ هَذَا السَّحَرُ وَ أَنَا أَسْتَغْفِرُكَ لِذَنْبِي اسْتِغْفَارَ مَنْ لَمْ يَجِدْ لِنَفْسِهِ ضَرّاً وَ لَا نَفْعاً وَ لَا مَوْتاً وَ لَا حَيَاةً وَ لَا نُشُوراً ",
          "ثُمَّ يَخِرُّ سَاجِداً ( صلوات الله عليه ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl, from Ahmad Bin Abdul Aziz who said, ‘One of our companions narrate to be saying, ",
            "‘It was so that whenever Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup> raised his<sup>asws</sup> head from the last <span class=\"iTxt\">Rak’at</span> of Al-Witr (<span class=\"iTxt\">Salāt</span>), said: ‘This is a place of the one whose good deeds are a Bounty from You<sup>azwj</sup> and his gratitude is weak, and his sins are great, and it is not for him except for Your<sup>azwj</sup> Defence and Your<sup>azwj</sup> Mercy, for You<sup>azwj</sup> Said in Your<sup>azwj</sup> Book Revealed upon Your<sup>azwj</sup> Dispatched Prophet<sup>saww</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:51#h17\">[51:17]</a> They used to sleep but little in the night. <a href=\"/#/books/quran:51#h18\">[51:18]</a> And in the morning they sought Forgiveness</span>. And little is my<sup>asws</sup> standing, and this is the morning and I<sup>asws</sup> am seeking Forgiveness from You<sup>azwj</sup> for sins of my<sup>asws</sup> (Shias) and seeking of the Forgiveness of the one who can neither find for himself a harm, nor a benefit, nor death, nor life, nor Resurrection’. ",
            "Then fall down in the <span class=\"iTxt\">Sajdah</span>’."
          ],
          "en.sarwar": [
            "16. Ali ibn Muhammad has narrated from Sahl from Ahmad ibn ‘Abd al-‘Aziz who has said that narrated to him certain persons of our people saying: “When abu al-Hassan the first, ‘Alayhi al-Salam, raised his head from last sajdah of witr prayer he said, ‘This is a position of one whose good deeds are due to Your bounties and whose thanksgiving is weak, but his sin is great. He does not have anything other than Your defending him and granting him mercy. You have said in Your book revealed to Your Holy Prophet and Messenger, “They sleep at night very little and in the morning ask forgiveness for their sins” (51: 18-19). My sleep has been very long and my standing for Salah (prayer) very little. This is morning. I ask You to forgive me my sin, like the one who is unable to harm himself, or benefit, control his death, life or resurrection.’ Then he, ‘Alayhi al-Salam, would bow down to prostrate.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/135)"
        ],
        "index": 5017,
        "local_index": 17,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/694",
              "text": "عَبْدِ اللَّهِ بْنِ جُنْدَبٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ جُنْدَبٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:17",
        "text": [
          " سَأَلْتُ أَبَا الْحَسَنِ الْمَاضِي ( عليه السلام ) عَمَّا أَقُولُ فِي سَجْدَةِ الشُّكْرِ فَقَدِ اخْتَلَفَ أَصْحَابُنَا فِيهِ فَقَالَ قُلْ وَ أَنْتَ سَاجِدٌ ",
          "اللَّهُمَّ إِنِّي أُشْهِدُكَ وَ أُشْهِدُ مَلَائِكَتَكَ وَ أَنْبِيَاءَكَ وَ رُسُلَكَ وَ جَمِيعَ خَلْقِكَ أَنَّكَ اللَّهُ رَبِّي وَ الْإِسْلَامَ دِينِي وَ مُحَمَّداً نَبِيِّي وَ عَلِيّاً وَ فُلَاناً وَ فُلَاناً إِلَى آخِرِهِمْ أَئِمَّتِي بِهِمْ أَتَوَلَّى وَ مِنْ عَدُوِّهِمْ أَتَبَرَّأُ",
          "اللَّهُمَّ إِنِّي أَنْشُدُكَ دَمَ الْمَظْلُومِ ثَلَاثاً اللَّهُمَّ إِنِّي أَنْشُدُكَ بِإِيوَائِكَ عَلَى نَفْسِكَ لِأَوْلِيَائِكَ لِتُظْفِرَنَّهُمْ بِعَدُوِّكَ وَ عَدُوِّهِمْ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَ عَلَى الْمُسْتَحْفَظِينَ مِنْ آلِ مُحَمَّدٍ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْيُسْرَ بَعْدَ الْعُسْرِ ثَلَاثاً ",
          "ثُمَّ ضَعْ خَدَّكَ الْأَيْمَنَ عَلَى الْأَرْضِ وَ تَقُولُ يَا كَهْفِي حِينَ تُعْيِينِي الْمَذَاهِبُ وَ تَضِيقُ عَلَيَّ الْأَرْضُ بِمَا رَحُبَتْ وَ يَا بَارِئَ خَلْقِي رَحْمَةً بِي وَ قَدْ كَانَ عَنْ خَلْقِي غَنِيّاً صَلِّ عَلَى مُحَمَّدٍ وَ عَلَى الْمُسْتَحْفَظِينَ مِنْ آلِ مُحَمَّدٍ ",
          "ثُمَّ ضَعْ خَدَّكَ الْأَيْسَرَ وَ تَقُولُ ",
          "يَا مُذِلَّ كُلِّ جَبَّارٍ وَ يَا مُعِزَّ كُلِّ ذَلِيلٍ قَدْ وَ عِزَّتِكَ بَلَغَ بِي مَجْهُودِي ثَلَاثاً",
          "ثُمَّ تَقُولُ يَا حَنَّانُ يَا مَنَّانُ يَا كَاشِفَ الْكُرَبِ الْعِظَامِ ثَلَاثاً ",
          "ثُمَّ تَعُودُ لِلسُّجُودِ فَتَقُولُ مِائَةَ مَرَّةٍ شُكْراً شُكْراً ثُمَّ تَسْأَلُ حَاجَتَكَ إِنْ شَاءَ اللَّهُ تَعَالَى ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Bin Jundab who said, ",
            "‘I asked Abu Al-Hassan Al-Maazy<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) about what I should be saying during a <span class=\"iTxt\">Sajdah</span> of gratitude, for our companions have differed with regards to it’. So he<sup>asws</sup> said: ‘Say while you are in <span class=\"iTxt\">Sajdah</span>, ",
            "‘O Allah<sup>azwj</sup>! I keep You<sup>azwj</sup> as a Witness, and keep as a witness Your<sup>azwj</sup> Angels, and Your<sup>azwj</sup> Prophets<sup>as</sup>, and Your<sup>azwj</sup> Mursil Prophets<sup>as</sup>, and the entirety of Your<sup>azwj</sup> creature that You<sup>azwj</sup> are Allah<sup>azwj</sup> my Lord<sup>azwj</sup>, and Al-Islam is my Religion, and Muhammad<sup>saww</sup> is my Prophet<sup>saww</sup>, and Ali<sup>asws</sup> and so and so, up to the last of them<sup>asws</sup>, they<sup>asws</sup> are my Imams<sup>asws</sup>. With them<sup>asws</sup> I befriend and from their<sup>asws</sup> enemies I disavow. ",
            "O Allah<sup>azwj</sup>! I adjure You<sup>azwj</sup> by the blood of the oppressed’ (Imam Husayn<sup>asws</sup>) – three times. O Allah<sup>azwj</sup>! I adjure You<sup>azwj</sup> with Your<sup>azwj</sup> Promise upon Yourself<sup>azwj</sup> of Making Your<sup>azwj</sup> Guardians<sup>asws</sup> victorious upon Your<sup>azwj</sup> enemies and their<sup>asws</sup> enemies, that You<sup>azwj</sup> Send Blessings upon Muhammad<sup>saww</sup> and the upon the weak ones from the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>. O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> for the ease after the difficulties’ – three times. ",
            "Then place your right cheek upon the ground and you should be saying, ‘O my Cave where the doctrines wear me down and the earth is straitened upon me with what I wish for, and O Initiator of my creation, be Merciful with me, and You<sup>azwj</sup> were needless of my creation, Send Blessings upon Muhammad<sup>saww</sup> and upon the weak ones from the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>’. ",
            "Then place your left cheek (upon the ground) and you should be saying, ",
            ";O Humiliator of every tyrant, and O Honourer of every humiliated one. And I swear by Your<sup>azwj</sup> Might that my striving has reached its end’ – three times.",
            "Then you should be saying, ‘O Affectionate, O Bestower, O Remover of the great worries! – three times. ",
            "Then return to the <span class=\"iTxt\">Sajdah</span>, and you should be saying one hundred times, ‘Thank You<sup>azwj</sup>! Thank You<sup>azwj</sup>!’ Then you should ask for your need, Allah<sup>azwj</sup> Willing’."
          ],
          "en.sarwar": [
            "17. Ali ibn Ibrahim has narrated from his father from ‘Abd Allah ibn Jundab who has said the following: “I asked abu al-Hassan, ‘Alayhi al-Salam, about what to say in prostration for thanksgiving because our people are not of the same idea about it. He told me to say the following in a prostrating position: ‘O Lord, I beg You to bear witness, I beg Your angels, Your prophets, messengers and all of Your creatures to bear witness (to my testimony) that You are Allah. You are my Lord. Islam is my religion and Muhammad is my prophet. Ali and all of my ’A’immah so and so’ - mentioning one by one - ‘al- Hassan, al-Husayn, Ali ibn al-Husayn, Muhammad ibn Ali, Ja‘far ibn Muhammad, Musa ibn Ja‘far, Ali ibn Musa, Muhammad ibn Ali, Ali ibn Muhammad, al-Hassan ibn Ali and al-Mahdi are my ’A’immah, ‘Alayhim al-Salam. I have acknowledged their divine authority and as my guardians, I love them and I denounce their enemies. O Lord, I plead before You through the blood of the one who suffered injustice,’ - three times - ‘O Lord I plead before You through Your firm undertaking of granting victory to Your friends - those whom You have entrusted with Your Authority- over Your enemy as well as their enemy. O Allah, I appeal before You to grant Muhammad and those members of his family who have safeguarded their trust compensation. Grant them a compensation worthy of their services to Your cause. O Lord, I request You to grant me comfort after suffering’ - three times. Then place the right side of your face on the ground. Say, ‘O my protector at times when all means become useless and the whole wide world seems to have become narrow, O my creator due to His mercy not because of being in need of such creation, O Allah, grant proper compensation to Muhammad and those members of his family who have safeguarded their trust.’ Then place the left side of your face on the ground and say, ‘O subjugator of tyrants and bestowing honor to the oppressed ones. I swear by Your majesty that my efforts are exhausted’ - three times. Then say, ‘O the affectionate one, the One who grants favors, O the One who removes great hardships’ - three times. Then bow down for prostration and say one hundred times, ‘Shukran’ (I thank You, O Lord); then ask from Allah what you need by the will of Allah, the most High.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/137)"
        ],
        "index": 5018,
        "local_index": 18,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/222",
              "text": "عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2579",
              "text": "سُلَيْمَانَ بْنِ حَفْصٍ الْمَرْوَزِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ عَنْ سُلَيْمَانَ بْنِ حَفْصٍ الْمَرْوَزِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:18",
        "text": [
          " كَتَبْتُ إِلَى أَبِي الْحَسَنِ مُوسَى بْنِ جَعْفَرٍ ( عليه السلام ) فِي سَجْدَةِ الشُّكْرِ فَكَتَبَ إِلَيَّ مِائَةَ مَرَّةٍ شُكْراً شُكْراً وَ إِنْ شِئْتَ عَفْواً عَفْواً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Ali Bin Muhammad Al Qasany, from Suleyman Bin Hafs Al Marouzy who said, ",
            "‘I wrote to Abu Al-Hassan Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup> regarding the <span class=\"iTxt\">Sajdah</span>-e-<span class=\"iTxt\">Shukr</span> (<span class=\"iTxt\">Sajdah</span> of gratitude). So he<sup>asws</sup> wrote to me: ‘One hundred times (saying) ‘Thank You<sup>azwj</sup>!’, and if you so desire, (saying), ‘Excuse me! Excuse me!’ (one hundred times)’."
          ],
          "en.sarwar": [
            "18. Ali ibn Ibrahim has narrated from Ali ibn Muhammad al-Qasaniy from Sulayman ibn Hafs al-Marwaziy who has said the following: “I wrote to abu al-Hassan Musa ibn Ja‘far, ‘Alayhi al-Salam, about prostration for thanksgiving. He wrote back to me. ‘It is one hundred times ‘Shukran’ (O Lord, I thank You), or if you like, say “Afwan’ (O Lord, I beg forgiveness from You) one hundred times.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/137)"
        ],
        "index": 5019,
        "local_index": 19,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/68",
              "text": "مُحَمَّدِ بْنِ سُلَيْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ أَبِيهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:19",
        "text": [
          " خَرَجْتُ مَعَ أَبِي الْحَسَنِ مُوسَى بْنِ جَعْفَرٍ ( عليه السلام ) إِلَى بَعْضِ أَمْوَالِهِ فَقَامَ إِلَى صَلَاةِ الظُّهْرِ فَلَمَّا فَرَغَ خَرَّ لِلَّهِ سَاجِداً فَسَمِعْتُهُ يَقُولُ بِصَوْتٍ حَزِينٍ وَ تَغَرْغَرُ دُمُوعُهُ رَبِّ عَصَيْتُكَ بِلِسَانِي وَ لَوْ شِئْتَ وَ عِزَّتِكَ لَأَخْرَسْتَنِي ",
          "وَ عَصَيْتُكَ بِبَصَرِي وَ لَوْ شِئْتَ وَ عِزَّتِكَ لَأَكْمَهْتَنِي وَ عَصَيْتُكَ بِسَمْعِي وَ لَوْ شِئْتَ وَ عِزَّتِكَ لَأَصْمَمْتَنِي وَ عَصَيْتُكَ بِيَدِي وَ لَوْ شِئْتَ وَ عِزَّتِكَ لَكَنَّعْتَنِي ",
          "وَ عَصَيْتُكَ بِرِجْلِي وَ لَوْ شِئْتَ وَ عِزَّتِكَ لَجَذَمْتَنِي وَ عَصَيْتُكَ بِفَرْجِي وَ لَوْ شِئْتَ وَ عِزَّتِكَ لَعَقَمْتَنِي وَ عَصَيْتُكَ بِجَمِيعِ جَوَارِحِي الَّتِي أَنْعَمْتَ بِهَا عَلَيَّ وَ لَيْسَ هَذَا جَزَاءَكَ مِنِّي",
          "قَالَ ثُمَّ أَحْصَيْتُ لَهُ أَلْفَ مَرَّةٍ وَ هُوَ يَقُولُ الْعَفْوَ الْعَفْوَ قَالَ ثُمَّ أَلْصَقَ خَدَّهُ الْأَيْمَنَ بِالْأَرْضِ فَسَمِعْتُهُ وَ هُوَ يَقُولُ بِصَوْتٍ حَزِينٍ بُؤْتُ إِلَيْكَ بِذَنْبِي عَمِلْتُ سُوءاً وَ ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ غَيْرُكَ يَا مَوْلَايَ ثَلَاثَ مَرَّاتٍ ",
          "ثُمَّ أَلْصَقَ خَدَّهُ الْأَيْسَرَ بِالْأَرْضِ فَسَمِعْتُهُ يَقُولُ ارْحَمْ مَنْ أَسَاءَ وَ اقْتَرَفَ وَ اسْتَكَانَ وَ اعْتَرَفَ ثَلَاثَ مَرَّاتٍ ثُمَّ رَفَعَ رَأْسَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Muhammad Bin Suleyman, from his father who said, ",
            "‘I went along with Abu Al-Hassan Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup> to one of his<sup>asws</sup> properties. So he<sup>asws</sup> stood for Al-Zohr <span class=\"iTxt\">Salāt</span>. So when he<sup>asws</sup> was free, he<sup>asws</sup> fell down in <span class=\"iTxt\">Sajdah</span> to Allah<sup>azwj</sup>, and I heard him<sup>asws</sup> saying in a grief-laden voice and his<sup>asws</sup> tears flowing profusely: ‘Lord<sup>azwj</sup>! I<sup>asws</sup> disobeyed You<sup>azwj</sup> with my<sup>asws</sup> tongue, and had You<sup>azwj</sup> Desired to, by Your<sup>azwj</sup> Mighty, You<sup>azwj</sup> would have Muted me<sup>asws</sup>.",
            "And I<sup>asws</sup> disobeyed You<sup>azwj</sup> with my<sup>asws</sup> vision, and had You<sup>azwj</sup> so Desired to, by Your<sup>azwj</sup> Mighty, You<sup>azwj</sup> would have Blinded me<sup>asws</sup>; and I<sup>asws</sup> disobeyed You<sup>azwj</sup> with my<sup>asws</sup> ears, and had You<sup>azwj</sup> so Desired to, by Your<sup>azwj</sup> Might, You<sup>azwj</sup> would have Deafened me<sup>asws</sup>; and I<sup>asws</sup> disobeyed You<sup>azwj</sup> with my<sup>asws</sup> hands, and had You<sup>azwj</sup> so Desired to, by Your<sup>azwj</sup> Might, You<sup>azwj</sup> Crippled me<sup>asws</sup>.",
            "And I<sup>asws</sup> disobeyed You<sup>azwj</sup> with my<sup>asws</sup> legs, and had You<sup>azwj</sup> so Desire to, by Your<sup>azwj</sup> Might, would have Disabled me; and I<sup>asws</sup> disobeyed You<sup>azwj</sup> with my<sup>asws</sup> private part, and had You<sup>azwj</sup> Desired to, by Your<sup>azwj</sup> Might, You<sup>azwj</sup> would have Sterlised me<sup>asws</sup>; and I<sup>asws</sup> disobeyed You<sup>azwj</sup> with the entirety of my<sup>asws</sup> body parts which You<sup>azwj</sup> Favoured upon me<sup>asws</sup> with, and this is not Your<sup>azwj</sup> recompense from me<sup>asws</sup>’.",
            "He (the narrator) said, ‘Then I counted for him<sup>asws</sup> a thousand times, and he<sup>asws</sup> was saying: ‘The Pardon! The Pardon!’ Then he<sup>asws</sup> pasted his right cheek with the ground and I heard him<sup>asws</sup> and he<sup>asws</sup> was saying in a grief-laden voice: ‘I<sup>asws</sup> turn to You<sup>azwj</sup> with my<sup>asws</sup> sins, evil deeds, having been unjust to myself<sup>asws</sup>, therefore Forgive me<sup>asws</sup>, for no one Forgives the sins apart from You<sup>azwj</sup>, O my<sup>asws</sup> Master<sup>azwj</sup>!’ – three times.",
            "Then he<sup>asws</sup> pasted his<sup>asws</sup> left cheek upon the ground, and I heard him<sup>asws</sup> saying: ‘Be Merciful to the one who had done evil, and committed (sins), and refreshed himself and acknowledged’ – three times. Then he<sup>asws</sup> raised his<sup>asws</sup> head’."
          ],
          "en.sarwar": [
            "19. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from Muhammad ibn Sulayman from his father who has said the following: “Once I accompanied abu al-Hassan, Musa ibn Ja‘far, ‘Alayhim al-Salam, to see some of his properties. He readied himself for noontime Salah (prayer). When he finished he bowed down to prostrate before Allah. I heard him saying with a sad voice and tears causing an unevenness of sound in his throat, ‘O Lord, I have disobeyed You with my tongue. Had You wanted, I swear by Your majesty, You could have made it dumb. I have disobeyed You with my eyes. Had You wanted, I swear by Your majesty, You could have made them blind. I have disobeyed You with my ears. Had You wanted, I swear by Your majesty, You could have made them deaf. I have disobeyed You with my hands. Had You wanted, I swear by Your majesty, You could have crippled them. I have disobeyed You with my legs. Had You wanted, I swear by Your majesty, You could have paralyzed them. I have disobeyed You with my genital organ. Had You wanted, I swear by Your majesty, You could have made it barren. I have disobeyed You with all parts of my body which You have gifted me with and this is not the way I should have returned Your favors.’ The narrator has said that I counted his saying ‘al-‘Afw’ one thousand times. He then made the right side of his face touch the ground and I heard him saying in a sad voice, T have come to You with sin and bad deeds, I have done injustice to myself so forgive me; no one is able to forgive sins except You, O my Lord’- three times. Then he made the left side of his face touch the ground and I heard him say, ‘(O Lord,) forgive the one who has bad deeds and has accumulated sins but is humble and has confessed his sins’- three times. Then he raised his head.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/138)"
        ],
        "index": 5020,
        "local_index": 20,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1478",
              "text": "مَالِكِ بْنِ عَطِيَّةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1563",
              "text": "يُونُسَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ يُونُسَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:20",
        "relations": {
          "Mentions": [
            "/books/quran:36:20"
          ]
        },
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ هَذَا الَّذِي ظَهَرَ بِوَجْهِي يَزْعُمُ النَّاسُ أَنَّ اللَّهَ لَمْ يَبْتَلِ بِهِ عَبْداً لَهُ فِيهِ حَاجَةٌ فَقَالَ لَا قَدْ كَانَ مُؤْمِنُ آلِ فِرْعَوْنَ مُكَتَّعَ الْأَصَابِعِ فَكَانَ يَقُولُ هَكَذَا وَ يَمُدُّ يَدَهُ وَ يَقُولُ يَا قَوْمِ اتَّبِعُوا الْمُرْسَلِينَ ",
          "قَالَ ثُمَّ قَالَ لِي إِذَا كَانَ الثُّلُثُ الْأَخِيرُ مِنَ اللَّيْلِ فِي أَوَّلِهِ فَتَوَضَّأْ ثُمَّ قُمْ إِلَى صَلَاتِكَ الَّتِي تُصَلِّيهَا فَإِذَا كُنْتَ فِي السَّجْدَةِ الْأَخِيرَةِ مِنَ الرَّكْعَتَيْنِ الْأَوَّلَتَيْنِ فَقُلْ وَ أَنْتَ سَاجِدٌ يَا عَلِيُّ يَا عَظِيمُ يَا رَحْمَانُ يَا رَحِيمُ يَا سَامِعَ الدَّعَوَاتِ يَا مُعْطِيَ الْخَيْرَاتِ صَلِّ عَلَى مُحَمَّدٍ وَ أَهْلِ بَيْتِ مُحَمَّدٍ وَ أَعْطِنِي مِنْ خَيْرِ الدُّنْيَا وَ الْآخِرَةِ مَا أَنْتَ أَهْلُهُ وَ اصْرِفْ عَنِّي مِنْ شَرِّ الدُّنْيَا وَ الْآخِرَةِ مَا أَنَا أَهْلُهُ وَ أَذْهِبْ عَنِّي هَذَا الْوَجَعَ وَ تُسَمِّيهِ فَإِنَّهُ قَدْ غَاظَنِي وَ أَحْزَنَنِي وَ أَلِحَّ فِي الدُّعَاءِ ",
          "قَالَ فَفَعَلْتُ فَمَا وَصَلْتُ إِلَى الْكُوفَةِ حَتَّى أَذْهَبَ اللَّهُ عَنِّي كُلَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Malik Bin Atiyya, from Yunus Bin Ammar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! This, which has appeared in my face, the people are alleging that Allah<sup>azwj</sup> would never Afflict a servant with it, in whom He<sup>azwj</sup> has a need for’. So he<sup>asws</sup> said: ‘No. It was so that the Believer of the people of the Pharaoh<sup>la</sup> was of crippled fingers, so he was speaking like this’, and he<sup>asws</sup> extended his hand, and he was saying <span class=\"ibTxt\"><a href=\"/#/books/quran:36#h20\">[36:20]</a> O people! Follow the Rasools</span>’.",
            "He (the narrator) said, ‘Then he<sup>asws</sup> said to me: ‘When it is the last third of the night during its beginning, so perform ablution, then stand for your <span class=\"iTxt\">Salāt</span> which you tend to pray. So when you are in the last <span class=\"iTxt\">Sajdah</span> from the first two <span class=\"iTxt\">Rak’at</span>, so say while you are prostrating, ‘O Exaled, O Magnificent, O Beneficent, O Merciful, O Hearer of the supplications, O Giver of goodness! Send Blessings upon Muhammad<sup>saww</sup> and the People<sup>asws</sup> of the Household of Muhammad<sup>saww</sup>, and Give me from the goodness of the world and the Hereafter, whatever You<sup>azwj</sup> deem to be rightful, and Exchange from me from the evil of the world and the Hereafter what I am deserving of, and Remove from me this pain’ – and you specify it – ‘for it has anguished me and grieved me’ – and insist in the supplication’.",
            "He (the narrator) said, ‘So I did it, and I had not even arrived in Al Kufa until Allah<sup>azwj</sup> had Removed all of it from me’."
          ],
          "en.sarwar": [
            "20. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Malik ibn ‘Atiyyah from Yunus ibn ‘Ammar who has said the following: “Once I said to abu ’Abd Allah, ‘Alayhi al-Salam, may Allah keep my soul in service for your cause, about this thing that has appeared on my face, people say that Allah, the Most Majestic, the Most Holy, does not allow it to cause suffering to one who means anything to Him.’ The Imam said, ‘No, that is not so. The fingers of the believing person among the people of Pharaoh were such that bones were visible and he would speak to people extending his hand forward: “O people, follow the messengers’” <a href=\"/#/books/quran:36#h20\">[36:20]</a>. The Imam then said, ‘When it is the beginning of the last third of the night, make Wudu’ and stand up for prayer that you (usually) perform. In the last Sajdah (prostration) of the first two Rak‘at say, “O the Most High, O the Most Great, O the Beneficent, O the Merciful, O the Hearer of the pleas for help. You are the conferrer of the good, grant al-Salah (favors) upon Muhammad and his family. Facilitate for me of the good things of this and of the good things of the next world that much which You deem proper. Divert away from me the evil of this and the next world that much that You deem proper and relieve me from this pain;’ - mention it by its name - ‘it has caused me anguish and sadness,’ and be persistent in your pleading and prayer.’” The narrator has said that before his reaching al-Kufa Allah had totally relieved him from that illness.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/138)"
        ],
        "index": 5021,
        "local_index": 21,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/114",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/180",
              "text": "مُحَمَّدِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/539",
              "text": "سَعْدَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/134",
              "text": "رَجُلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ سَعْدَانَ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:21",
        "text": [
          " كَانَ يَقُولُ فِي سُجُودِهِ سَجَدَ وَجْهِيَ الْبَالِي لِوَجْهِكَ الْبَاقِي الدَّائِمِ الْعَظِيمِ سَجَدَ وَجْهِيَ الذَّلِيلُ لِوَجْهِكَ الْعَزِيزِ سَجَدَ وَجْهِيَ الْفَقِيرُ لِوَجْهِ رَبِّيَ الْغَنِيِّ الْكَرِيمِ الْعَلِيِّ الْعَظِيمِ رَبِّ ",
          "أَسْتَغْفِرُكَ مِمَّا كَانَ وَ أَسْتَغْفِرُكَ مِمَّا يَكُونُ رَبِّ لَا تُجْهِدْ بَلَائِي رَبِّ لَا تُشْمِتْ بِي أَعْدَائِي رَبِّ لَا تُسِئْ قَضَائِي رَبِّ إِنَّهُ لَا دَافِعَ وَ لَا مَانِعَ إِلَّا أَنْتَ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ بِأَفْضَلِ صَلَوَاتِكَ وَ بَارِكْ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ بِأَفْضَلِ بَرَكَاتِكَ ",
          "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ سَطَوَاتِكَ وَ أَعُوذُ بِكَ مِنْ جَمِيعِ غَضَبِكَ وَ سَخَطِكَ سُبْحَانَكَ لَا إِلَهَ إِلَّا أَنْتَ رَبُّ الْعَالَمِينَ",
          "وَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) يَقُولُ وَ هُوَ سَاجِدٌ ارْحَمْ ذُلِّي بَيْنَ يَدَيْكَ وَ تَضَرُّعِي إِلَيْكَ وَ وَحْشَتِي مِنَ النَّاسِ وَ آنِسْنِي بِكَ يَا كَرِيمُ",
          "وَ كَانَ يَقُولُ أَيْضاً وَعَظْتَنِي فَلَمْ أَتَّعِظْ وَ زَجَرْتَنِي عَنْ مَحَارِمِكَ فَلَمْ أَنْزَجِرْ وَ عَمَّرْتَنِي أَيَادِيَكَ فَمَا شَكَرْتُ عَفْوَكَ عَفْوَكَ يَا كَرِيمُ أَسْأَلُكَ الرَّاحَةَ عِنْدَ الْمَوْتِ وَ أَسْأَلُكَ الْعَفْوَ عِنْدَ الْحِسَابِ ",
          "وَ كَانَ أَبُو جَعْفَرٍ ( عليه السلام ) يَقُولُ وَ هُوَ سَاجِدٌ لَا إِلَهَ إِلَّا أَنْتَ حَقّاً حَقّاً سَجَدْتُ لَكَ يَا رَبِّ تَعَبُّداً وَ رِقّاً يَا عَظِيمُ إِنَّ عَمَلِي ضَعِيفٌ فَضَاعِفْهُ لِي يَا كَرِيمُ يَا حَنَّانُ اغْفِرْ لِي ذُنُوبِي وَ جُرْمِي وَ تَقَبَّلْ عَمَلِي يَا كَرِيمُ يَا جَبَّارُ أَعُوذُ بِكَ مِنْ أَنْ أَخِيبَ أَوْ أَحْمِلَ ظُلْماً ",
          "اللَّهُمَّ مِنْكَ النِّعْمَةُ وَ أَنْتَ تَرْزُقُ شُكْرَهَا وَ عَلَيْكَ يَكُونُ ثَوَابُ مَا تَفَضَّلْتَ بِهِ مِنْ ثَوَابِهَا بِفَضْلِ طَوْلِكَ وَ بِكَرِيمِ عَائِدَتِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Al Barqy, from Muhammad Bin Ali, from Sa’dan, from a man, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘He<sup>asws</sup> was saying in his<sup>asws</sup> <span class=\"iTxt\">Sajdah</span>: ‘My<sup>asws</sup> obsolete face is prostrating to Your<sup>azwj</sup> Remaining Face, the Ever-Lasting, the Magnificent. My<sup>asws</sup> disgraced face is prostrating to Your<sup>azwj</sup> Honourable Face. My<sup>asws</sup> poor face is prostrating to my<sup>asws</sup> Lord<sup>azwj</sup>, the Needless, the Benevolent, the Exalted, the Magnificent! ",
            "I<sup>asws</sup> seek Your<sup>azwj</sup> Forgiveness from what has happened and I<sup>asws</sup> seek Your<sup>azwj</sup> Forgiveness is going to happen. Lord<sup>azwj</sup>! Do not Overload my<sup>asws</sup> afflictions. Lord<sup>azwj</sup>! Do not let my enemies gloat upon me. Lord<sup>azwj</sup>! Do not let my<sup>asws</sup> Ordainment be bad. Lord<sup>azwj</sup>! There is neither a Defender nor a Preventer except for You<sup>azwj</sup>. Send Blessings upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> with the most superior of Your<sup>azwj</sup> Blessings, and Bless upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> with the most superior of Your<sup>azwj</sup> Blessings’.",
            "O Allah<sup>azwj</sup>! I seek Refuge with You<sup>azwj</sup> from Your<sup>azwj</sup> Seizures, and I seek Refuge with You<sup>azwj</sup> from the entirety of Your<sup>azwj</sup> Angers and Harshness. Glory be to You<sup>azwj</sup>. There is no God except for You<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds’. ",
            "And Amir Al-Momineen<sup>asws</sup> was saying while he<sup>asws</sup> was prostrating: ‘Be Merciful upon my<sup>asws</sup> humbleness in front of You<sup>azwj</sup> and my<sup>asws</sup> petition to You<sup>azwj</sup>, and my<sup>asws</sup> loneliness from the people, and Comfort me<sup>asws</sup> with You<sup>azwj</sup>, O Benevolent!’. ",
            "And he<sup>asws</sup> was saying as well: ‘You<sup>azwj</sup> Advised me<sup>asws</sup> but I<sup>asws</sup> did not heed, and You<sup>azwj</sup> Deterred me<sup>asws</sup> but I<sup>asws</sup> was not deterred, and You<sup>azwj</sup> Filled me<sup>asws</sup> with Your<sup>azwj</sup> Aid but I<sup>asws</sup> was not grateful. Your<sup>azwj</sup> Pardon! Your<sup>azwj</sup> Pardon! O Benevolent! I ask You<sup>azwj</sup> of the rest during the death, and I ask You<sup>azwj</sup> of the Pardoning during the Reckoning’.  ",
            "And Abu Ja’far<sup>asws</sup> was saying while he<sup>asws</sup> was prostrating: ‘There is no God except for You<sup>azwj</sup>, truly, truly! I<sup>asws</sup> am prostrating to You<sup>azwj</sup>, O Lord<sup>azwj</sup>, as a servant and a slave. O Magnificent! My<sup>asws</sup> deeds are weak, so Multiply these for me<sup>asws</sup>, O Benevolent! O Gracious! Forgive my<sup>asws</sup> sins for me<sup>asws</sup>, and my<sup>asws</sup> crimes, and Accept my<sup>asws</sup> deeds, O Benevolent! O Compeller! I seek Refuge with You<sup>azwj</sup> from failure or bearing injustice. O Allah<sup>azwj</sup>! ",
            "O Allah<sup>azwj</sup>! From You<sup>azwj</sup> are the Bounties and You<sup>azwj</sup> Grace its gratefulness, and upon You<sup>azwj</sup> happens to be the Rewards of whatever You<sup>azwj</sup> Grace with Your<sup>azwj</sup> Prolonged Grace, and with Benevolence of Your<sup>azwj</sup> Assistance’."
          ],
          "en.sarwar": [
            "21. A number of our people have narrated from Ahmad ibn Muhammad al-Barqiy from Muhammad ibn Ali from Sa‘dan from a man who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, in prostration would say the following: ‘(O Lord), my aging face has prostrated before Your ever remaining, eternal and great face. My submissive face has prostrated before Your majestic face. My poor face has prostrated before the self-sufficient, gracious, most High and great face of my Lord. My Lord, I beg You to forgive me for what has happened and what will happen. My Lord, do not allow my afflictions to intensify. Do not allow my enemy to rejoice at my misfortunes. My Lord, do not make my destiny to end up in a bad form. O Lord, there is no one except You to defend me against or prevent evil matters to afflict me. O Allah, grant Muhammad and his family compensation worthy of their serving Your cause, grant them the best form of compensation, grant them the best of Your blessings. O Lord, I seek Your protection against Your strength. O Lord, I seek Your protection against all forms of Your anger and displeasure. You are free of all defects. No one deserves to be worshipped except You, Cherisher of the worlds.”’  He (the Imam) said that ’Amir al-Mu’minin Ali, ‘Alayhi al-Salam, would say the following in prostrating position: ‘O Lord, grant mercy to my submissive condition before You and my pleading to You, and to my feeling afraid among people and comfortable with You, O gracious One.’ He would also say, ‘O Lord, You gave me good advice but I failed to learn a lesson. You warned me about committing what You have prohibited but I failed to observe Your prohibitions. You granted me bounties as long as I have lived but I failed to give You thanks. O Lord, I beg You to forgive me, O Lord, I beg You to forgive me, O gracious One, I beg You to grant me comfort at the time of dying. I beg You to forgive me at the time of issuing judgment.’” “Abu Ja‘far, ‘Alayhi al-Salam, in prostration condition would say the following: ‘No one deserves worship except You. You deserve worship in all truth and without doubts. I have prostrated before You, my Lord as (Your) slave and a sole servant. O Most great, my (good) deeds are weak, so please increase them for me, O gracious Lord. O compassionate Lord, forgive my sins and crimes and accept my deeds, O gracious Lord. O most powerful Lord, I seek protection with You against failure or tolerating injustice. O Lord, from You come bounties and You grant the ability to appreciate such bounties. With You are the reward due to your generosity and benevolence and Your graciously caring.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/139)"
        ],
        "index": 5022,
        "local_index": 22,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/115",
              "text": "يَعْقُوبَ بْنِ يَزِيدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2631",
              "text": "زِيَادِ بْنِ مَرْوَانَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنْ زِيَادِ بْنِ مَرْوَانَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:22",
        "text": [
          " كَانَ أَبُو الْحَسَنِ ( عليه السلام ) يَقُولُ فِي سُجُودِهِ أَعُوذُ بِكَ مِنْ نَارٍ حَرُّهَا لَا يُطْفَأُ وَ أَعُوذُ بِكَ مِنْ نَارٍ جَدِيدُهَا لَا يَبْلَى وَ أَعُوذُ بِكَ مِنْ نَارٍ عَطْشَانُهَا لَا يَرْوَى وَ أَعُوذُ بِكَ مِنْ نَارٍ مَسْلُوبُهَا لَا يُكْسَى ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Yaqoub Bin Yazeed, from Ziyad Bin Marwan who said, ",
            "‘Abu Al-Hassan<sup>asws</sup> saying in his<sup>asws</sup> <span class=\"iTxt\">Sajdah</span>: ‘I<sup>asws</sup> seek Refuge with You<sup>asws</sup> from a Fire, its heat not being extinguished; and I seek Rfuge with You<sup>azwj</sup> from a Fire, its renewal not wearing out; and I<sup>asws</sup> seek Refuge with You<sup>azwj</sup> from a Fire, its thirst not been quenched; and I<sup>asws</sup> seek Refuge with You<sup>azwj</sup> from a Fire, its bareness not being coated’."
          ],
          "en.sarwar": [
            "22. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Ya’qub ibn Yazid from Ziyad ibn Marwan who has said the following: “Abu al-Hassan, ‘Alayhi al-Salam, in prostration position would say, ‘O Lord, I seek Your protection against the fire of incessant heat. I seek Your protection against the fire which remains ever-new, I seek Your protection against the fire in which no one’s thirst is quenched; I seek Your protection against the fire in which the naked is never dressed up.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/140)"
        ],
        "index": 5023,
        "local_index": 23,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/355",
              "text": "ابْنِ رِئَابٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/159",
              "text": "أَبِي عُبَيْدَةَ الْحَذَّاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ أَبِي عُبَيْدَةَ الْحَذَّاءِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:23",
        "text": [
          " إِذَا قَرَأَ أَحَدُكُمُ السَّجْدَةَ مِنَ الْعَزَائِمِ فَلْيَقُلْ فِي سُجُودِهِ سَجَدْتُ لَكَ تَعَبُّداً وَ رِقّاً لَا مُسْتَكْبِراً عَنْ عِبَادَتِكَ وَ لَا مُسْتَنْكِفاً وَ لَا مُتَعَظِّماً بَلْ أَنَا عَبْدٌ ذَلِيلٌ خَائِفٌ مُسْتَجِيرٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Ibn Raib, from Abu Ubeyda Al Haza’a, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whenever one of you recites the <span class=\"iTxt\">Sajdah</span> Verse from the determines ones, so let him say in his <span class=\"iTxt\">Sajdah</span>, ‘I perform <span class=\"iTxt\">Sajdah</span> to You<sup>azwj</sup> as a servant and a slave, not being too arrogant from worshipping You<sup>azwj</sup>, nor too principled, nor too exalted, but I am a humble servant, fearful, seeking refuge’."
          ],
          "en.sarwar": [
            "23. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from ibn Ri’ab from abu ‘Ubaydah al-Hadhdha’ who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘When anyone of you may recite the chapters of the Holy Quran wherein is the verse calling for prostration, in the prostration for such recitation you should say, “O Lord, I have prostrated before You as a servant and in submission before You. I do not assume arrogance in worshipping You, refrain or consider myself by far exalted than performing acts of worship. The fact is that I am a weak servant, afraid and seeking (Your) protection.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/140)"
        ],
        "index": 5024,
        "local_index": 24,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2125",
              "text": "عَلِيِّ بْنِ الرَّيَّانِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/18",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ الرَّيَّانِ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:24",
        "text": [
          " شَكَوْتُ إِلَيْهِ عِلَّةَ أُمِّ وَلَدٍ لِي أَخَذْتُهَا فَقَالَ قُلْ لَهَا تَقُولُ فِي السُّجُودِ فِي دُبُرِ كُلِّ صَلَاةٍ مَكْتُوبَةٍ يَا رَبِّي يَا سَيِّدِي صَلِّ عَلَى مُحَمَّدٍ وَ عَلَى آلِ مُحَمَّدٍ وَ عَافِنِي مِنْ كَذَا وَ كَذَا فَبِهَا نَجَا جَعْفَرُ بْنُ سُلَيْمَانَ مِنَ النَّارِ ",
          "قَالَ فَعَرَضْتُ هَذَا الْحَدِيثَ عَلَى بَعْضِ أَصْحَابِنَا فَقَالَ أَعْرِفُ فِيهِ يَا رَءُوفُ يَا رَحِيمُ يَا رَبِّي يَا سَيِّدِي افْعَلْ بِي كَذَا وَ كَذَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Ali Bin Al Rayyan, from one of our companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I complained to him<sup>asws</sup> of an illness which seized a mother of my child. So he<sup>asws</sup> said: ‘Say to her, ‘You should be saying in the <span class=\"iTxt\">Sajdah</span> at the end of each Prescribed <span class=\"iTxt\">Salāt</span>, ‘O my Lord<sup>azwj</sup>! O my Chief! Send Blessings upon Muhammad<sup>saww</sup> and upon the Progeny<sup>asws</sup> of muhammad<sup>asws</sup>, and Grant me good health from such and such (an illness), for by this Ja’far Bin Suleyman was Rescued from the Fire’, ",
            "He (the narrator) said, ‘So I presented this Hadeeth to one of our companions, so he said, ‘I know that therein is, ‘O Kind, O Merciful, O my Lord<sup>azwj</sup>, of my Chief! Do such and such with me’’."
          ],
          "en.sarwar": [
            "24. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Ali ibn al-Rayyan from certain individuals of our people who has said the following: “I complained before abu ‘Abd Allah, ‘Alayhi al-Salam, about an illness in a mother of my child. He told me to tell her to say the following in prostration after completing an obligatory Salah (prayer), ‘O my Lord, O my master, O Allah, grant Muhammad and his family a compensation worthy of their serving Your cause, grant me a cure from such and such illness.’ It was because of this that Ja‘far ibn Sulayman was saved from the fire, the Imam explained. The narrator has said that I mentioned this Hadith to certain individuals of our people; he said, ‘I know the following to be as part of this Hadith, “O Lord, O compassionate, O merciful, O my Lord, O my master, grant me my such and such needs.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/141)"
        ],
        "index": 5025,
        "local_index": 25,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/18",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/601",
              "text": "زِيَادٍ الْقَنْدِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ زِيَادٍ الْقَنْدِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:25:25",
        "text": [
          " كَتَبْتُ إِلَى أَبِي الْحَسَنِ الْأَوَّلِ ( عليه السلام ) عَلِّمْنِي دُعَاءً فَإِنِّي قَدْ بُلِيتُ بِشَيْ‏ءٍ وَ كَانَ قَدْ حُبِسَ بِبَغْدَادَ حَيْثُ اتُّهِمَ بِأَمْوَالِهِمْ فَكَتَبَ إِلَيْهِ إِذَا صَلَّيْتَ فَأَطِلِ السُّجُودَ ثُمَّ قُلْ يَا أَحَدَ مَنْ لَا أَحَدَ لَهُ حَتَّى تَنْقَطِعَ النَّفَسُ ثُمَّ قُلْ يَا مَنْ لَا يَزِيدُهُ كَثْرَةُ الدُّعَاءِ إِلَّا جُوداً وَ كَرَماً حَتَّى تَنْقَطِعَ نَفَسُكَ ثُمَّ قُلْ يَا رَبَّ الْأَرْبَابِ أَنْتَ أَنْتَ أَنْتَ الَّذِي انْقَطَعَ الرَّجَاءُ إِلَّا مِنْكَ يَا عَلِيُّ يَا عَظِيمُ ",
          "قَالَ زِيَادٌ فَدَعَوْتُ بِهِ فَفَرَّجَ اللَّهُ عَنِّي وَ خَلَّى سَبِيلِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from one of our companions, from Ibn Abu Umeyr, from Ziyad Al Qindy who said, ",
            "‘I wrote to Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup>, ‘Teach me a supplication, for I have been afflicted with something’ – and he had been imprisoned in Baghdad where he was accused of their wealth. So he<sup>asws</sup> wrote to him: ‘Whenever you pray <span class=\"iTxt\">Salāt</span>, so prolong your <span class=\"iTxt\">Sajdah</span>, then say, ‘O One for Whom there is no one’, until you run out of breath. Then say, ‘O One Who is not increased by the frequency of the supplications except with more benevolence and Generousity’, until you run out of breath. Then say, ‘O Lord<sup>azwj</sup> of the lords! You<sup>azwj</sup>! You<sup>azwj</sup>! You<sup>azwj</sup> are the One. I have cut-off my hopes except from You<sup>azwj</sup>. O Exalted! O Magnificent!’. ",
            "Ziyad said, ‘So I supplicated with it, So Allah<sup>azwj</sup> Relieved it from me and Freed my way’."
          ],
          "en.sarwar": [
            "25. Ali ibn Muhammad has narrated from certain individuals of our people from ibn abu ‘Umayr from Ziyad al-Qandiy who has said the following: “I wrote to abu al-Hassan the first, ‘Alayhi al-Salam, to teach me a supplication. I am suffering from a situation - he was imprisoned in Baghdad. They had accused him in matters of their properties. The Imam wrote to him instructing him to say it in Salah (prayer), in a prolonged prostration. ‘O the One who does not need anyone ’ - for one breathe, then say, ‘O the One to whom pleading does not do anything but to increase His generosity and grace.’ Say it for one breath, then say, ‘O Lord of lords, You are the One, You are the One and You are the One in whom there is hope while from all others all hope is cut off, O most High, most Great.’ Ziyad has said, T practiced the above supplication and my hardships were removed and I was set free.’” (The following chapters are best explained by fatwa.) "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:4:25",
  "kind": "verse_list"
}