{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 29"
        },
        "path": "/books/al-kafi:3:4:29",
        "titles": {
          "ar": "باب الْقِيَامِ وَ الْقُعُودِ فِي الصَّلَاةِ",
          "en": "Chapter 29 – The standing and the sitting during the Salāt"
        }
      }
    ],
    "index": 696,
    "local_index": 29,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 30"
        },
        "path": "/books/al-kafi:3:4:30",
        "titles": {
          "ar": "باب التَّشَهُّدِ فِي الرَّكْعَتَيْنِ الْأَوَّلَتَيْنِ وَ الرَّابِعَةِ وَ التَّسْلِيمِ",
          "en": "Chapter 30 –The performing of the Tashahhud (testimonies) during the first two Rak’at, and the fourth, and the greeting (Salām)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 28"
        },
        "path": "/books/al-kafi:3:4:28",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب وَضْعِ الْجَبْهَةِ</span> عَلَى الْأَرْضِ",
          "en": "Chapter 28 – Placing of the forehead upon the ground"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:4:29",
    "titles": {
      "ar": "باب الْقِيَامِ وَ الْقُعُودِ فِي الصَّلَاةِ",
      "en": "Chapter 29 – The standing and the sitting during the Salāt"
    },
    "verse_count": 9,
    "verse_start_index": 5053,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/154)"
        ],
        "index": 5054,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:29:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيٌّ عَنْ أَبِيهِ</span> عَنْ حَمَّادِ بْنِ عِيسَى وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ حَمَّادِ بْنِ عِيسَى وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِذَا قُمْتَ فِي الصَّلَاةِ فَلَا تُلْصِقْ قَدَمَكَ بِالْأُخْرَى دَعْ بَيْنَهُمَا فَصْلًا إِصْبَعاً أَقَلُّ ذَلِكَ إِلَى شِبْرٍ أَكْثَرُهُ وَ اسْدِلْ مَنْكِبَيْكَ وَ أَرْسِلْ يَدَيْكَ وَ لَا تُشَبِّكْ أَصَابِعَكَ وَ لْتَكُونَا عَلَى فَخِذَيْكَ قُبَالَةَ رُكْبَتَيْكَ وَ لْيَكُنْ نَظَرُكَ إِلَى مَوْضِعِ سُجُودِكَ ",
          "فَإِذَا رَكَعْتَ فَصُفَّ فِي رُكُوعِكَ بَيْنَ قَدَمَيْكَ تَجْعَلُ بَيْنَهُمَا قَدْرَ شِبْرٍ وَ تُمَكِّنُ رَاحَتَيْكَ مِنْ رُكْبَتَيْكَ وَ تَضَعُ يَدَكَ الْيُمْنَى عَلَى رُكْبَتِكَ الْيُمْنَى قَبْلَ الْيُسْرَى وَ بَلِّغْ أَطْرَافَ أَصَابِعِكَ عَيْنَ الرُّكْبَةِ وَ فَرِّجْ أَصَابِعَكَ إِذَا وَضَعْتَهَا عَلَى رُكْبَتَيْكَ فَإِذَا وَصَلَتْ أَطْرَافُ أَصَابِعِكَ فِي رُكُوعِكَ إِلَى رُكْبَتَيْكَ أَجْزَأَكَ ذَلِكَ وَ أَحَبُّ إِلَيَّ أَنْ تُمَكِّنَ كَفَّيْكَ مِنْ رُكْبَتَيْكَ فَتَجْعَلَ أَصَابِعَكَ فِي عَيْنِ الرُّكْبَةِ وَ تُفَرِّجَ بَيْنَهُمَا وَ أَقِمْ صُلْبَكَ وَ مُدَّ عُنُقَكَ وَ لْيَكُنْ نَظَرُكَ إِلَى مَا بَيْنَ قَدَمَيْكَ ",
          "فَإِذَا أَرَدْتَ أَنْ تَسْجُدَ فَارْفَعْ يَدَيْكَ بِالتَّكْبِيرِ وَ خِرَّ سَاجِداً وَ ابْدَأْ بِيَدَيْكَ فَضَعْهُمَا عَلَى الْأَرْضِ قَبْلَ رُكْبَتَيْكَ تَضَعُهُمَا مَعاً وَ لَا تَفْتَرِشْ ذِرَاعَيْكَ افْتِرَاشَ السَّبُعِ ذِرَاعَيْهِ وَ لَا تَضَعَنَّ ذِرَاعَيْكَ عَلَى رُكْبَتَيْكَ وَ فَخِذَيْكَ وَ لَكِنْ تَجَنَّحْ بِمِرْفَقَيْكَ وَ لَا تُلْصِقْ كَفَّيْكَ بِرُكْبَتَيْكَ وَ لَا تُدْنِهِمَا مِنْ وَجْهِكَ بَيْنَ ذَلِكَ حِيَالَ مَنْكِبَيْكَ وَ لَا تَجْعَلْهُمَا بَيْنَ يَدَيْ رُكْبَتَيْكَ وَ لَكِنْ تُحَرِّفُهُمَا عَنْ ذَلِكَ شَيْئاً وَ ابْسُطْهُمَا عَلَى الْأَرْضِ بَسْطاً وَ اقْبِضْهُمَا إِلَيْكَ قَبْضاً",
          "وَ إِنْ كَانَ تَحْتَهُمَا ثَوْبٌ فَلَا يَضُرُّكَ وَ إِنْ أَفْضَيْتَ بِهِمَا إِلَى الْأَرْضِ فَهُوَ أَفْضَلُ وَ لَا تُفَرِّجَنَّ بَيْنَ أَصَابِعِكَ فِي سُجُودِكَ وَ لَكِنْ ضُمَّهُنَّ جَمِيعاً ",
          "قَالَ وَ إِذَا قَعَدْتَ فِي تَشَهُّدِكَ فَأَلْصِقْ رُكْبَتَيْكَ بِالْأَرْضِ وَ فَرِّجْ بَيْنَهُمَا شَيْئاً وَ لْيَكُنْ ظَاهِرُ قَدَمِكَ الْيُسْرَى عَلَى الْأَرْضِ وَ ظَاهِرُ قَدَمِكَ الْيُمْنَى عَلَى بَاطِنِ قَدَمِكَ الْيُسْرَى وَ أَلْيَتَاكَ عَلَى الْأَرْضِ وَ طَرَفُ إِبْهَامِكَ الْيُمْنَى عَلَى الْأَرْضِ وَ إِيَّاكَ وَ الْقُعُودَ عَلَى قَدَمَيْكَ فَتَتَأَذَّى بِذَلِكَ وَ لَا تَكُنْ قَاعِداً عَلَى الْأَرْضِ فَتَكُونَ إِنَّمَا قَعَدَ بَعْضُكَ عَلَى بَعْضٍ فَلَا تَصْبِرَ لِلتَّشَهُّدِ وَ الدُّعَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Hammad Bin Isa, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Hammad Bin Isa, and Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Hammad Bin Isa, from Hareyz, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When you stand in the <span class=\"iTxt\">Salāt</span>, so do not join your foot with the other one. Leave a distance between the two toes, the least of that being up to an open palm’s width and more; and drop your shoulders and send your hands without crossing your fingers for them to be upon your thighs, in front of the knees, and let your sight be towards the place of your <span class=\"iTxt\">Sajdah</span>. ",
            "So when you perform <span class=\"iTxt\">Rukū</span>, form a row with your two feet making between them to be a distance of a measure of an open palm’s width, and enable your palms upon your knees and place you right hand upon your right knee before the left, and the tips of your fingers should reach the eye (centre) of the knee, and separate you fingers when you place them upon your knees. So when the tips of your fingers arrive to your knees during your <span class=\"iTxt\">Rukū</span>, that would suffice you. And the most beloved to me<sup>asws</sup> is that you enable your palms upon your knees, so you make your fingers to be upon the eye (centre) of your knee and separate between the two, and straighten your back, and extend your neck, and let your sight be towards what is between your feet.",
            "So when you intend to perform <span class=\"iTxt\">Sajdah</span>, raise your hand in the exclamation of <span class=\"iTxt\">Takbīr</span> and fall down perform <span class=\"iTxt\">Sajdah</span>, and begin with your hands and place these upon the ground before your knees, placing them both together and not squatting your forearms like the wild animals, nor placing your forearms upon your knees and your thighs, but forming wings with your elbows, not pasting your palm with your knees, nor them being too close to your face, displaying them parallel to your shoulders and not making them to be in front of your knees, but diverging them a little bit from that, and extend them upon the ground with an extensions, and pulling them a little towards you with a pulling.",
            "And if there was a cloth beneath them, it would not harm you, and if you were to lead with these two to the ground, so it would be superior. And do not separate between your fingers during your <span class=\"iTxt\">Sajdah</span>, but keep them close together’. ",
            "He<sup>asws</sup> said: ‘And when you sit during your performing of the <span class=\"iTxt\">Tashahhud </span>(three or more testimonies), so paste the two knees with the ground and separate between the two a bit, and let the back of your left foot be upon the ground and the back of your right foot be upon the inside of your left foot and your backside to be upon the ground, and the side of your right big toe to be upon the ground. ",
            "And beware of the sitting upon your two feet, for you would be hurt by that. And do not sit with part of you upon the (other) part but let yourself be sitting upon the ground, so you should rather happen to be sitting (comfortably), otherwise you would not be patient for the <span class=\"iTxt\">Tashahhud</span> and the supplication’."
          ],
          "en.sarwar": [
            "1. Ali has narrated from his father from Hammad ibn ‘Isa and Muhammad ibn Isma’il from al-Fadl ibn Shadhan from Hammad ibn ‘Isa and Muhammad ibn Yahya from Ahmad ibn Muhammad from Hammad ibn ‘Isa from Hariz from Zurarah who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘When you stand up for Salah (prayer) do not allow one foot to touch the other, leave between them a distance of one finger at the least and one Shibr (about 8 inches) at most. Allow your shoulders to relax and leave your hands alone. Do not crisscross your fingers. Instead they should be kept on your thighs on its front side and your eyes should look at the place for prostration. During Ruku‘ position line up your feet with a distance of one shibr in between them, allow your fingers to hold on to your knees. Place your right palm on your right knee before placing the left palm on your left knee. Allow your fingers to reach to the sides of your knees and stretch your fingers when placed on your knees. If during Ruku‘ the tips of your fingers reach your knees it is sufficient but I like that your palm should rest on your knees so you can allow your finger to hold to your knees while they (knees) are kept apart. Your back should be straight, your neck stretched forward and your looks should be kept between your feet. “When you are ready for prostration, raise your hands for saying “Allah is great”, then bow down for prostration. First your hands should be placed on the ground, before your knees, together but do not place your forearms on the ground as beasts do. You must not place your forearms on your knees or thighs but open them up as wings with your elbows. You must not touch your knees with your palms and do not place them very close to your face. Place them in between level with your shoulders. You must not place them in front of your knees. Place them a little out, extend them on the ground and keep them a little toward you. If there is some cloth underneath, it does not matter, and if you allow them to be placed on the ground it is better. You must not keep your fingers apart from each other during your sajdah but keep them close side by side.’ The Imam said, ‘When you sit up straight for reading the testimonies, keep your knees touching the ground and a little apart from each other. The back of your left foot should be on the ground, the back of you right foot should be placed on the bottom of your left foot and both hips should be placed on the ground as well as the tip of the big toe of your right foot. You should never sit on both your feet; it may hurt you. You should not sit on the ground; in this way some parts of you are sitting on the others and you cannot bear sitting this way for reading the testimonies and supplications.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/157)"
        ],
        "index": 5055,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:29:2",
        "text": [
          "وَ بِهَذِهِ الْأَسَانِيدِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ قَالَ إِذَا قَامَتِ الْمَرْأَةُ فِي الصَّلَاةِ جَمَعَتْ بَيْنَ قَدَمَيْهَا وَ لَا تُفَرِّجُ بَيْنَهُمَا وَ تَضُمُّ يَدَيْهَا إِلَى صَدْرِهَا لِمَكَانِ ثَدْيَيْهَا فَإِذَا رَكَعَتْ وَضَعَتْ يَدَيْهَا فَوْقَ رُكْبَتَيْهَا عَلَى فَخِذَيْهَا لِئَلَّا تُطَأْطِئَ كَثِيراً فَتَرْتَفِعَ عَجِيزَتُهَا فَإِذَا جَلَسَتْ فَعَلَى أَلْيَتَيْهَا لَيْسَ كَمَا يَقْعُدُ الرَّجُلُ وَ إِذَا سَقَطَتْ لِلسُّجُودِ بَدَأَتْ بِالْقُعُودِ بِالرُّكْبَتَيْنِ قَبْلَ الْيَدَيْنِ ثُمَّ تَسْجُدُ لَاطِئَةً بِالْأَرْضِ فَإِذَا كَانَتْ فِي جُلُوسِهَا ضَمَّتْ فَخِذَيْهَا وَ رَفَعَتْ رُكْبَتَيْهَا مِنَ الْأَرْضِ وَ إِذَا نَهَضَتْ انْسَلَّتْ انْسِلَالًا لَا تَرْفَعُ عَجِيزَتَهَا أَوَّلًا ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Hammad Bin Isa, from Hareyz, from Zurara who said, ",
            "‘When the woman stands in the <span class=\"iTxt\">Salāt</span>, she should gather her two feet and not have separation between the two, and she would clasp her hands to her chest in the place of her breasts. So when she <span class=\"iTxt\">Rukū</span>, she should place her hands above her knees upon her thighs so as not to bend down very much to lift up her backside. So when she sits, so it should be upon her backside, not like the sitting of the man. And when she falls for the <span class=\"iTxt\">Sajdah</span>, she should begin with the sitting with the two knees before the two hands, then she should perform <span class=\"iTxt\">Sajdah</span>, pasting with the ground. So when she was in her sitting, she should clasp her thigs, and raise her knees from the ground. And when she stand she should do it stealthily, not raising her backside first’."
          ],
          "en.sarwar": [
            "2. Through the same chain of narrators as that of the previous Hadith, it is narrated Hammad ibn ‘Isa from Hariz from Zurarah who has said the following: “He (the Imam), ‘Alayhi al-Salam, has said, ‘When a woman stands up for Salah (prayer) she should place her feet close to each other and should not keep them apart from each other. She should keep her hands over her chest over her breast. In Ruku‘ position she should place her hands above her knees on her thighs so as not to bend down very much to lift up her rear end. When sitting she should sit on her posteriors unlike a man. When bowing down for prostration she should first bring down her knees before her hands, then place herself on the ground. When sitting she should keep her thighs together and raise her knees from the ground. When moving to stand up a woman should rise upward without allowing her rear end to be seen being lifted up first.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/158)"
        ],
        "index": 5056,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:29:3",
        "text": [
          "جَمَاعَةٌ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنِ الْحُسَيْنِ بْنِ عُثْمَانَ عَنْ سَمَاعَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا تُقْعِ بَيْنَ السَّجْدَتَيْنِ إِقْعَاءً ."
        ],
        "translations": {
          "en.hubeali": [
            "A group, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Al Husayn Bin Usman, from Sama’at, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘You should not fall between the two Sujūd<span class=\"iTxt\"> (plural of Sajdah</span>) with a falling’. (i.e. – do it methodically)."
          ],
          "en.sarwar": [
            "3. A group has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa‘id from Fadalah ibn Ayyub from al-Husayn ibn ‘Uthman from Sama‘ah from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘You must not sit, between the two sajdah, placing your hips on your heels.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/159)"
        ],
        "index": 5057,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:29:4",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنِ ابْنِ مُسْكَانَ عَنِ ابْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا سَجَدَتِ الْمَرْأَةُ بَسَطَتْ ذِرَاعَيْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Usman Bin Isa, from Ibn Muskaan, from Ibn Abu Yafour, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the woman perform Sujūd<span class=\"iTxt\"> (plural of Sajdah</span>), she should extend her forearms’."
          ],
          "en.sarwar": [
            "4. Ahmad ibn Muhammad has narrated from al-Husayn ibn Sa‘id from ‘Uthman ibn ‘Isa from ibn Muskan from ibn abu Ya‘fur who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘When a woman performs Sajdah (prostration) she must stretch her arms.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/159)"
        ],
        "index": 5058,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:29:5",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ مُعَلًّى أَبِي عُثْمَانَ عَنْ مُعَلَّى بْنِ خُنَيْسٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ كَانَ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) إِذَا هَوَى سَاجِداً انْكَبَّ وَ هُوَ يُكَبِّرُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Moalla Abu Usman, from Moalla Bin Khunays, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> while going down <span class=\"iTxt\">for Sajdah</span>, would was exclaim <span class=\"iTxt\">Takbīr</span>’."
          ],
          "en.sarwar": [
            "5. Ahmad ibn Muhammad has narrated from al-Husayn ibn Sa‘id from Fadalah ibn Ayyub from Mu‘alla’ abu ‘Uthman from Mu‘alla’ ibn Khunayth who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘Ali ibn al-Husayn, ‘Alayhi al-Salam, while bowing down for Sajdah (prostration) would say Takbir (Allah is great beyond description).”’ (Ahadith 4-5 are best be explained by fatwa.) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/159)"
        ],
        "index": 5059,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:29:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا سَجَدَ الرَّجُلُ ثُمَّ أَرَادَ أَنْ يَنْهَضَ فَلَا يَعْجِنُ بِيَدَيْهِ فِي الْأَرْضِ وَ لَكِنْ يَبْسُطُ كَفَّيْهِ مِنْ غَيْرِ أَنْ يَضَعَ مَقْعَدَتَهُ عَلَى الْأَرْضِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad Bin Usman, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the man perform Sujūd<span class=\"iTxt\"> (plural of Sajdah</span>), then intends that he stands, so he should not knead with his hands in the ground, but he should extend his palm from without placing his posterior upon the ground’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad ibn ‘Uthman from al-Halabiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘When one is in prostration position and wants to stand up, he should not make his hand into a fist placed on the ground, instead he should open his palms without placing his posteriors on the ground.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/159)"
        ],
        "index": 5060,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:29:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ عَنْ أَبَانٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ قَالَ سَأَلْتُهُ عَنْ جُلُوسِ الْمَرْأَةِ فِي الصَّلَاةِ قَالَ تَضُمُّ فَخِذَيْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Husayn Bin Saeed, from Fazalat, from Aban, from Abdul Rahman Bin Abu Abdullah who said, ",
            "‘I asked him<sup>asws</sup> about the sitting of the woman during the <span class=\"iTxt\">Salāt</span>. He<sup>asws</sup> said: ‘She would clasp her thighs (together)’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from al-Husayn ibn Sa‘id from Fadalah from Aban from ‘Abd al- Rahman ibn abu ‘Abd Allah who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about woman when sitting during Salah (prayer). He (the Imam) said, ‘She keeps her thighs together.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/159)"
        ],
        "index": 5061,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:29:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ بَعْضِ أَصْحَابِنَا قَالَ الْمَرْأَةُ إِذَا سَجَدَتْ تَضَمَّمَتْ وَ الرَّجُلُ إِذَا سَجَدَ تَفَتَّحَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr, from one of our companions who said, ",
            "‘The woman, when she perform Sujūd<span class=\"iTxt\"> (plural of Sajdah</span>), should be clasped, and the man when he perform Sujūd, should be open’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from ibn Bukayr from certain persons of our people who has narrated the following: “He (the Imam), ‘Alayhi al-Salam, has said that woman when performing Sajdah (prostration) should not spread herself and man should spread himself on the ground.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/160)"
        ],
        "index": 5062,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:29:9",
        "refs": {
          "Mentions": [
            "/books/quran:108:2"
          ]
        },
        "text": [
          "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ رَجُلٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قُلْتُ لَهُ فَصَلِّ لِرَبِّكَ وَ انْحَرْ قَالَ النَّحْرُ الِاعْتِدَالُ فِي الْقِيَامِ أَنْ يُقِيمَ صُلْبَهُ وَ نَحْرَهُ ",
          "وَ قَالَ لَا تُكَفِّرْ فَإِنَّمَا يَصْنَعُ ذَلِكَ الْمَجُوسُ وَ لَا تَلَثَّمْ وَ لَا تَحْتَفِزْ وَ لَا تُقْعِ عَلَى قَدَمَيْكَ وَ لَا تَفْتَرِشْ ذِرَاعَيْكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ahmad Bin Muhammad, from Hammad, from Hareyz, from a man, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘(What about) <span class=\"ibTxt\"><a href=\"/#/books/quran:108#h2\">[108:2]</a> Therefore pray Salāt to your Lord and make a sacrifice</span>?’ He<sup>asws</sup> said: ‘The moderation during the standing, that he should straighten his back and his face’. ",
            "And he<sup>asws</sup> said: ‘Do not place one hand upon the other, that is what the Magians do, and neither veil your face, nor hold limbs tightly, nor fall upon your feet, nor spread out your arms’."
          ],
          "en.sarwar": [
            "9. It is a narration from him (narrator of previous Hadith) by Ahmad ibn Muhammad from Hammad from Hariz from a man who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about the words of Allah, ‘Perform Salah (prayer) for the sake of your Lord and offer sacrifice. . . .’<a href=\"/#/books/quran:108#h2\">[108:2]</a> He (the Imam) said, ‘Offering sacrifice’ is a reference to standing in a level posture by keeping one’s back and neck level.’ He (the Imam) said, ‘You must not place your hand on your other hand; Majus (Zoroastrians) people would do so. You must not cover your mouth, do not hold your limbs tightly together and do not squat (sit on one’s heels) and do not place your arms flat on the ground.’” (Ahadith 7-9 above and the following chapters are best explained in the form of fatwa). "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:4:29",
  "kind": "verse_list"
}