{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:3:4", "titles": {"ar": "كِتَابُ الصَّلَاةِ", "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "}}, {"indexed_titles": {"en": "Chapter 3"}, "path": "/books/al-kafi:3:4:3", "titles": {"ar": "باب فَرْضِ الصَّلَاةِ", "en": "Chapter 3 – Obligation of the Salāt"}}], "index": 670, "local_index": 3, "part_type": "Chapter", "path": "/books/al-kafi:3:4:3", "titles": {"ar": "باب فَرْضِ الصَّلَاةِ", "en": "Chapter 3 – Obligation of the Salāt"}, "verse_count": 8, "verse_start_index": 4795, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 4796, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:4:3:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَمَّا فَرَضَ اللَّهُ عَزَّ وَ جَلَّ مِنَ الصَّلَاةِ فَقَالَ خَمْسُ صَلَوَاتٍ فِي اللَّيْلِ وَ النَّهَارِ فَقُلْتُ فَهَلْ سَمَّاهُنَّ وَ بَيَّنَهُنَّ فِي كِتَابِهِ قَالَ نَعَمْ قَالَ اللَّهُ تَعَالَى لِنَبِيِّهِ ( صلى الله عليه وآله ) أَقِمِ الصَّلاةَ لِدُلُوكِ الشَّمْسِ إِلى غَسَقِ اللَّيْلِ وَ دُلُوكُهَا زَوَالُهَا فَفِيمَا بَيْنَ دُلُوكِ الشَّمْسِ إِلَى غَسَقِ اللَّيْلِ أَرْبَعُ صَلَوَاتٍ سَمَّاهُنَّ اللَّهُ وَ بَيَّنَهُنَّ وَ وَقَّتَهُنَّ وَ غَسَقُ اللَّيْلِ هُوَ انْتِصَافُهُ", "ثُمَّ قَالَ تَبَارَكَ وَ تَعَالَى وَ قُرْآنَ الْفَجْرِ إِنَّ قُرْآنَ الْفَجْرِ كانَ مَشْهُوداً فَهَذِهِ الْخَامِسَةُ وَ قَالَ اللَّهُ تَعَالَى فِي ذَلِكَ أَقِمِ الصَّلاةَ طَرَفَيِ النَّهارِ وَ طَرَفَاهُ الْمَغْرِبُ وَ الْغَدَاةُ وَ زُلَفاً مِنَ اللَّيْلِ وَ هِيَ صَلَاةُ الْعِشَاءِ الْآخِرَةِ وَ قَالَ تَعَالَى حافِظُوا عَلَى الصَّلَواتِ وَ الصَّلاةِ الْوُسْطى وَ هِيَ صَلَاةُ الظُّهْرِ وَ هِيَ أَوَّلُ صَلَاةٍ صَلَّاهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ هِيَ وَسَطُ النَّهَارِ وَ وَسَطُ الصَّلَاتَيْنِ بِالنَّهَارِ صَلَاةِ الْغَدَاةِ وَ صَلَاةِ الْعَصْرِ وَ فِي بَعْضِ الْقِرَاءَةِ حافِظُوا عَلَى الصَّلَواتِ وَ الصَّلاةِ الْوُسْطى صَلَاةِ الْعَصْرِ وَ قُومُوا لِلَّهِ قانِتِينَ", "قَالَ وَ نَزَلَتْ هَذِهِ الْآيَةُ يَوْمَ الْجُمُعَةِ وَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فِي سَفَرِهِ فَقَنَتَ فِيهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ تَرَكَهَا عَلَى حَالِهَا فِي السَّفَرِ وَ الْحَضَرِ وَ أَضَافَ لِلْمُقِيمِ رَكْعَتَيْنِ وَ إِنَّمَا وُضِعَتِ الرَّكْعَتَانِ اللَّتَانِ أَضَافَهُمَا النَّبِيُّ ( صلى الله عليه وآله ) يَوْمَ الْجُمُعَةِ لِلْمُقِيمِ لِمَكَانِ الْخُطْبَتَيْنِ مَعَ الْإِمَامِ فَمَنْ صَلَّى يَوْمَ الْجُمُعَةِ فِي غَيْرِ جَمَاعَةٍ فَلْيُصَلِّهَا أَرْبَعَ رَكَعَاتٍ كَصَلَاةِ الظُّهْرِ فِي سَائِرِ الْأَيَّامِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Hammad Bin Is and Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa and Muhammad Bin Ismail, from Al-Fazl Bin Shazan, altogether from Hammad Bin Isa, from Hareyz, from Zurara who said, ", "‘I asked Abu Ja’far<sup>asws</sup> about what Allah<sup>azwj</sup> Mighty and Majestic had Obligated from the <span class=\"iTxt\">Salāt</span>. So he<sup>asws</sup> said: ‘Five (sets of) <span class=\"iTxt\">Salāt</span> during the night and the day’. So I said, ‘So has He<sup>azwj</sup> Named these and Clarified these in His<sup>azwj</sup> Book?’ He<sup>asws</sup> said: ‘Yes. Allah<sup>azwj</sup> the Exalted Said to His<sup>azwj</sup> Prophet<sup>saww</sup> <span class=\"ibTxt\">[17:78] Establish the Prayer from the declining of the sun till the darkness of the night</span>. So in what is between the (start of the) decline of the sun up to the darkness of the night are four Rak’at <span class=\"iTxt\">Salāt</span>. Allah<sup>azwj</sup> Named these and Clarified these and their timings; and the darkness of the night, it is its mid-point. ", "Then the Blessed and High Said <span class=\"ibTxt\">[17:78] and the morning recitation; surely the recitation at dawn was always witnessed</span>. So this is the fifth one. And Allah<sup>azwj</sup> the Exalted Says regarding that <span class=\"ibTxt\">[11:114] And establish Prayer in the two parts of the day and in the first hours of the night</span>. And its two parts are the Maghrib and the morning, and the first hours from the night, it is the last Isha. And the Exalted Said <span class=\"ibTxt\">[2:238] Protect your Salāt and the middle Salāt</span> – and it is the Zohr <span class=\"iTxt\">Salāt</span>, and it is the first <span class=\"iTxt\">Salāt</span> which Rasool-Allah<sup>saww</sup> prayed, and it is in the middle of the day. And the middle two <span class=\"iTxt\">Salāts</span> by the day is the morning <span class=\"iTxt\">Salāt</span> and <span class=\"iTxt\">Salāt</span> Al-Asr. And in some recitations (of the Quran, the Verse is as) <span class=\"ibTxt\">[2:238] Protect your Salāt and the middle Salāt, Salāt Al-Asr, and stand up truly obedient to Allah</span>’.", "He<sup>asws</sup> said: ‘And this Verse was Revealed on the day of Friday, and Rasool-Allah<sup>saww</sup> was in his<sup>saww</sup> journey. So Rasool-Allah<sup>saww</sup> taught it and left it upon its state during the journey and not travelling, and increased two <span class=\"iTxt\">Rak’at</span> for the non-traveller. And rather, the two <span class=\"iTxt\">Rak’at</span> which the Prophet<sup>saww</sup> increased on the day of Friday was in place of the two sermons with the prayer-leader. So the one who prays <span class=\"iTxt\">Salāt</span> on the day of Friday in other than a <span class=\"iTxt\">Jam’at</span>, so let him pray it as four <span class=\"iTxt\">Rak’at</span>, like the Zohr <span class=\"iTxt\">Salāt</span> during the rest of the days’."]}}, {"index": 4797, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:4:3:2", "text": ["وَ بِإِسْنَادِهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كَانَ الَّذِي فَرَضَ اللَّهُ عَلَى الْعِبَادِ مِنَ الصَّلَاةِ عَشْرَ رَكَعَاتٍ وَ فِيهِنَّ الْقِرَاءَةُ وَ لَيْسَ فِيهِنَّ وَهْمٌ يَعْنِي سَهْواً فَزَادَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) سَبْعاً وَ فِيهِنَّ الْوَهْمُ وَ لَيْسَ فِيهِنَّ قِرَاءَةٌ ."], "translations": {"en.hubeali": ["And by his chain, from Hammad, from Hareyz, from Zurara, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘It was so, from the <span class=\"iTxt\">Salāts</span> which Allah<sup>azwj</sup> Obligated upon the servants, as being ten <span class=\"iTxt\">Rak’at</span>, and in these are recitations, and there are no whims (allowed) therein, meaning the mistakes. So Rasool-Allah<sup>saww</sup> increased seven (<span class=\"iTxt\">Rak’at</span>), and in these the whims (mistakes are allowed), and there is no recitation in these’."]}}, {"index": 4798, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:4:3:3", "text": ["وَ بِإِسْنَادِهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ زُرَارَةَ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) فَرَضَ اللَّهُ الصَّلَاةَ وَ سَنَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَشَرَةَ أَوْجُهٍ صَلَاةَ الْحَضَرِ وَ السَّفَرِ وَ صَلَاةَ الْخَوْفِ عَلَى ثَلَاثَةِ أَوْجُهٍ وَ صَلَاةَ كُسُوفِ الشَّمْسِ وَ الْقَمَرِ وَ صَلَاةَ الْعِيدَيْنِ وَ صَلَاةَ الِاسْتِسْقَاءِ وَ الصَّلَاةَ عَلَى الْمَيِّتِ ."], "translations": {"en.hubeali": ["And by his chain, from Hammad, from Hareyz, from Zurara who said, ", "‘Abu Ja’far<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Necessitated the <span class=\"iTxt\">Salāt</span>, and Rasool-Allah<sup>saww</sup> established the Sunnah upon ten aspects – <span class=\"iTxt\">Salāt</span> of the non-traveller, and the traveller, and the <span class=\"iTxt\">Salāt</span> of fear being upon three aspects, and <span class=\"iTxt\">Salāt</span> of the eclipse of the sun and the moon, and <span class=\"iTxt\">Salāt</span> of the two Eids, and <span class=\"iTxt\">Salāt</span> for the rain, and <span class=\"iTxt\">Salāt</span> upon the deceased’."]}}, {"index": 4799, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:3:4:3:4", "text": ["حَمَّادٌ عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّ الصَّلاةَ كانَتْ عَلَى الْمُؤْمِنِينَ كِتاباً مَوْقُوتاً أَيْ مَوْجُوباً ."], "translations": {"en.hubeali": ["Hammad, from Hareyz, from Zurara, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[4:103] surely the Salāt was always a timed ordinance upon the Believers</span> – i.e. Obligatory’."]}}, {"index": 4800, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:3:4:3:5", "text": ["حَمَّادٌ عَنْ حَرِيزٍ عَنْ زُرَارَةَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الْفَرْضِ فِي الصَّلَاةِ فَقَالَ الْوَقْتُ وَ الطَّهُورُ وَ الْقِبْلَةُ وَ التَّوَجُّهُ وَ الرُّكُوعُ وَ السُّجُودُ وَ الدُّعَاءُ قُلْتُ مَا سِوَى ذَلِكَ قَالَ سُنَّةٌ فِي فَرِيضَةٍ ."], "translations": {"en.hubeali": ["Hammad, from Hareyz, from Zurara who said, ", "‘I asked Abu Ja’far<sup>asws</sup> about the necessities regarding the <span class=\"iTxt\">Salāt</span>. So he<sup>asws</sup> said: ‘The timing, and the cleanliness, and the Qiblah, and the concentration, and the <span class=\"iTxt\">Rukū</span>, and the <span class=\"iTxt\">Sajdah</span>, and the supplication’. I said, ‘What is besides that?’ He<sup>asws</sup> said: ‘A Sunnah among the necessities’."]}}, {"index": 4801, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:3:4:3:6", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لِلصَّلَاةِ أَرْبَعَةُ آلَافِ حَدٍّ .", "وَ فِي رِوَايَةٍ أُخْرَى لِلصَّلَاةِ أَرْبَعَةُ آلَافِ بَابٍ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Hammad Bin Isa, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘For <span class=\"iTxt\">Salāt</span>, there are four thousand limits’.", "And in another report: ‘For the <span class=\"iTxt\">Salāt</span>, there are four thousand doors (chapters)’."]}}, {"index": 4802, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:3:4:3:7", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ عَشْرُ رَكَعَاتٍ رَكْعَتَانِ مِنَ الظُّهْرِ وَ رَكْعَتَانِ مِنَ الْعَصْرِ وَ رَكْعَتَا الصُّبْحِ وَ رَكْعَتَا الْمَغْرِبِ وَ رَكْعَتَا الْعِشَاءِ الْآخِرَةِ لَا يَجُوزُ الْوَهْمُ فِيهِنَّ وَ مَنْ وَهَمَ فِي شَيْ‏ءٍ مِنْهُنَّ اسْتَقْبَلَ الصَّلَاةَ اسْتِقْبَالًا وَ هِيَ الصَّلَاةُ الَّتِي فَرَضَهَا اللَّهُ عَزَّ وَ جَلَّ عَلَى الْمُؤْمِنِينَ فِي الْقُرْآنِ وَ فَوَّضَ إِلَى مُحَمَّدٍ ( صلى الله عليه وآله ) ", "فَزَادَ النَّبِيُّ ( صلى الله عليه وآله ) فِي الصَّلَاةِ سَبْعَ رَكَعَاتٍ وَ هِيَ سُنَّةٌ لَيْسَ فِيهَا قِرَاءَةٌ إِنَّمَا هُوَ تَسْبِيحٌ وَ تَهْلِيلٌ وَ تَكْبِيرٌ وَ دُعَاءٌ فَالْوَهْمُ إِنَّمَا يَكُونُ فِيهِنَّ فَزَادَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فِي صَلَاةِ الْمُقِيمِ غَيْرِ الْمُسَافِرِ رَكْعَتَيْنِ فِي الظُّهْرِ وَ الْعَصْرِ وَ الْعِشَاءِ الْآخِرَةِ وَ رَكْعَةً فِي الْمَغْرِبِ لِلْمُقِيمِ وَ الْمُسَافِرِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Zurara, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Ten <span class=\"iTxt\">Rak’at</span> (of <span class=\"iTxt\">Salāt</span>) are – two <span class=\"iTxt\">Rak’at</span> from Al-Zohr, and two <span class=\"iTxt\">Rak’at</span> from Al-Asr, and two <span class=\"iTxt\">Rak’at</span> from Al-Sub’h, and two <span class=\"iTxt\">Rak’at</span> from Al-Maghrib, and two <span class=\"iTxt\">Rak’at</span> from the last Isha. The whims (mistakes) are not allowed in these, and the one who errs in something from these should welcome the <span class=\"iTxt\">Salāt</span> with a welcoming (pray again); and it is the <span class=\"iTxt\">Salāt</span> which Allah<sup>azwj</sup> and Majestic Necessitated upon the Believers in the Quran, and Delegated it to Muhammad<sup>saww</sup>. ", "So the Prophet<sup>saww</sup> increased in the <span class=\"iTxt\">Salāt</span> by seven <span class=\"iTxt\">Rak’at</span>, and it is the Sunnah in which there is no recitation. But rather, it is a Glorification, and Extollation of the Holiness, and the exclamation of the Greatness, and supplication. So the mistakes, rather can happen to be in these. So Rasool-Allah<sup>saww</sup> increased in the <span class=\"iTxt\">Salāt</span> of the stayer, (the one) not travelling, by two <span class=\"iTxt\">Rak’at</span> during Al-Zohr and Al-Asr, and Al-Isha the last, and one <span class=\"iTxt\">Rak’at</span> in Al-Maghrib for the stayer as well as the traveller’."]}}, {"index": 4803, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:3:4:3:8", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الصَّلَاةُ ثَلَاثَةُ أَثْلَاثٍ ثُلُثٌ طَهُورٌ وَ ثُلُثٌ رُكُوعٌ وَ ثُلُثٌ سُجُودٌ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The <span class=\"iTxt\">Salāt</span> is of three (sections) – a third being cleanliness, and a third being <span class=\"iTxt\">Rukū</span>, and a third being <span class=\"iTxt\">Sajdah</span>’."]}}]}, "index": "al-kafi:3:4:3", "kind": "verse_list"}