{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:3:4:3",
        "titles": {
          "ar": "باب فَرْضِ الصَّلَاةِ",
          "en": "Chapter 3 – Obligation of the Salāt"
        }
      }
    ],
    "index": 670,
    "local_index": 3,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 4"
        },
        "path": "/books/al-kafi:3:4:4",
        "titles": {
          "ar": "باب الْمَوَاقِيتِ أَوَّلِهَا وَ آخِرِهَا وَ أَفْضَلِهَا",
          "en": "Chapter 4 – The timings – its beginning, and its ending, and the best of it"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 2"
        },
        "path": "/books/al-kafi:3:4:2",
        "titles": {
          "ar": "باب مَنْ حَافَظَ عَلَى صَلَاتِهِ أَوْ ضَيَّعَهَا",
          "en": "Chapter 2 – The one who preserves upon his Salāt or wastes it"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:4:3",
    "titles": {
      "ar": "باب فَرْضِ الصَّلَاةِ",
      "en": "Chapter 3 – Obligation of the Salāt"
    },
    "verse_count": 8,
    "verse_start_index": 4795,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "index": 4796,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/133",
              "text": "حَمَّادِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/123",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/133",
              "text": "حَمَّادِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/195",
              "text": "حَرِيزٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/196",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:3:1",
        "relations": {
          "Mentions": [
            "/books/quran:2:238",
            "/books/quran:17:78",
            "/books/quran:11:116",
            "/books/quran:2:239",
            "/books/quran:11:114"
          ]
        },
        "text": [
          " سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَمَّا فَرَضَ اللَّهُ عَزَّ وَ جَلَّ مِنَ الصَّلَاةِ فَقَالَ خَمْسُ صَلَوَاتٍ فِي اللَّيْلِ وَ النَّهَارِ فَقُلْتُ فَهَلْ سَمَّاهُنَّ وَ بَيَّنَهُنَّ فِي كِتَابِهِ قَالَ نَعَمْ قَالَ اللَّهُ تَعَالَى لِنَبِيِّهِ ( صلى الله عليه وآله ) أَقِمِ الصَّلاةَ لِدُلُوكِ الشَّمْسِ إِلى غَسَقِ اللَّيْلِ وَ دُلُوكُهَا زَوَالُهَا فَفِيمَا بَيْنَ دُلُوكِ الشَّمْسِ إِلَى غَسَقِ اللَّيْلِ أَرْبَعُ صَلَوَاتٍ سَمَّاهُنَّ اللَّهُ وَ بَيَّنَهُنَّ وَ وَقَّتَهُنَّ وَ غَسَقُ اللَّيْلِ هُوَ انْتِصَافُهُ",
          "ثُمَّ قَالَ تَبَارَكَ وَ تَعَالَى وَ قُرْآنَ الْفَجْرِ إِنَّ قُرْآنَ الْفَجْرِ كانَ مَشْهُوداً فَهَذِهِ الْخَامِسَةُ وَ قَالَ اللَّهُ تَعَالَى فِي ذَلِكَ أَقِمِ الصَّلاةَ طَرَفَيِ النَّهارِ وَ طَرَفَاهُ الْمَغْرِبُ وَ الْغَدَاةُ وَ زُلَفاً مِنَ اللَّيْلِ وَ هِيَ صَلَاةُ الْعِشَاءِ الْآخِرَةِ وَ قَالَ تَعَالَى حافِظُوا عَلَى الصَّلَواتِ وَ الصَّلاةِ الْوُسْطى وَ هِيَ صَلَاةُ الظُّهْرِ وَ هِيَ أَوَّلُ صَلَاةٍ صَلَّاهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ هِيَ وَسَطُ النَّهَارِ وَ وَسَطُ الصَّلَاتَيْنِ بِالنَّهَارِ صَلَاةِ الْغَدَاةِ وَ صَلَاةِ الْعَصْرِ وَ فِي بَعْضِ الْقِرَاءَةِ حافِظُوا عَلَى الصَّلَواتِ وَ الصَّلاةِ الْوُسْطى صَلَاةِ الْعَصْرِ وَ قُومُوا لِلَّهِ قانِتِينَ",
          "قَالَ وَ نَزَلَتْ هَذِهِ الْآيَةُ يَوْمَ الْجُمُعَةِ وَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فِي سَفَرِهِ فَقَنَتَ فِيهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ تَرَكَهَا عَلَى حَالِهَا فِي السَّفَرِ وَ الْحَضَرِ وَ أَضَافَ لِلْمُقِيمِ رَكْعَتَيْنِ وَ إِنَّمَا وُضِعَتِ الرَّكْعَتَانِ اللَّتَانِ أَضَافَهُمَا النَّبِيُّ ( صلى الله عليه وآله ) يَوْمَ الْجُمُعَةِ لِلْمُقِيمِ لِمَكَانِ الْخُطْبَتَيْنِ مَعَ الْإِمَامِ فَمَنْ صَلَّى يَوْمَ الْجُمُعَةِ فِي غَيْرِ جَمَاعَةٍ فَلْيُصَلِّهَا أَرْبَعَ رَكَعَاتٍ كَصَلَاةِ الظُّهْرِ فِي سَائِرِ الْأَيَّامِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Is and Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa and Muhammad Bin Ismail, from Al-Fazl Bin Shazan, altogether from Hammad Bin Isa, from Hareyz, from Zurara who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about what Allah<sup>azwj</sup> Mighty and Majestic had Obligated from the <span class=\"iTxt\">Salāt</span>. So he<sup>asws</sup> said: ‘Five (sets of) <span class=\"iTxt\">Salāt</span> during the night and the day’. So I said, ‘So has He<sup>azwj</sup> Named these and Clarified these in His<sup>azwj</sup> Book?’ He<sup>asws</sup> said: ‘Yes. Allah<sup>azwj</sup> the Exalted Said to His<sup>azwj</sup> Prophet<sup>saww</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:17#h78\">[17:78]</a> Establish the Prayer from the declining of the sun till the darkness of the night</span>. So in what is between the (start of the) decline of the sun up to the darkness of the night are four Rak’at <span class=\"iTxt\">Salāt</span>. Allah<sup>azwj</sup> Named these and Clarified these and their timings; and the darkness of the night, it is its mid-point. ",
            "Then the Blessed and High Said <span class=\"ibTxt\"><a href=\"/#/books/quran:17#h78\">[17:78]</a> and the morning recitation; surely the recitation at dawn was always witnessed</span>. So this is the fifth one. And Allah<sup>azwj</sup> the Exalted Says regarding that <span class=\"ibTxt\"><a href=\"/#/books/quran:11#h114\">[11:114]</a> And establish Prayer in the two parts of the day and in the first hours of the night</span>. And its two parts are the Maghrib and the morning, and the first hours from the night, it is the last Isha. And the Exalted Said <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h238\">[2:238]</a> Protect your Salāt and the middle Salāt</span> – and it is the Zohr <span class=\"iTxt\">Salāt</span>, and it is the first <span class=\"iTxt\">Salāt</span> which Rasool-Allah<sup>saww</sup> prayed, and it is in the middle of the day. And the middle two <span class=\"iTxt\">Salāts</span> by the day is the morning <span class=\"iTxt\">Salāt</span> and <span class=\"iTxt\">Salāt</span> Al-Asr. And in some recitations (of the Quran, the Verse is as) <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h238\">[2:238]</a> Protect your Salāt and the middle Salāt, Salāt Al-Asr, and stand up truly obedient to Allah</span>’.",
            "He<sup>asws</sup> said: ‘And this Verse was Revealed on the day of Friday, and Rasool-Allah<sup>saww</sup> was in his<sup>saww</sup> journey. So Rasool-Allah<sup>saww</sup> taught it and left it upon its state during the journey and not travelling, and increased two <span class=\"iTxt\">Rak’at</span> for the non-traveller. And rather, the two <span class=\"iTxt\">Rak’at</span> which the Prophet<sup>saww</sup> increased on the day of Friday was in place of the two sermons with the prayer-leader. So the one who prays <span class=\"iTxt\">Salāt</span> on the day of Friday in other than a <span class=\"iTxt\">Jam’at</span>, so let him pray it as four <span class=\"iTxt\">Rak’at</span>, like the Zohr <span class=\"iTxt\">Salāt</span> during the rest of the days’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa and Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa and Muhammad ibn ’Isma‘il from af-Fadl ibn Shadhan all Hammad ibn ‘Isa from Hariz from Zurarah who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about how much of Salah (prayer) Allah, most Majestic, most Glorious, has made obligatory. He (the Imam) said, ‘During one day and night five Salah (prayer) are made obligatory.’ I then asked, ‘Has He named and explained them in His book?’ He (the Imam) said, ‘Yes, Allah, most High has said to His Holy Prophet, “Perform Salah (prayer) after the sun declines to the west, on midday until the darkness of the night.” (17: 78). The sun declines on midday. There are four Salah (prayer) between midday and the darkness of the night. Allah has named, explained and timed them. Darkness of night is in midnight. He, most Blessed, most High has then said, “. . . and the recitation (performing Salah (prayer)) at dawn and recitation at dawn was witnessed (attended by the angels of the day and those of the nights).” These are five Salah (prayers). Allah, most High about this issue has said, “Perform Salah (prayer) on both ends of the day, [which is sunset and morning], and in a part of the night.” <a href=\"/#/books/quran:11#h116\">[11:116]</a> This is al-Tsha’ Salah (prayer) He, most High has said, “Preserve Salah (prayer) especially the middle Salah (prayer).” <a href=\"/#/books/quran:2#h239\">[2:239]</a> Middle Salah (prayer) is al- Dhuhr Salah (prayer) which is the first Salah (prayer) the Messenger of Allah performed. It is in the middle of two Salah (prayer) during the day, the morning and al-‘Asr Salah (prayer). In some of the recitations it is said, “Preserve Salawat (prayers) and the middle Salah (prayer).” Middle Salah (prayer) is al-‘Asr Salah (prayer).’ About the words of Allah, “Stand up praying before Allah,” he (the Imam) said, ‘This verse was revealed on Friday when the Messenger of Allah was on a journey. The Messenger of Allah prayed before Allah on Friday and left it in that condition during a journey or when at home. For those at home he added two Rak‘ats. He reduced two Rak‘at which the Holy Prophet, had added on Friday for people when at home, because of the two sermons which a prayer leader delivers. Those who perform Friday prayer without congregation, they perform it four Rak‘at like al-Dhuhr Salah (prayer) in other days.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/22)"
        ],
        "index": 4797,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1681",
              "text": "وَ بِإِسْنَادِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/317",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/195",
              "text": "حَرِيزٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/196",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِإِسْنَادِهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:3:2",
        "text": [
          " كَانَ الَّذِي فَرَضَ اللَّهُ عَلَى الْعِبَادِ مِنَ الصَّلَاةِ عَشْرَ رَكَعَاتٍ وَ فِيهِنَّ الْقِرَاءَةُ وَ لَيْسَ فِيهِنَّ وَهْمٌ يَعْنِي سَهْواً فَزَادَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) سَبْعاً وَ فِيهِنَّ الْوَهْمُ وَ لَيْسَ فِيهِنَّ قِرَاءَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by his chain, from Hammad, from Hareyz, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘It was so, from the <span class=\"iTxt\">Salāts</span> which Allah<sup>azwj</sup> Obligated upon the servants, as being ten <span class=\"iTxt\">Rak’at</span>, and in these are recitations, and there are no whims (allowed) therein, meaning the mistakes. So Rasool-Allah<sup>saww</sup> increased seven (<span class=\"iTxt\">Rak’at</span>), and in these the whims (mistakes are allowed), and there is no recitation in these’."
          ],
          "en.sarwar": [
            "2. Through the chain of his narrators Hammad has narrated from Hariz from Zurarah who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘Of Salah (prayer) Allah has made ten Rak‘at obligatory on His servants. In such Salah (prayer) there are the recitations; thus, conjectures, mistakes in such Salah (prayer) are not acceptable. The Messenger of Allah added seven Rak‘ats in which conjectures, mistakes are dealt with according to certain rules, but there are no recitations in them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/23)"
        ],
        "index": 4798,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1681",
              "text": "وَ بِإِسْنَادِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/317",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/195",
              "text": "حَرِيزٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/196",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِإِسْنَادِهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ زُرَارَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:3:3",
        "text": [
          " قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) فَرَضَ اللَّهُ الصَّلَاةَ وَ سَنَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَشَرَةَ أَوْجُهٍ صَلَاةَ الْحَضَرِ وَ السَّفَرِ وَ صَلَاةَ الْخَوْفِ عَلَى ثَلَاثَةِ أَوْجُهٍ وَ صَلَاةَ كُسُوفِ الشَّمْسِ وَ الْقَمَرِ وَ صَلَاةَ الْعِيدَيْنِ وَ صَلَاةَ الِاسْتِسْقَاءِ وَ الصَّلَاةَ عَلَى الْمَيِّتِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by his chain, from Hammad, from Hareyz, from Zurara who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Necessitated the <span class=\"iTxt\">Salāt</span>, and Rasool-Allah<sup>saww</sup> established the Sunnah upon ten aspects – <span class=\"iTxt\">Salāt</span> of the non-traveller, and the traveller, and the <span class=\"iTxt\">Salāt</span> of fear being upon three aspects, and <span class=\"iTxt\">Salāt</span> of the eclipse of the sun and the moon, and <span class=\"iTxt\">Salāt</span> of the two Eids, and <span class=\"iTxt\">Salāt</span> for the rain, and <span class=\"iTxt\">Salāt</span> upon the deceased’."
          ],
          "en.sarwar": [
            "3. Through the chain of his narrators Hammad has narrated from Hariz from Zurarah who has said the following: “‘Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘Allah has made Salah (prayer) obligatory. The Messenger of Allah has established ten kinds of traditions in Salah (prayer): Salah (prayer) at home and during a journey. Salah (prayer) due to fear is of three kinds. There is Salah (prayer) because of sun eclipse and moon eclipse. There is Salah (prayer) of the two ‘Id. There is Salah (prayer) for rain and (lastly) Salah (prayer) for a deceased.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/24)"
        ],
        "index": 4799,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:3:4",
        "relations": {
          "Mentions": [
            "/books/quran:4:103"
          ]
        },
        "text": [
          "حَمَّادٌ عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّ الصَّلاةَ كانَتْ عَلَى الْمُؤْمِنِينَ كِتاباً مَوْقُوتاً أَيْ مَوْجُوباً ."
        ],
        "translations": {
          "en.hubeali": [
            "Hammad, from Hareyz, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h103\">[4:103]</a> surely the Salāt was always a timed ordinance upon the Believers</span> – i.e. Obligatory’."
          ],
          "en.sarwar": [
            "4. Hammad has narrated from Hariz from Zurarah from who has said the following: “About the words of Allah, most Majestic, most Glorious, ‘Salah (prayer) in Mawqut (with certain timing) form was written on believers’ abu Ja‘far, ‘Alayhi al-Salam, has said, ‘it means obligatory.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/24)"
        ],
        "index": 4800,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2669",
              "text": "حَمَّادٌ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/195",
              "text": "حَرِيزٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/196",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "حَمَّادٌ عَنْ حَرِيزٍ عَنْ زُرَارَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:3:5",
        "text": [
          " سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الْفَرْضِ فِي الصَّلَاةِ فَقَالَ الْوَقْتُ وَ الطَّهُورُ وَ الْقِبْلَةُ وَ التَّوَجُّهُ وَ الرُّكُوعُ وَ السُّجُودُ وَ الدُّعَاءُ قُلْتُ مَا سِوَى ذَلِكَ قَالَ سُنَّةٌ فِي فَرِيضَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Hammad, from Hareyz, from Zurara who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the necessities regarding the <span class=\"iTxt\">Salāt</span>. So he<sup>asws</sup> said: ‘The timing, and the cleanliness, and the Qiblah, and the concentration, and the <span class=\"iTxt\">Rukū</span>, and the <span class=\"iTxt\">Sajdah</span>, and the supplication’. I said, ‘What is besides that?’ He<sup>asws</sup> said: ‘A Sunnah among the necessities’."
          ],
          "en.sarwar": [
            "5. Hammad has narrated from Hariz from Zurarah from who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about what is obligatory in Salah (prayer). He (the Imam) said, ‘Time, al-Tahur (cleansing), facing al-Qiblah (al-Ka‘bah), paying attention, al-Ruku‘, al-Sujud and praying. The rest are optional in an obligatory duty.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن وآخره مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/25)"
        ],
        "index": 4801,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/133",
              "text": "حَمَّادِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:3:6",
        "text": [
          " لِلصَّلَاةِ أَرْبَعَةُ آلَافِ حَدٍّ .",
          "وَ فِي رِوَايَةٍ أُخْرَى لِلصَّلَاةِ أَرْبَعَةُ آلَافِ بَابٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘For <span class=\"iTxt\">Salāt</span>, there are four thousand limits’.",
            "And in another report: ‘For the <span class=\"iTxt\">Salāt</span>, there are four thousand doors (chapters)’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Salah (prayer) has four thousand limits (rules).”’ “In another Hadith it is said that in Salah (prayer) there are four thousand doors (chapters).” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/26)"
        ],
        "index": 4802,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/227",
              "text": "عُمَرَ بْنِ أُذَيْنَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/196",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:3:7",
        "text": [
          " عَشْرُ رَكَعَاتٍ رَكْعَتَانِ مِنَ الظُّهْرِ وَ رَكْعَتَانِ مِنَ الْعَصْرِ وَ رَكْعَتَا الصُّبْحِ وَ رَكْعَتَا الْمَغْرِبِ وَ رَكْعَتَا الْعِشَاءِ الْآخِرَةِ لَا يَجُوزُ الْوَهْمُ فِيهِنَّ وَ مَنْ وَهَمَ فِي شَيْ‏ءٍ مِنْهُنَّ اسْتَقْبَلَ الصَّلَاةَ اسْتِقْبَالًا وَ هِيَ الصَّلَاةُ الَّتِي فَرَضَهَا اللَّهُ عَزَّ وَ جَلَّ عَلَى الْمُؤْمِنِينَ فِي الْقُرْآنِ وَ فَوَّضَ إِلَى مُحَمَّدٍ ( صلى الله عليه وآله ) ",
          "فَزَادَ النَّبِيُّ ( صلى الله عليه وآله ) فِي الصَّلَاةِ سَبْعَ رَكَعَاتٍ وَ هِيَ سُنَّةٌ لَيْسَ فِيهَا قِرَاءَةٌ إِنَّمَا هُوَ تَسْبِيحٌ وَ تَهْلِيلٌ وَ تَكْبِيرٌ وَ دُعَاءٌ فَالْوَهْمُ إِنَّمَا يَكُونُ فِيهِنَّ فَزَادَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فِي صَلَاةِ الْمُقِيمِ غَيْرِ الْمُسَافِرِ رَكْعَتَيْنِ فِي الظُّهْرِ وَ الْعَصْرِ وَ الْعِشَاءِ الْآخِرَةِ وَ رَكْعَةً فِي الْمَغْرِبِ لِلْمُقِيمِ وَ الْمُسَافِرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Ten <span class=\"iTxt\">Rak’at</span> (of <span class=\"iTxt\">Salāt</span>) are – two <span class=\"iTxt\">Rak’at</span> from Al-Zohr, and two <span class=\"iTxt\">Rak’at</span> from Al-Asr, and two <span class=\"iTxt\">Rak’at</span> from Al-Sub’h, and two <span class=\"iTxt\">Rak’at</span> from Al-Maghrib, and two <span class=\"iTxt\">Rak’at</span> from the last Isha. The whims (mistakes) are not allowed in these, and the one who errs in something from these should welcome the <span class=\"iTxt\">Salāt</span> with a welcoming (pray again); and it is the <span class=\"iTxt\">Salāt</span> which Allah<sup>azwj</sup> and Majestic Necessitated upon the Believers in the Quran, and Delegated it to Muhammad<sup>saww</sup>. ",
            "So the Prophet<sup>saww</sup> increased in the <span class=\"iTxt\">Salāt</span> by seven <span class=\"iTxt\">Rak’at</span>, and it is the Sunnah in which there is no recitation. But rather, it is a Glorification, and Extollation of the Holiness, and the exclamation of the Greatness, and supplication. So the mistakes, rather can happen to be in these. So Rasool-Allah<sup>saww</sup> increased in the <span class=\"iTxt\">Salāt</span> of the stayer, (the one) not travelling, by two <span class=\"iTxt\">Rak’at</span> during Al-Zohr and Al-Asr, and Al-Isha the last, and one <span class=\"iTxt\">Rak’at</span> in Al-Maghrib for the stayer as well as the traveller’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ’Udhaynah from Zurarah who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘There are ten Rak‘at in Salah (prayer). There are two for al- Dhuhr, two for al-‘Asr, two Rak‘at of Morning, two Rak‘at of al-Maghrib and two Rak‘at of al-‘Isha’ al-Akhirah. In these many of Salah (prayer) conjectures (mistakes) are not acceptable. If one faces conjectures in such Salah (prayer), he performs it again. They are Salah (prayer) which Allah, most Majestic, most Glorious, made obligatory on believers in al-Quran. He (Allah) delegated Muhammad, ‘Alayhi al-Salam, and he (the Holy prophet) increased seven Rak‘at. They are of Sunnah and have no recitations. They have Tasbih (Allah is free of all defects), Tahlil, (no one deserves worship except Allah) Takbir (Allah is great beyond description), and prayer. Conjectures in these Rak‘at are (dealt with according to certain rules). The Messenger of Allah increased two Rak‘at for those at home in al- Dhuhr, al-‘Asr, al-‘Isha’, al-Akhirah and one Rak‘at to al-Maghrib for those at home as well as for those on a journey.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/26)"
        ],
        "index": 4803,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/317",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/171",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:3:8",
        "text": [
          " الصَّلَاةُ ثَلَاثَةُ أَثْلَاثٍ ثُلُثٌ طَهُورٌ وَ ثُلُثٌ رُكُوعٌ وَ ثُلُثٌ سُجُودٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The <span class=\"iTxt\">Salāt</span> is of three (sections) – a third being cleanliness, and a third being <span class=\"iTxt\">Rukū</span>, and a third being <span class=\"iTxt\">Sajdah</span>’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Acts of Salah (prayer) fall in three categories; They are Tahur (cleansing), Ruku‘ (bowing down on one’s knees), and Sujud (prostration).”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:4:3",
  "kind": "verse_list"
}