{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 4"
        },
        "path": "/books/al-kafi:3:4:4",
        "titles": {
          "ar": "باب الْمَوَاقِيتِ أَوَّلِهَا وَ آخِرِهَا وَ أَفْضَلِهَا",
          "en": "Chapter 4 – The timings – its beginning, and its ending, and the best of it"
        }
      }
    ],
    "index": 671,
    "local_index": 4,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 5"
        },
        "path": "/books/al-kafi:3:4:5",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب وَقْتِ الظُّهْرِ</span> وَ الْعَصْرِ",
          "en": "Chapter 5 – The timing of Al-Zohr and Al-Asr"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:3:4:3",
        "titles": {
          "ar": "باب فَرْضِ الصَّلَاةِ",
          "en": "Chapter 3 – Obligation of the Salāt"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:4:4",
    "titles": {
      "ar": "باب الْمَوَاقِيتِ أَوَّلِهَا وَ آخِرِهَا وَ أَفْضَلِهَا",
      "en": "Chapter 4 – The timings – its beginning, and its ending, and the best of it"
    },
    "verse_count": 9,
    "verse_start_index": 4803,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/27)"
        ],
        "index": 4804,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:4:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ زُرَارَةَ قَالَ كُنْتُ قَاعِداً عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَا وَ حُمْرَانُ بْنُ أَعْيَنَ فَقَالَ لَهُ حُمْرَانُ مَا تَقُولُ فِيمَا يَقُولُ زُرَارَةُ وَ قَدْ خَالَفْتُهُ فِيهِ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَا هُوَ قَالَ يَزْعُمُ أَنَّ مَوَاقِيتَ الصَّلَاةِ كَانَتْ مُفَوَّضَةً إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) هُوَ الَّذِي وَضَعَهَا ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَمَا تَقُولُ أَنْتَ قُلْتُ إِنَّ جَبْرَئِيلَ ( عليه السلام ) أَتَاهُ فِي الْيَوْمِ الْأَوَّلِ بِالْوَقْتِ الْأَوَّلِ وَ فِي الْيَوْمِ الْأَخِيرِ بِالْوَقْتِ الْأَخِيرِ ثُمَّ قَالَ جَبْرَئِيلُ ( عليه السلام ) مَا بَيْنَهُمَا وَقْتٌ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا حُمْرَانُ إِنَّ زُرَارَةَ يَقُولُ إِنَّ جَبْرَئِيلَ ( عليه السلام ) إِنَّمَا جَاءَ مُشِيراً عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ صَدَقَ زُرَارَةُ إِنَّمَا جَعَلَ اللَّهُ ذَلِكَ إِلَى مُحَمَّدٍ ( صلى الله عليه وآله ) فَوَضَعَهُ وَ أَشَارَ جَبْرَئِيلُ ( عليه السلام ) بِهِ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Zurara who said, ",
            "‘I was seated in the presence of Abu Abdullah<sup>asws</sup>, I and Humran Bin Ayn. So Humran said to him<sup>asws</sup>, ‘What are you<sup>asws</sup> saying regarding what Zurara is saying, and I am differing with him with regards to it?’ So Abu Abdullah<sup>asws</sup> said: ‘What is it?’ He said, ‘He is alleging that the timings of the <span class=\"iTxt\">Salāt</span> were delegated to Rasool-Allah<sup>saww</sup> (to decide upon). He<sup>saww</sup> is the one who placed these’. ",
            "So Abu Abdullah<sup>asws</sup> said: ‘So what are you saying?’ I said, ‘Jibraeel<sup>as</sup> came to him<sup>saww</sup> during the first day with the first timings, and during another day with the last of it. Then Jibraeel<sup>as</sup> said what the timings were in between the two’. So Abu Abdullah<sup>asws</sup> said: ‘O Humran! Zurara is saying that Jibraeel<sup>as</sup> came as an indicator to Rasool-Allah<sup>saww</sup>, and Zurara speaks the truth. But rather, Allah<sup>azwj</sup> Made that to be for Muhammad<sup>saww</sup>, and he<sup>saww</sup> placed it, and Jibraeel<sup>as</sup> indicated with it to him<sup>saww</sup>’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ’Udhaynah from Zurarah from who has said the following: “I once was sitting in the presence of abu ’Abd Allah, ‘Alayhi al-Salam, and Humran ibn ’A‘yan was also present. Humran asked him (the Imam), ‘What do you say about the words of Zurarah with which I do not agree?’ Abu ‘Abd Allah, ‘Alayhi al-Salam, asked, ‘What are they?’ Humran said, ‘Zurarah says that the time for Salah (prayer) was delegated to the Messenger of Allah. He was the one who determined them.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, asked, ‘What do you (Humran) say about it?’ I (Humran) said, ‘ Jibril came to him (the Holy prophet) on the first day with the first time and on the last day with the last time. Jibril then said, ‘In between there are times for Salah (prayer).’ Abu ‘Abd Allah, ‘Alayhi al-Salam, then said, ‘O Humran, Zurarah says that Jibril came to the Messenger of Allah only to give him an indication. Zurarah is right. Allah left it to Muhammad, O Allah grant compensation to Muhammad and his family worthy of their services to Your cause, who made the determination. Jibril provided him with an indication about it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/27)"
        ],
        "index": 4805,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:4:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ عَلَّانٍ عَنْ حَمَّادِ بْنِ عِيسَى وَ صَفْوَانَ بْنِ يَحْيَى عَنْ رِبْعِيِّ بْنِ عَبْدِ اللَّهِ عَنْ فُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ مِنَ الْأَشْيَاءِ أَشْيَاءَ مُوَسَّعَةً وَ أَشْيَاءَ مُضَيَّقَةً فَالصَّلَاةُ مِمَّا وُسِّعَ فِيهِ تُقَدَّمُ مَرَّةً وَ تُؤَخَّرُ أُخْرَى وَ الْجُمُعَةُ مِمَّا ضُيِّقَ فِيهَا فَإِنَّ وَقْتَهَا يَوْمَ الْجُمُعَةِ سَاعَةُ تَزُولُ وَ وَقْتَ الْعَصْرِ فِيهَا وَقْتُ الظُّهْرِ فِي غَيْرِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Al Hassan Bin Allan, from Hammad Bin Isa, and Safwan Bin Yahya, from Rabie Bin Abdullah, from Fuzayl Bin Yasaar, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘From the things there are things with leeway and things with constraints. So the <span class=\"iTxt\">Salāt</span> is from what there is leeway in it. You can pray it (in its) early hours, or delay it to a later time; but the Friday (<span class=\"iTxt\">Salāt</span>) is from that where there is a constraint in it, for its timing is the day of Friday, a time at midday, and the time for Al-Asr during it is the time of Al-Zohr during other (days)’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn al-Hassan ibn ‘Allan from Hammad ibn ‘Isa and from Safwan ibn Yahya from Rib‘i ibn ‘Abd Allah from al-Fudayl ibn Yasar who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘Of the things certain ones are of a longer timing and others are of shorter timing. Salah (prayer) is of longer timing. It can be performed earlier and later. Friday Salah (prayer) is of a short timing. On Friday its time is a Sa‘ah which then vanish. The time for al-‘Asr Salah (prayer) on Friday is the time for al-Dhuhr on other days.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/28)"
        ],
        "index": 4806,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:4:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ لِكُلِّ صَلَاةٍ وَقْتَانِ وَ أَوَّلُ الْوَقْتِ أَفْضَلُهُ وَ لَيْسَ لِأَحَدٍ أَنْ يَجْعَلَ آخِرَ الْوَقْتَيْنِ وَقْتاً إِلَّا فِي عُذْرٍ مِنْ غَيْرِ عِلَّةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus Bin Abdul Rahman, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘For every <span class=\"iTxt\">Salāt</span> are two timings, and the beginning time is superior; and it is not for anyone that he makes the last of the two timings as a timing except during an excuse from other than an illness’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus ibn ‘Abd al-Rahman from ‘Abd Allah ibn Sinan who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘For every Salah (prayer) there are two kinds of timings; the beginning of time is the outstanding one, and no one has the right to call the end of two kinds of timings as a time, without good reason, and for no reason.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/29)"
        ],
        "index": 4807,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:4:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ أَوِ ابْنِ وَهْبٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لِكُلِّ صَلَاةٍ وَقْتَانِ أَوَّلُ الْوَقْتِ أَفْضَلُهُمَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Muawiya Bin Ammar, or Ibn Wahab who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘For every <span class=\"iTxt\">Salāt</span> are two timings (its onset and its lapse part within a time frame) – (but) the onset time (of Salāt) is the superior of the two’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Fadalah ibn Ayyub Mu‘awiyah ibn ‘Ammar or ibn Wahab who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘For every Salah (prayer) there are two kinds of timings and the outstanding one is the beginning of time.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/29)"
        ],
        "index": 4808,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:4:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ زُرَارَةَ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) أَصْلَحَكَ اللَّهُ وَقْتُ كُلِّ صَلَاةٍ أَوَّلُ الْوَقْتِ أَفْضَلُ أَوْ أَوْسَطُهُ أَوْ آخِرُهُ فَقَالَ أَوَّلُهُ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يُحِبُّ مِنَ الْخَيْرِ مَا يُعَجَّلُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Ibn Abu Umeyr, from Umar Bin Azina, from Zurara who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! For each <span class=\"iTxt\">Salāt</span>, is the beginning time superior, or its middle, or its last?’ So he<sup>asws</sup> said: ‘Its beginning. Rasool-Allah<sup>saww</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Loves from the goodness what is hastened with’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ’Udhaynah from Zurarah who has said the following: “I once said to abu Ja‘far, ‘Alayhi al-Salam, ‘I pray to Allah to keep you well, of the timing for Salah (prayer), what portion is better? Is it the beginning, the middle or the end of time?’ He (the Imam) said, ‘It is the beginning of it; the Messenger of Allah has said, “Allah, most Majestic, most Glorious, loves of good things the most that which is done earlier.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/29)"
        ],
        "index": 4809,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:4:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنْ عَلِيِّ بْنِ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبِيهِ عَنْ قُتَيْبَةَ الْأَعْشَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ فَضْلَ الْوَقْتِ الْأَوَّلِ عَلَى الْآخِرِ كَفَضْلِ الْآخِرَةِ عَلَى الدُّنْيَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Salma Bin Al Khattab, from Ali Bin Sayf Bin Ameyra, from his father, from Quteyba Al A’ash, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The merit of the beginning time upon the end time is like the merit of the Hereafter over the world’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Salmah ibn al-Khattab from Ali ibn Sayf ibn ‘Amirah from his father from Qutaybah al-‘A’sha’ who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘The outstanding quality of the beginning of the time for Salah (prayer) is like the outstanding quality of the next life compared to the worldly life.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/29)"
        ],
        "index": 4810,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:4:7",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ بَكْرِ بْنِ مُحَمَّدٍ الْأَزْدِيِّ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَفَضْلُ الْوَقْتِ الْأَوَّلِ عَلَى الْأَخِيرِ خَيْرٌ لِلرَّجُلِ مِنْ وَلَدِهِ وَ مَالِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Ahmad Bin Is’haq, from Bakr Bin Muhammad Al Azdy who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Preferring the beginning time upon the last is better for the man than his children and his wealth’."
          ],
          "en.sarwar": [
            "7. Al-Husayn ibn Muhammad has narrated from Muhammad ibn Ahmad ibn Ishaq from Bakr ibn Muhammad al-Azdiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘The outstanding quality of the beginning of time for Salah (prayer) compared with the end of time for Salah (prayer) is better for a man than his children and belongings.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/30)"
        ],
        "index": 4811,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:4:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ زُرَارَةَ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) اعْلَمْ أَنَّ أَوَّلَ الْوَقْتِ أَبَداً أَفْضَلُ فَعَجِّلْ بِالْخَيْرِ مَا اسْتَطَعْتَ وَ أَحَبُّ الْأَعْمَالِ إِلَى اللَّهِ عَزَّ وَ جَلَّ مَا دَاوَمَ الْعَبْدُ عَلَيْهِ وَ إِنْ قَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Hammad, from Hareyz, from Zurara who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘Know, that the beginning time will always be superior, so hasten with the goodness whatever you are able to; and the most Beloved of the deeds to Allah<sup>azwj</sup> Mighty and Majestic is what the servant persists upon even though it be a little’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Hammad from Hariz from Zurarah who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘You must note that the beginning of time always is better, so act faster for the good as much as you can. The most beloved of deeds in the sight of Allah, most Majestic, most Glorious, is that which a servant continues even if it is very little.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/30)"
        ],
        "index": 4812,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:4:9",
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ وَ غَيْرُهُ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ أَبِيهِ عَنْ مَنْصُورِ بْنِ حَازِمٍ أَوْ غَيْرِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ عَلِيُّ بْنُ الْحُسَيْنِ ( صلوات الله عليه ) مَنِ اهْتَمَّ بِمَوَاقِيتِ الصَّلَاةِ لَمْ يَسْتَكْمِلْ لَذَّةَ الدُّنْيَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, and someone else, from Muhammad Bin Ahmad, from Muhammad Bin Al Husayn, from his father, from Mansour Bin Hazim, or someone else, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> said: ‘The one who is attentive with the timings of the <span class=\"iTxt\">Salāt</span> would never indulge into the pleasures of the world’."
          ],
          "en.sarwar": [
            "9. Ahmad ibn Idris and others have narrated from Muhammad ibn Ahmad from Muhammad ibn al-Husayn from his father from Mansur ibn Hazim or others who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Ali ibn al-Husayn, ‘Alayhi al-Salam, has said, "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:4:4",
  "kind": "verse_list"
}