{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:3:4", "titles": {"ar": "كِتَابُ الصَّلَاةِ", "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "}}, {"indexed_titles": {"en": "Chapter 40"}, "path": "/books/al-kafi:3:4:40", "titles": {"ar": "باب السَّهْوِ فِي الثَّلَاثِ وَ الْأَرْبَعِ", "en": "Chapter 40 – The omission in the third and the fourth (Rak’at)"}}], "index": 707, "local_index": 40, "part_type": "Chapter", "path": "/books/al-kafi:3:4:40", "titles": {"ar": "باب السَّهْوِ فِي الثَّلَاثِ وَ الْأَرْبَعِ", "en": "Chapter 40 – The omission in the third and the fourth (Rak’at)"}, "verse_count": 9, "verse_start_index": 5139, "verses": [{"index": 5140, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:4:40:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> وَ غَيْرُهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ عَنِ الْحُسَيْنِ بْنِ عُثْمَانَ عَنْ سَمَاعَةَ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُهُ عَنْ رَجُلٍ صَلَّى فَلَمْ يَدْرِ أَ فِي الثَّالِثَةِ هُوَ أَمْ فِي الرَّابِعَةِ قَالَ فَمَا ذَهَبَ وَهْمُهُ إِلَيْهِ إِنْ رَأَى أَنَّهُ فِي الثَّالِثَةِ وَ فِي قَلْبِهِ مِنَ الرَّابِعَةِ شَيْ‏ءٌ سَلَّمَ بَيْنَهُ وَ بَيْنَ نَفْسِهِ ثُمَّ يُصَلِّي رَكْعَتَيْنِ يَقْرَأُ فِيهِمَا بِفَاتِحَةِ الْكِتَابِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, and someone else, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat, from Al Husayn Bin Usman, from Sama’at, from Abu Baseer who said, \n‘I asked him<sup>asws</sup> about a man who prays but he does not know whether he is in the third or in the fourth (<span class=\"iTxt\">Rak’at</span>). He<sup>asws</sup> said: ‘If he according to his guess thinks it is the third or fourth, he accepts it along with his soul. Then he should pray two <span class=\"iTxt\">Rak’at</span>, reciting in these two with the Opening of the Book (Chapter 1)’."}]}, {"index": 5141, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:4:40:2", "text": "وَ عَنْهُ عَنْ أَحْمَدَ عَنِ الْحُسَيْنِ عَنْ فَضَالَةَ عَنِ الْحُسَيْنِ بْنِ أَبِي الْعَلَاءِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ إِنِ اسْتَوَى وَهْمُهُ فِي الثَّلَاثِ وَ الْأَرْبَعِ سَلَّمَ وَ صَلَّى رَكْعَتَيْنِ وَ أَرْبَعَ سَجَدَاتٍ بِفَاتِحَةِ الْكِتَابِ وَ هُوَ جَالِسٌ يَقْصِدُ فِي التَّشَهُّدِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Ahmad, from Al Husayn, from Fazalat, from Al Husayn Bin Abu Al A’ala, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘If his imagination is established regarding the third and the fourth, he should greet (complete the <span class=\"iTxt\">Salāt</span>), and he should pray two <span class=\"iTxt\">Rak’at</span> of <span class=\"iTxt\">Salāt</span>, and four <span class=\"iTxt\">Sajdah</span> with the Opening of the Book while he is seated, intending in the <span class=\"iTxt\">Tashahhud</span>’."}]}, {"index": 5142, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:4:40:3", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ قُلْتُ لَهُ مَنْ لَمْ يَدْرِ فِي أَرْبَعٍ هُوَ أَمْ فِي ثِنْتَيْنِ وَ قَدْ أَحْرَزَ الثِّنْتَيْنِ قَالَ يَرْكَعُ رَكْعَتَيْنِ وَ أَرْبَعَ سَجَدَاتٍ وَ هُوَ قَائِمٌ بِفَاتِحَةِ الْكِتَابِ وَ يَتَشَهَّدُ وَ لَا شَيْ‏ءَ عَلَيْهِ وَ إِذَا لَمْ يَدْرِ فِي ثَلَاثٍ هُوَ أَوْ فِي أَرْبَعٍ وَ قَدْ أَحْرَزَ الثَّلَاثَ قَامَ فَأَضَافَ إِلَيْهَا أُخْرَى وَ لَا شَيْ‏ءَ عَلَيْهِ \nوَ لَا يَنْقُضُ الْيَقِينَ بِالشَّكِّ وَ لَا يُدْخِلُ الشَّكَّ فِي الْيَقِينِ وَ لَا يَخْلِطُ أَحَدَهُمَا بِالْآخَرِ وَ لَكِنَّهُ يَنْقُضُ الشَّكَّ بِالْيَقِينِ وَ يُتِمُّ عَلَى الْيَقِينِ فَيَبْنِي عَلَيْهِ وَ لَا يَعْتَدُّ بِالشَّكِّ فِي حَالٍ مِنَ الْحَالَاتِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Hammad Bin Isa, from Hareyz, from Zurara, \n(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>), said, ‘I said to him<sup>asws</sup>, ‘The one who does not know whether he is in a fourth or in the second, and he has accomplished two’. He<sup>asws</sup> said: ‘He should perform two <span class=\"iTxt\">Rak’at</span> and four <span class=\"iTxt\">Sajdah</span>s while he is standing, with the Opening of the Book (Chapter 1), and he should perform <span class=\"iTxt\">Tashahhud</span> and there would be nothing upon him; and when he does not know whether he was in a third or in a fourth (<span class=\"iTxt\">Rak’at</span>), and he has accomplished three, he would stand and increase upon it by another, and there would be nothing upon him.\nAnd neither can the conviction be invalidated by the doubt nor can the doubt enter into the conviction, nor can one of the two get mixed up with the other, but, the doubt would be invalidated by the conviction, and he would complete (the <span class=\"iTxt\">Salāt</span>) upon the conviction. Thus, he would build upon it and he would not repeat with the doubt in any state from the states’."}]}, {"index": 5143, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:3:4:40:4", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنِ ابْنِ مُسْكَانَ عَنِ ابْنِ أَبِي يَعْفُورٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ لَا يَدْرِي رَكْعَتَيْنِ صَلَّى أَمْ أَرْبَعاً قَالَ يَتَشَهَّدُ وَ يُسَلِّمُ ثُمَّ يَقُومُ فَيُصَلِّي رَكْعَتَيْنِ وَ أَرْبَعَ سَجَدَاتٍ يَقْرَأُ فِيهِمَا بِفَاتِحَةِ الْكِتَابِ ثُمَّ يَتَشَهَّدُ وَ يُسَلِّمُ وَ إِنْ كَانَ صَلَّى أَرْبَعاً كَانَتْ هَاتَانِ نَافِلَةً وَ إِنْ كَانَ صَلَّى رَكْعَتَيْنِ كَانَتْ هَاتَانِ تَمَامَ الْأَرْبَعِ وَ إِنْ تَكَلَّمَ فَلْيَسْجُدْ سَجْدَتَيِ السَّهْوِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Ibn Muskan, from Ibn Abu Yafour who said, \n‘I asked Abu Abdullah<sup>asws</sup> about the man who does not know whether he has prayed two <span class=\"iTxt\">Rak’at</span> of <span class=\"iTxt\">Salāt</span> or four. He<sup>asws</sup> said: ‘He would perform <span class=\"iTxt\">Tashahhud</span>, then he would stand and pray two <span class=\"iTxt\">Rak’at</span> and four <span class=\"iTxt\">Sajdah</span>s, reciting in these two with the Opening of the Book. Then he would perform <span class=\"iTxt\">Tashahhud</span> and <span class=\"iTxt\">Salām </span>(greet)’ And if it was so that he had prayed four <span class=\"iTxt\">Rak’at</span>, these two would be (counted as) optional, and if it was so that he had prayed two <span class=\"iTxt\">Rak’at</span>, these two would complete the four. And if he speaks, so let him perform <span class=\"iTxt\">Sajdah</span> with the <span class=\"iTxt\">Sajdah</span> of the omission’."}]}, {"index": 5144, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:3:4:40:5", "text": "حَمَّادٌ عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ إِنَّمَا السَّهْوُ مَا بَيْنَ الثَّلَاثِ وَ الْأَرْبَعِ وَ فِي الِاثْنَتَيْنِ وَ فِي الْأَرْبَعِ بِتِلْكَ الْمَنْزِلَةِ وَ مَنْ سَهَا وَ لَمْ يَدْرِ ثَلَاثاً صَلَّى أَمْ أَرْبَعاً وَ اعْتَدَلَ شَكُّهُ قَالَ يَقُومُ فَيُتِمُّ ثُمَّ يَجْلِسُ فَيَتَشَهَّدُ وَ يُسَلِّمُ وَ يُصَلِّي رَكْعَتَيْنِ وَ أَرْبَعَ سَجَدَاتٍ وَ هُوَ جَالِسٌ \nفَإِنْ كَانَ أَكْثَرُ وَهْمِهِ إِلَى الْأَرْبَعِ تَشَهَّدَ وَ سَلَّمَ ثُمَّ قَرَأَ فَاتِحَةَ الْكِتَابِ وَ رَكَعَ وَ سَجَدَ ثُمَّ قَرَأَ وَ سَجَدَ سَجْدَتَيْنِ وَ تَشَهَّدَ وَ سَلَّمَ وَ إِنْ كَانَ أَكْثَرُ وَهْمِهِ إِلَى الثِّنْتَيْنِ نَهَضَ فَصَلَّى رَكْعَتَيْنِ وَ تَشَهَّدَ وَ سَلَّمَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Hammad, from Hareyz, from Muhammad Bin Muslim who said, \n‘But rather, the omission is what is between the third and the fourth, and in the second and the fourth is of that very status. And the one who forgets and does not know whether he has prayed three or four and his doubt is equal, he should stand and he would complete (the <span class=\"iTxt\">Salāt</span>), then he should be seated, so he would perform the <span class=\"iTxt\">Tashahhud</span>, and he would offer <span class=\"iTxt\">Salām</span> (greet), and he would pray two <span class=\"iTxt\">Rak’at</span>, and four <span class=\"iTxt\">Sajdah</span>s while he is seated. \nSo if his imagination was more towards the four (<span class=\"iTxt\">Rak’at</span> having been prayed), he should perform <span class=\"iTxt\">Tashahhud</span> and greet. Then he should recite the Opening of the Book (Chapter 1), and he should perform <span class=\"iTxt\">Rukū </span>and <span class=\"iTxt\">Sajdah</span>. Then he should recite and perform <span class=\"iTxt\">Sajdah</span> with two Sujūd (plural of <span class=\"iTxt\">Sajdah</span>), and one <span class=\"iTxt\">Tashahhud</span>, and greet (<span class=\"iTxt\">Salām</span>). And if it was so that his imagination was more towards the two (<span class=\"iTxt\">Rak’at</span> having been prayed), he should arise and pray two <span class=\"iTxt\">Rak’at</span>, and one <span class=\"iTxt\">Tashahhud</span>, and offer <span class=\"iTxt\">Salām</span> (greet)’."}]}, {"index": 5145, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:3:4:40:6", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ صَلَّى فَلَمْ يَدْرِ أَ ثِنْتَيْنِ صَلَّى أَمْ ثَلَاثاً أَمْ أَرْبَعاً قَالَ يَقُومُ فَيُصَلِّي رَكْعَتَيْنِ مِنْ قِيَامٍ وَ يُسَلِّمُ ثُمَّ يُصَلِّي رَكْعَتَيْنِ مِنْ جُلُوسٍ وَ يُسَلِّمُ فَإِنْ كَانَتْ أَرْبَعَ رَكَعَاتٍ كَانَتِ الرَّكْعَتَانِ نَافِلَةً وَ إِلَّا تَمَّتِ الْأَرْبَعُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from one of his companions, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who prays but he does not know whether he has prayed two or three or four. He<sup>asws</sup> said: ‘He should stand and pray two <span class=\"iTxt\">Rak’at</span> from a standing, then offer <span class=\"iTxt\">Salām</span>, then he should pray two <span class=\"iTxt\">Rak’at</span> from sitting and she should offer <span class=\"iTxt\">Salām</span>. So if it was so that (he had prayed) four <span class=\"iTxt\">Rak’at</span>, the two <span class=\"iTxt\">Rak’at</span> would be (counted as) optional, or else the four would be complete’."}]}, {"index": 5146, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:3:4:40:7", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ أَبَانٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَيَابَةَ وَ أَبِي الْعَبَّاسِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا لَمْ تَدْرِ ثَلَاثاً صَلَّيْتَ أَوْ أَرْبَعاً وَ وَقَعَ رَأْيُكَ عَلَى الثَّلَاثِ فَابْنِ عَلَى الثَّلَاثِ وَ إِنْ وَقَعَ رَأْيُكَ عَلَى الْأَرْبَعِ فَسَلِّمْ وَ انْصَرِفْ وَ إِنِ اعْتَدَلَ وَهْمُكَ فَانْصَرِفْ وَ صَلِّ رَكْعَتَيْنِ وَ أَنْتَ جَالِسٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Aban, from Abdul Rahman Bin Sayabat and Abu Al Abbas, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When you do not know whether you have prayed three (<span class=\"iTxt\">Rak’at</span>) or four, and your view falls upon the third, so build upon the third, and if your view falls upon the fourth, so offer <span class=\"iTxt\">Salām</span> and complete. And if your imagination was equal, so complete and pray two <span class=\"iTxt\">Rak’at</span> while you are seated’."}]}, {"index": 5147, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:3:4:40:8", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا لَمْ تَدْرِ ثِنْتَيْنِ صَلَّيْتَ أَمْ أَرْبَعاً وَ لَمْ يَذْهَبْ وَهْمُكَ إِلَى شَيْ‏ءٍ فَتَشَهَّدْ وَ سَلِّمْ ثُمَّ صَلِّ رَكْعَتَيْنِ وَ أَرْبَعَ سَجَدَاتٍ تَقْرَأُ فِيهِمَا بِأُمِّ الْقُرْآنِ ثُمَّ تَشَهَّدْ وَ سَلِّمْ فَإِنْ كُنْتَ إِنَّمَا صَلَّيْتَ رَكْعَتَيْنِ كَانَتَا هَاتَانِ تَمَامَ الْأَرْبَعِ وَ إِنْ كُنْتَ صَلَّيْتَ أَرْبَعاً كَانَتَا هَاتَانِ نَافِلَةً \nوَ إِنْ كُنْتَ لَا تَدْرِي ثَلَاثاً صَلَّيْتَ أَمْ أَرْبَعاً وَ لَمْ يَذْهَبْ وَهْمُكَ إِلَى شَيْ‏ءٍ فَسَلِّمْ ثُمَّ صَلِّ رَكْعَتَيْنِ وَ أَنْتَ جَالِسٌ تَقْرَأُ فِيهِمَا بِأُمِّ الْكِتَابِ وَ إِنْ ذَهَبَ وَهْمُكَ إِلَى الثَّلَاثِ فَقُمْ فَصَلِّ الرَّكْعَةَ الرَّابِعَةَ وَ لَا تَسْجُدْ سَجْدَتَيِ السَّهْوِ فَإِنْ ذَهَبَ وَهْمُكَ إِلَى الْأَرْبَعِ فَتَشَهَّدْ وَ سَلِّمْ ثُمَّ اسْجُدْ سَجْدَتَيِ السَّهْوِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad Bin Usman, from Al Halby, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When you do not know whether you have prayed two (<span class=\"iTxt\">Rak’at</span>) or four and your imagination does not go to anything, so perform <span class=\"iTxt\">Tashahhud</span> and offer <span class=\"iTxt\">Salām</span>. Then pray two <span class=\"iTxt\">Rak’at</span> (of <span class=\"iTxt\">Salāt</span>) and four <span class=\"iTxt\">Sujūd</span> (plural of <span class=\"iTxt\">Sajdah</span>), reciting in both of these with the Mother of the Quran (Chapter 1), then perform <span class=\"iTxt\">Tashahhud</span> and offer <span class=\"iTxt\">Salām</span>. So if it was so, that rather you had prayed two <span class=\"iTxt\">Rak’at</span>, these two would complete the four, and if you had prayed four, these two would be (counted as) optional (<span class=\"iTxt\">Salāt</span>). \nAnd if you did not know whether you had prayed three or four, and your imagination does not go towards anything, so offer <span class=\"iTxt\">Salām</span>, then pray two <span class=\"iTxt\">Rak’at</span> while you are seated, reciting in these two with the Mother of the Book (Chapter 1). And if your imagination goes towards the three (<span class=\"iTxt\">Rak’at</span> having been prayed), so stand and pray the fourth <span class=\"iTxt\">Rak’at</span> and do not perform <span class=\"iTxt\">Sajdah</span> with the <span class=\"iTxt\">Sajdah</span> of the omission. So if your imagination goes towards the four (<span class=\"iTxt\">Rak’at</span> having been prayed), so perform <span class=\"iTxt\">Tashahhud</span> and offer <span class=\"iTxt\">Salām</span>, then perform <span class=\"iTxt\">Sajdah</span> with the <span class=\"iTxt\">Sajdah</span> of the omission’."}]}, {"index": 5148, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:3:4:40:9", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ جَمِيلٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي مَنْ لَا يَدْرِي أَ ثَلَاثاً صَلَّى أَمْ أَرْبَعاً وَ وَهْمُهُ فِي ذَلِكَ سَوَاءٌ قَالَ فَقَالَ إِذَا اعْتَدَلَ الْوَهْمُ فِي الثَّلَاثِ وَ الْأَرْبَعِ فَهُوَ بِالْخِيَارِ إِنْ شَاءَ صَلَّى رَكْعَةً وَ هُوَ قَائِمٌ وَ إِنْ شَاءَ صَلَّى رَكْعَتَيْنِ وَ أَرْبَعَ سَجَدَاتٍ وَ هُوَ جَالِسٌ \nوَ قَالَ فِي رَجُلٍ لَمْ يَدْرِ أَ ثِنْتَيْنِ صَلَّى أَمْ أَرْبَعاً وَ وَهْمُهُ يَذْهَبُ إِلَى الْأَرْبَعِ أَوْ إِلَى الرَّكْعَتَيْنِ فَقَالَ يُصَلِّي رَكْعَتَيْنِ وَ أَرْبَعَ سَجَدَاتٍ وَ قَالَ إِنْ ذَهَبَ وَهْمُكَ إِلَى رَكْعَتَيْنِ وَ أَرْبَعٍ فَهُوَ سَوَاءٌ وَ لَيْسَ الْوَهْمُ فِي هَذَا الْمَوْضِعِ مِثْلَهُ فِي الثَّلَاثِ وَ الْأَرْبَعِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Hadeed, from Jameel, from one of our companions, \nfrom Abu Abdullah<sup>asws</sup> having said regarding the one who does not know whether he had prayed three (<span class=\"iTxt\">Rak’at</span>) or four, and his imagination with regards to that is equal, said: ‘When the imagination is equated regarding the third and the fourth, so he is with the choice, if he so desires to he prays one <span class=\"iTxt\">Rak’at</span> while he is standing, and if he so desires to he prays two <span class=\"iTxt\">Rak’at</span> and four <span class=\"iTxt\">Sujūd </span>(plural of <span class=\"iTxt\">Sajdah</span>s) while he is seated’. \nAnd he<sup>asws</sup> said regarding a man who does not know whether he had prayed two (<span class=\"iTxt\">Rak’at</span>) or four, and his imagination goes towards the four, or towards the two <span class=\"iTxt\">Rak’at</span>. So he<sup>asws</sup> said: ‘He should pray two <span class=\"iTxt\">Rak’at</span> and four <span class=\"iTxt\">Sujūd </span>(plural of <span class=\"iTxt\">Sajdah</span>s). And he<sup>asws</sup> said: ‘If his imagination goes towards the two <span class=\"iTxt\">Rak’at</span> and the four <span class=\"iTxt\">Rak’at</span>, so it is the same, and the imagination in this place is not similar to regarding the three and the four’."}]}]}, "index": "al-kafi:3:4:40", "kind": "verse_list"}