{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:3:4", "titles": {"ar": "كِتَابُ الصَّلَاةِ", "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "}}, {"indexed_titles": {"en": "Chapter 42"}, "path": "/books/al-kafi:3:4:42", "titles": {"ar": "باب مَنْ تَكَلَّمَ فِي صَلَاتِهِ أَوِ انْصَرَفَ قَبْلَ أَنْ يُتِمَّهَا أَوْ يَقُومُ فِي مَوْضِعِ الْجُلُوسِ", "en": "Chapter 42 – The one who speaks during his Salāt, or leaves before he completes it, or stands in place of the sitting"}}], "index": 709, "local_index": 42, "part_type": "Chapter", "path": "/books/al-kafi:3:4:42", "titles": {"ar": "باب مَنْ تَكَلَّمَ فِي صَلَاتِهِ أَوِ انْصَرَفَ قَبْلَ أَنْ يُتِمَّهَا أَوْ يَقُومُ فِي مَوْضِعِ الْجُلُوسِ", "en": "Chapter 42 – The one who speaks during his Salāt, or leaves before he completes it, or stands in place of the sitting"}, "verse_count": 9, "verse_start_index": 5154, "verses": [{"index": 5155, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:4:42:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ بْنِ مِهْرَانَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَنْ حَفِظَ سَهْوَهُ فَأَتَمَّهُ فَلَيْسَ عَلَيْهِ سَجْدَتَا السَّهْوِ فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) صَلَّى بِالنَّاسِ الظُّهْرَ رَكْعَتَيْنِ ثُمَّ سَهَا فَسَلَّمَ فَقَالَ لَهُ ذُو الشِّمَالَيْنِ يَا رَسُولَ اللَّهِ أَ نَزَلَ فِي الصَّلَاةِ شَيْ‏ءٌ فَقَالَ وَ مَا ذَاكَ قَالَ إِنَّمَا صَلَّيْتَ رَكْعَتَيْنِ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَ تَقُولُونَ مِثْلَ قَوْلِهِ قَالُوا نَعَمْ فَقَامَ ( صلى الله عليه وآله ) فَأَتَمَّ بِهِمُ الصَّلَاةَ وَ سَجَدَ بِهِمْ سَجْدَتَيِ السَّهْوِ \nقَالَ قُلْتُ أَ رَأَيْتَ مَنْ صَلَّى رَكْعَتَيْنِ وَ ظَنَّ أَنَّهُمَا أَرْبَعٌ فَسَلَّمَ وَ انْصَرَفَ ثُمَّ ذَكَرَ بَعْدَ مَا ذَهَبَ أَنَّهُ إِنَّمَا صَلَّى رَكْعَتَيْنِ قَالَ يَسْتَقْبِلُ الصَّلَاةَ مِنْ أَوَّلِهَا \nقَالَ قُلْتُ فَمَا بَالُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) لَمْ يَسْتَقْبِلِ الصَّلَاةَ وَ إِنَّمَا أَتَمَّ بِهِمْ مَا بَقِيَ مِنْ صَلَاتِهِ فَقَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) لَمْ يَبْرَحْ مِنْ مَجْلِسِهِ فَإِنْ كَانَ لَمْ يَبْرَحْ مِنْ مَجْلِسِهِ فَلْيُتِمَّ مَا نَقَصَ مِنْ صَلَاتِهِ إِذَا كَانَ قَدْ حَفِظَ الرَّكْعَتَيْنِ الْأَوَّلَتَيْنِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Usman Bin Isa, from Sama’at Bin Mihran who said, \n‘Abu Abdullah<sup>asws</sup> said: ‘The one who safeguards his omission and he completes, so upon him are the two <span class=\"iTxt\">Sujūd </span>for the omission (<span class=\"iTxt\">Sajda Al-Sah’w</span>), for Rasool-Allah<sup>saww</sup> prayed Al-Zohr <span class=\"iTxt\">Salāt</span> with the people as two <span class=\"iTxt\">Rak’at</span>, then omitted, so he<sup>saww</sup> offered <span style=\"font-style: italic; text-decoration: underline\">Salām</span>. So Zul-Shimalayn said to him<sup>saww</sup>, ‘O Rasool-Allah<sup>saww</sup>! Has anything (new) been Revealed with regards to the <span class=\"iTxt\">Salāt</span>?’ So he<sup>saww</sup> said: ‘And what is that?’ He said, ‘But rather you<sup>saww</sup> prayed two <span class=\"iTxt\">Rak’at</span>’. So Rasool-Allah<sup>saww</sup> said: ‘Are you all saying the like of his words?’ They said, ‘Yes’. So he<sup>saww</sup> completed the <span class=\"iTxt\">Salāt</span> with them and perform <span class=\"iTxt\">Sajdah</span> with them the two <span class=\"iTxt\">Sajdah</span>s of omission’.\nHe (the narrator) said, ‘I said, ‘What is your<sup>asws</sup> view of the one who prays two <span class=\"iTxt\">Rak’at</span> and thinks that these two were four, so he greets and leaves. Then he remembers after having gone then he (remembers), rather, had prayed two <span class=\"iTxt\">Rak’at</span>?’ He<sup>asws</sup> said: ‘He should re-commence the <span class=\"iTxt\">Salāt</span> from its beginning’. \nHe (the narrator) said, ‘I said, ‘So what was the matter Rasool-Allah<sup>saww</sup> did not re-commence the <span class=\"iTxt\">Salāt</span>, and rather he<sup>saww</sup> completed it with them what had remained from his<sup>saww</sup> <span class=\"iTxt\">Salāt</span>?’ So he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> had not departed from his<sup>saww</sup> seat. So if he had not departed from his seating, then let him complete what was deficient from his <span class=\"iTxt\">Salāt</span>, when it was so that he had safeguarded the first to <span class=\"iTxt\">Rak’at</span>’."}]}, {"index": 5156, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:4:42:2", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ فِي الرَّجُلِ يُصَلِّي رَكْعَتَيْنِ مِنَ الْمَكْتُوبَةِ ثُمَّ يَنْسَى فَيَقُومُ قَبْلَ أَنْ يَجْلِسَ بَيْنَهُمَا قَالَ فَلْيَجْلِسْ مَا لَمْ يَرْكَعْ وَ قَدْ تَمَّتْ صَلَاتُهُ فَإِنْ لَمْ يَذْكُرْ حَتَّى يَرْكَعَ فَلْيَمْضِ فِي صَلَاتِهِ فَإِذَا سَلَّمَ سَجَدَ سَجْدَتَيْنِ وَ هُوَ جَالِسٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Al Fuzayl Bin Yasaar, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said regarding the man who prays two <span class=\"iTxt\">Rak’at</span> from the Prescribed ones, then he forgets, so he stands before he had seated between the two. He<sup>asws</sup> said: ‘So let him sit for as long as he has not performed Rukū, and he would have completed his <span class=\"iTxt\">Salāt</span>. So if he does not remember until he performs <span class=\"iTxt\">Rukū</span>, so let him accomplish his <span class=\"iTxt\">Salāt</span>. So when he has offered <span class=\"iTxt\">Salām</span>, he should perform <span class=\"iTxt\">Sajdah</span> the two <span class=\"iTxt\">Sujūd </span>(of omission) while he is seated’."}]}, {"index": 5157, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:4:42:3", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ مَنْصُورِ بْنِ الْعَبَّاسِ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنِ الْحَسَنِ بْنِ صَدَقَةَ قَالَ قُلْتُ لِأَبِي الْحَسَنِ الْأَوَّلِ ( عليه السلام ) أَ سَلَّمَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فِي الرَّكْعَتَيْنِ الْأَوَّلَتَيْنِ فَقَالَ نَعَمْ قُلْتُ وَ حَالُهُ حَالُهُ قَالَ إِنَّمَا أَرَادَ اللَّهُ عَزَّ وَ جَلَّ أَنْ يُفَقِّهَهُمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Al Barqy, from Mansour Bin Al Abbas, from Amro Bin Saeed, from Al Hassan Bin Sadaqa who said, \n‘I said to Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup>, ‘Did Rasool-Allah<sup>saww</sup> offered <span style=\"font-style: italic; text-decoration: underline\">Salām</span> in the first two <span class=\"iTxt\">Rak’at</span>?’ So he<sup>asws</sup> said: ‘Yes’. I said, ‘And his<sup>saww</sup> state was what it was?’ He<sup>asws</sup> said: ‘But rather Allah<sup>azwj</sup> Mighty and Majestic Wanted them to understand’."}]}, {"index": 5158, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:3:4:42:4", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَتَكَلَّمُ نَاسِياً فِي الصَّلَاةِ يَقُولُ أَقِيمُوا صُفُوفَكُمْ فَقَالَ يُتِمُّ صَلَاتَهُ ثُمَّ يَسْجُدُ سَجْدَتَيْنِ فَقُلْتُ سَجْدَتَا السَّهْوِ قَبْلَ التَّسْلِيمِ هُمَا أَوْ بَعْدُ قَالَ بَعْدُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Safwan Bin Yahya, from Abdul Rajman Bin Al Hajjaj who said, \n‘I asked Abu Abdullah<sup>asws</sup> about the man who talks forgetfully during the <span class=\"iTxt\">Salāt</span> saying, ‘Straighten your rows!’ So he<sup>asws</sup> said: ‘He should complete his <span class=\"iTxt\">Salāt</span>, then he should perform <span class=\"iTxt\">Sajdah</span> with two <span class=\"iTxt\">Sujūd</span>’. So I said, ‘The two <span class=\"iTxt\">Sujūd</span> for the omission, are these two before or after the offering <span class=\"iTxt\">Salām</span>?’ He<sup>asws</sup> said: ‘After’."}]}, {"index": 5159, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:3:4:42:5", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تَقُولُ فِي سَجْدَتَيِ السَّهْوِ \nبِسْمِ اللَّهِ وَ بِاللَّهِ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ\nقَالَ الْحَلَبِيُّ وَ سَمِعْتُهُ مَرَّةً أُخْرَى يَقُولُ.\nبِسْمِ اللَّهِ وَ بِاللَّهِ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘You should be saying in the two <span class=\"iTxt\">Sujūd</span> for the omission, \n‘In the Name of Allah<sup>azwj</sup>, and by Allah<sup>azwj</sup>. O Allah<sup>azwj</sup>! Send Blessings upon Muhammad and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>’. \nAl-Halby said, ‘And I heard him another times saying, \n‘In the Name of Allah<sup>azwj</sup>, and by Allah<sup>azwj</sup>. Greetings be upon you O Prophet<sup>saww</sup>, and the Mercy of Allah<sup>azwj</sup> and His<sup>azwj</sup> Blessings’."}]}, {"index": 5160, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:3:4:42:6", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ سَعِيدٍ الْأَعْرَجِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ صَلَّى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) ثُمَّ سَلَّمَ فِي رَكْعَتَيْنِ فَسَأَلَهُ مَنْ خَلْفَهُ يَا رَسُولَ اللَّهِ أَ حَدَثَ فِي الصَّلَاةِ شَيْ‏ءٌ قَالَ وَ مَا ذَلِكَ قَالُوا إِنَّمَا صَلَّيْتَ رَكْعَتَيْنِ فَقَالَ أَ كَذَلِكَ يَا ذَا الْيَدَيْنِ وَ كَانَ يُدْعَى ذَا الشِّمَالَيْنِ فَقَالَ نَعَمْ فَبَنَى عَلَى صَلَاتِهِ فَأَتَمَّ الصَّلَاةَ أَرْبَعاً.\nوَ قَالَ إِنَّ اللَّهَ هُوَ الَّذِي أَنْسَاهُ رَحْمَةً لِلْأُمَّةِ أَ لَا تَرَى لَوْ أَنَّ رَجُلًا صَنَعَ هَذَا لَعُيِّرَ وَ قِيلَ مَا تُقْبَلُ صَلَاتُكَ فَمَنْ دَخَلَ عَلَيْهِ الْيَوْمَ ذَاكَ قَالَ قَدْ سَنَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ صَارَتْ أُسْوَةً وَ سَجَدَ سَجْدَتَيْنِ لِمَكَانِ الْكَلَامِ", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Nu’man, from Saeed Al A’araj who said, \n‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Send Blessings upon Rasool-Allah<sup>azwj</sup>, then offer <span class=\"iTxt\">Salām</span> in the two <span class=\"iTxt\">Rak’at</span>. So the one behind him<sup>saww</sup> asked him<sup>saww</sup>, ‘O Rasool-Allah<sup>saww</sup>! Did something new occurred regarding the <span class=\"iTxt\">Salāt</span>?’ He<sup>saww</sup> said: ‘And what is that?’ They said, ‘But rather you<sup>saww</sup> prayed two <span class=\"iTxt\">Rak’at</span>’. So he<sup>saww</sup> said: ‘Was it like that, O Zal Yadaeyn?’ And he used to be called Zal Shimaleyn. So he said, ‘Yes’. So he<sup>saww</sup> built upon his<sup>saww</sup> <span class=\"iTxt\">Salāt</span>, and completed the <span class=\"iTxt\">Salāt</span> with four (<span class=\"iTxt\">Rak’at</span>)’.  \nAnd he<sup>asws</sup> said: ‘Allah<sup>azwj</sup>, He<sup>azwj</sup> is the One<sup>azwj</sup> Who Cause him<sup>saww</sup> to omit as a Mercy for the community. Do you not see that if a man were to do this he would be faulted and it would be said, ‘Your <span class=\"iTxt\">Salāt</span> is not Acceptable’? So the one upon whom that enters, it would be said, ‘Rasool-Allah<sup>saww</sup> had established a Sunnah and has become an example, and perform <span class=\"iTxt\">Sajdah</span> two <span class=\"iTxt\">Sujūd</span> in place of the speech (for talking)’."}]}, {"index": 5161, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:3:4:42:7", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا قُمْتَ فِي الرَّكْعَتَيْنِ الْأَوَّلَتَيْنِ وَ لَمْ تَتَشَهَّدْ فَذَكَرْتَ قَبْلَ أَنْ تَرْكَعَ فَاقْعُدْ فَتَشَهَّدْ وَ إِنْ لَمْ تَذْكُرْ حَتَّى تَرْكَعَ فَامْضِ فِي صَلَاتِكَ كَمَا أَنْتَ فَإِذَا انْصَرَفْتَ سَجَدْتَ سَجْدَتَيْنِ لَا رُكُوعَ فِيهِمَا ثُمَّ تَشَهَّدِ التَّشَهُّدَ الَّذِي فَاتَكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad, from Ali Bin Abu Hamza who said, \n‘Abu Abdullah<sup>asws</sup> said: ‘When you stand during the first to <span class=\"iTxt\">Rak’at</span> and do not perform <span class=\"iTxt\">Tashahhud</span>, so you remember it before you perform <span class=\"iTxt\">Rukū</span>, then sit down and perform <span class=\"iTxt\">Tashahhud</span>; and if you do not remember until (after) you have Rukū, so continue in your <span class=\"iTxt\">Salāt</span> just as you were. So when you complete, perform <span class=\"iTxt\">Sajdah</span> two <span class=\"iTxt\">Sujūd</span> there not being any <span class=\"iTxt\">Rukū</span> in these two, then perform <span class=\"iTxt\">Tashahhud</span> which you missed out on’."}]}, {"index": 5162, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:3:4:42:8", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا قُمْتَ فِي الرَّكْعَتَيْنِ مِنَ الظُّهْرِ أَوْ غَيْرِهِمَا وَ لَمْ تَتَشَهَّدْ فِيهِمَا فَذَكَرْتَ ذَلِكَ فِي الرَّكْعَةِ الثَّالِثَةِ قَبْلَ أَنْ تَرْكَعَ فَاجْلِسْ فَتَشَهَّدْ وَ قُمْ فَأَتِمَّ صَلَاتَكَ فَإِنْ أَنْتَ لَمْ تَذْكُرْ حَتَّى تَرْكَعَ فَامْضِ فِي صَلَاتِكَ حَتَّى تَفْرُغَ فَإِذَا فَرَغْتَ فَاسْجُدْ سَجْدَتَيِ السَّهْوِ بَعْدَ التَّسْلِيمِ قَبْلَ أَنْ تَتَكَلَّمَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad Bin Usman, from Al Halby, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When you stand in the two <span class=\"iTxt\">Rak’at</span> from Al Zohr (<span class=\"iTxt\">Salāt</span>) or other than these two and do not perform <span class=\"iTxt\">Tashahhud</span>, and you remember that in the third <span class=\"iTxt\">Rak’at</span> before you perform <span class=\"iTxt\">Rukū</span>, so sit down and perform <span class=\"iTxt\">Tashahhud</span>, and stand to complete your <span class=\"iTxt\">Salāt</span>. So if you do not remember until you have Rukū, so continue in your <span class=\"iTxt\">Salāt</span> until you are free. So when you are free, then perform <span class=\"iTxt\">Sajdah</span> two <span class=\"iTxt\">Sujūd</span> for the omission after the greeting, before you speak (say anything else)’."}]}, {"index": 5163, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:3:4:42:9", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يَسْهُو فَيَقُومُ فِي حَالِ قُعُودٍ أَوْ يَقْعُدُ فِي حَالِ قِيَامٍ قَالَ يَسْجُدُ سَجْدَتَيْنِ بَعْدَ التَّسْلِيمِ وَ هُمَا الْمُرْغِمَتَانِ تُرْغِمَانِ الشَّيْطَانَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunuys, from Muawiya Bin Ammar who said, \n‘I asked him<sup>asws</sup> about the man who errs so he stands during a state of sitting or sits during a state of standing. He<sup>asws</sup> said: ‘He should perform <span class=\"iTxt\">Sajdah</span> two <span class=\"iTxt\">Sujūd</span> after the offering <span class=\"iTxt\">Salām</span>, and these two are the two constrainers, they constrain the Satan<sup>la</sup>’."}]}]}, "index": "al-kafi:3:4:42", "kind": "verse_list"}