{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 44"
        },
        "path": "/books/al-kafi:3:4:44",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب مَا يُقْبَلُ مِنْ</span> صَلَاةِ السَّاهِي",
          "en": "Chapter 44 – What is Acceptable from the Salāt of an omitter"
        }
      }
    ],
    "index": 711,
    "local_index": 44,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 45"
        },
        "path": "/books/al-kafi:3:4:45",
        "titles": {
          "ar": "باب مَا يَقْطَعُ الصَّلَاةَ مِنَ الضَّحِكِ وَ الْحَدَثِ وَ الْإِشَارَةِ وَ النِّسْيَانِ وَ غَيْرِ ذَلِكَ",
          "en": "Chapter 45 – What cuts off the Salāt, from the laugh, and the breaking of the ablution, and the gesture, and the forgetfulness, and other than that"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 43"
        },
        "path": "/books/al-kafi:3:4:43",
        "titles": {
          "ar": "باب مَنْ شَكَّ فِي صَلَاتِهِ كُلِّهَا وَ لَمْ يَدْرِ زَادَ أَوْ نَقَصَ وَ مَنْ كَثُرَ عَلَيْهِ السَّهْوُ وَ السَّهْوِ فِي النَّافِلَةِ وَ سَهْوِ الْإِمَامِ وَ مَنْ خَلْفَهُ",
          "en": "Chapter 43 – The one who doubts in his Salāt, all of it, and does not know whether he has increased or reduced, and the one upon whom the omissions are numerous, and the omissions in the optional (Salāts), and the omission of the prayer leader, and the one behind him"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:4:44",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب مَا يُقْبَلُ مِنْ</span> صَلَاةِ السَّاهِي",
      "en": "Chapter 44 – What is Acceptable from the Salāt of an omitter"
    },
    "verse_count": 5,
    "verse_start_index": 5172,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/233)"
        ],
        "index": 5173,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:44:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ عَمَّاراً السَّابَاطِيَّ رَوَى عَنْكَ رِوَايَةً قَالَ وَ مَا هِيَ قُلْتُ رَوَى أَنَّ السُّنَّةَ فَرِيضَةٌ فَقَالَ أَيْنَ يَذْهَبُ أَيْنَ يَذْهَبُ لَيْسَ هَكَذَا حَدَّثْتُهُ إِنَّمَا قُلْتُ لَهُ مَنْ صَلَّى فَأَقْبَلَ عَلَى صَلَاتِهِ لَمْ يُحَدِّثْ نَفْسَهُ فِيهَا أَوْ لَمْ يَسْهُ فِيهَا أَقْبَلَ اللَّهُ عَلَيْهِ مَا أَقْبَلَ عَلَيْهَا فَرُبَّمَا رُفِعَ نِصْفُهَا أَوْ رُبُعُهَا أَوْ ثُلُثُهَا أَوْ خُمُسُهَا وَ إِنَّمَا أَمَرْنَا بِالسُّنَّةِ لِيَكْمُلَ بِهَا مَا ذَهَبَ مِنَ الْمَكْتُوبَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Hisham Bin Salim, from Muhammad Bin Muslim who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Ammar Al-Sabaty reported from you<sup>asws</sup> a report’. He<sup>asws</sup> said: ‘And what is it?’ I said, ‘He reported that the <span class=\"iTxt\">Sunnah</span> is a necessity’. So he<sup>asws</sup> said: ‘Where is he going? Where is he going? It is not like this. I<sup>asws</sup> narrated to him, rather I<sup>asws</sup> said to him: ‘The one who prays and is devoted upon his <span class=\"iTxt\">Salāt</span>, not discussing with himself therein, or does not omit (anything) therein, Allah<sup>azwj</sup> would Devote upon him what he devoted upon it. So, sometimes a half of it is Raised, or a quarter of it, or a third of it, or a fifth of it, and rather we<sup>asws</sup> are ordering with the <span class=\"iTxt\">Sunnah</span> for it (the Sunnah <span style=\"font-style: italic; text-decoration: underline\">Salāt</span>) to (make it) perfect by it what had gone (deficient) from the Obligatory (<span class=\"iTxt\">Salāt</span>)’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from Hisham ibn Salim from Muhammad ibn Muslim who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, \"Ammar al-Sabatiy has narrated from you a Hadith.’ He (the Imam) asked, ‘What Hadith is it? 5 I then said, ‘He narrates that Sunnah is obligatory.’ He (the Imam) said, ‘Where does he go! Where does he go! I did not speak to him as such. I only said to him that when performing Salah (prayer) if one is attentive toward it, does not speak to one’s soul in it and does not make mistakes in it, Allah comes forward eagerly to what is performed eagerly. Perhaps one half is raised, one fourth, one third or one fifth is raised. We command to perform Sunnah only to complete what is missed of obligatory ones.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/234)"
        ],
        "index": 5174,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:44:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ الْعَبْدَ لَيُرْفَعُ لَهُ مِنْ صَلَاتِهِ نِصْفُهَا أَوْ ثُلُثُهَا أَوْ رُبُعُهَا أَوْ خُمُسُهَا فَمَا يُرْفَعُ لَهُ إِلَّا مَا أَقْبَلَ عَلَيْهِ بِقَلْبِهِ وَ إِنَّمَا أَمَرْنَا بِالنَّافِلَةِ لِيَتِمَّ لَهُمْ بِهَا مَا نَقَصُوا مِنَ الْفَرِيضَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Hisham Bin Salim, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The servant, there is Raised for him from his <span class=\"iTxt\">Salāt</span>, a half of it, or a third of it, or a quarter of it, of a fifth of it. So it is not Raised for him except for what he is devoted upon it with his heart, and rather, we<sup>asws</sup> are ordering with the optional (<span class=\"iTxt\">Salāt</span>) in order to complete for them by it, whatever was deficient from the Obligatory (<span class=\"iTxt\">Salāt</span>)’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn abu ‘Umayr Hisham ibn Salim from Muhammad ibn Muslim who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘Of Salah (prayer) of a servant (of Allah) sometimes one-half, sometimes one-third, one-fourth or one-fifth is raised. Whatever is raised is only what one has performed with love from his heart. We only command to perform optional Salah (prayer) to complete what it is cut short of obligatory ones.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/234)"
        ],
        "index": 5175,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:44:3",
        "text": [
          "وَ عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ رَجُلٌ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا أَسْمَعُ جُعِلْتُ فِدَاكَ إِنِّي كَثِيرُ السَّهْوِ فِي الصَّلَاةِ فَقَالَ وَ هَلْ يَسْلَمُ مِنْهُ أَحَدٌ فَقُلْتُ مَا أَظُنُّ أَحَداً أَكْثَرَ سَهْواً مِنِّي فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا أَبَا مُحَمَّدٍ إِنَّ الْعَبْدَ يُرْفَعُ لَهُ ثُلُثُ صَلَاتِهِ وَ نِصْفُهَا وَ ثَلَاثَةُ أَرْبَاعِهَا وَ أَقَلُّ وَ أَكْثَرُ عَلَى قَدْرِ سَهْوِهِ فِيهَا لَكِنَّهُ يَتِمُّ لَهُ مِنَ النَّوَافِلِ قَالَ فَقَالَ لَهُ أَبُو بَصِيرٍ مَا أَرَى النَّوَافِلَ يَنْبَغِي أَنْ تُتْرَكَ عَلَى حَالٍ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَجَلْ لَا ."
        ],
        "translations": {
          "en.hubeali": [
            "And frm him, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad, from Ali Bin Abu Hamza, from Abu Baseer who said, ",
            "‘A man said to Abu Abdullah<sup>asws</sup>, and I heard, ‘May I be sacrificed for you<sup>asws</sup>! I frequently make mistakes in the <span class=\"iTxt\">Salāt</span>’. So he<sup>asws</sup> said: ‘And has there anyone ever been safe from it?’ So he said, ‘I don’t think anyone would have more mistakes than me’. So Abu Abdullah<sup>asws</sup> said to him: ‘O Abu Muhammad! The servant, there is Raised for him a third of his <span class=\"iTxt\">Salāt</span>, and a half of it, and three-quarters of it, and less, and more, upon a measurement of his omission therein, but it is completed for him (when he offers) the optional (<span class=\"iTxt\">Salāt</span>)’. So Abu Baseer said to him<sup>asws</sup>, ‘I do not see that the optional (<span class=\"iTxt\">Salāt</span>) should be left upon any state’. So he<sup>asws</sup> said: ‘Yes, it should not’."
          ],
          "en.sarwar": [
            "3. It is a narration from him (narrator of previous Hadith) by Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Qasim ibn Muhammad from Ali ibn abu Hamzah from abu Basir from who has said the following: “Once, when I was present, a man said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘I pray to Allah to keep my soul in service for your cause, I make a great number of mistakes in my Salah (prayer).’ He (the Imam) said, ‘Has anyone remained safe thereby?’ I (the narrator) then said, ‘I think no one makes as many mistakes as I do.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, then said to him, ‘O abu Muhammad, sometimes of Salah (prayer) of a servant (of Allah) one-third is raised, sometimes one-half or three- fourth or less or more depending upon the quantity of one’s mistakes in that Salah (prayer). However, it is completed with his optional Salah (prayer).’ Abu Basir then said to him (the Imam), ‘I think, optional Salah (prayer) should not be omitted in any condition.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, then said, ‘Yes, it should not be omitted.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/235)"
        ],
        "index": 5176,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:44:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُمَا قَالَا إِنَّمَا لَكَ مِنْ صَلَاتِكَ مَا أَقْبَلْتَ عَلَيْهِ مِنْهَا فَإِنْ أَوْهَمَهَا كُلَّهَا أَوْ غَفَلَ عَنْ أَدَائِهَا لُفَّتْ فَضُرِبَ بِهَا وَجْهُ صَاحِبِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether, from Hammad Bin Isa, from Hareyz, from Al Fazeyl Bin Yasaar, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup>, both having said: ‘But rather, for you, from your <span class=\"iTxt\">Salāt</span> is what you a devoted upon it, from it. So if all of it is (full of) imagination, or oblivion from its execution, it is diverted and its performer is struck with it upon his face’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father and Muhammad ibn ’Isma‘il from al-Fadl ibn Shadhan all from Hammad ibn ‘Isa from Hariz from Fudayl ibn Yasar who has said the following: “Abu Ja‘far, and abu ‘Abd Allah, ‘Alayhim al-Salam, have said, ‘Of your Salah (prayer) only that much is for you which you have performed with love. If one instills delusion in Salah (prayer) or omits it altogether, then such Salah (prayer) is rolled up and is struck against the face of its owner.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/235)"
        ],
        "index": 5177,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:44:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ قَالَ فِي كِتَابِ حَرِيزٍ أَنَّهُ قَالَ إِنِّي نَسِيتُ أَنِّي فِي صَلَاةٍ فَرِيضَةٍ حَتَّى رَكَعْتُ وَ أَنَا أَنْوِيهَا تَطَوُّعاً قَالَ فَقَالَ هِيَ الَّتِي قُمْتَ فِيهَا إِنْ كُنْتَ قُمْتَ وَ أَنْتَ تَنْوِي فَرِيضَةً ثُمَّ دَخَلَكَ الشَّكُّ فَأَنْتَ فِي الْفَرِيضَةِ وَ إِنْ كُنْتَ دَخَلْتَ فِي نَافِلَةٍ فَنَوَيْتَهَا فَرِيضَةً فَأَنْتَ فِي النَّافِلَةِ وَ إِنْ كُنْتَ دَخَلْتَ فِي فَرِيضَةٍ ثُمَّ ذَكَرْتَ نَافِلَةً كَانَتْ عَلَيْكَ فَامْضِ فِي الْفَرِيضَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira who said, ",
            "‘In the book of Hareyz (a narrator), he said: ‘I forgot I was in an Obligatory <span class=\"iTxt\">Salāt</span> until I performed Rukū, and I had intended it as a voluntary (<span class=\"iTxt\">Salāt</span>). So he<sup>asws</sup> said: ‘It is that which you had stood for (with the intention). If you had stood and intended an Obligatory (<span class=\"iTxt\">Salāt</span>), then the doubt entered, so you would be in the Obligatory (<span class=\"iTxt\">Salāt</span>), but if you had entered into an optional (<span class=\"iTxt\">Salāt</span>), so you intended it (afterwards) as an Obligatory (<span class=\"iTxt\">Salāt</span>), so you would (still) being offering the optional (<span class=\"iTxt\">Salāt</span>); and if you had entered into an Obligatory (<span class=\"iTxt\">Salāt</span>), then remembered an optional (<span class=\"iTxt\">Salāt</span>) which was (due) upon you, so continue in the Obligatory (<span class=\"iTxt\">Salāt</span>)’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ‘Abd Allah ibn al-Mughirah who has said the following: “It is in the book of Hariz who has said that once I forgot about my being in obligatory Salah (prayer) until Ruku‘ (bowing down on one’s knees). Can I make my intention for it to be an optional Salah (prayer)? He (the Imam), ‘Alayhi al-Salam, said, ‘It is what you had stood up for. If you stood up to perform an obligatory Salah (prayer) then doubts entered, you are still in obligatory Salah (prayer). If you stood up for optional Salah (prayer) then made your intention for obligatory Salah (prayer), you were still in optional Salah (prayer). If you stood up for obligatory then you remembered optional Salah (prayer) which was due, you were to complete it as obligatory.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:4:44",
  "kind": "verse_list"
}