{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:3:4", "titles": {"ar": "كِتَابُ الصَّلَاةِ", "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "}}, {"indexed_titles": {"en": "Chapter 50"}, "path": "/books/al-kafi:3:4:50", "titles": {"ar": "باب الصَّلَاةِ خَلْفَ مَنْ لَا يُقْتَدَى بِهِ", "en": "Chapter 50 – The Salāt behind the one whom one does not follow with Non-Shias)"}}], "index": 717, "local_index": 50, "part_type": "Chapter", "path": "/books/al-kafi:3:4:50", "titles": {"ar": "باب الصَّلَاةِ خَلْفَ مَنْ لَا يُقْتَدَى بِهِ", "en": "Chapter 50 – The Salāt behind the one whom one does not follow with Non-Shias)"}, "verse_count": 7, "verse_start_index": 5222, "verses": [{"index": 5223, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:4:50:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> الْعَطَّارُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَكُونُ مَعَ الْإِمَامِ فَأَفْرُغُ مِنَ الْقِرَاءَةِ قَبْلَ أَنْ يَفْرُغَ قَالَ أَبْقِ آيَةً وَ مَجِّدِ اللَّهَ وَ أَثْنِ عَلَيْهِ فَإِذَا فَرَغَ فَاقْرَأِ الْآيَةَ وَ ارْكَعْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya Al Attar, from Ahmad Bin Muhammad, from Al Hassan Bin Ali Bin Fazzal, from Ibn Bukeyr, from Zurara who said \n‘I said to Abu Abdullah<sup>asws</sup>, ‘I happen to be with the Imam, and I am free from the recitation before he is free (from it)’. He<sup>asws</sup> said: ‘Withhold a Verse and Glorify Allah<sup>azwj</sup> and Laud upon Him<sup>azwj</sup>. So when he is free, recite the Verse and perform <span class=\"iTxt\">Rukū</span>’."}]}, {"index": 5224, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:4:50:2", "text": "عَنْهُ عَنْ أَحْمَدَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ الْحَجَّالِ عَنْ ثَعْلَبَةَ عَنْ زُرَارَةَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الصَّلَاةِ خَلْفَ الْمُخَالِفِينَ فَقَالَ مَا هُمْ عِنْدِي إِلَّا بِمَنْزِلَةِ الْجُدُرِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Ahmad, from Abdullah Bin Muhammad Al Hajjal, from Sa’alba, from Zurara who said, \n‘I asked Abu Ja’far<sup>asws</sup> about the <span class=\"iTxt\">Salāt</span> behind the adversaries. So he<sup>asws</sup> said: ‘They are not in my<sup>asws</sup> presence except at the status of the walls (bunch of bricks)’."}]}, {"index": 5225, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:4:50:3", "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَمَّنْ سَأَلَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أُصَلِّي خَلْفَ مَنْ لَا أَقْتَدِي بِهِ فَإِذَا فَرَغْتُ مِنْ قِرَاءَتِي وَ لَمْ يَفْرُغْ هُوَ قَالَ فَسَبِّحْ حَتَّى يَفْرُغَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Safwan, from Is’haq Bin Ammar, \n(It has been narrated) from the one who asked Abu Abdullah<sup>asws</sup>, said, ‘I pray <span class=\"iTxt\">Salāt</span> behind the one I do not follow with (Non-Shia), so then I tend to be free from my recitation and he is not free (from it)’. He<sup>asws</sup> said: ‘So Glorify until he is free (from the recitation)’."}]}, {"index": 5226, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:3:4:50:4", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا صَلَّيْتَ خَلْفَ إِمَامٍ لَا تَقْتَدِي بِهِ فَاقْرَأْ خَلْفَهُ سَمِعْتَ قِرَاءَتَهُ أَوْ لَمْ تَسْمَعْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad Bin Usman, from Al Halby, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When you pray a <span class=\"iTxt\">Salāt</span> behind a Imam you do not follow with (a Non-Shia), so recite behind him, whether you can hear his recitation or cannot hear it’."}]}, {"index": 5227, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:3:4:50:5", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنْ أَبِي عَلِيِّ بْنِ رَاشِدٍ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) إِنَّ مَوَالِيَكَ قَدِ اخْتَلَفُوا فَأُصَلِّي خَلْفَهُمْ جَمِيعاً فَقَالَ لَا تُصَلِّ إِلَّا خَلْفَ مَنْ تَثِقُ بِدِينِهِ \nثُمَّ قَالَ وَ لِي مَوَالٍ فَقُلْتُ أَصْحَابٌ فَقَالَ مُبَادِراً قَبْلَ أَنْ أَسْتَتِمَّ ذِكْرَهُمْ لَا يَأْمُرُكَ عَلِيُّ بْنُ حَدِيدٍ بِهَذَا أَوْ هَذَا مِمَّا يَأْمُرُكَ بِهِ عَلِيُّ بْنُ حَدِيدٍ فَقُلْتُ نَعَمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Sahl Bin Ziyad, from Ali Bin Mahziyar, from Abu Ali Bin Rashid who said, \n‘I said to Abu Ja’far<sup>asws</sup>, ‘The ones in your<sup>asws</sup> Wilayah are differing, so can I pray <span class=\"iTxt\">Salāt</span> behind them all?’ So he<sup>asws</sup> said: ‘Do not pray <span class=\"iTxt\">Salāt</span> except behind the one whom you trust in his Religion’. \nThen he<sup>asws</sup> said: ‘And for me<sup>asws</sup> there are ones in the Wilayah’. So I said, ‘Companions?’ So he<sup>asws</sup> said initiating, before I completed their mention: ‘No. Did Ali Bin Hadeed instruct you with this, or is this from what you have been instructed by Ali Bin Hadeed?’ So I said, ‘Yes’."}]}, {"index": 5228, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:3:4:50:6", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ زُرَارَةَ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) إِنَّ أُنَاساً رَوَوْا عَنْ أَمِيرِ الْمُؤْمِنِينَ ( صلوات الله عليه ) أَنَّهُ صَلَّى أَرْبَعَ رَكَعَاتٍ بَعْدَ الْجُمُعَةِ لَمْ يَفْصِلْ بَيْنَهُنَّ بِتَسْلِيمٍ فَقَالَ يَا زُرَارَةُ إِنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) صَلَّى خَلْفَ فَاسِقٍ فَلَمَّا سَلَّمَ وَ انْصَرَفَ قَامَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) فَصَلَّى أَرْبَعَ رَكَعَاتٍ لَمْ يَفْصِلْ بَيْنَهُنَّ بِتَسْلِيمٍ فَقَالَ لَهُ رَجُلٌ إِلَى جَنْبِهِ يَا أَبَا الْحَسَنِ صَلَّيْتَ أَرْبَعَ رَكَعَاتٍ لَمْ تَفْصِلْ بَيْنَهُنَّ فَقَالَ إِنَّهَا أَرْبَعُ رَكَعَاتٍ مُشَبَّهَاتٍ وَ سَكَتَ فَوَ اللَّهِ مَا عَقَلَ مَا قَالَ لَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Hammad, from Hareyz, from Zurara who said, \n‘I said to Abu Ja’far<sup>asws</sup>, ‘The people are reporting from Amir Al-Momineen<sup>asws</sup> that he<sup>asws</sup> prayed a <span class=\"iTxt\">Salāt</span> of two <span class=\"iTxt\">Rak’at</span> after the Friday (<span class=\"iTxt\">Salāt</span>), not keeping a gap between the two with the <span class=\"iTxt\">Salām</span>’. So he<sup>asws</sup> said: ‘O Zurara! Amir Al-Momineen<sup>asws</sup> prayed <span class=\"iTxt\">Salāt</span> behind an immoral one. So when he greeted (<span class=\"iTxt\">Salām</span>) and finished, Amir Al-Momineen<sup>asws</sup> stood and prayed two <span class=\"iTxt\">Rak’at</span>, not keeping a gap between them with the <span class=\"iTxt\">Salām</span>. So a man by his<sup>asws</sup> side said to him<sup>asws</sup>, ‘O Abu Al-Hasan<sup>asws</sup>! You<sup>asws</sup> prayed four <span class=\"iTxt\">Rak’at</span>, not keeping a gap between them’. So he<sup>asws</sup> said: ‘These four <span class=\"iTxt\">Rak’at</span> were resemblances’, and remained silent. So, by Allah<sup>azwj</sup>, he (that man) did not understand what he<sup>asws</sup> said to him’."}]}, {"index": 5229, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:3:4:50:7", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ حُمْرَانَ بْنِ أَعْيَنَ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) جُعِلْتُ فِدَاكَ إِنَّا نُصَلِّي مَعَ هَؤُلَاءِ يَوْمَ الْجُمُعَةِ وَ هُمْ يُصَلُّونَ فِي الْوَقْتِ فَكَيْفَ نَصْنَعُ فَقَالَ صَلُّوا مَعَهُمْ \nفَخَرَجَ حُمْرَانُ إِلَى زُرَارَةَ فَقَالَ لَهُ قَدْ أُمِرْنَا أَنْ نُصَلِّيَ مَعَهُمْ بِصَلَاتِهِمْ فَقَالَ زُرَارَةُ مَا يَكُونُ هَذَا إِلَّا بِتَأْوِيلٍ فَقَالَ لَهُ حُمْرَانُ قُمْ حَتَّى تَسْمَعَ مِنْهُ \nقَالَ فَدَخَلْنَا عَلَيْهِ فَقَالَ لَهُ زُرَارَةُ جُعِلْتُ فِدَاكَ إِنَّ حُمْرَانَ زَعَمَ أَنَّكَ أَمَرْتَنَا أَنْ نُصَلِّيَ مَعَهُمْ فَأَنْكَرْتُ ذَلِكَ فَقَالَ لَنَا كَانَ عَلِيُّ بْنُ الْحُسَيْنِ ( صلوات الله عليه ) يُصَلِّي مَعَهُمُ الرَّكْعَتَيْنِ فَإِذَا فَرَغُوا قَامَ فَأَضَافَ إِلَيْهِمَا رَكْعَتَيْنِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Hadeed, from Jameel Bin Darraj, from Humran Bin Ayn who said, \n‘I said to Abu Ja’far<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! We tend to pray the <span class=\"iTxt\">Salāt</span> with them (general Muslims) on the day of Friday, and they are praying in the time (different to ours). So what should we do?’ So he<sup>asws</sup> said: ‘Pray <span class=\"iTxt\">Salāt</span> with them’. \nSo Humran went out to Zurara and said to him, ‘He<sup>asws</sup> has ordered us that we should pray with them in their <span class=\"iTxt\">Salāts</span>’. So Zurara said, ‘This cannot happen to be except with the explanation’. So Humran said to him, ‘Arise until you hear from him<sup>asws</sup>’. \nHe said, ‘So we went over to him<sup>asws</sup> and Zurara said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Humran claims that you<sup>asws</sup> ordered us that we should be praying <span class=\"iTxt\">Salāt</span> with them (general Muslims), but I denied that’. So he<sup>asws</sup> said to us: ‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> used to pray two <span class=\"iTxt\">Rak’at</span> of <span class=\"iTxt\">Salāt</span> with them. So when they were free, he<sup>asws</sup> would stand and increase two <span class=\"iTxt\">Rak’at</span> upon these’."}]}]}, "index": "al-kafi:3:4:50", "kind": "verse_list"}