{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 60"
        },
        "path": "/books/al-kafi:3:4:60",
        "titles": {
          "ar": "باب اللِّبَاسِ الَّذِي تُكْرَهُ الصَّلَاةُ فِيهِ وَ مَا لَا تُكْرَهُ",
          "en": "Chapter 60 - The clothes in which the Salāt is disliked, and what is not disliked"
        }
      }
    ],
    "index": 727,
    "local_index": 60,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 61"
        },
        "path": "/books/al-kafi:3:4:61",
        "titles": {
          "ar": "باب الرَّجُلِ يُصَلِّي فِي الثَّوْبِ وَ هُوَ غَيْرُ طَاهِرٍ عَالِماً أَوْ جَاهِلًا",
          "en": "Chapter 61 – The man prays Salāt in the clothes and they are without cleanliness, knowingly or unknowingly"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 59"
        },
        "path": "/books/al-kafi:3:4:59",
        "titles": {
          "ar": "باب الصَّلَاةِ فِي ثَوْبٍ وَاحِدٍ وَ الْمَرْأَةِ فِي كَمْ تُصَلِّي وَ صَلَاةِ الْعُرَاةِ وَ التَّوَشُّحِ",
          "en": "Chapter 59 – The Salāt performed in one piece of cloth, and the woman, how many (clothes) can she pray Salāt in, and a Salāt of the naked, and wearing the scarf"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:4:60",
    "titles": {
      "ar": "باب اللِّبَاسِ الَّذِي تُكْرَهُ الصَّلَاةُ فِيهِ وَ مَا لَا تُكْرَهُ",
      "en": "Chapter 60 - The clothes in which the Salāt is disliked, and what is not disliked"
    },
    "verse_count": 35,
    "verse_start_index": 5323,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/308)"
        ],
        "index": 5324,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/249",
              "text": "ابْنِ بُكَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ بُكَيْرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:1",
        "text": [
          " سَأَلَ زُرَارَةُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الصَّلَاةِ فِي الثَّعَالِبِ وَ الْفَنَكِ وَ السِّنْجَابِ وَ غَيْرِهِ مِنَ الْوَبَرِ فَأَخْرَجَ كِتَاباً زَعَمَ أَنَّهُ إِمْلَاءُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) أَنَّ الصَّلَاةَ فِي وَبَرِ كُلِّ شَيْ‏ءٍ حَرَامٍ أَكْلُهُ فَالصَّلَاةُ فِي وَبَرِهِ وَ شَعْرِهِ وَ جِلْدِهِ وَ بَوْلِهِ وَ رَوْثِهِ وَ أَلْبَانِهِ وَ كُلِّ شَيْ‏ءٍ مِنْهُ فَاسِدَةٌ لَا تُقْبَلُ تِلْكَ الصَّلَاةُ حَتَّى تُصَلِّيَ فِي غَيْرِهِ مِمَّا أَحَلَّ اللَّهُ أَكْلَهُ ",
          "ثُمَّ قَالَ يَا زُرَارَةُ هَذَا عَنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَاحْفَظْ ذَلِكَ يَا زُرَارَةُ فَإِنْ كَانَ مِمَّا يُؤْكَلُ لَحْمُهُ فَالصَّلَاةُ فِي وَبَرِهِ وَ بَوْلِهِ وَ شَعْرِهِ وَ رَوْثِهِ وَ أَلْبَانِهِ وَ كُلِّ شَيْ‏ءٍ مِنْهُ جَائِزَةٌ إِذَا عَلِمْتَ أَنَّهُ ذَكِيٌّ قَدْ ذَكَّاهُ الذَّبْحُ فَإِنْ كَانَ غَيْرَ ذَلِكَ مِمَّا قَدْ نُهِيتَ عَنْ أَكْلِهِ وَ حَرُمَ عَلَيْكَ أَكْلُهُ فَالصَّلَاةُ فِي كُلِّ شَيْ‏ءٍ مِنْهُ فَاسِدَةٌ ذَكَّاهُ الذَّبْحُ أَوْ لَمْ يُذَكِّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibn Bukeyr who said, ",
            "‘Zurara asked Abu Abdullah<sup>asws</sup> about the <span class=\"iTxt\">Salāt</span> in the fur of the fox, and the sheep, and the squirrel, and others. So he<sup>asws</sup> took out a letter, saying that it was a dictation of Rasool-Allah<sup>saww</sup> that the <span class=\"iTxt\">Salāt</span> (is prohibited) in the fur of everything the eating of which is Prohibited - so the <span class=\"iTxt\">Salāt</span> in its fur, and its hair, and its skin, and its urine, and its dung, and its milk; and everything from it is a spoiler - that <span class=\"iTxt\">Salāt</span> is not Acceptable until you pray in something else from what Allah<sup>azwj</sup> has Permitted its consumption’. ",
            "Then he<sup>asws</sup> said: ‘O Zurara! This is from Rasool-Allah<sup>saww</sup>, therefore memorise that. O Zurara! So if it was from what its flesh can be eaten, so the <span class=\"iTxt\">Salāt</span> in its fur, and its urine, and its hair, and its dung, and its milk, and everything from it, is allowed, when you know that it is pure, the slaughter having purified it. So if it was other than that from what Allah<sup>azwj</sup> has Forbidden from eating it, and eating it is Prohibited upon you, so the <span class=\"iTxt\">Salāt</span> in everything from it, is a spoiler, whether its slaughter has purified it or not purified it’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ibn Bukayr who has said the following: “Zurarah once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about foxes, fennec and squirrel and so on of hair. He (the Imam) then took out a book that he (the Imam) thought was of the dictations of the Messenger of Allah and it said, ’Salah (prayer) performed with hair of everything of inedible flesh is unlawful. Thus, Salah (prayer) performed with the fur, hair, skin, urine, dung, milk and with everything from such animals is invalid and unacceptable until one performs with something else which Allah has made of edible flesh.’ He (the Imam) then said, ‘O Zurarah, this is from the Messenger of Allah; preserve it. O Zurarah, if it is from edible animal, performing Salah (prayer) with its fur, urine, hair, dung, milk and everything from it is permissible, if you know that proper slaughtering has taken place, which makes it clean. If it is from something which is not made lawful for you to consume as food but is made unlawful, performing Salah (prayer) with it is invalid, regardless if slaughtered properly or not.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/309)"
        ],
        "index": 5325,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1056",
              "text": "عَبْدِ اللَّهِ بْنِ إِسْحَاقَ الْعَلَوِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/310",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/35",
              "text": "مُحَمَّدِ بْنِ سُلَيْمَانَ الدَّيْلَمِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2675",
              "text": "عَيْثَمِ بْنِ أَسْلَمَ النَّجَاشِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ إِسْحَاقَ الْعَلَوِيِّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ الدَّيْلَمِيِّ عَنْ عَيْثَمِ بْنِ أَسْلَمَ النَّجَاشِيِّ عَنْ أَبِي بَصِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:2",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الصَّلَاةِ فِي الْفِرَاءِ قَالَ كَانَ عَلِيُّ بْنُ الْحُسَيْنِ ( صلوات الله عليه ) رَجُلًا صَرِداً لَا تُدْفِئُهُ فِرَاءُ الْحِجَازِ لِأَنَّ دِبَاغَتَهَا بِالْقَرَظِ فَكَانَ يَبْعَثُ إِلَى الْعِرَاقِ فَيُؤْتَى مِمَّا قِبَلَهُمْ بِالْفَرْوِ فَيَلْبَسُهُ فَإِذَا حَضَرَتِ الصَّلَاةُ أَلْقَاهُ وَ أَلْقَى الْقَمِيصَ الَّذِي تَحْتَهُ الَّذِي يَلِيهِ فَكَانَ يُسْأَلُ عَنْ ذَلِكَ فَقَالَ إِنَّ أَهْلَ الْعِرَاقِ يَسْتَحِلُّونَ لِبَاسَ الْجُلُودِ الْمَيْتَةِ وَ يَزْعُمُونَ أَنَّ دِبَاغَهُ ذَكَاتُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Abdullah Bin Is’haq Al Alawy, from Al Hassan Bin Ali, from Muhammad Bin Suleyman Al Daylami, from Aysam Bn Aslam Al Najjashy, from Abu Baseer who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the <span class=\"iTxt\">Salāt</span> in the furs. He<sup>asws</sup> said: ‘It was so that Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> was sensitive to cold. The furs of Al-Hijaz were not sufficiently (warm) for him<sup>asws</sup> because its tanning was it with tree sap. So he<sup>asws</sup> used to send someone to Al-Iraq, and he would come with it from what was accepted to him<sup>asws</sup> with the furs, and he<sup>asws</sup> would wear it. So when the (time for) <span class=\"iTxt\">Salāt</span> came up, he<sup>asws</sup> would remove it and remove the shirt which was underneath it. So he<sup>asws</sup> was asked about that, and he<sup>asws</sup> said: ‘The people of Al-Iraq are considering as Permissible, wearing the skins of the dead (animals), and they are claiming that tanning it, purifies it’."
          ],
          "en.sarwar": [
            "2. Ali ibn Muhammad ibn ‘Abd Allah has narrated from Ishaq al-‘Alaviy from al-Hassan ibn Ali from Muhammad ibn Sulayman al- Daylamiy from ‘ Aytham ibn Aslam al-Najashiy from abu Basir who has said the following: “I once asked abu ’Abd Allah, ‘Alayhi al-Salam, about Salah (prayer) with furs. He (the Imam) said, ‘Ali ibn al-Husayn was sensitive to cold and fur from Hijaz was not sufficient for him because tanning is by the pod of a species of a tree. He would send for fur from Iraq and he (the Imam) used it, but during Salah (prayer) removed it as well as the shirt underneath the fur. When asked about it he (the Imam) answered, ’People of Iraq consider using of skins of dead animals as lawful. They think tanning makes them clean.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/310)"
        ],
        "index": 5326,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "بِهَذَا الْإِسْنَادِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/68",
              "text": "مُحَمَّدِ بْنِ سُلَيْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/118",
              "text": "عَلِيِّ بْنِ أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِهَذَا الْإِسْنَادِ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:3",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ وَ أَبَا الْحَسَنِ ( عليه السلام ) عَنْ لِبَاسِ الْفِرَاءِ وَ الصَّلَاةِ فِيهَا فَقَالَ لَا تُصَلِّ فِيهَا إِلَّا فِيمَا كَانَ مِنْهُ ذَكِيّاً ",
          "قَالَ قُلْتُ أَ وَ لَيْسَ الذَّكِيُّ مِمَّا ذُكِّيَ بِالْحَدِيدِ فَقَالَ بَلَى إِذَا كَانَ مِمَّا يُؤْكَلُ لَحْمُهُ قُلْتُ وَ مَا يُؤْكَلُ لَحْمُهُ مِنْ غَيْرِ الْغَنَمِ قَالَ لَا بَأْسَ بِالسِّنْجَابِ فَإِنَّهُ دَابَّةٌ لَا تَأْكُلُ اللَّحْمَ وَ لَيْسَ هُوَ مِمَّا نَهَى عَنْهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِذْ نَهَى عَنْ كُلِّ ذِي نَابٍ وَ مِخْلَبٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Muhammad Bin Suleyman, from Ali Bin Abu Hamza who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup>, and Abu Al-Hassan (Musa)<sup>asws</sup> about wearing the fur and performing the <span class=\"iTxt\">Salāt</span> in it. So he<sup>asws</sup> said: ‘Do not pray <span class=\"iTxt\">Salāt</span> in it unless in whatever was purified (slaughtered) from it’. ",
            "He (the narrator) said, ‘I asked, ‘Is it not so that the purified is from what is purified by the iron?’ So he<sup>asws</sup> said: ‘Yes. When it was from the flesh what can be eaten’. I said, ‘And the flesh what (others) can be eaten, apart from the sheep?’ He<sup>asws</sup> said: ‘There is no problem with the squirrel, as it is an animal that does not eat flesh, and it is not of that which Rasool-Allah<sup>saww</sup> prohibited; he<sup>saww</sup> forbade eating everything with a fang (dogtooth) and a claw’."
          ],
          "en.sarwar": [
            "3. Through the same chain of narrators as that of the previous Hadith the following is narrated from Muhammad ibn Sulayman from Ali ibn abu Hamzah who has said the following: “I once asked abu ‘Abd Allah, and abu al-Hassan, ‘Alayhi al-Salam, about clothes of fur in Salah (prayer). He (the Imam) said, ‘Do not perform Salah (prayer) with it unless it is made clean, by properly slaughtering.’ I then asked, ’Is proper slaughtering done with iron? He (the Imam) said, ’Yes, if it is of edible flesh.’ I then asked about that which is of edible flesh other than sheep. He (the Imam) said, ‘It is not an offense to use fur of squirrel; it is an animal that does not eat flesh and it is not of that which the Messenger of Allah prohibited; the Messenger of Allah prohibited everything that has dogtooth and claw.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/310)"
        ],
        "index": 5327,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/300",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/168",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:4",
        "text": [
          " تُكْرَهُ الصَّلَاةُ فِي الْفِرَاءِ إِلَّا مَا صُنِعَ فِي أَرْضِ الْحِجَازِ أَوْ مِمَّا عُلِمَتْ مِنْهُ ذَكَاةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The <span class=\"iTxt\">Salāt</span> is disliked in the furs except for what is made in the land of Al-Hijaz, or from that which you know it has been purified (slaughtered)’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘It is undesirable to perform Salah (prayer) in fur except those made in al-Hijaz or that you know is properly slaughtered.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/310)"
        ],
        "index": 5328,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1056",
              "text": "عَبْدِ اللَّهِ بْنِ إِسْحَاقَ الْعَلَوِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/310",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2676",
              "text": "مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ هِلَالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/206",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ إِسْحَاقَ الْعَلَوِيِّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ هِلَالٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:5",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي أَدْخُلُ سُوقَ الْمُسْلِمِينَ أَعْنِي هَذَا الْخَلْقَ الَّذِينَ يَدَّعُونَ الْإِسْلَامَ فَأَشْتَرِي مِنْهُمُ الْفِرَاءَ لِلتِّجَارَةِ فَأَقُولُ لِصَاحِبِهَا أَ لَيْسَ هِيَ ذَكِيَّةٌ فَيَقُولُ بَلَى فَهَلْ يَصْلُحُ لِي أَنْ أَبِيعَهَا عَلَى أَنَّهَا ذَكِيَّةٌ فَقَالَ لَا وَ لَكِنْ لَا بَأْسَ أَنْ تَبِيعَهَا وَ تَقُولَ قَدْ شَرَطَ لِيَ الَّذِي اشْتَرَيْتُهَا مِنْهُ أَنَّهَا ذَكِيَّةٌ ",
          "قُلْتُ وَ مَا أَفْسَدَ ذَلِكَ قَالَ اسْتِحْلَالُ أَهْلِ الْعِرَاقِ لِلْمَيْتَةِ وَ زَعَمُوا أَنَّ دِبَاغَ جِلْدِ الْمَيْتَةِ ذَكَاتُهُ ثُمَّ لَمْ يَرْضَوْا أَنْ يَكْذِبُوا فِي ذَلِكَ إِلَّا عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Abdullah Bin Is’haq Al Alawy, from Al Hassan Bin Ali, from Muhammad Bin Abdullah Bin Hilal, from Abdul Rahman Bin Al Hajjaj who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I enter the market of the Muslims, I mean these people who are claiming Al-Islam. So I buy the furs from them for the trading, and I am saying to its owner, ‘Is this not purified (slaughtered)?’ So he is saying, ‘Yes’. So is it correct for me that I sell it upon (the stipulation) that it is purified (slaughtered)?’ So he<sup>asws</sup> said: ‘No. But, there is no problem if you were to sell it and you are saying, ‘It has been stipulated to me by the one whom I bought it from, that it is purified (slaughtered)’. ",
            "I said, ‘And what has spoilt that?’ He<sup>asws</sup> said: ‘The Permitting by the people of Al-Iraq of the dead, and their claiming that tanning a skin of the dead purifies it. Then they are not pleased if they are lying with regards to that against Rasool-Allah<sup>saww</sup>’."
          ],
          "en.sarwar": [
            "5. Ali ibn Muhammad has narrated from ‘Abd Allah ibn Ishaq al-‘Alaviy from al-Hassan ibn Ali from Muhammad ibn ‘Abd Allah ibn Hilal from ‘Abd al-Rahman ibn al-Hajjaj who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘I enter al-Suq (market place) of Muslims, meaning thereby these people who are called Muslims and buy from them fur for business purposes. I ask the owner, ‘Is it of properly slaughtered animals?’ He says, ‘Yes, it is of properly slaughtered animals.’ Can I sell it as that from properly slaughtered animals? He (the Imam) said, ‘No, you cannot do so; however, it is not an offense to sell it and say that the one from whom you purchased has said that it is from properly slaughtered animals.’ I then asked, ‘What has destroyed it?’ He (the Imam) said, ‘It is because people of Iraq consider dead animals as clean, thinking that tanning makes it lawful and it is its properly slaughtering and then they do not remain satisfied without saying that it is from the Messenger of Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح على الظاهر   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/311)"
        ],
        "index": 5329,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/109",
              "text": "غَيْرُهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/266",
              "text": "عَاصِمِ بْنِ حُمَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2270",
              "text": "عَلِيِّ بْنِ الْمُغِيرَةِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى وَ غَيْرُهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ عَلِيِّ بْنِ الْمُغِيرَةِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:6",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ الْمَيْتَةُ يُنْتَفَعُ بِشَيْ‏ءٍ مِنْهَا قَالَ لَا قُلْتُ بَلَغَنَا أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) مَرَّ بِشَاةٍ مَيْتَةٍ فَقَالَ مَا كَانَ عَلَى أَهْلِ هَذِهِ الشَّاةِ إِذْ لَمْ يَنْتَفِعُوا بِلَحْمِهَا أَنْ يَنْتَفِعُوا بِإِهَابِهَا قَالَ تِلْكَ شَاةٌ لِسَوْدَةَ بِنْتِ زَمْعَةَ زَوْجِ النَّبِيِّ ( صلى الله عليه وآله ) وَ كَانَتْ شَاةً مَهْزُولَةً لَا يُنْتَفَعُ بِلَحْمِهَا فَتَرَكُوهَا حَتَّى مَاتَتْ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَا كَانَ عَلَى أَهْلِهَا إِذْ لَمْ يَنْتَفِعُوا بِلَحْمِهَا أَنْ يَنْتَفِعُوا بِإِهَابِهَا أَنْ تُذَكَّى ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya and someone else, from Ahmad Bin Muhammad, from Ibn Mahboub, from Aasim Bin Humeyd, from Ali Bin Al Mugheira who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! The dead, can anything be benefitted from it?’ He<sup>asws</sup> said: ‘No’. I said, ‘It has reached us that Rasool-Allah<sup>saww</sup> passed by a dead sheep, and he<sup>saww</sup> said: ‘What was upon the owners of this sheep? If they were not benefitting by its flesh, they could have benefitted by its skin?’ He<sup>asws</sup> said: ‘That sheep belonged to Sawda Bint Zam’a, a wife of the Prophet<sup>saww</sup>, and the sheep was skinny, they could not have been benefitted from by its flesh, so she had neglected it until it died. So Rasool-Allah<sup>saww</sup> said: ‘What was upon the owners of this sheep? If they were not benefitting by its flesh, they could have benefitted by its skin?’ – if she had purified (slaughtered) it’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya and others has narrated from Ahmad ibn Muhammad from ibn Mahbub from ‘Asem ibn Humayd from Ali ibn al-Mighra’ who has said the following: “I once asked abu ’Abd Allah, ‘Alayhi al-Salam, about the case of dead animals if any benefit thereby is permissible. He (the Imam) said, ‘No, there is no lawful benefit in it.’ I then said, ‘We are told that the Messenger of Allah once passed by the dead body of a goat and said, ‘What has happened to the owners of this goat? If they could not benefit from its flesh they could benefit from its skin.’ He (the Imam) said, ‘That goat belonged to Sawdah, daughter of Zam‘ah, wife of the Holy prophet. It was an emaciated ewe and its flesh was not useable, so they left until it died. Thus, the Holy prophet, said, ‘If the owners could not benefit from its flesh why did they not benefit from its skin after slaughtering it properly.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/311)"
        ],
        "index": 5330,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/904",
              "text": "عَلِيِّ بْنِ مَهْزِيَارَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2677",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ الْأَشْعَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ الْأَشْعَرِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:7",
        "text": [
          " كَتَبَ بَعْضُ أَصْحَابِنَا إِلَى أَبِي جَعْفَرٍ الثَّانِي ( صلوات الله عليه ) مَا تَقُولُ فِي الْفَرْوِ يُشْتَرَى مِنَ السُّوقِ فَقَالَ إِذَا كَانَ مَضْمُوناً فَلَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Ali Bin Mahziyra, from Muhammad Bin Al Husayn Al Ashary who said, ",
            "‘One of our companions wrote to Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup>, ‘What are you<sup>asws</sup> saying regarding the furs, and can one buy it from the market?’ So he<sup>asws</sup> said: ‘When it was guaranteed (that it had been slaughtered), so there is no problem’."
          ],
          "en.sarwar": [
            "7. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Ali ibn Mahziyar from Muhammad ibn al-Hassan al-Ash’ariy who has said the following: “Certain individuals of our people once wrote to abu Ja’far, ‘Alayhi al-Salam, asking, ‘What do you say about fur purchased from al-Suq (marketplace)? He (the Imam) replied, ‘If it is (lawfully) guaranteed, then it is not an offense to buy it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/311)"
        ],
        "index": 5331,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/16",
              "text": "أَحْمَدُ بْنُ إِدْرِيسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/904",
              "text": "عَلِيِّ بْنِ مَهْزِيَارَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2678",
              "text": "رَجُلٍ سَأَلَ الْمَاضِيَ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2679",
              "text": "الصَّلَاةِ"
            },
            {
              "kind": "plain",
              "text": " فِي"
            }
          ],
          "text": "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنْ رَجُلٍ سَأَلَ الْمَاضِيَ ( عليه السلام ) عَنِ الصَّلَاةِ فِي"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:8",
        "text": [
          " الثَّعَالِبِ فَنَهَى عَنِ الصَّلَاةِ فِيهَا وَ فِي الثَّوْبِ الَّذِي يَلِيهَا فَلَمْ أَدْرِ أَيُّ الثَّوْبَيْنِ الَّذِي يَلْصَقُ بِالْوَبَرِ أَوِ الَّذِي يَلْصَقُ بِالْجِلْدِ فَوَقَّعَ ( عليه السلام ) بِخَطِّهِ الَّذِي يَلْصَقُ بِالْجِلْدِ ",
          "قَالَ وَ ذَكَرَ أَبُو الْحَسَنِ ( عليه السلام ) أَنَّهُ سَأَلَهُ عَنْ هَذِهِ الْمَسْأَلَةِ فَقَالَ لَا تُصَلِّ فِي الثَّوْبِ الَّذِي فَوْقَهُ وَ لَا فِي الَّذِي تَحْتَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, from Ali Bin Mahziyar, ",
            "(It has been narrated) from a man who asked Al-Maazy<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), about the <span class=\"iTxt\">Salāt</span> in the foxes (furs), but he<sup>asws</sup> forbade from performing <span class=\"iTxt\">Salāt</span> in it, and in the clothes which are underneath it. So I did not know which of the two clothes – the one which touches the fur or that which touches with the skin. So he<sup>asws</sup> signed by his<sup>asws</sup> handwriting: ‘That which touches with the skin’. ",
            "He (the narrator) said, ‘And Abu Al-Hassan<sup>asws</sup> mentioned that he<sup>asws</sup> was asked about this problem, so he<sup>asws</sup> said: ‘You cannot pray <span class=\"iTxt\">Salāt</span> in the cloth which is above it, nor in that which is underneath it’."
          ],
          "en.sarwar": [
            "8. Ahmad ibn Idris has narrated from Muhammad ibn ‘Abd al-Jabbar from Ali ibn Mahziyar from a man who had has said the following: “He had asked him (the Imam) about performing Salah (prayer) with foxes (things from it) and he (the Imam) prohibited him to perform Salah (prayer) in such things and with the clothes which is the next layer. He (the man) did not know which layer was meant; the one touching the furs or the one touching one’s skin. He (the Imam) wrote with his handwriting that said, ‘It is the one that touches the skin. He (the narrator) has said that he then asked abu al-Hassan that he had asked him (the Imam) about this issue and he (the Imam) had said, ‘Do not perform Salah (prayer) with the clothes which are on its top as well as that which is beneath.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/312)"
        ],
        "index": 5332,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2610",
              "text": "عَلِيُّ بْنُ مَهْزِيَارَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مَهْزِيَارَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:9",
        "text": [
          " كَتَبَ إِلَيْهِ إِبْرَاهِيمُ بْنُ عُقْبَةَ عِنْدَنَا جَوَارِبُ وَ تِكَكٌ تُعْمَلُ مِنْ وَبَرِ الْأَرَانِبِ فَهَلْ تَجُوزُ الصَّلَاةُ فِي وَبَرِ الْأَرَانِبِ مِنْ غَيْرِ ضَرُورَةٍ وَ لَا تَقِيَّةٍ فَكَتَبَ ( عليه السلام ) لَا تَجُوزُ الصَّلَاةُ فِيهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Mahziyar said, ",
            "‘Ibrahim Bin Uqba wrote to him<sup>asws</sup>, ‘In our presence there are waistbands and socks made from rabbit fur. So is the <span class=\"iTxt\">Salāt</span> allowed in the fur of rabbits, from without a necessity, nor in dissimulation?’ So he<sup>asws</sup> wrote: ‘The <span class=\"iTxt\">Salāt</span> is not allowed in it’."
          ],
          "en.sarwar": [
            "9. Ali ibn Mahziyar from has said the following: “Ibrahim ibn ‘Uqbah once wrote to him (the Imam), ‘Alayhi al-Salam, asking, ‘People here make socks and waistbands from the fur of foxes. Is it permissible to perform Salah (prayer) with it without Taqiyah (fear) or necessity? He (the Imam) wrote with his hand writing, ‘It is not permissible to perform Salah (prayer) with it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/312)"
        ],
        "index": 5333,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/16",
              "text": "أَحْمَدُ بْنُ إِدْرِيسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:10",
        "text": [
          " كَتَبْتُ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) أَسْأَلُهُ هَلْ يُصَلَّى فِي قَلَنْسُوَةِ حَرِيرٍ مَحْضٍ أَوْ قَلَنْسُوَةِ دِيبَاجٍ فَكَتَبَ ( عليه السلام ) لَا تَحِلُّ الصَّلَاةُ فِي حَرِيرٍ مَحْضٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar who said, ",
            "‘I wrote to Abu Muhammad<sup>asws</sup> asking him<sup>asws</sup>, ‘Can one pray <span class=\"iTxt\">Salāt</span> in a hat of pure silk, or a hat of brocade?’ So he<sup>asws</sup> wrote: ‘The <span class=\"iTxt\">Salāt</span> is not Permissible in pure silk’."
          ],
          "en.sarwar": [
            "10. Ahmad ibn Idris has narrated from Muhammad ibn ‘Abd al-Jabbar who has said the following: “I once wrote to abu Muhammad, ‘Alayhi al-Salam, asking if it is permissible to perform Salah  (prayer) with a cap of pure silk or silk brocade. He (the Imam) wrote, ‘It is not lawful to perform Salah (prayer) with pure silk.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/313)"
        ],
        "index": 5334,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1056",
              "text": "عَبْدِ اللَّهِ بْنِ إِسْحَاقَ الْعَلَوِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/310",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/35",
              "text": "مُحَمَّدِ بْنِ سُلَيْمَانَ الدَّيْلَمِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2680",
              "text": "فُرَيْتٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/66",
              "text": "ابْنِ أَبِي يَعْفُورٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ إِسْحَاقَ الْعَلَوِيِّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ الدَّيْلَمِيِّ عَنْ فُرَيْتٍ عَنِ ابْنِ أَبِي يَعْفُورٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:11",
        "text": [
          " كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِذْ دَخَلَ عَلَيْهِ رَجُلٌ مِنَ الْخَزَّازِينَ فَقَالَ لَهُ جُعِلْتُ فِدَاكَ مَا تَقُولُ فِي الصَّلَاةِ فِي الْخَزِّ فَقَالَ لَا بَأْسَ بِالصَّلَاةِ فِيهِ فَقَالَ لَهُ الرَّجُلُ جُعِلْتُ فِدَاكَ إِنَّهُ مَيِّتٌ وَ هُوَ عِلَاجِي وَ أَنَا أَعْرِفُهُ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَنَا أَعْرَفُ بِهِ مِنْكَ ",
          "فَقَالَ لَهُ الرَّجُلُ إِنَّهُ عِلَاجِي وَ لَيْسَ أَحَدٌ أَعْرَفَ بِهِ مِنِّي فَتَبَسَّمَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) ثُمَّ قَالَ لَهُ أَ تَقُولُ إِنَّهُ دَابَّةٌ تَخْرُجُ مِنَ الْمَاءِ أَوْ تُصَادُ مِنَ الْمَاءِ فَتُخْرَجُ فَإِذَا فُقِدَ الْمَاءُ مَاتَ فَقَالَ الرَّجُلُ صَدَقْتَ جُعِلْتُ فِدَاكَ هَكَذَا هُوَ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَإِنَّكَ تَقُولُ إِنَّهُ دَابَّةٌ تَمْشِي عَلَى أَرْبَعٍ وَ لَيْسَ هُوَ عَلَى حَدِّ الْحِيتَانِ فَيَكُونَ ذَكَاتُهُ خُرُوجَهُ مِنَ الْمَاءِ فَقَالَ الرَّجُلُ إِي وَ اللَّهِ هَكَذَا أَقُولُ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَإِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى أَحَلَّهُ وَ جَعَلَ ذَكَاتَهُ مَوْتَهُ كَمَا أَحَلَّ الْحِيتَانَ وَ جَعَلَ ذَكَاتَهَا مَوْتَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Abdullah Bin Is’haq Al Alawy, from Al Hassan Bin Ali, from Muhammad Bin Suleyman Al Daylami, from Fureyt, from Ibn Abu Yafour who said, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup> when a man from the otter hunters came over to him<sup>asws</sup>, and he said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! What are you<sup>asws</sup> saying regarding the <span class=\"iTxt\">Salāt</span> in the otter (fur)?’ So he<sup>asws</sup> said, ‘There is no problem with the <span class=\"iTxt\">Salāt</span> in it. So the man said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! It is dead, and it is my profession, and I understand it’. So Abu Abdullah<sup>asws</sup> said to him: ‘I<sup>asws</sup> more understanding with it than you do’. ",
            "So the man said to him, ‘It is my profession, and there is none more understanding with it than I am’. So Abu Abdullah<sup>asws</sup> smiled, then said to him: ‘You are saying that it is an animal coming out from the water, or being hunted from the water, so when it comes out and misses the water, it dies’. So he said, ‘You<sup>asws</sup> speak the truth, may I be scarified for you<sup>asws</sup>! This is how it is’. So Abu Abdullah<sup>asws</sup> said to him: ‘So you are saying that it is an animal walking upon four, and it is not upon a limit of the fish, so its purification is its exit from the water?’ So the man said, ‘Yes, by Allah<sup>azwj</sup>! It is like this’. So Abu Abdullah<sup>asws</sup> said to him: ‘But Allah<sup>azwj</sup> Blessed and High has Permitted it, and Made its purification to be (upon) its death, just as He<sup>azwj</sup> has Permitted the fish and Made its purification, (upon) its death’."
          ],
          "en.sarwar": [
            "11. Ali ibn Muhammad has narrated from ‘Abd Allah ibn Ishaq al-‘Alaviy from al-Hassan ibn Ali from Muhammad ibn Sulayman al- Daylamiy from Furayt from ibn abu Ya‘fur who has said the following: “Once I was in the presence of abu ‘Abd Allah, ‘Alayhi al-Salam, when a man of al-Khazzazin came and said, ‘I pray to Allah to keep my soul in service for your cause, ‘What do you say about performing Salah (prayer) with al-Khazz? He (the Imam) said, ‘It is not an offense to perform Salah (prayer) with it.’ A man then said to him (the Imam), ‘I pray to Allah to keep my soul in service for your cause, it is dead and it is manufactured and I know it. Abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘I know it more than you do.’ The man said, ‘It is manufactured and no one knows more than I know.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, then smiled and asked, ‘Do you say that it is an animal that comes from water? Or you say that it is caught from water and is brought out and when it is away from water it dies?’ The man said, ‘You spoke the truth, I pray to Allah to keep my soul in service for your cause, that is how it is.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, said to him, ‘So you say that it is an animal that walks on four feet and it is not like whales in the case of which its properly being slaughtered is its coming out of the water.’ The man said, ‘Yes, by Allah that is what I say how it is.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘Allah, most High has made it lawful and its proper slaughtering is its dying like whales for which proper slaughtering is its dying.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/314)"
        ],
        "index": 5335,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/129",
              "text": "مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2681",
              "text": "إِسْمَاعِيلَ بْنِ سَعْدٍ الْأَحْوَصِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ إِسْمَاعِيلَ بْنِ سَعْدٍ الْأَحْوَصِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:12",
        "text": [
          " سَأَلْتُ أَبَا الْحَسَنِ الرِّضَا ( عليه السلام ) عَنِ الصَّلَاةِ فِي جُلُودِ السِّبَاعِ فَقَالَ لَا تُصَلِّ فِيهَا ",
          "قَالَ وَ سَأَلْتُهُ هَلْ يُصَلِّي الرَّجُلُ فِي ثَوْبِ إِبْرِيسَمٍ فَقَالَ لَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Khalid, from Ismail Bin Sa’ad Al Ahows who said, ",
            "‘I asked Abu Al-Hassan Al-Reza<sup>asws</sup> about the <span class=\"iTxt\">Salāt</span> in the skins of the predatory animals. So he<sup>asws</sup> said: ‘Do not pray <span class=\"iTxt\">Salāt</span> in it’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup>, ‘Can the man pray <span class=\"iTxt\">Salāt</span> in a silken cloth?’ So he<sup>asws</sup> said: ‘No’."
          ],
          "en.sarwar": [
            "12. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Khalid from ’Isma‘il ibn Sa‘d al-Ahwas who has said the following: “I once asked abu al-Hassan al-Rida’, ‘Alayhi al-Salam, about performing Salah (prayer) with the skin of beasts. He (the Imam) said, ‘Do not perform Salah (prayer) with it.’ He (the narrator) has said that he then asked him (the Imam) about performing Salah (prayer) with Abrisam (silk). He (the Imam) said, ‘No, it is not permissible.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/314)"
        ],
        "index": 5336,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/18",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/318",
              "text": "عَلِيِّ بْنِ عُقْبَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/667",
              "text": "مُوسَى بْنِ أُكَيْلٍ النُّمَيْرِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ بَعْضِ أَصْحَابِنَا عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ مُوسَى بْنِ أُكَيْلٍ النُّمَيْرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:13",
        "text": [
          " سَأَلْتُهُ عَنِ الرَّجُلِ يَكُونُ فِي السَّفَرِ وَ مَعَهُ السِّكِّينُ فِي خُفِّهِ لَا يَسْتَغْنِي عَنْهَا أَوْ فِي سَرَاوِيلِهِ مَشْدُوداً وَ الْمِفْتَاحُ يَخَافُ عَلَيْهِ الضَّيْعَةَ أَوْ فِي وَسَطِهِ الْمِنْطَقَةُ فِيهَا حَدِيدٌ قَالَ لَا بَأْسَ بِالسِّكِّينِ وَ الْمِنْطَقَةِ لِلْمُسَافِرِ فِي وَقْتِ ضَرُورَةٍ وَ كَذَلِكَ الْمِفْتَاحُ يَخَافُ عَلَيْهِ أَوْ فِي النِّسْيَانِ وَ لَا بَأْسَ بِالسَّيْفِ وَ كَذَلِكَ آلَةُ السِّلَاحِ فِي الْحَرْبِ وَ فِي غَيْرِ ذَلِكَ لَا تَجُوزُ الصَّلَاةُ فِي شَيْ‏ءٍ مِنَ الْحَدِيدِ فَإِنَّهُ نَجَسٌ مَمْسُوخٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from one of our companions, from Ali BinUqba, from Musa Bin Akeyl Al Nameyri, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the man who happens to be in the journey, and with him is a knife in his socks or in his trouser, not being able to do without it, tightened, and the key he is fearing upon losing it, or in his waist is the belt wherein is iron. He<sup>asws</sup> said: ‘There is no problem with the knife and the belt for the traveller during a time of desperation, and similar to that is the key he is fearing upon, or regarding forgetfulness; and there is no problem with the sword, and similar to that is the reason for the weapon during the war etc. The <span class=\"iTxt\">Salāt</span> is not allowed during anything from the iron, for it is unclean, transformed’."
          ],
          "en.sarwar": [
            "13. Muhammad ibn Yahya has narrated from certain persons of our people from Ali ibn ‘Uqbah from Musa ibn ‘Ukayl al-Numayriy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who on a journey has a knife in his slipper without which he cannot do anything or it is in his pant, and a key which he is afraid of losing it, or that around his midsection is a belt in which there is iron. He (the Imam) said, ‘It is not an offense to have a knife, or a belt for a traveler in case he needs them as well as a key for which one is afraid about forgetting it. It is not an offense to have a sword or weapons during a war and in other times. It is not permissible to perform Salah (prayer) with iron; it is Najis (unclean) and metamorphosed. ’ ” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/315)"
        ],
        "index": 5337,
        "local_index": 14,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/75",
              "text": "مُحَمَّدُ بْنُ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/904",
              "text": "عَلِيِّ بْنِ مَهْزِيَارَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/572",
              "text": "أَبِي عَلِيِّ بْنِ رَاشِدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنْ أَبِي عَلِيِّ بْنِ رَاشِدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:14",
        "text": [
          " قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) مَا تَقُولُ فِي الْفِرَاءِ أَيُّ شَيْ‏ءٍ يُصَلَّى فِيهِ فَقَالَ أَيُّ الْفِرَاءِ قُلْتُ الْفَنَكَ وَ السِّنْجَابَ وَ السَّمُّورَ قَالَ فَصَلِّ فِي الْفَنَكِ وَ السِّنْجَابِ فَأَمَّا السَّمُّورُ فَلَا تُصَلِّ فِيهِ قُلْتُ فَالثَّعَالِبُ نُصَلِّي فِيهَا قَالَ لَا وَ لَكِنْ تَلْبَسُ بَعْدَ الصَّلَاةِ قُلْتُ أُصَلِّي فِي الثَّوْبِ الَّذِي يَلِيهِ قَالَ لَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad and Muhammad Bin Al Hasan, form Sahl Bin Ziyad, from Ali Bin Mahziyar, from Abu Ali Bin Rashid who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘What are you<sup>asws</sup> saying regarding the furs? Which thing can one pray <span class=\"iTxt\">Salāt</span> in?’ So he<sup>asws</sup> said: ‘Which furs?’ I said, ‘The fennec fox, and the squirrel, and the beaver’. He<sup>asws</sup> said: ‘You can pray <span class=\"iTxt\">Salāt</span> in the fennec fox and the squirrel, but as for the beaver, so you cannot pray <span class=\"iTxt\">Salāt</span> in it’. I said, ‘But the fox, can we pray <span class=\"iTxt\">Salāt</span> in it’. He<sup>asws</sup> said: ‘No, but you can wear it after the <span class=\"iTxt\">Salāt</span>’. I said, ‘Can I pray <span class=\"iTxt\">Salāt</span> in the cloth which is under it?’ He<sup>asws</sup> said: ‘No’."
          ],
          "en.sarwar": [
            "14. Ali ibn Muhammad and Muhammad ibn al-Hassan has narrated from Sahl ibn Ziyad from Ali ibn Mahziyar from abu Ali ibn Rashid who has said the following: “I once asked abu Ja‘far al-Thaniy, ‘Alayhi al-Salam, about furs if performing Salah (prayer) with it is permissible. He (the Imam) asked, ‘Which kind of fur is it?’ I replied, ‘Fennec, squirrel and sable. He (the Imam) said, ‘You can perform Salah (prayer) with fennec and squirrel. Do not perform Salah (prayer) with the fur of sable.’ I then asked about foxes. He (the Imam) said, ‘No, you cannot perform Salah (prayer) with it but you can wear it after Salah (prayer). I then asked, ‘Can I perform Salah (prayer) with the layer of clothes next to it?’ He (the Imam) said, ’No, you cannot do so.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/316)"
        ],
        "index": 5338,
        "local_index": 15,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2682",
              "text": "أَحْمَدَ بْنِ عِبْدِيلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/251",
              "text": "ابْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/694",
              "text": "عَبْدِ اللَّهِ بْنِ جُنْدَبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1424",
              "text": "سُفْيَانَ بْنِ السِّمْطِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَحْمَدَ بْنِ عِبْدِيلٍ عَنِ ابْنِ سِنَانٍ عَنْ عَبْدِ اللَّهِ بْنِ جُنْدَبٍ عَنْ سُفْيَانَ بْنِ السِّمْطِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:15",
        "text": [
          " الرَّجُلُ إِذَا اتَّزَرَ بِثَوْبٍ وَاحِدٍ إِلَى ثُنْدُوَتِهِ صَلَّى فِيهِ ",
          "قَالَ وَ قَرَأْتُ فِي كِتَابِ مُحَمَّدِ بْنِ إِبْرَاهِيمَ إِلَى أَبِي الْحَسَنِ ( عليه السلام ) يَسْأَلُهُ عَنِ الْفَنَكِ يُصَلَّى فِيهِ فَكَتَبَ لَا بَأْسَ بِهِ ",
          "وَ كَتَبَ يَسْأَلُهُ عَنْ جُلُودِ الْأَرَانِبِ فَكَتَبَ ( عليه السلام ) مَكْرُوهٌ ",
          "وَ كَتَبَ يَسْأَلُهُ عَنْ ثَوْبٍ حَشْوُهُ قَزٌّ يُصَلَّى فِيهِ فَكَتَبَ لَا بَأْسَ بِهِ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Ahmad Bin Ibdeel, form Ibn Sinan, from Abdullah Bin Jundab, from Sufyan Bin Al Simt, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The man, when he wears a trouser with one cloth up to his chest, he can pray <span class=\"iTxt\">Salāt</span> in it’. ",
            "He (the narrator) said, ‘And I read in a letter of Muhammad Bin Ibrahim to Abu Al-Hassan<sup>asws</sup>, asking him<sup>asws</sup> about the fennec fox, can one pray <span class=\"iTxt\">Salāt</span> in it?’ So he<sup>asws</sup> wrote: ‘There is no problem with it’. ",
            "And I wrote asking him about the skins of the rabbits, so he<sup>asws</sup> wrote: ‘It is disliked’. ",
            "And I wrote asking him<sup>asws</sup> about the cloth lined with silk, can one pray <span class=\"iTxt\">Salāt</span> in it?’ So he<sup>asws</sup> wrote: ‘There is no problem with it’."
          ],
          "en.sarwar": [
            "15. Ali ibn Ibrahim has narrated from Ahmad ibn ’Abddeyl from ibn Sinan from ‘Abd Allah ibn Jundab from Sufyan ibn al-Simt who has said the following: “Abu ’Abd Allah, ‘Alayhi al-Salam, has said, ‘If a man covers himself with a loincloth up to his two breast he can perform Salah (prayer) with it. He (the narrator) has said that he read in the letter of Muhammad ibn Ibrahim to abu al-Hassan, ‘Alayhi al-Salam, in which he had asked about fennec if it is permissible to perform Salah (prayer) with it. He (the Imam) had written, ‘It is not an offense to perform Salah (prayer) with it.’ He had written asking about the skins of foxes and he (the Imam) had written, ‘It is undesirable.’ He had written asking about lining of silk (not the one from silkworm) if performing Salah (prayer) with it is permissible. He (the Imam) had written, ‘It is permissible.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل و ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/316)"
        ],
        "index": 5339,
        "local_index": 16,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2683",
              "text": "عَبْدِ اللَّهِ بْنِ إِسْحَاقَ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/173",
              "text": "ذَكَرَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2684",
              "text": "مُقَاتِلِ بْنِ مُقَاتِلٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ إِسْحَاقَ عَمَّنْ ذَكَرَهُ عَنْ مُقَاتِلِ بْنِ مُقَاتِلٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:16",
        "text": [
          " سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنِ الصَّلَاةِ فِي السَّمُّورِ وَ السِّنْجَابِ وَ الثَّعْلَبِ فَقَالَ لَا خَيْرَ فِي ذَلِكَ كُلِّهِ مَا خَلَا السِّنْجَابَ فَإِنَّهُ دَابَّةٌ لَا تَأْكُلُ اللَّحْمَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Abdullah Bin Is’haq, from the one who mentioned it, from Muqatil Bin Muqati who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about the <span class=\"iTxt\">Salāt</span> in the beaver and the squirrel, and the fox. So he<sup>asws</sup> said: ‘There is no goodness in all that except for the squirrel, for it is an animal not consuming the meat’."
          ],
          "en.sarwar": [
            "16. Ali ibn Muhammad has narrated from ‘Abd Allah ibn Ishaq from those whom he has mentioned from Muqatil ibn Muqatil who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about performing Salah (prayer) with sable, squirrel and fox. He (the Imam) said, ‘There is nothing good with all of it except squirrel which is an animal that does not eat meat.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/317)"
        ],
        "index": 5340,
        "local_index": 17,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:17",
        "text": [
          "هُ كَرِهَ أَنْ يُصَلِّيَ وَ عَلَيْهِ ثَوْبٌ فِيهِ تَمَاثِيلُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that he<sup>asws</sup> disliked if one were to pray and upon him is a cloth wherein are resemblances (pictures)’."
          ],
          "en.sarwar": [
            "17. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from ‘Abd Allah ibn Sinan who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, disliked to perform Salah (prayer) with clothes that had portraits on them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/317)"
        ],
        "index": 5341,
        "local_index": 18,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/104",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/117",
              "text": "عُثْمَانَ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/305",
              "text": "سَمَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:18",
        "text": [
          " قُلْتُ لَهُ الطَّيْلَسَانُ يَعْمَلُهُ الْمَجُوسُ أُصَلِّي فِيهِ قَالَ أَ لَيْسَ يُغْسَلُ بِالْمَاءِ قُلْتُ بَلَى قَالَ لَا بَأْسَ قُلْتُ الثَّوْبُ الْجَدِيدُ يَعْمَلُهُ الْحَائِكُ أُصَلِّي فِيهِ قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad and Muhammad Bin Al Husayn, from Usman Bin Isa, from Sama’at, form Abu Baseer, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘The shawl manufactured by the Magian, can one pray <span class=\"iTxt\">Salāt</span> in it?’ He<sup>asws</sup> said: ‘Has it not been washed with the water?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘There is no problem’. I said, ‘The new cloth worked upon by the weaver, can I pray <span class=\"iTxt\">Salāt</span> in it?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            "18. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad and Muhammad ibn al-Husayn from ‘Uthman ibn ‘Isa from Sanaa ‘ah from abu Basir who has said the following: “I once asked abu Ja’far, ‘Alayhi al-Salam, about the shawl made by Zoroastrians if I can perform Salah (prayer) with it. He (the Imam) asked, ‘Can it be washed with water?’ I replied, ‘Yes, it can be washed.’ He (the Imam) said, ‘It is not an offense to perform Salah (prayer) with it.’ I then asked about cloths made by the weavers if I can perform Salah (prayer) with it. He (the Imam) said, ‘Yes, you can do so.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/317)"
        ],
        "index": 5342,
        "local_index": 19,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/121",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/170",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2367",
              "text": "الْعِيصِ بْنِ الْقَاسِمِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ الْعِيصِ بْنِ الْقَاسِمِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:19",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يُصَلِّي فِي ثَوْبِ الْمَرْأَةِ وَ فِي إِزَارِهَا وَ يَعْتَمُّ بِخِمَارِهَا قَالَ نَعَمْ إِذَا كَانَتْ مَأْمُونَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Sh<span class=\"iTxt\">Azaan</span>, from Safwan Bin Yahya, from Al Ays Bin Al Qasim who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man who prays in a cloth of the woman and in her trouser, and he makes a turban with her scarf. He<sup>asws</sup> said: ‘Yes, when she was trustworthy’."
          ],
          "en.sarwar": [
            "19. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya from al-‘Is ibn al-Qasim who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who performs Salah (prayer) with clothes of woman, with her loincloth and uses her veil as a turban. He (the Imam) said, ‘It is acceptable if she is trusted.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/317)"
        ],
        "index": 5343,
        "local_index": 20,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/59",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2372",
              "text": "عَبْدِ اللَّهِ بْنِ عَامِرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/904",
              "text": "عَلِيِّ بْنِ مَهْزِيَارَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/196",
              "text": "فَضَالَةَ بْنِ أَيُّوبَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/73",
              "text": "حَمَّادِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ حَمَّادِ بْنِ عُثْمَانَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:20",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الدَّرَاهِمِ السُّودِ الَّتِي فِيهَا التَّمَاثِيلُ أَ يُصَلِّي الرَّجُلُ وَ هِيَ مَعَهُ فَقَالَ لَا بَأْسَ إِذَا كَانَتْ مُوَارَاةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Abdullah Bin Aamir, from Ali Bin Mahziyar, from Fazalat Bin Ayoub, from Hammad Bin Usman who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the black Dirhams in which there are resemblances (embossed picture), can the man pray <span class=\"iTxt\">Salāt</span> in it and it is with him?’ So he<sup>asws</sup> said: ‘There is no problem when they were out of sight (hidden)’."
          ],
          "en.sarwar": [
            "20. Al-Husayn ibn Muhammad has narrated from ‘Abd Allah ibn ‘Amir from Ali ibn Mahziyar from Fadalah ibn Ayyub from Hammad ibn ‘Uthman who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who performs Salah (prayer) with black dirhams which have portraits on them. He (the Imam) said, ‘It is not an offense if they are hidden.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/318)"
        ],
        "index": 5344,
        "local_index": 21,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/735",
              "text": "وَ"
            },
            {
              "kind": "plain",
              "text": " فِي"
            }
          ],
          "text": "وَ فِي"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:21",
        "text": [
          " رِوَايَةِ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْهُ قَالَ قَالَ لَا بُدَّ لِلنَّاسِ مِنْ حِفْظِ بَضَائِعِهِمْ فَإِنْ صَلَّى وَ هِيَ مَعَهُ فَلْتَكُنْ مِنْ خَلْفِهِ وَ لَا يَجْعَلْ شَيْئاً مِنْهَا بَيْنَهُ وَ بَيْنَ الْقِبْلَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And in a report of Abdul Rahman Bin Al Hajjaj, ",
            "(It has been narrated) from him<sup>asws</sup> having said: ‘It is a must for the people to protect their belongings. So if one prays <span class=\"iTxt\">Salāt</span> and these are with him, so let it happen to be behind him, and he should not make anything from it to be between him and the Qiblah’."
          ],
          "en.sarwar": [
            "21. In the narration of ‘Abd al-Rahman ibn al-Hajjaj narrated from him (the Imam) who has said the following: “He (the Imam), ‘Alayhi al-Salam, has said, ‘ People must protect their properties. When performing Salah (prayer) with their belongings around, such things are kept behind them but are not placed between them and al-Qiblah (al-Ka‘bah).” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/318)"
        ],
        "index": 5345,
        "local_index": 22,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/73",
              "text": "حَمَّادِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:22",
        "text": [
          " تُكْرَهُ الصَّلَاةُ فِي الثَّوْبِ الْمَصْبُوغِ الْمُشْبَعِ الْمُفْدَمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Hammad Bin Usman, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The <span class=\"iTxt\">Salāt</span> is dislike in the dyed clothes in vibrant colours’."
          ],
          "en.sarwar": [
            "22. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from Hammad ibn ‘Uthaman who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘It is undesirable to perform Salah (prayer) in clothes dyed with sharply saturated colors.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/318)"
        ],
        "index": 5346,
        "local_index": 23,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:23",
        "text": [
          " صَلِّ فِي مِنْدِيلِكَ الَّذِي تَتَمَنْدَلُ بِهِ وَ لَا تُصَلِّ فِي مِنْدِيلٍ يَتَمَنْدَلُ بِهِ غَيْرُكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, raising it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘You can pray <span class=\"iTxt\">Salāt</span> in your towel which you are using as a towel with, and you cannot pray <span class=\"iTxt\">Salāt</span> in a towel which someone else is using as a towel’."
          ],
          "en.sarwar": [
            "23. Muhammad ibn Yahya in a marfu‘ manner has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Perform Salah (prayer) with your own handkerchief but not with others’ handkerchief.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/319)"
        ],
        "index": 5347,
        "local_index": 24,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى رَفَعَهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:24",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَا تُصَلِّ فِيمَا شَفَّ أَوْ سُفَّ يَعْنِي الثَّوْبَ الْمُصَيْقَلَ وَ رُوِيَ لَا تُصَلِّ فِي ثَوْبٍ أَسْوَدَ فَأَمَّا الْخُفُّ أَوِ الْكِسَاءُ أَوِ الْعِمَامَةُ فَلَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, raising it, said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘You cannot pray <span class=\"iTxt\">Salāt</span> in what is gauzy or sieves, meaning the sparkling’. And it is reported: ‘(He<sup>asws</sup> said): ‘You cannot pray <span class=\"iTxt\">Salāt</span> in a black cloth, but as for the socks, or a cloak, or the turban, so there is no problem’."
          ],
          "en.sarwar": [
            "24. Muhammad ibn Yahya in a marfu‘ manner has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘You must not perform Salah (prayer) in cloths that are shaffa or suffa, that is, that which is painted.’” In another Hadith it is said, ‘Do not perform Salah (prayer) in black clothes; however, black slipper, cloak or turban is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/320)"
        ],
        "index": 5348,
        "local_index": 25,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/16",
              "text": "أَحْمَدُ بْنُ إِدْرِيسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/964",
              "text": "مُحَمَّدِ بْنِ أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1014",
              "text": "السَّيَّارِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2685",
              "text": "أَبِي يَزِيدَ الْقَسْمِيِّ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2686",
              "text": "قَسْمٌ حَيٌّ مِنَ الْيَمَنِ بِالْبَصْرَةِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/90",
              "text": "أَبِي الْحَسَنِ الرِّضَا ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنِ السَّيَّارِيِّ عَنْ أَبِي يَزِيدَ الْقَسْمِيِّ وَ قَسْمٌ حَيٌّ مِنَ الْيَمَنِ بِالْبَصْرَةِ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:25",
        "text": [
          "هُ سَأَلَهُ عَنْ جُلُودِ الدَّارِشِ الَّتِي يُتَّخَذُ مِنْهَا الْخِفَافُ قَالَ فَقَالَ لَا تُصَلِّ فِيهَا فَإِنَّهَا تُدْبَغُ بِخُرْءِ الْكِلَابِ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Ahmad, from Al Sayyari, from Abu Yazeed Al Qasmy, and Qasam, it is a village on the way from Al Yemen with Al Basra, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup>, having been asked about the skins of ‘Al-Darish’ from which shoes are taken to be. So he<sup>asws</sup> said: ‘You cannot pray <span class=\"iTxt\">Salāt</span> in it, for it is tanned with the excretion of dogs’."
          ],
          "en.sarwar": [
            "25. Ahmad ibn Idris has narrated from Muhammad ibn Ahmad al-Sayyariy from abu Yazid al-Qasmiy, Qasmah is a village in Yeman in Basra, who has said the following: “I once asked abu al-Hassan al-Rida’, ‘Alayhi al-Salam, about al-Darish skin from which slippers are made. He (the Imam) said, ‘Do not perform Salah (prayer) with them because it is tanned with the leftover of dogs.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/320)"
        ],
        "index": 5349,
        "local_index": 26,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " فِي"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:26",
        "text": [
          " الْخَزِّ الْخَالِصِ أَنَّهُ لَا بَأْسَ بِهِ فَأَمَّا الَّذِي يُخْلَطُ فِيهِ وَبَرُ الْأَرَانِبِ أَوْ غَيْرُ ذَلِكَ مِمَّا يُشْبِهُ هَذَا فَلَا تُصَلِّ فِيهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, raising it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the pure otter (skin) that there is no problem with it, but as for that wherein is mixed the fur of rabbits or other than that from what resembles it, so you cannot pray <span class=\"iTxt\">Salāt</span> in it’."
          ],
          "en.sarwar": [
            "26. A number of our people have narrated from Ahmad ibn Muhammad who, in a marfu‘ manner has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, about pure al-Khazz has said, ‘It is not an offense to perform Salah (prayer) with it, but do not perform Salah (prayer) with that which is mixed with fur of foxes or other things.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/320)"
        ],
        "index": 5350,
        "local_index": 27,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/114",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "النَّضْرِ بْنِ سُوَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1162",
              "text": "الْقَاسِمِ بْنِ سُلَيْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1893",
              "text": "جَرَّاحٍ الْمَدَائِنِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ أَبِيهِ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنِ الْقَاسِمِ بْنِ سُلَيْمَانَ عَنْ جَرَّاحٍ الْمَدَائِنِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:27",
        "text": [
          "هُ كَانَ يَكْرَهُ أَنْ يَلْبَسَ الْقَمِيصَ الْمَكْفُوفَ بِالدِّيبَاجِ وَ يَكْرَهُ لِبَاسَ الْحَرِيرِ وَ لِبَاسَ الْوَشْيِ وَ يَكْرَهُ الْمِيثَرَةَ الْحَمْرَاءَ فَإِنَّهَا مِيثَرَةُ إِبْلِيسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Al Barqy, from his father, from Al Nazar Bin Suweyd, from Al Qasim Bin Suleyman, from Jarrah Al Madainy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having disliked if one were to wear the shirt hemmed with the brocade, and he<sup>asws</sup> disliked the silk cloth, and the embroidered clothes, and he<sup>asws</sup> disliked the red saddlecloth, for these are the inheritances of Iblees<sup>la</sup>’."
          ],
          "en.sarwar": [
            "27. A number of our people have narrated from Ahmad ibn Muhammad, from al-Barqiy from his father from al-Nadr ibn Suwayd from al-Qasim ibn Sulayman from Jarrah al-Mad’iniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that he disliked wearing a shirt which has brocaded hems, cloths of silk embroideries and red saddlecloth; it is a saddlecloth of Satan.’”: "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/321)"
        ],
        "index": 5351,
        "local_index": 28,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/121",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/170",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/217",
              "text": "ابْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/168",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ ابْنِ مُسْكَانَ عَنِ الْحَلَبِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:28",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الْخِفَافُ عِنْدَنَا فِي السُّوقِ نَشْتَرِيهَا فَمَا تَرَى فِي الصَّلَاةِ فِيهَا فَقَالَ صَلِّ فِيهَا حَتَّى يُقَالَ لَكَ إِنَّهَا مَيْتَةٌ بِعَيْنِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Sh<span class=\"iTxt\">Azaan</span>, from Safwan Bin Yahya, from Ibn Muskan, from Al Halby who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The footwear that are with us in the marketplace, we tend to buy it. So what is your<sup>asws</sup> view regarding the <span class=\"iTxt\">Salāt</span> in it?’ So he<sup>asws</sup> said: ‘Pray <span class=\"iTxt\">Salāt</span> in it until it is said to you that it is exactly from the dead (animal)’."
          ],
          "en.sarwar": [
            "28. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya from ibn Muskan from al-Flalabiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the slippers that we buy from the market if we can perform Salah (prayer) with them. He (the Imam) said, ‘Perform Salah (prayer) with them until you are told that it exactly is from dead animals.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/321)"
        ],
        "index": 5352,
        "local_index": 29,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:29",
        "text": [
          " يُكْرَهُ الصَّلَاةُ إِلَّا فِي ثَلَاثَةٍ الْخُفِّ وَ الْعِمَامَةِ وَ الْكِسَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, raising it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The <span class=\"iTxt\">Salāt</span> is disliked except in three – the socks, and the turban, and the cloak’."
          ],
          "en.sarwar": [
            "29. A number of our people have narrated from Ahmad ibn Muhammad from who, in a marfu‘ manner has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Performing Salah (prayer) is undesirable except in three items: slippers, turban, and cloak.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/321)"
        ],
        "index": 5353,
        "local_index": 30,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1620",
              "text": "مُحَسِّنِ بْنِ أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/173",
              "text": "ذَكَرَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَسِّنِ بْنِ أَحْمَدَ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:30",
        "text": [
          " قُلْتُ لَهُ أُصَلِّي فِي الْقَلَنْسُوَةِ السَّوْدَاءِ فَقَالَ لَا تُصَلِّ فِيهَا فَإِنَّهَا لِبَاسُ أَهْلِ النَّارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Muhasayn Bin Ahmad, from the one who mentioned it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘Can I pray <span class=\"iTxt\">Salāt</span> in the black cap?’ So he<sup>asws</sup> said: ‘You cannot pray <span class=\"iTxt\">Salāt</span> in it, for it is an apparel of the people of the Fire’."
          ],
          "en.sarwar": [
            "30. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Muhsin ibn Ahmad from those whom he has mentioned who has said the following: “I once asked abu ’Abd Allah, ‘Alayhi al-Salam, if I can perform Salah (prayer) with a black cap. He (the Imam) said, ‘Do not perform Salah (prayer) with it; it is of the clothes of people of the fire.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/322)"
        ],
        "index": 5354,
        "local_index": 31,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/55",
              "text": "عَلِيٌّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/450",
              "text": "سَهْلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/42",
              "text": "بَعْضِ أَصْحَابِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/23",
              "text": "الْحَسَنِ بْنِ الْجَهْمِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيٌّ عَنْ سَهْلٍ عَنْ بَعْضِ أَصْحَابِهِ عَنِ الْحَسَنِ بْنِ الْجَهْمِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:31",
        "text": [
          " قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) أَعْتَرِضُ السُّوقَ فَأَشْتَرِي خُفّاً لَا أَدْرِي أَ ذَكِيٌّ هُوَ أَمْ لَا قَالَ صَلِّ فِيهِ قُلْتُ فَالنَّعْلُ قَالَ مِثْلُ ذَلِكَ قُلْتُ إِنِّي أَضِيقُ مِنْ هَذَا قَالَ أَ تَرْغَبُ عَمَّا كَانَ أَبُو الْحَسَنِ ( عليه السلام ) يَفْعَلُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from Sahl, from one of his companions, from Al Hassan Bin Al Jahm who said, ",
            "‘I said to Abu Al-Hassan<sup>asws</sup>, ‘I see the market display, so I buy socks, not knowing whether it is pure or not’. He<sup>asws</sup> said: ‘You can pray <span class=\"iTxt\">Salāt</span> in it’. I said, ‘So (what about) the slippers?’ He<sup>asws</sup> said: ‘Similar to that’. I said, ‘I am constrained from this’. He<sup>asws</sup> said: ‘Would you turn away from what Abu Al-Hassan<sup>asws</sup> used to do?’"
          ],
          "en.sarwar": [
            "31. Ali has narrated from Sahl ibn Ziyad from certain persons of his people from al-Hassan ibn al-Jahm who has said the following: “I once said to abu al-Hassan, ‘Alayhi al-Salam, that I visit the market and buy a slipper but I do not know if it is from properly slaughtered animal or not. He (the Imam) said, ‘Perform Salah (prayer) with it.’ I then asked, ‘Can I use such shoes?’ He (the Imam) said, ‘It is the same as slippers.’ I then said, ‘I am not comfortable with it.’ He (the Imam) asked, ‘Do you dislike what abu al-Hassan, ‘Alayhi al-Salam, would do?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/322)"
        ],
        "index": 5355,
        "local_index": 32,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/964",
              "text": "مُحَمَّدِ بْنِ أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1218",
              "text": "إِبْرَاهِيمَ بْنِ مَهْزِيَارَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ إِبْرَاهِيمَ بْنِ مَهْزِيَارَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:32",
        "text": [
          " سَأَلْتُهُ عَنِ الصَّلَاةِ فِي جُرْمُوقٍ وَ أَتَيْتُهُ بِجُرْمُوقٍ فَبَعَثْتُ بِهِ إِلَيْهِ فَقَالَ يُصَلَّى فِيهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Ibrahim Bin Mahziyar who said, ",
            "‘I asked him<sup>asws</sup> about the <span class=\"iTxt\">Salāt</span> in a Jurmuq (gaiter – a large slipper), and I came with a gaiter and showed it to him<sup>asws</sup>. So he<sup>asws</sup> said: ‘One can pray <span class=\"iTxt\">Salāt</span> in it’."
          ],
          "en.sarwar": [
            "32. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ibrahim ibn Mahziyar who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about a Jurmuq (a larger slipper worn over another one) if it is permissible to perform Salah (prayer) with it and I showed it to him (the Imam) and he (the Imam) said, ‘It is permissible to perform Salah (prayer) with it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/322)"
        ],
        "index": 5356,
        "local_index": 33,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2389",
              "text": "الْعَمْرَكِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/613",
              "text": "عَلِيِّ بْنِ جَعْفَرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1223",
              "text": "أَخِيهِ أَبِي الْحَسَنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنِ الْعَمْرَكِيِّ عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَخِيهِ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:33",
        "text": [
          " سَأَلْتُهُ عَنْ رَجُلٍ صَلَّى وَ فِي كُمِّهِ طَيْرٌ قَالَ إِنْ خَافَ الذَّهَابَ عَلَيْهِ فَلَا بَأْسَ ",
          "قَالَ وَ سَأَلْتُهُ عَنِ الْخَلَاخِلِ هَلْ يَصْلُحُ لِلنِّسَاءِ وَ الصِّبْيَانِ لُبْسُهَا فَقَالَ إِذَا كَانَتْ صَمَّاءَ فَلَا بَأْسَ وَ إِنْ كَانَتْ لَهَا صَوْتٌ فَلَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Al Amraky, ",
            "(It has been narrated) from Ali<sup>asws</sup> son of Ja’far<sup>asws</sup>, from his brother<sup>asws</sup> Abu Al-Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who prays <span class=\"iTxt\">Salāt</span> and in his sleeve is a bird. He<sup>asws</sup> said: ‘If he fears the fleeing over it, so there is no problem’.",
            "And I asked him<sup>asws</sup> about the anklets, is it correct for the women and the children to wear these?’ So he<sup>asws</sup> said: ‘When these were silent, so there is no problem, and if there was a sound to it, so no’."
          ],
          "en.sarwar": [
            "33. Muhammad ibn Yahya has narrated from al-‘Amrakiy from Ali ibn Ja‘far who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about a man who performed Salah (prayer) with a bird in his sleeve. He (the Imam) said, ‘If he is afraid about it then it is not harmful.’ He (the narrator) has said that he then asked him (the Imam) about anklets if women and children could use them during Salah (prayer). He (the Imam) said, ‘It is not an offense if they are silent, but if they make noise then it is not permissible.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/322)"
        ],
        "index": 5357,
        "local_index": 34,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2687",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي الْفَضْلِ الْمَدَائِنِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/113",
              "text": "حَدَّثَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي الْفَضْلِ الْمَدَائِنِيِّ عَمَّنْ حَدَّثَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:34",
        "text": [
          " لَا يُصَلِّ الرَّجُلُ وَ فِي تِكَّتِهِ مِفْتَاحُ حَدِيدٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Al Fazl Al Madainy, from the one who narrated it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The man cannot pray <span class=\"iTxt\">Salāt</span> and in his waistband are iron keys’."
          ],
          "en.sarwar": [
            "34. Ali ibn Ibrahim has narrated from his father from Ahmad ibn Muhammad from ibn abu al-Fadl al-Mada’iniy from those who narrated to him who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘A man does not perform Salah (prayer) with a waistband which has an iron key.’” "
          ]
        }
      },
      {
        "index": 5358,
        "local_index": 35,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/55",
              "text": "عَلِيٌّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/38",
              "text": "النَّوْفَلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/39",
              "text": "السَّكُونِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيٌّ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:60:35",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَا يُصَلِّ الرَّجُلُ وَ فِي يَدِهِ خَاتَمُ حَدِيدٍ .",
          "وَ رُوِيَ إِذَا كَانَ الْمِفْتَاحُ فِي غِلَافٍ فَلَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The man cannot pray and in his hand is an iron ring’.",
            "And it is reported, ‘(He<sup>asws</sup> said): ‘When the keys were in a wrapping, so there is no problem’."
          ],
          "en.sarwar": [
            "35. Ali has narrated from his father from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah has said, ‘A man does not perform Salah (prayer) wearing an iron ring.’” “It is narrated that if a key is inside cover then it is not an offense.” (Ahadith 1-35 of this chapter are best explained by fatwa.) "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:4:60",
  "kind": "verse_list"
}