{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 64"
        },
        "path": "/books/al-kafi:3:4:64",
        "titles": {
          "ar": "باب صَلَاةِ الشَّيْخِ الْكَبِيرِ وَ الْمَرِيضِ",
          "en": "Chapter 64 – The Salāt of an elderly man and the sick"
        }
      }
    ],
    "index": 731,
    "local_index": 64,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 65"
        },
        "path": "/books/al-kafi:3:4:65",
        "titles": {
          "ar": "باب صَلَاةِ الْمُغْمَى عَلَيْهِ وَ الْمَرِيضِ الَّذِي تَفُوتُهُ الصَّلَاةُ",
          "en": "Chapter 65 – Salāt of the unconscious and the sick who has missed out on the Salāt"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 63"
        },
        "path": "/books/al-kafi:3:4:63",
        "titles": {
          "ar": "باب صَلَاةِ الصِّبْيَانِ وَ مَتَى يُؤْخَذُونَ بِهَا",
          "en": "Chapter 63 – The Salāt of the children, and when they should begin Salāt"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:4:64",
    "titles": {
      "ar": "باب صَلَاةِ الشَّيْخِ الْكَبِيرِ وَ الْمَرِيضِ",
      "en": "Chapter 64 – The Salāt of an elderly man and the sick"
    },
    "verse_count": 13,
    "verse_start_index": 5382,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/332)"
        ],
        "index": 5383,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:64:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَنَانِ بْنِ سَدِيرٍ عَنْ أَبِيهِ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) أَ تُصَلِّي النَّوَافِلَ وَ أَنْتَ قَاعِدٌ فَقَالَ مَا أُصَلِّيهَا إِلَّا وَ أَنَا قَاعِدٌ مُنْذُ حَمَلْتُ هَذَا اللَّحْمَ وَ بَلَغْتُ هَذَا السِّنَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hannan Bin Sadeyr, from his father who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘Are you<sup>asws</sup> praying the optional <span class=\"iTxt\">Salāt</span> while you<sup>asws</sup> are seated?’ So he<sup>asws</sup> said: ‘I<sup>asws</sup> have not prayed it except while seated until after I<sup>asws</sup> have gained this much weight and reaching this age’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Hanan ibn Sadir from his father who has said the following: “I once asked abu Ja’far, ‘Alayhi al-Salam, ’Do you perform optional Salah (prayer) in a sitting position? He (the Imam) replied, ‘I perform them in a sitting position only from the time I have gained this much weight and reached this age.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/332)"
        ],
        "index": 5384,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:64:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قُلْتُ لَهُ إِنَّا نَتَحَدَّثُ نَقُولُ مَنْ صَلَّى وَ هُوَ جَالِسٌ مِنْ غَيْرِ عِلَّةٍ كَانَتْ صَلَاتُهُ رَكْعَتَيْنِ بِرَكْعَةٍ وَ سَجْدَتَيْنِ بِسَجْدَةٍ فَقَالَ لَيْسَ هُوَ هَكَذَا هِيَ تَامَّةٌ لَكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad, from Ali Bin Abu Hamza, from Abu Baseer, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘We are narrating, ‘The one who prays <span class=\"iTxt\">Salāt</span> while he is seated without an illness, his two <span class=\"iTxt\">Rak’at</span> of <span class=\"iTxt\">Salāt</span> would be (counted as) one <span class=\"iTxt\">Rak’at</span>, and two prostrations would be (counted as) one prostration’. So he<sup>asws</sup> said: ‘It is not like this. It is complete for you’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Qasim ibn Muhammad from Ali ibn abu Hamzah from abu Basir who has said the following: “I once said to abu Ja’far, ‘Alayhi al-Salam, that we speak and say that whoever performs Salah (prayer) in a sitting position without good reason, his two Rak’at are counted as one Rak’at and his two Sajdah (prostration) are counted as one Sajdah (prostration). He (the Imam) said, ‘It is not that way. It is complete for you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/333)"
        ],
        "index": 5385,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:64:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ أَنَّهُ سَأَلَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) مَا حَدُّ الْمَرِيضِ الَّذِي يُصَلِّي قَاعِداً فَقَالَ إِنَّ الرَّجُلَ لَيُوعَكُ وَ يَحْرَجُ وَ لَكِنَّهُ هُوَ أَعْلَمُ بِنَفْسِهِ وَ لَكِنْ إِذَا قَوِيَ فَلْيَقُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, ",
            "(It has been narrated) from Jameel Bin Darraj who asked Abu Abdullah<sup>asws</sup>, ‘What is a limit for the sick by which he can pray <span class=\"iTxt\">Salāt</span> seated?’ So he<sup>asws</sup> said: ‘If the man is unwell and is hindered. But, he is more knowing of himself. However, if he is strong enough, so let him stand’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘ Umayr from Jamil ibn Darraj who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who suffers from an illness. In what condition he is allowed to perform Salah (prayer) in a sitting position? He (the Imam) said, ‘A man is unwell and experiences anguish; however, he knows better about himself. When he is able he must stand up.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/333)"
        ],
        "index": 5386,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:64:4",
        "refs": {
          "Quran": [
            "/books/quran:2:173",
            "/books/quran:2:168"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ وَ الْمَرْأَةِ يَذْهَبُ بَصَرُهُ فَيَأْتِيهِ الْأَطِبَّاءُ فَيَقُولُونَ نُدَاوِيكَ شَهْراً أَوْ أَرْبَعِينَ لَيْلَةً مُسْتَلْقِياً كَذَلِكَ يُصَلِّي فَرَخَّصَ فِي ذَلِكَ وَ قَالَ فَمَنِ اضْطُرَّ غَيْرَ باغٍ وَ لا عادٍ فَلا إِثْمَ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Hammad Bin Isa, from Hareyz, from Muhammad Bin Muslim who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man and the woman whose eyesight has gone. So the doctors come over to them and they are saying, ‘We can heal you within a month or forty nights, lying down, it is like that you should be praying <span class=\"iTxt\">Salāt</span>’. So he<sup>asws</sup> permitted them with regards to that and said <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h173\">[2:173]</a> but whoever is driven to necessity, not desiring, nor exceeding the limit, no sin shall be upon him</span>’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Hammad ibn ‘Isa from Hariz from Muhammad ibn Muslim who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man and a woman who lose their eyesight. Physicians say that they can treat them within a month or forty nights while they remain lying down on their back. Can they perform Salah (prayer) in this condition? He (the Imam) gave permission saying, ‘(Permission is granted to) those who are compelled and they are not rebels and transgressors. It is not a sin on them. <a href=\"/#/books/quran:2#h168\">[2:168]</a>’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/333)"
        ],
        "index": 5387,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:64:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الْمَرِيضِ إِذَا لَمْ يَسْتَطِعِ الْقِيَامَ وَ السُّجُودَ قَالَ يُومِئُ بِرَأْسِهِ إِيمَاءً وَ أَنْ يَضَعَ جَبْهَتَهُ عَلَى الْأَرْضِ أَحَبُّ إِلَيَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the sick when he has no capacity for standing, and the <span class=\"iTxt\">Sajdah</span>. He<sup>asws</sup> said: ‘He can gesture by his head, and if he were to place his forehead upon the ground, it would be more beloved to me<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who suffers from an illness and is not able to stand up and perform Sujud (prostrations). He (the Imam) said, ‘He is required to perform his Salah (prayer) by making gestures with his head, and placing his forehead on the ground is lovelier to me.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/334)"
        ],
        "index": 5388,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:64:6",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرٍ رَفَعَهُ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ الْمَرِيضُ يُومِئُ إِيمَاءً ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Abdullah Bin Aamir, raising it, from Jameel Bin Darraj, from Zurara, ",
            "(It has been narrated) from Abu Jafar<sup>asws</sup> having said: ‘The sick would be indicating with gestures’."
          ],
          "en.sarwar": [
            "6. Al-Husayn ibn Muhammad has narrated from ‘Abd Allah ibn ‘Amir in a marfu‘ manner from Jamil ibn Darraj from Zurarah who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘People suffering from illness can make gestures in their Salah (prayer).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/334)"
        ],
        "index": 5389,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:64:7",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ أَبِي نَصْرٍ عَنِ ابْنِ بُكَيْرٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الْمَبْطُونِ فَقَالَ يَبْنِي عَلَى صَلَاتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Ibn Abu Nasr, from Ibn Bukeyr, from Muhammad Bin Muslim who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the one with incontinence.<a id=\"_ftnref1605\"></a><sup>[1605]</sup> So he<sup>asws</sup> said: ‘He would continue upon his <span class=\"iTxt\">Salāt</span>’ (wherever he is that state)."
          ],
          "en.sarwar": [
            "7. Ali ibn Muhammad has narrated from Sahl ibn Ziyad ibn abu Nasr from ibn Bukayr from Muhammad ibn Muslim who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about the case of one who suffers from an internal illness because of which is not able to control anal discharge. He (the Imam) said, ‘He continues his Salah (prayer) wherever in Salah (prayer) he is.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/334)"
        ],
        "index": 5390,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:64:8",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنْ فَضَالَةَ عَنْ أَبَانٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قُلْتُ الرَّجُلُ يُصَلِّي وَ هُوَ قَاعِدٌ فَيَقْرَأُ السُّورَةَ فَإِذَا أَرَادَ أَنْ يَخْتِمَهَا قَامَ فَرَكَعَ بِآخِرِهَا قَالَ صَلَاتُهُ صَلَاةُ الْقَائِمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Abdullah Bin Aamir, from Ali Bin Mahziyar, from Fazalat, from Aban, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, ‘I asked, ‘The man is praying <span class=\"iTxt\">Salāt</span> while he is seated. So he recites the Chapter, and when he intends to end it, he stands, and he performs <span class=\"iTxt\">Rukū</span> at the end of it’. He<sup>asws</sup> said: ‘His <span class=\"iTxt\">Salāt</span> is the <span class=\"iTxt\">Salāt</span> of the standing one’."
          ],
          "en.sarwar": [
            "8. Al-Husayn ibn Muhammad has narrated from ‘Abd Allah ibn ‘Amir from Ali ibn Mahziyar from Fadalah from Aban from Zurarah who has said the following: “I once asked abu Ja’far, ‘Alayhi al-Salam, about a man who performs Salah (prayer) in a sitting position. He recites Surah (chapter). When he wants to complete it he stands up then performs Ruku‘ (bowing down on one’s knees). He (the Imam) said, ‘His Salah (prayer) is like that of the one who performs it in a standing position.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/335)"
        ],
        "index": 5391,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:64:9",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ مُعَاوِيَةَ بْنِ مَيْسَرَةَ أَنَّ سِنَاناً سَأَلَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَمُدُّ فِي الصَّلَاةِ إِحْدَى رِجْلَيْهِ بَيْنَ يَدَيْهِ وَ هُوَ جَالِسٌ قَالَ لَا بَأْسَ وَ لَا أَرَاهُ إِلَّا قَالَ فِي الْمُعْتَلِّ وَ الْمَرِيضِ .",
          "وَ فِي حَدِيثٍ آخَرَ يُصَلِّي مُتَرَبِّعاً وَ مَادّاً رِجْلَيْهِ كُلُّ ذَلِكَ وَاسِعٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Bin A Mugheira, from Muawiya Bin Maysara, ",
            "‘Sinan asked Abu Abdullah<sup>asws</sup> about the man who extend one of his legs in front of him in the <span class=\"iTxt\">Salāt</span> while he is seated. He<sup>asws</sup> said: ‘There is no problem’. And I (Muawiya Bin Maysara) do not see except that he<sup>asws</sup> said (this) regarding the disabled and the sick’.",
            "And in another Hadeeth, ‘(He<sup>asws</sup> said): ‘He can pray <span class=\"iTxt\">Salāt</span> squared and having extended his legs. All of that, there is leeway’."
          ],
          "en.sarwar": [
            "9. Ali ibn Ibrahim has narrated from his father from ‘Abd Allah ibn al-Mughirah from Mu‘awiyah ibn Maysarah who has said the following: “Sinan once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who during Salah (prayer) stretches one of his legs in his front while he is sitting. He (the Imam) said, ‘It is not harmful.’ I do not think except that he (the Imam) said it about one with health problems or illness. In another Hadith it is said that he can perform Salah (prayer) folding his legs in a square shape or stretch them, all of it is permissible.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/335)"
        ],
        "index": 5392,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:64:10",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ سَمَاعَةَ قَالَ سُئِلَ عَنِ الْأَسِيرِ يَأْسِرُهُ الْمُشْرِكُونَ فَتَحْضُرُ الصَّلَاةُ وَ يَمْنَعُهُ الَّذِي أَسَرَهُ مِنْهَا قَالَ يُومِئُ إِيمَاءً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira, from Sama’at who said, ",
            "‘He<sup>asws</sup> was asked about the prisoner of the Polytheists. So the <span class=\"iTxt\">Salāt</span> (time) comes up, but the one who imprisoned him prevents him from it. He<sup>asws</sup> said: ‘He would indicate with gestures’."
          ],
          "en.sarwar": [
            "10. Ali ibn Ibrahim has narrated from his father from ‘Abd Allah ibn al-Mughirah from Sama‘ah who has said the following: “He (the Imam), ‘Alayhi al-Salam, was asked about the captive of the pagans. It becomes time for Salah (prayer) and the captor does not allow him to perform Salah (prayer). He (the Imam) said, ‘He performs Salah (prayer) by making gestures.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/335)"
        ],
        "index": 5393,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:64:11",
        "refs": {
          "Quran": [
            "/books/quran:32:15",
            "/books/quran:3:191"
          ]
        },
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ الَّذِينَ يَذْكُرُونَ اللَّهَ قِياماً وَ قُعُوداً وَ عَلى جُنُوبِهِمْ قَالَ الصَّحِيحُ يُصَلِّي قَائِماً وَ قُعُوداً الْمَرِيضُ يُصَلِّي جَالِساً وَ عَلى جُنُوبِهِمْ الَّذِي يَكُونُ أَضْعَفَ مِنَ الْمَرِيضِ الَّذِي يُصَلِّي جَالِساً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Ibn Mahboub, from Abu Hamza, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h191\">[3:191]</a> Those who remember Allah standing and sitting and lying on their sides</span>. He<sup>asws</sup> said: ‘The healthy would pray <span class=\"iTxt\">Salāt</span> standing, ‘<span class=\"ibTxt\">and sitting</span>’ are the sick praying <span class=\"iTxt\">Salāt</span> seated, and ‘<span class=\"ibTxt\">lying on their sides</span>’ are those who happen to be weaker than the sick who pray <span class=\"iTxt\">Salāt</span> seated’."
          ],
          "en.sarwar": [
            "11. Ali has narrated from his father from ibn Mahbub from abu Hamzah who has said the following: “About the words of Allah, most Majestic, most Glorious, ‘. . . those who speak of Allah, standing, sitting and while lying on their sides. . .’ <a href=\"/#/books/quran:32#h15\">[32:15]</a> abu Ja‘far, ‘Alayhi al-Salam, has said, ‘A healthy person performs Salah (prayer) standing. One suffering from an illness performs Salah (prayer) sitting, and ‘on their sides’ is for one who is weaker than a patient who performs Salah (prayer) in a sitting position.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/336)"
        ],
        "index": 5394,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:64:12",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَمَّنْ حَدَّثَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ يُصَلِّي الْمَرِيضُ قَاعِداً فَإِنْ لَمْ يَقْدِرْ صَلَّى مُسْتَلْقِياً يُكَبِّرُ ثُمَّ يَقْرَأُ فَإِذَا أَرَادَ الرُّكُوعَ غَمَّضَ عَيْنَيْهِ ثُمَّ سَبَّحَ ثُمَّ يَفْتَحُ عَيْنَيْهِ فَيَكُونُ فَتْحُ عَيْنَيْهِ رَفْعَ رَأْسِهِ مِنَ الرُّكُوعِ فَإِذَا أَرَادَ أَنْ يَسْجُدَ غَمَّضَ عَيْنَيْهِ ثُمَّ سَبَّحَ فَإِذَا سَبَّحَ فَتَحَ عَيْنَيْهِ فَيَكُونُ فَتْحُ عَيْنَيْهِ رَفْعَ رَأْسِهِ مِنَ السُّجُودِ ثُمَّ يَتَشَهَّدُ وَ يَنْصَرِفُ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Muhammad Bin Ibrahim, from the one who narrated it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The sick would pray <span class=\"iTxt\">Salāt</span> seated. So if he is not able, he should pray <span class=\"iTxt\">Salāt</span> lying down. He should exclaim Takbīr, then recite. So when he intends the Rukū, he would shut his eyes, then Glorify, then open his eyes, so that the opening of his eyes would be his raising his head from the <span class=\"iTxt\">Rukū</span>. So when he intends to perform <span class=\"iTxt\">Sajdah</span>, he would shut his eyes, then Glorify. So when he has Glorified, he would open his eyes, so that the opening of his eyes would be the raising of his head from the prostrations. Then he should perform <span class=\"iTxt\">Tashahhud</span> and finish’."
          ],
          "en.sarwar": [
            "12. Ali has narrated from his father from those who narrated to him who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘One suffering from an illness performs Salah (prayer) in a sitting position; if one cannot do this also, one does so while lying on one’s back, says Takbir (Allah is great beyond description) then recites. For Ruku‘ (bowing down on one’s knees) closes his eyes, then says Tasbih (Allah is free of all defects), then opens his eyes. Opening one’s eyes is considered standing up from Ruku‘ (bowing down on one’s knees). For Sajdah (prostration) one closes one’s eyes, then says Tasbih (Allah is free of all defects) and then opens one’s eyes which is considered raising one’s head from Sajdah (prostration). Then one says Tashahhud (testimonies of belief) and ends Salah (prayer).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/336)"
        ],
        "index": 5395,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:64:13",
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ أَحْمَدَ بْنِ الْحَسَنِ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ مُصَدِّقِ بْنِ صَدَقَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الْمَرِيضِ أَ يَحِلُّ لَهُ أَنْ يَقُومَ عَلَى فِرَاشِهِ وَ يَسْجُدَ عَلَى الْأَرْضِ قَالَ فَقَالَ إِذَا كَانَ الْفِرَاشُ غَلِيظاً قَدْرَ آجُرَّةٍ أَوْ أَقَلَّ اسْتَقَامَ لَهُ أَنْ يَقُومَ عَلَيْهِ وَ يَسْجُدَ عَلَى الْأَرْضِ وَ إِنْ كَانَ أَكْثَرَ مِنْ ذَلِكَ فَلَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Ahmad, from Ahmad Bin Al Hassan, from Amro Bin Saeed, from Musaddiq Bin Sadaqa, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the sick, is it Permissible for him that he stands upon his furnishing and performs <span class=\"iTxt\">Sajdah</span> upon the ground?’ So he<sup>asws</sup> said: ‘If it was so that the furnishing was thick of the measurement of a brick or less, it would be correct for him that he stands upon it and performs <span class=\"iTxt\">Sajdah</span> upon the ground; and if it was more than that, so no’."
          ],
          "en.sarwar": [
            "13. Ahmad ibn Idris has narrated from Muhammad ibn Ahmad from Ahmad ibn al-Hassan from ‘Amr ibn Sa‘id from Musaddiq ibn Sadaqah who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who suffers from an illness: if it is permissible to stand up on his floor furnishing and perform Sajdah (prostration) on earth. He (the Imam) said, ‘If the furnishing is thick of the size of a brick or less, he can stand up on it and perform Sajdah (prostration) on earth, but if it is more than that, then it is not permissible.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:4:64",
  "kind": "verse_list"
}