{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:3:4", "titles": {"ar": "كِتَابُ الصَّلَاةِ", "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "}}, {"indexed_titles": {"en": "Chapter 65"}, "path": "/books/al-kafi:3:4:65", "titles": {"ar": "باب صَلَاةِ الْمُغْمَى عَلَيْهِ وَ الْمَرِيضِ الَّذِي تَفُوتُهُ الصَّلَاةُ", "en": "Chapter 65 – Salāt of the unconscious and the sick who has missed out on the Salāt"}}], "index": 732, "local_index": 65, "part_type": "Chapter", "path": "/books/al-kafi:3:4:65", "titles": {"ar": "باب صَلَاةِ الْمُغْمَى عَلَيْهِ وَ الْمَرِيضِ الَّذِي تَفُوتُهُ الصَّلَاةُ", "en": "Chapter 65 – Salāt of the unconscious and the sick who has missed out on the Salāt"}, "verse_count": 7, "verse_start_index": 5395, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 5396, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:4:65:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ مُرَازِمٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْمَرِيضِ لَا يَقْدِرُ عَلَى الصَّلَاةِ قَالَ فَقَالَ كُلُّ مَا غَلَبَ اللَّهُ عَلَيْهِ فَاللَّهُ أَوْلَى بِالْعُذْرِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Hadeed, from Murazim who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about the sick not being able upon the <span class=\"iTxt\">Salāt</span>. He<sup>asws</sup> said: ‘Every one whom Allah<sup>azwj</sup> has Overcome upon, so Allah<sup>azwj</sup> is the closest with the Excusing’."]}}, {"index": 5397, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:4:65:2", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَجَّالِ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ مَعْمَرِ بْنِ عُمَرَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الْمَرِيضِ يَقْضِي الصَّلَاةَ إِذَا أُغْمِيَ عَلَيْهِ فَقَالَ لَا ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hajjal, from Sa’alba Bin Maymoun, from Ma’mar Bin Umar who said, ", "‘I asked Abu Ja’far<sup>asws</sup> about the sick one, Does he have to fulfil the lapse <span class=\"iTxt\">Salāt</span>s when he was unconscious?’ He<sup>asws</sup> said: ‘No’."]}}, {"index": 5398, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:4:65:3", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ إِبْرَاهِيمَ الْخَزَّازِ أَبِي أَيُّوبَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ أُغْمِيَ عَلَيْهِ أَيَّاماً لَمْ يُصَلِّ ثُمَّ أَفَاقَ أَ يُصَلِّي مَا فَاتَهُ قَالَ لَا شَيْ‏ءَ عَلَيْهِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Ibrahim Al Khazzaz Abu Ayoub, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who was unconscious for days, not having prayed <span class=\"iTxt\">Salāt</span>. Then he awakes. Does he have to pray the <span class=\"iTxt\">Salāt</span>s which he missed out on?’ He<sup>asws</sup> said: ‘There is nothing upon him’."]}}, {"index": 5399, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:3:4:65:4", "text": ["عَلِيُّ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ أَبِي بَصِيرٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ سَأَلْتُهُ عَنِ الْمَرِيضِ يُغْمَى عَلَيْهِ ثُمَّ يُفِيقُ كَيْفَ يَقْضِي صَلَاتَهُ قَالَ يَقْضِي الصَّلَاةَ الَّتِي أَدْرَكَ وَقْتَهَا ."], "translations": {"en.hubeali": ["Ali Bin Muhammad, and Muhammad Bin Al Hassan, from Sahl Bin Ziyad, from Ibn Mahboub, from Ibn Raib, from Abu Baseer, ", "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>), said, ‘I asked him<sup>asws</sup> about the sick one who was unconscious. Then he awoke. How would he fulfil his (missed out) <span class=\"iTxt\">Salāts</span>?’ He<sup>asws</sup> said: ‘He would only fulfil the <span class=\"iTxt\">Salāt</span> at the time for which he became conscious’."]}}, {"index": 5400, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:3:4:65:5", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قُلْتُ لَهُ رَجُلٌ مَرِضَ فَتَرَكَ النَّافِلَةَ فَقَالَ يَا مُحَمَّدُ لَيْسَتْ بِفَرِيضَةٍ إِنْ قَضَاهَا فَهُوَ خَيْرٌ يَفْعَلُهُ وَ إِنْ لَمْ يَفْعَلْ فَلَا شَيْ‏ءَ عَلَيْهِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Hammad, from Hareyz Bin Muslim who said, ", "‘I said to him<sup>asws</sup>, ‘A man is sick, so he leaves the optional (<span class=\"iTxt\">Salāt</span>s)’. So he<sup>asws</sup> said: ‘O Muhammad! It is not an Obligation that he should be fulfilling it. If it better if he does it, but if he does not do it, so there is nothing upon him’."]}}, {"index": 5401, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:3:4:65:6", "text": ["جَمَاعَةٌ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ صَفْوَانَ عَنِ الْعِيصِ بْنِ الْقَاسِمِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ اجْتَمَعَ عَلَيْهِ صَلَاةُ السَّنَةِ مِنْ مَرَضٍ قَالَ لَا يَقْضِي ."], "translations": {"en.hubeali": ["A group, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Safwan, from Al Ays Bin Al Qasim who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about a man upon whom the (lapse) Sunnah <span class=\"iTxt\">Salāt</span>s have been accumulated due to illness’. He<sup>asws</sup> said: ‘He would not (need to) fulfil’."]}}, {"index": 5402, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:3:4:65:7", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ فِي الْمُغْمَى عَلَيْهِ قَالَ مَا غَلَبَ اللَّهُ عَلَيْهِ فَاللَّهُ أَوْلَى بِالْعُذْرِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father and Muhammad Bin Ismail, from Al Fazl Bin Sh<span class=\"iTxt\">Azaan</span>, altogether from Ibn Abu Umeyr, from Hafs Bin Al Bakhtary, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, ‘I heard him<sup>asws</sup> saying regarding the unconscious: ‘What Allah<sup>azwj</sup> has Caused to overcome upon him, so Allah<sup>azwj</sup> is the closest with the Excusing’."]}}]}, "index": "al-kafi:3:4:65", "kind": "verse_list"}