{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:3:4", "titles": {"ar": "كِتَابُ الصَّلَاةِ", "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "}}, {"indexed_titles": {"en": "Chapter 70"}, "path": "/books/al-kafi:3:4:70", "titles": {"ar": "باب تَهْيِئَةِ الْإِمَامِ لِلْجُمُعَةِ وَ خُطْبَتِهِ وَ الْإِنْصَاتِ", "en": "Chapter 70 – The preparation of the prayer leader, and his sermon and the listening (to it)"}}], "index": 737, "local_index": 70, "part_type": "Chapter", "path": "/books/al-kafi:3:4:70", "titles": {"ar": "باب تَهْيِئَةِ الْإِمَامِ لِلْجُمُعَةِ وَ خُطْبَتِهِ وَ الْإِنْصَاتِ", "en": "Chapter 70 – The preparation of the prayer leader, and his sermon and the listening (to it)"}, "verse_count": 9, "verse_start_index": 5437, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 5438, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:4:70:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ وَ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَنْبَغِي لِلْإِمَامِ الَّذِي يَخْطُبُ النَّاسَ يَوْمَ الْجُمُعَةِ أَنْ يَلْبَسَ عِمَامَةً فِي الشِّتَاءِ وَ الصَّيْفِ وَ يَتَرَدَّى بِبُرْدٍ يَمَنِيٍّ أَوْ عَدَنِيٍّ وَ يَخْطُبَ وَ هُوَ قَائِمٌ يَحْمَدُ اللَّهَ وَ يُثْنِي عَلَيْهِ ثُمَّ يُوصِي بِتَقْوَى اللَّهِ وَ يَقْرَأُ سُورَةً مِنَ الْقُرْآنِ صَغِيرَةً ثُمَّ يَجْلِسُ", "ثُمَّ يَقُومُ فَيَحْمَدُ اللَّهَ وَ يُثْنِي عَلَيْهِ وَ يُصَلِّي عَلَى مُحَمَّدٍ ( صلى الله عليه وآله ) وَ عَلَى أَئِمَّةِ الْمُسْلِمِينَ وَ يَسْتَغْفِرُ لِلْمُؤْمِنِينَ وَ الْمُؤْمِنَاتِ فَإِذَا فَرَغَ مِنْ هَذَا أَقَامَ الْمُؤَذِّنُ فَصَلَّى بِالنَّاسِ رَكْعَتَيْنِ يَقْرَأُ فِي الْأُولَى بِسُورَةِ الْجُمُعَةِ وَ فِي الثَّانِيَةِ بِسُورَةِ الْمُنَافِقِين."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Al Husayn, and Ahmad Bin Muhammad, altogether from Usman Bin Isa, from Sama’at who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘It is befitting for the prayer leader who addresses the people on the day of Friday that he wears a turban during the winter and the summer, and he should wear either a Yemeni or an Adeny cloak, and he should address while he is standing. He should Praise Allah<sup>azwj</sup> and Laud upon Him<sup>azwj</sup>. Then he should advise with the fearing of Allah<sup>azwj</sup>, and he should recite a short Chapter from the Quran. Then he should be seated. ", "Then he should be standing, so he should Praise Allah<sup>azwj</sup> and Laud upon Him<sup>azwj</sup>, and send Blessings upon Muhammad<sup>saww</sup> and upon Imams<sup>asws</sup> of the Muslims, and he should seek Forgiveness for the believing men and the believing women. So when he is free from this, the <span class=\"iTxt\">Muezzin</span> should stand, and he (the prayer leader) should pray <span class=\"iTxt\">Salāt</span> with the people (leading them) in two <span class=\"iTxt\">Rak’at</span>. He should recite in the first with Surah Al-Jummah (Chapter 62), and in the second (<span class=\"iTxt\">Rak’at</span>) with Surah Al-Munafiqeen (Chapter 63)’."]}}, {"index": 5439, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:4:70:2", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ الْعَلَاءِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا خَطَبَ الْإِمَامُ يَوْمَ الْجُمُعَةِ فَلَا يَنْبَغِي لِأَحَدٍ أَنْ يَتَكَلَّمَ حَتَّى يَفْرُغَ الْإِمَامُ مِنْ خُطْبَتِهِ وَ إِذَا فَرَغَ الْإِمَامُ مِنَ الْخُطْبَتَيْنِ تَكَلَّمَ مَا بَيْنَهُ وَ بَيْنَ أَنْ تُقَامَ الصَّلَاةُ فَإِنْ سَمِعَ الْقِرَاءَةَ أَوْ لَمْ يَسْمَعْ أَجْزَأَهُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Safwan Bin Yahya, from Al A’ala, from Muhammad Bin Muslim, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the prayer leader addresses on the day of Friday, so it is not befitting for anyone that he speaks until the prayer leader is free from his sermon; and when the prayer leader is free from the two sermons, so you can speak in what is between it and the establishment of the <span class=\"iTxt\">Salāt</span>. So whether you can hear the recitation or cannot hear, it would suffice’."]}}, {"index": 5440, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:4:70:3", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ أَبِي مَرْيَمَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ خُطْبَةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) أَ قَبْلَ الصَّلَاةِ أَوْ بَعْدُ فَقَالَ قَبْلَ الصَّلَاةِ يَخْطُبُ ثُمَّ يُصَلِّي ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Abdullah Bin Aamir, from Ali Bin Mahziyar, from Usman Bin Isa, ", "(It has been narrated) from Abu Maryam, from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the sermon of Rasool-Allah<sup>saww</sup>, was it before the <span class=\"iTxt\">Salāt</span> or after it?’ So he<sup>asws</sup> said: ‘Before the <span class=\"iTxt\">Salāt</span>’. He<sup>saww</sup> addressed, then he prayed <span class=\"iTxt\">Salāt</span>’."]}}, {"index": 5441, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:3:4:70:4", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الصَّلَاةِ يَوْمَ الْجُمُعَةِ فَقَالَ أَمَّا مَعَ الْإِمَامِ فَرَكْعَتَانِ وَ أَمَّا مَنْ يُصَلِّي وَحْدَهُ فَهِيَ أَرْبَعُ رَكَعَاتٍ بِمَنْزِلَةِ الظُّهْرِ يَعْنِي إِذَا كَانَ إِمَامٌ يَخْطُبُ فَأَمَّا إِذَا لَمْ يَكُنْ إِمَامٌ يَخْطُبُ فَهِيَ أَرْبَعُ رَكَعَاتٍ وَ إِنْ صَلَّوْا جَمَاعَةً ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Usman Bin Isa, from Sama’at who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about the <span class=\"iTxt\">Salāt</span> on the day of Friday. So he<sup>asws</sup> said: ‘As for with the prayer leader, so it is of two <span class=\"iTxt\">Rak’at</span>, and as for the one who prays alone, so it is four <span class=\"iTxt\">Rak’at</span>, at the status of Al-Zohr – meaning when there was a prayer leader addressing. So as for when there does not happen to be a prayer leader addressing, so it is of four <span class=\"iTxt\">Rak’at</span>, and even if they are praying in a <span class=\"iTxt\">Jam’at</span>’."]}}, {"index": 5442, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:3:4:70:5", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ يَحْيَى الْخَزَّازِ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ جَعْفَرٍ عَنْ أَبِيهِ ( عليه السلام ) قَالَ الْأَذَانُ الثَّالِثُ يَوْمَ الْجُمُعَةِ بِدْعَةٌ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Yahya Al Khazzaz, from Hafs Bin Giyas, ", "(It has been narrated) from Ja’far<sup>asws</sup>, from his<sup>asws</sup> father<sup>asws</sup> having said: ‘The third <span class=\"iTxt\">Azan</span> on the day of Friday is an innovation’."]}}, {"index": 5443, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:3:4:70:6", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنْ بُرَيْدِ بْنِ مُعَاوِيَةَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي خُطْبَةِ يَوْمِ الْجُمُعَةِ الْخُطْبَةُ الْأُولَى الْحَمْدُ لِلَّهِ نَحْمَدُهُ وَ نَسْتَعِينُهُ وَ نَسْتَغْفِرُهُ وَ نَسْتَهْدِيهِ وَ نَعُوذُ بِاللَّهِ مِنْ شُرُورِ أَنْفُسِنَا وَ مِنْ سَيِّئَاتِ أَعْمَالِنَا مَنْ يَهْدِي اللَّهُ فَلَا مُضِلَّ لَهُ وَ مَنْ يُضْلِلْ فَلَا هَادِيَ لَهُ", "وَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ انْتَجَبَهُ لِوَلَايَتِهِ وَ اخْتَصَّهُ بِرِسَالَتِهِ وَ أَكْرَمَهُ بِالنُّبُوَّةِ أَمِيناً عَلَى غَيْبِهِ وَ رَحْمَةً لِلْعَالَمِينَ وَ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ آلِهِ وَ عَلَيْهِمُ السَّلَامُ", "أُوصِيكُمْ عِبَادَ اللَّهِ بِتَقْوَى اللَّهِ وَ أُخَوِّفُكُمْ مِنْ عِقَابِهِ فَإِنَّ اللَّهَ يُنْجِي مَنِ اتَّقَاهُ بِمَفَازَتِهِمْ لَا يَمَسُّهُمُ السُّوءُ وَ لَا هُمْ يَحْزَنُونَ وَ يُكْرِمُ مَنْ خَافَهُ يَقِيهِمْ شَرَّ مَا خَافُوا وَ يُلَقِّيهِمْ نَضْرَةً وَ سُرُوراً", "وَ أُرَغِّبُكُمْ فِي كَرَامَةِ اللَّهِ الدَّائِمَةِ وَ أُخَوِّفُكُمْ عِقَابَهُ الَّذِي لَا انْقِطَاعَ لَهُ وَ لَا نَجَاةَ لِمَنِ اسْتَوْجَبَهُ فَلَا تَغُرَّنَّكُمُ الدُّنْيَا وَ لَا تَرْكَنُوا إِلَيْهَا فَإِنَّهَا دَارُ غُرُورٍ كَتَبَ اللَّهُ عَلَيْهَا وَ عَلَى أَهْلِهَا الْفَنَاءَ فَتَزَوَّدُوا مِنْهَا الَّذِي أَكْرَمَكُمُ اللَّهُ بِهِ مِنَ التَّقْوَى وَ الْعَمَلِ الصَّالِحِ فَإِنَّهُ لَا يَصِلُ إِلَى اللَّهِ مِنْ أَعْمَالِ الْعِبَادِ إِلَّا مَا خَلَصَ مِنْهَا وَ لَا يَتَقَبَّلُ اللَّهُ إِلَّا مِنَ الْمُتَّقِينَ", "وَ قَدْ أَخْبَرَكُمُ اللَّهُ عَنْ مَنَازِلِ مَنْ آمَنَ وَ عَمِلَ صَالِحاً وَ عَنْ مَنَازِلِ مَنْ كَفَرَ وَ عَمِلَ فِي غَيْرِ سَبِيلِهِ وَ قَالَ ذلِكَ يَوْمٌ مَجْمُوعٌ لَهُ النَّاسُ وَ ذلِكَ يَوْمٌ مَشْهُودٌ. وَ ما نُؤَخِّرُهُ إِلَّا لِأَجَلٍ مَعْدُودٍ. يَوْمَ يَأْتِ لا تَكَلَّمُ نَفْسٌ إِلَّا بِإِذْنِهِ فَمِنْهُمْ شَقِيٌّ وَ سَعِيدٌ. فَأَمَّا الَّذِينَ شَقُوا فَفِي النَّارِ لَهُمْ فِيها زَفِيرٌ وَ شَهِيقٌ. خالِدِينَ فِيها ما دامَتِ السَّماواتُ وَ الْأَرْضُ إِلَّا ما شاءَ رَبُّكَ إِنَّ رَبَّكَ فَعَّالٌ لِما يُرِيدُ. وَ أَمَّا الَّذِينَ سُعِدُوا فَفِي الْجَنَّةِ خالِدِينَ فِيها ما دامَتِ السَّماواتُ وَ الْأَرْضُ إِلَّا ما شاءَ رَبُّكَ عَطاءً غَيْرَ مَجْذُوذٍ", "نَسْأَلُ اللَّهَ الَّذِي جَمَعَنَا لِهَذَا الْجَمْعِ أَنْ يُبَارِكَ لَنَا فِي يَوْمِنَا هَذَا وَ أَنْ يَرْحَمَنَا جَمِيعاً إِنَّهُ عَلَى كُلِّ شَيْ‏ءٍ قَدِيرٌ إِنَّ كِتَابَ اللَّهِ أَصْدَقُ الْحَدِيثِ وَ أَحْسَنُ الْقِصَصِ وَ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ إِذا قُرِئَ الْقُرْآنُ فَاسْتَمِعُوا لَهُ وَ أَنْصِتُوا لَعَلَّكُمْ تُرْحَمُونَ فَاسْمَعُوا طَاعَةَ اللَّهِ وَ أَنْصِتُوا ابْتِغَاءَ رَحْمَتِهِ ", "ثُمَّ اقْرَأْ سُورَةً مِنَ الْقُرْآنِ وَ ادْعُ رَبَّكَ وَ صَلِّ عَلَى النَّبِيِّ ( صلى الله عليه وآله ) وَ ادْعُ لِلْمُؤْمِنِينَ وَ الْمُؤْمِنَاتِ ثُمَّ تَجْلِسُ قَدْرَ مَا تَمَكَّنُ هُنَيْهَةً ثُمَّ تَقُومُ فَتَقُولُ الْحَمْدُ لِلَّهِ نَحْمَدُهُ وَ نَسْتَعِينُهُ وَ نَسْتَغْفِرُهُ وَ نَسْتَهْدِيهِ وَ نُؤْمِنُ بِهِ وَ نَتَوَكَّلُ عَلَيْهِ وَ نَعُوذُ بِاللَّهِ مِنْ شُرُورِ أَنْفُسِنَا وَ مِنْ سَيِّئَاتِ أَعْمَالِنَا", "مَنْ يَهْدِي اللَّهُ فَلَا مُضِلَّ لَهُ وَ مَنْ يُضْلِلْ فَلَا هَادِيَ لَهُ وَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَشْهَدُ أَنْ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ أَرْسَلَهُ بِالْهُدَى وَ دِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَ لَوْ كَرِهَ الْمُشْرِكُونَ وَ جَعَلَهُ رَحْمَةً لِلْعَالَمِينَ بَشِيراً وَ نَذِيراً وَ دَاعِياً إِلَى اللَّهِ بِإِذْنِهِ وَ سِرَاجاً مُنِيراً مَنْ يُطِعِ اللَّهَ وَ رَسُولَهُ فَقَدْ رَشَدَ وَ مَنْ يَعْصِهِمَا فَقَدْ غَوَى", "أُوصِيكُمْ عِبَادَ اللَّهِ بِتَقْوَى اللَّهِ الَّذِي يَنْفَعُ بِطَاعَتِهِ مَنْ أَطَاعَهُ وَ الَّذِي يَضُرُّ بِمَعْصِيَتِهِ مَنْ عَصَاهُ الَّذِي إِلَيْهِ مَعَادُكُمْ وَ عَلَيْهِ حِسَابُكُمْ فَإِنَّ التَّقْوَى وَصِيَّةُ اللَّهِ فِيكُمْ وَ فِي الَّذِينَ مِنْ قَبْلِكُمْ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ لَقَدْ وَصَّيْنَا الَّذِينَ أُوتُوا الْكِتابَ مِنْ قَبْلِكُمْ وَ إِيَّاكُمْ أَنِ اتَّقُوا اللَّهَ وَ إِنْ تَكْفُرُوا فَإِنَّ لِلَّهِ ما فِي السَّماواتِ وَ ما فِي الْأَرْضِ وَ كانَ اللَّهُ غَنِيًّا حَمِيداً", "انْتَفِعُوا بِمَوْعِظَةِ اللَّهِ وَ الْزَمُوا كِتَابَهُ فَإِنَّهُ أَبْلَغُ الْمَوْعِظَةِ وَ خَيْرُ الْأُمُورِ فِي الْمَعَادِ عَاقِبَةً وَ لَقَدِ اتَّخَذَ اللَّهُ الْحُجَّةَ فَلَا يَهْلِكُ مَنْ هَلَكَ إِلَّا عَنْ بَيِّنَةٍ وَ لَا يَحْيَى مَنْ حَيَّ إِلَّا عَنْ بَيِّنَةٍ وَ قَدْ بَلَّغَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الَّذِي أُرْسِلَ بِهِ فَالْزَمُوا وَصِيَّتَهُ وَ مَا تَرَكَ فِيكُمْ مِنْ بَعْدِهِ مِنَ الثَّقَلَيْنِ كِتَابِ اللَّهِ وَ أَهْلِ بَيْتِهِ اللَّذَيْنِ لَا يَضِلُّ مَنْ تَمَسَّكَ بِهِمَا وَ لَا يَهْتَدِي مَنْ تَرَكَهُمَا", "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ عَبْدِكَ وَ رَسُولِكَ سَيِّدِ الْمُرْسَلِينَ وَ إِمَامِ الْمُتَّقِينَ وَ رَسُولِ رَبِّ الْعَالَمِينَ", "ثُمَّ تَقُولُ اللَّهُمَّ صَلِّ عَلَى أَمِيرِ الْمُؤْمِنِينَ وَ وَصِيِّ رَسُولِ رَبِّ الْعَالَمِينَ ثُمَّ تُسَمِّي الْأَئِمَّةَ حَتَّى تَنْتَهِيَ إِلَى صَاحِبِكَ ثُمَّ تَقُولُ افْتَحْ لَهُ فَتْحاً يَسِيراً وَ انْصُرْهُ نَصْراً عَزِيزاً اللَّهُمَّ أَظْهِرْ بِهِ دِينَكَ وَ سُنَّةَ نَبِيِّكَ حَتَّى لَا يَسْتَخْفِيَ بِشَيْ‏ءٍ مِنَ الْحَقِّ مَخَافَةَ أَحَدٍ مِنَ الْخَلْقِ", "اللَّهُمَّ إِنَّا نَرْغَبُ إِلَيْكَ فِي دَوْلَةٍ كَرِيمَةٍ تُعِزُّ بِهَا الْإِسْلَامَ وَ أَهْلَهُ وَ تُذِلُّ بِهَا النِّفَاقَ وَ أَهْلَهُ وَ تَجْعَلُنَا فِيهَا مِنَ الدُّعَاةِ إِلَى طَاعَتِكَ وَ الْقَادَةِ فِي سَبِيلِكَ وَ تَرْزُقُنَا بِهَا كَرَامَةَ الدُّنْيَا وَ الْآخِرَةِ اللَّهُمَّ مَا حَمَّلْتَنَا مِنَ الْحَقِّ فَعَرِّفْنَاهُ وَ مَا قَصُرْنَا عَنْهُ فَعَلِّمْنَاهُ", "ثُمَّ يَدْعُو اللَّهَ عَلَى عَدُوِّهِ وَ يَسْأَلُ لِنَفْسِهِ وَ أَصْحَابِهِ ثُمَّ يَرْفَعُونَ أَيْدِيَهُمْ فَيَسْأَلُونَ اللَّهَ حَوَائِجَهُمْ كُلَّهَا حَتَّى إِذَا فَرَغَ مِنْ ذَلِكَ قَالَ اللَّهُمَّ اسْتَجِبْ لَنَا وَ يَكُونُ آخِرَ كَلَامِهِ أَنْ يَقُولَ إِنَّ اللَّهَ يَأْمُرُ بِالْعَدْلِ وَ الْإِحْسَانِ وَ إِيتَاءِ ذِي الْقُرْبَى وَ يَنْهَى عَنِ الْفَحْشَاءِ وَ الْمُنْكَرِ وَ الْبَغْيِ يَعِظُكُمْ لَعَلَّكُمْ تَذَكَّرُونَ ", "ثُمَّ يَقُولُ اللَّهُمَّ اجْعَلْنَا مِمَّنْ تَذَكَّرَ فَتَنْفَعُهُ الذِّكْرَى ثُمَّ يَنْزِلُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Yahya Al Halby, from Bureyd Bin Muawiya, from Muhammad Bin Muslim, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup>: ‘Regarding a sermon on the day of Friday, the first sermon – The Praise is for Allah<sup>azwj</sup>. We Praise Him<sup>azwj</sup>, and seek His<sup>azwj</sup> Assistance, and we seek His<sup>azwj</sup> Forgiveness, and seek His<sup>azwj</sup> Guidance, and we seek Refuge with Allah<sup>azwj</sup> from the evils of ourselves and from the sinfulness of our deeds. The one whom Allah<sup>azwj</sup> Guides, so there is no one to misguide him, and the one whom Allah<sup>azwj</sup> Lets to stray, so there is no guide for him. ", "And I testify that there is no god except for Allah<sup>azwj</sup> Alone, there being no associates for Him<sup>azwj</sup>; and I testify that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Rasool<sup>saww</sup>, having Chosen him<sup>saww</sup> for His<sup>azwj</sup> Wilayah, and Specialised him<sup>saww</sup> with His<sup>azwj</sup> Message, and Honoured him<sup>saww</sup> with the Prophet-hood, being a trustee upon His<sup>azwj</sup> Hidden matters, and a mercy for the worlds. And Blessings be upon Muhammad<sup>saww</sup> and his<sup>saww</sup> Progeny<sup>asws</sup>, and greetings be upon them<sup>asws</sup>. ", "I hereby advise you, servants of Allah<sup>azwj</sup>, and caution you from His<sup>azwj</sup> Retribution, for if Allah<sup>azwj</sup> was to Emancipate someone with their<sup>asws</sup> places of salvation, neither would the evil touch them nor would they be grieving, and He<sup>azwj</sup> would Honour the ones who fear Him<sup>azwj</sup> by Saving them from the evil of what they are fearing and Cast upon them the freshness and cheerfulness. ", "And I hereby encourage you regarding the eternal Benevolence of Allah<sup>azwj</sup> and I warn you of His<sup>azwj</sup> Retribution there being no interruption for it, nor a salvation for the one whom it is Obligated upon. So neither let the world deceive you nor incline towards it, for it is a house of deception. Allah<sup>azwj</sup> has Ordained destruction up it and upon its inhabitants. Thus, you should take such provisions from it which would make you be Honoured by Allah<sup>azwj</sup> with, from the piety and the righteous deeds, for nothing arrives to Allah<sup>azwj</sup> from the deeds of the servant except for what is sincere from it, nor does Allah<sup>azwj</sup> Accept except from the pious. ", "And Allah<sup>azwj</sup> has Informed you about the status of the one who believe and does righteous deeds, and about the status of the one who denies and works in other than His<sup>azwj</sup> Way <span class=\"ibTxt\">[11:103] this is a day on which the people shall be gathered together and this is a day that shall be witnessed [11:104] And We do not Delay it but to an appointed term [11:105] On the Day when it shall come, no soul shall speak except by His Permission, then (some) of them shall be miserable and (others) happy [11:106] So as to those who are miserable, they shall be in the Fire; for them shall be sighing and groaning in it [11:107] Abiding therein so long as the skies and the earth endure, except what your Lord so Desires; surely your Lord Does whatsoever He Wants to [11:108] And as to those who are made happy, they shall be in the garden, abiding in it for as long as the skies and the earth endure, except what your Lord so desires; a gift which shall never be cut off</span>.", "We hereby ask Allah<sup>azwj</sup> Who Gathered us for this gathering that He<sup>azwj</sup> Blesses us in this day of ours, and that He<sup>azwj</sup> should be Merciful upon us all, He<sup>azwj</sup> being Able upon everything. The Book of Allah<sup>azwj</sup> is the most Truthful of the Hadeeth, and the best of the stories. And Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\">[7:204] And when the Quran is recited, then listen to it and remain silent, perhaps Mercy may be Shown to you</span>. Thus listening is obedience to Allah<sup>azwj</sup> and remaining silent is seeking His<sup>azwj</sup> Mercy.", "Then recite a Chapter from the Quran and supplicate to your Lord<sup>azwj</sup> and send Blessings upon the Prophet<sup>saww</sup>, and supplicate for the believing men and the believing women. Then be seated for a while. Then you should be standing and saying, ‘The Praise is for Allah<sup>azwj</sup>. We Praise Him<sup>azwj</sup> and seek His<sup>azwj</sup> Assistance, and we seek His<sup>azwj</sup> Forgiveness, and we seek His<sup>azwj</sup> Guidance, and we believe in Him<sup>azwj</sup>, and we Rely upon Him<sup>azwj</sup>, and we seek Refuge with Allah<sup>azwj</sup> from our own evils, and from the evilness of our deeds. ", "The one whom Allah<sup>azwj</sup> Guides so there is no straying for him, and the one whom He<sup>azwj</sup> Lets to stray so there is no guide for him. And I testify that there is no god except for Allah<sup>azwj</sup>, Alone, there being no associate for Him. And I testify that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Rasool<sup>saww</sup><span class=\"ibTxt\"> [9:33] He it is Who sent His Rasool with the Guidance and the Religion of the Truth, in order to prevail it over all Religions, even though the Polytheists may be averse to it</span>, and Made him<sup>saww</sup> as a mercy for the worlds, a heralder of glad tidings and a warner, and an inviter to Allah<sup>azwj</sup> by His<sup>azwj</sup> Permission, and as a radiant lantern. The one who obeys Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup> so he has been Guided, and the one who disobeys them both, so he has strayed.", "I hereby advise you, servants of Allah<sup>azwj</sup>, with the fear of Allah<sup>azwj</sup>. They will benefit, the ones who obey Him<sup>azwj</sup>, and they will be harmed, the ones who disobey Him<sup>azwj</sup>. To Him<sup>azwj</sup> is your return and upon Him<sup>azwj</sup> is your Reckoning, for the piety is an Advice of Allah<sup>azwj</sup> among you and among those who were before you. Allah<sup>azwj</sup> Mighty and Majestic Says <span class=\"ibTxt\">[4:131] and certainly We Enjoined those who were Given the Book before you and (We Enjoin) you too that you should be fear Allah; and if you disbelieve, then surely whatever is in the skies and whatever is in the earth is Allah's and Allah is Self-sufficient, Praise-worthy</span>", "Benefit yourselves with the Advice of Allah<sup>azwj</sup> and necessitate His<sup>azwj</sup> Book, for it is the most eloquent of the Advice, and the best of the Instruction regarding the consequential return. And Allah<sup>azwj</sup> has Taken the argument, so the one being destroyed would not be destroyed except from proof, nor would a living one live except from proof, and Rasool-Allah<sup>saww</sup> had preached that which he<sup>saww</sup> had been Sent with. Therefore, necessitate his<sup>saww</sup> Advice, and whoever from among you all after him<sup>saww</sup>, neglects the two weighty things – the Book of Allah<sup>azwj</sup> and the People<sup>asws</sup> of his<sup>saww</sup> Household, these two, none would stray if he were to attach himself to these two, nor will he be guided the one who neglects these two.", "O Allah<sup>azwj</sup>! Send Blessings upon Muhammad<sup>saww</sup>, Your<sup>azwj</sup> servant and Your<sup>azwj</sup> Rasool<sup>saww</sup>, the chief of the Rasools<sup>sa</sup>, and the Imam<sup>asws</sup> of the pious, and a Rasool<sup>saww</sup> of the Lord<sup>azwj</sup> of the worlds’. ", "Then you should be saying, O Allah<sup>azwj</sup>! Send Blessings upon Amir Al-Momineen<sup>asws</sup>, and a successor<sup>asws</sup> of Rasool<sup>saww</sup> of the Lord<sup>azwj</sup> of the worlds’. Then you should name the Imams<sup>asws</sup> until you end up to your Master<sup>asws</sup>. Then you should be saying, ‘Grant victory to him<sup>asws</sup> an easy victory and Help him<sup>asws</sup> with a mighty Help. O Allah<sup>azwj</sup>! Overcome (the other religions) by him<sup>asws</sup> Your<sup>azwj</sup> Religion, and the Sunnah of Your<sup>azwj</sup> Prophet<sup>saww</sup> until there does not remain anything concealed from the truth out of fear of anyone from the people. ", "O Allah<sup>azwj</sup>! We wish to You<sup>azwj</sup> regarding the benevolent government to strengthen by it Al-Islam and its people, and to humiliate by it the hypocrisy and its people, and Make us in it to be from the ones who invite to Your<sup>azwj</sup> obedience, and leaders in Your<sup>azwj</sup> Way, and Grace us by it the prestige of the world and the Hereafter. O Allah<sup>azwj</sup>! Whatever You<sup>azwj</sup> Have Loaded us with from the truth, so Make us to understand it, and whatever we are deficient from it, so Teach us it’. ", "Then he (the prayer leader) should supplicate to Allah<sup>azwj</sup> against His<sup>azwj</sup> enemies, and he should ask for himself and his companions. Then they (the people) should be raising their hands, so they should be asking Allah<sup>azwj</sup> for their needs, all of them, until when they are free from that, he should say, ‘O Allah<sup>azwj</sup>! Answer us!’, and it should happen to be the last of his speech that he should be saying <span class=\"ibTxt\">[16:90] Surely Allah Enjoins the doing of justice and the doing of good (to others) and the giving to the near of kin, and He Forbids the immorality and the evil and the rebellion; He Admonishes you that you may be mindful</span>’.", "Then he should be saying, ‘O Allah<sup>azwj</sup>! Make us to be from the ones who are mindful so the Reminder benefitted him’. Then you should descend (end the sermon)’."]}}, {"index": 5444, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:3:4:70:7", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُهُ عَنِ الْجُمُعَةِ فَقَالَ بِأَذَانٍ وَ إِقَامَةٍ يَخْرُجُ الْإِمَامُ بَعْدَ الْأَذَانِ فَيَصْعَدُ الْمِنْبَرَ وَ يَخْطُبُ لَا يُصَلِّي النَّاسُ مَا دَامَ الْإِمَامُ عَلَى الْمِنْبَرِ ثُمَّ يَقْعُدُ الْإِمَامُ عَلَى الْمِنْبَرِ قَدْرَ مَا يَقْرَأُ قُلْ هُوَ اللَّهُ أَحَدٌ ثُمَّ يَقُومُ فَيَفْتَتِحُ خُطْبَتَهُ ثُمَّ يَنْزِلُ فَيُصَلِّي بِالنَّاسِ ثُمَّ يَقْرَأُ بِهِمْ فِي الرَّكْعَةِ الْأُولَى بِالْجُمُعَةِ وَ فِي الثَّانِيَةِ بِالْمُنَافِقِينَ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, from Muhammad Bin Muslim who said, ", "‘I asked him<sup>asws</sup> about the Friday (<span class=\"iTxt\">Salāt</span>). So he<sup>asws</sup> said: ‘By an <span class=\"iTxt\">Azan</span> and an <span class=\"iTxt\">Iqamah</span>. The prayer leader would come out after the <span class=\"iTxt\">Azan</span>, so he would ascend the pulpit and address. The people should not pray <span class=\"iTxt\">Salāt</span> for as long as the prayer leader is upon the pulpit. Then the prayer leader should sit upon the pulpit for a measurement of what it takes to recite <span class=\"ibTxt\">[112:1] Say He Allah is One</span> (Chapter 112). Then he should be standing, so he should open his sermon, then descend. So he should pray <span class=\"iTxt\">Salāt</span> with the people (leading them), then recite with them in the first <span class=\"iTxt\">Rak’at</span> with the (Surah) Al-Jummah (Chapter 62), and in the second (<span class=\"iTxt\">Rak’at</span>) with the (Surah) Al-Munafiqeen (Chapter 63)’."]}}, {"index": 5445, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:3:4:70:8", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنِ ابْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ قَالَ فِي الْعِيدَيْنِ وَ الْجُمُعَةِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Ibn Sinan, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[7:31] O Children of Adam! Take to your adornments at every Masjid</span>. He<sup>asws</sup> said: ‘During the two Eids and the Friday’."]}}, {"index": 5446, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:3:4:70:9", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كُلُّ وَاعِظٍ قِبْلَةٌ يَعْنِي إِذَا خَطَبَ الْإِمَامُ النَّاسَ يَوْمَ الْجُمُعَةِ يَنْبَغِي لِلنَّاسِ أَنْ يَسْتَقْبِلُوهُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Every preacher is a Qiblah, meaning when the prayer leader addresses the people on the day of Friday, it is befitting for the people that they face towards him’."]}}]}, "index": "al-kafi:3:4:70", "kind": "verse_list"}