{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 79"
        },
        "path": "/books/al-kafi:3:4:79",
        "titles": {
          "ar": "باب الْمُسَافِرِ يَقْدَمُ الْبَلْدَةَ كَمْ يُقَصِّرُ الصَّلَاةَ",
          "en": "Chapter 79 – The traveller comes back to the city, how much Salāt would he shorten"
        }
      }
    ],
    "index": 746,
    "local_index": 79,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 80"
        },
        "path": "/books/al-kafi:3:4:80",
        "titles": {
          "ar": "باب صَلَاةِ الْمَلَّاحِينَ وَ الْمُكَارِينَ وَ أَصْحَابِ الصَّيْدِ وَ الرَّجُلِ يَخْرُجُ إِلَى ضَيْعَتِهِ",
          "en": "Chapter 80 – The sailors, and the Hirers, and the hunters, and the man who goes out to his estate"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 78"
        },
        "path": "/books/al-kafi:3:4:78",
        "titles": {
          "ar": "باب مَنْ يُرِيدُ السَّفَرَ أَوْ يَقْدَمُ مِنْ سَفَرٍ مَتَى يَجِبُ عَلَيْهِ التَّقْصِيرُ أَوِ التَّمَامُ",
          "en": "Chapter 78 – The one who intends the journey or comes back from a journey, when would the shortening or the complete (Salāt) be Obligated upon him?’"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:4:79",
    "titles": {
      "ar": "باب الْمُسَافِرِ يَقْدَمُ الْبَلْدَةَ كَمْ يُقَصِّرُ الصَّلَاةَ",
      "en": "Chapter 79 – The traveller comes back to the city, how much Salāt would he shorten"
    },
    "verse_count": 3,
    "verse_start_index": 5488,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/382)"
        ],
        "index": 5489,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/121",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/132",
              "text": "حَمَّادِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/210",
              "text": "حَرِيزِ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/191",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزِ بْنِ عَبْدِ اللَّهِ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:79:1",
        "text": [
          " قُلْتُ لَهُ أَ رَأَيْتَ مَنْ قَدِمَ بَلْدَةً إِلَى مَتَى يَنْبَغِي لَهُ أَنْ يَكُونَ مُقَصِّراً وَ مَتَى يَنْبَغِي لَهُ أَنْ يُتِمَّ ",
          "قَالَ إِذَا دَخَلْتَ أَرْضاً فَأَيْقَنْتَ أَنَّ لَكَ بِهَا مُقَاماً عَشَرَةَ أَيَّامٍ فَأَتِمَّ الصَّلَاةَ وَ إِنْ لَمْ تَدْرِ مَا مُقَامُكَ بِهَا تَقُولُ غَداً أَخْرُجُ أَوْ بَعْدَ غَدٍ فَقَصِّرْ مَا بَيْنَكَ وَ بَيْنَ أَنْ يَمْضِيَ شَهْرٌ فَإِذَا تَمَّ لَكَ شَهْرٌ فَأَتِمَّ الصَّلَاةَ وَ إِنْ أَرَدْتَ أَنْ تَخْرُجَ مِنْ سَاعَتِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Ismail, from Al Fazl Bin Sh<span class=\"iTxt\">Azaan</span>, altogether from Hammad Bin Isa, from Hareyz Bin Abdullah, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘What is your<sup>asws</sup> view of the one who comes back to a city, up to when is it befitting for him that he would happen to be shortening (the <span class=\"iTxt\">Salāt</span>), or when would it be befitting for him that he prays complete (Salāt)?’ ",
            "He<sup>asws</sup> said: ‘When you enter a land, so you are convinced that for you there is a stay of ten days in it, so pray complete <span class=\"iTxt\">Salāt</span>; and if you do not know what your stay would be in it, you are saying, ‘I shall go out tomorrow, or the day after tomorrow’, so shorten (the <span class=\"iTxt\">Salāt</span>) what is between you and your going, for a month. So when a month is complete for you, then pray the complete the <span class=\"iTxt\">Salāt</span>, and even if you intend to go out from that very moment’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa and Muhammad ibn ’Isma‘il from af-Fadf ibn Shadhan all from Hammad ibn ‘Isa from Hariz ibn ‘Abd Allah from Zurarah who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about a man who returns home from a journey. To what time is he required to perform his Salah (prayer) as reduced, and when is he required to perform his Salah (prayer) as complete? He (the Imam) said, ‘If you enter a land and you become certain of staying there for ten days, then perform your Salah (prayer) as complete. If you do not know for how long you stay there and think that you may leave it tomorrow or the next day, then perform your Salah (prayer) as reduced up to a month. When a month passes in such condition, then perform your Salah (prayer) as complete even if you decide to leave at that hour.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/383)"
        ],
        "index": 5490,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/458",
              "text": "عَبْدِ اللَّهِ بْنِ بُكَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ فَضَّالٍ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:79:2",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَكُونُ بِالْبَصْرَةِ وَ هُوَ مِنْ أَهْلِ الْكُوفَةِ لَهُ بِهَا دَارٌ وَ مَنْزِلٌ فَيَمُرُّ بِالْكُوفَةِ وَ إِنَّمَا هُوَ مُجْتَازٌ لَا يُرِيدُ الْمُقَامَ إِلَّا بِقَدْرِ مَا يَتَجَهَّزُ يَوْماً أَوْ يَوْمَيْنِ قَالَ يُقِيمُ فِي جَانِبِ الْمِصْرِ وَ يُقَصِّرُ قُلْتُ فَإِنْ دَخَلَ أَهْلَهُ قَالَ عَلَيْهِ التَّمَامُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Fazzal, from Abdullah Bin Bukeyr who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man who happens to be in Al-Basra and he is from the people of Al-Kufa, there being a house for him in it, and a lodging. So he passes by Al-Kufa, and rather he is just passing by, not intending the staying except of a measurement of preparing for a day or two days. He<sup>asws</sup> said: ‘He stays in the side of the city and he shortens (the <span class=\"iTxt\">Salāt</span>)’. I said, ‘Supposing he goes over to his family?’ He<sup>asws</sup> said: ‘Upon him is the complete (Salāt)’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn Faddal from ‘Abd Allah ibn Bukayr who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who is in al-Basra and he is from al- Kufah. He has a house there and he passes by al-Kufah just as a passer-by without an intention to stay there except for picking up supplies within one or two days. He (the Imam) said, ‘He is required to stay in one side of the city and perform his Salah (prayer) as reduced.’ I then asked, ‘What is he required to do if he visits his family?’ He (the Imam) said, ‘He is required to perform his Salah (prayer) complete.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/384)"
        ],
        "index": 5491,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/362",
              "text": "أَبِي أَيُّوبَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي أَيُّوبَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:79:3",
        "text": [
          " سَأَلَ مُحَمَّدُ بْنُ مُسْلِمٍ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا أَسْمَعُ عَنِ الْمُسَافِرِ إِنْ حَدَّثَ نَفْسَهُ بِإِقَامَةِ عَشَرَةِ أَيَّامٍ قَالَ فَلْيُتِمَّ الصَّلَاةَ وَ إِنْ لَمْ يَدْرِ مَا يُقِيمُ يَوْماً أَوْ أَكْثَرَ فَلْيَعُدَّ ثَلَاثِينَ يَوْماً ثُمَّ لْيُتِمَّ وَ إِنْ كَانَ أَقَامَ يَوْماً أَوْ صَلَاةً وَاحِدَةً ",
          "فَقَالَ لَهُ مُحَمَّدُ بْنُ مُسْلِمٍ بَلَغَنِي أَنَّكَ قُلْتَ خَمْساً فَقَالَ قَدْ قُلْتُ ذَاكَ قَالَ أَبُو أَيُّوبَ فَقُلْتُ أَنَا جُعِلْتُ فِدَاكَ يَكُونُ أَقَلَّ مِنْ خَمْسٍ فَقَالَ لَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abu Ayoub who said, ",
            "‘Muhammad Bin Muslim asked Abu Abdullah<sup>asws</sup> and I heard, about the traveller who thinks to himself of staying for ten days. He<sup>asws</sup> said: ‘So let him pray the complete <span class=\"iTxt\">Salāt</span>. And if he does not know what his stay would be, a day or more, so let him count (up to) thirty days, then let him pray complete (Salāt), and even if his stay was for one day, or one <span class=\"iTxt\">Salāt</span>’. ",
            "So Muhammad Bin Muslim said to him<sup>asws</sup>, ‘It has reached me that you<sup>asws</sup> said five (days)’. So he<sup>asws</sup> said: ‘I<sup>asws</sup> had said that’. Abu Ayoub said, ‘So I said, ‘May I be sacrificed for you<sup>asws</sup>! Can it happen to be less than five?’ So he<sup>asws</sup> said: ‘No’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from abu Ayyub who has said the following: “Muhammad ibn Muslim once asked abu ‘Abd Allah, ‘Alayhi al-Salam, when I was listening, about a traveler who thinks to stay for ten days. He (the Imam) said, ‘He is required to perform his Salah (prayer) as complete. If he does not know for how long he will stay, like for one or more, he can count to thirty days, then perform his Salah (prayer) as complete even if thereafter he stays for one day or one Salah (prayer).’ Muhammad ibn Muslim then said, ‘I am told that you have said it is five.’ He (the Imam) said, ‘Yes, I had said that.’ Abu Ayyub has said that he said, ‘I pray to Allah to keep my soul in service for your cause, can it be less than five?’ He (the Imam) said, ‘No, it cannot be less than five.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:4:79",
  "kind": "verse_list"
}