{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 84"
        },
        "path": "/books/al-kafi:3:4:84",
        "titles": {
          "ar": "باب صَلَاةِ النَّوَافِلِ",
          "en": "Chapter 84 – The optional Salāt"
        }
      }
    ],
    "index": 751,
    "local_index": 84,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 85"
        },
        "path": "/books/al-kafi:3:4:85",
        "titles": {
          "ar": "باب تَقْدِيمِ النَّوَافِلِ وَ تَأْخِيرِهَا وَ قَضَائِهَا وَ صَلَاةِ الضُّحَى",
          "en": "Chapter 85 – Preceding the optional (Salāt) and delaying it, and its payback, and the Salāt at forenoon"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 83"
        },
        "path": "/books/al-kafi:3:4:83",
        "titles": {
          "ar": "باب الصَّلَاةِ فِي السَّفِينَةِ",
          "en": "Chapter 83 – The Salāt (performed) in the ship"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:4:84",
    "titles": {
      "ar": "باب صَلَاةِ النَّوَافِلِ",
      "en": "Chapter 84 – The optional Salāt"
    },
    "verse_count": 35,
    "verse_start_index": 5520,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/396)"
        ],
        "index": 5521,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:1",
        "refs": {
          "Mentions": [
            "/books/quran:71:23",
            "/books/quran:70:23"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ قَالَ دَخَلْتُ عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) وَ أَنَا شَابٌّ فَوَصَفَ لِيَ التَّطَوُّعَ وَ الصَّوْمَ فَرَأَى ثِقْلَ ذَلِكَ فِي وَجْهِي فَقَالَ لِي إِنَّ هَذَا لَيْسَ كَالْفَرِيضَةِ مَنْ تَرَكَهَا هَلَكَ إِنَّمَا هُوَ التَّطَوُّعُ إِنْ شُغِلْتَ عَنْهُ أَوْ تَرَكْتَهُ قَضَيْتَهُ إِنَّهُمْ كَانُوا يَكْرَهُونَ أَنْ تُرْفَعَ أَعْمَالُهُمْ يَوْماً تَامّاً وَ يَوْماً نَاقِصاً إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ الَّذِينَ هُمْ عَلى صَلاتِهِمْ دائِمُونَ وَ كَانُوا يَكْرَهُونَ أَنْ يُصَلُّوا حَتَّى يَزُولَ النَّهَارُ إِنَّ أَبْوَابَ السَّمَاءِ تُفَتَّحُ إِذَا زَالَ النَّهَارُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr, from Zurara who said, ",
            "‘I went over to Abu Ja’far<sup>asws</sup> and I was a youth, so he<sup>asws</sup> described the voluntary (Salāt) for me, and the Fasts. So he<sup>asws</sup> saw the heaviness of that in my face, and he<sup>asws</sup> said to me: ‘This is not like the Obligatory (Salāt) which if one were to neglect it, would be destroyed. But rather, it is the voluntary. If you were too busy from it or neglect it, make up for it. They (the people) would be disliking if their deeds were to be Raised as complete one day, and one day - deficient. Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:70#h23\">[70:23]</a> Those who are constant at their Prayer</span>, and they were disliking if they were to pray <span class=\"iTxt\">Salāt</span> until the day declines, and that the gates of the sky are open when the day (starts to) decline’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from ibn Bukayr from Zurarah who has said the following: “I went to visit abu Ja‘far, ‘Alayhi al-Salam. I was a young person. The Imam described for me optional Salawat (prayers) and fasting and he noticed from my face that I considered it heavy. He then said to me, This is not like obligatory Salawat (prayers), so that on neglecting, one is destroyed. It is optional and if you cannot do on time, you can do compensatory prayer for it. They disliked that their deeds are taken up one day complete and one day incomplete. Allah, the Most Majestic, the Most Glorious, says, “Those who perform their Salah (prayer) all the time” <a href=\"/#/books/quran:71#h23\">[71:23]</a>. They (true Muslims) disliked continuing Salah (prayer) until sun declines on midday to the west; the doors of heaven open on such time.’”” (The meaning of ’all the time’, is not performing Salah (prayer) without any intervals). "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/397)"
        ],
        "index": 5522,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ فُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْفَرِيضَةُ وَ النَّافِلَةُ أَحَدٌ وَ خَمْسُونَ رَكْعَةً مِنْهَا رَكْعَتَانِ بَعْدَ الْعَتَمَةِ جَالِساً تُعَدَّانِ بِرَكْعَةٍ وَ هُوَ قَائِمٌ الْفَرِيضَةُ مِنْهَا سَبْعَةَ عَشَرَ رَكْعَةً وَ النَّافِلَةُ أَرْبَعٌ وَ ثَلَاثُونَ رَكْعَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibn Azina, from Fuzeyl Bin Yasaar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Obligatory and the optional (<span class=\"iTxt\">Salāts</span>) are fifty one <span class=\"iTxt\">Rak’at</span> – from it are two <span class=\"iTxt\">Rak’at </span>after the night (to be prayed) seated, counted as one <span class=\"iTxt\">Rak’at</span> prayed while he is standing. The Obligatory from these are seventeen <span class=\"iTxt\">Rak’at</span>, and the optional are thirty four <span class=\"iTxt\">Rak’at</span>’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ibn ’Udhaynah from ibn Faddal ibn Yasar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Obligatory and optional Salah (prayer) are fifty-one Rak‘at, of which there are two Rak‘at after al-‘Atmah in a sitting position which are counted as one Rak‘at in a standing position. Obligatory Salah (prayer) are seventeen Rak‘at and optional Salah (prayer) are thirty-four Rak‘at.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/397)"
        ],
        "index": 5523,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ وَ الْفَضْلِ بْنِ عَبْدِ الْمَلِكِ وَ بُكَيْرٍ قَالُوا سَمِعْنَا أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يُصَلِّي مِنَ التَّطَوُّعِ مِثْلَيِ الْفَرِيضَةِ وَ يَصُومُ مِنَ التَّطَوُّعِ مِثْلَيِ الْفَرِيضَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibn Azina, from Al Fuzayl Bin Yasaar, and Al Fazl Bin Abdul Malik and Bukeyr, both said, ",
            "‘We both heard Abu Abdullah<sup>asws</sup> saying: ‘It was so that Rasool-Allah<sup>saww</sup> prayed the voluntary <span class=\"iTxt\">Salāt</span> as double the Obligatory ones, and he<sup>saww</sup> would Fast from the voluntary as double the Obligatory ones’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ibn ’Udhaynah from ibn Fudayl ibn Yasar and al-Fadl ibn ‘Abd al-Malik and Bukayr who have said the following: “We heard abu ‘Abd Allah, ‘Alayhi al-Salam, saying that the Messenger of Allah would perform of optional Salah (prayer) twice as much as obligatory Salah (prayer), and fast of optional fast twice as much as the obligatory one.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور بسندي ه  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/397)"
        ],
        "index": 5524,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ مُحَمَّدِ بْنِ أَبِي عُمَيْرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ أَفْضَلِ مَا جَرَتْ بِهِ السُّنَّةُ مِنَ الصَّلَاةِ فَقَالَ تَمَامُ الْخَمْسِينَ .",
          "وَ رَوَى الْحُسَيْنُ بْنُ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Ibn Muskan, from Muhammad Bin Abu Umeyr who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the most superior of what the Sunnah has flowed with, from the <span class=\"iTxt\">Salāt</span>. So he<sup>asws</sup> said: ‘The complete fifty (<span class=\"iTxt\">Rak’at</span> and one while sitting- so 51 in total)’. ",
            "And it is reported by Al-Husayn Bin Saeed, from Muhammad Bin Sinan – similar to it."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from ibn Muskan from Muhammad ibn abu ‘Umayr who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the most excellent item in the Sunnah of Salah (prayer). He (the Imam) said, ‘It is the complete, all fifty (Rak‘at).’” Al-Husayn ibn Sa‘id has narrated from Muhammad ibn Sinan a similar Hadith. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/398)"
        ],
        "index": 5525,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:5",
        "text": [
          "مُحَمَّدٌ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ حَنَانٍ قَالَ سَأَلَ عَمْرُو بْنُ حُرَيْثٍ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا جَالِسٌ فَقَالَ لَهُ جُعِلْتُ فِدَاكَ أَخْبِرْنِي عَنْ صَلَاةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ كَانَ النَّبِيُّ ( صلى الله عليه وآله ) يُصَلِّي ثَمَانِيَ رَكَعَاتٍ الزَّوَالَ وَ أَرْبَعاً الْأُولَى وَ ثَمَانِيَ بَعْدَهَا وَ أَرْبَعاً الْعَصْرَ وَ ثَلَاثاً الْمَغْرِبَ وَ أَرْبَعاً بَعْدَ الْمَغْرِبِ وَ الْعِشَاءَ الْآخِرَةَ أَرْبَعاً وَ ثَمَانِيَ صَلَاةَ اللَّيْلِ وَ ثَلَاثاً الْوَتْرَ وَ رَكْعَتَيِ الْفَجْرِ وَ صَلَاةَ الْغَدَاةِ رَكْعَتَيْنِ ",
          "قُلْتُ جُعِلْتُ فِدَاكَ وَ إِنْ كُنْتُ أَقْوَى عَلَى أَكْثَرَ مِنْ هَذَا يُعَذِّبُنِي اللَّهُ عَلَى كَثْرَةِ الصَّلَاةِ فَقَالَ لَا وَ لَكِنْ يُعَذِّبُ عَلَى تَرْكِ السُّنَّةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail Bin Bazi’e, from Hanan who said, ",
            "‘Amro Bin Hureys asked Abu Abdullah<sup>asws</sup> and I was seated, so he said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Inform me about the <span class=\"iTxt\">Salāt</span> of Rasool-Allah<sup>saww</sup>’. So he<sup>asws</sup> said: ‘The Prophet<sup>saww</sup> used to pray eight <span class=\"iTxt\">Rak’at</span> at midday, and four of the first (<span class=\"iTxt\">Al-Zohr</span>) and eight (<span class=\"iTxt\">Rak’at</span>) after it, and four (<span class=\"iTxt\">Rak’at</span>) of <span class=\"iTxt\">Al-Asr</span>, and three (<span class=\"iTxt\">Rak’at </span>of Maghrib), and four (<span class=\"iTxt\">Rak’at</span>) after <span class=\"iTxt\">Al-Maghrib</span>, and <span class=\"iTxt\">Al-Isha</span> the last being four (<span class=\"iTxt\">Rak’at</span>), and eight (<span class=\"iTxt\">Rak’at</span>) at night, and three (<span class=\"iTxt\">Rak’at</span>) of Al-<span class=\"iTxt\">Witr</span>, and two (<span class=\"iTxt\">Rak’at</span>) of <span class=\"iTxt\">Al-Fajr</span>, and the morning <span class=\"iTxt\">Salāt</span> as two <span class=\"iTxt\">Rak’at</span>’. ",
            "I said, ‘May I be sacrificed for you<sup>asws</sup>! And if I was strong enough upon more than this, would Allah<sup>azwj</sup> Punish me upon the more <span class=\"iTxt\">Salāts</span>?’ So he<sup>asws</sup> said: ‘No, but He<sup>azwj</sup> would Punish upon neglecting the Sunnah’."
          ],
          "en.sarwar": [
            "5. Muhammad has narrated from Muhammad ibn al-Flusayn from Muhammad ibn ’Isma‘il ibn Bazi‘ from Hanan who has said the following: “Once, when I was present, ‘Arm ibn Hurayth asked abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ‘I pray to Allah to keep my soul in service for your cause, tell me about Salah (prayer) of the Messenger of Allah.’ He (the Imam) said, ‘The Holy prophet performed eight Rak‘at of Zawal (declining of the sun toward the west at noontime). He (the Messenger of Allah) performed the first four, then eight thereafter, then four of al-‘Al-‘Asr. He performed three of al-Maghrib, four after al-Maghrib, four of al-‘Isha’ al-Akhirah, eight of nightly Salah (prayer), three of al-Witr, two Rak‘at at dawn and the morning Salah (prayer) of two Rak‘at.’ I then said, ‘I pray to Allah to keep my soul in service for your cause, if I can do more than this, will Allah punish me because of a great deal of Salah (prayer)?’ He (the Imam) said, ‘No, however, He punishes because of omitting Sunnah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/398)"
        ],
        "index": 5526,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) هَلْ قَبْلَ الْعِشَاءِ الْآخِرَةِ وَ بَعْدَهَا شَيْ‏ءٌ قَالَ لَا غَيْرَ أَنِّي أُصَلِّي بَعْدَهَا رَكْعَتَيْنِ وَ لَسْتُ أَحْسُبُهُمَا مِنْ صَلَاةِ اللَّيْلِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup>, ‘Is there anything before the <span class=\"iTxt\">Al-Isha</span> the last and after it?’ He<sup>asws</sup> said: ‘No, apart from that I<sup>asws</sup> tend to pray two <span class=\"iTxt\">Rak’at</span> of <span class=\"iTxt\">Salāt</span> after it, and I<sup>asws</sup> do not reckon these two to be from the night <span class=\"iTxt\">Salāt</span>’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn abu ‘ Umayr from Hammad from al-Halabiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘Is there anything before or after al-‘Isha’ al- Akhirah?’ He (the Imam) said, ‘No, except that I perform two Rak‘at thereafter and I do not count it as part of nightly Salah (prayer).’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/399)"
        ],
        "index": 5527,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنِ الْحُسَيْنِ بْنِ سَيْفٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ حَجَّاجٍ الْخَشَّابِ عَنْ أَبِي الْفَوَارِسِ قَالَ نَهَانِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَنْ أَتَكَلَّمَ بَيْنَ الْأَرْبَعِ رَكَعَاتٍ الَّتِي بَعْدَ الْمَغْرِبِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Salma Bin Al Khattab, from Al Husayn Bin Sayf, from Muhammad Bin Yaya, from Hajjaj Al Khashhab, from Abu Al Fawaris who said, ",
            "‘Abu Abdullah<sup>asws</sup> forbade us to speak in between the four <span class=\"iTxt\">Rak’at</span> of <span class=\"iTxt\">Salāt</span> which are after <span class=\"iTxt\">Al-Maghrib</span>’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Salmah ibn al-Khattab from al-Husayn ibn Sayf from Muhammad ibn Yahya from Hajjaj al- Khashshab from abu al-Fawaris who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, prohibited me from speaking between the four Rak‘at after al- Maghrib.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/399)"
        ],
        "index": 5528,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:8",
        "text": [
          "مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) إِنَّ أَصْحَابَنَا يَخْتَلِفُونَ فِي صَلَاةِ التَّطَوُّعِ بَعْضُهُمْ يُصَلِّي أَرْبَعاً وَ أَرْبَعِينَ وَ بَعْضُهُمْ يُصَلِّي خَمْسِينَ فَأَخْبِرْنِي بِالَّذِي تَعْمَلُ بِهِ أَنْتَ كَيْفَ هُوَ حَتَّى أَعْمَلَ بِمِثْلِهِ فَقَالَ أُصَلِّي وَاحِدَةً وَ خَمْسِينَ ",
          "ثُمَّ قَالَ أَمْسِكْ وَ عَقَدَ بِيَدِهِ الزَّوَالَ ثَمَانِيَةً وَ أَرْبَعاً بَعْدَ الظُّهْرِ وَ أَرْبَعاً قَبْلَ الْعَصْرِ وَ رَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ وَ رَكْعَتَيْنِ قَبْلَ عِشَاءِ الْآخِرَةِ وَ رَكْعَتَيْنِ بَعْدَ الْعِشَاءِ مِنْ قُعُودٍ تُعَدَّانِ بِرَكْعَةٍ مِنْ قِيَامٍ وَ ثَمَانِيَ صَلَاةَ اللَّيْلِ وَ الْوَتْرَ ثَلَاثاً وَ رَكْعَتَيِ الْفَجْرِ وَ الْفَرَائِضَ سَبْعَ عَشْرَةَ فَذَلِكَ أَحَدٌ وَ خَمْسُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Hassan, from Sahl, from Ahmad Bin Muhammad Bin Abu Nasr who said, ",
            "‘I said to Abu Al-Hassan<sup>asws</sup>, ‘Our companions are differing regarding the voluntary <span class=\"iTxt\">Salāts</span>. Some of them are praying forty four (<span class=\"iTxt\">Rak’at</span>), and some of them are praying fifty (<span class=\"iTxt\">Rak’at</span>). So inform me with which are you<sup>asws</sup> acting upon, how it is so that I can act upon the like of it’. So he<sup>asws</sup> said: ‘I<sup>asws</sup> pray fifty-one <span class=\"iTxt\">Rak’at</span>’. ",
            "Then he<sup>asws</sup> said: ‘Hold on!’ And he<sup>asws</sup> counted by his<sup>asws</sup> hand – ‘The midday is eight (<span class=\"iTxt\">Rak’at</span>), and four after <span class=\"iTxt\">Al-Zohr</span>, and four before <span class=\"iTxt\">Al-Asr</span>, and two <span class=\"iTxt\">Rak’at</span> after <span class=\"iTxt\">Al-Maghrib</span>, and two <span class=\"iTxt\">Rak’at</span> before Isha the last, and two <span class=\"iTxt\">Rak’at</span> after <span class=\"iTxt\">Al-Isha</span> while seated, accounted as one <span class=\"iTxt\">Rak’at</span> while standing, and eight for the night <span class=\"iTxt\">Salāt</span>, and <span class=\"iTxt\">Al-Witr </span>is of three, and two <span class=\"iTxt\">Rak’at</span> of Al-Faj, and the Obligatory ones are seventeen. So that is fifty-one (<span class=\"iTxt\">Rak’at</span>)’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn al-Hassan has narrated from Sahl from Ahmad ibn Muhammad from ibn abu Nasr who has said the following: “I once said to abu al-Hassan, ‘Alayhi al-Salam, that our people have differences about optional Salah (prayer). Certain ones among them say it is forty-four and others perform fifty. Please tell me about what you perform and how is it, so I can do similarly. He (the Imam) said, ‘I perform fifty-one Rak‘at.’ He (the Imam) then said, ‘Hold on to it.’ He (the Imam) counted with his hand saying, ‘Zawal (declining of the sun toward the west at noontime) is eight. There are four after al-Dhuhr, four before al-‘Asr, two after al-Maghrib, two before al-‘Isha’, two after al-‘Isha’ in a sitting position which are counted as one Rak‘at in a standing position. There are eight Rak‘at of nightly Salah (prayer), three of al-witr and two at dawn. Obligatory Salah (prayer) is seventeen Rak‘at and this becomes fifty-one Rak‘at.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/400)"
        ],
        "index": 5529,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:9",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ حَمَّادِ بْنِ عُثْمَانَ قَالَ سَأَلْتُهُ عَنِ التَّطَوُّعِ بِالنَّهَارِ فَذَكَرَ أَنَّهُ يُصَلِّي ثَمَانَ رَكَعَاتٍ قَبْلَ الظُّهْرِ وَ ثَمَانٍ بَعْدَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad Al Ashary, from Abdullah Bin Aamir, from Ali Bin Mahziyar, from Fazalat Bin Ayoub, from Hammad Bin Usman who said, ",
            "‘I asked him<sup>asws</sup> about the voluntary (<span class=\"iTxt\">Salāts</span>) of the daytime. So he<sup>asws</sup> mentioned that he<sup>asws</sup> tends to pray eight <span class=\"iTxt\">Rak’at</span> before <span class=\"iTxt\">Al-Zohr</span>, and eight after it’."
          ],
          "en.sarwar": [
            "9. Al-Husayn ibn Muhammad al-Ash’ariy has narrated from ‘Abd Allah ibn ‘Amir from Ali ibn Mahziyar from Fadalah ibn Ayyub from Hammad ibn ‘Uthaman who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about optional Salah (prayer) during the day. He (the Imam) said, ‘He performs eight Rak‘at before al-Dhuhr and eight after al-Dhuhr.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/400)"
        ],
        "index": 5530,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:10",
        "text": [
          "عَنْهُ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ يَحْيَى بْنِ أَبِي الْعَلَاءِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) صَلَاةُ الزَّوَالِ صَلَاةُ الْأَوَّابِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Moalla Bin Muhammad, from Al Hassan Bin Ali Al Washa, from Aban Bin Usman, from Yahya Bin Abu Al A’ala, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘The midday <span class=\"iTxt\">Salāt</span> is the <span class=\"iTxt\">Salāt</span> of the repentant’."
          ],
          "en.sarwar": [
            "10. It is a narration from him (narrator of previous Hadith) by Mu‘alla’ ibn Muhammad from al-Hassan ibn Ali al-Washsha’ from Aban ibn ‘Uthman from Yahya’ ibn abu al-‘Ala’ who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘’Amir al-Mu’minin, ‘Alayhi al-Salam, has said, “Salah (prayer) at noontime is Salah (prayer) of repenting people.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/400)"
        ],
        "index": 5531,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:11",
        "refs": {
          "Mentions": [
            "/books/quran:39:9",
            "/books/quran:52:49",
            "/books/quran:50:40",
            "/books/quran:20:130",
            "/books/quran:52:40"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قُلْتُ لَهُ آناءَ اللَّيْلِ ساجِداً وَ قائِماً يَحْذَرُ الْآخِرَةَ وَ يَرْجُوا رَحْمَةَ رَبِّهِ قَالَ يَعْنِي صَلَاةَ اللَّيْلِ ",
          "قَالَ قُلْتُ لَهُ وَ أَطْرافَ النَّهارِ لَعَلَّكَ تَرْضى قَالَ يَعْنِي تَطَوَّعْ بِالنَّهَارِ ",
          "قَالَ قُلْتُ لَهُ وَ إِدْبارَ النُّجُومِ قَالَ رَكْعَتَانِ قَبْلَ الصُّبْحِ ",
          "قُلْتُ وَ أَدْبارَ السُّجُودِ قَالَ رَكْعَتَانِ بَعْدَ الْمَغْرِبِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:39#h9\">[39:9]</a> Safe is He who is obedient during the hours of the night, performing Sajdah himself and standing, cautious of the Hereafter and hopes for the Mercy of his Lord</span>’. He<sup>asws</sup> said: ‘It Means the night <span class=\"iTxt\">Salāt</span>’. ",
            "He (the narrator) said, ‘I said to him<sup>asws</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:20#h130\">[20:130]</a> so Glorify (Him) during parts of the day, so that you may be well pleased</span>’. He<sup>asws</sup> said: ‘It Means the voluntary (<span class=\"iTxt\">Salāt</span>) at daytime’.",
            "He (the narrator) said, ‘I said to him<sup>asws</sup>, ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:52#h49\">[52:49]</a> and (Glorify Him) at the retreat of the stars</span>’. He<sup>asws</sup> said: ‘Two <span class=\"iTxt\">Rak’at</span> prayed before the morning’. ",
            "I said, ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:50#h40\">[50:40]</a> so glorify Him and after the Sajdahs</span>?’ He<sup>asws</sup> said: ‘Two <span class=\"iTxt\">Rak’at</span> after <span class=\"iTxt\">Al-Maghrib</span>’."
          ],
          "en.sarwar": [
            "11. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz from Zurarah who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about the words of Allah, ‘. . . during the night in Sajdah (prostration) and in standing position fearful of the next life and hopeful of the mercy of his Lord. . . .’ <a href=\"/#/books/quran:20#h130\">[20:130]</a>. He (the Imam) said, ‘It is a reference to the nightly optional Salah (prayer).’ I then said, ‘ . . . and in both ends of the day perhaps you will become happy. . .’ <a href=\"/#/books/quran:20#h130\">[20:130]</a>. He (the Imam) said, ‘It is a reference to optional Salah (prayer) during the day.’ I then said, ‘. . . when the stars go back. . . .’ <a href=\"/#/books/quran:52#h49\">[52:49]</a>. He (the Imam) said, ‘It is a reference to the two Rak‘at before the morning Salah (prayer).’ I then said, ‘. . . after Sujud (prostrations) . . .’<a href=\"/#/books/quran:52#h40\">[52:40]</a> He (the Imam) said, ‘It is a reference to the two Rak‘at after al-Maghrib.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/401)"
        ],
        "index": 5532,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:12",
        "refs": {
          "Mentions": [
            "/books/quran:3:193",
            "/books/quran:3:194",
            "/books/quran:3:192",
            "/books/quran:3:190",
            "/books/quran:3:191"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِذَا قُمْتَ بِاللَّيْلِ مِنْ مَنَامِكَ فَقُلِ الْحَمْدُ لِلَّهِ الَّذِي رَدَّ عَلَيَّ رُوحِي لِأَحْمَدَهُ وَ أَعْبُدَهُ",
          "فَإِذَا سَمِعْتَ صَوْتَ الدُّيُوكِ فَقُلْ سُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلَائِكَةِ وَ الرُّوحِ سَبَقَتْ رَحْمَتُكَ غَضَبَكَ لَا إِلَهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ عَمِلْتُ سُوءاً وَ ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي وَ ارْحَمْنِي إِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
          "فَإِذَا قُمْتَ فَانْظُرْ فِي آفَاقِ السَّمَاءِ وَ قُلِ اللَّهُمَّ إِنَّهُ لَا يُوَارِي عَنْكَ لَيْلٌ سَاجٍ وَ لَا سَمَاءٌ ذَاتُ أَبْرَاجٍ وَ لَا أَرْضٌ ذَاتُ مِهَادٍ وَ لَا ظُلُمَاتٌ بَعْضُهَا فَوْقَ بَعْضٍ وَ لَا بَحْرٌ لُجِّيٌّ تُدْلِجُ بَيْنَ يَدَيِ الْمُدْلِجِ مِنْ خَلْقِكَ تَعْلَمُ خَائِنَةَ الْأَعْيُنِ وَ مَا تُخْفِي الصُّدُورُ غَارَتِ النُّجُومُ وَ نَامَتِ الْعُيُونُ وَ أَنْتَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُكَ سِنَةٌ وَ لَا نَوْمٌ   سُبْحَانَ رَبِّ الْعَالَمِينَ وَ إِلَهِ الْمُرْسَلِينَ وَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
          "ثُمَّ اقْرَأِ الْخَمْسَ الْآيَاتِ مِنْ آخِرِ آلِ عِمْرَانَ إِنَّ فِي خَلْقِ السَّماواتِ وَ الْأَرْضِ إِلَى قَوْلِهِ إِنَّكَ لا تُخْلِفُ الْمِيعادَ ",
          "ثُمَّ اسْتَكْ وَ تَوَضَّأْ فَإِذَا وَضَعْتَ يَدَكَ فِي الْمَاءِ فَقُلْ ",
          "بِسْمِ اللَّهِ وَ بِاللَّهِ اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ وَ اجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ",
          "فَإِذَا فَرَغْتَ فَقُلِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ فَإِذَا قُمْتَ إِلَى صَلَاتِكَ فَقُلْ بِسْمِ اللَّهِ وَ بِاللَّهِ وَ إِلَى اللَّهِ وَ مِنَ اللَّهِ وَ مَا شَاءَ اللَّهُ وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ اللَّهُمَّ اجْعَلْنِي مِنْ زُوَّارِ بَيْتِكَ وَ عُمَّارِ مَسَاجِدِكَ وَ افْتَحْ لِي بَابَ تَوْبَتِكَ وَ أَغْلِقْ عَنِّي بَابَ مَعْصِيَتِكَ وَ كُلِّ مَعْصِيَةٍ الْحَمْدُ لِلَّهِ الَّذِي جَعَلَنِي مِمَّنْ يُنَاجِيهِ اللَّهُمَّ أَقْبِلْ عَلَيَّ بِوَجْهِكَ جَلَّ ثَنَاؤُكَ ثُمَّ افْتَتِحِ الصَّلَاةَ بِالتَّكْبِيرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad, from Hareyz, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When you stand at night from your sleep, so say, ‘The Praise is for Allah<sup>azwj</sup> Who Returned my soul to me so that I would Praise Him<sup>azwj</sup> and worship Him<sup>azwj</sup>’. ",
            "So when you hear the roosters, then say, ‘Glorious, Holy is the Lord<sup>azwj</sup> of the Angels and the Spirit. Your<sup>azwj</sup> Mercy precedes Your<sup>azwj</sup> Mercy precedes Your<sup>azwj</sup> Punishment. There is no god except for You<sup>azwj</sup>, Alone, there being no associates for You<sup>azwj</sup>. I have done evil deeds and been unjust to myself, therefore Forgive me and be Merciful to me. None Forgives the sins except for You<sup>azwj</sup>’.",
            "So when you stand, look into the horizons of the sky and say, ‘O Allah<sup>azwj</sup>! Neither can a tranquil night hide You<sup>azwj</sup> nor a sky with the constellations, nor an earth with flatness, nor darkness on top of each other, nor an ocean with an incoming wave in front of an outgoing wave from Your<sup>azwj</sup> Creation. You<sup>azwj</sup> Know the treachery of the eyes and what the chests are concealing. The stars have made an incursion and the eyes are asleep, and You<sup>azwj</sup> and the Ever-Living, the Ever-Lasting. Neither does a slumber overtake You<sup>azwj</sup> nor does sleep. Glorious is the Lord<sup>azwj</sup> of the worlds and God of the Mursil (Prophets<sup>as</sup>). And the Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds’.",
            "Then recite five Verses from the end part of (Surah) Aal-e-Imraan (Chapter 3) <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h190\">[3:190]</a> Most surely in the Creation of the skies and the earth</span> up to His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h194\">[3:194]</a> surely You do not fail to Fulfill the Promise</span>.",
            "Then brush your teeth and perform ablution. So when you place your hand into the water, say, ",
            "‘In the Name of Allah<sup>azwj</sup>, and by Allah<sup>azwj</sup>. O Allah<sup>azwj</sup>! Make me to be from the repentant, and Make me to be from the ones who clean themselves’. ",
            "So when you are free (from that), say, ‘The Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the world’. So when you stand to your <span class=\"iTxt\">Salāt</span>, say, ‘In the Name of Allah<sup>azwj</sup>, and by Allah<sup>azwj</sup>, and to Allah<sup>azwj</sup>, and from Allah<sup>azwj</sup>, and whatever Allah<sup>azwj</sup> so Desires, and there is neither a Might nor Strength except with Allah<sup>azwj</sup>. O Allah<sup>azwj</sup>! Make me to be from the visitors of Your<sup>azwj</sup> House (Kabah), and builders of Your<sup>azwj</sup> Masjids, and Open for me the doors of Your<sup>azwj</sup> repentance and Lock from me the doors of Your<sup>azwj</sup> disobedience, and every disobedience. The Praise is for Allah<sup>azwj</sup> Who Made me to be from the one who whispers to Him<sup>azwj</sup>. O Allah<sup>azwj</sup>! Turn towards me by Your<sup>azwj</sup> Face, Majestic is Your<sup>azwj</sup> Laudation’. Then Open the <span class=\"iTxt\">Salāt</span> with the exclamation of the <span class=\"iTxt\">Takbīr</span>’."
          ],
          "en.sarwar": [
            "12. Ali ibn Ibrahim has narrated from his father from Hammad from Hariz from Zurarah who has said the following: “Abu la’ far, ‘Alayhi al-Salam, has said, ‘At the time you wake up, at night for prayer (Tahajjud) then say, “All praise belongs to Allah who has returned my spirit so I can praise and worship Him.” When you hear the rooster crow say, “He is free of all defects. He is most holy. He is the Lord of angels and the spirit. His mercy comes before His anger. No one, other than You (Allah), deserves worship. You do not have any partner. I have done bad deeds and have done injustice to my own soul, so forgive and grant me mercy; no one, other than You, is able to forgive sins.” When you get up look to the sky and say, “O Lord, the dark night cannot curtain You, nor the sky with its constellations, or the vast expanse of earth, or the darkness one over the other, or the ocean with its giant waves that curtain Your creatures from each other. You know whatever eyes steal or the chests hide. The stars have disappeared, eyes have gone to sleep, You are the living guardian whom sleep and slumber cannot overtake. Free from all defect is the Cherisher of the worlds, Lord of the messengers and all praise belongs to Allah, The Cherisher of the worlds.” Then read five verses from Chapter Three: “The creation of the heavens and the earth and the alternation of the day and the night are evidence (of the existence of Allah) for people of reason <a href=\"/#/books/quran:3#h190\">[3:190]</a>. It is these who commemorate Allah while standing, sitting, or resting on their sides and who think about the creation of the heavens and the earth and say, ‘Lord, you have not created all this without reason. Glory be to You. Lord, save us from the torment of the fire.’ <a href=\"/#/books/quran:3#h191\">[3:191]</a>. Our Lord, those whom You consign to the fire are certainly disgraced. There is no helper for the unjust. <a href=\"/#/books/quran:3#h192\">[3:192]</a> “Lord, we have heard the person calling to the faith and have accepted his call. Forgive our sins, expiate our bad deeds, and allow us to die with the righteous ones. <a href=\"/#/books/quran:3#h193\">[3:193]</a> Lord, grant us the victory that You have promised Your Messenger and do not disgrace us on the Day of Judgment; You are the One who never ignores His promise.” <a href=\"/#/books/quran:3#h194\">[3:194]</a> “Thereafter brush your teeth; and make Wudu’. When placing your hand in water say, “(I begin) by the name of Allah, and with the power of Allah. O Lord, make me of the repenting ones and of those who purify themselves.” When you complete Wudu’ say, “All praise belongs to Allah, Cherisher of the worlds.” When you stand up for Salah (prayer) say, “(I begin) in the name of Allah, with (the power of) Allah, to Allah, from Allah and with the will of Allah and there is no means or power except the power and means of Allah. O Lord, make me of the visitors of Your house and of the builders of Masjids, please open for me the door to repent before You and close to me the door of disobedience to You and all sins. All praise belongs to Allah who has made me of those who speak to Him. O Lord, turn to me with Your face, the majestic in praise.” Then begin your Salah (prayer) with the first Takbir.’” (Ahadith 2-12 can best be explained by fatwa.) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن وآخره مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/404)"
        ],
        "index": 5533,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:13",
        "refs": {
          "Mentions": [
            "/books/quran:3:190",
            "/books/quran:3:194",
            "/books/quran:33:21"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ إِذَا صَلَّى الْعِشَاءَ الْآخِرَةَ أَمَرَ بِوَضُوئِهِ وَ سِوَاكِهِ يُوضَعُ عِنْدَ رَأْسِهِ مُخَمَّراً فَيَرْقُدُ مَا شَاءَ اللَّهُ ثُمَّ يَقُومُ فَيَسْتَاكُ وَ يَتَوَضَّأُ وَ يُصَلِّي أَرْبَعَ رَكَعَاتٍ ",
          "ثُمَّ يَرْقُدُ ثُمَّ يَقُومُ فَيَسْتَاكُ وَ يَتَوَضَّأُ وَ يُصَلِّي أَرْبَعَ رَكَعَاتٍ ثُمَّ يَرْقُدُ حَتَّى إِذَا كَانَ فِي وَجْهِ الصُّبْحِ قَامَ فَأَوْتَرَ ثُمَّ صَلَّى الرَّكْعَتَيْنِ ",
          "ثُمَّ قَالَ لَقَدْ كانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ قُلْتُ مَتَى كَانَ يَقُومُ قَالَ بَعْدَ ثُلُثِ اللَّيْلِ وَ قَالَ فِي حَدِيثٍ آخَرَ بَعْدَ نِصْفِ اللَّيْلِ.",
          "وَ فِي رِوَايَةٍ أُخْرَى يَكُونُ قِيَامُهُ وَ رُكُوعُهُ وَ سُجُودُهُ سَوَاءً وَ يَسْتَاكُ فِي كُلِّ مَرَّةٍ قَامَ مِنْ نَوْمِهِ وَ يَقْرَأُ الْآيَاتِ مِنْ آلِ عِمْرَانَ إِنَّ فِي خَلْقِ السَّماواتِ وَ الْأَرْضِ إِلَى قَوْلِهِ إِنَّكَ لا تُخْلِفُ الْمِيعادَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It was so that whenever Rasool-Allah<sup>saww</sup> prayed <span class=\"iTxt\">Al-Isha</span> the last, ordered for his<sup>saww</sup> water for the ablution and his<sup>saww</sup> toothbrush to be place by his<sup>saww</sup> head (pillow), covered. So he<sup>saww</sup> would lie down for as long as Allah<sup>azwj</sup> so Desired. Then he<sup>saww</sup> would stand, so he<sup>saww</sup> would brush his<sup>saww</sup> teeth, and perform ablution, and he<sup>saww</sup> would pray four <span class=\"iTxt\">Rak’at</span> of <span class=\"iTxt\">Salāt</span>. ",
            "The he<sup>saww</sup> woud lie down. Then he<sup>saww</sup> would stand, so he<sup>saww</sup> would brush his<sup>saww</sup> teeth and perform ablution, and he<sup>saww</sup> would pray four <span class=\"iTxt\">Rak’at</span> of <span class=\"iTxt\">Salāt</span>. Then he<sup>saww</sup> would lie down until when it was during the face of the morning, he<sup>saww</sup> would stand, so he<sup>saww</sup> would perform (Salāt) Al-<span class=\"iTxt\">Witr</span>, then pray the two <span class=\"iTxt\">Rak’at</span> of <span class=\"iTxt\">Salāt</span>’.",
            "Then he<sup>asws</sup> said: ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:33#h21\">[33:21]</a> Certainly you have in Rasool-Allah an excellent exemplar</span>’. I said, ‘When was he<sup>saww</sup> standing (for the night <span class=\"iTxt\">Salāt</span>)?’ He<sup>asws</sup> said ‘After a third of the night’. And he<sup>asws</sup> said in another Hadeeth: ‘After half the night’. ",
            "And in another report: ‘It should so happen that his standing, and his <span class=\"iTxt\">Rukū</span>, and his Sajdah should be equal, and he should brush teeth every time he stands from his sleep, and he should recite the Verses from (Surah) Aal-e-Imraan (Chapter 3) <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h190\">[3:190]</a> Most surely in the Creation of the skies and the earth</span> up to His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h194\">[3:194]</a> surely You do not fail to Fulfil the Promise</span>’."
          ],
          "en.sarwar": [
            "13. Ali ibn Ibrahim has narrated from his father from ibn abu ‘ Umayr from Hammad from al-Halabiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘The Messenger of Allah, after performing ‘Isha’ al- Akhirah (the late evening Salah (prayer)) would ask that water for his Wudu’ and toothbrush be placed near his pillow under a cover. He then would sleep as long as Allah willed then he would wake up, brush, make Wudu’ and perform four Rak‘at Salah (prayer). He thereafter he would sleep, then wake up, brush, make Wudu’ and perform four Rak‘at Salah (prayer), then sleep until about dawn then he would get up for witr, then perform two Rak‘at Salah (prayer).’ The Imam then said, ‘The Messenger of Allah was a good lesson for you.’ I (the narrator) asked, ‘What time would he wake up? 5 The Imam replied, ‘He would wake up after one-third of the night.’ In another Hadith he has said, ‘He would wake up after midnight.’ Yet in another Hadith it is stated that his waking up, Ruku‘ and sajdah were of the same proportion. Each time, after waking up, he would brush and read verses 190 -194 of Chapter Three.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/405)"
        ],
        "index": 5534,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:14",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يُصَلِّي مِنَ اللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً مِنْهَا الْوَتْرُ وَ رَكْعَتَا الْفَجْرِ فِي السَّفَرِ وَ الْحَضَرِ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Fazzal, from Ibn Bukeyr, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> used to pray, from the night (<span class=\"iTxt\">Salāts</span>), thirteen <span class=\"iTxt\">Rak’at</span>, from it being Al-<span class=\"iTxt\">Witr</span>, and two <span class=\"iTxt\">Rak’at</span> of <span class=\"iTxt\">Al-Fajr</span>, during the travel and the staying’."
          ],
          "en.sarwar": [
            "14. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn Faddal from ibn Bukayr from Zurarah who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said that the Messenger of Allah would perform thirteen Rak‘at at night of which one Rak‘at was al-Witr and two Rak‘at of the morning whether on a journey or at home.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/405)"
        ],
        "index": 5535,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:15",
        "text": [
          "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنِ الْحَارِثِ بْنِ الْمُغِيرَةِ النَّصْرِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ صَلَاةُ النَّهَارِ سِتَّ عَشْرَةَ رَكْعَةً ثَمَانٌ إِذَا زَالَتِ الشَّمْسُ وَ ثَمَانٌ بَعْدَ الظُّهْرِ وَ أَرْبَعُ رَكَعَاتٍ بَعْدَ الْمَغْرِبِ يَا حَارِثُ لَا تَدَعْهُنَّ فِي سَفَرٍ وَ لَا حَضَرٍ وَ رَكْعَتَانِ بَعْدَ الْعِشَاءِ الْآخِرَةِ كَانَ أَبِي يُصَلِّيهِمَا وَ هُوَ قَاعِدٌ وَ أَنَا أُصَلِّيهِمَا وَ أَنَا قَائِمٌ وَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يُصَلِّي ثَلَاثَ عَشْرَةَ رَكْعَةً مِنَ اللَّيْلِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ahmad Bin Muhammad, from Ali Bin Hadeed, from Ali Bin Al Numan, from Al Haris Bin Mugheira Al Nasry who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘A <span class=\"iTxt\">Salāt</span> of the daytime is of sixteen <span class=\"iTxt\">Rak’at</span> – eight being when the sun (starts to) decline, and eight After <span class=\"iTxt\">Al Zohr</span>, and four <span class=\"iTxt\">Rak’at</span> after <span class=\"iTxt\">Al- Maghrib</span>. O Haris! Do not leave these, neither during a journey nor staying; and the two <span class=\"iTxt\">Rak’at</span> of <span class=\"iTxt\">Al Isha</span> the last, my<sup>asws</sup> father<sup>asws</sup> was praying these two while he<sup>asws</sup> was seated, and I<sup>asws</sup> pray these two while I<sup>asws</sup> am standing; and it was so that Rasool-Allah<sup>saww</sup> used to pray thirteen <span class=\"iTxt\">Rak’at</span> of <span class=\"iTxt\">Salāt</span>, from night time’."
          ],
          "en.sarwar": [
            "15. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn Hadid from Ali ibn al-Nu‘man from al-Harith ibn al- Mughirah al-Nasriy who has said the following: “I heard abu ‘Abd Allah, saying, ‘During the day there are sixteen Rak‘ats Salah (prayer). There are eight after the sun declines to the west at noon, eight after Dhuhr Salah (prayer), four Rak‘at after Maghrib (soon after sunset) - O Harith do not miss them at home or on a journey- and two Rak‘at after the ‘Isha’ al-Akhirah (late evening Salah (prayer)). My father would perform these two Rak‘at in a sitting position. I perform them in a standing position. The Messenger of Allah would perform thirteen Rak‘at Salah (prayer) during the night.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/406)"
        ],
        "index": 5536,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:16",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ قَالَ حَدَّثَنِي إِسْمَاعِيلُ بْنُ سَعْدٍ الْأَحْوَصُ قَالَ قُلْتُ لِلرِّضَا ( عليه السلام ) كَمِ الصَّلَاةُ مِنْ رَكْعَةٍ فَقَالَ إِحْدَى وَ خَمْسُونَ رَكْعَةً .",
          "مُحَمَّدُ بْنُ أَحْمَدَ بْنِ يَحْيَى عَنْ مُحَمَّدِ بْنِ عِيسَى مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus who said, ‘Ismail Bin Saeed Al-Ahous narrated to me saying, ",
            "‘I said to Al-Reza<sup>asws</sup>, ‘How many <span class=\"iTxt\">Rak’at</span> are in the (daily) <span class=\"iTxt\">Salāts</span>?’ So he<sup>asws</sup> said: ‘Fifty-one <span class=\"iTxt\">Rak’at</span>’.",
            "Muhammad Bin Ahmad Bin Yahya, from Muhammad Bin Isa – similar to it."
          ],
          "en.sarwar": [
            "16. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus who has said that narrated to him ’Isma‘il ibn Sa‘d al-Ahwas who has said the following: “I asked al-Rida, ‘Alayhi al-Salam, ‘Of how many Rak‘at does Salah (prayer) consist?’ He replied, ‘There are fifty-one Rak‘at (every day).”’ Muhammad ibn Ahmad ibn Yahya has narrated from Muhammad ibn ‘Isa a similar Hadith. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/406)"
        ],
        "index": 5537,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:17",
        "refs": {
          "Mentions": [
            "/books/quran:73:6",
            "/books/quran:73:7"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّ ناشِئَةَ اللَّيْلِ هِيَ أَشَدُّ وَطْئاً وَ أَقْوَمُ قِيلًا قَالَ يَعْنِي بِقَوْلِهِ وَ أَقْوَمُ قِيلًا قِيَامَ الرَّجُلِ عَنْ فِرَاشِهِ يُرِيدُ بِهِ اللَّهَ لَا يُرِيدُ بِهِ غَيْرَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Hisham Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:73#h6\">[73:6]</a> Surely the rising by night is the firmest way to tread and the best speech</span>. He<sup>asws</sup> said: ‘The Meaning of His<sup>azwj</sup> Words <span class=\"ibTxt\">best speech </span>is the standing of the man from his bed intending Allah<sup>azwj</sup> by it, not intending anything else by it’."
          ],
          "en.sarwar": [
            "17. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn abu ‘Umayr from Hisham ibn Salim who has said the following: “About the words of Allah, the Most Majestic, the Most Glorious, ‘nightly initiation is of strong impression and of strongest words’ <a href=\"/#/books/quran:73#h7\">[73:7]</a> abu ‘Abd Allah, ‘Alayhi al-Salam, has said, “‘strongest words” means a man’s getting up from his bed just for the sake of Allah and for no other considerations.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/406)"
        ],
        "index": 5538,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:18",
        "refs": {
          "Mentions": [
            "/books/quran:51:17",
            "/books/quran:51:18"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ الْعَبْدَ يُوقَظُ ثَلَاثَ مَرَّاتٍ مِنَ اللَّيْلِ فَإِنْ لَمْ يَقُمْ أَتَاهُ الشَّيْطَانُ فَبَالَ فِي أُذُنِهِ ",
          "قَالَ وَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ كانُوا قَلِيلًا مِنَ اللَّيْلِ ما يَهْجَعُونَ قَالَ كَانُوا أَقَلَّ اللَّيَالِي تَفُوتُهُمْ لَا يَقُومُونَ فِيهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umeyr, from Abu Ayoub Al-Khazaz, from Muhammad Bin Muslim who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The servant wakes up three times at night, so if he does not stand (for <span class=\"iTxt\">Salāt</span>), the Satan<sup>la</sup> comes to him and urinates in his ear’.",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:51#h17\">[51:17]</a> They used to sleep but little in the night</span>. He<sup>asws</sup> said: ‘There were very few nights which they missed out on, not standing (for the <span class=\"iTxt\">Salāt</span>) in them’."
          ],
          "en.sarwar": [
            "18. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Ayyub al-Khazzaz from Muhammad ibn Muslim who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ‘A servant (of Allah) wakes up three times at night and if he still is not up (for Salah (prayer)) Satan comes and urinates in his ears.’ I then asked about the words of Allah, the Most Majestic, the Most Glorious, ‘They would sleep very little at night’. <a href=\"/#/books/quran:51#h18\">[51:18]</a> The Imam replied, ‘There were few nights in which they would miss getting up for Salah (prayer)).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/407)"
        ],
        "index": 5539,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:19",
        "text": [
          "عَنْهُ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ عُمَرَ بْنِ يَزِيدَ أَنَّهُ سَمِعَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ فِي اللَّيْلِ لَسَاعَةً مَا يُوَافِقُهَا عَبْدٌ مُسْلِمٌ يُصَلِّي وَ يَدْعُو اللَّهَ فِيهَا إِلَّا اسْتُجِيبَ لَهُ فِي كُلِّ لَيْلَةٍ قُلْتُ أَصْلَحَكَ اللَّهُ فَأَيُّ سَاعَةٍ هِيَ مِنَ اللَّيْلِ قَالَ إِذَا مَضَى نِصْفُ اللَّيْلِ فِي السُّدُسِ الْأَوَّلِ مِنَ النِّصْفِ الْبَاقِي ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, ",
            "(It has been narrated) from Umar Bin Yazeed having heard Abu Abdullah<sup>asws</sup> saying: ‘During the night there is a time what is compatible for a submissive servant to pray <span class=\"iTxt\">Salāt</span> and supplicate to Allah<sup>azwj</sup> during it, except that it would be Answered to him during every night’. I said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! So which time from the night is it?’ He<sup>asws</sup> said: ‘When half the night passes by, during the first sixth of the remaining half’."
          ],
          "en.sarwar": [
            "19. It is a narration from him (narrator of previous Hadith) by his father from ibn abu ‘Umayr from ‘Umar ibn ’Udhaynah from ‘Umar ibn Yazid say the following: “I heard abu ’Abd Allah, ‘Alayhi al-Salam, say, ‘In the night there is an hour in which if a Muslim performs Salah (prayer) and appeals before Allah for a wish; his prayer is answered every night. I (the narrator) then asked saying, ‘I pray to Allah to keep you well, which hour is it?’ The Imam replied, ‘It is in the first one-sixth of the second half of the night.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/408)"
        ],
        "index": 5540,
        "local_index": 20,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:20",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ إِنَّ رَجُلًا مِنْ مَوَالِيكَ مِنْ صُلَحَائِهِمْ شَكَا إِلَيَّ مَا يَلْقَى مِنَ النَّوْمِ وَ قَالَ إِنِّي أُرِيدُ الْقِيَامَ إِلَى الصَّلَاةِ بِاللَّيْلِ فَيَغْلِبُنِي النَّوْمُ حَتَّى أُصْبِحَ وَ رُبَّمَا قَضَيْتُ صَلَاتِيَ الشَّهْرَ مُتَتَابِعاً وَ الشَّهْرَيْنِ أَصْبِرُ عَلَى ثِقَلِهِ فَقَالَ قُرَّةُ عَيْنٍ لَهُ وَ اللَّهِ",
          "قَالَ وَ لَمْ يُرَخِّصْ لَهُ فِي الصَّلَاةِ فِي أَوَّلِ اللَّيْلِ وَ قَالَ الْقَضَاءُ بِالنَّهَارِ أَفْضَلُ قُلْتُ فَإِنَّ مِنْ نِسَائِنَا أَبْكَاراً الْجَارِيَةَ تُحِبُّ الْخَيْرَ وَ أَهْلَهُ وَ تَحْرِصُ عَلَى الصَّلَاةِ فَيَغْلِبُهَا النَّوْمُ حَتَّى رُبَّمَا قَضَتْ وَ رُبَّمَا ضَعُفَتْ عَنْ قَضَائِهِ وَ هِيَ تَقْوَى عَلَيْهِ أَوَّلَ اللَّيْلِ فَرَخَّصَ لَهُنَّ فِي الصَّلَاةِ أَوَّلَ اللَّيْلِ إِذَا ضَعُفْنَ وَ ضَيَّعْنَ الْقَضَاءَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al-Husayn Bin Saeed, from Hammad Bin Isa, from Muawiya Bin Wahab, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘A man from the ones in your<sup>asws</sup> Wilayah, from their righteous ones, complained to me of what he faced from the sleep, and said, ‘I intend to stand to the <span class=\"iTxt\">Salāt</span> at night, but the sleep overcomes me until morning, and sometimes I fulfil my (missed out) <span class=\"iTxt\">Salāt</span> of the month consecutively, and for the two months, bearing patiently upon its heaviness’’. So he<sup>asws</sup> said: ‘A delight for his eyes, by Allah<sup>azwj</sup>!’.",
            "He (the narrator) said, ‘And he<sup>asws</sup> did not permit for him regarding the (fulfilling of the outstanding) <span class=\"iTxt\">Salāt</span> during the first part of the night, and said: ‘The fulfilment at daytime is superior’. I said, ‘But there are virgins of our womenfolk, the young girls who love the goodness and its performance, and are covetous upon the <span class=\"iTxt\">Salāt</span>, but the sleep overcomes them until sometimes they fulfil, and sometimes they are too weak from fulfilling it, and they are strong upon it at the beginning of the night’. So he<sup>asws</sup> permitted for them with regard to the <span class=\"iTxt\">Salāt</span> at the beginning of the night when they were too weak and wasting the fulfilment’."
          ],
          "en.sarwar": [
            "20. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Hammad ibn ‘Isa from Mu‘awiyah ibn Wahab who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘A man of your followers, of their virtuous ones complained before me against sleep. He said that he wants to get up for the nightly optional Salah (prayer) but sleep overcomes him until it is morning. Sometimes he performs the compensatory prayer for a whole month of missed Salah (prayer) or two months and bears with its heaviness.’ He (the Imam) said, ‘It is the delight for his eyes, by Allah.’ He (the narrator) has said that he (the Imam) did not give him permission to perform his nightly optional Salah (prayer) in the beginning of the night, saying, ‘To do compensatory prayer for them during the day is better.’ I (the narrator) then said, ‘Of our virgin girls there are those who love good and people of goodness. They try to perform Salah (prayer) but sleep overcomes them, and perhaps they may perform the compensatory prayer for what is missed and perhaps face weakness in performing the compensatory prayer for what is missed, but she is able to perform in the beginning of the night. He (the Imam) granted them permission to perform Salah (prayer) in the beginning of the night if they feel weakness and lose performing the compensatory prayer for what is missed.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/409)"
        ],
        "index": 5541,
        "local_index": 21,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:21",
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنِ ابْنِ بُكَيْرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَا كَانَ يُحْمَدُ الرَّجُلُ أَنْ يَقُومَ مِنْ آخِرِ اللَّيْلِ فَيُصَلِّيَ صَلَاتَهُ ضَرْبَةً وَاحِدَةً ثُمَّ يَنَامَ وَ يَذْهَبَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, from Safwan, from Ibn Bukeyr who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘If a man were to stand at the end of the night, so he prays his <span class=\"iTxt\">Salāt</span> in one go, and then he goes (away) and sleeps, is not Praiseworthy.’"
          ],
          "en.sarwar": [
            "21. Ahmad ibn Idris has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan from ibn Bukayr who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘A man who gets up in the end of the night to perform his nightly optional Salah (prayer), all of them at one time and goes away to sleep, is not very praiseworthy.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/409)"
        ],
        "index": 5542,
        "local_index": 22,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:22",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنِ ابْنِ مُسْكَانَ عَنِ الْحَسَنِ الصَّيْقَلِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ الرَّجُلُ يُصَلِّي الرَّكْعَتَيْنِ مِنَ الْوَتْرِ ثُمَّ يَقُومُ فَيَنْسَى التَّشَهُّدَ حَتَّى يَرْكَعَ وَ يَذْكُرُ وَ هُوَ رَاكِعٌ قَالَ يَجْلِسُ مِنْ رُكُوعِهِ فَيَتَشَهَّدُ ثُمَّ يَقُومُ فَيُتِمُّ ",
          "قَالَ قُلْتُ أَ لَيْسَ قُلْتَ فِي الْفَرِيضَةِ إِذَا ذَكَرَهُ بَعْدَ مَا رَكَعَ مَضَى ثُمَّ سَجَدَ سَجْدَتَيِ السَّهْوِ بَعْدَ مَا يَنْصَرِفُ وَ يَتَشَهَّدُ فِيهِمَا قَالَ لَيْسَ النَّافِلَةُ مِثْلَ الْفَرِيضَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Bin Al-Mugheira, from Ibn Muskan, from Al-Hassan Al-Sayqal, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘The man prays the two <span class=\"iTxt\">Rak’at</span> of Al-<span class=\"iTxt\">Witr</span>, then he stands, but he forgets the <span class=\"iTxt\">Tashahhud</span> until he has performed <span class=\"iTxt\">Rukū</span> (in the third <span class=\"iTxt\">Rak’at</span>), and he remembers while he is going down in the <span class=\"iTxt\">Rukū</span>’. He<sup>asws</sup> said: ‘He should be seated from his <span class=\"iTxt\">Rukū</span>, and he should perform <span class=\"iTxt\">Tashahhud</span>, then she should stand and complete (the <span class=\"iTxt\">Salāt</span>)’. ",
            "He (the narrator) said, ‘I said, ‘Did you<sup>asws</sup> not say regarding the obligatory (Salāt), when he remembers it after having performed the <span class=\"iTxt\">Rukū</span>, he should continue, then perform <span class=\"iTxt\">Sajdah</span> with two Sajdahs (of omission – <span class=\"iTxt\">Sajda-e-Sahw</span>) after having finished, and he should perform <span class=\"iTxt\">Tashahhud</span> in these two?’ He<sup>asws</sup> said: ‘The optional (Salāt) is not like the Obligatory (Salāt)’."
          ],
          "en.sarwar": [
            "22. Ali ibn Ibrahim has narrated from his father from ‘Abd Allah ibn al-Mughirah from ibn Muskan from al-Hassan al-Sayqal who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who performs two Rak‘at of al-Witr, then stands up and forgets saying Tashahhud (testimonies of belief) until he performs Ruku‘ (bowing down on one’s knees), then remembers when he is in Ruku‘. He (the Imam) said, ‘He is required to sit down from Ruku‘, say Tashahhud, then stand up and complete.’ He (the narrator) has said that he asked, ‘Have you not said that in obligatory Salah (prayer) if one remembers after Ruku‘, one continues, then performs two Sajdah (prostration) because of mistake after ending Salah (prayer) in which one says Tashahhud (testimonies of belief)?’ He (the Imam) said, ‘Optional Salah (prayer) is not like obligatory one.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/410)"
        ],
        "index": 5543,
        "local_index": 23,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:23",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنْ فَضَالَةَ بْنِ أَيُّوبَ وَ حَمَّادِ بْنِ عِيسَى عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ أَفْضَلِ سَاعَاتِ الْوَتْرِ فَقَالَ الْفَجْرُ أَوَّلُ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al-Husayn Bin Muhammad Al-Ashary, from Abdullah Bin Aamir, from Ali Bin Mahziyar, from Fazalat Bin Ayoub, and Hammad Bin Isa, from Muawiya Bin Wahaba who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the most superior of the timings for Al-<span class=\"iTxt\">Witr</span>. So he<sup>asws</sup> said: ‘The dawn is the beginning of that’."
          ],
          "en.sarwar": [
            "23. Al-Husayn ibn Muhammad al-Ash’ariy has narrated from ‘Abd Allah ibn ‘Amir Ali ibn Mahziyar from Fadalah ibn Ayyub and Hammad ibn ‘Isa from Mu‘awiyah ibn Wahab who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the most excellent time for al-Witr. He (the Imam) said, ‘Dawn is the beginning of it.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/410)"
        ],
        "index": 5544,
        "local_index": 24,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:24",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِسْمَاعِيلَ بْنِ أَبِي سَارَةَ قَالَ أَخْبَرَنِي أَبَانُ بْنُ تَغْلِبَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَيَّةَ سَاعَةٍ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يُوتِرُ فَقَالَ عَلَى مِثْلِ مَغِيبِ الشَّمْسِ إِلَى صَلَاةِ الْمَغْرِبِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al-Husayn, from Ibn Abu Umeyr, from Ismail Bin Abu Sara who said, ",
            "‘Aban Bin Taghlub informed me saying, ‘I said to Abu Abdullah<sup>asws</sup>, ‘During which time did Rasool-Allah<sup>saww</sup> pray <span class=\"iTxt\">Al-Witr </span>(Salāt)?’ So he<sup>asws</sup> said: ‘Upon the like of the setting of the sun up to <span class=\"iTxt\">Al-Maghrib Salāt</span>’."
          ],
          "en.sarwar": [
            "24. Muhammad ibn Yahya has narrated from Al-Husayn ibn abu ‘Umayr from ’Isma‘il ibn abu Sarah from Aban ibn Taghlib who has said the following: “I once asked abu ’Abd Allah, ‘Alayhi al-Salam, ’What time did the Messenger of Allah perform al- Witr?’ He (the Imam) said, ’Within a time like from sunset to al-Maghrib Salah (prayer).’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/411)"
        ],
        "index": 5545,
        "local_index": 25,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:25",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ زُرَارَةَ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) الرَّكْعَتَانِ اللَّتَانِ قَبْلَ الْغَدَاةِ أَيْنَ مَوْضِعُهُمَا فَقَالَ قَبْلَ طُلُوعِ الْفَجْرِ فَإِذَا طَلَعَ الْفَجْرُ فَقَدْ دَخَلَ وَقْتُ الْغَدَاةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibn Azina, from Zurara who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘The two <span class=\"iTxt\">Rak’at</span> which are before the morning, where is their place?’ So he<sup>asws</sup> said: ‘Before the emergence of the dawn. So when the dawn emerges, so the time for the morning has entered’."
          ],
          "en.sarwar": [
            "25. Ali ibn Ibrahim has narrated from his father from ibn abu ‘ Umayr from ibn ’Udhaynah from Zurarah who has said the following: “I once asked abu Ja’far, ‘Alayhi al-Salam, about the two Rak’at before the morning, ‘When is the time for them?’ He (the Imam) said, ’It is before dawn. When it is dawn, it becomes time for the morning.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/412)"
        ],
        "index": 5546,
        "local_index": 26,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:26",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ أَسْبَاطٍ عَنْ إِبْرَاهِيمَ بْنِ أَبِي الْبِلَادِ قَالَ صَلَّيْتُ خَلْفَ الرِّضَا ( عليه السلام ) فِي الْمَسْجِدِ الْحَرَامِ صَلَاةَ اللَّيْلِ فَلَمَّا فَرَغَ جَعَلَ مَكَانَ الضَّجْعَةِ سَجْدَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Ibn Asbaat, from Ibrahim Bin Abu Al-Balaad who said, ",
            "‘I prayed <span class=\"iTxt\">Salāt</span> behind Al-Reza<sup>asws</sup> in the Sacred Masjid, the night <span class=\"iTxt\">Salāt</span>. So when he<sup>asws</sup> was free, he<sup>asws</sup> made the place of rest as a Sajdah’."
          ],
          "en.sarwar": [
            "26. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from ibn Asbat from Ibrahim ibn abu al-Balad who has said the following: “I performed my Salah (prayer), in Masjid al-Haram. Al-Rida’ ‘Alayhi al-Salam, led the Salah (prayer). It was Salah (prayer) of night. When he (the Imam) completed, he (the Imam) made his sleep (instead of sleeping after Salah (prayer)) into a Sajdah (prostration).” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/412)"
        ],
        "index": 5547,
        "local_index": 27,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:27",
        "text": [
          "وَ عَنْهُ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنِ الْحَجَّالِ عَنْ عَبْدِ اللَّهِ بْنِ الْوَلِيدِ الْكِنْدِيِّ عَنْ إِسْمَاعِيلَ بْنِ جَابِرٍ أَوْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي أَقُومُ آخِرَ اللَّيْلِ وَ أَخَافُ الصُّبْحَ قَالَ اقْرَأِ الْحَمْدَ وَ اعْجَلْ وَ اعْجَلْ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Muhammad Bin Al-Husayn, from Al-Hajjal, from Abdullah Bin Al-Waleed Al-Kindy, from Ismail Bin Jabir, or Abdullah Bin Sinan who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I stand (for <span class=\"iTxt\">Salāt</span>) at the end of the night, and I fear the morning’. He<sup>asws</sup> said: ‘Recite Al-Hamd (Chapter 1), and hasten, and hasten’."
          ],
          "en.sarwar": [
            "27. It is a narration from him (narrator of previous Hadith) by Muhammad ibn al-Husayn from al-Hajjal from ‘Abd Allah ibn al-Walid al- Kindiy from ’Isma‘il ibn Jabir or ‘Abd Allah ibn Sinan who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘I get up in the end of the night and I fear (of the coming of dawn before completing).’ He (the Imam) said, ‘Recite just al-Fatihah, and make it faster and faster.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/412)"
        ],
        "index": 5548,
        "local_index": 28,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:28",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنِ الْقَاسِمِ بْنِ يَزِيدَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يَقُومُ مِنْ آخِرِ اللَّيْلِ وَ هُوَ يَخْشَى أَنْ يَفْجَأَهُ الصُّبْحُ أَ يَبْدَأُ بِالْوَتْرِ أَوْ يُصَلِّي الصَّلَاةَ عَلَى وَجْهِهَا حَتَّى يَكُونَ الْوَتْرُ آخِرَ ذَلِكَ قَالَ بَلْ يَبْدَأُ بِالْوَتْرِ وَ قَالَ أَنَا كُنْتُ فَاعِلًا ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al-Husayn Bin Muhammad, from Abdullah Bin Aamir, from Ali Bin Mahziyar, from Fazalat Bin Ayoub, from Al-Qasim Bin Yazeed, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the man who stands (for the <span class=\"iTxt\">Salāt</span>) at the end of the night and he is fearing if the morning comes up suddenly, should he begin with Al-<span class=\"iTxt\">Witr</span>, or pray the <span class=\"iTxt\">Salāt</span> upon its aspects until <span class=\"iTxt\">Al-Witr </span>happens to be at the end of that?’ He<sup>asws</sup> said: ‘But, he should begin with <span class=\"iTxt\">Al-Witr</span>’. And he<sup>asws</sup> said: ‘I<sup>asws</sup> was doing that’."
          ],
          "en.sarwar": [
            "28. Al-Husayn ibn Muhammad has narrated from ‘Abd Allah ibn ‘Amir from Ali ibn Mahziyar from Fadalah ibn Ayyub from al-Qasim ibn Yazid from Muhammad ibn Muslim who has said the following: “I once asked abu Ja’far, ‘Alayhi al-Salam, about a man who gets up in the end of the night and he is afraid of coming of dawn (before completing). Should he begin with al-Witr or perform Salah (prayer) as normal so that al-Witr becomes the last item?’ He (the Imam) said, ’He begins with al-Witr.’ He (the Imam) said, ’I have done so.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/413)"
        ],
        "index": 5549,
        "local_index": 29,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:29",
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي وَلَّادٍ حَفْصِ بْنِ سَالِمٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ التَّسْلِيمِ فِي رَكْعَتَيِ الْوَتْرِ فَقَالَ نَعَمْ وَ إِنْ كَانَتْ لَكَ حَاجَةٌ فَاخْرُجْ وَ اقْضِهَا ثُمَّ عُدْ وَ ارْكَعْ رَكْعَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Ahmad Bin Muhammad, from Ibn Mahboub, from Abu Wallad Hafs Bin Saalim who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the <span class=\"iTxt\">Salām </span>in the two <span class=\"iTxt\">Rak’at </span>(<span class=\"iTxt\">Rak’at</span>s) of <span class=\"iTxt\">Al-Witr</span>’. So he<sup>asws</sup> said: ‘Yes, and even if there was a need for you, so go out and fulfil it, then return and <span class=\"iTxt\">Rukū</span> with a <span class=\"iTxt\">Rukū</span>’."
          ],
          "en.sarwar": [
            "29. Ahmad ibn Idris has narrated from Ahmad ibn Muhammad from ibn Mahbub from abu Wallad Hafs ibn Salim who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about Salam (the phrase of offering greeting of peace) in the two Rak’at of al-Witr. He (the Imam) said, ‘Yes, if you may need something, you can go out and when you are prepared, then come back to perform one Rak’at.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/413)"
        ],
        "index": 5550,
        "local_index": 30,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:30",
        "refs": {
          "Mentions": [
            "/books/quran:112:1"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنِ ابْنِ سِنَانٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْوَتْرِ مَا يُقْرَأُ فِيهِنَّ جَمِيعاً قَالَ بِقُلْ هُوَ اللَّهُ أَحَدٌ قُلْتُ فِي ثَلَاثِهِنَّ قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Ibn Sinan who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about Al-<span class=\"iTxt\">Witr</span>, what is to be recited therein together’. He<sup>asws</sup> said: ‘With <span class=\"ibTxt\"><a href=\"/#/books/quran:112#h1\">[112:1]</a> Say He Allah is One </span>(Chapter 1112)’. I said, ‘In the three (<span class=\"iTxt\">Rak’at</span>) of them?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            "30. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from ibn Sinan who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about al-Witr and what is recited in them all. He (the Imam) said, ‘Qul Huwa Allahu Ahad is recited.’ I then asked, ‘Is it read in all three of them?’ He (the Imam) said, ‘Yes, it is read in all three of them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/413)"
        ],
        "index": 5551,
        "local_index": 31,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:31",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ سُئِلَ عَنِ الْقُنُوتِ فِي الْوَتْرِ هَلْ فِيهِ شَيْ‏ءٌ مُوَقَّتٌ يُتَّبَعُ وَ يُقَالُ فَقَالَ لَا أَثْنِ عَلَى اللَّهِ عَزَّ وَ جَلَّ وَ صَلِّ عَلَى النَّبِيِّ ( صلى الله عليه وآله ) وَ اسْتَغْفِرْ لِذَنْبِكَ الْعَظِيمِ ثُمَّ قَالَ كُلُّ ذَنْبٍ عَظِيمٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Ibn Abu Umeyr, from Hammad, from Al-Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having been asked about the <span class=\"iTxt\">Qunut</span> in <span class=\"iTxt\">Al-Witr </span>(Salāt), ‘Is there anything fixed to be followed and said?’ So he<sup>asws</sup> said: ‘No. Laud upon Allah<sup>azwj</sup> Mighty and Majestic and send Blessings upon the Prophet<sup>saww</sup>, and seek Forgiveness for your grievous sins’. Then he<sup>asws</sup> said: ‘Every sin is grievous’."
          ],
          "en.sarwar": [
            "31. Ali has narrated from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, was asked about Qunut (supplication after recitation) in al-Witr: if there is a definite reading for it which is followed and recited. He (the Imam) said, ‘No, there is no definite reading for it. Praise Allah, most Majestic, most Glorious, and say, ‘O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and ask Allah to forgive your great sins.’ He (the Imam) then said, ’Every sin is great.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/413)"
        ],
        "index": 5552,
        "local_index": 32,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:32",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَبَانٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) الْقُنُوتُ فِي الْوَتْرِ الِاسْتِغْفَارُ وَ فِي الْفَرِيضَةِ الدُّعَاءُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al-Husayn Bin Muhammad, from Moalla Bin Muhammad, from Aban, from Abdul Rahman Bin Abu Abdullah who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The <span class=\"iTxt\">Qunut</span> in <span class=\"iTxt\">Al-Witr </span>(Salāt) is the seeking of Forgiveness, and in the Obligatory (Salāt), it is the supplication’."
          ],
          "en.sarwar": [
            "32. Al-Husayn ibn Muhammad has narrated from al-‘Ala’ ibn Muhammad from Aban from ‘Abd al-Rahman ibn abu ‘Abd Allah who has said the following: “Abu ’Abd Allah, ‘Alayhi al-Salam, has said, ‘Qunut (supplication after recitation) in al-Witr is asking for forgiveness and in obligatory Salah (prayer) it is to ask for your wishes.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/414)"
        ],
        "index": 5553,
        "local_index": 33,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:33",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مَنْصُورِ بْنِ حَازِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ اسْتَغْفِرِ اللَّهَ فِي الْوَتْرِ سَبْعِينَ مَرَّةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al-Fazl Bin Sh<span class=\"iTxt\">Azaan</span>, from Safwan Bin Yahya, from Mansour Bin Hazim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The seeking of Forgiveness in <span class=\"iTxt\">Al-Witr </span>(Salāt) is seventy times’."
          ],
          "en.sarwar": [
            "33. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya from Mansur ibn Hazim who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that in al-Witr, ask forgiveness from Allah seventy times.” (Ahadith 20-34 are best explained in the form of fatwa.) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/414)"
        ],
        "index": 5554,
        "local_index": 34,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:34",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ عِمْرَانَ بْنِ مُوسَى عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ النُّعْمَانِ عَنْ أَبِيهِ عَنْ بَعْضِ رِجَالِهِ قَالَ جَاءَ رَجُلٌ إِلَى أَمِيرِ الْمُؤْمِنِينَ عَلِيِّ بْنِ أَبِي طَالِبٍ ( صلوات الله عليه ) فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنِّي قَدْ حُرِمْتُ الصَّلَاةَ بِاللَّيْلِ فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَنْتَ رَجُلٌ قَدْ قَيَّدَتْكَ ذُنُوبُكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Imran Bin Musa, from Al-Hassan Bin Ali Bin Al-Numan, from his father, from one of his men who said, ",
            "‘A man came over to Amir Al-Momineen Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, so he said, ‘O Amir Al-Momineen<sup>asws</sup>! I have been deprived of the <span class=\"iTxt\">Salāt</span> at night’. So Amir Al-Momineen<sup>asws</sup> said: ‘You are a man, your sins have restricted you’."
          ],
          "en.sarwar": [
            "34. Muhammad ibn Yahya has narrated from ‘Imran ibn Musa from al-Hassan ibn Ali ibn al-Nu‘man from his father from certain individuals of his people who has said the following: “A man came to Amir al-Mu’minin Ali, ibn abu Talib, ‘Alayhi al-Salam, and said, ’O Amir al- Mu’minin, I am deprived of Salah (prayer) at night.’ Amir al-Mu’minin said, ‘Your sins have tied you down.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/414)"
        ],
        "index": 5555,
        "local_index": 35,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:84:35",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ قَالَ قَرَأْتُ فِي كِتَابِ رَجُلٍ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) الرَّكْعَتَانِ اللَّتَانِ قَبْلَ صَلَاةِ الْفَجْرِ مِنْ صَلَاةِ اللَّيْلِ هِيَ أَمْ مِنْ صَلَاةِ النَّهَارِ وَ فِي أَيِّ وَقْتٍ أُصَلِّيهَا فَكَتَبَ بِخَطِّهِ احْشُهَا فِي صَلَاةِ اللَّيْلِ حَشْواً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Ali Bin Mahziyar who said, ",
            "‘I read in the letter of a man to Abu Abdullah<sup>asws</sup>, ‘The two <span class=\"iTxt\">Rak’at</span> which are before <span class=\"iTxt\">Al-Fajr Salāt</span>, are there from the <span class=\"iTxt\">Salāts</span> of the night or from the <span class=\"iTxt\">Salāts</span> of the daytime, and in which time should I be praying these?’ So he<sup>asws</sup> wrote in his<sup>asws</sup> own handwriting: ‘Fill them in the night <span class=\"iTxt\">Salāt</span> with a complete filling’."
          ],
          "en.sarwar": [
            "35. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Ali ibn Mahziyar from who has said the following: “I have read in a letter of a man to abu ‘Abd Allah, ‘Alayhi al-Salam, and it says, ‘Are the two Rak‘at before Salah (prayer) of dawn of Salah (prayer) during the night? Or it is of Salah (prayer) during the day and when should I perform them?’ With his handwriting he (the Imam) had written, ‘Fill them in Salah (prayer) of night a complete filling.’” (Hadith 35 and the following chapter are best explained by fatwa.) "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:4:84",
  "kind": "verse_list"
}