{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:3:4", "titles": {"ar": "كِتَابُ الصَّلَاةِ", "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "}}, {"indexed_titles": {"en": "Chapter 86"}, "path": "/books/al-kafi:3:4:86", "titles": {"ar": "باب صَلَاةِ الْخَوْفِ", "en": "Chapter 86 – Salāt of (during) fear"}}], "index": 753, "local_index": 86, "part_type": "Chapter", "path": "/books/al-kafi:3:4:86", "titles": {"ar": "باب صَلَاةِ الْخَوْفِ", "en": "Chapter 86 – Salāt of (during) fear"}, "verse_count": 6, "verse_start_index": 5575, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 5576, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:4:86:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ صَلَاةِ الْخَوْفِ قَالَ يَقُومُ الْإِمَامُ وَ تَجِي‏ءُ طَائِفَةٌ مِنْ أَصْحَابِهِ فَيَقُومُونَ خَلْفَهُ وَ طَائِفَةٌ بِإِزَاءِ الْعَدُوِّ فَيُصَلِّي بِهِمُ الْإِمَامُ رَكْعَةً ثُمَّ يَقُومُ وَ يَقُومُونَ مَعَهُ فَيَمْثُلُ قَائِماً وَ يُصَلُّونَ هُمُ الرَّكْعَةَ الثَّانِيَةَ ثُمَّ يُسَلِّمُ بَعْضُهُمْ عَلَى بَعْضٍ ثُمَّ يَنْصَرِفُونَ ", "فَيَقُومُونَ فِي مَقَامِ أَصْحَابِهِمْ وَ يَجِي‏ءُ الْآخَرُونَ فَيَقُومُونَ خَلْفَ الْإِمَامِ فَيُصَلِّي بِهِمُ الرَّكْعَةَ الثَّانِيَةَ ثُمَّ يَجْلِسُ الْإِمَامُ فَيَقُومُونَ هُمْ فَيُصَلُّونَ رَكْعَةً أُخْرَى ثُمَّ يُسَلِّمُ عَلَيْهِمْ فَيَنْصَرِفُونَ بِتَسْلِيمِهِ ", "قَالَ وَ فِي الْمَغْرِبِ مِثْلُ ذَلِكَ يَقُومُ الْإِمَامُ وَ تَجِي‏ءُ طَائِفَةٌ فَيَقُومُونَ خَلْفَهُ ثُمَّ يُصَلِّي بِهِمْ رَكْعَةً ثُمَّ يَقُومُ وَ يَقُومُونَ فَيَمْثُلُ الْإِمَامُ قَائِماً وَ يُصَلُّونَ الرَّكْعَتَيْنِ فَيَتَشَهَّدُونَ وَ يُسَلِّمُ بَعْضُهُمْ عَلَى بَعْضٍ ", "ثُمَّ يَنْصَرِفُونَ فَيَقُومُونَ فِي مَوْقِفِ أَصْحَابِهِمْ وَ يَجِي‏ءُ الْآخَرُونَ وَ يَقُومُونَ خَلْفَ الْإِمَامِ فَيُصَلِّي بِهِمْ رَكْعَةً يَقْرَأُ فِيهَا ثُمَّ يَجْلِسُ فَيَتَشَهَّدُ ثُمَّ يَقُومُ وَ يَقُومُونَ مَعَهُ وَ يُصَلِّي بِهِمْ رَكْعَةً أُخْرَى ثُمَّ يَجْلِسُ وَ يَقُومُونَ هُمْ فَيُتِمُّونَ رَكْعَةً أُخْرَى ثُمَّ يُسَلِّمُ عَلَيْهِمْ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al-Halby who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about the <span class=\"iTxt\">Salāt</span> during the fear. He<sup>asws</sup> said: ‘The prayer leader would be standing, and a group of his companions would come and be standing behind him, and a group would be facing the enemy, So the prayer leader would pray <span class=\"iTxt\">Salāt</span> with them (leading them), for one <span class=\"iTxt\">Rak’at</span>. Then he would be standing and they would be standing along with him. So he would represent them standing, and they would be in the second <span class=\"iTxt\">Rak’at</span>. Then they would be greeting each other (<span class=\"iTxt\">Salaam</span>), then they would be dispersing. ", "So they would be going to stand in the place of their companions, and the other ones would be coming and standing behind the prayer leader. So he would pray the second Rak’at with them. Then the prayer leader would be seated, and they would be standing, praying another <span class=\"iTxt\">Rak’at</span> of <span class=\"iTxt\">Salāt</span>. The he would greet upon them (<span class=\"iTxt\">Salaam</span>), and they would be dispersing by his greeting (<span class=\"iTxt\">Salaam</span>)’.", "He<sup>asws</sup> said: ‘And during <span class=\"iTxt\">Al-Maghrib </span>(Salāt), it is similar to that. The prayer leader would be standing and a group would come, so they would be standing behind him. Then he would pray <span class=\"iTxt\">Salāt</span> with them (leading them) for one <span class=\"iTxt\">Rak’at</span>, and they would be standing. So the prayer leader would represent them standing, and they would be praying the two <span class=\"iTxt\">Rak’at</span>. So they would be performing the <span class=\"iTxt\">Tashahhud</span>, and some of the would say <span class=\"iTxt\">Salām</span> upon the other. ", "Then they would dispersing, and be standing in the place of their companions, and the others would come and they would be standing behind the prayer leader. So he would pray <span class=\"iTxt\">Salāt</span> with them (leading them), reciting therein, then be seated. So he would perform <span class=\"iTxt\">Tashahhud</span>, then he would be standing and they would be standing along with him, and he would pray another <span class=\"iTxt\">Rak’at</span> with them. Then he would be seated, and they would be standing, so they would be completing one more <span class=\"iTxt\">Rak’at</span>. Then he would say <span class=\"iTxt\">Salām</span> upon them’."]}}, {"index": 5577, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:4:86:2", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ صَلَّى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِأَصْحَابِهِ فِي غَزْوَةِ ذَاتِ الرِّقَاعِ صَلَاةَ الْخَوْفِ فَفَرَّقَ أَصْحَابَهُ فِرْقَتَيْنِ أَقَامَ فِرْقَةً بِإِزَاءِ الْعَدُوِّ وَ فِرْقَةً خَلْفَهُ فَكَبَّرَ وَ كَبَّرُوا فَقَرَأَ وَ أَنْصَتُوا وَ رَكَعَ فَرَكَعُوا وَ سَجَدَ فَسَجَدُوا ", "ثُمَّ اسْتَتَمَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَائِماً وَ صَلَّوْا لِأَنْفُسِهِمْ رَكْعَةً ثُمَّ سَلَّمَ بَعْضُهُمْ عَلَى بَعْضٍ ثُمَّ خَرَجُوا إِلَى أَصْحَابِهِمْ فَقَامُوا بِإِزَاءِ الْعَدُوِّ وَ جَاءَ أَصْحَابُهُمْ فَقَامُوا خَلْفَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَصَلَّى بِهِمْ رَكْعَةً ثُمَّ تَشَهَّدَ وَ سَلَّمَ عَلَيْهِمْ فَقَامُوا فَصَلَّوْا لِأَنْفُسِهِمْ رَكْعَةً ثُمَّ سَلَّمَ بَعْضُهُمْ عَلَى بَعْضٍ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Abdullah Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from Aban, from Abdul Rahman Bin Abu Abdullah, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> prayed <span class=\"iTxt\">Salāt</span> with his<sup>saww</sup> companions during a military expedition of Zaat Al-Riqa’a, the <span class=\"iTxt\">Salāt</span> during the fear. So his<sup>saww</sup> companions separated into to groups. One group stood facing the enemy, and one group was behind him<sup>saww</sup>. So he<sup>saww</sup> exclaimed a <span class=\"iTxt\">Takbīr</span>, and they exclaimed <span class=\"iTxt\">Takbīr</span>. So he<sup>saww</sup> recited, and they listened silently, and he<sup>saww</sup> went into <span class=\"iTxt\">Rukū</span>, so they went into <span class=\"iTxt\">Rukū</span>, and he<sup>saww</sup> went into <span class=\"iTxt\">Sajdah</span>, so they went into <span class=\"iTxt\">Sajdah</span>. ", "Then Rasool-Allah<sup>saww</sup> completed (the <span class=\"iTxt\">Salāt</span>) standing, and they prayed one <span class=\"iTxt\">Rak’at</span> by themselves. Then they performed <span class=\"iTxt\">Salām</span> upon each other (<span class=\"iTxt\">Salām</span>), then they went out to their companions. So they stood facing the enemy, and their companions came over, so they were standing behind Rasool-Allah<sup>saww</sup>. So he<sup>saww</sup> prayed one <span class=\"iTxt\">Rak’at</span> with them (leading them). Then he<sup>saww</sup> performed <span class=\"iTxt\">Tashahhud</span> and offered <span class=\"iTxt\">Salām</span> upon them. So they stood and prayed one <span class=\"iTxt\">Rak’at</span> by themselves, then offered <span class=\"iTxt\">Salām</span> upon each other’."]}}, {"index": 5578, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:4:86:3", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنْ كُنْتَ فِي أَرْضِ مَخَافَةٍ فَخَشِيتَ لِصّاً أَوْ سَبُعاً فَصَلِّ عَلَى دَابَّتِكَ ."], "translations": {"en.hubeali": ["Al-Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al-Hassan Bin Ali Al-Washa, from Hammad Bin Usman, from Abu Baseer who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘If you were in a dangerous land, and you fear a thief, or predatory wild animal, so pray <span class=\"iTxt\">Salāt</span> upon your animal’."]}}, {"index": 5579, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:3:4:86:4", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ زُرْعَةَ عَنْ سَمَاعَةَ قَالَ سَأَلْتُهُ عَنِ الْأَسِيرِ يَأْسِرُهُ الْمُشْرِكُونَ فَتَحْضُرُهُ الصَّلَاةُ فَيَمْنَعُهُ الَّذِي أَسَرَهُ مِنْهَا قَالَ يُومِئُ إِيمَاءً ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Zur’at who said, ", "‘I asked him<sup>asws</sup> about the captive imprisoned by the Polytheists. So the <span class=\"iTxt\">Salāt</span> (time) presents itself, but the one who imprisoned him prevents him from it. He<sup>asws</sup> said: ‘He would indicate by gestures’."]}}, {"index": 5580, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:3:4:86:5", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ قَالَ سَأَلْتُهُ قُلْتُ أَكُونُ فِي طَرِيقِ مَكَّةَ فَنَنْزِلُ لِلصَّلَاةِ فِي مَوَاضِعَ فِيهَا الْأَعْرَابُ أَ نُصَلِّي الْمَكْتُوبَةَ عَلَى الْأَرْضِ فَنَقْرَأُ أُمَّ الْكِتَابِ وَحْدَهَا أَمْ نُصَلِّي عَلَى الرَّاحِلَةِ فَنَقْرَأُ فَاتِحَةَ الْكِتَابِ وَ السُّورَةَ فَقَالَ إِذَا خِفْتَ فَصَلِّ عَلَى الرَّاحِلَةِ الْمَكْتُوبَةَ وَ غَيْرَهَا وَ إِذَا قَرَأْتَ الْحَمْدَ وَ سُورَةً أَحَبُّ إِلَيَّ وَ لَا أَرَى بِالَّذِي فَعَلْتَ بَأْساً ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail who said, ", "‘I asked him<sup>asws</sup> saying, ‘I happen to be in a road of Makkah, so we descend for the <span class=\"iTxt\">Salāt</span> in a place wherein are Bedouins. Can we pray the Obligatory <span class=\"iTxt\">Salāt</span> upon the ground, reciting the Mother of the Book (Chapter 1) alone, or should we pray <span class=\"iTxt\">Salāt</span> upon the ride, and we recite the Opening of the Book (Chapter 1) and the (another) Chapter?’ So he<sup>asws</sup> said: ‘When you fear, so pray <span class=\"iTxt\">Salāt</span> upon the ride, the Prescribed ones and others; and when you recite Al-Hamd (Chapter 1) and a Chapter, it would be more beloved to me, and I<sup>asws</sup> do not see a problem with that which you do’."]}}, {"index": 5581, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:3:4:86:6", "text": ["أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَإِنْ خِفْتُمْ فَرِجالًا أَوْ رُكْباناً كَيْفَ يُصَلِّي وَ مَا يَقُولُ إِذَا خَافَ مِنْ سَبُعٍ أَوْ لِصٍّ كَيْفَ يُصَلِّي قَالَ يُكَبِّرُ وَ يُومِئُ إِيمَاءً بِرَأْسِهِ ."], "translations": {"en.hubeali": ["Ahmad Bin Muhammad, from Ali Bin Al-Hakam, from Aban, from Abdul Rahman Bin Abu Abdullah who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> MIghhty and Majestic <span class=\"ibTxt\">[2:239] But if you are in danger, then (perform your Salat) on foot or on horseback</span>, ‘How should be pray <span class=\"iTxt\">Salāt</span>, and what are you<sup>asws</sup> saying where there is fear from predatory wild animals, or thieves, how should we be praying <span class=\"iTxt\">Salāt</span>?’ He<sup>asws</sup> said: ‘He should exclaim a <span class=\"iTxt\">Takbīr</span> and indicate gesturing with his head’."]}}]}, "index": "al-kafi:3:4:86", "kind": "verse_list"}