{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 88"
        },
        "path": "/books/al-kafi:3:4:88",
        "titles": {
          "ar": "باب صَلَاةِ الْعِيدَيْنِ وَ الْخُطْبَةِ فِيهِمَا",
          "en": "Chapter 88 – Salāt of the two Eids and the sermon in these two"
        }
      }
    ],
    "index": 755,
    "local_index": 88,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 89"
        },
        "path": "/books/al-kafi:3:4:89",
        "titles": {
          "ar": "باب صَلَاةِ الِاسْتِسْقَاءِ",
          "en": "Chapter 89 – Salāt for the rain"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 87"
        },
        "path": "/books/al-kafi:3:4:87",
        "titles": {
          "ar": "باب صَلَاةِ الْمُطَارَدَةِ وَ الْمُوَاقَفَةِ وَ الْمُسَايَفَةِ",
          "en": "Chapter 87 – The Salāt of the pursuit, and the cover, and the combat"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:4:88",
    "titles": {
      "ar": "باب صَلَاةِ الْعِيدَيْنِ وَ الْخُطْبَةِ فِيهِمَا",
      "en": "Chapter 88 – Salāt of the two Eids and the sermon in these two"
    },
    "verse_count": 11,
    "verse_start_index": 5588,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/430)"
        ],
        "index": 5589,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:88:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ زُرَارَةَ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) لَيْسَ فِي يَوْمِ الْفِطْرِ وَ الْأَضْحَى أَذَانٌ وَ لَا إِقَامَةٌ أَذَانُهُمَا طُلُوعُ الشَّمْسِ إِذَا طَلَعَتْ خَرَجُوا وَ لَيْسَ قَبْلَهُمَا وَ لَا بَعْدَهُمَا صَلَاةٌ وَ مَنْ لَمْ يُصَلِّ مَعَ إِمَامٍ فِي جَمَاعَةٍ فَلَا صَلَاةَ لَهُ وَ لَا قَضَاءَ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Bin Abu Umeyr, from Umar Bin Azina, from Zurara who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘In a day of (Eid) Al-Fitr and (Eid) Al-Azha, there is neither an <span class=\"iTxt\">Azan</span> nor an <span class=\"iTxt\">Iqamah</span>. An <span class=\"iTxt\">Azaan</span> of these two is the emergence of the sun. When it emerges, they should be going out, and there is neither a <span class=\"iTxt\">Salāt</span> before these two or after them; and the one who does not pray <span class=\"iTxt\">Salāt</span> with a prayer leader in a <span class=\"iTxt\">Jam’at</span>, so there is no <span class=\"iTxt\">Salāt</span> for him, nor is there a fulfilment (of an outsanding one) upon him’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ’Udhaynah from Zurarah who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘There Adhan or ‘Iqamah is not for the day of al-Fitr and al- Adha’. Adhan for it is sunrise. When it is sunrise, they go out. There is not any Salah (prayer) before or after it. If one does not perform Salah (prayer) with an Imam in congregation, there is not any Salah (prayer) for him and performing Qada’ (compensatory prayer) also is not necessary for him.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/431)"
        ],
        "index": 5590,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:88:2",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ مَعْمَرِ بْنِ يَحْيَى عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَا صَلَاةَ يَوْمَ الْفِطْرِ وَ الْأَضْحَى إِلَّا مَعَ إِمَامٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al-Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al-Washa, from Hammad Bin Usman, from Ma’mar Bin Yahya, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘There is no <span class=\"iTxt\">Salāt</span> on the day of (Eid) Al-Fitr and (Eid) Al-Az’ha, except with a prayer leader’."
          ],
          "en.sarwar": [
            "2. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ ibn Muhammad from al-Washsha’ from Hammad ibn ‘Uthaman from Ma‘mar ibn Yahya who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘There is not any Salah (prayer) on the day of al-Fitr or al- Adha’ except with Imam.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح على الظاهر    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/432)"
        ],
        "index": 5591,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:88:3",
        "refs": {
          "Quran": [
            "/books/quran:91:1",
            "/books/quran:88:1"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ مُعَاوِيَةَ قَالَ سَأَلْتُهُ عَنْ صَلَاةِ الْعِيدَيْنِ فَقَالَ رَكْعَتَانِ لَيْسَ قَبْلَهُمَا وَ لَا بَعْدَهُمَا شَيْ‏ءٌ وَ لَيْسَ فِيهِمَا أَذَانٌ وَ لَا إِقَامَةٌ يُكَبِّرُ فِيهِمَا اثْنَتَيْ عَشَرَ تَكْبِيرَةً يَبْدَأُ فَيُكَبِّرُ وَ يَفْتَتِحُ الصَّلَاةَ ",
          "ثُمَّ يَقْرَأُ فَاتِحَةَ الْكِتَابِ ثُمَّ يَقْرَأُ وَ الشَّمْسِ وَ ضُحَيهَا ثُمَّ يُكَبِّرُ خَمْسَ تَكْبِيرَاتٍ ثُمَّ يُكَبِّرُ وَ يَرْكَعُ فَيَكُونُ يَرْكَعُ بِالسَّابِعَةِ ثُمَّ يَسْجُدُ سَجْدَتَيْنِ ثُمَّ يَقُومُ فَيَقْرَأُ فَاتِحَةَ الْكِتَابِ وَ هَلْ أَتَيكَ حَدِيثُ الْغَاشِيَةِ ثُمَّ يُكَبِّرُ أَرْبَعَ تَكْبِيرَاتٍ وَ يَسْجُدُ سَجْدَتَيْنِ وَ يَتَشَهَّدُ وَ يُسَلِّمُ",
          "قَالَ وَ كَذَلِكَ صَنَعَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ الْخُطْبَةُ بَعْدَ الصَّلَاةِ إِنَّمَا أَحْدَثَ الْخُطْبَةَ قَبْلَ الصَّلَاةِ عُثْمَانُ وَ إِذَا خَطَبَ الْإِمَامُ فَلْيَقْعُدْ بَيْنَ الْخُطْبَتَيْنِ قَلِيلًا وَ يَنْبَغِي لِلْإِمَامِ أَنْ يَلْبَسَ يَوْمَ الْعِيدَيْنِ بُرْداً وَ يَعْتَمَّ شَاتِياً كَانَ أَوْ قَائِظاً وَ يَخْرُجُ إِلَى الْبَرِّ حَيْثُ يَنْظُرُ إِلَى آفَاقِ السَّمَاءِ وَ لَا يُصَلِّي عَلَى حَصِيرٍ وَ لَا يَسْجُدُ عَلَيْهِ وَ قَدْ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَخْرُجُ إِلَى الْبَقِيعِ فَيُصَلِّي بِالنَّاسِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Muhammad Bin Isa, from Yunus, from Muawiya who said, ",
            "‘I asked him<sup>asws</sup> about <span class=\"iTxt\">Salāt</span> of the two Eids, so he<sup>asws</sup> said: ‘Two <span class=\"iTxt\">Rak’at</span>. There is neither anything before these two nor after these two, and there is neither an <span class=\"iTxt\">Azan</span> in these two nor an <span class=\"iTxt\">Iqamah</span>. One should exclaim <span class=\"iTxt\">Takbīrs</span> in these with twelve <span class=\"iTxt\">Takbīrs</span> in the beginning. So he would exclaim <span class=\"iTxt\">Takbīr</span> and he would commence the <span class=\"iTxt\">Salāt</span>.",
            "Then he should recite the Opening of the Book (Chapter 1), then he should recite <span class=\"ibTxt\"><a href=\"/#/books/quran:91#h1\">[91:1]</a> I swear by the sun and its brilliance</span> (Chapter 91). Then he should exclaim five <span class=\"iTxt\">Takbīrs</span>, then one <span class=\"iTxt\">Takbīr</span> and <span class=\"iTxt\">Rukū</span>, so that his <span class=\"iTxt\">Rukū</span> would happen be with the seventh (<span class=\"iTxt\">Takbīr</span>). Then he should perform two Sajdahs. Then he should be standing so he would recite the Opening of the Book (Chapter 1), and <span class=\"ibTxt\"><a href=\"/#/books/quran:88#h1\">[88:1]</a> Has not there come to you the Hadeeth of the overwhelming?</span> (Chapter 88). Then he should exclaim four <span class=\"iTxt\">Takbīrs</span>, and perform two Sajdahs, and he should say <span class=\"iTxt\">Salām</span>’. ",
            "He<sup>asws</sup> said: ‘And Rasool-Allah<sup>saww</sup> did it like that. And the sermon is after the <span class=\"iTxt\">Salāt</span>. But rather, it was Usman who innovated it to be before the <span class=\"iTxt\">Salāt</span>. And when the prayer leader addresses, so let him be seated for a little while in between the two Sajdahs; and it is befitting for the prayer leader that he wears, on the day of the two Eids, a cloak, and a Shatiyya or a Qaizan turban, and he should go out to the open ground (outdoors) where he can look at the horizons of the sky, and he should neither pray <span class=\"iTxt\">Salāt</span> upon straw (harvested ground) nor perform <span class=\"iTxt\">Sajdah </span>upon it; and Rasool-Allah<sup>saww</sup> had gone out to Al-Baqi’e, so he prayed with the people (leading them)’."
          ],
          "en.sarwar": [
            "3. Ali ibn Muhammad has narrated from Muhammad ibn ‘Isa from Yunus from Mu‘awiyah who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about Salah (prayer) of both ‘Id. He (the Imam) said, ‘It is a two Rak‘at and there is not anything before or after them. Adhan or ‘Iqamah is not required. There are twelve Takbir (Allah is great beyond description). When Takbir is said and Salah (prayer) is commenced, he then recites al-Fatihah al-Kitab, then wa al-Shams and Duha’ha’ (Chapter 91), then says five Takbir. After saying Takbir (Allah is great beyond description) he performs Ruku‘ (bowing down on one’s knees), so he performs Ruku‘ after the seventh Takbir. He then performs two Sajdah (prostration), then stands up and recites al-Fatihah al-Kitab and Hal Ataka Hadith al-Ghashiyah (chapter 88), then says four Takbir, performs two Sajdah (prostration), says Tashahhud (testimonies of belief) and Salam (the phrase of offering greeting of peace). He (the Imam) said, ‘This is how the Messenger of Allah did. The sermon is after Salah (prayer). ‘Uthman was the one who initiated it before Salah (prayer). When the Imam delivers the sermon he sits down between the two sermons for a short time. It is proper for the Imam to wear burd (a certain kind of gown) on both ‘Id days and a shatiy turban or Qa’iz (certain kinds of fabrics). He goes out in the open so he can see the horizons of the sky. He does not perform Salah (prayer) on a mat or Sajdah (prostration) on it. The Messenger of Allah would go to al-Baqi‘ and perform Salah (prayer) with people.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/433)"
        ],
        "index": 5592,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:88:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ الْمُفَضَّلِ بْنِ صَالِحٍ عَنْ لَيْثٍ الْمُرَادِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قِيلَ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) يَوْمَ فِطْرٍ أَوْ يَوْمَ أَضْحًى لَوْ صَلَّيْتَ فِي مَسْجِدِكَ فَقَالَ إِنِّي لَأُحِبُّ أَنْ أَبْرُزَ إِلَى آفَاقِ السَّمَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Al-Mufazzal Bin Salih, from Lays Al-Murady, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said, ‘It was said to Rasool-Allah<sup>saww</sup> on the day of (Eid) Al-Fitr or (Eid) Al-Az’ha, ‘If only you<sup>saww</sup> would pray <span class=\"iTxt\">Salāt</span> in your<sup>saww</sup> Masjid?’ So he<sup>saww</sup> said: ‘I<sup>saww</sup> loved to come out to (look at) the horizons of the sky’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from al-Mufaddal ibn Salih from Layth al-Muradiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that once it was said to the Messenger of Allah, ‘Would that you perform Salah (prayer) on al-Fitr or al-Adha’ days in your Masjid!’ The Messenger of Allah said, ‘I love to come out for the horizons of the sky.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/433)"
        ],
        "index": 5593,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:88:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي صَلَاةِ الْعِيدَيْنِ قَالَ يُكَبِّرُ ثُمَّ يَقْرَأُ ثُمَّ يُكَبِّرُ خَمْساً وَ يَقْنُتُ بَيْنَ كُلِّ تَكْبِيرَتَيْنِ ثُمَّ يُكَبِّرُ السَّابِعَةَ وَ يَرْكَعُ بِهَا ثُمَّ يَسْجُدُ ثُمَّ يَقُومُ فِي الثَّانِيَةِ فَيَقْرَأُ ثُمَّ يُكَبِّرُ أَرْبَعاً فَيَقْنُتُ بَيْنَ كُلِّ تَكْبِيرَتَيْنِ ثُمَّ يُكَبِّرُ وَ يَرْكَعُ بِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Ali Bin Abu Hamza, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the <span class=\"iTxt\">Salāt</span> of the two Eids. He<sup>asws</sup> said: ‘He should exclaim <span class=\"iTxt\">Takbīr</span>, then recite, then exclaim five <span class=\"iTxt\">Takbīrs</span>, and he should perform <span class=\"iTxt\">Qunut</span> between every two <span class=\"iTxt\">Takbīrs</span>. Then he should exclaim the seventh <span class=\"iTxt\">Takbīr</span> and <span class=\"iTxt\">Rukū</span> with it. Then he should perform <span class=\"iTxt\">Sajdah</span>, then be standing regarding the second (<span class=\"iTxt\">Rak’at</span>). So he should recite, then exclaim four <span class=\"iTxt\">Takbīrs</span>, and perform <span class=\"iTxt\">Qunut</span> in between every two <span class=\"iTxt\">Takbīrs</span>. Then he should exclaim <span class=\"iTxt\">Takbīr</span> and <span class=\"iTxt\">Rukū</span> with it’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from Ali ibn abu Hamzah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Salah (prayer) of both ‘Id commences with Takbir (Allah is great beyond description). There is then the recitation, then five Takbir, and there is Qunut (supplication) between each two Takbir. Then is the seventh Takbir, then Ruku‘ (bowing down on one’s knees), then Sajdah (prostration), then he (the Imam) stands up for the second Rak‘at. He recites, then says four Takbir with Qunut (supplication) between every two Takbir, then says Takbir and performs Ruku‘ (bowing down on one’s knees).”’ "
          ]
        }
      },
      {
        "index": 5594,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:88:6",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ جَعْفَرٍ عَنْ أَبِيهِ ( عليه السلام ) قَالَ نَهَى رَسُولُ اللَّهِ ( عليه السلام ) أَنْ يُخْرَجَ السِّلَاحُ فِي الْعِيدَيْنِ إِلَّا أَنْ يَكُونَ عَدُوٌّ حَاضِرٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Al-Nowfaly, from Al-Sakuny, ",
            "(It has been narrated) from Ja’far<sup>asws</sup>, from his<sup>asws</sup> father<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> forbade from taking out the weapon during the two Eids, except if there happens to be an enemy present’."
          ],
          "en.sarwar": [
            "6. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from al-Nawfaliy from al-Sakuniy who has said the following: “Ja‘far has narrated from his father, ‘Alayhi al-Salam, who has said that the Messenger of Allah prohibited taking out arms on both days of ‘Id unless enemy was present.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/434)"
        ],
        "index": 5595,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:88:7",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيِّ بْنِ عَبْدِ اللَّهِ عَنِ الْفَضْلِ بْنِ يَسَارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أُتِيَ أَبِي بِالْخُمْرَةِ يَوْمَ الْفِطْرِ فَأَمَرَ بِرَدِّهَا ثُمَّ قَالَ هَذَا يَوْمٌ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يُحِبُّ أَنْ يَنْظُرَ إِلَى آفَاقِ السَّمَاءِ وَ يَضَعَ وَجْهَهُ عَلَى الْأَرْضِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al-Fazl Bin Sh<span class=\"iTxt\">Azaan</span>, from Hammad Bin Isa, from Rabi’e Bin Abdullah, form Al-Fazl Bin Yasaar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘I<sup>asws</sup> came over to my<sup>asws</sup> father with the ‘<span class=\"iTxt\">Khumra</span>’ on the day of (Eid) Al-Fitr, but he<sup>asws</sup> instructed with returning it, then said: ‘This is a day which Rasool-Allah<sup>saww</sup> used to love that he<sup>saww</sup> looks at the horizons of the sky, and he<sup>saww</sup> placed his<sup>saww</sup> face upon the ground’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from Hammad ibn ‘Isa from Rib‘i ibn ‘Abd Allah from al-Fadl ibn Yasar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘On the day of al-Fitr al-Khumrah (mat) was brought for my father but he commanded to return it and then said, “This is a day on which the Messenger of Allah loved to look at the horizons of the sky and place his face on earth.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/434)"
        ],
        "index": 5596,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:88:8",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ سَلَمَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ اجْتَمَعَ عِيدَانِ عَلَى عَهْدِ أَمِيرِ الْمُؤْمِنِينَ ( صلوات الله عليه ) فَخَطَبَ النَّاسَ ثُمَّ قَالَ هَذَا يَوْمٌ اجْتَمَعَ فِيهِ عِيدَانِ فَمَنْ أَحَبَّ أَنْ يَجْمَعَ مَعَنَا فَلْيَفْعَلْ وَ مَنْ لَمْ يَفْعَلْ فَإِنَّ لَهُ رُخْصَةً يَعْنِي مَنْ كَانَ مُتَنَحِّياً ."
        ],
        "translations": {
          "en.hubeali": [
            "Al-Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al-Washa, from Aban Bin Usman, from Salma, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said, ‘Two Eids were gathered upon the era of Amir Al-Momineen<sup>asws</sup>. So he<sup>asws</sup> addressed the people, then said: ‘This is a day in which two Eids are gathered. So the one who loves that he should gather along with us, so let him do so, and the one who does not do so, so there is an allowance for him, meaning the one who was laid back’."
          ],
          "en.sarwar": [
            "8. Al-Flusayn ibn Muhammad has narrated from Mu‘alla’ ibn Muhammad from al-Washsha’ from Aban ibn ‘Uthman from Salamah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘During the time of ’Amir al-Mu’minin two ‘Id happened on one day. ’Amir al-Mu’minin, ‘Alayhi al-Salam, delivered a sermon and said, “This is a day in which two ‘Id have taken place. Those who love can join us and those who do not want to join us, they have permission to do so”, meaning those who keep aside.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/435)"
        ],
        "index": 5597,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:88:9",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُهُ عَنْ رَجُلٍ فَاتَتْهُ رَكْعَةٌ مَعَ الْإِمَامِ مِنَ الصَّلَاةِ أَيَّامَ التَّشْرِيقِ قَالَ يُتِمُّ الصَّلَاةَ وَ يُكَبِّرُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Al-A’ala Bin Razeyn, from Muhammad Bin Muslim who said, ",
            "‘I asked him<sup>asws</sup> about a man who missed out on one <span class=\"iTxt\">Rak’at</span> of a <span class=\"iTxt\">Salāt</span> with the prayer leader on the days of Al-Tashreek (11<sup>th</sup>, 12<sup>th</sup> & 13<sup>th</sup> Zil Hijja). He<sup>asws</sup> said: ‘He should complete the <span class=\"iTxt\">Salāt</span>, and he should exclaim a <span class=\"iTxt\">Takbīr</span>’."
          ],
          "en.sarwar": [
            "9. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from al-‘Ala’ ibn Razin from Muhammad ibn Muslim who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about a man who has missed one Rak‘at of Salah (prayer) with Imam on the days of al-Tashriq (11,12 and 13 of Dhul Hajj). He (the Imam) said, ‘He must complete Salah (prayer) and say Takbir (Allah is great beyond description).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/436)"
        ],
        "index": 5598,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:88:10",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ السُّنَّةُ عَلَى أَهْلِ الْأَمْصَارِ أَنْ يَبْرُزُوا مِنْ أَمْصَارِهِمْ فِي الْعِيدَيْنِ إِلَّا أَهْلَ مَكَّةَ فَإِنَّهُمْ يُصَلُّونَ فِي الْمَسْجِدِ الْحَرَامِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, raising it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Sunnah upon the people of the city is that they should be going out from their cities during the two Eids, except for the people of Makkah, for they would be praying <span class=\"iTxt\">Salāt</span> in the Sacred Masjid’."
          ],
          "en.sarwar": [
            "10. Muhammad ibn Yahya in a marfu‘ manner has narrated from the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘It is of Sunnah for the people of the cities to go out in the open on both ‘Id days except people of Makkah; they perform Salah (prayer) in Masjid al-Haram.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/436)"
        ],
        "index": 5599,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:88:11",
        "text": [
          "مُحَمَّدٌ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ عَنِ الْعَبَّاسِ بْنِ عَامِرٍ عَنْ أَبَانٍ عَنْ مُحَمَّدِ بْنِ الْفَضْلِ الْهَاشِمِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ رَكْعَتَانِ مِنَ السُّنَّةِ لَيْسَ تُصَلَّيَانِ فِي مَوْضِعٍ إِلَّا بِالْمَدِينَةِ قَالَ يُصَلِّي فِي مَسْجِدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فِي الْعِيدِ قَبْلَ أَنْ يَخْرُجَ إِلَى الْمُصَلَّى لَيْسَ ذَلِكَ إِلَّا بِالْمَدِينَةِ لِأَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَعَلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad, from Al-Hassan Bin Ali Bin Abdullah, from Al-Abbas Bin Aamir, from Aban, from Muhammad Bin Al-Fazl Al-Hashimy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Two <span class=\"iTxt\">Rak’at</span> (of the <span class=\"iTxt\">Salāt</span>) are from the Sunnah. These two are not prayed in any place except in Al-Medina. He would pray <span class=\"iTxt\">Salāt</span> in the Masjid of Rasool-Allah<sup>saww</sup> during the Eid, before he goes out to the praying place. That is nowhere except in Al-Medinca, because Rasool-Allah<sup>saww</sup> did so’."
          ],
          "en.sarwar": [
            "11. Muhammad ibn al-Flassan ibn Ali ibn ‘Abd Allah has narrated from al-‘Abbas ibn ‘Amir from Aban from Muhammad ibn al-Fadl al- Flashimiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘There are two Rak‘at Salah (prayer) which are of Sunnah but they are not performed anywhere else except in a certain place of al-Madinah.’ He (the Imam) said, ‘It is performed in Masjid of the Messenger of Allah on ‘Id before going out to the place for Salah (prayer). It is not done anywhere else except al-Madinah; the Messenger of Allah did so.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:4:88",
  "kind": "verse_list"
}