{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:3:4", "titles": {"ar": "كِتَابُ الصَّلَاةِ", "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "}}, {"indexed_titles": {"en": "Chapter 89"}, "path": "/books/al-kafi:3:4:89", "titles": {"ar": "باب صَلَاةِ الِاسْتِسْقَاءِ", "en": "Chapter 89 – Salāt for the rain"}}], "index": 756, "local_index": 89, "part_type": "Chapter", "path": "/books/al-kafi:3:4:89", "titles": {"ar": "باب صَلَاةِ الِاسْتِسْقَاءِ", "en": "Chapter 89 – Salāt for the rain"}, "verse_count": 4, "verse_start_index": 5599, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 5600, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:4:89:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ وَ الْحُسَيْنِ بْنِ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ أَحْمَدَ بْنِ سُلَيْمَانَ جَمِيعاً عَنْ مُرَّةَ مَوْلَى مُحَمَّدِ بْنِ خَالِدٍ قَالَ صَاحَ أَهْلُ الْمَدِينَةِ إِلَى مُحَمَّدِ بْنِ خَالِدٍ فِي الِاسْتِسْقَاءِ فَقَالَ لِيَ انْطَلِقْ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَسَلْهُ مَا رَأْيُكَ فَإِنَّ هَؤُلَاءِ قَدْ صَاحُوا إِلَيَّ فَأَتَيْتُهُ فَقُلْتُ لَهُ فَقَالَ لِي قُلْ لَهُ فَلْيَخْرُجْ قُلْتُ لَهُ مَتَى يَخْرُجُ جُعِلْتُ فِدَاكَ قَالَ يَوْمَ الِاثْنَيْنِ قُلْتُ كَيْفَ يَصْنَعُ ", "قَالَ يُخْرِجُ الْمِنْبَرَ ثُمَّ يَخْرُجُ يَمْشِي كَمَا يَمْشِي يَوْمَ الْعِيدَيْنِ وَ بَيْنَ يَدَيْهِ الْمُؤَذِّنُونَ فِي أَيْدِيهِمْ عَنَزُهُمْ حَتَّى إِذَا انْتَهَى إِلَى الْمُصَلَّى يُصَلِّي بِالنَّاسِ رَكْعَتَيْنِ بِغَيْرِ أَذَانٍ وَ لَا إِقَامَةٍ ثُمَّ يَصْعَدُ الْمِنْبَرَ فَيَقْلِبُ رِدَاءَهُ فَيَجْعَلُ الَّذِي عَلَى يَمِينِهِ عَلَى يَسَارِهِ وَ الَّذِي عَلَى يَسَارِهِ عَلَى يَمِينِهِ ", "ثُمَّ يَسْتَقْبِلُ الْقِبْلَةَ فَيُكَبِّرُ اللَّهَ مِائَةَ تَكْبِيرَةٍ رَافِعاً بِهَا صَوْتَهُ ثُمَّ يَلْتَفِتُ إِلَى النَّاسِ عَنْ يَمِينِهِ فَيُسَبِّحُ اللَّهَ مِائَةَ تَسْبِيحَةٍ رَافِعاً بِهَا صَوْتَهُ ثُمَّ يَلْتَفِتُ إِلَى النَّاسِ عَنْ يَسَارِهِ فَيُهَلِّلُ اللَّهَ مِائَةَ تَهْلِيلَةٍ رَافِعاً بِهَا صَوْتَهُ ثُمَّ يَسْتَقْبِلُ النَّاسَ فَيَحْمَدُ اللَّهَ مِائَةَ تَحْمِيدَةٍ ثُمَّ يَرْفَعُ يَدَيْهِ فَيَدْعُو ثُمَّ يَدْعُونَ فَإِنِّي لَأَرْجُو أَنْ لَا يَخِيبُوا ", "قَالَ فَفَعَلَ فَلَمَّا رَجَعْنَا جَاءَ الْمَطَرُ قَالُوا هَذَا مِنْ تَعْلِيمِ جَعْفَرٍ .", "وَ فِي رِوَايَةِ يُونُسَ فَمَا رَجَعْنَا حَتَّى أَهَمَّتْنَا أَنْفُسُنَا ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Muhammad Bin Muslim and Al-Husayn Bin Muhammad, from Abdullah Bin Aamir, from Ali Bin Mahziyar, from Fazalat Bin Ayoub, from Ahmad Bin Suleyman, altogether from Murra, a slave of Muhammad Bin Khalid who said, ", "‘The people of Al-Medina cried before Muhammad Binn Khalid regarding the (lack of) rain. So he said to me, ‘Go to Abu Abdullah<sup>asws</sup> and ask him<sup>asws</sup>, ‘What is your<sup>asws</sup> view, for they have cried before me, so I came to you’. So I said it to him<sup>asws</sup>, and he<sup>asws</sup> said to me: ‘Tell him, so let him come out’. I said to him<sup>asws</sup>, ‘When should he go out, may I be sacrificed for you<sup>asws</sup>?’ He<sup>asws</sup> said: ‘On the day of Monday’. I said, ‘How should he deal with it?’ ", "He<sup>asws</sup> said: ‘He should take out the pulpit, then go out walking just as he would walk on the day of the two Eids, and in front of him would be the <span class=\"iTxt\">Muezzins</span>, in their hands being their walking sticks, until when he ends up to the praying place, where he would pray two Rak’at of <span class=\"iTxt\">Salāt</span> with the people, without an <span class=\"iTxt\">Azan</span> or an <span class=\"iTxt\">Iqamah</span>. Then he would ascend the pulpit, and overturn his cloak, so that he would make that which is upon his right to be upon his left, and that which is upon his left to be upon his right. ", "Then he should face the Qiblah, and he would exclaim one hundred <span class=\"iTxt\">Takbīr’</span>s, raising his voice with it. The he would turn towards the people on his right, so he would Glorify Allah<sup>azwj</sup> with one hundred Glorifications raising his voice with it. Then he would turn towards the people on his left, so he would extoll the Oneness of Allah<sup>azwj</sup> raising his voice with it. Then he would face the people, so he would Praise Allah<sup>azwj</sup> with one hundred Praises. Then he would raise his hands, and he would supplicate. Then they would be supplicating, so I<sup>asws</sup> hope that they would not be unsuccessful’.", "He (the narrator) said, ‘He did so. So when we returned, the rain came, and they said, ‘This is from the teaching of Ja’far<sup>asws</sup>’. ", "And in a report of Yunus, ‘(He (the narrator) said): ‘So we had not returned until we were drenched’."]}}, {"index": 5601, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:4:89:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ صَلَاةِ الِاسْتِسْقَاءِ فَقَالَ مِثْلُ صَلَاةِ الْعِيدَيْنِ يَقْرَأُ فِيهَا وَ يُكَبِّرُ فِيهَا كَمَا يَقْرَأُ وَ يُكَبِّرُ فِيهَا يَخْرُجُ الْإِمَامُ وَ يَبْرُزُ إِلَى مَكَانٍ نَظِيفٍ فِي سَكِينَةٍ وَ وَقَارٍ وَ خُشُوعٍ وَ مَسْكَنَةٍ وَ يَبْرُزُ مَعَهُ النَّاسُ ", "فَيَحْمَدُ اللَّهَ وَ يُمَجِّدُهُ وَ يُثْنِي عَلَيْهِ وَ يَجْتَهِدُ فِي الدُّعَاءِ وَ يُكْثِرُ مِنَ التَّسْبِيحِ وَ التَّهْلِيلِ وَ التَّكْبِيرِ وَ يُصَلِّي مِثْلَ صَلَاةِ الْعِيدَيْنِ رَكْعَتَيْنِ فِي دُعَاءٍ وَ مَسْأَلَةٍ وَ اجْتِهَادٍ ", "فَإِذَا سَلَّمَ الْإِمَامُ قَلَبَ ثَوْبَهُ وَ جَعَلَ الْجَانِبَ الَّذِي عَلَى الْمَنْكِبِ الْأَيْمَنِ عَلَى الْأَيْسَرِ وَ الَّذِي عَلَى الْأَيْسَرِ عَلَى الْأَيْمَنِ فَإِنَّ النَّبِيَّ ( صلى الله عليه وآله ) كَذَلِكَ صَنَعَ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Al-Hakam, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the <span class=\"iTxt\">Salāt</span> for the rain, so he<sup>asws</sup> said: ‘Similar to the <span class=\"iTxt\">Salāt</span> of the two Eids. He would recite in it and exclaim <span class=\"iTxt\">Takbīr’</span> in it just as he would recite and exclaim <span class=\"iTxt\">Takbīr’</span> in those. The prayer leader would come out and go to a clean place in tranquillity, and dignity, and humbleness, and submissiveness, and the people would go out along with him. ", "So he would Prise Allah<sup>azwj</sup>, and Glorify Him<sup>azwj</sup>, and Laud upon Him<sup>azwj</sup>, and strive in the supplication, and frequent from the Glorifications and the Extollations of Oneness, and the exclamations of <span class=\"iTxt\">Takbīr’</span>, and he would pray a <span class=\"iTxt\">Salāt</span> similar to the <span class=\"iTxt\">Salāt</span> of the two Eids, being two Rak’at in a supplication and asking and striving.", "So when the prayer leader recites <span class=\"iTxt\">Salām</span> (at the end of <span class=\"iTxt\">Salāt</span>), he would overturn his cloth and make the side which is upon the right shoulder to be upon the left, and that which is upon the left to be upon the right, for the Prophet<sup>saww</sup> did it like that’."]}}, {"index": 5602, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:4:89:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ تَحْوِيلِ النَّبِيِّ ( صلى الله عليه وآله ) رِدَاءَهُ إِذَا اسْتَسْقَى فَقَالَ عَلَامَةٌ بَيْنَهُ وَ بَيْنَ أَصْحَابِهِ يُحَوَّلُ الْجَدْبُ خِصْباً ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, raising it, ", "(It has been narrated) Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the overturning by the Prophet<sup>saww</sup> of his<sup>saww</sup> cloak when he<sup>saww</sup> (prayed the <span class=\"iTxt\">Salāt</span> for the) rain. So he<sup>asws</sup> said: ‘A sign between him<sup>saww</sup> and his<sup>saww</sup> companions of the overturning of the aridity (dryness) into fertility’ (growth)."]}}, {"index": 5603, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:3:4:89:4", "text": ["وَ فِي رِوَايَةِ ابْنِ الْمُغِيرَةِ قَالَ يُكَبِّرُ فِي صَلَاةِ الِاسْتِسْقَاءِ كَمَا يُكَبِّرُ فِي الْعِيدَيْنِ فِي الْأُولَى سَبْعاً وَ فِي الثَّانِيَةِ خَمْساً وَ يُصَلِّي قَبْلَ الْخُطْبَةِ وَ يَجْهَرُ بِالْقِرَاءَةِ وَ يَسْتَسْقِي وَ هُوَ قَاعِدٌ ."], "translations": {"en.hubeali": ["And in a report of Ibn Al-Mugheira, ", "‘He<sup>asws</sup> said: ‘One would exclaim <span class=\"iTxt\">Takbīr’</span> in a <span class=\"iTxt\">Salāt</span> for the rain just as one would exclaim <span class=\"iTxt\">Takbīr’</span> in (the <span class=\"iTxt\">Salāt</span> of the) two Eids – seven in the first (Rak’at), and five in the second (Rak’at), and he would pray <span class=\"iTxt\">Salāt</span> before the sermon, and be loud with the recitation, and he would supplicate for the rain while he is seated’."]}}]}, "index": "al-kafi:3:4:89", "kind": "verse_list"}