{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:3:4", "titles": {"ar": "كِتَابُ الصَّلَاةِ", "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "}}, {"indexed_titles": {"en": "Chapter 9"}, "path": "/books/al-kafi:3:4:9", "titles": {"ar": "باب الْجَمْعِ بَيْنَ الصَّلَاتَيْنِ", "en": "Chapter 9 – The gathering of the two Salāts"}}], "index": 676, "local_index": 9, "part_type": "Chapter", "path": "/books/al-kafi:3:4:9", "titles": {"ar": "باب الْجَمْعِ بَيْنَ الصَّلَاتَيْنِ", "en": "Chapter 9 – The gathering of the two Salāts"}, "verse_count": 6, "verse_start_index": 4854, "verses": [{"index": 4855, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:4:9:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ صَلَّى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِالنَّاسِ الظُّهْرَ وَ الْعَصْرَ حِينَ زَالَتِ الشَّمْسُ فِي جَمَاعَةٍ مِنْ غَيْرِ عِلَّةٍ وَ صَلَّى بِهِمُ الْمَغْرِبَ وَ الْعِشَاءَ الْآخِرَةَ قَبْلَ سُقُوطِ الشَّفَقِ مِنْ غَيْرِ عِلَّةٍ فِي جَمَاعَةٍ وَ إِنَّمَا فَعَلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِيَتَّسِعَ الْوَقْتُ عَلَى أُمَّتِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Abdullah Bin Bukeyr, from Zurara, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> prayed <span class=\"iTxt\">Salāt</span> with the people, Al-Zohr and Al-Asr when the sun (started its) decline, in a <span class=\"iTxt\">Jam’at</span>, from without a reason; and he<sup>saww</sup> prayed with them Al-Maghrib and Al-Isha the last before the fall of the twilight, from without a reason, in a <span class=\"iTxt\">Jam’at</span>. And rather, Rasool-Allah<sup>saww</sup> did it in order to expand the timing upon his<sup>saww</sup> community’."}]}, {"index": 4856, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:4:9:2", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ شَهِدْتُ الْمَغْرِبَ لَيْلَةً مَطِيرَةً فِي مَسْجِدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَحِينَ كَانَ قَرِيباً مِنَ الشَّفَقِ نَادَوْا وَ أَقَامُوا الصَّلَاةَ فَصَلَّوُا الْمَغْرِبَ ثُمَّ أَمْهَلُوا بِالنَّاسِ حَتَّى صَلَّوْا رَكْعَتَيْنِ ثُمَّ قَامَ الْمُنَادِي فِي مَكَانِهِ فِي الْمَسْجِدِ فَأَقَامَ الصَّلَاةَ فَصَلَّوُا الْعِشَاءَ ثُمَّ انْصَرَفَ النَّاسُ إِلَى مَنَازِلِهِمْ \nفَسَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ ذَلِكَ فَقَالَ نَعَمْ قَدْ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَمِلَ بِهَذَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Abdullah Bin Sinan who said, \n‘I attended Al-Maghrib <span class=\"iTxt\">Salāt</span> on a rainy night in the Masjid of Rasool-Allah<sup>saww</sup>. So when it was near to the twilight, there was a call (Azan) and the <span class=\"iTxt\">Salāt</span> was established. So they prayed Al-Maghrib. Then the people were respited until they had prayed two <span class=\"iTxt\">Rak’at</span> of <span class=\"iTxt\">Salāt</span>. Then the caller stood up in his place in the Masjid, and established the <span class=\"iTxt\">Salāt</span>. So they prayed Al-Isha. Then the people dispersed to go to their houses. \nSo I asked Abu Abdullah<sup>asws</sup> about that. So he<sup>asws</sup> said: ‘Yes. Rasool-Allah<sup>saww</sup> had performed (like) this’."}]}, {"index": 4857, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:4:9:3", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنِ الْحُسَيْنِ بْنِ سَيْفٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ حَكِيمٍ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ إِذَا جَمَعْتَ بَيْنَ الصَّلَاتَيْنِ فَلَا تَطَوَّعْ بَيْنَهُمَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Salma Bin Al Khattab, from Al Husayn Bin Sayf, from Hammad Bin Usman, from Muhammad Bin Hakeym, \n(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘When you gather between the two <span class=\"iTxt\">Salāts</span>, so do not perform Optional <span class=\"iTxt\">Salāts</span> between the two’."}]}, {"index": 4858, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:3:4:9:4", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ مُوسَى عَنْ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ فَضَّالٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ حَكِيمٍ قَالَ سَمِعْتُ أَبَا الْحَسَنِ ( عليه السلام ) يَقُولُ الْجَمْعُ بَيْنَ الصَّلَاتَيْنِ إِذَا لَمْ يَكُنْ بَيْنَهُمَا تَطَوُّعٌ فَإِذَا كَانَ بَيْنَهُمَا تَطَوُّعٌ فَلَا جَمْعَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Muhammad Bin Musa, from Muhammad Bin Isa, from Ibn Fazzal, from Hammad Bin Usman who said, ‘Muhammad Bin Hakeym narrated to me saying, \n‘I heard Abu Al-Hassan<sup>asws</sup> saying: ‘The gathering between the two <span class=\"iTxt\">Salāt</span> is when there does not happen to be Optional <span class=\"iTxt\">Salāts</span> between the two. So when there were Optional <span class=\"iTxt\">Salāts</span> between the two, so do not gather’."}]}, {"index": 4859, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:3:4:9:5", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنِ الْفَضْلِ بْنِ مُحَمَّدٍ عَنْ يَحْيَى بْنِ أَبِي زَكَرِيَّا عَنْ أَبَانٍ عَنْ صَفْوَانَ الْجَمَّالِ قَالَ صَلَّى بِنَا أَبُو عَبْدِ اللَّهِ ( عليه السلام ) الظُّهْرَ وَ الْعَصْرَ عِنْدَ مَا زَالَتِ الشَّمْسُ بِأَذَانٍ وَ إِقَامَتَيْنِ وَ قَالَ إِنِّي عَلَى حَاجَةٍ فَتَنَفَّلُوا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Al Fazl Bin Muhammad, from Yahya Bin Abu Zakariyya, from Aban, from Safwan Al Jammal who said, \n‘Abu Abullah<sup>asws</sup> prayed with us Al-Zohr and Al-Asr <span class=\"iTxt\">Salāt</span> during the (start of the) decline of the sun, with one Azan and two Iqamas, and said: ‘I<sup>asws</sup> am upon a need, so pray Optional <span class=\"iTxt\">Salāts</span>’."}]}, {"index": 4860, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:3:4:9:6", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ عَبَّاسٍ النَّاقِدِ قَالَ تَفَرَّقَ مَا كَانَ فِي يَدِي وَ تَفَرَّقَ عَنِّي حُرَفَائِي فَشَكَوْتُ ذَلِكَ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) فَقَالَ لِي اجْمَعْ بَيْنَ الصَّلَاتَيْنِ الظُّهْرِ وَ الْعَصْرِ تَرَى مَا تُحِبُّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Abbas Al Naqid who said, \n‘There has separated from me what was in my hands (belongings) and there have separated my business associates from me. So I complained of that to Abu Muhammad<sup>asws</sup>, and he<sup>asws</sup> said to me: ‘Gather between the two <span class=\"iTxt\">Salāts</span>, Al-Zohr and Al-Asr. You shall see what you love’."}]}]}, "index": "al-kafi:3:4:9", "kind": "verse_list"}