{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 90"
        },
        "path": "/books/al-kafi:3:4:90",
        "titles": {
          "ar": "باب صَلَاةِ الْكُسُوفِ",
          "en": "Chapter 90 – Salāt of the eclipse"
        }
      }
    ],
    "index": 757,
    "local_index": 90,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 91"
        },
        "path": "/books/al-kafi:3:4:91",
        "titles": {
          "ar": "باب صَلَاةِ التَّسْبِيحِ",
          "en": "Chapter 91 – Salāt of the Glorification (Tasbeeh)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 89"
        },
        "path": "/books/al-kafi:3:4:89",
        "titles": {
          "ar": "باب صَلَاةِ الِاسْتِسْقَاءِ",
          "en": "Chapter 89 – Salāt for the rain"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:4:90",
    "titles": {
      "ar": "باب صَلَاةِ الْكُسُوفِ",
      "en": "Chapter 90 – Salāt of the eclipse"
    },
    "verse_count": 7,
    "verse_start_index": 5603,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/438)"
        ],
        "index": 5604,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:90:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ عَلِيِّ بْنِ عَبْدِ اللَّهِ قَالَ سَمِعْتُ أَبَا الْحَسَنِ مُوسَى ( عليه السلام ) يَقُولُ إِنَّهُ لَمَّا قُبِضَ إِبْرَاهِيمُ بْنُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) جَرَتْ فِيهِ ثَلَاثُ سُنَنٍ أَمَّا وَاحِدَةٌ فَإِنَّهُ لَمَّا مَاتَ انْكَسَفَتِ الشَّمْسُ فَقَالَ النَّاسُ انْكَسَفَتِ الشَّمْسُ لِفَقْدِ ابْنِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ",
          "فَصَعِدَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْمِنْبَرَ فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ ثُمَّ قَالَ يَا أَيُّهَا النَّاسُ إِنَّ الشَّمْسَ وَ الْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ تَجْرِيَانِ بِأَمْرِهِ مُطِيعَانِ لَهُ لَا تَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَ لَا لِحَيَاتِهِ فَإِذَا انْكَسَفَتَا أَوْ وَاحِدَةٌ مِنْهُمَا فَصَلُّوا ثُمَّ نَزَلَ فَصَلَّى بِالنَّاسِ صَلَاةَ الْكُسُوفِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Amro Bin Usman, from Ali Bin Abdullah who said, ",
            "‘I heard Abu Al-Hassan Musa<sup>asws</sup> saying: ‘When Ibrahim<sup>as</sup>, the son<sup>as</sup> of Rasool-Allah<sup>saww</sup> passed away, three Sunnahs flowed regarding it. As for one, so when he<sup>as</sup> passed away, the sun was eclipsed. So the people said, ‘The sun eclipsed due to the loss of the son<sup>as</sup> of Rasool-Allah<sup>saww</sup>’. ",
            "So Rasool-Allah<sup>saww</sup> ascended the Pulpit, and he<sup>saww</sup> Praised Allah<sup>azwj</sup> and Lauded upon Him<sup>azwj</sup>, then said: ‘O you people! The sun and the moon are two signs from the signs of Allah<sup>azwj</sup>, both flowing by His<sup>azwj</sup> Command, Obedient to Him<sup>azwj</sup>. They do not get eclipsed for the death of anyone, nor for his life. So whenever they both get eclipsed, or one of the two, so pray <span class=\"iTxt\">Salāt</span>’. Then he<sup>saww</sup> descended and prayed <span class=\"iTxt\">Salāt</span> with the people, a <span class=\"iTxt\">Salāt</span> of the eclipse’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ‘Amr ibn ‘Uthman from Afi ibn ’Abd Allah who has said the following: “I heard abu al-Hassan Musa, ‘Alayhi al-Salam, saying, ‘When Ibrahim son of the Messenger of Allah passed away three traditions were established. One tradition is that on that day a sun eclipse took place and people said that it is because of the death of the son of the Messenger of Allah. The Messenger of Allah went on the pulpit, praised Allah and glorified Him, then said, “O people, the sun and the moon are two signs of the signs of Allah which move because of His command and in obedience to Him. Their eclipse is not because of the death or life of anyone. If one or both of them eclipse perform Salah (prayer) for eclipse.” He climbed down the pulpit and performed Salah (prayer) because of eclipse with the people.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/439)"
        ],
        "index": 5605,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:90:2",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ وَ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَا سَأَلْنَا أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ صَلَاةِ الْكُسُوفِ كَمْ هِيَ رَكْعَةً وَ كَيْفَ نُصَلِّيهَا فَقَالَ عَشْرُ رَكَعَاتٍ وَ أَرْبَعُ سَجَدَاتٍ تَفْتَتِحُ الصَّلَاةَ بِتَكْبِيرَةٍ وَ تَرْكَعُ بِتَكْبِيرَةٍ وَ تَرْفَعُ رَأْسَكَ بِتَكْبِيرَةٍ إِلَّا فِي الْخَامِسَةِ الَّتِي تَسْجُدُ فِيهَا وَ تَقُولُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ وَ تَقْنُتُ فِي كُلِّ رَكْعَتَيْنِ قَبْلَ الرُّكُوعِ وَ تُطِيلُ الْقُنُوتَ وَ الرُّكُوعَ عَلَى قَدْرِ الْقِرَاءَةِ وَ الرُّكُوعِ وَ السُّجُودِ ",
          "فَإِنْ فَرَغْتَ قَبْلَ أَنْ يَنْجَلِيَ فَاقْعُدْ وَ ادْعُ اللَّهَ عَزَّ وَ جَلَّ حَتَّى يَنْجَلِيَ وَ إِنِ انْجَلَى قَبْلَ أَنْ تَفْرُغَ مِنْ صَلَاتِكَ فَأَتِمَّ مَا بَقِيَ وَ تَجْهَرُ بِالْقِرَاءَةِ ",
          "قَالَ قُلْتُ كَيْفَ الْقِرَاءَةُ فِيهَا فَقَالَ إِنْ قَرَأْتَ سُورَةً فِي كُلِّ رَكْعَةٍ فَاقْرَأْ فَاتِحَةَ الْكِتَابِ وَ إِنْ نَقَصْتَ مِنَ السُّورَةِ شَيْئاً فَاقْرَأْ مِنْ حَيْثُ نَقَصْتَ وَ لَا تَقْرَأْ فَاتِحَةَ الْكِتَابِ ",
          "قَالَ وَ كَانَ يَسْتَحِبُّ أَنْ يَقْرَأَ فِيهَا بِالْكَهْفِ وَ الْحِجْرِ إِلَّا أَنْ يَكُونَ إِمَاماً يَشُقُّ عَلَى مَنْ خَلْفَهُ وَ إِنِ اسْتَطَعْتَ أَنْ تَكُونَ صَلَاتُكَ بَارِزاً لَا يَجُنُّكَ بَيْتٌ فَافْعَلْ وَ صَلَاةُ كُسُوفِ الشَّمْسِ أَطْوَلُ مِنْ صَلَاةِ كُسُوفِ الْقَمَرِ وَ هُمَا سَوَاءٌ فِي الْقِرَاءَةِ وَ الرُّكُوعِ وَ السُّجُودِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father and Muhammad Bin Ismail, from Al-Fazl Bin Sh<span class=\"iTxt\">Azaan </span>, altogether from Hammad Bin Isa, from Hareyz, from Zurara and Muhammad Bin Muslim who both said, ",
            "‘We asked Abu Ja’far<sup>asws</sup> about the <span class=\"iTxt\">Salāt</span> of the eclipse, ‘How many Rak’at it is, and how is to be prayed’. Ten Rak’at and four <span class=\"iTxt\">Sajdah</span>s. You would commence the <span class=\"iTxt\">Salāt</span> with a <span class=\"iTxt\">Takbīr’</span> and you would perform <span class=\"iTxt\">Rukū</span> with a <span class=\"iTxt\">Takbīr’</span>, and raise your head with a <span class=\"iTxt\">Takbīr’</span> except in the fifth in which you would perform <span class=\"iTxt\">Sajdah</span> (prostrate) in, and you should be saying, ‘Allah<sup>azwj</sup> Hears the one who Praises Him<sup>azwj</sup>’, and you should perform <span class=\"iTxt\">Iqamah</span> in every two Rak’at before the <span class=\"iTxt\">Rukū</span>, and you should prolong the <span class=\"iTxt\">Iqamah</span> and the <span class=\"iTxt\">Rukū</span> upon a measurement of the recitation, and the <span class=\"iTxt\">Rukū</span> and the <span class=\"iTxt\">Sajdah</span>.",
            "So if you are free before it clears, be seated and supplicate to Allah<sup>azwj</sup> Mighty and Majestic until it does clear; and if it clears before you are free from your <span class=\"iTxt\">Salāt</span>, so complete whatever remains and be loud with the recitation’.",
            "He (the narrator) said, ‘I said, ‘How is the recitation in it?’ So he<sup>asws</sup> said: ‘If you were to recite a Chapter in every Rak’at, so recite the Opening of the Book (Chapter 1); and if you reduce anything from the Chapter, so recite from wherever you had reduced, and do not recite the Opening of the Book’. ",
            "He<sup>asws</sup> said: ‘And it was always a recommendation if one were to recite therein with (Surah) Al-Kahf, and (Surah) Al-Hijr, except if there happens to be a prayer leader, it being difficult upon the ones behind him; and if you have the capacity that your <span class=\"iTxt\">Salāt</span> be out in the open, a house not shielding you, then do so; and a <span class=\"iTxt\">Salāt</span> of an eclipse of the sun is longer than a <span class=\"iTxt\">Salāt</span> for an eclipse of the moon, and they are both the same in the recitation, and the <span class=\"iTxt\">Rukū</span>, and the <span class=\"iTxt\">Sajdah</span>’."
          ],
          "en.sarwar": [
            "2. Afi has narrated from his father and Muhammad ibn ’Isma‘il from al-Fadf ibn Shadhan all from Hammad ibn ‘Isa from Hariz from Zurarah from Muhammad ibn Muslim who has said the following: “We once asked abu Ja‘far, ‘Alayhi al-Salam, about Salah (prayer) because of eclipse. How many Rak‘at has it and how we perform it? He (the Imam) said, ‘It has ten Ruku‘ (bowing down on one’s knees) and four Sajadat (prostrations). Salah (prayer) commences with Takbir (Allah is great beyond description), Ruku‘ is performed with Takbir and you raise your head with Takbir, except the fifth Takbir, after which you perform Sajdah (prostration), and say Allah hears those who praise Him. Say Qunut (supplication after recitation in second Rak‘at) in every two Rak‘at before Ruku‘ and prolong Qunut and Ruku‘ equal to the time for recitation, Ruku‘ and Sajdah (prostration). If you finish before it (sun or moon) is cleared, sit down and pray before Allah, most Majestic, most Glorious, until it is cleared. If it clears before you finish Salah (prayer), complete the remaining. Make the recitation loud.’ I then asked, ‘How is recitation in this Salah (prayer)?’ He (the Imam) said, ‘If you recite Surah (a chapter) in every Rak‘at, recite al-Fatihah al-Kitab, but if you reduce from Surah (chapter) something, then recite from where you left and do not recite al-Fatihah al-Kitab.’ He (the Imam) said, ‘It is desirable to recite al-Kahf (Chapter 18) and al-Hijr (Chapter 15), unless one is the Imam and is afraid of causing difficulties for people behind him. Your Salah (prayer) should be in the open, without being covered by a house, if you can do so. Salah (prayer) because of sun eclipse should be given more time than that because of moon eclipse, but Salah (prayer) because of both is equal in Ruku‘ and Sajdah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/440)"
        ],
        "index": 5606,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:90:3",
        "text": [
          "حَمَّادٌ عَنْ حَرِيزٍ عَنْ زُرَارَةَ وَ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَا قُلْنَا لِأَبِي جَعْفَرٍ ( عليه السلام ) هَذِهِ الرِّيَاحُ وَ الظُّلَمُ الَّتِي تَكُونُ هَلْ يُصَلَّى لَهَا فَقَالَ كُلُّ أَخَاوِيفِ السَّمَاءِ مِنْ ظُلْمَةٍ أَوْ رِيحٍ أَوْ فَزَعٍ فَصَلِّ لَهُ صَلَاةَ الْكُسُوفِ حَتَّى يَسْكُنَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Hammad, from Hareyz, from Zurara and Muhammad Bin Muslim who both said, ",
            "‘We said to Abu Ja’far<sup>asws</sup>, ‘These (strong) winds and the darkness which occur, should one pray <span class=\"iTxt\">Salāt</span> for it?’ So he<sup>asws</sup> said: ‘Every fear of the sky, from a darkness, or a wind, or a terror, so pray <span class=\"iTxt\">Salāt</span> for it, <span class=\"iTxt\">Salāt</span> of the eclipse, until it settles’."
          ],
          "en.sarwar": [
            "3. Hammad has narrated from Hariz from Zurarah and Muhammad ibn Muslim who has said the following: “We once asked abu Ja‘far, ‘Alayhi al-Salam, about the wind and darkness that at certain times come, is there any Salah (prayer) because of it? He (the Imam) said, ‘When anything frightening from the sky in the form of darkness, wind or noise takes place, perform Salah (prayer) like that of eclipse until it clears out.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/441)"
        ],
        "index": 5607,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:90:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ وَقْتُ صَلَاةِ الْكُسُوفِ فِي السَّاعَةِ الَّتِي تَنْكَسِفُ عِنْدَ طُلُوعِ الشَّمْسِ وَ عِنْدَ غُرُوبِهَا قَالَ وَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) هِيَ فَرِيضَةٌ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Abu Umeyr, from Jameel Bin Darraj, ",
            "(It has been narrated) Abu Abdullah<sup>asws</sup> having said: ‘A time for <span class=\"iTxt\">Salāt</span> of the eclipse among the timing which it eclipses, (be it) at the emergence of the sun, and at its setting’. And Abu Abdullah<sup>asws</sup> said: ‘It is Obligatory’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn abu ‘Umayr from Jamil ibn Darraj who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the time of Salah (prayer) because of eclipse at sunrise and sunset if it can be performed at such time. Abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘It is obligatory.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/441)"
        ],
        "index": 5608,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:90:5",
        "text": [
          "عَنْهُ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ سَأَلْتُهُ عَنْ صَلَاةِ الْكُسُوفِ فِي وَقْتِ الْفَرِيضَةِ فَقَالَ ابْدَأْ بِالْفَرِيضَةِ فَقِيلَ لَهُ فِي وَقْتِ صَلَاةِ اللَّيْلِ فَقَالَ صَلِّ صَلَاةَ الْكُسُوفِ قَبْلَ صَلَاةِ اللَّيْلِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Muhammad Bin Al-Husayn, from Safwan Bin Yahya, from Al-A’ala Bin Razeyn, from Muhammad Bin Muslim, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>), said, ‘I asked him<sup>asws</sup> about <span class=\"iTxt\">Salāt</span> of the eclipse during a time of the Obligatory (<span class=\"iTxt\">Salāt</span>). So he<sup>asws</sup> said: ‘Begin with the Obligatory (<span class=\"iTxt\">Salāt</span>)’. So it was said to him<sup>asws</sup>, ‘(Supposing it was) at the time of the night <span class=\"iTxt\">Salāt</span>?’ So he<sup>asws</sup> said: ‘Pray the <span class=\"iTxt\">Salāt</span> of the eclipse before the night <span class=\"iTxt\">Salāt</span>’."
          ],
          "en.sarwar": [
            "5. It is a narration from him (narrator of previous Hadith) by Muhammad ibn af-Husayn from Safwan ibn Yahya from af-‘Ala’ ibn Razin from Muhammad ibn Muslim who has said the following: “I once asked one of the two Imam, ‘Alayhim al-Salam, about performing Salah (prayer) because of eclipse at the time of obligatory Salah (prayer). He (the Imam) said, ‘Begin with obligatory Salah (prayer).’ He (the Imam) was asked, ‘Can it be performed in the time of nightly optional Salah (prayer)?’ He (the Imam) said, ‘Perform Salah (prayer) because of eclipse before nightly optional Salah (prayer).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح وآخره مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/442)"
        ],
        "index": 5609,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:90:6",
        "text": [
          "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ زُرَارَةَ وَ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا انْكَسَفَتِ الشَّمْسُ كُلُّهَا وَ احْتَرَقَتْ وَ لَمْ تَعْلَمْ ثُمَّ عَلِمْتَ بَعْدَ ذَلِكَ فَعَلَيْكَ الْقَضَاءُ وَ إِنْ لَمْ تَحْتَرِقْ كُلُّهَا فَلَيْسَ عَلَيْكَ قَضَاءٌ .",
          "وَ فِي رِوَايَةٍ أُخْرَى إِذَا عَلِمَ بِالْكُسُوفِ وَ نَسِيَ أَنْ يُصَلِّيَ فَعَلَيْهِ الْقَضَاءُ وَ إِنْ لَمْ يَعْلَمْ بِهِ فَلَا قَضَاءَ عَلَيْهِ هَذَا إِذَا لَمْ يَحْتَرِقْ كُلُّه."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ahmad Bin Muhammad, from Hammad, from Hareyz, from Zurara and Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the sun is eclipsed totally and it smoulders, and you did not know, then you came to know after that, so upon you is the fulfilment (of the <span class=\"iTxt\">Salāt</span> missed out); and if all of it did not get eclipsed, so there is no fulfilment (of the <span class=\"iTxt\">Salāt</span> missed out) upon you’. ",
            "And in another report, ‘(he<sup>asws</sup> said): ‘When one knows of the eclipse and forgets to pray <span class=\"iTxt\">Salāt</span>, so upon him would be the fulfilment (of the <span class=\"iTxt\">Salāt</span> missed out); and if he did not know of it, so there is no fulfilment (of the <span class=\"iTxt\">Salāt</span> missed out) upon him. This is when the whole of it is not eclipsed’."
          ],
          "en.sarwar": [
            "6. It is narrated from him (narrator of previous Hadith) Ahmad ibn Muhammad from Hammad from Hariz from Zurarah and Muhammad ibn Muslim who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘When a total sun eclipse takes place but you do not notice it and come to know about it later, you must perform Qada’ (compensatory prayer for) such Salah (prayer), but if it is not a total eclipse, you are not required to perform anything.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/442)"
        ],
        "index": 5610,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:90:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ عِمْرَانَ بْنِ مُوسَى عَنْ مُحَمَّدِ بْنِ عَبْدِ الْحَمِيدِ عَنْ عَلِيِّ بْنِ الْفَضْلِ الْوَاسِطِيِّ قَالَ كَتَبْتُ إِلَيْهِ إِذَا انْكَسَفَتِ الشَّمْسُ أَوِ الْقَمَرُ وَ أَنَا رَاكِبٌ لَا أَقْدِرُ عَلَى النُّزُولِ قَالَ فَكَتَبَ إِلَيَّ صَلِّ عَلَى مَرْكَبِكَ الَّذِي أَنْتَ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Imran Bin Musa, from Muhammad Bin Abdul Hameed, from Ali Bin Al-Fazl Al-Wasity who said, ",
            "‘I wrote to him<sup>asws</sup>, ‘When either the sun or the moon is eclipsed and I am riding, I am not able upon the dismounting’. So he<sup>asws</sup> wrote to me: ‘Pray <span class=\"iTxt\">Salāt</span> upon your ride which you are upon’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from ‘Imran ibn Musa from Muhammad ibn ‘Abd al-Majid from Ali ibn al-Fadl al-Wasitiy who has said the following: “I once wrote to him (the Imam), Alayhi al-Salam, asking, ‘If a sun or moon eclipse takes place and I am riding and unable to dismount what must I do?’ He (the Imam) wrote to me, ‘Perform Salah (prayer) on your stumper which you ride.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:4:90",
  "kind": "verse_list"
}