{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 91"
        },
        "path": "/books/al-kafi:3:4:91",
        "titles": {
          "ar": "باب صَلَاةِ التَّسْبِيحِ",
          "en": "Chapter 91 – Salāt of the Glorification (Tasbeeh)"
        }
      }
    ],
    "index": 758,
    "local_index": 91,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 92"
        },
        "path": "/books/al-kafi:3:4:92",
        "titles": {
          "ar": "باب صَلَاةِ فَاطِمَةَ ( عليها السلام ) وَ غَيْرِهَا مِنْ صَلَاةِ التَّرْغِيبِ",
          "en": "Chapter 92 – Salāt of Syeda Fatima<sup>asws</sup>, and others from the Salāt of exhortation"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 90"
        },
        "path": "/books/al-kafi:3:4:90",
        "titles": {
          "ar": "باب صَلَاةِ الْكُسُوفِ",
          "en": "Chapter 90 – Salāt of the eclipse"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:4:91",
    "titles": {
      "ar": "باب صَلَاةِ التَّسْبِيحِ",
      "en": "Chapter 91 – Salāt of the Glorification (Tasbeeh)"
    },
    "verse_count": 7,
    "verse_start_index": 5610,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/443)"
        ],
        "index": 5611,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:91:1",
        "refs": {
          "Quran": [
            "/books/quran:99:1",
            "/books/quran:112:1",
            "/books/quran:110:1",
            "/books/quran:100:1"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنْ هَارُونَ بْنِ خَارِجَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِجَعْفَرٍ يَا جَعْفَرُ أَ لَا أَمْنَحُكَ أَ لَا أُعْطِيكَ أَ لَا أَحْبُوكَ فَقَالَ لَهُ جَعْفَرٌ بَلَى يَا رَسُولَ اللَّهِ قَالَ فَظَنَّ النَّاسُ أَنَّهُ يُعْطِيهِ ذَهَباً أَوْ فِضَّةً فَتَشَرَّفَ النَّاسُ لِذَلِكَ ",
          "فَقَالَ لَهُ إِنِّي أُعْطِيكَ شَيْئاً إِنْ أَنْتَ صَنَعْتَهُ فِي كُلِّ يَوْمٍ كَانَ خَيْراً لَكَ مِنَ الدُّنْيَا وَ مَا فِيهَا وَ إِنْ صَنَعْتَهُ بَيْنَ يَوْمَيْنِ غُفِرَ لَكَ مَا بَيْنَهُمَا أَوْ كُلَّ جُمْعَةٍ أَوْ كُلَّ شَهْرٍ أَوْ كُلَّ سَنَةٍ غُفِرَ لَكَ مَا بَيْنَهُمَا ",
          "تُصَلِّي أَرْبَعَ رَكَعَاتٍ تَبْتَدِئُ فَتَقْرَأُ وَ تَقُولُ إِذَا فَرَغْتَ سُبْحَانَ اللَّهِ وَ الْحَمْدُ لِلَّهِ وَ لَا إِلَهَ إِلَّا اللَّهُ وَ اللَّهُ أَكْبَرُ تَقُولُ ذَلِكَ خَمْسَ عَشْرَةَ مَرَّةً بَعْدَ الْقِرَاءَةِ فَإِذَا رَكَعْتَ قُلْتَهُ عَشْرَ مَرَّاتٍ فَإِذَا رَفَعْتَ رَأْسَكَ مِنَ الرُّكُوعِ قُلْتَهُ عَشْرَ مَرَّاتٍ فَإِذَا سَجَدْتَ قُلْتَهُ عَشْرَ مَرَّاتٍ فَإِذَا رَفَعْتَ رَأْسَكَ مِنَ السُّجُودِ فَقُلْ بَيْنَ السَّجْدَتَيْنِ عَشْرَ مَرَّاتٍ فَإِذَا سَجَدْتَ الثَّانِيَةَ فَقُلْ عَشْرَ مَرَّاتٍ فَإِذَا رَفَعْتَ رَأْسَكَ مِنَ السَّجْدَةِ الثَّانِيَةِ قُلْتَ عَشْرَ مَرَّاتٍ وَ أَنْتَ قَاعِدٌ قَبْلَ أَنْ تَقُومَ ",
          "فَذَلِكَ خَمْسٌ وَ سَبْعُونَ تَسْبِيحَةً فِي كُلِّ رَكْعَةٍ ثَلَاثُمِائَةِ تَسْبِيحَةٍ فِي أَرْبَعِ رَكَعَاتٍ أَلْفٌ وَ مِائَتَا تَسْبِيحَةٍ وَ تَهْلِيلَةٍ وَ تَكْبِيرَةٍ وَ تَحْمِيدَةٍ إِنْ شِئْتَ صَلَّيْتَهَا بِالنَّهَارِ وَ إِنْ شِئْتَ صَلَّيْتَهَا بِاللَّيْلِ .",
          "وَ فِي رِوَايَةِ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) تَقْرَأُ فِي الْأُولَى إِذَا زُلْزِلَتْ وَ فِي الثَّانِيَةِ وَ الْعَادِيَاتِ وَ فِي الثَّالِثَةِ إِذَا جَاءَ نَصْرُ اللَّهِ وَ فِي الرَّابِعَةِ بِقُلْ هُوَ اللَّهُ أَحَدٌ قُلْتُ فَمَا ثَوَابُهَا قَالَ لَوْ كَانَ عَلَيْهِ مِثْلُ رَمْلِ عَالِجٍ ذُنُوباً غَفَرَ اللَّهُ لَهُ ثُمَّ نَظَرَ إِلَيَّ فَقَالَ إِنَّمَا ذَلِكَ لَكَ وَ لِأَصْحَابِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Yahya Al-Halby, from Haroun Bin Jariya, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said to Ja’far<sup>as</sup> (Bin Abu Talib<sup>as</sup>): ‘O Ja’far<sup>as</sup>! Shall I<sup>saww</sup> confer upon you<sup>as</sup>, shall I<sup>saww</sup> give you<sup>as</sup>, shall I gift you<sup>as</sup> (something)?’ So Ja’far<sup>as</sup> said to him<sup>saww</sup>: ‘Yes, O Rasool-Allah<sup>saww</sup>!’ He<sup>asws</sup> said: ‘So the people thought that he<sup>saww</sup> would give him<sup>as</sup> some gold or silver, and the people anticipated for that. ",
            "So he<sup>saww</sup> said to him<sup>asws</sup>: ‘I<sup>saww</sup> am giving you<sup>as</sup> something, if you<sup>as</sup> were to act upon it during every day, it would be better for you<sup>as</sup> than the world and whatever is in it, and if you<sup>as</sup> were to do it in between two days, Allah<sup>azwj</sup> would Forgive for you<sup>as</sup> whatever (you<sup>as</sup> committed) what is between the two (days), or every Friday, or every month, or every year, (your<sup>as</sup> sins) would be Forgive for you<sup>as</sup> whatever (you<sup>as</sup> committed) between the two.",
            "You<sup>as</sup> should pray four Rak’at. You<sup>as</sup> should begin reciting and you<sup>as</sup> should be saying, when you<sup>as</sup> are free: ‘Glory be to Allah<sup>azwj</sup>, and the Praise is for Allah<sup>azwj</sup>, and there is no god except for Allah<sup>azwj</sup>, and Allah<sup>azwj</sup> is the Greatest’. You should say that fifteen times after the recitation. So when you<sup>as</sup> go down into <span class=\"iTxt\">Rukū</span> say it ten times. So when you<sup>as</sup> raise your<sup>as</sup> head from the <span class=\"iTxt\">Rukū</span>, say it ten times. So when you<sup>as</sup> perform <span class=\"iTxt\">Sajdah</span>, say it ten times. So when you<sup>as</sup> raise your<sup>as</sup> head from the <span class=\"iTxt\">Sajdah</span>, say it ten times between the two <span class=\"iTxt\">Sajdah</span>s. So when you<sup>as</sup> perform <span class=\"iTxt\">Sajdah</span> the second (<span class=\"iTxt\">Sajdah</span>) say it ten times. So when you<sup>as</sup> raise your<sup>as</sup> head from the second <span class=\"iTxt\">Sajdah</span> say it ten times, while you<sup>as</sup> are seated, before you<sup>as</sup> stand.",
            "So that would be seventy-five Glorifications during every Rak’at, being three hundred Glorification in four Rak’at. In four (Rak’at) there would be one thousand two hundred Glorifications, and Extollations of Oneness, and exclamations of <span class=\"iTxt\">Takbīr’</span>s, and Praises. If you<sup>as</sup> so desire to, pray it during the day, and if you<sup>as</sup> so desire to, pray it at night’.",
            "And in a report of Ibrahim Bin Abdul Hameed, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> (having said): ‘You should recite in the first (Rak’at) <span class=\"ibTxt\"><a href=\"/#/books/quran:99#h1\">[99:1]</a> When the earth is shaken</span> (Chapter 99), and in the second (Rak’at) <span class=\"ibTxt\"><a href=\"/#/books/quran:100#h1\">[100:1]</a> I swear by the runners</span> (Chapter 100), and in the third (Rak’at) <span class=\"ibTxt\"><a href=\"/#/books/quran:110#h1\">[110:1]</a> When there comes the help of Allah </span>(Chapter 110), and in the fourth (Rak’at) <span class=\"ibTxt\"><a href=\"/#/books/quran:112#h1\">[112:1]</a> Say He Allah is One</span> (Chapter 112)’. I said, ‘So what are its Rewards?’ He<sup>asws</sup> said: ‘If there were upon him sin like the grains of sand, Allah<sup>azwj</sup> would Forgive them for him’. Then he<sup>asws</sup> looked at me, so he<sup>asws</sup> said: ‘But rather, that is for you and for your companions (The Shias)’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Yahya al-Halabiy from Harun ibn Kharijah from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah once said to Ja‘far: ‘O Ja‘far, should I grant you and give an award to you or a gift?’ Ja‘far then said, ‘Yes, O Messenger of Allah, please do so.’ The narrator has said that people thought the Messenger of Allah might give him gold or silver. People remained anticipating. The Messenger of Allah said, ‘I give you something and if you practice every day, it will be better for you than the whole world and all that it contains. If you practice it every two days, Allah forgives you during the time in between. For your practicing it every Friday or every month or every year, Allah grants you forgiveness during the time in between. Perform four Rak‘at Salah (prayer). Begin the Salah (prayer), complete the recitations and then say, “Allah is free of all defects, all praise belongs to Allah, no one, other than Allah, deserves worship and Allah is great” fifteen times. In Ruku‘ position, say it ten times. After Ruku‘ (bowing down on one’s knees)’, when standing, say it ten times. In the first sajdah say it ten times. When sitting between the two sajdah say it ten times. In the second sajdah say it ten times. After the second sajdah before standing up for the second Rak‘at say it ten times. This amounts to seventy-five Tasbihah, which makes it three hundred Tasbihah in one Rak‘at and in four Rak‘at Salah (prayer) it becomes one thousand two hundred Tasbihah, Tahlilah, Tahmidah and Takbirah. You may perform this Salah (prayer) during the day or night as you wish.’ “It is in a Hadith (narration) from Ibrahim ibn ‘Abd al-Hamid that abu al-Hassan, ‘Alayhi al-Salam, has said the following. ‘In the first Rak‘at after the first Chapter of the Holy Quran recite Chapter 99. In the second Rak‘at you should recite Chapter 100, in the third Rak‘at recite Chapter 110 and in the fourth Rak‘at read Chapter 112 of the Holy Quran.’ I then asked, ‘What is the reward for this Salah (prayer)?’ The Imam replied, ‘If his sins are as many as grains of sand in a pile, Allah forgives him.’ He then looked at me and said, ‘This is for you and your people only.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/445)"
        ],
        "index": 5612,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:91:2",
        "text": [
          "وَ رُوِيَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ يَحْيَى بْنِ عِمْرَانَ الْحَلَبِيِّ عَنْ ذَرِيحٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تُصَلِّيهَا بِاللَّيْلِ وَ تُصَلِّيهَا فِي السَّفَرِ بِاللَّيْلِ وَ النَّهَارِ وَ إِنْ شِئْتَ فَاجْعَلْهَا مِنْ نَوَافِلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And in a report (It has been narrated) from Ibn Abu Umeyr, from Yahya Bin Imran Al-Halby, from Zareeh, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘You can pray it (<span class=\"iTxt\">Salāt</span> of Ja’far<sup>as</sup>) at night, and you can pray it during the journey at night and the day, and if you so desire to, so hasten it from your optional (<span class=\"iTxt\">Salāt</span>s)’."
          ],
          "en.sarwar": [
            "2. It is narrated from ibn abu ‘Umayr from Yahya ibn ‘Imran al-Halabiy from Dharih who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘You can perform this Salah (prayer) during the night and on a journey, during the night or day, and if you like, you can make it part of your optional Salah (prayer).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/445)"
        ],
        "index": 5613,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:91:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ مُحَسِّنِ بْنِ أَحْمَدَ عَنْ أَبَانٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ مَنْ كَانَ مُسْتَعْجِلًا يُصَلِّي صَلَاةَ جَعْفَرٍ مُجَرَّدَةً ثُمَّ يَقْضِي التَّسْبِيحَ وَ هُوَ ذَاهِبٌ فِي حَوَائِجِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Muhassin Bin Ahmad, from Aban who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The one who was in a hurry, can pray the <span class=\"iTxt\">Salāt</span> of Ja’far<sup>as</sup> in brief, then he can fulfil the Glorifications while he is going regarding his needs’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from Muhsin ibn Ahmad from Aban who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ‘One who is in a hurry may perform Salah (prayer) of Ja‘far without Tasbihat, then perform Qada’ (compensatory prayer for) them when walking (or working) for his needs.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/445)"
        ],
        "index": 5614,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:91:4",
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ عَلِيِّ بْنِ سُلَيْمَانَ قَالَ كَتَبْتُ إِلَىالرَّجُلِ ( عليه السلام ) مَا تَقُولُ فِي صَلَاةِ التَّسْبِيحِ فِي الْمَحْمِلِ فَكَتَبَ ( عليه السلام ) إِذَا كُنْتَ مُسَافِراً فَصَلِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Ahmad, from Ali Bin Suleyman who said, ",
            "‘I wrote to the man<sup>asws</sup>, ‘What are you<sup>asws</sup> saying regarding the <span class=\"iTxt\">Salāt</span> of the Glorification (prayed) in the carriage?’ So he<sup>asws</sup> wrote: ‘When you were travelling, so pray’."
          ],
          "en.sarwar": [
            "4. Ahmad ibn Idris has narrated from Muhammad ibn Ahmad from Ali ibn Sulayman who has said the following: “I wrote to the man (Imam), ‘Alayhi al-Salam, ‘What do you say about reading Salah (prayer) of Tasbih while sitting in a carriage on the back of camel?’ He wrote back, ‘If you are on a journey you can perform it (in such carriage).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/445)"
        ],
        "index": 5615,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:91:5",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنِ ابْنِ مَحْبُوبٍ رَفَعَهُ قَالَ قَالَ تَقُولُ فِي آخِرِ رَكْعَةٍ مِنْ صَلَاةِ جَعْفَرٍ ( عليه السلام ) يَا مَنْ لَبِسَ الْعِزَّ وَ الْوَقَارَ يَا مَنْ تَعَطَّفَ بِالْمَجْدِ وَ تَكَرَّمَ بِهِ يَا مَنْ لَا يَنْبَغِي التَّسْبِيحُ إِلَّا لَهُ يَا مَنْ أَحْصَى كُلَّ شَيْ‏ءٍ عِلْمُهُ يَا ذَا النِّعْمَةِ وَ الطَّوْلِ يَا ذَا الْمَنِّ وَ الْفَضْلِ يَا ذَا الْقُدْرَةِ وَ الْكَرَمِ أَسْأَلُكَ بِمَعَاقِدِ الْعِزِّ مِنْ عَرْشِكَ وَ بِمُنْتَهَى الرَّحْمَةِ مِنْ كِتَابِكَ وَ بِاسْمِكَ الْأَعْظَمِ الْأَعْلَى وَ كَلِمَاتِكَ التَّامَّةِ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ أَنْ تَفْعَلَ بِي كَذَا وَ كَذَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from one of our companions, from Ibn Mahboub, raising it, said, ",
            "‘He<sup>asws</sup> said: ‘You should be saying in the last Rak’at from the <span class=\"iTxt\">Salāt</span> of Ja’far<sup>as</sup>, ‘O One Who is Clothed in Honour and Dignity! O One Who Grants with the Glory and is Prestiged with it! O One Who, the Glorification is not befitting except for Him<sup>azwj</sup>! O One Who Reckons everything in His<sup>azwj</sup> Knowledge! O One with the Bounties and the Abundance! O One with the Favours and the Grace! O One with the Power and the Benevolence! I ask You<sup>azwj</sup> by the Honourable Splendour from Your<sup>azwj</sup> Throne, and by the peak of the Mercy from Your<sup>azwj</sup> Book, and by Your<sup>azwj</sup> Magnificent Name, the Exalted, and Your<sup>azwj</sup> complete Speech, that You<sup>azwj</sup> Send Blessings upon Muhammad and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and that You<sup>azwj</sup> should do such and such with me’."
          ],
          "en.sarwar": [
            "5. Ali ibn Muhammad has narrated from certain individuals of our people from ibn Mahbub in a marfu‘ manner that the Imam said: “In the last Rak‘at (sajdah of last Rak‘at), in Salah (prayer) of Ja’far, you should say this. ‘O the One, Who has dressed up in majesty and dignity, who is kind with glory and is gracious with glory, You are the One, besides whom no one deserves Tasbih (glorification). (You are) the One whose knowledge has encompassed all things, the bountiful and generous, the One who does favors with additional generosity and the powerful and gracious. I appeal to You through the majestic qualities of Your Throne and the limits of mercy from Your book and through Your great, the most High name and perfect words. Allahumma Salli ‘Ala Muhammad wa ‘Ali Muhammad (O Allah grant Muhammad and his family a compensation worthy of their serving Your cause). Please make my such and such wishes come true.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/446)"
        ],
        "index": 5616,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:91:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي الْقَاسِمِ ذَكَرَهُ عَمَّنْ حَدَّثَهُ عَنْ أَبِي سَعِيدٍ الْمَدَائِنِيِّ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَ لَا أُعَلِّمُكَ شَيْئاً تَقُولُهُ فِي صَلَاةِ جَعْفَرٍ فَقُلْتُ بَلَى فَقَالَ إِذَا كُنْتَ فِي آخِرِ سَجْدَةٍ مِنَ الْأَرْبَعِ رَكَعَاتٍ فَقُلْ إِذَا فَرَغْتَ مِنْ تَسْبِيحِكَ سُبْحَانَ مَنْ لَبِسَ الْعِزَّ وَ الْوَقَارَ سُبْحَانَ مَنْ تَعَطَّفَ بِالْمَجْدِ وَ تَكَرَّمَ بِهِ سُبْحَانَ مَنْ لَا يَنْبَغِي التَّسْبِيحُ إِلَّا لَهُ سُبْحَانَ مَنْ أَحْصَى كُلَّ شَيْ‏ءٍ عِلْمُهُ سُبْحَانَ ذِي الْمَنِّ وَ النِّعَمِ سُبْحَانَ ذِي الْقُدْرَةِ وَ الْكَرَمِ ",
          "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِمَعَاقِدِ الْعِزِّ مِنْ عَرْشِكَ وَ مُنْتَهَى الرَّحْمَةِ مِنْ كِتَابِكَ وَ اسْمِكَ الْأَعْظَمِ وَ كَلِمَاتِكَ التَّامَّةِ الَّتِي تَمَّتْ صِدْقاً وَ عَدْلًا صَلِّ عَلَى مُحَمَّدٍ وَ أَهْلِ بَيْتِهِ وَ افْعَلْ بِي كَذَا وَ كَذَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Abdullah Bin Abu Al-Qasim, mentioning it from the one who narrated it, from Abu Saeed Al-Madainy who said, ",
            "‘Abu Abdullah<sup>asws</sup> said to me: ‘Shall I<sup>asws</sup> teach you something you should be saying in the <span class=\"iTxt\">Salāt</span> of Ja’far<sup>as</sup>?’ So I said, ‘Yes’. So he<sup>asws</sup> said: ‘When you were in the last <span class=\"iTxt\">Sajdah</span> from the fourth Rak’at, say when you are free from your Glorification, ‘Glorious is the One Who is Clothed in Honour and the Dignity! Glorious is the One Who Gives with the Glory and is Prestiged with it! Glorious is the One, the Glorification not being befitting for anyone except for Him<sup>azwj</sup>! Glorious is the One Who Reckons everything in His<sup>azwj</sup> Knowledge! Glorious is the One with the Favours, and the Bounties! Glorious is the One with the Power and the Benevolence! ",
            "O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> by the Honourable Splendour from Your<sup>azwj</sup> Throne, and the peak of the Mercy from Your<sup>azwj</sup> Book, and Your<sup>azwj</sup> Magnificent Name, and Your<sup>azwj</sup> complete Speech which is complete Truth, and Just. Send Blessings upon Muhammad<sup>saww</sup> and the People<sup>asws</sup> of His<sup>azwj</sup> Household, and Do such and such with me’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ‘Abd Allah ibn abu al-Qasim who has narrated from those who narrated to him from abu Sa‘id al-Mada’iniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘Should I teach you something to say after Salah (prayer) of Ja‘far?’ I replied, ‘Yes, please do so.’ The Imam said, ‘In the last sajdah of the fourth Rak‘at after Tasbihat (plural of Tasbih) say this. “O the One who has dressed up in majesty and dignity, (You are the one) who is kind with glory and is gracious with glory. (You are), the One, besides whom no one deserves Tasbih (glorification). (You are) the One whose knowledge has encompassed all things, the bountiful and generous, the One who does favors with additional generosity, the powerful and gracious. I appeal to You through the majestic qualities of Your Throne and the limits of mercy from Your book and through Your great, the most High name and perfect words in all truth and justice. Allahumma Salli ‘Ala Muhammad wa ‘Ali Muhammad (O Allah grant Muhammad and his family a compensation worthy of their serving Your cause)’, please make my such and such wishes come true.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/447)"
        ],
        "index": 5617,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:91:7",
        "text": [
          "مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنِ الْحَكَمِ بْنِ مِسْكِينٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَنْ صَلَّى صَلَاةَ جَعْفَرٍ كَتَبَ اللَّهُ عَزَّ وَ جَلَّ لَهُ مِنِ الْأَجْرِ مِثْلَ مَا قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِجَعْفَرٍ قَالَ إِي وَ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al-Hassan, from Sahl Bin Ziyad, from Ali Bin Asbaat, from Al-Hakam Bin Miskeen, from Is’haq Bin Ammar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The one who prays a <span class=\"iTxt\">Salāt</span>, the <span class=\"iTxt\">Salāt</span> of Ja’far<sup>as</sup>, Allah<sup>azwj</sup> would Write for him, from the Recompense, the like of what Rasool-Allah<sup>saww</sup> said to Ja’far<sup>asws</sup>?’ He<sup>asws</sup> said: ‘Yes, by Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn al-Hassan has narrated from Sahl ibn Ziyad from Ali ibn Asbat from al-Hakam ibn Miskin from Ishaq ibn ‘Ammar who has said the following: “I asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘If one performs Salah (prayer) of Ja‘far, does Allah, the Most Majestic, the Most Glorious, grant him a reward like that which the Messenger of Allah mentioned for Ja‘far?’ The Imam said, ‘Yes, by Allah, He does so.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:4:91",
  "kind": "verse_list"
}