{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 92"
        },
        "path": "/books/al-kafi:3:4:92",
        "titles": {
          "ar": "باب صَلَاةِ فَاطِمَةَ ( عليها السلام ) وَ غَيْرِهَا مِنْ صَلَاةِ التَّرْغِيبِ",
          "en": "Chapter 92 – Salāt of Syeda Fatima<sup>asws</sup>, and others from the Salāt of exhortation"
        }
      }
    ],
    "index": 759,
    "local_index": 92,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 93"
        },
        "path": "/books/al-kafi:3:4:93",
        "titles": {
          "ar": "باب صَلَاةِ الِاسْتِخَارَةِ",
          "en": "Chapter 93 – Salāt of Istikhara (Seeking Allahs<sup>zwj</sup>’s Choice)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 91"
        },
        "path": "/books/al-kafi:3:4:91",
        "titles": {
          "ar": "باب صَلَاةِ التَّسْبِيحِ",
          "en": "Chapter 91 – Salāt of the Glorification (Tasbeeh)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:4:92",
    "titles": {
      "ar": "باب صَلَاةِ فَاطِمَةَ ( عليها السلام ) وَ غَيْرِهَا مِنْ صَلَاةِ التَّرْغِيبِ",
      "en": "Chapter 92 – Salāt of Syeda Fatima<sup>asws</sup>, and others from the Salāt of exhortation"
    },
    "verse_count": 7,
    "verse_start_index": 5617,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/447)"
        ],
        "index": 5618,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:92:1",
        "refs": {
          "Quran": [
            "/books/quran:112:1"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ مُحَمَّدٍ</span> وَ غَيْرُهُ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُثَنًّى الْحَنَّاطِ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ مَنْ صَلَّى أَرْبَعَ رَكَعَاتٍ بِمِائَتَيْ مَرَّةٍ قُلْ هُوَ اللَّهُ أَحَدٌ فِي كُلِّ رَكْعَةٍ خَمْسُونَ مَرَّةً لَمْ يَنْفَتِلْ وَ بَيْنَهُ وَ بَيْنَ اللَّهِ ذَنْبٌ إِلَّا غُفِرَ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad and someone else, from Sahl Bin Ziyad, from Ali Bin Al-Hakam, from Musa Al-Hannat, from Abu Baseer who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The one who prays <span class=\"iTxt\">Salāt</span> of four Rak’at with two hundred times reciting <span class=\"ibTxt\"><a href=\"/#/books/quran:112#h1\">[112:1]</a> Say He Allah is One</span> (Chapter 112) – that is (reciting) fifty times in each Rak’at, would not wrap up (finish), and there would be between him and Allah<sup>azwj</sup> a sin, except that it would have been Forgiven for him’."
          ],
          "en.sarwar": [
            "1. Ali ibn Muhammad and others have narrated from Sahl ibn Ziyad from Ali ibn al-Hakam from Muthanna al-Hannat from abu Basir who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ’One who performs, four Rak’at Salah (prayer) and reads two hundred times Chapter 112 of the Holy Quran, fifty times in each Rak’at, does not move away with any of his sins before Allah without being forgiven.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/448)"
        ],
        "index": 5619,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:92:2",
        "refs": {
          "Quran": [
            "/books/quran:112:1"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْبَرْقِيِّ عَنْ سَعْدَانَ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ صَلَّى أَرْبَعَ رَكَعَاتٍ يَقْرَأُ فِي كُلِّ رَكْعَةٍ قُلْ هُوَ اللَّهُ أَحَدٌ خَمْسِينَ مَرَّةً لَمْ يَنْفَتِلْ وَ بَيْنَهُ وَ بَيْنَ اللَّهِ ذَنْبٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al-Barqy, from Sa’dan, from Abdullah Bin Sinan, ",
            "(It has been narrated) Abu Abdullah<sup>asws</sup> having said: ‘The one who prays a <span class=\"iTxt\">Salāt</span> of four Rak’at, reciting in every Rak’at <span class=\"ibTxt\"><a href=\"/#/books/quran:112#h1\">[112:1]</a> Say He Allah is One</span> (Chapter 112) fifty times, would not wrap up (finish), and there would be a sin (remaining) between him and Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad from al-Barqiy from Sa‘dan from ‘Abd Allah ibn Sinan who has said the following: “He has narrated from abu ‘Abd Allah, ‘Alayhi al-Salam, a Hadith with the text which is the same as that of the previous Hadith.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/448)"
        ],
        "index": 5620,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:92:3",
        "refs": {
          "Quran": [
            "/books/quran:112:1"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى بِإِسْنَادِهِ رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ صَلَّى رَكْعَتَيْنِ بِقُلْ هُوَ اللَّهُ أَحَدٌ فِي كُلِّ رَكْعَةٍ سِتِّينَ مَرَّةً انْفَتَلَ وَ لَيْسَ بَيْنَهُ وَ بَيْنَ اللَّهِ ذَنْبٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, by  his chain, ",
            "(It has been) raising it from Abu Abdullah<sup>asws</sup> having said: ‘The one who prays four Rak’at of <span class=\"iTxt\">Salāt</span> with <span class=\"ibTxt\"><a href=\"/#/books/quran:112#h1\">[112:1]</a> Say He Allah is One</span> (Chapter 112) sixty times in every Rak’at, would wrap up (finish), and there would not be a sin (remaining) between him and Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from through the chain of his narrators in a marfu’ manner who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the text is the same as the previous Hadith except that it says, ‘Read Chapter 112 of the Holy Quran sixty times in each Rak‘at.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/448)"
        ],
        "index": 5621,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:92:4",
        "refs": {
          "Quran": [
            "/books/quran:112:1"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ مَنْ صَلَّى الْمَغْرِبَ وَ بَعْدَهَا أَرْبَعَ رَكَعَاتٍ وَ لَمْ يَتَكَلَّمْ حَتَّى يُصَلِّيَ عَشْرَ رَكَعَاتٍ يَقْرَأُ فِي كُلِّ رَكْعَةٍ بِالْحَمْدِ وَ قُلْ هُوَ اللَّهُ أَحَدٌ كَانَتْ عِدْلَ عَشْرِ رِقَابٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from one of our companions, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup> having said: ‘The one who prays the Maghrib <span class=\"iTxt\">Salāt</span>, and four Rak’at after it, and does not speak until he has prayed ten Rak’at, reciting in each Rak’at with Al-Hamd (Chapter 1), and <span class=\"ibTxt\"><a href=\"/#/books/quran:112#h1\">[112:1]</a> Say He Allah is One</span> (Chapter 112), it would equate to (freeing) ten necks (slaves)’."
          ],
          "en.sarwar": [
            "4. Ali ibn Muhammad has narrated from certain individuals of our people who have said the following: “Abu al-Hassan al-Rida, ‘Alayhi al-Salam, has said, ‘If one after performing Maghrib (Salah (prayer) soon after sunset), the four Rak‘at and before speaking to anyone performs ten Rak‘at Salah (prayer), recites al-Fatihah and Chapter 112 of the Holy Quran it is equal in reward to setting free of ten slaves.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/448)"
        ],
        "index": 5622,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:92:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ كُرْدُوسٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ تَطَهَّرَ ثُمَّ أَوَى إِلَى فِرَاشِهِ بَاتَ وَ فِرَاشُهُ كَمَسْجِدِهِ فَإِنْ قَامَ مِنَ اللَّيْلِ فَذَكَرَ اللَّهَ تَنَاثَرَتْ عَنْهُ خَطَايَاهُ فَإِنْ قَامَ مِنْ آخِرِ اللَّيْلِ فَتَطَهَّرَ وَ صَلَّى رَكْعَتَيْنِ وَ حَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ وَ صَلَّى عَلَى النَّبِيِّ ( صلى الله عليه وآله ) لَمْ يَسْأَلِ اللَّهَ شَيْئاً إِلَّا أَعْطَاهُ إِمَّا أَنْ يُعْطِيَهُ الَّذِي يَسْأَلُهُ بِعَيْنِهِ وَ إِمَّا أَنْ يَدَّخِرَ لَهُ مَا هُوَ خَيْرٌ لَهُ مِنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ibn Abu Umeyr, from Muhammad Bin Kurdous, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who cleans himself, then lies down upon his bed overnight, his bed is like his Masjid. So if he was to stand at night and mention Allah<sup>azwj</sup>, his sins would scatter away from him. So if he was to stand at the end of the night, and cleans himself and prays two Rak’at of <span class=\"iTxt\">Salāt</span>, and Praises Allah<sup>azwj</sup> and Lauds upon Him<sup>azwj</sup>, and sends Blessings upon the Prophet<sup>saww</sup>, would not ask Allah<sup>azwj</sup> for anything, except that He<sup>azwj</sup> would Grant it. Either He<sup>azwj</sup> would Grant it what which he had asked for, exactly, or He<sup>azwj</sup> would Treasure it for him what is better for him than it’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn abu ‘Umayr from Muhammad ibn Kurdus who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If one cleanses himself (takes Wudu’ or bath), then goes to bed for the night, his bed is considered a Masjid. If he wakes up during the night and speaks of Allah, his sins scatter away from him. One who may get up toward the end of the night, cleanse himself (take Wudu’ or bath), perform two Rak‘at Salah (prayer), praise Allah and speak of His glory. If then says, “Allahumma Salli ‘Ala Muhammad wa ‘Ali Muhammad (O Allah grant Muhammad and his family compensation worthy of their serving Your cause).” The wishes he asks for are given to him in substance or are saved for him in a better form.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/448)"
        ],
        "index": 5623,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:92:6",
        "refs": {
          "Quran": [
            "/books/quran:2:284",
            "/books/quran:73:6",
            "/books/quran:112:1",
            "/books/quran:2:163",
            "/books/quran:2:164"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ بِإِسْنَادِهِ عَنْ بَعْضِهِمْ ( عليهم السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّ ناشِئَةَ اللَّيْلِ هِيَ أَشَدُّ وَطْئاً وَ أَقْوَمُ قِيلًا قَالَ هِيَ رَكْعَتَانِ بَعْدَ الْمَغْرِبِ تَقْرَأُ فِي أَوَّلِ رَكْعَةٍ بِفَاتِحَةِ الْكِتَابِ وَ عَشْرٍ مِنْ أَوَّلِ الْبَقَرَةِ وَ آيَةِ السُّخْرَةِ وَ مِنْ قَوْلِهِ وَ إِلهُكُمْ إِلهٌ واحِدٌ لا إِلهَ إِلَّا هُوَ الرَّحْمنُ الرَّحِيمُ. إِنَّ فِي خَلْقِ السَّماواتِ وَ الْأَرْضِ إِلَى قَوْلِهِ لَآياتٍ لِقَوْمٍ يَعْقِلُونَ وَ خَمْسَ عَشْرَةَ مَرَّةً قُلْ هُوَ اللَّهُ أَحَدٌ",
          "وَ فِي الرَّكْعَةِ الثَّانِيَةِ فَاتِحَةَ الْكِتَابِ وَ آيَةَ الْكُرْسِيِّ وَ آخِرَ الْبَقَرَةِ مِنْ قَوْلِهِ لِلَّهِ ما فِي السَّماواتِ وَ ما فِي الْأَرْضِ إِلَى أَنْ تَخْتِمَ السُّورَةَ وَ خَمْسَ عَشْرَةَ مَرَّةً قُلْ هُوَ اللَّهُ أَحَدٌ ثُمَّ ادْعُ بَعْدَ هَذَا بِمَا شِئْتَ ",
          "قَالَ وَ مَنْ وَاظَبَ عَلَيْهِ كُتِبَ لَهُ بِكُلِّ صَلَاةٍ سِتُّمِائَةِ أَلْفِ حَجَّةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, by his chain, ",
            "(It has been narrated) from one of them<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:73#h6\">[73:6]</a> Surely the rising by night is the firmest way to tread and the best speech</span>. He<sup>asws</sup> said: ‘These are the two Rak’at of <span class=\"iTxt\">Salāt</span> after Al-Maghrib. You should recite in the first Rak’at with the Opening of the Book (Chapter 1), and then (Verses) from the beginning of (Surah) Al-Baqarah, and Al-Sakhra Verse (Ch 7:54), and from His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h163\">[2:163]</a> And your God is one God! There is no god but He; He is the Beneficent, the Merciful <a href=\"/#/books/quran:2#h164\">[2:164]</a> Surely in the Creation of the skies and the earth </span>– up to His<sup>azwj</sup> Words - <span class=\"ibTxt\">there are signs for a people who understand</span>, And fifteen times <span class=\"ibTxt\"><a href=\"/#/books/quran:112#h1\">[112:1]</a> Say He Allah is One</span> (Chapter 112).",
            "And in the second Rak’at, Opening of the Book (Chapter 1), and the Verse of the Throne (Ch 2:255), and the end part of (Surah) Al-Baqarah, from His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h284\">[2:284]</a> Whatever is in the skies and whatever is in the earth is for Allah</span> – up to the end of the Chapter, and fifteen times <span class=\"ibTxt\"><a href=\"/#/books/quran:112#h1\">[112:1]</a> Say He Allah is One</span> (Chapter 112). Then, after this, supplicate with whatever you so desire to’.",
            "He<sup>asws</sup> said: ‘The one who persevered upon it, there would be Written for him, with each <span class=\"iTxt\">Salāt</span>, six hundred thousand performances of Hajj’."
          ],
          "en.sarwar": [
            "6. Ali ibn Muhammad has narrated from through his chain of narrators who has said the following: “One of the ’A’immah about the words of Allah, ‘An initiation (for Salah (prayer) is of a stronger impression’ <a href=\"/#/books/quran:73#h6\">[73:6]</a>, the Imam has said, ‘It is the two Rak‘at Salah (prayer) after Maghrib (Salah (prayer) soon after sunset). In the first Rak‘at read al-Fatihah and ten verses from the beginning of Chapter 2, verse 54 of Chapter 7, verses 153-154 of Chapter 2 and 15 times Chapter 112. In the second Rak‘at after al-Fatihah read verses 255- 257, then verses 284 - 286 of Chapter 2 and 15 times Chapter 112 of the Holy Quran. Then ask for your wishes as you like. If one maintains this practice a reward of six hundred thousand Hajj will be given to him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/449)"
        ],
        "index": 5624,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:92:7",
        "refs": {
          "Quran": [
            "/books/quran:112:1"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ رَفَعَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا كَانَ النِّصْفُ مِنْ شَعْبَانَ فَصَلِّ أَرْبَعَ رَكَعَاتٍ تَقْرَأُ فِي كُلِّ رَكْعَةٍ الْحَمْدَ وَ قُلْ هُوَ اللَّهُ أَحَدٌ مِائَةَ مَرَّةٍ فَإِذَا فَرَغْتَ فَقُلِ اللَّهُمَّ إِنِّي إِلَيْكَ فَقِيرٌ وَ إِنِّي عَائِذٌ بِكَ وَ مِنْكَ خَائِفٌ وَ بِكَ مُسْتَجِيرٌ رَبِّ لَا تُبَدِّلِ اسْمِي رَبِّ لَا تُغَيِّرْ جِسْمِي رَبِّ لَا تُجْهِدْ بَلَائِي أَعُوذُ بِعَفْوِكَ مِنْ عِقَابِكَ وَ أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ وَ أَعُوذُ بِرَحْمَتِكَ مِنْ عَذَابِكَ وَ أَعُوذُ بِكَ مِنْكَ جَلَّ ثَنَاؤُكَ أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ وَ فَوْقَ مَا يَقُولُ الْقَائِلُونَ ",
          "قَالَ وَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَوْمُ سَبْعَةٍ وَ عِشْرِينَ مِنْ رَجَبٍ نُبِّئَ فِيهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ صَلَّى فِيهِ أَيَّ وَقْتٍ شَاءَ اثْنَتَيْ عَشْرَةَ رَكْعَةً يَقْرَأُ فِي كُلِّ رَكْعَةٍ بِأُمِّ الْقُرْآنِ وَ سُورَةٍ مَا تَيَسَّرَ فَإِذَا فَرَغَ وَ سَلَّمَ جَلَسَ مَكَانَهُ ثُمَّ قَرَأَ أُمَّ الْقُرْآنِ أَرْبَعَ مَرَّاتٍ وَ الْمُعَوِّذَاتِ الثَّلَاثَ كُلَّ وَاحِدَةٍ أَرْبَعَ مَرَّاتٍ فَإِذَا فَرَغَ وَ هُوَ فِي مَكَانِهِ قَالَ لَا إِلَهَ إِلَّا اللَّهُ وَ اللَّهُ أَكْبَرُ وَ الْحَمْدُ لِلَّهِ وَ سُبْحَانَ اللَّهِ وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ أَرْبَعَ مَرَّاتٍ ثُمَّ يَقُولُ اللَّهُ اللَّهُ رَبِّي لَا أُشْرِكُ بِهِ شَيْئاً أَرْبَعَ مَرَّاتٍ ثُمَّ يَدْعُو فَلَا يَدْعُو بِشَيْ‏ءٍ إِلَّا اسْتُجِيبَ لَهُ فِي كُلِّ حَاجَةٍ إِلَّا أَنْ يَدْعُوَ فِي جَائِحَةِ قَوْمٍ أَوْ قَطِيعَةِ رَحِمٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, raising it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whenever it is from the middle of Shabaan, so pray four Rak’at of <span class=\"iTxt\">Salāt</span>, reciting in each Rak’at Al-Hamd (Chapter 1) and <span class=\"ibTxt\"><a href=\"/#/books/quran:112#h1\">[112:1]</a> Say He Allah is One</span> (Chapter 112) one hundred times, So when you are free, say, ‘O Allah<sup>azwj</sup>! I am needy to You<sup>azwj</sup>, and I seek Refuge with You<sup>azwj</sup>, and fearful from You<sup>azwj</sup>, and Sanctuary with You<sup>azwj</sup>. Lord<sup>azwj</sup>! Do not Change my name. Lord<sup>azwj</sup>! Do not Change my body. Lord<sup>azwj</sup>! Do not Overload my afflictions. I seek Refuge with Your<sup>azwj</sup> Pardon; and I seek Refuge with Your<sup>azwj</sup> Pleasure from Your<sup>azwj</sup> Wrath; and I seek Refuge with Your<sup>azwj</sup> Mercy from Your<sup>azwj</sup> Punishment; and I seek Refuge with You<sup>azwj</sup> from You<sup>azwj</sup>. Masjestic is Your<sup>azwj</sup> Praise. You<sup>azwj</sup> are just as You<sup>azwj</sup> Praised Yourself<sup>azwj</sup>, and above what the speakers are saying’. ",
            "He (the narrator) said, ‘Abu Abdullah<sup>asws</sup> said: ‘On the day of the twenty seventh of Rajab, Rasool-Allah<sup>saww</sup> gave the news during it: ‘The one who prays a <span class=\"iTxt\">Salāt</span> of twelve Rak’at during it, whichever time he so desires to, reciting in each Rak’at with the Mother of the Book (Chapter 1) and a Chapter what is easy, so when he is free and <span class=\"iTxt\">Salām</span>, sits in his place, then recites the Mother of the Quran (Chapter 1) four times, and Al-Mawizat (Chapters 112, 113 & 114), each one four times, so when he is free and he is in his place, says, ‘There is no god except for Allah<sup>azwj</sup>, and Allah<sup>azwj</sup> is the Greatest, and the Praise is for Allah<sup>azwj</sup>, and Glorious is Allah<sup>azwj</sup>, and there is neither a Might nor Strength except with Allah<sup>azwj</sup>’, four times, then he is saying, ‘Allah<sup>azwj</sup>! Allah<sup>azwj</sup> is my Lord<sup>azwj</sup>. There is nothing which associates with Him<sup>azwj</sup>’, four times, then supplicates, so he would not supplicate with anything except that it would be Answered for him regarding every need, except if he were to supplicate regarding a catastrophe (to befall upon a) people, or cutting-off of a relationship’."
          ],
          "en.sarwar": [
            "7. Ali ibn Muhammad has narrated in a marfu‘ manner who has said the following: “Abu ’Abd Allah, ‘Alayhi al-Salam, has said that on the night of the middle of the month of Sha’ban perform four Rak‘at Salah (prayer). In every Rak‘at read al-Fatihah and Chapter 112 one hundred times. After completing say, ‘O Lord, I am needy to You. I seek protection with You and I am afraid of Your (anger). I plead before You for your protection. O Lord, do not replace my name and do not change my body. O my Lord, do not make my trial extremely hard. I seek your protection with Your pardon against Your punishment, I seek protection with Your pleasure against Your anger, I seek protection with Your mercy against Your punishment, I seek protection with You from You. Your praise is exalted. You are just as You have said You are and beyond what others say.’ The narrator has said that abu ‘Abd Allah, ‘Alayhi al-Salam, then said this, ‘On the twenty-seventh of the month of Rajab the Messenger of Allah gave people this information. It said, “One can perform a Salah (prayer), any time he wants, of twelve Rak‘at. In each Rak‘at he can recite al-Fatihah and another chapter from the Holy Quran. After completing and Salam, sits in his place, then reads al-Fatihah four times, chapters 112, 113 and 114 four times each. After completing while still in his place says four times, ‘No one, other than Allah, deserves worship, Allah is great, all praise belongs to Allah, Allah is free of all defects and there is no means and power other than the power and means of Allah. 5 Then says four times, ‘O Allah, (be a witness that) Allah is my Lord. I do not consider anyone as His partner.’ Then he may ask for his wishes. His wishes will be made to come true about everything except for the destruction of a people or the destruction of good relations with relatives.’”” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:4:92",
  "kind": "verse_list"
}