{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 93"
        },
        "path": "/books/al-kafi:3:4:93",
        "titles": {
          "ar": "باب صَلَاةِ الِاسْتِخَارَةِ",
          "en": "Chapter 93 – Salāt of Istikhara (Seeking Allahs<sup>zwj</sup>’s Choice)"
        }
      }
    ],
    "index": 760,
    "local_index": 93,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 94"
        },
        "path": "/books/al-kafi:3:4:94",
        "titles": {
          "ar": "باب الصَّلَاةِ فِي طَلَبِ الرِّزْقِ",
          "en": "Chapter 94 – The Salāt regarding seeking of the livelihood"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 92"
        },
        "path": "/books/al-kafi:3:4:92",
        "titles": {
          "ar": "باب صَلَاةِ فَاطِمَةَ ( عليها السلام ) وَ غَيْرِهَا مِنْ صَلَاةِ التَّرْغِيبِ",
          "en": "Chapter 92 – Salāt of Syeda Fatima<sup>asws</sup>, and others from the Salāt of exhortation"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:4:93",
    "titles": {
      "ar": "باب صَلَاةِ الِاسْتِخَارَةِ",
      "en": "Chapter 93 – Salāt of Istikhara (Seeking Allahs<sup>zwj</sup>’s Choice)"
    },
    "verse_count": 8,
    "verse_start_index": 5624,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/451)"
        ],
        "index": 5625,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:93:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنْ عَمْرِو بْنِ حُرَيْثٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) صَلِّ رَكْعَتَيْنِ وَ اسْتَخِرِ اللَّهَ فَوَ اللَّهِ مَا اسْتَخَارَ اللَّهَ مُسْلِمٌ إِلَّا خَارَ لَهُ الْبَتَّةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Ahmad Bin Muhammad, from Muhammad Bin Khalid, from Al-Nazar Bin Suweyd, from Yahya Al-Halby, from Amro Bin Hureys who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Pray a <span class=\"iTxt\">Salāt</span> of two Rak’at, and leave the choice to Allah<sup>azwj</sup>, so by Allah<sup>azwj</sup>, Allah<sup>azwj</sup> will not Choose for a Muslim except what is better for him, always’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Khalid from al-Nadr ibn al-Suwayd from Yahya al-Halabiy from ‘Amr ibn Hurayth who has said the following: “Abu ’Abd Allah, ‘Alayhi al-Salam, has said, ‘Perform two Rak‘at Salah (prayer) and ask Allah to chose for you what is good. By Allah, if a Muslim asks Allah to choose for him what is good, He certainly chooses for him as such.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/451)"
        ],
        "index": 5626,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:93:2",
        "refs": {
          "Mentions": [
            "/books/quran:112:1"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كَانَ عَلِيُّ بْنُ الْحُسَيْنِ ( صلوات الله عليه ) إِذَا هَمَّ بِأَمْرِ حَجٍّ أَوْ عُمْرَةٍ أَوْ بَيْعٍ أَوْ شِرَاءٍ أَوْ عِتْقٍ تَطَهَّرَ ثُمَّ صَلَّى رَكْعَتَيِ الِاسْتِخَارَةِ فَقَرَأَ فِيهِمَا بِسُورَةِ الْحَشْرِ وَ بِسُورَةِ الرَّحْمَنِ ثُمَّ يَقْرَأُ الْمُعَوِّذَتَيْنِ وَ قُلْ هُوَ اللَّهُ أَحَدٌ إِذَا فَرَغَ وَ هُوَ جَالِسٌ فِي دُبُرِ الرَّكْعَتَيْنِ ",
          "ثُمَّ يَقُولُ اللَّهُمَّ إِنْ كَانَ كَذَا وَ كَذَا خَيْراً لِي فِي دِينِي وَ دُنْيَايَ وَ عَاجِلِ أَمْرِي وَ آجِلِهِ فَصَلِّ عَلَى مُحَمَّدٍ وَ آلِهِ وَ يَسِّرْهُ لِي عَلَى أَحْسَنِ الْوُجُوهِ وَ أَجْمَلِهَا اللَّهُمَّ وَ إِنْ كَانَ كَذَا وَ كَذَا شَرّاً لِي فِي دِينِي وَ دُنْيَايَ وَ آخِرَتِي وَ عَاجِلِ أَمْرِي وَ آجِلِهِ فَصَلِّ عَلَى مُحَمَّدٍ وَ آلِهِ وَ اصْرِفْهُ عَنِّي رَبِّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِهِ وَ اعْزِمْ لِي عَلَى رُشْدِي وَ إِنْ كَرِهْتُ ذَلِكَ أَوْ أَبَتْهُ نَفْسِي ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Usman Bin Isa, from Amro Bin Shimr, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘It was so that whenever Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> thought of the matter of a Hajj, or an Umra, or selling, or buying, or emancipating (a slave), would clean himself<sup>asws</sup>, then pray two Rak’at of <span class=\"iTxt\">Salāt</span> of Al-<span class=\"iTxt\">Istikhara</span>. So he<sup>asws</sup> would recite in these two with Surah Al-Hashr (Chapter 59) and Surah Al-Rahmaan (Chapter 55). Then he<sup>asws</sup> recite the Mawazatayn (Chapter 113 & 114) and <span class=\"ibTxt\"><a href=\"/#/books/quran:112#h1\">[112:1]</a> Say He Allah is One</span> (Chapter 112) when he<sup>asws</sup> was free, and he<sup>asws</sup> was seated at the end of the two Rak’at.",
            "Then he<sup>asws</sup> was saying: ‘O Allah<sup>azwj</sup>! If it was so that such and such was better for me<sup>asws</sup> in my<sup>asws</sup> Religion, and my<sup>asws</sup> world, and the immediacy of my<sup>asws</sup> matters and it’s later, so Send Blessings upon Muhammad<sup>asws</sup> and his<sup>saww</sup> Progeny<sup>asws</sup>, Make it easy for me to be upon the best of its aspects and its beauties. And if it was so that it was evil for me<sup>asws</sup>, in my<sup>asws</sup> Religion, and my<sup>asws</sup> world, and my<sup>asws</sup> Hereafter, and the immediacy of my matter and its later, so Send Blessings upon Muhammad<sup>saww</sup> and his<sup>saww</sup> Progeny<sup>asws</sup>, and Exchange it from me<sup>asws</sup>. Lord<sup>azwj</sup>! Send Blessings upon Muhammad<sup>saww</sup> and his<sup>saww</sup> Progeny<sup>asws</sup> and Cause me<sup>asws</sup> to be determined upon my<sup>asws</sup> rightful Guidance, and even if I<sup>asws</sup> were to dislike that, or if my<sup>asws</sup> self refuses’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ‘Uthman ibn ‘Isa from ‘Amr ibn Shimr from Jabir who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘Whenever Ali ibn al-Husayn, ‘Alayhi al-Salam, would think of performing Hajj, ‘Umrah or buying, selling or setting free a slave, he would first cleanse himself (take Wudu’ or bath), then perform two Rak‘at Salah (prayer) for Istikharah in which he read chapters 55 and 59. After completing Salah (prayer) he would read chapters 113, 114 and 112 while still in a sitting position. He then say, ‘O Lord, if such and such thing is good for me in this world and for my religion, immediately or later, Allahumma Salli ‘Ala Muhammad wa ‘Ali Muhammad, (O Allah grant Muhammad and his family a compensation worthy of their serving Your cause), please make it easy for me in the best manner and make it come beautiful. O Lord, if such and such thing is bad for my religion and my worldly matters immediately or later, Allahumma Salli ‘Ala Muhammad wa ‘Ali Muhammad, (O Allah grant Muhammad and his family a compensation worthy of their serving Your cause), please keep it away from me. O Lord, Allahumma Salli ‘Ala Muhammad wa ‘Ali Muhammad, (O Allah grant Muhammad and his family a compensation worthy of their serving your cause), please grant me determination with guidance even if I dislike it and my soul refuses.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/452)"
        ],
        "index": 5627,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:93:3",
        "text": [
          "غَيْرُ وَاحِدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَصْرِيِّ عَنِ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ الْهَاشِمِيِّ عَنْ هَارُونَ بْنِ خَارِجَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا أَرَدْتَ أَمْراً فَخُذْ سِتَّ رِقَاعٍ فَاكْتُبْ فِي ثَلَاثٍ مِنْهَا بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ خِيَرَةً مِنْ اللَّهِ الْعَزِيزِ الْحَكِيمِ لِفُلَانِ بْنِ فُلَانَةَ افْعَلْهُ وَ فِي ثَلَاثٍ مِنْهَا بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ خِيَرَةً مِنَ اللَّهِ الْعَزِيزِ الْحَكِيمِ لِفُلَانِ بْنِ فُلَانَةَ لَا تَفْعَلْ ",
          "ثُمَّ ضَعْهَا تَحْتَ مُصَلَّاكَ ثُمَّ صَلِّ رَكْعَتَيْنِ فَإِذَا فَرَغْتَ فَاسْجُدْ سَجْدَةً وَ قُلْ فِيهَا مِائَةَ مَرَّةٍ أَسْتَخِيرُ اللَّهَ بِرَحْمَتِهِ خِيَرَةً فِي عَافِيَةٍ ثُمَّ اسْتَوِ جَالِساً وَ قُلِ اللَّهُمَّ خِرْ لِي وَ اخْتَرْ لِي فِي جَمِيعِ أُمُورِي فِي يُسْرٍ مِنْكَ وَ عَافِيَةٍ ",
          "ثُمَّ اضْرِبْ بِيَدِكَ إِلَى الرِّقَاعِ فَشَوِّشْهَا وَ أَخْرِجْ وَاحِدَةً فَإِنْ خَرَجَ ثَلَاثٌ مُتَوَالِيَاتٌ افْعَلْ فَافْعَلِ الْأَمْرَ الَّذِي تُرِيدُهُ وَ إِنْ خَرَجَ ثَلَاثٌ مُتَوَالِيَاتٌ لَا تَفْعَلْ فَلَا تَفْعَلْهُ وَ إِنْ خَرَجَتْ وَاحِدَةٌ افْعَلْ وَ الْأُخْرَى لَا تَفْعَلْ فَأَخْرِجْ مِنَ الرِّقَاعِ إِلَى خَمْسٍ فَانْظُرْ أَكْثَرَهَا فَاعْمَلْ بِهِ وَ دَعِ السَّادِسَةَ لَا تَحْتَاجُ إِلَيْهَا."
        ],
        "translations": {
          "en.hubeali": [
            "Someone else, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Al-Basry, from Al-Qasim Bin Abdul Rahman Al-Hashimy, from Haroun Bin Kharjat, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whenever you intend a matter, so take six papers and write in three of them ‘In the Name of Allah<sup>azwj</sup> the Beneficent, the Merciful. Goodness is from Allah<sup>azwj</sup> the Mighty, the Wise, for so and so. Do it’; and in three of them (write), ‘In the Name of Allah<sup>azwj</sup> the Beneficent, the Merciful. Goodness is from Allah<sup>azwj</sup> the Mighty, the Wise, for so and so. Do not do ‘. ",
            "Then place these beneath your prayer mat, then pray two Rak’at of <span class=\"iTxt\">Salāt</span>. So when you are free, perform a <span class=\"iTxt\">Sajdah</span>, and say one hundred times, ‘I leave the choice to Allah<sup>azwj</sup> to Choose by His<sup>azwj</sup> Mercy, good in safety’. Then sit straight and say, ‘O Allah<sup>azwj</sup>! Pick for me and Choose for me in the entirety of my affairs in ease from You<sup>azwj</sup> and safety’.",
            "Then strike with your hand to the papers, and jumble them up, and extract one. So if the ‘do it’ comes up three times consecutively, so do the matter which you intended to; and if ‘don’t do’ comes up three times consecutively, so do not do it; and if one ‘do it’ comes up and the other two are ‘don’t do’, then extract from the papers up to five, and look at the majority of it and act upon it, and leave the sixth, as you are not needy to it’."
          ],
          "en.sarwar": [
            "3. More than one person has narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad al-Basriy from al-Qasim ibn ‘Abd al-Rahman al-Hashimiy from Harun ibn Kharijah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that when you think of doing something, take six pieces of paper and write on three of them, ‘In the name of Allah, the Beneficent, the Merciful. It is to ask from Allah, the Majestic, the Wise, what is good for so and so son of so and so, “do it.’” On the other, three write, ‘In the name of Allah, the Beneficent, the Merciful. It is to ask from Allah, the Majestic, the Wise, what is good for so and so son of so and so, “do not do it.’” Keep them under your prayer rug and perform two Rak‘at Salah (prayer). After completing Salah (prayer), make a sajdah and say one hundred times, ‘I ask Allah, through His mercy, to choose what is good and safe.’ Then sit straight and say, ‘O Lord, pick and choose for me in all matters with ease and safety.’ Then mix the pieces and take out one. If three times, consecutively it comes ‘do it’, then you may do what you wanted to do. If three times consecutively it comes ‘do not do it,’ then do not do what you wanted to do. If one comes ‘do it’ and the other comes ‘do not do it’ continue taking out up to five pieces, then see which side is more then follow the side which is more and ignore the sixth piece.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/452)"
        ],
        "index": 5628,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:93:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ قَالَ سَأَلَ الْحَسَنُ بْنُ الْجَهْمِ أَبَا الْحَسَنِ ( عليه السلام ) لِابْنِ أَسْبَاطٍ فَقَالَ مَا تَرَى لَهُ وَ ابْنُ أَسْبَاطٍ حَاضِرٌ وَ نَحْنُ جَمِيعاً يَرْكَبُ الْبَرَّ أَوِ الْبَحْرَ إِلَى مِصْرَ فَأَخْبَرَهُ بِخَيْرِ طَرِيقِ الْبَرِّ فَقَالَ الْبَرُّ وَ ائْتِ الْمَسْجِدَ فِي غَيْرِ وَقْتِ صَلَاةِ الْفَرِيضَةِ فَصَلِّ رَكْعَتَيْنِ وَ اسْتَخِرِ اللَّهَ مِائَةَ مَرَّةٍ ثُمَّ انْظُرْ أَيُّ شَيْ‏ءٍ يَقَعُ فِي قَلْبِكَ فَاعْمَلْ بِهِ ",
          "وَ قَالَ لَهُ الْحَسَنُ الْبَرُّ أَحَبُّ إِلَيَّ لَهُ قَالَ وَ إِلَيَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal who said, ",
            "‘Al-Hassan Bin Al-Jahm asked Abu Al-Hassan<sup>asws</sup> for Ibn Asbaat, so he said, ‘What is your<sup>asws</sup> view for him’, and Ibn Asbaat was present with all of us, ‘if he were to ride the land or (sail) the sea to Egypt, so inform him with the best road by land’. So he<sup>asws</sup> said: ‘The land, and go over to the Masjid (of Rasool-Allah<sup>saww</sup>) in other than a time for the Obligatory <span class=\"iTxt\">Salāt</span>. So you should pray two Rak’at of <span class=\"iTxt\">Salāt</span> and leave the choice to Allah<sup>azwj</sup>, one hundred times, then look at which thing occurs in your heart, so act upon it’.",
            "And he<sup>asws</sup> said to him: ‘And the superiority of the land is more beloved to me<sup>asws</sup>, for him’. He said, ‘And to me’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal who has said the following: “Al-Hassan ibn Jahm asked abu al-Hassan, ‘Alayhi al-Salam, for ibn Asbat; ibn Asbat and we all were present. ‘Should he travel by land or by sea to Egypt? Please tell him about the best road by land.’ The Imam said, ‘By land, but go to the Masjid in a time other than that for obligatory Salah (prayer). Perform two Rak‘at Salah (prayer) and ask Allah, one hundred times, to choose for you the best. Then see what comes in your mind, then act accordingly.’ Al-Hassan then said, ‘By land is what I like for him.’ The Imam said, ‘I also like for him by land.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/452)"
        ],
        "index": 5629,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:93:5",
        "refs": {
          "Mentions": [
            "/books/quran:11:41",
            "/books/quran:2:248",
            "/books/quran:43:14",
            "/books/quran:43:13"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَسْبَاطٍ وَ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُوسَى بْنِ الْقَاسِمِ الْبَجَلِيِّ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ قَالَ قُلْتُ لِأَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) جُعِلْتُ فِدَاكَ مَا تَرَى آخُذُ بَرّاً أَوْ بَحْراً فَإِنَّ طَرِيقَنَا مَخُوفٌ شَدِيدُ الْخَطَرِ فَقَالَ اخْرُجْ بَرّاً وَ لَا عَلَيْكَ أَنْ تَأْتِيَ مَسْجِدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ تُصَلِّيَ رَكْعَتَيْنِ فِي غَيْرِ وَقْتِ فَرِيضَةٍ ثُمَّ لَتَسْتَخِيرُ اللَّهَ مِائَةَ مَرَّةٍ وَ مَرَّةً ثُمَّ تَنْظُرُ ",
          "فَإِنْ عَزَمَ اللَّهُ لَكَ عَلَى الْبَحْرِ فَقُلِ الَّذِي قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ قالَ ارْكَبُوا فِيها بِسْمِ اللَّهِ مَجْراها وَ مُرْساها إِنَّ رَبِّي لَغَفُورٌ رَحِيمٌ فَإِنِ اضْطَرَبَ بِكَ الْبَحْرُ فَاتَّكِ عَلَى جَانِبِكَ الْأَيْمَنِ وَ قُلْ بِسْمِ اللَّهِ اسْكُنْ بِسَكِينَةِ اللَّهِ و قِرْ بِوَقَارِ اللَّهِ وَ اهْدَأْ بِإِذْنِ اللَّهِ وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ ",
          "قُلْنَا أَصْلَحَكَ اللَّهُ مَا السَّكِينَةُ رِيحٌ تَخْرُجُ مِنَ الْجَنَّةِ لَهَا صُورَةٌ كَصُورَةِ الْإِنْسَانِ وَ رَائِحَةٌ طَيِّبَةٌ وَ هِيَ الَّتِي نَزَلَتْ عَلَى إِبْرَاهِيمَ فَأَقْبَلَتْ تَدُورُ حَوْلَ أَرْكَانِ الْبَيْتِ وَ هُوَ يَضَعُ الْأَسَاطِينَ ",
          "قِيلَ لَهُ هِيَ مِنَ الَّتِي قَالَ اللَّهُ عَزَّ وَ جَلَّ فِيهِ سَكِينَةٌ مِنْ رَبِّكُمْ وَ بَقِيَّةٌ مِمَّا تَرَكَ آلُ مُوسى وَ آلُ هارُونَ قَالَ تِلْكَ السَّكِينَةُ فِي التَّابُوتِ وَ كَانَتْ فِيهِ طَشْتٌ تُغْسَلُ فِيهَا قُلُوبُ الْأَنْبِيَاءِ وَ كَانَ التَّابُوتُ يَدُورُ فِي بَنِي إِسْرَائِيلَ مَعَ الْأَنْبِيَاءِ ثُمَّ أَقْبَلَ عَلَيْنَا",
          "فَقَالَ مَا تَابُوتُكُمْ قُلْنَا السِّلَاحُ قَالَ صَدَقْتُمْ هُوَ تَابُوتُكُمْ وَ إِنْ خَرَجْتَ بَرّاً فَقُلِ الَّذِي قَالَ اللَّهُ عَزَّ وَ جَلَّ سُبْحانَ الَّذِي سَخَّرَ لَنا هذا وَ ما كُنَّا لَهُ مُقْرِنِينَ. وَ إِنَّا إِلى رَبِّنا لَمُنْقَلِبُونَ فَإِنَّهُ لَيْسَ مِنْ عَبْدٍ يَقُولُهَا عِنْدَ رُكُوبِهِ فَيَقَعَ مِنْ بَعِيرٍ أَوْ دَابَّةٍ فَيُصِيبَهُ شَيْ‏ءٌ بِإِذْنِ اللَّهِ ",
          "ثُمَّ قَالَ فَإِذَا خَرَجْتَ مِنْ مَنْزِلِكَ فَقُلْ بِسْمِ اللَّهِ آمَنْتُ بِاللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ فَإِنَّ الْمَلَائِكَةَ تَضْرِبُ وُجُوهَ الشَّيَاطِينِ وَ يَقُولُونَ قَدْ سَمَّى اللَّهَ وَ آمَنَ بِاللَّهِ وَ تَوَكَّلَ عَلَى اللَّهِ وَ قَالَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Asbaat and Muhammad Bin Ahmad, from Musa Bin Al-Qasim Al-Bajaly, from Ali Bin Asbaat who said, ",
            "‘I said to Abu Abu Al-Hassan Al-Reza<sup>asws</sup>, ‘What is your<sup>asws</sup> view of taking the road or the sea, for our ways are frightening with intense danger. So he<sup>asws</sup> said: ‘Go out by land and it is upon you that you go over to the Masjid of Rasool-Allah<sup>saww</sup> and pray two Rak’at of <span class=\"iTxt\">Salāt</span> therein in a time other than of an Obligatory <span class=\"iTxt\">Salāt</span>. Then you should seek Allah<sup>azwj</sup>’s Choice one hundred and one times, then wait. ",
            "So if Allah<sup>azwj</sup> has Determined for you (to travel) upon the sea, so say <span class=\"ibTxt\"><a href=\"/#/books/quran:11#h41\">[11:41]</a> And he said: Embark in it, in the Name of Allah be its sailing and its anchoring; surely my Lord is Forgiving, Merciful</span>. So if the sea is restless with you, so lean upon your right side and say, ‘In the Name of Allah<sup>azwj</sup>, Settle with the Tranquillity of Allah<sup>azwj</sup>, and be dignified with the Dignity of Allah<sup>azwj</sup>, and calm down by the Permission of Allah<sup>azwj</sup>. And there is neither a Might nor Strength except with Allah<sup>azwj</sup>’. ",
            "We said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! What is the tranquillity?’ (He<sup>asws</sup> said): ‘It is a wind which comes out from the Paradise. For it is an image like an image of the human being, and an aromatic fragrance, and it is which descended upon Ibrahim<sup>as</sup>. So it came circling around the corners of the House (Kabah), while he<sup>as</sup> was placing the foundations’. ",
            "It was said to him<sup>asws</sup>, ‘Is it from that which Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h248\">[2:248]</a> in which there is tranquillity from your Lord and remnants of what the children of Musa and the children of Haroun have left</span>?’ He<sup>asws</sup> said: ‘That is the tranquillity in the box, and therein was a tray in which the heart of the Prophets<sup>as</sup> had been washed, and the box was going around (in turns) among the Children of Israel with the Prophets<sup>as</sup>. Then it came to us<sup>asws</sup>’. ",
            "So he<sup>asws</sup> said: ‘So what are your boxes?’ We said, ‘The weapons’. He<sup>asws</sup> said: ‘You speak the truth. These are your boxes, and if you were to go out in the land, so say that which Allah<sup>azwj</sup> Mighty and Majestic has Said: “<span class=\"ibTxt\"><a href=\"/#/books/quran:43#h13\">[43:13]</a> Glory be to Him Who Made this subservient to us and we were not able to do it <a href=\"/#/books/quran:43#h14\">[43:14]</a> And surely to our Lord we must return</span>”, for there is none from a servant who says it during his embarkation, so he would fall from a camel or an animal, so anything would hit him by the Permission of Allah<sup>azwj</sup>.",
            "Then he<sup>asws</sup> said: ‘So when you go out from your house, so say, ‘In the Name of Allah<sup>azwj</sup>. I believe in Allah<sup>azwj</sup>. I rely upon Allah<sup>azwj</sup>. There is neither a Might or Strength except with Allah<sup>azwj</sup>’, so the Angels would strike the faces of the devils and they would be saying: ‘He has Named Allah<sup>azwj</sup>, and believed in Allah<sup>azwj</sup>, and relied upon Allah<sup>azwj</sup>, and said ‘There is neither a Mighty nor Strength except with Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ibn Asbat and Muhammad ibn Ahmad from Musa ibn al-Qasim af-Bajafiy from Afi ibn Asbat who has said the following: “I said to abu al-Hassan al-Rida, ‘Alayhi al-Salam, ‘I pray to Allah to keep my soul in service for your cause. Do you advise if I travel by land or by sea? Our road is very dangerous and frightening.’ The Imam said, ‘Travel by land but there is no offense, if you go to the Masjid of the Messenger of Allah; perform two Rak‘at Salah (prayer) in a time other than that for obligatory Salah (prayer). Thereafter ask Allah, one hundred times, to choose for you the best, then see what comes in your mind. If Allah has decided for you by sea, then say the words of Allah, the Most Majestic, the Most Glorious, “He said, ‘Go onboard in the name of Allah who sets it afloat and anchors it down. My Lord is forgiving and merciful’” <a href=\"/#/books/quran:11#h41\">[11:41]</a>. If you find the sea turbulent then lean on your right side and say, “In the name of Allah, calm down with the serenity of Allah, rest by the dignity of Allah and quiet down by the permission of Allah. There is no means and power without help from Allah.’” “We then asked him, ‘What is al-Sakinah (serenity)?’ The Imam said, ‘It is a wind that comes out of paradise and has a face like the face of man and it has a fine fragrance. It is this wind that descended down to Ibrahim (Abraham) and circled around al-Bayt (Ka’bah) when he was placing the pillars.’ It was asked: ‘Is it of that which Allah, the Most Majestic, the most Glorious, speaks, “In it there is Sakinah from your Lord, and remainder of that which people of Moses left and so did people of Harun (Aaron) ’”(2: 246). The Imam said, ‘That al-Sakinah was in the Ark (chest) in which there was a tray wherein the hearts of prophets had been washed. And the Ark circled among the children of Israel with the prophets and then it came to us.’ He asked, ‘What is your Ark?’ We said, ‘It is the armaments.’ He then said, ‘You are right. That is your Ark.’ The Imam said, ‘If you travel by land, then say what Allah, the Most Majestic, the Most Glorious, has said, “Free of all defects is the One who has made it subservient to us, otherwise, we could not reach it (our destination). To our Lord we all return.” (42:13-14) If any servant (of Allah) says it during his riding he will not, by the permission of Allah, fall off his camel or horse or get hurt.’ He then said, ‘When you come out of your home say, “In the name of Allah, I believe in Allah, I assign Allah as my attorney, there is no means and power without the help of Allah.” The angels strike the face of Satans and say to them, ‘He has spoken the name of Allah, believed in Allah and has assigned Allah as his attorney and has said, “There is no means and power without the help of Allah.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/454)"
        ],
        "index": 5630,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:93:6",
        "refs": {
          "Mentions": [
            "/books/quran:109:1",
            "/books/quran:112:1"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ مُرَازِمٍ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا أَرَادَ أَحَدُكُمْ شَيْئاً فَلْيُصَلِّ رَكْعَتَيْنِ ثُمَّ لْيَحْمَدِ اللَّهَ وَ لْيُثْنِ عَلَيْهِ وَ لْيُصَلِّ عَلَى مُحَمَّدٍ وَ أَهْلِ بَيْتِهِ وَ يَقُولُ اللَّهُمَّ إِنْ كَانَ هَذَا الْأَمْرُ خَيْراً لِي فِي دِينِي وَ دُنْيَايَ فَيَسِّرْهُ لِي وَ اقْدِرْهُ وَ إِنْ كَانَ غَيْرَ ذَلِكَ فَاصْرِفْهُ عَنِّي ",
          "فَسَأَلْتُهُ أَيَّ شَيْ‏ءٍ أَقْرَأُ فِيهِمَا فَقَالَ اقْرَأْ فِيهِمَا مَا شِئْتَ وَ إِنْ شِئْتَ قَرَأْتَ فِيهِمَا قُلْ هُوَ اللَّهُ أَحَدٌ وَ قُلْ يَا أَيُّهَا الْكَافِرُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Hadeed, from Murazam who said, ",
            "‘Abu Abdullah<sup>asws</sup> said to me: ‘Whenever one of you intends something, so let him pray two Rak’at of <span class=\"iTxt\">Salāt</span>, then let him Praise Allah<sup>azwj</sup> and let him Laud upon Him<sup>azwj</sup>, and let him send Blessings upon Muhammad<sup>saww</sup> and the People<sup>asws</sup> of his<sup>saww</sup> Household, and he should be saying, ‘O Allah<sup>azwj</sup>! If this matter was good for me in my Religion, and my world, so Make it easier for me; and if it was other than that, so Exchange it from me’. ",
            "So I asked him<sup>asws</sup>, ‘Which thing should I recite in these two?’ So he<sup>asws</sup> said: ‘Recite in these two whatever you so desire to, and if you so desire to, recite in these two <span class=\"ibTxt\"><a href=\"/#/books/quran:112#h1\">[112:1]</a> Say He Allah is One</span> (Chapter 112) and <span class=\"ibTxt\"><a href=\"/#/books/quran:109#h1\">[109:1]</a> Say: O you unbelievers!</span> Chapter 109)’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn Hadid from Murazim who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, said to me, ‘If one of you may think of doing something, he should perform two Rak‘at Salah (prayer), then praise Allah, speak of His greatness and say, “Allahumma Salli ‘Ala Muhammad wa ‘Ali Muhammad (O Allah grant Muhammad and his family a compensation worthy of their serving Your cause).” Thereafter say, “O Lord, if this matter is good for my religion and worldly matters, please make it possible for me with ease; and if it is otherwise, keep it away from me.’” I then asked, ‘What should I read in the two Rak‘at Salah (prayer)?’ The Imam replied, ‘You may read whatever you like. You can read Chapter 112 or 109.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/454)"
        ],
        "index": 5631,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:93:7",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ عَمْرِو بْنِ إِبْرَاهِيمَ عَنْ خَلَفِ بْنِ حَمَّادٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ رُبَّمَا أَرَدْتُ الْأَمْرَ يَفْرُقُ مِنِّي فَرِيقَانِ أَحَدُهُمَا يَأْمُرُنِي وَ الْآخَرُ يَنْهَانِي قَالَ فَقَالَ إِذَا كُنْتَ كَذَلِكَ فَصَلِّ رَكْعَتَيْنِ وَ اسْتَخِرِ اللَّهَ مِائَةَ مَرَّةٍ وَ مَرَّةً ثُمَّ انْظُرْ أَحْزَمَ الْأَمْرَيْنِ لَكَ فَافْعَلْهُ فَإِنَّ الْخِيَرَةَ فِيهِ إِنْ شَاءَ اللَّهُ وَ لْتَكُنِ اسْتِخَارَتُكَ فِي عَافِيَةٍ فَإِنَّهُ رُبَّمَا خِيرَ لِلرَّجُلِ فِي قَطْعِ يَدِهِ وَ مَوْتِ وَلَدِهِ وَ ذَهَابِ مَالِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Muhammad Bin Isa, from Amro Bin Ibrahim, from Khalaf Bin Hammad, from Is’haq Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘Sometimes I intend the matter, so there separate for me two views, one of the two instructs me and the other one forbids me’. So he<sup>asws</sup> said: ‘Whenever you are like that, so pray two Rak’at of <span class=\"iTxt\">Salāt</span>, and seek the Choice of Allah<sup>azwj</sup> one hundred and one times, then look at the most determined of the two matters for you, so do it, and the goodness would be in it, Allah<sup>azwj</sup> Willing and your <span class=\"iTxt\">Istikhara</span> would be in safety, for sometimes there is goodness for the man in the cutting-off of his hand, and a death of his child, and the loosing of his wealth’."
          ],
          "en.sarwar": [
            "7. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Muhammad ibn ‘Isa from ‘Amr ibn Ibrahim from Khalaf ibn Hammad from Ishaq ibn ‘Ammar who has said the following: “I said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘Sometimes I may get two different opinions: one for and the other against what I think to do, what then I should do?’ The Imam said, ‘If such is the case, then perform two Rak‘at Salah (prayer) and ask Allah, one hundred and one times, to choose for you what is best. Thereafter choose the matter for which your determination is stronger; the choice is for it, by the will of Allah. Your choice should be based on what is safe; sometimes it is better for a man to see his hand cut off, or his son die or his property gone.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/454)"
        ],
        "index": 5632,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:93:8",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ رَفَعَهُ عَنْهُمْ ( عليهم السلام ) أَنَّهُ قَالَ لِبَعْضِ أَصْحَابِهِ وَ قَدْ سَأَلَهُ عَنِ الْأَمْرِ يَمْضِي فِيهِ وَ لَا يَجِدُ أَحَداً يُشَاوِرُهُ فَكَيْفَ يَصْنَعُ قَالَ شَاوِرْ رَبَّكَ قَالَ فَقَالَ لَهُ كَيْفَ ",
          "قَالَ لَهُ انْوِ الْحَاجَةَ فِي نَفْسِكَ ثُمَّ اكْتُبْ رُقْعَتَيْنِ فِي وَاحِدَةٍ لَا وَ فِي وَاحِدَةٍ نَعَمْ وَ اجْعَلْهُمَا فِي بُنْدُقَتَيْنِ مِنْ طِينٍ ثُمَّ صَلِّ رَكْعَتَيْنِ وَ اجْعَلْهُمَا تَحْتَ ذَيْلِكَ وَ قُلْ يَا اللَّهُ إِنِّي أُشَاوِرُكَ فِي أَمْرِي هَذَا وَ أَنْتَ خَيْرُ مُسْتَشَارٍ وَ مُشِيرٍ فَأَشِرْ عَلَيَّ بِمَا فِيهِ صَلَاحٌ وَ حُسْنُ عَاقِبَةٍ ثُمَّ أَدْخِلْ يَدَكَ فَإِنْ كَانَ فِيهَا نَعَمْ فَافْعَلْ وَ إِنْ كَانَ فِيهَا لَا لَا تَفْعَلْ هَكَذَا شَاوِرْ رَبَّكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, ",
            "(It has been narrated) raising it, from them<sup>asws</sup> that he<sup>asws</sup> said to one of his<sup>asws</sup> companions, and he had asked him<sup>asws</sup> about the matter to continue in it, and he could not find anyone to consult, so how should he be dealing with it?’ He<sup>asws</sup> said: ‘Consult your Lord<sup>azwj</sup>’. So he said to him<sup>asws</sup>, ‘How?’ ",
            "He<sup>asws</sup> said to him: ‘Intend the need within yourself, then write out two pieces of paper, in one, ‘No’, and in one, ‘Yes’, and make these two to be inside two balls of clay, then pray two Rak’at of <span class=\"iTxt\">Salāt</span>, and make these two to be behind you, and say, ‘O Allah<sup>azwj</sup>! I hereby consult You<sup>azwj</sup> in this matter of mine, and You<sup>azwj</sup> are the best of the consultants and advisers, therefore advise me with what is correct for me in it and the best safety’. Then insert your hand, so if it was ‘Yes’, so do it, and it is was ‘No’, do not do it. This is how you consult your Lord<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "8. Ali ibn Muhammad has narrated in a marfu’ manner from one of ’A’immah who has said the following: “The Imam, ‘Alayhi al-Salam, said to one of his companions who had asked about an issue that he wanted to do but did not find any one to consult with. The Imam said, ‘Consult your Lord.’ He then asked, ‘How should I do so?’ The Imam replied, ‘Keep in your mind what you wish to do, then write two pieces of paper, “yes” on one and “no” on the other. Place them inside two balls of clay, perform two Rak‘at Salah (prayer) and place them under your furnishing and say, “O Allah, I consult You in this matter and You are the best consultant and advisor. Grant me a sign about that which is beneficial and is of good consequences,” then take out one of the papers; if it is “yes”, then do what you wanted and if it is “no” then do not do it. This is how you consult your Lord.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:4:93",
  "kind": "verse_list"
}