{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 94"
        },
        "path": "/books/al-kafi:3:4:94",
        "titles": {
          "ar": "باب الصَّلَاةِ فِي طَلَبِ الرِّزْقِ",
          "en": "Chapter 94 – The Salāt regarding seeking of the livelihood"
        }
      }
    ],
    "index": 761,
    "local_index": 94,
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:4:94",
    "titles": {
      "ar": "باب الصَّلَاةِ فِي طَلَبِ الرِّزْقِ",
      "en": "Chapter 94 – The Salāt regarding seeking of the livelihood"
    },
    "verse_count": 7,
    "verse_start_index": 5632,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/455)"
        ],
        "index": 5633,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:94:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ إِسْمَاعِيلَ</span> عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ ابْنِ مُسْكَانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ الْحَلَبِيِّ قَالَ شَكَا رَجُلٌ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) الْفَاقَةَ وَ الْحُرْفَةَ فِي التِّجَارَةِ بَعْدَ يَسَارٍ قَدْ كَانَ فِيهِ مَا يَتَوَجَّهُ فِي حَاجَةٍ إِلَّا ضَاقَتْ عَلَيْهِ الْمَعِيشَةُ فَأَمَرَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَنْ يَأْتِيَ مَقَامَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) بَيْنَ الْقَبْرِ وَ الْمِنْبَرِ فَيُصَلِّيَ رَكْعَتَيْنِ وَ يَقُولَ مِائَةَ مَرَّةٍ اللَّهُمَّ إِنِّي أَسْأَلُكَ بِقُوَّتِكَ وَ قُدْرَتِكَ وَ بِعِزَّتِكَ وَ مَا أَحَاطَ بِهِ عِلْمُكَ أَنْ تُيَسِّرَ لِي مِنَ التِّجَارَةِ أَوْسَعَهَا رِزْقاً وَ أَعَمَّهَا فَضْلًا وَ خَيْرَهَا عَاقِبَةً ",
          "قَالَ الرَّجُلُ فَفَعَلْتُ مَا أَمَرَنِي بِهِ فَمَا تَوَجَّهْتُ بَعْدَ ذَلِكَ فِي وَجْهٍ إِلَّا رَزَقَنِيَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al-Fazl Bin Sh<span class=\"iTxt\">Azaan </span>, from Safwan Bin Yahya, from Ibn Muskan, from Muhammad Bin Ali Al-Halby who said, ",
            "‘A man complained to Abu Abdullah<sup>asws</sup> of the poverty and the difficulties in the trading after affluence, and it had been so that he had not diverted anywhere for his needs except that the livelihood was constrained upon him. So Abu Abdullah<sup>asws</sup> ordered him that he should go to the place of Rasool-Allah<sup>saww</sup>, between the grave and the Pulpit, so he should pray two Rak’at of <span class=\"iTxt\">Salāt</span> and he should be saying one hundred times, ‘O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> by Your<sup>azwj</sup> Power and by Your<sup>azwj</sup> Honour, and whatever Your<sup>azwj</sup> Knowledge encompasses, that You<sup>saww</sup> should Facilitate to me from the trading Expanding the livelihood, and Grace, and of its best consequence’. ",
            "The man said, ‘So I did what I had been ordered with, so I did not divert myself after that in a direction except that Allah<sup>azwj</sup> Graced me’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya from ibn Muskan from Muhammad ibn Ali al-Halabiy who has said the following: “A man complained before abu ’Abd Allah, ‘Alayhi al-Salam, against his poverty and deprivation in business after being affluent and that in whatever way he moves to make a living, he faces difficulties. Abu ‘Abd Allah, ‘Alayhi al-Salam, commanded him to go to the special place of the Messenger of Allah which is between his grave and pulpit. ‘Perform two Rak‘at Salah (prayer) there and say, one hundred times, ‘O Lord, I appeal to You through Your power, Your determination, Your majesty and through whatever Your knowledge has encompassed, please facilitate my business and increase it for my sustenance in a way that is better and of good consequences.’ The man has said that thereafter in whichever way I moved for business Allah granted me benefits.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/455)"
        ],
        "index": 5634,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:94:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَحْمَدَ بْنِ أَبِي دَاوُدَ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي ذُو عِيَالٍ وَ عَلَيَّ دَيْنٌ وَ قَدِ اشْتَدَّتْ حَالِي فَعَلِّمْنِي دُعَاءً إِذَا دَعَوْتُ بِهِ رَزَقَنِيَ اللَّهُ مَا أَقْضِي بِهِ دَيْنِي وَ أَسْتَعِينُ بِهِ عَلَى عِيَالِي ",
          "فَقَالَ يَا عَبْدَ اللَّهِ تَوَضَّأْ وَ أَسْبِغْ وُضُوءَكَ ثُمَّ صَلِّ رَكْعَتَيْنِ تُتِمُّ الرُّكُوعَ وَ السُّجُودَ فِيهِمَا ثُمَّ قُلْ يَا مَاجِدُ يَا وَاحِدُ يَا كَرِيمُ أَتَوَجَّهُ إِلَيْكَ بِمُحَمَّدٍ نَبِيِّكَ نَبِيِّ الرَّحْمَةِ يَا مُحَمَّدُ يَا رَسُولَ اللَّهِ إِنِّي أَتَوَجَّهُ بِكَ إِلَى اللَّهِ رَبِّكَ وَ رَبِّ كُلِّ شَيْ‏ءٍ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَ عَلَى أَهْلِ بَيْتِهِ وَ أَسْأَلُكَ نَفْحَةً مِنْ نَفَحَاتِكَ وَ فَتْحاً يَسِيراً وَ رِزْقاً وَاسِعاً أَلُمُّ بِهِ شَعْثِي وَ أَقْضِي بِهِ دَيْنِي وَ أَسْتَعِينُ بِهِ عَلَى عِيَالِ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ahmad Bin Abu Dawood, from Abu Hamza, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘A man came over to the Prophet<sup>saww</sup> and he said, ‘O Rasool-Allah<sup>saww</sup>! I am with dependants, and upon me are debts, and my state has become difficult, so teach me a supplication when I supplicate with it, Allah<sup>azwj</sup> would Grace me what I can payback my debts with, and assist my dependants with it’. ",
            "So he<sup>saww</sup> said: ‘O servant of Allah<sup>saww</sup>! Perform the <span class=\"iTxt\">Wuzu</span> and the extensive <span class=\"iTxt\">Wuzu</span>, then pray two Rak’at of <span class=\"iTxt\">Salāt</span>, completing the <span class=\"iTxt\">Rukū</span> and the <span class=\"iTxt\">Sajdah</span> in them, then say, ‘O Glorious! O One! O Benevolent! I diver to You<sup>azwj</sup> by Muhammad<sup>saww</sup> Your<sup>azwj</sup> Prophet<sup>saww</sup>, a Prophet<sup>saww</sup> of the Mercy! O Muhammad<sup>saww</sup>! O Rasool-Allah<sup>saww</sup>! I divert by you<sup>saww</sup> to Allah<sup>azwj</sup>, your<sup>saww</sup> Lord<sup>azwj</sup>, and the Lord<sup>azwj</sup> of everything, that You<sup>azwj</sup> should Send Blessings upon Muhammad<sup>saww</sup> and upon the People<sup>asws</sup> of his<sup>saww</sup> Household, and I ask You<sup>azwj</sup> for a gift from Your<sup>azwj</sup> gifts, and easy openings, and extensive livelihood I can gather my affairs with, and fulfil my debts with, and assist my dependants with’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from Ahmad ibn abu Dawud from abu Hamzah who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said that a man came to the Holy Prophet and said, ‘O Messenger of Allah, I am a man with (a large) family, indebted; and my condition has become difficult. Please teach me a prayer through which Allah will provide me enough to pay my debts and help my family.’ The Messenger of Allah said, ‘Take Wudu’ properly, then perform two Rak‘at Salah (prayer) with complete Ruku‘ and sajdah in both Rak‘at. Thereafter say, “O owner of glory, O the only One, O gracious, I turn to You through Muhammad, Your prophet, the prophet of mercy. O Muhammad, O Messenger of Allah, I have turned through you to Allah, your Lord and the Lord of all things. Allahumma Salli ‘Ala Muhammad wa ‘Ali Muhammad (O Allah grant Muhammad and his family a compensation worthy of their serving Your cause). I appeal to You for relief from that with which You grant relief, an easy success and vast sustenance with which I can overcome my difficulties, pay my debts and help my family.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/456)"
        ],
        "index": 5635,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:94:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ صَبَّاحٍ الْحَذَّاءِ عَنِ ابْنِ الطَّيَّارِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّهُ كَانَ فِي يَدِي شَيْ‏ءٌ تَفَرَّقَ وَ ضِقْتُ ضَيْقاً شَدِيداً فَقَالَ لِي أَ لَكَ حَانُوتٌ فِي السُّوقِ قُلْتُ نَعَمْ وَ قَدْ تَرَكْتُهُ فَقَالَ إِذَا رَجَعْتَ إِلَى الْكُوفَةِ فَاقْعُدْ فِي حَانُوتِكَ وَ اكْنُسْهُ فَإِذَا أَرَدْتَ أَنْ تَخْرُجَ إِلَى سُوقِكَ فَصَلِّ رَكْعَتَيْنِ أَوْ أَرْبَعَ رَكَعَاتٍ ثُمَّ قُلْ فِي دُبُرِ صَلَاتِكَ ",
          "تَوَجَّهْتُ بِلَا حَوْلٍ مِنِّي وَ لَا قُوَّةٍ وَ لَكِنْ بِحَوْلِكَ وَ قُوَّتِكَ أَبْرَأُ إِلَيْكَ مِنَ الْحَوْلِ وَ الْقُوَّةِ إِلَّا بِكَ فَأَنْتَ حَوْلِي وَ مِنْكَ قُوَّتِي اللَّهُمَّ فَارْزُقْنِي مِنْ فَضْلِكَ الْوَاسِعِ رِزْقاً كَثِيراً طَيِّباً وَ أَنَا خَافِضٌ فِي عَافِيَتِكَ فَإِنَّهُ لَا يَمْلِكُهَا أَحَدٌ غَيْرُكَ",
          "قَالَ فَفَعَلْتُ ذَلِكَ وَ كُنْتُ أَخْرُجُ إِلَى دُكَّانِي حَتَّى خِفْتُ أَنْ يَأْخُذَنِي الْجَابِي بِأُجْرَةِ دُكَّانِي وَ مَا عِنْدِي شَيْ‏ءٌ قَالَ فَجَاءَ جَالِبٌ بِمَتَاعٍ فَقَالَ لِي تُكْرِينِي نِصْفَ بَيْتِكَ فَأَكْرَيْتُهُ نِصْفَ بَيْتِي بِكِرَى الْبَيْتِ كُلِّهِ ",
          "قَالَ وَ عَرَضَ مَتَاعَهُ فَأُعْطِيَ بِهِ شَيْئاً لَمْ يَبِعْهُ فَقُلْتُ لَهُ هَلْ لَكَ إِلَيَّ خَيْرٌ تَبِيعُنِي عِدْلًا مِنْ مَتَاعِكَ هَذَا أَبِيعُهُ وَ آخُذُ فَضْلَهُ وَ أَدْفَعُ إِلَيْكَ ثَمَنَهُ قَالَ وَ كَيْفَ لِي بِذَلِكَ قَالَ قُلْتُ وَ لَكَ اللَّهُ عَلَيَّ بِذَلِكَ",
          "قَالَ فَخُذْ عِدْلًا مِنْهَا فَأَخَذْتُهُ وَ رَقَمْتُهُ وَ جَاءَ بَرْدٌ شَدِيدٌ فَبِعْتُ الْمَتَاعَ مِنْ يَوْمِي وَ دَفَعْتُ إِلَيْهِ الثَّمَنَ وَ أَخَذْتُ الْفَضْلَ فَمَا زِلْتُ آخُذُ عِدْلًا عِدْلًا فَأَبِيعُهُ وَ آخُذُ فَضْلَهُ وَ أَرُدُّ عَلَيْهِ مِنْ رَأْسِ الْمَالِ حَتَّى رَكِبْتُ الدَّوَابَّ وَ اشْتَرَيْتُ الرَّقِيقَ وَ بَنَيْتُ الدُّورَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Abu Najran, from Sabbah Al-Haza’a, from Ibn Al-Tayyar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘There was something in my hand which has separated from me, and I am constricted with intense constriction’. So he<sup>asws</sup> said to me: ‘Have you got a shop in the market?’ I said, ‘Yes, and I have neglected it’. So he<sup>asws</sup> said: ‘When you return to Al-Kufa, so sit in your shop, and sweep it (clean). So when you intend to go out to your market, so pray two Rak’at of <span class=\"iTxt\">Salāt</span> or four Rak’at of <span class=\"iTxt\">Salāt</span>, then say at the end of your <span class=\"iTxt\">Salāt</span>, ",
            "‘I have diverted, without any might from myself nor any strength, but by Your<sup>azwj</sup> Mighty and Your<sup>azwj</sup> Strength, having disavowed to You<sup>azwj</sup> from the might and the strength except with You<sup>azwj</sup>, for You<sup>azwj</sup> are my mighty and You<sup>azwj</sup> is my strength. O Allah<sup>azwj</sup>! So grace me from Your<sup>azwj</sup> Grace, the extensive livelihood, abundant, goodly, and I am free from anxiety in Your<sup>azwj</sup> well-being for it no one controls it apart from You<sup>azwj</sup>’.",
            "He (the narrator) said, ‘So I did that, and I was going out to my shop until I feared that the collector would seize me for rent and there was nothing with me. Then an importer came over with goods and he said to me, ‘Can you hire out to me half of your room?’ So I rented it out half of my room to him by the rent of the room, the whole of it’.",
            "He (the narrator) said, ‘And he displayed his goods and asked something (a price) for it but could not sell it. So I said to him, ‘If you think there is goodness for you to me, sell me a bundle of these goods of yours. I shall sell it (at a higher price) and keep the extra and hand over to you its price’. He said, ‘How is that going to work out for me?’ I said, ‘And for you is Allah<sup>azwj</sup> upon me, with that’. ",
            "He said, ‘So take a bundle from it’. So I took it, and priced it, and the cold became extreme. So I sold the goods on the same day and handed over the price to him and I kept the extra. And I did not cease to take bundle after bundle, selling it and taking its extra and returning to him the capital to the extent that I rode the animals, and I bought the slaves, and I built the houses’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad from ibn abu Najran from Sabah al-Hadhdha’ from ibn al- Tayyar who has said the following: “I said to abu ‘Abd Allah, ‘I had some property which now has scattered away and I am under severe constraint.’ The Imam asked, ‘Do you have a shop in the market place?’ I replied, ‘Yes, but I have abandoned it.’ The Imam said, ‘When you go back to Kufah, attend your shop and broom clean it. When you want to go to your market place, perform two Rak‘at Salah (prayer) or four Rak‘at and at the end say, “I have decided to go to work and it is without any power and means from myself but (O Lord), it is by Your power and means. I disassociate myself from all powers and means except for your power and means. You are my power and means. O Lord, grant me, with your generosity vast sustenance, plentiful and fine, so I become affluent in good health by Your help. No one owns it (good health) except You.’” The narrator has said, ‘I followed the instruction but I became afraid of tax collector due to my inability to pay the rent and that I might lose the shop for this reason and I did not have anything to pay. One day a merchant came to me and asked me to rent out to him half of my house. I then rented out one half for the rent of the whole house. He tried to sell his merchandise but did not get the price he wanted, thus he did not sell it. I then asked him if he could allow me to sell a certain amount of his merchandise in my shop; if sold I shall give him his purchase price and keep the extra. He said, “How can that happen?” I said, “Trust me before Allah.” He agreed that I take a bundle. I took it. The weather became very cold. I was able to sell the merchandise the same day. I gave him his purchase price and kept the extra. I continued selling his merchandise, gave back his capital and kept the extra until I was able to buy horses, slaves and a house.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/458)"
        ],
        "index": 5636,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:94:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ ابْنِ الْوَلِيدِ بْنِ صَبِيحٍ عَنْ أَبِيهِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا وَلِيدُ أَيْنَ حَانُوتُكَ مِنَ الْمَسْجِدِ فَقُلْتُ عَلَى بَابِهِ فَقَالَ إِذَا أَرَدْتَ أَنْ تَأْتِيَ حَانُوتَكَ فَابْدَأْ بِالْمَسْجِدِ فَصَلِّ فِيهِ رَكْعَتَيْنِ أَوْ أَرْبَعاً ثُمَّ قُلْ غَدَوْتُ بِحَوْلِ اللَّهِ وَ قُوَّتِهِ وَ غَدَوْتُ بِلَا حَوْلٍ مِنِّي وَ لَا قُوَّةٍ بَلْ بِحَوْلِكَ وَ قُوَّتِكَ يَا رَبِّ اللَّهُمَّ إِنِّي عَبْدُكَ أَلْتَمِسُ مِنْ فَضْلِكَ كَمَا أَمَرْتَنِي فَيَسِّرْ لِي ذَلِكَ وَ أَنَا خَافِضٌ فِي عَافِيَتِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Ahmad Bin Muhammad, from Ali Bin Al-Hakam, from Ibn Al-Waleed Bin Sabeeh, from his father who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘O Waleed! Where is your shop from the Masjid?’ So I said, ‘By its door’. So he<sup>asws</sup> said: ‘Whenever you intend to go to your shop, so begin with the Masjid, and pray two Rak’at therein, or four, then say, ‘I came with the Might of Allah<sup>azwj</sup> and His<sup>azwj</sup> Strength, and I came without any might from me nor strength, but, by You<sup>azwj</sup> Mighty and Your<sup>azwj</sup> Strength, O Lord<sup>azwj</sup> of the worlds. I am Your<sup>azwj</sup> servant seeking from Your<sup>azwj</sup> Grace just as You<sup>azwj</sup> Commanded me, therefore Make that to be easy for me, and I am free from anxiety in Your<sup>azwj</sup> well-being’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from Ahmad ibn Muhammad from Afi ibn af-Hakam from ibn af-Wafid ibn Sabih from his father who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, asked me, ‘Where is your shop in relation to the Masjid?’ I replied, ‘It is near the door of the Masjid.’ He then said, ‘When you want to go to your shop, first go to the Masjid, perform two or four Rak‘at Salah (prayer) and at the end say, “I have attended this morning by the means and power of Allah, but not by my own means and power, in fact it is by Your means and power O Lord. O Allah, I am Your servant and I appeal to You to grant me (wealth) through Your generosity, as You have commanded me to pray to You and appeal. Make this possible for me with ease, so I can be affluent and in good health by Your help.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/458)"
        ],
        "index": 5637,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:94:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنِ الْبَرْقِيِّ عَنْ أَبِيهِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحَسَنِ الْعَطَّارِ عَنْ رَجُلٍ مِنْ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ لِي يَا فُلَانُ أَ مَا تَغْدُو فِي الْحَاجَةِ أَ مَا تَمُرُّ بِالْمَسْجِدِ الْأَعْظَمِ عِنْدَكُمْ بِالْكُوفَةِ قُلْتُ بَلَى قَالَ فَصَلِّ فِيهِ أَرْبَعَ رَكَعَاتٍ قُلْ فِيهِنَّ غَدَوْتُ بِحَوْلِ اللَّهِ وَ قُوَّتِهِ غَدَوْتُ بِغَيْرِ حَوْلٍ مِنِّي وَ لَا قُوَّةٍ وَ لَكِنْ بِحَوْلِكَ يَا رَبِّ وَ قُوَّتِكَ أَسْأَلُكَ بَرَكَةَ هَذَا الْيَوْمِ وَ بَرَكَةَ أَهْلِهِ وَ أَسْأَلُكَ أَنْ تَرْزُقَنِي مِنْ فَضْلِكَ حَلَالًا طَيِّباً تَسُوقُهُ إِلَيَّ بِحَوْلِكَ وَ قُوَّتِكَ وَ أَنَا خَافِضٌ فِي عَافِيَتِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Al-Barqy, from his father, from Safwan Bin Yahya, from Muhammad Bin Al-Hassan Al-Attar, from a man from our companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said to me: ‘O so and so! Do you not come regarding the need? Do you not pass by the great (central) Masjid with you in Al-Kufa?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘So pray four Rak’at of <span class=\"iTxt\">Salāt</span> in it, saying in these, ‘I come with the Might of Allah<sup>azwj</sup> and His<sup>azwj</sup> Strength, without any might from me, nor strength, but with Your<sup>azwj</sup> Mighty, O Lord<sup>azwj</sup>, and Your<sup>azwj</sup> Strength. I ask for Blessings of this day and Blessings of its people; and I ask You<sup>azwj</sup> if You<sup>azwj</sup> could (Grant) sustenance to me from Your<sup>azwj</sup> Grace, Permissible, goodly, being ushered towards me with Your<sup>azwj</sup> Mighty and Your<sup>azwj</sup> Strength, and I am free from anxiety in Your<sup>azwj</sup> well-being’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from al-Barqiy from his father from Safwan ibn Yahya from Muhammad ibn al-Hassan al-‘Attar from a man from our people who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, asked me, ‘O so and so, do you sometimes need something? Do you visit the great Masjid near you in Kufah?’ I replied, ‘Yes, I do.’ He said, ‘Perform four Rak‘at Salah (prayer) there and say, “I have attended this morning by the means and power of Allah, not by my own means and power, but with Your means and power, O Lord. I appeal before You for the blessings of this day and the blessing of the people of this day and I appeal before You to grant me through Your generosity lawful and fine sustenance which You will send to me through Your means and power so I can live affluently in good health by Your help.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/459)"
        ],
        "index": 5638,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:94:6",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ عَنْ عَبْدِ اللَّهِ بْنِ أَحْمَدَ عَنِ الْحَسَنِ بْنِ عُرْوَةَ ابْنِ أُخْتِ شُعَيْبٍ الْعَقَرْقُوفِيِّ عَنْ خَالِهِ شُعَيْبٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَنْ جَاعَ فَلْيَتَوَضَّأْ وَ لْيُصَلِّ رَكْعَتَيْنِ ثُمَّ يَقُولُ يَا رَبِّ إِنِّي جَائِعٌ فَأَطْعِمْنِي فَإِنَّهُ يُطْعَمُ مِنْ سَاعَتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from Muhammad Bin Abdullah, from Ibrahim Bin Is’haq, from Abdullah Bin Ahmad, from Al-Hassan Bin Urwat a son of the sister of Shuayb Al-Aqarquqy, from his maternal uncle Shuayb who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The one who is hungry, so let him perform <span class=\"iTxt\">Wuzu</span>, and let him pray two Rak’at of <span class=\"iTxt\">Salāt</span>, then he should be saying, ‘O Lord<sup>azwj</sup>! I am hungry, so Feed me’, so he would be fed from that very moment’."
          ],
          "en.sarwar": [
            "6. Ali ibn Muhammad has narrated from ‘Abd Allah from Ibrahim ibn Ishaq from ‘Abd Allah ibn Ahmad from al-Hassan ibn ‘Urwah son of the sister of Shu’ayb al-‘Aqarqufiy from his maternal uncle, Shu’ayb who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, said to me, ‘If one feels hungry he should take Wudu’ and perform two Rak‘at Salah (prayer), then say, “O my Lord, I am hungry. Please feed me.” He will be fed within the same hour.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/459)"
        ],
        "index": 5639,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:94:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنِ الْوَلِيدِ بْنِ صَبِيحٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا غَدَوْتَ فِي حَاجَتِكَ بَعْدَ أَنْ تَجِبَ الصَّلَاةُ فَصَلِّ رَكْعَتَيْنِ فَإِذَا فَرَغْتَ مِنَ التَّشَهُّدِ قُلْتَ ",
          "اللَّهُمَّ إِنِّي غَدَوْتُ أَلْتَمِسُ مِنْ فَضْلِكَ كَمَا أَمَرْتَنِي فَارْزُقْنِي رِزْقاً حَلَالًا طَيِّباً وَ أَعْطِنِي فِيمَا رَزَقْتَنِي الْعَافِيَةَ",
          "تُعِيدُهَا ثَلَاثَ مَرَّاتٍ",
          "ثُمَّ تُصَلِّي رَكْعَتَيْنِ أُخْرَاوَيْنِ فَإِذَا فَرَغْتَ مِنَ التَّشَهُّدِ قُلْتَ.",
          "بِحَوْلِ اللَّهِ وَ قُوَّتِهِ غَدَوْتُ بِغَيْرِ حَوْلٍ مِنِّي وَ لَا قُوَّةٍ وَ لَكِنْ بِحَوْلِكَ يَا رَبِّ وَ قُوَّتِكَ وَ أَبْرَأُ إِلَيْكَ مِنَ الْحَوْلِ وَ الْقُوَّةِ اللَّهُمَّ إِنِّي أَسْأَلُكَ بَرَكَةَ هَذَا الْيَوْمِ وَ بَرَكَةَ أَهْلِهِ وَ أَسْأَلُكَ أَنْ تَرْزُقَنِي مِنْ فَضْلِكَ رِزْقاً وَاسِعاً طَيِّباً حَلَالًا تَسُوقُهُ إِلَيَّ بِحَوْلِكَ وَ قُوَّتِكَ وَ أَنَا خَافِضٌ فِي عَافِيَتِكَ تَقُولُهَا ثَلَاثاً"
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdulah Bin Al-Mugheira, from Al-Waleed Bin Sabeeh, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When you go regarding your needs after having performed the Obligatory <span class=\"iTxt\">Salāt</span>, so pray two Rak’at of <span class=\"iTxt\">Salāt</span>, and when you are free from the <span class=\"iTxt\">Tashahhud</span>, say, ",
            "‘O Allah<sup>azwj</sup>! I am going out seeking from Your<sup>azwj</sup> Grace just as You<sup>azwj</sup> Commanded me to, therefore Sustain me with a Permissible goodly sustenance and Grant me in what would sustain my well-being’ – repeating it three times. ",
            "Then you should pray two other Rak’at of <span class=\"iTxt\">Salāt</span>. So when you are free from the <span class=\"iTxt\">Tashahhud</span>, say, ",
            "‘By the Might of Allah<sup>azwj</sup> and His<sup>azwj</sup> Strength I am going, without there being any might from me nor strength, but by Your<sup>azwj</sup> Might, O Lord<sup>azwj</sup>! I ask You<sup>azwj</sup> for Blessings of this day and Blessings of its people, and I ask You<sup>azwj</sup> if You<sup>azwj</sup> could Sustain me from Your<sup>azwj</sup> Grace with extensive goodly Permissible sustenance, ushered towards me by Your<sup>azwj</sup> Might and Your<sup>azwj</sup> Strength, and I am free from anxiety in Your<sup>azwj</sup> well-being’ – saying it thrice’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father, from ‘Abd Allah ibn al-Mughirah from al-Walid ibn Sabih who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that when you in the morning after Salah (prayer) want to go to work, perform two Rak‘at Salah (prayer). After saying the testimonies say, ‘O Lord, I have attended this morning and I seek favor through Your generosity, as You have commanded, in the form of lawful and fine sustenance with which You will grant me good health.’ Say it three times. Then perform another two Rak‘at Salah (prayer). At the end of testimonies say, ‘By the power and means of Allah, I attend this morning not by my own power and means, but by Your power and means, O Lord, and I disassociate from all powers and means. O Lord, I appeal to You for the blessings of this day and the blessings of the people of this day. I appeal before You to grant me through Your generosity vast, fine and lawful sustenance which You will send to me by Your means and power so I can live affluently in good health.’ Say it three times.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:4:94",
  "kind": "verse_list"
}