{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 95"
        },
        "path": "/books/al-kafi:3:4:95",
        "titles": {
          "ar": "باب صَلَاةِ الْحَوَائِجِ",
          "en": "Chapter 95 – Salāt for the needs"
        }
      }
    ],
    "index": 762,
    "local_index": 95,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 96"
        },
        "path": "/books/al-kafi:3:4:96",
        "titles": {
          "ar": "باب صَلَاةِ مَنْ خَافَ مَكْرُوهاً",
          "en": "Chapter 96 – Salāt of the one who fears an abhorrence"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 94"
        },
        "path": "/books/al-kafi:3:4:94",
        "titles": {
          "ar": "باب الصَّلَاةِ فِي طَلَبِ الرِّزْقِ",
          "en": "Chapter 94 – The Salāt regarding seeking of the livelihood"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:4:95",
    "titles": {
      "ar": "باب صَلَاةِ الْحَوَائِجِ",
      "en": "Chapter 95 – Salāt for the needs"
    },
    "verse_count": 11,
    "verse_start_index": 5639,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/460)"
        ],
        "index": 5640,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2489",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/601",
              "text": "زِيَادٍ الْقَنْدِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/286",
              "text": "عَبْدِ الرَّحِيمِ الْقَصِيرِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ زِيَادٍ الْقَنْدِيِّ عَنْ عَبْدِ الرَّحِيمِ الْقَصِيرِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:95:1",
        "text": [
          " دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقُلْتُ جُعِلْتُ فِدَاكَ إِنِّي اخْتَرَعْتُ دُعَاءً قَالَ دَعْنِي مِنِ اخْتِرَاعِكَ إِذَا نَزَلَ بِكَ أَمْرٌ فَافْزَعْ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ صَلِّ رَكْعَتَيْنِ تُهْدِيهِمَا إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) قُلْتُ كَيْفَ أَصْنَعُ قَالَ تَغْتَسِلُ وَ تُصَلِّي رَكْعَتَيْنِ تَسْتَفْتِحُ بِهِمَا افْتِتَاحَ الْفَرِيضَةِ وَ تَشَهَّدُ تَشَهُّدَ الْفَرِيضَةِ",
          "فَإِذَا فَرَغْتَ مِنَ التَّشَهُّدِ وَ سَلَّمْتَ قُلْتَ ",
          "اللَّهُمَّ أَنْتَ السَّلَامُ وَ مِنْكَ السَّلَامُ وَ إِلَيْكَ يَرْجِعُ السَّلَامُ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ بَلِّغْ رُوحَ مُحَمَّدٍ مِنِّي السَّلَامَ وَ أَرْوَاحَ الْأَئِمَّةِ الصَّادِقِينَ سَلَامِي وَ ارْدُدْ عَلَيَّ مِنْهُمُ السَّلَامَ وَ السَّلَامُ عَلَيْهِمْ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ",
          "اللَّهُمَّ إِنَّ هَاتَيْنِ الرَّكْعَتَيْنِ هَدِيَّةٌ مِنِّي إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَأَثِبْنِي عَلَيْهِمَا مَا أَمَّلْتُ وَ رَجَوْتُ فِيكَ وَ فِي رَسُولِكَ يَا وَلِيَّ الْمُؤْمِنِينَ ثُمَّ تَخِرُّ سَاجِداً وَ تَقُولُ ",
          "يَا حَيُّ يَا قَيُّومُ يَا حَيُّ لَا يَمُوتُ يَا حَيُّ لَا إِلَهَ إِلَّا أَنْتَ يَا ذَا الْجَلَالِ وَ الْإِكْرَامِ يَا أَرْحَمَ الرَّاحِمِينَ أَرْبَعِينَ مَرَّةً",
          "ثُمَّ ضَعْ خَدَّكَ الْأَيْمَنَ فَتَقُولُهَا أَرْبَعِينَ مَرَّةً ثُمَّ ضَعْ خَدَّكَ الْأَيْسَرَ فَتَقُولُهَا أَرْبَعِينَ مَرَّةً ثُمَّ تَرْفَعُ رَأْسَكَ وَ تَمُدُّ يَدَكَ وَ تَقُولُ أَرْبَعِينَ مَرَّةً ثُمَّ تَرُدُّ يَدَكَ إِلَى رَقَبَتِكَ وَ تَلُوذُ بِسَبَّابَتِكَ وَ تَقُولُ ذَلِكَ أَرْبَعِينَ مَرَّةً ثُمَّ خُذْ لِحْيَتَكَ بِيَدِكَ الْيُسْرَى وَ ابْكِ أَوْ تَبَاكِ وَ قُلْ ",
          "يَا مُحَمَّدُ يَا رَسُولَ اللَّهِ أَشْكُو إِلَى اللَّهِ وَ إِلَيْكَ حَاجَتِي وَ إِلَى أَهْلِ بَيْتِكَ الرَّاشِدِينَ حَاجَتِي وَ بِكُمْ أَتَوَجَّهُ إِلَى اللَّهِ فِي حَاجَتِي",
          "ثُمَّ تَسْجُدُ وَ تَقُولُ ",
          "يَا اللَّهُ يَا اللَّهُ حَتَّى يَنْقَطِعَ نَفَسُكَ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ افْعَلْ بِي كَذَا وَ كَذَا",
          "قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَأَنَا الضَّامِنُ عَلَى اللَّهِ عَزَّ وَ جَلَّ أَنْ لَا يَبْرَحَ حَتَّى تُقْضَى حَاجَتُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Ahmad Bin Muhammad Bin Abu Abdullah, from Ziyad Al-Qandy, from Abdul Rahman Al-Qaseyr who said, ",
            "‘I went over to Abu Abdullah<sup>asws</sup>, and I said, ‘May I be sacrificed for you<sup>asws</sup>! I invented a supplication’. He<sup>asws</sup> said: ‘Leave me<sup>asws</sup> from your invention. When a matter descends with you, so panic towards Rasool-Allah<sup>saww</sup> and pray two Rak’at of <span class=\"iTxt\">Salāt</span> gifting them both to Rasool-Allah<sup>saww</sup>’. I said, ‘How should I do it’. He<sup>asws</sup> said: ‘You should wash and pray two Rak’at of <span class=\"iTxt\">Salāt</span>, beginning both of these (like) the beginning of the Obligatory <span class=\"iTxt\">Salāt</span>, and perform a <span class=\"iTxt\">Tashahhud</span> (like the) <span class=\"iTxt\">Tashahhud</span> of the Obligatory <span class=\"iTxt\">Salāt</span>.",
            "So when you are free from the <span class=\"iTxt\">Tashahhud</span> and offered <span class=\"iTxt\">Salām</span>, say, ",
            "‘O Allah<sup>azwj</sup>! You<sup>azwj</sup> are the Safety, and from You<sup>azwj</sup> is the safety, and to You<sup>azwj</sup> does the safety return to. O Allah<sup>azwj</sup>! Send Blessings upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and deliver the greetings from me to the soul of Muhammad<sup>saww</sup>, and the souls of the Imams<sup>asws</sup>, the truthful ones my greetings, and Return upon me the greetings from them<sup>asws</sup>, and the greetings be upon them<sup>asws</sup> and the Mercy of Allah<sup>azwj</sup> and His<sup>azwj</sup> Blessings. ",
            "O Allah<sup>azwj</sup>! These two Rak’at of <span class=\"iTxt\">Salāt</span> are a gift from me to Rasool-Allah<sup>saww</sup>, Reward me upon these two what I wish for and hope in You<sup>azwj</sup> and in Your<sup>azwj</sup> Rasool<sup>saww</sup>, O Guardian of the Believers!’ Then fall down to <span class=\"iTxt\">Sajdah</span> and you should be saying, ",
            "‘O Living! O Eternal! O Living Who does not die! O Living. There is no god except for You<sup>azwj</sup>. O the One with the Majesty and the Benevolence. O the most Merciful of the merciful ones!’ – forty times. ",
            "Then place your right cheek (on the ground) and say it forty times. Then place your left cheek (on the ground) and say it forty times. Then raise your head and extend your hand and you should say it forty times. Then return your hand to your neck and place your index finger and say it forty times. Then grab your beard with your left hand and weep or wail and say, ",
            "‘O Muhammad<sup>saww</sup>! O Rasool-Allah<sup>saww</sup>! I complain to Allah<sup>azwj</sup> and to you<sup>saww</sup> of my need, and to the People<sup>asws</sup> of your<sup>saww</sup> Household, the rightly Guided ones, of my need, and through all of you<sup>asws</sup> I turn to Allah<sup>azwj</sup> with regards to my need’. ",
            "Then perform <span class=\"iTxt\">Sajdah</span>, and you should be saying; ",
            "O Allah<sup>azwj</sup>! O Allah<sup>azwj</sup>!’ until your breath is cut off, ‘Send Blessings upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and Do such and such for me’. ",
            "Abu Abdullah<sup>asws</sup> said: ‘So I<sup>asws</sup> am a guarantor upon Allah<sup>azwj</sup> Mighty and Majestic that he would not depart until his need is Fulfilled’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from Ahmad ibn Muhammad from abu ‘Abd Allah from Ziyad al-Qandiy from ‘Abd al-Rahim al-Qasir who has said the following: “I visited abu ‘Abd Allah, ‘Alayhi al-Salam, and said, ‘I pray to Allah to keep my soul in service for your cause; I have invented a prayer.’ He said, ‘Keep your invention away from me. When you face a difficult condition, seek asylum with the Messenger of Allah, perform two Rak‘at Salah (prayer), as a present to the Messenger of Allah.’ I then asked, ‘How should I do it?’ He said, ‘Take a bath, perform two Rak‘at Salah (prayer), begin just as you do in obligatory Salah (prayer) and read the testimonies just as you do in obligatory Salah (prayer). At the end of testimony and Salam say, “O Lord, You are Salam (peace or safety), from You comes safety, to You returns safety, Allahumma Salli ‘Ala Muhammad wa ‘Ali Muhammad (O Allah grant Muhammad and his family a compensation worthy of their serving Your cause). Deliver my salutation to Muhammad and the spirits of truthful ’A’immah, ‘Alayhim al-Salam, and to me Salam from them and the blessings of Allah. O Allah, these two (Rak‘at Salah (prayer)) are my gift to the Messenger of Allah. Please grant to me the reward that I wished and about which I placed my hopes before You and Your Messenger, O Guardian of the believers.” Then make sajdah and say, “O the Living One, the Guardian, the Living who never dies, O the Living One, no one other than You, deserves worship, O the owner of glory, and grace, O merciful above all merciful ones”- forty times. Then place the right side of your face on the ground and say the above forty times. Then place the left side of your face on the ground and say the same forty times. Raise thereafter your head, stretch your hands and say the above forty times. Then hold your beard with your left hand, weep or make a weeping face and say, “O Muhammad, the Messenger of Allah, I complain before Allah and before you about my needs as well as before your Ahl al-Bayt (members of your family), the right guides about my needs, through you I turn to Allah about my needs.” Then make sajdah and say, “O Allah, O Allah,” for a full breath, Allahumma Salli ‘Ala Muhammad wa ‘Ali Muhammad (O Allah grant Muhammad and his family a compensation worthy of their serving Your cause).’ Please grant my wishes and needs.’” “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘I guarantee from Allah, the Most Majestic, the Most Glorious, that He will not leave your needs and wishes without being met and fulfilled.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/461)"
        ],
        "index": 5641,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/18",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ إِلَى "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِنَا رَفَعَهُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:95:2",
        "relations": {
          "Mentions": [
            "/books/quran:112:1"
          ]
        },
        "text": [
          " فِي الرَّجُلِ يَحْزُنُهُ الْأَمْرُ أَوْ يُرِيدُ الْحَاجَةَ قَالَ يُصَلِّي رَكْعَتَيْنِ يَقْرَأُ فِي إِحْدَاهُمَا قُلْ هُوَ اللَّهُ أَحَدٌ أَلْفَ مَرَّةٍ وَ فِي الْأُخْرَى مَرَّةً ثُمَّ يَسْأَلُ حَاجَتَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from one of our companions, ",
            "(It has been narrated) raising it to Abu Abdullah<sup>asws</sup> having said regarding the man whose matter has grieved him or he wants the need, said: ‘He should pray two Rak’at of <span class=\"iTxt\">Salāt</span>, reciting in one of the two <span class=\"ibTxt\"><a href=\"/#/books/quran:112#h1\">[112:1]</a> Say He Allah is One</span> (Chapter 112) a thousand times, and in the other one, once. Then he should ask his need’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from certain individuals of our people in a marfu’ manner who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that if a man is sad and depressed about something or because of an unfulfilled wish, he should perform two Rak‘at Salah (prayer). In one he should recite Chapter 112 of the Holy Quran one thousand times and in the second Rak‘at once, then ask for his wish.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/461)"
        ],
        "index": 5642,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2752",
              "text": "عَلِيِّ بْنِ دُوَيْلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2684",
              "text": "مُقَاتِلِ بْنِ مُقَاتِلٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ دُوَيْلٍ عَنْ مُقَاتِلِ بْنِ مُقَاتِلٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:95:3",
        "relations": {
          "Mentions": [
            "/books/quran:112:1"
          ]
        },
        "text": [
          " قُلْتُ لِلرِّضَا ( عليه السلام ) جُعِلْتُ فِدَاكَ عَلِّمْنِي دُعَاءً لِقَضَاءِ الْحَوَائِجِ فَقَالَ إِذَا كَانَتْ لَكَ حَاجَةٌ إِلَى اللَّهِ عَزَّ وَ جَلَّ مُهِمَّةٌ فَاغْتَسِلْ وَ الْبَسْ أَنْظَفَ ثِيَابِكَ وَ شَمَّ شَيْئاً مِنَ الطِّيبِ ثُمَّ ابْرُزْ تَحْتَ السَّمَاءِ فَصَلِّ رَكْعَتَيْنِ تَفْتَتِحُ الصَّلَاةَ فَتَقْرَأُ فَاتِحَةَ الْكِتَابِ وَ قُلْ هُوَ اللَّهُ أَحَدٌ خَمْسَ عَشْرَةَ مَرَّةً",
          "ثُمَّ تَرْكَعُ فَتَقْرَأُ خَمْسَ عَشْرَةَ مَرَّةً ثُمَّ تُتِمُّهَا عَلَى مِثَالِ صَلَاةِ التَّسْبِيحِ غَيْرَ أَنَّ الْقِرَاءَةَ خَمْسَ عَشْرَةَ مَرَّةً فَإِذَا سَلَّمْتَ فَاقْرَأْهَا خَمْسَ عَشْرَةَ مَرَّةً ثُمَّ تَسْجُدُ فَتَقُولُ فِي سُجُودِكَ.",
          "اللَّهُمَّ إِنَّ كُلَّ مَعْبُودٍ مِنْ لَدُنْ عَرْشِكَ إِلَى قَرَارِ أَرْضِكَ فَهُوَ بَاطِلٌ سِوَاكَ فَإِنَّكَ أَنْتَ اللَّهُ الْحَقُّ الْمُبِينُ اقْضِ لِي حَاجَةَ كَذَا وَ كَذَا السَّاعَةَ السَّاعَةَ وَ تُلِحُّ فِيمَا أَرَدْتَ"
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Duweyl, from Muqatil Bin Muqat who said, ",
            "‘I said to Al-Reza<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Teach me a supplication for fulfilling the needs’. So he<sup>asws</sup> said: ‘When there was an important need for you to Allah<sup>azwj</sup> Mighty and Majestic, so wash, and wear the cleanest of your clothes, and apply something from the perfume, then go out beneath the sky and pray two Rak’at of <span class=\"iTxt\">Salāt</span>. You should commence the <span class=\"iTxt\">Salāt</span> by reciting the Opening of the Book (Chapter 1), and <span class=\"ibTxt\"><a href=\"/#/books/quran:112#h1\">[112:1]</a> Say He Allah is One</span> (Chapter 112) fifteen times. ",
            "Then you should go down into <span class=\"iTxt\">Rukū</span> and recite it fifteen times, then complete them both like the <span class=\"iTxt\">Salāt</span> of the Glorification (<span class=\"iTxt\">Tasbeeh</span>), apart from that the recitation is fifteen times. So when you <span class=\"iTxt\">Salām</span>, so recite it fifteen times. Then perform <span class=\"iTxt\">Sajdah</span> and you should be saying in your <span class=\"iTxt\">Sajdah</span>, ",
            "‘O Allah<sup>azwj</sup>! It is false whatever is worshipped besides You<sup>azwj</sup>, from Your<sup>azwj</sup> Throne down to the settlement of Your<sup>azwj</sup> earth, (Worship is only) for You<sup>azwj</sup>, You<sup>azwj</sup> are Allah<sup>azwj</sup>, The Evident Truth. Fulfil such and such a need of mine, at this moment, at this moment!’ and beg for what you want’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn Duwayl from Muqatil ibn Muqatil who has said the following: “I said to al-Rida, ‘Alayhi al-Salam, ‘I pray to Allah to keep my soul in service for your cause, teach me a prayer for help in my needs.’ The Imam said, ‘When you need something and want Allah, the Most Majestic, the Most Glorious, to help you, take a bath and dress up in your cleanest dress, use perfume, go under the open sky and perform two Rak‘at Salah (prayer). Begin Salah (prayer) and recite al-Fatihah and then Chapter 112 of the Holy Quran fifteen times. Then kneel down for Ruku‘ and recite chapter 112 of the Holy Quran fifteen times. Thereafter complete this prayer like the Salah (prayer) of Tasbih discussed in Chapter 96 above, except that recitation in this Salah (prayer) is fifteen times. After Salam read Chapter 112 of the Holy Quran fifteen times. Thereafter bow down for sajdah to say, “O Lord, everything, other than You, from Your Throne down to earth if worshipped is false. You are Allah in all truth and clarity. Please grant me such and such wish that I need, in this hour.” Strive to express your prayer as best as you can.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/462)"
        ],
        "index": 5643,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/871",
              "text": "أَبِي عَلِيٍّ الْخَزَّازِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ أَبِي عَلِيٍّ الْخَزَّازِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:95:4",
        "relations": {
          "Mentions": [
            "/books/quran:112:1"
          ]
        },
        "text": [
          " حَضَرْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَأَتَاهُ رَجُلٌ فَقَالَ لَهُ جُعِلْتُ فِدَاكَ أَخِي بِهِ بَلِيَّةٌ أَسْتَحْيِي أَنْ أَذْكُرَهَا فَقَالَ لَهُ اسْتُرْ ذَلِكَ وَ قُلْ لَهُ يَصُومُ يَوْمَ الْأَرْبِعَاءِ وَ الْخَمِيسِ وَ الْجُمُعَةِ وَ يَخْرُجُ إِذَا زَالَتِ الشَّمْسُ وَ يَلْبَسُ ثَوْبَيْنِ إِمَّا جَدِيدَيْنِ وَ إِمَّا غَسِيلَيْنِ حَيْثُ لَا يَرَاهُ أَحَدٌ",
          "فَيُصَلِّي وَ يَكْشِفُ عَنْ رُكْبَتَيْهِ وَ يَتَمَطَّى بِرَاحَتَيْهِ الْأَرْضَ وَ جَنْبَيْهِ وَ يَقْرَأُ فِي صَلَاتِهِ فَاتِحَةَ الْكِتَابِ عَشْرَ مَرَّاتٍ وَ قُلْ هُوَ اللَّهُ أَحَدٌ عَشْرَ مَرَّاتٍ فَإِذَا رَكَعَ قَرَأَ خَمْسَ عَشْرَةَ مَرَّةً قُلْ هُوَ اللَّهُ أَحَدٌ فَإِذَا سَجَدَ قَرَأَهَا عَشْراً فَإِذَا رَفَعَ رَأْسَهُ قَبْلَ أَنْ يَسْجُدَ قَرَأَهَا عِشْرِينَ مَرَّةً يُصَلِّي أَرْبَعَ رَكَعَاتٍ عَلَى مِثْلِ هَذَا ",
          "فَإِذَا فَرَغَ مِنَ التَّشَهُّدِ قَالَ.",
          "يَا مَعْرُوفاً بِالْمَعْرُوفِ يَا أَوَّلَ الْأَوَّلِينَ يَا آخِرَ الْآخِرِينَ يَا ذَا الْقُوَّةِ الْمَتِينِ يَا رَازِقَ الْمَسَاكِينِ يَا أَرْحَمَ الرَّاحِمِينَ إِنِّي اشْتَرَيْتُ نَفْسِي مِنْكَ بِثُلُثِ مَا أَمْلِكُ فَاصْرِفْ عَنِّي شَرَّ مَا ابْتُلِيتُ بِهِ إِنَّكَ عَلَى كُلِّ شَيْ‏ءٍ قَدِيرٌ"
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al-Husayn Bin Saeed, from Abu Ali Al-Khazzaz who said, ",
            "‘I was present with Abu Abdullah<sup>asws</sup> and a man came over to him, so he said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! My brother suffers from something taht I feel embarrassed to mention’. So he<sup>asws</sup> said to him: ‘Conceal that and say to him that he should be Fasting on the day of Wednesday and the Thursday, and the Friday; and he should go out, when the sun (starts to) decline) and he should be wearing two clothes, either both being new ones or both being washed, where no one can see him. ",
            "Then he should pray and uncover from his knees and stretch his palms and his forehead upon the ground, and he should recite in his <span class=\"iTxt\">Salāt</span>, the Opening of the Book (Chapter 1), ten times, and <span class=\"ibTxt\"><a href=\"/#/books/quran:112#h1\">[112:1]</a> Say He Allah is One</span> (Chapter 112) ten times. So when he performs <span class=\"iTxt\">Rukū</span>, he should recite fifteen times <span class=\"ibTxt\"><a href=\"/#/books/quran:112#h1\">[112:1]</a> Say He Allah is One</span> (Chapter 112), and when he performs <span class=\"iTxt\">Sajdah</span>, he should recite it ten (times). So when he raises his head after his <span class=\"iTxt\">Sajdah</span>, he should recite it twenty times. He should pray four Rak’at of <span class=\"iTxt\">Salāt</span> upon the likes of this. ",
            "So when he is free from the <span class=\"iTxt\">Tashahhud</span>, he says, ",
            "‘O the One Well-Known with the Fame! O the First of the former ones! O Last of the later ones! O the One with the Robust Strength! O the Sustainer of the poor ones! O the most Merciful of the merciful ones! I have bought myself from You<sup>azwj</sup> with one-third of what I own, so Exchange from me the evil what I am afflicted with. You<sup>azwj</sup> are Able upon everything’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from abu Ali al-Khazzaz who has said the following: “I visited abu ’Abd Allah, ‘Alayhi al-Salam, and a man also came to him saying, ‘I pray to Allah to keep my soul in service for your cause, my brother suffers from something that I feel embarrassed to mention.’ The Imam said, ‘Do not mention it and tell him to fast on Wednesday, Thursday and Friday. When the sun declines to the west at noontime, he should go out somewhere so no one can see him while dressed in two pieces of his new or just washed clothes, and perform two Rak‘at Salah (prayer), then expose his knees, place his palms and forehead on the ground. In his Salah (prayer), he should recite al-Fatihah al-Kitab ten times. Thereafter he should recite Chapter 112 of the Holy Quran ten times, in Ruku‘ fifteen times, in sajdah ten times, between the two sajdah when sitting twenty times. He should perform four Rak‘at Salah (prayer) in this way. After completing Tashahhud (the two testimonies) he should say, “O the One who is known for His granting favor, O the First of all first ones, O the Last of all last ones, O the One who has strong power, O the One who grants sustenance to the destitute, O the most Merciful of all merciful ones. I have purchased myself from You with one- third of what I own. (With such payment) I pray to You, remove from me the evil of what I suffer from. You have power over all things.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/462)"
        ],
        "index": 5644,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "بِهَذَا الْإِسْنَادِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2753",
              "text": "الْحَسَنِ بْنِ صَالِحٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِهَذَا الْإِسْنَادِ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْحَسَنِ بْنِ صَالِحٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:95:5",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ وَ صَلَّى رَكْعَتَيْنِ فَأَتَمَّ رُكُوعَهُمَا وَ سُجُودَهُمَا ثُمَّ جَلَسَ فَأَثْنَى عَلَى اللَّهِ عَزَّ وَ جَلَّ وَ صَلَّى عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ثُمَّ سَأَلَ اللَّهَ حَاجَتَهُ فَقَدْ طَلَبَ الْخَيْرَ فِي مَظَانِّهِ وَ مَنْ طَلَبَ الْخَيْرَ فِي مَظَانِّهِ لَمْ يَخِبْ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Ahmad Bin Muhammad, from Ibn Mahboub, from Al Hassan Bin Salih who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The one who performs <span class=\"iTxt\">Wuzu</span>, so he perfects the <span class=\"iTxt\">Wuzu</span> and prays two Rak’at of <span class=\"iTxt\">Salāt</span>, completing their <span class=\"iTxt\">Rukū</span>s and their <span class=\"iTxt\">Sajud (plural of Sajdah)</span>, then sits, so he Lauds upon Allah<sup>azwj</sup> Mighty and Majestic and sends Blessings upon Rasool-Allah<sup>saww</sup>, then asks Allah<sup>azwj</sup> for his needs, so he has sought the goodness from its habitat; and the one who seeks the goodness in its habitat would never be unsuccessful’."
          ],
          "en.sarwar": [
            "5. Through the same chain of narrators as the previous Hadith, it is narrated from Ahmad ibn Muhammad from ibn Mahbub from al- Hassan ibn Salih who has said the following: “I heard abu ‘Abd Allah, say this. ‘One, for coming true of his wish, may take a proper Wudu’, perform two Rak‘at Salah (prayer) with complete Ruku‘ and sajdah. He then can sit and praises Allah, the Most Majestic, the Most Glorious. He then can say, “Allahumma Salli ‘Ala Muhammad wa ‘Ali Muhammad (O Allah grant Muhammad and his family a compensation worthy of their serving Your cause).” Thereafter ask Allah for his needs, he has asked Him for needs in a time of a good chance for acceptance, in which case one is not deprived of coming true of his wish.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/462)"
        ],
        "index": 5645,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/339",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2754",
              "text": "عَبْدِ اللَّهِ بْنِ عُثْمَانَ أَبِي إِسْمَاعِيلَ السَّرَّاجِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2755",
              "text": "عَبْدِ اللَّهِ بْنِ وَضَّاحٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/118",
              "text": "عَلِيِّ بْنِ أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2756",
              "text": "إِسْمَاعِيلَ بْنِ الْأَرْقَطِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2757",
              "text": "أُمُّهُ أُمُّ سَلَمَةَ أُخْتُ أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ أَبِي إِسْمَاعِيلَ السَّرَّاجِ عَنْ عَبْدِ اللَّهِ بْنِ وَضَّاحٍ وَ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ إِسْمَاعِيلَ بْنِ الْأَرْقَطِ وَ أُمُّهُ أُمُّ سَلَمَةَ أُخْتُ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:95:6",
        "text": [
          " مَرِضْتُ فِي شَهْرِ رَمَضَانَ مَرَضاً شَدِيداً حَتَّى ثَقُلْتُ وَ اجْتَمَعَتْ بَنُو هَاشِمٍ لَيْلًا لِلْجَنَازَةِ وَ هُمْ يَرَوْنَ أَنِّي مَيِّتٌ فَجَزِعَتْ أُمِّي عَلَيَّ فَقَالَ لَهَا أَبُو عَبْدِ اللَّهِ ( عليه السلام ) خَالِي اصْعَدِي إِلَى فَوْقِ الْبَيْتِ فَابْرُزِي إِلَى السَّمَاءِ وَ صَلِّي رَكْعَتَيْنِ فَإِذَا سَلَّمْتِ فَقُولِي ",
          "اللَّهُمَّ إِنَّكَ وَهَبْتَهُ لِي وَ لَمْ يَكُ شَيْئاً اللَّهُمَّ وَ إِنِّي أَسْتَوْهِبُكَهُ مُبْتَدِئاً فَأَعِرْنِيهِ",
          "قَالَ فَفَعَلَتْ فَأَفَقْتُ وَ قَعَدْتُ وَ دَعَوْا بِسَحُورٍ لَهُمْ هَرِيسَةٍ فَتَسَحَّرُوا بِهَا وَ تَسَحَّرْتُ مَعَهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Abdullah Bin Usman Abu Ismail Al-Sarraj, from Abdullah Bin Wazzah, and Ali Bin Abu Hamza, ",
            "(It has been narrated) from Ismail Bin Al-Arqat and his mother Umm Salma, a sister of Abu Abdullah<sup>asws</sup> who said, ‘I fell ill in a Month of Ramazan with an extreme illness to the extent that I was heavy (could not get up), and the Clan of Hashim<sup>as</sup> gathered at night for the funeral, and they were viewing that I was dead. So my mother panicked over me, and Abu Abdullah<sup>asws</sup> said to her: ‘My<sup>asws</sup> aunt! Ascend to the top of the house and go out to the open sky and pray two Rak’at of <span class=\"iTxt\">Salāt</span>. So when you say <span class=\"iTxt\">Salām</span>, say, ",
            "‘O Allah<sup>azwj</sup>! You<sup>azwj</sup> Give it to me when he was not anything, O Allah<sup>azwj</sup> , gift him to You<sup>azwj</sup>, so Lend it to me’.",
            "So she did it, and I woke up and sat up straight, and called for the pre-dawn meal for them, Hareysa (minced meat with cereal). So they partook the pre-dawn meal with it, and I participated with them’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Isma’il from ‘Abd Allah ibn ‘Uthman from abu Isma’il al-Sarraj from ‘Abd Allah ibn Waddah and Ali ibn abu Hamzah from Isma’il ibn al-Arqat and his mother ‘Umm Salamah sister of abu ‘Abd Allah ‘Alayhi al-Salam, who has said the following: “I became seriously ill in the month of Ramadan. I was not able to get up. Banu Hashim gathered at night for burial, seeing me about to die. My mother was restless. Abu ‘Abd Allah, ‘Alayhi al-Salam, told her, ‘My aunt, climb on the house, expose your head under the sky, perform two Rak‘at Salah (prayer) and after Salam say, “O Allah, You give him to me as a gift. He was not anything. O Allah, I pray to You to give him to me as a gift on my own initiation so allow me to borrow him from You.’” She did as she was told and I regained consciousness and sat up straight. They called everyone for food (so they can fast the next day). It was Harisah (mashed meat and grain). They ate and I ate with them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/463)"
        ],
        "index": 5646,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "بِهَذَا الْإِسْنَادِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/720",
              "text": "أَبِي إِسْمَاعِيلَ السَّرَّاجِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/217",
              "text": "ابْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2421",
              "text": "شُرَحْبِيلَ الْكِنْدِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِهَذَا الْإِسْنَادِ عَنْ أَبِي إِسْمَاعِيلَ السَّرَّاجِ عَنِ ابْنِ مُسْكَانَ عَنْ شُرَحْبِيلَ الْكِنْدِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:95:7",
        "text": [
          " إِذَا أَرَدْتَ أَمْراً تَسْأَلُهُ رَبَّكَ فَتَوَضَّأْ وَ أَحْسِنِ الْوُضُوءَ ثُمَّ صَلِّ رَكْعَتَيْنِ وَ عَظِّمِ اللَّهَ وَ صَلِّ عَلَى النَّبِيِّ ( صلى الله عليه وآله ) وَ قُلْ بَعْدَ التَّسْلِيمِ ",
          "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّكَ مَلِكٌ وَ أَنَّكَ عَلَى كُلِّ شَيْ‏ءٍ قَدِيرٌ مُقْتَدِرٌ وَ بِأَنَّكَ مَا تَشَاءُ مِنْ أَمْرٍ يَكُونُ اللَّهُمَّ إِنِّي أَتَوَجَّهُ إِلَيْكَ بِنَبِيِّكَ مُحَمَّدٍ نَبِيِّ الرَّحْمَةِ ( صلى الله عليه وآله )",
          "يَا مُحَمَّدُ يَا رَسُولَ اللَّهِ إِنِّي أَتَوَجَّهُ بِكَ إِلَى اللَّهِ رَبِّكَ وَ رَبِّي لِيُنْجِحَ لِي طَلِبَتِي اللَّهُمَّ بِنَبِيِّكَ أَنْجِحْ لِي طَلِبَتِي بِمُحَمَّدٍ ثُمَّ سَلْ حَاجَتَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Abu Ismail Al-Sarraj, from Ibn Muskan, from Shurahbeyl Al-Kindy, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Whenever you intend a matter to ask your Lord<sup>azwj</sup> for it, so perform extended <span class=\"iTxt\">Wuzu (</span>including the Sunnah part<span class=\"iTxt\">)</span>. Then pray two Rak’at of <span class=\"iTxt\">Salāt</span> and Magnify Allah<sup>azwj</sup> and send Blessings upon the Prophet<sup>saww</sup>, and say after the <span class=\"iTxt\">Salām</span>, ",
            "‘O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> as You<sup>azwj</sup> are the King and You<sup>azwj</sup> are Able upon everything, All-Powerful, and that whatever matter You<sup>azwj</sup> Desire for, occurs. O Allah<sup>azwj</sup>! I divert myself to You<sup>azwj</sup> by Your<sup>azwj</sup> Prophet<sup>saww</sup> Muhammad<sup>saww</sup>, the Prophet<sup>saww</sup> of Mercy.",
            "O Muhammad<sup>saww</sup>! O Rasool-Allah<sup>saww</sup>! I diverted by you<sup>saww</sup> towards Allah<sup>azwj</sup>, your<sup>saww</sup> Lord<sup>azwj</sup> and my Lord<sup>azwj</sup> in order to achieve my need. O Allah<sup>azwj</sup>! By Your<sup>azwj</sup> Prophet<sup>saww</sup> Make me achieve my need by Muhammad<sup>saww</sup>’. Then ask for your need’."
          ],
          "en.sarwar": [
            "7. Through the same chain of narrators as the previous Hadith, it is narrated from abu Isma’il al-Sarraj from ibn Muskan from Sharahbil al-Kindiy who has said the following: “Abu la’ far, ‘Alayhi al-Salam, has said that if you want to ask your Lord for something, take Wudu’ properly, perform two Rak‘at Salah (prayer), speak of the greatness of Allah. Say, ‘Allahumma Salli ‘Ala Muhammad wa ‘Ali Muhammad (O Allah grant Muhammad and his family a compensation worthy of their serving Your cause). 5 After Salam say, ‘O Allah, I appeal before You, You are the Owner and the King and have power over all things. You are dominant and whatever You want it comes into existence. O Allah I turn to You through Your prophet, Muhammad, the prophet of mercy. O Muhammad, O Messenger of Allah, I turn to you before Allah, Your Cherisher and my Cherisher so that He makes my wish to come true. O Allah, through Your prophet, Muhammad, make my wish come true. 5 Then ask for your needs.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/463)"
        ],
        "index": 5647,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2366",
              "text": "أَبُو دَاوُدَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/196",
              "text": "فَضَالَةَ بْنِ أَيُّوبَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/165",
              "text": "مُعَاوِيَةَ بْنِ وَهْبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/191",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ أَبُو دَاوُدَ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ عَنْ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:95:8",
        "text": [
          " فِي الْأَمْرِ يَطْلُبُهُ الطَّالِبُ مِنْ رَبِّهِ قَالَ تَصَدَّقْ فِي يَوْمِكَ عَلَى سِتِّينَ مِسْكِيناً عَلَى كُلِّ مِسْكِينٍ صَاعٌ بِصَاعِ النَّبِيِّ ( صلى الله عليه وآله ) فَإِذَا كَانَ اللَّيْلُ اغْتَسَلْتَ فِي الثُّلُثِ الْبَاقِي وَ لَبِسْتَ أَدْنَى مَا يَلْبَسُ مَنْ تَعُولُ مِنَ الثِّيَابِ إِلَّا أَنَّ عَلَيْكَ فِي تِلْكَ الثِّيَابِ إِزَاراً ",
          "ثُمَّ تُصَلِّي رَكْعَتَيْنِ فَإِذَا وَضَعْتَ جَبْهَتَكَ فِي الرَّكْعَةِ الْأَخِيرِ لِلسُّجُودِ هَلَّلْتَ اللَّهَ وَ عَظَّمْتَهُ وَ قَدَّسْتَهُ وَ مَجَّدْتَهُ وَ ذَكَرْتَ ذُنُوبَكَ فَأَقْرَرْتَ بِمَا تَعْرِفُ مِنْهَا مُسَمًّى ثُمَّ رَفَعْتَ رَأْسَكَ ",
          "ثُمَّ إِذَا وَضَعْتَ رَأْسَكَ لِلسَّجْدَةِ الثَّانِيَةِ اسْتَخَرْتَ اللَّهَ مِائَةَ مَرَّةٍ اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ ثُمَّ تَدْعُو اللَّهَ بِمَا شِئْتَ وَ تَسْأَلُهُ إِيَّاهُ وَ كُلَّمَا سَجَدْتَ فَأَفْضِ بِرُكْبَتَيْكَ إِلَى الْأَرْضِ ثُمَّ تَرْفَعُ الْإِزَارَ حَتَّى تَكْشِفَهُمَا وَ اجْعَلِ الْإِزَارَ مِنْ خَلْفِكَ بَيْنَ أَلْيَتَيْكَ وَ بَاطِنِ سَاقَيْكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad and Abu Dawood, from Al-Husayn Bin Saeed, from Fazalat Bin Ayoub, from Muawiya Bin Wahab, from Zurara, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said regarding the matter sought by the seeker, from his Lord<sup>azwj</sup>, said: ‘Give charity during your day upon sixty poor ones, upon each poor one being one Sa’a (approx. 3kg.) of the Sa’a of the Prophet<sup>saww</sup>. So when it is the night-time, what during the remaining third (of the night) and wear the least one can wear from the clothes except that upon you, from those clothes, should be a loin cloth.",
            "Then you should pray two Rak’at of <span class=\"iTxt\">Salāt</span>. So when you place your forehead during the last Rak’at for the <span class=\"iTxt\">Sajdah</span>, you should Extol Allah<sup>azwj</sup>, and His<sup>azwj</sup> Magnificence, and His<sup>azwj</sup> Holiness, and His<sup>azwj</sup> Glory, and mention your sins, and acknowledge with what you recognise from these, specifically, then raise your head.",
            "When you place your head for the second <span class=\"iTxt\">Sajdah</span>, seek the Choice of Allah<sup>azwj</sup> one hundred times, ‘O Allah<sup>azwj</sup>! I seek Your<sup>saww</sup> Choice’. Then supplicate to Allah<sup>azwj</sup> with whatever you so desire to, and ask Him<sup>azwj</sup> of it; and every time you perform <span class=\"iTxt\">Sajdah</span>, so expose your knees to touch the ground, and secure the loincloth from behind between his legs’."
          ],
          "en.sarwar": [
            "8. A number of our people have narrated from Ahmad ibn Muhammad and abu Dawud from al-Husayn ibn SaTd from Fadalah ibn Ayyub from Mu‘awiyah ibn Wahab from Zurarah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that one who wishes that his Lord make his wish come true should feed sixty destitute people as an act of charity, one sa‘ (three kilograms), by the sa‘ of the Holy Prophet, of food per person. At night during the last third of the night, take a shower and dress in minimum form, except that it must have a loincloth. Then he should perform two Rak‘at Salah (prayer). When placing his forehead on the ground in the last sajdah of the last Rak‘at, he should say that no one, other than Allah, deserves worship, speak of His greatness, His Holiness, His glory and then remember his sins and confess, as much as he remembers, name them (one by one), committing them then raise his head. When he places his forehead on the ground for the second sajdah, he should ask Allah, one hundred times, to choose for him the best, saying, ‘O Allah, I ask You to choose for me the best.’ Then pray to Allah for whatever he wants. Whenever in sajdah he should expose his knees to touch the ground and secure the loincloth from behind between his legs.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/464)"
        ],
        "index": 5648,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/59",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/62",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/63",
              "text": "الْوَشَّاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/213",
              "text": "أَبَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/693",
              "text": "الْحَارِثِ بْنِ الْمُغِيرَةِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَبَانٍ عَنِ الْحَارِثِ بْنِ الْمُغِيرَةِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:95:9",
        "text": [
          " إِذَا كَانَتْ لَكَ حَاجَةٌ فَتَوَضَّأْ وَ صَلِّ رَكْعَتَيْنِ ثُمَّ احْمَدِ اللَّهَ وَ أَثْنِ عَلَيْهِ وَ اذْكُرْ مِنَ الْآيَةِ ثُمَّ ادْعُ تُجَبْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al-Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al-Washa, from Aban, from Al-Haris Bin Al-Mugheira, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When there is a need for you, so perform <span class=\"iTxt\">Wuzu</span> and pray two Rak’at of <span class=\"iTxt\">Salāt</span>. Then Praise Allah<sup>azwj</sup> and Laud upon Him<sup>azwj</sup>, and mention from the Verses (of the Holy Quran), you will be Answered’."
          ],
          "en.sarwar": [
            "9. Al-Husayn ibn Muhammad has narrated from Mu’alla’ ibn Muhammad from al-Washsha’ from Aban from al-Harith ibn al-Mughirah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If you need something, take Wudu’, perform two Rak‘at Salah (prayer) and then praise Allah, speak of His greatness and read of verses (of Quran), then ask for your needs, your prayer will be answered.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/464)"
        ],
        "index": 5649,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/301",
              "text": "ثَعْلَبَةَ بْنِ مَيْمُونٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/693",
              "text": "الْحَارِثِ بْنِ الْمُغِيرَةِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنِ الْحَارِثِ بْنِ الْمُغِيرَةِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:95:10",
        "text": [
          " إِذَا أَرَدْتَ حَاجَةً فَصَلِّ رَكْعَتَيْنِ وَ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ سَلْ تُعْطَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Fazzal, from Sa’alba Bin Maymoun, from Al-Haris Bin Al-Mugheira, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whenever you want a need, so pray two Rak’at of <span class=\"iTxt\">Salāt</span>, and send Blessings upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and ask, you would be Given it’."
          ],
          "en.sarwar": [
            "10. A number of our people have narrated from Ahmad ibn Muhammad from ibn Faddal from Tha’labah ibn Maymun from al-Flarith ibn al-Mughirah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If you need something, perform two Rak‘at Salah (prayer) and say, “Allahumma Salli ‘Ala Muhammad wa ‘Ali Muhammad (O Allah grant Muhammad and his family a compensation worthy of their serving Your cause).” Ask for your needs. They will be fulfilled.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/464)"
        ],
        "index": 5650,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/270",
              "text": "عُمَرَ بْنِ عَبْدِ الْعَزِيزِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/152",
              "text": "جَمِيلٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ جَمِيلٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:95:11",
        "text": [
          " كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَدَخَلَتْ عَلَيْهِ امْرَأَةٌ وَ ذَكَرَتْ أَنَّهَا تَرَكَتِ ابْنَهَا وَ قَدْ قَالَتْ بِالْمِلْحَفَةِ عَلَى وَجْهِهِ مَيِّتاً فَقَالَ لَهَا لَعَلَّهُ لَمْ يَمُتْ فَقُومِي فَاذْهَبِي إِلَى بَيْتِكِ فَاغْتَسِلِي وَ صَلِّي رَكْعَتَيْنِ وَ ادْعِي وَ قُولِي ",
          "يَا مَنْ وَهَبَهُ لِي وَ لَمْ يَكُ شَيْئاً جَدِّدْ هِبَتَهُ لِي ثُمَّ حَرِّكِيهِ وَ لَا تُخْبِرِي بِذَلِكِ أَحَداً قَالَتْ فَفَعَلْتُ فَحَرَّكْتُهُ فَإِذَا هُوَ قَدْ بَكَى ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Umar Bin Abdul Aziz, from Jameel who said, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup>, so a woman came over to him<sup>asws</sup> and she mentioned that she had neglected her son and she had said, ‘With a quilt upon his face, dead’. So he<sup>asws</sup> said to her: ‘Perhaps he did not die. Therefore, arise and go to your house, wash and pray two Rak’at of <span class=\"iTxt\">Salāt</span> and supplicate, and say,",
            "‘O the One Who Endowed him to me when there was nothing, Renew the Endowment to me’. Then move him, and do not inform anyone with that’. She said, ‘So I did it, and moved him, so there he was, crying’."
          ],
          "en.sarwar": [
            "11. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ‘Umar ibn ‘Abd al-‘Aziz from Jamil who has said the following: “I was in the presence of abu ‘Abd Allah, ‘Alayhi al-Salam, when a woman came to him saying, ‘I left my son dead; I had thrown a comforter on his face.’ The Imam said to her, ‘Perhaps he is not dead. Go back to your home, take a shower, perform two Rak‘at Salah (prayer), pray and say, “O the One who gave him to me as a gift when he was not anything, please renew Your gift for me,” then move him and do not tell anyone about it.’ She has said, ‘I followed the instruction and moved him and he began to cry.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:4:95",
  "kind": "verse_list"
}