{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 99"
        },
        "path": "/books/al-kafi:3:4:99",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب صَلَاةِ مَنْ أَرَادَ</span> أَنْ يَدْخُلَ بِأَهْلِهِ وَ مَنْ أَرَادَ أَنْ يَتَزَوَّجَ",
          "en": "Chapter 99 – Salāt of the one who intends to sleep with his wife, and the one who intends to get married"
        }
      }
    ],
    "index": 766,
    "local_index": 99,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 100"
        },
        "path": "/books/al-kafi:3:4:100",
        "titles": {
          "ar": "باب النَّوَادِرِ",
          "en": "Chapter 100 – The Miscellaneous"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 98"
        },
        "path": "/books/al-kafi:3:4:98",
        "titles": {
          "ar": "باب صَلَاةِ الشُّكْرِ",
          "en": "Chapter 98 – Salāt of gratefulness"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:3:4",
        "titles": {
          "ar": "كِتَابُ الصَّلَاةِ",
          "en": "<a id=\"_Toc452651240\"></a>THE BOOK OF SALĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:4:99",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب صَلَاةِ مَنْ أَرَادَ</span> أَنْ يَدْخُلَ بِأَهْلِهِ وَ مَنْ أَرَادَ أَنْ يَتَزَوَّجَ",
      "en": "Chapter 99 – Salāt of the one who intends to sleep with his wife, and the one who intends to get married"
    },
    "verse_count": 3,
    "verse_start_index": 5654,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/466)"
        ],
        "index": 5655,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "جَمِيلِ بْنِ صَالِحٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ أَبِي بَصِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:99:1",
        "text": [
          " سَمِعْتُ رَجُلًا وَ هُوَ يَقُولُ لِأَبِي جَعْفَرٍ ( عليه السلام ) جُعِلْتُ فِدَاكَ إِنِّي رَجُلٌ قَدْ أَسْنَنْتُ وَ قَدْ تَزَوَّجْتُ امْرَأَةً بِكْراً صَغِيرَةً وَ لَمْ أَدْخُلْ بِهَا وَ أَنَا أَخَافُ إِذَا أَدْخُلُ بِهَا عَلَى فِرَاشِي أَنْ تَكْرَهَنِي لِخِضَابِي وَ كِبَرِي ",
          "فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) إِذَا دَخَلْتَ فَمُرْهُمْ قَبْلَ أَنْ تَصِلَ إِلَيْكَ أَنْ تَكُونَ مُتَوَضِّئَةً ثُمَّ أَنْتَ لَا تَصِلُ إِلَيْهَا حَتَّى تَتَوَضَّأَ وَ تُصَلِّيَ رَكْعَتَيْنِ ثُمَّ مَجِّدِ اللَّهَ وَ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ ثُمَّ ادْعُ اللَّهَ وَ مُرْ مَنْ مَعَهَا أَنْ يُؤَمِّنُوا عَلَى دُعَائِكَ وَ ",
          "قُلِ اللَّهُمَّ ارْزُقْنِي إِلْفَهَا وَ وُدَّهَا وَ رِضَاهَا وَ رَضِّنِي بِهَا ثُمَّ اجْمَعْ بَيْنَنَا بِأَحْسَنِ اجْتِمَاعٍ وَ أَسَرِّ ائْتِلَافٍ فَإِنَّكَ تُحِبُّ الْحَلَالَ وَ تَكْرَهُ الْحَرَامَ",
          "ثُمَّ قَالَ وَ اعْلَمْ أَنَّ الْإِلْفَ مِنَ اللَّهِ وَ الْفِرْكَ مِنَ الشَّيْطَانِ لِيُكَرِّهَ مَا أَحَلَّ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Mahboub, from Jameel Bin Salih, from Abu Baseer who said, ",
            "‘I heard a man and he was saying to Abu Ja’far<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! I am a man who has aged, and I have married a young virgin and have not slept with her, and I fear that when I do sleep with her upon my bed, she would dislike me due to my (hair) dye and my old age’. ",
            "So Abu Ja’far<sup>asws</sup> said: ‘When you go over, so instruct them before they send her to you that she should happen to be in <span class=\"iTxt\">Wuzu</span>, then you (as well) should not go to her until you have performed <span class=\"iTxt\">Wuzu</span>; and you should pray two Rak’at of <span class=\"iTxt\">Salāt</span>, then Glorify Allah<sup>azwj</sup>, and send Blessings upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>. Then supplicate to Allah<sup>azwj</sup> and instruct the one who is with her than she should say ‘Ameen’ upon your supplication, and say, ",
            "‘O Allah<sup>azwj</sup>! Grace me her kindness, and her cordiality, and her pleasure, and my pleasure with her. Then Gather between us with the best of the gathering, and the most joyful of the coalitions, for You<sup>azwj</sup> Love the Permissible and You<sup>azwj </sup>Dislike the Prohibited’. ",
            "Then he<sup>asws</sup> said: ‘And know, that the union is from Allah<sup>azwj</sup> and the separation is from the Satan<sup>la</sup> , (so people) abhor that which Allah<sup>azwj</sup> has Permitted’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from ibn Mahbub from Jamil ibn Salih from abu Basir who has said the following: “I heard a man saying to abu Ja‘far, ‘Alayhi al-Salam, ‘I pray to Allah to keep my soul in service for your cause, I am an aged man. I have married a virgin young woman. I have not gone to bed with her yet. I am afraid in bed that on finding me of such age and the dye on my beard she may dislike me.’ Abu Ja’far, ‘Alayhi al-Salam, said, ‘When you are there, ask her before approaching you to take Wudu’. You also, should not approach her before taking Wudu’ and performing two Rak‘at Salah (prayer). Thereafter, speak of glory of Allah and say, “Allahumma Salli ‘Ala Muhammad wa ‘Ali Muhammad (O Allah grant Muhammad and his family a compensation worthy of their serving Your cause).” Thereafter ask her and others present with her to say A’ min (O Allah grant his wishes). Thereafter say, “O Lord, provide her enough reasons to be kind to me, love me and be happy with me and grant me enough reason to be happy with her, bring us together in the best form of gathering, and the happiest kindness; You love lawfulness and dislike unlawfulness.’” The Imam then said, ‘You must bear in mind that kindness comes from Allah and hate comes from Satan so that people dislike what Allah has made lawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/467)"
        ],
        "index": 5656,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/158",
              "text": "وَ بِهَذَا الْإِسْنَادِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/442",
              "text": "الْقَاسِمِ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/443",
              "text": "جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِهَذَا الْإِسْنَادِ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْقَاسِمِ بْنِ يَحْيَى عَنْ جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ أَبِي بَصِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:99:2",
        "text": [
          " قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا تَزَوَّجَ أَحَدُكُمْ كَيْفَ يَصْنَعُ قُلْتُ لَا أَدْرِي قَالَ إِذَا هَمَّ بِذَلِكَ فَلْيُصَلِّ رَكْعَتَيْنِ وَ يَحْمَدُ اللَّهَ ثُمَّ يَقُولُ ",
          "اللَّهُمَّ إِنِّي أُرِيدُ أَنْ أَتَزَوَّجَ فَقَدِّرْ لِي مِنَ النِّسَاءِ أَعَفَّهُنَّ فَرْجاً وَ أَحْفَظَهُنَّ لِي فِي نَفْسِهَا وَ فِي مَالِي وَ أَوْسَعَهُنَّ رِزْقاً وَ أَعْظَمَهُنَّ بَرَكَةً وَ قَدِّرْ لِي وَلَداً طَيِّباً تَجْعَلُهُ خَلَفاً صَالِحاً فِي حَيَاتِي وَ بَعْدَ مَمَاتِي ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Ahmad Bin Muhammad, from Al-Qasim Bin Yahya, from his grandfather Al-Hassan Bin Rashid, from Abu Baseer who said, ",
            "‘Abu Abdullah<sup>asws</sup> said to me: ‘Whenever one of you (wants to) gets married how does he do it?’ I said, ‘I don’t know’. He<sup>asws</sup> said: ‘When he thinks of that, so let him pray two Rak’at of <span class=\"iTxt\">Salāt</span>, and he should Praise Allah<sup>azwj</sup>, then he should be saying, ",
            "‘O Allah<sup>azwj</sup>! I intend to get married, so Ordain for me from the women, the one who is the most preserving of her private part, and the most protective for me with regards to herself, and regarding my wealth, and one of extensive sustenance, and the greatest of Blessings; and Ordain for me a good child making him to be a righteous successor during my lifetime and after my death’."
          ],
          "en.sarwar": [
            "2. Through the same chain of narrators as that of the previous Hadith from Ahmad ibn Muhammad from al-Qasim ibn Yahya from his grandfather, al-Hassan ibn Rashid from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, once said to me, ‘When anyone of you likes to get married, what does he need to do?’ I replied, ‘I do not know.’ The Imam then said, ‘When one of you has such intention, he should first perform two Rak‘at Salah (prayer) and praise Allah. Thereafter, say, “O Allah, I like to become married. Determine for me of women the most protective of her privacy, the most chaste in conjugal matters, protective of myself and my property and of a vast share of sustenance, of the greatest in blessing, and determine for me a fine son who will succeed me as a virtuous one in my lifetime and when I die.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/467)"
        ],
        "index": 5657,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/150",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/135",
              "text": "رَجُلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ رَجُلٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:4:99:3",
        "relations": {
          "Mentions": [
            "/books/quran:21:89"
          ]
        },
        "text": [
          " مَنْ أَرَادَ أَنْ يُحْبَلَ لَهُ فَلْيُصَلِّ رَكْعَتَيْنِ بَعْدَ الْجُمُعَةِ يُطِيلُ فِيهِمَا الرُّكُوعَ وَ السُّجُودَ ثُمَّ يَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ بِمَا سَأَلَكَ بِهِ زَكَرِيَّا إِذْ قَالَ.",
          "رَبِّ لَا تَذَرْنِي فَرْداً وَ أَنْتَ خَيْرُ الْوَارِثِينَ اللَّهُمَّ هَبْ لِي ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاءِ اللَّهُمَّ بِاسْمِكَ اسْتَحْلَلْتُهَا وَ فِي أَمَانَتِكَ أَخَذْتُهَا فَإِنْ قَضَيْتَ فِي رَحِمِهَا وَلَداً فَاجْعَلْهُ غُلَاماً وَ لَا تَجْعَلْ لِلشَّيْطَانِ فِيهِ نَصِيباً وَ لَا شِرْكاً"
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al-Hakam, from a man, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The one who wants that there should be a pregnancy for him, so let him pray two Rak’at of <span class=\"iTxt\">Salāt</span> after the Friday, prolonging in these two (Rak’at), the <span class=\"iTxt\">Rukū</span> and the <span class=\"iTxt\">Sajud (plural of Sajdah)</span>. Then he should be saying, ",
            "‘O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> with what Zakariyya<sup>as</sup> had asked with when he<sup>as</sup> said<span class=\"ibTxt\"> <a href=\"/#/books/quran:21#h89\">[21:89]</a> Lord! Do not leave me alone; and You are the Best of inheritors</span>. O Allah<sup>azwj</sup>! Gift unto me a goodly child, You<sup>azwj</sup> are the Hearer of the supplication. O Allah<sup>azwj</sup>! By Your<sup>azwj</sup> Name I have made her Permissible, and in Your<sup>azwj</sup> Safety I take her. So if You<sup>azwj</sup> were to Judge a child for in her womb, so Make it to be a boy, and do not Make in it a share for the Satan<sup>la</sup>, nor a participation’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from a man from Muhammad ibn Muslim who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘If one wants that his wife become pregnant, he should perform two Rak‘at Salah (prayer) after Friday Salah (prayer). In this Salah (prayer) he should prolong his Ruku‘ and sajdah and then say, “O Allah, I ask You just what Zachariah asked You for, O my Lord, (rabbi) do not leave me lonely (childless) while You are the best heir. O Allah, grant me virtuous offspring. You hear (all prayers and appeals). O Allah through Your name she has become lawful for me and as Your trust, I have taken her as my wife. If You will decree a child in her womb, please make the child to be a righteous (honorable one, an intelligent) son and do not allow Satan to have a part or share in him.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:4:99",
  "kind": "verse_list"
}