{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 9"}, "path": "/books/al-kafi:6:9", "titles": {"ar": "كتاب الدَّوَاجِنِ", "en": "THE BOOK OF DOMESTIC ANIMALS"}}, {"indexed_titles": {"en": "Chapter 11"}, "path": "/books/al-kafi:6:9:11", "titles": {"ar": "باب الْفَاخِتَةِ وَ الصُّلْصُلِ", "en": "Chapter 11 – Al-Fakhta and Al-Sulsul (types of ring-doves)"}}], "index": 1976, "local_index": 11, "part_type": "Chapter", "path": "/books/al-kafi:6:9:11", "titles": {"ar": "باب الْفَاخِتَةِ وَ الصُّلْصُلِ", "en": "Chapter 11 – Al-Fakhta and Al-Sulsul (types of ring-doves)"}, "verse_count": 3, "verse_start_index": 12932, "verses": [{"index": 12933, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:9:11:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَتْ فِي دَارِ أَبِي جَعْفَرٍ ( عليه السلام ) فَاخِتَةٌ فَسَمِعَهَا يَوْماً وَ هِيَ تَصِيحُ فَقَالَ لَهُمْ أَ تَدْرُونَ مَا تَقُولُ هَذِهِ الْفَاخِتَةُ قَالُوا لَا قَالَ تَقُولُ فَقَدْتُكُمْ فَقَدْتُكُمْ ثُمَّ قَالَ لَنَفْقِدَنَّهَا قَبْلَ أَنْ تَفْقِدَنَا ثُمَّ أَمَرَ بِهَا فَذُبِحَتْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, form Hafs Bin Al Bakhtary, from a man, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There used to be in the house of Abu Ja’far<sup>asws</sup>, a <span class=\"iTxt\">Fakhta</span>, so he<sup>asws</sup> heard it one days and it was shrieking. So he<sup>asws</sup> said to them: ‘Do you all know what it this <span class=\"iTxt\">Fakhta</span> is saying?’ They said, ‘No’. He<sup>asws</sup> said: ‘It is saying, ‘You are all lost, you are all lost!’ Then he<sup>asws</sup> said: ‘We<sup>asws</sup> will lose it before it loses us<sup>asws</sup>’. Then he<sup>asws</sup> ordered for it to be slaughtered’."}]}, {"index": 12934, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:9:11:2", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ بَكْرِ بْنِ صَالِحٍ عَنْ مُحَمَّدِ بْنِ أَبِي حَمْزَةَ عَنْ عُثْمَانَ الْأَصْبَهَانِيِّ قَالَ أَهْدَيْتُ إِلَى إِسْمَاعِيلَ بْنِ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) صُلْصُلًا فَدَخَلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَلَمَّا رَآهَا قَالَ هَذَا الطَّيْرَ الْمَشُومَ أَخْرِجُوهُ فَإِنَّهُ يَقُولُ فَقَدْتُكُمْ فَقَدْتُكُمْ فَافْقِدُوهُ قَبْلَ أَنْ يَفْقِدَكُمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Bakr Bin Salih, from Muhammad Bin Ab Hamza, from Usman Al Asbahany who said, \n‘I gifted a <span class=\"iTxt\">Sulsula</span> to Ismail, son of Abu Abdullah<sup>asws</sup>. So Abu Abdullah<sup>asws</sup> came over, and when he<sup>asws</sup> saw it, said: ‘This is the inauspicious bird. Exit it, for it is saying, ‘You are all lost, you are all lost!’ Therefore lose it before it loses you all’."}]}, {"index": 12935, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:6:9:11:3", "text": "عَنْهُ عَنِ الْجَامُورَانِيِّ عَنِ ابْنِ أَبِي حَمْزَةَ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي بَصِيرٍ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( صلوات الله عليه ) فَقَالَ لِي يَا أَبَا مُحَمَّدٍ اذْهَبْ بِنَا إِلَى إِسْمَاعِيلَ نَعُودُهُ وَ كَانَ شَاكِياً فَقُمْنَا وَ دَخَلْنَا عَلَى إِسْمَاعِيلَ فَإِذَا فِي مَنْزِلِهِ فَاخِتَةٌ فِي قَفَصٍ تَصِيحُ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا بُنَيَّ مَا يَدْعُوكَ إِلَى إِمْسَاكِ هَذِهِ الْفَاخِتَةِ أَ وَ مَا عَلِمْتَ أَنَّهَا مَشُومَةٌ أَ وَ مَا تَدْرِي مَا تَقُولُ قَالَ إِسْمَاعِيلُ لَا قَالَ إِنَّمَا تَدْعُو عَلَى أَرْبَابِهَا فَتَقُولُ فَقَدْتُكُمْ فَقَدْتُكُمْ فَأَخْرِجُوهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "From him, from Al Jamourany, from Ibn Abu Hamza, from Sayf Bin Ameyra, from Is’haq Bin Ammar, from Abu Baseer who said, \n‘I went over to Abu Abdullah<sup>asws</sup>, so he<sup>asws</sup> said to me: ‘O Abu Muhammad! Come with us to Ismail to visit him, and he has been complaining’. So we arose and went over to Ismail, so there was a <span class=\"iTxt\">Fakhta</span> in a cage in his house, shrieking’. So Abu Abdullah<sup>asws</sup> said: ‘O my<sup>asws</sup> son! What called you to keep this <span class=\"iTxt\">Fakhta</span>, or do you not know that it is inauspicious, or do you not know what it is saying?’ Ismail said, ‘No’. He<sup>asws</sup> said: ‘But rather it is supplicating against its owners, ‘You are lost, you are lost! Therefore exit it’."}]}]}, "index": "al-kafi:6:9:11", "kind": "verse_list"}