{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 1"
        },
        "path": "/books/al-kafi:1:4:1",
        "titles": {
          "ar": "بَابُ الِاضْطِرَارِ إِلَى الْحُجَّةِ",
          "en": "Chapter 1 – The desperate need to the Divine Authority"
        }
      }
    ],
    "index": 59,
    "local_index": 1,
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:1",
    "titles": {
      "ar": "بَابُ الِاضْطِرَارِ إِلَى الْحُجَّةِ",
      "en": "Chapter 1 – The desperate need to the Divine Authority"
    },
    "verse_count": 5,
    "verse_start_index": 427,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/256)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 428,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:1:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ق</span>َالَ أَبُو جَعْفَرٍ</span> مُحَمَّدُ بْنُ يَعْقُوبَ الْكُلَيْنِيُّ مُصَنِّفُ هَذَا الْكِتَابِ رَحِمَهُ اللَّهُ حَدَّثَنَا عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْعَبَّاسِ بْنِ عُمَرَ الْفُقَيْمِيِّ عَنْ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ لِلزِّنْدِيقِ الَّذِي سَأَلَهُ مِنْ أَيْنَ أَثْبَتَّ الْأَنْبِيَاءَ وَ الرُّسُلَ قَالَ إِنَّا لَمَّا أَثْبَتْنَا أَنَّ لَنَا خَالِقاً صَانِعاً مُتَعَالِياً عَنَّا وَ عَنْ جَمِيعِ مَا خَلَقَ وَ كَانَ ذَلِكَ الصَّانِعُ حَكِيماً مُتَعَالِياً لَمْ يَجُزْ أَنْ يُشَاهِدَهُ خَلْقُهُ وَ لَا يُلَامِسُوهُ فَيُبَاشِرَهُمْ وَ يُبَاشِرُوهُ وَ يُحَاجَّهُمْ وَ يُحَاجُّوهُ ثَبَتَ أَنَّ لَهُ سُفَرَاءَ فِي خَلْقِهِ يُعَبِّرُونَ عَنْهُ إِلَى خَلْقِهِ وَ عِبَادِهِ وَ يَدُلُّونَهُمْ عَلَى مَصَالِحِهِمْ وَ مَنَافِعِهِمْ وَ مَا بِهِ بَقَاؤُهُمْ وَ فِي تَرْكِهِ فَنَاؤُهُمْ ",
          "فَثَبَتَ الْآمِرُونَ وَ النَّاهُونَ عَنِ الْحَكِيمِ الْعَلِيمِ فِي خَلْقِهِ وَ الْمُعَبِّرُونَ عَنْهُ جَلَّ وَ عَزَّ وَ هُمُ الْأَنْبِيَاءُ ( عليهم السلام ) وَ صَفْوَتُهُ مِنْ خَلْقِهِ حُكَمَاءَ مُؤَدَّبِينَ بِالْحِكْمَةِ مَبْعُوثِينَ بِهَا غَيْرَ مُشَارِكِينَ لِلنَّاسِ عَلَى مُشَارَكَتِهِمْ لَهُمْ فِي الْخَلْقِ وَ التَّرْكِيبِ فِي شَيْ‏ءٍ مِنْ أَحْوَالِهِمْ مُؤَيَّدِينَ مِنْ عِنْدِ الْحَكِيمِ الْعَلِيمِ بِالْحِكْمَةِ ",
          "ثُمَّ ثَبَتَ ذَلِكَ فِي كُلِّ دَهْرٍ وَ زَمَانٍ مِمَّا أَتَتْ بِهِ الرُّسُلُ وَ الْأَنْبِيَاءُ مِنَ الدَّلَائِلِ وَ الْبَرَاهِينِ لِكَيْلَا تَخْلُوَ أَرْضُ اللَّهِ مِنْ حُجَّةٍ يَكُونُ مَعَهُ عِلْمٌ يَدُلُّ عَلَى صِدْقِ مَقَالَتِهِ وَ جَوَازِ عَدَالَتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "<span style=\"font-size: small\">Abu Ja’far Muhammad Bin Yaqoub Al Kulayni</span><sup>ra</sup><span style=\"font-size: small\">, author of this book, said, ‘Ali Bin Ibrahim narrated to us, from his father, from Al Abbas Bin Umar Al Fuqaymi, from Hisham Bin Al Hakam, </span>",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said to the atheist who had asked him<sup>asws</sup>, ‘From where are the Prophets<sup>as</sup> and the Rasools<sup>as</sup> proved?’ He<sup>asws</sup> said: ‘We<sup>asws</sup>, when we<sup>asws</sup> proved that for us there is a Creator, a Maker, Exalted for us and for the entirety of what He<sup>azwj</sup> Created, and that was the Maker, Wise, Exalted, it is not allowed that His<sup>azwj</sup> creatures should witness Him<sup>azwj</sup>, nor touch Him<sup>azwj</sup>, so He<sup>azwj</sup> would Communicate with them and they would communicate with Him<sup>azwj</sup> directly, and He<sup>azwj</sup> would Argue with them and they would argue with Him<sup>azwj</sup> directly, it proves that for Him<sup>azwj</sup> there are ambassadors among His<sup>azwj</sup> creatures who are expressing on His<sup>azwj</sup> behalf to His<sup>azwj</sup> creatures and are indicating them upon their correction and their benefits and what would be their remaining with it, and with regards to its neglecting, so they are forbidding them.",
            "Thus, it proves (the presence of) the enjoiners and the forbidders on behalf of the Wise, the Knowing, among His<sup>azwj</sup> creatures, and the expressers from Him<sup>azwj</sup> Majestic and Mighty, and they<sup>as</sup> are the Prophets<sup>as</sup> and His<sup>azwj</sup> Elites<sup>asws</sup> from His<sup>azwj</sup> creatures, the wise ones, disciplined with the Wisdom, been Sent with it, without a participation with the people upon their<sup>as</sup> participation, for them<sup>asws</sup> among the creatures, and the implementation regarding something from their states, being supporters from the Presence of the Wise, the Knowing.",
            "Then it proves that in every era and time, from what the Rasools<sup>as</sup> and the Prophets<sup>as</sup> came with, from the evidences and the proofs lest the earth of Allah<sup>azwj</sup> be empty from a Divine Authority who happens to have knowledge with him<sup>asws</sup> indicating upon the truthfulness of his<sup>asws</sup> speech and authorisation of his<sup>asws</sup> justice’."
          ],
          "en.sarwar": [
            " 1. Ali ibn Ibrahim has narrated from his father from al-‘Abbass ibn ‘Umar al-Qummi from Hisham ibn al-Hakam from abu ‘Abdallah (a.s.) the following. “An atheist asked the Imam (a.s.), ‘How do you prove the truthfulness of the prophets and the messengers?’” The Imam (a.s.) said, “It is a fact that we have established with sufficient evidence the existence of our Creator, the Most Holy, the Most High and Exalted above all creatures. It is a fact that this Creator is All wise and Most High. His creatures can not see, touch, associate and directly communicate with Him. It proves that His deputies must be present among His creatures. It is His deputies and ambassadors who speak to people for Him and provide them guidance to protect their interests, to tell them what is beneficial to them and what are the best means of survival and what may cause their destruction. This proves the presence among people of those who conveys the commandments of the Creator, Who is All wise and All knowing Allah, the Most Holy, the Most High, to people. Such people are the prophet (a.s.) the chosen ones from among His creatures. They are the people of wisdom, disciplined with wisdom and sent to people with the message of wisdom. They are different from other people - although are like them in physical form and shape - in their conditions of discipline and their receiving direct support from Allah, the Most Holy, the Most High and All-Wise. This also proves their presence among people in all times to ensure the availability of the people with Divine authority who would have the kind of knowledge that would establish their truthfulness and trustworthiness.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (262/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 429,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:1:2",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مَنْصُورِ بْنِ حَازِمٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ اللَّهَ أَجَلُّ وَ أَكْرَمُ مِنْ أَنْ يُعْرَفَ بِخَلْقِهِ بَلِ الْخَلْقُ يُعْرَفُونَ بِاللَّهِ قَالَ صَدَقْتَ",
          "قُلْتُ إِنَّ مَنْ عَرَفَ أَنَّ لَهُ رَبّاً فَيَنْبَغِي لَهُ أَنْ يَعْرِفَ أَنَّ لِذَلِكَ الرَّبِّ رِضًا وَ سَخَطاً وَ أَنَّهُ لَا يُعْرَفُ رِضَاهُ وَ سَخَطُهُ إِلَّا بِوَحْيٍ أَوْ رَسُولٍ فَمَنْ لَمْ يَأْتِهِ الْوَحْيُ فَقَدْ يَنْبَغِي لَهُ أَنْ يَطْلُبَ الرُّسُلَ فَإِذَا لَقِيَهُمْ عَرَفَ أَنَّهُمُ الْحُجَّةُ وَ أَنَّ لَهُمُ الطَّاعَةَ الْمُفْتَرَضَةَ ",
          "وَ قُلْتُ لِلنَّاسِ تَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ هُوَ الْحُجَّةَ مِنَ اللَّهِ عَلَى خَلْقِهِ قَالُوا بَلَى قُلْتُ فَحِينَ مَضَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ كَانَ الْحُجَّةَ عَلَى خَلْقِهِ فَقَالُوا الْقُرْآنُ",
          "فَنَظَرْتُ فِي الْقُرْآنِ فَإِذَا هُوَ يُخَاصِمُ بِهِ الْمُرْجِئُ وَ الْقَدَرِيُّ وَ الزِّنْدِيقُ الَّذِي لَا يُؤْمِنُ بِهِ حَتَّى يَغْلِبَ الرِّجَالَ بِخُصُومَتِهِ فَعَرَفْتُ أَنَّ الْقُرْآنَ لَا يَكُونُ حُجَّةً إِلَّا بِقَيِّمٍ فَمَا قَالَ فِيهِ مِنْ شَيْ‏ءٍ كَانَ حَقّاً ",
          "فَقُلْتُ لَهُمْ مَنْ قَيِّمُ الْقُرْآنِ فَقَالُوا ابْنُ مَسْعُودٍ قَدْ كَانَ يَعْلَمُ وَ عُمَرُ يَعْلَمُ وَ حُذَيْفَةُ يَعْلَمُ قُلْتُ كُلَّهُ قَالُوا لَا فَلَمْ أَجِدْ أَحَداً يُقَالُ إِنَّهُ يَعْرِفُ ذَلِكَ كُلَّهُ إِلَّا عَلِيّاً ( عليه السلام ) وَ إِذَا كَانَ الشَّيْ‏ءُ بَيْنَ الْقَوْمِ فَقَالَ هَذَا لَا أَدْرِي وَ قَالَ هَذَا لَا أَدْرِي وَ قَالَ هَذَا لَا أَدْرِي وَ قَالَ هَذَا أَنَا أَدْرِي فَأَشْهَدُ أَنَّ عَلِيّاً ( عليه السلام ) كَانَ قَيِّمَ الْقُرْآنِ وَ كَانَتْ طَاعَتُهُ مُفْتَرَضَةً وَ كَانَ الْحُجَّةَ عَلَى النَّاسِ بَعْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ أَنَّ مَا قَالَ فِي الْقُرْآنِ فَهُوَ حَقٌّ فَقَالَ رَحِمَكَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazan, from Safwan Bin Yahya, from Mansour Bin Hazim who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Allah<sup>azwj</sup> is more Majestic and more Benevolent than that He<sup>azwj</sup> should be recognised by His<sup>azwj</sup> creatures. But, the creatures are being recognised by Allah<sup>azwj</sup>’. He<sup>asws</sup> said: ‘You speak the truth’. ",
            "I said, ‘The one who recognises that there is a Lord<sup>azwj</sup> for him, so it is befitting for him that he recognises that for that Lord<sup>azwj</sup>, there is Pleasure and Anger, and that he (himself) would not recognise His<sup>azwj</sup> Pleasure and His<sup>azwj</sup> Anger except by a Revelation or by a Rasool<sup>saww</sup>. So the one to whom the Revelation does not come, so it would be befitting for him that he seeks the Rasools<sup>as</sup>, and when he meets up with them<sup>as</sup>, he should recognise that he<sup>as</sup> is the Divine Authority and that there is an obedience to them<sup>as</sup>, the Necessitated obedience.",
            "And I said to the people, ‘Do you know that Rasool-Allah<sup>saww</sup> was the Divine Authority from Allah<sup>azwj</sup> upon His<sup>azwj</sup> creatures?’ They said, ‘Yes’. I said, ‘So when Rasool-Allah<sup>saww</sup> passed away, who was the Divine Authority upon His<sup>azwj</sup> creatures?’ So they said, ‘The Quran’. ",
            "So I looked into the Quran, so it was such what the Murjiites, and the Qadiriyya were debating with, and (even) the atheists who do not believe in it, to the extent that they overcome the men by debating with it. So I recognised that the Quran cannot happen to be a Divine Authority except by a custodian, so he<sup>asws</sup> would not say anything with regards to it except that it would be true. ",
            "So I said to them, ‘Who is the custodian of the Quran?’ So they said, ‘Ibn Masoud. He had known, and Umar knew, and Huzayfa knew’. I said, ‘(They knew) all of it?’ They said, ‘No’. So I did not find anyone who could say that he knew all of that except for Ali<sup>asws</sup>. And whenever there was something between the people, so this one said, ‘I don’t know’, and this one said, ‘I don’t know’, and this one said, ‘I<sup>asws</sup> do know’. So I testify that Ali<sup>asws</sup> was the custodian of the Quran, and that obedience to him<sup>asws</sup> was a necessity, and he<sup>asws</sup> was the Divine Authority upon the people after Rasool-Allah<sup>saww</sup>, and that whatever he<sup>asws</sup> said regarding the Quran, so it is true’. So he<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> have Mercy on you’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya from Mansur ibn Hazim who has said the following. “I said to Imam abu ‘Abdallah (a.s.), ‘Allah by far above Majestic and Gracious to be known through His creatures. In fact, the creatures are known through Allah.’” The Imam (a.s.) said, “You have spoken the truth.” I said, “One who knows that he has a Lord, he must also learn that his Lord agrees with certain things and disagrees with certain other things. The only way he would know what his like and dislikes is revelation or a messenger. On e does not receive revelation he must find the messengers and when finds the messengers he will know that they the Divine authority and that obedience to them is necessary. I say to people, “Do you know that the messenger of Allah was the Divine authority over His creatures?” They say, “Yes, he was the Divine authority.” I then ask, “After the messenger of Allah who was the Divine authority over His creatures?” They said, “After the messenger of Allah the Divine authority is the Holy Quran.” I considered the Holy Quran and found out that various kinds of people consider this Holy Book as support for their beliefs. For example the Murji’a (people who say Allah has postponed punishment), the pre-determinists and the atheist who even do not believe in it but take it as the basis for their arguments against the others. I then learned that the Holy Quran can not serve as Divine authority without a guardian whose words from the Holy Quran would be the truth. I then ask the people, “Who is the guardian of the Holy Quran?” They say, “Ibn Mas‘ud knew the Holy Quran, ‘Umar knew it and Hudhayfa knew the Holy Quran.” I ask them, “Did they know all of the Holy Quran?” The people say, “No, they did not know all of it.” I have not found anyone who would know all of the Holy Quran except Ali ibn abu Talib (a.s.). It is a fact that if any issue would emerge that needed a Quranic solution, except for Imam Ali (a.s.) every one of the others would, in many cases, say, “I do not know.” Only Imam Ali (a.s.) would say, “I know.” I then acknowledge that Imam Ali (a.s.) is the guardian of the Holy Quran and obedience to him is obligatory and he is the Divine authority over the people after the Holy Prophet (s.a.). Whatever Imam Ali (a.s.) has said from the Holy Quran is the truth.” The Imam (a.s.) said, “May Allah grant you blessing.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/265)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 430,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:1:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ إِبْرَاهِيمَ عَنْ يُونُسَ بْنِ يَعْقُوبَ قَالَ كَانَ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) جَمَاعَةٌ مِنْ أَصْحَابِهِ مِنْهُمْ حُمْرَانُ بْنُ أَعْيَنَ وَ مُحَمَّدُ بْنُ النُّعْمَانِ وَ هِشَامُ بْنُ سَالِمٍ وَ الطَّيَّارُ وَ جَمَاعَةٌ فِيهِمْ هِشَامُ بْنُ الْحَكَمِ وَ هُوَ شَابٌّ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا هِشَامُ أَ لَا تُخْبِرُنِي كَيْفَ صَنَعْتَ بِعَمْرِو بْنِ عُبَيْدٍ وَ كَيْفَ سَأَلْتَهُ فَقَالَ هِشَامٌ يَا ابْنَ رَسُولِ اللَّهِ إِنِّي أُجِلُّكَ وَ أَسْتَحْيِيكَ وَ لَا يَعْمَلُ لِسَانِي بَيْنَ يَدَيْكَ فَقَالَ أَبُو عَبْدِ اللَّهِ إِذَا أَمَرْتُكُمْ بِشَيْ‏ءٍ فَافْعَلُوا",
          "قَالَ هِشَامٌ بَلَغَنِي مَا كَانَ فِيهِ عَمْرُو بْنُ عُبَيْدٍ وَ جُلُوسُهُ فِي مَسْجِدِ الْبَصْرَةِ فَعَظُمَ ذَلِكَ عَلَيَّ فَخَرَجْتُ إِلَيْهِ وَ دَخَلْتُ الْبَصْرَةَ يَوْمَ الْجُمُعَةِ فَأَتَيْتُ مَسْجِدَ الْبَصْرَةِ فَإِذَا أَنَا بِحَلْقَةٍ كَبِيرَةٍ فِيهَا عَمْرُو بْنُ عُبَيْدٍ وَ عَلَيْهِ شَمْلَةٌ سَوْدَاءُ مُتَّزِراً بِهَا مِنْ صُوفٍ وَ شَمْلَةٌ مُرْتَدِياً بِهَا وَ النَّاسُ يَسْأَلُونَهُ فَاسْتَفْرَجْتُ النَّاسَ فَأَفْرَجُوا لِي ثُمَّ قَعَدْتُ فِي آخِرِ الْقَوْمِ عَلَى رُكْبَتَيَّ",
          "ثُمَّ قُلْتُ أَيُّهَا الْعَالِمُ إِنِّي رَجُلٌ غَرِيبٌ تَأْذَنُ لِي فِي مَسْأَلَةٍ فَقَالَ لِي نَعَمْ فَقُلْتُ لَهُ أَ لَكَ عَيْنٌ فَقَالَ يَا بُنَيَّ أَيُّ شَيْ‏ءٍ هَذَا مِنَ السُّؤَالِ وَ شَيْ‏ءٌ تَرَاهُ كَيْفَ تَسْأَلُ عَنْهُ فَقُلْتُ هَكَذَا مَسْأَلَتِي فَقَالَ يَا بُنَيَّ سَلْ وَ إِنْ كَانَتْ مَسْأَلَتُكَ حَمْقَاءَ قُلْتُ أَجِبْنِي فِيهَا قَالَ لِي سَلْ",
          "قُلْتُ أَ لَكَ عَيْنٌ قَالَ نَعَمْ قُلْتُ فَمَا تَصْنَعُ بِهَا قَالَ أَرَى بِهَا الْأَلْوَانَ وَ الْأَشْخَاصَ قُلْتُ فَلَكَ أَنْفٌ قَالَ نَعَمْ قُلْتُ فَمَا تَصْنَعُ بِهِ قَالَ أَشَمُّ بِهِ الرَّائِحَةَ قُلْتُ أَ لَكَ فَمٌ قَالَ نَعَمْ قُلْتُ فَمَا تَصْنَعُ بِهِ قَالَ أَذُوقُ بِهِ الطَّعْمَ قُلْتُ فَلَكَ أُذُنٌ قَالَ نَعَمْ قُلْتُ فَمَا تَصْنَعُ بِهَا قَالَ أَسْمَعُ بِهَا الصَّوْتَ قُلْتُ أَ لَكَ قَلْبٌ قَالَ نَعَمْ قُلْتُ فَمَا تَصْنَعُ بِهِ قَالَ أُمَيِّزُ بِهِ كُلَّ مَا وَرَدَ عَلَى هَذِهِ الْجَوَارِحِ وَ الْحَوَاسِّ",
          "قُلْتُ أَ وَ لَيْسَ فِي هَذِهِ الْجَوَارِحِ غِنًى عَنِ الْقَلْبِ فَقَالَ لَا قُلْتُ وَ كَيْفَ ذَلِكَ وَ هِيَ صَحِيحَةٌ سَلِيمَةٌ قَالَ يَا بُنَيَّ إِنَّ الْجَوَارِحَ إِذَا شَكَّتْ فِي شَيْ‏ءٍ شَمَّتْهُ أَوْ رَأَتْهُ أَوْ ذَاقَتْهُ أَوْ سَمِعَتْهُ رَدَّتْهُ إِلَى الْقَلْبِ فَيَسْتَيْقِنُ الْيَقِينَ وَ يُبْطِلُ الشَّكَّ",
          "قَالَ هِشَامٌ فَقُلْتُ لَهُ فَإِنَّمَا أَقَامَ اللَّهُ الْقَلْبَ لِشَكِّ الْجَوَارِحِ قَالَ نَعَمْ قُلْتُ لَا بُدَّ مِنَ الْقَلْبِ وَ إِلَّا لَمْ تَسْتَيْقِنِ الْجَوَارِحُ قَالَ نَعَمْ فَقُلْتُ لَهُ يَا أَبَا مَرْوَانَ فَاللَّهُ تَبَارَكَ وَ تَعَالَى لَمْ يَتْرُكْ جَوَارِحَكَ حَتَّى جَعَلَ لَهَا إِمَاماً يُصَحِّحُ لَهَا الصَّحِيحَ وَ يَتَيَقَّنُ بِهِ مَا شُكَّ فِيهِ وَ يَتْرُكُ هَذَا الْخَلْقَ كُلَّهُمْ فِي حَيْرَتِهِمْ وَ شَكِّهِمْ وَ اخْتِلَافِهِمْ لَا يُقِيمُ لَهُمْ إِمَاماً يَرُدُّونَ إِلَيْهِ شَكَّهُمْ وَ حَيْرَتَهُمْ وَ يُقِيمُ لَكَ إِمَاماً لِجَوَارِحِكَ تَرُدُّ إِلَيْهِ حَيْرَتَكَ وَ شَكَّكَ ",
          "قَالَ فَسَكَتَ وَ لَمْ يَقُلْ لِي شَيْئاً ثُمَّ الْتَفَتَ إِلَيَّ فَقَالَ لِي أَنْتَ هِشَامُ بْنُ الْحَكَمِ فَقُلْتُ لَا قَالَ أَ مِنْ جُلَسَائِهِ قُلْتُ لَا قَالَ فَمِنْ أَيْنَ أَنْتَ قَالَ قُلْتُ مِنْ أَهْلِ الْكُوفَةِ قَالَ فَأَنْتَ إِذاً هُوَ ثُمَّ ضَمَّنِي إِلَيْهِ وَ أَقْعَدَنِي فِي مَجْلِسِهِ وَ زَالَ عَنْ مَجْلِسِهِ وَ مَا نَطَقَ حَتَّى قُمْتُ ",
          "قَالَ فَضَحِكَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ قَالَ يَا هِشَامُ مَنْ عَلَّمَكَ هَذَا قُلْتُ شَيْ‏ءٌ أَخَذْتُهُ مِنْكَ وَ أَلَّفْتُهُ فَقَالَ هَذَا وَ اللَّهِ مَكْتُوبٌ فِي صُحُفِ إِبْرَاهِيمَ وَ مُوسَى ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Hassan Bin Ibrahim, from Yunus Bin Yaqoub who said, ",
            "‘There was in the presence of Abu Abdullah<sup>asws</sup>, a group of his<sup>asws</sup> companions. From them were Humran Bin Ayn and Muhammad Bin Al-Numan, and Hisham Bin Salim, and Al-Tayyar; and (also) a group, among whom was Hisham Bin Al-Hakam, and he was a youth. ",
            "So, Abu Abdullah<sup>asws</sup> said: ‘O Hisham! Can you inform me<sup>asws</sup> how you dealt with Amro Bin Ubeyd, and how you questioned him?’ So Hisham said, ‘O son<sup>asws</sup> of Rasool-Allah<sup>saww</sup>! I am prevented by your<sup>asws</sup> majesty and am too embarrassed from you<sup>asws</sup> and my tongue does not work in front of you<sup>asws</sup>’. So Abu Abdullah<sup>asws</sup> said: ‘When I<sup>asws</sup> order you with something, so do it’. ",
            "Hisham said, ‘It reached me what Amro Bin Ubeyd and his (companions) would be gathering in a Masjid of Al-Basra, so that was grievous upon me. So I went out to him and entered Al-Basra on the day of Friday. So I went over to the Masjid of Al-Basra, and there I was with a big circle in which was Amro Bin Ubeyd, and upon him was a black cloth he had used as a loin cloth, and a cloth he had robed himself with, and the people were questioning him. So I cleaved (cut-through) the people and they made way for me. Then I seated myself among the last (ones) of the people (who were seated there), upon my knees.",
            "Then I said, O you scholar! I am a man who is a stranger. Will you permit me for the questioning?’ So he said to me, ‘Yes’. So I said to him, ‘Is there an eye for you?’ So he said, ‘O my son! Which thing is this from the questions, and it is a thing you see? How can you question about it?’ So I said, ‘This is how my question is’ So he said, ‘O my son! Ask, and even if your question was stupid’. I said, ‘Answer me with regards to it’. He said to me, ‘Ask’. ",
            "I said, ‘Is there an eye for you?’ He<sup>asws</sup> said, ‘Yes’. I said, ‘So what do you do with it?’ He said, ‘I see the colours and the persons with it’. I said, ‘So is there a nose for you?’ He said, ‘So what do you with it?’ He said, ‘I smell the aromas with it’. I said, ‘Is there a mouth for you?’ He said, ‘Yes’. I said, ‘So what do you do with it?’ He said, ‘I taste the food by it’. I said, ‘So is there an ear for you’. He said, ‘Yes’. I said, ‘So what do you do with it’. He said, ‘I hear the sounds by it’. I said, ‘Is there a ‘قَلْبٌ’ heart for you?’ He said, ‘Yes’. I said, ‘So what do you do with it?’ He said, ‘I distinguish by it whatever is referred upon these body parts and the senses’. ",
            "I said, ‘Or isn’t there with regards to these body parts a needlessness from the heart?’ So he said, ‘No’. I said, ‘And how can that be and these are (all) healthy, sound?’ He said, ‘O my son! The body part, when it is doubtful regarding something it smells, or it sees, or it tastes, or it hears, it refers it back to the heart, so it convinces it with the conviction and invalidates the doubt’. ",
            "Hisham said, ‘So I said to him, ‘So rather, Allah<sup>azwj</sup> has Made the heart as a custodian for the doubts of the body parts?’. He said, ‘Yes’. I said, ‘It is inevitable from the heart, or else the body parts would not attain conviction?’. He Said, ‘Yes’. So I said to him, ‘O Abu Marwan! So Allah<sup>azwj</sup> Blessed and High did not Neglect your body parts until He<sup>azwj</sup> Made an Imam to be for these, correcting for these with the corrections and convincing these with what is doubtful with regards to it, and (you reckon that) He<sup>azwj</sup> would Neglect these creatures, all of them to be in their confusions, and their doubts, and their differing, and not Establish an Imam<sup>asws</sup> for them, to whom they should be referring their doubts and their confusion to, and He<sup>azwj</sup> did Establish an Imam for you for your body part, to which your confusions and your doubts get referred to?’",
            "He (Hisham) said, ‘So he was silent and did not say a thing. Then he turned towards me and said to me, ‘You are Hisham Bin Al-Hakam?’ So I said, ‘No’. He said, ‘Are you from his gatherers?’ I said, ‘No’. So, where are you from?’ I said, ‘From the people of Al-Kufa’. He said, ‘So then you are him’. He then embraced me and made me sit among his gatherers, and declined from (speaking to) his gathering, and did not speak until I arose (and left)’. ",
            "He (the narrator) said, ‘So Abu Abdullah<sup>asws</sup> laughed and said, ‘O Hisham! Who taught you this?’ I said, ‘Something I took from you<sup>asws</sup> and compiled it’. So he<sup>asws</sup> said: ‘This, by Allah<sup>azwj</sup>, is Written in the Parchments of Ibrahim<sup>as</sup> and Musa<sup>as</sup>’."
          ],
          "en.sarwar": [
            " 3. Ali ibn Ibrahim has narrated from his father from al-Hassan ibn Ibrahim from Yunus ibn Ya‘qub who has said the following. “In the presence of Imam abu ‘Abdallah (a.s.) once there was a group of his followers consisting of Humran ibn ’Ayun, Muhammad ibn al-Ni‘man, Hisham ibn Salim, al-Tayyar and others among whom was also Hisham ibn al-Hakam, a young man. Imam abu ‘Abdallah (a.s.) said, “O Hisham can you tell us what did you do to ‘Amr ibn ‘Ubayd and how did you ask him questions?” Hisham said, “O descendant of the Holy Prophet Your greatness makes me feel shy and my tongue does not work in your presence.” The Imam (a.s.) said, “When I would order you something you should do it.” Hisham, then said, “I came to learn about the gathering of ‘Amr ibn ‘Ubayd and sessions of speeches for people in the Mosque of Basra. It disturbed me a great deal and I went to Basra. It was a Friday. I went to the Mosque and found a large circle of people among was ‘Arm ibn ‘Ubayd with a black piece of woolen cloth used as a loin cloth and another piece over him as a gown and people would ask him questions. I asked people for room, which they made for me. I sat in front of the people with my legs folded beneath and said, “O scholar, I come from out of town. Can I ask you questions?” He said, “Yes, you may ask.” I asked, “Do you have eyes?” He said, “Son, what kind of question is this? Something that you can see why then do you ask?” I said, “That is how my questions are.” He said, “Son, you may ask your questions even if they would be foolish ones.” I asked, “Do you have eyes?” He said, “Yes, I have eyes.” I asked, “What do you do with them?” He said, “I see with them the colors and persons.” I asked, “Do you have a nose?” He said, “Yes, I have a nose.” I asked, “What do you do with it?” He said, “ I use it to smell things.” I asked, “Do you have a mouth?” He said, “Yes, I have a mouth.” I asked, “What do you do with it?” He said, “I test things with it.” I asked, “Do you have ears?” He said, “Yes, I have ears.” I asked, “What do you do with them?” He said, “I hear sounds with them.” He I asked, “Do you have a heart?” He said, “Yes, I have a heart.” I asked, “What do you do with it?” He said, “I distinguish and discern things that come to it from the other senses.” I asked, “Why are your others senses independent of your heart and why do they need it?” He said, “They are not independent of my heart.” I said, “Why do they need your heart when they are all healthy and sound?” He said, “Son, when the other senses face a doubt about something, such as smell, test, etc., I send it to my heart and it ascertains certainty and discards doubts.” I asked him, “Do you mean that Allah has set up the heart to remove doubts from the other senses?” He said, “Yes, that is true.” I asked, “Is then the existence of the heart necessary to remove the doubts of the other senses?” He said, “Yes, it is necessary.” I then said, “O abu Marwan, Allah, the Most Holy, the Most High, as you say, has not left your senses without an Imam to correct the doubts and the mistakes of the other senses in you and remove doubts therefrom, how would He leave all the people with doubts and confusions without an Imam who would remove their doubts and settle their disputes?” He remained quite and did not say anything for a while. He then asked, “Are you Hisham ibn al-Hakam?” I said, “No, I am not.” He asked, “Are you of his associates?” I said, “No.” He asked, “Wherefrom are you?” I said, “I am from Kufa.” He said, “You then must be Hisham ibn al-Hakam.” He then took to himself and gave me room nearby. He discontinued his speech until I left.” Imam abu ‘abdallah (a.s.) smiled and said, “O Hisham who has taught you this?” I replied, “I learned something from you and added something of my self.” The Imam (a.s.) said, “This, I swear by Allah, is written in the books of Abraham and Moses.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (268/ 2)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 431,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:1:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَمَّنْ ذَكَرَهُ عَنْ يُونُسَ بْنِ يَعْقُوبَ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَوَرَدَ عَلَيْهِ رَجُلٌ مِنْ أَهْلِ الشَّامِ فَقَالَ إِنِّي رَجُلٌ صَاحِبُ كَلَامٍ وَ فِقْهٍ وَ فَرَائِضَ وَ قَدْ جِئْتُ لِمُنَاظَرَةِ أَصْحَابِكَ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كَلَامُكَ مِنْ كَلَامِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) أَوْ مِنْ عِنْدِكَ فَقَالَ مِنْ كَلَامِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ مِنْ عِنْدِي فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَأَنْتَ إِذاً شَرِيكُ رَسُولِ اللَّهِ قَالَ لَا قَالَ فَسَمِعْتَ الْوَحْيَ عَنِ اللَّهِ عَزَّ وَ جَلَّ يُخْبِرُكَ قَالَ لَا قَالَ فَتَجِبُ طَاعَتُكَ كَمَا تَجِبُ طَاعَةُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) قَالَ لَا ",
          "فَالْتَفَتَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِلَيَّ فَقَالَ يَا يُونُسَ بْنَ يَعْقُوبَ هَذَا قَدْ خَصَمَ نَفْسَهُ قَبْلَ أَنْ يَتَكَلَّمَ ثُمَّ قَالَ يَا يُونُسُ لَوْ كُنْتَ تُحْسِنُ الْكَلَامَ كَلَّمْتَهُ قَالَ يُونُسُ فَيَا لَهَا مِنْ حَسْرَةٍ فَقُلْتُ جُعِلْتُ فِدَاكَ إِنِّي سَمِعْتُكَ تَنْهَى عَنِ الْكَلَامِ وَ تَقُولُ وَيْلٌ لِأَصْحَابِ الْكَلَامِ يَقُولُونَ هَذَا يُنْقَادُ وَ هَذَا لَا يُنْقَادُ وَ هَذَا يُنْسَاقُ وَ هَذَا لَا يُنْسَاقُ وَ هَذَا نَعْقِلُهُ وَ هَذَا لَا نَعْقِلُهُ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّمَا قُلْتُ فَوَيْلٌ لَهُمْ إِنْ تَرَكُوا مَا أَقُولُ وَ ذَهَبُوا إِلَى مَا يُرِيدُونَ",
          "ثُمَّ قَالَ لِي اخْرُجْ إِلَى الْبَابِ فَانْظُرْ مَنْ تَرَى مِنَ الْمُتَكَلِّمِينَ فَأَدْخِلْهُ قَالَ فَأَدْخَلْتُ حُمْرَانَ بْنَ أَعْيَنَ وَ كَانَ يُحْسِنُ الْكَلَامَ وَ أَدْخَلْتُ الْأَحْوَلَ وَ كَانَ يُحْسِنُ الْكَلَامَ وَ أَدْخَلْتُ هِشَامَ بْنَ سَالِمٍ وَ كَانَ يُحْسِنُ الْكَلَامَ وَ أَدْخَلْتُ قَيْسَ بْنَ الْمَاصِرِ وَ كَانَ عِنْدِي أَحْسَنَهُمْ كَلَاماً وَ كَانَ قَدْ تَعَلَّمَ الْكَلَامَ مِنْ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام )",
          "فَلَمَّا اسْتَقَرَّ بِنَا الْمَجْلِسُ وَ كَانَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَبْلَ الْحَجِّ يَسْتَقِرُّ أَيَّاماً فِي جَبَلٍ فِي طَرَفِ الْحَرَمِ فِي فَازَةٍ لَهُ مَضْرُوبَةٍ قَالَ فَأَخْرَجَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) رَأْسَهُ مِنْ فَازَتِهِ فَإِذَا هُوَ بِبَعِيرٍ يَخُبُّ فَقَالَ هِشَامٌ وَ رَبِّ الْكَعْبَةِ ",
          "قَالَ فَظَنَنَّا أَنَّ هِشَاماً رَجُلٌ مِنْ وُلْدِ عَقِيلٍ كَانَ شَدِيدَ الْمَحَبَّةِ لَهُ قَالَ فَوَرَدَ هِشَامُ بْنُ الْحَكَمِ وَ هُوَ أَوَّلُ مَا اخْتَطَّتْ لِحْيَتُهُ وَ لَيْسَ فِينَا إِلَّا مَنْ هُوَ أَكْبَرُ سِنّاً مِنْهُ قَالَ فَوَسَّعَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ قَالَ نَاصِرُنَا بِقَلْبِهِ وَ لِسَانِهِ وَ يَدِهِ",
          "ثُمَّ قَالَ يَا حُمْرَانُ كَلِّمِ الرَّجُلَ فَكَلَّمَهُ فَظَهَرَ عَلَيْهِ حُمْرَانُ ثُمَّ قَالَ يَا طَاقِيُّ كَلِّمْهُ فَكَلَّمَهُ فَظَهَرَ عَلَيْهِ الْأَحْوَلُ ثُمَّ قَالَ يَا هِشَامَ بْنَ سَالِمٍ كَلِّمْهُ فَتَعَارَفَا ثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لِقَيْسٍ الْمَاصِرِ كَلِّمْهُ فَكَلَّمَهُ فَأَقْبَلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَضْحَكُ مِنْ كَلَامِهِمَا مِمَّا قَدْ أَصَابَ الشَّامِيَّ فَقَالَ لِلشَّامِيِّ كَلِّمْ هَذَا الْغُلَامَ يَعْنِي هِشَامَ بْنَ الْحَكَمِ فَقَالَ نَعَمْ",
          "فَقَالَ لِهِشَامٍ يَا غُلَامُ سَلْنِي فِي إِمَامَةِ هَذَا فَغَضِبَ هِشَامٌ حَتَّى ارْتَعَدَ ثُمَّ قَالَ لِلشَّامِيِّ يَا هَذَا أَ رَبُّكَ أَنْظَرُ لِخَلْقِهِ أَمْ خَلْقُهُ لِأَنْفُسِهِمْ فَقَالَ الشَّامِيُّ بَلْ رَبِّي أَنْظَرُ لِخَلْقِهِ قَالَ فَفَعَلَ بِنَظَرِهِ لَهُمْ مَا ذَا قَالَ أَقَامَ لَهُمْ حُجَّةً وَ دَلِيلًا كَيْلَا يَتَشَتَّتُوا أَوْ يَخْتَلِفُوا يَتَأَلَّفُهُمْ وَ يُقِيمُ أَوَدَهُمْ وَ يُخْبِرُهُمْ بِفَرْضِ رَبِّهِمْ ",
          "قَالَ فَمَنْ هُوَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَالَ هِشَامٌ فَبَعْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) قَالَ الْكِتَابُ وَ السُّنَّةُ قَالَ هِشَامٌ فَهَلْ نَفَعَنَا الْيَوْمَ الْكِتَابُ وَ السُّنَّةُ فِي رَفْعِ الِاخْتِلَافِ عَنَّا قَالَ الشَّامِيُّ نَعَمْ قَالَ فَلِمَ اخْتَلَفْنَا أَنَا وَ أَنْتَ وَ صِرْتَ إِلَيْنَا مِنَ الشَّامِ فِي مُخَالَفَتِنَا إِيَّاكَ",
          "قَالَ فَسَكَتَ الشَّامِيُّ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لِلشَّامِيِّ مَا لَكَ لَا تَتَكَلَّمُ قَالَ الشَّامِيُّ إِنْ قُلْتُ لَمْ نَخْتَلِفْ كَذَبْتُ وَ إِنْ قُلْتُ إِنَّ الْكِتَابَ وَ السُّنَّةَ يَرْفَعَانِ عَنَّا الِاخْتِلَافَ أَبْطَلْتُ لِأَنَّهُمَا يَحْتَمِلَانِ الْوُجُوهَ وَ إِنْ قُلْتُ قَدِ اخْتَلَفْنَا وَ كُلُّ وَاحِدٍ مِنَّا يَدَّعِي الْحَقَّ فَلَمْ يَنْفَعْنَا إِذَنِ الْكِتَابُ وَ السُّنَّةُ إِلَّا أَنَّ لِي عَلَيْهِ هَذِهِ الْحُجَّةَ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) سَلْهُ تَجِدْهُ مَلِيّاً فَقَالَ الشَّامِيُّ يَا هَذَا مَنْ أَنْظَرُ لِلْخَلْقِ أَ رَبُّهُمْ أَوْ أَنْفُسُهُمْ فَقَالَ هِشَامٌ رَبُّهُمْ أَنْظَرُ لَهُمْ مِنْهُمْ لِأَنْفُسِهِمْ فَقَالَ الشَّامِيُّ فَهَلْ أَقَامَ لَهُمْ مَنْ يَجْمَعُ لَهُمْ كَلِمَتَهُمْ وَ يُقِيمُ أَوَدَهُمْ وَ يُخْبِرُهُمْ بِحَقِّهِمْ مِنْ بَاطِلِهِمْ قَالَ هِشَامٌ فِي وَقْتِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) أَوِ السَّاعَةِ قَالَ الشَّامِيُّ فِي وَقْتِ رَسُولِ اللَّهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ السَّاعَةِ مَنْ فَقَالَ هِشَامٌ هَذَا الْقَاعِدُ الَّذِي تُشَدُّ إِلَيْهِ الرِّحَالُ وَ يُخْبِرُنَا بِأَخْبَارِ السَّمَاءِ وَ الْأَرْضِ وِرَاثَةً عَنْ أَبٍ عَنْ جَدٍّ ",
          "قَالَ الشَّامِيُّ فَكَيْفَ لِي أَنْ أَعْلَمَ ذَلِكَ قَالَ هِشَامٌ سَلْهُ عَمَّا بَدَا لَكَ قَالَ الشَّامِيُّ قَطَعْتَ عُذْرِي فَعَلَيَّ السُّؤَالُ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا شَامِيُّ أُخْبِرُكَ كَيْفَ كَانَ سَفَرُكَ وَ كَيْفَ كَانَ طَرِيقُكَ كَانَ كَذَا وَ كَذَا فَأَقْبَلَ الشَّامِيُّ يَقُولُ صَدَقْتَ أَسْلَمْتُ لِلَّهِ السَّاعَةَ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) بَلْ آمَنْتَ بِاللَّهِ السَّاعَةَ إِنَّ الْإِسْلَامَ قَبْلَ الْإِيمَانِ وَ عَلَيْهِ يَتَوَارَثُونَ وَ يَتَنَاكَحُونَ وَ الْإِيمَانُ عَلَيْهِ يُثَابُونَ",
          "فَقَالَ الشَّامِيُّ صَدَقْتَ فَأَنَا السَّاعَةَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ أَنَّكَ وَصِيُّ الْأَوْصِيَاءِ",
          "ثُمَّ الْتَفَتَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِلَى حُمْرَانَ فَقَالَ تُجْرِي الْكَلَامَ عَلَى الْأَثَرِ فَتُصِيبُ وَ الْتَفَتَ إِلَى هِشَامِ بْنِ سَالِمٍ فَقَالَ تُرِيدُ الْأَثَرَ وَ لَا تَعْرِفُهُ ثُمَّ الْتَفَتَ إِلَى الْأَحْوَلِ فَقَالَ قَيَّاسٌ رَوَّاغٌ تَكْسِرُ بَاطِلًا بِبَاطِلٍ إِلَّا أَنَّ بَاطِلَكَ أَظْهَرُ ثُمَّ الْتَفَتَ إِلَى قَيْسٍ الْمَاصِرِ فَقَالَ تَتَكَلَّمُ وَ أَقْرَبُ مَا تَكُونُ مِنَ الْخَبَرِ عَنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) أَبْعَدُ مَا تَكُونُ مِنْهُ تَمْزُجُ الْحَقَّ مَعَ الْبَاطِلِ وَ قَلِيلُ الْحَقِّ يَكْفِي عَنْ كَثِيرِ الْبَاطِلِ أَنْتَ وَ الْأَحْوَلُ قَفَّازَانِ حَاذِقَانِ ",
          "قَالَ يُونُسُ فَظَنَنْتُ وَ اللَّهِ أَنَّهُ يَقُولُ لِهِشَامٍ قَرِيباً مِمَّا قَالَ لَهُمَا ثُمَّ قَالَ يَا هِشَامُ لَا تَكَادُ تَقَعُ تَلْوِي رِجْلَيْكَ إِذَا هَمَمْتَ بِالْأَرْضِ طِرْتَ مِثْلُكَ فَلْيُكَلِّمِ النَّاسَ فَاتَّقِ الزَّلَّةَ وَ الشَّفَاعَةُ مِنْ وَرَائِهَا إِنْ شَاءَ اللَّهُ "
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from the one who mentioned it, from Yunus Bin Yaqoub who said, ",
            "‘I was in the presence of Abu Abdullah<sup>asws</sup>, and a man from the people of Syria arrived to him<sup>asws</sup>. So he said, ‘I am a man who is a master of theology, and jurisprudence, and the Obligations (a high priest), and I have come to debate your<sup>asws</sup> companions’. ",
            "So Abu Abdullah<sup>asws</sup> said: ‘Is you speech from the words of Rasool-Allah<sup>saww</sup>, or from yourself?’ So he said, ‘From the words of Rasool-Allah<sup>saww</sup> and from myself’. So Abu Abdullah<sup>asws</sup> said: ‘So then you are a partner of Rasool-Allah<sup>saww</sup>’. He said, ‘No’. He<sup>asws</sup> said: ‘So you hear the Revelation from Allah<sup>azwj</sup> Mighty and Majestic Informing you?’ He said, ‘No’. He<sup>asws</sup> said: ‘So is obedience to you Obligated, just as the obedience to Rasool-Allah<sup>saww</sup> is Obligated?’ He said, ‘No’. ",
            "So, Abu Abdullah<sup>asws</sup> turned towards me and said: ‘O Yunus Bin Yaqoub! This one has debated against himself before he even spoke’. Then he<sup>asws</sup> said: ‘O Yunus! If you are good at speaking, speak to him’. Yunus said, ‘Alas, at the regret of it’. So I said, ‘May I be sacrificed for you<sup>asws</sup>! I heard you<sup>asws</sup> forbidding from the speaking, and you<sup>asws</sup> were saying: ‘Woe be on the companions of the speech who are saying, ‘This is guiding/deliverance and this is not guiding, and this is drifting and this is not drifting, and this we understand it and this we do not understand it’. So Abu Abdullah<sup>asws</sup> said: ‘But rather, I<sup>asws</sup> said: ‘So woe be unto them if they are neglecting what I<sup>asws</sup> am saying and are going to whatever they are wanting to go to’. ",
            "Then he<sup>asws</sup> said to me: ‘Go out to the door and look for the one you see from the speakers and bring him in’. He (the narrator) said, ‘So I brought in Humran Bin Ayn, and he was good of the speech, and I brought in Al-Ahowl and he was good of the speech, and I brought in Hisham Bin Salim and he was good of the speech, and I brought in Qays Bin Al-Masir and he was, in my presence, the best of them in speech, and he had learnt the speech from Ali Bin Al-Husayn<sup>asws</sup>.",
            "So when the gatherers sat down, and it was so that Abu Abdullah<sup>asws</sup>, before the Hajj, used to hold gatherings for days in a mountain by the side of the Sanctuary inside a tent struck for him<sup>asws</sup>. So Abu Abdullah<sup>asws</sup> brought out his<sup>asws</sup> head from his<sup>asws</sup> tent, and there was a camel growling. So he<sup>asws</sup> said, ‘Hisham! By the Lord<sup>azwj</sup> of the Kabah!’. ",
            "He (the narrator) said, ‘So we thought that Hisham was a man from the children of Aqeel for whom he<sup>asws</sup> had intense love for. Hisham Bin Al-Hakam arrived and he was the first who had sprouted his beard, and there wasn’t among us anyone except he was older in age than him. So Abu Abdullah<sup>asws</sup> made space for him as said, ‘He helps us by his heart, and his tongue, and his hands’. ",
            "Then he<sup>asws</sup> said: ‘O Humran! Speak to the man’. So he spoke to him and was victorious over him. Then he<sup>asws</sup> said: ‘O Taaqy (Al-Ahowl)! Speak to him’. So he spoke to him and Al Ahowl was victorious over him. Then he<sup>asws</sup> said: ‘O Hisham Bin Salim! Speak to him’. So they were both equal. Then Abu Abu Abdullah<sup>asws</sup> said to Qays Al-Masir: ‘Speak to him!’. So he spoke to him, and Abu Abdullah<sup>asws</sup> laughed due to both their speeches from what had hit the Syrian, and he<sup>asws</sup> said to the Syrian: ‘Speak to this boy’, meaning Hisham Bin Al-Hakam. So he said, ‘Yes’. ",
            "So he said to Hisham, ‘O boy! Ask me regarding the Imamate of this one<sup>asws</sup>’. So Hisham got angered to the extent that he trembled, then said to the Syrian, ‘O you! Is your Lord<sup>azwj</sup> Watching over His<sup>azwj</sup> creatures or are the creatures watching out for themselves?’ So the Syrian said, ‘But, my Lord<sup>azwj</sup> Looks after His<sup>azwj</sup> creatures’. He said, ‘So what is that which He<sup>azwj</sup> Does by His<sup>azwj</sup> Look out for them?’ He said, ‘He<sup>azwj</sup> Established a Divine Authority and evidence, lest they be disunited or differ, so he would unite them and inform them of the Impositions of their Lord<sup>azwj</sup>’. ",
            "He (Hisham) said, ‘So who is he?’ He said, ‘Rasool-Allah<sup>saww</sup>’. Hisham said, ‘So, after Rasool-Allah<sup>saww</sup>?’ He said, ‘The Book and the Sunnah’. Hisham said, ‘So would the Book and the Sunnah benefit us today in sorting out the differing from us?’ The Syrian said, ‘Yes’. He said, ‘Why (then) are we differing, me and you, and you have come to us from Syrian regarding the differences among you (and us)?’ ",
            "He (the narrator) said, ‘So the Syrian was silent, and Abu Abdullah<sup>asws</sup> said to the Syrian, ‘What is the matter with you, you are not speaking?’ The Syrian said, ‘If I were to say that we do not differ, I would be lying, and if I were to say that the Book and the Sunnah have both sorted the differences from us, it would be invalid, because they both carry the (various) aspects, and if I were to say that we have differed and each one of us is claiming the Truth, so the Book and the Sunnah would not benefit us except if there is for me, this Divine Authority over it’.",
            "So Abu Abdullah<sup>asws</sup> said, ‘Ask him. You will find him full (of knowledge)’. So the Syrian said, ‘O you! Who watches out for the creatures, is it their Lord<sup>azwj</sup> or they themselves?’ So Hisham said, ‘Their Lord<sup>azwj</sup> Watches out more for them than they do themselves’. So the Syrian said, ‘So does He<sup>azwj</sup> Establish for them the one<sup>asws</sup> who would gather their speeches (to be in unison) and he<sup>asws</sup> would inform them of their rights from their wrongs?’ Hisham said, ‘During the time of Rasool-Allah<sup>saww</sup>, or at the moment?’ The Syrian said, ‘During the time of Rasool-Allah<sup>saww</sup>, and at the moment, who?’ So Hisham said, ‘This here is the guide<sup>asws</sup> to whom the riders travel and he<sup>asws</sup> informs us with the news of the sky and the earth, and is an inheritor from a father<sup>asws</sup>, and from a grandfather<sup>asws</sup>’. ",
            "The Syrian said, ‘So how would it be for me that I would come to know that?’ Hisham said, ‘Ask him<sup>asws</sup> about whatever comes to you’. The Syrian said, ‘My excuses are cut off, so upon me is the question’. So Abu Abdullah<sup>asws</sup> said: ‘O Syrian! I<sup>asws</sup> shall inform you how your journey was, and how your travel path was. It was such and such’. So the Syrian turned facing, saying, ‘You<sup>asws</sup> speak the truth. I submit to Allah<sup>azwj</sup> (become Muslim) this very moment’. So Abu Abdullah<sup>asws</sup> said: ‘But, at the moment, you believe in Allah<sup>azwj</sup>. Al-Islam is before the <span class=\"iTxt\">Eman</span>, and upon it they (people) are inheriting and are marrying, and (as for) the <span class=\"iTxt\">Eman</span>, upon it they are being Rewarded’. ",
            "So the Syrian said, ‘You<sup>asws</sup> speak the truth. So I, at this moment, testify that there is no god except Allah<sup>azwj</sup>, and that Muhammad<sup>saww</sup> is Rasool-Allah<sup>saww</sup>, and you<sup>asws</sup> are a successor<sup>asws</sup> of the successors<sup>asws</sup>’. ",
            "Then Abu Abdullah<sup>asws</sup> turned towards Humran and he<sup>asws</sup> said, ‘You should flow the speech upon the Hadeeth, so you would be correct’. And he<sup>asws</sup> turned towards Hisham Bin Salim and he<sup>asws</sup> said, ‘You intend the Hadeeth but you do not recognise it’. Then he<sup>asws</sup> turned towards Al-Ahowl and he<sup>asws</sup> said: ‘You analogise, dodging (issues), breaking the falsehood with the falsehood, except that your falsehood was victorious’. Then he<sup>asws</sup> turned towards Qays Al-Masir and he<sup>asws</sup> said: ‘You spoke, and you were as close as you can happen to be from the Hadeeth from Rasool-Allah<sup>saww</sup> (while using a method) as remote as can happen to be from him<sup>saww</sup>. You mix the Truth with the falsehood, and the little of the Truth can suffice from the lot of falsehood. You and Al-Ahowl are both manouvering around skilfully’. ",
            "Yunus said, ‘So I thought, ‘By Allah<sup>azwj</sup>, he<sup>asws</sup> would be saying to Hisham close to what he<sup>asws</sup> said to them both’. Then he<sup>asws</sup> said: ‘O Hisham! You almost fall down, tangling your legs. When you hit the ground, you fly off (like a bird). The likes of you, so let him speak to the people. But fear the slips, and the intercession is from behind it, if Allah<sup>azwj</sup> so Desires’."
          ],
          "en.sarwar": [
            " 4. Ali ibn Ibrahim has narrated from his father from those whom mentioned from Yunus ibn Ya’qub who has said the following. “I was in the presence of Imam abu ‘Abdallah (a.s.) that a man from Sham (Syria) came to him and said, ‘I am a man of Kalam (meaningful words) Fiqh (laws) and rules of obligations and I have come to debate your people.” Imam abu ‘Abdallah asked, “ Are your meaningful words those of the Messenger of Allah or your own words?” He replied, “Somme of them are from the Messenger of Allah and some of them are my own words.” The Imam said, “Are then you a partner of the Messenger of Allah?” He said, “No, I am not.” The Imam (a.s.) asked, “Have you received any revelation from Allah, the Most Holy, the Most High ?” He said, “No, I have not.” The Imam then asked, “Is it obligatory to obey you just as it is obligatory to obey the Messenger of Allah?” He said, “No, it is not.” The Imam (a.s.) then turned to me and said, “O Yunus, this man has just defeated himself before debating others.” The Imam then said, “O Yunus, why do you not speak to him if you do well in debate?” I said, “I wish I could but, may Allah take my soul in the service for your cause, I have heard that you do not allow debating and say that wayl (a place in hell) is for those who debate. Some of them say, ‘This is accepted and that is not accepted and this is alright to say but that is not alright to say that this we understand and that we do not understand.’ The Imam (a.s.) said, “I said so if they would ignore what I say and follow what they themselves want.” The Imam then said, “find out who is outside who could debate and bring them in. The reporter has said, “I then brought in Humran ibn ’Ayun who was good in debating, Ahwal who also was good in debate. I brought Hisham ibn Salim who debated well. Another person I brought was Qays ibn Masir who the best of them to me. He had learned Kalam (theology) from Imam Ali ibn al-Husayn (a.s.) Our gathering took place in Makka before Hajj. Imam abu ‘Abdallah (a.s.) would stay near the Holy Mosque for few days in a small tent. Once the Imam (a.s.) looked outside the tent and there was a camel growling and said, “By the Lord of the Ka‘ba, it is Hisham.” We thought it must be Hisham, the man from the family of ‘Qil who was very beloved to the Imam (a.s.). It was Hisham ibn al-Hakam who came in. He had just grown a small beard and all of us were older than him. The Imam (a.s.) made room for him and said, “He is our supporter with his heart, tongue and hands.” The Imam then asked Humran to debate the man. Humran came out strong. Then the Imam asked Taqi to debate the man. Ahwal also came strong. Then the Imam asked Hisham ibn Salim to debate the man. They both remained the same. The Imam (a.s.) then asked Qasys al-Masir to debate the man. When they debated the Imam (a.s.) laughed because of the man from Sham sometimes saying the right thing. The Imam then asked the man from to speak with Hisham ibn al-Hakam. The man said, “O boy, ask me about the Imamat (spiritual leadership) of this man.” Hisham become angry and began to shake and said, “O you, is your Lord more protective of His people or people themselves?” The man said, “It is My Lord Who is more protective of His creatures.” Hisham then asked, “What then He in His opinion has done for them?” The Man said, “He has established His authority and guidance so that they would not differ and disunite and be united to support each other and remind them of their duties towards Allah.” Hisham asked, “Who is he?” The man said, “He is the Messenger of Allah.” Hisham then asked, “Who is the Divine authority after the Messenger of Allah?” The man replied, “It is the book if Allah and the Sunnah.” Hisham then said, “Have the Book and Sunnah helped us today in removing our differences?” The man said, “Yes, they have helped us.” Hisham then asked, “Why then do we have differences among us. You have come all the way from Sham to oppose and debate us?” The man then remained quite. The Imam asked him, “Why do not speak?” The man said, “If I were to say that we have no differences I would speaking lies. Were I to say that the Book and Sunnah solves our differences it would be invalid because they can be interpreted in so many ways. Were I to say that we do have differences and each claims to be the rightful party then the Book and the Sunnah would have been proved of no help. However, I can ask the same question from him also.” The Imam (a.s.) then said to man from Sham, “Why do not then ask him this question?” The man from Sham (Syria) then turned to Hisham and asked, “O you, is your Lord more protective of His people or people themselves?” Hisham said, “It is My Lord Who is more protective of His creatures.” The man then asked, “Has He then established for them a means that would remove their differences, unite them, remove their difficulties and show them the right from wrong?” Hisham asked, “Do you mean for the time of the Messenger of Allah or at this time?” The man from Sham said, “At the time of the Messenger of Allah was the Messenger of Allah. Who is the (Divine) authority at this time?” Hisham said, “(The Divine authority) at this time is this person sitting among us. To him people journey long distance to find answer to their questions. He tells us about the news of the heavens and the earth as he has inherited it from his father and grand father.” The man from Sham said, “How would I know that?” Hisham then said, “Ask him whatever you would like.” The man from Sham said, “You have left no excuse for me and I must ask.” Imam abu ‘Abdallah (a.s.) then said, “O man from Sham, “I can tell you how was your journey and how was your road. It was so and so.” The Imam (a.s.) informed him with details. The man agreed and acknowledged the details and said, “Now I have become a Muslim.” The Imam (a.s.) said, “In fact, you have become a believer in Allah now. Islam is before Iman (faith). Because of Islam people inherit each other and marry. Because of faith people receive rewards.” The man then said, “You have spoken the truth. At this time I testify that there is no god but Allah, and that Muhammad is His Messenger and that you are the executor of the will of the Executor of wills of the Messengers of Allah.” The Imam (a.s.) then turned to Humran and said, “When you speak on the basis of Hadith you speak the truth.” Turning to Hisham ibn Salim the Imam (a.s.) said, “You want the Hadith but you do not know them.” About the al-Ahwal the Imam said, “You analogized and use a great deal of cunning ways and break falsehood with falsehood but your falsehood is stronger.” To Qays al-Masir the Imam (a.s.) said, “You speak of something very near to the Hadith of the Holy Prophet (s.a) but use something very far from the Hadith of the Holy Prophet. You mix the truth with falsehood while a small degree of truth is enough to remove falsehood. You and Ahwal are experts in jumping here and there.” Yunus has said, “I thought the Imam will say about Hisham something similar to those he said about the other two.” The Imam then said, “O Hisham, you sometimes almost fall but you spring up like a bird on take-off. People like you should speak but be careful of slipping and intercession will follow, Allah willing.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (277/ 2)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (23/ 1)"
        ],
        "index": 432,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:1:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانٍ قَالَ أَخْبَرَنِي الْأَحْوَلُ أَنَّ زَيْدَ بْنَ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) بَعَثَ إِلَيْهِ وَ هُوَ مُسْتَخْفٍ قَالَ فَأَتَيْتُهُ فَقَالَ لِي يَا أَبَا جَعْفَرٍ مَا تَقُولُ إِنْ طَرَقَكَ طَارِقٌ مِنَّا أَ تَخْرُجُ مَعَهُ قَالَ فَقُلْتُ لَهُ إِنْ كَانَ أَبَاكَ أَوْ أَخَاكَ خَرَجْتُ مَعَهُ قَالَ فَقَالَ لِي فَأَنَا أُرِيدُ أَنْ أَخْرُجَ أُجَاهِدُ هَؤُلَاءِ الْقَوْمَ فَاخْرُجْ مَعِي قَالَ قُلْتُ لَا مَا أَفْعَلُ جُعِلْتُ فِدَاكَ",
          "قَالَ فَقَالَ لِي أَ تَرْغَبُ بِنَفْسِكَ عَنِّي قَالَ قُلْتُ لَهُ إِنَّمَا هِيَ نَفْسٌ وَاحِدَةٌ فَإِنْ كَانَ لِلَّهِ فِي الْأَرْضِ حُجَّةٌ فَالْمُتَخَلِّفُ عَنْكَ نَاجٍ وَ الْخَارِجُ مَعَكَ هَالِكٌ وَ إِنْ لَا تَكُنْ لِلَّهِ حُجَّةٌ فِي الْأَرْضِ فَالْمُتَخَلِّفُ عَنْكَ وَ الْخَارِجُ مَعَكَ سَوَاءٌ",
          "قَالَ فَقَالَ لِي يَا أَبَا جَعْفَرٍ كُنْتُ أَجْلِسُ مَعَ أَبِي عَلَى الْخِوَانِ فَيُلْقِمُنِي الْبَضْعَةَ السَّمِينَةَ وَ يُبَرِّدُ لِيَ اللُّقْمَةَ الْحَارَّةَ حَتَّى تَبْرُدَ شَفَقَةً عَلَيَّ وَ لَمْ يُشْفِقْ عَلَيَّ مِنْ حَرِّ النَّارِ إِذاً أَخْبَرَكَ بِالدِّينِ وَ لَمْ يُخْبِرْنِي بِهِ",
          "فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ مِنْ شَفَقَتِهِ عَلَيْكَ مِنْ حَرِّ النَّارِ لَمْ يُخْبِرْكَ خَافَ عَلَيْكَ أَنْ لَا تَقْبَلَهُ فَتَدْخُلَ النَّارَ وَ أَخْبَرَنِي أَنَا فَإِنْ قَبِلْتُ نَجَوْتُ وَ إِنْ لَمْ أَقْبَلْ لَمْ يُبَالِ أَنْ أَدْخُلَ النَّارَ ",
          "ثُمَّ قُلْتُ لَهُ جُعِلْتُ فِدَاكَ أَنْتُمْ أَفْضَلُ أَمِ الْأَنْبِيَاءُ قَالَ بَلِ الْأَنْبِيَاءُ قُلْتُ يَقُولُ يَعْقُوبُ لِيُوسُفَ يَا بُنَيَّ لَا تَقْصُصْ رُؤْيَاكَ عَلَى إِخْوَتِكَ فَيَكِيدُوا لَكَ كَيْداً لِمَ لَمْ يُخْبِرْهُمْ حَتَّى كَانُوا لَا يَكِيدُونَهُ وَ لَكِنْ كَتَمَهُمْ ذَلِكَ فَكَذَا أَبُوكَ كَتَمَكَ لِأَنَّهُ خَافَ عَلَيْكَ ",
          "قَالَ فَقَالَ أَمَا وَ اللَّهِ لَئِنْ قُلْتَ ذَلِكَ لَقَدْ حَدَّثَنِي صَاحِبُكَ بِالْمَدِينَةِ أَنِّي أُقْتَلُ وَ أُصْلَبُ بِالْكُنَاسَةِ وَ إِنَّ عِنْدَهُ لَصَحِيفَةً فِيهَا قَتْلِي وَ صَلْبِي ",
          "فَحَجَجْتُ فَحَدَّثْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) بِمَقَالَةِ زَيْدٍ وَ مَا قُلْتُ لَهُ فَقَالَ لِي أَخَذْتَهُ مِنْ بَيْنِ يَدَيْهِ وَ مِنْ خَلْفِهِ وَ عَنْ يَمِينِهِ وَ عَنْ شِمَالِهِ وَ مِنْ فَوْقِ رَأْسِهِ وَ مِنْ تَحْتِ قَدَمَيْهِ وَ لَمْ تَتْرُكْ لَهُ مَسْلَكاً يَسْلُكُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad BinIsa, from Ali Bin Al Hakam, from Aban who said, ",
            "‘Al-Ahowl informed me that Zayd Bin Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> sent for him, and he was in concealment. He said, ‘So I went over to him and he said to me, ‘O Abu Ja’far! What are you saying, if a comer comes to you from us, would you go out (rise up against the ruling authorities) along with him?’ So I said to him, ‘If it was your father<sup>asws</sup> or your uncle<sup>asws</sup>, I would go out with him<sup>asws</sup>’. So he said, ‘So I intend to go out and fight these people, therefore come out with me’. I said, ‘No, I would not do so, may I be sacrificed for you’. ",
            "He said, ‘So he said to me, ‘Are you desiring your own self over mine?’ I said to him, ‘But rather, it is one self. So if there was a Divine Authority for Allah<sup>azwj</sup> in the earth, so then the staying behind (rather than go in support of) you would be the salvation and the going out with you would be destruction, and if there does not happen to be a Divine Authority for Allah<sup>azwj</sup> in the earth, so the staying behind from you and the going out with you, it would be the same’. ",
            "He said, ‘So he (Zayd) said to me, ‘O Abu Ja’far! I used to sit with my father<sup>asws</sup> upon the meal, so he<sup>asws</sup> would feed me morsels of chunky parts, and he<sup>asws</sup> would cool the hot morsels for me until it would cool down, out of compassion upon me, and (you reckon) he<sup>asws</sup> would not be compassionate upon me from the heat of the Fire (of Hell), when he<sup>asws</sup> informed you of the (correct) Religion and he<sup>asws</sup> would not inform me with it?’ ",
            "So I said to him, ‘May I be sacrificed for you! It was from his<sup>asws</sup> compassion upon you from the heat of the Fire (of Hell) that he<sup>asws</sup> did not inform you, out of fear upon you, that you might not accept it so you would enter the Fire, and he<sup>asws</sup> informed me. I, so if I were to accept, I would attain salvation, and if I do not accept, he<sup>asws</sup> would not care if I enter the Fire’. ",
            "Then I said to him, ‘May I be sacrificed for you! Are you more superior or the Prophets<sup>as</sup>?’ He said, ‘But, the Prophets<sup>as</sup> are’. I said, ‘Yaqoub<sup>as</sup> was saying to Yusuf <span class=\"ibTxt\">[12:5] do not relate your vision to your brothers, so they would plot a plot against you</span>. Why did he<sup>asws</sup> not inform them until they did, that they should not plot against him<sup>as</sup>? But, he<sup>as</sup> concealed that from them. So, such was your father<sup>asws</sup>. He<sup>asws</sup> concealed from you because he<sup>asws</sup> feared that upon you’. ",
            "He Said, ‘So he (Zayd) said, ‘But, by Allah<sup>azwj</sup>! While I say that your companion (Imam<sup>asws</sup>) had narrated to me at Al-Medina that I would be killed and crucified at Al-Kunasa, and that in his<sup>asws</sup> presence was a Parchment wherein was (written) my murder and my crucifixion’.",
            "So I went for Hajj and I discussed with Abu Abdullah<sup>asws</sup> with the words of Zayd and what I said to him. So he<sup>asws</sup> said to me: ‘You seized him from in front of him, and from behind him, and from his right, and from his left, and from above his head, and from beneath his feet, and you did not leave a way for him to travel upon’."
          ],
          "en.sarwar": [
            " 5. A number of our people has narrated from Ahmad ibn Muhammad ibn ‘isa from Ali ibn al-Hakam from Aban who has that al-Ahwal reported to him the following. “Zayd ibn Ali ibn al-Husayn (a.s.) sent called up on to meet him when he was in hiding. When I met him, Zayd said, “O abu Ja‘far, what would say if someone will from us would come to you asking to join us? Will you rise up with him (against the enemies)?” I said, “Would it be your father or brother I would have joined them.” He then said, “I want to rise up against these people. Come and join me.” I then said, “No, may Allah my soul of service to you.” He then said, “Is it that you keep yourself away from me?” I said, “ It is only one soul. If Allah’s authority on earth exists, then those keeping away from you would have saved themselves and those joining you would have faced their destruction. If there would Divine authority exist one earth then people joining and keeping away from would be the same.” He then said, “O abu Ja‘far, I would sit with my father at the same table he would feed me chunky morsels and cool off for me the hot one out kindness and diligent care. Do you think he was not afraid for me from the fire of hell? So he has informed you about religion and did not inform me?” I said, “ May Allah make my soul of service to you, it is also because of the kindness of your father to you that to save you from the fire he did not inform you. He was afraid for you that after having the information you would ignore his guidance and so you become subject of fire He informed me also and if I would follow I will be safe and become destroyed if disobeyed for he which he was not that much concerned. Then I told him, “..” May Allah make my soul of service to you, are you of a higher degree of excellence or the prophets?” He said, “It is the prophets.” I said, “Consider that Ya‘qub has said to Joseph, ‘My son do not tell your dream to your brothers. They may plot against you. Why he not inform the brothers so that they would not plot against Josephe?.He hid it from them such the way your father has done because he was afraid about you.” Then He said, “When you say that, I swear to Allah that your friend (the Imam (a.s.) told me in Madina that I will be killed and crucified in al-Kunnasa and that he has a book with him that lists the people killed and crucified.” I then went for Hajj and reported the story of Zayd to abu ‘Abdallah (a.s.) and what I said to Zayd. The Imam (a.s.) said, “You surrounded him from his fron, back, left, right, above and below and did not leave for any way out."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:1",
  "kind": "verse_list"
}