{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 100"
        },
        "path": "/books/al-kafi:1:4:100",
        "titles": {
          "ar": "باب أَنَّ مُسْتَقَى الْعِلْمِ مِنْ بَيْتِ آلِ مُحَمَّدٍ ( عليهم السلام )",
          "en": "Chapter 100 – The Knowledge is derived from the Houshold of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>"
        }
      }
    ],
    "index": 158,
    "local_index": 100,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 101"
        },
        "path": "/books/al-kafi:1:4:101",
        "titles": {
          "ar": "باب أَنَّهُ لَيْسَ شَيْ‏ءٌ مِنَ الْحَقِّ فِي يَدِ النَّاسِ إِلَّا مَا خَرَجَ مِنْ عِنْدِ الْأَئِمَّةِ ( عليهم السلام ) وَ أَنَّ كُلَّ شَيْ‏ءٍ لَمْ يَخْرُجْ مِنْ عِنْدِهِمْ فَهُوَ بَاطِلٌ",
          "en": "Chapter 101 – There is nothing in the hands of the people from the truth except what came out from the presence of the Imams<sup>asws</sup>, and that every thing which did not come out from them<sup>asws</sup>, so it is false"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 99"
        },
        "path": "/books/al-kafi:1:4:99",
        "titles": {
          "ar": "باب فِي الْأَئِمَّةِ ( عليهم السلام ) أَنَّهُمْ إِذَا ظَهَرَ أَمْرُهُمْ حَكَمُوا بِحُكْمِ دَاوُدَ وَ آلِ دَاوُدَ وَ لَا يَسْأَلُونَ الْبَيِّنَةَ عَلَيْهِمُ السَّلَامُ وَ الرَّحْمَةُ وَ الرِّضْوَانُ",
          "en": "Chapter 99 – Regarding the Imams<sup>asws</sup> that they<sup>asws</sup>, when their<sup>asws</sup> command appears, they<sup>asws</sup> would be judging by the judgment of Dawood<sup>as</sup> and the Progeny of Dawood<sup>as</sup>, and they<sup>asws</sup> would not be asking for the proof, upon them<sup>asws</sup> be the greetings, and the Mercy, and the (Divine) Pleasure."
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:100",
    "titles": {
      "ar": "باب أَنَّ مُسْتَقَى الْعِلْمِ مِنْ بَيْتِ آلِ مُحَمَّدٍ ( عليهم السلام )",
      "en": "Chapter 100 – The Knowledge is derived from the Houshold of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>"
    },
    "verse_count": 2,
    "verse_start_index": 1038,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/305)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1039,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:100:1",
        "text": [
          " حَدَّثَنَا يَحْيَى بْنُ عَبْدِ اللَّهِ أَبِي الْحَسَنِ صَاحِبُ الدَّيْلَمِ قَالَ سَمِعْتُ جَعْفَرَ بْنَ مُحَمَّدٍ ( عليه السلام ) يَقُولُ وَ عِنْدَهُ أُنَاسٌ مِنْ أَهْلِ الْكُوفَةِ عَجَباً لِلنَّاسِ أَنَّهُمْ أَخَذُوا عِلْمَهُمْ كُلَّهُ عَنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَعَمِلُوا بِهِ وَ اهْتَدَوْا وَ يَرَوْنَ أَنَّ أَهْلَ بَيْتِهِ لَمْ يَأْخُذُوا عِلْمَهُ وَ نَحْنُ أَهْلُ بَيْتِهِ وَ ذُرِّيَّتُهُ فِي مَنَازِلِنَا نَزَلَ الْوَحْيُ وَ مِنْ عِنْدِنَا خَرَجَ الْعِلْمُ إِلَيْهِمْ أَ فَيَرَوْنَ أَنَّهُمْ عَلِمُوا وَ اهْتَدَوْا وَ جَهِلْنَا نَحْنُ وَ ضَلَلْنَا إِنَّ هَذَا لَمُحَالٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Mahboub who said, ‘Yahya Bin Abdullah Abu Al Hassan Sahib Al Daylam said, ",
            "‘I heard Ja’far Bin Muhammad<sup>asws</sup> saying, and in his<sup>asws</sup> presence were people from the inhabitants of Al-Kufa: ‘I<sup>asws</sup> am astounded at the people. They are taking their knowledge, all of it as being from Rasool-Allah<sup>saww</sup>, and they are acting by it, and are guiding, and they are reporting that the People<sup>asws</sup> of his<sup>saww</sup> Household are not taking his<sup>saww</sup> knowledge, and we<sup>asws</sup> are the People<sup>asws</sup> of his<sup>saww</sup> Household, and his<sup>saww</sup> offspring. In our<sup>asws</sup> Household did the Revelation descend, and from us<sup>asws</sup> did the knowledge come out to them. Are they reporting that they are knowing and are being guided, and we<sup>asws</sup> are ignorant and straying? This is impossible!’"
          ],
          "en.sarwar": [
            " 1. A number of our people has narrated from Ahmad ibn Muhammad from ibn Mahbub who has said that Yahya ibn ‘Abdallah abu al-Hassan the companion of al-Daylam narrated to us and who has said the following. “Once I heard Ja‘far ibn Muhammad (a.s.) say while a group of people of Kufa was present before him, “It is very strange of the people. They have received their knowledge from the Messenger of Allah. They have followed such knowledge and found guidance but they think that his Ahl al-Bayt (members of his family) have not received his knowledge. We are his Ahl al-Bayt (members of his family) and his descendants. In our house Divine inspiration came down and from us knowledge came out to them. Do they think that they have learned and found guidance but we remained ignorant and lost. This, certainly, is not possible.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/307)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1040,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/33",
              "text": "عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/34",
              "text": "إِبْرَاهِيمَ بْنِ إِسْحَاقَ الْأَحْمَرِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/831",
              "text": "عَبْدِ اللَّهِ بْنِ حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1156",
              "text": "صَبَّاحٍ الْمُزَنِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1157",
              "text": "الْحَارِثِ بْنِ حَصِيرَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/850",
              "text": "الْحَكَمِ بْنِ عُتَيْبَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ الْأَحْمَرِ عَنْ عَبْدِ اللَّهِ بْنِ حَمَّادٍ عَنْ صَبَّاحٍ الْمُزَنِيِّ عَنِ الْحَارِثِ بْنِ حَصِيرَةَ عَنِ الْحَكَمِ بْنِ عُتَيْبَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:100:2",
        "text": [
          " لَقِيَ رَجُلٌ الْحُسَيْنَ بْنَ عَلِيٍّ  ( عليه السلام ) بِالثَّعْلَبِيَّةِ وَ هُوَ يُرِيدُ كَرْبَلَاءَ فَدَخَلَ عَلَيْهِ فَسَلَّمَ عَلَيْهِ فَقَالَ لَهُ الْحُسَيْنُ ( عليه السلام ) مِنْ أَيِّ الْبِلَادِ أَنْتَ قَالَ مِنْ أَهْلِ الْكُوفَةِ قَالَ أَمَا وَ اللَّهِ يَا أَخَا أَهْلِ الْكُوفَةِ لَوْ لَقِيتُكَ بِالْمَدِينَةِ لَأَرَيْتُكَ أَثَرَ جَبْرَئِيلَ ( عليه السلام ) مِنْ دَارِنَا وَ نُزُولِهِ بِالْوَحْيِ عَلَى جَدِّي يَا أَخَا أَهْلِ الْكُوفَةِ أَ فَمُسْتَقَى النَّاسِ الْعِلْمَ مِنْ عِنْدِنَا فَعَلِمُوا وَ جَهِلْنَا هَذَا مَا لَا يَكُونُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad Bin Abdullah, from Ibrahim Bin Is’haq Al Ahmar, from Abdullah Bin Hammad, from Sabbah Al Muzany, from Al Hari Bin Haseyra, from Al Hakam Bin Uteyba who said, ",
            "‘A man met up with Al-Husayn Bin Ali<sup>asws</sup> at Salbiyya and he<sup>asws</sup> was intending Karbala. So he went over to him<sup>asws</sup>, and greeted upon him<sup>asws</sup>. So Al-Husayn<sup>asws</sup> said to him: ‘Which city are you from?’ He said, ‘From the people of Al-Kufa’. He<sup>asws</sup> said: ‘But, by Allah<sup>azwj</sup>, O brother of the people of Al-Kufa! Had I<sup>asws</sup> met you in Al-Medina, I<sup>asws</sup> would have shown you the effects of Jibraeel<sup>as</sup> from our<sup>asws</sup> house, and he<sup>as</sup> descended with the Revelation upon my<sup>asws</sup> grandfather<sup>saww</sup>. O brother of the people of Al-Kufa! So the people quenched the knowledge from us<sup>asws</sup>, and is it so that they are knowledgeable and we<sup>asws</sup> are ignorant? This cannot happen to be!’"
          ],
          "en.sarwar": [
            " 2. Ali ibn Muhammad ibn ‘Abdallah has narrated from Ibrahim ibn Ishaq al-Ahmar from ‘Abdallah ibn Hammad from Sabbah al-Muzanni from al-Harith ibn Husayra from al-Hakam ibn ‘Utayba who has said the following. “A man met al-Husayn ibn Ali (a.s.) at al-Tha‘laba on his way to Karbala. He came in his presence and offered Islamic greetings to him. Al-Husayn (a.s.) asked, “Where are you from?” He replied, “I am from Kufa.” The Imam (a.s.) said, “By Allah, O brethren from Kufa, if only I had a meeting with you in Madina, I could have shown you the marks of Jibril in and around our house and his coming with Divine message to my grandfather. O brethren from Kufa, how can it be true that we be the ones to make people quench their thirst for knowledge from us but they would learn and we remain ignorant. This can not happen.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:100",
  "kind": "verse_list"
}