{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 102"
        },
        "path": "/books/al-kafi:1:4:102",
        "titles": {
          "ar": "باب فِيمَا جَاءَ أَنَّ حَدِيثَهُمْ صَعْبٌ مُسْتَصْعَبٌ",
          "en": "Chapter 102 – Regarding what has come that their Ahadeeth are difficult, becoming more difficult"
        }
      }
    ],
    "index": 160,
    "local_index": 102,
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:102",
    "titles": {
      "ar": "باب فِيمَا جَاءَ أَنَّ حَدِيثَهُمْ صَعْبٌ مُسْتَصْعَبٌ",
      "en": "Chapter 102 – Regarding what has come that their Ahadeeth are difficult, becoming more difficult"
    },
    "verse_count": 5,
    "verse_start_index": 1046,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور معتبر عندي    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/312)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1047,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:102:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَمَّارِ بْنِ مَرْوَانَ عَنْ جَابِرٍ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ حَدِيثَ آلِ مُحَمَّدٍ صَعْبٌ مُسْتَصْعَبٌ لَا يُؤْمِنُ بِهِ إِلَّا مَلَكٌ مُقَرَّبٌ أَوْ نَبِيٌّ مُرْسَلٌ أَوْ عَبْدٌ امْتَحَنَ اللَّهُ قَلْبَهُ لِلْإِيمَانِ ",
          "فَمَا وَرَدَ عَلَيْكُمْ مِنْ حَدِيثِ آلِ مُحَمَّدٍ ( صلى الله عليه وآله ) فَلَانَتْ لَهُ قُلُوبُكُمْ وَ عَرَفْتُمُوهُ فَاقْبَلُوهُ وَ مَا اشْمَأَزَّتْ مِنْهُ قُلُوبُكُمْ وَ أَنْكَرْتُمُوهُ فَرُدُّوهُ إِلَى اللَّهِ وَ إِلَى الرَّسُولِ وَ إِلَى الْعَالِمِ مِنْ آلِ مُحَمَّدٍ وَ إِنَّمَا الْهَالِكُ أَنْ يُحَدِّثَ أَحَدُكُمْ بِشَيْ‏ءٍ مِنْهُ لَا يَحْتَمِلُهُ فَيَقُولَ وَ اللَّهِ مَا كَانَ هَذَا وَ اللَّهِ مَا كَانَ هَذَا وَ الْإِنْكَارُ هُوَ الْكُفْرُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Sinan, from Ammar Bin Marwan, from Jabir who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘The Ahadeeth of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> are difficult, becoming more difficult. None will believe in it except for an Angel of Proximity, or a <span class=\"iTxt\">Mursil</span> Prophet<sup>saww</sup>, or a servant whose heart Allah<sup>azwj</sup> has Tested for the <span class=\"iTxt\">Eman</span>. ",
            "Thus, whatever is referred upon you all from a Hadeeth of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, and your hearts incline towards it, and you recognise it, so accept it, and whatever your hearts get constricted from and you cannot recognize it, so refer it back to Allah<sup>azwj</sup> and to the Rasool<sup>saww</sup>, and to the knowledgeable one<sup>asws</sup> from the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>; and rather, the destroyed is when one of you is narrated to with something from it, and he cannot bear it, so he is saying, ‘By Allah<sup>azwj</sup>! This was not so. By Allah<sup>azwj</sup>! This was not so’. And the denial, it is the disbelief’."
          ],
          "en.sarwar": [
            " 1. d ibn Sinan from ‘Ammar ibn Marwan from Jabir who has said the following. “Abu Ja‘far (a.s.) has said that the Messenger of Allah has said, ‘The Hadith (statements) of Ahl al-Bayt (members of the family of Prophet Muhammad) is difficult and it becomes difficult. No one believes in it except the angels that are close to Allah or the Prophets who are Messengers also, a servant of Allah whose He has tested for faith. Whatever would come to you of the Hadith (statements) of Ahl al-Bayt of Muhammad (members of the family of Prophet Muhammad), if your heart would feel relief and you recognized them accept them. Whatever that would cause antipathy in your hearts and you could not recognize leave them to Allah, to the Messenger of Allah and the scholar from Ahl al-Bayt of Muhammad. The ones to perish are those who do not accept Hadith of Ahl al-Bayt (members of the family of Prophet Muhammad).Whenever one is narrated to them they say, “By Allah, this was not and that was not.” Denial is disbelief.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/315)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1048,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:102:2",
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ عِمْرَانَ بْنِ مُوسَى عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ ذُكِرَتِ التَّقِيَّةُ يَوْماً عِنْدَ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) فَقَالَ وَ اللَّهِ لَوْ عَلِمَ أَبُو ذَرٍّ مَا فِي قَلْبِ سَلْمَانَ لَقَتَلَهُ وَ لَقَدْ آخَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بَيْنَهُمَا ",
          "فَمَا ظَنُّكُمْ بِسَائِرِ الْخَلْقِ إِنَّ عِلْمَ الْعُلَمَاءِ صَعْبٌ مُسْتَصْعَبٌ لَا يَحْتَمِلُهُ إِلَّا نَبِيٌّ مُرْسَلٌ أَوْ مَلَكٌ مُقَرَّبٌ أَوْ عَبْدٌ مُؤْمِنٌ امْتَحَنَ اللَّهُ قَلْبَهُ لِلْإِيمَانِ ",
          "فَقَالَ وَ إِنَّمَا صَارَ سَلْمَانُ مِنَ الْعُلَمَاءِ لِأَنَّهُ امْرُؤٌ مِنَّا أَهْلَ الْبَيْتِ فَلِذَلِكَ نَسَبْتُهُ إِلَى الْعُلَمَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Imran Bin Musa, from Haroun Bin Muslim, from Mas’ada Bin Sadqa, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘One day the dissimulation was mentioned in the presence of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, so he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! If Abu Zarr<sup>as</sup> knew what was in the heart of Salman<sup>as</sup>, he<sup>as</sup> would have killed him<sup>as</sup>; and Rasool-Allah<sup>saww</sup> had established brotherhood between the two of them<sup>as</sup>. ",
            "So what are your thoughts with the rest of the people? The knowledge of the knowledgeable ones<sup>asws</sup> is difficult, becoming more difficult. None can bear it except for a <span class=\"iTxt\">Mursil</span> Prophet<sup>saww</sup>, or an Angel of Proximity, or a <span class=\"iTxt\">Momin </span>servant whose heart Allah<sup>azwj</sup> has Tested for the <span class=\"iTxt\">Eman</span>’. ",
            "So he (Abu Abdullah<sup>asws</sup>) said: ‘And rather, Salman<sup>as</sup> came to be of the knowledgeable ones because he<sup>as</sup> is a man from us<sup>asws</sup>, the People<sup>asws</sup> of the Household, therefore due to that I<sup>asws</sup> am attributing him<sup>as</sup> to the knowledgeable ones<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 2. Ahmad ibn ’Idris has narrated from ‘Imran ibn Musa from Harun ibn Muslim from Mas‘ada ibn Sadaqa who has said the following. “I said to abu ‘Abdallah that I one day spoke of Taqiya (hiding something for fear) before Ali ibn al-Husayn (a.s.).” He said, “By Allah, if abu Dhar knew what was in the heart of Salam he would have killed him even though the Messenger of Allah had formed brotherhood between them. What then would you think of the rest of the people? The knowledge of the scholars is difficult and it becomes difficult No one is capable to bear it except a prophet who is a messenger also or an angel who is close to Allah or a believer whose heart Allaah has tested for faith.” The Imam (a.s.) then said, “The only reason that Salamn became of the scholars is because he is a man from us (Ahl al-Bayt). For this reason I ascribed him to the scholars.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/317)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1049,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:102:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْبَرْقِيِّ عَنِ ابْنِ سِنَانٍ أَوْ غَيْرِهِ رَفَعَهُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ حَدِيثَنَا صَعْبٌ مُسْتَصْعَبٌ لَا يَحْتَمِلُهُ إِلَّا صُدُورٌ مُنِيرَةٌ أَوْ قُلُوبٌ سَلِيمَةٌ أَوْ أَخْلَاقٌ حَسَنَةٌ إِنَّ اللَّهَ أَخَذَ مِنْ شِيعَتِنَا الْمِيثَاقَ كَمَا أَخَذَ عَلَى بَنِي آدَمَ أَ لَسْتُ بِرَبِّكُمْ فَمَنْ وَفَى لَنَا وَفَى اللَّهُ لَهُ بِالْجَنَّةِ وَ مَنْ أَبْغَضَنَا وَ لَمْ يُؤَدِّ إِلَيْنَا حَقَّنَا فَفِي النَّارِ خَالِداً مُخَلَّداً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Barqy, from Ibn Sinan, or someonle else, ",
            "(It has been narrated) raising it to Abu Abdullah<sup>asws</sup> having said: ‘Our<sup>asws</sup> Ahadeeth are difficult, becoming more difficult. None can bear it except for an enlightened chest, or a tranquil heart, or excellent morals. Allah<sup>azwj</sup> Took the Covenant from our<sup>asws</sup> Shias just as He<sup>azwj</sup> Took upon the Children of Adam<sup>as</sup> <span class=\"ibTxt\">[7:172] Am I not your Lord?</span> So the one who was loyal to us<sup>asws</sup>, Allah<sup>azwj</sup> would be Loyal to him with the Paradise, and the one who hates us<sup>asws</sup> and does not fulfill our<sup>asws</sup> rights to us<sup>asws</sup>, so in the Fire he will abide eternally’."
          ],
          "en.sarwar": [
            " 3. Ali ibn Ibrahim has narrated from his father from al-Barqi from ibn Sinan or others in a marfu‘ manner from abu ‘Abdallah (a.s.) who has said the following. “Our Hadith (statements) are difficult and they become difficult. Only well lighted chests, the well protected of virtuous moral abilities are capable to accept them.” Allah has taken a pledge from our Shi‘a (followers) just as He has taken such pledge from the children of Adam (Am I not Your Lord?” Whoever would remain loyal to us Allah will grant then paradise. Whoever would dislike us and would not deliver our rights to us they will live in fire forever.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (318/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1050,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:102:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى وَ غَيْرُهُ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ بَعْضِ أَصْحَابِنَا قَالَ كَتَبْتُ إِلَى أَبِي الْحَسَنِ صَاحِبِ الْعَسْكَرِ ( عليه السلام ) جُعِلْتُ فِدَاكَ مَا مَعْنَى قَوْلِ الصَّادِقِ ( عليه السلام ) حَدِيثُنَا لَا يَحْتَمِلُهُ مَلَكٌ مُقَرَّبٌ وَ لَا نَبِيٌّ مُرْسَلٌ وَ لَا مُؤْمِنٌ امْتَحَنَ اللَّهُ قَلْبَهُ لِلْإِيمَانِ ",
          "فَجَاءَ الْجَوَابُ إِنَّمَا مَعْنَى قَوْلِ الصَّادِقِ ( عليه السلام ) أَيْ لَا يَحْتَمِلُهُ مَلَكٌ وَ لَا نَبِيٌّ وَ لَا مُؤْمِنٌ إِنَّ الْمَلَكَ لَا يَحْتَمِلُهُ حَتَّى يُخْرِجَهُ إِلَى مَلَكٍ غَيْرِهِ وَ النَّبِيُّ لَا يَحْتَمِلُهُ حَتَّى يُخْرِجَهُ إِلَى نَبِيٍّ غَيْرِهِ وَ الْمُؤْمِنُ لَا يَحْتَمِلُهُ حَتَّى يُخْرِجَهُ إِلَى مُؤْمِنٍ غَيْرِهِ فَهَذَا مَعْنَى قَوْلِ جَدِّي ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya and others, from Muhammad Bin Ahmad, from one of our companions who said, ",
            "‘I wrote to Abu Al-Hassan Sahib Al-Askar<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! What is the meaning of the words of Al-Sadiq<sup>asws</sup>: ‘Our<sup>asws</sup> Ahadeeth, none can bear it except for an Angel of Proximity, nor a <span class=\"iTxt\">Mursil</span> Prophet<sup>as</sup>, nor a <span class=\"iTxt\">Momin </span>whose heart Allah<sup>azwj</sup> has Tested for the <span class=\"iTxt\">Eman</span>’?’. ",
            "So the answer came: ‘But rather, the meaning of the words of Al-Sadiq<sup>asws</sup>, i.e., neither can an Angel bear it, nor a Prophet<sup>as</sup>, nor a <span class=\"iTxt\">Momin</span>, is that the Angel cannot bear it until he brings it out (narrates) to another Angel, and the Prophet<sup>as</sup> cannot bear it until he<sup>as</sup> brings it out to another Prophet<sup>as</sup>, and the <span class=\"iTxt\">Momin </span>cannot bear it until he brings it out to another <span class=\"iTxt\">Momin</span>. So this is the meaning of the words of my<sup>asws</sup> grandfather<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 4. Muhammad ibn Yahya and others have narrated from Muhammad ibn Ahmad from one of our people the following. “I wrote to Imam al-Hassan al_’Askari (a.s.) saying, May Allah take my soul in service for your cause, what is the meaning of the following Hadith of Imam Ja‘far al-Sadiq (a.s.)? “Our Hadith (statements) are difficult and they become difficult. No one is capable to bear them not even an angel or a prophet who is also a messenger or a believer whose heart Allah has tested for faith.?” The answer came as herein below. “The meaning of the words the truthful one ‘that angels, prophets and believers are not capable to accept them’ is that of the truthful one is that the angel does bear it until he deliver it to other angels. The prophet does noor bear it until he delivers it to another prophet and the believer does not bear it until he delivers to another believer. This is the meaning of the words of my grandfather.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (319/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1051,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:102:5",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مَنْصُورِ بْنِ الْعَبَّاسِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْخَالِقِ وَ أَبِي بَصِيرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا أَبَا مُحَمَّدٍ إِنَّ عِنْدَنَا وَ اللَّهِ سِرّاً مِنْ سِرِّ اللَّهِ وَ عِلْماً مِنْ عِلْمِ اللَّهِ وَ اللَّهِ مَا يَحْتَمِلُهُ مَلَكٌ مُقَرَّبٌ وَ لَا نَبِيٌّ مُرْسَلٌ وَ لَا مُؤْمِنٌ امْتَحَنَ اللَّهُ قَلْبَهُ لِلْإِيمَانِ وَ اللَّهِ مَا كَلَّفَ اللَّهُ ذَلِكَ أَحَداً غَيْرَنَا وَ لَا اسْتَعْبَدَ بِذَلِكَ أَحَداً غَيْرَنَا",
          "َ إِنَّ عِنْدَنَا سِرّاً مِنْ سِرِّ اللَّهِ وَ عِلْماً مِنْ عِلْمِ اللَّهِ أَمَرَنَا اللَّهُ بِتَبْلِيغِهِ فَبَلَّغْنَا عَنِ اللَّهِ عَزَّ وَ جَلَّ مَا أَمَرَنَا بِتَبْلِيغِهِ فَلَمْ نَجِدْ لَهُ مَوْضِعاً وَ لَا أَهْلًا وَ لَا حَمَّالَةً يَحْتَمِلُونَهُ حَتَّى خَلَقَ اللَّهُ لِذَلِكَ أَقْوَاماً خُلِقُوا مِنْ طِينَةٍ خُلِقَ مِنْهَا مُحَمَّدٌ وَ آلُهُ وَ ذُرِّيَّتُهُ ( عليهم السلام ) وَ مِنْ نُورٍ خَلَقَ اللَّهُ مِنْهُ مُحَمَّداً وَ ذُرِّيَّتَهُ وَ صَنَعَهُمْ بِفَضْلِ رَحْمَتِهِ الَّتِي صَنَعَ مِنْهَا مُحَمَّداً وَ ذُرِّيَّتَهُ",
          "و فَبَلَّغْنَا عَنِ اللَّهِ مَا أَمَرَنَا بِتَبْلِيغِهِ فَقَبِلُوهُ وَ احْتَمَلُوا ذَلِكَ فَبَلَغَهُمْ ذَلِكَ عَنَّا فَقَبِلُوهُ وَ احْتَمَلُوهُ وَ بَلَغَهُمْ ذِكْرُنَا فَمَالَتْ قُلُوبُهُمْ إِلَى مَعْرِفَتِنَا وَ حَدِيثِنَا فَلَوْ لَا أَنَّهُمْ خُلِقُوا مِنْ هَذَا لَمَا كَانُوا كَذَلِكَ لَا وَ اللَّهِ مَا احْتَمَلُوهُ",
          "ثُمَّ قَالَ إِنَّ اللَّهَ خَلَقَ أَقْوَاماً لِجَهَنَّمَ وَ النَّارِ فَأَمَرَنَا أَنْ نُبَلِّغَهُمْ كَمَا بَلَّغْنَاهُمْ وَ اشْمَأَزُّوا مِنْ ذَلِكَ وَ نَفَرَتْ قُلُوبُهُمْ وَ رَدُّوهُ عَلَيْنَا وَ لَمْ يَحْتَمِلُوهُ وَ كَذَّبُوا بِهِ وَ قَالُوا سَاحِرٌ كَذَّابٌ فَطَبَعَ اللَّهُ عَلَى قُلُوبِهِمْ وَ أَنْسَاهُمْ ذَلِكَ ثُمَّ أَطْلَقَ اللَّهُ لِسَانَهُمْ بِبَعْضِ الْحَقِّ فَهُمْ يَنْطِقُونَ بِهِ وَ قُلُوبُهُمْ مُنْكِرَةٌ لِيَكُونَ ذَلِكَ دَفْعاً عَنْ أَوْلِيَائِهِ وَ أَهْلِ طَاعَتِهِ",
          "وَ لَوْ لَا ذَلِكَ مَا عُبِدَ اللَّهُ فِي أَرْضِهِ فَأَمَرَنَا بِالْكَفِّ عَنْهُمْ وَ السَّتْرِ وَ الْكِتْمَانِ فَاكْتُمُوا عَمَّنْ أَمَرَ اللَّهُ بِالْكَفِّ عَنْهُ وَ اسْتُرُوا عَمَّنْ أَمَرَ اللَّهُ بِالسَّتْرِ وَ الْكِتْمَانِ عَنْهُ",
          "قَالَ ثُمَّ رَفَعَ يَدَهُ وَ بَكَى وَ قَالَ اللَّهُمَّ إِنَّ هَؤُلَاءِ لَشِرْذِمَةٌ قَلِيلُونَ فَاجْعَلْ مَحْيَانَا مَحْيَاهُمْ وَ مَمَاتَنَا مَمَاتَهُمْ وَ لَا تُسَلِّطْ عَلَيْهِمْ عَدُوّاً لَكَ فَتُفْجِعَنَا بِهِمْ فَإِنَّكَ إِنْ أَفْجَعْتَنَا بِهِمْ لَمْ تُعْبَدْ أَبَداً فِي أَرْضِكَ وَ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ آلِهِ وَ سَلَّمَ تَسْلِيماً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Muhammad Bin Al Husayn, from Mansour Bin Al Abbas, from Safwan Bin Yahya, from Abdullah Bin Muskan, from Muhammad Bin Abdul Khaliq and Abu Baseer who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘O Abu Muhammad! With us<sup>asws</sup> are secrets from the Secrets of Allah<sup>azwj</sup>, and knowledge from Knowledge of Allah<sup>azwj</sup>. By Allah<sup>azwj</sup>! Neither can an Angel of Proximity bear it, nor a <span class=\"iTxt\">Mursil</span> Prophet<sup>as</sup>, nor a <span class=\"iTxt\">Momin </span>whose heart Allah<sup>azwj</sup> has Tested for the <span class=\"iTxt\">Eman</span>. By Allah<sup>azwj</sup>! Allah<sup>azwj</sup> has not Encumbered anyone with that apart from us<sup>asws</sup> nor is He<sup>azwj</sup> worshipped by anyone with that apart from us<sup>asws</sup>. ",
            "And with us<sup>asws</sup> there are secrets from the Secrets of Allah<sup>azwj</sup> and knowledge from the Knowledge of Allah<sup>azwj</sup>. Allah<sup>azwj</sup> Commanded us<sup>asws</sup> with it’s delivery, so we<sup>asws</sup> delivered it on behalf of Allah<sup>azwj</sup> Mighty and Majestic what He<sup>azwj</sup> had commanded us<sup>asws</sup> with it’s delivery. But, we<sup>asws</sup> did not find a place for it nor a deserving one nor any bearers who could be bearing it until Allah<sup>azwj</sup> Created a people for that. They were Created from the clay from which Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> and his<sup>saww</sup> offspring were Created from, and from a Light from which Allah<sup>azwj</sup> had Created Muhammad<sup>saww</sup> and his<sup>saww</sup> offspring, and Made them with the Grace of His<sup>azwj</sup> Mercy from which Muhammad<sup>saww</sup> and his<sup>asws</sup> offspring had been Made. ",
            "Thus, we delivered on behalf of Allah<sup>azwj</sup> what He<sup>azwj</sup> had Commanded with it’s delivery, and they accepted it and are bearing that. So we delivered that to them from us and they accepted it and are bearing it, and we<sup>asws</sup> delivered our<sup>asws</sup> mention (<span class=\"iTxt\">Zikr</span>). So their hearts inclined towards our<sup>asws</sup> recognition and our<sup>asws</sup> Ahadeeth. So, had they not been created from this, they would not have been like that. No, by Allah<sup>azwj</sup>, they would not have been bearing it’.",
            "Then he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Created a people for Hell and the Fire. So He<sup>azwj</sup> Commanded us<sup>asws</sup> that we<sup>asws</sup> deliver to them just as we<sup>asws</sup> had delivered to those (Shias), and they were constricted from that, and their hearts were alienated and they rejected it upon us<sup>asws</sup> and they did not bear it, and they belied with it and they said, ‘A lying magician’. Therefore, Allah<sup>azwj</sup> Sealed upon their hearts and they forgot that. Then Allah<sup>azwj</sup> Release their tongues with some of the truth, so they are speaking with it, and they hearts are in denial, it order for that to become a defence from His<sup>azwj</sup> Guardians<sup>asws</sup> and the people of His<sup>azwj</sup> obedience. ",
            "And had it not been for that, Allah<sup>azwj</sup> would not have been worshipped in His<sup>azwj</sup> earth. Thus, we<sup>asws</sup> ordered with the refraining from them, and the veiling, and the concealment. So they (Shias) concealed it from the ones whom Allah<sup>azwj</sup> Commanded from the rerefrainment from, and they veiled it from the ones whom Allah<sup>azwj</sup> Commanded with the veiling and the concealment from’. ",
            "He (the narrator) said, ‘Then he<sup>asws</sup> raised his<sup>asws</sup> hands and wept, and said: ‘O Allah<sup>azwj</sup>! They are a fragmented few (a very small group), therefore Make our<sup>asws</sup> way of living their way of living, and our<sup>asws</sup> manner of death their manner of death, and do not Let Your<sup>azwj</sup> enemies to overcome upon them so they would be grieved by them, for, if You<sup>azwj</sup> let them to be grieved by them, You<sup>azwj</sup> would not be worshipped in Your<sup>azwj</sup> earth, ever! And Send <span class=\"iTxt\">Salawat</span> upon Muhammad<sup>saww</sup> and his<sup>saww</sup> Pogeny<sup>asws</sup>, and Greetings of abundant greetings’."
          ],
          "en.sarwar": [
            " 5. Ahmad ibn Muhammad has narrated from Muhammad ibn al-Husayn from Mansur ibn al-‘Abbass from Safwan ibn Yahya from ‘Abdallah ibn Muskan from Muhammad ibn ‘Abd al-Khaliq and abu Basir who has said the following. “Abu ‘Abdallah (a.s.) said, ‘O abu Muhammad, with us there is a secret of the secrets of Allah and a knowledge of the knowledge of Allah. No angel, near to Allah or a prophet who is a messenger also and no believer whose heart Allah has tested for faith is capable to bear. By Allah, Allah has not required anyone to bear it except us nor has He required anyone to worship him in that way except us. With us there is a secret of the secrets of Allah and a knowledge of the knowledge of Allah. Allah has commanded us to preach it We then preached what Allah, the Most Majestic, the Most gracious, had commanded us to preaCh However, we did not find a proper place for it or a people or bearers who accept it until Allah created certain tribes. These people were created from the clay out of which Muhammad and his descendants were created and from a light from which Allah had created Muhammad and his descendants. He made them with the excess of the making of His blessings out of which He had made Muhammad and his descendants. We then preached what Allah had commanded us to preach then these people accepted and acknowledged that. [It reached them from us and they accepted and acknowledged it]. Our mention reached them and their hearts inclined towards us, recognizing us and our hadith. Had they not been created from this they would not have been as suCh No, by Allah, they would not have acknowledged.” Then the Imam (a.s.) said, “Allah created certain tribes for Hell and fire. He then commanded us to preach to them as we had preached to them but to the later ones it seemed repugnant and their hearts felt hatred and they rejected it from us, did not acknowledge it and considered it as lies and they said, “They are magicians and liars.” Allah then placed a seal on their hearts and made them to forget. Allah then opened their tongue with some of the truth. Thus, they speak of it but their hearts are in denial. He uses it in defense of His friends and those who obey Him. Had it not been there no one would have worshipped Allah on earth. He commanded us to withheld it from them, hide and conceal. You must also hide it from those that Allah has commanded to withheld from and hide from those that Allah has commanded to hide and withheld from.” The narrator has said that the Imam (a.s.) then raised his hands and wept and said, “O Lord, this is a very small group. Make our lives as their lives and our death like their death. Do not make dominant over them any of Your enemies that would cause us suffer pains for their suffering. If You would allow it to cause pains to us because of their sufferings no one would worship You on earth. May Allah send blessing up on Muhammad and his Ahl al-Bayt and may (Your) peace and more peace be with them.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:102",
  "kind": "verse_list"
}