{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 103"
        },
        "path": "/books/al-kafi:1:4:103",
        "titles": {
          "ar": "باب مَا أَمَرَ النَّبِيُّ ( صلى الله عليه وآله ) بِالنَّصِيحَةِ لِأَئِمَّةِ الْمُسْلِمِينَ وَ اللُّزُومِ لِجَمَاعَتِهِمْ وَ مَنْ هُمْ",
          "en": "Chapter 103 – What the Prophet<sup>saww</sup> ordered with the advice of the Imams<sup>asws</sup> of the Muslims and the necessitation to their<sup>asws</sup> gatherings, and who they<sup>asws</sup> are"
        }
      }
    ],
    "index": 161,
    "local_index": 103,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 104"
        },
        "path": "/books/al-kafi:1:4:104",
        "titles": {
          "ar": "باب مَا يَجِبُ مِنْ حَقِّ الْإِمَامِ عَلَى الرَّعِيَّةِ وَ حَقِّ الرَّعِيَّةِ عَلَى الْإِمَامِ",
          "en": "Chapter 104 – What is Obligated from the rights of the Imam<sup>asws</sup> upon the citizen and the rights of the citizen upon the Imam<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 102"
        },
        "path": "/books/al-kafi:1:4:102",
        "titles": {
          "ar": "باب فِيمَا جَاءَ أَنَّ حَدِيثَهُمْ صَعْبٌ مُسْتَصْعَبٌ",
          "en": "Chapter 102 – Regarding what has come that their Ahadeeth are difficult, becoming more difficult"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:103",
    "titles": {
      "ar": "باب مَا أَمَرَ النَّبِيُّ ( صلى الله عليه وآله ) بِالنَّصِيحَةِ لِأَئِمَّةِ الْمُسْلِمِينَ وَ اللُّزُومِ لِجَمَاعَتِهِمْ وَ مَنْ هُمْ",
      "en": "Chapter 103 – What the Prophet<sup>saww</sup> ordered with the advice of the Imams<sup>asws</sup> of the Muslims and the necessitation to their<sup>asws</sup> gatherings, and who they<sup>asws</sup> are"
    },
    "verse_count": 5,
    "verse_start_index": 1051,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح بسنديه    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/323)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/49)"
        ],
        "index": 1052,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/239",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/257",
              "text": "أَبَانِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/66",
              "text": "ابْنِ أَبِي يَعْفُورٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنِ ابْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:103:1",
        "text": [
          " رَسُولَ اللَّهِ ( صلى الله عليه وآله ) خَطَبَ النَّاسَ فِي مَسْجِدِ الْخَيْفِ فَقَالَ نَضَّرَ اللَّهُ عَبْداً سَمِعَ مَقَالَتِي فَوَعَاهَا وَ حَفِظَهَا وَ بَلَّغَهَا مَنْ لَمْ يَسْمَعْهَا فَرُبَّ حَامِلِ فِقْهٍ غَيْرُ فَقِيهٍ وَ رُبَّ حَامِلِ فِقْهٍ إِلَى مَنْ هُوَ أَفْقَهُ مِنْهُ ثَلَاثٌ لَا يُغِلُّ عَلَيْهِنَّ قَلْبُ امْرِئٍ مُسْلِمٍ إِخْلَاصُ الْعَمَلِ لِلَّهِ وَ النَّصِيحَةُ لِأَئِمَّةِ الْمُسْلِمِينَ وَ اللُّزُومُ لِجَمَاعَتِهِمْ فَإِنَّ دَعْوَتَهُمْ مُحِيطَةٌ مِنْ وَرَائِهِمْ الْمُسْلِمُونَ إِخْوَةٌ تَتَكَافَأُ دِمَاؤُهُمْ وَ يَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ .",
          "وَ رَوَاهُ أَيْضاً عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ أَبَانٍ عَنِ ابْنِ أَبِي يَعْفُورٍ مِثْلَهُ وَ زَادَ فِيهِ وَ هُمْ يَدٌ عَلَى مَنْ سِوَاهُمْ وَ ذَكَرَ فِي حَدِيثِهِ أَنَّهُ خَطَبَ فِي حَجَّةِ الْوَدَاعِ بِمِنًى فِي مَسْجِدِ الْخَيْفِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ahmad Bin Muhammad Bin Abu Nasr, from Aban Bin Usman, from Ibn Abu Yafour, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that: ‘Rasool-Allah<sup>azwj</sup> addressed the people in Masjid Al-Kheif, so he<sup>saww</sup> said: ‘May Allah<sup>azwj</sup> Flourish (Grant Joy and Happiness) the servant who hears my<sup>asws</sup> speech, so he retains it and preserves it and delivers it to the one who did not hear it. Sometimes a bearer’s understanding is other than his (the transmitter’s) understanding, and sometimes a bearer would be of more understanding than him (the transmitter). There are three upon which a Muslim’s heart of a Muslim does not feel greed/envy – Sincerity of the deed for Allah<sup>azwj</sup>, and the advice of the Imams<sup>asws</sup> of the Muslims, and the necessitation to their<sup>asws</sup> gatherings, for their<sup>asws</sup> invitation encompasses from behind them. The Muslims are brothers, their bloods are a match for each other, and their lowest one strives for their responsibilities’.",
            "And it is reported as well, from Hammad Bin Usman, from Aban, from Ibn Abu Yafour, similar to it, and there is an increase in it, (He<sup>saww</sup> said): ‘And they are one hand to face their enemies’, and he mentioned in his Hadeeth that he<sup>saww</sup> addressed during the farewell Hajj at Mina in Masjid Al-Kheif."
          ],
          "en.sarwar": [
            " 1. A number of our people has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ahmad ibn Muhammad ibn abu Nasr from Aban ibnn ‘Uthman from ibn abu Ya‘fur from abu ‘Abdallah (a.s.) who has said the following. “The the Messenger of Allah addressed people in the mosque of Khif and said, “May Allah grant joy and happiness to those of His servants that on hearing my words understand them, memorize them preach them to those who have not heard them. There can be many scholars of Fiqh (law) who do not have understanding as there can be many bearers of Fiqh (law) to those who are better scholars of Fiqh (law) then the bearer. There are three things in which the heart of a Muslim does not feel greed and treachery. Sincerity in deeds for Allah, wishing well for the leaders of the Muslims and to stay close with the group of the Muslims because their prayer encompass them from behind them and the Muslims are each other’s brothers. Their lives are as each other’s lives and the least important among them strive to fulfill their responsibilities.” Hammad ibn ‘Uthman from Aban from ibn abu Ya‘fur has narrated a similar hadith with an addition of “They are as one hand to face their enemies”. In his Hadith he has mentioned that the Holy Prophet (s.a) made his speech during his farewell pilgrimage in the mosque of Khif."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/327)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1053,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/75",
              "text": "مُحَمَّدُ بْنُ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/18",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/789",
              "text": "الْحَكَمِ بْنِ مِسْكِينٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1098",
              "text": "رَجُلٍ مِنْ قُرَيْشٍ مِنْ أَهْلِ مَكَّةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ الْحَسَنِ عَنْ بَعْضِ أَصْحَابِنَا عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْحَكَمِ بْنِ مِسْكِينٍ عَنْ رَجُلٍ مِنْ قُرَيْشٍ مِنْ أَهْلِ مَكَّةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:103:2",
        "text": [
          " قَالَ سُفْيَانُ الثَّوْرِيُّ اذْهَبْ بِنَا إِلَى جَعْفَرِ بْنِ مُحَمَّدٍ قَالَ فَذَهَبْتُ مَعَهُ إِلَيْهِ فَوَجَدْنَاهُ قَدْ رَكِبَ دَابَّتَهُ فَقَالَ لَهُ سُفْيَانُ يَا أَبَا عَبْدِ اللَّهِ حَدِّثْنَا بِحَدِيثِ خُطْبَةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فِي مَسْجِدِ الْخَيْفِ قَالَ دَعْنِي حَتَّى أَذْهَبَ فِي حَاجَتِي فَإِنِّي قَدْ رَكِبْتُ فَإِذَا جِئْتُ حَدَّثْتُكَ",
          "فَقَالَ أَسْأَلُكَ بِقَرَابَتِكَ مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) لَمَّا حَدَّثْتَنِي قَالَ فَنَزَلَ فَقَالَ لَهُ سُفْيَانُ مُرْ لِي بِدَوَاةٍ وَ قِرْطَاسٍ حَتَّى أُثْبِتَهُ فَدَعَا بِهِ ثُمَّ قَالَ اكْتُبْ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ خُطْبَةُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فِي مَسْجِدِ الْخَيْفِ نَضَّرَ اللَّهُ عَبْداً سَمِعَ مَقَالَتِي فَوَعَاهَا وَ بَلَّغَهَا مَنْ لَمْ تَبْلُغْهُ",
          "يَا أَيُّهَا النَّاسُ لِيُبَلِّغِ الشَّاهِدُ الْغَائِبَ فَرُبَّ حَامِلِ فِقْهٍ لَيْسَ بِفَقِيهٍ وَ رُبَّ حَامِلِ فِقْهٍ إِلَى مَنْ هُوَ أَفْقَهُ مِنْهُ ثَلَاثٌ لَا يُغِلُّ عَلَيْهِنَّ قَلْبُ امْرِئٍ مُسْلِمٍ إِخْلَاصُ الْعَمَلِ لِلَّهِ وَ النَّصِيحَةُ لِأَئِمَّةِ الْمُسْلِمِينَ وَ اللُّزُومُ لِجَمَاعَتِهِمْ فَإِنَّ دَعْوَتَهُمْ مُحِيطَةٌ مِنْ وَرَائِهِمْ الْمُؤْمِنُونَ إِخْوَةٌ تَتَكَافَأُ دِمَاؤُهُمْ وَ هُمْ يَدٌ عَلَى مَنْ سِوَاهُمْ يَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ",
          "فَكَتَبَهُ سُفْيَانُ ثُمَّ عَرَضَهُ عَلَيْهِ وَ رَكِبَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ جِئْتُ أَنَا وَ سُفْيَانُ فَلَمَّا كُنَّا فِي بَعْضِ الطَّرِيقِ قَالَ لِي كَمَا أَنْتَ حَتَّى أَنْظُرَ فِي هَذَا الْحَدِيثِ فَقُلْتُ لَهُ قَدْ وَ اللَّهِ أَلْزَمَ أَبُو عَبْدِ اللَّهِ رَقَبَتَكَ شَيْئاً لَا يَذْهَبُ مِنْ رَقَبَتِكَ أَبَداً فَقَالَ وَ أَيُّ شَيْ‏ءٍ ذَلِكَ",
          "فَقُلْتُ لَهُ ثَلَاثٌ لَا يُغِلُّ عَلَيْهِنَّ قَلْبُ امْرِئٍ مُسْلِمٍ إِخْلَاصُ الْعَمَلِ لِلَّهِ قَدْ عَرَفْنَاهُ وَ النَّصِيحَةُ لِأَئِمَّةِ الْمُسْلِمِينَ مَنْ هَؤُلَاءِ الْأَئِمَّةُ الَّذِينَ يَجِبُ عَلَيْنَا نَصِيحَتُهُمْ مُعَاوِيَةُ بْنُ أَبِي سُفْيَانَ وَ يَزِيدُ بْنُ مُعَاوِيَةَ وَ مَرْوَانُ بْنُ الْحَكَمِ وَ كُلُّ مَنْ لَا تَجُوزُ شَهَادَتُهُ عِنْدَنَا وَ لَا تَجُوزُ الصَّلَاةُ خَلْفَهُمْ",
          "وَ قَوْلُهُ وَ اللُّزُومُ لِجَمَاعَتِهِمْ فَأَيُّ الْجَمَاعَةِ مُرْجِئٌ يَقُولُ مَنْ لَمْ يُصَلِّ وَ لَمْ يَصُمْ وَ لَمْ يَغْتَسِلْ مِنْ جَنَابَةٍ وَ هَدَمَ الْكَعْبَةَ وَ نَكَحَ أُمَّهُ فَهُوَ عَلَى إِيمَانِ جَبْرَئِيلَ وَ مِيكَائِيلَ أَوْ قَدَرِيٌّ يَقُولُ لَا يَكُونُ مَا شَاءَ اللَّهُ عَزَّ وَ جَلَّ وَ يَكُونُ مَا شَاءَ إِبْلِيسُ أَوْ حَرُورِيٌّ يَتَبَرَّأُ مِنْ عَلِيِّ بْنِ أَبِي طَالِبٍ وَ شَهِدَ عَلَيْهِ بِالْكُفْرِ أَوْ جَهْمِيٌّ يَقُولُ إِنَّمَا هِيَ مَعْرِفَةُ اللَّهِ وَحْدَهُ لَيْسَ الْإِيمَانُ شَيْ‏ءٌ غَيْرُهَا",
          "قَالَ وَيْحَكَ وَ أَيَّ شَيْ‏ءٍ يَقُولُونَ فَقُلْتُ يَقُولُونَ إِنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ ( عليه السلام ) وَ اللَّهِ الْإِمَامُ الَّذِي يَجِبُ عَلَيْنَا نَصِيحَتُهُ وَ لُزُومُ جَمَاعَتِهِمْ أَهْلُ بَيْتِهِ قَالَ فَأَخَذَ الْكِتَابَ فَخَرَقَهُ ثُمَّ قَالَ لَا تُخْبِرْ بِهَا أَحَداً."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Hassan, from some of our companions, from Ali Bin Al Hakam, from Al Hakam Bin Miskeen, from a man of Qureysh from the people of Makkah who said, ",
            "‘Sufyan Al-Sowry said, ‘Come with us to Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>’. So I went with him to him<sup>asws</sup>, and we found him<sup>asws</sup> to have ridden his<sup>asws</sup> animal. So Sufyan said to him<sup>asws</sup>: ‘O Abu Abdullah<sup>asws</sup>! Narrate to us with the Hadeeth of the address of Rasool-Allah<sup>saww</sup> in Masjid Al-Kheif’. He<sup>asws</sup> said: ‘Leave me<sup>asws</sup> until I<sup>asws</sup> go regarding my<sup>asws</sup> need, for I<sup>asws</sup> have already mounted. So when I<sup>asws</sup> come back, I<sup>asws</sup> shall narrate to you’. ",
            "So he said: ‘I ask you<sup>asws</sup> by your<sup>asws</sup> relationship from Rasool-Allah<sup>saww</sup> why not narrate to me?’ So he<sup>asws</sup> descended, and Sufyan said to him<sup>asws</sup>, ‘Order with the ink and the paper until I affirm it’. So he<sup>asws</sup> called for it, then said: ‘Write! In the Name of Allah<sup>azwj</sup> the Beneficent, the Merciful. Rasool-Allah<sup>saww</sup> addressed the people in Masjid Al-Kheif: ‘May Allah<sup>azwj</sup> Flourish a servant who hears my<sup>saww</sup> speech, so he retains it and delivers it to the one whom it has not reached. ",
            "O you people! Let the ones present deliver it to the absent ones, so sometimes the bearer isn’t with his understanding, and sometimes the bearer delivers it to the one who is more understanding that him. Three would not be begrudged upon by a heart of a Muslim person – Sincerity of the deed for Allah<sup>azwj</sup>, and the advice of the Imams<sup>asws</sup> of the Muslims, and the necessity to their<sup>asws</sup> gatherings, for their<sup>asws</sup> invitation would be encompassing from their backs. The <span class=\"iTxt\">Momineen</span> are brethren, their bloods are a match for each other and they are one hand against the ones besides them, their lowest one striving for their responsibilities’’.",
            "So Sufyan wrote it, then displayed it to him<sup>asws</sup>, and Abu Abdullah<sup>asws</sup> mounted, and I and Sufyan came back. So when we were in one of the roads, he said to me, ‘Stay as you are until I look into this Hadeeth’. So I said to him, ‘But, by Allah<sup>azwj</sup>, Abu Abdullah<sup>asws</sup> has necessitated something on your neck which will never go away from your neck, ever!’ So he said, ‘And which thing is that?’ ",
            "So I said to him, ‘Three would not be begrudged upon by a heart of a Muslim person – Sincerity of the deed for Allah<sup>azwj</sup>. We have recognised it. And the advice of the Imams<sup>asws</sup> of the Muslim. Who are these Imams<sup>asws</sup> whose advice is obligated upon us? Muawiya Bin Abu Sufyan, and Yazeed Bin Muawiya, and Marwan Bin Al Hakam, and every one who testimony is not allowed with us, and praying <span class=\"iTxt\">Salat</span> behind them is not allowed? ",
            "And his<sup>saww</sup> words: ‘and the necessity to their<sup>asws</sup> gatherings’. So which gathering? The Murjiites are saying, ‘The one who does not pray <span class=\"iTxt\">Salat</span>, and does not Fast, and does not wash from sexual impurities, and demolishes the Kabah, and marries his own mother, so he is upon the faith of Jibraeel<sup>as</sup> and Mikaeel<sup>as</sup>? Of the Qadiriites who are saying, ‘What Allah<sup>azwj</sup> Mighty and Majestic Desires may not happen and what Iblees<sup>la</sup> so desires may happen’? Or the Harouiryya who are disavowing from Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> and are testifying upon him<sup>asws</sup> with the disbelief? Or the Jahmiys who are saying, ‘But rather it is the recognition that Allah<sup>azwj</sup> is One, there isn’t the <span class=\"iTxt\">Eman</span> anything other than it?’ ",
            "He said, ‘Woe be unto you! And which thing was he<sup>asws</sup> saying: ‘So I said, ‘He<sup>asws</sup> is saying that Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, by Allah<sup>azwj</sup>, is the Imam<sup>asws</sup> whose advice is Obligated upon us, and the necessitation of their<sup>asws</sup> gatherings, the People<sup>asws</sup> of his<sup>saww</sup> Household’. So he brought out the letter and burnt it, then said, ‘Do not inform anyone with it’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn al-Hassan has narrated from some of our people from Ali ibn al-Hakam from Hakam ibn Miskin from a man from Quraysh from the people of Makka who has said the following. “Once Sufyan al-Thawri said to me, “Come with to meet Ja‘far ibn Muhammad (a.s.).” The narrator has said that he went with him and they found Ja‘far ibn Muhammad (a.s.) had already rode his horse. Sufyan said to him, “O abu ‘Abdallah narrate to us the text of the sermon of the Messenger of Allah in the Mosque of al-Khif.” He said, “allow me to go for my needs because I am already on the horse back and when I will return then I will narrate to the text of the sermon.” He said, “I swear you to your close relation to the Messenger of Allah, you must narrate the sermon first.” The narrator has said that the Imam (a.s.) dismounted his horse. Sufyan said to him, “Ask someone to bring me ink and paper so I can write it down.” He asked for ink and paper and it was brought for him. The he said writhe, “In the name of Allah, the Beneficent, the Merciful the sermon of the Messenger of Allah in the Mosque of al-Khif “May Allah grant joy and happiness a servant who would listen to my words, then understands them and would deliver them to those who have not heard them. O people, those of you present here must deliver them to those absent. There can be many scholars of Fiqh (law) who do not have understanding as there can be many bearers of Fiqh (law) to those who are better scholars of Fiqh (law) then the bearer. There are three things in which the heart of a Muslim does not feel greed and treachery. Sincerity in deeds for Allah, wishing well for the Imams (leaders) of the Muslims and to stay close with the group of the Muslims because their call encompass those behind them and the Muslims are each other’s brothers. Their lives are as each other’s lives and they act as one hand against their enemies and the least important among them strive to fulfill their responsibilities.” Sufyan wrote it down and proof read before him. Abu ‘Abdallah (a.s.) then rode his horse. I and Sufyan came back. Somewhere on the way he said, “Stay where you are. I want to look at this Hadith.” I then said to him, “There is no doubt, by Allah, that abu ‘Abdallah (a.s.) has tied something to your neck as such that it will never go away.” He aske, “What is that thing?” I then said, “There are three things in which the heart of a Muslim does not feel greed and treachery. Sincerity in deeds for Allah, is one that we know it. The other one is ‘Wishing well for the Imams of the Muslims.’ Who are these Imams for whom we must wish well? Are they Mu‘awiya ibn abu Sufyan and Yazid ibn Mu‘awiya and Marwan ibn al-Hakam? (They are such disqualified people that) the testimony of no one of them is acceptable to us and it is not permissible to pray behind them.” Also his words, “Stay close with their group” Which group is it? Is it the Muji‘a group that says, “Those who do perform prayers, do not fast, do not clean and wash themselves after carnal relations, cause the destruction of the Ka‘ba or marry his own mother have the same degree of faith as those of angel Jibril and Mika’il. Is it the Qadri, (pre-destinationist) who say, “What Allah, the Most Majestic, the Most gracious, say will not happen but Satan says will happen.”? Is it the Harawri group who is the enemy of Ali ibn abu Talib (a.s.) and call him an unbeliever? Is it the Jahmiy group who says that the only thing needed is to know Allah only is faith and nothing else is required?” He then said, “Woe is you, what then they say?” I said, “They say, “Ali ibn abu Talib, by Allah, is the Imam for whom we must wish well. To must stay close to their group means, his Ahl al-Bayt (members of the family of Prophet Muhammad).’ The narrator has said that Sufyan al-Thawri then tore the document of Zadith and said, “Do not tell it to anyone.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/331)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (49/ 1)"
        ],
        "index": 1054,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/132",
              "text": "حَمَّادِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/190",
              "text": "حَرِيزٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/542",
              "text": "بُرَيْدِ بْنِ مُعَاوِيَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ بُرَيْدِ بْنِ مُعَاوِيَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:103:3",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَا نَظَرَ اللَّهُ عَزَّ وَ جَلَّ إِلَى وَلِيٍّ لَهُ يُجْهِدُ نَفْسَهُ بِالطَّاعَةِ لِإِمَامِهِ وَ النَّصِيحَةِ إِلَّا كَانَ مَعَنَا فِي الرَّفِيقِ الْأَعْلَى ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Hammad Bin Isa, from Hareyz, from Bureyd Bin Muawiya, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic continues Looking to a friend of His<sup>azwj</sup>, who strived himself with obedience to his Imam<sup>asws</sup> and the advice until he will find himself with us<sup>asws</sup> among the lofty friends’."
          ],
          "en.sarwar": [
            " 3. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Yahya from Ahmad ibn Muhammad all together from Hammad ibn ‘Isa from Hariz from Burayd ibn Mu‘awiya from abu Ja‘far (a.s.) who has said the following. “the Messenger of Allah has said, ‘Allah, the Most Majestic, the Most gracious, would not look to a friend of His who would strive and pressure his soul in obedience to his Imam and wishing well for him but that he will be with us in the high position in paradise.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/332)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1055,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/762",
              "text": "أَبِي جَمِيلَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1099",
              "text": "مُحَمَّدٍ الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ أَبِي جَمِيلَةَ عَنْ مُحَمَّدٍ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:103:4",
        "text": [
          " مَنْ فَارَقَ جَمَاعَةَ الْمُسْلِمِينَ قِيدَ شِبْرٍ فَقَدْ خَلَعَ رِبْقَةَ الْإِسْلَامِ مِنْ عُنُقِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Fazzal, from Abu Jameela, from Muhammad Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who separates from a group of Muslims by a limit of a palms width, so he has removed the bond of allegiance with Al-Islam from his neck’."
          ],
          "en.sarwar": [
            " 4. A number of our people has narrated from Ahmad ibn Muhammad from ibn al-Faddal from abu Jamila from Muhammad al-Halabi from abu ‘Abdallah (a.s.) who has said the following. “Whoever would distance himself from the company the Muslims even by one shibr (one foot) he has removed the band of allegiance with Islam from his neck.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (333/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1056,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "بِهَذَا الْإِسْنَادِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِهَذَا الْإِسْنَادِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:103:5",
        "text": [
          " مَنْ فَارَقَ جَمَاعَةَ الْمُسْلِمِينَ وَ نَكَثَ صَفْقَةَ الْإِمَامِ جَاءَ إِلَى اللَّهِ عَزَّ وَ جَلَّ أَجْذَمَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who separates from a group of the Muslims and disregards the allegiance of the Imam<sup>asws</sup> would come to Allah<sup>azwj</sup> Mighty and Majestic mutilated’."
          ],
          "en.sarwar": [
            " 5. Through the same chain of narrators it is narrated from abu ‘Abdallah (a.s.) who has said the following. “Whoever would distance himself from the company of the Muslims and disregard the pledge of allegiance with the Imam he will come before Allah with his hand cut off.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:103",
  "kind": "verse_list"
}