{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 104"
        },
        "path": "/books/al-kafi:1:4:104",
        "titles": {
          "ar": "باب مَا يَجِبُ مِنْ حَقِّ الْإِمَامِ عَلَى الرَّعِيَّةِ وَ حَقِّ الرَّعِيَّةِ عَلَى الْإِمَامِ",
          "en": "Chapter 104 – What is Obligated from the rights of the Imam<sup>asws</sup> upon the citizen and the rights of the citizen upon the Imam<sup>asws</sup>"
        }
      }
    ],
    "index": 162,
    "local_index": 104,
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:104",
    "titles": {
      "ar": "باب مَا يَجِبُ مِنْ حَقِّ الْإِمَامِ عَلَى الرَّعِيَّةِ وَ حَقِّ الرَّعِيَّةِ عَلَى الْإِمَامِ",
      "en": "Chapter 104 – What is Obligated from the rights of the Imam<sup>asws</sup> upon the citizen and the rights of the citizen upon the Imam<sup>asws</sup>"
    },
    "verse_count": 9,
    "verse_start_index": 1056,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (334/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1057,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:104:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ أَبِي حَمْزَةَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) مَا حَقُّ الْإِمَامِ عَلَى النَّاسِ قَالَ حَقُّهُ عَلَيْهِمْ أَنْ يَسْمَعُوا لَهُ وَ يُطِيعُوا قُلْتُ فَمَا حَقُّهُمْ عَلَيْهِمْ قَالَ يَقْسِمَ بَيْنَهُمْ بِالسَّوِيَّةِ وَ يَعْدِلَ فِي الرَّعِيَّةِ فَإِذَا كَانَ ذَلِكَ فِي النَّاسِ فَلَا يُبَالِي مَنْ أَخَذَ هَاهُنَا وَ هَاهُنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Jamhour, from Hammad Bin Usman, from Abu Hamza who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup>, ‘What is the right of the Imam<sup>asws</sup> upon the people?’ He<sup>asws</sup> said: ‘His<sup>asws</sup> right upon them is that they should listen to him<sup>asws</sup> and obey him<sup>asws</sup>’. I said, ‘So what is their right?’ He<sup>asws</sup> said: ‘He<sup>asws</sup> should distribute between them with the equality and do justice among the citizens. So when it was that among the people, so no one will fear who has taken this or that’."
          ],
          "en.sarwar": [
            " 1. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn Jumhur from Hammad ibn ‘Uthman from abu Hamza who has said the following. “I asked abu ‘Abdallah (a.s.), ‘What are the rights of the Imam over the people?” He replied, “Of his rights over them is that they must listen to him and obey him.” I then asked, “What are their rights on him?” He replied, “Maintain among them equality and justice among the followers. When this prevails among the people then there would no fear as to who has taken this and that.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (335/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1058,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:104:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) مِثْلَهُ إِلَّا أَنَّهُ قَالَ هَكَذَا وَ هَكَذَا وَ هَكَذَا وَ هَكَذَا يَعْنِي مِنْ بَيْنِ يَدَيْهِ وَ خَلْفِهِ وَ عَنْ يَمِينِهِ وَ عَنْ شِمَالِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail Bin Bazie, from Mansour Bin Yunus, from Abu Hamza, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> similar to it, except that he<sup>asws</sup> said: ‘Like this, and like this, and the like this and like this’, meaning from in front of him, and behind him, and from his right and from his left’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn ’Isma‘il ibn Bazi‘ from Mansur ibn Yunus from abu Hamza from abu Ja‘far (a.s.) a similar hadith except that he has said, “this way, this way, this way and this way, meaning thereby front, back, right and left.” Muhammad ibn Yahya al-‘Attar from certain members of our people from Harun ibn Muslim from Mas‘ada ibn sadaqa from abu ‘Abdallah (a.s.) who has said the following. “Amir al-Mu’minin (a.s.) has said, ‘Do not be deceitful to your leaders, do not confuse your guides, do not be ignorant of your Imams and do not cut off the rope of your unity, least you will fail and be disgraced. On such foundation your affairs must be based and you must strictly live within such system. Had you been able to observe what those who lived before had observed and who had disregarded what you want to be accepted you would have acted fast, came out and listened. However, you can not observe what they had observed but the curtain will soon be removed.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (335/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1059,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:104:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى الْعَطَّارُ عَنْ بَعْضِ أَصْحَابِنَا عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) لَا تَخْتَانُوا وُلَاتَكُمْ وَ لَا تَغُشُّوا هُدَاتَكُمْ وَ لَا تَجْهَلُوا أَئِمَّتَكُمْ وَ لَا تَصَدَّعُوا عَنْ حَبْلِكُمْ فَتَفْشَلُوا وَ تَذْهَبَ رِيحُكُمْ وَ عَلَى هَذَا فَلْيَكُنْ تَأْسِيسُ أُمُورِكُمْ وَ الْزَمُوا هَذِهِ الطَّرِيقَةَ فَإِنَّكُمْ لَوْ عَايَنْتُمْ مَا عَايَنَ مَنْ قَدْ مَاتَ مِنْكُمْ مِمَّنْ خَالَفَ مَا قَدْ تُدْعَوْنَ إِلَيْهِ لَبَدَرْتُمْ وَ خَرَجْتُمْ وَ لَسَمِعْتُمْ وَ لَكِنْ مَحْجُوبٌ عَنْكُمْ مَا قَدْ عَايَنُوا وَ قَرِيباً مَا يُطْرَحُ الْحِجَابُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya Al Attar, from some of our companions, from Haroun Bin Muslim, from Mas’ada Bin Sadaqa, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘Neither betray your leaders, nor deceive your guides, nor be ignorant of your Imams<sup>asws</sup>, nor crack your unity for you will fail and your power will depart, and let the foundation of your affairs be upon this, and necessitate this way. If you all were to see what your dead ones can see, from the ones who opposed what you have been called to, you would be convinced, and would come out and listen. But, it is veiled from you what they are seeing, and very soon the veil would be raised’."
          ],
          "en.sarwar": [
            " 3. A number of our people has narrated from Ahmad ibn Muhammad from ‘Abd al-Rahman ibn Hammad and others from Hanan ibn Sadir al-Sayrafi who has said the following. “I heard abu ‘Abdallah (a.s.) say, ‘The Holy Prophet (s.a) was given the news of his own death while he was in a good health and he did not suffer any pain.” He said, “The trusted Spirit came to him.” He said, “The Holy Prophet called for a prayer in congregation. He then ordered the Muhajir and Ansar (people from Makka and the people of Madina) to arm themselves. The people all came and the Holy Prophet climbed the platform, the pulpit and gave out the news of his own death and then said, “I warn of Allah the ruler after me over my followers for not being kind to the community of the Muslims. He must honor the elders among them and be kind to their weak, treat their scholars with dignity, must not harm to humiliate them. He must not allow them to suffer poverty that would turn them to disbelief, must not close his door to them to let their strong over run the weak ones. He must not use them in the (armed) campaigns for food that would banish the offspring of my followers. Then he said, (Certainly) I have delivered to you the message, gave you good advice so you must bear this testimony.” Abu ‘Abdallah (a.s.) has said that this was the last words of the Messenger of Allah from the pulpit.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالموثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (337/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1060,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:104:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَمَّادٍ وَ غَيْرِهِ عَنْ حَنَانِ بْنِ سَدِيرٍ الصَّيْرَفِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ نُعِيَتْ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) نَفْسُهُ وَ هُوَ صَحِيحٌ لَيْسَ بِهِ وَجَعٌ قَالَ نَزَلَ بِهِ الرُّوحُ الْأَمِينُ قَالَ فَنَادَى ( صلى الله عليه وآله ) الصَّلَاةَ جَامِعَةً وَ أَمَرَ الْمُهَاجِرِينَ وَ الْأَنْصَارَ بِالسِّلَاحِ وَ اجْتَمَعَ النَّاسُ ",
          "فَصَعِدَ النَّبِيُّ ( صلى الله عليه وآله ) الْمِنْبَرَ فَنَعَى إِلَيْهِمْ نَفْسَهُ ثُمَّ قَالَ أُذَكِّرُ اللَّهَ الْوَالِيَ مِنْ بَعْدِي عَلَى أُمَّتِي أَلَّا يَرْحَمَ عَلَى جَمَاعَةِ الْمُسْلِمِينَ فَأَجَلَّ كَبِيرَهُمْ وَ رَحِمَ ضَعِيفَهُمْ وَ وَقَّرَ عَالِمَهُمْ وَ لَمْ يُضِرَّ بِهِمْ فَيُذِلَّهُمْ وَ لَمْ يُفْقِرْهُمْ فَيُكْفِرَهُمْ وَ لَمْ يُغْلِقْ بَابَهُ دُونَهُمْ فَيَأْكُلَ قَوِيُّهُمْ ضَعِيفَهِمْ وَ لَمْ يَخْبِزْهُمْ فِي بُعُوثِهِمْ فَيَقْطَعَ نَسْلَ أُمَّتِي ",
          "ثُمَّ قَالَ قَدْ بَلَّغْتُ وَ نَصَحْتُ فَاشْهَدُوا وَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) هَذَا آخِرُ كَلَامٍ تَكَلَّمَ بِهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَلَى مِنْبَرِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Abdul Rahman Bin Hammad, and someone else, from Hannan Bin Sadeyr Al Sayrafi who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The news of death was given to the Prophet<sup>saww</sup> himself<sup>saww</sup> and he<sup>saww</sup> was healthy, there wasn’t any pain with him<sup>saww</sup>. The Trustworthy <span class=\"iTxt\">Ruh</span> descended with it. So he<sup>saww</sup> called for the congregational <span class=\"iTxt\">Salat</span> and ordered the Emigrants and the Helpers with the weapons (to be ready). And the people gathered. ",
            "So the Prophet<sup>saww</sup> ascended the Pulpit, and gave the news of death to them himself<sup>saww</sup>, then said: ‘I<sup>saww</sup> remind and caution of Allah<sup>azwj</sup> the ruler from after me<sup>saww</sup> upon my<sup>saww</sup> community, that he should be merciful upon the group of Muslims, honour their elders and be merciful to their young ones, and dignify their scholars, and do not harm them so he would humiliate them, and not to impoverish them so they would disbelieve, and not close his door from them so their strong ones would devour their weak ones, and not pain them in their campaigns, so the lineages of my<sup>saww</sup> community would be cut off’.  ",
            "Then he<sup>saww</sup> said: ‘I<sup>saww</sup> have delivered and advised, therefore, bear witness!’ And Abu Abdullah<sup>asws</sup> said: ‘This is the last speech Rasool-Allah<sup>saww</sup> spoke with upon his<sup>saww</sup> Pulpit’."
          ],
          "en.sarwar": [
            " 4. Muhammad ibn ali and others have narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from a man from Habib ibn abu Thabit who has said the following. “Honey and fig were brought to Amir al-Mu’minin (a.s.) from Hamadhan and al-Hulwan (places near Baghdad). He asked the his officers to call in the orphans. They were allowed to lick honey from the containers while he himself distributed them among the people. People asked, “Why should the orphans be allowed to lick the honey?” He said, “He said that the Imam is the father of the orphans. I just wanted to gave them a fatherly treat.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (339/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1061,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:104:5",
        "text": [
          "مُحَمَّدُ بْنُ عَلِيٍّ وَ غَيْرُهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ رَجُلٍ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ قَالَ جَاءَ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) عَسَلٌ وَ تِينٌ مِنْ هَمْدَانَ وَ حُلْوَانَ فَأَمَرَ الْعُرَفَاءَ أَنْ يَأْتُوا بِالْيَتَامَى فَأَمْكَنَهُمْ مِنْ رُءُوسِ الْأَزْقَاقِ يَلْعَقُونَهَا وَ هُوَ يَقْسِمُهَا لِلنَّاسِ قَدَحاً قَدَحاً فَقِيلَ لَهُ يَا أَمِيرَ الْمُؤْمِنِينَ مَا لَهُمْ يَلْعَقُونَهَا فَقَالَ إِنَّ الْإِمَامَ أَبُو الْيَتَامَى وَ إِنَّمَا أَلْعَقْتُهُمْ هَذَا بِرِعَايَةِ الْآبَاءِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ali, and someone else, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from A man, from Habeeb Bin Abu Sabit who said, ",
            "‘There came to Amir Al-Momineen<sup>asws</sup>, honey and figs from Hamdan, and gifts. So he<sup>asws</sup> ordered the officers that they should bring the orphans. So he<sup>asws</sup> enabled them from top for the tasting. They were licking it and he<sup>asws</sup> was distribution to the people, cup by cup. So it was said to him<sup>asws</sup>, ‘O Amir Al-Momineen<sup>asws</sup>! What is for them that they should be licking it?’ So he<sup>asws</sup> said: ‘The Imam<sup>asws</sup> is a father of the orphans, and rather this treat of theirs is due to the care of the father’."
          ],
          "en.sarwar": [
            " 5. A number of our people has narrated from Ahmad ibn Muhammad al-Barqi and Ali ibn Ibrahim from his father all of them from al-Qasim ibn Muhammad al-Asbahani from Sulayman ibn dawud al-Manqari from Sufyan ibn ‘Uyayna from abu ‘Abdallah (a.s.) who has said the following. “The Holy Prophet has said, ’Isma‘il have more authority over every believer than their own selves and after me Ali (a.s.) will such authority.” He was asked, “What is the meaning of that?” He said, “These are the words of the Holy Prophet, ‘One who would pass away his debts and liabilities become my responsibility If one would live a legacy I will be the heir thereof. A man will have no authority over himself if would have no property and one will not authority over his dependents if would not provide their expenses. The Holy Prophet (s.a) and Amir al-Mu’minin (a.s.) and their successors have made it binding up on them. For this reason they have greater authority over them than their own selves. The general masses of the Jews accepted Islam only after these words of the Messenger of Allah. They found peace for themselves and for their dependents.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (340/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1062,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:104:6",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ الْأَصْبَهَانِيِّ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْمِنْقَرِيِّ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ النَّبِيَّ ( صلى الله عليه وآله ) قَالَ أَنَا أَوْلَى بِكُلِّ مُؤْمِنٍ مِنْ نَفْسِهِ وَ عَلِيٌّ أَوْلَى بِهِ مِنْ بَعْدِي فَقِيلَ لَهُ مَا مَعْنَى ذَلِكَ فَقَالَ قَوْلُ النَّبِيِّ ( صلى الله عليه وآله ) مَنْ تَرَكَ دَيْناً أَوْ ضَيَاعاً فَعَلَيَّ وَ مَنْ تَرَكَ مَالًا فَلِوَرَثَتِهِ ",
          "فَالرَّجُلُ لَيْسَتْ لَهُ عَلَى نَفْسِهِ وِلَايَةٌ إِذَا لَمْ يَكُنْ لَهُ مَالٌ وَ لَيْسَ لَهُ عَلَى عِيَالِهِ أَمْرٌ وَ لَا نَهْيٌ إِذَا لَمْ يُجْرِ عَلَيْهِمُ النَّفَقَةَ وَ النَّبِيُّ وَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) وَ مَنْ بَعْدَهُمَا أَلْزَمَهُمْ هَذَا فَمِنْ هُنَاكَ صَارُوا أَوْلَى بِهِمْ مِنْ أَنْفُسِهِمْ وَ مَا كَانَ سَبَبُ إِسْلَامِ عَامَّةِ الْيَهُودِ إِلَّا مِنْ بَعْدِ هَذَا الْقَوْلِ مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ إِنَّهُمْ آمَنُوا عَلَى أَنْفُسِهِمْ وَ عَلَى عِيَالَاتِهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Al Barqy, and Ali Bin Ibrahim, from his father, altogether from Al Qasim Bin Muhammad Al Asbahany, from Suleyman Bin Dawood Al Minqary, from Sufyan Bin Uyayna, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that the Prophet<sup>saww</sup> said: ‘I<sup>asws</sup> am closer with every <span class=\"iTxt\">Momin </span>than his own self, and Ali<sup>asws</sup> is the closest with it from after me<sup>saww</sup>’. So it was said to him<sup>asws</sup>, ‘What is the meaning of that?’ So he<sup>asws</sup> said: ‘The words of the Prophet<sup>saww</sup>: ‘The one who leaves debts or losses, so it is upon me<sup>saww</sup>, and the one who leaves wealth, so is it for his inheritors’. ",
            "Thus, the man is such that there isn’t an authority upon himself when there does not happen to be any wealth for him, and there isn’t any authority for him upon his dependants nor any forbidding when he does not cause the expenses to flow upon them. And the Prophet<sup>saww</sup> and Amir Al-Momineen<sup>asws</sup>, and their<sup>asws</sup> successors<sup>asws</sup> have made it (providing maintenance) a binding upon themselves.  For this reason they have a greater authority over them than their own selves. The general  masses of the Jews accepted Islam only after these words of Rasool Allah<sup>saww</sup>.  They found peace for themselves and for their dependents.’"
          ],
          "en.sarwar": [
            " 6. A number of our people has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Aban ibn ‘Uthman from Sabbah ibn Sayyaba from abu ‘Abdallah (a.s.) who has said the following. “The Holy Prophet (s.a) has said, ‘Whoever of the believers or Muslims would die and on him there is a debt for not for unlawful or extravagant reasons it will be the responsibility of the Imam to pay it off otherwise, he has sinned. Allah, the Most Holy, the Most High, says, ‘Welfare funds (zakat) are only for the poor, the destitute,. .” (9:60) Such person is a bankrupt and there is a share for him with the Imam.If he would withheld it he has sinned.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/343)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1063,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:104:7",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ صَبَّاحِ بْنِ سَيَابَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَيُّمَا مُؤْمِنٍ أَوْ مُسْلِمٍ مَاتَ وَ تَرَكَ دَيْناً لَمْ يَكُنْ فِي فَسَادٍ وَ لَا إِسْرَافٍ فَعَلَى الْإِمَامِ أَنْ يَقْضِيَهُ فَإِنْ لَمْ يَقْضِهِ فَعَلَيْهِ إِثْمُ ذَلِكَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى يَقُولُ إِنَّمَا الصَّدَقاتُ لِلْفُقَراءِ وَ الْمَساكِينِ الْآيَةَ فَهُوَ مِنَ الْغَارِمِينَ وَ لَهُ سَهْمٌ عِنْدَ الْإِمَامِ فَإِنْ حَبَسَهُ فَإِثْمُهُ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, fom Ali Bin Al Hakam, fom Aban Bin Usman, from Sabbah Bin Sayaba, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Whichever <span class=\"iTxt\">Momin </span>or Muslim dies and leaves debts which do not happen to be regarding corruption or extravagance, so it is upon the Imam<sup>asws</sup> that he<sup>asws</sup> fulfils it. Therefore, if he<sup>asws</sup> does not fulfil it, the sin of that would be upon him<sup>asws</sup>. Allah<sup>azwj</sup> Blessed and High is Saying <span class=\"ibTxt\">[9:60] But rather, the charities are only for the poor and the needy</span> – the Verse. So he is from the debtors, and for him would be a share with the Imam<sup>asws</sup>, and if he<sup>asws</sup> were to withhold it, so its sin would be upon him<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 7. Ali ibn Ibrahim has narrated from Salih ibn al-Sindi from Ja‘far ibn Bashir from Hanan from his father from abu Ja‘far (a.s.) who has said the following. “The Messenger of Allah has said, ‘Imamat (Leadership with Divine Authority) is not proper for one without the following qualities. Chastity that would keep him away from disobeying Allah, forbearance that would give him self control against anger good guardianship over his dependents like a kind hearted father towards his children.” In another hadith it says, “ . so that he would be to the followers like a loving father.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول وآخره مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (344/ 4)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1064,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:104:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنْ حَنَانٍ عَنْ أَبِيهِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَا تَصْلُحُ الْإِمَامَةُ إِلَّا لِرَجُلٍ فِيهِ ثَلَاثُ خِصَالٍ وَرَعٌ يَحْجُزُهُ عَنْ مَعَاصِي اللَّهِ وَ حِلْمٌ يَمْلِكُ بِهِ غَضَبَهُ وَ حُسْنُ الْوِلَايَةِ عَلَى مَنْ يَلِي حَتَّى يَكُونَ لَهُمْ كَالْوَالِدِ الرَّحِيمِ .",
          "وَ فِي رِوَايَةٍ أُخْرَى حَتَّى يَكُونَ لِلرَّعِيَّةِ كَالْأَبِ الرَّحِيمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Salih Bin Al Sindy, from Ja’far Bin Bashir, from Hannan, from his father, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The Imamate is not correct except for a man in whom there are three characteristics – piety detaining him<sup>asws</sup> from disobeying Allah<sup>azwj</sup>, and forbearance he<sup>asws</sup> can control his<sup>asws</sup> anger with, and good guardianship upon the ones he<sup>asws</sup> rules over until he<sup>asws</sup> happens to be like the merciful father to them’. ",
            "And in another report: ‘Until he<sup>asws</sup> happens to be to the citizens like the merciful father’."
          ],
          "en.sarwar": [
            " 8. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Mu‘awiya ibn Hakim from Muhammad ibn Muslim from a man from Tabaristan called Muhammad Qal. Mu‘awiya has said that he met this man from Tabaristan who has said the following. “I heard Ali ibn Musa (a.s.) say, “A bankrupt who would lend or borrow –uncertainty is from Mu‘awiya- will given one years time to pay. If he still could not pay, the Imam it off from public treasury.”"
          ]
        }
      },
      {
        "index": 1065,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:104:9",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُعَاوِيَةَ بْنِ حُكَيْمٍ عَنْ مُحَمَّدِ بْنِ أَسْلَمَ عَنْ رَجُلٍ مِنْ طَبَرِسْتَانَ يُقَالُ لَهُ مُحَمَّدٌ قَالَ قَالَ مُعَاوِيَةُ وَ لَقِيتُ الطَّبَرِيَّ مُحَمَّداً بَعْدَ ذَلِكَ فَأَخْبَرَنِي قَالَ سَمِعْتُ عَلِيَّ بْنَ مُوسَى ( عليه السلام ) يَقُولُ الْمُغْرَمُ إِذَا تَدَيَّنَ أَوِ اسْتَدَانَ فِي حَقٍّ الْوَهْمُ مِنْ مُعَاوِيَةَ أُجِّلَ سَنَةً فَإِنِ اتَّسَعَ وَ إِلَّا قَضَى عَنْهُ الْإِمَامُ مِنْ بَيْتِ الْمَالِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Muawiya Bin Hukeym, from Muhammad Bin Aslam, from a man from Tabaristan called Muhammad, said, ‘Muawiya said, ‘And I met the Al Tabary, Muhammad, after that, so he informed me saying, ",
            "‘I heard Ali<sup>asws</sup> Bin Musa<sup>asws</sup> saying: ‘The debtor, when he lends a loan’, or ‘borrows regarding a right’ - the uncertainty O Muawiya (the narrator), he will be given one year’s time to pay. If he still cannot pay the Imam<sup>asws</sup> would fulfil it on his behalf from the Public Treasury’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:104",
  "kind": "verse_list"
}