{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 105"}, "path": "/books/al-kafi:1:4:105", "titles": {"ar": "باب أَنَّ الْأَرْضَ كُلَّهَا لِلْإِمَامِ ( عليه السلام )", "en": "Chapter 105 – The earth, all of it, is for the Imam<sup>asws</sup>"}}], "index": 163, "local_index": 105, "part_type": "Chapter", "path": "/books/al-kafi:1:4:105", "titles": {"ar": "باب أَنَّ الْأَرْضَ كُلَّهَا لِلْإِمَامِ ( عليه السلام )", "en": "Chapter 105 – The earth, all of it, is for the Imam<sup>asws</sup>"}, "verse_count": 8, "verse_start_index": 1065, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 1066, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:105:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي خَالِدٍ الْكَابُلِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ وَجَدْنَا فِي كِتَابِ عَلِيٍّ ( عليه السلام ) إِنَّ الْأَرْضَ لِلَّهِ يُورِثُها مَنْ يَشاءُ مِنْ عِبادِهِ وَ الْعاقِبَةُ لِلْمُتَّقِينَ أَنَا وَ أَهْلُ بَيْتِيَ الَّذِينَ أَوْرَثَنَا اللَّهُ الْأَرْضَ وَ نَحْنُ الْمُتَّقُونَ وَ الْأَرْضُ كُلُّهَا لَنَا ", "فَمَنْ أَحْيَا أَرْضاً مِنَ الْمُسْلِمِينَ فَلْيَعْمُرْهَا وَ لْيُؤَدِّ خَرَاجَهَا إِلَى الْإِمَامِ مِنْ أَهْلِ بَيْتِي وَ لَهُ مَا أَكَلَ مِنْهَا فَإِنْ تَرَكَهَا أَوْ أَخْرَبَهَا وَ أَخَذَهَا رَجُلٌ مِنَ الْمُسْلِمِينَ مِنْ بَعْدِهِ فَعَمَرَهَا وَ أَحْيَاهَا فَهُوَ أَحَقُّ بِهَا مِنَ الَّذِي تَرَكَهَا يُؤَدِّي خَرَاجَهَا إِلَى الْإِمَامِ مِنْ أَهْلِ بَيْتِي وَ لَهُ مَا أَكَلَ مِنْهَا حَتَّى يَظْهَرَ الْقَائِمُ مِنْ أَهْلِ بَيْتِي بِالسَّيْفِ ", "فَيَحْوِيَهَا وَ يَمْنَعَهَا وَ يُخْرِجَهُمْ مِنْهَا كَمَا حَوَاهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ مَنَعَهَا إِلَّا مَا كَانَ فِي أَيْدِي شِيعَتِنَا فَإِنَّهُ يُقَاطِعُهُمْ عَلَى مَا فِي أَيْدِيهِمْ وَ يَتْرُكُ الْأَرْضَ فِي أَيْدِيهِمْ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from Hisham Bin Salim, from Abu Khalid Al Kabuly, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘We<sup>asws</sup> found in the Book of Ali<sup>asws</sup> that <span class=\"ibTxt\">[7:128] surely the earth is Allah's; He Causes such of His servants to inherit it as He so Desires, and the end is for those who are pious</span>. I<sup>asws</sup> and the People<sup>asws</sup> of my<sup>asws</sup> Household are those whom Allah<sup>azwj</sup> Caused to inherit the earth, and we<sup>asws</sup> are the pious, and the earth, all of it is for us<sup>asws</sup>. ", "So the one from the Muslims who revives it, so let him build it and let him pay its tax to the Imam<sup>asws</sup> from the People<sup>asws</sup> of my<sup>asws</sup> Household, and for him would be what he consumes from it. So if he were to neglect it or ruin it, and (another) man from the Muslims was to take it from after him, and he builds it, so he would be more rightful with it than the one who neglected it. He should pay its tax to the Imam<sup>asws</sup> from the People<sup>asws</sup> of my<sup>asws</sup> Household, and for him would be whatever he consumes from it, until there appears Al-Qaim<sup>asws</sup> from the People<sup>asws</sup> of my<sup>asws</sup> Household with the sword.  ", "So he<sup>asws</sup> would contain it and prevent it and throw them out from it just as Rasool-Allah<sup>saww</sup> had contained it and prevented it, except what was in the hands of our<sup>asws</sup> Shias, so it would be their piece upon what is in their hands, and he<sup>asws</sup> would leave the land to be in their hands’."]}}, {"index": 1067, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:105:2", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ قَالَ أَخْبَرَنِي أَحْمَدُ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَمَّنْ رَوَاهُ قَالَ الدُّنْيَا وَ مَا فِيهَا لِلَّهِ تَبَارَكَ وَ تَعَالَى وَ لِرَسُولِهِ وَ لَنَا فَمَنْ غَلَبَ عَلَى شَيْ‏ءٍ مِنْهَا فَلْيَتَّقِ اللَّهَ وَ لْيُؤَدِّ حَقَّ اللَّهِ تَبَارَكَ وَ تَعَالَى وَ لْيَبَرَّ إِخْوَانَهُ فَإِنْ لَمْ يَفْعَلْ ذَلِكَ فَاللَّهُ وَ رَسُولُهُ وَ نَحْنُ بُرَآءُ مِنْهُ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moalla Bin Muhammad who said, ‘Ahmad Bin Muhammad Bin Abdullah informed be, from the one who reported it saying, ", "‘The world and whatever is in it is for Allah<sup>azwj</sup> Blessed and High, and for His<sup>azwj</sup> Rasool<sup>saww</sup> and for us<sup>asws</sup>. So the one who overcomes upon anything from it, so let him fear Allah<sup>azwj</sup>, and let him pay the Right of Allah<sup>azwj</sup> Blessed and High, and let him be righteous with his brethren. So if he does not do that, then Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup> and we<sup>asws</sup> are disavowed from him’."]}}, {"index": 1068, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:105:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عُمَرَ بْنِ يَزِيدَ قَالَ رَأَيْتُ مِسْمَعاً بِالْمَدِينَةِ وَ قَدْ كَانَ حَمَلَ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) تِلْكَ السَّنَةَ مَالًا فَرَدَّهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَقُلْتُ لَهُ لِمَ رَدَّ عَلَيْكَ أَبُو عَبْدِ اللَّهِ الْمَالَ الَّذِي حَمَلْتَهُ إِلَيْهِ قَالَ فَقَالَ لِي إِنِّي قُلْتُ لَهُ حِينَ حَمَلْتُ إِلَيْهِ الْمَالَ إِنِّي كُنْتُ وُلِّيتُ الْبَحْرَيْنَ الْغَوْصَ فَأَصَبْتُ أَرْبَعَمِائَةِ أَلْفِ دِرْهَمٍ وَ قَدْ جِئْتُكَ بِخُمُسِهَا بِثَمَانِينَ أَلْفَ دِرْهَمٍ وَ كَرِهْتُ أَنْ أَحْبِسَهَا عَنْكَ وَ أَنْ أَعْرِضَ لَهَا وَ هِيَ حَقُّكَ الَّذِي جَعَلَهُ اللَّهُ تَبَارَكَ وَ تَعَالَى فِي أَمْوَالِنَا ", "فَقَالَ أَ وَ مَا لَنَا مِنَ الْأَرْضِ وَ مَا أَخْرَجَ اللَّهُ مِنْهَا إِلَّا الْخُمُسُ يَا أَبَا سَيَّارٍ إِنَّ الْأَرْضَ كُلَّهَا لَنَا فَمَا أَخْرَجَ اللَّهُ مِنْهَا مِنْ شَيْ‏ءٍ فَهُوَ لَنَا فَقُلْتُ لَهُ وَ أَنَا أَحْمِلُ إِلَيْكَ الْمَالَ كُلَّهُ فَقَالَ يَا أَبَا سَيَّارٍ قَدْ طَيَّبْنَاهُ لَكَ وَ أَحْلَلْنَاكَ مِنْهُ فَضُمَّ إِلَيْكَ مَالَكَ وَ كُلُّ مَا فِي أَيْدِي شِيعَتِنَا مِنَ الْأَرْضِ فَهُمْ فِيهِ مُحَلَّلُونَ حَتَّى يَقُومَ قَائِمُنَا", "فَيَجْبِيَهُمْ طَسْقَ مَا كَانَ فِي أَيْدِيهِمْ وَ يَتْرُكَ الْأَرْضَ فِي أَيْدِيهِمْ وَ أَمَّا مَا كَانَ فِي أَيْدِي غَيْرِهِمْ فَإِنَّ كَسْبَهُمْ مِنَ الْأَرْضِ حَرَامٌ عَلَيْهِمْ حَتَّى يَقُومَ قَائِمُنَا فَيَأْخُذَ الْأَرْضَ مِنْ أَيْدِيهِمْ وَ يُخْرِجَهُمْ صَغَرَةً ", "قَالَ عُمَرُ بْنُ يَزِيدَ فَقَالَ لِي أَبُو سَيَّارٍ مَا أَرَى أَحَداً مِنْ أَصْحَابِ الضِّيَاعَ وَ لَا مِمَّنْ يَلِي الْأَعْمَالَ يَأْكُلُ حَلَالًا غَيْرِي إِلَّا مَنْ طَيَّبُوا لَهُ ذَلِكَ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Umar Bin Yazeed who said, ", "‘I saw Misma’a at Al-Medina and he had carried some wealth to Abu Abdullah<sup>asws</sup> at that time, but Abu Abdullah<sup>asws</sup> returned it. So I said to him, ‘Abu Abdullah<sup>asws</sup> returned the wealth upon you which you had carried it to him<sup>asws</sup>’. So he said to me, ‘I said to him<sup>asws</sup> when I carried the wealth over to him<sup>asws</sup>, ‘I was in charge of the pearls of Bahrain and I attained a profit of four hundred thousand Dirhams, and I have come to you<sup>asws</sup> with its fifth (<span class=\"iTxt\">Khums</span>), with eighty thousand Dirhams, and I disliked it that I should withhold it and turn away with It, and it is your<sup>asws</sup> right which Allah<sup>azwj</sup> Blessed and High Made it to be in our wealth’. ", "So he<sup>asws</sup> said: ‘Or what is for us<sup>asws</sup> from the earth and what Allah<sup>azwj</sup> Brings out from it except the Khums, O Abu Sayyar? Surely the earth, all of it, is for us<sup>asws</sup>. So whatever Allah<sup>azwj</sup> Brings forth from it, from anything, so it is for us<sup>asws</sup>’. So I said to him, ‘And I shall carry all of the wealth to you<sup>asws</sup>’. So he<sup>asws</sup> said: ‘O Abu Sayyar! We<sup>asws</sup> have cleaned it for you and permited you from it. So keep your wealth with you and everything what is in the hands of our<sup>asws</sup> Shias from the earth, so they are in permissibility with regards to it until our<sup>asws</sup> Qaim<sup>asws</sup> rises. ", "So he<sup>asws</sup> would collect their levy on whatever would be in their hands and he<sup>asws</sup> would leave the land to be in their hands. And as for whatever would be in the hands of others (non-Shias), so their earning from the land is Prohibited upon them until our<sup>asws</sup> Qaim<sup>asws</sup> rises. So he<sup>asws</sup> would seize the land from their hands and throw them out belittled’. ", "Umar Bin Yazeed said, ‘So Abu Sayyar said to him, I do not  find anyone doing business or people as in charge persons of certain tasks, who earn their living lawfully except myself and those for whom they<sup>asws</sup> ('A'immah) have made it lawful."]}}, {"index": 1069, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:4:105:4", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ أَبِي عَبْدِ اللَّهِ الرَّازِيِّ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِيهِ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ أَ مَا عَلَى الْإِمَامِ زَكَاةٌ فَقَالَ أَحَلْتَ يَا أَبَا مُحَمَّدٍ أَ مَا عَلِمَتْ أَنَّ الدُّنْيَا وَ الْآخِرَةَ لِلْإِمَامِ يَضَعُهَا حَيْثُ يَشَاءُ وَ يَدْفَعُهَا إِلَى مَنْ يَشَاءُ جَائِزٌ لَهُ ذَلِكَ مِنَ اللَّهِ إِنَّ الْإِمَامَ يَا أَبَا مُحَمَّدٍ لَا يَبِيتُ لَيْلَةً أَبَداً وَ لِلَّهِ فِي عُنُقِهِ حَقٌّ يَسْأَلُهُ عَنْهُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Abu Abdullah Al Razy, from Al Hassan Bin Ali Bin Abu Hamza, from his father, from Abu Baseer, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘Is there any <span class=\"iTxt\">Zak</span>ā<span class=\"iTxt\">t </span>upon the Imam<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘You have spoken an impossibility, O Abu Muhammad! Do you not know that the world and the Hereafter is for the Imam<sup>asws</sup>? He<sup>asws</sup> can place it wherever he<sup>asws</sup> so desires to and hands it over to whoever he<sup>asws</sup> so desires to. That is allowed for him<sup>asws</sup> from Allah<sup>azwj</sup>. The Imam<sup>asws</sup>, O Abu Muhammad, does not sleep at night, ever, and in his<sup>asws</sup> neck is a Right of Allah<sup>azwj</sup>, Asking him<sup>asws</sup> about it’."]}}, {"index": 1070, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:1:4:105:5", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَحْمَدَ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ صَالِحِ بْنِ حَمْزَةَ عَنْ أَبَانِ بْنِ مُصْعَبٍ عَنْ يُونُسَ بْنِ ظَبْيَانَ أَوِ الْمُعَلَّى بْنِ خُنَيْسٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا لَكُمْ مِنْ هَذِهِ الْأَرْضِ فَتَبَسَّمَ ثُمَّ قَالَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى بَعَثَ جَبْرَئِيلَ ( عليه السلام ) وَ أَمَرَهُ أَنْ يَخْرِقَ بِإِبْهَامِهِ ثَمَانِيَةَ أَنْهَارٍ فِي الْأَرْضِ مِنْهَا سَيْحَانُ وَ جَيْحَانُ وَ هُوَ نَهَرُ بَلْخَ وَ الْخشوع وَ هُوَ نَهَرُ الشَّاشِ وَ مِهْرَانُ وَ هُوَ نَهَرُ الْهِنْدِ وَ نِيلُ مِصْرَ وَ دِجْلَةُ وَ الْفُرَاتُ", "فَمَا سَقَتْ أَوِ اسْتَقَتْ فَهُوَ لَنَا وَ مَا كَانَ لَنَا فَهُوَ لِشِيعَتِنَا وَ لَيْسَ لِعَدُوِّنَا مِنْهُ شَيْ‏ءٌ إِلَّا مَا غَصَبَ عَلَيْهِ وَ إِنَّ وَلِيَّنَا لَفِي أَوْسَعَ فِيمَا بَيْنَ ذِهْ إِلَى ذِهْ يَعْنِي بَيْنَ السَّمَاءِ وَ الْأَرْضِ ", "ثُمَّ تَلَا هَذِهِ الْآيَةَ قُلْ هِيَ لِلَّذِينَ آمَنُوا فِي الْحَياةِ الدُّنْيا الْمَغْصُوبِينَ عَلَيْهَا خالِصَةً لَهُمْ يَوْمَ الْقِيامَةِ بِلَا غَصْبٍ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Muhammad Bin Abdullah Bin Ahmad, from Ali Bin Al Numan, from Salih Bin Hamza, from Aban Bin Mus’ab, from Yunus Bin Zabyan, or al Moalla Bin Khunays who said, ", "‘I said to Abu Abdullah<sup style=\"font-weight: normal\">asws</sup>, ‘What have you all (Imams<sup style=\"font-weight: normal\">asws</sup>) to do from the earth?’ So he<sup style=\"font-weight: normal\">asws</sup> smiled, then said: ‘Allah<sup style=\"font-weight: normal\">azwj</sup> Blessed and High Sent Jibraeel<sup style=\"font-weight: normal\">as</sup> and Commanded him<sup style=\"font-weight: normal\">as</sup> that he<sup style=\"font-weight: normal\">as</sup> furrows eight rivers by his<sup style=\"font-weight: normal\">as</sup> big toe in the earth – from these is Sayhan, and Jayhan, and it is the river Balkh, and Al-Khashou, and it is River Shash, and Mihran, and it is a river of India, and Nile of Egypt, and Dajla, and Euphrates. ", "So whatever is watered from or drawn, so it is for us<sup>asws</sup>, and whatever was for us<sup>asws</sup> so it is for our<sup>asws</sup> Shias, and there isn’t anything from it for our<sup>asws</sup> enemies except what they have usurped upon, and that our<sup>asws</sup> friends would be in (a place) more capacious in what is between this to this, meaning between the sky and the earth’. ", "Then he<sup style=\"font-weight: normal\">asws</sup> recited this Verse <span class=\"ibTxt\">[7:32] Say: These are for the Believers in the life of this world</span> the ones usurped upon<span class=\"ibTxt\"> especially on the Day of Judgement</span> without being usurped’."]}}, {"index": 1071, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:1:4:105:6", "text": ["عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ الرَّيَّانِ قَالَ كَتَبْتُ إِلَى الْعَسْكَرِيِّ ( عليه السلام ) جُعِلْتُ فِدَاكَ رُوِيَ لَنَا أَنْ لَيْسَ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) مِنَ الدُّنْيَا إِلَّا الْخُمُسُ فَجَاءَ الْجَوَابُ إِنَّ الدُّنْيَا وَ مَا عَلَيْهَا لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) ."], "translations": {"en.hubeali": ["Ali Bin Muhammad, from Sahl Bin Ziyad, from Muhammad Bin Isa, from Muhammad Bin Al Rayyan who said, ", "‘I wrote to Al-Askary<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! It is reported to us that there isn’t anything for Rasool-Allah<sup>azwj</sup> from the world except for the fifth (<span class=\"iTxt\">Khums</span>)’. So the answer came: ‘The world and whatever is upon it is for Rasool-Allah<sup>saww</sup>’."]}}, {"index": 1072, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:1:4:105:7", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ رَفَعَهُ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) خَلَقَ اللَّهُ آدَمَ وَ أَقْطَعَهُ الدُّنْيَا قَطِيعَةً فَمَا كَانَ لآِدَمَ ( عليه السلام ) فَلِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ مَا كَانَ لِرَسُولِ اللَّهِ فَهُوَ لِلْأَئِمَّةِ مِنْ آلِ مُحَمَّدٍ ( صلى الله عليه وآله ) ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, raising it, from Amro Bin Shimr, from Jabir, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Allah<sup>azwj</sup> Created Adam<sup>as</sup> and cut the world for him<sup>as</sup> as his<sup>as</sup> piece. Thus, whatever was for Adam<sup>as</sup>, so it is for Rasool-Allah<sup>saww</sup>, and whatever was for Rasool-Allah<sup>saww</sup>, so it is for the Imams<sup>asws</sup> from the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>’."]}}, {"index": 1073, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:1:4:105:8", "text": ["مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ جَبْرَئِيلَ ( عليه السلام ) كَرَى بِرِجْلِهِ خَمْسَةَ أَنْهَارٍ وَ لِسَانُ الْمَاءِ يَتْبَعُهُ الْفُرَاتَ وَ دِجْلَةَ وَ نِيلَ مِصْرَ وَ مِهْرَانَ وَ نَهْرَ بَلْخَ فَمَا سَقَتْ أَوْ سُقِيَ مِنْهَا فَلِلْإِمَامِ وَ الْبَحْرُ الْمُطِيفُ بِالدُّنْيَا لِلْإِمَامِ "], "translations": {"en.hubeali": ["Muhammad Bin Ismail, from Al Fazl Bin Shazan and Ali Bin Ibrahim, from his father, altogether from Ibn Abu Umeyr, from Hafs Bin Al Bakhtary, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Jibraeel<sup>as</sup> dug five rivers by his<sup>as</sup> leg and the strip of the water followed it – The Euphrates, and Dajla, and Nile of Egypt, and Mihran, and river Balkh. So whatever is watered or drawn from these, so it is for the Imam<sup>asws</sup>, and the oceans circling the earth are for the Imam<sup>asws</sup>’."]}}]}, "index": "al-kafi:1:4:105", "kind": "verse_list"}