{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 1"}, "path": "/books/al-kafi:1", "titles": {"ar": "الجزء الأول‏", "en": "Volume One"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:1:4", "titles": {"ar": "كِتَابُ الْحُجَّةِ", "en": "THE BOOK OF DIVINE AUTHORITY"}}, {"indexed_titles": {"en": "Chapter 106"}, "path": "/books/al-kafi:1:4:106", "titles": {"ar": "باب سِيرَةِ الْإِمَامِ فِي نَفْسِهِ وَ فِي المَطْعَمِ وَ الْمَلْبَسِ إِذَا وَلِيَ الْأَمْرَ", "en": "Chapter 106 – The ways of the Imam<sup>asws</sup> regarding himself<sup>asws</sup> and regarding the meals and the clothing when he<sup>asws</sup> is the Master<sup>asws</sup> of the Command"}}], "index": 164, "local_index": 106, "part_type": "Chapter", "path": "/books/al-kafi:1:4:106", "titles": {"ar": "باب سِيرَةِ الْإِمَامِ فِي نَفْسِهِ وَ فِي المَطْعَمِ وَ الْمَلْبَسِ إِذَا وَلِيَ الْأَمْرَ", "en": "Chapter 106 – The ways of the Imam<sup>asws</sup> regarding himself<sup>asws</sup> and regarding the meals and the clothing when he<sup>asws</sup> is the Master<sup>asws</sup> of the Command"}, "verse_count": 4, "verse_start_index": 1073, "verses": [{"index": 1074, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:1:4:106:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ حَمَّادٍ عَنْ حُمَيْدٍ وَ جَابِرٍ الْعَبْدِيِّ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِنَّ اللَّهَ جَعَلَنِي إِمَاماً لِخَلْقِهِ فَفَرَضَ عَلَيَّ التَّقْدِيرَ فِي نَفْسِي وَ مَطْعَمِي وَ مَشْرَبِي وَ مَلْبَسِي كَضُعَفَاءِ النَّاسِ كَيْ يَقْتَدِيَ الْفَقِيرُ بِفَقْرِي وَ لَا يُطْغِيَ الْغَنِيَّ غِنَاهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad In Yahya, from Ahmad bin Muhammad Bin Isa, from Ibn Mahboub, from Hammad, from Humeyd and Jabir Al Baghdady who said, \n‘Amir Al-Momineen<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Made me<sup>asws</sup> as an Imam<sup>asws</sup> for His<sup>azwj</sup> creatures, so He<sup>azwj</sup> Necessitated the management upon me<sup>asws</sup> with regards to myself<sup>asws</sup> and my<sup>asws</sup> meals, and my<sup>asws</sup> drinks, and my<sup>asws</sup> clothing (to be) like the weak people so that the poor one can follow the example of my<sup>asws</sup> poverty and the rich one does not transgress by his riches’."}]}, {"index": 1075, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:1:4:106:2", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْمُعَلَّى بْنِ خُنَيْسٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) يَوْماً جُعِلْتُ فِدَاكَ ذَكَرْتُ آلَ فُلَانٍ وَ مَا هُمْ فِيهِ مِنَ النَّعِيمِ فَقُلْتُ لَوْ كَانَ هَذَا إِلَيْكُمْ لَعِشْنَا مَعَكُمْ فَقَالَ هَيْهَاتَ يَا مُعَلَّى أَمَا وَ اللَّهِ أَنْ لَوْ كَانَ ذَاكَ مَا كَانَ إِلَّا سِيَاسَةَ اللَّيْلِ وَ سِيَاحَةَ النَّهَارِ وَ لُبْسَ الْخَشِنِ وَ أَكْلَ الْجَشِبِ فَزُوِيَ ذَلِكَ عَنَّا فَهَلْ رَأَيْتَ ظُلَامَةً قَطُّ صَيَّرَهَا اللَّهُ تَعَالَى نِعْمَةً إِلَّا هَذِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad Bin Usman, from Al Moalla Bin Khunays who said, \n‘I said to Abu Abdullah<sup>asws</sup> one day, ‘May I be sacrificed to you<sup>asws</sup>! I remembered the family of so and so and what they are in from the Bounties, so I said, ‘If only that was for you<sup>asws</sup>, we would have lived with you<sup>asws</sup> (prosperously)’. So he<sup>asws</sup> said: ‘Far be it, O Moalla! But, by Allah<sup>azwj</sup>, had it been that, it would not have been except for hard labour (of protection) at night and strenuous work by the day, and wearing the coarse, and eating the tasteless. So that was Impeded from us<sup>asws</sup>. Have you ever seen a looted property Allah, the Most High, has turned into a blessing except this one (easy life for you while unjust Abbassids are in rule)?’"}]}, {"index": 1076, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:1:4:106:3", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ غَيْرُهُمَا بِأَسَانِيدَ مُخْتَلِفَةٍ فِي احْتِجَاجِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) عَلَى عَاصِمِ بْنِ زِيَادٍ حِينَ لَبِسَ الْعَبَاءَ وَ تَرَكَ الْمُلَاءَ وَ شَكَاهُ أَخُوهُ الرَّبِيعُ بْنُ زِيَادٍ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) أَنَّهُ قَدْ غَمَّ أَهْلَهُ وَ أَحْزَنَ وُلْدَهُ بِذَلِكَ \nفَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) عَلَيَّ بِعَاصِمِ بْنِ زِيَادٍ فَجِي‏ءَ بِهِ فَلَمَّا رَآهُ عَبَسَ فِي وَجْهِهِ فَقَالَ لَهُ أَ مَا اسْتَحْيَيْتَ مِنْ أَهْلِكَ أَ مَا رَحِمْتَ وُلْدَكَ أَ تَرَى اللَّهَ أَحَلَّ لَكَ الطَّيِّبَاتِ وَ هُوَ يَكْرَهُ أَخْذَكَ مِنْهَا أَنْتَ أَهْوَنُ عَلَى اللَّهِ مِنْ ذَلِكَ أَ وَ لَيْسَ اللَّهُ يَقُولُ وَ الْأَرْضَ وَضَعَها لِلْأَنامِ. فِيها فاكِهَةٌ وَ النَّخْلُ ذاتُ الْأَكْمامِ\nأَ وَ لَيْسَ اللَّهُ يَقُولُ مَرَجَ الْبَحْرَيْنِ يَلْتَقِيانِ. بَيْنَهُما بَرْزَخٌ لا يَبْغِيانِ إِلَى قَوْلِهِ يَخْرُجُ مِنْهُمَا اللُّؤْلُؤُ وَ الْمَرْجانُ فَبِاللَّهِ لَابْتِذَالُ نِعَمِ اللَّهِ بِالْفَعَالِ أَحَبُّ إِلَيْهِ مِنِ ابْتِذَالِهَا بِالْمَقَالِ وَ قَدْ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ أَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ \nفَقَالَ عَاصِمٌ يَا أَمِيرَ الْمُؤْمِنِينَ فَعَلَى مَا اقْتَصَرْتَ فِي مَطْعَمِكَ عَلَى الْجُشُوبَةِ وَ فِي مَلْبَسِكَ عَلَى الْخُشُونَةِ فَقَالَ وَيْحَكَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ فَرَضَ عَلَى أَئِمَّةِ الْعَدْلِ أَنْ يُقَدِّرُوا أَنْفُسَهُمْ بِضَعَفَةِ النَّاسِ كَيْلَا يَتَبَيَّغَ بِالْفَقِيرِ فَقْرُهُ فَأَلْقَى عَاصِمُ بْنُ زِيَادٍ الْعَبَاءَ وَ لَبِسَ الْمُلَاءَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from Salih Bin Abu Hammad and a number of our companions, from Ahmad Bin Muhammad and some others, by their different chains, \n‘Regarding the argumentation of Amir Al-Momineen<sup>asws</sup> upon Asim Bin Ziyad when he wore the cloak and neglected the appropriate (easy of life), and his brother Al-Rabie Bin Ziyad complained to Amir Al-Momineen<sup>asws</sup> that he (his brother by adapting strict life) had saddened his wife and grieved his children with that.\nSo Amir Al-Momineen<sup>asws</sup> said: ‘(bring) Asim Bin Ziyad to me<sup>asws</sup>!’ So they came with him. So when he<sup>asws</sup> saw him, he<sup>asws</sup> frowned his face and he<sup>asws</sup> said to him: ‘Are you not ashamed from your wife? Are you not being merciful to your children? Do you view that Allah<sup>azwj</sup> Permitted the good things for you and He<sup>azwj</sup> would Abhor it if you were to take from these? You are lesser upon Allah<sup>azwj</sup> than that. Or, isn’t Allah<sup>azwj</sup> Saying <span class=\"ibTxt\">[55:10] And the earth, He has set it for the living creatures [55:11] Therein is fruit and palms having sheathed clusters</span>?\nOr isn’t Allah<sup>azwj</sup> Saying <span class=\"ibTxt\">[55:19] He United the two seas so they meet [55:20] Between them is a barrier which they do not violate</span> – up to His<sup>azwj</sup> Words <span class=\"ibTxt\">[55:22] There come forth from them pearls and rubies</span>? So, by Allah<sup>azwj</sup>, utilisation of the Bounties of Allah<sup>azwj</sup> by the deeds is more Beloved to Him<sup>azwj</sup> than utilising them by the words, and Allah<sup>azwj</sup> Mighty and Majestic has Said <span class=\"ibTxt\">[93:11] And as for the Favour of your Lord, do announce (it)</span>’.\nAsim said, ‘O Amir Al-Momineen<sup>asws</sup>! So upon what do you<sup>asws</sup> confine (yourself) regarding your<sup>asws</sup> food upon the tastelessness, and regarding your<sup>asws</sup> clothing upon the coarseness?’ So he<sup>asws</sup> said: ‘Woe be unto you! Allah<sup>azwj</sup> Mighty and Majestic Necessitated upon the Imams<sup>asws</sup> of justice that they should manage themselves with the weak ones of the people, perhaps the poor might despair due to his poverty’. So Asim Bin Ziyad threw off the cloak and wore the appropriate’."}]}, {"index": 1077, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:1:4:106:4", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ يَحْيَى الْخَزَّازِ عَنْ حَمَّادِ بْنِ عُثْمَانَ قَالَ حَضَرْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ قَالَ لَهُ رَجُلٌ أَصْلَحَكَ اللَّهُ ذَكَرْتَ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ ( عليه السلام ) كَانَ يَلْبَسُ الْخَشِنَ يَلْبَسُ الْقَمِيصَ بِأَرْبَعَةِ دَرَاهِمَ وَ مَا أَشْبَهَ ذَلِكَ وَ نَرَى عَلَيْكَ اللِّبَاسَ الْجَدِيدَ \nفَقَالَ لَهُ إِنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ ( عليه السلام ) كَانَ يَلْبَسُ ذَلِكَ فِي زَمَانٍ لَا يُنْكَرُ عَلَيْهِ وَ لَوْ لَبِسَ مِثْلَ ذَلِكَ الْيَوْمَ شُهِرَ بِهِ فَخَيْرُ لِبَاسِ كُلِّ زَمَانٍ لِبَاسُ أَهْلِهِ غَيْرَ أَنَّ قَائِمَنَا أَهْلَ الْبَيْتِ ( عليه السلام ) إِذَا قَامَ لَبِسَ ثِيَابَ عَلِيٍّ ( عليه السلام ) وَ سَارَ بِسِيرَةِ عَلِيٍّ ( عليه السلام ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Al Barqy, from his father, from Muhammad Bin Yahya Al Khazzaz, from Hammad Bin Usman who said, \n‘I was present with Abu Abdullah<sup>asws</sup> and a man said to him<sup>asws</sup>, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! I remember that Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> used to wear the coarse (clothing). He<sup>asws</sup> was wearing the shirt of four Dirhams and what resembled that, and we see upon you<sup>asws</sup> the new clothing’. \nSo he<sup>asws</sup> said to him: ‘Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> was wearing that during the time period that it would not be denied upon him<sup>asws</sup>, and if he<sup>asws</sup> were to wear the likes of that today, he<sup>asws</sup> would be defamed by it. So the best clothing of every time period is the clothing worn by people (during that time), apart from that, our<sup>asws</sup> Qaim<sup>asws</sup> of the People<sup>asws</sup> of the Household, when he<sup>asws</sup> rises, would wear the clothing of Ali<sup>asws</sup>, and he<sup>asws</sup> would live by the way of Ali<sup>asws</sup>’."}]}]}, "index": "al-kafi:1:4:106", "kind": "verse_list"}