{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 106"
        },
        "path": "/books/al-kafi:1:4:106",
        "titles": {
          "ar": "باب سِيرَةِ الْإِمَامِ فِي نَفْسِهِ وَ فِي المَطْعَمِ وَ الْمَلْبَسِ إِذَا وَلِيَ الْأَمْرَ",
          "en": "Chapter 106 – The ways of the Imam<sup>asws</sup> regarding himself<sup>asws</sup> and regarding the meals and the clothing when he<sup>asws</sup> is the Master<sup>asws</sup> of the Command"
        }
      }
    ],
    "index": 164,
    "local_index": 106,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 107"
        },
        "path": "/books/al-kafi:1:4:107",
        "titles": {
          "ar": "باب نَادِرٌ",
          "en": "Chapter 107 - Miscellaneous"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 105"
        },
        "path": "/books/al-kafi:1:4:105",
        "titles": {
          "ar": "باب أَنَّ الْأَرْضَ كُلَّهَا لِلْإِمَامِ ( عليه السلام )",
          "en": "Chapter 105 – The earth, all of it, is for the Imam<sup>asws</sup>"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:106",
    "titles": {
      "ar": "باب سِيرَةِ الْإِمَامِ فِي نَفْسِهِ وَ فِي المَطْعَمِ وَ الْمَلْبَسِ إِذَا وَلِيَ الْأَمْرَ",
      "en": "Chapter 106 – The ways of the Imam<sup>asws</sup> regarding himself<sup>asws</sup> and regarding the meals and the clothing when he<sup>asws</sup> is the Master<sup>asws</sup> of the Command"
    },
    "verse_count": 4,
    "verse_start_index": 1073,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/361)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1074,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:106:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ حَمَّادٍ عَنْ حُمَيْدٍ وَ جَابِرٍ الْعَبْدِيِّ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِنَّ اللَّهَ جَعَلَنِي إِمَاماً لِخَلْقِهِ فَفَرَضَ عَلَيَّ التَّقْدِيرَ فِي نَفْسِي وَ مَطْعَمِي وَ مَشْرَبِي وَ مَلْبَسِي كَضُعَفَاءِ النَّاسِ كَيْ يَقْتَدِيَ الْفَقِيرُ بِفَقْرِي وَ لَا يُطْغِيَ الْغَنِيَّ غِنَاهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad In Yahya, from Ahmad bin Muhammad Bin Isa, from Ibn Mahboub, from Hammad, from Humeyd and Jabir Al Baghdady who said, ",
            "‘Amir Al-Momineen<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Made me<sup>asws</sup> as an Imam<sup>asws</sup> for His<sup>azwj</sup> creatures, so He<sup>azwj</sup> Necessitated the management upon me<sup>asws</sup> with regards to myself<sup>asws</sup> and my<sup>asws</sup> meals, and my<sup>asws</sup> drinks, and my<sup>asws</sup> clothing (to be) like the weak people so that the poor one can follow the example of my<sup>asws</sup> poverty and the rich one does not transgress by his riches’."
          ],
          "en.sarwar": [
            " 1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn Mahbub from Hammad from Humayd and Jabir al-‘Abdi who has said the following. “Amir al-Mu’minin (a.s.) has said, ‘Allah has appointed me the Imam for His creation, Therefore, He made it obligatory for me to discipline myself in the matters of food, drinks and clothes to the level of the very weak ones of the people so that the poor follow my poverty and the rich would not become rebellious because of his riches.’”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/362)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1075,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:106:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْمُعَلَّى بْنِ خُنَيْسٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) يَوْماً جُعِلْتُ فِدَاكَ ذَكَرْتُ آلَ فُلَانٍ وَ مَا هُمْ فِيهِ مِنَ النَّعِيمِ فَقُلْتُ لَوْ كَانَ هَذَا إِلَيْكُمْ لَعِشْنَا مَعَكُمْ فَقَالَ هَيْهَاتَ يَا مُعَلَّى أَمَا وَ اللَّهِ أَنْ لَوْ كَانَ ذَاكَ مَا كَانَ إِلَّا سِيَاسَةَ اللَّيْلِ وَ سِيَاحَةَ النَّهَارِ وَ لُبْسَ الْخَشِنِ وَ أَكْلَ الْجَشِبِ فَزُوِيَ ذَلِكَ عَنَّا فَهَلْ رَأَيْتَ ظُلَامَةً قَطُّ صَيَّرَهَا اللَّهُ تَعَالَى نِعْمَةً إِلَّا هَذِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad Bin Usman, from Al Moalla Bin Khunays who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup> one day, ‘May I be sacrificed to you<sup>asws</sup>! I remembered the family of so and so and what they are in from the Bounties, so I said, ‘If only that was for you<sup>asws</sup>, we would have lived with you<sup>asws</sup> (prosperously)’. So he<sup>asws</sup> said: ‘Far be it, O Moalla! But, by Allah<sup>azwj</sup>, had it been that, it would not have been except for hard labour (of protection) at night and strenuous work by the day, and wearing the coarse, and eating the tasteless. So that was Impeded from us<sup>asws</sup>. Have you ever seen a looted property Allah, the Most High, has turned into a blessing except this one (easy life for you while unjust Abbassids are in rule)?’"
          ],
          "en.sarwar": [
            " 2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad ibn ‘Uthman from Mu‘alla ibn Khunays who has said the following. “One day I said to abu ‘Abdallah (a.s.), may Allah take my soul in service for your cause, I thought of the descendants of so and so (‘Abbasside) and the wealth they have at their disposal. Then I wished that had such wealth been at your disposal we would have lived with you prosperously.” The Imam (a.s.) said, “Never O Mu‘alla, by Allah, had it been as you wished, there would have been nothing but hard labor of protections at nights and strenuous work during the days, coarse garments and tasteless food. Thus, it is kept away from us. Have you ever seen a usurpation that Allah, the Most High, would cause to become a blessing except this?”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل معتبر بل هو كالمتوات ر   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/363)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1076,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:106:3",
        "refs": {
          "Mentions": [
            "/books/quran:55:22",
            "/books/quran:55:19",
            "/books/quran:55:10",
            "/books/quran:55:21",
            "/books/quran:93:11",
            "/books/quran:55:11",
            "/books/quran:55:20",
            "/books/quran:55:12"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ غَيْرُهُمَا بِأَسَانِيدَ مُخْتَلِفَةٍ فِي احْتِجَاجِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) عَلَى عَاصِمِ بْنِ زِيَادٍ حِينَ لَبِسَ الْعَبَاءَ وَ تَرَكَ الْمُلَاءَ وَ شَكَاهُ أَخُوهُ الرَّبِيعُ بْنُ زِيَادٍ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) أَنَّهُ قَدْ غَمَّ أَهْلَهُ وَ أَحْزَنَ وُلْدَهُ بِذَلِكَ ",
          "فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) عَلَيَّ بِعَاصِمِ بْنِ زِيَادٍ فَجِي‏ءَ بِهِ فَلَمَّا رَآهُ عَبَسَ فِي وَجْهِهِ فَقَالَ لَهُ أَ مَا اسْتَحْيَيْتَ مِنْ أَهْلِكَ أَ مَا رَحِمْتَ وُلْدَكَ أَ تَرَى اللَّهَ أَحَلَّ لَكَ الطَّيِّبَاتِ وَ هُوَ يَكْرَهُ أَخْذَكَ مِنْهَا أَنْتَ أَهْوَنُ عَلَى اللَّهِ مِنْ ذَلِكَ أَ وَ لَيْسَ اللَّهُ يَقُولُ وَ الْأَرْضَ وَضَعَها لِلْأَنامِ. فِيها فاكِهَةٌ وَ النَّخْلُ ذاتُ الْأَكْمامِ",
          "أَ وَ لَيْسَ اللَّهُ يَقُولُ مَرَجَ الْبَحْرَيْنِ يَلْتَقِيانِ. بَيْنَهُما بَرْزَخٌ لا يَبْغِيانِ إِلَى قَوْلِهِ يَخْرُجُ مِنْهُمَا اللُّؤْلُؤُ وَ الْمَرْجانُ فَبِاللَّهِ لَابْتِذَالُ نِعَمِ اللَّهِ بِالْفَعَالِ أَحَبُّ إِلَيْهِ مِنِ ابْتِذَالِهَا بِالْمَقَالِ وَ قَدْ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ أَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ ",
          "فَقَالَ عَاصِمٌ يَا أَمِيرَ الْمُؤْمِنِينَ فَعَلَى مَا اقْتَصَرْتَ فِي مَطْعَمِكَ عَلَى الْجُشُوبَةِ وَ فِي مَلْبَسِكَ عَلَى الْخُشُونَةِ فَقَالَ وَيْحَكَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ فَرَضَ عَلَى أَئِمَّةِ الْعَدْلِ أَنْ يُقَدِّرُوا أَنْفُسَهُمْ بِضَعَفَةِ النَّاسِ كَيْلَا يَتَبَيَّغَ بِالْفَقِيرِ فَقْرُهُ فَأَلْقَى عَاصِمُ بْنُ زِيَادٍ الْعَبَاءَ وَ لَبِسَ الْمُلَاءَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Salih Bin Abu Hammad and a number of our companions, from Ahmad Bin Muhammad and some others, by their different chains, ",
            "‘Regarding the argumentation of Amir Al-Momineen<sup>asws</sup> upon Asim Bin Ziyad when he wore the cloak and neglected the appropriate (easy of life), and his brother Al-Rabie Bin Ziyad complained to Amir Al-Momineen<sup>asws</sup> that he (his brother by adapting strict life) had saddened his wife and grieved his children with that.",
            "So Amir Al-Momineen<sup>asws</sup> said: ‘(bring) Asim Bin Ziyad to me<sup>asws</sup>!’ So they came with him. So when he<sup>asws</sup> saw him, he<sup>asws</sup> frowned his face and he<sup>asws</sup> said to him: ‘Are you not ashamed from your wife? Are you not being merciful to your children? Do you view that Allah<sup>azwj</sup> Permitted the good things for you and He<sup>azwj</sup> would Abhor it if you were to take from these? You are lesser upon Allah<sup>azwj</sup> than that. Or, isn’t Allah<sup>azwj</sup> Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:55#h10\">[55:10]</a> And the earth, He has set it for the living creatures <a href=\"/#/books/quran:55#h11\">[55:11]</a> Therein is fruit and palms having sheathed clusters</span>?",
            "Or isn’t Allah<sup>azwj</sup> Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:55#h19\">[55:19]</a> He United the two seas so they meet <a href=\"/#/books/quran:55#h20\">[55:20]</a> Between them is a barrier which they do not violate</span> – up to His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:55#h22\">[55:22]</a> There come forth from them pearls and rubies</span>? So, by Allah<sup>azwj</sup>, utilisation of the Bounties of Allah<sup>azwj</sup> by the deeds is more Beloved to Him<sup>azwj</sup> than utilising them by the words, and Allah<sup>azwj</sup> Mighty and Majestic has Said <span class=\"ibTxt\"><a href=\"/#/books/quran:93#h11\">[93:11]</a> And as for the Favour of your Lord, do announce (it)</span>’.",
            "Asim said, ‘O Amir Al-Momineen<sup>asws</sup>! So upon what do you<sup>asws</sup> confine (yourself) regarding your<sup>asws</sup> food upon the tastelessness, and regarding your<sup>asws</sup> clothing upon the coarseness?’ So he<sup>asws</sup> said: ‘Woe be unto you! Allah<sup>azwj</sup> Mighty and Majestic Necessitated upon the Imams<sup>asws</sup> of justice that they should manage themselves with the weak ones of the people, perhaps the poor might despair due to his poverty’. So Asim Bin Ziyad threw off the cloak and wore the appropriate’."
          ],
          "en.sarwar": [
            " 3. Ali ibn Muhammad has narrated from Salih ibn abu Hammad and A number of our people has narrated from Ahmad ibn Muhammad and others through different chains of narrators. The Hadith is about the protest of Amir al-Mu’minin (a.s.) against ‘Asim ibn Ziyad who had confined himself in a gown away from the people. His brother, al-Rabi‘ ibn Ziyad complained before Amir al-Mu’minin (a.s.) complained that his ‘Asim’s family had become depressed and his sons had been sadden because of his behavior. Amir al-Mu’minin (a.s.) had summoned ‘Asim ibn Ziyad and was brought before him. When Amir al-Mu’minin (a.s.) saw him he frowned at him and said, “Why did you not feel ashamed before your wife? Why did you not show kindness to your sons? Do you think Allah had made good things lawful to and then He would dislike if you would use them? You are less significant to Allah than such a thing. Is it not Allah Who has said, “He spread out the earth for the people <a href=\"/#/books/quran:55#h10\">[55:10]</a>. There exists all kinds of fruits, palm-trees with sheathed blossoms, <a href=\"/#/books/quran:55#h11\">[55:11]</a> grain with its husk and aromatic herbs <a href=\"/#/books/quran:55#h12\">[55:12]</a>. Is it not Allah Who has said, “He has made the two oceans meet each other, <a href=\"/#/books/quran:55#h19\">[55:19]</a> but has created a barrier between them so that they will not merge totally <a href=\"/#/books/quran:55#h20\">[55:20]</a>. (Jinn and mankind) - which of the favors of your Lord do you then deny? <a href=\"/#/books/quran:55#h21\">[55:21]</a>. From the two oceans comes pearls and coral.” <a href=\"/#/books/quran:55#h22\">[55:22]</a> I swear by Allah, the use of the bounties of Allah in deeds is more preferred to Him than then using in words. Allah, the Most Majestic, the Most gracious, has said, “. and proclaim the bounties of your Lord.” <a href=\"/#/books/quran:93#h11\">[93:11]</a> ‘Asim said, “O Amir al-Mu’minin (a.s.), “Why have you confined yourself to tasteless food and harsh garments?” He said, “How inconsiderate of you! Allah, the Most Majestic, the Most gracious, has made obligatory for the Imams of justice to measure themselves with the people of lowest standard of living so that the poors’ poverty would plunge him in despair.” ‘Asim then abandoned the gown and begun to live an normal life.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/368)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (49/ 1)"
        ],
        "index": 1077,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:106:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ يَحْيَى الْخَزَّازِ عَنْ حَمَّادِ بْنِ عُثْمَانَ قَالَ حَضَرْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ قَالَ لَهُ رَجُلٌ أَصْلَحَكَ اللَّهُ ذَكَرْتَ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ ( عليه السلام ) كَانَ يَلْبَسُ الْخَشِنَ يَلْبَسُ الْقَمِيصَ بِأَرْبَعَةِ دَرَاهِمَ وَ مَا أَشْبَهَ ذَلِكَ وَ نَرَى عَلَيْكَ اللِّبَاسَ الْجَدِيدَ ",
          "فَقَالَ لَهُ إِنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ ( عليه السلام ) كَانَ يَلْبَسُ ذَلِكَ فِي زَمَانٍ لَا يُنْكَرُ عَلَيْهِ وَ لَوْ لَبِسَ مِثْلَ ذَلِكَ الْيَوْمَ شُهِرَ بِهِ فَخَيْرُ لِبَاسِ كُلِّ زَمَانٍ لِبَاسُ أَهْلِهِ غَيْرَ أَنَّ قَائِمَنَا أَهْلَ الْبَيْتِ ( عليه السلام ) إِذَا قَامَ لَبِسَ ثِيَابَ عَلِيٍّ ( عليه السلام ) وَ سَارَ بِسِيرَةِ عَلِيٍّ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Al Barqy, from his father, from Muhammad Bin Yahya Al Khazzaz, from Hammad Bin Usman who said, ",
            "‘I was present with Abu Abdullah<sup>asws</sup> and a man said to him<sup>asws</sup>, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! I remember that Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> used to wear the coarse (clothing). He<sup>asws</sup> was wearing the shirt of four Dirhams and what resembled that, and we see upon you<sup>asws</sup> the new clothing’. ",
            "So he<sup>asws</sup> said to him: ‘Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> was wearing that during the time period that it would not be denied upon him<sup>asws</sup>, and if he<sup>asws</sup> were to wear the likes of that today, he<sup>asws</sup> would be defamed by it. So the best clothing of every time period is the clothing worn by people (during that time), apart from that, our<sup>asws</sup> Qaim<sup>asws</sup> of the People<sup>asws</sup> of the Household, when he<sup>asws</sup> rises, would wear the clothing of Ali<sup>asws</sup>, and he<sup>asws</sup> would live by the way of Ali<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 4. A number of our people has narrated from Ahmad ibn Muhammad al-Barqi from his fatherfm Muhammad ibn Yahya al-Khazzaz from Hammad ibn ‘Uthman who has said the following. “I was in the presence of abu ‘Abdallah (a.s.) that a man said to him, “May Allah grant you well being, you have mentioned that Ali ibn abu Talib (a.s.) would wear harsh garments. He would buy a shirt worth four Dirhams only and so on. However, we see that you have new garments.” The Imam (a.s.) said, “Ali ibn abu Talib (a.s.) would do so at a time when people would dislike it. Wearing such garments to day would have defamed him. The best garment for a given time is the garment that people of that time would use. However, when our Al-Qa’im will rise with Divine Authority, he will wear the kind of garment that Ali (a.s.) did and he will live just as Ali (a.s.) lived.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:106",
  "kind": "verse_list"
}