{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 108"
        },
        "path": "/books/al-kafi:1:4:108",
        "titles": {
          "ar": "باب فِيهِ نُكَتٌ وَ نُتَفٌ مِنَ التَّنْزِيلِ فِي الْوَلَايَةِ",
          "en": "Chapter 108 – Points and pickings from the Revelation regarding the Wilayah"
        }
      }
    ],
    "index": 166,
    "local_index": 108,
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:108",
    "titles": {
      "ar": "باب فِيهِ نُكَتٌ وَ نُتَفٌ مِنَ التَّنْزِيلِ فِي الْوَلَايَةِ",
      "en": "Chapter 108 – Points and pickings from the Revelation regarding the Wilayah"
    },
    "verse_count": 92,
    "verse_start_index": 1081,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1082,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ حَنَانِ بْنِ سَدِيرٍ عَنْ سَالِمٍ الْحَنَّاطِ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) أَخْبِرْنِي عَنْ قَوْلِ اللَّهِ تَبَارَكَ وَ تَعَالَى نَزَلَ بِهِ الرُّوحُ الْأَمِينُ عَلى قَلْبِكَ لِتَكُونَ مِنَ الْمُنْذِرِينَ بِلِسانٍ عَرَبِيٍّ مُبِينٍ قَالَ هِيَ الْوَلَايَةُ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from some of our companions, from Hanan Bin Sadeyr, from Salim Al Hannat who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘Inform me about the Words of Allah<sup>azwj</sup> Blessed and High <span class=\"ibTxt\">[26:193] The Trustworthy Spirit has descended with it [26:194] Upon your heart that you may become from the warners [26:195] In clear Arabic language</span>. He<sup>asws</sup> said: ‘It is the Wilayah of Amir Al-Momineen<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 1. A number of our people has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from certain persons of our people from Hanan ibn Sadir from Salim al-Hannat who has said the following. “I aske abu Ja‘far (a.s.), ‘Explain to me the meaning of this verse of the Holy Quran. “This, (Quran), is certainly the revelation from the Lord of the Universe (26:192). It has been revealed through the trustworthy Spirit (26:193) to your heart, so that you will warn (the people of the dangers of disobeying God) (26:194). It has been revealed in plain Arabic.” (26:195) The Imam (a.s.) said, “It refers to Leadership with Divine Authority of Amir al-Mu’minin (a.s.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1083,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنِ الْحَكَمِ بْنِ مِسْكِينٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّا عَرَضْنَا الْأَمانَةَ عَلَى السَّماواتِ وَ الْأَرْضِ وَ الْجِبالِ فَأَبَيْنَ أَنْ يَحْمِلْنَها وَ أَشْفَقْنَ مِنْها وَ حَمَلَهَا الْإِنْسانُ إِنَّهُ كانَ ظَلُوماً جَهُولًا قَالَ هِيَ وَلَايَةُ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Al Hakam Bin Miskeen, from Is’haq Bin Ammar, from a man, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[33:72] Surely We Presented the Trust to the skies, and the earth, and the mountains, but they refused to bear it and feared from it, and the human being bore it; he was unjust, ignorant</span>. He<sup>asws</sup> said: ‘It is the Wilayah of Amir Al-Momineen<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from al-Hakam ibn Miskin from Ishaq ibn ‘Ammara from a man from abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “We offered Our Trust (Our deputation) to the heavens, to the earth, and to the mountains, but they could not bear this burden and were afraid to accept it. Mankind was able to accept this offer but he was unjust to himself and ignorant of the significance of this Trust.” (33:72). The Imam (a.s.) said, “It refers to Leadership with Divine Authority of Amir al-Mu’minin (a.s.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/8)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1084,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ أَبِي زَاهِرٍ عَنِ الْحَسَنِ بْنِ مُوسَى الْخَشَّابِ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ الَّذِينَ آمَنُوا وَ لَمْ يَلْبِسُوا إِيمانَهُمْ بِظُلْمٍ قَالَ بِمَا جَاءَ بِهِ مُحَمَّدٌ ( صلى الله عليه وآله ) مِنَ الْوَلَايَةِ وَ لَمْ يَخْلِطُوهَا بِوَلَايَةِ فُلَانٍ وَ فُلَانٍ فَهُوَ الْمُلَبَّسُ بِالظُّلْمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Abu Zahir, from Al Hassan Bin Musa Al Kshhab, from Ali Bin Hassan, from Abdul Rahman Bin Kaseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[6:82] Those who believe and do not mix up their faith with injustice</span>. He<sup>asws</sup> said: ‘With whatever Muhammad<sup>saww</sup> came with from the Wilayah, and they are not mixing it with the Wilayah of so and so, and so and so, so it is ‘mixing up ‘بِالظُّلْمِ’ with the injustice’’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn Yahya has narrated from abu Zahir from al-Hassan ibn Musa al-Khashshab from Ali ibn Hassa’n from ‘Abd al-Rahman ibn Kathir from abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “Those who have accepted the faith and have kept it pure from injustice, have achieved security and guidance.” (6:82) The Imam (a.s.) said, “It refers to faith in that Prophet Muhammad (s.a) has brought from Allah about Wilaya, Leadership with Divine Authority and have not mixed it with the authority of so and so that is mixing with injustice.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/10)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1085,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْحُسَيْنِ بْنِ نُعَيْمٍ الصَّحَّافِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَمِنْكُمْ كافِرٌ وَ مِنْكُمْ مُؤْمِنٌ فَقَالَ عَرَفَ اللَّهُ إِيمَانَهُمْ بِوَلَايَتِنَا وَ كُفْرَهُمْ بِهَا يَوْمَ أَخَذَ عَلَيْهِمُ الْمِيثَاقَ فِي صُلْبِ آدَمَ ( عليه السلام ) وَ هُمْ ذَرٌّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Al Husayn Bin Nuaym Al Sahhaf who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[64:2] He it is Who Created you, so among you is an unbeliever and among you is a Believer</span>. So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Recognised their <span class=\"iTxt\">Eman</span> by our<sup>asws</sup> Wilayah and their disbelief in it on the day He<sup>azwj</sup> Took the Covenant upon them in ‘صُلْبِ’ the forehead of Adam<sup>as</sup>, and they were particles’."
          ],
          "en.sarwar": [
            " 4. Muhammad ibn Yahya has narrated from from Ahmad ibn Muhammad from ibn Mahbub from al-Hassan ibn Nu‘aym al-Sahhaf who has said the following. “I asked abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “. .some of you have accepted the faith and some of you have not.. .” (64:2) The Imam (a.s.) said, “On the day that Allah made all the offspring of Adam to make a covenant with Him when they were just small particles He made faith our Wilaya, (Leadership with Divine Authority) the standard for faith and disbelief.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1086,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:5",
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنِ ابْنِ مَحْبُوبٍ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ يُوفُونَ بِالنَّذْرِ الَّذِي أَخَذَ عَلَيْهِمْ مِنْ وَلَايَتِنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Ahmad, from Yaqoub Bin Yazeed, from Ibn Mahboub, from Muhammad Bin Al Fuzayl, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[76:7] They fulfill vows</span> which were Taken upon them of our<sup>asws</sup> Wilayah’."
          ],
          "en.sarwar": [
            " 5. Ahmad ibn Idris has narrated from Muhammad ibn Ahmad from ya‘qub ibn Yazid from ibn Mahbub from Muhammad ibn al-Fudayl from abu al-Hassan (a.s.) the following about the words of Allah, the Most Majestic, the Most gracious. “. . fulfill their vows .” .(76:7) The Imam (a.s.) said, “It refers to the vow that was due to our Wilaya (Leadership with Divine Authority).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1087,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:6",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيِّ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ لَوْ أَنَّهُمْ أَقامُوا التَّوْراةَ وَ الْإِنْجِيلَ وَ ما أُنْزِلَ إِلَيْهِمْ مِنْ رَبِّهِمْ قَالَ الْوَلَايَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazan, from Hammad Bin Isa, from Rabie Bin Abdullah, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[5:66] And if they had observed the Torah and the Evangel and that which was Revealed to them from their Lord</span>. He<sup>asws</sup> said: ‘Al-Wilayah’."
          ],
          "en.sarwar": [
            " 6. Muhammad ibn Isma‘il has narrated from al-Fadl ibn Shadhan from Hammad ibn ‘Isa from RibIsma‘il ibn ‘Abdallah from abu Ja‘far (a.s.) about the words of Allah, the Most Majestic, the Most Gracious, “Had they followed the Laws of the Old and New Testaments and what was revealed to them from their Lord,. .” (5:66) The Imam (a.s.) said, “It refers to Wilaya, (Leadership with Divine Authority).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1088,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:7",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ مُثَنًّى عَنْ زُرَارَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَجْلَانَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى قُلْ لا أَسْئَلُكُمْ عَلَيْهِ أَجْراً إِلَّا الْمَوَدَّةَ فِي الْقُرْبى قَالَ هُمُ الْأَئِمَّةُ ( عليهم السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad Al Ashary, from Moalla Bin Muhammad, from Al Washha, from Musna, from Zurara, from Abdullah Bin Ajlan, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\">[42:23] Say: I do not ask of you any Recompense for it except for the cordiality for my near relatives</span>. He<sup>asws</sup> said: ‘They<sup>asws</sup> are the Imams<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 7. Al-Husayn ibn Muhammad al-Asha‘ari from Mu‘alla ibn Muhammad from al-Washsha’ from al-Muthanna from Zurara from ‘Abdallah ibn al-‘Ajlan from abu Ja‘far (a.s.) about the words of Allah, the most High. “(Muhammad), say, “I do not ask you for any payment for my preaching to you except (your) love of(my near) relatives.. .” (42:23). The Imam (a.s.) said, “They (the relatives) are the Imams.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (14/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1089,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:8",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ يُطِعِ اللَّهَ وَ رَسُولَهُ فِي وَلَايَةِ عَلِيٍّ وَ وَلَايَةِ الْأَئِمَّةِ مِنْ بَعْدِهِ فَقَدْ فازَ فَوْزاً عَظِيماً هَكَذَا نَزَلَتْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ali Bin Asbat, from Ali Bin Abu Hamza, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[33:71] and whoever obeys Allah and His Rasool, regarding the Wilayah of Ali</span><sup class=\"ibTxt\">asws</sup><span class=\"ibTxt\"> and Wilayah of the Imams</span><sup class=\"ibTxt\">asws</sup><span class=\"ibTxt\"> from after him, so he indeed achieves a mighty success</span> – <span style=\"text-decoration: underline\">this is how it was Revealed</span>’."
          ],
          "en.sarwar": [
            " 8. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Ali ibn Asbat from Ali ibn abu Hamza from abu Basir from abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most Gracious. “One who obeys God and His Messenger (to acknowledge Wilaya, (Leadership with Divine Authority Ali and the Imams after him) will certainly achieve a great success.”. (33:71) This how it was revealed.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/14)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1090,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:9",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ النَّضْرِ عَنْ مُحَمَّدِ بْنِ مَرْوَانَ رَفَعَهُ إِلَيْهِمْ فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ ما كانَ لَكُمْ أَنْ تُؤْذُوا رَسُولَ اللَّهِ فِي عَلِيٍّ وَ الْأَئِمَّةِ كَالَّذِينَ آذَوْا مُوسى فَبَرَّأَهُ اللَّهُ مِمَّا قالُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ahmad Bin Al Nazar, from Muhammad Bin Marwan, ",
            "(It has been narrated) raising it to them<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[33:53] and it does not behove you that you should hurt Rasool Allah</span> regarding Ali<sup>asws</sup> and the Imams<sup>asws</sup> just like those who had hurt Musa<sup>as</sup>. So Allah<sup>azwj</sup> Disavowed from what they were saying’."
          ],
          "en.sarwar": [
            " 9. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Ahmad ibn al-Nadr from Muhammad ibn Marwan in a marfu‘ manner to them about the words of Allah, the Most Majestic, the Most Gracious, “You are not supposed to trouble the Prophet (in the matters of Ali and the Imam (a.s.) .(33:53) .” “. .like those who annoyed Moses. God proved him to be innocent of what they had said about him. .” (33:70).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالسابق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1091,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:10",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ السَّيَّارِيِّ عَنْ عَلِيِّ بْنِ عَبْدِ اللَّهِ قَالَ سَأَلَهُ رَجُلٌ عَنْ قَوْلِهِ تَعَالَى فَمَنِ اتَّبَعَ هُدايَ فَلا يَضِلُّ وَ لا يَشْقى قَالَ مَنْ قَالَ بِالْأَئِمَّةِ وَ اتَّبَعَ أَمْرَهُمْ وَ لَمْ يَجُزْ طَاعَتَهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Sayyari, from Ali Bin Abdullah who said, ",
            "‘A man asked about the Words of the Exalted <span class=\"ibTxt\">[20:123] then whoever follows My Guidance, he shall not go astray nor be distressed</span>. He<sup>asws</sup> said: ‘The one who acknowledges the Imams<sup>asws</sup> and follows their<sup>asws</sup> orders and do not exceed their<sup>asws</sup> obedience’."
          ],
          "en.sarwar": [
            " 10. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from al-Sayyariy from Ali ibn ‘Abdallah who has said the following “A man asked the Imam (a.s.) about the words of Allah, the Most High.. “,. . those who follow it (My guidance) will not go astray nor will they endure any misery.” (20:123) The Imam (a.s.) said, “It refers to those who acknowledge the Imams (Leaders with Divine Authority) follow their commands and would not go beyond their obedience.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالسابق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1092,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:11",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ رَفَعَهُ فِي قَوْلِهِ تَعَالَى لا أُقْسِمُ بِهذَا الْبَلَدِ. وَ أَنْتَ حِلٌّ بِهذَا الْبَلَدِ. وَ والِدٍ وَ ما وَلَدَ قَالَ أَمِيرُ الْمُؤْمِنِينَ وَ مَا وَلَدَ مِنَ الْأَئِمَّةِ ( عليهم السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Ali Bin Muhammad, from Ahmad Bin Muhammad Bin Abdullah, ",
            "(It has been narrated) raising it regarding the Words of the Exalted <span class=\"ibTxt\">[90:1] Indeed! I swear by this city [90:2] And you are a dweller of this city [90:3] And a father and what he begot</span>. He<sup>asws</sup> said: ‘Amir Al-Momineen<sup>asws</sup> and what he<sup>asws</sup> begot from the Imams<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 11. Al-Husayn ibn Muhammad has narrated from Ali ibn Muhammad from Ahmad ibn Muhammad ibn ‘Abdallah in a marfu‘ manner about the words of Allah, the Most High. “I do not (need to) swear by this town (Mecca) (90:1) in which you are now living (90:2) or by the great father and his wonderful son . .” (90:3) The Imam (a.s.) said, “It refers to Amir al-Mu’minin (a.s.) and the Imams from his descendants.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1093,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:12",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أُورَمَةَ وَ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ تَعَالَى وَ اعْلَمُوا أَنَّما غَنِمْتُمْ مِنْ شَيْ‏ءٍ فَأَنَّ لِلَّهِ خُمُسَهُ وَ لِلرَّسُولِ وَ لِذِي الْقُرْبى قَالَ أَمِيرُ الْمُؤْمِنِينَ وَ الْأَئِمَّةُ ( عليهم السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Awrama and Muhammad Bin Abdullah, from Ali Bin Hassan, from Abdul Rahman Bin Kaseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> the Exalted <span class=\"ibTxt\">[8:41] And know that whatever war booty you gain, a fifth of it is for Allah and for the Rasool and for the near of kin</span>. He<sup>asws</sup> said: ‘Amir Al-Momineen<sup>asws</sup> and the Imams<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 12. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn ’Urama and Muhammad ibn ‘Abdallah from Ali ibn Hassa’n from ‘Abd al-Rahman ibn Kathir from abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “Know that whatever property you may gain, one fifth belongs to God, the Messenger, the kindred, . .” (8:41) The Imam (a.s.) said, “It refers to Amir al-Mu’minin (a.s.) and the Imams (a.s.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1094,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:13",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ مِمَّنْ خَلَقْنا أُمَّةٌ يَهْدُونَ بِالْحَقِّ وَ بِهِ يَعْدِلُونَ قَالَ هُمُ الْأَئِمَّةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washa, from Abdullah Bin Sinan who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[7:181] And of those whom We have Created are a people who are Guiding with the Truth and thereby they are doing justice</span>. He<sup>asws</sup> said: ‘They<sup>asws</sup> are the Imams<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 13. Al-Husayn ibn Muhammad has narrated from from Mu‘alla ibn Muhammad from al-Washsha’ from ‘Abdallah ibn Sinan who has said the following. “I asked abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “Among Our creatures are a group who guide and judge with the Truth.” (7:181). The Imam (a.s.) said, “Such people are the Imams (a.s.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/18)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1095,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:14",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أُورَمَةَ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى هُوَ الَّذِي أَنْزَلَ عَلَيْكَ الْكِتابَ مِنْهُ آياتٌ مُحْكَماتٌ هُنَّ أُمُّ الْكِتابِ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) وَ الْأَئِمَّةُ وَ أُخَرُ مُتَشابِهاتٌ قَالَ فُلَانٌ وَ فُلَانٌ فَأَمَّا الَّذِينَ فِي قُلُوبِهِمْ زَيْغٌ أَصْحَابُهُمْ وَ أَهْلُ وَلَايَتِهِمْ فَيَتَّبِعُونَ ما تَشابَهَ مِنْهُ ابْتِغاءَ الْفِتْنَةِ وَ ابْتِغاءَ تَأْوِيلِهِ وَ ما يَعْلَمُ تَأْوِيلَهُ إِلَّا اللَّهُ وَ الرَّاسِخُونَ فِي الْعِلْمِ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) وَ الْأَئِمَّةُ ( عليهم السلام)."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Awrama, from Ali Bin Hassan, from Abdul Rahman Bin Kaseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\">[3:7] He is the One Who has Revealed the Book to you; some of its Verses are Decisive, they are the Mother of the Book</span>. He<sup>asws</sup> said: ‘Amir Al-Momineen<sup>asws</sup> and the Imams<sup>asws</sup> <span class=\"ibTxt\">and others are Allegorical</span>. He<sup>asws</sup> said: ‘So and so and so and so. <span class=\"ibTxt\">then as for those in whose hearts there is perversity </span>- their companions and the people of their wilayah <span class=\"ibTxt\">they follow the part of it which is allegorical seeking to mislead and seeking to give it (their own) interpretation; but none knows its interpretation except Allah, and those who are firmly rooted in the Knowledge</span> - Amir Al-Momineen<sup>asws</sup> and the Imams<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 14. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn ’Urama from Ali ibn Hassa’n from ‘Abd al-Rahman ibn Kathir from abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “It is God who has revealed the Book to you in which some verses are clear statements (which accept no interpretation) and these are the fundamental ideas of the Book,-they stand for Amir al-Mu’minin (a.s.) and the Imams- while other verses may have several possibilities-they stand for so and so-. Those whose hearts are perverse-their companions and followers-, follow the unclear statements in pursuit of their own mischievous goals by interpreting them in a way that will suit their own purpose. No one knows its true interpretations except God and those who have a firm grounding in knowledge-such people are Amir al-Mu’minin (a.s.) and the Imams-. .” (3:7),.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (19/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1096,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:15",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ مُثَنًّى عَنْ عَبْدِ اللَّهِ بْنِ عَجْلَانَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى أَمْ حَسِبْتُمْ أَنْ تُتْرَكُوا وَ لَمَّا يَعْلَمِ اللَّهُ الَّذِينَ جاهَدُوا مِنْكُمْ وَ لَمْ يَتَّخِذُوا مِنْ دُونِ اللَّهِ وَ لا رَسُولِهِ وَ لَا الْمُؤْمِنِينَ وَلِيجَةً يَعْنِي بِالْمُؤْمِنِينَ الْأَئِمَّةَ ( عليهم السلام ) لَمْ يَتَّخِذُوا الْوَلَائِجَ مِنْ دُونِهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washha, from Musna, from Abdullah Bin Ajlan, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\">[9:16] Are you reckoning that you would be left alone while Allah has not yet Known those of you who have struggled hard and do not take to any one besides Allah and His Rasool and the Believers</span>– Meaning by ‘the Believers’ as the Imams<sup>asws</sup>, not taking <span class=\"ibTxt\">as a confidant</span> the ones besides them<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 15. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from al-Washsha’ from Muthanna from ‘Abdallah ibn ‘Ajlan from abu Ja‘far (a.s.) about the words of Allah, the Most High. “Do you think that God will not make any distinction between those of you who have fought for His cause and have relied on no one other than God, His Messenger, and the faithful ones, and other people?. .” (9:16) The Imam (a.s.) said, “The word ‘faithful’ stands for Amir al-Mu’minin (a.s.) and the Imams who have not relied on any one besides Allah, the Messenger of Allah and the faithful ones.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/20)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1097,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:16",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ صَفْوَانَ عَنِ ابْنِ مُسْكَانَ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى وَ إِنْ جَنَحُوا لِلسَّلْمِ فَاجْنَحْ لَها قَالَ قُلْتُ مَا السَّلْمُ قَالَ الدُّخُولُ فِي أَمْرِنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Jamhour, from Safwan, from Ibn Muskan, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\">[8:61] And if they incline towards peace, then incline to it</span>. He<sup>asws</sup> said: ‘The entry into our<sup>asws</sup> matter (Al-Wilayah)’."
          ],
          "en.sarwar": [
            " 16. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn Jumhur from Safwan from ibn Muskan from al-Halabi from abu ‘Abdallah about the words of Allah, the Most Majestic, the Most gracious. “If they (the unbelievers) propose peace, accept it and trust in God. God is All-hearing and All-knowing.” (8:61). The narrator has said, “I asked the Imam (a.s.), ‘What is the meaning of peace?” The Imam (a.s.) said, “It is the acknowledgment of our Leadership with Divine Authority.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/20)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/50)"
        ],
        "index": 1098,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:17",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى لَتَرْكَبُنَّ طَبَقاً عَنْ طَبَقٍ قَالَ يَا زُرَارَةُ أَ وَ لَمْ تَرْكَبْ هَذِهِ الْأُمَّةُ بَعْدَ نَبِيِّهَا طَبَقاً عَنْ طَبَقٍ فِي أَمْرِ فُلَانٍ وَ فُلَانٍ وَ فُلَانٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhamman Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Jameel Bin Salih, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\">[84:19] That you shall most certainly enter one state after another</span>. He<sup>asws</sup> said: ‘And didn’t this community, after its Prophet<sup>saww</sup>, enter one state after another with regards to the matter of so and so, and so and so, and so and so?’."
          ],
          "en.sarwar": [
            " 17. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from Jamil ibn Salih from Zurara from abu Ja‘far (a.s.) about the words of Allah, the Most High. “. . you will certainly pass through one stage after another.” (84:19). The Imam (a.s.) said, “O Zurara, Has this ’Umma (nation) not passed through stages after the Holy Prophet (s.a) and the affairs of three so and sos?”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/21)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1099,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:18",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ عَبْدِ اللَّهِ بْنِ جُنْدَبٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ لَقَدْ وَصَّلْنا لَهُمُ الْقَوْلَ لَعَلَّهُمْ يَتَذَكَّرُونَ قَالَ إِمَامٌ إِلَى إِمَامٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Jamhour, from Hammad Bin Isa, from Abdullah Bin Jundab who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about the Words of Allah<sup>asws</sup> Mighty and Majestic <span class=\"ibTxt\">28:51] And We have Made the Word to reach them so that they may be mindful</span>. He<sup>asws</sup> said: ‘Imam<sup>asws</sup> to an Imam<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 18. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn Jumhur from Hammad ibn ‘Isa from ‘Abdallah ibn Jundab who has said the following. “I asked abu al-Hassan (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “We sent Our guidance to them so that perhaps they might take heed.” (28:51) The Imam (a.s.) said, “It means the one Imam after the other.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1100,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:19",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ مُحَمَّدِ بْنِ النُّعْمَانِ عَنْ سَلَّامٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى قُولُوا آمَنَّا بِاللَّهِ وَ ما أُنْزِلَ إِلَيْنا قَالَ إِنَّمَا عَنَى بِذَلِكَ عَلِيّاً ( عليه السلام ) وَ فَاطِمَةَ وَ الْحَسَنَ وَ الْحُسَيْنَ وَ جَرَتْ بَعْدَهُمْ فِي الْأَئِمَّةِ ( عليهم السلام ) ثُمَّ يَرْجِعُ الْقَوْلُ مِنَ اللَّهِ فِي النَّاسِ فَقَالَ فَإِنْ آمَنُوا يَعْنِي النَّاسَ بِمِثْلِ ما آمَنْتُمْ بِهِ يَعْنِي عَلِيّاً وَ فَاطِمَةَ وَ الْحَسَنَ وَ الْحُسَيْنَ وَ الْأَئِمَّةَ ( عليهم السلام ) فَقَدِ اهْتَدَوْا وَ إِنْ تَوَلَّوْا فَإِنَّما هُمْ فِي شِقاقٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Muhammad Bin Al Numan, from Sallam, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\">[2:136] Say: We believe in Allah and (in) that which had been Revealed unto us</span>. He<sup>asws</sup> said: ‘But rather it Means by that, Ali<sup>asws</sup>, and (Syeda) Fatima<sup>asws</sup>, and Al-Hassan<sup>asws</sup>, and Al-Husayn<sup>asws</sup>, and it flows after them<sup>asws</sup> regarding the Imams<sup>asws</sup>. Then the Words returned from Allah<sup>azwj</sup> regarding the people, so He<sup>azwj</sup> Said <span class=\"ibTxt\">[2:137] So if they </span>– Meaning the people - <span class=\"ibTxt\">were to believe as you believe in Him </span>– Meaning Ali<sup>asws</sup>, and (Syeda) Fatima<sup>asws</sup> and Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup> and the Imams<sup>asws</sup> -<span class=\"ibTxt\"> they would have been Guided on the right course, and if they were to turn back, then they are only in strife</span>’."
          ],
          "en.sarwar": [
            " 19. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Alhossayn ibn Mahbub from Muhammad ibn al-Ni‘man from Salam from abu Ja‘far (a.s.) about the words of Allah, the Most High. “(Muslims), say, “We believe in God and what He has revealed to us. .” The Imam (a.s.) said, “This is primarily addressed to Ali, Fatima, al-Hassan and al-Husayn (a.s.) and thereafter to the Imams (a.s.). Then the words of Allah “. . If they (refer to people) have faith, in all that you (Ali, Fatima, al-Hassan and al-Husayn (a.s.) believe, they will have the right guidance, but if they turn away, it would be for no reason other than their own malice. . .” (2:137)"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1101,
        "local_index": 20,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:20",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ مُثَنًّى عَنْ عَبْدِ اللَّهِ بْنِ عَجْلَانَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى إِنَّ أَوْلَى النَّاسِ بِإِبْراهِيمَ لَلَّذِينَ اتَّبَعُوهُ وَ هذَا النَّبِيُّ وَ الَّذِينَ آمَنُوا قَالَ هُمُ الْأَئِمَّةُ ( عليهم السلام ) وَ مَنِ اتَّبَعَهُمْ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washha, from Musna, from Abdullah Bin Ajlan, ",
            "(It has been narrated) from Abu Ja’far<sup style=\"font-weight: normal\">asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\">[3:68] Most, surely the nearest of people to Ibrahim are those who followed him and this Prophet and those who believe</span>. He<sup style=\"font-weight: normal\">asws</sup> said: ‘They<sup style=\"font-weight: normal\">asws</sup> are the Imams<sup style=\"font-weight: normal\">asws</sup> and the ones who follow them<sup style=\"font-weight: normal\">asws</sup>’."
          ],
          "en.sarwar": [
            " 20. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from al-Washsha’ from Muthanna from ‘Abdallah ibn ‘Ajlan from abu Ja‘far (a.s.) the following. about the words of Allah, the Most High. “The nearest people to Abraham, among mankind, are those who followed him, this Prophet (Muhammad) and the true believers. . .” (3:68) The Imam (a.s.) said, “They are the Imams and those who follow them.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالسابق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (24/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1102,
        "local_index": 21,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:21",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَحْمَدَ بْنِ عَائِذٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ مَالِكٍ الْجُهَنِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَوْلُهُ عَزَّ وَ جَلَّ وَ أُوحِيَ إِلَيَّ هذَا الْقُرْآنُ لِأُنْذِرَكُمْ بِهِ وَ مَنْ بَلَغَ قَالَ مَنْ بَلَغَ أَنْ يَكُونَ إِمَاماً مِنْ آلِ مُحَمَّدٍ فَهُوَ يُنْذِرُ بِالْقُرْآنِ كَمَا أَنْذَرَ بِهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washha, from Ahmad Bin Aiz, from Ibn Azina, from malik Al Juhny who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘(What about) the Words of the Mighty and Majestic <span class=\"ibTxt\">[6:19] and this Quran has been Revealed to me that with it I may warn you, and whomsoever it reaches</span>?’ He<sup>asws</sup> said: ‘The one whom it reaches that he would become an Imam<sup>asws</sup> from the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, so he<sup>asws</sup> would warn by the Quran just as Rasool-Allah<sup>saww</sup> warned by it’."
          ],
          "en.sarwar": [
            " 21. Al-Husayn ibn Muhammad has narrated Mu‘alla ibn Muhammad `from al-Washsha’ from Ahmad ibn al-‘A’idh from ’Udhayna from Malik al-Juhanni who has said the following. “I asked abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most Gracious. “He has revealed this Quran to me to warn you and the coming generations (against disobeying God).. .” (6:19) The Imam (a.s.) said, “Whoever from the family of Muhammad (s.a.) would become an Imam he will warn people by means of the Holy Quran just as the the Messenger of Allah had done.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (25/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1103,
        "local_index": 22,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:22",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُفَضَّلِ بْنِ صَالِحٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ لَقَدْ عَهِدْنا إِلى آدَمَ مِنْ قَبْلُ فَنَسِيَ وَ لَمْ نَجِدْ لَهُ عَزْماً قَالَ عَهِدْنَا إِلَيْهِ فِي مُحَمَّدٍ وَ الْأَئِمَّةِ مِنْ بَعْدِهِ فَتَرَكَ وَ لَمْ يَكُنْ لَهُ عَزْمٌ أَنَّهُمْ هَكَذَا وَ إِنَّمَا سُمِّيَ أُولُو الْعَزْمِ أُوْلِي الْعَزْمِ لِأَنَّهُ عَهِدَ إِلَيْهِمْ فِي مُحَمَّدٍ وَ الْأَوْصِيَاءِ مِنْ بَعْدِهِ وَ الْمَهْدِيِّ وَ سِيرَتِهِ وَ أَجْمَعَ عَزْمُهُمْ عَلَى أَنَّ ذَلِكَ كَذَلِكَ وَ الْإِقْرَارِ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Mufazzal Bin Salih, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[20:115] And We had Given a Covenant to Adam before, but he forgot; and We did not find determination in him</span>. He<sup>asws</sup> said: ‘<span class=\"ibTxt\">And We had Given a Covenant to Adam</span> regarding Muhammad<sup>saww</sup> and the Imams<sup>asws</sup> from after him<sup>asws</sup> <span class=\"ibTxt\">but he neglected and We did not find determination in him</span>. <span style=\"text-decoration: underline\">It was like this</span>. And rather the determined ones (Ul Al-Azm) have been named as the determined ones because it was covenanted to them<sup>as</sup> regarding Muhammad<sup>saww</sup> and the successors<sup>as</sup> from after him<sup>saww</sup>, and Al-Mahdi<sup>as</sup> and his<sup>as</sup> way, and gathered their<sup>as</sup> determination upon that, that was like that, and the acknowledgment with it’."
          ],
          "en.sarwar": [
            " 22. A number of our people has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Mufaddal ibn Salih from Jabir from abu Jaffar(a.s.) about the words of Allah, the Most Majestic, the Most Gracious. “We had commanded Adam (certain matters). He forgot Our commandment and We did not find in him the determination to fulfil Our commandments.” (20:115). The Imam (a.s.) said, “It means that Allah commanded Adam about Muhammad (s.a.) and the Imams after him. He did not acknowledge it (Leadership with Divine Authority of the Imams) and he was not an ’Ulu al-‘Azm (a prophet who is granted greater determination. They arecalled ’Ulu al-‘Azm because with a covenant was established to acknowledge (Leadership with Divine Authority) of Muhammad (s.a.) and the executors of his will and al-Mahdi and his discipline. They establish their determination to acknowledge (Leadership with Divine Authority) of Muhammad and th executors of his will.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/26)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1104,
        "local_index": 23,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:23",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدِ بْنِ عُبَيْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ عِيسَى الْقُمِّيِّ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِهِ وَ لَقَدْ عَهِدْنا إِلى آدَمَ مِنْ قَبْلُ كَلِمَاتٍ فِي مُحَمَّدٍ وَ عَلِيٍّ وَ فَاطِمَةَ وَ الْحَسَنِ وَ الْحُسَيْنِ وَ الْأَئِمَّةِ ( عليهم السلام ) مِنْ ذُرِّيَّتِهِمْ فَنَسِيَ هَكَذَا وَ اللَّهِ نَزَلَتْ عَلَى مُحَمَّدٍ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ja’far Bin Muhammad Bin Ubeydullah, from Muhammad Bin Isa, Al Qummy, from Muhammad Bin Suleyman, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Adullah<sup>asws</sup> regarding His<sup>azwj</sup> Words <span class=\"ibTxt\">[20:115] And We had Given a Covenant to Adam before words regarding Muhammad</span><sup class=\"ibTxt\">saww</sup><span class=\"ibTxt\">, and Ali</span><sup class=\"ibTxt\">asws</sup><span class=\"ibTxt\">, and Fatima</span><sup class=\"ibTxt\">asws</sup><span class=\"ibTxt\">, and Al-Hassan</span><sup class=\"ibTxt\">asws</sup><span class=\"ibTxt\">, and Al-Husayn</span><sup class=\"ibTxt\">asws</sup><span class=\"ibTxt\">, and the Imams</span><sup class=\"ibTxt\">asws</sup><span class=\"ibTxt\"> from their</span><sup class=\"ibTxt\">as</sup><span class=\"ibTxt\"> offspring</span> – <span style=\"text-decoration: underline\">like this, by Allah</span><sup style=\"text-decoration: underline\">azwj</sup><span style=\"text-decoration: underline\">, it was Revealed unto Muhammad</span><sup style=\"text-decoration: underline\">saww</sup><span style=\"text-decoration: underline\">’</span>."
          ],
          "en.sarwar": [
            " 23. Al-Husayn ibn Muhammad has narrated Mu‘alla ibn Muhammad from Ja‘far ibn Muhammad ibn ‘Ubaydallah from Muhammad ibn ‘Isa al-Qummifm Muhammad ibn sulayman from ‘Abdallah ibn Sinan from abu ‘Abdallah (a.s.) about the words of Aallah. “We had commanded Adam (certain matters) before.(The commands consisted of certain words about Ali, Fatima,al-Hassan, al-Husayn and the Imams from their descendants) He forgot Our commandment) (20:115).This is how it was revealed, by Allah, about Muhammad and his family."
          ]
        }
      },
      {
        "index": 1105,
        "local_index": 24,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:24",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنِ النَّضْرِ بْنِ شُعَيْبٍ عَنْ خَالِدِ بْنِ مَادٍّ عَنْ مُحَمَّدِ بْنِ الْفَضْلِ عَنِ الثُّمَالِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ أَوْحَى اللَّهُ إِلَى نَبِيِّهِ ( صلى الله عليه وآله ) فَاسْتَمْسِكْ بِالَّذِي أُوحِيَ إِلَيْكَ إِنَّكَ عَلى صِراطٍ مُسْتَقِيمٍ قَالَ إِنَّكَ عَلَى وَلَايَةِ عَلِيٍّ وَ عَلِيٌّ هُوَ الصِّرَاطُ الْمُسْتَقِيمُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Al Nazar Bin Shuayb, from Khalid Bin Madd, from Muhammad Bin Al Fazal, from Al Sumaly, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Revealed unto His<sup>azwj</sup> Prophet<sup>saww</sup> <span class=\"ibTxt\">[43:43] Therefore attach yourselves to that which has been Revealed to you; surely you are on the Straight Path</span>. He<sup>asws</sup>: ‘You<sup>saww</sup> upon the Wilayah of Ali<sup>asws</sup>, he<sup>asws</sup> is the Straight Path’."
          ],
          "en.sarwar": [
            " 24. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Nadr ibn Shu‘ayb from Khalid ibn Ma’dd from Muhammad ibn al-Fudayl from al-Thumali from abu Ja‘far (a.s.) who has said the following. “Allah sent revelation to His prophet (s.a) in which He has said, “Follow devotedly that which is revealed to you. You are certainly on the right path.” (43:43) The Imam (a.s.) said, “It is just as saying, ‘You have acknowledged the Leadership with Divine Authority of Ali (a.s.) and Ali is on the right path.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (27/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1106,
        "local_index": 25,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:25",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَمَّارِ بْنِ مَرْوَانَ عَنْ مُنَخَّلٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ نَزَلَ جَبْرَئِيلُ ( عليه السلام ) بِهَذِهِ الْآيَةِ عَلَى مُحَمَّدٍ ( صلى الله عليه وآله ) هَكَذَا بِئْسَمَا اشْتَرَوْا بِهِ أَنْفُسَهُمْ أَنْ يَكْفُرُوا بِما أَنْزَلَ اللَّهُ فِي عَلِيٍّ بَغْياً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Ahmad Bin Muhammad Al Barqy, from his father, from Muhammad Bin Sinan, from Ammar Bin Marwan, from Munakhhal, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Jibraeel<sup>as</sup> descended with <span style=\"text-decoration: underline\">this Verse like thi</span>s <span class=\"ibTxt\">[2:90] Evil is that for which they have sold their souls - that they should deny what Allah has Revealed regarding Ali</span><sup class=\"ibTxt\">asws</sup><span class=\"ibTxt\">, in rebellion</span>’."
          ],
          "en.sarwar": [
            " 25. Ali ibn Ibrahim has narrated from Ahmad ibn Muhammad al-Barqi from his father Muhammad ibn Sinan from ‘Ammar ibn Marwan from Munakhkhal from Jabir from abu Ja‘far (a.s.) who has said the following. “Jibril brought this verse to Muhammad (s.a). “Evil is that for which they have sold their souls: They have refused to accept God’s revelations (about Leadership with Divine Authority of Ali (a.s.)) in rebellion. .” (2:90)”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالسابق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (28/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1107,
        "local_index": 26,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:26",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَمَّارِ بْنِ مَرْوَانَ عَنْ مُنَخَّلٍ عَنْ جَابِرٍ قَالَ نَزَلَ جَبْرَئِيلُ ( عليه السلام ) بِهَذِهِ الْآيَةِ عَلَى مُحَمَّدٍ هَكَذَا وَ إِنْ كُنْتُمْ فِي رَيْبٍ مِمَّا نَزَّلْنا عَلى عَبْدِنا فِي عَلِيٍّ فَأْتُوا بِسُورَةٍ مِنْ مِثْلِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Muhammad Bin Sinan, from Ammar Bin Marwan, from Munakhhal, from Jabir, ",
            "‘He<sup>asws</sup> said: ‘Jibraeel<sup>as</sup> descended with this Verse upon Muhammad<sup>saww</sup> <span style=\"text-decoration: underline\">like this </span><span class=\"ibTxt\">[2:23] And if you are in doubt as to that which We have Revealed to Our servant regarding Ali</span><sup class=\"ibTxt\">asws</sup> <span class=\"ibTxt\">then bring a Chapter like it</span>’."
          ],
          "en.sarwar": [
            " 26. Through the same chain of narrators it is narrated Muhammad ibn Sinan from ‘Ammar ibn Marwan from Munakhkhal from Jabir who has said the following. “Jibril this verse of the Holy Quran to Prophet Muhammad (s.a) as herein below. “Should you have any doubt about what We have revealed to Our servant, (about Leadership Ali (a.s). with Divine Authority) present one chapter comparable to it . .” (2:23)"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالسابق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (29/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1108,
        "local_index": 27,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:27",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَمَّارِ بْنِ مَرْوَانَ عَنْ مُنَخَّلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ نَزَلَ جَبْرَئِيلُ ( عليه السلام ) عَلَى مُحَمَّدٍ ( صلى الله عليه وآله ) بِهَذِهِ الْآيَةِ هَكَذَا يا أَيُّهَا الَّذِينَ أُوتُوا الْكِتابَ آمِنُوا بِما نَزَّلْنا فِي عَلِيٍّ نُوراً مُبِيناً ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Muhammad Bin Sinan, from Ammar Bin Marwan, from Munakhhal, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Jibraeel<sup>as</sup> descended unto Muhammad<sup>saww</sup> with <span style=\"text-decoration: underline\">this Verse like this </span><span class=\"ibTxt\">[4:47] O you who have been Given the Book! Believe that which We have Revealed regarding Ali</span><sup class=\"ibTxt\">asws</sup><span class=\"ibTxt\"> as a clear Light</span>’."
          ],
          "en.sarwar": [
            " 27. Through the same chain of narrators it is narrated Muhammad ibn Sinan from ‘Ammar ibn Marwan from Munakhkhal from abu ‘Abdallah (a.s.) who has said the following. “Jibril brought the following verse to Prophet Muhammad (s.a). “People of the Book, have faith in the what We have revealed (about Ali’s Leadership with Divine Authority). .” (4:47)"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (4/30)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1109,
        "local_index": 28,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:28",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ أَبِي طَالِبٍ عَنْ يُونُسَ بْنِ بَكَّارٍ عَنْ أَبِيهِ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) وَ لَوْ أَنَّهُمْ فَعَلُوا ما يُوعَظُونَ بِهِ فِي عَلِيٍّ لَكانَ خَيْراً لَهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Ahmad Bin Muhammad Bin Khalid, from his father, from Abu Talib, from Yunus Bin Bakr, from his father, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> <span class=\"ibTxt\">[4:66] and if they had done what they were Advised, it would have certainly been better for them</span>’."
          ],
          "en.sarwar": [
            " 28. Ali ibn Muhammad has narrated from Ahmad ibn Muhammad ibn Khalid from his father from abu Talib from Yunus ibn Bakkar from his father from Jabir from abu Ja‘far (a.s.) who has said the following. “If they had done what they had been advised to do (acknowledge Ali’s Leadership with Divine Authority), it would have been for their good and to strengthen their faith.” (4:66)"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/31)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1110,
        "local_index": 29,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:29",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ مُثَنًّى الْحَنَّاطِ عَنْ عَبْدِ اللَّهِ بْنِ عَجْلَانَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ يا أَيُّهَا الَّذِينَ آمَنُوا ادْخُلُوا فِي السِّلْمِ كَافَّةً وَ لا تَتَّبِعُوا خُطُواتِ الشَّيْطانِ إِنَّهُ لَكُمْ عَدُوٌّ مُبِينٌ قَالَ فِي وَلَايَتِنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Hassan Bin Ali Al Washha, from Musna Al Hannat, from Abdullah Bin Ajlan, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[2:208] O you who believe! Enter into the submission one and all and do not follow the footsteps of the Satan; he is your open enemy</span>. He<sup>asws</sup> said: ‘Regarding our<sup>asws</sup> Wilayah’."
          ],
          "en.sarwar": [
            " 29. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from al-Hassan ibn Ali al-Washsha’ from Muthanna al-Hannat from ‘Abdallah ibn ‘Ajlan from abu Ja‘far (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “Believers, submit yourselves to the will of God as a whole. Do not follow the footsteps of Satan; he is your sworn enemy. (2:208) The Imam (a.s.) said, “It means submit yourselves to our Leadership with Divine Authority.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (31/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1111,
        "local_index": 30,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:30",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الْمُفَضَّلِ بْنِ عُمَرَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَوْلُهُ جَلَّ وَ عَزَّ بَلْ تُؤْثِرُونَ الْحَياةَ الدُّنْيا قَالَ وَلَايَتَهُمْ وَ الْآخِرَةُ خَيْرٌ وَ أَبْقى قَالَ وَلَايَةُ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) إِنَّ هذا لَفِي الصُّحُفِ الْأُولى. صُحُفِ إِبْراهِيمَ وَ مُوسى ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Abdullah Bin Idrees, from Muhammad Bin Sinan, from Al Mufazzal Bin Umar who said, ",
            "‘I said to Abu Abdullah<sup style=\"font-weight: normal\">asws</sup>. (What about) the Words of the Majestic and Mighty <span class=\"ibTxt\">[87:16] Nay! you are preferring the life of the world</span>. He<sup style=\"font-weight: normal\">asws</sup> said: ‘Their Wilayah <span class=\"ibTxt\">[87:17] While the hereafter is better and more lasting</span>. He<sup style=\"font-weight: normal\">asws</sup> said: ‘Wilayah of Amir Al-Momineen<sup style=\"font-weight: normal\">asws</sup>. <span class=\"ibTxt\">[87:18] Most surely this is in the earlier scriptures, [87:19] The scriptures of Ibrahim and Musa</span>’."
          ],
          "en.sarwar": [
            " 30. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from ‘Abdallah ibn Idris from Muhammad ibn Sinan from al-Fudayl ibn ‘Umar who has said the following. “I asked abu ‘Abdallah (a.s.) about the meaning of the words of Allah, the Most Majestic, the Most gracious. “However, (the unbelievers) prefer the worldly life, (87:16) -The Imam (a.s.) said, “They have preferred their (evil doers) friendship-” even though the life hereafter will be better and will last forever –The Imam (a.s.)said, “It means the friendship of Amir al-Mu’minin (a.s.) - (87:17). This is what is written in the ancient heavenly Books,(87:18) the Scriptures of Abraham and Moses (87:19).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/31)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1112,
        "local_index": 31,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:31",
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ حَسَّانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عَمَّارِ بْنِ مَرْوَانَ عَنْ مُنَخَّلٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ أَ فَكُلَّما جاءَكُمْ مُحَمَّدٌ بِما لا تَهْوى أَنْفُسُكُمُ بِمُوَالَاةِ عَلِيٍّ فَ اسْتَكْبَرْتُمْ فَفَرِيقاً مِنْ آلِ مُحَمَّدٍ كَذَّبْتُمْ وَ فَرِيقاً تَقْتُلُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Hassan, from Muhammad Bin Ali, from Ammar Bin Marwan, from Munakhhal, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘<span class=\"ibTxt\">[2:87] What! Whenever Muhammad</span><sup class=\"ibTxt\">s</sup><sup class=\"ibTxt\">aww</sup> <span class=\"ibTxt\">came to you with that which your souls did not desire regarding Wilyaah of Ali</span><sup class=\"ibTxt\">asws</sup> <span class=\"ibTxt\">you were arrogant so you belied a group from the Progeny of Muhammad</span><sup class=\"ibTxt\">s</sup><sup class=\"ibTxt\">aww</sup><span class=\"ibTxt\">, and a group you slew?</span>’."
          ],
          "en.sarwar": [
            " 31. Ahmad ibn Idris has narrated from Muhammad ibn Hassa’n from Muhammad ibn Ali from ‘Ammar ibn Marwan from Munakhkhal from Jabir from abu Ja‘far (a.s.) who has said the following about the words of Allah. “Why do you arrogantly belie some of them (family of Muhammad (s.a) and murder others whenever he (Muhammad (s.a) would bring you messages (Imam Ali’s Leadership with Divine Authority) which you dislike? (2:87).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/32)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1113,
        "local_index": 32,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:32",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الرِّضَا ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ كَبُرَ عَلَى الْمُشْرِكِينَ بِوَلَايَةِ عَلِيٍّ ما تَدْعُوهُمْ إِلَيْهِ يَا مُحَمَّدُ مِنْ وَلَايَةِ عَلِيٍّ هَكَذَا فِي الْكِتَابِ مَخْطُوطَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Abdullah Bin Idrees, from Muhammad Bin Sinan, ",
            "(It has been narrated) from Al-Reza<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[42:13] hard to the Polytheists is that which you call them to O Muhammad</span><sup class=\"ibTxt\">s</sup><sup class=\"ibTxt\">aww</sup><span class=\"ibTxt\">, of the Wilayah of Ali</span><sup class=\"ibTxt\">asws</sup>– <span style=\"text-decoration: underline\">like this it is in the written Book</span>’."
          ],
          "en.sarwar": [
            " 32. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Ahmad ibn Muhammad from ibn Hilal from his father from abu al-Safatij from abu Basir from abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “God who guided us to this, deserves all praise. Had He not guided us, we would never have been able to find the right direction.. .” (7:43) The Imam (a.s.) said, “On the Day of Judgment The Holy Prophet (s.a), Amir al-Mu’minin (a.s.) and the Imams from his descendants will be brought in public sight. When their followers will see them they will say, “God who guided us to this, deserves all praise. Had He not guided us, we would never have been able to find the right direction. He guided us to acknowledge Imam Ali’s Leadership with Divine Authority and the Imams from his descendants).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/33)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1114,
        "local_index": 33,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:33",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ هِلَالٍ عَنْ أَبِيهِ عَنْ أَبِي السَّفَاتِجِ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ جَلَّ وَ عَزَّ الْحَمْدُ لِلَّهِ الَّذِي هَدانا لِهذا وَ ما كُنَّا لِنَهْتَدِيَ لَوْ لا أَنْ هَدانَا اللَّهُ فَقَالَ إِذَا كَانَ يَوْمُ الْقِيَامَةِ دُعِيَ بِالنَّبِيِّ ( صلى الله عليه وآله ) وَ بِأَمِيرِ الْمُؤْمِنِينَ وَ بِالْأَئِمَّةِ مِنْ وُلْدِهِ ( عليهم السلام ) فَيُنْصَبُونَ لِلنَّاسِ فَإِذَا رَأَتْهُمْ شِيعَتُهُمْ قَالُوا الْحَمْدُ لِلَّهِ الَّذِي هَدَانَا لِهَذَا وَ مَا كُنَّا لِنَهْتَدِيَ لَوْ لَا أَنْ هَدَانَا اللَّهُ يَعْنِي هَدَانَا اللَّهُ فِي وَلَايَةِ أَمِيرِ الْمُؤْمِنِينَ وَ الْأَئِمَّةِ مِنْ وُلْدِهِ ( عليهم السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ahmad Bin Muhammad, from Ibn Hilal, from his father, from Abu Al Saffatij, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Majestic and Mighty <span class=\"ibTxt\">[7:43] All Praise is due to Allah Who Guided us to this, and we would not have found the Way had it not been that Allah had Guided us</span>. So he<sup>asws</sup> said: ‘When it will be the Day of Judgment. They would call the Prophet<sup>saww</sup>, and Amir Al-Momineen<sup>asws</sup> and the Imams<sup>asws</sup> from his<sup>asws</sup> sons<sup>asws</sup>, so they<sup>asws</sup> would be established for the people. So when their<sup>as</sup> Shias see them<sup>asws</sup>, they would be saying <span class=\"ibTxt\">[7:43] All Praise is due to Allah Who Guided us to this, and we would not have found the Way had it not been that Allah had Guided us </span>- meaning Allah<sup>azwj</sup> Guided us regarding the Wilayah of Amir Al-Momineen<sup>asws</sup> and the Imams<sup>asws</sup> from his<sup>asws</sup> sons<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 33. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn ’Urama and Muhammad ibn ‘Abdallah from Ali ibn Hassa’nfm ‘Abdallah ibn Kathir from abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “What do they quarrel about? (78:1). They quarrel about the great news.” (78:2) The Imam (a.s.) said, “The great news here stands for Leadership with Divine Authority.” I asked him about the meaning of, “. . in such helplessness, the human being realizes that it is God who is the true Guardian . .” (18:44) The Imam (a.s.) said, “It refers to the guardianship and Leadership with Divine Authority of Amir al-Mu’minin (a.s.)).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالسابق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/33)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1115,
        "local_index": 34,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:34",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أُورَمَةَ وَ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى عَمَّ يَتَساءَلُونَ عَنِ النَّبَإِ الْعَظِيمِ قَالَ النَّبَأُ الْعَظِيمُ الْوَلَايَةُ ",
          "وَ سَأَلْتُهُ عَنْ قَوْلِهِ هُنالِكَ الْوَلايَةُ لِلَّهِ الْحَقِّ قَالَ وَلَايَةُ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Awrama and Muhammad Bin Abdullah, from Ali Bin Hassan, from Abdullah Bin Kaseer,",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\">[78:1] What are they asking about? [78:2] About the Great News</span>. He<sup>asws</sup> said: ‘The Great News is the Wilayah’.",
            "And I asked him<sup style=\"font-weight: normal\">asws</sup> about His<sup style=\"font-weight: normal\">azwj</sup> Words <span class=\"ibTxt\">[18:44] Over here the Wilayah is for Allah, the Truth </span>. He<sup style=\"font-weight: normal\">asws</sup> said: 'Wilayah of Amir Al-Momineen<sup style=\"font-weight: normal\">asws</sup>’."
          ],
          "en.sarwar": [
            " 34. Ali ibn Ibrahim has narrated from Salih ibn al-Sindi from Ja‘far ibn Bashir from Ali ibn abu Hamza from abu Basir from abu Ja‘far (a.s.) about the words of Allah, the Most High. “(Muhammad), be devoted to the upright religion. It is harmonious with the nature which God has designed for people.. .” (30:30 The Imam (a.s.) said, “It is Leadership with Divine Authority).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/36)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1116,
        "local_index": 35,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:35",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى فَأَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفاً قَالَ هِيَ الْوَلَايَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Salih Bin Al Sindy, from Ja’far Bin Bashir, from Ali Bin Abu Hamza, from Abu Baseer, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\">[30:30] Then set your face for the upright Religion</span>. He<sup>asws</sup> said: ‘It is the Wilayah’."
          ],
          "en.sarwar": [
            " 35. A number of our people has narrated Ahmad ibn Muhammad from Ibrahim al-Hamadani in a marfu‘ manner from abu ‘Abdallah (a.s.) about the words of Allah, the Most High. “We shall set up the balance to maintain proper justice on the Day of Judgment. . .” (21:47) The Imam (a.s.) said, “Balances are the prophets and the executors of their wills.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/36)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1117,
        "local_index": 36,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:36",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ إِبْرَاهِيمَ الْهَمَذَانِيِّ يَرْفَعُهُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى وَ نَضَعُ الْمَوازِينَ الْقِسْطَ لِيَوْمِ الْقِيامَةِ قَالَ الْأَنْبِيَاءُ وَ الْأَوْصِيَاءُ ( عليهم السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibrahim Al Hamdany, ",
            "(It has been narrated) raising it to Abu Abdullah<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\">[21:47] And We will Set up an Equitable Scale on the Day of Judgement</span>. He<sup>asws</sup> said: ‘The Prophets<sup>as</sup> and the successors<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 36. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Ahmad ibn al-Husayn ibn ‘Umar ibn Yazid from Muhammad ibn Jumhur from Muhammad ibn Sinan from al-Mufaddal ibn ‘Umar who has said the following. “I asked abu ‘Abdallah (a.s.) about the words of Allah, the Most High. “. . those who do not wish to meet Us in the life hereafter, say, “Bring us another book besides this one or change it.. .” (10:15) The Imam (a.s.) said, “They said, ‘Change Ali (a.s.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (39/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1118,
        "local_index": 37,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:37",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ الْحُسَيْنِ بْنِ عُمَرَ بْنِ يَزِيدَ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الْمُفَضَّلِ بْنِ عُمَرَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ تَعَالَى ائْتِ بِقُرْآنٍ غَيْرِ هذا أَوْ بَدِّلْهُ قَالَ قَالُوا أَوْ بَدِّلْ عَلِيّاً ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Ahmad Bin Al Husayn Bin Umar Bin Yazeed, from Muhammad Bin Jamhour, from Muhammad Bin Sinan, from Al Mufazzal Bin Umar who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> the Exalted <span class=\"ibTxt\">[10:15] Bring a Quran other than this or change it. Say: It does not beseem me that I should change it from myself</span>. He<sup>asws</sup> said: ‘They said, ‘Change Ali<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 37. Ali ibn Muhammad from Sahl ibn Ziyad from ’Isma‘il ibn Mihran from al-Hassan al-Qummi from Idris ibn ‘Abdallah who has said the following. “I asked abu ‘Abdallah (a.s.) about the interpretation of this verse of the Holy Quran. “They will reply, “We did not pray,” (74:43). The Imam (a.s.)said, “Such people will be those who did believe in the Imams about whom Allah, the Most Holy, the Most High, has saaid, “ (The foremost ones) will be the nearest ones to God” (56:11) Have not noticed that people call the one second to the lead in horse racing ‘al-Musalli’ (the praying)? This is what is meant therein. “We did not pray’ means ‘we did not follow the lead’.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/40)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1119,
        "local_index": 38,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:38",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنِ الْحَسَنِ الْقُمِّيِّ عَنْ إِدْرِيسَ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ تَفْسِيرِ هَذِهِ الْآيَةِ ما سَلَكَكُمْ فِي سَقَرَ. قالُوا لَمْ نَكُ مِنَ الْمُصَلِّينَ قَالَ عَنَى بِهَا لَمْ نَكُ مِنْ أَتْبَاعِ الْأَئِمَّةِ الَّذِينَ قَالَ اللَّهُ تَبَارَكَ وَ تَعَالَى فِيهِمْ وَ السَّابِقُونَ السَّابِقُونَ. أُولئِكَ الْمُقَرَّبُونَ أَ مَا تَرَى النَّاسَ يُسَمُّونَ الَّذِي يَلِي السَّابِقَ فِي الْحَلْبَةِ مُصَلِّي فَذَلِكَ الَّذِي عَنَى حَيْثُ قَالَ لَمْ نَكُ مِنَ الْمُصَلِّينَ لَمْ نَكُ مِنْ أَتْبَاعِ السَّابِقِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Ismail Bin Mihran, from Al Hassan Al Qummy, from Idrees Bin Abdullah, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the interpretation of this Verse <span class=\"ibTxt\">[74:42] What has brought you into Hell? [74:43] They shall say: We were not of those who Prayed (Musalleen)</span>. He<sup>asws</sup> said: ‘It Means by it, ‘We were not the ones who followed the Imams<sup>asws</sup>, those for whom Allah<sup>azwj</sup> Blessed and High Said regarding them <span class=\"ibTxt\">[56:10] And the foremost are the foremost [56:11] These are the ones of proximity</span>. Have you not seen the people naming the one who follows the preceding one in the race as ‘Musally’? So that is what they mean when they would be saying, ‘We were not of the ‘<span class=\"iTxt\">Musalleen</span>’, i.e., we were not the ones who followed the foremost’."
          ],
          "en.sarwar": [
            " 38. Ahmad ibn Mihran has narrated from ‘‘Abd al-‘Azim ibn ‘Abdallah al-Hassani from Musa ibn Muhammad from Yunus ibn ya‘qub from the one he mentioned from abu Ja‘far (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “Had they (jinn and mankind) remained steadfast in their religion (Islam), We would certainly have given them abundant water to drink” (72:16) The Imam (a.s.) said, “It means that Allah would quench their heart with faith. Religion is a reference to Leadership of Ali ibn abu Talib (a.s.) and the executor of his will with Divine Authority.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/43)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1120,
        "local_index": 39,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:39",
        "text": [
          "أَحْمَدُ بْنُ مِهْرَانَ عَنْ عَبْدِ الْعَظِيمِ بْنِ عَبْدِ اللَّهِ الْحَسَنِيِّ عَنْ مُوسَى بْنِ مُحَمَّدٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَمَّنْ ذَكَرَهُ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ أَنْ لَوِ اسْتَقامُوا عَلَى الطَّرِيقَةِ لَأَسْقَيْناهُمْ ماءً غَدَقاً يَقُولُ لَأَشْرَبْنَا قُلُوبَهُمُ الْإِيمَانَ وَ الطَّرِيقَةُ هِيَ وَلَايَةُ عَلِيِّ بْنِ أَبِي طَالِبٍ وَ الْأَوْصِيَاءِ ( عليهم السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Abdul Azeem Bin Abdullah Al Hasany, from Musa Bin Muhammad, from Yunus Bin Yaqoub, from the one who mentioned, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[72:16] And that if they should keep to the (right) way, We would certainly give them to drink of abundant water</span>. He<sup>azwj</sup> is Saying: ‘We would give their hearts to drink the <span class=\"iTxt\">Eman</span>’, and the <span class=\"iTxt\">Tareeqa</span> (right way), it is Wilayah of Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> and the successors<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 39. Al-Husayn ibn Muhammad from Mu‘alla ibn Muhammad from Muhammad ibn Jumhur from al-Fudala ibn Ayyaub from al-Husayn ibn ‘Uthman from abu Ayyub from Muhammad ibn Muslim who has said the following. “I asked abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “To those who have said, “God is our Lord, “ and who have remained steadfast to their belief,. .” (41:30) The Imam (a.s.) said, “It refers to those who remained steadfast in their belief of Leadership with Divine Authority of the Imams one after the other,” “ the angels will descend saying, “Do not be afraid or grieved. Receive the glad news of the Paradise which was promised to you. (41:30)”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالسابق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (44/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1121,
        "local_index": 40,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:40",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنِ الْحُسَيْنِ بْنِ عُثْمَانَ عَنْ أَبِي أَيُّوبَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ الَّذِينَ قالُوا رَبُّنَا اللَّهُ ثُمَّ اسْتَقامُوا فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) اسْتَقَامُوا عَلَى الْأَئِمَّةِ وَاحِداً بَعْدَ وَاحِدٍ تَتَنَزَّلُ عَلَيْهِمُ الْمَلائِكَةُ أَلَّا تَخافُوا وَ لا تَحْزَنُوا وَ أَبْشِرُوا بِالْجَنَّةِ الَّتِي كُنْتُمْ تُوعَدُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Jamhour, from Fazalat Bin Ayoub, from Al Husayn Bin Usman, from Abu Ayoub, from Muhammad Bin Muslim who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[41:30] (As for) those who say: Our Lord is Allah, then are steadfast</span>. So Abu Abdullah<sup>asws</sup> said: ‘Being steadfast upon the Imams<sup>asws</sup>, one after one <span class=\"ibTxt\">the Angels descend upon them, saying: Fear not, nor be grieved, and receive good news of the Paradise which you were Promised</span>’."
          ],
          "en.sarwar": [
            " 40. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from al-Washsha’ from Muhammad ibn Fudayl from abu Hamza who has said the following. “I asked abu Ja‘far (a.s.) about the words of Allah, the Most High. “Say, ‘I advise you to believe only in One God . .” (34:46) The Imam (a.s.) said that Allah has said, “I advise you to acknowledge Imam Ali’s Leadership with Divine Authority. It is the one that Allah, the Most Holy, the Most High, has called, “‘I advise you to believe only in One.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (44/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1122,
        "local_index": 41,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:41",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ تَعَالَى قُلْ إِنَّما أَعِظُكُمْ بِواحِدَةٍ فَقَالَ إِنَّمَا أَعِظُكُمْ بِوَلَايَةِ عَلِيٍّ ( عليه السلام ) هِيَ الْوَاحِدَةُ الَّتِي قَالَ اللَّهُ تَبَارَكَ وَ تَعَالَى إِنَّما أَعِظُكُمْ بِواحِدَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washha, from Muhammad Bin Al Fuzayl, from Abu Hamza who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the Words of Allah<sup>azwj</sup> the Exalted <span class=\"ibTxt\">[34:46] Say: But rather, I exhort you to one thing</span>. So he<sup>asws</sup> said: ‘But rather, I<sup>saww</sup> exhort you all with the Wilayah of Ali<sup>asws</sup>, it is the ‘one thing’ which Allah<sup>azwj</sup> Blessed and High Spoke of <span class=\"ibTxt\">[34:46] But rather, I exhort you to one thing</span>’."
          ],
          "en.sarwar": [
            " 41. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn ’Urama and Ali ibn ‘Abdallah from Ali ibn Hassa’n from ‘Abd al-Rahman ibn Kathir from abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “God will not forgive or guide to the right path those who first believe, then disbelieve, again believe and disbelieve, and then increase their disbelief.” (4:137) The Imam (a.s.) said, “It was revealed about so and so and so and so who believed in the Holy Prophet (s.a) in the beginning. They turned to disbelief when Leadership with Divine Authority of Ali was made know to them when the Holy Prophet (s.a) said, “Over whoever, I have Divine authority Ali also has Divine authority. When the Messenger of Allah passed away they turned to disbelief. They did not remain steadfast in their oath of allegiance. They increased in their disbelief through making people to pledge allegiance to them. They left nothing of the faith that once they had.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (46/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1123,
        "local_index": 42,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:42",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أُورَمَةَ وَ عَلِيِّ بْنِ عَبْدِ اللَّهِ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّ الَّذِينَ آمَنُوا ثُمَّ كَفَرُوا ثُمَّ آمَنُوا ثُمَّ كَفَرُوا ثُمَّ ازْدادُوا كُفْراً لَنْ تُقْبَلَ تَوْبَتُهُمْ قَالَ نَزَلَتْ فِي فُلَانٍ وَ فُلَانٍ وَ فُلَانٍ آمَنُوا بِالنَّبِيِّ ( صلى الله عليه وآله ) فِي أَوَّلِ الْأَمْرِ وَ كَفَرُوا حَيْثُ عُرِضَتْ عَلَيْهِمُ الْوَلَايَةُ حِينَ قَالَ النَّبِيُّ ( صلى الله عليه وآله ) مَنْ كُنْتُ مَوْلَاهُ فَهَذَا عَلِيٌّ مَوْلَاهُ ",
          "ثُمَّ آمَنُوا بِالْبَيْعَةِ لِأَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) ثُمَّ كَفَرُوا حَيْثُ مَضَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَلَمْ يَقِرُّوا بِالْبَيْعَةِ ثُمَّ ازْدَادُوا كُفْراً بِأَخْذِهِمْ مَنْ بَايَعَهُ بِالْبَيْعَةِ لَهُمْ فَهَؤُلَاءِ لَمْ يَبْقَ فِيهِمْ مِنَ الْإِيمَانِ شَيْ‏ءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Awrama and Ali Bi Abdullah, from Ali Bin Hassan, from Abdul Rahman Bin Kaseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[4:137] Surely (as for) those who believe then disbelieve, again believe and again disbelieve, then increased in disbelief, Allah will never Forgive them</span>. He<sup>asws</sup> said: ‘It was Revealed regarding so and so, and so and so. They believed in the Prophet<sup>saww</sup> regarding the first matter but they disbelieve when he<sup>saww</sup> presented to them the Wilayah, when the Prophet<sup>saww</sup> said: ‘The one whose Master I<sup>saww</sup> was, so this Ali<sup>asws</sup> is his Master’.",
            "Then they believed in the allegiance to Amir Al-Momineen<sup>asws</sup>, then they disbelieved when Rasool-Allah<sup>saww</sup> passed away, so they did not acknowledge with the allegiance. Then the disbelief increased by their seizing the ones who pledged allegiance to him<sup>asws</sup>, by the pledging of the allegiance for them. Thus, they are such that there did not remain in them anything from the <span class=\"iTxt\">Eman</span>’."
          ],
          "en.sarwar": [
            " 42. Through the same chain of narrators it is narrated from abu ‘Abdallah (a.s.) about the words of Allah, the Most High. “Those who have reverted to disbelief after guidance has become manifest to them, .” .(47:25) The Imam (a.s.) said, “They are so and so and so and so who reverted from the faith in rejecting Leadership with Divine Authority of Ali (a.s.).” I then asked about the words of Allah, the Most High. “This is because they have said to those who hate God’s revelation, “We shall obey you in some matters.” . .” (47:26) The Imam (a.s.) said, ‘By Allah, it was revealed about the two of them and their followers and that is the words of Allah, the Most Majestic, the Most gracious, that Jibril brought to Muhammad (s.a) , “This is because they have said to those who hate God’s revelation, -about Leadership with Divine Authority of Ali (a.s.)- “We shall obey you in some matters. .” (47:26) The Imam (a.s.) said, “They made an agreement with the Amawids not to allow the leadership come to us after The Holy Prophet (s.a) not to pay us the one fifth taxes saying, “We have given them already so their is no need to give them more. The transfer of leadership to them did not matter to them at all. They said, “We obey in certain matters that you want us to obey, such as the one fifth taxes. We will not pay it to them. His words that read, “who hate God’s revelation,” refers to Amir al-Mu’minin (a.s.) Leadership with Divine Authority over the creatures. With them was abu ‘Ubayda, their scribe. Allah has said, “If the unbelievers persist in their disbelief, We shall also persist in punishing them (43:79). Do they think that We do not hear their secrets and whispers? We certainly can hear them and Our Messengers record it all (43:80).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالسابق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (48/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1124,
        "local_index": 43,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:43",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ تَعَالَى إِنَّ الَّذِينَ ارْتَدُّوا عَلى أَدْبارِهِمْ مِنْ بَعْدِ ما تَبَيَّنَ لَهُمُ الْهُدَى فُلَانٌ وَ فُلَانٌ وَ فُلَانٌ ارْتَدُّوا عَنِ الْإِيمَانِ فِي تَرْكِ وَلَايَةِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )",
          "قُلْتُ قَوْلُهُ تَعَالَى ذلِكَ بِأَنَّهُمْ قالُوا لِلَّذِينَ كَرِهُوا ما نَزَّلَ اللَّهُ سَنُطِيعُكُمْ فِي بَعْضِ الْأَمْرِ قَالَ نَزَلَتْ وَ اللَّهِ فِيهِمَا وَ فِي أَتْبَاعِهِمَا وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ الَّذِي نَزَلَ بِهِ جَبْرَئِيلُ ( عليه السلام ) عَلَى مُحَمَّدٍ ( صلى الله عليه وآله ) ذلِكَ بِأَنَّهُمْ قالُوا لِلَّذِينَ كَرِهُوا ما نَزَّلَ اللَّهُ فِي عَلِيٍّ ( عليه السلام ) سَنُطِيعُكُمْ فِي بَعْضِ الْأَمْرِ",
          "قَالَ دَعَوْا بَنِي أُمَيَّةَ إِلَى مِيثَاقِهِمْ أَلَّا يُصَيِّرُوا الْأَمْرَ فِينَا بَعْدَ النَّبِيِّ ( صلى الله عليه وآله ) وَ لَا يُعْطُونَا مِنَ الْخُمُسِ شَيْئاً وَ قَالُوا إِنْ أَعْطَيْنَاهُمْ إِيَّاهُ لَمْ يَحْتَاجُوا إِلَى شَيْ‏ءٍ وَ لَمْ يُبَالُوا أَنْ يَكُونَ الْأَمْرُ فِيهِمْ فَقَالُوا سَنُطِيعُكُمْ فِي بَعْضِ الْأَمْرِ الَّذِي دَعَوْتُمُونَا إِلَيْهِ وَ هُوَ الْخُمُسُ أَلَّا نُعْطِيَهُمْ مِنْهُ شَيْئاً ",
          "وَ قَوْلُهُ كَرِهُوا ما نَزَّلَ اللَّهُ وَ الَّذِي نَزَّلَ اللَّهُ مَا افْتَرَضَ عَلَى خَلْقِهِ مِنْ وَلَايَةِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) وَ كَانَ مَعَهُمْ أَبُو عُبَيْدَةَ وَ كَانَ كَاتِبَهُمْ فَأَنْزَلَ اللَّهُ أَمْ أَبْرَمُوا أَمْراً فَإِنَّا مُبْرِمُونَ أَمْ يَحْسَبُونَ أَنَّا لا نَسْمَعُ سِرَّهُمْ وَ نَجْواهُمْ الْآيَةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\">[47:25] Surely (as for) those who turn back on their backs after that Guidance has become manifest to them</span>: ‘So and so, and so and so, and so and so reneged from the <span class=\"iTxt\">Eman</span> regarding the neglect of the Wilayah of Amir Al-Momineen<sup>asws</sup>’. ",
            "I said, ‘(What about) the Words of the Exalted <span class=\"ibTxt\">[47:26] That is because they say to those who hate what Allah has Revealed: We will obey you in some of the affairs</span>?’ He<sup>asws</sup> said: ‘It was Revealed, by Allah<sup>azwj</sup>, regarding the two of them, and regarding their follower, and these are the Words of Allah<sup>azwj</sup> Mighty and Majestic which Jibraeel<sup>as</sup> descended with unto Muhammad<sup>saww</sup> <span class=\"ibTxt\">[47:26] That is because they say to those who hate what Allah has Revealed</span> regarding Ali<sup>asws</sup> <span class=\"ibTxt\">We will obey you in some of the affairs</span>’. ",
            "He<sup>asws</sup> said: ‘The Clan of Umayya called to their covenant that the command will not come to be among us<sup>asws</sup> after the Prophet<sup>saww</sup> nor should we<sup>asws</sup> be given anything from the fifth (<span class=\"iTxt\">Khums</span>), and they said, ‘If we were to give it to them<sup>asws</sup>, they would not be needy to anything and they<sup>asws</sup> would not care if the command happens to be among them<sup>asws</sup>’. So they said, ‘We shall obey you in some of the matters which you are calling us to, and it is the Khums, we shall not give them<sup>asws</sup> anything from it’. ",
            "And His<sup style=\"font-weight: normal\">azwj</sup> Words <span class=\"ibTxt\">[47:26] hate what Allah has Revealed</span> is what Allah<sup style=\"font-weight: normal\">azwj</sup> Revealed and which Allah<sup style=\"font-weight: normal\">azwj</sup> Revealed what Necessitated upon His<sup style=\"font-weight: normal\">azwj</sup> creatures from the Wilayah of Amir Al Momineen<sup style=\"font-weight: normal\">asws</sup>, and it was so that with them was Ubeyda, and he was their scribe, so Allah<sup style=\"font-weight: normal\">azwj</sup> Revealed <span class=\"ibTxt\">[43:79] Or have they settled an affair? So We are the Settlers. [43:80] Or do they think that We do not Hear what they conceal and their secret discourses?</span> – the Verse’."
          ],
          "en.sarwar": [
            " 43. Through the same chain of narrators it is narrated from abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “and those who commit evil and injustice therein.”. (22:25) The Imam (a.s.) said, “It was revealed about them as they entered the ka‘ba and made an agreement and commitment to continue in disbelief and denial of the Divine revelation about Amir al-Mu’minin Ali (a.s.). They, thus, committed evil and injustice towards the Messenger of Allah about the executor of his will. May Allah do away with the unjust people.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالسابق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (51/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1125,
        "local_index": 44,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:44",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ يُرِدْ فِيهِ بِإِلْحادٍ بِظُلْمٍ قَالَ نَزَلَتْ فِيهِمْ حَيْثُ دَخَلُوا الْكَعْبَةَ فَتَعَاهَدُوا وَ تَعَاقَدُوا عَلَى كُفْرِهِمْ وَ جُحُودِهِمْ بِمَا نُزِّلَ فِي أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَأَلْحَدُوا فِي الْبَيْتِ بِظُلْمِهِمُ الرَّسُولَ وَ وَلِيَّهُ فَبُعْداً لِلْقَوْمِ الظَّالِمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[22:25] and whoever shall incline therein to wrong unjustly</span>. He<sup>asws</sup> said: ‘It was regarding them when they entered the Kabah, so they made a pact and agreed upon their disbelief and their rejection with what was Revealed regarding Amir Al-Momineen<sup>asws</sup>, so they inclined to the wrong in the House (Kabah) being unjust to the Rasool<sup>saww</sup> and his<sup>saww</sup> successor<sup>as</sup> <span class=\"ibTxt\">[23:41] so away with the unjust people</span>’."
          ],
          "en.sarwar": [
            " 44. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Ali ibn Asbat from Ali ibn abu Hamza from abu Basir from abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most Gracious. “You will soon know who is in manifest error” (67:29) This verse is addressed to those who refuse to acknowledge the Imam Ali’s Leadership with Divine Authority and the Imams after him that they are ‘in manifest error.’ Similarly they are addressed in this verse, “If you deviate from the truth in your testimony, or decline to give your testimony at all, know that God is Well Aware of what you do.” (4:135) the truth referred to is (Leadership with Divine Authority of the Imams (a.s.) They are also in the words of Allah. “We shall certainly make the unbelievers (in (Leadership with Divine Authority of Imam Ali (a.s.) suffer severe torment (in this world) and will punish them far worse than what they deserve for their deeds.” (41:27).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (57/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1126,
        "local_index": 45,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:45",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَسَتَعْلَمُونَ مَنْ هُوَ فِي ضَلالٍ مُبِينٍ يَا مَعْشَرَ الْمُكَذِّبِينَ حَيْثُ أَنْبَأْتُكُمْ رِسَالَةَ رَبِّي فِي وَلَايَةِ عَلِيٍّ ( عليه السلام ) وَ الْأَئِمَّةِ ( عليهم السلام ) مِنْ بَعْدِهِ مَنْ هُوَ فِي ضَلَالٍ مُبِينٍ كَذَا أُنْزِلَتْ",
          "وَ فِي قَوْلِهِ تَعَالَى إِنْ تَلْوُوا أَوْ تُعْرِضُوا فَقَالَ إِنْ تَلْوُوا الْأَمْرَ وَ تُعْرِضُوا عَمَّا أُمِرْتُمْ بِهِ فَإِنَّ اللَّهَ كانَ بِما تَعْمَلُونَ خَبِيراً ",
          "وَ فِي قَوْلِهِ فَلَنُذِيقَنَّ الَّذِينَ كَفَرُوا بِتَرْكِهِمْ وَلَايَةَ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) عَذاباً شَدِيداً فِي الدُّنْيَا وَ لَنَجْزِيَنَّهُمْ أَسْوَأَ الَّذِي كانُوا يَعْمَلُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ali Bin Asbat, from Ali Bin Abu Hamza, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[67:29] so you shall come to know who it is that is in clear error</span>. <span class=\"ibTxt\">O group of beliers when I</span><sup class=\"ibTxt\">saww</sup><span class=\"ibTxt\"> gave you the news of the Message of my</span><sup class=\"ibTxt\">saww</sup><span class=\"ibTxt\"> Lord</span><sup class=\"ibTxt\">azwj</sup><span class=\"ibTxt\"> regarding the Wilayah of Ali</span><sup class=\"ibTxt\">asws</sup><span class=\"ibTxt\"> and of the Imams</span><sup class=\"ibTxt\">asws</sup><span class=\"ibTxt\"> from after him</span><sup class=\"ibTxt\">asws</sup> <span class=\"ibTxt\">[67:29] so you shall come to know who it is that is in clear error</span>. <span style=\"text-decoration: underline\">Such is how it was Revealed</span>’.",
            "And regarding the Words of the Exalted <span class=\"ibTxt\">[4:135] and if you turn back or turn aside</span>, he<sup>asws</sup> said: ‘If you turn back the matter and turn aside from what you have been Commanded with, <span class=\"ibTxt\">then surely Allah is Aware of what you do</span>’.",
            "And regarding His<sup>azwj</sup> Words <span class=\"ibTxt\">[41:27] Therefore We will most certainly make those who disbelieve </span>by their neglecting the Wilayah of Amir Al-Momineen <span class=\"ibTxt\">Taste a severe Punishment, and We will most certainly Recompense them for the evil deeds they used to do</span>’."
          ],
          "en.sarwar": [
            " 45. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Ali ibn Asbat from Ali ibn Mansur from Ibrahimibn ‘Abd al-Hamid from al-Walid ibn Sabih from abu ‘Abdallah (a.s.) about the words of Allah. “. .Your suffering is only because you disbelieved when One God (and the people who possess Leadership with Divine Authority were) was mentioned. .” (40:12)”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/59)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1127,
        "local_index": 46,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:46",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ عَلِيِّ بْنِ مَنْصُورٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنِ الْوَلِيدِ بْنِ صَبِيحٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) ذلِكُمْ بِأَنَّهُ إِذا دُعِيَ اللَّهُ وَحْدَهُ وَ أَهْلُ الْوَلَايَةِ كَفَرْتُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ali Bin Asbat, from Ali Bin Mansour, from Ibrahim Bin Abdul Hameed, from Al Waleed Bin Sabeeh, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> <span class=\"ibTxt\">[40:12] That is because when you were called to Allah alone, and the people of Al-Wilayah, you disbelieved</span>’."
          ],
          "en.sarwar": [
            " 46. Ali ibn Ibrahim has narrated from Ahmad ibn Muhammad from Muhammad ibn Khalid from Muhammad ibn sulayman from his father from abu Basir from abu ‘Abdallah (a.s.) about the words of Allah, the Most High. “Someone has (needlessly) demanded to experience the torment (of God), (70:1) which will inevitably seize the unbelievers (in Imam Ali’s Leadership with Divine Authority).” (70:2) The Imam (a.s.) then said, “This, by Aallah, how Jibril brought to The Holy Prophet (s.a.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (60/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1128,
        "local_index": 47,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:47",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ أَبِيهِ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ تَعَالَى سَأَلَ سائِلٌ بِعَذابٍ واقِعٍ. لِلْكافِرينَ بِوَلَايَةِ عَلِيٍّ لَيْسَ لَهُ دافِعٌ ثُمَّ قَالَ هَكَذَا وَ اللَّهِ نَزَلَ بِهَا جَبْرَئِيلُ ( عليه السلام ) عَلَى مُحَمَّدٍ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Ahmad Bin Muhammad, from Muhammad Bin Khalid, from Muhammad Bin Suleyman, from his father, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> the Exalted <span class=\"ibTxt\">[70:1] A questioner, asked for the Punishment to befall [70:2] For the unbelievers in the Wilayah of Ali</span><sup class=\"ibTxt\">asws</sup><span class=\"ibTxt\">, there is none to avert it</span>’. Then he<sup>asws</sup> said: ‘<span style=\"text-decoration: underline\">This is how, by Allah</span><sup style=\"text-decoration: underline\">azwj</sup><span style=\"text-decoration: underline\"> Jibraeel</span><sup style=\"text-decoration: underline\">as</sup><span style=\"text-decoration: underline\"> descended with it unto Muhammad</span><sup style=\"text-decoration: underline\">saww</sup>’."
          ],
          "en.sarwar": [
            " 47. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Sayf from his brother from his father from abu Hamza from abu Ja‘far (a.s.) about the words of Allah, the Most High. “. . your ideas are confused (51:8). Let whoever wishes, turn away from it (Wilaya, Leadership with Divine Authority) (Our Quran).” (51:9) The Imam (a.s.) said, “whoever would turn away from Wilaya, (Leadership with Divine Authority) he has turned away from paradise.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/62)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1129,
        "local_index": 48,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:48",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ سَيْفٍ عَنْ أَخِيهِ عَنْ أَبِيهِ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى إِنَّكُمْ لَفِي قَوْلٍ مُخْتَلِفٍ فِي أَمْرِ الْوَلَايَةِ يُؤْفَكُ عَنْهُ مَنْ أُفِكَ قَالَ مَنْ أُفِكَ عَنِ الْوَلَايَةِ أُفِكَ عَنِ الْجَنَّةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Sayf, from his brother, from his father, from Abu Hamza, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\">[51:8] Most surely you are at variance with each other in what you say </span>regarding the matter of Al-Wilayah<span class=\"ibTxt\"> [51:9] He is turned away from it who would be turned away</span>. He<sup>asws</sup> said: ‘The one who turns away from Al-Wilayah, turns away from the Paradise’."
          ],
          "en.sarwar": [
            " 48. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn Jumhur from Yunus who has said the following “A person in a marfu‘ narrated to me from abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most Gracious. “Yet, he has not entered into Aqaba (90:11). Would that you knew what Aqaba is! (90:12). It is the setting free of a slave.” (90:13) The Imam (a.s.) said, “Setting free of a slave is acknowledgment of the Wilaya of Amir al-Mu’minin (a.s.), Leadership with Divine Authority.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/63)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1130,
        "local_index": 49,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:49",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ يُونُسَ قَالَ أَخْبَرَنِي مَنْ رَفَعَهُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِهِ عَزَّ وَ جَلَّ فَلَا اقْتَحَمَ الْعَقَبَةَ. وَ ما أَدْراكَ مَا الْعَقَبَةُ. فَكُّ رَقَبَةٍ يَعْنِي بِقَوْلِهِ فَكُّ رَقَبَةٍ وَلَايَةَ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَإِنَّ ذَلِكَ فَكُّ رَقَبَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Jamhour, from Yunus who said ",
            "‘I was informed by the one who raised it to Abu Abdullah<sup>asws</sup>, regarding the Words of the Mighty and Majestic <span class=\"ibTxt\">[90:11] But he would not attempt the uphill road, [90:12] And what will make you comprehend what the uphill road is? [90:13] (It is) the setting free of a slave</span>. It Means by His<sup>azwj</sup> Words <span class=\"ibTxt\">the setting free of a slave</span>, the Wilayah of Amir Al-Momineen<sup>asws</sup>, for that is the setting free of a slave’."
          ],
          "en.sarwar": [
            " 49. Through the same chain of narrators it is from abu ‘Abdallah (a.s.) about the words of Allah, the Most High. “. . give to the believers the glad news of their high rank in the sight of God.. .” The Imam (a.s.) said, “It is the Wilaya Imam Ali’s (Leadership with Divine Authority).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالسابق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/65)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1131,
        "local_index": 50,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:50",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى بَشِّرِ الَّذِينَ آمَنُوا أَنَّ لَهُمْ قَدَمَ صِدْقٍ عِنْدَ رَبِّهِمْ قَالَ وَلَايَةُ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\">[10:2] and give good News to those who believe that for them is a true footing with their Lord</span>. He<sup>asws</sup> said: ‘Wilayah of Amir Al-Momineen<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 50. Ali ibn Ibrahim has narrated from Ahmad ibn Muhammad al-Barqi from his father from Muhammad ibn al-Fudayl from abu Hamza from abu Ja‘far (a.s.) about the words of Allah, the Most High. “. . two groups who dispute with each other about their Lord. For the unbelievers (in Wilaya of Imam Ali (Leadership with Divine Authority) the garment of fire has already been prepared.. .” (22:19)”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/65)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1132,
        "local_index": 51,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:51",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى هذانِ خَصْمانِ اخْتَصَمُوا فِي رَبِّهِمْ فَالَّذِينَ كَفَرُوا بِوَلَايَةِ عَلِيٍّ قُطِّعَتْ لَهُمْ ثِيابٌ مِنْ نارٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Ahmad Bin Muhammad Al Barqy, from his father, from Muhammad Bin Al Fuzayl, from Abu Hamza, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\">[22:19] These are two disputants who dispute about their Lord; then (as to) those who disbelieve </span>in the Wilayah of Ali<sup>asws</sup><span class=\"ibTxt\">, for them are cut out garments of Fire</span>’."
          ],
          "en.sarwar": [
            " 51. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn Uramah from Ali ibn Hassa’n from ‘Abd al-Rahman ibn Kathir who has said the following. “I asked abu ‘Abdallah (a.s.) about the words of Allah, the Most High. “. . the human being realizes that it is the truth (God) who is the true Guardian. .” (18:44) The Imam (a.s.) said, “It is the Wilaya of Imam Ali’s (Leadership with Divine Authority).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/67)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1133,
        "local_index": 52,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:52",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أُورَمَةَ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ تَعَالَى هُنالِكَ الْوَلايَةُ لِلَّهِ الْحَقِّ قَالَ وَلَايَةُ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Awrama, from Ali Bin Hassan, from Abdul Rahman Bin Kaseer who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> <span class=\"ibTxt\">[18:44] Over here the Wilayah is for Allah, the Truth</span>. He<sup>asws</sup> said: ‘Wilayah of Amir Al-Momineen<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 52. Muhammad ibn Yahya has narrated from Salama ibn al-Khattab from Ali ibn Hassa’n from ‘Abd al-Rahman ibn Kathir from abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most Gracious. “God’s (means of purification and His) coloring. No coloring (purification) is better than that of God. and we (Muslims) worship Him.” (2:138) The Imam (a.s.) said, “Allah has colored the believers with the Wilaya of Imam Ali (Leadership with Divine Authority) at the time He made to make the covenant.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالسابق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (67/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1134,
        "local_index": 53,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:53",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِهِ عَزَّ وَ جَلَّ صِبْغَةَ اللَّهِ وَ مَنْ أَحْسَنُ مِنَ اللَّهِ صِبْغَةً قَالَ صَبَغَ الْمُؤْمِنِينَ بِالْوَلَايَةِ فِي الْمِيثَاقِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Salma Bin Al Khatab, from Ali Bin Hassan, from Abdul Rahman Bin Kaseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of the Mighty and Majestic <span class=\"ibTxt\">[2:138] A Dyeing of Allah, and who is better than Allah in dyeing?</span> He<sup>asws</sup> said: ‘The Momineen were dyed by the Wilayah during the (Taking of the) Covenant’."
          ],
          "en.sarwar": [
            " 53. A number of our people has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn Faddal from al-Mufaddal ibn Salih from Muhammad ibn Ali al-Halabi from abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most Gracious. “Lord, forgive me, my parents, the believers who have entered my home and all believing . .” (71:28) The Imam (a.s.) said, “Home means Wilaya of Imam Ali (Leadership with Divine Authority). Whoever acknowledges Wilaya has entered the home of the prophets. The house mentioned verse 33:33 also refers to Wilaya. “People of the house, God wants to remove all kinds of uncleanliness from you and to purify you thoroughly.” (33:33) It refers to the Imams (a.s.) and their Wilaya (Leadership with Divine Authority). Whoever would acknowledge it he has found a place in the house of The Holy Prophet (s.a.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالسابق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (68/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1135,
        "local_index": 54,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:54",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ فَضَّالٍ عَنِ الْمُفَضَّلِ بْنِ صَالِحٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِهِ عَزَّ وَ جَلَّ رَبِّ اغْفِرْ لِي وَ لِوالِدَيَّ وَ لِمَنْ دَخَلَ بَيْتِيَ مُؤْمِناً يَعْنِي الْوَلَايَةَ مَنْ دَخَلَ فِي الْوَلَايَةِ دَخَلَ فِي بَيْتِ الْأَنْبِيَاءِ ( عليهم السلام ) ",
          "وَ قَوْلُهُ إِنَّما يُرِيدُ اللَّهُ لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ وَ يُطَهِّرَكُمْ تَطْهِيراً يَعْنِي الْأَئِمَّةَ ( عليهم السلام ) وَ وَلَايَتَهُمْ مَنْ دَخَلَ فِيهَا دَخَلَ فِي بَيْتِ النَّبِيِّ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ibn Fazzal, from Al Mufazzal Bin Salih, from Muhammad Bin Ali Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of the Mighty and Majestic <span class=\"ibTxt\">[71:28] My Lord! Forgive me and my parents and him who enters my house believing </span>– Meaning the Wilayah. The one who enteres into the Wilayah enters into the House of the Prophets<sup>as</sup>’.",
            "And His<sup>azwj</sup> Words <span class=\"ibTxt\">[33:33] But rather, Allah Desires to Keep away the uncleanness from you, O people of the House! And to Purify you a with a Purification </span>– Meaning the Imams<sup>asws</sup> and their<sup>asws</sup> Wilayah. The one who enters into it, enters into the House of the Prophet<sup>saww</sup>’."
          ],
          "en.sarwar": [
            " 54. Through the same chain of narrators it is narrated from Ahmad ibn Muhammad from ‘Umar ibn ‘Abd al-‘Aziz from Muhammad ibn al-Fudayl who has said the following “I asked al-Rida (a.s.) about the words of Allah. “(Muhammad), tell them, “To be happy with the favors and mercy of God is better than whatever you accumulate.” (10:58) The Imam (a.s.) said, “To acknowledge the Wilaya of the family of Muhammad (s.a.) is better than all that they accumulate of the worldly gains.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (70/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1136,
        "local_index": 55,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:55",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنِ الرِّضَا ( عليه السلام ) قَالَ قُلْتُ قُلْ بِفَضْلِ اللَّهِ وَ بِرَحْمَتِهِ فَبِذلِكَ فَلْيَفْرَحُوا هُوَ خَيْرٌ مِمَّا يَجْمَعُونَ قَالَ بِوَلَايَةِ مُحَمَّدٍ وَ آلِ مُحَمَّدٍ ( عليهم السلام ) هُوَ خَيْرٌ مِمَّا يَجْمَعُ هَؤُلَاءِ مِنْ دُنْيَاهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Ahmad Bin Muhammad, from Umar Bin Abdul Aziz, from Muhammad Bin Al Fuzayl, ",
            "(It has been narrated) from Al-Reza<sup>asws</sup>, said, ‘I said, ‘<span class=\"ibTxt\">[10:58] Say: By the Grace of Allah and by His Mercy – so it is by that they should be rejoicing; it is better from that which they are amassing</span>. He<sup>asws</sup> said: ‘By the Wilayah of Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>. It is better than what they are amassing for their world’."
          ],
          "en.sarwar": [
            " 55. Ahmad ibn Mihran has narrated from ‘Abd al-‘Azim al-Hassani from Ali ibn Asbat from Ibrahim ibn ‘Abd al-Hamid from Zayd al-Shahham who has said the following “Abu ‘Abdallah (a.s.) said to me on the way home on Friday night, “Read from the Holy Quran. It is a Friday night. I then read, “The appointed time for all of them will be the Day of Judgment (44:40) (when wrong will be distinguished from right). On this day friends will be of no benefit to one another, nor will they receive any help (44:41) except for those to whom God grants mercy. . .” (44:42) The Imam (a.s.) said, “We, by Allah, are those whom He has granted mercy. We, by Allah, are the ones whom Allah has made exceptional and we will support them (our followers) sufficiently.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/71)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1137,
        "local_index": 56,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:56",
        "text": [
          "أَحْمَدُ بْنُ مِهْرَانَ عَنْ عَبْدِ الْعَظِيمِ بْنِ عَبْدِ اللَّهِ الْحَسَنِيِّ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ زَيْدٍ الشَّحَّامِ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ نَحْنُ فِي الطَّرِيقِ فِي لَيْلَةِ الْجُمُعَةِ اقْرَأْ فَإِنَّهَا لَيْلَةُ الْجُمُعَةِ قُرْآناً فَقَرَأْتُ إِنَّ يَوْمَ الْفَصْلِ كَانَ مِيقاتُهُمْ أَجْمَعِينَ. يَوْمَ لا يُغْنِي مَوْلًى عَنْ مَوْلًى شَيْئاً وَ لا هُمْ يُنْصَرُونَ. إِلَّا مَنْ رَحِمَ اللَّهُ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) نَحْنُ وَ اللَّهِ الَّذِي رَحِمَ اللَّهُ وَ نَحْنُ وَ اللَّهِ الَّذِي اسْتَثْنَى اللَّهُ لَكِنَّا نُغْنِي عَنْهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Abdul Azeem Bin Abdullah Al Hassany, from Ali Bin Asbat, from Ibrahim Bin Abdul Hameed, from Zayd Al Shahham who said, ",
            "‘Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> said to me and we were in the road during the night of Friday: ‘Recite the Quran, for it is a night of Friday’. So I recited <span class=\"ibTxt\">[44:40] Surely the Day of separation is their appointed term, of all of them [44:41] The Day on which a friend shall not avail (his) friend aught, nor shall they be helped, [44:42] Except those on whom Allah shall have Mercy</span>. So Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> said: ‘We<sup style=\"font-weight: normal\">asws</sup>, by Allah<sup style=\"font-weight: normal\">azwj</sup>, are those on whom Allah<sup style=\"font-weight: normal\">azwj</sup> has Mercy, and we, by Allah<sup style=\"font-weight: normal\">azwj</sup>, are those whom Allah<sup style=\"font-weight: normal\">azwj</sup> has Made to be exception, in order for us<sup style=\"font-weight: normal\">asws</sup> to make them (Shias) needless from them (rest of the people)’."
          ],
          "en.sarwar": [
            " 56. Ahmad ibn Mihran has narrated from ‘Abd al-‘Azim al-Hassani from ‘Abdallah from Yahya ibn Salim from abu ‘Abdallah (a.s.) who has said the following “When this, “but only attentive ears will retain it” (69:12) the Messenger of Allah said, “They are your ears, O Ali.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالسابق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/72)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1138,
        "local_index": 57,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:57",
        "text": [
          "أَحْمَدُ بْنُ مِهْرَانَ عَنْ عَبْدِ الْعَظِيمِ بْنِ عَبْدِ اللَّهِ عَنْ يَحْيَى بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَمَّا نَزَلَتْ وَ تَعِيَها أُذُنٌ واعِيَةٌ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) هِيَ أُذُنُكَ يَا عَلِيُّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Abdul Azeem Bin Abdullah, from Yahya Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When it was Revealed <span class=\"ibTxt\">[69:12] and that the retaining ear would retain it</span>, Rasool-Allah<sup>saww</sup> said: ‘It is your<sup>asws</sup> ear, O Ali<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 57. Ahmad ibn Mihran has narrated from ‘Abd al-‘Azim al-Hassani from Muhammad ibn al-Fudayl from abu Hamza from abu Ja‘far (a.s.) who has said the following “Once Jibril brought the following verse Prophet Muhammad (s.a.). “The unjust ones (against the rights of the family of Muhammad) (among you) changed what they were told to say. Then, We afflicted them (the unjust against the rights of the family of Muhammad (s.a.) with a torment from the heavens for their evil deeds.” (2:59)"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالسابق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (75/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1139,
        "local_index": 58,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:58",
        "text": [
          "أَحْمَدُ بْنُ مِهْرَانَ عَنْ عَبْدِ الْعَظِيمِ بْنِ عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ نَزَلَ جَبْرَئِيلُ ( عليه السلام ) بِهَذِهِ الْآيَةِ عَلَى مُحَمَّدٍ ( صلى الله عليه وآله ) هَكَذَا فَبَدَّلَ الَّذِينَ ظَلَمُوا آلَ مُحَمَّدٍ حَقَّهُمْ قَوْلًا غَيْرَ الَّذِي قِيلَ لَهُمْ فَأَنْزَلْنا عَلَى الَّذِينَ ظَلَمُوا آلَ مُحَمَّدٍ حَقَّهُمْ رِجْزاً مِنَ السَّماءِ بِما كانُوا يَفْسُقُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Abdul Azeem Bin Abdullah, from Muhammad Bin Al Fuzayl, from Abu Hamza, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘<span style=\"text-decoration: underline\">Jibraeel</span><sup style=\"text-decoration: underline\">as</sup><span style=\"text-decoration: underline\"> descended with this Verse unto Muhammad</span><sup style=\"text-decoration: underline\">saww</sup><span style=\"text-decoration: underline\">, like this</span> - <span class=\"ibTxt\">[2:59] But those who were unjust to the Progeny of Muhammad</span><sup class=\"ibTxt\">s</sup><sup class=\"ibTxt\">aww</sup><span class=\"ibTxt\"> of their rights changed it for a word other than that which had been Spoken to them, so We Sent upon those who were unjust to the Progeny of Muhammad</span><sup class=\"ibTxt\">s</sup><sup class=\"ibTxt\">aww</sup><span class=\"ibTxt\"> of their rights a Torment from the sky, because they transgressed</span>’."
          ],
          "en.sarwar": [
            " 58. Through the same chain of narrators it is narrated from ‘Abd al-‘Azim ibn ‘Abdallah al-Hassani from Muhammad ibn al-Fudayl from abu Hamza from abu Ja‘far (a.s.) who has said the following. “Jibril brought this verse. “Those who have done injustice (against the rights of the family of Muhammad (s.a.) will not receive forgiveness from Allah or guidance to any other path but that to Hell wherein they will remain forever. Then he said, “O people, the Messenger has come to you with the truth (Wilaya of Imam Ali (Leadership with Divine Authority). If you would have faith in it it would be better for you. If you would reject (Wilaya of Imam Ali (Leadership with Divine Authority) (know) that to Allah belongs all that is in the heavens and in the earth.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالسابق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/77)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1140,
        "local_index": 59,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:59",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ عَنْ عَبْدِ الْعَظِيمِ بْنِ عَبْدِ اللَّهِ الْحَسَنِيِّ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ نَزَلَ جَبْرَئِيلُ ( عليه السلام ) بِهَذِهِ الْآيَةِ هَكَذَا إِنَّ الَّذِينَ... ظَلَمُوا آلَ مُحَمَّدٍ حَقَّهُمْ لَمْ يَكُنِ اللَّهُ لِيَغْفِرَ لَهُمْ وَ لا لِيَهْدِيَهُمْ طَرِيقاً. إِلَّا طَرِيقَ جَهَنَّمَ خالِدِينَ فِيها أَبَداً وَ كانَ ذلِكَ عَلَى اللَّهِ يَسِيراً ",
          "ثُمَّ قَالَ يا أَيُّهَا النَّاسُ قَدْ جاءَكُمُ الرَّسُولُ بِالْحَقِّ مِنْ رَبِّكُمْ فِي وَلَايَةِ عَلِيٍّ فَآمِنُوا خَيْراً لَكُمْ وَ إِنْ تَكْفُرُوا بِوَلَايَةِ عَلِيٍّ فَإِنَّ لِلَّهِ ما فِي السَّماواتِ وَ مَا فِي الْأَرْضِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Abdul Azeem Bin Abdullah Al Hasany, from Muhammad Bin Al Fuzayl, from Abu Hamza, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘<span style=\"text-decoration: underline\">Jibraeel</span><sup style=\"text-decoration: underline\">as</sup><span style=\"text-decoration: underline\"> desended with this Verse, like this </span><span class=\"ibTxt\">[4:168] Surely (as for) those who were unjust to the Progeny of Muhammad</span><sup class=\"ibTxt\">s</sup><sup class=\"ibTxt\">aww</sup><span class=\"ibTxt\"> of their rights Allah will not Forgive them nor Guide them to a Path [4:169] Except the Path of Hell, to abide in it for ever, and this is easy to Allah</span>. ",
            "Then he<sup>asws</sup> said: ‘<span class=\"ibTxt\">[4:170] O you people! Surely the Rasool has come to you with the Truth from your Lord, regarding the Wilayah of Ali</span><sup class=\"ibTxt\">asws</sup><span class=\"ibTxt\">, therefore believe, (it shall be) good for you and If you disbelieve in the Wilayah of Ali</span><sup class=\"ibTxt\">asws</sup><span class=\"ibTxt\">, then surely whatever is in the skies and the earth is Allah's</span>’."
          ],
          "en.sarwar": [
            " 59. Ahmad Mihran has narrated –may Allah grant him blessings- from ‘Abd al-‘Azim from Bakkar from Jabir from abu Ja‘far (a.s.) who has said the following. “This verse of the Holy Quran was revealed as this, “If they had done what they had been advised to do (about Ali (a.s.), it would have bee for their own good . .” (4:66)"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالسابق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (78/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1141,
        "local_index": 60,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:60",
        "text": [
          "أَحْمَدُ بْنُ مِهْرَانَ رَحِمَهُ اللَّهُ عَنْ عَبْدِ الْعَظِيمِ عَنْ بَكَّارٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ هَكَذَا نَزَلَتْ هَذِهِ الْآيَةُ وَ لَوْ أَنَّهُمْ فَعَلُوا ما يُوعَظُونَ بِهِ فِي عَلِيٍّ لَكانَ خَيْراً لَهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Mihran, from Abdul Azeem, from Bakkar, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘<span style=\"text-decoration: underline\">This is how this Verse was Revealed </span><span class=\"ibTxt\">[4:66] and if they had done what they were Advised with regarding Ali</span><sup class=\"ibTxt\">asws</sup><span class=\"ibTxt\">, it would have certainly been better for them</span>’."
          ],
          "en.sarwar": [
            " 60. Ahmad has narrated from ‘Abd al-‘Azim from ibn ’Udhayna from Malik al-Juhanni who has said the following “I asked abu ‘Abdallah (a.s.) about the meaning of the words of Allah. “. .He has revealed this Quran to me to warn you and those who will receive it . “. (6:19) The Imam (a.s.) said, “It means, whoever of the family of Muhammad (s.a.) will be the Imam he will warn people by means of the Holy Quran just as the Messenger of Allah did.”."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالسابق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (79/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1142,
        "local_index": 61,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:61",
        "text": [
          "أَحْمَدُ عَنْ عَبْدِ الْعَظِيمِ عَنِ ابْنِ أُذَيْنَةَ عَنْ مَالِكٍ الْجُهَنِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ أُوحِيَ إِلَيَّ هذَا الْقُرْآنُ لِأُنْذِرَكُمْ بِهِ وَ مَنْ بَلَغَ قَالَ مَنْ بَلَغَ أَنْ يَكُونَ إِمَاماً مِنْ آلِ مُحَمَّدٍ يُنْذِرُ بِالْقُرْآنِ كَمَا يُنْذِرُ بِهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله )."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Abdul Azeem, from Ibn Azina, from Malik Al Juhny who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘<span class=\"ibTxt\">[6:19] and this Quran has been Revealed to me that with it I may warn you, and whomsoever it reaches</span>. He<sup>asws</sup> said: ‘The one whom it reaches that he becomes an Imam<sup>asws</sup>, from the Progeny<sup>asws</sup> of Muhammad<sup>as</sup>. He<sup>asws</sup> would warn with the Quran just as Rasool-Allah<sup>saww</sup> had warned with it’."
          ],
          "en.sarwar": [
            " 61. Ahmad has narrated from ‘Abd al-‘Azim from al-Husayn ibn Mayyah from those who informed him has said the following “A man read this verse before abu ‘Abdallah (a.s.) “(Muhammad), tell them, “Act as you wish. God, His Messenger and the believers will see your deeds. . .” (9:105) The Imam (a.s.) said, “It is not all believers. It refers to the infalliable ones among them. We are the infallible ones.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (79/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1143,
        "local_index": 62,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:62",
        "text": [
          "أَحْمَدُ عَنْ عَبْدِ الْعَظِيمِ عَنِ الْحُسَيْنِ بْنِ مَيَّاحٍ عَمَّنْ أَخْبَرَهُ قَالَ قَرَأَ رَجُلٌ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قُلِ اعْمَلُوا فَسَيَرَى اللَّهُ عَمَلَكُمْ وَ رَسُولُهُ وَ الْمُؤْمِنُونَ فَقَالَ لَيْسَ هَكَذَا هِيَ إِنَّمَا هِيَ وَ الْمَأْمُونُونَ فَنَحْنُ الْمَأْمُونُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad, from Abdul Azeem, from Al Husayn Bin Mayyah, from the one who informed him who said, ",
            "‘A man recited in the presence of Abu Abdullah<sup>asws</sup> <span class=\"ibTxt\">[9:105] And say: Work; so Allah will See your work and (so will) His Rasool and the Believers</span>. So he<sup>asws</sup> said: ‘It is not like this! But rather, it is ‘The Secured ones (Al-Mamounoun). So we<sup>asws</sup> are the secured ones’."
          ],
          "en.sarwar": [
            " 62. Ahmad has narrated from ‘Abd al-‘Azim from Hisham ibn al-Hakam from abu ‘Abdallah (a.s.) who has said the following. “The path which leads to Me is a straight (the path of Ali not ‘Alayya which means to me).” (15:41)"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور صحيح عندي   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (79/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1144,
        "local_index": 63,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:63",
        "text": [
          "أَحْمَدُ عَنْ عَبْدِ الْعَظِيمِ عَنْ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ هَذَا صِرَاطُ عَلِيٍّ مُسْتَقِيمٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad, from Abdul Azeem, from Hisham Bin Al Hakam, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘<span class=\"ibTxt\">[15:41] He said: This is a Path of Ali, Straight</span>’."
          ],
          "en.sarwar": [
            " 63. Ahmad has narrated from ‘Abd al-‘Azim from Muhammad ibn al-Fudayl from abu Hamza from abu Ja‘far (a.s.) who has said the following. “Jibril brought this verse as this. “. . but most human beings turn away (from Wilaya of Ali (Leadership with Divine Authority) in disbelief.” (17:89) He said, “Jibril brought this verse as this “Say,” Truth comes from your Lord.(about Wilaya of Ali Leadership with Divine Authority) Let people have faith or disbelieve as they chose.” For the unjust (to the family of Muhammad) We have prepared a fire. .” (18:29)"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/80)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1145,
        "local_index": 64,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:64",
        "text": [
          "أَحْمَدُ عَنْ عَبْدِ الْعَظِيمِ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ نَزَلَ جَبْرَئِيلُ بِهَذِهِ الْآيَةِ هَكَذَا فَأَبى أَكْثَرُ النَّاسِ بِوَلَايَةِ عَلِيٍّ إِلَّا كُفُوراً ",
          "قَالَ وَ نَزَلَ جَبْرَئِيلُ ( عليه السلام ) بِهَذِهِ الْآيَةِ هَكَذَا وَ قُلِ الْحَقُّ مِنْ رَبِّكُمْ فِي وَلَايَةِ عَلِيٍّ فَمَنْ شاءَ فَلْيُؤْمِنْ وَ مَنْ شاءَ فَلْيَكْفُرْ إِنَّا أَعْتَدْنا لِلظَّالِمِينَ آلَ مُحَمَّدٍ ناراً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad, from Abdul Azeem, from Muhammad Bin Al Fuzayl, from Abu Hamza, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Jibraeel<sup>as</sup> descended with this Verse like this - <span class=\"ibTxt\">[17:89] but most of the people refused (to accept) the Wilayah of Ali, except for the denying</span>’. ",
            "He<sup>asws</sup> said: ‘And <span style=\"text-decoration: underline\">Jibraeel</span><sup style=\"text-decoration: underline\">as</sup><span style=\"text-decoration: underline\"> descended with this Verse like this</span> - <span class=\"ibTxt\">[18:29] And say: The Truth is from your Lord, regarding the Wilayah of Ali</span><sup class=\"ibTxt\">asws</sup><span class=\"ibTxt\">, so let him who desires to, believe, and let him who desires to, disbelieve; We have Prepared for the unjust to the Progeny of Muhammad, a Fire</span>’."
          ],
          "en.sarwar": [
            " 64. A number of our people has narrated from Ahmad ibn Muhammad from Muhammad ibn ’Isma‘il from Muhammad ibn al-Fudayl from abu al-Hassan (a.s.) about the words of Allah. “All the places for prostration (or parts of the body to be placed on the ground during) belong to God (72:18) The Imam (a.s.) said, “They are the executors of the will of The Holy Prophet (s.a) .”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/81)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1146,
        "local_index": 65,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:65",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) فِي قَوْلِهِ وَ أَنَّ الْمَساجِدَ لِلَّهِ فَلا تَدْعُوا مَعَ اللَّهِ أَحَداً قَالَ هُمُ الْأَوْصِيَاءُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Muhammad Bin Al Fuzayl, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> regarding His<sup>azwj</sup> Words <span class=\"ibTxt\">72:18] And that the Masjids are Allah's, therefore call not upon any one with Allah</span>. He<sup>asws</sup> said: ‘They<sup>asws</sup> are the successors<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 65. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn Mahbub from al-Ahwal from Salam ibn al-Mustanir from abu Ja‘far (a.s.) about the words of Allah, the Most High. “(Muhammad), say, ‘This is my way. I and all my followers invite you to God with proper understanding.. .” (12:108) The Imam (a.s.) said, “They are the Messenger of Allah and Amir al-Mu’minin Ali (a.s.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/82)",
          "Shaykh Baqir al-Behbudi: <span>صحيح</span> - Sahih al-Kafi (1/50)"
        ],
        "index": 1147,
        "local_index": 66,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:66",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنِ الْأَحْوَلِ عَنْ سَلَّامِ بْنِ الْمُسْتَنِيرِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى قُلْ هذِهِ سَبِيلِي أَدْعُوا إِلَى اللَّهِ عَلى بَصِيرَةٍ أَنَا وَ مَنِ اتَّبَعَنِي قَالَ ذَاكَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) وَ الْأَوْصِيَاءُ مِنْ بَعْدِهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from Al Ahowl, from Sallam Bin Al Mustaneer, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\">[12:108] Say: This is my way: I call to Allah, I and the ones who follow me having insight</span>. He<sup>asws</sup> said: ‘That is Rasool-Allah<sup>saww</sup> and Amir Al-Momineen<sup>asws</sup>, and the successors<sup>asws</sup> from after them<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 66. Muhammad ibn Yahya has narrated from from Ahmad ibn Muhammad from Muhammad ibn ’Isma‘il from Hanan from Salim al-Hannat who has said the following. “I asked abu Ja‘far (a.s.) about the meaning of the words of Allah, the Most Majestic, the Most gracious. “We saved the believers among them, (51:35) but We found only one Muslim house (51:36). The Imam (a.s.) said, “That family is the family of Muhammad (s.a).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/83)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1148,
        "local_index": 67,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:67",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ حَنَانٍ عَنْ سَالِمٍ الْحَنَّاطِ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَأَخْرَجْنا مَنْ كانَ فِيها مِنَ الْمُؤْمِنِينَ فَما وَجَدْنا فِيها غَيْرَ بَيْتٍ مِنَ الْمُسْلِمِينَ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) آلُ مُحَمَّدٍ لَمْ يَبْقَ فِيهَا غَيْرُهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Hanan, from Salim Al Hannat who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[51:35] Then We brought forth such as were therein of the Believers. [51:36] But We did not find therein save a (single) house of those who submitted</span>. So Abu Ja’far<sup>asws</sup> said: ‘The Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>. There did not remain therein apart from them<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 67. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn Jumhur from ’Isma‘il ibn Sahl from al-Qasim ibn ‘Urwa from abu al-Safatij from Zurara from abu Ja‘far (a.s.) about the words of Allah, the Most High. “When they see the torment approaching, the faces of the unbelievers will blacken and they will be told, “This is what you wanted to (experience)” (67:27). The Imam (a.s.) said, “This was revealed about Amir al-Mu’minin (a.s.) and his contemporaries who did what they to him. They will see Amir al-Mu’minin (a.s.) in such a position that will make them envious. This will cause their faces to show miserable. It will be said to them, “This is the one whose title ‘Amir al-Mu’minin’ you had assumed.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/84)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1149,
        "local_index": 68,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:68",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ إِسْمَاعِيلَ بْنِ سَهْلٍ عَنِ الْقَاسِمِ بْنِ عُرْوَةَ عَنْ أَبِي السَّفَاتِجِ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى فَلَمَّا رَأَوْهُ زُلْفَةً سِيئَتْ وُجُوهُ الَّذِينَ كَفَرُوا وَ قِيلَ هذَا الَّذِي كُنْتُمْ بِهِ تَدَّعُونَ قَالَ هَذِهِ نَزَلَتْ فِي أَمِيرِ الْمُؤْمِنِينَ وَ أَصْحَابِهِ الَّذِينَ عَمِلُوا مَا عَمِلُوا يَرَوْنَ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فِي أَغْبَطِ الْأَمَاكِنِ لَهُمْ فَيُسِي‏ءُ وُجُوهَهُمْ وَ يُقَالُ لَهُمْ هذَا الَّذِي كُنْتُمْ بِهِ تَدَّعُونَ الَّذِي انْتَحَلْتُمِ اسْمَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Jamhour, from Ismail Bin Sahl, from Al Qasim Bin Urwa, from Abu Al Saffatij, from Zurara, ",
            "(It has been narrated) from Abu ja’far<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\">[67:27] But when they shall see it nigh, the faces of those who disbelieve shall be sorry, and it shall be said; This is that which you used to be called by</span>. He<sup>asws</sup> said: ‘This was Revealed regarding Amir Al-Momineen<sup>asws</sup> and his<sup>asws</sup> contemporaries, those who did what they did. They will be seeing Amir Al-Momineen<sup>asws</sup> in places which would be enviable to them, despair in their faces, <span class=\"ibTxt\">and it shall be said; This is that which you used to be called by</span>, those who impersonated by his<sup>asws</sup> name (i.e., they were named as Amir Al-Momineen)’."
          ],
          "en.sarwar": [
            " 68. Muhammad ibn Yahya has narrated from Salma ibn al-Khattab from Ali ibn Hassa’n from ‘Abd al-Rahman ibn Kathir from abu ‘Abdallah (a.s.) about the words of Allah, the Most High. “and by the witness (Muhammad) and that which is witnessed (the Day of Judgment),” (85:3) The Imam (a.s.) said, “They are The Holy Prophet (s.a) and Amir al-Mu’minin Ali (a.s.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالسابق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (86/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1150,
        "local_index": 69,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:69",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى وَ شاهِدٍ وَ مَشْهُودٍ قَالَ النَّبِيُّ ( صلى الله عليه وآله ) وَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Salma Bin Al Khattab, from Ali Bin Hassan, from Abdul Rahman Bin Kaseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\">[85:3] And the witness and the witnessed</span>. He<sup>asws</sup> said: ‘The Prophet<sup>saww</sup> and Amir Al-Momineen<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 69. Al-Husayn ibn Muhammad from Mu‘alla ibn Muhammad from al-Washsha’ from Ahmad ibn ‘Umar al-Hallal who has said the following. “I asked abu al-Hassan (a.s.) about the words of Allah, the Most High. “. . someone will cry out, “God has condemned the unjust,” (7:44) The Imam (a.s.) said, “The caller will be Amir al-Mu’minin Ali (a.s.).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/87)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1151,
        "local_index": 70,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:70",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَحْمَدَ بْنِ عُمَرَ الْحَلَّالِ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنْ قَوْلِهِ تَعَالَى فَأَذَّنَ مُؤَذِّنٌ بَيْنَهُمْ أَنْ لَعْنَةُ اللَّهِ عَلَى الظَّالِمِينَ قَالَ الْمُؤَذِّنُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washha, from Ahmad Bin Umar Al Hallah who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about the Words of the Exalted <span class=\"ibTxt\">[7:44] Then a proclaimer would proclaim among them that the Curse of Allah is on the unjust</span>. He<sup>asws</sup> said: ‘The proclaimer is Amir Al-Momineen<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 70. Al-Husayn ibn Muhammad from Mu‘alla ibn Muhammad ibn ’Urama from Ali ibn Hassa’n from ‘Abd al-Rahman ibn Kathir from abu ‘Abdallah (a.s.) about the words of Allah, the Most High. “. .for they were guided to speak the noblest words and follow the praiseworthy path.” (22:24) The Imam (a.s.) said, “They were Hamza, ‘Ubayda, Salman, abu Dhar, al-Miqdad ibn al_Aswad and ‘Ammar who were guidedd to Amir al-Mu’minin Ali (a.s.). “However, God has endeared the faith to you and has made it attractive to your hearts –meaning thereby Amir al-Mu’minin Ali (a.s.)) He has made disbelief, evil deeds and disobedience hateful to you. Such people will have the right guidance (meaning thereby the first, the second and the third)” (49:7)"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (87/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1152,
        "local_index": 71,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:71",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أُورَمَةَ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى وَ هُدُوا إِلَى الطَّيِّبِ مِنَ الْقَوْلِ وَ هُدُوا إِلى صِراطِ الْحَمِيدِ قَالَ ذَاكَ حَمْزَةُ وَ جَعْفَرٌ وَ عُبَيْدَةُ وَ سَلْمَانُ وَ أَبُو ذَرٍّ وَ الْمِقْدَادُ بْنُ الْأَسْوَدِ وَ عَمَّارٌ هُدُوا إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) ",
          "وَ قَوْلِهِ حَبَّبَ إِلَيْكُمُ الْإِيمانَ وَ زَيَّنَهُ فِي قُلُوبِكُمْ يَعْنِي أَمِيرَ الْمُؤْمِنِينَ وَ كَرَّهَ إِلَيْكُمُ الْكُفْرَ وَ الْفُسُوقَ وَ الْعِصْيانَ الْأَوَّلَ وَ الثَّانِيَ وَ الثَّالِثَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Awrama, from Ali Bin Hassan, from Abdul Rahman Bin Kaseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\">[22:24] And they are Guided to goodly words and they are Guided to the Path of the Praised One</span><span class=\"iTxt\">. </span>He<sup>asws</sup> said: ‘That (refers to) Hamza<sup>as</sup>, and Ja’far<sup>as</sup>, and Ubeyda, and Salman<sup>as</sup>, and Abu Zarr<sup>as</sup>, and Al-Miqdad Bin Al-Aswad<sup>as</sup>, and Ammar being Guided to Amir Al-Momineen<sup>asws</sup>. ",
            "And His<sup>azwj</sup> Words <span class=\"ibTxt\">[49:7] but Allah has Endeared the faith to you and has Adorned it in your hearts, and He has made hateful to you the unbelief and transgression and disobedience</span> – the first (Caliph), and the second (Caliph) and the third (Caliph)’."
          ],
          "en.sarwar": [
            " 71ـ مُحَمَّدُ بْنُ يَحْيَى عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ أَبِي عُبَيْدَةَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ (عَلَيْهِ السَّلام) عَنْ قَوْلِهِ تَعَالَى ائْتُونِي بِكِتابٍ مِنْ قَبْلِ هذا أَوْ أَثارَةٍ مِنْ عِلْمٍ إِنْ كُنْتُمْ صادِقِينَ قَالَ عَنَى بِالْكِتَابِ التَّوْرَاةَ وَالانْجِيلَ وَأَثَارَةٍ مِنْ عِلْمٍ فَإِنَّمَا عَنَى بِذَلِكَ عِلْمَ أَوْصِيَاءِ الانْبِيَاءِ (عَلَيْهم السَّلام). 71. Muhammad ibn Yahya has narrated from ibn Mahbub from Jamil ibn Salih from abu ‘Ubayda who has said the following. “I asked abu Ja‘far (a.s.) about the meaning of the words of Allah, the Most High. “. . Bring me a Book, revealed before this Quran, or any other proof based on knowledge to support your belief, if indeed you are truthful.” (46:4). The Imam (a.s.) said, “Book refers to Tura and the Gospel and knowledge refers to the knowledge of the executors of the wills of the prophets.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/89)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1153,
        "local_index": 72,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:72",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ أَبِي عُبَيْدَةَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ قَوْلِهِ تَعَالَى ائْتُونِي بِكِتابٍ مِنْ قَبْلِ هذا أَوْ أَثارَةٍ مِنْ عِلْمٍ إِنْ كُنْتُمْ صادِقِينَ قَالَ عَنَى بِالْكِتَابِ التَّوْرَاةَ وَ الْإِنْجِيلَ وَ أَثَارَةٍ مِنْ عِلْمٍ فَإِنَّمَا عَنَى بِذَلِكَ عِلْمَ أَوْصِيَاءِ الْأَنْبِيَاءِ ( عليهم السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ibn Mahboub, from Jameel Bin Salih, from Abu Ubeyda who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the Words of the Exalted <span class=\"ibTxt\">[46:4] Bring me a Book before this or traces of the Knowledge, if you are truthful</span>. He<sup>asws</sup> said: ‘It Means by the Book, the Torah, and the Evangel, ‘traces of knowledge’, so rather it means by that, knowledge of the successors<sup>as</sup> of the Prophets<sup>as</sup>’."
          ],
          "en.sarwar": [
            " 72. Al-Husayn ibn muhammad has narrated from from Mu‘alla ibn Muhammad from the one who had narrated to him from Ali ibnja who has said the following. “I heard abu al-Hassan (a.s.) say, ‘When the Messenger of Allah saw Taym, ‘Adi and Amawids climb his pulpit he was severely frightened. Allah, the Most Holy, the Most High, sent him a reading to comfort him. “When We told the angels to prostrate before Adam they all obeyed except Iblis (Satan) who refused.” (20:116) Then Allah, sent him a message that said, “O Muhammad, commanded them and they disobeyed. Do not despair if you will command them and they will disobey you in the matters of the executor of your will.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/90)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1154,
        "local_index": 73,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:73",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَمَّنْ أَخْبَرَهُ عَنْ عَلِيِّ بْنِ جَعْفَرٍ قَالَ سَمِعْتُ أَبَا الْحَسَنِ ( عليه السلام ) يَقُولُ لَمَّا رَأَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) تَيْماً وَ عَدِيّاً وَ بَنِي أُمَيَّةَ يَرْكَبُونَ مِنْبَرَهُ أَفْظَعَهُ فَأَنْزَلَ اللَّهُ تَبَارَكَ وَ تَعَالَى قُرْآناً يَتَأَسَّى بِهِ وَ إِذْ قُلْنا لِلْمَلائِكَةِ اسْجُدُوا لِآدَمَ فَسَجَدُوا إِلَّا إِبْلِيسَ أَبى ",
          "ثُمَّ أَوْحَى إِلَيْهِ يَا مُحَمَّدُ إِنِّي أَمَرْتُ فَلَمْ أُطَعْ فَلَا تَجْزَعْ أَنْتَ إِذَا أَمَرْتَ فَلَمْ تُطَعْ فِي وَصِيِّكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from the one who informed him, ",
            "(It has been narrated) from Ali son of Ja’far<sup>asws</sup> who said, ‘I heard Abu Al-Hassan<sup>asws</sup> saying: ‘When Rasool-Allah<sup>saww</sup> saw (in a dream), the Clans of Taym and Aday and the Clan of Umayya riding his<sup>saww</sup> Pulpit, it made him<sup>saww</sup> feel terrible. So Allah<sup>azwj</sup> Blessed and High Revealed Quran to Comfort him<sup>saww</sup> by it <span class=\"ibTxt\">[2:34] And when We said to the Angels: Prostrate to Adam! So they (all) Prostrated except for Iblees. He refused</span>. ",
            "Then He<sup>azwj</sup> Revealed unto him<sup>saww</sup>: “O Muhammad<sup>saww</sup>! I<sup>azwj</sup> Commanded, but they did not obey, so you<sup>saww</sup> should not be anxious when you<sup>saww</sup> command and they do not obey you<sup>saww</sup> regarding your<sup>saww</sup> successor<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 73. Muhammad in Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from al-Husayn ibn Na‘im al-Sahhaf who has said the following. “I asked abu ‘Abdallah (a.s.) about the words of Allah. “. . some of you have accepted the faith and some of you have not. .” (64:2) The Imam (a.s.) said, “Allah, the Most Majestic, the Most gracious, has defined their faith through their love for us. He has defined their disbelief in the same fact. This took place on the day He asked all the offspring of Adam (in the form of minute beings) to make a covenant.” I then asked him about the words of Allah, the Most Majestic, the Most gracious. “Obey God and the Messenger, but if you turn away, know that the only duty of Our Messenger is to clearly preaCh” (64:12). The Imam (a.s.) said, “By Allah, no one of those who were destroyed before or those who will be destroyed up to the time of the rise of al-Mahdi with Divine Authority but because of disregarding of our Wilaya (Leadership with Divine Authority) and the denial of our rights. The Messenger of Allah did not leave this world before establishing the great responsibility on this ’Umma to observe our rights. Allah guides to the right path whomever he wants.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (91/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1155,
        "local_index": 74,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:74",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْحُسَيْنِ بْنِ نُعَيْمٍ الصَّحَّافِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِهِ فَمِنْكُمْ كافِرٌ وَ مِنْكُمْ مُؤْمِنٌ فَقَالَ عَرَفَ اللَّهُ عَزَّ وَ جَلَّ إِيمَانَهُمْ بِمُوَالَاتِنَا وَ كُفْرَهُمْ بِهَا يَوْمَ أَخَذَ عَلَيْهِمُ الْمِيثَاقَ وَ هُمْ ذَرٌّ فِي صُلْبِ آدَمَ",
          "وَ سَأَلْتُهُ عَنْ قَوْلِهِ عَزَّ وَ جَلَّ أَطِيعُوا اللَّهَ وَ أَطِيعُوا الرَّسُولَ فَإِنْ تَوَلَّيْتُمْ فَإِنَّما عَلى رَسُولِنَا الْبَلاغُ الْمُبِينُ فَقَالَ أَمَا وَ اللَّهِ مَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ وَ مَا هَلَكَ مَنْ هَلَكَ حَتَّى يَقُومَ قَائِمُنَا ( عليه السلام ) إِلَّا فِي تَرْكِ وَلَايَتِنَا وَ جُحُودِ حَقِّنَا وَ مَا خَرَجَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مِنَ الدُّنْيَا حَتَّى أَلْزَمَ رِقَابَ هَذِهِ الْأُمَّةِ حَقَّنَا وَ اللَّهُ يَهْدِي مَنْ يَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Al Husayn Bin Nuaym Al Sahhaf who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about His<sup>azwj</sup> Words <span class=\"ibTxt\">[64:2] so among you is an unbeliever and among you is a Believer</span>. So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Recognised their <span class=\"iTxt\">Eman</span> by their Wilayah for us<sup>asws</sup> and their disbelief with it on the day He<sup>azwj</sup> Took the Covenant upon them, and they were particles in the ‘<span class=\"iTxt\">Sulb</span>’ of Adam<sup>as</sup>’. ",
            "And I asked him<sup>asws</sup> about the Words of the Mighty and Majestic <span class=\"ibTxt\">[64:12] And obey Allah and obey the Rasool, but if you turn back, then upon Our Rasool devolves only the clear delivery (of the Message)</span>. So he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! The ones before you were not destroyed and the ones who are destroyed until the rising of Al-Qaim<sup>asws</sup> will not be destroyed except with regards to neglecting our<sup>asws</sup> Wilayah, and denying our<sup>asws</sup> rights; and Rasool-Allah<sup>saww</sup> did not exit from the world until he<sup>saww</sup> necessitated the necks of this community to our<sup>asws</sup> rights. <span class=\"ibTxt\">[2:213] and Allah Guides whom He so Desires to, to the Straight Path</span>’."
          ],
          "en.sarwar": [
            " 74. Muhammad ibn al-Hassan and Ali ibn Muhammad have narrated from Sahl ibn Ziyad from Musa ibn al-Qasim al-Bajaliy from Ali ibn Ja‘far from his brother Musa (a.s.) about the words of Allah, the Most High. “. . their lofty mansions, all were toppled and their wells were left idle.” (22:45) The Imam (a.s.) said, “The abandoned well and idle well refers to the silent Imam and lofty mansion refers to the speaking Imam.” Muhammad ibn Yahya has narrated a similar hadith from al-‘Amrakifm Ali ibn Ja‘far from abu al-Hassan (a.s.)."
          ]
        }
      },
      {
        "index": 1156,
        "local_index": 75,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:75",
        "text": [
          "مُحَمَّدُ بْنُ الْحَسَنِ وَ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُوسَى بْنِ الْقَاسِمِ الْبَجَلِيِّ عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَخِيهِ مُوسَى ( عليه السلام ) فِي قَوْلِهِ تَعَالَى وَ بِئْرٍ مُعَطَّلَةٍ وَ قَصْرٍ مَشِيدٍ قَالَ الْبِئْرُ الْمُعَطَّلَةُ الْإِمَامُ الصَّامِتُ وَ الْقَصْرُ الْمَشِيدُ الْإِمَامُ النَّاطِقُ.",
          "وَ رَوَاهُ مُحَمَّدُ بْنُ يَحْيَى عَنِ الْعَمْرَكِيِّ عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Hassan and Ali Bin Muhammad, from Sahl Bin Ziyad, from Musa Bin Al Qasim Al Bajaly, ",
            "(It has been narrated) from Ali son of Ja’far<sup style=\"font-weight: normal\">asws</sup>, from his brother<sup style=\"font-weight: normal\">asws</sup> Musa<sup style=\"font-weight: normal\">asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\">[22:45] and an abandoned well and a constructed palace (deserted)</span>, He<sup style=\"font-weight: normal\">asws</sup> said: ‘The abandoned well is the silent Imam<sup style=\"font-weight: normal\">asws</sup>, and the constructed palace (deserted) is the speaking Imam<sup style=\"font-weight: normal\">asws</sup>’. ",
            "<span style=\"font-size: small\">And it is reported by Muhammad Bin Yahya, from Al Amraky, </span>from Ali son of Ja’far<sup>asws</sup>, from Abu Al Hassan<sup>asws</sup>, similar to it."
          ],
          "en.sarwar": [
            " 75. Ali ibn Ibrahim has narrated from his father from al-Hakam ibn al-Buhlul from a man frm abu ‘Abdallah (a.s.) about the words of Allah, the Most High. ““It has been revealed to you and to those who lived before you that if you consider other things equal to God, your deeds will be made devoid of all virtue. .” (39:65). The Imam (a.s.) said, “It means equal in Wilaya.” “(Muhammad), You must worship God alone and give Him thanks.” (39:66). The Imam (a.s.) said, “It means worship Allah through obedience and be thankful if I provided you support through your brother, your cousin.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/94)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1157,
        "local_index": 76,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:76",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْحَكَمِ بْنِ بُهْلُولٍ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِهِ تَعَالَى وَ لَقَدْ أُوحِيَ إِلَيْكَ وَ إِلَى الَّذِينَ مِنْ قَبْلِكَ لَئِنْ أَشْرَكْتَ لَيَحْبَطَنَّ عَمَلُكَ قَالَ يَعْنِي إِنْ أَشْرَكْتَ فِي الْوَلَايَةِ غَيْرَهُ بَلِ اللَّهَ فَاعْبُدْ وَ كُنْ مِنَ الشَّاكِرِينَ يَعْنِي بَلِ اللَّهَ فَاعْبُدْ بِالطَّاعَةِ وَ كُنْ مِنَ الشَّاكِرِينَ أَنْ عَضَدْتُكَ بِأَخِيكَ وَ ابْنِ عَمِّكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Hakam Bin Bahloul, from a man, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of the Exalted <span class=\"ibTxt\">[39:65] And it was Revealed to you and to those before you: If you associate, your deeds would be confiscated</span>. He<sup>asws</sup> said: ‘It Means that if you were to associate in the Wilayah other than him<sup>asws</sup>. <span class=\"ibTxt\">[39:66] But Allah alone should you worship and be of the thankful</span> – Meaning, Allah<sup>azwj</sup> should you worship by the obedience and be of the thankful ones that I<sup>azwj</sup> have Re-inforced you<sup>saww</sup> with your<sup>saww</sup> brother & cousin’."
          ],
          "en.sarwar": [
            " 76. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Ahmad ibn Muhammad from al-Hassan ibn Muhammad al-Hashimi who has said that his father narrated to him from Ahmad ibn ‘Isa who has said that Ja‘far ibn Muhammad narrated to me from his father and from his grand father about the words of Allah, the Most Majestic, the Most gracious. “They recognize the bounties of God but they refuse them . .” (16:83). The Imam (a.s.) said that once this verse was revealed. “Only God, His Messenger, and the true believers who are steadfast in prayer and pay alms, while they kneel during prayer, are your guardians” (5:55) Certain persons gathered in the Mosque of Madina. They said, ‘If we reject this verse we would have rejected the rest of them. However, if we would accept it would be humiliating for us when Ali ibn abu Talib (a.s.) would take control. They said, “We have learned that Muhammad (s.a) is truthful in all that has said but we will turn away and will not obey his command to obey Ali.” The Imam (a.s.) said that up on this verse was revealed. “They recognize the bounties of God but they refuse them . .” (16:83) It means that they recognized Wilaya of Ali (a.s.) (Leadership with Divine Authority) but many of them have refused toacknowledge it.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (95/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1158,
        "local_index": 77,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:77",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الْهَاشِمِيِّ قَالَ حَدَّثَنِي أَبِي عَنْ أَحْمَدَ بْنِ عِيسَى قَالَ حَدَّثَنِي جَعْفَرُ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَدِّهِ ( عليه السلام ) فِي قَوْلِهِ عَزَّ وَ جَلَّ يَعْرِفُونَ نِعْمَتَ اللَّهِ ثُمَّ يُنْكِرُونَها قَالَ لَمَّا نَزَلَتْ إِنَّما وَلِيُّكُمُ اللَّهُ وَ رَسُولُهُ وَ الَّذِينَ آمَنُوا الَّذِينَ يُقِيمُونَ الصَّلاةَ وَ يُؤْتُونَ الزَّكاةَ وَ هُمْ راكِعُونَ اجْتَمَعَ نَفَرٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فِي مَسْجِدِ الْمَدِينَةِ ",
          "فَقَالَ بَعْضُهُمْ لِبَعْضٍ مَا تَقُولُونَ فِي هَذِهِ الْآيَةِ فَقَالَ بَعْضُهُمْ إِنْ كَفَرْنَا بِهَذِهِ الْآيَةِ نَكْفُرُ بِسَائِرِهَا وَ إِنْ آمَنَّا فَإِنَّ هَذَا ذُلٌّ حِينَ يُسَلِّطُ عَلَيْنَا ابْنَ أَبِي طَالِبٍ فَقَالُوا قَدْ عَلِمْنَا أَنَّ مُحَمَّداً صَادِقٌ فِيمَا يَقُولُ وَ لَكِنَّا نَتَوَلَّاهُ وَ لَا نُطِيعُ عَلِيّاً فِيمَا أَمَرَنَا ",
          "قَالَ فَنَزَلَتْ هَذِهِ الْآيَةُ يَعْرِفُونَ نِعْمَتَ اللَّهِ ثُمَّ يُنْكِرُونَها يَعْرِفُونَ يَعْنِي وَلَايَةَ عَلِيِّ بْنِ أَبِي طَالِبٍ وَ أَكْثَرُهُمُ الْكَافِرُونَ بِالْوَلَايَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Ahmad Bin Muhammad, from Al Hassan Bin Muhammad Al Hashimy who said, ‘My father narrated to me, from Ahmad Bin Isa who said, ",
            "‘Ja’far Bin Muhammad<sup>asws</sup> narrated to me, from his<sup>asws</sup> father<sup>asws</sup>, from his<sup>asws</sup> grandfather<sup>asws</sup> regarding the Words of the Mighty and Majestic <span class=\"ibTxt\">[16:83] They are recognising the Favour of Allah, then they are denying it</span>. He<sup>asws</sup> said: ‘When it was Revealed <span class=\"ibTxt\">[5:55] But rather, only Allah is your Guardian and His Rasool and those who believe, those who are establishing the Prayers and are paying the Zakat while bowing</span>, a number of the companions of Rasool-Allah<sup>saww</sup> gathered in the Masjid of Al-Medina.",
            "So some of them said to the others, ‘What are you saying regarding this Verse?’ So, some of them said, ‘If we were to disbelieve in this Verse, we would be disbelieving with the rest of it, and if we believe, so this would be a humiliation when the son<sup>asws</sup> of Abu Talib<sup>as</sup> would be empowered upon us’. So they said, ‘We have known that Muhammad<sup>saww</sup> is truthful in whatever he<sup>saww</sup> is saying, but we shall turn back on him<sup>saww</sup> and we will not obey Ali<sup>asws</sup> in what he<sup>saww</sup> is commanding us’. ",
            "He<sup>asws</sup> said: ‘Thus, this Verse was Revealed <span class=\"ibTxt\">[16:83] They are recognising the Favour of Allah, then they are denying it</span> – Meaning the Wilayah of Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, and most of them are disbelievers in the Wilayah’."
          ],
          "en.sarwar": [
            " 77. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn Mahbub from Muhammad ibn al-Ni‘man from Salam who has said the following. “I asked abu Ja‘far (a.s.) about the words of Allah, the Most High. “(Among) the servants of the Beneficent God are those who walk gently on the earth . .” (25:63) The Imam (a.s.) said, “They are the executors of the will (The Holy Prophet (s.a) who are afraid of their enemies.” Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Bastam ibn Murra from ishaq ibn Hassa’n from al-Haytham ibn Waqid from Ali ibn al-Husayn al-‘Abdi from Sa‘d al-’Iskaf from Asbagh ibn Nabata that he asked Amir al-Mu’minin (a.s.) about the words of Allah, the Most High. “. . to give thanks to Me first and then to them, (parents) to Me all things proceed (31:14).The Imam (a.s.) said, “The parents who must be thanked are the ones who provide knowledge, and leave wisdom as their legacy and people are commanded to obey them. Allah then has said, “. . to Me all things proceed.” (31:14) People proceed to Allah and the guide to such goal are the parents. Allah then has directed His words to ibn Hantama and his friend saying in particular and in general, “If they try to force you to consider things equal to Me,. .” (31:15) It speaks of the will of The Holy Prophet (s.a). It demands not to ignore the command to obey him (Ali (a.s.) otherwise, do not obey them (parents) and do not listen to them. Then Allah has directed His words to the parents. “Maintain lawful relations with them in this world. .” (31:15) It says that propagate the virtue and excellence of the (spiritual) parents and call people to their guidance which is also mentioned in these words of Allah. “. . and follow the path of those who turn in repentance to Me. To Me you will all return. .” (31:15) The Imam (a.s.) said, “To Allah then to us. You must be pious before Allah and do not disobey the parents. To please them is to please Allah and to cause them anger is to cause anger to Allah.”"
          ]
        }
      },
      {
        "index": 1159,
        "local_index": 78,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:78",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ مُحَمَّدِ بْنِ النُّعْمَانِ عَنْ سَلَّامٍ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ قَوْلِهِ تَعَالَى الَّذِينَ يَمْشُونَ عَلَى الْأَرْضِ هَوْناً قَالَ هُمُ الْأَوْصِيَاءُ مِنْ مَخَافَةِ عَدُوِّهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from Muhammad Bin Al Numan, from Sallam who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the Words of the Exalted <span class=\"ibTxt\">[25:63] And the servants of the Beneficent are they who walk on the earth modestly</span>. He<sup>asws</sup> said: ‘They<sup>asws</sup> are the successors<sup>asws</sup>, out of fear of their<sup>asws</sup> enemies’."
          ],
          "en.sarwar": [
            " 78. A number of our people has narrated from Ahmad ibn Muhammad from Ali ibn Sayf from his father from ‘Amr ibn Harith who has said the following. “I asked abu ‘Abdallah (a.s.) about the words of Allah. “. . a blessed tree which has firm roots and branches rising up into the sky.” (14:24) The Imam (a.s.) said that the The Holy Prophet (s.a) said, “The root is Amir al-Mu’minin Ali (a.s.) and the branches are the Imams from their (Amir al-Mu’minin (a.s.) and The Holy Prophet (s.a) descendants and the knowledge of Imams stand for the fruits. Their faithful followers represent the leaves of such tree.” The Imam (a.s.) asked, “Is there anything else in the tree?” I said, “No, there is nothing else there. The Imam (a.s.) then said, “By Allah, when a faithful is given a child a leave grows in the tree and when a faithful dies a leave falls off the tree.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (97/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1160,
        "local_index": 79,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:79",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ بِسْطَامَ بْنِ مُرَّةَ عَنْ إِسْحَاقَ بْنِ حَسَّانَ عَنِ الْهَيْثَمِ بْنِ وَاقِدٍ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ الْعَبْدِيِّ عَنْ سَعْدٍ الْإِسْكَافِ عَنِ الْأَصْبَغِ بْنِ نُبَاتَةَ أَنَّهُ سَأَلَ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) عَنْ قَوْلِهِ تَعَالَى أَنِ اشْكُرْ لِي وَ لِوالِدَيْكَ إِلَيَّ الْمَصِيرُ فَقَالَ الْوَالِدَانِ اللَّذَانِ أَوْجَبَ اللَّهُ لَهُمَا الشُّكْرَ هُمَا اللَّذَانِ وَلَدَا الْعِلْمَ وَ وَرِثَا الْحُكْمَ وَ أُمِرَ النَّاسُ بِطَاعَتِهِمَا ثُمَّ قَالَ اللَّهُ إِلَيَّ الْمَصِيرُ فَمَصِيرُ الْعِبَادِ إِلَى اللَّهِ وَ الدَّلِيلُ عَلَى ذَلِكَ الْوَالِدَانِ ",
          "ثُمَّ عَطَفَ الْقَوْلَ عَلَى ابْنِ حَنْتَمَةَ وَ صَاحِبِهِ فَقَالَ فِي الْخَاصِّ وَ الْعَامِّ وَ إِنْ جاهَداكَ عَلى أَنْ تُشْرِكَ بِي يَقُولُ فِي الْوَصِيَّةِ وَ تَعْدِلُ عَمَّنْ أُمِرْتَ بِطَاعَتِهِ فَلَا تُطِعْهُمَا وَ لَا تَسْمَعْ قَوْلَهُمَا ",
          "ثُمَّ عَطَفَ الْقَوْلَ عَلَى الْوَالِدَيْنِ فَقَالَ وَ صاحِبْهُما فِي الدُّنْيا مَعْرُوفاً يَقُولُ عَرِّفِ النَّاسَ فَضْلَهُمَا وَ ادْعُ إِلَى سَبِيلِهِمَا وَ ذَلِكَ قَوْلُهُ وَ اتَّبِعْ سَبِيلَ مَنْ أَنابَ إِلَيَّ ثُمَّ إِلَيَّ مَرْجِعُكُمْ ",
          "فَقَالَ إِلَى اللَّهِ ثُمَّ إِلَيْنَا فَاتَّقُوا اللَّهَ وَ لَا تَعْصُوا الْوَالِدَيْنِ فَإِنَّ رِضَاهُمَا رِضَا اللَّهِ وَ سَخَطَهُمَا سَخَطَ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Bastam Bin Murra, from Is’haq Bin Hassan, from Al Haysam Bin Waqid, from Ali Bin Al Husayn Al Abady, from Sa’d Al Askaf, ",
            "(It has been narrated) from Al-Asbagh Bin Nubata who asked Amir Al-Momineen<sup>asws</sup> about the Words of the Exalted <span class=\"ibTxt\">[31:14] Be grateful to Me and to both your parents; to Me is the eventual journey</span>. So he<sup>asws</sup> said: ‘The two parent from whom Allah<sup>azwj</sup> Obligated the gratefulness, they are those who produced the knowledge and gave the wisdom as an inheritance, and the people are Commanded with obeying them. Then Allah<sup>azwj</sup> Said <span class=\"ibTxt\">to Me is the eventual journey</span>. So the journey of the servants is to Allah<sup>azwj</sup>, and the pointers upon that are the two parents. ",
            "Then He<sup>azwj</sup> Turned the Words upon Ibn Hantama and his companions, so He<sup>azwj</sup> Said regarding the specials ones and the general ones <span class=\"ibTxt\">[31:15] And if they contend with you that you should associate with Me </span>regarding the successorship and equate with the ones whom you have been Commanded with his<sup>asws</sup> obedience, <span class=\"ibTxt\">do not obey the two of them</span> and do not listen to their words’. ",
            "Then He<sup>azwj</sup> Turned the Words upon the two parents, so He<sup>azwj</sup> Said <span class=\"ibTxt\">and keep company with the two of them in the world kindly</span>. He<sup>azwj</sup> is Saying to introduce the people to their<sup>asws</sup> merits and call to their<sup>asws</sup> ways, and that is in His<sup>azwj</sup> Words <span class=\"ibTxt\">and follow the way of him who turns to Me, then to Me is your return</span>. ",
            "So he<sup>asws</sup> said: ‘To Allah<sup>azwj</sup>, then to us<sup>asws</sup>, therefore fear Allah<sup>azwj</sup> do not disobey the two (spiritual) parents (Muhammad<sup>saww</sup> and Ali<sup>asws</sup>), for their<sup>asws</sup> pleasure is the Pleasure of Allah<sup>azwj</sup>, and their<sup>asws</sup> anger is the Anger of Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            " 79. Muhammad ibn Yahya has narrated from Hamdan ibn Sulayman from ‘Abdallah ibn Muhammad al-Yamani from Mani‘ ibn al-Hajjaj from Yunus from Hisham ibn al-Hakam from abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “. . the belief of any soul will be of no avail to it unless some good deeds have been done with it. .” (6:158) The Imam (a.s.) said, “It means to acknowledge the prophets and the executors of their wills especially Amir al-Mu’minin Ali (a.s.).” The Imam (a.s.) said, “The faith of a soul will not be of any benefit because it will be removed.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (102/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1161,
        "local_index": 80,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:80",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ سَيْفٍ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ حُرَيْثٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ كَشَجَرَةٍ طَيِّبَةٍ أَصْلُها ثابِتٌ وَ فَرْعُها فِي السَّماءِ قَالَ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَصْلُهَا وَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَرْعُهَا وَ الْأَئِمَّةُ مِنْ ذُرِّيَّتِهِمَا أَغْصَانُهَا وَ عِلْمُ الْأَئِمَّةِ ثَمَرَتُهَا وَ شِيعَتُهُمُ الْمُؤْمِنُونَ وَرَقُهَا هَلْ فِيهَا فَضْلٌ قَالَ قُلْتُ لَا وَ اللَّهِ قَالَ وَ اللَّهِ إِنَّ الْمُؤْمِنَ لَيُولَدُ فَتُورَقُ وَرَقَةٌ فِيهَا وَ إِنَّ الْمُؤْمِنَ لَيَمُوتُ فَتَسْقُطُ وَرَقَةٌ مِنْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Sayf, from his father, from Amro Bin Hureys who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> <span class=\"ibTxt\">[14:24] like a good tree, whose root is firm and whose branches are in the sky</span>. So he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> is its root and Amir Al-Momineen<sup>asws</sup> its branch are the Imams<sup>asws</sup> from their<sup>asws</sup> (Rasool-Allah<sup>saww</sup> and Amir Al-Momineen<sup>asws</sup>) descendants, and the knowledge of the Imams<sup>asws</sup> stands for the fruits, and their<sup>asws</sup> Shias, the Momineen are its leaves. Is there any excess in this?’ I said, ‘No, by Allah<sup>azwj</sup>’. He<sup>asws</sup> said: ‘The <span class=\"iTxt\">Momin </span>is born, so a leaf sprouts in it, and if the <span class=\"iTxt\">Momin </span>dies, so a leaf falls from it’."
          ],
          "en.sarwar": [
            " 80. Through the same chain of narrators it is narrated from Yunus from Sabah al-Muzniy from abu Hamza from one of them (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “There is no doubt that evil doers who are engulfed in sins -rejected Wilaya of Amir al-Mu’minin Ali (a.s.)- are the companions of hell fire wherein they will live forever.” (2:81) A number of our people has narrated from Ahmad ibn Muhammad ibn abu Nasr from Hammad ibn ‘Uthman from abu ‘Ubayda al-Hadhdha’ who has said the following. “I asked abu Ja‘far (a.s.) about the capability and the people’s words. The Imam (a.s.) recited this verse of the Holy Quran. “They still have different beliefs (11:118) except those upon whom God has granted His mercy. God has created them to receive mercy. . .” (11:119) O abu ‘Ubayda, people face differences in search for truth and all of them will be destroyed.” The narrator has said that I then said, “Except those who receive mercy from Allah. (11:119)” The Imam (a.s.) said, “Such people are our followers whom He has created for His mercy. “God has created them to receive mercy. . .” (11:119) He has said that they are created to obey the Imam of blessings that He has mentioned in His words “My mercy and blessings have encompassed all things”. Such blessing is the knowledge of Imam. His (Imams’) knowledge which is from His knowledge that has encompassed all things. They are our Shi‘a, followers). Then He has said, “. . I shall grant mercy to those who maintain piety, (do not acknowledge the authority of those who are not Imams and obedience to them). ..” (7:156) Then Allah has said, “. . whose description they find written in the Torah and the Gospel.(The Holy Prophet, the executor of his will and Al-Qa’im (the one who will rise with Divine Authority). He (the Messengers) enjoins them to do good (when he will rise with Divine Authority) and forbids them to do all that is unlawful, -Munkar (unlawful) is one who does not acknowledge the Wilaya of Imam) makes lawful for them all that is pure (receive knowledge from its proper source) and unlawful all that is filthy, (the words of those who oppose the Imam are filthy) removes their burdens (the sins that they had before acknowledging Wilaya of the Imam (Leadership with Divine Authority) and the entanglements in which they are involved (the entanglements are the words that they were not commanded to express. Such words were not in praise and virtue of the Imam. When they recognized the excellence of the Imam He removed their burden. Such burden is the sin. Then He further explains about them) Those who believe in him, (the Imam) honor and help him, and follow the light which is sent down to him, will have everlasting happiness.”. (7:157) (Such people are those who kept away from the worship of the Devil and Satan. So and so are Devil and Satan. Worship is people’s obeying them. Allah then has said, “Turn to God in repentance and submit to Him. .” (39:56). Then He has granted them rewards. “. . will receive glad news both in this life and in the life hereafter. .” (10:64) (Imam gives them the glad news of the rise of al-Mahdi with Divine Authority, the news of the destruction of their enemies and salvation in the hereafter and their meeting Ali and Muhammad (s.a) and their truthful family at pond of al-Kawthar).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/105)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1162,
        "local_index": 81,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:81",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ حَمْدَانَ بْنِ سُلَيْمَانَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ الْيَمَانِيِّ عَنْ مَنِيعِ بْنِ الْحَجَّاجِ عَنْ يُونُسَ عَنْ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ لا يَنْفَعُ نَفْساً إِيمانُها لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ يَعْنِي فِي الْمِيثَاقِ أَوْ كَسَبَتْ فِي إِيمانِها خَيْراً قَالَ الْإِقْرَارُ بِالْأَنْبِيَاءِ وَ الْأَوْصِيَاءِ وَ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) خَاصَّةً قَالَ لَا يَنْفَعُ إِيمَانُهَا لِأَنَّهَا سُلِبَتْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Hamdan Bin Suleyman, from Abdullah Bin Muhammad Al Yamani, from Mani’e Bin Al Hajjaj, from Yunus, from Hisham Bin Al Hakam, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[6:158] its faith shall not profit a soul, which did not believe before</span> – Meaning during the Covenant, <span class=\"ibTxt\">or earn good through its faith</span>. He<sup>asws</sup> said: ‘The acknowledgement with the Prophets<sup>as</sup> and the succesors<sup>as</sup> and Amir Al-Momineen<sup>asws</sup> in particular’. He<sup>asws</sup> said: ‘Its <span class=\"iTxt\">Eman</span> would not benefit it because it would have been Confiscated’."
          ],
          "en.sarwar": [
            " 81. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from ibn Mahbub from Hisham ibn Salim from ‘Ammar al-Sabati who has said the following. “I asked abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “Are those who seek God’s pleasure equal to those who incur His wrath and whose dwelling will be hell, the terrible destination? (3:162) People are of various grades in the sight of God. .” (3:163) The Imam (a.s.) said, “Those who follow what Allah is pleased are the Imams. They, by Allah, O ‘Ammar, give grades and degrees to the true believers. By means of our Wilaya (Leadership and guardian ship with Divine Authority) and their acknowledgment of us Allah increases the reward for their good deeds and (Allah) raises them to higher positions.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (106/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1163,
        "local_index": 82,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:82",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ عَنْ يُونُسَ عَنْ صَبَّاحٍ الْمُزَنِيِّ عَنْ أَبِي حَمْزَةَ عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي قَوْلِ اللَّهِ جَلَّ وَ عَزَّ بَلى مَنْ كَسَبَ سَيِّئَةً وَ أَحاطَتْ بِهِ خَطِيئَتُهُ قَالَ إِذَا جَحَدَ إِمَامَةَ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَأُولئِكَ أَصْحابُ النَّارِ هُمْ فِيها خالِدُونَ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, from Yunus, from Sabbah Al Muzanny, from Abu Hamza, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) regarding the Words of Allah<sup>azwj</sup> Majestic and Mighty <span class=\"ibTxt\">[2:81] Yes! Whoever earns evil and his sins beset him on every side</span>. He<sup>asws</sup> said: ‘When they denied the Imamate of Amir Al-Momineen<sup>asws</sup>, <span class=\"ibTxt\">so these are the inmates of the Fire; in it they shall be abiding</span>’."
          ],
          "en.sarwar": [
            " 82. Ali ibn Muhammad and others have narrated from sahl ibn Ziyad from ya‘qub ibn Yazid from Ziyad al-Qandi from ‘Ammar al-’Asadi from abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “. . Good words (worship) will be presented before Him and He will accept good deeds. . .” (35:10) The Imam (a.s.) said, “It is our Wilaya Leadership and Guardianship with Divine Authority. He made a gesture with his hands to his own chest saying Allah will not raise the deeds of those who would not acknowledge our Wilaya.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/107)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1164,
        "local_index": 83,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:83",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ أَبِي عُبَيْدَةَ الْحَذَّاءِ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الِاسْتِطَاعَةِ وَ قَوْلِ النَّاسِ فَقَالَ وَ تَلَا هَذِهِ الْآيَةَ وَ لا يَزالُونَ مُخْتَلِفِينَ إِلَّا مَنْ رَحِمَ رَبُّكَ وَ لِذلِكَ خَلَقَهُمْ يَا أَبَا عُبَيْدَةَ النَّاسُ مُخْتَلِفُونَ فِي إِصَابَةِ الْقَوْلِ وَ كُلُّهُمْ هَالِكٌ قَالَ قُلْتُ قَوْلُهُ إِلَّا مَنْ رَحِمَ رَبُّكَ قَالَ هُمْ شِيعَتُنَا وَ لِرَحْمَتِهِ خَلَقَهُمْ وَ هُوَ قَوْلُهُ وَ لِذلِكَ خَلَقَهُمْ",
          "يَقُولُ لِطَاعَةِ الْإِمَامِ الرَّحْمَةُ الَّتِي يَقُولُ وَ رَحْمَتِي وَسِعَتْ كُلَّ شَيْ‏ءٍ يَقُولُ عِلْمُ الْإِمَامِ وَ وَسِعَ عِلْمُهُ الَّذِي هُوَ مِنْ عِلْمِهِ كُلَّ شَيْ‏ءٍ هُمْ شِيعَتُنَا",
          "ثُمَّ قَالَ فَسَأَكْتُبُها لِلَّذِينَ يَتَّقُونَ يَعْنِي وَلَايَةَ غَيْرِ الْإِمَامِ وَ طَاعَتَهُ ثُمَّ قَالَ يَجِدُونَهُ مَكْتُوباً عِنْدَهُمْ فِي التَّوْراةِ وَ الْإِنْجِيلِ يَعْنِي النَّبِيَّ ( صلى الله عليه وآله ) وَ الْوَصِيَّ وَ الْقَائِمَ يَأْمُرُهُمْ بِالْمَعْرُوفِ إِذَا قَامَ وَ يَنْهاهُمْ عَنِ الْمُنْكَرِ وَ الْمُنْكَرُ مَنْ أَنْكَرَ فَضْلَ الْإِمَامِ وَ جَحَدَهُ وَ يُحِلُّ لَهُمُ الطَّيِّباتِ أَخْذَ الْعِلْمِ مِنْ أَهْلِهِ وَ يُحَرِّمُ عَلَيْهِمُ الْخَبائِثَ وَ الْخَبَائِثُ قَوْلُ مَنْ خَالَفَ ",
          "وَ يَضَعُ عَنْهُمْ إِصْرَهُمْ وَ هِيَ الذُّنُوبُ الَّتِي كَانُوا فِيهَا قَبْلَ مَعْرِفَتِهِمْ فَضْلَ الْإِمَامِ وَ الْأَغْلالَ الَّتِي كانَتْ عَلَيْهِمْ وَ الْأَغْلَالُ مَا كَانُوا يَقُولُونَ مِمَّا لَمْ يَكُونُوا أُمِرُوا بِهِ مِنْ تَرْكِ فَضْلِ الْإِمَامِ فَلَمَّا عَرَفُوا فَضْلَ الْإِمَامِ وَضَعَ عَنْهُمْ إِصْرَهُمْ وَ الْإِصْرُ الذَّنْبُ وَ هِيَ الْآصَارُ ",
          "ثُمَّ نَسَبَهُمْ فَقَالَ فَالَّذِينَ آمَنُوا بِهِ يَعْنِي بِالْإِمَامِ وَ عَزَّرُوهُ وَ نَصَرُوهُ وَ اتَّبَعُوا النُّورَ الَّذِي أُنْزِلَ مَعَهُ أُولئِكَ هُمُ الْمُفْلِحُونَ يَعْنِي الَّذِينَ اجْتَنَبُوا الْجِبْتَ وَ الطَّاغُوتَ أَنْ يَعْبُدُوهَا وَ الْجِبْتُ وَ الطَّاغُوتُ فُلَانٌ وَ فُلَانٌ وَ فُلَانٌ وَ الْعِبَادَةُ طَاعَةُ النَّاسِ لَهُمْ ثُمَّ",
          "قَالَ أَنِيبُوا إِلى رَبِّكُمْ وَ أَسْلِمُوا لَهُ ثُمَّ جَزَاهُمْ فَقَالَ لَهُمُ الْبُشْرى فِي الْحَياةِ الدُّنْيا وَ فِي الْآخِرَةِ وَ الْإِمَامُ يُبَشِّرُهُمْ بِقِيَامِ الْقَائِمِ وَ بِظُهُورِهِ وَ بِقَتْلِ أَعْدَائِهِمْ وَ بِالنَّجَاةِ فِي الْآخِرَةِ وَ الْوُرُودِ عَلَى مُحَمَّدٍ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ آلِهِ الصَّادِقِينَ عَلَى الْحَوْضِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Abu Nasr, from Hammad Bin Usman, from Abu Ubeyda Al Haza’a who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the capability and the words of the people. So he<sup>asws</sup> said and recited this Verse: ‘<span class=\"ibTxt\">[11:118] and they will not stop differing [11:119] Except for those on whom your Lord has Mercy; and it is for that did He Create them</span>. He<sup>asws</sup> said: ‘O Abu Ubeyda! The people are differing regarding the correct words, and all of them are destroyed’. I said, ‘(But what about) His<sup>azwj</sup> Words <span class=\"ibTxt\">11:119] Except for those on whom your Lord has Mercy</span>?’ He<sup>asws</sup> said: ‘These are our<sup>asws</sup> Shias, and it is for His<sup>azwj</sup> Mercy did He<sup>azwj</sup> Create them, and it is in His<sup>azwj</sup> Words <span class=\"ibTxt\">and it is for that did He Create them</span>. ",
            "He<sup>azwj</sup> is Saying for the obedience of the Imam<sup>asws</sup> of the Mercy which He<sup>azwj</sup> is Saying <span class=\"ibTxt\">[7:156] and My Mercy encompasses all things</span>. He<sup>azwj</sup> is Saying that the knowledge of the Imam<sup>asws</sup> and that which is from his<sup>asws</sup> knowledge encompasses everything, they being our<sup>asws</sup> Shias’. ",
            "Then He<sup>azwj</sup> Said <span class=\"ibTxt\">so I will Ordain it (specially) for those who are fearing</span>, Meaning the wilayah of another imam (leader) and his obedience. Then He<sup>azwj</sup> Said <span class=\"ibTxt\">[7:157] whom they find written down with them in the Torah and the Evangel </span>Meaning the Prophet<sup>saww</sup> and the successor<sup>asws</sup> and Al-Qaim<sup>asws</sup> <span class=\"ibTxt\">(who) enjoins them good </span>when he<sup>asws</sup> rises <span class=\"ibTxt\">and forbids them from the evil</span>, the one who denies the merits of the Imam<sup>asws</sup> and rejects it. <span class=\"ibTxt\">and makes lawful to them the good things</span>, taking of the knowledge from its rightful ones, <span class=\"ibTxt\">and makes unlawful to them bad things</span>, and the bad things are the words of the one who opposes. ",
            "<span class=\"ibTxt\">And removes from them their burden </span>and these are the sins which they used to be in before their recognition of the merits of the Imam<sup>asws</sup>, <span class=\"ibTxt\">and the shackles which were upon </span>and the shackles of what they were saying from what they did not happen to have been ordered with, from neglecting the merits of the Imams<sup>asws</sup>. So when they do recognise the merits of the Imam<sup>asws</sup>, their offences would be removed from them, and the offence is the sin, and it is the offence’. ",
            "Then He<sup>azwj</sup> Linked them, so He<sup>azwj</sup> Said <span class=\"ibTxt\">so (as for) those who believe in him </span>Meaning the Imam<sup>asws</sup>, <span class=\"ibTxt\">and honour him and help him, and follow the Light which has been Sent down with him, these it is that are the successful</span>. Meaning those who kept aside from the ‘Jibt’ and ‘Taghoot’. And the ‘Jibt’ and ‘Taghoot’ is so and so, and so and so, and so and so, and the worship is the obedience of the people to them’. ",
            "<span class=\"ibTxt\">[39:54] And return to your Lord time after time and submit to Him</span>. Then He<sup>azwj</sup> Recompensed them so He<sup>azwj</sup> Said <span class=\"ibTxt\">[10:64] For them is good news in the life of the world and in the Hereafter</span>. And the Imam<sup>asws</sup> gives them the good news of the rising of Al-Qaim<sup>asws</sup> and of his<sup>asws</sup> appearance, and of the killing of their enemies, and of the salvation in the Hereafter, and the return to Muhammad<sup>saww</sup>, may Allah<sup>azwj</sup> Send <span class=\"iTxt\">Salawat</span> upon Muhammad<sup>saww</sup> and his<sup>saww</sup> Progeny<sup>asws</sup>, the truthful, at the Fountain’."
          ],
          "en.sarwar": [
            " 83. A number of our people has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from al-Qasim ibn Sulayman from Sama‘a from abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “. . God will grant you a double share of mercy, ( al-Hassan and al-Husayn ) a light by which you can walk. .” (57:28) The Imam (a.s.) said, “Light means the Imam that you would follow.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (118/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1165,
        "local_index": 84,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:84",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ عَمَّارٍ السَّابَاطِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ أَ فَمَنِ اتَّبَعَ رِضْوانَ اللَّهِ كَمَنْ باءَ بِسَخَطٍ مِنَ اللَّهِ وَ مَأْواهُ جَهَنَّمُ وَ بِئْسَ الْمَصِيرُ هُمْ دَرَجاتٌ عِنْدَ اللَّهِ ",
          "فَقَالَ الَّذِينَ اتَّبَعُوا رِضْوَانَ اللَّهِ هُمُ الْأَئِمَّةُ وَ هُمْ وَ اللَّهِ يَا عَمَّارُ دَرَجَاتٌ لِلْمُؤْمِنِينَ وَ بِوَلَايَتِهِمْ وَ مَعْرِفَتِهِمْ إِيَّانَا يُضَاعِفُ اللَّهُ لَهُمْ أَعْمَالَهُمْ وَ يَرْفَعُ اللَّهُ لَهُمُ الدَّرَجَاتِ الْعُلَى ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Ibn Mahboub, from Hisham Bin Salim, from Ammar Al Sabaty who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[3:162] Is then he who follows the Pleasure of Allah like him who has made himself deserving of Wrath from Allah, and his abode is Hell; and it is an evil destination [3:163] There are (varying) Levels with Allah</span>. ",
            "So he<sup>asws</sup> said: ‘Those who are following the Pleasure of Allah<sup>azwj</sup>, they<sup>asws</sup> are the Imams<sup>asws</sup>, O Ammar!. There are varying levels for the Momineen (followers of 12 Imams<sup>asws</sup>), and by their Wilayah and their recognition (understanding) of us<sup>asws</sup>. Allah<sup>azwj</sup> would Multiply their deeds for them and Allah<sup>azwj</sup> would Raise for them the lofty levels’."
          ],
          "en.sarwar": [
            " 84. Ali ibn Ibrahim has narrated from his father from al-Qasim ibn Muhammad al-Jawhari from certain persons of his people from abu ‘Abdallah (a.s.) about the words of Allah. “They ask you, “Is that true?”(The Imam (a.s.) said, “It means what do you say about Ali (a.s.)?” Tell them, “It certainly is true. I swear by my Lord. You can not escape from God’s (retribution).” (10:53)"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/119)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1166,
        "local_index": 85,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:85",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ وَ غَيْرُهُ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنْ زِيَادٍ الْقَنْدِيِّ عَنْ عَمَّارٍ الْأَسَدِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ وَ الْعَمَلُ الصَّالِحُ يَرْفَعُهُ وَلَايَتُنَا أَهْلَ الْبَيْتِ وَ أَهْوَى بِيَدِهِ إِلَى صَدْرِهِ فَمَنْ لَمْ يَتَوَلَّنَا لَمْ يَرْفَعِ اللَّهُ لَهُ عَمَلًا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad and someone else, from Sahl Bin Ziyad, from Yaqoub Bin Yazeed, from Ziyad Al Qindy, from Ammar Al Asady, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[35:10] To Him do ascend the good words; and the good deeds lift them up</span> – our<sup>asws</sup> Wilayah of the People<sup>asws</sup> of the Household’, and he<sup>asws</sup> gestured by his<sup>asws</sup> hand to his<sup>asws</sup> chest, (then said): ‘So the one who does not have our<sup>asws</sup> Wilayah, Allah<sup>azwj</sup> will not Raise his deed for him’ (none of his deeds will be accepted)."
          ],
          "en.sarwar": [
            " 85. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Muhammad ibn Sulayman al-Daylami from his father from Aban ibn Taghlib who has said the following. “I said to abu ‘Abdallah (a.s.), “May Allah take my soul in service for your cause, what is the meaning of the words of Allah, “Yet, he has not entered into ö aqaba.” (90:11) The Imam (a.s.) said, “To whoever Allah has granted honor through our Wilaya (Leadership with Divine Authority) he has crossed the ö aqaba (the stage). We are the ö aqaba. Whoever would reach us gains his salvation.” The narrator has said that he remained quite for a while and then said to me, “Would to learn a letter from that would be better for you than the whole world and all that is therein?” I said, “yes, May Allah take my soul in service for your cause.” He then said, “It is the setting free of a slave.” Then he said, “All people are slaves of fire. except you and your people. Allah has set you free from fire through our (Ahl al-Bayt) Wilaya (Leadership and Guardianship with Divine Authority).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (120/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1167,
        "local_index": 86,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:86",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنِ الْقَاسِمِ بْنِ سُلَيْمَانَ عَنْ سَمَاعَةَ بْنِ مِهْرَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ يُؤْتِكُمْ كِفْلَيْنِ مِنْ رَحْمَتِهِ قَالَ الْحَسَنُ وَ الْحُسَيْنُ وَ يَجْعَلْ لَكُمْ نُوراً تَمْشُونَ بِهِ قَالَ إِمَامٌ تَأْتَمُّونَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Al Qasim Bin Suleyman, from Sama’at Bin Mihran, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[57:28] He will give you all two portions of His Mercy </span>He<sup>asws</sup> said: ‘Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup> <span class=\"ibTxt\"> and Make for you a Light with which you will walk</span>. He<sup>asws</sup> said: ‘The ‘نُور’ (Light) stands for an Imam<sup>asws</sup> you follow’."
          ],
          "en.sarwar": [
            " 86. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Sama‘ from abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “. . Fulfill your covenant with Me ..” (the covenant to acknowledge Wilaya of Ali (a.s.)) and I shall fulfill Mine (admit you in paradise).. .” (2:40)"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/122)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1168,
        "local_index": 87,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:87",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ الْجَوْهَرِيِّ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِهِ وَ يَسْتَنْبِئُونَكَ أَ حَقٌّ هُوَ قَالَ مَا تَقُولُ فِي عَلِيٍّ قُلْ إِي وَ رَبِّي إِنَّهُ لَحَقٌّ وَ ما أَنْتُمْ بِمُعْجِزِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Alli Bin Ibrahim, from Al Qasim Bin Muhammad Al Jowharey, from some of his companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding His<sup>azwj</sup> Words <span class=\"ibTxt\">[10:53] And they are asking you: Is it true? </span>He<sup>asws</sup> said: ‘What you<sup>saww</sup> are saying regarding Ali<sup>asws</sup>’. <span class=\"ibTxt\">Say: Yes! By my Lord! It is most surely the Truth, and you will not be escaping it</span>’."
          ],
          "en.sarwar": [
            " 87. Muhammad ibn Yahya has narrated from from Salma ibn al-Khattab from al-Hassan ibn ‘Abd al-Rahman from Ali ibn abu Hamza from abu Basir from abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “When Our clear revelations are recited to them, the unbelievers say to the faithful ones, “Which of us has a better position and is more prosperous?” (19:73) The Imam (a.s.) said, “the Messenger of Allah asked Quraysh (the powerful tribe in Makka) to acknowledge our (Wilaya Leadership with Divine Authority) they turned away and refused. The unbelievers of Quraysh told the true believers of Quraysh (those who acknowledged our Wilaya (Leadership with Divine Authority), “Which group of us has a better position and is more prosperous?” This was to humiliated the true believers. Allah in rebuttal said, “How many generations (people of the past) of greater prosperity and splendor have We destroyed before them?” (19:74) I then asked the meaning of, “(Muhammad), tell them, “The Beneficent God gives respite to those who have gone astray. . (19:75). The Imam (a.s.) said, “All them lived a life in error and did acknowledge Wilaya (Leadership with Divine Authority of Amir al-Mu’minin Ali (a.s.) and our Wilaya). They lived in error and lead others to error. Allah gives them time in their error and rebellion until they die. He then cuases them to have the worst of dwelling and be of the weakest parties.” I then asked him about the meaning of, “. . until they face the torment with which they were threatened or to the Day of Judgment. Then they will find out who will have the most miserable place and the weakest forces.” (19:75) The Imam (a.s.) said, “. . until they face the torment with which they were threatened. .” is the time of the rise of al-Mahdi with Divine Authority. That is the time when they will find out what Allah will sent to them through the hands of al-Mahdi (a.s.) and thus, are His words, “. . who will have the most miserable place (at the time of the rise of al-Mahdi with Divine Authority) and the weakest forces.” (19:75) ).” I then asked about the words of Allah. “. . God further enlightens those who seek guidance. ..” (19:76) The Imam (a.s.) said, “Allah will grant them more guidance and certainty to follow Al-Qa’im (the one who will rise with Divine Authority) so that they will not reject or refuse his authority.” I then asked about the words of Allah. “. . no one will be able to intercede for the others except those whom the Beneficent God has given authority.” (19:87) The Imam (a.s.) said, “The acknowledgment of Wilaya (Leadership with Divine Authority) of Amir al-Mu’minin Ali and the Imams after him is part of the religion of Allah (a.s.) and this is the authority and the covenant before Allah.” I then asked about the words of Allah. “To the righteously striving believers God will grant love.” (19:96) The Imam (a.s.) said, “It is the love for Amir al-Mu’minin Ali (a.s.) and to acknowledge his Wilaya. It is this love of which Allah speaks in His words. “(Muhammad), We have given it to you (the Book, the Quran) in your own language so that you could easily give the glad news to the pious ones and warn the quarrelsome ones.” (19:97). The Imam (a.s.) said, “It was made easy for him when Allah appointed Amir al-Mu’minin Ali (a.s.) as the standard of truth. With him He gave glad news to the true believers and warning to the unbelievers. It is these unbelievers whom He has called “the quarrelsome ones” The narrator has said that I then asked him about the words of Allah. “. . so that you may warn a people who are unaware because their fathers were not warned (36:6).The Imam (a.s.) said, “It was to warn the people with whom The Holy Prophet (s.a) lived just as their forefathers were warned and they were unaware of Allah, His messenger and His warning. “. . (I swear) that most of them are doomed to be punished (for not acknowledging the Wilaya of Ali and the Imams after him (a.s.)) They have no faith (in the Wilaya of Ali and the executors of the will after him (a.s.).” (36:7) since they did not believe and their punishment was as such as Allah has mentioned, “. . We have enchained their necks up to their chins. Thus, they cannot bend their heads (in Hell) (to find their way) (36:8).(Then Allah has said, “. . We have set-up a barrier in front of and behind them and have made them blind. Thus, they cannot see.. .” (36:10) (It will be the punishment for not acknowledging the Wilaya of Ali and the Imams after him. This is in this world and in the nest life it will be Hell wherein they will not be able to raise their heard. Then Allah has said, “. . Whether you warn them or not, they will not believe.” (36:10) (in Allah and the Wilaya of Ali and the Imams after him (a.s.) Then Allah has said, “. . You should only warn those who follow the Quran (and Amir al-Mu’minin Ali (a.s.)) and have fear of the Beneficent God without seeing Him. Give them (O Muhammad), the glad news of their receiving forgiveness and an honorable reward (from God).” (36:11)”"
          ]
        }
      },
      {
        "index": 1169,
        "local_index": 88,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:88",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ الدَّيْلَمِيِّ عَنْ أَبِيهِ عَنْ أَبَانِ بْنِ تَغْلِبَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ جُعِلْتُ فِدَاكَ قَوْلُهُ فَلَا اقْتَحَمَ الْعَقَبَةَ فَقَالَ مَنْ أَكْرَمَهُ اللَّهُ بِوَلَايَتِنَا فَقَدْ جَازَ الْعَقَبَةَ وَ نَحْنُ تِلْكَ الْعَقَبَةُ الَّتِي مَنِ اقْتَحَمَهَا نَجَا ",
          "قَالَ فَسَكَتَ فَقَالَ لِي فَهَلَّا أُفِيدُكَ حَرْفاً خَيْرٌ لَكَ مِنَ الدُّنْيَا وَ مَا فِيهَا قُلْتُ بَلَى جُعِلْتُ فِدَاكَ قَالَ قَوْلُهُ فَكُّ رَقَبَةٍ ثُمَّ قَالَ النَّاسُ كُلُّهُمْ عَبِيدُ النَّارِ غَيْرَكَ وَ أَصْحَابِكَ فَإِنَّ اللَّهَ فَكَّ رِقَابَكُمْ مِنَ النَّارِ بِوَلَايَتِنَا أَهْلَ الْبَيْتِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Sahl Bin Ziyad, from Muhammad Bin Suleyman Al Daylami, from his father, from Aban Bin Taghlub, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! His<sup>azwj</sup> Words <span class=\"ibTxt\">[90:11] But he would not attempt the uphill road</span>’. So he<sup>asws</sup> said: ‘The one whom Allah<sup>azwj</sup> has Honoured with our<sup>asws</sup> Wilayah, so he has crossed the uphill road, and we<sup>asws</sup> are that uphill road which, one who attempts it, would attain salvation’. ",
            "He (the narrator) said, ‘So he<sup>asws</sup> was silent, then he<sup>asws</sup> said to me: ‘Shall I<sup>asws</sup> give you a sentence (حَرْفاً ) which is better for you than the world and whatever is in it?’ I said, ‘Yes, may I be sacrificed for you<sup>asws</sup>!’ He<sup>asws</sup> said: ‘His<sup>azwj</sup> Words <span class=\"ibTxt\">[90:13] (It is) the setting free of a slave</span>’. Then he<sup>asws</sup> said: ‘The people, all of them are slaves of the Fire, apart from you and your companions, for Allah<sup>azwj</sup> has Freed your necks from the Fire by our<sup>asws</sup> Wilayah, of the People<sup>asws</sup> of the Household’."
          ],
          "en.sarwar": [
            " 88. Ali ibn Muhammad has narrated from certain persons of our people from ibn Mahbub from Muhammad ibn al-Fudayl who has said the following. “I asked abu al-Hassan al-Madi (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “They want to put out the light of God with their mouths,. .” (61:8) (The Imam (a.s.) siad, “They want to banish Wilaya of Ali (a.s.) with their mouths) “. . but God will certainly make His light shine forever. .” (61:8) (The Imam (a.s.) said, “Allah will complete Imamat (Leadership with Divine Authority) as He said in His words. “It is He who has sent His Messenger with guidance and the true religion,. .” (61:9) The Imam (a.s.) said, “It is He Who sent His Messenger with Wilaya for the executor of his will and Wilaya is the true religion.” I then read from the Holy Quran. “. . make the true religion to stand supreme over all religions, . .” (61:9) The Imam (a.s.) said, “He will it stand supreme at the time of (the rise of al-Mahdi with Divine Authority) as Allah has said, “. .He will make the true religion to stand supreme over all religions, (Wilaya of Al-Qa’im) even though the pagans may dislike it.” (61:9). “The unbelievers refer to unbelievers in the Wilaya of Ali (a.s.)” said The Imam (a.s.). I then asked, “Is it revelation?” He replied, “These words are revelation but the others are interpretation.” I then read from the Holy Quran. “This is because they accepted the faith and then rejected. .” (63:3) The Imam (a.s.) said, “Allah, the Most Holy, the Most High, has called those who would not follow His Messenger in the matter of Wilaya hypocrites. He has considered those who reject Imamat just as those who would reject Muhammad (s.a) and to this effect He has revealed verses in the Holy Quran that read as herein below. “When the hypocrites (in the matter of Wilaya of the executor or your will, Ali (a.s.) come to you, they say, “We testify that you are the Messenger of God.” God knows that you are His Messenger. God testifies that they hypocrites (in the matters of Wilaya of Ali (a.s.) are liars ((63:1). They have chosen their oaths as a shield for them to obstruct others from the way of God (the way is the executor of the will). How terrible is what they do! ((63:2). This is because they accepted the faith (your message) and then rejected it (Wilaya of the executor of your will). God has sealed their hearts, thus, they do not have any understanding.” (63:3). The narrator has said that I then asked, “What is the meaning of ‘they do not have any understanding.” (63:3)?” The Imam (a.s.) said, “Allah has said that they do not understand your prophesy.” I then asked about the meaning of Allah’s words. “When they are told, “Come and let the Prophet of God seek forgiveness for you,. .” (63:6) The Imam (a.s.) said, “It means that when the are asked to come back to the Wilaya of Ali (a.s.) so the The Holy Prophet (s.a) would ask Allah to forgive your sins, “. . they shake their heads (Allah says) and you can see them arrogantly turning away. . “ (63:6) (from the Wilaya of Ali (a.s.) “. . arrogantly. .”. ((63:5). Allah then has reiterated His words about the fact that they know the Wilaya very well saying, “. . It is all the same whether you seek forgiveness for them or not; God will never forgive them. God does not guide the evil-doing people (63:6). The Imam (a.s.) said, “It refers to the unjust ones against the executor of your will.” I then asked the Imam (a.s.) about the meaning of the words of Allah. “Can one who walks with his head hanging down be better guided that one who walks with his head upright?” (67:22) The Imam (a.s.) said, “Allah has compared the ones who would deviate from Wilaya of Ali (a.s.) to those who walk with teir head bent down without knowing what is around them. He, on the other hand has compared to those who would acknowledge Wilaya of Ali (a.s.) with those who would walk on the straight path. Amir al-Mu’minin Ali (a.s.) is the straight path.” The narrator has said that I then asked The Imam (a.s.) about the words of Allah. “. . the Quran is certainly the word of a reverent messenger.” (69:40) The Imam (a.s.) said, “It is the words of Jibril from Allah about Wilaya of Ali (a.s.).” I then asked about the words of Allah. “It is not the word of a poet but only a few of you have faith,” (69:41) The Imam (a.s.) said, “They had said that Muhammad (s.a) is not truthful and Allah has not commanded him anything about Ali (a.s.). Allah then revealed Quran (a reading) about it. “It (Wilaya of Ali (a.s.) is a revelation from the Lord of the Universe (69:43). “Had Muhammad invented some words against Us, (69:44). We would have caught hold of him by his right hand (69:45) and cut-off his main artery.” (69:46). Then Allah has turned to Wilaya of Ali (a.s.) saying, “The Quran (Wilaya of Ali (a.s.) is certainly a reminder for the (worlds) pious ones (69:48). We certainly know that some of you have rejected it (69:49) and (on the Day of Judgment) this (Wilaya of Ali (a.s.) will be a great source of regret for the unbelievers (69:50). This (Wilaya of Ali (a.s.) is the Truth beyond any doubt (69:51). (Muhammad), glorify the name of your Lord, the Great One.” (69:52) Allah has said, “Thank your Lord, the Great, Who has granted you this distinction.” The narrator has said that I then asked The Imam (a.s.) about the words of Allah. “Now that we have listened to the guidance, we believe in it.. .” (72:13) The Imam (a.s.) said, “Guidance is Wilaya of Ali (a.s.). We have established faith in our guardian and those who would do so ‘. . Whoever believes in his Lord does not need to fear loss or oppression.” (72:13) I then asked, “Is it of the revealed words of Allah?” He said, “No, it is interpretation.” I then asked him about the words of Allah. “Say, “I do not possess any power to harm or benefit you.” (72:21) The Imam (a.s.) said, “the Messenger of Allah called people to acknowledge Wilaya of Ali (a.s.). Quraysh came to him and said, “O Muhammad, “Absolve us from such acknowledgment.” The Messenger of Allah said, “It is not from me but it is up to Allah.” They accused him and left him. Allah then revealed this reading. ““Say, “I do not possess any power to harm or benefit you. (72:21) Say, “No one can protect me from God, (if I would disobey Him) nor can I find any place of refuge but with him (72:22). My only (means of protection) is to convey the message of God (about Ali (a.s.).. .” (72:23) I then asked, “Is it the revealed words of Allah?” He said, “Yes, it is the revealed word of Allah.” Allah has said to place more emphasis, “. . Whoever disobeys God and His Messenger (in the matters of Wilaya of Ali (a.s.) will go to hell, wherein he will live forever.” (72:23) I then read the words of Allah. “. . until the unbelievers witness that with which they have been threatened, they will then know whose helpers are weaker and fewer in number.” (72:24) It is a reference to the rise of al-Mahdi with Divine Authority and his supporters).” I then read the words of Allah. “ Bear patiently whatever they say,. .” (73:10) The Imam (a.s.) said, “They say, ‘. . and leave them to distance from them in an honorable manner.” (73:10) “Leave (O Muhammad) the prosperous unbelievers (in Wilaya of Ali (a.s.) to Me and give them respite for a little while;” (73:11) I then asked him, “Is it the revealed words of Allah?” He said, “Yes, it is.” I then read the words of Allah. “It gives more certainty to the people of the Book. .” (74:31) The Imam (a.s.) said, “They become certain that Allah, Hid Messenger and the executor of his will are true.” I then read, ‘. . and strengthens the faith of the believers.. . “ (74:31) The Imam (a.s.) said, “Wilaya of Ali (a.s.) strengthens their faith.” I then read the words of Allah. “. . The people of the Book and the believers have no doubt about it.. .” (74:31) The Imam (a.s.) said, “They have no doubts in the Wilaya of Ali (a.s.).” I then asked, “What is this doubt?” He said, “people of the Book and the believers that Allah has mentioned are meant thereby. He said that they do not doubt the Wilaya of Ali (a.s.).” I then read the words of Allah. “. . This parable is a reminder for mankind.” (74:31) The Imam (a.s.) said, “Yes, it the Wilaya of Ali (a.s.).” “. . it is certainly one of the two great things.” (74:35) The Imam (a.s.) said. “It is the Wilaya of Ali (a.s.).” I then read the words of Allah. “. whether one steps forward to embrace the faith or one turns away from it.” (74:37) The Imam (a.s.) one who would step forwards to our Wilaya he would step away from Hell and one who would step away from our Wilaya he would step closer to Hell.” I then read the words of Allah. “. . except the people of the right hand.” (74:39) The Imam (a.s.) said, “They, by Allah, are our Shi‘a (followers).” I then read the words of Allah. “. . We did not pray,” (74:43) The Imam (a.s.) said, “It refers to their saying, “We did not believe in Wilaya of Ali (a.s.) and the Imams after him and would offer the special greeting for them.” I then read the words of Allah. “. . Why do they run away from guidance,” (74:49) The Imam (a.s.) said, “It means running away from our Wilaya.” I then read the words of Allah. “There is no doubt that it is a guide.” (74:54) The Imam (a.s.) said, “It refers to Wilaya of Ali (a.s.).” I then read the words of Allah. “The servants of God fulfill their vows. .” (76:7) The Imam (a.s.) said, “They fulfill the vow and covenant that they had made to acknowledge our Wilaya.” I then read the words of Allah. “(Muhammad), We have revealed the Quran to you in gradual steps.” (76:23) The Imam (a.s.) said, “It means, revealed with Wilaya of Ali (a.s.).” I then asked, “Is it of the revealed words of Allah ?” He said, “Yes, with interpretation.” I then read the words of Allah. “This (chapter) is a reminder. . .”.(76:29) The Imam (a.s.) said, “It is a reminder of Wilaya .” I then read the words of Allah. “He admits to His mercy whomever He wants.. .” (76:31) The Imam (a.s.) said, “He admits in our Wilaya.” The Imam (a.s.) said, “. . For the unjust He has prepared a painful punishment.” (76:31) Consider that Allah has said, “They (children of Israel) did not wrong Us but wronged themselves. (2:57) The Imam (a.s.) said, “Allah is far glorious than to do injustice or ascribe injustice to His-self. However, Allah has confuse us with His-self, thus, He has called injustice to us as injustice to His-self and our Wilaya as His own Wilaya and guardianship. About this matter He revealed Quran (a reading) to His Prophet that reads. “We did not do any wrong to them but they wronged themselves. (16:118) I then asked, “Is it the revealed word of Allah ?” He said, “Yes, it is.” I then read the words of Allah. “On that day, woe will be to those who have rejected God’s revelations!” (77:15) (The Imam (a.s.) said, “Allah has said, “O Muhammad, woe is to those who reject what I have revealed about the Wilaya of Ali ibn abu Talib (a.s.).” “Did We not destroy the ancient people (77:16) and make others settle after them in their land? (77:17). The Imam (a.s.) said, “The ancient people are those who refused to obey the prophets about the executors of their will. “Thus do We deal with the sinful ones.” (77:18) The Imam (a.s.) said, “It refers to those who sinned in the matters of Ahl al-Bayt (family) of Muhammad (s.a) and did to them what they did.” I then read the words of Allah. “The pious ones . .” (77:41) The Imam (a.s.) said, “By Allah, only we and our Shi‘a (followers) follow truly the religion of Abraham/Ibrahim. Other people have no relationship with it.” I then read the words of Allah. “On that day, the Spirit and the angels who stand in lines will not speak . .” (78:38) The Imam (a.s.) said, “We, by Allah, on the Day of judgment will the permission to speak the truth.” I asked him, “What will you say when you will speak?” The Imam (a.s.) said, “We will praise our Lord, greet our The Holy Prophet (s.a) and intercede for our Shi‘a Our Lord will not reject our request.” I then read the words of Allah. “the records of the sinner’s deeds are in Sij4 n.” (83:7) The Imam (a.s.) said, “They are the ones who did injustice to the Imams and treated them with hostility.” I then read the words of Allah. “. .This is what you had called a lie.” (83:17) The Imam (a.s.) said, “It refers to Amir al-Mu’minin Ali (a.s.).” I then asked, “Is it the revealed word of Allah ?” The Imam (a.s.) said, “yes, it is.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موقوف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/123)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1170,
        "local_index": 89,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:89",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ سَمَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ جَلَّ وَ عَزَّ وَ أَوْفُوا بِعَهْدِي قَالَ بِوَلَايَةِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) أُوفِ بِعَهْدِكُمْ أُوفِ لَكُمْ بِالْجَنَّةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Sama’at, ",
            "(It has been narrated) from Abu Abdullah<sup style=\"font-weight: normal\">asws</sup> regarding the Words of Allah<sup style=\"font-weight: normal\">azwj</sup> Majestic and Mighty <span class=\"ibTxt\">[2:40] and be faithful to (your) Covenant with Me</span>. He<sup style=\"font-weight: normal\">asws</sup> said: ‘By the Wilayah of Amir Al-Momineen<sup style=\"font-weight: normal\">asws</sup> <span class=\"ibTxt\">I will Fulfill (My) Covenant with you</span>. I<sup style=\"font-weight: normal\">azwj</sup> shall Fulfill for you with the Paradise’."
          ],
          "en.sarwar": [
            " 89. Muhammad ibn Yahya has narrated from Salma ibn al-Khattab from al-Husayn ibn ‘Abd al-Rahman from Ali ibn abu Hamza from abu Basir from abu ‘Abdallah (a.s.) about the words of Allah, the Most Majestic, the Most gracious. “Whoever ignores My guidance will live a woeful life. .” (20:124) The Imam (a.s.) said, “It means ignoring Wilaya of Ali (a.s.).” I then read the words of Allah. “. . and will be brought in Our presence blind on the Day of Judgment.” (20:124) The Imam (a.s.) said, “It means blind of eyes in the next life and blind of heart towards Wilaya of Amir al-Mu’minin Ali (a.s.) in this life.” The Imam (a.s.) said, “He will be confused on the Day of Judgment and will ask, “. . He will say, “My Lord, why have you brought me back to life blind; before I could see?” (20:125). The Lord will say, “This is true. But just as you forgot Our revelations that had come to you, so, also, are you forgotten on this day.” (20:126) The Imam (a.s.) said, “ ‘revelations’ means Imams (a.s.) that you rejected so also you are rejected and left to the fire today. You did not obey their commands and did not listened to their words.” I then read the words of Allah. “Thus We recompense those who are unjust and have no faith in Our revelations. The torment in the life to come will be more severe and last longer.” (20:127) The Imam (a.s.) said, “It refers to those who accept others as partners of Amir al-Mu’minin Ali (a.s.) in the matters of Wilaya and have no faith in the revelations of his Lord and have left the Imams (a.s.) on account of hostility who have not followed their teachings and have not acknowledged their Wilaya (Leadership with Divine Authority).” I then read the words of Allah. “God is kind to His servants. He gives sustenance to whomever He wants. . .” (42:19) The Imam (a.s.) said, “ ‘Sustenance’ is the Wilaya of Ali (a.s.).” I then read the words of Allah. “We shall increase the harvest of those who seek a good harvest in the life hereafter. .” (42:20) The Imam (a.s.) said, “It is the recognition of Amir al-Mu’minin Ali (a.s.) and the Imams from which the receive additional gains.” “. However, those who want to have their harvest in this life will be given it but will have no share in the hereafter.” (42:20) The Imam (a.s.) said, “They will have no share in government of truth at the time of Al-Qa’im, the one who will rise with Divine Authority).”"
          ]
        }
      },
      {
        "index": 1171,
        "local_index": 90,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:90",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنِ الْحَسَنِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ إِذا تُتْلى عَلَيْهِمْ آياتُنا بَيِّناتٍ قالَ الَّذِينَ كَفَرُوا لِلَّذِينَ آمَنُوا أَيُّ الْفَرِيقَيْنِ خَيْرٌ مَقاماً وَ أَحْسَنُ نَدِيًّا ",
          "قَالَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) دَعَا قُرَيْشاً إِلَى وَلَايَتِنَا فَنَفَرُوا وَ أَنْكَرُوا فَقَالَ الَّذِينَ كَفَرُوا مِنْ قُرَيْشٍ لِلَّذِينَ آمَنُوا الَّذِينَ أَقَرُّوا لِأَمِيرِ الْمُؤْمِنِينَ وَ لَنَا أَهْلَ الْبَيْتِ أَيُّ الْفَرِيقَيْنِ خَيْرٌ مَقاماً وَ أَحْسَنُ نَدِيًّا تَعْيِيراً مِنْهُمْ فَقَالَ اللَّهُ رَدّاً عَلَيْهِمْ وَ كَمْ أَهْلَكْنا قَبْلَهُمْ مِنْ قَرْنٍ مِنَ الْأُمَمِ السَّالِفَةِ هُمْ أَحْسَنُ أَثاثاً وَ رِءْياً",
          "قُلْتُ قَوْلُهُ مَنْ كانَ فِي الضَّلالَةِ فَلْيَمْدُدْ لَهُ الرَّحْمنُ مَدًّا قَالَ كُلُّهُمْ كَانُوا فِي الضَّلَالَةِ لَا يُؤْمِنُونَ بِوَلَايَةِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) وَ لَا بِوَلَايَتِنَا فَكَانُوا ضَالِّينَ مُضِلِّينَ فَيَمُدُّ لَهُمْ فِي ضَلَالَتِهِمْ وَ طُغْيَانِهِمْ حَتَّى يَمُوتُوا فَيُصَيِّرُهُمُ اللَّهُ شَرّاً مَكَاناً وَ أَضْعَفَ جُنْداً",
          "قُلْتُ قَوْلُهُ حَتَّى إِذا رَأَوْا ما يُوعَدُونَ إِمَّا الْعَذابَ وَ إِمَّا السَّاعَةَ فَسَيَعْلَمُونَ مَنْ هُوَ شَرٌّ مَكاناً وَ أَضْعَفُ جُنْداً قَالَ أَمَّا قَوْلُهُ حَتَّى إِذا رَأَوْا ما يُوعَدُونَ فَهُوَ خُرُوجُ الْقَائِمِ وَ هُوَ السَّاعَةُ فَسَيَعْلَمُونَ ذَلِكَ الْيَوْمَ وَ مَا نَزَلَ بِهِمْ مِنَ اللَّهِ عَلَى يَدَيْ قَائِمِهِ فَذَلِكَ قَوْلُهُ مَنْ هُوَ شَرٌّ مَكاناً يَعْنِي عِنْدَ الْقَائِمِ وَ أَضْعَفُ جُنْداً",
          "قُلْتُ قَوْلُهُ وَ يَزِيدُ اللَّهُ الَّذِينَ اهْتَدَوْا هُدىً قَالَ يَزِيدُهُمْ ذَلِكَ الْيَوْمَ هُدًى عَلَى هُدًى بِاتِّبَاعِهِمُ الْقَائِمَ حَيْثُ لَا يَجْحَدُونَهُ وَ لَا يُنْكِرُونَهُ",
          "قُلْتُ قَوْلُهُ لا يَمْلِكُونَ الشَّفاعَةَ إِلَّا مَنِ اتَّخَذَ عِنْدَ الرَّحْمنِ عَهْداً قَالَ إِلَّا مَنْ دَانَ اللَّهَ بِوَلَايَةِ أَمِيرِ الْمُؤْمِنِينَ وَ الْأَئِمَّةِ مِنْ بَعْدِهِ فَهُوَ الْعَهْدُ عِنْدَ اللَّهِ",
          "قُلْتُ قَوْلُهُ إِنَّ الَّذِينَ آمَنُوا وَ عَمِلُوا الصَّالِحاتِ سَيَجْعَلُ لَهُمُ الرَّحْمنُ وُدًّا قَالَ وَلَايَةُ أَمِيرِ الْمُؤْمِنِينَ هِيَ الْوُدُّ الَّذِي قَالَ اللَّهُ تَعَالَى",
          "قُلْتُ فَإِنَّما يَسَّرْناهُ بِلِسانِكَ لِتُبَشِّرَ بِهِ الْمُتَّقِينَ وَ تُنْذِرَ بِهِ قَوْماً لُدًّا قَالَ إِنَّمَا يَسَّرَهُ اللَّهُ عَلَى لِسَانِهِ حِينَ أَقَامَ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) عَلَماً فَبَشَّرَ بِهِ الْمُؤْمِنِينَ وَ أَنْذَرَ بِهِ الْكَافِرِينَ وَ هُمُ الَّذِينَ ذَكَرَهُمُ اللَّهُ فِي كِتَابِهِ لُدّاً أَيْ كُفَّاراً ",
          "قَالَ وَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ لِتُنْذِرَ قَوْماً ما أُنْذِرَ آباؤُهُمْ فَهُمْ غافِلُونَ قَالَ لِتُنْذِرَ الْقَوْمَ الَّذِينَ أَنْتَ فِيهِمْ كَمَا أُنْذِرَ آبَاؤُهُمْ فَهُمْ غَافِلُونَ عَنِ اللَّهِ وَ عَنْ رَسُولِهِ وَ عَنْ وَعِيدِهِ",
          "لَقَدْ حَقَّ الْقَوْلُ عَلى أَكْثَرِهِمْ مِمَّنْ لَا يُقِرُّونَ بِوَلَايَةِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) وَ الْأَئِمَّةِ مِنْ بَعْدِهِ فَهُمْ لا يُؤْمِنُونَ بِإِمَامَةِ أَمِيرِ الْمُؤْمِنِينَ وَ الْأَوْصِيَاءِ مِنْ بَعْدِهِ فَلَمَّا لَمْ يُقِرُّوا كَانَتْ عُقُوبَتُهُمْ مَا ذَكَرَ اللَّهُ إِنَّا جَعَلْنا فِي أَعْناقِهِمْ أَغْلالًا فَهِيَ إِلَى الْأَذْقانِ فَهُمْ مُقْمَحُونَ فِي نَارِ جَهَنَّمَ",
          "ثُمَّ قَالَ وَ جَعَلْنا مِنْ بَيْنِ أَيْدِيهِمْ سَدًّا وَ مِنْ خَلْفِهِمْ سَدًّا فَأَغْشَيْناهُمْ فَهُمْ لا يُبْصِرُونَ عُقُوبَةً مِنْهُ لَهُمْ حَيْثُ أَنْكَرُوا وَلَايَةَ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) وَ الْأَئِمَّةِ مِنْ بَعْدِهِ هَذَا فِي الدُّنْيَا وَ فِي الْآخِرَةِ فِي نَارِ جَهَنَّمَ مُقْمَحُونَ ",
          "ثُمَّ قَالَ يَا مُحَمَّدُ وَ سَواءٌ عَلَيْهِمْ أَ أَنْذَرْتَهُمْ أَمْ لَمْ تُنْذِرْهُمْ لا يُؤْمِنُونَ بِاللَّهِ وَ بِوَلَايَةِ عَلِيٍّ وَ مَنْ بَعْدَهُ ثُمَّ قَالَ إِنَّما تُنْذِرُ مَنِ اتَّبَعَ الذِّكْرَ يَعْنِي أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) وَ خَشِيَ الرَّحْمنَ بِالْغَيْبِ فَبَشِّرْهُ يَا مُحَمَّدُ بِمَغْفِرَةٍ وَ أَجْرٍ كَرِيمٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Salma Bin Al Khattab, from Al Hassan Bin Abdul Rahman, from Ali Bin Abu Hamza, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[19:73] And when Our clear Verses are recited to them, those who disbelieve say to those who believe: Which of the two sects is better in position and best in assembly?</span>",
            "He<sup>asws</sup> said: ‘It was so that Rasool-Allah<sup>saww</sup> called the Qureysh to our<sup>asws</sup> Wilayah, but they fled and denied. So those who disbelieved from the Qureysh said to those who believed from the Qureysh, ‘Are you acknowledging to Amir Al-Momineen<sup>asws</sup> and for us there are family members, <span class=\"ibTxt\">Which of the two sects is better in position and best in assembly?</span> In order to humiliate from them. So Allah<sup>azwj</sup> Rebutted upon them <span class=\"ibTxt\">19:74] And how many of the generations have We Destroyed before them who were better in respect of equipment and outwardly appearance!</span>’. ",
            "I said, ‘His<sup>azwj</sup> Words <span class=\"ibTxt\">[19:75] Say: As for him who was in error, the Beneficent would Prolong his term</span>’. He<sup>asws</sup> said: ‘All of them used to be in the straying, not believing in the Wilayah of Amir Al-Momineen<sup>asws</sup> nor in our<sup>asws</sup> Wilayah. Thus, they were straying, and leading (others) astray. So He<sup>azwj</sup> Extended for them in their straying and their rebellion until they died, so Allah<sup>azwj</sup> Caused them to come to an evil place and weakest army’. ",
            "I said, ‘His<sup>azwj</sup> Words <span class=\"ibTxt\">[19:75] until they see what they were threatened with, either the Punishment or the Hour; So they shall soon be knowing who was in an evil position and a weaker army</span>’. He<sup>asws</sup> said: ‘As for His<sup>azwj</sup> Words <span class=\"ibTxt\">until they see what they were threatened with</span>, so that is the coming out of Al-Qaim<sup>asws</sup>, and it is the Hour, <span class=\"ibTxt\">So they shall soon be knowing </span>that day and what descends with them from Allah<sup>azwj</sup> upon the hands of His<sup>azwj</sup> Qaim<sup>asws</sup>. Thus, these are His<sup>azwj</sup> Words <span class=\"ibTxt\">who was in an evil position</span>, Meaning in the presence of Al-Qaim<sup>asws</sup>, and <span class=\"ibTxt\">and a weaker army</span>’. ",
            "I said, ‘His<sup>azwj</sup> Words <span class=\"ibTxt\">[19:76] And Allah would Increase in Guidance those who (seek) Guidance</span>. He<sup>asws</sup> said: ‘He<sup>azwj</sup> would Increase them on that day, Guidance upon Guidance, due to their following Al-Qaim<sup>asws</sup>, when they will neither be rejecting him<sup>asws</sup> nor denying him<sup>asws</sup>’. ",
            "I said, ‘His<sup>azwj</sup> Words <span class=\"ibTxt\">[19:87] They shall not have control over intercession, except he who took a Covenant with the Beneficent</span>. He<sup>asws</sup> said: ‘Except the one who made it a Religion of allah<sup>azwj</sup> by the Wilayah of Amir Al-Momineen<sup>asws</sup> and the Imams<sup>asws</sup> from after him<sup>asws</sup>, so it is the Covenant with Allah<sup>azwj</sup>’. ",
            "I said, ‘His<sup>azwj</sup> Words <span class=\"ibTxt\">[19:96] (As for) those who believe and do righteous deeds, the Beneficent would Make the cordiality for them</span>’. He<sup>asws</sup> said: ‘Wilayah of Amir Al-Momineen<sup>asws</sup>, it is the cordiality which Allah<sup>azwj</sup> the Exalted Speaks of’. ",
            "I said, ‘<span class=\"ibTxt\">[19:97] So We have Made it easy by your tongue that you may give good news thereby to the pious and warn thereby a contentious people</span>’. He<sup>asws</sup> said: ‘But rather, Allah<sup>azwj</sup> Made it to be easy upon his<sup>saww</sup> tongue when he<sup>saww</sup> established Amir Al-Momineen<sup>asws</sup> as a flag, so the Momineen were given glad tidings by it and the disbelievers were warned by it, and they are those whom Allah<sup>azwj</sup> Mentioned in His<sup>azwj</sup> Book as ‘contentious’, i.e., disbelievers’.  ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about the Words <span class=\"ibTxt\">[36:6] That you may warn a people (with) what their fathers were warned about, so they are heedless</span>. He<sup>asws</sup> said: ‘In order to warn the people whom you<sup>saww</sup> are among just as their fathers were warned, but they were heedless from Allah<sup>azwj</sup>, and from His<sup>azwj</sup> Rasool<sup>saww</sup>, and from His<sup>azwj</sup> Threats. ",
            "<span class=\"ibTxt\">[36:7] The Word has proved to be True for most of them</span> from the ones who are not acknowledging with the Wilayah of Amir Al-Momineen<sup>asws</sup> and the Imams<sup>asws</sup> from after him<sup>asws</sup>. Thus, they do not believe in the Imamate of Amir Al-Momineen<sup>asws</sup> and the successors<sup>asws</sup> from after him<sup>asws</sup>. So when they were not acknowledging, their consequential Punishment was what Allah<sup>azwj</sup> Mentioned <span class=\"ibTxt\">[36:8] Surely, We have placed chains on their necks, and these reach up to their chins, so they have their heads raised aloft</span> in the Fire of Hell. ",
            "Then He<sup>azwj</sup> Said <span class=\"ibTxt\">36:9] And We have made in front of them a barrier and a barrier behind them, so We have Covered them over, so they are not seeing</span> the consequential Punishment for them when they denied the Wilayah of Amir Al-Momineen<sup>asws</sup> and the Imams<sup>asws</sup> from after him<sup>asws</sup>. This is in the world, and in the Hereafter it is the Fire of Hell with their heads raised aloft. ",
            "Then He<sup>azwj</sup> Said: “O Muhammad<sup>saww</sup>! <span class=\"ibTxt\">[36:10] And it is alike to them whether you warn them or do not warn them, they will not be believing</span> in the Wilayah of Ali<sup>asws</sup> and the ones<sup>asws</sup> from after him<sup>asws</sup>. Then He<sup>azwj</sup> Said <span class=\"ibTxt\">[36:11] But rather, You can only warn him who follows the Reminder </span>Meaning Amir Al-Momineen<sup>asws</sup>, <span class=\"ibTxt\">and fears the Beneficent in secret; so announce to him </span>O Muhammad<sup>saww</sup>,<span class=\"ibTxt\"> the good news of Forgiveness and an honourable Recompense</span>’."
          ]
        }
      },
      {
        "index": 1172,
        "local_index": 91,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:91",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنِ ابْنِ مَحْبُوبٍ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الْحَسَنِ الْمَاضِي ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ يُرِيدُونَ لِيُطْفِؤُا نُورَ اللَّهِ بِأَفْواهِهِمْ قَالَ يُرِيدُونَ لِيُطْفِئُوا وَلَايَةَ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) بِأَفْوَاهِهِمْ قُلْتُ وَ اللَّهُ مُتِمُّ نُورِهِ قَالَ وَ اللَّهُ مُتِمُّ الْإِمَامَةِ لِقَوْلِهِ عَزَّ وَ جَلَّ الَّذِينَ فَآمِنُوا بِاللَّهِ وَ رَسُولِهِ وَ النُّورِ الَّذِي أَنْزَلْنا فَالنُّورُ هُوَ الْإِمَامُ",
          "قُلْتُ هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدى وَ دِينِ الْحَقِّ قَالَ هُوَ الَّذِي أَمَرَ رَسُولَهُ بِالْوَلَايَةِ لِوَصِيِّهِ وَ الْوَلَايَةُ هِيَ دِينُ الْحَقِّ قُلْتُ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ قَالَ يُظْهِرُهُ عَلَى جَمِيعِ الْأَدْيَانِ عِنْدَ قِيَامِ الْقَائِمِ",
          "قَالَ يَقُولُ اللَّهُ وَ اللَّهُ مُتِمُّ نُورِهِ وَلَايَةِ الْقَائِمِ وَ لَوْ كَرِهَ الْكافِرُونَ بِوَلَايَةِ عَلِيٍّ قُلْتُ هَذَا تَنْزِيلٌ قَالَ نَعَمْ أَمَّا هَذَا الْحَرْفُ فَتَنْزِيلٌ وَ أَمَّا غَيْرُهُ فَتَأْوِيلٌ",
          "قُلْتُ ذلِكَ بِأَنَّهُمْ آمَنُوا ثُمَّ كَفَرُوا قَالَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى سَمَّى مَنْ لَمْ يَتَّبِعْ رَسُولَهُ فِي وَلَايَةِ وَصِيِّهِ مُنَافِقِينَ وَ جَعَلَ مَنْ جَحَدَ وَصِيَّهُ إِمَامَتَهُ كَمَنْ جَحَدَ مُحَمَّداً وَ أَنْزَلَ بِذَلِكَ قُرْآناً فَقَالَ يَا مُحَمَّدُ إِذا جاءَكَ الْمُنافِقُونَ بِوَلَايَةِ وَصِيِّكَ قالُوا نَشْهَدُ إِنَّكَ لَرَسُولُ اللَّهِ وَ اللَّهُ يَعْلَمُ إِنَّكَ لَرَسُولُهُ وَ اللَّهُ يَشْهَدُ إِنَّ الْمُنافِقِينَ بِوَلَايَةِ عَلِيٍّ لَكاذِبُونَ. اتَّخَذُوا أَيْمانَهُمْ جُنَّةً فَصَدُّوا عَنْ سَبِيلِ اللَّهِ وَ السَّبِيلُ هُوَ الْوَصِيُّ إِنَّهُمْ ساءَ ما كانُوا يَعْمَلُونَ ذلِكَ بِأَنَّهُمْ آمَنُوا بِرِسَالَتِكَ وَ كَفَرُوا بِوَلَايَةِ وَصِيِّكَ فَطُبِعَ اللَّهُ عَلى قُلُوبِهِمْ فَهُمْ لا يَفْقَهُونَ",
          "قُلْتُ مَا مَعْنَى لَا يَفْقَهُونَ قَالَ يَقُولُ لَا يَعْقِلُونَ بِنُبُوَّتِكَ قُلْتُ وَ إِذا قِيلَ لَهُمْ تَعالَوْا يَسْتَغْفِرْ لَكُمْ رَسُولُ اللَّهِ قَالَ وَ إِذَا قِيلَ لَهُمُ ارْجِعُوا إِلَى وَلَايَةِ عَلِيٍّ يَسْتَغْفِرْ لَكُمُ النَّبِيُّ مِنْ ذُنُوبِكُمْ لَوَّوْا رُؤُسَهُمْ قَالَ اللَّهُ وَ رَأَيْتَهُمْ يَصُدُّونَ عَنْ وَلَايَةِ عَلِيٍّ وَ هُمْ مُسْتَكْبِرُونَ عَلَيْهِ",
          "ثُمَّ عَطَفَ الْقَوْلَ مِنَ اللَّهِ بِمَعْرِفَتِهِ بِهِمْ فَقَالَ سَواءٌ عَلَيْهِمْ أَسْتَغْفَرْتَ لَهُمْ أَمْ لَمْ تَسْتَغْفِرْ لَهُمْ لَنْ يَغْفِرَ اللَّهُ لَهُمْ إِنَّ اللَّهَ لا يَهْدِي الْقَوْمَ الْفاسِقِينَ يَقُولُ الظَّالِمِينَ لِوَصِيِّكَ",
          "قُلْتُ أَ فَمَنْ يَمْشِي مُكِبًّا عَلى وَجْهِهِ أَهْدى أَمَّنْ يَمْشِي سَوِيًّا عَلى صِراطٍ مُسْتَقِيمٍ قَالَ إِنَّ اللَّهَ ضَرَبَ مَثَلَ مَنْ حَادَ عَنْ وَلَايَةِ عَلِيٍّ كَمَنْ يَمْشِي عَلَى وَجْهِهِ لَا يَهْتَدِي لِأَمْرِهِ وَ جَعَلَ مَنْ تَبِعَهُ سَوِيّاً عَلَى صِرَاطٍ مُسْتَقِيمٍ وَ الصِّرَاطُ الْمُسْتَقِيمُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام )",
          "قَالَ قُلْتُ قَوْلُهُ إِنَّهُ لَقَوْلُ رَسُولٍ كَرِيمٍ قَالَ يَعْنِي جَبْرَئِيلَ عَنِ اللَّهِ فِي وَلَايَةِ عَلِيٍّ ( عليه السلام ) قَالَ قُلْتُ وَ ما هُوَ بِقَوْلِ شاعِرٍ قَلِيلًا ما تُؤْمِنُونَ قَالَ قَالُوا إِنَّ مُحَمَّداً كَذَّابٌ عَلَى رَبِّهِ وَ مَا أَمَرَهُ اللَّهُ بِهَذَا فِي عَلِيٍّ فَأَنْزَلَ اللَّهُ بِذَلِكَ قُرْآناً فَقَالَ إِنَّ وَلَايَةَ عَلِيٍّ تَنْزِيلٌ مِنْ رَبِّ الْعالَمِينَ. وَ لَوْ تَقَوَّلَ عَلَيْنا مُحَمَّدٌ بَعْضَ الْأَقاوِيلِ. لَأَخَذْنا مِنْهُ بِالْيَمِينِ. ثُمَّ لَقَطَعْنا مِنْهُ الْوَتِينَ ",
          "ثُمَّ عَطَفَ الْقَوْلَ فَقَالَ إِنَّ وَلَايَةَ عَلِيٍّ لَتَذْكِرَةٌ لِلْمُتَّقِينَ لِلْعَالَمِينَ وَ إِنَّا لَنَعْلَمُ أَنَّ مِنْكُمْ مُكَذِّبِينَ. وَ إِنَّ عَلِيّاً لَحَسْرَةٌ عَلَى الْكافِرِينَ. وَ إِنَّ وَلَايَتَهُ لَحَقُّ الْيَقِينِ. فَسَبِّحْ يَا مُحَمَّدُ بِاسْمِ رَبِّكَ الْعَظِيمِ يَقُولُ اشْكُرْ رَبَّكَ الْعَظِيمَ الَّذِي أَعْطَاكَ هَذَا الْفَضْلَ",
          "قُلْتُ قَوْلُهُ لَمَّا سَمِعْنَا الْهُدى آمَنَّا بِهِ قَالَ الْهُدَى الْوَلَايَةُ آمَنَّا بِمَوْلَانَا فَمَنْ آمَنَ بِوَلَايَةِ مَوْلَاهُ فَلا يَخافُ بَخْساً وَ لا رَهَقاً قُلْتُ تَنْزِيلٌ قَالَ لَا تَأْوِيلٌ",
          "قُلْتُ قَوْلُهُ لا أَمْلِكُ لَكُمْ ضَرًّا وَ لا رَشَداً قَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) دَعَا النَّاسَ إِلَى وَلَايَةِ عَلِيٍّ فَاجْتَمَعَتْ إِلَيْهِ قُرَيْشٌ فَقَالُوا يَا مُحَمَّدُ أَعْفِنَا مِنْ هَذَا فَقَالَ لَهُمْ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) هَذَا إِلَى اللَّهِ لَيْسَ إِلَيَّ فَاتَّهَمُوهُ وَ خَرَجُوا مِنْ عِنْدِهِ ",
          "فَأَنْزَلَ اللَّهُ قُلْ إِنِّي لا أَمْلِكُ لَكُمْ ضَرًّا وَ لا رَشَداً. قُلْ إِنِّي لَنْ يُجِيرَنِي مِنَ اللَّهِ إِنْ عَصَيْتُهُ أَحَدٌ وَ لَنْ أَجِدَ مِنْ دُونِهِ مُلْتَحَداً إِلَّا بَلَاغاً مِنَ اللَّهِ وَ رِسَالَاتِهِ فِي عَلِيٍّ قُلْتُ هَذَا تَنْزِيلٌ قَالَ نَعَمْ ثُمَّ قَالَ تَوْكِيداً وَ مَنْ يَعْصِ اللَّهَ وَ رَسُولَهُ فِي وَلَايَةِ عَلِيٍّ فَإِنَّ لَهُ نارَ جَهَنَّمَ خالِدِينَ فِيها أَبَداً ",
          "قُلْتُ حَتَّى إِذا رَأَوْا ما يُوعَدُونَ فَسَيَعْلَمُونَ مَنْ أَضْعَفُ ناصِراً وَ أَقَلُّ عَدَداً يَعْنِي بِذَلِكَ الْقَائِمَ وَ أَنْصَارَهُ",
          "قُلْتُ وَ اصْبِرْ عَلى ما يَقُولُونَ قَالَ يَقُولُونَ فِيكَ وَ اهْجُرْهُمْ هَجْراً جَمِيلًا. وَ ذَرْنِي يَا مُحَمَّدُ وَ الْمُكَذِّبِينَ بِوَصِيِّكَ أُولِي النَّعْمَةِ وَ مَهِّلْهُمْ قَلِيلًا قُلْتُ إِنَّ هَذَا تَنْزِيلٌ قَالَ نَعَمْ",
          "قُلْتُ لِيَسْتَيْقِنَ الَّذِينَ أُوتُوا الْكِتابَ قَالَ يَسْتَيْقِنُونَ أَنَّ اللَّهَ وَ رَسُولَهُ وَ وَصِيَّهُ حَقٌّ قُلْتُ وَ يَزْدادَ الَّذِينَ آمَنُوا إِيماناً قَالَ وَ يَزْدَادُونَ بِوَلَايَةِ الْوَصِيِّ إِيمَاناً قُلْتُ وَ لا يَرْتابَ الَّذِينَ أُوتُوا الْكِتابَ وَ الْمُؤْمِنُونَ قَالَ بِوَلَايَةِ عَلِيٍّ ( عليه السلام ) قُلْتُ مَا هَذَا الِارْتِيَابُ قَالَ يَعْنِي بِذَلِكَ أَهْلَ الْكِتَابِ وَ الْمُؤْمِنِينَ الَّذِينَ ذَكَرَ اللَّهُ فَقَالَ وَ لَا يَرْتَابُونَ فِي الْوَلَايَةِ",
          "قُلْتُ وَ ما هِيَ إِلَّا ذِكْرى لِلْبَشَرِ قَالَ نَعَمْ وَلَايَةُ عَلِيٍّ ( عليه السلام ) قُلْتُ إِنَّها لَإِحْدَى الْكُبَرِ قَالَ الْوَلَايَةُ قُلْتُ لِمَنْ شاءَ مِنْكُمْ أَنْ يَتَقَدَّمَ أَوْ يَتَأَخَّرَ قَالَ مَنْ تَقَدَّمَ إِلَى وَلَايَتِنَا أُخِّرَ عَنْ سَقَرَ وَ مَنْ تَأَخَّرَ عَنَّا تَقَدَّمَ إِلَى سَقَرَ إِلَّا أَصْحابَ الْيَمِينِ قَالَ هُمْ وَ اللَّهِ شِيعَتُنَا",
          "قُلْتُ لَمْ نَكُ مِنَ الْمُصَلِّينَ قَالَ إِنَّا لَمْ نَتَوَلَّ وَصِيَّ مُحَمَّدٍ وَ الْأَوْصِيَاءَ مِنْ بَعْدِهِ وَ لَا يُصَلُّونَ عَلَيْهِمْ قُلْتُ فَما لَهُمْ عَنِ التَّذْكِرَةِ مُعْرِضِينَ قَالَ عَنِ الْوَلَايَةِ مُعْرِضِينَ قُلْتُ كَلَّا إِنَّها تَذْكِرَةٌ قَالَ الْوَلَايَةُ",
          "قُلْتُ قَوْلُهُ يُوفُونَ بِالنَّذْرِ قَالَ يُوفُونَ لِلَّهِ بِالنَّذْرِ الَّذِي أَخَذَ عَلَيْهِمْ فِي الْمِيثَاقِ مِنْ وَلَايَتِنَا",
          "قُلْتُ إِنَّا نَحْنُ نَزَّلْنا عَلَيْكَ الْقُرْآنَ تَنْزِيلًا قَالَ بِوَلَايَةِ عَلِيٍّ ( عليه السلام ) تَنْزِيلًا قُلْتُ هَذَا تَنْزِيلٌ قَالَ نَعَمْ ذَا تَأْوِيلٌ قُلْتُ إِنَّ هذِهِ تَذْكِرَةٌ قَالَ الْوَلَايَةُ قُلْتُ يُدْخِلُ مَنْ يَشاءُ فِي رَحْمَتِهِ قَالَ فِي وَلَايَتِنَا قَالَ وَ الظَّالِمِينَ أَعَدَّ لَهُمْ عَذاباً أَلِيماً أَ لَا تَرَى أَنَّ اللَّهَ يَقُولُ وَ ما ظَلَمُونا وَ لكِنْ كانُوا أَنْفُسَهُمْ يَظْلِمُونَ",
          "قَالَ إِنَّ اللَّهَ أَعَزُّ وَ أَمْنَعُ مِنْ أَنْ يَظْلِمَ أَوْ يَنْسُبَ نَفْسَهُ إِلَى ظُلْمٍ وَ لَكِنَّ اللَّهَ خَلَطَنَا بِنَفْسِهِ فَجَعَلَ ظُلْمَنَا ظُلْمَهُ وَ وَلَايَتَنَا وَلَايَتَهُ ثُمَّ أَنْزَلَ بِذَلِكَ قُرْآناً عَلَى نَبِيِّهِ فَقَالَ وَ ما ظَلَمْناهُمْ وَ لكِنْ كانُوا أَنْفُسَهُمْ يَظْلِمُونَ قُلْتُ هَذَا تَنْزِيلٌ قَالَ نَعَمْ ",
          "قُلْتُ وَيْلٌ يَوْمَئِذٍ لِلْمُكَذِّبِينَ قَالَ يَقُولُ وَيْلٌ لِلْمُكَذِّبِينَ يَا مُحَمَّدُ بِمَا أَوْحَيْتُ إِلَيْكَ مِنْ وَلَايَةِ عَلِيِّ بْنِ أَبِي طَالِبٍ ( عليه السلام ) أَ لَمْ نُهْلِكِ الْأَوَّلِينَ. ثُمَّ نُتْبِعُهُمُ الْآخِرِينَ قَالَ الْأَوَّلِينَ الَّذِينَ كَذَّبُوا الرُّسُلَ فِي طَاعَةِ الْأَوْصِيَاءِ كَذلِكَ نَفْعَلُ بِالْمُجْرِمِينَ قَالَ مَنْ أَجْرَمَ إِلَى آلِ مُحَمَّدٍ وَ رَكِبَ مِنْ وَصِيِّهِ مَا رَكِبَ",
          "قُلْتُ إِنَّ الْمُتَّقِينَ قَالَ نَحْنُ وَ اللَّهِ وَ شِيعَتُنَا لَيْسَ عَلَى مِلَّةِ إِبْرَاهِيمَ غَيْرُنَا وَ سَائِرُ النَّاسِ مِنْهَا بُرَآءُ",
          "قُلْتُ يَوْمَ يَقُومُ الرُّوحُ وَ الْمَلائِكَةُ صَفًّا لا يَتَكَلَّمُونَ الْآيَةَ قَالَ نَحْنُ وَ اللَّهِ الْمَأْذُونُ لَهُمْ يَوْمَ الْقِيَامَةِ وَ الْقَائِلُونَ صَوَاباً قُلْتُ مَا تَقُولُونَ إِذَا تَكَلَّمْتُمْ قَالَ نُمَجِّدُ رَبَّنَا وَ نُصَلِّي عَلَى نَبِيِّنَا وَ نَشْفَعُ لِشِيعَتِنَا فَلَا يَرُدُّنَا رَبُّنَا",
          "قُلْتُ كَلَّا إِنَّ كِتابَ الفُجَّارِ لَفِي سِجِّينٍ قَالَ هُمُ الَّذِينَ فَجَرُوا فِي حَقِّ الْأَئِمَّةِ وَ اعْتَدَوْا عَلَيْهِمْ ",
          "قُلْتُ ثُمَّ يُقَالُ هذَا الَّذِي كُنْتُمْ بِهِ تُكَذِّبُونَ قَالَ يَعْنِي أَمِيرَ الْمُؤْمِنِينَ قُلْتُ تَنْزِيلٌ قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from some of our companions, from Ibn Mahboub, from Muhammad Bin Al Fuzayl, ",
            "(It has been narrated) from Abu Al-Hassan Al-Maazy<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), said, ‘I asked Him<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[61:8] They are intending to extinguish the Light of Allah with their mouths</span>. He<sup>asws</sup> said: ‘They are intending to extinguish the Wilayah of Amir Al-Momineen<sup>asws</sup> with their mouths (talking against it)’. I said, ‘<span class=\"ibTxt\">but Allah will Complete His light</span>’. He<sup>asws</sup> said: ‘And Allah<sup>azwj</sup> will Complete the Imamat due to His<sup>azwj</sup> Words, the Mighty and Majestic <span class=\"ibTxt\">[64:8] Therefore believe in Allah and His Rasool and the Light which We have Sent down</span>. So the Light, it is the Imam<sup>asws</sup>’. ",
            "I said, ‘<span class=\"ibTxt\">[61:9] He it is Who sent His Messenger with the Guidance and the true Religion</span>’. He<sup>asws</sup> said: ‘He<sup>azwj</sup> is Who Commanded His<sup>azwj</sup> Rasool<sup>saww</sup> with the Wilayah of his<sup>saww</sup> successor<sup>asws</sup>, and the Wilayah - is the true Religion’. I said, ‘<span class=\"ibTxt\">That He may make it overcome the religions, all of them</span>’. He<sup>asws</sup> said: ‘Overcome upon the entirety of the Religions during the rising of Al-Qaim<sup>asws</sup>’. ",
            "He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> is Saying: <span class=\"ibTxt\">but Allah will Complete His light</span>, the Wilayah of Al-Qaim<sup>asws</sup> <span class=\"ibTxt\">though the unbelievers may be averse to it</span>, the Wilayah of Ali<sup>asws</sup>’. I said, ‘This is Revelation?’ He<sup>asws</sup> said: ‘Yes. As for this word, so it is Revelation, and as for other than it, so it is explanation’. ",
            "I said, ‘<span class=\"ibTxt\">[63:3] That is because they believe, then disbelieve</span><span class=\"iTxt\">. </span>He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Blessed and High has Named the one who does not follow His<sup>azwj</sup> Rasool<sup>saww</sup> regarding the Wilayah of his<sup>saww</sup> successor<sup>asws</sup>, as a hypocrite, and Made the one who rejects the Imamate of his<sup>saww</sup> successor<sup>asws</sup> like the one who rejects Muhammad<sup>saww</sup>, and the Quran was Revealed with that. So He<sup>azwj</sup> Said: “O Muhammad<sup>saww</sup>! <span class=\"ibTxt\">[63:1] When the hypocrites come to you, </span>with the Wilayah of Ali<sup>asws</sup> <span class=\"ibTxt\">they say: We testify that you are Rasool-Allah; and Allah knows that you are His Rasool, and Allah Testifies that the hypocrites </span>with the Wilayah of Ali<sup>asws</sup>,<span class=\"ibTxt\"> are liars [63:2] They are making their oaths to be a cover, and thus turning away from Allah's Way</span>, and Allah<sup>azwj</sup> Way, it is the successor<sup>asws</sup>. <span class=\"ibTxt\">surely evil is that which they are doing</span>. That is because they are believing in your<sup>saww</sup> Messenger-ship and are disbelieving in the Wilayah of your<sup>saww</sup> successor<sup>asws</sup>. <span class=\"ibTxt\">Thus a seal is set upon their hearts so that they do not understand</span>. ",
            "I said, ‘What is the meaning of ‘<span class=\"ibTxt\">they do not understand</span>’?’ He<sup>asws</sup> said: ‘He<sup>azwj</sup> is Saying: “They do not understand your<sup>saww</sup> Prophet-hood”’. I said, ‘<span class=\"ibTxt\">[63:5] And when it is said to them: Come, the Messenger of Allah will ask forgiveness for you</span>. He<sup>asws</sup> said: ‘And when it is said to them: ‘Return to the Wilayah of Ali<sup>asws</sup>, the Prophet<sup>saww</sup> would seek Forgiveness for you all for your sins <span class=\"ibTxt\">they turn back their heads</span>. Allah<sup>azwj</sup> Said: “And you will see them blocking from the Wilayah of Ali<sup>asws</sup>, <span class=\"ibTxt\">while they are big with arrogance</span> over it. ",
            "Then the Words of Allah<sup>azwj</sup> Turned by his<sup>as</sup> understanding with them, so He<sup>azwj</sup> Said <span class=\"ibTxt\">[63:6] It is Alike to them whether you seek Forgiveness for them or do not seek Forgiveness for them; Allah will never Forgive them; surely Allah does not guide the transgressing people</span>. He<sup>azwj</sup> is Saying: “The ones unjust to your<sup>saww</sup> successor<sup>asws</sup>”’.",
            "I said, ‘<span class=\"ibTxt\">[67:22] Is the one who goes prone upon his face better guided or he who walks upright upon a Straight Path?</span>’ He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Struck an example of the one who is guided away from the Wilayah of Ali<sup>asws</sup> to be like the one who falls prone upon his face, having no guidance for his affairs, whereas (Allah<sup>azwj</sup>) Made the one who follows him<sup>asws</sup> as walking upright upon the Straight Path, and the Straight Path is Amir Al-Momineen<sup>asws</sup>’. ",
            "He (the narrator) said, ‘I said, ‘<span class=\"ibTxt\">[69:40] Most surely, it is the Word of an Honoured Messenger</span>’. He<sup>asws</sup> said: ‘It Means Jibraeel<sup>as</sup>, from Allah<sup>azwj</sup>, regarding the Wilayah of Ali<sup>asws</sup>’. I said, ‘<span class=\"ibTxt\">[69:41] And it is not the word of a poet; little it is that you believe</span>’. He<sup>asws</sup> said: ‘They are saying that Muhammad<sup>saww</sup> is a liar upon his<sup>saww</sup> Lord<sup>azwj</sup>, and Allah<sup>azwj</sup> did not Command him<sup>saww</sup> with this regarding Ali<sup>asws</sup>. So Allah<sup>azwj</sup> Revealed Quran due to that, so He<sup>azwj</sup> Said: “The Wilayah of Ali<sup>asws</sup> <span class=\"ibTxt\">[69:43] It is a Revelation from the Lord of the Worlds [69:44] And if he had fabricated against Us some of the sayings, [69:45] We would certainly have seized him by the right hand, [69:46] Then We would certainly have cut off his aorta (vein)</span>.",
            "Then the Speech turned, so He<sup>azwj</sup> Said<span class=\"ibTxt\"> [69:48] And it, </span>the Wilayah of Ali<sup>asws</sup>, <span class=\"ibTxt\">is a Reminder for the pious. [69:49] And We know that some of you are beliers. [69:50] And it </span>the Wilayah of Ali<sup>asws</sup> <span class=\"ibTxt\">is a regret to the unbelievers. [69:51] And most surely it</span>, the Wilayah, <span class=\"ibTxt\">is the true certainty [69:52] So Glorify the Name of your Lord, the Magnificent</span>. He<sup>azwj</sup> is Saying that you should thank your Lord<sup>azwj</sup> the Magnificent Who Gave you this Grace’. ",
            "I said, ‘<span class=\"ibTxt\">[72:13] And that when we heard the guidance, we believed in </span>it’. He<sup>asws</sup> said: ‘The Guidance is the Wilayah.<span class=\"ibTxt\"> So whoever believes </span>in the Wilayah of his <span class=\"ibTxt\">Lord, he should neither fear loss nor Punishment</span>’. I said, ‘Revelation?’ He<sup>asws</sup> said: ‘(sure) without Explanation’. ",
            "I said, ‘His<sup>azwj</sup> Words <span class=\"ibTxt\">[72:21] Say: I do not control for you evil or good</span>’. He<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> called the people to the Wilayah of Ali<sup>asws</sup>. So the Qureysh gathered to him<sup>saww</sup> and they said, ‘O Muhammad<sup>saww</sup>! Excuse us from this!’ So Rasool-Allah<sup>saww</sup> said to them: ‘This is to Allah<sup>azwj</sup>, it isn’t to me<sup>saww</sup>’. So they accused him<sup>saww</sup> and exited from his<sup>saww</sup> presence. ",
            "Thus, Allah<sup>azwj</sup> Revealed <span class=\"ibTxt\">[72:21] Say: I do not control for you evil or good [72:22] Say: Surely no one can protect me against Allah, nor can I find besides Him any place of refuge: [72:23] It is a Preaching from Allah and His Message regarding Ali</span><sup class=\"ibTxt\">asws</sup>’. <span style=\"text-decoration: underline\">I said, ‘This is Revelation?’ He</span><sup style=\"text-decoration: underline\">asws</sup><span style=\"text-decoration: underline\"> said: ‘Yes’</span>. Then he<sup>asws</sup> said: ‘An emphasis - <span class=\"ibTxt\">and whoever disobeys Allah and His Rasool </span>regarding the Wilayah of Ali<sup>asws</sup><span class=\"ibTxt\"> surely he shall have the fire of Hell to abide therein for ever</span>’. ",
            "I said, ‘<span class=\"ibTxt\">[72:24] Until when they see what they are threatened with, then shall they know who is weaker in helpers and fewer in number</span>. (He<sup>asws</sup> said): ‘It Means by that Al-Qaim<sup>asws</sup> and his<sup>asws</sup> helpers’. ",
            "I said, ‘<span class=\"ibTxt\">[73:10] And bear patiently at what they are saying</span>’. He<sup>asws</sup> said: ‘(What) they are saying regarding you<sup>saww</sup> <span class=\"ibTxt\">and avoid them with a becoming avoidance</span>. <span class=\"ibTxt\">[73:11] And leave to Me</span><span class=\"iTxt\">, </span><span class=\"ibTxt\">O Muhammad</span><sup class=\"ibTxt\">saww</sup><span class=\"ibTxt\">, the beliers of your successor, the possessors of ease and plenty, and respite them a little</span>’. <span style=\"text-decoration: underline\">I said, ‘This is Revelation?’ He</span><sup style=\"text-decoration: underline\">asws</sup><span style=\"text-decoration: underline\"> said: ‘Yes’</span>. ",
            "I said, ‘<span class=\"ibTxt\">[74:31] that those who have been Given the Book may be certain</span>’. He<sup>asws</sup> said: ‘That they would become convinced that Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup> and his<sup>saww</sup> successor<sup>asws</sup> are true’. I said, ‘<span class=\"ibTxt\">and those who believe may increase in faith</span>’. He<sup>asws</sup> said: ‘And they would be increased in faith of the Wilayah of the successor<sup>asws</sup>’. I said, ‘<span class=\"ibTxt\">and those who have been Given the Book and the believers may not doubt</span>’. He<sup>asws</sup> said: ‘In the Wilayah of Ali<sup>asws</sup>’. I said, ‘What is this doubt?’ He<sup>asws</sup> said: ‘It Means by that the People of the Book and the Momineen whom Allah<sup>azwj</sup> Mentioned, so He<sup>azwj</sup> Said: “And they shall not be doubting regarding the Wilayah”. ",
            "I said, ‘<span class=\"ibTxt\">and this is naught but a reminder to the humans</span>’. He<sup>asws</sup> said: ‘Yes, the Wilayah of Ali<sup>asws</sup>’. I said, ‘<span class=\"ibTxt\">[74:35] Surely it is one great</span>’. He<sup>asws</sup>: ‘The Wilayah’. I said, ‘<span class=\"ibTxt\">[74:37] To him among you who wishes to go forward or remain behind</span>’. He<sup>asws</sup> said: ‘The one who goes forward to our<sup>asws</sup> wilayah would remain away from ‘<span class=\"iTxt\">Saqar’ </span>(a valley of Hell), but the one who remains behind from us<sup>asws</sup>, would go towards the <span class=\"iTxt\">Saqar </span><span class=\"ibTxt\">[74:39] Except the people of the right hand</span>’. He<sup>asws</sup> said: ‘They, by Allah<sup>azwj</sup>, are our<sup>asws</sup> Shias’. ",
            "I said, ‘<span class=\"ibTxt\">[74:43] They shall say: We were not of those who sent Prayed (Musalleen)</span>’. He<sup>asws</sup> said: ‘(They are saying), ‘We did not (have) the Wilayah of the successor<sup>asws</sup> of Muhammad<sup>saww</sup> and the successors<sup>asws</sup> from after him<sup>asws</sup>, nor did we send <span class=\"iTxt\">Salawat</span> upon them<sup>asws</sup>’. I said, ‘<span class=\"ibTxt\">[74:49] What is then the matter with them, that they turn away from the admonition?</span>’ He<sup>asws</sup> said: ‘(Turning away) from the Wilayah ‘. I said, ‘<span class=\"ibTxt\">[74:54] Nay! it is surely a admonition</span>’. He<sup>asws</sup> said: ‘The Wilayah’. ",
            "I said, ‘His<sup>azwj</sup> Words <span class=\"ibTxt\">[76:7] They fulfil vows</span>’. He<sup>asws</sup> said: ‘Fulfilling the vows which Allah<sup>azwj</sup> Took upon them regarding the Covenant, of our<sup>asws</sup> Wilayah’. ",
            "I said, ‘<span class=\"ibTxt\">[76:23] Surely We Ourselves have Revealed the Quran to you Revealing (it) gradually</span>’. He<sup>asws</sup> said: ‘By the Wilayah of Ali<sup>asws</sup> (to be Revealed) gradually’. I said, ‘This is Revelation?’ He<sup>asws</sup> said: ‘Yes, that is explanation’. I said, ‘<span class=\"ibTxt\">[76:29] Surely this is a Reminder</span>’. He<sup>asws</sup> said: ‘The Wilayah’. I said ‘<span class=\"ibTxt\">[76:31] He Makes whom He pleases to enter into His Mercy</span>’. He<sup>asws</sup> said: ‘Into our<sup>asws</sup> Wilayah, <span class=\"ibTxt\">and (as for) the unjust, He has prepared for them a painful Chastisement</span>. Have you not seen that Allah<sup>azwj</sup> is Saying <span class=\"ibTxt\">[2:57] and they were not unjust to Us but they were unjust to themselves</span>? ",
            "He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> is more Honourable and more Benevolent than that He<sup>azwj</sup> should be unjust or link Himself to an injustice, but Allah<sup>azwj</sup> Mingled us<sup>asws</sup> with Himself<sup>saww</sup>, so He<sup>azwj</sup> Declares the injustice to us<sup>asws</sup> as being injustice to Him<sup>azwj</sup>, and our<sup>asws</sup> Wilayah as being His<sup>azwj</sup> Wilayah. Then He<sup>azwj</sup> Revealed Quran upon His<sup>azwj</sup> Prophet<sup>saww</sup> with that, so He<sup>azwj</sup> Said <span class=\"ibTxt\">[2:57] and they were not unjust to Us but they were unjust to themselves</span>’. I said, ‘This is Revelation?’ He<sup>asws</sup> said: ‘Yes’. ",
            "I said, ‘<span class=\"ibTxt\">[77:15] Woe on that day to the beliers</span>’. He<sup>asws</sup> said: ‘He<sup>azwj</sup> is Saying: “O Muhammad<sup>saww</sup>, Woe be unto the beliers of what I<sup>azwj</sup> Revealed unto you<sup>saww</sup> from the Wilayah of Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>. <span class=\"iTxt\">[</span><span class=\"ibTxt\">77:16] Did We not destroy the former ones? [77:17] Then did We follow them up with later ones</span>. The former ones are those who belied the Rasools<sup>as</sup> with regards to obedience of the succesors<sup>as</sup>. <span class=\"ibTxt\">[77:18] Even thus shall We deal with the guilty</span>. The ones who are guilty to the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> and did from his<sup>saww</sup> successor<sup>asws</sup> what they did’. ",
            "I said, ‘<span class=\"ibTxt\">[77:41] Surely, those who guard (against evil)</span>’. He<sup>asws</sup> said: ‘Us<sup>asws</sup>, by Allah<sup>asws</sup>, and our<sup>asws</sup> Shias. There isn’t anyone upon the Religion of Ibrahim<sup>as</sup> apart from us, and the rest of the people are away from it’. ",
            "I said, ‘<span class=\"ibTxt\">[78:38] The Day on which the Spirit and the Angels shall stand in ranks; they shall not speak </span>– the Verse’. He<sup>asws</sup> said: ‘We<sup>asws</sup>, by Allah<sup>azwj</sup> are <span class=\"ibTxt\">he whom the Beneficent Allah permits and who speaks the right thing</span>’. I said, ‘What will you<sup>asws</sup> be saying when you<sup>asws</sup> will be speaking?’ He<sup>asws</sup> said: ‘We<sup>asws</sup> would Praise our<sup>asws</sup> Lord<sup>azwj</sup>, and we<sup>asws</sup> would send <span class=\"iTxt\">Salawat</span> upon our<sup>asws</sup> Prophet<sup>saww</sup>, and we<sup>asws</sup> would intercede for our<sup>asws</sup> Shias. So, our<sup>asws</sup> Lord<sup>azwj</sup> will not be Preventing us<sup>asws</sup>’. ",
            "I said, ‘<span class=\"ibTxt\">[83:7] Nay! most surely the record of the wicked is in the Sijjeen</span>’. He<sup>asws</sup> said: ‘They are those who were wicked with regards to the rights of the Imams<sup>asws</sup> and they transgressed against them<sup>asws</sup>’. ",
            "I said, ‘<span class=\"ibTxt\">[83:17] Then shall it be said: This is what you gave the lie to</span>’. He<sup>asws</sup> said: ‘Meaning, (belying) Amir Al-Momineen<sup>asws</sup>’. I said, ‘This is Revelation?’ He<sup>asws</sup> said: ‘Yes’."
          ]
        }
      },
      {
        "index": 1173,
        "local_index": 92,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:108:92",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنِ الْحُسَيْنِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ أَعْرَضَ عَنْ ذِكْرِي فَإِنَّ لَهُ مَعِيشَةً ضَنْكاً قَالَ يَعْنِي بِهِ وَلَايَةَ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) ",
          "قُلْتُ وَ نَحْشُرُهُ يَوْمَ الْقِيامَةِ أَعْمى قَالَ يَعْنِي أَعْمَى الْبَصَرِ فِي الْآخِرَةِ أَعْمَى الْقَلْبِ فِي الدُّنْيَا عَنْ وَلَايَةِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ وَ هُوَ مُتَحَيِّرٌ فِي الْقِيَامَةِ يَقُولُ لِمَ حَشَرْتَنِي أَعْمى وَ قَدْ كُنْتُ بَصِيراً قالَ كَذلِكَ أَتَتْكَ آياتُنا فَنَسِيتَها قَالَ الْآيَاتُ الْأَئِمَّةُ ( عليهم السلام ) فَنَسِيتَها وَ كَذلِكَ الْيَوْمَ تُنْسى يَعْنِي تَرَكْتَهَا وَ كَذَلِكَ الْيَوْمَ تُتْرَكُ فِي النَّارِ كَمَا تَرَكْتَ الْأَئِمَّةَ ( عليهم السلام ) فَلَمْ تُطِعْ أَمْرَهُمْ وَ لَمْ تَسْمَعْ قَوْلَهُمْ ",
          "قُلْتُ وَ كَذلِكَ نَجْزِي مَنْ أَسْرَفَ وَ لَمْ يُؤْمِنْ بِآياتِ رَبِّهِ وَ لَعَذابُ الْآخِرَةِ أَشَدُّ وَ أَبْقى قَالَ يَعْنِي مَنْ أَشْرَكَ بِوَلَايَةِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) غَيْرَهُ وَ لَمْ يُؤْمِنْ بِآيَاتِ رَبِّهِ وَ تَرَكَ الْأَئِمَّةَ مُعَانَدَةً فَلَمْ يَتَّبِعْ آثَارَهُمْ وَ لَمْ يَتَوَلَّهُمْ",
          "قُلْتُ اللَّهُ لَطِيفٌ بِعِبادِهِ يَرْزُقُ مَنْ يَشاءُ قَالَ وَلَايَةُ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) قُلْتُ مَنْ كانَ يُرِيدُ حَرْثَ الْآخِرَةِ قَالَ مَعْرِفَةُ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) وَ الْأَئِمَّةِ نَزِدْ لَهُ فِي حَرْثِهِ قَالَ نَزِيدُهُ مِنْهَا قَالَ يَسْتَوْفِي نَصِيبَهُ مِنْ دَوْلَتِهِمْ وَ مَنْ كانَ يُرِيدُ حَرْثَ الدُّنْيا نُؤْتِهِ مِنْها وَ ما لَهُ فِي الْآخِرَةِ مِنْ نَصِيبٍ قَالَ لَيْسَ لَهُ فِي دَوْلَةِ الْحَقِّ مَعَ الْقَائِمِ نَصِيبٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Salma Bin Al Khattab, from Al Husayn Bin Abdul Rahman, from Ali Bin Abu Hamza, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[20:124] And whoever ignores My Guidance will live a woeful life</span>. He<sup>asws</sup> said: ‘It Means ignoring the Wilayah of Amir Al-Momineen<sup>asws</sup>’. ",
            "I said, ‘<span class=\"ibTxt\">and We will Resurrect him on the Day of Judgement, blind</span>?’ He<sup>asws</sup> said: ‘It Means blind of vision in the Hereafter, and blind of the heart in the world from the Wilayah of Amir Al-Momineen<sup>asws</sup>. And he would be confused on the Day of Judgment <span class=\"ibTxt\">[20:125] He shall say: Lord! Why have You Resurrected me blind and I was a seeing one beforehand? [20:126] He will say: Even so, Our Signs came to you</span>. The Signs are the Imams<sup>asws</sup>,<span class=\"ibTxt\"> but you forgot them; even thus shall you be Forsaken this Day</span>. You forgot, meaning neglected them<sup>asws</sup>, and similarly you will be neglected in the Fire just as you neglected the Imams<sup>asws</sup>. So you did not obey their<sup>asws</sup> orders and did not listen to their<sup>asws</sup> speech’.",
            "I said, ‘<span class=\"ibTxt\">[20:127] And thus do We Recompense him who is extravagant and does not believe in the Signs of his Lord, and the Punishment of the Hereafter is severer and more lasting</span>’. He<sup>asws</sup> said: ‘It Means the one who associates with the Wilayah of Amir Al-Momineen<sup>asws</sup> someone else, and does not believe in the Signs of his Lord<sup>azwj</sup>, and deliberately neglects the Imams<sup>asws</sup>. So he neither follows their<sup>asws</sup> Ahadeeth, nor acknowledges their<sup>asws</sup> Wilayah’. ",
            "I said, ‘<span class=\"ibTxt\">[42:19] Allah is Gentle to His servants; He Gives sustenance to whom He Desires to</span>’. He<sup>asws</sup> said: ‘Wilayah of Amir Al-Momineen<sup>asws</sup>’. I said, ‘<span class=\"ibTxt\">[42:20] Whoever desires the gain of the Hereafter</span>’. He<sup>asws</sup> said: ‘Recognition of Amir Al-Momineen<sup>asws</sup> and the Imams<sup>asws</sup>, <span class=\"ibTxt\">We will give him more of that gain</span>. He<sup>asws</sup> said: ‘We<sup>azwj</sup> shall Increase him from it’. He<sup>asws</sup> said: ‘He would be fulfilled his share from their<sup>asws</sup> government.<span class=\"ibTxt\"> and whoever desires the gain of this world, We give him of it, and in the Hereafter he has no portion</span>. He<sup>asws</sup> said: ‘There wouldn’t be a share for him, in the government of the truth along with Al-Qaim<sup>asws</sup>’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:108",
  "kind": "verse_list"
}