{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 109"
        },
        "path": "/books/al-kafi:1:4:109",
        "titles": {
          "ar": "باب فِيهِ نُتَفٌ وَ جَوَامِعُ مِنَ الرِّوَايَةِ فِي الْوَلَايَةِ",
          "en": "Chapter 109 – In it are pointers and the concise from the reports regarding the Wilayah"
        }
      }
    ],
    "index": 167,
    "local_index": 109,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 110"
        },
        "path": "/books/al-kafi:1:4:110",
        "titles": {
          "ar": "باب فِي مَعْرِفَتِهِمْ أَوْلِيَاءَهُمْ وَ التَّفْوِيضِ إِلَيْهِمْ",
          "en": "Chapter 110 – Regarding their<sup>asws</sup> recognising their<sup>asws</sup> friends and the Authorisation to them<sup>asws</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 108"
        },
        "path": "/books/al-kafi:1:4:108",
        "titles": {
          "ar": "باب فِيهِ نُكَتٌ وَ نُتَفٌ مِنَ التَّنْزِيلِ فِي الْوَلَايَةِ",
          "en": "Chapter 108 – Points and pickings from the Revelation regarding the Wilayah"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:109",
    "titles": {
      "ar": "باب فِيهِ نُتَفٌ وَ جَوَامِعُ مِنَ الرِّوَايَةِ فِي الْوَلَايَةِ",
      "en": "Chapter 109 – In it are pointers and the concise from the reports regarding the Wilayah"
    },
    "verse_count": 9,
    "verse_start_index": 1173,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (160/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1174,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:109:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَعْقُوبَ</span> الْكُلَيْنِيُّ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ وَ عَلِيِّ بْنِ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ بُكَيْرِ بْنِ أَعْيَنَ قَالَ كَانَ أَبُو جَعْفَرٍ ( عليه السلام ) يَقُولُ إِنَّ اللَّهَ أَخَذَ مِيثَاقَ شِيعَتِنَا بِالْوَلَايَةِ وَ هُمْ ذَرٌّ يَوْمَ أَخَذَ الْمِيثَاقَ عَلَى الذَّرِّ وَ الْإِقْرَارَ لَهُ بِالرُّبُوبِيَّةِ وَ لِمُحَمَّدٍ ( صلى الله عليه وآله ) بِالنُّبُوَّةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yaqoub Al Kulayni, from Muhammad Bin Al Hassan, and Ali Bin Muhammad, from Sahl Bin Ziyad, from Ibn Mahboub, from Ibn Qaib, from Bukeyr Bin Ayn who said, ",
            "‘Abu Ja’far<sup>asws</sup> was saying: ‘Allah<sup>azwj</sup> Took the Covenant of our<sup>asws</sup> Shias with the Wilayah, and they were particles on the Day the Covenant was Taken upon the particles, and the acknowledgment to Him<sup>azwj</sup> of the Lordship, and to Muhammad<sup>saww</sup> with the Prophet-hood’."
          ],
          "en.sarwar": [
            " 1. Muhammad ibn ya‘qub al-Kulayni has narrated from Muhammad ibn al-Hassan and Ali ibn Muhammad from Sahl ibn Ziyad from ibn Mahbub from ibn Al-Ri’ab from Bukayr ibn ‘A‘yan who has said the following. “Abu Ja‘far (a.s.) used to say, “Allah made our Shi‘a (followers) to acknowledge our Wilaya Leadership with Divine Authority) when they were only in the realm of small particles. It was the day when Allah made the small particles to acknowledge Him as the Lord and Muhammad (s.a) as His prophet.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/161)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1175,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:109:2",
        "relations": {
          "Mentions": [
            "/books/quran:10:74",
            "/books/quran:43:87"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ الْجَعْفَرِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) وَ عَنْ عُقْبَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ اللَّهَ خَلَقَ الْخَلْقَ فَخَلَقَ مَا أَحَبَّ مِمَّا أَحَبَّ وَ كَانَ مَا أَحَبَّ أَنْ خَلَقَهُ مِنْ طِينَةِ الْجَنَّةِ وَ خَلَقَ مَا أَبْغَضَ مِمَّا أَبْغَضَ وَ كَانَ مَا أَبْغَضَ أَنْ خَلَقَهُ مِنْ طِينَةِ النَّار ثُمَّ بَعَثَهُمْ فِي الظِّلَالِ ِ ",
          "فَقُلْتُ وَ أَيُّ شَيْ‏ءٍ الظِّلَالُ قَالَ أَ لَمْ تَرَ إِلَى ظِلِّكَ فِي الشَّمْسِ شَيْ‏ءٌ وَ لَيْسَ بِشَيْ‏ءٍ ثُمَّ بَعَثَ اللَّهُ فِيهِمُ النَّبِيِّينَ يَدْعُونَهُمْ إِلَى الْإِقْرَارِ بِاللَّهِ وَ هُوَ قَوْلُهُ وَ لَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَهُمْ لَيَقُولُنَّ اللَّهُ ",
          "ثُمَّ دَعَاهُمْ إِلَى الْإِقْرَارِ بِالنَّبِيِّينَ فَأَقَرَّ بَعْضُهُمْ وَ أَنْكَرَ بَعْضُهُمْ ثُمَّ دَعَاهُمْ إِلَى وَلَايَتِنَا فَأَقَرَّ بِهَا وَ اللَّهِ مَنْ أَحَبَّ وَ أَنْكَرَهَا مَنْ أَبْغَضَ وَ هُوَ قَوْلُهُ فَما كانُوا لِيُؤْمِنُوا بِما كَذَّبُوا بِهِ مِنْ قَبْلُ ثُمَّ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) كَانَ التَّكْذِيبُ ثَمَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail Bin Bazie, from Salih Bin Uqba, from Abdullah Bin Muhammad Al Ja’fary, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, and from Uqba, from Abu Ja’far<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Created the creatures. So He<sup>azwj</sup> Created whatever He<sup>azwj</sup> Loved from what He<sup>azwj</sup> Loved, and it was so that what He<sup>azwj</sup> Loved, He<sup>azwj</sup> Created from the clay of the Paradise. And He<sup>azwj</sup> Created whatever He<sup>azwj</sup> Hated from what He<sup>azwj</sup> Hated, and it was so that what He<sup>azwj</sup> Hated, He<sup>azwj</sup> Created from the clay of the Fire. Then He<sup>azwj</sup> Sent them into the shadows’. ",
            "So I said, ‘And which thing is ‘the shadows’?’ He<sup>asws</sup> said: ‘Do you not see your own shadow in the sun, it is something, but it isn’t a thing? Then He<sup>azwj</sup> Sent the Prophets<sup>as</sup> among them, calling them to the acknowledgment of Allah<sup>azwj</sup>, and these are His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:43#h87\">[43:87]</a> And if you should ask them who created them, they would certainly say: Allah</span>. ",
            "Then He<sup>azwj</sup> Called them to the acknowledgment with the Prophets<sup>saww</sup>. So some of them acknowledged, and some of them denied. Then He<sup>azwj</sup> Called them to our<sup>asws</sup> Wilayah. So the one who acknowledges it, by Allah<sup>azwj</sup>, is the one whom He<sup>azwj</sup> Loved, and the one who denied it, he is the one whom Allah<sup>azwj</sup> Hated. And these are His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:10#h74\">[10:74]</a> but they would not believe in what they had belied before</span>’. Then Abu Ja’far<sup>asws</sup> said: ‘It was so that the belying was then and there’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Yahya has narrated from from Muhammad ibn al-Husayn from Muhammad ibn ’Isma‘il ibn Bazi‘ from Salih ibn ‘Uqba from ‘Abdallah ibn Muhammad al-Ja‘fari from abu Ja‘far (a.s.) and ‘Uqba from abu Ja‘far (a.s.) who has said the following. “Allah created the creatures. He created whatever He loved from whatever He loved. The most beloved to Him He created from the clay of paradise. He created whatever He disliked from whatever He disliked. Thus, the most disliked to Him He created from the clay of fire. Then He sent them to the shadow.” I asked him, “What is the shadow?” The Imam (a.s.) said, “Have you not seen your own shadow in the sun that when look at it is nothing. Allah then sent to them the prophets who called them to acknowledge Allah as the creator. This is the meaning of His words. “(Muhammad), if you ask them, “Who had created them (idols)?” They will certainly say, “God has created them.. .”? <a href=\"/#/books/quran:43#h87\">[43:87]</a> Then He called them to acknowledge the prophets. Some of them acknowledged and other did not acknowledge. Then He called them to acknowledge our Wilaya. Those whom He loved, by Allah, acknowledged and those whom He disliked did not acknowledge as He has said, “However, how could the people believe what they had previously called lies?. .” <a href=\"/#/books/quran:10#h74\">[10:74]</a> Abu Ja‘far (a.s.) then said, “Refusal to acknowledge was then and there.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالسابق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/164)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1176,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:109:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنْ عَلِيِّ بْنِ سَيْفٍ عَنِ الْعَبَّاسِ بْنِ عَامِرٍ عَنْ أَحْمَدَ بْنِ رِزْقٍ الْغُمْشَانِيِّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ وَلَايَتُنَا وَلَايَةُ اللَّهِ الَّتِي لَمْ يَبْعَثْ نَبِيّاً قَطُّ إِلَّا بِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Salma Bin Al Khattab, from Ali Bin Sayf, from Al Abbas Bin Aamir, from Ahmad Bin Rizq Al Ghumshany, from Muhammad Bin Abdul Rahman, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Our<sup>asws</sup> Wilayah is the Wilayah of Allah<sup>azwj</sup> without which no Prophet<sup>as</sup> has ever been Sent’."
          ],
          "en.sarwar": [
            " 3. Muhammad ibn Yahya has narrated from from Salma ibn al-Khattab from Ali ibn Sayf from al-‘Abbass ibn ‘Amir from Ahmad ibn rizq al-Ghumushani from Muhammad ibn ‘Abd al-Rahman from abu ‘Abdallah (a.s.) who has said the following. “Our Wilaya is the Wilaya of Allah without which no prophet was ever send.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (5/164)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1177,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:109:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ عَبْدِ الْحَمِيدِ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ عَبْدِ الْأَعْلَى قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ مَا مِنْ نَبِيٍّ جَاءَ قَطُّ إِلَّا بِمَعْرِفَةِ حَقِّنَا وَ تَفْضِيلِنَا عَلَى مَنْ سِوَانَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Abdullah Bin Muhammad Bin Isa, from Muhammad Bin Abdul Hameed, from Yunus Bin Yaqoub, from Abdul A’ala who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘There is none from a Prophet<sup>saww</sup> who came except with recognition of our<sup>asws</sup> rights and our<sup>asws</sup> merits over the ones besides us<sup>asws</sup>’."
          ],
          "en.sarwar": [
            " 4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn ’Isma‘il ibn Bazi‘ from Muhammad ibn al-Fudayl from abu al-Sabbah al-Kinani who has said the following. “I heard abu Ja‘far (a.s.) say, “By Allah, in the heavens there are seventy lines of angles. Even if all the inhabitant of earth would try to count them they will not be able to count them. All of these angels acknowledge our Wilaya (Leadership with Divine Authority).”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالسابق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (164/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1178,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:109:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ وَ اللَّهِ إِنَّ فِي السَّمَاءِ لَسَبْعِينَ صَفّاً مِنَ الْمَلَائِكَةِ لَوِ اجْتَمَعَ أَهْلُ الْأَرْضِ كُلُّهُمْ يُحْصُونَ عَدَدَ كُلِّ صَفٍّ مِنْهُمْ مَا أَحْصَوْهُمْ وَ إِنَّهُمْ لَيَدِينُونَ بِوَلَايَتِنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Ismail Bin Bazie, from Muhammad Bin Al Fuzayl, from Abu Al Sabah Al Kinany, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘By Allah<sup>azwj</sup>! In the sky there are seventy rows of Angels. If the inhabitants of the earth, all of them were to gather together to count the number of each row of them, they would not be (able to) count them, and they are (all) having a Religion with our<sup>asws</sup> Wilayah’."
          ],
          "en.sarwar": [
            " 5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from Muhammad ibn al-Fudayl from abu al-Hassan (a.s.) who has said the following. “Wilaya of Ali (a.s.) (Leadership with Divine Authority) is written in all the lines of the prophets. Allah never sent any of His messengers who would not acknowledge the prophet-hood Muhammad (s.a) and Ali (a.s.) as the executor of his will.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (165/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1179,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:109:6",
        "text": [
          "مُحَمَّدٌ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ وَلَايَةُ عَلِيٍّ ( عليه السلام ) مَكْتُوبَةٌ فِي جَمِيعِ صُحُفِ الْأَنْبِيَاءِ وَ لَنْ يَبْعَثَ اللَّهُ رَسُولًا إِلَّا بِنُبُوَّةِ مُحَمَّدٍ ( صلى الله عليه وآله ) وَ وَصِيِّهِ عَلِيٍّ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad, from Ahmad Bin Muhammad, from Ibn Mahboub, from Muhammad Bin Al Fuzayl, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> having said: ‘The Wilayah of Ali<sup>asws</sup> is inscribed in the entirety of the Parchments of the Prophets, and Allah<sup>azwj</sup> never Sent a Rasool<sup>as</sup> or a Prophet<sup>as</sup> except with the Prophet-hood of Muhammad<sup>saww</sup> and Ali<sup>asws</sup>’ as his<sup>saww</sup> Successor<sup>asws</sup>."
          ],
          "en.sarwar": [
            " 6. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn Jumhur who has said that Yunus narrated to him from Hammad ibn ‘Uthman from al-Fudayl ibn yasar from abu Ja‘far (a.s.) who has said the following. “Allah, the Most Majestic, the Most gracious has appointed Ali (a.s.) as a light house between His-self and His creatures. Whoever would recognize him he will be a believer and whoever would not recognize him will be an unbeliever. Those who would be ignorant of him they would be lost. Those who would consider others like would be Mushrik (considering those who do not have any Divine Authority as having Divine Authority). Those who would come with his Wilaya they would be admitted in paradise."
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (165/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1180,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:109:7",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ قَالَ حَدَّثَنَا يُونُسُ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ نَصَبَ عَلِيّاً ( عليه السلام ) عَلَماً بَيْنَهُ وَ بَيْنَ خَلْقِهِ فَمَنْ عَرَفَهُ كَانَ مُؤْمِناً وَ مَنْ أَنْكَرَهُ كَانَ كَافِراً وَ مَنْ جَهِلَهُ كَانَ ضَالًّا وَ مَنْ نَصَبَ مَعَهُ شَيْئاً كَانَ مُشْرِكاً وَ مَنْ جَاءَ بِوَلَايَتِهِ دَخَلَ الْجَنَّةَ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Muhammad Bin Jamhour who said, ‘Yunus narrated to us, from Hammad Bin Usman, from Al Fuzayl Bin Yasaar, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Nominated Ali<sup>asws</sup> as a flag between Him<sup>azwj</sup> and His<sup>azwj</sup> creatures. So the one who recognises him<sup>asws</sup> would be a Momin, and the one who denies him<sup>asws</sup> would be a disbeliever, and the one who is ignorant of him<sup>asws</sup> would be straying, and the one who establishes anything with him<sup>asws</sup> would be an associator (<span class=\"iTxt\">Mushrik</span>), and the one who comes with his<sup>asws</sup> Wilayah would enter the Paradise’."
          ],
          "en.sarwar": [
            " 7. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from al-Washsha’ from ‘Abdallah ibn Sinan from abu Hamza who has said the following. “Iheard abu Ja‘far (a.s.) say, “Ali (a.s.) is a door that Allah has opened. Those who would enter this door will be true believers and those who would go out of it they would unbelievers. Those who would neither go out nor enter they will be of the category about whom Allah has said, “I have a decision to make.” Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from ibn al-Ri’ab from Bukayr ibn ‘A‘yan who has said the following. “Abu Ja‘far (a.s.) would say, “Allah made our Shi‘a to make a covenant to acknowledge our Wilaya (Leadership with Divine Authority) when they were small particles. It was the day when He made all particles to make a covenant to acknowledge Him as the Lord and Muhammad (s.a) as the Prophet. Allah, the Most Majestic, the Most gracious, presented to Muhammad his ’Umma (followers) in clay and they were shadows. He created them from the clay out of which Adam was created. Allah created the spirits of our Shi‘a two thousand years before their bodies were created. He presented them to the Holy Prophet (s.a) and the Messenger of Allah recognized them. Ali (a.s.) recognized and we recognize them by their accent.”"
          ]
        }
      },
      {
        "index": 1181,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:109:8",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي حَمْزَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ إِنَّ عَلِيّاً ( عليه السلام ) بَابٌ فَتَحَهُ اللَّهُ فَمَنْ دَخَلَهُ كَانَ مُؤْمِناً وَ مَنْ خَرَجَ مِنْهُ كَانَ كَافِراً وَ مَنْ لَمْ يَدْخُلْ فِيهِ وَ لَمْ يَخْرُجْ مِنْهُ كَانَ فِي الطَّبَقَةِ الَّذِينَ قَالَ اللَّهُ تَبَارَكَ وَ تَعَالَى لِي فِيهِمُ الْمَشِيئَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla Bin Muhammad, from Al Washha, from Abdullah Bin Sinan, from Abu Hamza who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘Ali<sup>asws</sup> is a door which Allah<sup>azwj</sup> Opened. So the one who enters it would be a Momin, and the one who exits from it would be a disbeliever, and the one who does not enter it and does not exit from it would be in the layer (under a category about) which Allah<sup>azwj</sup> Blessed and High has Said: ‘For Me<sup>azwj</sup>, regarding them, is the (pending) decision’."
          ]
        }
      },
      {
        "index": 1182,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:109:9",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ بُكَيْرِ بْنِ أَعْيَنَ قَالَ كَانَ أَبُو جَعْفَرٍ ( عليه السلام ) يَقُولُ إِنَّ اللَّهَ أَخَذَ مِيثَاقَ شِيعَتِنَا بِالْوَلَايَةِ لَنَا وَ هُمْ ذَرٌّ يَوْمَ أَخَذَ الْمِيثَاقَ عَلَى الذَّرِّ بِالْإِقْرَارِ لَهُ بِالرُّبُوبِيَّةِ وَ لِمُحَمَّدٍ ( صلى الله عليه وآله ) بِالنُّبُوَّةِ ",
          "وَ عَرَضَ اللَّهُ جَلَّ وَ عَزَّ عَلَى مُحَمَّدٍ ( صلى الله عليه وآله ) أُمَّتَهُ فِي الطِّينِ وَ هُمْ أَظِلَّةٌ وَ خَلَقَهُمْ مِنَ الطِّينَةِ الَّتِي خُلِقَ مِنْهَا آدَمُ وَ خَلَقَ اللَّهُ أَرْوَاحَ شِيعَتِنَا قَبْلَ أَبْدَانِهِمْ بِأَلْفَيْ عَامٍ وَ عَرَضَهُمْ عَلَيْهِ وَ عَرَّفَهُمْ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) وَ عَرَّفَهُمْ عَلِيّاً وَ نَحْنُ نَعْرِفُهُمْ فِي لَحْنِ الْقَوْلِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Ibn Raib, from Bukeyr Bin Ayn who said, ",
            "‘Abu Ja’far<sup>asws</sup> was saying: ‘Allah<sup>azwj</sup> Took the Covenant of our<sup>asws</sup> Shias with the Wilayah for us<sup>asws</sup>, and they were particles on the day the Covenant was Taken upon the particles with the acknowledgment to Him<sup>azwj</sup> with the Lordship, and to Muhammad<sup>saww</sup> with the Prophet-hood. ",
            "And Allah<sup>azwj</sup> Majestic and Mighty Presented to Muhammad<sup>saww</sup>, his<sup>saww</sup> community in the clay, and they were shadows. And He<sup>azwj</sup> Created them from the lay from which Adam<sup>as</sup> was created, and Allah<sup>azwj</sup> Created the spirits of our<sup>asws</sup> Shias before their bodies, by two thousand years, and presented them unto him<sup>saww</sup>. And He<sup>azwj</sup> Introduced them to Rasool-Allah<sup>saww</sup>, and Introduced them to Ali<sup>asws</sup>. And we<sup>asws</sup> recognise them in the tone of their speech’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:109",
  "kind": "verse_list"
}