{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 1"
        },
        "path": "/books/al-kafi:1",
        "titles": {
          "ar": "الجزء الأول‏",
          "en": "Volume One"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 110"
        },
        "path": "/books/al-kafi:1:4:110",
        "titles": {
          "ar": "باب فِي مَعْرِفَتِهِمْ أَوْلِيَاءَهُمْ وَ التَّفْوِيضِ إِلَيْهِمْ",
          "en": "Chapter 110 – Regarding their<sup>asws</sup> recognising their<sup>asws</sup> friends and the Authorisation to them<sup>asws</sup>"
        }
      }
    ],
    "index": 168,
    "local_index": 110,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 111"
        },
        "path": "/books/al-kafi:1:4:111",
        "titles": {
          "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>اب مَوْلِدِ النَّبِيِّ</span> ( صلى الله عليه وآله ) وَ وَفَاتِهِ",
          "en": "Chapter 111 – Nazool (Arrival) of the Prophet<sup>saww</sup> and his<sup>saww</sup> demise"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 109"
        },
        "path": "/books/al-kafi:1:4:109",
        "titles": {
          "ar": "باب فِيهِ نُتَفٌ وَ جَوَامِعُ مِنَ الرِّوَايَةِ فِي الْوَلَايَةِ",
          "en": "Chapter 109 – In it are pointers and the concise from the reports regarding the Wilayah"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 4"
        },
        "path": "/books/al-kafi:1:4",
        "titles": {
          "ar": "كِتَابُ الْحُجَّةِ",
          "en": "THE BOOK OF DIVINE AUTHORITY"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:1:4:110",
    "titles": {
      "ar": "باب فِي مَعْرِفَتِهِمْ أَوْلِيَاءَهُمْ وَ التَّفْوِيضِ إِلَيْهِمْ",
      "en": "Chapter 110 – Regarding their<sup>asws</sup> recognising their<sup>asws</sup> friends and the Authorisation to them<sup>asws</sup>"
    },
    "verse_count": 3,
    "verse_start_index": 1182,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (167/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1183,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:110:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ صَالِحِ بْنِ سَهْلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ رَجُلًا جَاءَ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) وَ هُوَ مَعَ أَصْحَابِهِ فَسَلَّمَ عَلَيْهِ ثُمَّ قَالَ لَهُ أَنَا وَ اللَّهِ أُحِبُّكَ وَ أَتَوَلَّاكَ فَقَالَ لَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) كَذَبْتَ قَالَ بَلَى وَ اللَّهِ إِنِّي أُحِبُّكَ وَ أَتَوَلَّاكَ فَكَرَّرَ ثَلَاثاً ",
          "فَقَالَ لَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) كَذَبْتَ مَا أَنْتَ كَمَا قُلْتَ إِنَّ اللَّهَ خَلَقَ الْأَرْوَاحَ قَبْلَ الْأَبْدَانِ بِأَلْفَيْ عَامٍ ثُمَّ عَرَضَ عَلَيْنَا الْمُحِبَّ لَنَا فَوَ اللَّهِ مَا رَأَيْتُ رُوحَكَ فِيمَنْ عُرِضَ فَأَيْنَ كُنْتَ فَسَكَتَ الرَّجُلُ عِنْدَ ذَلِكَ وَ لَمْ يُرَاجِعْهُ .",
          "وَ فِي رِوَايَةٍ أُخْرَى قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كَانَ فِي النَّارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Salih Bin Sahl, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>: ‘A man came over to Amir Al-Momineen<sup>asws</sup>, and he<sup>asws</sup> was with his<sup>asws</sup> companions. So he greeted upon him<sup>asws</sup>, then he said to him<sup>asws</sup>, ‘By Allah<sup>azwj</sup>, I Love you<sup>asws</sup> and acknowledge your<sup>asws</sup> Wilayah’. So Amir Al-Momineen<sup>asws</sup> said to him: ‘You are lying!’ He said, ‘Yes, by Allah<sup>azwj</sup>, I do love you<sup>asws</sup> and acknowledge your<sup>asws</sup> Wilayah’. And he re-iterated thrice. ",
            "So Amir Al-Momineen<sup>asws</sup> said to him: ‘You are lying! You are not as you are saying to be. Allah<sup>azwj</sup> Created the spirits before the bodies by two thousand years. Then He<sup>azwj</sup> Presented to us<sup>asws</sup> those who love us<sup>asws</sup>. So, by Allah<sup>azwj</sup>, I<sup>asws</sup> did not see your Spirit among the ones who were Presented. So where were you?’ So the man was silent during that and did not respond to him<sup>asws</sup>’. ",
            "And in another report, Abu Abdullah<sup>asws</sup> said: ‘He was in the Fire’."
          ],
          "en.sarwar": [
            " In an other hadith it is said that abu ‘Abdallah (a.s.) said, “He was in thefire.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (167/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1184,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:110:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ عَمَّارِ بْنِ مَرْوَانَ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّا لَنَعْرِفُ الرَّجُلَ إِذَا رَأَيْنَاهُ بِحَقِيقَةِ الْإِيمَانِ وَ حَقِيقَةِ النِّفَاقِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Amro Bin Maymoun, from Ammar Bin Marwan, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘We<sup>asws</sup> tend to recognise the man when we<sup>asws</sup> see him by the reality of the <span class=\"iTxt\">Eman</span> and the reality of the hypocrisy’."
          ],
          "en.sarwar": [
            " 2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hassan ibn Sa‘id from ‘Amr ibn Maymun from ‘Ammar ibn Marwan from Jabir from abu Ja‘far (a.s.) who has said the following. “We know men when we see them through the reality of faith and the reality of hypocrisy.”"
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالحسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (168/ 5)",
          "Shaykh Baqir al-Behbudi: <span>ضعيف</span> - Sahih al-Kafi"
        ],
        "index": 1185,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:1:4:110:3",
        "refs": {
          "Quran": [
            "/books/quran:15:76",
            "/books/quran:15:75",
            "/books/quran:38:39",
            "/books/quran:30:22"
          ]
        },
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ وَ مُحَمَّدُ بْنُ يَحْيَى عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنْ عُبَيْسِ بْنِ هِشَامٍ عَنْ عَبْدِ اللَّهِ بْنِ سُلَيْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الْإِمَامِ فَوَّضَ اللَّهُ إِلَيْهِ كَمَا فَوَّضَ إِلَى سُلَيْمَانَ بْنِ دَاوُدَ فَقَالَ نَعَمْ وَ ذَلِكَ أَنَّ رَجُلًا سَأَلَهُ عَنْ مَسْأَلَةٍ فَأَجَابَهُ فِيهَا وَ سَأَلَهُ آخَرُ عَنْ تِلْكَ الْمَسْأَلَةِ فَأَجَابَهُ بِغَيْرِ جَوَابِ الْأَوَّلِ ثُمَّ سَأَلَهُ آخَرُ فَأَجَابَهُ بِغَيْرِ جَوَابِ الْأَوَّلَيْنِ ثُمَّ قَالَ هذا عَطاؤُنا فَامْنُنْ أَوْ أَعْطِ بِغَيْرِ حِسابٍ وَ هَكَذَا هِيَ فِي قِرَاءَةِ عَلِيٍّ ( عليه السلام ) ",
          "لَ قُلْتُ أَصْلَحَكَ اللَّهُ فَحِينَ أَجَابَهُمْ بِهَذَا الْجَوَابِ يَعْرِفُهُمُ الْإِمَامُ قَالَ سُبْحَانَ اللَّهِ أَ مَا تَسْمَعُ اللَّهَ يَقُولُ إِنَّ فِي ذلِكَ لَآياتٍ لِلْمُتَوَسِّمِينَ وَ هُمُ الْأَئِمَّةُ وَ إِنَّها لَبِسَبِيلٍ مُقِيمٍ لَا يَخْرُجُ مِنْهَا أَبَداً",
          "قَا ثُمَّ قَالَ لِي نَعَمْ إِنَّ الْإِمَامَ إِذَا أَبْصَرَ إِلَى الرَّجُلِ عَرَفَهُ وَ عَرَفَ لَوْنَهُ وَ إِنْ سَمِعَ كَلَامَهُ مِنْ خَلْفِ حَائِطٍ عَرَفَهُ وَ عَرَفَ مَا هُوَ إِنَّ اللَّهَ يَقُولُ وَ مِنْ آياتِهِ خَلْقُ السَّماواتِ وَ الْأَرْضِ وَ اخْتِلافُ أَلْسِنَتِكُمْ وَ أَلْوانِكُمْ إِنَّ فِي ذلِكَ لَآياتٍ لِلْعالِمِينَ وَ هُمُ الْعُلَمَاءُ فَلَيْسَ يَسْمَعُ شَيْئاً مِنَ الْأَمْرِ يَنْطِقُ بِهِ إِلَّا عَرَفَهُ نَاجٍ أَوْ هَالِكٌ فَلِذَلِكَ يُجِيبُهُمْ بِالَّذِي يُجِيبُهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees and Muhammad Bin Yahya, from Al Hassan Bin Ali Al Kufy, from Ubeys Bin Hisham, from Abdullah Bin Suleyman, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the Imam<sup>asws</sup>. ‘Has Allah<sup>azwj</sup> Authorise to him<sup>asws</sup> just as He<sup>azwj</sup> had Authorised to Suleyman<sup>as</sup> Bin Dawood<sup>as</sup>?’ So he<sup>asws</sup> said: ‘Yes’. And that is, that a man asked him<sup>asws</sup> a question, so he<sup>asws</sup> answered him with regards to it; and another man asked him that very question, so he<sup>asws</sup> answered him with other than the answer of the first one. Then another one asked him<sup>asws</sup>, so he<sup>asws</sup> answered him with other than the answer of the two former ones. Then he<sup>asws</sup> said: ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:38#h39\">[38:39]</a> This is Our Gift, therefore withhold or give out freely without measure</span>; and <span style=\"text-decoration: underline\">like this it is in the recitation of Ali</span><sup style=\"text-decoration: underline\">asws</sup>’.",
            "He (the narrator) said, ‘I said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! So when he<sup>asws</sup> answers them with these answers, does the Imam<sup>asws</sup> understand them?’ He<sup>asws</sup> said: ‘Glory be to Allah<sup>azwj</sup>! Have you not hear Allah<sup>azwj</sup> Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:15#h75\">[15:75]</a> Surely, in this are Signs for those who distinguish (the marks)</span>? And they<sup>asws</sup> are the Imams<sup>asws</sup> <span class=\"ibTxt\"><a href=\"/#/books/quran:15#h76\">[15:76]</a> And surely it is on a road that still abides</span>, not coming out from it, ever!’",
            "He (the narrator) said, ‘Then he<sup>asws</sup> said to me: ‘Yes, the Imam<sup>asws</sup>, when he looks at the man, he<sup>asws</sup> recognises him<sup>asws</sup> and recognises his<sup>asws</sup> colour, and if he<sup>asws</sup> hears his<sup>asws</sup> speech from behind a wall, recognises him and recognises who is he. Allah<sup>azwj</sup> is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:30#h22\">[30:22]</a> And from His Signs is the creation of the skies and the earth and the diversity of your tongues and colours; most surely there are Signs in this for the scholar</span>. And they<sup>asws</sup> are the Scholars. So there isn’t anything from the matters spoken with that he<sup>asws</sup> hears except that he<sup>asws</sup> would recognise it whether he is a saved one or a destroyed one. Therefore, due to that, he<sup>asws</sup> answers them by that which he<sup>asws</sup> answers them with’."
          ],
          "en.sarwar": [
            " 3. Ahmad ibn Idris and Muhammad ibn Yahya havenarrated from al-Hassan ibn Ali al-Kufi from ‘Ubays ibn Hisham from ‘Abdallah ibn Sulayman who has said the following. “I asked abu ‘Abdallah (a.s.) about the Imam. Has Allah made him the in charge of the and in full control (over the affairs of the people) as Sulayman ibn Dawud was?” The Imam (a.s.) said, “Yes, he is given control. It is because a man asked him a question and he gave the answer. Another person asked the same question and he gave him a different answer (although the question was the same). A third person asked him the same question and he gave an answer that was different from both the previous answers. Then he said, “This is Our gift to you so give them away free or keep them as you like.” <a href=\"/#/books/quran:38#h39\">[38:39]</a>. This is charity from us enjoy it with thanks or ( give to others) without being questioned. This is according to Imam Ali’s recitation.” The narrator has said that I said to him, “May Allah grant you well being, when the he gives such answers does the Imam know them?” The Imam (a.s.) said, “Glory belongs to Allah. Have you not heard Allah words? “ In this there is evidence (of the Truth) for the discreet ones. <a href=\"/#/books/quran:15#h75\">[15:75]</a> (Such people are the Imams (a.s.) That town lies on a road which still exists <a href=\"/#/books/quran:15#h76\">[15:76]</a> (It will remain there for ever).” Then The Imam (a.s.) said to me, “Yes, when the Imam look at a person he recognizes him and his color. On hearing his words even from behind the wall he recognizes him and what he is. Allah has said, “Other evidence of His existence are the creation of the heavens and the earth and the differences of languages and colors. In this there is evidence (of the truth) for the worlds (mankind).” <a href=\"/#/books/quran:30#h22\">[30:22]</a> The Imams are the scholars. Whatever they would hear that is spoken they recognize it, the one who has received salvation or one who is destroyed. For this reason they answer them as they answer them.”"
          ]
        }
      }
    ]
  },
  "index": "al-kafi:1:4:110",
  "kind": "verse_list"
}